{"arijet": "Hi Ericka! My name is Asha, I use she/her pronouns, I’m brown (East Indian), queer, a parent to a three year old lil human nugget (using he/him, for now), partner to a non-binary transmasculine teacher (they/them) and my paid work is as a psychiatrist to adults in an outpatient clinic. I’m loving your page and looking forward to learning more and spreading your messages of love and empowerment! ❤️✨🌈", "mukundwa_": "I'm in LOVE with you and Ebony. Seeing your skin deep interview changed my perspective on romantic love. Thank you 🌹✨❤️", "beforeandagain_": "Best intro ever 😆😍💖💖💖💖💖", "mxkingyaa": "I am a #1 @ihartericka fan. Sit down everyone. I am a black, queer, moc, gender non-conforming being currently based in Cape Town working locally and globally asserting respectful and competent wellness spaces for QTGNCNB. I work as a body & gender affirming bodywork therapist, movement specialist, somatic coach, and more recently as a sex and full spectrum doula.", "eighthofthey": "Ahh omg Ericka and Ebony I love you!!! My name is Yami. I use they/them and I’m a latinx faguette! Been following u for a minute and I’m so grateful for everything that you share and educate with us❣️❣️❣️ love everything y’all do and I’m so happy y’all just exist 🔥🔥 and ur Fur BABY IS SOOO FUCKIN CUTE! 🥖 ❤️😍", "thembianaiya": "Well, you know me. I’ve been in hiding for the last four days, because I ran away from home to get off auto-pilot. Echoing everyone else here who’s re-minding you of how brilliant the experience of you walking in your power is to the world. I love you and Ebony so much. TAKE GOOD CARE! 🤗😘😁", "shybuna": "hanna, ethiopian-eri living in Ethiopia and reserving all my monies for travel on the continent. she/her, dec-sag and obsessed with black people everywhere. currently struggling to get through my colonized MPH and positioning my voice / platform. Incredibly grateful to have you and ebony as a resource. the reaffirmation is gold. 🖤", "yung.simbaaa": "I'm Kayo. A sexually fluid, 23 year old, veterinary technology major from Florida. My pronouns are she/her. I have 2 dogs named Gizmo and Pinkie, 2 turtles, 12 fish, and a beardie lizard. I'm a curious, creative, loving, and free spirited August Virgo who is addicted to playing The Sims 😂😂😂", "roze_royze": "Hi Erika with a K", "sensualglow": "Hi Ericka! Love your posts. I’m Guusje, a sex therapist & educator. I’m a white woman with blond hair. Born and raised in The Netherlands. Loving your feed! A big kiss, Guusje ❤️", "gtacat": "Hi I just started following though I saw your talk at the Women's March in 2017 and ahh you and your boos sound so lovely and good to/for each other! I'm Simonne or Sim, a queer non-binary white person but I'm gonna dig into my family roots this Cancer season as I learned a little while ago that my great great grandmother was Métis! I've got a cuddle pup named Lulu/Lu who is too amazing to be Just a dog; probably a creature from deep space, and good rats, a rabbit, and a cockatiel! I'm excited to follow you and learn/unlearn some shit! 😊💕 (and donate money to better than just 'good' causes when I'm no longer a broke student)", "jysbr": "I don’t think I ever knew you were on IG, should’ve of figured as much. What up‼️", "bearly_articulating": "Not sure how I stumbled accross your profile...buuuuttttttt I adored reading your intro and I wanted to let you know that I'm inspired by your work as an educator! As a fellow educator, I am happiest seeing people lighting pathways and demystifying routes. Thanks for what you do!", "finding_nomad": "Sagitario ♐️!! ❤️❤️", "enchanted_chameleon_": "I love your IG! 🙋🏻‍♀️🙋🏻‍♀️ I just randomly found you through tags of interest. I’m Victoria, pansexual but monogamous with my husband. We have 3 beautiful children, 12, 10, 6. 1 who identifies non-binary, 2 who prefer She/her as pronouns at this time. I am a psych nurse by trade, I’ve worked with a large population of children with mental health crises related to gender identity (usually related to not having enough familial and community support). In my spare time, I enjoy my plants, my home, hiking in magical forests, searching for cool rocks and treasures, crystals, home improvement and DIY, anything related to interior design and fashion. Im Wiccan (recovering from Catholicism) and I’m a July “Cancer” and a Cancer through and through. I have Moe who is an orange tabby cat, he is 2.5 and quite a gentleman. Luna is 12 weeks and my intense tuxedo kitty. Lastly, Greta, our German Shepherd who is 5 and identifies as a lap dog. 😂", "goodmoms_badchoices": "Heeeyyy!!! 2 single sex positive black moms exploring our desires, pushing our boundaries, changing the social narrative of what single Motherhood looks like learning and growing along the way. Here to learn happy to have found you both !!!! 💕💗", "jhollidayhealth": "Hi! I love your posts. I'm Jennifer (she/her), white (Macedonian, Danish, Jewish, and a bunch of other stuff), straight, cis, Sept Virgo. Spoiled by the weather in San Diego. Partner to a Japanese-American man; mama to an 18mo AMAB lovebug (Jack) and timeless house panther (Bijou). Always learning and questioning everything! Thank you for being fierce!", "shesgotsoul": "Hey hey! 👋🏾 Danielle. She/They. Black, Cis (though I feel that shifting as I age some, but owning the passing privilege here) Queer (Pan). Raised in Raleigh. Born in Massachusetts. Residing in Syracuse (I cant sit still, story of my life), but also love rest and naps and quiet Chile. ❤️😂 March Pisces. Partner to a cisgender Black man; therapist in college mental health. Your energy is pure, real, HILARIOUS and holds me accountable, but with ease. You have such a calm and ease. Thanks for sharing parts of you with us!", "heronaliciadance": "Hi! I just started following you! My name is Heron and I am a cis white/Italian queer/lesbian anxiety-ridden human who loves cats and dancing and is recently vegan and is about to propose to my badass partner and best friend! I am a dance instructor and bilingual nanny, and a social activist trying to continuously check my privilege and bring joy and strength to my dance community, and to toddlers, through dance and physical activity! ✨ Thank you for what you do and who you are! I can already tell I’m going to love following your sweet queer family!!!", "christinamonti_": "I’m from Adelaide, South Australia! I’m a cis-gender female and I love following you and reading your posts. I think we need to educate more heterosexual people about the differences in society to break down barriers. Keep doing what you’re doing. You’re wonderful 💫💜😘", "simayjoelle": "❤️😫 \"Yes our dog is Black, just light skinned\" 💀 love it", "blake.marchetto": "nobody cares about your pronoun stoopid", "cristalsharris": "Cris, from East Oakland 82nd n Macathur. They/she. Non-binary femme. Fat. Love music, love blackness, love being kind. Law school grad. Researcher. Writer. Program manager. Social media wizard. Dark skinned black person. ❤️ makeup.", "marikvik": "Baguette is a true Aries ♥️", "larbios": "New here today, found you from @swerbookclub and excited to learn more from you!", "morikay": "Why would you make this intro so bomb?!! 😩🤣❤️", "iah_zla": "Hi Ericka! First off I love following you and Eb, you're both pure 🔥. I am a cis gendered, bisexual and biracial woman from the UK (3rd generation Windrush descendant on my mum's side). I am a molecular virologist who has just been offered a PhD position and I'm so excited! I'm a May Taurus (my partner is a December Sagittarius too and oh boy are you difficult, but lots of fun!) so I'm stubborn as hell but it means I get shit done (after procrastinating forever) 😂🖤", "zoeruthy": "A queer/bisexual futch with confused Capriquarius energy and she/her pronouns from Vancouver, Canada who shares many spiritual qualities with my cat Philly. 💫 Thank you for all that you and Ebony do and share with the world!!", "d_hydrated__cronenberg": "That is the most wholesome name for that furball....i fucking love it", "anna.dandridge.testerman": "I'm late, but I'm Anna (she/her) queer femme in Columbus, Ohio. Studying to be a social worker & hope to work with queer Black kids and other kids of color. I'm Black (the lightest of the light-skins) and that doesn't make me pretty, give me \"good\" hair, or any of the other lies that get attached to light-skins. I'm in awe of the work you do and love seeing you and Ebony out here being great. I aspire to the level of badassery you both embody. Now that I have stanned, I thank you for all that you and Ebony do.", "matt.yi": "i'm matt (he/they pronouns), i'm a chinese adoptee, trans masculine, march pisces and i just got a first class masters degree in chemistry 💪🏼 i also have a rabbit called wonton and have owned rabbits for 10 years despite being allergic. I'd love to see you and Eb in real life sometime, so if you're ever in england i'll see you there 🤠", "lianopants": "😍😍😍😍", "amy.abelein": "Hey girl—that’s a whole lotta cute you have in your bed there! I’m Amy, 28, a straight regraded girl from Oregon, currently loving life in sunny Colorado. I’m a May Gemini, and a sensitive, artistic, passionate soul. I work as a nanny and have a deep calling to guide and protect children. Your feed brings me so much joy! The work you are doing in the world, and your unbridled openness are such an inspiration, Ericka 💜", "thisrawsomeveganlife": "“Don’t know pronouns” ❤️❤️ 😂", "other_sider_girl": "I’m Celeste (she/her). Half Mexican white-presenting February Aquarius, all boring but all-in to learn more, be more, and do more. I love the plants and the pups and this account. Thank you ❤️", "thesensualnonconformist": "Hello! I'm Hanna, agender queer human, recently married my queer trans masculine lover (our souls have also met before), libra (both of us), lover of cooking, books, and taking walks. I'm a nerd for sexual education, history, and numbers (especially numerology). I'd love to do yours and Ebony's numerology spread someday with your consent. I feel blessed to be able to follow you on Instagram! Your education is so necessary, and your presence is undeniable. Thank you for calling out bullshit and making all of us white folks feel uncomfortable. It is so important because then we HAVE to check ourselves and question ourselves and what we are participating in. Forever grateful for you and what you share with us. ♥️", "skaterbean": "I am a cishet midwestern 40 year old boring as all get out white woman, mom, and writing and graphic design free-lancer. I Am so thankful for your content both on fighting racial and gender inequity and on your gorgeous life and your amazing relationship with Eb. I have been introduced to so many people and perspectives through your posts, and it is truly changing the way I move in the world with all my privilege. Mostly just here listening, learning, and having real life conversations about the things you teach with the other midwestern white people. Thanks for sharing yourself with the world.", "aweb80": "Hi, I’m Alex (she/her). I’ve been an admirer for a while and have learned so much from you and Ebony. #whatwoulderickado #wwed", "sancho_mcdoodle": "Hello 👋🏽 My name is Jess and I am a queer Latinx person. I present as male and use he/him pronouns but have always felt both male and female in spirt. I am just starting to learn about my indigenous ancestors. I work in San Francisco currently for a furniture showroom helping people with interior design. Thank you for educating me and others. I am learning so much. I am not going to pretend that I fully understand it all. But that’s my work to do. Thank you!", "jordanrcs": "Hey Erika, I dropped you a msg about Ebs book, but where can I get it, that isn't Amazon?", "cisgusted": "I’m Gabby/Rosé (she/they pronouns) Black (descendant of the transatlantic slave trade), queer, nonbinary trans woman (with a beard that i love), mentally ill, educator and resource connector, dragger of many white gays, and May - Taurus♉️. Hi!", "livingrelic": "Hi! My name is Vanessa. I’m a black queer artist still learning and growing. I truly appreciate all that you do and the conversations you ignite! Thank you!", "toerricaishuman": "👋 fellow Erica here (love the way yours is spelled)! Non-binary actor living in NYC, on the ace spectrum and childhood sexual abuse survivor. As a sex educator I'd love to hear your thoughts (if you have any) on sexuality, trauma and asexuality. Have always wondered if my experience is linked. Could really use therapy surrounding it but it's hard to find what I need. Adore you/your account and learning more about inclusivity and how to use my privilege for good. ❤️❤️❤️", "chelsicus": "This is so cute 💖💖", "hoherormomanon": "I’m Frida! Living in a small community in sweden and am working with ppl who have neuropsykological disabilities (not sure if you have the same terms in english) for example autism. I live by the woods with my dog and cat, I’m a taurus. Thank you so much for your work here on Instagram, I constantly learn things.", "seafoto13": "💕💕💕💕💕💕💕", "wulfjphotog": "💜💜💜💜", "maiseym": "Hi Erika, I'm Maeve (she/her) following from Ireland, listening and learning! Thank you 🙌", "dubbalow": "Hi Ericka, Ebony, and Baguette. My name is Korrey. I am a transmasculine being living in the DC area. I am a February Pisces. As of now I am a freelance artist. I mostly draw and paint but also have skill with digital art. I have a 16 year old Fur baby named King Sincere III and he is a schnauzer and a September virgo. Nice to meet you.", "idanissenilsson": "Aaawh, such a sweet family. I'm Ida, from Gothenburg Sweden. I'm cis-gendered, and very privileged (only have to worry about sexism). That is why I am following you, to educate myself (and because I think you kick ass) and learn more. I'm a August Virgo, and studying to become an accountant/financial advisor. Exciting stuff.", "bella1gma": "Sagittarius Rock im one sis 🙏🙌💋 💗💗", "phairhead": "Love following you & yr amazing family! I’m Sue, she/her pronouns, queer libra-Scorpio cusp. I’ve been working in the HIV community for 10 years & I’m a PrEP coordinator and STI educator in Albany, NY. I’ve learned so much from yr insta stories & podcast. 💕", "jubilant_kreyol": "Lovely family 😻😻😻", "heoterry": "Hello from the UK 👋. I’m Holly (she/her), pretty sure I arrived via @nowhitesaviours as I try to figure out all the ways I’ve learned to see the world without really realising it. I have told anyone who will listen about your visit to the 5th graders and had a long talk with myself after watching your yt compliments video. I’m also very into your plant content as I try to keep a growing plant family alive in the home I share with my sister and our friend🌸. Thanks for your work x", "drinkingvessels": "My name is Ben and I'm here to educate myself. I'm a white cisgender man, an artist, and a person looking to expand his world view. Thanks for sharing your content 🙏", "iam_2lebritt2quit": "Baguette always gotta find the perfect lighting...effortlessly 🔥🔥🔥😂😂😂", "kristinajaypee": "‘...and anything you tell her not to do.’ <——-she’s taking her role as child very seriously and proving that the child’s goal to slowly chip away at the parent’s ever loving sense of order is the same across species (from a mom of five) 😂", "littlefirewitch": "i have a march-aries cockapoo too!!!", "themforestfeelings": "Hi, my name is also Erica (minus the k), a queer non-binary dyke from Sweden. I struggle with depression but try to channel it through my art. I like to illustrate and I'd love to get my December Sagittarius ass to complete a whole graphic novel one day. I'm currently studying computer technology and will start a 2 year programming course in the fall. I'd love to become a little less gothy and a lot more dykey version of Lisbeth Salander given half the chance. I just started following you after having multiple people highly recommending your awesome Insta account. So I'm really looking forward to reading more of your posts! Thanks for putting in all the work, you rule! 🌹🍒💕", "kaz.zam": "Cherubs!", "iasikhealingbrujx": "I love y’all! 💫💫💫", "stankygrandma": "I am a transsexual angry dyke! Thanks for your existence!! Love following y’all!", "maryelizatron": "Hiiiiii! I’m Mary (she/her)! Queer fat white cis Aries femme originally from Wyoming but now living in Denver with my partner (non-binary masc dandy babe) and our four fur babies. 🐱🐱🐶🐶. I coach progressive advocacy groups on evidence-based tactics for turning out “New American Majority” (POC, young people, immigrants, etc) voters. I am committed to fighting anti-blackness in my personal and professional life, and I feel like I learn so much and am constantly challenged in my thinking through your work. THANK YOU! 🥰", "laurellu": "Mama to Ayla (3 yo half Turkish ray of f*ckin sunshine). creative director + advocate, she/hers, March/Aries like your fur baby. 💕", "_craycrayshayshay_": "#blackjoy 💜💜💜", "softie._._": "Hiiiii y’all! 💛💛💛", "duh_ree_ann": "Hi Ericka & Ebony! My name is Darian Jale(a)ne. I am a queer Black cis woman, May Taurus, voracious reader & writer/ poet! Currently I volunteer as a gallery assistant & librarian in southern Africa. I occasionally model & collaborate with other artists on conceptual pieces. Hoping one day to be secure, confident & PAID for my evolving craft. You both are teaching me to continue this existence with transparency, accountability & love! Thank you for blessing my tl with all that you share 💚🖤⚡", "mariechristinematthieu": "Hello 💫💫💫I’m Marie-Christine, not black , not queer , not American , April Aries , Swiss lived in the US as a child , plastic surgeon , doing a lot of humanitarian work reconstructing women in Bangladesh, also helping a community of migrant Africans here , created a foundation to help Brest cancer patients and families - now diagnosed with breast cancer 2 weeks ago , getting ready for surgery chemio radiotherapy and the anti hormone treatment but really fine because all my patients , friends and YOU and are such heroins to me . Also very active in the contemporary art field where I have most of my friends . Congratulations on your life , couple , achievements, I am speechless and in total admiration . Take care, you all ♥️♥️♥️", "mimiesq_": "Im still working on the titles, can someone explain to me what queer means? I always thought it was offensive term but have been seeing it a lot lately. Is it just an “I’m on the spectrum” term for non binary people or is the same as pansexual or both? Lastly non binary femme? I don’t get that, is she saying she doesn’t identify as man or woman but looks like a woman? If anyone has the time thanks a lot. Just trying to keep growing to be the best ally I can be.", "_ashleystory": "This is so sweet. I adore the way y’all show up for each other. I’m Ashley, they/she pronouns. Queer white femme, moon witch. November Scorpio. 🖤 Your work is brilliant and constantly keeps me questioning everything I’ve learned. Thank you and your beautiful family for the education, patience, and for being y’all. 🖤🖤🖤🖤", "keelsmillss": "❤️❤️", "sistasdotravel": "✊🏾👈🏾 #BlackonBlack ❤️🖤💚", "berengerdraws": "This is such a cute pic! Ebony is so handsome and Baguette is adorable, this is a truly dangerous combo.", "smarvelous.wanderful": "Hey y’all! I’m Brittany, I prefer only my name, but also use she/her pronouns. I’m a Black queer nonbinary femme, and I’m still figuring out what that last part means to me. And I’m a February Aquarius. I’m working on getting to Yale drama to shake some shit up and learn how to work for more than just myself. Watching you two live and work with such joy, even when you have hard stuff to talk about means so much to mean. Whenever I take a social media break it’s always ends because I can’t go too long with seeing what y’all are up to. I’ve learned so much from you and you have literally helped me keep my sanity while working at a pwi. I have so much love for y’all. Many blessings❣️", "sarahsaska": "I love the love the two of you share and I wish everyone had an Ebony in their corner.", "alysonejohnson": "Hi, I’m Alyson - cishetero, white, lurking-prone, working on a lot of shit every day. Picking apart my thoughts, seeing systemic flaws, trying to listen more than center, and learn and do better. Just finished a second degree (which was a weird way to have a midlife crisis?), this one in political science, and want to get into research. Gemini (through and THROUGH), so grateful to you and Eb, and will never get enough Baguette.💗", "tj_moore": "@teqenza", "hannah_macintyre": "Hi!! I’m Hannah, an 18 year old autistic lesbian with adhd and ptsd! I go by both she and they pronouns. I’m from Canada and am an April Taurus! Im currently moving out on my own for the first time and am heading to college to become a marine biologist! Sharks and plants are my special interests and I even made a whole website on sharks and their importance to the ecosystem as an inquiry project! I currently have 25 plants and plan on getting many many more. I have a service dog named Coco who’s been with me for 5 years now. We don’t know her birthday but she loves eating cat food, going for swims, and squeaky toys!", "fbrusoe": "@ihartericka shalom, I'm Flea, I am also a December Sagittarius Archer 💯!! (She/her) Lesbian spiritual side I am a animal/shaman medicine/communicator. My other side, I am a medical laboratory technician working on my Medical technologist degree in Hematology have that eye for detail !! I love love your style of sexual education I cannot find the word to describe but wish you where my teacher when I was younger ( they never covered stuff you have said). Appreciate your stance/story/advocacy and it reminds me that when not knowing anothers culture, that it's ok to ask.. I hope one day I can hear you speak in person!!! I wanna be an upstander never a bystander!!!", "thismodernidea": "I just want to say thank you for the amazing work you do. It has helped me continue my own education to be an inclusive ally to all communities. I look forward to your stories and posts daily and hope one day to enjoy the blessing of hearing and seeing you speak in public. Thank you ♥️", "beyoncesfirstdaughter": "Hi Dr. Ericka, You’ve become my biggest role model. I wanted to reach out and ask if you ever mentor young folks. If so, can I apply? I can pay whatever rate is required. I’m looking for guidance as a black non-binary femme who also works in sexual health. If you don’t, I sincerely thank you for reading my message. Thank you for all that you do.", "nsou26": "Hi, Ericka and Ebony! My name is Nicole (she/her), and I am a bisexual cisgendered woman. I have a black cat named Leeloo I work in educational publishing as an editor, but my mind and heart are devoted to social justice. I have a lot to learn and much to help undo. You and Ebony are amazing—I watch your stories every day, and I learn so much! Thank you!", "czeed": "Thank you for the work you do! It is priceless", "leigh_jewellery": "I'm a grateful being in this space in yours, born and raised in Montréal and now living in (far more conservative, far whiter) Edmonton, Alberta. I use she/her pronouns and largely fit in the cis woman box. I love to learn and I appreciate the challenges I've encountered in your posts. I think you and Eb are incredible.", "jsoothe": "Love your work. I'm late 50s, white, female (she/they), massage therapist, mother of adult women, daughter of elders in their 90s, Unitarian Universalist, constantly, constantly, constantly learning. My sweet Lily (schnoodle) passed over the Rainbow Bridge in January, and now I volunteer at the Humane Society as a Canine Coach!", "survivormoda.rachel": "How cute is Baguette?? Love seeing your love! ❤️", "cheykpuetz": "I’m Cheyenne, I’m a 22-year-old living in the Midwest, and I just graduated with a BA in English. I’m also an appreciative consumer of all the work you and Ebony put out into the universe, and I just want to thank you for all you do. Sending you, Ebony, Baguette, and all your plant babies good vibes and love💕", "snailgod_": "I’m Leia! second generation greek immigrant living in canada, queer & non binary (they/them) living as a cis woman until i don’t live with my parents anymore 😅 growing up my mother taught at my towns native centre, working with & teaching troubled native youth & helping them reconnect with their culture. since i grew up surrounded by native culture i know a lot about the injustices served to canada’s aboriginal people & am a huge supporter of native rights & reparations, but i don’t know a lot about injustices in america which is why i follow you, to learn !! also i’m a huge advocate for reproductive rights & exploring gender identity :^)", "studiosree": "Thank you for reintroducing yourself and your life. I’ve learned much from following you and it’s definitely opened up dialogue internally and amongst friends. Have a great rest of the week!", "doing_me_drea": "Pronoun she/ we , two spirit, intersexed, pansexual. Capricorn , and yes the solar eclipse whooped my ass dreading the mercury retrograde coming Decedent of slave trade, colonized Indigenous Americans and slavs owner (irish and native American ) I identify as a black woman, student ,I work in the medical field survivor of abuse, protector of my young queer people (fairy queerma) trying to decolonize myself by getting back to my roots with root work", "kales324": "Baguette loving anything you tell them not to do is PEAK Aries behavior 😂😂 Hi I'm K, nonbinary Aries/Pisces cusp w an Aries & Aquarius stellium!💫🌈", "sendyg258": "😍", "kayloverose": "You and Eb were in one of my dreams the other night! And I haven't even met him. Haha You're rocking it as usual and I feel so lucky to be able to learn from you. Thank you for gracing us all (and challenging us all!) with your intelligence, determination, authenticity and low tolerance for bullshit. 😘", "days_of_dean": "Hey, I'm Nadine (she/her), queer MS/HS language educator. I loved the comments here and am now following some cool IG accounts!!", "r_sa1992": "Been following for a long time - thank you for all your labor and for existing!! I’m white, 26, first gen MSW student, able bodied, they/them, work at a disability resource center and intern at a sexual assault resource center, live in Portland OR with my partner Haley, two dogs and cat! Feel so blessed to get to witness you and Eb’s love and to learn so much from y’all!!🙏🏻😭", "freeakanrican": "🔥🔥🔥🔥", "_geralartist_": "Hi I’m Geraldine (They/she) pansexual. Born and raised in Venezuela. Came to the US at 18 years old. I have a puppy, two little girls and a partner. Aquarius . Have learned so much from you and Eb, so thankful for technology that allows us to connect with so many amazing and inspiring people like you. Oh and I’m white and I thought I was less white because of where I was born but I learned real quick how wrong I was, I benefit from the shit system that is in place and I’m doing what I can to continue to educate myself and participate to change things. Thank you 🙏 ❤️", "_hex_libris": "Your intro to you & your lil fam is so cute & I loved it. My name is Ekho, I am a nonbinary trans person (they/them pronouns) a June Gemini, descendant of white convicts & indigenous Australians (this is literally the first time I've written//admitted that & its scary but liberating). I write, I read, I study in academia. I am so glad I'm following you. 🖤🖤🖤", "stoneviewknits": "❤️", "resetrefocus": "Hi Leo agender queer (any and all pronouns)", "cancer_dr": "Loooooooooooove!!!! @ihartericka", "small.craft.advisory": "One of my favorite things about insta is getting to see Black love close-up ❤️ I'm Stef - queer, Black, non-binary & trans, originally from Kansas City and living in Chicago. I'm studying to be a web developer & want to use my coding skills for social justice work. Still figuring that out! I also play bass & drums & have started writing personal essays again!", "bbceno": "Hello you wonderful humans and glorious pup! My name is Brittany (she/her/hers). I’m a cisgendered, Biracial, Latinx (though very White-passing), heterosexual woman. I’m currently going into my last year of grad school for clinical mental health counseling and feel passionate about advocating and increasing access to mental health care for historically marginalized and underserved communities. I’ve been a follower of your account for a while now and I’m so grateful for the knowledge and insight both you and Eb consistently share. 💕👏 Thank you both for all you do!!", "actually_your_mom": "Hi Ericka and Ebony! I'm a cis white and questioning undergrad student (she/her pronouns) currently doing my best to devote my education and future career to decolonization: I've focused my history major in indigenous history and hope to work in law, fighting for indigenous land/water/cultural rights regardless of ability to pay. I want to win cases which may not otherwise reach the courtroom. Your podcast is incredible--I am constantly in awe of y'all and that I have the privilege to listen to you! My partner recently came out as trans so I'm currently also navigating queerness and, in summary, I have a lot to learn in general. From a long-time silent follower/fan, thank you so much for literally everything you do from sex education to decolonized podcasts. (Also Ericka: from bmore! Dad grew up within view of the domino sugars sign)", "large_dj": "Hello!!! My name is DJ and I’m a white, gay, cisgender man (he/him pronouns). I’m 20, a June 1st Gemini ( first day of pride/first day of hurricane season lol). I live in South Alabama, near Mobile. I’m a white person who is unlearning the white supremacy I was raised in, as well as Southern Lost Cause, antebellum racism that I have due to being a Southern (I do love Southern food though and thank the Natives, Latinx, and Africans for it) I follow @ihartericka because she speaks on issues in a way that is understandable, that is thought-provoking, and that is consistently aware of the intersections of marginalization and privilege. I am grateful to her for providing such amazing resources, education, and allowing us into her life, all for free", "ifyouliveforever": "I’m Lindsey. Love and appreciate your work for multiple reasons. I was also recently diagnosed with breast cancer and will be having a BMX at the end of the month, and have appreciated in a way deeper than words how you lead life post-diagnosis. I also work in disability policy and have worked to incorporate lessons learned here in whatever way I can to the business of state government.", "baking_ashes": "Hi, Bailey here, a white, queer, cis-woman just trying to learn more about reparations and how I can use my privilege to empower others. Currently studying Arabic and Spanish and trying to fight neo-colonialism in the Global South day by day. Thank you for all you do 💜.", "popster613": "I’m Emilie, she/her pronouns, cis hetero white woman. I’ve been following your page since December or so and was able to meet you when you came to speak at SF State! I learn so much from you and Ebony and have just recently started listening to your podcast. Y’all are incredible. Thank you for all you do!! I taught sex ed for the first time this past spring, and I’m looking into funding because I’d love to have you come and talk with my middle schoolers!!! ❤❤❤", "quinntillate": "Heyy, thanks for all you do in the world. I’m a white non-binary trans queerdo, and I’m a gender affirming art therapist for queer and trans youth in Minneapolis, MN! I wish I could share with y’all the beauty and cuteness that happens in Gender Exploration Group!", "maureeng88": "Baguette just light skin lol 😝 now that she can go outside she’ll get a little tan hahah", "wacomichalowski": "Hi Ericka! I'm Waco (he/him) bisexual, white, cat-dad of 2. Started following after you stole the show at the Philly women's march in 2017 by being the only person on stage that was making any sense, and holding both the organizers and attendees to account for not centering Black, queer, and trans lives. Having you & your posts in my timeline has been educational, uncomfortable, and inspirational, and I'm truly thankful for all the work that you are doing (for free!) to give anyone who is willing to listen the tools, knowledge, language, and passion to fight against any & all kinds of inequity. Thank you for helping me constantly improve & reevaluate, I hope you never stop 💜", "billiewhitex": "Dying @ \"a black\" 😂💜", "adekemi___": "I absolutely love you!! Okay, fangirl moment over 😂", "allisonbishinsconsulting": "Hi! Thanks for this space and highlighting the edges of these issues... Sometimes I understand something but only in a shallow way and I appreciate you showing the depth of it. She/her, PNW based.", "alexacatdoglizard": "Hi im alexa nd im a disabled white woman but i like the term VPPPP better (very proud pre/post paralyzed person) has a better ring to it. My life consists of work nd work nd grateful days. I have an identical twin who is wonderful nd introduced me to ur account. I thoroughly enjoy every post u have and think u r an incredible educator with the best most honest nd genuine approaches to dismantaling these larger systems at hand, thank u. If ur ever around noe valley, sf i work at that lame ass whole foods in the most gentrified area of sf, right above 24th street bart, swing by i can getcha some stuff! thank u again!", "secundrabeasley": "Thank you for all you and Eb do. My name is Secundra (a variation of the number 2 in Latin). I am a asexual/saphosexual . I am a March Aries. And I am relishing communicating this to you and Eb. I was born and raised in the 60’s and 70’s. I had no way to express what I was until this year. It feel great!!", "retnavijayan": "Hi 👋🏾.", "mollyrae1441": "Hi! I’m Molly. I’m a (boring) white, hetero, cisgender female in a hetero partnership. I’m here to continue to check my privilege and examine/challenge the ways I’m complicit in systemic oppression. I’m also a psychologist who feels strongly about maintaining a social justice framework. I stay out of the dialogue here, having learned this is not my space - and my whiteness certainly wants to be given credit for doing that. Fuck, this stuff runs deep. Thank you for what you do!", "bricosta321": "Hi I’m Briana! A cis gender (she/her) heterosexual Latina woman. I started following your account awhile back to learn more about all the intersections you talked about, since I work in public health with a special focus on marginalized communities. Happy to be here because I always learn something new 😊", "minda_price": "Hi! I’m just someone (An aries haha) (can be annoying because I respond to a lot of your stories) who has a lot to learn and is wanting to learn and is thankful for all that you do! I love not only learning from you, getting uncomfortable when I need to, but love you showcasing all of the queer and poc and of course the companies you love! I also love love love how much you and Eb love each other. You two are so cute and so in love and my mushy heart loves it ! I also love puppies and your baby is soooo cute! OH! And all of the gorgeous plants you love on/have in your pretty house!", "sarsha_kabii": "I’m Sarsha (she/her) I’m an April Aries and I’m just a love is love type person. Being half white (Australian) and half African (Kenyan) has been a real challenge for me up until the last year or so where I’ve been learning to accept and appreciate both sides.. Thank you for all you do to educate us and show us how to accept and love ourselves and others 💜", "meltbot": "I hope to meet y'all someday. I love your love.", "soulwithbeauty": "I love the way Eb stands up for you ( I am sure you do the same for him). Relationship goals 💖", "hayleylujahhh": "Hey Ericka, Ebony & Baguette (and plants!) 💖 You are a such beautiful family! I’m Haylz (she/her) Bisexual, Aquarian, White, petsitter/ small business owner/ novice baker/fairy dog-mother, Aussie girl (and fellow plant and Whitney Houston enthusiast!) 🧚‍♀️🐕🐾 My other half is Sunny (Sarbjeet), a beautiful black man hailing from Punjab India 😍 Our family consists of a massive fluffy black cat, lots of fish and planties 🐈🌱🐠☺️ THANK YOU for all of your energy, time, wisdom, realness, queerness, blackness, humour, confidence, vulnerability, courage and invaluable work in your community and online! 🔥🙌🏽👏🏽 I absolutely admire you and Ebony and your tireless efforts! It is a privilege to share in your joy, thank you for sharing so much HART ♥️ and for calling us white folks out on our shit and teaching us how to confront, accept and change our damned ways. I’m a particular fan of not only your work; but your OOTD posts, your plant “spa day” posts, your Baguette puppy spam - and Ebony’s prolific intellect, dancing posts and relentless loyalty and protection of his loved ones. You’re both radiance and leadership personified - sending all my love, gratitude and ongoing support from Australia! 🇦🇺🐨 We sure could use your services here in Australia, please come one day!", "korienna_koko": "Kia ora Ericka, I’m Korienna. A white cis hetero female from New Zealand. February Aquarius. I follow your account for the schooling- not just to think about the ease I get to navigate the world with, but also the systems and attitudes that allow me to do so. I love the sass, the #relationshipgoals, the plant and puppy love on your page. Thank you for the work you do.", "amyloulouchild": "Oh Baguette, so beautiful 😭 🙌 Hello! I’m Amy, I’m a white, cisgendered, bisexual emotional wreck. I’m so grateful and thankful for coming across your page, thank you. I’m a nanny to 11 children and I want to do my best to be as educated as I can for them all. Have a lovely day xx", "kathleendemelo": "Hi I'm Kathleen who also goes by Kat from time to time. I use she/her pronouns. I currently reside just outside of Toronto Canada. I enjoy my job. I've been following you guys for several years. I just wanted to thankyou for always reminding me to care for my well being everyday. The constant content allows me to always reflect and continue to expand my knowledge. Baguette is adorable 🥰", "becomingjolie": "You two have taught me much and I am very grateful for your presence online. Your love always makes me smile. Thank you!", "alyseruriani": "hi! my name is alyse. i use she/her pronouns and i am a white, cis gender bisexual woman, artist/designer/illustrator, mental health advocate, and art therapist in training! i learn so much from you all and i’m very grateful for that. i hope to be in a classroom/workshop/keynote of yours!", "macrowavesafe": "Hi! ❤️ my name is mark (he/him/his preferred pronouns), and I am a white, straight, cis-male, Katrina kid, and environmental law student at tulane.", "ilanabarefeet": "I have been following you for months and am glad to get the official intro! I am Ilana (she/her), European Atheist Jewish, grew up in London, England, but moved to Israel when I was 23 (am half Israeli, moved to be near my aging grandmother and my partner and the good weather). I am doing a PhD on the British use of English and English lit as a method of control in British Mandate Palestine, and am a teacher trainer (I teach future English teachers here). I have a partner and a 2 yr old son, two wonderful and endlessly annoying cats, and I am learning so much from you. Thank you for being so open and sharing so much with us.", "dejalewis": "I love this post omg", "campgirlmagic": "Hey there! I’m Melissa but you can call me Mel 🥰 I’m about to be 39 and a ruthless Leo ♌️. Im a bi womxn and use she/her pronouns and generally describe myself as queer 🤷🏾‍♀️ I’m a domestic and sexual violence victim advocate and educator. I’m also a disabled vet #depression #anxiety #PTSD #arthritis #invisibledisabilities I love to camp, all things outdoors and my dog, Bobby. I am proudest of being the mom of the sweetest, kindest, most adorable little person! I’m so glad that I started following you... I love your honesty and your ability to get deep into the layers of an issue; pushing folx to a greater understanding ✊🏾✊🏾✊🏾💖💜💙", "honeydupain": "My name is Hunter (she/they spectrum), I’m a Libra/Scorpio cusp (Aries rising, Leo moon), non-binary femme, intersex, polyamorous, and I am in the middle of a huge career change to become a sex therapist and educator. I’m a photographer @honeyandlimephoto and a podcast host @guesswhoscomingpodcast. There isn’t a dog I don’t want to pet or a plant I don’t want to take home. 💕", "allthatisbraw": "Waaah I love that you got a puppy too. My two have just reached 6 months and they ar cerazyyyy", "kaseymeeks": "Hi 🙋🏻‍♀️ I'm Kasey (she/they), a white bisexual cis woman & November Scorpio from Illinois. I'm currently applying to medical school & hoping to get involved with health policy to bring gender, race, and social justice issues into my practice and our collective health system. I'm also so appreciative of the work you do, & I'm grateful to learn alongside this community you've created. 💜", "get.down.with.the.thickness": "Hi, I'm Karley (pronouns she/her) I'm a pansexual, non binary femme. I'm 22, an April - Taurus, and I love reading and learning new things. I'm a maid, nothing fabulous lol. I'm engaged to the love of my life. We have a big fur baby named Bynx. And we're getting married next year. 🥰", "t.c.ndc": "Yes our dog is black !! Love it. Thanks for reintroducing yourself and the mister. Many blessings for the amazing work you do.", "beatrix_13_": "Becky, white bi cis she/her, scorpio raising 2 sagittarius one human one dog who thinks he's a human! I really can't thank you enough not only have I learned so much from your work but I learned what real love looks like from following you and your family😍 I look forward to being corrected within your posts. Thank you! Im studying psych and culture media and gender. Plan on opening up a transitional living facility for those coming out of incarceration here in Wisconsin. Sending love and happiness and gratitude because your work is beyond anything I have experienced and I owe you❤️❤️❤️", "ealavoie": "Hello, I’m Emily...proud special ed teacher, fiery July Leo and fellow breast cancer survivor. Your bravery and pride in your body and in your convictions inspires me. Keep telling your story!", "wanderlustingliss": "Hi! I’m Liss, a cisgender pansexual body positive social justice warrior, and a dog mom x3. A year ago I stumbled across your page while unpacking my white feminism with @rachel.cargle. You’ve opened my eyes, my heart, and my mind. I look forward to you + Ebony’s dialogue daily and would be all in if you two ever had a podcast!", "la_belle_boheme": "You better come thru with your lite-skint dog!!! 😂 And Baguette is the cutest name ever. Suits your doggy perfectly ❤️", "rainy.glen": "March pisces here, who feels before she thinks most of the time 😂 your journey emboldens me, your vulnerable honesty validates mine. i am in love with your truths, and find myself running to your profile, to feel so not alone, all the often. i am a human who is finding strength in my sexualization, having been objectified since i too-early grew breasts at nine years old. forever felt like JUST a blow up doll, terrified of my \"responsiblity\" over others' response/reaction to my supposedly inherently sexy self. i own this now, i ooze sexy, but not just in my curvy skin. in my spirit, i am a wild woman. now my work has become reminding everyone else of this fact, lol. i don't mind being found sexy, but i will fight feeling objectified with every ounce of me. @ihartericka your path is one i seek to bear witness to, and i so inspired by your you ❤", "imsaraelizabeth": "Hi! I’m Sara 👋 cis pansexual June Gemini about to marry an Aries woman. I’m an acupuncturist and teach grad students in NYC. Learning to unpack things & my privilege as a white womxn led me to your page a year ago. Thank you infinitely for the free education. So grateful to learn from you! 🙏 You and Eb and little 🥖 are the perfect family and I absolutely adore y’all. ❤️", "pastel_pwussy": "heeey!! I’m Amber, a queer, non-binary December-Sagittarius from Detroit. I’m an educator, artist, and budding entrepreneur. i love skating, fashion and hosting events in my community that work to empower the people involved.", "mara_madok": "Hello I’m Tahneé (she/her), Mexican cis gender woman, single mom to one little Starman and three cats and a shit ton of plants 💪🏽✨ following to educate myself and be a better human example for my kid. Thank you for sharing with us! ♥️♥️♥️ One of my favorite Ebony quotes is “Get present to your gratitude”. I think about that a lot. Lots of love ♥️", "emusthedon": "Hey @ihartericka!! My name is Emily - I’m a white, straight, cis gender female (pronouns her/she) who came across your page (I think) through the #girlgaze hashtag. I’ve been following you for a few months and feel very lucky to have found your page. I don’t really know what to say other than I feel like I’m getting a daily education from your stories and posts. It’s forced me to look at myself and the world in a new way - (my ideas about gender, race, sexuality)and How I need to continuously educate/re educate myself on racial and gender politics and how these things are deeply intertwined. (Im honestly shook to be commenting because did that make any sense? 😣🤪). Well I’m a huge fan of both you and Ebony and I am looking forward to/hoping to attend one of your classes/ talks in person. Thank you for sharing your beautiful life, family, and wisdom with all of us. Also I am a January #aquarius 🧜🏻‍♀️ Also, also baguette is cute af.", "rubywednesday13": "Hey y’all ❤️", "rileytown": "👋 from Vancouver Canada and I am a white male with a wife ( @teacup_n_saucer ) and two kids. We are raising our kids to have empathy and compassion for others free from judgement and harassment. We talk about sex and drugs and keep lines of communication open regarding any subject. Thank you so much for sharing your words and life with us! ❤️🖤❤️", "ophelia_obscura_obtuse_xqzmi": "❤️❤️❤️", "mrfruitboy": "Love you, that is all! 😘💕", "garden_nomi": "Such a lovely queer family! I’m Naomi, non-binary andro-femme (she/he/they), my partner’s name is Maria, a trans-femme beauty (she/her), and our fur-baby Sable, is a mixed (black and white lol) feline. I’m mostly of indigenous descent with some French and Portuguese. My partner is white and our gatita is mixed lol. I love your page and all the wonderful knowledge and visibility you have to offer 💖😘", "loganlepper": "Thank you for all you do Ebony and Ericka. 💖", "jenniferannsteen": "Boring cishet white lady here 🤣 I am learning so much from you and Ebony. I love how you share your relationship and love with us, your plant and pet posts, and most importantly your educational posts regarding sex, gender, race, and social justice. I usually try not to take up too much space in the comments, but ya’ll are the best and you need to hear it!", "doctor_midwife": "I’m just gonna sit up here and collect friends. Some pretty dope as people up in here @ihartericka 🙌🏽", "wendykwasnyart": "Hi! I’m a white, cisgender artist mama living in San Diego, Ca. I’m here to listen and learn. I appreciate your perspective, honesty, and voice.", "amjovie": "Hiyee! I’m Amanda :) Im a radical homeschooling mama to two kiddos and we live in the same small city I’ve been in all my life. Idk how to describe myself or what to say. Or even really express what you and ebony mean to me. You guys have completely changed how I think, feel, see, hear, react, you name it to anything and everything. I don’t feel like thank you is enough but thank you ❤️", "only1raenaj": "Hi I'm Rae, November scorpio, hetero (she/her). I've been following you because I enjoy your spirit to make others think, educate and be your authentic self at all times. Masters Social Worker in the making and I'm almost done! Hallelujah! I love your whole vibe. Plus I love all things art it brings me joy", "waitwhhaaat": "💜💜💜💜", "jhi22": "THAT DOG IS NOT REAL AND I CANT HANDLE IT 😭😭😭😭😭😭", "nikki.mayeux": "Hi Ericka! Congrats on your platform expanding to 200k and I hope you enjoy the hell out of my city for Essence this weekend! 💖 I’m Nikki, a white pansexual ex-Evangelical pastor’s wife turned polyamorous agnostic. Also a mama of 2 and a writer. I’ve loved following your journey and learning from you. In particular you’ve helped me let go of some of my former purity culture ideas and helped me see that I need to let go of striving to be a Good White Person and just do the work. Thank you and Ebony for all you do.", "tgmt.tv": "This brought me a lot of joy. I really felt invited and welcomed into what looks to be a wonderful family and life you all have together. Thank you for that. Hey Ericka, I’m Jamar 😊💕", "masleysa": "Hi! I'm Sam (she/her), a white cis female who's a Leo. I've always dated guys but hesitate to say fully hetero just because I don't know 😥I work in health insurance, but love all things art, crafts, and being creative. I am SO DAMN glad I found your page, because you have really given me a lot to think about and it's all been good! Keep doing what you're doing! I absolutely love seeing you & Eb, your plants, your dog, and all the work that you do. If I ever run into you while I'm up visiting my friends in Brooklyn, it'd definitely be a highlight for me!", "tsh.nyc": "So cute!", "angelamorrismakeup": "Omg this pic and caption are amazing. How did I get here? I think I started following you because someone reposted something brilliant that you said, on their Instagram story. In this short time I have learned a lot from you, love your voice, love the love you share, and love your style (writing style, personal aesthetic, basically everything expressive about you) as well. Thanks for doing what you do.", "oh_pazzer": "Reproductive health clinician and abortion provider in West Oakland, May Gemini too, mom to 3 humans! ❣️❣️❣️", "cathair_everywhere": "🖤🖤🖤 I love what you said about politeness in the face of anti blackness. There’s this video going around; you have probably seen it—a black woman politely tells a confederate flag toting repair person she will not be using or paying for his services. It’s going around with this conversation around it applauding her for politely shutting this man down. I’m impressed with her ability to keep cool, say what she needed to say, and let him know his racist ass was not gonna get any of her money, but I found the conversation around it problematic. The “now THIS is how it’s done!” attitude... this is not to be confused with a criticism of the woman—but instead a criticism of the problematic conversation around it that supports this particular way of addressing racism. I am certain that this woman had to very rapidly consider how she would address this situation without putting herself or her family in danger and that is the shitty reality—that she was put in a threatening situation and was forced to mitigate it with no certainties about her safety. I feel like THAT is more the conversation people would benefit from having but Im curious about your thoughts on the conversation surrounding this video, if you have any! Thank you for all you do !", "meaganangus": "Hello! I’m Meagan. She/her, queer/pan/poly, white-presenting (mom is Ojibwa) Witch and Will-Worker. December Sag as well, with Aries rising! (It’s always fire season when I’m around.) I’m working to do my part in monkey-wrenching our current paradigm thru teaching and mentoring folx in Paganism and Tarot. I am laid out at least once a month in my personal work around racism and bias by things you post here and I am so grateful for all that you and your family share. We’re a better world for people like you.", "gunstreetgrrl": "Hi! I'm Tracie, bi female Indigenous Pisces. This is the year I take no shit at work, home, at the store, anywhere. I have a pug, a mini daschund, and a jackass cat. <3", "sidonie_groignet": "Hi 😉", "twymandanyell": "♥️!! Hi!!", "rvn.nnwlsn": "!!!! My name is Raven, she/her pronouns(: I am a young white woman who has been following you and your family for what seems like forever, learning and loving and working to undue the expectations and internalized beliefs I have grown with since I was a little white girl. I am queer, a March aries, and the only thing I know for sure that I want to do with my life is teach people about healthy and safe sex, and sexualities, but I love love love teaching people around me(and myself) what I can about the social injustices people that aren't cis/white/and Male face. Thank you for everything you, Eb, and now Baguette do💕", "jplaydoh": "Hi! I’m Jules (she/her) white cis queer educator and mama in LA. (Side note: watching you work/talk with kids is one my favorite things. Your genuine respect for youth is palpable.) Your page was the first time I actively followed someone I don’t know personally and I am so grateful for it! My students have directly benefited from what I’ve learned from you, and in an environment of commodifying culturally relevant pedagogies and folks making money off of how to teach in marginalized communities, I’ve just started directing my peers and teachers in my PLN to study with you. What’s more, I swear you and Eb are teaching me to be a better wife to my wife. So thank you for that. Your love and relationship is more than just goals. I appreciate you and your work, your energy and time, all of it. Thank you.", "genludd": "Hello, I am Geneva (she, her, they) proud BLACK Virgo queer femme from New Orleans! I am SO sad I missed when y’all were down here😭! I am a massage therapist/ esthetician and I have a brand all about encouraging, empowering, and edifying beings to feel comfortable and confident in their skin @sexybaq! I also volunteer my services to PoC/QTPoC free of charge because it’s imperative that we take time to care for our bodies! Thank you for your presence! Peace. Love. Blessings.", "thekatculture": "Love what you both do. Thank you for creating a safe space for truth! 🔥 And for challenging folks in positions of privilege, specifically white folks, to do better! I'm Kat, she/they, a 6th generation American settler of northern European heritage. I grew up on colonized Cherokee / Choctaw land in Tennessee. Always learning and growing as an artist ✨ 💕 Also dating a wonderful guy, but still very bi--hiii 🏳️‍🌈", "lydwallsart": "Me and my boo are a gem and sag too!! 😍", "_teddybearseason": "Hi! I'm Destiny! Also from deep East Oakland 🙌🏾🙌🏾 black and queer af, (recently started using they/them pronouns). Poly, poet, photographer, director, storyteller just tryna show/remind us how beautiful we are. I love and admire the work y'all do and the love y'all show for folx 💕💕", "actuallytara": "Hi! I’m Tara (she/her), and I’m a textbook July Cancer, right on the cusp of being a Leo (although I don’t think anyone would ever classify me as one). I’m the mom of my wonderful February Pisces bub, Birdie, and part time cook at a seniors place. One day I hope to finally finish pursuing my social work degree. As a white, cis person, I am so grateful to you and Eb for helping me to question the programming I was brought up, and look at things from a new perspective. Thank you for all the work that you do!! 💜💜💜", "landofinkandgraphite": "Hi! I'm Eli, indifferent to pronouns, a queer mixed Armenian artist. This account has taught me more than I could possibly articulate and I am forever thankful for Ericka and Ebony, and all the work they do!", "an_chandra": "Heyo! I am a first generation bisexual femme, she/her/they pronouns, with roots in Fiji and ancestry in India. I’m in higher ed, and I also act professionally and teach pole dance. (Follow my other account @angela_sha_ as well!)", "croptopgoth": "this is the sweetest goddamn photo of all time", "damaris.palmer": "Hi Erika! I’ve been following you for a long time and appreciate your work. I’m an ex-pat Brazilian living in Hawaii. I am trying to raise 3 decent human beings. I am passionate about immigrant rights, having been undocumented for many years myself. I appreciate the intersectionality that you bring to your work. I also appreciate Ebony and the lack of bullshit you two take from people. Glad you two exist in the world!", "ctlnrly": "I love y’all! I appreciate & admire you & your fam 💯", "denatimes": "thank you for who you are... love the caption, esp the beginning 😂", "roxxxxxym": "Hello, I’m Roxy, (they/them, she/her) I am a gnc femme who lives and works in Los Angeles. My paid work is in graphic design, but I also work as an organizer for LA Zine Fest. I strive to advocate and give space to black and brown lgbtqia writers, artists, performers and musicians in LA. Thank You to you and Eb for sharing your adventures and lessons with us all, you give me hope. Let me know if you ever need any graphics! 💖💖💖", "lauralynnleonardi": "Hi! My name is Laura. She/her, white. I’m a January Capricorn although I don’t really have all the Cap traits. I am a fur mama to a one eyed pug. I live in Ogden, Utah (the most badass city in Utah) I want to thank you both for how much you have made me think and what I’ve learned from you. I hope someday you come to Utah so I can hear you speak irl.", "somer.time": "I’m a March Aries like Baguette! 😂", "bridgetbadore": "I love reading you talk about Eb & your love 😭♥️ my household is all May Taurus (including our cat) lol 🙃", "madremorena": "I’m Carmen. Pronouns she/her. Retired teacher. Unlearning a lot of crap.", "zoathexplora": "Hello! I’m Zoe, a white, pansexual, and go by she/her, they/them (although I’m questioning whether or not I want to continue identifying with she/her). I have a maltipoo named Charlie that gives me so much happiness! Thank you for all the hard work you do. I have loved following you and will continue to be grateful to learn from everything you share! 🧡", "nwtnjms": "I’m Newton ✨ I’m of the 🥖 clan (lightskint), queer, non-binary (they/them) art therapist & workshopper born and based in Philly. Most of my work is with adults in an inpatient setting and existentially focused - but have worked across the gamete (and currently looking to move back to outpatient). Currently developing work surrounding unpacking what “trauma informed” means and why i think it’s a crock of shit (rather, many folks doing trauma informed work seem to want to moreso be seen as an expert than to actually do the work but 💤). I’m a (May 26) Gemini, Double Scorpio - Which just means I’m indecisive and bored of shenanigans 90% of the time. Today I just had to run a group, attend two meetings, and then a second group where I was challenged to a dance off to Memphis Bleek playing in the background. I’m finishing for the day, but thank you for being a source of education, hope, and hilarity 💕", "rows.of.lilacs": "“I do believe our spirits have met before and he’s not only my lover, but my best friend” 😭 I love y’all’s love. ❤", "mentalhealthfemme": "I am forever in awe that we have so much in common. My name is also Ericka, I’m also a queer black non-binary femme, I’m a November Sagittarius, educator on lgbtqia and the intersections of marginalized communities, and like your partner, I’m from Oakland! Makes me feel like I can be cool by proxy ☺️💓", "beansproutmomma": "👏👏🙌", "pinkflame666": "This pic is so cute 😭😭😭 that damn dog 😭", "julesmarools": "Thanks for the beautiful introduction to your family. I mainly lurk here, learning a lot from you about white privilege and options I can take to support POC. I'm a middle-aged white lesbian, reworking my concept of feminism as I read what you and other leaders in this field share. My mom and aunt both have had breast cancer, and watching you share your power and vulnerability in the face of it hits me deep. That photo of you striding down the runway blew my mind, and made me want to cheer!", "totallypuppywhipped": "Hi! I'm Nikki (she/her), bi/pan leaning, white, Cancer from a small town in Alaska. It's my birthday today, and I'm 40! I have a son who's almost 20 and a Chihuahua who's my baby girl/princess/snuggle buddy. I really love following you because there is just not much diversity in a town of 4000 at the end of the road, and I need to know more about the world we live in. I love having my thinking/knowledge challenged, be it about my privilege or my sexuality. Until recently I was a group home caregiver for elderly, developmentally disabled adults, but burnout is real and i have been unemployed for about a month now. Not sure what is next, but it'll be fun!", "bigupanash": "Hi 🙌🙌. Love you guys ( both you and your partner) @ihartericka , I am Anash I don't really use titles but if I do ( she/her/zaddy) a Black Lesbian from the Caribbean ( Jamaica). I am a musician/Artistic/ DJ/model ect. I'm currently single but focusing on music full time. I haven't been to America as yet but have plans made for pride next year, hopefully I can play music at some of those dope parades🔥🔥 I see happening. Anyways Big Up yourself and keep being you, straight Love coming from I.💜💫💫", "crow_ne": "Hello! Thank you for all of your shares and vulnerability and education here ❤️ My name is Jess, she/her, I’m a March Pisces, I live in Massachusetts and work as a nurse focusing on addictions. My favorite clients are the ones other people either don’t like or are scared of.", "kallielarsen": "BAGUETTE. 😭😭❤️❤️", "motheroffluffs": "I’m Jade! White cis queer bisexual diabetic. 1000% Cancer (thank you therapy) and married to a lovely lady, living in Michigan with our two kitties. Thank you for all the work you are doing, all the educating, all the reminders, questions and hard truths. I’ve only been following six months but you’ve changed my life and queer politics and also helped me see the world more clearly, not only as a white queer but also as a semi-newly-disabled person. 💖💖", "anna__carew": "Hello my name is Anna, I’m a white cisgender straight woman(she/they) and I have been following you for almost a year now and I am honored to learn from you I think what you do is amazing and so valuable I have truly fallen in love with you, Eb, and your little babies ( both furry and plant). Keep doing what you do ericka and thank you thank you thank you for all you share with us and everything you continue to teach this boring lil white girl, I hope one day I can hear you speak in Rhode Island where I live!❤️❤️❤️", "tia_juanitas_canna__cocina": "I’m just grateful to follow you and by extension, Ebony, here. I learn so much from you, and you are truly radiant. I’m a homeschool mom and in animal rescue. Love travel and art. And a doula. I’m an Anglo-appearing Mexican cis-het human and married to a cis-het man who never says no to me. ♥️♥️♥️♥️My love to you, Ebony and Baguette.", "naannncyy_": "Hiii, I’m Nancy🤗🤗🤗 I’m a straight, Chicana cis-gendered womxn. I’m a Pisces and yes, very emotional! I just graduated from a PWI and moved back home. I’m adjusting to moving back home, just entered the work force as a legal assistant at an immigration law firm, and began going to the gym again! I saw you two years ago when you visited Colby College as a keynote speaker, you were amazing! Some friends @daddyblackcat and @juanmoon suggested I follow and here I am. Thank you for your knowledge and for your constant teaching!❤️❤️❤️", "themixedupwriter": "I'm Nicky, no label - mixed Black descendant of slaves. pronouns- she/xer. Two-Spirit, my gender is fluid. I am a writer, creator, spiritual activist, SJW, coordinator at an LGBTQ Community Center, Aries sun, sag moon, leo rising", "ramadosslavanya": "Love this intro! Hi! I’m Lavanya (she/her), Indian born but confused by also being Canadian and American. I love seeing your posts. Thank you for being brave and tirelessly persistent in educating us.", "rhia0_0": "I'm Rhiannon! (she/her) I grew up in South Africa and recently moved to the USA. I started following you to better understand the culture and racial issues in the US since the south African social issue climate is so different! You have educated me so much and changed my thought process completely! I was so involved in social issues in South Africa and felt very lost in America, but you've made me see so much. I genuinely consider you my hero (and everyone I speak to knows that lmao) and I dream of seeing you speak in real life!", "sejeia": "Y’all really my favs 😩  Sejeia free, they/them/she/her Black and thick Southern non-binary queer femme from the Delta, a may Taurus (leo moon and rising) descendant of the transatlantic and the removed indigenous. Student of integrative medicines and afro-pessimist critical psychologies and fugitive performances (I’ll be a mental health nurse practitioner /midwife / theologian once the academy releases me) lover of storytelling and the blues, hoodoo practitioner, avid crocheter, lover to a sag 🖤 my work is as a community organizer, specifically around queer youth in the south. Living, liberation, pleasure and wellness are my passions. Blessed to been able to have encountered you in the flesh and so grateful for your commitment to the work and education. Thank you for being you despite white supremacist intents for destruction. ☀️ I love you and am so happy you got a boo that loves you directly 😭😩", "ziaaukia": "Y’all are too damn cute 😍😍😍 I’m Irma, from Chicago, currently living in the Bay Area. I’m also a May Gemini ♊️ like Ebony 👋🏾👋🏾. I’m a holistic health coach, cannabis cultivator @iindica.x , and now a doula. I really enjoyed meeting you a few months back at SFSU... I love and appreciate your work and meeting you in person was definitely a highlight of my year✨. I love your new home, but low-key sad y’all didn’t move to the Bay... I could sooo see us dancing in your amazing garden (let me dream, ok). 😂🙌🏾💚🍃✨", "delveck": "Hello!!! I'm Maria- cis gender, she/her pronouns, white, mom of 4 humans and 2 fur babies. I'm a civil engineering student and a virgo. (Read, super type A personality, and also super boring haha)", "anja.rae1": "Hello from the UK 🇬🇧 my name is Anja (she/her pronouns) and I’ve followed you for a very long time now! I’m very grateful for everything both you and Ebony do (and I mean we can’t forget Baguette now can we?! 😍). Learning and unlearning so much! So just a huge thank you really, I imagine it takes a lot of time and energy ❤️", "mid_nite_rogue": "I'm Taniesha (slowly transferring to genderless just T). I consider myself a transmasculine queer person sometimes just a basic ol lesbian. I live on Eastern Long Island which if you been here is one of the whitest places around, so it's super fun navigating that. I work in the non-profit world as a mental health counselor by day and a case manager in a men's shelter at night. April Aries all day (solidarity Baguette). I starting following your Instagram a few months back and I am so glad I did. I've also just started listening to y'alls podcast obsessively th last few days and it's the best thing I've ever done. I've struggled with my own internalized anti-Blackness for so much of my life and only in the last 5 years have really grown to love and embrace my skin and my community without shame or apologies. Listening to and watching you and Ebony speak and interact has been so affirming of both my Blackness and my queerness and I just want to extend the most abundant gratitude for you both for existing and resisting and giving the rest of permission and space to do the same. You are beacons of light and hope and y'all are funny and adorable as hell. Thank you both for being.", "erickaeckles": "I'm Lisa, mum to a rather elderly windy bottomed grey cat called Bernard. I'm friends with a little cocker-poo that lives down the road so know how friendly and lovely they are. I'm an October Scorpio, rape survivor. I make really good cookies xx", "mccalla_hill_art": "Hi! My name is McCalla. I am a cis-gendered white woman. I identify as queer, my first marriage was to a trans man and my current cis-gendered husband also identifies as queer. I teach 5th and 6th grade at a private school in Atlanta. Last year was my first year teaching general Ed, my degree is in art education, but I have loved teaching reading and writing too. I usually NEVER introduce myself on these types of posts, but you and Ebony are so lovely and you said you love knowing who follows so I was like, “well, I love following them so here is how I can show it!” Xoxxoo", "m3lli55ado11": "Hey, I'm Auseana, Black native, Louisiana creole. January -Capricorn. Flight attendant, in flight school to become a pilot. Worked with sex traffic kids and run away/kicked out LGBTQ+ kids for 5 years. Now, I just travel and eat. Super love you by the way", "pan_dulce124": "Hi! I’m Jessica (she/her). White passing queer Latina, yeah, I gotta own up to it. A true taurus. I’ve been following you after a video from Cosmo came out a couple years ago. I thank you for opening my mind to my own internal racism towards black people/poc and that even if I mostly have black friends, that doesn’t mean shit when you constantly avoid certain places/people or believe in stereotypes. Due to you and Kinfolk collective, I’m learning to point out when I’m the problem and what I can do to fix it. If I see something, talk about it and point it out in others. I get referred to as aggressive alot due to that but I don’t care because I know that I see the problem, I can’t ignore it. I have to use my privilege and speak out. Also, your post about people using queer culture to make up for being boring straight people really hit me hard but it’s true. I’ve been thinking about that same thing for a while and I end up having that conversation with anyone who will entertain me. Lol! Anyways, I love seeing your family and your new addition, Baguette 😭  Thank you again for the work that you do.", "thivmoney": "i’m thiviya (she/her) a queer aries who met you at joy this weekend and drunkenly asked if you were famous (it’s my pick up line but also i recognized you) and you said NO 😭😂 and then i realized when i saw u post ur pink hair that IT WAS YOU after all!! ☀️☀️", "elsunshinestar": "Hello I’m a Pisces Cancer Pisces plant loving mother of three humans white art teacher whom you have taught and continue to teach so much to. Hopefully I can fundraise enough to have you come speak to my students this school year! Thank you for all your work and for sharing your lovely family🌱💚", "emmma.b.a": "I'm Emma (she/her) I'm a Jewish lesbian who's nervous about starting college this year after taking time off for health stuff. I have a fluffy little dog named Buffy who has her own Instagram account because who needs normal hobbies? I want to study public health and my dream is to either do medical research on chronical disease or to work to make healthcare more accessible and affordable. I'm grateful for all you do @ihartericka I've learned so much from you, especially when it comes to deconstructing the prejudice I've been taught and doing my best to move away from it. And Baguette is a fantastic name for a dog! I love dogs named after food, I want to name a future dog Pesto :)", "cindybeckdesigns": "Hi Erika, I’m Cindy and I’m just your regular ole white cis woman married to a regular ole white cis man. I have been following you for a while and love having my mind challenged by your posts not to mention I love you and your partner Ebony’s love. It makes me happy to see y’all together. I love love. I love talking and listening and learning about the race issues in our country and have learned a lot from your posts. Thank you. Much love. 💕", "hannah.gundi": "Hi Ericka! Been here for awhile. My name is Hannah (she/her), I’m a bisexual November Scorpio studying Music Theatre in Connecticut. Also really passionate about non Zionist Judaism and eating disorder recovery from a HAES lense. You and Eb challenge my thinking every day and have taught me so much about the intersection of anti blackness/white supremacy with...well, everything. I plan to move to NYC post-grad so I will be following you to any public events and giving back financially once I have the means to! Thank YOU!!", "piedraymar": "💛💛💛", "rebekahroses": "Pleeeeeeease tell me you’re filming Baguette’s first outdoor adventure! She is the cutest ever", "carolinesmiling": "Gender queer Brit(ish) queero Taurus cabaret poet here, vibes from across that big ol' pond 💛", "ohgreat.its.cait": "Caitlin (she/her) February Aquarius ♒️ non-profit social worker in the domestic violence field - just want to say thank you both for all you do. I have directed so many clients who are people of color and/or queer/questioning to your page. You are truly an amazing resource and give people so much strength.", "baba_witch": "Hi y’all! I’m west. I’m a white non binary queer human from Seattle. I help people feel more embodied through improvisational movement classes and I believe strongly in the healing power of dance. You and Ebony are two of my favorite people on this platform. You’re constantly helping me push back on my own backwards thinking and helping me think bigger about social justice, anti-racism, sex positivity, queerness, gender identity, all the things. Thank you for all you do ❤️", "myshelltabu": "And you love plants 🌱 🌱 🌱 😘", "mallorycorr": "snuggling boos 😭 🥖", "lacey_ack": "I’m Lacey, a cisgender Lesbian living in rural Idaho. My wife and I have three cats and are expecting a baby in November 🐈🐈🐈👶👶🏻. I’m a social worker for adults with developmental delays who have committed a sex offense. Your work helps me properly advocate for my clients. Thank you for being a catalyst in my evaluating my privilege and making changes in my own life.", "mx.samsantos": "I'm Sandra (they/them). I'm a white queer non-binary 23 year old college student from Portugal. I'm a May Taurus (scorpio moon and rising) and I would love to become a filmmaker someday and be able to portray the queer community how it deserves to be portrayed.", "verainwien": "hi! I am Vera, a Russian living in Austria. I absolutely love your blog! You have so many great ideas. Reading and watching you is like, hmm when you have read a thrilling book, then go somewhere and think-think-think about it, and the angle you look at the world is wider and it’s cool. Thank you!", "katienumi": "Blessings to your fam!!", "garbage\nVerified": "Verified", "j_og_": "Hi, I'm Jo, a queer cis white woman. I love all your work and am here to educate myself on white privilege, learn about black experiences and blackness in the context of sexuality, and to learn how I can use my privilege to uplift others. I'm also a Saggitarius. I'm November😊", "italianthicc": "@janbarcher so much love🌹🌹🌹💘", "uhhhdele": "\"yes our dog is Black - just light skin\" im sCREAMING aDBJDJD", "dunkel.traum": "Aye! My name is Kentia (Tia for short) and I’m a nonbinary femme😊I have two adorable kitties and an awesome Partner/bf. I love following you because you speak truth, help me discover myself in a way, and I all around love yalls vibe 🖤 I’m a bit of the artsy fartsy type... x10😂🤣", "saltwaterclub": "I’m T! Hi Ericka! Hi Baguette!!!! Hi Eb! I’m a white unidentifiable Aries living with my white cis Libra partner and our three stinky dogs in Massachusetts. I sell my labor to a nonprofit that works with and for people struggling with homelessness, poverty and stability where I work in communications. Thank you and your beautiful family for all of the work you do, it’s appreciated by so many. ❤️❤️⭐️", "reneemagnusson": "I saw him on your stories last night and loved how he stands for you. May everyone have that back up one day. 🖤❤️✨", "ariyike.o": "Heyyy I’m Ariyike, demigirl/nonbinary (she/they, black lesbian, currently in Durham. Just finished my first year of my education and sociology degree. Also a December saggitarius. I have two cats and too many emotions. You make me want to be better and I can’t thank you enough for that 🦆 ( also a lover of animal emojis)", "elizabethkwarren": "Hello!! My name is Elizabeth (she/her) and I am a bisexual, non-binary white person living and working in the rural southern US. I’m going back to school in the fall to be a conservationist. I have four cats and they are the loves of my life. Your account has helped changed my mind and my life. Thank you for educating and putting your amazing energy out into the world. 💚💚", "scandinavian_afro.latinx": "Hello, I am Milena, pansexual agender being trying to figure out this planet. 4'11\" strong. Cancer to a T with a large dose of Sagittarius and a huge lover of tea. Mixed-race; my mother is afro-Brazilian and my father is Danish-Norwegian. I turn 17 on the 20th and your account has been an amazing learning experience and platform to help me understand my mother's struggles and try to 'decolonise' my mind. Thank you both for your amazing work!! 💕", "fluorescent.antidepressant": "Long-time follower and huge fan of your podcast and overall work - just dropping by to say your queer family is so beautiful!", "katherinealexandriaart": "It’s always such a joy to see the three of you happy and together! I’m an NB from Chicago/DF an artist and a fan of yours.", "mimimarven": "I’m Marvin, and some of my friends have started to call me Mimi. You can call me either! I’m 25, a July cancer, and a Black, Queer, non-binary/trans middle school English educator. I use they/them pronouns, and I am originally from the South but reside in NYC (thank goddess). I like my work, but I love having recently started my transition two years ago. I have loved making decisions about my name, style, and body in ways that challenge me all while my friends, family, and students get to witness the beauty in my journey. 💝 I’m sad internally, most of the time, but I like exuding positivity and good energy with my friends and to people in general. Still discovering how to make my self the most satisfied for and with myself each day. Thank you for your beautiful words and posts always. They give me strength and something upon which to reflect daily! ❤️", "tylaacampbell": "Light skin dog 😂😂 yas I’m here for this!!", "m.trouvaille": "Love your beautiful fam!", "stacefacekillah": "I’m Stacy (she/her), pansexual, cis white lady of Ashkenazi Jewish descent born and raised in Los Angeles. I’m a September Libra, with Rising and Moon in Aquarius. I have two fur babies and a partner of 5 years. Thanks for helping me discover and correct the biases bestowed upon me by my white heteronormative background. Always working to be a better ally. Love that your share your gorgeous family with all of us!", "jkons": "Hi! I’m Jenna, a long-time follower. I’m a white and queer person and a middle school special education teacher. I’ve learned a lot from you and Ebony already! Trying to be a good human and teach good to humans ❤️", "emmers2016": "YOU ROCK!!! It is so awesome to be re-introduced to you, I learn something new in every post ❤️", "maenadphyskoa": "I've been a fan for ages, I love sending your page to those who need to hear truth. I'm Lil, a Sag hermit biracial old lady who's eternally forced to be celibate due to being demisexual and owns a scale baby. I'm glad y'all exist 🖤", "sarahdesavage": "😭😭love this!! Hi I’m Sarah (she/her) from Brooklyn!! Half black and Indian, parents are Guyanese so I snatch that brand too. Big into community organizing and I write sometimes too. And I have to stan you and Eb giggling at Paul’s antics on 90 day fiancé because ME TOO SIS 👏🏾👏🏾", "seejosiesmile": "Hi! I'm Josie (she/her pronouns). I'm from the Midwest, but plan to move to Washington soon to be amongst my more liberal peers and improve my health conditions. My profile focuses on positivity in general as well as in relation to disability and all that comes with it. I also want to promote the legalization and normalization of medical cannabis. Thanks for sharing your story and opening people's eyes to the array of beautiful humans we have on this earth. Be well! #positivevibes #reeferforrelief #cannabiscommunity #selfcare #disabledandsexy #love #chronicpain #chronicfatigue #chronicillness #potssyndrome #dysautonomia #mastcell #ehlersdanlos #ehlersdanlossyndrome #peoplesupportingpeople #weareallhuman", "daizeethedoula": "Hi I’m Zee, white trans nb queer. Thank you both for your unapologetic existence. I read/watch you both in my measures to remain anti-racist and hold other white people accountable. I’m posting today to remind your other white followers to remember that if something said here makes you want to type a response... don’t. Sit with that shit, otherwise you’re not actually listening. Period. No but I... No but what about... No narrative of the good white person. Nope. It ain’t about you. Sit down. Then go to work in your white community, share the hard posts, the unpopular opinion. Challenge you’re “sorta racist uncle but he’s a nice guy” at Christmas when he makes that bad joke. Call it out at your work place.", "irobyn": "Hi! I’m Dr. Robyn, a TransQueer Latinx who is also non-binary and microdosing T. I’m a public theologian who also teaches at Duke Divinity School and I run a collaborative project in Nashville, TN focused on social healing. I work & love in deep comradeship and work to root myself always in community & am forever committed to black - brown Solidarity! I love your work & glad you’ve got a fierce boo! ✊🏽❤️✊🏽", "loumurrey": "Hi Ericka, Ebony, and Baguette! I’m Lou (they/them), I am a bisexual gender-chaotic October Libra. I am from the mountains of NC and live in the mountains of TN and I work with other youth in our region to build a youth-led liberation movement in Appalachia. Your Instagram is so incredible, I am so grateful for y’all and what you put into the world. Thank you so much 🌈", "captain__cream": "Hiya, I'm the Captain, they/them, a hedonist femme with big taurus energy. I love getting deep in the comments sections of your posts, you bring out so much complicated humanity in people and its taught me and I think the world a lot. Thank you for your brilliant work!", "ldpstudio": "Hey y’all, I’m Toya, September libra artist/muralist in bmore and I adore you!", "annamae9513": "Hi breast cancer survivor as well and and have stayed and visit Oakland many times 👊🏾💯", "thelmaemily": "She said her dog is light skinned black 😭iconic @soigneesandi", "x.queenasia.x": "Hi! My name is Asia and I’m a black woman who is bisexual. I’m also a student majoring in Psychology and aspire to be a counselor for juveniles. I’ve been following you for awhile and I’ve been learning a lot. Can’t wait to see what you post in the future. 😊", "tickanascha": "Ticka residing in Minnesota, and totally thankful that I happened upon your IG page. You both have been such a breath of fresh air and helpful to me, as I navigate through sometimes hostile spaces. Thank you BOTH for your willingness to be yourselves and teach us all. 🙌🏾", "joshclasberry": "Light skin pup 😂😂😂", "sagiratpath8": "💕💕💕", "themollydonovan": "🙏🏼💗💗💗", "noradele": "I love that you say you feel like you and Ebony’s spirits have met before! I think that’s one of the most beautiful feelings/parts of the human experience (at least the infinitesimally tiny blip of the collective human experience I’ve lived so far). ❤️ Much love and gratitude for all the work you do!!!", "malinlhultman": "May gemini 🙋‍♀️🤷‍♀️", "larissascotting": "hi! 💕 I recently started following your account & have found your story & posts to be so thought-provoking & inspiring. I also love your little puppy. 😍 I am Larissa, she/her, Cancer (it’s my season right now & things are kicking off!!!), writer - marketing consultant living & working in London, dreaming of going back to uni to do a PhD in English Lit. I also have a cockapoo!!! 🐕 🐶 my fur baby is called Roly & it’s their 4th birthday today. 🎁 thank you for sharing your inspiring life & story with us. 💖", "caro_clay": "Hiii 💕 Caroline from Kentucky. She/her pronouns. I’m a gender and women’s study major. August Leo, with a black shih tzu named Martin. My older brother is a trans man and I’ve watched him have to jump through hoops for everything ranging from health care to basic respect. I appreciate all that you do and love Eb’s clap backs and Baguette’s sweet naughtiness.", "amyleighmorgan": "Hi there - Amy Leigh (she/hers), white straight cis writer and healer. I'm just a massive fan of both of you. I'm so grateful to you for sharing your thoughts and lives, thanks a bazillion times over. You're a couple of lights in the world, thanks so much for shining.", "djamidonbrentart": "I'm DJae, bisexual, cis, white, fat, femme artist, dog lover, mom of twin boys, longtime (but now former) copywriter/copy editor, sensitive AF March 5th Pisces, Bowie acolyte, and brand new special ed teacher for emotionally disturbed kids k-3. I love your posts, your wisdom, and your sweet family. Thank you for sharing your amazing authentic self with the rest of us!", "a.m.green.e": "This is the sweetest picture", "girlwiththecattattoos": "I’m Kaitlyn! I’m a non binary femme human navigating being in a cis-passing relationship (fiancé is a white cis man). I’m starting cosmetology school in January and have two cats and one very needy little dog. Textbook Taurus with Cancer tendencies (aka I cry a lot). Thank you for educating us all and being such a radiant being! Grateful to follow along.", "thesoundoflou": "Just so you know - if I ever get a dog I may have to steal the name Baguette 🥖😭😍", "prairie_mortem": "Hi! I’m anna, cis/het/white mom of a little boy who is going to learn about privilege and healthy masculinity from the get go. I’m also a plant mom and avid gardener who is constantly seeking out ways to challenge my privileged world view. In the process of starting my own preservation/archiving business and hoping to eventually offer free services for BIPOC because their history matters! Thank you for your work!", "tarahackl": "Tara ... from Canada ... Prairie province of Saskatchewan — white. I’m so happy I found you and Eb — you make me think everyday and usually during a story or post, also make me smile.", "hibiskiss.faithh": "This is goals. I'm so proud of all of you!❤️", "juiciest.j": "Jules, genderqueer (she/her, they/them, he/his), queer, March Aries (hey Baguette 🔥). I am a nanny & caretaker. I also volunteer as a sexual health educator. You are an inspiration.", "yabadabalicious7": "Chantelle(she/her) October libra, Yellowknife Northwest Territories ( google it) blended family including a bisexual step daughter and a transgender granddaughter(age 6) . Love following you and Eb. Some days I find it had when and question myself if I offend anyone with my words. My bf lives in Jamaica and says i need to think before i talk!", "kait.hurley": "Hi Ericka! Thanks for your leadership, and I’m glad to be a part of this community. 💞🙏🏼", "momoneyhuni": "Hellooo! I love this trio, and the work you all put into educating the world. This is the most informative account I follow. Besides that, I love seeing you both love each other! Makes me happy ❤️", "blquni": "love y’all so much! hi baguette! 👋🏾🥖 😘😘🙏🏾👏🏾", "ultra_momma": "Jess: (she/her/they) I’m a hot mess human but manage to do a damn good job raising my two kiddos. I am pansexual & my husband & I are trying to raise our children with the knowledge that gender is a social construct. I am going back to school to become a LMHC. I love running, nature, weed & watching your videos & posts. You & Ebony are phenomenal human beings & restore my faith in humanity! We also have a dog named Wembly (from Fraggle Rock) he is a Chinese crested chin powderpuff 🤣", "migo_lund": "Hi! Thank you for this and for your work! I have been following you for a few weeks but was unsure of your history/background (and Eb’s). I am a French white woman (she/her) trying to learn and improving myself! Again thank you for your work! 🙌👏", "_aobc_": "Hi! I’m Camille. June Gemini sag rising. White omnisexual in a long term monogamous relationship with a cishet white dude. I like juuuuuust epiphanated that I never explored my attraction to women bc my dad is a sexual deviant and objectifier of women and I felt he would in some way eroticize my sexuality. Gross. I have two small kids who identify as girls. And two dogs Chief and Princess Kevin Cheesecakes. My dude is a kidney transplant recipient. And I am his (occasional) caregiver. I am a social worker who centers racial justice and reparations and I love you allowing us access to your whole life and always making your real self accessible to help facilitate our collective and individual growth. And your baby baguette dog is so 😍", "squarestown": "❤️", "rieleo": "Hi Ericka! My name is Cherie. I am a cis het female. She, her, they. I come from a California white culture and descend from a bunch of European folks and also some Native American folks. In my personal time I have been a Sexual Assault Counselor volunteer and try to be creative. I am a Veteran of the Marine Corps. I love to run but have not been doing that like I should. I live in the San Francisco Bay Area. Live on the peninsula, work in Oakland. I am a mother of a grown daughter and a birthmother. I live with my SO, who is a cis het male. I started following you as recommended by another page who encouraged their followers to read and interact with people who are different from them to learn more about the world around them. I am kind of jealous that you are a sexuality educator. I have been envious of those I know who have the opportunity to impact the community on such a way. Thank you for doing such an important job. And I agree that you can’t just talk about sex. There is definitely more to it than the physical act.", "chantellekohn7": "This is the best introduction I have ever seen!!! 👏🏻👏🏻 I love your queer family and the incredibly important work you do.", "moosebuckets": "Forever loving that I found your account ✨", "avid_daydreamer": "Baguette🥖 🐶 that’s such s cute name ❣️", "ahbeeolah": "I’m Abiola (she/her) and I run a clothing business, @stylingbyola , which offers a wide array of clothing services from personal styling to handmade clothes & graphic tees. I’m also a college student at Boston U and I’m a 1st gen Nigerian-American with a black mom (from Compton whoop woop) and Nigerian dad. I love politics, designing graphics, art, fashion, and am obsessed with butterflies, birds, and dogs. Visit by personal website at theabiola.com or business site at styledbyola.com", "claire.wilcher": "I’m Claire, just a white/cis/het human here to listen and learn. Been following you (and Ebony) for a long time now; thank you for your work and words!", "siiamhamilton": "Hi @ihartericka my name is Sii-am, (they/them pronouns) I’m an Indigenous femme from the Sto:lo and Nuu Chah Nulth nation’s of the north west coast, now known as “British Columbia”. I’m a two-spirit land protector that focuses on wild salmon conservation, anti-pipeline non-violent direct action, and land sovereignty work. I have been following you, Eb, and now Baguette trying to gain ass much knowledge as possible, and ALSO witness all of your strength on the path that’s been chosen for you. I truly believe creator has a plan for every person, and the one set out for you has been labour intensive, but also earth moving and life changing for all of us that are blessed to witness your beauty and intelligence. Gilakas’la for being a knowledge keeper and educator. You are making the world safer and safer every day for black and Indigenous people to exist. Gilakas’la (thank you) for being and existing as the outstandingly beautiful person you are. Thank you for educating me. I hope to have funds $ to send your way some day to repay you for your work. ✨❤️", "carolineee_faith": "My favorite ppl ever", "hardie.photography": "This intro is everything! I’m Whitney (she/her) and I live in Seattle. I’m a Leo but know almost nothing about what that means. And I’m so grateful for your work. Seriously, you have taught me so much and continue to challenge me - THANK YOU!!! 💕", "_jillianjackson": "Love this Intro. 🙌🏼 Y’all da best!", "tender.qwoc": "I am Nathalie, my identities include cis gender woman, she/her pronouns, a lesbian, black and also a descendant if the transatlantic slave trade. My family is from Haiti and they emigrated here about 25 years ago. I am a senior at a PWI and I have just learned how to use my voice as a black woman and not be silenced for the first time and it’s very liberating", "mimiriver578": "what is \"non binary femme\" ?", "b0mbonsito": "✨", "catlady69.art": "💓", "lizard_found_joy": "I’m Liz (she/her, Australian, half Hong Kong Chinese and half white) and my partner is Joy (she/her, descendant of transatlantic slave trade, Black American from Shreveport Louisiana ). I have a kitty called allie who is hilarious and lazy. Just wanted to send our love and support. When I read your yesterday’s tweet about boring straights trying to be queer to Joy she literally screamed out loud, as we unpack the subject often. Joy is the first woman I have ever been with and I do feel that I have found my authentic self. She is a may Gemini! I’m a Scorpio. We make videos together about politics and racial/social justice because we want our opinions as individuals and a couple to be heard. You ebony and baguette are an inspiration 🙌🏼 thank you", "dayvidyou": "❤️❤️❤️❤️❤️❤️", "tadowmarie": "Hi! TM (she/her), biracial (lantinx,white), first time mom to rainbow baby who is multiracial (black, latinx, white). From the essence of my being THANK YOU for your words and teachings! THANK YOU to Eb for your energy and loving Ericka the way you do. Y’all are true revolutionaries. Sending blessings to you both and to Baguette 💚", "noah.the.creative": "I’m Noah😆 A Black non-binary trans person (they/them) in NYC. I’m a creative in many different ways, an August Leo ♌️and my favorite food is avocado🥑😋", "granola78": "I have been a follower for a while and I am always here reading and listening(not much commenting)...and LEARNING SO MUCH and for that I am forever grateful. I keep watching your schedule and hope to someday catch your lessons in person. You and Ebony's love makes me 😭❤ so much. Am I also here for Baguette pictures and videos??? OUI.", "shawwnuh": "Beautiful, perfect family. Just missing the plants ❤️🌱", "shannonpadlog": "I love your IG, your teaching and everything you share and stand for ♥️ 🙌 I am Shannon, (she/her), white cis-het birth doula and childbirth educator in SF and work in reproductive justice and with the organization SisterWeb.org which pays community black and latinx peer doulas to support underserved families in their own communities to improve health outcomes and feelings of support, safety and dignity through the birth process.", "regenious": "Your dog being light skinned 😭😭😭 I cant with you!", "jennmcune": "Hi, I’m Jenn (she/her). Straight, single mother of two tiny humans who works in healthcare. Thank you for sharing your work with the world.", "mswrightsway\nVerified": "Verified", "connayconz": "Lmao I love alllllll of this. Sending amor and blessings to the 3 of you💕", "unicorn.from.utah": "I have been following you for a long time. And I adore your content", "aubsboggs": "Fur babies ARE children, I swear my dog is in his teenager stage - so sassy 😂, and I can’t even express how much I love the name “Baguette” for a pup 😭", "ec371": "Hey there! I’m Elise (she/her), an Oct Libra from from the uptight Northeast. Queer mama to three Black children whom I came to know through foster care. I also have the blessing of doing this life with my lover and best friend. It must be exhausting as hell to pour so much into educating and sharing your passion/brilliance/life, but I’m thankful that you do.", "moeimaornah": "Ayyyyyyyyy Moeima 🙋🏿 (she/her) dark of skin light of wit, liberiangirl 🇱🇷 Jersey born Brooklyn bred. Writer / storyteller / marketer / entrepreneur and believer in decolonizing wealth for black and other POC. Information whore so I thank you for you do to educate and inform 👏🏿👏🏿", "rochelle_rapaszky": "Holy shit there are so many amazing folx on this thread 🔥🔥🔮 💞 @ihartericka thank you for all of your work, this bio, and this invitation for people to share!", "teamarie28": "Hi @ihartericka! I have been following you for about two years now and love your posts. I’ve also used your podcast episode on gentrification to teach a sociology class! I am a fat Black queer femme, scholar-activist and August Virgo 💅🏾. I also love and believe in the healing power of aiding in the cultivation of plants 🌱. Love your work and the thoughts and energy you put in the world! I appreciate you, Ebony, and Baguette 💗💗💗", "its_natashac": "Natasha, pronouns are she/her, white, lesbian, June Gemini, proud mother of two cats called gizmo and Millie, currently studying political science💛💛", "ms_junebug": "Hi!! I love the knowledge you are always dropping!!! Congrats on the fur bebe💜💫", "prettybird_85": "I’m in love with baby Baguette!😍", "aalistew": "Hey All! I’m Aaliyah or Aali, from Brooklyn. Enby femme pronouns she/them. I’m bi+pan and in a loving relationship with the best human being I’ve ever met. I work in technical theater. I shoot film photography sometimes. Getting into essay writing. I enjoy long walks in the hood and rap concerts. I have anxiety, depression and maybe ADD, but I be chillin nshit tryna heal the best way I know how from childhood trauma my mind is now developed enough to process. Don’t have too much of an internet presence and I believe I’m a joy to be around.", "mrempoo": "Hi! Maeghan (she/her), higher ed professional from Orlando. Learning and growing and checking my privilege and sitting in uncomfortability every day and wow, has it been a wake-up call! Thank you to you and Eb for all that you do - it is an honor to follow you and see your joy and truth in all that you do. ♥️", "itszairaduhh": "Love y’all to death 🖤 if you ever need a dog sitter/trainer in San Francisco HMU 😂", "uberherbal": "Hi! I love this intro! I’m Elizabeth, live in S Oregon, single mom to a 10 year old & one doggie, Solo entrepreneur (make herbal tea blends for a living) & I’m all the way December/Sag. I have been following you for a while now & really appreciate the heart & effort you put into your posts!", "cestlag": "😭😍😭😍😭 Cutest family on EARF", "itsbrittles": "Hi, I’m Brittany!! She/her pronouns! I’m a January Capricorn and am studying to get my BA in English in Toronto, Canada! I love, love you and Ebony & I’ve been following your page for a few months!! I have one fur baby who is a Yorkie named Coco (she/her). Thank you for being the most awesome person I follow on insta!!! ❤️❤️❤️", "faiche_stiabhna": "🥖 Light skin!!! Lol", "megative": "Lmao the month distinction of the zodiac signs!!!! 😂❤️", "jeniaron": "Oh wow. I’ve been following you for almost a year and I still love getting to know you and your family. Thank you for being so open and brilliant and hilarious. I’m a Brooklyn Jewess identifying as Queer and I spread your gospel (and other activists’ word) to my white friends and family. Inclusion is the bullseye. Thank you for all that you do. 💕💕💕💕💕", "m.o.l.l.y.p.o.p": "Hello to you all! What a lovely bunch! I'm Molly. White cis straight female. November, Scorpio. Living in England with my partner, Chris cis man and my 3 year old son, Leon. I work in a school with teenagers with behavioural problems. Chris looks after our son. Thank you so much for what you put out into the world. Its been so helpful in learning and understanding how to be an allie in this messed up and unspeakably unfair world. You also remind me of why the world is a joyous place! 😍", "ms.sativafieldz": "Dog*", "jamielikesmakingthings": "Hi I’m Jamie (she/her). I’m cishet and a mayo demon who is trying hard every day to be less of one. Im an October Libra from Woodstock (I have a lot of mayo demoning to undo) and I’m married to a very kind and teachable man (who joins me in following you and Ebony and is willing to have hard conversations while we try and do all the work from the inside out). We have two dogs, Frank (I am fairly certain he has been a cranky old man since birth) and Harry (the sweetest tripod I ever did see), who was just given to us a week ago by a man who worked at the lumber yard because he couldn’t keep him! I also have a whole bunch of plants (like 50???) that usually make me feel calm but currently are stressing me out cause they need tending to and I have been neglecting them.... TLDR though, I am extremely grateful for you and Ebony every single day and honestly this is gonna sound so creepy but I try every day to live in a way that would make y’all proud to know me, even though you don’t. You are life changing, and I don’t even mean for me, a white person, I’m thinking of the people I don’t hurt anymore because of your willingness to educate. Or at least I’m causing less pain, I hope.", "sarahbixler": "Thank you for your for your words, honesty, strength and humor. I learn so much from you.", "renaorofino": "Dear, you are inspiring... I’m a Brazilian woman (daughter of miscegenation, but perceived as white), queer and questioning (my autocorrect put questionable instead, but let’s ignore it)... I’m a science education researcher at a university here in BR... I’m here because a learn a lot from you...😍", "lynnemonsoon": "Hi there! I’m a white, trans/nonbinary, poly person from Chicago. I make zines, knit, and work with an organization that sends books to folks who are women and/or trans in prisons. Oh, and I use they/them pronouns and have a pretty cute cat.", "rahwetsa": "Hi, I am Rahwetsa, born and raised in Limpopo South Africa. I am an aspiring writer and a counsellor by profession.", "tracy_pants": "Thank you for sharing 💕", "smelly__kellie": "I didn't know Eb was your manager! I mean, it makes sense, you're both so dynamic individually, of course you'd be a powerhouse team!", "ejmichaelis13": "Hello! I am EJ (she/her), and I am a white lesbian. I am 17 and just moved to New York with my family. I am a march Pisces, but frankly I do not know what that means. Astrology is not my strong suit. I hope you are all having a wonderful day!", "kathrynlstamm": "this was such a lovely intro even though ive followed for a while, your voice is so strong and warm and funny! I’m grateful to hear it", "_paolacespedes": "hi fam! I am Pao, or Paola if it rolls off your tongue. Just not PAULA. I am a bisexual Afro-Dominican cis gendered woman. I work as a publicist, but I am creative non-fiction writer. I just moved back to NY (crown heights) but I am proud to be a jersey native. I deeply love and admire you, eb, and little baguette. Hope to meet you sometime, and thank you endlessly for all of your knowledge, insight, and work that you do. Like I truly truly love you. 💞", "mayowasworld": "I love this introduction and more specifically I love that you said this dog is light skin 😂😂😂", "thebrownbunch5": "Aren't cockapoo fur babies just the best little wee beings on this earth??? 😍😍😍", "carry_on_girl": "I’m Steph (she/her) bi and boring cis & white fiery april fool’s Aries that is so thankful that you’re willing to put so much energy into a public educational resource here on insta because lord knows I’m not hearing anything like this in backwoods western PA where you can find more confederate flags than black people 🙃 (I also adore all the plant stories and baguette makes me miss having a dog)", "melanityy": "I’m melany (she/they) gender-variant, queer individual. Born and raised in Nairobi, Kenya currently studying in wales ... my research interests focus on immigration and the queer community especially in east africa ... I hope to be able to work with and learn from queer folk in Africa and the African diaspora", "discoversexnlove_kayla": "Hi hi! Kayla (she/her) here, a black, bisexual, partnered ethically nonmonogampus lover of knowledge. Currently pursuing my dual masters degrees in social work and human sexuality at Widener. I grew up in utah and carry so trauma and work to do around growing up in a state that is 85% white and 2.6% black. Adjusting to the big love to the east coast to pursue my dream of being a sex therapist. I was introduced to you through the widener program, you were a guest speaker for (Dr. GILBERT). Thank you for continuing to do this great work, educating me, and allowing us a peak into your life with your partner and puppy. 😍😘", "cavigonz": "Carla Viviana González (she/her). October Scorpio (10/23). Queer Chicana, social justice advocate and barrio scholar educator. Just finished my first year of teaching! US History, Ethnic Studies, and Chicanx Studies. Love you and Eb! Your work is such an inspiration, my students and I have listened to your IG highlights in class, they love y’all! Thank you for all that you do. I can’t tell you how much we all appreciate it. 🙏🏼", "dariawashington__": "I’m Daria , I identify as a cis gendered female lesbian!! My pronouns are she/ her/ they! I’m a lovely 20 year old Leo ♌️ with a Sagittarius rising and a Taurus moon🌚 I currently work at Whole Foods and trying to go to school for cosmetology 🥰 also I love you guys so much!! My dog is black to literally and ethnically lol", "adrianasorrentini": "Wepa Ericka! And Ebb and Bagguie, too! I'm Adriana: (she/her/ella). May Taurus ☀️ from Cabo Rojo, Puerto Rico 🇵🇷 living in NYC and studying Musical Theatre in college. Queer actor, singer, dancer, musician, writer, poet, and dramaturg. I'm also a soon-to-be plant mami as you have lowkey inspired me to become one. 🤧 I hope to meet y'all annd attend one (or more!) of your workshops someday! I can't tell you how much following you has inspired, changed, and shaken me. Thank you for all you do, the both of you!! 🙏", "_gouchie_": "Your dog gives 0 fucks about pronouns looooool", "iamphoenixj_": "Hi @ihartericka ! I Am Phoenix. Thank you for being you. I follow your work and I must say you and Ebony are the shit!!!! #squadgoals", "raquelenid": "You are an amazing source of challenge, confrontation, and truth to me. Thank you. • Hiiiii!!!! I’m Raquel (she/her). Queer Puerto Rican (born and raised in Fajardo, PR) now living in Chicago with my partner. I’m a theatre-maker (director, performer, educator) specializing in Devised theatre and movement work, and I co-lead a company (@lavueltaensemble) with the focus of being a minority-led physical theatre ensemble where the majority are POC. • Learning to manage my whiteness as a latinx person, especially my privilege when working with minority-led theatre.", "iguessmaybe": "Hi! I’m Alison, she/her, white, cisgender, straight, resident of Minneapolis, MN. I’m an elementary general classroom educator, and love nature and learning. I appreciate y’all and all that you do. Thank you!", "amandaeleaf": "Hi! I'm Amanda, a cisgender, fully July Cancer (🎢) living in Los Angeles with chronic illness (lupus, among others.) I am striving to be a cannabis educator and advocate, particularly for folks with illness. I work at Trader Joe's and love my interactions with our customers, so if you see me, come say hi! I'll probably suggest a way to make that dessert even more delicious 😈 @ihartericka you are one of my favorite people on Instagram, and you, Eb and Baguette are family goals for sure. 💜", "tessholliday\nVerified": "Verified", "ms.shadymcgrady": "Heyyy I'm Kahlia (she/her), Black and androgynous (perhaps) from the South (NC to be exact), I'm in a sexual curious space in my life so im guessing that would be considered questioning but all of my partners have been men thus far. Black feminist/womanist looking to go into advocacy work around comp sex education and maybe become a sec educator in the future. And I basically kicked my original plans of being an accountant to the curb so im also hella anxious. 😅", "girlfromwestcountry": "Tori, white, asexual, and a fellow May Gemini in Florida. Been in recovery for a 20 year eating disorder for the past year, learning to love myself which is the hardest thing I've ever done. Thank you for your wisdom and knowledge!", "katesk106": "Hello! Kate - cis, white, October Libra to the extreme. Educator, mother, partner. Michigan native, Seattle resident for now. Thank you for the education you & Ebony provide in so many platforms and in so many ways. And thank you for sharing the joy of plants 🌱 and baguette 🥖 with us!!!", "sparklejams": "Hi Ericka! I’m a white superfat queer femme opera singer and artist and I think you are the very greatest. Thanks for all you do.", "dayosenergy": "🦋", "amyesatto": "Y’alls work is so important to me and valued. I send people to your account all the time. Feel free to post more $$ reminders to your followers. We owe you lots!", "agardenofstars": "Hi sunshines!! I’m Ljubica! So nice to virtually meet you!! 🥰💛 My pronouns are she/her, I’m a November Scorpio (Scorpio moon, Virgo rising), a lesbian married to my best friend and soulmate Amanda 💕 still figuring out the rest of my identity & expression though. Gotta work through the dissonance created when being perceived 😅 Our family is us and our baby cat, Ari, who is a Sweetums and the cutest living being you ever did see!! 😻 I’m a UI/UX designer, front-end web developer who works remotely. The projects I create outside of work all center around resource distribution and making sure access to the gargantuan amount of information available online, from simple how-to’s to linking people with organizations, foundations, other individuals doing the work they need, reaches the right people. They’re slow rolling projects, nothing out yet since I’m working on my off time, but I’m hoping to start releasing info soon!! ✨✨ Thank you so much for all that you share & provide for us, I’ve learned so much just from having you as a presence in my life and I’m just waiting on some financial stability to compensate you for all you’ve given. From the bottom of my heart, thank you 💛 and if you’re ever in need of someone to mess with code, or build you pages or informational structures, just let me know! I’d be happy to help! 🥰✨", "livbrookshire": "Okay that’s the best dog name ever", "lenna_kai": "Hi I love your fam 🥰", "emiliad": "My forever First Family.", "merahwolf": "Hi Erika! I'm Meg (she/her pronouns), white, cis, queer, also a December Sag (I think our birthdays are right next to each other!), proud plant parent, wfh analyst consultant, and passionate artist. In the process of a big life change and moving to PA and excited for the future! I love everything about your account - its so nice to e-meet your family!", "nakeishav": "🖤🖤😍", "kammie1217": "Hey I’m Krystal♥️ I’m a cishet December Sagittarius with she/her pronouns born and bred in Brooklyn👍🏾 I work for two fantastic smaller female owned jewelry brands, and am a big news geek. I produce my own music showcases and am involved in the NYC diy music landscape. I’m thankful you and Eb exist, as well as other black and queer educators because I learn something new from y’all daily.", "genderfenderbender": "Mari (they/them) I’m a queer, nonbinary, intersex femme living in Sacramento. I work at an LGBTQ homeless shelter and advocate for legal/policy change that will better the LGBTQ community! So happy to be following you and seeing where life takes you! 💕", "iveynyc": "Hey 👋 @ihartericka ! Does EB have a brother/twin/friend/ somebody like him ? I need that kind of Supportive Somebody to have my back like that 👏🏾👏🏾👏🏾", "insomnaleptic": "I'm TJ (she/them) an asexual, disabled, NB mixed, femme. I'm an academic (music history with focuses in semiotics, narrative, and animation), and a dedicated ghost follower. I'm glad to share a little bit of myself with you today (*sweats nervously *). Aside from music research and performance, I play video games, get tattoos, and try to give Skrivva (see avatar pic) the best life possible.", "gellybelly91": "Love all of the above!!! Hi there!! I’m Gillian, Italian American, grew up in Jersey near the shore with a crazy Italian family. 25 cousins, a 91 year old grandma still swinging around her wisdom for all of us. I have two younger brothers who are the SHIT! So funny and warm and cool. We grew up with a trans parent. My dad...aka..Maddy, Geena, transitioned 20 years ago. Her partner, heike, and her have been together for about 6 years now. Since graduating college in 2014 we have slowly but surely blended our family. I moved to nyc 10 years ago for college and am now in Brooklyn. Love following you and Eb! Hope you both and the pup are having a great week!! 💕💕🌟🌟🧚🏻‍♀️🧚🏻‍♀️", "el_jay_the_lion": "Thank you for sharing your world with us. I hope you know you’re making an actual difference. Actual changes are occurring from your honesty, knowledge and power. Thank you to you and Ebony!!!", "hola.lolasam": "And I gotta say im annoyed that the signs are true. Im a libra. All about balance and shit. Which I never have its the hardest thing to find my zen I got no chill more than 70% of the time. It gets annoying to everyone im aware of myself. Anyway. So my spouse is leo cancer. No joke. His bday 7/23 the 1st day of leo. Hes a mf. He is legitimately 50/50 cancer and leo. My cousin (bff) is cancer. Her partner of 6 yrs is a cancer. My parents are both cancers. My sister my plague my kryptonite that mf is a leo full fucking on. Then my gpa is leo. Gma is pisces. Kids are sag ((dec 14 , 12!!!! We got a preteen friends and enemies!! < tm I believe Ericka)) and virgo (8/27) my other bff is virgo. My spouse bff since 3yrs old is a libra. My spouses dad (pos) libra. His brother? (Unfort paranoid-schizo... been thru it himself and he has also made others go thru it too ...) libra. Some ish just isnt “coincidental” this kind of fate truly isnt. 💖", "clari.cita": "Beautiful photo!!! 😍😍✨", "imaquariusjones": "❤️❤️❤️", "bahsghetti": "Hi! I'm a December Capricorn in every sense, and I've been following you for over a year now. I'm mixed but really white-passing. I don't know my pronouns- I don't feel like I identify with any. I'm a biology major and I'm also studying herbalism. I've noticed that a lot of people get upset or hurt about the things you ask your audience, but I love that they give me much to think about and consider. Y'all really do brighten up my feed! Thank you!", "willa_i_am": "❤️❤️❤️", "_naomiallen_": "Deep east Oakland 🙌🏾 and also talk more about non binary femme and trans masculine please", "nguest": "Natalie (she/her) hetero, cis, white, momma, engaged to the love of my life. WPSL, Living in Indiana and making a conscious effort everyday to learn from anti-racism educators and do better and demand better of white people. No excuses. April Aries/Taurus ♉️ (born on the morning of the cusp)", "thinkinfinity": "Love your little family. I’m Lily (pronouns she/her). I’m a September Virgo and have been in the healthcare field for years. I’m working on becoming a registered dietitian. My goal is to become a certified Health At Every Size dietitian because bodies at ALL different sizes can be healthy and beautiful. I’m married to my best friend (2 years this month) and we have 2 fur babies Kylo and Poe. I love your unapologetic portrayal of your body. I think it does everyone good to see all different types of bodies, and see the beauty in the uniqueness of them all. Thank you for your willingness to educate, I’m sure it’s hard at times but it is so appreciated!!!", "joharihuggs": "fellow may gemini here to add to the comment tally since i hear the algorithm’s a bitch. 👋🏽", "imanisophia": "Hi yall, Imani here(she/they pronouns), Black af, fluid, nonbinary femme, May-Taurus 😊. Yall are one of my favorite queer couples Baguette is sooo luckyyy to have wonderful parents like yall😫 LOVE YOU and you both inspire me to be myself, and be unapologetically black and queer ❤️❤️❤️", "shablisterri": "Hey 💘 I’ve been following you a while! Love you guys, you’re like insta-family!", "majiqmac": "😍♐️ gang gang", "gucci.nut": "BA G U E T T E OMG 😭😍💘", "msscarabelle": "I'm Sarah (she/her pronouns). I am a white, cis gendered queer femme. (Mostly). I am from the deep south but haven't lived there since I was a teenager. I have a white, cis masculine husband who is deeply amazing. We have two children. Everything I just said goes a very long way to explain what kind of privilege I hold in the world. I fairly new to the world of @ihartericka and Ebony. But I stan. Here in gratitude for the space you create and the work you do. I learn daily.", "the_lez_bear": "Leslie, born in São Paulo, Brasil but living in and loving Philly for almost three decades. I learn a lot from you. More recently you’ve really helped improve my communication with my partner. You and Eb are definitely #relationshipgoals. You also regularly have me questioning my own racism as a latinx individual. I took a train to Hartford last week and as I passed NY I thought, what are Eb and Ericka up to 🤔", "ruffycastillo": "Hi Erika, Ebony and Baguette!💕 Ruth, pronouns (She/Her). Light skinned privileged cisgender Mexican American. Early Childhood Educator. Texas native. Brooklyn living. December Sagittarius. I secretly hope to meet you both one day to thank you for all of your work! I appreciate y'all! 🌿", "iwannadie4000": "lovely family!!!!! i’m Evan , a white queer trans masculine man (he/him pronouns) I currently live in Baltimore MD , i’m a october scorpio, i’m a full time barista and drink too much coffee im starting college in the fall and then transferring to a school in ny in the next 2 years!", "veggiecomrade": "Hi Ericka I’m Jordan - white, femme queer woman and sociology student and my dream is to see you teach in person. You and Eb’s relationship is so beautiful and I live for him standing up for you. Thanks for all you two have taught me. Sending love from New Hampshire 💗", "thats_your_dad": "🙏🙏🙏💖💖💖", "beyondrosetta": "Hiiiiiii! I'm working hard to dismantle the power structures I have business dismantling and I draw real strength from your leadership so thank you 🙌 I'm a queer Londoner, archaeologist (hell of a lot of dismantling to be done here!), November-Scorpio. and helllLLLLLOOOOO Baguette you pudding you 😍", "blood.cup": "Hello Erika and Ebony and Baguette 💕 I’m Lou the Jew hehe, a feb Aquarius non binary (zhe/zhir/he/she/they) and pan. I live in SF with my partner and our 2 dogs, Charlie and Lafayette, and work at a femme owned 100% non toxic salon. My partner is a manager/buyer/events coordinator at an independent bookstore. She’s a feb Pisces. Our dogs are adopted so who knows ¯\\_(ツ)_/¯ love you and all the amazing work you do. Hope you have an amazing day!", "bootasha": "Natasha (she/her) Black, April Aries from north Jerz (work in NYC) 🙋🏾‍♀️ My cats are Black too 🤣🐱🐱✊🏿 Love you and Eb and the new pup and the plants 💕💕", "chloe_greenbeans": "Sooo sweet, lovely to meet you guys!❤️ I'm Chloe (she/her), cis bi light skinned august leo and pretty much embody the saying \"Still waters run deep.\" I'm from Texas but moved to Baltimore for school to study general fine arts and curatorial practices. My career dream is to become a curator or historian/documentor for African art in an effort to deconstruct the colonized and primitive nature the west gave it, in order to unravel the deep-rooted effects of colonization and slavery on black bodies everywhere. Woo that felf like a mouthfull.", "kristin.is.cool": "Kristin (she/ her), white, queer, married, Leo through and through. Thank you for the education you give the world. You're making it a better place! I am so glad you and Eb found each other. Your love has been a beautiful thing to witness from afar. 💙💚💜", "salimasees": "♥️♥️♥️", "jalen.xx": "💛", "tittygap": "Sag gemini ?? Iconic", "leolia810": "You said yes our dog is Black - just light skin 🤣😭🤣", "mynapturalself": "❤️❤️", "steeledossier": "Jessica: pronouns (she/her/they), black, pansexual, March-Pisces. Psychiatric Registered Nurse. Activist. Underground Music enthusiast and occasional womanist grassroots festival organizer. Mother. Upstate NY💖 y’all are everything I aspire in my life. Plants included.", "semaje__": "Hiiiii beauties, I'm Semajè (Se-ma-jay) also my pronouns are she/her/They. I'm an unapologetic free spirited soul. Queer. An educator. An artist (& no I'm not an ig artist who steals from from other artist but i am an emotional artist who creates from my feelings...a gem being a pisces moon). February-Aquarius. Thank you for continuing educating and sharing your stories/life with me 🌻", "simonelovesfitness": "I’m Simone from a little town in Cameroon. Watching the videos of Ebony in your stories defending was so amazing. The world need more partners like him and yeah he dropped too many facts. Couldn’t even keep up 🙌🏿 And yeah see ya at the gym 💪🏿💪🏿", "rayanarwhal": "swoon 😍💞", "whopaigejones": "Thank you 💓💓🦋💞😍👑👑 such a blessing", "maiyshagriffith": "I’m Maiysha. A NYC transplant in Charlotte. About 5 years ago I was introduced to you by my boyfriend who was desperately trying to help me get out of my Breast cancer depression. He showed me a pic of you at Afropunk and I fell in love with you and myself all over again.I’ve been a hardcore follower ever since. I love everything about you and your little family. I am also boycotting Afropunk until I hear that you and Ebony received an apology and give it the green light. I will one day make to your sex Ed class", "sixfifty_nikki": "😍😍😍😍😍", "chelbro1024": "Thank you for teaching more in your instagram stories than I learned in 6 years of college FOR REAL. I’m sorry for any violent backlash you received for your most recent post (and for any you receive regarding anything although “sorry isn’t nearly enough”)You speak the truth, you have reworked my mind, and I worry I will never be able to find the right words to articulate how much being able to have access to your brilliance means to me. I just need to thank you from the bottom of my heart. Baguette has my whole heart and the way you and Ebony express just pure unadulterated love for each other is a privilege to watch as well. Thank you will never be enough but thank you so much.", "wiolarebecka": "💕", "thegirlonawire": "Morena korua. I'm Kayt from Aotearoa and love following you both for the knowledge, the fun, the fashion. Has helped me a lot in unpacking the racism that exists here in Aotearoa. Hope that Baguette enjoys their first taste of the outside world!", "llaurell16": "omg what does baguette do with paper towels???", "halfblackmagic": "Thank you for introducing your beautiful family! Appreciate the free education from you and your partner and hope to keep learning and loving about black identity and how to move in toxic spaces. Cannot thank you both enough for saying things out loud that we are all thinking. Thank you again for all that you do!", "the_obliviator_": "heyyyy im maitreyee from india, queer, any pronouns, and about to start med school ! i am in love with someone and i hope i marry them someday. i also saw your stories while you were at the bts concert and am very happy about them for some reason. *waves at you vigorously*", "adrsins": "Find someone that looks at you the way Baguette looks at Eb 😍😍😍😍", "celiatorrey": "hi!! i’ve been following you for a little while now and i find your posts and stories really educational and inspiring especially as a privileged cisgender white person learning how to be more aware and work to dismantle the oppressive systems i am a part of. i appreciate your work and you 💓", "monimimimomo": "Hi hi! My name’s Emoni (she/they) and I’m an annoying and childish Pisces who’s overly affectionate and addicted to sweets. I’m trying to learn about equality and the isms that impact us everyday and teach to others while also deconstructing the flaws and isms within myself. Artist, college student, future professor, and plant wearer✨", "ealytea": "She’s lightskin😂", "accio_mrs.norris": "So nice to “meet” you and your beautiful family! I’m Jen (she/her pronouns). I’m a queer, cisgender, mixed (Middle Eastern & white), January-Aquarius human living in Seattle. I’m a midwife who works in a county STD clinic that mostly serves the LGBT community. I am a vegan and a runner. I have two tuxedo cats (Malcolm and Tidbit) and a super sweet cismale life partner named Aaron."}