{"deekshahahah": "The palace of illusions by Chitra Banerjee 😍", "100bhagyaaaa": "It is not possible to have one favourite book, but I read this book recently and it is called Ladies Coupé by Anita Nair. In simple words, it is the only book I have read so far that is solely about women's experiences and from their perspectives. What I like the most is the fact that it is experiences of women from various social classes, backgrounds and age groups.", "hotprieststan": "I recently read Home Fire by Kamila Shamzie, and loved it! But Harry Potter and the Prisoner of Azkaban for a pick-me-up anyday! Congrats @supaarwoman", "orangejuicegrandma": "'A Place Called Here' - Cecelia Ahern. The concept is simply amazing and unlike any other.", "sarahkutiyanawala": "Not going to waste your time: Turtles all the way down!", "blur_ry_face": "Frankenstein by Mary Shelly", "shivanee._": "Wonder by R J.Palacio and Milk and Honey by Rupi kaur ❤️", "itsrashishah": "And the mountains echoed-khaled hosseini", "mahak__2000": "Da vinci code by my favorite author dan brown😍😍😍❤", "twirlonthat": "The subtle art of not giving a fuck by Mark Manson. Some books just change your life and this is one of them. I could frame every page of it in my house. The time I read this book was perfect because helped me with a lot of unresolved issues.", "chaitnayakamboj": "The tusk that did the damage", "shivani_tannu": "Looking for Alaska - John Green!", "navitapradhan": "A Fine Balance by Rohinton Mistry. Perfectly melancholic and heartbreaking.", "thequeenofweirdos": "Perks of being a wallflower", "annmseb": "Upstream by Mary Oliver", "_riyaasrani": "P.s.: Had to be a part of your giveaway! Our #SkinnyGoddess forever.🎈", "pun.khuri": "A thousand splendid suns - Khaled Hosseini and The Picture Of Dorian Grey by Oscar Wilde! I just love their writing styles", "ahonakay": "Coraline*", "kritikhatri_": "South of the border, West of the Sun by Haruki Murakami", "afrost6599": "The Day We Dissapeared- Lucy Robinson", "veebee16": "🌼Looking for Alaska - John Green🌼", "anushkasinha096": "Never Let Me Go by Kazuo Ishiguro", "simplybansari": "The Book Thief by Markus Zusak 💙", "notacleverusername29": "The stranger- Albert Camus...have some great memories attached to it.", "indhu_mathi11": "Congrats on reaching 5k!! My favourite book is Little women by Louisa May Alcott", "iinsanewoman": "God of small things by Arundhati Roy", "latikatagra": "Jane Eyre by Charlotte Bronte", "archanaaaaaaa": "Perks of being a wallflower", "okidokialooloki": "One of my favourite books is Simon vs The Homo Sapiens Agenda by Becky Albertalli. It makes you question a lot of things AND it's adorable. (my fav kind) A great quote from the book - \"White shouldn't be the default any more than straight should be the default. There shouldn't even be a default.\"", "imruchica": "My favorite book is The Palace of Illusions by Chitra Banerjee Divakaruni. It is a retelling of the Mahabharata Saga from the gendered lens of Draupadi or Panchali as she's called in the book. The author has done an amazing job at sticking to the original epic. One must have heard generally from many, how Draupadi was the reason behind the war. But this intriguing book changed my perspective. The narrative is telling of the life and travails of Draupadi, the woman who was born out of fire, married to five of the fierciest warriors of her time, the Pandavas. Beautifully written and captivating. Ending this post with a quote from the book 👀 \"I thought that if lokas existed at all, good women would surely go to one where men were not allowed so that they could be finally free of male demands.\" 💢", "keshav_9tiyal": "The Hitchhiker's Guide to Galaxy - Douglas Adams. It's a masterpiece!", "anusharkashyap": "\"It is our choices, Harry that show us who we are, far more than our abilities.\" The Harry Potter series. For being more than just a piece of fiction. For moulding me through words. For inspring me to read hundreds of books. For teaching me about friendships, love and sacrifice.", "shwetabhartia": "How to kill a mockingbird. A masterpiece for sure.", "tansntunes": "John Green ❤️ Paper towns, Looking for Alaska. I need to read his latest - Turtles all the way down.", "icha275": "The spy - Paulo coelho", "chotaapandaa": "The Second Sex. This one is relevant irrespective of century we live in 🙃❤️.", "okridhika": "All The Light We Cannot See by Anthony Doerr! I've been wanting to get my hands on this for the longest time. Well-wishers as well as strangers have spoken so well about this one! ❤", "k4ran": "The curious incident of the dog in the night time - Mark Haddon.", "dodh_daayi": "This is such a sweet gesture! Love in the time of Cholera by Gabriel Garcia Marquez, The Lowland & Unaccustomed Earth by Jhumpa Lahiri, The Ease of Forgetting by @harnidhk , The Hungry Tide by Amitav Ghosh. Thank you for doing this. Got so many book recommendations in the comments!", "theblackwallflower_": "Anything by Haruki Murakami, Lang Leav..oh wait, even Persepolis! Sorry, can't choose!", "tishatalwar": "You by Caroline Kepnes. It's a story of obsessive love written from the point of view of a stalker. Chilling, yet addictive.", "sanjanamishraa": "And congratulations on the 5k! Yay!", "sarayaaaaar": "40 rules of love - Elif shafak", "nami.ra__": "Heyyy Congratulations on 5K #skinnygoddess i want this Storm and silence by Robert Thier book so badly... Xx", "sarcasticlad": "Congos skinny Goddess and I would love \" An Ordinary Life : A memoir\" because it not available in my country plus we can initiate some Indo-Pak peace process ✌", "pizzandchanel": "The Catcher in the Rye by J. D. Salinger ❤️", "tarunimapanwar": "A strangeness in my mind by Orhan Pamuk", "aishrma25": "How to be a Bawse, or Scion of Ishkvaku, or harry potter and the deathly hallows. ❤️", "takameshikoro": "Any book by vipul prakashan", "irrashinal_": "P.S: Loving the book suggestions in the comments!", "arshiya.chauhan": "Yay! Congratulations on 5k milestone #SkinnyGoddess Choosing one favourite book is difficult and I am torn between ‘The Metamorphosis by Franz Kafka’ and ‘Men without Women by Haruki Murakami’. I think I’ll stick with The Metamorphosis simply because it single-handedly changes the way one treats people. The book is simply flawless and I think Kafka’s one of the best Existentialist Literature.", "anoushka__shetty": "Shantaram- Gregory David Roberts", "ilsarazzak": "The Handmaid's Tale by Margaret Atwood", "garimakunzru": "Shantaram ♥️", "meghna.bhalla": "Stieg Larsson series💟💟💟 And anything by Sidney Sheldon😍😍😍", "harshitimbadia": "Shawshank Redemption by Stephen King.", "blrgirl": "Anything by Jhumpa Lahiri or Chimamanda Adichie.", "wotohhaialbela": "The Godfather", "griishshetty": "Omg thats such an amazing giveaway..... So I have read lot many books bt my all time favorite will remain 50shades of grey I knw this is too typical bt I love it and apart from that m reading little girl gone by Alexandra Burt that's amazing too.... Hope I win this😊💃💃💃 @supaarwoman", "theressudeep": "Serious men by Manu Joseph or anything by Manu Joseph really", "adhikaarie": "Robin cook Mutation", "vaish.sanap": "A thousand splendid suns by Khaled hossieni", "tarushi_00": "Daughter of smoke and bone by Laini Taylor", "psychganya": "Night falls fast is my favorite", "geetikathatsall": "Whitney, my love.", "ananya.rath.mohapatra": "Anything Harry Potter and War and Peace", "sargam.agg": "The Martian", "eshaadutta": "Congratulations #skinnygoddess ✨ my favourite book is Atonement by Ian Mcewan.💝💝", "minastirith01": "Catcher in the Rye.", "abhimadhussain": "My favourite book is The Lowland by Jhumpa Lahiri", "shagun1597": "My favourite is sita by Devdutt Pattanaik", "dirtycaffeinater": "Yay! More power to you. Oh yes, and the book is Norwegian Wood by Haruki Murakami. Sending lots of sassy power and badass vibes to you Skinny Goddess! 🌸💟", "thepappadwoman": "One flew over the cuckoo's nest.", "chakraborty_ratnadeep": "The Ministry of Utmost Happiness", "bakchod_pevansh": "Favourite book Concepts Of Physics by HC Verma", "thefieryifrit": "Yaaaasss Congratulations! My favourite book is The Great Gatsby by F Scott Fitzgerald and The Shopaholic series by Sophie Kinsella ❤❤❤", "devilwearschanelno.5": "I am so stoked....i work with stray dogs and it's so so awesome.... therr are just so many books to name a fav... the outsider Albert camu; death in the time of cholera garcia Marquez; Wuthering heights", "catphotographr": "I'm going to say Aristotle and Dante Discover The Secrets Of The Universe by Benjamin Alire Sáenz because I don't think it gets as much recognition as it deserves!", "beingnita": "A thousand splendid suns ! I have 4 copies, cause I keep buying them everytime I'm in an airport. That book deserves a re-read every few years !", "fairyygoblin": "Yayaya congratulations! ❤️ My favourite book is I’ll give you sun by Jandy Nelson. ❤️", "usribee": "Yassss! My favourite book (right now) has to be Mrs. Dalloway because I never thought I'd have the commitment it needed. 😁", "bikgayelife": "Hurray Congo!! My favorite novel for now is Origin by Dan brown. And cheers to you skinny goddess!❤💙💙", "ektawho": "The Perks of Being a Wallflower by Stephen Chobsky", "sanjukta_kumar": "Thousand Splendid Suns by Khaleed Hossieni. ❤", "mrinaha": "My love for reading is so intense that I do not have one favourite book. I feel like I'm not doing them justice by picking and choosing. However, currently, I'm reading The Lives Of Others by Neel Mukherjee and it's pretty good ^.^", "akansha._.kadam": "Bad feminist by Roxane Gay ❤ Congratulations! Supriya.", "nayantarabagla": "God of Small Things Arundhati Roy and the entire Harry Potter series. 💗💗", "srishtuuuuuuu": "I love the Robert Langdon sereis by Dan Brown. Love you #skinnygoddess", "simransaluja7": "Funny boy- Shyam Selvadurai is my current favourite. Amazingly enriching yet deeply saddening. Its gay fiction. Much needed. Giveaway aside, Loooouve you! #skinnygoddess", "lgbtkfc": "My favourite book is song of Achilles by Madeline miller. It’s about the love between patroceles and Achilles during Trojan war.", "sonzkaur": "blessed by the one and only #SKINNYGODDESS", "soumyaaaah": "Yayay you did it 5000 followers!!! Well my favorite book is it's always the husband by Michele Martinez", "fumblingthoughts": "#SKINNYGODDESS Rocks! ❤️❤️❤️❤️❤️", "dhwanibhinde": "The Ministry of Utmost Happiness 😁 Also congratulations gawjuus ❤️", "threedogsinatrenchcoat": "Crime and Punishment by Fyodor Dostoevsky"}