{"antrabhargava": "The hardest thing in life is not knowing what you want. And you can't force it. The key is to keep doing something, keep trying, and do for someone else with no expectation of return. Eventually it will come to you when it is right for you.", "oyeuju": "This was much needed.", "soroseynot": "❤️", "dishaj_dj": "Thank you for this ❤️", "satyayay": "❤🙆", "_saakshit_": "@leksnmisti read", "bipolar_heart_": "@norealplan_", "pugnacious89": "I can relate to thinking these thoughts in the past! You have fantastic hand writing.", "sanha_arora": "You Are a True Superwoman.... I adore you a lot...<3 Whenever I feel low I take time to visit your profile, You are like a Light to me In my present dark struggling Life. Stay the Same best wishes to you always..<3", "dhruvshah96": "Thank you. Love this. Needed this.", "onerandommuskaan": "@snehal.l", "jsuper.kaur": "U really should have won the BoPo award.... love u.... More Power to u !", "bhavyasetiaa": "❤", "ravya__": "@supaarwoman really needed this❣️", "ananya.kriti": "❤️❤️❤️", "ruhiiii16": "I couldn't thank you enough for this. Need this. Thank you.", "rachna190": "Thanku! Thanku so very much!", "gltiched": "the 2010 you is the 2019 me. and reading this post gave me a lot of comfort. you are one of the people i look up to a LOT, and that's why i'm so thankful that you shared these intimate thoughts, because now i can see how far you've come from THAT human (so unsure of basically everything) to someone so amazing and confident (in so many of their endeavors). thank you! and we're proud of you! you nice, keep going! uwu.", "supaarwoman\nVerified": "Verified", "deeptisunder": "💖💜😘", "abhishekexplores": "We love you! Keep going.❤️", "douknowashwathy": "This. This right here is what I needed today. YOU ARE FREAKING AWESOME", "tahira11914": "You are a worthy existence. Love❤️", "thesunshinescalling": "Beautiful! So glad to hear you point out that purpose and direction can change too, to not stay stuck to one path just because it brought you alive once.", "_sabilam": "😘😘😘", "food_and_fragrance": "Life right now 😪", "shamoli16": "Thank you @supaarwoman for sharing something so personal, I admire your courage and beautiful heart. I really hope things work out for you in coming future too as you want them to be ❤️", "samibinte": "Thank you for sharing and existing! Truly bring a smile to my face everyday", "screamingmalice": "💜💜💜💜💜", "houseofballoons": "@candace_reve 😍", "gemmanewbery": "This is how I feel right now, but I also know it won't be forever. Thank you for sharing. ❤", "miss_m.i.s.s.y_": "This is exactly how I feel everyday... I don't know how to explain but this thing explains exactly how I wanna tell and how I feel.... Tysm @supaarwoman for sharing this 💖", "deepblueruin": "Thank you @supaarwoman for your courage everyday ❤️", "moonchild_rishika": "thankyou Supriya ❤:')", "subhambhardwaj": "This is so me..😂", "virtuesovervanity": "Bravo girl best of luck for life", "fairyygoblin": "Thank you. I love you. ❤️", "sbhatt2910": "Wow thank you", "tansntunes": "❤️❤️❤️❤️❤️❤️❤️", "deadpan_mostly_": "Exactly what i needed on my Birthday, @supaarwoman ❤️", "_basicbrowngurl_": "I love you! ❤", "iakankshagautam": "God!!! This is wat I feel for myself n then don't know where to go...like really!", "xoyashna": "Thank you for sharing this personal note. Honestly, I feel like you are such a great Instagram influencer that is changing people lives. Because of you, I realize that other girls go through similar personal struggles, no matter what they look like or where they live. We should go through that alone and also we should not let anyone else tell us how we ought to look. It is because you show us the realest you (and your awesome facial features) that makes you one of the prettiest girls on this platform. Keep doing YOU girl 💜.", "miswac": "this will keep me up for nights now", "oshmitascha": "Hey I'm glad it turned out so well for you. You are an amazing amazing woman with a kickass personality. You look approachable and sound genuine. You're great human and I'm just glad you're out of that phase. Cheers to you.", "komalchhabria": "👌", "i_pratiksha": "❤️", "_neyalee": "Thank you so much for sharing this. It feels \"safe\"(I'm not sure if it is the right word) to know that you are not the only one who is going through this phase. At this point you just need someone to support you , someone to motivate you , someone to tell you that it Is going to be Okay. Honestly I can't even picture myself after 5 years but hope is what keeps me going. Your posts give me that hope, superwoman! Please keep inspiring me. <3", "thisistarunzz": "this is what i m feeling right now that what the hell i am doing with my life", "sokneeoh": "💙i love you.", "dhanashreemulay": "♥️", "itshimanshiii": "I feel you and I love you 💗", "shrutisetakkar": "❤️"}