{"apoorva.19": "You're amazing! Don't let anyone get you down. Much much much more power to you! :)", "aditi_paul": "♥️♥️♥️♥️ i think I’ve fallen in love with you..", "nomadictej": "You are vaaaaaary vaaary varrrrrry beautiful... I am in Louve with you.. pls don't give a fuck to that moron asshole... U have better things to focus on... Keep up ur good work.. I love watching you", "me_gayatri1094": "Ur gorgeous! 💞The person saying that is a just a troll thats jealous about ur success! Keep rocking 😊", "learnerdy": "Giiiiirl just blast cypher part 4 and let that sad excuse of a human being rot in their own insecurity. You don't need to listen to hormonal teens with literally no life of their own. WHO SLAYS? YOU SLAY", "rachnaa_21": "You are amazing. You are gorgeous and beautiful. Don't pay attention to that moron. Lots and lots of love to you. ♥️", "surbhi_berry": "U r sweet u r super talented 😘🤗❤️❤️❤️✨keep shinning✨ @supaarwoman", "shraddhaunair1704": "Beautiful😙Talented", "muskannn_agrawal": "Haayy.. Ur not.. Anyone is ugly or fat by heart.. Nd ur not dear💕🤗", "deepti_puthran": "You make me smile and laugh even when i dont want to. And i love you for that. You're so beautiful and inspiring and gosh i admire you so fucking much!! You are so so loved. Please don't let those pathetic trolls get to you. Stay strong, you! Sending you lots of love and strength! 💖🌸", "prakash_priyaaa": "I just saw mallika's story and I am so sorry you have to deal with all this. I just want to say don't ever give a fuck to all these people. They're bored of themselves and need to put down someone. Maybe because they have been fucking fed up of their lives and wants to disturb someone. I just saw your profile and pictures. I used to see you at buzzfeed and boldly and also in aib and son of abish. You're so fucking good❤. You're skin is flawless omg. I can't even❤❤. You've such beautiful hair❤", "pk.tallli": "@supaarwoman If you are ugly, then pigs can fly and I got my Hogwarts letter on my 11th birthday and I am typing this from the Gryffindor common room.", "chahatvats": "You are inspirational! :-*", "sneha.shetty": "😘", "kalihasinsta": "You’re beautiful and amazing! Your videos never fail to make me smile, thank you so much for being you!", "mriduguliani": "You’re an inspiration. You slay 🦄✨", "theylovehrishitha": "U are not ugly of fat u r just Healthy", "nisha.balkrishna": "Don’t hurt us by calling ur self ugly☹️", "paigecpea": "You a stunner and you know it 💜", "mahimavashisht": "You are beautiful.", "malvikaas": "Wth NO YOU'RE A QUEEN K?", "doombeans": "ILYSM (THO U DON'T KNOW ME)", "sunshinefeed_": "DUDE YOU'RE EXTRA EXTRA EXTRA CUTE ♥️ I love you and your make-up is 🔥 I aspire to be like you, you're a fucking inspiration and I idolize you so muchhhh🌼 fuck that hater, he's the REAL loser.", "sleeepy_pandaaa": "You are pretty and witty and don't let anybody else make you believe differently.People are just vicious and cannot handle strong,powerful and successful women.", "moni_ka0124": "You are simply amazing love @supaarwoman", "kotianjoshmita": "Much power to you girl 😘💪", "simrannanda11": "Fuck the haters.Youre beautiful.", "krishna__997": "Fat? Sure. Ugly? NAH. You are strong, beautiful and amazing. It is people like them who equate fat and beauty or thin and beauty and harm soo many people.", "realsidt": "YOURE WHAT THE WORLD NEEDS", "areena_siddiqui": "You. Are. Awesome. ... just wanted to say the most obvious thing. /whispers/ I'm an ARMY too. Hwaiting!", "jasjyotjasjyot": "Wow just saw Mallika’s post about people trolling you. You’re amazing and perfect, nothing changes that! ❤️ a big hug, and lots of power to you! ✨✨✨", "tina_here26": "You are beautiful.. 😇😇😇", "nishka28": "You're an inspiration!!! The way you handle and present yourself is commendable. I love you 💖💖💖", "ananya.rath.mohapatra": "Sorry for repeating the sentences.", "boisterous_oak": "You are awesome 😘😘", "kunnu_sin07": "Hey beautiful 😊 . U are aswm . Nd I love u ❤😘", "nancygoesfancy": "You are cute. You are pretty and you have got he most beautiful lips I have ever seen. And did I mention that you are funny as hell 😊😊😍😍", "jayeetamazumder": "You have no idea how many girls out there want to be you! We love you @supaarwoman ❤️", "sam11712": "@supaarwoman You're pretty, you're confident , you're amazing.. 💗💙", "aru1516": "You SLAY okay? You are beautiful af and an inspiration for most of us. We love you.", "pratik_thalange": "Oh c'mon haters gonna hate man... That's what I've learnt from YOU... U rock.. ur stories make my day...every fukin day I look for ur stories...u are the best..Don't be bothered by any asshole telling you otherwise... I love ya..", "mishthigupta0908": "Learning to be confident like you😇", "vesh00": "Idk who you are talking about because I see beautiful and talented af person who is unapologetic for who she is ❤", "stutikrishnsharma": "Darling,filth lies in the mind of the hater just as beauty lies in the eyes of the beholder!I love you,SkinnyG!!Don’t believe anyone who has the time to spread hate..that’s the best they can do!❤️☀️", "heyprabhu_": "You are an effing goddess!❤", "_rinkalpatelll": "Kind lady❤😍", "junyaali": "I think you're pretty , smart , kind and a beautiful person💕.", "joonshree": "Cutestttttt!!!!!!!😍😍😍😍😍😘😘", "pejtra": "You are a goddess!", "meharbano": "Omg you are not. Youre beautiful.", "kohlakult": "You're too cool for school. Haters gonna hate.", "jatin_suden": "You slay woman", "rahul_v504": "💐💐💐💐💐💐💐", "winniee__sharma": "You slay. Supriya. 😘", "the_hairband_gal": "U have got d ryt swag n bright makeup on your side. Smart-head to toe n dat my gal makes u unique 💗", "tanziear": "You’re beautiful girl. And you have humour. Don’t let unsuccessful losers get to you", "sharmanifowler": "you're gorgeous. It's true. now here's the thing, what do you use on your curl?", "____mahitha____": "Nope. You're damn amazing and bold", "fumblingthoughts": "Love the way you have accepted yourself. You never fail to inspire me ☺️", "generictallguy": "@supaarwoman Saw you perform for the first time at London Taxi the other day. You killed man. PCOD bit was a ekdum killer. Looking forward to more. I'll say Hi next time.", "gosh_nikita": "Effing goddess 💞", "shakkarpaare": "No you're not!!! Why did you even say thay? Why does this post even exist! Demoralising disrespectful idiots don't deserve as much attention!", "mrunalistyles": "NOO YOU ARE A BEAUTIFUL HUMAN.", "nomad_cheeky": "Ms Joshi, you are beautiful and witty.", "wear_urstyle": "People say I am thin 🤭. No one is happy with others . Guess it’s just that, they never see mirror .", "pawridhi": "You are kind and you are beautiful. ❤", "screamingmalice": "You’re so gorgeous!! 💜💜💜😍", "j_a_t_t_a_di_kudi": "❤❤❤ soul shuld b beautiful ❤❤❤", "keshav_9tiyal": "No you're not! You're amazing and beautiful!", "sugandhaa__": "Ukw social media has enabled cowards to disrespect without thinking of the consequence. But when you encounter this, just stand there and think for a second, does this anonymous person who probably hates his/her life COULD AFFECT YOU?? I know we all r humans and everyone breaks but if you ever felt such, don't just sulk into that.. You actually an inspiration.. I cNt explain u in words how positively u have affected me.. And stop reacting to hate, give a chance to ur lovers.. There r plenty of us..!! Much love to u! 😚", "viduraarya": "Love💎", "atavishekhawat": "Keh k leli :')", "ishitahuja30": "You're beautiful.🙄❤️", "manaalpatil": "Celebrate uglihood!!!!!!!! <3", "sukhanwar_s": "Can I just tell you how much respect and love I’ve got for you? You. Supriya Joshi. Are. One of the gods best. Creations. Every time I see you over the web. I feel blessed that I came across you. Words can’t explain the amount of love I’m willing to shower on you. You actually are a goddess. An inspiration. A mentor. And most importantly a great human being. We all love you. But I do the most. I love you. I adore you. I cherish everything about you. We don’t need anyone’s shit. Do we? We gotta hit the gym, read books, listen to BTS, do makeup and slay lives. PS - your lips are juicy af 💋#perv. But no. Seriously. I love you. 💙", "raniofkismatpur": "Shut up!!! Ok, I think I can say that since you are my friend. 😝", "rave_ti_96": "Well... Also you are AMAZING!!! So all of this don't matter!!! 👸", "thecheesecakeproject": "Oh btw, fat is the stuff in our bodies so it’s okay. And ugly, who the fuck is ever going to define ugly? I see your face first thing in the morning on the first story I hit. I have a great start to my day because I see my friend’s face. You do not know how much you mean to me and the worst I’ve got is I may not be able to be one of close friends or gang mates :-(", "kishkish_x": "Nahh you're a SKINNY GODDESS AND FUNNY ✊✊✊✊ DONT LET THEM TELL YOU OTHERWISE", "tenacious.gee": "Skinny goddess I'm loving you all the way from England 💖 ignore all the misogynistic bullshitters who will revert to 'fat and ugly' as an insult to anyone they disagree with. They hate to see women love themselves, and that, you do amazingly ✨", "__moniqua__": "Hey skinny goddess! Let them bitches talk. *Everybody hatin' we just call them fans though*", "sh9re5ya97": "You say that like it's a bad thing", "surajs.theboss": "U Luk like an angel 😍", "sharveri_khapre": "You are amazing and everyone loves you okay???? Fuck them haters", "__ahem__": "you are beautiful and funny and brilliant!!!", "youknowyouarehere": "It is normal.", "ubaidu_15": "I came here after watching the stories on @mostlysane. Supriya.. you are beautiful ❤ don't let anyone define you. And please change the caption, no one in this world is ugly. And about being fat? How does it even matter. Be you, people who truly care, will love you :) more power to you! :)", "sonzkaur": "YOU ARE MY QUEEN THE SKINNYGODDESS I WILL ALWAYS BE A FAN AND LASTLY JIJJI #myworst", "thisistarunzz": "u r beautiful", "miloni2309": "Those who call you ugly , have no idea about what beauty is. So shine on ✨", "shahrukh__zaveri": "Girl you are beautiful and sexy ASF! Others are just jealous Keep doing you and SLAYYYYYYYYYY", "snigdhadhiman": "You are radiant and a skinny goddess 😍", "epiphanyofclutteredphrases": "I love you , admire you , been following you from a long time", "yours_duff": "The people who address you as fat n ugly.. Takes one to know one bruhh", "veeezmay": "You’re an inspiration #SkinnyGoddess... We all #love you no matter what!!!"}