{"raniofkismatpur": "Sweet!!!", "khushi_280": "You make me feel that one day everything's going to be okay and I'll learn to love myself :)", "thecheesecakeproject": "🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗", "rashigagrani": "Such an inspiration🌸 more power to you! ♥️", "do_bong_soon13": "You look adorable! ❤️", "lovecurvyme": "Seeing you smile brings a smile on my face please keep on smiling", "shivani.chatnalli": "Look at that smile 💕", "fashion_bloggs_": "I was in this school family too.. was in Bombay Cambridge Gurukul 😊", "esha_ag": "Omg u look adorable I’m not joking I u r the only one that can be seen in this picture..", "srishtipatch\nVerified": "Verified", "tridipa": "U cutieeeeee", "shraddhaunair1704": "You are cute then and now.", "vasundhara.g": "You’re adorable 🌈", "learnerdy": "WHY DO YOU RESEMBLE PREDEBUT JIN SO MUCH IN THIS PICTURE OHMANHOLYSHIT", "imrozed": "Love you ♥️", "adrianshaji": "You were for vbs?????", "curlsb4swine": "So cute 😍😍😍", "pree_yaan_kaa": "@food.and.frolic is that you?", "lobsanggggg": "너무 귀여워요", "sgracej": "What a beautiful smile! You are sunshine ☀️and you inspire me.", "kalihasinsta": "Omg you’re so adorable! I know how you feel. I wish we could all go back in time and tell our younger selves how amazing we are!", "viren.1996": "You're very inspiring! And you do look like sunshine indeed. Keep shining, Keep inspiring ♥", "shraanch": "OMG BCG! Which branch were you in?", "ispitaborah": "You look adorable! Look at that smile. Heart is melting", "neharamneekkapoor": "❤️", "joyitabasu": "If anyone could personify sunshine it definitely would be you in the picture. 🤗", "hobabiiee": "this is so adorable ❤", "kumarchaitri": "Dsrv malad?", "anro__so": "YOU KNOW WHAT? YOU LOOK SO CUTE IT HURTS ❤️", "sejalchavan_07": "Yess.... Dats so true... We live and we learn...! 🙌🏻💯💯💯💯✨", "sonzkaur": "KYUTE 🙌", "shipragoyal": "This is so cute ♥️♥️♥️", "aranyajohar\nVerified": "Verified", "chickensteamedmomo": "Cuteee❤❤❤❤", "caramelrainboww": "i don't know what but there something about this image which touched me so much. i connect to that feeling of hating yourself anf then one day looking back and just wondering why did you put yourself through all of that. i have been there too. i so deeply feel all that caption. but this is really really good. @supaarwoman you were super cute and so goddamn adorable, if i were in the class with you, we'd be bestfriends i swear. it just makes me really proud and happy to see this post, you are amazing. keep doing what you do. you inspire so many people including me, to just be an unapologetic version themselves, no matter what or where. more and more power to you babe, go girl ❤❤❤❤❤ #skinnygoddess", "ahonakay": "Is that you, @anushkapai ? :)", "lu_lune.art": "😍😍 you are the cutest ❤️", "sharanya_18": "Didn’t know you were from BCG too❤️", "_abira_k": "Bombay Cambridge??", "shrushti_2001": "This is the cutest pic ever!!❤❤"}