{"kimmikickass": "If I have to be weird, I do it confidently. I love my body. Even though I aspire changes, I love where I'm at. Never ashamed of what I am and what I have to offer to the world 🙂 #PoPforluv", "karwadivya": "#PoPforluv", "desi_globetrotter": "I love that I am always under estimated. That motivates me to challenge myself and push the boundary even further. #PoPforluv", "may.dini_10": "I love that I be myself. Whether it be the dressing sense, my taste in music or any other form. I am comfortable in whatever I do and whatever I am. I don't feel the need to jump into the bandwagon to \"fit\" into the criteria. So yes, pretty much it", "kansi0": "I think I love my resilience, no matter what life throws at me, I’m ready. #popforluv", "sneha_udyavar": "I love that im unapologetic abt how I choose to live my life. I'm not sorry abt my choices. If it turns out good, I show off. If not, its a leason learnt. #mylifemychoice #PoPforluv", "fairyygoblin": "I love my nose haha! #PoPforLuv", "shivani_tannu": "I love that I take everything that life throws in my stride. I face most of the shit with a calm mind and immense self love. #popforluv", "pixelspersecond": "@supaarwoman it's quite amazing that just like jekyll and Hyde I too have the power to be my biggest motivator and my own worst enemy. What I love about myself is that life is giving me lemons or coals. I always find a way to fight through and make the best of any situation! Converting the lemons to tasty mojitos or the coals to diamonds or well just a nice warm fire. #PopForluv @monkibusiness_ #MorePowerToWomen", "arreeeya_": "I have had a very shitty week. I had a really bad break up but my ability to love is still not broken. I love the fact that I am strong enough to get over it with a bright smile and ready to make everyone’s day better. #popforluv", "ishaluthra_": "I love the fact about myself that no matter how shitty people treat me, i take a deep breath, count it as a lesson, and simply within 1 hour i start Smiling realising how rude people are and how kind i am. Don't want to become one of those rudes folks. Because there's another good day waiting for me :) #PoPforluv", "anmolxmehta": "I love my eyes and my makeup skills, worked hard to get them! #pOpforlove", "thepreetway": "I love that I rise after every fall.. stronger and wiser. I love that I have the courage to go on when everything seems to be dark. I love that I choose to spread kindness and love. #PoPforluv @supaarwoman @monkibusiness_", "la_chica__loca": "I love the way I love myself for what I am and what I can be! ❤ #popforluv", "littlemisstunnu": "I love how creative I can be in times when I least expect it and that joy supersedes whatever else is going on. Even if it’s short lived. 🌸🌸🌸 #PoPforLuv @supaarwoman @monkibusiness_", "riyarachx": "I love the way I care for people #PoPforLuv", "shivangied": "I love that I don't let anything let me feel less of anyone and love and accept everyone. And if it feels like I didn't, I keep trying and trying until I accept people for who they are and strive to make my peace with things. I love that I'm always seeking harmony with the rest of world, everything living and non-living included! I love that I want to, even if am still only learning to, spread love. ❤️ :') #PoPforLuv Also, thank you for allowing me to notice what I can love about myself. 🙈", "itra_a": "My art and the way i irritate people around me 😂😂 #PoPforLuv", "bani_nature13": "I'm kinda afraid of aging and I know no matter what my age will increase day by day.. and there's changes going to happen..but no matter what.. I love my self everyday more and more. Every moment I tell and cheer myself that no matter how old I am but my experience gonna make me more and more beautiful....", "thepalettesofshikhar": "#popforluv well to be honest, I don't really love anything about me the most, but if I think about it more, I do love certain things about me. I love how I'd do things for people who matter to me and make them feel better and make them smile and try to lessen there pain, give them the shoulder. I've not really done this in person, but I have few internet friends who are really close to me and they matter alot, and I've talked to them on phones, over text, video calls, and even written handwritten letters to them, just to see there Beautiful smile and make them feel better.", "tanya.mathur12": "The thing I love the most about myself is I can immerse myself into multiple worlds without moving an inch through the galaxy of books. I like to visit places through the eyes of others and wish could visit them for real. That keeps me motivated because I know I'll see all of it someday :D #PopforLuv", "kunalskorde": "I like my attitude and nature the most towards everyone i can’t be sad and or I can’t see anyone depressed ..! I cant ill treat anyone for the reason just bcoz they are not behaving well. And i think this is just bcoz of my parents that they have enriched me with there ethics and moral in my life..! So i love my internal soul the most because anytime i try to do something wrong my soul stops me to do so..! I have find a friend within me and i never get bored alone with my company ..! It give me positive, faith and helps me to believe in me ..! @supaarwoman #PoPforluv", "ptnada93": "#PopforLuv I love that I embarrass friends and foes very easily.", "shuchita.anand": "The thing I love about myself is that regardless of how people make me feel about me , i do not let it affect my personal self , sometimes I feel like not caring about certain things would make life easier but these things are never able to take away my positivity towards the world , I do not reciprocate people in a bad way even if they do so , I maintain my own calm and positivity and things tend to allign accordingly , I truly follow the quote \" Don't let the bitterness of the world make you bitter \" and that's what I feel is the best!!!! People will someday or the other learn their mistakes and if they don't its upon me how I want to react or respond or handle it!!!", "rineffable_": "I don’t need any reason to love me, because I know , that deep down I’ll be ‘me’ no matter how much I change in different aspects, and that ‘me’, I’ll always love. #Popforluv", "taarini_j": "Nothing :l #Popforluv", "dhwani.ranpara": "I think I love everything about me, even my flaws and weaknesses! Because if we didn't love ourselves entirely, how would others? Love yourself for however you are, you'll feel so much more happier! #PoPforLuv ❤️", "navdhanothahaha": "Frankly speaking people won't consider this appropriate that I appreciate myself but that doesn't bother me because this is one quality of mine amongst many that I do whatever I consider will be worth taking chance and do everything that even to slightest extent interests me because whenever I look back in future that don't wish to have any kind of regrets I believe that voh zindagi hi kya jise khul ke nahi jiya. #PoPforLuv", "kritika_thesultania": "What I love the most about myself is that I've taken some tough and \"selfish\" - out of the heard - decisions for my life and I take full responsibility of the outcome. I am loving this journey and I know I'll do something good with my life now ❤❤❤ #popforluv", "sharanya_18": "I love how I happily accept myself for the way I am. I stopped caring what other people think and say, and have started loving myself. I love my flaws and I love my strengths. Since I have been through some stuff, I can understand people who face similar problems, so I m pretty good at giving motivational talks, and making them feel better makes me happy. That’s what I love about myself. #PoPForluv", "irrashinal_": "Let's try this kyuki #selflove Something i really really love about myself is that no matter how crap things might get I.just.can't.give. up. I just can't. I have to finish what I started and do it for myself more than to prove myself to others. But I know when to walk away when things get toxic . I love how I talk to my anxiety in third person instead of the other way round and ask it to \"shut your face!\" And intentionally do what my anxiety told me not to out of spite. Wow,reading this makes me proud of myself.bye:) #PoPForluv", "thepeculiarkid": "I love that I'm beautiful in standards that are beyond what society sets and that I have more to offer than my appearance. 🍃 #PoPforluv", "halfbloodrkh": "I believe in myself #PoPforluv", "arshdeep.9": "I get too hurt, too depressed too affected. But I manage to smile through my tears. It took my 3-4 years or more to reach where i am today bt it's all worth it. :) I manage to now use my positive, rational voice to dominate over my negative one and say-\"It will all be fine one day. That day you will be so peaceful and calm.. You will be in control of your emotions.. No one will be allowed by you anymore to influence and affect you. And that beautiful day is worth the pain and suffering in this journey.\" And i visualise myself feeling all those things, feeling my triumph.. And then i pick up myself to move ahead. Ek hi life hai, issi mei sabkuch mehsoos krna hai.. And to feel everything so deeply is a blessing. I no more see my emotional side as my weakness :') I promise to love myself always bcoz I deserve to be loved. I deserve tons of chances to be able to put myself out there without expecting that this world will understand me someday. Maybe someday i won't even care :') #PoPforLuv", "shamvabee.c": "The only thing that I love about myself is, I love animals more than human beings.", "_abira_k": "#PoPforLuv one thing that i love about myself is that i am a female and i am enjoying each and every phase of it....", "geetikathatsall": "#PopforLuv my resilience.", "namastay._.inbed": "@jishnudeepkar", "caffeine__driven": "#PoPforLuv I love my thick eyebrows and eyes", "manazey": "I love my scars. They're what show me and remind me how far I've come in terms of loving myself. They tell me that I've been through much worse and motivate me to go on. I know over the years, my looks will change my likings will change, but my scars are something that will stay with me always and forever, reminding me of who I truly am. #PoPforLuv", "salokneee": "The one thing I love about myself is me :') #PopforLuv", "indhu_mathi11": "#PoPforLuv I love how I get happy and excited over little things and make others happy too. 😆 and physically? I love my teeth! It helps me eat and makes my smile really shiiine! 😁🤣", "mahira_.m": "#popforluv", "deeptirao_": "#PoPforLuv I love the fact that I can make people laugh around me. Just being silly is the best part I guess . I can always make a crappy day a good one by just being silly... simple", "metaphoricalpoop": "I love that I'm strong enough to handle my ups and downs without any help. Being a really emotional person, it takes a lot to keep yourself sane. And through the years, I've mastered in it. #PoPforLuv", "hansikaaa_": "I love that I'm comfortable with who I am. I dance like a monkey and I enjoy that , I don't feel ashamed. I will never. I have started loving my self. My Strengths and my FLAWS , and nobody , NOBODY can take this love away from me. #PoPforLuv", "prabudhhhhh": "me #PoPforLuv", "jannat2412": "The thing I love most about a myself is that I sit back every night to think and anaylse what I did in the day and if I could've done it in a better way. I always try to look for ways to improve myself. I want to constantly grow and evolve. And that's what I lovr about myself #PoPforLuv", "this_is_drishtinegi": "I love about myself that inspite of all the problems and insecurities,i am not backing down and learning to fall in love with myself everyday #PoPforLuv ❤", "geebee_miracles": "#PoPforLuv The thing I love the most about myself is I follow my gut feeling, my inklings or you could say intuitions and everything of that sort after all I am a pisces 😉 *excited AF*", "aphrodite_at_war": "I love myself for being a people's person, who loves to talk to people, even when sometime I forget how I met them. This has given me friends of all ages and from small children in my area to aaji living in my baju Vala building. I love that go out and play with the small girl in my building, skating and Hulla hoop with out giving a mind to what the others think of my actions.🤞 #popforluv", "shivani.chatnalli": "I love how iam NOT A GREAT BEGINNER BUT A GOOD FINISHER...I take longer to learn things than others but I prove to be more skillfull in the end. #popforluv", "foodjunkieguy": "I will keep your secrets; unconditionally.😎 #PoPforLuv", "foodgator": "I love me as who I am as an individual. I accept me as who I am. I love myself @PoPforLuv", "imageofdreams": "I love that i am so much versatile & I thank god for everything @navi_arts @hennabynaviarts Both are diff platforms for my artworks #popforluv", "gaurfarmaiyein": "I love myself for being smart, intelligent and naturally funny. And if people can't see that it doesn't diminish my quality. Love happily @PoPforLuv", "saloni_jain9397": "The way I give no fuck to haters and all the bad things around. Anf most importantly I stand up for myself and always support what is right and never give up on myself #PoPforluv", "alukaparatha": "I like everything about myself, but i think i really like my cheekbones. #popforluv", "nottheonlyapoorva": "The one thing I love about myself is that after trying for years I have finally started accepting myself .. not giving a shit about what other people think and that I should have a weightloss not for being in the correct size .. but for being in healthy state ... It was a difficult journey from giving importance to every other person talking about my body .. to not giving a fuck to anyone other than my mind and heart #PoPforLuv", "u.a.r.k": "My resting bitch face. Which keeps people away. Exactly what I want. #PoPforluv", "awkward.bongflower": "I love myself because I see how far I've come as a person. I love my old self because she fought hard against all those glaring eyes trying to make her conscious about her dark colour. I like the past self because I was able to shun the bullies in my life and make them respect me the way I am. I love my present self because I am still learning and unlearning every day. Regardless of how hard things are I remind myself I have been strong before I can be strong today too. I'll love my future self too because she'll also shine bright like my present and past. :) #PoPforLuv", "dolmarajkhowa": "I love the fact i tend to goof up things, its just makes my life real weird but interesting. I love the way my hair is jhaadu when I comb it and sadhu ki jaatayein when I don't. But I also love the way it becomes take when I m to go out. It's just sooooo unpredictable. Just like me. I love the way my cloths cling to my honey thick thighs making me look 🍑 I love my spirit and determination to overcome my problems and the way I stand up those who are wronged. I love the way I create new and creative abuses on spot when someone is picking on me. I love the way my eyes sparkle when I see food or when it's a gym day off. I love my jingo (Zingo) he's like a ray of happiness in my life. I love the way my voice becomes high pitched when I see a fellow Army. I love the fact that i have literally memorised the title songs of all fav cartoons, shinchan, Phineas and Ferb, Doraemon, chhota bheem, dora the explorer. I am proud of the fact that i didn't give up when life was giving me lemons, karela and kaddu. All three of them at once. #PoPforLuv #Proud ❤️❤️❤️", "mrunalistyles": "#popforluv I will take one step and tumble down 5 steps but that won't stop me from taking that step again. I will try to improve it. I'm fat and I love it. I was born healthy and there was only this one time that I made up my mind on loosing weight. I got successful but I just didn't feel myself back then. Who I'm now is the person I love. I love being fat. I love being confident. I love that I can make someone laugh by my craziness. That's what I love about myself. Being me.", "alina_rachel97": "One thing i love is how i have grown to become more care free than i was in the past. I love that i am less concious about most of the things. Also what i love is how i try to make everyone smile even if i don't know that person. It makes me feel happy from the inside. 😊 #PoPforLuv", "_siimransiingh_": "One thing I love about myself is that I accepted myself the way I am 🌸❤ am short in height XD but I love myself the way I am.... It took sometime to accept the fact that am not like others ( by others I mean tall skinny) but u know what that's what makes me special... That's what makes me different ❤🌸 at this point of life am really happy with my body type... And am in love with myself ❤❤ #PoPforLuv", "areebazameer": "I am self proclaimed glorious mess 😊...i always be myself and let people see the real, imperfect, flawed,quirky,weird, beautiful and magical person that I'm 🖖..and yes I am mine before i am anyone else's 😎 @supaarwoman #PoPforLuv", "manasvineiiiii": "I love myself for being me , for chasing my dreams and for being the person I want to be and not what everyone needs me to be. I also love how I have become the love I never received. I love how I can now actually appreciate myself. And I love how I'm not going to change for anyone. #PoPforLuv", "malikastuff": "The thing I love about myself is that I’ve accepted myself for who I am and I cannot let people question me for what I choose to see in myself! #PopForLuv 🌻🌺", "mehernaz_m": "I have a sense of humor. I know that sounds cliche, but senses of humor are severely lacking in our world, especially self humor, my sister says it's good to make fun of yourself sometimes, it gives you perspective. #PoPforLuv", "saumyax": "The thing I love the most about myself is that I’m kind to a whole new level. I go out of my way and give my everything just to see my loved ones happy, in simple words. #PopforLuv", "samikshx": "I love how unabashedly thick skinned I am😂 #PoPforLuv", "chickensteamedmomo": "The fact that I can easily bind with people is what I love the most. Helping them makes me happier. I also can build in confidence in people which I think I tough. Also sarcasm is a god gift! #PoPforluv", "_samm07_": "What I love about myself is being honest which we don't find nowadays..being honest is the best thing u can ever give to someone..it helps not to hide things..being honest helps to live freely💕💕 #PoPforLuv", "_faeryqueen": "I love that I’m smart, and that it intimidates men. #PoPforluv", "fashion_bloggs_": "What love the most about myself? 1. Eating all the time without the shame of getting more fatter 2. Flaunting my highlighter as if everyday it is the last day of sun rise 3. DGAF about what people think about me 😬. #PopforLuv", "shreya512": "My pink hair!!!!! #PoPforLuv", "_queen_029": "I love most about ma self is that I go as if life takes me through I love to help others n close ones n I hv always known n I follow Dt by giving or doing good to others in return some way o otha I will get it I love being me cz happiness I find in myself being happy .. always nature n pets I adore them cz dey r d ones who bring in d u o urself out in uh #happy_times #smile #loveme #good # blessings", "stay_tuned_with_sami": "I love that I am very honest and I stand for right. I never support injustice towards anyone. I believe in loving people and letting them live the life they want. I am zero percent judgmental and I don't appreciate hate around me. #PoPforlove", "pinkchampagne_mami": "#PoPforLuv What I love the most about myself- How I’ve started to take care of myself both mentally & emotionally after knowing that you are all by yourself in this world race and you don’t have to be dependent on anybody for anything. :)🤟🏽♥️♥️🕺🏽SO LUB YOURSELF ALWAYS💘🔥🔥🙌🏽", "dancing_kitteh_\nVerified": "Verified", "anu_joiedevivre": "#PoPforLuv i love my wacky sense of humor and sarcasm.", "sreshtaa": "#PoPforLuv I love that I'm so full of life and can make people laugh! 😊", "monkibusiness_": "Yay yay yay! ❤️❤️❤️❤️", "_____abhirupa_____": "#popforluv I love the way i pull myslef up again whenever i fall....that i handle anything that comes my way......and never let myself break....even if its very difficult to keep up!", "srishtikareer": "#PoPforLuv I love everything about myself.. not only one or two points but the whole me.. whether it's the pretty me or the artistic me or the ugly me (well I m never ugly tho XD 😎😎) or the irritated me, the loving me, the caring me, the so-full-of-life me, the humorous me, the sarcastic me and many many sides and faces of myself 🤗🦋💞", "aartibastani": "#PoPforluv I love that I have the capability to grow into a better person and love myself for it.💖", "olifarshi": "#PoPforLuv i love that i don't care what others think about me or what their opinions are about me which gives me happy life 🙌😁", "juliaxmone": "I know that I am weird and I like my weirdness!😂 #PoPforLuv", "shravnimirikar": "The fact that in the face of any adversity I have the courage to remind myself that I've been through worse and I can face it all again and all by myself. #PopforLuv"}