{"bex_knives": "I'm fat, but I like cake a lot....and the people who I love, love me back and the cake fears me. 😂", "aadirara": "I love how you use humour to fight stereotypes and hurtful comments. I really respect you for your ability to make socially aware jokes while really touching upon sensitive issues of woman empowerment. But but but YOUR MAKEUP! Too glam to waste on public announcement hehe Please do mini makeup tutorials as they're super realistic since one ends up admiring your makeup while appreciating what you say! 👑", "girlberryman": "@pizzaasaurus_ yaas!", "neharamneekkapoor": "I love you 😘", "ram_rk_01": "They are facts of inhumanity who troll people on basis of physics . @supaarwoman luv u wonder woman❤❤😙", "poojachan89": "I love this", "mun2jain": "@supaarwoman u mentioned that u are fat n not ugly...but how n who defines ugliness", "ketkigada": "Thank you so much @supaarwoman", "themagicaltitli": "❤❤❤❤🌻🌻🌻🌻🌻", "tishmee": "@shreyarathore I want to share this monologue with people", "yuktadutt__": "Ohh my god. This was amazing 🌼 Stay the way you are😍", "__g.a.k_": "❤️❤️", "clickmadness": "Eyebrowssss on fleeeeek 😍", "hodr0static": "Can stop being sooooooo fuckinngggggg gorgeous. 😭😭😭😭😭😭😭😭", "_samikshya_77": "fat you is beautiful, skinnier me is beautiful ...becauuseeeeeee we are amazingly beautiful inside and out.....loads of hugss to you🤗🤗🤗🤗🤗", "littlemizzmuffin": "Love your lipstick ❤️", "rushaliz": "See this is why I love you. You make me feel happy about myself", "maniksodhi": "@supaarwoman this is amazing and you have put it so well!! More power to you. 👏🏻💙", "feathers_in_my_pocket": "@supaarwoman you are beautiful 😇❤️", "shanaya.sharma.581187": "y y y y y didn't i know about you till now... SUPPAAAABBB hai aap🙌", "gettingovershit11": "Love love", "chwai_wu_di": "🔥🔥🔥🔥🔥🔥🔥", "_.vmin._.95": "🙌🙌🙌🙌🙌", "sarang382": "Wow . Sat vachan", "fairyygoblin": "I love you Queen!!!💖", "hqais21": "Woman, I love you. Love the way you are. Thanks for these words.", "chandersanjana": "Slay slay slay 🤩🤩", "pk.tallli": "It's like duniya ke saare gunaah ek taraff and mota hona ek taraff. Wherever you go, whatever you do, there will always be that one dumbfuck dumbass who will comment on your weight. If I am not thin enough, then I can't be good enough. I have been bullied all my life because of my weight (and girls can be bigger bullies than boys #justsaying) so I get you. I totally get you. I wish whatever you said in this video could be my default background audio clip when I interact with someone so that for once people can shut the fuck up!", "xmanishaa": "Bbdoll, you’re PHAT. Pretty hot and tempting 😉", "snarvekarrrrrrrr": "Love you for this😘🌼", "notsejal": "Exactly! Bigger the thighs, nicer the ass 😏😏👏", "kim.k.hicks": "Oh I am sooooo adoring your lips. Stunning!", "dusky.hues": "I am stealing your tag line for next time a concerned, irrelevant person tells me I am fat. Like you rightly pointed out, fat (any kind of body) shaming is the weapon of non creative souls - a complete turnoff, and we should not let it affect us. Love you for saying this because these things have to be voiced to counter the bullshit we hear all the time.", "shotsbyanjor": "Dammm i love you. And this makeup look! ❤️", "_____cheeks": "I am also fat and my father calls me \"BHAINSA\" everytime . I feel bad .", "vijeta_aster": "I love You ❤❤❤", "sujata_borthakur": "This so needs to be told like this- Raw! I am tired of people whose \"undisputed duty\" in the world is to make you realise that you fat?! Am soooo glad you putting it out like this @supaarwoman 😘", "irrashinal_": "LOUDER", "jetaime_ann": "True that sister. Just offended by how casually people use the word FAT for labeling purposes. You sir/ma’am are an ABOMINATION. Maybe we should start using that to label such Aholes...You keep rocking, my desi queen 😘", "jaceymint": "I love you, I love you, I love you!! ❤️", "alexjoseph1409": "I was a really fat once people used to tell me all the time and my friends used to call me \"ae motu\".but after few months of exercising regularly and eating healthy i have lost almost 7 KG,makes me feel good and more confident.if you are fat you need to understand its in your will to get fit,you cannot change your skin colour or body features but everybody can get a fit body which will benefit you in long term.P.S-my friends still calls me motu.", "deepblueruin": "@supaarwoman I wish you were around in my teenage years. Lots of love to you. #fatandokaywithit", "ranatana": "Man your lipstick is so on point @supaarwoman 😍", "simrannanda11": "U GO GURL", "sayalijogi": "Why do you talk so accurate Every time?😭😭❤ love youuuu", "vadapav7": "YOU FUCKING GO GIRLLLLLLLLLLLLLLLL", "mimiification": "Supriya, I adore you.", "rashigagrani": "YOU MAKE MY DAY!! THANK YOUUUUU. I LOVE YOU😭♥️ MORE POWER TO YOU🌻", "unapologetically._.me": "YAAAAASSSSSS!!!! 👐👐👏👏👏🙏🙏🙏 THANK YOU!!!!!", "my_corridor": "Hi, i am a very random person, a lover of comedy... and i found few of your earlier posts very funny and started following you.. but i am starting to get disappointed with your last few posts.. cause they are always around your weight, or about your looks or could be about getting back to the online haters... somewhere i feel you are loosing focus.. i really want you to get back to your initial confident self who didnt seem to care about superficial things in life... and who truly enjoyed being funny and bringing a smile on others faces... maybe you should stop seeking online ratification on your looks... and be the confident person u were few months back... and guess what the less we talk about or pay heed to subjects like “fat”, “ugly”, people around would get the point and clear way to goodness....", "ruchi_saw": "LOUDER FOR THE PEOPLE IN THE BACK 📣📣📣", "boarmelvin": "Halleloo 👏👏👏", "beingnita": "Hahahahaamen", "achint.chhabra": "Thank you so much❤", "nidhi_vijay_sharma": "HAHAHHAHAHHAHA 😂", "gaur_sarthak": "Thank you so much @supaarwoman ily 💙", "talesbytia": "Omg thank you for this video! 💗🌸", "bluemenon": "You're awesome af and PHAT. Haters gonna hate."}