{"that_capricious_laila": "@rytash 🤗🤗🤗 Loads of love to you! I have flabby arms too (Flabby in comparison to my otherwise proportionate body) and this teaches me that acceptance is the key! ❤", "ruchlicious": "Well i have seen teenage slim girls also having stretch marks.. even tho they never gained weight.. i wonder how is tht possible", "sagarrokade399": "#bicepgoals💪", "ar.yyaa": "SOULMATE.", "arshimalek": "very encouraging 😊", "megha_panjabi": "@_bhuvi_bsb @rachnapanikker @seherkayy", "shriya.gupta.10": "My arms are same i swear☹️", "pamrathod": "Love u my darling ❤️you are my beauty queen 😘Mumma’s shining star🤗", "drshuhaira.n.ar": "U are an inspiration to ppl like us who are always body shamed.. And now i got new name for those too.. 'batwings' 😂ppl told me latka hua biceps! 😏", "actormodelparag": "I really like your arms Too much . And arms doesn't matter . that's matter how good you are . really you are cute cordially. ❤", "viveknisha.vk": "Nice arms", "preetyy24": "U r very brave", "sayyed_guddu": "Aur madam hot lag rahi ho", "ridhum_16": "Osmmm", "shalini.kacker": "Have been contemplating to follow this thinking for long ... n yes, hating my flabby arms hv made them worse, whereas stopping to hate my big bums some yrs bk helped in keeping their size in check !! So I guess it works .. but the loving has to come from believing ...", "shagunvee": "Inspiring to say the least. I relate to this on another level. Loving my flabby arms, soft tummy and stretch marks that come along with them is not easy, but baby steps. Will get there, soon🌼", "dhawani": "@vassuuuu when will i feel so positive about myself and my body? I love it how @rytash carries herself ❤️❤️ when will i be able to carry myself like this?", "serengel_promotions": "Hey beautiful💖! You look so lovely😍. We have a surprise for you, please send us a msg on Direct!🎁👈☺️", "potterwhomerswiftie": "Kaafi same emotions hain apne bhi. Thank you for the positivity, sister. Aaj ki zarurat thi 🌼", "rayy_rey": "Damn goals ❤", "kathakali_mandal": "I couldn't instantly relate to this picture and this thought ❤️", "anushree.sawarn": "U go girl!!", "theharshaverma": "You go girl ! We love you 💞", "itbas93": "Gorgeous picture 👍", "zorba2693": "Blissful transformation is beautiful..nobody should hate the place they live in..breathe- grow-be ecstatic", "favorite_quotes_3": "i hate my arms too..i never wear sleeveless", "kumarsunil642": "That's not a problem bebes, still i love you so much", "apex_predator_4": "Tension kayeko leneka madam @rytash jau deya na...kasala body cha tension tumi ghetlo aahe. Khup chhan aahe tumi...majha taraf se ek kiss free tumala. ❤❤❤❤❤❤😘🍔🍔🍔🍔😘🍔😘😘😘😘😘", "ashwini.gcae": "No, you are always great 👌...", "devendra_kanajariya": "Awesome 😍", "_foreverstargazer_": "You the best!❤️", "sumitmathews": "Yeh 5 kilo ka haath 😂😂😂", "sursonipandian": "❤", "yourashish84": "Aap jaisi bhi hai apne aap Mai sarvshresth hai.", "edcjfrancis": "🙏🏽❤️", "allthatisshals": "I love this particular post because we have the exact same type of arms. People always tell me, my wrists are inproportionate to my upper arms😂 but seeing what you wrote and all the love from it, 😍😍😍", "najmulehsan": "Like your confidence and self esteem.", "vivek_gupta999": "200kg beauty 🤣🤣🤣🐶", "yuktie": "This is such a beautiful picture and you are freaking awesome 👌", "mimiification": "My arms have always been two sizes bigger than the rest of me. I'll wear a size 12 and my arms are a size 16. It makes me look bigger than I am and I've always hated them. But yours look great. You look gorgeous. This is why representation fucking matters. I've also recently started wearing whatever the fuck I want when it comes to my arms. Yeah, they're bigger than me. Always will be, no matter what size I am. 🤷", "pritam.sd": "❤️", "shw8ster": "I wish to reach that point some day! 🙂 For now, I'll use the shrug to cover up my insecurities and self-hatred!", "anchal7681": "you are damn inspiring girl!! i love you 🌷", "nityavenugopal": "Omg same!!! Until recently I've been very conscious about my weird arms..but now I consciously make an effort not to give a fuck and wear what I like..life's too short for that ❤ Lots of love for the post!!!", "deependra2312": "Beautiful pic 😍", "jasvinderofficial": "Reducing an inch would mean reducing that much of awesomeness from You. So preserve what you've been blessed with 😊 Keep shining", "ayessamohapatra": "That's a gorgeous click! 😍", "_sheelu15_": "That's why I admire you. Your confidence inspires us. Inspiration lady... 😍", "atrimahima": "I love you yarrrrrr... U r truly a motivation for manyyyyy 😘 stay blessed...", "shubham_singh_2907": "You are best @rytash and many guys loves you really me too really bcz you are natural and really it's true ❤️💕", "darpankanu": "This is really empowering! Thank you", "queenserqet": "Nature is fair . It has given something to all of us - be it “good”or not so “good”... like Many Women with perfect arms would kill to have your hair ! Believe in that we all have less and more beautiful parts in our bodies that are all part of the person that we are and occupy our unique space on this earth 🌏", "kom_soni": "U inspired me and from today itself I've also decided to love my flaby arms as i also have the same flaby arms like u 😉😘 thank u for posting such wonderful post....@rytash love love love u😍❤❤❤", "vishal_dhumal27": "Awesome", "abirabrar16": "♥️", "koli25basu": "I too have the same problem... Since all my life... @rytash", "sayanigupta\nVerified": "Verified", "vishal.jha.5245": "Lovely", "9730hritik": "but you looking grogeous", "mallika_e_nerd": "I love you because this makes me love my broad flabby shoulders. Thanks you. 💕", "dhamdiksha": "Luv u", "sarikagangwal": "This is a lovely photo :)", "smriti06": "You look gorgeous!", "frauleinteenaa": "Self acceptance is the first step towards change....", "surangananama": "Absolutely love love love you for this!", "yamunagunawardana": "❤", "azharshaikh8121": "Osm pic dear", "shubhstannu": "Osm ....🤩...", "dr.devasia": "The Caption 😍😍", "sheikhimaan\nVerified": "Verified", "bunny_banya": "I too hate my flabby arms nd don't feel comfortable in wearing sleeveless!!!!", "muskaanhemrajani": "❤️ @rachiiiita", "_mishti_doi_": "Caption 💓", "parth28s": "Great caption!! We need more people here like you who promote body positivity and love their bodies. Because most people aren’t content with their bodies and that affects them for a long time.", "bluedip": "@bellatrix_stark @miti_desai what I keep telling you’ll about.", "nautankikhush": "LOVE", "ishanananana": "Hey hottie. When do I get to see you?", "singhal_tushar": "Resonates!", "pali.paul": "Beautiful", "talwarisha\nVerified": "Verified", "poo_kamath": "Caption ❤👐", "neetakkin": "Gorgeous! Lovely write up of self love which resonates with everyone no matter what size😍", "the.devang": "Love your attitude girl 🤘 more power to you 👍", "kanika.n04": "This is just wow. @flowerskhushi29 this is apt for you. Just great.", "discoballdancer": "You Goddess you xx love you", "muskaandube": "Beauty ♥♥♥", "sintiaoba": "Girl love your flabs and your rolls. They are part of you. Embrace them", "someshparihar123": "Nice pic", "jasleenriyat": "That Caption 🔥❤️🔥 i love you🤩😘", "k__i__r__t__i__": "U r beautiful and boldest one who always inspires me ! Such a liberating woman !! Accepting u as u r and thn loving it , caring for it is wht living life at its fullest actually means , ppl do showoff hide their fears , hav guilt for their weaknesses bt those who accpt thmselves as they r , only few !👍👍", "soulful_womaniya": "Mine are batwings. They laugh at the gym🙄 @rytash", "preetirajput26892": "Cute... Apne diii itna bda essay likh dia.. Itne dhyn s pdha.... 😍😍😍", "wanderfu11": "Woww", "shumailshah_": "Amazing😍👌", "__harimohan": "@rytash hotieee", "nush_akhtar": "You go girllll !❤ xoxo", "imad.33": "🖤", "arffff_at": "👻💕", "acanksha": "my arms are same...", "cqueen9494": "I love your realness & your honesty & that what makes you great.", "shibanibohra.mua": "@megha_panjabi", "mansiisoni": "You r truly an inspiration♥️♥️♥️lots of love beautiful 😘", "_chikkita": "❤"}