{"onlyubi": "It's not sadness, tufaan aane se pehle ka sanatta hai ye 😎", "udaibhatt": "Thank you for this. I feel better", "artityagi480": "✅", "bhartinderbhagat786": "Natural Beauty I love it😍", "anawalia": "♥️", "thefonnster": "Mood", "koelmagic": "To me this isn't a pointless caption. You have exactly summed up how I feel on some days. Thank you for this. ❤️❤️ Thank you for verbalising what I feel. 🤗", "l67895454": "😍", "r_k382": "Yaar u r plain simple best cute &.... chubby beautiful woman.❤️", "lonedilber": "💝u looking very cute", "swadha_tiwari": "❤️", "notnowvarija": "This is so me", "kazitasfiaa": "@sadmannot", "_melinegrigoryan_": "👏💐🌟❤️", "miss.olentia": "This Reasonates so strongly❤️", "swapnasimplifies": "I love this post, becuz it does talk abt everybody in some or d other way.. Common story! Becuz we all r d same. Humans!! 😂", "dim_pearl.jain.96": "♥️♥️♥️♥️", "zlio_": "😍", "rachna.prasad3": "I am working on this aspect as well,and currently reading The Dark Side of The Light Chasers,by Debbie Ford,which deals with the shadow side of ourselves and how we can overcome our pain. Highly recommend for reading.", "santokh7930": "So Beautiful", "pietrornik": "Das Leben ist nicht immer einfach,aber es ist ein Wunder zu leben 💕", "amritpal_er": "So cute 👌", "petraklein19": "💖💖💖😍🍾💖👍", "everyday_is_a_kirsche": "❤️❤️❤️❤️❤️❤️", "amrita_adnani": "This pressure of being ‘good’ all the time sometimes makes it difficult to keep our head straight. I can totally feel what you are going through cuz I’m struggling with the same. All I have to say is just don’t be so strict and judgmental with yourself. We all are only human, so it’s natural to be angry and resentful sometimes. Good thing is you know such reactions aren’t good and you are willing to work up on yourself. Just don’t lose hope. More power to you and each one of us struggling to be good. 💛", "rahul.thorve": "💕💕🔥🔥", "narendrabhardwaj100": "Looking silver city rytasha mam ❤️❤️❤️❤️😍😍🔥🔥", "vineet86jagranpress": "❤️❤️", "makeupbymrignaina": "Helpless about many things is one root cause of anger. Unfortunately sometimes loved ones become our punching bags. But I feel, that is a part of the deal in relationships. We are to love unconditionally, give unconditionally and if that happens, guess what, we just grew up 😍😍😘😘♥️🙌🙌bless you.", "lakhwinder_bal98": "Innocent face", "ridz5014": "Lots of love coming ure way.... And more power for being you and putting it out there 🌼", "sonia_gola": "💖💖💖", "rachna190": "I feel ya and it’s not pointless.. i can totally relate and somehow it’s comforting to know that as amazing as u are, u too go through such emotions. Life isn’t easy.. it’s not supposed to be but for me, talking to myself works.. no therapy session or psychiatrist or guru could comfort me like I could myself, I jus need to be a 100% real with myself and explore my own self with honesty and then talk to myself like a mother would, with kindness and understanding.. While I talk to myself.. I treat myself like another person, like this person I deeply care about and want to do everything I can to help them up and keep them together. Idk if I made sense to u.. jus something I have always done since I was a kid, while I don’t have life figured out , it helps a huge deal.. much love ❤️", "theultracrack": "Always,Hopeful and giving hope to tired souls alike❤️", "sunshine_shakti": "♥", "mohitofantastico": "You are not alone 🤘🏼", "lowkeyreally": "Thankyou for sharing. We are all in this together 💛", "swethavbs": "Thank you for this your not alone at all", "bhumiups": "Love you sweetheart.. your not alone.. it's a constant battle that we all fight each day...", "ann_behera": "It feels like I am speaking to me!!! I am the same, I keep struggling to identify myself and I keep justifying my actions and it is soo tiring.. I want to get out of my head!!! Ughhh", "upprthaware": "❤️❤️❤️", "_undisputed_boyka_": "Your simplicity at its best🔥❤️ i live you ...you know what i love you .... You're my stranger soul mate 😋😉😛", "aikara_abhi": "Well said, more power to you 🌸", "archana.madhwani": "I am freaked about the fact that there's someone out there who feels exactly, EXACTLY the way I feel. There's someone who knows how this feels! Dammit can't wrap my mind around this. I can relate with literally every single word and emotion you expressed here. The only difference I don't go to therapy because that's a different kinda courage and I still haven't gathered it 🙁 but if this makes you feel any better, you are not alone. And with personal experience, it does get better along the way, even if it's just a lil better 🤗🤗", "s_soh_l": "sanskari😘😘", "raaziaansari5354": "Thaaankuuu for sharing ♥ you are not alone 😔", "rounakagarwal": "Couldn’t have put it any better! ❤️", "sakshi_sarcasm_shukla": "@rytash love you for being this real and vulnerable!❤❤❤bigggggg jhappi❤😘", "ritikakoul_": "💛", "sharleendevjani": "This resonates very strongly with me, you’re not alone :)", "ibeingshabbir": "Super star", "charulakshmi": "@soumyarajendran @pratheeksha_unni ❤️", "woodstock_witch": "To acknowledge flaws is the first step. 💟", "vidhikodia": "❤️ More power to you ❤️", "adv.shashank_khole": "Looking Awesome👌👌👌", "insight_poetry": "♡", "imjyotika": "Literally @rytash .... I can totally relate with you .....just loved what you wrote....we all are in the pursuit of happiness...", "_rezairani": "Mazaa aagaya mere dost, humne ghalat ghode pe paise nahin lagaye", "ragunandanmanhas": "Beauty word are formed only for you mam 💝", "kamboj_akshay": "Simplicity at its best 😍😍", "vinod1.singh": "Why so sad budds", "amuu_13": "I too feel the same🙌", "anaghamani11": "Fighting!✊❤️♥️", "deepak_dgp": "Simply and amazing", "sanyogita305": "❤️❤️", "royal.m.sharma.9": "That innocent face gonna throb my 💜❤ heart", "vidhi_shah94": "❤️", "akshita_sharma._": "We struggle to reach one extreme but reality perhaps lies in between. Or is it just an excuse for not reaching at a particular point? Excuse me for such nonsense.. Just wanted to tell, I could relate this so much! And you look beautiful❤❤", "ash.ki.asha": "Just said what I was trying to understand ❤️", "deependra2312": "😮❤🙌🏾", "shobhitgarg94": "Simplicity is always the best thing...Yu really looks amazing👌❤️", "ruzainimazani": "Thank you for articulating it so well. I've been feeling the same lately and can't seem to put it down in words. Thank you for not making me feel alone xoxo😘😘😘", "supriyavyavahare": "❤❤", "love.nouk": "❤🙋🏻‍♀️", "vishal.jha.5245": "Lovely", "_neha.jain_": "Hope is all that there is for ever to hold on to. ❤️", "crap.bag__": "❤️❤️❤️", "sintiaoba": "Advert/ poster titled \"Emotions\"😘", "tanuja__chandra": "Take care, sending warm and good vibes", "vidz_ach": "This gives me strength 💕", "udasaditi08": "I feel you @rytash it's the same everywhere 💜💜 love and hugs coming your way ❤️❤️❤️", "arunash09": "U r looking good", "nakuulmehta\nVerified": "Verified", "aditiii__eliteworld": "Everyone struggles with their own good and bad points u r amazing .. i can see how well u adore urself though self love is much better but we guyz love u even more support u i never saw a girl more confident than u inspire us u r amazing...😊😊", "unno_singh": "Don't force yourself to be positive and right abt things every single sec. Life is meant to be live in all it's shades. Let things come in their natural ways and deal with them like your soul wants to, don't surround it with tags of positivity.", "__preksha.jain__": "❤️", "mussarat_m": "I can relate to this 😒", "kavitapant26": "🖤", "yogabydiksha": "My gorgeous girl 💜", "richa.kashyap_": "Thank you for sharing this . ❤️❤️", "neenza3": "💖", "arrahman944": "Veri biutifull", "illisiveisis": "❤️❤️", "i_am_adv_pankaj_sharma": "Looking very Sweet", "sha__lini_": "More power to you @rytash for writing what's deep down your soul disturbing & disrupting you. ❤️❤️❤️", "am_shibu": "💥🌸", "shihabkssha": "Love you like a sis", "ahtlolevad": "All of this. Exactly how I'm feeling the last few days. That's it, I need to let go of the idea that I'm a \"good\" person all day everyday. No one really is. You are not alone and neither am I. Thank you for putting words to something I was trying to understand going on within me.", "_hiddenartist": "I don't know why I feel this is every one I know . Thankyou for letting us know we are not in this alone.❤️", "gauri_mehra": "Oh mam 😥😥😥😥😥wonderfully expressed 💞💞💞💞💞💞I feel the same tooo sad and tired but hopeful with a ?", "arshi3262": "Needed to read this today! @rytash you the best", "preet_patel_1107": "@rytash 😍😘🔥🙈❣️❣️", "creativekunaal": "But you are looking too Cute .... 😊", "fofa_n_96": "Wonderful", "idrshabnam": "Picture says it all", "aaa.sa.tha": "🙌❤️👌", "aarjvijain": "Just one sentence- All if this doesn't make you a monster, it makes you a 'human'💔✨", "mayank.singh08": "Yo... We got you Ryts ❤️", "gohneam": "😍😍😍😍", "afrryt6": "وعععععع مكروها😣🤢🤢", "edcjfrancis": "Let me know if you want to meet and talk about this. And what I did when I was here in my own therapy journey. Speaking out however is amazing for those who are suffering in silence. 🙏🏽", "igr_mos": "I see my reflection 😊", "cherilynwoo": "❤️Love you Long time", "vidhaee": "This is so adorable, you are a very strong woman inside out. Love you ❤", "harshviro": "Beautiful 💜", "sarikagangwal": "Baby face 😘", "kavitarajwade": "❤️❤️❤️", "man_one_05": "❤️", "anushka_m87": "Sending many hugs your way, you talented, beautiful girl! ♥️", "classic96fortuner": "@rytash rightly said mam"}