{"destiny123__._": "Yk I'm just 17, and I think I have met the lady that can change the mindset and mentality of this generation already. Thanks for being an inspiration, and a supporter always. Always in love with you, and the way you think. Love you babe. And congratulations on your book, will be waiting for it❤️", "megha_agrawal34": "🔥🔥", "shreya.tewari____": "❤️", "nandu.halvai": "Haa maa aaj firse naam badal kr bohot bada paragraph chep diya hai.", "utharanjali": "sending all sorts of warm hugs and love ur way 💞💞💞💞", "amrutha.murugesan": "YASSS🔥", "pathak.adyaaa": "I have to a lot to say, not sure you’d read but here I go. I remember coming home after college, I was then, a first semester novice to many many things in life. I’d put on MTV to listen to some music, and then stumbled up on GOT, Isha was the first character I saw and it instantly became the most relatable one. I was Isha in ways, and wanted to be rave hehe. At a time when people still pretended that oh watching hindi shows is lame, I always felt that no matter what the language as long as the content is a 100, the show is worth the watch. GOT taught me things I needed at that time, it wasn’t such a good time personally. Cut to a while later, I started using Instagram, I looked for you here and when I saw redheadwayfarer, I was like oh that’s not her. But then this account of yours had me the minute I saw the content you were putting out. So bold, fearless. Slowly you grew, on me and on the writer in me too. I have not only been inspired as a fellow woman but also as a person who has abundant love for writing. You’re an inspiration. On so many grounds. So fearless! My take away from you, will always be fearlessness. It’s a quality you hand craft with love, in every post of yours. I said above I was Isha in ways, but now I’m redheadwayfarer in soul. @salonichopraofficial thank you. 💓This is my real name, but it needs modification, to make sure my mom who has bred me, is honoured.❤️", "dilipkatkar007": "Hotiiee😍🔥💥", "moonmishra2709": "I don’t know why @salonichopraofficial but i have the ik jindadi meri sau khwahishan song running through my head reading your post. What you write about makes so much sense it feels its me.. what’s been misunderstood about the new age woman for so long.. even by women who should have looked out for her. All the best, looking forward to the book!", "_bong118": "❤️❤️❤️❤️❤️", "riptighosal": "❤️YESS❤️🤗", "dr.maddy_08": "I have a male friend, who is a feminist and my comerade😛, who introduced me to \"redheadwayfarer\", i started following you, reading your every damn post.", "bhartibhatt_": "I've known you since \"girls on top\" , first as Isha, then as Saloni then as the \"redheadwayfarer\".. And you have been one of the biggestt inspiration of my life. Back then , none of my friends really knew anything about you. But today, when i see, so many friends of mine, following you, liking your posts, even sharing your posts, it makes me soo happy.. You have changed my perceptions in a lot of things. I see things with a different perspective. And i love you for that. I understand this change Ma'am ~ you changing your name to SaloniChopra . ♥️♥️♥️♥️ But you'll always remain my \"redheadwayfarer\" ❤️💕 Thankh you so much for everything. For your videos on YouTube. For your words of wisdom. For your feminism and teaching what it actually is..", "anupamarya03": "U luk so gorgeous 💕💐", "ovary_actedqueen": "Check out my story for amazing content😍🔥❤️", "mickeylovss": "Beautiful", "rehankapoor9856": "Beautiful🌸🌸", "lovelustdevil": "Kissed by fire", "harikishan481": "So sweet", "udaykiran_nerella": "😘", "khushi_._sahoo": "I miss GOT . Please bring the show atleast for now.", "gochi_boi": "Propaganda machine aagai bhyi", "digitalthikana": "❤️❤️❤️", "sannechino": "Beautiful!", "sonalv3": "YESS!", "prajakta_majli": "I LOVE YOU and I have so much admiration for you and for the things you do 🥺you inspire so many of us who struggle to love ourselves. Thank you!!", "nishitha.queeny": "Yaaaassss❤❤❤❤❤", "profane_benny": "You're such a narcissist 😂", "caldeh": "🙌💙", "thatquirkychanel": "Thankyou for existing Inspiration ♥️🌹", "siddharth221080": "😘", "blurred.ramblings": "Proud of you and so glad that you have evolved into the best version of yourself. You go girl. Keep inspiring young girls and keep doing you. ❤️ Always gonna be the fan of that #readheadwayfarer saloni and always gonna be the fan of #salonichopraofficial. ❤️❤️❤️❤️", "navneet_tango": "Although U missed ,katrina kaif sister...😁😁😁", "wanderbirdnavya": "Yee great✌", "73moons": "YESSSSSSSSSSS!!!!!!!!", "cheshta.menaria": "💜💜💜", "rolybiswas94": "I love u either ways😘", "vanzztriv_": "Dear Saloni, Its you who should be thanked. You make girls, women, ladies like me, like us strong. You tell us how our opinions are not solitary. And that we have each other's back that make us grow constantly, which i believe, is the most wonderful thing about this century's women. The sisterhood. You made us (atleast me) understand the new arenas of freedom and feminism in so many expansive ways. Your posts continuously remind us that a voice matters. Whether feeble or low-pitched or confident, our voices always matter. Thank you for keeping the enthusiasm in us to keep rebelling high, Saloni. I adore you so much. Power to you. 💜", "itsmedipali_": "Hey saloni i love you ... ❤i wanted too hug you .. I have no words but one think Thank u so much❤ ..", "_pallabi_saikia_": "You are writing ur book?😍 Cant wait to read it then @salonichopraofficial . And listen you are the strongest being i know❤️", "shabanaa2000": "❤️❤️", "vanae.mars": "Noo please, that name suits you 😭", "sachinmathane7": "Looking so cute n nice", "gauri_lp": "On your last post I think I mentioned how I was sad that your @ was no longer redheadwayfarer. But reading this has made me so happy for you. Saloni or redheadwayfarer, whatever your identity, only love and gratitude to you and you always inspire me. <3", "ankitjain0306": "Nice to see u back with ur name", "rakshahaha_": "Isha❤️😭", "aishwarya_ogrey": "Always your army! @salonichopraofficial ❤️ I love you.", "navin.shankla": "Cute", "paushalli": "Pretty lady ❣️❣️, such an inspiration. 🔥", "neeti_drishya": "YESSSS!❤️", "vishalrathore13": "I like your hair colour 🥰", "qa_bira": "Its ua time!!zindagi bula rahi hai !!jeele my frn !!!a big yess !!m nt a feminist bt up m a son and a brother in one shelter", "aviratsundra": "I remember those redhead photos haha @salonichopraofficial", "koulakhil": "👌👌👌👌👌❤️", "ligna_leo": "💞", "iix_alina_ixix": "Yessss", "iamajjju": "Your looks so amazing like ur thoughts ... I like ur mentality stats u are amazing", "staywild.moonchild.19": "I changed my username last year because it represented me for what I am. A wild Moonchild 🌙 more power to you ♥️", "rahul_pratap_singh": "My favourite❤️", "misty_mind1": "❤️❤️❤️❤️ you are love ! Inspiration", "iampushpneetkaur": "This is THE BEST post that I’ve come across! Amazing! Welcome to instagram #SaloniChopra but will never forget #Redheadwayfarer ♥️", "chubby.cheeeeks": "❤️❤️❤️", "vitruvian_monk": "Yess 😃", "the.reviewpost": "❤️", "shaikh_tanzi": "❤️❤️u go gal", "amreensubi": "Lots of love❤️❤️❤️", "sumayyah_nisa": "You are absolute love @salonichopraofficial ❤️❤️❤️", "aaashayyyyyy": "I LOVE YOU! ❤️❤️❤️", "shekhar7610": "Liked what u wrote in this post...n I must say these set of pics are one of your best pics ....loved them🙌", "delicocktailhouse": "Much Power to you! 🙌🏻🙏🏻", "hakuna_matata115": "@salonichopraofficial Hi, I would really like to appreciate you for this one thing \"confidence\" trust me the way you have always believed in your own self and your thoughts and how you process without giving other people shit is what I love the most about you. The one's who are close to you and know you will always believe in you and stay by your side , is something I believe and your better half your best friend Rahul has always been your family too and we your choosen family as well. It's dam difficult to let go those hate comments I'm sure there might be days where you might have felt like shouting at top of your voice and say alot but the way you have evolved everything is superb!! Just be the same and go achieve everything in that bikni we are with you. More power to you. Long way to go and yes be it red hair or short hair or be bald ( I have also believed in this ..that when a woman chop her hair she becomes more strong and she is more powerful, she would only chop them when she feels like) I hope you will always inspire us like this and just be the same❣️😘 lots of love hugs kisses not just to you but to Rahul too..he is dayum adorable and cute keep smiling guys keep loving😇world needs kindness and you two have that😇😊hope to see you in person someday 😉", "itsfallenangel3": "Yess!!! just be you❤️❤️", "heebijeebe": "Fuckkkk yes", "bluefficient": "You're one of the best accounts i've seen, your thoughts are so similar to mine and i feel like there's someone who thinks about those little things happening. I just wanted to tell you that you are my inspiration.💛", "aashti_abbasi": "An extremely emotional post. I've been following you since Girls on Top. Your words inspire many of us. Please keep writing and keep inspiring. All the very best for your book💕", "rohan__saikia": "If they ever make an indian version of black widow, you should be casted.", "the_flying_pushpa": "bhai beyhaad khoobsurat 💝😍", "shreya_1627": "You have always inspired me for feeling comfortable in my own body, your cute love story with @rahulb90 depicts how strongly and passionately lovers love each other no matter the situations. Please keep on doing what you are doing because millions of girls are looking forward to you just like me. Love love ❤️❤️", "anit.lamba": "Wow!! Great :^)what a name..so pretty girl with the nice name...Saloni 😘", "aastha_chaudhary": "You go girl!!!!!!! ❤ More power to you, always!! ❤🔥", "sweetsanayaaa": "Love d way u r 💛💛", "srvjn": "Just don't stop writing..❣️ #Bewdi Kuch Bhi Likhti Hai", "rupak_3_": "You’ve lost weight! Beautiful pictures🌸 @salonichopraofficial", "noorsahni786": "Ho yes", "notorious_neil_46": "🔥👌", "jovial_jhanvi": "I love who you are.You are a strong and a beautiful woman and I am really really inspired by you. Your posts always gives an inspiration to all the women out there in the world to be yourself and love yourself💙💙", "anwesha1312": "You are the reason I stood up every time I fell...Saloni..you have no idea how much and how many lives you have inspired..the only thing I want to say is continue being you..every single day..even if your being you is different everyday..based on your experiences..You taught that vulnerability is not weakness..loads of love..", "bubbles.1112": "❤️", "npranali512": "Isha❤️❤️❤️❤️", "callravi": "Yesssssssss 💕", "amii_jais": "You are so brave❤️Keep Shining 😊Love you ❤️", "chesta_mehta": "We need more fierce women like you who could raise voice for women rather than criticising , who could dream and have visions of changing the perspectives of this man ruled society, who could dare to stand strong enough to fight societal stigmas. Sending all my love and positivity. Keep inspiring us and giving us strength to fight the odds☺️♥", "stutygupta": "So much love to you! You give us strength❤️❤️", "heenaparsramani": "When will the next season of mtv of will come it was the best show ❤❤", "soumen_saggi": "But you are beautiful😍", "saahibaan": "Sarah Jessica parker... Carrie", "ray_barshana5678": "I have been following u since then and I have always been love with your personality and you,keep growing..keep glowing.❤️", "su.chi__": "I've never met anyone so vocal and bold about one's own thoughts and opinions. You inspire us not just to seek equality but also to be loud, proud, strong and what not! Thank you for being what you are.💕", "hiren_quarantinedays": "Absolutely I think Your Personality make You One of a Kind.... May be You Call Yourself by Any Name be it RedHead WayFarer Or Saloni, Just Don’t Lose That Instinct which Defines You... Lived Your ReIntroduction...... ❤️❤️❤️👸", "wewake257": "Redhead was awesome username @salonichopraofficial", "fouzia.effat": "Yesssssssss 💪🏻 as a woman and human I’ve been always proud of you 👍 ♥️", "cataleya_boudh": "Yessss.. and I'll miss your old handle name. It was my favorite and on the top of my search list it'd be hard of me to think again that you've changed it; for good anyways ❤️", "koualwaysflying_": "More power to you girl", "miracle_maitri": "Ah! I appricipate you for being Yourself and Always spreading Word 🌺 Sending You love❤️", "naushinmuntaha": "Been following you since my first day on Instagram. Love you !", "mysteriane7866": "I have been introduced to you when I first saw Girls on top and trust me you became the women who changed my thought about my own self.And it turned me into a new human being .@salonichopraofficial It's sad now because whenever I wanted to see you I search for the same redhead wayfarer girl but it feels more good that I will search for Saloni Chopra now 🤗♥️🌟", "peehu_sahay": "I have been an your admirer since your girls on top days... Its one of my favorite shows, Infact watching it again right now. Your words are strong just like you. I'll be waiting for your book. Keep going girl! Its a \"wattle\" out there. ❤️", "ashish__9": "Wow", "_rhythm_batra_": "I didn't want people to follow me being a pretty face. I wanted to make a difference in people's lives.... I feel these lines. I relate to it with the kind of same emotion❤️🔥", "charmingly10": "Saloni, redheadedwayfarer no matter what name you choose you will always be the woman who inspires makes us raise our voice shows us we are worth it and makes mistakes all by simply being u. We love you for you and thanks to you we have learnt to love like this . A warm welcome and a hearty journey ahead with many more twist turns and write-ups ahe", "cutequenz": "We love you❤️", "_.m.i.n.a.l_": "😍😍😍❤️", "ayushi.gupta00": "Omg you! I love you ❤️ you are my inspiration. When I saw you've changed your username I knew you would tell all of us the reason you did this and here it is! #redheadwayfarer is not just a part of you, it is a part of everyone of us! This post made me so emotional I don't know what to say. I wish you all the happiness and love❤️ you are my superwoman❤️", "the_reveuse": "I'll miss readheadwayfarer finding a way in my feed, cause your posts always bring something good in me. But happy for you to be you finally. Maybe one day I'll do the same. 🌻", "iamyasyn": "🔥", "nivedita_mani_": "Such a beautiful gem you are I love the way you put up your words it really gives courage to all the girls out there who just can't come out the way they want to so thank you so much and you are beautiful 💞", "globetrot.girl": "You're the loveliest woman who gives me inspiration to accommodate myself in this world full of hatred and belittling each other..u inspire me to accept me and lift myself up...and let me go...thanks a lot love. ❤️", "megha.joshi.543": "You are motivation for all of those who want to voice their opinion and dont have that courage to.. You give all of us that courage to stand up for ourselves.. Whats say @darkisbeautiphool ?? We all love you alot @salonichopraofficial And will always do.. Keep spreading love 💙", "faizan_khan_cool_boy": "🔥🔥🔥", "settle_subtle7": "You are much more than a pretty face. Your posts have often made me question myself. Helped me learn a lot & grow. A heartfelt thanks ❤", "harry9396": "🔥🔥🔥🔥👌👌👌 u r fabulous girl", "psyche_wolf": "What's in a name? That which we call a rose/ By any other name would smell as sweet. 🤭💗💋", "bhupinderkaur": "And we love u darling u r best. God bless u 👌👌👌👌👌👌", "deepikabelwal": "I still wait for the next season on MTV Girls on Top.. !! @salonichopraofficial @barkhasingh0308 @elenasparrow", "cranky_cake": "@salonichopraofficial I was little surprised to see your name transformed from redheadWayfarer to this. It took little time to get accustomed with it but trust me everytime I see your picture and your captions, in no time I can guess who it is. You're wonderful with this or that❤️🌼 but you will forever remain my redheadWayfarer because this name and the lady itself has inspired me to become a better human each day. I love you!", "_.fiftyshades07._": "♥️", "filmyladkii": "😍👌", "medha_onegirlonejourney": "Full kapde 💖😂", "accidentally_here": "You'll always be you and no one can represent oneself better than that! ❤️", "varnika2212": "I love you tons❤️", "a_bookish_wanderer": "Many things are coming into my mind but I don't have words to write, hence yessssss girl ❤", "boss__betty__blogger": "https://www.youtube.com/channel/UCycS5x8L3Dq8bX8VApd3tyA", "amrita_singh1104": "YESSS 🔥❤️", "pavemented\nVerified": "Verified", "moumita_pakira": "Red riding hood😍", "saxena.anushree": "👑👑👑", "mahima_agarwal19": "❤️❤️❤️", "riteshdassingh": "To me you are a woman who can hold up. 💝", "azmim_azad_afri": "Take love❤️❤️and grow girl🔥🔥u always rock🔥😘😘", "sharu.ramesh": "It's been 5 years already that I started following you 😱. I clicked with you the moment I saw on girls on top and following you on IG was one of the best things I have ever done. So glad and honoured to be with you throughout your journey. Thank you making me understand what a woman is capable of. Your words have always been alot to me more than you think. Thank you and I love you ❤️😘", "poonamwaghmare021": "YESSSSSSS❤️👸", "rahul.brar": "You look better no", "ishikagxx": "Eyes ❤️🔥", "gurdeep_singh_wazir": "Energy!", "shrimali903": "👏👏👏👏❤️❤️❤️❤️🔥", "___pretty__me___": "YESSSSSSS A BIG YESSSSSSSSS like other girls I also started following you after girls on top but I never knew this side of you \"BOLD FEARLESS SALONI\" and now I follow each word you say feel what you feel all I can say is I FOLLOW YOU SALONI AND I LOOK UP TO YOU🙌 I just wish I get to meet you someday also your bikini travelling thing is my goal 😂❤🔥", "wordsnapsandcheese": "I read your first post about birds flying to nearly 5 years ago and one I clearly remember I'm Shiva. I loved that version of you, maybe that was one I could relate to more that's why!", "shirazzz_": "i love u @salonichopraofficial always🔥❤ you have given me a lot u don’t know me but that’s how we inspire each other right keep going lady much love -17 years old girl", "seafarer._": "I love YOU. So Hi Saloni!", "_soul.seeker": "I'm so happy to tell you that your account was suggested to me by my male friend. He just told look at her captions. She is so good. You are powerful. You are blessed with power of words and wisdom", "kdas8": "Simply Love ur being! ❤️ Admire all thatbu are😘", "yadavdheeraj556": "Your beauty always intact mam😍", "rubanmedlan": "Miss that name💖", "anusmit12": "Tell me one thing how does ur red color last for long I mean I did it once n it ran away in a month....is there sth specific u do", "mee.heer_": "YESSSSSSSSSSSS BABEEEEEEE❤️🌈", "thrishswish": "I LOVE YOU SALONI YOU INSPIRE ME EVERYDAY", "hikabieber": "You know why I like you is I see a prat of me in you and you make me feel soooo good. Your writings, thoughts, posts just blows my mind♥️ . I love you ma'am.", "__._selenophile_": "This is ❤️🔥👌❤️❤️❤️", "stylesavitri": "Such a charming lady you are♥️", "nitin.rao.91": "😍😍😍", "vrinda___aggarwal": "yeaahh i watched your first show and liked it so much even miss that show .❤️😘😘❤️@salonichopraofficial", "version_of_dove": "Truely Yyyyyyyeeeeeeeeessssssss @salonichopraofficial", "aakritichdry": "Really waiting for your book to publish asap and yes you inspire all us young girls everyday 💓💕💕❤️", "aakansha_singh85": "This is beautiful ❤️", "hydropanic.90s": "🔥🔥🔥🔥🔥🔥🔥🔥💯💯💯💯💯💯💯💯💯💯💯💯🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥💯💯💯💯💯💯💯🔥🔥🔥🔥🔥🔥", "paapkojalakerakhkardunga": "♥♥♥", "abhimanyu_159": "Redheadwayfarer is the perfect name madam 🙏🏻", "preetbalofficial\nVerified": "Verified", "sincerelyshrabani": "YESSSS✨ you're a beautiful woman.", "bluestocking_soul": "You are beautiful as a person🙌", "tara_nilanjana": "This couldn't be more you ❤️❤️❤️❤️", "parveenpanchal11": "Role model for every girl.", "harsharaisinghaney": "From the day i started following you, you’ve given the positive energy. I’ve seen different phases of you, like many others have, and it still feels you never changed. You are that Saloni Chopra i started following after watching girls on top, still the same red head girl i fell in awe with. You make me, and many like me i guess, learn more and grow with each passing day. Can’t wait to read more from you and get inspired. Thank you, for being you. ♥️", "antique_girl_anji": "Finally i got to know ur name 😍 u r fantastic 😘 I'm in luv with u since i saw u in girls on top n searched n got ur id redheadwayfarer 😍 I've become so happy ur words touched me in deep..... God bless u abundantly 💞", "nivedita.jha1024": "More power to you I love you so much ❤️❤️❤️keep motivating us 😘😘", "basundharasinha_official": "I miss isha😭", "ashwanianthropologist": "Way to go @salonichopraofficial mam. Hats off to every efforts of yours and the fight you put in for yourself and your fellow women. Being a man, even I got to learn a lot from you, and how a man can be better and respect a woman's consent, personal space and keeping the presence of mind to see whether I'm going the wrong way or not. Thank you for everything. ❤️🔥", "syedashafquatwasti": "YESSSSSSSSS 😍😍😍❤️❤️❤️❤️😘😘😘😘 @salonichopraofficial", "that.flamingo.isnt.pink": "💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕", "r.i.t.i.k.a.goel": "Love you!!", "theduskyvibe": "#yassssqueen ✨", "chethana_sisodia": "YES! FUCKING YES! YOU GO GIRL @salonichopraofficial 😍", "iterative_infinity": "Yesss", "banarasi_food_blogger_": "I will still search you as #redheadwayfarer❤", "iamsirdanish": "Sara ali khan jaisi lgri ho 😍", "ahmedsauga": "Well, nice to meet you 😍😎", "saleekhasainudeen": "YESSS ❤ @salonichopraofficial", "fatima_rizviii": "Loads of love @salonichopraofficial ❤️❤️", "linishapaul": "YESSSSSSS!!!! ❤️❤️❤️", "rammy_kaur25": "❤️❤️❤️", "novelapatrao": "Yesssss! ❤️", "the_beautifulpurpose_2212": "How much do I adore your thoughts n you!!❤️❤️ Stay blessed girl..😍", "swapnila27": "Noooo, connected with redheadwayfarer....don't be everyone .", "aes.aes.ael": "Yes. You go girl ❤️", "priyankaa.sh": "Yes, yes, yes❤ welcoming the new you with open arms.", "a.t.hira": "Love the person you have become over the year. ❤️", "sudeshnaah": "When I saw you changed your userid,it kind of threw me off a little. But this post of yours is exactly what I thought too. Being the redhead and growing was a chapter. Now a new chapter begins with \"saloni chopra\". Hi @salonichopraofficial very pleased to meet you!☺", "the_empowered_minds": "Hey, one question. Why not equality over feminism?", "aiyana_amaris_": "💜💜💜💜", "__loubloom__": "Best caption!! YESSSS ❤ @salonichopraofficial", "the_alpha.female": "Yesssssss!❤️❤️", "__vmoonchild__": "YASSSSSSSSSSSSSSSSSSSSSSE💜💜😭😭", "anamta_k01": "Yess ❤️❤️❤️", "nikitakaushik22": "@salonichopraofficial YES! You have always been so empowering, so inspiring ❤️. Eagerly waiting for your book! ❤️Much love❤️.", "i_m_amirhussain": "Waao new changes😍😍", "raj_pandey89": "👍", "_abhilashagupta": "😍❤️❤️❤️", "the_mi_girl": "Prettiest", "wakemeupwhenpandemicends": "You go girl! 😍💙 💙 And well, we're all glad of the women we are becoming 🌸 I'm gladder I get to share this journey w you! Yuhuuuuu 😘", "sim.ran15": "Huehueeee YESSS❤️❤️", "_harshal211": "And when you finish writing that book, let the author name read as \"your name + (redheadwayfarer)\" because that's how we've been knowing you, looking up to you. Lots of love ❤️ @salonichopraofficial", "sharnazsalina_07": "Yeeeeesssssssssssssss ❤️ isha jai singh, @salonichopraofficial Or #redheadwayfarer ... You're totally loved in all frame🙌", "rusty61989": "Redhead ... i remember ❤️", "bhami_dee96": "❤️❤️ I love your plethora of ideas and how you continue to inspire despite adversities", "fitterniti": "Hi. Nice to finally meet you. 🤗 For a second I thought I followed the wrong account 🤣", "kshanal": "YESSS💕💞😭🌸", "__sudeshnadey__": "YESSSSS !!! 🖤", "puja_roy02": "You keep inspiring us in a lot Way. And the best thing, I can find every single girl who's Willing to fly, smile and become stronger through your words. You are truly the best kinda mess that any girl will ever dare to become :) more power to you! More power to all girls in the world! And cheers to the day to day efforts that you take to bring changes in others life!! One more thing, I love you ❤❤❤", "rana.elena": "YESSS🙌❤️", "jayycaurr": "You are my strength dear", "devayanigiri7": "YESSSSS❤️", "mostlychaotic": "YESSSSSSSSSSSSSSSS🌸", "anjali_b19": "❤️❤️", "ar.jun742": "I will make sure that your nose is pierced and wear nose stud 👃", "navya.sangal": "YESSSSS!❤️", "akshaya.khushi": "Yesss! 😍", "mayeda.chikan": "YESSSSSSSSSSSSSSSSSSSSS💕💕💕💕💕", "sunshine_345_": "Beautifully unique 💙", "shreyasi.s": "I don’t know if you’d read this but I’ll still write it to convey to you how much you’ve contributed in improving my confidence. Much love and support!", "shalinixde": "Your army", "ritusinghh23": "YESS ♥️", "_.shrestha": "You are so amazing 😍 your post, ur writing , ur thoughts everything is so inspiring......💕 You're such an inspiration to me, i love you nd your thoughts a lot mam, hopefully one day I can be someone like u, who inspire others to bring atleast a little change in people's way of thinking......by being myself😊", "itx_jiimmy": "💕💕💕", "abhijeet_mahat0": "No ! Di we accept you as you are ❤️ ... I'm so delighted to see #redheadwayfarer and your red hair 😍 .... I was waiting for this from so long ... Red hair aap pe bohot suit krta hai like it's your trademark or attached to your personality #lotsoflove😘❤️❤️ #keepsmiling😊💕💜 #keepinspiringus😍💖 @salonichopraofficial", "_.akhil.07_": "Best pic❤️😘", "aiishwaryaya_": "I'm gonna missyouu as #redheadwayfarer 😭😭😭", "sitharamv": "The readhead made who made me thinking in a different-good way @salonichopraofficial All love ❤️", "amitkumarshukla80": "❤️❤️❤️😘😘🔥🔥🔥", "anushka_joshi24": "You are the best", "khapra_sweta": "Yesssss!", "shubhomoyguha": "🔥🔥🔥🔥❤❤❤❤"}