{"simrranjeetsingh": "As I said earlier you are mostly in foreign countries so how would you know what is happening in our country... so you discussing about nation matters is not correct....Isne edit Kiya hai apna post achi baat hai galti sudhari hai... Incomplete knowledge is dangerous and discussion about it by the same person is utter nonsense... This decision was long due... And measures taken were real good to prevent any civil problem and harm... Everything now will get better in terms of economical , education and other aspects for Kashmiris.....", "hk.freedom": "@kritika.tayal_ see her caption", "vaishhh.__": "@redheadwayfarer I guess you're not even Indian. Man I feel soo it was a wish of millions of people in India. That BJP fulfill but Congress did not. BJP legalized women entering temple during periods. Same sex marriages ban tribal talaaq chandrayaan and what not. Why would we will give them Kashmir it's a integral part of India. We didn't snatch anything it was ours only. It's like I'll say you give me head and keep your body parts with you it's a situation with Kashmir for Indians. And this has to go Nehru ji made such a pathetic rules. And please do check . And you're a Feminist and put nothing against Islam they have such a horrifying rituals for women. Triple talaq did you talk lol no. It's all our opposition parties tweets because its loss for them nothing else.", "ghaznisaab": "These flaunting pseudo feminists and pseudo liberals know not a shit about politics and history of India but will come ranting against any right decisions because their friends and fools are protesting against that. You guys are no better than showing off your bodies and taking fake pride in that. Scrapping the article was the right decision.. go get some real knowledge first.", "awasthiaman1112": "don't comment on topics where u don't have any knowledge. bcz of people like u porkistani get leverage.", "areebatirmizi": "Lmao, I didn’t know India is full of hatred for EVERYBODY. Peace out kids!", "nrw.olly": "wish you good luck 😅", "ritikatripathee": "You are illogical stupid , brainless breed @redheadwayfarer .. we happily accept and support #article370 ❤️", "_sunil.shah": "Acha hua 1947 mein Twitter Instagram nai tha. Some people would have opposed the idea of freedom from Britishers also.", "_ohbrowngirl_": "💜💜💜💜💜💜💜💜💜💜💜", "sugandh2200": "Hi Saloni a series of heartbreaking events took place. On August 4, 11.15 pm the ministers such as Omar Abdullah, mehbooba Mufti were put under House Arrest. On Aug 2, the pilgrims and tourists were asked to leave. July 31 onwards more than 38,000 CRPF officials have been deployed in Kashmir. The Parliament Session finishes in 2 days hence Amit Shah introduced a bill to scrap Article 370 without circulating the legislation to fellow Rajya Sabha Parliamentarians. He started his speech by requesting Venkaiah Naidu- the Chairman of Rajya Sabha to allow this act as per Section 63 of Parliament Proceedings", "sidscott.101": "Save india from all these western Mindel set and jihadi people .", "priyasharma0110": "@redheadwayfarer Let me call out your hypocrisy, what does that instagram profile pic of yours symbolize showing a doll with mouth taped? You are essentially giving a symbolic message to your fellow pseudo liberals about how there voices are being crushed. And this is purely in context of the events pertaining to Kashmir in India. You think you are very smart and witty but in reality you are not. You posted the Kashmir story on your profile essentially acting dumb and novice that you couldn’t get real news about Kashmir while traveling in Europe, however when your fellow feminist also parted ways with your opinion you changed from your long caption to a smaller and different caption. You also posted stories comparing actions of the Indian government with nazism and praising Pakistani pm’s tweet. Is all this your idea of feminism and liberalism? On one side you make statements that you are not qualified to deal with issues of a rural woman in your interview and hence you are not fighting for those issues. However somehow you are qualified on the Kashmir issue, nazism and indian politics but you want to fight on that in a subtle manner so that your instagram shop doesn’t close. Last but not the least, having a profile pic of a doll with mouth taped has no meaning when you on your channel block dissenting voices. You blocked multiple people not because they were abusing, or writing nonsense coz you highlight those people in your stories, but you blocked people who didn’t agree with your viewpoint, were exposing your hypocrisy via debate and respectful manner. All i can say is “Practice what you preach”. Don’t act as if you are virgin Mary and walking down a holy grail when you yourself crush voices on your channel and then act this cool feminist icon. You are simply running an instagram channel to make money for yourself in the name of feminism. Request you not hijack the feminism agenda for your gain because this world will be a better place if women get equal rights in the true sense not what you are preaching.", "rana_khalidiqbal": "Kashmir Bane ga Pakistan", "anupurbahhahah._": "I have been loving your posts but lately I have realised that saloni ...dear you don't wear what you wear at Barcelona or Australia....then why do you still targetting the same thing... for making a change you have to do share talk and wear the same thing you wear at Barcelona or Australia at India ✌️", "rs24783": "What if this bill gets successful in making lives beautiful of the intended recipients?", "debayandd": "Aap apna kaam kijiye ismain jyada dhyan na de", "karamjit6720": "Nice", "anyasinghfanclub": "Chal hatt!", "_riyayay_": "Black day for humanity 🏴", "sam_ftw._": "Kashmir hamara he 😊", "iamaditya05": "When u don't have knowledge about something better not to speak and you are just attention seeker", "aditiarya18": "Ok you might be right with other things but this is something which should have happened years ago , if 340 & 35A would have been removed earlier ,today’s kasmir would be completely different. Because hatred was brewing among kashmiris as they didn’t consider themselves part of India but now legally & officially J&K is eternal part of India .jai hind", "meghraj_shastri_122": "[[[[[[[[[[[[[[[[[[🌹माँ भद्रकाली ज्योतिष केंद्र🌹] +91-8054417981)( बंगाली शक्तियो के माहिर){astro meghraj shastri}get immediately solution for your all problems} astro meghraj shastri ji (a to z ) problem specialist. 24 hours available result 101% guaranteed. ((#Love_Guru)) स्पेस्लिस्ट- लव मैरिज ,वशीकरण, सौतन दुस्मन छुटकारा ,पति पत्नी अनबन गृहक्लेश ,कर्जा मुक्ति ,निःसंतान, whatsapp+91-8054417981 1. Love problem solution 2. Love marriage specialist 3. Settle in foreign 4. Ex lover problem solution 5. Desired love 6. Husband wife disputes 7. Childless problem solution 8. Divorce solution 9. Business related problem 10. One side love solution 11. Extra marrital affair solution. 12.vashikaran specialist Contact & whatsaap no. +91-8054417981", "7prateek_rajput": "It's blind selectivism madam @redheadwayfarer...obviously we do condemn hate and rape threats,and they are no solutions.But your words and stands influence a whole lot of people,and here you are provoking and aggressing the hatred and illogically criticising this political reform.And if you literally wanna understand deeply that how badly it affects Kashmir, then go to this link please-https://m.facebook.com/story.php?story_fbid=1744949445811564&id=1699348573704985", "chopraji87": "Jab kuch logo ko bina Baat comment karne ki aadat ho to aisa hota hai bol bi rahi jitnaa internet se pata chala are jaahil jab tujhe pata nai to comment hi kyu kar rahi hai. Bus photo upload kar.", "tanishaghosh95": "Kashmir was given 10 percent of the budget for 1 percent of the population. By now, it should have been a flourishing state. But, why isn't it? Why the rich are becoming richer and are able to send their children to study abroad while the poor are taught to become stone pelters. This article needed to be revoked. Now, see it this way. Kashmir had only a special \"Constitution\" for them. Now, since they are an integral part of India, the people of Kashmir can enjoy all the rights like right to education, right to expression. It is something to be celebrated about.", "umairr.kh": "War will only bring dead bodies", "raghurajkunwar": "@redheadwayfarer well said ....", "maa31784yahoocom": "On the same page.", "sheradomusic": "💕", "rushis_ahir": "for speaking about or standing for girls is oky... but think twice about u speak....after u saying its right to give opinion...but stupid women ... hundred of people facing problems over there... don't you speak single word against committee...or government....u moroon ... don't even know how india dealing with terrorism ....Nd after showing this comment u post on story this how u protect indiaaa.... but if u have too much sympathy.... then go live with Kashmiri", "gagsydeshpande": "Stay safe babe. Sending you a lot of love and positivity ❤️❤️", "aish_2526": "💓", "viditijain": "P. S. It's not vulnerable it's revolution...", "harjit_singh1994": "Beautiful babies", "neverknow803": "I mean, I never thought you were so dumb! What military men face there every day is not an easy task like yours to write big paragraphs sitting in a AC room, travelling all around the world. People like you talking about justice, peace and shit. You care nothing about what people have undergone there. I'm not saying I know what has happened there but don't even try to act like you do. Just stfu", "pranjalkhandelwall": "No! All those who were staying safe would now be forced to come out of their hides. Action against terrorist would be taken with immediate effect", "__m_k_d_": "God. I m really sorry you had to edit the caption, I understand it was a doubt and not a view, that you were simply trying to put forward a thought on how the \"Kashmiris\" must be feeling, and what \"can\" be the alternative motive behind it. I just mean to say I get it, stay strong and keep sharing your views, because some people do care.", "bing_sparks": "The reality of it all, even though I haven’t seen it myself is killing me. I can’t feel less hopeless and terrified. Kashmiris are in danger", "parmararunish02": "Everybody is writing a whole paragraph on this. Why? Let's see how things roll out. Let's hope the people living there are safe and things can go back normal without bloodshed and dirty politics. They deserve a normal life with aspirations, expectations, happiness, struggle(good one). So every chill out!", "samsmythe0010": "That girl's eyes are absolutely drop-dead gorgeous 💞", "kanungoamit": "Finally something good has been done..the whole India is celebrating but maybe u won't be able to see it...do u have any clue on article 35A or 370 or just putting post for nothing...Pls mentioned your reason for why it should not have been scrapped ??", "aasthao_o": "You should have had at least gathered complete information on such sensitive matter,you are a social influencer don't take it so lightly.", "divya64r": "@redheadwayfarer Whats ur point on Article 370 was against womens, dalits nd tribals rights? And what development had kashmir saw all these years with the help of this?", "omkathait": "This for for few tym, to prevent frm spreading rumors dear, pls consult n understand frm knowledgeable person", "nobodyyyyy1233214": "And also I see people having no knowledge about 35A and article 370(having no knowledge on how much kashmir has suffered due these)Commenting and tweeting “We stand by kashmir,we have to save kashmir and this decision pf abolishing these 2 articles is very wrong etc etc” From whom do we need to save kashmir? From its own leaders,who have exploited their rights,who have influenced the people of kashmir to fight amongst themselves just for their own benefits,The leaders who have supported terrorism and destruction in kashmir for absolutely nothing..! From whom we have to save kashmir? From its own people, Who throw stones at the Indian Army when they are fighting from terrorists..!Yes,thats kashmir! People here themselves support terrorists..! That’s kashmir..! And now when these articles are abolished, We will face a new kashmir, A kashmir on its journey to PEACE...! A kashmir free of corrupt leaders..!", "mr.jakke_911": "To save Article 370 our mother's and sister's have become widow and we can't lost many more lives it's better to scrapped article 370 at once .Master's won't become master anymore and slaves will become their own master and now the tribals and minorities will enjoy equal rights and opportunity.", "richa_pandey18": "It will be an irresponsible step to post opinions or comment about sensitive political situation without fact check and proper understanding of the issue/intent.", "shuvv_ghosh": "Wow.. now you looks like a true form of devil.. #shame", "mayur.j_95": "It's a precautionary measure for now because if someone opposes this n tries to start riots then it will be a problem. So cutting access to internet n communication is but a temporary measure. Also riots n killing can be started by opposition parties. Even I m saddened by the news of military rule over Kashmir but it's not permanent and will only be there till things settle down.", "shreyshenvekar": "💜", "rrhythmupadhyaya": "Grow up you bullshit woman. You need some brains .", "hitesh.koli.374": "And she is back with another stupid post just to get some attention and her followers are now gonna fill the comment section with the things like awww u inspire me, every girl should be like you, u are amazing", "shubham26_11": "It's sad to see people like you post all this without having any clear knowledge about the issue ...", "foundationfeet_": "I think it's an excellent decision.. Pakistan has always been trying to make Jammu and Kashmir a bilateral issue, which is eventually stopped by scraping out article 370 and also it's for the betterment of resident of J&K", "eternalache": "There are more than 10 states in india which enjoying special status in some form or the othet", "beingmanasi": "@redheadwayfarer ....some temporary losses for greater good!!! That is all the purpose that is being served for disconnecting Kashmiris with the world, so the political party leaders don't have the access to call for riots and plans to spread violence. Right actions at right time serves a greater purpose than right action at wrong times. So nothing is happening to safety of Kashmiris but their safety just got ensured calling them, in and wholly as Indians. Sadly your facts aren't right. Sometimes I feel, you know things just that you want to create a stir or unrest by your post, not all revolutions forge progress and you suit this example. This isn't hatred just a frank opinion on this specific post that reflects your understanding on world politics and history. Or are you propagating #CONGRESS?????????", "pankaj.thakur.nlu": "So mam , am from a law background doing honour from NLU . From our perspective the move of our government for curfew is correct so as to no riot take place and this curfew is subject to many thing . In fact whole move was so taken that there remains peace in the valley from taking some politicians in house arrest so that they cannot influence the society e.g is from the time when President rule was imposed there took no stone pelting incident and no aggression against armed force this moves were always political. And family can still contact there family by contacting the armed force or say official in case they need any help . There are many other thing relating to the same but due this msg is public am restricting the topic to this point only . Have a wonderful evening mam .", "prathamsatalkar": "You have perfectly summed my sentiment. Yes it was high time government reviewed article 370 but definitely not this way. Also by declaring the region as union territory government very conveniently shut down all voices in the state. Have we ever wondered why the local people did not want to be part of India or Pakistan? 25+ years presence of armed forces will take a toll any human being. It all started with NRC in Assam and now removal of art 370 in J and K. These are not very good signs for democracy", "izaidabbas": "During independence every state people were given right to either be a part of pakistan or india..It depends upon either it was muslim majority or hindu majority but in kashmir, the majority were muslim with hindu mahraja who signed to be alleged with india without majority consent...furthermore, the clash happened and treaty was signed to have a refrendum to let people decide by whom they want to be part of...till this day, there is no refrendum and the riots keeps going...The kashmiris had suffered a lot and this primary dispute should be resolved by voting otherwise the region can't prosper...research with unbiased motives and you will know the bitter truth...", "punisher_cristiano": "I think people need to buy M .LAXMIKANT❤️ .. historical day ❤️", "umangdwivedi": "In 1947 pak sent kabbalis to annex Kashmir. Raja Hari Singh to protect Kashmir signed instrument of accession with the then PM Mr Nehru. Kashmir became a part of India legally. Had the referendum happened back then, then natives would have voted to stay with India. However, mercenaries/terrorists/ separatists kept infiltering throughout. The slaughter of Kashmiri pandits and rapes happened. They were shooed away from their own land in the 1990s. Pak wants referendum now when the demography has completely changed due to infiltration.. no one questions the slaughter of Hindu minorities there. Certain things are needed to curb volatility... this is not dictatorship... sometimes iron hand is needed..", "filhaal_aam_aadmi": "@redheadwayfarer Well, I would thank you for the post u made n u shud too thank urself because if u read comments on ur post u may find the answer u r looking for.💪", "jayaajayjunior": "💜", "chahatbadlani": "@samcwazy comments padh.", "garganand": "Madem half intelligence is more dangerous.....", "kunal97__": "It's no use getting triggered over her people. She is a social media \"influencer\". She HAS to have an opinion on everything whether she has knowledge about it or not. She'll fade out of relevance if she doesn't post about the ongoing trends. Posting her opinion about almost everything under the clouds is her JOB. Get used to it. Unfollow her if her opinions trigger you. But you won't because she posts half naked pictures of herself once in a while too right? How many followers would she have if she didn't? Now you're conflicted whether to unfollow her or not. Hah. Gotcha.", "buddhablessdisbeat": "Now we all get to know what a motherfucking dickhead pseudo-ass-feminist @redheadwayfarer is...gtf outta here we don't need you", "ak56rifle": "What do u know about Kashmir and 370. From the last 20 years Kashmiri people are throwing stones on army officials and if army officials react ,they loose their jobs where were u then. Where were u when kashmir people throwed every Kashmiri pandit out of the valley in 1989 and killed their children's and their raped their wives. Where were u when people disrespected indian flags and hoisted ISIS flags and Pakistani flags. Where were u when Gilani provoked every kashmiri to do riot though gilani's own children are studying at abroad. Where were u when mehbooba mufti said release terrorist yasin malik though he kidnapped Rubia mufti sister of mehbooba mufti , and for the release of rubia mufti indian govt. Was forced by kashmiri people to release 3 top terrorists including one terrorist who recently planned pulwama attack. One of the kashmiri people only did pulwama attack and 370 has been applied for last 65 years what development have kashmiri people seen . Most of the youth is indulging in terrorism. Where were u when they used to disrespect amatnath pilgrims and use to attack on them . And govt. Has shut down internet and calls temporarily because they dont want any violence in the state, if they open the internet now people will start protesting and army will have no choice but to kill them,that's what u want a mass slaughtering of people . And if govt. Wanted to kill or torture kashmiri youth they would have done it in the last 5 years. Till now army has never killed or tortured any civilians in the valley. So, if u dont know anything about kashmir, 370 and the situation there, u should just shut up and do u r own thing that is hoisting fake feminism flag. If u ever tried to condem govt. Action and army's action we will take ur feminism flag and stick it up ur ass. And what were u saying Pakistan will do this and that. Who the fuck is Pakistan to speak in our countries matter. U r a filthy bitch u just wants attention. What will u say when terrorist will fuck ur mother and sister, it's ok it happens. Where were u when pulwama attack happened, u never wrote about army persons. When valley people eat beef knowing beef is banned in j&k. FUCK YOU.", "drnoreenqazi": "Its a complete black out. There is no connectivity back home. Feeling “homeless”", "hoping_dream": "Right now, no Kashmiri can comment on this because this democratic India has snapped their internet and mobile services. And for the people of India, Kashmir has always been about the land and not the people. I see so much of communal hatred in the comments. Kashmiris did not ask the locals and the yatris to leave, the Indian government did. The same way it did today creating panic and fear. Before anybody questions me regarding my identity. I m a Kashmiri muslim, have stayed all of my life in Kashmir, have witnessed everything and I know further bloodshed is gonna follow. Not a single soul is empathetic for the people, they just want to buy the fuckin land.", "seervipuja": "No its not that we taking back what is ours ....we are giving the people of jammu n kashmir the rights they deserve to enjoy and happiness that they are a part of India", "kksharma1903": "People living in kashmir doesn't have a problem. Why do you? Sometimes, to do good, there have some bad consequences in the beginning, but a better future. You said \"from this day forward so many lives will be lost\", this didn't happen before? It is definitely getting better. Sometimes it's better to leave some topics rather saying anything when there's a lot of people getting influenced these dayd", "sheissupernovaa_": "You should trust RSTV and newspaper THE HINDU. they present unbiased ideas", "markfernandes4u": "You need to read first and then post . I'm from army fraternity . First only mobile data . Secondly phone calls are not . Thirds it's for a short duration of announcement to avoid unnecessary panic and other evils related to security Fourthly taking back what's us and giving them more access to development and growth opportunity through their own legislature. So please don't post with incomplete info though you may be doing it in good faith. I beg , don't create a disaster scenario .", "cerraroopali": "I have friends in Kashmir and yes, it is true.", "stalker_here__": "See people like you are called influencer, no one other than you would know impact of such post going in wrong direct. Know the power of words and your position on Instagram rn.", "well__friedonions": "U should go and fuck off instead of faking off..... First go and live in Kashmir and then write a thesis about that. Better?", "phat_pouter": "Thank you @redheadwayfarer for talking about this. I have been waiting all day for someone sensible to shed some light on what the reality is. Everyone has been so busy celebrating. It's so easy to sit in different parts of the country and applaud the government without even considering what the people in Kashmir will be going through. I have lived there when I was a child. I have so many people close to me who still live there and are struggling and it hurts to see their situation.", "the_rajnish": "Do.you even know about article 370 and 35A . Do you even know how difficult it makes to implement policies of the centre in kashmir . First go and read and gain knowledge and then write long paragraphs !", "manvichaudhary02": "By cutting internet brain washing can be stopped which can be intiated by hurriyat.. U r nice person doing good work.. But don't just put anything that u r not fully aware of.", "charmingchashmish_": "Hey @redheadwayfarer I am also worried about the consequences of this decision just like you I also worried about the lifes that are at risk right now and that includes each one us but then I realized that since the past few years India has been fighting for jammu and Kashmir but why? We have been loosing so many lives who are there fighting. We have been fighting not only to take back what's ours but also because if they get Kashmir they could probably do a lot more damage than we can imagine. This is a risky step and I hope that the gov is prepared for its consequences but this was important to make the lives we have lost worth it and we still continue to loose everyday at the J and K border", "jyotinisha": "https://www.epw.in/journal/2015/16/commentary/article-370-constitution.html", "khushi2805": "@redheadwayfarer You shouldn’t be writing anything without proper knowledge, I think this is the basic requisite everyone should follow, be it a feminist or not. Talking about rights taken away from Kashmiris without any knowledge of it’s history and inception is utter nonsense. Get some knowledge first, understand the situation and then comment about it. You’re not helping the country by writing something abt the most sensible topic irresponsibly. Always remember, Little knowledge is a dangerous thing”.", "malvika1107": "Till today, you sounded very intelligent!", "akansha.tewari": "You have no idea what is 370..one nation one rule.", "story_teller_bong": "Please don't rush to post something, about which you know nothing.", "_deepshikha_vishwakarma": "That was done for the sole reason of protection of all the citizens in Kashmir , while they declare yo eradicate the special status now... whatever wrong has been conducting in Kashmir since a long time will come to an end eventually now the Union Government will make sure that the development of citizens in Kashmir is taken proper care of . Whoever is your source of information is misguifing you about things", "call_me_vicckyy": "Invasion ? Cutting access to things? Over taking rights ? Are they putting the people of J&k in jail ? Really curious to know what made u feel and think like that. Damage was done in the past and now the corrective action to repair the damage done. BTW I'm from Jammu and Kashmir.", "osman_mian": "Mam have you a pet? How you deal with it...but the kashmeries r human being with the right of fridom and living😢", "sikarkochhoro": "Please refrain from writing bullshit and have a bad influence (unknowingly maybe) on people. You see, the internet and calling services have been taken off temporarily just to avoid the confusing circumstances which you're trying to create on such a sensitive issue. Instead of just coming out of your good night's sleep and posting scratch, at least read about the issue. Thousands of people follow you and your posts, so please for the sake of these innocent kids' futures, think twice before you post.................A sincere request from everyone trying to control this situation since you were not even born.", "chrungooshiva": "@redheadwayfarer This time your post felt one sided. It's quite likely to learn half truth with the kind of tweets and posts available right now on the current situation.", "kanav_sj": "Why do u have to poke your nose in everything everytime when clearly u don't have enough knowledge abt the subject & what's happening...what they just did should have happened years ago and I am saying this cause I am from Jammu and I know vry well how the situation is out there...so plz STFU u so called social influencer & don't influence people by making such statements like OMG they r taking aways their rights.. Matlab kuch bhi.", "mahir_parekh": "How is it an invasion to rights for the people when actually they are being brought on an equal level to that of the rest of the coutry.", "rahulraiu": "You are some time behave like an ass hole don't poke in to the matter which is not understand by little brain", "_the_nebula_": "This whole long ass paragraph just shows how ignorant you are . just read what both article meant , read some history, see what the special treatment actually meant, learn some more polity get a grip of reality and then post. By posting something like this you are simply spreading misinformation!", "sarah.alaqband": "It's wonderful how the comments on this post are completely in favour of the government because the only ones who could contradict DO NOT HAVE ACCESS TO INTERNET OR PHONE SERVICES! Irony!", "rewabhardwaj92": "The ban on Internet and phone call is temporary to avoid any king of nuisance from happening. It is for the very much safety of the innocents living there. Please don't be judgemental on basis of one section of the 3 territories over there. It has been a long time, jammu, kashmir and leh-ladakh are 3 different regions differing on cultural, geography, langauage and what not. Same kind of rules applying to the other 2 territories C9z of one was always criticised from the residents of other 2 region. I cannot yet say if it is a welcoming move, but all we can hope for is something is being done. And to bring change some tough decisions are always taken. The leaders that speaking against the bans are the ones who had power to transform the situation but they failed everytime. All we can do for now is wait and watch and stop being so negative.", "journo_vinaypande": "With all respect, I would love to have a good constructive debate with you on this. All that you've written is a story that's concocted by the people who never want peace in the valley. And Its sad to see you falling into the trap laid by these people. @redheadwayfarer", "be_selfish_raghav": "Kashmiri are our peoples and kashmir is part of India it is big step towards development of whole J&K", "rateekam": "Plz harr topic pe Badi Bua ban naa bandh kare, jyada likhna aur accha likhne me bahut antar hota hai, Sensitive time hai yeh toh bakwaas nahi kare, aapko aisa likhne se UN peace ambassador nahi banayega", "lucifar___9": "https://youtu.be/Ck2Q8dSsZAw", "sweet_bizz": "It is a good thing, as now everyone can buy land, create job opportunities so people will have more source of income rather than indulging in brainwashers terrorism acts. Root of everything is their low income.. They lure them to indulge to terrorism for money.", "nish_tha": "👏", "oyeshivam": "😍😍❤️", "rukminirbc": "It is really shameful that to get few likes you post on something which you know nothing about without caring about the consequences of ur ignorance.", "ashijakhmola": "तानाशाही नहीं है !! हाँ मगर कुछ पाने के लिए कुछ खोना होता है ।। 🇮🇳 कश्मीर भारत का है और कश्मीर के लोग भी भारत के उनके साथ कुछ ग़लत भी होगा !! कुछ वक़्त बाद आप अपना Msg पढ़ना एक बार !! Love 💕 peace ✌🏻", "minischievous": "NDTV is the only news channel, I trust, which make sense to me.", "iammehreeensheikh": "😰😰😰", "sandeep_modugu": "The consequences will be made terrible by dark forces for few years but I hope we will see what we dreamt of a peaceful Kashmir; I don't see it as curbing the rights, it's giving them more rights as an Indian Kashmir; wait for the time to open it's true effects 😄; It will be a long and dreadful night for them. I pray and stay with kashmir", "balram_sharma__": "Aapko india me hone wali har ek baat se problem h... I don't want ur review at all now", "im_maverick.31": "This is so logicles to cut down the internet and call connections yesterday night . I mean what is the use of this ? From past three four days the news regarding this issue was already disseminated by all the media . So what does the govt wants to show by doing this . Moreover most of people across the country don't even know whole thing going in Kashmir but they are celebrating this decision . Do thy have any idea how it feels not be heard , how it feels to lose family members without any reason? No they don't know because except J&K no other state face any curfew this much frequently , no other state face such disturbance in studies. Talking about the govt . Even if I am not a kashmiri but if i protest for right against govt of any govt official then i will be suppressed . They will try every possible try to choke down my voice for justice. So without knowing their situation , stop celebrating for nothing .", "vinayakpandya2906": "Don’t be an innocent mother fucker who don’t know much and writes long ass paragraph,,, why do you give so much importance to Imran Khan ,, who is that dumb ass to comment anything on our home’s decision,,, and let me tell you lady that the running rules weren’t working for dis many years,so no development and hence you can post some pics of poor Kashmiris and may gain sympathy everywhere,,, life’s is not only about feminism, topics of nipples ,,, go and read something relevant to our country,, current affairs and den open your mouth! Dumb ass", "amaldude93": "Well if you don't know what's d actual matter and what is actually going on in Kashmir then put your nose away from this serious issue I know we have got right to express it doesn't mean that we can talk about all those issues which we don't even know 1 % about....first try to do more homework about an issue and then come and write your review...this is proud moment for our nation an we all love and support this decision.", "jeetpatil_13": "arrre yrr puri zindagi ke liye bandh nahi kiya hai thode time ke liye hi he @redheadwayfarer", "justorder24x7": "❤😭", "supertramp_132": "I sincerely respect you. But you are going wrong here. It is very important at critical times to stop words getting out. Do you remember how media was shut when there was a terrorist attack in Mumbai? Social media has grown strong.. but it also is an easy platform to spread rumours and make chaos. That is the only reason for this. Because as everyone knows, how critical this issue is. And over the decision, it is not you and me who should speak but only the residents for whom it is taken. Because we don't know what lives they live and how good or bad they are. It is not okay to judge merely on the passages written by others. I believe if I want to make a statement over any thing..i should know what it is like..", "rukmanitripathi": "Pleas read more about 370 and kashmir conflict . Pakistan has vested interest that why they fuel terrorism there . Main source of water supply belongs to kashmir region . It's sad that being an indian on such a historic day . You have posted such ignorant message . People are happy because they know how 370 was being misused to misguide kashmiri youth and disturb peace of India.", "bakulwarikoo": "I’ve been following you for a while now, but what you’ve posted today.. I don’t agree with it. I belong to a Kashmiri pandit family who came from Srinagar to Delhi following the circumstances prevailing in Srinagar. And we are very happy about the fact that 370 has been scrapped.. j&k is part of India.. our motherland.. it will take time to get things on track and normal routine but one day it will.. we should support the government When they are doing something right.. pls read about the history first and then post such things. You’re an influencer and people look up to you.. so pls be more responsible.", "_s_a_m_e_s_h_": "Sometimes it’s a good idea to update yourself with news from whichever sources you like rather than make emotional statements without being aware.", "_thatkashmirigirl_": "I have my friend from kashmir who last talked to her parents this midnight when they were crying over the phone and then wired her money because they didn't know when they'd be talking next. It's just so heartbreaking becuase this wasn't even necessary- making people go through so much", "shivanibatra11": "Another feminist turned out to be a dumbass🤦‍♀", "bashis1212": "Stop writing long illustrative paragraphs about things you are far away from. Just because you have never witnessed the wrath like the kashmiri pandits doesnt mean nobody has. Be supportive of what the government is doimg", "ritikeshgautam": "Bkll", "yeahiamworldwidehandsomehello": "@redheadwayfarer follow @withkashmir @anticastecat @feministflowercrown to learn more. They are reliable sources. But please please read about it from theirs and other important pages. Please DO.", "sahana2812": "I think you should not talk about something that you don't know completely. Just to get likes and comments don't post something without full knowledge about it...", "vishwa_makhania": "I wonder you are writing this! Banning media is for prevention of violence, which comes in anyone's mind out of common sense. And there was a time when Kashmiri pandits were thrown out of their own houses when this article was implemented. So I think government is making a very planned move to bring back what is ours.", "xo_peaky_fooking_blinder_xo": "Over thinking makes u mental.. So just keep quite 😂", "aaash_2000": "Unfollowing, BHARAT MATA KI Jai🇮🇳", "singhprabalpratap": "I used to love your posts and your thoughts but after seeing this post.. without knowing the things..just you want to give your opinion..this is bull shit..i am unfollowing you", "anj.gupta": "Half knowledge is always dangerous and it is clearly evident in your post. *dissapointed reader. P.s. I would really recommend you to go through the history of the article 35A first (right from pre independence and post independence eras) and then come back with a proper blog with complete facts and information.", "namewithheld._": "It’s hilarious that all your followers are Indians and how they put forward their opinions without even facing half of what us kashmiri have been over years. This dread we’ve known all our lives. It’s beyond fear and hope of seeing your loved ones again.", "jayrajdeb": "This is the silliest post I have seen today. Do you really know why the communication is blocked out? Do you know how many people have already lost their lives because of the Kashmir issue? I understand that you have a massive outreach here, but please don't just write anything @redheadwayfarer", "n_a_n_d_i_t_a_": "💔", "sharma.divesh": "Sometimes harsh decisions are needed to be taken for greater good. The phone and internet services are temporarily barred to ensure peace and stability in the region. As for your information if you don't know that how many terrorist organisations are waiting to disrupt peace in the region. So for the greater good and betterment, you take harsh decisions today so that we have a better future tomorrow.", "prashant__0102": "Pura Ram Kahani Khatam Ho chuka and ab puch rahi Ram kon?!?!!!?!", "ashish._.23": "Madam the Internet access has been cut off and section 144 has been implemented just to ensure that there is no communal or any sort of violence and everything thing will be fine within 2 days but u talking about the rights of the people have u ever talked about the right of kashmiri pandits who are still living as refugees in there own country and state, do u really care about the constitutional rights of the people of J&k which they were deprived of from so many years, the jobs and everything had a biased ongoing, forget about other state people, the people of Jammu where provided less opportunity in jobs and everything then the people of Kashmir.... It's good to have a opinion but at least have some knowledge and then share your opinion.... I'll just say that it's a matter of time and everything will be fine just celebrate today's historic day🙏🙏🙏", "divyanshisingh11": "As far as i understand, by including them in the Indian Constitution, we have now given them equal rights, as any other citizen of India - Equality, Protest, Education, Freedom. That's not a violation of their rights. If at all, its an attempt to undo past wrongs - as Kashmiri have been unjustly violated for decades by us.", "adnaks_bhat": "Get ur sources right", "ashishmakkar12": "If Kashmir is part of India ,then it should be no different than other states or else it can be independent", "bhattvivek12": "Appreciate your point and u have put it so beautifully but don't you think there's much more to J&K than Kashmir. Kashmir is just 11 % of of the land . There's Jammu and ladakh too. And nothing has been done unconstitutionally. The government is working under the constitutional rights it have. It should have been done a long time ago. We can't buy land in J&K but if the same thing will happen in mumbai or any other place. Can you imagine that mam. That's the issue mam. It's just not Kashmir it's J&K and neither people of Jammu and ladakh wants it temporary provision to continue. And I am talking through my personal experience of 15 yrs I spend in J&K.", "shweta.s93": "The step of cutting their access to phone and internet is temp to curtail fake news and rumors rendering unrest . A decision like this is to be taken my the Govt. and cannot be taken my a personal opinion of each and every citizen living there. And curtailing the internet there is not 'overtaking their rights' please be aware before you criticize. You are really abreast with feminism and I completely respect and have been your follower for long. But you need to know more on the situation before you post as you are very influential person, that too a very very good one I must say. But please READ UP.", "imdevsarswat": "Itte saal tha na 370 kya ukhad liya ab hm unko a6i shiksha denge a6e logo me rhna sikhayenge or unhe batayenge tere jese na bnne jinko desh Se lena dena Kuch ni prr bakchodi puri pelni H @redheadwayfarer hr foji ka parivar hota h sbka badla Lenge or terrorist ko jannat bhejenge hamare foji bhai 🤣", "simply_zuby2019": "I’m from kashmir working in Mumbai. I’m not been able to speak with my parents even we have landline and the main reason of having landline at home was that every time Indian government disconnects mobile and internet but this time they have done same to the landline and now coming to the point I swear by Allah this is the first post from morning by which I’m satisfied.By taking our special status how come Indian can come close to us Really appreciate your post Thanks", "saahibaan": "So trueeeee..you spoke my heart out.. I dont care what it will bring to our country.. But all i am caring about is humanity right now which will be crushed between all this politics.. Sad", "anvi_vaishnavi": "Yaar mujhe bhi shout out do hum followers provide karate hai cheapest price pe 🙌🙌", "gloworm93": "@redheadwayfarer what matters to me is.. The happiness and right of freedom of people. And this should be the only concern of everyone that each one of us in this country are safe and healthy and free. House arrests and barring general data or calling services is idk.. It's out of my understanding. Maybe it is for good. But if you look at human psychology, this is a matter of human rights and land, land on a bigger level. According to human psychology, people in kashmir may or may not take this as they are supposed to take it. This will only increase rage and anger in the localites. Because depriving people of the basic rights for days, is not less than a crime. But maybe it was for good. Maybe it was not. And seriously, as a humanitarian, one should thin from both ends. Special status or no special status, the minds of people are the ones we should be concerned about. It was perhaps a good decision to make it into a UT.", "aadagtm": "Have you ever tried to read history? What do you know about 370 ? Have you ever seen ground reporting ? Have you ever heard confessions of Kashmir residents ? you freaking know about Kashmir pandit exodus? All you care about taking away their internet service this is for their safety to avoid nuisance and mob gatherings or any sort of violence you fool ! They’re making it union territory it can be treated like any other state they don’t have to live in isolation anymore . they can also enjoy freedom and liberty which we are enjoying it kashmir will be treated as Integral part of Nation ! Try gathering knowledge do proper research and the speak !!", "namita.gautham": "My mother is a kashmiri pandit and revoking article 370 now gives her the ability to buy back her house there. With it being a special state all this while, violence still persisted, maybe this is the welcome change that will help with better employment opportunities for the youth of kashmir who are struggling to make money. A ban on the Internet and phone services is a way of curtailing violence and organised mobs which has been the way of uproar in several parts of kashmir over the years, something a local shikara guy admitted to when I travelled there. I guess it's best to wait and watch and see if a change was finally worth it.", "twelveshadesofhappy": "I've had my profile reported once already today for sharing my disappointment. But I'd rather lose a profile than my voice. @withkashmir for all the updates, all the way.", "anjalishahaha": "Follow @withkashmir", "_ek_gotakhor_": "Mam, things are gonna change. But it will only lead towards development and not destruction. Just for once keep calm and see these beautiful changes. Anyway i love your posts. My gf is a die hard fan of your writings. Keep it up.", "ketangupta.25": "Being an influencer, I’d highly recommend you read thoroughly before you pass a judgement.", "ananya.parihar": "Agye saare gyaani instagram pe", "amogh_h_c": "From this day forward, so many lives will be lost.? That's a pessimist conclusion", "r_e_s_i_stance": "Darne ki koi baat nahi hai modi govt ne kashmir ke development ke liye aisa kiya hai, no lives are in danger, everything is okey their. #removearticle370", "jsnoor26": "It's not the first time that people can't use their internet or other means of communication. This is something that regularly happens there to maintain peace and so that the news of any terrorist attack doesn't go out immediately which if it goes out creates more chaos. This is done by the government to maintain peace.", "gods_galll": "She know all the tips and tricks of how to get attention 😂😂 well do give classes for this people ned this very much in thr life thecway you do everytime i see when every is going left she is the one for right 😁 here right means direction not actually she is right ,now her fake fans and some english tutors will come and star giving lesson ....at certain point of time they won't get wat m saying but they can read my first comment and start cursing and tat too useless 🙌🙌😂😂", "iterative_infinity": "Please read everything about section 370, keeping in mind when it was introduced.You'll know why this is right.", "asiantunes": "It's sad and heartbreaking to see and even more sad to see Bollywood celebrities who you have looked up to cheer it on! Feel disgusted that people like Anupam Kher see this as a solution, when in most likelihood it's the start of a genocide", "mohit_kabra": "@redheadwayfarer finally there is one party which can take such tough decisions If we are feeling sad for the people of Kashmir , did we feel sad when stone pelting is being done on our soldiers ,security forces . When our thousands of soldiers are being killed, bombarded by Kashmir youth . This historic decision was necessary for our nation . Why a special right should be given to people of Kashmir whyyyy???", "manishibist": "I m loving these comments from kashimiris i hope they legit", "we_all_r_nomads": "You said it everything I was thinking about since morning, after this news started storming across news channels. Though we say one India , do we really know what impact it will have on innocent lives in Kashmiri. I hope they get employment and development rather just a political ground.", "rainbow____colours": "There is gonna b huge drama now which will affects the lives of common people", "mr_rock_n_rolla_": "Government is not going to kill anyone so please don't tell so many lives will be lost.", "swami1984": "https://en.m.wikipedia.org/wiki/Instrument_of_Accession_(Jammu_and_Kashmir)", "chitra_lohani": "@redheadwayfarer please just once, just for once try to think about the integrity of this country. Know about your country more before writing such stuff. I have always respected you and still respect you. I haven't commented ever on any post of yours because all of it was true. Kashmiris are Indians and they should be treated equally as the other people of this country. They must be given equal opportunities. They have the right to live freely and enjoy equal rights. And this article was a threat to their human rights. There was so less development in Jammu. People were threatened by terrorist attacks much more than any other part of the country. The soldiers serving there lose their life like their lives have no value. The soldiers want peace more than anyone because they have to return back to their families they have left behind to protect this country. And if they were not serving there, then we wouldn't have been living freely today. And those terrorists were so free in Kashmir to hurt them. Stopping access to internet or phone calls for a day or two won't take away the freedom of the people of Jammu and Kashmir. Army is there so that no violence occurs and to protect the people if any terror activity occurs. So kindly think of all perspectives.", "digantika_d_banik": "As correctly said by many the social services are stopped for few days to stop spreading wrong politics through social media.. It will b resumed soon.. Moreover kashmiris from longg hav only depended on tourism to make their way livelihood...In the past ,history is clear dat the place which is compared to heaven has not seen any devolopoment in many areas.. The youth is deprived of many opportunities... Even if they come up they feel scary to reaveal their identity dat happened this year in one of the reality show... So pls dont make social media an issue.. If they r deprived of this for few hrs or days...its for their good... The economic sector n youth specially cannot b leftover to b misguided.. Thus abolishment of article 370 n 35_A gonna b a boon.. For the LONNGG SUFFERING KASHMIR... Without getting thrugh party poliyics evryone shuld see the good notion behind this..we stand united as indians one flag,one nation, one constitutio, motto -desh bachao,desh k logo ko aage badhao...jai hind", "varunnarwalphotographer": "You speak about women's issue- & by this the problem of women's in Kashmir has been resolved", "themermaidscales.fanclub": "Now i doubt your intelligence. Do not try to be oversmart, writing a long paragraphs about something sensitive and which you do not have any idea about isn't going to make you look smart girl. Wave your fake feminist flag somewhere else. And PLEASE do not post about something you have no idea about the country's intelligence is way more intelligent than you i think. Internet/landline/tv cable has been shut \"for sometime\" so that the fake propaganda shouldn't be propagated further. Everything that has been done in kashmir is for the safety of the people of kashmir", "sampath_john": "Wish you could've stayed there with the soldier's and you'll understand why?", "__humpty_sharma__": "Seriously are u that much dumb? When u don't know anything about it than plz don't post", "minerva_singh": "Article 370 was a temporary provision, it had to go one day or another...J&K is not only Kashmir, Jammu and Ladakh integral parts of it...All these years nobody cared about our rights, it was always about Kashmir... It's our time now....yes, I'm a proud Jammuite..", "nirikshatelang": "Follow @withkashmir to know", "nairvineet14": "From last 6 decades the article was there and we all know what has happened and how much development the kashmiri people have seen... Removal of accesses and internet is I believe just for few days to control social politics and any promotion of negative sentiments..... Let's give this move a chance and see if it brings prosperity and connectivity in Kashmir ... We can just hope", "taanitanvir": "@redheadwayfarer Technically if you revoke article 370 & 35A, J&K automatically becomes an independent Nation as it was on 15th Aug 1947. We are no longer under any obligation of an accession deal done by Maharaja with Indian govt. India loses all its legal rights over the state. It is now an occupation of J&K by India being enforced by Indian Army !!!", "sunnyrana_7": "@ndtv Go through this news channel or there site and Instagram pages for true & exact news. @redheadwayfarer #ndtv #ravishkumar @ravishkumarndtv", "shivanshika18": "I haven't been supportive of our PM's decisions lately... But I am quite optimistic about this decision... We all have been talking about this for so long, and somewhere we knew that centre's control is necessary to bring peace in Kashmir... Some people do think that there could have been a better way to implement this thing, but I feel a decision like this, which we know colud have had drastic repercussions, required these extreme steps of deploying more army and cutting internet access in it's initial phase so that loss of lives and properties could be prevented and spread of unwanted fear and fake news can be controlled... Let's hope for the best!!!", "shubham.jain_sj": "These are the very incorrect statements you have written, well I just want you to know india is now \"United\" like all union territories people of j&k will get benefit from that. The youth who throw stones just bcz they don't have any other source of income at our army who potect them will stop. They will get employment. Terrorism , naxals who shelter's and attack , all will stop. This is independence.", "fitlife_rajat09": "Right decision hai ye", "tanyaramani1991": "If u know nothing please don't post rubbish .", "moral_hunter": "What do you know about Kashmir ??? Nothing just to get attention anyhow speak ill for India and support terrorism and Pakistan . Why don't you speak about terrorism no u won't because it not your cup of coffee.neither you will talk about lakhs of kashmiri pandit who are living as refugees but you will not speak for them . Such a hypocrite people you all are", "charmingly10": "It's a scary time don't celebrate it before you know the truth please", "pujangoel": "U know nothing Jon Snow 😜", "i_neely": "Saloni waha pe itne army men isliye bhehe Gaye hai taki koi galat group kuch danga karna chahe to use control me rakha ja sake ..or galat Aadmi ki shakal p Ni likha ki wo galat h.. wo koi aam Aadmi h hosakta h..isliye ish historic faisle k waqt kuch galat na ho ye such k itni sena tainaat ki gayi hai ... Or kyoki ab ye ek UT hai to waha ab cheeze sudharegi hi... State itne salo se tha..aapko bhi pata hoga kind kya halat rahe hai.kashmir k .. to.ye faisla hamare Kashmiri bhaiyo k surakshit or sukhad (safe and happy) future k liye Liya Gaya hai ... Rest assured 💐", "amitahluwalia76": "Only time will tell... But what is happening is not right at all", "a.kshanshjaiswal": "Are you stupid dude? At least read the facts properly ffs.😂", "akshay_walia_96": "Who the hell are you ?? Do talk to be stupid girl.", "jaspritkang": "I just want some clarity how kashmiris have enjoyed all the constitutional rights of India, roam freely and buy property and do business pan India but others don’t get the same treatment. Staying in Kashmir and traveling all over Kashmir one gets a very unwelcome feeling. You can actually feel the difference between Jammu, Ladakh and Kashmir. Having a all Muslim state where u drive out all non Muslims out is not human, not progressive at all. All this happened. My Hindu friends own@beautiful houses in Srinagar and they face a lot of difficulties and passive aggression from the neighbours. Ultimately they gave the house on rent and left. Kashmir has an issue which needed to be resolved diplomatically but making lives of non Muslim he’ll is not ethical. I have lived with Muslim neighbours in Calcutta and have felt enriched because of living with people from diverse communities. I would never want to live in a place where I only see people of my kind day in and out. Where’s the growth? This move might be hasty but this issue has been left to fester for the longest time. Some decisions are difficult. Maybe not all good but it’s for the better. Consulting Kashmiris who could not tolerate diversity in their state is actually not a going to be a healthy discussion. It was never going to be easy. People in Ladakh are very happy. They’re celebrating", "vishal_pajwani": "Dont post without complete knowledge about the topic just by following some congress supporting media", "shailaja100": "For one, our people includes the Kashmiri Hindus who had been evicted from their homes overnight. And kashmir also includes Jammu and Ladakh who are more than happy to be back with India. For a few Kashmiris who want to go back to Sharia law and once again enslave women and persecute non-Muslims....yes they might find it a difficult situation", "thebhukkarguy": "It is only temporary that the internet services are banned because of expected outrage among the people led by some extremists.and curfew is going on there.144 is placed to keep the violence under control..article 370 gave kashmiri muslims extra rights which will not be effective anymore..they are equal with rest of the indians", "abhilashi.mattoo": "No one is overtaking their rights. And this no form of dictatorship happening! In order to maintain peace and provide the citizens of kashmir the correct information and keep them away from any fake news rumours or wrong message which in turn just provokes anger and result in bad decisions i guess keeping them away from means of communication for the time being is justified... Coz the govt has tried all other methods which do not take their rights away all these years down the line but that just resulted in more revolt...... For such major important decisions this was the best that could have been done! We all know the truth what the ministers there in kashmir have been doing all this while till yesterday... Spreading rumours and keeping the people in dark. This was the best decision! To protect them and for their welfare. No one's taking their rights away.. in fact after all this, scrapping of the #article370 there is a lot to provide them in terms of opportunities and rights! @redheadwayfarer", "sarcastic_homosapein": "Please have a bilateral views you being an influencer.", "manish_436_indian": "It was meant to be done coz u being in media line you should know that Kashmir was a state that was always being targeted by the outsiders to come in our country and spoil the thing. I think u forgot about what happened with the Kashmiri Pandits. Sometimes you have to take strict decisions for the betterment of every people there. Coz not every Kashmiri pick stones and stand against there own nation. I know we still need to improve in many aspects but we have to start from somewhere and so we did. But i just wish no rape,muder or revenges happen , i just pray everything sorts out beyond political reasons and just get solved in humanity reasons. Just wish nothing harms the humanity ❤️", "siddharth_peepra": "@redheadwayfarer madam, i thing you do not know anything about article 370 !! Why you hv not mentioned about it in your post ?", "h_e_m_a_n_t__": "Pahle tu decide kar bc what you want....Faltu limelight me aane ke lie kuch bhi chao mat dia kar", "aryasharan_": "@swapnil_joglekar comments", "pikutherealsoul": "@nitibhakaul", "sanyukta.bhattacharjee": "I'm sure internet connection is blocked only temporarily and in a way to avoid casualties.. This is most beautiful thing that has ever happened in our country. Kashmir is us and we are Kashmir. We are together in it.", "dimpledalal19": "Yes no internet, no phones, no cable TV, no internet for businesses n mediahouses situated in the valley. Most of them dont even know what decision has been taken for them. There is curfew in many parts too. N military everywhere. M trying to get in touch with family n frens there, but nothing since last night 1:30 . Worried as hell.", "harshil.101": "Cutting off all source of communication is just a way to narrow down the chances of any kind of dispute the less they know for now less the group of certain people who have been disturbing every sort of change good or bad will be acting or creating any kind off disturbances. Its no doubt the decision is big but then that's Modi. Things need change people need change that turns out bad or good for that let time decide. 🤞i mean ain't nobody is bigger than Time and fate.", "sarah.a.khan": "I see no kashmiris commenting here unfortunately...", "alishashirinjrx": "@redheadwayfarer it's true that the people of kashmir has no more access to phone and Internet. My best friend lives there and I have been trying to call her since morning. I called her last night it was accessible and she was crying. She and everyone on kashmir is very upset with this news. 😔", "parvesh.012": "Kuch log hote h aagr modi kam nhi kre to fir bi g*** m dard rehta h or kuch kam kre to fir bi g@** m dard rehta h kya ho be", "_shetty_suhas_": "Nah , what you are telling is completely false . Internet services are barred just to ensure that no terrorism act should be done inside the Kashmir and surroundings till the complete law has been amended .you need to read about article 370 , and the torture that people are suffering because of that . Now that it has been abolished , they are free to everything like other states . They can enjoy their birth right , and please check the facts before posting , because you have been an responsible person . Thank you", "rharijan49": "Talk about women empowerment ....don't put your dumb head in politics....you are no one to judge our government decision...try to stay away from this....we want peace and Kashmir is part of India and whatever stopped there to secure the people of Kashmir....ok...and don't put wrong pictures....", "hippiefromthecity": "See Kashmir was given a special status in 1947. And the Executive retained the power to take back that Special Status. It has merely exercised that power right now. And honestly it's high time this happened. With the unrest that has been prevailing there for the last few years, it's clear that their State Government is unable to contain/ curb the unrest. There is no need to call this Act 'undemocratic', because it has less to do with democracy, and more with internal and external security of the nation. And honestly, it's been over 70 years since Independence, why should one state get special treatment, when clearly it's only done more harm than good. I have always been one of the biggest critics of this government. But this is a good move.", "_zeel_shah": "@withkashmir", "saptak.banerjee": "Declaring J&K as UT and Ladakh as UT will now put the non Kashmiris and the Kashmiris at par in terms of exercising their rights freely, Kashmir is now as much as part of India As Delhi.One can now study ,live , work in Kashmir freely...", "bollywood_dreamofficial": "Kashmir has always been an integral part of India. And Pakistan has been on wars with us claiming Kashmir, since it has been given special status till date, the Minister's there were enjoying money both from India and Pakistan. So this step will throw a major blow to them and the people will get full citizenship rights.", "ramsha_basar": "No this is not true the internet access and everything was shutoff temporarily so that no riots must occur the whole thing is about making jk a union territory with legislature same as india. Before there was diff rules for jk then india normally, they were not under ipc (Indian penal code) trades were only done in jk with jk ppl now trades are allowed with other ppl of india.", "muskan_bhat": "i am a kashmiri and it is a right decision to take away internet services and calling as well and its all temporary to avoid mob gathering and nuisance. it was a right decision to take away article 370 and 35A . it was much needed😍happy kashmiri pandit🔥", "mohantapravash17": "This is just not about Kashmir....and let's not rush for the reason, how aware are we about, what's going on?....Either ways you're just helpless, can't move an inch of story from both ends... LET'S WORK FOR NATURE... LET'S BE AN INSPIRATION THAN A SOCIAL MEDIA OR PART OF IT.... LET'S INFLUENCE THIS SYSTEM.....you & me are not different apart from the work we do....So let's keep calm and enforce our work and health to reciprocate by our GOOD-VIBES & GOOD-WILL!❤️", "_swatiluthra": "I'm so confused as to what should i feel about this? we have no contact or information from the state itself. all I'm requesting everyone to do is form an informed opinion. read about the history of the two articles that have been scrapped, read news from portals such as Newslaundry or the wire and don't blindly rejoice in the decision because you follow the man behind it.", "sajjad_shaik2": "AAP har dafa real face dikhate always with you madam jii 🌷", "shevam_shb": "https://www.aljazeera.com/news/2019/08/kashmir-special-status-explained-articles-370-35a-190805054643431.html", "blackrose3445": "Basic rights of Kashmiris r invaded...no access to call msg internet block... cherry on the top was curfew... but why we here don't curfew why the r sufferings for this.... my fiance in srinagar I can't to him not msg him this what govt want to invade suppress the rights of kashmir by breaking it", "niharika__khajuria": "Hi, i am from j&k. I think it might be a good decision but how can government decide something and not even let us be a part of something so major. The govt. Imposed section 144 in the state yesterday, people were stopped from going out of their houses, internet and phone connections were cut. We people had no idea what's coming our way. There was just army everywhere so that no one could protest. If there is going to be decided something major for j&k the people should be a part of it. They just imposed it on us and they knew no body would accept this, hence the troops. People of j&k feel betrayed and oppressed. If anybody is to decide this state's future(it's not even a state any more) it should be the people", "andromedan_0.4": "Read the complete history of Kashmir(not one sided), you'll find your answers and why article 370 had to go", "i.m.shilpa": "Exactly the same feeling. Don't know how to feel about the news. What is it that they want, has that been considered? Is it right? Is it helpful? So many doubts.", "_sachin_2818": "No other solution to end terrorism just keep faith everything will be alright", "rishimalve": "i have always appreciated your views on social topics but today i wont agree as ppl there throw stones at our Indian Army and today they are being Respected or Feard; Indians respect and traitors are feard of Indian Army, I respect them what about you ✌🏻", "ayushidixit_97": "Follow @withkashmir, might clear things up. Situation is inhuman in kashmir. There's nothing to be happy about colonising people. It's unconstitutional and undemocratic. Their voices need to be amplified.", "rashimhd8": "🔥🔥", "dusky__diva": "I am Happy..... We are taken back....It's where we belong..... So Happy that Jammu people will also be treated equally and not like before....", "chicaferoz": "How is locking up people in their houses by imposing a curfew, lying to them that there a terror threat is the reason for deploying additional forces and cutting all communication lines a win for any democracy?", "__shah_palak__": "Just the thing that we weren't even allowed to serve in Kashmir, it being a part of India !", "the_dreamcatcher.16": "Follow @withkashmir they're posting accurate information.", "kiran3126": "😍", "supriyyyyaaaa": "🔥🔥🔥", "soniksha__": "@withkashmir is a good source", "____gelato": "my heart goes to all the kashmiris who have not been given a say about this.", "sad.fui": "Disgusted by all the jingoistic celebration happening on my timeline and whatsapp", "angstynutbrain": "I'm absolutely heartbroken and disappointed.. Not really sure what the real picture is considering we can't really gaugr reliability of sources, but I feel so disappointed.. This kind of feels regressive in so many ways.. Hasnt history proved time and again that this is not going to end well for anyone 😞 It sucks whag human rights are given lower priority as opposed to propaganda, hate and ego", "samruddhi_2805": "Honestly, I am individually very confused. My friends from Kashmir are obviously condemning the entire decision and also the process of its implications. But I see a lot of people celebrating the decision taken .", "tibrani_khan": "ua right thre iz no access to phones and all.. m a kashmiri too", "srishttia": "Read from Reuters - trusted news site!", "lakshmirajpurohit": "The phone and internet access is cut, so that no violence can be initiated! Since there are a lot of people waiting to make a riot of anything!!! But it’s temporary, and In conclusion ,what is happening is Jammu and Kashmir is now a part of India the way any other state or UT is with the same set of rules . The “special status “ that Kashmir had was always said to be temporary since the day it was implemented", "anamika_badyal": "Nobody's safe in Kashmir and you will find no unbiased media. It is sheer death of democracy, and who are these people in the first place to claim that Kashmir or for that matter any of the state is theirs? #deathofdemocracy", "aayushkumaryadav": "Gorgeous😘💕"}