{"zahra_____xx": "💯💯💯💯💯", "smriti__shah": "🙌🏽🙌🏽🙌🏽 well said.", "riyaaa218": "THIS is everything.", "usman_u_kay": "She is also mentioning her own father now. Can't do anything thing with these feminazis. I use to offer my bus and metro seats to women but these bloody feminazis will make me to change my attitude .", "dr.paradox15": "@redheadwayfarer please read this whole thing out and then decide.....You know it's everyone's fault.....men, women, children, the aged......you know why...... because we have been stereotypical from the time we were born......we have been taught this way of life even before we knew what right and wrong is......but it's time....we have to unlearn things.....we have to let go off this fucking insane tradition..... Priyanka Reddy will never get justice with this stereotypes......we have to blame OURSELVES before we blame anyone......we have to blame our parents before we blame anyone.....we have to blame the people we know before blaming strangers......all men are thrash.....yes true even your dad maybe then......but we always want to forget than an actress dances to an item song, we always want to forget the movie industry.....they are equally to be blamed if not more.....and what about the votes we give......⅓ of the politicians have a rape allegation against them.....we are ready to forget that too.......one says teach your boys to respect women.....I say teach OUR CHILDREN TO RESPECT EACHOTHER.....there is no good to divide the people into boys and girls, males and females, rapists and victims.......it has to be humanity vs monsters......", "lorrgrrro": "@oadrianao 🙌🏼", "sahilmark27": "By my opinion they should not be killed unko ek jatka se ek goli se marke no use they burnt the body of priyanka reddy they raped her the pain and mental torcher from which priyanka readdy has passed they should all feel that fear theu should also relaized that pain show they should be punished so brutaly recently the picture got vireled that 🐀 was sitting on their penies something lke that aur something more brutal tht they rapist cant imagine cut their hands and legs and throw then on the road then they will realize the pain of that girl😭🤙", "theahmadkhanofficial": "There should be a forceful slap on Indian Nation's face that they ignore that Kashmiri women and girls are also women. Why they are Raped and they lose their respects from the Indian Army and police 😣", "infinite_emptinesss": "Dear stranger Hyderabad police just killed all of them so yeah bharat Mata ki jai", "13.vignesh.pai": "Well Madam, by 'stranger' if you are referring to me I never in my comment on one of your previous post tell you not to give your opinion and share your feeling to others either directly or through social media, the only thing I requested you was to stop cussing our Country, the matter of you choosing to be India's daughter or not is purely yours and I do not condemn you for your thoughts, views and opinions. The mental and physical torture that one of our sisters, Disha endured is something i cannot imagine in my wildest dreams. KARMA gave back the uncivilised Stoneagers what they deserved and ironically it was at the very spot where they had subjected Disha to those inhumane ordeals. Well I do believe that every student male or female must be taught moral values. Moral values must be taught first at home and then at school, this should be the first step take by the government to ensure safety of women in our country.", "swaaaraaaa": "I don't know much about you but lady you write what I want to write ..you are lady with a sword ..go on I wish some of the moron might get a hridya pariwartan bcz of you 🔥", "chimnani_gunjan": "That's the truth we should change the slogan to bharat pita ki jai... Keep going girl.. Even everyday atleast for few seconds i feel what if i m next. I carry some or other thing so i can protect myself.", "nam_dev_il": "No it's time for tere maa ke chut", "bamnicole1997": "Maa chuda gyaan apni gaand mein hi rkh", "drkdas8195": "really?go and do some research on rapes in Europe and usa.you are really bullshit.", "maharana_of_mewar": "Don't say abusing word about Bharat Mata.", "dishant_nayak": "Bharat Mata ki Jay 🙏. Always.", "r.varg3112": "Tweeting is not gonna help", "karan.sandhu8": "Han to tum Kyu, Gyan Chodti ho, Free nipples nangye ghumo, apni beti ko sikhana ye sab bhadwi", "realbasant": "Love d", "jessicapereira1771": "@pieabys007", "word_artist__": "🙌🙌🙌🙌🙌😢", "rahulkl__1": "@antifeministmemes", "extrites.bruh": "Bruhh the grammar of people in these comments 💀", "rosejaryal": "@amisha_marwaha THIS!", "saumyaa_anand": "🙌🙌🙌🙌🙌", "goigarg": "rape is never a culture of India talk with statics this is the only country where people rage when these things happens and who gave you authority to decide my motherland Gender will you kill your Father and brother also with this Pseudo feminism cancer", "inaya_aabir": "I just cant understand why the government cant change the rules If money can be changed over night then wth cant the rules be changed I just dont understand this happens every day every night every hour as there are no strict rules and punishments Make the rules so strict that they even fear thinking of doing such things We fail as human beings we just want the politicians who come to beg during votes wth are you doing now Iam ashamed right now being an indian Just thinking of changing my name right now Not a proud Indian anymore So sad cant say anything just torture them so much that others shiver even thinking of it 🤬 *take a screenshot of this and share with everyone so that the government sees this not doing this for likes or something its just that Iam ashamed being a Indian😞*", "tripti2565": "Yaa. Every girl is so scared now.", "utkarshhhhh._": "Its an unpopular opinion but i think putting up such articles on the internet is of no use. Its True that we must create public awareness and consciousness amongst the uneducated sectors of the society who think when someone is sexually assaulted both parties are to be blamed. Rape is a very serious issue in our country and the increasing of it is only alarming, we must certainly take some initiative toward a better society but writing these articles on the internet is of no use because these mostly go unnoticed and it just fuels ones personal ego and one feels that they has done his part. What i believe is that it is better to have community meetings and educate people rather than writing these articles because these article tend to be abstract and have no affect on the general media. All we do by posting articles like this is blow things out of proportion for the victim because a rape victim would certainly not want publicity and would rather have the matter under covers. Its better if we keep this opinions to ourselves and really take action because to put it bluntly the writer of the article has just wasted their time and the only thing they have achieved is a few number of likes on a social platform and not really achieved what they have set out to achieve. The idea behind these activities are very revolutionary and impactful,, but execution is in poor taste. Cheers 🙏🙏", "chaudharyamitabh": "👏", "papa_stalin101": "Carry a rocket launcher or pepper spray", "cuedatchinese": "❤️❤️❤️", "ramzimoraliofficial": "By saing that my furniture started floating nigga wtf", "melzina_fernandes_": "Caption on Point 💯 I had this strong feeling of terror, grief and insecurity in my spine .. Thank you for this ❤️ #TimeToChange", "prajwal_shetty666": "At xboom we have been working on women safety and it feels so bad that we couldnt make reach to the mass yet. but we are flaming hot to spread awareness of self defense gadgets as much as possible. Its www.xboom.in where people can purchase online across India. #fightback", "______starstruck": "💯", "sanghvijainam9539": "Yes. Bitch. What about 'bebo' ?", "dikshasharma01": "The tragedy is, the nation has been successful in inducing the fear of being raped in every girl's heart, but not even half close to this when it comes to the rapists being afraid of the gruesome punishment if they get caught.", "realyouuq": "The way things are going on, they won't even get a single girl on this earth", "mayannabrunelli": "These behaviors cannot be interpreted as normal or natural. If it's cultural, we create. If we create, we can change them. Fighting the culture of rape implies being mindful of any everyday attitude that undermines women's freedom. It is necessary to respect the woman more as an individual, as a human being than she is. With your desires, fears, ambitions and dreams.", "prapti_panda959": "🙌🙌", "abibarman6": "🔥🔥", "rahulchaudhury1397": "Aight!! BHARAT PITA KI JAI!!", "urs_vivek__": "Bharat pita ki jai", "writer_rv": "Incredible #India ki Incredible #Story Everyday more than 89 \"#RAPE\" cases are register in India. India the place where women's are #worship_as_goddess. A Server says that in 2017 - 32,559 \"RAPE\" Cases has been registered. When ever there is a rape in India people just start posting #status or they conduct the #candle march. But they never ever think whats next? Does this really #help someone ? Does this much really change something or the things are the #same? This thing only create #pressure on the #government,and the government start #blaming each other.This is because of #Congress or this is because of #BJP. What's the end of the #story. Nothing is #happening &the #same_cycle repeat itself. Ask your self who is #responsible fot this #Government or #people_of_India. What is the Solution for this...? There is only one #Solution of this issue.This human animals handed over to #indian_army and when army is giving them a #punishment. Just give it live to #media.Beat them that much they came on #verge of death, give them #treatment,and again #beat them. Then just #Repeat the cycle", "i.live.in.between.rhymes": "💯💯💯💯💯", "that_witty_lady": "Wow I just teared up while reading this. I am at loss of words, rather emotions on how to react to this. It is true though, that could have been me or my sister or my friend, and this doesn't shock me anymore. I don't know how to react to this @redheadwayfarer I'm numb too.", "lalarajeev": "http://chng.it/tLZbvZFr Can you help me out by signing this petition? http://chng.it/tLZbvZFr A friend has started this petition for death for rape... I would recommend public flogging unto death...", "oddgentlemen": "💯", "ar.jun742": "Hello all there is no change is required in heading, taglines, words, sentences, letters and hence debate is useless but change is required in all of us how consciously we all carry this society with responsibility and integrity. Our concern should not limit to particular geographical area but our concern should be to all corner of the world then only womans protected. They are not womans but they are humans too......", "themommatales": "Women kids babies and animals none are safe well it might burn many but this country is really turning intolerant", "reeyaa_thakur": "Another case if gangrape of 16year old in chhattisgarh... I feel shame to borne in India, I feel shame to be an Indian.. Indian law, Indian mentality... Everything is sick... I feel traped, I feel unsafe, I feel fear, I feel anger, I feel frustration I feel like punishing all mens... Jiske aurat se paida hote hai usi aurat ka rape karte hai... Sm says take precautions... I say Dr should not b any need to take pracaution.. India should be safe place for us to move anywhere anytime", "naman__suthar": "U has platform lot of followers and you are feminist why can't u startd protesting with thousands of people ...", "joyhimanshu": "Dear @redheadwayfarer do something in real world, mere writing essays on the internet will not protect the woman... 🙌", "miyatsumuu": "Don't get whats so hard for haters to admit that they r wrong like people r dying ffs and they still want to argue about this", "dwayne_cubbins": "Pathetic women like you who turn to blame all men for rape is why we'll never move past this. Just about every male wants those bastards to hang. Men are raped too. No sane person supports rape. But this kinda bullshit of throwing all men under the bus is why nothing will move forward. The death penalty for rapists is the best option but do you even know how many women/girls falsely accuse men for rape? It's way more than you might think. That's the sole reason why the death penalty isn't always considered.", "roshni_singh_080": "There are some men who truly understand what she is trying to say...but some are just point at her saying toxic feminist without even understanding it", "preeti_tomar96": "You are BEYOND amazing Saloni. ❤️ So brave. I feel bad for people commenting things like \"yaha lambe captions likhne se kuch nahi hoga\" I wish they could understand ki hoga, iss se b bohot kuch hoga. You are making girls strong every day, you are being their voice, you are making people aware in you own ways. I am thankful to you for being strong enough and not letting these hate comments stop you.", "videeksha3272": "🙌👏🙎", "noahs_words": "Just woke up and read the news. This time it’s a 6 year old girl. I dare them to make this topic about their asses again- I would literally punch them in their fucking face before they can end the sentence „Not all men“ Again: a six year old -for me still a Baby. Raped and murdered.", "amit_.020": "Whats the problem if i say bharat pita ki jai.its better than bharat mata ki jai", "alexthehungriest": "I'm so sorry this has happened and I admit we havent done enough. Us guys who consider ourselves feminist should be correcting the behaviour of our friends when we see it even if it means not being friends anymore. Change doesnt start at the large level, but the small.", "tanyaadel": "All the efforts are going into building bigger Rams and in Pakistan more mosques . Buss sab theek ho jai gaa 🤦‍♀️🤦‍♀️🤦‍♀️🤦‍♀️🤦‍♀️", "exogenisissss": "Word.", "____halcyon_": "I have been feeling exactly same..ditto same. I am so so so scared..terrified. i hv been having really bad dreams ..about me being raped. I had a dream in which i was in a hospital.. i was crying nd walking scared because everywhere there were women who had been raped, burnt, hurt, acid attacked..i woke up choking. I feel like throwing up too.. I talk to people about it ..they feel sad too, but they are not affected as much as i am. i often feel i am too sensitive than others..but seeing you feel the same way. I know now that i am not too sensitive, others are just too blind. I wanna make a diffrence.. i try so hard..it never is enough. I hv been groped in 10th grade, i have been touched badly in 7th grade and in 8th grade. In 11th grade, i was forced by my own boyfriend.. nd i hv been followed uncountable times. When i was wearing a shorts, nd also when none of my skin except my face was visible. I share your each and every caption in my story..i feel relatable reading how you feel. Most people feel sympathetic towards rape victims nd rape news..i feel rage, anger, fear, everything at once.", "thepokermask": "@redheadwayfarer I truly buy all your points. I also am deeply hurt hearing such heinous crimes. Even the law makers are. Its just that the person who could read your words and understand it, I doubt they can even think of #raping someone. #Rape isn't a culture, its just a sick mindset. It is #notallmen flag or a #notenoughwomen fight. It is a fight against sheer humanity. This voice you raised shouldn't be against the male gender but just against those inhuman rapists. In that I too resonate with you. ~ One stranger on the Internet.", "atintaneja": "Who is \" you\" ?", "_avyy_": "These are such powerful words🖤", "thatanonymousmiss": "Incredible India🙌 Those bastards are protected like celebrities..as if they have done such a Great thing For Nation. I support retributive punishment..Eye for an eye..Burn those assholes alive..These procedures of law and order instead of threatening the criminal, they give an excuse & courage to commit such heinous offence. They use procedure of law & eventually either get a bail or imprisonment. Nirbhaya case's so called bastard juvenile was set free...we need law re-forms.", "kanikpuja143": "Ys", "alcohol_you__later": "Absolutely true....", "sejalsalunke": "So powerful ❤️", "istalker_23": "Rape is a rape.... don't make gender war!!!", "anonymous_poettt": "Dono ki jai", "anosjc": "https://youtu.be/XZiLl5YIKpE Watch this another brutal gangrape!!!!", "bookworm_traveller": "Maine kaha na agar sahi bat likhne pe bi kisi ko chul ho rahi hai Matlab chor ki dadhi pe Tinka...pure dunia ka theka tumne le lia Kya kaun paise bana Raha kaun kapde pahan Raha kaun Kya post dal Raha kaun Kya bol Raha", "jezzkaur29": "So true @redheadwayfarer", "imh4427": "https://www.instagram.com/p/B5k7HRJFACD/?igshid=togfclboy6yy", "ik__ilma__khan_": "@narendramodi", "srishti_j29": "👏👏👏👏", "bhavana0798": "Word's are so reall😭😭😭", "crazzy_rage": "https://www.instagram.com/p/B4m1vEHn7hE/?igshid=k4bz9olity3t", "shelzieee": "@iam_sachisrivastava !!", "aartii_23": "I’ve never related to anything more in my life. These past few days have been really terrifying. Still scared to go out even in the daylight.", "saby898": "Enough is enough...I am sick to the bottom of my stomach,depraved bunch of beasts.", "baurai_karishma": "This is fucking disturbing.. heartbreaking.. I have so much anger but don't know wat to do.. I am scared.. am angry.. I want to calm down myself but I just can't.. People are literally on roads, you can see their anger.. you can see all these rallies but I don't know if the government can see this all or not..", "priyank0289": "Mind fked....salo ko raste mai la ke sab ke samne live tv pe goli maro....ke agli bar dusra koi aisa karna to dur ....sochne se bhi dar jaye....", "shraddha_s_shetty": "Patriotism is not praising the country. Patriotism is accepting the reality of the country and working for betterment of it. People first have to understand it", "rani_shera": "Very easy to type and post and reply on facebook insta if u really want to change something then please call for a HUNGER STRIKE and invite all of ur followers( including me) then we will make a change otherwise baate krte raho baaki sb ki tarah..!!", "rohit__rj18": "@redheadwayfarer Brutal..😡I cried with this act😭 I agreed with you ma’am 🙏🙏🙏I feel shame on us as a boy ...Even I could not protect our sisters...", "moumita_pakira": "🤐🤐🤐🤐", "becca.singh": "💔", "_vishsky_": "I'm sorry. As an indian guy I just felt the need to say that. I don't know what to say.", "kanishkabhatnagar": "👏", "21dishabiswas_": "👌👌heart touching", "_anand_singh_4": ".TM bc gayan pelna chordoo sab salay madhar chod thumahay ye bat TB sochna chiye jb TM ek ladki Kay sath relationship may aatay hoo n usay sex Kay bad MISUNDERSTANDING Wala chutiyapa kr Kay chortay hoo", "swatiii_n10": "💯💯", "amanjacque": "Bewakuf Jo log rape karte h na unko koi dark nhn padta in sab bakwas se....", "shivani172000": "Well said!😔", "neekii22rai": "Someone needs to FUCK PATRIARCHY for REAL!", "artisto_chic": "Thank you for writing this n all your previous stories . Last few days have been so disturbing , but I find solace in your words. Someone feeling the same n speaking the things out loud just feel like a warm friendly hug. Thank you🤗", "sudhir_shad_mastfakeer": "Tarruf nahi rakhta Teri har baat se main.... Par yeh woh muamla hai... Jehan ittefaq na rakhne ki koi surat nazar nHi aati.. @justice 4 priyanka reddy", "aarohiptl03": "🔥👍", "chandanxz": "BHARAT PITA KI JAIIIIIIII...... Both rapists and idiots like you are the problem.", "owaisshaista": "👏👏", "suraj_k_nair10": "I respect your words but government should do something or otherwise we can do something😡 (literally iam angry I'll kick their assess)RIP :- priyanka reddy", "susmoy9336": "don't politicize everything", "krupa_patel_357": "Agree mam 😎👍👌💪💪💪", "_are_cavan_aar": "❤️Yeah 👏👏", "paushalli": "🔥", "khushi_sitapara_": "I've been crying too. There are going to be a lot of hate comments on this one but these people are just proving the point made by @redheadwayfarer", "sanjeetashrama": "💖💖", "sinwerriya": "keep saying keep expressing👏🙌", "priyanka_rawlani": "👏👏👏👏👏👏", "kamalikaganguly": "❤️❤️❤️", "tina_freebong": "How true is this", "_astrea_0804_": "❤️", "ziffin.1204": "My inspiration 👏🏽👏🏽👏🏽", "man_bale": "Bharat Pita ki Jai 👏🙌❤️🔥😂😍😭", "meesha_hasan": "Well said✌️", "im._.sanjeevrathore": "Okay I will if rape stops after saying so ...I will say 100000 times if that is the solution", "perksofbeingaaheli": "I'm glad you are so vocal about this. We need more women like you who aren't afraid to say it as it is. You're giving us so much of strength ❤ We need more people like you. I'm glad that I have you to look upto. Thank you. 💕", "privatelifeoframsharma": "Dear Stranger on the internet......the next time ISIS, Al Qaeda or any terrorist organization attack any place, start hating and targeting all the muslims and start riots........ I mean seriously @redheadwayfarer. #riplogic ...We all feel the pain. We are all hurt. Don't show your anger by targeting all men. Do something constructive that will actually create an impact. If you really mean all those things that you claim....take to it road....let's take it NCR, block parliament road. I will join you.I am sure you have many celebritiy friends. Come let's take to real world. I dare you. .... But no , you would rather write and hate men. End of story....... Again all bark no bite.", "____arzoosaxena01821____": "🙌👏", "shrutimehta21": "💯", "be.you01": "Every single word is relatable🙌", "we_all_r_nomads": "This is how I felt the whole week. Friday I had to be in a party which went till 11 pm. First time in life I asked my friend to accompany me home in Uber. I felt so weak. I kept thinking of her and all other women who had gone through, going through the same and may go through in future. I might be one of those unlucky ones. How can I prevent this from happening. Should I start wearing more clothes? Or shall I stop going out alone after 6 pm? Maybe I should know how to fight and should make a strong body... maybe I should be always suspicious of my environment. After reading the comments passed on the comments box, the neglected behaviour of my friends on the real fact , watching TV news debate and hearing the patriarchal mind set of educated people, aren’t you are in self doubt? I keep thinking if I am a that angry feminist woman who relates everything to patriarchy and equal rights. Or people around me are the ignorant one ( including woman) . I don’t what I have written but on your forum I feel most safe to say out things loud coz I know many of us ( those r in your page) feel the same.", "nutella.nutcase": "I really don’t understand my country sometimes, rape is so common that even if a stranger smiles at me on road I get hell scared with goosebumps now, it’s just so sad that we can’t do anything against it, like I see guys on road whistling from behind, commenting, slowing their bikes while they cross a girl and it’s just I made it a point to ignore it but now every time I am coming home late from work and my parents are worried for me so on call I tell them I will be fine but I can feel goosebumps on me as I know how scared I will be in an Uber back home .. n what should we do to not get raped while we just finish our jobs and go back home!", "erzadz": "❤️", "diyhah": "💖💖", "d_w_khan10": "🔥🔥🔥🔥", "e_valk": "I’ve spent a fair amount of time in India & my overall takeaway as a Westerner isn’t the food, the architecture, the religiosity, the spirituality, none of that. I was always shocked at how women & girls are treated. The Eve teasing, eating last, having to cover up, not looking men in the eyes. America is bad enough for those born into female bodies, but, Indian men really desperately need to make a cultural sea change.", "justmaitri": "💯💯", "paapkojalakerakhkardunga": "You are really brave, Saloni. These negative comments are draining, and obviously will cause an emotional response amongst all the logical explanations and why should it not? You read them and try to make every individual understand relentlessly of the facts and still some don't get it. It's okay, your contribution is made up of big efforts. We respect you.", "iiaasthatiwariii": "@vikas_shuk", "zarya5670": "Ohhhhhh.....", "lancy_chavda": "🔥", "snacc.shee": "You're an inspiration. @redheadwayfarer", "youma_smith": "Kon sa maal fuki ho didi", "luna_stardust_": "@riddle_of_desires", "the_beautifulpurpose_2212": "🙌🙌🔥", "negiaditi24": "Yess men get raped too but no man lives in the constant fear of being raped or harassed every time he leaves his house!", "mudassirkahnn": "Yes. We are always scared. Molested on streets, buses, some cousin... some stranger. So fucking sick of this !", "the_semicolon__": "🙌", "gurleen021": "PREACH", "_muskan_228": "WHAT👏ARE👏YOU👏WOMEN👏", "eleutheromaniac.soul": "@raksha_damor", "__.mohnish.__": "Totally agree with u, consecutive 4 rape cases in a day is not at all acceptable. We have gotten Independence for almost 70 years now and still our women are unsafe from such heinous crimes. Until and unless we don’t make the streets of India safe there is no point of our constitution or our laws.", "mandeep.makkar": ":/", "___voham": "@redheadwayfarer As a stranger on internet what can I do ?? I respect women I'm born from one. As a human being thats what I could do... I feel sorry for the crimes happening against women.. if we consider the Nirbhaya case or Unnao or Kathua. Etc if we assure proper penalty against women abuse it could reduced.. our laws are much weaker dear sis... Thats why this all happens - purely my opinion thank you..!", "_manisha_401": "Wow! U nailed it 😍", "swathisudhesh": "👌💕", "aarushi_arya": "🙌🙌🙌🙌", "the_sagar_shetty": "We understand that all you girls out there are in pain and so as we, but at the same time what matters is that we do something on the ground level cuz just by writing this and accusing our society nothing is going to change. We are also angry but that won't do any good. If you really wants to do something for the girl or for every girl in our society do something practically and we are there to support you but accusing only boys for all this this lower our morale too. It's like foreigners abusing Indians , though they are not directly telling us anything but still we feel bad right.", "saniya.mariam.thomas": "Well said !", "_sunaina.sharma": "💯💯", "sakshisachdevaa": "Soo beautifully portrayed 🖤", "this.andthat": "👏🏼👏🏼👏🏼", "_saanviverma_": "Word . 🙌", "whopunamrawat": "Huge respect for you mam💛 @redheadwayfarer", "__rj__7": "👍👍👍", "madhumitaschowdhury": "Well Said 👏👏", "anmol._sharma": "How would that change anything", "payal_bathija": "Omg YES", "heisenberg03": "missandrist explosed 👏", "_yeshaaaa_": "More power 💙", "notyourpotato_17": "Words so powerful 💯", "007inimad_20": "Completely agreed wid u... Mam👍👍", "the_holisticmermaidxo": "THIS💪💪💪💖💖💖💖💖", "sheinthegloss": "Looking forward to what those hate commenters have to say on this post, I’m sure they’ll still come up with something to say. But there’s not a single thing which is not true about this post, not a single thing every girl on the street doesn’t do or feel every time.", "atul_pathania": "💯💯💯💯💯", "bhavinkapasi1977": "😢😢...Heads down in shame", "giridhar_kattimani": "Sarcasm 🔥🔥🔥 Words so powerful.. agree wit yo mam🙏", "sahiba._s": "can se simply talk technically n demand for amendment in law where the penalty for such case should be death penalty only...instead of just vaguely demanding for punishment... Also our courts should take example from Bangladesh courts' verdict for Nusrat jahan where the facts of the case were very similar to Priyanka reddy's case ' wherein death penalty was given to 16 people with 60 days...", "lilmiss_silly003": "Completely Agreed with you....", "yogookayy": "This is written so well, every thought and every word a woman wants to tell the man who always uses \"but women make false accusations too\". Just to save themselves from feeling threatened or showing that they're the good ones ,they show that they care ,but they don't. All they complain about is how feminists have made their life hell, a little discomfort, a little rules are so difficult to handle their ego. Not even caring how women have to live in fear and precautiously all their lives. And the worst thing is they all group up and target you to put you down for being a feminist or correcting them, and all their \"respect\" and \"not all men \" goes in the trash when they threaten you online when you do so. Even though this happens on a daily, Your words give me hope. Thank you", "bhawnasingh26": "Well said❤️", "smita.john": "♥️", "apooooorva": "Thank you.. this exact thing has been said to me too..", "thesarahdoughty": "I'm glad you're speaking up about this continually. It's always needed. Always.", "thesunrayyyy": "No this is what we call \"sarcasm\"🔥", "aakashhaistar": "Just words n words nothing you can do on ground level just trying to be oversmart", "khushi.julka": "Idk how many times i said this before but you are just amazing!", "ayazpalma": "What does that mean?", "deadlyalive0": "Goosebumps.", "sonali7772": "😢😢", "nithin.chakravarthy16": "❤️🙏", "ridhi.ridz": "🔥Your words strike every chord in my heart.", "__mishra_kirti__": "To the point🔥", "__manasvi_": "👏🏻👏🏻👏🏻👏🏻", "arun.chaudhary23": "Please come fast you fake nationalists and shame yourselves. She couldn't have been this honest. Please come and tell how ignorant, insensitive you can get.", "srs_190": "🔥🔥", "mukaann_": "Sobs 😔", "_theblondelife": "It got goosebumps reading this! You carved each and every word so well, how exactly we feel every single day living in this country. It's suffocating. And is increasing by every second now.", "jaanu22": "YES!!!!", "anushkabhoj": "👏🏻👏🏻👏🏻👏🏻👏🏻", "_ayeshx.xx_": "Sobs 😥😥", "stuti_48": "❤️❤️❤️❤️❤️❤️❤️❤️", "shakesaima": "I feel you. This time I felt so tired to even revolt. But we have to. It's heart wrenching and frustrating.", "moxit_.shah": "💯", "dinesh__s44": "NYC post", "kartheeksharmapuli": "Deep !", "thelove22222": "🙌🙌🙌🙌🙌"}