{"natasha.dedhia": "Omg i can keep talking on this! All the restrictions during periods, after marriages women have to change surnames(im not doing it!), they have to wear mangal sutra and sindoor (men don't have anything to wear). In my family, women have to wear bindi, even if they wear western clothes! Women have to make the husbands parents her own (what about the husband making her parents his own? And sorry, i have only 1 set of parents and husbands parents are my in laws!). Women have to balance work and ghar ka kaam (if they lack either there are \"talks\" around). Women have to bear kids (not even getting into the third class mentality of bearing only boys! They want women as mothers, wives and girlfriends but not daughters! So are the future wives going to fall from the sky if nobody wants daughters?). Women have to sit cross legged and men can have legs spread wide apart (sorry men, u look crass doing it in case u don't know that). And the inequality is another story. Men are told they can be anything and women are told to be home makers (look at the toys little girls play with kitchen sets, dolls). if men cook and take care of kids they are praised and women, well that's their job nothing to praise about. I can go on and on! Thankfully women have started speaking up, getting high paying jobs, not settling on sub standard men and keeping their identity and dreams intact. Inspite of all the patriarchy designed to cage women, today women have started to show it the middle finger. Little girls raised by headstrong women are breaking stereotypes and that's very heart warming to see.", "aditijainjindal": "I don't understand the concept of women shifting to man's house and with his family after marriage .", "piyu3123": "It's not traditional or cultural, but the attitude that \"we let her wear jeans, I let her work even after marriage\". Like kya let her? You don't own her for god sake", "rhythmcool3": "Kamasutra", "boy00700": "Wowowowow❤️", "ravin_for_u": "Halala or vo jo kesari movie me jo us orat k saath hua or parde me rehna or bhot si baaten h madam aap kya jano aapto bhot nazo se pali ho un orton se pucho jo struggling karke aage aai h bhot", "sharjot41": "There is no barrier apart from her own head😊", "vaishhh.__": "@redheadwayfarer what we have now is not Feminism it just pseduo-feminism (soo called modern world) what we had during Savitribai Phule times was Feminism. Now we have Feminists like them once we had Feminists like Savitribai Phule. You better get this! No hatred though just a opinion", "eshaanroshan": "Super! 👌🏻", "riddhi.acharya_02": "I hate the stereotypical dictation of modern love stories .. player guy meets a woman who is FINALLY good enough for him .. he screws the relationship... is sorry .. girl takes him back .. I hate it because it popularizes the idea that women r rarely good enough for all of a guys attention .. women r desperate for a \" happily ever after \" and that women r supposed to be accommodating like u will never see the girl say .. \" sry u fucked up .. ur bad get a move on \" the female characters ALWAYS end up adjusting themselves for the guy .", "scorpion_doc2011": "Hello, ma'am.As a dentist, i deal with a lot of men as my patients everyday. The intimidation they feel as seeing a woman on a superior pedestal is evident. I've had fellow 'educated' , 'open minded' , 'cool' friends and co workers (male and female alike...but since we're talking about patriarchy..so yeah) tell me and in general the traits of a 'good woman' ..and casually use words such as 'bazaaru' ...I sometimes dread the kind of sons our mothers are raising.. 'Subtle Misogyny' is so deeply rooted in our consciences that it disgusts me.. And sometimes i wish i wasn't born a woman here.. 'Agle janam mohe bitiya na kijo' sounds brutally apt .. P.s i strongly oppose all of them and get labelled as a 'rebel' ..but to hell with them😊 @redheadwayfarer", "heerva_damani": "1. Women are treated as if they are just born to get married and leave her house 2. Not letting her opt any different or rather a career which has been just made for males 3. A female being a bread winner is incapability of her parents", "prakashrai1078": "😂😂😂😂😂", "mr_sahil_37": "Islam is one of the reason why women's are so backward 🙏", "charmingly10": "I don't like certain representation used in song that literally use our clothes and jewelry to remind us that we are shackled prisoners who only think about men and marriage and that's all we are capable of.", "roma.yogagirl": "Why women who also work (have a career) are expected to come home and cook plus look after babies/ kids while the husband is not expected to do those things?  Why husband’s career is more important than wife’s?  How many women has quit their jobs / leave her city/ country and relocate to a new city/ country for husband v/s how many men do that?  These are some patriarchal practices/ cultural expectations that are few rooted in the Indian society and most people don’t even acknowledge or understand how sexist they are...", "santhiya_ss": "I work for a MNC in USA. Before this I worked for 2 other companies in India. In all these 3 companies, as a new hire I did online/offline training on the how to report harassment. Be it emotional or physical. If we happen to face any sort of harassment, there are some people in the company to which we can report. So far, I haven’t faced anything, so fine. This is the professional part. But in the personal space which involves lot of family members , I have faced ton amount of emotional abuse. To whom do we report ?🙋🏽‍♀️. The training in the corporate companies is for all the people so they know in the future they should not harm anyone. But for fellow people in family, there is no such intelligence about whether they are abusing or not abusing others emotionally. 🙅🏾‍♀️", "queenserqet": "Who r u ?", "sohailfaizi380": "🔥", "that_bohemian_": "My landlord once suddenly came down to our home and asked my mum if she could change. Later, she told that her in laws were coming and that putting on ghoonghat is a part of respect. Which means if I don't keep aanchal on my head in from of my in laws, I am disrespecting them? Well, I later replied by saying that THEN MEN SHOULD ALSO COVER THEIR HEAD AND FACES IF THAT'S THE CASE. RESPECT GOES FROM BOTH THE SIDES. Though both my mum and aunty chose to ignore me. This hit me BAD. What is this non sense? If it is, then it should be for both. @redheadwayfarer. Thanks for asking. I feel light. ❤️", "ms.prim_n_proper": "That women are supposed to fast for the welfare/long life of husband/brother/kids, not supposed to wash their hair on tue/thurs, not supposed to cut their hair/nails on a certain day... Why are women the keeper of everyone? Who is fasting or following mindless rituals for us? Why do we have to prove our womanhood by giving birth soon after marriage? Why is our vagina attached to the honor of the family? Why are we expected to be natural-multitaskers? Why can't i be good at just one thing? As a single mother, every \"adult\" thing i have done has been a fight, right down from a simple thing as getting my name in fee receipt of my child(they used to put the father's name) eventhough i pay with MY hard-earned money! Trying to buy property was a nightmare. Its so fucking exhausting.", "ragini_lakhmani": "The 'kanyadan' is bloody mental. Why should I be given? Women are not a thing to be donated.", "111.vijaykumarjha": "😍😍😍🔥🔥🔥👌👌👌", "shahmeer_xhan": "Love❣️", "kavyacharya": "I was told at the age of 17 that I couldn't aim to work in the media field because it includes working late hours and then how would I manage getting home and doing \"other work\". And it was made clear that this was said because someday \"you'll grow up to be a woman.\" Am I supposed to be afraid of that?", "iamgarima_yadav": "I just want you to capture in my camera.... You are so real so attractive and so temptative❤️❤️❤️❤️❤️❤️❤️ (mere andr SE Mera photographer jaag jagta hai apko Dekh KR)", "arty_tyagi": "The pressure to get married at a certain age• to dress a certain way once you grow up, like I stopped wearing skirts and shorts and even sleeveless tops for sometime• to not travel alone (or without a male companion, but then again he cant be a friend, has to be a family member)• can't go out and get work done in small towns or villages, like when I go to my native village in summer vacay I just stay at home, can't go to our fields or the riverside or the market or just for a stroll• and one thing I hate the most oslp", "ruchesha_thaker": "I feel only women can bring other women out of this misery. Being a mother or an aunt or a mother-in-law or being as any role that we are, we should stop passing these bullshit traditions that doesn't fit as per modern concerns. What happens with us ends with us. No passing it to our daughters or daughter-in-law. Because most of the times its women imposing things on younger women.", "arpitaa28": "Ghunghat pratha...", "_pranali_ajmeraaa_": "That our bodies are never considered perfect.....you are either too fat or too skinny...it's like tumhare boobs bade hone chahiye ya fir itne b bade ache nai lagte...ya thighs patle hone chahiye the blah blah blah...if you are muscular,then you are considered manly or again,fat. You could be the fittest woman in the world and still be called fat...it's like everything you are not,is considered better.", "_ankit_raj_": "You look very unhygienic", "visionary.photographer": "Just stop fighting and arguing for this piece of shit @redheadwayfarer she is earning good and making money out of these posts and her semi nude pics. And you people come here and fight. Just ignore her and her bloody feminism. Yes, everyone respect women and i came from a family of 3 sisters. Women and mothers are greater than god in my view. This is not the way feminism would be. Nipples and ass is not at all feminism. My sisters work hard to make their living but not by just posing semi nude pics and talking all shit. Is this the way our mothers and sisters do? Are they not the perfect example of how a women should be??? Just shut up you @redheadwayfarer", "prava_see": "A very common ones: 1. Not to enter or sit in any prayer during menstruations. 2. A widow mother can’t do the kanyadan of her girl", "dr_nikhar": "Though society is changed a bit in terms of women can work outside..but still working women need to manage after that all the household things and family as well..if anything goes wrong with it..everyone blame her for not fulfilling her responsibilities..", "divyamehtani20": "Expectations of being connected /updating the in -laws more often than the guy doing it for the girls family :)", "_shreya._____": "Women are considered impure beings and therefore they aren't allowed to be priests, in most religion. And I'm so proud that the Tollywood industry has come up with a film, to create a change there. @ritabhari_chakraborty as the actress of 'Brahma janen gopon kommoti'. We need more films like this. @redheadwayfarer i know you would be happy reading this. ❤️", "sandeep.9t2": "Awesome", "pompy_paul": "This thread is precious. ❤️", "rohitkumartiwari287": "Beautiful😍😍", "avirajtale": "Bevdi kuch bhi pehenti hai", "vintage_postcard_": "I am reading a book and there is a line in it \"Our culture teaches women not to exists\" . And i think that is now thing's work. Since the time a girl is born till she turns into a women she does not nurture anything of her own may her individuality or her sexuality which is her human rights. She is tangled among various rituals and asked to live as per them. I question are traditions and cultural barriers for women? It should be for every one as they are human beings and they are part of society. Everything is genderd. It's ridiculous.", "greyscalesam_97": "The expectation of being a free caregiver", "himanshu_narayan_sagar": "❤️", "dudediksha125": "😍", "843rajat": "💗💗🙈", "shablamathur": "The worst part is, the stereotypical thinking is majorly imposed by the woman herself! In most of the households, the saas is seen as making life of the Bahu, as hell! Why??? Does birthing a son gets her the license to misbehave?? Why can't she be just a woman, a mother?? The saas-element need not be defined...it's sad but true... unfortunately, the 'in-LAW' element becomes too dominant in 'mother-in-law' ...the 'mother' factor succumbs to the domestic autocracy !!", "insomanixa": "Body shamming...a plus size women is labeled as unattractive and not sexy #breakingstereotypes", "manan00_": "ohh god 😮how how i mean yar how are you sooo damn beautiful over and out😭😭😭😭😭😭", "amitsurve09": "❤️❤️❤️❤️😍", "sarika0_0": "Society stop us rather than men because they find it easy. An small example to this : we all know that if a girl is molested, the person who has molested the girl is wrong ....still the society questions the girl only.", "_chauhan_priyanshi_": "Ghoonghat. Burkha.", "almikaithub": "I hate the fact that how society has labelled what a good woman is made of. This labelling has pushed us and taken most of our freedom, our choices, our decisions and most importantly our life...", "bhavna_vermaa": "Associating her health with her family's health.", "runalijagetiya": "Sharam or laaj aurat ka gehna hai. 🙄🙄", "_wild__cat__": "You are beautiful 💋", "tooney_zy": "What comes to my mind immediately is this \"Bahu ghar ko saath lekar chale\" I absolutely abhor this, and it's taken way too seriously and if there is some chaos at in-laws home it's because she clearly failed at peace keeping always sacrificing 'bahu' that she was married for!", "amitanshugupta": "Superb stay blessed", "preshi15": "Also the fact that a woman who is not a mother is \"incomplete\" 🙄", "stsfp": "Sex is in human nature. Who invented kamasutra ? ofcourse our Gods. And plus their is a hidden woman in every man. It's just that how blessed you are to understand the feminine energy..", "niharika._.af": "I ve heard people saying that today's girls work and wayyy too independent after marriage that is why they take it for granted and tend to leave the guy instead of settling things amongst them. I completely disagree with it, i believe before women were just not aware enough to be independent enough. People negatively relate these 2 different things and I find it very disturbing.", "varun.vk.1276": "😍😍😍😍😍❤️", "amaya_pankaj": "I think girls should be given time to settle and reach a comfortable position before being coerced into getting married and starting a family. Also, I feel working women still do not get the appreciation they deserve especially for their career. It's only and only the \"perfect wife even though she works\" kind of women who get backhanded compliments for their work! And that too because they still do all that is expected of them.I wish people just give us credit and feel proud for our hard work and achievements at job like they do for men!", "smritii91": "There is a lil song/poetry sort of by Gulzar .. ' kitni girah kholi hain maine ' .. give it a listen. This post + this picture reminded me of that. Listen to it. 🌸", "a.million.stories.in.my.head": "Once in my childhood when I was a kid like 13, 14 years , I was just curious about becoming an air hostess coz I have heard before that they earn a lot of money and travels to a lot of places so I told about this to my family(bde papa) and just asking them how to become an air hostess or unki duties kya kya hoti hain wagarah wagarah so they were be like bura mt manna pr tu itni khoobsurat nhi h jo air hostess bn ske and I was just a 13 ,14 yrs old girl , I was thinking like how can you even dare to say that, I m your child and instead of praising me how can you say that m not beautiful . It hurts seriously . Iske alawa bhi kai baar discrimination hua h meri family me like whether it's day or night (night is not even any option) I have to ask my family for permission and they always be like bahar ghumti raha kr , dosto se clg m mili to thi ab ku ja rhi h milne , ku paise barbad kr rhi h , ghar ka kaam kara , and in case of my brothers (big) they don't need to ask anything from anyone whether it's day or night(night is an option here)", "curly__wanderer": "Y there is always a difference btwn a boy and a girl no matter hm kite v super position p kyu Na chle jaye family and society dono ko chull macha rehta hmare way of living se... larki h kaise jyegi Larki h shdi v Hona h the mt kro wo Mt karo ..Side kapre Mt Pehno even when it comes to choose life partner tbhi family ko bich m ana h...And agr apna passed smne rakh diya and toh beta jaoge kha tm Bach k scene hi ho jna h ghr m....tmko smjh ni h yh wo log but fraud krte h ... tmhara family background dekh k shdi krna chahta h tmse koi pyr ni h usko and stuffs...yr ek bar th mere choice ko dekhooo chance ko prove krne ka ...bina iske how can you say that sbkch...kyu!! kyuki main Larki hn hai na...agr mere jagah Bhai hotaTB the yh sbkch ni bolte ...", "nxvdhxx": "I heard a maid this morning talking to my grandma: she said \"hamare yaha ghungat k bina kisi mard k saamne nahi aate\". I think that's so not cool and disappointing. This is an evidence that shit is still going around. Kyu nahi aana h bhai mard k samne? Kyuki voh gandi nazar se dekhenge!? Then that's there problem right. They need to shut there faces in front of women. Why us?", "miss._.flawsome": "What bigger cultural and traditional barrier there is other than the one that says women are made for birthing kids and to take the family forward, become the housemaker and keep the family one.", "sneha23___": "The fact that women needs to leave her house after marriage. Don't come at me but I hate this! First I would be dependent at my father now my husband. All life of a women is spend by being dependent on someone. Idk what exactly I'm saying but it's just doesn't work for me", "travelshareninspire": "I guess moving out of house, pursuing their career is still a barrier. Being judged for their choices is another thing which stops them following their heart.", "ashima_acharya": "Casual sexism", "anishb07": "\"Sita\" she had to give AGNI PARIKSHA to prove everyone that she is pure after coming back from lanka(if you believe in god and ramayan) which is still followed in many part of the country before marriage. They need to PROVE that she is pure by being virgin and i dont wanna get into what they do to prove it. Disgusting.", "mahashweta96": "Was just looking at a photo of a friend who was interviewing Sara and Kartik for their upcoming movie. While Sara was sitting uncomfortably cross legged in her thigh high skirt, the two men on either sides of her had their legs stretched apart so wide that it'd put any gymnast to shame. It isn't traditional I guess. But these ways of conducting the body is so inherently fed into women that we don't even see it as unnatural.", "charurathore_": "@redheadwayfarer because of those barriers it's tough for me to even think about marriage or having kids. Day by day, the positive side for this is fading away for me. But on the other side my parents won't give me any of those choices. For every opinion of mine, they say ,\" arey bas abhi lag raha hai tujhe aisa jab ye sab karegi na to you will feel good and happy.\" And that's what makes me sick. It is not acceptable.", "zunairaale": "yoru armpit", "_preksha_joshi_": "When why loiter author rightly stated that women should have a purpose to step out of the house and come home after comepletin the work - there is no need for a a stop or loiter. Also how she stated that women must wear sindor and Mangsutar to avoid unwanted attention.", "frills_give_thrills": "The belief that a woman needs a caretaker at every stage of life (in the form of father, brother, husband ..)", "vishalrathore13": "So beautiful😍", "femmeordinaire121": "Still in many households, women wear ethnic. Apparently something they’re supposed to wear. A suit for example, the dupatta is so suffocating and women do all the chores with it. Even sarees. When pjs are clearly their preferred choice and much more comfortable", "s.a.l.o.n.i_09": "Most importantly i feel women are never been given agency to do whatever they want to. Majority of the women have been given no choices for what they want to do, be it in a career, family, marriage, workplace anything. They are bound by norms, cultures and traditions and the pressure of carrying the honour of the family and scoiety to respect and maintain the boundaries that itself shows how patriarchal our society is. Women have never been treated with much respect as that of men and unfortunately have never been privileged enough to actually question all of these issues because many have actually internalized all of these because of socialization and conditioning and even if someone shows dissent they're threatened and also there is a pressure on women to maintain social status \"log kya kahengey/sochengey\". Its like even they don't want to care about society but somehow this thought appears because of socialization. ITS TERRIBLE 😣😪😑@redheadwayfarer", "shrutithakurr": "To not enter in any sacred place like a temple when you're on your periods because according to some vedas you're impure during 'that time of month'.", "geekuc": "A new stereotype has started.. if she s a housewife or stay at home mother, she is a shame", "vedi_vakdi": "Sindoor for married women. Nothing to show the men are married though.", "moumita_pakira": "Wow😍...I think its marriage..early marriage is the most cultural and traditional barriers for womens ..", "anuuuu_23_": "a sterotype that parents let their girls study whatever they want to, but they will be allowed to do the job only if her in-laws or her husband allow her to do the job. because they think that if a girl will start earning by herself then she will not respect her in-laws or listen to then or won't do things according to them, but at the same time they want educated girl for their son to maintain the social status", "ritikapeace": "Cultural and Traditional barriers ki toh baat hi na kro. Bhatere hai. And sirf ldkiyo ke liye hi ni, even for guys! Like a guy who decides to get his ears pierced have to comments such as, \"Jananiyo waale shauk kyu paal raha hai?\" This is just one example. Aise chhatisiyo cheeze day to day basis pr dekhne milengi. Suhaagraat ka concept lelo, mangalsutra ka lelo, aur bhateri cheezein hai. Baaki aapki pic kaafi kuch already darsha rahi hai waise. 🙏🌸", "beenuthakur04": "💖💖💖💖", "handmade_by_archana": "Entangled themselves in jewellery and drapes of clothing to hide themselves,the real selves..the way,they have to behave after their respective husband dies ,the widhwa ki zindagi- in a white saree and a bald head.... the way they they're being sold in the name dowry, the way the are treated in the so called sasural,if her family gave a little less of the ornaments and money and what not! There was not only Draupati who was accused by the Kauravas but also Sita who had to give her test to be said as untouched by the Ravan in front of Ram..these are our culture and tradition..", "justgoaway_pls": "1. Women can't be going out late at night. It's not safe apparently. 2. Women can't assist or join in the family business, that's only for the sons not daughters. 3. Women can't do certain stuff, a good no. Of things when she's on her periods and that sucks. 4. Women have to change their surname and house(go to in-laws) after marriage, why can't men do that????! 5. Women can't wear short clothes or bikinis etc. around the males of the house, just wtf. 6. Women do the fucking chores, it's high time it changes and women need to support other women for it instead of throwing shade, and spreading that fearful environment. 7. Women are supposed to follow and can't lead or be opinionated in so many household and that just sucks to the core. 8. Women are not capable of making financial or business decisions and are considered inferior by some ridiculous men. It just simply sucks. And needs to stop. So badly. 9. Women can dress however the fuck they want or not dress at all. They only owe that d", "ramsha_sha_rey": "\"I'll educate my princess but you see I also have to tie her to someone before her education reminds her to be independent. Because that's how it works, you study then you rot in a blissful marriage.\" Anybody reading this, Please!! being financially dependant is the last thing you'd ever want. Stay strong.", "arushi_purbey_": "A law in our country, which states thay a man can easily give divorce to his wife. If she refuses to stay with her in laws", "bud_wiser09": "Many a times social conditioning overpowers the judgement of right from wrong. Customs are behaviours which used to solve a purpose but when the purpose itself doesn't remain why still follow the custom.", "iwildfloweri": "1 The stereotype that the more decorated/ adorned with jewelry a woman is the better standing a family has. Women aren't trophies for someone's ego. 2 I heard once that a sindoor is red to signify a non-virgin woman, which is why It's supposed to be worn by married women. (Love this btw❤️)", "krissannb\nVerified": "Verified", "jhajagriti98": "Somethings which they say are mandatory for a married woman to wear like bangles , the nose pin and what not.I don't get the concept if someone is not comfortable wearing these things why it becomes an issue .@redheadwayfarer", "_bubblesome_": "A girl dresses according to her choice. Sharam lihaaz uska gehna...haithiyaar, vaar...aur pyaar. Jane kyun dil jaanta hai, tu hai to I'll be alright! Love! 💙", "sam.coo5": "So beautiful 👏👏 sis 👌👏👏", "eff.ulgent": "I think society or we can say woman's create barrier's for herself .we never open about what we are feel .society create own tradition or cultural inappropriate manner everyone face it not only women even mens are . exaggerated or aggressive patriotism. \"women opinion was easily moved to chauvinism and nationalism..its time to talk about everything without hesitation..we have enough power to talk about anything sexism /patriarchy", "_piku___": "Well I do science and currently doing research on experimental Physics. Many of my relatives told me 'Maths and Physics are not for girls', during my childhood days. It hurts.", "prachisethia_": "Jwellery given as present to a bride and then forcing her to wear them to show the public that how much gold she has been given with. Also making note of every person who gives gold and how much gold each one gives. Other than this keeping the ghungat still on , and I also heard that girls are not allowed to sit on sofa when some elder one is sitting there. They have to sit on floor in way of respect.", "zero_tolerance_for_jerks": "Let me start from home - I live in a joint family with a lot of brothers and elders so i cant wear short clothes , i cant wear what i wish to wear coz if i’ll wear short clothes my skin will get revealed and they’ll see me as if i have done a crime . I can’t do night outs ,i cant even stay outside after 8 pm . I am 23 right now and still pursuing my degree but they want me to get married at 25 anyhow ( it doesnt matter if i am well settled or not ) becoz that ‘s the right age for them . I can’t call my male friend at home because they just think every Male friend that i have is my BOYFRIEND . If my relatives are added on any of my social sites than i have to think a million of times before posting a picture ! They want to keep thess boundations because that is what they have done and seen in their families AND IT SUCKS. !!!", "shivanimittal91": "What I don't understand about culture and traditions is why they mostly try to assert dominance over women. Always telling women what to do, while men simply can get away with anything.", "what.moved.our.hearts": "All the traditions and customs when it's 'that time of the month'. Ugh! I mean, we are in the 21st century and girls are still not allowed to enter temples and the kitchen or even touch their mother. I have friends coming to me, telling me how miserable their family makes them feel. We have other issues to think about, damn it - climate change, the fucked up democracy of the nation, poverty, illiteracy and oh God, the list goes on- and here we are not 'allowing' girls to do things because they are on their period.", "khaannmaaaz": "So beautiful:)", "samridhibhasin": "In a broader way, I respect the culture and the traditions. But people don't want to come out of it. They get the tendency to narrow down the things to such a shallow mentality that they lose their will to think.", "atulgupta_13": "Beautiful😍😍", "diksha.012": "In many places Women in periods are not allowed to enter kitchen and religious places. They are considered as impure.", "neha.vaze.13": "Purdah system majorlyand expectation of wearing certain types of clothes. Suit or saree for married. You can wear Jean's in absence of elders for few years etc..", "surdoll": "Beautifull 😊", "arshiathasnim": "The thought of getting a woman married and making her dependant over a guy is still persisting and my parents think that is how they fulfill their farz , what if I want myself to be their beta ?what if I have a husband who can stay in my home with my parents 😑 @redheadwayfarer I feel you are that representative of all the girls like me who cant speak out their opinions as we would probably be called a whore and sent out of my home if I were you", "nancyy_thhakur": "#breakingstereotypes my grandmother used to teach me to not laugh aloud because it is not a sign of a good girl.", "tanisha_bhattacharjee": "On field political journalism, wage gap, definitely wage gap especially in the corporate sector, women have to be rich enough to own a private transport they can't avail public transport like men all throughout the day because, hello you're born with a hymen wall and hey you better preserve it! Women can't post pictures topless even though men can, women are sexualised even when they are breast feeding their kid, women are told to ignore workplace harassment, molestation and the other sexual crimes because if you aren't powerful enough you're attacker can throw acid on you. The women are expected to still touch their uncle's feet at family functions, the very same uncle who molested them and they are not supposed to question tradition. A women is tattoo is instantly lose ( I don't what that word mean anyway but it's a tag to shame women).", "freedompratzz": "Jewelry ofcourse for me..i have always felt suffocated . wearing ornaments and then i read somewhere how jewelry was originated, and that shocked me..so to own a woman or to prove she belongs to him..men started making wear handcuffs and chains made out of grasses ..later changed to flowers and then into metals...no offence to jewels", "roaming_elsewhere": "I hate the fact that women are judged by how they can or can not juggle between work n home. Wether they can or can not keep their homes clean. Whether they are organised or not. However, men only have one responsibility that is to earn n get money home. Why are they not taught to keep their homes clean, why can’t they be judged based on whether they can or not cook. Equality does not mean that women can do anything or everything. It also means that men also need to prove themselves equal when it comes to managing house chores and kids for that matter. I can go on and on but I hope I have made my point clear. 😊", "the_independentbrain": "Beautiful soul!!!", "savage_papaya": "Gorgeous 😍😍😍😍"}