{"resma_mohan": "💖", "vrindakhatore": "🔥🔥🔥🔥🔥", "rajansprasad": "I support u #freethenipple . They are really suffocated due to the whole male kingdom.", "mujhedarupinahai": "Please report this @instagram it comes under nudity!", "deyarunabha": "Why the hypocrisy and the edit mam..? If your definition of being strong is going topless and doing things u wish to,then u should actually do it and be unhypocritical about that... Stop propagating and actually do it...", "veena73singh": "Hate comments se ghanta fark nhi padta kisiko yaha to sb rasta naapo ....sick people ....proud of @salonichopraofficial", "harshh7676": "❤️❤️", "loharkarnirmala": "2", "_shantanugoel_": "Dikha de pura bc ye flowrs b kyu lagaye h tu sochti h yaha india m ye krege tuje dkhke khud to tu bahar marwa rhi h iss chakke se lodi gyan batle ye likh lkh ke chutya", "myk.21": "posing nude with her fuckboi in most of her insta feeds is her definition of feminism? well, no shit.", "natasha.dedhia": "U go girl.. We need every fucking girl to think this way. These so called misogynistic men shouldnt find any partners. It should be about survival of the best men, the assholes should die alone. Only then will toxic men be eradicated from our society. Choose equality!", "parulrishav.dhanda": "So pretty curves u got and nips too 🔥🔥🔥", "mukherjeedibyendu": "Why I find this couple so irritating", "debdootmukherjee": "Yeah. Agreed. Free the nipple. But why are you exposing the guy's nipple when you're covering your own? #HYPOCRITE", "shweta_s9": "As u says it’s feminism and you r comfortable then why r u even hiding your spots.. open it more vibes will come out.. be this or be that don’t stuck in between girl🤨", "tirthankar1982": "If he walks beside you means he is following your path..is not that so? 😂 ...yah yah I got your point I am just kidding...as Sadhguru says Love should set you free..I found you had that wonderful realisation..👏👏👏", "lavish_kavdia": "Almost 90% of girls will take this in the wrong way.", "safreen_qureshi08": "Iss duniya me boobs k or nude hone k alawa b bhot kuch hai ma'am..i commented bcz i m following u since a year and i haven't seen anything else in ur posts except ur boobs n nudity. So it is necessary to give u a wakeupcall. Sorry. @salonichopraofficial", "abd_e_abbas_110_janasheen": "Beautiful lovely couple ... God Bless You Both...", "shraddhabhan_": "You look ao beautiful 😍", "ihatemyselfsoipostmeme": "Thank you", "sidd.muhee": "are ese sadak Pe ghuma kro... 💕 yeah #woohmenempowerment", "kailashadvani5": "@devachawla", "pk66653": "So beautiful😍💓", "aakash.yerkal": "Randi", "louis_varghese123": "😍😍😍", "rajukarnwal": "Apni amma के भी सिकुड़े हुए chucho की pic डाल", "heartslove": "M so happy and feeling so proud that u had written this ...😍😍💝😃", "sukhsamruddhi": "@vaibhow.mp4 give a read.", "i_am_aaryan_mishra": "@ansh007____ Bhai kisi #boy celebrity ne aise fool lgake dick pick daldi to uss bechare ka kya haal krenge ye", "_ashitha.s_": "💯💯💯", "meeragada17": "Absolutely💯💯💯", "yuva_chaudhary_": "Respect for girl 😂😂😂😂", "chut_ka_gurudev": "Is it you or the boy... Yes... I know boyz r boyz... What can we do for this... If you keep showing the same piece of flash you t given... Then why don't we share... Who the fuck is gonna stop any of us to share this in a group... But listen.... Everybody has a choice.... Just like good or bad... If you choose bad that's on him/her... You don't have to say or post anything... I don't support rape... But... Every person have some needs... You have to been through teenage. Don't you... But you can't have this funs at that time.... Daily sex... Daily sleeping with uour husband... But still you need that...its natural... You can't stop it. But... If a locker room can help it... I'll really support it to my fullest... Coz if a locker room can cause a rape, it can also prevent one from happening.... So mam... Don't judge the whole boyz over some rapist", "1997_shreya": "It took me such a long time to let this social construct get out of my head. And I’m so happy to have found someone who loves me for who I am. Initially, since everybody told me it is not normal for your man to not be jealous, I started having doubts about him. People came up to me saying things like : “Oh he doesn’t ask you where you’re going or who you’re with?”, “Oh you guys do not talk daily?”, “He didn’t object you wearing such a short dress! Does he even care?”, “Toh you are saying that he didn’t even ask you why you’re out with a guy he doesn’t know?” // It got to my head sometimes, I started believing that he does not care for me, and I told him this thing , he was understanding enough to explain it to me that “controlling is not love”, I am here to be your partner not to dominate you or control you or irritate you in anyway. SO GLAD YOU POSTED THIS TODAY. ❤️❤️", "ishaangarvin": "Sale ki kya kismat hai tujhe nangi hi ghuma rha hai, or paise bhi tere hi udha rha higa, dhanya ho", "neehakhan9": "What a boobs", "anammansi": "👏", "ghosts_and_roses_": "You're just the best 😭", "mrunal__206": "Caption is awesome.... it's so true...❤️", "benaz_reporter": "This is so beautifully written...a true reflection of our society and also how it ought to be💕❤️", "somesexyusername": "Lavdi", "love_gur5550": "I😂", "rajvirmann008": "Why are u hiding?? It’s not double strands?? Long captions for what??? Being practical is everything.", "creamandcrackle": "Absolutely love every word!!! ❣️❣️TRUTH!", "miradhika28": "Your thoughts are so clear its inspiring for us❤️ thanks", "astaadx5911": "🔥🔥🔥🔥", "raj.729099": "Chu low standard shit lol nowadays wannb lodu hi follow krte h chu ko lol", "oye_mohit": "♥️♥️🔥", "monalisa9067": "😙💙", "mr.durom": "This post is a bunch of bullshit coated in feminist sugar", "maanciieeness": "Please check your dm as I have really something important to share! And also check out @niskanagpal 's story she has something to say tooo! It's about bois locker room! A current issue.", "_shemiiii_": "I am from india . Here we respect women a lot . I aso have a girlfriend. I am a father brother friend and everything to her. If we r in a relationship or if we truly love a girl we will have some control over the girl and likewise she also controls u but not in a negative way. It's the control for the wellness of both the souls. It's true that if love is real it's priceless. And I beleive that if a women truly loves a guy she will only give her soul nd body to that guy and she will surely beleives that iam the girl for that guy who loves me respects me nd taking care of me other than anyone in this world and that's a bliss. If she truly loves u there is no need of controlling and u would be the luckiest person to get a girl like her. In that relation there will be no ego other differences and all. There should be some control over eachother and iam saying that in a good way . If there is no control I don't think it's true love. We care for we love and that's not the negative control. In every relation there should b space for each individual. I value her. I value her soul her body her views her goals everything.she is my mother my friend my soulmate. And she is mine .It's not about control it's about love and I want the best 4 her and she should b the happiest one in this world with me. If I control her in a situation it's for her best and not for showing my male power.I respect her . I respect evrery women . Thank you.", "pablo___fucking_____escobar": "Wow wow wat a right up🔥 best read on instgram ever, damn love this dear, The way you write thing out👌and one more things why to ashmed of nipples? Lets free d nippiles❤️ The fucking patriarchal society deservs you 🖤 love from india kerala🖤🖤", "shanky.loves.yuh": "Ufffffff 😍😘", "mohanpnikhil": "❤️❤️❤️🌼 well said", "prakharprabhat": "My God! 😁", "i__wasnt_born": "❤️", "what.moved.our.hearts": "Yaaasssss ❤️❤️❤️❤️", "iron_made_in_": "❤️", "that_browngirl_19": "Beautifully said ❤️ and more power to you.", "mitali0807": "@priyaet", "kcheshtha_15": "If you really want to be \"comfortable\" with your body exposure, might as well not edit them😂😂😂", "davisthelight": "Somehow this sounds rebellious and not polite. No man ever stopped his wife from being the best version. Infact, I am what I am because of my mom! If my mom wasn't there for me in my upbringing maybe I would have been wasting my life.", "smera_tandon": "@jayativats @upasana_11", "charlesjenissa9": "You have my heart❤️", "minalmehndiratta": "I am venerating you very much as your captions are as lit as you are. Ma'am you are such a beautiful feminist as well💓", "ms_veenal_theluciddreamer_": "There are so many comments, obviously! You may miss reading one! However, here goes! So well said, described and written.💯✨ such a simple yet essential message, Excellently put across! ✨💯", "singh_parnita": "So freaking true-the predominating Patriarcal shitty society😤😤", "anudeepelineni": "@atomburst_ @thesanguine_ @saurabh.sesh @cho_who_ heat", "jazzk9457": "@salonichopraofficial these are the best pics of yours so far you look amazing", "sanghmitramishra": "If this woman had powers to talk to everybody and explain what’s more important for us, not the society. I don’t support nudity or too much of clothing to hide skin either. it's one's individual choice always. But, one should always know maybe the world should know it’s okay to behave the way we want to & live upto our own expectations, not the societies. Like her posts, she ironically writes a lot but just wants to explain one simple thing ’Let each one of us breathe & Do whatever you feel like’", "doctorvan00": "Hi 👋 FOLLOW ME FOR A PERMANENT FOLLOW BACK AND A '❤️' ON SOME OF YOUR PHOTOS", "_adieus._": "@sharanya_maity ki bepar 😉", "ar0undtheglobe": "Hey saloni, I need your help big time. Few boys made a group and passing out photos and talking about raping them, where to meet, when to do it, gangraping them, please please please help us out. I'm crying because I'm scared, they have made another account trying to change their bio, username, few profiles got deleted so they are coming up with new ones and they said next time they will just talk on snap, I'm trying to get this out to police. Please help me out. Please", "priyakoushiki": "@_just_ankitkr_ read the caption❤️", "singhsarequeens": "Go get em Girl❤️", "ujjwal_sinh": "@verma.4 jaan, read status", "janhavi211": "BDiw2😂", "ananth_life_journey": "I truly wish all the girls those support this post to have a chance of being into a beautiful relationship. The long article above is a mixture of things and facts are different when we segregate to each boxes. Nevertheless, to certain extend the post is talks about some facts and which must be changed. Also, though if I tell you this most of you wouldn't understand it. The beauty of a relationship is having limited possessiveness to towards each other.", "foodieee___soul": "caption❤️❤️❤️❤️", "leander_keith_98": "The dishes won't do themselves...😂😂", "shivanidhuriya09": "♥️♥️♥️♥️♥️❤️too much love for this one @salonichopraofficial", "kananpai587": "Beautiful🌸", "digvijaybhandari": "@sakshi1095 Very much resonates with whatever we've conceived of our relationship, isn't it", "minishaaa13": "Such a strong caption, loved it! :)", "rashmi.__.sharma": "You both have my heart❤️", "theofficialayaan": "Agar tumhe sharm nai kuch chupane me to ye kyu hide kara bass ye janna he personal life he kuch b karo its k bass sharam nai he to mat karo warna karo", "raeinlightroaming": "Thanks for sharing! What an amazing post 🤍🖤🤍", "shohinism": "@omitokumar_ read. I'm so lucky to have found you ❤️", "justin_james95": "Nice boobs 😉", "aarshhhh_10": "Ask God to provide periods to men also bcz that's what u actually called equality right? I'm agreed with some of your points but when you are in a relationship your life is also connected to your partner's life , our parents restrict us for many things bcz they love us....there are many things which girls doesn't know and if u love your partner I guess it's ur responsibility of taking care of ur partner . U call it as restrictions or possessiveness I call it as love and care....I am a boy and my girl restrict me for doing many wrong things bcz it's her concern towards me❤️ equality comes under same level , boys and girls are different , there's a domain exist out of which certain things comes under feminism and not equality (bitter but truth) . Its just an opinion I don't give a damn if anyone agrees with it or not. Thanks for your time ❤️❤️have a great day ahead", "darshita.a": "Ur thoughts are amazing 💯", "____annn________": "🔥🔥❤️❤️", "m.b.adil": "Didi aadivasi lg rahi ho... Purana zamana yaad aa gya", "nive_sudha": "👏", "manishapenty": "Love 💕", "yogeshpotaliya": "Same goes the other way around. Women controlling men. No one should control nobody.", "_sandhu_gurjot": "Remove the edits you don't need them as you are not nude because being topless is not nude .We will not jugde you either and support equality.So next you post don't use any editing let it be natural", "shweta_2510": "The caption is more beautiful than the pictures!", "ufshah": "This caption is everything. ❤️", "veerankshaa.vanity": "❤️❤️", "i_am_merliyn": "Well said🔥🔥", "iaadityaahuja": "Dang bro🔥🔥", "arijit_biswas": "I love you guys❤", "arjun_pratap": "❤️", "ashmitadey_": "❤️🔥", "sayantanisaha_": "Honestly Saloni I loved your view but why do few of you influencers feel that womem empowerment is about being able to do what men do... Your point is always that you can be shirtless because men can,be able to get drunk because men can,be able to have several sexual relationships... That's not women empowerment... I haven't seen any of you taking about education... Job opportunities... Similar thought has been portrayed in movies like Veerey di wedding and Web series like Four more shots... Why? Feminism is about equality... It's not that I CAN DO WHAT MEN DO...Nature has decided some different biological roles and duties for men and women and different bodies for men and women... Why do you want to change something we can't control? I feel like some influencers might even question why only females are allowed to carry babies and not men and give it the name of women empowerment... No feminism is equality... It's about equal opportunities... It's about judging the people irrespective of gender.... Yes!! We shouldn't give a damn about others are doing... And definitely shouldn't judge them based on their clothes but there are young vulnerable minds out there who can absorb this wrong portrayal of women empowerment.... And to girls who are supporting us open your minds this is not feminism... And yeah not judging her for going topless or for her clothes but yeah what she is portraying is wrong", "noelmariyamjohn": "Now this is love!❤️🙌🏻", "prakashsoniwal": "na fir", "___silver__shades___": "Sab nange ho jao Men apna ding dong bahr nikl ke and Ladies with tits and arse's fuck Imagine thi situation ab loog bole ge forgien me asa hota hai han toh bc har tym nahi hota hai wha pe bhi yhe porn dekh dekh ke tum loog soachte ho Us England me bss Sab Khula sex hota hai sab nange hote hai ghnta bc Soch bdl lo limitations hoti hai kuch", "__pragya__81": "Sexyyy😍🔥", "d33kshitha": "The best thing I read today!🔥❤️", "vaishaliupadhyayayyy": "💕💕💕💕", "rony_la_legend": "Being equal like a man n everything is good if its in a good way and every human will support that too. But i still wonder what the feminists need to tell about the ladies who sells their nudity for money,in live videos plus body on roads n being on anyones bed in the name of equality... 'If equality goes along with morality then everyone should support it' Else all this will just become some street plays n the ones who supports em will become biased idiots", "that_crazy_little_girl": "😍😍💖💖", "thecinechef": "This is the Idea I always endures. Love and respect 😍 #loveisnotownership", "__devikaaa": "♥️♥️♥️♥️♥️♥️♥️♥️♥️", "nayanzzznayana": "❤️❤️", "dash_elisha": "💯😇", "theknottythreads": "Caption ❤️💯", "raajeshwarin": "thank you so much for inspiring us everyday :')", "viishakha_s": "💘💘💘", "saxena_325": "Yes please..free the nipple😍", "varkak28": "i think @ipoonampandey @sherlynchopra is just copying her and taking all credit of feminism, we should do something about them. they are just following her but not giving credit to saloni", "husnaindr": "why u used filters ??? ? u wana get naked no ! u always blame ista policies , why dnt u post urs nudes at twiter ?? .. lolz coz u can not .. its the answer 😂😂😂 attention seeker", "kural_22": "Stunner💞", "rupsaaaa._": "You Rock ♥️🔥", "pranay.pathak": "If it isn’t nude then what’s the point in editing it out? Picture contradicts the caption.", "sonaalit": "I wish all the women in the world take out time to read and understand your posts because then we will live in a better place . ❤️", "cadetashi2111": "@salonichopraofficial amazing pictures guys😍 @salonichopraofficial you are a amazing person with full of confidence. Keep it up never think about world. Because \"kuch tou log lagenge, logo ka kaam hai kehna\". Love you 😘👍", "ad.e_e.b": "Maa kasam..: itni bakchodi", "shrusti_pol": "❤️❤️❤️", "__taraa____": "Lit🔥🔥", "rider_tripple_s": "Captions🖤", "pranjali.patil10": "Why to ashamed of nipples??? Lets free d nipples🙄", "therjhawarm": "seriously you are the one girl who don't care wtf is going that's y I like you 🥰🥰🥰🥰", "basheeerz": "Beautiful pictures!! Love the edits ♥️♥️♥️", "ipshi13": "@theninja_inpyjamas ♥️", "_kritikashyap_": "🔥🖤", "06_hoonjan": "Loved your caption❤️👏", "datta0111": "This is so beautifully written and well portrayed!! 😍", "harshsingh.27": "If topless is not nude, then why are you hiding you nipples with flowers?", "arshpreetsingh_.7921": "Post nude pics is an inspiration great thought idiots", "fahajeihdjxjabbaj_hajjrjrbcbsm": "The worst is we as women are so conditioned with these things that it takes us experiences to realise such a basic thing.", "_anujaaaa__": "You're wowww❤️❤️❤️ you inspire many🙌🙌", "no1_tantrik.baba.09602314644": "www.internationalastrologergokulchand.com www.blackmagictantriksamrat.in/ www.astroguruvashikaranspecialist.in www.tantrikastrologeruae.com www.tantrikastrologerusa.com www.tantrikastrologercanada.com Astrologer Baba +91-9602314644 ☪☪ famous in all world 🇮🇳 INDIA/🇬🇧 UK/🇺🇸 USA/🇨🇦 CANADA/CALIFORNIA/🇦🇺 AUSTRALIA/ DUBAI/ 🇮🇹 ITALY/ 🇲🇺 MAURITIUS/ 🇸🇬 SINGAPORE/ 🇲🇾 MALAYSIA ETC. contact & whatsaap no.+91-9602314644 फीस_नही_इनाम_लूंगा_वो_भी_काम_होने_के_बाद_ Get instant Result, Love Marriage Problem Solution, Ex Love Back, Family Problem, Divorce. एक फ़ोन आपकी जिंदगी की दिशा और दशा दोनों बदल सकता है पाएं सभी समस्याओं का समाधान, लव मैरिज. CALL NOW +91- 9602314644. #lovespell #husbandwiferelationissue #lovegetback #astrologer #lovespecialist #loveback #loveastrologer #astro #usa #canada #uk #india #america #italy #bahamas #california #ontario #singapor #malaysia #uae #london #kuwait #brampton #dubai #georgia #austria #worldfamousastrologer", "bshsabajna": "Randi sali", "surabhi1794": "True❤️", "vrundapal": "So true🔥🔥🔥💯💯", "harrydiwan95": "Amazing sexiest boobs in world", "namratamistry9": "I’m all here for this caption! 🙌🏼💛", "instantkollywood7": "Damm🔥", "thesexyselenafc": "#freethedcik #freetgepssy #fakefeminism . This women only wants to criticize our culture. If it's her choi", "vanshikadance": "Everytime you write, I get my answers clear!❤️", "mukaann_": "Barcelona : bucket list ☑️", "simran___kukreja": "You're an inspiration to many women around the world . More power to you. 💖💖", "iamprithvisinha": "Tears came to my eyes reading this Saloni, I have always had to gather courage to read your posts, courage to defeat the voices inside me which mostly always defeat me, I just make sure that no one else but I am their only victim and nothing spills from my garbage bag. This post again made me scared before I read a single word of it. Scared because I'm too old to make my body feel nothing and scared because I don't know how to tell my ravaged sexual brain to chill if he likes a woman or a man in all their beauty. I'm still weeping, thinking that how probably I will never be able to love anyone after I have known the reasons of the ravage. Oh, how I want to stay away from any kind of relationship where there is a gender of my orientation involved. I will remember your post because I hate myself too much. And someday probably I will be able to love someone who I would not want to possess, not want to hide and not feel misunderstood. I pray to God that she or he gives us more women like you and more men like your lover. And less like me who can understand their instincts but don't realize that those instincts have also been engineered. I wanted to send you this on your message box but I'm writing it in the open forum because I believe I'm not the only one who fights himself the same way and they should hold on a little more. A new day will definitely come we will stop seeing each other as objects. Tears and more tears. I have never shed them the way I'm doing now. Love and more love for both of you.", "rahul_rathi69": "❤️", "abhishekh1997": "I just love it❣️🤘", "_ashiadhikari_": "Oh gosh! Finally somebody said it.❤️", "pripripri05": "@sharan_hegde", "stutiashokgupta": "Aren’t you an absolute BOSSSSS! ❤️", "avinash9140": "Wow", "dreaminrover": "Love this bit of your caption so so much! So so true!", "eat.and.think": "I guess there was boobsland😂💓💓", "explore_within__": "This is so perfect!", "ruchibhrdwj": "You are so daring yar.... I really admire you.... 💓💓💓💓💓💓love you", "anjana_akash_": "Katayi zehar", "the.last.door.knock": "@vatsalag24", "sarvesh_bhuva": "Love doesn't have boundary. It's flowless. 🤘😘😎👌 Superb definition. ♥️", "hyggelig_girl_28": "Couldn’t agree more!!", "teja_0311": "Just perfect caption 👏🏻", "anuj_4319": "Cute and bold at the same time..❤️", "mesandip": "I don't like feathers", "vineetha_paradkar": "♥️♥️", "khan_ashar6": "❤️", "mdebdutta": "Love your writing as always❤️.. To the point👌.. Only the changes will happen if we love ourselves as we are..", "sandeepmahakal8617": "Lagta hai Ab india me bhi pron Film ban ne wali hai 😡", "aman.chauhan.96558061": "So sexy", "_baruni_": "❤️", "varun4111": "This society doesnt deserves u.", "deewana6699": "#love_Kiss_😍", "the_storyteller_by_arnab": "The post is really on point ... It's inspiring .... I have a point .. may be I am wrong .. please correct me if I am wrong .. here is a scinario ... Firstly we live in a society of monsters. And I can't change that. It's beyond my power. Now the scinario is ... I have no problem what my partner is wearing or what's she saying ... Or what's she doing... But may be someday someone attacks her. ( I have no prob what she wearing .... But the attacker might think that the dress is provoking him) ... Now she is mentally and physically destroyed. It's not only that she is suffering... I am too .. I can fight legally with those bastards ... But how to fight what's inside ... The pain ... Her's and mine ... Don't you think precaution is important when you live in a society of monsters with innocent faces ? Please enlighten me ... I know I am wrong but can't find an answer to this confusion. 😥", "bhavana_sheshadri": "CAPTIONS❤️❤️❤️❤️", "beauty_treasure_l_o_v_e": "🔥", "prettysoulyummy": "🔥❤️", "eshafromadbulb": "Oh your caption is spot-on. I couldn’t agree more.", "_the_lionnesss_2825": "I think is could be urs best enjoying spot ever in life with Ur bae ... Uhhh I want to also go there to enjoying swimming beaches masti and all 😍😍❤️❤️", "vaibhavtyagi__": "@kartikaybesoya", "_shagufta.17_": "Damn.! Caption on point 💯🌸", "cute_dhawni": "I need bf koi single hai kya follow me guys", "_thelostgal_": "🔥", "indranilsengupta09": "@salonichopraofficial faltu post ..noone in India will do.. Barcelona porn city...", "anuritisalgotra": "@golnaz_bozorgzad one more worth reading ❣️ @salonichopraofficial - you are amazing girl,😘❤️", "dewankanta": "Made for each other💞", "pranitart": "Love these photos, love how free & happy you look, love the caption. You’re beautiful & an inspiration ❤️🌼", "nitya_passi": "🌺What a caption🌺", "vaishnavi_sood": "💯. #loveisnotownership Your captions are empowering.", "bohra_bharath": "Only nudity is freedom🙄", "bhumika2710": "@jipal_patel11", "mimi_guchait": "❤️❤️", "mukulkmaurya": "Amen to that.", "amee.noorul": "🔥", "_a_girl_has.no_name__": "❤️❤️🥺", "sagittarian.mind": "❤️❤️", "fuukra": "❤❤", "i_n_d_r_a_n_i": "Completely agree with everything you said here. I have promised myself that I would never choose someone again who dsnt feel proud to see me grow into the woman I want to be and just wants me to be what he/she needs me to be. Beautiful post and beautiful pictures (as always). Much love ❤️", "suryakantchouhan10": "ऐसी क्या जरुरत है हम को चाहे वो लड़के हो या लडकिया इस तरह की फोटो क्लिक कर फिर उसे सोशल मीडिया पर अपलोड करने की।", "manan_dhawan": "Check out 2 lesbians making out @beingakashwalia", "simmiichauhan": "Atta girl !! You inspire people so so so much.", "deepanwitapanda": "@akshaybanaik thank you for being the man❤️🙌", "grandpah_max": "Stfu bitch! Get back in the kitchen!", "utharanjali": "❤️", "animasindur": "☺️😘 Only to say you and Rahul are awesome and I read every word you write and get empowered by every bit. ❤️", "rajugowda.r": "💋💋💋😍😍😍👌👌❤️❤️", "sukrit.see": "@rup.cat.ha", "yvishal8626": "sex with u", "vishalrathore13": "So beautiful osm😍", "neelam.gautam": "🙄", "bhavnakakoti": "💕💕💕", "iambatman.sn": "It's 7:20 am when I saw this post and read most of the comments. Don't ask me why I'm crying early in the morning. A women offering her opinion so boldly infront of the world that doesn't like her. Don't ask me why I'm fucking crying. Half the negative comments being from women!? Brainwashed bechariya. I'm crying for them too. Those invisible men who support this *bullshit culture* and care about equality.. I'm crying for your voices. Because when patriarchy has been normalised. Your voices mean more than mine. I'll go brush now.", "655556az": "I just love the fact you censored the boy's nipple also 😂😂", "8finix": "❤️❤️❤️❤️❤️", "nani_monia": "@bravo_bhatia don't skip do read.", "achhe.vichaar": "❤️❤️", "proplayerrohit_singh": "Nude😍😍😍", "charyadee": "@salonichopraofficial But anything wrong with nude beaches? Infact the Marbella beach of barceloneta is a clothing optional one and infact adjacent to it is a small gay/lesbian nude beach cove #aunaturalé. Interestingly.. everyone minding their business and enjoying the good music, sun and sand. Very cathartic and full of freedom from the trapments of clothes.", "dare_d_wil": "The edits are for the sake of Instagram Rules and regulations....so better not point that edits as a part of hypocrisy!!! and the post is something about loving and being loved by a right person atleast once and it's not about Woman empowerment completely...!", "iakansha": "@shubhamag2103", "_sbhthrzwn_": "The best advice from one woman to another ❤ More power to you 😊", "riya_cardozo_": "Best 1😍 you are the inspiration to many women🙌", "kalpita_19": "@ankz2708", "esheworld": "So true ❤️", "suk_anya": "❤️", "ta_anyaaaa": "@salonichopraofficial it's not always about boys controlling their girlfriends about what to wear and what not. I'm sure the ones who truly love each other understand their situations and culture too. Not every guy who asks his girlfriend to dress up properly, is commanding and controlling. THAT GUY CAN BE BOUNDED WITH SOCIETY TOO. HE KNOWS HOW MEN LOOKS AND OBJECTIFY WOMAN. HE DOES NOT WANT HIS GIRL TO BE LOOKED WITH EVIL EYES. The government here does not allow that. I'm not saying the women should not have any sort of freedom,but I'd request you to please not bluff them with your celebrity freedom applied on all sections of the society. That beach might have that culture to roam around naked and honestly, yes every woman wants to have that kind of freedom atleast once in a lifetime or they wish to have that. But we here in india are not habitual of that culture. You as a celebrity can do anything you want or post anything, your family might be supporting you, you might belong to the upper section of the society. NOT EVERY GIRL CAN. Plus, India is renowned worldwide for it's culture and ethics, if we all here will adapt all sorts of this Barcelona culture, just imagine how that might end up in. I'm a girl coming from a middle class background, what you have your thoughts, I've had all this since I hit my puberty, unfortunately I thought I can live like a girl in Europe or foreign countries in India, Uttar Prdesh, Ghaziabad. Ended up getting harassed and loaded with heavy arguments from society and family. What I feel is it's great to have freedom of choice to what to wear and when. But a girl should know to dress up according to the environment. If I'd wear shorts and mini dresses when visiting my village or lower areas like that, it's obvious I'll be objectified. I cannot expect men their to not to look at me. Whereas when I'm in a function with some high mentality people, I'd wear dresses whatever I want to and my family will accept. It's not always about feminism and equality. There is also something called as ethics, culture and respect which should be alive in every girl.", "_meh._.rooni_": "BEAUTIFUL❤️❤️❤️", "mohitlifering": "You are on the right track to create a revolution by your thoughts keep it up.👍", "ankitkaushal474": "@beingsoniyaaa wanna something like this with you", "rexmaaz": "If you swiped, just wishing that maybe You could get a peek at her breasts somehow! You are at the wrong website and mental state bro! #You’rebeautiful #imafan @salonichopraofficial", "shwe_osha": "This is brilliant!", "thinkofanamel8r": "🙌 I love you. Love reading butthurt men (and unfortunately some women) commenting on your pictures 😂", "riyaa_murao": "❤️❤️❤️❤️❤️❤️ Thankyouuu.", "_alzenaz_": "🔥🔥🔥🔥🔥💕💕💕💕", "loveatravelgram": "So very true!", "bhagirathinagarajan": "😍❤️😍 I really admire men who embrace their feminine energy as much as they embrace a woman's masculine energy. You guysss!!! 😘❤️", "imohdnabeel": "Beautiful and free souls 😍🌻 @salonichopraofficial", "thesugaryfactor": "❤️", "mycurvesgotglitter": "Saloni this is everything, I’m tired of arguing with men that just because your insecure does not mean i dress as per your choice. Thanks for this!", "shushmitakhan26": "😍", "riyadadhwal": "The best thing that I read about relationships till date ❤", "cat__astrophic__": "I really admire you...its really brave of you to be firm with your thoughts in this type of society of ours...", "iamritika_916": "😍", "deepakj5342": "Essay📜 hai kya madam?", "smega_tron": "❤️❤️❤️", "swayam_sahay": "I wish you had the freedom to even remove that flower and feather in your picture, I wish people would have seen you as a beautiful person you’re , rather than thinking that you’re promoting sexuality , it’s the mindset of our society which is needed to be changed . Infact showing nipple was considered a taboo for even men , but now its not. Women are no less than men : )", "abhijeetsinghm": "Topless isnt nude 😂😂😂 why the flowers then ?", "sumaiya_tasfia": "@mimo_mim03 ore coronay dhore na ki obostha dekh,Spain a lockdown uthaya dise?", "imyash555": "@qabeerofficial18", "riya_pushkarna": "Such a beautiful definition of love❤️", "sweeta_heart": "I love the way u speak what u feel..boldest girl i hv ever seen till now👍😊", "vinishamittal": "❤️❤️", "loraine.almeida92": "She literally writes these posts to break stereotypes but still some men and women don’t stop embarrassing themselves by commenting total bullshit 🤣🤣", "_prachi.rawal": "caption ❤️", "heenaparsramani": "Amazing ❤️❤️❤️", "manishgkp02": "Shameless women", "cat__food__sleep_": "🔥😘❤️ Thanks for making me think about what society is putting on us and real meaning of \"Equality\"", "muskan_bhat45": "love you❤️", "mansinayak_2904": "💯", "sameerhani1": "👌👌👌👌", "mdazharuddin5492": "@kamran9664", "arpitanag": "🔥", "beingmemer2020": "🔥🔥🔥🔥", "__humpty_sharma__": "@lakshaychaudharyofficial see this bro😂😂😂", "thatgirlwithabigname": "You both make an adorable pair. Love and blessings to you two❤️", "shubhomoyguha": "🔥🔥🔥❤❤❤❤", "anusreechakraborty98": "Pretttttyyy💕💕💕", "sahil.shrotri": "@apoorvavanjre CAPTION ❤️", "_angry_man_4444": "Followers badaney ki ninja technique....🔥🔥🔥🔥", "jyotikhandelwal898": "Caption💕💕💕💕", "surabhee_kokane": "Couldnt agree more on this! But thank god, I found you @pratham_2112 💖", "talhamasood99": "@hmzaabid._", "pruthamanjrekar": "Beautiful ❤️", "monicaprakashsingh": "I love you 💜 you are an inspiration to everyone 😊 thank you for sending this message across 😍", "khwaish07": "This post has explained all the problems that relationships face which arent catered to or paid heed to. Hats off lady you are an inspiration🙌", "frills_give_thrills": "❤️", "king7iiiiii": "😘😘", "__lekhika_": "Idky but damn woman. Never seen so courageous as y💕", "truptiwaghmare_": "Love❤️", "puja09maity": "Amazing... Ur voice can change life... The world Need more like u.. true definition of feminism...", "aditiswarup": "Wow , just loved the caption!💖💖", "nids_way": "💜💛💜", "newpxt": "Sexy 🔥🔥🔥", "dewanshi_thesstyledrug\nVerified": "Verified", "pubg_mobile_prize_tournament": "Then why u hide your nipple... 🔥🔥🔥🔥", "muskandag.aa": "😘😘", "saumyamalhotra_": "You are awesome🙌🙌🙌", "sai.vamsi.reddy": "So beautiful.......🥀", "woman_who_wanderz": "Absolutely true❤️", "dreamy__models": "Very nice photo))", "malvika_tater": "Best read on Instagram ever ❤️", "eternalache": "Plz follow my page for some heartwarming quotes", "prashant009797": "So u r saying that b(.)(.)bs r not private parts of women.....they can be topless just like men whenever they want @salonichopraofficial", "poo2994": "Rare❤️", "vijits10": "And your articles/captions are a part of cultural revolution that we need! We need this", "aftabsksk": "👌", "shanashahini": "Y did you hide it as i observed you you like to be nude all time anywhere so y did you use these edit hmmm??? Nature has already decided that there is diffrent between boys and girls so we should respect always its not necessary to always compete with boys we both are different and competition always happen with same people or thing. So we are women we all are feeling proud hamesha kam kapde phenker hi freefom ki definition dena zaroori nai.", "manoj_narang09": "👌👍", "ankita_smile": "Best thing I read today 😍", "sahibafahad": "😍🔥", "hymavathyvasudevan": "@jeevanjyothi", "aditi_parashar592": "❤️❤️❤️❤️❤️", "miss.curvy.diva": "How can you always write so amazing... I don't know if I should say this or not but you say exact same words I wanna say... Well, thanks to God I'm blessed with a brilliant man you explained in this... You are simply awesome & I adore your page & your thoughts... Thanks for bringing such positivity into the world 🥰", "bhavnarawal30": "🔥🔥🔥", "daniel.rafat.007": "very good thinking..I like your thought process..but why did u edit the photos? on which logic", "bhaveshgorad7774": "Omg 😮😮😮 topless!!! @salonichopraofficial", "kritisach327": "You Go Girl !! ✨ Amaze pictures and simple words with a strong meaning 🤗", "jix_love": "Lawdi he tu", "itzz_iconic11": "😍😍😍❤️", "j.dikshita__": "❤️❤️", "black_paprika95": "❤️❤️", "tusharkool81997": "Nice boobs", "g.priyatharshini": "@jash.rv", "beelakhan": "@ellegoodman I think you’ll appreciate what she says in this post as much as I did 💞💞", "shrutiiprasad": "You guys!!!", "forevercello": "That's looks like another Saloni speaking with a same tone❤️ Truth behold 🌷", "arushx06": "Yeh fool v nhi lagne chahiye", "jiteshravariya": "✌", "ammy_gajja": "🔥🔥🔥", "sandboom93": "Why nuDe😂😂😂", "_rheasachdeva": "❤️❤️❤️", "ur_love_afrozz": "Very lovely👌❤️", "rytash\nVerified": "Verified", "dz2329": "Too hot and sexy very beautiful🤗🤗🤗👌👌🤩🤩🤩😍😍😘😘❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "an_endlesss": "U can use pornhub there u wil get money for this.. faltu Mai talent kyu waste karhi ho", "vaishnavi_nikam023": "👌👌👌👌", "khajuriasheetal": "Why did you hide the nipple? What's the point of talking about equality if you have to hide your nipples!!!", "write_ramblings": "Women like you give us hope Saloni. ♥️", "claudi.68": "👌 yeep so it is perfect saying be always how u wanted to be no Matter what........ 🥰🥰🥰", "thesameeroberoi": "🔥🔥", "messy_somebody": "@salonichopraofficial it's always so beautiful to see how comfortable you are with your body. 💕", "thetalldarkgal": "The caption ❤️and the last PS note😂 ❤️❤️", "dr.monikatiwari": "Inspired..! 💖💖💖", "_aneexsa_": "❤️", "rooh_8484": "Sansar kaise basaoge", "herlunaa": "You are a fucking legend. A queen. Hail! ❤️", "iron_woman_27": "Wow", "winner208": "This is how she fake feminism.....", "mrunaalj": "I don't know why that feathers edit is so funny 😆", "shahnoor.here": "@lillmissweirdo see the beauty❤️", "hritikibole": "Woww, thanks for saying that🙌", "maan_cii": "💜💜💜", "__adhul_narendran__": "Hoo.. seriously fuck uuu", "krishnamrajudatla369": "Too much of freedom", "sakshi7727": "@aroramahi331 read caption", "ritikaverma94": "@sandeepsharma__ you gotta see the caption, also I love you. 💟", "monika_sharmaa_1": "Watch my story🔥🔥🔥🔥🔥", "_.jess.xo__": "More power to ur courage lady! 🙌🙌😍💋", "matt_murdock11": "One of my favourite pic.. keep posting these pic in the name of feminism ... Thanks", "pooja_gurav_22": "That’s so right.. it’s just on point.. 😍", "savage_papaya": "Such a queen ❤️🔥", "chauhan_kritika_26": "👌👌👌", "sona_3": "This is beautiful. Not just society. Sometimes it’s your close ones, even family and/or friends that sell this narrative. So truly learning to love yourself is such a priority and a journey to be better about filtering all the nonsense that we truly encounter even in our childhoods. ❤️", "sneharamachandran": "On point!! ♥️♥️", "kiraak_fun": "🙄 then what else is a sexual part. I wonder", "peace_in_hell___": "Period. 💯", "hasneetsethi": "Bang on!", "jyotirana777": "Revealing time.... so my first time to this kinda beach was in Greece, santorini on black sand beach. I saw group of ladies, in best of their shape and free boobs. I too dare to go bra free... so I just threw my bra from under my T-shirt. I was feeling free, may be for the first time. It was our honeymoon but I was sitting alone that time as he was having his walk. Now even when I go down for walk inside my society, I go bra less. I still see eyes looking at me and judging. I tell my husband that soon they will name me nipple wali aunt but he is like, no one is watching you. Chill. I got to take some chill. I always feel happy to read you Saloni. You r so beautiful", "abvposiyan": "❤️👌👏", "sonyathakkar": "♥️♥️♥️♥️", "nd_venturist": "Topless is nude..topless is nude. I repeat..topless is nude. You can create your own little bubble and believe in whatever shit you want to believe..but reality does not change. Topless is nude.", "vinay0502_": "You're a rockstar, Lady Salman 👍", "true_e__": "You❤", "ahalya_manivannan": "Damn!! Love this❤️❤️", "mqhzx": "You are so ahead of your own time Saloni in the most amazingly mind liberating way possible. And your caption, as usual- beyond speechless. Literally woah❤️", "karan_verma7": "Your views on 'Free the Nipple'? Also you could post the uncensored picture on twitter if Instagram censorship issues are there. Would love to see the uncensored one😊👍", "rechal.com.au": "ILY THANK YOU FOR DOING WHAT YOU DO", "mehk.kaur": "your captions are love", "dhanashree7554": "❤", "xoxo_beautytips_": "🙌🙌Love you diiii", "shah_nawaz_aly": "Niche se bhi nikal diya kiya😂😂😂", "sa_ja_ni": "Caption❤️❤️❤️", "rachanarg": "That's really overwhelming concept you have shown off to world by your own thoughts and experiences ! ❤️ ❤️ ❤️", "_sahibasadana_": "Yes, that's beautiful. 💜 I'm glad more women today are realising this and choosing beautiful partners. It's equally fulfilling, blooming for both of them. 🌼", "simranlalwaniii": "I love the fact that if Instagram doesn't allow you to show your nipples, you went ahead and hid Rahul's too. Equality.", "zaam001": "🔥🔥🔥🔥", "pranaligopale9": "Bold. Beautiful. Best. ❤️", "misalpav__": "Omg your skin is beautiful 😍❤️❤️❤️❤️", "_suhana_b": "Love you for the way you express", "ambis09": "That's so perfectly quoted, like always👏👏 Can you pls tell us the beach name ?", "voguechurn": "💞💞", "maverick_luck": "❤️❤️❤️❤️", "emspawan": "bdhya h bdhya hai logo ka manoranjan ho rha h but not good for society", "mehak.sachdeva_": "So trueeeeeee🔥🔥", "monster_rod7": "Nangi Rajkumari", "wholesome_goofball": "💛💛💛💛", "kiran.goyal.3745": "@salonichopraofficial love love love this absolutely.❤ It shocks me when in serials, movies and tv series, the female protagonist says that it's the duty of a married woman to put her husband and in-laws before anything and obey them no matter what, that her husband has full control over her body, and that it's honour of a woman to do all the household chores herself. We're women, not slaves and loving someone doesn't make us their 'possession'. 💞", "indian566": "💥💥🔥🔥😘", "thetroublemaker.__": "Words!!!! ❤️🌸💯", "rachita_29": "Love how you beautifully hid his boobs too😛😂", "oindriz": "🔥🔥🔥🔥 societal conditioning can negate any amount of education ... We need to be conscious of our own judgements and correct ourselves when we feel that conditioning creeping in! That's when real change will happen...", "rlk2424": "Are iski bhi kya zarurat thi 🤣", "umamaparadise": "Trueeee❤️❤️❤️", "salonirajput28": "Woman crushhhhh!💥❤️", "radhika_dhingra": "You are such an inspiration ❤️❤️❤️", "sunny_rajputt999": "Please", "_sam_._sung_": "❤❤❤", "amreeta_cho": "@themanfrozenintime_", "meera__b": "@dapper_street17 how I'm tryna be", "sophisticated_brat_jordy": "Pls dnt try this at Mumbai beaches 🔥 btw you are brave 🤘", "paranoid.pandya": "The society with people with orthodox beliefs is dying and soon will be dead this generation is the new society and we've healthier mindsets", "disha.mummum": "I love you.❤️😌", "_s_u_n_n_y_2212": "True love has no boundaries", "meetdiduniya": "🌼", "ar.jun742": "Mam I love that mam, even I want that mam", "the_clumsy_elephant": "You make me think, always ♥️♥️♥️", "shwetakakkar_": "Soo truree 🔥", "vaggu.98": "Words♥️ @salonichopraofficial 🙌🏼", "forlorn_desire": "Social boundaries always control us,,,ur thinking is great,,,in india if I shall talk like this,,,society can't bother me", "akritijaiswal27": "Boom!!! 🙌🙌🙌🙌🙌🙌", "tanishka2001": "Wow, word🔥", "soorvi_shah_": "Oh my Gosh, you never fail to blow my mind off! You are such a liberating women along with an inspiration. You have managed to change my mindset as a girl and develop a better thought process. I can't thank you enough for being yourself! Thank you @salonichopraofficial 💖", "soniashil7": "❤️❤️❤️ so well explained", "its_me_hemlata94": ".", "rshv_g": "Ye toh essay likh dia WOMEN EMPOWERMENT pe😂😂😂", "ruhani_ahmed": "Oh my god! The pictures made me so uncomfortable that I am contemplating on the idea of partnerships and nudity. This is majorly because a part of me believes body ownership has a major role to play in building a relationship, and if a guy doesn't want you dress in a certain way that's because he knows what's good for you or at least that's what he wants you to believe. But after reading the post, I feel if ts actually worth giving that kind of authority to a partner over your body. I mean he is lying all chest bared in a beach, but I can't cause it's too much skin? It's true what you pointed out that we need a person who doesn't regularise your movement, dressing, choice on words, etc. You need a partner, and not a totalitarian. @salonichopraofficial Finally, I can satiate my long time questions because of your post. Thank you, again my cute littel hopper! ❤️", "greenie__mcwoozy": "Very motivating for every women out there !!", "maulipat": "❤️", "dikshasharmaraina": "You are powerful 🔥🔥🔥", "shagunshukla11": "That energy i can feel after i read her each caption ⭐", "soupedinwords": "You're the best 😭😭❤️❤️❤️❤️❤️❤️", "mr.sonosaha": "❤️❤️❤️🙌🙌🙌", "jyotiyadav.fsd": "The written content is just everything any lady wants to talk loud, thanks @salonichopraofficial to be everyone's voice.. Just want to know how do we make this post trending and viral bcz many hesitate to accept this and even talk about unless as you rightly said \"society\" has the maximum in the favour... Keep writing @salonichopraofficial keep inspiring.. ❤️", "132_qp": "🌹🌹", "_sagargautam": "❤️❤️", "desertrain890": "A failed relationship always have millions of excuses", "eddie10cabo": "Upload uncensored pics on tweeter let's #freethenipple", "confiable_sky": "You r the best @salonichopraofficial ❤️caption 🖤", "rachna_mohapatraa": "Best Said🙌❤️", "vartika_1995": "❤️", "virat_kohli_fan_c_l_u_b_": "\"Topless isn't nude\". Then why hide them with edits cause if someone reports it for nudity then the post will be taken down for nudity. Love your content btw.", "coolrajiv000": "Wow hats off you wat a beautiful thinking u have❤️", "crystalsinghya": "♥️♥️♥️", "proy6247": "🔥🔥🔥🔥", "tejaswinidivyanaik": "The way you write things out, just makes me feel so much confident about my own self, and makes me believe in this harder that I’m not alone in this. Also the body positivity that you spread through every post is love absolute love and makes me feel so much more confident about my own body", "nilofar_hossain": "@shantanu_routh be like this for Hridini.❤️", "arjun_reddy777777": "Nanga naach.. Chutiye log @salonichopraofficial", "thenerdynomad_": "❤️❤️❤️", "that_white_raven": "and to conclude it all, that is the true meaning of the word 'partnership in life'", "nishant_7x": "😍", "swatiiwalia": "So on point👌", "msvincykoshy": "@salonichopraofficial you've explained a major problem that is predominant in our society in such simple words. Kudos to you girl ❤️ Keep writing, inspiring and posting fabulous pictures 🔥", "mr.kaushik_pithadiya": "👍👍", "purpalnoiz": "@salonichopraofficial Well said! We, women always been living and breathing for others, right from parents, to home folks to husband ..etc etc and yes, only WE can bring the change.", "12gargii12": "So fucking beautifully written so damn true 🔥🔥👏🏻👏🏻👏🏻👏🏻", "chelna_daga": "This is something which was in my mind since such a long time But i was not able to write it down into words But you did it so so well💕 we all love you❤️", "_ag8st_": "Seriously you two beautiful individuals make an amazing couple. I adore you guys❤️.", "devikabagaria1996": "Beautifully written💞", "prithvi_famouscrew": "Such vibes 🌸", "maanvigagroo\nVerified": "Verified", "imadhurarajendra": "One of the best reads in a long time!", "shivakmathur": "🔥", "tanyauppal243": "Soooooooooooo cute❤️❤️", "mizu__bty": "I wanna take pictures like these with my boyfriend 😍😍😍 and those edits are lovely ❤️", "khushbupanchall": "I frickin love you♥️ @salonichopraofficial", "vinoth128995": "Why not wear dresses", "unnatsingh1012": "@baniksuvam", "kasim.shaikh.313": "Bohot Daring wali ladki ho yaar tum...matlab ekdum khatarnak....💪💪💪💪💪💪💪💪💪💪💪💪💪ek dum ANGAAR🔥🔥🔥🔥🔥🔥🔥🔥", "koyel.r_": "when loyalty comes with diminishing of oneself it's not loyalty it's subjugation is what I've learned from my past relationship @salonichopraofficial", "oktataseeunotagain": "Itni problem h nhi society me jitni ap dikha deti ho", "varini.kalwani": "Dayummm you inspire me 😍❤️", "skimran163": "What", "prantik57": "😳😳😳😳😳😳😳😳", "sakshimehra12": "@bhumika_kohli_ @anushkaaparashar @ashisood133 @saumyamittal18 @divyagirdhar31 @drishtimirchandanimua @sakshigidwani @kritika_199760 SO FUCKING CUTE❤️", "shrivastavadeeksha99": "I need to copy your caption. That's so right", "vashyajyoti": "Maut ka nanga naach🤣😂", "aayushi_p_01": "🔥", "beloved_awkwardnesses": "Watching this post coming out at a time when perhaps one needed it for (perhaps) better living or self love, I feel beautiful and inspired. ❤️", "_pallabi_saikia_": "❤️🙌", "shivangeeyadav": "Keep rocking u are amazing 😍😍😍❤️❤️❤️❤️❤️", "surinas": "Omg so jealous! I want to go", "_roy.24_": "🌻🙌🌻🙌🌻🙌🌻", "niklil80": "Kapdo ki kya jarurt fhir nudely ghumo😂😂", "_nalini_singh__": "More power to you girl!! ❤️", "ifeanyioliver86": "🔥🔥🔥🔥🔥🔥", "__divyaupadhyay": "Caption🔥", "afshaanamir99": "Now you are talking", "___anii._____": "This is so good...I love you so much ❤️. Never fail to inspire me 😭", "kritika_kitty_sharma": "@salonichopraofficial I relate and strongly believe on each word you've written❤️ it's like I always had this feeling 💯", "_rajniiiiiiii_": "You're and inspiration to each an every women & men 🔥🔥", "theyinfromtheyang": "Just absolutely love you guys!!! ❤️", "panja_subhankar": "🙌🙌", "9654manish": "😢😢😢😢😢😢😢", "unconventional_millennial": "Wow! Positivity around their own body is something women struggle with even today.. including me.. Women like you are such an inspiration, @salonichopraofficial.. thank you! 🥰 Absolutely love these pics😍", "cvbaybee": "🙌🙌🙌", "okacupcoffee": "Totally 🙌", "hawaslaundaa.hot": "Itna dhakne se nhi changa😭", "meghanagvr": "It's so important what you are doing saloni. Thanks💖", "aakriti_dhawan1234": "@rahulb90 is such a dish! 🔥", "dio_l_o_v_e_r_s_a_n_t_o": "Galpuch ball", "bini.pb": "💯🔥", "nishant7434": "If top less in not nude , why u hide it", "mr_nyctophyllic_10": "@isagaroy", "thetatatop\nVerified": "Verified", "minumarkia_new": "U inspire us in many ways....love reading your post😍", "spalzes_the_travelmonger": "Such powerful words 🔥I agree to you totally super woman 😍 love your sassines 🙌", "yet_another_speck": "Love you both and what you stand for! 😘😘", "tina_sharma29": "Goals🥺 @bhupi_21", "_misariii": "Thank you for hiding his nipples as well!!! Such small detail but on the way of equality! You are always an inspiration", "_shahrukh_kachhawa_": "🔥🔥", "ano_o3398": "You are my ‘spirit human’ (if there exists something like that 😁) ❤️❤️❤️", "s_h_a_r_a_t_h_._k_u_m_a_r": "😍😘😘😘", "hafzaaaa_": "👏👏", "shaiketdeb": "Super cute expressions", "goelambika_official": "❤️❤️", "n_rajeev_singh": "Bhartiya nari with modern era", "vasundhara_naidu": "You're the inspiration , glad I'm living in a society where women is able to voice out 💯 PROUD FAN GIRL MOMENT , iloveyou di❤️", "fitterniti": "I've been signing this song since forever. What's sad is a lot of the women I know actually buy into the old school patriarchal toxic line of thought. And it's so damn subtle you don't even notice it if you're not actively looking for it. Educate, set free and challenge the belief system that we allowed to grow into something commonplace. True equality will never be achieved by one side fighting for it - it's something \"we\" reach together. Everyone's accountable", "laila.jan.99": "🔥🔥🙌", "ridhima_tripathi": "You n your captain always rock 💙🔥", "karan6066": "💯", "aditikhade12": "Caption is ❣️💕", "manjushasidar": "♥️♥️♥️♥️", "_divya_jami_": "Why are you so fucking awesome😍♥️♥️", "ornamentalie": "♥️🥂👍🏻", "anmolgupta23": "Your words touch every single emotion 😍 A righteous woman you are , so is your other half ♥️", "priyasingh11_": "The way you describs the things.... Kudos to you girl @salonichopraofficial", "pankhuri_malhotra": "@salonichopraofficial You are my biggest inspiration. I love you so fucking much ❤", "sayyad_aisha": "@salonichopraofficial👏", "meenamakeover": "🔥🔥🔥🔥🔥🔥🔥", "sanobarsiddiqui_777": "❤️❤️❤️❤️❤️❤️", "enricogaze": "🦋", "sourabh_jain3048": "this might make you really uncomfortable ...in this paragraph you said his jealousy and control over your desire to dress the way you want is not his love for you that's ownership...you used a word desire suppose you have desire to do threesome with him and his best friend or he has a desire to do threesome with you and your best friend..would you agree to this..? its your choice obviously to ans. it but if one of them decline to do so.. does that mean he/she don't love you? btw it is doubt not a question pls Don't take me wrong.. i am 19 yo teen just clearing that garbage which has been stucked in my head for years of year..btw i know you from your mtv show girls on top and love your character in that..", "chetnaganjoo": "Well said!!", "umadixitprivateaccount": "LOVE THIS💯", "sushantgond": "😂", "the_mountain_wolf_": "Your photos contradict your long caption 🌷", "_dhruvi_28": "The caption❤️", "prishagellaboina": "Barcelona has the right idea #freethenipple", "prabhava.n": "U r amazing and fearless.. inspiration ❤️❤️", "samaay9": "Curious case!😜", "virajpolekar99": "Luv the caption 😍🔥🤙🏻 but feel jealous. You deserve better 😂🤣", "dah_bomb87": "didi beach pe nange ghum kar ayih ho yaha par kiyu dhak rahi ho😂", "manjunathyalavigi": "Then y u edited like this, post those pics as how they taken", "mitalnishta": "Love how Rahul’s nips get filters too and not just urs #NipEquality 😂", "abhishekprasadofficial": "😍😍😍", "seeming_v7": "@reshmi_30 READ. I'm amazed at how beautifully she quotes things. Definitely leaving a lot of them uncomfortable😋🔥", "hikabieber": "Uff 😍❤️", "_aaarohi": "♥️♥️♥️♥️♥️", "juhi_hi_hi": "@sensual_swoon for the beach. Baki sab apne ko pata hai.", "_ashik786": "🔝🔝🔝", "charmingly10": "Btw I love the pictures. And your caption. You speaking for fairness in relationship with that love is amazing ❤️", "adiba142naaz": "I follow both your accounts.. and at first I wasn’t aware of who you are, I kinda still not but I follow you coz I love what you write, each and every word is beautiful.... I wish I could find this much courage atleast in this life. Wish me luck", "ashishbaijal": "Some of the most prominent main stream authors can learn how to articulate from you ...Brilliant writing ...Outstanding content", "eshwarya_": "💜💜💜💜💜💜💜 LOVE THIS", "gupta.souhard": "hahahaha...apni body se pyaar karna acchi baat h..modernity b acchi baat h...koi kuch b pehne is se b humko matlab nhi hona chahiye..its freedom toh ye feathers b kyun lgaye h bhai...edit hi kyun kiya...isme sharam aa rahi thi kya...aur ye jo girls way to go girl...u inspired me..unse bus ye poochna tha...tum khud kyun nhi karti inspire ye sab kar k...actually fact is dis ki nhi kar payengi..kyun ghar wale suja denge maar maar k...toh isja matlab gharwale narrow minded...insta pe teenager k b profiles h..wo b dekhte h...tob b eo b narrow minded...kal hum sab nange ghume...aur koi bole beta kuch pehan lo...toh ye bolengi..u dumbo naroow minded..change ur perception nd mentality...wahhh...iska bhai isko aise sekh pata h ki nhi..i don't knw...but ye jin girls ki inspiration h aur isko w8men empowerment ka tag de di h..unke bhai unko aise dekh payenge ya nhi...wo sochne wali baat h..aur agar haan toh phir bolne ko kuch bachta nhi..abhi i knw reply m mujhe bht sara feminism aur patriachchy related gyaan ayyega girls se...i know...but jo main kehna chah rha wo zara soch k dekhna..phir reply karna...girls ko kuch b pehanne ki azaadi honi chahiye..i support this thing at every level...aao beach pe nange ghumo wo b chalega but phir pics b daalo aur phir edit b karo...chupao b kyun bhai...jab yahi women emppwerment h..body deshame h..toh khul k karo na...darna kya h..", "shreyuguptaa": "Toh Bina edit ke photos upload karo. What’s the hypocrisy. Contradicting your self @salonichopraofficial", "ak_mathur_sharma": "Amazing how you put out these thoughts and hit the stereotypes at the point 😍😍 just love♥️", "bushramnm": "Love the caption 🙌 raised in a patriarchal society within the confines of my religion I can relate to this. Was told by all \"Char log dekhingey, toh kya bolingey\" ruled my life. It's a battle within to decide to choose and have the courage to choose a life that you😍 can call your own and share with a partner that sees you for who you are, not what you are.", "chandu.succour": "👍", "maratha_96": "Erotic", "_m_u_s_s_u": "You're an inspiration to soo many people out there💯", "megharparmar": "@rishab23 I love you and the person you are. So glad that our paths crossed 🤞", "unicornsandglitterpoop": "I love the caption❤️", "ravishingtwinkle": "❤️❤️❤️❤️❤️❤️", "the_blush_girl": "Such a inspiration ❤️❤️", "blondeyed_and_badass": "Well said love! I always love your posts and the freedom you express. It’s empowering and really amazing to watch and learn from. Oh and I will be buying a hula hoop because of your inspiring post about it:) thank you for being openly you!", "saubhagya_shukla_": "Your caption , that is amazing.❤️", "_thatsomeone__": "Boht sahi!!! bss yehi dekhna reh gaya tha 🙄...... Jo bhi h your choice didi 😑", "nancymathew_": "Loveeeeeeeeeeee!", "shweta1746": "💓💓💓💓", "sana.dhamija": "@anammansi read", "kyabtayee": "Love the pictures ❤️", "viviandsouza46": "❤️", "y0ninj4": "🔥🔥🔥", "madhu.das97": "Inspirational💕💕💕", "har_i.s.h": "My favv couple😍❤️", "minakshithakkar_": "♥️", "_vaibhavi_1": "❤️❤️", "kanishk14": "Shots 🔥🔥❤️", "rollcameraaaaction": "@leo_harsh Caption", "travel.chotu": "❤️", "mahima_agarwal19": "❤️", "prisshaa_shah": "🔥😍😍❤️", "tiyasha__das": "Love this edits. Even the way you potrait the whole real thing.", "rabenext": "🖕🏾🖕🏾🖕🏾🖕🏾", "fit_delphi": "Such small.... Sunglasses", "khushiansari17": "Just the right words to describe what i always wanted to say! Thanks ❤️", "tyagizclicks_2": "Where are those bengali feminists with long paragraphs🤔", "avinashbhavri": "Impecabble as always to pen such thoughts @salonichopraofficial It's such joy when one truly meets one who could resonate with such an awakened bond. It is only then that hurdles such as ego, possessiveness and patriarchy etc could be easily overcome. 🤗💜", "ishwor1987": "I have female friends in India (Pune and Mumbai). I get so angry and find it disgusting knowing the mindset of their boy friends and ex. Their men are well educated and work in some MNCs. Some of them want their girls to stop meeting their male friends, change their religion to get married, stop eating meat , change their clothes and cover themselves, work full time and also take care of their in laws. I feel so sorry for many women in my office who have stopped living for themselves.", "pathrinagasai": "Oh my god", "superheat00": "After fucked I'm virgin 😂😂", "s_a_w_r_a_v": "lucky she is😍😍", "canva_models": "😍😍", "ardra_nair05": "Wowww 🔥🔥😍😍", "not_ur_princess_._": "Oops", "jyotiirawat_9": "More power to you...❤️", "vrxndxx": "🙌🙌🙌🙌🙌🙌agreeeeeed", "mommy_nd_boys": "You are everything that we are taught not to be. And I love you admire you for that. You are not bold or defying social norms you are just you and you are privileged to have this nurturing environment in your home. Clearly you are brought up by a strong woman @salonichopraofficial", "a.bhardwaj7": "Oye hoye @rahulb90 👀♥️", "_malvika.singhal_": "😏", "soniya_guha_": "I love you mam and I love your confidence❤️🔥 u are my inspiration always and forever❤️", "settle_subtle7": "The caption 🔥🔥", "itsme_nirajmishra": "Ufff💋💋😍❤️🔥🔥👄", "_nushkaaaaaaaaaa": "I love how you've covered Rahul's nipples as well. Oof, what a slap on patriarchy's face. You're an inspiration saloni, and I love what you write.😍❤", "freaky_foodie_yatri": "❤️❤️❤️ Always love your way of thinking and try to learn and enculcate all the goodness from it.", "bondbat": "@salonichopraofficial Is this Barcelonaeta/Bogatell? My DP's from there too. Great place to chill at. 🌞", "hyacinthzia": "Reading this post made my day! Thank you Saloni for believing in women.🙏", "tgzoku": "😍❤👌", "tahsin.anika.3": "“Love will set you free” ❤️", "its_sangeetasharma": "❤️❤️❤️❤️", "thomey_raja": "U must b spoilt child ....", "sood_19_": "🙌🙌🙌🙌🙌🙌 ❤️❤️❤️❤️👏👏👏👏👏👏", "girlllwithwisdom": "Love this 😊 you're so amazing and free-spirited and inspiring and what not.. ❤️", "shrobanarakshit": "I just love you. Inspiring a lot of women even men whom I know. You are confident , beautiful and badass. I love you tons 💕😍😙", "vipashaattri": "Such a pretty caption ❤️", "sharma.priyadarshini": "😍🔥❤️", "m_s_758": "Cuties❤️", "clickmadness": "Hahaha you covered his also with flowers. Well played🙌🏻", "samriddhi_shreyas": "❤️❤️❤️", "favouritetime31": "saloni you raise that points so well.well a world where notions and boundaries are no longer desired. love it ❤️❤️", "mayank.shekhar.9275": "If you think that by becoming topless & showing assets, you can bring equality among male & female then keep revealing your two Anmol assets", "smrutiimenon": "❤️❤️❤️❤️", "pea.gee": "Loveee love every word in this caption !!!♥️♥️♥️", "mayeda.chikan": "Love it , absolutely❤️", "sahaya_lalwani": "This hit me so hard.. Thank you for posting this ❤️", "nehads88": "👏", "imeghnamehta": "@umang1410", "abhinavverma51": "Lucky bastard", "_mahima.verma_": "❤️❤️❤️❤️❤️❤️", "prateek201289": "🔥🔥 Gorgeous", "vishra_shah": "If only my safe haven was me!!!", "siddharth_peepra": "Perfect😘😍🔥", "kavy_bhalla": "U give so powerful positive vibes.....❤️✨", "deeks_._": "Worth reading💯", "abhiii135": "Ok.. but @salonichopraofficial if u r comfortable, u can share uncensored pics on Twitter (Allows All types of uncensored).. and jab bhi @instagram allow kar de to yaha share kar dena... and apka to acc bhi hai twitter par.. to isme problem kya hai??", "shopperstop_12": "U guys are awesome 😍💞💞😍😍", "pratyusha__alapbyam": "♥️♥️♥️♥️♥️♥️♥️♥️♥️", "__thewaay__": "This is so inspiring and so brave. Damn.❤️ @salonichopraofficial", "maisha_nuzhat": "@nasibahassan", "aditi_pandey": "hey saloni!❤️...i love you alott😘....i belong to a conservative family where i am not allowed to make a boyfriend...but now i am in love with a guy i met 1 year ago and we are in a relationship and we know it's gonna be foverever....i don't know how to tell my parents about this and how they will react.i am 19 year old and i know this is serious...i am so tensed😭😭", "vaishnavi__rajput__": "❤️❤️", "ygarima2010": "@antima_choudhary 🙌", "kb_design_studio": "@kb_design_studio 👏", "shvetz_me": "Hey get a room. Duh 🙄😜", "shwetagaba": "Dude I love you for what you are 😘 you inspire me in many ways ... your captions are always on point #loveyou", "kiran_arora2": "I literally love whatever you write🌹. Just wishing for this kind of mindset in our society asap- this men dominative society nd double standards of ppl. ❤️", "poojasolankii_": "💜", "wackadoodle_22": "Hats off to your power.", "saidur_rahmn": "Did u work in MTV???", "iam_anglin": "❤️", "zhafriz1": "♥️", "tamarapallisaiteja": "Where is this place??", "palakbhatnagar_": "You’re truly an inspiration to soo many women around the world, more power to you, keep inspiring ❤️❤️", "sarahsaroshh": "❤️❤️❤️❤️", "samidhaagrawal": "It's so true!! And they make it worse by saying that you cannot live your life without doing household chores and that is what is the job of a female and never try to understand that we want to live and grow in our lives and bring change. You're really an inspiration ma'am.. @salonichopraofficial", "_mandakinisingh_": "🔥", "alaisha_chaudhari": "❤️", "jhanviiiiii": "You guys are the best couple 😭❤️", "khushikalraxx": "♥️", "nikk.itaa_": "❤️❤️❤️", "naishasinghvi": "@yashasvnagda", "manasi_bhanushali": "\"you're not supposed to marry your fathers\" that just... Whew I don't have any words. Thank you I need this @salonichopraofficial", "quoyina": "❤️", "eldee_pc": "@pchalise_ld Mero Badar🖤 #Grateful😘", "samiksha_2707": "Caption💯♥️", "azzu617": "Sexy", "muskanrajwansh": "Your captions always out of ordinary 🔥 you both 🔥 ❣️❤️ #FAV", "shivangimishra_": "❤️❤️", "ipujamoonbhowmik": "True topless isn’t nude❤️", "trip_ortreat": "Disclaimer : These guys don’t exist! At some point I suppose “adjusting” is as close to having a fairy tale 🤷‍♀️", "artandanthem": "Everything you said in this caption @salonichopraofficial. Everything. 🧡", "garrulous.gal": "I've struggling with explaining the same to people! And I fail so often to convey something so simple.", "nivedidutta": "You guys😭❤️", "achukrishna": "Big slap to patriarchal society😀", "hey_its_neha_negi": "You guys are the cutest😍😍❤️❤️", "sleeping_sid": "@mr.obama___ Aitu beach jabo lagbo Aitu beach nro", "twinkle_dilwaliya": "I'm so in love ❤️", "raj8718": "Your captions 👌👌👌", "joeytribbiani.jr": "Love all the pictures 😍", "rriya_kapoor": "U r just perfect ❤️😍🙈😍🙈", "richa__the__wanderer": "🍑🍑", "irfanshaikh78292": "Niche kuch to pahna thana ? Bad me se pata lage udher sand chali gayi 😁😁", "lama_younthan": "You are amazing like literally amazing i wish someday I’ll be able to have confidence like you ❤️❤️❤️❤️😍😍😍😍😍😍😍😍😍😍😍😍i think you are the strongest women on earth 💯💯💯💯💯", "vaishnaviiaroraa": "I just realised a lot of things reading the caption!", "rj_purnendu": "শাক দিয়ে কি আর মাছ ঢাকা যায় গো?😥 যায়না", "rajputketankelgandre": "FUCK😮🔥", "thatmolekid": "❤❤", "adu.venterous": "The caption 🔥💯", "_damini.s_": "🔥🔥🔥❤️❤️❤️❤️", "shalinivig": "Nailed it. The hypocrisy of the so called society we live in.", "mishv22": "😍", "saltybuttercup": "Always on point👍🏻", "roons_k": "@bipasha6 I want to go to a nude beach asap.", "noborders.one": "💕", "ramy_mark102": "Hope to see uncensored pics", "pathak.adyaaa": "So much love transpired in these shots! Beautiful captures I say.", "devkashyap909": "Are you not wearing anything upside?", "hrmn_07_": "@salonichopraofficial I applaud you ✨ - for creating Magic - for recreating it - and believing it", "girysaklani": "❤️", "sailorsserpiltravel": "Seemly🤩", "yogesh_onmove": "Awesome", "singh_ravi00": "Nice saloni mam 😍😍😍😍😍", "sneha.pandey23": "U ll look perfect together 😍", "sarvanichowdhury": "♥️ every bit of the post. The part that talks of society being uncomfortable with empowered women is present in every field on earth. Love the post. Thanks for this reminder.", "imazorahai": "@lakshaychaudharyofficial Pheminist af😂", "rakshika_aphale": "💙💙💙💙💙", "preetbalofficial\nVerified": "Verified", "vishi_x": "You guys are goals❤️💯🙌🏻 @salonichopraofficial @rahulb90 💕", "nidhi.bhardwaj.13": "I wish to get a boyfriend like you so real lovable", "8_w_i_n____________________": "🔥👌", "leo_deepika87": "It took me a long while to realise that. Thankyou for writing this. It reminded me of how far I've come. 🤗", "manishakoranga17": "I love you💕", "swteighteen_": "This is wooowwwwww ,I didn't read the caption but the picture is just WOOWWWW", "_.young._.pyscho._": "Perfect couple❤️ n the cutest pictures❤️", "sushmita_roy25": "@udoyzzzz ❤️", "_mydecordrama_": "Love ❤️", "manasirsy": "😱😱😱", "arzzzooontwilight": "I love this couple 💜💜", "ruchita_jain5": "Guys DM me for fun 🔥🔥🔥🔥", "s_jha_28": "I like how you're comfortable with your body❤️ way to go girl🔥♥️", "_imraah": "❤️", "nadar_divya": "❤️❤️", "____s.h.r.u.t.i____": "🔥🔥🔥🔥❤️", "the_bomb_bae_lass": "The real inspiration when I feel down❤️", "sabahat.f103": "The society loves u 😂😂", "whiskywali": "It’s not just daughter-in-laws. Even daughters are expected to behave in a certain way. And more often than not, all that education is simply lost... sigh...", "shenalross": "Omg i need to copy this, you’re so right 👏", "amit_kumar_sam": "❤️", "unbothereddevu": "👏👏🔥", "zainab.qureshi_": "Your captions are just ON POINT. 😍", "im_the_potatoqueen": "❤️❤️❤️❤️❤️", "alinakhanal_": "❤️❤️❤️", "snehu_28_": "💯💫", "rosh93": "Love these edits and picsssss and so jealous I havnt been to a nude beach yet 😭"}