{"shivanshprakashpal97": "sexy", "artofmemeing": "Feminism or attention seeking?", "the.angad.panesar": "You have listed what freedom is for you. Why not share a post and list what the country's people, government and the society should do to head towards achieveing that freedom that every female in our country deaerves. Listing what freedom is for you on the internet is only going to get you likes & followers, nothing else.", "falak.suleman.18": "I never understand why all feminist like u r wearing exposing clothes and showing your boobs?? What YOU want to show ?? Is this the freedom for u?? So let me remind u that babyy plzzz dont show your naked body to get attention snd if u r a real feminist then go and fight for the rights of girls and women! Here on instagram you r doing nothing but gaining publicity and thats what you want!! You have just change the meaning of feminism according to yourself! Wearing short clothes, partying and drinking alcohol doesnt support the “#feminism”!", "abhishek_legha": "Lazza auratoon ka sbse bdda gehna hoti h... Ye baat humne nhi... Bdde mahan puruso ne kahi h.... 🙏🙏", "wildcat_sarika": "What u trying to show ur boobs? R u serious????? U dont have nice boobs btw", "priya_donta": "fact that no one can actually find out how big this universe is! And how many freaking galaxies are present!! At the present day at this moment not the biggest scientist can do that! Maybe in the future but not now!! And exactly the same way, I can’t have my freedom! Surely not at the moment but in the future i may! Par the fact that i am actually looking forward to the future to actually achieve the damn freedom itself is disgusting and depressing i need and want it now..! I don’t know how. The fact that i used the word “achieve” for freedom itself says a lot about me", "nikesh_shah_19": "@redheadwayfarer baby I want to drink your thick and hot milk and take you as hard as possible", "yamana786": "Inka msla kya hai akhir kya matlb hai dunia nangi hu jaye kya..ksam se kehna nhi chahte par aapke pics do teen hi dekh kar ghun aari hai", "believe_me1345": "Tu teri sakal aur teri tatti faminism😂", "hamari_adhuri_kahani4726": "What is this I think you make one porn movies..", "anmolsagar6695": "Cant believe you have to deal with such shitty comments sometimes..! @redheadwayfarer we seriously require more #malefeminists", "ramurocky6": "Brave and pretty ❤️", "charlieadimani": "Ekdum kadak boobs", "dnablast": "Did she get a lip job done", "anshuloye": "Caption 👌👌🙌", "ahan_ahann": "Jo bhi bolo. Tere mammay chusnay ko hai mereko randi ki bacchi", "bhavanimenariagmail.1373": "😛😛😛", "parves___lm": "@sandeep.p_sandy got ha", "mdmudabbirazam": "#hotaf🔥💯@redheadwayfarer", "rajendra2688": "Nice b**bs", "vishal_biswas22": "She says it’s man’s fault u useless slut shits like you give bad name to girls ducking feminazi blaming men for everything ?frustrated with life u bitch ?", "aman_alpuria": "🔥🔥🔥😍", "riabanga": "@tllachenpa woah woah woah woahhh chill man the thing you are doing right now, is the reason she has captions like that. and she is not naked here, she has one piece of clothing there , you are the one seeing everything other than that one piece of clothing on her .", "a.j.the_king": "Hot", "pencoffee11": "Okay, so since most of the guys here have problem regarding this pic. Let me say something. She didn't intend to post her picture for nudity. She did write a very strong message regarding freedom. People here are calling her names. But do you even know her? Do you even know the intentions behind which she has posted this pic. To all the guys and girls who has called her names, just go fuck off. If you dont like her post, her message, then dont see her posts, but atleast dont demean her. And please keep your obnoxious toxic thoughts, to yourself. Its people like you and your thinking taht girls are not safe in India. Ladki ne chote kapde pehen liye toh woh available hai according to you guys. Please stop your nonsense. And if you cant decode her message, then please stay quiet instead of spreading and talking shit about her.", "jix_love": "Boobs or lips pe swelling kyu he", "p__real": "❤❤❤", "iampsc1": "❤❤😘😘😘😍", "deepankar.patowary16": "Don't wear bra let ur nipples b free", "kashyap8865": "so hotttttttt sexy🔥🔥🔥🔥🔥", "frenchfriesonmymind": "@redheadwayfarer howwww do u write like this???! This one is one of my favorites.", "saifalikhan6982": "This is your freedom ?? Showing off your boobs , You demotivates everyone who follows you 😑 @redheadwayfarer", "nimeshsachdev": "@clicker_snjv_", "updownftw_": "I wunt si nipel plox b0sS", "aftabshaikh47": "Sister aap ne sahi kaha ke freedom kya hai. Freedom aap ka aap ke body aur mind pe control karma.. Mai aap se ek sawal karna chahta ho kya aap samaj par control kar payenge khas kar ke aaj ka samjh jo every next day one step backwards ki taraf jaa raha hai. So mere hisab se aap ko phele samjh kp badlne ka kaam karna chahiye then apne Aap ko iss se fayda ye honga ke aap ke aapne wali generation ko koi cheez ki freedom mangne ki zarurt nahi padegi.. i hope u will understand now very well....", "_dwip_": "Sexy 😍😘😘your boobs is soo good", "kalyug_ka_ravan_1999": "Wo sb to thk h lekin sara fat tere lips m hi h kya", "iamchetankadam": "Well said...😎", "tllachenpa": "Mostly what your mind wants is conditioned in to you by the society. So if you think freedom is doing what your mind wants to then it's no freedom at all because your mind is terribly brainwashed since you were born. You might think you are free but you are living under illusion. Freedom is not about doing what your mind or body wants you to do but freedom means to be free from the mind and it's dictates. To be able to use it when you need to use it and to keep it aside when there's no need of it. To flow like water and take whatever shape it is put in, spontaneously and peacefully and not be like wood, fixed and rigid, adhering to a fixed idea be it conservatism or modernism which only breeds violence. Freedom is being free from the mind and it's reptilian urges be it about wanting to showing skin or boozing at 1:am. Freedom is not about being able to do whatever your animal inherited mind wants to disregarding everything else but it is about being a sensible, rational person who goes about his life smoothly. This is true rebellion and not the one which you advocate. True rebellion is being able to live peacefully amidst a sea of contradicting cultures. Freedom is internal. Giving in to every urge of your mind is no freedom at all, rather it is being a slave to it. Freedom is to have power over these urges and not let these urges overpower you.", "yashika.pizaro5220": "Chupa laga ke lips bade hoge", "kalpit_n": "@redheadwayfarer Are you comfortable with your mother seeing these pics of yours?", "r.k083": "Nice.....💋", "shweta__0308": "@saleenaaaaaaaaa", "ashvipathania712": "but the problem is some people will never understand or i might say many people...", "devil78966": "😠", "redtardis": "@baked_bahaa", "tanupriya20": "What a caption!!!!!!!", "deepika_sandal": "Freedom to me is saying what i feel without being judged by anyone", "pranav_pai": "How come I don't see men complaining about not being able to skirts in public...?", "arbaaaz69": "@jibran_ibn_ishaq femiNazi", "ishita_kapoor21": "Even after reading such a beautiful caption if some men are commenting shit about saloni and her character then maybe they are the ones about whom she talks about. These are the men against whom she writes. Spread love not your unwanted hate.", "sunnykhatry": "I wanna see you naked... 😍😍😍😍", "vineet_singh_rathi": "...... I have never ever seen such a beautiful sexy picture in my whole life , even according to me , this would be world's most sexiest picture ever @redheadwayfarer", "pawan_verma_photography": "Awesome", "its_cassie06": "@mr.__antiq_ are women allowed to rape every man who masturbates openly in streets? When men take their dicks out and pee on roads can women assault them and then say \"he was naked he provoked me\"? Just stfu with your misogynistic bs", "sonuzzzp": "Feminism k naam pe aap only xpose kr rhi hain aur kuch nhi h....xpose krna h toh karo bt ye faltu ka gyan mt do...iss desh ki ladkiyan kahan se kahan phunch gayi h lyk,saina nehwal,deepa karmakar,sakshi mallik,kalpana chawla,pv sindhu bhul gayi h aap inko sayad......inka v breast h aap akeli nhi ho....plz loser jaisi baat mat karo.....feminist ho kuch alag topic main bast karo...", "shakil_ahmed_abid": "@shihabtasin", "harry_rajodiya": "Very nice looking", "shant_pahadan__": "She's so cool ..@mystery_g10", "vishnurz66": "We live in a country where we cant have a food we like, even though if we have good marks then also the goverment jobs are given on caste systems and says no one is asked about caste. , and the most important rule now a day we need link our adhar with sim, mobile and will. After some they will implement a rule to link ur adhar with ur undewears...", "sahil_dalvi.18": "Nyc one 😘💋💋💋💋💋", "sbaazkhan885329276": "Baap re Baap", "adarshchatur18": "नंगी हो जाओ पूरी ये भी क्यो पहने हो आज़ादी लो तो फिर पूरी लो", "all_about_beingme": "@sonu.panda #respect bhai ....Sahi kaha ....Faaltu ka kya gyan de rhi hey ..... Aaj kal insta pr boldness ke naam pr kuch bhi dikhao or koi comment kre to bakchodi ... Krne lgjana ki girls power ke naam me .....Kyaa chu****a hey ye .... U said it true", "rahul.bhati.7334504": "Salute respect", "funny_boner8088": "kabhi pure kapde pehnkar pic upload kardiya kar...hamesha adhe nange hokar feminist ke naam pe u just behave like a victim.......chutiya ladki", "mauji45": "@basil_zafar26", "imonalisabhattacharjee": "Ganda comments kyu kar rahe ho... Jaa ke mar jao saale chutiye it's her life her decision what she wears or what not who the hell are you to decide n think that she is ****** n kisko bola follow karne ke liye does she told u guys to follow her n comments on her every single post ? Tum jaise ghatiya ladko ki wajah se badnam hai india shame on u", "the.nikhil.prakash": "Yes this is what freedom means... And this is what India needs", "narayan.tushar": "Nice lips n boob's", "the_magnitic_touch_0716": "What's wrong with your face ?!!", "stars_vhf": "❤👌", "tiff__0531": "@abritton21 I feel this on so many levels", "aaaahhhh_zad_": "@r727hab", "godvin_rakesh": "So swt...dyr", "watchamit": "👅👅🤪🤪🤪🤪 side boobs", "ramij_raza": "Woww so beautiful", "amitpub99": "Too good saloni", "bruce_banner7": "@redheadwayfarer what's the connection of freedom with your seminude pose???waste of time😤😤😤😤😤", "saurabh.456": "are u mad", "spunky__a_m_a_n_": "Or.. im not a rapist so that i,ll justify rape ok..", "jyotikha.dutta": "Stop this nonsense.", "aii_wann_fudd": "Bhai aur ek baat. Indian society mei girls get judged too often for their clothing. Comments are passed. Not saying ladko ko nahi karte hai, but the ratio is comparatively very less", "_ayushi_03_": "also what about the kids n babies? how do we make them dress up that it not provokes men out there to rape , molest or eve tease?", "ronaklalani_65": "Sexooo", "vasimkhan9": "👌", "muhammedabdulrehan": "🖕🖕🖕", "aldrinthearmadillo": "What’s the point in posting a semi-nude picture to address such a sensitive issue? I’m 100% for women’s rights but this picture to your caption is completely irrelevant and doesn’t display a true sense of “freedom.” @redheadwayfarer", "_magical_musician_": "Delicious ❤️", "kirasingh7": "Idk freedom but I like what I see beauty at its best a face with confidence is the most beautiful face 👌", "its_rajveer_baby": "@redheadwayfarer mam we love u allot somepeople do not understand what they are n what de do ex the negative commenters ur doing a great job for coming girls generation good job keep it up 👐as a fan we respect u alott ❤", "mineecifi": "Hnmm . Yeh toh ek dum sahi bola tumne 😄@shraddha_kuku", "himanshueshu": "#good_said", "menlonghairstyles": "Attention seeker", "iraj_mukherjee": "Ho gaya Aapka drama? Khatam? Stop posting shit feminism ke naam pe. Ok?", "mikedavid5655": "😍😍like very sexy", "indian566": "💕💋💋💋", "honey.k_15": "@singhanushka2148", "d11d11._": "But big sister... At least don't photoshoot like that.", "neero_theblack_mastif": "Jo pehna h.. vo b kyun pehna h smjh ni aata... 😧", "zumba.india.videos": "Bad lip job", "zaynmalik441": "@redheadwayfarer Wow😍😍 what a great crazy and cute look beautiful☺yar mera toh kuch dil karni ko karrha hain. 😍😍😘", "yehdikhaa": "@redheadwayfarer do u wanna try for modelling based reality show or roadies or superstar ??", "story_untold_forever": "Why don't u post a natural pic why you need to edit", "jenga_6789998212": "*your", "i_am_soruv": "#Dammn...!! #Yu #Hawt #Too_Mch #ix_pix😯", "happygolucky0505": "Even this @khushbu.lohiya @thesanjeevni", "yashika.in": "slayyy the sideboob queennnnnn", "zarinhan__1": "@redheadwayfarer The intimate parts of the human body must, according to any religion, be covered by clothing. Exposing the intimate parts of the body is unlawful in every cultures instructs the covering of genitals, and for adult females the breasts....aswell as mens too. God never told us to go topless or wearing short dress, showing cleavages in public place. It is shameful for every human beings to go for nudity then der will be no difference between humans and animals", "s.musaib808": "u r right i m with u @redheadwayfarer its her choice wht she have to wear or not nobady can judge her", "neel_n_navi": "Dont know how much fotos u must have clicked before to get this one as the perfect to post on Instagram", "the_specialist_23": "Showing nude pics to impose women safety is it appropriate??? Something wrong in indie girls why they all trying to be fucking feminazi motherfucking bitches, and from the girl i mean feminazi not all of them not like you at all", "karan4155krn": "Bravo great though and logical. . Hope one day we CAN all have share equality of freedom. We allways say that we are a great country. I am proud to be an Indian but also ashamed that we as a citizen this great nation we are not able to provide a same sanse of security for every individual. So I think first we have to admit that, not just denied like it's a mith. Actually every single word of this post is true according to me. So why not let start change rite now. Abandon false justification about why these rubbish things happened everywhere. I think because we never take things this issue seriously.it was just like some random news on papper .let's do something about that. .. and hope one day we can became citizens of not just great but 'BATTER' INDIA", "rajnish_fatehabadi": "Wao hot hot hot what a boo... 👌😍😍😍😍😍 @redheadwayfarer", "ashokshah2197": "Beautiful", "mandal7008": "Awesome gorgeous. . . love you sweetheart", "rahulanandd": "@suraj_singh.ss", "ranveer1996s": "i really like your thoughts sometimes", "avijit__007": "Hootyyyy😘😘😘😘", "nextypu1": "This is wrong.", "sharatbiswas": "Sexiness overloaded,beauty overflooded...rise & shine always girl...Cheers", "g_a_u_r_a_v__singh": "🤗😍😗😛😛👌👌👌💋", "moradiadosquadros": "Nice click. 🙏", "jagvinder__": "🍒🍒🔥🔥", "shk_hulk": "😍😍😍", "rudrabanerjee668": "Freedom dose mean show you how hot or sexy Are you..or not just showing your Boob..you in indian not in sillly pornhub industry...our country is not like that", "rup__1": "👏👏🙏❤", "ashwin_batra_": "@sharminlalani", "vbhvvvvvv": "applause 🙌👏", "itsmbitxch": "Everyone who thinks a woman's boobs are her \"izzat\" let me tell y'all somethin: my boob ain't my izzat. It's a fucking baby feeder. It's only purpose is to feed a child. Just bcuz your dick get hard when u see it, doesn't make the body part sexual, inappropriate, or a persons \"izzat\". Girls get turned on by men's good physique and toned muscles. I dont see anyone telling them to cover that up, I don't see anyone calling it sexual, I don't see anyone telling them not to display it to the world. Why? bcuz men are considered people before they are sexualized and women are sexualized before they are ever considered 'people'.", "brarsahil": "Again u r very right @redheadwayfarer .. there are many factors behing this darling which i think and pray that will get resolved. But literally it feels so bad when i look at some damn comments by some people who cant get a little thing in their heads and should be ashamed of your self because they r d current generation n this is not how it is gonna work.. keep it fair na for girls as well.. everywhere.. i neither disrespect a girl nor provide any special privilege to them. Just treat them exactly d same excepting some little more respect which they really really deserve", "riyasharma104": "This ain't 90s no more. She'll dress up the way she wants to. Die mad about it.", "moma.steve": "Yeah freedom is not equal to nudity. But freedom is equal to do what you want to do doesn't matter what it is wear a saree or skirt but should be your wish if she wants to post this pic let her #stopslutshaming #youdoyougirl", "ajaytanwar39": "Hottie😘😘", "a.b.b.y.s.h.e.k": "So basically anyone in this 1700+ comments list if feels that nudity has nothing to do with freedom of whatever it is , then just dont believe in it . But if you are not , why do you have to comment on her ? I don't fu*king understand you people . It's her life , her posts , her though , her body , it's upto her whether she posts half bo*b pic or she poses nude . Why do you have to bother about the pic when you have something so wonderful , so motivational lines to read . @redheadwayfarer I am with you . You are wonderful , You are awesome and you , You can bring a change . Just ignore the odd Saloni Mam and Just rock .", "chandrakant.sharma.73932": "Don't know when the other lower mentality person's start respect women's... if they can't respect so its better be shout the mouth.... they don't have right to pass comments on girls dressing... this is a modern time and everyone is free to wear anything...", "__nehaarya15": "No matter what the people think about you.... you're just real soul @redheadwayfarer thts the awesome thing ... ps-you're lil fan 😘 olws love you ❤", "ssyyedd123": "wow😍", "soumen_saggi": "Well said Girl😊", "ravikant16appy": "Oooo looking to hot and sexy...u got beautiful boobs.,.", "psy_being_human": "Psy being woman 👸😘😍😇✌🙏", "kumarviplove": "Roam around like we r born....", "aesthetic_voyager10": "You are literally a great mind and happy soul . You dont give a fuck to people . Thats the best thing i like about you . I tell all my friends about you that live for yourself stop worrying for people . You are setting a good example yourself for every person out there. You are not flaunting out for others . You are wearing for yourself . Thanks for showing this nation that be yourself .", "parthsh4": "@redheadwayfarer The problem is not weather woman wear what cloth the problem is about only the society that teach , at a stage of young age girls and boy both want to wear whatever wish , short shirt or inner wear only or sari , after they married and going for family planing they started to behave in limit because why they going to be parent now the same guy and same girl who were open in their young age they started to behave suddenly conservative , added more conservative if its a girl baby why because they think society will think what ... the problem is every one wish but no one want to be victim of that change because the fear is of. \" SOCIETY \". This society\" consist of what ? who are this people ? .. this is nothing but i think its vast differences between social groups and society", "ryan_k_well": "yor lips😘", "aquariusnode": "Beautiful click", "mayank_the_kshatriya": "One should alwayzz have freedom of living their lyf the way they want to...but freedom also comes wid responsibilty...ur freedom should not affect someone else...be it boy or girl....so just chill guysss nd enjoy life", "shafi_insta": "Sexiest pic I hv ever seen..", "lavina_bhutra10": "@ayushaa_24 She's Crazy.", "imshruti17": "❤✌", "rainbow_._blooms": "Damn right💓", "ronit_vinocha": "If there is a thing called \"visually raped\" then every second man is rapist and should be killed,by this half the men are rapist .", "kulshresthasanskriti": "Whoever thinks that boobs are IZZAT of women you are wrong... This is a sick mentality...", "vartika0069": "Nipple??", "aaishaasingh": "Where r nipples", "sarthak.bhargav": "Very nice", "ary_achillies": "You Look sexy! Only advice from my side is please dont put such captions!! Peole here are less after ur pic and more after ur cap'...Logo ka kaam hai bolna😂I wonder why on earth they are still follwing ur posts if they have so much problem with you😅", "adi_thecivilengineer": "Who is she", "niyogyarpi": "Just to keep up with so called modesty and standard beauty we r force into those wierdly beautified yet painful fancy bras (also named better..lingerie) as if it will change how it feel to be into them more than 12 hrs a day with tight elastic and wire piercing into flesh, don't know y people have so much problem with outlined nipples through our garments. Day when we go braless n fearless is a day complete freedom", "as_me_for_shout": "LOL but this is India... Hope that word \"India\" is enough.", "havoc_s_n": "@redheadwayfarer I appreciate ur efforts saloni... But the change u are trying to bring in this country is very very difficult.. People won't change dat easily... According to my aspects a girl should be trained martial arts ryt from her childhood.. Infact it shud be implemented as the part of our education system... The schooling shud consist of martial arts and various other self defense class for girls.. Only this way i hope we can confirm the safety of girls in our country by atleast a bit... There are cases in which there have been rape attempts on martial artist girls and they have not only rescued themselves but also screwed d nuts off d guy.. Its the way of d nature... D strong prey on d weak.. So we shud embrace this thought of making our girls strong by training her ryt from her childhood.. Please consider this thought of mine and have ur own view abt it..", "aeshiita": "HUMANITY OVER STEREOTYPING. :\") More love and power to WOMANHOOD. 💛", "rounak_bose_": "Then u have peney", "priyanshubhesaniya": "Another publicity stunt!!", "shraddha_827": "It's great seeing that your trying to change the world by your thinking but you seriously think that everyone's mindset will change like that and posting your opinions will Change them... I mean see below your post comments are more vulgar then they should be proud of you kind... You should think that ... It's great to have strong mindset but first you should understand what you can do and how you do... Thank you...", "shubham_hai_hum": "Whenever is see a sexy pic of tryin to be sexy model or struggler they have a caption related to feminism or freedom or women power! 😂😢Coincidence???", "sameer_sk94": "Getting nude on the name of feminism no connection just a publicity stunt", "_vinnie_mehta_": "Love uh loads...real freedom.🏆", "vaibhavvraj": "Even i also want to know, why the people are thinking more about Girls body parts.. Breast is that part of womens body from where you feeded. So, please throw out this fucking thinking from your mind.", "smriti_shankar": "Power to us, WOMEN!!", "onelifeonewaygo": "Well said", "kalyani_kofficial": "Fantastic 😘❤️", "vaibhavtyagi08": "👍🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "patel.kinjal94": "Freedom Mubarak ap ko ache freedom hai jis mai ap pata nai kya kr rahe ho and one think pls ap tv pr nai chal rahe ho To km sai km to yaha Instagram pr is nuskay sai ap cha te ho ke log ap ko dekhay is sai be kafe sare ache options hote hai agar ap ko logo ka attention chai ya ho or famous Hona ho !! Open minded logo ke leye acha tareka hai yai famous hone ka and attention pane ka @snooscenario @fro_zhen @aishwaryalakhani @mansi_sh14 @priya_pp Fasad ke jad @redheadwayfarer And ap sb logo ko yai sb acha be lag ta hai as in open minded", "rashi_butolia": "Too sexy", "the_colossal_vibe": "Such inspiring thoughts. ❤️", "gunjann11": "As always beautifully expressed! :') But when and how can we get this freedom? @redheadwayfarer", "____stormborn___": "Well said @redheadwayfarer", "d4522912": "Eternal love #selfism # ecstatic # soul stuff #😊👍", "akanksha_2009": "You are an inspiration everytime I read and see your post I’m always blown by them and I read a few shitty comment saying “itna freedom shobha nai deta” because of such guys we feel Un safe even if we Are in our salwar suit", "_piku___": "You always write as my heart feels. ❤️❤️❤️❤️❤️. More power to you and all the women in the world .. 👍", "darth_hdobus": "It'd be better if such constraints and rules and bullshit weren't engraved in people's minds as soon as they were born. Even with all evolution and progress, it sucks that women are subject to such things. I feel sorry for all men and women around who support such stupid things cowering behind false beliefs that women aren't meant to be free. @redheadwayfarer", "dp_7_dp": "👍👏👌", "kuchhvipic": "U r simply extraordinary... Which differentiates u from others 😍😍", "___insta._grammer___": "I just love you ❤", "oddity.chavan": "You are so beautiful❤", "dimple.parmar.902": "Is it so difficult to understand that like men have chest and nipples, women have the same thing.... If we don't consider a man's chest to be a sexual organ then why do we consider woman's. Would have been the same case if a man with six pack abs uploaded the same picture? Hundred thousands of years since men and women were created and our mentality hasn't evolved yet. Whenever I see your any such posts, I feel so proud of you and you express thoughts of thousands of women out there who believe that we have got one life and no one else should decide how to live it but ourselves...I look up to you as my idol and you are voice of every girl who is strong and independent or dreams of being one. #lotsoflovetoyou@redheadwayfarer", "mr.obhoddro": "I love her from my bottom of my heart as she has the guts to speak up!! U don't thats all", "khatrinasrullah": "I'm fully agreed with your comments..... soon every Man will be Chang his mentality", "devangmahulkar": "@dimple.parmar.902 Hats off👏👏", "shraddha28kamble": "For u the meaning of freedom is to wear clothes that seduces people", "sparshiiiitaaaaaaaa": "Proud of what you do and whatever you post I keep waiting fir your posts and really hats off the way you deal with the fucking male chauvinist people.....I just love you 🌷 the way you let people know about feminism is lit🔥ur an inspiration @redheadwayfarer ❤❤❤ keep slaying", "teeshagarg": "A true respect for you ma’am 👍🏻", "violetsunshine_": "Why do u keep answering hater comment?! Do u think they will change their mindseys just because u fought with them?!", "this_day_that_year_in_cricket": "We are with you and we appreciate to raise this topic and writing and giving a tight slap to dirty minded peps ! 👌👌 #wesupportyou @redheadwayfarer", "khushiii0814": "Hatts off Saloni!!❤️🙌🙌", "richa_890": "This is amazing!!", "ashu_shukla4": "Definition of beauty", "kingkhan_king": "So hot", "jshree1994": "@preethirajan8", "prince.raj77": "fabulous cutie😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍@redheadwayfarer", "azmeerafshani": "Lovely", "gunhaw_k": "I personally feel one can show their breast or even can walk nude its ones own choice who are we to comment . Freedom of speech and freedom to wear whatever one likes is what one wants . so cheers u took an amazing step with speaking on this type of issue carry on its wonderful!😀😀😘@redheadwayfarer", "ms_shanu76": "You are mad yarr", "sudhinsreenivasan": "#isupport @redheadwayfarer pls do post ur good comments also", "eksafarr__": "Y'all should know she is a nudist, a self taught artist, expressing and exploring gender and sexuality through art.", "_chaos_of_life_": "@redheadwayfarer I really see your posts n stories , how these jerks take it on your posts , it's really disgusting to answer them back , hw creep their thinking yr . Really i feel like who the fuck are you to say like that but ya it's pointless for them n fr us to make them understand . Yeah doing really awsm 🕶️ lots of love ❤️✌️", "lekhrajpanjwani": "@redheadwayfarer respect ✌✌👍❤❤", "sonalichaudary": "Hey indian paris jakson", "ritika4828": "@redheadwayfarer Really everytime I see your post it inspires me.Keep it up!!", "pooja_force": "A woman is most beautiful when she speaks her mind..... Such women are like a threat for Indian men.... Cause bachpan se unko sikhaya jaata hai.... Ladkiyon ko zyada nai bolna chaiye..... Only few Men are raised right.... U keep doing your thing.... When Hollywood celebs click their half nude pics.... Such Men admire and also masturbate on it...... But Bhai ...women in India or celebs do so..... Toh such Men are like Women should know their limits..... Bhai apni limits dekho..... Aur apni aankhon ki... If u cant respect a women's body....then u can never can respect a women... If she's wearing a dress or salwar kameez..... Cause respecting Women sanskaron se aate hai kapdo se nai.... Peace", "aksharzutshi1": "🙏✌", "weirdo_kid__": "#inspiration no other words can define you @redheadwayfarer", "_cereal___killer": "Respect @redheadwayfarer there wasn't a phrase wrong in what u said", "shikhaattri4": "@jayesh1252 oh you want this type of freedom then why dont you go to western country this is India", "zamantheman_": "#girlpower #womenpower ✌✌✌", "_luna.10": "Keep it up...girl", "kashishh_narang": "❤❤❤❤", "vishaltiwari464": "Cool look", "rahul_jothi": "Hey, its very disappointing to read such comments on this post. Needless to say, its the people who have to change their minds not the women. You going right. Your posts are strong and people cannot take strong thoughts imposed on em. ❤", "dingalongk": "No man can judge... Its God alone.. I hope whatever you do is liked by upar wala cause at the end that's what matter the most... 😊", "oluwasegunrichard": "hello baby I like your breasts I want to suck it and fuck your pussy so nicely", "_.lohita_parihar1997": "Beautifully said!!", "flyinggrani": "I don't understand why ,?", "umesh_mehrol_": "lips😍😍😍😍😍😍😍 @redheadwayfarer", "cllasy_rookey": "wtff!!!! wtt so wrong in dis pictr..abv all just say me all u fkngg guyss hv u seenn smones boobs frst tym??? lyk of no other girlss?? reallyyy!!!!wt about porn u see wt about det bollwood actrss who r wearngg such typ of cloths in whch nthngs wrong in it...its up to us only wedr we wants to covr r body or to shww up...so plzz stop reacting so childss on dis post...its actully funny...tu sab bandh kamre me kuch b karo n yhaa es ladki ne post kiya its actully freedm..freedm of her own couragg...keep it up dearr...", "sanjana1990": "Sounds like most of the hate you are getting (IG stories) is from guys.. 🙄 like, they don’t even see the irony in their statements. Ridiculous. Who the fuck made these guys the torch bearers aka policy deciders? 🤬", "p_r_a_g_o": "Such a great feminist... damn u hav got something different and u always come up with a new idea... free the nipples is great, if we males can go out without inners then why not u...such a great step...keep it up and if thousands are haters then lakhs are followers...never lose hope...lots of love and success...👍", "imarufqureshi": "to chuda le mujhse randi jyada boble dikhaane ki aadat he to😂😂😂 @redheadwayfarer", "its_akansha__": "You have inspired many... U r inspiring many... Keep the good work going... #freedom 😊😊 you are being admired , adored , loved and praised @redheadwayfarer you are like a new refreshing morning after a dark night... Love you for who u r and for ur beautiful thoughts...", "apsbaghel": "Absolutely true, amazing and shameful for the men of my country...", "sheikh_hilal_ahmed_shamsi": "@redheadwayfarer ye baat bhe sahi hai ke yaha pehle se he aurto ke saath ghalet hota aaya hai pehle sati pertha the pati ke marne per patni ko zinda uski chita ke saath jala diya jaata tha. Ab jagha jagha unke sath zayadti hoti hai badtamizi hoti hai. But kuch ager ghalet ho raha hai to usko sahi kerne ke lye khud ghalet hojaan sahi nai hai mai shart laga sakta hu ke 80% logo ne tumhari pic dekhne ke baad neeche kya likha hai nai padha hoga. Wo ab bhe wo he ker rahe honge jo hamesha kerte aaye hai they just enjoy you. So plz don't upload nudity don't sport nudity. Thanks", "alexander_supertramp2.0": "Much love ❤ more power to you 😎", "deborah.mahima": "\"without being visually raped \".. Which is so hard to be seen in this country! 👏👏👏👏", "sunnycallinn": "@redheadwayfarer Don't give A shit to these people who Talk shits... They are the same people who definitely wanna erase there Web history so that no one can see how many Adults site they have visited.. if you people have that much Dignity then stop watching adult stuff... Aur Waise bhi Jo log Subha uth ke Washroom nai jaate wo poora din Muhh se Hagga Karte hai.. aur Unki soch sauchalay ban jaati Hai", "__prafull_21": "#netrachod", "best_iranian_tours": "تورهای شادمخصوص تهرانیاوکرجیها", "chirping_stars": "💫🌹💫🌹💫❤️💫🌹💫🌹💫❤️💫✨💫✨💫❤️", "apoorv_singh_asr007": "@redheadwayfarer very well written. Absolutely classic. And you are looking gorgeous. I am sad and I apologise on behalf of every man who posted derogatory comments. What are my views on this? First you are looking stunningly beautiful, second it is your body and the way you want to potray it and it gives no one a fucking right to moral Police you , nahi dekhna hai to nikal jao..third what would I have done if it was my girlfriend or my sister or a friend who would have posted this.. I don't know!?! maybe I am not that progressive yet .. but its my fault. Not their!", "iamanbajwa": "Hey you are a really strong personality It takes a lot of courage to rise above all these opressive thinking and taking a stand for something .. I really find youa kinda woman with strong and bold mind ...so jus keep it on ..you are an inspiration to many ....keep it going♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥", "vartika._": "💯💯💯", "indraweeeeed": "😍😍😍💀👻", "vipertecpro": "Umm....as a Human \"👍✌ Good Job\"", "_jami6": "Why dont u try to pose like this.. @ishiitaaa___", "himanshu.kulsh.3": "Go for it girl.. 👌👌", "_utkarshatiwari_": "What the fuck does anyone has anything to do with what one wants with life? Who the hell are you to judge them? If somebody wants to cover up their bodies, then go ahead. Is anyone stopping you? But then, don't you think it should go the other way around too? If somebody wants to roam around naked, who are you to give them the stink eye? Why don't we just change our own perspectives rather than pointing fingers at others? #justwondering", "imunknowntomyself": "Those are just body parts. And there is nothing to do with woman's dignity. Just because of people who think wearing a short dress makes someone a slut , that's truly wrong. A girl can roam around naked if she wants to , nobody is eligible to say anything to her that's her fucking life. This is the reason why India is still a developing country just because of some pathetic people our India isn't growing mentally. Why can't a girl post a picture without clothes ? I mean why ? Everyone is talking about equality. Where dafuq does this equality exists ? When we boys are smoking , roaming around bare body , can wear shorts and nobody bats an eyes but when a girl is doing the same thing then everybody looses their mind. Some boys bully girl when they're having their periods. Like what ? Why dafuq some people do that. Bhenchod agar unlogo ke Mummy ko periods nah hota toh saale rhete he nai. -_- And @redheadwayfarer is doing a great job teaching us what we should've learned from our parents. #RespectWomen #Equality", "sachiiiin_sharma": "M with this girl #girlwithbrave respect✌🏻🙌🏻 @redheadwayfarer", "naresh_garlapati": "@redheadwayfarer every country has their own speciality in the way of dressing.Bcoz our tradition we are an inspiration to world.Dont try to bring your western culture.", "navyasarowa": "Boobs? Is just a part of a human body. Is just a piece of flesh. It is that part through which you were feeded when you were hungry. So kindly stop staring at it and be a man. I repeat ! BE A MAN. To all the boys out there who are just focusing on the boobs in the pictures and commenting nonsense. Grow up !", "fiercelyfeminist._": "Wow. I totally agree. Love this.", "failedattemptsatspamming": "FUCKING LOVE THIS.", "itsmethatpaharigirl": "@redheadwayfarer YES, WE SHOULD ALL BE FEMINIST. BUT WHAT IF YOUR FATHER SCROLLS INSTAGRAM AND GETS TO SEE YOUR THIS PHOTOGRAPH? Will this be \"Feminism\"? I don't think any father will agree on this sort of Feminism. I myself come from a Hindu family and I am really wondering on this theory of FEMINISM.", "sri.shubham.ss": "Where everyone is debating on cleavage, side boobs, feminism, etc... I am only thinking that... How fit she is yaar... Kya sahi workout krti hai 😂 yes... Gym freak is the word.... Yeah, but seriously I believe that she had paid a lot of hard work in the gym...", "britesh_rockzz_01": "Inspiration for all love you didi", "vaishali574678": "Even no need to ryt all these things and don't make this waste .......it all are very good thoughts", "akki487": "Just salute your thinkng so inspirational you❤️. People who hve small and bad thinkg must read this @redheadwayfarer", "sampurna.nath": "@redheadwayfarer hats off!😊❤", "annwesha_kargupta": "And you people have guts to say that it's because of clothing!!?? RIP society..If this is the way to treat girls, to touch them in any chance u got, to take advantage of a crowdy bus, to take advantage of a scared little girl or to take advantage when a girl is alone on road at night..then those who take advantages are sick, pathetic. Learn to respect a girl, not judge them.", "lavishadasani": "So much pride in being a girl❤️ thanks for giving all the girls out there the confidence they deserve to walk with.", "_niveditha_iyer_": "OK this is to all the hate comments..GET THE FUCK OUT OF HER ACCOUNT! NO ONE IS FORCING YOU TO SEE HER POSTS! OR STOP BEING A DICK!", "too_messy_": "we watch bollywood actresses rapped in a towel .. we dont say anything ..recently @bipashabasu Has done a condom advertisement with much exposure ..no fucking person commented on it !! Do u know why ..bcoz she did it with his husband . .. If @redheadwayfarer Is wrong then @bipashabasu @sunnyleone Are wrong tooo... @dishapatani Also went for a nude photograph for dabo sir ..no fucking person comented ...if she is wrong the whole entertainment house is wrong ....peeps watch out before u say anything !!..", "chinzkechholebhature": "@hypoclitt", "viiibee": "😂😂😂💩 @sarthakk_batham", "hrsmrn.mancoo": "Fuck man....these assholes think they own this society....but knows nthin ...FREEDOM is yet needed from these disgusted yet self proclaimed civilised citizens...and @redheadwayfarer your posts are motivating ....don't let these stupids affect you and I know it doesnot .....YOU GO GIRL|||||||", "the_phenomenal_one.fzk": "lokin gorgeous.. and ya always remember we luv yuh😘 #tigress_saloni @redheadwayfarer", "samiran_sd": "So well said @redheadwayfarer read this @ar_apurva11", "bsuryasiddardhareddy": "PP", "thefilmybndaaa": "Freedom ok..ok.. bt.. esa freedom .achया nhi lgta...(शोभा नही देता)", "jass_karan_s": "Bhai last main mar peet k yehi baat niklegi !!! K apni nazar or soch badhia honi chahiye fr kyu nange hi na ghumlo duniyaa main but haaan kuch log kahenge mujhe ki tu ghoom nanga hoke agr aap sab tyaar ho to main bhi hun !!! Ajao maidan main bigdi auladoo !!jab tak education nahi milegi india m kuch ni hone wala gareeb ka gareeb reh jayegaa !!hope for the best !gud luvk", "hypoclitt": "NYc bobz", "discovering_artofliving": "I don't understand, the people who don't understand the posts and starts judging girls with their clothes why they are following the page??????? This is the reason we girls can't call ourselves safe in our own country. Shame on such assholes!!!!", "_sheeba._": "😍perfect.. with perfect caption 😘", "_cairaaa_": "I wish to grow up like you ! I mean my own identity but resembling yours", "shreyas.mhashilkar101": "I really appreciate that.. Your life your dicssion and aapni life aapne tari ke se jioo bhai ...hati 🐘🐘chale baajzar kute bhoke hazzar 🐶🐶vise log hai dear... Love your self 😘😘and I am also Big well wisher of u 😇😇girls and top and grils humesha Top hai and rahegi 😊😊", "rudrh_nigam": "In logo se pucho jo itna uchhal rhe h... kapde wgrh ko leke...bhyiii jo 5-6 saal ki bachiyon k rape hote h..usme kya dkhta h ladko ko..kya us bachi ne chote kapde phn rkhte the jo provoke ho gye.. apni nazar badlo...bhurkha ho ya bikini koi fark nh padta... ladki aadhe kapde ya na phne...kisi ko haq nh h uska rape krne ka ya comment pass krne ka...", "rohit8775": "Chup be @redheadwayfarer", "onelife.13": "U r such an inspiration to every women in this country 👏👌Been my fav from GOT and will be always forever. Keep going🙌 💯❤ @redheadwayfarer", "mrunalpatil_23": "Pls. Check dm.you will definitely find a good answer to all who are sayin shit! pls. Check dm @redheadwayfarer", "adheena_babu_17": "@redheadwayfarer Freedom for me is to go on a long trip on your bike 🏍 (with or without your gang) and return home safely...!!! If a boy can go out after 9 pm... then why can’t a girl? If a boy can wear what he wants...then why can’t a girl? If a boy can enjoy his life according to his wish... then why can’t a girl? Why is it even said that girls are meant to obey others and live according to other’s wish? Why can’t a girl decide her life by her own? Why should she always listen to what others say and live according to other’s opinions? That’s my definition of freedom...", "piyush._.bhawsar111": "Ohk then kya fark padta h i want see ur nude boobs ?", "akanksha_saroha": "Caption 👍🏻 @geetika2811 @sanya_3 @sanya_makkar @srishti_thukral", "ammaarrkhan": "😎🖤", "sachjhoothaurshabd_": "Make it simple guys,live and let live ✌🏻 @redheadwayfarer you are an inspiration👍🏻 keep living the way you do🙌🏻", "fitnesspsycho_trainer_ashish": "This is the most apt and amazingly expressed meaning of true freedom. @redheadwayfarer . I don't follow you but I truly respect you a lot more as a person from today 👍", "rohanwilder": "🔥", "tooffaanniiii_23": "@enik3t_ @call_me_d3vil ab dangal hoga", "t.e.e.n.a.06": "@redheadwayfarer caption ✌✌", "devanshikachchap": "And that's exactly how a true freedom looks like", "namrezy": "@nvmona", "adiraavan": "@redheadwayfarer u look like nargis fuckri or its bira", "pallavi.002": "U look like ellie goulding to me lol..and u r great writer..I m in love with u!! <3 <3", "bhaw_na_23": "@shravan_gothi Tumne Toh Apne photos mai Esse bhi Kam phle hue hai.. You go and get naked! And lgta hai dimag mai bhusa bhara hua hai.. Jo irrelevant bate krne ki pdi hai.. Are you educated? Or I should say intellectual in any sense? I seriously doubt that because the way you express yourself is really ridiculous! Or maybe you, as a human, are ridiculous.", "rishxp": "Yaay she liked my comment @redheadwayfarer I love you so much!! Please check my DM I once wrote something... Please..if you get time...", "tahsanmd131": "fuck", "vishal.singh_": "Swollen lips", "iamanamsheikh": "If you're supporting and take stand for women then why you exposing your self in a badly🤔 Miss @redheadwayfarer remember \"Malala Yusuf Afzai\" she also support & takes stand for women n their rights but she never exposing her self!!☺when you're doing something good for society thn exposing is not important. Its just my opinion otherwise you're good!! Hope you will got it..", "born_ruler_": "And saloni we ( ur team will) and always willing to change this INDIAn society very few like u talk about this topic lady ! But please be safe from ur fuckin haters they will misuse take undue advantage of this pic yar u can understand what Iam Telling it's just to tell u that please have a safety not to offend u ( shortcut Mai bola h samaj Jana )", "sohani__": "@shivanixiii who’s?", "sumit_savadi": "A women is not written in Braille.You don’t have to touch her to know her.. @redheadwayfarer", "shamxdwi": "QUEEN", "ryanreaperx": "Men should respect women ...", "baefikar_02": "Okay. So I accept that you are spreading feminism but what's the necessity of showing your body to do so? Is it so important for a woman to wear these dresses or expose her body to look beautiful. Isn't a girl who wears simple jeans and top also beautiful? I definitely do not support the fact that rape cases are due to the kind of clothing a woman wears but whats the harm in wearing simple clothes like a salwar or jeans top. I don't really think that exposing ones body is so important to promote feminism.", "ishiitaaa___": "Dude it's not wrong but it's India. Not everyone had the same thinking right? You feel me? You've got to understand how people are here in India! Here women are treated as a sex toy and wearing shorts dresses and walking nude are two different things man. @Chan_ch", "kamrankami7151": "Sososo sweet", "rk.saxena.5477": "I love you", "debayandd": "Bdw this is feminism? 😂😂😂😂😂", "being.classy_": "Amazing pic", "bruh.ngl0": "It's sad to see people abusing and judging her.", "hemant668": "@sumit_kr_kapri 😂😂 bro", "kandpaldpk": "फ्रीडम का मतलब अंग प्रदशर्न कबसे होने लगा", "aa.6k": "NICE", "rudypratapsingh": "Haawt haawt!!❤❤ People really Look after u!❤ u Miss r an Inspiration to the SOCIETY😍😍 Hats Off to u!!😎 Really proud of u!!😘 Keep it up!😍 DAB on the Haters!!😉❤", "mdix1611": "I love you saloni.. Thanku so much uh wrote this.. I wanted this badly.. Surely I'm gonna make my mother to go through ur this piece of work.. Absolutely commendable", "navy1913": "WoW 😮 😯 end feeling beauty 👌👌👌👌😍", "queen_of_roy_mansion": "Commendable", "goblet_of_gains": "Tsk tsk tsk", "_vishnuvnair": "That's really bold! One need guts to put up a picture like that, and talk. You make sense. Probably people don't take it in the same way, but I am sure the message you wanted to share has reached out to them. Men always do look at women, no matter her body is fully covered, or less, it's just there mindset. You can't just change it overnight. There no end to this, at least I don't see an end to this. Girls do need to react, defend themselves. You have been told that your weak, but that's not true. You should start fighting, don't just take the pain.", "insha_nahid": "@redheadwayfarer Thankyou so much for such inspiring words. ❤ every women should think like you. ❤", "pulak300": "😍😍😍 I like it..😍😍😍", "travelwithrani_": "👌👏👏👏👏👏👏👏", "mayanksharma.ind": "@salil6907 😂😂😂😂", "rituajwani": "@imarufqureshi Disgusting! 😐 you know what because of you people we are not getting the freedom we want.. I want to say you that if you don't like her or her posts then please do a favour unfollow her..!", "fungshonal": "One word. B O L D @redheadwayfarer 🕶", "rooseville_films": "If u believe in freedom then set ur boobs free and show us.", "_.n.i.v.i._": "@redheadwayfarer ...in love with ur captions😍", "01bella_": "@sheril_sjk @andrea_fernandes25 @araflatoon", "sarang0075": "Very well said!!", "p00lisma_": "@redheadwayfarer you go girl! India is so blessed to have ya. Never stop fighting and inspiring. ♥️", "_maya_783": "I love you @redheadwayfarer 😘😘", "almostfammous": "❤👍", "kittysanjna03": "Brought all these issues so beautifully ❤👌", "diggaj_vyas": "There are still a lot of us who haven’t joined the debate going on about these photos of Saloni @redheadwayfarer , see the thing is, it’s complete normal and mandatory to let everybody do whatever they want to do and let everybody choose whatever attire they want to wear, this is a mere definition of democracy and doesn’t it feel right to enjoy equal rights? It’s high time that we should consider this “normal” and rest the hatred/demons which dwell inside us and “live and let live”.", "saturn_garnet": "This is powerful... And so true...the rights that are given to women are only on paper...the real situation is so much worse... The worst thing is that when something happens its always the girl's fault... Society has this way of painting you as a whore...that is what I hate the most...women need to stand together and support each other ...in good times and bad.", "samiksha_4": "100% agree to your caption. It is freedom in true sense!", "shriyavaidya28": "@__mama.was.a.hippie__", "amarmishra811": "Inspired by your thoughts...may every daughter of our country feel d freedom", "lelin._.mohanty": "The best word to describe this awesomeness. Perfect. 🙏", "smurf_atina": "Freedom doesn't mean showing ur boobs!n", "sudheerkk1": "Hi your are thought are right", "ritikagurnani101": "i wish someday our parents will deeply think on this issue......you write in such a beautiful way girl🙌🏼", "thegreen_chandelier": "Caption .....tremendous", "boobsoverbutt": "Appreciating the post!👍💐", "browneyed.panda": "Such powerful words! Saloni, I, and thousands of other girls aspire to be like you. Thank you, for speaking out our minds.", "happy_mitu88": "...saloni...as same u...in bb11 arshi khan is saying all these but some morons. ....just abusing her .....a girl shpuld do whatever she want to do....it is really a \"freedom\"....plz gv me a rply whn u see", "sonder04": "May I ask why your image is so heavily air brushed? Isn't that adding to the body issues of young girls that you passionately speak for? I agree with most if what you say but find it disappointing when someone like you doesn't walk the talk. It's far more dangerous because people trust you.", "pallavnadiadwala": "👸💪👍👌 @redheadwayfarer", "vintage_grace_shower": "You nailed it girl😘", "har_i.s.h": "😍😍😍😍😍", "anikate_monish": "Ur looking too much cute btw 😍😍😍😍😍😍", "kishansharma__": "You need to change the way of describing or sharing your feelings.... shity minds....are not really giving a fuck...to your typed content but everyone..is busy in judging the pic....ik that's what you want to change...the JUDGEMENTS...but for now society won't understand the reality this...way....just like you can't explain a killer....why killing is bad....by killing his or her close...one...the way of change....is not always the way we assume.. @redheadwayfarer ..👐", "piya_1502": "❤@redheadwayfarer", "ms_weirdoo_": "U nd Ur words are love ❤️ @redheadwayfarer", "singh_abhishek992": "Correct", "rawatsaab99": "🙏🙏🙏🙏🙏🙏🙏🙏😍😍😍😍😍😍😍😍 ur words", "_crankyallthetime_": "Ur writings are inspiration.. 😁😇", "aaqibmajeed007": "I love u", "aashanarealme": "Agree 👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻", "sxiishtayy": "This is such a powerful piece of writing! I am so impressed by this and YOU! This is the actual thought of every woman of this country. Like every girl, I want this. I want to be able to do what's right for me. I am so intrigued by this and I can't explain. You slay girl, you slay!", "swarnshri": "This is not the correct way to show freedom. Why always exposing body equals freedom..why not freedom is judged on education.. power... individuality ..?", "amitsingham077": "Kaya bakwassssss hay tum indian ho dear", "iamrisharajput_": "Wow", "sah_bhy": "I neva commntd ur posts bt u know wt dis post deserves salute mam n coz u said ech n evry thing some bustards do with no shame. N ys freedom is men n women having equal thinking bout ech odr... Love u sty blessed dear.", "chill_boog": "D write up 👌👌👌", "kai_graffiti": "Sugar skull bae😍", "asliswatz": "@redheadwayfarer Saloni I understand your opinion and your words.. being a girl but being a middle class girl and being traveling in public transports in odd timings it’ll be difficult to me to make understand others my opinion. They’re illiterate and they won’t understand this. In a city where I live they are not even open minded still. They think these clothes n these things provoked them to rape a girl. Try to understand my point, Don’t make your body a art to exhibit", "humera_123truly": "@simran_kindra", "stubborn_yadav": "Ek yhi dress h jb dekho isi m pose", "shibani20502": "Word dayum", "nareshhh_09_": "Girl power is best power to control the mind as #boy 💪💪💪💪", "i_prabhatchaurasiya": "Fuck feminazis😲", "p.a.l.a.k_._": "@smittyoh i know 😂", "rohitsingh2012": "Nice", "aman_svt": "You think unloading pics like this will change things.", "aishwarylakhlanii": "I think She is brave enough that she can think in a much better way & accpt your hate in a positive way & get motivated 🙂 bruh.. Have u read the caption below?", "kaju_897": "In Love with this caption😍 @redheadwayfarer", "salil0786": "@kmayanksharma rajat sai hai maye😂😂😂😂", "paapkojalakerakhkardunga": "*Sighs*...amazing work❤", "arghya_13": "@piyush_rahi if a guy expose then its ok, he's a stud but if a girl does the same thing hen she needs to be raped?? It is because of this sick mentality of guys like you that women are not safe in India. Look at your thinking. Just because she's a girl she has to be this and she has to do that. Just because she's a girl you and society will impose such things on her. What kind of sick mentality is that?", "i.am.hrithikoswal": "Slay ♥️", "simran_kindra": "I don't care about what you think. @princess_hummz your mindset is tooo stoop.", "_m_npn": "Half of these comments are not reading the words but analysing the shit outnof the picture! What's the big deal about it?", "cynthiacardozz": "I Love you n ur writings❤", "rohit_verma6798": "I love u", "tejalmohite": "Everytime i read your caption reading comments tells me how far we've yet to go..@redheadwayfarer", "ppsytrance": "Nice curves😍😘", "alizr2288": "All the girls who r appreciating this thought none of them have guts to wear this kinnda dress & go out.", "ritu2564": "Yaaar I just love uhhh...u r thoughts", "sahilsingh7721": "Sexy", "amiti_thakur": "💟💟💟💟", "debangshumufc": "@the_vibe_killer_ pffffff HAHAHAHAAHHAHAHAHA", "swetavira": "Ahhh... I breath freedom while reading your thoughts.....thanks a ton for this feeling..... 😍♥️", "mr_fickle_minded_": "for all the girls 😂😂 Who are appreciating her or want like to be @redheadwayfarer . So whats the problem ? start that fucking revolution .girls with no bra. noone gonna stoping you. then maybe its easy to stare tits 😂😂😂 Hahahaha. And please if anyone urge or willing want to reply on this thn please dont write that fuckin words . \"ghr pe maa bhen \" blah blah........say to me anything ........no offence ☺", "dreamy_lil_bastard": "This is soo stupid damn .", "sharma.aakriti421": "Hey Saloni u r an inspiration for so many girls...Through ur posts u share the feelings of all girls.", "_mountain_fish": "Beautifully written. It definitely expreses how I feel about this world.", "21__sim": "If i were t-shirt with no bra than everybody gonna judge me my character & they will stalk my boobs which make me demotivate & uncomfortable so still there is no freedom", "_ershad_shaikh_": "@sushmita_grg01 yeah", "shadow_king_2211": "Lund chose chose k kesi shakal bani li hai..", "raghav101": "@redheadwayfarer Freedom is when u don't need a 1000 words caption to justify your picture", "rakesh12m": "Hmm😜", "boshonter_kulfi": "You are my inspiration in real life. I sometimes face such horrible things that I can't find anything to live by again but you know what, your lines keep me away from the second thoughts constantly trying to push me down, keep me sinking. This happened once that I was almost dying inside after an incident but then I started following you and went through every post, every line you wrote about US. I have no idea about where did I find you. Actually after watching girls on top, I became your fan but I didn't remember your name clearly but somehow I managed to get you. And after reading your phrases, I got inspiration and strength and from that day, trust me I have begun to fight back. I don't keep quiet anymore and you are the reason behind me living my life this beautifully again. Thank you. Thank you for being whoever you are. You have got a really big heart. Do not stop inspiring people with your words. Thank you for everything. ❤️", "sundaramguptaa": "@sweet_poison_me checkout this", "___falguni___": "❤❤", "ps_06_19": "Very well said👍👌👌👌", "mohdshakeb94": "Hehehe yes ur correct because ur lesbian", "sourab2457": "Proud wali comnt God bless u", "sharenpuri": "So....damm....❤cool....ones who r jealous...will only...resist..it", "neha._patil._": "And discriminating just because we r female are not real men....", "being._.dusky": "and I suppose, by freedom you meant showing off your assets. sheer feminism. and you will be the first one to blame male society for being dominant and rude.. \"slow claps\"", "aditi_parmar3": "Great work di😘❤️", "a_naut": "Actually... I think when it comes about equality and freedom to live (woman) I think first step for that should be start from first school i.e. Home....... If our parents give you freedom to choose... Whatever, where ever you want girl or boy.... And also when our parents treat us (girl and boy) equally...... Then it starts changing............ This must be the least but important step", "rahuly_rahul": "Liked your words..", "relishaa": "Girl you know you're doing everything right... You're an inspiration to those girls out there...YOU ARE SIMPLY AMAZING @redheadwayfarer ❤❤ just love and support for you❤❤", "raginicampion": "@redheadwayfarer you realize you get like some 10,000 comments and i cant find the one you tagged me in right? 😂😂😂 needle in a haystack!", "ilu_vishwanath_kushwaha_": "✌👌", "greeshma.appaji": "I can't stop reading it over n over!! 👏👏 very well said", "sanjeev0999": "I completely agree with u redheadwayfarer", "_surbhiii": "@redheadwayfarer 💗", "brain_independent_bird": "Ppaaa cork ball", "mr_sahil_37": "Keep inspiring other @redheadwayfarer", "leon_a3100": "The \"visually raped\" one has to apply to both genders, is it ok for a woman to stare at a guy creepily. People will laugh if i tell them that a girl has \"visually raped\" me.", "bhumzee_9": "Very well said", "poulomi_99": "@madsymphony_ read this!", "tiyashakrishnatrey": "This post is just so fucking important I cannot stress this enough ❤", "mansijain3334": "U wrote my heart down . You inspire me so much.Love you and keep writing and don't listen to negative comments ❤", "harshita__sahay": "@redheadwayfarer... You know what..... I love you😘😘😘", "pki7892": "Good freedom speech", "__ishii._": "U have a clean thoughts and a pure soul...#inspiringwoman", "eramrazzak": "Ignore all stupid comments u look like free bird 🐦", "karam_just": "cuteness overloaded..!!", "24k__boy_": "Overlord of cuteness @redheadwayfarer", "___priyankaaaa__": "Your thoughts are tooo good n even the pics . U r too good . I love u #inspiringgirl for youth", "siddhi0101": "@muaji45 Thanks man. Thanks. Otherwise we wouldn't know that rape is OUR fault and you say that in this so called Democratic country. A man being enticed seeing a woman is still our fault. And please let us know the right time and place to wear.", "riyaa_mayekar": "You go girl❤️", "samiya_.j": "This is where feminism goes wrong", "wordsthatineversaid": "Stop body shaming ❌ What is the first thing that crosses our mind when we say ‘body’? Colour, shape, size, curves, sexy, ugly and hundreds of others adjectives that appear gaudy.  We’d all be lying if we said identity, individualism, personality,  But the truth lies in the lie itself, that’s reality.  Your Body is Yours ONLY. It has singular ownership.  It’s what makes you different from everyone else, so why do you want to try and make someone else the captain of your own ship?  You’re the creator and the destroyer of your own storms.  Why do you want to lose that ownership and dilute yourself in a sea of stereotypes and socially acceptable norms?  People associate body with beauty too, not realizing that beauty surpasses the colour, shape and size of the body, it’s much deeper;  It’s analogous to the treasure that drowns in an ocean. It’s always found on the sea bed, shining brightest, a keeper. Beauty pageants are slowly modifying the definition of beauty, embracing real beauty instead of external appearances, if you think you are comfortable in your own skin,  Exult confidence and self-esteem in whatever you do and say, and you are the epitome of beauty. You are worthy of winning every beauty pageant there is to win.  Make your body yours only. Start rejoicing your individuality, be the person you were when you took birth;  Raw and pure, be yourself, be beautiful, know your worth. Follow @wordsthatineversaid for more!", "aslam3455": "Kya ada h 😍", "_.aarzoopathan": "Freedom is someday grow up and do all crazy things 😍😍😍😍😍😍😍 and you inspired me a lot 😍", "anirbanchak": "Freedom is when law ACTS", "sheetal_maru_": "U r great yrr superb everyone knows that thinks but no.1 apply 😍", "bindhu_purushothaman": "Yey gal 💪💪", "dharitriidesai": "It's just a body party. Why don't people get that!", "the__indisputable": "You are doing everything for girls. You are being dishonored yourself for their freedom . But as soon as I read the comments of your posts then I felt that some girls are against you . So far I have noticed that you are dishonoring by a girl for this post. This is irrelevant. Shame on girls who are saying bad words to u . But we know u and believe in you. God bless @redheadwayfarer", "kavyadayanandgowda": "Hats off to your thoughts @redheadwayfarer 😍😇 #respect", "mangam.chandu": "👌👌", "muskankhuranaaa": "You're an inspiration to thousands. It feels so great to read you. Hats off.", "_nia_2901": "@_____megh______ just read this .... She is an inspiration ...", "22tithi": "Hmm those are the serious issues... Really they are and thank you for setting this example again and again... There is no limit being boldly beautiful... But for me... Freedom is whenever and wherever I can open up myself being the most, the most weird and ugly... Freedom is the way people accept me for whatever I am except judging and bullying and laughing at me like I am some kind of joker only because I don't feet up into their boxes... Freedom is the way when I can shout out loud saying... Not only me but please please stop objectify people specially when a girl is or bunch of girls are doing to another girl ... If you never let yourself to spread love or empathy... Okk but at least show some respect for whatever she is... I am so sorry.. May be I am far diverted away the topic... But it is also a problem.. Girls like me face everyday, everywhere", "chaithanyagaddam": "I like the way u potrait ur self n ur boldness😙", "elf.ish_heart": "You are the best person ever 😍😍 your writing, thoughts.. All that is needed in this country especially.. gives me strength for my decisions.. thank u soo much for being an amazing inspiration ♥️♥️", "akarshkasture": "Besharam", "daffeyyyyy": "The caption gave me chills😭❤", "marpuraj": "Awwssm", "shilpe.e": "@owais1454 pehle apna language sudhar fir dusro ki batein sudharna", "jhha008": "Wow! Excellent pose & great attire 👍 keep it up !", "flexfarhan": "❤️❤️❤️", "sumitbirla01": "Hey your thoughts are really admirable 😘❤️❤️", "diksha_menon": "💜", "seemapatil95": "You sketched out a girl's definition of 'Freedom' ♥️", "1995kilo": "Listen to BTS' songs/lyrics for awesome comeback examples 😬 (turn on the caption while watching/listening) oh, and, YOU. DO. YOU. haters gonna hate.", "cony_qs": "Freedom is fine, free to wear but certain things of women body are not meant for freedom ..exposing them only reflects losing own respect ! Woman is unique ~ understand not everything is for everyone . 👸🏻", "thecrewlife737": "Guys what's with all this hate man? I don't get it? If her tits or her cleavage offends you so much? Why don't you just stop looking at it? Agreed you have your own opinion on things but no one is asking you for it? It's her Instagram account, it's her life, it's her cleavage, it's her choice and she can decide to do whatever she wants with it. Yall say shit like this makes you vulnerable for rape? Well girls wearing burkas and get raped too. Y'all need to change your mentality man. And if you can't? Then scroll the fuck on or just unfollow - Sincerely Every person in their right mind.", "ripon3324": "Nice........ Boob's......... . 😨😨😨😨", "debaleena_bhattacharya": "ma'am ur words are damn true..we really want to work on these issues and get rid of them by ourselves...There are people(men and a great section of women too) who will demean the women and will never come out of these thoughts..we can come out of these by changing our thoughts and standing by each other's side..u r an inspiration😍.love❤️❤️❤️", "pragkaushik.pk": "Uh n ur words 👌👌#slayer @redheadwayfarer", "ankit_raychandra": "If you feel being naked gives you freedom them stop wearing at all 😒😒😒", "karan_kular": "@xxnidhixx if you had some sense..you'd realize that people do it bcoz of lack of public toilets which is not a gender issue.maybe people in ur family do it in public for fun but where i live,it only happens because of lack of toilets availability.and do u even know that women living in rural areas also have to do it in public.", "gopalrahul9": "More!", "sakshi_sarcasm_shukla": "Heartfelt 💛💛💛 you've said all of it . I felt so good after reading this like literally having goosebumps kinda feeling that's what I feel every single time when I read your captions 💌i feel inspired❣ I feel GOOD❣ How people are appreciating this is ammmazing💟 but at the same time i don't understand how so many of them don't even realise the importance of this 👀 like seriously such fucktards", "ar.surajkr": "@redheadwayfarer hot....", "tobin_thomas7": "Killah pic...Loved it", "priyanka_phapale_": "💙", "vinaya_sapre": "👌👌👌", "harsimranchaak": "its ur lyf dear azaad panchi ki trah raho udte raho log dekhte rhege baate krte rhege 👍👍👐👐", "vishalssssss": "@guri_dheer", "melissaraisin_15": "@gordanvictorcoelho", "the.bong.dude": "The caption & the photo. . 👌👌👌❤", "zoom_666_666": "More freedom", "itz_me_shiiii": "Damn true.....my body my choice.....😘", "sanju__uu": "Why wearing anything then", "ashleysingh_svet": "@redheadwayfarer I hope atleast your words reach to the heads of the nasty society and they get to change their mindsets . ✌", "roidzilla_": "Hats off sis 👐👏", "sgs_maths_wale": "That's so true !!! True meaning of freedom for a woman. She has her own way of expressing her view on freedom and i respect that.", "tgzoku": "Superb 😍👌 @redheadwayfarer", "mr._beast_": "LooKs like Revolution has started for change @redheadwayfarer", "shyamsbhati": "prepossessing 😎 Not from Look From words 😘 @redheadwayfarer", "i_ish_a": "🙏🙏🙏🙏🙏", "runjhun25_03": "I love what you do n say!!!!....big big big big fan of urs❤️", "bhanupriya_sehrawat20": "U know what logon ko sirf ek baat samjhana itna mushkil hai ki freedom kya hai.... Freedom ka matlab hi samajh nahi aata inhe.... Bas 2 words pakad liye hain nipples or clothes .... Yeh nahi samjhenge ki aap kehna kya chahrhe ho inhe bas yeh hai ki nipple dikha do apne bhai tere paas bhi hain 2 hain apne dekh na yaar ... Vo ye kehna chah rahi hain ki mujhe freedom chaiye jo mera dil kahe vo karne ko ... Nahi inko to aapki baaki ki body dekhni hai... Yeh nahi samjhenge ki aap kya kehrhe ho inke paas bheja nahi hai bas muh ha jo gandagi fekta hai ...", "tasnia.iqbal": "Nudity is not a definition of freedom 😑😑", "poojithajetty": "👏👏👏", "tejal_ishi": "Babe.. you slay ❤ ..your words are literally magic", "_deepak_kumar0": "What you want to prove . This pic", "_tisha__03_01": "Hats off girl....", "rahulrajput06": "Hottness🔥Most prettiest Picture I have ever seen🔥👑❤ @redheadwayfarer", "virendra7053": "Nice", "kaiwan_abadan": "❤❤", "rahul_mecwan_143": "@redheadwayfarer Great Throught But Our Society Will Never understand That Thing.. Keep It Up....#freedom_to_live_independently_in_our_country 👍👍👍👍", "that.crazy.head_": "Ma'am this is awesome .....u write so well.......as i read your caption...i feel lyk someone is still alive for femenism.......n after reading your caption it feels so good😍 !! I mean lyk u r best......i lov your writings.......💕 please never stop....!! We all are with you ! I SUPPORT YOU ! 🙌 ........i share you posts to my friends as they will also read your captions....they all says dat u r great ......😊.......n this stage were u r standing is not very easy to stand......so go on...!! N keep motivating us....! 😘 LOVE YOU!", "gauri_lp": "This whole series of posts is perfection. ❤", "_beingevil_": "U got Time to write that much", "naveed.lambe": "I like ur message . Br free be gentel ... its ur human right to be free in this world and any other known world... Being Free means u have a right to do and live ur life on ur own rules or no rules... Love", "nidhi_singh87": "I stand with each and every word of this caption . You are an inspiration to me.🙂", "saurabhkdxb": "Welll articulated... but every time i read it made me ask myself? What will be the cost of freedom? Still searching for mine and accounting for it...", "cybs_01": "Not allowed to receive or place a call at night and sitting out in open air by night time -parents+neighbours decision while their own (neighbours)son can...reason he's a boy and I'm a girl🙅", "raagmusic_": "@saaya_stone eaaah whteva🖕😂", "manya_aroraa": "Well described ✌🤗", "_ethereal_soul_": "You give me goosebumps 😶", "aryanpate04": "Woww", "singharjun1911": "Hollywood typ photography👍 nice...", "sachinout99": "Perfect boobs shape 👍👌", "rythym_life": "@redheadwayfarer well i truly appreciate your sense of freedom and freedom of things we girls need to understand but more importantly its this society that needs to view our freedom from a broader prospective and i admire the way you are...not all girls share their bit of courage flamboyantly to this world and trust me not every human will take your courage, rather they would act outrageously...so u go girl..🤗", "d_h_e_e_r_a_j9": "Looking so pretty hot", "akash_b_07": "✌", "harishmandlik7": "You know how to face problems", "parthk_08": "Why are u showing to us 😭, u have freedom but", "junupriya_": "oooh god this gal", "iamrahulmali": "Respect", "theyellow.kolhapuri": "I heart you @redheadwayfarer ❤❤❤❤❤", "miss_aishwarya": "My mom always says that it will never change.. the way they look at us. It will never change so better is to change ourselves to change our dressing sense because we are only responsible for our own safety .. I totally disagree on the thought of changing dressing sense but she's right on the point of safety.. I don't know how to make my mom understand that it is not going to change but I don't have to change my dressing sense for that.. we just want that much of freedom that we don't think twice before we get out of home and get visually raped.. I totally agree with all your posts.. I wish even if one man can understand with each one of ur post.. it will bring a big change! Good work keep it up! Love u❤", "simisandhu992": "Ur writings literally bring out goosebumps ma'am @redheadwayfarer .. U write sooo well, n it is sooo inspiring, that it can inspire someone in one go.. I love reading ur posts, wenever i come online, i always check ur profile, if u have posted something new..I am so so soo proud of what u r, what u write😇😇Thanks for being such a motivation..keep writing, keep inspiring, keep motivating @redheadwayfarer #respect 😄🙏 Lysm💗", "shobhitjain_": "@redheadwayfarer your thoughts are amazing, abuse of power is high in India.", "sharonsimpson17": "Abhi ke time mein Indian ladko ko jitni freedom Hain, a western 'white guy' can only dream of it. India is truly a 'Man's paradise'.", "abiii.naya": "Well said 👏👏", "rima11235": "Freedom rocks", "keziah_zee": "❤❤", "sdm_king_jaani": "#life_😇😇😇😇", "rishabh_27_": "More power to you @redheadwayfarer and i hope things will change... You can't change the mentality of people i wish more youngsters and kids grow up to be better human than we have now..", "santosh_darne_": "@redheadwayfarer when you have Choices , there you don't have Freedom ! Saloni please do watch this video https://youtu.be/3v1PY5eQDbw", "thekunal91x": "u slay girl... ur words r just awesome luvd it hats off to u", "maqbool.sasoli": "Masha Allah 😍", "himangeee": "❤️", "sunetra_03": "For the people who couldn't understand the gist of this post and calling it fake feminism or whatsoever, she is just describing a Utopian (idealistic) version of what freedom should be like! So obviously all the negative comments are just supporting her argument here, And it further proves the point why it is a social necessity!", "vikasyadav_007": "Caption!!!!!", "nishant_rajawat": "@redheadwayfarer When i was looking for a platform to express my views and thoughts to society, you became that platform so that i also can change some people's mentality about the shit they talk about women. Thanks ✌️. ️Hats Off. LOTS OF LOVE❤️. You got more well wishers of yourself then bad ones. ✌️", "anjalisharma_x": "Bravo!", "crochetnow.in": "I love the way how you expressed each and every single thought that hurts a woman with regard to freedom and that looks very normal to most of the human beings on this earth!!!", "aminomkar": "Sexy click", "rajnishhayaran9450": "wow", "sahana_devang": "We don't even let our mind to think this..but you make us to @redheadwayfarer 😘 As soon we read it .. it goes.. Yess! Yess!! Yess!!! Conclusion is lit! 👏 yess we don't want solutions for safety!!", "hannu_pandey": "@redheadwayfarer ..bawa sch bolu to me tumse turant sadi kr leta..bt ufsos..me brojgar hu aur umar me chota bhi😂", "_shaikroshni_": "You be an inspiration! More power to you!👌👌👏👏", "insta_amitkumar": "But she is make an ass of oneself", "shradha_baligar": "I sometimes really feel no matter what some poverts will never change", "shantanug28": "^Nevertheless its her own choice what to wear or post but JUST my opinion on expressing feminism.", "insane.n.happy": "You are such an inspiring person.💞 Hats off to you man for writing such posts ! 🙌 you're just AMAZING 💪💪AND THE WAY YOU WRITE.❤️❤️", "gargakash9999": "Waooooo outstanding balance", "callravi": "♥", "chaureneha": "@redheadwayfarer ... oh how beautifully u have given so many definitions to one word “Freedom”. Such a beautiful note, so much to make out of it, and so many emotions stirred right now in my heart. Ur posts inspire me and mould me into a stronger person every passing day. U go girl. Inspire, build, educate and liberate with your beautiful and strong thoughts, words and deeds. More power to U.", "sushie_mushie": "You're amazing ❤️", "official_rajbirsingh": "🙈🙈😊😊", "vikrammehta934": "Superb beautiful", "pratyushranjan52": "Ye sala khush ho raha hai ki iska name story mai aaya hai...abe tera bezzati hua hai...khush mat ho...😅😅", "bafila92": "I think red head ke parents aur relatives bhi dekh rahe honge ye", "nikhila.d": "@insta_amitkumar ,as she has always been saying, it depends upon her comfort as to what she wants to wear. If she isn't comfortable being naked, who the fuck are you to ask her to go naked? Why would she do that if she ain't comfortable with it? At least now, get the point straight in your head.", "kshitij.coolbreeze": "Beautifully Said ✌", "__duskyy": "she (vani K) just look like you and your lips though🖤", "yaman_srinivas": "Being able to speak my own language, listen to the songs I want to, being able to go where I'd want to as long as it's possible. \"Freedom\" has lost it's essence and it's value. For whatever is written, I'd simply say that it's what you want, and it's no-where near freedom. It's simply demands of this generation, what you talk about is independence, not freedom.", "zinilahi": "You are right but there are some limits for everyone 😊", "tinamytra": "@redheadwayfarer Love. Your posts are the most beautiful posts ever with speechless captions. You just rock girl. From the day I started watching girls on top, was the time I started following you. In one sentence “ Best pictures with relevant and best captions \" #MyIdealForEternity ❤", "sharma_yolo": "@redheadwayfarer I jst love how beautifully you write and present your thoughts. I admire you for all the efforts you put into your writing and motivating so many of us. More power to you, keep rocking 👏🏼✌🏻", "decode_datherine": "Then i believe , I still have to struggle for my freedom because I am still tied down.", "zaksheikh18": "Ek dum sahi 👍🏻", "rush_me191": "U r divine👏......", "rajendra9114": "O wow", "smritikehal": "Thats so true ❤ totally agree @redheadwayfarer ! #bestinspirationever", "aakash_.patel": "Inspiration for us... jb koi ladki itna kuch kr skti h to hm to ladke h hme b kuch krna chahiye... guts hone chahiye apke jaise hats off ❤️❤️❤️", "ramya_deepthi": "Awsum", "mohd.arif999": "Looking cool", "globetrotter_si": "Freedom is simply me being able to remain me :) @redheadwayfarer", "i_am_magicall": "❤️", "kyabla": "it's hard to change mentality in a day ...keep going grl ...bless u", "thealiferousgirl": "You’re just amazing.", "lokeish_25": "Perfect 👌", "bczidontgiveafuck": "I so love u ... you r the one inspiring me ... ❤️❤️... i love the way you love yourself ... the way you portray yourself ... this is amazing ... 😍😍", "aku_sahni": "Watever you said in the post i too want that but can you step out without a bra as the famous quote says be the change you want to see in the world?", "avengers7777": "Wow", "simran_singh_03": "Incredibly written 🙏 hats off 🙌", "prashant_gaonkar": "Strong message.....", "shaneazam_": "Sub freedom kyun?", "jacksparrow.persia": "Don't give too Much explanation fuck what people think about girls clothes u r free to live", "shalini_tiwari2505": "👍", "apretentioususername": "@redheadwayfarer hats off! Even my mom is a big fan of yours❤️❤️", "_sassysha_": "Dude, how are we to go about this? The society is still the same. Our very own generation is still the same, leave alone the older generations. What are your ideas on bringing about 'the change'? @redheadwayfarer", "ronita___": "Damn that body😘😘😘", "imzayanmalik": "So soso so cute"}