{"baqer1010": "روعة", "shaaayra__sayyed2001": "Do u know what u wear", "pranav_pai": "Feminists will claim that women can wear what they want...but if a woman in a magazine or a Bollywood trailer wears revealing clothes then it's inappropriate and needs to change.The hypocrisy is amusing", "_dwip_": "Too sexy you ar but your boobs ar big and good i want to touch your boobs", "vipinpratap_": "Nice babs", "manvilove": "@pokinawa", "ashvipathania712": "@redheadwayfarer mam you do magic with your words your thoughts your whole personality is an inspiration The reason i still believe in humanity is u", "shreshth.dutta": "How you got that cloud on head. So coool", "siddharth221080": "😘", "vishal_biswas22": "Useless attention seeking whore", "aman_alpuria": "🔥🔥🔥🔥😍", "bensonsandbullets": "@damon_197", "lucifer_morningstar_619": "@redheadwayfarer dare u not this is feminism...girl get a life....showing a girls breast is not feminism i respct evrywomn and i suppurt gender equality but wat u r trying 2 portray is wrong u must use ur head that knwing that u r a public figure young generation follows u n u should set exmple n should inspire people not like this....u should have some sense showing ur hlf breast in d name of feminism is pathetic.....no parents or any one would allow thre luved ones 2 roam hlf naked in d streets or anywhre in d name of feminism...maybe ur upbringing is like that but not evryones so think before posting.....thnq", "zain______5239": "Nice girl saloni", "batbogey_butterbeer": "@prithvi.k", "_sen__007": "😍😍😘😘", "nikesh_shah_19": "@redheadwayfarer baby I want to eat you like a hungry dog for days and nights aaahhh", "naatzzzz": "🔥🔥🔥🔥🔥", "aaishaasingh": "Nice boobs", "maneeshsaggar": "Show ur complete nude boobs", "shk_hulk": "Woww😍😍", "forever_yoursssssssssssssss": "Beautiful Goddess", "sabittisekar": "Really good stuff @zainaliphotography", "devikkaa_": "❤", "himsxwolfie": "You can cuz uh hv reached to a place where uh can do things u want to but it is not possible for everyone in india 😑", "photos_by_darshan": "Beautiful caption! Thanks to @homegrownin that I got to read it today. 🙏", "neero_theblack_mastif": "@theadventuresofasocialmisfit ohh were u born with 32set of teeth ?were u born with pubic hair?were u born with an understanding of a mature 18 yr old girl? Were u?", "lamiashahdat": "I never thought I'd see such comments for a girl from a girl.. Like seriously?", "choudhury.rajesh": "🔥🔥🔥", "iamstyloshop": "Hi mam this is abhishek here from mumbai.. Liked ur profile n pics too @redheadwayfarer", "indian566": "Beautiful figure", "stars_vhf": "❤❤❤❤❤💋", "jilebie": "That attitude is needed more@redheadwayfarer", "amanojhaliquid": "boobos 😘", "nikitha.za": "Honey you are awesome and weird and that's your style.. Completely in love with your 'i don't care' nature and that's what most of girls are missing today ... Keep going ❤❤", "sonalichaudary": "Now thats hot", "byadnnn": "I love what you write ❤ @redheadwayfarer Much love keep going🌸", "ashu_shukla4": "Hot and beautiful", "kingkhan_king": "So hot", "azmeerafshani": "Lover u", "ankyyyyy": "You are not the liability, is the perfect line.... to describe human.... do what u want but not underpressure...", "poems_and_clicks": "@brobdingnagian_dreams love this one", "kbkhaderbasha": "Lovely looking so sexy image", "diljot_bhatti": "Looking Sooo hot 😍😍😍😍😍", "super_cabbalistic_girl": "👏👏👏👏👏👏👏", "rishabh_27_": "All your points are true.... !! U know if Men really start acting like MEN there won't be any rape and no gender issues.. I believe and every men no real men don't abuse,hit, undermine or rape women.. They love,protect and respect.. @redheadwayfarer more power to you i don't follow you tho but stumbled upon your post 😂💯💯✌", "sanju__uu": "Whatever may be the message, but you are hot", "boraupakul": "I wish i could suck and press hard your boobs...just eat my sperm u bitch 😘😘😘😘😍", "rehan786kn": "Tmm jo v hoo mast hoo yrrr", "_sheeba._": "Your hair 😍😍", "sbudhiraja2": "Wrong *", "delicious_vista13": "True", "gaurav_singh1011": "❤🙄", "varunchaudhary1": "Damn @redheadwayfarer", "eggplantsanyasi": "@rohitsinghsg she can put any picture up if she likes it. there's no place for your opinion here. when you went through puberty, did someone hand you a noose and said \" wear this for the rest of your life \". No, right ? it's not a a requirement for women to wear a bra. it's their choice. if she doesn't like a bra, and it makes her uncomfortable, should she spend her life in a room ? did anybody say anything to you when you put up that shirtless picture ? no. but here she puts a picture, with a shirt on, and still, there is criticism. that's the inequality that people like you create. please don't do this. god created women. Man created bras.", "_siddharth_shukla_": "A photo taken by a pro photographer using an expensive ass camera. A woman who confuses nudity with women rights and feminism. She makes moolah of it, we fight amongst ourselves and it does not change sh*t. It is well written and all, but the photo makes no sense, any woman can look gorgeous wearing whatever she wants - a saree looks prettier rather than a top showing a side boob (personal opinion, sorry). Attraction is genetics, if a guy loves the photo for all the wrong reasons then his genes are at play at the end of the day guys are guys. So stop obsessing over the wrong things and come to the issue. Gender oppression is wrong, treat everyone equally. If it was a guy wearing a thong you wouldn't like it so much, would ya?", "bade_sarkar": "🔥🔥🔥🔥🔥🍌", "_pradeep______": "Ohh really....than why should u upload ur naked body pic...😏😏😏", "lakhanraj321": "So hot dear", "kavil_01": "Hey babe😍😍", "arcchhiiee": "🔥", "drxanubhavmishra": "You are looking fab..👍👌", "rashid._21": "Lovely caption...very well said bravo 👏🏻", "1darshana1": "❤❤❤", "maleksaab_": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥💋💋", "meghaarora_ma": "Preach❤❤", "luv__birdzz": "Try 2 Become a Rainbow🌈 in Some1 else's Cloud .. !! 💗 Spread Luv Luv Luv 💗", "premiprateek": "#babelicious👌 @redheadwayfarer", "monalisa9067": "Gorgeous👌", "reality_bite": "👍💐", "sunflower_suhi": "U r the pride of us #girl power❤️✌", "adamyakerketta_india": "Confidence and the words, gem. 😍", "shahoor___ahmed__": "😲😲😲😝😝", "thelazymaniac_": "Beautiful post! Really well written!!", "singhrishav948": "boobs luv those...😘😘😘", "ady.1990": "Awesome ❤️❤️", "selena_gomezea": "#hats... Offff #biggest_fan 😘😘😘@redheadwayfarer", "harsimranchaak": "👍👏", "mcrisgo": "Beautiful 😍😍😍", "_dreamygloss_": "You are such a dumb ass", "anjali8538": "I understand Feminism .. I support freedom, but i don't support vulgarity 🙂", "_aditya_22_": "I wana sleep with u", "_her__idiot_": "@her_idiot__", "krittika_pathak": "❤❤ love the caption ❤❤", "shamitaksha": "absolute", "debasrideb": "In love with this shot. 😍", "vikrantmeradhwal": "Pro feminism jindabaad.....", "outlivingthecosmos": "I love you more than I've ever loved anyone, you're so far yet it feels like you sit somewhere in an empty unreachable corner of my heart", "behudalog": "Caption🌸👌👏👏", "ritu2564": "Stunning n caption👌👌👌", "eshay.y": "Powerful", "traveller_engg": "@whoperryarora what kind of mirror dude, please make clear and bold statement buddy.", "saste_deepak_7483": "Ooooo⚡⚡🔥🔥🔥", "shalin_sa": "😍😍😍😍😍😍😍😍😍😍", "whoperryarora": "@saurabhkolhe sorry ,I am not gettin you, kindly make your statement more clear", "gaithri_guna": "You're so beautiful huns!just love how you potray such positive vibe determination and strength in a women...you've got my support for the longest time!! 😊😘😎👭💪❤💙💚💛💜", "shatakshi.varma": "Ohhh girl in love wid you..😍😍😍😍", "semantimanna": "And there she goes so perfectly...@redheadwayfarer", "chanakya_chatterjee": "Wow", "youseisupertramp": "@redheadwayfarer .....I wish you inspire more free birds like urself.....😊...admirable👌", "gourav_khandelwal__": "🔥🔥hot", "navdeep_dhunna": "I think its completely women's choice whether to wear bra or not! I am a big fan of yours bcoz you dont get bowed down by all the male chauvinist pigs. More power to you and a nipple is a nipple..doesn't matter on whose body it is!", "akshshsbw8282h2uebduevd7eue737": "Thee caption iss soo good💕😭", "chatt_gargee": "Then you should roam around nude!", "entanglednerves": "@whoperryarora you just echoed my thoughts bro", "rudraksshhxx": "I’m absolutely in love with this bold woman making so much sense and breaking stereotypes @tamannasoni605", "nikitha_g_o_w_d_a": "👌", "avisha_kulkarni": "No comments for those guyz they don't even exist fo me ,you r truely adorable n I love you.... 😙😙😙", "yushi_xoxo": "You are amazing and your attitude speaks to all the haters. You go girl 😘", "mr_chef_de_rider": "💙", "dpritze": "U may bring revolution ❤️💯✔️🌹🔥", "aslam3455": "Wow", "hershey_is_here": "Strong💪", "im_harishq": "🤩😵temptation level is uptooo mark😵👌🏻", "parveentomaryarrvelly": "Baby", "denvourambosta": "You are beautiful. You are women. Not Only for your body. You are beautiful for your mind and the amalgamation of all the greatness within it.....to all the perverted creeps going \"get a check up done if you're not aroused you aren't a real man\". I'm a 6.4 feet 106 kg MAN (but that's only biology). And this shouldnt arouse anyone. I'm rather amazed. I'm appreciative of a stand taken against oppression. I'm in awe of the wonders that a women holds. This is a choice. Her choice. If you have a problem. You're supplementing to a society that shames her for having an opinion.for being human. Not only her but all those who define themselves as women. Shame on all of you'll men who think you'll have any sort of claim over another's body. If you think she needs to wear or not wear any sort of clothing then you need to reevaluate what you are thinking. You are the real shame to society.", "sohit.gupta": "Tempting 😈", "shivanir676": "Slay🔥", "byoubbeautiful": "U nailed it girl ❤️🙌🏻", "bs_barkha": "Love uh 😊", "agrawal_vm": "Beautiful", "thanosbaggins": "You can wear whatever you want, but then you can't stop lecherous men from staring at what you're putting out for the world to see. You see, the world isn't a paradise that you imagine it to be mentally. There's nothing caller a utopian society, grow up", "rohit1265h": "U looking hot😘😍", "anizsaha": "I can see your depth of being a human 😜 #bliss", "ankurpatil22": "Be ur self 💕 Luv ur self, keep it up dear 👍🏻📷", "rajput_anni_singh": "U r doing very well saloni mam @redheadwayfarer we r with u cause today only because of u many girls including me also able to talk openly..", "shreedharapurohit": "U look so strong.. @redheadwayfarer ... boss lady 24×7", "bobblehead_meg": "Miss the red-headed you :* @redheadwayfarer", "natasha__57": "U are such a great person ! Every caption of ur's bring goosebumps & are soo deep.. Keep going girl!! We all are with you♥♥♥", "farooq_md__": "Nice one...keep it up", "vikash.mehta.9026121": "👌👌👌👌👌👌 nyc", "trust_me_m__liar_shantz_": "Omg wow", "shreyashekhar7_": "I just love the way you dress", "piya_96": "@supriyaraoooo", "ankita.bhalerao": "You write so well @redheadwayfarer", "vishaltiwari464": "Dm hot", "moranamar555": "💕", "aryanpate04": "Wowsone", "avoided_lyf_buster_": "Hey! Di luking sexy @redheadwayfarer 🙈😘😍", "hoeofslytherin": "Preach it 👏", "shivanganipareek": "@anupatel993 and why are you doing this? To seek attention? And I think you should fuck yourself and look for the exact meaning of feminism. Whatever she's doing atleast she's not uplifting her self to show others down. And language dude. Show your impulse act of whatever somewhere else.", "cheeseolivetacos": "I just love whatever you write. Simply motivating. Whatever you write just touches my heart effortlessly. Just trying to be comfortable in my own skin. The biggest thing I need to really learn from you. Thank you so much for your inspiration ❤️@redheadwayfarer", "lamheee11": "Posting some nude pictures woww", "rajendra9114": "Sexyy", "mehraaddy95": "You look stunning ❤️😍😘", "feisty244": "Yes 💯 ...", "sparshhsagar": "She always relate feminism with nudity ..", "kar_tik7355": "😘😘😘", "mas_lin_": "Waking up to this 😍😍😍 boosted my mood 100 times", "lakshitajain27": "Sooo true 👍👍👍", "best_iranian_tours": "تورهای شادمخصوص تهرانیاوکرجیها", "nofukenway": "@redheadwayfarer while your msg is important and strong, you're missing a few points 1) most girls in India or the rest of the world can't dress the way they want, parents are the 1st ones to object, never mind society.. you may have the freedom to do so and that's great but expecting others to follow the same thing w/o facing consequences is foolhardy. 2) women's biological clock does tick and this isn't an opinion, it's a scientific fact. 3) not being married and feeling wonderful about it is fine but only up to a certain extent. Once all your friends around you are married and busy with family and kids and you are by yourself, you'll start getting the feeling of loneliness. You go to a party or a function alone and you see everyone else with their partners and for an average person, it will have an affect. Bottom line - your lifestyle, your choices, your views may work for you but expecting others to enjoy the same liberty is wishful thinking.", "pratu4513": "U r awsum bt still this society cnt make this", "danishmans": "You are right Saloni 👍🏻👍🏻👍🏻it’s your fucking choices", "vna_parmar": "Beautiful", "anjleena94": "Ryt love you alyaws mam", "akashsingh23": "Few hate her more love her!! But can’t unnotice her!! Bold yet beautiful..", "omkar_shinde_1": "@redheadwayfarer u r too good as u are. simple at times, at times bold. i jst wanna say wen something good is happening there r ppl who wnt to interrupt unnecessarily. it is their hobby. dnt entertain those n u ll save ur time in bringing forwrd wt u r onto. i whole heartedly appreciate ur initiative to change the mentality of such sick ppl still in our society. n also look forward if i cn help u in dat.", "kirti.dasha": "@redheadwayfarer bold and beautiful love your wavy hair 😍", "akash_madan_": "You are becoming my favourite 😉😎 #boldandbeautiful", "agnes_jovitha": "Amazing!!❤💯", "thekunal91x": "ur posts ur caption...... hats off to u... u r simply amazing", "iccha070491": "@redheadwayfarer trust me u r awesome like no one else! Finally there is someone who is giving serious “self goals” to a common girl of India to think what she feels comfortable in! In clothes or no clothes! There are so many girls who must have at least started thinking that she can be comfortable even without a bra or with a transparent top or tunic! This is so deadly essential for every single girl on this planet!!! Thanks for being so courageous & encouraging a common girl! Hopefully one fine day this society will also find it completely ok!!! ✌🏻😊", "manisha_2109": "Ur posts keeps reminding..never stop believing in your own self.. thank u", "nupur_hirani": "You are amazing and inspiring and honestly out of this world. some major love and respect Coming your way! @redheadwayfarer ♥️", "ashrini21": "Respect 💯", "prachitiwari630": "I always respect ur boldness and Always try 2 b one.. one day I ll succeed 2...❣️Miss Beautiful", "tushar__ghildiyal": "😍😍😍😍", "aarti_itraaa": "Respect ❤️👏🏻", "_niikitaaaa_": "♡", "dip_rakde": "Great lines and thought too, I really love to read ur caption 🙋😊 #miss_redheadwayfarer @redheadwayfarer", "fitlicious.de": "Top 👍", "__amysantiago__": "You're the most empowering and respectful woman ever 💜 I can't tell you how much it means to see a fellow feminist standing up to the society and their blatant rules which are ironically made just for women. Perverts and jerks will be everywhere. The people who are criticising you are afraid because they see a woman standing up for herself and her decision. Which is why you will see a lot of people trying to disrespect and disregard what you are trying to say with shitty ass logic. You go girl 💜🔥", "deep_pritwani": "i really love these lines of yours❤️😘nd i appreciate ur dedication towards the change in the society mentality 🙌", "liannegrsham": "That’s just what I needed 2 hear today to stand firm on what I believe for myself. Every now and then I feel the pressure to cave in but your encouraging words today helped more than u know", "aditya_pujarii": "Wish to see you in more web series..asap let's work.!!", "sanjana1990": "I have mixed feelings about this. I stand by ‘free the nipple’ but I feel the long ingrained tradition of patriarchy makes me uncomfortable seeing this post. #internalstruggles", "_s4sam": "💓", "your_bodys_coach": "How do u write such long captions? How? Please tell me🤨😄 @redheadwayfarer", "_singh_bharti": "LoveYou", "travelwithrani_": "👌👌👌👌👌", "lolamartindance": "I really respect you and love the way you think. Thank you for sharing this valuable knowledge 🙏✨", "parnika_gupta": "Left you a DM because here my views will draw attention to all haters and i don't want any hat3 comments on this pic @redheadwayfarer", "arunmohans": "👍👍👍👍👍", "_tanu_0604": "I wish all Ppl have the same mentality for women... U r just amazing.. luv u..😘 @redheadwayfarer", "_maya_783": "I love you.. @redheadwayfarer 😍😍", "poetry_09": "👍👍👍👍 very true...appreciate", "khalid_sheikh786": "💜💜💜You👉 are right✔️➡ 💜💜💜", "_moustachio_98": "@redheadwayfarer hair❤❤💐", "thetamingoftheshru": "GOD WOMAN POWER TO YOU❤️.", "10stkid": "👍👍👍👍infinity likes for that caption💕💕💕😘", "mumtazarshiya": "Beautiful you.. beautiful words ☺️ @redheadwayfarer", "nehil_chug": "Society sucks big time! People are lusty people are negative people are shit! They only puke out negative things and rubbish coz they don't what is being natural and true as they are from fake world! They really don't know how coward they are! Commenting shit about someone's identity is their personal job! You are motivation to many @redheadwayfarer and will always be cos the thoughts you share and the feeling you have, majority doesn't feel and if they do they don't have such guts to be bold! It's your life.. Be you! You are the strength to yourself! God bless", "kishore_jaisinghani": "Nice caption... 👌👌👌", "jainnnnnn_": "Ma'am @redheadwayfarer I totally support you ❤", "sankalp_16": "For all the chutiyas in the comment section , you dont have any the right to say anyone what to wear and what not to. And if you all saying that She should wear bra or any inner wear the unfollow her page and F**k off.....This is her like she can do anything she want...Hats off to @redheadwayfarer.... really happy to call you my sister and my sister also loves you...Thank you", "ravishingtwinkle": "Such ground realities", "adityagurjar9": "He always click gud", "moupriyyyao2": "😅", "theimperfectmisfit": "@redheadwayfarer you are so inspiring 😍 Keep slaying 😍", "nareshhh_09_": "Girl power is best power 💪💪💪💪 I am a big fan of u love you 😍😘", "_sakshi_anand_": "Caption 🌹 ... and uh re perfect 👌🏻👌🏻", "the.zafar": "I wish if everyone thought like you, it would be better for us to stay freely as I want. But, now I think that, I should ignore about what everyone think about me, so that I will can enjoy my life too! I also support your opinions. Love you. :)", "heyarcturus": "I live in such a society where women's thinking are only upto marriage, excluding my mum. Their work is only to demotivate any girl. According to them If any girl is unmarried, then she is a slut. Some of my family members like my aunt, think that kuchh bhi ho shaadi to karni hi h wo v arranged. Okay perhaps marriage is important but come on yr i am a student nd just 17 year old. Is it really cool to compare my current life to my future married life. I am preparing for JEE advance. Nd my one nd only aim is to crack it. Nd not only marriage fact, many more things like not walking properly nd to listen comments like 'eee nachh kr chalti ho' 😤 not sitting properly 'larki hone ka lihaaz ni hai ' larki ho ye sab sikhna parega, aage kaam dega.... I was like okay it will help but only for me, not for my future sasural waale. I am too young to say all this but i will because abhi bhi india me bahut aisi jagah jahaa aisa hota h... nd girls like me insab se humesha fight krti hai.. nd whenever i need motivation @redheadwayfarer i just checkout your profile. 😁😁 I love you 😘", "bhawnasehrawat_": "Love the way you are❤️", "rishav_kesar": "Hot nd sizzling. 🔥", "thikeer": "You never fail to inspire me with you carefree spirt", "__reginaphalange___": "@tauseef.md okay so mister shirtless dp tiny brain! Just get one thing straight and clear, we are women not your public property okay, you can not get aroused by anyone, and if one doesn't get aroused watching naked women, that's completely fine, I mean hello, you're living in 2017, I'm pretty sure you know that there are not only heterosexuals, but other sexualities also exist, I mean your brain really needs cleansing, who are you to tell saloni that she should take her to off, I mean even is she does, so what? It's her body, her decision, why do you have a problem, and I think you really need help, you are blaming girls for every fuckin sin committed against any woman ever? Is it our fault if you men get aroused by watching us naked? I mean there are hell lot of men who do naked photoshoots, clearly we don't get aroused by them and that doesn't make us abnormal, it just means that we are not cheap minded like you or we are lesbian! Yes homosexuality is normal! It's someone's sexual preference and the way they are! You moron! And also even if we get aroused by watching a man naked we do not rape him, or say disrespectful things like you are saying to this Amazing woman who wrote these Amazing words, which I don't think that you read, because Clearly you were concentrating on how much skin is visible in the picture! Just like I said you have a tiny brain! And you clearly do not know how to respect fellow humans, because you didn't just disrespected women, but the all the LGBTQ'S and men too, yes those few men who are not like you but are sane!", "lonesurviour1234": "You don't need to show your skin everytime to be yourself!!@redheadwayfarer", "gunjan_firstborn": "I want this world to be filled up by people like you...since the assholes are so vocal, I want you to know that there are people who genuinely appreciate your expression of freedom...lots of support and tonne of love", "abhish_0901": "💣🚒", "binabgkaa_aiz": "I can't understand why people are commenting shit when they should be proud of you like why do such people exist you guys should just go to hell and let @redheadwayfarer live in a world with beautiful humans and a world free from biological waste like you all 🙄", "hell_m_cming": "Beauty defined wt u see in others.... Her innocence... That's wt I look at in u..", "kazi.durba": "U look absolutely beautiful", "ank_ana_": "😍😘", "the.mess.maker": "First, it's not necessary to wear a bra according to the recent poll she put on but its necessary for someone to spread the message about the morons existing in our society who have a bad mind set. Yes, men get aroused by seeing a naked or half naked picture and if they don't, it's a problem anyway.. But is it out problem? Its their problem which causes us a problem.Fix your problems not our comfortzones.", "vimal.chaudhary.9": "Without bra u look damm hot😍💋😘", "arpit_9": "@redheadwayfarer :Wat a armpit You have 😋", "s_divyani": "😘😘😘😘", "just_mahie": "Wonderful caption 😍👏👏👌❤️", "nish19_": "YOU KNOW THE BEST PART...... PEOPLE ARE COMMENTING SUCH BULLSHIT ON YOUR POSTS BRO BUT IT IS SO AMAZING TO SEE YOU STAND UP FOR WOMEN EVEN AFTER SUCH IDIOTIC PEOPLE.......LIKE LEGIT I FEEL SO GOOD ... PEOPLE WHO HATE OR COMEBACK WITH SOME BS AGAINST HER \"MATLAB CHUTIYO KYA LAGTA HAI YOU'LL SAY SOME BAKWAAS AND SHE'LL STOP POSTING OR WHAT ?", "shagun___singh": "You talk so much but do you roam on the raod like this @redheadwayfarer", "gillo_raani": "Beautiful caption and beautiful you 😍", "archie14k": "I texted u something, if u could see it once.", "riddhikumar2": "@redheadwayfarer you are doing a great job. Our society must change their thinking. Keep it up girl i really appreciate your thoughts. You are really bringing a positive change in our society.", "ghostman_pc": "Why these people over thinks on this type of things.... Human body hai yaar what's the big deal 😡😡 @redheadwayfarer give respect to everybody and stop pointing finger over others ☹️☹️☹️", "rathorebee": "@redheadwayfarer 👌👌😀😀", "honeydontlikeyou": "The ones who are actually not interested in reading wat is she writing ! The plzz don't waste ur time stop commenting here ! She have one blue colour button in her profile \"unfollow\" please press that ! For haters saloni di ! I appreciate u! 😘 @redheadwayfarer", "ronbonbon_": "Guys commenting shit...Y'all are the fucking people tainting the men's name in the society.... Gfy", "ary_achillies": "Your picture is good! But If u think wearing any clothes you want is women empowerment! Then think again! You have seen India but not yet Bharat !!", "marshmalow_boy": "I love ur dressing sense u r a girl of self sustainable and u must develop that people are born to say even might it is the world's bestest picture but even in these situations that phrase actually works that is like \"we are the elephants right and they are the fucking dogs and we should just be like avoiding them\" and it is a good way to get happieness @redheadwayfarer we all are loving u and ur pictures u r a true personality and this is what girl power signifies off hats off", "tenacious_pooja": "Babe you inspire me! Like m in love with you and your lines!! ❤️", "samdelhi19": "saloni chopra it's your life whatever you want you can do it. y to duniya hai bolegi aap sahi karo to b galat kro to b. 😍😍", "roxpoi": "You speak my heart out.. We need more people like you to change this world love you and your writing so much and ignore the negative people they are really dharti pein bojh", "asparagus_honesty": "Where are these women and how can I date them...", "ann00784": "You've no idea how much you inspire us !!!! Thank you so much for changing the outlook of so many people around here @redheadwayfarer . I love you ! More power to you!!!", "here_is_aryan": "Impressive thought.. Plz inspire all girls to be what they are. ..there are many societies who dominates this but sometimes you have to fight for yourself..", "avik2304": "Bold n beautiful 👌🏻👌🏻👌🏻", "sgs_maths_wale": "Nice hairs. Love the way you talk about freedom of an individual irrespective of gender. And the top is lukin grt on u 😍", "m.b.adil": "Kehna kya chahti ho behen g... Samajh nhi aaya Kuch.... BTW photo achchi h but no comments related to pic...!", "puggimonster": "Whoa!! Impressive thought...", "_nayan_waali_nika_": "Not all Superheroes wear capes. Some inspire you to love yourself. :) @redheadwayfarer , I cannot thank you enough for being my saviour with those captions of yours. Loads of love. ❤", "apoorvaashrinivas": "So beautifully put up :\") thanks.🌼 #Morepowertoyou❤", "missadarshgautam": "@redheadwayfarer Always an inspiring soul ❤", "a_n_j_aaa_n": "❤", "chocolates_maryjane": "I love the way you virtually slap people who roam around preaching women to be covered and themselves roam in just a jeans slipping down and showing off their ugly asses!", "wanderlust.gypsy.queen": "You are just so raw, real and unapologetically you. It's inspiring!", "the_rahul_bohra_": "@redheadwayfarer 😘😘😘😘😘😘 it's people's mentality how they take u.... But u know what fuck the shit dudde you are super Girl and a true girl.. Miss saloni... Fuck the \"bra\" thing.... Boss some people's are shit head I really admire u and your thoughts... Love the way you are... And your super naani she's very cute..", "_.prashansa_15": "Too gorgeous and hot!! Lovely💝💝😘😘😍", "the__indisputable": "I respect u for that how think about feminism . Infact some girls shuts their mouths coz they thinks that what people will think about them and after all we saw a independent and feminist girl like you @redheadwayfarer . Hats off to u dear god bless a", "shaktibabbar": "SLAAYYY QUEEN😽😽😽 more power to you 💕💕", "kingsingh8285": "It depends upon your choice and your comfortability weather you want to wear a bra or you dont... so chill stay happy you have lot of fans 😘👍🏻🙏🏻🙏🏻", "shankli_vatsa": "Msg well conveyed.. You are strong beautiful and so bold. I follow you from your very first post. And I agree with each word you write. Dresses and posters we wear or made don't define our heart and us. We are good by what we do. Just because I am showing my body. Doesn't mean I m offering you the liberty to touch or to harass. Manner should be in your eyes.at the end its all about perception. What you perceive you become. @redheadwayfarer ❤❤❤", "smriti0405": "Wao look awsm", "tim_katara_": "Well i read the comments in your story and the boys who commented ..... not wearing shirt ...showing their nipples Hawwwwwwwwwww oh i forgot about low waist jeans showing jockey....hawwww...😂ahh by the way good job @redheadwayfarer", "yad_life": "@redheadwayfarer your the best as always don’t think about anything a girl can do anything they want they also as their own writes", "bhavyamalik09": "Stunning❤❤", "hansoloandsoami": "I have never seen a girl whos even half as perfect and flawless as you 😍 @redheadwayfarer", "salaath_": "This is everything that I stand for @redheadwayfarer", "o_b_l_i_v_i_a": "But what the time when you are being objectified, there's a fine line between wearing stuff for yourself and wearing stuff to objectify yourself under the pretext of 'women's liberation'. Self objectification is very much real and its all over on Insta. Do not run the brush of feminist justification over just any subversive act women indulge in these days claiming empowerment. Flawless as the write up may seem, there's a ton of loose ends in it.", "suprthshetty": "Whtevva, ❤️ua jus awesome... Love uu 💕💕💕😘", "brhmsh19_": "Ppl are becoming mad day by day", "olivia_simone_roman": "Omg @redheadwayfarer thank you for your words this morning. This resonates so deeply right now.", "amitg07": "👍👍👍", "illumishawtii": "Awesome! Needed that bit of inspiration! Your writings make my day! #teamredheadedwayfarer #weloveyou", "rituajwani": "Yup!! So true🙌🙌 we should love the way we are.. Why we feel shame of our body.. It's my body, my life.. But why society have problems..?? Unko problem hai hone do.. We will not change ourself for them🙌", "najani_anki": "😇bless u", "shivambhatia877": "What I think is when it's her body she should have the right to decide whether drape herself or walk nude", "typosingh": "Love the writeup! This should be a blog", "sharmalava": "You are an epitome of a strong and independent woman!! #inspiredbyyoueverday", "mini.pateto": "I noticed that many people didn't actually understand what the caption means .... The captions tells us to feel comfortable in our own skin no matter how we dress it's our choice we can wear a burkha or walk around in a bikini all thats important is to love yourself irrespective of what other people think", "_a_s_hi_s_h_": "Whenever you post a pic..it feels like u are the inspiration and motivation for the society..#hatsoff #respectwomen 😊", "ankushkumar371": "@redheadwayfarer this world not beautiful as we all think or right about it. But your thoughts which inspires and helping thousands of girl to take stands by themselves. Keep it up @redheadwayfarer", "thatssosonali": "I was recently scolded by my mom for wearing a top which revealed my cleavage. My mom was quiet cool about it before I started to wear it and always compared me to those bold girls with their breast popping out. I always wanted to dress up like that but was never comfortable to wear it in delhi as being a Delhiite, I know this isn't the place to wear such clothes fearlessly. But finally when I wore it in Goa, my mom's disapproval came as a shock to me. This hypocrisy was eating me up but then I read out this caption to her. Thank you for this.", "sheetal_pitale": "I love you @redheadwayfarer ❤", "shiraz_usmani": "ugly🐽", "aryan_kedia": "You look very pretty😍😍", "swarangeesomething": "Im grateful for these posts @redheadwayfarer . I think everybody should start thinking like you.", "b_dnmde": "🔥🔥🔥", "pankajcr7": "hot af", "waghide.arpit": "Ur lips 😍 r too good... totally fall for those in every pic u upload...", "two_words_and_a_finger": "Really dig that haircut", "rahulmondal115": "😍😍😍😍😍😍😍😘", "kalyaknee": "Because you keep talking about yourself. Accha you think she is not doing any good and I think she is. Conclusion nikal gaya, theek hai na? And haan socisl causes because you literally asked me to feed someone so just to tell you that I am already doing more than feeding someone. I also asked you to have a good night. I see there's no response on that but I 'd still want you to have one. Bye-bye.", "daisy_vyas": "@khushi_vasani13 read the caption !! 🤘🤘", "vishu_mishra17": "Soooooooooo hottttt man 👌👌👌👌", "bhawna.goyal": "Oh my god😍 your posts always inspire me so much. You’re so unapologetically yourself & I love ya. You go girl♥️", "sam_in_vogue": "True inspiration.", "kaaaydeee": "The thing is, how much ever people will say whatsoever they want. You be the bold , beautiful, and best i have ever seen❤😘 @redheadwayfarer", "kunalvir26": "Bawse 🙌", "zovi_vaz_rodrigues": "Hey girl you are what you are.... in this society there are many negative heads who will try to pull us down but that’s actually where they belong (their minds).... keep going... you are an inspiration..... love you❤️ best wishes to u.... 👍👍👍👍👍", "amandeepkaur3328": "Cheeeeeeeee", "alishanazareth": "Stunning🙌", "__hemapuri__": "You are perfect", "nayeemkalam": "But this is very sexy and I see nothing wrong with that.", "gwyneth03_": "So fucking beautiful", "1995kilo": "You're such a strong, and empowering,breathing, living, walking example of a woman that I hope to aspire to be one day. I'm pretty old already, 22 but it's people like you who maintain the urge to just be free and be a *woman* that gets me started in the mornings. I hope that one day, true feminism gets to the reach of the million other women who think they deserve nothing but the shelter of another, only to hide their inner capabilities. Thank you, for existing. Thank you.", "m_o_s_t_l_y_i_n_s_a_n_e": "Luv u bae", "miss._.flawsome": "World is a better place with people like you😘😘", "change_profiles_pic": "Fuck u booms your lips 💋 👅👄👄👄👄👅🖕🖕💋👅👅👅👅👅👄👅👅👅👄👄👄👄👄👄👄👄💋💋💋💋💋💋💋💋💋💋💋💋💋💋👅👅👅👅👅👅👅👅👅👅👄👄👄👄👄👄👄👄👄👄👄👄👄👄💋👅👅👅👅👅💋👅👅💋💋💋💋💋💋", "__ayush.sharma__": "Ohh fire 🔥 u r looking fascinating 😍😍😍 and ya nice quotes 😬😬", "_beingevil_": "Damn hot", "saadhassanrafique": "Bossss Lady!! 💪🏼❤️", "kabirpkapadia": "Strong enough @redheadwayfarer 😎😈", "harsha_aravind_i": "@hridyaaravind", "ayushmantkumar": "Brave 🖖🖖", "shruti_vashisht": "@redheadwayfarer so inspiring👼👼", "karansharma333": "no bra day 😂😂😝😝", "gourav_boora": "@redheadwayfarer You are truly an inspiration for standing up for women rights in a patriarchal society, whatever little difference it makes, it will make India a better place for women's to live in...... Being a boy, I request all men's to support you in making a change", "unflinching_snehanshupandey": "Just be you ...nice pic ....Nice quote @redheadwayfarer", "e_s.hehe": "Kudos to womenhood!", "kartikrooy": "❤️❤️", "salman_ahmad010": "sassy", "anumrxta": "i love you and your writing. you're my biggest inspiration. don't mind the #dhartipebojh ily MORE POWER TO YOU 💖💖✊", "urvashidar": "😍", "sheetalmanchanda_": "❤️❤️", "shonu_1208": "Always be yourself....", "one_in_a_minnion": "@redheadwayfarer loved it. Need many more of these captions", "deekshaprabha2": "@redheadwayfarer love u grl😊i wish ....i cud meet u smwhr smtim.😊....dt day😍😍😍", "iamaman_kapoor": "😍😘", "flawed.human": "More power to you girl🤗😊😊", "__believerrr__": "Uh alwaYs MoTiVaTe me To liVe liFe HappiLy.....😇 @redheadwayfarer", "nayanaaaaaaa_": "Love😍😭🔥💋", "sharyu_suryawanshi": "U will always be my Carrier Bradshaw !!! The one who inspires me all the time ♥️✨🙌", "young_wolf555": "@redheadwayfarer #wellsaid #dear..👌👌❤❤", "sidra__afzal": "You are an inspiration to the girls who want to live their lives on their own terms. You need not give shit to those cheap comments they are just jealous how girls overcome the patriarchal mindset. Keep inspiring. Keep motivating. Keep going. ✌", "bee.stories_": "Respect mam u inspire a lot😄👍@redheadwayfarer", "the_silentslay": "Stunning 💯", "sushil2590": "Bold and beautiful", "kalyugi_ladka": "@redheadwayfarer Savage level #Saloni_Chopra", "rosh.rocks": "@_janice_britto 💯💯💯", "shubhankee": "@blackkash17 I don't think @redheadwayfarer is doing something wrong by posting pictures . She can post watever she wants . There are many girls out there, getting inspired by what she talks about, and how does that even matter to encouragement of being in negative side ????", "kanishka._.17": "You're the real beauty according to me you are everybodies inspiration out there who don't wear jeans becuz of the rediclous society norms", "khushi__bartwal": "Miss apko jo wear krna hai karo because log faltu hi bolege chahe full kapdeh wear kro ya short kapdeh wear karo. You are looking Awsm in this pic. and you are my fav.❤", "rubal_hooda": "I love your confidence. It's so empowering. Keep on shining ✨", "malvika_pattenset": "You're a real difference maker and a true inspiration.. you just prove that a little bit of guts and confidence Is enough to choke the chauvinist out of the so called MACHO! !", "ruchi.palan": "👑👑👑👑", "manc_kalsait": "Lady crush 💋❤😭😭", "virendra7053": "Nice 👍", "billion_dollarproject": "Lovely", "dawarheena": "Only three words for u, \"u r love❤\"", "cornerpen": "I love you. ❤ You're doing your part so well. You are my 'self love goals.'", "treza_shrestha": "I love u...❤❤❤❤", "orignal.writer": "Your captions are always lovely and inspirational❤️❤️👌👌", "sahil__star": "nice", "reecepestillsixclair": "‪PLEASE, PLEASE, PLEASE. Could you follow us. 🙏🏻💋 We absolutely love you. WE ARE BEGGING YOU, PLEASE ♥️🙏🏻🙌🏻 xx‬", "b.thash.laxmn": "So beautifully said 😍", "baked__batata": "@dramaqueenme23 reminding myself and you of this.💘", "heyitsbulbul.___": "Inspiration 💕💜@redheadwayfarer", "official_rajbirsingh": "❤️👍🏻", "theboxinggypsy": "Well said dude!!😄😄 Even I say this to my gf!!! Keep inspiring many girls🤗🤗", "pavemented\nVerified": "Verified", "sonalijoshi__": "Loved the tee 😉", "swthpll": "*Exactly", "mithasha6": "To all the narrow minded homosapiens and haters, we are human beings before we are anything else. That is why we need equality. When a man is allowed to openly showcase his nipples, why not a woman? Is it because her breasts are objects of sexual interest? They are a piece of flesh. A part and parcel of a woman. Why deprive someone of something that gives them confidence and makes them feel empowered? The worst thing you can do to a person is being them down. Be good kids...", "zankhanadalal": "Well written piece n totally agree with every word", "vyayshalee": "I'm in love with the perspective of yours ! ❣️🤙🏽 @redheadwayfarer", "gangotri_bhattacharjee": "You really inspire 😘", "sakkumyself": "Your all posts are so best so best 👌❤ we cannot rate anyone or compare 💪 You are so perfect on writing 😍 This post also help so many youngsters 😀 You dont owe anyone to be pretty or sexy if you don't want to 👌 What you owe is honesty to yourself 😍 I have learned new major thing today 😄", "ankkitaaa": "❤❤❤", "ravilatwal": "If u think of way forward …then the post are bit forward …it will take time in india to Byte forward …I appreciate ur work", "karma_it_is_20": "@redheadwayfarer love you're an incredible woman flaunting your beauty. Absolute charm you've and many fucktards will not get what you tryin' say through your pictures. I'm your true follower love you girl keep posting more and more,inspiration for me and my gang #fuckallpeepstryingtobeashholes#", "anurag_alaria": "damn", "rohitkalita17": "@redheadwayfarer You are truly an inspiring person for all the women around the country and I'm really in love with you🙏🏻❤😘 and if you can please reply😅", "palaksharma30": "Preach 👏", "curllboss": "You're the real queen ❤✌truly inspiring truly motivating truly amazing truly real ✨❤✌@redheadwayfarer", "sauu_rabh": "Not bad quite sext😍😍", "blings_n_brushes": "Read this @dhiman1631", "bghosh123456789": "Lady Rambo😉😉😉😉", "tanupriyaghosh": "You are truly an inspiration!", "anuragmaharana_": "Grate thinking...", "heenadhameja": "♥️😊", "abhimanyu_mahajan1": "@redheadwayfarer I respect u Saloni .", "_sam_._sung_": "❤❤❤❤❤❤❤", "nshah26": "@redheadwayfarer people should not mind if girls wear veil..its just the level of modesty", "yashivj": "And I am proud of you!!", "_yuvs96_": "#respect @redheadwayfarer", "rochelle_johan": "Freedom of being who you are....I really love u @redheadwayfarer....appreciate and respect to u always...", "kanika23__": "Keep shining , woman 💓💓", "jess_1540": "Dickhead*", "monal_singhh": "Saloni , I want to say 1000 words but I guess this space is not enough to show how much I love you , your posts, story everything..You are a pool of positivity atleast for me and for many others like me. Thanku for being a part of my insta .😘😘😘😘😘", "imutsha": "More power to you @redheadwayfarer", "dr.aashish98": "#respect @redheadwayfarer", "ashi20sharma": "Luv u soo much @redheadwayfarer ..u know what makes me feel proud is dat u r not like d other celebs...d one n only gal who talks about gender inequality,d one who talks about women empowerment, though celebs have a lot ov time to post about where dey r going?what dey r doin?they posts a lot about women empwrment when sumone trolls dem....u no what we d people ov India are so stupid we are mad for dose celebs who dont even care whts happening around still,we \" the great Indians\" create pages for dem...worshipp dem like God....atleast u aint fake,atleast u do get time to post about social issues,about gals...u give strength to many other galz like me...no matter what no matter what u r doing.....i luv d way u r...be as u are...lots ov luv n wishes for ur future...in my eyes u have achieved everything fame,respect not because u r a celebrity but because u r genuine person...", "vinaypal2609": "In love with this!!! It is so true man!!!", "dillipkuwait": "Looking 😵🔥🔥🔥🔥🔥🔥", "deekshasant": "The caption is sooo good!!😭❤....Saving it right away!", "jenniiieeee_._": "Love youuuu❤", "yashnirwan": "HMMMMM😁❤ @redheadwayfarer", "firoz_merchant": "😍", "keval_25_": "#girlpower ✌😉", "callista_2909": "❤❤ love u", "__nithya.sree__": "Hats off to my greatest inspiration for being an amazing feminist and for being bold. I'm just 16 years old. But I'm also growing up myself to become a feminist like u. U r such an awesome inspiration. Tysm salon didi. ❤❤❤❤❤❤", "s_dakshita": "i love ur all posts because it shows some feminine 😘😘😘@redheadwayfarer", "abish_printer98": "You do what you want to do. Don't let these Douchebags affect you. @redheadwayfarer", "ronadutt": "\"Your biological clock is not ticking\" .. very original .. love it.", "poojabhalothia": "Words 😍😍😍", "vikrammehta934": "More HOT", "arjun_kapoor9": "Gorgeous", "_disconnect_to_connect_": "You’re beautiful ❤️", "swatichandersekhar": "Best post so far", "_shalusingh_10": "❤❤", "bafila92": "Hawwww no bra.......it's ok tumhe bra pehne ka man nai karta......to room me mat pehna karo....pic dalne ki kya zaroorat hai", "rathodkishor710": "Very beautiful", "saiiichavan": "💯💯💞", "raviteja_9": "😍😍😍😍", "zainaliphotography": "🙏🏻♥️", "rashiiiiiiiiiiiiiiiiiiiiiiiiii": "👏👏👏🤘", "___shwetaaa____": "Words girl 😇😇", "pamandersen93": "@redheadwayfarer Love this!", "mithun_sharma_9": "RESPECT YOU GIRL..! 👍", "vrr0624": "@redheadwayfarer I thought I was in love once. I stand corrected!", "samikshya_._._": "LOve LoVe❤", "amitaggarwal8": "Oh Teri really hot and caption 😍😍🍺", "haflong_ki_chhori": "This is just too good. Love it. Keep doing what you are doing, it feels good", "kiranroy18": "U go girl", "nidhibhasin": "Love this!👌👌❤❤"}