{"shahriarrajoshi1234": "But that nip tho @redheadwayfarer", "tanmay_lahiri_7": "beautiful post", "ridhima.rathi": "This is really beautiful ❤❤", "ramesh_suthar20": "@vanshikaasharma_ 🖕🖕🖕🖕", "bilal_multani87": "Don't you feel ashamed @redheadwayfarer", "kamal_sharma011": "well said @vanshikaasharma_", "vanshikaasharma_": "@bilal_multani87 I really think that the caption is a justice to the picture, she is referring to the people who get all horny just by seeing a girl's cleavage even if it's not intentionally shown in public. Female body parts are always objectified. Skirts above the knees make people stare us more, an extra undone button makes men (not all but the ones who does) peep them inside as if they will enter the shirts. Why? Is it so bad or is it an invitation? Isn't it just a normal body part that is sometimes revealed unintentionally. Large breasts aren't any girls choice neither is a smaller one, still some jerks look at them as if they are some sort of a television show that is made to be looked at. She feels that it is not her body that is wrong it's people who are wrong. Not a single guy feels unsafe wearing shorts or just a vest. Bodies are so much normal than what people usually think. Modesty and clothes being connected is itself very hard to accept as for me. She presents her body to make us understand that its just a body part and not an object to feel lusted on", "brata_de_gabbar": "Agree with your statement...#Wonder Woman ....but the society don't think like you...and this is a problem....but yes you r breave and hope that you don't change your opinion even in a tough situation.....😊😊💖", "yasnasehgal": "I LOVE YOU. 👌👌👌👌👌", "ayeeshajaswal": "@siddarthjn", "akashr93": "U r so brave", "flametabrez": "#nudity is not a #feminism", "rahulthakurrrrrrr": "@amit_the_limitless why she is showing her nipples.she don't become brave.its nudity bro", "secret.heart57": "You are showing still you had to cover that's the deference between men and women", "emilymatthews0986": "Juicy", "imanitrajput": "nudity mai konsi freedom h yaar", "dawww_shun": "And to other men .. she is a women . Not meat to #notapeiceofmeat .. proud of such Indian\"s 💖💖@redheadwayfarer", "_.zehramushtaq": "Feminism ke Naam Pe Vulgarity Show Karahi Hai Ye👎🏻", "lrana2662018": "NYC niples", "cosmicvibes_girl": "@_o_shruti_o_", "abhishek._.aman": "Caption 👌👌👌", "aasshhaaayyy": "@07_dhruvv caption. <3", "_deepankarmahale_": "To all those who r saying bad abt this pic....and also that this is not good nudity is bad for society and there is no freedom in the nudity and all those fucking coments mentioned above....i just want to say u all plzzz GROW UP...yarr....just once go and have al luk to all those beautifull ladies of hollywood.rihana,selena,ladygaga,etc...they too wear these kind of stufs on redcarpet and they never faced these kind of comments on them although they are the fashionicons.....so guyz its just the matter of mentality of people of nation not by clothes.......grow up...and be a man...and dont judge someone by clothes.....plz", "quotesblog_forlife": "Aur Usse bhi accha sab kuch shadi ke baad😂😂😂 sabse safe!! @imanitrajput @d_i_m_p_s @dhwaneeprithiani", "rewaphansalkar": "Mothers can be independant, ambitious and successful too.", "lost12341234": "Beautiful", "your_majesty_sd": "@redheadwayfarer you are a BEAUTIFULLY STRONG WOMEN. .... ❣️ I Love you as an elexier of beauty bold and brains. U r Art 🌸", "sameernaheed": "How long does it take to write this much?. It took me 20 days and I'm still not done with one paragraph. Why this much bhal bhal?", "maxsolanki2993": "Are nice nipple yr", "prince_rajput13": "Superb capture 👌", "ritubhandarii": "such bold😇! inspiration♥🔥", "rajkishore_rout": "Pata nhi kyu but apkka ye pic mujhe bahat pasand ayaa..", "_thekrishay": "Awesome picture & Awesome captions ❤ @redheadwayfarer", "darshan_jain676": "Do u know u kinda revealing ur nipp#*# in this pic 😒😒", "anurama_biswas": "@jytikhamaru @dvkamalik", "bff.6699": "awesome ... bindass picture... its just a boobs and nipples ... not a big deal... great picture😍😍😍😘😘 @redheadwayfarer", "orchidmukherjee": "Inspiration ❤ hell loads of love n respect ❤", "avisharma_18": "Sahi h 😋", "rahul2605": "OMG! I like your makeup. 😍", "farah_samina": "Her life her rules ! Stop judging please", "petrol_head07": "U have beautiful boobs..", "ritu2564": "Ur an inspiration", "aastha_nandwani": "👏👏👏👏👏👏👏👏👏👏", "___hasnain_013": "@come_fnd_me", "singhkomal_88": "Ma'am u inspire me......😘😍😍😍😍😍😍😍love you the way u r", "alooishh": "That's what rebels do, and you are one. It need guts to make nuts understand things. 🙏", "not_your_thing": "@arbeena_kar", "royel_rajput_deepaksingh": "What is this woman man", "i_m_bhardwaj_v": "U know what #girls_always_in_top...😍😍😍😍😍😍😍", "smrithyy": "@aryan4404", "thekunal91x": "wow the caption really..... no words... luvd it", "ssaurabh9": "They say that you should not show your body parts because they wants to see you safe, because they are worried about you, But unfortunately you don't understand because you only need 'freedom'!", "charithrahegde": "You're an inspiration", "iamfinelikewine": "Right picture. Wrong place to post it. Looks like everything is out in the open now......", "mohammadisahaque": "😇", "harshatokas": "Good :)", "whoperryarora": "@megha_ara Jise tum publicity stunt bol rahe ho na ma'am, mere khyaal se wo bhi freedom hai. Feminism hai. Atleast someone trying to educate people on instagram. I really feel sorry for you ma'am. Or haan jab aapko Google se pata chal jaaye k feminism kya hai, tab bataiyega jarur. Kyunki attitude se kisi ki post pe comment karna asaan hai I think. Or feminism kya hai ye explain karna mushkil!", "naveen4523": "#hot_look", "abhishek_bitolia": "@redheadwayfarer graceful then now and forever ✌️", "chocochipmuffins": "Guess she needs a job 😂😂", "kritisundardeb": "True 😋😋 @redheadwayfarer", "arjun93t": "Love you", "bhavanimenariagmail.1373": "Oh so hot", "vickykumarlal": "Gorgeous", "singhamar601": "Cool &semi nude pic .", "kriti.sen_211": "@zaidkhan4717 are you dumb or something? she is already an actor & she wants attention like really?? & you can only use few words like cheap & expose cause you don't know beyond tht , see a girl if she has revealing clothes than call her cheap that's how you think, what if you see this in USA thats okay you wld love that, but no she can't cause ppl like you think its cheap, you have to know this\" she nailed it every time she represented woman & she is not cheap you are cheap, cheap eyes cheap thinking even cheap words you've got.", "nirmal2097": "Nice boobs", "vchhariya": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "the_art_dilettante": "Her netted lace bra isn't something people should be concerned with. What y'all must be concerned with is the mentality which makes people sexualize mammary glands. If the picture bothers you, you shouldn't be living in 21st century !", "diyabhatii": "hey saloni....m a huge fan or yours....I really really respect and appreciate what you do...u should not care about thosr fuckinn people who trolls you....u doing a great job trust me....best wishess😚😚😚", "sharma.tushar24": "All those who have a problem with this picture , as you are thinking that it's too revealing....it's simply in your mind the way you think the way you see ... beauty lies in the eye of the beholder so does the nudity 🙃", "nannaid9": "wow hot", "ananya__17": "Wow, love this. Empowering", "kunwar_rks71": "She might be in depression I feel", "aaapppuuurrrvvv": "I may not be very appealing or pleasing to most of the folks here . But today seems to be a good day because I am commenting for first time on Instagram. My attitude towards the dress sense of women is above board . It's okay to wear anything or nothing . But the way you related emotions of women to men's bare chested photos is contrary to the men emotions to women bare chest . You can see that men and women have different body structures , different voices , different sexual organs , so why not there can be different emotions towards bare chest of their opposite . Maybe these emotions are nature gifted that cannot be changed . I think it's okay for a men to get aroused by bare chested women . Also it's okay for women to be bare chested if she wants . It's very basic nature of men to stare at the women they find attractive. Some stare for a nanosecond , some do it until they are stared back and some shamelessly cross their limits . It depends on way they are raised. Even a cold fact is that more than half of your male followers on Instagram are here not crave your good and independent thoughts but something else .This is not an educated guess but a guess that men can understand. I know this is bad . But this is life and this is nature. You can vilify it but you cannot stop it .", "ms_shanu76": "Dude if you have any care... You are showing everything.. mam are you crazy.. don't do this I can't tell you but mam...................... Yarrrrr", "adi_ghosalkar": "@zaidkhan4717 Attention ki baat kar rha hai tu... 😂😂😂😂😂 Do chaar posts se Tu continously comment kar rha hai and sabko provoke kar rha hai and ladkiyon ko attention seekers kehta hai.. aare ha ye toh tune Teri maa se sikha hoga... Kyunki voh bhi toh ek aurat hai.. kabhi ladki thi na... Ab Tu offend hua na... Ab gaali samjhi na... Tu samajh equality... And attention bolne se pehle na Zara sochke bolna samjha kyunki voh human tendency hai gender tendency nahi sab mat sakte hai sirf ladkiya nahi... Bhag idar se kamine", "imazarmansuriofficial": "Ur beauty stand out !!! Looking like Katrina", "vickyishigh": "Did anyone notice something? Thats so vulgar out here. Thats not at all beautiful. Its like an arrogant girl can never be cute even if she is cute. Same goes for her, u might like her thoughts but what about the lifestyle. Come on lads. Don't be a blind Follower.", "chhedakrina": "@zaidkhan4717 bloody troller who only knows to disrespect girls . You know because of guys like you , our country is an unsafe country for girls. Dude just take this as a warning because if we girls show you our impulsive side na you will be of no where . So dude it’s high time now understand this and just stop trolling and commenting on girls . And one more if there is one hater for @redheadwayfarer then there are 100 more lovers for her and I m one of the lover . ❤️❤️", "dee_sharma_": "♥ ♥", "avvngrs_": "You go girl ❤❤", "meehirr": "Aree yaaar... Kitna ladte ho #Feminism pe.. Thak nhi jaate.. Pehle poora bachpan nikala.. \"Boys V/s girls\" wali competitions rakh ke.. Ab Feminism pe ladna chalu.. Hadd hae.. Seriously..? Poori zindagi nikal doge kya ispe?", "clown_07": "what I feel is this post is beautiful and she is looking gorgeous ... there is nothing wrong in posting nudes if u r comfortable in ur own skin..but certainly not support few girls who are trying to be the flag bearers of feminism...particularly few parts of their comments..(not all) Don’t know about much abt how correct the fight for feminism is..because if we adore a girl’s body it might sound cheap but do adoring a guy’s butt by a girl isn’t cheap or low standard mentality.. I absolutely support right to equality and freedom of clothes thoughts food..like if a guy gets aroused or feels attracted seeing a body part of girl who is not his mother sister or daughter that does not mean he his cheap like wise if girl adores a man’s but apart from his father or brother isn’t ..", "sanjnabhalla": "@zaidkhan4717 If this is not feminism than what is feminism according to you?... Also you just see the pictures she uploads or read the caption too..", "mehakhuranaa": "Wow you look so beautiful", "bhushanimbalkar": "Wow", "pallaviiiimanjunath": "Ur voice of many women out there ❤️❤️❤️", "lazy_crocodile": "Just report him thats it ! Bcz boys like him wont understand never ever in a million years . एंड ओफ ध f”””न वर्ल्ड", "beauty__hippo": "loved it💪", "itanvi_1": "u looking great tho!!", "rockstarr1430": "Applause and respect for every women who raises their voice against the evils of the society. I praise you for the change you are and the change you are trying to bring in the society which is driven by some orthodox unrealistic standards.. 👏", "areej_faizan": "@zaidkhan4717 Oh my God! You need to stop talking! The more you comment, more disgusting you sound.....My ears are literally bleeding, reading your comments. Just stop! You are making a fool out of yourself totally.", "taboochild_": "She is empowering women in a way and these stupid fucktards would not understand that. They exist everywhere.uuugggghhh .", "abhijeet_mahat0": "You are truly an inspiration .... Once again I'm in love with your words ... #supergirl #lotsoflove❤️ 😅😍😘 ?@redheadwayfarer", "0c_cult_nation": "Good job, 1 day they will understand 👍", "whatamenon7": "Superbly written, Saloni!", "ayushi_grover10": "U inspire me alot ! Hats off to a person like you ❤ who is willing to erase off that stigma from peoples mind ... no one is so strong to stand against the society! Ur really a true inspiration 🤗", "sass__wati": "Pretty you 😘😘", "mr_classy_123": "Beautiful picture", "priyankabsrathore_11": "So true..", "sharif_saba": "Amazing lines😘😘😘truly inspirational words....", "gautamp__": "Tommorow is bday of ur biggest fan so please wish her that will surely help to make her day special . Please wish @thatmolekid", "anitaanjana": "@h33na___", "salmakhan2101": "Disgusting", "jaipurite_girls_boys": "Do follow us beautiful girls fr free shootout 😍😍.. follow me to visit profile", "dimplegirll_": "@zaidkhan4717 @___.notyourgirl @lollywoodz guys I mean like wht i knw vse tum logo se behas krna he bekar h.. but stilll I waaana tell you something.. guys it's her opinion wht she want to do or say she cn. U r not suppose to judge her.. nd if u dnt like her opinions then block her from instagram or dnt follow her.. nd let me tell uh all of you attention seeker ap log ho tbi ese comments krte ho .. for watch \"Mtv\" \"troll police \" b h ab .. nd uss se nai dete toh rabb ka khof kro ap log hotel kon ho kidiwani ldki ko kuch b khne vale 😡😡 stay beside apne se mtlb rkho na yrr", "maaaaaaahi_": "Respect 👍", "tajwariqbal": "On a serious note tho Love your bra whered you get it from?", "danish__here": "@ejazfahil👀👅", "johan.tl": "Wats so special..", "__prafull_21": "U r impossible", "sunny_bora1": "☝", "arvindmishra755": "Lovely", "cra___z_": "Psych", "_pr3ttypriceless_": "Agree 👌✌️ loved the Caption", "ruhi_jain0209": "How well you do write!♡♡@redheadwayfarer", "sajiddabir": "Nice", "omkarsingh777": "@redheadwayfarer There is nothing wrong with getting naked and celebrating the human form. Looking at beautiful bodies is delightful for both men and women. But it shouldn’t be confused with an act of liberation that is rooted in feminism...you #celebrities show us how empowered you are by talking off your clothes in public. You got good platform don't misguide them.", "_bhavv__": "@godwhyamihere poyaa", "ssharma911_": "Wo sb thik h bt itna sara likh kaise lete ho 😂", "aayesha_27": "@nadimakhter061 get off of her page then, you two-faced desperate tool.", "shraddha_pun": "U xo cute nd your neturel beauty..👌👌 awosm 😘😘", "mr_honey_1818": "OSM click", "sarvesh.soho": "Grow up guys and always remember we are in the same society and advanced culture where lot of temples have had sculptures which 'expose' beautiful human body p(arts). So please understand Indian culture, read about it, learn about it then be the protector of that culture and blend it with your presence and existence.", "_keyan8": "Nice n", "shree_artofoutdoors": "Wow words!", "pjoshi1341": "❤", "callista_2909": "❤❤❤", "zahooraghani": "Ang laga de re", "ibn.e.yousuf1435": "W💋W..Ur XxXweeteXxXt,JuiXxXieXxXt,RoXxXieXxXt & GloXxXieXxXt💋& SeXxXieXxXst,FluffieXxXst,PuffieXxXst & SofteXxXt b(.)(.)bXxX are ExXxtremely Kissable,Lickable,Suckable & Fuckable💋..L💋LxXx", "shereen.abraham": "Ur kinda my hero 🤩", "vanshusharmma": "You're wrote well✌✌", "kristin_gail": "Thank you. I needed this today. ♥️", "theakankshasingh": "I just love you for the work you do..u are my ideal❤️", "sujan_b_hazarika22": "@redheadwayfarer And then, again you did. Nothing, but inspired thousands of people who is going through your writings and this is literally more than enough. Like you manage to do this. So much of courage inside-out. Thanking you is seriously not enough. For people like you, and some more, I can hope for a better India. 💙 ~ Sujan 💙(pronounce it as Suzan)", "sajanmallus": "nice ..hot and daring...", "aneesh_angadi": "Expose skin , play the feminism card and voila , instant rise to fame , some more followers and and some more like", "kumargti": "Hi sexy nice boobs", "priyanka.mohan": "Well said ❤️❤️❤️", "luciferrrrrrrrrrrrrrr": "🔥🔥", "vivekgoyal08": "Your writing skills are really good...it like real life story keep writing keep spreading lights....if one women only could be empowered, it will be great achievement", "fawad_hulk": "Awesome", "raghav_dhanvinder": "Great 😊", "jeya1312": "Well said !! Preach sister!! ❤️❤️", "handbrakeharry": "Worthy words!", "ashhu_tosh": "#freethenipple ....", "ronniethesuperboy": "After my chemistry teacher you atre my crush and trust I wasn't wrong then n I ain't wrong now...you are the world's most gorgeous lady....", "magnificent_faraz": "Rip poonam pandey", "nitinahirvar1690gmail.co": "So sexyyyyy", "praduman.praddy": "Well done Show this post to ur dad n mom.!", "ankitkumar6026": "Wow 😘😘😘😘", "nehasingh.1995": "Your doing a good job . Fuck what people says. Do what makes you happy.", "shivangi940": "@mrinalsinha.159786 bhn 1 r 😂😂", "dhanurdhaari": "True....", "barkhadayal": "👏👏👏 lots of respect for u dii @redheadwayfarer", "shrawan_x_bkr": "Hot", "_.ciimona._": "I love your boldness mam❤", "nyctophile7038": "these words🌠🙌", "ntirlotkar": "U r beautiful but did u need this thing to make u famouse nude and semi nudes", "shruti_sahni": "@katrinakaif looks a lot like you", "freesoul_2303": "More power to you.", "the_pradeep_raj": "Like ur inspiration , read all ur thought but don't like ur pic u post.", "manjeet8065": "Atlast u give what we wanted.. Ur nipples😆😆", "ushasmithhalder": "👏👏♥", "__mutual__feelings___": "U r amazing....", "jetset_thakur": "@redheadwayfarer the way you started he's hot she's a slut, no yr she's not she will never be. I get it you want to bring a change to people's mentality n the change is coming. But you need to understand too not every damn man walking on this Earth has this mentality. Yes we exist we respect the opposite gender equally we love you for what you are yr there's no need to keep justifying it. I just wanna say yr you are damn cool damn awesome. But it's just this one thing that I wanna bring to your notice you keep writing these social blogs just think of the men who actually Respect you they love you just don't go on saying something like he's hot she's a slut it's a very big thing to say for the mentality of a whole gender. Hope you see my post .😊😊", "kalpdheer_aanchal": "Love it", "shahzaib_pervaiz7287": "What's happened with your skin", "weirdo_kid__": "Inspired with your posts ma'am ,❤", "massimotornello": "❤", "vikashgupta4689": "Nyc", "adityarajsingh60": "Hatts off u maam ......U inspired many of she or her .......May be yours and many other his or her efforts will bring a day of complete gender equality........Salute u and respect....", "rutashree.3333": "True 👍", "jy_sahlot": "True that @redheadwayfarer 🙌Virtual freedom of speech(criticism) for some : Internet!", "shipra_jha_58": "You da bomb!", "harshijopat": "@redheadwayfarer ma’am your words are so powerful and on point ❤️ you are an inspiration to many young girls and women are including me . People like you deserve a lot of respect 👌❤️ . For doing this people need a lot of courage and confidence which is not there in everyone some people like u ma’am have that power embedded in themselves ❤️ . This word needs people like u who can understand and know what’s right what’s wrong and have that courage in them to support the right thing instead of doing what others are or supporting what’s wrong . Because of u @redheadwayfarer ma’am people will learn to be different and think different and support the right thing instead of blabbering shit about people who they cannot be . Ma’am we all love u and #respect u . Love you ma’am @redheadwayfarer ❤️❤️", "vijaydubey302": "Hootttttt", "milinduikey": "@redheadwayfarer It takes a lot of courage to express the ideas of oneself, honestly hats off.", "revanthkumar920": "Y do you pour dat shit on ur face every time.... U think it's cool...? It's actually gross!", "adyt6491": "Looking sexy. Nic Brest", "manini.hazarika_abo": "Seriously you are so damn inspiring", "rohankhanoficial": "Looking so hot", "spunky_sru": "This is such a powerful message 👏👌💪", "mandal7008": "Gorgeous one sweetheart", "being_shybaz_": "Awesome 😘😘😘😘😍😍😍", "amit_singha___07": "Unusual ,but yet so good ,the best part is not ur sensuality ,nipples or bold or whatever people say ,for me confidence of doing this is more great", "rituajwani": "You nd your words are love❤", "csn1937": "🙏👏👏👏", "hashim27_12": "Hot beauty", "abhiroopbose": "Right message for the right audience", "bhaw_na_23": "@shreya__kaushik", "priyanka_chattopadhyay": "Ur thoughts are really good . Wht u say is inspirational dear . But u can't change the world by showing ur bodyparts . Do some effective jobs . Go n stand by many women who need help . In villages everyday more than 15 -30 rape cases came to a doctor from 5yrs old girl to 90years old girl . So if u can go n stand by them n try to chand the situation xcept showing ur body parts .", "subhro.nath": "she's just lost her mind....crackhead", "medhamukerji": "@_yaminibhardwaj_", "mr_pawar_333": "Tula tar laaz ch nahi g", "adarshpunjabi": "Ur lovely the way u r saloni n every woman the way they r .. u r more alive n more aware of life then most men r in this country n the world. @redheadwayfarer. 😍😍💓💓💓", "girl_with_glitter_": "Damn that make up @redheadwayfarer. 💓💓💓💓💓💓💓", "sahebchahal": "I know iam just another admirer, but you know i really appreciate the fact that you are an inspiration for the females, especially in a country like India where dominance of the traditions and cultures have buried them. Keep up the good work .. and you are a gem yourself don’t loose the charm because “empowered women, empower women”", "annymuktieh": "Inspiration ..i love ur positive thinking 😘👍👍", "urs_laddi_dhillon": "Nice bobbs", "_rayabose_": "Okay whatever you have written I also feel the same . But just one question keeps popping in my head. Why you always choose this kind of a picture to voice your opinion? Cant we (women) voice our opinion in a shirt or a kurta without shaving our head?! Won't people listen to us? Wont our voices be heard?! @redheadwayfarer", "lipirastogi": "@meetaliisingh", "a_creator_of_possibility": "Totally agree WID it @redheadwayfarer But RIP to all those men here who have commented here even without understanding wt exactly u wanted to express!!", "rashmi_singh_kuntia": "Awesome...love the content ...such mutual feelings", "meghs_777": "You go girl,,, u r a definition of free spirit😘", "insidethechaosofmymind": "Very well written.. kudos..keep vining so .. n keep letting every girl out there know that it's ok to do what they want n be who they want to.. unappologetic", "the_word_smart_my_synonym": "Wow nice brown nipples 😚😋😋", "abdul_baqi_1997": "🌷", "hashtag_rao": "Amazing u r", "steadiman": "Inspiration love the light you shine", "avijit__007": "Brown colour ka ni**le .awesome😍😍😍😍", "ashish_231186": "Love this", "witharjun": "Awesome 👍", "ash.21_syed": "Ur an inspiration for all women's... Great written...", "theenduringsperm": "@redheadwayfarer Well phrased, Saloni. :)", "aniskhan8659": "Very nyc boobs", "chaibiskit": "Love you for what you are", "__.amansethi__": "the light brown...i love itt...", "kvviswajith": "100% agree that there are unforgivable double standards. But Mother Teresa really was an asshole. Also, I would like to know if any of your posts or videos deals with International Feminism.", "rudranilkundu": "Actually you know it's useless to even argue on the name of feminism. You surely have the right to do whatever you want...well you also should not stay inside a society since everyone would criticise you. Not advising anything...simply unfollowing you.. :) god bless you", "deb_abhisek": "Soooo Hot...", "iritikasharma": "💛❤", "aayushi_990": "Love the way The way you rage against the terrible society", "theshabaz": "#salute", "rakib.mirza": "Cute books", "afuckedupmasterpiece": "@talat_shakeel @udevanshi13", "awe_srush": "I love your empowering posts Saloni. Reading all comments here just manifested the words you wrote. People get offended when its none of their business. Nudity is not the point here folks. Freedom of thought is. A girl basking in the morning rays, what is wrong in that? Why should we make all the effort to cover ourselves, everytime? Modesty goes both ways. If women are expected to be modest then men should also take equal responsibility. Maybe and just maybe if nudity was an everyday scene where men and women are allowed to be clothed, naked or whatever then people wouldn't have taken much notice and shrugged it off as just a \"human body\" without dehumanizing them.", "nipinanil": "What happened to your face? Accident??", "raza6711": "OMG sexy bra and size", "saltybuttercup": "Justtt wow... for the pic n of course for the article 👍👍", "juna_chhan": "❤❤", "kshitij_wizardiam73": "Live for yourself that's all I can say to you mam", "yuvraj.sachdeva": "सुन्दर 🖤", "rohit7301": "its different ,its a creativity", "bongfeed_": "😍", "m_o_t_o_k_i_d_4_6": "There is a nipple 😁😁 but it's not a big problem, cause you're a feminist and you can wear whatever you want and can show 😝😝", "pumped_up_kickks": "I always wonder... U makes me speechless everytime", "jazzmakol": "THE EXTRAORDINARY", "_amruuta": "I love this so much. I love you so much. ❤ So powerful and inspirational as always! 😭💕", "shoaib_ansari995": "Ugly face", "snook.san": "Oh girl.. You know im so small.. Like im 15 now.. But still your words make me feel so inspiring nd motivating.. Ik its not easy to post this things.. Without getting trolled but being trolled for this.. Aint getting you any damage.. I love you girl.. Nd yeah.. To all those who thinl that she is not doing a good thing.. Go to hell.. We dont give a damn.. To those sickheads.. Once again i love you.. Keep motivating us.. Be bold. ❤️", "rocket.pocket44": "Nice biceps", "amisha_kejriwal_": "Ma'am your words are so so powerful and inspirational. I love the way you live your life without any fear. You are an inspiration to many people out there and I'm one of them. Keep up your good work ma'am and keep motivating. Be bold ❤️", "valleriee06": "I love u Saloni...u inspire so many women...every word you say motivates people..you've changed the lives of many people...keep it up! ... And thank you for this too...", "raviteja_9": "❤❤❤❤", "the_unshackled_poet": "Respect for this post...be who you want or need to be 👌🏽👌🏻👌🏽👌🏻", "1____anshul_550": "You So Beautiful and Hot❤😉😘", "amrita_singh1104": "This is amazing @redheadwayfarer i adore you in every way ♥ u r such a priceless gift to me as a person", "vchawla100": "Jeez!! You’re the inspiration, girl. It takes guts @redheadwayfarer #fucktherest", "saurabh_raj": "👌well said", "thatcrazybrowngirl": "This is so inspiring. ❤ @redheadwayfarer", "_nityasharma": "You are such an inspiration! I love you!❤️😭", "10stkid": "❤❤❤❤❤❤", "im.prince_official": "Hoty 👌😘", "kweebeee_": "Has nybody told u ur a beautiful soul... #girlswhofight #girlpower #girlssupportinggirls", "theskybeyond._.320": "Keep inspiring.. @redheadwayfarer", "saketdharve": "😑😕🙊☺💙💃🙌💃💙😉", "prateek.maheshwari": "😀🙋🙌 only if people can look within and understand", "krishnaasreekumar": "This is such a beautiful picture omg @_akansha1738_", "khushi_280": "You're an inspiration for manyyy❤", "_the_hyper_pilot__": "😂", "krishu.s": "Revealing your nipples... shutting down men with your so called ‘FEMINISM’. That’s women empowerment?? #freethenipple in front of your family!! Let’s see if they support you. Instead of these bullshit movements try to empower women in a better way! Nudity is not empowerment. Independent grownth is!!! Feminism is a very important term, don’t degrade it.", "meet_parmaar": "❤", "aumsoniii": "😍😍", "blue_current_67": "Hats off to your bravery p.s. very well written 👌@redheadwayfarer", "akhtra": "Wow", "kd_bhutiya": "Not everyone thinks like that to be honest so u should def not ask for feminism from all...U just want attention from people.who even respects you!Not everyone celebrated when someone is a playboy/slut ..There are just few..So please stop descriminating for all.men", "anvitha_____daas": "Amazing", "sumeet.90": "I appreciate u😍😍keep going dear", "_atikakash_": "@tanmoy_saif ki dekhos? 🤔🤔", "rawalrohit2007": "U r fucking hot ❤️", "iam_what_": "That's why I love Anime world😁😁", "aishu_1903": "Thank you for the amazing words❤", "dr.klutch": "You go girl 😍", "nishitkaria": "@nagar_komal @nagarsejal", "psy_being_human": "Psy being woman 👸😘😍😇✌🙏", "sanafatma311": "The body is nothing jus wrapping our beautiful soul..i love the way you are inspiring women and giving them strength and positivity..go on girl!", "__nah3__": "Your thoughts are beyond anything else.... 💖 Ya know really well the shit that exist in our society😤 Very well written 👌💕", "_dev_rajput": "Awesome 👌👌👌", "m_sahil71": "😐", "ishasingal": "Bang on !! Very well put across..", "arshuuu99": "India's next pornstar😂😂😂😂", "tahirali_manj": "Omg😱😱😱😱😱🙊🙊🙊🙊🙈🙈🙈🙉🙉🙉🙉🙊🙊🙊", "sanakhan780563": "Haahha. ..again. .a slut😂showing her nipples around", "_ishh_": "🙄🙄 speechless", "rohit1265h": "Superb 👌✌🤗", "gravytheory": "How far a girl can go to seek attention. Its disappointing.", "pujamahato337": "❤ youu ❤", "sherry_sharmaa": "@redheadwayfarer love the message n ur picture.:)", "rohit__rj18": "@redheadwayfarer Wow...I salute you 🙋‍♂️🙌🙌 ..I want to marry you 😍😍😍😍 ❤️", "deekumarica": "You are just woowww😚😚😍", "sudhinsreenivasan": "Great message but I didn't like the Pic", "abbhinavsrivastava": "👏🏼👏🏼👏🏼Jai Hind", "incredibleamor": "If understandable person there. then every problem is not a problem .....", "sakshi_yadav25": "@redheadwayfarer You look-alike sarah jessica parker @sarahjessicaparker from 90's show Sex And The City 😃😃", "manisha0_": "Yess go girl❤😍", "kajalkatiyarr": "✌", "i_namantated": "Seriously I bow down to the words and the thought process you share with us ik things r hard out here but I am happy and I see a ray of hope when ppl like you be the guiding light inspiring us to do what’s right and not what is just being followed under the mask of being a male I love your writings allot di more power to you ❤️❤️❤️ @redheadwayfarer", "desiwearsprada": "The lines are way beautiful and stronger then the pic..", "shambhviiii": "❤", "chandan.cool": "So sweet..", "shrutipriya_kumar": "Motivator! You inspire..You motivate..❤️", "marywhooooooooo": "👏", "aman_pune01": "Superb.. bold beauty with brain.. very well written..", "amisriyagnik": "Superb dear.. You are bold and beautiful.. Lots of 😍", "__sudeshnadey__": "You are so inspiring ❤", "ekrahgeer": "@redheadwayfarer you make my day everyday 😊", "outlivingthecosmos": "The universe you are❤", "sunil.gangeria": "Well said. should inspire nd change a person's mind", "hardeep_pattar": "👌👌", "exploringkolkata": "Babe, you're awesome 😘", "its_not_ur_comfort_zone": "Bold n beautiful❤", "pk3633": "Very hot", "tanyasolankii": "Cliche", "ketanshah555": "Beautiful.. Gorgeous", "_anika15_": "well written. u r just awesome. (^o^)", "youknowyouarehere": "Yes. I believe everything that you said and it is true. Reminds me os the book sapiens", "sharad_sahay": "soul shaking... wonderful words.. i knw ppl will ask u y such gud words wid such pic n all.. trust me dis z whr we lack.. a female tits z why such an issue.. whereas why nt a male think ever tht how useless his chest is tht his tits r of not feed anyone while a female breast r meant for life and evry organism survive on tht only after breathing on d planet.. u truly deserve a big platform not bcoz of the issue u talk.. its bcoz d way u say.. god bless u.. keep inspiring", "shantanug28": "Damn thats all visible that shud be hidden.", "saurabh9399": "Awesome......👌👌👌", "jyotirana777": "U are giving some things good to this world lady. :) I wish I could be that free of a soul", "mayank_tandon_": "perfect example of women empowerment and how people should be open minded 😘😘😘😘☺️☺️☺️☺️☺️☺️☺️☺️☺️☺️☺️☺️☺️☺️☺️☺️☺️☺️☺️☺️☺️", "_benipalharman_": "Keep your head up and keep moving ahead lady! You are the change! You are the best! God bless you!", "manisha_palnail": "❤💓you so perfectly out every girl's thought into words which they're scared to speak up👏 lots of love and respect", "kesha_s_11": "@redheadwayfarer you're so inspiring to all the ladies out there, I'm so motivated, tysm for all the msgs u give", "_.ssnehaa": "@redheadwayfarer Di ❤ Every girl should be like you. You are inspiration for all of us. Iloveyousomuch di. 🌸❤❤", "nikhil_sahitya": "Gorgeous as always...", "an_ambitious_soul": "💓💓", "a_unicorn_adoptee": "Thank you! 💜", "_halsi_": "So Brave ♥️ proud of you di... Keep inspiring ♥️", "sanasangli": "Thank you, @redheadwayfarer Thank you for starting the conversation. You’re an inspiration ❤️", "mrcasanova9": "The quote 👌", "umesh3421": "Respect 🙌", "harshvedi": "Well said", "zafar250791": "Worth a read👆👌👍", "kdas8": "U speak each n every girls heart out....so mch love fr u", "sun5_1994": "People will always say whatever they want. And i don't think if anything is wrong in it. It's their views and opinion. It actually depends on the individual on how they take it.", "honeytalwar007": "Crispy pica :)", "neha7894": "y always i see these inspirational n worth contents with always sensual posts lyk this.. i mean its not here its about everywhere.. ur each and every word deserves loud appreciation.. but also the other side of the story is we cant always hold this idea tht independent women are allowed to wear anything or nothing... its just a part of it but not the whole concept... independence has many dimensions to it..we can do it simply by not belittling any other gender and going half naked... bze thts the whole concept we want to teach the world tht we are not any sort of sex object bze there some population of women who weae this coat of feminisim n do the nasty things possible n not only me we have seen these girls on Instagram on a dialy basis... independence is not only limited to women's cloth.. its about growing urself independently with dignity each day..", "hansoloandsoami": "Youre so damn gorgeous ❤️ @redheadwayfarer", "sonali_0009": "NYC 👏👏👏👏👏👏", "aastha_a_shukla": "@redheadwayfarer U r an inspiration for all of us ❤️❤️❤️", "iamsubhisingh07": "👍👍👍🙏", "farahkhan_toot": "Caption❤", "_silverspoon_badass_": "Thankyou for helping me change my views towards these things... Learned a lot.. more power to you 🌟", "_goal_diggr_": "Yass the caption speaks out my soul. SO MUCH YES.", "yakang_hage": "@redheadwayfarer just love your words..and honestly i see myself in few of the lines that you wrote...so gonna change it and thanks for interpreting your thoughts into words in such a flawless way..😙😙😙", "carguywithnocar": "This one was the most inspiring for all the human beings.", "meetvaibhav": "Caption ✌️👍🏻 @redheadwayfarer", "nikitagadal_": "\"We're not raised to be independent, ambitious, successful. We're raised to become mothers.\" :') Thankyou for this read @redheadwayfarer", "mr.grey36": "Such a beautifull things. Really need to change in thinking...", "nbesarwaria": "You are looking so hot and beautiful", "rainyjain": "Damn❤️ you are just amazing. I admire you in every aspect. :)", "charmingly10": "It's so difficult for people to understand that girls can have dreams and we can look more than what we have got. And we work hard for it it's not handed to us in silver platter. Infact nothing is handed to us on a silver platter. This society is tightly gripped with the mindset that women with too many dreams, achievements, ambitions are not the one to be able to keep a happy household. Maybe they need to understand that while some girls dream about a happy married (which is a good dream too) some of us dream of pushing and being and doing so much more. I salute the women who broke from this pretentious and unwilling cage and brought on the changes that allowed us to dream too. Thank you for your contribution.", "pal_aashaa": "@ridhiii_sharma ryt in the feels 💯🔥🔥", "faizan_tkd": "🙌🙌", "_clumsychick_": "😍😍😍😍😍", "munchy_167": "❤️", "diksha_menon": "❤I wholeheartedly agree with you", "singh_kavita_": "❤", "the_capricious_one": "@redheadwayfarer You are an inspiration to me and many others 😍. You give us the mental support when we are too low by posts like these and tell us that it's fine for us to follow what we want to do and maybe break stereotypes, Not fit into the so called BOX made by the society. Thankyou!!😘", "dr.tony.tony.chopper": "Glitter glitter.....yay", "troll_anthammas_official": "Well said... The excellence is beyond the formalities... U", "babarocksdevilrules": "@redheadwayfarer why so much pain /hatred there is always two sides. We just need to walk on the right side. Questioning will not get you the answer. Doing your best will get you there. Arguing will not make you \"what you feel like\" debate are endless when it comes to He/She. She is right but he is so poor to accept it. It's not about clothes on her body it's about his eye on her body searching for what his mother mite have shown him to feed him to give him a life when 1st time took breathe out in this World. Fact every man knows that he is wrong but not ready to accept it.", "diljot_bhatti": "Sooo hot😘", "inglejikabetaa": "🔥🔥😘✌️", "prashantyadav9220": "Wow nice sexy baby", "minam_tekseng_": "❤️", "nnaina_777": "your words inspires many hearts...to go free and to live on our own rules...@redheadwayfarer", "jollity_soul": "@redheadwayfarer amazing you and your thoughts 😙", "sapna.tdb": "♥️♥️", "nisha_routray": "Awesome girl 👍 ... rarely seen any celeb taking such stands ... changed my mind , made my day ... thanks .", "_singhnikita": "Just love you.. For being 'Who U R'...savage 👌✌👍", "mansiiii14": "WELL SAID. And I'm so grateful to Instagram that we have such inspiring people out here and we can reach out to them so easily.", "anshu_soni_01": "So beautiful di😍😍😍😍😍😍😍💓", "mr.rohit.hooli": "I don't even care for your pictures, I follow you for your words. Well said ✊", "m.b.adil": "If u vr not feminist....I wud definitely proposed u...🙈🙈😂😂", "rahulmondal115": "❤️😍😍", "jyoti.kapil": "💙", "priyanka1786": "@redheadwayfarer Saloni you are one amazing woman! 💋", "hathiparinda": "You made me fall in love with your words again❤️ @redheadwayfarer", "bollywood__bbfan": "Woooooooooo nip", "alan_jose_john": "No one should take anything away from a girl. Her life, her dreams, her body, it's all about the woman. Men should be happy that a woman is ready to share all this with him. But for men, it's all about showing authority, well at least in some places in our country. I believe in the concept of coexisting, where you live in each other's life and dreams. Hopefully that concept of coexisting will come through in our society. And again, a great post. Your posts are always a canvas for people to express themselves as well. Great one. Keep on going 💪💪", "vishal_9973": "🕊🕊🕊", "drushty.saruparia": "@deepakdemadras", "happy__s_o_u_l": "Hats off......i am big fan of u mam☺☺☺", "parveenpanchal11": "Women power and self confident", "zaki_savera": "Appreciated", "sahilsingh7721": "Sexy girl", "prashant.s.singh": "#respect", "star_lordxp": "🙌💕💕", "chandrika_thakur": "✌inspiring", "gurleen1312": "💕", "speedster._": "👌✌✌🖖", "_vai__": "Your words 👌👌👌👌👌👌👌", "i_am.nandatanu": "Respected.🙂🙂🙂🙂", "_adieus": "You are a legend @redheadwayfarer", "anvil_7": "Only one word to describe you Beautiful... I cnt see any cheap or dirt in this picture .. and if any other cn see thn it’s a problem in their eyes 😛.. go girl ...spread positive vibe @redheadwayfarer ...", "amiitabharat": "This article made my day... Thank you. Good morning", "imhites": "Hats off to u", "shrutithakurr": "@bhavyaa.mathur read.", "chinmai_sinha": "You made my day. Good morning pretty soul❤️❤️❤️❤️", "mytraveldiaryblog": "Yes ❤✨", "gargiverma31": "This is simply amazing ❤ If we want to bring the change, then first we have to be the change we want. People will abuse girls for one reason or other but we have to stand adamant and stubborn for our dreams and goals.", "musafir_huyaro1": "As always its a pleasure going through your posts @redheadwayfarer ..i am sure the message is being passed loud and clear not once not twice but with every post...and its appreciable. Any effort that awakens minds of people is worth... Any idea /opinion that value adds to yours is desirable but the hate or negativity is something neither you can stop nor anyone else but yes it can simply be managed by \"ignoring\"....thts my view", "__.drashtiiii": "I love your words girl. Uh r literally a blessing✨ the world is in need of people like uh❤️", "callravi": "♥", "_digviijay_": "😘😘👏👏👏", "khan_fou": "Damn I was looking if there are any idiots here, who didn’t understand you and your thoughts and might be criticising! Thank God Ders no one. Your post and no negative comments made my day♥️ @redheadwayfarer good morning and have a nice day gorgeous 😘♥️", "bagsandeep": "Awesome", "diliprw": "This is deep! Sometimes it is what we observe in childhood that reflect in our attitude, especially during teens, but it can be changed too. What you say is true! Respect!", "sumitgoswami22": "😍🙌🏻 @redheadwayfarer", "anup_27_": "😉", "jivaniyash_0955": "Mam u r a great inspiration for everyone @redheadwayfarer", "neilkumar6939": "Lol 😂 you are funny 😄", "slap_vibe_": "Great stuff 👍👍", "singhal_tushar": "That you choose to break the patterns...and to capture the thoughts with a brave visual depiction...RESPECT!!!", "budddy_oye": "🙏🙏", "shweta_agarwal_1808": "This is so inspiring @redheadwayfarer ❤️ You are love 💗", "indecisions.kevlar": "💙", "dakash12": "U looking so gorgeous", "samosastories": "👏🏽👏🏽👏🏽👏🏽👏🏽", "anuj_bhadauria18": "Wow😍", "_salonishah1511": "Love you and all your posts!!", "komalesque": "So much YES to everything in this caption. The internet will criticize literally everything. We must ignore and be our own selves. Power to you, to us all 💛💛💛💛", "nileshghutukade": "Ignore", "himanee_47": "💓💓", "the_colossal_vibe": "Absolutely loved what you wrote! ❤️", "_harshita_saxena_": "True..❤❤", "nawaz714": "Awwww u r soooooo cute like angel @redheadwayfarer luv u soooooooooooooooooooooo much 😘💕😘💕😘💕😘😘💕😘💞😘💕😘💕💕😘💞😘😘😘😘😘😘💞😘💞💕😘💕😘💞😘💞😘😘😘😘😘💞💕😘😘😘😘😘 plzzzzzz come live we r missing u.."}