{"tanisha_sharma47": "You doing great job", "lalit_tekwani_photography": "You both are wrong . You are wrong and he is too.", "__unnuu": "@u_vid! See this.. That's what happening in the world... Why girl can't live life independently without man? And no one is ready to raise voice. I wish that if i will man like this.. I'll kick his ass and tell her mom so that she can educate man... And I would tell every mother that educate your boy - man", "suraj019": "@_aamirkhan @thejohnabraham @amitabhbachchan @narendramodi @pratyush369", "doctorharneet": "Please see what u posted today its soo diplomatic", "wanderlustbysahiba": "👏", "roy_i_": "But what’s wrong with an Indian accent??? 😏 @redheadwayfarer", "apsaravydyula": "@whatteman", "kevoyotic": "I just happened to scroll on my instagram feeds and got to see this video . I feel It’s not him but you are wrong over that u are so rude in this video . Firstly a indian origin talking about an Indian accent saying “ my indian accentttttt “ ! secondly you post all half open body photos and u talk about someone clicking your bikini pictures 🤷🏻‍♂️ wtf ! Does it make any sense ..... all you need is fame and ppl talk great about by sharing this post & nothing else", "namansrivastavaa": "@pranyash_97 Ye lo !", "amit.p.ami": "Such a pevert", "grushashahpuri": "Omg This was muchhhh needed.", "snick_hill": "We Indians don't work like Europeans. We have a different idea of what is acceptable and what is not. To deny this, is to deny reality. We haven't grown up seeing our mums in bikinis and shorts, like Europeans do. Europeans are so used to that. To the point they don't care. But we Indians are NOT used to that. The uncle who secretly watches a scantily clad girl knows that, and the girl who is scantily dressed knows that. We know very well there are certain limits in our society and if you overstep, you are bound to STAND OUT. We are not Europeans, and we shall never be Europeans. So stop pretending to be one.", "nill_oval": "Fuckkars", "rumnrouge": "What a fucking asshole! I hope you slapped him! I went through something similar, when a guy made a video of me while I was shooting at a park. I wasn't even in a bikini, full-clad in clothes and all. I don't it's even got to do anything with the bikini, it's just how sick they are. Later I confronted that asshole, and got it deleted.", "shubhamgaurrajput": "directors pays of video in bikkni and i think this man was not paying money to her ,,,", "dr.ramanmahal": "And what about the pics you post in the bikini? How does it make a difference? You are already revealing your body to the world!!!! I am not a follower of you but I usually come across your posts in my feeds as many of my friends follow you... if you are really a feminist then you should be able to take charge of the same..please do something regarding girls education...haven't seen such post of yours as yet...", "tanvinarang03": "👏🏻👏🏻👏🏻👏🏻👏🏻", "absolutely__correct": "Srsly? He took a foto and you got soooo worked up? Agreed it isn't ethical or anything but have you ever seen your own posts? 😂", "ranvijaysinghal99": "Bastard......", "itsnotaakash_": "The day at sangam for kulchas ,!!! Remember !! @nikkyarora", "diyapadmakumar": "@madhuri_lalwani I was stalking her page and look what I found. Men never fail to surprise me.", "_manisha_401": "He is an bloody bastard", "urjita.patil": "@joitheboy do you remember the creeps at LA cabana", "shaankhn": "Yar bikini me ghumna bh or ye bh expect karna koi notice na Kare ..... 🧐 I think you born on a wrong planet 🌍 ... but he was taking your pic nd video that’s wrong I agree but never expect that you wearing a bikini walking on the street and on one notice you .... otherwise depends...", "neithdsouza": "@gentlemenofindia", "relaxsingh95": "Oh my god.. The comments on this post....they are heart breaking....", "sachin_sakhre": "Mam again u r what u are amazing.... Salutes u", "v2.collections": "U did the best", "somyasharma_redlotusstories": "Therr r two kinds of people...who hav raped....who cud nt.", "aishwarayakalro_333": "@ankita_sh97", "_kanupriya_vaidya_": "Men's logic: if she's wearing a bikini then why is it bothering you?. You are wearing a bikini, you have already proven yourself as a slut so it should not bother you...... Your parents must be proud or have you got this mentality from your parents itself... You know genes", "archie14k": "@roshni.razdan this. Its fucking disgusting", "tannnishka": "Fck 😩⚡", "devika.k": "@jha.rakhi836 @sneh112", "sayed_s_kadri7": "Cheapest man! Disappointed to hear abt this. Very disrespectful. We need to learn to respect each woman which is more important value of education #supporther @redheadwayfarer", "debleenaa": "@aakashvarma Omggg I loveeee this girl fuck", "rohaansanthosh": "@teenalenin @skia.athena @adornaeliz @nabhanya.j @amala.josephalphonsa @eve8316 @insta_anna___ @zwagwithpoo @guptaarunima @divyavanissery", "tara_amala_jospeh": "@_aamby_ @rajeshwariragz @anunair6287 @vinswetha @sheena_binny @sinjiniunni @rubz_mia", "vinswetha": "@sruthydeeps @sksgal @soumyarajendran @charulakshmi @sush_shivshankar see this!", "thisis_adil": "It's pathetic that the hotel staff didn't give the information of this asshole. Hope this video reaches his family, so that they know such an asshole he is.", "beingmanasi": "😂😂😂😂😂😂😂😂😂😂😂😂", "kusum_dhakal": "@p00lisma_ this one is lit💥💥👏👏", "that_assamesegirl": "@redheadwayfarer first of all this takes a whole lot of guts to do!! And secondly I’m so proud of you. Women should speak up if they think something isn’t right!! Cheers 🥂", "swatikrish6306": "Disgusting people ... look at his face ... 50 year old crapshit.. I wonder if he takes the pics of his daughter like this too", "73moons": "Look at his confidence! I so fuckin want to kick his ass😠", "helios_027": "@_carbylamine_", "parimal1089": "I don't even know this type of people exist.", "hindianguy": "@ashwin_nd ever heard of consent? I guess not. Rapists don't really understand the concept", "rohit8775": "Hahahahah", "sonaalit": "This has happened to all of us, everytime we have been to beaches. you did great saloni. Cant believe how people of our dad's age can even do such things", "dawww_shun": "Our parents always tell us to respect elders .. no matter how ever wise or rich we get .. but only if elders behave how they are supposed to will respect come automatically ... Such people aren't even worth a living ..shame on these kind of elders", "motherofdrag0ns": "YES!!!", "rajkishore_rout": "If you are uploading your bikini pic on social media then what was the problem.", "simrananandd": "I dont know why if some men are so obsessed with bikini own one wear it go in front of mirror and statisfy their temptations", "_kyli.et": "@trash_in_every_way223 I want to slap him for what he did I swear", "karishmasawant": "More power to you", "aayu.d": "What an asshole", "tejaswighagada": "Wow!! Glad u did that! I wish i could be like you and have so much gutss! ❤️", "r.a.m.y.a": "You should you tight slapped him along with your gang !", "_abduvvada": "Kaboom. That's the spirit.", "hathiparinda": "What an asshole!! Disgusting men like him are everywhere on the streets. Last night I read about an incident where a man threw a balloon filled with semen on a college going girl. The saddest part is everyone is okay with whatever happens with a women. No one is ready to support us.", "chintanmakhecha": "@tanveerhala read the comments", "_mdshahbazuddin": "Notice what his apologies 😂😂\"Just delete it\"as if he is in the bikini victim🤔", "ashish3379": "Kindly share your contact number...This is Aashish Singh, journalist in News 18 India..", "ath_a_rva": "@psy_gokhale mhanun me ss vagare ghet nahi☺️", "a.n.i.n.d.i.t.a": "@manuhar_raj", "abhisaarr": "That constitutes offence of Stalking.", "samirachauhan": "what a bastard!", "avtgrd": "Grab him by his balls .. don't spare him", "leonardperis": "I'm very sorry that you had to face this! And the amount of moral policing that is happening on this post is just atrocious! 😑 Just remember that there will always be people beside you for your cause! #MenAreTrash", "svsgrewal": "If.... (?) he did that.... It was wrong. A formal police complaint should be lodged. But I fail to understand who gave you the right to humiliate someone like this in public. I wish you Lodge a complaint against him for clicking your pics without consent and he sues you in a defamation case..... That would make things even....and I'm sure you have done much more harm to him than he did to you. Think over it.....!", "ilinashobha": "This man is an Army Officer. His name Lft Gen Prasad. Go ahead and grab the asshole by the balls! @redheadwayfarer", "_tanya_sharma_": "@tanishasharmaaa", "carscars984": "Attention seeker . Find another way", "harshitaghildiyal": "@sisterzoned08 You gotta watch this. The ridiculous things people do... I mean clicking someone just because she's wearing a bikini... Enough of this fucking attitude..... And yaa do follow her... I totally see you in her..", "tanisha_singhal_": "@moki_______ watch this..😠", "riyagandhi96": "I don’t know why people here are saying that it’s a Publicity stunt...Like if you really don’t like Saloni @redheadwayfarer or if you’re not fond of her,then why the hell are you FOLLOWING HER? Why are you questioning her? It’s her Instagram,It’s her life..You like her? good! Follow like comment(good ones),and incase you Dont like her THEN GET LOST NA!! WHO TOLD YOU TO SPREAD NEGATIVITY HERE? MORONS", "jaan.vii": "@nishh_99", "minzarpana": "Uncle sudhar jao ! Wrna😏 . Ab maatawo ka naam japne ka tym h ,kaiko aisa krta! Aunty ko bura lagega na arey haan tumhari beti ko bhi bura lag sakta (if they are real women nt stereo types who think \" Ladki ki 'He' galti hogi\"", "razi_ahmed_khan_": "@sharon.maria_ y??? If u have freedom of right to choose what u can wear thn other have freedom of right to do whatever they want to do with their mobiles", "ushername2332": "i think if it was in some western coutry. A girl wouldnt feel the need to post the guys face online. Becoz guys there normally woudnt sneak pics of women. She maybe wouldve just complained to the authorities. But in India, its a BIG THING. And this kind of social issues needs to be addressed in a different manner. Even high ranking ppl in india justify rape, so those who are saying \"why did u need to expose him or u couldve called the police\" maybe calling the police is not enough of a deterrent. But exposing them online right away might make them feel embarrassed and not do it again.", "patel.kinjal94": "@redheadwayfarer do you have any proof or any evidence that he did click your photos? Not a problem chalo we believe he did click a photo of your so what ?? My point is don’t you have any problem when you your self do post your photos in bikini .!! The photos you post on Instagram as if they are fully covered and they don’t reach to people !! Sort of Karma 😂😂 which came back to you @redheadwayfarer And you can’t take it 😂😂", "aryapnair": "Everybody should share it and Shame him!", "__viipul__23": "@aaparichitt", "6560600": "Hes tharkiest guy", "guptapurnima44": "He deserves so many slap...", "khushiguptaa_": "@redheadwayfarer you did right dear let this shitty face know what he do😑😑", "alisdair999": "super friggin awsum 💪💪💪", "somrwita124": "@sagarxsingh....Ohh....I didn't know Rape is considered \"irrelevant stuff\" here ! Taking a girl's picture without asking for her permission is \"outraging her modesty\" ...Any act which outrages the modesty of a woman is also a crime. And by the way, there's a word called \"consent\"...which that man has not bothered and what Saloni did is called \"reitalliation\"...She didn't just put the video on the first place...she did this when that \"old moron\" denied his misdeeds. And what the hell are you talking about going to the Police ??? All the Rape accused are roaming free here in India....and you expect us to get help from Police regarding a video/picture. This is the damn way to react.", "srivastavvicky123": "How you are so sure about that.. But if done that then its shameless... Go to the police..", "kritika.singh.5268": "Well done.. Applause for you 👏👏👏 but the thing u said about \"indian accent\"!! Girl @redheadwayfarer you are an Indian and you live in India so it's normal if you got an Indian accent. So you don't need to highlight it or fell ashamed of it!", "user_ig2001": "Halo Miss Bikini, One just can't play with any dignified & self-respected person. Such cheap stunt for your TRP n media hype will not work. Best wishes to U for the next catch. Kind regards.", "rkris75": "If you are undergoing a photoshoot in an open public place...and if someone clicks ur pics...u can't call urself a victim...that is not to say that the person in video was clicking pics...and not defending the person but this victim card does looks more like a publicity stunt...", "ankitrana766766": "Publicity stunt. ..", "amanuploads": "Disgusting piece of shit. This is not done. This is disgusting.", "bhargavmunish": "Bitches these days are too difficult to handle#get some life girl #publicitystunt", "madhura_hawal": "@redheadwayfarer I am shocked that even after how clearly you wrote the episode ppl still blame the woman for that or justify the mans action, it’s a sad truth where girls who fight for what is their right will always be tagged for being ‘too modern’ or not respecting the so called ‘patriarchal culture’ .", "medusa5197": "You go gurl!", "eltonjfernandez\nVerified": "Verified", "whereisafan": "When you show your tities to the world on internet and you don't see a privacy concern there. And for instance this man took your pictures in bikini it wouldn't have been a big deal for you. You could have called the police. But no you look ugly af and want to gain some publicity.", "suhaaanii": "proud of you !!!", "itsvishalll": "@redheadwayfarer why didnt u slapped him.. i think this kind of people need only such kind of treatments", "varunjainmohari": "Just callbthe cops and hit that bustard...", "prashantwarz": "@redheadwayfarer very brave of you. Such Perverts need to be shamed. Also, don't get bogged down by all the negativity down here. We are with you :)", "honeyipsudas": "@redheadwayfarer wtf!how dares he? Why didn't you slap him? he deserves", "wtfbhawna": "@sakshijadaun", "_xkinkajou": "👏👏👏gr8", "__prajyalita_bora__": "Hands down....U truly killed it 😁😁proud proud👍", "samarthaiyappa": "Motherfucking piece of trash. These are the men who deserve to be dubbed anti national and should be made to have a metal dildo up their asses at all times that says \"Patriarchal Indian sanskaar\"", "richa.satiya": "Fucking Asshole !!", "__faizan__khan__": "Ultimately you have posted those photos of yours to your 270k followers and now anyone can see these pictures including these type of mens..", "sashasworld16": "Good job Girl.. it’s was a great thing to do so.", "superawwesomeguy": "Non sense post of yours trying to over react bullshut. If u so concern about ur attire then why wearing only see through stuff on Instagram. People like u r stupid hell", "mohnishkhairajani": "More power to you !!!", "realvijaymishra": "Such an Asshole with a capital ‘A’ 🤬 fucker is an understatement for this scum bag 💩", "cyberpoet_azeem": "Well done girl let the asshole rot in hell of embarrassment", "mahade_t": "Such #chutiya people live around us that's why India is to much back from other countries these kind of people think that we don't follow Indian traditional but they forget that the dress they are wearing is also been made by #other_country but this people can never be good for us wearing this type of clothes...Even in my sorrounding people if I wear tonned jeans or my sister wear small clothes or shorts they react very much....such a chutiya people live around us😔😔😔💔💔...#dont_give_a_to_fuck_them😎", "zubair.tanoli94": "Was he talking the video? Where is the video no one knows but you made the video of him? How can 2 wrong make a right ? You got more publicity by making his video than your photoshoot. I wonder if you are doing the same cheap publicity stunt which zahra hussain did.", "leena_alive_the_haunted_soul": "M proud of you for standing up to perverts like him. Bravo", "alks_riva": "Proud of you!! Such a bold step 🤘", "khaledqureshi": "Tag this fucker", "dusnumberisanj": "You should have given him one piece of shit between his legs 😡 ASSHOLES to core @redheadwayfarer well done though. Giving a mouthful n uploading his filthy face for disgust from all 🤘🏻", "slayinpsycho": "@manasvivashist she is truly not comfortable with his video taping and what he did was utterly creepy or else this wouldn't be a headline! Nor he apologized but simply escaped from the hotel ! It's so creepy to get photographed by strangers man! How do you even think of justifying it?", "kay._.vee": "@_varunsometimes_ @prabhjotkmann @aashima_8 THAT MAN’S FACE SHOWED HOW HE PEED HIS PANTS.", "so_na_li": "Ridiculous", "sagarxsingh": "He should've taken her permission before clicking her pictures... But what I don't understand in this country is... Imagine if there was a male model getting his shirtless shoot done and a female starts to click his pictures there wouldn't have been any issues like this 🤔🤷🏽‍♂️", "wordsofworth": "Disgusting beyond measure.", "sanjay_shrma__": "Sasti aurat.jb camera K samne pose bnayegi to alright but yeh wrong h.fake woman", "ashunism": ".", "_harkamna_": "@redheadwayfarer You're such an inspiration for the entire nation and I really respect and admire you because you always stand for the right. I am glad that someone has this much courage and stand up against men like these. Thank you :)", "kavitahkr": "Hats off to you @redheadwayfarer", "jetivarn": "Yeah its absolutely Ok to pose in a bikini in front of the camera & later show to the whole world, but it's abusive if a man click her pic in bikini... What a logic......Can you explain....?", "purvawarang": "@clarri.sa @_karnika", "clarri.sa": "@thesiddharthrathi read the fucking comments of these misogynistic swines", "abhijit.ok": "Yeah its absolutely Ok to pose in a bikini in front of the camera & later show to the whole world, but it's abusive if a man click her pic in bikini... What a logic 😂 feminist !! Can you explain...?", "sidraj_singh": "Should have fucking bashed that old senile.", "c.gadkari": "Brilliant Stuff @redheadwayfarer . These lewd characters needs a slap like this. Good that you stood up. 👏👏👏", "vipulrao.in": "I have a simple question - if you are comfortable wearing a bikini then what is wrong in shooting pics of you in your comfortable piece of clothing", "pencoffee11": "For all those people, who have taken liability to give demeaning comments. First of all, its her profile, her choice and her body. She can do whatever she wants. Secondly, she didn't follow you. You guys are following her. She didn't send her photo to you, you are looking at her photo with your own wish. So telling her about sanskaar, culture and all is baseless. Demeaning her in the name of wearing small clothes, can you give a logical prooved theory for what you are calling her names and saying all bad about her. I dont know her personally; but still its unfair and unjustified to call her every bad thing, that you guys are saying. You have so much problem with her, then dont visit her profile. Dont see her posts. Why are you guys still looking at it. And one more thing, many people have mentioned publicity. She is famous, people know her. But what about you guys? Saying all kind of names, isnt that publicity.", "sahityaschaos": "well done. shud hav taken his phone in ur hands sayin lets click a selfie n instead shud hav smashed it on the ground. apply some bronzer on his face. #moron", "the.wanderlustsoul": "Well done....👏🏻 Morons like this shit need a lesson. I wonder do they have mother and sister at home or they are just aliens. Bloody Mother fuckers.😡😠😤👿", "leo_prasad2025": "Publicity K liye kuch b karte he ye log", "hiren.gokani_2212": "This is indeed a bold step. #Respect your act to go public and expose such morons......", "kunwar_suren_singh": "Famous hone ki #Ninja_Technique... Cheap #Publicity_stunt Next #Media ki beti 👎", "peterdcruz041": "This is just right👍! Old jerks are the one who is a dangerous horny asses. I wish I could kick him right at his manhood😠 Would he do such things with his female family members? Why is this Indian community going downwards day by day😤 He thought you will just ignore that being filmed and captured by him. He didnt expect this twist. India is the only country as far as i seen, people worship women as God at the temple and highly abuse other womens in reality. This is indeed so sad.", "shantanujha505": "loved what u did mam.....we should stand against these morons.....lest they should poison our society", "i_akshata.n": "Hands down! Respect to you girl! @redheadwayfarer", "i_prefer_moriarty": "Wooh !!! Applaudable work ... lovely ... 👍🏻👍🏻👍🏻", "mayanks100": "Very well done it need courage and I think everyone women need courage like you well done 👍🏻", "aynaurvi": "These types of men should be exposed.... thanks...", "pravin_kadam13": "U luk like 3rd gender 😂", "kanishqa.singh": "@priyapandey2102 @s_a_kk_u", "makewayforthedoggo": "What do you mean by 'your accent suddenly became Indian' ? Dude you're Indian. Stop faking it.", "yaminesh_ay": "👏👏", "abhi_sankla": "Saale tere beti ki umar ki hai wo", "anunfixedsoul": "We are so proud of you and thank you for always inspiring us to stand up for ourselves .Love you ,women ❤️", "yogabykirti": "@you go girl", "ig_sanjoo": "Make him cry 🙅", "safii_malik_": "khud hi kharab hai ye lardki", "drivyabhatia": "You go girl !", "chocolate_girl0000": "You are right👍👍", "kishan_mahida": "Sirji I'm with you ✌🏻✌🏻", "karnika_singh": "@redheadwayfarer you should have called the police. You should still do it.", "samriddhi_majumder": "@braj_chatterjee", "ashitsharma": "@_scuttlebutt_", "maniksaraf": "the thing is, people are legally allowed to photograph you in public spaces or if you are a public personality", "priyanshi_712": "Thankyou so much for posting this mam....i really appreciate your attitude , you are the most bold and talented person ....you are inspiration to many of us in many ways .... thanks for giving a message that even aged people also do these types of disgusting things ..... Ily❤❤ #boldsaloni", "quusssaaaaiiiii": "In all honesty what he did was not right, but then again you face your own karma, when you act like slut and flaunt your self in the name of feminism then you deserve it. Modesty is everything. Feminism isn’t about making women strong, women are already strong, its about changing the way the world perceives that strength. And here you are flaunting your nipples and butt to show your feminine side. That is not feminism, that’s entirely the case of education without values. @redheadwayfarer", "_shootmodeon_": "Ducking ppl", "rawwmazing": "Well done girlie..we're proud ✌✌👌👌👌👌👌", "jacks_parro": "@sapa.dhaani look at this", "irumdua": "What a moron", "_suhita": "These are the kind of uncles who goes around molesting everyone😠😠", "shrutiadya": "@nehakakrani88 @apoorva.kakrani", "chirpy_tinyhuman": "@yuvkashyap must see!", "vaibhav__z": "These fuckers need a strict reality check that clicking pic and masturbating aftrwrds seeing them doesn't make them a MAN", "sonalee_desai": "You did a great job.", "sandy_ujjainwal": "You did a great job that type of people are fucking basturds", "nsink7777": "This old man talking in English and his action is like street ileterate man ...shame", "highwolxf": "Did a great job fuck his happiness @redheadwayfarer", "inebriated_rohit": "Sanskari uncle with 1 GB stock of porn #rahpte_dhar_do", "i_anejahoney": "This happens way too much is a concern seriously. Way too many random people click pictures of girls in public places without their consent. It is sickening that is exactly how rape culture starts.", "shubham7089_": "Hahahaa hahahaha hahahah", "kalyani_kofficial": "Moron onl🖕🏻", "deepali.negi.1217": "Kick his ass.....", "ilyaskhan_91": "Need a Shazam app to easily search for people using their pics or videos! Would be a disadvantage for many though!", "j__vagabond": "@bczmthemen", "smritilaskar96": "Well done", "kinni_joshi": "Respect!! You goo girl❤❤", "dan.husain": "Despicable. The complicity of @lacabanagoa angers me further. They should realise that this is the kind of behaviour that perpetrates rape culture. I am certainly not advocating @lacabanagoa to anyone ever.", "bob_clicker": "Give a tight slap to such fellows who does these bekar things @redheadwayfarer", "_shubhangi_singh___": "👏👏👏👏👏👏👏👏👏👏👏", "im_sankita": "Slap him", "simranpatel2001": "@nikita262001 @jahanvikhokhar001 read this 😑", "himangineesaha": "@surbhi_ag @_.sneha_dx._ @avishakhandekar", "gadabout_d9": "@redheadwayfarer it's on the news too now !! 👌👌👍👍", "i_am_s_r_": "Very bad send that Idiot to police", "abinashbajubondho": "This video is not natural", "travelalpha": "By the way he is not from Goa. Some pervy tourist from the North.", "a_unicorn_adoptee": "I'm so proud of you! OMG! ❤️", "such.as.mee": "fucker man", "shrama_mihir99": "He is such a fucker person", "niyati_rasania": "I have faced it too! #metoo", "_shuvangi_": "Wooooo!! U go girl😍 osm job done♥️♥️♥️♥️♥️♥️♥️♥️♥️", "rsdkhan786": "You would have punch on his face...", "harshvardhansingh93": "kick his balls out....!!!!!😡#rapeculture", "naharbhavana": "Well done @redheadwayfarer really appreciated for your efforts .. No one has any right to click pictures of anybody without permission 👍🏻", "sheelapillai92": "Well done. You've done a great thing. Those assholes deserves this.❤😘", "viraj_rajput20": "Click his family members pic and viral on socail media", "apoorva_bangur": "File a FIR against hotel staff and this man 😤😤😤😤", "rohitkalia": "@vs2225", "ritzzyyyyy": "@saurab_afc @aliceminj @deepasahu09 @sharmamadhuri218 @deepti_kujur @anshu_aatankh", "ishikagxx": "If someone else would have done the thing with this daughter or wife , he would have understood . Such men should not be called men , because real men know how to respect women .", "anujagarwallife": "Buddhe logo ko he sabse zayada tharak hoti hai...", "kunwar_rajdeep": "@redheadwayfarer hahahahhahahahahahahhaa made my morning ..good one. Look at his face when u said \" this fucker \". Braavooo. Every girl shld fuck up such guys by themselves only then they will understand. Kudos", "vishal_bharadwaj22": "@redheadwayfarer I have been following you since you had a few hundred followers and have seen you progress from a likeable girl next door to a fame hungry piece of shit. 1. You call som random guy a fucker while he is watching some random video on his phone. 2. You post that video on Facebook as well as insta trying to get all the sympathy fame you can while the guy in question has no clue of his defamation and character assassination by thousands of people. Lastly, I hope he sees this video and files a lawsuit against you to give you little piece of mind and reality check.", "chaotic_maiyya": "such an asshole", "thejoshuadsouza": "Goa is made unsafe by such horny bastards who come to see women in Bikini in Goa. Cheap assholes like these should be thrashed in public.", "arty_tyagi": "For all those geniuses who've been calling her a liar and fame monger, use some sense... Had she been lying and just shooting some random guy's video, his first reaction would have never been \"just delete it\", he'd have been surprised/taken aback or more like \"wtf/ lady what do you think you're doing?\"", "pramod_jha": "I am big fan of your’s plus I am in no support of that guy but look at the latest 2 posts of yours.. Ironical.. isn’t it? Whom are u following bruh.. rakhi sawant?", "imanitrajput": "I can see Your Politeness in video 😑", "sunshinejagjyot": "This girl is lying", "manmohansaroya": "What an ass. Idiot", "kpriyay": "Hahah, you handle things with such a swag", "tanujmudgil": "Or aise hi kuch logo ne ye baat saabit kr rkhi h \"Men will be Men\" or India m to hadd ho chuki h...#respectwomen #lovewomen #isupportyou @redheadwayfarer #changetheworld", "_dimple04": "This guy really deserve this well done we all with u 👍🏻", "neha_talwelkar": "You have so amazing guts to have done this!...this patriarchy driven society thinks they cant respect women n get away with it...", "handmadeloveindia": "Love you ❤❤", "riddhi_makwana_": "Bloody f**kers 😠", "sun5_1994": "You are lucky because you are a celebrity. One of my friend tried it and got a defamation case in return. She is still suffering.", "sardar_gurvinder_singh": "Hahah just delete this fucker from this planet..", "g_y_p_s_y__t_r_a_v_e_l_l_e_r": "Well done girl!!! these people should be treated like this only and what you did was the brave thing...", "nazzzzuk": "@anejayatin 😤", "siddoku": "I LOVE YOU SO MUCH THE VIDEO OMG", "kajal__65": "Sue this man", "singh.sinjini97": "Sweeki sorry but samajh nahi aaya baby @sweekriti_sweekiborn", "naziaisreallyamermaid": "@meghnamatthai @aparnalakkaraju @akshaysubramanian @akshat1311 @rohan_bhalla16", "nishagabrielle": "So sorry you had to experience this ❤️", "xiamor": "His behaviour is not acceptable but that's not a reason to trash the hotel. Of course they can't give out sensitive information about the customers...", "nigoooo_": "@redheadwayfarer I Am so proud of you gurl!!! YESSS I BELIEVE IN YOU THAT YOU CANN CHANGE THE WORLD ONE DAY ❤️❤️ WE WILL 🙋🏽‍♀️ strong woman✨💖🌹", "thesmittenfeather": "@nonu909", "shukria.akhtar": "@__.nivedita.__", "malaal.e.manal": "WHAT AN ABSOLUTE DICK WANNA CASTRATE HIM @z.naqvi", "busy_ant_creating_sand": "People who are arguing that she was there for a shoot so what's wrong if someone takes a photo of her and blah blah blah, well here's the difference. If he would have clicked her photo because she is a celebrity and that gentleman is her true follower and a fan, he wouldn't have denied that he took the photograph or the video. He would have communicated politely. The gesture of him clearly states that he did that because he thinks whenever a girl is roaming around in her bikinis, it is okay to photograph her and fantasize it later. He's not a Paparazzi, not a fan, just a pervert. And kudos to you @redheadwayfarer You took a bold stand. Kudos to you ❤", "_.mr_.invincible": "Register an FIR and the police will take care of the hotel and this Pervert..U know what this\"........\" has done is Rape culture\".", "priyanka.mohan": "Such a bold stand.. More power to u @redheadwayfarer", "anindita.mukherjee96": "@akanksha_aman @sushmita4921 look at dis pig u guys!", "sayma_firdous": "Salute to you. And your boldness.🙌🏻 YOU’RE A FOREVER INSPIRATION.💯", "hans.cecil": "Should have told someone to take a video and you should have picked up some iron rod and killed him hitting directly on his face and kill that another guy too @redheadwayfarer", "udipman": "From the description it seems u were at a public pool... So if he clicked your picture in a public area lawfully its not a crime although morally its wrong.. N moreover every story has two sides.. cnt blame him yet with out knowing his side of the storyrecently in my home town lives of 9 boys were destroyed due to girl's false accusations", "natureloverboy1": "Cheap skates", "sumit__jaglan": "Gonna unfollow yu creep... even yu use FEMINISM just for fame.... if i abuse you right know yur dumb ass follower will say ...ohh u are abusing a girlll.... just think you talk about equality", "thehungry_taurian": "Brave and inspiring u r😍🤗", "_gunjanjuneja_": "@taranpreetx", "tiapong_tzudir": "@nippyzhimo @khimdifoe", "paraswahi": "I understand it's wrong for him to make you uncomfortable or encroach your private space without permission but isn't it anyways going to come out as a part of the shoot and this is not me defending him but just trying to understand the difference between wrong and right. If papparazzi were clicking someone in a bikini.. I'm sure it would be deemed fine. No arguments. He is wrong but food for thought", "mrunaalj": "Shared on facebook 💯", "raimakhanganguly": "Sad enough, such pervs are uncle/dad aged,mostly. I was harassed my family friend *uncle* on many occasions and one sudden day when i chose to hit him back and informed mom, all he told my mom was,I 'enjoyed' it. Such men have an incredible talent of shaming the one,they're abusing.@redheadwayfarer More power to you❤", "elliegriffinyoga": "What a douche", "gadkari_jii": "Such man should be hanged off to death", "kanup973": "Such a creep😡😡😡😡😡", "zzakiii": "Daaamn 💪🏋 power to you did the best thing possible exposing creeps 🏇", "bharat_chauhan04": "You need talk to lawyer instead of it. Make it easy.", "prerna.2111": "@abhishk__", "annikajotshi": "GUTS", "i_.shiv_": "@redheadwayfarer these are the roots of mindset of people(youngs) roaming around to peep girls in any dress. They too chant 'sanskar' in their words and watch girls in way as beast gonna hunt its prey", "ojaswining": "Disgusting", "dhriti.das": "You r really a strong woman", "idlenotanidol": "Ugh.", "_anusha_ray": "They should be publicly prosecuted and their right to using a camera should be snached away. This is probably why women are afraid to express themselves the way they want !!", "pb_rites": "Such men. They get away only because people save them. Plus, What's wrong with having an indian accent.", "gtnjli.k": "Whatever you did is right Nd all of girls should do d same in such situations", "chal.fir": "You go girl! You should have punched him on his eyes through his shades.", "amrit_915": "Ohmyygod @sohal_rathaur", "that_white_raven": "More power to you. ❤", "piyaliichaudhary": "@yashic141 @anmol2223", "barkhadayal": "SHameless bloody creature", "aishwarylakhlanii": "@redheadwayfarer i think you should learn some punching or kicking right between the legs tricks... For the perverts like him... And correct... Now they know what it feels to be clicked even if we aren't comfortable with that. I feel genuinely bad by the response of the resort authorities :( but this move of yours have motivated me more like even more thank you :)", "lasssmo": "shame", "m.a.n.d.a.l.o.r.i.a.n_": "These assholes should be walked naked in the road", "aman.addy": "After this.........!!!!!!! what he say to you mam. @redheadwayfarer", "rnkanthony": "I love how you took an action to this Saloni, great job you did there, this pervert deserves this", "weshall_makeone": "I have faced this and many such incidents on so many levels that even cops refused to help me and I am sure lot of girls would have been through the same. But, at the same time I am happy that you have put this up, we need more people like you, stay strong ❤️", "sweekriti_sweekiborn": "@shambhavixo I would have snatched his phone ! And apne haanth Mai leke delete krwati usse!", "roshnee.yeswekar": "@redheadwayfarer just tell us what hotel name it was so we avoid staying there !", "shambhavixo": "@sweekriti_sweekiborn I saw this babe", "pushpraj1888": "We stand with you.....These types of sick needs to be explored.....Good job", "leenachitwan": "I am proud of you girl for the courage.", "call_me_a_spceman": "Such a scumbag he is !! Well done @redheadwayfarer india needs more people like you !!", "yashika.in": "EXPOSEE THEM BISHHHHH", "akziev": "Wow so brave!", "macintosh013": "Does this moron need any more insult? You go girl!", "dimple_naik": "@shashankvara", "rasshmusic": "@nehavaze_97", "nooshanusha": "Thank you for being so brave! 🌸 Please put this on Twitter as well. I hope someone identifies him.", "lapetitemort18": "Kudos! Enough is enough. We aren't tolerating bullshit anymore. @vidyottamak", "rashmi1364": "He is a scumbag! And thanku for being so brave! U really are an inspiration!👏", "aslisukanya": "Moron!! Gud what u did!!!", "rajni1322": "Same kind of incident happened with me and @leisna10 Couple of years ago in bangalore we were trying to climb a tree in a garden and we saw a man clicking our pics from aprroax 20ft away . When we saw him doin this we went to him snatched his phone from his hand and started checking his phone, his couple of friends came from nowhere and said'madam kya hua uska phone dedo kuch nahi hai usme' and i said 'kuch nikla to iske sath tum bhi maar khaoge kya ' and all his friend his friends backed off and we checked the phone and were relieved to see that so far he has clicked only couple of bllured pics and we deleted em and gave him a nice threat and walked away with pride 😊", "_thesing": "U noe he must be having any daughter or his children may be having daughter/sister .. wish his family feels the same .. then he can realise might be or else just BEEP !!!!", "saylii_2908": "Men like these need to get themselves off our planet😅😅 like too much Havas @siddhi_chaudhari 😭😭🤦🤦", "apko_naman07": "Brave 😍😍😍😍😍", "______diagonalley______": "Hats Off Gal 🤘", "raj______singh_________": "Hats off you took it in right direction n should also file a fir against such people", "adishiii": "Kaha se aathe Hein ye chutye log?", "__nysaaaa__": "Make his life a living hell!! How dare he do that to a girl?... Share this as much as you can and let it reach everyone!", "shreyyy_": "@dishajain__", "anvisha_raychand": "Lady u r very strong.....proud of u", "ohmygodnikki": "@redheadwayfarer great job. Poor society. They will tell after all it your mistake even if u take a big step, they will never support you!", "simrankaurj": "Thank you for pointing out these scumbags! This is the way they need and should be exposed", "ravishingtwinkle": "These hotels brands who protect identity of perpetartors and sexual predators are those brands who consider women as lesser human beings and therefore insignificant. The public shall boycott such brands as they take atithi devo bhavo in a wrong way where they interpret atithi to be only man and not woman.", "pearlkaty1110": "I seriously don't like these kind of uncles..", "bidisha_23": "@deepshikha_291 this has happened to us also", "sarjeetsharma": "Any reason you didn't filed an FIR... he was taking your picts without ur consent... and its a crime... you have the photo you can take it to police", "_little_sparrow_o.o": "Shit! It could be their daughter like what do these men think of themselves, they move around teaching people lessons of modesty and that's the fucking modesty that they show around girls. Like it's just about yesterday, while i was travelling through Delhi metro and an uncle asked me about some routes, i was wearing a normal top, with a normal neck cut and some 'normal' little skin was visible on the back of my neck, just like her wife's or daughter's; and he intentionally touched me on the back of my neck while gettting in! I was boiling red still kept quiet but fuck, why? Who gave them a right to touch! Shameless morons! @redheadwayfarer i love you, i wish i could go back in time and slap him.", "rickey.yan": "@beautiful_nightmare_31 suwali koni kobat dekhisu. But kot dekhisu pahorisu", "aeratherajeev": "This is fuckinng brilliant! Way to go, woman!", "marpuraj": "Some one should do these things his wife & daughter", "whosakshipandey": "@sohaaam Assholes everywhere.", "jyothisingh88": "Bloody bastard they treat woman as their personal property it happens here n their with every girl ...am glad that u took a stand..... should have punched him ....oh but we being an Indian lady couldn't do dat.....fuck this society n fuck these morons.....", "deveshsoni_26": "आपको बिकनी में उसके सामने जा के बोलना चाहिए था उसका सब उसके मुंह में आ जाता", "keekobsession": "U should have snatched his phone and destroyed it...!!u should have gone ahead and slapped him..kicked him...pushed him I to the water..I swear men like these!!!god!", "raiabhinav1234": "Treated him well...so appreciate yourself", "madamtalksalot": "These men are the type that will click a girls picture without consent (bikini or no bikini) and then they'll say things like girls today are so mordern its not good for our \"Indian society\"", "ananya_saxena666": "Omg he’s such a fucktard!!! Why don’t they die?? @aditi3_ @manish_gupta10 @scooby_7_adi @harsha_gulati TAG MORE FRIENDS AND SHARE THIS ASSHOLES FACE", "swarnachandana": "@redheadwayfarer why can't we start sharing the pics or video's of such F**ing people and viral them until the girl get justice and platforms like this are best place to do and I take initiative by posting this video in my story. Guys lets make him famous. Please share this video till it reaches his friends and family members. We may not get more likes or followers but let us hope for some change", "leon_a3100": "Clicking photos of others without their consent is wrong. A lot of people i know do this. I have to admit that i too have done it at times but after watching the first episode of 13 Reasons why i realised what the consequences of such an action can lead to.", "anish_kumar_h": "Even saving photos of stranger without consent is not good. Some people just never learn #losers", "sheetal.madane": "Y don't u complain to the police station", "kritika_nakshatra": "Such assholes everywhere! They now don't even leave delhi metros. Nowhere feels safe anymore.", "argussingh": "Sahi kha", "shefaliyadv": "@ky.25 fuckers everywhere. Read it", "nigamanukriti": "@unnatisshukla wtf", "neha_kalani0": "@nidhi_kalani @shahiljn @sonderist_pirate", "euge.niale": "Congrats for your courage ! To hold on and denounce this odious person. ✊❤", "beautiful_nightmare_61": "😷@rickey.yan", "areenagagan": "I hope he gets arressted asap... n @redheadwayfarer u give a whole new energy n bravery to other women by sharing this story coz mayb next tym v will rem wht u did n not juss let go morons lyk dem.. kudos to your personality... u inspire tons❤", "dee_sharma_": "Such a pervert he is😡😡😡😡", "fankara_here": "Nah they feel are Kam kapde pehne h toh Aapne baap ka maal hai ....or in jaise ghatiya logonke wajah se India m ladkiyan free nai hai BC kyu Yaar or yeh budha Ghar Jake apni beti ko bolega nai beta yeh mat pehno yeh mat karo bahar ke log aache nai hai ...bahar kyu jhank rahe ho Aapne andar Dekho ....na hum se society Banti ...pehle aapne aapko saf Kar phir bat karo na ...@anushkadisco 😠", "battatawadaa": "What the actual hell?!? Pervert", "manshaisthename": "@bhavya_gupta05 @apurvar1010", "manojextreme": "Old pervert. He deserved beating, slaps.", "prernayadavishere": "@rohinisharma93 @secre_tdestiny caption and courage 🙌🙌👏👏👏👏👏", "mishti_doi_swagg": "I can feel you ma'am..as I've faced something similar while Chilling out at digha beach with my family. There was a man of my father's age or probably elder than him..making my video while i was just standing near the beach. As soon as i saw him..i gave him a long stare ..n he started acting as if ..he was doing something else on his phone. And the most disturbing thing was..i was just in my comfy shorts n t-shirt..and i don't know what made him or provoked that fucker to videograph a girl of his daughter's age. @redheadwayfarer", "mselfin": "What a scumbag", "_u_no_who_am_i_": "Did you found out who this guy is cause' a months ago some of my friends were on a trip and told me that a old guy who looked like a grandfather to a small child was taking pictures of girls at the pool and gave the description of a guy who looks just like this guy. They also said that when the reported this to the hotel authorities; they refused to believe anything saying that he is our regular customer so we know him and he cant to this", "darryduh": "Guys please go and comment on @lacabanagoa so that they realise that the world DID notice what they did.", "aasthao_o": "You are sooo brave n every girl here is inspired by you,love you soo much n more power to you girl :)", "samy.jam": "@redheadwayfarer proud of u girl👌🙌", "badabing._.badaboom": "I was smoking with a couple of my friends and we were inside a park sort of a place and there was a canteen nearby for the doctors. We were looking for a place to sit and the guys inside the canteen started to line up and point fingers at us. We went away and sat away from them but one of them started clicking pictures. I could see the was holding his phone vertically and the flash was on. This is not the first time it happened to us as we were snapped before as well while we were smoking. So we were so done with this shit that we went inside the canteen. The guy went inside, deleted the photos and then started shouting at us. So many people, including a few doctors were there and none of them helped us. They all knew that he was clicking out pictures.", "amrut_akki": "@heen.ie I demand he be executed right now.... And @lacabanagoa seriously, you guys have been an ass kisser to that moron.....", "_kickassie_sensei": "@_shiv___________ @deepali.negi.1217 @vaishnavi._.thakur aage tag karo...dekhae zra kon hai ye uncle!", "ghotra47": "Bhot Badia km kita esda face show kr hun esde wife ta puch gyi esdi daughter tak video es nu fr pta lgu ga. U have great job to show her face. Cll women police", "van_i_ta": "@anmoldeshmukh 💯", "_shiv___________": "@poonamyaduvanshi22 @anshi__05 @_ishitaa @jitu_bhu_", "tejaswini__bakshi": "@redheadwayfarer i love you mam😍fuck these kind of people", "pooja_s22": "👏👏", "anujaachauhan": "Commendable👍", "shivangi_197": "Look at this mans guts, he is asking to delete his video😂 and what happend when he clicked ur pictures, stupid.", "vandana1341": "tharki uncle 😡shameless", "rohit7301": "Seedha chappal nikal k marna tha na is budhhe ko", "ayesha.jain.1806": "@jimmy.jain10 @supriyajain92 @khater_surabhi @komal_.jain @puja_agarwal3003 @megha_harlalka", "p_shw": "Wat happened later then did he delete ur pics..??", "vibhuti__03": "PROUD OF YOU GIRLLLLLLLLLLLLLLLL.", "kaushik.kd": "Iska chappal dena tha wo bhi mo pa. Jao apni maa bhan ki bhi pic lo . Proud of u @redheadwayfarer", "singpriya1996": "😡😡", "sanaaakaleee": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "saheen_mehzabeen": "Ur such a brave girl to shoot a video nd that too standing so close.. if i were u I would hb Just let it go like u said.. I'm really really happy that girl like you r so brave❤ I hope i can b u someday @redheadwayfarer", "yashrajx": "@sanuchow", "grisha_vthawani": "U can complain abt him by dafa 354 .. u can throw him behind the bars !! I m with u in this .. call any women helpline nos .. they can find him anyway", "mehak_chat": "I was in a salwaar suit went to see the taj mahal, atleast 7-8 men were taking photos of me and 14yr old cousins who were also in suits, i got in a scuffle with them and no one came to help us, i forced one of the guys to hand over his phone and flung towards the river. To which other men standing there started verbally attacking us. Key words, I WAS IN A SUIT, at the most public place there is, now, all those judging ass holes can let me know how does a bikini or a beach matter.", "yougot_megoing_": "Everyone report the hotel account too", "himansh1996": "Report that hotel to 😠😠😠", "oh_pretty_pree": "Such a pervert 🤮🤢", "angelicstp": "Yeah girl ... keep it up ..! We need to tlk loudly so dat they can understand we don’t like it at all ..! @redheadwayfarer", "madonzubin": "Shame the asshole! Post it on every platform till folks identify him.", "ankit_garg_001": "Such a shame for #humanity ! Now it seems he always used to click nude photos of his daughter too #insaniyat #insaniyat_pe_dhabba Such an asshole,Such a pervert he is 😈😈😠😠", "deansamuel": "\"just delete it\" 😂😂😂", "am_a_k_k_u": "Hehe good @redheadwayfarer 🤗🤗🤗 always support u .... 😘", "adityasinghpunn": "@dhritikharbanda", "sree_vkn": "It's gud that u made a video n showed his face", "vijits10": "The man is moron, no doubt and should be booked for his offence. But @lacabanagoa should also be held responsible for not supporting you. The whole thing happened on their premises.", "taniya_chaudhury": "Such a pervert @_trapti @d4rsh1t4 @itsmisschopra sahi Kiya Bandi ne", "aganguly1978": "😡😡😡", "pihu_diva": "Thori toh sharm karlo uncle 🙏", "mayank.myk": "I'v always think about what u do whole day.. that things i dnt like much but.. this one chnged my mind about u lady.. love it .. such a dare .. trully appreciable .. love u for this. N just keep doing such good things.. n make girls stronger.. more n more.. evry grl is not strongr from inside.. as like my gf 😂 but she is also following uh..for this one i'll suggest grls to watch this bullshit of tharki buddha .. grt job ma'am... 😘😘", "tishadash": "Well done @redheadwayfarer", "iamchiragcool": "@redheadwayfarer salute to u for expose these men", "amit_singha___07": "Well done girl", "akshaya_mehta": "@kritisism this guy is the definition of disgusting.", "the.virgo_queen": "Yes even I can see reflection in his glasses and phone too. Such morons deserve this only. I'm proud of you @redheadwayfarer This should be shared. Thanks a lot. I'm always with you", "bhels05": "@dora.xavier2020 sab goa mai hi bhare padhe hai😑😑😑", "jahnviie": "That's actually what happened with us when we visited goa last week.", "belli_oyabun": "Bad manners", "priyanka_bodkhe": "Brave @redheadwayfarer", "jaydevrajput786": "Proud of you", "ankitaagnihotrilove": "Applause & hatsoff to your gutsy action towards such an asshole.", "shweta8362": "😠😠😠 omg I hate men's for this", "anmoldeshmukh95": "@van_i_ta", "amrithanand.ark93": "Awsome response...", "tanvir__khan_": "@redheadwayfarer At present everywhere you can see narrow minded man", "oh_no_ushkaa": "You go Girl!!💕", "shivani92414": "Girl....u r just awesome...love you", "the_bully_inside": "@lacabanagoa who would want to come at your place for them getting harassed and you saving such morons.", "yatinkumar1010": "One word tharki", "suryavanshikamakhya": "marne chahiye tha sale ko😠", "nikhil16071993": "Disgusting people.😑😑 but u have done a very good job😀", "aditimohta": "Proud of you👏🏽💜", "highon.3am": "@anukriti_k yes.", "maltimuchhadiyaaaaaaaaaaaaaaaa": "Hats of too u... Girl... Amazing... Bahot acha sabak sikhaya..... Bcoz of this kind of cheap people girls afraid nd not take any steps against them... Becoz she thinks wht society think about her...nd no family support But.... U hv taken stand for ur self.... Its really really inspiring.....", "ruzal_thakore": "So disgusting man... 😡", "287nishi": "Such an asshole !", "_aanya_bhardwaj_": "Asshole!", "s_.bhaskar": "@aarushibhardwajj man...", "nishthaaa02": "You did the right thing. Upload it on youtube as well", "paggu_paggu": "Batamiz insaan.....", "alykanji7": "@itsmeshafaq", "anummasood44": "I can imagine the frustration. You’re brave and i really really hope someone spots this guy whoever he is and tags him here.", "tanyasubramanian": "The same thing happened with me in Goa. However, the person did apologise and deleted the pictures. But it’s really screwed up having to watch over your shoulder every second looking out for assholes like these.", "peeeaachyyyy": "What the actual fuck??", "the_filmy_kid_": "Wat d fuck. Like seriously? These kind of people do exist? They deserve worst than this .. Kick on his ass.. Fucking asshole 😠😠", "abhijeet_mahat0": "What an asshole ... Baap k umar ka hi hai bas ... But manners to hai hi nai ... You should have given him one tight slap right at his face because he deserved that 😤 #staystrong #breakingstereotypes #supergirl #lotsoflove❤️ 😅😘😘 @redheadwayfarer", "itsmenirav100": "You should find his identity - these nuts should be taught a lesson.", "bee__buzz": "Really proud how good u handle that. Such guys should be treated exactly that way ,they deserve this shit. Then only they LL understand .", "riyasharma104": "Perfect example of fragile masculinity mixed with misogyny and ignorance.", "aparnasharma94": "@tashiannabhuller they are evrywhre 🤢🤢🤢 such disgusting acts should never be tolerated 😑😑", "pallavi.chahal": "Horrible", "1910xx": "You should have called police immediately", "oy.shruti": "Slap him duhhh.", "itzsxg": "@dxy_xo @amratiq @x_niax @http_hxniya how do people like this exist.🤦🏻‍♀️", "shatabdidutta_": "@anishadutta36", "merlin._.mathew": "Proud........! 🤗😘", "oldscoolgurl": "YOU GO GO GO GIRL! SO PROUD! That's the kick-ass attitude every woman should have for such assholes.", "prathikshabhojaraj": "Such desperate dickheads! 😑 You did the right thing girl by confronting him this way. Should've actually slapped him because when you tried asking for legit help, none responded right? So nothing's wrong in slaying such bastards!", "dp660": "Proud..", "divyanshisingh11": "Look closely and you'll see that his camera was OPEN even in this video", "rasheda_mumtaz": "Good job", "amber.karat": "He deserved worse than just a video of him.. a kick on his crouch is too lil!! Disgusted with such humans! 😡", "shreya_bolla": "👍", "shilmetu27": "Take a awsm desparate stand 😍.. Bravo girl.. every girl should do ds fr themselves.. #bravo 👏👏😘❤", "vijayakabajo": "🔺🔼⚠🍙🔽", "radhikaa.sharmaaa": "Inspiration❤❤ hats off to you girl !💞💞", "a_memeoir": "What an assholeee you should've snapped his phone away", "fromranchitobyronbay": "@shethepeopletv", "tapasyaaa__": "That's so horrible!", "sayan4331": "U r brave & u did a great job yaa@redheadwayfarer..respect...but if u punched right in front of his face & kick his ass it will be better for those victims, who suffered these kind of things..", "anuja_arvind": "Anyway.. U have done a very good job 😊.. U r such a inspiration 😘", "raul_rm07": "U should have kicked his balls right there n straight away take his phone n report to the resort manager n police or else these bastards will continue to do so to other girls aswell... 😤", "imraviii": "You should have kicked him😡😡", "deepashasachdeva": "@aashnasachdev", "neha6747": "Wow. You are brave. Setting examples for us all.", "ipsita_taluja_kashyap": "Bravo... U did right... U deserves this... Shameless uncle let ur family also see ur deeds", "sana_sayyad29\nVerified": "Verified", "prernaakashyapkhatri": "You go girl!", "atulbahulkar": "Call the police..n they will do the needful", "rakshana__": "Most of the men continue to do such things becoz they think we women are afraid of them , that we don’t have the guts to stand against them . You are a confident independent woman ❤️ proud of you ❤️ This nation needs more women like you ❤️ @redheadwayfarer you’ve always been an inspiration to me. ❤️🌷 ly ❤️🌸", "amit7096": "Awesome... That fucker needs to be exposed.", "the_rp_1411": "What a horny son of b**ch.. Respecting women is our duty.. Not a favor to her.. Giving her privacy & comfort is all that a women needs.. Person at this age should understand that..and thanks for raising ur voice @redheadwayfarer this will help at least some of the women to fight back.. 👍👍👍", "sheethal_chinnappa": "This is so cool Saloni !! This should be done with every fucker like this who have no other business than fantasizing around women who are just being themselves!! 💃Shame !!", "itithevixen1395": "Douchebag! I\"m so glad you took a stand. Men like this are a dime a dozen, so deprived that they need to take a woman's photo without her consent. You have inspired many girls and women to take a stand. Thank you for that and so sorry for your experience.", "pantshalaka": "Hang that bastared 😤", "_shreya.kohli_": "You did a great job 👏 you are an inspiration to many. And that pervert needs to be ashamed of what he did. #fuckthesekindapeople 😤", "sonia.sabnis": "@uzmashakra @aditinayak03 @ve_ronicax13 @_mash_mellow_352", "riptighosal": "They deserves this kinda things..such morons..shit..absolutely they should be known by their faces & we should do like spiting on them & at least \"hey that guy who assulted women\" address them..only then this should get stopped..u did it Right..more power..u r our motivator to say \"NO\"..", "modestraveler": "You should be slapping such morons.", "tuba_tahseen": "@arshi.safdar That's why I love her.", "srishti_jhajhuka_": "Well done❤️", "__sudeshnadey__": "You are a brave girl ... 👏👏 These type of people are everywhere and some people are also there to support these perverts. You protested and what you did is great. Everyone should see his face, his true ugly face that what kind of a person he really is. 😣😣", "nidhi____makwana": "Awesome well done really its awesome", "parnita_07": "Oh my goodness!!Bloody desperate asshole..I hope you're fine and you did absolutely right that you made this video..at least thousands of people now recognize him and he very well deserves a good thrash..I'm a big fan of yours from the days of \"Girls on top\" and my love and respect for you have increased even more with time..You are doing great and lots of love and strength to you😘😘😘😘😘😘😘😘", "madhuk_jha": "Chittad maarne the mam 10 12.. Shameless animal", "25_mansha": "Stupid tharki uncles will never change, you did a great job 👍🏼", "adityagurjar9": "Take him to police", "kirbyamour": "@lacabanagoa that’s bullshit protecting a man with such inappropriate behaviour. We were considering as a family to visit and stay with you when we came to Goa but after seeing @redheadwayfarer posts but if I can’t feel safe bringing my daughter (or myself for that matter!) consider your decisions with this situation just lost you at least a two weeks worth visit from a UK family! And I’ll be making sure none of my friends or family come you way too.", "diptrix4967": "These type of losers are everywhere.. Nd the worst part is that there r supporters of such people.. And i m proud of you that you instead of letting it go.. U protested.. Proud of you girl..", "notsosanskari": "@visheshkapoor06 now this bastard is another level!", "eggplantsanyasi": "So sad :(. Love you @redheadwayfarer i want to punch him and gauge his eyes out fuckin asshole. if i were there i would've jumped on him and snatched his phone and thrown it in the pool and then crushed his sunglasses and i dont know what else i would've done.", "aminomkar": "Why u haven't slaped that motherfucker....", "_vinnie_mehta_": "These types of bastards u kw u will find everywhere u just need to slap them so fucking hard n these buddhas are assholes😣", "muzahith_khan_khilji": "Such a u sonali very brave girl", "beautifulreasonss": "GirlPower ❤️😀🤟🏻", "trektravelmiles": "India will never grow !! Such jerks should be killed there itself .", "parekh.mayuri": "Proud of u ! Such creeps sure need a lesson ..", "jainshank": "Wt u did ws rite. Dis type of morons deserves to b exposd like dis nly. Respect fr u @redheadwayfarer. Realy disappointed by @lacabanagoa for supporting d wrong people.", "simran2310": "I just hope and wish that any women from his family gets to see his real face.", "aboyviews": "Tharki saala..jail him", "madhoo96": "Whn my sister n i were in @baskinrobbins the person selling were taking pic of us, i didnt have the courage to confront him and remained silent. Now i regret not doing so!", "aarti.yadav_09": "he can never be modern in his thinking n the way he acts watching girls in short dress must be vulgar n cheap##uncle ji sudhar jaao apne dimaag se bhi ab toh", "jayanandsupali": "Good going. Such filth of the planet should be publically shamed.", "zerxeswadia\nVerified": "Verified", "narshid_anowar": "Hats off to u girl... People should know about this type of morons!! #shameless @redheadwayfarer", "ankitabangera": "We need your world to be more strong", "moon7lunar": "What a fucked up man. Sharm hi nahi hai.....", "helll_fire21": "Hats off gurl,, 🙌 @redheadwayfarer", "i___saif___i": "Ik thisssss mannnnnn @redheadwayfarer ssrly yeh toh maara haiiii ..... A few days back he died .... M sure he is tht person onlyyy", "gewoonheena": "What a mofo!", "allthoseflaws_": "@vedii._.kaa omg she did it right. Such a moron though. 💔 and the team of @lacabanagoa , that didn't even tell her the name. So disguisting. 💔", "rishabhjashnani": "Salute to u mam huge respect for u ✌️", "s4siervo": "perverts and this kind of persons give statements how a girl should dress.... Bastards.....", "_masaladosa_": "Amazing. Well done. @highon.3am", "mehul_solankii_": "Why didnt u beat him up and then go to police", "astha_vohra": "A similar situation happened with me in December 2017 at IIT Bombay's Cultural fest. As my friends were posing for a picture, I observed that a guy was clicking their pictures. I got furious and insisted on checking the phone to which he replied that he wasn't clicking anything. I snatched the phone from his hand and on seeing I found he had clicked pictures of my friends. I was shocked. I wanted to take him to the police but I wasn't sure of how helpful the police would be. Nevertheless I deleted all the pictures from his phone. But to think of it, how can people be such perverts to us, why don't we have the freedom to wear what we wish to wear or even get pictures clicked and be carefree. That incident and many other are such deeply ingrained in my mind. I am scared about the real power that we girls have in this world.", "adam456g": "You did the right thing.", "manishdekate": "That bloody man should deserve slap on his fucking face. due to such ppl, girl/women in our society couldn't live freely.n it's more disgusting when we see such kind of old age ppl doing such nonsense shit....!...#ISupportSaloniChopra @redheadwayfarer", "rupak_3_": "@toli_yes", "kalakarsaee": "I respect u.... Every girl should be like u....", "the.backup.brain": "@_aniket_bhardwaj_ best thing on the internet today", "yogeshhsahu": "He deserves this 🖕🖕", "flashespearlies": "Can't police do anything in this? Goa police? Did y'all try?", "riyadeolous": "Fuck the negativity girl! You've got such a long way to go! People need to see these morons still exist and that's such a bold move to share it openly and even record it when most of people get screwed up. These faces need to be shared! You go girl♥️", "persephone_.12": "@nehaa_r 🙇🏻‍♀️ this happened to us at the beach, bt den the lifeguard saw to it and beat the guy up real bad, also threw his phne in the ocean...this guy makes my skin crawl 🤢 Really dissappointed in @lacabanagoa for not doing the right thing and taking a strong action agnst such perverts! #morepowertoyou @redheadwayfarer", "barkhasingh0308\nVerified": "Verified", "bin_laden______": "You could have slapped him", "shantanug28": "@redheadwayfarer You said it happened couple of days ago. Why you took so long to post it? Should have posted at right at the same moment.", "diksha_menon": "😡", "abycalypse": "This is horrendous ! Shameful pricks!", "deepika_tamang01": "Bravo👏👏👏", "harshi152": "@redheadwayfarer He is a disgusting person😡😤", "ishitaaa1998": "@medhaa.tewari @vrindapandit", "ayushithakur": "@lacabanagoa This is highly unprofessional, not to forget unethical on your part. If you cannot ensure the safety of all your guests, shut your stupid hotel down for a while and go learn a thing or two about how to deal with such a situation. Moreover, be aware of the legal consequences of your inaction.", "nishamishraa": "@_nehamishra This is how jerks out there.... Literally I feel smashing the one no matter even I would have got beaten up but I wouldn't have leaved", "_pr3ttypriceless_": "WTF! What a creep! The hotel should have given you his name. He should have been beat up. We should share this video so it somehow ends up on the timeline of his friends and family. Perverts like him ought to be shamed publicly, no other way to teach them a lesson.", "viplavgaurav": "@redheadwayfarer you know. . .these kind of person do Moral policing of their own daughter, realtives etc. . .Teach moral lessons to their own folks. . .but this is how they think & react. ..this is their real perciverence. . . If there would be his own daughter in place of Saloni & I would have be the guy on his place. . He would be shouted on me at top of his voice & may be beat me up roudly. . . Such a hypocrite. . ... My message to him. . :- Just go home & make an eye contact to your daughter or wife & recall this incident. . You'll get your answer. . .", "yuvikabader": "Let’s all write to the hotel to release his details. Because technically he did something illegal too. So to catch a culprit, if the hotel does not provide assistance, then they are aiding the crime he committed. So unless the hotel wants to be defamed to be one that saves disgusting men and does not respect women- then they should let the guy be defamed! No?", "chetan__maru": "Mother fucker sala 😠😠", "wayfarerdontcare": "Well done 👍 what an a**holes!!", "nsmehta14": "I hope someone should recognise him and his ppl should know about this. 😡", "bhanita_talukdar": "U literally did the best thing di❤ he needs to be ashamed of himself.. @shatabdi_____ she this..our iron lady😍", "shannon.kohli": "Such an asshole he is.. And how can the hotel staff act in such an irresponsible manner...", "anisha.bhowal": "This type of morons deserve to be exposed like this only....love u girl...keep going...😘😘😘😘😘", "_theblacksoul06": "Ohhhh god! This shouldn't have happened. Take care ♥️", "shuvv_ghosh": "@redheadwayfarer hey can we share this video over FB.. but as your profile is private we couldn't..", "vedii._.kaa": "@allthoseflaws_ @riid.dhii @rmihita @bharvi05 Ughhhhhhh wthh is wrong with peopleeee", "ankushkumar371": "These type of dogs you can find everywhere...#greatjob @redheadwayfarer 👌🏻", "ankitarasaily94": "Most disturbing part of this clip is your frustrated angry voice. I know we have a long long long way to go. But believe me the fact that you are angry , the fact that you made this clip and shared the same is doing a lot to educate everyone that ,this, encroaching on someone else's personal zone is not ok. The fact that you were wearing a bikini gives no one any right to take photos or videos of you. Actually no, even a naked women is not an open invitation. We don't need to justify our choice of clothing or where we hang out and when or other similar choices to anyone.What you do is what we need right now. Your anger and frustration and the fact that you share it on social media gives a big impetus to the women's liberation movement. It is only when we realize we are being wronged , that we deserve more that we can do something about it. That man is just a speck of dust in a huge ass desert. Let's all pledge as women that the next time something similar happens with any of us , we'll not look away and act like it's not happening. We walk up and question, we'll stop this violation of our right to exist in our unique true selves . We'll Get Angry. @redheadwayfarer", "mohinipandey_": "@rain__bose", "amit99kk": "Brave girl 👍👍👍👍👍👍", "anchal7681": "woahh......so much shit around world... we say that teach your son but from this type of parent what else we can expect from their son......Mr. phone holder shame on you!!!", "_riaagarwal": "This is the bravest of the brave action u'hv takn to actually show whats hppn in our society to girls.. N dis has to stop. If a girl wears cloths which reveals prt of her body, dsnt give men the liberty to do watevr dey want. U did an absolutely right thg by puttin up a video of dis. You go girll !! Jus soo happy to have ppl lk u in our society 😚 👏👏👏👏👏 #headuphigh. #feminist", "angatzkpy": "Pito pkr ke", "shittanshu": "Wtf is wrong with the world.. days are way less if we compare n count number of cases. Such shitty head are the one who proceed for underage rapes. I really wonder what is wrong with them and heights of lust I must say.. this UNCLE would surely have a wife n I can easily imagine how this dick brain can treat a lady. M really sorry for the news and Applaud your effort to show this terrorist. Terrorist- yes they are .. physical presence of such people are terror for women and even a CHILD. Salony u r really strong and thanks to your mother to give birth to respectable women with VOICE.! @redheadwayfarer thank you for sharing this.", "si_pragya": "You did a good job saloni mam ✌", "jheel_gala": "@vampira_57 love this girl!", "banjaranbeti_": "@redheadwayfarer you must file a harassment case against the management for not taking any action and also on this ass dumb fuker", "saraazamana": "@_thechakravarty @hiccupishere here :)", "leharanu": "Because of this kind of man India is not safe place 😑", "frizvii": "@shatakshi1396", "_minimalist_foodie_": "These kinda men are shame to the humanity.", "mesayansen": "Yeah coz it's a fake accent", "prince.famy": "These kinda men are the real anti social elements of the society..sadly humanity is fucking lost all over the world..", "praveen_rana_": "Bad thing.!", "lessons_from_lemontree": "Shit peoples", "nidhi_shetty04": "👏👏", "krishna_padhy": "What a rascal he is...", "pragati764": "@varshavijayamohan @barelyfunctionalchow @singh_varsh .. justice be served. Horny uncles need to chill.", "pocketful.of.yoga": "YOU GO GIRL! Shared on FB, hope his family stumbles upon it!", "charu_singh99": "howw ill manrd he is...Shame on himmm 😡", "octanekarnige": "Sad to see that such people even exist. I suggest you file a harrasment case against him if find out his details.", "neha_shetty__": "And yet, if a Gay man as much as even looks at them, these people feel \"assaulted\". Apparently consent only exists when the men need it 😊", "alittlepieceofhappinessinme": "I think he I cop in his pants and different shirt, and maybe management couldn't take action😠", "nitir_barla": "@n__grave", "___manzi___": "You should have thrown his phone on pool itself #Mf men", "iam_amanbhatt": "You have done very good job ❤️❤️......the same we all should do with a fucker 🖕🖕", "iam_raghvend": "You are such a strong and a brave girl. @redheadwayfarer", "lazier_than_lazy": "@narendramodi yahi hai aapke ache din ?", "d_deepikadiya": "@ganesh.dada", "debindriya.bhattacharya": "Just like this kinda men, girls hesitate to live freely even. He is tryna look cool actually, what a social insects he is, Wow ? Seriously, Just because of them India is still suffering, *Developing country* and it will take decades to covert into *Developed* Such morons . I am so pissed off mahnn .", "rahul_zr": "Bloody bastards..", "okay.bie": "These cheap mentality men are the reasons why we girls are so unsafe.... These men's only work is to watch porn whole day, following all those pages on Instagram where women are sexualized , staring the models in bikini ( of lingerie store) nd just have dreams of grabbing women 😑😑😑😑..... On the other hand they call themselves decent, feminist , nd ofcrse educated,... These are those men who on one hand cnt think anything rather thn women's body nd other hand think nd talk about their reputation..... Such a bustard..... I think dear u should somehow manage to take his nudes.... That will b much more better for such Horny man..... Bloddy creep....", "jeffs_jamroom": "Ur accent got indian cuz u are indian, no offence 😊", "whats_in_name_haan": "Well done Saloni 👍", "keayadumra": "Shame.", "s_the_symbol_of_hope": "Punch him on face and kick his balls too", "freefirefly_10": "This kindda aged tharki uncles r present everywhere .even in my job one of my very aged senior always clicking pics without asking me but I try to ignore him n these kindda ppl.these ppl r mentally retarded .India Shud provide mental checkup camps for these ppl so they can get some treatment .it's not normal mannn", "wopatlasaladka": "@redheadwayfarer that's absolutely right. People need to see how these fuckers look like. In delhi metro, this has become so common lately, you can find many videos on youtube that have been made secretly and then these guys get beaten by women. And who would we blame? No one. People don't help. Everybody watches the show when something like this happens. We need to show these assholes how strong a girl can be. Thanks for sharing this.", "appyrana97": "such an ass dis jerk is... 😠😠😠😠😠", "stormborn07": "@lacabanagoa #shame", "_aasthachadha_": "@deepashasachdev I love her😍😍😍😍", "sachinkundara": "Ohhoo iski bv ne dkha ho to. Mjaa aajaega uncle ko😂", "khalida.begum": "@abida.begum looks like he has been putting those sunglasses onto his brain too. This uncles mentality is definitely rotten. Need some radiations from sun to burn that Shit down. Such pathetic people I say 😡", "_arti_pandey_": "Tharki buddha", "broodingbones": "@kaushh_rao such strength kada", "ssharma911_": "Oye Uncle sudhar ja", "imran2986": "You should have slapped this bast*** on record for such cheap behaviour ..", "a_man_adhikari": "Aapne shi kiya", "dikki_bong": "@aatkah", "subhav.sharma": "Share this video and make that moron famous! Easiest way of making him pay for his actions.", "neha_semmwal": "I really appreciate .... For this bcz u always take a stand for yourself ... Every girl should be like you... 😍😍", "tomskaslaifu": "WE ARE GOING TO SHARE THIS VIDEO AND GET THIS FUCKER", "vjuntarat": "@wesufa be careful", "sanjanaaaasen": "Physical violence is no good option, but you should have pulled this asshole’s balls out from where they belong. @redheadwayfarer", "riddhiiiiii_": "Queen 👑 .", "imsozeb": "@gowdasharada such a choot this guy is man, we should've done the same to the man that day 😏, More power to you Saloni! These horny uncle's daughter should see this! #bashogayaab", "manojrane2005": "What a moron.... U did it right. Such men's should be exposed n everyone should see how they behave with the women.", "urmi369": "People like them are the reason , we cannot wear clothes of our choice , coz of their mentality we are the ones who aren't safe ! They are the ones hiding , and even getting the right to comment on anyone so confidently coz according to them we are the 'wrong' ones ! Their mentality isn't wrong we wearing clothes of our own choice is wrong isn't it ?🙄srsly man ! Too much respect n love for you Ma'am", "anonymous54390": "kabhi Apne talent se bhi lime light lo...and not always by controversies", "sofia_56057": "How can some one expects some sort of respect from young generation boys if their elders behaves like this such a creep.. i saw such accident in front of my eyes a girl was going college nd she saw a crew of boys near the bus stop i was sitting there she found their presence a bit embarrassing so she came near a middleaged man and stand by his side sudden i saw that middle aged man slammed his hand in her thigh i still can't forget her reaction her eyes was completely red nd without uttering a single word she just walked away.. i mean seriously haw can can someone be such an asshole.... 😡😡", "mahima_sakalle": "@_off_limits__ @vaibhavi_meshram @melisa_philip @_.kritikkkaaaaa._", "welcometoamritcity": "The Stalker", "joanne_0102": "Crazy! Sad they exist!", "swapnild_10": "Slap the bloody hell person and make a case of harassment 😡😡😡😡👊👊", "yagya_narang": "Slap him and get the shit of this person❗️❗bloody morons❗️❗️", "thekhichdilover": "This is highly disgusting & threatening at the same time. The gush of helplessness makes it worse & You having broadcasted such menial face is very courageous. Sending you Power & Love.", "the_red_coat_girl": "Share this video of this fucking ass everywhere. Please do not let him get away with it. An idea. Share it on the hotels fb page. Do it now. Bloody asshole", "zainabnazim97": "SHAME @lacabanagoa 😖😖😖", "hegdedhanush_": "Fucking asshole! Y'all should have punched him in face", "uttara.ns": "You rock !!! I did the same thing on silver beach. Got the sleazy guy beaten up by a ploiceman.... right there !!!!!", "____shivali____": "More power to you.... should have gifted him with a slap...😠", "_hawt_bliss": "U should have thrashed him.", "iheartritz": "@lacabanagoa shame on you. Making sure never to stay there. And spreading this around too. Disgusting.", "shranasulpe": "More power to you 🌸", "uda_parinda": "What an asshole", "nimamukherjee": "thank you so, unbelievably much for this. so so sick and tired of people like this thinking they can do whatever the hell they want because of their gender or whatever stupid self obsessed reason they have. just had an equally frustrating encounter with someone who started shouting the typical 'will you teach me what to do' in my face simply because I chose to comment on what was wrong. more power to you and to us all 💥👊🏽", "vikash._.yadav": "Motherfucker!!!", "manish_ladhani": "You should give him slap @redheadwayfarer", "sakshiguptayoga": "👏👏👏 these disgusting assholes need to be exposed", "firangipani": "@lacabanagoa Good job ! Kindly put a disclaimer- All women guests allowed only if fully clothed from head to toe because we have no control over our men guests.", "akshta_k": "You did the right thing. Men like him should be thrashed. More power to you girl!! ❤", "varun_taurus9": "Beat the shit of his head ... Asshole", "thatbong_girl": "@mistergood_vibes @thatbong_beast", "kulshresthasanskriti": "What you did is amazing pervert like him deserves this!", "_subrata._": "Shame on you @lacabanagoa for looking out for an asshole. It's cuz of this \" let it go \" mentality people like this man get away so easily.", "y_rakesh": "U should sue him !", "carino.178": "I don’t know when people will learn? We here try to bring a change but these kinda men make it really hard. Reason why we are still lagging behind. We are really proud of you Saloni ma’am. These assholes need to be punished 😏🤘🏻 I go around walking in shorts and have like thousands of eyes on my legs as if they’ve never seen any. They need a lesson.😏", "ddevansh_ee": "Same thing happened with me in Dubai. I went to that men n said ‘muje bhi share kardo mere photos’ he was like what. I said give me ur ph. N told him I will call police now. Fear of Dubai police he gave his phone to me. N His phone was full of girls pictures.", "dreaming_with_a_lens": "YOU GO GIRL ! Power to you . 🖤", "shinde_omkar_": "Power to you. Should have slapped that person.", "v.y.a.s.d.e.e.p": "Wtf😡", "_iamgrv": "Brave girl!💪 #powertoyou", "ajju2": "Take legal action, prove it in court. Cribbing about it on social media ain't gonna help.", "palaksodhi12345": "Good job", "aditisinha4": "@redheadwayfarer Proud of you...", "khushi_daga": "Idk what the hell these horny assholes carry in there mind. Wearing a bikini becomes such a big havoc. By making a video of so called \"uncle \" atleast at the back of his mind made him feel guilty. You continue to inspire people like me . I fail to understand every time that for these type of uncles it has just become a mode of enjoyment . But you did your part well. You definitely continue to inspire me and many people out there to stand up against such things @redheadwayfarer", "aiiyyotripathi": "Also I love your voice don't know why", "sharishirazi": "This is exactly the reason why women out here think 50 times before putting on a pair of shorts and going out in public. Why are middle aged Indian men so disgusting?", "swaalina": "😱😱 what a shame , pig😡", "gauriherself": "Losers. Bloody morons.", "_yogesh_avi": "Wtf", "peeceee_": "These pervert 'buddhe' take advantage of their age and if someone complains abt them then everyone starts teaching you only arey age dekho iski ye tumhe kyu dekhega", "_akankshaaaaaaaaa_": "No one has this right to take anyone's pictures without their consent ! Be it a boy or any girl. Men like him who should be serving an example to the society when are found doing such acts of shame then Anyone's freedom is at stake . Saloni You did a great job ! No woman should go through this . People like him are a shame to the society !", "manasi149": "Infuriating!", "witty__lass": "More power to you! You’re the best", "sarikass": "I swear to God... that guy, makes me want to pull his hair out. Reading this is too fucking frustrating. Iam so proud of you for sharing this... Should've just kicked him in the place where the sun never shines. Or maybe he masturbates in the open, bloody ass.", "imsauravlakra": "Hats off!!! U did right mam", "himani.kaushik": "Power to you.", "dubeyshruti_05": "@_avani_bansal_ @ojaswini_tanwar", "sakshi_sarcasm_shukla": "This is not done.This asshole should have been taught a lesson. Atleast one fortunate thing happened that you got the video girl. Idk who are you but you don't deserve to be treated like this infact no woman should go through this. Doesn't matter if you're wearing a bikini or a sari or any damn outfit. #isupportyou #reposting", "raghhavsinha": "Sharam kar Le thoda, agli baar khud ki beti bhi paas aane se bhaagegi.", "thatgirljaaanvi": "Bloody asshole jst see your age first tharki saala! Good job girl! Proud of you! 👏👏", "suruchiibhatia": "Proud of you saloni🙌🏻 #LadyLove💜 Hats off to you .. #ISupportYou", "ipsitatata": "salute youuuu 🙏🙏", "priyankagodhia": "@redheadwayfarer You should have just snatched his fucking phone and threw it in the pool Such people deserve this only 😠😡", "anushreebhat12": "@redheadwayfarer proud of you girl! You are an inspiration for us! N ssly this was really more insulting than a slap for him.😂", "____kimmmm____": "I'm so proud of you @redheadwayfarer I actually got goosebumps reading your caption.", "rashika_sachan": "Hey lady more power to you ♥️", "pranaleeh": "People get away too easily with such nuisance, good that you called him out on it. Until we do so, these assholes are not going to understand the repercussions of their actions nor they're going to be held liable for it.", "khushi_280": "Honestly, Everytime I see you posting such things, Saloni. I wish there were more people like you. You really do inspire me speaking for such things. Much, much power to you.", "its_kritika_yadav": "Well done...@redheadwayfarer 👏👏 See @aakkankshaa", "kiranmali": "Salute you girl .... 🙌🏻 did great job .. 😼", "ankitarawat83": "Waooo soo proud of you girll 💟", "shreyakataria15": "Put this asshole’s video on your fb page as well😅", "aryan4404": "@smrithyy", "shruttiratan8143": "What a fucking an asshole!!!!!", "_b.h.a.v.e.s.h_": "You should've kicked his ass with the crew and asked him to apologise on a video", "ohhfatimaa": "Omg. Suckers.", "kshith_gowda": "Assoles", "nidhijadoun143": "Great n well done mam......", "arshi_safdar_": "@tuba_tahseen look at this asshole", "almost_arty": "Great Job. Should have thrashed his ugly face.", "vrinal_k": "So finally did he delete your pictures or not?", "jiyamehraa": "@lacabanagoa SHAME ON YOU", "naaaaaandini": "👏👏👏", "ameek_mahal": "You go Gurl!🔥💃🏻", "dreamer_cat": "More power to you lady . You did a good job I appreciate your confidence. Well done these morons should b treated like this and @lacabanagoa shame on you people for protecting a morons identity", "anyra1o0": "@aparnamishra24 men his age are super tharkis !! Remember our Goa trip :/", "saurabh_patel": "Well done ...These guys should be taught a lesson like this✌", "evil221195": "@priyaghosh26 @divyanka_adhikari22 @sumonadasgupta", "ashi_dhillon": "Assholes", "kalpgogoi": "Mf", "imma.badass.babua": "Woooahh broooo u nailed ittt. ...this is more insulting than a slap....🔥🔥❤❤❤", "shahnawazkawsor": "Grt work... he need to be exposed", "rajvi_desai": "YOU GO GIRL!", "mr_sahil_37": "🖕🖕🖕🖕🖕🖕 bloody go to hell well done mam 👏👏👏👏👏👏🖤", "rishabdahiya": "Men like him are worst. also shame on you @lacabanagoa :/"}