{"realestatebyrana": "Good one", "dharamveer1818": "Tupi💋", "saadkhan.377": "Follow me please", "nilesh896": "which of thos is your 🤗🤗🤗", "dirty_boness": "Sign this petition for equality on Facebook http://chng.it/NQkpTrHGWz", "uff_biroktikor": "Love your thoughts❤️", "amarxjeet": "@aryan.kakwani tera kaaunsa hai😂", "nemichandranarana": "🔥", "zefiqazi": "osm thoughts 🔥", "jagadamba.jagada.520": "Nooooo", "nileshghutukade": "@janvi.manchanda bhot interest le rahi, dusro se acha khud me hi legi toh acha rahega lol, kahan se itna time ata he tum jaiso k pass trolling k liye", "sachin_sakhre": "Mam ur thoughts ... Salute", "surbhimah789": "@the_sanchi @the_satirical_verses @saloniii_iiii", "peacexoom4": "@call_pune_boy lol nice lessons u giving babies and mothers and evil things ...omg really 1st watch ur profile pic ,,please show ur pic to ur mother and sisters and others cousin sisters and ur grand parents ,,, vulgar mans #sucks#bullshit what going in ur mind how u liv' ur pic sayng / shameless bitch u saying fact @redheadwayfarer", "ankitdogra______": "Writer bn ne ka socha h kbhi aapne @redheadwayfarer . Kbhi sochna writer bn ne ka... Khub. Acha likhti ho", "khanfaizal_": "Scrolling through, Suddently saw this and was shocked and then remembered this is 21st Century bitches😂", "kadambaripujari": "@sidrah_syed", "rishuwashere": "Nipples or Chuche? Which one you guys prefer?", "manyaaroraa": "I read this post and instantly thought the only person I know who’ll get this/like reading this is you. Enjoy! @garima_aqua", "ajeebogareemo": "@manyaaroraa This is beautiful. Thanks for making my day. :*", "ushername2332": "@salima_joyful from sulu to salima. Nice", "tannnishka": "❤❤@redheadwayfarer", "tllachenpa": "I dont know how this is related to feminism and all the rights they ask for aka free the nipple but here it is...i am a girl and i used to live in a pg and i was very uncomfortable when the pg uncle used to roam around the house in just his undies. I think i am a gavar and need to change my mindset or maybe the uncle could be decent enough to not do so in a girls pg...because afterall we live in a society not in the jungle and we are responsible for covering our private parts used for sex and reproduction in public. So i call this bogus. I am as bothered by a man walking without undies as i am when i see a woman without bra...do your monkey business in private", "ssaurabh9": "But why r u posting this pic in public? We know that its part of our body! And its natural that it arouse penis, u cant change it! Is it essential to post this nude pic in public to tell us that its part of our body? Stupid!", "anjana_user": "@syed4zaid", "ishrutiiii": "@ashitasukesh", "rahull_2733": "Imagine some guy posting pics of different dicks with same caption. World will lose its shit.", "fast_guy5925": "Can anyone tell me how is this related to women empowerment..?", "gitika_gigi": "You are one of the rare roses @redheadwayfarer ❤👌", "tahirali_manj": "👌", "ananya_saxena666": "For all the people passing hate and negativity on the comments. Why the fuck can’t you just leave and get a life? The goal of this post wasn’t to promote nudity or arouse some of you creep heads. It was to make people realise that nipples are a normal healthy part of every man and woman’s body so pls stop slut shaming women on it.", "ishaan_677": "gandi ladki .nipples ki.pic kon dalta h ..", "mannan_parmar": "It's so ugly to see this pic 😂😂😂 I mean I have never imagined nipples could look that much ugly by zooming 😂😂 but nice thought mam 👌❤️✌️", "dhwaneeprithiani": "@khushnaidu how did you end up here?😂", "deep10gram": "For all the people saying this is wrong, tell why.", "shivyaasingh": "@tumhari_sulu69 honestly these comments are making me so sick. No one is forcing you to walk naked. What everyone one supporting feminism ( which stands for equal rights if you don't know ) is that when you see a man and women walking shirtless infront of you , you shouldn't be asking the women to cover up just because she's a women. That's not equal rights. Stop trying to pick fights here and better do something good out in the world.", "digvijay_mehta_": "@tumhari_sulu69 guys go can check her Instagram Bio 💕 well said girl well sais", "kratialwaysinquisitive": "Proud on uhh saloni @redheadwayfarer 😭😭", "riyasharma104": "This comment section is such cancer. \"Not everything is about showing breasts.\" Yeah no shit Sherlock that's what she said. Somebody's body isn't your matter to debate. Stop imposing your conservative ass opinions on others, it ain't 1980s no more.", "khushichowdhari": "@redheadwayfarer 😑😑😐😕", "ruqaiyaah_18": "@randheer_gopal for everything which she is doing ....", "madeehanayeem": "Thank you so much @nocturnal.ambivert .", "mandal7008": "Wow wonderful nippals. ..... gorgeous one. ... no needs to to hide such gorgeous part of body", "sidaries326": "She is one of the most senseless, fame mongering girl I have seen in a long time... She is just posting anything and masquerades it in the name of feminism. The kind of negativity she has entagled herself in will bring her downfall one day or another.. work towards some real issues that this society is facing at large.. how absurd \"genderless nipples\" . How does it even matter.. I respect woman, but you mam have lost it for your thoughts and what you stand for are absolutely skewed in a very shallow manner for people are just skin deep for you. Stop doing things like this for publicity.. this does not make our society progressive in anyway. Nudity is not the answer to everything.", "randheer_gopal": "I really don't care what is she posting. But selling it behind the name of feminism is absolutely wrong!", "_aaah.nuraaag": "@tllachenpa lmao hahahahaha😂", "aweshmalek": "@imrazamalek", "optimistic.shreya": "Feminism is not about roaming around topless nd showing our. Boobs just like u do feminism is respecting women and not about showing everyone thier boobs and ovary", "raghav_dhanvinder": "Nonsense", "ravikreddyinsta": "Well said whoever it is, I have no clue! Stay strong 🙏", "fati5932": "Your words is true but thr photo is so ..shit", "anuproysharma": "Which one is yours in the pic?.....😂😂😂😂.....This girl really need some mental checkup", "sher_dewngn": "@toshi__2210__", "akshta_k": "This is amazing!! The society needs more people like you to stand up for this. I don't understand why people don't get this. Yes a women doesn't need to show her nipples to prove that she is a feminist but it's her fucking CHOICE and this is what the debate is all about. Nobody has the right to stop women from embracing their body. So yes this is related to feminism and gender equality. Also, if you don't like this post or her page why don't you just unfollow her and mind your own fucking business instead of spreading hate. #freethenipple", "dedicado._": "@leep_aich @deaureo", "monochopsticks_man": "@__ayushi @__hoetato", "__faizan__khan__": "How disgusting you are @redheadwayfarer publicity ke liye kuch bhi krogi", "pooja_katya": "Wow", "thecynicbeauty": "Two more clarifications. 1. No. I dont work for the redheadwayfarer's page. However, I won't budge away from people what actually they want. 2. On Instagram nudity is allowed on regulated content. You can read the community guidelines for better clarification and ask me in case you have interpretation issues. #genderlessnipples movement remains debatable topic since Instagram cannot differentiate men/women nipples. Again. The point. Please put your nude and ugly thoughts to rest or better use.", "cosmicvibes_girl": "@_o_shruti_o_", "thestupidwise": "This is not about nipples.. This is about human mentality which is trapped by their beliefs and values and ofcourse sheep behaviour.", "myself_kkrishna": "#trollpolicehelpline rash commenters be aleart ... U can be caught be in your limits", "sofia_56057": "@redheadwayfarer being honest ur first impression was really bad for me i saw ur pics on instagram nd for the first i felt disgusting... i use to ignore ur writings because of long texts but now im feeling sick of my self i realise that i was judging someone without knowing her well i was judging you on your pics nd i was ignoring the deep messages.. nd I'm really sorry for that now i understand ur talkings nd yahh u are not bad ur just independent nd bold personality u are one of a kind nd yup support u because its not about feminism its about the truth.. love u saloni😙", "sudhu_0.o": "I have been posting this photo in my story. But Instagram is deleting it again and again. I really wanna ask, are these of men or of women or of everybody?", "wopatlasaladka": "@redheadwayfarer that's so well thought out and written. There is nothing wrong about the way you have shown it here. People who are getting offended by this picture often end up watching \"home-made\" porn and masturbating in their bed. Those who are afraid about their kids getting bad influence from this picture should be worried about their kids using instagram at such a young age. No kind of information is hidden in today's era so better stop pretending about this shit. I am so pissed off about men who are just obsessed about boobs. I feel so damn angry when I'm walking with a girl and men stare at their boobs as if they're gonna grab'em and eat'em. Fuck those who believe that men will understand everything without anyone telling them to stop. #shame", "apb_pravara": "Indeed.......what a brilliant and brave post! Cheers to womanhood!", "nazzzzuk": "👌👌👌👌❤️", "preeti_kathuria": "@varsha_277 @singh_anjali_93", "the_malini_gallery": "Ek baat mujhe samjh nhi aayi nipples to ladko k bhi hote hai to vo kyu itne chaude me shirtless ghum lete hai aur ladkiyon k nipples me konse sukhab k par lage hai koi mujhe bhi samjha do pls", "__mr.sarkar": "@viroitcoalhi", "gauri_lp": "Woman!! This is so good! There will definitely be a time when there will no longer be a day dedicated to us as all genders will be treated equally in every sphere of life. Such a time will dawn because of the efforts, words and thoughts of people like you. So like always thank you!", "ali.sarju": "You pokking girl", "salonijain_08_": "Thoughts like yours are so much needed to be rooted inside people's minds; especially women, because if women themselves are aware and support each other then amazing things will happen and when men unite in this then world will become a better place to live for everyone.", "rishirajgadhave": "Witch is yours", "kikolife__": "Wow! This feels so awesome to know that woman are strong and can do anything they want. @redheadwayfarer can you please help me by giving shoutout to my page! I am new on Instagram and would love if you help me and grow more. ❤️❤️❤️❤️", "ibn.e.yousuf1435": "W♡W..which 1's ur's?", "martrinarong": "@_stars.and.scars_ lastly dear star dust human being m honoured and proud to be a women m lucky that m a grl sooo thankful to god and my parents for the biggest gift that I am now . So thankful that I have brests with nipples not just to get some random guy high but to feed my child when ill b a mother . And btw I look good with them . So dear star dust human get over it be that differnce cz feminism is an honour u gotta respect it😊😊😊😊😊😊😊😊 peace up star dust human this will b the end cz u know what m finnggg tired with ur bullshit comments.", "1743aradhya": "Thora sa v saram ni h Apne sath sare women's ko bhejhte Kr rhe Ho....", "dakshitadubey": "Posting nipple pictures shows how strong we are, right. How the hell is this feminism?", "shekara.leighton": "I get the message and it’s a good message. But some people won’t change, and we all are just entitled to our own opinion. Yes, the body is a amazing thing, and I believe it’s not some body part that makes someone come off as a ‘slut’ but their actions. So when I see someone walking around with barely any clothes...I’m going to have my opinion...but not I’m going to be ignorant and share my opinion to them. That is their body. I’m going respect the fact they have the right. Sorry for the ramble...just got a lot of my chest I suppose. You all are beautiful and keep spreading positivity! ❤️", "saguna_sathyanand": "Yes yes yes", "memon_anvar": "😴😴😴😴😴😴", "poonam.ish": "Sab baat ek mei bol di saloni 👏", "_stars.and.scars_": "@martrinarong you people want to talk after knowing whethet i am he or she. My gender is all that matter to you and not my being born a human. You fell in your own trap. 😂😂😂😂😂", "pcube_art": "@prabhatmishra2000 hahahah....as if she invited u to follow her!!! If u can use your brains to understand the actual meaning behind the post then directly leave na...what all I can say is get well soon dear! I hope u do some research before opening mouth."}