{"lakshyathakurani": "@redheadwayfarer thanks for replying. But what I think about equality and women empowerment is that its needed in urban areas (villages) where women is sexualy, physically n mentally torchered, abused n harassed but according to you women empowerment is wearing short chothes , drinking, smoking, late night partying if this is women empowerment I don't agree with it.", "inischaysaraogi": "@redheadwayfarer I totally appreciate the work you are doing for the society. Dont ever get bothered because of people like @lakshyathakurani . They are a big black spot in the society and your thanks is well deserved by my Love #AditiSinghania she is the one who made me rethink on it and stop this kind of nuisance created by the people . #KeepItUp 😊", "divanidhi": "wtf u doin attention seeker @redheadwayfarer", "sakeofovi": "Fuck the bloody society...", "rupal_pandey_": "@redheadwayfarer bro :) hatssofff❤️", "poweredby_ketones": "@redheadwayfarer world need more like you", "marinernilesh": "@kushsaraogi hello buddy...well please help me understand how not wearing a bra amounts to gender equality and diminish sexual objectification? ??tell me do u even give a damn the girl who just passed by u is wearing a bre or not???atleast I don't. ..so the whole point is can't the whole concept b introduced in a beautiful way..though tht wl not give saloni chopra the required publicity nd controversy tht she wants. .. :) well do Google who is late leutinent kiran shekhawat (im sure u won't b knowing her because unlike miss saloni she doesn't try to bring gender equality by taking off her bra)...well she was a young lady ofcr who achieved martyrdom in the line of duty for people lik us...thts women empowerment. .t will of women nowadays to join the forces..March shoulder to shoulder with men. ..thts gender equality. ..donning the same uniform as tht of men ..thts gender equality ...the decision of indian air force last year to allow women pilot to fly fighters ...thts gender equality. .I would rather prefer reading such posts for inspiration rather than wearing a bra or not. ..really saloni chopra u r trying to create a controversy out of nothing. ...believe me a educated man won't give a damn weather ur wearing a bra or not nd ur talking so cheaply about males here..luk at ur language. ..ur just spreading a sense of hatred ....thts it", "lucky126shukla": "It's depend on society mam... U want to get freedom to women bt once think a girl spend whole life in village she even no idea what's going around... So please do this idiotic post think before a post where some awareness about study.....nd women empowerment where women understand how to claim on theirs dreams.... Not d way which u showing here totally.... Stupidity", "anjali_tiru94": "@poojarao.0608", "theboxinggypsy": "This is so bad!! We all are equal!!", "mahiii_1211": "@divya_choradiya @ritz_222 @janvi_shrimali", "sayliduraphe": "This one @chittoshchatterjee", "smashingsocialjustice": "She does have nice lookin breasts 🙌🏻", "moloybhowmick2015": "So according to u this is called women empowerment! 😆😆", "suhani.bk": "@pariii2181 , I agree with u! Ppl don't understand the damn concept of this post! It's not to show ur body n walk around, it's to tell that we women hv the equal freedom as much as the guys and v can where whatever we please to! Not, going around showing our boobs! DUH!!! SENSE!", "tisha_gurung12": "Bloody hell society", "its_megha_g": "You are doing such a great job @redheadwayfarer . But it really pains me to know that Some morons will never understand the meaning of feminism and equality even if it struck them in the head, repeatedly! I kept reading your posts about feminism and every word are the ones I always thought about or wanted to say. Keep it up..!👍", "miss_rappingle__bunny": "@ankursharma465", "stars_vhf": "Keep going sweetheart 💓", "they_call_me_vivacious": "@lavishmotani", "dvvy_virus": "Izzzat milegi", "champagnemami.11": "And you can't stop anybody doing what they want just because giving a stupid reason of the comparison of dark and modern age!? Like we werr always reviving history. Clothes always got shorter until this Came. History repeats itself would probably the most common phase you must have heard. But my parents and I have definitely evolved and we we know how to respect other's opinions and not to criticise it. Even if I'm having a problem with it I'll keep it to MYSELF. Rather than telling it to people that you don't agree. It's still a platform where people share their views. So it prolly won't even matter if the other one would be dumped too.", "ali.misba5": "@redheadwayfarer if men show their nipples and remain nude their are less chances that they can be raped .... But in the same case if a women show her nipple there are more chances that a women can be raped and that is a reality ... This is India and our Country is known for women Respect , Dignity , Modesty , Chastity and Empowerment ... While not for any equality for Nipple showing ....Women's are like Beautiful flowers they should be covered well and treated well too ...there is no injustice in this society and well I will say again you're not talking about equality you're talking about similarity ...", "salonichopraofficial\nVerified": "Verified", "killer_ali786": "Why dont you try this first .. And then give a lecture on it ..", "i_nidhisingh_": "@hardysaad2901 see dude here her post is all clear about the equality not the nudity and moreover if a women is nude on streets no fucking person has the right to rape or judge....and moreover our body is not something that call off for Eve teasing or sexual abuse its just that some men are soo deep in to their fucking lust.", "sa_ill": "I mean...You're free to free the nipple. I won't object. I don't think others will too. Go for it!!", "damn_it_toria": "@redheadwayfarer close minded individuals will always have a closed mind. Keep strong. 🌺", "preksd": "@shreyaloq", "__.sushhh__": "@shreya_divyanshika", "_alliefying__": "@ritriose_mee", "aditi_vashistha": "@adi_timz96", "prasha.nt": "It's ok foh meh 😇😇", "vishnu_menon_as": "Y do you even care about society , just go out without wearing anything , that would be fun @redheadwayfarer", "dazedandconfused_99": "@redheadwayfarer since your posts won't stop popping up in my search, here's the thing : you see any guy out there in speedos? Sure as heck it's fucking comfortable. We are a fucking result of million years of evolution. What makes us different from animals? Clothes, etiquettes morals and values. No one should stroll around nude/ shirtless whatever the fuck. It's not decent and speaks a lot about your personality. It is okay to feed your baby in public because that is nature's call.", "komal_verma6215": "Well said", "psylockex0": "@humairamemon_", "pakhurisharma": "@shraddha_0695 Read this instead of those sad posts😡", "rheamakwana": "@pracads", "shailja.chandak": "Read dis post grlz @saloni_5199 @simran.bose02 @dakshata_2803", "insta_najeeb": "What u think..which one ok...", "azzy.10": "@redheadwayfarer @redheadwayfarer see the thing is the word feminism has become very vague now, it has lost it's real cause. It is being used for slacktivism rather than raise real issue, which is actually the need of the hour. Coming to free the nipples, no intellect would relate it to real feminism, or how it stands for women equality, especially when it comes to our country India. We still find oursleves engrossed in second wave of feminism partly, where we have more important issues like marital rape, reproductive rights etc than free the nipples. Our women are still confined to the daily household chores. Some state still consider a girl child to be a bane. This indicates few states are lagging behind, still in their first wave of feminism mostly psychologically. You should call upon these issue, create awareness about these things, if you really want to fight for feminism, “free the nipples” is not what we require here in our country. Equal suffrage right, equal marital status is the need of the hour, even though they are already granted by the law, awareness is little and ignorance prevails. I request you to be a real feminist, and focus on the real issues. Freeing the nipples is not gonna bring anything to the real Indian women, insta women (most of which are just here for fame) don't represent the life and times of our real women.", "mridulbedi": "@azzy.10 so true👌 @redheadwayfarer The thing is this campaign doesnt really affect most women nd girls...we insta,fb girls are way too better than those real women out there who fight everyday for some imp issues like education, clothing , shelter and to be treated as an equal human being! Mams rape happen every single day...nd dey arent even laws for smthg like marital rape..fight for them ..not for nipples..we don really need dem,as for now! What the elite class does is just talk about these vague issuea which arent real issues ..they r jus a way u form a part pseudo feminist ..the struggle is too big to be imagined by lavish livers of the cinema world!", "notbahubali": "These comments are cancer after reading that highly exhilarating post", "bloggerpct": "Yr all moves are just publicity stunts @redheadwayfarer , u dont care about womens,equality any anything else ur goal is to create controversy and gain publicity👎👎", "richa_rich": "@_alter3go_ See I told you 😂😂😂", "nikithabaliga": "Worth !!! Its time for some change......ty so much bringing up", "iam.vivaan": "Yrr guys wnts ki guls show's openly her boobs😍😂😂😂😂@redheadwayfarer", "miss.futuredoctor": "@shiwani_bhardwaj I think you'd follow her, her captions are as inspiring as yours. 😃", "shiwani_bhardwaj": "Yes babe... Thank u so much..love u.. N pls come back!!!!! @busy.in.my.reveries", "jasmeet9kaur": "So if u tell us dt thing then why should u also start showing your boobs nd nipple first @redheadwayfarer", "lordofwater_": "@_.chococheese._ plz fight more I want to right a biography. title is boys vs girls", "jain_raveena": "@kajal1478", "aishhu.u": "@srushti1101 read", "pomegrenade___": "Excellent work Saloni Chopra. Yes I'm the same 15 year old. Keep it up", "ashraf_78": "Fuck you @redheadwayfarer and your cheap thinking", "vanshika__maheshwari": "@chahatdiwan6", "harry_amulani_": "Is Society ki To esi Ki tesi @redheadwayfarer", "ben_benedict": "I agree", "harshadk___13": "Wtf u try it", "fullon.mana": "I love your writings, you deserve more followers ╰(*´︶`*)╯", "naomi._8": "@_.chococheese._ you'll know what's wrong in that then :)", "fencinglove1": "Yes I agree with you @_.chococheese._ .Only human thinking must be changed", "lakshaychaudharyofficial": "why dont you post your nude shirtless pic @redheadwayfarer this will motivate girls. Listen stupid saloni. Freedom doesnt mean shirtless or nude or sex. Stupid girl is making vulgar thoughts in all girls mind. Go to hell. First post your nude pic then we give you respect hahahahahhaah", "xiaammix": "@zeesshaa_", "nandinigoelll": "It saddens me how many people are saying things like \"you try doing that and then see what happens.\" Instead of supporting our vision, and demanding change, they shun us for being dreamers of a better world.", "aanchi_goyal": "Feminism should be taught! 😔", "briandevine_": "@liamog81", "akhilt_03": "@palak.gada", "samriddhi._.17": "@spaaaaaartaaaaa", "gaggu__brar__": "pehle aap start krke dekho pata chall jayega 😊", "pearljhirad": "@manasisurwade read this too", "peyrogers": "@totalathlete_21 men continue to sexualize breasts. they're there for feeding children. it shouldn't be considered inappropriate to show the body part that your child receives nourishment from.", "yash_chandaiya": "@_.chococheese._ guys walking shirtless is nudity too . U r right", "chinmayivaim_": "@saumyaaak_", "kabir_khatri": "@anahat_aulakh i am your fan....!!!", "kausar.n94": "Men and women are equal, but equality doesn't mean being identical!! biologically, physically and psychologically they are different... A pat on a shoulder and a pat on a chest can be treated as same for a man but not for a women.. This is bcz they are different biologically , if a women covers herself that doesn't make her any less empowered or backward!! Rather it doesn't gives those perverts a chance to stare at them!! If you can control all the perverts of the world then only women may dress or undress or do anything they want!! And Modesty is not a one way lane btw!! Use your celebrity status for more productive things, Focus more on important issues such as girl's education, abolishment of child marriage etc. And you can definitely make a remarkable impact on the society :)", "chennaitopmodel": "So True", "chiya_yaduvanshi": "@sanjana_bebo_", "iammsr": "respect yourself you are human , not an animal", "sera.zeeya": "@mukulsr4 lmao you're literally to dumb to even put up a proper debate 😂 You were the one who sent me a follow request not the other way round. Be clear of what you want to convey 😂", "the.dreamer2.0": "Ek bar ap to y kam kijiye...fil sb aapko follow krenge", "jkaushik_._": "Yahh sure this need to be changed .... Agreed @_.chococheese._ but what are the aspects that should be noticed to change this fu*kin thinking ..", "srishtiaggarwall": "And I think girls need to be more free in toking bout their periods I guess", "justine.roberge": "@leanne.lefebvre", "aastha_raii": "Half Of The Comments Over Here Are Like ' Toh Kapde Mat Pehno , So Go Naked Then ' These Fucking Retards Their Thinking Will Never Get Change 👎Fucking Assholes Everywhere ✌😄 Iloveyou Saloni💕💕💕", "deo_piyush": "@srk_samia dear u too ve d same permission. .no1 has stopped u fr nt dng so.. plz do it..u r welcum..woow.. india is developing. .", "its_me_amyt": "👍👍👍", "sexy_stoner_wife": "Fuck society", "tabarak.ahmed.siddiqui": "For some women this is womenempowerment... society gets what it deserves... nd this is what we deserve.. after some time theyll say its not a sin for a girl to have sex with her father..", "ddwhitlock": "@nude.goddess__", "armish88": "Nobody stops u to show them", "shekhar170": "Ignorant ladki..rape sirf ladkio ka hota hai..!", "dinoflowofficial": "Yup @mukulsr4 I agree", "vidhipriya": "I dont know whats the problem of society. ...what the hell is wrong with them....... but I like ur thinking........saloni maam hats of to u..", "pratiksha029": "Just dont ever stop writing 👍🏻", "free_the_girls0": "#salute_your_sprit @redheadwayfarer", "_amruuta": "Read the whole post on your blog salonichopra.in and I couldn't agree more. Girls needn't be ashamed of their breasts. It's not our fault that few men cannot control their carnal desires and get so weak at a mere sight of a bra or a naked breast, or even covered, for that matter. When men go shirtless in his boxers or that full-of-holes-banyaan : no problem, yeh toh hero hai and all that crap. But, when a girl posts about #FreeTheNipple movement with a pic of her bra - the entire nation goes hullabaloo and she is labelled a slut. Slow Claps for India. Mind thinking where we might end up with such a disgusting mentality? And few people in our country are nothing but self-proclaimed intellectuals fed off by some delusion for God knows what. The faster such cheap and narrow-minded mentalities disappear, the better it will be for humanity's sake. And don't even go to explain the movement to haters because the only aim in their life is to hate you no matter what you post because you are that badass Saloni Chopra against whom they can never ever win or rather don't stand a chance because you make them feel weak, again. Lots of love and support always. @redheadwayfarer", "mostly_sindhi": "men and women cannot be equal before bashing me up for this statement just read the whole thing just like spoon and fork are not same they are designed differently to do different task .similarly men and women can never be equal they are somethings in which woman are good and there are somethings in which man are good . i support that girls should get right to freedom education and many more things but they will never be equal that doesnt means woman are less than man or vice versa . #feminism is not about equality its about their rights which sadly 99% woman dont know about this #redheadwayfarer", "shadab1707": "Miss Priya KUCH kutte sirf kaate hai bhukte nahi.", "samia_moon_": "I m from Bangladesh dear @deo_piyush", "miss_escapist_": "etao aage porsi @srk_samia", "gothatgoodstuff": "Yeah well fuck society", "neelambisht742": "❤️Proud of u @redheadwayfarer go ahead v r wid u☺️", "anahat_aulakh": "@_quaintrelle._ woah girl round of applause should b for ur over free thinking....wich freedom r u talking about ?? The one in wich u just wanna shw ur body parts..if u agree wid this then go nd roam naked...if ur brothers afford looking at u....there r always sme limits wich u need to always stay in...boys dont carry a hanging part on their chest nd niether it is feeding their babies....its the women breast wich does this so it needs to b covered ...nd making it show wont make the womens comfortable", "funnyquotesonlinesite": "@redheadwayfarer You've said it all so well ❤️ Support you throughout ❤️ you're words inspire each and every girl in the country who is afraid of the society.... Am not just saying it cause I'm a fan or something I too used to be afraid of I wear something short to go out etc etc .... Hope one day people understand", "rubinshrma": "Gud going girly..i completely agree wid ur point @anahat_aulakh dis is wat evryone needs to understand", "nehababber64": "U r doing a great job...keep it up...v all r wid uh...vry proud of u...", "its.snehasharma": "@redheadwayfarer same goes with armpit hair.. boys can roam around with hair on their armpit but its not acceptable for a woman to show armpit hair.. i fail to understand the difference.. either both should be unacceptable or both should be acceptable.. its just so stupid as both are the same exact thing..! What's your opinion about this?", "ajayshinde__": "It will take time..I wish you good luck..", "nihalthakurofficial": "I think u have become over modern😝 NICE TRICK TO GET PUBLIC INTEREST well try @redheadwayfarer", "div__yansh": "I am thinking of starting a baseless discussion by refusing what you said, just so as to get your attention @redheadwayfarer . Cause that's how cool you are for me. Power and power to you girl.", "dee_sharma_": "Such a strong personality u r.. Grt job.. M wid u.. We ol r wid u.. Love u mam.. @redheadwayfarer ☺☺☺", "__shreyaaaaa": "U r a superwoman 😘", "zaara.vsm": "@redheadwayfarer Wow, slow claps, all the constructive discussion and conversation seen here have now been deleted. But if you really want to fight for equality, learn to give people equal rights to say their point of view first. If a person can't even deal with people with differing opinions, so much that she blocks everyone with research and knowledge that brings about a discussion, I really don't know and dont' trust how she'll bring about equality in absolutely anything else. But I'll reiterate my point, and if someone reads this, and later \"magically\" sees the message disappear, you know what happened, again. As mentioned, this post only highlights how women fighting for \"wearing less/none\" is empowering, and must be fought for. Ignoring the dangers, calamities, racial discrimination and official banning by many countries to wear certain clothing, such as hijab, niqab, turbans, and many more. People wearing \"more than societal norm\" or different, are looked upon with suspicion, isolated, interrogated for no reason, and disqualified from employment. How humiliating is it to live that way everyday, where is the empowerment and equal rights to \"wear\" things people believe in? but no, people don't \"choose\" to wear these things, they're probably told to, or oppressed to, they don't need empowerment. It is only empowering when you rebel against society to \"show it all\". While there are actual laws being made in the world to ban women from wearing certain attire of their choice. But go ahead, talk about the intense trauma people in the 1st world go through of not being able to show their bra in public. Cause thats way more important than people being killed, arrested, and forced to remove their personal piece of clothing to fit \"societal norms.\"", "__kirtii_": "Ur thoughts need to widen....#makedifference #slownie @redheadwayfarer loved them", "lexibhagat": "❤ Damn this 🔥🔥", "imfaisalalam": "Fuck off", "yogesh._.ranjan": "We waiting for your picture....", "aadya_shreya__": "m agree wid #quaintrelle", "ishhapatil": "I love you, Saloni. This nation needs more humans like you. :)", "varun_anupriya_harshad_lover": "@redheadwayfarer the fight of freedom has always been difficult. N wen it comes to girls the fight becomes even more difficult. Some ppl will never understand this. They don't av d brain to understand that. Bt u n me n a lot of girls like us know that we are not promoting any shamelessness by supporting this campaign. Don't let those comments hurt u baby. U r a strong very strong girl.", "alwnsksne": "U r superb @redheadwayfarer ...... U r thoghts are owsm...", "manishibist": "🔥🔥🔥 damn this❤️", "shreya__jaiswal": "World needs more girls like her!!! @aayushee_shukla", "hamirshaikh": "Aap ki azad soch hume pasand ayi... v feel good dat u think much for womens freedom. ★★★★★", "shivani_rohit": "@anuschya_kesharwani this girl won hearts ♥", "nishy_saw": "I support your thoughts, loved them", "sachi.aroraa": "Loved ur thoughts ❤️", "star_in_skin": "Thnxx babes.... People are so rationalist dey have made sm of their so called utopian land with typical rules according to themself... A blow to them 👍", "peeu_verma": "We r wid uh go Ahead............. 👍👍👍👍👍👍", "mdaves.shaikh": "Wow yaa simply grt thinkings", "bunnyrenu14": "Crct said i_rishabb & mr_akash_", "keswani_harshita": "She always make me go speechless👍🏻 @shweta_262", "lowqualityworld": "hot", "deekshamudgal": "Proud of you girl 🙋🙋👌👌", "milliiiiiiiiiii": "I love the way u put proud of u saloni", "suryapdwivedi": "So why to hide anything in yrs body...all are just body parts...Men n women both hide their reproductive organs sameway...breasts are not there in males ..its just gifted to females and it ofcourse aroses sexual feelings...so it is advised to hide it to distract the focus male female may have when they interact.", "bhaleraoshweta46": "@aadesh_k_29", "potah_to_": "You make us proud @redheadwayfarer .", "aayushee_shukla": "@shreya__jaiswal I am in love with these ladies who stands so powerfull for the correct thing!", "isushilrohilla": "Now im damn your big fan @redheadwayfarer", "mr_nil_1012": "Ohhhhh", "_beaverhousen_": "@fame_monkey", "anusitaaa": "@parvathi._.r", "imarjungupta": "But be sure that what is wrong or right decided by society", "shikha.kaushik": "@faryal.pv ofcourse u r ryt dat there are other more serious issues to talk about...but dat doesn't mean we should not talk about these small issues...After all big chng come from small beginnings...its about changing mentality about women's body and not making it a big deal...its not about able to wear less...everyone have choice to wear Wtever they want and if a women wears less dan its personally her choice n one should not judge her wid wt she wears...n ofcourse in Western countries people dnt stare women for her clothing...but here it happens n dats wt she s trying to convey...Mam i totally agree wid wt u r saying but this issue can also be d one to tok abt..n yes @redheadwayfarer know abt criticism she has to face n even she s facing n probably is fighting for her own thoughts...its completely her choice to tok abt anything she wants to whether someone likes it or not...n again i'll say m not aginst of what u r saying mam but m also not against her thoughts...", "kxvitaa": "Worth giving a thought .. no? *She writes well*❤👏 @riddhi_3011 @ishi2308 @gayu_204 @s.a.n.s.k.r.i.t.i.143", "kumarabhi3188": "Kon rok raha hai apko Bina kapdo k ghumo", "palak_ladanii": "Waahh....😄", "saddie10": "@i_rishabb ohh excuse me? Did u read the statement which says that \"#freethenipple simply argues that men and women should be granted the same freedoms and protection under the law\" so now you tell me what did u understand by this?", "bluestocking_soul": "dont give a dam to these idiots, u r doing so well nd inspiring all of us :) ,", "coco.x__._____4": "Ryt @prathosingh309 I agree wid uh completely", "harish_hari6": "Both genders have their own ethical values and responsibilities over the family or society.If you are doing right,no need to think about the reaction of the society.But one thing I would like to know is What is the EQUALITY n FREEDOM you are looking for? Is that roaming in Bikini wherever you want? I felt it isn't right. But a girl can dress up as her wish.Men should respect her completely. I belive not all men as you think.", "lalit_gangle": "So go naked then 😂😂😂", "egle_eyes23": "This is not funny but the fact... Give some break.. Freeking geeks👊🏻", "bohemian_love_poet": "@faryal.pv I totally agree with you.", "aditya_vish": "@redheadwayfarer so you try to saying being naked?", "ps_06_19": "Perfect ans for all those double standard people....We are proud of u..RESPECT@redheadwayfarer", "_rashi_jain__": "👌👌👌👌👌 @redheadwayfarer", "asilentobserver": "@redheadwayfarer I really look forward to u..😘", "insha_rashid23": "I totaly agree wid u @d_holladay ...men n women cnt b equal bcox dey r diffrnt..dey r made diffrnt by Allah ( god)...since God hs made d diffrnce y cnt jus u people liv wid it...and dis image is stupid....if a man shws off his pe*** its nt acptd in society becoz its his sexual organ..women hv br***ts n its dier sexual organ n dats y society dsnt allow a gal to shw it off..moreovr y is dere a need to shw off ua pvt parts or inner clothing...modesty is d bst thing fr a women. @redheadwayfarer", "redheadedriss": "Because female breast are also used in mating not just feeding a child.", "fei.jpg": "this reminds me of the other rendition where \"SLUT\" is written on the female, and \"STUD\" is written on the male", "bassamzeb": "Are you going to change the world by getting nude? Is this the right your type of women want? Respect is in clothes miss... women like you brainwash the simple women who are working outside,have ni security... Change your fucking mind or else i would rather say #GoFuckYourSelf #cheapthrills", "xazidimmortal": "Read This @sandipan.roy02 @roji_af @maanya___ @maan_boruah @phukanchao @diku_handique @akshiiiiiiiii @its_lexy_here_ @hazarikachiranjeeb @henry_exorcist", "known_as_libasti": "@the_rover_06", "amber._.kaur": "@khan_anas0 whatever paki", "maheshtamta007": "Itna open to nhi hona caahiye , ho but it's too much", "khan_anas78": "Totally disagree 😒😒", "shweta9627": "so damn true", "wakeuphiba": "@redheadwayfarer agreed .. completely !! Proud of ur thoyghts .. but UNFORTUNATELY some dumhead assholes will still not respect you and whatever you said.. !! Bcz the word EQUALITY is misunderstood in our society.. deliberately misunderstood..and whoever raises a voice is merely a slut and what not -_- lame idiots . I dun understand where their courtesy and social behavior goes whn they abuse the females such publicly :/", "deeptisingh1990": "Btw, I still adore you.. @redheadwayfarer.. 😘", "qkkkkkkkk": "Titties are a sexual appealing look for a guy that's why it's not allowed", "day_vid25": "The picture throws people off its not a good reference I think", "tommsey_523": "Society is cruel. Women should be allowed to do this (and I'm not saying this cus I'm a pedo or whatever.) we should we celebrating freedom by showing our chests, not shaming it. But let's not be one-sided and forget that men as well go through the \"not oks\" of society", "kenkengg123": "Fine if rape is ok", "ah_nah_nya": "That's it!!!! WOW! You are the kinda girl we all wanna be.... so proud of you... and great thoughts.... keep sharing em.... those \"gentlemen\" will get tired of trying to bring you (or us) down but.... your thoughts will not get tired of being awesome... neither will your heart get tired of fighting for all that we deserve.... you go girl. XOXO", "naughtyygags": "Education should be provided to the upcoming generation as it would help them to understand the sexual equality between men and women...... Freeing the nipple at the moment would not be appropriate right now as still many uneducated people are there in the society who'll stand against it and would do all sorts of thing to stop it and these people are those one who enjoy this sexual types of things silently but when it occurs in public they will stand against it and would create nuisance so it will be not appropriate now but proper education on these topics should be given to the upcoming generation...... This would help them to understand better equality of men and women in the society and then freeing the nipple would could be done", "_theoblivion96_": "Amazing ... so true :)", "sonali_gehlot": "Very very very nice my thinking is Absolutely same as u", "suniitkumar": "Gabru...zabar10st", "therealaishu": "Shut the fuck up bitch", "beingnajishalam": "The main point is all people not thinking like you but in future I think possible @freetheNipple", "psp_2010": "Hatsoff saloni👌🏼👌🏼👌🏼🙋🏻", "itsnotthateasy_": "Stop doing this just for the sake of equality!", "sones_95": "@afsha_shaikh_ @kari0096 @z_i__y_a @sanober_nawab", "maggi.says": "You go girl! All the love to you 😘", "asmavia_iqbal": "@nidzzz____ do u think posing in bra is freedom posing with nipples n breasts is freedom?", "jinalshah192": "@redheadwayfarer ....very well say....going on right track", "aakankshxx_spam": "Good Job Saloni..We are proud of you dear...Carry on this thing @redheadwayfarer", "sonali_dogra29": "Good going ... Very well say", "akarshpanickar": "I don't mind go for it 😌😂", "debanjanab": "I'm inspired by ur words & posts saloni. .keep going dear..and don't give a damn at the people who criticize you.society needs to grow @redheadwayfarer", "u98266": "@sameeer_khaan Correct! agreee wid you", "ashishmehra3821": "O god", "nida.khan__": "@asmavia_iqbal m so sry to say but yah! Being a girl u talk such shits/", "vishalsehrawatofficial": "@nidzzz____ I agree....✋🏽✋🏽", "yashi_911": "salute girl", "ananyaaa_aa": "N girls are wise enough in all countries to know tht they don't need to do such things...coz they have self respect...bt tht doesn't mean tht u can force terms like bra shamin on them...its nt about crying fr equality...bt to let ppl know these fucking norms othe society... get goin..@redheadwayfarer", "harmn127": "I mean srsly bro....@redheadwayfarer society need to grow up", "naisha._._": "Vry true.!!salute uh...your daring...awsum", "daniel.rdgzs": "Why did u censor her nipples then arent you against that?", "bethatgirlygal": "U made us proud.. Luv u loads..", "unflinching_snehanshupandey": "Superb thought ...", "aarushi_arya": "Wowwww... yr... u r simply awsomeeee... ♥♥seriously vry nice... people who take u wrong fuckoff to themm... just ignore themm... they.. just.. idiots...", "_shreyaa__07": "It's high time ppl u need to change Ur mentality", "voicesinsidemybrain": "What's really stupid is that men have nipples too. It's the same fucking thing! Their nipples are already free. Why are ours such a shame? Nipples are nipples. #freethenipple", "__aayushii___": "U r an inspiration💋💝@redheadwayfarer", "arushi_narang_": "@anushkaaxo", "prakharprabhat": "You don't ask for equality! If you're strong enough, you just take it! If today men take up arms against women and start chasing women, what would women do?! Again cry for help just like they're crying for equality! Be so strong that men don't even dare to suppress women! and what about women suppressing women?! I have seen women suppressing women much more than men suppressing women! Personally I have met several girls who say they don't want to be friends with girls as they're not as trustworthy as boys! But I haven't met a single guy in my life who says that men aren't as trustworthy as women and therefore he doesn't want to be friends with men! The entire feminism issue is one sided and without any proper definition."}