{"jaskaurdhillon": "@vcuk07 @forever550.mad read this caption 😅", "jayantgajbhiye14": "Request all my girls you girls ... You do not have to fight only the weak would you rape as crime ...please girls", "iishagun": "Ohh @dipxyanshii", "dipanshiiii": "@shagunn.jain. I have read it pahle.", "vanshika_gupta68": "@crazyy_devil", "sushmita_dalai": "@kari_chakuli", "ve_native": "Fab...", "barsha_04": "@dishant_manhas", "junaid_fms": "Hay", "mitali.goswami14": "Hats off mam👌👌 love your posts", "skiesbelcha": "Go out n live with transgenders for a day or so.", "harsh_k.sharma": "Isss too much good thought", "moloybhowmick2015": "This girl has serious problem....🙄", "abhijeet_mahat0": "We support you....many will criticise you but don't stop the good work ... hats off mam #salonichopra", "dankloola": "Dont follow that western culture. Why dont u just do ur life in a right way. Just advice", "kra_yushi": "See how beautiful her thoughts are @krat_ee29d", "boldandbluetiful": "@abbyabbyabbbyabby this", "_just.acutestuff_": "@_lil.infinity", "sirfira_shubh_": "I wanna put my pennis in yor pussy", "saurav.sushant": "@redheadwayfarer ..... U r amazing . Thinking from Ur SouL is Ur best part.", "they_call_me_vivacious": "Check this too @lavishmotani", "_oreflakes_chilligano_": "Thank you for writing this ma'am ♥️.", "sabbir_raihan_akash": "I wanna help you to explore your sexuality", "anyush_ka": "@american_psycho___ 👌🏻", "sheethal_chinnappa": "@neha_sharon @shivancariappa", "megha472": "You know you are an inspiration for all girls who are afraid of their identity.. Reading ur photo captions is a proud feeling.", "prashamsa_kdh": "I am inspired by you. 😊 #yourwriting 😍😍😘", "_theboss_lady": "Respect @redheadwayfarer 👍😇", "yashigupta": "Respected to girl", "kebabydaddy": "@maduuuubala", "sajalsaxena__": "@kanchan_assudani", "kanchan_assudani": "@imperfectly.perfect___ ✅", "shreya_poojary": "You are just absolutely amazing. ❤✔", "anjaligoel22": "True true true.. hats off @redheadwayfarer .. ur thinking is amazing.. #rolemodel", "nancyarora_": "Yes. Not everyone has the pleasure to explore themselves. Congratulations 👍🏻💛💛💛💛", "sulagna_1510": "This is very unnecessary. You shouting that you want to explore your sexuality? Truly, who is stopping you? If you want it, do it instead of writing pages about it. Luxury of fame!", "yruchi__": "Shutting me down? Yes i quite didnt really like that idea i admit it so now ?! N my wat of expressing!! Yes indeed love 💋 uh cant help it. Okay. Bye. Goodnight ! N one more btw poking is bad fr health 😌@sulagna_1510", "lakshay_08": "@sulagna_1510 @_ruchii_ damn girls !", "varsha.kurlekar": "@addy.cr7 ooh ! This was the nicest post so far tht i hv read.", "addypotamus": "@varsha29_k beautiful!!! ❤", "aarushidixit": "Her writing ❤", "sarakhan1580": "Inspired by all ways", "swarinasoni": "What you write! Just so amazing! Inspiring! Doing great work!", "american_psycho___": "@anyush_ka", "aashikagarwal": "👏🏻👏🏻👏🏻....Respect", "ishi_rawat_": "#respect", "strength.india": "We love your work. Much love and respect to you.", "ar.ushi": "@ami_ki_j_joss Umm, wtf", "lakshyathakurani": "Ya sure", "kanishka.28": "@anushka1203", "indianenglisx": "I don't get this, where does a guy get to have sex when he is just horny!? Wrongly said. I still feel it's should be with the one you love and not just exploring roaming worldwide", "manahilfarooqi_": "Well said !!", "suziwithanuzi": "You're amazing 👏🏽😍", "khatri__mannu": "Oye randi", "vinnie.96": "@surbhi4596 her captions💕💕", "gokul_bhandula": "@khatrimaneesh777_ dude have some manners u are talking abt a girl think abt if someone has said to ur sister like this pleas respect every1 ur not perfect and u r no one to any1 anything keep ur fucking dirty mind and mouth shut", "trupthi_chauhan": "Oh my god. You really inspire by being *yourself* the way you expressed 👍 I always think of being like this. I hope I don't sacrifice myself for someone else! Keep posting with such thoughtful stuff! I hope we will meet some day and have such talks. ❤@redheadwayfarer", "neera_sarkar": "U inspired lgbt community also😊 evn gays(bottom) kovi straight bande sirf apni unn \"three and a minutes \" ki khusi k liye istemaal karte hay, or humlog unhi 3 paloko love samajhke apne aapko istemaal ho jane dete hay 😓We need to think for ourselves now,think what we want! No matter it's good or bad, valgar or shamefull, dirty or bold! We all shoud do something that give us a kick!", "handbrakeharry": "Brilliantly said, Respect. What a woman!", "mansijain3334": "Resd it @vanshi_gawli", "huxain222": "@ighazalshah", "eevil_monk": "It's a very bold move you have taken up. Not every girl speaks out for her self and you are trying to make a revolution. I #Salute you. Keep on going and we join you and let this be a great success and all girls realize what real feminism is and we are humans and we are no less to anyone.", "areebaww": "@iffatjehan37 caption broh", "riyasharma.xo": "YOU GO GIRL!! SLAY 'EM", "12ravesand13birds": "@shriya_rege good God have you read her 5 part series? Well written", "squiggly_munckin": "@sarcasm_009", "shama_althaf": "Wow. @sana_althaf @rinususanjacob", "rajatrnath": "@redheadwayfarer :) beautiful", "____anita172": "Want to be touched, without being entered @redheadwayfarer awsmly written... keep going", "marvashah": "@sid_wani😶", "saadeyeh_wani": "@marvashah 👅", "t3ju_": "@ritikadasx @shruthi_07 @mavyagnihot", "prarthna3": "Amazing❤❤❤@anshi.goel", "digitalmalik": "Yeah sure...there should be a Olympics for that....you will win medals for india...", "lubna.aslam": "Very impressed by your posts , sharing them with my kids as a way to continue meaningful dialogue with them, as a follow up to the talk.", "kajal.xoxo": "@tavleen_awesome", "nikkibhatt19": "Well said....u always say big things in a very easy way....hope society start accepting th truth very soon", "sonalipathela": "@khyati.7 she is a woman to follow", "akhil_seelaboyina": "Hats off", "arunanka": "explore it then", "shinuroy": "Kya patha @__jatin___ aise hi blog tha fb pe b", "__jatin___": "@shinuroy kaun hai yeh?", "notavailable__14": "You're the best🙌🏻❤️", "khushbukhanna": "@redheadwayfarer you nailed it👏🏻👏🏻👏🏻👏🏻", "___inny____": "Caption@reetshukla2000", "shwetashweta_": "@youknowwhoyo_", "mitali_d": "@pavaan 👌", "yashnakoshe": "@shreeya1098 @niddhhiiee", "shivam30_": "Bold n beautiful darling", "anshitagoel_": "@prarthna3 yeh pd yr😍", "roop_2612": "@kareenaoberoi", "lewiscorapi_mma": "@kristen_thiess babe you have to look at these. They are beautiful", "kristen_thiess": "@lewiscorapi_mma whoa, beautiful words 😍", "er_jassy_91": "I m also virgin", "gwyneth03_": "@rajni_sahani abey chutiye tujhe usne jo bola samajh nahi aaya hai dont comment any shit and use your brains if u have one", "riya__224": "And i dont hate you ... I even like GOT but its just that i had my opinions so if you can understand..... @redheadwayfarer", "_hanishaaa_": "@_.divine_", "unknown_wandarer": "True everyone should be allowed to explore ther sexuality whether they are gay or bi or have high sex drive no body should be jiged for it and marked for it... Maybe it's just them and it's the way they are...and respect to u ma'am", "natashaaajwani": "Girl you make me smile HUGE!!! These posts about the wonderful women who are strong but are scared of becoming needs a recongnisation from country or other big councils.. Because these need to be spread to as much people as we can! There is such a deep, intense & powerful thought under these posts which needs to be understand by every individual.. Every women needs to read your posts & discover themselves & become who they are & not what the other want her to be.. You give that power that strength which can make a women stand for herself! @redheadwayfarer There are many who say things about changing but you just doesn't say you do & you make others to do too.. Kudos to you👏👏👏", "santaclause4u": "Bapre .....thoda toh laaj saram kiya karo yaar", "ganashreekalale": "U r a virago", "janavi98": "Lady, you're amazing. I don't know if you'll ever reply to me or something but then I love you okay ? Hoping to see you someday😘 @redheadwayfarer", "nitika_jha": "@_gumaan 😀😀", "ramyashriboddu": "@gau_22_", "divya_lhr": "@aliptanayak", "linda_vinod": "@d.ed_sec Read the caption (3)😘", "totallyperplexed": "@mnairpatil", "sumedha_001": "@shrewtii read the caption ❗❗ u will love it 😊", "tropical_tulip": "@harshita_thakur read this.", "garimaatyagi": "@yanshi_tyagi", "adhhiiiii": "@lunawat_313 read only this", "karma_believer786": "@muskan_sharma10038. @aadyakhanna. @rana_nicki. @niharika2398 ...must read this!!!", "the_indi_blonde": "@redheadwayfarer absolutely love your posts. 😚😚😚 👍 #womencrusheveryday", "sah_pallavi": "@sagar_sharma.ss are bhai mai btati hu kya likha tujhe hindi mai usme likha hai gender equailty ke bare mai ki jb men want to sex with a women tb women ko tayar hona pdta hai but jb a women wants to sex with his hubby she got criticized (sharm ni aati) for it ab aya samajh", "diksha_3197": "Well said saloni", "taniya_meel": "@sagar_sharma.ss u r doing this n don't u dare to argue coz u have no stand other than in the line of cheapness", "salonichopraofficial\nVerified": "Verified", "choccolate__girrl": "Aap logo Ko pata hai sexuality ke waja se meri friend ke do balls ek ladki ne apne teeth se kaata kiya", "krunk000": "Hats off brave girl pick speaks more than ur words", "anjali_tiru94": "@pratik.pillai @anirudhanirock read this", "an_old_.soul": "@demented_dream069 👍🏻 well done 😅👏🏻 but chill there exists #brainless_bimbos and they just DO NOT WORTH logical discussions or something #real", "tanyakukreja": "@redheadwayfarer you are just 'WOW'. Even if i stay busy, I specially, look out for your name and browse through each and every post of yours just to read the next inspiring thing on this planet. Big fan of your writing❤️", "madd_scientist": "@1.618_", "themanfromthehills": "@jyoti_negii", "suhani.bk": "@sagar_sharma.ss ...Bro, are u serious? Aap ithna kyu lad rahe ho? Chill kijye! All we r trying to say is that, she is not wrong, nor are u! Aap galat nahi ho! Aapke opinion alag hai humse. We have a different opinion. For example I *am* like @redheadwayfarer . Even I wanna explore in the future, but that doesn't mean I'm a slut. I'm just learning about myself. It's my right to know about myself. Is mai kuch bhi galat nahi hai. And aap kya proove karna chahte hai ladke?! And @_yashvi._.singh_ .... please don't waste ur time fighting with such ppl. It'll just disgust u more than anything. Talk to supporters but not to haters, cuz you'll feel like strangling them.", "srikrishnacz_u": "#respect", "gautami_05": "@marilynjuliandra", "glam_attire": "This is it", "_imniks_": "@an1official @sagar_sharma.ss", "khatamaccountt": "@aswaryoooo she is awesome. @alinaxsiddiqui", "saimakhan726": "@sahar_bahamam @afnansheikh @hadia.syed Do read", "afnansheikh": "Worth reading.", "ankittoshniwal1": "well said @taniya_meel", "shweta_nairr": "@vaisriv", "priyagusain7": "@being_bhartinegi", "yakob_vijay": "Awesome your thoughts......damn killing the society fuckers......", "prajakta_rao98": "@shweta_nairr", "goodgirl.______": "The caption 😇😇 @iish_singhal", "itsmetim07": "@punjabi.gulaboo caption reminds me of u😘", "sidra.mirza79": "Everytime i read your post i get something new to learn...@redheadwayfarer respect...", "_venupriya_": "I love the way u keep ua stands @redheadwayfarer nd say wat u feel..", "ashish.tigerlover": "I read ur articles. Ur thoughts r gr8. Respect Respect Respect........ Somewhere I get confused while reading them, u r inspiring girls or u r motivating them to fight against men or u r teaching them not to tolerate any act which is harassing them. There r many angles to it, few r good for mankind but the way u portrayed it, I think this thing needs correction. What ever we learn is mostly inspired or influenced or depends on our upbringing. You, being youth icon can teach all girls and boys that, when they will have kids they should teach them in such a way that their kids wud never act as the ppl u find disgusting or harassing or limiting girls for unnecessary traditional values. As we all know the fact that kids specially boys r more attached to mother I say here that every mother and father should motivate n teach kids to respect women. As a mother being women can easily teach her son to respect women in his whole life and same teaching should need to be given to girls too. There r many different types of cases in India where women r only responsible for harassing another women. They kill their girl child for so called \"vansh ka varis\". It is not about sexuality or gender, it is not about what u r wearing, it is not about virginity. Real fight is against mentality and upbringing. I know women are being harassed and tortured but the way u portrayed it is not the way it should be, it will motivate them to hate men. Rather we all should get together and fight for it as a Person and not as a male or female. I liked the way u boldly inspire women to flight, but I would love it if u inspire both boys and girls to fight for it as a person. (just keeping my opinion with respect. no offence) @redheadwayfarer", "makeupbykhushboo09": "Read this @jyotijain7860", "krishika__": "Only one word in my mind #respect 🙏🏻", "harshpurohit_": "Haha kids nowadays are retarded.....lol @riya_1293 tapi tapi", "_.priya23.__": "U r truly inspiring.. I m speechless😶😶😶", "lost_illusionist_soul": "Riya 1293 - plzz don't be abusive even I m 13 and I love her. u love or hate her it doesn't matter.but just mind ur words.if u don't like her unfollow her ,and saloni di I love u a lot", "imsaurahb": "Fuck u biych", "cool__piece": "She is my favorite and I can't tolerate this comments", "varti.kayyy": "That was truly something worth being read @redheadwayfarer mam.. \"thats the way you show people whos right and whos wrong\" .. 😇 #respect..", "poojabhatnagar__11": "@dhwanikoladia she writes so well check her id😍", "aritrabasak_": "@ramata.yatri", "yogitashinde599": "Ur completely a mind changer.. n inspiring.. thanks😊", "valiant_bitch": "U r looking Amazing Mahn I just love u for ur Thoughts N inspiring Nature ❤❤❤", "kvrvaishnavi": "Truely inspiring. I am a big fan of yours @redheadwayfarer", "anaghashinde_": "@thelazyinsomniac._ very much🔱💞", "annu21014": "#respect your thoughts ua boldness ua confidence ! Love u ! U r truly an inspiration", "prachiix": "woah 👑 Gosh ! 😍 Its too good ! ILY ❤🐣", "ravinl1": "Well penned down👌", "greeshma_gopi": "Girls should be left to their freedom they desire to live for.. People's thinking should be changed about girls.. Girls upbringing shouldn't be focused on how they should please others.. We girls have the right to live our life the way we desire to live.. U rock #salonichopra.. Love the way you u write..", "jashan_bhuttar": "Your thoughts are so inspiring @redheadwayfarer", "_rutujakurhe_": "@saloni_5199", "tuzasanju": "Hat's off .... What to say", "anikate_monish": "The pic defines too much pain", "medhaa.97": "Very well written.", "urvashirawat05": "Read this @hhhaarry", "pavitkalra": "@mona_verma16", "navdeeppanchal7": "Supb pic ever seen... u r amazing babes😍😍😍", "nomnomchomchommm": "Inspiring😭😍 @anagha_01", "sum_daat": "Awesome", "karishmamorris": "super duper truper lady !", "anamikachouhan": "@rajeshwari06...", "sharma.sahabh": "@musaafir_", "arpanxd": "@ritvikmalhotra24", "wanderingmissile": "@tangledwind", "_simpat": "@khxleesi", "imariwosha_________": "wow", "vishal17cool": "Nice", "jhallipatakha": "Such a beautiful post", "ayushisingh15_": "OK I thought that's the limit bt no as a women now I knw sky is no limit... Astonishing caption #girlpower", "wishwishal": "Yeh padh bhai @mehulmishra__", "shivangi_das_gupta": "And more power to you girl #Esha", "lipikasharma": "This is probably one of the best articles i have ever read!😍", "kratianand": "@anuwby this.!", "anushkafanworld": "hats off to u girl 👍👏👏", "pumsee_": "We need more people who are brave like this! You're a true inspiration! This means a lot! Thank you for this post!", "dr.simrann": "@nitika6 @gurleen1sidhu diss!!", "nitika6": "@believerr1 exactly ❤❤", "syed_khurram_": "@ayushi1540 ahan", "she_the_selenophile": "@pradeepkarnal", "anuwby": "@kratianand this is so great. What a messed up world it is, yet so beautiful", "rajawat_neeloo": "Awesome seriously... 👌👌", "aabha_217": "This is fucking awesome @sid_20299 u need to read it!", "khanabadoshiii": "Babe... 👍👍", "mirrors_sourabh": "U write It really Well", "priyanka.mua_": "@redheadwayfarer you are fearless, true inspiration for the girls who are introvert yet fearless to be themselves. Go girl #inspiration #respect #can'tberealthanthis", "kaaikhan": "@wandering_desi", "govindanagori": "Snap is amazing but thoughts behind are more wonderful -- u deserve superlike girl", "the_perfectly_confused": "In love with ur posts...♥♥♥ @redheadwayfarer", "danish_igm": "pagal ho gayi hai kya ye ladki", "vidhi_soni21": "@insaneheadwayfarer @dimpy_nandwani @aditie_bohra", "bliss_feeder": "Totally on point 😍😍", "psyche_wolf": "O my God........ this is awesome......... sooooo true and real......... i whole heartedly support this article of urs Saloni maam😊 Hats off👍👌", "heyaaditi": "Appreciable! ❤ @redheadwayfarer", "abhishek.k.bharti": "@redheadwayfarer whatever you written is something goes around every women and it's good and natural... If everyone will give a deep thought I believe it will change the way we think we see and treat a woman... We need to respect a woman's needs and desires, its their world too of freedom, men know the inner power of womens but hesitate to accept..!!", "madhurika_27": "U writings are so amazing mam @redheadwayfarer", "choudhary14": "i am in love with ur way u look at life... ur writings r life goals.. i love d way u express urself without any hesitation.. proud to have a girl like u in our society.. i m glad my thinking matches with ur thoughts.. n yes we r proud to be girls", "unflinching_snehanshupandey": "Mind blowing post @redheadwayfarer", "bhartibhatt_": "Again the Caption 💝 @redheadwayfarer I sometimes wonder , why have you gone to this acting field , I mean , u can be a great philosopher.. who is currently inspiring many of us through her captions .. wat all you have written is absolutely lovable, coz that's the truth .. keep us motivating dear . And ignore some of the ( bullshit ) comments , which are just meant to demoralize you .. Love you loads ❤", "a.b.b.y.s.h.e.k": "Turn into a writer.. you'll rock @redheadwayfarer", "uvashree_mahadevan": "Girl you are too good! You drive me to become a better woman. You give me strength to stand up for myself! And you know wat I'm not gonna stop until I get wat I deserve! In love with your words! Respect!🙏", "_snehakoshy_": "@aashni1400 Shit.❤ Well I know how much criticism I had come across after my blog ' Troubled Beautiful Minds' This Lady inspires me! More power to you ❤", "khushijunior11": "Oh My God😍U inspire me so much..I love each n every of ur post😘Way to go gurl❤", "temsutila_aier_": "@redheadwayfarer amazing", "stylemeanny": "well said", "swornima_goldisntfoundeasily": "💪❤", "supriya111dongre": "@redheadwayfarer", "aashnitulsian": "@thedoozyshenanigan caption is worth reading", "fernarochelle": "✌✌✌✌✌✌", "amita.__._": "Caption ✌✌✌✌✌", "yoge786": "Not nice", "saurabh_stagram": "U should", "abha_kant": "@shreyarawat13, @taru9279, @aishsahni10 @shefali96sharma @s.siddiqui26 @n_nikk7 @ishitasharma96 @yashika.a @arora.neha1007.. @sanjana__goel", "kaniika.kushwaha": "The caption 😍😍👌👌👌👌✌", "rustified95": "Respect! I've been reading all your articles for a while now. Absolutely love them", "red_chilli_girl__": "Hats off 2 ur thoughts....👏👏👏 @redheadwayfarer", "faltuuu2345": "well done", "rachita_29": "#Girls shud need to be open about their sexuality", "sumitjadhaofilms": "slowly slowly she changed me likewise she removed her clothes slowly slowly 😂😂😉😘😘 loved her thought, her way to express, presentation. She bought me onto another level of thinking which is way better than previous. Huge respect for u dear @redheadwayfarer", "jainiksinghi": "@tirthajoshi", "iamanshulsajwan": "Cutiyaapanti", "harsh.nakra": "@shalu_chopra deep what?😁", "megha_guha_roy": "Yes", "moon.rathod28": "Osum pic n well said.. Keep up n aware more ppl @redheadwayfarer", "_masaladosa_": "Read some comments. @__wanderlust_sk", "shreyabagde19": "Read the caption @varnika014", "yaaaarusha_raut": "Deep", "_iammeever_": "Kudos to you", "imbigeye90": "Hats off", "chinmayivaim_": "@saumyaaak_ read", "sha7081": "I want to u write something cool n superb now ....may be on teenagers n all ....bcoz always ur main concern is on sexualit ..........otherwise u r just superb", "dotted_eye_11": "❤💓", "anjalii_rajput": "@namita_rajput she is my girl crush!", "madhurima_k": "@redheadwayfarer this was the best yet 👍", "theweirdbongguy": "You are a goddess😍😘💜💓", "sagaciousoul": "#YouGoGirl 💙", "shalinib122": "Beatifully expressed ... deep thot ... deep meaning .... I agree 1000%", "shambhavidutta": "You inspire me❤️", "21vidin_": "❤", "rose_sharma_": "Saloni you are osm 😘😘😘❤", "ggem_rian": "❤❤😘", "justin_bieber4848": "💝💘💖👍😌", "devanshi_virwadia": "Wow💞😻", "_sharmanehal_": "U r simply awesome.....", "tpsnayak_unofficial": "Please explore just don't demonstrate", "serenepree": "❤❤❤", "_babegirllll_": "Shero! More power to you girl!"}