{"ajit_lahon": "Sexy", "irrfan9_": "Sext", "_______________________relax": "@trishapujari0406 Girls jaise LEGS ko b Waxing Makeup kr k Hume Time aur Paisa waste nahi krna h. 😂😂😂 Moreover Girls a sab krne K baad koi gurr liya tho \"BHURI NAZAR SE MAT DEKHO\" It's really doesn't make any sense 🤣🤣🤣", "iamavniiiii": "Besarmi ki puri hadd par lar di hai.....", "dastagirpatahn": "Very sweet and sexy 🔥🔥🔥🔥😍😍😍", "_ashikitooh_": "As soon as I stumbled upon this post, I checked the comments, whether people have gotten anything into their heads even, but unfortunately I was wrong. @redheadwayfarer It is going to take a long while for people to realise that the point of all this is to not judge. Alas! Indian men will always be concerned about your skin show! You go girl", "dhvlvaishnav": "@ashish_agrawal08", "okaybye578": "hey @redheadwayfarer ur true inspirational u'll surely chnge the mindset of our country❤️❤️", "nilesh__nick__": "@__9.mm__", "amkumar4108": "Hi", "triad_modelling": "take off your underwear, we want to see your juicy wet pussy", "own_kinda_girl": "It's funny to see all of the comments here most of the people talking about the undies which lil bit showing up but if she's wearing a bikini no one have issues what a small sick mentally of these type of people, they need to grow up", "randheer7": "It is a deliberately show off or u r in dat way ...???i'll be very happy if u reply 😊", "happyhippieeei": "What a super pic !!!! Just cause it's caught in the moment without thinking and posing 😘☕️", "impulsegram": "I AM OFFENDED ! Why is no one noticing how perfectly the colour of her shirt matches that of her coffee mug !", "kararalsaba": "You can send me over via chat so I can talk to you until we are friends only", "siddharth221080": "😘", "bagaulineeraj": "Nice chud", "meee.yash": "sidha bol panty dikhani hai", "ahanadutta24": "you are looking hot", "rahulb90": "@redheadwayfarer i love the composition of this one #imaphotographernow #compositionisawordphotographersuseright #givemeafreecamera", "ishaan_677": "pussy expose karne ki ninja tecnik😂😂😂😂", "jeyko_valenci": "@alejandro_valenci", "varun_gurung11": "Nice", "kshipradhiman": "When i saw this picture,i straightaway went to the comments section to see if there's any upgradation in the mentality but unfortunately i failed to find so...but undoubtedly there's much progress as i can see so many people in support...thumps up for the positive comments, and giving no consideration to the negative ones..cheer up souls..way to go girls!!", "__manjuu": "why you guys concentrating on her panties!??", "she_oneand_only": "❤", "vanyaajoshi": "Her nose shape and vagina match..", "rohit8775": "Kya macha rakha hai - panty panty panty, boys or girls both are focusing on her panty and the way she is trying to pretend something else in name of something. I hope u all know very well! And to all you people out their -", "radha_krishna_leela": "For some ppl only showing boobs.. panties.. and more more skin is feminism..is freedom.. what about giving ppl food who don't get it easily.. what about giving the needy ppl clothes than dropping your own clothes.. what about rescuing pets.. what about giving free education..basic education.. what about visiting orphanages or old age homes and giving donations for their benefit..what about fighting against dowry and free education to only girls but every child who are in below poverty line.. this society only teach ppl how to be naked..in the name of freedom.. stand Against domestic violence.. against child labour.. violence against old ppl.. there are so much more to work on than showing bikini lining in every photo..", "trishapujari0406": "Di @redheadwayfarer when a boy uploads a shirtless pic of him then he is hot , he is sexy and when a girl uploads a bikini pic her then she is a slut. What A Bad Mentality Of The People. Without Encouraging You They Are Just Discouraging You. Shame On Them....", "garimabahl": "Also add rahul’s sexy voice with his sexy accent in the background and no one will notice your panties", "kurlykaur": "Her account, her coffee, her vagina, her panties, her life. All the people showing hate are the people who pay her bills right? Oh you don't? THEN SHUT THE FUCK UP. This is the reason why India is the most dangerous country in the world for women, cuz men will be men but women too gang up on each other just cuz they have no idea what freedom really means. Please get back to getting home before dark and covering your head and cooking in the kitchen you backward thinking Assholes. @redheadwayfarer bro post as many pictures you like.", "sarfyshaikh": "Wearing a green shirt and green panty and the coffee cup is green to.. Wat a coinsidence.. I mean really shez juz njoyin the coffee? Well i dnt thnk so..", "immsalimm": "You really nailed it bcz as a human beings we have got emotions feelings and things that intimates us and grew a feeling of lust within ourselves as if you say that you can’t allow your penis to erect by seeing a vagina then you are insane and does not make sense and vice versa and that’s why we need to cover our body as sex is the ultimate and natural desire of any human beings which it wants so you can’t take away the biological and psychological affects from the human day", "modassir008": "This Post is about coffee and happiness...but mostly comments belong to something else ....that's funny😄😄", "gaurmajid": "cheap gril on earth....😡she dnt knw how tosit", "shreyagrahari5": "Love its urs stly", "arorapuneet46": "@the_cute_pixel03", "ravi_vidyasagar_": "Very beautiful pic pretty 😍😍❤❤😘", "___ritzy___": "Guys we really need to stop judging her! Its her body her choice ! We really need to get over these things. Men can go shirtless and nobody Judges them then why are girls being judged by the way they dress. Boobs and vagina should be treated as normal parts. We should not make hype out of it then only our india will be a better place for our mothers sisters !", "07traveling_butterfly": "Wow.. How intently you're drinking that coffee.... It's going to make me feel like drinking coffee from now on....... 😋😋", "cooll__dude": "Nce underweae", "himani_sid": "@redheadwayfarer u know what di ....girls khud hi feminism ki dushman hai ...like ...if kisi ladki ka rape ho gaya aur by chance uske kapde chhote nikle ...to vo lady hi hogi jo pehle bolegi ki ...kapde to dekho ...fir hona hi tha aisa ...", "rashika_sachan": "@redheadwayfarer read almost all comments .. i have been mentioning you in all of my post. You know what may god u more strength everyday May ur family supports you in every way . May someday some people understand the cause you want them to tell 😊😊", "swish.babe": "lol wth is happening here in the comments. relax guys she’s just having her coffee and that’s just a goddamn panty what’s wrong w y’all", "kalraanjali": "This woman’s talking about her morning coffee, people notice her undies. Pervs men and sadly women too.", "amritatripathy": "Such an artsy classy photo, kudos to the photographer @redheadwayfarer", "thebook_thief_20": "@pragati_said", "thebongokonya": "Would there be so much hullabaloo about this pic if she was wearing a bikini 👙 and drinking coffee?!!! Then it would have been absolutely okay right? So take it easy peeps!", "virajshah10000": "Why its even a question on your side women's out there who ever is talking about it.Stop commenting useless and try out some support instead,if women won't support women what are u guys even gonna do. If she is wearing anything is her choice its her body after all. You people really need to grow up a little...no....no..... actually alot. Don't talk rubbish atleast to just to get a little of fame,its just that you are showing your own respect towards women.And i am a man talking about this,it doesn't matter what she is wearing or anything if she is okay with it no one else can say anything.Being in a world which is growing to whole different level but with people like you with backwards running brain. And in this world girls are got raped who are totally in there we'll dressed clothes,n you talk about indian culture in these. #supporttowomen #women (*You* is word used for people who has a bad mindset towards women*). *Great support to @redheadwayfarer *", "abhijeet_mahat0": "Shame on them who are criticising her for just one reason that she is sitting inappropriately ... Oh ! Really ... I don't see anything wrong in this pic ... She is just drinking her coffee ... The problem is in your thinking that you can only see her panty ... She is only wearing in what she is comfortable at home ... For God's sake, can you people please get over that panty 🙏", "im_harishq": "@redheadwayfarer 😂hello friends chai Pillo😂😂😂", "kriti_verma___": "Hot💥 fav you❣️❣️", "chaibiscooot": "Ftw this looks so aesthetic! Tum log bhi na🤦", "roshanv2018": "randi", "gourihari_uh": "Babe I think you should wear some cloth. . Showing panty doesn't make any sense dear .. this is not feminism. .you r giving wrong ideas to others ...go nd check real definition of feminism. . Showing your body will never change the society or mentality of anyone .. body is your property ..your privacy i agree with that but this is too much to handle dear. . You can't give wrong ideas about feminism to others .. feminism is mainly for empowering women's needs etc.. not to do all this shit babe", "tales_mystery": "Umm... i recently saw this picture of yours and it's amazing. I am not a feminist and i dnt know much about the facts and figures . Though you're my inspiration. I like the way you leave. I like the way you talk.obssesed with your pictures. I like you so much. You're just amazing. When ppl talk shit about you, I really get annoyed. Whatever you're doing is for betterment for us and many more women in the world. Some ppl might not like you and always talk shit but what can we do...it's their mentality. Those ppl who said bad to you in this picture probably don't have good mentality. There is nothing bad in this picture. When I first saw...i just saw you drinking something and when i saw caption i felt it was coffee. It's just a beautiful girl enjoying her cup of coffee. Lots of love❤.", "shahsmit": "I don’t understand what’s wrong with this ‘panty’ picture?! If @redheadwayfarer were to take her shirt off and sunbathe near a beach or a swimming pool, this would’ve looked ‘normal’ to all. But because she is sipping a coffee in a hotel room makes people “uncomfortable”. Those uncomfortable people are nothing but bloody hypocrites! To them, I will say live and get lost!", "bipasha__basu": "Sabke parents strict..", "indro_169": "A guy uploads a pic with underwear people be like what a dude he is,look at his gains.and when a girl uploads a pic with panty tab sabki gaand phat jaati hai", "gautam_evolvemutant": "Yahan ke followers ka maanna hai ki kaccha dikhao toh confidence aata hai...aur jo nhi kr paati esa woh innse influence ho rhii hai.. feminism ke naam par...waaah waah #slow_claps #unfollowed", "_shivennn": "Hit you with that ddu-du ddu-du du 💃😂", "shalinni_1990": "So coz it's her body she can roam around naked in public....as u said freedom of wearing anything something or nothing....right??? arorapuneet46", "rigoberto9448": "Hola", "gauri3190": "Beautiful legs", "aquib9018": "chai nhi peete?", "mushy_muffin": "This is a beautiful picture and in a way artistic too. And you, my girl, people's opinion on you should never bother you. Love @redheadwayfarer", "purvagx": "I love how so many people are supporting you. Seriously there's NOTHING wrong in this picture, it's the mentality playing games. We are more than our body and the clothes we wear.", "singh___21": "Hahaha.. read all the above comments... 🙏 observed that ki jese Baba log hote hai naa jo Bda Bda parvachan dete hai ki paise ke piche mat bhago 😳 paisa moh maayeaa hai 😳😳. But actually khud ki nazar or niyat paiso par hoti hai 😜😜😜😂😂. Theek usi traah yhaa par bhi maine vohi dhongi baba dhekhe... Jo is pic kaa virodh kar rahe hai or btaa rahe hai ki is trah ki looks samaaj ke liye buri hai yaa isse milta julta koi hor parvachan.... Or specific wear pr cmnt kr rahe hai ki mat pehno,,,, But actually saale chaahte to andar se vohi hai jo ki dimaag me gand bhara hai,, 😝😝😝😝😝😝🙏🙏🙏 so esse double character mai reh kr koyi fayda nahi h,,, muft mai gyaan deta hu ( agar nahi pasand to ignore kro, agar kuch pasand hai to chup chaap dekhlo) 🙏🙏👍 or ho sake to apni giri huyi soch ko uthaalo, nhi kisi ke pairo ke niche aa jayegi.... Have a good day 🙏🙏", "be2_op": "Now showing the skin , started to seem like intentional", "kirtikaysharmarahahai": "If u all r really so much desperate for commenting dan plz follow @kirt_swavalamban n comments on my writings. 😉 Thanx 😊😊. N plz ppl give her space to do whatever she lyk to do. Stop all your gyan. Thanku so much. 🙏", "whoperryarora": "Pata hai Kya? Logg bolte hai hum women ki respect karte hai , hum rape k against hai ,humara indian culture best hai , logg bolte hai k hum feminism ko support karte hai , logg bolte hai k hum apni ladkiyon ko educate karenge hum ladkiyon ko unke tareeke se jeene denge ,hum ladkiyon ko job karne denge business karne denge, hum ek achhi society se belong karte hai , hum mein sanskaar hai , hum sabko ek hi Nazar se Dekhte hai , hum ladkiyon ko ladkon k equal maante hai, hum maata raani ko maante hai hum ladkiyon ka kanya daan karte hai hum ye karte hai hum wo karte hai ! Jab itna kuchh karte hai to jab ek ladki drink karti hai ya cigarettes piti hai tab judgement kahan se aa jaata hai?jab ladki road pe akeli jaati hai to uska rape Kyu ho jaata hai? Koi ladki agar Instagram pe apne account pe apni picture upload karti hai aur koi apne tareeke se jeeta hai , uski sirf PANTY dekh Kar gaand Kyu fatt jaati hai sabki? Fir ye itna judgement kahan se aa jaata hai? Chalo maan liya tum is ladki ko apne Ghar pe baith Kar Instagram par judge Kar rahe ho aur apne culture ko lekar dar rahe ho ! Par kabhi tumhe kisi k nangi body se jaada kisi ki nangi soch se dar nahi laga?", "gargee1997": "She looks like a man 😂😂😂😂", "sneha_nair_25": "Hahahah these comments are hilarious....its waste trying to change their mentality u guys...its just the way they were brought where women have no rights or voice due to which when they see an independent woman doing whatever the fuck she wants to they feel so threatened that they must try their best to demean her but i got new for u guys she is gonna do whatever the fuck she wants like every other goddamn human being on this world, don't like it then don't look at it and for people who got a boner looking at her go and jerk off man because you won't get a girl like her in a million years.", "rituajwani": "And I must say this girl is looking damn pretty😍😍❤❤", "_pranali_ajmeraaa_": "@redheadwayfarer uk honestly when i first saw this picture..i just thought damn she looks so pretty nd i definitely need coffee...like u really look so comfy nd happy but people always find a way to act like assholes nd put women down..they are behaving as if they hv never seen women post pictures in a damn panty or bikini...such losers", "islaybadass_": "@s_meenu_ as if anybody cares about ur opinion!!", "prajwal_p_n": "@redheadwayfarer grow up..! Everytime posting these type of photos doesn’t work..!", "varshiniiiiiiiiiii": "People enjoy watching heroines in bikinis.. but create a fuss about a panty.. lol."}