{"roy_i_": "The caption ♥️ 👸🏻", "ruchadivekar": "Amazing ! I hope people understand women and their happiness and their freedom and not just look at them like a thing for pleasure and satisfaction ! Very brave statement is put up in this post which most the them still would disagree but just go on, you are the inspiration for many. 👌", "_huffy_pysche_28_": "😘😘😘💕", "_imadyasha_": "😍", "sonalii_bhasin": "You are simply amazing", "thatcurvygirl": "Just read this, you empowered me like none else! ❤✌", "uni_aayushi": "😍😍😍", "filmy_nari": "I just want to Thanku 😃u pulled me out of depression a lot of Tym", "jaanviamarchheda": "Was i found dead?", "quinate_hummock": "You are one powerhouse of a woman, Saloni. I adore you! 🖤", "architapatnaik": "🙏🙏I love you ..😩😩😩 thank you for this post.", "welcometothevenkycity": "Wow Saloni 👏👏👏👏", "sim_vii": "This made me fall in love with you! 😭💜", "parisinghh1103": "Nice", "the_wandering_dot": "Oh God! How nicely do you just jot down all the thoughts that run on the back of our mind..! I LOVE YOU.❤️❤️😘", "snuhuu": "@de_gracia11 iss bandi ke post padho....i am following her since very long time now.... I am in love with her...😍😍", "imranhussain8659": "7 jan ko", "pankhuri_malhotra": "We loveee you too Saloniii❤️ this just made me cry. You inspire us everyday❤", "chinmay_gopal10": "Your words depicts the strength you have My lovee❤ I feel each nd every girl Needs To read This😍", "__reina_del_drama.__": "More power🌸", "ritika_jaaiswall": "Captions is lit🔥🙌🙌👏", "beloved_awkwardnesses": "Your last lines remind me of Virginia Woolf w.r.t long nose, her physical characteristic too. Also, your posts are as inspiring and supportive to me as her essays. It fills my heart with such beauty when I find online social media so useful since I've never been a big fan of online social networking. Thankyou for your strong and liberal opinions and posts! They are very supportive. I love them. 🌼💜", "asmita_khurana": "Awesome😍😍😍😍😍😍", "_sherry12345_": "I have recently discovered your profile and I must say that you are projecting a very wrong concept of feminism. Feminism should not be so much \"in your face\" dear. It should come to the fore only when required. It should inspire you to become the best version of yourself. There is no harm in being what you are either, but who wants to live a life stuck at only one place?? If you are doing this to inspire other girls, don't let it be limited to just their clothes. I see that you are from India. I have lived there for one and half years and I know the society there is too much chauvinistic. But if women there want to grow themselves, try to guide them in the right direction. #peace.", "rinkle_poptani_": "Thank you❤️, really needed this", "divyanshii204": "❤❤❤❤❤❤", "rohit8775": "Kya h nanga naach?", "nisargj_": "Yeah!!! How dare he say you shouldn't interrupt him when he's talking?! You are just putting your point. Also, crack his skull open if he does #mansplaining 😂😂😂😂😂", "cubeofl": "Fattest", "amrreeta": "Interesting read. I am not a feminist. I am en educated professional woman who knows she is equal to men and doesn’t have to prove it to the whole world. I don’t believe in reservation for women either. I believe that we are as equal to men in brains and capacity and choice/decision making so one doesn’t need extra privileges since we are capable of fighting them on their turf and winning without reservations. I also feel we make right or wrong choices with our men. I have had terrific men in my life. I chose not to marry any one of them. I am a lawyer in the Supreme Court of India, I earn well and I love my independence. But more than that, the men I chose knew right from the beginning there will be no compromises on my values for their sake. They never even suggested for me to change my religion or my profession. And if and when men stared at me for clothes that I wore, I confronted them back instead of writing long posts because we have to change things at the ground level and take action there and not on social media. I have seen enough men who are victims of abuse and false charges to categorise them all as bad. There will always be two sides to every coin. But I don’t believe that unless women show themselves to be victims always, they will not be successful. We are far better and stronger than that.", "poojakothariiii": "@varsh_kothari23 @vrithika__bohra10", "raneekesh": "😭😭😭 you made me cry literally, i looovvvee you so much ❤️❤️ it's not like you typing up words and stringing then together into sentences, it's like all the bottled up emotions and hatred we have received just for being \"WHO WE ARE- BOLD & INDEPENDENT\"", "the____lost____gypsy": "@tapaswinii dont compromise...like never 😘", "anantasharma22": "With your every post My confidence level rises to another level. And I am sure there will be many like me. More power to you. It's definitely a long run for times to change,but race has surely begun.", "maheshpandey2392": "How this pic relate with comment.", "gems.soullens": "Oh my god! Thank you for these words! Can relate to all of them way too much!!", "raisi9861": "beautiful", "gaurinautiyal": "Eww", "arhumm__": "Amazingly written ♥", "labonno101": "Your writings are so genuine and true <3 I love you too saloni", "tandonrinky": "i love you for what u said @redheadwayfarer truly inspiring and thankfully i read it just at the time when i needed this...more power to you", "deepika.malhotraa": "😍😍", "packedforever": "Great feed👏👏 your words are so inspiring... More power to you and all the girls out there🙌🏻🙌🏻", "d_w_khan10": "Outstanding lines 👏👏👌", "cheery_baobao": "🙌", "kaju_897": "@redheadwayfarer more power to you ❤️", "shakil.mahmood52": "hot. 😍😍", "prettygirlmoi": "Thank you and more power to this and your voice 🤗😊", "shivakmathur": "More power to u n ur ilk", "roza_sinha": "You changed my life. With every words with urs I feel strong n empowered", "iam_nehaaaa": "I just love u soo much like....love ur thoughts...feel then relatable...u are just awesome....you took the a big step to change the thinking of all the men around the nation...hats off to you🖤🖤", "annveshnam": "Thank you!! I am.that girl needed to hear that", "j_i_g_n_e_s_h": "So beautiful", "aashi0100": "I love you too slowwnnieeeee❤️ this caption gave me the reason to start my life again with new hopes :’) thankyou❤️🙂", "vs31072014": "Moti", "swatii.d": "More power nd love to u", "adarshpunjabi": "So much power to u saloni @redheadwayfarer and the girls who have the courage and stern resolve to never let any of the hypocrisy by past n if so present men and there mother's in ur life .. I look forward to meeting and including people with ur mindset n approach in my life .. but have somehow been able to come across .. u are a movement. 😍👏👏👏👍❤", "ispita_har": "More power to you woman!! Love you to the moon and back!!! You're a beautiful soul. @redheadwayfarer 🙏🙏🙏🙏🙏❤️❤️❤️❤️❤️❤️😍😍😍😍😍😙😙😙😙😙😙", "spikerohan": "hot", "dracarys_dv": "I’ve been around mom’s that tell their son ‘why don’t you convert her & then leave her so there’s more of us in the world’ .... Are there really such wicked persons?", "goatforeal": "You are somegreatfuckingthing !!👏🔥", "bhawna_sadhwani13": "love it !!! love you ! ❤❤❤", "vishalsahani8726": "Maar he dalogi kye", "itsaestheticbarbie": "Caption on point❤", "kaveri_chovanda_": "❤", "sarkartridev": "Hi sexy", "pavintheran3795": "So sxey 😘", "anaarisistaanem": "@natasha____rodrigues19 ❤️", "rashmika____mandanna": "@troll_indian_actresses @bollywood @troll_guru please stop this girl, can't tolerate her", "indro_169": "I am the only one who doesn't read the caption and straight away sees comments and understand", "cororna_virus_wuhan_wale": "#paglachodi #nonudes #chutiyapa #everythingidoistoexpose", "elf.ish_heart": "❤️❤️", "rum_ya_martini": "❤❤❤❤❤❤❤ best", "dimples_divya": "U re truely an inspiration", "vickychandanroy": "At the end of the day posting the photos of your undergarments proves nothing. All of a sudden in morning seeing it kinda disgusting but I meant no disrespect. I feel you think you may have a point. But It’s not always all men are monsters. There are still goodness in humanity. Because goodness which makes us human. At least not all of them are. But this images proves nothing. You may have a point but in my point these are so baseless. You might have a very big fan following who are thinking you are right. But somewhere in deep down inside we all have something more to do rather shouting for our rights and all(which has no meaning sometime). It would been more appreciable if we would have done more for our people.", "rajkumar007kingmaker": "Astonishigly lovable beauty with lots of tremendous tempting charm and amazing gorgeousness", "rd.red": "@chchchchherrypie 💪🏼", "riya299": "🔥", "saharbilqees77": "But why is it always YOU who has to face allllllllllllllllllllllllllllllllllllllllllllllllllllll the negative thing from each person you’ve practically met in your life ? Why ? Mothers. BFs. Friends. Men. Other men. Men on the road. No girl today shuts up. All are empowered. No girl ‘compromises’, at least not in a deathly way. The compromises people make are NEEDED and mutual. Why is it ALWAYS you ?", "shivani_raina_": "😍👏🏻👏🏻👏🏻", "prabhakar273950": "Kya hogaya utarne ko pakki ho ri ho bilkul", "reeaaaa___": "❤", "amisriyagnik": "Superb.. Just mesmerized by your words and really got my core strength... Love you dear..", "irfan_e_nafs": "@sharma_meenu", "snehadebnath": "You have inspired me to some other level by this post. I thank you for giving me more confidence and more strength and to never stay shut in front of all sorts of bullshit... I love you... I simply love you 😍😍😍😘😘😘", "rajeev_sam_jr": "Jus purely Hotttt", "lens_and_paints": "More power to you!🙌", "matcabane": "❤", "subrata_kuri": "Hot", "_unkn0w_0": "BC sb pgl ho gye ho kya 🙄🤔", "vicky_vr7": "B's ho gyi yeh shuru...", "_divya_jami_": "People need to read this. Thanks Saloni 😍", "shilparasmusson": "You are awesomely inspirational. Thank you for what you do. ❤❤", "chanakyaseven": "🔥💯", "__anu5602": "Saloni you are a true inspiration to all the women out there..more power and love ❤@redheadwayfarer #womensupportwomen", "clavical2012": "I like the glass of wishkey .....when will be have it together..", "aiesha.michael": "More love and power ❤️❤️❤️❤️", "saxena.anushree": "My queen😍@redheadwayfarer i m so glad that i found u", "kavitha.lm": "Nice", "surbhi_bansal": "I love you @redheadwayfarer", "hoax__slayer": "Following a trend like the unfunny cringe worthy likes of Amy schumer & Amber Rose advocating third fave feminism. Typical victim hood play instead of questioning her choice of boyfriends putting the blame on a particular gender, There are bad men and women but I have not seen men writing such post's in the garb of \"meninism\" saying That I have dated women who only wanted sugar daddies and were certified gold diggers and trust me there are many, There is a reason why strong and fierce women like meryl streep go on record to say they are NOT Feminist, The subconscious sexism in today's feminist movement is very Evident", "simplemindedcrap": "👍", "vaishgambhi": "@awari_55 I find solace in her words❤️!", "__igaurav": "Why do you write this long caption?? Seriously dude, does everyone read this?? Honestly, I Never.", "followingmoira": "💋", "sangeetadeswal1": "more power to you girl...i am a teacher and forced to wear a duppatta on kurti legging...", "easy_online_cash": "Cute :)", "manishalellwani": "Your words are💜💜", "anushkastorm327": "True😘", "s.u.d.i.p.t.a": "@redheadwayfarer thank you for being there with me. This post made my day ❤", "sophyfreebirds": "I love you. These blew me away. We so want girls to learn about this girl love that you spread. You wrote what many feel. You bled out for all the women out here. How many times do the guys leave girls saying my parents won't approve of you. \" My family will never accept you\", that's what he said when he planned on leaving me. But before trying to compromise, I really thought long and hard that do I want my whole life to be based on some lie I made up my life to be just to get them accept me. No thank you, I can't deny myself to belong. Hold my bindi, right now, because I am done being \"sanskari mahila\", I write my own Sanskaar, and follow them my way. It took time, and lot of pain to get here, after those rejections. And reading this hit me hard, thank you for these words. A lot of girls need these everyday because we are good enough to be girlfriends just not good enough to be wife materials. *Scoffs* Kudos to you Saloni. #respe t", "sharad22_": "Beautiful", "subrat.raj9": "👌👌", "trinz.xo": "way way more powaah to u goddess.. time to paint the world in color squad ❤️❤️🤘🤘", "angel.samson.925": "Proud of you girl 👍", "alfiya_ansari": "Women like you are making this world such a better place to live and breathe in 💚", "heyprabhu_": "I just want to say that I love you so fucking much because I am too overwhelmed to say anything else", "dr._living_stone": "I've just started following u today nt i've already fall in love with your words ❣️", "being_antra_18": "I love you..u're everything that I want to be..passoinate brave independent ☺💋💋💋..more power to u @redheadwayfarer", "imayankchhabra": "@simrandhawan_englishzone #bossgirl😍😍", "gauri.menon_": "❤❤❤", "seekingsmiles_eee": "You are the best❤️... The strengths you gift girls with is incredibly awesome...Thankyou❤️😇 More and more power to you🤗🤗🤗🤗", "sandeep.9t2": "Wow", "piyush.vatsa": "Every time you see her post or story you will see the inner body every time the undergarments we know that you also wear this but you don't have to show . And for those who think that she is your role model please get a life , she is just a undergarment merchant nothing else. Beauty lies in heart not in underwear", "discodiwani": "I absolutely love you", "imkomy": "Wow ❤️ I cAn relate to every line . So true .", "thatcrazybrowngirl": "I love you so so much. ❤️", "raghu_5150": "Well said....!!!! 👍👍👍", "prisha.pugla": "best.", "iam_aditya_11": "I don't like it", "that_traveloholic_girl": "Thank you so much. 🙏☺ Your words gave me strength, so much positivity. I love you.", "bethatgirlygal": "💗💗💗", "rana.elena": "I love you too", "geeta_patra": "Thank you for writing this❤️", "alnomanrabbi": "So pretty!", "myrakazmi_": "I love her @aleeyyahhh 😭", "anindita.mukherjee96": "I love you too... 😭😭yesss.... This post... Definitely cheers to them girls.. We are strong enough.. We are....", "anamikaroy__": "Love you too ❤", "___rajashree": "I love you too💖", "paapkojalakerakhkardunga": "I just love you🌹", "preciousp00": "More power to u girl ...after reading this post I feel m glad that I m following u ...ignore the haters ..I ❤️ ur posts👍👍✌️", "_cheshtha_": "@kishikalra read this❤️", "_noraa21": "Fab...... 🎀", "jassi.gada": "❤❤❤❤❤❤❤❤❤", "beautiful_love.forever": "♥ 😘 So in love with your words and picture as well. You give me more confident to face in this filthy society. I hope we could meet someday at someplaces. @redheadwayfarer", "irrfan9_": "Gorgeous sexy", "shibani_gupta": "So will written. @redheadwayfarer 😍😍😍", "vibhav_rashu": "i dont think you need freedom..you are more than free unlike other girls who truly deserve freedom......aur madam kapda utaar ke nudity dikha ke kon si freedom aati hai...tumhari jaisi ladkiya ladkiyo ki dushman hoti hain.. i think you need a psychiatrist more than freedom", "ms_chand": "Beautifully said @redheadwayfarer ❤👌", "devika_mohan_": "Power to you lady😍 ur words never fail to impress", "thisistabi": "More power to you Saloni! You inspire me. :')", "wise_happy_mess": "অনেক অনেক ভালোবাসা তোমার জন্য। specially for the first line 😍", "_aditiiiiiiiii": "💗", "rustpad": "Wow ❤", "shoobydooby__": "❤️", "panchal.re": "This is way beautiful to appreciate with words. All I have to say is \"BE YOU\". Being WOMAN is not a crime. Lots of love to YOU and THANK YOU ♥️♥️♥️♥️", "brisashah": "You give me so much strength and positivity, i hope you and everyone around gets the same. All. The. Time.", "thattravellerchick": "Its people like you....who make me stronger each day! :'*", "mizz_kakkar": "Ur posts just make me happy always❤😭", "sukhijamili": "fucking made my day! you're the best of best! 💕", "tomar7716": "Hot", "amity.beats": "Lovely picture 💓❤️💝", "tanya_whynot": "Inspired af 😇😇🧗", "ankithaheggadthi": "♥️😘", "free_dreamy_soul14": "Mam your my role model.. God bless you.", "sho_chopra": "I don’t follow people ....but you are one hell of a woman", "juned.siddique.5": "So Beautiful Looking", "snehalsarode": "I love you too.", "neharamneekkapoor": "Thank you for this caption. Needed this.", "iampriyanka_333": "👌👌", "humera_123truly": "Kuch bi", "im_amf_starboy": "If only I could keep liking this post again and again", "tanvayay": "@shubhangi_singh19", "trulyavani": "🙌🙌🙌", "priyanshipatel_359": "Me as well @dimple.parmar.902 ...thank you so much😇 @redheadwayfarer", "pradnya_9897": "@sanket_2428 i want u to read the caption , nd yes not at all tonting u ... But see @redheadwayfarer the hardcore feminist 😘 nd givs no fuckin shit to anyone else , talking bulshits about girls ....👏", "nasihanazma": "❤️", "_salonish": "I love you ...we love you saloni❤", "priya_shree56": "❤️❤️❤️", "_.asmita.08": "Wow.❤", "niyati_rasania": "Golden words 🙏😍 me too been there and heard that and cried and picked myself back up again when I was in India. I am in Canada now studying and I am happy with how I can wear whatever I like here without people looking at me. India will change one day because of people like you. 😘💋", "simoo25_": "Words🙏🙌", "shah_hema": "@the.maverick5 read this", "alok2209": "😱😱😱", "niharika_maddheshia": "I love ur posts, but thing common in almost all of your posts related to feminism is about nudity and sex. I myself experienced sexual harassment many times, but i think apart from this many women including me have other real problems too and that effects our lives a lot. Like getting treated equally at home or at office like guys. Sharing equal work load at office. You are Indian origin so i guess you may understand this pressure of wearing ornaments all the time once u are married. Pressure of Planning for babies immediately after marriage because society thinks we are babies production factory and after that just quit the career and take take care of kids. These are very basic examples which most of the girls go through. So pls don't limit the topics of feminism to nudity and sex....its far far far more beyond that. People follow you, request you to highlight these problems too.", "sakshimehra12": "Spellbound @written._thoughts @anushkaaparashar @eeagerbeeaver @bhumika_kohli_", "dk.sharma2013": "I know you are brave but like this pic it's showing your braveness", "kritikapurna": "@kandhey_par_mera_bastaa this is so beautiful. Read this ♥", "dishasachdeva08": "Words🙌🏽👏🏽👏🏽", "simcaur": "I must say, you are such a delight to hear. Keep the good work up. More power to you. 👌"}