{"sinkingstraightlines": "It lingers when we're done, you believe God is a woman.", "sushmitsuryan": "I've found a flaw in the way my hair flows, When I flick my hair, they click photographs , suddenly I am on the flip side, I try to free myself from the sick sanity they have built, They ask me to point at the graph how happy or sad I was, I told them I belong nowhere just now, Same question still appears you wish so desperately for me to choose a side, I'll rather feel fuzzy shaking my head, You don't even know how shaky your reality is, Come to my side and see, I am not so crazy and you not so sane, When I ask you to treat everyone equally and everybody as same, You put shame when I am in my underwear, Under your hair lies a lying mind which goes on rewind to remind me all of that several times, You want me to belong, I want you to accept, Your questions are stuck on my hair, It's really necessary to flip them, I can't lick your tasteless minds, I can't pick your losing sides, I just want to point in every direction, And only my hair works as a sign, Reach for my hair, They change color everyday, I am not changing a bit today, Follow my hair's pointing, Trust me you are already lost.", "farhahasan21": "SCREAMS FREEDOM😍", "poetry_weavers1": "Let the winds go wild and compete with my wildness !!! 😋😍😘", "maandebnath": "Nice one", "the.babumoshai": "Helicopter hair?", "shivanipriyagupta": "In the world of people looking for sunlight...be my darkness instead @redheadwayfarer", "mansii.d": "The sky is blue like me and you!", "atulmehta1811": "Amazing", "akankshaaaaa._": "Gorgeous..!!!!!!💕💕💕", "acerbic_for_you": "“Because why not” 🌸🌸🌸", "aakanksha_choudhari": "👌👌👌👌", "samaira.roy": "Osm", "wounded_wolf9": "Fabulous", "_panchaltejal_": "What would I do without your smart mouth Drawing me in, and you kicking me out Got my head spinning, no kidding, I can’t pin you down", "chubby.cheeeeks": "Moody.. Floaty.. Fire and desire🔥@redheadwayfarer", "monjans__monjathees": "Love you 😍😍😍😍😍😘😘😘😘😘", "kadambarisrivastavaa": "endless vibe of freedom.............................", "charmingly10": "While you called me wild, I called myself free", "bralover76": "टू हाट टू हैंडल", "_lost.andfound_": "@parineetichopra", "debidutta_biswal": "Awesome ❤️", "smit.mirani": "This picture is wo amazingly captured 😍😍", "rishibathija": "@freeefloating", "dr_with_a_good_handwriting": "I'm green, I'm blue, I'm me, I'm every hue. ❤", "amity.beats": "Nice pic", "_nayanas.photo.phactory_": "Free ,wild and careless like the wind and mighty, humble and blue as the sky.", "_shrisp": "Blustery blues🌸", "antriksh_2745": "☺️", "throughblackandwhite_": "And even when the glitter fades, there will still be the stardust in my veins☄", "the_kalamwali": "Tufaan se darta jahaan zamaana hai,Waise kafi Tufaan Wo Apne mein le jhumti hai.", "anubhav.deka": "@_parshya toi eneke lo", "idkbutimokay": "And from the hazy reality to the fantasy I awe~ wait! This too is happiness. 🙃", "sahil_pathan_123": "Plz don't show u r bogas and bakwas body... Plz", "nanddas2011": "Azaad", "himali14": "The Blues Braingasm.", "jagdish_rajpurohit_": "Ice on Fire !", "shaiforaneye": "🔥🔥🔥🔥🔥 I love this ! ❤️Saloni soooo good", "jham_ela": "Dont need a sun for sunshine", "shivanitrivedi96": "I'm in love with PUBG?", "distortingimbecile": "Freedom", "ashahidjkhan": "Freedom", "dumbbishbiryani": "And she was fire, I warned him if you handle her with care and love she will warm your home and keep your mind sane but if you treat her as anything less than what she deserves she'll burn your universe with a flick of her fiery locks", "sharook1412": "Twist of life", "wahidarya6": "😍", "ohhmyymyy": "Fire in my hair🔥", "schifraa_c": "Life is beautiful make every hair flip count❤️ (So apt. For this particular posttttttt!❤️ @redheadwayfarer )🐣", "georgeshailesh": "Smjh nhi aya 🙄", "pavni8067": "In bhikhri zulfo me sansaar bsaa hai", "kawishjohn": "Embracing the inner savage in all its ecstasy 🌸", "iamprarthana": "Hair gone wild!", "himalidave": "Iceberg on fire", "kritika_tak": "Free as birds but still cares... Those with guts aren’t easily scared... People may call them badass!!! As they fail to see their struggles beneath those strengths. @redheadwayfarer your posts❤️🙌🏼", "dark__academic": "@redheadwayfarer She finally found the happiness she was searching for in others, within herself. Words could not describe the joy she felt so she expressed herself through dance. And the crowd watched on, envious of the spark that was igniting her from within.", "_veerajain_": "As free as your thoughts, wandering all over the universe. 💥", "gunnaa_dreamer": "“Be your own wind keeper”😇", "debasrideb": "My hair is not supposed to be tamed. Neither am I.", "daku.hansa_singh": "Beautiful lines from GURU GRANTH SAHEB JI - 🙏🙏 \"apne gam di tu na numaish kar,. Apne naseeb di tu na aazmaish kar,. Jo tera hain tere kol khud ayega,. Har roz usse pane ki khwaish na kar \".", "avniagarwal1913": "She amassed the silver linings in the cloud only to roar the sky beneath and above!", "thatgirlwithrainbowhair": "Free and flawed, loving each one of them❤️", "sachinpandey17": "Can u fabour me these days women doing smthng wrng with self and child", "acharyasupriya": "I will dance celebrating the beauty within me I will dance rejoicing for who I am... I will dance because I don't care", "sawan.goyal": "Untie..let me fly!!", "lizmaryantony": "Why dance to someone else’s tunes when I can dance to my own.", "thebigdaystory": "📸😍", "jan.sawant": "I'm the mess you feel in the chaos", "miss___basu": "Blue is the warmest colour 😊", "_.simrannnnn._": "Self acceptance is the key. I’ve lived my life as i wanted; Enjoyed every single bit as i wanted.. But Being judged on regular basis;Being tagged as a slut;Being called a characterless feminist bitch just because of freedom i had was enough for breaking a soul; for breaking me. But who cares? For Living in a place where mindset’s are smaller than soil grains is not an easy job... Life can be hard you know.So loving & accepting yourself is what makes you stronger. Love yourself. Live up for yourself. Because you don’t know what’s next! P.s. No one can break a crazy soul. -simran", "urvi0890": "Your dictionary calls it Characterless, mine says Carefreeness. Let yourself choose for you 🗽", "ganj15": "'The answer my friend is blowing in the wind'", "thewritekid": "redheadwayfarer just caught redhandedwayfar away from the sky. ♥", "i.shaona_": "She is firece! Not like the fire that swallows u from within but like the wind that knocks u off!!", "n.i.k.k.i.09": "Flipping all my problems away 💖", "_.vaishnavi66._": "Darling, you shall think whatever you want to think of me. But you know I'm meant to fly, in that gorgeous blue sky tearing apart those diamond like clouds... I'll rise and I'll shine... By:- Your feminist fan❤", "aayusshhiiii": "she's on the loose , she's coming for u", "rafiqul_islam_tushar_": "Because I wanted to paint it blue today!", "kalpana_013": "I saw joy.. it's blue!", "roza_sinha": "wow", "chinmayee.s": "I... Am what you seek, but that you can't possess. What you're dying to be, but you fear you'd die if you be... I... Am the the voice you want the world to hear, the \"perfect\" skin you want to live in, the soul you want to embody, the love you want to give... I am who you think you're not... I am the YOU you want to be but are not... @redheadwayfarer #captionthis", "_so_li_va_gant_": "You don't avoid the hurt but collect the bruises...proof that you showed up. Everytime. Baby girl you were meant to shine..", "__kaaju01__": "हवाओं के साथ. . . परिंदों के देश में. . . शांति , सकारात्मकता , सद् बुद्धि की कामना करते हुए आजादी की धुन में मैं ✨ . . . सभी को हिंदी दिवस की शुभकामनाएं 🙏", "ipshie": "Unload the fear from your head, shed it off your mind, shake your body untill you're tired. Let the world see the fierce, fearless face of an 'Indian woman'. An Indian woman who is in a spree to set herself off from any overhead of the male dominant society. #awomaninfreeindia #", "chaipio_biscutekhao": "Ude jab jab zulfen meri", "aastha_prakash197": "She was freedom personified. A storm in a cup. An entire universe in a soul.", "veeclicks": "Even when the sky is filled with clouds the sun still shines above", "the.punkkk": "Mother, how can I be proud of a body you want me to hide? how can I smile at the growth that makes you frown? Mamma,I know this world is hard I know you fear for me but mother please, raise me to be harder than the world you are scared of teach me to love my flesh teach me to be fearless not to cover up, not to look down.can I be proud of a body you want me to hide? how can I smile at the growth that makes you frown? Mamma,I know this world is hard I know you fear for me but mother please, raise me to be harder than the world you are scared of teach me to love my flesh teach me to be fearless not to cover up, not to look down.", "_gainscity_": "In an insane world she was the sanest choice!", "picturesbynivedita": "This picture is so surreal.💋", "niharika_dadhich": "Freedom is not what you see, freedom is what you feel! giving yourself the pleasure to feel free is the ultimate gift you could ever gift yourself. Today I gifted myself this sky of freedom. What about you guys?", "rajeev.isms": "Forex", "jhabariii._": "Ude dil befikre👌👌 no matter what the world will think about u.", "steadiman": "Electric avenue", "_.alfina._": "Be unapologetic about who you are. You are unique and different, in a way this world won't understand. Let the essence of your being be free with the your hair flying. Let your smile be the response to the world's rules that limit you. The sky is way big than civilisation we limit ourselves in, your being is way more powerful and beautiful in every possible manner. Be unapologetic everyday! @redheadwayfarer", "anastasiasteele691": "she was a bright spark, even in the darkness. such a madness she was, she made the abyss bent down to its knees to admit defeat. for he could not conquer the pale gold light she was.", "world_ball_official": "#albatros", "_.chiya_be_chichi._": "She is free! She is free like a bird🐦! She is free from the odd practices that try to cage her! She is free from gender based differentiation. She is free now and you won't be able to cage her now! Cause baby tumhari aukaat hi nahi hai usko udne se rokne ki ! Vo udegi aur jaha man chahe jaegi! ❤", "goyalchetan": "🔥slaying the air with my hair🔥", "photocrazia": "Free spirited", "__ayushigoel__": "Even the wildest of winds could not tear the wilderness in her soul apart💥", "sakshibaidd": "😍😍😍😍😍😍😍", "rituajwani": "Yes I am a girl.. and I can fly just like the birds in the sky♥ I am free to live my life the way I want to! There is no one who can stop me from flying... because I am born to fly♥ P.S I LOVE THIS PICTURE😍😍", "akshaykapoooor": "Note to self: just remember, you will have people around you who will love you no matter what and that's beautiful. That's the most beautiful thing in the world because love can make everything better. Because all you need is love to survive (apart from food, water, air and shelter). Especially in the world we live in today. But it'll come down to you taking care of yourself. You know why? Because the only person who will always be with you is you. So, when you're out there facing the crowd that won't like you for who you are, for being different, for not meeting their expectations they have from a person, stand out. Be different. Be crazy. Be who you are. Lose yourself, but, not in the crowd.", "deepa_gandhi": "I am part of skies yet with my own identity.", "theycallmepoohhh": "उड़े खुले आसमान में ख्वाबों के परिंदे", "rocky_pinto": "Woww nice boobs.", "rain_star_11": "Can you feel the wind that touches my hair? Can you see the smile that plays on my lips? Can you see how happy I am when you let me be? Can you feel it?", "snehajainp": "Fly as high as u can nd don't let anyone control u ...unless it's ur heart", "nishhhhanonmous": "🌈", "ar0undtheglobe": "Let's keep it short and straight. YOU'RE BEAUTIFUL INSIDE OUT", "khushi302002": "We brush bullets from our hair, not caring to check where they fall!", "varunshegal": "Fire..freeeeee😊😘😘", "junglejim_": "Jhoom barabar 🎶", "thelostsoullllll": "\"I am a firework\"", "_chan_oey": "What's the best thing about him? His Bravery. Without a doubt. That guy lost the most dearest person in this world and yet he is ready for every fight. He's ready to sacrifice. He doesn't think about himself but is concerned about everyone around him. That's how I know that he will love me and care for me no matter what. He's harder then iron yet more fragile then a rose. Despite everything he loves the way that everyone should love, everyone dreams of being in love;with his mind,body and soul. That's the best thing about him. -Zeel Shah", "yasmin_aviva_": "Go Beyond the Obstacle to raise your own Identity🤠", "yours_sajal": "@tavishisharma2796 read all the comments", "mugdhakusray": "You go on/ Giving,/ Giving,/ And/ Giving./ Yet, it's never enough,/ For them./ The more you give,/ The more they claim./ Prising you open,/ Playing a sneaky game./ Come on, let yourself loose,/ You aren't theirs to tame./", "_booknbhook": "She will not tell you that she is change. Her growth is shown by every ephemeral moment😘. @redheadwayfarer", "ridhima_rai3": "🔥🔥🔥🔥🔥", "s.anshika": "The \"summer fairy\" 🧚‍♀️ !!", "gufranaasmat": "He peeped into my soul, He carved his name in, and see that happiness on my face it's still there and it increased even more. Yes men's like these still exist,who respect women,who understand women and take pride to call that my gf is feminist and I am proud of her...(from Rahul @rahulb90 bhaiya k traf se @redheadwayfarer saloni didi aapke liye..more than you I adore bhaiya for what he is and how he understands you♥️)", "rupalikamboj98": "Pastel on my mind and hair too", "mnxdesigns": "Live young, live free @redheadwayfarer", "neha_phalaswal": "If freedom has a face or click it's this 💕", "shakesaima": "Don't contain the wild in you, Let it roar, Flap your wings harder And soar, You've only got this one life, Always go for more! - Saima.S -", "shaanchau07": "Too old to whip, never too old to nae nae🌈🙃", "madangirikar_sailee": "The sky and my dreams are of the same colour. Unapologetic blues. Sometimes pink, orange and lilac. But never-ending for sure.", "ananyarai_02": "Let the breeze embrace you; cuddle with your hair; sight a subtle smile and let the face go happy reflecting the wild soul #happyme #happygirls #naturelove", "drashti.98": "Under thr blue sky,above the green land i very much found myself to be free and wild.", "faaaaaar.din": "A careless freak gal who dont care what world is saying about her <3", "thatbindigirl": "Let me live free.", "farwa_zahra_naqvi": "Mast malang 🦋", "pallaveevyas": "Lo Tengo. This moment, I own it. This place - this life - this style- this breeze - this attitude - I own it. This is my time, this is how I have planned it to be, this is what I have always wanted for me and now its my day to slay in my way. I own this feeling and I own the lights. Ain't nobody can stop me now, because I'm fearless and free and totally in control of me.", "bedhya.sethia": "Young, wild and free", "tejaswighagada": "This one is my favorite ❤️", "mitregal": "Let the wind blow your hairs, cold breeze touch your face. Let the nature purify all the \"impurities\" & set your soul free like it's born a moment ago &Love the life you live. LIVE the life you love..😇", "nidhi_singh87": "\"The depth of my dreams is deeper than your thinking\"", "radhika_56": "Wild. Free. Young", "blueginger7845": "rainbow in green...", "writika_": "Because baby there is a sky in my mind which is so carefree and confident and blue and windy and unstoppable that anyone who crosses by cannot stop gazing.", "akankshatrvdi": "@redheadwayfarer जब कभी भी अपने में आती हूँ हर उस रंग में मिल जाती हूँ जो मुझे तेरे न होते हुए भी तेरे जैसा बनाता है। मैं जब भी उस लम्हे को याद करती हूँ जब तेरे हाथों ने मेरे हाथों को पहली बार थामा था , मैं इस नीले आसमान क्या उस सुनहरी मिट्टी से मिल जाती हूँ, मुझे तेरे न होते हुए भी तेरे जैसा बनाता है।💖", "madhviarora": "Mujhe kya parwah is duniya ki.. ..😍..yes this is the perfect caption for your picture", "alqma_suhail": "Maybe it's in the wind or may be it's the waves but if it's me then i own the grace😊", "aswinikumarpattanaik": "Big boobies", "haritha.sp": "And after all those struggles she had faced. All those bruises , all those taunts ... She got to know her worth. From those where she had to make herself sleep sobbing to days where she woke up in his arms. He helped her to be confident in what she is. He made her learn to be herself. He made her love herself. He made her realise that she is beautiful. He made her lively again. He brought back the real her ... Again... And she didn't cry anymore. She smiled ,no, she laughed. She laughed her heart out. He never let her realise her old days. And she loved him. She smiled everyday cause of him..", "sonali.08": "😍", "manisha_ahujaa": "Staying in my play pretend with the fun ain’t got no end.", "vaishnavijamdar": "Libere-toi🕊️", "stardustsuperwoman": "To the sky within her...bold and beautiful always...", "sentimentalsakura": "The one solution to windy days and stormy moments, is to flip it off😂", "sonammsakhuja": "The blue blue was feeling blue, for all she knew, that blue wasn’t the right blue, you knew it too.", "dishaa_sodhi": "So applied some fresh pixie dust in my hair today.. Haters would say its a lie🤷‍♀️ (and thats the caption, not critisizing u.. You god damn wonderful woman)", "shaluverman": "Blue as a sky n free lyk a bird", "aditi_subhadarshini": "Her hairs were more unruly than she ever could be. @redheadwayfarer", "tanya_whynot": "Wild and free 🔥", "oshinbijalwan03": "@redheadwayfarer I have taken birth to fly high not to become a bird captured in cage", "saleempatel133": "Mast kalandar @redheadwayfarer", "trylivelearn": "And I let them fly. My wings were answer to your chains.", "_divya_jami_": "I am gonna put on my sass and kick some ass 🔥🔥😍", "monali_mahajan": "you held me down but I got up already brushing off the dust! #roarlouder", "debasmitan": "Untamed", "akul93": "I’m liberated, I’m caged. I’m complete. I’m dependent. I’m sanguine, I’m apprehensive. I’m confident, I’m anxious. I’m euphoric, I’m dejected. I’m introverted, I’m extroverted. I have taken the road less travelled, I have taken the road travelled more. I’m unpredictable, and I appear cold. I’m not perfect, I have my share of faults. But today, I feel free, and today I will let my hair fall. Today I will jump, and today I will shout. Today I will let people judge, today I will let go of those doubts. Today I just let things be, today I celebrate by flaws. Today I do not feel omnipotent, today I feel human governed by nature's laws.", "ketang26": "Let your courage match with that of a sky.. Vast and Infinite.", "heysajit": "This just looks like @thefilmykudi getting all hyped up in College Romance except with a smile 😂👌", "shashi_here": "She was free in her hair, skin, colour and smile. But the world wasn't.", "jovidsouza": "Alive!", "_koyal._": "Burning it with blue 💙", "avibratadey": "U'r mindblowing mahia 💋🔥😘😍❤❤👌", "freespirited13": "Let her be free and wild because holding her back would be the biggest sin of life", "trendandbread": "\"I cant hear you over the volume of my hair 😀🤩\"", "misbah.azam": "Honey, you can't stop us frm flying.. Even our sanitary pads has wings.! 🙌", "gauravpaul____": "My way today...", "arshdeep._.pretty": "Forget not that the earth delights to feel your bare feet and the winds long to play with your hair. ❤️", "malik_ravi": "Your hair is your crowning glory. Own it, love it, enjoy it.", "saumya.sinha95": "Happiness is only found within...💕", "n_ruch": "सै रा ट ❤️💯", "obscureoptimist": "In the blue skies And a head full of azure dreams Dive deep... And swim through crevices Of this beautiful mind And explore the naked truths That were hidden gloriously All this while In cloaks of hypocrisy Shrug them off Twist Turn And Let go... Breathe and merge in The subtle hues The blues And greens The raw shades of yourself And exist... Just like you were meant to.. Unapologetically! ***", "manishibist": "Azadi manata hua parinda.", "video.wale.meme": "Cages were build for birds, eagles have the unending sky.", "anu240310": "I Feel High Up Today, With My Mind and Soul Free too. You All See The Freedom in Me, As all The Blue Skies have Filled in Their Colours Today Over To Me, for Today and Forever. The Power of Freedom makes You Feel Happy from Within and That is clearly Radiating Out To This Whole World Today. You just cannot Capture The Sun. It will Spread it's Warmth, Energy and Radiance Everywhere Today and for Ages to Come. All we can do is Capture Little of it's Energy and Try, and Spread The Same Warmth and Message To This Whole World. We can't Be The Sun but of Course We can Be Little Twinkling Stars in Our Own Little Universe. To Brighten Up Somebody's Day, To Motivate Someone Today and To Spread The Right Messages to This World. So that it can A Better Place for All of Us.", "67_aarevi": "Beautifully shOt! 📷", "woohoo_paradise_found": "Blueberry 💙💙", "_____equinox_____": "They say it's a free nation. But really are we ? We are an independent country. But we really behave like one. We are free birds , I guess that's what it meant. Then why does it affect people if I wear short dress, and walk confidently. Why do they categorise me being a characterless? We have a freedom of speech , so have a freedom of dreams , isn't it ? But no they chained a us in homes as we are not allowed to dream and full fill it. Aren't we humans to dreams of things we wanna do. Why are we categorised if a girl go on late night shows or do a job that's not easy but she do it because she wanna earn and live full fill her dreams. Where are we free, when my body defines weather I'm a good girl or a bad girl? Where are we free, where girls are still doing arrange marriages because their family force them to. Where are we free? Maybe free nation was just a phrase they used, we are still there judging you for doing things , judging you for who you are.", "farhanali7028": "Please give me a one chance I can drink your nipple", "basheeerz": "LOVE THISS", "sonali.jain": "Let the skies worry about being blue.", "haram_khor_\nVerified": "Verified", "monal_jj": "Ye hawaye Mujhe kaha rokegi, Meine Toh Isko bhi modna Sikha hai. Ye aadatein bhi badi Khub hai Meri Jisne behati Hawa mei malang hona Sikha hai. Tu fikar na karr ki Kahi azaad na hojau Tere bane hue paimano se. Meine sare paimano ko todna sikha hai. Tu rok Le Ya too de Mujhe Koi bhi parvahh Nahi Meine harr Teri jaiso se Muh MOD na sikha hai. Ye mukaddar Konsa hoga Tera Jaha jamant Sirf apradh ko milati hai... Meine Tere harr jurm ko ache se marodna sikha hai... #something new to your comment love love 😍", "shwetagul": "Alone we fly!", "rheasachdeva_19": "You don't have to be pretty. You don't owe prettiness to anyone. Not to your boyfriend/spouse/partner, not to your co-workers, especially not to random men on the street. You don't owe it to your mother, you don't owe it to your children, you don't owe it to civilization in general. Prettiness is not a rent you pay for occupying a space marked 'female.", "shaambhawee": "What I lack in conformity, I make up in soul.", "_miss.imperfection_": "All I care about is myself and I am happy being me...😊", "yasnasehgal": "Oh stri, raksha karna", "palakbatra2405": "Blues on hues 💙", "chauhan_neha18": "Akeli aawara azaad😎", "thebrewederotica": "The world wanted to imprison her, they just didn't knew how to put shackles on breeze", "ishita_tambi13": "Young soul.Free", "akunurihehehe": "Sand in my hair. Dreams in my head💫", "bev.er.lee": "Dance your blues away.", "ofaroque11": "Blew against Blue. @redheadwayfarer", "contactmesure": "I am not a pessimist. I am just optimistic about things getting fucked up...", "allthoseflaws_": "You beauty. Thank you for existing.", "its_mj": "Elegantly shaking off all the brainless comments from my head😉", "obvnotkeshini": "J'y suis!J'y suis toujours.", "suggutan20": "I got sky in my hair .", "pratishtha117": "Free souls...", "somewhereinthe_corner": "To all the girls out there. You don't need men to feel like women.", "i_namantated": "Set ur spirit free of all restrictions all injust activities caged under the cover of tradition and customs of all ifs and buts just breathe in the air now and forever smile a bit larger because it makes ur face glow live your life free of all limitations like an eagle that flies high and rules the sky... #dedicated to a person who no longer is dependent on any introductions the one the only @redheadwayfarer", "harwinderkaur11": "When the sky looked down on me for the immense freedom it possess...I took it's blues and danced under it's vastness as I myself am the Life endless.", "brewed_thoughts_": "Hey! Can you See me smile and laugh? Oh yes! I have taken guide to survival, a guide to live. Least care about you lost in my own world. Enough of cries and fights, enough of my rights. I am all in blue and green painting my life colourful. I am here to live the world , the one I am part of. I am all set to stand out with my shiny hairs. It's very easy , all you need is a dab of concealer and an extra court of mascara. Never forget to put that red lipstick which makes you stand out. Why the life is around get up take a shower clean your soul and clean your mind. What is the need to clean everything when I can recreate a new one using the old. I don't want cleanliness but calmness. Just a cup of coffee with thoughts in my mind ,I'll have one more if that what it takes for my thoughts and then with every sip I'll conquer what I desired. I'll Be the human not the queen. Be that smiling person to the mirror , be that lady of grace and most importantly be myself.", "jha.jayanti2000": "Khud ko khud se riha de. Apni awaaz ko zubaan de. ( Free yourself from yourself. Give your voice the freedom to speak.).", "xlrtn": "Blue sky blue top 🔥", "adii_agg": "LIKE THE SKY, LIMITLESS 💙", "bolta_kagaz": "बेबाक़ बिखरी ज़ुल्फ़ों सी हूँ मैं, एक बेबाक़ बहती नदी सी भी मुझे न बांधना, मुझे न रोकना, मैं किसी की भी नहीं, तेरा हक़ हूँ मैं, ये न सोचना ! मैं आई हूं मंज़िलों से मुझे रास्तों में है पहुंचना !!", "niru_shah": "The skies coloured her blue and she coloured them wild.", "the_saiprasad": "This pic reminds me the lyrics...👇 Jab yaar kare parwaah meri Mujhe kya parwaah iss duniya ki Jug mujhpe lagaye pabandi Main hoon hi nahi iss duniya ki", "keerthana_cc": "Lips may fail to define my beauty, but my smile never does. Face may fail to define my beauty, but my glow never does. Being happy is kinda beautiful😍", "surbhi_singhh": "Maybe she flipped her hair just because she wanted to. Maybe it was not her intention to show that she was interested in you. Maybe it was not an indication that she wanted something. Maybe she just wanted freedom for herself and her hair. Maybe she was so in love with that moment that she almost forgot that she’ll be judged for this. Maybe she was so in love with herself that she forgot that different meanings will be taken out of her action where the only real meaning was that she wanted to flip her hair.", "ysumana": "Let the hairs down...and the inhibitions free...let me just be me!!! I flaunt it because I feel beautiful inside out...not because I am asking for something or it is my want...my body my freedom my choice...you have in this matters no say no voice!! It vl take ages for u to understand but until then...give it a try and take a stand!!! Love you @redheadwayfarer 😘😘😘😘", "almash_yusuf_naswan_": "Fly high, in the sky ...", "hemanyshoes": "@redheadwayfarer The strands on my head go round and round, round round*2 all through the town..", "thisistabi": "IM FABULOUS! 😌", "implied_line": "Following peacock's courtship ritual @redheadwayfarer", "__poojatale__": "i love you 🌹", "upbeat_rover": "Merge in yet stand out like a roaring tiger", "yashnirwan": "Kamaaaaal picture ❤️", "localheroin": "I'm like a bird  I'll only fly away  I don't know where my soul is (Soul is)  I don't know where my home is…( this nelly furtado song came first thing to my mind)", "chanakyaseven": "@redheadwayfarer Open hair, Clear skies and thought minds.", "_divyanshi_vyas_": "🙈", "vanshisinha0001": "No one can stop me from doing things i like to maKe my life happier and joyful just because they unlike that or just because society would not accept it....I am who i am and i show what i am exactly i cannot show off the unreal me to walk with the unreal Society.... Humans are made to grow and heal and live their life on their own terms to grow and live their life....in some villages as i saw or heard people or parents force their girl child to tie their hair up and be innocent... tying up hair do not show that they are innocent its their choice to tie them or not....Such people seriously annoys me a lot... they should change their thinking....appearance is not the thing that describe a person whether they are SANSKARI or not.... #befree #carefree....", "suchi.fadte": "Free Spirit", "sswatidighe": "Everyone wants a strong women until she actually stands up, flexes her muscles, projects her voice..... Suddenly she is too much. She has forgotten her place..... You love those women As ideas, as fantasies.... Not as breathing, live humans Threatening to be even better Than you could ever be.....", "aayushidholakiaa": "You're on a different road, I'm in the milky way You want me down on earth, but I am up in space You're so damn hard to please, we gotta kill this switch You're from the 70's, but I'm a 90's bitch🎶", "kawaii_myra": "Coz baby I'm the right kind of the wrong! 🔥", "_lilim_stepped_in_": "Defined by no man , you are your own story , blazing through the world, turning history into herstory . And when they dare to tell you about all the things you cannot be , you smile and tell them, '' I am both war and woman and you cannot stop me ''.", "the_mesmerized_one": "The blues are in my skin too, and like these white clouds in the sky, My teeth shines. The colors of my hair Are green, greener than the Leaves of the spring. My laugh is dancing around, Spinning like there's no limit, No border can fix me No air can blow me away For I'm a free bird Who's world is RAINBOW And the night stars Are jewels which I carry.", "_.anushka_agarwal._": "😍😍", "p_r_i_y_a__n_k_a_": "Be confident in ur skin, body, personality & accept urself from all ur heart. What is urs, own it.", "grey_jay_zoe": "To be free is to be you. To be you is to be free.", "shrideepmohapatra": "Blue is the warmest colour.", "mahenoorumul_": "Come darling , When the breeze goes by When the leaves rustle When the clouds open up When the time runs slow Darling sitting near the river were once you and me . Come darling , In my dreams sweetened In my thoughts rotten When my breath quickens In the moments forgotten Darling sleeping on the grass were , once you and me . Come darling , When everybody is gone When the flowers loose their scents When the house smells lone When your funeral's over and your body gone Darling laughing in this house were once you and me . —— Mahe💙 ©️ .", "iamstutisharma": "She flared her red hair across the blue skies spreading violet smiles dipped in blueberry dreams of floral chiffons loosely hugging the fire that she was. Like a tigress she was, wild and free, embracing her soul. With closed eyes she seemed like an adorable kitten but Only if you dared to stare deep into her eyes you'd know, what it feels like to be trulty in awe.", "ikritiv": "Carried away with the wind❤️ #lifesawesome", "imsleepingeatingwanderingolwzz": "Holding the colors of ocean and skies...and the depth nd heights in her eyes...💙💙 #redheadwayfarer @redheadwayfarer", "my._.dumbass": "Things I will never say. Things you'll never know. Things we'll never be. Things. Ha! Such is the materialistic sphere you and I dwell in. Guess what? We have no choice. And the greatest flaw we are a part of is, that we are among people like us to the suffocating limits, yet feel so lonely. Strange how these people have handcuffed us and smashed our mouths with awkward silences. Believe me or not, I am howling inside to say things, only that they fell on deaf ears. Gazing into the horizons of possibilities I often tend to overthink things I wish to say. Only if I could intervene my fingers into yours, struggling hard with the handcuffs, and somehow whisper things to you. And even you would magically cross borders parting us, to intervene your fingers into mine, struggling with the handcuffs, and somehow know things already. Such a colourful mess this world is. Splashes of paint all over the globe. And here we tend to make a difference by remaining black and white. To be or not to be? If this is the question, to our ill fate we black and white hearts have chosen not to be. We could have been so many things yet we chose to be two nothings aspiring to be something. I could have said so much things. You could have known a billion things. We could have been something. But for our choices. Choices to be a part of this colourful mess. Choices to let this colourful mess handcuff us. Choices to not cross the borders and be a colourful mess ourselves. Alas! We made wrong choices. And hence.. Things I will never say. Things you will never know. Things we will never be. Things. @redheadwayfarer ( PS:- You're pyar and inspiration💕)", "king_amrita": "Gagan chumbi❤️ short one😉", "swatii_b": "She was different. Someone who always loved a little more and laughed a little harder. Someone simple. Someone flawsome. Someone broken but someone stronger. She was someone who hoped, someone who believed. Someone who always felt a little lost but someone who held on. Someone who lived with her dreams in her eyes and fought with her demons inside. Someone who cried to sleep but the next morning, someone who always tried. Someone who wasn't complete but was enough. Because she was someone who learned to be her own hero when things got tough. She was someone who just wanted to be free. Someone who simply wanted to live. She was someone who wasn't easy but just a magical chaos within.", "_priyankasakthivel": "In the moment..enjoying herself", "snehamukherjee_": "Wind in my hair and insanity in my veins ! 🌼", "jasleen152": "Young and wild or free as a bird ❤️ free soul", "akankshajaiswar": "Blue isn't just a colour ..its freedom..freedom to wear anything and to do what you feel..feel blue..feel freedom..blue my hair just like sky since my hairs also know where to fly....", "sachinkakkad": "@mansi_theidealistmerchant", "anshu_la": "She doesn't wear elegant shades on lips anymore Neither she holds innocence in heart Nor she owns that glimpse in her eyes. She has become fierce, Lionheart too. A storm, which no one can bear.", "baloch_7": "😍", "inked_with": "Free your skin and let the soul breathe. It has been burdened beneath society's weight. Smile like you have seen a rainbow and let your soul free", "the_unspoken_words_abhi": "She was free. And not in the generic sense of it. She was free like a warrior marking her territory on a path that had never been traversed before. And I often wondered if she'd be able to fight the usual demonic clutches of the society. But I was surprised to see how she brutally executed all such clutches and laughed at the battleground showing the metal she was made of. She was invincible.", "anmol._sharma": "God's own dance", "srishttia": "That moment when wind get crazy and fucks your hair , you find peace with chaos right in your head❤️", "jay_mehta127": "Amazing soul and pic as well..best of yours 😎👌🏻", "_tanuu_._": "\"I stopped waiting for the light at the end of the tunnel and lit that bitch myself \" Go for this @redheadwayfarer 🔥🔥🔥🔥🔥❤️❤️❤️..and you always make an impeccable entrance with your words", "the_redheadhabanero": "udde jab jab jhulfeee meri❤️", "shleshalokhandwala": "I'm not a writer but the first thinh came to my mind was \" free soul\"", "quinate_hummock": "My mother taught me to transcend from learning to be careful enough when she's inside the womb to teaching her to be carefree enough outside it 🌻", "aishwarya.sahooo": "I'm not breathtaking. Just the one around who your lungs can easily fill. ❤", "princess_of_pluto": "I am the colour of the wind and sky, catch me if you can", "dikshadhar1112": "I choose to be me....I choose to be free💕", "_littlewriter": "In the arms of the sky, I lost my own self - and never have I been so proud of losing something - ever.", "kumudsareen": "Joy", "habeebatahaseen": "She was free. Underneath the blue skies and next to the powerful ocean. With the wind on her side, she knew she was free.", "shailjasays": "\"I picked this caption because I CAN\" 😁", "medhu.vadaaa": "I am high on life cant you tell", "beautifulmess20": "Main hoon hi nahi es dunya ki 😁🌈", "_preety_choudhary_": "•I am a warrior, a survivor, I am ready to unfurl. Inexplicable, unstoppable, a dilemma. I am a Woman, And I know my worth•", "mahimapatheja": "Madness and Magic wraped up in blue with a little bit of hue,", "dirtycaffeinater": "Floating in these blue skies, dancing in ecstacy, bleeding happiness and sensitivity. A smile that reflects a heart toughened by the world; Foating in these Blue skies; Dancing in Ecstacy. 🌤 @redheadwayfarer", "gen_sarah": "Hair flipping away the trolls 💃", "pallaviiaawhale": "Sunshine mixed with little hurricane!☀", "lightnessofbeing101": "People: Good girls tie their hair. Me:.....", "freaked____": "Let me nd sky unite ..one more time make the world glorified..", "aaliyafatma_": "I was once afraid of people saying, “Who does she think she is?” Now I have the courage to stand and say, “This is who I am.\"", "rafikkhan_rk": "#loveblack❤️❤️😍😍_babe", "_shalaka_dhawane_": "Is it chill that u r in my head❤", "mareyazeenat": "human ferris wheel !", "nikunjharia19": "Free spirited", "drpratibha_singh": "It's me with each essence dissolving into free spirit 💃", "herjourneyjournal": "Let's be we!!!", "mayhem._._": "For me, girls with wind in their hair look more powerful than elegant. Do they fear anything? Or do they step behind from anything? Nope. The answer is unsaid yet spoken by the wind in their hair! @redheadwayfarer", "mentimenjamir": "\"life is short, make each hair flip fabulous \""}