{"juicy_boy_nikhil": "Wow ur so slutty. ...", "rscreationzinc_official": "Beautiful ♥️♥️😍♥️😍😍♥️♥️😍😍♥️♥️", "olwhiskers": "Here, here. We all look the same in the dark.", "architapatnaik": "🙏🙏🙏Glad you talked about it. I felt I am the only one who thinks like this.", "dastagirpatahn": "Sexy 🔥", "danielcrrrr": "New generation Randigiri", "davidweber365": "Yes that's a comfort so be comfortable with your nonsense 'me too' stories to stay in the lime light in your grey days... Emotional Indians haha", "i_am_sharl": "@redheadwayfarer really true and very well said 👍😘", "nizam.ahmed": "#bless", "shreya.yaadav": "💯💯", "pravikadiyala": "@m_rakshita something i always women to understand😂", "ecrivainnnnn": "🙌✨✨✨🌈", "mr_kartik_k7": "😂🔥", "porismita.dutta.969": "💙", "uddipana_": "I love you so much for making me feel what I am feeling rn. Thank you.", "ravimehra93": "😍kachhi utaar de", "tentistimothy": "Lemme take off ur panty n take u on my dick ride 😍😘😘", "dr.youngsinner": "True af🍀", "nikitaasarda07": "“ as though people are coming to examine if I’m wearing a bra” HILARIOUS. I sat like an idiot laughing alone,at that sentence.", "_chayholic______": "Ur killing babe 🔥with ua thought😍😘❣️#lotsoflove#icon#realfeminist❣️#luvusalonichopra", "amkumar4108": "Hi", "rooop5588": "😍i love you so much", "meemansaaaaa": "According to me, there shouldn’t be any compulsion to what to wear inside home or while going out in the public spaces. But in India we cant change the mindset or conditioning of the people that how we dress decides our character. So in India and inside home, if there are male members in the family then you must wear a bra inside your top and you must not show your cleavage because, no offence but many uncles get aroused by this and might touch you inappropriately assuming that you are of a low character just because your cleavage was showing and by this we know that we aren’t even safe in our own home with our own family. And while going out you must wear a kurti and slacks or pajami, or dress which is below your knees because if we are in a gathering and there are guys present and we are dressed inappropriately according to the society and being frank and open we are giving them a hint. So dress decently Ladies!", "sanjay.harsora": "👙👙👙👙", "crisis_over": "u talk too much man!!! there is no need for explanation. Do what u want.", "__thebaaam__": "Last tym proper clothes kab pehni thi ...?yaad hai.....😂😂", "earth_mamma": "I followed you because of that post on menstruation. Very powerful. But I notice v repetitive content. Take it as a positive feedback. Maybe also work on avoiding shallow content? Maybe post pics like these as Insta Stories? You have all the potential, just focus on building the \"right\" (more sustainable) brand... Cheers!", "beingsunita": "Seedhi baat, no bakwaas!!! Well said!", "_sonalika1": "Ye faltu ki bakwas h sab , ye India h India kase bhul gayi?? Yaha par Tm har post me chahe jitna bada essay likhlo kisi ke bheje me Kuch ni ghusega or ha mana tmhra sharir h Jo marzi Aaaye so kapde pehno par yaha panty me pic upload krke kya dikhana chahti ho?? Logo ki galat nazar hmesha rhegi ye dhyan rkhna , mentality ni change hogi kisi ki yaha. Ye panty pehne ke India ki road pe ghumna sab faad denge beech me se , fir likhna essay baith kr. Yaha ke logo ko ghnata Kuch ni smjh same wala kyunki unke dimag me GOBAR bhar ra g", "ma.rtina7577": "Truly inspiring..", "candice.devon": "Hi, check out the world's no.1 customer booking APP for HAIR SALON BUSINESS https://pulse247.net/", "foto.fino": "🤘", "tiyashachakrabortyy": "😍😍😍 hair colour @redheadwayfarer", "jyotikaa.m": "Hey! Saloni I hope you are having a great day. Just want to say that you have grown way more prettier day by day also grown more fairer after coming back from Euro tour. Love you ❤️😍 @redheadwayfarer", "_sassy_shweta_": "Fakeness overloaded", "mrindia00": "Nice seen", "distortingimbecile": "♥", "mohitester": "Please, for heavan's sake, Shave!!", "suboddh7": "ye kya chod faila rakkha hai madam🤣", "merahul_bob": "Lov u", "abbie_sidhu": "👌👌👌👌", "sumitjaiswal1528": "🔥🔥🔥🔥🔥🔥🔥🔥🔥", "realgoalsget1010": "This is such a gross misrepresentation of comfort or feminism. It is unfortunate that you have to stoop so low to find visibility.", "n_a_n_d_i_t_a_": "Picture is cute😍", "abitboutbittu": "Babe thanks really really really a lot. Your posts always lift me up whenever am falling. ✨ These days I was so insecure in my skin my shape and every thing I'm yet somewhere I was cheering myself coz I know I'm beautiful inside out but that wasn't enough things were drowning me inside void even still. But after this post I'm fueled with some more confidence. And here whatever am saying to you is no joke. I'm all grateful that you were born. God bless you. ❤💯", "oluwasegunrichard": "I want to fuck your pussy and ass so mercilessly and nasty with my big cock", "diff_den_u": "“REGARDLESS OF YOUR GENDER\"", "stutygupta": "@_tarushijindal_ @shubhangi910narayan 😚 you people accept people as they are (personal inspiration 👄)", "seherr_khan": "You are born to change this world❤", "leon_a3100": "How do men express their sexual intent appropriately (i want specific answers )?", "im.ganny": "Are yr thodi to saram kr... aesa kya special h tere pas dikhane ko... jo tu ye nangi pungi post upload krti rahti h...", "ipshita__das": "I totally love you the way you are 🌹", "parth__7598": "osm @redheadwayfarer sister", "jai_thakur23": "But first...fame..🤣", "mayur.maral": "Hey sweetie wid out clothes u feel very comfortable darling😉😉😉😉💋💋💋💋", "amity.beats": "Nice 😊🤗", "_j_e_r_r_y_9747": "❤❤❤❤❤❤", "the_philatelic": "Glamorous", "salonikhandelwall": "Yaar ye to kitti sundar hai", "alnomanrabbi": "Sexy pic post babe 🤣🤣🤣@redheadwayfarer", "a__kingsman": "Woman... You are so freaking awesome. Why dont i have a GF like u in my life?? Just love u a lot... Muuahha", "rajdhariwal_18": "@redheadwayfarer .people usually inspire others to be a better person , more than what they maybe are not . but you inspire me to be comfortable with myself . I think that's pretty important . I can't be better if I am not happy with what I already am . self acceptance is so essential to be a better person . self hate ruins who you are . you changed a hell lot by helping me to be happy with myself . and trust that changed not only me but also people around me . thanks a lot for that .", "_lilgupta_": "@asthajain1 this.😍", "mcroops": "@redheadwayfarer are all your posts n activist messages always got to do with undressing ur self with strong statements for more attention on social media ? There are other way of working towards the Nobel social cause but since u choose this way all I can say is gal take it to the extreme to prove ur point if this is ur only way . 👍🏼", "vs31072014": "T t i", "sunidhi_shukla": "DM", "avi_bittu": "I love the way do @redheadwayfarer", "khaledshakour": "?????", "saharbilqees77": "Woh sab toh theek hain .. duniya ka mann saaf karne se pehle apna room hi saaf kar leti 🤦🏻‍♀️P.s you over exaggerate every topic a lot. It’s like baat ka chewingum banaaake kheencho BC!", "ramanpreet1522": "❤️", "nimishanayak_23": "😍😍😍😘😘💋💋", "kumargti": "Wow nice dear", "rickmxd": "U write too long...", "natasha__choudhary": "@rashmi.dayanand", "gargi_chauhan": "❤️", "shk_tayyab_irshad": "😒", "govind_vyas_": "Puri hi ho jaa", "biryanimonster_23": "Well said💯", "anshuman.0": "fat", "the_raghvan": "Nude ho jao then prove equality", "jumz.cutlery": "Read this @chriseldalemos", "souravjsr": "@arnab_gupta_not_goswami bhai ye dekh.. you go girl..no one should stop u..type ali feminist..🤣🤣", "lazier_than_lazy": "Baki sab toh bas moh maya hai ❤️", "kompalmohindra": "@primitaaaa", "swayema": "Baaki sab to Mooh Maaya h..!!😂", "pratikkedia777_": "Love u", "dr._living_stone": "Aur baaki sab badhiya hai 🤘", "rashikamanwani": "It's like you speak my mind with every post of yours! I wish (and hope) people get their heads around this sooner than later.. Kudos to you girl ❤️🤘", "kick_cool": "Many girls won't take it they only want to look good even their outfit hurts them", "imaxtarius": "Sweet", "vimal.chaudhary.9": "Owner of small post what u trying to prove🤔😱", "10.rohit": "Feminism ki Maa chuddd gayi🤣", "riddhi_makvana_": "Kapde Pehana na sikhle comfort zone plazo me bhi milta h", "rishabhjainies": "Nice colour", "thatsummerbong": "Very well spoken", "wingsonfire28": "Why do I get this feeling that u r trying really reallyyyyyy hard to prove a point!!! Life ur life yaar. Why try so hard.", "barbiedoll_s9": "Ya .. totally true", "sgs_maths_wale": "Of course . I think fashion or trend is meaningless if u don't feel comfortable while following it", "silent.mafia": "See being a bold girl you spoke and told all this to everyone . I respect you alot and your writing skills are great . But the truth is even after so much awareness , people like u try to motivate girls in order to prevent them to be in depression there are still many people who will read and understand all of this and continue to do what they do . They just simple can't accept the fact that \"boys and girls are having equal amount of rights. They just can't have minimum amount of respect, self respect and understanding to give women/girls equal rights as them .💌💌", "_maani____": "@redheadwayfarer I just wanted to ask you , that we alwayz talk about and make sound discussions on men bringing women down. But what if a woman do the same to a woman. Constant bullying and making fun of their appearances. Some women does that, when a women does that, that weakens us more . Girls with skinny body make fun of a curvy one as if they have never seen a fatso , that's weird. What if a woman is little fat. They whisper in each other's ears, \"OMG, she is gonna rip off her clothes , too tight\" \"Look at her thighs\" \"She is gonna blast\" and that word \"Bhainns-buffalo\" which kills the little bit of courage they gather to come out as what they are . I have seen girls facing such probs . What you can suggest some of them to become ignorant to those mean comments. 🌹", "im_rahul_grover": "😍💓❤️#respect!!!", "jlmstagram": "👍🏼", "nageshprashanth": "Cute panties- next time a cametoe?", "sakshi_sarcasm_shukla": "THE LAST FOUR LINES!!!THIS IS SO ESSENTIAL FOR EVERYONE TO UNDERSTAND!❤🙌PREACH WOMAN!❤🌼", "sonalmodha19": "I love you, you are the best", "akankshashettyy": "Woahhh this is soooo good I love the way you write @redheadwayfarer such an inspiration you are! We're blessed to have an amazing lady like you!♥", "subrat.raj9": "👌👌👌👌💐💐", "hosur_gauda": "soooooo sort", "hritu_zee\nVerified": "Verified", "m.b.adil": "If cloth doesn't matter then y fucking H.R. talks about aesthatic appearance", "bertie_soares": "@redheadwayfarer be you 💖", "varunshegal": "Intresting💋💟💟", "boddul_chiru": "👌👌❤️", "peppy._.human": "After reading the whole caption, that \"Baki sab moh maya hai\" 😍❤️", "98.34936932": "Hii", "mishal_aboobacker": "👎", "payalkhanna_": "The best pictre i've seen today💯💙☇💫", "weekendclicks": "👌👏👌👏", "serafina__1202": "👏👏👏👏👏👏👏👏👏👏", "virat_kohli_fans_only": "😭😭❤️❤️❤️", "rishxp": "I guess you should start writing in Hindi @redheadwayfarer most Indians fail to understand what you're saying because of the language you prefer to speak out on, I know it's a bit harder to write it down in Hindi but I guess some motherfuckers who just go out talking shit might understand? I guess.. Idk😅", "myra_5508": "So true we should embrace ourselves.👯 Screw the sterotypes 🙅 🙌@redheadwayfarer", "mohit.verma.3914": "Tight hai 😍", "__kanishkaa1229": "You are the best ♥️♥️🔥❣️", "_shuakhan_": "I was waiting for this #beyou post for long....for you yo write somthing about it.....because of you i get so much self confidence nd self worth.....my anties nd relaties always taunt me on my dressing sense...always gives me faltu ka lecture or wearing dupata when some guest come at home....nd i always wven now don't understand....what is up duppata issue with guests or when i gets out of my house.....i always fight them...bt they never understand....nd isnsted gives lecture on covering my chest....nd that all makes me so much concious about my big boobs...coz as per my anties big boobs attract fast those morons eyes.....that feeling of worthless nd less to other girls growing inside me.....bt when ever i read ur posts....it all goes vanish....nd i feelll confidence in my own way again.....thanks u so muvh @redheadwayfarer 🤗", "the_unarmedgirl": "@dipashi_bhadwal @archana2390 @rahpaarchana", "binita_bh": "You're just ❤️❤️❤️❤️❤️", "pallavnadiadwala": "Fabulous 🔥 @redheadwayfarer", "his_princess5_": "Not just looking beautiful is much important... Sometimes we should dress beautifully wear our traditional dresses than putting up short hot foreign dresses...That's the most damn way...@redheadwayfarer ..what do you think isn't?? You are such a great inspirer n motivator for all the girls..love you as the way you are", "shamelesslyselfsatisfied": "@vishakha_2019", "reba_john\nVerified": "Verified", "sanjeenamal": "Beautiful", "advaita_gk": "I love you captions, your ideas and your thoughts! Things that I think about, you put it down in words so well. I absolutely relate. Love you so much. More power to you 💞", "asmita_145": "Uhh girl ❤️❤️🔥🔥", "nsi.rumesa": "Oh my God!!! That's like words from heaven...I can read till hours and hours. U actually need to have guts to take your own stand regardless of the fear as to how will the people react. I am totally like this and people often give me advice over my clothing and how they want me to be when im with them which maybe for care but then if I'm not happy wearing them then there's no use of it. I'm 17 now and I wish I'll end up like you in my 20s love you loads . You are sexy af. also I just love Rahul tho, just so you know😊😘😘😘", "namrata_0605": "Behenchod camel toe dikh rha hai", "nawab__zadi__": "I loved ur captions ma'am... Its been inspirational for us", "gittabeentjes": "If I'm being honest, I wouldn't like it if my boyfriend would visit my friends in his trackpants either. But then again, trackpants are really not done in most parts of Europe. It's like going outside in your pyjamas. It's just quite weird", "agarwal_ayu4": "Thank you for inspiring us, you're just amazing! Just because of you I have started loving myself, I love the way I am with all the stretch marks and flaws. Just a year ago, I was so conscious about my body like I was literally ashamed of my body and of myself for not being beautiful but after I started reading your posts I started loving myself, you taught me the actual meaning of being beautiful, thankyou so much saloni Di, you inspire me every day. Love you so much❤️", "sticklerdioxide": "🇮🇳", "ajdent": "100% true @redheadwayfarer saloni. I believe in your post. No one has any right to judge someone one what they wear. Comfort is key... A woman can equally feel confident in a pair of tracks shorts or a sari... Her choice.... Her comfort....", "nehay09": "I love u yr @redheadwayfarer .... U always write too gud .... More power n strength to u :)", "arshdeep._.pretty": "I'm so overwhelmed saloni. ALWAYS. @taniqsha_kapoor Thank god we're unlike those garls who're so much into impressing people. Thank god we do what we love to and not what others tell us to do.", "mitalsojitra14": "🙌", "kinjalgupta21": "💕the kind of talk everyone needs", "nainyarora369": "@simrannapal01 yrr this caption 🙋", "the_hairband_gal": "On point babe", "beradebasis": "Truely", "probin._.x.37": "😍😍😍😍😍❣️😘😘🔥", "travelvlogiv": "Such a motivational caption! One aunty just recently tried scolding @janhvikapoor for wearing shorts in the work out video she posted. Got shut down real quick. 🔥", "kudi_sardarnii": "Caption is everything ❤️✌️", "khan_tbrez": "Lovely PC", "priyalbhakta": "Thanks love. Your words stay with me, just like, ‘a part of every book you have ever read stay with you.’", "himank.11": "This one's amazing", "sdasanayake82": "💋💋💋", "blueylagoon": "While i have always maintained that natural is the most elegant way to be ..i have been laughed at mocked at ..saying how do u find stretch marks and a little loose slim Sexy?? But honestly it's these imperfections which define a real body from a fake one ...and I love these imperfections ...way to go lady...u rock!", "crownedecor": "I really really really love you I want to be carefree like you ❤ qki baki sab to moh Maya hai❤😂 @redheadwayfarer ❤❤", "vikrammehta934": "Beautiful👙", "royal_shahi04": "Just wow !!! You’ve always spoke your heart out and dats what I love about you.. You are raw and basic, no polishing, no filtration !! I’ve gone thru similar kind of thing but as dis is public forum I can’t disclose it over here but I can feel ya gal.. more power to you always 🤘❤️🙋🏼‍♀️", "architshah512": "Wuuuhhh..bruuuuhhh..Respect salute #caption Feminism", "rajugowda.r": "Nice", "i_m_h_a_r_sh": "Very nyc color❤️", "_jannatt._": "Vahhh vahhh!!❤❤😍😍", "_pr3ttypriceless_": "The post's on point but what's up with the people asking what does she want and what does she mean? I mean the caption is right there, above your comment section. Stop and read. What are y'all trying to show? That you cannot understand a hundred words stringed together? Or that you cannot do a simple thing as understanding a post on your own? Really 🤷", "alastair_crowley99": "Back pose please? Derriere pose", "onelife.13": "Fab ❤ @redheadwayfarer", "avibratadey": "I ❤ u girl 😘😍🔥🌡❤❤", "_peach.__": "I luv you more everyday 😍😍😍😍😍 ...", "satishgowda_18": "Sexy 💞🔥", "nikhileshpratapsingh786": "Sab moh maya hai phir bhi sab pareshan kyo hai sala samjh me nhi aata 😂😂😂👌👌👌👌", "faiyazing": "I love ur soul so much..I mean I love ur soul and the energy you radiate from the bottom of my heart...we need more people like you in this planet @redheadwayfarer", "choudharyankiita": "@redheadwayfarer I love you saloni chopraa....such an inspiration ❤️💕", "vinaydhera": "Sahi pakdey hai! I agree", "smrn_arora": "💯💯", "moonchild_2212": "Dayum girl ♥️", "vipasha5": "Your captions are 🔥❤️...", "riyamittal19": "♥️", "karmakar1234": "Litt hot🔥", "_anushkas._": "❤", "iamsharmita": "Uh always give me confidence to face daily social battles and girl I'm proud of you @redheadwayfarer", "iamthesoul": "@sruthyk93", "shikhajohar": "🌟", "aditii.gupta": "Perfect.💕", "__dark__soul________": "😘😘😘", "preetikunadi": "I too used to be asked by my then bf and now to-be-ex husband to dress up in shorter clothes or in a particular type of sexy dress so as to impress his frnds and show me off in front of others as if I am some \"thing\" /a trophy that he possesses. I myself knew how to dress up or down according to the occasion but my choices were still controlled. I used to dress my best every single day but he wld still want my nail paint to be perfect always. After marriage, I was forced to go to family gatherings heavily loaded with Jewellery and traditional clothes even when I wanted to wear minimal and still manage to look beautiful! They would use me as a bait to up their social status in the society which they themselves degraded. I used to feel like I am just a thing being used and would be thrown away if I do not carry my life on their terms! My opinions and values were never heard or important to them. They wld just pretend that they are just the perfect family for me but from the inside they were never honest with me. And that is exactly what happened.. after sometime when I realised that I am not bng taken as a daughter-in-law in the true n correct sense but just being used or flaunted with wrong intentions ,I started to question things and laying out my opinions and wants more strongly and as a result they got intimidated and wanted me out of the house after that. I was asked to not take up a job bcz my partner chose to remain unemployed and his male ego wld be hurt if I start earning and going out. My mother in law slid all of these brain-washing through my mind v subtly and sweetly without even letting me guage her wrong intentions behind that! Why cldnt she ask her son to take up something ..a job,some business to earn a living rather than pulling me down! Why cldnt she support me when I used to tell him to do something and make a name, a living and I would promise to be by his side always. Why cldnt she do her mother duties correct rather than doing her mother in law duties wrong. He used to lie to me about his work (when there was nothing actually) and they would be giving him ideas how to keep me fooled and how it was fine if he did not work at all.", "hoax__slayer": "Being an Engineering guy Never seen a Guy telling a girl to dress up 🤣😂 They themselves are so concerned about the dresses, I have seen girls coming in fest during winters in one pieces and short dresses and be shivering for the rest of of the time, One often sees Bollywood actress wearing dresses they are least comfortable in to events and launches just to grab some lime light. And yes if you are suffering from cold and your partner tells you to wear full sleeves Don't because feminism 🤣😂", "sunidhijain007": "@mishra_ahen caption", "_lord_of_wisdom": "😘Wow😘😘🔥🔥🔥", "somewhereinthe_corner": "💓💓💓", "alka____yadav": "❤❤👏✌", "talesbyneo": "Remarkable caption", "prekshaa.11": "How to express the respect I have for you, so you're simply amazing and such an inspiration to all the girls out there. People might not regard you of enough worth but trust me you've drilled places in people's heart and you're my damn favourite. Hats off to you and your courage @redheadwayfarer", "ena_joshi_30": "@karnika_rathore", "_yaminini_": "💯💯💯", "shamsheerbains": "You inspire me every time you post! ❤", "shhrreyyya": "You're amazing! Best wishes to you! You inspire a whole lot of people!❤️ You are an inspiration lady!❤️Lots of love!!!!💕", "manyaaaa___": "Love ❤❤", "kajolsiingh": "Sab moh maya hai ! 🙌🏼🤟🏼", "hemani_shah24": "Caption on point !!! My stretch marks does not make me less beautiful..!! Owe it and rock it girls !!! Never let nobody decide what's good for you and what's not!!", "imeghnamehta": "@mansi_184 @ayu__mehta", "chanakyaseven": "👅❤️🔥", "bhumi1332": "🔥🔥🙌🙌🔥", "charmingly10": "The fact that after being asked to do the same more than once I can now happily say no matter where I am work or home or otherwise I'm comfortable with myself before I decide to please anyone I'm glowing because I wanted to glow and I'm in bed Head because I wanted I don't let anyone lecture me into being anything less than comfortable", "iamsneharajwar": "You are an inspiration for me❤❤", "musskaaaann": "The way you write💝❤", "rajkor_rupali": "You amaze me every damn time 😍❤❤", "rupak_3_": "❤❤❤❤❤❤❤❤❤❤✨✨✨✨✨✨", "thenameiskgr": "👍🏽", "anishb07": "Believe me even i think the same...i love your views...its like someone is reading me about girls...you are an inspiration...i always ask my friends regardless of make or female to follow u up...and look upto you...i followed you cause i have seen you on tv but now i follow you for total different reason...love you..🔥🔥", "saan_ii": "Made my day ✌🏼✌🏼", "bhurju_be_so": "Dude, you're a goddess to all those insecure girls. I'm not a person who always say,\"Go Girls\" in every damn situation, I support both. But you, bring up topics which we relate to totally and we are like, dayumm what you're saying its so true. We gotta wake up. Assholes will be assholes, it's ourselves who we've gotta impress! Thanks for being such a great motivator for all of us! You really make this social media platform worth it!", "preshita_a": "Article 377 - Is India Ready For 'Homo Wapsi' ? .....Read more at Opined : https://www.weopined.com/opinion/article-377-is-india-ready-for-homo-wapsi-5b9fd524c7dd2", "komal.deswal10": "❤❤❤", "shivanigodara": "U r d best 🔥", "muuskaaaan": "The last two lines!!!!💘💘", "sunitaa_thapa": "Pretty 😍😍😍😍😍😍", "tikulli": "Every post of yours makes me love you more. Last line 🤣🤣 too good. 💞 More power to you girl.", "_i_jassmine_": "How elegantly you carry yourself ma'am. I wish I could slay like you more❤️❤️.. all the love to you❤️", "pooja_ammandira_jappu": "@redheadwayfarer simply awsm mam . Ur dng a great job . Ur my inspiration.. lov u mam ♥️", "gunjan.aka": "@fondaliza28", "hazravicky": "😱😱😱", "shweta__0308": "I love you ❤️😘", "_aka_.sakshi_": "You are my true inspiration @redheadwayfarer 💕💠🌸 #firstcomment💕", "sharaf_chaywala": "Find someone that finds you sexy even when you wake up. Baaki sab toh bas moh maya hai. इतना ही लिखना था बाकी हम समझ जाते । समझ तो गए होंगे आप !", "kshitij_wizardiam73": "Comfort always first 👍🏻", "_vanshiii__": "❤️plz come and tell this to my parents 😭", "anji_8178": "Hey mam you are totally incredible bt first thing you do all of this just bcoz your parents supports you BT what we do coz we don't choose our comfort BC oz are parents not allow too do this", "tulip_das_": "💕💕💕💕💕💕💕", "tehreemabbasii": "love it and love you! may we all be like this ( not caring what others want) 👏🌸", "amitaggarwal8": "🙈🙈🙈", "_the_greeneyed_girl": "♥️♥️♥️", "vaishi_vijay": "Woah💥", "drishti_dhameja": "Such a good post 😍", "imjay_06": "💯💯❤️❤️", "anm_kkc_9119": "__SeXY __HoT__ Aafat😚😚😚 Wow......Follow me now...... Full time support and like cmnt milenga💯%", "aka_resh": "Kya chahti ho aap", "baring.soul": "Thank you for giving a voice to your realisations and ending the pretence of women choosing appearance over comfort. ❤️", "belimirfan653": "Oi tere ki sexy @redheadwayfarer", "__.aran___": "💯💯💯💯💯💯💯", "_maniiiisha_": "Loads of love to u💕"}