{"jibrail877": "Hi", "whereismaaz": "Sapaat 😂😂😂😂👌👌👌👌", "yousuf1791": "Sexy ass.", "beinghuzaifa____": "Why dont instagram blocks you from posting this shit... you are posting obscene and nudity material on social media... I request instagram to kindly chuck off your insta account @instagram .. you are really bloody disgusting piece of shit! OH GOD", "iamyogitaahire": "@dr_yog *", "vidushiraturi": "@riaarora1310 ❤️😊", "barbiedoll.1234": "Log kya kahengey i dnt know but i lov ur big round ass.. I wanna kiss on it.. U so sexy 😇🙈", "shinoy_khan_": "😘😘😘😘😘", "nirmalrathore71": "Not sexy", "varshasinghofficial": "@justnotanordinaryboy kyu mtlb kyu 😐", "_sohini_dutta_": "😍", "anya__solanki": "And you also victimise yourself like OMG this happens to me. Have you seen your agenda’s in life, in your head you might think you are liberated but you are just a psycho who needs to go check on the dictionary to understand the real meaning of feminism.", "around_ravikant": "Pond me mitti lagi hai..😂😂", "sanjay_sodi": "Kya Gaand hai😍😋", "suramyagupta": "I think it's great that you have so much confidence in yourself, and I can't wait for when I reach that level of personal growth. I love how you flaunt yourself, because it's visible that you truly love yourself. I just found your account today, and I feel better about myself already. Thank you :)", "aartitalwar_": "I love this feed. Power to you woman!", "munnabach": "Very Hot ❤️🤗", "secret.heart57": "Amazing , beautiful, attractive😍👌", "starlight_tara": "@farzananitol Positive vibes in the sea of negativity!", "chandnirawat10": "Beautiful message ❤", "lipsseduction": "Great point... @jayantisuri see you don't need gym 😉😉😉😉", "chandanagrenier": "Totally agree💯 even victoria secret angels have stretch marks though! Check it out", "kyatujhe": "Yeah well said ! Don't let Kardashians fool you by the word \"beauty\" but if u were so confident about your natural beauty may I please know behind your lip fillers ??? And also d fake hair colour... D caption is good only. Please stop doing fake things on name of *feminist* post anything you want ... I don't hate you but b4 that also accept yourself truly .... Or else there's no difference b/w u and others . Ty.... Blessings and love ❤", "rakhi056611": "Hota sab k pass hai batata koi nhi h 😂😂 himmat nhi hoti😆", "rogue_093": "Ajeeb chutiye hai duniya me !!!", "hansoloandsoami": "😍", "sonaalit": "It takes a lot of guts to post this! To let people see your imperfections and most importantly being comfortable about it! U r amazing. I guess many girls including me is so inspired by your this post because social media world makes us feel like its just us who have these imperfections but its totally normal. U r amazing.", "bhavesh_.solanki": "Superbbb", "ashwinlovesgym": "🙂", "flying.unicorn01": "Loved this one 😘🙌🙌", "yesacee": "Ohk..can i take a moment to say you really are helping people to feel themselves, let loose, and just be happy and feel that contentment...you only live once.. I really adore you❤️", "rajitraj": "Sexy booty", "devikamarwah": "♥️🙌💯", "dr.siddhigohil": "Aunty 😂", "_ghanchakkar": "इस तरह पोंद दिखा कर पॉइंट प्रूव करना जरूरी नहीं है.. कोई और तरीका भी अपना सकती थी ये 😠", "you_are_am_eye_ell_aye": "U hv accepted urseLf d way u r n dats wot u show d world n u don't try to butify it....being a celebrity....iz a big thing.... Luv it..... #opinionated", "sumeetgokul": "@aminamahfoozz", "sheenu_tomar": "@subha_ki_kiran", "where_them_unicorns_at": "Jasmine Tookes already did a photoshoot with her stretch marks, that too wearing the fantasy bra. Just sayin...", "shreyatigress": "Respect to you. And to all those asses commenting how her stretch marks are ugly shows how ugly your minds are. Nobody is perfect. Keep worshipping those photoshopped photos of men and women and live on with your ugly souls.", "singh.swati": "The picture is still Bumsy and sexy", "wthlllllllllllll": "Damnn sexy 😋", "o__stree": "Wow. That’s a real good post ❤️", "salonichouhan": "We share our names and views! Love this!", "soulful.7": "The only reason I liked this post is how beautiful she has flaunted her flaws and no need of a perfect beach body you can be comfortable and confident the way you’re Love it !", "_______rinaa_______": "Lots of love♥️♥️♥️♥️", "swizzledirection": "I needed to hear this. Thanks a ton💚", "shr_addhaa": "So beautiful, inside out. ❤️", "itsmerajat.ra": "Metoo.ke lie isne sajid pe iljam lgaye the. Koi suno inki... Phr inki andr ki sati savitri bhr aa jati h wese jaise mrzi vulguar post kro.. Usme. Koi dikkat ni h... Disgustinhh", "creamcheesefashion": "Beach vacations are so amazing♥️🥂 have fun - team Creamcheesefashion", "_vivacios_": "Hey girl! You are blessed cause people can either hate you or love you,but they can't ignore you. And that's your power! Great going. Keep it up! Stay blessed! Stay powerful!", "india.emperor": "😂😂😂😂😂😂😂😂", "ranbirrrx": "Sofa ass! Yuck @redheadwayfarer", "nikitaofficial98": "@apoorvaakapoor caption ya", "20swa": "Thats the ugliest ass i have ever seen in my life..", "jgeegeej": "I have been to Mornington last April....Great place..I was at hotsprings.....What a concept?", "rayalaseema_muddu_bidda": "Hahaha", "madhulika_189": "You're literally ❤️", "purabipadhi20": "Sweetheart if u feel having stretch marks is absolutely normal and natural,u r being totally comfortable and confident about it so why u need such an explanation for posting such pictures!!@redheadwayfarer", "shreyapawarrr": "@_tanyakaushik_", "_shetty28": "Tigeress ❤", "reshmathad": "Ok you've got a major cave-in. That's not a string swim suit weirdo. Stretch marks are real and normal...but making a string through regular swim suit is freaking weird.", "ananya_gupta7": "I just really love you girl! 😘🖤", "janushka1803": "😍🔥amazing like seriously amazing🔥😍", "selenehophile": "u need to see this !! @bhagyashri_00", "clavical2012": "But any way you need some serious work out. This also say stories of assault against own health.", "aparnacanon": "Cuiteeee", "badass_brahmin": "@nainanananananana how about building a library on that massive forehead just so you don't end up insulting yourself. Also, *grammar.", "bunnygoyal96": "😍", "baloch_7": "Any one not see @redheadwayfarer pictures / videos so start un-following her.", "raaaagini": "i don't understand what's wrong with a few people here. i mean the people who comment that why she need to post such pictures to talk about body equality and feminism .Guys i think feminism and equality is just about this when we can say , post ,wear and do anything we want to and people should respect that . And if you can't you have the right to unfollow such people- use that facility instead of spreading hatred for such a wonderful girl , on her own picture . She is just amazing and there's nothing wrong if she posts such pictures who make thousands of girls feel good about their respective bodies. i never saw or found this good stuff that made me love myself , instead i always saw shitty makeup videos to hide our originality . she made me believe that this is how we are made and we should be proud on it and at last its only we who put ourselves down. so at last i wanna say she's just magic who inspires so many girls and women out here. and we love you a lott girl ❤❤❤ SHINE ON✨", "zubin_hakim": "😍😘", "warrior_sierra": "There is nothing wrong with this picture! If there is something wrong then its with people's mentality also negative way of thinking!", "tuhi05": "By far, your best caption❤️", "sonali.08": "👏🏻👏🏻", "ahanadutta24": "Stretch marks r absolutely normal... Nothing harm or shameful n dat... But showing ur sandy booty all over internet is sumthng ridiculous... Am not giving my opinion... It's da fucken fact am talking abt... Kids r using instagram...wat ur giving impact on them... Government ne porn band karwa diya 2 yaha butts Dekhaya ja raha hai ....wat kind of feminism is this... God knows... 😅", "felicia.00005": "Some People under comment section eww, digusting, etc. As if they never seen a butt before and bever watch butts in porn. Had to laugh", "aurora.whorealis": "You and @jameelajamilofficial are giving me life right now", "jeremyq47": "😂😂😂", "s_p_jalamkar": "Disgusting", "riyasharma104": "Victoria's secret is that none of the shit you see is real.", "instantbollybeauties": "Agree 😊 Even Most Beautiful Tennis Player Eugenie Bouchard has so much Marks", "jaini_shah_": "❤️ i adore you @redheadwayfarer ... You give so much inspiration by just telling the TRUTH , thanks for standing up for this", "charmingly10": "I always used to think that my leg was weird cause I had stretch marks since I was in school but after I read about them it took a toll on me you would never find me in shorts at any cost until one mum brought me to a store told me try on shorts and when came out hesitant she asked me too look at the mirror and run my fingers through these marks. I never felt so connected to my skin before and the more I felt them the more I thought they are mine and I shouldn't be ashamed or afraid of them", "mehrganguly": "The haters here just wish they had the courage to love themselves the way that @redheadwayfarer loves herself. You are a goddess girl ❤️ Fuck the filthheads.", "sarfarazz92": "Nice anal", "beautifulmess20": "Someone asked me if i got pregnant or had abortion before jus bcz i have stretched marks.. like wtf!! yeh tou shuru se hi hain mjhy..", "apurva.sr": "❤️❤️", "an_apocalypse": "I can surely tell you a thing, for the ones who this was supposed to reach, it did. And it made their day. Stay fearless and strong. A picture is a picture, what one decides to bring out of it is the mentality which none of us here should pay heed to. :))", "theskin.beautyco": "Everyone has stretch marks. Embrace them.... even the boys get them!!!", "shilpa_dwivedi_": "Uh made me feel better every time 💓❤️", "spikerohan": "wahh", "anushkasaxena08": "You make us feel better.... Thank you 💙@redheadwayfarer", "khushalisamani": "🙌🏻🙌🏻", "born_ruler_": "Requires a lot of gutts to speak about such things thats y u r a celebrity ( the one who truly keep their words and open the eyes of world without worrying about real life threats , and all other problms ) huge respect to u miss @redheadwayfarer chopra ji #mkevents", "vanshika._.chawla": "Anyone who's saying nasty shit in the comments, what is so repulsive about this? She's just a woman showing off HER OWN body. What the fuck is wrong with that? You people really need to get the point. She's not using feminism to post \"ugly\" pictures. She's living her goddamn life while you go one obsessing over it, hating it. If you gotta obsess, might as well learn a thing or two. And @redheadwayfarer , you go girl! All the love to you.", "penaazsidhu": "Thank you for sharing 🙌", "trishapujari0406": "Your such a beautiful person in and out. I don't know about what the other people says about this picture,but one I know is that your are doing good and one day or the other day good will definitely come to you. Just do your work. You are my inspiration and you will be. I am always here to support you. ❤️❤️❤️. Dammm I ❤️ U so so much... @redheadwayfarer. I just hope that one day we will definitely meet each other💕💕💕", "badbadbindi": "It's like, because of social media beauty standards, people have totally forgotten how actual human body looks like and so now they leave nasty comments when they see something as real as you. Butthurt little pricks feel threatened by seeing a woman so confident. But hey You're the og.", "reetupaudel": "❤️😘😘", "ramola09": "Loved it @redheadwayfarer and Love You Too 🌹", "shariqalikhan95": "So sexy so cool pic😍❤️", "ankitaraj1119": "Just what I needed to hear. Thank you 😊", "somdattade": "Aptly said🙂", "p_a_b_l_o___e_s_c_o_b_a_r__": "Lit", "rhea5635": "And again ur shit comment it back", "imarpitjain": "Hahahha stop being BLONDE, and start 'Greasing'!!", "thefragranceofartistry": "💝💝💝 woooow", "avengers7777": "Butt💋", "uddipto_chakraborty": "The fact that this post(or other similar ones) garner a section of negative comments like, “Don’t post semi naked ugly pics to prove your point”...and so on, explains the fact that @redheadwayfarer tries to make, if you are okay with only the textual post of stretch marks being okay, then you gotta be okay with the pictorial version of it as well. You can’t say make your point but don’t post pics is the symbolism of double standards that people have. And the pic is very relevant in this post to prove the point that you should be okay with the so called flaws to an extent that you have the courage to be unperturbed while posing with them - From a guy who thinks the pic is pretty cool. Peace out ✌️", "sweetpiepooh": "Vulgar #👎🏻", "wackyarena": "What to concentrate LOL", "newurbannomad": "Nyc", "balvindersinghphotography": "@redheadwayfarer well said ;)", "moxali_": "💞", "wolvereneeye": "No booty", "zaina92": "You know what’s f*cked up? The first thing i thought when i saw this perfectly beautiful picture, was that ‘i bet there will be a bunch of $hitty comments from guys’ And guess what? I was right. Nothing surprising here, we live in a superficial world , incapable of change.", "aaloomutterr": "I loved Your post❤️ #SunshineGrl💥", "sonik_boom": "@shaunchicharito ❤️", "ayankhan5386": "Wow your pink hair in the air so fabulous stunning", "sandesh_vyavahare": "@amit_the_limitless_ that's not possible it will make such a chaos. Just live with peace where you are.", "favelladuda": "Yes, u r absolutely right... 😍", "afaanfuzail": "#meetoo shit", "theunique_sim": "Thanks for saying that❤", "nainanananananana": "I was scrolling my feed in peace and then I saw this. Brb puking", "aloowalabaccha": "Why so much negativity... I don’t know 🤷🏼‍♀️.... anyways u rock girl 😀....", "zunairah_arif": "What r u wearing", "vishal_bharadwaj22": "I am not saying you are fat, that is pretty obvious, but when you talk about equality why not ask your boyfriend to stand next to you and pose the same. Perhaps he might have a few stretch marks he would love to flaunt next to you and maybe a better looking arse.", "rashi_laddha": "You are awesome @redheadwayfarer", "ird.khan111gmail.co": "Rakhi sawant ...ki sister . Buffalo redheadwayfarer", "parsatee._.99": "This post is gonna get some real ugly comments now. Don't get me wrong... I love you @redheadwayfarer", "vishal_vn_": "that girl calming metoo..", "rayzphotography88": "Well said", "voguechurn": "Bodyshamers incoming, they keep missing the point.", "mr.shekhawat_09": "#iloveit", "neelima_11": "Damn ... Keep rocking girl💓", "abhisheksharma.19": "👏", "_the_.golden._snitch_": "Let me think.. Wat u said. .. Ohh ha.. Shit is back... Literally ya. Tune comment kar ke. Sabit.. Kar diya. Yaar who is shit.. Yaar. First bandh dekh..jo khud ko shit Boll raha hai.. Kya intro diya yaar khud ka..", "vandanapareek0": "Respect you mam...and m a fan🙌", "priya__2481": "❤️", "suhaibmiraj": "@redheadwayfarer I have always found the #stretchmarks of a woman the most beautiful accessory she could adorn. Be proud #stretchmarksarebeautiful", "silkysukanya": "Thanks for motivating us everyday. You're just an absolute inspiration ❤ we love you. Hope you'll reply.", "imrankhan8740": "So beautiful gorgeous woman", "debaleenak": "You're eloquent in every way darling, more more power and sturdy strength to you❤️❤️❤️🔥", "ridhamkailashmehra": "Thank you for the post.😍🤩💕", "soniavni": "U go girl !!!!! 😘😘", "mayankpratapsingh50": "Fuddu photo", "jaan.vii": "My Love 💘", "raffatkhan95_": "😁😁😁", "its_poulami": "Everytime she posts a picture of this kind,shitty comments just start flooding in. Mano ya na mano aisa post karne mein himmat aur jigar chahiye. Why do you guys even care,dont like to see her? Unfollow her. Dont spread negativity atleast.", "anki_on_insta": "Damn u give me high adrenaline rush😍", "ankitta12": "W O R D", "cold__goddess": "@unlucky_ash @ashi_sudan guys💕", "madhavi1809": "Also dry oily n bit wrinkled face etc etc is normal then y to spend money on beauty products keep it natural...so its everyone's opinion where they want to spend their money", "nowall12345": "Clean your ass", "yanshacomics": "@tvastra_ you should follow her account. You'll stop worrying about weight and cellulites. I'm so in love with this woman.", "mememama24": "Yuck", "_neha_bob_": "🤘🤘🤘🤘🤘", "t.05_": "Thanks for reminding me , that it's jus as normal as anything!!", "naamhaisanjeev": "You're an inspiration and a true beauty! ❤️", "gopymakha": "hallo", "ap808368": "Nice Asssssssss 😋😋😋😋😉😉😉😉😘😘😘", "ankitamukherji": "This post spreads so much positivity in me. This is the real deal. ❤️💯", "blushpout": "Embrace your beauty ❣️ @redheadwayfarer I love your posts coz it's so empowering 😊👐", "wordinarygirl": "Usually I am the silent admirer. I have always rooted for those \"influencers\" who use their platform of social media and followers for something substantial, something they actually believe in and something that people are too chicken to discuss. That is one of the reasons I have followed @redheadwayfarer. She is among three of celebrities of follow, the other two being Emma Watson and Michelle Obama. But today, the silent observer decided to stop admiring from far because sometimes, no matter how much you tell yourself that \"it's okay\" \"You can't help criticism\" \"People can't help being assholes\" \"Take pity on those who scoff\", negative comments crosses this limit of endurance... I fear, oh how I fear... That voices of support, voices of positivity and voices of relatability might just get overshadowed by the douchebags. Hence, here is a shout out to all those who are humanly human, stretch marks or not, silent observer or not!", "fankara_here": "I was thinking about that 😂😕", "saloonnii": "yeas it is. Its a thing so obvious and a thing not to be shamefull about at all. We are girls and ;oh you all pimps out there ( mans with low mentality ) its been with me , we girls; we are judged for each and every fu**ing thing be it be, pimples, acnes, strtch marks, roaming around with 3/4 guyfriends or just doing nothing ( if nothing women are restless ) and what if guys are caught with 3-4 girls? they are been framed out as studs, gawd! we cant ever get over people’s mentality. we gurl, we not just go through some series of comparisons but also a millions of breakdowns + restrictions. even i have gone through mental breakdowns? Y? coz mma a girl and people have got bundles of things to comment and degrade me about. My breakdowns are mentally. and talking about restrictions? we have got many, hella many. know why? Coz there exists boys and fucking rapists.", "tanjidaaaa": "@_samiha_97", "sameer_mayekar21": "Love tht phat ass🔥🔥😍", "gen_sarah": "💯% Awesome 💯%inspiration! ♥️", "patriciajogina_": "❤", "keeys.app": "Hi there :) put your hashtags to your keyboard! No more copying back and forth of your notes.", "anmol.vij.794": "Bad ass beautiful 🔥", "anurita.pal": "❤", "harshul.09": "U r a great inspiration..fearless, frank and bold pls be yourself and dont ever worry of shit comments posted here..support @redheadwayfarer", "loveyuhbody": "😍🔥", "abd1_13_7": "Woooo...booottyyy...🔥🔥🔥", "sum_wat.z": "Somee shitty truth !!!!!!!! ... Keep telling it !!!!!! 👏👏😍😁", "priyanshipatel_359": "Inspiration you are✌", "mind.learner": "Thank you. More power to you. Let’s do more of this, and break all the set beauty standards, be more accepting of our own bodies and less judgemental of others’ too. You go girl!! 👌🏻", "labdhivakhariya": "beautifully said❤", "princy_anuradha": "Salute your thoughts mam love uu also", "suranjanaaadey": "Thanks for your words.", "suns_silhouette": "Such a cute picture💞", "kashee__": "😍😍", "anjaaaliii_": "Stretch marks are.strength marks!😚😚🔥🔥 @redheadwayfarer", "thecozy99": "❤️😘", "siddharthsshah": "Heyyy @senghanishreya girls gotta glo upppp🌌", "formix89": "(っ◔◡◔)っ ♥ 𝓣𝓸𝓹", "ketanshah555": "Lovely gorgeous beautiful", "nadeem_hayat_khokhar": "This is to much 👆", "boy_has_no_face": "You are pure love baby❤️❤️", "__.l.u.n.a.t.i.c.__": "Haters gonna hate!! U rock @redheadwayfarer !! Am trying my best to support u and change the meaning of beautiful😀", "ved_ang_i": "❤️🙌", "mahekaics": "Bless uh gurl💕😻.. the way you are spreading immense thoughts that are related to feminism is lit🔥🔥", "prarthana.garg": "@shruti.pokhriyall also love this post, makes me feel so better about myself, genuinely", "rita_kanyal": "🙌🙌", "abhishek.thakur830": "🔥🔥", "sahilyadav123123": "Me too", "shataakshiii": "@anikatopno Own it!", "afy.mahi": "👏👏👏👏👏👏👏👏👏", "the_big_eyed_doe": "Yasss queen", "winxbelle": "Amazing!!😊", "asmia18": "Yeah you are right...but is it necessary to show it in pic..every lady out there can understand your positivity but those kind of pics🙄....but v all have to try to maintain chastity..", "beingpahadan": "Made me feel so better ♥♥", "sgadmirer007": "Beautiful", "ramanromi_": "Sexy", "abhishek_bitolia": "Just the way you are #keependuring 🤗👌🏻", "mr.manojdas": "🖕🖕🖕🖕😀😀😀😀", "ishitasingh.1": "Thank you for your incredible work. #womenempowerment", "simixoxo": "Much needed reminder!!! Thanks ❤️😘", "i.dream_of_unicorns_": "In love with u girl", "annushasuresh": "👏👏👏👏👏", "itsmartinzeng": "Wow Nice!", "mayankcraze": "wow looking so pretty and so beautiful in this pic😂😂 i cant say you are looking so bad in this pic as some blind people will come and starts to give me lesson over positiveness and other things dumb people these things are known to everyone scars are normal what so inspirational in this but yeah the pic is so damn bad😑", "_thatglamqueen_": "Hey Saloni..Thank God even in the era of spotless perfect beauty ads people like you exist...thanks for making it easier ❤ you go girl 🔥", "roza_sinha": "❤️❤️❤️❤️thank you❤️❤️❤️❤️❤️", "shanaya.sharma.581187": "dayyyummmmm saloni!!!!", "sohehe_": "@redheadwayfarer you are really an inspiration. Keep shining. 🌹❤🔥", "sakkumyself": "You are love 💕", "namanpreetkataria": "You go girl 🌼❤️🌸", "yusra_rafique139": "❤️", "manik4nt": "I'm unfollowing this mindless Mental Girl", "rashikashish": "You’re perfect 😍😍", "myselfmohit69": "✳️", "poetry_weavers1": "I just love your confidence . The way you carry yourself . You are the best. 😍😍😍... Keep it up ... Stay blessed .. 😍😍😍", "perks.of.being.tisha": "U go girl!!!😍😍😘💫🖤🖤🖤💕", "rajput_poooooojaaaa": "😍 Be you ❤", "ankitbhardwajcls": "😂😂😂😂", "vikrammehta934": "Beautiful", "_not_your_regular_mahila": "Slayed 😍", "lisaee_leingp_": "❤️❤️❤️", "sharook1412": "Lucky sand", "nimishanayak_23": "💙💙💙💙💙💙💙💙💙💙", "syed_mehdi_raza_": "No ifffs only butts..😂😂", "b.n.bodar1286": "Nice ass", "smithaearl": "I just love your spirit ❤️ @redheadwayfarer", "milind741": "Lovely bums💗", "riyaa_mayekar": "😍❤️", "avishasogani": "i wish everyone had the balls like you to put up the *real me picture* ✨ You are an Example.", "thenancygarg": "♥️♥️♥️", "riatyagi1498": "@revatyagi642 😏😏😏😏🍑🍑🍑🍑", "imprettymess": "Words 🔥🔥🔥🔥🔥👐👐👏👏👏", "_the__troublemaker___": "What to say to them, when they tell that you have too many marks on your arms why don't you wear full sleeves?", "patatawilde": "THE RAD QUEEN 👸👸👸👸👸👸👸💖💖💖💖💖💖💖😍😍😍😍😘😘😘🤩🤩🤩🤩🤩🤩🤩", "mayan.0k": "Always inspiration for girls.and boys feel jealous.😂😂", "iamhoneybhambra": "Exactly💕", "shafi_insta": "Perfect ass!", "taanni_23": "❤️❤️", "natasha__choudhary": "@tanvi_theroyalcommoner some reality check right here for you", "yashpreeeet1313": "The way you flaunt yourself is just another level....😍😍💖💖", "kavita_beniwal": "Thank you!", "vama.k_": "Even boys have stretch marks n that is normal!!❤️...i donno y people are ashames of stretch marks..duh🙄!", "rishab____singhh": "Oh fuck 😂 if you got stretch marks go and work on them if you love them keep it with you. ..stop posting your semi-naked ugly pics here..with a tag of feminism and gender quality you overrated piece of shit", "_thesoulfulvibe_": "U r such a motivation for girls", "tints__shades": "You go girl..!!! XOXO", "nitika.__": "U look so cute and sexy 😘😘😍", "twiin.kle": "ily!!", "arpita_agnihotri": "You are simply amazing 😍", "freespirited13": "@thinkwwhdalways ❤️", "dilshad_ali_7777": "ugly", "sushantgond": "😍🍑", "_lord_of_wisdom": "😂😂😂😂", "thetrickypanda": "🔥", "aliya_imtiaz": "How can someone be sooooo positive and inspiring 😍👏🏻🙌", "sans_kittykat": "🙌🏻 Word!", "kkaytlin.x_": "Shes rank", "zer06__": "#stretchmarks awesome and attractive 😍😍💖 well said @redheadwayfarer ...i totally agree wit u", "suzinoona20": "😂", "aniketacharjee": "That ass needs to be kissed!! 😚😚", "paranoid.pandya": "Namaste great great pic. You are inspiration to ladies that they don't need a sizzling body to be sexy. Sexy is an attitude", "_invincible__me__": "@tanyasinha2028 @geekygirl_001 @anshika_seth_ @aditi_shruti reasons why I love this human!", "beck_dunk": "omg ye 👆 Kya he", "anushaaberi": "I love you❤️... You are amazing!", "saxena.anushree": "My curvy queen💓", "_col.traveller": "You are phenomenal. Hatsoff lady 😉", "muuskanagrawaal": "Love you alot girl😻", "sahay1609": "Boss ❤️", "maxijb75": "Gorgeous 👀👀👀🔥🔥🔥", "dressforyourselfofficial": "You are such a sweetheart❤", "rosh93": "Yaaaaaasss! Come back soon already 😍", "iamtttfgbb": "Hottyyyyy🔥🔥🔥🔥🔥🔥🔥", "irishabsinghh": "Shit is back finally🖕", "nasee_khan_": "Ewwwww looking nasty , and if you can get ride of stretch marks then it’s cherry on the top bcz they are not beautiful at all", "rehanpatni01": "😘😘😘😘", "___thatsunshinegirl___": "Slaying boss lady ♥♥♥", "gaya.mas": "❤️😍🙏", "17_clementinee": "@redheadwayfarer you are a inspiration ♥♥", "christiinethomas": "I love you so much. I cannot emphasise this more. @redheadwayfarer", "wendyvwanniang": "You Hit the nail on the head AGAIN ! ❤️❤️❤️❤️"}