{"aayu.d": "@_appreciator_ what happened? Why did you delete your own comments? SCARED?", "4ever_mystique": "Hattsofftoyou👏", "sudeshnasaha_": "Good you write the best!!! 😍😍😍@redheadwayfarer", "mandargole": "this is not fashion madam, stop playing with genuine emotions", "greysandivory": "Power, power, power.", "minalmittal": "Salute to you :-)", "sanguine_soul_": "@princy", "kavyazap": "@muski.i caption.", "annu30595": "Grt, I totally agree with you nd suffering from same situation..", "yashilov3": "This caption is a perfect mouth shutting slap on those poor orthodox chaps...... @redheadwayfarer You have become my feminist idol❤❤", "radha_tulsian": "Stole❤️ more power to you girl🔥", "shraddha_233": "Oh my gosh. *Goosebumps* 💖", "tshrsarkar93": "I m with u i m with all the girls who survive i agree with ur words , nice , keep it up", "ruhani_ahmed": "So I couldn't read your post because of other obligations like job life and work commitments. But the moment I saw this post I was like I have to, there's must be a story that you are going to share. So I saved the post to read later. Today, sitting in a hotel ordering biryani I went through this post and I couldn't feel more connected to. I am so happy, glad, elated to know you @redheadwayfarer to be able to read your post, to understand them, to relate to it, to connect is my best habitual plan of life. THANK YOU!", "smiles_and_shine": "Trust me sick of such cases, and why still isn't a stricter law for marital rape? It simply enhances the male chauvinist mentality that after marriage women is his \"property\" and he can do with whatever he wants to! 😣 Its high time that instead of being a global economy we should be a safer economy first! 😣", "s.avishti3_the_monster_boy_": "Sprb yaar I'll be salute you...👍👍👍😘😘😘😘😘 N promise I'm with u...", "swaatttii": "@_juju_mishra", "r_e_s_h_u__": "Well said saloni 👍👍👍 true shitt abt our society that need to be stop ..l", "_miss.bose_1802": "👍👍👏👏👏👏well said", "sharif_saba": "Truly inspiring... Every girl has the right to live bt she is nt safe.... The world in nt safe for us...", "zafar_zafi": "Well said true", "ayushiisinghal": "@redheadwayfarer ♥️", "navneet_tango": "One thing my mind dont want to accept dat,sumwhr u r tlking about d evil part of men n feminism n smwhr ur pics n ur attitude don't goes wid ur lines! Tell m just 1 thing is it bad or a crime to think n believ dat,its a world of men n dats practically,i dnt underztnd mjhy ldkion ka hadd se jda liberal hona kyo nai psand??? I thnk sbhi men aisa hi sochty hai ...", "garimamittan02": "@munira_163 *SLUT* Dont you have some shame ? AND ITS HER CHOICE. She is not asking you to be naked or someone else. AND ATTENTION JISE CHAHIE VO DIKH RHA H YOU ARE THE ONE. GROW UP AND GET A LIFE.", "rituajwani": "@shhhhhhhhhhhhhhhhhh_ 😐😐 now I understand why the thinking of world is not changing! And firstly don't call @redheadwayfarer a bitch.. If someone is trying to make world a better place so what's the problem.. Anyway if you don't like her posts or her.. So unfollow her and don't comment..😐", "anjallii_99": "@shreyamoondhra", "anjalyyyyy": "She looks so much like katrina godddd", "_pyanka_": "👏👏👏", "muskan15oct": "Ur look like kat....nd your line of post is awesome...👏👏👏👏👏👏🖒", "ig_vibranium": "👏👏👏👏", "_abhilash_followme": "India k log kabhi nahi sudrenge.. Izzat se bhande hue dirty ppls..", "momitabos": "Heads off for you", "muskannmalik": "Thats so true ❤", "avni_yogesh": "So true..... Yur every story is too gud.... I m always waiting yur new stories....👌👍", "anant_chaudhary10": "So true", "shhhhhhhhhhhhhhhhh_": "Pardon me , Got*", "shravni11": "@shhhhhhhhhhhhhhhhhh_ what a loser.", "_cliterallyme_": "Thappad tha unn sbh logon ke muh pe jo aisa sochte h aur bolte h.... just amazingly expressed thoughts... not only the people who would comment vulgur on that pic of yours but there would be some other people as well who would praise ur thoughts nd writings bt when the situation comes on thm they would be saying the same words to the victim... trying to supress her mentally nd emotionally not thnking of all that she has gone through.... they are no less than those vulgar commentars.... these people just want to show their so called open mentality on the social media... bt when the time comes to really show that fuckin open mind they back off... nd that is the time wjen u actually see the real mentality of the person. Out of all people on social media who would be appraising this post of urs how many would agree to marry a raped girl....? P.s.- me raped girl ke shadi hone pe que nhi krr rhi hu.... bt just making a point on the fact that all those people that show their open mind on social media aren't necessarily open minded.", "priyu_thehuman": "Well said... 👍👍", "sardarsingh1": "Emotional", "perry_arora": "@medha.sharma.1257 ma'am let me explain that how this post will bring a change on ground reality . First off all let me now tell you that she already inspired me alot and many more . There is a lot of power in words . The purpose of all is doing good for our society .some are doing in ngo's ,some are helping people door to door , some are writing and some are praying for those people who are in difficult situations . so , we should not make such comparisons . just be positive ma'am , pulling someone down is not a good thing I think so , it will not help you to making you so great . And she knows very well how to use social media that's why she is writing and inspiring people including me. And the best part is, IT IS FREE. Just do good in your life ma'am you never who is inspiring. And one question to you - what was the logic behind air conditioner in Australia or whatever you asked ? :)", "kisuppatel": "Well said saloni true shitt abt our society that need to be stop ..l", "tanugogar1": "Can u plz dm me ur caption", "i_usman_tahir": "Cruel society... Ek larka to rape krne k baad naha k paak ho jata hai! But what about a girl?? Us bechari ka kya kasoor tha? Ye kasoor tha k she have a pair or boob and she got a vigina? Shame on you bastards who play with a girl's life and with her body just for your fucking lust!! Or aisy hi harami larko ko virgin larki sy shadi krny ki khwahish hota hai.. #respect girls", "atika_jhawar": "this is simply amazing..! your thoughts |MINDBLOWING| @redheadwayfarer", "mickeyojha": "@saifuu____________ Bro.. I respect your comment 😊 .. but Jo bnde ache h unhe ye show krne ki jarurt nui h ki they are good.. aur wese bhi ese kisi social site p caption daal dene s ye prove nui hota ki all men are same or not same..😅... just help girls when they are in trouble , protect them automatically girls will realize all men are not same😊... and vaise bhi vo achaai hi Kya Jo dikha kr k ki jaye...😅", "alecwind": "isn't it fashion for models and actors to raising voice for female to get attention. if you really care come to villages and see how they are suffering, you just mentions cases which are reported but the situation is worse, and the problem is Rape and each and every type of molestation is not even considered as biggest crime. but you have to agree that many have used these allegations for vengeance or whatever. using these allegation against innocent ones is as same as rape. and those commits rape are most weaken persons.. mf", "harsh_godara": "Well said ...Bravo...Hats off..No words to describe my recation after reading your lines ... @redheadwayfarer", "gunjan._.07": "proud of u mam ...and I completely adore u ...u are the one whom I look forward! !@redheadwayfarer", "_elle_reve.s": "Well said @redheadwayfarer 👌🏻👍🏻", "riya.junejaa": "YAH U R RIGHT THE MAIN THING HERE IS TO RESPECT GIRLS AND WOMEN @redheadwayfarer", "harshee_": "Wow. You're the besttt", "shreyyaa11": "https://www.instagram.com/p/BSwK9xbjyfK/", "medhu.vadaaa": "Do some real ground work man .Stop posting pics .People who use the social media are from the elite class .They are already aware of the situation of Nirbhaya and others .Such posts would not stop the monster inside them. You can fight against them but helping and uplifting real rape victims .I am dead sure you have the resources and the intention to help them . Then r", "anarchic_ataraxy25s": "U do a great work 😊 it's been ages to carry on all this shits and now it's high time to raise for oneself.. We need more people like u.. I am unlike u 😊 ...i read every post of urs @redheadwayfarer", "weche_etrr": "There's so much anger in your caption one can clearly see @redheadwayfarer and obviously, why not. As a girl or firstly i would rather say as a human being, i want to give you a small advice. If you like it then please pay some attention on it. \"like we all can see you work and your efforts towards female's rights and towards changing the minds of such narrow minders, you are really doing a great job and so many people appreciates you too. To mera ye matt hai ki aap apne is kaam ko thoda or बढ़वा agar दें taaki ye apki baaten instagram or facebook se bhi aage nikal kar or bhi jagah paunche to और bhi लोगो ko ye baten shayad samjh ayen. han mujhe pta hai ki is desh ki soch shayad hi kabhi badlegi par aap कोशिश karke dekhiye, shayad kuch badlaav aaye. 😇☺", "mehak_satija": "Loved it 💯", "justin_live99": "@keerthikaprabhala", "lamha_1912": "Hats off 👏 @redheadwayfarer", "dokht_e_kabul": "Hats off to you 😊😊👏👏👏👏", "msaparwani": "THIS 👌🏼 thank you.", "yuktaa.812": "💯👌", "diaryofamessyhuman": "Salute to u @redheadwayfarer", "i___saif___i": "@redheadwayfarer sorry to say mam bt ur point of view is not ryt in this way .... Many Men r having a destroying attitude towards girls or women bt this doesn't mean that all the man r bad ... I strongly stand wid u for the view rape but can plzzzz add the captions like not all men r like this n for those who r making the men shame should be punishes by women", "vikashmishraaa": "What difference it will make? Don't do politics just inspire people not to do this things", "niyachheda": "@kanupriya_b", "equara.khan": "@altamashakhtar7 read the caption", "palakmehraa": "@medha.sharma.1257 here I support you as I am not against what @redheadwayfarer posted, its really startlet to see that her outraged feminism burst after the crime takes place, you have a point. That she Rant's about the problem beside giving solution but we can't help, we live in a era were people appreciate popularity over originality, so some people are like \"wow she's doing so much good and warm\" but is it stopping those rapist's, No. Some people called you negative and stubborn for just giving out your opinion as Sonali did the same, but there's no point of correcting them because people are full of negativity they won't read your opinion to understand what you are trying to say, but they'll just read to reply you!", "charmi.___": "Respect", "thats.what.c.said_": "@parallax_on_earth", "shilpa_dwivedi_": "Respect💓💓", "vs8478": "We have forgotten what it is to be Human, instead we are busy with cast & relegion.", "ridhima__bharti": "👍👍👍respect woman", "_f.a.i.z.a.n._": "Bst caption & in the 9th pic too @redheadwayfarer", "shrutieness": "Respect 🙏🙏 @redheadwayfarer", "darshana.menon": "We need more people like you.💞", "_rheasachdeva": "@abhiraj_hinge", "abhiraj_hinge": "@_rheasachdeva PM kar", "sanjana_chhaira": "So true✌", "__rutviii__": "Hats off to ur thinking 😎👌", "sumbulfarooqui": "👏👏👏👍", "khushi31_12": "👏👏👏👌👌", "uh.neat": "@redheadwayfarer hats off to u👏👏 thank u for writing this...god bless", "heraakkhan": "@_lira._.dsouza_ read the caption♥", "shrutisingh24": "👌👌well said girl", "amitthakurr": "I appreciate your thoughts...but would love to see this thoughts and vision in each human on earth....where humans are humans....not been behaving worse than animals.....I am happy to see...and know...that at least you are doing your bit....I believe many girls... would have been doing same on their respective levels.....and I will make sure...to educate more people...as much I can....love you..", "adithya_kmr": "it only disappoints me that the people who need to read these posts the most are the ones who don't read it (i mean the older generations who are running with these ridiculous notions in their head)", "himvnshi": "Why are you so amazing", "ritu2564": "Well said...mai Jitna bolu utna kam h.....I'm ur amazing... #respectwomen #respectuhh", "kioskhook": "I have a question to our Government..... We say....We our proud to be Indian.....but..Are We Women....really safe in our country..... NO.....We are not.....ashamed!!!..... :(", "kimmikickass": "Damn *respect* 😌", "ketki__pawar": "don't talk about the country girls are not even safe in their own house", "one1_lesslonelygirl": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏", "sahirsingh": "@minz98", "eshay.y": "@redheadwayfarer one of the best caption on ig.☺", "swat_nahar": "Again and again n again😞", "purnima_dewat": "👏 Hats offf di... Uh... Didn't wrote nytng... Wrong.. Ofcourse... We oll agreed wid dat.. Cz, dere z.. Jst... Shitz typ of... peoples.. Who did dose.. Tingz... Nd, unfrtntly, but yeah... We R... styng... in dat typ of society who... Haves... 👆 Sch a mentality like uh said!!", "beingaraman": "No doubts you are pretty.....but you caption always inspire me....society sucks😒", "kylie75632": "My cousin sister victim i stand for her bt no one stand for us", "kajol_s_": "i srsly luv you for writing dis ♥️💯💯💯💯💯 @redheadwayfarer didi *an #inspiration for A 16 year old like me for sureee♥️♥️😍 * waiting for more😌", "shivinaith": "Iska mtlb tu aur Mai bhi fame k liye comment Kar rahy Hai @abh1y6nk", "kratika__gupta": "@shiwanginaithani - Kaun kehta h ladkiyan ceo nahi hain ...in jaise assholes..they dont even knows whts goin around in d world....a woman is the chairman of SBI ..and tons of other powerful designation which I cant mention all over here ...seriously such people are a shame to d society..", "khush7777": "😢😔🙏🏻 stand with ur thought. Mam.", "nishirao22": "🙆 respect", "_.amrin.__": "@redheadwayfarer you are a true inspiration for the youth of our country we need more girls like you who stay strong and raise their voices!!🙌 #truelyinspired", "abh1y6nk": "@shiwanginaithani how is this serving the cause ?🤔 living in Australia, her ground work probably zero. Good way to earn fame that's it.", "naijaaaaaaaa": "😭❤", "faizanbhatt_": "Saloni ...i salute u 😘❤", "mini_13xd": "This is pathetic....We Indians don't even give rapes death we first think think think n then take step", "muskanmangtani": "Bitter Truth of our society...", "aroskarsrushti": "Respect", "mehak8206": "@redheadwayfarer ma'am plz check ur dm once it's not a fan msg I've sent plz check it once", "sud.sam01": "What kinda society are we even living in??!!@redheadwayfarer", "_kartika_03": "@jyotika001 Caption", "the.rahul.agrawal": "We are equally responsible for this.", "wijayyya": "So sweet ❤❤💙💙", "pranilsutaria": "@pjkprincess wowww thats trulyy sad 😣😣", "27trupti": "Shameful Peoples 😑 @redheadwayfarer Hats off to u 🙌", "salonichopraofficial\nVerified": "Verified", "valiant_bitch": "U seriously made my cry 😿", "bearded___lad": "Zindagi mein aaj tak kuch aesa nhi pada......aasoonon se bhar di aankhe...", "tariqali244": "Disgusting animals", "neha_nonaberry": "😭😭😭😭😭😭😭😭😭😭😭", "omkarsingh777": "@redheadwayfarer I’m a man who doesn’t believe feminists are unfair or crazy. In fact, I believe the only sensible way to understand these issues is through a feminist critique....she is right in approach..if she can make small diffrence her job is done...", "ashok_gurjar3": "I m with u mam👍...ese giree hue logo ko to jaan s maar dena chaiye..", "saanyakalra": "@redheadwayfarer 👏", "pratyush__srivastava": "💓", "khushi.channa": "if this was for fame . she should have post this on facebook also . stop blaming start realizing . if you are so calm on this & ignoring this then babes this shows your character and how much you reapect women .I think those who are so calm on this they dont even respect their mom also", "asap_rahul": "@redheadwayfarer ....I have my deepest regards for all the losses and suffering to all the traumatized and torned apart victims.......you posted a beyond great holding of emotions....but why you are putting a label of feminism over that .....ain't no need of putting #feminist at end of all those losses that victims had gone through....just because you are feminist don't think like that we are appreciating all these things ...we as a people are ashamed of such doings.....let me ask you a question, all those victims that suffered or are now currently suffering have you ever done a single thing for them ....", "i_em_antrax": "Appreciative one.. 👍", "dharmanshu_singh": "The best post i have read, Your words touched my hearts and Being a brother of 2 yes i fear alot and i jus dont know which society we live in😫😫", "prabhakar_a_calm_warrior": "Inspiring.....keep up the spirit...i dnt knw what to say rape is being so known to us and its happening everyday no one is doing nothing even the so called police....iam pissed of by that.....and one of the main point in the whole caption yes rape victims are also humans pay equal respect to them its not juz abut vagina and breast its more than that but we people need to understand that......btween @redheadwayfarer U really doing a gr8 job god bless u.....👍👍👍👍👍👍✌✌✌✌✌✌👉👌😘", "ordinary_meee": "@arjit_ac", "_akshitagupta_": "Amazing❤", "tavishiaghosh": "Sad truth..", "miss_sayed": "Caption is just amazing ...bitter truth 💔 @___shaneel___", "iam_sachindra7": "@rajjnt Who The Hell R U To Tell me This & this I know !! Don't talk about generation !! 80% people R Illitrate That's the problem !\" Bloody thinking !!", "rajjnt": "@iam_sachindra420 so what,how the constitution proved wrong??Blame the politicians not the constitution", "samadritapathak": "@archisha_potter This requires international support.. and I'm all about this post. Any support needed, any help.. I would always help (if that is in my hand, cause like, I don't have any cash n stuff.. I'm still studying).", "devangbohra": "👏🏻❤️", "sakshiisharmaaa": "India needs people like you. #RESPECT.❤️", "aaaaallliiinnnaaa": "You go gurl😍 #RESPECTANDSALUTE❤👑", "cheeku_z123": "That's why girl never fulfil her dreams ..", "manyasinhachoti": "Salute u", "1910xx": "It's so sad....😭😭", "_.tanishhhaaa.__": "I was also forced by my uncles son.. He is mentally ill but then do it forced me when I was 9 yrs old but I was saved I was not aware what he was doing but I understood it was wrong and I fought n saved myself I was just a kid.. I didn't said this to my parents Bcz I was scared.. 🙁🙁if I wouldn't knew that bad touch I would be raped that day whenever I think of that day I get goosebumps and I'm still scared of that boy but not now.. I'll say this today to my mumm.. Ty for inspiring @redheadwayfarer", "adityasinghbishnoi": "very well written", "anjalithebanjali": "@viddeee", "aastha.shandiya": "Agree people need to change their thoughts... what a person own think is more important than anything these ... touched my hrt .", "rocks.salman": "@syeda_farhana7 so true", "darshan.ki.fangirl": "I LOVE YOU SALONI👸😘...U R A REAL QUEEN....U R SUCH A INSPIRATION..👏👑", "ohheymanjii": "@somedecentusername you remember i had done this...", "pallavisharma___": "YES! I DO @ohheymanjii", "i.am.prerna": "So true.", "iamprasidh": "Skin her down to the bones and you'll know that beauty is not by shape or face. You're so Beautiful they way you think❤️", "iamsonamrajput_": "✌👏👏👏👏", "__anjy__": "@gaddpawarnidhee Caption...", "kiinshi": "@saloni_patni_ @kanishka_7871", "gaddpawarnidhee": "@redheadwayfarer wow... incredible..awsum and best of all...hatss of to ur caption...totally motivating and inspiring...huge respect to u girl....✌✌✌😘", "sayalis.pandey": "Ma'am uh are loved 💕 #respect 💛", "jaee_mankame": "🙌🏻🙌🏻", "vivek_thakkur": "Agree with Your all words..🙌🏻🙌🏻 we should surly change our thoughts.. What soicity thinks never matters but what you think yourself is that matter .. #Raise_your_voice_against_cheap_thoughts 🙌🏻", "neon_girl_vai": "It's just awesome 🙌hats off to our words..m touched..it's too movitivating for every girl🙌", "sophiaslair": "Damn", "scribblebyanchal": "Sad but truth people need better education not more 😊", "ruchi.r__": "You are a great inspiration.. 😇. A Huge. Salute to your words @redheadwayfarer keep it up............ Really proud to have a soul like you.... This is the greatest thing i have read so far...........🤗", "radha__rp": "Caption ❤❤❤", "tariquezaidi": "@kritidoneria why so judgemental read the full comment..", "kritidoneria": "@tariquezaidi no.women not knowing self defense isint an excuse for rape!! Grow up!", "_sirishekar_": "@iamsazu ask her sorry.", "ankkitaaa": "You're amazing 😇 huge respect to you girl ❤ and this caption! ❤", "lakshitareddy": "I bow to this post to all women who stand up for their rights and freedom Respect to you Brave Lady !", "lakshitarao.21": "Hats off 2 ur caption...totally motivating..!!", "sumi.ro70": "@_ruchi_singh_ ✌✌", "_.geetzzz": "Such an inspiration you're @redheadwayfarer . Know what everyday we ignore, hands on hands sitting in public. Everyday rapes happen rather their desperation and hunger for sexual things come alive. We write long captions, I know the pain behind this when expressed in my poetry or ur inspiring captions. But still this agenda is left shattered. We need to make sure that this is not an embarrassing topic to talk about,should be a free flow of debate for everyone. India you need to change your thoughts and bloody thinking (buri nazar walo) 😀", "priyal_vora1": "Aptly said !", "insha_nahid": "@harjas_14 @kritika_satija", "alizabaidya": "@syd_zaid", "niki_.mehta13": "@muffo_ambush 🙊👌👌👌👌👌", "desai_pudi_": "@jaanvi_shah15 @_janhvii_ caption 💕🙊", "garima_bartaula": "Huge salute to your words👏👏keep inspiring🙌@redheadwayfarer", "roshnii.rg": "👏👏👏👍", "jasminedmello57": "🙏keep inspiring 😇✌", "komalsinha___": "And those who still think this post is rediculous has already raped by their mentality! Never ever stop doing this, We need more people like you @redheadwayfarer and who've supported here. 👏👏👍", "ektachdry": "😢😢😢", "vizzagg": "👏👏👏👏👏", "ashima_s7": "Awsm👏👏👏", "yukta__99": "👏👏👏 when I raised voice and posted a story about virginity people felt offended . Even one of my friend said he hates me because there's no use in posting such stuff it's all known to everybody 😐 well people know but are they doing something about it 🤔 . He further said what are you gonna do by posting feminist posts . To start a revolution ?? Yes I wanna do exactly what you do 😘 @redheadwayfarer . You are an inspiration 👏👏", "mastikhor0": "read. @vikrampannu11", "nibin_thomas_mukalel": "👍👍👏", "sheetalchauhan1409": "Keep it up really proud to have a human having a pure heart thoughts n soul. Keep it up.", "__soumyasharma__": "Well said👏👏👏👏", "suraj.mehraa": "Rape is like a usual thing happening daily in our country...our society instead of giving strength support to the victim to overcome from ......they blame and accused her.......that's very disappointments. very powerful inspiring lines @redheadwayfarer need more girls like u", "amanattoor98": "@redheadwayfarer Kudos to you girl! You have spoken words that are much more important and powerful than any other issue. 👍👍", "romeojakir.official": "nice pic 😊😊😊", "dola130517": "😞", "monal_jj": "🙌", "faiz_akram43": "All men r rapists shame on them", "arifkhanesm": "U ar saying something.. which is known but unspoken... but truth...and need guts to say that.. i think u ar doing a grt job in ur own way... and that.. makes u very special... as a person.. it REVOLUTION", "deepanshu_ghosh20": "👏👏👏👏👏👏", "natashaaajwani": "WOW!!!!🙌👏🙏 All HAIL DOWN to this Inspiration🙌🙌🙌 Girl you just hit so hard in the mind of millions agaiinnnnn with this one! And that line \"jab tak hum jese 'log' roz kuch bolenge nahi, toh baaki log kuch na kuch toh zarur kehenge hi\" I am drooling over this one👏 You have always given the strength to mannnyyyy to speak up & take a stand for themselves. Rape! Indian society now a days act so normally about it like it has become a part of daily stories like seriously??!!! Why always a 4 year old child & a 85 year old lady is not safe??!! Why all the fingers are raised on girls?? Why when a girl is a victim still she have to prove herself right.. In all this society feel maybe she was also involved.. The so called 'log' have losted their mind or what but instead of giving her the strength to come out of that thing, you just blame her for whatever happened. Its high time to speak up for this with society & throw water on their faces to wake them up! Thank you sooooo much for always talking about something which is important & is neglected. Thank you for always taking stand. Thank you for always becoming the voice of all those victims who didn't speak up. Thank you for everything. More power to you girl.🙏👏🙌 Your words can bring a change I truly believe.", "ishitasinghchouhan": "I am glad you used victim here not survivors.", "1nancy_chauhan1": "Women never stop slaying and the world need more women like you who are so beautifully bold and who face the reality instead of hiding behind a facade created by our own nation. A nation where women are very much \"respected\" and prayed. A nation where a women can not come out to the open to tell what she has been through because what would \"people\" think. Where telling your story is more fearful then the harassment itself.", "its_neha_09": "Hats off 👏🙏 take a bow", "deepshika_yadav": "👏👏👏👍", "__riyaa_17": "👌👍👍", "lifettroves": "@shhhhhhhhhhhhhhhhhh_ hey dude u know what fuck u n your mcp thoughts. She already has fame and followers and need none like u. So shut your mouth and unfollow her if you can't keep up with her thoughts. @redheadwayfarer I am glad there is someone voicing their opinion on rape. We indians really need to talk more openly", "imsrk20": "@sushmita_singhal this is so True what u said.", "himii_95": "@muskanverma16 😐", "_rahil_mehta": "Well said 👏👏", "tysonpicture": "I have no words.", "vidhey_sejpal": "Caption💯🙌🏻👏🏻", "amit_k_88": "Well said..", "muskanverma16": "I'm reading this for 19th time since morning @himii_95", "hariyani_garima06": "In lv wid u", "nee._.haa": "This is I don't know the greatest thing I have read so far ❤️", "babycronebones": "Womenfolx will survive to see the end of Patriarchy 🙏🏼🙏🏽🙏🏾🙏🏿", "mua_khushysharma": "@hannaharya agreed 100%", "nehalsinghh": "Caption💯", "anushka_24_": "@laksh1202", "dhwanishrotriya": "@hannaharya_01 well said. Word", "amanubhi7": "👏👏👏👏👌👌👌", "foodwithfats": "@banaena_", "omgkaronik": "@hannaharya_01 ✔✔", "_ria29": "👌👌👌👌", "t.h.e.y.o.u.k.n.o.w.w.h.o": "everyone agrees..everyone says well said..i believe action speaks louder than words! only if all those who commented \"agreed or well said\" could take one step against rapists in the society..atleast educate others that being silent is also a crime!", "the.unsolved.mystery": "Why do we still face this in our country? Its enough we really need to stop this shitt ...if anybody tells u girls that ur supposed to dress a particular way or act a particular way take no shitt ... ur body ur mind act youu!❤️ we youu we love youu . You're loved 👣 And to all the guys i just wanna say be a proud feminist ❤️ make a difference, if u font want it for your sista ur daughter ur mom or ur friends then why would u take it for others?? 🙄 like i really dont understand .. being in the 21st century we face this and the \"men\" wanna talk about patriarchy! If i being a \"men\" can talk about feminism and change then trust me so can you!❤️ lets make this place a better world for you and me and the entire human race!💕 #proudfeminist #change", "anukriti_._": "@islamic_girl_anam well guess who should be the new law maker because your solution would probably be to make girls all around the world wear curtains in the absence of hijabs. Just to be safe, you know. Because rape is definitely all because of how much skin we're showing. Trust people like you to stand against crime.", "_subodhsharma_": "*slow_claps* well said miss", "vaishnavidesai04": "@khushiiiiiiii_18 true af!.....😞", "deepalisb": "@irene_francoo & @anu.thomas16", "hannaharya_01": "@islamic_girl_anam so are you trying to imply here that none of the women who wear hijab have been raped?! As far as I've heard they have! And a woman's clothes does NOT give the right for any man to touch her, it's her body and she'll do what she wants to with it! agreed it's your opinion but what you've just said is utter crap. So if you say \"men will be men\" then I don't think a woman should change herself either just because a horny man can't keep his shit together! you should be ashamed to call yourself a woman.", "vermasapna893": "@islamic_girl_anam u know what darling the way you think about girls and the way you expose your words totally defines you and you don't need an explaination or suggestion about it from anyone because being in 21st century and having this kind of mentality clearly say us to dump in trash and throw you away to aliens atleast they gonna understand you better......!!!!", "moon_stars_007": "But in the end..what should we do?..we can do everything guys. Teach our society to respect girls. Different kinds of victims are depends on our culture.why acid is easily available in the market . There is law about selling acid but who follow?..it's our problem..our society problem..because people are emotional #society is....Change chahiye. Change chaiye Na ...vo society se hi aayega. So first off all change our society.Pink movie said about society. Don't follow some fucking rules. Change your thinking. Fir sab bdlega #change ur thoughts🙏 ..humanity is the step about the change...@redheadwayfarer bdw well said 👏👏 your writing is touching the heart ..#jay hind", "laganishah": "@zeel_patel__ @captchive", "rutvija_trivedi": "@shahnawaz.s_ @laganishah caption", "ivin_beast75": "Caption is on point 🙏", "bunnyslifefrommummyseyes": "@redheadwayfarer and just this made me ur FAN proud..", "bondkumarsm": "🙌👏👏", "sawant_shramika": "Soo true men!!", "___aman_seth___": "What a post @redheadwayfarer 🙌🏻😭😭😭😭😭😭😭😭💕💕", "the_white_gt": "@redheadwayfarer Ma'am you at bringing a change 🙌😍 #respect", "muskaan__singh": "❤❤❤❤", "nikhathaneef": "Sad truth. Hats off to this very well written👏🏻", "iam_tusharpal": "I appreciate your effort that you are educating people but why don't you do something on real grounds rather than posting it on social media. If you talk so much than it would be more better if you do it on real grounds and help those victims. Just think about it. Posting up on social media doesn't gonna resolve this problem. It will just increase your comments no. @redheadwayfarer ✌️🤞", "muskanvadera": "I WISH SOCIETY WAS EVEN .3% LIKE YOU. IT WOULD'VE BEEN A BETTER PLACE :)", "iham_pawstruck": "Last para.... u nailed it girl", "_prettyparantha_": "This is something i want more of women to read than the men.... Perfect expression of every young feminist thought @redheadwayfarer ❤❤❤", "hj_cool_": "Wow! What an eye opener..", "fawadt": "I think its because of poverty. Lack of Education and Respecting elders of so called fucked up society even when they are wrong.", "abhilashmottan": "And like this each male alive or even dead has been categorized under one roof...thank u so much for tht🙏 #feminism stands for equality nd sorry to say the words used here don't reflect tht... Before ppl start judging me.... I m a grt women empowerment supporter...but does tht mean for tht i will have to treat each male as a rapist?!... Chauvinist?!.... Sexiest?! #foodforthought", "harpreet_k_official": "This is a shameful thing for our society #beboldforachange @redheadwayfarer", "rishagidwani17": "Damm right uh r.... I love it when someone stand for womens rights n for all problms which are faced by many girls... Thank u @redheadwayfarer for this... It may help to many rape victim n physical violence girls n their families to stand for their rights n favour.... U r too good... I love uh.. ❤", "manisumaan": "Very sad that to hear that Human beings are behaving like Animals", "atharva_pr": "That's true ,,girls were never secure in our country try,, me must take initiative", "kunali2701_j": "We stay in a place where a raped girl is ashamed to come out in the people.. ND the person who is actually a criminal lives without being ashamed.. More power to u @redheadwayfarer", "vaishjha": "@shhhhhhhhhhhhhhhhhh_ seems like you are doing the same..!", "lawii_8": "@redheadwayfarer you write so beautifully. It's damn true in this society. It's our generation which has to make the difference", "reem_kakkodan": "@redheadwayfarer u mentioned it soo correctly...i loved itt...😚", "ananya__09": "@redheadwayfarer I love it. The way you put across your point. The best thing is to keep talking about it and make people more aware of the sufferings. Above all to humanise.", "roshnikanojia": "Unfortunately we can only debate on such topics practically what can be done???it's not easy", "oyegupta": "Very bad", "thedishabasu": "@munira_163 wow. You agree with her that rapes gonna happen whether you wear salwar kameez or you wear bikini. But you also say that we wear \"short\" dresses, sleeveless tops, to gain attention from men? Dude, once just walk out with \"full\" clothes on. If some creepy \"man\" doesn't, for once, eye you in and out, and I'd shut up. Do you wear a burkha to stave off men? No you don't. I hope you don't. So why would we wear bikinis to attract men? It's for our happiness, to feel pretty, to go bold, to live our life like we're the boss. To, for once, not feel scared of what the bloody society may think and say. To change that bloody society's thinking.", "jr_donald1": "should hang for that public display", "fax_a.d": "I am your fan now.... Hats off .. you are thinking same..as I.. love you.. and hate those who dont respect womens and maternity", "maheepali": "I really adore ur writings❣️bt hw we can take dis to another level cuz by posting n commenting things won't get sorted !!!", "_asifkmusik": "☝🌎", "sanfiya_writes": "I completely agree with each and every word written here.i really hope our india focuses more on cleaning the mind of our society rather than cleaning the roadways", "yoyosrsingh": "Rapists must be shooted in their head...", "amit29891": "I sometimes feel to create an parrallel team to individually take care of every bastard who raped or was involve in rape. If anyone interested @redheadwayfarer including, lets take a step", "rahul.kumar": "@pranjaliraj why did you tag me in your comment .. I don't even know you .. neither did i comment on this post ..", "rishu_bhosale": "Amazing write-up 👏👏", "anup_something_new": "agree boss", "aleen_ahtsham": "I really agree with u!", "behudalog": "@munira_163 when woman doesn't support woman that's so weird..I'm shocked .. that she desrvs an ocean and you are not afford to give her a lil candle ..she is right but sad.. the future is woman .. but the people like you don't desrv to be a girl or don't desrv to be human ..I hope you will change your thoughts..! Bhgwan sadbudhhi ape🙏🏻 @redheadwayfarer keep going my dear ..😘😘😘❤️❤️❤️u desrv an ocean..love .. Nd respect..!", "vishuabhisek": "👍👍👍👍👌👌👌👌👌", "kavya_jain676": "Right", "inhumanly_humane_misanthrope": "😍👌👍", "__like_i_m_": "Dude koi nhi smjta ye sb bs pdke 5 sec sochege & den wapas se vesa k vesa 🙁🙁😑😑😑😑😤😤", "ritwikalways": "Don't give comments take action", "himani_rawat": "@ashurai25 @priyankasalak @vivek_barwal", "anushreedhingra": "@tanvi221199", "pjkprincess": "@pranilsutaria Caption😢", "yuktapandey125": "👏👏👏👏 @redheadwayfarer you are awesome! I could feel every word of urs.... I hope this post brings a change in atleast 1% ppl's mentality...", "spunky_sru": "Truth spoke .", "tianna1801": "I stand with u @redheadwayfarer", "i_priyankanetha": "Kudos to yu for doing such brave thing", "thatsarcasticsoul": "glad you spoke this up ❤", "onelastcigarette_": "Heads off", "kitty.saxena": "Your words made me speechless. You're truely an inspiration❤", "thechiceffect": "U nailed it😎❤️", "being__adk": "I do agree👌", "im_herman_1": "Speechless 😶", "mandeep31187": "Really agree with u.....keep putting up posts of women empowerment....so people should wake up and realise that without women they are nothing....she's the one who gave them birth", "sakkir_hussain_": "There are many ways to see the same issue. You can smear some lipstick, put on a duppata and some glycerine in your eye, copy paste the same old rant about rape..or you can do what a brave lady did to a renowned sadhu, i.e. castrating him and get away with it. Stop playing a victim man you have an audience, try empower them don't play the blame game you are making others weak by pointing out how men are so bad like the wolf, and you are helpless like a pig. When you have a voice, you can keep crying or you can raise it to inspire people, and I don't see much inspiring going on..just the glycerine induced cying. Jai hind.", "stash_of_kash": "❤", "yatri.hippy_itey": "I was reading it in your voice in my head and absolutely this is the thing which we all get upset onto. Thanks for raising their voice. 🙋 I'm with you. 💙", "she_obstacle_maker": "Agree @redheadwayfarer 😊👏👏👏", "soumyarastogi": "Made me speechless.", "pranjaliraj": "Shame on u boys mr ceres commenting up there nd @rahul.kumar. whtevr this isnt fr publicity mister nd evn fr a sec we assume it is fr likes nd publicity , baat toh usne shi boli hai baat smjhini chahiye...aise posts pe maine app log jaise ek do elements zaroor dekhe hai jo shuru ho jate aisi bakwas leke pr mudda kisi ke liye matter ni krta ...u were saying ki usne koi solution nhi diya..toh bhai kuch kam khud krlo...this post was jst to arise sensitivity among people so that they feel bad and do smthng abt it...", "ms_gariii": "👏👏 Agreed well said", "vanshika0910": "True❤👌👌", "shraddha_2299": "I stand wit u", "rovinglioness": "@vinaypal2609 how the hell does it makes her @redheadwayfarer image bad??", "vinaypal2609": "But I'm sorry this only makes ur image bad and also causes so many lives when it will happen to your near and dear ones u will get to know the real meaning of rape and what the women suffer for that matter girls as welll", "p_ih_u_": "You are stimulative @redheadwayfarer", "medhahaldar": "Preach.", "d.p.sh.kh": "I cried.", "sarada_debnath": "People in India give so much importance to sex and all kind of physical relationships. These foolish people think they only came to this earth to have sex.they don't find anything else more interesting without it. And when we women don't allow them to have mutual sex,they think about rape.and they do.. they kill our dreams,desires everything... interesting thing is,after a girl start living a life of a rape victim,how her close people change their behaviour towards her,even her parents pull her down more... strange people, strange country....just hoping for a change in days of coming... @redheadwayfarer proud of you... always by your side... love you..... ❤", "the_short_hair_girl": "@uroniya_sorai_ what @redheadwayfarer did was voice her opinion about this world. And what you did is try to stop her from doing that which is not really a surprise because it's been happening with girls around here all the time. What she does, what she did is her choice. Stop labeling everything anyone does. With her voice if she gives at least one woman the strength to stand up for herself then it's worth it. Thank you.", "smitapandey_official": "@redheadwayfarer u are osm...m with uh..", "_nidhi__28": "Agree 👏👍", "sowmyanikkam": "Brave and strong sentences 👌🙌", "dhritis_world_": "di bhot shi chiz bole ho m with u 😍😍😍😍", "daminisingh26": "and if they do wrong with a girl then they are not a family member or i ll not call them family , first they shud learn what is right & wrong , if a family member did this shit with a female member we shud not ignore this , we shud come forward nd raise our voice against them .", "sweet_as_caramel___": "Whatever you said that's true.. Always women girl is been neglected in the society.. All the places whether is public or private place.. Whether there are rich people or not all the types of people live in the same society koi apna opinion Nani change krta hai.. Unke liye toh girl is nothing.. No self dignity..if kisi ek ne awaz uthai na.. Then there gonna be a stand.. Not by saying is by proving yourself.. Girls are Strong.. Powerful.. ..if with one girl more girls are participated to join a campaign then.. It be a great thing..", "brown_and_fluffy_like_abrownie": "@munira_163 Allah created two different human bodies, for the purpose of humanity, reproduction , (with consent) (a natural biological process)and lot more, for greater good. And humans sexualized it. Allah didn't sexualize the bodies! We, humans did, in Allah's name. Don't blame Allah in vain! And how easily do you slut shame!", "roooooopal": "Nailed it girl ❤", "__vairaagi__": "Sir, don't you think its not about Feminism, its about #Huminity. you mentioned a girl raped by her family and the mother says, Apne HI TO HAI. Look if a mother is saying that, we don't have a feminism issue, its our Huminity that's been deprived of.", "foodie.shawanrai": ",", "duhita2008": "@redheadwayfarer - i just love wat u write....we need more people like you who can write wat is true and who can stand for themself and girls arnd thm.", "_bhawana_gobari_": "@redheadwayfarer ur an inspiration for the girls n i also luv wht uh write....", "abhijeet_mahat0": "I agree with you ! Di ... In most of the cases, family members are only involved in rapes ... But, still todays society teach their daughters to stay quiet .... and that too, because they are family members ... and our society don't think about the pain she is going through ... they worry about how will she get married ... But, girls you are the only ones who could free yourselves from all this ... If one of you raise your voices automatically more girls will be inspired and join your fight ... unity is strength ... proud of you ! Di .... #keepinspiringus #loveyoudi 😊😘😘 @redheadwayfarer", "vaishnavi._.singhal": "@redheadwayfarer 👏👏", "savi_1310": "$alute yr Fab💗💗💗💗", "_avila_tersa_": "So true ❤ @saima__siddiqui", "_rana___vikas": "Correct...we should abolish from the society👌👌👌", "garima_kalyan": "@sumanbalhara see her posts", "shivamupadhyay137": "@redheadwayfarer U nailed it but the thing is one can't change the whole society here people will comment many things fr a girls freedom, their rights . But when it comes in real life they bow their head down to the rapists nd passs by ,that time none will protest cause the main moto followed by our society is \"HAME KYA\" JISKA HAI WO SMJHE . People do candle marches fr the girl who was raped but its of no use itz nt of anymeaning till u know, understand, realise , that u will have to take a step to stop the incident before happening. There r many things but whats the use of telling all cause it will nt enter in head of people.", "mizz_kakkar": "@enakshi_banerjee22 seriously why the hell there's difference between stud nd slut.....agr bnda 4 ldkiya ghumaye to usko sab bolte h kya dude h yr.....but agr bndi apne frnds k sath b ghume to log bina soche smjhe usko slut kyu bol dete h...", "munira_163": "I ain't really here to answer for the bullshit thrown on me. But that was a comment from me to @redheadwayfarer 's post so better you monkeys stay away from this! And also I ain't trying to drop feminism! But then if you all are actually interested to poke your nose into this then reply to this question that why did @redheadwayfarer scribble her nipple when it was seen on her 9 or 10 post? Did she feel ashamed showing that \"now\" !? Really? People who actually have brains and sensible thoughts may understand this! And also gaali dena hame Bhi aata hai, lekin fir un mavali aadmiyo aur hamme koi farak hi Na rehta:) so better now glue your mouth because it's a question or a comment from me to @redheadwayfarer and to her followers!", "bindiia": "@rahul.kumar.50309277 yes he will get likes but what about you :) not a single like boy... I feel like giving you a reply but you are not worth it ... go have a life .. forgive him kids .. he is sick 😷", "priyax3_": "Your writings are so splendid and magnificient that i cant wait to read it.. n tryst me this is your best post 😍 @redheadwayfarer .. some people wont understand its not their fault it shows how they are raised and how insensitive they have grown up.. Your each words defines the black face of the orthodox or fake society whch is contradictory for its own rules and logics. Some people have problem with your writings too here but question is why their existence is here ? They are niether invited nor tagged. I read few coments of some people felt pity fr them.. You know what people like you are needed for this society.. I am happy that you manifest it in such a good way and show some of them the mirror.. you are truely inspirational ❤❤❤❤❤ lots of love ☺", "kapoorrenuka": "Such a post, I wish and wonder Mr. pm should see and read it and try to implement some changes coz in most cases the raped girl ia so terrified she doesnt speak anything, not coz she is afraid but due to the reason what will others think what will her mother think would any1 accept her , no, girls in india are molested everywhere and the cases which are from family and relatives do not come in notice coz 'log kya khaenge' wtf our conutry's tagline say Incredible India surely we are incredible at raping females and not taking any action against the males, I guess this is the reason people do not want a girl child as to how they would aave her coz there are so many monsters to ruin her life nobody understands the mental torture that lady or girl is going with , kudos to the peraon who wrote this post @manav0069 just expressing my feelings", "kahaani_waala": "There are hardly people out there... Who doesn't care about \"log kya kahenge\" ......... @redheadwayfarer your captions gives goosebumps and make people think about it...!!! There are many workshops and talks taken place..... Still we are in a process to remove the tag line \"log kya kahenge\"", "inandini__27": "U be the inspiration for young generation. Hats off mam.. U left me spechlesss 👏👏👏👏👏", "chinmaya.arora": "To the point", "myah_creationz": "I also hate this bloody stupid moron society...blaming a girl for everything wrong happens to her hope someone read and realise their mentality where we're going... @redheadwayfarer", "naved_s_nightingale": "I love you@redheadwayfarer", "vimal.chaudhary.9": "Disgusting 😡😡😡😡", "sakshi_dhami": "👌👌best of all!! 💕💕💕", "pushkar.tya6i": "Thearting @redheadwayfarer", "harshshharma": "@_theladyof_disaster____ really sad and disgusting 😑", "saima__siddiqui": "@_avila_tersa_ read the caption", "ranaut__": "👏👏👏👏👏", "beedeesaha": "India realises but still not recognizes cause men are men.. Larko se galti ho jati hain and the price of this galti is paid by over 95percent of girl child by getting abused.. One in every three.. Or actually every girl each and every girl in India I presume has been abused ,molested once.. Cause Larko se galti ho jati hai.. What you men don't realize is that if we girls come down to do our share of so called galti then no democracy would be fortunate enough to make decisions on our part.. Till that day comes at least don't be ignorant of this fact.. Extend your hand of help and empathy!", "_amn2810_": "Ppl just say,she is a bad girl", "hey_there_delilah_22": "I have a big question which never has been answered. Why are girls who flirt with other men are called slut? When a girl gets laid with someone she is called a slut. Why is the word slut is soo stereotyped by many people? When such boys can be called stud and its cool to be called that. Why isnt slut cool for people? Why is there so much of difference between slut and stud? Why is it always slut shaming and never stud shaming? I know this was much diviated from the topic which was being discussed here but i saw some of the stories you had uploaded and i though i might ask this here. @redheadwayfarer people needs to be much aware about these two words. Slut and stud.", "dishabuckal": "🙌 🙌", "the_fair_brown_girl": "It's really shameful that even in the 21st century we need feminists and it's even more shameful that there are people who are against feminism. Like girls are carrying pepper sprays in their bags, isn't that just enough??", "gouravaprolia": "upset", "shubhhhhhh_": "@_theladyof_disaster____ absolutely... But no one really cares about the girl who is raped.. They just bloody open their mouth counter viewing the girl.. Except for supporting her.. 😢", "mehvishmeraj": "This is so disgusting", "jonah_ali": "@redheadwayfarer ..,It's painful to know how the daughters of our country suffers .,such a shame on mute society and political government..,and proud to have a bold women like you to bring awareness ..,We with you to support .,share and spread word amongst our friends family and environment..", "sdm_king_jaani": "#ooooo___god_😱", "ranjankumar_1": "Hi i think you are very bold and honest person to take a voice against wrong and what happen. I respect you about that you are the kind of people who think if some one raise a voice some should listen.", "j.y.o.t.e.e": "🙌🏻u r inspiration ♥️", "do_peg_aur": "I adore you for this one! ❤️", "vishu_ms_arora": "We're with you @redheadwayfarer 😠", "keshri_pednekar": "@nagardhaval_official", "jeeva_ponnuz": "Society stands fr avoiding the raped one....thts wat the attitude of society should change first!!", "niveditha060": "This s were we live.. bloody shame to say..dis. I literaly feel sick and tired of dis stupid society.. There r sme bunch of bldy illiterate people who blame girls fr rape... Actlly... Uus logon ko maar dalna chahiyea...And @redheadwayfarer we r wit U.. Go ahead... Wit such eye opng.. Storiessss.... GoGirlpowr..", "_s_i_v_a_n_i_": "bold!!!", "__.pixiedust": "Hatts off diii ap jo bol leti h etnaa boldlyy wo or koi nhii bol sakta bolna chod even soch bhii nhi sakta..!!! keep going dii.. !! u r my idial 😇😇 lovvvee youu loooooooooooooooooooooooooot diii mmmmmmuhhhaa ❤️❤️❤️❤️❤️❤️❤️❤️❤️😘😘", "nairanjana__": "@nehaaa_srinivas @the.rochelle.roch @yashika_gupta @the_taurean_1705 @vaish_desai0402 read this. I just don't love her for no reason. She's an inspiration. @redheadwayfarer you're an inspiration", "_the_leo_girl_": "This seriously hit me hard 🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏", "me_hu_meelan": "🙏Meri sab logo se request he ki Aesa hone se sab ko roke🙏sab ko bachaye or Ache logo ki Help kare😡Duniya me kisi kaa bhi rape nahi hona chahiye kyoki ye sab log galat he or Aese logo ko jine kaa koy hack nahi he😖", "miss_feminist_1108": "Fuck all of those people wid this mentality......... Log kya kahenge iss far more important than our own daughters, sister,gf,mothers shame on our society nd the people wid such thinking nd @redheadwayfarer a big thnkuuuuu too uh girl for writing these blogs at least some mentalities will definitely change ..........", "kapildashanan": "@redheadwayfarer This post of yours raised a valid qurstion and like you i am also fed up of the society in which parents ask not to complain the incidence of eve teasing,molestation as the patriachy nature of our society will turn the tables and blame that back to the girls and to manage a escape blame that on her clothes and eating habits", "_abbbsss_2708": "@khushiiiiiiii_18 OMG", "__suranjana__": "If only the society understood. I salute you for being so brave. :')", "arre_chisha": "@samadritapathak @meghna_bakshi @aryanverma750 ..You need to see this.", "imahiparmar": "#close to ❤", "beiiing_insaaane": "We've all grown up hearing from our brothers and male mates that women are always more privileged, women are always given more importance every where they go. I don't know how would I search a privilege when my mom doesn't let me wear anything except kurtas to a family gathering. (Log kya kahenge you know? ) I don't know where do I think about the privilege in the fact that girls are not allowed to stay out late night, I don't know how do I even think of being privileged in a society where anything is shoved down saying, 'hey there, stop you're a girl so behave like on'. Hook ups for girl makes her a slut, hook ups for a guy gets only cooler. Hi, I am Saloni Kundu and I belong to a state who's Chief Minister claims that \"rapes would stop only when women stop interacting more with men and concentrate more on the lady-like behaviour\". The empowerment here is of no goddamn use because the roots are corrupted itself. How can you even imagine the flowers to bloom? I'm glad you took up a step against such a sensitive matters. Thankyou.", "swatingle": "true words...everyone should try to understand instead of questioning...", "chaitanya_bhave": "Wow very well said @redheadwayfarer", "sanguchoudhary": "So bold 💟", "anurradha_mishra": "Very true", "madhuk_jha": "Mujhe vhi insaan is baat k liye daant khilavata h jisne kbhi mere saath do saal tk Vo Sb Kiya Ki aaj isne ek ldke se notebook maangi Bhut characterless h ye Nd my parents say soo. But now everything stopped. Meri Shaadi ho gyi.. I have a very loving husband now. Unhe nhi btati Vo kya sochenge. Ek baar Koshish Ki thi ek kareebi dost ko Bata k he asked tujhe bhi toh Maza aata Hoga. Ssly??? This is not a story stupid this is a disaster which happened with my life... I really want justice... Kyunki Bhut nhi paayi aaj tk. 7th me thi main tb aaj 22 Ki ho gyi hu.... Kuch nhi bhuli.. Aur na hi koi bhulne dega Mujhe...", "aanchal_singhal19": "Amazing🙈 i m in love with this post of urs😍🙈 this is true Af😭😭😭😭 why always a. Girl suffers???😭😭😭", "asliswatz": "@madhuk_jha heart whelming story 😭😓", "thelazymaniac_": "Very well written.. We really need to stand up..for them and for us.. Just one reply of ours can maybe tell them what we are.. Very good!!", "sanjeev_ruchal": "@redheadwayfarer hats off mam👏", "bjohn_99": "This is soo true if we r not goin'to stand up for ourselves thn who will?", "avaniiappalla": "You nailed the caption🙏👏", "nimbupunny": "Even though I don't agree with females having more rights, the fact that you said you'd be okay with it makes me so happy. The world needs more people like you and I love you for who you are.❤ read the caption okay? @ktk_204", "mahajanr28": "They are people with lack of knowledge, poverty, young blood with source of income, living on the streets, no family mostly, and when we write/ condemn any such acts, it still doesnt reaches to the right set of people who still do these terrible acts. So Q is are we doing enough for those sections of society to make it better. Else these will continue and we can only write about it :(", "_stutzzz": "❤️", "saketdharve": "Awww", "_m_o__o_n": "Hats of😘", "himanshi4129": "💟💟💟", "kirtika3004": "Salute u man @redheadwayfarer", "udita_mitra": "👏👏👏👏", "divyaa_kohlii": "The best thought ever❤👌👌", "rizutashah": "@written._thoughts did the read this?", "superayu812": "I wish we could report some people out of this earth.they should make a new world where they can criticise each other and have fun.", "freelilspirit": "@alienstuckonearth", "ink_s_": "Dis kind of post is better than those useless sarcastic posts!! Respect women#thank u fa dis wonderful post#respect u", "ramyasri.m": "👏@redheadwayfarer I get surprised by almost every post of yours and may be that's because of the subject you chose or may be I haven't seen such topic discussing on social media.I admit that I didn't had the right(I won't say bad) attitude towards some major issues like Rape,Harassment and so many other issues you speak about.After reading what you write I can see the change within me which is slow but happening subconsciously.(I think people like you are raising their voices to do the same.You guys want to make it obvious that women and men are equal).I feel that people like me who stay in cities,who are educated should learn a lot to make this change possible.Thank you so much for your intiatives.You said that you like people based on what they write and how they write(sorry if I am wrong) even I like you for the same reason.I like you for what you write and how you write more than your acting(:p).All the best.", "prakashanushka_": "I love ur writing ❤", "thenayabgirl": "@shellybasoo @faerie_life_._._ @myordinaryname_ read the caption.", "alienstuckonearth": "@twinkletoedgemini", "saumyoda": "Can you cite some sources please?", "yash.1010": "@seliencechristian menism? Check your vocabulary! By adding 'bhenchod' where your short of words doesn't make the sentence true or cool.", "aayushi.k_": "@rahul.kumar.50309277 You say that she is doing this for publicity.. Okay even if she is doing this for publicity still there are girls you are getting inspired by her. And as you said you do support the society from your side so tu that's how she is doing from her side. And @redheadwayfarer thank you girl! You are truly an inspiration for all of us.", "_thehumanpotato_": "@rahul.kumar.50309277 to mat de publicity... Kar de unfollow... It wid actually be so relieving... To not see comments of ppl like you who believe in passing on shallow judgements", "aby_richo": "Why your peace!", "vvishal5": "Kya hua", "rashimistry": "People like you encourage people like me who want to take a stand but are scared cause again 'log' kya kahenge. Thank you❤", "brar_gurbakhshish": "@redheadwayfarer thats damn true and this had been happening for many centuries. We should stop saying its a man dominated world and instead stand for our women. Weather they are sisters,mothers,friends or anyone. They are to be protected and all those bloody rapists should be torn apart after found guilty. @redheadwayfarer you daily blogs are really motivating. Thanks for sharing things those are really meant to be shared. Thank you 😊😊😊😊", "greeshma_girish._": "Well said 😇👏👏@redheadwayfarer", "saloniixx.74": "Commendable 🙏👏 I wish myslf to think like this and take srand one day.. You are truly an inpiration. Respect 👏", "freefirefly_10": "I wish all women could be so brave to speak their heart out 😞.. stare,eve teasing ,bad comments r so common in girl's life that we don't even realise that we deserve respect just like other normal human n how to live the life in our own way .it's become the part of our life .I live in hills but hills r not safe for girls too ..I wear fully covered n loose clothes to get rid of those stares but can't stop them 😔.all I wish for is an island for only girls so I can wear cool clothes n live my life freely at least😢", "pritiidd": "@mayankeshranjan how are words given to your thoughts, i need to learn but for the time being, read this.", "shikha.kaushik": "@mohit.sirohi you are right buddy but she is taking a step to change some minds, stereotypes and thinking here. As because so many of us use social media, she us trying to change some mentality.", "aleynamansuri": "Broke my heart by the caption...", "takethejan_pill": "Court", "tanushreebiswas001": "@seliencechristian I feel pity for you. I hope you dont have a sister. Because you're the kind of person who'll blame her for wearing provocative clothes.", "k.the.messed.one": "#salute", "pratibhakaithwar": "Just awsm 👍👍👏👏👏👏", "tanujmudgil": "Pregnancy, Periods, Breast cancer, Being walked on, Rape, Abuse, Harassment, Women go through a lot They are Born stronger than what we think. #indian_shit #Stopthis #bekind #feminism #raiseyourvoice #raiseyourstandard #educate #RespectWomen #LoveWomem", "_crazy._.chaos_": "Awesome 👍👍", "theshanayaphillips99": "Very much aggre with you ....now day boys they just want to sleep have fun and the throw away.....I don't understand stand that y do they do this...... And 1 thing parents should do when they give birth to a boy child ...... as he grows up 10 teache him ....that he should respect women .... They should know that what women r to there life's ... .....", "i.pujan": "Arey kya hua aapko.. 😨", "vedant.s": "@redheadwayfarer keep inspiring... Some times brothers need to stand up as a human when mother's do what they have been taught and been through but change is never easy.", "barkhav9626": "Respect 💯💯", "_m_u_s_s_u": "RESPECT❤👏", "futurecmaaarav": "Awesome . I salute u👍", "aishleeee": "So true❤👌 !!!", "akshaylakdeofficial": "👍", "nikita_singh_": "@redheadwayfarer awesome ma'am ur doing a great job..... Great fan of urs...✌😘😘😘", "vaibhavsing5656": "What happened", "elijahpriice": "Nobody wants to rape you", "hardika_adeshra": "It's worth reading. Though many people don't understand marital rape, or rather they pretend not to. But, that is the biggest crime. It's like..gifting a girl sleepless nights just to prove that she's a girl and she deserves to be under a man. Disgusting!", "rahul.kumar.50309277": "U r a double standard bitch....", "shrankkysonvane": "@ayu_7842", "navroop_deol": "Mai dass rhi c na tenu about that incident, ah dekh k mind vich aaya c, otherwise it is buried somewhere deep in subconscious mind @bajwa_6767", "crazykhyati": "My God.... U r awesum. .. @redheadwayfarer spcly that last line ... How pretty u nail each thing.", "psychologicalterrorist": "READ AND APPLY, DONT JUST READ AND LET IT GO BY LIKE LUNATICS. REQUESTING! @redheadwayfarer WITH YOU IN THIS ! :)", "v.a.r.o.nik_a": "Depressing still meaningful! @redheadwayfarer", "bikram_3": "Hats off dude", "ayeshakhan_141": "I really loved ur caption❤ hearttouching", "dew_tea": "I have yet to meet a woman who'd rather get raped than get murdered. And that is something so immensely mournful. We'd rather be killed than be raped. Taking something so beautiful and turning it into a monstrosity, something she will always relive during future moments of intimacy, making the whole experience hellish; just for the purpose of lust - it's not only vile and disgusting, it is something that all of us carry with ourselves for the rest of our lives (whatever is left of it anyway) in the form of nightmares or repeated revisions.", "g.srishti_10": "@priyasr read.", "silveya_nameera": "😊😊😊😊😊😊😊", "raghavsharma.official": "heart breaking 💔😡😠", "_areeba.fatima_": "Hands up for you always 🙌🏻", "rajrajatsubhro": "Yak, Our society is not that much dirty.", "lamia_nishika": "@bilz_jutt and rapes are not happening with young girls,4yrars old child ,older woman,they are also being raped.do u have any answer why they are being raped?", "vanshikabhatia07": "Thank you so much this is very impotant for me u have conveyed so much theough this", "kavita_r010": "@kalyani_kanpillewar @ruhislens @vasu_2812 this is the dose our \"cultured indian society\" needs.", "snigdhasinghi18": "@mr.ceres SNIGDHA** I haven't done anything to be called as mam", "rinjhinjain": "@aashnaa2 I love her!", "_your.disappointment_": "I support you. We are one. We will and we are standing", "r.i.r.i.c": "🙏🙏🙏🙏🙏 Where they say Indian culture they want to control that person with the name of \"Indian culture\". Coz culture says Respect your elders.", "hiteshikaul": "Mam you somehow somewhere motivate every girl, women out there ❤", "syed_shawana_gilani": "People like uh .... should be here in our society .... love uh Saloni Maa'm.... u r not only an inspiration bt a reality check for those people .. who have sick mentality", "junii_handsome": "❤💚💚💚", "forever_clumsy": "U go girlie...we stand by you make a difference coz we all are standing right beside you...u need not wory..just dont stop what u r doing coz u are an inspiration to every girl✌️️✌️️", "adarshpunjabi": "I am enraged saloni at the atrocities women have to go thru .. no reason can be justified .. the only thing left is that people around have to take the law n da reprecussion towards the grave crime in their on hands n deliver it. Bcoz our Justice system n our so called falsified society r incompetent to rectify any dastardly doing .. barbaric actions require barbaric reprecussions. #nootherwayleft 😬", "quietkid_08": "Respect mam!✌", "kkaranmalhotraa": "Woh", "bae_wafaa": "caption 🙏", "bhumzee_9": "#Beti bachav #n sb se pehle apne hak ke liye bolna n apne vajud ko bachane ke liye khud ko ladna padta he koi kuchh nhi kr sakta # sakti #", "photocrazia": "It's so damn true. Every word gave me goose bumps. It's very important to take a stand and stick by it. Samaj kya kahega but that samaj even has women in it who are supporting the wrong. Being a woman first be understanding of another woman and support each other. Being a woman we have the power to give birth to a child then raise your child right. If it's a girl make her strong enough to stand for herself and if it's a boy raise him with right values that treat woman as equals. Make a difference even if it is small. It will go a long way.", "loveleensidanaa": "@redheadwayfarer Ms chopra apne sahi kaha hain yaha par ladkiyon ko ek cheez ki tarah dekha ja sakta hain jenhe jab chaho kuch bhi keh do aur inke saath kuch bhi kardo ladki ko acid attack dhamki milti hain Aur agar ladkiyon ka dressing sense ko bhi ek mudde ke saman unhe judge kiya jaata hain Jo ladki full covered hokar aati hain woh nice hain aur jo short dressed main woh bad hain jo ladki raat ko ladko ke saath party karti hain usska culture aur repo galat hain Ladkiyon ko unke ghar wali se hi abuse kiya jaata hain.......... But aaj ke baad nHi Agar aaj ke baad koi bhi ladkiyon ko abuse ya galat nazar se dekhe toh ladkiyon ko chup nhi bahthna chaihye Unhe uss baat ka jawab dena chaihye Unhe apni kamjori ko Takat bnana chahiye", "fabpu_ja": "Hats off", "syed_humam_": "Caption❤ 21 toppo ki salami apke caption ko", "rimzhimsrivastava": "Love Herr @neelabjaa", "priyatiru_": "👌👌👌", "pallavicc": "👍👍👍", "5zal_kaseri": "😢", "damn27373": "I feel you girl , What is this society becoming ?", "sim_kukreja": "@redheadwayfarer respect💯salute to u✌u spoke the feelings which other girls cantt just let it out their mouth..ur an inspiration for womens💯m speechless", "vrajeshsoni_": "❤ @redheadwayfarer", "simranaarsay": "I feel you girl..!!!!", "prasanjit_aikat": "We Need to do something about it. .. we can't call ourself's Man if we can't protect girls or respect them... It's not about what they have or what they Wear .. It's about Mentality. .. . Hame Aawaj uthani hogi.. I'm always with u .. I support u girls.. Fight for it!! @redheadwayfarer", "singh.nidhiii": "@pratsk read. 😅", "just_shraddha": "Ms chopra u r stunning gurl u r the one who our youth need u gonna kick everyone's as keep going. Bravo!!! I agree with ❤", "b_ankur_b": "Respect 🙏🏻👌🏻", "vpnnsharma": "@nareshgarlapati1234 Sahi bol Raha hai bete 'how can a man control his feelings when he see a woman being naked'... Bachpan me tune apni maa Ko dhudh peeya hi hoga or uske Baad tere andar tab nahi aaj sexual feelings jagi hongi...baaki to tu bahut samjhdar h People like you are the responsible for everything bad happens with any women. Women live in fear because of people like you, even your sister and mother.", "sadiya_sheikh1783": "Hatss off to u❤@redheadwayfarer less no Of people had got the courage like u to speak up most of our population only agrees with others opinion (han m han milate hai bs)but when its the tym toh stand up for a rape victim they step back i dnt understand how could a girl cnnot feel tht pain how could mother's of those shitt mens can take thr side before doing anything whether rape or anything once you should think tht same situation on urself", "sshakti_": "no words what i say bs itna hi keh skte hai i feel shame on being a human being 🙍🙏", "naresh_garlapati": "sorry for all those who I hurted with my words.i withdrew my words@vaishnavi_2807@garimamittan99@sourav2111999", "rahul.2097": "You're words felt as if I was reading my own thoughts. Thank you for this. And Im with you. I want to bring a change.", "hii.yaa": "Hats off girl hats off||| u jst rocked it. I hope some fucking men will understand wat u tryna do. I really appreciate whatever ur doin ♥♥", "jyotiburagohain__": "Respect ! These are words we fear to acknowledge ! But deep down we all know how everything is running.. I m so proud of u @redheadwayfarer for standing up for every girl !", "_trideo_": "its good that u are rasing voice against rapists it really shud v stopped u mentioned a really good point that people talk about vagina n ol... whatever instd they shud support the victim to overcome these things n make sure that this never happens to anyone again.. actually it the individual responsibility of each and evry person to look inside themselves... n u knw actually i m from a lawyer background both of my parents are lawyer n have come accros many cases in which male are acused to be rapist even though the are innocent how culd a women do such a thing.... n u knw this thing is growing day by day.. in evry crminal case u can find out at least its mentioned once that smone forced her tried to rape jus to make case strong.. @redheadwayfarer i admire you u r a great person keep doin well if one of ur post can do this than n so many of the ppl i can see are reacting n if even those who have seen n commentd would take this seriously .. i think its worth", "aravabhi": "Why do PPL go through ur posts .......nt because of your physical appearance but they have a pervert mindset I think u can understand what m trying to say...........they never take you as a source of inspiration.....u own a space in a society thatz your place , don't let PPL to judge u.....get up ,act before they try to push you back.........salute to your post.......it has an infinite meanings........ sitting like a lame can never bring a change .........", "medhavi17": "@munira_163 Seriously! Is that what you think. Like men dress as they want, why can't we women too N wearing short clothes n all isn't an invitation to get raped. No one asks for anyone's attention. 4yrs old, elderly women have also been raped, why don't you think, what they did to attract such attention and provoked men. So you can add that too on your list of DON'Ts r8t. N you are no one to judge anybody.", "raahiuniverse": "I feel u girl @redheadwayfarer", "_chetu_02": "Salute u babes u shown dis much courage.... And stood upp for girls......ur wordings reached to heart...very brave @redheadwayfarer", "the.arcane.fille": "Salute @redheadwayfarer", "shrivastav.pankaj": "Sabse Bura Rog kya Kahenge log", "valn_tina": "@sabhyatahalli @ash_majjagi @namratha_vemulkar @rhema_kirby @kshitimudnur @rachana__15 @elainemabel95_ @arshiyarehaman13 @aishwarya.bhat.186", "dakshitadesai": "Rapes are the most in a country where goddess are worshipped so much its so sad. Because of some filthy people this beautiful country is no more beautiful. God knows when women will be safe from monsters.", "saamadrita": "Absolutely loved this!,🙏🙌", "aarzoo1312": "🙏🏻thanks for writing this", "raghvendra_singh_7773": "Salute..U..Proud as women", "vedsmritakhari_1507": "So deep & so true ✔", "shivesh738": "@redheadwayfarer In India sex is the symbol of shyness because of we don't take this as a normal thing, an urge of human body and indian culture does not allows us to talk about these(sex education)things. We had problem if someone talking about these things and think that they are shameless and uncultured. We give so much importance to breast, vagina, penis.Rape will gonna happen until we did not change this mentality that these things are normal body parts like every animal has.", "sabhyata.halli": "@valn_tina goosebumps", "bilal_hussain42": "First of all same on you kay jis nay apny account pay nude pic upload ki han aur label mans par laga rhy ho mari sis jab hawa ki beti khilona na bany to adam kay bety ki kaya majal kay wo kholony say khely zara sochna sorry if u mind 👌", "mayank.myk": "@nareshgarlapati1234 then u also get excited.. If u see ur own sis. Nude.. Accidentally.. #havsi", "vaishnavi_2807": "@nareshgarlapati1234 . How can a man control his feelings when he sees a woman naked ?! I really wonder where does this cheap filthy thinking comes from !! Aapki ma ne sikhaya ya papa ne ?! Keeping a flag of India fucking doesn't make you a \"desh bhakt\" even \"bharat\" is a \"mata\" if you cannot respect women !!! And you have the cheek to write ladki naked hogi toh uska rape hone obvious hai ! Then i have never seen a jerk like you in my whole god damn life. Sir. You really need to grow up or get a job. Even women in burkhas get raped . They ain't naked ? What do you want to say on that ? Write things which are sensible or else i might prefer you getting the fuck out of here.", "aishwarya_khajuria": "Exactly and I don't feel like this is a free country where almost everyone around us tells girls what to do n what to wear n what not to wear. If we cannot feel safe in our own country where r we safe den, in our homes? Well this woman here is doing a great job coz people do need awareness. Thank you @redheadwayfarer for doing this.", "jyoti_singh_18": "@redheadwayfarer salute you for the words you have put it forward...Those are the stories unspoken .... Somewhere similar of mine.... Nobody can understand how a girl feel n how she struggles to come out of it...", "priiyanshiijain": "@karishmachiplunkar 🙌", "rophoria": "Thanx bcoz tum simple words me bhot kuch clear kar diya...", "thesettlesubtle": "This is so deep", "_rixii__": "i love you saloni. you are a real lady❤", "rashidbhat": "The concern not just rape anymore. These sick sick people have gone so down that not only they rape women but then they kill them and mutilate their bodies. The day these people are not only given death but killed in the most painful way possible, we can maybe expect a change. These are bloody low life and a simple death is just not justified enough. We need to develop a society and more importantly a mindset where the victims of rape and shown compassion and love rather than worrying about kon shaadi karega. Arey bhai jo ye sun ke shaadi nahi karega ki rape hua hai, wo kal bhi choad dega agar shaadi ke baad aisa hua. WE NEED TO UNDERSTAND AND ACKNOWLEDGE THAT A RAPE VICTIM IS THE VICTIM OF THAT CRIME AND NOT THE CULPRIT FOR THAT CRINE", "rawwmazing": "Last paragraph 👍", "viddyul": "Loved it ma'am", "dipti__58": "😥", "damini1101": "This is such a powerful picture . The kind of pictures which don't need a caption .. The kinds which are self sufficient. Speakers volumes ❤️", "shivika1333": "😚👍", "not_specifide0000": "grate🖒❤", "22shrutisingh07": "@nareshgarlapati1234 try seeing your mother naked then tell me can you control or you feel like doing her too because being a man how can you control your sexual feelings when you see a woman naked? Get a life sicko!", "simrangulabani": "@khushbu443", "khushbu443": "@simrangulabani just saw it", "chef_aastha1188": "Hatsoff well said too good👍", "revuvaijwade": "@redheadwayfarer i respect you from all my heart", "monish_reya": "I really love your posts! ❤", "tabish_yousufxai_khan": "I dont know whether you will revert back to this but seriously I am a The Youth Of Today And it kills me from inside that women are still publicly harassed.Everyday I get up to see news of girls getting raped.Man Oh Man,Is this the country for whos freedom our forefathers gave there life for.A boy can run bare body on the streets but a woman is looked down upon if her bra strap is visible.Haan bhai theek hai aadmi ho.Isme tmhaara koi effort nahi tha.There is a difference between being a man and being a man enough to stand for what is becoming or rather has become the most important issue today.So thankyou mam for sharing these posts and maybe,probably maybe one day A day will come when our sisters can feel free.And that very day I will say My India has attained freedom.", "khosla_3": "@shreyakhosla5", "anjali8538": "Our country will Neva change shame on us ....", "prachi156": "👏👏👏👏👏👏👏👏👏 go girl", "swarttish": "Jiyo mere laal @redheadwayfarer", "sagorika_neog": "Mam u r awesome... 🙏👏👏", "_ashish.56": "👏👏 ... Ye hi schai h jis din ye sb chnge ho jaega us din sb kch badl jaega", "farhaan.ali777": "😓", "tanmoy_paul": "@redheadwayfarer 👍💜", "glitteryboho": "Yes... change is needed gr8 initiative ma'am", "kaurjagjyot": "Woah. This should be read by every individual in this country", "sexy__line": "I love uu hatts off who agrees", "diksha.adhikari_001": "Right 👌👌 @redheadwayfarer", "rachita_keshri": "You know what the irony is? In India, generally rapes are considered as just a damn 'MISTAKE' that happened, you know 'BACHPANE MEIN'... And the mums of such morons keep their love above the life of a girl. After all she is just a, GIRL! @redheadwayfarer kudos to you❤️ Never let the 🔥 quench Ma'am😊. A fan of yours❤️🖐️", "sharongupta9": "I don understnd \"log kya kahege\" log jb kch nhi kehte jb kisi rape krte hai log jb us ladki ko supprt krne ki vajai us pr blame krte hai.....plz ese log kahi mar jao jaaa kr fuck off✋", "irshita.soni": "@parinita_vedantam @akansha__verma @adiv_ss shez just 😍", "riya_14rk": "@boboo1912 @prachi156 @amrin.k read the caption", "nightingale_20": "Bhaad mein jaaye aise log 😀😀😀 Aur vaise bhi... Kch toh log khenge..logon ka kaam hai khna😕", "riyatripathi_25": "Exactly ..how shamefull how can family member can do so ...so horrible", "word.lust.scribbler": "Amaziiiiiinnggg😘😘😘😘😘😘😘😘😘", "heaven_stolen": "Amaziiiiiinnggg😘😘😘😘😘😘😘😘😘", "_gunishaakohli": "Accurate💯💪", "wittyandfunny": "The worst part is that rapist do get married. I really don't understand how can anyone get his daughter married to a rapist? Shouldn't the rapist and his family lose respect in the \"cultured society\"?", "shivaniiipeace_": "Ssly", "shalinib122": "Shame to such men who look away when a women cries for help ... 👎👎 what a gutsy appeal... braaaavo girl .. keep this spirit going 😍", "subhayanbasu": "Strong words. @redheadwayfarer", "_jessica.saini_": "Respect👌🏻👌🏻", "___kashishmehta___": "@redheadwayfarer whatever u write is so amazing I mean I wish there were more ppl like u around in here #accurate #onpoint #respect💯💯💯", "medha_2309": "@nareshgarlapati1234 and i can't fucking understand how the hell has anyone got the right to rape anyone!! Seriously guys like you are a fuckin disgrace to the society!! U can't change.. so can't the society because of people like you.. shitty opinions... And mindless self!! Go on grow up!! And act sensible... Looser!", "saniyaamoree": "What is more upsetting is d fact that women have to ask to b respected", "sandalijain25": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏", "rajeevi.serveswerao": "I'm really happy that I have come to know you Mam your posts are not just for likes to me or not just for idiots to bark.your writings your each and every word changed me myself my thinking. I started to give importance to me. I stopped to care about the judgements people are giving to me. I really really started to love myself. First Girls have to change.girls like me have to change.No fucking person have to stand for your self you are enough for yourself.I learnt a lot From your posts Mam Thank you. @redheadwayfarer", "swapnaanjali._": "Need more people like you in our country. More power to you, @redheadwayfarer ❤", "divyanisingh09": "What a true n a fact that's shows our society is too weak n ugly... they can only grow by their status and power but they don't have thinking to think mature ...", "nandini_shah": "Yea true more people like u are needed .....😘❤@redheadwayfarer", "penaazsidhu": "I've followed you not because you are an actress, or because I've seen your work! I followed you cause I salute women like you who are raising their voices against this society. You are raising questions that people don't feel comfortable answering! Keep such thought provoking posts coming. More people need to be educated to understand the real meaning of respect and freedom and finally, what it means to be a female in this society! Real power to you @redheadwayfarer ❤️", "_manisha_401": "They r nt men they r animal who r meant to sty in zoo nt in the soceity", "chikuag": "@saniyaamoree And @redheadwayfarer yes thats very true. I liked the phrases and yes Remembered the ad alaram bjne to doo...And some cheap womens use Rape as to loot any person", "aakritihihai": "Why are you not into writing? You have some amazing intellectual pieces and you should be publishing it officially", "supernova_she_was": "This is something \" to d point \" . A big quest for our society, not a quest but a matter of shame😣 y is our \"vagina\" associated with #izzat why not dt fuckin #penis treated d same 😖 they can do anything ,fuck anybody -a child , a woman , a girl , animals too according to their level of desperation😠. The one's who say you're vulgar is because their own egos n satisfactions hurt. 😐 I wrote a similar article and posted to my family wtsapp group thinking people would appreciate but those highly intellect brains felt more comfortable in ignoring it😷😏 cz maybe they were ashamed of d fact that I was too straight to convey 😑", "sumbulkhan01": "You are really a person I admire because you have the guts to speak out about the harsh reality 👏 kudos", "_zahabiya.a": "Caption on point ✌🏻️", "harshita_rathi_12": "Awesome maam #respect @redheadwayfarer", "tazeenshaikh_ts": "🙂🙂🙂💗💗💗💗💗💗💗💗@redheadwayfarer", "superior_almighty": "This is fucking humanity and that's how people are about what you sayin. People do keep saying negative and positive things about whoever has achieved or lost something whatever it's extent maybe. Whatever, I meant rape victims should be helped and great care should be taken because that person is suffering from emotional pain and that too one of the worst condition.I don't know how much amount of people feel like me but it's an honourable thing that someone was so strong that they survived that shit and still hasn't lost hope.That takes a lot of strength which a common guy /girl can't do. You are really one of the strongest girl I've ever seen and after watching you on TV I was stoned and amazed to see how much strength you have .That's all! 😏😊", "rohininair12": "This is epic ❤", "thushara_salian": "Well said @redheadwayfarer 🙌👏 respect 💪💖", "harshita.panthi": "Huge respect for u.. ❤❤", "sanjana_020596": "Well said @redheadwayfarer ma'am .... Seriously we are so proud of you that u are actually taking a stand for women.... ❤❤❤❤", "poojasharma6077": "😧😧", "ashweriyaa": "all hail to the red head girl 🙌🙌", "such.as.mee": "🙌🙌🙌🙌🙌🙌", "_anushikaaaa_": "@redheadwayfarer 👏👏 This is just wow😍. I just salute you for this. I hope society learns something from this. Thanks for posting this. Thank you so much, di. @redheadwayfarer", "imynk__": "@redheadwayfarer you nailed it.. gonna post this on my fb page❤️ Hats off🙌🏻🙌🏻", "srushtimathukia": "Superb...! You have written something that the Society definitely needs to know... They need to get aware about these things and need to change their mentality . Hope we could bring that change..! @redheadwayfarer ❤", "evil221195": "@manurock26", "am.aami": "@redheadwayfarer Wowww ,u r inspiration 😘😘", "itxzill_qureshi": "@redheadwayfarer omg i am just so inspired by this🙌🏻♥️♥️thankyouuu for all your posts that can change someone's soch..!🤘🏻🤘🏻💕💁🏻", "teddy_bear140394": "Respect<3", "theuntamedwolf": "#respect ❤", "pallavikohli_": "Just love for whatever you do. Just proud of you. RIP to their shit minds.🙏 Bhaagwaaan unhe budhi de!", "mayank_sikerwar": "@redheadwayfarer hatsoff .. 👍👍", "madangirikar_sailee": "Can you please share it on Facebook too?", "_zaarrraa__": "Amazing ❤😍 u are a true inspiration di 😘 @redheadwayfarer", "mintoomed": "Hats off to you saloni.i hope we can bring a change someday", "alfafemale_": "This is just sad... dats a deep sad... how rules bend wen it comes to men!", "sejalmoghe": "A big shoutout to you and your work, you are an amazing soul. Love what you do, these things (social problems) they need to be solved, you are an inspiration to everyone that goes through everytype of sexual abuse. Thankyou so much! Love you xoxo", "wish_ak": "@redheadwayfarer hats off to your post girl", "paakhi_rai": "👏👏👏👏👏👏👏👏", "shivani_natholia": "hats off babe", "highfliier_9": "damn 👌👌👌👌", "attrishreya": "@redheadwayfarer #keepgoing 👏🏼👏🏼👍🏼", "rashisahai_1808": "Thankyou for such caption that helps people change there thoughts💖", "theladyofshalott_": "i have too much respect for you..and feminisim is a necessity in india else ppl will not realise anything and you're doing a great job by spreading awareness and by giving this message. And this is how every single girl on this earth feels like. I feel so powered just because of the girls like you. @redheadwayfarer 😊😊", "debodiptanandan": "Respect. 🙏 And yes the caption is really heart wrenching. And this is the R E A L I T Y. Women are still objectified and used as a sex tool. If you can't even respect the modesty of the opposite gender how will you accept LGBTQ? Thank you for this post. :') @redheadwayfarer", "1fluffy_marshmallow": "Amazing 👏👏", "anjali_v17": "👌👌👍❤️❤️", "er.naresh_": "❤❤❤", "my_unseen_thoughts": "If some guru ji romes naked, people run behind them to take blessings but i a girl wears her choice of clothes then people run behind her like a blood hound dog. @redheadwayfarer u r amazingly unbelievable.", "amoghkh": "Very well said. We should really start talking about this more often. Specially for the sake of those victims who feel like it's their fault. The society makes them feel like they are the criminals not the victims. Those parents and relatives are equally responsible who choose not to report such incidents.", "sofyamulani": "✔️✔️✔️", "sweet_venin_84": "@munira_163 if a guy can wear what he wants then who the hell r uh to tell girls to stop wearing trimmed clothes ... A girl's body is not meant to be raped ... Shame on ur mentality... Do the 4 year old girls who get raped show off their bodies?? Do the 85 year olds try to show off their bodies? ...ur thinking is so shitty ... Shame on uh nd ur cheap thoughts....", "nishika_chaurasia": "👆👏👏👏proud of uh @redheadwayfarer", "ihatemangoes": "I totally agree with you but what about 'males' out there who are abused and harassed as well..its just not 'us'(female) who are going through this. There are also many males going through this shit everyday somewhere. So, I really think you should start raising your voice for not just 'females' but 'human' and talk about more for every gender..", "anshi_selhi": "The thing you wrote is exactly wht this society do the sentences are used daily ....I Dnt know why people CNT get with the fact that a girl can wear wht she wants ,be wht she wants .....nd all these rape cases ... even if she gets a justice by law their will be no justice given to her by the society they will turn her into the culprit and not the victim . I am ashamed of being a part of such society I think that's why i Dnt bother wht society thinks of me I will never let them brain wash me . helpful for your posts tht you keep gng on with it I will fight 😫🙇🙏 thnk you di .", "priyalolololol": "@munira_163 aap kapde pehenke apne ghar ke bathroom me nhaye h Kya? I don't think so you have tried that!! Aap bina kapdo ke Salman Khan se sex krna chahege? Ya Shirtless Hritik Roshan se ? Nange ladko ke bhi rape hone chahiye the naaaa!! Dear, it's not for the show off girls wear shorts, it's neither for anyone's attraction, she is raped for that is a viewpoint of people like you!! She's beautiful when she's naked and she's beautiful also when she wears full clothes!! 'Logo' ke dimaag nange hote h toh bardaash ni hota apna desperation. @redheadwayfarer I'm a victim of 'the incident' too! I've always kept it hidden from my parents, but I've fought, I'm still fighting for myself, I feel strong every when I count the number of days I've lived after what ruined the 'girl' inside me! But still, I feel strong when I carry my cleavage well in front of all those assholes who desperately wish to fuck, I feel proud for every lady who roams around with cleavage and bum shorts, she is beautiful, isn't she? She's strong , much stronger to face all those who disrespect her, she knows what's happening inside their mind, but she's walking free with her beautiful body and most beautiful soul . Lots of love to @munira_163 please try to understand, you just can't bath wearing clothes, it's not comfortable. @redheadwayfarer (salute) I wish I could hug you someday ❤️❤️", "meeshrm.9715": "@redheadwayfarer ❤️❤️❤️❤️❤️❤️❤️ prefect ( just like me ) 😉😋", "shimmerandmuse": "Very very true & heart wrenching. I think it's time to take the law in our hands & punish the culprits. But again, our great society, might just turn around and sympathise with the miscreants only. 😡😖too fed up of these crimes against women. And it's the society's fault that these crimes have now taken such a diabolical & brutal form. Aur sar chadayo bastards ko... tomo it can be someone in your family, god forbid. But people just don't understand the point & gravity of this situation. 😒😬", "dutt_somesh": "@ax_ysha chill baby", "ankit_singhb": "🙌🙌🙏", "shri94": "@redheadwayfarer well said dear.... Keep it up... u r doing a ryt thing....all the best 👍", "mr.anas_ahmad": "Maardo in saale kutto ko", "aditi_dekeyrel": "These ppl will never understand that it's just not all about clothes..", "believe_in_herself": "No more to be a godess.. Indian woman will not compromise.. no more bhnji.. @redheadwayfarer you really an awsm soul", "_.kanishq": "Someone somewhere ll be reading this and it ll turn out to br a life turning moment for them :) keep doing the good work ! Words are your weapon ! @redheadwayfarer", "twinkle_0597": "Rather than telling people to respect a particular gender.. We should adopt humanity that is above all gender ... \"mam I am so inspired by ur bold statement.. \"👏👏👏", "alan_jose_john": "It makes my blood boil when I hear about a rape. You destroy a girl and her life. I always believe that men should respect women. Be it your mother, sister, wife, friend, girlfriend or even a stranger. That proves you are a man. Rape just proves you are an animal. Our laws should be made stronger. People if proven guilty of rape or sexual abuse should be given the maximum punishment according to the severity of the crime. If the girl is killed, hang these guys without a delay. In case of sexual abuse, make these guys impotent surgically. The media has a role to play and that is by not sensationalising this to such an extent that they draw unwanted attention into this girl and her family. If all this will happen, then I do believe change will happen and the women in our country will be safe.", "chandni_mordhani": "Proud of you.You're a true inspiration. ❤❤@redheadwayfarer", "dudenitx": "I can't tell how much I love and support this thought and cause of yours. . .. totally appreciated. . And I m totally with you on this fight. .", "roma3343": "👏👏👏👏👏owsm", "piiibeeeee_": "The best💜💜💜💜", "rajan.sohal07": "Ashamed of living in such a country.", "bhairavi_j": "I love you, respect you and adore you for standing up for all of us. Your posts are making a difference in people's thinking everyday I'm sure. Keep writing, keep shutting them down. You have all the love and support. You go girlll! 💪", "_shivam.01_": "@rajansrs same here bro 😥", "anshikapandey23": "you just made me cry mam😭😭😭 kyu india ke logo ko smjh ni ata ki in sab chizo ke alava bhi kuch kr skte h yr , kyu hmesha rape hote rehta h , aisa lagta h jitte bhi ladke aj tak kisi bhi ladki ka rape kiye honge na un sabko laa ke ek sath sabka rape krna chahiye or is haal me chodna chahiye ki aage ja ke kabhi zindagi me sex hi na kr paye , or puri zindagi marte rahe ghutan me @redheadwayfarer", "sahiljasani": "Dont wanna say smethng n describe the things u said ;just one thing respect for every girl and the way u expressed #justkeepongoing ✌🖒🔥 @redheadwayfarer", "ayellowstreetlight": "I wonder why does the society place a woman's honour in her vagina. @redheadwayfarer", "mahima_kochar": "This is such a powerful message and it breaks my heart knowing it's true 😭💔", "advaita_nirvana": "StandAgainst.", "talukdar_girl": "Its too easy to say or talk kavi feel kiya hai jab 8year ki bachi ko chocolate de ne ke bahane apni maama ne moleste kiya hai.. do you ever feel that pain?? no.. and kise uper varosa rakhu aaj tak kuch hua hai aur hoga??.. eha pe jitne logone commnet kiya hai koi esa mujhe bolo jo kavi vi ye sab rokne ke kiya khara hua ho.. any1 @tapo_sika", "girlwithbangs_3": "Bitter truth @redhead wayfarer pta nhi kbtk ladkiya aise hi chupchap sb sehti rhegi..its time to raise voice against this bloody shit of our society... Hats off to you...u inspire so many girls out there...", "_.pure.sinner_": "👏👏👏👌👌👌🙏", "arghyaaaa": "Its sad to see how tough it is to prove a point to such knuckleheads every fkn time. Some people will just not understand...not because they cant but because they dont want to. @redheadwayfarer you are such an inspiration😊", "ritztated_27": "❤️❤️❤️❤️", "__meghana___": "Indian woman cut off a man's penis after he allegedly tried to rape her at her house in the southern state of Kerala, police said on Saturday.The 23-year-old lawstudent was at her residence in the state capital Thiruvananthapuram late Friday when she says she was attacked by the 54-year-old man, who had claimed to her family to be a religious guru.\"She used a knife in her defence and cutoff his penis,\" THIS IS THE REAL WAY OF PUNISHMENT...👏👏(An incident took place few days before in kerala).", "the_millenial_writer": "WOAHHH girls she is a true inspiration!😍", "kshitizsharda": "Well.....said", "bhartibhatt_": "I wish I could have an elder sister or a best friend like you .. You are so inspirational .. there were tears in my eyes while reading your caption .. B'coz I had been through all those molestations.. by so many of my uncles or cousins . At that time(or at that immature age) they use to threaten me a lot .. And , I also used to think that if I would try to tell this to my parents , there will be so much of fights n all. .. But now since I m (partially) grown up , I know the reality , and try to take steps against them .. ... ❤ May God bless you with all the happiness in your way .. I love you TO DEATH SALONI.. keep inspiring always @redheadwayfarer ..... 💠💠", "ek_khayal_aur": "its the biggest drawback of our society and u knw wht we wnt to compare us with the world we wnt to use their technology try to be act like modern but wht we actually do 'when evr we see someone doing something wrng' we yr mujhe iss lafde m nhi pdna jiska h wo smjhe we just dont wnt to hlp and our society doesn't trolls the rape culprits we actually behaves like girs has some fault", "jo_roshn": "Few dick heads talk shit cuz thyr male ego is in danger😏. @redheadwayfarer you wil be respected for your guts!! I always am asked to shut my mouth when i stand for a fight sayin \"tu ladki hai ladki jaise tharteeb rakh\". I too am human i have right to stand for myself or any1 in need. You stand lyk an icon, an idle for those bold girls n weak aswell!! Salute to u di🖒😘", "sakshimonga09": "🙌🏻♥️"}