{"kayes_saddam": "@manpreet7084 yu don't get it my friend what i was sayin....", "manpreet7084": "But why is she showing her tits if a man would show his dick it would be considered as gross or maybe he would be accused of molesting", "vaishali574678": "Mans*", "meee.yash": "If you are so open. Why u blurred your nipple? Sick girl..", "sup_shah": "Strong message", "stars_vhf": "Beautiful 💓", "sanam_singh_rajput": "White spot nai rehta toh Aur accha rehta😂 nd strong msg", "mineecifi": "If nudeness is freedom the African people who doesn't wear clothes are more \"librated\" then us .. what a filthy mentality.", "bhawnagaira": "White spot ?", "anand_mohan_": "What's her name pls??", "onushah": "Rathe...u r insulting the whole girl race....", "r.k083": "Send me this pic....", "garimamittan02": "Perfect ❤ Well said 👌", "rehanqureshi5878": "She so butiful", "chikkuu__": "@chandrashekharrr007 😂😍 welll well wellllllllllll said ✌", "chandrashekharrr007": "@pankaj2107 ha ha ha ha ha ha ha!", "vishwa0429": "@chandrashekharrr007 Have you not heard of the quote \"charity begins at home\"? What do you mean to say that women are raped all over the world, and so it is okay if women are raped in India? Is that so? And just btw, just to quote a case: remember Nirbhaya? She was raped in a bus and thrown off naked on the road. Not a single person came to her help that time. I assume the all the 1 lakh men you talk about were dwelling in Delhi at that time. Lol. Also, enlighten me on the 'fact' that 70% of all rape cases were false. And please. Don't waste your patriotism and nationalism in the wrong place. She is not targeting India. She is stating her view against something wrong that actually occurs here. Rapes are not something to be proud of. Educate yourself and learn to read. Oh and yes, I am a feminist too. Would you ask me to fuck off with my feminist ideas too? Oh and Hippocrates was a scientist.", "raina_akshay": "y white clot is there", "fawad_fadu": "Why censored", "rahulpandey2552": "Oh come on..", "normal33392": "so yum", "balveer.parmar": "Bad photos", "syeddiaries": "@chandrashekharrr007 well said big thums up", "saltbaemona": "Also, how can an Indian living in such a diverse country be so disgustingly narrow minded? I mean hell, our country can make up another damn planet. Expand yourself, people.", "rbfriendly": "@niralsi Things you talked about are the outcome of many years.. Women and men were not treated as same, most of the people in india were not educated, roits in religions, different religions have different values and rules for women and men as well..why don't we work together on the problems going in this country right now.. If a girl is raped then we also feel that shame which women of this country does.. Why this girl(saloni chopra) target all the men of this country.. I would like to tell her that if there are 1 lakh men who have mentality to rape a woman then there are 10 crore who have power to break the teeth of those with a single punch... Believe in us...cooperation with us.. We are also with you.. We respect you...We also have sisters and mother in our home..lets fight against those few people.. Nudity and vulgarity will not help girls to empower them and make them equal to men.. Not just in this country but in this world.. Education, cooperation, equality, equal opportunities will definitely do.. I request you saloni chopra, Stop targeting this country and men of this nation to get fame.. There are many other way my dear..", "miss_rappingle__bunny": "@ankursharma465 💙", "nishthaaa02": "Why can't we be good wearing clothes? Any prob with that. We cover our i phones to make them look more bful, to protect them. Just the way a female body is. There is no comfort in walking nude. Neither for girls nor boys. I like your posts, i appreciate them. Always read them. But i don't share the same opinion this time. 😌", "alikhan6952": "Dont hide nipples", "xttz.25": "@chetnakhandal 😂", "shubham_nishad__": "@alikhan6952 👌😂😂😂", "v_for_veracious_": "Well Said 👍", "crazy_soul10": "@chetnakhandal dude its not gande kaam its her life she would do whatever she wants if you get pregnant before marriage would u keep the baby?", "shivam_singh_7209": "Kya yr gajb ki ladki h...kitna show kregi... sala isne to upar ka pura dikha diya....kuch izzat h hi nhi..family ke baare me to soch liya hoti", "anujaasingh": "@rajjnt chhoti soch", "rajjnt": "@kuhoogaur nd talking about percieving,it also has limits like everything in the world", "tejaswini_pillai": "You are really amazing and I swear u have really become my INSPIRATION 💗", "we_r_one_1104": "B what u r 😎 u don't need to worry about fucking people 😏", "nirasmalai": "@chandrashekharrr007 the country is beautiful indeed but the people are not. It accepts diversity? Ask a north-eastern person who is bullied for having diff features n not considered a part of this country for the same reason . every community? I wonder if u read the newspaper where at least one news is of some XYZ dalit being exploited or beaten up for no fault of his own. Every religion? How many more Hindu Muslim riots need to happen to catch ur attention. Sir u r right all these things r accepted heartily by our country. But sadly only in the constitution. I m not against the country m against the people who r blind not to see the damage happening becoz of the patriarchal n male dominating mind set of this nation .", "chetnakhandal": "@garimamittan99 akshay kumar never said that #freethenipple.", "___escapewithme____": "@mujafarkhan its ok :)", "hero_cafeee": "boobs❤", "harshee_": "@nareshgarlapati1234 you should remove Indian flag as your display.", "jayy_joshi": "It's not vulgar 🙂", "apoorva918": "@paokzares Instagram would consider it nudity and delete the post if she wouldn't cover it 😕", "drish_shetty": "Please don't stop writing, no matter what", "pratik_mahajan_98": "Vulgar", "dee_sharma_": "U r love...😍💕", "drunk.on.words": "Very well said 👍👌", "anarchic_ataraxy25s": "U are pretty !♥", "kuhoogaur": "@rajjnt When skin was created it had no categories and no boundaries or was in no way related to any profession or person. When one sees skin it's your own way to how you perceive it.", "paokzares_": "You put the hashtag of #freethenipple but you covered up your nipple, I don't get it .-.", "_.prabhat._04": "Vulgar", "____.whiskey.____": "👏👌✌...i think it's true", "srishti_roy_": "If feminism is not a \"useful topic\" , Pls enlighten us as to why tf are u following this queen ?@nareshgarlapati1234", "gaurisaysgfy": "you're the next best thing on insta after memes.😂😂😂 i am so much in love with you.💝💝💝💝💝", "bhawnabhardwaj12": "Your words are perfect description of society 👍", "alostlens": "❤❤❤❤", "astha.jha": "Oh my god i love youuu so freaking prouddddddd♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "cursed__sinner": "I can see many chutiyas who are saying rubbish things over here and commenting rubbish and whatsoever they think about women's without even thinking a single time what are they literally saying i thing for these type of people shut up live ur live nd let people live there's dont interfere in another's life or comment nd jab kisi ke bare mai accha nai bol sakte ho to bola b mat karo first see ki how stupid u r sounding while recommenting other girls over here who are right with there point i hope people understand😑😑😑😑😑😑😂", "shivinaith": "@chitrangjain_", "naresh_garlapati": "What I found you is ,you want to become actress by posting vulgar pics in the name feminism,equality.....shame on you@redheadwayfarer", "_r_se_ravan_": "Btw its girls not gals 😊 @ritu2564", "not_your_cliche": "@nareshgarlapati1234 hey, I am a south indian and I think she's a great inspiration to all women irrespective of wether they south Indian or north indian 😂 and what the heck are u trying to do , generating racism within the country ?? Come on buddy !! Grow up", "sonaliimishraa": "This is so pretty.💋", "_m_u_s_s_u": "You're an inspiration💕", "purvassharma": "@nareshgarlapati1234 and its not okay ..me or her being feminist has nothing to do with my or her character ..we belong to a well educated family and are allowed to keep our views and opinions . I dont think indian culture is to speak in an abusive language with someone on a social networking site . And a girls clothes doesn't defines how cultural she is .. Time to change your thinking sir", "ritu2564": "#respectwomen 💗💗💗💗💗", "natskath00": "@aparna_sabharwal_11 what makes YOU real? She is the only real girl!", "barbie_doll_loves_u": "😓", "sayari30": "@nareshgarlapati1234 naresh Bhai first learn English and then comment 😂", "neharikaaa_": "You're an inspiration for this society! Whatever you write is just so true !What you're doing is just wonderful and we need more ppl like you to stand up and speak without any fear but more of confidence! Whatever we wear doesn't matter, what matters is your thinking! You aspire! I hope ppl understand what you write coz alone a person can't complete this mission called EQUALITY 💮 @redheadwayfarer 💖💖", "atedsaro": "@sargam31 seriously?", "nam_kirve": "With only the words i think it's hard to prove your point. People have such shielded point of views, that all this sounds shit to them! And anyway, it's how life has taught them! So just let them do what they want to, and we'll do what we want to.. *as you said in the last picture* And you're beautiful! ❤️ @redheadwayfarer 😊", "sargam31": "I LOVE YOU SO MUCH. ♥️", "angel_steeper_naqvi": "Hot", "sa675sa": "@wierdprettyteen below", "buddiesservinghumanity": "Above*", "prernavijaygandhi": "@nishitaj_21", "saurabhmall720": "So nudity equals to fearless hmm interesting", "nishitaj_21": "Beautiful and so thoughtful @prernagandhi16", "varmadeep": "Oh so sitting n Australia...u want the change...if u want change..screaming from Da hill top dus nt help..b Da change dat u wanna see around u...@redheadwayfarer cn write a book..today if Da Mahatma would hve thought like madam Chopra..imagine v would yet b under Da Brit rule...batho se kuch nahi hota...to b a part of a revolution...u need to personally b there... Chopra is seen voicing her opinion on Instagram,...Wht is Instagram..? it's all bout snaps...red head no garbs plz..", "servenomaster": "Hi, would you like to earn money for your writing, I teach an online course for free if you would like to know more. visit my instagram page or website at www.servenomaster.com to sign up to my daily podcasts.", "manasvi1708": "@steph.simon_ thankyou😀", "nabarun_ds9": "@nareshgarlapati1234 sir, your opinions and whatever your are preaching is totally out of place here. Let them(I mean women) live a life they want, the way they want, wearing whatever they want! Talking of culture, please don't forget caste system, dowry are all a part of your so called culture! And please don't bring the topic of marriages in other countries because you just reflected pure negligence on that! No hashtags pollutes anything, it's our inference of it that does! I have a simple message for you, talking about unity is diversity in India there's still too much of racism that happens daily! The society is not perfect, neither am I nor are you nor is @redheadwayfarer , but she's trying to her part in some way rather then nothing at all. So from a fellow guy, please let them be the way they like to be!", "preetttyyyy__": "Caption 😇✌", "prakharprabhat": "You shifted back to Australia?", "shuklaspeaking": "Agree with you...", "nisa_bhat": "its btr to go nude.... early women ....hehe....", "trippy.procrastinator": "Not a correct way to prove your point. ....", "maisur_ghadiya": "Respect", "hemaniangurana": "@rupali_raina", "vartikasingh.meetu": "@nareshgarlapati1234 see thats not what i am putting up here... Shut it.. I liked you unity in diversity thing.. I disagree everything else... Its about choices... Your body your choice.. Simple", "twenty_somthing": "Respect ❤", "sonali._.roy": "Salute to you...❤❤", "manisha.2303": "Salute to you. What you have done by freeing your nipple, no feminist has ever done. Women in india are truly empowered from now onwards.", "anxo_caido": "She copies Kendall Jenner", "papadocd12": "Bitch", "kiinshi": "@saloni_patni_", "steph.simon_": "OMG!! the caption says it all.. These words are of every single women in this country.. I am speechless.. @redheadwayfarer ma'am this country's law is too lazy to announce the deaths of all the rapists involved in \"Nirbhaya's\" case.. Can't say when they'll wake up.. And the citizens of this country shows support by lighting the candles, but when they see any guy harassing a girl in the crowd they never speak up.. They should speak right at that point instead of asking for justice when the deed is done.. People need to grow up these days and boys should start thinking from their minds instead of their dicks.. #fearless #freakingsociety #improveyourmindsetspeople #keepyourheadheldhigh #moreandmorerespecttoyouma'am #alwaysgonnasupportyouandyourmessages", "ria.risbood": "@thatgirlkimaya she writes so well", "saloni_patni_": "@_kinshi i was just reading it this is really amazing!", "shetty.purvi": "@nareshgarlapati1234 seriously people like you are ruining our Culture, and yes india maybe a inspiration for other countries but india has been pulled down over some real issues like rape, abuse, harassment, corruption, trafficking and wht not and @redheadwayfarer isn't arguing she's just being herself and right okay? and I honestly think tht india should have people like saloni chopra.", "bhanupathania31": "Ohh @chandrashekharr007 so what u r threatening that u will be responsible for ur action , and u r not a judge to decide that in which attire a woman looks better", "ordinary_meee": "@nareshgarlapati1234 you may have forgotten parts like women being paid lesser in jobs, dowry that only women's side of family has to pay, the inequality that women face pretty much at every place, girl child being killed, how women are looked down upon if they marry twice or even get divorced, how women are supposed to wear salwaar but men can roam around nearly naked and it isn't a problem. I really think you forgot to mention those. Oh, and about no against taken against wife if she makes a mistake? Is that even something you need to ask?", "shanaya.fashion_": "Fuck she is so hawt", "ruhibhatiaa": "@riya.dadhwal", "gabrielapoetry": "Blesses from Germany..... i really like your point of view and that you are and live like you wish.... go girl.... you're an inspiration👸", "the_anon_damsel": "Luvv it.......hats off @redheadedfarer......u r really so dmn true..our society n our people still have to go a long way to stop this GUD GIRLS thing...glad 2 c that at least SME 1 try to acknowledge these issue..keep it up..", "aniket_1193": "Nice one..", "aakashvftc": "Beautifull...", "irk215": "@chandrashekharrr007 you're a disgrace to the society...it's her body, you're no one the comment on it or suggest her what to wear and whatever she is doing, she is much more successful than you are and trust me, may be according to you she is wrong but people hardly give a shit about your tought. @redheadwayfarer i liked your post 😊", "harshita_malvi": "Ya bae 😘😘😘 @chelcy.kapta98", "ravishingtwinkle": "More power to u", "aryavsrivastav": "Though i am a kid but ur pictures and caption are amazing 💗", "komalishq78": "Nice", "_s_i_v_a_n_i_": "inspiring!!!!!", "deeksha.ssharma": "Such a hypocrite...soo mean", "goswamiarpit78": "Good", "_egghead_darling12": "Those post looks great in Reading but in reality it is hard to believe ..Tbh !! All are not getting freedom like you !!", "megha_gangwani": "@ninetyyyseven girl you nailed it ❤", "___yeehaww___": "@zaan_love Dude why would I be jealous?? I'm on her side! *Cheers \"you go girl\" *", "hemanshushekharmayekar": "@redheadwayfarer U deserve an award for ua caption.. Anyway.. Very well said. 😊", "nights_of_lights": "Soooo inspiring... U r ...I just love u", "by_mansideshpande": "Nice", "jitu_smoker": "Bkwaaas", "wish_ak": "I think rape is not just India's problem , it's the problem all around the world , so addressing all the Indian female as *unfortunate daughters* not justified. @redheadwayfarer", "kinkinnatore": "@chandrashekharrr007 moron.", "chelcy.kapta98": "@harshita_malvi read the caption babe, she sarcastically slapped their faces! @redheadwayfarer you go girl you are amazingggg", "1998varu": "👌👌👌", "thisisseema": "❤❤❤", "such.as.mee": "ur caption always blows my mind 😍😘😘", "__geetika____": "Now this is too much....never expected this from uhh... This is so insensitive and embarrassing👎😑😣 @redheadwayfarer", "sohail1447": "I wish I could free u from this shackles, I'm sorry for the world is like this.. I have 2 sisters (twins) they will live as they like,, may be that's the least I can do for u", "___thechakravarty": "You have no idea how much you inspire me, @redheadwayfarer", "ankkitaaa": "This!! ❤", "maham.khaan": "She look alike katrina sometimes", "i_am_raghuvanshian": "@redheadwayfarer amazing!❤❤❤ uh are absolutely right !👏👏👏👏👏", "boldxylem8844": "Cool", "__tahu__": "Cheap u r", "alan_jose_john": "You are a very beautiful woman. Not just outside. As a man I have to say that the power in your words is your beauty @redheadwayfarer. I love reading your posts and I respect you.", "prish_shah": "Wow this is beautiful...... love the way u write can't wait for more @redheadwayfarer ❤️❤️❤️xoxo", "amju.ka": "Respect ❤️✌🏻️", "chandni_mordhani": "❤❤", "aparna11__": "Fake girl ..flaunting", "the_ordinary_vaib": "Every girl should be respected and treated like a princess and the same goes for guys. I really think that those who does horrible things should face the horrible consequences. I respect people who are clear with their thoughts and words but we should be very careful what we post and write as it affects the people who blindly follows you. It can either make them strong and good hearted or it can make them arrogant and with phony attitude. I really hope you become a positive change bringer in their lives rather than negative. I bid you all the best wishes in your future endeavors. ✌🏻👍🏻🤘🏻😎 @redheadwayfarer", "pankaj8915": "Sexy", "jasrotiaa": "@redheadwayfarer I wonder what you'll prove by sharing such pics.... what kind of a feminism is this and what kind of liberty r u talking bout... dere's a difference between freedom and being shameless....", "celle_writes": "@varun___kapoor you don't go around Instagram telling shirtless men to cover/respect themselves.", "simruuuun": "I recall not asking for ur opinion u know? U can kindly leave as she's a \"Bitch\" for u, funny how u call her something like that n see her pics..she's herself and no one asked ur opinion about it @nareshgarlapati1234", "mitts_": "@enjeelashakeel her profile is dope..!!", "janyaniraj": "Caption❤❤❤ girl....", "enjeelashakeel": "@mitts_ nah! Don't like her much.", "nupeshthalor": "Just for lv only", "shubhra_sinha11": "@aleenbarwa910 caption 👌", "im_siddharthyadav": "Yrrr I love you seriously your thinking nd Your though was awesome😘😘😘😘", "rohra_pinka": "Had you been a foreigner talkin this, people over here would have thrashed you. But u being an Indian, how could you be wrong in judging India. Yes there are some regions where women are not allowed to show their skin. But girl, so many of Indian women are bikini models. Beaches are crowded by women wearing sexy swimsuits. Actresses falunting their cleavages. Why do you want to take this to another level?? Like free the nipple ?? Seriously??? Society is uncomfortable with a naked body, be it man or woman. I am sure feminism is more than walking naked. Its more about rights of a woman at par with men.", "niranjan_devalekar": "👍👍", "chikuag": "Absolutely amazing you are killing those People who just can't keep there mind away....", "simrankaurj": "❤️", "halimah066": "تحوم الكبد", "zoyaasamadd": "Caption ❤❤❤❤❤❤", "shori_anshika": "The caption ❤", "harshadk___13": "Hotttttt", "iamsomrajgurung": "Do whatever you want to do be dope", "dreamseditor": "Darling you just Awesome 😘", "unflinching_snehanshupandey": "Bold beauty @redheadwayfarer", "_.simrann._": "@shibanz you get your facts right babe. Don't you watch news?", "canis.with.camille": "March for our daughters and our daughters daughter", "banarsikudi": "loooking bold...yes we r right darling nw at dis tym education of wmn n also be man growth of country bt behind walls they r not be educated n poor of mind.....", "shopglamoursociety": "♥️", "a.plus.two": "Would love to see you write a series (medium) one day. @redheadwayfarer", "beatitudo_detoxicated": "trust me... the rapist doesn't use social media!!!... here we get the males respecting females bt.. out of the world of social media..where their r 4th category drinkers narrow minded peoples they doesn't even knw the meaning of respect to anyone!!.. rape is in mind not in cloths of women... @redheadwayfarer luv u for ur efforts..", "roha_raina": "This is what I was talking about. Read this! @ashishsudame35", "ayushbohara_140": "@aanchal__kashyap aanchal mujhe uss se koi dikaat nhii na mujhe kuch farak padtaa h everyone has there own life nd there own way...maine basss dost ki trh basss uhii keh diaa nd gltii krdi sayed ..soo please forgive me nd do whatever u want 😊", "sarkar_sonalika": "U make me stronger more than ever..🙌🙌 @redheadwayfarer love u lady..respect getting increase day by day towards you..", "speedster._": "WCE 👈🏻🙈❤😛", "vaidehi1304": ":\")", "chand_moonlight": "🙌🙏💪👭👭", "preyxnsh": "@katrinakaif", "amitkinwar": "Bravo", "shibanz": "We killed the men that raped India's daughter!? Get your facts straight, they haven't been hanged yet", "vikkudance0711": "Look beautiful ❤❤", "jcwritings_": "Inspiring content! ❤️", "ishreyashi": "\".. daughters of a nation that only wants fearless daughters in homes outside of their own\". Couldn't be more true. 👏 I admire you so much, Saloni.. I'm so grateful that we get to read your thoughts. ❤", "aanchal__kashyap": "@ayushbohara_140 you need to read this", "madangirikar_sailee": "Thank you. For this. For what you are doing. 🙏", "shivani_natholia": "your caption always take my heart ❤️ u don't need to speak out loud ur words r enough 🙏🏻 respect babe and u r every lovely word i could possibly think of❤️ and i feel if u see something different and beautiful in some one speak it 😊", "a.fugitive": "I liked your caption.", "__bhavyaaggarwal": "Her captions ! ♥♡ @__medhachaturvedi", "transformersameer": "Your caption gonna bring change to this world inshallah ☻❤", "potturii__": "Loving your thoughtsssss.😻", "_____k.sr": "i salute u and mainly ur thinking. Ur way of expressing ur thought are just mindblowing. hates off #you", "rkbahuja": "<3", "mtanyajh": "@nareshgarlapati1234 i really don't give a fuck what ever you think or say but I just had to say and before saying anything let me first tell you I am an indian ok an indian girl and I am not proud to be an india i fucking hate india you want to know why because of people like you and your cheap mentality you are saying her that she should be naked oh do you really allow us even to do that like I live in mumbai it is considered to be as the safest city but still I fear to wear shorts or something that makes me comfortable and I want to walk on roads wearing that but just because of your cheap minds and comments i can't and we girls can't here if we even show our bra strap you all men look at us at as a opportunity and you are telling her to be naked how like how I don't know what to say to you i feel so bad about your mother and father who raised a boy like you .. just because of your mentality we all are caged and getting raped is worse but being molested and feeling insure just because of you people is also worst .. i really don't need to know your opinion on my clothes but still you will comment still you will say bullshit and I really don't give a damm i know and I have accepted it that india will never change and it cannot be ever", "saloni_80987": "Damnnnnnn true🙌🙌👏👏👏🤐", "kunwar_rajdeep": "Picture talk babe 👌", "shivshi.tanushi": "@i_am_shivangian read d caption mst h n", "jeetendramehra": "Amazing as ever ! @redheadwayfarer", "_tomorrow_world": "I love you", "ibaadat_": "dis is wrong yar ....@redheadwayfarer", "kirankumari256": "I wish the world could be filled of more Saloni Chopras", "jassie0095": "👌👌👌👌👌👌", "zutire": "Beautiful 👌👌👌👌❤", "komalpreetkhullar": "It is all true! But our goddess are not Leo behind walls yaar! They have always fought when every man or devta couldn't fight anymore the devils... as they were the ones who actually saved the world in most cases when manpower was not enough what we say mans power is more than women's... all said really right but our goddess are the ones who save us from evils and they are near all of us protecting us and not kept behind walls though women are kept so is true... but it's the worst thing that we live Ina country where ppl go to mandir to worship Devi and then do all this...", "indian_barbie_doll1": "@aarzoo_vns22 everything she said is right ... but yar m not in favour of showing body ___its vryones opinion na 🙄🙄🙄🙄????", "sakilaapokharel": "❤", "mrs.niharikapuneetsingh2503": "Inspiring..... But how to change people's minds 😑", "btsjeon.kookie": "I'm a girl but also i'm saying this cause everybody have right to talk nd right to express their feelings....", "iamkushalhabibi": "@garimamittan99 society is improving... Stop acting like it isn't", "leena_bansal33": "'we take part in candle marches for someone else's daughter and yet we cage our own' 😍😍😍 .. ..Much love❤❤👏👏", "zainaliphotography": "❤️✌🏻️", "jagritiisingh": "@heryellowcamouflage28 See. if she come infront of you in this attire you'll be the first one to drool her boobs like you never seen one and judge her. So stop telling us how indian society has changed over time. The amount of rape every day in delhi and mumbai speaks itself. And this are the bad things she is taking stand for. atleast she i bold enough too put her image infront of the society to judge. Bold enough to say she ain't afraid of the society to judge her for the lifestyle she has. and inspiring other girls to be bold too. so shut the f up.", "iranianfalak": "This is wrong.", "harshita_mishra99": "❤", "moon7lunar": "Do what makes you feel empowered and free.... Naked or clothed....be happy and spread happiness.", "mikegasm_": "😍😍😍😍", "kumawatshikha": "I just love you Saloni. 😘😘😘", "maltimuchhadiyaaaaaaaaaaaaaaaa": "A lot Love..", "crimemastergogo06": "We may or may not be better than rest...one thing which we all should do is RESPECT...thanks @redheadwayfarer 😍🙏🏻", "rriteshpandey": "What is so bold about it.....", "shivansh.mishra3": "@simranjamal gender equality", "simranjamal": "@shivansh_mishra__ what", "aasshhiiq": "💚", "madmax10101": "Must not fap!!", "kanvi_prashar": "This is so well said! Kudos to you Saloni!❤❤", "svisheshta": "i just lov ur thoughts saloni...", "dishanandwanii": "@varmadeep You see a siren ...that screams?? She isn't screaming here..! She is the one who wants the change..and rather you say about the help which she provides to Indian woman is by writing her feelings out...You guys have always questioned about the changes she wants to bring in the Indian society...is obviously for our betterment! And taking upon the cleavage snap...it's her wish! \"A woman can be bold too\". Here no woman is nothing to offer to anyone... People have a thinking that woman is always their offer? I feel it's bullshit! Why would one offer? And going upon that grown up thing..that Mr. You need to be grown up ...be matured and rather respect woman and if possible ...be a part of the change! @redheadwayfarer You are doing the thing perfectly ! You have been always a role model for me! Thankyou!❤", "murchanachetia3": "This is really something.", "thewastedpage": "Free the nipples😍 @freethenipples", "shravya_vaishu": "@disha_nandwani10 😯but why our parents and society start giving lecture that we are insulting our culture and breaking the norms. ? I think nt only the males even ppl of our same gender and family itself can't handle boldness.😣they divert the liberty topic to the \"izzath mitti mein milane wali\"beti.", "naved_s_nightingale": "Your name is enough to describe what u are.....! Love you soloni🎶😘😘😘😘😘😘😘", "_namaslayyy__": "You always slay! I just love the way you are. 😘", "the_gods_child_": "Kya ho gya hai is ldki ko", "carol2896": "❤", "sunshine_aru": "@swati_sharma7 .......", "rineffable_": "You ain't wrong but you're going too far from the topic and too against this society. This society has improved a lot and will continue to do so, just give some time. I wonder what if you will sit at Juhu beach in this attire , if you want a do so, you'll be doing what you say. If you can't, I'm sorry but all this will go to waste. Rather, practise and take actions against the bad things happening. These captions would surely inspire people but somehow you are contradicting yourself by te pictures and the captions.", "_khushi__singh": "Caption ❤❤!! Omg u r such a inspiration !😱💙", "ridhima_tripathi": "@redheadwayfarer Ur words.. 👍 excellent .. n I know that this post will definitely make a difference may not today but one day it will ..", "jo_joy_jyo": "@mandhara_bellur look @ this!", "keval_official": "Fuck..... look at that caption man... u should be an author", "akan.k.sha1.0": "U just alwzxxxx slayssss @redheadwayfarer 🙌🙌🙌🙌", "arfainnnnn": "This is beautiful😍", "jsprt_k": "Here in India people have more interest in watching what other people do rather than concentrating on their own work. That is the reason india is far behind than other countries. The narrow mindedness of Indian people really sucks! Hats off to you girl!! Keep going!", "pank2107": "Bare it all who stops u .....", "amitdudani": "Saloni you nailed it with these words.. @redheadwayfarer 🙏 I father a GIRL child and sometimes fear this SO called MALE's filled with lust and greed.", "naveen.raj.9216": "💓💞💞💜💔💔💜💜💞💓💞💞💞💞💞💓💓💞💕💕💕💕", "anand_jasmeet": "The magic of ur words😇 truly longlasting🙌 hope this would help in changing the narrow mentalities too !!", "welcometothejungle2021": "🌈🌈🌈🌈🌈thoughts🔥🔥🔥🔥🔥", "palak_jethani": "@jsprt_ so true", "shantnu_14": "@heryellowcamouflage28 now this one was nice....well said", "rahulks111": "Will look more good without it...Naa... Exactly", "_khantooba_": "Excellent. I love the line that says :: ur pleasure, my shame. It so well defines the pathetic MCP oriented nation.", "gaganjaggi_": "@_muskaaan___ caption.", "zzakiii": "💯", "lakshitverma_12": "Hatss off!!! @redheadwayfarer", "abhijeetdubey95": "❤️❤️", "mostlyangrylol": "@utopian_alice @shubhra_sinha11 @prachi_515 @vanshiii_27 👌", "swati_makkar01": "Proud of you..", "bhavina.g": "@heryellowcamouflage28 just because it's not happening around you doesnt mean its not happening at all", "hopelesslycrazyy": "@garimamittan99 I think what @heryellowcamouflage28 is trying to say is she respects saloni for what she is doing but it isn't actually helping many...I mean yaa it is inspiring many people but there is no change ....no girl is going to sit in juhu beach today in a bikini just because she read this right....nothing is changing....people get inspired n then forget .....words r powerful but should be used at the right place at the right time.....I respect saloni n even idolize her....but her writings r not known by many so it isn't exactly helping,.....no hate", "yuvrajyadav_07": "Wtf anything u upload😡", "abhijeet_mahat0": "Really ! Di .... It's so much ironic .... we take part in candle marches which are held all over the country ... we call them fearless with so much pride .... but their families only feel ashamed to adopt her .... our very own society judge her ... Not only this, they say that she was raped because she was out of her house at late night ... Seriously, is this our culture ?? ... proud of you ! Di ... #loveyoudi :) :-* :-* @redheadwayfarer", "tanvibadala": "@riddhiiborse nailed it🙌🙌🙌", "shundes": "Abaya pehno toh problem!! Jeans pehno toh problm!! Salwar suit pehno toh problem!! Skirts aur shorts ki toh baat hi ni h!!! Log chahe kitne b modern kyu na hojayein mentality voi cheap rahe gi!! So I think @redheadwayfarer ap bilkul sahi jaa rahe ho!!! 🖒 you are real inspiration!💗❤", "bellatrix.vv": "👏👏👏", "_crazy._.chaos_": "Super awesome post..Really highly influencing..😘😘", "moteganesh8": "Post whatever you no one is Going to change ok and the people who respect you and they dont want look like this, and people make fun this pictures ok whatever your thought are awesome but not like this.... think for other idea good luck☺☺☺@redheadwayfarer", "itspriyanka__x": "YOU NAILED IT MAN👏👏👏", "monica27sharma": "Well said Saloni👍 @redheadwayfarer", "manishh.bora": "More power to u and every women.🔥🔥..were r with u", "raman_kumar_official": "Accept the people and situation as they are.", "santo_shh": "#freethenipple", "deeksha_middha13": "Hey @redheadwayfarer . I have been reading your posts for quite a long time now . I just want to tell you that please don't listen to any negative things what people say .just be who you are becuse there is no one who can be you. Keep up the good work . #proud ❤", "goatshorn": "Stay strong and liberated. ❤️", "dhatriupadhyay_": "I want more and more people to be like you . .. even i also want to kick these bigot people from our country ..but there are many .. 😒 I wish you luck honey .. you are totally on a right track ..❤❤", "vedha__229": "Empowerement 😘😘 hats off to u mam......", "chinraddi": "@heryellowcamouflage28 👍👍 go girl!", "guptarahul97480": "Captions 👏👏👌👌 Hatsoff 😊 @redheadwayfarer", "kaushik95v": "Nooo offence bt ek baat batao??? If womens wanna be bold strng ...i know dey r bt y all we ppl both men n women demand fr a rule which wld hlp the womens....n cmng to wat n how guys look at a grl is up to their wish u cant force ny1 to not look at u...", "adityagurjar9": "Expose ki kya jarrut", "hetal.patel26": "🙌🙌🙌", "amolgaikwad__": "I m big fan of you", "__chao_rituraj_gogoi__": "naked hi rehna fir😂", "thebadhiyaabob": "U rock @redheadwayfarer ✌✌", "_duttadiya_": "Best best best ❤❤❤❤❤", "_prakritikhanal": "@nareshgarlapati1234 And look, you even categorized the picture as \"vulgar\". That makes you a Stud now with NO SHAME AT ALL!", "impushpendra1": "Well said👍", "doshiviral58": "Well said 👌👌", "ritesh_241": "So.. Hot Look 😙😍", "shubhamjamwal199": "👌🔥🔥🔥🔥😘", "angryindiangoddess": "💜💜", "rahiee6_drdz": "That's Why I just love you.... for what you are ❤✌👌 what uhhh write is true n perfect ✌👌 love uhhh ❤ @redheadwayfarer Fearless ❤ well said 👏👏👏👏 ily 😘💯", "aastha.agrawal93": "😊 nothing to say just smile....hats off mam you have to guts to say right thing .....I love you mam you are inspired me ... thank you so much", "sagarika_sengupta": "Yes. Whatever you wrote is right and I am one of that girl who preaches about equality. But what about those men whose vision never changes? May it be a salwar kameez or a bikini, there eyes will somehow land on our breasts as if we want those physical part of ours to catch their attention! Problem isn't with dress but the people around us. Wear a shorts and roam in the street none of the boys would spare us. Again we can't do anything fearing our physical strength would fail infront of theirs and above all those who promise us for giving us our rights hide themselves under the blanket of money. The entire country lack backs not because of our dresses but because of corruption everything. Every crime is related. I wonder when things would change!", "pooja.sinha_": "@redheadwayfarer i adore you...i wish their were more women like you in our society 😘 #RESPECT .. plz continue posting such amazing and inspiration post", "vikrammehta934": "More", "ruchika_kohaal": "@redheadwayfarer :: powerful words nd true.... I think being different,going against the grain of society .. it's an incredible thing ... #gogal ❣️", "santosh_kumar_shaw_": "......", "mehwish_khan30": "👌👏👏👏👏", "stalkwithakira": "@sahiltalwar94 read this", "butter_chickkken": "you're soooo awesome. makes me wanna cry sometimes....i'm 16 and i feel like i really connect to your words...love ya😘😘 keep up the kickass work💯", "shamxdwi": "You're the best.", "prathamsatalkar": "Ahh Everytime I read your post it gives me food for thought. Your posts are always on target and precise to the point. I personally feel something went wrong in our evolution process. We were far better in Stone age where everyone were equals and no one judged you for anything. You absolutely nailed it girl . Keep writing and keep inspiring your followers.", "_just.acutestuff_": "I love you for what you are and what you write 👌💕💕 #fearless 😘 @redheadwayfarer", "goswami1987": "Well said👏👏", "hansoloandsoami": "😍😍😍😍", "sandiprock99": "Love you", "dheeraj_saini_": "🙏🙏🙏🙏", "devashish09": "More power to you 👍 @redheadwayfarer", "divya.pande": "@redheadwayfarer Just too good. Spoke our heart out. Way to go!❤❤", "elana786_1995": "👏 👏 👏 👏", "vimal.chaudhary.9": "😱😱😱😱", "notanyrandomgirl": "You Go Girl!! Keep writing and one day everyone will understand what you want to say😘💯@redheadwayfarer", "_iam_atish_": "Caption.. Caption.. Caption..", "kunal_sagguu": "😻😻", "deepankartyagi1": "I'll respect someone if they don't expose or even if they do... Respect has nothing to do with exposing ...", "kajal29_sankhla": "Great......😊", "thelifelover_anil": "😔😔😔😔😔 nd u still think people of our country think like this. I work in an educational Institute. I feel so proud when father from poor background comes nd visit us nd say , sir let my daughter to study in good college . 😊😊😊😊 it feels so proud that acctually there is no diffrence between girls nd boys in todays world , atleast in surround of me.", "amour_rihu": "u r tooo ryttttt😘😘😘😘", "_kanishksaini_": "Very well said 👌", "kunal.bedi06": "🦅", "_sharmananahi": "More power to you girl!", "_muskaaaan16": "I swear. You write so well. You're the inspiration for me. Yes , inspiration for me. All your write ups are just amazing and heart touching. Well described and so on. Even I also loves to write. There are many things I do need to learn it from you. Yes I will. Claps for this. ❤", "ll_ambivert_ll": "@moon_nd_back7 agreed! Ma'am kudos @redheadwayfarer ❤❤❤💪💪💪💪💪", "dee___nah": "Yea true👏👏salute to you😊", "iam_.ar": "@shubham.deshmukh1717 Do read the whole thing. It might be for you.", "raghhavsinha": "You are magical @redheadwayfarer ❤", "bhumika_rajguru": "You are a warrior girl❤", "kshitijmayekar": "Well said👍", "nidhi_bele": "The article is Amazing! But what about hunkaar magazine m", "gaurvimalhotraa": "You always make us speechless 😆😆💍💍💍💍💝💝💝. Such an inspiration💞💞😭😭😭", "shubhu0017": "Killing look osm snap fabulous"}