{"rajniiiiiii14": "😍😘😘", "notsahara._": "Get well soon Nani Chopra❤️", "_yuvs96_": "i hope she gets super well soon!", "style_sutra": "She ll be fine soon... u r such a nice person v pray", "abiii.naya": "Yes.. So will get well soon... For all ur love.. She will :)", "sardarsingh1": "God blessed her", "saga_18317": "Get well soon Nani Chopra ❤ N wish you happiesttttt b'day !!", "_vivacious_soul_": "Nani chopra get well soon❤we love you n wish u happy birthday....may u live long...God bless💛", "pdeepikaprabhu": "Get well.soon Nani Chopra!! Love you..you are one sweet Nani😄", "the_anon_damsel": "Get well soon...lots of luv...😘😘😘😘😘😘", "rituajwani": "May she recover as soon as possible❤😘", "aggarwal.shrishti": "Nani.... Jldi s thk ho jaaooo.....love u", "jeetendramehra": "NaniKapoor will be fine soon...don't worry @redheadwayfarer ...I will start my Shiva jaap for her recovery tonight only....not to worry...we love Her and we love u as well !", "bhupinderkaur": "Happy birthday nani😊", "demure_ady": "Happiest birthday to your nani. May she gets well soon. Don't worry our prayers and blessings are always with your family. (Nam myoho renge kyo) keep chanting this. And see the wonders.", "soully_yogi": "Reminds me of my grandmother❤ may she be healthy really soon, lots of love and prayers for her 👼", "aarya_10_12": "She will be fine❤", "shaggssalmania": "Jaldi thik ho jao Nanichopra", "ankitanerd111": "I pray for her speedy recovery.. ❤️❤️ @redheadwayfarer", "varnika_g": "get well soon DEAR #NANICHOPRA", "natashaaajwani": "Nani you are a great fighter & that's how you made your grand daughter also! To see you in pain is the worst thing in this world because you are no less than my own Nani❤ I haven't seen even her picture from last 15 years but I found her in you❤ Nani you are one of the purest soul of this world who is spreading so much positivity around. Your smile can make us smile & your pain makes us feel that pain. Nani you know there is something is you a kind of spark which is just so beautiful that it makes me feel peaceful. Nani I know the prayers have a huge power & your core strength is no less! You have a powerful soul & I know you will be perfectly find very soon! Nani I love you to the moon & back & these are not just words I really mean it. Get Well Soon Nani🙏 My love & prayers are always there for you!", "shubhahahahaha": "She ll be absolutely fine 💚", "zeeya_suryavanshi": "i ll pray for her for her long long n healthy lyf i also love ma nani i have also spent ma whole childhood wid her bt shez no more bt i ll pray to god ki aapki nani hamesha rahe wid u😘😇", "rhxamall": "❤️❤️❤️❤️", "lifeinmesssssss": "Dear Nani(our cutest nanichopra❤👱) I HV seen u many times since salonee di went Australia 😃 and I feel u r very strong so u will b allright own and I feel u r cute 💕 more then ma Nani plzz get well soon and celebrate ur 81st bday🎂🍫🎈🎈🎉🎊🎁 love uuu Soo much and also love u @redheadwayfarer 💕💕", "elysian__me": "Get well soon Nani❤❤", "that_piscean_girl_": "She will get fine very soon💝", "my_unseen_thoughts": "She is the coolest person and who needs a life partner when u have nani chopra as a partner-in-crimes. Now i understood how saloni became so strong , because she has a super nani in her life. And our super woman will soon come live on Instagram and i am waiting to see her. @redheadwayfarer u r so lucky to have her and i am a bit jealous of u now. Love to nani chopra😗", "fiza_batra": "She is amazingly loving and caring!! She totally describes where the fighter in you comes from! Get well soon nani chopra because this instagram account can't go without you!!! And yea, remember, you are far more cool and pretty then your daughter or grand daughter!", "__ritika8__": "She is soooo soooooooo adorably cute and happy go lucky kinda Nani....we love her for enlightening your story wall on Instagram :-P ... also the way she poses for photos promoting her own swag :-P lots and lots of love to her❤", "sharu.ramesh": "She'll be fit and healthier than ever before.. ❤ god bless her always.. She'll be alright in no time.", "udayrajveersingh77": "Wishing nani speedy recovery god bless", "dikshaahuja_": "❤❤❤", "_sunshine_01_07": "Haappiiesssttt bday nani chopra n wishing u a speedy recovery 💚", "_simrit_15": "Wishing you a speedy recovery nani chopra...💖", "universe_quinn": "God bless her with good health. Get well soon.😊", "prashanth.gangadharan": "God bless. She will be healthy very soon❤ loads of love!", "sakshi_joshi_03": "I prayed for Nani chopra i luv her alot n i always see ur story just to see Nani chopra once ... She reminds me of my grandma dont worry she will be fine soon .. Get well soon Nani chopra I want to see u again 😘 n u also cheer up Saloni dii she will fine 😘😘@redheadwayfarer", "cheshta_vohra": "God bless her❤she will be alright.", "komalishq78": "God bless", "the_eternal_eye_speaking_": "We love the way Naani chopra raised you and your mother. Giving the lessons of ultimate freedom and goodness and justice. She's beautiful inside out...☺", "queen_of_monsters_nidhi": "Diiiii i never see my dad my grandpa grandma nani ma nana ji but ehenevr i see nani ji i have alwyz tears on my eyes that u r lucky nd i love nani jii soooooo mumy my god give her looong life god bless her with best health nd smile i knw she wll get wll soon bcz she have tooo!! Happyyy bdy too naniii jiiiiiii🎂 @redheadwayfarer", "bing_sparks": "She will get well veryyyy soonnnnn.", "koualwaysflying_": "She will be fine dont worry", "kiara_khushi": "True blessings, may she be blessed", "mariyafatima867": "Happy birthday nani ...get well soooooon ❤❤❤ give a kiss from my side plz", "zazencandles": "Hope she feels better soon. Stay positive and strong. Some chanting will help, do try that. Birthday wishes to her 🎂💐🎁🎈 God bless. X", "kay_dinani00": "I remember the one i had.. she was the one i loved the most in this world. I wish your nani ( nani chopra xD ) a very happy and healthy birthday.. i pray you get all the super powers to energize and rock the world..", "manisha.2303": "I hope she gets well soon.. my prayers", "yourpriyahpriyanka": "I luv u nani chopra❤ u r very cute and innocent. I hope that u get well soon. And a very very happy birthday.", "shailja_dadhich": "Get well soon nani Chopra❤😘", "yashiraj786": "happy birthday nani chopra..💖 love uh alot and get well soon!!!", "aayushiraj18": "Happy birthday nani Chopra..don't worry @redheadwayfarer she will be okay!😊", "rakeshs9621": "Happy birthday dear grandma.....Get well soon.....Plz,,", "natkhat.neeharika": "God bless her. ❤", "mas_lin_": "Nani chopra will be just fine. May allah bless her with healthy life💞💞", "manan8789": "She will be perfectly fine.. Don't worry at all... 😇😇😇 @redheadwayfarer", "walkingwithyouinlove": "Aww she'll be better soooon! InshaAllah!", "mahima_girajsar_singh": "Tell her she's very cute! And I loved her from the very first video where she opened the gate. \"oyee\".. She's savage.. I could imagine how she would have been 40 years ago. Do share her pictures from when she was young would love to see that..I dont have any of my grandparents in my life now,lost them when I was a child but she is the perfect image of how they would have been if they were alive..😊 She's a rockstar 💗 have a happy birthday nani chopra 😘", "tvishasethi": "Don't worry everything will be fine...she's made you so strong I'm sure she's stronger herself...happy bday to her❤❤", "317ms": "Happiest birthday to the coolest nani chopra... Whenever i see her videos with you i remember my nani who. Lives far away... Nd when i see her videos i think like my nani is with me... I think she's cutest nani one can get.... @redheadwayfarer ... Hope she gets better soon lots of love to nani chopra nd happy birthday nani❤💝", "almostfammous": "She will be fine ! I saw her in a video ! So full of life ! . Wish her a speedy recovery ! Waiting to see more videos with Nani Chopra ! God bless !", "pri6797": "Get well soon nani", "chef_aastha1188": "She will b 5n vry soon dont worry our prayers will b heard t.c", "dec_son": "Get well soon nani", "bhawna_gothwal19": "N yes happy Birthday to you ❤ say this to her from my side😘 with a kiss 💞", "ishika7426": "Happy birthday nani❤❤ you will be fine soon....and I want to hear Tina beta in next vedio of yours😂😂...i love you nani.😍😍❤❤ you are rockstar and fighter....tina beta tum tension na lo nani bohot brave hai tc", "reshma_manjunath": "❤️", "bhavik__k": "I wish her happy birthday 🎂 and speedy recovery.....👍 Everything gonna b alright", "kushangi_kumar": "Happy birthday Nani Chopra.... God bless u nd give all d happiness u deserve... specifically i love u because I always wanted a person like u in my life as u r always supporting and love ur grand daughter so much that whenever I see ur videos with her it always touched my heart nd I can understand ur feelings right now #readheadwayfarer as somewhere I'm feeling d same as I feel connected to her... I'm sending all my love nd hugs for u...stay same..😘😘😘", "all_in_one_store_66": "Happy birthday ❤😘 Nani #nanichopra get well soon...👍", "prityk757": "Get well soon nani..", "its_mamtasharma": "Happy birthday Nani Chopra ❤ get well soon❤", "nareshhh_09_": "She will get well soon, I pray for God...😍😘❤❣ #nani_chopra", "portraitofanage": "I love how she has carried her innocence right from her childhood into oldage. I love how childlike and pure she is. ❤", "_b.h.a.v.e.s.h_": "Hope she gets better", "mini.meoww": "Get well soon nanu 💗", "mrs.niharikapuneetsingh2503": "🌸🌸🌸💐💐may God give her strength", "deepanjalidmishra": "Her swag😌🌈 her cutenesssss😭❤", "anupriya_singh12": "She'll be fine soon god bless her and happy birthday to her..❤️🌷", "dec_ember_31": "Happy Birthday Nani Chopra ... get well soon ..", "catch_the_ordinary_gal": "May God bless her with health n strength.. Loads of love n pray for her... And a very happy birthday naani Ji.. :)", "irememberwhatyousaid": "Lookin at her always reminds me of my granny 😌.. Nani ll be Fine very soon! I will pray fr her @redheadwayfarer SO DON'T Ü WORRY! ❤❤", "thelifelover_anil": "😳😣 nani choora😐😐 get well soon", "meghna._.gupta": "Wish her health ♡", "noelalexiouse": "Happy birthday to naani ji. God bless her and give her good health n strength. 👏👏😊😊😊😊", "_snehastagram_": "Haaaappyyyy Birthday #NaniChopra ! U're the coolest as well as the sweetest nani on earth !! Keep smiling with that spark in ur eyes .. Stay happy with that zeal within Urself !! Haaaappyyyy Birthday again nani !! God bless u with nothing but the best for u .. get well soon !! 😊😊😊😊 Sending away all the love n hugs for u !!", "d_doll_j": "@readheadwayfarer I can understand exactly how you are feeling 😞...but you're lucky enough that you are right there with her..to look after her ♥...she be all fine soon and super cool back again😍 a very happy birthday to Nani😘😘🎂", "yashika_hayaran": "Happy birthday to you, Nani Chopra. 🎈🎂💚🎊 Get Well Soon 🌷🌌💕 sending many happy and positive vibes!! 💞😙😊", "pmr2603": "In this type of situation you have tym for this things😕", "dayy_vaan_shay": "Wishing #nanichopra a very happy birthday. May she get back in the best of her health very soon and remain so for the times to come. I will pray for her speedy recovery and brightest life. Lots and lots of love and best wishes to Nani and you. ❤", "happysoul0_94": "Happy Birthday Nani...she is full of life..i love to watch Your insta stories jst becoz of nani she is jst lovely... Get well soon Nani...😘😘👑 missing You on insta stories...", "neemakoche": "Nani Chopra is thr cutest kid 😄😘 May God Bless her! Get well soon nani🤗", "anupamasasikumar": "Nanichopra u reminds me my own nani.....we r missing u on insta...happy birthday💖💖 get well soon nd come back with lots of energy....nd tina beta dhyan rkhnaa humari nani ka", "gaur_geous": "She understands you an support you in your madness #nanigoals @redheadwayfarer", "psygalaxxy": "Seeing her it reminds me my granny...😞.... nani ll be fine.... ll pray for her @redheadwayfarer tc", "min_akshii": "I lost my Nani few years back but I also got a Nani(nani Chopra) few days back. I wish her a healthy birthday. 😘🤗 @redheadwayfarer", "anusha_.h": "Lately she was our favest, Trust me i hope n will she get well rrally soon and stol scolding u fr ut stories all over againnn nani chopra we love you so much happyy 81st take caree @redheadwayfarer ❤❤❤", "pulkitarora8": "Happy birthday", "shruti_____mishra": "Get well soon nani chopra💖 ..u be the cutest💖get well soon 😍we want to see you fit and healthy 😍take care💖", "chikuag": "Happy bday to u nanni...U r awesome and grew up one of the most unwanted daughter in this world(Sarcastically) who is fighting for others.Love u nanni so gd emotions u hve", "muskan_gupta19": "Nani you are like a yarn who spreads it's thread and keep everyone together and the strength of your thread is strong enough to withstand everything. You are so beautiful with your wrinkles signifying your experience and all the obstacles that you crossed , your white snow hair representing how beauty lies in white and how brightly it shines like the full moon in the night sky and yes of course your smile that sparkles your eyes and it's so infectious that even I feel like smiling , I pray this smile never vanishes from your beautiful face . Happy birthday ♥️ from random stranger who admires your strength and amazing personality . Get well soon .", "navigatio05": "Get well soon nani, you are a rockstar .im so sure ull be healthy soon. God bless you .loadzzz of love n hugs ..happy birthday 😘😘", "mayaranveer": "Happy birth day nani....dont worry my dear she i ll be k soon......", "sanjeela_lamapradhan": "Prayin for granny's speedy recovery n a very Happy 81st birthday to Her...... May almighty God gives Her strength to conquer evry obstacles in lyf.... N May Granny live longer.....", "shivangidasgupta": "Happy birthday Nani 💖😘 You are very caring and cute😘 @redheadwayfarer you're very lucky to have her in your life ... Get well soon Nani ❤ we love you.", "anushkapraveen09": "Nani chopra is the cutest and the most adorable person.. u may get a lot of these usual comments but seriously never have I seen a person so cool. The expressions she gives in your stories. ..epic! Such a tech savvy nani you've got ! Lucky u saloni didi. Wish her a happy birthday and I'll pray for her well being...because on a selfish side...I'd love to see more of her in ur stories and posts cause she be the cutest. Happy birthday Nani Chopra 😍💜💜", "avni131": "Happy birthday #nanichopra... Get well soon 💐💐", "mansi_katiyar_": "@redheadwayfarer I have prayed for her. She'll be fit and fine soon. May she get well really soon", "swetha_sharmaa": "#nanichopra💟 you are gonna bounce back with all the energy n grace you have always had ! You are my favorite ! I love it when @redheadwayfarer 's insta story is all about you and her ! Super warm hug to you ! Happiest Birthday to The most loveliest Nani !kissy to your forehead😘 @redheadwayfarer She is gonna be super fine with your presence cuz you posses super positive energy ! All prayers with you Nanilove ❤", "sveta__0912": "🙏get well soon nani ❤️❤️", "blue_head_way_farer": "I love her kindness,I love her cuteness....she is so cute....... happy birthday Nani @redheadwayfarer", "jenesia_steffi": "Get well soon nani😘😘happy bdy😙😙lots of love", "akarshkasture": "@redheadwayfarer Give her colourful ballons or a beautiful sari as a bday gift n cake n she will forget for a moment that she is in hospital", "dishaa__12": "Happy Birthday🎈🎉🎁 Super adorable NANI chopra ❤❤❤ love you 💋", "sejal.singh.904": "She is just amazing and cool Nani ever I have seen #nanichopra is the best love u Nani stay the same and a very happy walla B-day to you nani tight hugs mwahhhh...😘😘😘💜💜💜💜👵👵", "impushpendra1": "Get well soon n happy birthday Nani..", "lil___angel0": "Get well soon nani ji i luv you ❤ happy birthday nani 🎂 god bless you :-)", "pra_tik_4u": "Dear.. Whenever i see any of your post with your Nani it makes my day. I really want to pray for her. She will get well sooner.. wish her very happy birthday.", "ayushi_gogoi": "Happy birthday. Adorable Nani 😭😭😭😭 get well soon .", "22nupur": "Nani u are blessed that your granddaughter is such a nice woman and does every possible thing to uplift women and to change the mentality of people. Get well soon nani and happy birthday in advance :)", "kmani786": "Loads of hugs and love to you guys. A very happy birthday to #nanichopra 😍", "swarnaahlawat": "Lots of love , blessings, and hugs to nani♥️", "stranger_foodie_97": "Happy birthday Nani. Get well soon. Lots of love. Gbu.", "pundhir_avi": "Wishing ur nani a very happy birthday...🎂🎈 plz tell her tht she is really cute n adorable... n i love her... may she get well soon 😊❤ @redheadwayfarer", "lazy_lizii": "Happy everyday to aayi(nani in oriya)... Aayi is always the most pampered babe in someone's life... she is always the cutest and very precious tho... lots of love nani chopra 💛 GET WELL SOON 💐", "callravi": "I know how special Grannys are. I was very close to mine. I left a high paying job and spent 8 months in a hospital with her because her 7 children couldn't spend time with her as they were busy in their own lives. It's been 13 years since she become one of my guiding angels up above, but her memories keeps me going. Will remember your grandma in my prayers, @redheadwayfarer. Rab rakha!", "_hersheys_": "Hello Nani. I'll tell you something today. I lost my dadi 3 weeks back. Since then, things have been quite different at home. She was 80 as well. Thereafter, whenever I saw an old lady, my eyes would start filling with tears(it's natural, right?). But trust me, the moment I saw Saloni Didi's videos and pictures with you, my face had been lighted up by a wide smile. I love the relationships you guys share. Happy birthday Nani! You are a beautiful lady! Saloni didi is so lucky to have you. Get well soon. I pray for you to remain healthy and happy for many more years!❤️@redheadwayfarer please read this out to her.", "prerna__16": "She'll b f9 soon 😊", "that_brown.girl._": "🙏🏻", "akanksha_21st": "Every grandmother 👵 is really special. They act like a shield with mummy is shouting at me. They are always on ur side no matter what.", "riyapoddar195": "happy birthdy nani....get well soon...🙇 loveuhlods", "stylesavitri": "She'll be fine. More strength and power to her ❤️ . God bless lovely Nani 😘", "kunika_24": "❤", "nemophilist______": "Get well soon Nani😢 and many many happy returns of the day😊 May God bless you always", "jigs_784": "Get well soon ..", "smrnchandra": "This took me back to the time when my grandmother was struggling for her but unfortunately she's not with us anymore, and I miss her everyday. But I wish that your grandmother gets better and better. And trust me she will caresses you like she used to. Take care. Lots of love. ❤", "shraddhawhatshraddhawho": "Nani Chopra is the coolest Nani ever!💟 love her soooo much😍😍 and also HAPPY BIRTHDAY NANI!💋", "nidhitomar03": "Annnnd happiest birthday Nani😁", "2.99e8": "Hope to see her well soon with u in ur stories 😀", "yakang_hage": "Nani ji please get well soon...", "ibrownwomania": "Nani get well soon...!! And make a video with @redheadwayfarer didi .. I love you nani.. you always remind me of my nani.. You are awesome just get well soon and take proper rest and eat ache se khana.. lub you ..hun jaldi se uth k saloni didi ko dant lagao ki\" tu phone pe hi lagi rehti h\"😍😘", "hrishika_35": "Nani Chopra reminds me so much of my grandma! I love her...I hope she gets well soon..and may the mighty shower all His blessings upon her!! And happiest birthday to the coolest dadi!! Lots of love❤", "priyarubysingh": "❤", "puja__sahani": "Wishing you a day that is as special in every way as you are! ...Happy birthday nani chopra....you r really so cute..get well soon...❤️❤️❤️❤️❤️❤️❤️", "the_letter_of_my_heart": "Get well soon grandma . We all need you 💐💐", "aaradiaa_": "Get well soon granny..nd wish u a beautiful birthday..nd to the wish that u get many more beautiful nd loving ones ahead..", "saltybuttercup": "Get well soon nani chopra 😇", "uvashree_mahadevan": "She is one of the most beautiful and amazingly loveable person I've come across. The way she cuts you off in the middle and says something that's so hilarious and profound at the same time just makes me wonder how sensible a person can be❤ she makes most of our lives colourful and hopeful. When life has tired us out already, she is 81 and inspires us to fight till the end with the same amount of humour and wit! @redheadwayfarer she is gold. She is that shining star that can brighten up the whole world! I'm glad she is fine! Get well soon nani and happiest birthday ❤ hoping to meet you soon when you come to Mumbai 💜", "swatikrish6306": "Nani chopra will be okay ... she has a long life to go 😘😘😘😘😘😘😘😘😘😘😘😘😘", "p_achii_d": "❤", "ramyasri.m": "Convey my birthday wishes to Nani Chopra @redheadwayfarer .She will be absolutely fine.We will pray for her :)", "anujadandekar": "Abhi toh aapko kaafi saare birthdays celebrate karne hai nani ❤", "sakilaapokharel": "She definitely will get well veryy soon. We love her. Happy birthday nani❤", "khushii_kh": "nani chopra... ap jaldi sa sahi ho jao and Happy Birthday Nahi.... ❤❤❤", "beedeesaha": "It's really heartbreaking.. When such things happen.. But surely she will be well.. God be with her..", "the.troublemakerr": "Her \"abhi tk phone pe h\" wale comments are my favourite 💖💖", "vidushi.agarwal": "She'll get well soon.😇", "harman_hanspal___": "She will be fine soon.... And I know everyone will pray ... All the blessings💖", "_athenaroy_": "Happy birthday nani", "shreedharapurohit": "Vo jldi se theek ho jaegi.. hv faith..", "p.a.l.a.k_._": "nani chopra is sooo cute... best nani ever", "khusbukhanall": "Happy birthday to Nani Chopra ,she's so cute hope she gets well soon", "shivani.jain.334": "😇🙏💪🏻", "xyz020887": "Our prayers with her!", "akankshas01": "Nani Chopra is the coolest granny in the world. Get well soon! 😄", "theshivanisodagam": "It's my Birthday too Nani , I need your blessings❤️ Please Get well Soon.", "ma_ansi": "A very happy and healthiest birthday nani 😘 wish to see you real soon scolding saloni for no reason i actually admire the bond that you both share its so mesmerizing💜 #getwellsoon", "sakshi_mishra_05": "Happy Birthday Nani Chopra🎂🎂💐...... Get well soon😘😘😘", "__hemapuri__": "HBD nani she'll be fine soon 😘", "diksha_rajwar": "Happy Birthday Nani Chopra.. Get well nd healthy soon wanna see ur posts with saloni everyday scolding nd ur cute poses. .. God bless you... Get much better on ur B-Day.. 😊😇😇", "memiss__eye": "Nani ❤️ aap jldi se thik ho jayiye🙏🏻 ... Abhi to aapko 100 cross krna h ... These lines i said to my nani too when she was ill. And she is fine now. To me my nani is my life. I love her a lot. And i love you Nani chopra ❤️ aap boot cute h ...", "nitin_aston77": "Happy bdy Nani chopra ... jaldi se sahi ho jao ap ... get welll soon nd we love ❤️ u nani.....", "satarupa_choudhury": "Whenever @redheadwayfarer posts her videos, i get a glance of my own granny 😐 who is at peace somewhere else.. I really enjoy watching her. She paints,knits and does boomerang too. She is adorable. Get well soon #nanichopra. Love you ❤❤", "im_marcydearaujo": "Wish nani on ma behalf 💚💖💖. .n she'll be fine dw 😘😘 I love u nani ☺", "dushyant_kalia": "She is hands down the coolest lady I've ever seen in my life!!! A very very Happy Birthday to the lady of my dreams #nanichopra #nanichoprarocks🙌", "susmee_": "Your nani reminds me of my grandmother who's so innocent and love me so much.❤ your nani is so cute.. happy birthday nani chopra😙", "arya______kashyap": "And please dont worry .. She will be more better...we are all praying for her ...xoxo❤", "girl_in_the_cityy": "Praying for her. Don't worry she will be fine. God is with her. Don't worry @redheadwayfarer", "fairlyhelen": "❤️", "priyankabam8716": "She will be fine ..", "aditika_0402": "He'll be fine😃🙏", "shanky_1002": "Get well soon aunty!! 😇", "_sreeramya_": "❤", "saanjh_gidwani": "I just love the way she has raised your mom and you. Somewhere even she's the reason of your being so powerful,so bold. And the most important thing I love about her is that they don't give you the typical girly reasons for you to sit properly in shorts. (she told you k keedaa na ghuss jaaye😁) I just pray,oh God!shift her from darkness to light. And we all are God's property.No harmful thing can touch us. This time will also pass away. Don't worry girl😚", "the.gsd": "❤️", "norak2396": "Happy birthday to NANI #NaniChopra @redheadwayfarer", "mehak.bhasin": "I too have a cute nani like her n she's suffering from paralysis 🙈 we both share a very sweet bond. She's recovering too, slowly though. Nani chopri and yours bond reminds me of her and mine bond only n this is the most pure bond ❤❤ She'll recover soon 💋 n a very happy birthday to Cute NaniChopra 🌹🎈", "francesca.mcmillan": "Sending my love to you xxx I know the feeling sitting in the hospital room with your pillar of strength xxx", "zzakiii": "🙏", "neharikaaa_": "Happiest birthday ever to NANI CHOPRA.💜👅 She is very cute and it doesn't seems that she has turned 81,After all she looks so young! 😸😻 After being in 80s she is such a good learner of modern technology.💖 Hope her health remains well and the old, funny, jolly and cute Nani Chopra us back again. 😍😘 With lots and lots of love!. 😻😍😘💖 @redheadwayfarer", "iamritika_roy": "❤💚💛💝💙", "samreen_shadab": "A very very Happy Birthday 🎈", "maitri_khurana": "I love the way she speaks punjabi and scolds u so innocently and also that she never forgot her desh ki mitti😅😌❤❤❤❤❤❤@redheadwayfarer btw just give her hug flooded of blessings for good health in future!!!!", "souradeepbas": "She will be fine", "anumtanveer12": "Hoping she gets well soon #AllTheBest #MyPrayersForHer", "king_khan_33": "Happy birthday nani ... your the best nani in the world...", "madhviivats": "@redheadwayfarer Happy birthday to her ...❤️ whenever yu post somthing wid her .. 💙ur bonding seems so adorable...😍😍😍 she'll get well soon.. dont wrry.. nd i want her to be wid yu for many more years ahead.. 😇😇 lots of love..😘😘😘", "itsnotleen": "Happy Birthday to the most beautiful Nani Chopra. I just love watching all the stories of you and your Nani. It always makes me remember my nani maa. I remember her vividly from my childhood and I always regret that I've never hugged her once and told her that I love her so much. So every night I look up at the stars and tell her that i still love her very much. Nani Chopra you've already created a special place in my heart with the beautiful smile you have🙏 Please Get Well Soon. And wishing you a very very Happy 81st Birthday. Abhi toh you've to live 100 years more❤", "maheen.ahmad": "InshAllah she will recover soon and get back to being the cutest nani everrrr!! I saw your story on my explore page and fell in love with your nani. Then I followed you here and on snapchat. She reminds me of my nano (who is perfectly fine MashAllah, she lives in a different country) ❤️ your nani is soo cute, caring, cool, funny and loving like mine :') she is always in my prayers and shall be back to her perfect self, Ameen xx", "pratiksha_tupe": "It hs bcum an aadat to me to see her once in a day in ur story. She's is jst amazing. She's d coolest nani i hv eva seen. Get well soon nani. Ur grandchildren lyk me r waiting fr uh.. lajdi thik ho jao. U hv to live 100s of years to love us.. @redheadwayfarer", "saadiya29": "A very happy birthday to the cutest nani... Wishing her all the happiness and good health. Get well soon... Waiting for your healthy selfie with @redheadwayfarer. Inshaalaha u will be fine soon. Amen.", "aarushi_laxmi": "Wish you all the happiness and good health. Get well soon 😙😚", "muskansharma7": "She is too adorable.. the way she treats you ❤️❤️ She will be fine soon.. and your stories are jandar just because of Nani Chopra ☺️☺️", "amenz_30_01": "Get well soon Nani😘❤ And Happie birthday may you live long and have healthy life..Lots of love❤❤❤", "tarushihihihi": "Your grams is the cutest . She is funny and total power pack . She will get well soon . I am damn sure all of your followers love her . Load of prayer and blessing . May she live the longest . ❤😊", "sukkuficient": "Don't worry, nani will be better soon. We all are praying for her. 🙏🏼", "kratikapandey0817": "Nani will be fine soon and she'll be back with her same charm💟..happy birthday to you nani🎂..lots of love and prayers fr u..get well soon💟💟", "_not__that_easy_": "We will definitely pray for her. ♥ She'll be fine soon...", "maliiha._": "She is a beautiful person in and out she resonates beauty in her soul she will be fine inshallah..", "arora__muskan": "She will be fine ❤️❤️ stay positive", "chopra5875": "She ll be alright we ll all pray for her", "chauhanmaithili": "She'll be fine ❤", "antara_bandyopadhyay": "Happy birthday to her.. much love💝 she'll be fine and strong don't worry", "prachiii_.__": "Happiest 81st bday to Nani chopra! She's soo soo beautiful!❤ i wish a very fast recovery for her. She'll be fine very soon and let her know that she has alot more lessons to teach you and you're eager to learn them all.☺ #loveyou", "sugandh_kansal": "Nani namaste🙏 wish you a very happy birthday Nani Chopra ❤ she will be fine di😊 love you Nani Chopra ❤❤ and saloni di @redheadwayfarer", "shilpa_dwivedi_": "Her smile.. I lost my Nani maa 5 years back but when I c \"my\"Nani Chopra I feel that I hv my Nani is still alive with u ,💓 I live u Nani maa", "musu_grover27": "Bond of a nani and her grand daughter is always special ! And ur bond with her is more than special. . so God is going to shower all his blessings on her !😇 Happy Birthday Nani !😘", "nasihanazma": "Insha allah she will be fine soon.❤️💯 I can understand how you are feeling right now @redheadwayfarer . I can relate to your situation very well.I have not met my nani since a year.I miss her so so much😭 I am so happy that you are there beside her😃 Take care of her.❤️", "_.shubhamsamanta._": "🙏🙏🙇🙇", "yadavarsha.10": "I love the way she help u in making your braids. And when she says about not using cellphone much. She reminds me of my nani too. Even my nani hates late tak phone use karna. But yeah saloni she ll be fine. And yeah happy birthday naniji and yes you are seriously one of the cutest nani's I've ever ever seen! Get well soon ♥", "arahulchhabra": "Get well soon aunty ji ❤️🙏🏼😊", "abhijeet_mahat0": "Don't worry ! Di ... She will be fine .... Everything will be alright ... Please hold yourself together because if you will fall weak then who will take care of her ... Happy 81st birthday ! #Nanichopra .... Get well soon .... #loveyoudi 😄😘😘@redheadwayfarer", "dishanandwanii": "@redheadwayfarer ... Saloni di as I think nani's are the bestest of all...she cares, she loves , she scolds..🙈 she does everything ....even when she's not able to! Your nani will be fine soon....and that too on her birthday ...the most precious gift to her will be a wide smile of yours! She would love to see it! Everytime I see nanichopra smiling and guiding ...It makes me remember my Nani and I used to call her Everytime..💕💕💕 Happy birthday Nani Chopra❤🙏", "shrutipandey2695": "Oh god i just want her back anu how saloni please i love her so much @redheadwayfarer", "mannatsirohi_": "Hope she gets well soon🙏🙏🙏", "ibrahim_yousafzai": "May Allah give her shifa", "nishclick": "I have never lived with my Nani but having seen Nani Chopra bully with you and be a part of your talks was the cutest thing i saw on your stories. Wish she gets well soon & i get to see her more! Strength to her ❤️", "___papri___": "she will b fine. Don't worry.", "sahiba_97": "Nani chopra is super duper cute and a pious lady nothing will happen to her, please be strong and as soon she gets well please post a video with her. Missing nani chopra and her voice♥️#getwellsoon🙏", "shruti_sudhama": "She will sure be fine.All my prayers#getwellsoon 😘 Lots of love.", "v.a.r.o.nik_a": "She is so sweet n cute..no worries..hope fr the good✌🙌", "mussu_1015": "she is love 💖 n i pray for her good health.... nani chopra you are the best... i love uh so much ..... you'll be fine soon .... happiest birthday beautiful 💖 god bless uh .... 😘😘😘 live a long long life .... 😎 i just love uh n ur voice! you are so lucky @redheadwayfarer that you have nani chopra..... lots n lots of hugs and kisses to both of uh .... 😍😍😘😘😘😘😘😘", "pic_anatomy": "In Shaa Allaah will remember her, you & your familia in prayers. 🙏😊", "pinku0410": "She will get well soon don't wry", "swapnil_sud": "May the gods of all the worlds come together to shower your Nani with their blessings so that she gets well soon and leave behind all the pain and suffering. Happy Birthday! Have a speedy recovery.@redheadwayfarer", "rishika_banda": "Happy birthday nani chopra and saloni di she will be fine and i love u both", "hosayrahim": "@redheadwayfarer nani chopra is all Love. She's the sweetest. Love everything about her ❤❤❤ get well soon Naani chopra 🙏❤❤", "choco_dragon_queen": "Shell be fine soon😘 it's my bday too,😶", "zash_14": "❤❤❤", "mayuri_malkani": "Don't you worry 💕 She will be fine soon💕Happy vala birthday naniii💕i love her the way she is in this age💕💕😘", "imsrk20": "Whenever u post any video or status wid Nani, I see it many many tyms agn n agn. I love to see her and hear her voice. D way she smiles. D way she acts in front of camera. I hv this wish to meet her atleast once, tlk to her spend tym wid her. Happy Birthday Nani n v wish u quick recovery. Love U lots ❤️. May Hashem bless U. Take Care. Keep Smiling Alwyz d way U do cz u look more Beautiful 😘", "jannahh.girl": "Get well soon !!", "thehipstersoul": "She'll fine soon 😘", "simrangajsinghani": "She will be fine...God bless her...😢", "kumarimadhuri04": "She is so damn cute. She reminds me of my nani. Please do give her a hug from my side on her birthday. And she will be fine soon and will upload random videos for us. ❤️. Love nani. ❤️", "akansha._.parihar": "I love Nani Chopra's voice ❤❤❤ She's so adorable. And also she'll be really fine soon 😊", "thefinesseweb": "She is so cute 😃😃💕💕 ...I love her a lot😄😄", "_smritik_": "Praying. 💜💜", "dhanu_mandavkar": "Get well soon nani 😘 u r the cutest we r missing u", "bom.bae_": "She'll be fine @redheadwayfarer ..... She's our warrior dnt wrry😘", "success.dude": "God may gave you strength, Nani ji get well soon so fast 🙏", "_brownpedha_": "Take care, she is gonna be just fine dw", "nixondhall": "Jai bhole nath.", "diksha73": "@redheadwayfarer Love the way nani chopra loves you that's loveable 😗😗", "nids_way": "She'll get well soon.. just believe that everything's gonna be OK ..n dnt forget to smile ☺ @redheadwayfarer", "zareen_sheekh": "Happy birthday nani chopra.... Gett well soon 😊😊😊😊", "mishika_sharma": "God bless her and she will be fine soon❤❤😘😘 @redheadwayfarer", "__p__u__j__a__": "Hey nani chopra...wish you many many Happy returns of the day....you always remind me of my nani....its unfortunate that I couldn't send much time with her....well I wish you a safe and a healthy life ahead.", "sherindhote": "You're one of the strongest people I know and I haven't even met you. You just resonate strength. And she is tumhari mummy ki bhi mummy so think about that like strength × 3 is a given(looking at her though, it'd be definitely more!). Happy 81 Nani Chopra! It'd be kinda nice to know her name. One of the prettiest smile, cutest cheeks ever! Love it when she scolds you. 💚💚💚 Need to see her on 31/05/2036 with some fallen out teeth still rocking a pretty smile. ❤❤", "lakhvirsandeep": "Waheguru mehar kro", "ammy.singh.1466": "Get well soon nanni ❤️🙏🏻", "snehal12293": "I have never seen such a cute nani and she IL get well soon.... happiest birthday to her.TC nani!!", "shimona00_d": "she will b soon afteroll she is having so many kids to love her n pray for her n such a beautiful n the best granddaughter to look after her❤️get well soon nani🙏🏻", "kritichawla20": "She'll be fine! She is coolest nani.❤️ hugs and kisses to her. 😻😘", "paulohmee": "I pray that she gets well soon 🙏🏼🌸🍃", "mrsmikejxn": "Dear nani chopra happy birthday we luv u soo much ...get well soon💜", "pankajj_la": "She'll be fine. Lots and lots of prayers 🙏", "meghana__7": "Happy birthday nani Chopra..we know that you are so strong and can fight with anything..our Wonder woman..lots and lots of love and prayers..!!!❤", "gurpreeeetk": "Happy birthday nani Chopra ❤we all love u, get well soon 😘", "maroof_munkar": ":'-(", "txnisha._": "We love u Nani Chopra❤❤❤❤", "__advaitha__": "She will be fine in no time. Our love for nani chopra will always be a strength to her❤🌹", "lostontheplanet": "Get well soon @nanichopra.. I love u soo much😘 I always see my Nani in you😘😘😘 n very happy birthday to u🙂 god bless u..🙂 #longlivenanichopra @redheadwayfarer 🙂🙂don't worry she will be fine soon..!!", "ttaarru": "🙏🙏", "unnatii3___": "We are definately going to pray for her.", "naaaaaandini": "Happy Birthdayy nani🎈❤I miss your everything in the stories:(get well soon.. asap!Love you❤", "k_a_events_": "@redheadwayfarer dont worry she ll be fit and fine dancing soon, we all love her by heart, by soul. And i pray for her consistently don't worry your strength pillar will stand still with u 🎀 she's a warrior, i have seen her smiling and rulling our hearts... She ll be fine.. And be blessed... Love u #nanichopra", "namita_kedia": "Nani chopra get well soon❤❤❤🙏🙏🙏", "sakshi.sharma.es927": "God will definitely heal her✨✨", "onethatblooms": "nani, janamdin ki dher saari vadaaiyaan!!! ❤️ aap bas jaldi theek ho jao or kuch gharelu nuskhey ham sab potiyon se share karo 😀", "vvohra06": "Dear nani chopra many many happy returns of the day. Get well soon. Stay positive. You will be fine very very soon. Loads of love 😍", "iamupasanaranga": "Happy birthday nani.💙 and di she will be fine super soon 💕 stay strong and blessed. @redheadwayfarer", "_amruuta": "Dear Nani Chopra, Happy Birthday! If you don't already know this then let me tell you you're sassier and cooler than Saloni Chopra. 😛 You're so strong and always full of positive vibes. Take care and get well soon. We love you. 😘❤", "aniket_hele": "God bless ! 👍 Be strong", "___sanskruti": "Having A nani would probably the bestet thing. Though i never got a chance to experiance it bt i can by watching your stories... Your nani is one of the cool one nd shez damn cute... get well sooon naniii ... she has to be alright ... and Happiest birthday naniiiii.... love you both💞", "praddhi_vd": "Praying for her speedy recovery and may she get healthy soon and get back home really really soon I adore your and her bond it's so pure beautiful precious ❤️", "got_so_far": "Get well soon nani🙂", "blackcrystal._": "She is the coolest nani I have ever seen 😍😍😍 pretty af n cute to😍😍 nothing is gonna happen to her she will back with that coolness soon 😎😎😎 nani chopra zindabaad😁😁😎😎 n happy wala birthday may you live 4599653227999 years😁😁😘😘😘❤❤❤", "vishesh_tanwani_": "Don't worry mam she'll be fine soon 😇😇", "cllasy_rookey": "nani chopraa vl b fyn soonn....vl all prayy fr herr...", "ishta.handa": "nani chopra❤ u are such a cutie and i adore u soo much. nothing will happen to just be optimistic and believe in god.", "mm_maha11": "She will be fine... In sha allah... God bless naani😇✨", "__shivanni__": "Nani Chopra is the bst... she will get well soon❤@redheadwayfarer", "iyer_sangeetha": "Wish you a very very Happy Birthday Nani! You are such a beautiful soul. Hope you are better now. @redheadwayfarer You stay positive & strong, like always. Nani will be fine soon. Get well soon Nani! We are awaiting your stories.. so you have to get well soon. Love!❤", "kapil.divekar": "I love her smile 😍 and don't you worry she will get well soon😇 she has to complete century💯", "iiktara": "@redheadwayfarer I love your Nani, I see my Nani In her. I always wait for your posts with your Nani, she is a good person. I'll pray for her well being.", "vedashri5": "She will get well soon 😃", "rohan_xesthetix": "May God bless her with speedy recovery ❤❤", "pink_glasses10": "Wishing her a very HAPPY BIRTHDAY", "the_crazy_weirdo_": "happy birthday Nani chopra. get well soon.. much love! many happy returns of d day..", "its_not_ur_comfort_zone": "I completely understand what u r going through😞 my eyes r num after reading ur caption cuz I lost my Nani few days backn I'm badly missing her❤ all I can say is she'll be alright❤ @redheadwayfarer", "deekshasant": "She will be fine!! God bless her and I m praying for her🙏", "simran.porwal": "Get well soon", "sikandarkher\nVerified": "Verified", "mintoomed": "She wl get well very soon", "s.u.d.i.p.t.a": "Get well soon Nani...we love you..prayers for you..@redheadwayfarer", "lady_j_obsessed": "Don't worry .....she'll be fine 🙏", "aasthasingh03": "may she gets well soon", "simrankaurfc": "She ll b fine soon.. dnt worry please.....", "__uglymess__": "Nani Chopra is superrrr cuteeee. I love watching her in your videos more than anything ♥ The way she gets irritated sometimes when you click her Haha ♥♥ Happy 81st Birthday Nani Chopraaa. You'll definitely be all okay because all our prayers are with youu. We all love you so much.", "mdix1611": "What can I say about grandparents.... They have super magical powers which one couldn't deny that we feel blessed and secured in their arms.. Grandma's are God's strongest creation as they are the source of strength, tolerance and happiness. They keep family integrated and rooted. Yet they are the one who suffers a lot too Bt didn't utter anything for the sake of happiness of their children. We learn how to be humble and kind from her.. And ur Nani has all the above mentioned things bcz she's really a fighter.. Super lady.. Get well soon", "srijanchawla": "Sexy caring dynamic person.. 😃😃😊", "sur.photografy": "She will be just fine❤❤❤❤ When you are with her what could happpen to her❤✨ I love her too!!", "garimasrajawat": "& a very happy birthday 🎂 🎂 @redheadwayfarer", "the_insane_era": "I'm praying! She'll be fit n fine very very soon don't worry!", "prathamsatalkar": "Angelic blessings. Get well soon Nani and I send you a big hug to brighten you up as well.", "kee_3009": "@redheadwayfarer ma'am,she'll be fine very soon! Prayers with Nani ma ❤️ it's also my mother's birthday today and we're both praying for Nani ❤️ waheguru bless her.. 🙏🏻", "shantanu_maheshwari_empire": "She's the best nani ever ❤ get well soon nani chopra😊 @redheadwayfarer", "saleekhasainudeen": "@redheadwayfarer don't worry dear .she'll be fine soon. #nanichopra Happiest birthday to you ❤. Get well soon. 😘", "__.pragatii13.__": "Nani chopra is so cute and she reminds me of my grandmother.... I love her so much. And just like my grandmother, i want nani chopra to be strong and fight all the obstacles that are coming in her way towards a wonderful and evergreen life.. ❤❤@redheadwayfarer", "julism_13": "Get well soon nani... we all love u.. tk cr of her @redheadwayfarer she'll be fine soon... amen! 🙏", "priyajeongguk": "She'll be fine don't worry😊 ....get well soon nani chopra💜", "eshita.sankhla": "She will be fine ❤ Happy Birthday Nani 💕", "butter_chickkken": "she is just so cute and adorable😘😘 hope you get well soon nani chopra...have a great birthday😘😘", "miss___bose": "I rlly lv her innocnt smiles whnvr u ask her to look @ dh camra *nani chopra!n she sddnly bcme so adorble to see!gd blss her... lotz of ❤ fr her...", "shivi18_": "Baar bar din ye ayee !! Baar bar dil ye gaye!! Tum zio zarao saaal @nanichopra", "_tg_05": "she will good soon dont worry jst stay positiv n positive will happen 😊 my good wishes is with you....", "rajvivats": "Happy birthday nani chopra💓 hope you'll get well soon 😔❤", "__.nehahahaha": "@redheadwayfarer 🎈", "crazieloop": "Get well soon nani chopra😘", "manasvi1708": "Nani chopra will be fine soon!🤗💛 prayers for her! ✨", "rtdalya": "🙏will pray for her", "mishti_doi_swagg": "Naani.. Happy Happy birthdae to you!!! ❤❤❤ Keep that beautiful smile on your face always..as that's everlasting and that gives a lot of positive vibes to us and everyone around!!! 😁🤗 Cheer up ...soon you'll be again back to home...n we'll watch u in the stories, knitting beautiful pretty sweaters sitting in the garden. Flawless 81 💙 evergreen beauty... Naani love💟 😘 #getwellsoon #wemissurstories ..dated forever. @redheadwayfarer", "_little_sparrow_o.o": "Yes she's just as sweet as our our grandmas. I love it when she reacts and makes faces in your videos. Don't worry at all, she'll be fine very soon", "nehaa_07": "Nani Chopra will fine soon .god bless... shezz very cuteeeee....😃yeah ssly", "itsharshitagram": "She is charming just like her soul...😘 Get well soon...n a happy birthday to her..", "10.niamat": "She is just an amazing soul. Her videos make me smile n remind me of my dear nani. She will well very soon n she will be dancing n singing on her bday! ❤️ my prayers n condolences are with u❤️", "shreni_tomar": "Her smile 😍she is cute ,💗she have a pure heart 💗", "zainaliphotography": "❤️🙏🏻", "amishipaul": "She is definitely goona be fit and fine and surely will recover very soon don't worry be strong ❤️she is an amazing person and she is simply beautiful 😃", "_unapologetic___": "She will be fine soon. Prayers with her.", "parvathyshaina": "Don't worry she will be fine", "dishaa021": "She is so cute...like modern world nani should be...n everything will be fine..ours prayers would heal ❤", "cupcake_virus": "She is cute. A lil more cute than you @redheadwayfarer Her grey hair, and her wrinkled cheeks make her the most adorable Nani of the world. She reminds me of my Nani. Wish to see her cut the bday cake soon! Sending prayers, good wishes, and love as bday gifts!😅 Love Nani Chopra😘", "thenihilistbasu": "She will be well soon .. don't worry", "simran_vegad": "She will be fine #praying❤️", "mahisim2822": "Get well soon nani chopra", "richadiksha": "Love u nani ,we love u ,get well soon😘😘💐", "_f.a.i.z.a.n._": "She will be okay #InshaAllah no worries @redheadwayfarer", "nishabhagtani": "@redheadwayfarer the moment you start snapping her on your story n she's like..'phir meri...pagal hai...tu sacch me pagal hai😝❤...' get well soon nani 😞", "mani_agarwl_": "She will be fine soon .. don't worry.. she is a strong women .. may god bless her ✨ and happy 81th birthday to nani chopra ...", "itee_1924": "Nani chopra, we love you. You are the cutest. 😘 get well soon! @redheadwayfarer", "annagracec_": "@shreyadas01 so much love", "shailja_13": "She's very pretty..adorable...not only you but we too love her...she's ur strength...nd may ur strength get well soon...❤️❤️Love Nani Chopra @redheadwayfarer", "chinmaisinha": "I loved the way she said 'tuk tuk awaz aaya chal photo dikha' ❤ happiest birthday to you beautiful nani get well soon. Waiting to see you healthy again ❤", "shaansquad": "She is such a charming beauty...a strong willed lady...i totally adore nani Chopra for her sweet and silly antiques...she is such a sweetheart...she reminds me of my nani...@redheadwayfarer from my side do tell her that she has hell lot more strength confidence and will power than any other teenage kid....and give her loads and loads of love and a tight hug....happy birthday nani 😘😘😘😘😘", "ps_06_19": "Don't worry @redheadwayfarer she'll be fine soon! Happy 81st Birthday Nani maa. Love u😘😘😘 Take Care!!!", "anshikapandey23": "Please don't be sad di, you have to be strong and I know ki unko kuch bhi ni hoga kyuki itte haste khelte insaan ko kuch ni ho skta, we all are praying for her❤❤😘😘😘 She will be very well soonn😇😇😇❤❤❤❤❤❤ Saloni di😊😘 be strong😊👍 @redheadwayfarer", "the.backup.brain": "Your beautiful lady will get well soon ❤❤", "diary_of_duati": "Remembering her in every prayers. Get well soon nani", "swatii.d": "She will b fine very soon gud bless her. 😘", "nagrejr": "Get well soon Nani Chopra..🌹🤶💗. Hope we will see you in few days on saloni's insta stories...", "komalpattanayak": "Get well soon Nani chopra", "riyajoshi__": "May god bless her♥ All the prayers coming her way. She is a beautiful soul. May god be with her always.", "samreen_shahh_": "Dont worry she'll be fine soon .take care .#hbd", "raqiba.malik": "Nani chopra is best nani tbh I love when she ask you things again n again n her smile is very nice♥️♥️♥️♥️😘 @redheadwayfarer", "shreyadas01": "@redheadwayfarer She is our strong nani Chopra. We love you. 💘🌷wishes from Bharat 🇮🇳", "elegant.14": "May she gets well real soon. ...Love her so much. ..I miss my Nani A lot she was the sweetest thing ever in my life....,& God will protect your nani.. she'll be back to normal real soon lots of love & care to her 💓💓💓@redheadwayfarer", "roopenzal__": "You do not worry our prayers are with her. You just take good care of her there. P.S I know the feeling of how hard it is to see your grandparent(s) in this state. And last but not the least wish him Many Many happy returns of the day. #itsmymomsbirthdaytoo", "sammusastra": "She LL get well soon.", "p.u.r.v.i_j": "Don wry she'll be well soon...lots of love to her...❤ @redheadwayfarer", "_aakanksha_2101": "We love nani chopra!! Get well soon nani chopra!❤", "i_nidhisingh_": "Maybe a coincidence i just had video call with my nani and happen to see your post and remembered all the ig stories you shared with her and she is supa-osm and nani ji abhi to apne or bhi nautankiya dekhni hai apni bacho ki jaldi se thik ho jaiye with love and prayers 😘", "juhi_bhasin": "Nani Ma would be hale and hearty as before very soon 😘 our prayers are with you @redheadwayfarer wishing her the best of health and more loving years of life on her 81st birthday 😘❤", "akansha.writes": "She is so confident and beautiful!😘", "__ibadat_": "I love my nani more than anything in the world and i can totally relate to your feelings right now. Im sure she'll be back to her perfect self in no time. Keep you strength hanging in there . ❤️", "_muskaansabarwal": "I love you Nani Chopra ❤ Your Smile just makes my day. You are just like my grand mother just like I adore her I adore you too ❤❤❤ Get Well Soon😙😙", "spunky_sru": "She has a good sense of humour nd an adorable personality", "_rukhsaar": "She will be @redheadwayfarer ! Shez such a sweet soul m sure she ll b back healthy and we will b able to c more of her cute pictures and videos😍 I ll pray fr her and all the love for #nanichopra😘😘", "jo.bole.so.nehal": "I prayed to my pitra ji dadosa Naani will be fit soooon❤️", "riyayad13": "Hope she is fine and healthy..get well soon nani chopra..❤", "palomi_gupta05": "May she get well really soon :). God bless her. She is a sweetheart. ❤️", "ananya.______": "@redheadwayfarer In shaa allah thik hojae jldi❤", "aartii_23": "May she get well soon ❤✨", "gauaharkhan\nVerified": "Verified", "swarup_dev": "Our prayers wid her...m❤ get well soon nanny", "bee_5_97": "I pray nani gets better very soon...❤️", "manishhmittal": "I love her smile in her video.....", "pavan_has_just_": "Nani is such a great champ with an amazing spirit! She's definitely going to get well soon and smile once more to the camera :)", "_harshaa_15": "Get well soon nani💠💠..we all love uh", "imperfect__blend": "She will be well soon...don't lose hope...everything will be fine...🙏", "the_sunshyngirl": "What we think happens! Just have faith. She is going to be totally fine. Will pray that she should recover very soon.💖", "gayatriiverma": "God bless!❤", "haarrshaaa": "Hope god blesses her😊 she will be fine again💝", "osheen_lawrence": "@redheadwayfarer I can totally relate. I was in the same situation earlier this month. I can totally understand. It feels horrible. You cannot see your loved ones suffer. Bless you both.", "tinaaaaath": "She is more powerful than us she will get better soon❤️", "_forrr_m_": "Get well soon nani💖🍁", "parulsethi": "I hope she gets well soon!", "farhat_abusufiyan": "Sorry to intrude but may I know what happened to her😱", "___riyaaa___": "@redheadwayfarer My nani is is 86 years old,and I know how worried you are right now. I will pray for her and I know saying don't worry won't make you worry less but trust on whatever power you believe in,it will make things better . I know how it feels even if she has mild fever too,I fail to show how much I love her but she means the world to me and hope your nani has the best health and all the happiness in the world . God bless you both !", "nimishkotwal": "All prayers with her", "ameek_mahal": "God Bless.", "antara.sarkar10": "Get well soon Naani 🌹", "sunidhiguptah": "Get well soon nani..you're the coolest nani I've ever seen🙏🙏", "09mia": "Get well soon Nani Chopra", "_brezinasultana": "May Allah make her healthy n happy soon 😘😇", "__mostlyinsanee": "She will fine dii 😊 be strong @redheadwayfarer", "shrvzravelet": "Get well soon granmaa!! Di loves you... and we tooo! ❤💕", "shaarenity": "Prayers with you, naani and your entire family. Stay strong! @redheadwayfarer", "rheasinghparihar": "Get well soon Nani. 🌠", "imrk.007": "Main bhagwan se prarthna karta hu ki unhe swasth or lambi umar de...", "_aishwaryarajput_": "Her videos actually light up my mood every now and then. Her smile has an amazing impact. Get well soon Naani. Love you so very much ❤️❤️❤️", "shwe._ta": "May she get well soon❤", "aiiyyotripathi": "🙏🙏🙏", "sonamsingh.__": "This is so beautiful. I am in tears. Get well soon nani. And @redheadwayfarer mam be strong. She will be fine soon and hope we get to see those cute videos of you and nani chopra soon. ❤ Takecare.", "aditi__05_": "I will surely pray for her di❤ get well very soon nani😞", "aadish111": "Get well soon nani and jaldi se thik ho jao Hume 82nd birthday bhi celebrate Karna h😊😊😊😊💝", "madangirikar_sailee": "She will be better soon. Our prayers are with her.", "rheagoutam": "Dont worry @redheadwayfarer im sure she will really get wel soon and u dont worry be strong my inspiration ❤❤All the love to dadi chopra and you ❤❤", "harshthukral23": "May she get well soon😭happiest bday to her❤❤god bless her 👼she is the cutest nano ever 😭❤❤❤💘💘💋💋 @redheadwayfarer 💋💋", "megha_singh17": "Don't wrry she will be all right... I can understand ur fllng... Even I luv my \"Nani\" alot like u😍😍", "oindrila_rakshit": "Get well soon nani...!", "vijeta_aster": "Don't worry. Keep Faith in God .She will get well Soon ☺", "imnvdeepbajwa": "God Bless On her..she gets well vry soon", "k_a_t_h_k_a_a_r": "Nani..love u..:*....u r so cute and adorable... u will be alright .dnt worry... strong nani..i love u...😘😘😘😘😘😘😘😘", "09anjali": "She'll get well soon.💖", "varidhidcruz": "I will", "bhavya__mehta": "She ll b fine..dnt wry", "lisa.bardhan": "I hope she gets well soon", "iatishaybansal": "She Will be 🙏🏻", "joramyalam": "God bless her", "shaanii10": "Stay strong.. I will definitely pray..", "nikkami_sarkar": "May God be with you ❤", "iifivexeroii": "Hope she gets better real soon 💓 @redheadwayfarer", "sheetal_pitale": "Get well soon Nani... I'll be praying for ur speedy recovery", "heena_1391": "Hope she gets well real fast", "_benipalharman_": "I pray that she's fine really soon!!💐", "thetrickypanda": "She will be fine @redheadwayfarer .... dnt worry", "garimamittan02": "Get well soon nani ❤"}