{"dikshitajha": "@dishakp812", "nidhimishra2012": "YOU SLAY", "sour__hearts": "@zombie.with.a.soul", "zombie.with.a.soul": "@sour__hearts ....dang it ! 😱😱😱", "spunky_._forever.___________": "Naked 😍😍😍😍😍", "kuldeep84": "When we boys can roam shirtless why cnt girls? I appreciate your thinking", "m.b.adil": "Bole to dil jeet Liya tune... But ....!!!", "meee.yash": "some pictures are inappropriate and thats why majority don't. You are just out of your mind. If so go for job interviews like this.", "constancio.aguiar": "Oh my gosh people will get mad 😡", "nishi.saini.3551": "Superb..yar👏👏👏", "nupuromg_99": "@nishi.saini.3551 Gd Dear well done", "stars_vhf": "❤ U gorgeous", "o_b_l_i_v_i_a": "Fucking subversive programming for the impressionable young generation of women. Blurring the lines of personal freedom, of the wrong, of the indecent, of vulgarity, of independence. Rolling them all up into one mass of a hypocritical sermon. Teach women to be strong, rather than turning them to braindead creatures that holler for equality on social media but only do their bit by objectifying themselves and nothing else worth mentionable or concrete. What has your bloody feminism changed in our country? Nothing other than IG rolling out young girls clad in undergarments and claiming 'empowerment'. Such a shallow, faulty and shitty little revolution that's not gonna lead to anything constructive.", "unfuck.your.love": "💪💚", "rupak_3_": "@oblivia88 you are such a psycho", "aranjveer": "Looking hot", "nikhil_aradhya": "When you want to post a semi nude picture . But make others look like it's all about feminism 101 goals AF", "anurag.s_": "Get well soon...you retarted soul....!!", "soomroahsan": "Its good you are fighting for the cause hope u achieve succes because youre realy", "shahriarrajoshi1234": "You have small boobs @redheadwayfarer", "_a.n.u.s.h.k.a_04": "@redheadwayfarer ..girl!..u r truly right...this caption... actually these words of yours...make me cry...cause..u r doing that thing which needs alot alot n alot guites and u actually have that..keep fighting..and keep inspiring me ..I don't know about others..and I also don't want to fight or explain others cause people gonna say or think or bark as they r doing FL ...so from this post I m so so so so much inspired that..since now..I will gonna fight for mah self..every where and every tym....and..I wanna say...those people who r talking about the boobs....oh oops..how could I write this word..on social media.. comment..I m girl..I should be sorry for that..and keep mah fucking mouth shut...so plz u people should go and join the biology class again..and should study again..cause can't yr mind digest this fact..that boobs are the part of our body..it's not for sexual use only...u know why u can think this only..kyuki tum isse aage kuch nh soch skte..or hum woh karenge jo Hume karna hain..so go hell must be waiting for u bub..and Saloni mam...u r damn right every where...u r perfect and most importantly u r opening so many closed doors for girls..tysm..for existing...ily..🌸💕", "sakkumyself": "You make me speechless! I am speechless after each and every line reading it twice how beautifully they are expressed ! In such a perfect way message is conveyed that thousands more girls want to express! You write what my mind questions from the society! She is supposed to open leg when told or forced or else fold it ! Don't speak for your body rights and make feminism VULGAR ! These some heart touching lines 😍 the society is no one to tell us what to wear or how to sit! Every time I go through your new post i become your more greater fan for your writings for your thoughts - which questions the society aggressively! I am such a small girl in front of you but still dreams to meet my inspiration one day soon 💕 keep writing keep inspiring so different you are from other artists ! STAR In her own way ! I ADORE YOU MAM!❤", "p.r.nimavat": "Beach bitch", "anusreechakraborty98": "Well said!💖", "ritika_sodhani": "@redheadwayfarer You write truly amazing di!! You're expressing what a girl feels today! Wearing short dresses means that every girl wants to attract a boy? Some people call them cheap, shameless, and what not? Buy yeah, boys can wear whatever they like.. They can flaunt their abs, their body and nobody will ever blame them. But if a girl does that, then she'll be called a shameless creature!!! It's totally WRONG! We will wear what we like! If boys can do whatever they want, we also have the equal right with us!", "___yogitaa": "You are inspiring", "normal33392": "yum", "imrankhan8740": "Wow what a look absolutely Linda", "sudeshnasaha_": "So good you write it's like I read each and every line it was so good a true inspiration quote by these 😍😍@redheadwayfarer love it!!!!!", "dharpal": "👍", "the_thakurr_boy": "So hot", "nature_lovepix": "👌", "nd_silent_eyes": "Marzi apni koi kh vi kree matlab kya hh kh ni @redheadwayfarer", "_upadhyay": "Salute 👍 @redheadwayfarer really Girls are Goddess 🙏", "shubhamgoyal18": "@hkayneferns finally found a girl with a real feminism!", "thenagmaa": "Yes Yuh Said Right :)) https://www.facebook.com/stirredup.co/videos/278948465844073/", "shamsher4820": "Nbbm", "purnimaj001": "@hamzamallick_ who made the m precious...if precious things are covered, they are also meant to be respected,meant to be worshipped,meant to be flaunted... If you define it as precious yes they are... But people making it precious have made it more vulnerable... Vulnerable of being stolen,vulnerable of being torn....so don't define a body part as precious...it's not the subject matter here... It's a matter of an individual's choice,whether they need to cover their GOLD or flaunt it off.. And kudos to @redheadwayfarer for always speaking the truth fearlessly", "kalpana_kamble": "You are an inspiration❤", "aayushi_990": "👏👏👌👌👌👌 Massive Respect ...You Are Precious", "iamsahilgrover__": "@perry_arora lol 😈 wtf r uh thinking bro ? haryana m ladki paida ni ohne dte ? ohme dte toh khushi ni ohti ? bro haryana bdl gya ! tune dngl dkh k bol dia.. ki 4 baar try kiya but ladka ni hua ! but ye b toh dkh na bc hmaari ldkia ldko se kam eh k ?? bhaishab haryana bdl gya eh ! ab aap b apni soch bdlo ! Haryana k baare m plz or koi bat ni !", "vickyag77": "You are beautiful ❤️", "ritukaur289": "Well said", "nidhirubal": "ye SB aap apni achi pic daal k v bol sakti thi...no doubt ur post is awesome...but u dnt need to put picture like dis...(may be than u hv got respect of every single peeps there)...get well soon :)", "jatin.shah_": "@nidhirubal bt it wouldnt leave that impact on people may be she thinks that the caption should relate the pic and thats how it works according to her !!!", "raina_akshay": "sexy babe", "bbiswas26": "Wow its amazing what u said hats off... We all must think the as u", "baee_rozgaarr": "👆👏👏👏👏👏 nd to society 🖕🖕🤘🤘", "_simritkaur_": "Preach!!!!😍😍 saloni may god bless your pure soul", "rajat__thakur__01": "Papa k samne aur bhai k samne ye bolna#boht socha but its a fake world 😒", "be.in.rythm__": "@jatin.shah_ absolutely true", "sonaliawasthii": "Well said @redheadwayfarer.Being a femininst I am support of this no one has right to judge us on the basis of this .it is purely our choice wht to show or not and why we are not supposed to flaunt its just Becoz we are gals.", "vermasunidhi": "Mam, the way you inspire wid your words is incredible.You're a true YOUTH ICON...more power to you! #bethechange🌎 @redheadwayfarer", "hkayneferns": "Wo to kher individual pe depend karta hai ki wo insan Kya ban na chahta Hai. Log to bolte hi rahenge qki wahi unka kaam Hai🙂 ab tm chahe kapde pehno ya nude ghumo...you'd be judged that's how the world works! 😊", "toamehtoameh": "😍😍😘", "wasimkhan7840": "Wow beautiful beautiful", "warrior_sierra": "@redheadwayfarer", "amitaggarwal8": "Hmm @redheadwayfarer caption m dum h. Phirr bhi gum h.😂😂😂 Seriously #caption 😍😍😍😍", "bhartiye.nagrik": "🙏🏻 respect", "poorvii._": "@redheadwayfarer I was your fan before you post about that Pakistani flag. ☺️", "suk_anya": "So true. :) It's us that needs a change. India toh naam se barbaad h. :))💟 Such a beautiful note. Thank you.", "himani_r_k": "@redheadwayfarer u have actually showed a mirror to d society by ur note. U have beautifully expressed what u feel by writing such a lovely note. I also feel the same as u do. Hatsoff to u ❤❤❤❤", "flawless_namii": "Bitch", "illustration_420": "I dunno understand this concept of women liberty very well I don't get it ... acc. To me it should be human liberty instead(let's be united) & all the humans here plz understand the diff b/w equality & equity first❤😇💚😈❤", "too_messy_": "Someone got it @kaushik95v", "rubaijsingh": "@tanmeetksahiwal we talked about way too many relatable things today", "tanmeetksahiwal": "Haina. And this is right on point @rubaijsingh constant denial of anatomy", "almostfammous": "What a courageous gal !", "chalti.phirti.galti": "@pretty__little___psycho you are a psycho indeed.", "callmeerisbih": "@lavdibya :)", "lav_dibya": "Like seriously, thank you @callmeerisbih", "vaidehi_vojjala": "Wow @r0hini_pawar", "vartikaesquee": "Love the caption babe", "shatakshi_t": "@shivangi_gaikwad @suchita_v @nikitavatare Caption 💯", "angelleroselyn": "@pretty___little___psycho ah man another fighter cock. Read what I said. Anyway sure go ahead changing the world . cover saloni up or whatever.", "anshu_anshu5": "As you have expressed your opinion let me express mine. Men don't go around showing their penises in public because it's a private part. If a guy does it people will surely shame him on internet and news channels. Why can't you think that it's the same way with female bodies. They cover their breast the same way they cover their vagina and men cover their penises. Showing off your naked body doesn't bring the changes in society. If it is so many women in rural areas are getting raped even if they are fully draped in saree. And women are getting raped in metro cities like Delhi even if they are wearing short clothes. It's the men's mentality that should be changed . Not how people dress. The society won't change by encouraging nudity by free the nipple campaigns. It is the men's mentality that should change . They should control their pervert thoughts when they see a women no matter how she dresses. Again yes a girl can wear what she wants but there's a limit when you are in a society. Boys also have their limits. And it's been like this since forever. Yes there are recent change in people's mentalities . It's for good. But there's a limit for everything.", "why.harsha.why": "@redheadwayfarer y didn't you choose to go totally topless proving your point??? Are you afraid of the Indian community's reactions?? Or are you just faking this feminist ideology of yours...or maybe you know you stand in a special cultured decent country! DON'T MAKE INDIAN WOMEN SHAME ON YOU'RE FAKE FEMINISM 👸😿", "eknoor._.dhiman": "Sexy", "a_hipster_soul": "I love the way you write. Like I feel the exact same but just can't express in writing and when I do speak up everybody just think I am just throwing on a tantrum. I just wish I could write or express like you 💖💖", "lonesurviour1234": "Well said!!", "perry_arora": "@nilesh_artist kis cheez ki marketing sir?", "siddharthxyz133": "🖐", "shubham_nishad__": "yes! @chetnakhandal is a real woman here💎 ...she's never talking about shit ..like other she's always spoke the truth..", "rohit.nannu": "@shubham_nishad__ vaj gi talli..lol be in manners", "zuharghhh": "Love her so much. @jeel_vasa", "kanikadurga": "I am so in love with you since forever. Thank you so much for breaking all the stereotypes people have. And just being you always. To stand up for every women on this planet and show all the love and respect to everyone. You're the one who can change everybody's mindsets. I'm so glad India has someone like you to take a stand on us. All the love man. ❤", "dont_followme215": "What the fuck is this..🙄", "garimamittan02": "@sidk09_ Exactly !! But one cannot make these people understand that..they will support her no matter what bcoz of *Freedom to speak*. Freedom to speak is okay but who gave you freedom to speak about a nation who kills your own nation. Lol ..leave them ..they wont understand.", "divyanshi_mahajan": "@archi.gupta", "saltbaemona": "And that isn't a great thing. It puts our \"great\" country to shame.", "parthdavda3264": "@ruchie.s a must read. I told you to write something like this", "kr_luckey_rathore": "nyc thought .... really proud of uh @rani_bhati_ 😊", "ritiksingh_": "You look like sonia gandhi 😁😂🤔", "kajaltiwarie": "Our society really sucks!!!", "deewaitforitdee": "@mittaravali the caption...", "virajsbudhdev": "@chetnakhandal I'll take the easier route here... Just take this as a compliment and leave the people in your life deal with you..good night :)", "diwashaaa": "@chetnakhandal m afraid i m gonna take up saloni's advice of not wasting my time on dumbwits...so gal take ur opinion and shove it up ur ass...i dont give a damn..! bbye...", "7naarora": "What u have written and what u said👌is just awesome and so inspiring ignore other 💕", "writeranddreamer_": "@garimamittan99 dude , if they had so much of brain India wouldn't have been like this. It would have been a better and developed nation. Sick minds against our own countries. People who fail to understand a simple logic behind things like these are the reason behind India not being as prosperous as it should have been.", "luiz_carlos_de_sa": "👑⭐🌟💖🌻🏵🌷🔝🔝🇧🇷🇧🇷📷📷", "thepugmumma": "Sirf ek pic k liye itna bhashan ... pic upload kro kon tumko kuch bol rha h ... phele hi excuse", "diary_of_a_riderr": "Awsumely written", "sreyas.g": "@pretty___little___psycho you have a point, i must say.", "mehak7896": "Just doing this for cheap publicity", "harshi_2897": "Why the hell people get so offended when a somebody just states their opinion !!!! If feel opinion is right then it feel free to follow it if you feel she's speaking bullshit dnt follow you guys secular and matured enough to make your own decisions.... what's point commenting hate here she is doing to do what she feels.. she not gng give a damn so chill....dnt take to much effort to prove her wrong.. you feel she's not following indian culture and all that you follow Indian culture you follow it doesn't mean she should follow it.. you follow Indian culture why don t you guys wear dhotis and sarees do it become a true Indian 👏👏👏👏👏... ... why are guys wearing jeans pant the true follower of Indian culture????....", "devaaredevaa": "@richaasfuck", "humera_123truly": "U r ryt @darkvoicerises", "rupali956": "@akanksha_s16 @poori25", "rohit2box": "U play them video games though, right ?", "manoj_saini9": "Wow Beautiful", "pandit_gulshan_sharma": "😉", "fitnesspsycho_trainer_ashish": "Words 👏👏 Right from the heart", "snehakreddy": "Atleast she did something you couldn't @pretty___little___psycho", "saanjh_gidwani": "Dear @redheadwayfarer ,u really don't need to give anyone....any explaination!", "sandeep_4492": "Looking sexy beautiful babe......", "ruhani.nomani": "30 % hindustan me bijli nahi hai, uska kya hoga?", "abhijeet_mahat0": "It's really good to see that you were all by her side while that psycho was disrespecting her and what you all did was really commendable .... Proud of you @dark___paradise._ @skinwalker_ani @perry_arora @dishasadhnani", "itsnandinisingh": "Preach! 🙏", "evi_f98": "By showing your breast you wanna prove your point? It is just that some things are not acceptable in our society. breasts are something which you should cover not show to everyone just because boys can roam shirtless Peace.. P.S. Im not those guys who judge a girl by clothing if a rape happens its the boys fault I support the girl always..... Just want to say keep your self modest it suits everyone", "sailu94": "@pujithaa", "mr.slickmonk": "I love you soooo efffn much!!!!❤️❤️❤️👋", "anubhav1412": "As much as the message itself, the media is equally important to make any impact, so choose a more appropriate medium so that ur thoughts reach the intended audience", "mukul.saini.007": "Dis really made me into tears 😣😢", "___i.n.t.r.o.v.e.r.t_": "@marcopolo_6400 read caption!", "vinay.mishra21": "@bhuwan83 @ranvijay.rnvjy @ravisingh_luv @kanishk_toppo", "thehimalayantahr": "@snigdha.o8 can you go out with your parents in a way she's wearing the shirt and feel comfortable", "pvtt.m": "@soumya_nanda @meher_dugal", "reasonofliving": "@harfanmastmaula I looked at your profile. Pictures are great they are so good that they tell me you have an eye for creativity. @redheadwayfarer post didn't completely make sense to me as some parts of it may be right but some are completely vague. What you are saying about nondependence of lust and exposure may be right to a certain extend but you cannot deny the fact women are looked and stared at all the exposed places of their body. I as a woman have faced that now and again.", "vs31072014": "Salon Chopra is my mom", "f.ree_bird": "@hiteshisweet007 sister she z awsm ❤️❤️", "hiteshisweet007": "Yes she writes good 😘 @f.ree_bird", "skinwalker_ani": "@harfanmastmaula Okay fine. Let's UNWANTINGLY accept your point that she did do this for publicity. But tell me one simple thing : what have you got to do with this? Why did you post a comment and get into a \"debate\"? Do you know her personally? Are you a friend of hers? Are you any kind of a relative to her? The answer is of course NO. Then why the fuck does your ass puke if she posts a photo? You don't like it? Fine. Just scroll down. Why to hurt someone's sentiments,asshole?", "dark___paradise._": "@choprajyotsna you go girl.", "burakkelvan": "❤", "rannvijay_prince__varun": "@redheadwayfarer I can say this confidently no else could have so much courage to post this other than you.You are inspiring the society and a 13 year old girl too. India needs more women like you and I wanna be one RESPECT YOU😊", "ashishpandey__": "Please check your DM", "_myk_23": "Caption.💁@zainab_aqil", "neha_pandole": "She can do watever she want. It's her choice, we r no one to tell her what's right and wrong.😏", "geetasardar": "Hlo", "anahitaz": "so incredibly powerful and poignant. This needs to be shared everywhere in all parts of the world because the battle for equality is far from over. Thank you for writing so beautifully @redheadwayfarer and fighting for the cause every dignified and decent man and woman should be fighting for. Please never stop no matter what ❤️", "stardivakhushi": "You're power my love! So are your words and thoughts! They speak so loud even dumb could hear 'em ❤ I support you in everything you do and I appreciate the authentic YOU that you are inside out, know why? Because that just feels way to right not to. Go on. Keep inspiring and motivating us all around the world.. sending much love and light from India ❤💕*respect* 🙏", "aakanksha___": "Omg..the caption made me cry.. you are an amazing role model...and so inspiring and motivating..i love the way you use your platform to speak about the things nobody wants to hear..the truth..so much love😘", "sparshhsagar": "Aise thoughts se feminism kisi or hi direction me ja rha h...take off your cloth in public is women empowerment ? really?", "_.iiqqraa": "All these fuckers commenting shit just shut up. honey u r absolutely right these men commenting crap r the one who encourage rape culture..n u look stunning n gorgeous", "zabirkhan7867": "This is not Indian culture please", "psycho_mind_92": "@rannvijay_prince_varun... About posting a picture exposing her part, well their are millions who have posted similar or even much more exposing pic. About inspiring yea, very inspiring but in negative way, taking heroine just to show the youth, harmful effect of heroine and inspire them not to take heroine is not a positive inspiration. Inspiring a13 year old girl ummm i would not like my 13 year old girl coming to me with her picture and say \" dad why she don't have cloths to wear but have phone to use instagram ? \"", "anisha.223": "This post is so on point..@redheadwayfarer ...girls should have the right to wear whatever they want, where ever they want to go, n live their life on their own terms. ..we girls don't need the society to tell us what we should wear or what we must do .we are mature enough to make our own choices..every individual on this planet have the right to live their life on their own terms. Ur post re-affirms the fact that all the girls have the right to live their lives the way they want....❤", "bodhsanskriti": "I respect your thoughts", "gauri_lp": "@redheadwayfarer I am so bloody proud of you. So proud. This post made me cry, honestly. People refuse to understand that this fight is about freeing the female body from norms and stigmas. It's about understanding that the fight for breaking the societal constraints surrounding the female body is the biggest fight. How can a girl achieve her dreams if half her life is spent being tied down by what she can or cannot wear? If every day she keeps wondering if her bra strap is showing and how that will attract unwanted attention? If even her basic biological needs are surrounded by disgust, ignorance and more ignorance? This fight is about understanding that our body is ours. You don't get to decide what we want or not. It's about understanding that we the restrictions placed upon us are not only wrong but sometimes painful, both physically and mentally. This is a fight to stop people from telling girls that they should be careful and not be out in public, late at night but rather to tell the boys that girls are humans too and force shows how weak they are. It is to understand that we do not want more rights than men but we deserve the same respect in all regards. Its about having a choice and deciding what we want. It's not about the culture or religion or men. It's about women who are not allowed to be comfortable in their bodies.", "abhi_sambyal7": "The way u try to tell something WD ur eyes is not explained?❤❤❤❤💋💋", "nissaxbello": "@sabrina.pradhan read. I fkn love her😭", "the_moods": "@gautamik06 ... Ye caption padhna 😍", "khlyfbwyslhwr": "ارضع وانيك والحسسس", "cit_bermudez": "Is this sarcasm? Is this real? I'm so confused .. Women and man can do whatever the hell they want with their bodies, is their own choice. Fuck everything else", "lookbeyondlooks": "There is so much power in what you say and the way you write. #GirlPower", "prish_shah": "Wow @redheadwayfarer you always seem to flatter me and many more with the power of your words. Less is more and you have said so much about feminism in such little words. People like you truly inspire me to never feel bad about yourself be as comfortable with your body even though ive been a victim of body shaming thank you for giving me courage❤️❤️", "saisnigdhaa": "YOU HAVE NP IDEA HOW ENLIGHTENED YOU MAKE ME DAY BY DAY WITH YOUR ANGELIC WORDS ! I hope youll read this cuz i want you to know i used to be like this ... about an year ago .. girls cannot wear what tgey want .. but ur posts n captions REALly really changed me in the best bravest way possible 😭😭😭❤❤❤❤ thank yiu for being you and never failing to male me smile", "ritu2564": "#Respect...so proud of uhhhh", "shanaya5960": "Respect😘😘😘😘😘😘😘😘", "nish__it": "You right my mind always people judge you because they can't handle the truth they wont agree too but what you write and post is inspiring for girls who are still into suffering may be not physically but mentally and boys and your today's caption is so true to which again boys wont agree and comment nonsense on this but trust me girls who go through this will get a break through in life ❤️ and thankss", "anshika._28": "I am addicted to your writings!", "nidhi_mehra97": "Caption and the picture 💝💝💝💝", "colour_me_crazy_customs": "@redheadwayfarer Fact beautifully written :)", "_asfiah_": "I like ur words!! U make us realize our values", "charanunlocked": "Great respect to you... Love all the ways you portray girl power ...", "pragatiijain": "@noorulain_ayesha v true.", "zyan_4": "#respect", "whippedpixies": "Yours words are divine, there are very less people like you in this world. People will always judge you no matter what you do but you need to follow your heart and do your own thing. Be the change you want to see in the world. @redheadwayfarer loving all the way from Delhi xxx", "prajwal_rao16": "Respect to uh man 🙌🙌", "kaushik95v": "@meghakhaitan96 brave & sensible cmnt🙌🙌 u got nail hitted right on pnt!!!", "dishasadhnani": "@snigdha.o8 I'm scared that you're going to be a psychologist. Nobody deserves to be belittled or die or done evil things. No country should be put down for a little lot that is portrayed by the mainstream media. Also, feminism of one girl could be different from that of another girl, because we're different, our struggles are different and so will be our voices towards the issue. If only, you take a step towards seeing it in a more realistic sense, it will help us all. :) Also, I, in no means intend to hurt you here.", "madhurimamyla": "#educatehumans 😇👌🏻 ur correct Saloni 😊#keepeducating #poorbuddies", "shubhamkumarr1": "Demn", "wasifmirza": "I really dnt understand one thing . If some one hv a problem with her post unfollow her . It's her page she can upload n write anything . This not a debate room .", "divyanka_tilwani_": "@harfanmastmaula just go through the comments and and read it aloud in front of your parents you'll probably find your answer", "tamannads": "@dark___paradise._ then u also do what she is doing.. Go naked, post ur pics n write down huge paragraphs on ur defence. Who stopped you??chillax.. Im just giving my opinion.. Girls should seek respect rather than attention.. U want freedom that doesnt mean u will go naked n also will encourage people to do the same..", "devansh_0306": "@harfanmastmaula ya sure they will offer u tea as well as water,there are so main Jain people also wo rome nude people doesn't get offend of there dress,but when a cheap disgust people rome nude with proud and disrespect other like u will surely get a fuck!!😊", "the__quirky__soul": "*sorry to break your dreams because I'm glad that no girl will have to tolerate you. 😊. and moreover nobody is stopping you from fucking the world mummy and papa ke saamne sir uthake.. such gentleman.. true respect. 😂😂 @harfanmastmaula", "me_akshayshinde": "Loved what you wrote @redheadwayfarer more power to you and girls out there.. #wonderwoman :)", "samar_mark69": "Superb", "the.wyldeee": "Well said girl if boys are shirtless oh so sexy he's trying to show his abs and all if a girl doesn't use bra or without bra she's prostitute what is this time is changed now if koi kuch bolega to uska answer v aache s milega", "animeshmishra_": "@tamannads are you serious? Did you really read what was written? I guess not. You are really making fool out of you by saying that she is going naked and encouraging it.", "villain_varnan": "Best you can write for equality ✌️", "mariashaikhx": "Wearing wht you want is a freedom!!!please NOTE!!!!!!ND PLZ DONOT COMMENT ABOUT EQUALITY OF SHOWING THE BODY PARTS!!! isse achaaa aaapnaa nazariya badaldo hum khush hai😂👏", "gutavantika": "Your fight to be naked is very inspiring , the only way to empower women. Ofc education , job opportunities doesn't matter", "saini.akki": "But still i respect your views 💯👍", "omkar_2702": "I don't know where this comment section is going to, but i feel that we have tried a lot to keep our 'females' in control, we have hidden them behind Burkha, behind ghonghat. We didn't allow them to go out whenever and wherever they wanted to. We didn't allow them education, we didn't allow them to choose what to wear, we did give them any freedom. In short we put them behind bars, but still everyday we get to hear a new story of how a woman is raped, how she is tortured to pay dowry, how she is forced to stay in the kitchen learn all the household works, how a five year old or a three month old is raped for no reason. So, what i think is we have controlled them a lot but didn't get anything good out of it and now we should start controlling our men our boys. Teach them what is right, give them some cultural knowledge and leave the girls aside for sometime. If men start taking in these messages then i think equality is not far away. Stop keeping an eye on girls, keep an eye on our men.", "arohiamorea": "More power 👏👏👏", "choprajyotsna": "@tedddyyyy_07.09 if men can go around shirtless. Why can't we? And who are you to judge or comment. Don't like it. Just move on. Why so judgemental and cranky?", "_ppragyeahh": "Loved each and every feeling written here🌼", "priyanka_gupta31": "@saini.akki what you think is great and have the potential to change the society. We can't alone do this job of changing people's mind which discourages me but if boys like you will step up with us, the change will be inevitable.", "ohiduz4629": "Sexy", "the.virgo_queen": "I have no words left to say. Just hats off to you 🙆 @redheadwayfarer", "gazorpazorp90": "@poojasheetoula I would think that freedom over your own body would be number 1 in terms of equal rights, no? The fact that women's bodies are not their own is a thought that scares me. Doesn't it scare you?", "j_meghana": "@shiv.any", "the_sadist_creature": "You go girl 👧 and keep posting one day your stuffs will reach to every brain of this culture", "poojasheetoula": "Exposing bodies doesn't shows that how free we are living life also pic like this which posted by celebrate and normal girl creates a vast diffence in case of response ..yes u r good writer a good motivater but girls and women freedom do not come with showing bodies,clicking pic in swimsuit and uploading with 2paragraph of lines which are not even implemented to normal girls life ..@redheadwayfarer if you want to motivate than motivate boys and girls in girls education,safey,show their trouble in various field always posting such pics dont change the society view on particular topic they will just get your opionin ...nyways love you", "_iammeever_": "And I love you from the bottom of my heart for this kinda things #hatsoff", "puttu0108": "U r an amazing soul.....love u n respect ur views so so so soooo sooo mchh😘😘😘😘😘😘", "krishnakhi_kalita": "@k_surana ❤❤", "_expelliarmus___": "In the world of getting freedom of education, equality rights n much more important things.. does being naked is really a freedom.. infact do we..'WOMEN' even need it?? Really?? I'm sure.. here around 4o% of the guys will not comment in support if u were somewhere obsess or dark complexion... see here is the difference... we need the freedom of complexion..freedom of body shape and size.. n many more important things... do the freedom of nudity even matter in this outgoing world??", "nehasaha__": "@kashishthapar caption", "simranchhauhan": "@redheadwayfarer i love your thoughts ❤❤❤", "tmnnaaa": "@zr_safa girl, I feel you.", "rahila_roo": "She resembles you so much @anusha.vijay.73", "aliv_viaa": "caption❤", "vet_maddy_27": "true !!", "hirockbasu": "Maa kasam i like it", "sujata_bhandari_75": "Superb👌👌", "devyasshi": "You have been such an amazing writer who makes me feel better and confident!! I love you so much 🤗💙💙 such an inspiration 🙌🏻🙌🏻", "magicalivi3": "@aloksikdar Read this", "___v.26": "@poojasheetoula so damn rght.. Everything i wanted to say💖 exposing bodies is wrong.. Women empowerment dosent means that.. It means giving equal right like equal job opportunities.. Equal rights of opinions n views.. These r the rghts not showing body😑 so wrong the society is😑", "aakanksha_baijal": "I am just so inspired by your thoughts and happy that people like you exist. Who truly understand what equality means. Hats off to you💗", "dr.pratimachaurasia": "Great", "preranaupadhya": "Exposing body in your language might mean accepting who you are and you trying to convey a message that we should also accept the way our bodies are meant and love ourselves but people here are mad on YOU to upload something on YOUR wall and YOU trying to bring a change.. now the thing is I complain agree with you and your sayings but the message that also should be conveyed is that the parents should raise their sons in such a way that they shouldn't raise their voice in front of women and treat them like a NORMAL HUMAN BEING", "radhikanagpal_": "@iakashrana well it was just for an appreciation,no kind of publicity needed. So chill boy.", "jeevanpandeyyy": "@richaa_guptaa u r right", "vindiyahalankar": "Wow. I really liked . It's true. We should not leave our culture", "aditisardaa": "OMG. This is just amazing. The way you expressed it was fabulous. Proud of you❤", "fitnessfreak_rahul": "Looking gorgeous baby and hot as hell", "shrishhtirawat": "So many people commented. I read all of the comments. people support your posts, your thoughts, but that is temporary. As you posted one story of supporting pakistan from that moment only i started hating all the things you do. You cannot do that lady, you're an indian and every fucking person know what pakistan is. I hate pakistan not because that's our dushman or what i hate them cus kitna bhi karlo bhai unko bas peeche se vaar karna aata h. Look at the movies, sarbjit, bajrangi bhaijaan. they will never learn to love indian people. You talk about girls, i appreciate, that's really nice. But there stands so many mothers who don't even allow their daughters to expose 1 inch of their bodies. Then you talk about exposing bra's, being free. This may be easy to you cus you have super mom. Think from other people way too. You're beautiful and i love your posts just start knowing about we who aren't celebs. And you'll get to know a lot darling🖤🇮🇳", "zr_safa": "@snigdha.o8 Since you're such a huge fan of the Indian team, I'll try to put it this way. Saloni is the Pandya who is trying to win the match of equality that was destined to be lost. You're the Jadeja who's stopping her despite being in the same team. 🙃 #sorrynotsorry", "amey.malpathak": "@redheadwayfarer I surely know everything you spoke is so true. things are changing Saloni and we just saw australian MP larissa waters breastfeeding her child last week while speaking in parliment. Little step but we are breaking open. Comparatively situation is worst in rural areas of india. I tell you Women here are equally responsible if they are trated as sexual object. A mother discriminates her child based on gender. Most should consider themselves lucky to be born in metro cities in the hands of good people. Education is the key here. Hope the day will come soon and you dont have to express for millions of girls out there.Ur arts are super. Keep writing 👐👐 @gosaliamansi", "kuldeepsinghpb22g": "Nice", "akshita_guptaa": "@project_am", "richaa_guptaa": "we r indians...Nd Hume indian hi rehne do for God Sake...Humara culture hi humare India k Pehchan h...Nd u right those men should b punished harder who see ladies in a wrong way or do something wrong...Humare India me ladkio k jitni respect ki jati h utni Khi b Ni..Don't forget that..and ya in any country any place every where achhe or bure dono typ k log hote h...", "shetkarsayali": "Awesome 💖", "prachiix": "❤💯💯", "avengers7777": "Superb", "the_fifth__marauder": "Marvelous👏👏", "rakshana__": "@redheadwayfarer I love Ur thoughts 💕💕💕🍷", "crazyspeakr": "@shrishtilakhara 👏👏👏totally you express what I want to say..", "_salonish": "✌✌✌✌i m in love with you and ur thoughts", "vampire.70": "@redheadwayfarer", "aminesaaad": "Karishma kapoor", "vijaydubey302": "Hott bby", "_.rxzx1._": "@unexpectations_", "mohammed_faizan2101": "@pie_elle DUDE SHE LOOKS SO MUCH LIKE YOU", "abhilove.bhattachariyagmail.co": "Sxy", "rishiee_rish": "Mini Katrina 😜", "photos.susarla13": "I find many young women inspired by this view, but hope the message reaches the intended men. Deglamorising a woman's physical body must begin in all fields of society right from movies to advertisement. Probably women too need to cooperate by denying to get portrayed like that by saying no. Liberty to wear what any girl wants should be absolute and probably it will take another generation before the dirty minds get a lesson. It is sorry state of society that reflects in many comments that abuse the writer as they cannot withstand an alternative view point that is against gender stereotyping.", "apoorva.pandey99": "it is not everyone's cup of tea mam it is something every girl should take a stand for for a man can with no prohibition can go on the roads without an T-shirt just because he does not have the fear of being molusted and neither would a girl innitiate rape culture so this is something the girls community who is abusing her should do is to get themselves educated and breathe some fresh air so that it opens nerves in your mind amd maoe it a broader one from steaply being narrow minded", "in_herworld": "@_ekonkar_ 😎😎", "neemakoche": "Everytime sarcasm never makes everyone laugh! That sometimes should come many a times and you should think there's nothing to ignore these things! Go take a stand for yourself for you being a girl! Can't you? I know you can, you can definitely.. bring a courage which is hidden inside YOU!", "lord_kapil": "Hahha chutiya 😜😜", "the.august.gurl": "The caption touched me 😍❤", "gurkiran_toor": "💖💖 your words girl, are so prominent.", "naresh_garlapati": "@redheadwayfarer All the haters if you are against me neither try to message me nor send a friend request to abuse me.Truly speking I don't afraid to anyone whenever I speak in the right way.", "flickeringminds": "❤", "lafemmefiji": "I took the time to ready every word and I'm grateful I did. This has enlivened and reminded me of our responsibility as women to speak up against daily injustices to make this world a better place for everyone. Thank you for this post.", "b_rvi": "O Really.. HAI KUCH DEKHNE LAYAK... ITNA GURU GHYAAN MAT PADAYA KARO, JO BANDA THIK H WO THIK HI RAHEGA, or Jo MC h use Tum Kya Koi ni Sudhaar Sakta... 😏", "aparna11__": "Mc ki bacchi nangi ghuma kr fir aur yaha india mein kyo pakistan mein ghum nangi bc ki aulaad", "davianna333": "You rock @redheadwayfarer I am so proud of you❤", "sakshi8624": "Diii i am proud of you tysm for speaking bez there are many who just pretended to SPeak but ...you are an inspiration who give motivation to others to SPeak and stand for thereselfs", "soumyahahahaha": "😭❤😭❤", "nimishajajodia": "Your post are really inspiring. It leaves me mesmerized. You are a perfect package of \"bold and motivation\".", "abbasimaham": "So fucking true. Girls are not supposed to discuss their own biological anatomy.", "saadhassanrafique": "👌🏼❤️", "__mehhhvassshhh__03": "But as far as we regard women as precious..so being precious needs cover too...u are open to a single man...is enough...well being open to all physically loose the charm of ur body...does feminism really being all naked women for all mens..do u ever have or use anything if the packing isn't good or its loose", "kristin_shinesss": "sarcastic ^-^", "iamkushalhabibi": "@sleepinginthegarth Give this man a cookie", "raahiuniverse": "In spiritual world, there is only one soul. Not man or woman. Not nude or clothed. Its just supposed to be a \"pure soul\"", "rahulchoudharylive": "Middle finger for your fuking Pakistani sticker post.", "xxsam05": "They may rape us, they may touch our bodies, but no, they can never touch our souls, they can never rape my soul. My soul is too profound and deep to he touched by a hand to dirty and sinful. ( this is what I think, but hats off for encouraging us to be who we truly are)", "chubbyme_22": "Caption😇🙌", "ishanij21": "@avi714 the caption!!!! 😭", "aishazareen_": "Our society needs more saloni chopras. 🙇", "kapilatreya": "i think sometimes you should write about what is already good not that you want to change", "s_harun_r": "..Amazing", "thenotorioustedz": "You are love Gnothi ❤ We're still far away from the world we wanna see, just hang on, believe me we'll get there @redheadwayfarer :)", "singhrajput_pavi": "Those stupid men and society forget that even they ve grown up by the breast feeding of dey mother and every time dey point out any female it's like pointing out they own mother", "vyasrohit2003": "Proud of u", "nixondhall": "Post some pic in bikini", "deepanshu000052": "@dipikawrites if stripping your clothes means women empowerment then I am against it FEMINAZI'S. Watch video on youtube \"choice\" by priyanka chopra and see how definition of women empowerment is defined to get attention.. by the way - you see redheads indo pak post - and say if i am wrong that she is not an attention seeker , \"Soch badlo desh badlega\" ✌ don't get personal that shows your upbringing.", "riyamatta98": "@shrishtilakhara totally agreeing with what you said!!!💜💜 finally someone said it..", "payal_pedkar": "Caption😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "jyotiburagohain__": "👌👌👌💓💓💓 such powerful words 👼", "zaaria06": "Absolutely love what you have written", "suhamalik28": "I like your shirt and definitely not the rest,regardless whatever cause made you to pose this pic,things can be said without posing such clicks.. anyway your choice,your life,I will still be your fan and a well-wisher....", "ratan_nayak": "Your hotness picture 😘😘😘😘@redheadwayfarer", "arfainnnnn": "Every single thing about you inspires me each day ❤ @redheadwayfarer", "saltybuttercup": "*slow claps* 👏", "arunsharmaforever": "@devika_rajput01 muje pata tha asa thikha comment ane vala hai 😒😒 isiliye mene saaf saaf likha hai agr apko kuch shi nhi lgta to phli baat usko like na kro tabi like nd dislike ka option diya hai.. second thing comment krna hai to sida bolo \"no its wrong i m not agree with ur statement\" thats it...mene upper comments pe khi nhi kha ki muje asa pasand hai..agr apne comment dyan se pada hoga to mene kuch asa comment kal b dekha tha..isiliye bola mene btw u r independent to think..u can think whatever u want .. I really don't care..nd rhi baat @redheadwayfarer ki..khabi khabi muje b inke post thik nhu lagte to iska matlb ye nhi ki mai abuse pe. aa jao ..mai sida ignore marta hu..nd ab koi b banda ho juri nhi humko uske sare views ache lage ..this is what we are..we are humans we all have different thinking and mentality...and mak fir se bol rha hu mera vo comment sirf apke words ke liye tha jo apne words use kiye ..", "__escapewithmee.__": "Caption 👐👐👐 hats off girl u always being my inspiration ❤", "_sariv": "This caption drives me crazy👌...in luv wid ur writings nd wd u too❤keep inspiring 🤘....more power to you🖒❣", "iakashrana": "@radhikanagpal_ I'm chillin gurl 😂😂 you also chill and make your thoughts chill . The girl who's herself confused talkin shit and you're getting influenced", "supertramp8541": "Again this feminist shit", "ifrafarid": "Ur every word makes me fall in love with u all over again😘❤ tones of respect to you✌👍 @redheadwayfarer", "nehhhaaaaaaaa": "Caption👌👌👍 and u are totally right 💯🙌", "nandini_281": "Hey ...I salute u fr ur thinking ...lyk srsly.nowadays even women doesn't respect another women .... U doing such a fantastic job by posting such a caption ..u know WT I felt weired when I saw ur pic ..bt after reading ur post ...damnnn srsly 💚👍 I think every girl nd boy should have DIS MENTALITY like u ...💜😘 @redheadwayfarer 💜💜💗", "surbhi97gupta": "Powerpack💪❤", "mizz_kakkar": "@khushikalra_ yeah uh r ryt....that's why I hate this fuckin government nd society nd those dirty minded men too....bss hope h jldi sab thik hojaye....😠😭", "janhvii_singh": "@bonker_2819 even i wish fr same.. she is true inspiration yr... love u mam ♥", "tarushihihihi": "I wish world have lot more people like you. 😊", "_itz_me__nipu_": "1st U posted it.. And then you are lil insecure about society.. Don't explain please..", "bazinga_0.0": "@mary_angel2000 isko follow kr iske thoughts 😍", "swastika.kharbanda": "You are an inspiration ma'am.", "jaymilasooben": "🙌 preach girl 🔥", "sonam_sharmaa033": "Loved this post... very deep thoughts 👍👍", "harman_sarvaiya": "Hot", "kaushik_cnm": "Sexy", "harman_hanspal___": "Ohhh gawdddd you're sooo damn amazinggg... Love each and every thing you wrote... You're an proper example of feminist... Yes our parents tell us to top in the class to do the best way n education but why don't they understand these things ... Why our society don't except all this... I was also that kind of person Jo pehle apne parents jaise sochti thi... But I'm changed alotttt... And there are some people who bring the change in me... And the one and most imp is you from them... Really now I'm a changed person a grown up person... And am moving what am becoming... Thnkiew sooo much for inspiring and motivating me to be better person @redheadwayfarer I love you and plzz keep on doing this❤👍", "steph.simon_": "@nitz.rastogi read the caption babe.. This is the reason I love her and respect her.. Her words are just commendable 😍😍 @redheadwayfarer ma'am more and more respect to you 😇😇", "abbassheopur": "@ayushii_v", "onelastcigarette_": "Bas bas bas :p", "sony_parmar999": "@pushpa_mangu", "guptashally99": "Even though I am not fully agreed with you. but I love you 😘", "callme_sanju_": "I love you saloni 😘😘.. And your posts too😁😁.. Can you please say hi to me..", "imnvdeepbajwa": "Awsme lines dear..well said..👍👍👍👍👏👏👏", "reflection_can_be_seen": "I appreciate wat u r doing keep the good work going", "_parwez_khan_": "Nice", "_poojaashish_joshi_": "Well hats off to you I just appreciate watever u told Damm every word written here speaks all girls condition...!!!!! I love you thoughts and respect you so much I m biggest fan of urs @redheadwayfarer", "wonder_peace_": "@redheadwayfarer looking pretty hot 😍💓", "piyushagarwal1634": "I read ur this caption today its really a considerate matter apart frm that at times its to bore to read all the long paras keep it small n sweet 😅", "gishaa_23": "Yes Mr. @deep_brandy her nose is much bigger than your cheap mentality ..✌ why don't u keep your baseless comments in your pocket", "stranger_foodie_97": "@priyankasingh4841 girl", "yaminiparnami": "👌", "lamia_nishika": "Respect !", "mayanksharma.ind": "💯", "neha_bramta": "respect depth of my hrt .", "siddharth.vats": "Love on the in innocence in your eyes these pice really sense a lot ..... every girl should read this and should make it worth ... this is a thing or a quote or a statement rather which I fully support by heart.... my sister is totally an example of a statement like this ...and I am very very proud of her.... she is one epitome over every thing written over girls...respect and love ... girls are a boon to our society treat them as such... they are the source of a smile of every being ... just one thing respect the mm and unhain safe and aacha feel Hona chahiye..... be one be lovable", "_broken_heart00": "Thought 👏👏👏👏👏👏👏 amazing", "kostbarruh": "@ribahkhan I want this blue of her hair!", "vivek_thakkur": "SpeechLess 🙌🏻Respect 🙌🏻🙌🏻", "amarmishra811": "@highoncaffeine_ u don't need to think about ppl judging Madame. Wat u did was ur decision. NVR eveR b afraid of exploring urself. To deep into Himalayas. U vl find many of u getting d much needed strength n inspiration to do this. God bless u forever.", "akash.anil.suvarna": "Hats off very well expressed @redheadwayfarer", "gogo_skae": "@redheadwayfarer gorgeous n well said 🙌🏻", "donna27gmail": "😄", "shivajisisodiya_": "@avikachhawaha really amazing... I m truely agree with all ur points...", "bhadauria_anshula": "Caption 👐 well Expressed @redheadwayfarer 🤗", "arya______kashyap": "Damn every word written here speaks every girl's condition !!!!....thank you so much for being our voice!!❤❤💋💋", "sharmi_bonny": "@lekharoy yeah in some terms", "mayank_no_where_is_now_here": "😇🇮🇳👍😇", "nocturnal_life07": "Ur nose is bigger than ur boobs", "rutvi_rao96": "Your thinking is beyond imagination Bro !hatts. Offf🙌🙌", "highon.3am": "@redheadwayfarer I do not think sarcasm is a way to talk about feminism at all. I remember being deeply inspired by you, and decided to explore my sexuality. I uploaded a bold photo of me ( honestly wasn't even bold. A bralett picture with me flaunting my back). But I remember being mocked at. All of a sudden, people became worried about me that I was off limits. There were questions about my character. Unlike you, I had only a few friends to stand by me. And so what? I deleted the photo.", "muskanndhawan": "❤️", "bhumikaaa_._": "😍", "somadrita__": "Amazing @redheadwayfarer 👍👍👍", "avikachhawaha": "Our society never want to hear about boys being horny coz they hv right to do so but if girl feels attrctvr to sm1 thn she shud be ashamed of that coz she is girl ...like seriously just coz we dnt hv penis tht means we dnt hv right to feel free 🙄.....i justttt love youuuu for writng those stuff which every narrw minded person need to hear ....you rock❤️", "chaosandparadise": "These words should be screamed out loud💙", "mr._.pandit": "Amazing .....sonali...chopra", "myownlittle_world_": "❤", "_mehakraheja": "❤❤", "isha.kakodker": "@trippy_hippie_10 read this Mog", "abhijeet._joshi._": "I follow her just cz these words u r really amazing ...."}