{"smit.gupta1": "Above all", "ashhhhh.lyy___": "Right saloni ma'am 😉✌", "sshhharonn": "Those damn pretty words in ur caption 💕#inspirational 💌", "ananya_saxena666": "You're an inspiration! ❤", "manii_06": "Respect..😘😘", "icreateeffects": "The only thing I can imagine of, is project x23...need one more nail paint brush **sigh** ^_^", "aayushi_990": "Girl ! U Are An Inspiring Soul 💫..And A Great Human Being..Much Love N Respect ! 💝🔥✨💫", "vjvibes777": "Your nose is like a swan. Prettyyy", "its_wingardium.leviosa": "Girls should be like you.... Such a youth motivator..... Babe keep this attitude onnn....", "thebrowngirlmusing": "This post made me scrreaaammm Helll Yeaaaaa!!!!!", "veee_whiskey": "@____fernweh___", "rabid_dog12": "@asma_shah what", "ahsantoorraj": "Ugly", "itzsxg": "@https.amyxx @dxy_xo @http_hxniya @x_niax caption 💯❤️", "daan_kz": "@itzsxg i love👏❤️", "sudeshnasaha_": "Oh my god I love you man ❤❤you write so well it's soo good it's just amazing love you @redheadwayfarer", "unknown________._._._": "You are brave and strong 💪ily❤", "shagguunn": "@medhavisinghh", "ankitbhadana3": "Hello @redheadwayfarer! this is the first time I'm going through your stories, and I couldn't stop myself from appreciating how amazingly you put them. Usually one would want to go through the pics of any lady, adore them, hit the like icon and pass on(I'm no exception 😉), for most of their stories are usually full of poetical captions and famous phrases, lacking the real life situations and issues. I believe most of your subscribers would agree with me on the fact that it's your stories they get more attracted to first with your each picture post than the picture itself. In other words your stories complement your photos. Great stuff! 😃🙋", "hudabeautycafe": "So true.. why there r alwz restrictions on women?? Probably coz there r no restrictions on men!!! Why parents r afraid to give freedom to their daughter?its not bcoz they dont trust them.its bcoz they r afraid n they know there are wild beasts in the society. Before girls can actually start living freely they need an environment where they can live freely without any risk.is it possible? When a girl is shy she is behenji... when she is bold she has no character...if she talks alot she has no sense...if she dosnt talk she got attitude... what world are we living in!!!! Can we all just learn to be good humans first???", "moloybhowmick2015": "Lag raha hai India ekdin Miami beach ban jayega 😂😂😂", "jhadeswarkisan": "🖕🖖🤘", "soulwords2276": "@redheadwayfarer ......yes...i js go through it now..... N it's so damn true.... Y always girls hv to adjust themselves in the surrounding they live...don't forget she is the one bcz of whom we all r here.... Yes u all respect ur mum ,ur sister, ur wife then what's wrong with u y don't u respect all girls....... Still it's all words to say that WE ALL ARE EQUAL DO WE REALLY? No....how it can be equal when mindset of people will be equal....", "de.le.te.x": "Check your inbox please :))", "parth0917": "Y to ask for respect,y to ask for freedom to express yourself,y to ask for equality,ol rights given to \"humans\" nt specifically for males,,,,,,,,,,,,,,, your life-your decisions-your choices, keep gng 👍", "22bajkws": "judge me.", "udtipunjaban": "bravo lady!!!", "abhytries": "I think every human (not just women)deserves respect,freedom of expression ,equality.Elders,children,animals everyone who is righteous and pure deserves respect and equality.Although I don't support violence against women but the fact can't be ignored that each human is entitled to some respect .Feminism should not be the goal.Equality among all shall be", "warrior_667": "Superbly written mam.! Respect 👍🏻👍🏻", "jayy_joshi": "I can't understand one thing, why after nirbhaya kand.. there are so many people speaking for women but.. no one actually tried to stop rape, domestic violence , and other problems we are talking about..!! Why I didn't did it? Because you have to change people to stop these things, you have to educate them not just reply their comments in great English, and keep saying what you deserve.. I'd like to see how world would be like if there's only one gender (nor male nor female, maybe combo🤔).... When you think about these things when you're alone at 3:55 AM on a empty street.,,. You'll just feel like you got it all but not one thing, \"HOW TO EXPLAIN IT.\".....!!!", "gugusandmama": "@safasamad", "_aamaya_": "Read @sarr.punkk", "surabhi4353": "Manlyyyy", "sarr.punkk": "@aam.azing this is amazing..", "i.asmitatiwari": "She is the one who started this universe.. she's the one who gave birth to male.. but for what.. for settling norms or for making boundary for her... lol.. she's the one who gave birth to rapist... this is what society taught us .. rofl", "blackbitch2001": "@sagar_mahajan193 bitch ka matlab pata hain apko??? Iska matlab hain female dog..i love dogs...kon hain tera baap jisne tujhko larkiyo ko slut bolna sikhaya hain???....mere papa ne to larko ke akal thikane lane ke liye training di hain mujhe", "ar.ushi": "@lucifer6_1_6 Society does judge girls on how they dress. If you don't think so,sorry but which amazing planet have you been living in? And this was not about dogs or beggars lmao neither was this about the right to be naked but about the fact that why should the way she dresses be the reason she gets raped", "mh12punekar": "Aisa lagh raha, times now par debate shuru hai..", "ayushkesharwani98": "@asma_shah okay..you had your point proved very clearly until you brought the abroad thing...you're damn right staring doesn't happen more than here or does it ? Well,staring does happen even in abroad and the namecalls are way more than here ..I'm not actually going against you but all I want to say is get your facts checked 😊 Not intended for a fight 😅", "hkayneferns": "It's a funny picture though😳", "underneath1998": "Banyak orang mau dapat followers dan likes, tapi bingung caranya. simpel kok kesini aja instasosmed.com", "__prem______": "@aayu_1071 @aakashibhansali @pavitra.thacker @shivani__jha @dhairya75 Caption🔥🔥", "richaa_guptaa": "Bakwas..", "akankksha._": "@anoushka_sinha This clearly indicates what you understood xD OMFG I cant stop laughing 😂😂😂😂😂", "swarnikaasaxena": "Can I join this campaign ?", "my_ashiyana5678": "@sandeep__sharma____ so how actually you define Indian culture?", "asmita__singh": "I don't understand why so many people here are saying that 'not all men are like that' or 'some women are also bad', it's true and nobody's denying that. Feminism is not a fight against men, it is a fight to remove all the stupid restrictions put on women. So we're trying to say that everyone deserves respect and has the right to live their life in their own way irrespective of their genders, their choice of clothing, etc.", "nehasoni87": "Which lip colour is this?? Looks soo good 😍😍", "ayusch": "zlatan ibrahimovic", "parineeta_agrawal": "Whatever u wear..they are going to molest and rape..if wearing indian cultured clothes can reduce things like molestation,rape..many girls out there would be safe. It dosen't matter what you are wearing..the thing everyone should keep in mind is that the girl you are molesting is someones daughter,sister and wife. If men can think about what women should wear,then why cant they think about their own deeds.", "soniyanaugain16": "@sandeep__sharma____ dude who the hell are u to judge others on the basis of their dress!!! Swach bharat abhiyan chl rha hai u should really participate in that apne dimag ko thoda swach aur saf rkho!! Trust me u really need that bro", "singer_frenky": "Vryyy much true...I do agree....", "i.want_change": "Whenever I read ur post...i can't get over it I overwhelmed in ur words v need ppl like u mam u don't know how impactfull u write...it gives me goosebumps everytime...there would b many haters who would not support ur work but don't wry u r always gonna rock as haters gonna hate... U inspires me...u r my motivation my idol.u don't know how much I praise u..i hope there would b a day when everyone will think like u and there would no molestation,rape and all. I'm a feminist and all my power is too u bae...keep writing this always ...ilysm mam to d moon and back", "puneet_punnuu": "@sandeep__sharma____ are yrr tum sb itna argue q kr rhe ho.. Dekho na kisi ko fark pdna h ise na tujhe padega in the end sbko apne hisab se he jeena hai.. So just mind your own business.. Tujhe ye sb restrictions lagani h to wha laga jaha pe log sune that means in your family(either sister or cousins).. Bahr q gyan jhaad rha h.. Just be happy bro there's nothing wrong being extrovert or introvert until unless they both start arguing to each other..", "adityabharadwaj15": "Adorable", "hiral_bharti13": "@redheadwayfarer u gonna rock girl love you for this post keep posting❤️", "iamkushalhabibi": "The depth of your neckline doesn't depict your character, absolutely true. I always say be the change you want to be. But in the flow of being rebellious you lack one thing that most feminists lack nowadays and that is respect. You can't expect to go in a rural village and flaunt your cleavage and expect people to treat you with respect, be it a man or a woman. Each society is different and you need to respect that. There are different nudity standards for men and women in this world. Your #freethenipple is a lost cause and doesn't represent over 99% of the female population in the world. Instead of fighting for #freethenipple and #lipstickrebellion, why don't you fight for women's rights in the Middle East and North Africa. Why don't you come out in numbers and protest against the cruel treatment of women in those countries. But no, you are busy with your own set of first world problems. All words and no show is a bad virtue and makes you look like a fool. Writing inspirational articles on Instagram, who already share similar views won't change anything. Go out there and do something while there is time. Educate the families of girls who think sending girls to school is useless, educate the backward classes of the society that eve teasing isn't a joke. #bethechange", "bsm_leo": "Sexy", "shubham_nishad__": "1st think ye ki society Ko chhoro.. society jaye bhad me... maa baap bhai bahan cousin nd relatives Jese log bi exit karte h ...aur pahno jo pahnna h kon rok raha h.. yaha comment bazi kar ke q mahan ban rahi ho? n..why u all talking like shit ...nd this is not about rape ...this is about respect", "colleen.travels": "There's a line between trying to change people's thinking and making them realise. And most probably I don't think \"That this fucked up world\" will ever listen. And that's the truth. We can accept it and try to be safe cause nobody ain't gonna do it for you. Politicians stress more on financial causes rather than what should be done and due to that \"Feminism\" arose but feminism doesn't teach you to not earn some respect. The #FreeTheNipples won't do shit it's just some fucked up minds fucked up idea. Aur mam ajkal ki duniya mein jbtk logon ki thinking change nahi hogi kuch change nahi hoga. Ek ko theek krne chaloge to hazaron aur samne ayenge. Yha following badhane se aapka fayda ho skta hai, jinka hona chhaiye unka nahi. Yha bs #Relatable aur You're just as me wale milenge naaki kisiki thinking change hogi. Duniya kharab hai re aur itni ho chuki hai ki ab theek krni mushkil hai isliye keep your circles small and work for Respect, cause in the end The World Is Still Gonna Be Cruel.", "ritiksingh_": "Arre Tum Log aise Hi ladd rhe ho...Tum Log Ye Sab krte ho jisse iski post Viral hoti h... Publicity Stunt kr rhe h log😂😂😁", "north._lost": "sandeep__sharma__ I appreciate d way uve put fwd ur poiny of view with dignity nd decency...all wat u ppl r discussing bout isn't smone's perception or thing to debate on...it really won't make a difference.....it's smthing fr d society to understand....I agree wid u dat it's a social stigma in India ....but wat makes it a stigma is the mentality of the ppl...if smone comes forth wid it they r told dat it's not possible cause it's not our culture.....but changes r gud nd dis culture could be changed......it's not about right or wrong...it's about freedom....", "arushibhargava1": "Shemale", "ritz_297": "Awesome caption ❤️", "zr_safa": "@iamimpulsive Just as guys like you deserve to hanged. After getting electrocuted and guillotined. :)", "arpita_0701": "Love it !!", "saini_sukhmani": "She is 😑i just dont like her yukk", "pnaazz": "@embellish13.3 this is that girrrrllll", "deep0k4rawat": "Nice", "veronii._.pepperonii": "\"Women are considered as fragile but I've never seen anything as easily wounded as a man's ego\"", "sunitashrees": "Nyc", "tik_ltok": "You are goddess", "humera_123truly": "@redheadwayfarer", "hansoloandsoami": "Youre always so beautiful saloni ❤️ and also the best thing that has ever happened to india! @redheadwayfarer", "_ur_truly": "caption👌", "the_ordinary_vaib": "@sandeep__sharma____ brother, you can not impose your thoughts on others. You can not ask others what to do and what not to. You do not own others. You can not only talk about one point and disregard the other cruelly. You have to think from both point of view and then present your point. I agree with you on the account that our culture is the oldest amongst all the others and we should respect our culture but don't be stereotype. Girls and boys should respect each other. While male had been the head of a family, the female had always been the engine that drove the family forward. While male is the protector, female had been a strength of a family. Please don't be a foolhardy and comment for your ego. Present your opinions in such a manner so that the other person recognize it and maybe consider it.", "prajjwal_singh_solanki": "then you are free to walk naked", "coffee._.over._.dudes": "@shubham_nishad__ ...bro i agree", "insidethechaosofmymind": "Well said girl", "sillyy.soul": "@sandeep__sharma____ if you are that follower of Indian culture then I wanna ask you one thing! Child marriage, Sati system, Dowry, Male Domination, Marital rape, no girl child, Honor killing these evils were in the Indian culture. So are you following it or not?", "sonusoni5066": "Nys", "butter_chickkken": "You couldn't BE more right....hat's off girl😘😘😘", "perry_arora": "@iamimpulsive I find it strange , that a man who is conceived in his mother womb for 9 months connected to her and her feeding and her emotions , fir wo apni mother se janam leta hai , MILK OF LIFE peeta hai . Usse grow karta hai or badda hoke kisi aur ki sister ya mother ko ye bolta hai 'she deserves to be raped '? Society ko tujh jaise loggon ki naked soch se darna chahiye naa k kisi ki naked body se !", "aladin_ar_chirag": "Wash you black pussy...I'm coming", "alicetigga": "Bro the caption slayed my life @pratibhakujur ♥️", "swatigopal9": "So powerful😭🙏🏻✨♥️", "mrudul0512____": "@perry_arora agreed👍", "_amit.ar_": "Fck..she is askng to fck u", "taheseennusrat": "Chiiiiii sooo ugly looking", "baba_yaga_01_": "Yeahhh true!!!! The world deserves a lot of people like you.", "garykaurk": "Well said👏👏", "kmani786": "I really appreciate your powerful posts...but this looks great on social media. Reality - nothing changes. Shameless perverts don't have conscience.", "sanoberkhan17269": "kitni buri lgri h be tu", "_anesha.das_": "Right .. I don't get it why people like interfering in others matter so much.. if you are comfortable in revealing clothes thn wear.. if you are not the don't simple.. why advising others not to wear ..?", "realsubham": "Yeh Kya chutiyapa Hai yaar, #feminism ka Issue ko Itna abusive bana k rakh diya Hai, #depth of neck line #cleavage what the hell is that ??", "_aryaj_": "@redheadwayfarer salute you", "soumyacs13": "Wenever i see ur posts, u r the actual voice of d inner me.... Love you for that..... #BeYoutiful and Thank you :) #LotsOfLove TakeCare @redheadwayfarer", "kalyaniaggarwal": "👏🏻👏🏻👏🏻", "pharquinnmadass420": "@mooh_mooh_mooh look at dis hoe", "srsddmmyy": "I love your writing👍", "the_chubby_girl__": "SeXoOo", "soma_bavaria": "True af", "_____roar_____": "@tinted_and_shaded", "uday5625": "Appreciate uhhhh mam", "bethatgirlygal": "😊😊", "advbharti.chawla": "And your powerful thoughts too 💖💖", "swayamprava__das": "I remember a short paragraph from my 6th class book.. It was about stone age. There it was mentioned human used hides to protect them from heat, rain, cold. I have never came across a book that says human used hides to cover up their bare body, to enclose their modesty. Even our holiest book bhagwad Gita doesn't have a single topic on how should we be dressed. Then I really wonder who the hell made dress codes, dress ethics, dressing etiquettes and constricted them for women only? And the most horrible thing our dress decodes our virginity status. Its true. A little ago I overheard a group of girl chatting about a girl who wore crops to our class. They were like \"oh my God! Is she trying to seduce the teachers, \" and guess what it was only a crop top with no waistline visible not a bikini. And that girl suddenly became a wise girl to a slut. Just one crop to class. I feel very happy when I see many strong women like you @redheadwayfarer taking so many strives for making us feel we are the universe , nothing can set our limits. But again my heart drowns on seeing some of our fellow sisters trying to limit us to enclosure that this society did set for us. How can we fight wen our own fellow soldiers are against us?", "sunte_ho_sharmaji": "Who are they @redheadwayfarer please elaborate because right now i am confused please elaborate so that everyone should know", "impana.s": "Well said👏👏", "ameek_mahal": "Youu goo Girl💯🙌🏻", "__qtita7700": "😂", "iritu_": "Best caption ever ❤", "pragun_": "🖕", "chitro196": "I just wonder why dnt u do some social activities for undeveloped people n for acid attack ppl , if u really care about social injustice ..this things will only give u fame it wouldn't help or erase evil activities ...", "sparshhsagar": "all lines are good but but depth of ur necline mke u cooler?", "negitamanna": "Ma'am you are incredible.💖 I love you.", "ashi28_vegabond": "@pragun_ savage", "milesandbeyond_": "👍👍👍👍👍👍", "naina_8888": "I hope ppl understand this Nd change cs even today girls r not allowed to choose Nd xpress what they feel like", "mansheen20": "You are amazing", "subbar_danish": "Love the caption 😍😍 SAVAGE", "mniloyh1996": "No..need beauty camera😂", "raedsalem_07": "My mom has the same ring!@redheadwayfarer", "funkyrao": "Yassss on point 💯💯💯", "to_mai_kya_naachu": "@pavinayan.deol kaafi sahi.", "being_pahadi22": "Thank you for inspiring me❤", "_miss.bose_1802": "🙏🙏👏👏👏👍👍😃", "jubilantshivangi07": "👌🏻👏🏻👍🏻beautiful!! Life really loves you!!😘you are great! Keep going!!👍🏻All the best", "iamvishakha_sharma": "Go bold n wild! Super awesum caption !", "romita_bhansali": "Thankyou for inspiring all of us😊👍🏻 keep doing.. keep shining✨", "_sanmathi_": "@harshini1197 the caption ✨", "boldxylem8844": "You been very authentic about your feelings", "_ag8st_": "Caption💯", "pras2011": "I have been following many actors but this girl is bold and aggressive.In love with her hard hitting words...", "vaishyadav2316": "Caption💘", "__mariajoseph": "Way to go girl ☺", "badalti_fizaa": "Seriously U r love didi 😍😍😍💋", "aditi_ayachi_5": "Salonaaaaa i love you", "anaghachandran": "Hello saloni 😊 you are truely inspirational for all the girls and women out there .your each and every articles motivates us . You just taught how to love ourselves love the way we are .. Thankyou so much and i am a great fan of you and you are so beautiful😄 keep inspiring us 😁", "shreyakataria15": "👍👍it's perfect mam😀", "srishika94": "I love the fact that there are sooo many girls to prove those fuckers wrong about wht they think girls should do. And for all the haters we girls are gonna do wht we want, we don't need ur advice soo as a sabhaychari girl of India just gonna say hope any girl u know (sister or mother or any frnd) prove u wrong by achieving wht they deserve ( that u haters just can't imagine coz that requires mind) 😊", "punter3276": "I have a dream......one day these hoes will come to their senses and stop bullshitting........and will use their peanut sized brain and will stand for a cause which is genuine......", "rishavismm": "🙏", "supriyapatil_": "Correctly put 👏😃", "israarkhan63": "@redheadwayfarer Dont show me finger well nice pic.", "pavinayan.deol": "@parulmehra08", "___virago_": "I am really so so much motivated by your words 😘😍@redheadwayfarer", "princea3992": "U r real nauty......", "fashionglimps": "Kusra", "minischievous": "Damn right.", "madhur_makhija": "U r an inspiration really", "rituajwani": "yuppp!! damn agreed.. every girl wants that everyone support her! but there is no one who can support us! we also want some freedom, respect, equality but NO! Every girl has right to Dream, to choose her destiny, to live the life she wants! but her parents or society doesn't give her the rights! But I feel the world will change because of you! keep doing this! More power to you! :)", "farzana_afia1": "R u mad", "ritu2564": "What a caption👍👍👍👍", "i_ifa_": "👌👍👍👌", "_ishiagrawal_": "💘💯", "anshul_chaudhary007": "#wow😍 😍 😍 😍", "sanjeevdsky85": "@redheadwayfarer bhai essay Ku likh dete ho..😂😂😂padne me pareshaani hoti hai", "vaiisshu9071": "❤❤❤❤❤", "butimtougher": "Nice.. ❤👏👏", "raina_akshay": "Is that blue torqoise or neelam", "inksypages": "@vidhichauhan4 can v just preach this together? 🙇🙇🙇🙇🙇🤐", "himani_r_k": "Very well said❤❤❤ Proud of u ❤❤❤", "rosh657": "I think respect is earned not given. Any ways great msg keep going girl", "pratiushmma": "I don't think she should ask for it. If it's hers then balls that anybody dares to take it👊☝", "prish_shah": "Can't wait for the movie lipstick under my burkha", "such_madz": "I rarely see ur posts but yes I do read all the captions. What we do is just keep scrolling the newsfeed and keep liking. But I love all ur captions coz they teach me how a women can also be that badass women with all the rights, with all her choices. You r such an inspiration @redheadwayfarer 😍😍😚", "__hemapuri__": "Awsm", "abhijeet_mahat0": "How dare you ... How could you even think of it ... Dude ! This is not funny ... Because of this sick mentality that you guys carry, rapes are increasing day by day ... You are clearly indicating what kind of person you are ... Why is a girl supposed to be raped just because she is wearing a dress she is comfortable in .... If you still don't get this then watch her video \"maya\" on youtube ... Do you even realize how much a girl breaks after a rape .... Just think before you speak and change this mentality of yours ... Shame on you @iamimpulsive", "princess.purva": "Actually that's the thing which whole world needs to understand..... @redheadwayfarer", "tejaswinisethi198": "Damn Right❤", "_.ridhiiiii": "Damn right girl!!! @redheadwayfarer ❤️", "the_chill_girl_": "u always shut the mouth of this fuck society ....love way u describe this thing which everyone should understand 😊 @redheadwayfarer", "devika.chopdar": "Respect❤ fuck what people say ...ur d best❤@redheadwayfarer", "_shahdarshana_": "True !", "__ragha__": "Caption😎😍", "apurvrajgupta": "No matter how hard u try.. we can never have that \"equality\" u desire.. its the ugly truth.", "khanna.ashish89": "we can't make everyone happy , we are humans not rajma chawal @redheadwayfarer - :)", "prefixanjali": "@shiivaniii_ lol", "_therecklesssoul_": "So well expressed , happy that there are many souls like me existing in this world.Love you😘@redheadwayfarer", "_that_bong_girl_": "👌", "phalguni_khandka": "U r great inspiration 😊", "i.daisy_": "Respect❤", "_shreesiddhi_": "Caption ❤", "sanchimehraa": "Beautiful❤️", "tdhaka94": "Love you woman 😘💗", "daffeyyyyy": "Preach👏👏👏", "nashida_arshi": "So Well said👏🏻", "__monalisamukherjee": "WAAAAAAOOOOOWWWWWWWWWW!", "garima_bartaula": "💎💖You are amazing and inspiring soul❤❤much love and respect to your every words😘go girl💫❤@redheadwayfarer", "highfaraway": "Yes I'm girl & I deserve more than you guys think !! I Have my right to do & freedom to fly. Thanks #saloni for being so supportive to each & every girl to make them stand & fight for right ...Love you 😘", "okritzie": "Truly appreciated🌸", "the.des_pon_dent.girl": "Thanx fr d awsm caption @redheadwayfarer ❤👌", "muzzu26": "But that doesn't goes with our \"sabhyta\"😂😂😂😂", "manib20": "Nice cleavege...", "vanxshika": "@_thakurayan_ she is beautiful in every way. You just need the right eyes to see that.", "vaibhavad": "That's not a middle finger", "anushagurav112": "U r so damn inspiring girl !!love u ❤❤more power to all of us 😊", "sakkumyself": "Amazing girl😍ur writings😍😍❤inspiring girl❤tysmmm for every tym doing this😍❤iluvvyouu soo muchh ur writings ur way of thinking 🤗always right😏society needs more SALONI lyk u . I adore you ✊", "moejoejoejoe_": "You nailed the caption so hard 😍", "naresh_garlapati": "@redheadwayfarer you don't know outside of world.always don't blame entire men.even there are many girls who always use men in the concept of love.", "darshankanada": "Its looks like Mid fing.", "janhvii_singh": "Ohhh boy!! I actually see kids here.. i refer them as kids coz u r factly discussingif she shuld show her assets or nt... hellooo do u knw wat is freedom of expression.,, i hope u r educated enough to knw tht having these thoughts or showing of our assests is smthing v decide nt u.. ! And if u r soo nt interested in the assests of the grls y r u even bothering yo cmnt ur shit over here?? Or just even look at others comments and say crap,,???... i too follow her i agree with her thoughts and to be true y cant u respect a woman who is frank about her body ?? Y do each grl needs to go thru tht bloody sati saviti type personality in public so tht v r nt fucking judged... wat if all grls wear burkha guys wont haress ?? Wont try to grop?? Wont rape?? Cm on open ur bloody eyes,, and let us live.. its my body its her body.. its v who decide hw v wanna flaunt it nt u pricky people... !! To give a damn with the society!! And to the person who was talking about history dude if u realise even seeta ji had to go thru the humilation !! Better learn ur history more than us ! And @redheadwayfarer v love u mam,, more power to u and to us :D u rock and each tym such kiddos cmnt shit means u gained more power.. all respects ♥ #lipstickundermyburkha #breakingstereotypes", "simonekher": "I love you mam 💓", "misbah29": "Wish i cld like this pic 50 times more.. ur captions giv life..", "lukansha": "Caption on point. 👍", "fitnessfreak_rahul": "Looking gorgeous dear and asome caption indeed", "isha_whaa": "Preachhhh", "kadwa_zeher": "👌👌👌👍👍", "kbsp__": "You were fab in girls on top also💘💘💋", "harshsingh1313": "👍👍👍👍", "priyansh__mishra._": "looks like u R the only victim...", "khananhar": "#gorge", "pde_eugeanica": "Your skin", "_amruuta": "My idol = best idol. ❤😘", "_taanishq__": "Beautifully written @redheadwayfarer ❤", "abhi_sambyal7": "😍😍😍😛😛😜😜😜😜😜😛😍😍😛😛😛😜😜😛😍😍😛😜😜😜😍😍😛😜😜😜😍😍😍😛😛😜😛😍😍😍😛😛😜Not explain now how I feeling thank 😍😍😍😍😍😍😍😍😍", "shanu22i": "Fuck all", "sakshi23sati": "@namitabhahat11 why are you following her if you don't like her? No need to see her posts no need to comment. Why you people can't live without criticizing someone?", "shaiforaneye": "You go girl! More power to you and all of us ⚡️🌟👊🏼💖", "hautechic.in": "Caption as always ❤️❤️❤️❤️", "she.a.happymess": "caption❤ as always👌", "bhawna_lunthii": "@namitabhahat11 If you are really not getting this post and feeling kinda yukkk....I doubt you are a girl ?? 🙇", "rajvi_desai": "You go girl! 👏❤", "yeahiamkhushboo": "@wonderlust_plum speechless! Beautiful words.", "rizvi_adiba.223": "I just love dis.... infact i love all ur stuff dat u write...❤😘m too a girl wid same thoughts 😎", "krutiiii_g": "@aakash_bute plz read n jara brbr artha kaadh", "devartme": "@mehimshah", "_aarti_patel_": "Yeah😘😘😎", "surfing_scooter786": "Khoob bhaalo", "euphoria_musings": ".everytime you are new. @redheadwayfarer ❤🌌", "plansyyy_": "// She's no more a princess BUT She is a KING 👑//", "notsosanskari": "@sakshi.sati coz some people need something to do! And ofcurz what better then freely criticizing someone?? It doesn't charge them anything, plus free publicity is readily available. Let such people be not given importance my dear. Let them carry on speaking jackshit. The lesser a sensible person reacts to such idiots, the better it is. Peace 👍", "rujup25": "This caption is lit!", "_.iiqqraa": "On point @redheadwayfarer what do you mean by she's overdoing it. She's a feminist that's what her post are for fun!!!!! @kajal.shivi", "urvashi.joshii": "YESSS!💯👏🏻 @redheadwayfarer", "frappeeii": "Women shld empower one another... appreciate ur work..ur words..u r life..a life every gal wants!!", "lisa.bardhan": "Amazing caption!", "crazzylegs0309": "Whatever u write is so meaning to me that even when I don't like ur picture I have to double tap on it.... Ma'am your mentality is so pretty...👌👌👌", "divyani_gangwal": "Caption!!!👌😍❤❤ @redheadwayfarer", "_yuvs96_": "#respect @redheadwayfarer", "kiin_iss": "😢😢😢", "mind_in_pandemonium": "And a guy like you deserve to be butchered. @iamimpulsive", "madskill_dhruv": "I always like ur posts n captions, but i feel u r overdoing it now.", "a21ams10": "You right but all man don't think like that but I respect what you write here?", "faheemba2648": "Killer look", "utkarsha.shirke.142": "@namitabhahat11 Don't follow her then n don't even look n read her post... Just ignore it.. So simple", "vasudhaahaha": "Aaahh! Yesssssss!!!!😭❤❤", "manyaraii": "@rhea.bhimta although I have varying opinions with certain issues on this page, you must follow it because she's enlightening 🙌", "rovinglioness": "@namitabhahat11 Don't like it? Don't follow her... Simple live and let live.", "meera_004": "Caption 👌❣", "sakshi_dhami": "Woah👌👌superb lines💙💙", "ayushiiichhabra": "❤", "tauseef.md": "Irony is you are looking that kind of girl...😁", "sparshgoel02": "I feel privileged that I am following you. I wish my sisters,girlfriend (if I make any) or any female around me learn from you. Not just the females but the males around me as well learn from you. I learned a lot from you and wish to keep learning. Thank you!! Thank you so much @redheadwayfarer", "somethingwickedthiswaycomes__": "I love you 😭", "mahimajain1703": "I mean I am short of words to say what I feel whenever I read your posts. This is so amazing to know that someone , somewhere is fighting! You killed me by your words. There is nothing more powerful than your words. You're an inspiration , inspiring everyone on every single day. You're the best. More power to you. Keep writing always 💕👍", "sudeshna.__": "Well the caption.❤", "prachiix": "💕I'm not going to write a long paragraph. Cuz that's neither enough nor fair to explain how beautiful you write. 💯🔥✔", "ttanmayeeshrivastav": "stop being so feminist!", "deeksha_middha13": "Yeah !!", "sharma_yolo": "Damnnn right gurrrllll @redheadwayfarer", "flawless_namii": "Y she is ...posting such irritating post ....wat the hell she wants she only knws jst hate her by seeing her post so ugly yakk😒😒", "simran_sharma13": "The caption❤❤❤👍👍", "_thakurayan_": "At least don't post ugly pictures 😒😏yak", "divya.dbs": "People in India can't see the women going forward. We can't even wear something that we want. It's so hot in Delhi still my mom and my aunties can't wear such clothes that are comfortable to them. They have to cover themselves from top to bottom just to keep up their husband's and their family's reputation. I hate this even if I say something even my own family thinks I'm a slut who likes to wear western outfits. Grow up people, these ladies are your mothers, sisters and girlfriends. If you can't give them respect, you don't deserve any too. @redheadwayfarer you are only person who I think knows each and every girl on this earth. The way you write, it tells about everything that happens in any girl's life.", "silversurii": "Attention seekers!", "saiba_agarwal": "And yet again, you never fail to inspire us. Leave inspiring you never fail to teach those morons that should have actually already been taught. Such a short yet beautiful writing , thoroughly expressing what each of us feel. Again, salute to you.❤", "moooode10098": "Wow wow wow peytfol nice fere nice", "sanyadrewdsouza": "Preach preach preach @redheadwayfarer", "_muskaanism_chapter_iii_": "Well said......impressed...😍😍😘😍😘😍😘😘😗😘😍😘😗😗😘😍😍😘😗😗😍", "cynthiacardozz": "Inspired❤💫", "girlwitguts": "u got lots of guts girl!!...hatsoff!!", "anish_kumar_h": "So true are those words. Even I have did many times, judging girls by their dresses. Yes, this social medias have improved my mind maturity from what it was. It's always the space for mutual respect.", "spswatipriya": "you are an amazing soul @redheadwayfarer ...and a role model for all women who are just living according others...many of them don't even realise what they are missing...cause this patriarchal society never gave them the taste of true living...or true freedom...keep inspiring us ma'm...a big fan of yours and your writing...we the new generation...are learning a lot from you...huge respect and love from all of us🙏🙌😘", "jeet_sarah": "@27akashpandey", "iamdruv": "They've already seen your videos and thoughts... and now they don't say anything like this ... thanks to you. ...😎🙏", "sandhyakarki126": "👏👏👏🙏🙏🙏well said hope all the people will have the same thinking as urs one day lots of love And will always Support u no matter what the situation will be😘😘😘❤❤💕💕💕💕", "rashi_maheshwari": "Your caption ❤❤ you are the girl with such great thoughts. I love you and respect you 🙏🙂", "dig_420_hiya": "The society never gonna change yet charity begins at home I believe. Will never gonna stop changing the mindset but yes the struggle is on for us girls.", "the._.sin._": "😍", "ratan_nayak": "Nice", "ritik.jolly": "#Awesome_😙😙😙", "rheaagrwal": "U write the truth which is going on society....Grt respect for u 🙇 and the caption is just....🙏🙇👌👌👌👏 @redheadwayfarer", "madelikeabullet": "#caption #respect 🙏💪🎀", "itsmbitxch": "The only thing neckline of my dress decides is how much ventilation my boobies are gonna get that day. Anyone who thinks otherwise can go choke", "richa_890": "Well said!!", "seems21_9": "Nd dats again a masterpiece 😍😍 u r a role model woman. The way u write Nd express ur ideas u inspire me every time ❤️ keep going❤️", "jenniiieeee_._": "Inspiration🙈❤", "priz_tripathi": "Word. ❤", "aaadddiii_18": "Hey uh😍😍", "_sukhmanimehta_": "You are the living example of how women should stand up for what they believe. My @redheadwayfarer 😘", "sakshhh__": "Damn!♥", "shrutishreshtha": "Great 💄", "pcpanchal828": "Inspiring....", "susmita_patra_sb": "Your comments so damn inspire me...not only me but the thousands of girls out there...i get motivated each and every time I see your post and the caption below it...the caption is not just a caption but it's a lesson...a life lesson and the important chapters of life that all girls should be aware of @redheadwayfarer #loveyousalonima\"am", "puneetdsoni": "Nice"}