{"debjm95": "If Nick Bateman can, so can you, yeah you're right: If he can get a physique like that, so can you, but no instead of appreciating his hard work, how about turn it into a feminism post; If he can post pics without degrading the other gender (by highlighting the competition he faced from the female models to get famous or how easy it is to gain followers if you're a female) so can you, but wait, we can't accept it as the our concept of messed up feminism is over if we acknowledge the privileges that women get as well. Sorry but if you want equal rights, please take equal responsibilities as well. Signing off.", "aristoadle": "*manliness/manhood. What's manly hood", "hugejokeman": "Can't believe the number of dumbass people commenting against what's written here. You guys make the world a stupider and more entertaining place to live in. Keep 'em coming 😂", "wasif8666": "You'ee truly an inspiration for all..❤️❤️❤️❤️😘😘😘😘", "darkpoetessisme": "Love this one", "kchetantyagi": "Taken too far", "ragecoffee_": "💜💜", "misra6556": "That top comment by 'karan' was actually on point....koi baat nahi hota hai jab koi mu pe sacchi baat bol jaate tab hai jalan toh hoti hi hai.....saali bazaru aurat apne aap ko Nick bateman se compare karti hai", "monkindark": "@redheadwayfarer people are jealous here coz they dnt have the power to take initiative and also if someone else is taking and doing it.. they hit them back with dirty senseless words...🤘", "dead.is.the.new.sexy": "💜", "akshayychoukikar": "Everyone who speaks english is not intellectual miss saloni g 🖕🖕🖕", "pihuacute9": "It's true , why society have different point of view for men n women?? When a man shows off his body women don't abuse him, instead appreciate ! Why can't men do the same?? At the same is it necessary to share everything on Instagram? Do whatever you want to after all it's your life, but I don't think there is necessity of sharing all prsnl stuff on social media!", "nikaylyn.grace": "bhenchod tu hai hi chudakkad raand..🍆🖕🏿... saare kapde khol ke pictures post kiya kar itni himmat hai to randi", "drishhtti": "Love you and don't stop what you're doing. You make other people realize that it's okay to be comfortable with the body they have and even better to flaunt it. Huge love and support 💖", "mayank.sinha": "Your spreading the hate among genders ... You are dumber than any dumbest person", "naam266": "To be honest that ass pose with sand was really hilarious 😂 😂", "wanderingfeets__": "On point!", "iamjayeshparekh": "ugh... you are so ignorant to see the difference between these two contrasting images, this dude has clearly put loads of efforts to built his physique thats why he's getting all that appreciation, on the other hand...look at you...what have you done to get the attention, NOTHING👏👏just lashing out at our society for glorifying the hardworking this man for attaining something that you can't achieve...unfair afterall...all you want to do is freeload..that's why you get so much hate on each post every time you spit out words...", "swalishshankar": "@rahulmaths haha yeh dekh", "sonu_mhrjn": "Equality or feminism doesn't mean showing nipples or being undressed is it? And if u don't give a fuck about what anyone the society,people think about ,why u always have a long captions explaining things like this and trying to be like I don't know what u wanna be ,wanna show ,what r u a nude Princess or what and comparing the man and yourself obviously oh !!! that's equality haaaa 😱 great. Keep it up girl get naked and show how much equality u have received and how fiminist u r coz all the girls out there are dieing to show their's right 👏👏👏 and u r the warrior for them. You r sick girl sick !", "__sakshi_pitale__": "💋", "____.julieee.___": "I am also a woman ....log kuch bhi kahe jitna bhi feminist ho jaye but what I think about feminist is “jo chij chhipane ke liye Bani h use chhipa ke hi rakhna chahiye. Boys toh kabhi nhi post dalte show your dick ..show your naked part is actually called the real meaning of manism 😂😂 then why womens doing the things just because of followers and faltu ka publicity ...or nagga body dikhake koi tumhe paise bhi dene Bala or naa hi izzajat Milne Bali h ...we are indian or koi bahar ki aurat jo Apne aap Ko indian bolti h but India ke bahar rakh k Indian girls Ko encourage kr rhi h wahh👏👏👏👏", "ahanadutta24": "It's just bcz uske chest pe boobs bol k koi cheez ni hai but apke hai...he is not showing his dick...ni toh usko b ese he comments ate...opening ur buttons, flaunting ur boobs n expecting u'l b receiving respectful comments then good bye girl...comparison 2 him, his photo is more decent coz he is not showing anything....he is okay on his place...", "si.darth.vader": "I'm tired of this bull shit, @redheadwayfarer you and all the strong women that are trying to make difference should go along doing what you've been doing", "oreo_snowball2": "you are you , different from everyone, u do what u like to do and i really love u for that.......ignore them as u already do.....and wish u all the happiness in ur lyf.....❤️❤️love love", "limese_connect": "This post is T👏R👏U👏T👏H👏", "katt2367": "Ye baate bina nange hue b kahi ja skti hai", "princekristan8": "Badi foreigner h na tu. Lodi saali", "persnsweeth.yum": "You comparison of comments is wrong! You can only compare if same person has different views ,here you showed view comparison of totally different people", "ishuhot": "Stop spreading hate among two genders 🙌👏👏", "anu_pande": "Pic says it all.. U dint even have to caption it.. Fucking hypocrites these are", "imlucifert": "If you have no fear of body shaming then why don't you wander naked.... Girls like you just bark on the name of feminism.... And don't hesitate to post my comment such fuckall things only you can do.", "mr.cherry.007": "The number of people still defending this kind of behaviour in the comments is concerning.", "unguidedmissile421": "Why didnt you show comments of INDIAN MEN asking to see your bob and vegene and calling you beautiful. Fucking hypocritical", "invinciblle0411": "Hey! Just proud of u girl! These shitty heads are not able to make sense and are not worth it! Just try to get attention! U go miles girl!😘😘😘", "million_dollar_sal": "Ome thing i dont know why captions and photos ka relation hona zaruri kyu hai bhai??", "beingmanasi": "Nature has crafted Men and Women, differently, simply because both of them serve different cause and purpose. You absolutely cannot make them equal or even similiar. Yes ! But we can work towards creating equal opportunities. I admire your guts and the way you write but that's a fact, even a scientific logical fact that Men's breast arouse different feelings than female breats do. Why do you want to kill that charm. Let that be! Even though that is biological part of a female body, it does induces hormones and arouses people. Because, human body is scientifically crafted that way. Going against nature isn't serving the purpose #Saloni. I am a hardcore feminists myself. Nobody's disrespecting your body, but you yourself are. And yes not just females, but everyone's body is as sacred as anybody else's. The scantity of it has to be maintained. That differentiates us from animals. We are bron with brains that have studied biology and human anatomy. These people know, what chemicals are released when a human being is exposed to secually arousing entities. And yes women's breast are one of them. I personally find them extremely sexy. Don't You @redheadwayfarer????? Still more power and love to you❤️", "__.janviii": "You have soo much of free time saloni!", "ssinchana11": "Remove your dress and stand like him", "raj_sharma80": "> Love Marriages Specialist, call US 09817629132..RAJASTHAN ESTD **** Get Your Girlfriend Back => Husband Wife Dispute, solution => Soutan dushman chhutkara => Vashikaran Mantra, Manchaha vashikarn karvana turvana => Get your love back with black magic => Vashikaran mantra for love, call US GHAR BETHE PHONE PAR SAMATHAN call me +919817629132 Gurudev tushar shastri ji > Love Marriages Specialist, call US 09817629132.RAJASTHAN ESTD **** Get Your Girlfriend Back => Husband Wife Dispute, solution => Soutan dushman chhutkara => Vashikaran Mantra, Manchaha vashikarn karvana turvana => Get your love back with black magic => Vashikaran mantra for love, call US 09817629132 => Business Problems, => Education Problems, => Jobs Problems, ALL PROBLEM SOLUTION GHAR BETHE PHONE PAR SAMATHAN call me☝!! \"चमत्कार चमत्कार चमत्कार\" !! (#ज्योतिष_विद्या_मेरा_कारोबार_नहीं_मेरी_साधना_है_!!((+919817629132))( Get Your LOve back With In 12 Hours guarented solution any proble) (( 1.marriage solution.2) lottery number in all world special for match.)).Just one call change your life Get your love back/Husband wife dispute/ Inter cast love marriage / business problems etc.+919817629132", "pooja_richhariya102": "You've literally compared yourself to nick Bateman here 🙄🙄🙄", "iammanojdua": "coffee name pls", "dr.pratimachaurasia": "@shashankshukla955", "luckybyg6": "@redheadwayfarer When god makes you a human why you behave like animal or alien.There is no difference in you and animal.So, you please use your brain like human.", "maan5113": "Abe kyu tuu girls ko nanga krne ke liye lgi hui hai 😏😏😏😏😏", "a._.kapoor": "@nick__bateman", "chudailchokhri": "NiceOne👍👏", "rohan_922": "Okay. Let me begin my letting u know that i follow female body influencers. Just take a look at the people im following. Let me also tell you, that i being a man, dont go around shirtless or post shirtless pictures all over social media. Because i dont have a body to flaunt. Neither do you. Its not about a man or a woman. Its about the body. If u have a body which can make people go awe about it then u certainly can take it to the social media. I feel saddened about ur idea of feminism. U literally generalise all the men to be same and talk shit about them, which is unjustified and is absolutely not what feminism is. Feminism is empowering women. Giving them equal rights. All you do is sit in an exotic place, take pictures and write shit about men- thats your idea of feminism. I believe that ur quite privileged, so why dont u put real feminism to use by coming to the country and using that money to educate girl child or help other women rather than using it to take pictures in exotic places and post them with shitty captions against men? Well as far as i am concerned, i would be more than happy to have a wife who would earn more than me and have daughters who would be more successful than both of us. Thats feminism. I pity you and your ideology.", "bloomingtimber": "Power to us❤️", "prernaakashyapkhatri": "More power to you 💞💞", "soniasharma1257": "Only if nick knew that his photo and comments on it would be a debate of feminism . I am gonna be neutral about this post because saloni did explain that feminism is not restricted to child marriage, education, pay, etc. But, using nick ( supermodel) vis a vis her pic does not quite make sense. Had she posted a pic of a guy equal in fame with saloni and he was posing semi- naked, it would have worked better.", "nids_way": "Haters gonna hate... but actually the truth is You are AMAZING ... they are just jealous ... @redheadwayfarer", "sharad__deshpande": "😍😍😍", "snehac24": "Oh man I feel so sorry for the mothers, sisters, girlfriends, wives and daughters of these men who are enraged by this post.", "anirudhs21": "@aryansharma_1_ bhai hoes mad xD", "dr.anil_kr": "Hey @redheadwayfarer...talk to women empowerment,not to feminism.. Ok", "shiv_vii": "Ok first of all wear whatever makes you comfortable. It's your choice what do you want to wear. But comparing yourself with a supermodel is just stupidity. What are you doing as a feminist? Should we gain alot of unhealthy pounds and post our pics on social media as an inspiration for others? You can never be an inspiration for women. You can never get apparitions for this unhealthy body. Caffeine is your morning routine!?! So you want to see other girls with a cup of coffee instead of milk or green tea. Okay. That guy gained his body and his posts inspires others to live a healthy life like him. What are you doing? At least don't call yourself a feminist if you can't help a woman to look healthy. Read the definition of feminism first.", "arpit_masih": "I'm here for the comments 🤘", "a.r0sh_": "Here you can post whatever you want it's your account. Then some people will pop up out of nowhere to criticize you, just by employing their life's some minute, some people come to encourage you because of their pity reasons. Many people have their own life sorted out but still here to disgrace others. And @gauravrchandel bro who gives a right to post shirtless pics on Instagram is there a officials behind the bar. If she post the same everyone will pop up to name her on their own perspective this is where women empowerment is needed cause that's what this post is about. The same thing is not asked by a man. And bro @totally_bhukkad it's the same for you who gave you right to comment against her who told you to comment on this post (same goes for me though😛) it's in her right or I should say it's her own initiative to do so cause that pic of that man is social. (Did I use too much words again😓)", "adamjonson70": "Hoes and Playboy thing", "that_bohemian_": "This is the actual dirt and congrats we live in it. This girl who is trying so freaking hard to mend people's thinking towards a rational way and then here these stupid and highly developed people object and doubt her intentions. It's not about roaming naked, it's about both the genders having the right to do the same not only women being censored for nipples, she's an INDIAN but stupid, there's smthng ka Travel which is her hobby unlike you who doesn't have the caliber and money to be in any other country. Please don't compare her with you. However her gallery is, she doesn't have problem with that, it's her account, it's her LIFE!!!! Who the fuck is anyone else to create a scene over that.. Unless she was supporting some sort of terrorism. Since she isn't, please keep your mouths shut and if your eyes burn on seeing her then block her! You see it and then you troll. Sooo ancient of you. May God give such ppl brains 😂! Keep doing the good work! I love you ❤️... @redheadwayfarer", "anushkkkaaa": "To all the people saying that he worked hard to get this body, hence he isnt being insulted, or that comparing a so called unfit woman (really? REALLY?) to a guy who professionaly trains is unfair, remember what Disha Patani went through anytime she posted a picture in her Calvin Klein merch? People in the comments went berserk and called her the most unimaginable things. Why did that happen then? She was definitely fit and had trained to be so, then why the vast difference? Why was he praised and she slut-shamed? It got to the point where she didnt allow comments on those posts. Havent got an answer now, have you'll, you narrow minded people?", "jyoni2705": "Nice pic", "irshadkhan8730": "Wow", "indrani._.chakraborty": "Once again, people completely missing the fucking point.", "such_a_potato": "Shouldn't it be respected as a human? Because that's what feminism is, right? Equality. Then why not get respected irrespective of your sex. Just a thought. I'm not spreading any kind of hatred towards you because I genuinely like you. It's a matter of opinion.", "heyishita": "Best part is I think all these trollers wake up every morning to gain their legitimacy through featuring in your comments section. Doston, aage badho. Not it's getting super lame, this isn't even a political handle. You're not getting paid. Don't waste your time here. Aur itna hi krantikari banna hai toh you go and change the world. Or write to the UN to change the definition of feminism. I'm sure aap logon ko pata bhi nahi hoga. 🤣🤣🤣", "mohitkundalia31": "Loose 💎 has a Cost & when its embraced in 💍 shows its Value also enhances its beauty. So a trader would love to own a loose Diamond & individual would enhance its beauty by wearing it in a Ring", "bhardwaj_rishu_rishi": "🔥💖", "thesarahdoughty": "It really is sad when people have different standards for women and men.", "iccha070491": "Lots & lots of power to you @redheadwayfarer ❤️ “Hathi chale apni chal kutte bhoke lakh hazar” just in reference for those who don’t understand the language of decency & manners! RIP THE SHIT OF SHITTY PEOPLE! 💐", "thesilverlininginyourcloud": "What matters is you @redheadwayfarer are reaaaallllly pretty❤️", "akanshagautam2017": "More power to all the girls out there💙", "pushkarajshrotriya": "Respect to you 😍😘🙌🙏", "abduljabbar7234._saude": "Nc", "meghanapalagiri": "@pearlsawhneyy", "mannat_sharma25": "The most beautiful thing about you is that you do not hide ur flaws u embrace them. N inspire to be comfortable with ur own self. Keep goin. Love. @redheadwayfarer", "roshniwhatisthisbehaviour": "Hypocrisy is on fleek. Few people can never treat everyBODY equally.", "jhanvis123": "Why to drag @nick__bateman into this for gaining followers let me guess. Fake version of @nargisfakhri u look😂", "oliviahussey.fan": "Whore at work", "zbusrademiryrk": "Raand saali haha", "klkl20042019": "U r shame for all girls", "sabriabi14": "Motherfucker whore", "cha.chart": "Teri maa ki chut bhonsdiwali", "charyadee": "If only our society stops looking at women - in terms of body parts.. the mindset is such that a girl/lady's respectability is measured based on one's assessment of bodyparts.. so much importance is given to what is covered and not that when a naked person is seen, it is perceived something unnatural. Something wh makes one uncomfortable. And instead of a normal moving glance it somehow ends up being a lustful glance or thought and then shame kicks in. This is either", "tri.india": "You don't even want to care about these dub ass useless meaningless people.. They found it annoying really, They why they following you.. 😂 We found you and your hubby cute and you live in your own world.. They should mind there own business, That the reason Instagram has only given like button the people who like hit LIKE and they people who doesn't just FUCK OFF 😀🖕 @redheadwayfarer Now handed over to you..", "aurora.whorealis": "The double standards are disgusting. You’re fighting the good fight and I am always eternally proud of you.", "_miss_saxena__": "Just ignore them beautiful..... They are always ready to judge anyway... So live your life the way you want... They are mindless people... Love u ❤❤❤", "pragya_sc31": "hey u r amazing.. just starting following you few weeks ago and at start I followed u because i liked ur work on screen...but after following you, i have started loving you..u r such a queen.. ur thoughts and how choose to use ur platform to bring chng ... i adore u girl.. never chng ..stay blessed ..", "ayu_so_random": "You go gurl 🔥 !! 🖤🖤 More power to you ❤️ so much love and hugs 💖 @redheadwayfarer", "yourdaaku": "But there's some truth to the captions. Every thing relates to a bit of Gyan. Don't get me wrong look at Mia Khalifa's Instagram, her posts are similar but fun to read as in kinda sarcasm. I am impressed by what you do. But I mean if you can take as a positive feedback, you might wanna add some fun to the captions. ;) :P", "rishabhkashyap167": "Show them this 🖕", "rahulkbharti": "This will continue to happen until females demand their representation in every sphere of life and skewed sex ratio is one of the reasons that we see patriarch mentality dominates everywhere", "nis_pai": "Whilst most people argue over feminism and what she should or shouldn't wear... its simple.. her account her choice.. what I would like to know is.. is that hazelnut coffee worth a buy??", "_kaustubh_": "If you really want to spread your message then work on it. Try to spread it to grassroot level where there’s actually a problem not to your Instagram fans. Roaming around the world and staying in luxurious hotel won’t help. Gaining sympathy and followers is what you are doing nothing else. I hope you spread your new message of feminism well.", "pathak_purva": "More power to you!💥", "steps_towards_positivity": "I just love you @redheadwayfarer", "pratyush.___": "Show your pics to your family members and if they didn't argue with you over this i am ok with it i will appreciate the post and will ask others to like it but if they did then i will share my thoughts which you can not ask to stop .....you guys are making this nudity shit spreading in our country by covering it with only one word and that is FEMINISM.....you the so called feminist not ask for girls education, safety and all but for freedom of being nude publicly and no one can even put their thought against it....now shut the fk up and have some shame", "jf543634": "More power to you. Don't be bogged down by the idiots of these world.", "zeiyashay": "P = Penis = Privilege", "mehakz": "I totally agree with what you wrote. But you know what's the funniest part, while going through the comments on this post, I realized that not a single man who has commented here got the point of this post. Like not one of them!!! I mean... 😑 😑 😑", "thesahani23_": "Respect @redheadwayfarer ❤️", "cerraroopali": "Not everyone has the capacity to understand and empathise. I pity them instead of getting angry but however, there are some days when I get really extremely upset with all the hypocrisy around!! Just like today, when I was sitting with my friend right opposite to Vishal Mega Mart and in her car. Believe me, there is heavy traffic at 8:25p.m. on this road. Two men spotted us and came back to stare more and then stood right next to her window. We were cautious and hence, had rolled up the windows. They kept standing there and started staring us more which obviously made my friend feel unsafe. We could see them signal at each other and speak in a derogatory manner !! We asked them go away and then that they will get a slap but did not back down! I don’t know if Jaipur even feels safe anymore!", "qalanduru": "She is the epitome of courage and freedon of choice. Period.", "thesmalltownblogger": "True example of the society we are living in.", "mandeep_tripathy": "A man has muscles and showing his body has got some meaning like it looks nice.again it's a characteristic of androgen hormone WHICH IS NOT EQUAL in male n female. We should accept it and accept the difference god created the gender... Every gender is unique in its own way. What we have to stop is dominance of one gender over other. Showing your nude body is not gonna help you for this. It is useless. Still if you don't understand then either you have no IQ or you are Mad. 😊", "pramdaarora": "Hey girl! You really spoke beautifully everytime many of us want to say. I don't know if you live in India much because if you do you get used to senseless, irritating, stupid literate and so many people out there. What you are doing, wearing, posting is none of our business it's definitely your fucking life. But I do get a good and righteous vibe from your posts. Just let those fucking frustrated people don't affect you. You are living your life beautifully. They are just jealous and sad. I pity on them.", "_itsybetsy_": "All this effort and people still don't get it. Is it that difficult to understand? Or is it just because y'all a bunch of bird brains......", "isheetazzzzz": "Let's stay strong together ❤", "hillolchak": "Why do you rant if you don't care about society. I think more than your self acceptance you want the society to accept you. If you have the right to live a life of your choice, they have the right to make a choice-to accept you or not-off course as long as nobody is harming you", "janvi_duggal": "Dont bother about those fuckin asshole .. live ur life in the way u r", "rouxandchoux": "@vinayakhpandey @kartikey.h.pandey", "jiteshravariya": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "zehra_noori": "I do remember wearing a dress to my family function which was captured into a video where only a lil bit of my cleavage was seen and how it was embarrassing me when my sisters where commenting on it being unappropriate now I say its a part of my body and how does it even matter its just like any other part ...and the common problem is when in pools men can go with no tops at all and women going even after going with a top and if the bra is seen after you drop into the pool bcz you are wet then you are going to be seen as if thats a crime...I really do not understand the mentality of us Indians we as women make other women feel ashamed as well", "dangozid": "#stopgeneralizing", "thebitchkitten": "You blow my mind, love love love your posts ❤️❤️", "jyotisinghr845": "Luv U Mam..@redheadwayfarer", "cgfeminist": "LOVE YOU ❤️❤️", "chanakya_chatterjee": "Chauvinism of any kind is just insecurity of not being able to match up and jealousy of people who make their own path ...", "__g.a.y.a__": "the caption and the hashtags killed me. An actual queen", "aishaayesha161119": "Proud on u Saloni always", "be_fablicious": "You are amazing and your posts are brilliant these illiterates are cursed with no brains.", "i_am_jatind": "To be a real feminist you have to support women across all sizes - thin or plus sized, dark or fair. Feminism doesn't begin with skimpy outfits, in fact it begins when you think of women other than you.", "om_ishaaa": "👏", "gogo_skae": "Yaha kitni bhi gyaan vaali baate kar lo gadhe sirf kaan hilaynge samjhenge nahi jisko jo karna hai karo apna kaam banta bhaad me jaay janta", "dixitajayy": "Pagal ldki", "_nainaa_": "You made it clear❤️✌️", "_divya_jami_": "You go girl 🙌🙌🙌", "bhumikapandey": "I am with you! You are a gorgeous woman! Always keep that spirit going", "amaldude93": "Rather than defending ur point of view u need to understand that out of 100% audience u have got 20% are following u blindly and supporting ur point of view as well. This is not about showing skin or ur fashion choices but it is about always sticking on one point that u choose to post everytime and I totally respect that Saloni...but u need to understand that there are more aspects of women empowerment which lots of women love to hear it from uh including ur topic as well...", "miley12317": "Its true our society has double standards. The same thing which a man does is encouraged and when it is done by a woman she is degraded. Why?! @redheadwayfarer I am a 15 year old and in the past few years you have taught me more about empowerment than my school has. You are my true role model. Please try not to let such comments affect. You are a really good person.", "__unna_": "YESS. QUEEN. DECOLONISE THE BODY ❤️❤️", "realpratibhag": "Love u 💋💋❤️ Don't car", "koualwaysflying_": "@mr.bandyopadhyay check this post♥️", "a_ra_bella": "You are a lit ass person.🔥 I feel proud as a woman when i see how you tackle such bullshit. Ye log to insaniyat ke nam pe dhabba hain. You my lady (bows) are an inspiration in the truest sense.", "sharvels": "Haters will hate, lovers will love. If keeping our thoughts and sentiments and fighting for equality and body shaming is feminism...well yea we are feminists. The topic is not about men and women here. If posing for guys in boxers is ok why gals cant pose in their panties...if going shirtless is what boys do all the time, why do you have problem facing our leave apart boobs but bras too. Oh and a girl with abs can post her pictures in bikinis but a gal with no abs but a healthy body should not...why...coz it doesnt please you !!! Sorry dudes...grow up...its 21st century. And yeah bdw if you have so much of trouble first try speaking your mind on those numerous accounts you follow where you will see gals in bikinis or may be not even that and you love it love it love it!!!!", "_blue_sky2020": "👏👏👏", "thevishnukaushal": "YOU'RE THE QUEEN. NO ONE CAN FUCK W YOUR VIBEEE 💛", "thebeastivan": "I think you look amazing shit all these ugly ass Indian haters can fuck themselves!! Do you boo🤓😎", "sarkerpayel": "While we fight over men and women having a certain body type, Being Healthy escapes the spotlight. Fuck. Priorities are messed up 😂", "amanmishra321": "Ye sab wahi log hain jinki social life zero hai jinhe attention chahiye bas taaki unhe feel hota rhe ki wo bhi kahi exist kr rhe warna to unhe koi notice tk nhi krta !! They are just mentally sick people !! Keep going stay strong !!", "snazzyawi": "This is an true example of hypocrisy in our country and around the world.Glad you shared this here.", "artstabbed": "You know what's the best part about you and your profile.... Not giving a single fuck to assholes... sticking to your goal no matter what. #motivation", "kamal_punetha_kp": "Mthr fucknn respect", "ankursri7": "T only dikkat is u hv started giving a fuck n thus your time n thoughts to what different mouths say about u...I mean y to care.. there will always ppl good in such things bcoz its easy to sit in dark n comment shit abt ppl n milieu ...this is not how wars r won...a true fighter either ignores or kills his opponents...u r free...u r u...Do wtever u want n let others cry in hypocrisy of shame n societal norms...N yes i m a man saying this n supporting u!", "dhruvsharma14": "Don't understand why the feminists sometimes forget that there are men who were brought up by their parents and society to respect women for who they are.. And that when these feminists say that men are horrible, it includes all men, and that is a painful thing to read because we are merged in the same group as the cretins, and it turns out to be a disrespect, not for us men who do realize that there should be no gender or fat or any other kind of shaming, but to our parents and society who worked hard and spent useful time to make sure that we don't become them..", "abhilashaa_s": "Now this is actually disgusting.!! And then these shitty people call themselves open minded.. bloody judgemental assholes", "shris_tea_": "Why do these losers even follow you if they have issues smh", "bag065": "You know what you are a dumb girl...hay listen men's Don't have boobs that is why Salman Khan can open his shirt in a TV show ...but a girl can not ....did you see any boy posting dick pics....Jo chis chupane k Lia hay wo chupake rakna chahiye......you can post bikini pics but don't write that kind of shit post ......", "notshelbyspecter": "U will be successful one day....in bringing the change u wish to see in the world......also pls be a lil polite and humble in your approach.....take off your cruela attitude and be kind....hope ur get my point.....all the best", "aalasskapedh": "Mam with due respect I just wanted you to know that keep doing what you do. Don't give a fuck to those who are not fuckworthy. Save your fucks. They are damn precious.", "pocketful.of.yoga": "THAT👏👏👏 LAST 👏👏👏LINE👏👏👏", "b_maithili": "'If a man walks in his undies, it's fashion, if a woman does it, it's shame.' This needs to change. Your posts will help bring the change of perception. Thank you🙏", "the_envious_buddha": "Lol, you still TRASH😂", "alavyaa_tiwarii_": "I am sorry i was also influenced by the video you recently talked, you're such a great soul yet people doubt Your intentions without even considering the real messages behind your long captions and posts keep up with the great work @redheadwayfarer ❤❤", "aryaman_raj_garg": "No offence but this asshole is right when he says that your captions and pictures are not related😂🤣....", "das_saheli": "@mouliguha22 read this 🔥", "shanks_98": "Scrolled through comments ND found out no one knows what they want and are here, like they wanna pick a fight or brawl. ND isn't she kinda creating a negative picture of Nick Bateman. I hope no one kills me after reading this LOL.👍", "rhewining": "@em0tionally_c0mpromised dude respect What an amazing post", "bafna.k": "Fucking people with creepy mentality. Her body her choice those people have no right to judge a girl on the bases of her body parts", "zo_kap_002": "these is so fucking true i mean if he can posts in underwear why cant we ????? i here beg every girl who is Inspired by saloni to posts topless pictures of themse in just panty and tag saloni... lets make these society change, rebel guys we need uh comons.", "rishuwashere": "Tune bhi to ek bhi larki ka comment nai liya... Sirf ladko ka lia hai..... Non sense.... 10000 rupye wali @redheadwayfarer", "amna_parvin": "You are fire 🔥 go girl!!", "deshwalhitesh": "Dear Mam, I m one of guy in a post. You have huge followers so Plz don't mislead the generation in a name of feminism n woman empowerment. Bcoz acc to you feminism is only restricted to nudity, body exposure, virginity n sex choice, But acc to me its way broader than your understanding on this. Plz keep your mediocrity (on feminism) with you bcoz u r misleading the youth", "sohail._.writes": "Tu bhi utar dena saloni kapde", "jaspritkang": "👏👏👏 Bang on!! All these male chauvinist and dharam sanskar ke thekedaar creepy men crawl out and give their pathetic comments on what Saloni or any women “should do or wear or say”", "shoboii.pvt": "slaying*😂😂", "whats_up_biatch__": "Let them say what they want ma'am😉 You r amazing and doing a great job 🤩", "suneelayub": "Hi all please like and subscribe my channel on YouTube by write Facebook song by Suneel Ayub🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏", "paliahluwalia": "Keep slaying!", "suvida.rajput": "🙌 always right", "deirdresingh": "Pls always speak your mind !😊💕👏👏👏", "snehaqu12": "haha 2 sec ni lgate demean krne me but saalo lga dete h humko smjhne me.......shi ar glat ke toh kya he kehne....inke shab se female body isnt a piece of art .....in there point of view it just a materialistic thing jisko ye mard kanyadan ke tym paiso se aai ek chiz smjh k leke aate h ar unki body pe apna pura pura haq smjh beth te h joki unke liye srf ek tharak pura krne ka zariya hota h.......i mean kisne haq diya h apko ......ap khud toh itte khokle hote ja rhe ho ye toh sb apki tatti soch se pta chl rha h......agr koi bnda ek revolutionary message pass krta h y cant u digest it ...y cant u accept the real fact .......THE UNIQUE SALONI CHOPRA mam ....u r n inspiration ek alg nazaraiye se sochna ar in bilions k smne represnt krne takes a lot of gut ......u only raise thise issues which.....ppl refuse 2 say dats is sumthing commndable plzz nevr stop keep writing lyk dis", "m.i.i.m.a": "Girl, you're gold 💜", "kuhuguptaa": "You are doing really well in life and sometimes that is a good enough reason for people to talk shit about someone! Keep doing what you do and keep shining ✨", "aanchalmehta16": "You are one of the most authentic and beautiful woman I have come across!! @redheadwayfarer please know that you are loved :) people who don’t have a life are the ones who talk ill about others in General.. much more love to you going forward and onwards", "surajbhagwat": "Respect 🙏🏼", "tankandthetwins": "For a moment I thot u did a photo shoot with him! I was like wow she’s killin it!", "fashio_nistha": "You do what you gotta do...haters will hate...ignorance is bliss cuz some can’t be taught❤️", "sylvia_wright_": "👍👍👍", "commentatorbaba": "Jaane do madm HYPOCRITES HAI ye sb..", "_yeshaaaa_": "Minding own business is so fucking hard for people.like it’s your account post whatever u want . Y are these people so bothered.", "2mohitthakur": "Kabhi kabhi tooh lagta he tuhich Bhagwan he😊....keep going lady👍👍👍👍👍", "ssaurabh566": "No matter who you are, if you are on the internet, you gonna get trolled bruh with some nonsense. So relax", "kudratkahlon_": "@caro2point0", "antara_nandi": "@saketh_ayyagari15 read this.", "the_real_raaj": "Share something new..", "theartisticvoid": "Hum aapke saath hai na. Tension leneka nahi, deneka. ❤️❤️🔥🔥", "anshi_selhi": "I support you", "jayasharma1404": "No matter what people say .. you are awsmmmmmmm.. they say it because of their insecurities.. you rock 🥰🥰🥰", "hernangonz93": "@redheadwayfarer no ma'am please ignore all those comments. I respect you, we respect you...sane people respect you 🙏", "a_sauteed_story": "You do you♥️♥️", "_sassy_shweta_": "@ka.ran4226 he's comment is spot on... That's exactly what you do😂😂😂", "krishnamohitt": "IGNORE", "poonam.ish": "@ka.ran4226 Pehle roam ki spelling seekho...😂. These are the ppl who skipped the percentage chap in school 😂", "taraphine": "Haters gonna hate. You're a storm, can't be stopped, so just breeze on by", "isha59011": "You just want to gain followers by exposing . Thats it , and you cover it by saying you are a feminist", "_nikhitha.26_": "🔥🙏", "__________silapti____________": "It's your body and it's your wish... why are these people so judgmental. Like you've got a body to flaunt and you're flaunting. Some of them should really think twice before passing any judgment.", "saymdude": "Just daym", "miss_7seas": "Gonna repost this a million times......", "alqma_suhail": "@redheadwayfarer gurl do you. Honestly they're nothing but grumpy hypocrites. #SoCanYou", "tina_here26": "@lakshaychaudharyofficial ..... I think you genuinely need to read this.... I don't think you would be able to understand it though..., Don't have any hopes.... But still do give it a read if possible....please...!😇", "anamika.61294": "@nick__bateman", "heyitsme5179": "The college is on point. And don't let some idiots explain \"feminist of the year\" the meaning of feminism. You are doing the right thing and you know that. 😊", "anuvaaaakakkar": "You're brave! 🌻", "bansal.2.5": "I lv u no matter wat", "_.onset._": "'He's worked hard for his body'. WOW! And she's worked hard for all her luxury and she can post whatever the fuck she wants. Who the fuck are you misogynist or well 'the well educated but narrow minded and still living with the stereotypes' to tell her what she posts'. Let her live her life the way she wants. Don't like her posts? Just unfollow her. I guess that'll do you great help. Happy another useless day for you 'male whores'", "drohee": "haters will bark, their still some people who respects people not the gender", "__miss.fabulous__": "I don’t see any men or women slut shaming so called male models of Instagram for posing half naked. But when a girl shows half of her thighs and her cleavage for even a lil bit suddenly that’s the talk of the town. Grow up people. 😒ugh!", "_mr.suspicious": "@godboleyrajratna", "lookgoodflgood": "One simple message. Her body. Her ownership. This is the bestest way to highlight these people's hypocrisy and low mentality of shaming women.", "demi______goddess": "We loves you saloni.😍", "mit_ilicious": "👏🏻👏🏻 true and fair image of dualism wch prevails in the thinking of ppl of this Gen ... Very nicely portrayed 👍🏻", "voguishtraveller": "Girl, you do you. We love you ❤️", "thisisdharana": "T H I S 👏🏼", "semantimanna": "Yayyyyy!🔥🔥", "bulletbaba_1988": "This is called \" karara jawab\" keep posting and keep inspiring 🙏🙏😍😍", "utharanjali": "🙌🔥", "_irasinghal": "That's what it's about. To ignore the bullshit and keeping up the good work! We're really proud of ya, and those who aren't are just small minded people. I pity them", "rowza25": "Those who are against your post why do they need to spend their time in your feeds and then comment about it that you shouldn’t be posting this and that. They should get a life, if they don’t like something then just fuck off no need to west your time n tell me what I need to do. Like bro if I don’t like something then I don’t even bother to look at it. 😂😂", "messyara29": "You Go girl. 💕💕💯💯 you are doing nothing wrong , plus it takes guts to speak for the whole community . Lots of love. 💕", "reality_bite": "just be what you are keep it up🙌", "shephali_dhasmana": "You look fucking amazing", "filmi_billi": "I am a saloni fan . Even when i saw this post of hers i didnt like the dress . But that wasnt bcz of how the dress sat on her chest it was just coz I didnt like the flare . N in no way did my mind cross with such thoughts that people can even think like that . Shame on people who judge dresses n girls on the amount of skin they show . Hoping for a sensible and sensitive generation of intsagram using adults . ...", "yasnasehgal": "Bloody hypocrites.", "gauravrchandel": "So you are putting yourself as a female counterpart of a male supermodel? He had worked on his body to earned right (unofficial) to show it off and encourage others to live a healthy life. There are several female fitness Instagram influencers showing off and they are praised (also in comment section) for hardwork they did to build a body like that. Man or no man.. I don't think anyone would be appretiated showing off their beer bellies. Its completly ok in a relevant context but can you point me to any instagram account of even a male who does not have an \"ideal\" body and still he is roaming around half naked in more than half pictures on his instagram account? There is a reason why Salman Khan had started the trend of getting shirtless for a male lead in films and not Rishi Kapoor or Govinda... and that is also after he had worked on his body. It can be taken as body shaming but I think this is how our eyes are trained to perceive human anatomy and heads get turned when there is someting which is not adding (or subtracting) upto proportions.", "pikachu._.106": "you don't need to get influenced by these shitty people mam.... you're doing great job... and #we respect you for your courage #weloveyou @redheadwayfarer", "sucheta_shukla": "You slay 🔥❤️", "aayushiiiuu": "This women is love 💕💕", "krishnaasreekumar": "shut up man person, we're in 2019. eat slugs", "vandana2707": "Saloni, you don't owe anybody on this earth an explanation for the posts you share let aside why you are a feminist. We love you. And feel stronger by the day with every post of yours. Some guys just find reasons to shame women, because their peanut sized brains don't have the capacity to comprehend. Don't waste your breath! Keep slaying🔥🔥", "healing_nerve": "Yas qween!!!! 🙌🏻 more power to you♥️", "ajaysingh876": "Hahahaha well-done what a compare , shut all the mouth 😂😂 , appricate your point of view ,", "adiisters": "@nick__bateman you should support this!", "theperkyplum": "Omg this is ridiculous 😒 But I love the way you carry yourself and this post proves how strong you are and we women are. All the love to you lady 😘❤️", "manjulabharti_": "Lol killed it", "i.m_lala": "👏👏👏👏👏👏👏🙌🙌🙌🙌🙌", "looking_through_key_hole": "You know what they say, when in Rome, Rome naked. 🤣. Seriously I wonder what the hell are they tryna prove that they are more dumbass then they seem.", "gunner_nik": "The last time men felt threatened by women, they termed them as witches for having extraordinary intelligence and IQ. It was so simple back then, you just went from worshipping one sex to completely tagging them as witches and burning them alive on stakes. Come 21st century; men who are feeling really threatened are trying to burn intelligent and highly independent women from behind their mobile screens!! The reason: well bachpan mein dekha tha ki ladkiya bass Ghar k andhar ghunghat mein Rehti hai, aur Jo nahi Rehti woh ladki nahi hai aur usse jalana inn chutiyo ne apna farz Bana Liya hai.", "gods_galll": "ooooooo........ tat means she posted after seeing this post ,,,,,,, this means whom are followinng for inspiration at the end of the day they are following other inspiration caught redhanded 🙌 no women no men its about yourself 😁😁", "waiada_garod": "When a man/woman got injured of any body parts Eg like breast engorment in women which can lead to a serious complications turn into a big hole wound.. And for a man like epididymo-orchitis both need to exposed for a dressing well there at that time no problems for exposing even to a strangers can me doctors nurses others as well your relatives friends etc etc etc. Now hear both are with healthy body but the girl is being shame and the boy being praise...... Well done...!! Maybe all the haters should study anatomy.. Exhausted!!! #love @redheadwayfarer", "owoorja": "This is outrageous ffs. 🤦🏻‍♀️", "mixedbagniche": "Today's menu: Double Standards. Served. 👏", "chrisciff": "The fuck is wrong with you Saloni. Initially you talked sense. Now you fuck around a lot. Don't think everyone should accept your opinion. Don't post such shit comments to prove that you are right all the time and other people don't deserve to have their opinions. You have turned into a hypocrite ass muncher !!!", "rajanna.bn": "Talking philosophy and isms are bullshit live with hope", "priya_mukherjee21": "So fucking obvious dat their so called \"manlyhood\" is being threatened..!!", "dandandub": "There is no wrong with the comments sister , seriously believe u r post seems like u do intentionally", "iprachiupadhyay": "Love💕", "food_destination_": "We support you because you are doing right things. We support your every word. That shitty mindset mandomination can't do anything about it ......we ll support you forever . You are doing a great job, for all those who say you are jobless , Don't they see you are already an influencer and more over that you are doing something for changing the world , helping females [ Actually jo log ulte sidhe comment krte hna unki okaat itni ni h ki wo world ke liye kuch acha kr sake + jo acha kr rha h unki bardassht se wo bhr hota h , Actually itni goodness unse jheli ni jati h] 💞 Your Supporters are more powerful than your haters 😍 #SaloniDi @redheadwayfarer Love you a lot.", "shruti.92": "@ankitmalhotra7290", "bhoomika_netam": "I was waiting for this. This was much needed. 🔥🔥🔥", "sakshipatankar143": "People think what you post is Wrong and then they still check your feed and read each and every caption and then comment shitt over it... Such Hipocrates 🤐 These people dont have a Life I suppose... Go get a Life Assholes... Meanwhile... U Slay Girl ❤️❤️🔥🔥😘😘😘 @redheadwayfarer", "harish_rathore_95": "Fuck,fucking,fucker her fav words.", "bam_bam_baochod_meme": "I think Jin logoko @redheadwayfarer ke pic se problem horahahai ya horahihai wo log unfollow krdo ,agar itni problem horahihai it's her life her Instagram account her pics her body usko jab koi problem nhi horahihai to baki logoko kyu", "_notmara_": "You are more beautiful in every post and you give us more inspiration every morning, keep going because I look up to you and so do hundreds of girls my age. We need women like you setting examples and telling us that we aren’t the only ones who have this ideology and a lust for freedom. Thank you for not backing down ♥️", "queen._.asha": "You GO GIRL!!", "screwtrashandbepositive": "You just killed it!🔥 Anything else left to say, you slut-shamers!", "4.9.998": "@redheadwayfarer I really don't know what's the problem with homo sapiens this days u live your life as u like and let others live there life as they like if I u want to post naked than just post it .if one is getting disturbed by seeing pics of how actual homo sapiens looks like than don't follow and I need to tell u this that their is no need of meetoo act faminism woman equality I believe in the concept of homo sapiens more of nature's law.all are same they do breath they do sleep they do eat they do fuck.. than who we are to create another species of living creatures including random shit like slut bitch gay .just why u live and let live others", "queen_of_monsters_nidhi": "You do you dii♥️ you’re gorgeous always 🌸", "diff_den_u": "yeah there are many, so many shitty ass people in this world who love spilling hate while justifying their so called sense of equality but I LOVE YOU and I absolutely love what you post because that helps ME to exist with the thoughts that i have about myself and a self confidence that I'm on the right to be who i exactly want to be .SO THANK YOU FOR EXISTING SISTER!! More power to you !!♥️", "celina_parikh": "🔥🔥🔥", "gpratheeksha_singh": "U nailed it grl", "amlankamal": "You've got a buland awaaaz bro. Keep slashing the patriarchy like you do and keep using the platform you have to educate people. We need it. I appreciate it :)", "neha__6379": "fuck these people they always have some shit to say", "aswalrashmi": "More power to you Girl ❣️", "soyebm": "You guys are so entertaining!🤣🤣🤣", "mumbaiactor": "@redheadwayfarer These leeches cornered in deep dark world of their sadness & no intention to work on improving themselves drag down the whole community of men who are trying their best to represent men. Sending you & all the women around the world cheers, best wishes & support. ✨✨✨", "___hypermarshmallow": "Why the fuck can't people just mind their own business? It's like they wanna spread more negativity in this world. Kudos for shutting them up @redheadwayfarer you're a literal queen.", "balveer.parmar.142": "Ap ye es liye kr rhe take boys or girl mai equality aaye toh dekhye jo smjhdar hain bo smjh jayenge or jo ni hai bo ni samjhenge ese liye ap clothes aache se wear kijiye mai against ni bol rha but aacha ni lgta 😑😑 aise picture km ho toh chalta hai", "sunnygupta5909": "Kuch toh log khahege logo ka kaam h khaina 🙏", "rahul62__": "You are doing an amazing job. Feminism is everything you want it to be. Don't go by the definition of male chuvanists. You go girl💕💕💕💕 keep inspiring ❤❤ haters will always be there always try to feel positive by all the people whose heart you have touched and motivated them.🌼🔥🔥🔥", "draculahahaha": "these mouths which are blabbering today,are nothing in front of ur personality @redheadwayfarer ...they will come and go...but u are creating smthing immortal which, alot of us love ...and ur talent can really HEAL THE DEPRESSED ONE...!!❤☺...keep doing wat u r doing !!!!🔥", "divyabhatt81": "More power to you!", "charulakshmi": "We love you Saloni! I understand it's difficult to deal with trolls but,more strength and love to you. Sending your way much much love❤️❤️", "iharshit5": "You stole the game from Nick this time @redheadwayfarer 😂 So naiceee🔥🔥", "pulkitarora8": "But your captions and photos are really not related ...🤣🤣🤣", "iam_abhinav.p": "Well I am not against you or feminism but who gave you right to post that guy picture just to show feminism or face of society or to prove your point ? Who gave you that right ? I mean just for your sake you creating negative vibe for that guy ...You don't have right to post someone another picture to just prove your point ...👎", "sukhsamruddhi": "Dont fuck w Saloni. Like, never.", "tripathi.priyanka": "I completely agree to ur point but here is a slight diffrnce here..a girl with standard beauty types will also be shamed same way like u but u and other curvy girls still get appreciated by the most..(number of likes explains it) but a guy with not so standard physique will Barely get likes and trolled and shamed too 😀..just saying sometimes guys also get burns! Which ppl find it funny..I find it funny too but its the truth", "shreyasvvaidya": "Kudos to u girl! @redheadwayfarer let's hope atleast when we raise the next generation we try n make sure to practice and preach equality right from all our homes, coz it's the parents that have the biggest influence in this issue. The upbringing. Nip discrimination in the bad as it were.", "mannjogan": "Lady you are amazing and truly an inspiration and you amazingly handle the tag *empowering women*. We all love you! May these garbage people get a life and a job!", "utkarsha_88": "More power to you...❤️ Its easy to start a battle.. it's tough keep fighting ❤️❤️❤️❤️ just win it..", "postgraduateblah": "❤️", "i.am.arushi": "These dumbasses are just afraid of women. They can't handle strong women. Period.", "tabanhasan": "You are awesome. Don't forget that! Love what you share. Puts sense in us all. 🌺🌼🌻 Much love and flowers for you", "dhar.akash_": "@redheadwayfarer you go girl!! Don't let these idiots steal your thunder❤️", "killer_gaur": "People just want something or the other to say to shut down women, to show that they are less than them. And gosh she's just making tea, that's exactly what a person who wants tea in the morning looks like and she can wear whatever she wants (whenever). No matter how many times you tell these kinds of people that what you're saying in wrong, they just come up with new advanced methods to discriminate.@redheadwayfarer btw you rock!!!!you go girl 💕💕💕❤️❤️❤️", "anabil.ghosh": "Saloni... Just laugh at these jerks and keep em coming. If somone is uncomfortable with your posts then why visit ur profile?", "ochu_007": "Guy doesnt even knw how ‘roam’ spells! LOL", "yogit_piplani_": "Tell them what gender equality is 😡", "nishtha_dhingra": "You are perfect and truly an inspiration to so many out there. This post is so required for these ignoramus morons who are threatened by strong and bold women that they hide behind a facade of vile and utterly disgusting comments. You are doing great and keep posting such authentic and inspirational stuff. ❤️", "zarya5670": "Amazing girlll....", "shrutigupta8": "More power to you", "natashanoel001\nVerified": "Verified", "shifaa_005": "You go girl 😘", "amii_jais": "You are so brave, more power to you 😊😇", "sushantsaklani_": "I have to admit it @redheadwayfarer that I might hv written something similar to these commentors(not as gross) but something like 'What's the need of such attire when you are endorsing a thing that doesn't really need revealing outfits' but at the same time I thought about all those posts having guys casually in unbuttoned shirts and all, n no one really had much problem with that. This post is exactly what I had in my mind that refrained me from writing something silly", "3.14approx": "You know what these creeps will never gonna get what you are trying to convey. So ignore them and keep supporting all the women around the world. Our love and support is much more stronger than their hatefull comments ❤️", "gauri_lp": "Lock, load and fire! You just served some steaming hot tea to people!", "shwe_osha": "Dear @redheadwayfarer I know reading all these shitty posts might bother you but you're way above all this! You're a brilliant, brave and beautiful human! I respect you and I love you. I don't even know you but I still do. And I just want to thank you for being so courageous and amazing. Have a great day!", "priyam_vadaa": "Bitch struggle...all the while women too are accepting the bitch struggle so can't help it..Be what you are and don't get offend to people who have no personal views ..They are just following there parents words so we are all taught the same thing to follow..To feel ashamed when wearing small clothes and then also keeping confidence although at all situations is what we have in ourselves😍So girls stop bitch struggle and flaunt your bodies,😈Let the society speak about body and let aunties get jeolous of you...", "dikshita1946": "@redheadwayfarer all the people out there saying shit about you, about women can go to hell. You are superbly an amazing , fearless and wonderful woman. What you post every day helps women to stand up for themselves. So thankyou for opening our eyes and making us believe that we too deserve to live the life our way. Hatss off to you , you have done a great job. And hands down you deserves all the loveee in the world.", "modern_caveman_pro": "Dude there are both positive and negative comments on everyone's post(atleast those who are famous ) I don't think it's important to address those who shut their mind and right anything on anyone's posts without knowing the real person and their struggle so fuck them do your thing those who like u gonna like you no matter what the random stalker say or do", "megha_megha1": "Love this post. 👌", "_jongleur": "He said you Rome naked. I think you should contact the city of Rome and tell them you have a new slogan for them. Also, more power to you and your pen. Just report them and you do, powerhouse.", "gloworm93": "Such double standards. Wonder what would have been their reaction looking back at the old photos of their ancestors, if ancient india had social media to post their pics on! Women with no blouses.. Only a draped cloth across their breast. I wonder if they'd call them with the same names...! If you don't like it, just dont follow her...Simple. #disgusted", "logeshwarijohn": "@redheadwayfarer I guess people got confused with the post, most people just look at the picture and not the post, you should ignore such elements from life, coz no matter how good you are it will never be received well, coz you carry your wings and have a voice of your own. Am proud of the person you are, am sure there are many more. Just keep doing the things you do😘😘😘😘", "dr.tony.tony.chopper": "#STOPDOUBLESTANDARDS @redheadwayfarer. LET THIS BE VIRAL. LET ALL UNDERSTAND THIS.", "samiksha_patil18": "Fuck you all people...who have such thoughts and commenting bad things...more power to you and all my girls❤️you go girl❤️u are an inspiration for me♥️♥️♥️♥️", "maanushirana": "KAR LO JO KARNA HAI...❤️ #feminismiscancer", "shilp_shill": "This is so trueee🔥", "aham.brahsam": "I don't know what this woman wants see ur a feminist thts great but if u consider the comments of idiotic people how can u acheive the goals the people who are commenting against u are just idiots u cant educate a dimwit jist cast them aside and follow ur goals instead of getting bothered by the comments", "sher.yaa": "You Go Girl! ❤️", "eatwithnabz": "❤️ Perfect reply", "joyy_mimi16": "Hypocricy as fuck 👍", "shivakmathur": "Well said👍🏻", "marishaa_rahman": "Inspiring is something that not everyone do .. I don’t know about others but I actually can relate to youuu , your captions , your views , your points ..you are someone who let love and let live ..Thanks ❤️thank you ❤️thanks in ton Love love", "lazyidiocy": "Keep going you are awesome❤️lots of support!!", "custardkastu": "@redheadwayfarer bang on 🔥🙌🙌", "ritdub": "You’re full Indian? You look mixed 🌈", "somikkhya": "You go girl!! Bringing in some hope in this otherwise hopeless world!!!", "thesabishaikh": "Jobless jobless jobless people everywhere!!", "dimplekaim0096": "🔥", "parvathysreenath": "My boob,my ass, my fucking phone, my wish, I do as I like and intend to, I'll make children if I want to, I'll get married it I want to, it's nobody right to slut shame . Minding my own business and getting gawked at for wearing a low cut neck , being called a feminist for telling women to question accountability, discussing relationships openly and challenging stereotypes doesn't make you a whore. Fuck the double standards ! Fuck the misogyny ! #feminismiscancer", "grow.me.along.smriti": "Let them suck bro... I know I'm much younger to give advice but I really want to Let them just fuck off people who are doing such comments on your pic.. I know they don't effect in anyway I'm sure.. But just don't entertain them like don't entertain them at all just keep blocking don't keep mentioning them it gives them more fire in their asses 😂😂 I know you since so long and have been following you. You're superhu-man stay like this.. But let them fuck offf.. Keep it simple. We love you! 😍", "_ihdivsti_": "Your right in all means but some useless poops on this earth won't understand this and then they come here and comment some random shit and keep telling their thinking is right. But sadly don't understand the point of this. And it sadness me mahn.", "mr_sahil_37": "You always proved haters wrong 🤣🤣🤣 They tried their best but end of the we know who is winner 🙏 more power to you @redheadwayfarer #inspiration", "shww.ata": "@redheadwayfarer I love you, you are my real life hero,you are doing a great job no need to prove others it's your Instagram do post whatever you like and we love that.❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "himadri__sharma": "You go girl !!", "stylesavitri": "So true", "vacaywomen7": "@redheadwayfarer I support you,much love❤️❤️🌼", "_abhishmita_": "Them double standard sexist morons 🤦🏻‍♀️", "o__stree": "This is a perfect collage. Hypocrisy to next level. Why cannot they see body as body. Why to treat it as a treat? Why the differentiation 🤨 people need to grow up.", "seth_manya": "Thank you for being such a great inspiration ❤️", "manasbatra": "What's more prevalentin all these comments? Hypocrisy or misogyny? Or stupidity?", "monicachaudhary04": "Nailed it. Absolutely!", "juhiapte": "You do you, Saloni! Potatoes gonna potate! Also, that's exactly how we all make tea! 🤗🤗", "the_princely_chic": "On point sweety .... You're amazing keep that shit up", "khushhuu__": "Waah yhi chiz man kare to.. Bro.. Ur slaying all the females bro you're perfect bro you're gorgeous.. N agr yhi kisi ladki k post pr dikha to kya h ye meaningless captions shitty post.. Waah 👏 So there is some my kind words for all the people who have this kind of shitty mentality.. read.. kindly fuck off.. 🙏🖕 n @redheadwayfarer di love your posts n captions as well.. Specially your couple goals pics.. 💓😊", "kanishthikagaur": "You go girl ! ✨", "appyiie": "This was much needed. 🔥❤️", "van.droid": "It seriously boggles my mind how restrictive the idea of feminism is for a lot of people. Feminism is acceptable as long as it doesn't make them uncomfortable. So, education is fine, equal pay is good, getting into armed forces is wonderful. Women working and earning is badass. But all hell breaks loose should a woman take ownership of her body. Because that makes you, the restricted arm chair feminist, uncomfortable. I hope such people realise that that defeats the whole idea of feminism which doesn't revolve around things that make you comfortable.", "rebi_99_": "🙌🙌yass", "sampurnaadhyapak": "True af👍🙌", "sharmanaanjali": "But your captions and photoes are really not related😂", "linciarosario": "Dear Saloni, thank you for what you do. Love your posts. Your authentic and how.", "the.rashi": "You go girl! Free the nipple and the bum! Don’t let the hate comments bring you down🔥", "dharaj06": "Yes!!!!!", "nandiniporwal1125": "Not giving a shit to these kind of fuckers should be the new trend 😁🙌", "_dhruvi_28": "You are a true inspiration❤️❤️🙌", "listentothewaterfall": "wish i could tag like all men in the world", "suzannamukherjee\nVerified": "Verified", "a.raman.noodle": "Ever see men and think, oh look there walks trash and disappointment...", "_ekatrigupta_": "True", "anusha913": "Wow", "fizaababy": "🔥🙌I SERIOUSLY WANTED YOU TO POST SOMETHING LIKE THIS!!", "sarcastically_yours": "Truth Bombs have Just Landed...Yessssss...🙏🤣🔥😘", "_garimaaaa._": "More power to you ❤️", "khrietho_tungoe": "Embrace them all. ❤ you", "_chan_oey": "I love how gracefully you handle the comments!❤️", "chahal_sky_": "❤️❤️❤️❤️ more power to you", "d_srivastava__": "U r fucking mad😅😅", "pooj0a": "Truth has been spoken😭", "lavina_dingrani": "More power to you lady!♥️"}