{"aakashshitut22": "💋💋💋", "niharikka1": "Kyunki tere chhote hai", "sunnykhatry": "Bra panty boobs vagina nipples Iske alava koi topic nhi hota Iske pss.", "_sanjeevkumar._": "Sasti feminist 😐", "myselfmayookh": "Wah didi wah. I really hope kids doesn't folllow your bullshit feminist theories. And seriously you need to see a shrink. Get well soon.", "the_white_devil_667": "https://m.youtube.com/watch?v=IBUkMhK0Tb8 don't let liberal nonsense hijack your intelligence", "yuvi.007": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂 lol", "dirojit": "I came here after Lakshya choudary video on YouTube", "weirdo_and_doodler": "why this girl is so annoying 😂 i really don't know. each and evry post in connected to nipple-bra-armpit hair-(wrong)feminism. talking about India but living in different country. i don't understand the point.😑 and always fighting for walk nude on road. 😂😂", "grozaaa_7.62": "I'm a feminist..bt aftr reading this caption I m speechless..plz dnt misguide us .", "imkasaksharma": "Why don't you talk about women's education,their jobs ,their empowerment but no! It is a huge crime for you! You will only talk about bra,topless etc shit! For me this is not women empowerment!empowerment means gaining knowledge,establish yourself,have self-esteem and own identity! Showing bras and going topless it's just a piece of shit!that all so called fake feminist talk about!", "___thatsunshinegirl___": "OH YESSS 😍♥♥", "mahi.jpeg": "👏👏👏👏👏", "ss1117099": "What a point 👌", "vishal_arya1306": "Nipples", "anotherangryfeminist_": "@kanchan_2903", "caprice_669": "😍😍😍", "killerrey___": "🔥🔥🔥🔥🔥", "ajaysingh876": "HOt🔥", "sudip.bonik": "Ur boobs r very petty", "im_madan001": "😍😘😗👄💋👄💋👄💋", "the_raghvan": "Indian pornstar....😂😅😅😂😅😅", "arshiaprashar": "💗", "veda016": "That bra is from?", "michock1234": "Wow still some more to go pls do it many r waiting", "nijjersimi": "Sajke jawa Punjabi mutiare te kina sohna suit paya Hai kya baat Hai ji", "kunalantinakaram": "Elegant and beautiful", "arpita_here__": "I wish the way you think others may also feel the same 💕", "moh_3495": "@redheadwayfarer place to shop ??? For this beautiful thing", "ra.jat6713": "You have some mental problem please consult a psychiatrist 😈😈😈 bloody dumb women", "recovery.saying15": "Hey just free d nipples...", "ipsita2006": "I liked you in girls on top .. liked you post on travels but to be honest now ur posts are more of nudity and trying to give it some sense in the disguise of feminism .. feminism is not always about dropping ur clothes off to bare your soul ..you can discuss that with ur clothes on ..", "soupedinwords": "I love you! @redheadwayfarer. You're one amazing soul!", "m.b.adil": "#freeTheNipples", "rutuja_dalvi0819": "Whattteeyyy perfectly written piece! 🔥", "girls_cars_models": "Azam khan se pucho bra ka size", "ssinchana11": "It's like explaing not to wear condom to erected penis... If they wish they will wear condom, if not they won't.. no one forces to wear condom and also no one forces a girl to wear bra... Stop doing this cheap things... Be a feminist not a lust bitch...", "sangrace21": "Dammnn", "abhishek05_": "She's promoting @cottononbody brand for which she has to put it on and make it a feminism topic to get a good business for the company. @redheadwayfarer plz dont pull any serious nerve of society to do business, there are a lot way for promoting and no offense but you lost your goal of women empowerment rather doing business of it.", "roy_sovan19": "So cool", "givemeprawnpickle": "Food for thought really; we have accepted such societal rules at face value and ingrained it in our daily life that pointing out the obvious is like an eye opener; so much for social conditioning; by the way I love your account exactly for such unapologetically powerful content. Keep up the good work 👏😊", "amit_the_limitless_": "That's a cool post! #HighFive", "bhavyachi": "hahaa😂 lit", "yousuf1791": "Plz open the remainings also you shit women destroying the social media with ur vulgarity an dirty nude postures .Don't you have others things to do rather than giving semi nude post.", "prachiadwanii": "Have you ever felt low of yourself? And that you aren't worth it? I bet you have! We all do !", "mansivirmani": "Haven’t worn one in 16 months. My bosom has never been happier! I do miss the prettiness sometimes—saving it for the beach. 💛", "itzs_sairaj": "🔥", "sherali8416": "Have a nice body", "swapnilkaushik96": "🙌", "jit_soumyo": "Hot look🔥🔥🔥", "faizfaizal1140": "Hi. Farind. Ship. Karoge 7042818904", "arjun9148": "Good One.. Would request you to stop using them.", "vibhuti_sahu_784": "Believe me @redheadwayfarer its like I am also thinking the same on bras topic but I was not able to put this things in words and here you are with amazing amazing post....!!🙌😍😍", "moonmagic_2210": "Also, where did you get that bra from 😉😉 it's really pretty", "faheemba2648": "Looking#hot🔥", "shabuddinshake": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "_pratyasita_panda": "Caption👌👌", "dhw.ani": "I LOVE YOU SO MUCH", "wendymariieee": "Mmm I never wear bras..", "sabi_khan93": "Isko kpro se msla kia hai 😆 mri smjh se bhr hai pta nhi kon sa woman rights ke bre main bt krti hai 😂 bhttttt zrurt hai hai isko psychiatrist ki 🙄🙄", "beinghuzaifa____": "Vulgarity under the label of feminism ! Good going trash girl ! 👏", "karishmashah393": "Wow", "moonwooyoon": "I absolutely adore this woman. Saloni you're a legend, I salute you. This is called real feminism and this is how more people in our society be like", "mohammadshaikh156": "Yes baby take that offf I can see that black nipples 😋😋😋", "visual_travellers": "Wow 😍", "deehmish": "YAASS GIRL SAY IT LOUDER FOR THE PEOPLE IN THE BACK 👏👏", "la.loba.herbalism": "Oooft love this look tho. I never wear bras 🤷🏻‍♀️", "vanyaajoshi": "Terko toh Har cheez se problem hai bhai", "ram_3900": "😮😮", "shanu_mumbai": "Sexy girl ❤️🔥💋💋💋", "_divya_jami_": "So true♥️♥️Wear it or don't its upto our comfort...lets hope people stop making such a big issue about bras, afterall they are normal pieces of clothing.", "anshulgajwani": "Fake feminism has fucked their brains🤦🏻‍♂️🤦🏻‍♂️why these dumbheads want to be naked in the name of equality?? and even if they want to be naked..then goooo...roam naked on the streets..dont be a dick about it", "_ravishankar25": "Beauty💛💙💙", "suvida.rajput": "Love it🔥", "i_am_jatind": "@harpreet_singh96 😅👍 sahi he dost", "its_ar3": "Nise", "sk1346264": "Hy sexy", "neha_anand_raj": "And having so many problems with a bra, why post a picture wearing one😂😂 of u want ur heart out u can do that even without shouting feminism feminism!!", "saeed.kabeer": "💖💓💗💕🔥", "bawabairagii": "Who else just watch her pics & ignore rest of shit", "tas_ren.neela": "👅👅👅👅", "priya_mukherjee21": "Bang on!!😍", "_ek_gotakhor_": "@shreya_gaikwad_ ❤️", "eat_like_repeat": "@redheadwayfarer I've always admired your confidence and the way you carry yourself. Sadly, some people can't stand a woman expressing herself so freely. Please don't let nasty comments from such people bring you down #morepowertoyou 😘", "milind.gharat.56": "Hot", "komalishq78": "Awsmmm", "sheeks00": "Hit a like if you are a woman who when comes home, the first thing you take off is not shoes, but BRA. That's how socially normative it is! 😁", "joana_2467": "your content highly n specifically revolves around boobs..i think its tym to include vagina as well😂 GO FOR IT !!", "__bong.mey__": "Bra Color🔥", "vanisubramaniam": "❤️ thank you for being you", "thatgirl_rightthere": "A cheer for bras and three cheers for no bras!!", "kesarkar_sushmita": "Your caption are literally the things I think about bras ❤❤❤❤ I love your account and more than that your thoughts ❤❤❤❤❤", "khushbupanchall": "That bra is so prettyyyy😭😭😭 omggg You badass woman doing just YOU!♥️ The caption is everything to have a word about.", "petal.___": "🙌 👌🏼", "daredevil0036": "Love those BLACK TITS 🍼🍼", "02shreya22": "Sooo damn true 🧡", "simranminocha": "❤️", "srv_luv": "If u feel comfortable wear it if u dont , dont wear it y showing others 👏👏👏", "ranbirrajputt": "Sweet🔥", "benzykumar": "Well I think this is the matter of comfort for girls. Where they feel comfortable let them enjoy there life. In addition to this science says we should sleep naked , it keeps us young and very creative and lots more.", "noshadali344": "Like u", "amanda_iona": "Always hated having to wear them.", "shovachaudhary47": "I used to b a grt fan of u saloni frm da drama girls on top.. i luvd da way u potrayed da character of a stonger feminist n den i happen to find u on instagram reading ur posts nd thought how brave is she..!! Bt no more i think.. i mean i liked da way u took supportive towards feminism bt i dnt find any logic in demonstrating power to feminism showing nudity n all evrytym ...i think dis generation hs lost dat grace wat women's of past dayz used to b.. look at rekha how graceful n bold z she being fully covered.. today i came across her interview n learned a lot hw feminism actuly luks like😍😍 🙏🙏.. no offense ,besides dat i cn see hw beautiful ur soul cn b.. 🙏", "abduljabbar7234._saude": "Pik", "the.big.fat.guy": "@truly_madly_with_maddy you need to follow her", "cranky_cake": "@redheadwayfarer so much of negativity in our society just for a piece of clothing pisses me. In fact apart from this i've witnessed people who can't even openly spell the word \"bra\". I mean what's the deal? When men can flaunt their lux cozi ad jockey underwear under the cover of fashion then why should it be concealed for women. I mean let just individuals decide their comfort.", "sammy_yay_yay": "👏👏👏👏", "____arzoosaxena01821____": "Love you❤️❤️❤️❤️", "shriya.tripathii": "You look so pretty!😍", "themoonstonegirl": "With every post I keep loving and admiring you more and more! 😍❤", "natashanoel001\nVerified": "Verified", "khushboo830": "LOVE THIS @kosha.v @ashok_14 @bhavik236 @dipikano1 @payaltripathi @radhika.tripathi", "mru_lee": "👽🔥🔥🔥👽", "desaisudeep": "Arey baba. Don't wear one na. You happy, us happy, let's make world a happier place!", "shirish1818": "hi sexy", "farooq9556": "❤️❤️", "joy_boruah": "Pink colour ka bra or v shoot karta", "kristel_8368": "Mam you always look so beautiful", "sanjeenamal": "Beautiful", "shivany.sahay": "Rightly said... And a very good question! Why the fuck are they made so pretty if they have to stay hidden ! @redheadwayfarer ♥️the caption 👌", "hortipriyanka26": "What the hell... Tujhe Sharm Nai aati kya...", "sukhwinder4113": "Wow bahut khubasurat ho aap👌", "saifhardrock7": "Nice sexy", "hussainmaksood": "🌷🌹🌹😘😂", "dev__gru": "I love it when @redheadwayfarer posts something really meaningful and people get butthurt and start abusing her. This reflects our society's way of reaction to certain things and remind us the amount of changes we need to bring as a generation. Power to you girl.", "arshpreetsingh_.7921": "U need a mental checkup plz consult a doctor soon hope u will be fine one day", "miss_7seas": "Love how men think they have an opinion over bras in the first place. A bunch of men also think it may have never occured to anyone to just stop wearing a bra if we don't want to. I mean duh, of course we are dumb like that. And how easily they will also say that a woman was asking to be shamed if someone was shamed for not wearing a bra. @redheadwayfarer i have been meaning to comment for a long time because ur posts are simply so inspiring but i never found appropriate words. Opened the comments section for the first time today to see so many men and women conveniently moving away from the basic topic. What u r doing is so amazing and how strong u r to put urself out there for everyone's judgment. Love u a lot ❤️", "anukshabharat": "❤️", "avibratadey": "I love yellow ⚘🔥💋❤", "musicmywife": "Because some of the dumbheads think that bras are meant to be shown to their husbands. Well that is totally incorrect 🙌 you are slaying all the way 🔥", "roshanpatil99999": "#⃣💋💞😘😍👄🔝👌👩‍❤️‍💋‍👩💋💞😘😍👄🔝👌👩‍❤️‍💋‍👩💋💞😘😍👄🔝👌👩‍❤️‍💋‍👩💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💞💞💞💞💞💞💞💞💞💞💞💞💞😘😘😘😘😘😘😘😘😘😘😍😍😍😍😍😍👄👄👄👄👄👄👄👄👄👄👄🔝🔝🔝🔝🔝👌👌👌👩‍❤️‍💋‍👩👩‍❤️‍💋‍👩👩‍❤️‍💋‍👩👩‍❤️‍💋‍👩👩‍❤️‍ #⃣🙈😽😻😎🤘✌😘😘😍💋😊💞👑🤗😍😗😙😚📸👙👙👙👙👙👙👙👙👙👙👙💄👑🕶👁👆👆👆👆👆👆👆👆👆👆👆👆👆👆🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕Ⓜ️♨️♨️♨️♨️🔝🔝🔝💯🔥🔥🔥💥💥💥♥️♥️♥️", "iaminvincible7": "I think pure kapde pehan ke bhi women empowerment ki baatein ho Sakti hai", "indian566": "💋💋💋", "sowdamini.pogaru": "So true, more power to you! 🙌😍", "radhasejwal": "Hey beautiful 😍", "akash.solankii": "Damn strong caption!!", "vinemr_rajput": "I really don't understand how guys can be such judgemental trolls without facing this for a single day in their life. If you can't support or say something nice or be empathetic, just move on. Not that your opinion/words changes anything anyway. :D", "rohit_srivastavalove": "Wow Sexyyy", "yoursenpaii666": "❤❤❤❤", "duskyandshort_": "That's the best thing I've read for the longest of times i remember", "inert__phoenix": "I too had all these questions in my head! And the answer was \"flaunt these\", and if you wear one, it will show, like any other piece of clothing. It's not about society's norms, it about my choice🌸", "ahanadutta24": "Just remove ur bra...the strong way 2 ask for feminism...😂", "manuvk5015": "U r great😘😘💋💋💕💕", "samabishnoi": "✨✨", "aarzoo_kaur": "This is a beautiful post and beautiful bra! 😂 ❤️", "anaaagha": "❤️❤️", "themiss_negi": "U r so so pretty so original so bold. U r inspiring ❤️", "lotteholterman": "🙌🏻 I stopped wearing bras completely – the first two weeks it hurt when I walked, but I have never had such firm breasts in my life, haha! The whole area actually became much healthier and prettier, it seems. And it’s an amazing sense of freedom.  I must agree that bras are damn pretty, though.", "missadarshgautam": "can clearly see how many balls got hurt by this single post of yours😂 you do you boo❤️ You a 💥powerful badass woman🔥", "yashikaayadav": "You are beautiful❤️", "prashant__0102": "Some alien in some other universe🤔, \"This Human Being is way too smart to prove its point.\"", "nishinvogue": "Cool", "gogoi_vishal": "Omg", "rohkumar9638": "Beautiful", "karan_2.0": "Oh fuckkk you so hard you never forget to wear bra when you leave your condo😂", "manveeenn": "💛💛💛💛💛", "zarya5670": "If they dare why cant they attack corrupted officers...builders... industrialists.... who are destroying environment human life....", "__muskangarg__": "🔥🔥", "b.chauhandhaval": "I know your feelings par ab kya kare ye zalim duniya ka @redheadwayfarer .", "akhtra": "👌👌🔥🔥🔥", "_bookish.wonders_": "💕💕💕💕💕💕💕💕💕💕💕💕", "ujjwalchoudhary_04": "Really impressed, loved the caption 🙌❤👌", "vermaji3900": "call+91-9057114059 वशीकरण के लिए सर्वश्रेष्ठ बाबा जी ,अपने दुश्मन से तुरंत छुटकारा पाएं ,अपना सालों पहले खोया हुआ प्यार💕 वापस पाए, किया कराया पति पत्नी 💏में अनबन। देश-विदेश ✈️में बैठे क्यों हो रहे हो #परेशान। समस्या बताइए समाधान पाइए🎁🎁 काली📔 व लाल📙 किताब के माहिर पण्डित _सिद्धार्थ _शर्मा. 📿 call or WhatsApp📞 +91-9057114059", "reeceroyce215": "🔥🌹❤️", "bipinmore23": "🖤🖤🖤", "charmingly10": "I'm sorry but ones that's such a beautiful one love the colour two it genuinely works because patriarchy has so deeply been rooted that when ever you see a bra it jumps to \"rape\" or \"attention whore\" I'm surprised at that reaction Everytime someone points out the strap to me like \"oh my God, you saw my bra how will I ever come out of my house now🙂\"", "shukla_stuti02": "Another truth bomber... applause for you..👏 you say everything that most of us hesitate to say.. thank you👍😘😘", "royal_class_1": "@redheadwayfarer I want to meet you . Can you take out some time from your busy schedule .", "alone_a_apart": "That color though💛💛💛💛", "asliarpit2725": "@redheadwayfarer you are getting cheaper and cheaper just to attain publicity. And there are hundreds of other brainless feminists to support your shit. Your posts only highlight nudity, nipples and vulgarity. It has nothing to do with equality. Accept your body as nature has gifted you else go for a sex change operation. Instagram is not stupid to censor those organs. It has a reason, a reason to follow certain ethics when you are on a social platform. You are just an urban hipster highly influenced by the western culture but failing miserably all time.", "thepunnyfaaji": "❤", "nitin_19t": "Amazing😍", "farhanali7028": "Sexy bra", "be.eisha.t": "I've always had mixed emotions about bras. They can boost your confident at times so that's good. But sometimes they fail miserably in doing one job they had. Especially for women who are on the heavier side. But I agree with you. On most days it does feel restrictive. On some though, it does feel sexy and a confidence boosting tool. But I think I'll pass not not wearinv them as of now. Maybe sometime in future when I am liberated enough or confident enough... You go and do your thing. Love for starting these insightful conversations.", "beck_dunk": "Ramazan Mubarak", "tani1524": "Loved the caption❤️❤️❤️ but I can really not survive without a bra because then my breasts start hurting. And as I've got heavy breasts, I can't run without a padded sports bra. I don't even take it off when I'm at home. It's way too uncomfortable to roam around without a bra.", "sarasiddiqui__": "Dil jeet liya caption ne aaj tohhh😍😍👏🏻👏🏻tho not a new thing for me coz your posts and captions are alwaysss sooo Good and Litttt💞💞🔥🔥more power to you💕😚 xoxo💋", "anam_husain05": "Need this bra in my life! 💛", "the_sabyasachirahman": "The weight varies ma'am, balls don't weigh much....n so there is no problem of sagging! That's the only point I object to! Rest I completely agree .....", "_pragya_pakhi_chirps_": "This is beautiful 💞 @redheadwayfarer", "angstynutbrain": "This is amazing!!!❤️❤️❤️", "rashmita7995": "And what's with the tag #brasfordummies? I love wearing a bra. I feel more comfortable wearing it. How can you call ppl wearing it dummies?", "ravimehra93": "You never fail to give me a boner", "pure_soul_richierich": "Oh i love you @redheadwayfarer", "manishsinghrahul": "Can I see that ??", "_sillyinkblots": "@tricksandwords", "aishwarya_rana0028": "Beautiful❤️", "boymorgan2k": "You are so damn sexy..sagging or no sagging duz'nt matter till the time those deep brown titis are hard 😘", "fearless.soulgal": "♥️", "mugukanna": "😍👆💛💛", "satyawadibaba": "men and women all are equal. If men can walk naked why can't wonens do the same.You should roam naked", "abhishek_jain16919": "Beautiful ❤️", "anuragtiwari0890": "Just love the picture", "ankification": "So sexy😘", "geeta_patra": "That's one gorgeous bra", "darkestwounds": "Which hair colour you use to Colour your hair????? Please tell me, i have tried streaks that doesn't work properly. I want to do red. Please can you help me with this???????", "aliamailk20": "Sexy😍", "shrey4190": "🙏💖🙏", "queen_of_monsters_nidhi": "Well said di 💛💛💛", "sid082012": "and this one is so pretty. you should flaunt it. You go girl!", "rubab_naser9": "😍", "achyut0900": "You do realise that it's see through?? Anyways reported it for nudity😂😂😂", "varunshegal": "❤️", "rathodkishor710": "Very beautiful", "unapologetic_mon": "Wow... Yellow😍", "heersphere": "10/10 caption", "shwetasantosh_": "HOW ARE YOU SO BEAUTIFUL? ❤ MADE MY DAY INTO DAYUMMM🔥", "_chetna_kaith_": "Pretty woman.!!!!!", "sakshisaini712": "That's y you are my favorite😍u never fail to inspire and u brings light on such cool topica💪👌 iloveu @redheadwayfarer dida❤️ hope to meet u some day in real😭😭. Loads of love from Delhi💖😍😘😭😭😭keep inspiring,keep shinning,keep achieving❤️❤️.", "alimor_ysiad": "10 times like for the caption and 1000 times for your thoughts that come across like a sword!!!!", "___saloni___": "Where are the pants from?", "rishuwashere": "Hahahaha.... Ab bolunga to saari feminist yahi aa jaaygi", "rusty61989": "Why so beautiful ❤️😊", "alinakhan.23": "You go gurllll🔥🔥", "aakriti.thakur97": "@swinixoxo", "singh.sexy.tish": "😍", "aishwaryasinghx": "@meharbamrah", "vikrammehta934": "👌", "vishalyadav4059": "Looking very sexy", "greyscalesam_97": "If there were no men in this world I'd walk around in my bra only", "hathiparinda": "Thank you for writing this. @redheadwayfarer My male members of the family should read this.", "shrutiisingh": "Don't talk about loving your own body when you've photoshopped your own picture haha", "_sassy_shweta_": "Tell your boyfriend to support them for you they give the best support and comfort or else hire someone to do that... Thank me later", "what_shoaib_saw": "Don't know what you want to proof, no one forces women to wear a bras anyway, so get over it weirdo", "ritik.jolly": "Looksss.♠️", "_chandelier._": "The caption is so on point 💖 also loved the bra..its soo beautiful ♥️", "manyaarora695": "You are always so amazing!!❤❤", "aishwarya_vashist_": "That's what you do, you let us think against what has been normalized by the society for years, but isn't at all normal! Some people say that whatever you do isn't feminism, but I think it is very much more than just feminism. Because you encourage people to at least think about it, think beyond so called 'Normal', and that's the best kind of development any country could have!❤️", "komalwalia95": "@shelley_dugar", "inshajaveedbhat": "You go girl.....More power to you 🔥", "santy_gayatree": "Hope one day we have the courage & sensibility to teach our children such ethos... More power to you girl... Keep on rocking 🤘🏽", "_nidhi0808_": "❤️❤️❤️", "shaikabed7": "Fucking hot boobs 👀", "we_too_exist": "yellow has always been dear to my heart 💛", "monochrromi": "YOU GO GIRL", "stylesavitri": "So love the styling. You look so gorgeous Saloni.", "designer_wid_perception": "Dude... I don't like bras at all,first i am little skinny,second wires and pads hurt me... But still i wore them everyday cause i know myself and one way or other, they build confidence in me,as a step out of my home", "sachinkhelukar": "I like you", "banguuuu987": "You always best ❤️❤️", "kaleidoscopic_pieceofshit": "You. Are. Amazing.", "arundhati__": "Oh my god 🔥 Saloni di you just spoke every girl's heart out 💛", "swagatika174": "@redheadwayfarer... Ma'am request you to please post about the cyclone fani and show ur support towards the victims of the cyclone in Odisha and other states. Please help us rebuild our beautiful state again.... Please show ur support https://cmrfodisha.gov.in/donation/onlinedonation.php", "jyotinisha": "Yes! Watch. Don’t touch!", "tayyyswifttt": "♥️♥️", "lookadonut": "❤️❤️❤️", "sourav_ga": "#freethem", "agyapragya": "Wonderful🌸🌸", "_the_sarbojit_": "Kuch paisa lekhar kapre kharid lo behen.", "ady12390": "@_ririz_", "pragatipandey194": "Well said!! ❤❤❤", "____gelato": "love. that. yellow. 😍", "iifivexeroii": "@redheadwayfarer I love that bottom 💓💓", "joblessjack5": "🌈💟😍♥️🔥😘", "butwhyaayushi": "gorgeous 😍🔥💕", "sahiill46": "Hawwtttt😻🔥🔥", "kuhuguptaa": "Extraaa 🔥", "anizsaha": "Yellow 💛 one 👌🏻", "reality_bite": "is it comfortable??", "welcometo_omkarcity": "U and ur philosophies are lit🔥", "sneha._.dogra": "💙", "zukhmani": "This is such a badass post.. love u.. love this picture.. it's just amaze..💖💖", "niketa_sangani": "Caption 🔥"}