{"capturing_maniac": "U seems like Kaitrina Kaif", "___l0nely_p0is0n___": "💗💗💗💗💗", "merajahmedidrisi": "Hii 💜💜💜💜", "kavin.peter": "I think u r sister of Katrina kaff", "m.farooq147": "❤️", "jangra0047": "So beautiful 😍", "khushboo_2065": "@zainaabch face structure same hao", "____sawera____": "Wow katrina 😍", "stars_vhf": "❤ U", "moomal_khowaja": "Love <3", "suruchiibhatia": "@shivaanij24", "wildsunsetdreams": "You possible can't imagine the reaction that all the indian army brats have given to this post of yours. Ma'am, tears well up in all the army kids when you attach Pakistan's name to India's independence and how you've hurt so many Army men at the border who have had the dishonour of reading what is written in the post. My father is in the army, and I feel so shameless at the moment that he has to serve people like you.", "neilkumar6939": "Gorgeous 😍", "taufikkurrahman___": "similar to Katrina but different lip", "vidvansh9639": "# Sodni", "sukhdeorathod007": "i love u", "pinkums": "I thought she was Katrina", "j_dba2": "There should be war", "neslihanrabiaa": "👏🏻👏🏻❤️", "_m3r__": "Agreee 👏🏻👏🏻 am from Pakistan @redheadwayfarer Mashallah well said 👍🏻", "_janakrathod_": "Please ignore all this digital hate, for all I know is love and humbleness does not harm anyone, and you must keep preaching, for such messages are the ones that need to be read out loud, in echoes. @redheadwayfarer", "punekars.wadhiv": "Ek simple baat kehta hu..agar aapke ghr me koi najdik ki logo ka sar katkar,uske body ke sath khilwad kr kar mar diya ho..aapko uss aadmi ke prati kua soch hogi..aap usse pyar krgo? Peace chahiye? Pak ne kabhi peace ki batte ki..har din 2 jawan shahid hote he..boarder pe khada jawan usse bhi peace chahiye hota he..par milti he goli aur ghr walo ka uski lash..yaha badi badi peace ki baate krna aasan he..kabhi jao shahid hue jawan ke gharwalo ko milne aur pucho unhe peace chahiye ya badala..", "saloni_dhawan": "This is really good 💕", "iphukon93": "@mawrellous", "mukul_chaudhary05": "@redheadwayfarer ..Okay.. then..why nt those caring n kind people of yours never ever try to oppose the terrorism of their own country in any fuckng way... why.....????? ..", "vijay__patel": "Wow sitting in an air-condition room and typing the speeches of peace and love are so inspirational. Maybe you should buy a house at border and live there. P.s it would be easy for you to see your other self there.", "sannechino": "😍", "sheetal_kashyap_1": "Wow ... U r absolutely right ...", "rahul_036": "Loved this pic", "tussharalagh": "Ask from the family members of the martyrs, whether they want to wish them independence...an independence that killed lakhs of innocents in name of religion.. India is always first to offer pakis a hand of friendship bt they r always ready to stab us in the back..think about the POWs u dumb woman, their sufferings, their sacrifice for this country, the sufferings of their families..think about the innocent people that r killed when they break the ceasefire, when their people openly burn the Indian flag in their cities, u just don't know anything..sitting in a closed AC room and standing in -40 in siachin..i don't even know how to compare both the situations..cheap publicity.. Bullsh*t post", "scarlet.sugar": "Oh my god so beautiful❤🎈", "noorulain_xo": "OMG she does @mekii_xo", "samirxx132000": "U hav a beautiful heart nd a beautiful mind.... luv u.. ur my angel .... 💟", "rubykhakh": "@tannusharmaa_ if katrina and ranbir had a baby girl! 😍", "a_y_e_s_h_a_k_h_a_n_22": "👍🏻", "effectivewords": "I can't believe that someone just copy pasted my thoughts so beautifully!! @redheadwayfarer 🌹🌹🌹", "iamkushalhabibi": "Pakistan and India can never be the way they once were. Get that in your head. No hate against them but we both have screwed up our relations big time and it's almost mostly them nowadays screwing up things. Why don't blind liberals understand this...Jeez", "somya_keshri": "Beautifully said👌👌 @redheadwayfarer", "binnt_e_hawwa": "@arfi_yan ❤❤❤", "the._.sin._": "Beautifully written... .you really inspires me! 😘", "backpacker_munda": "Well said.. I'm with you... we want love n peace...", "omkar_sonawane6114": "bro talking about pak people go check you tube pe what all trolls they make what comments they post on India😑 you need see all that then talk about porkistanis! we are 1000 times better then them ! @redheadwayfarer", "_khantooba_": "@fat_to_fit_to_beast_journey you kinda people are the form of the Sadist Society. Please let your heart and brain breath in the fresh and free air. Learn to accept peace. World is a beautiful place, if shared with love and not haterate.", "naruto_shriya": "@kulshresthasanskriti @esoteric_john Completely agree bcz of these flop tv actress like @redheadwayfarer who in trying to gain more followers give gyan...sitting in there ac room. When our soldiers are fighting this bloody pakis on the border...", "pooja_devi_bora": "The best post I've seen EVER... #tearyeyes ❤", "rajgulshan": "This erosed me , i actually saved this msg ...", "kashmirthroughmylens": "Love this. Beautifully written ❤️❤️❤️", "sadhu_world": "U look gorgeous", "thesilencehoarder": "@hafsassy_ Damn. The caption", "shilpa198": "This girl is in love with pakistan...trust me...dafuq", "bushraasyed": "Am I the only person who thought this was Katrina?", "farwacheema_1": "in love with this post -pakistani", "official.memes.addict": "Amazing❤", "krina_xox": "@makeupby.sumz read the caption 😒", "iambabayaga": "The day when a women walks freely on roads at night then is when we achieved freedom.. @redheadwayfarer", "shubh_guptaa": "Beautiful", "abdul_samad_insta": "Awesome click😍", "gupta_mohit_007": "Go to Pakistan bustard", "anjuyadav___": "Your words always inspire me @redheadwayfarer agree to each and every word. #humanity #india #indiapakistan", "mavricksarthak": "Zameen he tho thi ,ek lakeer ne begana Kar dia hame apna unhe paraya Kar dia !!", "vikram_ckm": "Y soo sad..? yaar ..its an independence day...", "write_2_live_": "First 3 lines would have been more than enough...", "harshitasingh98": "Yes. I wished @pirahmed_official day before yesterday.", "kashishhhhh._": "The best write up I read today. Thank you for putting forwards so many people's voices in world's.", "arashbellu": "❤❤❤", "knobiwankenobee": "💜💜💜", "soumyacs13": "I hope dat One DAY come soon where both countries r united n ppl live peacefully, happily... Like 1 Gud Family @redheadwayfarer", "maliksaima2020": "My parents from 🇵🇰 but i found out both my grandparents wer born in 🇮🇳!!!", "gargaryan345": "@redheadwayfarer", "kanishkaxx_": "superb🙂", "ritu2564": "Beautifully written.... #united #indiapakistan #humanity #love #respect", "d.sannaa": "@iam_zeemal just read this babe👀❤", "ms_shanu76": "I am your bigest fan mam... Girl on top is best show.. Because you are on this show", "swapnilrawat._": "❤", "lilkutishya": "@singsunita10", "wasi98_": "Caption❤", "that_fatrunner": "The best write up I read today. Thank you for putting forwards so many peoples voices in words.", "shubhh__k": "You look like @katrinakaif 🙄💕😂😂", "jagmohanjc": "@redheadwayfarer only few people like you have the courage to speak their heart out. Kudos to you..girl", "poojasharma_0910": "@redheadwayfarer brilliant.", "samlohana": "@farihaly", "prashanth.gangadharan": "Saloni.. Please start a BLOG! ❤ PLEASE DO SO IF YOU CAN❤", "sohiniibose": "Its been beautifully expressed by you and d way u think", "vidushipandey21": "@himanshuneo", "ar.ushi": "@nidhichankrola103 so you'd rather have everyone in pakistan dead and in hell for the deeds of some? Also a true human realises that not everyone is to be hated before knowing them.", "surrealrashi": "For the captions like these one should have the biggest heart possible. If you read it properly she's just talking about humanity and don't forget \"an eye for an eye makes the whole world blind\" #respect #peace✌️", "priyansh__mishra._": "go spend some days or infact get settle in pakistan@readheadwafarer", "boldxylem8844": "Katerina looks with a nice message", "truelovesfantasy": "The world needs more people like you. The media need to post more things like these instead of dragging the same old news about some specific celebrities to seek views. SOMEONE PREACH THIS FOR ME PLEASE!", "gauri_patre": "@redheadwayfarer whenever i have ups and downs in my life i jus go through ur posts :) truly ur an inspiration ...go girl u are d reason for a change", "kulshresthasanskriti": "To overcome the problem of terrorism rather than fighting like cats blaming on countries and religion it's time to stand united and fight back", "dharavijit": "Hypocrist... Pseudo feminist... Attention seeker", "mr_avinash_t": "niceee", "nimeshdadia": "Beautifully put Saloni. Partition was a mark of failure of freedom Strugle, India - the name comes from Indus Valley Civilisation - River Indus was divided, Punjab - the grain bowl of India , the Heart of North - West - East of India was divided , Its two arms - Now Pakistan and Bangladesh were severed , airs Head Jammu And Kashmir were left in a State of Confusion. Is this what you call Independence", "joey_sam09_": "@redheadwayfarer di u r awesome :) it's beautifully written every indian feel the same except some of 'em and yes to all tha Pakistanis nobody hates you we love your nation it's because of from both the sides some elements don't promote peace!❤ nvm saloni di ur views ur writings everything is just awsm :) #cheerstoyou #happyindependenceday :)", "fatema_01_53": "Thnking you di for such beautiful captions ...they r soo motivating nd energising ..feels gud to read it😊 @redheadwayfarer", "pixlglyph": "Who is that? Looks like Katrina", "aarohi.41": "Ur thoughts👏👏👏👏👌👌👌", "the.augment.woman": "Your too beautiful. I beleive you , and support you with whatever you do!❤️ your an inspiration to me ! Thankyou for being there.", "samikhan0202": "Looking beautiful.", "vidushi_singhal_": "This is too good... 💚💚🤘👌🔝", "prattyandfood": "My best friend is from Karachi. We've been friends for 6.5 years now, yet to meet. Some of the best people I know are from Pakistan and their hearts are as big as their poetry. ❤️", "nishapumnani": "U r amazing girl ... ur thoughts ... in love with tht 😙😙😍😍", "_raghavkhushboo_": "❤❤😍", "zanikhan15": "Happy Independence day from Pakistan🤗we need people like you on both sides😍may love, peace and humanity prevail😊 #PakistanZindabad #jaihind", "akansha_kotriwala": "@redheadwayfarer Woman, you have got something so wonderful and powerful within yourself that I can't even express what you do to my mind and heart with each post of yours. You're not perfect, nor am I, but your thoughts are so subtle and wise. You help me grow in each dimension possible and trust me, at times I wish I were you. This post is insanely amazing and the way you write these feelings out are jaw-dropping. I mean, how! We all are one soul, it's just the body that differs. Instead of trying to make yourself look good, folks, trying making your soul better. And you, Saloni Chopra, you are a beautiful beautiful soul. I love you. 😘👭", "manisha.singh6": "I believe in humanity but i dont believe in Pakistan !! #bharatmatakijai🇮🇳🙏", "mariamsayssalam": "India or actually the world needs more @redheadwayfarer s", "beardistanni": "40% of the indians here are missing the god damn point, really appreciated the ones who got it straightaway !!", "5.6feetofsunshine": "@chaitanya_atre19 read this. It's beautiful!", "prathamsatalkar": "Beautiful thoughts and I share your sentiments. In my opinion it is human greed that made us divide this planet in different Nations and draw borders as if it was our anncesteral property which was given to us. Let's all pray and hope for that day when we will have peace , harmony , equality for one n all.", "_fero_cious_": "#indopakfrienship #peace .. one upon a time we shared the same blood ...and still have the same blood ...just the difference is upbringings...what have you being taught since you were born, that matters....if you give a child a gun ; he would obviously fire that ...if you teach a child to fire a gun just in fanacy to receive heaven (he would become a terrorist) upbringings you see ..upbring your child and teach him to justice ...both the countries suffer from terrorism and blood shed...this independence day I would ask you to be independent from the inhuman deeds of your ...don't change the definition of BEING HUMAN ...look at Salman Khan wearing being human tshirt 😂..BE HUMAN ...and don't even change the definition of BEING HUMAN❤️", "swteighteen_": "We need more humans like you who think really nice and when they speak good things comes out,we need more humans like you because world is in need of love, we hate each other just because we all don't look similar but who the hell looks same in this world just the thing is we need to except things which we don't and that takes us back and that makes us hate others but if we have little of respect everything will be fine and peaceful. We all have the same blood just the thing is we don't have the same thought .We all want peace and harmony but no one works for it .Living our life the way we want to doesn't make us small or ill-mannered living our life the way we want to makes us strong and happy but that every one don't understand and then we fall into the trap of inequality .", "shalini_bansal_gupta": "She luk like katrina nd nargis", "shreepalpanwar": "Katrina", "tim_katara_": "Agar sab samjh jate toh kitna acha hota tab ladai nhi hoti na koi marta....pr hum itne bewkoof hai ki aaj tk nhi samjh paye ki British jaate jate kya kr k gye...#humanitylovepeace#india#pakistan", "taziiee": "Seriously ❤️ happy independence day", "sonali._ghosh": "Beautifully written 😇 Happy Independence day ❤", "sarika0_0": "Well i read all your caption ...i always think i should comment like \" wow uh nilled it\" kind of ...simply this comment is just because i can't stop myself any long ....is caption is another awesome one .... sometike i wish i could be as strong as you are ...or i could have express my thoughts as you do to get relifed .... well you are just amazing... ...sometime i just wish i could be your friend 😅😅(stupid me) ... i love uh #redheadwayfarer the way you are ....😌😌😘", "shwetaaa13": "@abhilashkatariya1 read this", "riyajoshi__": "Anyone who likes reading must read 'I am Malala'. That books will change your perspective about the people of Pakistan. There are so many good people there. They are just like us. And just like us they too are afraid of a few terrorists which may be present but that doesn't mean there aren't good people. There are millions of good people too💙", "krish9951": "Bakwaas.", "marieascencio": "This was beautiful and so are you ❤️", "eshadoodles": "So much negativity in the comments.. if people can't handle a mere post, how are they ever going to handle an issue as delicate as partition? @redheadwayfarer girl you've put so many emotions into words. Brilliant!", "mohinikathar": "I am another you! ❤ There might be many to criticise but few like you who think of peace over shaded and less acknowledged patriotism, we hope for that love. One day sure!", "decentdevil81": "All this looks goods in writing. The reality is that it sucks to be even thinking about growing with Pakistan. All they need is small reasons to kill innocent people on both sides of the border.", "akshii__sharma": "Thank you 😊", "saanvigaud": "Happy Independence Day @redheadwayfarer", "agnihotri_stuti": "So true! 💯 Happy Independence Day!❤ We should respect the soldiers of both the country, even the people. Your post is so relevant. People are not bad, person is bad.😂", "raj_brahmania": "#beautiful 😍", "vvk13": "Just to correct...Pakistan celebrates its independence on 14th august and not on 15th august...!!!", "_sunaina.sharma": "👐 👐 👆👌mindblowing👍☺", "whereispriya": "Amazing it is. Jai hind!", "kamal.mittra": "Beautiful", "prashant.raj_": "I have no fucking interest in welcoming pakistan to india ! Story is good and beautiful too but its baseless and with no practical possibilities ...before wasting our hard earned money on that psychopath country lets focus on becoming one of the the most developed country first then only we can think of taking care of that bloody Pakistan !", "srishtishankarmathur": "@hi.ah babe. This.", "baloch_7": "@redheadwayfarer i am appreciate your thinking 💭", "manyaxgupta": "I love this.", "halaayadi": "You re love 😍", "shamilashoshii": "MashaAllah! How beautifully you said!! 👌Woww!! @redheadwayfarer 💜", "hansoloandsoami": "You look stunning as always and what you just wrote is something I totally agree with! I love how you think and are able to put your feelings in words. Ni wonder youre the most amazing woman alive ❤️ @redheadwayfarer", "maher_supecute": "Beautiful❤️good one👍👍👍", "esoteric_john": "Apologetic about what ? They bleed us daily and believe in 2 nation theory. the whole state carved out on the lines of religion and this aman da tamsha has no bearing on Pakistani jihaadi army and most of them support terrorist army.", "simrankraina": "It's sad that partition happened decades ago but still continues to divide people. Though, there is a hope that current and future generations can bring the nations together if they understand what you wrote word by word. #hereshoping", "suman_gangaputra67": "U r So beautiful 😍👌🌅 fresh", "papertomypen": "Love from across the border! 💚💙💚💙💚💙 #YourLoveisntUnanswered! 💚💙", "rtistg": "Ma'am @redheadwayfarer you wrote this so beautifully......👌. Everytime its the best❤", "chopra5875": "Beautifully written", "iamshilpichowdhury": "So perfectly written the beautiful thoughts. We were all one once and humanity is more than any other things. Brotherhood is what we need but you know what...? Nowadays writing these words of love can get you in trouble too!! Some people think they're the only deshvakts!", "naz_jilani": "This is beautiful and well written. Applause...", "ashiqmoidheen": "Can't resist to congrats you @redheadwayfarer", "zahb_zee": "It just made me cry I don't know why some of you hate Pakistan that much .. Your comments are too harsh .. We don't give birth to the terrorists n we don't even support them .. Terrorism is in our country as well we are also the victims of it .. Bombs blast in our country twice or thrice a month .. Our people bleed .. I've always being a supporter of India .. Though some people hate me for dat but according to me \"jagah buri nai hoti log bure hoty\" n we've negative people everywhere but it doesn't mean dat we should label a country as a terrorism house .. I support #Indopakfriendship n I support both the nations .. #peacelover✌ #peaceismycountry #peaceismyreligion ✌ @redheadwayfarer n thanks for supporting love n peace #🇵🇰🇮🇳❤", "wtffaryal": "Such a beautiful piece of literary art 💞.", "rinijohn17": "We share a same bond amongst the countries who tend to fight all the time...like two brothers or sisters who love and hate each other at some different point but in our countries case love has dissolved somewhere....lets all try to bring the love back... Thank you @redheadwayfarer for this inspiration🙏❤", "praddds": "Ur r so oswm..", "hania_imtiaz": "Happy Independence Day India #lovefrompakistan #hopeforloveinreturn", "joyhimanshu": "@redheadwayfarer our people die everyday coz of tht sick country. They give birth to terrorist. It's easy for u to write here happy independence day pakistan but imagine if unfortunately someone in ur family died in cheap war tactics by pakistan would u still be able to congratulate them. U r despo actor just doing it for cheap publicity and some followers. Shame on u. U don't want peace u want attention n u r getting it that's the irony of social media u lame shit 😡 now u and ur so called followers will come n bite me that un follow her and blah blah but go get a job girl 🖕", "sarikamrao": "Happy birthday* pak!", "huxain222": "I love this ❤", "i_namantated": "No matter how much u try di to spread some positive messages there are and always will be few ppl having problems with it simply because either they want to get noticed or they did nt understand what u actually tried to convey but it doesn't matter I really wanna thank you to guide me and many more like me into making of a country were stand for right and against what actually is wrong ur an Amazing person and a source of immense positivity hence ty so much for nt getting affected by some shit and always doing what's right ur the best saloni di... Loads of respect to uh @redheadwayfarer", "maddy_gupta22": "Happy independence day miss beautiful 👌💃", "tashabadsha": "@redheadwayfarer Saloni, this is beautiful. Not just how well crafted it is, but the general thought. More power to you. Keep writing! Happy Independence Day.", "sneha_salt": "Look alike @katrinakaif", "the_queenidhi": "@redheadwayfarer diii this is independence day right but did you watch the news...there is a gll 12-13 years old 8th clas student get reped in day at children park...she was just attending the pred....plzz write on it...nd guyzz plzz do msg mr.modi...... it hppnds tody...in police serurity.....at public place😑 nd the repist is not arrested yet!!😖😖 plzz dii write on it @redheadwayfarer 😖plx", "_e_s_r_a_572": "I said u look like kartina @redheadwayfarer 😀", "abhijeet_mahat0": "Happy Independence Day ! Di .... It's beautifully written and I too agree upon your views .... I mean why can't we all live a life full of peace ... Because of these some ruthless people everyone has to pay the price ..... Innocent people, our soldiers, children and women are being killed everyday 😢😢 .... And not just on our side but on their side also .... #keepspeadinglove #peaceofmind #keepinspiringus #loveyoudi 😄😘😘 @redheadwayfarer", "shaiii._.13": "This is beautiful! Feeling love for them, across the borders 💖 @sumi_hash @i.shireen", "aurbhaikiddaa": "@bollotararara yaaaas ❤", "mayank_no_where_is_now_here": "Great maam @redheadwayfarer Well done #keepitup", "sniper_sh00ter": "Rajneeti", "mr.chatur": "@redheadwayfarer get ready to be termed as anti national from so called bhakts or shall I say retards", "hathiparinda": "@akshaykapoooor", "shoobydooby__": "You look pretty in Indian attire. And bindi off course @redheadwayfarer 👌❤", "sarthi_parth": "Have some shame on wishing pakistan 😏😏", "rishikakash": "Great thoughts. Keep writing and inspiring people ❤", "gill_007": "Independence day ki photo Dali hai hass toh le 😡@redheadwayfarer", "kapildashanan": "@redheadwayfarer its your opinion only and perhaps you can grab some roles or publicity with this....Or perhaps u are just not aware of the facts and things.....Any reason is possible.....Just to clarify ur info a bit Pakistan got independence on 14 August 1947 so technically u r not correct.....", "shruti_____mishra": "💕 beautifully expressed💕..this world needs more people like u😇💕#respect💖 Happy Independence Day😇", "sandeepkumar9076": "Killer😘😘😘😍😍😍😍😘😘😘😘😘😍😍😍😍", "_thakurayan_": "What's wrong with her?? Totally mad", "saniyasheikh25": "❤️", "shrutiieeee": "So beautifully written!! @redheadwayfarer", "zaidi_durryyia": "Very well said!!!", "salrazack": "@_dis.girl.is.on.fire_ read", "arfiyyyaa": "@binnt_e_hawwa", "imabhilash_chaudhary": "Simply awsome actually not........its amazing @redheadwayfarer", "santy.mentalist": "Beautifully described the simple thing which we all needto understand", "_iamgrv": "Looking so beautiful👌", "the_invincible_fighter": "Do u even understand why we celebrate Independence day ??@redheadwayfarer We got free from british rule in 1947 but what is happening after that for our soldiers in J&K is same as what has happened to common people during british rule... Daily we hear news of our soldiers getting martyed , you have got the freedom but what about the soldiers protecting u from the country for who u wishing their happy Independence day ... You are talking about the air which we breathe is same ,the land we live in is same and blah blah ... See by this logic whole world is one and we Indians do believe in Vasudhaiva Kutumbakam but I always remember how many our soldiers have attained martydom since Independence and I will not tolerate their insult by seeing Indians celebrating their occasion (actually the real cause of fighting between the two nation is the same , the partition) and they are not going to stop it and lastly I m not spreading hate I m just saying that your post will do nothing good for Pakistani people nor their living standard gonna raise high nor the terrorism is going to end there ,we also think of peace and love but this by wishing them ,showing empathy not gonna solve the issues but will hurt the feeling of people who lost their dear ones fighting the terrorist send by the neighbour . Jai hind", "aamna_beg": "Beautifuly written! ❤", "gaurii_013": "This is beautiful ! 💛", "fatema_mustaf": "So true...loving yur caption @redheadwayfarer ...👌👌 I do wonder y ppl get so hyper when it comes to india Pakistan...let it be cricket match or anything..😓n I also feel tht no countries caste or religion make terrorist...@joyhimanshu", "snap_attack": "Technically speaking we were never \"one\"", "deepika_nandal_": "Just amazing ❤", "shereensji": "U exactly look like Katrina", "tushardhoble_": "I don't understand why shower so much of love in Pakistan every time 🤔", "thewickedmess": "This is the best thing I have ever read about India and Pakistan 💙", "jani_00xx": "Insha Allah !💚👌", "snehaqu12": "👌 very nice.......well the truth is people love to blame each other ....fr chahe koi small mistake ho ya big one,fr india kare ya pakistan , india me srf kashmir hi nahi h jaha pr violence h india k boht sare parts h jaha log ek dusre ko dekh takk nahi skte ..lekin hum log pakistan se itne obssessed h k hume har baat me pakistan dikhta ....😠", "simrananandd": "i respect you point but not in favour of considering Pakistan so dear because it was india it belongs to india but not india the people there neither respect india nor treat us with respect", "shiryasachdev": "You girl @redheadwayfarer across border,miles far is still an inspiration ❤lots of love from a Pakistani 💚", "makkhan_singh": "What about Bangladesh", "the_jahmed98": "A wonderful thought!", "i_asmazing": "Kudos to you, Saloni. I am not you, I don't live on your land, but I love your land too. Cause once a upon a time.. we were one! And Indeed, love has no boundaries, race, culture and religion. We all strike for peace and love. Sending you Love from across the 'man-made' border🇵🇰🇮🇳.", "the_anchita_maity": "I luv ur writings girl...happy independence day", "the_whimsical_thoughts": "This is one brilliant post of your..", "salmanquerashi": "Behtareen....🌏", "theunfamouspoet": "What an independent thought to read on this day! You nailed it! Let the Supreme love empower all the people divided by the line of illusion. @redheadwayfarer Happy Independence Day!", "sourabh_bhardwaj001": "Lukin beautiful", "poojaakhimani": "I too have a heart like yours, hopeful in a cage, which grows better and better as i read your page. ❤️ I love you woman 🔥💯", "abhishekdaal": "Looking like nargis fakri", "apoorva_bangur": "🙆✌👌🙌👏❤", "portraitofanage": "I love you 🌸 You're a flower. Keep blooming ✡ @redheadwayfarer", "ruhmeyaaa": "Am from Pakistan @redheadwayfarer u said fabolous thank you soo much spread love happy independence day 💙", "_meghhnaa": "@chandelier_30 Firstly what she wants to write about is her own choice and none of us have the right to tell her what she should and should not do. And secondly the things she writes about are things that most Indians shy away from talking about. She inspires us to have a voice and talk freely about things that concerns not only us personally but the whole country. Most people do not have the guts or the mindset to be able to do that. So instead of criticizing her take a chance at understanding the gravity of the things she writes about.", "superrapple": "Beautiful lines, feelings that deserve acceptance in hearts of people in both sides, feelings that people are afraid to speak of, all the hate the bloodshed any human would want to put a stop to, it's sad where we are as a society but I hope there would be day, I hope and believe there is light, these two sides are two ends of a tunnel, there's light on both the sides, we need to accept it and just walk towards it, amazingly written, so beautifully put into words. Amazing! ❤", "chauhan3c": "Beautiful 💟", "learnerdy": "So so beautifully written ❤", "maheen.ahmad": "Happy Independence Day from a Pakistani! I always wonder that same thing! We're all the same and we let the border and history come between us to ruin it all. Why can't Indians and Pakistanis love each other and be together. Hopefully one day 🙏🏻 Faith in humanity restored, thank you ❤️", "saniah_aziz": "Beautiful message . ❤", "kaverrri": "@samridhi_08 read this😍", "iamarunkhajuria": "You spoke of hearts of millions in such profound words.", "girlwith_noname": "Ur writings inspire me...thank u😊", "moon7lunar": "Jai Hind.... Lovely 💖", "mansikalantreee_": "Wow wow wow ❤💯", "ghazal_parveen": "I am from Pakistan and I really admire you ☺☺😇 happy independence day☺", "ayushii_ag01": "👍✌❤", "the_raghvan": "I love you redhead", "iam_ruuttuu": "Omg!!! The caption is so 💯💯🔥🔥", "imanxfatima": "Thank u for the support ♥♥♥ But why don't u say sth about Kashmiris?? The Indian Army is hurting them so badly plz say sth about them !!! Yes India is tha place where Our grand parents were born yes it is !!! But u remember How many Grandparents of ours were killed there??? How many girls succided their for the protection of there Respect ??? We are supporting u But when u will say all this than we will be one !!! Bit not now !!! We need justice ♥♥♥ @redheadwayfarer plz reply @redheadwayfarer", "tinyworldofmine": "U nailed it this tym let ur voice reach as many as it can ❤️", "kd_gooner": "U write all this just to seek attention and nothing else....", "ohkayzahra": "So when are you visiting Pakistan?? Love , love , love from Pakistan", "vishal_shrrma": "wow well said 👌👌👌👌 @redheadwayfarer", "nasreenkhan922": "Well said", "deepanjalidmishra": "Truely, people are same, feelings are same, whats different is the map we follow, the line created.. that set us apart @redheadwayfarer ❤❤❤", "rannvijay_prince__varun": "@redheadwayfarer So beautifully written 💯❤️", "lolxshna": "You are such an amazing woman. And the first Indian i came across today who wished Pakistan too. Stay strong and keep inspiring.", "mdr_survivaljourney": "Well said 😀😀", "sakshikingrani": "Best writing I've ever read regarding the 2 countries ❤❤", "yogesh_cybertron": "@redheadwayfarer you are such a mature writer, and truly influential person...I really admire your work, whatever you write against hypocrisy, Orthodox thinking kinda stuff... In my eyes you're real life example to prove Proverb like \" the pen is mightier than the sword\". I Love😘 your passion and positivity towards writings. For me you are a great human being than a writer than an actor.😍", "hrishika_35": "Wow! This is so true! Nicely written! This is a message the whole of India and Pakistan needs to see", "parvatimahiya": "@deepnagarkoti this is what i wanted to explain you. I love pakistan as i love india because we are same only diffrence is the border created by man. Read this article and you might understand what i have believed in.", "messaf_14": "Tell this to the ppl who called u antinationalists @abhishek_akaram_archana", "waalii_zaman": "Thnx🙏 aappy independence day too ..🙏🙏 most positive post 🙌 thnx again .. luv from pakistan 💚💚💚@redheadwayfarer", "ibombets": "That's so beautifully written. Love the whole rhyme bit in between. Love you. 💙 can't wait to see you!", "krguptaprateek": "Happy independence day but why you looking so sad", "_shrooteee_": "caption❤", "praneshmisal": "Well said @redheadwayfarer.. keep spreading ur thoughts.. love the way you see things!!", "zeybahaider": "❤❤❤❤❤❤", "pandeychitra": "One of the most beautiful things that i came across today!", "disha.chawda": "💜💜", "niyati_upadhyay": "Beautifully Written❤", "bollotararara": "@aurbhaikiddaa her captions are always so captivating ❤", "___sanyukta____": "Flawlessly written❤", "jayygoswami": "This is great what you wrote. I do follow your writings. And I love them because they are very inspiring in their own way! There may be many people out there judging you on what you write and stuffs. But Ukw it doesn't matter because you atleast take a step towards creating a better world. We all should just like you. ☺❤", "sonalii_thakurr": "Caotion...so good 👏👏", "thebrowngirlmusing": "It is indeed what love is 💕 such beauty in thot and words...", "play_boy240271": "Mam i deeply respect your thoughts ...i go through all your posts and have been an adamant follower..but mam if only. You would consider the the cruelty shown to my mother when she left Kashmir (im 17 ... And this is how recent and fresh the wound is for my mom) ...i in no way disregard your thoughts....and have you ever heard to the utter nonsense that flows from their mouth? Have you ever thought of why my grandfather had to be killed for protecting his own house? Im sorry mam i know this isn't personal and only about me ..the exudos me and the entire kashmiri pandit community had to do is never washable....the so im sorry but i will forever and ever hate those \"same people whos grandmother took birth here\"", "makeupgazaelle": "Luv such captions from u❤️❤️❤️ how soothingly u try spreading love npeace!!! Wish thr wr more lyk u🌹🌹", "sabmohmayeah": "This post is everything i feel, when i think of my family that's in Pakistan! I bet they feel the same. Beautifully written ❤", "eyluluylas": "Abi yuh bu kadar benzerlik olamaz", "pritiroy2002": "<3", "snehaaa_dey": "❤", "akashbhella": "Sir utte chunni jachdii,bebe labdi eh nuh jva tere vargiii", "kunal.bedi06": "best pic of yours kudiye ♥️", "aminaki_._._": "These are among the most touching words I have come across.. Spreading love in and across the borders, the most noble form of patriotism . Miss Saloni ,I have become your ardent follower and I await more of you to inspire me everyday. Lots of Love and good wishes from a fan.💕💕. @redheadwayfarer", "____auraarika____": "The way you beautifully potray your thoughts in your writing 👌 you and your writing, beautiful and flawless ❤️", "sumankumar9": "Coz its a mutual feeling come across some ppl only.. Majority are against .due to which our people fighting near borders.nywayz good thought😎", "shradha_rajpurohit": "@redheadwayfarer Amazing is a understatement 💞", "pavitra_balgi": "Happy independence day", "the_samuraipoet": "It is such a fad now a days to go n support the unconventional thought !! Let all be one , let us reform all the criminals,let Pakistan be friends ,sure ,have u diligently followed what has been going on to the friendly attempts made by our nation and how our soldiers are sacrificed because of the double faced policies.I am all there for the love for humanity but , there has to be a line or does the stern approach is limited to feminism .I hate having social altercations but isn't it fair to see both sides of the story .", "reeaaaa___": "❤", "peopleoftheindia": "👍", "ishi_rawat_": "😎😎😎", "biswas_saurav15": "i alway luv to read your caption they are jus wow and more important ..they are meaning full ❤ @redheadwayfarer", "soumyajohnr": "Word. Always thinking about the human beings across the border, and wishing all this hate from both ends would dissolve. How far we've come as a race, and yet how behind we've left our hearts! More power to you. Spread the love!", "saadhassanrafique": "Happy Independence Day to you too Saloni! Love from neighbours 😘", "gunjan._.07": "my best 😍😍", "kratikapandey0817": "@redheadwayfarer superb..this is one of those post that actually proves that today's youth can change the thought that creates a mentality..a mentality that has made a human with caged heart and soul..love u not for whay you are but actually for what you write..keep going red!", "iyaminii": "I love you Saloni. ❤", "mysterious_anwesha20": "Yeah true...", "sobiasyed111": "happy independence to India from pakistan ❤", "sonali_513": "This was beautiful. I love u @redheadwayfarer ❤", "ijyotisharma": "Happy Independence Day to you too... @redheadwayfarer", "nishhhivasnik": "Pakistan's Independence Day was yesterday not today", "emranaly": "Looking ravishing and elegant with the pose and words", "gautampreeti71": "awesome caption❤ but it should be \"borders\" instead of \"boarders\"!!", "srishti.parab": "A positive vibe after reading this. Thanks alot", "_sanya.m.farooqi_": "I love this! Happy Independence day, all the love from Pakistan ❤", "gauri_lp": "Andd bam, on point, once again! ❤", "saqlainkazi0205": "#Awesme Caption..👌👌❤", "aarushi_arya": "Wow u express ur words soo beautifully.. Wow❤❤ #salonianinspiration ❤❤", "festive_gifts": "Osm thought👌💯💯💯", "guyfromthesky7": "she looks like @himanisisodiya ❤", "preshika022": "Amazing!👏", "kajol_s_": "seriously I luv u more wid every post you upload respect man🌏🇮🇳🇵🇰", "nancy.__.goyal": "She mounts her thoughts so precisely ,even beautifully!", "harvvii": "Caption is damn beautiful!💝", "aakash_y7": "😩@redheadwayfarer", "angelaxrodrigues": "Amazingggggg ❤", "thedreamytale3": "That caption though ✌️💕", "aishwarylakhlanii": "Beautiful ❤️. Happy 70th Independence day to you. Miss. BadFeminist 😇", "i_anejahoney": "Happy independence day to all of us in both nations.. peace ❤", "__shreyapatel___": "Superb ❤", "k.a.n.a.v_": "Happy Indipendece Day❤❤❤ @redheadwayfarer", "shaadu_nawaz": "This was so beautiful 💖😊", "natasha_sharma_0201": "The perfect post of the day🙆🏻❤️", "devesh_tikare": "This one 👸👌👌👌👌👌👌👌👌", "rheaagrwal": "Happy independence day 🇮🇳", "thecutegirlintown": "💯💯💯", "ratan_nayak": "Nice good looking face jii 😊😊Happy independence Days & happy janmastmi", "theunfilteredsoul": "❤", "officialyash_215": "you are such a beautiful inspiration for our india... @redheadwayfarer a great soul ❤ lots of love from delhi 💟"}