{"akansha.chawla": "@kee_616 comments dekh, what we were discussing about feminism", "jaspreetsachdeva84": "I don't know by posting nude pictures of own support feminism..... How .......?...", "hafsaa_muhammed": "Are you not comfortable showing your own boobs and vagina? @redheadwayfarer", "oleksandr.litashov": "Creative", "azkaaqeel": "@maairimtiaz read this (2)", "raj_malikkk": "Itne bhaari gyaan ki koi zarurat nhi hai ! Billion 💵 ki textile industry kyu band karwana chahti ho tum bas yeh batao 😂😂😂", "amrit_singh73": "👌", "___vicky01___": "Report", "anxshkagaxtam": "Kaafi feminist😂... Agar isko feminist hona kehte h.. Toh mai nhi hu feminist 🙌", "prabhakar.r.9083": "😍", "tripti_madhur": "Love the way you keep your things up😊😊.....", "raj8718": "Ek dum lallantop🙏🙏🙏", "dubifl": "Be aware of the spikes...... Or drop those fruits", "sacarchetry": "Pura dikha giri hui aurat", "pruthvi4686": "Love u", "amprateek": "Paida hote hi gir gye the ya baad mein gire ho😒!?", "hasmeen_grover_": "I know there are alots of peeps saying the bullshit about you.. i just wanna say go. And do whatever you want its your body your choice.. no one has right on you.!❤ so you go gurl i'll always love you no matter what you do @redheadwayfarer ❤🥰🥰", "karan61995": "I wanna see u nude", "fahad.ali17": "very sexy and hot body my wish you remove pineables also from your hands then i will see your nipples also", "pb11rinku0007": "lo😱😱", "x.o.x.o_mcqueen": "slayyyy🙌", "abduljabbar7234._saude": "😗", "bhawsarprashant": "😍😍😍😍😍", "nainanananananana": "BF pure maze mein hai.", "thesameeroberoi": "You go girl😎👌🏻❤️", "govindjoshi_29": "Pineapple n watermelon playing hide n seek😉", "snortsumcoke": "Is that a pool on Ur right 👀", "ranu.3oct": "🔥🔥", "rubina_tumo": "I really really love you. I never comment on your post. I just like them as i see more articulate persons commending you and standing up for you every time. But this time i felt to convey my deepest gratitude of being one of the silver linings we have in the times when we see scores of women and men belittling and trampling the word Feminism. Most people probably see you as a radical feminist. But for me being radical doesn't necessarily means the one who has the raw courage of speaking the uncomfortably starch truths everytime, like you do. Feminism is an evolving ideology and a social process. Developed societies nowadays are talking about right to one's body (abortion), breast feeding etc. These liberties have already been under the domain of many societies, especially India. But here the right to one's body comes down to issues of sexual abuse, domestic abuse, moral policing, objectification and everyday sexism. It is a highly polarized issue which is interdimensional to many issues in the society, like economic strata, racism, casteism, religion etc. So we need to understand feminism may mean different for different people. But the basic underlying assumption is the liberty to choose to exist in one's own healthy space so as no one suffers from the toxic patriarchy. But the change will be gradual. It will take time. Societal institutions and ideology need to evolve and restructure through their own necessitated duration of time. But people like you are needed to highlight the backwardness of the process and the situation. Keep doing the excellent work. This stuff is way ahead of its times for the ignorant masses. Lots of love 🖤🖤", "himanshu_.7": "That vagina ❤", "sickflipofficial": "🙏🍍", "nikhil_dorlikar__": "@_the_men_in_silence_ comments pdh", "nikhil_bmd": "Hotiee", "pramod_chaudharyyyy": "Kya is photo ko samman se dekhega?", "gemini_irfaan": "Thats some real crazy creative dope sh*t..😍😍😍👌🏻", "shotgunjunior2266": "@zaviyar.baig2266", "soni_ishu": "I want to ask a few questions to you. First of all, does feminism only mean being topless to you? Ok I get it it's your choice to wear or be naked, and no one can have a say in that. But why do you keep posting pictures with complete/partial nudity and say I am fighting for equality. Feminism is a much elaborative topic than just being naked. Talk about education, equal rights to career, safety etc, but don't use your half naked pictures to promote it, as THEY ARE NOT GOING TO HELP AT ALL. PLEASE BE YOU, BUT STOP CALLING IT FEMINISM. And people who are gonna bash at me saying if you don't like her pictures why do you even see. So as an answer, I don't follow her. My Instagram better be blank than me being her follower. It's just her pictures keep popping up in my feed as some of my friends follow her.", "sm_estiaq": "U got some Publicity 👏👏👏 & also lost some followers", "nayan.dhun": "If your boobs and nipples are on par with your boyfriend or potential husband (i.e both are same) then kudos to you. Your baby will be so lucky being fed by 4 breasts. All problem solved. Now, men can feed babies too. Feminist be like biology ko maro lath. And by the way, I am not saying you to not roam naked. Do walk, sleep, eat naked. You will only create a history no one will cherish.", "peecee333": "The most unwanted picture of the day. She needs major schooling on feminism.", "siddharth221080": "😘", "_undefined_chapter_": "It's completely cool whatever you are doing....but please point out some actual problems happening.....only 20% of the of the total budget for women and child dev has been given and rest went to the official's pocket.....be a real feminist and write about this", "gooxse": "LOVE IT INSPIRATION ❤️😍🙌", "navdeepsinghj": "And sad part is people still take inspiration from these people", "manishrathod12": "🔥", "siyaraganesh": "Go naked and then label it as feminism \"be yourelf\" ...! U be naked .. y u wann world see naked...3/4 of followers are only here look at ur shitty naked pics.. not bcs u inspire ...🤣🤣 isse kuch inspiration nahi miltha hain... ! N u bluff so big big caption.. I only loved ur periods post.. n Rest all bulshit", "tllachenpa": "Wow both @redheadwayfarer and @ipoonampandey are doing great service to women.", "girls_cars_models": "Tatti", "ruzwald": "Haha wht the hell, I respect woman who go and work and do something but not the one who show their body and say it's their right, I mean wtf cause of you'll these indian peasants become fucking horny animals by seeing posts like this and then go and rape innocent girls, but you'll not understand this cause you'll r safe! #feminismsucks", "ayeshirinwtf": "People think they're entitled to censor someone else's body just because it arouses them, and it's ridiculous. It's as if you don't want to own up to the way their own body reacts. Idk why none of these extremely learned people won't go ahead and comment under the picture of a shirtless actor saying he is a prostitute or something.", "abhirajaich27": "It's hot baby!!🔥🔥😍", "nimishhha": "Loving you❤️", "hunk_azzi": "Itna lamba lesson Kaise lik the ho yaar. U had lot of time", "ravikum___": "Yaar Saloni ek baat kahu.. agar aap Free Nipple ko support karti ho to yaha insta par pics and captions se kya hoga?? Twitter permission deta hai kaisi bhi pic share karne ki so waha share kyu nahi karti aap Topless Uncensored pics agar aap isme comfortable ho to.. bcoz insta par ye sab share karne ke baad lagta hai ki aap ek \"Opporyunist and Running an Agenda\"..", "19rinakhan": "🔥🔥🔥😍😍", "ganeshsonawane652": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "charles_darwin001": "Show this to your family . Maybe your uncle would give you a visit at night", "coskunhama": "❤️", "i_am_lone_warrior": "🍍🍼 shake 😍", "the_hungry_dude": "The first step to become feminist is- Go Naked. Okay... I got it... Thank god none of my friends are this type of Feminist. 🙏", "ianrstephen33": "I love u so much . Because u are so thoughtful.🙌", "fuckyoumakeart66": "Men and women are different women can't compete with men in phisical work for example a women cant win in a combat sport against men no matter how strong she is men and women are built differently. Similarly in some things women are superior like bitching #fuckfeminism", "_rishabh_rd": "If we compare male nipples to female nipples and vagina to penis.. Just tellme one thing.. Is touching a men's chest a crime? No, right? Bt touching a female's chest is a crime. Just because From the old era.. Women's chest including breasts & nipples are considered as a private part for which Instagram also made a bann on showing it to stop obscenity, Please respect that. Respect the concept of private parts of out body. \"PUBLICALLY NANGA GHUMNA YA PICTURES UPLOAD KARNA FREEDOM YA FEMINISM NAHI.. CHUTIYAPANTI HAI\" (Don't Mind) (Read Twice, Think twice & then reply)", "love_shuve": "Kapde pehna karo zada khubsurat dikhti h ladki", "mahiimabajaj": "If she would have covered that layer of her skin with a bra, everyone would have found it SEXY. Yes, there’s no bra in there, yes it’s a part of her body, it’s her chest, it’s her breasts through which she’s gonna feed and empower her child. A woman who doesn’t care about it should be respected. I could never be so bold and brave to do it despite the fact that I don’t want that piece of cloth to trap my existence.More power to you @redheadwayfarer.", "vishalbharthi8060": "Loking so hot", "gagandeepkaurbedi": "What a velli you are sister ! I bet nobody reads the caption , it's wayyyyyyyyy too lengthy and insensible 🤣🤣🤣 I gave up after reading first 30 words 😂", "singhstapasta": "'obscene'?🤷🏽‍♂️.. or maybe its just indian 🙃society dictating women to suppress their choice/sexuality", "mradul_bansal": "Tum nahi sudhrogy", "shuvam1752": "@arikajaura @stonednibbi @shweta_sisodea @zo_kap_002 @kawaii_myra @1shanaya.oberoi @unfinished_mess @taniiissm @ashna_17 @the_untamed_spirit it's a request to all of u please dont give any reply to that guy sammal1188. The more u reply, the more he gets entertained. He comes here whenever Saloni post something", "carlover_007_": "Randi sali tere chlte hi ladkiyon ka rape hota hai", "the_untamed_spirit": "Dimaag naam ek ka ek chiz hota h @sammal1188 which you obviously have already proved that you don't have with your comments and replies.", "mdnaushad268": "I fuck your pussy❤️ and boobs", "gazalik": "Nice boobs", "samy_shokeen": "Yr isko bc koi please clothes do phele.", "princessss_priyanka": "Bhenchod", "amitaggarwal8": "Kuch kuch hota h", "dishaa_shah": "💯", "cunylyngus1": "Pinipple 🤣🤣🤣.. You rock lady.. Keep up the good work 🥂", "wasif8666": "Love the way you portray in camera... so sensuous and adorable....❤️❤️🔥🔥🔥❤️😘😘😘", "pooja_samundre": "@redheadwayfarer Yes i followed u, love ur thoughts.... But, i don't agree with this...!! Or may be we should first focus on \"our choice\" still there r many women who don't even have choice to eat, drink, work, or wear cloths by thier own choice....!!! So stop arguing about being topless this may be the last thing we should worried about thier r still some women who can't even breath by their own choice ....!!! So #whyineedfeminism Should be more about that and not about being fucking topless or being necked in public ...!!! Grow up🙏", "manoj_jani_2129": "Lovely", "sriyanka_r": "Hey @redheadwayfarer You've always been an inspiration to me and every girl out there. Just keep doing your work cause it makes a lot difference to us girls . Much Much Love ❤", "srshan24": "Nice pic bencho", "tez_693": "i will say it's about own life. everyone can do what they want accept don't harm others with anyother things, beauty will always beauty.. in every formet 😘😘😘", "abhihritwij1592": "Lovely❤️", "____arzoosaxena01821____": "Caption❤️❤️", "vitruvian_monk": "Someone give me those pineapples 😃", "artislove_923": "@redheadwayfarer follow her @miss_novinha_brasil suits u @redheadwayfarer", "aneri_rk": "What is your weight?", "thedimpleddamsel": "Caption 💯🙌🏻", "neh_bansal": "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "insane_dude666": "Main problem in India is that many women are not proactive in voicing their opinions. Women need to take more action rather than just harping about issues on internet. Before anybody blames me for being sexist, I want to clear one thing I am not. I am being realistic. As newton said every action(emphasis on word action) has equal & opposite reaction. Feminism for me is not about men vs women but giving women rights as they should have as equal human beings. Now I will quote MALCOLM X(great civil rights activist)here he said nobody can give you freedom, equality or justice. If you are man(in this case woman) enough you take it. Though I am part of this patriarchy I will fight with you ladies for your rights but at least you must start this fight instead of harping on social media. I will finish this comment with following quote: “FREEDOM CANNOT BE BESTOWED — IT MUST BE ACHIEVED.” Elbert Hubbard (American writer, publisher and artist)", "khaane_mey_kya_hai": "Your knee has a baby face 👼", "da_vi_dz": "Iska roz ka bakwaas hain yeh sab itna hi dam hai toh India mai topless ghumo logo ke saamne toh maanu aise chupke se kone mein top utarke post Karna aasan hai behenji asli mai karke dikhao itna hi dam hai toh lavde ka Baal😂😂😆👎madarchod ki bacchi", "halfticket": "Caption 🤗😍", "uyouu333": "ur sooo beautiful mam n i admire u a lot @redheadwayfarer", "khushjeenu": "Not able to be successful in acting and directing! Meet ms. @redheadwayfarer ( SALONI CHOPRA) she would teach you how to cover everything and wrap it up in so called feminism. Do what she actually wanted to do ( being popular) not by hard work or anything. But just posting some ugly nudes and writing big paragraphs and name tagging it as feminism. Nobody has actually really cared that she travels across the world and where does all the money come from. Getting haircut and coloured and the lip fillers is actually equal to all the body surgeries which the so called Kardashian's and Victoria secret's model go throw( only mentioning them because she does compare them with being natural)", "chandanmoms_boy": "❤️❤️❤️Sexy", "raaa_heeee": "@redheadwayfarer You are holding ananaas....but many people seeing the photo will say satyanass❤️", "pavintheran3795": "😍", "women_with_hormones": "You are so inspiring ❤️🌸", "daredevil0036": "U Have PINEAPPLE ' S🍍🍍 .. I Have BANANA🍌.. Remove U R PANTIES We Shall FUN🐎", "om_ishaaa": "Thul thula", "khurana_asmita": "I love you girl💋😍🔥🔥", "bablu.13": "Suck boobs", "rutuja_dalvi0819": "More power to you 🔥❤", "priyanka_dey_online": "femiñism means promoting girls education,making them independent,not posting nude photos.. u stupid🙄", "ashlinepvt": "❤️❤️❤️", "itsmeeimran": "🔥", "reni_rog": "Love that baby face on your knee cap🔥", "im_y_o_g_i_": "Write fucking 100 words or woh sara chutiya gayan dena h vella ....... Hungry for attention ...", "sammyr_512": "So brave❤️", "nitin_raj_kaushal": "If comfortable with your nudity then why u hiding with same props.???????????", "simransodhi_": "👏👏👏👏👏", "iam.krishhh": "India don't need neither feminist nor Western concept of feminism. it is in Indian culture that we worships women deities and to give respect to woman. Indian women are strong like jhansi laxmi, rudhramadevi💪. There is no need to go nude in the name of feminism 🤓. If u still want to show feminism, please show that in saudi Arabia. 🤗", "radheydutta": "Meet me Delhi", "amitratewal": "I want to tell you one thing please make good figure and then show it....", "caffeinbalism": "Love it", "anushtha_jha": "Thank you for being such a bawse lady❤️❤️", "neeladhikarimusic": "Salut . Bon courage!", "rakeshroy276": "Nangi ho ja Puri sali", "ranajikabeta": "See the last status of @redheadwayfarer . This is all what Indian want. This kind of ethnicity and tradition.", "jbrnkhn": "Are you indian? @redheadwayfarer", "shadik_icon": "❤️", "lookgoodflgood": "I am not comfortable going topless and posting it on social media but I also won't question diss a woman who does that. Its her choice . Her space. What I don't understand is the band of boys commenting on each post of yours that feminism women empowerment is not this , and not that. Like who are You guys to even tell what female empowerment is ?? Its a female thing na , female empowerment as the word goes ? Then please mind your own business. The message of female empowerment given by @redheadwayfarer is very well proved that how much it is needed in the comments section where these boys try to censor the voice of a woman. Dear Boys Let her be whatever. If it makes you aroused , deal with it in your own way without harming or disturbing the other person.", "_unknown_0908": "Feminism sucks", "syedashafquatwasti": "Wow..well said ❤️❤❤️ @redheadwayfarer", "md_imtiaz_hussain786": "Wow.....replaced your boobs with pineapples... great....both are juicy & good to suck", "rajachanchal": "Love it", "manishehzad": "Is this the same girl who acused sajid khan for sexual harrasment lolz", "aree.zz": "Moreeee powerrr!!!! 🔥❤️", "anuneysarwal": "@mopsydhiman with uuu💋", "adnankhan198711": "🔥🔥", "shweta101118": "Woowww pineapple to hide melons 💕", "kukku755": "🔥", "riccha.jain": "Nice click 🥂", "karan_lov": "Full sexy", "damn.ananya": "Absolute QUEEN❤️", "kingshuk_sen2002": "😘🌹♥️🌹😘", "iamrahultomar": "@ankita.a.dhawan feminism 👌", "anisha.mehta.savla": "Although im with saloni in most of her posts, this is my thought process as a woman. I feel, woman boobs cant be compared to the male boobs, just cos they are different. Its a private part of women (atleast i consider my boobs to be my private part) just like penis and vagina is. If a man posts a pic of his penis obviously there will be an outrage so men dont roam naked too! Male chest is flat (and male boobs arnt attractive). Female chest is arousing (even to lesbians) so i dont know why she compares the two all the time. Feminism is about equality of both genders, so topics like wage disparity or sexual oppression etc are fine but this- i dont get it. If anyone would like to enlighten me , im all ears. Not for an argument , i would seriously like to know!", "its_vish_rajput": "Amazing boobs...", "iamarnabphukan": "😘😘😘😘", "prakash34445": "I wanna those pineapple🍍🍍", "maitriimaru": "🙌🙌🙌", "shww.ata": "I can't tell you how much you inspire me🙌🙌🙌🙌❤❤", "har_i.s.h": "🌹😍😍😘", "gayathri___devi": "❤❤❤", "clumzieeee": "❤️", "aaqil.kagdi": "Feminism ke nam pr Apne ap ko nude kr rahe hai @redheadwayfarer ya thoda .99% ka lehaz kr lai te y to be nude can you answer it pls !! Aj kl Instagram pr trend hai kapde utar nai ka or is ke pas kuch kam nai raha To apne followers bada rahe hai or ladkeyo ka demag khale kr rahe hai 🙈", "amulya_jain": "A great step, you surely are really inspiring for all of us. ♥️", "amitbasoya": "Keep it up", "the_princely_chic": "Wow that not ugly🤣🤣", "sancha_sancha": "And pineapple is the best ✨", "rajugowda.r": "Sexy heart❤️❤️❤️❤️❤️👌👌👌👌😍😍😍💋💋", "puja09maity": "Fearless women ❤", "san5dip": "R they juicy ?? 😂", "sach316insider": "I love pineapples🍍🍍🔥🔥😘😘💋💋💓😍😍😊😊🙌🙌", "indian566": "💋", "ronty15": "thank you for writing this absolutely unnecessary piece of information while using a nude photo, because of the interaction this will generate! This girl thinks spreading 'awareness' about feminism among her followers is how feminism should be achieved! She and her followers should be allowed to do whatever the hell they want, because hey, Feminism! The fact that she makes zero efforts to reach out to the real women who need feminism, like the ones in the villages of haryana, who think rape happens because girls are at fault, shows how much she actually cares about feminism. This woman is nothing but a selfish hypocrite who just knows how to make money off instagram. Hypocrite.", "hitesh.koli.374": "What is so inspiring about this post that people are saying", "sonalv3": "Honestly. People need to understand that this is our biological body. We didn't create it for attention. That is god made. And being comfortable in our biology is empowerment yes. It's the EMPOWERMENT OF OUR OWN SELF WHICH IS ALWAYS DENIED TO US!", "anukshabharat": "🙌🙌🙌🙌🔥", "charvirathod": "She can post whatever she wants. People talking about how she can educate without posting a topless picture can either grow up or shut the fuck up. Thank you.", "payal_0199": "Why are some people ranting about that.. why don't u do something for the malnourished children or uneducated girls or in short whatever is wrong with this country.. she is not the govt. She's just a woman comfortable in HER skin sharing HER thoughts on HER social media account. I wonder if all the over smart people start asking this ques to real govt and pay attention to their work, the country would be in much safer hands. Period.", "indranilsengupta09": "@redheadwayfarer You are definitely created by God..you are definitely definition of beauty .... every inch of your body has been perfectly created by God... majestic beauty.... stunning face.. God has really taken a lot of time to send u as angel..u r face of happiness", "mr._prabal_yadav": "Sexy", "gupta.souhard": "Koi kaam nhi h kya iske pass aur iske like karne walo ke pass..kya inspiration milti hbis se bhagwan hi janae ye aur iske dans😂🤣wo ladkiyan jyada fans h jo har cheez spcly nudity ko ceminism se coat karti h..yr tm bina kapdo ke ghumo hume kya..but har waqt wahi chutiyapa..matlab hadd h yr kuch b..meri fuse ho jati h un ladkiyon pe jo ye samajti h ye ki wo hatlr waqt torture hobrahi h aur ye sab kr wo womrn empowerment ko endorse kar rahi h😂🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "1shanaya.oberoi": "You go girl !!", "mopsydhiman": "@anuneysarwal 😁😁", "iam_harinandan": "Goodmove ....atleast after her effort woman can roam topless without fear 😎😂😂", "atuls6220": "❤🌊🌊🌊👙🌻🌻🌻🌻🌻🌻🌻🌻🦂🌻🌻🦂🆒🌈🏊", "preity24malhotra": "You gypsy soul😘💕💕💕💕💕😘😍", "isheetazzzzz": "Yas queen!🙌", "tazeen141": "👏👏👏👏Inspired u", "premkumar179560": "😍😘💐", "z.naqvi": "HOW DO YOU DO THAT 🔥🔥🔥🔥🔥 UFF!", "babeliciousss": "Caption😍🔥"}