{"zarinhan__1": "Hate my boobies because they are fckn small @redheadwayfarer", "vasudhatheburpeechick": "I am not fond of my thighs but I love my abs that I worked for @redheadwayfarer , thighs because I think that skinny jeans don't look.good on me and abs because It makes me feel strong", "ankita.dutta_": "Hate my thighs they are heavy.... And i love my ass... I think i hv got a nice one ☝", "tanisha_saxena07": "Wow😍", "ankitasen_8": "hate my tummy....too loose n fat😔😔😔love my face... always smiling😊😊😊", "_fitandfeminist_": "People do always find a way or the other to call me fat or bodyshame me even when they know i am stronger than them. I think i am fine the way i am and i love everything about my body. And fuck the people who always find a way to bodyshame me 🙄😅", "zig_01zag_tx20": "I hate my legs...they are so thick and fat...I feel ashamed about it..but I love my eyebrows and my side profile", "swatilekha_roy": "I love my eyes, becoz it has something different colour and sometimes people ask me if im wearing a lens or not. Any way i love it. I hate my tummy 😂😂😂 lot of fat in there, wanna do some exercise then there it comes again \"lazy\"", "capturedbyisrar": "Beautiful👏😍♥️♥️", "akhila.shastry": "I hate my arms they are like flabs when I want to wear sleeveless.", "wordsnapsandcheese": "Dear girls, I read each and every comment. I saw your account and pictures of those who were public. Even though you pointed your flaws I couldn't notice them. You are so fucking perfect", "pranay.james": "Well I hate my tummy it's overgrown bcz of the delicious home made food yet it's grown 😅😅 mam", "__mukku_____": "I hate my chest n arm prt becz its full of strechmrks looks wierd😣😔N i love my lips bcz its big n i love big lips n pinky😜😍", "astharamwala": "Idk but i hate my body because its not in shape!..tho i love my eyes💗", "anaaravantiii": "I used to hate almost every part of me as a teen. My nose, my body, but not anymore. I've an aquiline nose and that sounds poetic to me. I love my wild, wavy hair. I love my petite frame. I love the way my voice soothes people. I love every part, every aspect of me.", "_thatbrowngirl._": "I love my fingers, they are long and beautiful. I don't hate any body part but yes I've started disliking my lower lips.", "siddharth221080": "Love 😘", "munnabach": "🔥🔥🔥", "saurabhdahale": "Winsome", "killerrey___": "👄😚🙄😁👄", "rishi.jha.777": "Looking so pretty ❤️❤️", "kdmani7117_call_me_kd": "Love you", "kumavatshekhar": "Those stupid synthetic lips 😢", "vanshikadance": "My belly because it's gaining fat day by day and i hate it.....", "anam_husain05": "Omg just realised I don't hate any part of my body now, with my last bf I was really shy of my stretch marks but rn I am in such a positive mental space. I am so glad you asked @redheadwayfarer , thank you! 💛", "broke_foodie18": "I love my brain because it gives me the capability to think and act practical. It prevents me from getting hurt and it prevents me from hurting others . I would say, I hate my fingers because they are too small and weird and the fingernails are weird too.", "wanderlust.nishu": "Well I dnt hate any part of ma body...m loving it the way it is.but I love ma eyes more thn ma other body parts...they r deep...expressive...they are the best reflection of me....I jss love myself!😊", "into.my.wardrobe": "I hate the fact that I am underweight meaning I look like an 8 year old although I'm 18. I actually pretty much looove myself but everyone makes it a necessary to point it out and tell me I need to gain weight. But it's not really in my hands cause I do eat properly and well I guess I simultaneously hate it and love it at the same time. I love it for myself but from others' perspective I think I need to look more bigger? So that I don't hear their taunts", "sarikamrao": "2-my breasts❤️", "maybe.dharti": "I love my fingers. Cause they're tall and slender. And I hate my face because of the constant acne that it had.", "itakepictures_____": "I hate my smile because my teeths are crooked. I love my hand, they are long.", "saraswat_17": "I hate my skin - hyperpigmentation issues, extremely sensitive, extremely hairy, vitiligo..... I love my eyes( more so my lashes) and lips..", "ramboo_36d": "Im cumming", "vidushi25": "Hate my back...because i think its too dark to show...n love my eyes because they are wide n bright.", "sayed.jaaved.5": "I hate my dick because it's cum very fast I love my chest shape because it's looks good trust me", "vijeta__jogu": "Hate my face got i've got pimples and marks and pores and what not and seeing people with beautiful clear skin kills me inside makes me feel like a crap.", "belina_30": "I don't hate anything about my body, just hate pimples though. But yeah that too they come and go.😜 But honestly, I love my body as it is and I flaunt it very confidently!❤️", "ritika_sodhani": "I honestly don't hate any part of my body. And love my Cellulites 💜", "karishmaroy88": "I Dnt hate any part of my body, I love everything", "tejaswini__bakshi": "I hate my hair coz they are short and i have been bullied for my short hair and I love having short hair but at the same time i hate them coz people have laughed at me and also my mom wants me to have long hair 😔😔😔😔😔😔😔", "vidyajain207": "I hate my thighs coz they have lots of stretch marks and are too fat and I love my hair coz they r long n brown", "the.dimpled.smile": "I hate my arms because they are too heavy..😪 and I love my cheeks because I have a dimple❤️", "cskngp": "💋💋💋💋💋💋💋💋💋💋", "um_itspvt": "I have two moods. 1. To not care about my looks and accept the way I’m. 2. But other days it’s just opposite. I don’t like myself at all. My face’s skin is prone to acne,my breast,nose,smile doesn’t appeal to look beautiful. I just don’t like myself and other days I don’t even look at the mirror or take pictures because That makes me feel ugly and makes me sad about it.", "abhijeet_nishad": "I hate my nose because I get angry to fast", "snazzy_psyche": "👌🏻Wowww ❤️❤️", "mrittikabae": "I hate my face,cause I’ve a lot of acne and spots 💔 and I love my waist,cause I have a very tiny one 😂❤️", "divyamehtani20": "Hate nothing about my body and love every bit of it 💃 and hate is a really strong word", "chachakittay": "I hate my knees, elbows and underarms because i feel like they're so dark. I love my ass because gosh it's so cute and also love my collarbones and my hands❤️", "ankitachoudhury8": "I hate my thighs coz they have stretch marks in it n also coz they make me look fat. ....I love my lips coz they are perfect n I've received compliments on them.", "kunal6969696969": "Hate my hair tough to make good styles with em", "bruchita226": "I don't like my teeths .and I like my lips", "shrutni": "Hate my thighs..as it forms 50% body weight..all the body is fine except them", "pandathinksofficial": "I dont like my hair and arms, thighs. I love my face.", "very_seelie_queen": "Eyes...coz I'm hypermyopic. I'm nearly blind. I have to use contacts wen I step out my house or else I look like a owl with specs on.", "manya_kaushik": "Used to hate alot of things about me earlier. Thought my arms were too flabby because a few friends pointed that out when I wore sleeveless tops, I actually stopped wearing my favourite tops for 4 years. I used to hate my chin dimple and never appreciated it as a feature that I got from my dad. I love everything about myself now, i am trying to love me hands that look like a 6 grade boy's.. trying to make them pretty for myself by taking care of the", "appy_roxx98": "Wow... I mean may be 3 or so years ago I would have a long list of what I hate but, honestly right now I really love every part of my body. I do think if some other features were there it would be better but, there's nothing I really hate. (._. )", "_vijju2610_": "Ewwwwww", "nileshpranil": "🔥🔥🔥🔥🔥👌", "mis_chief_managed": "The only thing I dislike about my body is my height. I wish I was taller! Rest I love myself a lotttt! :D", "shruti.aisha": "Hate my thighs and my double chin ..I just don't feel pretty ... Love my back because it's smooth and spotless ...wow I just heard myself say this and it sounds so stupid", "dikshajudha_": "i hate my physique bacause i'm waaayyy tooo skinny. i feel bad whenever i click a full body picture and whenever i wear skinny jeans and T-shirts...... i love all my beauty spots bacause i think they are very much attractive and they bring the best out of me. :)", "sh3rry666": "👌🤘🔥", "kanikasharma2809": "And I love my buttocks...they are the smallest and the firmest part of my body...naturally toned ...", "shreya.tewari____": "Hate my hair. Always frizzy. Love my hands. They're just very pretty", "fish.arrows.arent.fishy": "I hate... idk my entire body. It's too short and fat...too many stretchmarks.... but I guess I love my hair it's very frizzy and thick", "aditimusiclove": "Am I at a really good place in life if I say I don't hate anything about my body? I love every little detail about myself!", "rairatnesh": "I dnt like my face , cause it is too small :)", "mehakanandd": "Hate my teeth- coz I have bunny 🦷 and love my lips- They are really 👄 as i always want!❤️", "ricky51601": "Hot", "_sashhhhhhh": "I hate my thighs cause they have stretch marks all over them. Also that’s the reason y I have started liking them now❤️", "noo_more_liies": "I hate my face. It's a baby's! I feel like a woman from inside but the strangers treat me like a girl of only sixteen. Irony is, what I mostly love about my body is my face only. I always succeed in looking younger, effortlessly while folks of my age inquire about my secret and they sigh a little sadly when I tell em' it's my genetics! THANK YOU for putting up the question! I feel a little at ease, after getting things out of my chest. 💕", "komalkokojha": "I hate my calf muscles.. There's excess fat deposited.. And I love my waist.. Cause it has the perfect shape and curve... ❤️❤️", "miley12317": "Well i would say i used to hate maybe every part of me but now I am learning to preach self love so I resist to hate any part of my body. Because it has been my home from the very beginning and it supported me.", "iaqua13": "I hate my stomach. Because of that I feel I don’t look good or beautiful. I love my eyes the most cause they are very expressive ❤️", "sumanras2307": "Why in India feminism is all about dress...... Why not they don't understand the things that it should be for helping those girls who are poor enough to read, dress, or in many things.......This is India not European countries or American countries..........Aperson need time to change his mind regarding western dressing sense.....You can't told them to change their mind over night. Do whatever the other countries are doing in developing themselves and accept the pros not cons. This is actually my opinion and if somebody get any kind of harassment then I'm sorry....", "sad__soul9": "will you fix it sister?", "funnnani": "I hate my butts and I love my hands", "wendymariieee": "I hate my cheeks, I think they're too big and I love my feet, they are like \"connected\" to my emotions. If that makes any sense 😂💜", "shwetapadhy": "I basically hate my whole body because it's bulky and full of marks. But I love my lips because I think they look good on me.", "_justwingit_15": "I love my eyes because it's brown and it's different from other and it's beautiful. Also, I love my calf muscle they are very good in shape and makes me feel oddly strong.", "somyagupta21_": "I hate my thigh fat. I love my face in the morning. It's fresh. Only hour i feel beautiful.", "_abelisaurus_": "Hate my elbows cuz they're always ashy. Love my eyes because they are blacker than the blackhole lmao.", "maulanahaffizji": "(हर समस्या का समाधान घर बैठे फोन पर कराएं) #Contact/+91-9166982907 #Website-#Wwwmaulanahaffizjicom #E-mail-maulanahaffizji@gmail.com 🌙️Only one call can change ur life🌙️ 👫love marriage specialist ❤love problem solution 💀black magic removal 💇vashikaran specialist 👪 husband wife problem solution 👫 love back astrology 🙅enemey problem solution 💑divorce problem solution 📿+91-9166982907🇮🇳", "gajala_parveen": "❤️", "simranbakshi1": "I think I used to hate my body because of my weight. But I guess my the last 6 months I have started focusing on my body more and I have realised that there is absolutely nothing that I can do to get immediate effect. Everything takes time. Even losing weight will take time. But one thing that I have faced a lot is the constant unwanted concern of people about my weight. This makes my confidence take a strong dive.", "adityanarayan96": "How dare you promote feminism with no Boobs picture.", "bhumikabharadwaz": "I love every inch of my body and all credit goes to you 🌸♥️", "nidhilohchab": "I thought about it but surprisingly I hate nothing about my body, I love everything about it. #selflove #gratitudeisthebestattitude", "eshwar.s.bujurke": "U LOOKING PRETTY CUUUUTE PIC 💕💕💕💕", "mehaktyagi__": "Hate my nose. Love my whole body", "nikita.bairwa": "I hate my nose cause it's tiny. And love my hands cause they're cute", "hold_that_string": "I hate my tummy,its too bulgy...i love my tummy,as it made my baby #paashi 😊", "miss_messyhead_": "Hate my face skin bcoz its too oily... And pimple friendly and changes color like chameleon.😵😵😵.... Love my hands and legs and its skin bcoz its the most softest from anyone I ever met😍😍😍", "anupawar": "Hate my lower belly. But it also allowed me to eat all kinds of crap for last 10 years. Sooo mixed feelings. And i guess i love rest of my body.", "sahicorn": "I hate stretch marks because they remind me that I didn't give my stomach enough food.", "shernii_2019": "I love my whole body i love myself the way i am. I don't hate anything about me💕", "_slutforchocolate": "I Don't hate no part of my body. ❤️ somedays I don't like my cheeks Due to pimples but I never hate.", "tamang_sarala": "Hate my belly cause they’re fats and fats Love my boo** cause they’re too perfect 😁", "warriorwithafeebleheart": "Hate my arms because they are too broad and i can't wear anything other than 3/4th sleeves, i love my eyes, i think they are the most attractive element of my body", "snuffy_puffy": "So i love every part of my body and being honest i learned to love it from you. This is my body and if i hate it then who's gonna love it.... Thank u @redheadwayfarer", "garimasingh_21": "I don't like my body at all. I have scars all over my body which makes me conscious at every situation and gives me no confidence. I don't know when i would be able to accept my flaws.", "sudeshnaah": "I love my nose...it small and I find it cute. I love my eyes too...looks like mango leaves. I hate my hands,i have the same skin condition as yours,and they become very dry ,scaly and look like dwarf dried carrots.", "itssme_sony": "Actually , I have an imperfect body, but still I love it as it is .❤️", "mysterious_anwesha20": "I love my body except my legs. I love my eyes the most because people say that your eyes are the mirror of your soul and I always get compliments for my eyes that they are pretty and deep and they have that sense of innocence in them. My lashes are quite big and I am genuinely in love with my natural curly hairs and those deep eyes😍", "shinchanshinchan_pyara_pyaraa": "i wanna be ur lipstick eraser😘😘", "_be_baak": "I hate my face type because of double chin as I have been craving for a perfect jawline from 2000000 years😶and I love my breasts and cleavage😅", "suncradledbynight": "I hate hate my belly fat but I love my clear skin and the way my eyes light up when I smile♥️", "telugu_agrihorti_memes": "That skin😘😍😍😍", "original_jamishness": "Don't really like my skin, NOT the colour, I have acne, I DON'T like that. I also don't like my toes too much, they're kinda weird. I LOVE everything else! #LearningToLoveMyself #SelfLove #BeTheChange #PositiveVibesOnly ✌🏽 I love this!", "_snehastagram_": "My tummy! It's gol-matol! I don't particularly 'hate' it, but sometimes I'm like - \"why can't it be a little less gol-matol?!\" I love my hips and legs though! I'm a healthy girl, and I don't really have thigh gap (which apparently is a 'thing'!).. but I think I like the way my hips and legs are. Strong-built and sexy!", "rathodkishor710": "Very beautiful", "daredevil0036": "I hate My Tummy👎 .. But My🍌🍒👍 .. FCUK", "mysteriane7866": "I hate my nose because it is somewhere dispositioned and I like my hand because it somewhere made me feel like a witch and I love that @redheadwayfarer", "meharrrpvt": "Also, it'd be good if I'd toned legs & stomach. :/", "starcyspark": "I love my eyes as they have beautiful shape and I hate my skin colour as i am dark in colour", "aadilicious_": "Hate my hips cause of stretch marks( ik it's Normal maybe I just have to accept myself yet)", "erineneema10": "😍😍😍😍", "odditti": "Hate my belly. Love my clavicles. Hate my belly because I put on weight there first and none of my pants fit. Love my clavicles because it gives an illusion of feeling sexy no matter how \"fat\" I feel that day.", "blacketblues": "I love every part of my body. There is nothing I hate. It's not perfect body but who has it? I have my imperfections and they don't bother me. I love them as much as I love my perfections.", "voguishtraveller": "I just love myself ❤", "ananya6023": "I hate my shoulders and rear part of my arms(idk the word) because my shoulders are very wide and my arms are huge", "rheamakwana": "Hmmm.... I hate my butt, coz its just too flat from the side....I love my eyes and my lips they are my best features", "yogitamlk": "I hate my nose because it's very thick 😣😣 I love my hair or eyes", "asthaverma318": "I hate my hips and thighs , have stretch marks and ingrown hair , i love my eyes , because i see all the pain I've felt in them reflecting back at me", "_.fallen__angel_": "I hate my stomach because there's too much fat. I love my hair because fluffe", "draaishaansari": "💖", "pankajcr7": "Love Handles....it ruins the look of my otherwise perfect body.", "savlajuhi777": "I love my hairs bcoz is the plus point in my overlook I hate my tummy right now bcoz it is fat and I try many time to loose that extra weight and it's remembers me always I wear new clothes", "iamsaneyea": "I don't particularly hate anything about my body , yes I'm a fat but I don't have any problem cause I'm comfortable in it. And I love my hands the most! 😚🙌", "procrastinatorbymood": "I think hate would be a strong word...but I wish I had flatter tummy with no stretch marks and I love my nose it's so fricking straight and sharp in shape", "charmingly10": "I absolutely my shoulders they make me feel like I'm to stuck to stringent and I can look at my self and feel soft about myself. I love wow this is really hard but I love my jawline I think I like the curve it holds and how it's kind of the foundation of your face", "kalpana_rajendran": "@redheadwayfarer Hate my tummy. Cuz I'm lean everywhere else.. I'm not used to it. Most of my clothes are getting tight around the tummy area. Its just my body looking disproportionate. And I hate it. I love my legs :) Because they make me look tall. And I like tall :)", "shahiwagisha": "Hate my thighs..they r too big.", "heyprabhu_": "I hate my legs because one of my leg is thinner than the other and I have really weird feet, like really weird. And I love my lips and eyes🌸", "sakshi.o_o": "Hate my eyebrows because i think they are too thin and light, love my eyes and cheekbones because they are nice i think", "uvashree_mahadevan": "I love my lips and my legs. Because as stereotypical as it sounds, I think they fit the conventional beauty standards. Pink lips and long legs. And I dislike my face because of all the acne scars I have. I am learning to love them and embrace them. It's still a work in progress. 😌", "thedramaticdiva": "I hate my arms because they’re abnormally fat as compared to my body and I love my eyebrows because Theyr really shaped", "prekshabardia03": "Hate my nose , cuz i think its too huge for my face . Love my legs they are long , flexible and super strong", "meeraumenon": "The part I hate the most is legs as I am a disabled from birth n I limp when I walk...I love my loose tummy as I just gave birth to a beautiful angel ,3months back💓", "suhaanaasuffer": "I love my breasts and legs the most because they're beautiful. I dislike the lack of gap between my thighs because they rub together and the rashes hurt. I don't dislike any part of my body, can't think of anything I hate.", "ashima.4": "@redheadwayfarer thank you for asking these questions that make us think why we hate or love something about ourselves. Almost all our reservations for our bodies stem from society's idea of how women's bodies should be. The reason we hate our legs, stomach or arms is because they don't fit the society's ideal and something that doesn't fit that ideal isn't acceptable. Beauty has always been a social construct but having said that, I also face difficulty detaching myself from that construct. If someone compliments me for some feature, I naturally feel happy about it but at the same time my self concept becomes increasingly dependent on outside forces, particularly on society's ideas of beauty, all male driven. There were parts in my body too that I didn't particularly like but have come to love them eventually except for my shoulders which have scars owing to an injury. I struggle everyday, like any other woman, trying to teach myself some self-love. In a society, where a woman's appearance is still the most important aspect of her being, practicing self love and acceptance is not easy. As someone trying to navigate her way through acceptance, I would love to know how you practice self love, if at all, or how has your journey been with acceptance.", "_.the.drifter": "Hmm...i love my hair.. its straight as a stick... Easy to manage... Silky smooth so yea i love my hair... I hate.... 😅😅 Almost everything else? I am so tiny even at 21 ppl ask if i am 12. And i am dark skinned ik i shudnt be bleh abt it ik it but wen ppl say pretty all around i feel \"d left out\". And my acne prone face and allergy affected legs🤣 looks like i have included all myself. I do love me for my personality or i am learning to thanks to all u and ppl like u's pep talk and the million books i read but physically its hard trying to be happy in this skin i guess", "sej_fangrl": "i hate my pimples as they can't just stop coming as a teenage I'm confident abt myself but peer pressure and ppl sayings sometyms bother me .......i just love everything abt me each body part is mine and i adore everything abt myself dere were tyms when ppl said hv u seen ur face ,u looks lyk monkey with wired n croocked teeth .......when i shared this with my parents they were devastated n said me don't worry but i never felt sad a bit of it cuz dose ppl dont own my body its mine .... totally mine......n dere were boys who said why cant u wax ur legs n hands i just said i can't come out as such why so......do u keep check on the hair growth of ur gf,sister or mother this society is way too developed but we lack in this thing when we hv to support other .........as myself hv been bullied in skl a lot but nothing bothers me now ........much love to you @redheadwayfarer ♥️♥️🙏🙏🙏🙏", "braheja6": "I have grey hair, long nose, dark facial hair, chubby biceps, fat tummy and fucking fat thighs. I still love myself. ❤️ Pure, absolute love for my vessel. I almost forgot, bloody dark elbows and knees. #recentlyfoundlove", "anuktamishra": "Surprisingly I don't hate any part of my body. Fat, with marks, weird - but it's mine and I love what is mine😊", "i.shaona_": "I hate my waists and knees because I have stretch marks.. 😭😭This makes me feel weird if I wear shorts. I love my hands as they are quite slender and my hair and nails as they are quite long!💕", "vandana2707": "I hate how I have a huge tummy, because it doesn't let me wear the kind of crop tops I would love to wear. I love my teeth and hair because they are in perfect shape and compliments me.", "thebongbaeeeee": "I love my hair! It's naturally shiny and straight. So I don't do much style with it, just keep it open! No hardwork on looking good🤣 I don't hate but I don't like my feet it's weirdly flat. Anyway it doesn't bother me much. So I am quite cool about whatever I have.", "misssssssssshty": "😍😍😍 Beauty", "jig.eeee": "i hate my fingers they're super crooked, and i hate my nose its too big, Although love my neck and my body structure you see I'm kinda tall.", "jain9naina": "I dont like my belly part because its too much nd i wanna loose that, may be someday i will sure do. I love every bit of my upper body nd i adore it in real. I want to mention that with this post i actually think about myself, my body, things i like or hate about me. Thanks 😋 @redheadwayfarer #selflove", "_ruddhiii_": "I hate my stomach cz its oversized and weird.. also I hate my height..I'm not even 5 .... I love my smile cz people have told me when I smile I give vibes of a morning breeze!", "simran.bhosale.1": "I hate my arms cuz of all the arm fat... and it’s weird how I’m not able to pick one part I love most cuz I love my thighs and my back and my hair and my fingers. 🤭🙈", "kaatto786": "I hate my upper back area nd the reason is that my whole body fat gets together at the upper back nd it looks like I have breast at back too nd I love my legs they are in shape", "curiousbloombug": "I hate hair on my skin.. seems like it’s spread all over my body  I love my volumetric lips 👄 and eyes 👀", "ishikajain04": "Hate my arms cuz they got bulges ( but i have started flaunting them cuz self lovee ). I love my lips cuz they are bold and sensual. 😛💃", "pari_meihar": "Love my smile and hate the body fat", "cloudwalker": "Hate my thighs. they are thick and shabby .", "theladyinbun": "the photo is so beautiful", "wordandmelody": "Love you darling ❤️", "vaishnaviiaroraa": "Love my eyes cause they are big and beautiful ones,also my legs cause they're long and thick. Hate my nose cause its a fat one and my neck cause it's short and my fat gets accumulated there 😂", "jhajagriti98": "I hate my arms cos they r too skinny and love my legs cos they look great I geel💓", "jigs__3646": "#kadak_meri_JaaN_❤️❤️❤️❤️_😘😘😘__", "kartiksamaga": "❤️❤️❤️❤️❤️", "manisha.georgina": "Interesting...", "ganeshsonawane652": "beautiful 😍😍😍😍😍😍", "rashmified": "I hate all the marks on my body because I have too many and I hate my upper arms because they make me look like I am super fat. I love my thighs , my hair and my face. I love my thighs because they make me feel sexy , love my hair because I don't know I just love my hair and I love my face because I know I'm pretty. Hahaha just kidding. I love my face because I look like my mom and my sis.", "dhhaarruu": "I hate my nose, coze its shapeless like those of chinese's.. its nt sharp.. the thing i like most about my body is my lips and figure.. i dont need to go to gym to lower my waist nd increase my breast.. its naturally attractive nd perfect in shape..", "nehaa_kp": "Funny thing, I actually thought I’d have something that I hate in my body but when I put some thought into it, I don’t really hate any body part of mine. I do believe I should reduce weight but I do not hate my body because I’m fat. And this is pretty big for me because I used to hate every part of my body and also myself. And about loving, I love each part for a different reason. People might not, and they don’t have to; but I do. This might seem too self obsessed, but this is pretty big for me because I had self image issues and hated myself. Idk why I said all this, just felt like sharing it.", "dipz_380": "Hate the stretch marks on m shoulder coz I can't wear sleeveless becoz of it....love m eyes coz others says they r pretty😋", "arshad_kabeer_khan": "I hate my stomach most.. I luv food n my stomach is just like a balloon every time I love my face most.. However sad I am I jst look into mirror n feel I am not like this n boom .. I start to feel happy..", "maddypics2905": "Check Recent Pictures on my feed❤️❤️❤️", "binay825": "So sweet ❤️💖 💝", "parsatee._.99": "I hate my hair cuz they are too frizzy which is why I always need to tie them up. I love wearing those skinny caps, and when I tie my hair up in a bun the full thing looks weird. I love my lips cuz they are just amazing!! Words just can't describe how wonderful they are😍", "kashishjain1603": "I hate my thighs because they are bulky and I love my waist because its got some nice curves😜", "santoshi_1991": "Hate hate hate my lower body. And the reason is all too evident as they r not at all toned😶", "notyour3.14": "I hate my thighs because they're not conventional looking.. I like my hands because my wrist bones are prominent", "that.inappropriate.gal": "Hate my belly fat and side handles. Make me look fat obviously. Love my legs. I think they are kinda hot.", "thatpaharigirl": "I just don’t like my breast, they are too laggy and are not in perfect shape. They force me to wear a bra all the time and I hate that. I do hate the type of hair growth on my body. But, I love my legs and thighs. My eyes remind me of my mother. I like my feet. Though my height is short but I love my body.", "sonalika_b": "Love my eyes.. They have fire 🔥 in them", "_click_freak_": "I hate my butt the most I wish it would just tone itself down. Also I love my shoulders and arms cause they're pretty strong and sturdy", "aarya_10_12": "I do not hate, but dislike my underarms because they are weird and black. Apart from this I love everything of my body! ❤️", "_piku___": "I love my lips 😍😍😍", "shivanipr_": "I hate my chubby legs 😂😂 but I'm working on that as well. And I love my skin !😊", "trupti0417": "I have a big booty and I both like n dislike it. It gets a lot of attention when I wear fitting clothes.", "surbhi_singhh": "My case is so weird…Like people have standards for the facial features, they say the eyes should be big, nose should be slim blah blah While I have very small eyes, I have a bulgy nose, I have fat lips, extra small ears and still people tell me that I’m beautiful. It’s like I can’t say that this part of my face or body is perfect because no part is…I’m too skinny and all but still I’m kinda obsessed with myself like I feel I’m the prettiest girl on this earth 😂", "doraontherocks": "The skin mostly. Have a love hate relationship, mostly hate it coz it's so uneven.. wierd pores and bumps .. also my belly and abs, too chubby for my body", "anushkaaa.n": "I hate my legs the most, they're too fat. I love my lips the most because i feel they're prettyyyy", "cantnotprocrastinate": "I hate my face. I don't like the way I look. But someday I wake up and feel like I'm beautiful. Kinda love-hate relationship with it. And I love my legs the most, I love to flaunt them in skirts or shorts. They are tall and define my figure really well. ❤️", "samikhyaaaa": "I love my legs (from knee to feet) because somehow they never look bad and when I feel a little insecure about myself, I look at them and try to feel good. I hate hate my belly at the moment because well, it's hanging and makes me extremely uncomfortable.", "its_mansiii": "I hate the fact that I'm not pretty.I see other girls and immediately my confidence drops. On the other hand I love my hands.", "mind_if_i_slytherin_": "Hate the strech marks on my breast because they look weird. Love everything else in my body.❤️", "bhavyag_": "I don't exactly hate anything about me but I wish my thighs weren't this thick and were more toned. Rest, I love my curly hair, breast, eyes and friggin' everything", "verification.for.you": "😘💕", "snigdha__kashyap": "Well i dont hate any part of my body but yes there are some parts which i dislike. Like my stomach which doesn't help me wear good dresses(😂), my double chin and my fingers. And then, what i love most about my body are my eyes, which helps me see this beautiful world, my lips for which i can smile to people around me, my hair, of course, though they are unmanageable most of the times, my chubby thighs and of course my breasts.", "thenotoriousm.a.d": "I hate the fat on my belly, I hate the fact that I'm short, and that my beard doesn't grow out properly because of all of these things, I won't be desirable by anyone, it's silly. I'm starting to love my natural salt and pepper deal (used to hate it, cause everyone would think I'm 10 years older than I am) and I quite like the scars on my body. And my feet, I think I have very pretty feet 🙈", "neeturajput9800": "Hate my \"underarms\" bcz of its darkening (could not wear the outfits i want to) and i love \"lips\"in my body bcz i myself found them attractive to me so yea", "adnankhan198711": "🔥🔥", "deepa_choudhary007": "I love my thighs,back and breasts 🥰😘", "buttercup_6789": "I hate my nose. I hate the shape of it. I think they make me really ugly. I really love my eyes. I think its my best feature. I love them because they literally are the mirror to my soul.", "d_delikate_wild": "I love my eyes, they're expressive l, at least what I always feel like when I look in the mirror. And my breasts are what I hate the most ever since few people (including my ex) pointed out how my size is a bit bigger for my figure. I can't help it but to feel conscious about it.", "_suhana_b": "Hate my arms n thighs cuz they are fat. Love my belly cuz it's cute", "imohdnabeel": "Pretty soul ❣️🌹", "kindling_embers": "I hate my thighs,just no matter how hard you workout they never thin down and the cellulite always finds it way back I love my eyes,they are the best reflection of me", "shanky.loves.u": "Lips 😘", "sahay1609": "I love myself specially my eyes 😍 but sometimes I don't like my thighs @redheadwayfarer", "bijubiswas__92": "Top in the world 😘❤️", "aasthahm": "Hate the thighs because of the stubborn fat on it which would take forever to go even if I ate right and worked out. Love...umm.. love my breasts because they make me feel attractive. @redheadwayfarer", "sumitiiiii_": "I hate my thighs....the most love my eyes", "the_mi_girl": "I hate it how I always try to please others!", "prabhat0_0": "Hate my nose, cause it's all fuc*$d up and big. Love my smile,cause that's what I notice the first in other people so I like mine as well.", "iam_priya_darshini": "I love my everything.. No hate for any of the body part 😊😊 not saying that i am perfect but i love the flaws too! 💝", "rana.elena": "I hate my feet because they are ugly and wide. Love my Skin because its shiny😂", "kayra_gem19": "I hate the back of my thighs because I've got strawberry legs and it makes me feel very uncomfortable when I wear shorts because the black spots are clearly visible. The body part I like about myself is hips because I know to belly dance and I like to flaunt my curves while doing that.", "a.d.p94": "I hate my complete body. Maybe bcoz of the people it's been touched by. Maybe coz it brings back all those memories which men did in the name of love n den left. Just makes me feel dirty. Even though fully clothed it never stops those stares. I've been trying to get comfortable with my own skin for years now. But I guess it doesn't stop (don't wear this, ur a teacher. Don't do that ur a teacher) It just makes it all the more difficult . I love my eyes though but I keep it hidden behind my specs bcoz they speak too much", "_chahatgupta": "I hate my calves coz they're loose and I think my legs don't look sexy enough when I wear a dress. I love my long fingers, because my brother and I have the same hands and it somehow reminds me everyday how closely we're related and how much I love him.", "the_arushisrivastava": "I love every part of my body because it's my body. Nobody gets to decide which part I shouldn't or which part I should. When people say you have too big boobs I be like, \" Honey! That's none of your business.\" Somewhere, you been an inspiration all along. ❤️", "anuragtiwari0890": "I hate my hair because it's less.i love my stemina. Because its good", "sammal1188": "I hate my eyes the most because I am compelled to see filth around myself in many forms. I hate eyes because majority of us see others from our perspective and think the way we see.🙂 I love my heart because it's full of love and compassion for my friends and enemies. I love my heart because I have love for my nation. I love my heart because think above genders, cast, creed, color, sexuality etc and treat everyone equally and expect the same from others. I love my heart because it has place for every friends, haters and enemies.🙂", "zakhep_19": "hot lips", "shreyakataria15": "I don’t like my thighs, I feel they are way too thick in proportion to my body. Like earlier I used to hate them but I am slowly trying to come in terms with it. I love my lips, actually funny enough I used to hate my lips too, I was always told that my lips are thick for my face and they make me look bad. Well what Can I say a thankyou to kylie jenner, people get injections to get big lips now. 👻", "meghna.bhalla": "Love everything my body has endured to make me be in a comfortable place with it❤️ From the tip of my curls till the end of my long legs :) although I hate the cysts in my ovaries, PCOS affects more of the mind than one can ever imagine. But it's healing and that's all I care about :))", "brunbelle": "I hated my nose for the longest time. And i love my eyes. They so pretty I fall in love with myself 🙈❤", "metejasvi": "My arms, coz even if the rest of my body loses fat, my arms never do :(", "pea.cee": "I hate my tummy, It's big and has weird shape. I love my skin colour, it makes me prettier than I am.♥️", "rahulkothariofficial": "Hate =“Mera pet” Kyunki Tshirt mein bahut sexy dikhta hai mera pet @redheadwayfarer 🙈🙈 love = “Mera Pet” kyuni khaane ki plate ke liye table ki zaroorat nahi padhti 😜😜", "arewelivingart": "I hate my thighs. Almost all my life I have heard how enormous they are. The word 'thick' wasn't really used back when is as in school. 'Thunder thighs' was the word instead. And I guess along with people , I myself started disliking it. But then the part I take pride in is my arse 😂. I just find it on point", "stucksomewhere_nowathome": "Love both my lips and boobs equally. Find both of them quite sexy and attractive- their shape ❤️. Hate my butt because it's almost flat.", "akshita.kabra": "Hate my legs and upper arms because they are fat and I can't fit into pretty clothes. Love my eyes because of the colour.", "swatisurii": "I hate the double chin of my face. It makes my face look divided between two parts. I love my body. It's curvy.", "aneeshajethwani": "@redheadwayfarer My lips have a dark tint as I had low haemoglobin issues due to over bleeding in Fibroid, That's probably the only thing I wish to cure. Also, I love everything about my body! It may be have scars but they have made me a stronger woman today. #grateful", "notsherinthomas": "I love my dimple though I only have one on my left cheek. I can go on and on about the things I hate..", "nerdy_bird_": "Hate my legs...too fat..too hairy ...thick ankles...cankles that's it ryt? Love my curves ...cause even if I am overweight and unfit...they make me look good .", "bombayponu": "hands- its not firm.feet its ugly and tanned.", "ananya_jessy": "I hate my height and love my brains 😁", "anusha_tirkey": "I hate my left leg because of my birth mark which goes all the way down and love my hair and eyes", "dpritze": "I hate my thighs, i wish they were more toned! But i love my face ...i think m cute and a bit chubby! 😂💁👅@redheadwayfarer", "100bhagyaaaa": "Hate my lower abdomen because I feel it juts out making me look pregnant while I am not ( Nothing against pregnancy here ) I love my hair, my waist, my legs and my eyes because I just like how they look? ( Hope that makes sense )", "sanober._.19": "I hate my lips, I feel like I don't have a pretty smile. I love my eyes, they are green and so is the best thing about my body 🙈", "i._wisher": "I don't hate any part of my body. I love it the way it is. Who'll love it if I won't! I might not have the said perfect body but it doesn't really have to matter. I'd like to be proud of it", "ramyasri.m": "I hate my oily skin because I always look oily and unfresh, also the size of my face because it doesn't go with my body size. I love my arms and also the fluffiness of my body.", "shutter_bong": "🔥🔥", "riddhi_tiwariii": "i love my eyes ,because my eyes are beautiful and i dont like my nose (not hate tho) coz its not that pointed and makes my right side profile a little weired xD", "piyush_8717": "Sedactive", "parispallavi": "i love my eyes coz they are brown and looks stunning in sun...hate my hairs coz they are consuming alot but are not improving...", "2410_shreya": "I hate my skin", "aartipatil19": "Hate my nose cz its more like protruding out n big....also hate my belly fat n thigh fat....but i love my lips cz they have naturally perfect plumpiness and fuller and i also love my waist curves because my body type is pear🍐 shaped.", "gurishqkaur": "I hate my fat ass Arms to be very honest, that shit makes me kinda conscious and uncomfortable wearing certain clothes. No matter how much I workout my whole body shall shed off weight but they’re just loose fat skin urghhhh.. However, I love my Face🙈 If that sounds too girly I don’t care 🤷‍♀️ Im blessed to like my facial features and love to enhance them with some makeup 💄 haha after all I’m a beauty influencer Such an apt niche for me ❣️", "wordsmithaverage": "I hate my arms, they're so huge like arms of some boxer. Makes me look chubbier than I am and because of them I have to buy clothes larger than my actual size. I love my butt, it makes me feel sexy and in a good way.", "that_bohemian_": "I don't really hate any part of my body, but I don't like the elbow part.. Because it seems as if it hasn't been washed for days. It differentiates from the whole body! 😂... I love my lips and eyes and hands and legs too and even back 😁😁.. I don't have any particular reason but yeah I love them all, lips because I have got a mole there and on back too. Thanks for asking though @redheadwayfarer", "sashabaijal": "Hate my thighs and upper arms because of Fat, love my eyes because of the colour", "its__rakhi": "Hate (not hate actually) my tummy and I love my wrist n lips. I love me 🙌", "kajall.__": "Love:- my eyes and my fingers..hate:- my skin due to acne😩", "happy_hungry_bear_": "The part that I love most are my ears and also cheeks, they are just so cute. ❤️❤️", "khushboo_dhamija_": "i hate my lower belly pooch...rest i like it", "shelliejain": "Tbh, hate - nothing, coz 🤷🏻‍♀️. Love - my smile, hair and height(only when my brother isn't around coz he is 6'3\").🙄", "mansisati27": "I hate my upper arms stomach thighs double chin coz of fat. I love my nose and hair", "_vandanakhatri_": "Hate my arms. They look so faaaaaat. Love my legs. I think they're pretty hot.", "la_belle1_": "I love my 👄because they are soft nd plumpy. I don't hate anything about my body @redheadwayfarer", "damn.ananya": "I love my eyes. My eyelashes are pretty thick and long. The thing i dont like is my weight, I'm a bit insecure about it, i dont hate it tho. Also, i have a love- hate relationship with my stretch marks. I have a lot of them on my shoulders and legs and i like them cuz they are unique to me but sometimes i do find them a little ugly.", "mung_the.savage": "I'm not perfect, but i don't hate any part of my body.. I know I'm amazing just the way I'm.. And so are you.. ❤❤❤🍀🍀🍀🍀", "shruti_3007": "@redheadwayfarer ...hate dry skin of feet n hands and love everything about my body🤗", "thatindianyogini": "Probably Skin due to Acne but have recently started loving that too 🤩🤗", "samenthaf\nVerified": "Verified", "foram_boghani": "Hate : hair - becasue it 50% of it is gray since i was 16", "alnesha__": "I hate my butt bcoz of too many stretch marks . I love my eyes the most bcoz they are beautiful", "dr_with_a_good_handwriting": "I hate that I have a large nose, because the rest of my face is small, I hate that I have hair even on my fingers.... I love that I am very much in shape, I'm tall and slim, I love that my face is structured, prominent cheekbones and collarbones", "avanti_sathe_": "I hate my thighs the most because they have stretch marks and I feel bad while wearing shorts, which I love to wear. I love my eyes the most because they're a beautiful mix of browns and I've been told my eyes are very expressive. 😊", "perksofbeingnandini": "Hate my nose, I think it's too big. Love my eyes, they're pretty", "hathiparinda": "I have a hate-love relationship with my vagina. I love my toes because they are different and weird.", "paleja.sam": "I don't hate but I feel my foot is quite huge which I don't like.", "_angiraaa": "I hate my thighs and stomach! Wish they were more toned. And love my curls and eyes!", "shaarenity": "I hate my thighs and arms cuz they are fat and look out of proportion compared to the rest of my bod. I’ve got an hourglass figure, so finding clothes that fit me well is such a hassle. Some will be loose on the waist but tight on my hips, I have to get most my jeans altered so they fit well and hug my curves!", "aishwarrrya": "What a beautiful picture, you're flawless😍", "i_m_h_a_r_sh": "So hot luk❤️❤️❤️", "priyanshitalks": "It's my height what I hate the most. Not any part as such.", "shruti_aggarwal8": "I hate my thighs and abdomen part, lots of fat. I have done almost everything but not getting rid of it", "sam_srb5186": "Beautiful..👌", "withlovesoniya": "Hey Saloni, I just dropped a msg in your inbox. Please check and reply.", "garima5_malik": "I love mt legs bu hate my jelly like stomach.", "narukarajput76": "Cutiepiee", "manvi.kansal": "I don't like many things about my body. One of them being my arms! They're abnormally fat. And again, there are many things I love about my body. One of them would be my nose! I find it big and cute 😅", "vbhae": "@redheadwayfarer beautiful click ...hate - eyes - made me Wear my glasses from little 😂 ...love - my hands - always been my best friend to hug myself out 😇", "rachnananananana": "I'm still in the process of getting comfortable with my body, I don't think \"I hate\" anything about it. I think I'm beginning to like my facial structure, something I wasn't really fond of.", "mimislittlecakeshop": "I absolutely hate my midriff and thighs.. I can't buy ready clothes, I feel I'm missing out on so many pretty clothes. But I love my curly hair which I usually, keep short. I wish I was slimmer", "hashmi9847": "Sexy 👧", "vanshikhakanojia": "Eyebrows and Eyes. And wrists. It is weird hut I love my hands, so delicat and poignant.🙈🙈"}