{"mohit_kulkarni08": "Nipple❤️", "garrygurmeet18": "Apke nippy ko kiss karna hain 5 mint @redheadwayfarer", "saurabhdahale": "Hotness overloaded", "prangotnochill": "Thanks for sharing this, it should clear all the misinterpretations...", "osman_mian": "🔥", "bliss_buzb": "Has been harrassed for wearing bikini in private and showing nipples to the world 🤐🤐", "ghaznisaab": "How the f on earth is this feminism..? Feminism and freedom has a totally different meaning while women have now taken to expose themselves in the name of feminism.", "tyrrell_4478__benedict": "❤️🔥", "zaran558": "bohat agg lagi he", "dubifl": "If you wanna spread this messages to the world go fore topless posts..... More people will follow", "spicyhunk": "You are spread a vulgarity", "hunter_buddy7": "🙈", "karan61995": "I want eat ur pink nipples", "saurav.kr.1": "🖕", "zishan.md.ahmad": "😊", "atultripath": "I will be honest, I was lost at the areola, but went ahead and read the comments. Then came back to read the post. Commendable post. I agree with all of your points except example of temple entrance. That is not about men vs women, that is more about Shraddha and ttradition of the place. If it were to be anti-women, temples wouldn't be allowing any woman to enter a temple on any day just because they are women. Which is not the case. I will give you an example to give a different perspective: - In Kerala most of the temples require men to remove their shirt/kurta/top before entering. It is a tradition. Men might feel bad about it as many Indian men have unpresentable bodies and many are even shy. But if they are at a temple, they are there because of Shraddha and share their pain/happiness/request/thanks, and not for demanding equality or rights or ego-ride.", "raghavendra072": "You are amazing 👌so beautiful in pink ❤️😍", "dx9974": "ok", "laxman_k33": "❤️🙌🔥😮😍", "abdulqadeerkhanthaheem": "Ur teasing me by these pictures uffffff", "saumtastic": "1. Men can walk around bare chested showing their ‘n*****s’ as and when they feel like without bothering whether women feel uncomfortable, but if a woman does the same it is considered nudity or sexualised and suddenly all men feel uncomfortable. 2. The reason female nudity has become such an issue is because of having considered the female body like something alien. We worship female goddess in all forms but the one thing that feeds our children is considered vulgar. 3. Many a times women in sarees show most of their back, breasts and stomach and yet it isint considered vulgar because that clothing is a part of our ‘culture’. However so it still has a lot of skin show. 4. She has the most supportive man in her life (not that I feel she needs his validation) who has let her be the way she wants. Sadly even today many women don’t even have the right to smile openly let alone even fulfil their smallest wishes. 5. What she does with her body or how she decides to show it is her and her “CHOICE” only and nobody can have a say it that. 6. Many of you may secretly wish to live lives on your own terms but cannot due to societal pressure and what not, so the mindset ... if I cannot do it I won’t let anyone else either. 7. I was happy to read many guys comments in support and speaking up.... only goes to show the respect you have for women and what a broad minded upbringing you have.👏 And lastly if following her on insta is only so that you can degrade her more just goes to show how meaningless you own life is.", "chhatrapalrajput8141": "Why didn't wear under bra", "big_fan_of_manak": "😡", "dream_with_an_open_eye": "Um.. Okay I'm genuinely not here to criticize or troll anything, all I want to tell and know is, why almost maximum of your post saying about feminism have these skin showing pictures?? I mean I'm a girl, love to wear various dresses but is feminism just means showing skin or exposing our nudity?? I truely agree by your caption but exactly that's where the point lies... We girls need to rise more in the grounds of education first to acquire and fight for our equal rights that have been given to the men and we are being deprived of.. It's one's personal choice how much skin they want to show, but always posting about feminism with exposing skin feels like feminism is primarily about our nudity... And then comes all the things.. Is it so??? Ofcourse not everyone goes through the captions to know what you wrote.... Honestly I really don't understand this thing... This link of constant showing skin with the women development... Also I don't think if people would love to roam around without wearing clothes.. If that would have been the case, clothes would not have been ever invented... And also There are many profiles i have seen posting such pictures just as an art, photography, beauty or something like that .. That's also okay.. All good... It's your profile, your body, you have all the rights to post whatever you want ... But linking it with feminism all the time, I don't really support it every time.", "endgame313333": "Just adorable🔥", "verma_arti": "Well said Saloni..", "rharsh173": "2 Jodi kapde ke alawa kuch hai Tere pass😂😂", "orchidentia": "One of the most beautiful posts I've come across till date. Much love and more power to you.❤️", "ofsparklesandwords": "Love how you put out feminism in such an articulate manner and love the mug though I can't read the last word. The answer to why you posted this picture is the mug yes? @redheadwayfarer 😌", "so.nu2082": "Excellent mind blowing", "bharatrajputtheking": "So is nudity important for support feminism?", "priyabasu26": "@merlinrodriguez241 this is the Feminism vala", "dilipkatkar007": "OMG ❤❤❤", "malaybabu7": "Nice looking", "dixitajayy": "Boobs bhi achhe ho to dikhao. Latke huye h😂😂😂", "stardust.sid": "There is a fine line between freedom and stupidity", "vikasyalgukar": "Feminism is good but what has any religion to do with it.", "dead_albatross": "Feminism is also taking into account the marginalised and minorities who are not able to voice out their opionion as openly as savarna women can. Feminism is standing for all those women too without bringing into account that only one section of women suffer more than other. Intersectional feminism is what this world needs.", "veer_sarna": "@aaberi", "miss_slay001": "You keep promote nudity in the name of feminism are you out of your mind bitch?? @redheadwayfarer", "makpeterson000": "Sexy boobs", "lamiashahdat": "I live for your captions", "aryaroy6969": "Show your boobs more plzz", "sharon_kaurav": "❤️🙌❤️", "sahil_rocky_bhai": "Angel 🧚💕😘😍👍", "bellibone_08": "Woah woah Bang on very well & clearly said. I hope morons have got their answers. More power to you lady.❤️@redheadwayfarer", "nti_srinagar": "In Frame?", "mjbugz": "Attention seeker', stupid publicity gaining post on the base of feminism!!", "bong_guy4": "Photo is something & Caption is something 😴", "_.purohit": "@muskan19_21 wise words", "ashishbhva9966": "Plz paytm girls contact me... I'll paytm in second", "sameerharshwal": "Finally i love uuuuu....", "oindriz": "I was taught by my maa to call the breasts 'chhi chhi'... It sounded funny but stuck to my brain like a leech. Now I understand from where that word may have originated. In both Bengali and Hindi, 'Chhee' refers to 'shame'. So 'chhee chhee' is when you find something shameful. And we all have drank our first meals from these 'very shameful' mammary glands! And so many will see your pic and go 'chhee chhee, is ladki ko koi sharam nahi hai Kya?'... 🤣 You go girl! 🔥 @redheadwayfarer", "jashimjamal": "♥️♥️♥️♥️♥️♥️", "prashant_hegadmal": "Awesome❤️❤️❤️👏", "abrakadabrajadu": "Mam i love the way u always talk for girls.. I really appreciate... But please do the same for Muslim community girls as well... Because i think they need it more.... So please show your views on triple talak... Burkha and halala aa well... Btw lv u❤️", "sourabh5160": "Beautiful 😘😘", "__kimayaa": "I didn't understood y u said that feminism is not to be equal to men!?", "versha.singh.3998": "To all the people making an issue about nipple display: dude feminism is just not about #freeniple movement...feminism is about freedom to do what women want without hurting others sentiments.If this particular lady is comfortable in showing her nipples...nobody should have a problem with it. But I know this is going to take decades....we have judgemental freaks literally everywhere who judge us by the length of our skirt and by accidental flash of bra straps beneath our sleeveless clothes etc etc. @redheadwayfarer #yougogirl and do every fucking thing u want to do because #moronscantruletheworld but #queenscan 💃💃💖", "dev__gru": "The last line got me 🙌", "zafarwestern": "💖💗💖💗💖💗💖", "prince_6o46": "❤️", "neerajtiwari1339": "Umdaa", "ramesh.v2509": "🔥🔥😍", "shubham_mohanty67": "Just one word i have to say to you that don't divert generation towards your perspective.", "sritatamang": "@no_one_left_a_username_for_me 🔥", "chalta_purja": "She is such a bitch", "shabbirdwd53": "🙌❤️", "sangeet_nair": "It's simply her choice. Why so much of a fuss people?? Any of us who r ok with her ways, should follow her, rest could unfollow. ☮️", "vishubawa009": "#redheadwayfarer 👏👏👏👏👏👏👏", "akki5396": "❤️❤️", "metal_jacket_96": "Nipples 😍🔥", "divya_zen": "Boys showing nipples never triggered any1 but her showin'barely nipple is cultural shock to every misogynist here! I am not saying it right or wrong but who are we to judge any1 for how they dress until they doing some evil in some1s lyf i am ok with their choices they are making for themselves not getting in way of others lyf. Stop limiting women right to live because of their physically bring diff that is so not cool!", "unmukt_12345": "Ham ek lines tho apne syllaabus ka book pdhte nii exam ke pehle aur yeha itna kon pdhega.. !?? Didi..aise kaise chlega😂😂", "_selcouthsouls": "All these men commenting against the exposure of aerola that is a very part of HER BODY, y'all are the same hoes who'd jump at the sight of a bare nipple on a normal day but can't stand it here", "voguechurn": "So I heard people of Instagram decided to make an unnecessary rule about the relevancy of a picture to the caption? Although The irony is that the reason most of you are here is because of the picture. 😒 If something so educational is being preached and reaching many others due to the picture ... Why is that a problem? Support the cause instead of focusing on other stuff.", "junaidinfo": "All you want to say is <,Feminism means showing titi's", "vaishhh.__": "Then why we have different washrooms for men's why we have different compartment in train for men's . Come out from your reel life . People are just enjoying here no one gives a damn. You yourself disrespecting your body. You don't have want to wear then just don't wear it na . @redheadwayfarer why you want to do everything at the name sake of women empowerment BC. Please educate yourself. !!!! Everything has it two sides and also there are many temples that men can't visit. And TBH I have seen a boy uploading his pictures on underwear or showing his ass. And without shirt only gym people do that.", "sauravprakas": "Urvashi butalia? Who", "sh3rry666": "❤️👌", "prakash34445": "Wow babe u have guts to post it", "vinod_rascal": "Feminism also not mean by nudity or showing all ur assests and also its not bad when some one says -\"u have nice boobs\" because they attract eyes @redheadwayfarer", "piyusha_._": "Damn 😍😍😍😚😚😚", "jim.4931": "Feminism is NOT appropriating the struggles of underprivileged women and commodifying the struggle for equality by posting semi naked pictures. You are privileged. Blue tick and shit. Posting semi nudes won't get you in trouble. So you're not emancipating women by doing something radical here. Urban auraton ka chutiya kaat rahi ho bas feminism ka jhanda dikhaa ke", "priyaagarwal05": "By posting such kind of pictures you don't make sense to me any more.... And it's repeatedly done in the name of feminism... Pathetic", "skylightlion": "Almost there😯", "iam_aviinash": "She is degrading feminism , don't fool inocent people", "bhoomika.tyagi": "I love you saloni chopra❤", "rashmi.soni1995": "💋💋💋💋💋आज मिडनाइट को मे इंस्टाग्राम पर live aaogi... Muje live dekhne k liye abhi follow Kare.... हर रोज रात को 11.30 बजे मे live रहूंगी me every Sunday ko live rahti hu 😍😍😍😍😍 follow my private account @kavya.patel.1995 🦀", "photographer_lovez": "Why u show nudity in ur pic's any reason for that @redheadwayfarer 🤔", "aniketacharjee": "Chupana bhi nhi ata dikhana bhi nhi ata", "starkid1998": "Full frontal nudity hai ye ... feminism ka naqab mat pehnao isse. We know what's feminism is. You want to post nudes ...just do it ...don't write essays on feminism in caption", "fashionfads25": "🙌🙌🙌🙌", "pandya_niyati": "❤️❤️❤️❤️", "veeya_rc": "That kurta @namrata_d_official", "desaisudeep": "Mediocrity written all over this description", "lalit.prajapatii": "😱 dikh re hai", "abahubali596": "Ap wahi ho na jisne sajid khan pe # me too lagaya tha", "sunny_paradiya": "Beautiful.. Mmmmmmmmmmuuuuuuuuaaaaaaaahhhhhhhhhhhh", "sohailshaikhofficial": "why the hell other's are so pointing... it's her beautiful body and soul her wish ....×××Stop××××", "i_yaduvanshiakash": "@redheadwayfarer i agree with u r words but by giving an instagram post will not do any kind of effect you have reach the place where instagram doesn't and i hope so u r pretty much aware of that. we have places in our country that are not modernized and there are women out there who needs to accomplish their dreams and get free but cant do because of the society nd mentality if the people out there including men and women ... so u need to reach them and make these people change their mentality ! make an impact by being a narrator× rather than posting so that the country will change ! You are one of my friends fav feminist i hope you do good out there with mic being an inspiration... 😊", "unofficially_harsh": "Nice one🔥👏", "rashi_chanda": "Some ppl have a disease called xhibitionist which means they get a kick out of showing their body to random ppl... U have that disease", "subrata_kuri": "Nice", "chinmayee.dash": "And this pic is related to feminism because!!???", "arif_shah_143": "🔥", "kaju_897": "Beautifully written! 💜💜", "sohel_shaikh0009": "😍😍😋😋😋😋😋😋😋😚😚", "____gelato": "i love you for this! thankyou!", "drunkbetch148": "🙌🙌🙌", "24_wildchild": "Why women showing nipples is a such big issue whereas men showing nipples isn't ? LOL. Just another reason to be a feminist!", "vasundhara_naidu": "Well said as always 👏🔥", "attitude.cool120": "#freethenipplesupport 🤘", "mani.thegr8": "Feminism means popping out nipples 😂😂😂👀", "gagandeep__zaildar": "wow", "ratanjijadeja": "nicee", "abidmansuri007": "Looking beautiful", "saakii_16": "🙌❤️🙌", "abhinav_131989": "Don't know but showing nipple isn't feminism or cool...it's ok to be free but nudity can't be ur way of expressing urself...I know we all love naked ...but that doesn't mean we are vultures and seek sex every time or place ...we do believe that's decency should be maintained at places where more ppl are watching u...", "dipeshnaik8": "I can see your nipples babe❤️❤️❤️", "bhavik768": "👌💯", "a_blank_verse": "You're amazing , keep doing what u do❤️", "_shxwrxma_": "You forgot one more point: Feminism is just apples trying to become oranges while claiming they're all the same.", "noo_more_liies": "Totally relevant caption with a very suitable picture. If you're unable to associate the two, feminism is not meant for you. ✌", "neha_kapuur": "Who all are here to read comments😂😂", "deepika3483": "Its just a normal body part of women if u gets excited by seeing this,its your problem.", "miyan.official": "This is what i can expect from india a naked country", "meranamvaibhav": "I just came here to read the comments of Keyboard Warriors 😁😁😁", "nishi_bree": "#freethenipple y is everyone bothered abt it?? Y are u all getting offended.. show the same behaviour when a man takes his shirt off.. let her be what she wana do! Stop criticising everything!!!", "workoutmodeon": "You don't need to write long paras to show your nipples and nudity. Just post it people will see you post anyway", "_.daksh._": "#freethenipple You go girl.. 🔥🔥", "sanjeenamal": "🔥🔥🔥🔥", "as.hwin1940": "😂😂😂", "mir_axhar": "Baki sab thik he pr bra to pehna kro 🔥", "bablu.13": "Superb. Sexyyyyyy", "givemeprawnpickle": "Hear hear❤️; yet another spectacular post👏👏", "_tasnimachowdhury": "Nipple🔥", "upadhyay.suwash": "Feminism my ass. BC Kuch bhi Karoo... Galat math sikhoooo.... This is not feminism. Just being naked and all. Feminism is the thing which dominates neck to neck with men in various fields. That is women impowerment", "palakmakkar4936": "What you try to say everytime doesn't makes sense, you want to be naked and post it and if a man will do it you'll be the first one to say kitna badtameez h ye so pls apni bkwas ko feminism mat bolo", "the_third_witch": "O my god I have this same kurta 😍 @shreeji.banti", "sagar.samrat_1701": "Sexy🔥🔥🔥", "memehoex": "Wow nice chuchi ❤️❤️", "naresh_patel": "❤️", "sairanikhatimam": "She underwent harrassment too... Lol", "superheat00": "Just show off ur nipples", "manoj_jani_2129": "Awesome", "rupali_mulik_baraskar": "I adore u. I seriously do. Wish i could be this open for talking about our rights. Why do we have to worry so much about how we look or appear. Ohh the bra strap is shown, yes it is because i wear one. Now i really don't care, i show it off. They is so much to ask for, all we want is freedom. Our right to choose things or make decisions. Say it be temple on periods. And the PICTURE is lit girl🔥. #freethenipple I am with you. You are a true inspiration. Loads n loads of love ❤️", "bharpur_matra_mai": "Super woman 🙌🙌❤️❤️", "sakkumyself": "Amazingggg i loved it so muchh😀😀😀", "_.srxe._": "Feminism is all the abt choice for women. The choice to choose their clothing. Whether it's a turtle neck or a tank top. A full length jeans or shorts. It's not only abt being naked. People who are associating feminism solely with being naked have to really educate themselves.🤷‍♀️", "gapr1979": "💋💋💋💋💋👄👄💋", "deepss.tk": "my parents tooo", "matt_murdock11": "I love ur version of feminism.. i request all the female celebrities to follow way of expressing themselves... damn i love insta as well", "dr.tony.tony.chopper": "Writibg", "kumarpal_r_jain": "Well said 👏👏🙌 .....except example in 3rd point ....... (P.S. in my opinion)", "preethirajan8": "Huh then you Barely understood anything @sushantsaklani_", "the_lady_with_grace": "Saloni , I always think with your every post that this could be the best way to express someone thoughts or feelings and couldn't go better than this,but you always prove me wrong,we are not related by blood though🤣 I am so so proud of you and your thinking, and your every single word,let me tell you ,I am again fallen in love with your words😘 keep going girl😍😘🤗@redheadwayfarer", "ankita_rawat_": "You 're such a beautiful soul with so much magic inside of you. ❤ keep doing what you do. Lots of love always. 😘😘", "abedin.the_morningstar": "Wow", "thirstymonkyogi": "My favorite wayfarer @wayfarer_im", "valuable_nagpal": "Well that's hw flop actresses like u post to be in the limelight !!! 👏👏👏", "aishu__ar": "Bang on 👏🤩🤩 Feminism to b continuedddd❤❤@redheadwayfarer", "gaurav.arora.1213": "🔥🔥🔥🔥🔥", "10.rohit": "Women empowerment😜😝🤣", "_morni8467_": "somebody please clear my point , is feminism all about showing bodyparts , boob's, talking about periods , contraceptives, cloths, orgasm, nudity , are these words are enough to define feminism, This girl @redheadwayfarer, got a concept of \"showing her boob's \"right alllll in her post, writing paragraphs and paragraphs about them is all about FEMINISM \" m not gonna talk about gender equality or ethics or culture, but I hvnt seen anything more den that , on her profile , I don't understand nowadays why feminism is not considered or counted when a mother is working in home which takes a lot of stress, guts and power to convert a house into a home all the day without taking rest, or any off days , without complaining. There are still many womens in our county whose husband do not help them in the upbringing of their kids , and after that without expectations she works day and night to provide them all the happiness and facilities, I think THIS is the real meaning of FEMINISM , , girl u got wrong concepts about feminism, BE A FEMINIST NOT A POSTER, YOU need to UNDERSTAND AND LEAEN more ABOUT IT .. sorry if that hurts", "srshan24": "Your nipple is having a peek", "a.sharma172": "Ab dikh rhe ho toh Pura dikhao warna rhne do", "shubharaj429": "She is showing it bcoz c is comfortable in showing it.....aur jo log iss baat ko itna zyada point out kar rahe hai yeh wohi log hai jo aajkal mirzapur aur sacred games jaise web series k fan bane huye hai......🤣🤣🤣🤣🤣....", "aishwarya_kaushik_seth": "Proud of you girl ❤️", "s022001": "👏👏👏👏👏🙌🙌🙌❤️", "visionary.photographer": "My mom and sister both were females and i learnt how to respect women through them..! My mom is my role model.. She fought with many struggles in her life and i believe she is one of the best living example for me.. Now.. She or my sister never shown her nipples or booty like this idiot who is proudly presenting herself as a feminist.. This lady is a living example of how a lady should not be in this society... I really pity this lady and pray god for her immediate mental recovery....! Shame on you girl...!", "vishal_rathore_007": "So beautiful🦋I love your boobs🔥", "juhi.c___": "@monalchhillar", "the_jay_rudach": "@redheadwayfarer 😍😍😍😍", "mono_mita27": "🔥🔥🔥🔥🔥😍😍😍😍", "karan_verma7": "Mausam kaisa ho rha hai Bombay mei?", "gkumar3192": "Photo boht gazab ki he bc😂😂", "manisha.georgina": "Interesting...", "sahilkhatib_": "I remember that legend that pulled out his dick in front of 100 feminist 😂😂🔥🙌", "_shonali_1": "You are so great ❤️. I love the way you write. I am just disagreeing with one point ie : women should be allowed to go to temple during periods , actually there is a scientific and logical reason behind that. I admire you a lot ❤️", "am.e.ya": "To everyone asking why she's chosen this picture to post: you are literally the reason the act of showing off your skin, the skin you live inside and have grown to love or are learning to, is an act of courage and empowerment. If you didn't attack people, men or women, for having the bodies they have and not being ashamed of them, posting a picture like this would be as acceptable to you as any other. TL;DR: she's not ashamed of her body but you are, for some tragic reason. She's not following you and commenting on your posts, but you choose to do that anyway.", "aakansha_singh85": "Amazing!❤️", "nirhav_": "😍😍😍😍😍", "yvishal8626": "sexyyyy🔥🔥", "payupanda": "Unki life...unke thoughts..unka insta account..unka post...unke boobs..unki marzi...nahi pasand aaya toh please aage bade...stop judging start growing...boobs are not the real problemm...but the narrow minds are.. more power to you saloni💙", "rahul.thorve": "🔥🔥🔥🔥", "tussle_": "Feminism aaya ki nhi vo nhi pta par itne post ke baad feminism ki definition zarur yaad ho gayi hai sab ko.😅", "mukherjeeadd": "Oh god, I feel like a part of myself was cut from me.", "aidil_muly": "😍😍😍", "_thapaa_": "People going nuts over her look... Congratulations you have missed the most important part of the post and it also proves that it's not for morons like you... US post me unki itna Sundar chehra and itni meaningful baatein likhi hai but unfortunately you could only see what your thinking could take you her boobs 👏.. Loads of love to you girl ❤️😍 You are amazinggggg keep doing what you do 😍🦄", "iamsooraj__jaihind": "🤭 o m g", "m.b.adil": "Didi ko gussa bhi krna h... didi ko adivasi bhi banna h... didi khud ko modern dikhana chahti h pr didi nudity ko modernity samjhti h .... aise kaise chalega didi", "_himaya__": "So perfectly put! You wrote what all of us had to say with so much simplicity and elegance. Cheers ❤️🔥", "ap808368": "🔥🔥🔥🔥🔥🔥🔥🔥", "chokobartea": "This made my day! Literally all the dumbass spreading hate in the comments should check their balls out cos they are not MAN enough to handle a strong women!", "anilsharma2957": "Nice hoti sexy boob's", "batullightwala777": "Well caption bare bare likhne se koi feminist nhi banata work on it neither setting and showing haft boobes", "banguuuu987": "Feminist is that stupid act of posting some what pics and writing some real damn words 😂!!❤️❤️ Mam some women's are struggling a lot in many things! But understand they are not worrying or want any rights to post pics without dress and all ❤️😂", "__gandalfthegrey__": "Word.", "_mannvi_": "❤️❤️❤️🙌", "gooxse": "Inspiration ❤️ I LOVE YOU, the way you influence us, that shit hits us hard. I'm #feminist", "vaidehi.0": "👏💗", "mohantyneha.99": "And the criticism for *showing* her body continues. The more she embraces herself, does whatever she wants to with her body, the more people's ego of being unable to achieve that mental state of being unapologetic to their choices, get triggered. People just want to bind someone with in the \"culture\" and then say \" no one's fighting for our rights and our country isn't developing\". Hypocrites!😏", "priyanka.vrma": "Word. 🙌", "saurbh_06": "To all those saying nipples dikhana is not feminism!!! Would you ever comment the same on @thejohnabraham 's or @hrithikroshan 's pictures if they post a semi naked picture?? Would you even fuckin care about there nipples???", "rathodkishor710": "Very beautiful", "better.than.pizza143": "🙌 🔥 Well Said 😍 @redheadwayfarer", "vrushali_l": "Thankyou so much @redheadwayfarer for saying it out loud that feminism is to our fights for anything we are denied with the gender bias and not a fight against men, most men get offended that we have problems but we don't have any wave to get support and and and the elephant in the room that we don't need to have achieved something anything to ask for anything we deserve equally.", "manishmwr10": "ab agar is post pr kisi ldke ne kuch galat comment kar diya toh ,samaaj ke thekedaar aa jayege respect sikhane bc", "sheetal.kumari": "Ok let me get this very straight, boobs were meant to feed babies, there can be nothing more holy that that but just because it got sexualized, people think it's right to tell girls to hide it. It's not even about you, our ancestors were more open minded just look at the temples and cave of Ajanta and Ellora, what you want are slaming on the name of Indian culture is actually never the part of real India culture, in ancient India sari was worn without blouse , blouse was, in fact, the western influence. So please please think before bashing someone. I", "___thatsunshinegirl___": "How's that hashtag 🌈???", "delowarhossainrajib": "Prostitution", "piyu3123": "Exactly!", "arvind.ramalingam": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🤩🤩🤩❤️❤️❤️❤️😍😍😍", "kajal_nagrale": "@readheadwayfare, you always always motivate.. Beautiful and Thank You!", "the_manu_kumar": "😂😂🤣", "stucksomewhere_nowathome": "You inspire me on a regular basis. Thank you for being who you are ❤️", "iamshubhamkatoch": "Respect🙌", "rishuwashere": "Why you don't put muslim community's dress while posting this kinda pic.... I chalange you if you're a real feminist......🤑 @redheadwayfarer", "vihangk04": "Love from Pune", "utharanjali": "❤️❤️❤️❤️❤️❤️❤️", "he_prasad": "Hala Gal🤙🏼", "rashidchaudharyy": "sexy", "mr_patil_4902": "काय भिकारी सारखी पोज दिले😂", "ruchik.bhatt": "I can see something.", "aditya.johny": "Gorgeous 🔥❤️", "niveditadhatwalia": "So nicely explained. ❤️", "jenajiya1": "If I post pic like this my parents will kill me...", "_rayma._": "❤️❤️❤️", "astha_raina": "Thodi Si hawa chal Jaye toh ldko k maje ho jaye", "naamnahisunahoga": "Word.", "shww.ata": "Truely said💕💕💕💕💕", "sandeep_chakrabortyofficial": "What kind of shit feminazism is dis, exposing nipples, allaround, and only in bikinis, divided apparels... god knows what she wants to prove, just exploring foreign nations and exposing the organs to stimulate, is a weird mindset... amen..", "boymorgan2k": "Ow so sexxy..ur boobs look so attractive sweetie..dat soft tit mmmmmm yummy 😘", "_._papillon_": "👏", "ayushi_pal.power": "In support of you 😍😢", "aishaansari007": "Ajeeeb chutiyaaap she's spreading in the name of feminism🤷‍♀️🤷‍♀️🤦🤦🤦", "aanchalmehta16": "@redheadwayfarer you are so honest in this hypocritical world! More love and good vibes to u", "abhishek.goswami.33633": "Chutiya h bhen k lodi feminism n gender equality k naam pe nangpana macha rkha h bs👎👎👎👎👎", "saturday_ni8": "🔥🔥🔥🔥", "rupesh50229": "After reading caption .... I thing she will be planning for writer in future 👏👏👏", "_amritaaa_": "You hate wearing bra na? 😅", "shubhanjalisingh1410": "Cum on yr sumtyms it's too much", "suha.xrehma": "🔥🙌❤️", "amaldude93": "It's good to promote feminism but according to her Feminism=Nudism and sexism.", "arjun9148": "One thing that's common in most of your posts is FREEDOM. I really appreciate for the beautiful content & related pics by which U try to convey the Msg.", "vegetanapaa": "Why not the show the entire thing and then talk.", "mr.perfect1447": "What the hell is that🔥", "shweta_patil1704": "Bhaiya ko @redheadwayfarer ko follow bhi karna hai, Bhaiya ko photo bhi dekhni hai, Bhaiya ko unnecessary body shaming vale comments bhi karne hai, but bhaiya ko simply unfollow nahi karna, Chahte kya ho bhaiya?", "siddharth221080": "Very nice 😘😘", "mohit_mohan92": "How does exposing body parts describes feminism! It shows how desperate you are for that attention!", "yogeshadmane": "nice pic", "indian566": "❤️❤️🙌🔥🔥", "vaibhavi_mulay": "#equalityact 🙌🔥", "its_aaavvvviiiii_4990": "Hii maam..plz tell me what's that thought in your coffee cup..plz tell me maam.. can't read this thought..bcz I like to saves any quotes in anywhere.", "doctorniikii": "I’m here for the comments! ☕️ Coz some people can’t just read the caption & applaud her, instead they pull her down!🙂", "joyrini": "Stunning picture", "iamashutoshsng": "Why you posted naked pictures..you have good knowledge good personality you look good...why you doing this??? I read it all the post that’s very good...they can changes someone’s view...unfortunately you write good.", "vishaalpathania": "Nice 👌👌", "shrutibali_2.4": "❤️", "ronty15": "Love how she uses the garb of feminism to promote her own self, and uses such bait photos to ensure read. #Hypocrite #Fake", "srs_harshita": "love you gorgeous soul❤️", "trishalah_": "Well written! ❤️", "juniboo1232": "🔥🔥🔥🔥🔥🔥🔥💦💦💦💦", "sushantsaklani_": "Totally relevant points! Completely irrelevant picture! ✌️", "kenny_seb55": "Can you like stfu. Don't brag about feminism just to show off your assets. Hypocrite", "kunal6969696969": "Almost every post has these long af captions everyone may think!! But wow each and every caption makes sense and this one is fucking beautiful!", "sangram_bhosle": "Words fall from your mouth like shit from ass @redheadwayfarer", "divya_kapps": "Nipples 😔", "104yogendra.mayur": "Hotbralesss🔥🔥❤️🙌", "the_august_buoy": "Jisko jaisei rehnaa h raho na,kya naak peh ghussa lekarr ghumteii rehtei ho.. feminism bol k.. Yaar tumhara life h Jo marzi karon.aur aabaad raho.. 🧘🧘🧘🏇🏇⛹️🏋️🏊🛌🛌🚴🏄🏌️👫👬👫💏👨‍❤️‍💋‍👨👨‍👩‍👧🤼", "daredevil0036": "PINK NIPPLES🍼🍼", "san_di_25": "Is she mad or what🤣", "ritvik.sharma.980967": "Thoda aur", "pradhan.rahul": "Feminism is exposing the margin of your areola and thinking that you've gained the world", "shanky.loves.u": "Just love the thing u r hiding 😍", "riteshjain540": "Any true girl or female want true secret confidential affair with me join me inbox any one i am 38 single male from indore😘❤️🔥😘", "nerdyniharika": "@redheadwayfarer feminism does not surely mean showing private parts you attention seeker.", "khanarmaanofficial": "U sooooo hot 🔥🔥🔥 😍😍😍", "arjun_singh_baghel_": "😜😜😜😜", "sasa_king_06": "I don't get it. Why do people commenting \"nipple dikh rha h\"? Why does it really matter??? We all have nipples and it's our choice to show or not. There's nothing shocking or questioning about it. It's high time we stop making tits or nipples a big deal cause it's not. Feel free to upload any part of your body cause we all are same!", "vikasravitp": "Feminism is a well crafted, calculated and executed corporate trap that's too hard to see through for all those immature ones. 😅", "a_versatile_girl_": "♥️", "aakashhaistar": "😂😂😂 u r free dear everyone is free don't pretend to be a victim", "__thedevarkonda___": "🔥😍😮😮😍😮👏🔥🤙❤️🙌🤙🙌🤙🔥❤️👏❤️❤️👏🔥👏👏🔥👏❤️❤️🔥🔥❤️👏👏❤️👏❤️👏❤️👏❤️🤙🔥🤙🔥🤙🔥🔥🤙🔥❤️🔥🔥❤️🔥", "aadi._.1": "And this is called feminism 👏", "yhalisai": "❤️👏😍🙌", "namrata.satpathy": "🙌 people should understand what feminism is, from this cation ..", "manik.kapoor.88": "Super sexy sweetheart", "sketchingdreams786": "Feminism is good but you should also respect indian culture.. your points are baseless because.. feminism is not like that women show his private parts on socially. Its only a publicity feminism👎", "lavi90p": "You look like Charlie puth. Lol", "viveksharma2326": "gud pic", "bombaybollywood": "❤️", "majidmuneer": "Thank you for this post. Sometimes the basic is necessary.", "charmingly10": "This is so true is reminder that you don't need have a benchmark to reach to in order to be a feminist. Fighting for your rights and knowing what you deserve and honestly just asking for equality is a being a feminist.", "divya_the.goddess": "For all those who are asking \"what kind of feminism is ✌️showing nipples✌️ ? \", I want to ask them back \" what kind of criticism it is that is just magnifying an issue over the most normal female body part \"? Whyyyyyyyyyyyyyyy on earth you can't get past that simple thing that it is her life , her choice to do whatever and to show whatever. Also, it's ur choice to look or not to look at what she is showing. But every time people choose to see and yet dare to judge her and make themselves feel good. U have a choice to notice her or leave her alone but what u don't have is a right to judge her. She is just making her point in her way and I believe she is doing a very good job. Par kuch logon ko dekhna b hai aur judge b karna hai ,, Aise kaise chalega bhai saab 😊??", "simransodhi_": "Beautiful 👏👏❤️❤️❤️", "kmganattra": "Beautiful facial features, Awesome candid pic, Classy comfy look, Dress looks Superb👌👌👌", "luvarora14": "Sometimes I feel ki comments disable kyu nhi krte aap on these posts especially", "saanyakalra": "Well Said! 🙌", "achyut0900": "Showing nipples is empowerment🤔🤔🤔I think men need to show their balls 🤣", "thirsty.for.love": "Looking very hot", "singh_reshit": "Whats your opinion on @zairawasim_ too hyped quitting from movies?? @redheadwayfarer", "_nidhi0808_": "Much love ❤️❤️❤️", "shrutiyapa": "Love and power to you always. I wish everyone understood feminism the way you do.", "neha.kalavati": "@redheadwayfarer you go girl🙌❤️🦄", "mohd_shan_official": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "_bhavika07_": "Feminism doesn't stand for women only... definition itself says that equality of sexes whether it is man or woman...but womens have more issues than man so they can only call theirself feminist one...we all womens have been depressed by this gender differences...and we're not gonna stop being feminist untill we create the environment of gender equality in the society we live...but here i want to say one thing to those men who also suffers bcz of gender,raise ur voice too! Cz feminism doesn't stand for womens only!", "parthk_08": "Why?", "s.a.l.o.n.i_09": "Amazing💯💯🌈❤❤❤@redheadwayfarer", "manuvk5015": "Looking cool and nice😍😍😘💋💕", "_innocent_prajapati": "❤️❤️", "sanket_khare_95_": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🤤🤤🤤🤤🤤🤤🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "bhargavrathod10": "Very well said 👍", "prabhakarsinha42": "Love you sona mmmmmmmmmuuuuuuuuaaaaa 💋", "paritosh_rayhan96": "❤️", "bhanita_talukdar": "so rightly said @redheadwayfarer ..I am tired of explaining this to many people..They forget the differnce between feminazi,psudofeminism nd feminists..Thank u for writing this post,u are such an inspiration❤️❤️❤️❤️❤️", "okeuf_tqr": "❤️❤️❤️ nipple", "mangolove1234": "👏", "jigs__3646": "#kadak_meri_JaaN_❤️❤️❤️❤️_😘😘😘__", "_ghosh_ishita_": "❤️👏", "aaqil.kagdi": "Bhen meri @redheadwayfarer kya ho Gaya hai India ko eysay feminist nai chai yai jo apne sthan dekha kr yai sb waheyad chezay dale internet pr is sai acha ek porn movie bana lo yar 🙏🏻", "shwethah_paul": "Love ❤❤❤. Some people comment about showing the boob's but then some of these people are also sending their dick pics to girl's by DMing them.", "shambhavi_130": "Girl your caption is absolutely correct but that makes no sense when we relate it to the picture u posted", "dimplekaim0096": "❤️❤️❤️❤️🔥🙌🙌🙌🙌", "bhukki.by.heart": "Haven't read anything that describes feminism more clearly. Thank you for put it out. ❤️", "zsabiulla": "Hotter shooo", "mr_rock_n_rolla_": "Ur cause is good 👏 but why show ur nipple, u can also give this message without showing that🙌", "anuragtiwari0890": "Only you can do this", "moondai.x": "👏🏽👏🏽👏🏽👏🏽💛💛", "food_bias": "Please make point no. 2 bold. ❤️", "gauravkapoor200": "So cool❤️❤️😍😍😍😍🔥🔥🔥🙌", "parthvicipative": "💯", "sonalilavania_98": "❤️🔥", "sarah.fit.24": "🔥🔥🔥🤩🤩🤩 you always put into words all the feelings we keep inside ❤️", "mani.manisha0958": "Wow.. 🔥", "shivangipahadiya": "Incredible 😍", "tanvigarg03": "This definition of feminism is so right . For everyone out there who think that feminism means that we want to become better than men it's not that . Please do read the caption. Hats off @redheadwayfarer ma'am 🙌👏👏❤️❤️", "iamhrdk_devani": "❤️🥂", "skylife7480": "🙌 Close, ooh Oh, so close, ooh I want you close, ooh😍😍", "ameypurohit91": "🔥🔥🔥🔥😍😍😍", "lunaticbull": "You are a rockstar in a true sense, usually don’t read long caption but 🙌🙌", "priyankaa.sh": "Your words are an inspiration❤️", "marviinnpatel": "Feminism comes in Equal Rights! When It comes to Equal Responsibilities! The escape velocity Will be greater than Speed of light!!", "roushanray99": "Ye kaisa feminism hai ki boobs dikhate raho", "sandeshkjain": "Maal🔥🔥 @xyz_pqrs", "rakeshstirredbutsane": "😍", "ad_itya4616": "😍😍😍", "fresh_prince_manoj": "Hot n calm. Nice post n caption👍", "rheamakwana": "On point @redheadwayfarer ....love you❤️", "ritik.jolly": "Stunning...🔥", "waseem_0132": "Osm", "sammal1188": "If \"Feminism\" is about \"Gender Equality\" then why it's not called \"Equalism\"?", "dhiraj___07": "🙌", "ifaisalfaiz": "Stunning ❤️", "cyborg_connor_": "Half nipp 😣 pls 😍", "roma_roy_barman": "The lines and you always create a fire 🔥 in the heart 🙌..", "ananyaaaaaa_x": "amazing❤️❤️❤️", "nishant_rawat": "I usually don't read long captions but just can't miss reading your posts.. ❤️ @natashanoel001 as well.. You both are Love ❤️", "faizan4555": "🔥🔥🔥", "rehmank01": "@redheadwayfarer follow me 😍", "s_a_w_r_a_v": "N m falllllllliiiiing in love again n again🤩🤩❤", "officialsakshijain": "🔥🔥🔥🔥🔥👏", "chauhanmuskan": "All your points are good but specially the 5th point is important for people to know 👍", "_.suprajaa._": "I love the way you voice all our thoughts 💜 Stay blessed!", "akshay_agarwal__": "😍🔥❤️👏", "manojmaaxx": "🔥"}