{"ishaan4321": "Tum logo ki maa ka bhosda... tumhari q maa chud rhi h.. meko glt lga isliye bol dia aj teri maa ko bol behen ko bol nangi pic upload kr dikha chal ab fatt gyi gaand chut bhosda... bol ishaan dekhega aj punjab ka rehne wala h pese wala h bahut sare pese dunga nangi pic dikha ab... chut dikha bhosda dikha nippke dikha boobs dikha mote wale raand ke pillo", "savvy_fernweh": "Loved reading your posts .. such strong msgs 👍☺️", "jeet_1903": "Bus kro didi feminism feminism, there are lot more things u can do to inspire people's and not only post your haf naked pics for no reason , WE ARE NOT INTERESTED 🙏🏻", "akshat19920": "It's true..what you put", "hollychy16": "@basicallyephemeral I was talking about her she writes great stuff check out her posts", "wildtrout99": "I love that. You're so beautiful and bright. I hope you get everything you want.", "imnumber31": "Just hats off Mam beautiful and amazing written....👍👍🤩🤩🙏🙏🙏🙌", "civani_r7": "This is not feminism ths is bullshit 🙄", "pratikshathapli": "@g_u_n_j_a_n__k_a_u_r read the caption", "vaishhh.__": "@redheadwayfarer please someday take a chance to talk with muslim women and talk for them. They are not even allow to wear jeans you don't have guts to talk about their community right. You can only talk about roaming nude, visiting temples during periods but not masjid.", "unique_sparkle_": "More power ❤️", "ca_ch_et": "@redheadwayfarer so according to you rules are bullshit, discipline is bullshit? If everyone start having their own definition of freedom then who will keep a check on bad people? What about terrorist? Their freedom is in killing you. What about rapist? They will consider freedom in raping someone... Have you ever considered this way? Rules and discipline were made to make life simple, easy and peaceful... The sad part is that when these rules are followed by some people and those who don't follow does not get punished or sometimes rules become so old that they are not required anymore and no one is changing them... With time every bad rule got mass boycott... And I'm today's world atleast in India boycott of clothes is not required to be free and feel libration.", "thesaketkukde": "People generally mistook the covering clothes as revealing clothes. 😂. IRONY", "fantasy.kiki": "✊💦💦💦💦💦💦", "karan61995": "Woww", "saurav.kr.1": "🖕", "lpu_shoutout_verto": "Bomb", "luckybyg6": "Abhi hindustani bhau ko btata hu lavdi", "suraj.raturi": "nipple", "ranjan_l.m10": "😂", "vikramkap": "Itna dikhane se kuch nahi hoga rani.", "_mansimaurya_": "She is a so much as a woman.... People in India still don't allow their daughters to wear short clothes/jeans (in villages).... Still some girls, women exist like u... I really don't know of others but I am really proud of u.... Keep it up... Be a feminist.. be a girl... And. Encourage other ladies and girls... Too...❤️ Ly Loads....❤️❤️❤️🔥🔥🔥🔥🔥", "_ansheekaaaaaaa_": "@zayn_1321 read up.🙌", "maddypics2905": "Check Recent Pictures on my feed❤️❤️❤️", "siddharth221080": "Its nice and brown 😘", "__varun29": "KOI BHI COMMENT KRNE SE PEHLE CAPTION KO PDHE AUR SAMJHE AUR SAMAJH NHI AATA TOH AAP GALAT JAGAH HAI!! PLZ JAKEE APNA DIMAG BADHAIYE..", "shrutiirawat": "Best thing I've read today 💯", "vallabh_karmarkar_": "#fakefeminism", "soniadixit73": "Indian men have such fucked up attitudes towards women. They watch hours of porn and the terrible way female sexuality is portrayed and their dicks swell with pride. A woman like Saloni shows a little aeriola, and the men lose their shit. Yeah, we know that you think that women exist for your personal pleasure and comfort, but it's 2019, men of India. Grow up and stop shitting in outrage because Saloni showed her breasts. Indian men!", "sarafradhika_1": "Cheap way of getting famous", "sagar.nandaa": "Ohk just tell me can u do this by wearing muslim religious Tshirt ? And if yes, so plz go on.... @redheadwayfarer", "qatar_desi_shoutouts": "Aaj kal kisi bhi begairti aur nangay pan ko freedom aur empowerment ka naam de deti hyn tum jaisi randiyan.... kyun k the only way u can get noticed is by making controversial half nude posts", "so.nu2082": "Mind blowing", "hardik9999p": "i like this kind of feminism.. 😍❤️❤️ 😂😂", "sagar___paul": "🤣", "priyabasu26": "@merlinrodriguez241 2nd part", "____arzoosaxena01821____": "❤️❤️❤️", "mdeskman": "very hottest pic", "bandisonalireddy1996": "Can you tell me where did you buy that top ?", "ranndeepp": "@akay.sani", "kalaivani_siddharthan": "💜💜💜", "anuj_juster": "🙏♥️🙏 Well said🙏♥️🙏", "t_any_a_c_houdhar_y": "👏", "just_another_beesly": "This is something amazing I have read in a while. The idea of feminism is not a blame game but letting us decide what freedom means to us❤️ love you for this post", "brijendrasinhvanar": "don't blame a taxi driver after posting all this nudity on your ig 🚕🚕", "milind.gharat.56": "Enjoying the rains", "shutterrnoise": "🙌", "krishnaboy11": "India mein religion aur arrogant dono hai bc chutiyapa kab khatam hoga 🙏🙏🙏🙏@redheadwayfarer", "aly_kausar": "What difference between you and animals?????", "navie.uwu.exe": "👏👏👏❣️", "how_about_sandy": "I only see a beautiful girl enjoying her time... But others only see nipples... That's how they are programmed...to think in a certain way... Its sad how people try to fit everyone in the same box... Modesty empowers some, nudity empowers some... Its not your place to tell her what she should do... IDK why clothes are directly proportional to her modesty... To me, modesty is her nature, not clothes... Sometimes i think, jo baby ko rape karte hai...unko bhi bus vagina dikhta hai...diaper ho ya na ho...", "shona_darling02": "Watta a post♥️👏 Ur each and every post is worth reading for mam♥️ keep inspiring coz somewhere someone is actually inspired by the posts like this!!💯♥️ @redheadwayfarer", "syed.areeb": "🤤🔥😍", "ab_aamir619": "🔥", "honkknoh": "send feet", "dixitajayy": "Bakbass boobs 😂😂😂", "__pardesi__": "Love those tits", "melirc": "🙌👏👏👏👏👏👏💖", "anshu__choudharyy": "Sexy picture", "arvind.honnadi": "True statement...", "gupta.souhard": "Aree wahhh...empowering women..grt...if dis is the oone nd only way to empower women...toh jitni ladkiyan...woww..grt grl..u r inspiration ka gyaan jhaad rahi h..khud kyun nhi empower hoti...daalo aisi pic...h dum????", "anu_singh897": "Wow ur words❤️❤️❤️", "sharmarocky6386": "Sucking boob's", "rrana08": "You are my inspiration ma'am...hats off to u😍😍🔥🔥💯💯😎😎", "achin009": "Screw what people say, it's your life, your choice what/when and how to wear things @redheadwayfarer", "eatwithnabz": "More power to you @redheadwayfarer ... this is the best thing I read today ❤️", "priya_ckhoiwal": "Portrayed story of many lives in a single column with words so simple yet valorous ❤️", "billiehunk9t9": "Chocolatey nipples 😍", "riyamandal_": "❤️", "sourabh5160": "Beautiful 😘", "thakur_saahab_7": "I dont understand that esi pic upload krne se how can someone be so strong / godess of hope / need more women like her ???? Just one question to you all \"agar ek ladki sweet simple sanskari type hai aj generation me to kya wo strong / goddess of hope nahi hai ?? And dont we need more women like her ???", "mygoshsomeonereally": "That nippie❤️", "manooz224": "So gorgeous😍☺️😘😘😘", "zafarwestern": "👍💗👍💗👍💗👍", "vignesh_balachander": "Revolution girl!", "faizaldq": "💟", "naeempatel748": "hey I like iti. like", "ishanbisht97": "Yaar Kabhi gents problems bhi Dekh lia kro", "shaikhhamzah8": "@hindustanibhau8808", "malharrmore": "This is not feminism at all. Help the needy instead of posting weird pictures with long ass captions. There's no point in doing this.", "the_holisticmermaidxo": "GOD I FUCKING LOVEEE YOU YOU REVOLUTIONARY JOURNALIST!!!!!💕💕💕💪💪💪👑👑👑👑 @redheadwayfarer", "yogeshadmane": "nice pic", "ramesh.v2509": "🔥", "pratik_surpam": "Captain is OK but why are you showing your nipples in every picture ... And you have to show then show both Na 😣😣", "me_imhsar": "💞", "thebitchkitten": "Love love love the caption ❤️❤️❤️❤️❤️", "punam_kotwar": "I love you❤️❤️", "pranjal912": "@juili_gore This is the best thing I've read in a while", "parthsarathi": "Bhag Yaar!!! Ish women empowerment ke chakar public place me insta hi Nahi khol Sakta one pic I ignored somehow n other got caught. Behen Jo Karna hai karo.btw jyada bhi Nahi Kar Sakti insta pic block or warning bhi dega. Merko abhi ish ladki ko unfollow Karna hai", "anuragtiwari0890": "You have nice boobs 😊", "abraa_ka_dabraa_babra": "Okay guys.... You people talking about feminism and taunting her pictures.... Clothes or no clothes.... It doesn't matter.... Why do keep talking about her clothes? It's about what she feels..... What many other people feel.... But not able to express it.... N that's what she is doin...", "metal_jacket_96": "🙌😍😮", "gunner_nik": "🙌", "flame___thrower": "This girl is a pure whore🔥", "babar.babu9999": "insan bhas os say kary kis ko aqal ho ya bat katy ki tamiz jo phali bar me kisi ko kutta kha day os ko kya tamiz bat kary ki", "prashant009797": "Nipples to dekho😍 @redheadwayfarer", "apurva_vivek": "One centimeter of female areola in sight and half the population loses its shit! What a jobless bunch of morons.", "_justanotherwallflower_": "You're beautiful in and out. Never have I been so inspired by any other person. Stay gold you strong beautiful girl. Love you <3", "mouchom_official": "Why you not using bra?", "atchaya_kannan_": "👏", "nirhav_": "😍😍😍", "skylightlion": "Yessss almost", "tanuydv18": "But the sad part is ...most of the ppl couldn't get past the beautiful picture of yours", "samkc11": "chai!!!!!", "eshwar.s.bujurke": "U LOOKING PRETTY CUUUUTE PIC 💕💕💕💕", "kumar_anoop21": "Hahaha..... Most stupid girl ever I seen on Internet who is using cheapest medium to become famous 😡 Sirf Nangapan se Women Empowerment nhi hota hai 😡 Jis desh ki 40% ladies Aaj v undereducated/Uneducated hai waha Tum jese jahil log education ki bat nhi Nangapna aur fuhadpan ki bat karte hai 😡 #Shame_On_You #Bitch", "princess_malix": "then y dont u share ur nude pics this the best option for feminism", "journalsofaghost": "I love you so much @redheadwayfarer ❤️ I am sorry you have to bear all this hate. But what you are doing is so amazing. I know for sure I understood feminism better from your posts over years. I recognised my own hypocrisy, understood what part grooming plays in patriarchy. You are so wonderful! You keep going girl ❤️❤️❤️❤️", "itsmedipali_": "Such a real caption ❤❤🌸", "iamnicks_d2": "♥️", "iam_prity": "Amazing and thats what feminism is ❤️", "prabhakarsinha42": "Nice one good i proud of you sona mmmmmmmmmuuuuuuuuaaaaa", "aakashshitut22": "🤩🤩", "jix_love": "Apka Ghar kaise chalta he kon kamane jata he... ? Nipple dikha ke do waqt ki roti mil jati hogi", "mitha.shameer": "❤️", "sahay1609": "your words👏❤️", "aakashhaistar": "Nudity only showing Ur body publicly is feminism not growth of a women u need to change Ur mind rather Ur cloths", "faaaariaaaa": "😍", "priyankapatankar": "❤️❤️", "harsh.was.here": "My only concern is you should give pic credit to your boyfriend i can tell how much he had go through one click :)", "solo_thought_traveller": "🙌❤️❤️🙌🔥🙌❤️🙌mam u are true I inspiration glad that great person like u exist on this earth!!to give people like us reason to live everyday!!❤️", "ajmal_khan_azmi_": "wow 🔥🔥🔥🔥", "smriti4823": "I dont have any idea why people like to criticise someone, they do it like its there job. Its her account, she'll post whatever the damn she pleases, its her choice and maybe she know that there are some girls like us or even boys who needs to understand this, who get inspired, and not get afraid of speaking up for themselves. Its about both male and female anyone can be a feminist !!", "sherutak6080": "Dark nipple", "vishal_kh_9924": "😎😎😎😎👏", "vnxxitaa_": "❤️🧡🦄", "beingamitmulve": "@redheadwayfarer before thinking wrong and about character of a girl we need to think about our family we want respect for out family then we should give respect to others also", "s.a.l.o.n.i_09": "I loved this💯🌈. Need more women like you🙌. There is always some or the other things that I learn from you and your captions. There is always this positivity which keeps me motivated and your captions are the best. 💯💯❤❤@redheadwayfarer", "abu_7.0": "Respect 🙌", "akanksha.bendale": "@raashi._.smh @dipti_pisharodi @sujata.17 FREE THE NIPPLE🙌", "lalit.prajapatii": "Maddam nipples dikhana Jaruri hai Kya? 😮😢", "adityagurjar9": "👏👏👏👏", "aashika_samaiya": "My mind has completely changed after reading caption🔥... Otherwise i was one of the negative commentator for this pic... Thank you🙌🙌🙌🙌🙌", "__divyaupadhyay": "🙌bravo sis🙌", "priyu.nair": "Hey.. hi babe!! I hve always followed your post.. I even have lot of respect for you. Hd earlier thought to DM u but whn u r so open n public vy to hide my reply frm every1.. the nxt time u post babe.. make shure ur nipples are not half hided may b showing fully in social media would b objectionable under sum Indian law, u would have checked once before the click or even when u posted the post, it just shows u r doing it purposefully. May b for millions of followers or likes it's not called bold it's not care free.. it's rather called carelessness.. showing it in a art film or any content whr it's relevant I would have appreciated , but dear.. this we quote as a quite a cheap post to be posted.. with all due respect.. get it girl with lots of ❤️", "namrata263": "❤️", "darshanasontakke": "It's like a fresh breath of air @redheadwayfarer ❤️🙌🙌much inspiring!More Power to you🔥", "neha_kapuur": "Hot", "_._adxti_._": "Girl u r beauty with brains ❤️", "apoorva_sohani": "❤️❤️❤️", "miss_mavour": "Respect❤✌💯", "_sushmita_sah": "🔥😍🙌", "cannedmybinoids": "And it's so good that you're using the platform to say this but people are so strong to their stupid beliefs that they'll never understand", "_krish_0021": "🔥", "bablu.13": "Woooooow", "dias.bismarck": "👍👍", "ayaskanta25": "Awesome", "nafees_saba": "❤️❤️❤️❤️❤️❤️❤️", "monaliiissaaa": "You beautiful 😍", "chetalikataria": "You're amazing fuck all the men spreading negativity on ur posts❤️😚", "iamsudhiaryan": "Do you know when womens were forced to cover fully in India?", "phoebe.autumn": "@anahata.expressions caption🙌🔥", "aanamika.sharma": "They hate you but they still watch you the most 👏👏 crazy people", "ankush9163": "saloni mam dont share something like that if u want to stend on this topic beacuse we cant forget in life that we r indians....nd its not r cultre your way is not right nd i m 100% sure about it....", "shefali_chaudhary": "So liberating!", "tetiksha": "I love you ❤️🙌", "a_versatile_girl_": "♥️", "shivani_chauhaan": "The way she blews day by day, its amazing❤️👏and she doesnt give a fuck to haters😍", "indian566": "❤️🔥🔥", "somuashishkumar": "kitnaa gyaan deti hain aap", "kt19__": "Where is that sammal guy? The last two posts are DEDICATED for that person. Kudos man, Saloni. THIS is how you bring orgasms, nipples, periods, and ALL those issues ridiculed as less important than other issues into a short written piece. AWESOME.", "wovenwordsintopoetry": "Too good. What a fact !! 🔥👏👏👏👏👏", "harshitarathod_": "THE CUTTING CHAI KETTLE 😍❤️❤️❤️", "_suyash_po": "Bold", "soupedinwords": "You're amazing ❤️", "harshuu_more": "Caption... Mind blowing 😍🔥😍🔥", "muskandua111": "Best thing read today! 👏❤️", "bombaybollywood": "🥂❤️", "bnnnnnannde": "So sexy", "pulkitarora8": "I like you", "___pixieeeee___": "You're love mahnnnnnnnn , since the day I started following you , your writing's or captions (whatever suits better) are just so enhancing , You're an amazing soul , wish you all strength , lots of love 🌸❤ @redheadwayfarer", "dr.tony.tony.chopper": "@redheadwayfarer beautifully written as usual. Btw another women spreading negativity on your post are the most toxic people on planet earth. Stopping one women to grow being one yourself is as good as a sin. You stay strong. The social media is meant to give out your own statements. If one disagrees....can learn the good way of life. God bless you bro.", "brewed_thoughts_": "👏", "ganeshsonawane652": "Saloni 👏👏👏👏", "_riya_rasheed__": "❤️🔥", "kritikhanna23": "❤️", "mr_.allrounder": "@redheadwayfarer 🔥🔥🔥🔥🔥❤️", "geetanjali_adhikari": "I just see a girl like me. Nothing vulgar or nudity.", "shanky.loves.u": "😍😍😍😍😍", "guru17001": "* Jai Mata Bhavani, Jai Mata Rani, Om Sai Ram The great devotee of Khushbari Mata Rani, the world's famous Jyotishcharya Pandit Guru Dutt will also give you astrological information and solutions to problems, correct solutions by astrological law. whatsp your problem on 089-555-457-42 get your love Family Problems, Problems in Husband Wife, Love Problems, Job Problems, Business Problems etc. Proven Measures That Will Make Your Life Happy and Trouble * Send your problem to Pandit on 89-555-457-42 Consultation Fee - Rs 150 only", "prarthnaadhikari": "People take time out of their lives just to make someone feel bad. She writes all these beautiful things and not one of these morons read it, they see a picture of a woman with a bit of a nipple peeping and they get triggered like their mother never fed them from hers. They'll comment 'bhai kya body hai' on a 80% naked in picture of Tiger shroff or Hrithik Roshan, they'll worship half naked Kali Maa but God forbid a woman tries to be herself. God bless such people with a sane and peaceful mind. Peace.", "priyanshi__singh8": "You are an inspiration!!❤️❤️", "__sahilnair__": "@keyaadyalkar....her words are freaking amazing ❤️🔥", "satish_gahlot": "Looking uffgg", "matt_murdock11": "Keep continue with ur version of feminism.. it gives me boner and to hell with feminism of MC Marykom, Kiran Bedi, etc... their feminism sucks as their feminism compel us to question our role for social equality. I love ur feminism its hot and makes me horny .. good going girl love ur titts and nips 🍆💦", "neeraja.v.joshi": "To be a feminist one does not cross limits of decency. It is not about trying hard to prove that \"yeay, i am a woman who can do everything a man does\" as it will be a shallow interpretation of feminism confined to external outlook. It is more about being confident in your womanhood; feeling no need to actually prove it. What you do with your life as a whole will determine feminism and not merely posting such content. Being an influencer (?!), please be careful with what you post and what impact it might have on people who adore you. @redheadwayfarer", "muddassar_sheikh": "Shut", "jewel_ocean_": "Hello We sell 92.5 silver jewellery. World wide shipping Please revert back to see our exclusive latest collection.", "sanket_khare_95_": "❤️❤️❤️❤️❤️❤️❤️❤️🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "dramatic_shade_s": "Best thing I have read today Hats off to you girl 👏", "alka____yadav": "❤❤❤🌼🌼🌼🌼", "sunnysharawat": "❤️👌🏻👌🏻👌🏻👌🏻", "riptighosal": "👏👏❤ JUST SPELLBOUND WITH THIS SERIES ABOUT THE DEFINITION OF FEMINISM ❤ so so so damn true...😌", "toofaani_tau": "Lovely nipple😍", "harshlalwani8": "Are feminisn ka hi natak krna h toh pura nude dikhao na.. Ye thoda thoda ky dikha rahe ho..", "malvii_bhagchandani": "👏✔💯", "aman._0212": "Hi u in mumbai can i meet u", "drishhtti": "your caption inspires me so much omg", "bansheeindisguise": "It is very interesting that all some idiots got out of this post is nudity and nipples. Jesus. *eyeroll*", "dakshasharma_10": "This is the best thing I have ever read🙌🔥", "psyme_": "You make it sensible", "kanikaprakash_": "🔥🔥🔥👏👏", "m_manisha9": "Very well said!! 🙌", "sarikamrao": "🙌❤️", "ss_chakravarthy": "Love that tea pot 😬", "vishalarora159": "Nipped is aout", "intrepidboho": "Take a chill bitch", "nikhilpranika": "Why u explaining the world..let's roam around everywhere nude... End's the feminism", "charitra.sree.senthil.kumar": "This is perfect ❤️❤️😍", "ruigveda": "Wow! So well written❤️", "unbothereddevu": "👍👍👏👏👏", "the_jay_rudach": "@redheadwayfarer 😍😍😍", "_feelings_truelove_": "Can i get follow back", "amanraj02": "You are a good narrator", "suk_anya": "The girl that wants to wear short dresses on streets without being molested. ✌🏾", "gods_galll": "Well she knows how she can grab attention not only of boys but girls too..... But you know wat your feminsm is short term as soon as you go old this feminism won't work any more 🙌🙌 and tat time you will get addicted to these fake feminsm attention popularity and i am scared tat you can go mad because of this ,,so in end am saying hoarding feminism is gud but at this xtent!¡ behen tum to feminsm ke naam pe nanga b ghum logi now all her fan following curse me say bad words 😂😂", "samiistella": "Wow girl!! 👏👏", "rrohitgohar": "❤️🙌", "aliamailk20": "❤️", "medhasarkar__": "❤️", "rahul.thorve": "🔥🔥🔥🔥", "bb_breaking": "👏👏👏👏👏", "shheyaa": "This is soo amazing to be true, a hope for every girl and a woman out there to be strong❤", "abhiroop_bhatta": "@momma_miss_s", "vishal_rathore_007": "So beautiful looking gorgeous😍", "sowj_anya": "😘", "nidhijha98": "This is the best thing i've read today. ❤❤", "triptidodani": "Bold and beautiful🙌❤️", "bhat_saqi": "I ❤️ you", "crownedecor": "Wow just wow 😭🔥❤ The woman in her mid 20s that doesn't understand why her nipples need to be covered when a man's dont 🙌🔥", "pray_here_2021": "❤️", "an.any.a": "❤️❤️❤️❤️", "aishwarya.pandit": "Well said!!!", "dews_n_droplets": "Wow🙌", "manisha.georgina": "Interesting...", "jigs__3646": "#kadak_meri_JaaN_❤️❤️❤️❤️_😘😘😘__", "bhukki.by.heart": "Thank you. ❤️", "lamataj": "👏👏", "its__rakhi": "You are an inspiration❤", "utharanjali": "💯❤️", "x.o.x.o_mcqueen": "you are my inspiration❤️", "_the.lucifer": "🤣🤣🤣🤣🤣", "amritmalik04": "❤️", "akshata_maurya_": "Ammmmaaaziiinngg 😍❤️", "chokobartea": "We need more women like you! So strong..i mean literally soooo strong!", "deadnazi_": "Very inspiring..", "rathodkishor710": "Very beautiful", "gooxse": "Hey inspiration! Love you ❤️", "charmingly10": "This makes me feel good for one reason. I can still be a feminist after being a girl who is scared to step out in the fear of being harassed today.", "ramanromi_": "🔥🔥", "nith_ya_shree": "U have my heart! 💯♥", "prashantlade4": "❤️❤️😍😍", "anwar_laskar": "Love n respect for this lady... She is strong fierce n she represents India", "swagata01": "❤️❤️❤️", "gunjan.melwani": "Uh r truly amazing🙌🏿💖", "anilsharma2957": "So sweet sexy boob's", "ap808368": "👻👻👻👻👻👻", "sunshine24surbhi": "@redheadwayfarer your thoughts are magically🔥Freedom is progress tht one should understand. Your ideas and thought process is far beyond inspiration. Just wanted to tell you here Ms. Chopra when I joined Insta(after getting forced to come up by my students),I think very few profiles I saw n urs was one of urs....n it was superb finding a woman like me on the other side of media in terms of thoughts✌️Way to go @redheadwayfarer . Keep inspiring and keep rockinn Girllyyy😍😘🤘", "jawwadahmadbhatti": "You are right but woman looks beautiful when she covers herself. It enhances her beauty otherwise man is in incomplete by nature and therefore our desires are unlimited. Nothing is perfect therefore everything lost its charm when it exposes to much. I hope you would understand. ❤️", "swarttish": "The 8th point is the fullstop!", "alwayswiththebagpack": "I have never commented but I loved the ideas and thoughts of yours and whatever you wrote whether it be this page or your couple travel page.. it's amazing but this caption amazingggggggggggg. People who question the word feminism or even those who think they know, must give it a read❤️", "zck_d_souza_": "So true.. so pure🙌", "lavlavlina_": "🙌 💯", "amir.sab.3572": "🔥🔥🔥🔥", "som_chebolu": "Well said. 🤘", "vrindaadixitt": "Woah. 🙌", "canyoubelievethisguy_": "Lagta hai barf padne wali hai...", "richayayay": "❤️❤️❤️❤️", "m.b.adil": "Didi aap to ajanta ki murti lg rhi ho😂😂😂", "stylesavitri": "So true", "massimotornello": "❤️❤️❤️❤️", "queen_of_monsters_nidhi": "🥀facts...👏🔥", "ad_itya4616": "😍😍😍", "kadambari_anuannal": "👏", "sachikumar": "@piyush_harwani", "pari.selenophile": "Masterpiece babe u blew my mind ! With this write up ! 🙌", "_boroe_": "❤️ you and your words just keep me going on in day to day life🔥.", "ase_loha_tina_plastic_khali_bo": "Boobs", "saanyakalra": "Amazingggg💯 Damn Trueeeee🔥❤", "_yuthika_speaks_": "Sooooo on point... more power to you😍😍😍", "shivyasaklanii": "❤️❤️🙌", "bhargavipp": "True what you put. 🙏", "divyasharma4639": "Touchedd 💜❤ 😘💘 ily..so relatable...", "samir_jo1996": "Showing nipples is feminist thing 😮", "oneliwhaaat": "❤️", "sketchingdreams786": "Big dislike👎", "r.yewale": "Nice pick ❤️", "sliceofmylyfe": "The feminist manifesto", "_danish_shan": "So cute 🤔", "_shwetakolekar_": "India needs you @redheadwayfarer we're soooo proud of you", "pauladrija": "@adrita2947 read", "namish_sahu": "Wao", "golu9194": "Waw🔥🔥", "rohitxsakpal": "❤️🖤💚", "stardom_admirer": "@redheadwayfarer beautiful", "faizan4555": "❤️", "shrutibali_2.4": "❤️❤️❤️", "the_hippie_head": "U r a goddess of hope❤️"}