{"simonereillly": "I just finished! It had Mindy written all over it and I enjoyed the mini series sm 😍👏🏼😍👏🏼", "grahman22": "@shawn_hughes94 crying", "t4r1_l1ge": "Can’t wait to watch this", "14sunshine70": "Having withdrawals 😭😭😭", "tackittanimals": "U look so pretty in dis!!", "maestra28": "Omg!!! I just finished watching it!!!! It had me in tears!!😭❤️ please make a 2nd season! @mindykaling ❤️❤️❤️❤️", "carleenlikes": "I loved it so much. Watched the whole season twice!! Pls tell me there’ll be a Season 2 🙏 @mindykaling", "prettysalesian": "OMG just binged and LOVED every minute of it !!!🔥🔥❤️❤️🙌🙌", "jigam27": "@mindykaling I just binge watched it too!!! PLEASE MAKE ANOTHER SEASON!!!", "iamjessibelle": "@raestang @killinitwithkj SEASON finale, not SERIES finale!? 🧐🙏🏾😱😍🤩🙌🏾", "jfstree913": "@mindykaling Thank you so much for making #fourweddingsandafuneral it is fantastic and helped through the quarantine.", "teese1021": "So good!! 🌟🌟🌟🌟🌟🌟🌟", "liveprettyco": "LOVE THIS SHOW!!!!!", "stayseeliz": "The scene that was remade from Notting Hill made my day!! One of my favorite scenes ever!! Love this show! I’m hoping for more seasons!", "yaya_roxy": "Hi Mindy! Ok, I’m a late bloomer.. just started watching “The Mindy Project.” My daughter highly recommended it, and I’m glad she did. Next, will be “4 Weddings and a funeral.” 💛", "sabrijeshemo": "Look at how cute you are @mindykaling 💜", "hpmoreno": "The BEST show I've seen in a long time!!! Loved every episode and I miss the characters already @mindykaling", "carolemoran502": "Finally premiered here in Canada. Watching the first episode and already in love!!!! So excited and can't wait to see all episodes. It's like Four Weddings and Love Actually all rolled up in one but completely brand new. Thank you!!!!", "jeannieramlu": "LOVE the show - just started as it’s just now available in Canada - I relished in the first episode! @mindykaling you’re such an incredible talent!!! 🙏🏾😍", "trep7902": "Girl this show is everything! Thank you! More please. You’re a goddess!", "dijahenry": "I LOVED IT! I even got the hubs into it!", "allyswayzee": "We need a season 2 @mindykaling @hulu 🌹", "pt125": "I’m OBSESSED 😍", "sigrid.m.n": "Season 2 🙏🏼", "lizzie_pie_rocks": "I loved it and just watched #LateNight!", "atashajamesdc": "You did it again! In tears over here", "sabhahbas": "I can’t stop saying CRAAAIG. It might be our child’s first word 😬 @ramziabd99", "ha_nguyen18": "👋 @mindykaling ! I love this show! My favorite rom-com! I’m on episode 9 and don’t want it to end! Please let me know when Season 2 will be out! Would love to meet you in person! #AlreadyMissingAShowIHaventEvenFinished", "yanitsa": "Season 2?!", "liverloo": "It was amazing!!!", "lydfan": "When is season 2 coming???? 🙏🏻🙏🏻🙏🏻", "daniellesouthcreative": "Love you", "enzafab": "It was soooooo good!", "cgermm": "Just finished it with my hubs and it was amazingggg wish it wasn’t over", "thekittchen": "I loved it so much and now I miss it! We want more ❤❤❤", "islaminthemodernera": "Wasting paper 👏", "chickitybae": "❤️ Love love this show", "msimelda": "Please we need a season 2 🙌🏽🙌🏽🙌🏽 love this show 💕💕💕💕", "carlawells_creative": "Just watched the finale! Couldn’t stop laughing and crying. @rebeccarittenhouse was awesome too! Keep them coming :)", "laz585": "Loved it!! 💗💗 Season 2??? 😊", "meldhowell": "Soo good!!", "happy_nada": "Binged it all in the last 3 days! And I need more! It’s everything!! Thank you for bringing the rom com back!!!!", "pavithranagarajan": "Loved the show. Exactly what I needed during recovery after giving birth a couple weeks ago! Thanks! ♥️", "clvolp89": "Season 2....please please please!!", "travel_lifestyle_101": "Please bring back another season!!!", "the_vickivick": "I just finished the finale after binge watching....good thing I was by myself 😭😭😭 everything @mindykaling touches is gold 🌟I never saw the movie and it doesn’t matter because the show is perfect and the acting is 💯 ♥️💛♥️", "kmacsarge": "LOVE LOVE LOVE the show!!! Fingers crossed for season 2!!!! PLEASE!!", "alyssaherczegh": "New favorite show!", "tansidhu": "Bruhhhhh so many feeeeeels", "chhaic": "I loved this series! Gave me hope about romantic comedies!", "naomideviny": "Like season finale?! Please say there are at least 10 more seasons!?!!! 🙏🙌👏❤️", "kat_markowitz": "Loved it! Hurry back Season 2. 💕", "sensiluvguh": "Late to the game. But wow. Four weddings and a funeral was beautiful and beyond worth watching a story about different forms of Love. @mindykaling thank you once again.", "jajessop": "💕💕💕 The show! Please make the viewers happy and say there is a second season!", "anniek8te": "@mindykaling such a beautiful and positive show we need, thank you. After stressful jobs and lives, me and my girlfriends live for this show ❤️", "ckennedy4211": "Husband and I just finished it!!! Sososososo good!!!!!!! 🤗❤️❤️", "jefferson510curio": "From one writer to anothet, may I share with you a snippet from my newest release in order to obtain a review?", "kiabenion": "I absolutely loved this", "avantikaaxx": "💜", "tinab2": "So good! Almost as good as the pilot of the Mindy project! ❤️", "mnz0215": "I cried profusely watching this show, can you be my mentor? I want to write... so much diversity on your characters and yet it works... I am very happy with your awesome creations... looking forward to the next ... PS I laughed and cried as hard on your “Late Night Movie!”", "shellbell_426": "Loved every moment of this show ❤️👏", "elif.karol": "I LOVED the show and the finale especially! The Kash changing seasons scene was beautifully shot and such a detailed yet modernized homage to the original. The colourful holi, Kash's little bro with the girl, the man giving Kash a scarf...loved it all! @mindykaling and creative team, your attention to detail and wonderful easter eggs were so much fun to discover...throughout the entire 10 eps. Thanks for feeding this rom com fan's appetite and keep up the exceptional work! P.S. Love and Basketball is my favourite movie, so you KNOW I loved the \"Monica\" costume!!! 🏀🙋‍♀️👌😀💛🌍🎧📺🎥", "the_best_from_cpcrew": "❤️❤️❤️❤️❤️", "ansley_snaps": "Please make over all of my favorite rom coms!", "rachhuerta": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "mcagius": "Season 2 please...", "theorganizerdc": "Will we be able to buy it on Amazon?", "1emgi": "🗣Yo Fam this shit is #Super #Dope Fam...Keep Letting Ya #Hunger Take #Control 💯🔥👌🏾 #Emgi", "jtate2586": "The Notting Hill sequence with Kash was perfection. Please don’t ever stop making great art @mindykaling", "mrsgrizzlie": "This show was amazing", "anisamistry": "❤️❤️❤️❤️❤️", "mika_simba": "Wow... @mindykaling 😢 Way to go making a grown man cry with Episode 4. Though the 🐶 at the gate was the kicker. Loving the show.. not as girly as I expected.. plus you scored the best possible lead in @nathalieemmanuel .. along with ofcourse the others and a great supporting cast! 👏 it's 6am.. prob should stop binging and sleep now though 🤔", "keziah.beth": "And thank you so much for using all the amazing British actors that you did!", "bkmiller23": "Great show! I'm currently binge watching and can't wait to tell all my friends about it In case they haven't seen it!", "eliza.elspeth.c": "This is the rom-com epic we all needed, I’ll be watching this show on loop forever! I hope you keep making these perfectly funny, heartfelt, heartbreaking, comforting in the best way tv, movies and books!", "lareker": "Thank you! Thank you! - For this incredible show. I just moved across the country which has not been an easy transition - and it’s been such a wonderful, smart, funny escape.", "neenstar9": "I just binge watched this and didn’t want it to end! Thanks for this show - I felt like I was watching a Love Actually TV series 🥰", "sanchezk79": "My new favorite!!", "katecucco": "I can’t remember when I last loved a show so much. Thank you ❤️❤️❤️❤️❤️❤️", "sarah_asare": "Amazing show!!", "mommyboss4three": "Well done Mindy. Well done.", "neuaura.s": "You should wear your hair like this more often.", "iam_fabianaher": "So beautiful! Can’t wait to see this.", "katemesman": "The season was wonderful!", "kissedby.tee": "Season 2? PLEASE", "houstonianpetson": "You don’t show the date", "v.renee.h": "Loved the show!", "harikasingh_19": "Why'd you waste so much paper? @mindykaling 😭", "roxybaaaby": "What’s the song at the end of season 1 episode 5!!!! 🙏🏽🙏🏽🙏🏽", "heccabeccama": "I loved the series! Thank you for creating it!!!❤️", "lady_schwabee": "It’s my favorite show it’s brilliant!!!!❤️", "tarab423": "Will there be a season 2?! Loved it so much!", "bobbychristina": "NOOOOOOOOOOOOOOOOOOOOOOOO", "jeev_art": "😍😍😍", "fantashtic": "Where the eff is your sweater from?!?! It’s soooo cute!!! ❤️", "rachdavidson1": "PLEASE BRING OUT A SECOND SEADON♥️♥️♥️♥️", "butterflybrittany": "The cutest 😍😍😍", "neonhead34": "@sadinaz_madar you look just like her!", "mintzy22": "@emilymintzzzzz fine print says season finale", "mgarayy": "this scene had me bawling 🥺😭", "mxs_610": "Please let there be a Season 2!!! 💞✨", "angelique_711": "Finally started it and it is amaze balls", "_ofthetower": "Omg!!! It was great!!! Let's get more episodes! I can totally see spin offs or a whole sitcom that follows entire cast! 😍👏", "lizsk7": "@mindykaling please bring season 2!! I love it!! ❤️ I’m rewatching 💙", "cole.mari": "💗🙌🏽 Yes!", "lolade80": "Love love the show @mindykaling", "taksista69": "❤️❤️🔥", "nlembuono": "My best friend @jess_camps_ and I loved this show so much it hurt! A hilarious love letter to rom-coms, so awesome we never wanted it to end! 👏🏼💖🎉", "_annhamm": "@mindykaling one of the biggest struggles in my life right now is do I watch the finale this very moment or wait so that it won’t be over yet 😩😭", "nourishinglifebyjes": "I loved it!!!", "gpacecca": "Loved it", "shauneensaucedo": "I’m on Episode 7 and love it so much I’m going to cry when it ends!", "samtad4": "Loved the show! Ainsley’s wardrobe was 😍😍😍😍!!!!", "christy.sorrentino": "Love love loved it!!!!!", "roxy_of_lorton": "Such amazing rom com tributes. Please do a second season!", "nshyn121": "جون میدی برا.؟؟؟", "jessreedd": "@carolyn303reed", "segn": "@mindykaling @fourweddingsandafuneral loved the show and the Music though!!!! Pls post the rest of the soundtracks please pretty please!!! Oh and season 2 please 😘😘", "jcn0004": "Best show ever!!!!!♥️♥️♥️♥️♥️", "mosaicwithmia": "@zivsy", "xo_trilljill": "So when does season 2 come out?!?", "bougiebrowngirl": "Oh em gee soooo good #obsessed I 😆, I 😩, the ending 😍👏🏾🙌🏾", "herroyalhaley": "On episode 7 right now! 😍 Please pick up a season 2 @hulu 💕💕💕💕💕💕💕", "janjan_sweets": "I binge watched it last night! Loved it! ❤️👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "heavenrwarner": "@mindykaling love this show", "kikilovely4": "Why are you my favorite person in the world and we haven’t met.", "amthomas821": "SOOOOO AMAZING!! Thank you for such a great show!!! 💓💓💓", "alycia_dm": "Wish it wasn’t over!!!!!! ❤️❤️❤️", "mslblue_": "Your make up looks great!!", "onblueskies": "@mindykaling you got me and my twin sister @victoria.julian.basile watching miles apart while each of our 4 toddlers are all in bed and texting how much we love you and all the complex and funny things you write for us all to enjoy. It was a beautiful and hilarious production! 💕", "jennabert": "Thank you for making me cry and happy cry and just all the feels with the last episode!", "ajmiger": "Just watching it now. Bashir spin-off please!", "l0velee_g": "So is there definitely a season 2??", "maryelizabethco": "Love the show!! Need another season", "josefinekurbitz": "Three episodes in, I LOVE IT!😍", "rizgalowell": "😭😭😭😭😭", "carvermarrero": "@brig.m.t", "minatsu995": "💜😘", "emarieag24": "@nataley_j she said season finale, not series 👍🏽👍🏽", "jaykickin": "You’re voice is so fucking annoying, I’d rather listen to @realdonaldtrump stumble through a talk on quantum mechanics, and then let him smash a fuckin hamburder in my face than ever hear you utter another single syllable. Jesus fuckin Christ, you make me want to hurl myself off of the highest building onto the largest safety inflatable, just so I could feel the joy of having to die and never see you in anything again, but not actually have to sacrifice myself for that.", "sharshar1220": "omg, I started watching it and I absolutely love it!!! I don't want it to ever end!!💕", "__janelledawn__": "@carmen_hilbert omg you have to watch this!!!!", "bamfsam": "@brimccauley you need to watch this!!", "kego21": "Loved it so much!!!! ❤️", "_shania_k_": "@snehakadiyala I need to watch this!", "aggie_dreams_a_bit": "Is there no season 2?", "hazelheatherwoo": "Um the season changing #NottingHill montage? 💟😭💟😭💟😭💟 thank you!!!!", "jibadekhalilhuffman": "✨👏🏽💫❤️", "cheyn_everydayhair": "I love your style! You wear the most colorful clothes!", "mcbride_magda": "Oh girl you are a TRUE romantic! Just watched finale! Perfect! 🙌❤️", "4_eveir": "استمتعوا #كود_خصم من #جولي_شيك 🔥🔥🔥🔥 (TWR15) . .#كوبون_جولي_شيك #Coupons . Enjoy a discount code 🔥🔥🔥🔥from #JollyChic (TWR15) ❤️❤️❤️❤️❤️❤️❤️ استمتع 🔔🔔بخصم 30% من #نمشي باستخدامك رمز الكوبون [ RFVYQGM ]عند إجراء طلبيتك الأولى. #كوبون_نمشي #كوبونات_خصم", "i_am_yali": "Just discovered it - can’t get enough! Such a gripping show. 👏🏼👏🏼👏🏼", "jennkresp": "My daughter and I love it!!! 😍", "suzannefondse": "@hayleel you know what to do", "karielizag": "My favorite show!", "trisaratops887": "Second season!!!!! 💕💕", "realjessnichols": "@mindykaling you should be very proud of making the most amazing Rom-com ever. Four weddings and a funeral is absolutely perfect.", "candidaruesga": "I cannot even handle the thought of this show being over 😩😩😩😩 loved every single moment. Thank you! ❤️", "hellish_mockery": "I love uuuuuu❤️", "dr.aditinerurkar": "Congrats! And you look gorgeous!", "substancebeauty": "Love the show! My fav! 💜💕", "lizfrowny": "i miss it already :(", "msanahazel": "I want more 😭", "ladeebart0511": "Amazing show. Does it have to end?", "sarahemilyn": "Soooooo goood! ❤️", "kladams82": "So sad it’s over!", "vjett19": "Season 2?!?!", "producedbyquan": "So cute 💕💜", "susanintennessee": "Watching the episodes now. Well done. 👍", "ali_jack": "Loved it! Also your pink lip and hair...💕", "thatamandadaniels": "I love this so much!", "ella.c.cooper": "@mindykaling hard to describe what a true joy watching this show has been 😍😊☺️- thank you for this!!", "nerdgirl130": "Forget limited series, I want more! I love these characters 😍❤️😍❤️", "sspringston": "Obsessed", "sarahoskins22": "I LOVE this show so much ❤️❤️❤️❤️ @fourweddingsandafuneral", "blk.mom.magic": "First off, the Bill Withers \"aint no sunshine\" rendition was amazing 😍 Second so is your lip color. #Flawless", "kitty_kat_meowwww": "My fav show rnnnnn sad this season is over 😭😭", "lapandamew": "Just binge watched 😍❤️", "nikkij55": "Very awesome show", "anphanda": "THIS IS THE BEST SHOW ON TELEVISION please make another season!!!!!!", "briedemott": "I loved this series so much! 😩 The love stories were sweet, and the friendship love stories were even better!", "suestellick": "Loved the Notting Hill reference! Especially the updated song!", "daniellebot3": "@letishadawn", "melissathile": "Aww was hoping for a season 2 announcement", "tea4dnj": "Brilliant! So are you going to continue with the storyline? Please say yes. Would love to see Kash and Maya make it to the altar too!", "abigailzsenai_skincare": "Loved so much 💓💓💓", "mixify_beauty": "Season 2??", "sarahsueann1": "You’ve got to write ANOTHER one!!!", "elsolvidafuntours": "👏", "thomas.petrasko": "You are adorable and talented as hell⭐️⭐️⭐️", "obijungkenobi": "Season finale! 🙌🏽❤️🙌🏽❤️", "khowcroft62": "cried watching the finale 😭 thank you for this wonderful show, loved every episode and every minute😍❤️", "hypo_to_happy": "GORGEOUS", "kavisharm": "YOU are a FUCKING GENIUS!!! GENIUS!!!! Such an amazing SHOW!", "shamilafinejewelry": "Loved it! I will miss my little splurge! Hoping for a season deux?", "hp12112": "Only wish there was more!!👏🏼👏🏼", "shannonchanele": "I absolutely love this show ❤️😍", "eh.sanders": "@karlalm", "iam_nishaashwin": "Thank you @mindykaling for creating @fourweddingsandafuneral for us 🙌🏻😊", "scream4bri": "First of all you look AMAZING! Your face is beat. And I’m going to binge watch this this weekend as the romcom/mindy fan I am. 💓💓💓💓Love you !", "teebee75": "Love that sweater!❤️", "kevanonymous89": "Marry me?", "hereis_sabrina": "This was SO fucking great @mindykaling 🔥🙌🙌🙌 👑 Didn't want it to end 💖", "thatgirlrhi_": "🖤 Our queen 👑", "4ustin_ford": "Cringe af", "aprile_bunny": "@mindykaling ummmm I love your shirt! 💖", "kgs526": "Love it!!! 😍🤗❤️ I want more!!", "bltonya": "@cchurd did you watch it yet??!", "aim.ware211": "You are the coolest freaking person!❤@mindykaling", "talimachi": "Such a fun show 💝👏 Great job!!", "lizbeth.vqz": "I loved this show!! Thank you Mindy! Love all the work you do ♥️", "yashicabipulprasad": "Can’t wait to watch the finale.", "helenclarke7959": "My husband and I loved this show. We’re kinda Mindy fanatics in general. Oh yeah. We’re 70!", "tanikatrice": "Thank you for such an amazing show!", "madamebrady": "I need a season 2. Need it.", "maryse_groen": "@duanevd @jannekebokkes @frenkdetenk @hannahekkert ze aapt ons na!", "dianatraydon": "SO good!!!", "jilltrainerlcsw": "It was great!! What’s next?", "katie_mills08": "I loved the series! Thank you for a feel good summer series :) it was perfect!", "aaarel_": "Just when I think the last episode is my favorite episode, the following just beats it!! I love this show!! @fourweddingsandafuneral 😆😆 #season2please!!", "szellipour11": "Loved it! So good!", "b2bharmony": "👏👏👏😍", "bethparker24": "Just watched the finale last night and I absolutely loved the entire series! I wish it didn’t end!", "workingmomvi": "Loved it! Enjoyed the reference of other movies! And fell in loved with these characters, all of them! Abu❣️ @mindykaling @fourweddingsandafuneral", "erasuregirl": "IMDb says there are 2 more episodes 😢", "dulcepatty": "Loved it! ❤️", "kirbyrhodes": "It was SOOO GOOD!!! When is season 2?!?!", "lmlangzton": "I loved it so much. You’re the queen. Is it going to far to suggest a Kaling take on Notting Hill 😍😍", "bbokenkotter": "Yea!!! Can not wait to see it.", "brookebyers09": "LOOOOOVVED!!!!!! ❤️ (and now I’m sad it’s done)", "klynndrake89": "I'm so excited and sad about this! This show and the actors dynamic is seriously the best! ❤️❤️❤️", "emgee1985": "I cried a few times while watching the finale. Loved it! Thank you!❤️💯", "meggieml__": "She said SEASON finale! Not series! There’s hope! @lordford221", "peggaliciousss": "We ABSOLUTELY loved it @mindykaling great job congrats to everyone on a job well done 👍🏾 ❤️👍🏾❤️", "shiner_htx": "❤️❤️❤️ this show! Great actors and story line. Didn’t know I would shed a couple of tears.", "redylette": "🔥❤️", "corinnewcurry": "It was so good!!", "bavdingo69": "Loved it, would love a Christmas special", "jordanacooper": "I loved it more than anything! I’ve never cried and laughed so much in 1 hour! The finale was PURRfect😻😻😻", "mcgowansus": "Fab finale!! Loved every minute. More @guzkhanofficial in any of your projects, please! He’s brilliant, innit?", "nyralee": "Make more!!!!!", "annabananzaz": "I loved the show and the finale was EVERYTHING! It made me laugh, cry and gave me all the feels. I ❤️it! @fourweddingsandafuneral was a great show!", "bichongal": "Love Actually throw back", "diggsstudio": "Yes! Bring it backkkkk!!!!!", "elenajoyal0528": "Love love loved the series!!!!", "kendalleleanor": "Thank you for making the ending everything I was hoping for", "splitscreen1": "Too stinking cute 💖", "cckdc": "Do it again! 😍😍", "emilytmusic": "Check out my song “With Love” @emilyandthezealous", "marianalanabanana": "Best show ever @mindykaling", "anasyoma": "@mindykaling This has been the best show. It makes you laugh, cry, and empathize with each character. I am on maternity leave right now, and I have already started rewatching episodes. Thank you for creating a show that represents dynamic people of color. 💕", "mollsr82": "I loved it❤️❤️❤️", "sona310": "It's the best show I've watched in ages. Even made my husband get emotional 💜🎉", "mchellebergeron": "TO ME YOU ARE PERFECT @kearamaureen273 😭", "happyperla": "I can’t wait to watch it! The show has been so entertaining!!", "kayteeemm": "Loved the Pakistani rap version (I am assuming) of “ain’t no sunshine” Notting Hill scene", "maryyogz": "❤️❤️❤️", "rindonesia": "It was so perfect! 😭", "ohhanalei": "@sabrinadianejen omg", "carol_camargo": "@dani.ortega__", "amberineee": "It’s my new fave show!!", "gmbeck1999": "Love u and love the show!!💕", "he_gentleman": "I love the amount of redheads your new show has.", "crkeenan": "I cried throughout the ENTIRE episode. SO sweet, fun and perfect ❤️", "mshaggs": "Will there be a season 2?", "jillreizen": "Soooo cute! Give us more please.", "carm3no": "You look amazing!!!", "morganmoore86": "Perfect perfect perfect! 💗", "lllxxii97": "❤️❤️❤️", "ray_srijeeta": "@auxcniey she's so ridiculously pretty I don't even know what to say or do", "theemakena": "i just finished the last episode!!! im in tears!!! 😭😭😭 That was so beautiful. Ohmahgawd we dont deserve you", "jeniford17": "Omg your sweater!!!! 😍 WHERE can I find one!??!", "ebun.adegbite": "we want season 2", "memphisvolgal": "Love the show!!!", "shaedreams": "The finale was everything Mindy! What a gift the entire show was. Please give us a season 2 with the same characters and please give Zara @sophialaporta more scenes or her own show because she was amazing!!!! @hulu", "kiacole87": "I love the show, what made me love it even more was when I found out you were apart of making it. #browngirlsrock #kellykapoor", "melyssa_anne_s": "@mindykaling the mini series was awesome!! I loved it! 💕 anything you touch turns to gold 👑", "lindzboz": "I love this! @mindykaling you speak my language!!", "miss.iceeyoulying": "You look stunning!!😍", "socalscotchie": "U R so damn awesome; why has it taken me this long to say thank you for all you did for “The Office”? Your acting — and especially your brilliant writing — made me laugh so much. Mindy Kaling = greatness.", "vunyeshclesh": "@mindykaling this is the show that I’ve been waiting for! 💕💕💕", "agpgriffin": "More seasons please 🤗🤗🤗", "_.shataiya._": "SEASON 2 PLEASEEEEE", "nataintransit": "I loved it so much 😭😭😭😭 Season 2 🙏🙏🙏 cc: @kirsten_britton", "thingsihaveloved": "I’m writing a book Mindy and one day when it’s published my dream is to have you produce a show of it because you know how to tell a damn good story❤️❤️❤️❤️ have loved all the work you’ve done.", "kemimarie": "Noooooo I wasn't ready for it to end @mindykaling 😭😭😭", "lauradshute": "Thank you for all the little nods and bringing the rom com back ❤️❤️❤️", "nishers95": "THE SERIES WAS AMAZING ALDKJGN😍", "bookworm368": "Szn 2?", "mindydehate": "I can’t...what is your next project ...loved these characters.....", "brando_chang": "@pragathipaari", "lillykate1218": "Thank you! I laughed, I cried, best show ever!", "jess_rosarobinson": "I’m OBSESSED with this show. Please make another season", "alyssalopezzz_": "SEASON 2!!!!!!!!!", "katherinemarjene": "You are so talented, you and the whole team. I’m in love with this and EVERY character.", "gyvilla": "Sooo good!! Season 2 pleeeassse!!!", "pauletteanais": "I don’t want to watch the finale yet because I’m not ready for it to be over!!!!!", "nattyblum": "So so so great!!!! I love this so much", "_wide_eyed_wanderer_": "Looking extra pretty here Mindy!", "meeshtastic22": "The best", "christina_gossard": "Love the show, but you stole a scene from Notting Hill. Song and all. I still loved it. But they should get credit.", "coloradobates": "It’s so good! I’m so sad it’s ending. Also just watched Late Night & loved it, too. You just kill it!", "mollyrosie": "@tassyji", "mommyslittlesecret3000": "Mindy! I just want to let you know what a fantastic job you guys did with Four Weddings. I LOVED the movie in the 90's and I just love the twist. The writing is EXCELLENT!! I actually said that out loud while watching the finale...the writing is excellent. Thank you for bringing back good television. #LONDON", "hyunahk": "@mindykaling You look fab. Where is your sweater from? It’s so cute", "katbal": "Love loved it!", "mscopeland_321": "It was AMAZING!! I Loved it. Great job to everyone involved. @mindykaling great show", "happilyarupaa": "@arun_100", "kathy.d.dalessi": "I’m not emotionally prepared for this to be over! LOVED it! I’m so happy and soooo sad. ❤️🥰😭😭😭", "jewelrybydonaice": "I want more!!! It was amazing! I can’t wait to see what’s in store next.... hmmm what about if you refresh friends 🤗💕🌟😉", "shainahouston": "❤️❤️", "that_grl_v": "@mindykaling thank you for making one amazing show..I cant get enough of it ❤️❤️❤️", "tinochka_08": "What you mean finally?!! Please continue... I want more 😊", "val_mitchell": "My husband & I L-O-V-E this series! Do you want me to repeat that for the people in the back?!...my husband loves it too! 💞 A total rom com dream but seriously funny with wonderful actors and a killer soundtrack! Thanks @mindykaling & @fourweddingsandafuneral for making our Hulu nights in so dreamy! 🤞🏼 for a season 2!!!!", "jordanbred": "You hit it out of the park @mindykaling I laughed so hard and so much. 💖", "sandz42": "Hello nod to “Notting Hill”!", "ash4542": "I need more of Andrew and Tony. Please a season 2!", "anmeiling": "This is the only show since Game of Thrones that I’ve eagerly awaited every episode. Thanks for telling such a great story and putting @inikeshpatel and @guzkhanofficial on my screen and telling a story about some good and gloriously real brown folks! Looking forward to season 2! 😉", "gisell_bf": "Soooo, when's that 2nd season coming around, @mindykaling? 🤩 I mean, technically it was only 3 1/2 weddings and a funeral 🤣", "cait_in_colorado": "Thank you for one of the best shows I have ever seen ❤️❤️❤️ I am going to miss @fourweddingsandafuneral I’m praying for season 2!", "emerysnow27": "Season two needs to happen! ASAP!", "jlerer": "I don’t need Siri to remind me to watch four weddings and a funeral 😉", "monalisasmile25": "Thanks you and the cast for making my ❤️ smile. Loved it!", "laurelmanette": "SEASON 2!!!!! PLEEEASE!! You’re amazing it’s the BEST!! Everything I want in a show!!!!!", "kristennial": "Loved it so so much!!!", "crella99": "I loved it!", "vinisaggypants": "Most incredible show ✨", "collfeatherman": "@kaleigh_sarah", "somebananana": "@mindykaling It was SO GOOD! All the laughing. All the crying. Did I mention that it was SO GOOD!!!!", "stephaniescoker": "My GOD the tears❤️❤️❤️", "mbynon14": "Love love love the show. The Monica costume from Love & Basketball is amazing!", "keelyjames": "@mindykaling I’m gonna need the deets on that sweater! You look ahmazing! 😍", "meganleslye": "@southiwa.souvannapasta did you finish?!", "jinleetoh": "i love u!❤️❤️❤️💯💯🎉🎉", "theesadev": "I binged watched the entire thing today lol AMAZING 😭", "loves.ti": "hello, my WhatsApp 491715570157 😍 I'm waiting for you honey", "rep.361_texas": "Love your natural personality", "ms_jenny8": "Makeup & hair 😍😍", "rplazastudio": "Season Finale not Series Finale hmmmmm Fine Print? @mindykaling", "doctormorgandonor": "We loved this show so much!!! Please bring back for another season ❤️❤️❤️❤️", "cheydany": "I have never cried so much over a friendship on a tv series. You nailed it. Bravo!", "argeliaandco": "We want more @mindykaling ✨✨✨please!!!", "anisalou": "The “Ain’t no sunshine” montage nod to Notting Hill this week was 🙌🏼🙌🏼🙌🏼 love this show!", "bbtorres11": "I loved it and we love you @mindykaling ! Xoxo", "erin_coggin": "The best ever!!! Please make More!!!!! 💕👏🏻👏🏻👏🏻", "rickcinclair": "Really enjoyed this. Loved the montage w the Desi version of Ain’t No Sunshine. Still miss The Mindy Project, which was the reason we subscribed to HULU in the first place!", "jennsastar": "@jrice2110 she said “read the fine print”....season finale...maybe more is coming?????", "livingwithval": "@maiajaelrod this shit it so good!!!! Girl, you better watch it!", "karenvnguyen": "The season finale was perfect!! 😭", "chrisriccio17": "This show is so brilliant and sweet. Thank you for putting your genius out into this world!", "jmcarp83": "I hope the show gets a second season!!", "me.lissi": "I'm not big on watching rom-coms, but this show is one of my favorite.💕", "jennyakabigbauss": "I LOVED IT ♥️ THANK YOU SO MUCH FOR BLESSING US WITH YOUR TALENT LOVE YOU SO MUCH ☺️", "xiheartbaconx": "@mindykaling sis first why are you so gorgeous. Second, what is the name of this lipstick. I want to try it.", "mrin.chat": "I love you Mindy!! You deserve the Nobel peace prize for that Desi \"Ain't No Sunshine when she's gone\" sequence. I will campaign for it!!!! You are such a genius and the GOAT", "whatkristinwears": "Omg this is the best! The show is beautiful and every element of ROM/COM that I could dream of!", "shortstuff7of8": "Love the series!!!", "jlangalang": "@isabellamckeon", "willow_n_me": "@mindykaling I 💚 You! hoping there’s a season 2 🙏🏼", "cariorliz": "I loved it!! More please!", "alphaechozulu": "Thanks for making this! I love a smart, romantic story. I looked forward to it every Wednesday before work! (I had zero chill) I appreciate what you do for women and people of color. 💕", "pennyodee": "Perfection!!💕💕💕 The finale was wonderful! Thank you!", "alliedesignsthings": "I feel like I just binged the epic 10 hour rom com I always wanted in my life! 💕🎉💯 It was everything I wanted and more 😍", "mimiamsalem": "The nod to Notting Hill with then season change was just perfect. Thanks 💜💜💜💜", "vickayy_p": "NEED MORE EPISODES PLEASEEEE 😂 @cesler__", "julietrc": "YESSS", "caitlindrodgers": "This finale! The best. ❤️", "mcfearless": "Mindy; it’s so amazing!! I want to immediately start again from the beginning. I also loved Late Night which I just watched on Sunday! MOAR MINDY #CONTENT PLZ.", "msmmm999": "F-U Mindy! Just 5 minutes into the finale and I’m already suffering from allergies!!! 😢😢😢", "target2288": "😁❤️", "ihiguera": "Loved the season finale 💕", "mama.inlove08": "Im@so glad this said season finale and not series!! 🎉🎉🎉", "rashminow": "It's such a sweet series! Thank you for making it! ❤❤❤", "cnbhayes": "I loved it! When's the next one?", "briawoolsey": "Nooo! Loved it so much I don't want it to end ❤️❤️", "lauren_patrick11": "Don’t want it to be over!!", "mandospizza": "I loved this!!!!! 😭💕💜", "claupau6": "I just watched the ending!!!! Tears!!! Because it’s over and soo happy because it was the perfect ending and story!! I loved it", "paroguth": "It was soo awesome!!! Loved it 💕", "kellymtel": "Season two PLEASE!!! This show has me as hooked as Friends did and I watched all 10 seasons of that 4 times through. It’s like a modern more cinematic more rom-com Friends and I love that so much. I want 10 seasons of this show too hehe!!!", "heather_rascona": "So so so good! Also may I say the ladies’ eyebrow games were ON POINT in this show.", "gloworm98": "❤️❤️❤️", "katie_derosha": "So good! So sad it's over!", "oni7": "I loved the series!! 💕", "juel_s": "You said “Season” finale and not “Series” finale sooooo.....Season 2 in the works????😅😅😅😅😅", "shellyericks": "Loved it ❤️", "brooke_fadel": "@mindykaling “I have a nephew that’s a soundcloud rapper named lil fuckface.” - 🤣🤣🤣", "ashley.lauren.novak": "Loved the finale! It was absolutely perfect!!!!", "aleabot3000": "OMG. I can't handle this Notting Hill montage throwback with Kash!!! So. Good. Thank you!", "nsc_mm_2004": "Best show ever!!! Still crying!!! Please make a Season 2!!!", "laurenindianhinojosa": "IT 👏🏼 IS 👏🏼 SO 👏🏼 GOOD 👏🏼", "archiharry": "The best finale ever 😍😍", "theroccoeffect": "It’s literally the bessssssttttttt!!! 🙌🏼", "jkovacs22": "You are a master of your craft. Four Weddings was exquisite and brought me so much joy. Thank you for making it.", "beckalalove": "Please tell me this is coming back. I loved every second!!!!", "clkellar": "It was perfect!", "aasburry": "AMAZING AMAZING SHOW! ❤️❤️🔥🔥🙌🙌", "fusikal": "Any idea when it will be watchable in Australia?!?!? Also... love the soundtrack!", "frizzieliz": "I’m not ready for it to be over!", "nasiba92": "I usually don’t comment on shows, but watch this one @nizia1994", "matthew_is_speedy": "@mindykaling 😘😘🖕🏽", "2thesmax": "Nooooo, I refuse to believe this is the finale! I only have 25 min left and I've cried already! Love this show!!", "kellyjean_realestate": "It was amazing!! DM’ed you, hope you get it! Thank you for everything! Xoxo", "ngarro74": "Please make another season", "tarynstroop": "@mindykaling I am absolutely loving it so far. It's how I am decompressing at the end of a stressful day in a tough season. Thank you for bringing the #romcom to tv and for doing it so well!!", "madlady7": "@mindykaling when I saw that you did an homage to the movie Notting Hill I screamed!!! You are the BEST!!! 😍😍😍", "beck1721": "I just watched the finale and loved it!!! ❤️", "fmmonicaa": "I can’t read the fine print... I NEED TO KNOW... SEASON 2?!", "jenny7240": "Will there be a second season?", "lauramariemuse": "Please tell us there will be a 2nd season of Four Weddings and a Funeral...such great a great show ❤️", "irinamicumocanu": "Love this ❤️", "thepartymuse": "Team Maya!! Grace, no one is perfect 💗", "mlle_lieberman": "❤️❤️❤️", "rauntandrave": "I so loved it! Perfect-oh!!", "sha007": "Going in not knowing what to expect, I definitely loved this series! Thank you for creating this version of it for the world to see! 💕", "danicrane44": "THE BEST!! SO good🤗❤️", "njbannon": "❤️❤️❤️❤️ I am 😢it will be over! Loved it!", "emhatfield27": "This show makes me almost want to try dating again.....or just make friends in my new city...let's start slow....lol", "gknapper": "This plus the opening sequence is everything a romcom fan could dream! Thank you!☀️🌬💦🌧🌈❤️❤️❤️", "skypilot_dlm": "I LOVE the show, Mindy! Well done, I can’t wait for season 2! ♥️", "kassirific": "For the record, I wouldn’t be mad if there was a second. It made me feel seen.", "jodielikespandas": "I’ve only seen the first episode so far but I LOVE it already!", "lnvess": "Absolutely loved it!! 👏😊❤️", "jules_wanders": "It was amazing! I think we need a season 2! Four babies and a mortgage... I mean, you can work on the title. 🤷🏻‍♀️", "jillnoel27": "Amazing! Can’t wait for the next season!!!", "milakaipodi": "😭 🥳🥂👏🏽", "khizzle8200": "ugh that finale ❤️❤️❤️🎉🎊🥂🍾 i need S2 to start next week! #warmandtingly #allthefeels", "melluvtravel": "Amazing show!! I’ll now need to rewatch all the episodes together!!", "cgrif21": "❤️❤️❤️ Love love love the show just like everything else you do and create! Devastated it’s over, please give us more content 😭", "eph6_11": "Season 2, please ☺️☺️", "lo_allison": "So, so, so good ♥️ Absolutely loved it and not ready to say goodbye to this show.", "adye897": "You are an amazing writer/producer/actress. I just watched the season finale and I laughed and cried. I finally got to see Late Night last night. I have loved everything you've created!", "minimeg521": "Omg I LOVED IT!!!! So so good. Fantastic job with every single episode.", "cnow88": "@amie_rocks oh no!!! It was the finale 😭😭😭", "lachavez": "Already??? Nooo! I’m so hooked 😫", "magpiefitz": "Ainsley is a better person than literally everyone I’ve ever met", "punk_lotus": "I didn’t know that was your creation! I’m so watching! I’m literally re-watching the Mindy Project!❤️❤️", "mayha.g": "All the songs on this show were 🔥🔥", "s.d.e.e": "I want another season!! Loved it", "monona9": "🙌💗 so excited!", "soupergirlrachel": "It was SO good", "vividly_vanessa": "Mindy, the last time I cried, screamed, and cursed this much was during The Red Wedding from GoT. I can’t wait for season 2!", "loveismusic19": "It was so GREAT, loved every moment of it!!", "michaelrobinson9919": "Gorgeous, beautiful witty and charming with", "snmcgowan": "I happy cried and sad cried through the whole finale! Loved it. Thank you @mindykaling", "ms_iamtrice": "Can we please also get deets about that sweater? @mindykaling ❤️❤️❤️", "k_hoch": "I truly hope there will be more episodes!! Best show! 💕💕💕", "lauren.m.allam": "This show 🙌🙌", "bseema101\nVerified": "Verified", "tmehaffie": "We just finished episode 10. We didn’t think it could get any better. You are such an amazing writer!!!", "rungirl145": "This episode made me cry three different times. It is so well written.", "noorajoony": "The best show on hulu👏❤️🔥", "savi_sds": "You are so talented. All I have to know is you made some creative contribution and I’m there. You totally rock and I wish there were more people creating stories like these about middle aged women.", "taras_tiu_": "I love love love this show 💖", "lili_r0": "Such an amazing show. It pulled at all of my heart strings. Thank you for bringing this to life! 💕 #FourWeddingsAndAFuneralSeasonTwo", "hippiepixie88": "You are so gorgeous 😍❤️", "silvrgurl": "Loved it💕", "ylaguer": "Love it!❤️", "jessicaagiesen": "PLEASE BRING IT BACK FOR A SECOND SEASON!!!!! I KNOW IT WAS A MINISERIES BUT I NEED MORE OF IT IN MY LIFE!!!!", "echancey": "Loved this and your sweater is super cute. ❤️🎉❤️", "victoriaelenayoung": "The Notting Hill scene!!!!!💕💕💕💕", "sarahmessing": "Is there going to be another season?!?!", "nadia_c_lopes": "❤️❤️❤️❤️❤️", "teacherterrijo": "Loooooove it!!!", "alexistyler88": "Seriously FW&F is what all my romcom dreams are made of! ❤️❤️❤️", "_mrssmith062014": "When is the next season coming out... I am hooked on this show I absolutely love it!!! Great job @mindykaling", "marsummers": "It was just excellent Mindy! You are a wonderful, smart writer!", "minniemaeparker": "So good. Fantastic writing and acting.", "lacasadekatie": "Just finished it... already want more 😭", "marymarywhyyoubuggin73": "Loved it! We need more romantic comedies that defy all barriers!", "wordcnorth": "I don’t want it to end! Loved it all, the characters, the outfits, the stories. Season 2 🤞🏻🤞🏻🤞🏻", "sparklespoon": "Thank you!!!! 😭😭😭", "scotchnishida": "@koushalya, you watch yet?", "jennamis1": "Honestly the best thing I’ve watched in a LONG TIME. I love all these people and their love ❤️❤️❤️❤️ More please!!!! Mindy, you are a genius!!!", "dayla_penn": "I LOVED it!!!", "hi_patsy": "You are so stinking adorable.", "mrgrissett": "You totally made my summer!! I loved @fourweddingsandafuneral !! Well done! Bravo 👏🏻", "byrdiebee": "👏👏👏😍😭😭😭🥰🥰🥰 best ever- thank you for this show!", "natilette": "You look absolutely stunning! God bless you & your creative genius runs my life, btw.", "taylorjeanobrien": "Season 2: new characters based in nyc this time with trips to London? Can I audition?", "annabethsg_": "Thanks for this show.", "nixgersonmedia": "❤️ You Mindy! (Just watched Late Night 🙌🏻🙌🏻) and loved every minute of Four Weddings! Can’t believe it’s wrapping up. 😢", "ark9899": "Love the show!", "tellnoor": "I cried my eyes out 😭😭😭 loved the show so much!", "katismellow": "This was such an amazing show I loved it!!❤️💖❤️", "katellislewin": "Awesome from start to finish! Dare I dream that y’all give Love, Actually the same treatment for your next project??", "laowings": "Wonderful show, great actors, terrific writing!", "mrsspockdeepa": "I lovvvved it..esp the Hindi song to which Kash was running to, all the feels 💕 we want more!!!!!", "kt_hagen": "It’s literally my favorite rom com ever!! It makes me want to move to London!! Please keep making amazing shows!!", "intentgreat": "You look 🔥🔥🔥", "jessbestcoast": "Cried like a dang baby and loved all the homages 🧡", "rocktoberfestwilliams": "Maybe it’s a dinner of grilled cheese and two beers; but this show was too cute. @mindykaling thank you. You’re a rom-com goddess.", "mommylife_adventures": "Will there be a season 2!?!?!?❤️❤️❤️", "crystal.cummings123": "Me and my hubby @allureelectric love this show!!!", "martinka25": "@mindykaling IMDB says there are 12 episodes in season 1!? Will there be two more!?", "gala_jackson": "This has been one of my ABSOLUTE all time favorite TV series. Thank you, your team, and the cast @mindykaling 💛💛💛", "lsun17": "🙌🙌🙌😻😻😻", "rina_gersten": "@eyeofthe_kyger this is to u", "msemilybressler": "God I should not be crying this much for a season finale 😍😭😭😭", "ebventures": "We need a second season!! It was soo good!", "kristamm79": "So good🔥🔥🔥", "quierovivirintencional": "I Love you! 😘 k bye", "har_preet": "@postcardsfromjean Mindy Kaling out here just making my romcom dreams come freaking true", "olive_uh": "Loved it! Also loved Late Night - thank you!!!", "postcardsfromjean": "🎉🎉🎉💙💙💙best finale in tv show history. gave me all the feels 😻😭", "kebowser": "I loved it! 😍", "talisha.ori": "Will there be more seasons @mindykaling", "leona.ch": "It was so good! 😭😭😭", "ktinfc": "Am loving @fourweddingsandafuneral well done!", "jadeko27": "Best show ever!", "lauramelindajean": "just dropping by to say @fourweddingsandafuneral is hands down the best show I’ve seen in a LONG time. Thank you, thank you.. 😭💕", "sunnycmiller": "LOVED THIS SHOW! ❤️ Bring it back ASAP", "kiaralillieth": "Season 2 please😘", "jessica_knutson_": "@laceyrieke!!!!!", "cglucker": "Thank you @mindykaling for 4 weddings and a funeral ❤❤❤", "shivs_999": "“I used all my weight watchers points” BEST LINE EVER!", "nextchaptercatie": "Such a pretty look! @mindykaling", "catrazavi": "So I had no idea what this show was about or anything, saw your post and that you were one of the creators and I have been binge watching it all day!! Love the show, love the actors and do not want it to be finished!! Thank you for all the amazing work you put out there I have been a huge fan since the beginnings of the office. You are an incredibly talented and hilarious woman! I really appreciate you 😁", "loveandlaughalot2": "I loved this show!!! Loved! Loved! Loved!", "mpm2590": "@elizabethcorb this. Is. Perfect. Too much to unpack in one comment !!!!", "bleedingatthegates": "Omg it was so good 😊", "jessenicole7513": "It’s so great! Love it! @mandamazur", "rachelintransit": "@becca.lundberg 💃", "gchetta68": "Just saw last episode. Killed it! These days we all need a reason to smile! Oh and Jersey in the 🏡", "mstbel": "LOVED this show!!! So sad it’s over.", "uhliisuh": "❤️❤️❤️❤️", "justdanielle33": "Such an amazing show!!!", "jordynlazar": "the finale was amazing please do a season 2", "lizlandingham": "Definitely team Maya. Trust your best friends.", "katyfwy": "@petpalacejill I have no idea what show she is promoting but it's our song!", "mommymiller4": "Thanks for this great show -love it!! Your characters are fantastic and I laugh so hard and then cry of course! Cant wait for SEASON 2 - will Chris Messina show up? @mindykaling", "sam.i.am_traveling": "I just loved this show so much! 💕 I never want it to end 😭", "jlooch": "I JUST WATCHED I LAUGHED AND CRIED SO MUCH 😍💙😍👌🏽", "coco6177": "@amberkay924", "emmorrisonn": "I love you Mindy!!!", "lalajeanp": "🖤❤️🖤❤️🖤❤️🙌🔥", "karadavis": "I don't have hulu... must go on and get hulu. Dang.", "kiaraa04195": "Still gushing over the last episode!! 🥰 if only life was as forgiving 👀", "erinncrespo": "Love love love it", "sem8686": "Love love loved it!! 👏🏽", "signorinavelvet": "@fran_ital23 can we do this for our 12s?", "rosemarymartin408": "👌🏽👌🏽♥️♥️♥️", "dwacesupersecretspam": "😭😭mindy my heart is melting", "sweet_eco_sa": "Watched the finale on my lunch break, ended up crying, people thought work was making me sad, I didn't correct them. 😂😍😍", "shilpa1003": "@dharshig !!!! @mindykaling Please make a season two of this 🙏🏽😍💚💚😍🙏🏽", "natsmiles44": "Aaawwww love the show !!!", "briana1087": "I need that sweater in my life...", "tiatia828": "LOVED every minute of the finale!!! Any chance there will be more??? The WORLD NEEDS more Four Weddings And A Funeral!!!❤️❤️❤️", "a.satterwhite": "❤️❤️❤️", "slanneau": "More seasons, please😍😍😍😍😍", "wanderlust_evlyn09": "I dont want it to end!!!!!💕💕❤️❤️", "rach_ael_00": "I loved it! More please!", "xtinemay": "❤️❤️❤️❤️❤️❤️❤️❤️", "blingrel": "I absolutely loved this series!! I couldn’t wait for Wednesday’s !! Thank you making a good romcom that didn’t make me want to vomit. It was utter perfection", "jzycaramel": "So is there a season 2? Is that the fine print?", "ajchum": "Was this truly a one and done or will there be other seasons? 🤞🏼 I loved it sooooo much 💗", "simply_saetren": "💕 I loved it! 💕", "saima_ahhh": "LOVE IT!!!!!!! it’s the best rom com show in years!!!!!", "mldevine90": "No finale! Not allowed! We need more!!!! Amazing, great job!", "rosas_michele": "@littlelovelorelai ❤️❤️❤️", "christinespoerer": "She looks so pretty and super young in this post ! 🤯", "hola.kimi": "Stayed up past midnight to get my fix before the workday ❤️ thanks for bringing some love and happiness over the past few weeks", "sammieafa": "I loooovvvve you and I looooovvvvve this show because you are an absolute genius and just plain awesome!", "ashutson": "Your make up is on point!", "melissa_gorman": "Does anyone know how Canadians can watch it??", "tenehix": "I JUST WANTED TO SAY I LOVE FOUR WEDDINGS AND A FUNERAL! KEEP IT COMING! 💕", "karina_michele": "Mindy you’re the gift that keeps on giving! Loved this mini series like all of your other work! Can’t wait to see what else you have coming!!", "jeanon_jawech": "Loved this show, one of my favorites! PLEASE make a season 2🙏❤️", "paulina_ng": "😍❤️", "katylin_per": "@haysmith91 @mporrell 👌🏻", "tasha0630": "Loved every bit of it. Please make a season 2 ❤️", "terandujar": "❤️❤️❤️❤️❤️", "pgilfillan1": "Noooo!!! I don’t want it to be over yet!!!", "tanya_sb": "Thank you for making this. My heart needed it. ♥️", "designer_brands_krisops": "@mindykaling where is that sweater from? Adorable!! ❤️", "geralynb_": "SOOOOO GOOOOOD 😭", "debra.ritter": "Is i going to have season 2??", "marybernard": "You sooooo cute!!", "justmereka": "Yassss I love the show!! ❤", "panmarq": "@instav1d youre trending", "katymills26": "Can you pleaseeee make more rom coms into series?!", "kgarciadiaz": "I LOVE 💕 the show!!! I didn’t know you worked on it!! But makes complete sense! Love you @mindykaling", "shannonhage": "You are adorbs!!!!! Love this♥️", "zenobialittlejohn": "@mindykaling @inikeshpatel I woke up at 5am to watch the episode before going to work ❤️❤️❤️❤️", "sam.bing.err": "So good!!!", "bl11hannah": "We LOVE it!!! 🔥🔥🔥❤️❤️❤️", "visual_warrior": "Oh wow", "cladma": "Please make a season 2, just wanted the finale and LOVED it 💕", "wongy74": "I love love this show? Second season please @hulu", "heathersueclark": "Loved this series‼️ also just watched Late Night and thought it was fantastic ✨", "guptanisha": "@sheepgirl44_", "t90bates": "Sooooo good!!!!", "_lmullins": "It was amazing 😍", "alittlebitfrench": "We fell in love with these characters, you chose perfect actors 😉", "yael.ditkofsky": "💗😭😭😭💗", "melissa_terry24": "My favorite show!!", "elpsartin": "Love this show😍", "princessrenren": "Ohhhhh-I’m going to miss this show.....😌", "brianna6134": "💙💙💙💙💙💙💙💙", "myelodym": "I love u <3", "paigertexas": "Bash is THE best character I ♥️ him!!!", "randihill824": "Love the sweater!!!! ❤️❤️❤️", "lorielouwho": "@mindykaling just started the finale! LOVE the Notting Hill nod. 😍😍😍 you did such a great job on this show! very proud fan. 😁", "stephaluv": "It’s sooo good!!!!!"}