{"fitnessandfrankness": "AMAZING 🙌🏻", "lfernandarubio": "Love u boyz🖤", "jenncollins311": "Just finished binging @neverhaveiever and now I'm sad because I don't have any more episodes left. It was SO GOOD!!", "kshananagans": "❤️❤️❤️❤️🙏🏻🙏🏻 Loved it!!!", "vivabaxter": "This show is so fun. @mindykaling is the American Richard Curtis.", "jae_so_fierce": "The diversity in this show is 🔥 I love that they include actors & actresses with disabilities. What’s even better is that they showcase them as normal people (which they are) ❤️ #inclusive #DiverseTV Thank You🙏🏽", "dianawking": "OMG where was this show when I was in high school? Seriously this series was everything and so on point. Binged watched, cried, and laughed all the way through! Can’t wait for season 2 ❤️", "haucknorris": "Love the new show! Hope to finish 9 and 10 tonight!", "khapers": "So is Paxton Hall-Yoshida this generation’s Jordan Catalano? 🤗♥️", "kiaradonato": "Best show 😭💗", "maddie_boster": "@annie.boster @ellenboster hot", "heidy_g12": "I just finished watching it!!! It was REALLY GOOD! LOVED THE SHOW!!!!! 👏🏼👏🏼", "blackwolf109109": "I really like Never Have I Ever!” Very funny and great acting. 👍🏾Also just finished watching all of “Four Weddings and a Funeral” and I absolutely loved it! So funny and romantic. Will there be a second season of Four Weddings?🤞🏾", "kaseyannd": "Please tell me there is going to be a second season?!🙏🏼❤️", "mandaa_pandaa_xo": "I just binge watched this and I LOVE it! I am so ready for season two!!! It’s so real, pure, funny, and relatable. Bring on season two ❤️ @mindykaling", "kayrobs23": "Mindy!!!! Freaking fantastic show! ❤️", "faratea": "Love love loved it!! Can’t wait for more.", "mm.ymatsu": "Watched #neverhaveiever three times in a row now! ✨ Cannot wait for Season 2! #canibeavishwakumar 😁", "themurphylife": "I literally watched the whole thing 24 hours after the release date. And now I’m sad because I want season 2 like, yesterday! Brilliantly done! 🙌🏻", "indu_s100": "@mindykaling Just binged watch! Laughed and cried. Was awesome! ❤️ Now watching The Mindy Project box set. Thank you for making lockdown just that little less lonely x", "mervy06": "@mindykaling loved the show, it gave me all the feels. I hope you get to create many more seasons to come💗", "kavadimanisha": "I loved it! Binge watched all in one night.", "msglas": "@mindykaling Blane not Duckie!!", "candicel1c4_": "Please do season 2 🙌🏾🙌🏾🙌🏾", "farh_ana8": "I love it Mindy! Please make a million more seasons ❤️", "angie_aristone": "I'm sooooo in love with this show!! Binging it again from start to finish and it won't be my last time. So perfectly cast and such a treat. Thank you 🔆❤️🔥😘", "caterinabasisty": "Just finish. Loved it. Great work⭐️", "nataniamunsami": "I effin love this show! Watched an ad for it yesterday on YT and immediately went and binges the whole season! Finally, a woc (who's also Tamil!) is in it and the lead! This show is amazing!", "leahspaff": "Man... I finished this in one day!!! I laughed, cried, and every emotion in between. It was phenomenal!!!", "mmbuch11": "Already ready for the next season!!! Please 😆", "shilpi_navya": "@mindykaling — Hi Mindy, i loved the show, i could totally relate to myself. I am also glad that you brought attention to Indian communtiy also by writing about an Indian person and giving the Indian actor a chance to shine⭐️", "lilyrae543": "#teampaxton", "kamkaur__": "Loved it Mindy, last episode had me 😭😭😭. Eagerly awaiting series 2 👌", "mrslinville42016": "Binged watched the whole show!!! When is the release date for the new season???!!!! 💙💙", "kanchanasuggu": "What an INCREDIBLE show!!!!", "lucianalmadeira_": "Queremos a 2 Temporadaaa 🇧🇷😍😍", "valulu1207": "I wanna know what happens! When will season 2 be???", "jennlynne28": "I binged this show! Perfection. Please make a second season fast!", "adya_white_": "@mindykaling you did such an amazing job on this tv show! 👏🏾 absolutely love it!", "puffpiece": "Just started watching and I’m in love! It’s genius, heartbreaking and hilarious! Also sometimes Very Triggering and Stressful, but I still love it. You fucking rock @mindykaling. 🤘❤️", "iam_jamiejackson": "You did such an amazing job with this show!!", "esdeegee18": "I really enjoyed the show! Loved the multi-ethnic cast (representative of LA) and especially the Tamil representation and references!", "thihuuuu": "We need season 2 asasp 😭", "masandnobu": "Love love loooove your show!!!! 😭😭😭🥰🥰🥰", "natashawrote": "Mindy, this show is so good! I’m Iraqi and a writer 💜 thank you for the representation 💜", "kelseykot": "Obsessed.", "robingoyle": "Even though I’m working multiple 12 hr shifts this week (including tomorrow yikes), I just pulled an all nighter binge watching this show. Cried and laughed multiple times, and loved feeling SO represented. Can’t wait for more seasons!!!", "jessmshahpolanco": "It was such a great series! When is season 2?", "shelleythecraftylawyer": "Loved loved loved this show - binged it in one day. Just wish you had narrated it! @mindykaling if you haven’t read Good Girls Marry Doctors you should! I think you’ll feel as I did - wishing this anthology was available when you were a teen.", "butterchicken_girl": "Never have I ever seen such an awesome series based on indian family...so relatable..❤️", "lovedel_xo": "Just want to say that I lovedd it !! Hope there’s more !", "arpster1": "Smart; funny; heartfelt; amazing cast - thanks for creating such a wonderful show!", "ankitagwl09": "What a show!!! BINGE WORTHY. LOVE IT. ♥️😍😍 @mindykaling", "lauragapp12": "This show is everything and more! It fills the void the Mindy Project left behind, and shows us just how absolutely phenomenal you are, Mindy! 🥳❤️", "swapnad": "This is the best show! It literally captures my high school years. But I wasn’t quite that funny and neither was my mom. It’s nice to see yourself represented on screen. 💕 Thank you @mindykaling for telling our story.", "momofthefab4_": "@mindykaling season 2 please ❤️🙌", "kotush04": "This show is soooo amazing and hilarious!!!! Season ✌🏼better be coming our way!!!!!", "mayanqueen77": "Loved your show! Can't wait for Season 2!❤️❤️❤️", "doctormomof3": "2nd season please! ❤️", "jayjenks21": "Thank you for what you have done for the Indian community through this show. It’s exciting to see people who look like yourself getting such a presence on the American screens. Whatever we have to do to get a second season, I’ll do it.", "sandrah_cele": "Hope there is a s2!.", "jstar84": "Finally had a chance to binge it the last two nights 😭 I LOVED IT!", "juliacarabilloimig": "Goddamn you with this show, Mindy Kaling! It’s amazing.", "sweetbutterfly96": "Loving this show!!!🙌🙌", "kateybee2": "Just finished binge-watching it and I LOVE IT! ❤️ It's so fun and so relatable, I really love this show. Season 2 please!!", "trainwithprriya": "Show is funny good....but I didnt like how u show an Indian girl to be desperate for sex ...so culture less", "amaniposts": "Amazing show!! Thank you for making it. So incredibly cool to see a cast of color!!!", "megdoles": "My new favorite show. It was beautiful, funny and incredibly moving. I am blown away at the emotions it brought out of me that I didn’t realize I buried. Anyway, THANK YOU!!!", "rashidah_jones": "Can’t wait for next season🤗 love it", "monishaaneesh": "Haiii.....am monisha....i have watched Never have i ever its just superb... loved it sooomch...... eagerly waiting for season2❤❤❤❤.....love u @mindykaling... much respect🙏", "lisa_bunz": "@primerai I think you’ll love this show on Netflix!", "mllefrizzle": "Sis, how are you gonna make a show that tore my heart all the way open and only release one season???? 😭", "chrissy_forsythe": "Love!!!!", "itsmisstj": "Just binge watched this show Today!!! Can’t wait for season 2. Totally relatable show ❤️", "kinglepore": "I enjoyed so many things about the show. It was entertaining, witty and smart. So Im confused about the treatment of the character Eric. Cheap jokes detracted from the original intent.", "neekie21": "Finished the season in 2 days - definitely made me smile during lockdown but especially as a British Indian can completely relate to some aspects!! Loved it!! Hope there will be a second season? 🇮🇳 🇬🇧", "elyse_harpbro": "@mindykaling EXSQUEEZE ME! after re-binging The Mindy Project, I was excited to see your new project. I watched this in 1 day!! LOVED IT!!!", "dresses_with_pockets": "This show is freaking well writ! Snapping dialogue. I laughed a lot and cried real, ugly, unstoppable tears. I feel like hugging everyone involved.", "lkjames89": "Just binged! So great! Congratulations Mindy! 🍾🙌", "drishtiiiii_06": "@mindykaling @jarenlewison is there a season 2 cmggg", "ceecarr__": "Please tell me there will be a season 2!!! @mindykaling", "caruroelis": "@mindykaling thanks for this series, I'm loving. You are amazing.", "laskixoxo": "This show is so good!", "yellowindows": "Me: oh it’s that hot guy from Hero’s! *two minutes later* Oh oop never mind then 😂", "shelleydeedee": "This show is soooooooo good!!", "padminisebastian": "👏🏽👏🏽👏🏽❤️❤️", "nikkifm88": "I loved it !!!!!!!!", "kindfoodmom": "You are all amazing! Love this show so much! 😍😍❤️❤️", "nee416": "👏🏼👏🏼👏🏼👏🏼", "kelsey_f_calon": "I was hooked within the first 5 minutes when Nalini says, “Devi! Don’t be rude to your beautiful cousin.” I laughed and laughed and laughed! It just hit me right in the funny bone, such a simple, unassuming line, but so freaking funny!", "mhatziliades": "Just binged- 👌", "alexis_blank": "I LOVED THIS SHOW! You are amazing And talented @mindykaling!", "kimlynch22": "Must have the necklace the mom wears. Where can I find it?", "shannon_stella": "I’m already excited for season 2!!!", "stephanierobichaud": "Sooooo this show!!! LOVE!!! Once I realized I was already on the last episode I was like “NOOOO! We need more! ... seriously much love to yourself and all the talented folks that brought this show to life.", "sarahdelfrate": "such a touching & beautiful show. thank you 🤍", "beeexcited": "Just finished watching! And loved loved love!", "barsoum_lina": "Omg mindy I binge watched it 2 nights ago! Stayed up till 5 am. It was brilliant! I missed your work since the mindy project!!!! I absolutely loved loved loved it!!!!! Great job! I laughed, I sighed, I cried! Felt I saw what mindy lahiri’s teenage years might have been like 😂😘❤️ congrats to you, the staff and cast!!!!", "mechapman70": "Thank you for the big fat ugly cry as I finished the last episode this morning. Wonderfully done - bravo!", "soulinthebowl": "Binged it all, took me two days to finish because I still have shit to do. What a great show! 😍", "violet_dberg": "Eleanor has a tattoo!", "ccarrgofar": "#neverhaveiever⚡️photo! @mindykaling heard you on Fresh Air, then binge watched! love love love the new show! great writing, fun characters, great acting! here’s to many more seasons! (and Johnny Mack narrating??? ❤️)", "melissa.haskett": "Love this show 😍😍 please let there be a second seasonnnnn 🙏", "voss25": "I am obsessed with this show! So so so well made! Great work!", "katieannkaler": "Just finished the show and I bawled through most of the last ep. such a good show. Can’t wait for next season. Thank you!", "roxanne_rocks_": "So well written, so smart, ❤️❤️❤️❤️❤️", "sharmila_singh": "Absolutely love love this series. When is season 2 coming ?", "dsuarezxo_": "LOVED IT!!!!! 🤞🏼🤞🏼 for a second season!!!!! 💜", "carvalhocarooll": "Loveeee", "_adornm3": "I binged and now I can’t wait for the next season!!! I absolutely loved it!!❤️", "sugarcakeslori": "Ok I shouldn’t be a 36 year old in love with his show... should I? 😩😅 #itsmindybitch so yeah #guilty", "younghannybear": "Amazing, I loved this so much! ❤️", "bushidok9": "@mindykaling I just finished the show & absolutely ❤️ed it!!! It's so funny and so touching! The father/daughter relationship hits close to home. And having @johnmcenroeofficial narrate it is pure genius! There better be a season 2 @netflix !!!!", "susapollosa": "Just finished and LOVED it!! Can’t wait for Season 2!!! ❤️❤️", "marinelwitz": "💙💙💙more more more!! We must have a second season!", "the_real_camille": "The guys in this show are 🔥. Thank you for that.", "photographsbyrinku": "@mindykaling hey- 41 yr old desi mom here. I loved it. Totally related to partying with the Nerds on ModelUN trips. HMU if you need actresses for season 2 😜", "onminlal_mate": "\"Never have I ever\" is so LiT!!!🔥.. waiting for Season 2", "sonyapie4": "❤️❤️❤️ This show! So relatable!!! I’m glad I’m not the only awkward Indian girl in America 😬😂❤️❤️❤️", "jericho_li": "I just finished binge watching the whole 10 episodes! Gosh it makes me laugh and cry too! Never have I ever thought that I would cry watching a teen comedy! Sending love to the amazing cast of the show from Hong Kong!!! ❤️❤️❤️", "jbenitez___": "Love this show!!!!!!!❤️", "marivicpinedo": "Soooo much fun!", "sadob": "Such an amazing show! Ready for season 2!", "linda_heredia": "I binged watched the entire season - love it, I’m obsessed! I hope you come out with another season 🙏🏻😍", "sansanmix": "@mindykaling @neverhaveiever . Thank you. My parents are immigrants and my own children are third culture kids. Identity ( being Canadian and West Indian/African Indian) was something i struggled with growing up amidst grieving my dad. You gave a window into how all this can be processed!!! Please please when is season 2 ??????", "daydreaming_12345": "Omg I have just watched it in 1 day, this show is AWSOME!!! Can’ wait for season 2!", "meredithbutlin": "This show is so good @mindykaling but if it’s a comedy then why am I crying so much?! 😂😭", "cfireman": "I LOVE LOVE LOVE your new show! It’s like watching a mini Mindy! Way to go!👏🏻👏🏻", "beckengler": "Just finished binging it. So sad it's over! I can't wait for the next season!", "casinogram_02": "Love this show! When is season 2?", "caligirlhart09": "Loved it hoping for many more seasons!!!", "oneawkwardmom": "LOVED this show! Binged it in a day 😬. Can't wait for season 2! You're a very talented writer. ❤️", "heynoelleybelle": "I watched the entire season in one sitting. Cried during the season finale. The cast is amazing and Maitreyi Ramakrishnan is phenomenal. Enjoyed every minute of it. Thank you.", "dogmamarescuer": "This is a great show. I can't stand John Mackeroe's voice. I love when they had Andy Samburg narrate an episode. I wish he would narrate permanently. I'm not finished watching Season 1, but I hope they show more of Eve and Fabiola.", "kamala.salem": "I’m a 30 something Indian American. Growing up in the US, I never felt like I fit in completely with either being Indian or American. This show made teenage me so happy while simultaneously making happy my kids will have more relatable role models. Also great name choices, I’m hopeful one day that people stop butchering my name.", "theheaddressworkshop": "I binged watched every episode today. Well done. I normally don’t like high school themed shows but this was excellent.", "carmelyphotography": "What an incredible show! 🙌 When does Season 2 start?!?", "may0602": "That show is amazing 🔥 everyone have to watch it!!!!", "spacemishka": "Started the show with zero expectations, have never in my life had anything to do with Indian culture and high school days are long behind me, so I totally did not expect to get so invested to be bowling my eyes out at the last episode. Amazing, amazing work. So fresh, so funny, so great. 💛", "2infinityannnnndbeyond": "@mindykaling Never have I ever... laughed so hard.... you’ve never disappointed me with any of your works and you continue that for me. This is absolutely amazing. Thank you for this. Thank you thank you thank you. It’s a beautiful show.", "jenniwren17": "Thank you for this show. I can relate to the mother/daughter storyline and totally ugly cried during the last couple of eps", "aranyaeva": "Binged in two days 😏 loved it!!", "hippypippy": "Love Love LOVED❣ the show !!! Binged it all day yesterday and was soooo good !!!! Exactly want I needed during these time . Thank you 🙌🏽✨", "shantibehrens": "I just binged the entire season and LOVED it!!! Thank you @mindykaling", "vida_amorosa_247": "Binged watched the whole show today. Absolutely loved it ❤️❤️❤️", "lilysland79": "I love this show Soo gooooooood👏❤️", "jaxs_wallach": "Half way through the season and sad that it’s almost over ! Can’t wait for season 2!!! 🙌", "jujubees119": "Just binged watch. Took me back to when I lost my dad at 21 and basically acted out my grief the same way. I could feel it sitting next to me as I watch like an old friend . Truly beautiful and well done. Thank you for this gift.", "shwe.desai": "Thank you!! Representation matters! ❤️", "iamjenkim": "I love this show so much🥺🥺", "_lauralei_": "💖💖💖💖💖💖💖", "texasbelle14": "This show is so good! 😍😍 Made me feel young again and related so much to MANY situations. Joe McEnroe is the icing 🎂💯", "wash_1616": "This is one of THE MOST well written and portrayed series I've seen in a very, very long time. Kuddos to those who can turn grief into something so authentically artistically beautiful. I'm a grown woman who cried because this series resonated losing a parent in my 20s and being in Motherhood in my 30s. Thank yall so much for bring this beauty into the world.", "cleckwold": "@mindykaling I finished the show in one day. I loved it so much ❤️👏🏼✨", "nicki.croly": "Just binged the whole thing and neeeeed you to make another season. Also need you to create more series, your talent is incredible and I will watch anything you touch. 💗", "grudge_bags": "@maliniladd ❤️❤️❤️❤️Paxton!!! Xxx", "22shuchi": "Loved it😍 Love every bit of it.👍", "__shanayy__": "Literally binged the show in a day, and this show was so so amazing! I love that theres finally a show that relates to my family, and that's what makes it so much better.❤️❤️❤️", "cupcakerylolas": "@mindykaling just binged watch this show. Please can we have a season 2!!", "minaincc": "Watching now and loving it ❤️", "heather_totman1": "😍😍😍😍", "mangosummit": "Just finished binge watching @neverhaveiever and cannot wait to see what Season 2 brings. Congrats to the team. Been a while since something got me right in the feelings like that.", "shamili_swami": "One thing I don't understand is why does Nalini wear the \"thaali\" even after Mohan dying.. I liked that she did it though.. but I don't understand why and also no one at the Ganesh Puja talked about it.", "mellym22": "Please please please say we get a season 2!❤️", "theadrianacd": "Mindy Kaling, you’ve done it again! Everything you make is incredible, thank you for being you!!!", "vero.sic": "Totally binged and loved this series!!! MOAR PLIIIIZ 💪💪💪😍❤️", "kotseleen": "Looking forward for season 2! 💕😇", "vishakhajain28": "So I binge watched #NeverHaveIEver, what an adorable show! Thank you @mindykaling for giving us this heartwarming story - it made me laugh, it made me cry, it made me want to watch more...stayed by the entire night and saw all 10 episodes in one go!", "monensemble": "I adore this show! Can’t wait for Season 2 and 3 and 4.....", "ferhanac": "Watched it in one sitting- SO good! Congrats to you all! 🙌🔥💕", "emilyszasz": "In this show and the mindy project you have a problem with anti semitism. the stereotypical and offensive representations of jewish men who are simultaneously fetishized as romantic objects is problematic. would like to see you do better on this.", "melanie_bronson": "Loooooved it. Binged it hard. Want mooooore 🙌", "kittehmafia": "Fantastic cast!! Just fantastic!!!! ❤️", "julissabonfante": "Loved the show!!", "_arthur__g_": "Looking at her @mindykaling I can smell her pussy far from here . Geeez", "candy_joseph": "Absolutely bing worthy... NAILED IT! Thank you for putting Indian culture out there (and creating something so damn relatable) 🙌", "jasminedarne": "Really enjoyed this show !! Glad to finally have more representation on tv !!!", "amandaell1": "Just started watching, show is amazing!", "slyons85": "Just binged ! Awesome! #pleasetellmetheresanotherseries!!! #neverhaveiever", "mcarbajal21": "I know I'm late bit just binge watched it and omg @mindykaling so many happy tears, I loved it!! ❤️❤️", "agt_22": "Love the new show. ❤️", "beth.frxn": "THIS SHOW IS AMAZING!!!! I LOVE YOU MINDY", "lizzy_and_dario": "I adored this show, I'm so grateful it exists, important female friendships, showing women as 3 dimensional people and showing boys as human, vulnerable, relatable so great 💜💜💜💜", "padmini21": "Kudos Mindy for making such a great series!", "bonita_ha": "My husband and I binged on the whole season last night and we loved it 💛 I love all the music on it too 🎶🎵", "queer_sisterhood_cluj": "LOVED IT!😍", "kevstagramz": "Ramona Young... okay now carry on with your day", "stephdede": "Mindy everything you touch is gold! I loved it, need season 2 ASAP ❤️", "annelonius": "@mindykaling It is so amazing. I get chills/cry almost every episode and right down at least one hilarious quote. It just is...everything. And @mlpadman I can only assume Kamala was the character you were talking about on @armchairexppod . She is perfectly cast but every time she is on screen I think of you and smile.", "charlenedmummaofthree": "Love it!!! Season 2 please!!!", "afysaleh": "@mindykaling It is refreshing, empowering, endearing, liberating, funny as f@$k, beautifully heartfelt and most of all...its so many of our stories. You have mine and @sandira.r.s Brown seal of approval😉 👏🏽 ✊🏾😭🙏🏽🥰😍👌🏽😎🤯🤣 We ❤ It alot! #BravoMindy #brownandproud #proudbrownwoman🙋🏽 #bringonseason2", "pheebssecor": "LOVED IT! Cannot wait for season two but also season three because I need MORE!", "lilmissjay16": "Binged the whole show! Love it! Can’t wait for season 2!!!", "navajo.cutie": "Finally a show where people of all ethnic backgrounds can shine! Love this show! It’s my new fav! 💕 Please feature Native American actors too.", "leopardcrazed88": "I'm loving the show!💖", "kirstenleppert": "This show is amaaaaaaazing!! Thank you @mindykaling for making me laugh!", "johanna_lynn33": "Just binged and holy moly this show is amazing!! Thank you for creating it. Last few episodes messed me up. So much crying 😭", "georgetown.hoya": "@mindykaling this show is incredible. From one South Indian to another. Where was this show when I was growing up? What a badass...😉💙", "lwalch323": "Such a great show!! I binged it in a day!! Hysterical!!", "ma.rija8493": "Loved it! Watched it in record time with my husband. Very well done. John McEnroe was a great addition.", "corenekc": "Our family is enjoying the show so much!❤👏❤", "jasmeetess": "Amazzingggg. Obsessed", "soshanau": "Wonderful show! ❤️😍 Mum has the best lines!", "sharneolivia": "Binge and ready for s2🙌🏼", "kdotts17": "Never have I ever is perfect!!! ♥️♥️♥️", "hihellohilarion": "Thank you so much for this show! I’m visiting my parents for the first time in two months and ended up watching it with them and got them hooked. My dad and I are super close so that last episode was quite the tug on the heartstrings especially during this pandemic when one of my biggest fears has been potentially giving this virus to either of my parental units and losing them to it. This was the perfect amount of silly, high school cringey, sweet, angsty and emotionally wonderful. I’m so glad it came out when it did so I could share in this with my loved ones ☺️", "jess.carrasco": "❤️🙌", "tavipatel": "Loved it! So many parts of the show I could identify with growing up in California, that I never told any friends because I figured they wouldn’t relate.", "maruchyrl": "Saw the entire show in 48 hours.", "jlramos": "💯", "makimilena": "Can't wait for more!! ❤️❤️", "meganallene1204": "Please let their be a season two! I binged the whole first season in one day and can't wait for more!!", "rosemarie_bernardo": "Love the show, @mindykaling! Season 2 please @netflix!", "harby_valley": "Loved this, I was hooked. Devi was on 🔥, thank you and well done Mindy! 👏❤️", "missxdaisy": "Great show, Mindy! I loved it.", "annerjans": "I love everything you make!!!! I miss the mindy project so much. You are hilarious and so talented! Just finished this show and I can’t wait for more! I literally laughed out loud so many times and you nailed the complexities of teenagedom. Love this so much!", "aliasdesi": "Thank you! Thank you! Thank you! When I was growing up in a suburb of Pittsburgh, it would have meant everything to me to see a mainstream comedy show feature an Indian-American lead; to see myself & my family represented on TV! I’m now 50 & yet your show brought me joy & made me feel like a teenager again & a proud desi. And did all immigrant Indian dads love Jon McEnroe? Mine did! Pure brilliance to make him the narrator. Seriously, THANK YOU! You have done so much more than you even know. ❤️", "kateistall": "This show was AMAZING. I WANT MORE", "elcocolavayen": "The BEST @jarenlewison", "jessicawelzel": "LITERALLY THE BEST THING EVER !!!! Made my heart so happy and so funny 😂", "kswgreen": "Girl this show @neverhaveiever is everything!!! ❤️❤️❤️❤️ #Excellence #AllTheFeels Congratulations @mindykaling 🎉🎉🎉🎉 👏🏽👏🏽👏🏽👏🏽", "amramalama": "I remember putting my books at the feet of the idols on the first day of school, hearing my mom respond in Tamil, and having pasta nights and taco nights!", "sadiashaikh": "This was amazing, just amazing! @mindykaling and @maitreyiramakrishnan fantastic job! Can’t wait for season 2!! ❤️", "girlinpurple13": "I ❤️ the show. A 40+ mom of south Indian background from Mississauga. I absolutely related it to my own teen years (minus the internet...it wasn’t around yet)", "pavatha": "Woohoo loved it! 💜", "____illy___": "Loved it soooo much 😭😭 will rewatch it soon 😍", "supasa76": "@mindykaling just watched the first season in 3 days....can't wait for season 2....love Devi a fellow Mississauga girl!", "karensings1": "Loved it!!! Bravo to all involved in the show. ❤️", "noshin.naeem": "So well done Mindy! Really enjoyed every minute of it!", "kang_caroline": "@mindykaling I am hooked! Thank you for creating smart, funny, engaging content - well written and performed by talented a diverse cast👏👏👏.", "kimmy.ssmith": "Litterly my favourite show❤️", "real_dl2.0": "I listened to your interview on Fresh Air. I decided to check it out. It was so good (just binged I never do that). It was compelling. I loved all the characters. Well acted by all. Thank you 🙏🏾", "l_ara1423": "I need a second season", "poehanit": "Ok I've just binged the whole season, when is season 2 coming????????", "sven.ja13": "Sooo good and funny! 🙌😍", "katenewbigin": "A m a z i n g show! 💕#1!!!!!!", "sukritisaxena": "Season 2?", "naomiljay": "I just watched this from start to finished and I’m filled with so much joy! So what I needed right now. Please say there will be a second season! 🖤", "bedelia7": "I love this show sooo much! What a treat during this crazy time!", "hintolime": "@mindykaling just finished Never Have I Ever and my first thought was, I wish this was around when I was a kid, my second was I’m glad it is for my daughter. 💖 Thanks for giving us a voice!", "oceantothesand": "Just binged this. Laughed, cried, obsessed. I knew I was going to like it, but I loved it sooooo much. Please make a hundred more seasons. 💕", "tampamermaid4": "Amazing show!! Binged! Amazing acting, great story line and really entertaining! ❤️", "luvjude": "Who’s started round two binge? No.. just me? I am an adult.", "amulbutter": "Please let there be more seasons to come!! It’s so amazing to see Indian women star in a show like this. The show is so relatable on so many different levels. I laughed, I cried, I want more!! Thank you for doing what you do @mindykaling ❤️", "hardpressedstudio": "Just finished season 1 and loved every episode. It has so much heart and humor, which sums up life, really. Thank you!", "amanda619r": "So just tuned in tonight and it is absolutely amazing and hilarious. \"Sociopaths get shit done!\"", "nathalieshojaei": "Amazing show - even though I am not a teen anymore - I could relate to losing a parent - and I think it’s really good to display life after loosing a parent as a teen for all the teens - and also old people like me 😂✌️", "caioo.cesar": "@kayanedias série criada por kelly kapoour em pessoa", "kaurgurmeett": "The last 2 scenes definitely got my eyes wet 💕💜", "_linzybeth": "Turned it on at 9pm, binged the entire thing 🙌🏻😍", "jets85100": "This show brought such a warm light to my life this week. Mindy, I've been a fan of yours since The Office and The Mindy Project. I think this was the perfect next project for you and thank you for taking the time to find such a great cast and to write such a solid storyline. Can't wait for season 2. Bravo to the whole cast! ❤️❤️❤️", "cali_nessa1": "Best shelter in place show. Can’t stop laughing! 👏🏽", "farmwife.with.littles": "I love every project you have been involved with but, THIS, this is a whole new level. It’s amazing and hits home in so many different ways. I ugly cried through the ending and I don’t think it had anything to do with pregnancy hormones. I hope this show has a long and successful future ❤️", "tashnym": "SEASON 2!!! SPINOFF FOR KAMALA!!!", "l.martinez9": "Omg just finished and its awesome! ❤️❤️❤️ need season 2!", "vintagerosieposey": "💝💝👏👏👏Loved it! Season 2 please!!!!", "hfergoso": "Great show", "lisa.russell.33": "This show is an absolute masterpiece. I couldn’t stop watching it . What fine work Mindy 🔥🔥🔥. Lookout awards season this show will be a true contender. I love all the characters , and wow the main one what an amazing actress she is ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️", "sajani.atl": "Great show Mindy!!! I relate to the mother and it scares me 🤣🤣🤣🤣. The last episode was 🥺. So sweet, loved it!!", "besamehermosa": "#TeamBen", "dearyduo": "@mindykaling just finished the first season, you outdid yourself! It is so good!!!!! Can’t wait for season 2!", "howellemily": "Beautiful show, beautifully cast. Thank you for this bright gem of a show! LOVED it and looking forward to future seasons! 🤞", "embovberg": "Please tell me season 2 is coming soon 😍 so freaking good!!!! Mindy does it again 🎉", "mamamouse902": "Oh my gosh love love love this show. We have been binge watching and we are almost done. I want more!!! ❤️❤️❤️", "nushpie": "I absolutely loved watching @neverhaveiever .Great job @mindykaling . I can’t wait for Season 2 .", "kristinwpatten": "@mindykaling just finished in two days, I laughed out loud, I cried ugly tears and damn girl 👏🏼 it was SO so good! Thank you for all the amazing writing and all the feels 🥰", "simply_georgejeff": "This was awesome..too bad I watched it all in a weekend. I can’t wait to see what stories unfold! 😁😁 beautifully done!❤️", "ugieman": "I'm ready for season two!!", "emilyallard_illustration": "This show is amazing!!! I love your writing!", "tmgs": "FUCKING LOVED IT", "karmini7": "Binged the whole season... bring season 2 already!", "morganaikenartist": "Squaaaaad", "gypsylady_2": "Amazing show! Binge watched season 1, & I can’t wait for season 2!🙌", "has7896": "Love love love. Can’t wait for Season 2!!!", "syd.bentley": "Binge watched in one sitting - so good Mindy! Laughed and cried a lot! 💓✨", "iak2780": "Awesome series @mindykaling ... great job , seriously found Ben toooo cute at the end in the Porsche .... 💕💕", "its_teatimeofficial": "This show covers so much about life and there's everything for everyone! I binged the whole thing last night and it was amazing. So many emotions.", "chantydesouza": "Binge wanted the show love kamala ! Lmao why is this so relatable!!! ❤️ making us so proud. Love it!!! @mindykaling", "limedropz": "Where’s John McEnroe? He’s my favorite ♥️", "yoda1or2": "@mindykaling I adore this show! It was unexpected and I now accept your genius. The casting, the writing, the direction, the set... You achieved greatness 👌", "snaphappysazzy": "Just finished watching this.. soo good ☺️", "curls_coils": "Loved it!!! ❤️🙌🏿❤", "ragsandroses_": "This show is so special 💛✨", "emily_mcenroe": "Best show on TV! #neverhaveiever", "amreetasekhon": "Get it girl! Can't wait for the next season 🤩", "gailhinmerrick": "I’m a senior citizen and loved this series!", "bhamini76": "FAB!!! I can’t even begin", "claudia.levy.21": "I’ve watched, I’m sorry what did you do I don’t know😭😥", "ksalef11": "Such a great show!!", "langoya09": "I knew it was going to be good, but of course you exceeded my expectations. From the cast, to the well written dialogues, to the cinematography, everything was amazing. I'm so glad this show exists and I had the opportunity to watch it", "dinal1212": "Loved it soooo much!! I binged watched yesterday in Marrakech 💖", "ii_gayatri_ii": "What a show ♥️ You’re so talented, @mindykaling! I wish you’d do a reboot of Champions too. That was a great show as well!", "angelaseytlin": "I lovvvveeeee it! When’s season 2??! 🤗", "rachaelmasterss": "Mindy, literally everything you do is amazing! Binged it last night at Midnight 😅 COULD NOT STOP! 👏🏻", "kesha616": "I absolutely LOVEEE this show!! There better be a season 2!!❤️❤️❤️❤️", "kerrieguy_xo": "@mindykaling just when I think I can’t love you anymore! You have made quarantine so much better, you genius 💕", "three.stax": "I binged in 1 night 😂❤️", "jerillynj": "@mindykaling Thank you so much for this show!! Love it and love the intelligent humor provided during this time. So great and so grateful.", "tahitigrl": "Absolutely loved this show, can’t wait for season two.", "romany_creamz": "Great show... Cant wait for season 2💓💓😍", "verolove88": "team muthafuckin mindy mayne", "neasie125": "Love love LOVED it! Finished in almost one night!", "jaxmome": "This is the best show ever.....when is season 2? I need more...", "baconbacontv": "Binged and loved it so much!! 👏🥰😻", "bridesstyle": "@mindykaling Just finished binge watching #neverhaveievernetflix . ❤️❤️ So good. Well written, real, and fun. Hope there will be a season 2 in the future. Stay healthy and safe!", "motivational_quotes480": "Mam we love it💞💞💞", "jchappyx21": "This is honestly such a great show! Can’t wait for season 2", "bubblesofjoy.co": "Such a great show! 👏👏👏", "vidya.nathaniel": "I am a 30 year old Sri Lankan Tamil girl who recently moved out of the country - and I still feel like I can relate to Devi in this show. Everything I felt in high school and just life in general. Absolutely amazing. Also, the last two episodes were just absolutely beautiful. Loved it!", "syddd.reneee": "favorite show 🥰", "siany.sian": "Just watched the entire series in one evening and I am bawling my eyes out!!! I loved it, thank you xx", "suvarna_indermun": "I just finished binge watching it and I was suuuuper sad when I realised there were only 10 episodes! Cannot wait for season 2!❤️", "heartwayhealingyoga": "I need to watch this! My whole family keeps texting me, as I’m an Indian-American named Devi, who went to high school here in LA. I’m now in my 40s, so maybe this will be a flashback for me. lol.", "jemperlado": "Finished the first season in one day!!! (half day actually) 🙌🙌 Season 2 where are youu 🤣", "sjimmie15": "What a great show! We watched it over the past gewoon days in the Netherlands. It brought laughter and happiness! And took us back to our youth.", "im.kran": "Waiting for next season guys ✌️", "mlssagb": "@nishkish so sad I binged this too fast", "andreavcas": "I JUST CAME TO SAY THAT I LOVED IT AND THAT I NEED MORE CAPSLOCKS BECAUSE I WANT THE SEASON TWO ALREADY! THANK YOUUUU!!!! 😍😍😍😍", "minal.bhatt": "I just watched the whole first season with my 14 year old daughter- we cried, we laughed, we thoroughly enjoyed it!! Brilliantly made. So proud of you Mindy Kaling plus @maitreyiramakrishnan is an amazing actor ❤️", "anishanirvani": "Wow mindy just watched last night and am blown away by what a role model u r for brown girls. I wish I had watched a show like this when I was young to grow up proud of being desi and c people like me on tv. Love your humor and your awesome characters! 🙌", "adrianabramirez": "I just binge watched the whole season 💖💖💖 love it", "giadapeterpan": "Great show !", "rifahxo": "we better get a second season", "reza_rafiei__": "Good👏👏👏", "conorverse": "Great show! Please tell me you're going to be writing Ms Marvel, I need the same energy 🙌", "mindless_dreamer04": "I literally binged the entire thing the night it came out", "nehakkulkarni": "Love love love! @neverhaveiever", "chessicajen": "I love, love, LOVED watching this and binged everything is 24 hours. From screaming with laughter to sobbing my eyes out, I had ALL. THE. FEELS. loved all the topics this show went through and related so hard on so many levels! Thanks for such a GORGEOUS and diverse cast. Bravo tutti!!", "karina_michele": "Mindy anything you touch is gold! My daughter and I are OBSESSED! We were counting down the days, and as always you didn’t disappoint! We can’t wait for Season 2!!", "ms_jen930": "Binged it in 1 day!!! Loved it so much. Please come back for season 2 🙌🏼🙌🏼", "ishym174": "Just finished watching it. Im sad i finished now.Loved everything in it. Pls hoping for s2!", "ppaymer18": "This show is so good! Wish something like this was around when I was in high school!", "mr.jeffcopeland": "This show is brilliant beyond expectations.", "schizomeh": "done watching :) perfect way to spend another quarantine friday :)", "raysloscho": "I didn't expect to be crying through this show but here I am. Wonderful show, the world is better for having this story told the way you did it. Y'all did a great job", "stephanierosesnyder": "So good but that’s no surprise! I love everything you are apart of! ❤️", "gabbyblaisjones": "Just binged this! Such an amazing combination of serious, funny, and love triangles! My only complaint is that I want more!! ❤️❤️😍", "pearlintherough": "I have never laughed and cried so much! This show is a beautiful masterpiece, thank you for making it! ❤️❤️❤️", "ah.satan13": "This show is so binge-worthy from ep 2 !!! Thank you Mindy!!🤩 😍", "beckymota": "Love it!!! Loved @mindykaling the Mindy project so been waiting for what’s next. Lived in India for 8 years so love the the cultural mix! @maitreyiramakrishnan Devi reminds me of so many girls I used to teach. ❤️", "fatimahussein9": "Love this show! Amazing!! 🙌🏽", "shannonmannofficial": "Thank you Mindy for this show - this is the highschool experience I wish I had. Thank you for giving South Asian girls representation, I wish I had that growing up. Watched it all in 24 hours (who needs sleep right?) I cried at the end. This show is number 1 in the world, such a good job by the cast! Season 2 💛 please!", "nishamatkar2020": "As a South Asian woman, I was so pleased a few years ago to see a show with an South Asian lead (The Mindy Project) being shown in the western world. It’s so good to finally see a teen show with a south Asian lead too... finally! Asians aren’t represented well in the media, so thanks @mindykaling for leading the way!", "mrunal.22k": "So usually it takes a month for me to finish any series and this was first time when I finished an entire series in one night I mean I don't know how but may be me being an Indian and relating to the script just made this really interesting.Last episode was so emotional I cried while I was smiling. Love all the characters specially scenes with Mohan they were sweet and so emotional 🤍 now I can't wait for season 2 and 1st season is released like what 3days ago damn how long do I have to wait!", "moana_b": "Watched all in one day. Soooo good! Soo good! Loved iit!💙😁😁", "jcmartell18": "I just binge watched this. Amazing, like everything else you create! Your shows have gotten me through some hard times ❤️", "alexistague": "Mindy!!!!! 1) amazing 2) I cried more than I anticipated! Can’t wait for season 2!", "abheintz": "Binged the whole season yesterday! Loved it!👏🏼👏🏼👏🏼", "reynetti": "So good!!! When is season 2???", "gabrielle_germain": "I loved most of the show. My only deception, and it's a big one, was to have a girl teenager coming of age comedy narrated by an old white man I know nothing about... I still don't understand. This is such a shame. Was there no woman available to do a voice over?", "mpb_wanderlust": "Mindy, this show is everything!! Such amazing work. How you managed to create a comedy that hits on extremely relevant topics is incredible! Watched the whole season in one sitting. Bravo ❤️", "arcadia_stella": "I laughed, I cried, and I finished season 1!😭 I need more!! An absolutely beautiful show @mindykaling 💕💕", "covarrua": "I need Season 2! 🙏🏽 👏🏽", "nattingtonbear": "Completely sobbed when I watched the beach moment. It touched parts of me I didn’t know were there. Thank you for this beautiful story. It’s been really important for me right now.", "carmenyharmony": "YOU MADE A PERFECT SHOW. I watched it all tonight. Laughed, cried, ugh. It was perfect. Thank you for giving life to POCs, WOCs, kids of immigrants. Ily Mindy!!!!!", "n33mmy": "We lost my father in law to covid and it's been a really tough time. This show has been a saviour to keep our minds off the grief and sadness. Amazing show Mindy. Great to see a Hindu as a lead. ❤️", "wazinabt": "@mindykaling Sitting here bawling and laughing watching this, thank you ❤️ I miss my family a lot and thus was nice to watch ❤️", "bijaubijau": "@adrianavilkaite idk bet aš nesupratau, kad ji yra writer. Dwight makes even more sense now", "yolis_cervi_rodriguez": "Es muy buena ❤️❤️❤️", "dye22": "@menendez07 if you haven’t watched this, watch it! It’s soo good! I want season two already!", "haileyseidel": "MINDY! You are the John Hughes of our generation. This show is beautiful! 👏🏼❤️", "dimples_nel": "❤️❤️❤️❤️❤️", "aimenkhan_": "❤️❤️❤️❤️", "princess_pin_thind": "♥️😢 LOVE this show-representation matters!", "laura_e_83": "New favorite show!!! I already can't wait for next season.", "shunny.smiles": "ABSOLUTELY LOVED THIS!! The cast, the storyline, the dialogue, the shots - just pure authenticity & wholesomeness ❤️❤️❤️", "nimita_foi": "Luv luv the series!!! It’s like my high school years all over again😢❤️😂... thank you for bringing focus to our culture!", "jil109": "I loved it...I laughed... I cried! What an awesome cast! Just awesome! Thank you for keeping us entertained during this crazy time!", "milanjilka_art": "Wow!! Just finished streaming this. So beautiful, personal, and hilarious!", "doubleaguptamd": "so good!", "riggy82": "I love love this series! Please tell me there’s another season coming! I laughed, I cried and enjoyed every episode. Another magical show by @mindykaling", "hayleemei": "THE DIVERSITY IN THIS SHOW THO WOWOWOWOW 💕💕💕", "_natnyc_": "Okay, what an incredible ending. Literally in tears, I can't wait for season two!!!!!!!! #deviandbenforever", "hadarypr": "After binging the whole thing in 5 hours, i am so looking forward another season!! Its awesome!", "zazodream": "It's so good and funny!", "mem_77": "Incredible show. Funny & heartfelt. Thank you Mindy.", "iffyb22": "Props to whoever chose the music for the show—it’s 🔥", "traveller1978": "This show was amazing! Amazingly well written and acted! Great job!!!!!", "srahhhj": "Can season 2 come out like......tomorrow?!???!🥰🤪🤩😁", "hannahkranti": "It was amazing! I loved every minute of it! 💖", "kaley_harris": "You are a genius! I finished it in a day! ❤️", "dvafyd": "Absolutely the best show I've seen in a long time! I loved it and binge watched the whole thing the night it was released! Thank you for representing us! Thank you, thank you, thank you!", "prissymscbap": "What a great show! I can’t wait for season 2!!!", "lushpenko": "Meh couldnt get into this show - sorry 🤷🏼‍♀️", "omar.ep.jasso": "Can’t wait for season two @mindykaling !!!! Hi from Mexico 🇲🇽 #StaySafe", "newlyneil88": "We love it! Finished it in just 2 days and can’t wait for season!", "gabs.vas.lo": "Honestly freaking awesome show", "travelplusthem": "I need more!! Loved it! I am 40 year old with two toddlers and BINGED the whole season in one night. I barely woke up the next morning for my kids or work! But it was totally worth it!", "amberrosecoloredglasses": "#binged ❤️💜", "bigsexxy12": "So good can't wait to see season 2", "mehrana.basi": "congrats mindy! show is amazing!! 🤩", "petunia4184": "About to watch episode 3 now... this is SO GOOD! BRAVO! @mindykaling 👏", "alyybarbusci": "@mindykaling just watched all 10 episodes in one sitting. I NEED SEASON 2. This should have been around when I was a teenager. You’ve done it again you brilliant bitch. Brava 🙌", "rodrygosilverio": "😍😍😍", "kahall5": "IT IS SO GODDAMN GOOD! 💘", "rekha_ayalur": "Omg this whole show is my life 20 years ago 😩😩😩! #growinguptamil Awesome show!", "crumbsoncravings": "@ayrehm you have to watch this!! Such a great show!", "jenna.justine.94": "Loved it can’t wait for season 2", "andefree410": "So in love with this casting! Also, the repeat members from anything Mindy related were amazing!! Such throwbacks", "karenmhole": "@mindykaling chronic illness flares aren’t so lonely when I can binge watch your new show. Thanks for being a rockstar!", "michyoung15": "Binged watched in 2 days love it", "patitus___": "I love this show! Great casting, writing, story lines. It’s dope!!!", "thufa2": "Loved season 1. 🇬🇧 Binged watched it all. ❤️ Can’t wait to see what season 2 brings. 🤪", "jillibeanisblessed": "The show is fantastic!!! ❤️👏", "bg84ny": "What a great show and cast!! Loved it. Can’t wait for next season !", "madelinemadelinemadelineclaire": "I’ve made my daughter cry multiple times now from bursting out in laughter while nursing her. Appreciate the heart and laughs this show brings! 💖✨", "clau_maribelf": "Loved loved loved!!!! Cant wait for a second season , I realy hope there is one. Just amazing and super entertaining", "daydreamer_5": "Loved the show but I have a small gripe with the ridiculous accent Kamala & Prashant have in that episode. No need for brown folks to stereotype Indians further.", "wilmotsallie": "I’m feeling not so sorry for any or you in this pic. Are we supposed to? You all look healthy and happy to me.. stop posting this elitist shit please. Im sorry you’re friend was ill, but this only makes you all look badly posting this crap. I used to be a fan. No more!!!", "allybesh_saw": "This show was amazing. Why did I have to binge it so fast?! Thank you all for this - very much needed ❤️", "bphil06": "Thank you Mindy for putting us dark skinned South Indian girls on the map!!!! 🙌🏾 I cannot wait for season 2 ❤️❤️", "tpalliser": "I don’t usually stay up past 10 and I binged the whole season in one night. Loved it!", "melworleyy": "LOVE LOVE LOVE the show!! Waiting for season 2!!", "judy1032": "The music is so on point in this show! 🎼", "lucytruta": "Congratulations @mindykaling love love love this show! Waiting for season 2!", "mary_cockburn": "watched it all in a day🙌🏼can’t wait for season 2 !", "rochbrains": "I mean. I’ve just watched the whole series in one go. I’m totally in tears watching the end! Talk about representation - I had to pause it and say “hold up...did she say periyappa on Netflix??”, non-stereotypical, great characters, and Mindy-humour the whole way through - I just love it 😊🥰😊 you can’t relax now because I need a season 2 ASAP...🥰", "k80padden": "You KILLED ITTTT", "jadeorchidz": "I just finished in 2 days. So funny and heartwarming. This cast rocks and are all so beautiful! 👏👏👏", "sharellebelle": "Just watched the WHOLE SEASON TODAY!! awesome show and i teared up in the end!!", "smiley_holt": "@mindykaling thank you for \"neve have I ever. \" I laughed and cried. My dad died 2 years ago and while I'm 40 this really resonated with me. Thank you!", "melissaevanslee": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "nureshkaviranna": "@mindykaling Waiting for the next season!!! 🔥🔥🔥", "ameta.p": "Super cute show!", "abovetheclouds.21": "I love this show!", "_manali": "One of my fav bits was when Ben came over to Devi's and there were dosas for dinner. That was so much a part of growing up, sharing our food with my non-Indian friends and eating proudly with our hands. I've never felt so represented, so understood 👏👏👏", "kaleuhstar": "Obsessed with your new show Mindy! Just binged the entire season today!!!", "wintergirl2619": "I’m so hooked on your show Mindy I loved it 💕!!! I’ve been a fan of your in everything from 40yr old virgin to the office and now !! I love the story line and how you relate it to real things that people hope through 🥰 !!! I wish you nothing but the best and I hope you can make a season 2 much love 💕", "chrrrisssaayyy": "We all need Season 2!!!!!!", "ally_yoh": "John McEnroe just said “lewk”. Thank you for this show 😂", "helenlouisedixon": "Thoroughly enjoyed the show, thank you! 👏🏻👏🏻👏🏻", "ewennikki": "can you confirm soon that there is going to be more and when their will be more....... pretty please?", "bypallavi": "binge watched ✨ loved the representation and @maitreyiramakrishnan did so well! 💕🙌🏽 Congrats! @netflix season 2 please", "lil_big_eeevol": "Just started watching. Where was this show when I was growing up? 🤔", "sneebler_elf": "Just finished watching, wow those last two episodes 😭 can’t wait for more!", "abhansali84": "Watched the whole season in two days. Absolutely loved this. Wish this show was out there when I was in highschool. Loved loved.", "qvashti": "Mindy I ❤️ this show! I love the diversity! 🙌🏽🌈❤️I cried so much during the last scene at the beach, very moving! Thank u for showing everyone how deep, interesting, cool, cultured and funny Indian people can be❣️Also I love how different tones of melanin are portrayed in a beautiful light❤️", "oliviamariepickens": "🔥🔥🔥🔥 Luv luv this show. Currently on my binge", "lgels826": "This show is amazing!", "brianna__coburn": "Thank you so much for this show!!!!!!!! I loved every minute of it! ❤️❤️❤️❤️", "pennylane0611": "This show is the absolute best! I laugh, I cry, I saw “aww”. I’m only on episode 2. Thank you for giving me another show to love! 😘😘", "instadani00": "Incredible show! Loving it", "diana.diaries": "Every episode is so good!!! On a binge watch right now ahh!! 💗💗💗", "chocolategoddes": "Just finished watching 🙌🏽so cute! Love it!💗", "seiko11": "I just binged this show! I absolutely loved the prospective. As one of the token minorities of my school, I appreciated the nuances of the characters, and of course the incredible entertainment!", "ssofiamelo": "Amazing!!!!!", "denisewarrior": "Loooved the show!! I love learning new things about other cultures. I binged the crap out of this show! I was super tired for work the next day... Worth it!!!! 👏🏻", "nofunforangie": "Dang, Ramona!", "windycityteacher23": "Watched all episodes in 1 day!! In between my 2 Google Meets with my students! Loved it!! Can’t wait for Season 2 to drop!! Wow!! ❤️😂", "jenn9791": "Loved it 🤩😂🎉", "danielbonesgill": "Fucking trailblazing refreshing and incredible. So proud. 👌🏽", "kav17a": "Just binged the whole series. Loved it!!! Reminded me of growing up in the 90s, never related to a show more 😂", "misty_mccann": "I cried my eyes out so amazing!!!", "flawed_beauty00": "Great show!!!!", "amaranteguta": "Couldn’t help but binge watch this! Beautiful and fun, both much needed in times of social isolation in Brazil 🇧🇷", "melsoupppppp": "@mindykaling this show made me laugh and cry and feel all the emotions", "dreamplanpack": "Just finished. And in tears. Again you set the bar so high. This was so great! 🙌", "marshallxyz\nVerified": "Verified", "sangmakh": "Love your work @mindykaling xx❤💛💙", "mithusdiary": "Congratulations Mindy ! Awesome watch. The show is so addictive but I wanna save few episodes for the weekend.", "kathleangahroan": "Are we allowed to think the dead dad is incredibly hot in the show? He’s essentially an Indian brad Pitt. 😍😍", "mng1030": "Please do another season!! LOVE this show.", "arezoo_matin82": "What a fantastic piece of work, totally heartbroken I binge watched it all in a day 😢. Thanks for making it ♥️", "peacelovegus": "Your best yet! Love this show.", "perlaslife_uwu": "This show was so so so so so amazing I can’t explain how good and awesome it was to watch it. You made a master piece ! Legit loved it and I can’t wait for season 2 !", "payal_pundhir": "Loved loved the show❤️", "ali_kat_5": "The new show is fantastic!!!", "sjcampbell18": "Literally just binge watched this in one day, could not stop watching ❤️", "shoba.samuel": "Hilarious and cringey first episode !! Every brown gal's thoughts and dreams !! Lol Well done !!😂👏❤️ 🇨🇦 @debbiedaya @sweetjsoul @shalinism_", "erin3fan": "Love this show!", "rubina258": "Just binged and LOVED 🙌🏼", "hahayden1": "@aderong10", "gwynblcid": "JUST FINISHED IT! THANK YOU SO MUCH FOR MAKING THIS AMAZING SHOW! MUCH LOVE 😍😍😍", "thatgirlanaa": "I really hope you have more open casting call auditions for Desi girls that are trying to make it out there in the world. You are giving these girls hope and are pushing them to try new things and preserve. You are an inspiration to all south Asian women 🥰", "shivanie.subarumoney": "@mindykaling Never have i ever is an amazing series, I cried at the end it was soo moving. I look forward to season 2, your work is brilliant!!! 💛", "bexjohns2685": "Binged the whole series in a day! Loved it!! 💕 Can’t wait for season 2!", "delightofmyeyes": "I don’t understand how but I feel like I’ve seen every one of those kids before. They just all vibed. How do you do that. 😮", "jennywoowoo_": "THANK YOU FOR MAKING THIS SHOW!!!!! This show is SO SO SO good, in every so many ways. Literally everything I’ve been waiting for.", "jro2": "Thank you for this!!! I binged the entire season in one day! My dad passed away when I was a teen as well and I cried my way through this. It was so healing especially to see the parents side of going through the death of a spouse. The writing of this show is incredible. Thank you. 💗💗💗", "hatim914": "Waiting for season2😍", "gingerlye": "Legit wish my therapist was Niecey Nash!!", "malikkaghei_music": "I absolutely loved this show! Thank you @mindykaling for making a show that shows the real struggled of an indian american teenager 🙏🏼 Was a very relatable experience!! Waiting on season 2!!", "mistygayle80": "LOVED this show. There should be a disclaimer to not watch the last episode while you are working from home and have to get on a Zoom meeting with your boss and you have to explain to her that you aren't crying because they just added two more weeks to your stay home order but rather because you just finished Mindy's new show and the final episode made you ugly cry and you still aren't ok.", "lisave70": "In episode 4 and loving it!! ❤️❤️🙌🏽", "karen.keaney": "😘LOVE this show💞 I'm 61 years old and I have no problem relating to every character . Great cast, great writing SEASON 2 please.", "empressizabella": "@mindykaling another awesomely funny show added to your body of work! Why are you so amazing woman? @maitreyiramakrishnan where have you been all my life???? I love your on screen energy! Sadly, I finished the show in 2 days! I need more❤️", "noelle763": "please have a season 2!!!", "sarahbernheisel": "LOVED the show!! Very clever and well done! Binged it and hoping for another season! 🤞🏻", "perashouse": "Just finished, typing through the tears. It’s sooooo gooood, great cast, great everything! Can’t wait til there can be a season 2! 🌟😊💖", "s._k_.l": "Love this 🙌💕", "megcmeade": "This was so good! Can’t wait for more! 🤗", "mrsmastrande": "I binged this entire season last night - I’m paying for it today with my toddler and newborn but hey, it was worth it.... hilarious, touching and so so well done. The perfect binge, I’m only sad I don’t have an episode to look forward to. Thanks for this, looking forward to season 2!", "rfmb": "@manisha_raj I finished the season last night, you have to watch it! It’s really good🙌🏾🙌🏾💓", "_kathyyyyyyyyyyy": "Loved it and hope that there’s a season 2 and even more coming", "oliviasobservations": "Season 2 please!!!", "mollsjohns": "I watched this in it’s entirety! It’s captivating. This show,and it’s actors and actresses, brings back all of those relatable high school moments and emotions that hit me in a way “10 things I hate about you” and “sixteen candles” hit me. I laughed and cried the whole journey through Season 1 and I can’t wait to see what’s next.", "justinephoria": "Seasoooon 2 pleaaaasee!!! 😭😭😭😭😭😍😍😍😍😍", "pichit1217": "love love love the show 😘😘😘", "lapreciosa39": "@mindykaling amazing show congratulations !!!! I couldn’t stop watching and finished it 2 days. Bring on season 2 🙌🏼🙌🏼❤️❤️", "tyrahart": "Totally binged it lol I love this show! Hope there more to come 🖤", "pon_supafit": "OMG I can't wait for season 2. Watched season 1 twice!!", "shiana_ch": "I loveeeeeeeeee this movieeeeeeeee ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "christinems15": "Great show Mindy!", "xnora1980x": "LOVE IT!!! binged it !!! It’s a HIT in Germany!!!", "evilstig182": "Wow you guys!! I love it!! I laugh cried & ugly cried & now I’m sad I can’t keep watching 💔 Can’t wait for more episodes 🤞🏻💕", "jennstyle03": "I freaking LOVE this show!! Binged it all in two days 🤭 I am obsessed with all the characters.", "being_cici": "It's appalling to watch how Indians have been stereotyped in this show! It's 2020 guys. This is such a great team but you decided to go with a storyline that I cringed watching when I was 16 years old, and that was 15 years ago. Makes me sad!", "jrserbo": "we need season 2 please!!!", "coconutkiwii10": "This show makes me laugh and I absolutely loved it!", "meghanthoume": "Loving this show!!", "jvulic6": "Mindy, you probably will never read this, but I wanted to tell you that this show is fabolous and thoughtful. You never cease to amaze me with your ability to marry humour and wisdom. Looking forward to more seasons, fingers crossed!", "vmdronningen": "Loved it, thank you, need season two NOW✨😍", "safrinaalexandra": "This is the type of feel good show we needed right now! ❤️🙌🏽", "purni.91": "@mindykaling i just finished watching the show and it was amazing with a great cast! It's so relatable and the representation of so many different backgrounds! I loved it! ❤️", "parnikaachrekar": "Take a bow Mindy! We have been going through a dark phase and aren’t able to talk to someone really special. These times are incredibly hard and this show has finally brought a smile to our faces. We binged watched the entire season in one day. Thank you so much for such beautiful writing ✍️ @mindykaling", "adriiiii_r": "I love this show. It’s so relatable and funny. @mindykaling I love this show, just like I loved the Mindy project", "amla.nat": "Love the show, @mindykaling !! Even in Bollywood movies, Tamil characters are only caricatures and are always played by non-Tamilians, which multiply the cringe factor several fold. But absolutely loved the actors and their clean diction of Tamil. I have lived with my cousin in California for a while after finishing my master's and she has a daughter. I can tell from first-hand experience that the struggles of all three are real!! The first generation American Indian, the expat and the great s", "simbhusheezay": "Nice work guys 😏", "hellobeautifulmakeupservice": "My daughter and i just binged watched all the episodes we want more!!! So relatable...we cried and laughed together AMAZING SHOW LOVE LOVE LOVE IT!!!", "aktabs7": "Just watched the whole first season- I hope there will be more! So good!", "kellzusings": "Favourite show ever! I DEMAND season 2🙌😭", "rimi_m": "Just finished watching the show! I definitely need more of this show in my life! I love love love it! ❤️❤️❤️", "yajnalive": "Binged #neverhaveIever with my parents! Thank you Mindy for this beautifully cultural series! 💕", "rachheta": "Just finished it and it’s soooo good!!! Funny and sad and heartwarming!!! ❤️", "ferf3112": "I have so many questions about Mohan first of all how dare you?", "_nymphet_": "loved it!", "jennmarie1010": "Waiting for season 2! It was amazing.", "itschrisstine": "Looove the show", "buffyd908": "OMG, I stayed up until now, 4am in Toronto, watching it, it's so good!! All u guys rock! I can't wait for season 2, please!!", "ericas1209": "Just binged 👏🏽 can’t wait til next season as well as 4 weddings and a funeral 🙌🏽", "xcaitlinbrookes1x": "Amazing show loved it!!!!!!!💗 Can’t wait for my little girl to grow up and watch it!!!", "sanittad": "Season 2 please ♥️♥️", "mdtoyz": "Just finished it!! Omg it was so good. I didn't want it to end 😭🍿", "feartabby": "Crying at the end of season 1. Amazing show!!!! Love all the characters!!!! Thank you 🙏🏼", "anu1902": "What a brilliant idea to have John Mcenroe to narrate it. Hugs to the person who thought of it.", "bmeyer180": "This show was just amazing!! It’s the best thing I’ve watched in a while.", "cynthiaedith": "I CRIED SO MUCH 😭 at one point I yelled out loud “damn I need to go to therapy.” Perfectly written. The multiculturalism, my heart ❤️ so on point. Mindy, you POP CULTURE QUEEN 👸🏽 Genius as always.", "divabarbie": "@mindykaling Ma’am! This show! #amazeballs soooo good and can’t wait for the next season!", "neenxie": "So good! Season 2! Season 2!", "beanscream": "So good!! Didn’t mean to binge it but just kept pressing next!", "kandycayne79": "Just finished binge watching Never Have I Ever and I gotta say...amazing...funny heartwarming and unforgettable . The narration had me laughing so hard. Hope there will be a season 2 cause I need more Devi. Thanks @mindykaling for making this quarantine a little bit brighter for me", "sam_ross_cheetham": "Loved this show!!!!!❤️❤️❤️", "bookeducator": "I started it this evening and watched it the whole way through in one sitting. It was amazing and funny and beautiful. I already want to watch it again. Loved @angelakinsey playing a character. Also, as a Rebecca, I have to say she was probably my favorite character.", "abishrod": "You guys are killing it 🔥", "angelinalue_": "Binged till 6 am last night and don’t regret a minute of it", "lmgreen08": "Hands down one of the best shows on right now. Great plot development and wonderful nuanced lens on the grief process. Keep creating❤️❤️", "andresverstrepen": "I am binging it and loving it! You’ve done it again! 👌🏼❤️", "kinjal": "OMG I just watched all 10 episode.....#caintgetenough ...#browngirlpower#southasian THIS IS AMAZING!!!! CAN'T WAIT FOR MORE EPISODES....🤗🤗🤗🤗🤟", "c_laine_roddy": "Just watched every.single.episode after i put my two toddlers down for the night. My mom passed away 10 days ago, not only would she would of thought this show was such a delight as i did but those grief sessions really helped me process some things!!! Thank you for the gift and all the laughs! Can’t wait for season 2!!!", "me11yme1": "Omg just finished the season, it was SO good. Please tell me season 2 will be here soon, us in quarantine need it desperately...🙌", "dlaroche3": "Binged in one night! I laughed and cried and fell in love with every character and every story.", "umabelezapordia": "I AM OBSESSED", "adina_amanda": "Mindy !! It’s so good to hear ur “voice” again !!! Bah we missed it @bexlevin @carolinemichelle_couture", "briana2984": "I just want to thank you for the real, honest depiction of trauma, loss, and grief. This show is ❤️", "jaclyn.l": "@mindykaling just finished #neverhaveiever LOVED IT! 🎉🤩 Great show, so funny...so touching!!", "nelblake": "Binged it. Loved it. I laughed. I cried. I rooted for Devi the entire way and cannot wait until season 2!!! 🙌🏽🙌🏾🙌🏼🙌🏿🙌🏾🙌🏽🙌🏿🙌🏼", "justmeeshingaround": "thank you and your team for producing the deeply empathetic, intelligent, and hysterical content we all need right now! 👏🔥", "mcord0516": "Such a freaking fantastic show!!!! Had me laughing and crying....❤️ #breakingbarriers", "triplem12": "@mindykaling this show was such an amazing delight. I have always been such a huge fan of your work but this touched me on a personally level. Growing up I struggled with my Indian-ness like Devi. I can’t tell you how beautiful it is to see this type of representation in such a hilarious and touching way. Thank you ♥️", "mmaarisel": "Necesito más DevBennnn👏", "melissasiegel": "Ya, I'm a 30 something Canadian girl and couldn't wait to binge this show after the kiddos were in bed. Had me bawling that last episode! Love it! More please!", "devils_gothdaughter": "I finished it all.... no I need more", "sambaliga": "This show is EVERYTHING!! ❤️", "jaz_philly": "Amazing!!! Really good show. Loved it ♥️", "carry_ro": "Loved it!!!!! Finished in 2 days.", "nattygeee8": "BRILLIANT. thank you for creating this. The show I didn’t know my soul needed!", "lizzyb57": "@mindykaling omg I swear this is the comic relief I need during this pandemic Currently binge watching and loving it!!!!!!!!!❤️❤️❤️", "babyvonne86": "Love the diversity and multiculturalism within the show! We just binge watched it, it had a little bit of everything in it! 👏👏👏", "spowers84": "Hands down the best show I’ve watched all year!", "jasminebutler15": "This show was incredible (already finished it in two days) and my friends and I are SOBBING and laughing and have all the feelings. YOU’RE AMAZING QUEEN❤️😭😘💅🏼💕", "mackenzietx": "Just binged it! So good! Please say there will be a season 2... I must know what happens!!", "mrytorres": "Amazing🙌🏽", "eashley226": "So good! Just finished it. Very moving.", "pamelad50": "I just watched all the 10 episodes in 2 days. What a wonderful series. I can’t wait to see what you produce next!", "domonique_nicole": "Luvvvvv the show. You did it again!", "rlauren13": "Mindy, I just finished it all and loved it ❤️ Congrats!!", "rad_hika": "Please tell me there's going to be another season....love this show SO MUCH❣️❣️❣️❣️ Well done!!", "thakkarvm": "Thank you for this show. It’s amazingly sweet and beautifully funny", "acbelx": "Binged the whole thing - loved it!💜 awesome soundtrack too", "laniacloutier": "Hello! I just wanted to tell you that your tv show “Never Have I Ever” is really good and cool! This is different and soooo nice to represent indian culture! ☺️ I love your tv series, thank you!", "bhorgan22": "Finished the season in one day! I'm hooked! Bring on season 2!", "katiaaaamm": "This is so good!!", "k_vdh": "Such a great show!!! But I went through the episodes way too fast. Can’t wait for season two (I hope it’s longer!)", "ruben_so_cal": "I really liked the show... I can hardly wait for a second season.", "aliyahevelyngreen": "We need a season 2 lovely ❤️ my life depends on it 😂😍", "cathalessi": "@neverhaveiever is pure 🔥🔥🔥 this show had me laughing and #imnotcryingyourecrying at the end! Loved it, can’t wait for next season", "darlineddy": "I just binged Never have I ever in one day and it was amazing! I laughed, I cried, I cheered and laughed some more! Such a fantastic show!!! 💕🙌", "vanessaprilewelfle": "@mindykaling the show is so amazing! My heart burst watching it. I laughed and cried and felt all the feels. Hope there will be more to come. ❤️❤️❤️", "mrledebur": "I wish that representation included all groups as this show seemed to be fat shaming for no purpose. Disappointed", "aaahneetah": "Loved the series! Will there be a season 2?", "jilldobagginsbrady": "This show is everything! It’s so good!!", "tmarie730": "Love it!!! We need season 2", "shivanidixit": "felt every emotion ever, thank you @mindykaling !!! 💕", "mrs.idk.__": "You gotta give us a second season 😭😭😭", "lacibrace": "@mindykaling this show is so awesome!", "natalie62600": "I’m absolutely obsessed. However, the cliff hanger. First of all, how dare you, but also I love it.", "marshmallowmarsfan": "Can’t wait for season 2", "tara.watts.5680": "Phenomenal. Epic. Fantabulous.", "stephanie.ahiwe": "This show is SO good!!! Incredible cast, writing ...all of it ! Thank you", "gregjacjr": "This show is AMAZING 🔥🔥", "becetc": "I’ve binged it all it’s SO GOOD", "mrsmissoneill": "I just watched the entire season...today. So good.", "jobutler722": "Love it!! 😍 Thanks", "nathsanchezl": "😍", "deblakefox": "Never Have I Ever binge watched ANYTHING from start to finish in one day! Today, I broke my streak. NHIE is so wonderfully written...sweet, tender, raw, real. I loved every minute! Can’t wait for next season! Hurry up 🤞🏻", "jesmith33": "Damn @mindykaling I just finished this show and I cried like a big baby it was a beautiful and touching show and I haven’t had a tv show make me feel emotions like that in a while so thank you!", "f.annie.pac": "Finished @neverhaveiever have I ever today and I NEED MORE!!! SO good, exceeded my high expectations!", "irena_deretic": "binged watched and wanna 2nd and 3rd and so on seson like right now!!😣", "gemiuxvalle": "Loved it!!! Great show!!! ♥️", "melsendyouney": "This show is SOOO DAMN GOOD!! @mindykaling EVERYTHING you touch is GOLD!!!", "gbl40": "I love this show!!!!!! So good!!!!!", "valeriembelen": "Finished bingeing @neverhaveiever and I have to say it was AMAZING❤️ Will there be season 2? If so I already can't wait!!", "amyn463": "I loved the show so much! Made me laugh and brought me so much joy during this challenging time. I’m sad I have finished the first season! Thanks for creating it!", "zoeeelynn_": "I am so excited for season two !", "normaworma": "Thank you @mindykaling for allowing us to forget about this whole situation for a but. Binged the whole thing!", "ashberryy": "Oh my gosh just watched the whole thing. Much needed during this time. Can’t wait for season two! ❤️💃🏻", "reenamann20": "So I just finished the whole season with my daughter. Loved it! You make great T.V. When’s the next season?", "nattylite100": "@mindykaling keep bringing your magic! It’s realness sent truth.", "dutterbutterz": "This show was AMAZING!!! So many relatable moments❤️ @mindykaling you’ve out done yourself. I have really appreciated the ability that the writers from your projects have created such relatable characters. There were definitely a few tear jerker 😭scenes in this series. Keep up the good work! 🙌🏽💛", "anitachelva": "Mindy, thank you creating this content. Thank you for putting your heart on the screen in a hilarious way only you could do. Laughed, cried and saw myself. What an amazing show. 💕 thank you. Oh and the cast 👌🏾👌🏾👌🏾just winning!", "treedbaby": "Best show ever omg ❤️😍👏🏻", "auroraamor88": "Seriously my new binge-worthy show! Hands down lovinggg it. @mindykaling you are a comedy-producing genius! Thank you for being born. 🙌😂", "nakkione": "Love! Just finished binging...I still look like I ugly cried (I did). Gave it a solid thumbs up. #Netflix", "amiraa_v": "Just got done watch it all within hours. Talk about binging 😂 I loved it!! ❤️", "_sharnnnn": "I binge watched the whole season in one day lmao", "laqueen_andrea": "Can’t wait for season 2!!", "jay.inkster": "I just finished and @neverhaveiever was amazing! Thank you so much! Lots of home time teaching from home and it was fabulous. :)", "ahouefas1": "Omg @mindykaling this show! Amazing, what an amazing cast!", "thakkarharshi": "Loved the first season. Can't wait for season 2 thank you @mindykaling for this show 😇❤️", "sweetgigi": "cant wait for season 2! Team paxton 😘😘💓💓💓", "fresitashortcake": "I love how diverse the cast is🥺❤💚💜💙💛💓💖💞", "brendang_88": "I loved this show!", "alliepille": "The best show! Ready for season 2!! 🙌🏼", "nuz_hameed": "Season 2 pretty please 🙏", "emmashortall1": "OMG I loved it!!!", "chery16_smith": "Loved it Mindy, that is a great show!!!❤️", "kathrynbabbsmiller": "@mindykaling first show to make me cry since @greysabc 💯✅", "suvinda": "Binged it all on Day 1, on a week day 🙃", "mekennahmarie": "Just finished! I laughed, and I cried. Now I’m ready for season 2!! Such a good watch. ❤️", "drnoops": "I am loving Never Have I Ever on Netflix @mindykaling. This is straight 🔥. Basically puts in picture all of the feelings that we ABCDs had growing up. ❤️", "manoela.pereira.716533": "This series stole another heart of a Brazilian", "laacourgette": "Love the show so much , you rock @mindykaling", "lizkotsamanesdesigns": "Loving the show! I love everything you do, though. There were some lines where I could just hear Mindy Lahiri saying them! Haha", "agirlwithhairlikethis": "Thanks @mindykaling . Loved the show, the portrail of female teenagers and the complexities of the mother and daughter relationship while dealing with grieve.", "natalie_loves": "So I planned on watching one episode to “check it out” and instead ended up binging 7 episodes in one day. 😳 THIS SHOW IS AMAZING. Love to see so many POC. 💕", "xsugarxhookerx": "Just stared watching! I’m obsessed!!!!", "maudlavillo": "I can’t stop laughing. This is magic on screen. The writing is excellent and the acting too! This is exactly what I needed right now! Thank you, thank you Mindy! ❤️", "rowrow213": "This is, without a doubt, a new cult classic. Thank Mindy for bring this amazing show to life. It’s perfect.", "imyourperson84": "I just watched Never Have I Ever and I want to say thank you for this show. We're in a similar situation and you have given me an insight into what could be going on with my little sister. She was 15 when we lost our mom. Thank you again for such a great show that made me laugh, cringe, and cry.", "nadiaazmatally": "Loving the new #neverhaveiever. 🔥🔥❤️", "mmistry90": "Amazing show!", "nursecarmina2115": "So good!!!👏🏼👏🏼👏🏼👏🏼", "thana_kara": "Great show!is the neighbourhood the same set of the desperate housewives?it looks like it.", "samantha.noela": "Loved the show, thoroughly enjoyed watching it❤️", "buttercup_9000": "Hi Mindy! Hope you are well. I watched the whole season in a day and it was great and totally relatable! You are a genius! 😍😘🙏🏽🙌🏼", "pintomar_": "Very sweet show ❤️", "_r00_": "Thank you for this amazing amazing show. I should have known it had your genius all over it! I cried..i laughed..just hit home so much! Can't wait for season 2!🙏🙏🙏🙏", "erinkclark74": "Quarantine binged all of #neverhaveiever last night. Adorable! And then it made me ugly cry 😭. Thanks, Mindy!", "walkiriat": "@mindykaling I just binged the whole show today and I loved it. Made me laugh out loud and cry. Great show!! Congratulations 🎉🎉", "lakkerz": "Binge watched it al today. Please tell me there will be another series! 🙏🏽🤘🏽👌🏾", "lizziemilhoan": "This show has me all in my feels ❤️", "amberware25": "Omg this was the best . Season 2 please", "clairebear415": "Absolutely love everything you do. This was absolutely an amazing show. Can't wait for the rest of the story.", "wildeeberry": "Your new show is so good!!", "cresterandegg": "Watched 7 episodes today 😩 love it so much!!!! 💕", "corkyleezel": "Watched the whole season in 1 day...can't wait for season 2", "_chloeandersonn": "Watched the first couple episodes and I am already obsessed! 😍 it is so funny!!!", "ameliaa.kingg": "I watched the first episode last night and finished the last today. The last one made me cry. I’ll be ready for more as soon as it comes. A show filled with so much love, much-needed representation and just the right dose of humour! ❤️✨🙌🏻 You’ve all created something beautiful and highly entertaining—thank you & bravo! 👏🏻 Looking forward to watching (binging) season 2!!", "queen_fatifa": "I cried. I laughed. I LOVED Never Have I Ever!!!! Please have a season 2!!!", "lunadesigns414": "Cutest. Show. Ever! I’m sad that I’ve binge watched almost all of season 1 and now it’s almost over! 😭😂🥰", "borjasga": "Amazing!! Loved the show and I can't wait to season 2 🙆💜", "borkewoofe": "@mindykaling Never Have I ever has given me the ending that I desperately wanted for My So-Called Life. Thank you! Was this intentional?", "karensbon": "Soooooooooo good!!!❤️❤️❤️", "asleeplesslove": "Def binged it. It’s so good Mindy!! I love it! Can’t wait for the second season!", "yeezifdz": "Please we need season 2 already", "anetteke": "Omg i love this, can’t wait for season 2😍 I seriously love Mindy’s work🤩🎬", "naomie.tgn": "OMG I litterally was crying like a baby the whole final episode ! You guys have done an incredible work and this show is amazing", "sallycat471": "@mindykaling ,just binged watched season 1. Can’t wait for season 2 #bestshow", "lissy_summer": "Binged season one and need season two ASAP! I LOVE this show! ❤️", "nwbulkmarket": "Loved it ! It was awesome", "jotravellingfitfoodie": "Just binge watched, this was amaaaaazing!", "coachrosekathy": "LOVE this show!!", "patty.braun.98": "I binged it in 2 days!!! So ready for season2!!!❤️❤️❤️❤️", "lauracorb41": "Binged it in a day. Loved it! What a talented actress Devi is. Cried at the end! Can’t wait for season 2! Beautiful show! ❤️", "carmengcool": "This was amazing!!!! Can’t wait for many seasons to come!", "livinginthemoment637": "This is the best show I’ve seen in a long time! Brings to life so many similar experiences in high school and growing up in family that did not fit the “American” mold. Thank you sharing and creating a show that we can connect with!", "jewelzers": "I enjoyed this show so much, more please! Also I would love for a recipe roundup of the Indian dishes featured!! I think I saw some chana masala but I don’t know what the delicious turnover dish was and I feel like I need it in my life.", "mzlilo": "I LOVED this show! Everything was perfect.", "mariesurmont": "Amazing show 💓. Need to slow myself down, will be so sad when I finish the episodes.", "arbrown25": "Love, love, LOVED it!!! I couldn’t stop watching - so entertaining and well-written!! Congrats to all who made this magic happen!!!! ♥️", "barshimrit": "\"every little thing she does is magic\"", "jad114": "Just binged and absolutely loved it!!!! 😍😍😍", "coco.de.la.luna": "Daaaamn, i loved loved loved it without knowing you produced it, now I love it even more. Thank you Mindy <3", "harader": "i want to watch this @em_and_mms", "jordybond": "IT IS INCREDIBLE. Already can’t wait to re watch.", "__hersheyy__": "MINDY thanks so much for bringing actual brown representation to Hollywood!! This tv show was so impressively relatable and amazing and it made me cry so much. You’re truly a genius creator!!! ILY 😍😭", "brinthasi": "YES YES YES!", "runieeeee": "Love love lovvvveeeeee @neverhaveiever 💗💗 but ZDAMN! THANK YOU BRINGING BACK SENDHIL 😭😭😭😭😭 like DAMN Mindy. DAMN. THANK YOU 🙏🏾", "doneya06": "I LOVEEEE your writing, it’s like anything written by Amy Sherman Palladino SO distinctively you and amazing!! ❤️", "shashasheester": "I laughed, smiled, and cried after binge watching this! Thank you Mindy, you’re a GENIUS!", "shainaestime": "@mindykaling almost finished binging never have I ever! Love it! Amazing writing and hilarious! Thank you for keeping me laughing! 😂😂😂 👏👏👏🔥🔥🔥🔥. Love Devi's mother!", "sakibombz": "@mindykaling Thank you for making this show and brightening 2 of my quarantine nights!!! (A little bit annoyed at myself for burning through it so quickly tho)🤦🏽‍♀️", "nadioz": "@majdafighter j’ai déjà tout regardé 🤣", "artimous92": "J'ai adoré la série, love from France 🧡", "samanthatorress": "Started the show last night and I’m obsessed, it’s sooooo good ❤️", "arathyh": "🙌🏾🙌🏾", "visionarymaria": "THE MOST GORGEOUS CAST", "lesaroser": "We loved the show..❤️❤️", "mrsuntouchable34": "Finished this is 2 days, absolutely amazing! I need season 2 right NOW!!!!!🙌🏼🙌🏼🙌🏼🙌🏼", "jlew123": "@kbrown619", "neethanaidu": "Stayed up til 2am watching the whole season. 🙌🙌🙌🙌 Great job!!!", "sabrina.d.pfeiffer": "I’m loving the show! My husband and I have limited time since we have a 10 month old baby, but we look forward to watching never have I ever every night together after our baby goes to bed!", "camsantos1231": "I just finished a 2 day binge! I loved @neverhaveiever !!!! I laughed and cried! It was a great series!!! @mindykaling 👏🏻👏🏻👏🏻👏🏻", "lil_brea_cheese": "Just started watching this last night! So good!!", "jannagentry": "I loved it so much ❤️", "tinkerbrawl": "I inhaled it in one sitting, so freaking cute and sweet.", "drkakaliqueenb": "Mindy, Nalini said Bhattacharya referring to someone else in your series. Yay! So great to hear my last name.", "allyaneresende": "So good ❤", "jannibee": "@mindykaling my daughter and I binged and loved. We laughed we cried...thank you for this amazing escape", "elizisen": "It's so good! I loved it!!", "cathysully2": "Our whole acting studio here in Texas is watching this TV Show because @jarenlewison is so loved by all of us here! This show is so wonderful On so many levels. I’m so happy!!!! Congrats on such a lovely Show ! Jaren speaks so highly of you all, and the writers and the experience! ... And Thanks for giving the world this TV show! 👏🏻👏🏻 ❤️", "giannacarusso707": "❤️❤️❤️", "caromaribell": "I love this show! Already watched all ten episodes!! ❤️❤️ I’m so ready for season 2!", "annsysp": "Loved every episode!! ❤️❤️😍", "straightfromthecurls": "Mindy! I loved it. We can all relate to the angsty teenage years but add grief into the mix and it's a whole other game. Thank you for not being afraid to tell the tough stories and writing for a diverse cast. Thank you for highlighting the tricky nature that's grief, and showing how it can manifest and impact people in so many different ways. Loved it! 💕 #NeverHaveIEver", "theediamondchels": "I’m 10 minutes in and already laughing out loud 🔥💛", "niccybfish": "Absolutely loved this!! Want more!", "marishaemily": "@deevo22 you need to watch! This show is amazing!!", "honeybee1205": "@mindykaling loved this show.! Finished it 2 days! The finale made me cry.", "victoria_poland2003": "I love the non-Bollywood characters!!! Finally!! Finally!! The world can put away their lightening creams cuz this cast shows that it ain't necessary! Great Show. As a brown skinned Indian from the Caribbean (where there's real sun) I am beyond ecstatic to see Devi! Time time enough. Raj from the Big Bang Theory wasn't enough. Thank you so much Minday!!!!", "anshebakes": "❤️❤️❤️", "hannross12": "I watched it all this morning! It was so good!!!", "tazbill11": "Mindy, just finished bingeing. It was really good. Hope there will be a season 2.💖", "christineallison": "I just finished it and I’m crying! loved it so much. 💛💛💛💛", "ivysnaps": "BINGED AND I LOVED IT!! 💕💕", "patron.saint.of.sadness": "Such an amazing show!!!! I binged the whole thing last night and who ever chose the music for it is a genius, I had to pause so many times to shazam 💖💖💖💖💖", "ehromalley": "Binged hard and LOVED IT", "tluzius": "@mindykaling I need more!!!", "kasturimia": "Loved it, binged it, and looking forward to season two 🙏🏻", "riofiona": "You did it again, @mindykaling ❤️😭😘🌹🤗", "vanitha47": "@mindykaling @maitreyiramakrishnan loved loved loved the final two episodes. You captured father-daughter and mother-daughter relationships perfectly. I got such a kick out of hearing Tamil words on the screen! Can’t wait for season two!", "robynsolange": "@mindykaling thank you so so much for this show. Losing my dad was in my early twenties when my siblings were 16 was the worst thing I've ever been through. Despite it being nearly 10 years I've been missing him more than ever recently. This show made me sob and laugh within minutes of each other and perfectly encapsulated the terror and anger you go through for months afterwards. Can't wait for another season.", "leah.chelsea": "You really 👏🏽 did 👏🏽 that 👏🏽", "katonah33": "Binged watch this lovely show last night and made me forget the drama of 2020 and left me smiling and laughing & crying. Great job Mindy and loulie!! Season 2 come quick!!", "helga2400": "I loved this show, keep it up !", "maikaboss": "Thank you so much for putting this out at this time😍 I just hope you filmed the second season already because I want more! The story telling is such a fresh take on highschool! The characters are all loveable.", "_sustain.abi.lity_": "so when is season 2 coming", "joseburger1": "Season 2 please❤️❤️❤️❤️❤️❤️❤️", "omyajoshi": "Loved the showww❤️❤️", "lombari.arnold": "Such a good show!!! More episodes!!! 10 was too short!!!!", "carmennn_b": "Yasssssssss love you girl ❤️❤️", "forever_bythaqja": "It was awesome. I binge watching it and now my head hurts from so much crying.", "giantcracker": "So gooood! I was going to watch 1 episode and had to stop after 6. 😂 Thank you for including a person with DS doing typical stuff like hanging with friends and working. ❤️❤️ I have a daughter with DS and this is so important!!❤️❤️", "itzy.vo": "This show made me bawl my eyes out! Thank you @mindykaling. Need to binge watch it all over again 😭", "emma_canalese": "Thank you so much for this show and all your work. It is making me so happy I am crying, both because it has such an beautifully talented diverse group of people (more, more, more, more of this everywhere!) and because it is so relatable and heartfelt. You and your team rock.", "jknieforth": "Amazing show! I’m binging to the best of my abilities with 3 young kiddos running around. I also have barely picked up my book in 2 days #priorities 😆", "charmed83": "@mindykaling and the cast: thank you thank you thank you, just loved the show. Am soooo excited for season 2. @darrenbarnet Happy Belated Birthday 🎉🎉", "stephaniemargotbecker": "Love the show amazing !!!!", "justtrynagetslimthick": "You really did something special. This exploration of a young girl's grief was so deeply moving. Just had me in tears. Bravo 👏👏😭😭", "lebbyloves": "Totally binge watched it! I laughed so hard in every episode... definitely could relate!", "rosewelch7": "Ahhhh 😍 Paxton fricking Hall fricking Yoshida!!!! @neverhaveiever @netflix", "nilofer.amini": "Just finished all ten episodes in one sitting. Balling my eyes out on the last episode😭 PLEASE TELL ME A SEASON 2 WILL COME!!", "lonnierhannah": "Love the new show. If u ever need an extra white dude that probably can't act. I'm your man...❤️❤️", "betsyeann": "Sooo good!", "sonal1773": "I wish I had this show growing up...I could so relate to Devi! Love you Mindy!", "meeraramlochan43": "We need season 2 please, please Mindy!", "sonia.p.shah": "Just started watching last night @mindykaling and you have me hooked! It’s about time there were more Indian-American shows out there, that are not over-the-top satires of Indian culture. Can’t wait to binge more of the show! You’re amazing! Girl power!💪🏽", "damikotawa": "Season 2 pleaseeeeee ASAP", "amandaraeofsunshine": "Love this show so much! 🙌🏼", "sheri190183": "Omg I just binged watched the entire show today. I haven't cried so much since Lion!! What an amazing show and gorgeous cast xx", "snazzynaz26": "I love it❤️", "baltimoreshots": "Just watched all 5 hours of the first season. Very relatable and real. Never watched the same show this long, in one sitting, in my life.", "jacobiclarke": "Amazing show. Brilliantly done. 🙌 So thankful for it right now! You're killing it. 💕", "jb.media": "@mindykaling I LOVE, LOVE this show!! Watched the enitre season, in one sitting, not because of the having to stay at home, but because it is THAT good!! During this lockdown, the last day I worked was March 7th, I have been able to watch your programs, and I love your work! Currently, I am aspiring to be a showrunner, and hope to be able to work for/with you, some day! Blessings and most importantly, congratulations, Queen!! 🔥🌠❤️🔥👏🏾", "fadianoordeen": "Upto episode 7. Mindy kaling you never fail! L. Your cast is amazing! Loved the narrations👍", "kalapatel12": "Season 1 binge watched in one night love it .... ready for Season 2 ❤️❤️❤️❤️ amazing; writing, directing and acting 👌🏽", "hiralpatel1": "@mindykaling you absolute G", "mra2025": "@mindykaling I just binge watched #neverhaveiever all night and all I can say is WOW!! Every episode was brilliant! Growing up in NY, there weren’t enough people who looked like me on TV and I just grew up accepting that this was how America was. But you have truly changed that for South Asians like me who now feel represented on television. I am so delighted that my daughter gets to grow up watching such talented artists like you , @maitreyiramakrishnan , @richamoorjani , and @poornagraphy_ on television as leading ladies. Thank you so much for creating such an amazing work of art 😘😘😘! This show is seriously going to become a worldwide cult classic even larger than Freaks and Geeks!! I just know it 🤩!", "tanveepatel": "Love it so much ❤️", "itsbeccabecks": "I LOVED IT❤️❤️❤️", "nurinirdyna": "Finished it in one night need more seasons please 😍", "aiesia": "Stayed up late watching it while nursing my baby! Love the show!! 😍", "almace.i": "Absolutely loved the show! Binged watched in 2 days! Thank you so much for all the laughs and the feels! ❤️ Amazing job! 👏🏽🙌🏽🙌🏽👏🏽", "staceyloumac": "❤️❤️❤️❤️❤️❤️❤️💃🏻💃🏻", "akovvali": "@itsarchieee I ended up binging the whole thing last night 😂 it was so good!! I called that ending! 😍", "stephchin23": "My new favourite show! Binged it in one sitting!", "thrumyii": "Love the show!! You are the best! 😍", "teimy_teimy": "I looove this show! Binged it! I want more. 👏👏👏Can't wait for the next season.", "joie.de.vivz": "It’s so good! I love it! 💕💕💕", "_.bottleofrose._": "This show is actually 🔥🔥", "drodriguez2125": "Binged last night and went to bed late cuz of this show. We need a season 2 ASAP!!!!🙌🏽🙌🏽🙌🏽🙌🏽", "mayravilla1": "@mindykaling PLEASE tell us this is renewed for season 2!!!! Binged in a day and need more! ❤️🙌🏽", "aime1218": "Great show!!! Can’t wait for season 2. ❤️", "grumpy_katydid": "😍😍😍 Amazing", "nikkish83": "@mindykaling so looking forward to this show", "kittyyyyyyykattttt": "Please season 222222 please 🔥", "mzsocks7": "I saw your name in the credits and that’s why I put it on. I loved it and watched it all in one day 🙌🏻", "myra_p13": "Just finished watching OMG, absolutely loved it, can’t wait for more. @mindykaling you are a genius 💕", "emilysmith06": "It is so so good!!", "angeleyes3117": "The show was amazing. I stayed up all night to watch every episode. Can't wait to see more. 😊", "mananda2108": "Such a great show! Congratulations!! It's going to be a hit!!! 🥳🥳🥳", "trej._": "BABIES I LOVE YOU ALL", "aideegr": "Mindy it was incredible! I can’t wait for the second season 💜", "jessicanimis": "Definitely binge worthy!! Loved it ❤️❤️", "jackie_terceira": "This show was so great! I binge watched it on Monday! Cannot wait for season 2!!", "melaniecooley": "Seriously this show is amazing! I loved it! I only watched it when I saw your name on it (don’t really go for teenage shows...) and seriously, I feel like I relate to it so much (minus being Indian, losing my dad, being smart, having friends, 🤷‍♀️) Thanks for making a totally unrelatable show (for me) and connecting me with it so much. I’ve never laughed so much, or relived my teens so much through any show. Can’t wait for season 2!", "einsam.krieger": "I just binge-watched it yesterday. I'm of Indian origin and the portrayal of the expectations of Indian culture and society took me back. Also, the turmoil between mother and daughter, gosh it struck such a cord and took me back to my teenage years of feeling powerless and misunderstood by those who had control of my life. Great show. When's season 2 coming?", "nat_gudel": "So good Mindy!!! Binged for hours last night!!!! ♥️♥️♥️", "liddlefishy": "Thank you @mindykaling thank you so much for this amazing show. I laughed, cried and laughed so more. It brought back memories of my teenage years, the good, the bad and the ugly, and the sadness of losing a parent. I felt every emotion and experience that Devi went through. What an amazing show.", "boodaboi": "THANK YOU THANK YOUUUUUU", "justguix": "LOVE THE SHOW SO MUCH <3", "tiegsummers": "I love it!", "chellewedance": "SEASON TWO PLS!", "mandy2770": "Our family loves this show! Ahh! Thank you so much! ❤️❤️❤️", "therealkatberman": "@mindykaling This is a beautiful, hilarious and heartwarming show. I am such a big fan of you and all of your work. Thank you for bringing us all some levity during this tough time. You are a gift!❤️", "lyssaaaalu": "I loved it!!", "mike_sam2020": "Awesome!!", "jvshr": "ben can slide into my dms anytime", "jrt8103": "Please say there’s going to be a second season", "nieche": "Binged on this today!!! Loved it... felt like seeing my family on tv lol", "cornlspniel": "love this ❤️", "s.anumta_iftikhar": "Loved it!!!!! @mindykaling ❤️", "twochickpeasinapodcast": "We just binged all of this last night and plan to talk about it on our podcast BECAUSE ITS EVERYTHING !!", "gtingzthejeweler": "@mindykaling @maitreyiramakrishnan Tamil Pride!", "daphneiskarungi": "I love it just binge watched it all on the 27th 😍😍", "karu22uk": "@mindykaling loved watching every episode...and being an Indian could relate to it. So gutted that i've finished watching all the episodes in one go! A great series...hope and wish to see more episodes. Loved every, minute, laughed and cried! No matter what age you are it's a great show to watch. LOVED IT!! 😘", "itsfayekata": "@mindykaling you sure know how to create such great shows. I loved it and binge watched the entire season and will again this weekend! ❤️❤️❤️ keep em coming! 👏🏽👏🏽👏🏽", "m4mnky": "I binged this show early Monday morning while with my newborn. This show really resonated with me as a child of immigrant Hindu parents born and raised in Toronto, esp the puja episode! 🤣 I love this show!! Waiting for season 2 🙂 ❤️", "shafiaza": "Brilliant; laughed, cried & repeat", "jbbrodhecker": "Such a good show! You are hilarious and always write shows/scripts that keep me laughing and crying the whole time! I LOVED the Mindy Project and never wanted that show to end so I was super happy when I saw you made a new show! Your sarcasm is the greatest... you deserve to be called the best comedian ever bc you are the most real!", "gayakumaralingam": "Loved it! Being a Tamil Sri Lankan growing up in Australia I could relate so much to this! Binge watched it in 4 hours once my boys went to sleep! There better be a S2!❤️❤️❤️", "__xansx__": "Can't wait for season 2!!!!❤❤❤", "brooklyn2489": "God dammit that was a fantastic show! Just binge watched the entire season today with my best friend @jason_power Gave us all the feels and the end really got me. I lost my dad in 2009 when I was 19. I loved everything about #neverhaveiever 💕💕💕", "kalaka_oageng": "I sat through the whole thing", "djjeffy_jeff": "Wow! Your show caught me so by surprise!! Can not believe how much respect I have for you! Amazing work of genius!!!", "sarayuanand": "This is show was great period! But as a Tamil/Telugu girl raised in India and travelled the western world for education and struggles to fit in either box because I just don’t belong, it speaks volumes to me. It was authentic in every way and perfect. Looking forward to more seasons!!!", "bennesssy_": "Damn this show lowkey slapped 👀‼️ finished it in 1night ❤️", "ally120385": "I’m from Belgium and literally love your show. Binge watched in one night! What a great great show. I’ve laughed, I’ve cried. The characters are so good, the story is so good. Finger crossed for season two!", "simone_naicken_g": "@mindykaling thank you for bringing this to screen.. I havent heard the word Khanna in forever! Such a breath of fresh air. Growing up in South Africa the culture is way different and I watched all the teen drama of American tv. Could sort of relate but not to this extent. Honestly wished I had something like this to watch when I was a teen! 🙌 it's so raw and so real.. amazing work. Hope we get more series like this❤️", "sweetpuneet": "It was sooooo good😍😂😭💞", "the_lady_and_her_books": "I'm probably going to finish it this evening but I can say that I'm loving it. The drama and the comedy are so well balanced and each character is more than what it seem. 👏", "clairelouporter": "Thank you @mindykaling this is the best show, you are a genius 🙌 me and my husband absolutely loved it from start to finish. Just what is needed in #coronatimes. Sending positivity from the UK. Stay safe.", "african.mermaid17": "So no 4C in sight huh"}