{"molliegonewild": "Dream squad 🙏😍💃💃💃", "jefferson027": "@katharina_mildes2", "stahhs": "Just finished this series it was so good!! I cried at the end. I really was impressed by how funny and relatable it felt even though I’ve been out of high school for like 15yrs 👏🏽👏🏽👏🏽", "jingivelasco": "2da temporada please", "mconway0020": "Loved it! 💫💜", "aquinocarhart": "I watched all of Never Have I Ever because of this post and am so glad I did! 😭😭😭 I've never felt more seen by a show before. I laughed and cried my whole way through and loved every moment! ❤️❤️❤️", "wallacegreene21": "This video caused me to smell the most vile thing I have ever smelled.", "thelifeandtimesofjane": "Love this show", "itsme_nickiiii": "Loved this series! 🙌🏾", "ziminqian": "@zihuaqian", "netobviana": "@marcosrangel_", "kerwinandnikita_naicker20": "Being a brown girl and watching this was totally relatable!😍 it's such an amazing show. I HOPE SEASON 2 WILL BE HERE SOON!😊", "vurginya": "@jongheeq", "srtinder": "Second video looks like a baby @neethuc90 😂😂", "xx_abbs": "@mindykaling hoping we get a season 2! 😍", "kieraross04": "we need a season 2", "yo_itsdenisse": "@mindykaling is there going to be another season", "yeeah83": "GREAT WORK!", "bekyboo83": "@rachelg1984 I seriously can’t get enough of this song and I haven’t even watched this show yet!!😂😂😂", "caruso_kealani": "@malia_anna", "earthward09": "😆😍", "baryyoga": "@shiranathan thats the show I was talking about", "nancyariasvill": "😍👏👏👏👏🤗", "_.hooligan.caryn": "Why did you end season one like that she had a good thing going but she had to ruin it😭😭", "goyako": "@oliviaakemi they are so cute!", "potolitococo": "This scene was played on loop. Thanks for the great show we can relate to. Proud.", "aemcewen": "Loved this show !! 💕", "mazvitalewton": "We just finished tonight. Loved this show!!! Season 2 please?!", "drklaud": "Ahora tenemos que hacer esto @meergalvan", "zarasibda_": "@azraa_syed", "__moon_blue_": "@jk_10l", "thamsudir": "Started to watch this show. Love it 😍", "diana03xo": "Fantastic show!!! Loved every minute of it! ❤️🇨🇦", "pawloskiii": "I just binged allllll episodes and have already googled asking about a season 2 👀👀👀", "beca_saetre": "@sofiacoelho.j hahahha", "montica_0403": "@ellaqm", "amberbindra": "❤️❤️❤️❤️", "italyyy_": "This show is so good! I hope season 2 will happen!", "cjtheurbanite": "Easily one of favorite shows, but MK does great relatable work.... Also Go #torontoraptors GO!!!!", "slprouse": "@nicoleashh swipe left", "vicmedley": "@marjoreally", "harpavan": "@pri_pri._ challenge accepted", "paulorafaelfr": "@sanosukehelder let's do it! Vamo fazerr", "jackiecaps": "@mikhelbeltran", "saila_15": "@monalisaa.n", "virnabatist": "@joao_duailibe a mãe dela aparecendo kkkkkkkkk", "chandnsabadan": "Bro why did have to make it so stereotyped 🤷🏼‍♀️🤷🏼‍♀️🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️", "jerryberry_2008": "Hubby & I binged watched the entire season and we loved it! Thank you for representing more desi women in film! Proud Tamil x", "isharam": "Every Indian lady can relate to the moment when her momma comes and suddenly she has a tee on underneath the dress. So so great!", "amanda.froehlich": "@morganaschneck", "4popular_baby20": "@megustarose08 are we doing this tomorrow or what!!???? 🤣😜", "meimei724": "@mindykaling Season 2 please!!!", "missoldmonk": "@anaina.k watch Never Have I Ever and teach me this dance please 😚", "rachsylee": "@sarahcoopsmith yeah yeah yeah yeah yeah. 🙌🏽", "jumunizl": "Very amazing❤️👏🏼", "fai_thher": "What episode", "the_9th_roughsoul": "Absolutely Adore this heartfelt story ❣️ hv watched all of them in 2 days😛", "lanigobaleza": "@arnie_barney @_malgorithm @villageidiom @marylinm @glossanddirt @hillarymanalac @lovejaimee so sad that we didn’t do this at my bachelorette...", "jay_breezyy": "@ma_castillo_ love them", "q.hmc": "@sophiagerde do we all need to order wigs and give this a go??", "gabimelo03": "@raycinelli", "angelaclaire11": "@titlereptaylor found our dance for the expo this year. Practice starts now!", "emmaaaaa_t": "I wanted to let you know I’m loving this show! It’s been cheering me up since I’ve been kinda depressed. Thank you 💕", "paulipauli6": "@olenkalenki", "huzefa.idris": "We need season 2!!", "hessian1776": "I love that Devi's mom makes her wear that t-shirt under the sleeveless dress (such an Indian mom move), but its OK for her cousin, Kamala (a.k.a. the Desi Gina Gershon) to wear Jeggings and a skin-tight sports top while doing Pilates on the front lawn...yeah, that's about right LOL!", "maddforthor": "fabiola literally looks so old compared to them 💀😂", "missvwolf": "@anchbib This is the Tik Tok scene I was telling you about from Never Have I Ever 😂", "laaurenbroadbent": "@olivialsilvestri let’s do this 😂", "thaynamchaves": "@leticia_chaves2 vou fazer kkkk", "ehegssss": "@lisaaa_d @ellie.rasmussen but the full length thing obviously, with outfit changes", "jonathan.j.bernard": "@thisislegs @thuy_kim @alya3737 this was y’all in high school 😭", "luna.and.her.stars": "Love it, even my husband loves it! 💕can't wait for season 2!", "leahmunk11": "@clairekollersmith", "l_dominique": "@lalamadd shall we recreate?", "realkcfan": "Love this show it so funny and well written I ended up binge watching the first season in one night can’t wait for season 2", "maggiesiebss": "Just binged watched this show it is SO GOOD and SO well written and these girls are SO talented! When is season 2??", "nnivhsaa": "@bijili do this tik tok challenge !", "persis_jaiswal": "@pallavi_pandey_tripathi", "flaca_steph": "❤️❤️❤️❤️❤️❤️", "amelia.hartman": "@morgan.mckinsey can’t get enough.", "sunandini93": "@ananditaseth best scene ever 😅", "surinamaria3": "@thatgirlviv", "ojas555": "@aayush211 next trip we should all do this", "dudagarioli": "@_luisamagalhaes vc precisa ver esse post", "aayush211": "@ojas555 varun can be the irritating mom who comes to spoil the show. Basically varun!", "allibisaacs": "@maria.tuite", "lmiranda_2": "@sabrinah_19 HOW CUTE IS RAMONA IN 3", "adya_white_": "@mindykaling sooooo is there a season 2 in the works? I hope so!", "lifestylemazeplannerstore": "Binge watching this series..Love it!!!!!!!😍😍", "juliechunk": "@lisatluu @bik__0 should we learn this tomorrow? 🤭", "maggieboudreaux": "Babies!!!!!", "luyzzza": "@lui_.zz", "kaneelbolletje": "@raaz85 deze vind ik leuk en de tweede swipe", "burritowrappedbaby": "My fav is Kamala in the series . She’s funny", "aenatomy": "@whoismeg make a Tik Tok on this, please! Pretty please!", "emmerifficweber": "@imaliltcup and @madcircuitmusic !!! Great song", "angela_la91": "@sarah_joy4 @k_milly13 @karlwinston.ph Here’s a new Tik Tok routine for you three to try!", "isweetsapna": "I think this is the only best thing happened in 2020!!💕😍", "isabellaamodeo_o": "@soulignycedar @marg_soul why do I lowkey wanna do this😭", "angiemama02": "@im._.justshort", "sarrytrotter": "@jshore5 @jessicaemilyclare can we learn this plz", "sin__duda": "@gracegarrigan", "bhavizzle": "Pleaseeeeeeee do it!!!", "pooja.desai.pasari": "Going to rewatch love love love the show", "notthatsneha": "The worst show on Netflix rn.", "xshattered._.dreamsx": "I NEED TO DO THIS. LIKE NOW", "ashnorrie": "@caitlinnorrie this one 👯‍♀️", "deeyummyeats": "@cartooncrazy03", "aiden_and_miles_paparazzi": "@erinwagnerwolf", "susiejuan": "Yassss @imaliltcup!!! You killed this song! It’s so different for you but goes to show how multi-talented you are as an artist and songwriter!", "snoelle": "@mindykaling Loved this show. I watched it in like a day lol. Please more 👏🏼👏🏼👏🏼", "vicweberrr": "@sss_samy", "namratha__rao": "@nikhita_methwani This should be your quarantine dance goal", "kittenwings": "@skhanister @riz21q we need to do this dance 💃🏻💃🏻💃🏻", "episfinallyinstaawesome": "@ryrymoney sooooo next time we are together we should probably learn this with Kels. @ashleyfinkney should join too but only if she watches @neverhaveiever first.", "nmathews25": "@arthikkaa", "serban.larisamihaela": "Just great, love it, can ' t wait for season 2...#netflix#deviruls", "arafran_2020": "🤣🤣🤣🤣 La mejor parte", "little_miskate": "Oh my god I’m obsessed!", "michellebingh10": "LOVED this show but hated how it ended! 😭😭 I wanna know more !!", "windblownblonde": "I’m already on my second time watching this series! I loved it so much! Can’t wait for more 🤞🏻", "justroops": "@maitreyiramakrishnan @leerodriguezz @ramonabishyoung I LOVED the show! Can't wait for S2! NOTE: U guys need to do more Trio tik toks❤️😁 And @mindykaling I've been your biggest fan since Ocean's 8! ❤️ Keep doing more Indian American shows ❤️", "laaavanyasharma": "@snehaabhardwaj", "punkie_crasto": "@natashachandel i love this ❤️", "laurthomp": "@epajer who can be our third for Halloween?", "jeanette.feasts": "@jpgjulie I binged the whole season lmao. Now I totally get this reference. Tell Lindsay I'm down to do it", "roumaynepillay": "@predhika", "justmegeorgi": "I love this show. Where's season 2?! I watched in one day. Hahahaha please release seasons in 3 so next one will be 2-4 yes? 😁😁😁😁😁", "waitforitschultz": "Mindy. Thank you. This show was hilarious but little did I know the last episode would have me sobbing❤️ you’ve created something so pure and beautiful. 💕", "karlacl19": "My daughters and I just finished the entire season. We loved it @mindykaling 💜💜", "xtndc": "Me and my daughter are so in love with this new series. Same reaction when I fell with The Mindy Project. Cant wait to see the next season, pleas", "homemadehudson": "Just binged the whole thing! Brava!!! It’s awesome, and there are so many open plot possibilities, can’t wait for next season!!!!", "just_mae11": "@baileybatman_ @literally_laynie @alyssabudde I’m literally obsessed with this can we plz try it after quarantine we would do it so good", "loeases": "@aadya_b what’s happening omg haven’t seen this yet", "miekedee": "This show is so good!! 🙌🏽🙌🏽🙌🏽", "simrann911": "@prashantpapnei good lord!!", "offi_mokoka": "@_trevordelello_ next dance we r learning is this", "t.anya03": "❤️❤️❤️❤️❤️", "boodaboi": "@ruchika.khanna88 here it is", "manali717": "I now think this is the right pace for the song 🙈🙈", "deekshamehta13": "Need season 2 please", "lx_mx_a": "Awesome show!!!!!! It was really fun👌🏻", "kleineszuhause": "Great!! 😍👍🏻", "kinibamrah": "I am in love with this show!!! Need season two! ❤️", "melissacocco_": "@kostasgounakis leuke netflix serie, moet je kijken 😘😘", "belkita1990": "Absolutely loved the first season! Can’t wait till the second one. The last episode had me in tears ...so emotional and touching. Life 💕", "dani3la.18": "Great Show Mindy !!!!! ❤️❤️❤️❤️😭😭😭", "private_go_away": "I never watched TV (growing up, didn't have one) and now as an adult I didn't get one until COVID19. After trying so many shows I almost gave up and unsubscribed. I felt like I was downloading negativity, sexism, and racism into my mind and I hated that. I never could have escaped poverty as a child and become a millionaire (hopefully a deca millionaire at some point in my future) if I listened to those messages. I was angry. But my sister told me to watch this. And it was so good. for so many reasons. just high quality tv. and on top of all of that, I got a good message about dark skinned women. THIS MADE ME HAPPIER THAN YOU CAN IMAGINE. I don't know if you will read this, Mindy but I pray that you will know what a difference you have made to me. 🙏🏾", "its_millyszn": "I fuck with this heavy me and my boyfriend lol", "nerns3": "My heart can’t take this show! It’s so amazing! I love every single thing about it!!! ❤️🇨🇦", "hazelpeak": "@maitreyiram @elatyagi @nandi85 @rachkaushik", "lisashieldspilates": "Thank goodness for this show!!!! It was so nice to have something excellent to watch while sheltered at home.", "cae_tano_": "I love them 😭", "tahreem.arshad": "@_maham_19", "appoctz": "Iconic", "shook_12": "@tahreem.arshad she is from mississauga", "nannygirl": "Where was this when I was growing up?? It's soo great to see this sort of representation and, the writing and soundtrack are amazing- Bring on season 2🔥🔥🔥🔥", "tasha_277": "@elzaluksa @cally_beckley we up to it? 😂", "itsambica": "So so good! Watch it all in one night! Can’t wait for season 2! 🙌🏽", "tjwill": "Finished season one and need more now! 🙌", "sunswimsnack": "This dance is my favorite scene I’m always repeating it!!!! Please season 2 soon!!!!!!!", "canasiscanyas": "@gabbii.89", "christie_s20": "I made a huge mistake watching this show. By huge mistake I mean that I binged it in just a short period, and now have to survive the rest of the quarantine without a second season! I LOVED it so much, thanks for something so pleasant during this unpleasant time!", "marosparo": "@lnart.studio", "kareshmaa_mk": "@anurajeffery my fave tiktok", "doctormomof3": "Season 2 please!! ❤️❤️", "pringles_and_i": "💖💖", "diva_vaish": "@clazbs", "monaa7medd": "@aivaai_m", "this_dinosaur_rawr": "😂😂😂Looooved the show! The cast is so talented🙌🏽🙌🏽", "shenglenten": "Done with S1 in 1 day. Waiting for s2 already haha", "madison.g.talsma": "binged all episodes yesterday!!", "tha.babi": "SEASON 2😭😭😭", "mysugarthumb": "OBSESSED with this show.", "tanjin__shila": "@theaudi15 wanna do this challenge??", "moniquestreff": "OMG, this show is everything! Just cried it out during the finale. Love!", "alexjordanofficial": "Great series💥💥💥", "walknwino": "Totally binge watched this yesterday. Now I'm sad there's only 1 season 😭❤️", "mollyeadie": "It is soooooooo good", "chrissy_forsythe": "Love, love, love this show!!!! Needed this now!! 🙌🏽🙌🏽🎉🎉", "ans199917": "Don't see any comments from @johnmcenroeofficial", "jasperinthangavelu": "@jihiljustin , your Doppelganger 😝", "emmitch208": "@bec.mitch 😂", "creativehussy": "I just binged the whole first season. It was amazing. Made my heart happy and emotional. ❤️❤️❤️", "nimbus1612": "This show is so great! I’m currently bingeing.", "hinakhan1991": "@sarudk", "cozyandsoft": "Song?", "dont_mind_me1.2.3heythatrhymed": "you have to understand that after i watched this episode, the song...it...it was stuck in my head ligitimately the whole day. I didn’t know a song could have so much power over my brain i-", "klevezinho": "Just watched the whole thing and it went by so fast, fuckkkkkk i need a second season NOW! I'm #TeamBen all the way!", "duda.sjf": "2 temporada por favor!!!!!", "nicoleppower": "Obsessed", "sfwb_coffee_food_cooking": "I knew I liked this show for a reason! I thought it had Mindy undertones & today I find out this was all you! @mindykaling you crack me up ❤️.. annnnnd I can’t stop rewatching Mindy Project", "vanessadavis57": "@mindykaling I don’t watch much TV busy discovering Never Have I Ever has had me laughing and crying. 🙏🙏thank you for some heartfelt content- love it so much ❤️❤️❤️", "alexcamach0": "@mina_rob !!!", "breneecharles": "I love this series❤️", "1lorna": "😂😂😂👍", "ale_reid90": "Well done! An amazing show! Loved it.", "potheadsbyamber": "So they’re dancing in front of Siam Meyers house from desperate housewives lol", "therodrigoreal": "this scene is so crazy omg", "sarag311": "@nellienorden shall we do this tik too challenge", "hedaxhayley": "LOVE THE SHOW! just wish she didn't hate on her culture sm what kinda message is it sending to Indian teens?", "stella_bella_4": "Absolutely loved the show ❤️Can’t wait for season 2!!!", "omanination": "I loved this show so much! 🤩❤️", "ek07goblue": "I’m in love with this show. I just finished season one. Wish there was more to watch!", "artsy__diva": "Such a cute show, loved it!!❤️❤️", "eliashbobadilla": "@mire_muro next tik tok for you", "subhajaponso": "Season 2 please!!!!!!", "stlxdlz": "@dj.savahna.brown I love them", "mstfoods2": "Already binged the whole season and want more!! Super cute, thanks for helping me through this quarantine ❤️❤️", "mstalk12": "Mindy thank you so much for @neverhaveiever (and all your shows) and especially for adding the piece about somatic symptom disorder. So important for us adolescent docs to see this portrayed on TV and for our patients to see it. @teenhealthdoc @mir.i.am725", "suz.templeton": "♥️♥️Thank Thank God for your beautiful brain 😘😘😘♥️♥️ Although I’m a 36 year old grown ass woman.. I binge watched Never Have I Ever... Kinda the same feeling I had when I saw the wonder years.. ♥️♥️♥️♥️Thank you for getting back the butterflies.. The music is soooooo Rad♥️♥️♥️ Thank You Mindy", "supriya.benjamin": "@suchitra_benjamin so when are you doing this lol", "abbeydu": "Best show ever 😭💕", "_unknown396_": "I’m watching this literally rn", "amritapmath": "@amirah500 should we do this?", "nlovehood": "When she came back with that t-shirt under her dress I DIED!!!💀😭😭😭", "mackenziehgpetros": "Love This show!!!", "theboorito": "Lmao the white shirt 😂😂😂", "mike.allen84": "Such a good show!! ❤️❤️🙏🏾", "pencilpopsam": "I love this show. Can’t wait for Season 2!", "lavss93": "@aerphoenix ahhhhaa🔥", "nagilakristina": "Hahahahah 🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷", "mc_park14": "SEASON 2 PLEASE!!!!! THE FIRST EP WAS A TRAP!!! I’m SOOO ADDICTED TO THE SHOW 😭😭😭😍❤️❤️❤️❤️ LOVE FROM PHILIPPINES 🇵🇭🇵🇭🇵🇭🇵🇭", "dextercool": "This show is everything! We need a season two!! ❤️", "diy.nora": "The girls❤️", "juzemi": "I love this scene!!!!!! So funny! Congrats coming up with this light but deep series! More to come please!!!!! I love Devi and Paxton😅❤️❤️❤️ @maitreyiramakrishnan @darrenbarnet", "yashodhara.7": "When is season 2 coming @mindykaling", "deisylovesu": "We want more!!!! 😂😂🙌🏽🙌🏽", "shir_hn": "@mayazohar6039 @nettal1", "thewilliamhaddrell": "@maitreyiramakrishnan is so beautiful I'm dying 🥺🥺", "sun_____nyy": "I laughed so hard at this! When she returns with a shirt on 😂😂", "thelilacreview": "Tonight is going to be the THIRD time I'm watching all 10 episodes 🤣", "shygirljules": "Such a great show!! Loved it!!", "mydaywins": "How is this show ONLY 8 episodes?! I need more!!!! ♥️", "_blackashley_": "You did a perfect job on this show.", "christophurrr": "Hey! Look! @courtney._", "chelseabharris": "@maxjacobharris 😂", "bmndelgado": "Once again you have knocked it out of the park!! Great show and your actor choice phenomenal!! I can't wait for season 2. 🎵🎵 Its a beautiful day 🎵🎵🙈 im not crying your crying ❤️", "_ariellemonroe": "🔥 🙌🏽😫", "velindarubio": "@mindykaling I finished the season and it rocked. Huge perk is that it’s the Desperate Housewives’ set! The family house is Susan Delfino’s house!! @desperatehousewivesofficial", "aakriti._.aakriti": "Whens the next season coming out? 😆🔥👏", "niki.sarraf": "Omg finished it one day, such a great show", "jesspennington8": "@oliviakulbak @juliacacoilo", "rraspberry_": "@farxiye if you see ever see this it will be the only reason I get tik tok", "mariacriseldacd": "The best! 😂", "madhawie": "What an amazing serie it was ❤️", "nikitadarb": "@jordan_taylor", "brklynbridge": "🙌🏽🙌🏽🙌🏽 We LOVE this show - kudos @mindykaling @neverhaveiever ❤️❤️❤️", "aferraro126": "When are we getting more Devi?!?", "scifiprincess09": "Can Andy Samberg do the announcing on Never Have I Ever next season ? The other guys is hurting my head !", "ehstefanilla": "We need a season 2 😭", "whatisoldtoday": "Loving this series so much!!! 💕", "dpwmd": "As good as this show is. Anyone else kinda annoyed by the islamaphobic undertones in the episode when they were at that community gathering? Is a true representation of the Indian community which I really hope not. And given the current political and social situation of India it's seems like such poor taste. Unless Mindy supports Modi's anti-Muslim rhetoric? I mean they seem more accepting of the women who married a white dude but God forbid someone be with a Muslim 😒", "katbedrosian": "Binged this show today - so good", "kindfoodmom": "I love this show so much! You are so amazing Mindy!", "partylights77": "Please make another season", "fizauddin13": "Hope paxton sees this 😂😂", "owleeber": "Congratulations and thank you for this show!!! 😍😭🥰", "lidiemeli": "@mindykaling I don't know if I am PMSing or what but I just sobbed through the last two episodes. haha LOVED IT!", "amandaperryphoto": "This show is so spectacular and I hope you just keep writing/directing/producing content like this ❤️👏🏼❤️👏🏼❤️👏🏼❤️", "whenurrebbycumandgetit": "❤️", "adri_rosales_": "@alejandra_rosales_24 🤗", "chef_apna": "Just saw the series and its very relatable specially being an indian in 🇨🇦.", "paradise.vallee": "@ptw.li", "notjustnerdy": "Just finished binge-watching. Loved it!", "grumpybearmum": "Loved this .... binged watch the whole series in one go ... 😍😘😍❤️😍😘absolutely fabulous .... ❤️😘❤️", "saffiya_baksh": "@raptors 🙌🏽🙌🏽🙌🏽🙌🏽 🇨🇦🇨🇦🇨🇦", "ash_5257": "Mindy, this show is such a triumph. You should be so proud of it. I watched the entire series and just loved it!! ❤️❤️❤️❤️❤️ and the timing couldn’t be better. I know I’ll watch it again!", "miriamvegasan": "@paulaboleaa este momento tb me hizo gracia xd", "dionn_renee": "FYI this is my favorite show right now ⭐️⭐️⭐️⭐️⭐️ I love the diversity and it’s sooooooo refreshing to see the main characters are minorities!!! So cool!!! You’re awesome. Thank you for the great show.", "xo_trilljill": "Loved this 😍 lol and @neverhaveiever !!!", "dizzytriplethree": "Thank you! I needed this!!", "dnbwoven": "Is that Mona from Legends of Tomorrow?", "pam.ike": "😂😂😂😂 Loving it.", "supriya.ot": "@mindykaling this was such an incredible show! Reminded me SO MUCH of being an Indian teenage girl in the U.S! ❤️", "anishakaura": "@shashitadi 😂😂😂😂😂", "brunna_moscovis": "Amei 😍#teamben 💖", "monniica": "I already binged the whole season! Can’t wait for next one!", "gkimz2": "The main girl is Canadian! @sololyask @rblacklaws", "sbfernandes7": "Season 2?", "fredsk8s": "👌👌 Loved this show!! Great job", "kritikadeol": "Hey! Please make shows or movies based on south asian people belonging from LGBTQS+ communities. Our culture needs to be more open and acceptable towards this", "annegeorge_": "@graycegibbs let’s do it", "karaquinnwardtobin": "@mindykaling I can’t stop watching this show. There goes my Sunday, thank you. The show I never knew I needed!!!🌟", "mshen10": "@ali_shen you totally need to watch mindys new show! It’s so funny and heartfelt", "cmfarrington": "This was the best thing I have seen on TV in a long time and I have watched A LOT of TV. I loved everything about it. Well done! 🙌🏼", "laurenclaire72": "Season 2!!!🙏🔥", "sam.shepherdd": "Raptors sweater", "noramullen": "Yes!!!! @swang90", "paulineizzle": "I loved this part lol", "isabelapintolb": "@aninhapinto", "coocookamel": "@suzyh483", "luuhcoles.spam": "I love this show so much", "kristinkarla": "Binge watching - love it!!!", "fahmink": "This is one of my faves @vahinitharma", "eddytam_": "@with.clairity this", "catleacreates": "💙", "ahintofpeach": "You’ve done it again! Such a brilliant show. Can’t wait until next season.", "divinediva805": "Can not wait for season 2!!! Thank you @mindykaling @netflix we binged this is the quickness! 🙌🏼🤣", "kingyssa_": "Mindy when is season 2 coming out ... asking for a friend😭😭", "thecultleader": "Don’t even get tik tok. Great show!", "solpal": "This was goodd 😋🙂😃", "sincerelyteala": "@bhawanaa___ @prechha_t", "crisanthoula": "This show fills the gaping hole that was left in my soul after the mindy project was over . Thanks for creating another one!!!", "lilone_215": "@lillychi88", "parul2012": "Absolutely loved the show @neverhaveiever Binge watched the entire season. Can’t wait for season 2! @maitreyiramakrishnan is a boss. ❤️❤️❤️ @mindykaling you rock! 🙌🏻🙌🏻🙌🏻", "harithat4": "Hey mindy ! Just finished up #neverhaveiever . So true about not belonging and true to either of the culture. When I saw the show it felt like someone has read my mind when I was teenager. Kudos . ❤️", "harshita_suneja": "@neelg13 can we make one video doing this together?", "mochalatte2014": "First of all this show is amazing and secondly you are a Goddess 🔥🔥🔥❤️❤️❤️", "joanmayors": "@amazingracevales @ianraveloabalos @jezflowie ito gawin natin beshies🤣", "vivflores": "Binge-watched the series! Loooved it! Thank you, @mindykaling ♥️", "nicolle_emerich": "Best netflix serie!! So fun and cute! Love it", "ashleytawil": "I love this show!!!", "caarou.b": "I watched all the episodes today and i really loved it ❤️❤️ hope for season 2!!!", "shelleens": "@mgoswitz enjoy", "stephmandil": "@sophb214 I loved this", "grudge_bags": "@maliniladd 🤣", "anic626": "This is the best show mindy! My husband loves it too", "riaeamado": "Love these young women. Great actresses!", "tartevixen": "@mindykaling what are we to do after finishing all ten episodes 😢, literally the most needed show of this time 👌🏽", "yiminator": "❤️ These 3!!!", "shannonrenee_1984": "This show is too cute ❤️❤️❤️", "kittrin": "I LOVE THIS SHOW!! 👏🏾👏🏾👏🏾👏🏾👏🏾", "jblan75": "Ok who else wants Devi to meet kelly kapoor", "simplyquirkytoni": "I am loving this show!", "eliarch15": "@tessamariearcher", "orincywhyte": "This made me smile!!!!!", "stefi_148": "@emernic @sineaddilworth @jtrousers Will we do this one 😂", "girlinlifemag13": "omg, I literally just binged watched this and it was awesome ....can't wait until Season 2.....miss seeing you on tv every week.", "signorina_caterina": "I love this show so much! 😍", "tatianaduarte__": "OMG, I watched all episodes last night, it's so good!!! 😍😍😍", "imrsm_": "Soooo cute!!!", "ritzb2": "😂😂😂When her mom comes out with the bag👍👍 gotta love old school Indian moms", "dianahariprashad": "@mindykaling when will we be able to salivate over season 2?", "ikukhalid": "Binge-watched all episodes in one sitting❤️ Extremely sad to wait A YEAR for season 2💔", "catail42": "@ava_sweat", "stacyx3melanie": "I love this show so much ❤️🔥🔥🔥", "jacklynhan": "@cyi", "dency90": "@mindykaling thank you for being a genius ♥️♥️ being a south Asian immigrant to the US, i relate to this show so so much ! Is it sad to say I’m still struggling with my identity 😭", "shy_yam": "@sarindiary 😂😂😂😂😂", "miss_adau": "Binged the whole thing", "roanni_blues": "I need season 2 😭 pleaase 🙌 @mindykaling", "mareyrosey": "season 2 please! ❤️", "nounou1kaki6648": "@celiouch @itsmaureen", "radz_g": "@pdoms @cassassyx3 new dance for Priti’s wedding", "farahahmed03": "@josephine_orpen does the t-shirt remind you of anyone ;)", "akanksha___shree": "Quick confession - that scene where Devi's mom pull Devi and she come back wearing tee under red dress cz that dress was sleeveless is just like my mom!!!! 🤣", "tassniia": "@fabbzali @naeeemarahman omg looool let’s do this! Get @mrs.f.sultana to be the mum shouting at me", "tashlmuller": "@__anyapj 😍", "axtfiles": "Loved the show!!! Can’t wait for next season", "richardsfine_": "Thank you for this show. Was not expecting to sob at the end! Was so fun and charming", "shaninhab": "@mindykaling I just loved the series!!! I watched al episodes in one goal yesterday. So much fun, and I really like to learn about other cultures. Plus all actors and actresses were amazing!! Looking forward for season 2 😘 Kisses from Norway", "meowtaintime": "Binged through all of Season 1 today and I need more of this wholesome, inclusive, and genuine content in my life ❤️👏🔥", "colacchio_20": "Must have season 2!! Tomorrow please 😊 amazing show ❤️ I felt My So Called Life vibes and it gave me chills.", "kanchan.yyc": "The best is when her mom made her wear a shirt underneath during the TikTok omg I died - such a classic move - I’ve lived that moment 😘.", "rdtny1": "This is one of the very best shows I have seen in a long time!! I just binge watched the entire series in two days. So much heart and humor! 👏👏👏", "zaynab.bowland": "Well done on this show @mindykaling currently binge watching in Melbourne. Perfect Sunday in lockdown 👏👏👏", "mayyoulee": "@tiffany0ung @renzhe @christinelhuang did you see this. So cute", "iceyirene": "@bianca_carnevale loved this scene", "dezireen_austin": "🔥", "meerasri._": "I did one ❤️❤️ on my makeup acc @meera.s_creations", "fnnygrl831": "Binged it in 2 days. When does season 2 come out?", "nicolebev": "@danimbeveridge options", "tasfia_25": "@iriiineee", "jennifer.c.hess": "Love love love love this show!!! 🙌", "ccrisj": "@annalyzethis @jessicawaki", "jessq225": "Omg 😭😍😫😂 great show! Just finished watching it❤️", "adventuresofmrshursey": "THIS SHOW IS EVERYTHING!!! It is so fun to watch, so funny, so lighthearted. My husband likes it too!! You’ve done it again. It’s so well written and such a feel good show to watch in this crazy world we live in right now.", "tylernavasmom": "Omg just binge watched this with my daughter 👌🏼 Please say season two is being filmed, we can’t wait 💕💕💕congrats @mindykaling 🍾", "melody_elm": "So great!", "mcnazzy": "What an amazing show! I started and finished it today. Watched the whole show with my teen son. Of course he would smirk at me every time I cried... which was often. ❤️", "epedzthorn": "Just binged the show with my husband and we both loved it!!! Last episode had me bawling. In a good way. Thank you for keeping us happy inside on another quarantine Saturday!! 🙏🙏🙏", "theellecole": "This show was so good! Can’t wait for the next season!", "allievedom": "Never have I ever...laughed so hard as when she came back in with that shirt on under her dress. My husband and I just about fell off the couch", "toshytill": "@sophiechenail @jbaardseth yes", "jessicaaafxox": "Love this show! Need season 2😩", "janjp123": "This show is awesome!!! 🎉🤗", "laurahansen162": "More, please. Thank you for being human.", "dr.aditinerurkar": "This show is everything @mindykaling Your talent and wit and love of the romcom in every scene", "keitrini": "I love this show, please hurry with season 2. Loved the story line. These are great actors and actresses I was moved to tears many times. And LOVE the cultural highlights! It’s very authentic. Thank you Mindy!!!", "ksesil": "@erinesesil @mtac288 please make this your next", "curiousceleste": "This show is what I needed growing up!!! Love love love!", "villamellona": "Watched ALL of the episodes today and loved it.", "trentg6": "@mindykaling this show is EVERYTHING!! It just kept getting better.. on the last ep and don’t want to say goodbye to this gorgeous cast. 😭♥️ @neverhaveiever", "kris.truong": "Lee Rodriguez is literally stunning", "kbabynate": "Btw @leerodriguezz got that mad georgous @meagangood stare lol. Ite im done lol", "estefania_bar": "@patricia._delgado @gelipooh_ we should do this tik tok hahahaha", "s_a_lma": "@rajsodhiii @u.ni.que @lilianndnguyen @nezzboo we should do this 😂", "theonlylolarenae": "🙌 I loved this show so much I binged the entire thing till 9 am the next morning. No regrets!! Season 2 please so much fun!!", "mrs_ebie2019": "Watched the whole season in one night.... amazing!!!! @mindykaling 🙌🏻🔥", "jeevangill_realestate": "@myakaila @avag270 - we will do this", "atticusfinchbot": "Just binged this in an afternoon❤️", "lindaismagic": "@thebrittneyrae you need to watch this show. 🥰", "lennybsoti": "When does season 2 come out??", "anyonesworld": "I just binged this!!! I cried. I laughed. I judged.... 🤫 amazing. I want season 2, 3, 4, 5, I don’t care. I want to see these girls in college. MAKE IT WORK 😩🤣", "_______r_ep_by_r_ep": "lovr it", "ameera.williams": "I’m a British Asian living in America (as of 2018). It’s amazing to see your work and your representation of Indian people in the mainstream. I have to say though, why do your characters always fall for a Caucasian guy? In the Mindy project, the office and In this, it’s the same thing. Let’s see an Indian guy on screen. Or maybe you’re very intelligent and know that a non Indian guy is what is going to get the viewings and ratings.", "adarshkaur": "Gorg", "ayooalyssa": "You are a genius! This show is genius", "britbrat25": "BEST SHOW!!!!!", "_fearneptune_": "@somosi_patricia ezt", "yoohomiez": "@suman.trip @fried_steamed_boyled @iamleannechan not not down ?!", "keebs84": "@valerrayy my first tik tok. Meet me outside in a red dress in 10 mons.", "kirsty.m.r": "@charli_llewellyn", "riztoni": "I've only watched the first couple episodes and have already laughed so hard and cried! Thank you for sharing your gift with us Mindy! The writing and production of this is a brilliant. 🙌", "priyaljindal": "Devi’s mom pulling her to wear a white tshirt inside the dress is the most Indian thing I’ve ever seeen😩😂", "diywcaitlin": "This was a great show!", "vthoney": "Just binged the whole season loved it!", "jackiesanchez_2": "@mindykaling My hubby and I finally had the chance to watch this show... we binge watched all of it in one day. Absolutely love it, you did such a great job picking each role. We love every character. Devi is super hilarious, we were saying that every time she said said something funny we could totally picture you saying it. Definitely a young Mindy. Can’t wait for season 2!!", "myspicysweetlife": "😂😂 the white t-shirt under dress totally relatable 😂", "pmed_jsj": "oh man the accuracy!", "guilhermina.oficia.l": "😍😍😍 amooo", "hannaeatsvegan": "GOLD", "isharonn": "OMG this show 😍 you're so talented @maitreyiramakrishnan ❤️", "ashc9473": "@cccozad my mom has literally done that to me, hand motions and all.", "amysmor": "One of my favorite scenes! 😂I absolutely love this show! Thank you!!! This was what we all needed! ❤️The last episode of the season was perfect!", "mo_hall": "@peteroryhall", "marleneva90": "Mindy, I sincerely hope you read this comment, I just finished the season it made me cry so much! When is season 2? I hope it’s soon!!", "sheilaajjie": "Looooove this show!!! 😍😍 Also likes the representation of an Indian family. I’m Kenyan but I absolutely relate with the strict mum, following traditions, caring so much about grades and the no boys policy lol 😂", "akneat": "@bellalaportee", "nancetsai": "Best show ever!!!! Obsessed. I can’t believe we have to wait a year for next season 😭😭😭", "advanturousone": "@chantalwindley 😍", "akanksha._.jaiswal": "@anaaya._.213", "natyrn114": "Amazing show!! Laughed, cried, just amazing! Loved this cast!", "sonja.sdw": "@nocyn_x oha hier manchen die das dann in echt", "shae_jo": "I watched this show within a day! It’s so refreshing, as a Malaysian Indian I can totally relate to this show; nuances of growing up in a strict Indian household! Can’t wait for season 2! @maitreyiramakrishnan and her tv mom pulled off their characters so well👏🏾👏🏾", "conquistador.bastard": "Dammit. Got home from work @ 10:30 pm and my wife was half way through episode two of @neverhaveiever. We ended up starting over from episode one and couldn’t stop watching. It’s now 3:30 am and we have to get up in three hours. Stupid compelling television.", "vaani.kc": "@donisaur @vardagupta this but for my sangeet night dance?!😏🔥", "kyz_joe": "NUMBER ONE IN NEW ZEALAND", "natsranch": "@mindykaling this show is life!! I just binged it yesterday and OMG you are so fricking talented. Thank you for all your work. The diversity and the characters/writing is amazing. I told my husband it’s so weird seeing a lead role brown girl but the diversity in the show is done so well you don’t even focus on it. You focus on that they are all just people dealing with life. ❤️❤️❤️❤️ It!! Keep going girl! You’re amazing!", "lakshmakeover_": "Omg this scene cracked me up 🤣🤣🤣🤣 when devi 's mom came out in the middle of the recording and next scene she is with a tee 😂", "triinaaa_": "Okay so I've binged the whole season, when is season 2 pleaseee 💓💓😍✨👏🔥", "xoxo_zayray": "@lenashareef", "thelukapuka": "This scene killed me!!! 🤣🤣🤣♥️♥️♥️♥️", "anamariagonzalezarjona": "Watched last night! ❤️", "koko_collado": "@rachellecurry", "natashaefuller": "Just started this tonight. Can’t stop binging. So so so good. 🙌", "takingitshlo": "@shreyamoolyaa", "dani181": "@racheltaylorstokes I've learnt the dance", "zaarinah": "I love this show. I binged the whole thing in one day 😭", "jdesa27": "This show was amazing already finished it was too good!!!", "erin_new_village": "Just binged Season 1 and it was the funniest and most moving show. I laughed, cried, felt pits in my stomach. Well done, Mindy! 🙌🏻", "jessyylovee": "I need a season two ASAP, I finished season one in literally a day and my eyes are puffy from crying 😭", "kontosss": "@andrewkareklas you practicing the tik tok dances 😂😂", "taryniitup": "Can’t stress enough how amazing this series is.... loved it sooo much thanks #mindykaling for an awesome series that made me ball my eyes out 🙌 thanks you’re an inspiration to me, love all your shows. 🔥❤️ keep on keeping on girl 🌸🌺💕❤️", "oldiscolll": "I LOVEEEEE", "napsforsmiles": "Sensational series! Can't wait for the next several seasons this surely has to offer! Binge watched every episode in one sitting... that bad? 🤷🏻‍♀️", "mama__kris824": "On my second time binging. So good! Hope @netflix doesn't do you dirty and gives us a second season", "noahspicyyy": "thank u for this show !! i loved so much . we need a season 2", "gigglesrobinson": "@vivianlangrobinson learn orrrr...", "jamimicah": "Ahhhhh, I LOVE you new show!!!!:)", "pragati_biltoria": "@abbaharmoniumbajaona", "zohra.qa": "This show is soo good", "bagogyul": "@mindykaling I was soo weakkk oui when she mum made her put on the t-shirt. All west-indian children felt this deeep in their souls 😂🤣😂", "yasmimks_": "eu preciso de outra temporadaaaaaaaaaa @mindykaling please,I need more!", "xobrittany_87": "@amcclellan91", "leilion_": "I died laughing when Devi came back with the undershirt 😂", "dandywelosky": "Just binge this and it was amazing! Cant wait for season 2🙌🙌🤩"}