{"sarahbakerdoula": "I just binged it! Absolutely loved it and now my hubby is watching it again with me. Thmm", "muzammil.gooljar": "It was top 1 over top 10 in Mauritius since the day it debuted 🇲🇺", "shan829": "Finished watching it tonight and your depiction of Asian family dysfunction is spot on! #onlywhitepeoplegototherapy #dishwashersarefordryingonly 🤣", "5unshine_and_rain": "Just finished binge watching the entire show!! Please make season 2 and 3 asap 👌🔥❤️", "jae_so_fierce": "Thank you for making this show SO DIVERSE! 👏🏽👏🏽👏🏽", "ashatwalxo": "BEST show i have seen while in quarantine and there’s been A LOT of netflixing 🙌🏽🙌🏽🔥", "jessica.l.pearson": "I just binged the whole season today. It is FANTASTIC! Thank you so much for gifting the world with this treasure ❤️❤️❤️", "ncaus": "I cried my eyes out!! Wasn’t expecting it from the trailer! Loved it!", "raellepalm": "I’m waiting on season 2 !!!!!", "audreylaps": "I loved this show so much!!!! 💖 Can’t wait for another season ! 🤗", "nnadineshops": "Omg I love love this. My other half is loving it to. I’m not a teenager I’m old 😢! But have good hair 😘", "sofisolis1": "Season 2 PLEASE 🙌", "marytay22": "I absolutely loved the show!", "lunakabeer": "My sister @skabir4 and I loved it and really enjoyed it! You always make the best shows! ❤️", "dombomb936": "I binge watched it in a day, is there going to be a season 2 at some point 😊 xxx", "_jess_scott_": "I can’t wait for the next season!!!", "delightful_x_x": "Watched it all in one sitting .... last 2 episodes got me 😭. Can’t wait for more episodes! 💪🏼😊", "papanahi": "I loved this show.", "syanniattan": "@amphonee_c", "ashleysiloac": "I woke up with my legs paralyzed from the knee down and they came back three months later as well, no reason why!! THANK YOU. ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "dcmailach": "This show is fire Mindy! So so happy for you and your team! 🙌🙌🙌♥️♥️🔥🔥", "ms_nomia": "It was amazing I binged it in one sitting.. Love you and your work..Currently reading your book your amazing @mindykaling", "megbeauch": "I just watched this series in a day. It’s amazing. Incredible; this is totally well deserved!", "yasmin1401": "Loved it!!", "babyojen": "I loved it and can't wait for new episodes! ❤️", "maribeirom": "We need season 2 ASAP", "indera_esq": "What a show! I didn’t know how much representation matters until I watched this show and saw a young girl who reminded me so much of myself. I cried and laughed and did not want it to end. Thank you for making this", "daisyrod_": "I love this show!! I’m so bummed out I already finished it because I want more! haha 🙌🏽🙌🏽🙌🏽", "ginamarieschumacher": "Loved it. Watched it in 2 nights.", "lizettefeld": "My husband and I watched the first two episodes tonight and loved it. We’ve loved you since your Kelly Kapoor days and just like The Mindy Project, Never Have I Ever is awesome!", "rachaelseppelfrick": "THIS SHOW IS AMAZING 😍 GREAT MESSAGES, FUNNY, SMART, WELL DIRECTED, WONDERFUL ACTING...I laugh and cried. Thank you Mindy and everyone for this beautiful piece of art ❤️♥️💗💙.", "thisisneri": "It’s the best!!! Loved it so much!!!", "p.hdsn": "❤️❤️❤️❤️❤️", "sndhiram": "🇳🇿 - we all can relate; no matter where in the world we are 💕 @mindykaling thank you and the entire production for making it happen; our inner voice/dilemmas of the mind growing up in blended society, finally it’s being voiced and understood. @maitreyiramakrishnan you are so real and soulful continue to stay blessed. 🧡", "kimmaysparks": "You did it again, @mindykaling! Love this show! Just finished the last episode and cried like a baby! 😭 Can't wait for season 2! 💖", "justinymarseille": "This show makes people feel what we want to feel, that no matter how complicated life is if we stick together, we can make it. I looooved it!", "robinmeyerhoff": "Looooove this show!!", "bhavni.keer": "👏👏", "laurenwhitemyer": "So good! ❤️❤️", "jennystricklandd": "@mindykaling literally crying STILL. Gosh I love you and this story and daaaaang we need more of this on our screens!🔥💕", "dhivsnat": "Thank you so much for this snow ! It was such an enjoyable watch that I binge watched it in two days - and that was only cos I had to go to work in between.", "vanessawellesley": "@mariewellesley", "hannalber": "Mindy, I've been your fan for like 10 years and I hate the fact I need to wait for season 2. I hate season's finale mourning 😡😡", "kelseykot": "I WANT MORE DEVI 😍", "nattybo20": "What an amazing show. Lost my husband 18 months ago and the ending gutted me. So so beautiful! Thank you for this story. Representation matters. 😍", "hannahjohnnsonn": "@mitchellhayes9", "shannon.edwards": "I just finished this show, and I can't tell you enough how much I love it! Exceptional casting, writing, and heart. I have all the feels for this show, and I'm making everyone in my life watch it.", "sar.k.taylor": "Its amazing! Watched it in one day!!❤️❤️❤️", "savitaativas": "Love this show!!! 🙌🏾🙌🏾 Wish it were there back when I was in high school, I feel so seen!! When is the next season coming out!!!! 😍", "jordanturpin5": "So good loved it 👏🏼👏🏼", "merobelo": "I love it congrats!!! It so refreshing", "lisaedoff": "Just finished watching it, loved it so much. Well done everyone involved 💕", "kak_01": "Such a good show. Thanks for giving us South Asians representation. It's really nice to see our faces in an extremely popular show ❤️❤️", "conbonconnie": "I watched the entire season in a day and cried so many times. Thank you for creating it ❤️", "fate_rum_a": "Just binged the show....😭😍💐🔥😭💐", "gofishpoke": "looooove the series!!!!!", "ye_liz1989": "I love it❤️ I want to see more😍", "ms.amores": "I haven’t binged a single other show in the past six months. I saw this in two days. Well, actually I watched tiger kind over three weeks, I don’t know if that counts. I LOVED Never Have I Ever! Thank you all for making it!", "karensarus": "THANK YOU! WE NEEDED THIS!!", "hy.le123456": "I love anything by Mindy Kaling, and I loved this show, but I actually didn’t know it was by Mindy! @jessannvick", "lil.saddyy": "Second season 🙏🏼", "beattrix_kiddo_9": "Et al*", "eatdrinktravelread": "Binged it last weekend. Except for fake Indian accents of the cousin, I found it really entertaining & important. Thx for making this", "wellygib": "I’ve just started watching this show and am absolutely loving it! 💜", "jeremey_here": "❤️❤️❤️🔥🔥", "kody.davidson": "You deserve it hun", "dmbozz": "I love this show. The cast is perfect! 👏👏👏 Can’t wait for season 2", "ms.moody2789": "No joke I watched it back to back 3 times. 3 TIMES MINDY!!!! 💕 Your work", "janietess": "More seasons please !!!!!!", "queenbreema": "@mindykaling just started watching this show. I am a mom of teenage boys trying so hard to tech them some Indian culture and values and the mom in your show is totally like me. You have made a very relatable show !!", "laura_lee890": "It's so good!! Binged it all in a day... So when do we get another amazing season?!? ☺️☺️", "estef813": "I finally watched this show 😍😭 best decision ever! It made me cry and laugh. Such good writing! 😭 💯", "mer5252": "Love love love the show!!! Can not wait for season 2! 👏❤️👏", "amanda13nicole": "Lovedddd!!! ❤️", "julescarvajal": "@mindykaling it’s such a good show!!!!!", "manda3279": "It’s soooooo good", "debchibaby": "Love the showwwwww😍", "gadgetgirl0328": "Binge watched all 10 episodes .. stayed up till 0900! Lol what a great show that I personally resonate with having lost my father that same way at a young age .. thank you @mindykaling ..great show!!", "redbuddy22": "Can’t wait for season 2!", "shortandsassi4": "EVERYTHING you do is gold! I just binged the entire season today!!!", "jascstark": "mindy kaling, i would just like to thank you for making this show. you are literally a genius & i just finished the whole season which i started, today! this was the show i didn't know i needed.", "twdrea": "I love it!!!!", "alyssa._sparks": "renew for a second season pleasee🥺", "swaziii": "Congratulations @mindykaling Lovely show...❤️ sweet... Genuine... Simple & also complicated like real life😂", "paulabremez": "This show is AMAZING! I can't wait for the next season to come out. I love the story, the characters ...I loved it!❤️❤️❤️❤️❤️❤️", "sooness": "@mindykaling I just finished the show! I will be very upset if there isn’t a season 2-1K!!!", "nanmassie": "This show is sooooo good! I can’t wait for season 2", "just__twiggy": "🎉🎉🎉🎉", "kenya_qlma": "Honestly a great show. I really enjoyed all the feelings it made me feel, even if it left me with snot", "candbkinberg": "I love it!!! ❤️", "sammydwilliams": "@nadiasimmons09 @jordannadia don’t forget to watch this show I tagged you in yesterday! It’s brilliant & funny 🙌🏽🙌🏽", "emmaloumay88": "@katrinalmarch", "slnelson88": "I just got done watching the last episode. Please tell me you are working on the Season 2!!! 😍 It’s so cute and funny. I even caught my husband secretly watching it from the kitchen bc I could hear him laughing!", "amandajessica00": "It’s SO GOOD", "dinafreitaz": "👏👏👏👏👏👏👏👏", "sallyannemcbride": "I just finished watching it! Such a fun break from homeschooling a kindergartener and potty training a toddler while my Marine husband goes into work every day. Can’t wait for season two! ❤️", "creationofaknd": "I’m ready for a second season 🙌🏾🙌🏾🙌🏾 I watched everything in one day", "taytaygonzales1": "Seriously this was so so so goood! ❤❤🔥", "shakti.marshall": "🙌 well done and congratulations @mindykaling ...I love this show ❤️", "umatantri": "This show touched my heart more than any other. Thank you for creating it @mindykaling 🥰", "raakhee.rao": "Just finished the season... cant wait for season 2🙌🙌.", "pickyj528": "Your show is amazing, I’m so happy for you and it was the best show I’ve seen in a long time! Congratulations!!", "pratyusha_koratala": "I hope there's a second 2, good work on this show :\")", "lizb1018": "The show is fantastic! Binged it in two days. Fantastic cast!", "heartyprinsesa": "You're a genius!!!!! Give us seasom 2 please😩😍😂💙💖", "dizzleberry19": "Just binge watched the entire season and loved it!", "joyengler": "We want more of this show!!!!", "jenneyok1": "You should promote more! Never heard of it til this post. Binge watched the whole season. I love all the characters! Especially Ben!", "theodora.rose": "Just started watching it, sooo good 🙌 💗", "gerard__ward": "It’s an awesome show, good work @mindykaling", "morgancantley": "Amazing!! You outdid yourself with this one! 🎉", "oliviasblake": "@mindykaling just binge watched. Loved it. It's great. And at the end 😭😭😭😭😭😭😭😭😭😭", "maverick_monster_": "I finished the season in one sitting, couldn’t stop Now I need Season 2 ASAP @mindykaling", "craftknitsew": "I just took it down in a few nights, @mindykaling, it was gorgeous. I loved it. Thanks!!!", "wanderingsoftab": "I binged and watched it all on one day and LOVED it !!! Who scored the series the music was also fantastic", "kinda.mar": "Next season???????", "tracyhardy5": "I binged the whole season in one sitting! Best thing I have watched this whole quarantine!", "__phlauraaa.d": "Can’t wait for the new season ❤️", "vpriyaa.s": "❤️❤️", "lore_3189": "Loved this show so much!!💖💖", "ashlyndixon": "I absolutely loved this show and cannot wait for the next season!", "m.sosa": "How r u surprised?! It’s clearly awesome!!! *the show bitch*", "margarthemighty": "I just watched the whole show today and it’s incredible and amazing.", "moreofwill": "Just finished watching all 10 episodes!! A fun and emotional binge watching experience!! Thank you @neverhaveiever Looking so forward to the next season!!", "palomag86": "I just binged watch the entire show today! Cried and laughed and cried some more! It’s an amazing show! Thank you! 🙌", "freddie.b.dog": "Mum and I binged watched this together, best show ever!!! Just finished crying from the last episode 😭 We ❤️ you @mindykaling", "sheena_patel5": "It’s seriously the best! So inspiring and relatable!", "lately_msdaisy": "Such a great show, thank you!", "tarbearrrrrrrrrrrrr": "The show is amazing. I’ve binge watched all of it. The writing is hilarious and the cast is perfect. Couldn’t love it more 😭😭😭❤️", "jillb2421": "Just finished this. I need a season 2 like now!!! 🙌🙌🙌❤️❤️❤️", "simmi8801": "Bestest show ever absolutely loved it! Your so talented!!!🙌", "_anandig": "Basically everyone drop everything and watch Never Have I Ever and Extraction.", "chandragm19": "We are loving it! My girls born in America see themselves in Devi and suddenly I don’t have to explain or excuse my Indian momness to them :)", "myemstagram": "Season two pleaseeeee", "jonoah8": "There must be a season 2 soon. Completely one of the best shows this year.", "ameeta_kohli.mtl": "Just finished the season and full out bawling. Thank you so much!! Never have I ever seen myself on screen (minus the cool wardroom and amazing confidence and possibility of a boyfriend back then). Loved it ❤️", "sabitalawson": "Fantastic show 🙏🏿💜🙏🏿", "priya_jayadas_actress": "👏👏👏👏👏👏", "mericco": "The most diverse show ever! Love it and loooved the cast. Thank you Mindy!❤️", "bendis236": "I am loving @neverhaveiever and I love seeing @angelakinsey", "petitesouche": "The show salvaged my week!! Well done. I want more!!", "katgold27": "My 12 year old daughter and I finished it last night. So many tears! We loved it and did not want it to end. It was just perfection! Thank you thank you thank you!!!!", "dr.woooosaaah": "Thanks Mindy for being proud of your culture and using your power to create a show that accurately(finally!) portrays what its like to live in a brown family! #proudtobeindian", "tarynupyourhearttt": "I laughed, I cried, I loved every second!", "sierra00101": "Best show I’ve seen in a long time", "lailaforghani": "Love this show!!! Hope there's a second season 😍", "michelle.limburg": "Just finished binging the whole thing. I cried during the finale. Loved this show❤️", "boymom4of4": "Just finished watching...I can't wait for more! Such a heartwarming show. I laughed, I cried... I loved every moment of it!!", "sharizlovesomi": "@mindykaling WE NEED A SEASON 2 😍😍😍", "abaliga005": "Your show deserved it...i loved it...", "anggib4000": "It’s so good!!!", "xmomciax": "Great show 👏👏👏 cant wait for season 2!!!!", "thatkidolas": "We need a season 2", "suite.caroline": "it's SO GOOD !!!!!! more pleaseeee", "jess_cuhhh": "Such an amazing show!! Binged it in one day!", "monika_agarwal": "Binge watching 🔥", "amanda21616uk": "@mindykaling season 2 👏🏼 season 2👏🏼 season 2 👏🏼", "joannavargasnyc\nVerified": "Verified", "tannerhorton": "Just binged this in one day. 😂 such a hilarious, feel-good, inclusive show. Thanks, Mindy! ❤️", "hhhjayhawk": "Just finished it...loved it! Thank you! Much needed!❤️", "lilanholy": "Thank you so much for this amazing work!! ‼️‼️‼️‼️‼️‼️ I truly adored ❤️❤️❤️", "lovecololife": "I watched the whole series yesterday 🤦🏽‍♀️ So good! Witty and wonderful acting. Also, love the music choices. Can’t wait for a second season!", "pinpin_2302": "😍😍😍", "travelingirl_byee": "I watched every episode. Sneaking U2 in there?! Whattttt 😂 dude srsly. Beautiful show Mindy ❤️❤️❤️", "ikanleyley": "you're honestly amazing", "ooohglitter": "Loved it!! When can we get season 2???? @netflix #Wewantmore", "balbadar": "Loved it!!! So excited for season 2!!", "priposterous": "You’ve done for Indian girls what Donald Trump has done for America. Made us great again (j/k about the POTUS). Love it Mindy, keep on keeping it real, girl! Yassss!", "boskykhurana": "Congratulations!!!nothing but truth!!!", "nor1961": "@mindykaling, I just binged the series and am telling everyone I know to watch it. I laughed, I cried, and I loved it so much. THANK YOU!", "june_charles_corl": "looooove the show! hope there's a second season", "raeologyy_": "It was number 1 in South Africa 🇿🇦 ❤️❤️❤️❤️", "ans199917": "You guys won't have any difficulties staying on top of the charts until a similar show narrated by #bjornborg comes out 😂", "meoc55": "Seriously, sooooo good! Watched it straight through!", "kpay_rox": "I wished there was more episodes 😭 😭", "iluv_edits8": "are we getting a season 2?!!", "heather.newmyer": "I love this show!!!!!!💕💕", "jaya_singh007": "Loved this show!! 💗💗💗", "aughi007": "Huge huge fan of yours Mindy!!! Watch and read everything you put out!! I thought the Mindy project was amazing! This is on another level❤️", "claudeia__": "I’ve been repeatedly watching it. Until I’ll wale up with S2!", "bilibeauty": "Yayyy congratulations!!!!! We’ve watched the series TWICE now!! We are obsessed😍It is EVERYTHING that we’ve been talking about on our page and exactly the show we needed to see!! Thank you for creating such a beautifully made show about us South Asians💙", "anearle": "I love you for creating this beautiful, hilarious and touching show that 44 years later has me saying ‘holy shit I wish I had the balls to do that and say that when I was a 16 year old brown girl!!’ Thank you for this 😘 💕", "dharmarema": "The serie is so good ♥️", "riteeparikh": "@tennyman", "stiney_bo0": "Just binged the entire thing and now I'm crying like a baby", "meghannziegler": "Binge watched it and LOVED it!!! Come on season 2", "rohini9": "Love the show! When I first saw the trailer, I was like ‘ omg finally there’s a American Indian show depicting my life!’ 😆", "boombubblestore": "Just watched the whole season. My husband and I were both in tears. Laughed so much. 💕", "holli29xo": "We need more episodes! ❤️", "mkinrome": "MINDY (as if I know her?)!!!!!! This show is just. What. We.* Needed. *We meaning 34-year-olds looking to unwind in quarantine/brown girls who have intense but loving moms and didn’t feel cool in HS/your #1 fans.", "vicky.sabel": "Sending love from 🇦🇷🇦🇷", "mr_carson_the_cat": "I love this show. It's so relatable and I'm so proud of the Asian representation you have as LEADS!!!!! The music is 👌 as well. I wish I had a show like this to represent Asian immigrant families in America when I was growing up. Bravo!!! I can't wait for another season.", "missbrennastudio": "I just finished it and loved it so much!!", "ah.ya.tu.sabes": "It’s amazing!!!!!! 👏🏽👏🏽👏🏽👏🏽I love everything about this show!", "jess_dibble": "Soo good! Binged all in one day! Please say there will be more?!?❤️❤️❤️", "adrianabward": "But when does the next season come out😭❤️🔥", "xtina7526": "Loved it! Can we get a season 2? Lol", "chris_roe": "This show is so great. McEnroe is a brilliant choice. Congrats!!", "amyonraspberryhill": "❤️I just finished the season and I loved it so much. I cried my way through the whole last episode.❤️", "schielca": "It’s SUCH a good show and the fact that McEnroe narrates it is the best! @mindykaling", "leahcanfield": "Loved this show!! I laughed. I cried. I peed a little. It was great.", "asha_sidhu": "Thank you so much for making this ❤️", "chelle_teo": "Just finished the show last night - it's still top 2 here in NZ. What a wonderful show you've created. I'm 28 and neither Indian nor American but I'm a New Zealand-born Samoan/Tuvaluan and could 100% relate to so many of Devi's emotions growing up. I especially relate to feeling like you almost need to defend yourself as an individual with uniquely blended sensibilities among people who think you belong in one box or should behave in a particular way because of your identity on paper or your skin colour. This show has inspired me SO much to want to achieve this level representation for people like me. Thank you, to ALL of you, for making this! You should be so proud! 💜", "charlenefernandezhair": "Loved it so much!", "janaggr": "My 14 y.o. just emerged from a five hour binge and said, “It’s so good! It’s the Indian Jane (the Virgin)!” That’s the highest compliment we can give.", "bekah915": "Just started watching this. You’re brilliant. I love all your shows. 💕", "halima.ben2018": "Awesome show! Loved it!", "kikas318": "Loved every single second! It was amazing ! I need season 2!!", "macklin3008": "Omg, a cliffhanger! I wanna be 19 again! 😫🤣 The show is so good! Paxton! ❤️", "jakeryan012": "Thank u for this show", "sofiafcassidy": "This is my FAVORITE show on Netflix 💕", "kaseylj": "Your show was brilliant", "englishnouna": "Thank you thank you thank you ! The only show that actually made me forget lockdown anxiety!", "alexabenitezc": "I went over the whole season 1 THREE times in 24 hours. One of the best series in years", "anthony_villalba1": "In Paraguay🇵🇾 it was also #1", "nivariareina": "Hoo wooo!!! Love it🤗", "halpinkate": "I just binged the whole season today. I couldn’t tear myself away! Beautiful story, and I love that it’s being filmed in Susan Mayer’s old house from Desperate Housewives! When will season 2 come out!?!?", "ericadianavillanueva": "I love this show!! So cute and sweet. Have been binging it all day! 💗💗💗", "row_cooke": "I’ve just binged watch the entire first series, absolutely love it! Thankyou 🙏 Looking forward you season 2 🤞 from Melbourne, Australia 🇦🇺", "lildyj": "@mindykaling I need Season 2! STAT!!", "sarahmarink88": "You did it again! This show is amazing and the cast is fabulous! 💕", "tarab423": "Love!! Season 2??", "kerriekaur": "Representing!! So many of us can relate!!!! Thank you! 🔥💖 x", "wanderlust_miss": "Amazing serie 👏🏻👏🏻👏🏻", "katedealylong": "Just finished this last night and cried my eyes out! When will season 2 be here?!?! 💗💗😭😭", "mattjp_91": "how cool!!! 😍🇮🇳💕 great show. I hope a season two is happening!!", "cinderrrita": "It was very good. I binged watched twice, because I wanted more. One season isn't enough... It was funny, it was sad, and it was a beautiful insight to indian culture. Good job. Loved it. When will season 2 be uploaded?", "veshnee26": "Thank you for making this show! It was awesome and so relatable!❤", "thegirlwiththetattooo": "so happy for you", "maryaneek_priv": "@mindykaling what about Poland? 🇵🇱", "indranibaxter": "I just finished watching this and I absolutely love it. I laughed and cried and I love the soundtrack. “Absolutely fabulous dahling!”👏🏽❤️😍", "pchmel": "@mindykaling and @maitreyiramakrishnan @jarenlewison @neverhaveiever Season 2 in @netflixlat @darrenbarnet All fans of Brazil cheer for the renewal and continuation of the series I Never on Netflix 🇧🇷🎬❤️", "simplesimpleme": "I binged it and loved it more than I thought I would. I say this because I am not A Youth.", "t.anya03": "It was hysterical", "resurrect_pebbles": "Love your new show “Never have I ever” on Netflix ♥️ Hope second season coming soon ! 💕Loved you on the office too 🌺", "mango.sal": "Such a great show ❤️❤️❤️", "missviv1907": "I just finished watching it tonight and I want more!!!!! I love it!!! And the ending... wow🤯 I must watch it again☺️💞👏🏻👏🏻", "deedeeharls": "It’s such a great show! We loved it, laughed and bawled our eyes out at the end ❤️", "jdubs_ns": "😍 Amazing news!", "teenymintycrawf": "@kaseylj", "italobley.m.a": "I finished the series in 1 day, loved ittttt", "laurafoofoo": "Shout out to our #Mississauga girl @maitreyiramakrishnan 🔥 so good!", "ame_lump": "Deserved! We love it. We love you. Thanks for telling this story. Can't wait for season 2....and 3...!!", "velo.star.cafe": "This was one of the best shows I've ever seen. Had my whole family I tears and stitches.", "vanesssarusso": "@mindykaling I LOVE NEVER HAVE I EVER!!!!! seaon 2!", "oldtownelmo": "I loved NHIE! To see a teen crew of all young women of colour in the center If the story was incredible. It reflected my actual high school days back when the only people of colour in john Hughes films and the like were offensive stereotypes. Thanks for warming the heart of my inner adolescent. ❤️ Also where could I get the bomber jacket Paxton wears in the last episode? My partner is obsessed with it!", "nalhari15": "Omg just finished watching it it was amazing!!!💕💕", "palomaluz": "And if 2020 couldn’t get any crazier, I found myself crying because of John McEnroe", "selenajasminee": "This is so amazing! Here for all the representation!!🙏🏽💕", "goldie003": "👌 whens season 2 coming out!!?? I binged this in a day!!", "ms_singh60": "This show was so good!!❤️❤️", "nayan20786": "Yowie wowie!", "jacinta_rose_writer": "BEST SHOW EVER!! I love it and man, would I have loved it when I was a young girl with Anglo Indian heritage growing up!! Thank you 😘👏", "yoginikavi": "Love love love the show!", "a_pimpnamed_ninja": "Amazing watched the whole thing in one day", "hawthorne_kyle": "I’m only confused on why the last one has a different picture, other than that way to go!!!", "amy.jo17": "🙌 I mean, I accidentally watched through the entire thing not realising I'd have to pace myself 😢 so good! 👏👏", "bake.dat.dough": "Thank you for this gem, like truly.", "jtynny": "It is so so good 👌🏼", "_ca2ny": "I watched it in one sitting. Very funny and entertaining. When is season 2 coming out???", "bluelife06": "Hello, will there be a season 2 of Never Have I Ever? Great show! So powerful, funny and heartbreaking!!!", "michelledramirez": "This show was everything. Hilarious and poignant, I laughed and cried at so many different parts. You’re a queen!👏", "sabyloou": "Did I wake up at 10am this morning and start watching Never have I Ever and finish the entire show by 5:30pm today? Yes. BUT WHO HASNT? AMIRIGHT😭 Also, am I shallow or is it ok to be conflicted between Paxton and Ben ? SPEAK UP PEOPLEEE I FEEL ALONE OUT HERE!!!!", "nipa.15": "Congratulations! Could totally relate to this and it was as funny as it was moving! LOVED every episode and can't wait for more! Thank you for bringing the south Asian culture forefront and representing! Love all of your work!", "rani1478": "@mindykaling amazing amazing amazing show. Being Indian and watching that show I could relate to so many things not to mention my name has Devi in it. Lol. Great show. Saw the whole season in one night. Can’t wait for season 2.", "bevydoll": "Loved it! Watched it in one day!", "be.md_23": "Bravo!!!", "redmadhuri": "@mindykaling this is so beautiful, so true , so hilarious. I laughed I cried. Best thing you have done so far, imho", "valenie.ferreira": "Congratulations", "bonne_lone": "Finished the show today. Mindy, it’s perfection!! 😩🙌🏽❤️❤️", "gloria_nl12": "We need a other season ASAP!", "msnadiab": "I binged this in 5.5 hours. Season 2 is needed ASAP", "jennifer_losing_2_live": "Omg my husband and I finished season 1 in just a few days. PLEASE PLEASE PLEASE let there be a season 2 !!!!!", "insaniaty": "👏🏼👏🏼👏🏼", "karolinapoplawska3": "It was an amazing show! Thank you so much!", "renaeademson": "Please make season 2 happen right Meow!!!! Tell me you secretly taped all of season 2 already and will release it!!❤️❤️❤️❤️", "oliviachristian.co": "It's really, REALLY great ❤️ Congrats.", "nylasammimoos": "This show was so good. I watched the entire season in two days! 💗", "vani166": "Thank you for posting this, cause I didn’t know about the show. I started and finished it yesterday, quick binge with my husband. So good!!", "clearyourmindbro": "Love the show. The daughter was such a great find. Parents were miscast. Should have cast Sheetal Sheth or Tabu as the mom. And your dad from Mindy Project or maybe the actor who hosted the Indian dinner party on the Mindy Project Indian episode for the father. But the kids were all awesome.", "momminglikeapro": "Loved this show, forewarning your gonna need tissues and lots of ice cream 🔥", "thilzds": "Loved the show❤️ pls make more seasons & release them soon. Cant wait 😊", "kcp713": "My husband and I watched the entire 1st season today. ❤️🤣😭 Need more now, please.", "cococakeland": "Loved it so much 💕❤️💕started watching it for a second time almost immediately 🥰❤️", "emma.lockard411": "I just finished this morning- obviously I cried a bunch. It's a beautiful, heartwarming story, well done everyone involved! 💖", "doctor_sumi": "💜💜💜", "angelicaxcx": "amazing!! 🤩🤩🤩", "hcozens243": "It was so good,honest and cute", "tiffy_marie09": "My fourth time rewatching it I love this show can’t wait for season 2 ❤️", "valene_t": "When's season 2 coming out?", "nicassiaa": "Seasonnn 2😍😍😍😍", "saltedchai": "@mindykaling best ducking series ever bruh. ❤️❤️❤️😂😂😂❤️❤️❤️❤️😂😂😂😂", "confidently_k": "It was amazing! Just like all of your work! Keep shining ✨", "caligirlhart09": "I loved it!!!", "snail_mail7521": "Lucky", "evie30": "Mindyyyyyyy I CANNOT wait for season 2!!! Any idea on when we can expect it?", "_.jodyy._": "Season 2 me please😫😫", "obiwanab": "Love the show! Looking forward to season 2 🙌🏼", "aprildoeswhat": "Watched it twice already this quarantine", "ayeshamisra": "Amazing, congrats!!", "kaajal78": "Loving the show. Being a Gujarati myself I can so relate to a lot of things! Best dialogue.. You are grounded until your graduation!... no wait you are grounded until your kids graduate!! 😂😂🤣🤣", "nylajoym": "@est.1983jtm I thought this show was funny, if you haven’t watched it yet. :)", "michelle002002": "@mindykaling @maitreyiramakrishnan @neverhaveiever please do a second season I binged watched the whole season in one day I need more ❤️❤️❤️👏👏👏😊😊😊😊", "alyssa_esq88": "Can’t wait for season 2!", "3lle.eh": "Ahh! Just binge watched this and I LOVED IT! 💕", "carmstolz2015": "So so so so gooooood!!!!!! Yeah, thx for creating this show!", "chnkybrgs": "It is so good! hopefully season 2 will come out sooner as possible. 💖", "radhikakhatriforreal": "@mindykaling your writing is perfect, made me cry and laugh .... It's too good and stop being humble ur a rockstar!!!!❤️❤️❤️❤️😍", "jessatack21": "I binge watched it last night. 👏👏 one of my new favorite shows. 🔥🔥", "khiladiny": "Totally deserve it ❣️", "jessiehansen6": "This show was so great! I watched it all in two days! I can't wait for season 2!💕", "marianne9909": "I LOVE this show. So fun. Hope there’s a second season!", "gabbsgirll": "Loved it !!! Thank you @mindykaling can’t wait for season 2! 🤍", "ritu_bee": "Loved your show! My daughter really loved the line ” left the funeral to comfort you when Nick Jonas married an Indian woman that wasn’t you”@mindykaling You hit us with the best lines!", "onetreataday": "You deserve it 😍", "anelpastel": "I love it! I love you! I love everyone!! ❤️gonna watch it again!!! 😍", "michy_c_": "LOVED this show! ❤️💕❤️💕 Representing our South Indian Girls 🙌", "kanisteacher": "Started watching this last night! Love it! Great casting.", "clarice.muellerjohnson": "Love it!!", "editsdecelebridades": "Team Ben❤️😍🇧🇷", "douglassrhunter": "@mindykaling love the show! You are a comic genius!", "dee.lof": "I absolutely love the show and find it so relatable and funny!!! Thank you!", "leftyrussel123": "We love this show. I have a bi polar teen daughter. so a lot of this hits home. Of course my situation is magnified by about 5x. But to enjoy a good laugh sure helps.", "warner_mickey7": "Its my fav 🔥🔥", "lheur.some": "The season finale though!! 😭💕🙈 We need the second season!!!", "sophiemodesta": "Binging it today 😝", "avalonjude": "Season Two please!!!!!!!", "two.lions.mama": "Loved This Show Sooooo Much!!! 💖💖💖", "joiadavillon": "I hope there would be 12 or even more seasons for this show! ❤️❤️❤️💋💋💋", "seanzyt": "@mindykaling thank you for creating this show and it’s racial and lgbt positivity!! ❤️", "cagraham33": "Just finished the show. It was AMAZING and wonderful. Great job, Mindy! ❤️", "katypayne4": "Binged it all last night and woke up this morning feeling sad that there aren’t more episodes to watch. You are amazing!!!", "natalinacat": "Power watched it this weekend. We loved the show.", "ashliushka": "I love this show sooooo much! When is the next season coming out? When are the next 5 seasons coming out? I can’t get enough.", "kate_alyse_": "I binged it all yesterday and as soon as it was over I started it from the beginning again!!! I’m obsessed with this show 😭💕💕", "hita_patel00": "@mindykaling your show is AMAZING!!!! We want SEASON 2.", "vcruzdesilva": "@mindykaling Thank you, thank you, thank for posting this. I’ve been in a baby bubble and didn’t realize you had a new show! Binge watched most of the season in a couple of nights. Only two episodes left, but am procrastinating as I need more to look fwd to 😩 Cast couldn’t be more adorable and as always love your humor. Grateful for all the laughter you’ve brought my lockdown life ❤️", "aashiqshajahan": "🔥🔥", "this.is_psj": "It's a great one 👌🔥😘", "drizzydirtydre": "This show is is good.", "lady_rogue25": "So proud❤️!! Congratulations!!", "get2nelly": "Love it...", "nandyf_": "🇧🇷🇧🇷🇧🇷 we love it ❤️❤️", "beth_b0315": "It was so good!", "kroltex": "Congrats girl, it's a perfect show", "okapigirl16": "THIS SHOW IS AMAZING I WISH THERE WAS MORE I LOVE IT", "ladyaitua": "Thank you for this show 💕", "doitdede": "This show is the only reason we all stay calm durin quarantine 🤣", "gabisarhos": "I just watched all and it’s soooo good. ❤️", "shelbyjwhite": "@mindykaling it’s sooo goood!! We had to cut ourselves off from watching the whole season in one evening lol 💗💗", "shortylovesgoofy": "I binged watch this show in a day. It is really good! Love it 😍", "graceobradley": "As someone who lost my dad around Devi’s same age there are so many parallels. The show is absolutely phenomenal.", "burkewilliams": "@mindykaling Just finished Never Have I Ever. What a beautiful show! I laughed, I cried, I reflected and related to the complications of a teenage daughter/mother relationships. Well done, well done!", "meaganhibbert": "I love it 💜💕", "melhouli": "Literally died when i watched the last, i need more 😩", "the.angester": "Loved it!", "brittanysuzanne709": "Finished the season last night! So sad there’s not more episodes to watch. Fantastic show and can’t wait to see what’s to come!!", "ledentdelion": "@mindykaling I think you’re a brilliant author/producer/director, but I really wish you wouldn’t white wash your Asian (especially Indian) characters so much. The Mindy Project and this new show were so good but would’ve been so much more interesting and relatable if the Indian characters weren’t so white washed and actually exhibited more Indian culture. It’s honestly the main thing that puts me off from your shows and makes me stop watching. Otherwise you’re brilliant and your sense of humor is one of the only types I love!", "jodyrph": "Love this is so funny!", "anstein12": "Is there gonna be more ... it may not have you but i can.tell it has ur touch ..good job...love your humor", "knemati16": "I LOVED the show! Watched it in two days. Seriously hit me in the feels multiple times. Ep 10 was especially savage! Can't wait for season 2!!", "mrsfye": "Not surprising AT ALL! It was amazing! Can’t wait for season 2! Make it happen @Netflix (post quarantine, obvs)", "carawommack": "It is amazing!😍❤️", "tasjastefania": "LOVED IT x", "ektathegreat": "You ruined my day. I started watching at 10 in night.. thought will watch few episodes now and then tomorrow.. i end up watching it till 5 am. Didn't slept at night and now the work day has started... I am sleepy.. but i dont regret it..", "ashlesha_xo": "This show was absolutely incredible. It hit home and was so relevant as to the pressures of being a brown woman- as portrayed by both the mom and Devi. Absolutely amazing 👏🏽", "sandyk914": "Decided to give the show a try and now I’ve stayed up until 2AM watching all 10 episodes. I laughed and I cried. Please tell me we’ll get more episodes soon!", "caitlinsocial": "@mindykaling this show is truly beautiful! It is equal parts touching and hilarious. Thank you.", "viviana.razo": "Gurl i just finished it and need s2 STAT", "quantom_fizix": "I love the representation in this show ❤️❤️❤️❤️❤️❤️❤️", "_mswow": "Love it! 🙌♥️", "mvargasmua": "Loved it! It made me go on a whole flight of emotions on some episodes, can’t wait for season 2!!🙏🏻🙌🏻", "tanvi.022": "@mindykaling I'm in love with this show❤️....it's just so beautiful... please tell me that there is another season coming up...I'm just so eager to watch it", "kpos": "I want more please", "sammylewis86": "@mindykaling loving the show all the way from the UK 😍", "chrislyndcosta": "I LOVE THIS SHOW! Please tell us there’s a season 2!", "sheilamsh": "Balling my eyes out. Thank you team Davi.", "jasmin_rising": "Just finished it and it was so amazing!!! ❤️💜💙 So much laughter and tears!", "chia_wen_yu": "Love this show!", "ashweedoes": "👏🏼👏🏼👏🏼❤️❤️", "latergatorem": "Oh.my.gosh. Miiiiindy!!!! It's so so good. I can't believe I accidentally watched all of it already! 💖 Thank you for this beautiful story. It's all the things.", "alaina_kasper": "It’s really good! I binged the whole thing. Looking forward to season two.", "stellarose30": "So goooood!!!!", "azemen": "This is such a good show! Good job to all! ❤️❤️❤️", "lovablecurmudgeon": "Had to circle back to this post to let you know how much I enjoyed the show! Both hilarious and tender. Can't wait for season 2! 💖", "rani.rj20": "NEVER HAVE I EVER Watched the season in one night on the Season Premiere night itself 🙌until I did for @neverhaveiever i swear 🙌🤩 bingeworthty @mindykaling", "jasminebaeta": "❤️❤️❤️❤️❤️", "emamangela": "@helenabelena84 on it this week!!", "courtneeeeeyyy": "❤️", "shanenayani": "Great showx I just binged it in 2 days", "sbfader": "Binged it this weekend. Loved it! So good ❤️❤️", "brianagnz": "The show is amazing! I’ve already rewatched it three times!!", "jeannie.pham": "Freakin’ looove the show!!!! Keeling over from laughter every single episode.", "monicapadilla7": "Congrats Mindy! The show is so beautifully written! What a fun journey watching Devi’s character evolve! Heart melt! Can’t wait to see Shira’s reaction in Season 2! Woop woop! #teampaxton though 💕", "catiemcfly": "I literally couldn't stop watching it!!", "thompse68": "It’s a wonderful show!", "smorginsky": "I just finished the season tonight! Can’t wait for more!! Well done! 🎉🎉", "tatebrazas": "Just finished watching with my 16 year old daughter. We laughed, we cried, we googled that Paxton is 29 years old. Thank you for this beautiful show!", "emmadalz": "This show is amazing!! I loved it and wanted more!! Please continue to write awesome, funny and clever stuff for us!! Huge fan!! Huge!!", "yostef": "I watched it all on Friday night. I need season 2, STAT!", "eugeniogalanj": "Kudos!", "leahlanning": "WOW!! First episode I thought omg the diversity of this cast is AMAZING!! Then a beautiful girl with Down syndrome shows up in episode 2!! Having a little girl with Down syndrome it warmed my heart so much to see Devi treat her as just another teenage girl💕 I’m so grateful my kids are living in such an inclusive world! And THANK YOU Mindy for being a champion of diversity!! Sending you lots of love and congrats on the #1 spot on Netflix 💃🏻💃🏻💃🏻", "laserandskincenter": "Loved it!", "pritinpatel": "It’s a wonderful show thank you ❤️", "chelseynewbyschwab": "I loved this show. Told all my sisters about it. Season 2 🤞🏼🤞🏼🤞🏼🤞🏼", "jbloss": "🙌🏻🙌🏻 Loved it", "alkaroy17": "Loved it", "lindseylou5880": "I can, @mindykaling !! I straight up started that show at like 9:00pm and finished the whole series around 2:00am 😂 I was hooked!! So so well written and a fantastic cast!!", "nazparv": "Really hits a chord with brown girls of any age!", "dali.mm": "I love this show, binged it in a day and was sad afterwards lol", "w_whitney": "Love it!!!! 👏👏👏👏 Thank you!!!", "nona10s": "@mindykaling Just watched @neverhaveiever ... love it!!!!❤️", "linda.dyer": "I love that show! 😍😍", "housebunny2020": "We binged it in two days! Loved it and loved Four Weddings! Please produce more as soon as you can! You are brilliant! 😊", "bpeppersart": "❤️❤️❤️", "nina__collins": "ITS SOOOOOO GOOD @mindykaling killing it again!", "jmbranch": "I binged all of them in 1 afternoon. 👏🏽👏🏽", "ygodusiiiii": "@danielarellanoaz and I were big fans! Well done💯💯", "kchamp3": "I just finished the season and loved it! When’s the next one coming out?!", "kelder2011": "👏 We need season 2 to be twice as long ! So so good.", "celeste_wright": "It’s so good!! Just binged it", "mcwaters1": "Such a great show. Thank you so much. I really needed a show like that right now. Way to go Mindy!", "sayda.sun": "Too bad it was too short but 👌", "lorilmt": "This show is fantastic, fun, real and just what need right now. Way to go @mindykaling", "oumoum_ab": "Binge watched the season 😍😍😍 loooved it!!!!🔥", "caranorth_author": "❤️ It is such a great show. A balance of comedy and complicated youth.", "hreneec06": "I cant wait for the next season ❤️❤️", "kimanne7": "The show is SO good! I watched the whole season today because I couldn’t stop! I cried so hard during episode 10. Can’t wait for the next season!", "mcsissy": "💕", "missconniex3": "I’m already rewatching! SO so good!", "steffenwifey21": "I loved this show! Such a great story line! Hope there is a season 2!", "marcifulton": "It is so so so good!! Bring on season 2.", "breakingbeautifully": "Thanks for giving us this show! Can’t wait for season 2 (or season 1 part 2?). 10 episodes was not enough 😍", "marks_becca": "@mindykaling will there be a season 2? I loved it soo much!", "pretibham": "Well deserved! 🙌 My South Indian husband especially appreciated all the little details done right. Growing up he always noted that if Indians were depicted at all on tv or in movies outside of India it was almost always North Indian.", "pinkertonlyvile": "I just binged the entire first season and my only complaint is that it’s over 😭😭 It is so amazing! Thank you 🙏🏽", "marianarmae": "@jessicaknox1 have you watched this? It’s sooooooooo funny!!!!! Mindy kaling is so awesome... we need another “sect” 🤣🤣🤣🤣", "blondebritt": "Addicted to the show!! Sooo good!! ❤️", "meghankrouse": "For such good reason! I laughed, I cried, I cringed. 😂 Such an accurate portrayal of the complexities of grief, identify, adolescence. You deserve to be #1!", "lilitout": "Love this show💕", "rdjaner": "Love love love ❤️❤️❤️ thank you 😘😘😘", "a.dolls.lyfe": "Yassssssss 😍😍😍😍😍😍", "ameliaa.simonee": "Congratulation!!! I loved the show and know how much thought, time, and love you and everyone put into it! 💞❤️✨ Thank you.", "emprisslocs": "I LOVED THIS SHOW!! AMAZING JOB AND ACTORS. SEASON 2 PLEASE!", "amybarrow10": "This is a perfect show!!!! I can’t wait for season 2", "jillieana": "It was awesome! I watched the whole season in one sitting couldn’t turn it off.", "monsieurmccarthy": "It’s such a good show! Can’t get enough 💕", "hellowwwwwes": "I loved it!!! I can’t wait for more", "soulgloooo": "WE LOVED IT MIND AWESOME SHOW", "rstarrm": "It’s so good. I enjoyed every minute of it. Congrats! Hopefully we will be seeing a season 2!", "cbw2716": "Loved every minute of it!", "briana_vanegas": "@mindykaling I NEED MORE!! I FINISHED IT IN ONE DAY ITS SO GOOD 😭💕💕💕", "larktate": "I laughed, I cried, I fell in love with the whole cast. Well done @mindykaling just what 2020 needed! ❤️", "afrantzypantz": "So good! I loved it 👏🏻", "alyssaarichelle": "I’ve watched it like 5 times! Love when she fell in the pool! Major Mindy Lahiri vibes!😆 @mindykaling", "thegirljc": "Hilarious! Amazing show 🤩", "kw014": "When's the next season ?!?! Looooooved it 😍", "la_bicho.raro": "dang this must be a good show if it beat tiger king", "mama_tpapa": "Binge-watched the whole first season today! Great story line, wonderful acting...waiting for announcement for Season 2!! Great job, Mindy!!!", "camiethomas": "So cute and funny!!! We loved it! Ready for season 2", "cleomoreira": "Season 2 has to confirm ASAP", "jessmcgins": "It’s on my list to watch this week!", "sarah_hawdon": "Almost binged it all last night, finishing up tonight and so bummed there’s not more seasons already 😭😭😭", "ma_bel_le": "I finished the whole thing last night. ❤️❤️❤️❤️❤️ cant wait for season 2", "naturally_t": "Incredible!! I loved every moment of it and couldn’t help myself from binging the entire season today.", "stephhausner": "This show is amazing!! This character is more teenage me than any other I’ve seen on tv!", "eliz.ani": "❤️ the show...", "melissa_dedieu": "There needs to be more of it ❤️❤️❤️ #addicted", "plumeria620": "Just binged this!! So good! Love Devi’s quick wit and sharp tongue!!", "smallsgsd": "Thank you for this little gem.", "optional_ninja": "I binged it in a day. It spoke to me on so many levels. Can't wait for future seasons!", "emelyelizabeth": "When’s season 2!!!", "sulty23": "Love your new show I binged watched it in 2 days👌👌👌 @mindykaling", "the.sisters.k": "In Morocco too! Just finished it. ❤️", "katie9lady": "It’s great! 👏🏼", "lisacamp23": "🙌 love the show!!!", "themullett": "LOVE this show. Everything.", "sandystef100": "I loved your show soooo much!", "choualacreme": "CHALLO! ♥️👏🏾👏🏾👏🏾", "legallyblonde.esq": "Please keep making great material with 3 dimensional characters...you are so talented", "shelleyannew1": "Loved this show hoping for a second series❤️❤️❤️", "ashley.potts": "I sobbed in the last episode when they went to the beach! So good!!!", "momentsbynaomi": "It’s the best show and so hysterical legit please come out with season 2 quick", "maudelou": "It's soooooooo good! Thank you!", "nmurphy65": "Love it!!!❤️", "joecunha_": "I’m not really into this types of shows. But I thought this was really good. 🙌🏼🙌🏼", "ac_1600": "So I’m 25, and I loved this as much as I loved The Mindy Project. ADORE everything you do!!!", "msalexl81": "@mindykaling this show is fantastic!", "lilacblue": "It was lovely! Binged it in one sitting.", "shandace808": "There better be a never have I ever 2", "lizmurdochh": "Need more episodes.. 😍", "jjintravaiapralle": "Love love LOVING this show!!!!! 😍🥰😍🥰👏👏👏", "rogue2780": "I truly hope there’s a second season! ❤️🔥 Amazing show and it totally pulled on every heart string... I want more!", "zahrazelliche": "i’m obsessed", "jessica_marie": "I binged watched it in 5 hours!! Loved it!", "ginafranz15": "I’m halfway through the first episode and this is a beautiful show", "tturner39": "My daughter and I watched the entire season last night. We loved it! Such great characters! Thank you!", "surayyah_m": "My kids and I absolutely love it!!!! ❤️❤️❤️ So ready for season 2!", "amg1066": "🙌🙌🙌🙌🙌🙌🙌🙌🙌", "nitya2u": "It was the best! Totally relatable, sweet, touching, funny...I laughed and I cried! Thank you for sharing with us!", "steph_troutman": "Watched with my daughter this weekend. We laughed and cried. Wonderful show!", "victoria_saravia": "Love this show so much we neeed a season 2", "jeremy_the_pug": "Just watched it all today! Loved it!!! The last episode 😭 x", "bean.the.irene": "Binge watched today. All of it. Crying, laughing: what a beautiful show. Good job, lady.", "ca182": "Omg I binged the whole thing! Love it!!", "jessebyah": "Binged this show so hard. I loved it!", "nicole.lavy": "Great show! It’s also trending in Peru of all places, currently number 2. This show is amazing and heartfelt and funny and to be honest a little cringy, but totally awesome 👏🏻", "anatmaor84": "Amazing show! Love it! It is going up to #1 also in Israel. BRAVO 👏👏", "_alex.german_": "I am absolutely in love with this show I need more ASAP I already re-watched twice", "dovmamann": "MORE SHIRA!! She’s so cute and killed it 🔥", "carlabisart": "I love it!!!! 😍👏👏", "aubiergine": "🔥🔥Love it!!!", "wendy_kobza": "Oh my gosh! I just finished binge watching. I spent the last episode crying! I’m not sure if I was happy or sad!!😭😂", "_.emilymolina._": "When’s season two. At first I was like when where u in @neverhaveiever and I saw the creators and I was like omg she was also in the office 😻😍🔥❤️❤️❤️", "anniearbenz": "Best show on Netflix!! 👏👏👏", "beansandrice": "It’s SO good and so enjoyable ❤️", "awilliams845": "Congrats I’ve never seen a show that’s popular it looks good but my mom won’t let me", "anneygirl": "Binging @neverhaveiever with the hubs.... It's awesome, @mindykaling! We're going to be sad when we finish the season 💛", "mkhantastic": "💜💜💜 this show! Can't wait for the next season.", "ameliacbd": "@mindykaling I am loving this and a shout out to the music coordinator, loving the music.", "itsmesadie": "We laughed and cried. It was honest, fresh, and smart. Well done! We can’t wait for more.", "thejuliebel": "I am LOVING IT!!", "mj.heavy": "SEASON 2!!!!!!!!!!!!! @mindykaling", "meffedup": "So much ❤️ for this show. I was a geeky Devi in high school. Painfully awkward. I visited South India last year to visit friends and I just love seeing the Indian culture featured. I also lost my fun loving, larger than life father unexpectedly 7 years ago and the Malibu beach scene almost killed me. Cried a crazy amount of tears. Thanks for this wonderful gift.", "me_theuninvited": "Really disappointed that you've used the chance to tell the story about one minority group to degrade another. You know I'm talking about anti-Muslim agenda in the show. Extremely shameful!", "bar2210": "🍾", "plfzao": "Such an amazing show! Great job as always ❤️🔥", "j_chaaa": "I finished it in 2 days.... I love it omg 😭😭", "mogignac": "Love loved love it! Watched it, then rewatched it with my husband 🤣 excited to see more ❤️❤️❤️", "jillsimp23": "Such a fantastic show!!", "feeyohnah": "Well deserved 💕💕💕", "sabsfitness101": "binged it in 1 day, it was so funny!! looking forward to S2:D", "parris_maybefrance": "❤️❤️❤️ Binge watched the whole season now I need more.", "angell.harris.3": "It was a true testament to your skills as a writer and was a truely wonderful, touching, complex and quality production and story. Can’t wait for series 2!", "madeyeha": "thank you so much for making this show. finally seeing people who look like me in major roles on TV is an experience I never thought I would have!! 😭😍🔥", "tracy_ncsu": "So funny!! Love it", "baomisoep": "@mindykaling having binged everything today, i definately need more. Beautiful, hilarious and touching series, that hit me right in the feels. ❤", "katy_grassick": "We watched it over this weekend and loved it. Laughed and cried....really hoping there’s a season 2 🤞🏼", "ashes130": "Just finished binge watching this show and I just have to say how much I absolutely LOVED it. I can’t even say how many times I laughed and cried. It’s amazing and can’t wait to see season 2 (hopefully) 🙂", "jettd_": "It was great", "emmalupinella": "You rock", "almaluz40": "A Beautiful show💗💗", "lizcattel": "More Shira in season 2!! She was hilarious!!!!", "claudiats0409": "Binge watched it this weekend and this was just what I needed! Loved it!!", "_makayla.m": "I absolutely fell in love with this beautiful show. Great work!", "jeannypo": "I just binged and loved this show. All the way from Sweden 🇸🇪 Please tell me that a season 2 is in the making ❤️", "ten1776": "@mindykaling I Loved it. Definitely recommending to everyone!!", "shann.catx0": "Loved it !!! 🙊😀", "hazel.noreen": "I enjoyed the movie a lot.", "stephanievanduuren": "I love this! ❤️", "beautiful.dynamite": "This show is dynamite...I devoured it in one day. Although I expected nothing less than brilliance.", "crazyglued": "Loved it💙💜", "bethsp72": "❤️ it!!!", "littlelydiact": "I started watching this last night. You always make the best shows!", "anjanee.dietitian": "I'm slowly making my way through all the episodes and loving it ❤️😁", "kirsten_0753": "Such a great show - watched it all last night!! Can’t wait for season 2!", "rsengaroun": "So good!!!! We need season 2 please 💕", "dragnot": "🔥🔥one of the best shows I saw on Netflix", "srkarpur": "Wow, @mindykaling loved the show. V well done!", "cashmere_and_curls": "@mindykaling This was the most genuine, honest, heartfelt show we’ve watched in some time. Such great performances from every actor! Hoping for a second season 🥰🥰", "the_first_rubenian": "Nice", "marittalove": "Going to start it tonight!", "cmaxkc": "👏Thank you for sharing this marvelous story.", "_andressaaguiar": "I desperately need new episodes! I loved this series so much ❤️❤️ You are wonderful 👏🏻👏🏻", "kathleen.mattern": "Loved it", "daennacakes": "I love it so so very much! 👏🙌❤️ Bloody brilliant👌", "karentrower": "Love your new show but I love anything you do or are in. Kudos and thanks for always making us laugh. ❤️", "cathrynbach": "I hope there are more seasons. I watched all of the episodes last night. So funny. Loved it.", "tubsmorris": "I LOVED it! Just what we needed right now...and any time!", "mel_ylizzy": "Loved ut💓🤗 can't wait for another season @mindykaling", "la_mamajoe": "@mindykaling how on earth did u get John McEnroe to narrate your series?? It’s so friggin awesome", "vigesaak": "❤️ the show!", "natmorales__": "Thank you for creating a masterpiece", "tsp_sucre": "It is so good!!!! 37 year old me loved every second of it and my husband enjoyed the three episodes he watched with me. I needed a good cry to release all the stress from this month and the last several episodes did the trick. I never rewatch anything, but this I’m going to watch again. I cannot wait for the next season.", "cijisullivan": "I enjoyed it so much 👏🏻👏🏻", "falenkdwb": "Just started today, and I love it so much! Thank you for giving us something so hysterical and heartfelt❤️", "laurenamada": "You don’t understand what this show means to me. I can’t wait for a second season!", "newsbreaknow": "You can’t be shocked! It’s such an incredible show. Brown girl magic ✨", "jazzydodge": "Such a good show", "tamiturk": "👏🏻👏🏻👏🏻", "crys1976": "I watched the series with my 14 year old daughter and absolutely love it! Amazing!", "beanpi2007": "Thank you for making this show. We love it! As a Indian American girl who grew up precisely in the San Fernando “Valley” in the 80s and 90s- it is amazing to see a story about someone who grew up like me on the screen finally. It brings back loving and heart breaking memories. Fabulous cast. Love all the strong women. Keep on doing what you do Mindy. Here’s to the Devi in all of us.", "russstopher": "It's a great show", "amyamirault79": "Best writing. I cried like a teeny tiny baby all through Ep. 10. 👏🏼👏🏼👏🏼", "magster13": "I just finished the show and loved it!!! The finale bought me to tears. Thank you @mindykaling for such an amazing story. ❤️ Please say there is a season 2 in the works.", "frank_cousineau": "Just finished the show with my wife and i can't believe how good of a writer you have become Mindy. Can't wait to see your next season or project.", "crystalc_johnson": "Because it’s so good", "nikk_is_dead": "I LOVED IT! Was weeping at the last episode", "kristinator07": "I LOVE this show!!", "sarahheine": "Loooved this show! 🙌🏽 My mom is from Tamil Nadu and I could relate to everything 😂 We live in Stockholm 🇸🇪 but we also had indian partys that never started at the time that was said and took place at Schools that where closed over the weekends😂😂😂👏🏽👏🏽👏🏽👏🏽👏🏽 Saw the whole season in one day, without any break (except for snacks) Can’t wait to see season 2!🤞🏽🤞🏽🤞🏽🤞🏽", "omishapillay123": "Please💞 can we have another season, I completed the entire season in 1 day! I loved it... #proudsouthindian💞", "jennymillerpratt": "So many legit LOL moments with heart. Thanks for creating such a gem!!", "lucyhelena": "Smashed it in 2 days. Want more! 😍", "jadelynae": "Because it’s a beautifully amazing work of art! Thank YOU Mindy 💞", "radamlieber": "It’s great, congratulations!", "maria_archaeology": "Yesterday it was 1 in Denmark 🇩🇰 ❤️", "oneal.emily": "I’m watching it now and loving it!", "fathergrace": "I loved it so much", "lauryprzz": "Es genial!❤️", "elyodharas": "Mindy, it is the CUTEST thing I have seen on tv in a while. I LOVE IT.", "_shaina_lynn_": "Really amazing show! It had all the feels 😭😍", "samisaurus29": "I knew this show would be good if you were involved but man it was amazing!!! ❤️❤️", "zali17": "It was so good !", "lease___": "Binged it in two days....LET’S GO SEASON TWO I’M READY ❤️ #teamben", "agape.sarahwhatley": "Girl duh! Every minority girl felt this shit🔥🔥🔥", "naama_porat": "Mindy i love u♥️ everything u do is fire🔥", "nicolecowmoo": "This show is perfect.", "aminameah123": "Just finished never have I ever and it was really good, I related to it so much. Even made me cry... a few times xx", "thisworldandme79": "I’m half Indian and grew up around the Indian community and attended pujas. This series is right on point with awesome humor! I’m recommending it to everyone I know! The actors are also amazing! Perfectly chosen for the characters they play and perfectly executed. I can’t wait for Season 2!!!❤️❤️❤️", "ecmoore45": "It was sooooooooooooo good!!!!", "rookiedancer_27": "Sending all the love yasssss 😍🔥", "charliebarlie": "Hey Mindy, just finished the show in one sitting and just loved it. Having a strained relationship with my mother myself, I found it very relatable, and more recognisable/realistic than how its usually depicted. Thank you!", "jaymelyn525": "Just started watching today and HOW THE HELL ARE YOU SO BRILLIANT? This is amazing. Thank you for bringing this to us all.", "sevondra": "I finished my quarantine puzzle while watching the entire season. So good! Congrats!", "zombabomb": "My Netflix shows Deadpool 2 as number 1", "ginnakarla": "I LOVED it. What's next? Whatcha got in the hopper?", "ashikachetty88": "Great show! As a Indo Fijian who was raised in USA I can relate to Devi in so many ways! I’m so proud to know that you are making such an impact in American cinema. Keep shining ⭐️❤️❤️", "lakerrach": "Finished it all in one day 🙌🏼", "ris_in_lalaland": "❤️ the show! It’s funny and I love getting an inside look on Indian culture. Bravo!", "twohartdreamers": "So good 😍", "vkbell_eich": "I have one problem with this show... I’ve already watched ALL 10 episodes!!! We NEED a season 2!!!", "jonesabbey": "It was so great! And John McEnroe!? Amazing...", "its_tea_j": "Also #1 in Croatia 😊 congrats Mindy, I loved the show ❤️ hope to see more from you soon!", "ackhenry15": "Just finished @neverhaveiever and cannot wait until season 2!!! @mindykaling you've created a wonderful show with beautiful real characters thank you!", "aracellivh_": "You and your crew did an amazing job 😍 love the show, my whole family loves it 😎", "swats0615": "I had been waiting for this show to come out after watching the trailer. As soon it was available in UK, I binge watched (with my husband), and now waiting on the edge of my seat for the next batch of episodes! Amazing cast, especially Devi 🙌🏽", "belladot7": "Loved it! Can’t wait to see what season 2 will be about.", "maggiealbvallee": "Love, love, loved it!!!!!", "schrodinger_spy": "I loved it. I saw all the episodes. It's a really sweet and funny show.", "gynes_spynes": "Loved it!!", "aavillagrana": "👏👏👏", "rjwonder": "Wow!", "ceafbaby": "Loved the show!!❤️", "oliveh19": "Mindy I just finished it and am sobbing! I loved it so much! Thank you for making this show!", "indy_hooty": "@mindykaling the show was amazing! Please give us more 🙌🏼", "glendi78": "@mindykaling great show!! I gave it a chance since I thought it was teeny bopper show but it was great!! Great writing and touching.. really enjoyed cast too.. ❤️", "sternanator77": "I just binged watched this show and it made me so happy. Happier than I’ve been in months. Thanks for your wit and brilliance, @mindykaling!", "sine_qua_": "IM VERY VERY SAD I HAVE TO WAIT FOR SEASON TWO WHY DID IT HAVE TO END WHY WHY WHYYYYYYYYY😩😩 (I watched it all in one weekend). There’s a hole in my life where #NHIE used to be 😭😭😭", "rutilia_79": "@mindykaling Omg I feel in love with this show.. can't wait til the new season comes out.", "cwilson818": "Just finished binging it and omg it’s so great 😭😍 Season 2 plzzzz!!! Big love from 🇬🇧", "betcyj": "Great work Mindy!", "magneticzeros_": "Amazing show Mindy !!!!!! Much love ❤️", "mranta68": "😍", "elliefv1": "So good! Loved it❤️", "chasing_la_luna": "🙌🏻🙌🏻🙌🏻🔥🔥🔥", "emelynda14": "I need season 2!! Please and thank youuuu! @netflix", "canadia_girl": "We love this show so much! Hysterical and sweet. Doesn’t hurt that the lead who plays Devi is also Canadian! ❤️@martinkaminski", "aldas7": "season 2 please😭❤️", "amygamh": "This show is so good! I literally binge watched the whole season in the same day! Gotta admit the end of the season was kinda disappointing for me but the door is open for better things to come, that’s why we absolutely need a season 2! ❤️", "reemm74": "It’s #1 in Bahrain too!!", "nishabaines": "Love #neverhaveiever it was perfect such a subtle way to go into grief life and being Indian. Mindy you did it #proudtobeindian #soculturallytrue #missindianaunties", "rumi_maktub": "I loveeeeeeed it!! I'm not Indian, but I connected on so many levels from a multicultural perspective. I finished it in one settling. Can't wait for season 2!! ❤️❤️❤️❤️", "drmarthagulati": "This is the best show ever. We didn’t mean to binge watch it. But we did. You are an amazing creative woman! So grateful for amusement during COVID19", "purvidshah": "Best show ever 🙌💕😘", "taverie": "Amazing show. ❤️", "indian_on_fodmap": "We started watching this last night and it's so relatable even growing up in the UK. My Italian husband has been watching it with me and he even he gets all the Indian references 💕", "fortylove": "Loved it!!! 🙌🏼 The scene on the beach... 😭😭", "yvettezo": "@mindykaling it's so engaging and a wonderful cast. You are killing it as a producer, loved 4 Weddings, love this, loved Late Night. I still miss Mindy Lahiri, her friends and her beautiful apartment though. 💜", "cyntiatrevor": "You are a true legend 😍💖", "mashtonll": "More please!", "iratshuv": "I am from Isreal your show is so good!!! When S2????😍🔥", "alexandra_montague": "Loved this show!!!!!", "claire.speedy": "Absolutely loved it 👏", "luluboo3333": "Amazing show! Binged it in one day! Can’t wait for the next season 💜💜💜", "live_life_as_you_like_": "Loveddd ittt❤️❤️❤️", "cfc10": "Us old people watched in entire series one evening. Bring on Jr. year!!", "nitishajanki": "Love it!!! Bring on season 2!", "anna_francesca_": "The show is wonderful, @mindykaling!! Binge watched last 10 episodes!", "nimi.dhaliwal": "So amazing 🙌🏽", "_civen_": "This is a Masterpiece! @mindykaling #neverhaveieverlaughedsohardthisyear", "leahweatherill": "🙌", "melissaaddessi": "It was really great! 👏🏼", "rachel96thomas_": "This is what happens when masterpieces are made. LOVE THE SHOW", "eidyreginna": "Série PERFEITA❤️👏🏾", "tanyamrobinson": "*Bring on season 2!!!!!", "mstaosoga": "When is season 2 coming ???", "daphnevangough": "I’ve binged the entire season twice already.", "saaddawoodi": "@mindykaling It really is wonderful, thank you for your awesome work!", "shannonewok": "My daughters love your show! Congratulations!", "mags120": "It’s so good! I watched it in two nights!!!! ❤️🙌", "posteriley": "Great show!", "krissierigo": "Loved this series. Binged it all last night. Didn’t expect to feel it as much as I did. 😥", "vix_stix_virasamy": "Absolutely loved this show! Finished it in one sitting - laughed, cried, everything. Well done ❤️", "purvidave007": "I binged all except 2 episodes last night with a girl friend. It's crazy to see how so many parts were relatable growing up in the states and trying to embrace my hindu culture which was incredibly hard to do going to a school where they had very few indians. It is really unfortunate that even after 20yrs kids still face the same difficulty that many of us faced growing up to feel included with our diverse backgrounds. Mindy this show is def a good start in that direction to bring more diversity in mainstream media. I wish there was a boy version of this show as well because I'm sure many boys also had a hard time living a dual life as I know my brothers faced similar problems I did but in different ways. Great show and can't wait for season 2 to come out", "cindrlings": "It was wonderful. We took it all in last night.👏😢😍😂", "atashajamesdc": "I loved it. Bravo. Well done😘", "g33ksha": "Congrats Mindy! This show is so relatable 😂 for every Indian American 2nd gen girl ! I also loved the Mindy project (I’m a physician too) . I feel like you’ve now completed my high school to physician life journey on television 😍❤️💪🏽. We love you!!", "cherylmari": "My niece and I think this show is AMAZING! 💕", "gerrymumu": "It’s really good 👍👍", "cheribomb54": "👏👏👏 the story telling 🔥", "nixoax": "@mindykaling Whose photo is at SS room after @barackobama?", "yuni_lotus_consulting_": "Congrats Mindy! Best wishes in your continued success!", "mommi2boyz": "It’s soooooooo good! When is season 2?!?", "srichfitness": "But is there going to be a season 2??!! I finished it in 24 hours and I’m so bummed now!!!", "kxlesnyder": "it’s sooooo amazing! best netflix show by far 😭", "herecomesthesun2": "This show is awesome!!!", "itsrue2u": "We simply 💜 everything you touch girl 🙏🏾", "haiku221b": "Love the show—on ep 6—gotta say the Devi is def Slytherin, NOT Hufflepuff", "kazas23": "This show is amazing made me laugh and cry brilliant ❤️", "sarah.estrada": "It was so good!!! 💓", "travellingchair": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "wavexrly": "Thank you so much for creating one of the best shows I’ve ever watched 😭😭 Just finished and when I say I am DROWNING IN TEARS I mean I am DROWNING IN TEARS 😭", "melissa.landon": "This show is so good!", "dgonzalezmd": "Love it! ❤️", "kelesee": "👏🏽👏🏽👏🏽", "lucylu_bk": "It’s exactly what we need right now ❤️", "tish_moodley": "LOVEED IT‼️ I CANT WAIT FOR THE NEXT EPISODES @mindykaling ♥️♥️", "mserafin75": "Just finished and LOVED it!!!", "jmichellelopez": "This show is amazing!!!!!! Please say you will be making a second season!!!!", "misterbusse": "Well deserved 🤍", "misha.bhikha": "@mindykaling in South Africa as well 👏", "psydoc63": "❤️", "catewestzahl": "Mindy this show made me laugh and cry and I didn’t know how much I needed to, thank you so incredibly much, it’s PURE MAGIC, so incredibly well done!! @mindykaling", "ozkoc.sinem": "Me and my best friend just watched the show. No notes. Incredible. Thank you for creating such a real and complex characters. Never stop producing.", "im.perfect.ly_me": "BEST thing I’ve watched all quarantine. Such great character development and a really moving storyline ❤️", "mama.deanna_": "My husband and I watched the whole season in record time! Laughed and cried!!! Congratulations @mindykaling !! Love you to pieces!!!❤️", "oohthephysicist": "I binged watched it all yesterday! Amazing! 👏🏼👏🏼👏🏼👏🏼", "zuladiary": "Need season 2!!!! It's an amazing show❤️😍🔥 @mindykaling", "lisanehurtubise": "Loved it! Well deserved success xo", "cookineats": "We love it!! Please keep it going! Unlike the character I’m a Pakistani Muslim (but desi nonetheless!!) & my heart was bursting with joy to be able to share the show with my white husband as a desi girl!!! Thank you! ❤️❤️", "dramypatel": "Congrats!! Such a great show!! ❤️❤️❤️", "nancysparklz": "@mindykaling i watched it twice! 🤩😍😍👏", "k8e_carptight": "Everything you touch is gold Mindy!! We love your work! 👏 So much fun to watch.", "honggulnrat": "I binge the show in one go. 👏 Great job, we love it", "awawani": "👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿", "xicagram": "Love anything you do Mindy! Bring back the Mindy Show please 😍", "wild__hrt": "You’re incredible!!", "naptural1": "I binged this yesterday, and loved it!! Can’t wait for season 2! 👏🏾👏🏾👏🏾❤️❤️", "sungoth": "The girl is 18 n Paxton is 29 please get better casting", "yosoymarciana9": "It’s such a good show! I want MORE!", "mahiroopa": "Season 2 please ... I can't wait", "sumanmudunuri": "@mindykaling thank you for making a show every south indian girl with immigrant parents can connect with. @maitreyiramakrishnan you are amazing!!", "julesmanfredi": "I binged it in 2 days. I can’t wait for the next season!", "thelndz": "Absolutely loved it! Im ready for season 2!", "absmiraglia": "My husband and I just finished watching it and loved it!!!! Please tell me season 2 is already in the making, I need to know what happens next!!! 💖", "maxinelui_": "@neiissa_", "rockchickflick": "So good!!", "capitalkidsamoi": "Binged watched this gem....I cried, I laughed and felt represented. Thank you Mindy for this beautiful story of little brown girls and grown brown moms. I saw myself (both now and before) and I saw my Amma. 💕🙌🏽", "ntuck0387": "🙌It’s so good!", "smercie": "❤️❤️❤️everything about this show!!!", "jrt8103": "🙌This show was awesome I love it please say there’s another season coming out.", "serenityand": "I watched the whole season last night. So. Good.", "kittehmafia": "I binge watched and I laughed, cried, then thought, \"Oh sh*t. Am I team Paxton or team Ben?\" I don't know!! Need season 2.", "shehani__alu": "too good! TOO GOOD 😍❤️ CANNOT WAIT FOR SEASON 2!!!!!", "aeluric": "YES YES YES INCREDIBLY PROUD IM SO HAPPY FOR HOW MUCH NOTICE THE INDIAN COMMUNTIY HAS BEEN GETTING BECAUse OF THIS, MINDY U CHANGED MINE AND MANY OTHERS LIVES 🤧🤧😭💞", "carlblando": "Just started it and love it. Thanks", "elif.karol": "You've made such a beautiful show! 👍🏼👍🏼🎬👌😀🙋‍♀️❤", "erinlovesharrypotter": "We need season 2!", "niz0607": "Its soooooo good!!!! I'm from Kerala but brought up here and I see myself in her. It's so funny and has a great story line", "rachelelvr": "It is SO GOOD", "dominiqueamoore": "Woooooooooo 💕💕💕💕", "tracy.boulton.714": "So great. Waiting for season 2", "jadevert": "Mindy this show was absolutely amazing. Made me laugh and cry can't wait for a season 2!!! ❤️❤️❤️", "runningthroughthirty": "Binge watching it this weekend and LOVE IT!! Congrats!", "airingmylaundry": "My 13 year old loves it and says I must watch. She’s all “I thought I was having a bad day but this poor girl has all sorts of troubles!”", "roamfreewrites": "I’m LATINA AND I LOVE THIS SHOW AND EVERYTHING IT STANDS FOR❣️ IT WAS INCREDIBLE TO SEE OTHER BROWN PEOPLE REPRESENTED ❤️❤️ ESPECIALLY A CAST AS DIVERSE AS THIS! I loved SEEING PEOPLE I WOULDN’T USUALLY SEE ON SCREEN... THIS IS WHY IT’s IMPORTANT FOR MINORITIES TO WIN LIKE YOU HAVE... BECAUSE THEN WE GIVE OTHERS LIKE US A SEAT AT THE TABLE❤️❤️❤️❤️ GREAT JOB MINDY🙏🏽🙏🏽🙏🏽", "_n_again": "My 25 year old son told me to watch it.", "abbeychristina21": "@mindykaling I binge watched this is 2days reminds me of my childhood ! Absolutely loved it !", "loreepav": "I laughed so hard the next day my stomach hurt like I did an ab class 🤣🤣🤣", "lurcaral": "I discovered this gem today and I'm not stopping watching until I finish it ❤️❤️", "brichu_alaniz": "🔥🚀🚀", "minx1102": "Last night my husband and I just wanted to check out the first episode together, 330 in the AM later, we were sobbing at the last one. You should be so proud! Well done! Loved it!👏👏🤩", "northernbelle09": "Started this last night after your post. And its amazing! Actually cried a little in the first episode but also laughed. Congrats on your new hit show!!", "correy_897": "Loved it!!♥️♥️♥️", "sunnyd.718": "I watched the entire season yesterday on recommendation, love it! So brilliant @mindykaling", "shandralyn55": "I just binged the whole first season and can’t wait to see more!!!! 💖💖💖💖💖💖", "cresdan1969": "Love our Canadian girl !", "linchar4": "I loved your series please write more please", "mariannetexier": "It was sooo good! 🔥❤️", "deanarodriguez": "Any show that celebrates the beauty of a complicated (yet simple), conflicted (yet consistently herself), intelligent (and realistically clueless) young female living among more than one culture, has my full attention. [Whew, I managed to avoid the oft-used words \"quirky,\" and \"clever,\" although it's those things, too]", "lauracunningham55": "It. Is. Sooooo. Good. You are a rockstar!!!!", "rad.hahaha": "SEASON 2 PLEASE", "court_caldwell_koscielski": "❤️❤️❤️🙌🏻🙌🏻🙌🏻", "leighmcauley1": "Binge watched and loved! 🤩", "giraffemoo": "Your show is AMAZING, I loved every second of it! I cannot wait for more. Thank you for creating this.", "inspiringwit": "So good!! Love it!!", "paytonthings": "You’re a gd legend, Mindy. 💚", "grlnxtdoorisblk": "This show makes me happy. I love alllll the diversity and the richness of the characters. Great job by all!", "asachar77": "I've waited for a show like this! Thank you so much for bringing an Indian family to TV! Love love it! Love you and all you do! ❤️❤️", "ks31769": "I binged this and laugh cried the entire time. So good! Thank you for this. My dad died when I was seven, Devi brought back a lot of what I felt at the time. Spot on.", "meowsiesmom": "Wow, I will check it out today! Congrats!!", "oreosam": "Loved this show. Love all of your shows 👍🥰", "cindy01231959": "Just start watching— this is so good!!!!! Your cast is amazing!!!", "mrs.caro_m": "Such a good show", "megc23": "Dammit when will we get season 2?!? Watched the whole season in an evening!", "the_real_houligan": "We binged the entire thing over 2 nights and we’re so bummed when it was over. We loved it so much!", "cat_ymf": "Love it!! I’ve been watching it non stop.", "blaisey_t": "SEASON 2 PLEAAAAASE 💜💖", "lindahayakawa": "Fantastic show!! 👏👏👏👏", "jesssicalynh": "It was AMAZING!! Loved the show, characters, plot, awesome acting, just great all around 👏😊💕", "dominiquegnagne": "the respiration was amazing!!!", "davlop_97": "It's justified. The show is great ❤️ season 2 pls", "brewcoxy": "I loved this show. I cried. I laughed 💚🔥", "shrutidshah": "❤️", "maggiemoonpie00": "Literally the best thing I’ve watched in a while. The finale had me weeping. LOVE IT SO MUCH 😭❤️", "bionicgrl": "Representation matters. Mom speaking a South Indian language ... On TV ... and not for comedic effect... That's still surprising and delightful to this 40 yo. (we speak Telugu at home). And the show is relatable to anyone. Thank you for a fun, funny, very bingable show!", "erincrystalseptember": "Trending in South Africa too 🌍😍 binged the entire season last night 😍 BRILLIANT WORK FROM YOU AND YOUR CAST", "sweetpeazan": "I binged it last night! It was really good.", "briannaroseflores": "@_victoriamata_ you have to watch this. I finished the entire season in 1 day!", "frau_gem": "I am not Indian, but I was full of Indian pride during the Puja scene!!! 👏🏼❤️ Great show! 🎉 🇮🇳", "yoginihan92": "Honestly the best show I’ve seen in a LONG time!!!! I found an old flapper girl dress and put it on and couldn’t help but go up to my mom and say “I’m a sexy flapper guurrrrl” 😂❤️ thank you @mindykaling for being so damn amazing! And the rest of the cast & crew xoxo", "yeboahnovifi": "Just watched all 10 episodes in one night. Fantastic series, can't wait for season 2.", "raymamichelle": "It was so amazing!!! Can’t wait for season 2!!! 😍😍😍😍", "ack2antman": "@beedsmaroon 🌟🌟🌟", "brettgursky\nVerified": "Verified", "marshallchiles": "Such a great show. Congrats", "erfaanarif": "The n you so much for being you and making so many of us feel heard and seen 🥰", "kriyer": "Loved this show.", "karaayn": "Loved it! Why is the cover photo different in the US from every other country?", "weldon_frenchie": "You've made an amazing show. While I am no longer close to being in high school, I appreciate that you made high schoolers realistic.", "tejesvi": "Just binge watched it today.", "zillyb": "Great show! When does season 2 come out? May have watched the whole season in one sitting having not watched any television since March...", "marikamarudin7": "but MINDY it is SO SO SO SO SO SO GOOD", "rissadstamler": "It’s an awesome show. Loving it 🙌🏼❤️🙌🏼❤️🙌🏼❤️", "melissaportella": "@mindykaling ITS SOOOO GOOOOOOD", "sun_shon": "Started and finished it yesterday morning. I felt so disgusted with myself. Was suppose to watch in increments but having a teen daughter myself we just could not stop watching until end!! Go @mindykaling !! Love anything you are apart of! 💕", "kevstagramz": "Ramona Young... that is all", "aerdnaeel": "Plz make season 2!!", "lilyelise88": "This was amazing! I already need another season after binging the first!!! 💗💗💗💗", "sharmerende": "Love it!! I laughed and I cried. Can't wait for next season 😍", "marcelasobrinho": "Waiting for season 2 already 😬", "meloulou31": "Well deserved 🎉. I binged watched all the episodes available and I absolutely loved it. I was trying not to because I have a 4 year old who doesn't care that mama was up until 2am watching a show on Netflix but I simply had to 😍", "mxs52": "Quite rightly too! Laughed throughout and cried at the end. Absolutely loved it! ❤️", "tracal2": "Congratulations. Just binge watched it today. Loved loved loved it 😀", "stefienache": "It was so amazing! With all its little quirks, just perfect 😍🔥", "lifeisbetter.barefoot": "Binged it in 3 days!", "saintdusti.n": "The show deserves it💕", "gaudettt": "You don’t realise the impact of representation in media till you see someone who looks like you and has similar family values and has the other little ethnic experiences and you just can’t stop feeling less alone.", "tashkile": "Binge watched never have I ever! Loved it! 😍😍 🙌🏽 thank you!", "arlocascio": "Loved every second of it.", "lifeofprincessetana": "I just finished the whole szn in one sitting 🤧", "stephie80kc": "I just finished it!! It was so great!! Please film more!!! ❤️", "_jasmingoode_": "well it is the best show on netflix so i’m no surprised 😂", "jamie_tisdell": "It’s amazing! I love it. Im making all my friends watch it. Big fan.", "shreepea": "Love this show so much! 🙌🙌", "cvrow6": "I absolutely loved it , watched all episodes yesterday x", "keirazkng": "I hope we get a season two 🥰🥰🥰", "pincuswifey": "I’m so not surprised, @mindykaling . Honesty is like gold and that show is full of it. And it’s sweet honesty and love without being harsh or crude. You and your team have a way of making us fall in love with characters right away! Can’t wait until next season!", "beafontecchio": "We watched a bunch of episodes last night (we have 4 left for tonight). LOVE this show and when I thought it couldn’t get any better you use my favorite Robin song as background ❤️", "slc_93": "Just finished it - brilliant! I was not emotionally prepared but my gosh it was so satisfying 👏👏👏"}