{"jujujuelz": "Where is One tree Hill!!!!!!!!!!?????????:)", "karxdsz": "@goodtrouble and One on One", "ktlcliff": "On my block!!", "hellomynameisjen": "One Tree Hill!!", "maiyabsmom": "@mindykaling saved by the bell (I loved Lisa Turtle). 90210 had one episode with Vivica fox and Brandon dated a Latino girl from the good for like 3 episodes. However, the 90210 remake was very diverse. What about a different world!! Loved that show!", "slightlysouth": "Degrassi!!", "alikatster": "One tree hill. Right now!!!", "anujoshirealty": "RIVERDALE.", "marleyvous": "🧛‍♂️ The. Vampire. Diaries. !!! Also, 🔹Roswell, New Mexico🔹 is fantastic!", "anjparm": "Post more of your fav teen dramas plsss!!! 💓", "nehabhandari_": "@mindykaling the fosters & good trouble", "twen15": "@mindykaling TEEN WOLF", "jadeski_emily": "@dalyworden @paulafromthesewer", "xoxiu": "On My Block!", "notpinthura": "Veronica MARSSSS IS THE TRUTH", "victoriaquesnell": "Gossip Girl and Buffy the Vampire Slayer 😍💯 ✅", "lovelee193": "FNL was amazing!!", "brendanuegama": "Glad you like the show @mindykaling Thank you for the kind words. #riverdale #cinematographer", "issayikes": "teen wolf!", "britta517": "@mindykaling Moesha, My So-Called Life", "marta_fif": "You definitely need One Tree Hill. ;)", "missaurorable": "One tree hill!!", "jelllapeno": "She’s gotta have it on Netflix- directed by spike lee. Great series.", "elhangrier": "Sex Education on Netflix", "beccaponderosalita": "Taking it back here...but Party of Five, anyone??🙌🏽", "luke.slatts": "Congratulations Mindy!! You’re on 🔥!!!", "lori_alli": "Try to break that thing that teen shows do where they are ambiguous about what grade the characters are in and then they are in 11th grade for like 3 Christmas episodes 😑", "sjbenacquista": "@jspencee bye", "shannonchartrand": "Smallville✨", "ellaalejandra": "@mindykaling on my block, the get down, and the fosters 💕💕💕 all have POC in main roles", "theorangeblonde": "Not a teen classic, but Kim's Convenience by CBC in Canada is AMAZING!", "haley_s_whitney": "Can I make a suggestion that I think could make the show stand out? Most teen shows have some sort of romance centered around them and while romance and relationships are definitely a part of life, I think it would be more interesting to do a show that doesn’t revolve around high school relationships. I know a number of people that never had boyfriends or girlfriends in high school or let alone really wanted to date anyone until they were in college and I think they suffered with just as many teen problems as the ones who were in relationships", "sandwich.day": "@onmyblock is phenomenal! There's so much heart and great writing, and the actors are really gifted at delivering both dramatic and comedic scenes.", "_emily_huddleston_": "ON MY BLOCK so we can chat about season 2 ending😭😭"}