{"sayalirao05": "Omg I’ll probably be perfect for this 😁", "shillyp": "@suruchalas you should send in a video of you doing the Chet.", "itsyogehl": "@yashmitasingh gehl, you're crazy😂", "clacemylace": "please do this again for season two!🥺 i had missed my shot", "kiirawrr": "Guess its too late for me to apply huh", "aarshiyasachdeva": "^", "janvee_g": "This is what I was taking about @priyesh1971", "anshupendoti": "@v4rnika 😭", "varshaa_aa": "Anymore audition anytime soon?? 🥺", "v4rnika": "@anshupendoti I acc got excited", "gbellodobrasil": "@gianihelenabg @gianigomes.ph", "ms_oh_sheila": "I can fake the Indian accent...but I am Indian.", "ce_ww": "@rati_choudhary", "ammi.y": "@bhaaaaaa_07 🔥", "maliniganguly": "@isaacpsmith", "blueneedsmoreclues": "im crying inside", "mrsebwebber": "@sonjadesai @garrettbraukman @daniecoccaro", "sarahrsami": "i would be down but im in nz 💁", "yankasaur": "@anjalikalobo", "ok.nayla": "Someone make a show with a Hispanic lead im all for it", "s413novel": "@mindykaling I submitted for the role , I just wanted to say whether I get casted or not I’m so happy that you took this initiative. I’m MUSLIM and I live in NORTH HOLLYWOOD, I cant even find a freaking talent agent no one would even talk to me like I’m some sort of EBOLA on steroids. For you to ATLEAST give us brownies hopes THAT MEANS THE WORLD. Please don’t change you have a great heart and an awesome vision. In the sea of Goliath I hope you find the David in me mindy 😘🙌🙏", "shalagupta": "@sudikshasingh @marissamistry @priyaparihar", "t.usmani33": "@suff_drummer I want to audition", "blindiangirl": "self tape sent for devi ❤️ thank you so much", "nawaarrr": "The Asian parent side of me is screaming but the me side of me lowkey wants to do this 🥴", "mandys_little_kitchen": "I just submitted 🙏🏽🤞🏽😃", "suthemani": "@mindykaling anyone else hear back yet? I have yet to know how to submit an audition lol. Maybe emails are backlogged?", "garima_s_rathore": "Hi Mindy apart from pictures and bio do you require any selftests as well ?", "aeshnasarkar": "@leahdean you should audition", "denslavin": "@frankydidli The mindy project + Brooklyn nine nine 😍", "pookersandmuffin": "If you ever need a super pale, over weight chick, HMU. Lol.", "nissadarling": "Looking for quotes from women who have sent in emails for auditions!! Please dm me if you would like to participate ❤️❤️", "deepa0_o": "Just submitted my audition. I hope I get considered thank u for the opportunity Mindy 💖", "shivranjana": "I wish I was in LA!", "brenelle": "@shirina17 our time has come Shirin lol", "kirthanakannan": "sent an email pls don’t ghost me", "shannonvarghese": "Hope my submission is enjoyed 😍 Ya, girl sent her info in, y’all ☺️ So excited and appreciative of this opportunity 🔥", "jelum.r": "@pranaliraval our calling", "niru_devkota": "@mindykaling does the main lead, daughter have to have Indian accent? It says South Asian and there are so many countries in South Asia. Does the girl have to be Indian", "kiimdhillon": "@imshreyapatel I was just about to tag you!!! But I saw you’ve done so already.. Good luck ❤", "nayha": "@ns0023", "ksinghalong": "hey Mindy! Just FYI the page through which we have to submit our audition material must be experiencing some tech difficulties bc none of my media files are uploading! Even I tried sending an email to the site and an error came up. Hoping it gets sorted out ASAP 😬", "divyavaman": "self-tape sent for the Kamala Scene :)", "angela.kumar": "This is amazing!!! You make us proud!", "fionagulati": "I am your Devi even if only half Indian😁", "sogy_k": "@mindykaling : Hi Mindy, I did send an email for more information on how to submit but haven’t received anything so far. Please advise. Thanks !", "littlemissrajvi": "Sent in my audition videos! I hope I get it! Even if not, I’m so grateful to audition for your show Mindy. Hopefully we will cross paths in the future with my career. You are definitely one of the women I look up to!☺️", "fangirlaida": "@sapnasmentalbreakdown", "anya.raheja": "Still haven’t gotten a response. Has anyone else?", "laurelbcummings": "@devikabhise", "iranya21": "Woohoo, just submitted my auditions!! 🤞🏼🙏🏼💖", "maryamlchishti": "Just emailed! ☺️", "rachel__vivian": "@mindykaling May I recommend either @zainabdossaji or @ammudinesh54 you will NOT regret it", "gurjotgillxo": "@puneetbhandal_", "neha_at_insta": "Anyone hear back on the first email to request audition details?", "its._.aanya": "I’m so excited to watch this!!!", "cesstrazzera": "Please audition u would be perfect @sajani_patel I love her and u.", "shjeeh_": "Do you an opportunity for male actors too? Like, I really want to do series and stuff but everyone do is grab money from me. I want to pursue more in this career. Please do the needful @mindykaling @netflix_in @netflix 🙏🏻", "sneha.jog": "So excited!", "jyotisingh.official": "The submission I received, lists 23rd April as the submission deadline. But, the video submission link, has 26th April PST as the deadline. Someone please confirm. Thanks.", "rajni_nyctophile": "@mindykaling what’s the submission deadline, 26th April ? Please confirm", "maria_corri": "Super excited submission in!!!", "_stutishah": "if we do end up auditioning, is there a approximate date where if we don’t hear back we assume we didn’t get the part?", "shritash": "did they get back to anyone after you submitted an audition video?", "r.m.lankford": "i love that you are doing open auditions! Keep doing it!! 🤓🥰👏🏻😎", "nathan.lafayette": "@kerenaj", "floordejongdb": "Did heard back from their uploaded audition? I only got an email with how I can audition, and I did, but haven’t heard anything yet, does anyone already knows if they going to the next round or some ?", "riri_shah": "@_radzpatel @pray0sha @_anishaam is this my chance at becoming famous????", "_harleeeen_": "@jasleen_bhatia7 this is our calling", "manish_dnc": "❤️", "priyankaaa.b": "@srijaaa I will be disappointed if you don’t apply", "ssjohal_23": "Make sure u hire the current greatest up and coming actress @jazminesekhon", "jazminesekhon": "Finally an opportunity for south asian women!!!! This is great 😄", "smitaacharya24": "@ashwiti_baraily", "xo_miya7": "My sis would be PERFECT for the first role please choose her 💖her name is Nakita.", "ridhimanagalia": "@gayatriis", "ziyanavasaya": "@ramanfenty !!!!", "lin.da.ali": "I just discovered @sindhuvee and she’s hilarious!!", "mahnurr": "@_n_iya", "bridgetaiello": "@kallllpal YOUUUUUU", "followmytravelsandstyle": "@veesethu 🙌🏽", "tomasmufin": "@shoba_narayan", "istoleurniggah": "Do we send a video of us acting or what.... cause I just sent a video of me where it said “video”", "suhanimardia": "@mindykaling - heyy, I mailed on that email id a week ago, just checking if I can audition if I'm based in Mumbai for the young girl?", "avagruch": "@mlpadman", "shivanidixit": "@jeanettepranin", "supurdupurnupur": "@mindykaling I got a confirmation email but nothing after that. I really want to apply so let me know what to do and whether they will be emailing us again with details", "miramg734": "Hi Mindy. Big fan. You can take the older desi-ben post down because I got the job.", "brookieo": "@jazzeefizzle", "sarahzhara": "Congrats @mindykaling! Can’t wait to be in it. Even if not a main character. I’m always a perfect extra 😉", "rajithavenkateshmd": "@mindykaling any requests for a desi doctor to be playing a desi doctor on tv??", "meghanmags": "@priyaachhetri i see you being famous 💥", "jananiiiv": "YES THIS IS SO COOL! THANK YOU FOR RECOGNIZING MORE DESI ACTORS/ACTRESSES! WE NEED MORE OF THIS! I’m so excited to audition", "missushoper": "@tresvaleras maybe now is your time 😀", "imura_mm": "🌟 @dr.johnyoo 💫🌟💫@luckytimacharms 💫💫💫💫", "sharvy28": "I sent an email almost a week back saying more information to audition . I haven’t heard back . What’s the next step ? @mindykaling", "womensmafia": "@n.i.j.a.2", "kevin__9698": "@jheelmehta_ u perfect actor for sonu", "dhwanirao": "@vfernwehh", "ami__na": "@maryamnaheed why can I imagine you taking a year out of med to do this", "i_am_13_preet": "@parvatim 🎬🎥🎞With your acting and dance experience in south Indian movies this would be a great opportunity for you @mindykaling", "snigdhay": "@sindhuyerramilli", "sindhuyerramilli": "@bunnygunnu321", "meharunnisa10": "@christiangabriel93 👀", "sunniesidhu1": "Hi Mindy, I emailed for info but didn't get a response. Has the deadline passed? Thanks! Happy Easter! 🐣", "__mayapatel__": "Omg @patel.jasmine @lanos3 should I give it a go", "sanpedrochar": "I hope your ass applied @imshreyapatel", "tlslovelove": "@wootwootpripri You could totally do this, beautiful Pri! 😊💕", "mayuribhandariofficial": "Need Bollywood on ice? I’ve got you! ⛸ 😉 💃🏽", "megan.chanddd": "Just emailed! So exited", "tamanna166": "If anyone receives a mail other than the confirmation one, please respond here!", "parvathichandrasekhar": "We have to", "mochaheart1234": "Is there a deadline to submit the application?", "clearyourmindbro": "Yo, you should cast the couple from the episode of Mindy where you went to their house for dinner. The one where you dated an Indian guy and realized you had no Indian friends. I liked that couple from the dinner. Race pyramid LOL", "desimusicgal": "Sent! Fingers crossed 🙏😜", "heysonali": "I emailed but didnt get a reply 😢", "hersheykaparaju": "Literally one of the most wonderful opportunities ever 😭❤️", "arktalent78": "@mindykaling My agent, Sooze Johnson from Grit Talent-Dallas, sent my information to you. Please consider me! 🙌 www.imdb.me/arktalent78 Eeeeek! I can't wait! 😍", "ecoplon": "@navpreetkaurrr @soniakaurrrr", "princesscaty": "If you ever need a petite Guatemalan gal, I’m totes available 😘🙋🏽‍♀️", "poojasminu": "Please include @sindhuvee in on this. She is freaking hilarious!!!", "maanvee.m": "@mindykaling when are the auditions?", "amie_ldn": "@shambondiggity", "_teenaaa": "@mindykaling sent an email. No response😩. Interested!!!!", "gabriellekaurcheema": "BROWN GIRL OPPORTUNITIES", "amina316": "Has anyone heard back??", "didiprakash": "@mindykaling *DMs", "aageorge_95": "Wow it’s finally our time to shine ladies! Jk don’t have an accent!", "ayeshakhan.atl": "so how do you audition for the 15-18 role?? @mindykaling", "av0512": "@sincerelyxjaz", "revb22": "Hello @mindykaling sent an email to the email address provided, how can we submit our video tapes for a sample. Can we just email it to the email address provided?. Thank you and hope to hear from your team.", "rohinib77": "@tlobo @roopamat let’s do it!!!!💕", "santigulla": "@mindykaling - Don’t you think Desi ladies need Desi guys as partner?? 🤔. If there is change, I am more than happy to be part of it.", "xoafridaxo": "Mindy and jordon are awesome “we’ve seen that movie” #representationmatters", "nadialepiere": "what about mixed south asians?", "kiran_df": "Wish I could audition but no accent", "lifewithsuggy": "Stop searching @mindykaling I’m here 😂💁🏽‍♀️🙋🏽‍♀️", "idream_ilove": "Hello, i emailed for audition details about three day ago however have not received any to date. Thanks", "irm_isb": "Me!! 😁 email sent!", "neemaapatel": "Yay!!! Love this 💕", "evakuru": "Should we have gotten an email back by now?", "natashapancholikhatod": "Please consider me, I’ve emailed you my resume. Natashaworld.com, I’m sag/afra thanks!!!", "gulrukh.lindsay": "@mehermistry", "mansi.xv": "Waiting for the email reply. 👀", "self.talks__": "@mindykaling emailed last week asking for more information but haven’t yet gotten a response!!!! Are auditions no longer open?!", "nid.hi.shenoy": "i mean you know, i could just get a pair of stilettos and dress like my mom. or i could audition for the 15 year old part. too bad i don’t live in LA :(", "millyraichelthomas": "Thank you for this opportunity. I have submitted. I have an Indian accent. But I have been rejected saying my accent was not Indian enough for a project. :-( Are you looking for an Indian accent from any particular region?", "its_taranb": "@cindy_om15 🤷🏻‍♀️", "ceydaert": "@simonmathew @kacevin @ce.ren.a.tes shall we try?", "the.petite.doll": "I sent an email @mindykaling 😸", "madhumithaxoxo": "Listen @mindykaling I have an Indian accent and look like you go the point of having random people come up and ask me if I were you! Like seriously, what more do you need? And i have emailed you my pictures as well:)", "ranessatheyakaraja": "Dropped an email but haven't received more information on how and what materials are needed to submit. Thank you :)", "nailasami93": "@refrijarator 😘", "aishaq_q": "@munareclipse", "luckenumber3": "@mindykaling I'm trying to get information on how my daughter can submit or audition for the 15-18 yr old role. She sent an email inquiring about how to submit but hasn't heard anything. Could you provide any information on what we can do? Should I send headshots in the email? Thank you!😊 🙏", "nikki.albert.73": "@mindykaling I emailed as soon as I saw the post . I haven’t heard back on how to submit the profile . Please reply", "_.laaah._": "♥️ byvi", "farifah": "@mindykaling we haven't heard back from the emails..,. what's the update???", "theblasiankidd": "@mz_bunton", "ananya_yogi": "Desi girl 15-18 gotchu but honestly this is so freakin cool to see more diversity steamrolling through Hollywood😭👏🏽", "shwetadoshiofficial": "INDIAN Actor with INDIAN accent - that’s me ! Just emailed you my details Mindy🤗", "lifeofmollika": "Sent and oh my god I’m so nervous", "artseemom": "Calmly waiting to hear back 🧘🏽‍♀️ and cant wait to meet you 🙏🏽", "momagertoevan": "Sounds like its gonna be great! Cant wait", "soumyabysanii": "@na.yasingh could you add me to the group chat??", "niaacharya": "what things do we email ?", "olesharathore": "@harpmalhi", "44.emh.44": "What about mixed South Asians? 😬", "dianedehn": "@mindykaling Your stand in from @latenightmovie @dancingreena", "niru.ck": "@kartasian", "iitaranii": "@iisuperwomanii", "pocketfullofme": "Uhhh, @mya.rajah — #obvi! 👌🏾😍", "elinede.c": "@louisegabriellex wordt actrice !!!", "dr_sabs_": "@arjmoney should I submit an app", "briana_arzate": "@rs61988 Hollywood is calling your name 😘", "sri.rac.ha": "oh my gosh! that’s me! i’ll be sending you an email right now <3", "atikab_": "Can we audition without any formal training...?😋", "slomofosho": "@tiffo_11", "stephfunnyyyyy": "@lylyru", "roobtuube": "@msmickeymouse you see this? Interested?", "sudha.parameswaran": "@jo.vita.h", "softerthankashmir": "@hafsub", "ssssmggggg": "No indo-Canadian males. I’m mad funny as hell too", "dae_thebae": "So how do we audition? Do we just email them and they’ll send back information?", "adhudwal": "I emailed but heard no instructions yet for auditions. Do we just wait?!?", "kamilahhuq": "@_.hannahpeterson", "_.hannahpeterson": "do u need any smaller roll cast members who are not South Asian?", "maitreyiramakrishnan\nVerified": "Verified", "azeeeeenahh": "@aaliyah.ih @shamia_irshana @aneeshausman @shayanne_usman @sheenarsh @intoxifyyy @juliehirji", "morningbright": "@taniarashid", "vv3": "@srinidhipr can you try out for main lead? @shyam_ala @jayasavita @lila.surya @rasikasks @malvicar @vikvis", "helloitkells": "@dwights2nd2ndlife", "nikitavenugopal": "Get an indian accent, drop out of med school, and audition to be the cousin. @sanjanav18", "cosmicflamee": "Ily yay", "thegreatmoe": "Submitting this week! 💗 @mindykaling", "sbabb2000": "Mindy, I emailed a few days ago and still no word back. Is this normal? @mindykaling I would love nothing more than to audition! ♥️", "mahoganye_glow": "Please check out my friend @mya.rajah She would be perfect for this! Shes super sweet, outgoing and funny @mindykaling", "tanzilaaa": "This is an amazing opportunity!!", "hot_cheese_surprise": "Can I audition for mid 30s 4'11 inch white girls? Willing to spray tan. @frostedjules this could be your big break!", "zarahmalikh": "hi hello i would very much like to audition for the 15-18 yr old, literally wrote about u in my college admissions essay, aspiring actress, will *die* if this dream comes true", "nishajohny": "Hey @mindykaling ! Do you know when we can expect a reply from the email address provided? Would love to send you my submission as soon as you need it! ❤️ sorry, I’m just so excited lol!", "comolaflor_123": "@casxvii", "lovebabeee67": "So dope!!!!!!! Wish more film makers would do this ❤️", "photographymoonchild": "Does this work internationally ?", "olivcampbell": "@heyitsnusha bruuuuuh", "tishnii": "@frannncakes I feel like this is my chance to quit law school and pursue an acting career because I still look 14 even tho I’m 26", "mitranisha": "@aish_balan96 you should audition 😂", "ambreen418": "@ailz930 my destiny is calling", "karishhmatic": "I wish this was in NYC! I would've loved to be a part of this project, ultimately bringing more representation to television.", "anishadoshi93": "@sejal.doshi go for this", "xxxanishaxxx": "@aromatomato ugh I wish I didn’t look as pale and could perfect an Indian accent... but @mindykaling I’d love to play a half Indian half Caucasian in your show!", "samyuktha_c": "@mindykaling I would love to audition for the role of the South Asian American female but I would be 14 years of age when the series shooting starts. Should I still audition?", "ranimari_": "@maharajgita we should apply !! Mindy and Morgan duo", "supriyaa_r": "@diyaapars Omg you have to do this!", "kaansingha": "@sachikamehra career change?", "ssekhon": "@aman_sekhon1", "_siyaxkumar_": "can’t wait to hear back :) ❤️", "akshls": "@elizabethgracekhan u should do this", "joedwyer_": "@pencil_peacelovebeer omg go for it ✊", "lopa_luvzreels": "Please cast @sobhitad from Made In Heaven on @primevideoin ...she is amazing.", "sabbbyyy": "@natnazir lets do it", "_______pesh": "@itshersmile 👌🏼", "stylebymemory": "Hmm could I pass for 18?!?!", "hazybabyface": "I sent my email 🤗❤️", "abcdyogi": "Sharing ASAP even though we’re definitely late to the repost game! ✊🏾❤️", "bb.katx": "Let’s goooo👏🏾🤩", "namatwal": "@dgrewal_", "gabbsramirez": "@jameelajamilofficial 🙌", "laurenprasanna": "Sent an email!!🥰", "farahlynormal": "@mansi_senpai @mansi_senpai @mansi_senpai", "sukhmani_ice": "@janya_kaur", "anishaghose": "@diyaapars", "preason": "Can’t wait to watch!", "aysha217": "@hashmiarnab", "stacy_the_owlenthusiast": "@mlpadman", "fifileroux": "Damn, no “Overweight purple haired ingenue with no acting experience”?! Ugh. Foiled again.", "husaynm": "@aauplish hop to it, please. no time to waste. worry about the visa later.", "heezymartinez": "@saps1602 🔥", "ms.tianamischelle": "welp...no chance", "anniebernie": "@sureni duh you", "josedmontilla_": "Tenemos que ver esto cuando se estrene @marigabyeah @ricardos101", "erikabrett": "This is so cool!! There is a lot of talent out there. I hope you find the perfect fit 👌🏼", "_conquista": "Amazingg!! 🙌❤️", "athulya.does": "@ansu.xo why not eh?", "saru.datta": "@chittum can I do this please?", "jenniferhabbotoma": "What if I am an abcd?", "andrealjohnsonn": "Are you guys looking for extra people like friends or close neighbors for the younger female? If so I would love to audition!", "aditi1810": "@nitty54321", "payal_bhakta": "Omg I’m going to get this 👀🙋🏽‍♀️✨", "vdrslilprincess": "@prinssleya damn!! If only I still lived out there!! I could have faked an accent!", "alisha1205": "Indian but British? 🙋🏽‍♀️", "nasrimaktal": "Please Cast @priya_manda she’s very talented", "serenapuri": "I definitely have the Indian Mom thing down- and of course can be wery wery Indian", "renuked": "@kalpitachakote", "sampsk": "@shivi_ags why don’t we live in LA :(", "stancalvin": "@sanaxxvii go for it!!", "nehaajoshi": "@sandhya_murugan let’s audition omg", "anjanaregialex": "Sadly i live in Canada😟", "audball_audrey": "@codyeaglegigold saw “Asian” & got super pumped..I’m the wrong kind lol", "sara_j_sparks": "@kryschand !!!!!", "justine.bal23": "so im 28, south asian Canadian and I can do a real nice indian accent....i can still audition right @mindykaling 🤷🏽‍♀️", "ka.v.ya": "@varndas", "deepalikini": "@richa_deshpande @ayesha2992", "spookyboooshra": "I emailed the day I read this 😭", "choto_alo": "Btw I'd like to play so much ❤️ and i cannot wait to see this serie 😍", "holleebecerra": "So cool!", "dreagirl321": "does the character need a best friend? Or just a friend? Because I would looovveee to audition!", "karenmehl": "@marzi.alam maybe this will keep you in new work", "devikhanns": "@diyaapars THIS IS FOR YOU!!!!", "theweddingadventures": "@mindykaling What do we email in?", "mandinokaoi": "Can’t wait to see this!! Also if you’re casting a chubby 30 something white cat lady and really want someone with no acting experience or talent, I’m your gal!", "hamsabotanicals": "How about a South Asian woman in her mid 50s who looks like she’s in her mid 40 s", "byashwanie": "Oh this is all me 🤩💖", "ishleen_isha": "@ryca_27 try your luck 😉", "my_sharona1222": "@leahbee_xo I don't know if you have any Indian friends but this is kinda cool!", "maxg3": "@meggyfroggy go be mid-40s", "priyayasminegill": "@rhiannaj18 @rhiannaj18 @rhiannaj18 ♥️❤️", "nidhi_lipuff": "Yaaaaay", "raktima2015": "What's an \"Indian\" accent, Mindy? 🙄", "amazing_geet12": "How to submit !?", "grrracel": "@payalthak119", "__mikaelaj": "I wish I could be apart of this.", "brookeharter": "@belle.harter should I", "ms.jazzk": "@shahlaine", "lala_mala": "emailed! ❣️❣️", "a_creedy": "@feresha13 🙏🙏", "tashi_mango": "@brinaleena post PhD career change?", "lord_carl_of_soona": "@diyaapars you must do this", "zaalchoksi8": "@diyaapars do it chotte you’ll be great", "tanialasagna28": "@mannie0325 dude!!! My girl Mindy Kaling is looking for stars ⭐️ to audition for her new show! Doooo it! And tell your sisters too!", "neha_saggi": "i wish i could act @somya2703", "ccasilang": "@bonniesingh59 umm girl! You do a killer Indian accent. This could be your side Hussle for realzzzz 🤩🤩 #astarisborn", "delleldellel": "@sihem_tmr hahaha", "aditi.kanti": "@mindykaling, emailed about submission, but no response 😭", "mal.hurst": "@iamyams I mean your already play Kelly on the stage sooooooo", "sharonasmile": "Das cool", "dkkorwani": "@mindykaling can I play the sibling 😋", "smalldog67": "@elinachristino or @linabean726 go for it!!!", "haider_abbas": "@hinaabinaa @smokethat_khush @saeeda.abbas", "sophierina_": "@anncytwinkle please do this 💕", "tcvps": "Oh I saw Asian and was like hm I heard my name but then I saw south Asian im still excited for this project 💘", "tirazab": "@rheabolarphotography @tanvi_kat OKAY ready?!", "yandleful": "@dbahal", "jaq_hamer": "@justrekhathings you best be doing this! Who needs to be a lawyer?", "simini_sim_sim": "If only I could go over to audition 😩", "bron2402": "@mariadelreal4 can you do an Indian accent?! 😂😁", "sihem_tmr": "@delleldellel it's for you !!!", "_ab.c2s.991_": "@mindykaling 😂 can be older to play younger. Every Bollywood movie. We have good genes! Also, I feel like we need to shed some light on West Indian culture, we are the easily forgotten unsung heroes of the brown community.", "melanietavel": "We don’t fit the criteria but we could try 😭❤️ @shanda_miller94", "xo.sheniyah.xo": "Hire #SakshiTanwar for South Asian in 40's ❤️❤️❤️ she is perfect", "rinki_suri": "@sanzi_7865 oh I wish. That would be a dream!!!!", "taraabey": "@jeffabeys I’m going thank you so much", "baileycolors": "@anishacheema", "beeleecouleurs": "@anishacheema", "becolourproductions": "@anishacheema", "willabyphotos": "@anishacheema", "scilla_85": "@mindykaling pick our friend @tikalucci”", "aleenapaulson": "@niapaulson wow look me", "sarahbcomfy": "@kausartheperson !!!!", "jincycjose": "@nehamat5 go for it!", "jimcones": "Omg I was just watching reruns of the mindy project on Netflix and thinking I wish there was another show like this coming out 🙌 wow this manifestation thing really works", "_shadesofshade_": "@gabbyshaikh", "kaur_rajveer": "I sent an email but didn’t get any further info about how to submit an application.", "sanzi_7865": "@rinki_suri- you and Mindy would make a dream team!!!", "actually__ashleigh": "I am so excited for this! 🤩", "yamfromsham": "@zahrasuranii", "amanverma9388": "Only if I were a female....", "flyingchristine": "@rishmal you could be famous!", "shane.kumar.52": "@esha.kumar0226", "iamyamimartinez": "@bertoborroto ur friend that is Asian-ish", "rosatic1": "@simpleserena", "clairemarisol_": "Go ladies ✨✨", "haileypipkins": "Only if", "amrah.ahamed": "@vaidehi1496", "aakriti_chaturvedi": "I won’t disappoint you!", "nikkiefer": "@mrs_monbro your time to shine lol", "thaniapeace": "That’s amazing that you posted this and gave your followers the opportunity to audition!", "grayhousead": "Can I audition for the 18 year old Asian even though I’m 31 and white? Nah? 😒", "amiti.pitigala": "I am so excited for this!", "shakegrrl2": "@thegreglindsay I think you can pull off \"Asian female 20's\" !!!", "koreankreations": "@nehap915", "sbc_bellas": "I got so excited for a second. 😭😭😭", "arachelt90": "😍😍😍", "nidaneedaeat": "Welp. Time to move to LA....", "missarks89": "@cleohandler @jessicapreddy @christinakholmes guys!!!!!!!!!!!!!!!", "cbognet": "@nilmi_s you would be amazing!!!!!", "aarani.sundaram": "@melanie_inoka @jalps1989 forget the patil twins, this will be our breakthrough roles", "paisleyjane_": "OMG YESS", "j.tenpa": "South Asians are a diverse group of people. Please be more specific.", "ngandra": "HIRE ME I WAS BORN FOR THIS", "somemorecheetos": "@manishanezhad @sanchiarora pls", "d.a.m_david": "@karishmathomas this would be fun!!!", "tabiyonce": "@awaalls aww", "augustoz": "@aikh0 ?", "meghanyani": "@atishappatel ITS HAPPENING", "aliceinglen": "Go Mindy!!!💜", "sravanthiayyagari": "@kitanava", "juju_schrader_": "I would, but I'm not from anywhere in south Asia. Although, I do look like it🤔 hmm, I'll see", "daniellemarkovinovic": "Why was I born white 😭😭😭", "srish.tea": "@kritisarin", "pikachyou": "@bcuzwehappy_rdas @shellysaini1222 @renukamram @manasaamenaza damn y'all should just audition for this and quit med school if you get your big break", "mellie364": "#2 😀😀", "_zee_el_": "So @nis_nis_xoxo will do 15 year old, @samanzaar 20 year old and I will be the 40 year old. Deal? Cool.", "someramuzaffar": "Can a 32 year old pose as a 40 something. Come on grays...i need you to grow in abundance. Now's your time to shine", "rishmagovani": "@shinangovani my dream!", "wajiha23": "@shally625", "dontap": "Is there a part for a bitter, sassy old queen?", "kennedyqsimpson": "Amazing. Congratulations Mindy, I can't wait to watch 😍😍😍", "preetigogulapati": "@anushagogulapati bujji you should apply for this!!", "ac_clementine": "@harbreezy 👏🏻 let’s go gurl!", "adriannalall": "@21_sampath @zoemonster91 @faithiemichael @faith_michael @sarabrozo should I drop out of grad school? 🤔", "jankilicious": "@itssweatur come audition w me!!! We all know you have the best fob accent 🕺🏽", "kcelle": "@supersteff", "piqturesque": "Hi @mindykaling If you’re ever looking for ~college aged African/African American girl hit me up🤙! All the luck with casting♥️🌌", "antsinmyeyesjulie": "This is awesome 🙌🏻🔥", "kcoutinh0": "This could be my big break @sammilanger", "edmrainrunner": "@inasmuch54 get your accent ready.", "basil_001": "Eek. Exciting!!!!", "mysixinthemix": "@manijay do it anyway!!!!! Do it do it do it", "sheeeevs": "Young mindy", "gargiwadodkar": "Can’t wait!", "love_n_grow": "@swatiboggi I'll do her headshots tomorrow if she needs updated ones. Lol", "pershall.annie": "I'm so excited to see what you come out with next!", "quenby.lin": "This is fantastic. It's so good of you to do this", "geetsjourney": "@myaspace @thurka @vinsia @ginasiva", "elleveritywealth": "@lipaislam 🤔", "kairavifilms": "HECK YEAH! I love that opportunities like these are being created for brown girls! So exciting!!!! 👏🏽 Definitely auditioning for this! 🙌🏽🙋🏽‍♀️💃🏽", "fijian.girl": "Ugh if only i had an indian accent 😭", "shaanr22": "@_riyahramji ... feel like you could do this 😂", "vishalya.k": "@roshni.gupta can we audition 😂", "kmcg800": "@aditi1810", "mjoseph91": "@mari_j89 @divyiaj90", "sarahmousel": "@mlpadman please audition for this!", "ilovesummer_xo": "@aliyathindh", "frubadub": "@mindykaling how about east asian? Maybe father was east asian with south asian mom???😉😂", "mrs.hause": "@mindykaling pick my friend @tikalucci 🔥🔥🔥🔥!!!!!!!", "nicole.conn08": "@mindykaling can I be a southeast Asian American female?", "mike.mccasland": "@adamlikesmuffins do ya reckon I should apple for all three, it’s clearly been working really well lately when I put in FOR ALL THREE", "lakshmi.mishra": "Loooove this. Do you need a 9 year old? 😁", "tearsofchandramukhi": "So uhhhhh...how much experience y’all looking for... 👀 like...is just anyone able to audition", "ambika.kumaran": "@willthomasp", "singhisking239": "@rebeccasinghasong", "suziclerules": "Hope you get your casting done soon. We need your brilliant and heartfelt comedic timing!!", "melisme17": "@pragiie wanna be in a movie ? 😂", "maurisa_b": "@mya.rajah you would be perfect!", "runa_ks_": "I am of East Indian descent but live in Trinidad; I can do a really really excellent Indian accent though. Can I try? Or are you only casting for the US?", "chelly0920": "@saistar_1 your calling", "phatgirlchronicles999": "The disclaimer is a bit of an oxymoron. Lol Excited to see your next show. Good luck to the applicants. I can't apply, LA is filled with white women in their 40s LoL. But are they phat like me?--- mmmmm probably not. So if you need a phat chick I'm on it!!! Lol", "p.wx": "@geets.t fk tax", "cillababyyyyy": "@elaxare, you can so do this 😂", "_nas_t_nas_": "If ever you’re looking for a woman with a real Caribbean accent, I can audition for that ❤️", "eranditrevino": "Brilliant!", "eslizabethmaria": "@b.parambath if only there were male roles", "sangstha": "I CANT WAIT OMG!!!!", "silviaalowais": "Please cast a male ! My son would be perfect 💙", "melon.ily.oi": "AMAZING!!!! ❤️👏", "bubbajoy": "@jackieloucks saw this and thought of you ☺️", "aliyaall": "@shahista_whooley yesss!! Try!! You can also be the 20 year old with an accent", "gargayushi211": "Hey I am an independent single mother 30 yrs old, does anyhow my profile suits to your requirements? 😊😊", "ruchi_b12": "@nikkitachadha you would be awesome!", "acrobaticfanatic": "@saltyjunglecub 😉", "dr_s_diva": "@anudeepa.k", "la_petite_merlin": "@mindykaling Hi! I sent an email for the role of the 15-18 yr old. Hope to hear from you! ☺️💕🌞", "jenschneier": "@shellypenumalli do it!", "mihkldude": "@sarvanieloheimo", "sabachugs": "@mahanooriiii @komilster", "shmetta": "I SUBMITTED ✨", "royalecassie": "Aren't you the best !love you mindy..so inspirational for us all", "fortheloveoflays": "If only I wasn’t having a baby end of July 😂", "nicpud": "@jakobruruku", "rav.kaurrrr": "dudeeee!!!! as if it’s not open for people in aus tho omg 😭 @haarjott__ @jazjott", "nicolenetto25": "Hey Mindy - I sent through an email to kalingfishercasting@gmail.com, but I haven’t received a response as yet", "kiyara.mw": "@shiannranabahu i hope you’re auditioning 🤩", "v_ax": "@keennanana @ishah011 @dkshah92 @dhvanishahh @charmee05 @bharg08 y’all are actors right?", "sanjanabarua": "I wish I could audition for this! But I live in India ❤️😭😭", "sholehr": "@shevahrezaee me", "sr.isaacnewton": "that’s so exciting!", "dmaq1": "@soybeandip", "idahleen": "@shefalishahofficial is so amazing in Delhi Crime 🌟❤️ Needs to audition!", "raza.z.ghani": "@azizansari we have another accent situation...", "sarahmariyayayayaya": "I love that this has a gmail account for the contact!!", "ishrajesh": "This is so incredible. As a brown teenager aspiring to be an actor, I have very little options for role models but an entire cast on a show really gives us a huge representation for the first time! Couldn’t be prouder!!! ❤️", "chaiorlatte": "@aabrohi omg can you do this pls 😂", "i_am_julialee": "@ramnik2802 in case you know people", "sudeepinpapiii": "I wish @swayth", "tannylh": "@arafxhossain should I do it, I do a fab Indian accent.", "niyomiw": "@sonalii_f so cool!!", "meghanabe": "Has anyone actually gotten a response from this?", "poonamk1": "@njchand @ramosdeepa", "iamredlantern": "@mindykaling @wwe_asuka", "pranjal_instalove": "@siddharth_0608", "ankita_ghai": "@melthachankary", "rishavvari": "@michellesk6 let’s go", "darbyqm": "@2janez_ should we go ??", "showmethemanee": "@tulsisukhadia99 GIRL WE SHOULD AUDITION LOL!!!!!", "alvin_a_p": "anything for desi boys? 🤷🏾‍♂️🙆🏾‍♂️ @mindykaling", "brittneykimberlyrose": "@shannahallenn I wish we were south Asian:( lol", "luxeyasha": "omg @anguyen._", "sonalm07": "@shan_kap ❤️", "rayne__bow5": "Yes!!!!😍😍😍😍", "kanizzc": "going ✈️ Hollywood", "zaighamzakkhan": "@ome - go for it !", "emily__higgins": "@sunishka", "sumiayasmin": "Wow amazing!", "fromgenevieve": "@sineadpersuade I’m sure you’ve seen this already. Idk if you feel comfortable playing a teen or if you can do an Indian accent for the 20s role but YAY for a South Asian American role. 😍", "conamorraquel": "Yas to this diversity. We love ya Mindy!", "jenschumacher00": "Is this for champions? I hope there is another season", "jessejunck": "Want to watch this", "shivanijmodi": "@ramyaaa23 @kavyadagli ✌️ gonna go audition", "alexabolesta": "😮 Ohhhh exciting!!! 💕❤️ can’t wait to see what this is all about.", "celestial_dandelion": "I would love to audition..but I live in India 🙃", "sarahchells": "@bettychelli !!!!", "treasurrrrre": "What about a early 30s ethnically ambiguous female?!", "miraaptl": "@neha__petal our hometown’s calling us back 😂", "_thecornerstudio_": "@maduiyer_", "jasmineywlee": "@jessikabaroi pls pls pls 🙏🙏 do itttt", "meganraitano": "@biaaanka ⬆️", "laurenh239": "How about a mid 30’s chubby boss ass bitch? @mindykaling", "iamyuvrajkalsi": "A friend guided me to your post. Would love to submit my profile 😊", "sonnykumarofficial": "@smaky8 @buffluv - credit goes to moi!!!", "ohnoway": "@hannahsuria ☺️", "perla.hgv": "@mindykaling Do any of them need a loyal, sassy, awesome Mexican friend from Wisonsin in their late 20's that can pass for being in her early 20's? 🇲🇽🌹 lmk 🥰😉", "_drunken_noodle_": "Hello, I m interested!! Have emailed already ! Waiting for the information on audition 😊", "misterjunne": "😭beautiful", "rachaeldutta": "@mindykaling 🙌🏻 in case you are looking for South Asian kids", "sim__simma__": "@mindykaling can I submit my mom for this ? @smitagupta1964", "officialagj": "@mindykaling if you are looking for south asian kids for the show, i have 3 in the industry and we are in LA.", "d_mdcb_conc": "@bella_lucena", "tiinkuc": "@newyorksita !!", "khila.i": "@brahmikha.anchala DID u send!??", "tanviajinkya": "@aparnaravindran time to shine hehe", "sheenanigans2": "@sheebsalam I emailed them for more info. You do it too! We could be sisters on this show!🙌🏽", "manishajassal": "😂🤔 @sidrasubzwari @ramshatariqq @sonamthind I mean 🤷🏽‍♀️", "jambamonika": "@jasmeen_official", "darshsaraf": "@saarahkunaseelan", "mahahanaseer": "@_nedabokhari", "caitfrett31": "@malbal342 it’s time to quit and do this!", "mollyle5": "@roops712", "tulsiepatel": "@kanku24", "_mrs.ark_": "@mahamodi @hafsashoaib LOL", "manuksa5": "@mindykaling 😊🔥👏🏾💪🏽😍 South Asian representation in Hollywood ❤️", "jasminne_tea": "😭😭 I wish more people did open casting, i would love to play a Vietnamese person's role...if I had the talent. Love the inclusion though, glad to see an actress of color pressing to cast actual people of color, even giving chances to other people who are not yet successful actors, you are doing great things @mindykaling 💞💞", "fillrizzo": "Why doesn’t anyone ever need a weird 58 yo dude?", "steffieselfie": "@diaryofatamilgirl please do this!!!", "cassandrarita": "@mindykaling so awesome you’re casting like this! There is so much talent out there. Thank you for sharing opportunities ❤️", "canonlybemyself": "What about a male that looks indian ?", "adya_teresa": "Do half desis qualify??? @mindykaling", "chasss.j": "I wish I could audition 😭❤️ I’m so excited though!", "nehabhura": "@wizard_of_azz1 @sahmed71 omg !!!!!!!!", "bawlisi": "😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭", "tanzeenaa": "@irahili next stop L.A.?", "thepyruk": "Let me know if you need a desi guy! #mefirst", "r.mvya": "Can’t wait to do this with u @krishuuu", "ohmygodthebees": "What if I'm a Mexican-American thirty-something-year-old who lives out of state and can't act, but I love you? Can I apply?? 🤣💜", "arshiee8888": "@nooratwal17", "chris.sergi": "@easyrepost", "brittany.farias": "To bad I am Mexican/America would love to audition", "balmeett": "@harleen__toor @goob_toor", "actorarya": "I APPLIED! IM SO EXCITED!!!", "lexcaliber69": "@chriselleacts", "reshmasukdhoe": "@mindykaling if you ever like looking for a South Asian with a South African English accent, look this way, I’m a HUGE fan of yours!! I think you are amazing!! You ROCK Girl!!", "eveie25": "Mindy amkey niba, ami 45ish kintu Bangladeshi. Ami zanina amar kono accent asey kina. But jibonta ato kothin, famous hoiley bolboney. 😁 ty for writing for us desi girls:)", "lenoregenoveseperez": "Thank you @mindykaling for making your cast call so available on social media! I hope every gets their #dreamcometrue #babysittingnanie #retirement", "profanicole": "@penguinscanreallyfly Have anyone in mind?", "ricecrackerbeebe": "Can’t wait for it to come out on Netflix. A long time from now.", "aliraemctuzz": "@rn33ra You should get on this!!!!", "alittlebit.alexis": "Is they’re not a role for s funny chubby Latina", "hiraahx": "@merder543 ugh so good 😭", "sajo127": "How about a 33 year old white lady with no experience? Also, I can't adhere to any kind of shooting schedule. 😉", "danny.bitterwater": "Can I be like a Native American sidekick?", "insh.a": "Love this! #representation", "nm171717": "@mindykaling I love u and I admire you a lot being an Indian myself. However, I was sad to see your post about auditions looking for Indians “with an Indian accent” I feel as tho that is stereotypical. There are many Indians out there like myself who do not have an accent, but embrace our culture. You are also one of them. Indians already have a lot of stereotypes attached to them, not that some aren’t true, but I feel as tho you being in such a high position should embrace all of us and let us all audition despite whether we have that stereotypical “accent” or not. #letusallaudition", "shlay77": "@mlpadman", "egien76": "I’m going to fwd this to #bikashroy ‘s #granddaughter for this role ! 🤞🏽@shahfamilyskates", "alidavocalstudio": "@iampricillam", "asap.sofi": "@rainamuth @sabinahyder @hinotino @bismanaqvi", "hamsathamma": "@mindykaling wait i’m 13 can i still do it???", "gabriellebakes": "@megmegbailey", "saxena_saanchi": "@thesherlord why don't you head over", "ahhreebah": "@summywums get. It.", "doreenmatz8": "@prenaparikhshah", "taylorr.coffmann": "@madimcwhorter !!!!!!!", "danielle_schuyler": "@siyopa @ksypatel Get it ladies. 🔥👑👏", "simijohn": "Only if I lived in LA! I literally have told my hubby that I wish I could play your cousin 🤗🤣❤️", "shainas1403": "😍", "sophiarasul": "@urbollywooddiva 🤗", "riccardolucci_": "@mindykaling please pick @tikalucci to be in your show!!! Even looks like you", "iamstasiya": "@sheebsalam oh girl", "iamkyriaki": "This is AMAZING. I’m so glad you’re doing this. 👍🏽", "muco905": "Pick @tikalucci !!!!!!!", "knifarious": "@aleya.mp4", "mitisippi": "@make.it.renu @make.it.renu @make.it.renu", "davidofborg": "So happy!!", "the.dancing.nana": "You should be looking for a nana who can dance also! #dancingnana #tushpush #danceislife #musicislife", "sassygurlsabrina": "Oh I need to be on your show!", "angela.rea7": "@mindykaling pick @tikalucci she’s amazing", "emm_aisvan": "@anishacheema pls", "ahhh_saranyaaaa": "@madhushargh 😂", "rozana.banana": "@mindykaling pick our friend @tikalucci", "verbiee": "@shoba_narayan 😍", "emma.cherris": "@anishacheema is an amazing actress and succeeds at everything put in front of her!!!", "poppyjla": "Alright, now!", "phannny_pack": "Amazing @mindykaling Can’t wait to see this.......must pick @tikalucci she was born to play a South Asian female with INDIAN ACCENT 😂😘❤️🙌", "adilger06": "@alieechan", "raf.inda": "Love you @mindykaling...pick @tikalucci she is your doppelganger!!! ❤️", "vickram51": "@ds_907 big break", "architagolwala": "@supurdupurnupur GIRL!!!", "_khadija_a_": "@apoorvavarma.design", "crystaldhanraj": "🔥🔥", "akdesouza": "@anishacheema this role was made for you", "texasred71": "How about a 40 something Texan with a thick Southern accent? 🤔🤣", "ashlymary": "@teresapatel", "parveen.mehra55": "Im an experienced south Asian actress learned from saroj Khan from Bombay", "asarod_": "I am a 18 year old white male does that count as a south asian 40 year old", "mailveeka": "@bigfatbood this is so flipping amazing", "jaycee_ontheair": "@leenavyass Tell your sister!", "aestheticbyflo": "@siam_twinies APPLY!", "lovethya": "@meerapuvi do it do it", "vikraamvirdi": "@mindykaling pick @tikalucci she’ll do an amazing job!!", "neen146": "Can it be a fake Indian accent", "champaqne.mami": "Omg id totally audition if i wasnt canadian 😭", "susieanywhere": "@divyan2 you belong on TV!", "keshialall": "@lifeby.jazz hmmm - might be a good shift in career; Stage Manager - Digital Program Manager - Mini Mindy Kaling 🙌 Aligned?", "divvko": "@mindykaling thanks for putting this up here!! @aaheree let’s!!", "kro.sprinkles": "🙌🏼♥️🙌🏼", "revwrenorg": "Cannot wait to watch whatever you’re producing!", "katejensen_28": "@umaghelani", "janineleeanne": "@mindykaling pick our friend @tikalucci !!", "alessandra_m___": "@mindykaling pick @tikalucci! She's perfect for this roll! You won't be disappointed, plus she's already emailed you 😘 @tikalucci 🙌🏼🙌🏼🙌🏼", "im.perfectly.twitta": "Wish more castings were posted like this", "thewannabeactivist": "@nishabalsara 💕", "rgar89": "@mahtarou hey Desi ladies! Lol", "laura_zapata": "@reshmago 🙌🏾", "sarakwatson14": "@mindykaling me!!!", "newyorksita": "Seen this yet? @lithu_m", "tristahelen": "Damn once again I am finding myself wanting to be Asian 😂😭", "rjmomma110": "@paulyne_wei", "kparpar": "@mindykaling auditions should be held in Boston!! I’d love to try out!", "salsakhan": "@vishalisavalia let’s do it", "tikalucci": "PICK ME PICK ME! 🙋🏽‍♀️🙋🏽‍♀️Emailed! I’m a 34 year old south Asian girl! @mindykaling", "snorfflez": "@chashmishdiaries know anyone that would be interested?", "mrs0330moreno": "@meenalchampaneri @mrsortiz29", "xojjxojj": "@tammykins7 omg let's audition", "mithula_": "@1m_living go get em sista💋", "erinjmann": "@zeelio don’t forget me when you’re famous 😘🤷🏻‍♀️", "jayna_p": "@saejalo let’s auditions! 🙌", "jinleetoh": "❤️❤️❤️❤️❤️❤️", "prradha": "@_ektaa @siricheems is she looking for me 😭😭", "teachrestrepeat": "@iamstasiya any friends?", "pura9": "@pnksrpua I know you are not the stage and camera kind but this is meant for us! I mean I have the South Indian mom handbook down. I do Bollywood thumkas, my taunts rhyme and I am up with the latest goss. Want to try?🤷‍♀️", "arielle.lyons": "Does she have a white best friend?", "unlevinedbreadsticks": "@akulks 👀👀👀", "dbthphoto": "@hbhatti19 OMY you'd be great in this", "priya_unni23": "I can do Indian accent 😎👍👏🙌🏼", "instafsana": "@rahnumab my childhood dreams of being on disney channel are reemerging 😭", "maovang18": "@divah.hustle", "boblemz": "@browngirllifts !!! @mindykaling Nav would be perfect!", "beckygotmurrayed": "@kaylaalewel", "gretavalenti": "@tatumdumont look at this casting.", "fariaquazi": "@heed75 @rrhoq", "dritadee": "@joannajohnsnow but are you going to this and can I be your stage mom......🤷‍♀️", "seajellyc": "@hiya.banerjee EXCUSE ME", "prabjotsidhu": "@gurjotsidhuu", "thicccc.mama": "@jessiikat 👀👀👀👀", "dhipisrinivasan": "@monaz_engineer I could easily pull off as a high schooler lmao", "oonickelsoo": "@hayleyjadejones", "jaizee": "@anishamdatta", "nafiahansari": "@yasminsubair", "martinacooper86": "@mindykaling you mentioned South Asian American, does than mean Sri Lankans are welcome to audition as well? 😃🙂", "bryvent": "@sarahjkick", "btsfanbasewannabee": "this is amazing!!! please consider writing some LGBT desi characters as well!!!", "m.mirza": "Meeeeeeee & @__azka obvs", "surelabasu": "❤️❤️❤️", "amylive": "@suswana_sohinee assuming you’ve already seen this 😘", "safyhallanfarah": "@mindyshankar", "ranibathia": "@nvrao818 I PICK YOU", "mariahpedrelli": "@lsfusinato sera q nao contratam uma brasileira nos mid 20s", "anmolsadventures": "Are you casting any South Asian males?! I nominate @sapankc 😋", "trusharr": "No male actor needed ?", "malindiayienga": "YA BISHHHHHHHH🙌🏾🙌🏾🙌🏾😍😍", "sugarrperry": "@abiahnaa do it. Dare you", "gabriellaj013": "@yzjasa please ❤️", "jonkain": "@desi_of_hogwarts", "stacy_ncgirl": "I think I can pass for either role. Willing to color hair.", "_shylilmija": "@jasnoor_sohal girl who know this may be your calling", "oneofmanysoumyas": "@pragnyaparamita for the mid 20s role", "misshallory": "@ariciaskiddubs 🚨🚨🚨 this is not a drill", "mariapoons": "@shikhups my ticket to LA ?? Lol should I do this??", "jessiekarabiyik": "🔥", "bri_shafer": "This is so exciting!", "sajel_oh": "@kareen_bean this is me", "smishra821": "Omg so excited for whatever this is going to be @thekhushlyfe", "christinemoran28": "@chennaikutti", "saumyasinsta": "@promabee career switch?", "__irenesta": "And maybe a bit of me @goodnessandgiggles", "bombshellbakingmama": "I can’t wait to watch! Love all you’ve been in and done 💖", "elonggg": "This is amazing; you’re amazing! @mindykaling", "bbreebree": "@zoeinparadise 💁🏼‍♀️", "cariadlloyd": "@mawaanr call your mum x", "a_hippie_hooligan": "You are my inspiration 😍", "emm_emm_two_gee": "@cassili89", "sadaf101": "@aashtialam @meher.alam", "priyaanita": "@swetakeswani", "msxom": "@udzdrix IM GONNA GO AUDITION", "brittanyengen": "@flipnfaye", "reign_onn": "But I’m not Asian 😭😭😭", "shimsvt": "@vanitamsharma get on it", "_niksp": "@jessicapurba", "annamoeslein": "@manasavedula this is awesome", "natalbeezzz": "@jen82ben if only we were south Asian!!!!", "ritikapolotan": "Oh I cannot wait!!!!! @ajmacaroni", "chars.web": "@amisha.pdf your chance to dethrone your brother", "shawnaleem": "What about an almost 40 chubby Canadian funny girl! I dont think we have one yet?!😉", "tajjis_eye": "@desaidharti", "shobssingh": "@itszdeneesha now is our time to be on tv lol", "lucia.margott": "I don't fit the criteria, but may I still audition. I'm thirteen", "benliwanag": "@akulks you’d be perfect", "_tanv_": "@diyang_ is this my time to get back into acting?", "raosuha": "@pristigious uh drop everything do this", "ms.snair": "@veesethu", "denisepayette": "@xoxoshosh @sharmica28 here’s your chance to meet Mindy!!! ✨", "saminakirchen": "@liz_haferkorn CAN I PASS AS 15-18?!?!", "ljdalts": "@jasmine_samra wait a second we need to chat with mindy", "mich_sattaur": "❤️❤️❤️", "jaysamm": "😩😩😩 How about just ASIAN LATINA?? With Hispanic accent? Lol consider me soon ❤️🔥 #shootingmyshot", "heismerminaya": "@franciscokapindi let’s put Preetha or Shukla in this", "nidhi_ishana_verma": "@mindykaling if only it was mid thirties 😁🤣❤.", "peeoncheese": "@reevathii_ it is time", "angojollie": "@sheronetan", "maidenofvalhalla": "Oh man I meet none of these requirements 😢", "hinaxkhan": "@bradleyjstokes 💁🏻‍♀️", "heyambasir": "@sarahjang97 ur time has come", "serena_c_c": "@_miri4m omg!! Shall we audition 😂", "courtshorte": "@kallllpal @sonyeeahh", "meeshanisha": "@divyap15 Challo lets do it", "gingerkate": "Let me know if you need any freckled, awkward gingers in their early 30s. 🤣 but the role would probably go to @elliekemper so nm.", "krich048": "@ktpotaty ?!", "jayyylahhhh": "This is so cool!🙌🏽🚀", "miakalo": "@vivekavivekaviveka can u audition", "papo_hb": "Looking forward to your new show !!!!", "sumermakbar": "@nbangaroo I was born for this!", "eringobragh_less": "@taylor_schwarting you should audition!!!", "bebellegram": "If you need a French person for a 5 second cameo please call my mum I meant agent", "ahmadsakhiofficial": "@caramelkween", "undiscerningglutton": "@haligonian_84 you could be mid 20’s", "kariwilsh": "@dasspm you should audition", "bavi20": "@abina_v LETS GO", "humancinnamon": "YAY! GO DESI ACTORS!", "childishmagneto_198": "@upidaisy you got this", "thats.so.simpson": "@dosesofdhara GIRL", "_alifoley": "What did we do to deserve such an angel?? 😇", "jazz_ozuna": "@subo_nyc imagine!!! @some_random_filipino matias you could probably pull it off too lol", "saliha021": "@mlpadman want to see you in this!!", "karishmakatara": "Hey @mindykaling.I am interested in taking part..I am 31 though..please advise", "em_stoked": "@piyaltree", "sreezy3000": "@rheally.jpg", "elysehosein": "Omg GUYS @sidi.a @asmdesserts I’m old enough to act and move to LA AND I look like I’m 16. I feel like I’m made for this role????????", "nimkns": "@lespetitsmomentsdebonheur go to the casting haha", "sarah_kate11": "@mindykaling I am an aspiring comedian if you need an Intern in your girl!!", "lilibutterfly": "@guljitsandhu you will be amazing to watch! ❤️👍", "ldr0806": "Do you need a \"young minded\" old lady?", "khirxx_": "Cast a black girl, I’m trynna meet you!", "purvisheth99": "@neeraalee you shld go", "nlequinephoto": "@summershaikh I want you to be famous 😂", "jjoshi5": "@_srishti_11 @niralipatel29 @xiti_joshi @yahvi6432 dropping out seems like a more possible option now", "richardabate_": "Love this", "kristi__snyder": "@andrewsnyder90 @ruth.e.bray 😫😭 WHY AM I WHITE", "niv.15": "@rithu04 mid 20s Indian accent, why don’t you try", "luluchenster": "@anusha.j.keshavan 😃", "sharanbassii": "@navib18 @vikbassi 👳🏽‍♂️I can act right??? And I look 16 anyway😂", "ms_rebellion": "@bringthegoodvibesonly See, it’s the age of brown women 💪🏽", "nehaassar": "Yes yes yes!!!!!!!!!", "utkarsht10": "what about guys Mindy we want work too", "christine_latchana": "Right up my alley! @mindykaling ps mindy my little girl looks like she could be your daughter. Just letting you know for your life story 😉", "payelt": "👏🏽👏🏽👏🏽", "fararrii": "😄💞 yay!", "animalbandoffical": "Can’t wait!🔥🙌", "isadavila777": "Do you have room for an American Mexican with a slight Texas twang?!", "pbsmiledoc": "@shephy17 can u do an accent?", "vcoluccixox": "@marialifeandfood somehow you need to get in this!!!!! I love mindy!", "shanderson44": "“with an accent?” Can’t actors do accents regardless? I don’t get it.", "shannonxiao101": "@preethiii19 also @nitin.maddi u should audition as well", "mrsgum": "Any chance you need a pregnant Pakistani momma on set??? I got you, fam!", "rosaleen_ram": "@anotherjones - we can play aunties?", "angpollema": "What about Desi lady crew?!", "ifitaintbrookedontfixit": "@anushachemicala", "theabirhossain": "@riba.sh", "sarahleighspeaking": "@arlittlemermaid", "anucity": "??? @subsicle", "maryannewendt": "@marissaangelina", "claramoreno8188": "Any males needed?!", "jennasedeno": "No one understands how bad i wish I was from South Asia right now", "dharkiii": "@princessnikip do it!!", "analou_88": "@taralondon", "buckley.robyn": "But I was telling Aaron you could totally do it!!", "sanjaypatel1980": "@zaidfayaz", "amahsia": "@duaanaveed hey u should do this", "toniazzz": "@chickenbindaloo @tiffogun", "teachernerdist": "I’m Native American... does that count?!", "jbhendrick": "@kinnara8", "yashmitasingh": "Now you can do your Indian accent deliberately 🔥 @itsyogehl", "acallo511": "If you ever need a mid 30's overweight, very white women with a few tattoos and zero acting abilities. I'm ya girl! 👉😁👈", "ashleytrinh": "@ctrinh520 year off idea", "nadlakha": "@dohknutz @shireenbedi @greeneggsntofu @dhiv2202 @ameeshrimanker @asthatejpal @skothadia see you there! 😋", "swaroopmallegari": "Holy crap @mindykaling brave move. Get ready for a shit ton of emails.", "_dhrutiix_": "@anncytwinkle", "cmoncs34": "@taramoncure Right up your alley!", "alyce_eliza": "@gracebrooks147 I can’t wait for all the mindy projects coming up", "shivanipatel_16": "😃😃😃", "_wonderlandcutie": "How long does it take for them to respond via email?", "jjel12_11": "@mindykaling I can be your stand in too 😁💕", "riversong26": "Oh man! @mindykaling if you ever need a nerdy black girl please give me a shout, I will make myself available! Lololol, but seriously.", "tanujaaravikumar": "If only I live in the US 😭", "tchhabs16": "@anshulchhabs @made_in_india_", "_angelinapaul": "omg", "xoxomayhem": "You could pass as younger lol @newyorksita", "shararti12": "When will they respond to emails?", "lawyergirl73": "Love this and can’t wait for the show!!", "tas_mohd": "@madhuri_ram @_aanchalanand audition no?", "sharmila17": "@sharanyantics", "vllarena": "you dont need any mexican? 😂", "meenoo": "My name is Desi... 😬", "kajal_modi": "@shivnomm know any young South Asian American girls? 🤔", "mindykmac": "If you need a late 20s basic white girl, HMU!", "ahntothemin": "@jusharma", "chiefbridgebuilder": "@kavitarajagopalan in case you know anyone... 😘", "g.robertelli": "@lailaafsar", "olivia.grrr": "@poojakumarny thought of you! Hope all is well. Been quite a while since our good ol’ days on Hiding Divya! 🤗", "inquiringmother": "@lightningdncr", "notoriousdjbobina": "You let me know if you need a fun, darling, positive, fat Caucasian 53 yo (looking 35!) chick, m'kay?? I got you, girl!!", "13jray": "@juhiray20", "kavyaoth": "@mihikashah04 drop out of med school for this lolol", "j.d.noakenshield": "@jakedaboi237 yah girl man", "jaxofhearts03": "I think it’s so awesome that you’re doing this. Representation matters!", "lala.t1": "@nawals25 YOUR TIME TO SHINEEEEEEE", "hollietran": "@shanee_17 us", "thedianekim": "😭😭😭"}