{"monopolyspammm": "St Jude’s children research hospital and habitat for humanity😊💛", "chefjolli": "@nokidhungry", "streetsoftamileelam": "Happy birthday Mindy! This is great. Please help @childfirst_uk a non profit who helps schools & peoples in war effected places in Sri Lanka.", "thenewfx": "Saveawarrior.org is a program for veterans and first responders. It's extremely worthwhile.", "eszterkovacsldn": "Happy birthday @mindykaling ! What a great thing to do! 💰 to @faceforwardla please! 🙏", "maria.ub": "Kahn Academy is a free educational site, and provides free online education videos for everyone with internet! It has been SO helpful in my entire life and academic career, and anyone with internet access can get educated. Love kahnacademy.org @khanacademy", "drj4483": "You are such an amazing, beautiful, intelligent, inspiring,......... How I wish I had met you a couple decades back! ❤️😎!", "jaimiescheiner": "You’re amazing 💕", "paulymangoindia": "Wow, what a lovely way to pay it forward! Please consider @tolfaindia street animal hospital & sanctuary for any future donations - wonderful charity! 🌳🇮🇳🙏🏾💜🐱🐶🐂🐐🐪🐴🐖", "ani_la206": "How ironic that you’re a mother now, and you are working with a company that is helping ice put babies in cages! 😂 #fuckamazon #notechforice", "rogahtaylahloveshiscar": "40,000 dollars damn", "holistic_jules": "Check the Black Feminist Project and @tanyadf", "helenvdz": "Love this Mindy. @roomtoread is so worthy x x", "norogo123": "How about the donor’s choose organization that helps teachers buy classroom supplies?", "h.e.a.r.t.program": "@that_cabrona thank you for thinking of us!! ❤️❤️❤️", "ryans_fitness_journey": "I'll take a 1000 to lol", "clairedelancey": "@dignity_period", "janayaortiz": "National network of abortion funds 🤙🏽", "ismilewithmyeyesfirst": "Thank you for donating to lupus and all the other ones :) 💜💜💜", "wendydarling615": "Happy birthday and you for donating to Lupus.org @mindykaling 🎉🙌❤️", "stf_nie": "Happy belated birthday Mindy!!! This is a wonderful gift you are sharing with the world! What a blessing you are. Please help @schoolonwheels a non profit who helps homeless youth all throughout Southern California. 💛", "jannii.jannii": "@crpsforum would be a great organization to donate to. Chronic regional pain syndrome is not common and they need all the support they can get🏵️", "somm3rtim3": "@lupusorg please please please 🙏🏻", "erica.kristen": "Thanks for supporting Lupus research!", "lpvrsemt": "Check out @lwhadoptables they save pets from around the world and find their forever homes.", "lisalichelle": "That's Right! I'm taking the Shot Mindy! www.artbuylichelle.com", "hannahskvarla\nVerified": "Verified", "alisonbadali": "I hope you picked WarChild. They do amazing work helping children in war zones. Started be FEMALE Cdn doctor Samantha Nutt❤️🍁", "smperrine": "@supportkind ❤️❤️❤️", "cjstuf": "I second @cjstuf Thank you for what you’re doing!", "janetterhoff": "Love this so much! Check out the @tahirihjustice Center!", "riosbren": "This is awesome! Presbyterian Night Shelter (www.journeyhome.org) is moving people from homelessness to home. It’s an amazing organization that gives people experiencing homelessness job skills and a roof over their head.", "hannalc21": "This is very specific. Not sure it’s what you’re looking for, but a little girl in Texas is battling cancer (unfortunately like too many other kids). It’s a pretty severe situation. She dreamed of being an officer, and a nearby city has made her an honorary officer—Officer 758. She has taken a vow to fight the bad guys, including the bad guys in her body. She’s a tough and amazing kid with so much fight in her. They are fundraising to help pay for her treatments because the family has exhausted all medical treatments and have moved to other types of expensive treatments not covered by insurance. Abigail Arias - Officer 758’s Cancer Fight @abigailariasofficer758", "saltgirlclothing": "💥💥💥💥💥💥💥💥💥💥💥💥", "juliethomas5065": "How about CBN (The 700 Club)", "tonybeeating": "I so look up to you! You are admirable. Hope your Birthday was all you wanted. Much ❤️.", "alongthewayinc": "@alongthewaypa we serve single moms going to school or working during nights and weekends with babysitting services. 🔥❤️🙌", "kimmie.kat": "@padmalakshmi was going to suggest Endofund, as well. Suffering for 20yrs, & much more research/solutions/early diagnosis is much needed. 💜", "seazybreezy": "Partnersinhealth", "syds.blankets": "@yara.community", "cassie_eberle": "@yara.community", "surmightyballs": "I have one,how about donating to build the wall so you can keep your little girl safe away from all the murderers,rapist,child molesters and drug and human traffickers that try to come across the boarder,how about you spend money to protect the future for your daughter and not worry about what communist Hollywood thinks cause they couldn't give 2 shots what happens to any children,their murdering children every day just because the went out and got drunk with some guy they didn't know then kill the baby inside them.", "debhuber1": "@mindykaling Please consider Be the Match--the U.S. bone marrow donor registry. Every year they help save the lives of thousands of people with leukemia and other blood diseases who need a transplant. Google \"jack's wish,\" to learn more and see a PSA made by my 14-year old son and Make-a-Wish to encourage people to become donors and have a shot at saving a life (like someone did for him). Happy birthday and thank you for your generosity.", "francie_lala_": "They always need financial help. A wonderful way to give back on your 40th.", "santiago_aussiedoodle": "So generous! Please consider @alzheimersla ... there are more than 250k angelenos living w#alzheimers, and 113k are women", "yo_mads": "@starhousecolumbus is a wonderful organization in Columbus, Ohio. It's a drop-in center that offers homeless youth a safe respite from the streets and connects them to vital resources to help them thrive. Please consider donating to help them help more youth! ❤️", "kavithakannu": "@mindykaling Happy Birthday! I love what you're doing! I just volunteered with @barefeettheatre in Zambia, they do amazing work with streetkids using performance arts to inspire and educate. Many of the founders were former streetkids themselves. They do great outreach programs to vulnerable kids, your donation and shout out in social media will go a long way to help them achieve their goals! www.barefeettheatre.org", "t_streetman": "Please consider supporting the @alzassociation! They do incredible work supporting people living with dementia and those who serve as caregivers, and they're the largest nonprofit funder of Alzheimer's research! #ENDALZ 💜", "lestatspal": "@marleysmutts & @deservingdogs definitely!", "deservingdogs": "@ipittythebull", "fernanda.rivas": "That’s such good energy and positivity to have and to bring into the world! I will always try to follow this example.", "mptf\nVerified": "Verified", "teslatastes": "So gracious and kind. @everydayrefugees @unicef @biglifefoundation @hsi @sheldricktrust", "imfit4me4life": "This is A-MAZ-ING of you! Happy bday, 40 looks good on you!! I would be so thankful for you to consider @nf2biosolutions They are a nonprofit comprised of moms like you fighting to end this rare genetic disease! We need a spotlight on this unstudied disease! Bless you and your daughter! #kindnessmatters #randomactsofkindness #birthdaywishes", "sarlove01": "@myheartbeatsfornoah @mindykaling a very deserving cause right here, sweet family and their sweet boy ❤️🥰", "allygursky": "@the_barber_fund !!!", "zuby.chowder": "@riseforrohingya", "bard_954": "@jdrfsouthflorida", "gladyswangechi": "Hi.@baby blessing children's home.we rescue abandoned infants.those infants born and abandoned at filthy places like dumping sites,sewerages and other places.kindly donate to help us as we are facing a financial crises at the moment have a total population of 64 kids.we are facing eviction from the house that we have rented for the kids as we are having rent arrears. Please help us.you can such us even on facebook.baby blessing children's home.to reach for any information kindly use babyblessing11@gmail.com.we are ready to give you any information needed.", "katymacjohnson": "Consider @defeatdipg ........pediatric brain cancer gets such minimal funding. I watched my BFFs daughter die from this horrible disease last year. There is currently no successful treatment and no survival, with prognosis of 9-12 months from diagnosis. My friends little girl only got 5 months. Spread the word. Raise awareness to increase research funding!!! #braveryforavery check out her Facebook group: bravery for Avery. And also the Michael mosier defeat dipg FB page.", "hatchinghope": "BIG THANKS to all of our friends and supporters mentioning @hatchinghope ! Let’s do this!", "gez_bilston": "@gcdomesticviolencerefuge", "danaivy": "@smashsmard would love your support!!!! 🙏🏼🙏🏼🙏🏼", "grm61": "Please consider NourishNC!", "theothernadia": "Another vote for @miryslist $1000 would mean so much to these refugee families", "thuuutran": "@mindykaling It’s so kind of you to be doing this. Please consider giving to @gsmdm. It’s a non-profit organization that travels to rural areas of Vietnam every summer to provide free medical care to the poorest of the poor.", "jellyfishtunaham": "If it’s not too late, savethechildren.org! To help children everywhere, but also for the children held and separated in American immigration detention centers!", "pepitas.and.pistachios": "Happy birthday! Harriet's Dream, founded by Catrice M. Jackson @catriceology supports WOC in need 💙", "sherrimitchell9080": "❤️Doterra Healing Hands My.doterra.com/bluemom your be helping a wonderful project take a look🙌", "ozone_house": "@ozone_house would be a great choice. Small org in Ann Arbor, MI doing big work. $1,000 would make a big impact for the young people we don’t have a safe space to sleep at night. A lot of young people leave home because it’s no longer safe or they’ve been kicked out because of who they are or who they love❤️.", "elight24": "@bodyimagemovement 🙌❤️❤️❤️", "lillyvanilanueva": "WORLD MISSIONARY EVANGELISM!", "kimberleajaskulski": "First Nations Child and Family Caring Society https://fncaringsociety.com/shannens-dream", "movefwdmn": "@movefwdmn", "shrice59": "Childhood cancer research!!", "teryluzandreu": "@mindsmatterchicago", "andreaivanah": "@btsadv", "only.you.tattoo": "Me, im a charity, a small business startup by a single woman of color 🤞🏽", "rallyforreilly": "Thank you for helping #cysticfibrosis!!!!!", "rachel.roitman": "The painted turtle- a camp for kids with chronic illnesses!", "bellaviera": "@livepridefully F.R. Pride is a startup non-profit in Fall River, Massachusetts focused on LGBTQ+ youth and Families. MA is the 2nd leading state with the highest rate of LGBT self-identified individuals however, there are glaring disparities in LGBT specific resources and services in the South Coast of Massachusetts. I am the founder of this organization and am passionate about bridging the gap in access to equitable resources and care for at-risk LGBT youth. I also want to create a safe space for youth and families to engage in community activities as well as, raise awareness on the various negative health concerns that ultimately stem from intolerant households, negative societal influences as well as, lack of culturally competent preventative education. What a better way to end Pride month and celebrate your 40th birthday, than by helping an organization in your home state and the youth that are supported by it! Thank you for your consideration!", "juliettelord": "Charity water", "hendryhannah10": "Hi Mindy, huge fan. Please donate to @autismspeaks, as a sister of someone with Autism I see how much these individuals need everyday. Your donation would ensure that they get what they need and truly deserve. As of 2018 1 in 59 children are diagnosed with Autism, we should be making this world a more accepting place for them. For Logan (my brother) and all of those who need @autismspeaks advocacy and support, please donate.", "janani28": "@sankaraeye hopes to eradicate curable blindness in India (80% of the world’s curable blindness is in India)! They perform free eye surgeries and build state of the art eye care facilities all across India. From 1 hospital in 1998 to over 10 today!", "wearehowardbrownnurses": "@chicagoperiodprjct @chicagowomenshealthcenter @chibondfund", "halle_rebecca": "@kathyeasterbrook", "ms_oh_sheila": "@mindykaling you’re the best! Live Like Coco Foundation out of Aptos. Gives back in so many ways.", "thereal_katvonsanchez": "@theirc please", "mcmahon12": "@nubabilityathletics", "thewriterteikoa": "@BTSADV i", "sparksf": "Happy Birthday Mindy!🌈🙌🏼", "shenbee": "Baylor Global Health, Houston Texas", "sigmapoet1914": "Happy birthday love.😍", "thebettermonday": "Happy belated birthday! Check out Free 3D Hands and donate to this amazing project. https://www.mycause.com.au/page/145265/free-3d-printed-hands-and-arms-for-people-in-need", "lotusnyc1979": "@theriahouse and @donate.bras.underwear both based out of Framingham Massachusetts, RIA House supporters and rescues girls/women from sex trafficking and dignity matters provides feminine hygiene products to homeless women", "peanutbutteranjali": "@wiser_international", "fosterkidsuniteinc": "🙏🏽😊Thank u for thinking of us!!", "kenankilledit": "@fosterkidsuniteinc", "happy.healing.angel": "donate to @neda and @thewcs", "ella_queeen": "@campkesem is a national org whose mission is to never let a child experience a parents cancer alone. It’s fun and funded by college students and we would love your support 💙💚🐛 sending you love and thanks for doing this!", "supportthegirlsfilm\nVerified": "Verified", "4paws_yasu": "Happy birthday @mindykaling !! @4pawsforability places service dogs, primarily with children and veterans, and the dogs are raised, trained, and cared for by thousands of dedicated volunteers! These dogs are amazing and they can change a family’s life by alerting to seizures, caring for children with autism, and so much more! I hope to be a superhero someday too!! 4 Paws is currently raising money to construct a new facility for the puppies, because their journey to service dog begins on day one! Thank you for your generosity ❤️ I wish I could give you puppy kisses 😘", "vtreston": "@longbeachchristmasangel", "madshaker": "Please consider @hccnepal helping provide education to underprivileged children in Nepal", "kemba_m": "Mwana Villages - it's an orphanage for abandoned and orphaned children, as well as vulnerable mothers, in the Congo @mwanavillages", "gorgoeusgalswithkristen": "Kinsey’s Cookie Cart!!! Alex’s Lemonade Stand", "weimann_rivas": "#plannedparenthood", "sscappahall": "@chestereducationfoundation . Happy Birthday!!", "ponky8": "👏👏👏👏❤️", "a_last_gift": "Happiest of Birthdays to you. We would be ever so grateful to receive a donation and/or recognition from you!! Our 501(c)(3) nonprofit helps pay for funeral expenses, memorials & grief counseling if a family loses a child and cannot afford these costs.", "tzilla16": "Hey 👋🏻 you should donate to camp trillium! 🎉", "seeya.leah": "TIERRA MADRE HORSE AND HUMAN SANCTUARY", "lindseywashere": "You’re the best!", "tmacvt81": "Happy Birthday!! Please check out @williestrongfoundation", "jennastacydawes": "@wildlife_conservancy", "happy.healthy.transformed": "The Jessica Martel Foundation. Men's violence against women. @jessicamartelfoundation", "reclaim13": "We would love to connect with you. We are a local Chicago 501c3 that rescues children from human trafficking.", "mk1.618": "#letyangspeak", "roxyleary": "@academypreptpa and @academy_prep_stpete are giving a wonderful private education to low-income students at no cost to their families!!", "sheri.kaupa": "HAPPY BIRTHDAY!Dysautonomia International could use the funding! Not enough doctors to treat the disease that has taken the social and athletic life out of my son. (And so many others.)", "ladysmithcares": "❤️", "titiollino": "@mindykaling @1m_lady", "nicole_dunstan": "@rettsyndromeorg", "werdflare": "@crisistextline !!", "september_breeze": "@aydensarmyofangelsofficial ❣️❣️❣️", "jamiesleonardo": "@bestfriendsanimalsociety 👍🏻", "lisa.larson.9081": "Eastern Maine Community College student scholarships!!", "greendoughnut86": "@beautyamidsttheashes !!!", "megsporcheron": "@b4bc 💕 happiest of birthdays!", "jessiemae84078": "@redthread.life helps refugee women and woman who have escaped domestic violence in their homes.", "613beautyforashes": "My friend, Victoria Justus, is buying Bibles for children in Rwanda. She would like to donating 1000 Bibles by July 1st, but is 207 Bibles short. Each Bible costs $7. If you're interested in donating please let me know. It's for Mary & Martha Bring Hope & Healing to Rwanda.", "wendyparr": "The joyful heart foundation!", "beeshavesecrets": "✨ charitable flex 100 ✨", "mama.jones.62": "Please consider @lighthouseforhope which is a young organization helping families of children fighting cancer. 🥰", "tunaspecial": "@brokenshovels", "hsi_nj": "We are a nonprofit out of Morristown, NJ and have been helping the homeless since 1983. We provide our program participants with the skills and tools they need to lift themselves out of homelessness and become self-sufficient. In the past 5 years, 100% of our graduates found permanent housing and remain housed! With government funding cuts, we need all the help we can get #HSIHandUp", "judywanja": "Donate to @aydensarmyofangelsofficial for support of cancer warriors and families affected by it. Please please.🙏 @mindykaling", "ubergulious": "@pawsitivechangeprogram wonderful program, please donate", "randylkld": "@roxyleary @roxynole", "carrieredsmith": "The Cure Starts Now for Team Brock!", "caragotoheller": "Awesome! Miryslist.org", "ribadiva": "@jedfoundation", "_karadise_": "@crisistextline is an incredible organization that advocates for people in crisis and has made huge strides in promoting mental health awareness. They would be an excellent choice!", "gussiefr": "@jedfoundation protects emotional health and prevents suicide for teens and young adults nationwide 👏👏👏", "adaline.winkowski": "Catch a lift fund - fitness for wounded veterans", "famillesansglutensurlaroute": "So great! Happy birthday!! I would suggest Give kids the world. A wonderful organisation!!! ❤️❤️❤️", "kidsandnikegram": "@smashsmard", "ashleymilena": "@apurposefulrescue 😻😻😻", "slice0fpie": "HBBD! Check out @flat_broke_farm They have a Go Fund Me to complete their animal rehabilitation area", "praisity": "@smileonmehq", "lexidu7911": "@mindykaling please consider donating to @longislandbulldogrescue I did fundraiser for them on Fb for my 30th birthday this year which is also june 24th. They rescue abused neglected bulldogs and educate the public about the breed. 💕", "iqramirza1": "You are seriously an amazing person! Happy Birthday Mindy! 🎂🎈🎉🎁🎊 Will you donate to the national suicide prevention. I lost someone very close to me do to suicide. It would mean the world to me if you donated to help prevent suicide.", "llelbn": "What a fantastic and generous idea! My suggestion is @solve_cfs - ME/CFS is a great burden for all who have it, but more so for the poor and affects more women.", "annedhull": "Habitat for Humanity, Salvation Army, ST. JUDE Research Hospital 🏥", "thepinkfund": "The Pink Fund is a non-profit breast cancer organization that provides 90-day non-medical cost-of-living expenses to breast cancer patients in active treatment for breast cancer, so they can focus on healing, raising their families, and returning to the workplace. 💗", "american_transplant_foundation": "We give grants to transplant recipients and living donor patients. These grants help transplant recipients receive transplants that ultimately save their lives. Please consider and visit our website for more information https://www.americantransplantfoundation.org/", "e_jennett": "@american_transplant_foundation is an awesome organization I work for and we, and transplant recipients, S well as living donors everywhere, would love your support!!! 💚💚", "carlatrr": "@fflrescuenetwork", "2seungeun_": "@join1love educates young people on the difference between healthy and unhealthy relationships! Most college students who participated in our early workshops said they were super helpful, but that they needed it even earlier on. With your donation to One Love, you can help expand our reach to the population that needs it most!", "sparrows_compass": "Happy birthday @mindykaling . I recommend @activevalor , a combat veteran run 501(c)(3) non-profit organization in San Diego, CA dedicated to giving new purpose to veterans by pairing them as mentors to children of our nation’s fallen heroes, referred to as Gold Star Children. I know the founder, the folks that make it happen, and I see the change they bring into these lives. It’s incredible. Hope you have a chance to take a look. Make it a great day.", "foxxyfoodie": "@mindykaling ThinkHumanity.org We educate women in Uganda that would normally not get the chance to go to school. We also provide wells for clean water and sell handmade jewelry from women to keep them from having to work in rock quarries. 😍", "j9.shireen": "A21 Campaign", "lindzkhalifa": "@baja.dogs.go.north could benefit SO much from your donation! They find dogs from La Paz homes by supporting local fosters who find the pups and then facilitating all of the work to get them on flights up north! It benefits the animal population, adds money to the local economy, and brings joy to so many people.", "agomezwagner": "Together Rising! https://togetherrising.org", "carichampion\nVerified": "Verified", "mariemanzo": "@mhaokla is a great org! They make a major impact in their local Tulsa, OKC and Oklahoma area by breaking down the stigma of mental health care and getting people in off the streets into safe, affordable housing.", "addison_hausler": "To Reach Every Youth! They help young adults who have been diagnosed with Sarcoma", "jenborowka": "@jedfoundation", "jackson_satow3": "@jedfoundation PLEASE!!", "henryzhu18": "@jedfoundation", "dethanfields": "Loved you in Late Night! I encourage you to donate to @jedfoundation which focuses on young adult mental health and suicide prevention efforts!", "jedfoundation\nVerified": "Verified", "lizicle": "@hsi_nj !!! They have been helping the homeless and working poor in our community get back on their feet since 1983. It’s not just about housing the homeless, they give program participants the skills and tools they need to become self sufficient #HSIHandUp", "julia_blee": "@jedfoundation @jedfoundation @jedfoundation !!! such an incredible nonprofit that exists to protect emotional health and prevent suicide for teens and young adults.", "shisu_10shi": "Hey Mindy. I love you and your beautiful work so much. Thank you for that and this noble, awesome, and grateful cause you", "julinaclare": "@nashvillesudbury", "chloesaysh1": "also joyful heart foundation!", "alkrukowski": "I hope you will consider @feihonduras! They are doing amazing work for the children and communities of rural Honduras!", "wendoodle": "❤️", "sacredleafcbd_tx": "@operationsnowstorm", "pinkcream": "So amazing!! Please consider @youngsurvivalcoalition @the_breasties @chickmission 💖💖💖💖💖💖💖", "coffeecarbsandcourage": "Please choose @youngsurvivalcoalition , who supports those under 40 dealing with breast cancer! I'm riding 200 miles in 3 days as a first time survivor cyclist for them at @ysctdp 😊💪 #tdp200", "kee.camp": "Happy birthday! 🎉 I have 2 great organizations in mind for tour cause that have assisted me growing up with my chronic illness @makeawishqc @aafq_scaq ❤️", "lmalcs": "Mindy, my friend, a single mom of a six month old little boy just passed away from breast cancer. There is a fund set up for her son. I’m donating and hoping you might find it in your heart to donate as well. She was a beautiful soul. She was only 33 and only had six months to love her son here on earth. Happy Birthday. We are all lucky to be here. Please dm for info if this is something you would like to do. ❤️", "elana.raiola": "@empoweringher 💖", "kcconner": "@mindykaling please donate $1000 to the @cf_foundation! Cystic Fibrosis is a genetic disease that affects 30,000 Americans....there is no cure! #graytonbennettpinkston is one of those people, and he is pure light! #graytonsguardians would love your support! HAPPY 40th!", "feelingfinerescuesofl": "@mindykaling , Happy 40th Birthday. Thank you so much for blessing others on your special day. Blessing sent your way.", "mr_b.hall": "That is great @mindykaling! I would suggest All People’s Community Center. We’re an all purpose community center based in South Los Angeles. Please our check our website! https://allpeoplescc.org", "arbo_girl": "Please consider @international_animal_rescue", "stella_boom_boom": "Please consider SHS Harbin Slaughterhouse Survivors for your charitable contribution. They are an amazing group of women saving dogs from the meat industry. I’ve volunteered twice for them in China and I can’t tell you how desperately they need the help. At the moment they have 300+ dogs in their safe house and it is going to take a lot of volunteers and donations to get these dogs to their forever homes all over the world. Please be a part of this cause. You can check out photos on my IG. Thank you for your consideration!!! And hope you have an amazing birthday year!!", "breastfeedla": "Love it! You can always support your local breastfeeding coalition, @breastfeedla", "morganlss": "Help A Mother in Oakland/San Francisco. Helps low income moms get diapers for their babies and happy birthday! Giving is always better than receiving. I do it on my birthday too", "xx.kenna.xx": "@slaughterhouse_survivors Saves dogs and other animals from meat houses in China. And they dedicate their life to helping those animals no matter what happens!!!", "parade.media": "Happy birthday, Mindy! You're such an inspiration to so many.", "stacozo": "Wow. Amazing gesture. Happy 40th!", "denisenfabella": "@isupportthegirls !!!!!!!", "loski32": "@smashsmard 💗💗💗💗", "_lulu810_": "@fosterthelaughs @megschaab @driversmeg", "shyamillionaire": "@raicestexas", "msjuleselkins": "I can’t wait to see you today at #Apartmentalize in Denver! You should donate to @hatchinghope which helps apartment residents after a disaster", "raquel.ladabaum": "Surfrider, help save our oceans🌊🌊", "naomiprentice": "International Justice Mission", "jmuhlhausen": "Toots Fore Tufts! Patient support for Neuro-Oncology Patients at Tufts Hospital @tootsforetufts <3", "re_nea": "Hi Mindy! This may be too late but I’m still going to try. I volunteer at a non-profit @abodeccftd in San Antonio, Texas. We provide a loving home for individuals who are at end-of-life. Not everyone has the ability to die in their own home. This is near and dear to my heart because I believe everyone should have a peaceful place to die,surrounded by people who love them. (Even though it sounds sad, the house is filled with laughter and tears of joy)", "clevelandangelsnonprofit": "We would love to be considered!", "lona_boom": "@gwafund would be a good one to donate to", "aydensarmyofangelsofficial\nVerified": "Verified", "lccushing67": "It will be great to donate to Pedriatic Cancer. Happy Birthday!!💖💖💖", "friendsoffaithprudenfoundation": "What a thoughtful thing to do!!! The Friends of Faith Pruden Foundation would use your donation to continue or mission of helping kids with cancer and their families! #FFPF🎗 #everykidfightingcancerneedsafriend HAPPY BIRTHDAY, MINDY! 🎂🍷", "adara_81": "@girlabove would be a great organization to help teen girls!", "girlabove": "We would be so grateful! We provide mental health resources for adolescent girl to help them navigate anxiety, depression, self injury, eating disorders, and suicide. 💜", "coordinateslove": "Animal alliance in lambertville nj just rescued many dogs who need urgent vet care! 1,000 would save so many little lives ❤️", "cathyplymel": "@bgcnewark ❤️", "la_pansita_feliz": "@dreambignevada provides aid to Nevada’s immigrant families through direct services and by empowering community members to advocate for themselves and others in similar situations. Executive Director @astrid_nv is at the helm of this much needed organization in Nevada, a state that has very few non profits serving immigrants. 💫", "itsapittiefulllife": "Fana. They help to find families for children in need from Colombia. Our mommy was adopted through them 28 years ago.", "vikipeer": "@associationofhorizon is a great local org in Illinois that hosts a weeklong #summercamp for adults with physical disabilities :)", "zamzam.water": "We collectively build wells in Africa, South Asia and the Middle East 💙", "lizzipper79": "Please donate to any cancer organizations. I’m turning 40 this year too, but I almost didn’t make it. I’ve been kicking cancers butt for 2 years!! Thank you for being so awesome Mindy! And happy happy birthday!!!", "_audreyroze": "@crozebrowne mindy is the bet!! HBD", "allabsmith": "Happy Birthday! I hope that you consider donating to the STXBP1 foundation. My son has a rare neurological disease called STXBP1, the STXBP1 foundation is trying to find a cure, we are so close to finding a cure!", "mama.cecil": "Happy birthday @mindykaling ! I would like to recommend @bounty_and_soul as a grant/gift recipient!", "tariqkhamisafoundation": "This is awesome @mindykaling 💚💚💚", "mommabydesign": "@spreadthesparkle events for women and kids who have survived domestic violence! Xmas and Mother’s Day!", "dariana.castillo": "@cf_foundation", "sandi.belle01": "@prpbestbuddies HAPPY BIRTHDAY SWEET GIRL 💕", "dee2swwet": "Happy Birthday Dear 🎉 Blessings to you and your giving heart 💜 I would like to suggest that you donate to #abilityfirstla I have worked at the Inglewood location (Joan and Harry Mier Center) for 17 years. The Center is a nonprofit organization for children and adult with Disabilities. 🙏🏽❤️🙌🏽Your awesome", "henna83": "@mindykaling please consider supporting @medglobalorg. They provide care in areas other ngos won’t go. I just got back from the Rohingya camps in Bangladesh and the people the New York Times considered the most persecuted in the world could definitely use the support and the public’s attention. Happy bday!! Ps just watched your new film @latenightmovie and it was amazing!", "jen.camden": "SmashSMARD!!", "cargomez_5": "@campronaldmcdonald", "2tribckb": "@raisinghopefl — on a mission w/ a passion to ensure kids entering foster care have the items the need and deserve! #nomoretrashbags #hoperaisersunite #eckerdraisinghope", "verenicee__": "@nickskidssoccer great program for underprivileged youth within the housing developments in Watts.", "foxg1research": "Thank you for being so generous! We would be honored for your donation to go towards our research to save lives. 💕 There’s a video on our website foxg1research.org that really explains how far every dollar will go to change the face of brain disorders beyond measure.", "mintyk_94": "@khalsa_aid Khalsa Aid International is a UK-based humanitarian relief charity (Registered Charity Number: 1163294) providing support around the world to victims of natural and man-made disasters such as floods, earthquakes, famine and war.", "keelyjames": "@thenoelfund is run by my friend @michellemchoate. It’s an amazing charity that helps fund adoptions for kids with special needs. They do amazing work!", "debserge": "😀", "bahamian.melanin.goddess": "My foundation Sickle Cell Warrior Haven needs funds SO badly! There is NO help in my area for people with chronic illness!", "tealrabbit": "please visit @caps_li 💙 we help over 20,000 students a year through our prevention education programs. Spreading awareness and giving children, educators, parents and the community tools to help prevent child abuse, neglect and bullying. We are only 5 employees with a ton of volunteers!! And we really could use the help. It would go so far for us. ❤️ We are in NY on Long Island. xoxo", "jack_a_kamphaus": "Love this! 💕 @lookingoutfoundation founded by @brandicarlile Happy birthday, Mindy! 🧁🎉🎈", "wendellhappyrock": "Camp Good Days and Special Times`sends kids with cancer and sickle cell to a camp in Western NY with other kids who have cancer for free.", "mccallchristine": "Please check out @smashsmard! Thanks @mindykaling!", "barwickjenna": "@fostervillagecharlotte", "schmabby76": "Binger center for new Americans https://makingagift.umn.edu/give/fund.html?fundCode=22053&desc_source=UUXXLAWCTRNA", "compassioncoversca": "Us right here! 🙏", "sullivansoprano": "@emergetucson could always use extra funds to support and advocate for victims of domestic violence in our community!", "binedise671": "@alohailhawaii could really use $1,000 to help Hawaii’s Disability community", "amykay14": "The Cat’s Meow Animal Rescue, because... CATS!", "insidethehoneycomb": "This is incredible!! Easter Seals is an organization that helps children and adults with disabilities by providing vocational training and recreational rehabilitation. It would be a great choice!", "jemac94": "👏👍🙏🎂🍾", "lupusontario": "@lupusontario", "veenascakery": "Neighborhood Elves - donating all proceeds to the northern Illinois food bank in Geneva IL- helping our fellow neighbors", "markieemoore": "The Cystic Fibrosis Foundation!!", "mxnita.h": "@nycalliance", "lorimoments": "I know I’m super late on this one, but if you’re ever looking for somewhere to donate, check out @theirc . I believe 93% of proceeds go to the people who they are raising money for. They have the lowest administration overhead I’ve ever seen. Good people helping good people. Check them out!", "kaycam26": "Happy birthday! If you are still searching for a perfect charity (they are all perfect btw) please consider @curesmaorg my son was born with spinal muscular atrophy type 1. A lesser known disease that takes our kids before they are 2. This organization helps new diagnosed families and helps with research that impacts our community. Such a great cause. Thanks for the consideration 💖", "peteyblockz": "Under this post comment @mindykalling you NEED to see @tinyblessingsnonprofit❕❗️♥️ #blessings #keepitgoing #payitforward #supermom @rubystylocrystal", "arbailey2188": "@mindykaling i am a teacher who runs three NHS at my school and they LOVE volunteering at @fmsc_org", "jcwiegel": "Please donate to @smashsmard !", "dressforsuccessyyc": "@dressforsuccessyyc", "littlebitofmonica": "Covenant to Care for Children doesn’t have an Instagram but we’re on our way to helping 1M children! We provide children who are placed in the foster care system get the critical goods they need to thrive (school uniforms, sneakers, backpacks, beds, etc) as well as provide goods to help reunite families and keep children in their homes. I think this is a wonderful idea and I’m loving reading through the comments and seeing all the causes people support!", "dorothyzittel": "@theyoungcenter !!!!!!!!!!!!!!!!!!!!!", "thehausofdogs": "Happy birthday! Please donate to @threelittlepittiesrescue They save thousands of dogs from euthanasia by rescuing them and transporting them to the Pacific NW and as far North as Canada. 🙏🏼🙌🏼", "jujumomof3": "St. Catherine of Sienna Orphanage in Mumbai, India. It’s a home and school for street children.. and a remarkable place.♥️", "mommasohn": "Wow!!! Thank you @mindykaling please look into @libertyinnorthkorea @olive.crest @independentschoolalliance", "younghearttuna": "Equal justice initiative! @eji_org 💗🎉🍾", "ephemeralframes": "Perhaps to some of the lawyers that need to make their way to the concentration camps at the borders? They have an organization that’s accepting frequent flyer miles to get them there.", "iammonnie23": "Happy Birthday Mindy🎉🎉👏🏽👏🏽👏🏽👏🏽", "paige.wittenhagen": "@dcfof 🙌🏼💜", "stacystyves": "@raicestexas is working to help immigrant families and victims of this inhuman family separation policy. I know they would appreciate your generosity! Happy Birthday! 💕", "picklesgivesgiggles": "Happy birthday Mindy. You are so sweet. My mom is a huge fan of you. She watches and rewatches your shows and movies, and cracks up at your books. My mom adopted me last Nov and we love each other so much. I was saved by Lil Paws Rescue (www.lilpaws-malteserescue.org) from being tied up outside under the Texas heat and barely getting fed. The Rescue also brought me to miracle groomers and vets to help me with my tangles and urgent medical procedure on my wee wee. If it wasn’t for Lil Paws Rescue of Austin Tx, my mom and I may not have met. Please consider donating to this miracle organization and helping my doggy friends. My mom and I love you, Mindy. 🐾❤️🐶", "irinaarora": "How sweet! Please do check out @horizonsgreaterwashington . They provide summer school education in STEA(Arts)M field for children below poverty line.", "kaymariieeee": "@rosedynastyfoundation is amazing!!", "tatiana_yosei": "@mindykaling I suggest @bounty_and_soul !! A non-profit organization that is revolutionizing health through supplying access to fresh produce at no cost in addition to health and wellness classes and yoga to the sweet community of Black Mountain❤️❤️❤️", "fosteringhopeofmusk": "Fostering Hope helps bridge the gap for foster children with supplies and support when they are taken out of the home.", "chane.g": "@cancerassociationofsouthafrica @mindykaling", "jus.b.woad": "@girlsonbikess", "wanderlsting": "Happy birthday! It's incredible that people this kind exist in the world. @rosedynastyfoundation could really use your donation, they're an incredible resource for LGBT youth!", "merlej23": "Great idea!!! Www.macular.org - AMD is the biggest cause of vision loss!", "tyler_horace": "@1justcity has changed my life. 💖 The amazing work they do empowers and enables so many folks living with poverty in Winnipeg! And guess what - we’re celebrating our 1st bday on July 1st! 🥳💜 @mindykaling 🍰 🎈 HBD!", "iron_beauty": "@mindykaling you need to see @tinyblessingsnonprofit ❕❗️♥️ #blessings #keepitgoing #payitforward #supermom @rubystylocrystal", "rileyday14": "@girlupcampaign", "ward.louisa": "Days for Girls, they’re on Instagram!", "prisonbirth": "Wow!! So compassionate ❤️❤️. A $1000 gift would provide pumping supplies for a year to the postpartum mothers in Tutwiler prison expressing milk for their newborns. It's one unique mothering contribution they can continue to make to their baby even when they are separated. @prisonbirth", "rarenewengland": "❤️", "prtybrneyesbk": "Can you plz donate to Sjogrens Syndrome Foundation ❤️❤️❤️💋", "cherylelizabeth7959": "The kindness that is slaughterhouse survivors ! 🌹", "irmitalinda64": "Happy birthday🎂 our Veterans need all the help #veteranMom", "therealbula": "How sweet!!! I love your idea! Happy birthday, Mindy! 💖", "apecl22": "@jonathansgivingtree could use $1000.00 to start off their new nonprofit.", "epworthstl": "Would love to provide more information about how we support our community and make it our mission to impact thousands of lives in the St. Louis community! Help us #endyouthhomelessness", "carlamlowery": "@angelsclosetcharities could purchase new clothing for at risk and in need students!", "umomndc": "This is an amazing idea! ❤️", "zozzzzzzy": "A charity to help refugee children trying to enter the US. Images I have been seeing are so so heartbreaking.", "alexastev": "Happy Birthday!! 🎉🎂 💃🏽please consider a new amazing nonprofit called Therapists Beyond Borders!! We love you!!!", "marychasewrites": "The Night Ministry in Chicago is an amazing organization that helps homeless people, teens and single moms with food, shelter, and healthcare. What a beautiful idea @mindykaling. So happy you’re in the world making it a better place.", "karadavis": "You are a jewel among people!", "meredithm08": "Worthdays - such an uplifting and amazing group in Richmond, va focused on celebrating children in the foster system.", "thereal_das": "@gemsofnj", "scoullidesc": "Great idea. How about perennial farming initiative.", "jilllerner": "@stlfgives provides funding so youth in crisis can go to wilderness therapy and heal in nature, rebuild from the ground up and learn to love themselves again! Small but mighty organization - your gift would make a huge difference!", "heyits_lj": "donate to @anadhelp !!! an org doing a lot to help people recovering from eating disorders!! the mental illness most likely to lead to death :(", "thethornyrosesjewelry": "Please donate to @campronaldmcdonald 🙌🏼❤️❤️❤️❤️", "pnoah25": "YourMomCares #ymc www.yourmomcares.org", "sarahchverchko": "This is fantastic! There are two grassroots charities in Pittsburgh that I support as much as I can because I feel like it’s these types of organizations who can really benefit from financial support - @fosterloveproject and @beverlys_birthdays. Foster Love Project makes sure that kids in foster care have things of their own and a bag to carry it in, instead of being forced to use garbage bags. Beverly’s Birthdays provides parties and gifts for homeless children. Both do awesome work.", "janekanan": "Love this! @crisistextline is an amazing organization offering free immediate support via text for those in crisis. Just text HOME to 741-741 #crisistextline", "lynnsky1": "@anadhelp helps many of the 30 million in this country who suffer from eating disorders. ANAD provides free support services to keep someone from dying every hour from an eating disorder. Please donate to this worthy cause!", "_yothatsgen": "@allpeoplesla", "ingridk27": "Happy birthday! The Ron Foley Foundation does amazing work fighting pancreatic cancer! @ronsrunfortheroses", "plattalison": "@mangomaterials", "cindeerood": "@formidablejoyorg ❤️🇲🇼💧", "idamarie73": "@helpingushelpher would be a great place to donate. ❤️", "jamielauren78": "Happy birthday! I would like to nominate @chemocars which provides free Uber rides to patients going through chemotherapy. The average ride is $12. That means your $1000 would provide 83 rides for people that need it most! ❤️🚙", "winter.wooly": "Hi Mindy, I have a rare/terminal genetic condition that is incurable, if you’re still looking for donation ideas the NBIA Disorders Foundation could use some attention! ❤️ Happy birthday!", "kristyj8989": "Donate to make-a-wish please", "malbubarbidoll": "What a beautiful idea! Happy Birthday, enjoy your wonderful contributions to humanity... @rosedynastyfoundation is a wonderful choice, if you’re still looking to donate! ❤️❤️❤️", "thurmomma": "Happiest of birthdays! 🎂 Please consider Kidd’s Kids! @kiddskids ❤️", "luisa0904": "@aydensarmyofangelsofficial", "kgrace1123": "That's so great! Happy birthday!! I would suggest @heiferinternational ❤️", "nas.bby": "You are amazing. If you can, please send to those who are suffering in Sudan 🇸🇩", "babytina37": "@anadhelp and @cf_foundation are amazing causes!", "mabell33": "@adelantemujeres", "eqmaidao": "So inspiring! Happy birthday @mindykaling 🎉🎉🙌💃!", "voneesanchez": "@borderangelsofficial 🧡💜❤️", "adw0224": "How about Animal Assisted Therapy Programs of Colorado? 😍🙌🏻", "edithsmum": "@bonecancerresearch an amazing charity", "afewofmonsfavoritethings": "@ronsrunfortheroses 💜💜💜", "connoisseurofallthings": "@tustinarvai if you choose this one, 2 dollars can save a life of one animal. Your money goes a loong way in poorer countries. Plus it's the most effective organization I know. What a beautiful way to celebrate btw!!! 👏❤️😍", "metal__momma": "@lillybumpus_giveforward is making such a difference bringing love and light in the darkest of times for children and their families effected by cancer.", "ipsi999": "@shesthefirst", "mrocco01": "@pvprogram", "jillystu": "@mindykaling I just admire you for so many reasons! This is amazing ❤️ Please know you inspire people every day!", "aliarsalem": "@facingabuse www.facetogether.org We investigate abusive religious leaders and expose them while helping communities cope with the fallout", "humbledesign": "Happy Birthday! We are a nonprofit in Chicago, Detroit, San Diego, and Seattle that furnishes and decorates homes for families transitioning out of homelessness. We have turned over 1,200 houses into homes so far with donated goods and plan to furnish as many as we can! 🧡 Our number one mission is dignity, while providing stability. 🏡", "pellerinsydney": "@charlieschampsfl", "mermaidmomma_": "Something to help the animals being abused 😭", "its_masoodah": "Happy birthday Mindy!!! What a beautiful idea💙 Please consider giving to two wonderful cancer charities, @cr_uk and @targetovarian", "11candlelight": "@wiseuv is the domestic violence and sexual assault prevention agency serving @dartmouthcollege", "meesh262": "TRAIN: Team Rescuing Animals In Need. It's a very small rescue operation that needs funding. We adopted our Millie through TRAIN. Wonderful organization. Thank you Mindy for considering my request. You are an outstanding and beautiful person inside and out ❤️", "jess_mulkey476": "Happy Birthday! You're so generous. I'm sure 40 donations have already been given. However, I would like to recommend the National MS Society for your future consideration.", "basicsme101": "Happy birthday Mindy! Blessings to you and your family. Would you donate to my favourite Canadian organization Start2Finish? It’s a running and reading program for children living at or below the line of poverty, building on their beautiful minds and physical well being. It was founded by former Canadian Argonauts 🏈 Brian Warren.", "shik76": "Happy happy birthday! @southasiannetwork would love your support! (And pls stop by for some chai and biscuits if you’re ever in the Artesia area - would love to introduce to our team and the work we do for the South Asian American community across SoCal.)", "meredithelliottt": "Happy bday❤️❤️ @anadhelp and @cf_foundation are the philanthropies for my sorority and they are absolutely amazing organizations that help others!!! My sorority, delta phi epsilon, put all of our love and dedication into helping others and we hope you will help us continue it!!", "snowwhite_aquarian": "👏👏🙌🙌❤️❤️happy happy 40th.", "anj1030": "@cystinosisresearchnetwork", "gbreal1971": "You’re a good soul🙏🏾", "majnar": "@soch_mentalhealth ❤️❤️❤️❤️❤️", "therealsuziem": "You're the best @mindykaling 💃💃💃💃", "incognegroebook": "Dope❗️", "zermidis": "@soch_mentalhealth", "frogstems": "@pffarizona", "underscore_underthescore": "@chai_lifeline an organization for children with cancer!", "thefallenangel2319": "Solar energy", "ksoliman24": "@coptic_orphans", "katdalziel": "@doctorswithoutborders ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "dr.iddel": "Happy birthday! I turn 40 myself in 5 weeks and couldn’t be happier. How ‘bout @mercyforanimals ‘cause animals are people too! 💚", "princess.chlochlo": "@twloha", "carmenfitzsmith": "💞", "snakenboot0991": "Wow. I hope one day to overcome my obstacles and celebrate my birthday the same way: helping others. I wanted to be jaded and make a joke but this is cool", "alcmilwaukee": "Birthday Buddies! We've been transforming lives through education for 40 years and would honored to have your support here in Milwaukee! Happy Birthday Mindy!", "r0ckin_robin": "You’re the bestest", "beccaere": "@cf_foundation", "mrs.b_realestate_at_its_best": "That’s amazing! Happy Birthday Episcopal Relief and Development", "lauriecooler": "@donorschoose Teachers ALWAYS need help!!!", "rashidawhitley": "@heychopart", "meganblackwelder": "Happy birthday! You are so kind! Check out @cf_foundation", "icdo.at": "ICDO is a NGO dedicated to #safeguardingdiversity and promoting cultural understanding through our projects worldwide such as #skinclusion with @priyankachopra & @obagimedical Check our instagram @icdo.at for more information. This is such a wonder gesture! Thank you Mindy, for suggesting a great way of how to celebrate birthdays! ❤️🌎👏🏻", "mrs_lockwood": "The Christy Thomas Foundation!", "jade_genga": "You = Life Goals. This is amazing. What a beautiful thing to do. @ktsupportgroup is an amazing group that helps people like me with vascular malformations. The surgeries are many and costly. They could always use some love. ❤️", "gorgeouscaos": "Not sure if you already picked your 40 yet but tearfund.org.NZ is amazing! Disasters and Peace building! The amount of people they help with their bare hands is incredible 🙌🏻 @tearfundnz", "mixilla": "Happy Birthday please consider #ataxiatelangiectasiachildrensproject", "marisalspad": "They are shutting down the Maternal Fetal Medicine Clinic I’m Windsor On Canada. At risk moms will have to drive almost 2 hours. Please help - Happy 40th", "hii_its_zarina": "ARF Hamptons please consider this animal shelter they save pets from kill shelters in the south. With this money they could continue there mission to other countries", "la_lanimoo": "@mauihuliau 🙏🏽❤️🙏🏽", "clarkieswifey": "Love this idea! You seem like such a beautiful person inside and out! Personally, End the Backlog (an initiative of the Joyful Heart Foundation) would be one to consider. ETB aims to eliminate the extensive backlog of untested rape kits nationwide and enact rape kit reform laws in all 50 states. Watch I Am Evidence on HBO if you can. Its unreal. Xoxo ❤️❤️", "wilcoandwiley": "Please consider donating to Rachel’s challenge. It is a school program to reduce violence and spread kindness and compassion.", "heyrozitsme": "The charity of my life! Taking classes ta Groundlings is expensive! 💙😁⭐", "fitandhappywithcassie": "@dognetworkingagents", "shadowthewondercat": "@lungcanceralliance. #thumbsupforannette", "briannass_closetttt": "How amazing is this 🏆", "flwrchld00": "🙌🥳💕 WOW, @mindykaling , that is so generous! How about Weave? https://www.weaveinc.org/ (BTW currently rewatching The Mindy Project as we speak 😂)", "kaitmar24": "@stjude", "jimmy_the_crab": "Planned parenthood!!", "lara23gabriel": "Happy Birthdayyyyyy", "yourmomcares\nVerified": "Verified", "sylviekaver": "YourMomCares!!!! @yourmomcares they’re changing the game for kids mental health across the nation 🙌 #mentalwellness", "franklinsfoto": "She Should Run! An amazing organization dedicated to supporting and encouraging women to run for office. https://www.sheshouldrun.org/ @sheshouldrun", "bouceratops": "@mindykaling you’re amazing. @musictherapyride @musicheals_ca can use some help!", "sageandflax": "You’re amazing—love this idea!! Happy birthday! 😍👏🏻👏🏻", "mollymooves": "Donate to @changingperspectivesvt — helping to foster more inclusive classrooms where kids can celebrate their differences!", "amylohr1": "International refugee assistance project....❤️", "sokoleyecare": "@onesight 1 in 7 people in the world can not see and are unable to obtain eye care. That is about 1.1 BILLION people! OneSight is an amazing organization working hard to give vision and sight to the world. Their motto is \"We will not stop until the world can see.\" They've sent me to so many remote areas in the world to help and are making a HUGE difference!! Please consider them!", "mrsfeliciajacobs": "@wwp @makeawishamerica @stjude and any reputable autism support network. ❤️❤️❤️", "katiejbush": "That’s awesome! Happy birthday! I think any foster care families or organizations would be amazing. Or @kingsclosetdfw - we help the homeless in downtown Dallas on a weekly basis 😍💕🙌🏽 whomever you choose will be amazing", "collz624": "How about a very small charity called dogsonborrowedtime. It’s located in Grundy County, TN where there is no animal shelter and lots of dogs living in deplorable conditions. $1000 would be life changing for them and these dogs. Just a thought. Happy Birthday!", "lialzheimersanddementiacenter": "Happy birthday Mindy! Our day program participants and families living with Alzheimers and other forms of Dementia would be SO appreciative of your support to continue receiving respite, stimulation, support and resources. What a wonderful gift you are providing to those in need - you are a true inspiration and role model. Please visit our website and call to learn more! www.liaf.org", "fiverchildrensfoundation": "Hi Mindy! Happy Birthday!!! 🎉 It’s so exciting that we were tagged by some of our supporters. Here’s a little info on who we are and what our impact has been on New York youth! 💚🐇 The Fiver Children's Foundation is a comprehensive youth development organization that makes a 10-year commitment to children from underserved communities throughout New York City and central New York. Through character-building (social emotional learning & GRIT skills) summer and year-round out-of-school time programs, Fiver empowers children to make ethical and healthy decisions, to become engaged citizens, and to succeed in school, careers, and life. Since our inception in 2000, 99% of program graduates have graduated from high school; of those students, 80% have gone on to enroll in college or enter the military, many being the first in their families to achieve this milestone. 95% of first year students report learning that it's okay to be different; 97% of 6th grade students made significant gains in positive attributes linked to long-term thriving; 80% of middle/high school youth believe Fiver has been a positive turning point in their lives; 97% of 8th grade students can recognize what makes a healthy relationship; and, 92% of youth reported doing at least two things at camp that were “courageous” because they did something outside their comfort zone at camp.", "cominghomecafe": "@rainbowrefugeecanada", "knoppcorn": "Consider donation to @wpa_nyc, a NYC based org that empowers women to redefine their lives in the face of injustice & incarceration.", "holdingem": "IMG_1374.jpg - can’t say no to all THAT preciousness!!", "niksroach": "@eji_org @innocenceproject @rainforesttrust @global_wildlife_conservation @conservationorg @plannedparenthood @rare_org", "g_freerunnin": "@vitalvoices", "robinafolson": "Kitten Associates! Link in my bio. We take in the tough cases. 💖👏🏻👏🏻👏🏻", "lana_in_the_sky_with_diamonds": "@coreartshackney is a mental health charity that teaches art, music, gardening and loads more! They saved my life and would be so grateful for the donation xx", "pippa_vgang": "@mindykaling Happy Birthday 🥳🥳🥳what a wonderful thing to do! @slaughterhouse_survivors could do with a donation they have just rescued 160 pups recently from the evil dog meat trade in China.1000$ would really help them thank you 😊 🙏🏻", "ausomeottawa": "@ausomeottawa", "christibrady": "@marthaskitchensj They serve meals on-site and by sending them out to other nonprofit organizations throughout the south Bay Area in California. They have a small staff and rely on volunteers but are able to serve a half million meals a year! They would be a great organization to donate to and your donation would feed many people in need.", "katie_olivia418": "@tomorrowfund", "thedrewfund": "@thedrewfund !!!", "michellecmakemove": "Donate to www.HeartFoundation.org, They helped people that have been burned out of their homes who don't have Fire Insurance. @MindyKaling", "bethmart521": "Compassion can't wait, a charity that gives financial assistance to single parents with hospitalized children because often they have to choose between working to pay regular bills and being with their sick child", "katarend": "Ily", "kasharena": "@wfpusa", "keelie_ariel": "I'm not a charitable organization but I could definitely use $1000 to help pay off my student loans 😁", "abbeynpups": "Muttville!!", "of.earth.and.salt": "A beautiful idea. @ancientsong is a doula service in Brooklyn that is dedicated to the health and wellness of pregnant and postpartum black people. 💜", "amandabeckendorf": "Sorry @susiesseniordogs #susiesseniorsdogs", "whitney_dk": "@aclu_nationwide Happy Birthday!!!", "sooz.q": "Daughters of worth is a great nonprofit. Hope your day is wonderful, thankful for all you do! You rock, Mindy!", "anniemohan": "@foodbank4nyc!!", "mollieelana": "@together.rising and @pancan", "altincva": "@heathbar2012 wow thank you. This is so awesome!", "ruttingers": "Excellent! I don’t know you but I’d recommend @miryslist and @writegirlla", "kdlew11": "@promisingpages in Charlotte!!!!! 📚 #raisingreaders!", "_lyn_5210_": "@zebrastrongcarepackages could sure use the help, they are doing wonderful things to bring smiles to amazing people❤️", "hayjolee": "Welcome to the 40 club!!🎉@projectschoolhouse is a great organization that builds schools in remote areas in South America. Would you please consider checking them out for a donation?", "feihonduras": "@feihonduras", "itsramiroocasio": "Happy Birthday, mujer maravillosa! You are really the best!", "soniawiththelocs": "Seeking the Right Amendable Path Gwinnett County Ga", "true_.kori": "Please choose @aydensarmyofangelsofficial 💫💞", "gabysolis404": "Happy birthday💙", "marciabrookspooler": "@thebremfoundation Mindy please consider donating to this amazing organization!!!", "salea87": "@journeyautism thank you for remind us to be kind to eachother HB beauty from 🇫🇷", "nightowlinraleigh": "@momsrising is doing great work for moms and families across the nation!", "margaret87s": "RAINN. Happy birthday! 🎈", "nitapic0604": "This is amazing and so are YOU!!!👏🤗❤️🙌 Please donate to @highesthopesfoundation ❤🧡💛💚💙💜", "rh329": "@iava", "leticia.vargas.pv": "Happy Birthday Mindy. Our non profit Quijotes of San Antonio provide free medical care to the underserved and under resourced in Oaxaca Mexico. It’s all on a voluntary basis. We take pre health professional students to help them be able to learn and think outside the box and to have compassion for serving the rest of their lives. Our fb page is quijotes of San Antonio and we have several YouTube videos. We have 80 volunteers that go and set up a primary care clinic and includes dental and optometry. We have also performed cataract. We see over 3000 pts in one week._", "keb918": "Baltimore Hunger Project gives meals to at risk children in schools to take home on the weekends. Happy Birthday!!", "caitlin.eleanor": "Excellent idea! @danafarber @thejimmyfund", "hottamolly22": "I wish I had the funds to be able to do this is ANY type of way!", "ventsmj": "@comfortzonecamp !!", "gdp_711": "@alotrolado_org, a Los Angeles-based legal aid organization is the most prominent migrant aid group assisting families at the Tijuana border. In addition to providing legal representation, counseling, and reunification support, Al Otro Lado also coordinates medical care and other services and supplies for these families. Please consider.", "akeyforathief": "@thorn", "maryssakaver": "@yourmomcares !!!", "reina.roxanne": "What an amazing birthday idea! @inetworkofhearts helps rehabilitate young girls & boys (ages 3-17) who are survivors of human trafficking. @internationalnetworkofhearts @jenhub 💖✨", "basia23": "@naomiandjack please and Happy Birthday!", "marina_diamonds": "@coptic_orphans", "alexacd": "@yourmomcares 😍😍😍 they are funding ground breaking programs for children’s mental health. Let’s change the dialogue from mental illness to mental wellness", "jayanadk": "@gemsofnj @gemsofnj @gemsofnj", "teekikae": "What a wonderful way to show gratitude for your life! Thank you for being such a giving person! And for being super funny and entertaining too!😊", "emilydolla": "@dognetworkingagents", "donnaphoto2": "Autoimmune diseases, like RA, Fibro, Parkinson’s, Epilepsy", "samra_iye": "Check out the incredible work that @sadienashleadershipproject does 🔥❤️✊🏾", "janines_adventures": "That is wonderful. They would be very grateful as a small charity that does great work https://www.synergycharities.org @alisaresslerpachella", "imani_morgan": "@theelmproject does amazing work for children with chronic illnesses 💕 they host a week long summer camp to ensure that these children live happy, healthy, and independent lives!!", "lrcohen4319": "Wow that is really amazing! @project.extreme could benefit tremendously!!", "lindzery": "My son, James @jamespmccarthy18 , was born with an ultra rare genetic disorder of the CNTNAP1 gene. He recently turned one and has now outlived the life expectancy of children born with this disorder. Because of this genetic mutation, James' brain has a hard time communicating with his muscles. His vocal cords are paralyzed, he has very low muscle tone, eats through a gastronomy tube and breathes through a tracheostomy tube in his neck. Our sweet boy is the strongest baby I could have ever imagined and I thank God for that every day. Please help find a cure for our son and donate at JamesCure.org #cntnap1 #jamescure", "lmurchie": "@mindykaling This is great! Please consider donating to some smaller organizations too like @newsanctuarycoalition or @alotrolado_org that desperately need funding. Thank you!!", "may_highway": "This is amazing! Please take a look at @ourrescue - it is an organization that rescues children (and adults) from sex slavery around the globe!", "myhopebag": "Happy birthday to you! We are a grassroots organization that provides bags of comfort and 1-on-1 emotional support for women diagnosed with breast cancer. We are a volunteer-run organization with the belief that no one should have to face cancer alone. With that $1,000, we could provide free preventative mammograms for TEN uninsured/underinsured women! What a fun way to celebrate your birthday, @mindykaling!!! HBD.", "welcome2sarcasm101": "If it's not too late! @mindykaling You should donate to @campkesem. It's a free week long camp for children affected by a parent's cancer. It's completely fundraised and organized by college students across the country. #lovekidshatecancer 💙💚💙💚", "mreilly1988": "HBD @mindykaling !! 🧡 How about the American Foundation for Suicide Prevention? My chapter would love a donation! https://afsp.donordrive.com/index.cfm?fuseaction=donorDrive.event&eventID=6371", "maymarigold": "@campkeseminutahvalley it’s a summer camp for kids whose parents have cancer and gives them the opportunity to be a kid again!", "mcfiercen": "Happ birthday beautiful!!!", "womens_voices_now": "Us!", "appetaizing": "@mindykaling HAPPY BELATED BIRTHDAY!! @allhandsandhearts is a perfect organization to donate to if you’re still looking for an org to donate to. They do such great work.", "howimet.cla": "Their is not enough money in the world for all the great organisations that need help, thank you @mindykaling for your generosity it is heart warming, I regret to see though in all those comments the main concern in the US is definetly not environment @greenpeace @wwf @fondationgoodplanet. If we don't learn to care for the planet, inequalities and injustice will grow stronger all other the world.", "lizzy_ellery": "@myhopebag delivering bags of comfort items to women with breast cancer. Offering support throughout the breast cancer journey so no one faces breast cancer alone. HBD @mindykaling ❤️", "e.orzbar": "https://action.aclu.org/give/donate-to-aclu-multistep", "jojolabow": "https://www.pregnancyloss.org/resources.html We are a volunteer peer support program for partners who have experienced pregnancy and infant loss. We offer both phone counseling and 6 week closed support groups in our NYC office. We run on donations. Please consider us. ❤️❣️", "agabyvillegas17": "What a wonderful initiative mindy! There is a wonderful effort for humanitarian aide for Venezuela on GoFundMe such as “Saving lives in Venezuela” giving food to malnourished babies and the hungry. Beautiful show of neighbors helping neighbors in crisis.", "stephemr": "Worthwhile Wear - providing a long term care facility for survivors of human trafficking. Worthwhilewear.org", "christea4": "How about a group that helps Puerto Rico recovering from hurricane Maria ?", "rowejh": "@mindykaling you’re so awesome and inspiring to working mothers!!! How about @pink_doornonprofit!! It benefits women who diagnosed with cancer and need financial assistance during their treatments. I’m an oncologist and I know it’s hard on these women bc they are trying to make ends meet, taking care of their family and also fighting cancer at the same time! ❤️❤️❤️", "ryry_sunflower": "Happy Birthday! A foundation that has changed my whole world is #BabyQuest because of them I have my beautiful 2 month old daughter Noelle. They help dreams come true by filling the gap on expensive fertility treatments!", "micaelaellaella": "@mwanavillages!!", "sweetnickers": "@thestreetdogproject", "nancygwany": "What an incredible idea! Please consider donating to @coptic_orphans They're an incredible organization that works with children in Egypt who are otherwise overlooked. They give them an opportunity at a better life in hopes of creating a better future for the community", "_virgo_vegan_": "@bounty_and_soul end food poverty!", "mayajlandrum": "❤️❤️❤️", "drjenlabrecque": "ASPCA! Show some love to man’s best friend 💜", "noel_growingthroughmusic": "Happy birthday! ❤️", "i_am_mama_o": "Happy birthday! @friendsofaccion could use your donation to help start a facility to house and feed up to 12 young women from the Yucatán in Merida, Mexico so that they might further their education at the University. University is free, but many can’t afford to live in Merida to take advantage of this free education.", "addy_ignite": "Happy birthday❤️! Please look at this charity, it helps fight ovarian cancer and supports families who have lost a loved one. https://dianneoxberrytrust.org/", "maddymarziani": "@mmdm378 she should donate to Texas Civil Rights Project! Do they have an Instagram?", "alikirchen": "💗 You! You may remember me from that time at Universal when I spotted you from the tram tour & shouted, “I love you Mindy!” 😁. #SpecialOlympics.", "scontreras23": "The young center for immigrabt childrens rights! @theyoungcenter", "yonit115": "Amazing. You are amazing", "projectopenpaw": "@mindykaling Project Open Paw! Please! 🐾❤️", "rique_fox": "Achieva #LoveLikeTheBoys", "kimy_luvs_pups": "This is so generous! Please consider @bestfriendsanimalsociety and @farmsanctuary They do so much to help rescue animals and allow them to live peaceful and beautiful lives.", "kristib1001": "St Jude’s Hospital", "liza_buck": "This is beautiful. Experience Camps for Grieving Children is a wonderful camp for kids who have lost a parent, sibling, or primary care giver. @experiencecamps", "igmontoya0711": "Happy Birthday! @riseforrohingya would be blessed to receive such a gift!", "nicole.681": "Please consider the animal shelters @spcalowersouthcoast, @huskyrescuekzn, @a.hogs.life.volunteer Thank you 😊", "beetsandbebopmediallc": "This is a great idea @mindykaling ! I'd just researched charities dedicated to helping reduce the mortality rates of African-American women who die during childbirth and I came across the National Birth Equity Collaborative. I'm still researching, but considering the statistics concerning the number of African-American women who die during childbirth, I definitely hope it's a cause you consider supporting as well. Happy belated birthday! I hope that you enjoyed the day. ❤️", "kshambles": "@helpusadopt brining the joy of children to those who can’t afford the exorbitant adoption fees!!!! 😘 happy birthday!!!", "_maryhanley": "Make a list of all 40 organizations when you’re done and share it with us!!!", "hope.ilicious": "Wow🙌😍", "lauraellenwolfe": "The Coulter Hampton Foundation in North Georgia financially and emotionally supports families whose children are very ill. Bills, gas cards, medical supplies, food, or whatever they need. This is a local charity created by a dear friend of mine who lost her son to a blood cancer and was so well supported by her community. Please consider a donation! I can direct you to the correct people.", "ashleyalexy": "Happy birthday! Please consider @ancientsong ✨", "christinaduvarney": "Consider donating to the @beautifuldisasterclothing non profit. They actually help individuals who need extra support and the money goes directly to the women instead of getting diluted. They put food in refrigerators, turn utilities on, pay deductibles and so much more. Brand new foundation that needs the help getting started. Email christie@bdrocks.com and thank you for what you are doing!", "katkookiee": "@coptic_orphans", "jmcdaniel702": "@aydensarmyofangelsofficial help families that have children who are battling childhood cancer. They would greatly appreciate this blessing", "missmaryann10": "@mindykaling @becauseisaidiwould kept promises=action for change", "mariahproctor": "That’s amazing of you to celebrate that way! @risingstaroutreach is doing truly amazing work helping the leprosy affected in India become self-reliant. They help beggars become business owners and totally change their lives and their sense of self.", "brittmatthie": "Connect Youth Inc. in Canada! We are a non-for-profit who helps youth ages 14-24 get connected with local agencies when they are struggling with concerns such as mental health or homelessness. We also have 2 homeless apartments for youth to stay in for 21 days time while transitioning to a stable homing environment and a high school lunch time drop-in program that feeds approx. 20 students a day.", "beyonce_jr._jr": "Trump reelection fund.", "crystalanntyler": "Please consider Kids Get Arthritis Too! Nearly 300,000 kids have juvenile arthritis here in America but sadly some states don’t even have a pediatric rheumatologist. Some kids are confined to wheelchairs, have to have hip, jaw replacements before they are even 10. Any donation to the foundation would be amazing!! @mindykaling", "mixedgirlinthisworld": "@aydensarmyofangelsofficial", "aly_inthecity": "I love @sheshouldrun", "katiehood21": "@worthdays is an amazing org that celebrates kids in fostercare and makes sure they feel loved and cared for especially on their birthdays", "anoellef28": "JDRF", "kasilenka": "I love this! @alzassociation 💜", "bluestockingbombshell": "@campuniversity helps special needs adults in south Texas.", "melody45k": "My college debt fund 😂", "shellywalker89": "@compassion", "carmhag": "Upwardly Global. Happy Birthday!", "cynthiapegado": "Mindy, loved seeing you in Las Vegas, discussing creativity at the Realogy event. Happy, happy 40th! Thank you for your gifts of uplifting others. I use visual art & dance to help people of all ages/abilities/disease conditions discover self expression. Please consider a gift to ArtPark Bridges program at @artparkwny or Art Moves Me program @bpartcenter. Thank you!", "bmfecteau": "Special Olympics!", "kaikarissa": "❤️❤️❤️❤️", "omg_its_jc_kaos9": "cancer research UK", "ecrowgey": "That’s incredible - and you don’t look 40! HBD!", "bart.lit": "@girlsincchicago", "thayerita": "ACLU", "cookie.cooper": "🥗🥬🍅 @bounty_and_soul is doing the most good to bring produce to the people!!", "hakuna_matala": "@portlandpromise!!!", "stephgbea": "Happy birthday. Please donate to the kings and queens at @rafikicastle its for abused girls and boys in Kenya and they need all the help they can get xxxxx", "socialnys": "Goals", "maureenfox": "Wow, good for you, Mindy!", "0tt33": "@momentofmagicfoundation 💕💕💕", "bekpak": "@wpa_nyc, the nation’s first service and advocacy org for women with criminal justice histories.", "kml0045": "Autism speaks!", "thegoldengirlsgram": "Happy Birthday! @slaughterhouse_survivors could really benefit from your very generous donation!", "boosbakes": "I am inspired by this great gesture and will follow it with my own humble donations of 50 for 50 in April. Happy birthday! If you still haven't found all 40, I would recommend puertoricorecoveryfund.com the island is still in need if funding to help revitalize it.", "lizzyecr81": "@arthritisfoundation", "annonymeous": "@together.rising", "shajushealuv": "@generosityglobal for reminding us of basic human dignity, because being have access to clean water is a right for all. Their latest addition of a mobile shower unit for the homeless speaks is amazing! $1000 would allow them to serve so many more because the team relies on volunteers to make impact happen.", "kimbelcher": "Operation Mend", "mrs.payne916": "Team rubicon is a great one", "cameracrazymomma": "Happy Birthday! My favorite charity is @beverlys_birthdays they provide Birthday Parties to kids in need.", "aliciabhamilton": "@programavelasco", "officialkat6a": "Wow, there really is so much kindness in the world and in people’s hearts. You only have to scroll through these messages to see that. What a wonderful birthday gift to give, not just the monetary donations but being reminded of all the good deeds in the world. Happy birthday!", "katie.chmie": "@safepassageproject provides free lawyers to refugee children and could use $1000 to take on more clients! They already provide legal representation to 950 young people but more children still need lawyers in the immigration process. Without a lawyer a child has a 87% chance of being deported, but with @safepassageproject they have a 90% chance of winning their case and staying in the US", "chlomofosho": "Mindy! I likely am way too late, but I am doing veterinary volunteer work near Kathmandu, Nepal this summer! I work for the KAT center; a shelter and clinic for street dogs. They are doing amazing work there, but are barely scraping by financially. Any help would be so so amazing! 🐕", "jennyleighmayer": "@ancientsong", "theselectivehoarder": "Sony’s to st Jude’s and compassion internatioma", "ctlaurenadele": "What a wonderful way to celebrate. RAICES is a great start. How about PLANNED PARENTHOOD.", "csissom48": "@mindykaling Yey for a really awesome birthday celebration idea! Please consider boys hope girls hope of St. Louis! Super bright kids from disadvantaged backgrounds apply and if selected are moved into our residential houses and we send them to college prep high schools and support them to and through college while partnering with parents! It’s a wholistic program developing men and women for others though education Www.bhghstl.org", "justjjjjj": "@livingbeyondbc", "paperbackexchangebookstore": "Www.thetrevorproject.org ❤🏳️‍🌈❤", "jennrossum": "Cradles to Crayons. They are MA based!", "niki_nack87": "Happy birthday! Please consider donating to chiari malformation research. My daughter, and thousands of others just like her need a cure 💜 https://www.conquerchiari.org/index.html", "supercolbiemamma": "@mindykaling Hi, Mindy I hope you see our post. I am not a charitable organization. I am a momma of a super baby. We do need monetary help but I'm not here to ask that of you. I am a big fan, have been for quite sometime. My little Colbie just had brain surgery Monday. He has a very rare brain disorder. I'm not great at blogging on my little nugget but I have shared him and his story. Although, I don't post often as my nugget is 7 weeks old and has already gone through many medical procedures. I don't want sound like a begging woman. I am simply a mother trying to help her family. We do need help greatly HOWEVER, just sharing our story, our info, can help us reach our gofundme goal. I have ideas to help us too, like bake sale, car wash, BBQ and also selling jewelry I make. I just haven't had help or time with Colbie needing major help. I pray you read our post and others too who have the power of their voice to share our #supercolbie. I hope you take a peek at his post operation picture. You can see the difference of how much pressure was released from my little mans head. We love you and thank you for taking a moment to read. ❤ I truly have a #supercolbie", "emily.lantigua": "@victory4kids Victory4Kids is a nonprofit organization dedicated to creating care packages for children battling cancer, making their days brighter while at the same time spreading awareness of childhood cancer.💛💛💛", "blessedlymade": "@victory4kids Victory4Kids is a nonprofit organization dedicated to creating care packages for children battling cancer, making their days brighter while at the same time spreading awareness of childhood cancer.💛💛💛", "trambambam": "@akdphi_if alpha Kappa Delta Phi International Sorority - empower women to empower women!", "wellseasonedtable": "Happy Birthday! Check out @bounty_and_soul they are doing wonderful things 💕", "budlant": "@victory4kids Victory4Kids is a nonprofit organization dedicated to creating care packages for children battling cancer, making their days brighter while at the same time spreading awareness of childhood cancer.💛💛💛", "dianejosie": "Medical missions of the divine mercy in Texas to help the Indians in Costa Rica", "bpal80": "@cureahc", "afarinr": "To give and not announce it, would be even better.", "paige_heyworth_": "Teal power ( a cancer research facility )", "miss_bee_13": "@twloha 🙌🏼", "nikaspoiledbrat": "@gemsofnj", "yyaldamatin": "please donate to @unicefsudan and @unicef_yemen", "sweetnectarsociety": "@sweetnectarsociety is a non-profit organization run by 2-photographers who provide cost-free photography sessions to medically fragile children. 💙 The mission of SNS is to encourage, celebrate, and advocate for children with serious health conditions. 💚 Sweeties receive clothing, photo keepsake albums and canvases. 💜 For some Sweeties, these are the first photographs of their story. For other Sweeties, these are the final photographs of their story. For all sweeties and their loved ones, these photographs are cherished memories. ❤", "rajaa_shoukfeh": "Karam Foundation does amazing work for Syrian refugee youth @karam_foundation", "helena_packer": "How the FUCK are you 40??? I'd believe you were 20 if someone told me", "kmmascari": "@mindykaling horses for heroes, cowboy up! It's in Santa Fe new Mexico & they're dedicated to helping combat vets & their families 💕", "northlightcommunitycenter": "Us please!", "ginargo31": "Please donate to Safe Horizon in NYC. Thank you 🙏🙏🙏", "andrew_meadows_": "This is why we love @mindykaling", "julesrevans": "Happy birthday.🎈 Precious Dreams Foundation is a great .org helping children in need. Thank you for your consideration @preciousdreamsfoundation", "typicallyatypical": "@art_180 helps children learn through art and collaboration! Happy Birthday @mindykaling!", "jessaaaadempsey": "@youngcareoz could really use your help 💐 happy birthday 😍", "kellywburgess": "Rahab’s Rope! HBD!", "o0brownsugar0o": "Operation Smile and St. Jude are huge!!", "erikarazzaque": "👏🏾👏🏾🙏🏾💚🌈🌷 My 40th today, and thought I knew Mindy and I were soul sisters. This really is wonderful!", "anjie_sk": "@thelittlethings_charity deffo could use that money in providing medical healthcare to developing countries", "themisshooligan": "@namicommunicate", "moemaybou": "Such a beautiful and generous ❤️ you have @mindykaling Happy Birthday! How about @nokidhungry", "daelwapo": "Donate to Altrusa International, Capital City, VA. We help different communities around our city. Check us out on Facebook", "math_rat": "@thelittlethings_charity", "emilyibrantley": "@casc_leaders is a great organization that is student run and student lead (for real!) their mission is to “develop skilled, ethical, and sensitive leaders of diverse backgrounds and cultures” through peer to peer training. They bring students from all over California to the state capitol to teach civic engagement by facilitating a process of identifying issues in education and having students present solutions they came up with to their representatives! They are awesome!!! CASC.net", "karriemooretorok": "Happy Birthday!! Candlelighters of Brevard is a wonderful organization in Brevard County FL who gives emotional support and financial assistance to local families who have a child diagnosed with cancer. Candlelightersofbrevard.org Highly recommended. $1,000 donation will go far with their organization. There aren't any pediatric oncologist in Brevard so families must travel to Orlando, Jacksonville or even farther to seek treatment daily, weekly & monthly for their previous child who is going through the most devastating time of their lives. I encourage you to learn more. 😍 Happy Birthday @mindykaling 🥳🥳🥳", "punkallina": "@ocspca 🐶 ❤️❤️❤️", "digitisedlipstick": "Focus on the small local ones that can really do with the help. Larger charities will just swallow that up 🙌", "avlythmission": "consider donating to @boy nty_and_soul a wonderful non profit doing amazing things in WNC!", "stibby1983": "@foxg1research @iff_foxg1 @foxg1_australia", "fireflymkz76": "Cervical cancer awareness", "therachelgill": "@ancientsong", "pattylandry": "Happy B-day!!!! Amazing idea 💗💗Children’s Aid in NYC working to help NYC kids and families since 1853 💗 childrensaidnyc.org", "nikiali1234": "Wow great - Doctors Without Borders!", "girlsbuild_org": "Girls Build inspires curiosity and confidence in girls 8 - 14 through learning real building skills—swinging hammers, using drills, wiring lights, plumbing, and more! We serve girls in the Pacific Northwest!", "destinychloe_snr": "Hey mindy. Please do checkout @badassmonkies_kl. We help the underprivileged. I know our name doesn't sound like a charitable organisation but thats the whole point of it. do check us out to know more details on who we are & what we do.", "mabelzorzano": "ACLU", "bb_dunlop": "Happy birthday Mindy oxo", "maddycarol": "@mindykaling you should check out @campkeseminutahvalley @campkesem they are a non-profit organization that provides summer camps (and year round support) to children and teens ages 6-18 who’s parents have, or have had cancer (or have passed away). Kesem in hebrew means “magic”. These camps are a week of refuge for these kids where they get to be around people who understand. Where they get a week to be kids, have fun, a week without doctor visits and being the parent of the family. Many of these kids are bullied and made fun of. I was a counselor there, and my husband is the direct of the Utah valley chapter. Many of the children report that Camp Kesem has literally saved their life. If you’d like more info I’d be happy to share! Or you can go to their official Instagram page, or visit campkesem.org 🤩🙏🏼 happy birthday 🥳💕", "cosgirl07": "InsideOut in Boise Idaho!! Rescuing trafficked girls right in the heart of Idaho! Amazing organization!!! @insideoutcares", "subi_suebee": "LUPUS FOUNDATION OF AMERICA.", "deepapatel_": "@childfirst_uk", "jennifer_chloe": "RSD (Reflex Sympathetic Dystrophy) foundation it’s not super known but it’s a chronic illness that dates back to civil war era. RSD is a incredibly painful illness that has no cure and a lot of doctors don’t know about it which is upsetting in itself. People who have this illness (like me) get looked at funny when they are in need of pain relief at the hospital but no one wants to give it to them because of opioids crisis and things of that nature. We just need the representation and the knowledge. It is also know as CRPS (Chronic Regional Pain Syndrome) thanks for the time of reading this. Hope you can donate.", "desiidee": "@family.promise works to eradicate homelessness for families with children! Please donate to them!!!", "dr.menije": "I likely to suggest @comfortcases a wonderful organization helping children in the foster care 💕", "thereelchelsea": "Trevor Project!!", "_raechl22": "@kindcampaign", "oddnno": "Hbd, Mindy👏💝", "pavithra_singam": "@thelittlethings_charity 🙌🏽🙏🏽", "takethescenicroutewithus": "PAWs and Old Dog Haven. Happy Birthday!!", "flyingvirg": "My suggestions are @animalsanctuary_tangier ❤️ @goatsofanarchy ❤️ @boochaces ❤️ @freedomfarm_animalrescue ❤️ @theorangutanproject ❤️🦄❤️🦄🙌🏼", "justlove_pictures": "Happy birthday! You can empower young moms working hard to graduate high school by donating to @teen_success 👩🏻‍🎓", "_sandy_roxana": "@supportkind", "jenniecubbies808": "@assistancedogsofhawaii ❤️", "lady_ironside": "@two_wings - At Two Wings, their mission is to empower survivors of sex trafficking to identify and pursue their dream vocation through mentoring programs, life skills classes and career training workshops, creating the path for a life of financial and physical independence. 🙌❤️🙏", "realteresam": "Happy Birthday!!! #fightcancer https://www.gofundme.com/f/y73av-tracys-medical-expenses&rcid=r01-156153151746-bef504fc90244f2d&pc=ot_co_campmgmt_m", "ceci.mirabal": "@victory4kids", "cdcarly": "Happy Birthday! What an amazing gift and amazing person! Please consider @whisperingwillowssds they are a lifetime senior dog sanctuary providing shelter, medical care, and most of all love until the senior dog passes. They specialize in end of life hospice care for seniors that have a short time to live, allowing some to experience love for the very first time. There are so many senior dogs that are in dire circumstances and need placement and currently they are at capacity. They are in the process of raising money for a new building on site which will double their capacity. I’m heading there this week to meet them in person. I hope you will consider them. But no matter which organizations you choose, thank you for helping others. ❤️", "chiquitaelita": "#whippediatriccancer", "euni_c21": "Happy birthday! @asiancinevision would be an amazing org that promotes API media by providing a platform for filmmakers like you to showcase their work and share their stories!", "_delicatestitches_": "Happy birthday!!! @thefamilyplace a non-profit organization for victims of family violence", "rosecoloredglasses0417": "Brilliant! Bringing light to so much work - @upliftfamily is a great one!! Supporting children and families with behavioral and mental health needs, many of whom are foster youth and in crisis. They also do family finding to help kids connect with family and have a chance to find permanent places to live! 💜 @upliftfamily", "gagnonke": "I hope one day I make enough money do I can give it all away, what a blessing. What a great idea Mindy! I suggest ASPCA, Trevor Project, Wounded Warriors, Malala Fund, Arts In The Armed Forces, Seattle Children’s Hospital, Free Mom Hugs", "leadershipeveryday": "@the_archway_foundation are on the campaign to end loneliness A wonderful charity based in Oxfordshire, UK", "charlenehwh": "Check out @girlsbuild_ girls.power.tools. Inspiring curiosity and confidence in middle school girls through teaching building skills in construction trade with female instructors and mentors.", "quotingtheservants": "We are trying to raise money for @foodforlifelondon so we can buy a new eco friendly van to feed more of the homeless across London! We have a long way to reaching our target.", "veronicajane7": "@lorijhurst I just love her", "naomilynn76": "@mymissiongive @tnorman23", "instapat2104": "@coptic_orphans this is such a lovely gesture @mindykaling", "nealavery": "Empowering limited income youth through our corporate work study program ➕ college prep ➡️ 💯 4-year university acceptance. We would be honored! @cristoreydelasalle", "charlijeani": "This is a mother in my community needed help to save her son. https://kdvr.com/2019/06/22/denver-couple-running-out-of-time-to-fund-cure-for-sons-rare-genetic-disorder/", "tpiorkowski": "Happy birthday Mindy! What a beautiful gift you are giving to the world! Please consider donating to Gift of Life International- they provide life saving cardiac surgeries to children in developing countries who don’t have the services. https://www.giftoflifeinternational.org", "letmegetuhhhhhhhhhhhh": "Innocence project", "13_ashley": "@allpeoplesla", "thebangaveragemum": "Happy Birthday Mindy! You are fabulous! @pandas_uk is a wonderful charity based in the UK who support parents with pre and post natal/partum mental illness. I have struggled with my mental health since having my daughter 17 months ago and their support has saved me.", "krissyh2": "@aydensarmyofangelsofficial", "dahl104": "@youthadvocacy1 We believe in giving a voice to youth and their families by helping to break the school-to-prison pipeline in the Austin, TX community. Youth should have an equal right and opportunity to finish school and attempt to be a productive citizen with no barriers or obstacles given outside of what they are already dealing with. @mindykaling thanks for putting a spot light in all of us trying to make an impact. Peace and Happy birthday.", "a2mellybelly": "CAIR", "madelinedomian": "Katie-Do Kare Kits!! Go visit www.katiedokarekits.com for more info! I’m the founder tehe! We would LOVE the help! Please consider this, and look up about this 501c3 Non- Profit Organization!", "sgofsd": "I really appreciate the work that @insightgarden does", "krystlemeena": "@carbdm — connecting families, kiddos and adults diagnosed with type 1 diabetes to support one another.", "frostymcnugget": "That’s wonderful! Happy birthday! You should definitely give to the @lablackworkercenter in Los Angeles, an organization that removes barriers that stop Black workers from accessing meaningful careers. It’s a transformational way to make sure that your donation keeps on giving. Their work is potentially a game changer for black women in construction on up to black women in Hollywood 💕🤗", "kajolv": "Greyhaven exotic bird sanctuary! I volunteer there it is an amazing place for birds and could really use the donation 😊 @greyhaven_birds", "aaallie.gator": "Does a grad student struggling to finance her last semester count as a charitable cause? 😂😭", "msluvnme1": "Home Rescue in Arlington, TX desperately needs something like this! It would help us save so many fur babies lives!! Please @mindykaling consider them for a donation!", "kimmerothy": "Hi Mindy!!!! Happiest birthdays to you!!! @surviv_her works to support women fighting cancer through connection, resources and research. $1000 would be a great bonus to help reach a research goal!!! Many thanks for spreading greatness and positivity into the world with these birthday gifts!", "nonicknamesara": "@coptic_orphans !!", "lorenagirl": "@mdaorg my cousin died at the age of 24 from this disease. He lived as long as he did because of studies and research that developed medicines that prolonged his life, yet were unable to cure him", "magdalenapantow": "Happy Birthday Mindy!! God Bless You n family🙏🎂😍🌹", "rachelbitan": "Thank you for the inspo. I just donated to raices and aclu", "margo.huizar": "You should donate to GLSEN! @glsen", "msduchess125": "Please donate and follow @thetroubledmovement!!!", "jour499": "Homeboy industries! They help people getting out of jail/leaving gang life get back on their feet by providing them sigh therapy, employment, and case workers to fight recidivism!", "mehriiinnnn": "@riseforrohingya 🙌🏾", "thezackpennington": "@savingsunnyinc", "kyggie": "To the ocean sea life.", "theemmaslater\nVerified": "Verified", "a.lxve": "@girlsonbikess", "michelangg": "@twloha To Write Love On Her Arms is an incredible one", "_ella18": "@riseforrohingya", "h2oliliana": "This is such a beautiful way to celebrate you!! Please consider @programavelasco They are making a huge difference by empowering women and children. I think that if you visit their page and contact @_annie_bea_ you will be immediately inspired and amazed by their work. Thanks for making our world a better place for all. Happy Bday @mindykaling 💛❤️💛", "ltrainor4": "@emotionsmatter @naminyc_metro helping individuals dealing with mental illness. #mentalhealthmatters #bpd #emotionsmatterbpd", "evelyncarriere": "TEXAS RIO GRANDE LEGAL AID @thasnazzle", "lovecoachleeanne": "Future Possibilities - Coaching underprivileged kids towards goals that give back to their community and the world! @fpk.canada", "dorianmonique": "@tomorrowfund helps children with cancer and not just treatment but helps to meet the families needs. @theizzyfoundation is amazing with helping families of children with cancer. @teamlillyfoundation assists families and children battling illness.", "miss_ashlea_baby": "American kidney foundation", "annacentrellathayer": "@junior_council", "hollymanonmoore": "ACLU", "caromvarner": "Happy birthday 🎁 and thank you for the inspiring idea 💡.", "ashumi.s": "🙌🏽🙌🏽🙌🏽", "laurenbernazzadoula": "@ancientsong", "shelleylamer": "I vote for the charities that help kids. I’m vegan and love the animal charities. As a mother with breast cancer I know for sure that this is an area in great need. But, kids, girls, they need our voice right now. They need the help right now.", "mamanotmymy": "@gemsofnj", "madalyn_fairholm": "Please donate to eyes open iowa. They are a no profit sex education program that helps other states as well due to the recent conservative politics in our current government they are facing a time where they may soon have to close their programs down. As the state funding for sexual education has turned to fund an abstinence only plan which we all know is in affective as well as push to restricting women’s rights. Eyes open iowa helps teens all over the country by teaching them how to have save sex and take care of their bodies. Visit their website for more information @ eyesopeniowa.org. Happy birthday Mindy I think it’s wonderful you are generously giving back to the world on your day. We need more people like you to bring change against the current political climate.", "emilyginn": "@givinggown is such a worthy cause!!!", "fannie_hndz": "@laredshield Please help our community! 🙌", "ktsteamboat": "Please donate to the charities that are helping the migrant children who have been separated from their parents! Happy birthday!", "squirrelsjustwanna": "The Innocence Project! ✌🏽 Happy birthday, beautiful! 💕", "arent_you_that_girl": "@maxfund", "jennepafer": "My best friend and another lovely mom are fundraising to find a cure for their rare ovarian cancer. https://cureourovariancancer.org/ca/our-stories/2018/ill-go-on/", "justpinkz": "Akdn 🙏", "mayaweintraub": "The Andrew McDonough B+ Foundation!! Helping kids fight childhood cancer", "brownieskillz": "Please give to this kind and loving family struggling through a tragic loss https://www.gofundme.com/f/in-loving-memory-of-tai", "carmentea_villanueva": "Happy birthday! 😁@queenscarehc", "holdenxonxtoxsmoke": "st jude’s my cousin died from cancer.", "gabrielshawn_l": "You’re so ahead of the times! Soooo inspiring!!! I pray I get to work with you someday!😍💙", "alanekataria": "You are the best, Mindy!!!", "whereisdalia": "👐🏼 yas! Happy birthday!", "dfmfrazier": "@projectmonashouse", "stacynekora": "@plannedparenthood", "ivettevallejo": "Happy birthday Mindy! It would be great if once you finished with your 40 donations. You could make a list of where you donated. You have such a platform and even by you listing where you donated... I am sure will inspire others to do the same! I am already going to look@up a few that have been mentioned already!’ Post a finished donation list and let that inform and inspire others! 💕💕🙌🏼🙌🏼🙃🙃😍", "glowinglites": "Raíces", "darlingdi21": "No sure if you are done. @projecthopefoundation is a school specifically designed for children to young adults with autism. Amazing program and cause. 🧩🧩🧩", "deb_reads": "@sgvhabitat", "susanjeehee": "@barbellsforboobs has helped my breast cancer survivor friend!", "veni_vidi_amavi___": "@mindykaling st Jude or lebonheur Children’s hospital!", "eashax23": "@riseforrohingya !!", "kkpina": "Local to LA— @miryslist and @schoolonwheels ❤️❤️❤️", "consentmeanshellyes": "@mindykaling DONATE TO OUR MOVIE! It’s woman led, written, and directed— ALEX, STOP: a pledge for ENTHUSIASTIC CONSENT! Link in Bio to focus the #metoo movement toward a #hell yes one!", "courageouskindfoodie": "@mindykaling Happy Birthday!!! 🎉 You are such an awesome and generous woman. I love your view on the world and the art you make! If I had a choice, I would ask you to pick Children’s Associate for Maximum Potential. They are an amazing organization that provides support and uniquely modified activities for children and young adults with special needs. You HAVE to check them out! You would be completely taken aback by all they do and the tremendous impact they have on these families. I would know, I am in one of the families— my brother was one of their first campers in the 80’s. They are always looking for volunteers during the summer! #childrensassociationformaximumpotential #campcamp #non-profit", "pokahontaz_17": "🇵🇷 @defensoresdeanimales.pr in PR 🇵🇷😍", "sanspeur67": "https://www.dallascasa.org/", "debrakdalton": "You are wonderful! ❤️😘🤗", "literarydeeva": "@learning_ally is a worthwhile cause. They provide audiobooks to people with dyslexia and other learning disabilities.", "mefishap": "HBD, Mindy!🎉 Thank you for your generosity!❤️@foodallergy Food Allergy Research & Education", "jjules1177": "I would love for you to consider Ronald McDonald House in Chapel Hill, NC. The House helps families of children with cancer. These kids come from all over the country to the cancer center at UNC. The families need a place to stay, with their other children that have to endure this summer while their sibling is going through treatment.", "pandaquack": "Happy birthday love you! I am a brand ambassador of Mary Kay Cosmetics and we have a non-profit charitable organization called The Mary Kay Foundation @marykaycares We donate to research for cancers that affect women and we also donate over $120,000 annually to womens shelters all over America! We are working to stop the silence of domestic violence through this wonderful organization!", "tasheena17": "Please donate to @metavivor #survivor", "cwudyka": "@bestfriendsanimalsociety Largest No Kill Shelter with a goal to Save Them All in the US", "jessicabaabit": "@kisstheatreco", "jannat_004": "@riseforrohingya", "goldenabbym0m": "Happy Birthday!!! Abiding Savior Lutheran School in Lake Forest could use new sports equipment and microscopes for science class.", "severed_rose": "@mssociety", "pia.hovenga": "The pad project", "erinn.elanor": "@girlsontheruninternational @neda @together.rising @aclu_nationwide", "mariamwahbaaa": "@coptic_orphans", "cdanadorsey": "You’re the bomb. Happy 40th to one of the best people in earth.", "aldemrqz": "Riley Center in San Francisco CA through St Vincent De Paul - offers shelter for victims of Domestic Violence @stvincentdepaulsf", "trentrood": "@formidablejoyorg !!!!!! PLEASE", "kdale63_": "So generous!! My fave non-profit is @rivermusicexperience in Davenport, IA. They provide music education to kids, mostly for free and with financial aid. No child should ever be deprived the opportunity to experience the joy of music! 🎈❤️", "4ikaika": "Happy Birthday @mindykaling❣️ Please consider donating to @pdsa_itp @pdsa_itp_oc 💜", "noodliescheezing": "Happy birthday! A good charity to donate to is spinal cord injury because not a lot of people know about it but it is very bad to have. I hope you like the idea!", "nicoleindo": "@pedalthecause", "jlhlue": "Happy Birthday 💛 Consider donating to these wonderful organizations please 💜 @borderkindness @helpamotherout @wpa_nyc @wagv", "eaforbes": "Love this @mindykaling @hbfdenver is an amazing nonprofit in Colorado that builds independence and elevates lives for people living with physical disabilities. HBF partners with the home building industry to leverage funds and resources to provide these life changes modifications at no cost to the recipients. For more info check out HBF denver.org!", "miriam_soliman": "@coptic_orphans", "elseaone": "I love all the passion in these comments!! And I picked up some new options for giving :) Thank you 😊", "flooredenjoyed": "@lookgoodfeelbetter does amazing work for women going through cancer treatment. They provide classes and tools to help woman who have lost their hair learn how to manage wigs and makeup. Happy birthday! ❤️", "darladixon": "I suggest @modestneedsfoundation because they help with the “stitch in time” needs that aren’t covered by disaster charities...like, the Catch-22 situation of someone needing car repairs but can’t get to job without the vehicle... but can’t fix the vehicle without the job! ...a little grant can help keep a family from a non-environmental disaster, but it could still have disastrous consequences if not nipped in the bud...", "alexdominic_": "AllOut is amazing! Their initiatives have been super powerful and effective in improving the lives of LGBTQ people all over the world 💕 🏳️‍🌈", "freemomhugs\nVerified": "Verified", "coffeewithgod2": "For a simgle moms group or domestic violence..would be nice", "craftwisecreations": "@RoseDynastyFoundation could do so much good with that donation...they help LGBTQ+ teens feel loved, wanted and respected, since many have been abandoned by their own parents. Happy birthday, and this is a great idea of how to give back!", "amickeyg": "You are amazing! Happy birthday! Please also consider supporting Angry Tias and Abuelas of the Rio Grande Valley. Thank you!", "missannemarie": "Mindy, check out https://safp.org . 100% of your donations go directly to the poor. They don't just give the poor food and shelter; the help them invest to become self-sufficient. They first partnered with a destitute family in India several years ago, and this family no longer needed our support years ahead of the projected schedule.", "cnmz04": "Please give to BlinkNow, to support Maggie Doyne in Nepal. It was started by a young girl in my little town of Mendham, NJ.", "jonhouston.wav": "If it’s not too late @lunchonme ❤️❤️ @reesewitherspoon @padmalakshmi @kaykaycannon @octaviaspencer", "amanda.petersonnewberry": "Call a school and ask what supplies they need. Sometimes funds don't always go right to the teachers or schools. Example would be asking your upper elementary schools, middle schools and highschools if the have a feminine hygiene closet for girls that need supplies while at school. Our secretary buys them herself and keeps a stock for our kids. Just a thought...", "yipi_me": "This is incredible 😍", "felicos": "@emubestbuddies is an incredible organization that pairs college students with people who have intellectual and development disabilities. They set up these friendships, have events, the best buddies often got out together. My old sister with Down Syndrome has had some of the BEST Buddies throughout the years. I’m so grateful for this program that brings real inclusion, opportunities, and friendships to so many people 💛👯‍♀️💛 @emubestbuddies ((Also a huge HBD to you))", "awiipeanut": "The Gentle Barn!", "coffee_after_midnight": "Hope For Paws!!!", "bellacornucopia_49": "Happy Birthday lovely! 💜Please give to @savethecherubs", "brilynne7": "@bravelikegabe would be a timely and deserving recipient!", "wylrose": "Help the @or.iorg in our goal to raise money for Shriners Hospital in Portland, Oregon. The International Order of Rainbow for Girls is a youth community service organization for young women ages 11-20. Our state service project is MAGEC (MAGnetic Expansion Control) System. MAGEC is cutting edge technology for children with spinal deformities.", "khoody8": "You are amazing! How about.... http://m.girlsontherun.org//", "boom_roasted27": "I'm a charitable org. That helps others🙂", "laikenwilkening": "@operationsmile is a wonderful organization, they provide life saving surgeries to repair cleft lip and cleft palates in underdeveloped/underserved countries allowing children to eat and speak functionally as well as be accepted into their communities. Operation smile can provide a surgery for as little as $240, meaning you could change 4 lives with a $1000 donation. Thank you! 🙌🏼", "mochafleur": "@girlsonbikess", "_emiltree": "@innocenceproject", "linds9190": "@pancan", "stopit_rightnow": "Happy birthday! Check out @compassioncoversca", "lizd3578": "@alstdi #endALS", "hannahpeck12": "My small, non-profit, rural alma mater (and current employer) @lindseywilsoncollege . We strive to serve the underserved students of Kentucky. Students from all backgrounds call LWC home. Many are the first in their family to attend college and even more thought the prospect of attending college was not possible. For a school like ours, every contribution helps in keeping our mission alive. #LWCisFamily  PS - Love your giving heart. And love your hilarious personality! You are the best!", "sesylea": "@top_sanantonio", "foxface82": "@shotatlife is my favorite, especially since I had kids ♥️", "lhtyf": "Please choose @lhtyf ! We’re a 501c3 nonprofit organization dedicated to children’s health and wellness. Our programs educate children about healthy lifestyle habits so they can avoid obesity, diabetes and hypertension. Check us out. Visit our website. www.livehealthyandthriveyouth.org", "laurenjesscarpenter": "https://www.kruznforakurefoundation.com/about", "ameerabdul": "@periodmovement", "laura_r_lloyd": "Happy Birthday! Donate to @appservproject", "heartbeat_jcp": "Smash SMARD !!!", "saiwhat99": "Thank you @mindykaling you are making a huge difference in our journey you have no idea!!! 💜💜💜", "taurusbabi": "So sweet @mindykaling St. Jude children's hospital to help kids with cancer", "dayle_w": "Awesome! How about a senior dog and cat rescue in Arizona! We are s 501 org. Forever Loved Pet Sanctuary - @forever_loved_pet_sanctuary 🐶🐱❤♾", "courtney_alis": "Wonderful!! @foreverlandfarm is a wonderful sanctuary which rescues animals (goats, lamb, bunnies, chickens, horses, goats, pigs, dogs, cats, pretty much any animal in need) to help give them a second chance at life. They have saved many animals from slaughter, abandonment, and shown each animal there HOW LOVED THEY ARE. It would mean the world to them, their followers, future animals, and current animals if you donated to them! The founders pour their hearts and soul into their farm all while both maintaining full time careers in social services. It would be a game changer for the farm 💕", "jossyhasinsta": "This is a wonderful idea @ai_artindeed is a local organization dedicated to helping children and youth express themselves through art! They do amazing work and have really provided an outlet for kids who otherwise wouldn’t have this sort of opportunity.", "tahoecourage": "This is the most generous thing ever! 💕🙏 We support children with anxiety and depression by teaching them mindfulness-based coping skills so that they can embrace and overcome their fears and self-doubts and learn the power of vulnerability, authenticity and self-compassion! 🙏", "simfeld11": "@standinguptopots for more research on POTS", "chelseadagger6": "What a wonderful thing! I hope to do something similar on my 40th:) @dravetsyndromefoundation is an awesome non-profit dedicated to aggressively raising research funds for Dravet—a rare, catastrophic, lifelong form of epilepsy. My sweet niece Anna banana was diagnosed with Dravet around 6-months old, and she’s now 21-months old. She’s had multiple seizures, with her longest seizure being FOUR HOURS long where she had to be intubated and in the ICU for a week. We won’t stop until we find a cure for her and all the little kiddos facing this difficult challenge! Thank you for all you do, including the laughter and joy you bring into peoples homes:)", "annsterpannster": "@daysforgirls donates period kids to school girls in developing countries so that girls are still able to attend school when they get their periods, thus helping to end the education gap and the wage gap and end the poverty cycle", "anneattinger": "Huge heart! What a way to remember your 40th! @tahoecourage The Courage Project is a nonprofit founded by Brie Moore, Ph.D., offers opportunities for children ages 6 to 13 to engage in outdoor adventures that challenge expectations regarding their capabilities and inspire them to overcome obstacles and grow psychologically. The goal is to help children believe in his or her ability to live their lives to the fullest.", "piyathewitch": "@riseforrohingya", "ay_cee.smith": "Happy Burfffday!!! How incredibly AWESOME of you!! I know that the small team at Suicide Prevention of Yolo County could definitely benefit from donations. Unfortunately, they do not have an Insta account... but they do have a website! http://www.suicidepreventionyolocounty.org/", "heather355m": "Happy birthday!!!!! 🎉 please donate to @williamssyndrome", "watkins_joann": "Planned Parenthood!", "heathacl": "Homeless Prenatal Program!", "rebduty1": "Junior League of Little Rock", "malwett": "You’re literally the best! @pancan all the way! 💜💜💜 happy birthday, Mindy!!", "ktween": "@conapacperu helps get clean drinking water and school supplies to local communities along the amazon as well as assisting those communities in preservation of the forest and native wildlife through education and sustainability training. They are fantastic!!!", "crao82": "HBD @mindykaling! Great idea! Would love your support for @prathamusa, the largest NGO focused on educating children and young adults in India and around the world. For $1,000 you can help 40 3rd-5th grade children learn to read and do basic math or help 3 young people receive vocational training and be placed in a job where they will earn, on average, 3x more than their previous earning potential or help 2 women who previously dropped out of school have the opportunity to enroll in our Second Chance program and pass their 10th grade certification exam, a requirement for most employment.", "kellyrechsteiner1205": "Please consider @hilarityforcharity❤️ and also @thegirlsrising. Was totally inspired by the young performers at their festival this weekend. Their mission of empowerment and inclusion is really empowering for young girls and LGBTG youth. Definitely check them out. HBD @mindykaling ❤️", "_iamcindyviau_": "@mindykaling www.gaihst.qc.ca they help women who have been subjected to sexual and psychological harassment at work 🤞🏻🤗", "eugenacoh": "@ihdfnational helping to provide opportunity and access to higher ed for all!", "katyravensberg": "@stjude !!!!! Happy birthday! Love this!!", "jenrastetter": "Please donate to @smashsmard", "shannasmith5": "Mulvane Public Library needs early literacy furniture for imaginative play ( help our community’s littlest ones!). I’m the Director and a single mom to a toddler. I have always found you to be extremely funny, but also relatable! Pick us, pretty please:)", "1kat_astrophe": "(even though I'm +7) I want to be like Mindy when I grow up.", "bretandleemariesittinginatree": "Thank you for your gift to @rosies_place !", "betsydoesinsta": "Www.thelittlebitfoundation.org. Breaking down barriers to education for children living in poverty. You’re amazing Mindy"}