{"otoyy67": "Susu na geus rayud..🤣🤣🤣", "premfauzdar": "❤️ seriouslyserio' this post👌👌 is fucking vry hot beautiful ....", "theveganvegetarian": "I love this. I have hated my stretch marks for years, but I am slowly starting to accept them. Thank you for bringing this up.", "shreyashii9": "I hope some day I’m able to embrace my stretch marks even half of how much you do! ♥️", "sangamesh.kadi": "Your boyfriend is very lucky 😉 mam", "deepakgtm44": "Are dikha dooooooh", "khushrajput": "Abe Ye krna kya chahti h😂😂😂", "lijilpootheri": "👏", "amitkumar878720": "💞💞💞💞❤️❤️❤️❤️👌👌", "kris_h156": "It's an amazingly superb and it's like a mother feeding milk to a baby! Highly natural proteins 😂", "girish.shanker": "@hirae_07 🙏", "harrywalia469": "❤️😘💋", "raj_d_lovingstar": "Take care of them 👍", "rahul_jat_5445": "I like your boobs", "ska19701972": "I always believed that everything natural is beautiful. Nature is most beautiful n she created us. We all are different in hight, complexions, shapes, sizes etc n I always loved holding n feeling every part of my existence. Yes, even just staring n holding my fingers, feeling the heartbeats through middle fingers. At the same time everybody is unique in a number of ways. Igor to say that holdings your own breasts n feeling the women you are must have realized speciality of womanhood. It gives a sense of our purpose in the world around. Anyway I truly admire your boldness that may be inspiring a number of ppl, surely both M n F.", "vavaz_magazine": "👏🤘", "mememama24": "🥭 🥭", "the_rishi_jain": "Free the Nipple!", "santoshbilas": "Salute mam I a big fan of your", "subhankar.paulmajumdar": "😋🌹❤️", "lakhyani_491": "You normalize everything 💖", "bukhalid.kk": "😍", "abhishekag26": "Cool", "itz_alloyd07": "Uh n ua boobs❤😍🍑", "aticcersguidetolife": "🙌", "venu_nelluri": "Beautiful 😍", "kiranroy420": "Respect", "shaniraj_1308": "I love you 😘 love and respect for this post Natasha ❤", "zabir626": "Someone should take a stand speak it up n you have done that its a natural n we have understand, its not an easy thing what you done n really u have been inspiration to some girls being practical n straight forward... be as you are always 😊👌👍", "jayeshbkottarakkara": "❤️", "sanjaybobby.tyagi": "Nice with beautiful stretched marks", "gurumurthy29": "Lot of courage to post such pic 👏👏👏", "sommy.matty": "Good information", "peppergrain.lc": "Positive whether you like them or not majority will get some during their life time...smooth supple skin is a dream for a lot but reality is a hard teacher...except life gracefully and enjoy the moment because it will fly past you quickly...thank you for spreading you journey with us...Namaste 🙏🏿", "shobanvishwakaram": "Jay maa", "naushath_anwar": "God bless you..👍", "ramangumre": "🔥🔥🔥", "perpetual_lobo_": "❤️", "anexoticmania_10": "Wtf", "nu941233": "It's your ??? It's bad age effect??? @natashanoel001", "asgar1483": "U great girl ... God bless you", "king_of_borana__style_boys": "Nice bobs", "narendrapatil82": "Mast", "aggarwalabhi26": "Omg 🔥🔥🔥", "miss_chaaya": "@natashanoel001 I have these on both of my calves😭 n I feel so shy to wear short dresses. I never wore any due to them", "moon__peak": "Boldness overloaded", "sudhirsingh2517": "Very critical", "sandhusaab_pb30": "Truly bad impect mam", "h2one2018": "Very erotic", "angloprakash": "Thanks", "biswa.the_best": "Hi...I have stretch Marks on my thigs...is it normal???? I am waiting for your reply.", "r_i_k_____banerjee": "💙", "karthigeyan_ks": "Amazing 😍 am Lost.. is it really your boobs @natashanoel001 love you☺️.❤️. still wondering how you have stretches thought u teach us such workouts. But it's really pretty..", "painting.stories.with.ink": "I stan You", "jotsinghanihosheng": "Which yoga asanas to do to cure stomach ulcer...pls do help ,doctors r unable to help me", "bawa.0786": "😍😍😍😍", "narayantiwarijagdish": "Jusi mangos", "siva.hunter": "Tight outfit sometimes makes this type marks.wear lot of time very loosely outfit", "yakland": "So original and so warm ! 😘 One Love for this", "kaura__saab": "💋💋", "venky9699": "Wow so beautifully explained 😇 you are amazing ! I love your thoughts and perspective about things and like and our bodies 😍", "dharmendra_singh_official": "😝😝😝😝🐂🐂🐂🐂🐂", "razajalali6887__": "🔥🔥🔥🔥", "arjun125ck": "Pretty boobs u got there😍😍✊💦💦💦", "jindal3364": "Hye mam bus bhi kro vrna apke vagair raha nhi jayega❤️", "r.o.y.s.y_j.o.s.e.p.h": "This post ❤️🥺😘", "onirban73": "nice boob", "gaddamnags": "Informative,reaffirming and mature!.💕", "deyanupam143": "I don't know how you would take it, but it looks good", "giran_mathew": "😍😍", "instavivi007": "😍😍", "bollig86": "Absolutely beautiful", "babumakvana": "Kya karna he Eska???? 🤣🤣🤣", "ramesholics": "I wanna suck it all", "preethamjanchan": "👍👍👍", "shelbybhala": "Salute!", "kcudreamzz": "Göldęn stretch marks", "faraz6729": "There any way we can reduce strech mark body. @natashanoel001 ...", "vibha.gosar": "Appreciations ❤️ Thank you for sharing dis. I relate dis post. I also have stretch marks on thigh from very long. But it turned red coz skin stretched too much. Inner thigh. I also love my body. I accepted . But can I remove it?", "vsr_automowheels": "I dont know what to say. You are a Yoga Freak. But then you post such photos like these? Instead you could post something decent. I dont know why nobody's raising voice for this. Post photos but post something that are little decent. Why nude? Haven't your parents told you to cover your body? What thoughts can someone get when they see you like this? Many pretend to be positive with you but they never have a good opinion on you Natasha. Change your way of addressing. This is not that great. Don't post too much nudity. You are kinda provoking. Honestly!", "vicky_k747": "Nice", "jalebi7": "Love ♥️", "kaifahamad_": "❤️", "pankaj_shukla_media": "कुछ परेशानी जरूर है आपको उसका उचित इलाज कराएं", "mjaneesh1276": "I love this boob", "malhaar_95": "@natashanoel001 You are power🔥 sending you all the love and positivity aye❤️", "ivanv07": "Trust, all okay?", "_princesai005": "😍😍😍😍", "ornab_official": "Very brave and fantastic initiative to fight against the so-called plastic perfection👌", "anindita.jpeg": "Have these all over my butt and boobs and I’ll still learning to accept them 💓", "shukla.shalin": "👍🏼 someone finally said that", "manish_salvi21": "❤️🙌", "memon.imran4": "Beautiful said natasha mam🔥🔥🔥🔥🔥🔥", "nsreshbishnoi": "Nice", "satyamsuvani": "♥️♥️♥️,,,,every body suffering stretch mark problem🤔🤔", "kumar_jit_singha": "Brave and outstanding thinking Di... am realy proud of you.... that give a tight slap of those person who make nonsense thing about this....", "avijit.1997c": "❤️❤️", "fun_kamal": "Really worth sharing this scientific fact 👌", "aliali12221345": "WoW", "dr_yogember_singh": "👏So informative", "tushal24": "I wish I had half your courage", "dominicelsaa": "There is no point in that....", "kuldeep.logan": "You are so bold..❤️", "mithirenparthivan": "What is there to feel unsecured when everything In life is not going to be forever. Our remaining days on earth Is reducing every single day so let's live our life", "teju3968": "Tq so mach madam. I see ur boobs iam exited", "sushanttttt": "Fuck I didn’t know people have a problem with this 🙄...fucking crazy ya 😅", "metallover73": "Thank you for this. I have them on my stomach and sides. I hate them and I am still very self conscious of them. I hate to go out without a shirt. I've had them since I was a teenager. I'm 46 now. I don't know if I will ever get used to it. It's just my hang up more than anything. My beautiful wife doesn't mind, but it's me. I think I'll just tattoo over them. Fuck it, why not😂", "puddinformyharly": "enogh for todays 💦", "jonathan_1402_x": "🙌", "vip_sandeep8": "Hats off ❤️❤️❤️", "neelam1404": "mam i am new mom my figure loose please help me", "pankajsoun40": "Wtf", "qaisaransari241": "I Love you,My contact number is +918298975996", "basantdhakwal143": "Beauty is temporary. not always. But your struggle and living a positive life in adversity is very inspiring.....👍", "bestcurvesfitness": "Stunning", "dawinder.gillz": "Wooowww", "trivedi_tushar": "More and more love , respect to you girl 🙏💕", "avin.ego": "Your breasts looks really good..!! 👌👌", "patelrahul9461": "Greatfull post", "17romadas": "More power to you @natashanoel001 😘😘😘", "illicit_9": "God bless you 🙏", "rajuptsushil": "Good job", "niranjanaiyer": "@natashanoel001", "satyadev16": "I like more you very nice boobies", "brown__kudi": "❤", "calmie.the.mami": "Very detailed information. U make me wana touch n feel my ex's strech marks (it's 2am ok) 😂", "sarakshi0110": "Unnecessary 😑", "__alphakennybody_": "Stretch marks are beautiful xo", "vikranth_rana": "Well said 👍🙏", "subba.rao.716970": "Hi love you", "mohammadfahad64": "Your such an inspiration for women🙌", "gaurav.dalakoti": "Salute mam...it takes a lot of courage to post such a pic and explaining about stretch marks...u have a strong ass vagina 😊", "1_beardo_boy_": "Thanks for the info.😂", "kandanmuthu": "👏👏👏👏❤️", "imrajantrivedi": "❤️", "sneha_a2_rahul": "Well said! Thanks for the sharing 👌", "amarraho": "@natashanoel001 thanks for the motivation and making me feel normal about stretch marks and I can see goosebumps on your body....Respect..!!", "ms_jasmine.sweety": "U are real❤️ u made me real😥🤗🤗", "maxicuter69": "Beautiful", "manjukarates": "U do Pushpa madam", "the_perfect_imperfectionist_": "Thanks for writing about this. As a teenager with all the changes in my body I got the stretch marks. Some of my friends then told me that they were not good and I used to be insecure but as time passed I have not only started to live with them but also at times admire them for no reason.❤️❤️", "shahirfan402": "Not stretch marks these are marks of strength 👍", "ramnujj": "Nice information...", "gopalsjsr": "I can't express how wonderful post u have posted. This is something that's every human being needs to understand maturely. U r such a wonderful soul. 😍😍", "nitinkulkarni3371": "And for those who want to love their bodies just go to some good safe place in the jungle. Get your self free from clothes be yourself as God has made you and just sit quietly. That's true meditation.", "rajani001960": "Nice but what is colour of your nipples 😊", "venky6316": "True pic I hope you are honest woman in our country🙏", "mr._king_thakur17": "What is this mam😘😘", "moneyskumar": "That's very informative. Love to you.", "hirenraval16014208": "Its good to love your self", "radhey_netha": "Hats off to you🙌🙌 for posting such a pic and giving a detailed explanation regarding the strech marks for all categories of people...More strength n power to you ✊👍..StayHome n Be Safe !..😊", "nik.oftime": "This and you are so beautiful. Thank you for sharing everything that you share. 💖💕", "amanpawar24": "Informative 🙌", "shreya__016": "❤️", "itspavitran": "Respect mam ❤️ again you proven yourself as a strong lady, stretch marks, scars are nothing everyone will get old and shaggy one day. Yor are my girlfriend role model ❤️ stay healthy and happy forever", "shiv_ka": "Ayyy cutie, stop biting your nails. 🙊🙈☺️", "me.subhankarganguly": "Very beautiful", "passionatelifes_art": "It takes courage to express the way like u did Natasha but it’s so important for us to love and accept our own body.... I m touched by yr post....Love and blessings for u ❤❤❤✌", "dishanknayal": "All those who are the 'i like my flaws' and 'i am proud of my body' types are just lying to themselves ...given a chance all of u are gonna get rid of these things including the one who posted this...", "kunjjanhalvawalla": "Needed this to know! Thank you 💕", "jollychokshi77": "thanks dear❤️", "an_ee_sh_pm": "😭", "williamalases": "@natashanoel001 its natural and thats beautiful immaterial of any marks.", "amrithaganesh19": "I want loss my boobs", "iamarmymen": "Thanks for sharing valuable information❤️", "shakti_chauhan27": "Thanku natss💖 fr this 😘 much needed", "vishant_choudhry": "Strong women Allways Win ( feel strong after the Read your BBC story and feel painfull for you Because You are totally hard work mam love from Uttarakhand Haridwar", "tanen.tanen": "Cuando la gente las tiene dice eso, las que no las tiene jamas quisieran eso, todo depende del cristal con que se mire, hay tanta gente queriendo deshacerse de eso pero no tienen el dinero para hacerlo, los que si tienen corren donde el cirujano para que les quite esa piel y presumir que no tienen, entonces cada quien habla según le convenga. Por mi lado diré...Que vivan las estrías, pero que vivan bien lejos.", "vijayakumar.iyappan": "😍😍😍😍😍😍", "niloy.das.336": "Its beautiful and its natural", "steveestone": "Preach sis!!", "kunstnerheiits": "Ah! I wish I could copy and translate into Portuguese for a friend to get the benefit of this message:/", "mohammedarfath678": "Give me once it", "anwarbasheer732gma": "This part is a women's personal part and is not meant to be shown to others .... I like your attitude but this is not fair", "indian566": "👌👌", "rohitehdh": "One requires guts to do this, That is all I want to say 👍👍", "beingraz_official": "❣️", "s.syed_._": "Just like you for being frank! You are an amazing person mam. Be just like you are❤️", "judhann": "Need more", "amirbinmusthafa": "🤗🤗", "blackgrahamcracker": "I love stretch marks 💙", "chidudk": "Super", "shiva1303": "I would never have the courage to post what you did. But, I appreciate and feel your soul acceptance journey.. it has inspired me a lot to accept myself as I am", "animeshmarkrichards": "Lovely note", "mygoshsomeonereally": "Sexy and inspiring at the same time ❤️", "christinehelga": "Thank you for this. Your posts help me to self love ❤️", "chetansharma2218": "Nice", "nithyanandmudaliar": "🙌 ❤️ respect!", "actorsadan": "A Real Role model With Tons Of Guts and Love🙏@natashanoel001", "shivmishra6174": "Wow", "murthysid915": "Post more", "georgeslah": "Cow tits", "digvijay.damame": "Ur brave 🙌", "_aarav_khurana": "🤗", "pranathiroy": "I have it too 😎", "boom_jpi": "This post has 900+ comments and I'm glad that almost all of them are positive. 😊 And no hate. 🙏 This is for you and those who spread positivity❤️", "vickyvoks": "But i like it", "murarka.ashish": "🙏🙏🙏🙏", "sami.ali00786": "👍 great", "bhautikgodhani99": "Aese pics dalke hi Followers le ja 🙃", "s_bala27": "Wow", "lucky_vora_113": "Share more bikini pics", "sunil_chavda_68": "After i seen that i understood what happen in our society , now much respect 4 u natasha 👍 love uhh❤", "sagarika_lucky": "Take a bow ma'am 😍", "n0torious_sb": "😍", "vijaydon2050": "Great sister..❤❤❤", "mazharnaseemabbasi": "So ur old lady 🤨", "pooja_gupta_98": "Beautifully said❤️", "ahirwar_bhupendra": "👏👏👏🙌🙌", "poetry.tales.quotes": "lioness❤️", "movemeant_207": "I’ve been so self conscious of my boobies since breastfeeding my daughter , thank you for this 💪💗", "iampummyk": "Yes its normal even I have stretch marks on stomach when i lost weight.", "_miss.iconic": "❤️❤️❤️❤️❤️❤️truth", "mukuvarma": "In fact it looks beautiful", "anjalichaudhary588": "लव यू ❤️", "vanshika_sharma2092": "Looks like mine! Found my boob twin! 😁", "princetagrammm11": "👏 🖤", "ttishaa_22": "Much needed♥️ You beautiful women I Love You❤ Thankyou so much for spreading so much love and positivity😌❤ @natashanoel001 🦋❤", "faarge05": "https://www.youtube.com/channel/UCixbuRiPdolzncWjBU_LQdg", "mohito2683": "We all know what stretchmarks look like ....don't need to show your boobs for it....heights of attention seeking ...", "riduan_gazi": "👌", "terry_mardi": "The message is always strong for people. 🙌🏾 Thank you for continuing to be unapologetically honest.", "james.shroff": "U r such a beauty , n i like all ur truth bombs , u r such a great person , who never hides , its really very hard to find person like u in this world 😍🙏", "richardsautoclinic": "Looks beautiful to me", "harshita911": "Thanks for the knowledge nats🙌", "rajnish.j28": "Damn, you hit the right topics.❤️", "pritesh7860": "🤗🤗🤗", "vaghors": "My wife also had stretch marks on her body and breasts because of pregnancy but we do not have any in hibitions about it. She wears a saree with no care at all even if her stretch marks are visible", "athira__7": "This is a eye opener for girls out there who are constantly insecure about their body. I do have stretch marks like this and I was once ashamed of it. And then I happen to read one of your post talking about saggy boo and it changed the way I see them. Keep writing I'm sure a lot girls are changing and having a happier life just by reading your post.❤️", "ganesan6386": "So nice boobbs baby", "adityanarayanpanda": "Just one word for you CURRAGE ...HAats upp to you...", "jigarsharma4762.js": "Love you", "defy_the_gravity": "I am a mother I have no stretch marks on my breasts. Have some on my lower abdomen only. But you are awesome Natasha🔥 it takes courage to post such photo. Loads of love.❤️😘", "untanglinglies": "Why hiding nipples ????😢", "harpreet.maan.5817": "😍🔥", "narayan_kumawat_ch._": "Age ka fekter hoga and oli massage his better", "tarunpawar52": "❤️", "taigar_abhi_zinda_h": "Arre ye ky h kuch samjha nai es pic ka matlab", "ahmednn708": "@aqiburrahman status ta por shala. Strech marks is not that big issue.", "manepalliprasad": "is there any other way to get rid of this loose skin nd strech marks", "mr_dheeraj_arora_": "Smjh se bhar se", "taralkarvishal": "#dheet bandi#you have somuch guts to do this post n msg####🙌🙌🙌🙌🙌🙌 headsoff# respect# love the way you be #strong girl#pls don't giveup🙏🙏🙏#inspire the generation🙌girls is not option💪💪", "hafizali85": "Beautiful pic", "mohd22331": "Please don't upload this type of post", "cheffisuresh": "So beautiful", "samritigmishra": "Same girl! its being exaggerated with breastfeeding", "suj_218": "Stretch on the body is common. Thank you @natashanoel001 for putting this and letting people understand the stretch.", "devpush07": "Exceptance and Accepting it is what we should learn people like u🙏", "ravve.ravve": "👍🔥", "dichhenlama": "You are brutally amazing ❤️❤️❤️❤️", "deann_46_": "Left one is better", "asankapereratt": "Beautiful akka @natashanoel001", "parsisaheb": "You r brave and beautiful ... .this post will make many women and men comfortable as these strechmarks r really normal.... thanks ❤️", "sharif_rajgadiya": "Natasha u r rocking....and humble", "c0mi0": "Thank you 😊", "richrish7": "thanks for sharing...i used to feel insecure about my body..now i know its normal", "anamasad230": "Sahi ki ajeeb aurat hai ye", "chamandiyali": "Much love 💓", "instakrups": "Thank you💜", "sanjanasankhyan": "Kudos to your confidence", "notty_and_hot_boy": "But nice 🍎 🍎", "sunithrodrigues": "Thanks for sharing the science behind stretch Marks", "mikey_mkk": "❤️salut stay safe stay home", "mirwaisachakzai32": "They look fine n cute as ever, don't worry ❤️", "m_mayur50": "Strong body natasha", "gwermo": "You are gorgeous/beautiful in every way. Ive had a crush on you for years and love how positive and happy you are in your body and want others in the same. I love your energy and truly want that daily. Message me whenever. Id like to get to know you more amidst all this going on in the world ☺️🙈", "om_sherstha_60721": "What is this", "smakdiddybang": "You’re a beautiful soul @natashanoel001", "__aggarwal_______": "Respect 👏👏", "mouliyogendra": "Respect ur thoughts.. U r an inspiration and a strong woman. Inside", "zebaa_choudhary": "Fazool aurat", "shekar4658": "So Beautiful ❤😘", "dhananjayareddy84": "My weight has fluctuated from 45 kg when I was 22 to almost 80 kg very recently. And it has not been just one way route to my current weight at 77. So, I have plenty of those scars to show.", "nikhil_dhingia": "Ye post dekhne se pehle mujhe pata bhi ni tha ki stretch marks pe sharmate bhi h log 🤣🤣", "moomal_arain_writes": "Thanks for sharing this ! Love from Pakistan <3", "neeraj.bakshi5": "Pls don't post such kind of things ....I am following you becoz of your yoga ....Not becoz of your body", "nanda_kishore89": "❤️", "dr.shiva_098": "U r really gutsy , i like da way u present ur self simple", "dr_shovan": "brave girl 👌👌", "arclights": "👏🏽", "akash2328": "Superb pic ❤️😍", "nemisha17": "@natashanoel001 you have guts and a strong ass vagina to post this picture. I'm proud of your journey since I've been following you for 2 years. You inspire me to be bold, courageous and not give a fuck what people think!", "megha_1d": ";(", "nahrowiy": "😂😂😂😂 kriput", "sadullahkilinc46": "Merhaba nasılsın bir yaramazlık yok işallah.Anlamadın memelerin resmini neden çektin.", "wirleyashwant0": "Oh! Know.", "aacharyashubham": "Natural boobies", "nalininagarathinam": "Thanks for sharing this. Yes I too have stretch marks in my body. I really needed this post. Thanks again ❤️", "arrkay_001": "Ohh my god !! Can’t even think how much confidence and self love you have to post this pic ! Salute !!! ♥️ you go gurll 👍keep is inspiring ☺️", "er_vikramofficial": "@natashanoel001 it look so dry... are u use silicon???", "sammy_varun_joel": "иσω αℓѕσ ѕσ тιgнт вσσвѕ иαтαѕнα ι αм вιg fαи σf уσυяѕ ωнαтєνєя ¢σмєѕ ιи уσυя мιи∂ уσυ ρυт ιт σи ιиѕтαgяαм ωιтнσυт αиу ѕнαмє∂ ℓσνє уσυ ❤️❤️❤️", "sanjaymondal01": "u need a lot of courage & strength in ur ass to post such a pic & u give a proper, logical, sensible explanation....#Hats off to u Mam#.", "neeraj_bansal88": "Ye kaisi post dali h 🔥🔥", "hemanathbabuperavali": "👏👌 nicely explained", "miracles_hollowman": "Nyc wrds👌👌", "khushbupanchall": "Thank you 🙌🏽♥️ @natashanoel001 lots of love💕", "ireene_joe": "Thnk u soo mchh!!!❤️❤️❤️", "bskr_twry": "It is normal for most of us to be. But you are the first one to talk about it openly. You should learn… You are great👏", "stylesnsmileschennai": "Stretch is quite normal on everyone. #RespectWoman", "de_ep843": "😍", "sohaeb_engr": "Dick raising pic...lol", "bilwadnitesh": "Good che👏👏👏", "mnepaulsing": "You are a true inspiration ❤️", "tejsma": "The reason why,I love you @natashanoel001 ❤️", "_sonofabraham269": "It’s Freaking beautiful..... @natashanoel001 ❤️❤️❤️ such a bold lady ❤️", "dineshbanne": "Who grabbed them soo hard man she got the stretch", "life_on_my_curly_planet": "Truly an amazing self love. Love you girl. 💕 Definitely touched many souls.🤗", "abhinayjagtap23": "This is natural thing in our human being but some people like you spoken directly on this thing! salute you 🙌🏻🙌🏻 ❤️ @natashanoel001", "bhaskar_mallik": "Sare underwear se kya mask bana dala🤣", "arora_naveen": "❤️ RESPECT ❤️", "earth_va": "From past 2 months these stretch marks started occupying my entire tummy...& I know am not pregnant ( I’m a boy 👱🏽‍♂️)...& I was feeling Insecure about that...thanks for making me normal again 💝", "ksatmeet": "@natashanoel001 it's my honour to know you as a person. This is the most vulnerable and yet honest post I hv ever read by any influencers. Your truth bomb is sheer truth and you actually naked your soul in front of your potato tribe by unapologetically being you. 👏👏👏👏", "pogonophile2002": "Absolutely beautiful Natasha. That's who you are inside and out! ❤️❤️❤️", "gayatriwaghdhare": "I have the same marks 💁🏻‍♀️", "jamlenpao": "Respect👏👏", "deepan_1620": "H", "syraghafoor1": "So inspiring. Thankyou. Love from Pakistan ❤️", "neini__01": "❤️", "iam.suresh": "Guts required to post really appreciated confidence u re giving to others", "strangers.on.a.train": "💞💞", "pinkyindiana.b81": "🤗🤗🤗", "hariz_hariz_123": "Nice boob", "umarithika": "This made me feel so better ❤️ Thank you 😘 @natashanoel001", "annie.yogagirl": "👌👌👌love u Natasha💕💕💕", "silverglory4": "😮 what is this", "missvadorable": "I also got them because of sudden excessive weight gain.", "ka.rthik200": "❤️", "kanuaneja92": "You always give different and quite simple picture to almost everything.. more power to you 😊 thank you for sharing this, it’s much needed 💞", "dolvinsekhar": "As per the art of stretchistry, you will have more than one baby 😜", "di_ru_van": "Anyone asked for see your boobs? If you will show your boobs , you will show your brother or father, ok .Don't upload your abhour boobs in social media because social media is not your brothels ok mind it bitch 😠😠😠😠😠😠😠😠😠😠😠😠😠😠😠💣💣💥", "minaljain_96": "True! We should adore it with full confidence !", "imsumitkhatri": "What if we take collagen as a supplement then, will it be repaired ?", "francina_rashmi": "We are proud of you @natashanoel001", "gaur1952": "Wah, you are brave", "rajsingh4610": "Mujhe laga maine koi Porn ID subscribe kar liya hai😂😂", "aftab787376": "Mam iska ek video baneya👍👍🔥🔥🌹🌹", "anish_bait": "@poojamodak28", "billiehunk9t9": "Nice gulab jamun 😍", "bhawani_singh389": "It's your mam?", "mayadha_maan": "Why do you have saggy boobs @natashanoel001 ?", "srinivasan.prism": "Would have been more beautiful to have a tattoo ❤️❤️❤️❤️❤️", "gkamleshgurjarkasana_": "Normal 🙌", "rudrojuvinaykumar": "Thank you for the info, maa.", "welcometodkworld": "Omg! This was sooooo damn important and I'm proudly saying that I've witnessed such a beautiful post. You're such a rich hearted. #LotsofLove 🤗🤎", "aditisheoran": "A big salute to you for your courage and honesty, we have been brain washed into thinking that women have to look a certain way, the flaw is in you if you have stretch marks or acne scars or even hair on the body, we need to break these stereotypes and own your body.", "ajit_kumarr2": "Are yar tum log had kar dete ho itna dekha diye ho to Thora or dekha hi do pura hi utar do Thora or like miljaye ga Tumlog to Apne sanskar bhul hi gaye ho Thora sa like or comment pane ke liye apneaap ko nanga kardeta ho 😎😎😎😎👎👎👎👎", "minotimakim": "@natashanoel001 this is beaut ❤️😍😘 these are human bodies! As natural and wonderful as can be! ⭐️🔥", "_sabahat.bhat": "Yasss 🖤", "swati_vora_shah4185": "Salute to you lady,you make all major complications sound so easy and normal,you are an inspiration nd a strong woman", "cuckoldboudoirs": "Thanks for sharing.", "craanurag": "God bless you❤️", "divakar_71": "Can we get a full picture", "meghasaini12": "I have them on my breasts too. I was so conscious about them, back then when I was a teenager, but I made peace with them because after all they're a part of my body now. Embrace your tiger skin gurlls!❤️", "harjinder7737": "Strech marks", "dhirajlad_17": "Well said😊👏", "palakkalsheri": "💛💛💛", "task33n": "@swaahili 💖", "j2thevero": "I love your figure 🔥😍", "sakirsheikh": "Boobs", "drissssh": "🙌🏻❤️", "boka_bakso": "I habe never ever bothered about my body. I am a fit person but I always wear loose cloths as in cloths i feel chaged hahaa", "urstruely_ramesh": "🔥vv🔥🔥🔥🔥Vvv", "santhoshpisharody": "Strech mark....", "nikhill93": "Love to see your posts thoughts everyday and the way u bring up things and then give a valid explaination for those who just think negative over everything ❤️", "lifeismoretodo": "Thank you for sharing 💙💙💙 @natashanoel001", "swatisaha": "❤️ more power to you 💪🔥", "monalisa9067": "Yes loved it and we are good what we have on our body😙and I will share this💙", "summi_patnaik": "You go girl ✨👏", "instagauravv": "These examples stand as a foundation for everyone. Thank you 🙏✌️", "divyakrishnan07": "YOU'RE THE EPITOME OF #truthbombs! 😍", "stubborn_upsc_aspirant___": "Really dear it take a lot of courage to post this... I don't have stretch marks.. but i have a skin problem and it feel so bad when you're not able to wear short dresses 'cause of your skin.. but now.. I'll and if at any moment of my life I'll get stretch marks I'll love them..💙 little love for you..😘❣️", "pranju_181910": "Stretch marks are natures badge 🧘‍♂🧘‍♀🤸‍♀👙of achievement. ...👍", "anjusha_ariz": "💕💕💕💕💕💕", "bellionhead": "The chest marks are nothing but a symbol you going through a lot but you're still here, in your bright place, in your calm mind! Even I've got a ton of stretch marks over my back and left shoulder and when i look in the mirror, i make sure to see myself as a warrior with marks over to the side, like as in those in ALITA battle angel! So never to be insecure of it ever again is the only pride you can lift up so that it could lift you up! I salute you and Thank you @natashanoel001 for sharing a photo that is filled with your own insecurities but the world will accept you in ways you wouldn't understand. ♥️", "abhirajsukhwal8853": "🌷🌷", "tiktoktiktok.1": "Proud❤️", "rathore_sunita94": "Great way of explaining . ❤️", "hims_hunk": "Wrinkles", "cageddino": "Great post. 🙏", "harkesh_bhouria_harry": "This is call guts. I know you are strong. Stay healthy", "sabelibanez": "I have silver stretch marks on my knees and around my bum from my pre-teen growth spurt, and I love em! I’ve received the odd comment about them as a teenager which made me aware of them for the first time, but I realised they just showed my story of growth! 🌱", "life_hope_sunshine": "@natashanoel001, thanks for sharing. I have stretch Mark's in my whole body and it is visible so my near one used to avoid because of spreading and as a result whole life I cursed my self and due to this every time I suffered from low esteem. Salute to you spreading self confidence to individuals like me.", "vilina_krish": "Body positive. This takes extra strength for the scientific lessons in our present society and system. U doing wonderful job. More power to you for spreading awareness and self love. 👏", "wanderbug222": "Hey that was pretty brave of you... Thank you for sharing and salute respect to you...!!!", "sameer.tandon007": "Very Brave girl👑", "jaimekavitha": "Thank you for the explanation.....needed this extra boost", "razdanalpana": "Fitness posts are better", "aimlessoddity": "My boyfriend calls them \"Tiger stripes\" and I think that's changed my view of them. Ladies and gents, we all are secretly Tigers 😍😍", "kamaleshvenugopal": "Salute.,... respects", "rahul9999093701": "What happen", "shanaz_rocks": "Teue and agree...some of us like me do not have to get pregnant itself to have stretch Mark's...I have it we all have it at some age", "dikshadogra09": "You are indian constance queen natasha", "i_bee_mee": "I too have streach marks mam till now I was tensed when I saw n touch them sometimes I thought it's a disease now I got clarity thank you mam love you", "hellward_bound": "I know truth bombs are hard and this needs some serious courage. Kudos for always being real and fighting societal judgements and parochial outlooks. You are a symbol! Cheers! 💯", "ksakshi135": "Even stretch marks looks good Sometimes😂", "bornalide": "❤️❤️", "raghav333": "You are amazing...you know how deal with satiation 😍", "leo4hoes": "I have stretch marks my on balls... What to do?? Should take a pic and post it on socialmedia with a 🔥 captain, I'M PROUD OF IT AND BLA BLA....", "valeny777": "You are truly amazing 🙌🙏🌺", "oldsoul_warrior": "I have a lot 😂", "k_a_h_lonpooja": "@natashanoel001 Breasts Aren’t Inherently Womanly (And Womanhood Isn’t Defined By Breasts) Love your body the way they’re ❤️", "hashebbar": "Informative, tq", "divishivu": "I too have stretch marks in my body mainly near my hip and arm..thanks for sharing this.. I was getting confuse why this coming 🤗", "linithsethjoshy": "Even as a man. I’m really insecure about my stretch marks. I have those on my upper arms and inner legs", "mostlyfantasyying": "Productive Boldness....Kudos for your bravery🖤🖤🖤", "guntaj_gill": "Thnksss for thiss", "ashok.honda.92": "Accepting yourself is divine...🙏😊", "sarathtonylee": "Nice", "im.jasmine1": "I love you Natasha. Your amazing❤️", "dabhishekdas219": "You are great I really get a lots of inspiration and motivation from you", "sakshi_2580": "Powerrrrrrrrr", "kuushhhhhhhhhhhhhhhhhh": "Still 252k followers need some more of this !!!😍", "marotikate": "🔥🔥🔥🔥❤️", "anasabdulkalam007": "Bold lady ever seen🔥🔥", "amjad_ali_khan03": "I am big fan of you and I am proud of you . Salute you with heart ❤️😍🙏", "jaggi_2020": "Likes laine k liye kuch bhi matlb", "navoditag": "You're a hero.", "mrkunsel": "😂😂😂😂😂😂😂 thoda amul ka dudh hamen bhi de do aajkal satpal ki gay dudh nahin de rahi hai", "freindkaladla007": "Just love to see other stretch marks aswell", "escapingfromreality_": "You're such an inspiration, more power to you 🌸😍💕", "poojarrparab": "Just 10mins back I was looking at all my stretch marks, I hated them and the very next moment reminded myself how grateful I am for this life , this body. Thanks for this post and letting everyone of us know that we aren't alone. 😘", "_.y.a.j.n.a._": "Proud to have stretch marks 💪🔥💞❤️", "jamidarsuyash": "Huge respect", "ravneet_kaur_ruprah": "❤️", "gautamiglani": "You should win a nobel prize for the change you're tryna bring 💯👏💫 Respect ❤️", "divya_ddee": "You are wonderful and you make us feel wonderful . 💜💙💙💙 Thank you and Love your truthbomb posts", "arshad_khan_pathan": "Nice but looks some week", "franky0900": "would suck them all night😘", "bharat_7889": "Thanks for sharing without hesitating...salute to u", "_wanderingzen_": "Respect. People have a lot to learn from you like self love and accept urself with wtv ur blessed with. Also I liked ur live session on anxiety. That's something what everyone is dealing with.", "rashikapur": "Free the nipple", "chowdharysunmeet": "Is this yours", "rahul_rajput_5": "It's very beautiful... like it🥰🥰", "aniketgowardhan": "@natashanoel001 Great Didi ❤ much Appreciated I have also seen my own sister worried about Stretch Marks after Pregnancy but after seen your post lot of people will get inspired and they will stop worrying about their Stretch Marks Great Job Didi you are always been an inspiration for all the women I wish people will take it positively and they will change their mind towards Stretch Marks 👌👌👌👌👌👌👌", "unseenshreds": "Bahot mast h", "frameous_photosandflims": "Deeply Appreciated...📷💯📷✌️✌️✌️", "projectzerowasteindia": "I wish we had Instagram and people like you talking about stretchmarks while I was in school about 10 years back!", "santosbadboyz": "Body postive soul", "shaikh__noman__s": "Waw", "rickysingh06": "Lovely 😍😍", "i_am_neil7": "🙏🏻", "chhaya226": "Thank you @natashanoel001 . You inspire me.. This was much needed.. Girl you are something else.. 😘😘😘", "pathanianimmi": "I have it and m not ashamed of it.", "anshulkundeka": "🤔🤔🤔", "sahilmadanimages": "🤘", "debnathm137": "Thanks ma'am for sharing this article", "bodyfit_byankita": "😊👍", "kush.chaubey": "I found it beutiful as God has given", "anishalogistic": "Ye aapke hai", "deirdresingh": "You do speak up /take up all the “issues “ and talk about them very normally and I cant help but applaud you for that!👏👏👏👏💕👌", "gibberishvagabond": "Thanks so much for sharing..looks just like mine and ve alwags been insecure about them..cos once I thought thjs is the only thing thay looks good on my body..and now I jjsy don't care...it's just a skin and body that doesn't go on for long..beauty is fading but not the heart ..love to you ❤️🙌 @natashanoel001", "_hassan_222": "I am doctor I send your inbox some advise", "yogawitharchanaa_you": "@natashanoel001 thank you!! It’s absolutely common and it’s better to accept the way body is ❤️❤️😈😈🤘🏼🤘🏼", "nutankanojia": "Mam u r such a beautiful soul so peaceful and positive thank you❤️❤️😍😍", "jaime_melgoza_abaonza": "Very Nice❤️💓💓", "yogesh07091986": "I got few on my back during growing age. They are still there and I don't care.", "amanpreets_s": "Good Explain #Respect", "the_omega_woman": "Awesome Natasha! You’re a darling ❤️", "krishnanjanpakrasi": "The stretch marks are design of your skin, imagine it like design as a Tiger skin.... The women who have stretch marks they all are Tigress hidden inside.", "subhash.c.yalavarthy": "Omg thankyou so much for this..! I’ve seriously worried. Infact trying to meet some dermatologist soon. And weird is that I got dem around my navel..! I am really worried about this.", "themitalpatel": "How can you be so courageous? You talk boldly on every subject... I want to be like you...❤️", "rushkine_vin": "Was it really necessary to post this ? I mean we respect your views but still it's the culture in which we are , doesn't allow someone to reveal. Don't take this as a hate", "11sagarsingh": "Ohh your word's right ,pic 's not good for u", "hasitha_madhushan_": "Thank you. I also have Stretch marks on my shoulders. Love from Sri Lanka 🇱🇰", "rahul_bhambu": "You have such a brave mind. Appreciate your thoughts 👍@natashanoel001", "j.shirgaonkar": "Usually these stretch marks dont appear tht to on boobs to younger gurls......its common to happen aft pregnancy ......so u r rare case....but den ol this shouldn't matter to ppl who r sane..........Gurl Respect !!....is ol I hv for u....more power to U🤘", "nandu_sabka_banduu": "I appreciate this post. I’ve had stretch marks on my body for a long time and I didn’t know why. I felt insecure at first but growing up I realized that they are normal and if anything they make my body different than someone else. So thank you for sharing this ❤️", "mist_ii": "Thank u so much ♥️ u inspire us a lot mam u know I was insecure about my body and today after reading this I accepted my body and iam proud of it 🙂 thank u @natashanoel001 virtual hug ♥️", "hrmanthanpatel18": "So sexy... But", "prateek.garg.7165": "What a strong kick 👏 proud mam", "sukhiraghunath": "I've hated my marks, all of them, it was after an article I read that I began to accept the lines and I don't care now. I've gone from purple to a pale brown now! Thanks for the post. 💪🙏", "ankushjadhav72": "Very hot and secy booms 🔥", "neha0491__": "To eske liye boobs dikhane ki kya jarurat thi ?🤔", "ramzanramzan242": "Nice❤️❤️", "irshad.ahmmad.1": "Very nice I love this but show full", "spacedintheblue": "Thank you for this 💙", "too_bye_two": "Battle scars. 🔥", "ayogiyan420": "😘😘😘", "arthur4689": "We should be happy with wt we have and can enjoy ur life 💯 I am a die hard fan of urs will be always supporting u....", "ugargi": "I 💙 U", "albertyzacharia": "Salute to you mam.....🙌🙌🙌", "baruabidi2594": "Lot of respect to u ...totally agree ...love this post ❤️❤️😍", "savourexoticwithsari": "Hate off !🤗", "dpksingh69": "You are confident as hell mam", "swathiselvan95": "Tq so much for this post @natashanoel001 .... I have stretch marks cos I lost almost 12 kgs n past 3 years i was worried about that that too from tdy morning literally I lost hope .... I’m not a fan of stretch mark creams but I use to do normal home remedies lk anti cellulite massage so nd so i can se results but though it’s too slow .... looking @ ur post I understood it’s quit common nd not to worry much .... Tqq so much once again ❤️", "d_upma": "❤️", "aashish_vlp": "Thanks for information👍", "ujaascraft": "Thank you for sharing this!", "kreativedreams": "And those products don't even work, damn 😅😅", "drishti.modi": "One of my favourite self-love posts thus far. More power to you @natashanoel001 💛", "sachinkotian": "The Beautifully clicked and explained.. 😊", "lady_killer76": "Hoty", "krish_krishna34": "Can clearly see those tiny hairs on the boobs..wanna lick those boobs and armpits 💦", "the_junakirahman": "Your a Powerful women😘😘", "bhuvan27_": "Our body is constantly changing: infancy, childhood, youth, middle age, old age, and finally death. But we, the unchangeable soul, witness this “virtual reality” from within. So never lose that sense of identity🤘 u have been an inspiration to all the girls out there. Keep up the good work always. 🙏", "blue_nightsky": "The real question should be what are you doing to reduce the production of cortisone in your system. Cause clearly something your doing is not right or normal.", "a1300121": "😍😍😍 so good", "mr.sugar_genius7777": "Thr is no strechmarks for love or being in the state of it !💗", "sagarikathomas": "U r beautiful woman👌👌", "bharal_shrey07": "👍", "saim_butt96": "@zahan_butt9", "paulrajesh92": "Love ur truth bombs ❤️", "mitsufonseca": "Yup! I really hope more women find comfort and confidence in being their true natural selves. ❤️", "curvydivachic_official": "I have those too and after 43 kgs god they were different. Nothing to be insecured about. ❤️", "ayan.dasgupta.12": "So cute Natasha di", "hemdog83": "I’ve got tiger stripes on my ass too 😂", "ritika_draws": "Just today, post shower, I was looking at my saggy breasts and the stretch marks and wondering who would even look at and like them. This post couldn't have come at a better time. Thank you for sharing. And always always always, more power to you, with deepest louvvee! ❤️", "maddyrana": "U r special u r beautiful god bless u🙌", "ramaswamy.d12": "Nice boobs", "mandee_singh2007": "How this come ...u r doing lot off exercise, yoga then?", "_.lidhu._": "Today i realised , Instagram is not only used for scrolling feeds for entertainment and tiktoks....the moment when i saw this post...,i realised it's also used for building self-love and empowering the women out here!....lots of love and power to youuuu! Thanks is the only word i got to tell you..@natashanoel001", "vishal16950": "Great awareness😊👍", "daffeyyyyy": "Preachhhh🙌🙌🙌🙌❤️❤️❤️", "hiren_patel8833": "Why stretch marks now now your age not old", "shubh_1s": "Very useful information... Thanks for enlighten us. 🙌🏻", "pranshii": "👌👍💖🤗u go gurl", "proteus0321": "I have stretch marks since i started hitting gym and its been 7 years they are still there... thanks for the information in caption🙂", "nehanavnish": "Salute to you girl... I mean no one could explain it the way u did.. i had these since puberty...thanks for reminding us of self love 💕", "thedrunkletters": "Thanks I needed it 😭 For the longest time I have judged my body. More power to you ❤️😭", "free_the_girls2": "We all have these marks😍😍 its not shame.... Proud girls we are🙌🙌👏👏😍", "tbh_handlettering": "I have worst stretch marks😩🥺❤", "kunalmangnani41": "👍🙏", "rahult721": "You are doing so much yoga then why this stretch mark ?", "bushrahusainqadri": "You’re the best!! ❤️", "rajbhor1985": "real mens never insecure they love strech mark this is natural not a disease i love it😘😘😘😘😘🔥🔥🔥🔥", "umadixitt": "❤️", "prithvi921991": "This bomb blasted next to my mom", "kishor436": "🙏", "parita7800": "Thankyou so much for this. Your write ups are truly inspiring. ❤️ Sure, you have a strong ass vagina to upload a picture like this...but I dont see why it was necessary. I mean, there are other body parts too with stretch marks (if that's what was the focus of this article)", "radhyaaaaaa": "thanku didi for this ......god bless u radheradhe 🙏", "gurpreetfuture": "Omg 😮.. u are too much showing openly", "sheikh_shoaib_almaalik": "Hmmm yummy", "kundan_syed": "Self love 💙", "seenu.thinkbig": "One onle strectch so wat", "beingds93": "I needed this! ❤️", "mp3wwwwwws": "Thank you so much ♥️", "heenanjara24": "hands off to you ma'am!🙌🙌🙌", "shankar.thalari": "❤️", "im_sunil511": "Welll said Absolutely true I wish u could hav reveal this a bit earlier to this World 🙌 thanks much love n Respect natasha stay BLESS stay home❤️🙌😘🤗", "balkishan.singh": "You need to do hard-core exercise", "sonalyadav82": "🔥🔥🔥🍋😋", "goutham313": "Hats off to u Natasha ‘ most people have stretch marks and are uncomfortable about it ! This is a confidence booster esp for me 🤟🏽 thanks dude u ve got balls of steel to post this I mean dying ass vagina to post this 💪🏽 keep doin what ur doin dude peace ! 💓", "nirali_1809": "This one was soo needed.. Thanks for your words🙌💙", "durgaprasadkolusu": "Thanks for sharing the info👏", "_sampath_kumar_": "This girl is 🔥🔥🔥🔥Thanks", "sachikumar": "@piyush_harwani read!", "arjunbhardwaj.786": "❤️❤️❤️❤️❤️", "chintan5478": "Wat is this ?", "aburvaa_ravi": "OMG thank you fo saying this out loud, sometimes I get depressed about the stretch marks and then I ignore , you are such an inspiration @natashanoel001 , keep doing this great work of motivating people 😍 loads of love to you ...", "ajaychaudhary706": "Omg❤️🔥", "supriya_soren": "Thanks for sharing ma’am👏", "befitwithfatty": "You're the best ❤️", "jahanvi.91": "@jessica_braganza", "johnathanjohnny77": "Awww... Its looks yummm to mee.. 💋💋💋🥰🥰🥰", "prince_of_bentley": "Don’t post such photo out here ma’m", "sanjayawasthi11": "@natashanoel001 proud woman💪💪👌❤️💪💪", "bhole.naut": "Stretch marks are normal and real, just a sign we have grown up ! More power to you ✨🙏🏼✨", "bren.dako68": "Truly inspired 😍😍😍 we should share stories like this for awareness 😘 thanks darling", "ketansureshkadam": "😍", "aishwarya_vaidyanathan": "U inspire me to love myself the way I am. @natashanoel001 keep doing the good work n keep kicking asses with ur bold n beautiful personality. My support n love to u ❤️🔥", "chirag_saha": "More power to you girl ✨ you have been one great source of inspiration for me , always pushing one to love themselves the most ❤️ KUDOS !!", "loganiser": "Thank you for this, I've grown hating my body and everything about it. I paid attention to the stretch marks when I started gaining weight and hence I stopped wearing clothes which would show any marks.", "miss.thukral": "Nadaashaa thanks for this ❤️ sometimes it helps to know that other people feel the same way :)", "hardcore_mumbaikar1987": "Information is really good👍👌", "cchakraborty25": "I am glad that you are natural 🍇 . Strech marks are natural . It's just proofs the bodies capability of adjusting .🦄 . You can start eating amore of Bell Peppers ( Capsicum) as it has the raw material for creating collagen . And do a 100 dips a day . You shouldn't have aproblem then on.", "soniyashweta": "More power to you natasha! You are an inspiration🤗 love you always!!", "rajesh.punj": "Was it due to workout.. some ppl when are fatty and later reduce fat and get the strectch marks", "zippythecoolest_one": "Nice One Its Helps So Many Person 👍👍", "ganesh_kaasha": "your posts cause big impact 👌", "urva_sinha": "Oh i see your boobs just got stretch marks wow", "rajeshranadive": "very well said", "er_h_j_v_1303": "I love you so much dear 😘❤️😘", "95simran_kaur": "Amazing Post🙌", "nanawarechetan": "It's sign of wait reduces/end of age body growth / weakness of body", "appu_kannan4": "Whats going on...", "nuffinss": "I do have same marks and it makes me insecure but now i m trying to accept them . But you know women around me criticise me alot saying things like- oh yeah toah bache hone par hote hai like wtf are u crazy.", "sharadhijois": "Girl power❤️", "actorvinaymishra": "@natashanoel001 This all things are natural, boys also stretch marks in there shoulder, its all about jisko jo mila hai use me khush raho yoga kro exercise kro, life ko aache se jiyo. U r great yr😘😘 Love u", "sethniks1": "So you saying we should accept & love our stretch marks", "harsimran.bhullar": "✋Remove the hand👐", "navelcentre": "Its ok everything is natural ,be proud😍😍😍😍", "nexusap69": "You r a legend💓", "totodam": "Bhai lekin boobs pe stretch marks kyu dikhana hai , any other body part and its stretch mark could be shown , why boobs ?", "arjun_singh_adhikari": "Yummy😍😍😍😍", "borosimang": "🧑🏻‍💻", "surb06": "Love u natasha u alwz inspire me to accept myself with my flaws.. ur duch inspiration!! Love u so much❤️❤️", "navisingh0001": "I kiss your boob❤️😲", "rajvi_desai": "🙌❤️", "stefreal7890_": "Tits🔥", "farooque_khann": "Thanks a lots for info very well explained .", "srujanchakilam": "Like ur Bold ness", "hon_shweta07": "Important topic covered. Thank you @natashanoel001 you normalise our life❤️", "trap99888": "Its not abt bad dear its all abt ur workout and hardwork stay blessed #natashanoel001", "tanya_srivastava30": "This is effing bold step...Needed for most of women out there...Insecurity from stretch marks is major problem...You are so brave", "mans_trainer": "Cortisone is a pregnane steroid hormone it is one of the main hormone released by the adrenal gland in response to stress.. cortisone suppresses the immune system thus reducing inflammation and attend pain and swelling at the site of the injry", "mitenthaker": "💪❤️", "dr.yashica": "Much Love♥️ @natashanoel001 Keep Uplifting Women Like This Forever♥️ Love you xoxo... I have a skin disease called vitiligo and I accept my body as it is! love my body more with each passing day!! More power to you....", "jiteshravariya": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "pikuness": "I ❤️ u", "subin.sn": "More Fat😂😂", "agal_vp": "More love to you @natashanoel001 ❤️❤️❤️❤️", "girl.with.a.kindle": "❤️❤️❤️❤️❤️❤️ I have had them on my knees and calves since teenage. People have to know these are normal and beautiful too. Thanks for speaking about them ❤️❤️", "11_bhavyakaushal": "I have stretch marks and I am happy with it😌 but thank you so much for sharing this. I was needed to gain more confidence and to have more acceptance ❤️", "the_eco_queen_": "I've got them from my teenage and I thought it was too early to get them actually,, now I'm happy with everything that I have.. world needs someone like u to show people that many things r jus normal than they seem to be. Million thanks for the positivity u spread❤️❤️❤️", "sanchez4you": "Right on !👍", "sheebagonsalves11.11": "So true ❤️❤️❤️❤️", "maitrigada319": "You are a gem and I feel so proud of whoever I am 🌈", "pandya_niyati": "🙌🙌♥️♥️", "dharendrapalsingh": "Needs more toning exercises. Then it will get firm trim and round.", "prodipmar": "Nice", "regular.user66": "Thank you Dear Madam for such a Detailed Info. People are really Concerned about it. Thank you again. Stay Blessed", "truptii_shirke": "Let them not tell you your body is supposed to be! Powerline❤️💋", "oceanasen": "Can you be any more awesome? More power to you and all the women! @natashanoel001 love you! And I have stretch marks too but don't give a damn! Stretch marks is the new beauty after this post! Thank you so much for this! ❤", "sonu_astroved": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "imrobin04": "Is this urs?", "vaiishu_": "Just love you❤️ thank u for increasing our confidence❤️", "jitendrasingh781": "👌🔥❤️", "kselsen": "Love you❤️", "samamananaan": "My age is 21 but I have same marks in my body.how ???", "deependra.sharma.39108": "👍👍👍👍👍👍", "thesonamuppal": "❤️❤️", "nabanita2254": "Love you more Natasha😍😍😍😍", "selfobssesed_shelly": "thank you so much 🥺", "the_katamneni": "This is so badly needed to talk and share🙏 gratitude🙌 @natashanoel001", "vinod_sharma_bsnl": "Knowledgeable........ 🙏", "kanishka.sharma.186": "❤️ more love & respect to you ❤️", "annujthakur": "@pandya_niyati", "garvitanagpal": "Yayyy girll.. lots of love❤️", "aashumij": "I have had stretch marks on my shoulders since I was a teenager. Because it isn't considered 'normal' I used to hide it all the time to a point that I stopped wearing sleeveless tops . Took me a lot of time to feel ok about it. And after years now, I absolutely give no fuck about what people think about them, or if it makes them uncomfortable because those marks on my body, makes me very comfortable and confident. It took me many years to understand this and how be to comfortable in your own skin!! 🤍", "saumitra2987": "@natashanoel001: A very bold and beautiful representation of stretch marks on the breasts and an excellent informative article on stretchmarks. Brilliant..", "viktortude": "As a guy I have marks on my butt. And I still love my cute ass.", "babuponuswamy": "😍😍😍😍❤️🙌", "amiteshkumar620": "More power to u girl stay safe 💪 I always stant with you", "rasika_sawarkar": "You rock 😍❤", "anamika7830": "My waist is full of strech marks... lets not get ashamed of anything nd accept the things the way they are 👩💛", "shashankrohella": "You are inspiration 🔥", "kajol_jain22": "More power and respect to you❤️🙌", "greyassasin": "Real shit", "arti_manmadkar": "Badly needed post 🙌💙 much power to you @natashanoel001", "just_niyoshi_things": "This gives a lot of strength to me as well. I have stretch marks all over my body as well and have many insecurities. So thanks to you for this post💕😘", "poojachaudharyoga": "Very strong post,,I compliment you in yoga fest,you are different and yes YOU ARE....❤️", "pcsarathkumar": "Stretch marks on boobs.... I love it ❤️ I even have some on my biceps 💪", "ayush_tatooz": "Yukkk,never thought people can do anything to get more likes n followers 🤣🤣🤣💗.why don’t you send this pic to your parents they would be so proud #stayblessd", "sandyparihar07": "@natashanoel001 hatsoff 🙏", "vijayanandoo7": "This is remind one thing mam Arnold Schwarzenegger says our body is gift from god we try to keep beautiful our body. Thanks for the post. ❤️❤️❤️", "ritesh_asija": "Use bio oil it will give you result in just 30 days", "amitoz_k": "u are so adorable", "zobszuba": "I have stretch marks on my shoulder because of intense workout ...thanks for reminding us it’s normal", "kumar.nick": "Latke pade h yr", "kakdiyabhavesh": "If you remove your stretch, you can massaj by me 👙", "_harikrishnankalakkal_": "Stretch marks can also be caused due to dehydration. Perhaps more badly in cases of skin over breast. Also do make sure that u r supplementing enough hydration.", "rashu._poo": "I feel so insecure about stretch marks all over my body since I have gained weight and lost some people see me weird and make comments badly I was just thinking that I was very much not normal as most of my friends don't have stretch marks it makes me e stay away from crop tops sleeveless thanks for this inspiring lines", "saddam_e_khan": "why hide the nippllLes ....nippLes vi show up kar do 😀", "chaitanyakumbhar569": "Very well explained mam I think this will clear many people's doubt @natashanoel001", "anuja_agrawal08": "@natashanoel001 Thanks for speaking on such realistic subjects. So many people out there need this. Including me.", "sachin.kbd": "👏👏", "manoj6600kumar": "Didi namaste 😍", "thanikal": "Thanks for sharing🤗", "swapnilgrane": "Useful knowledge ❤️👌", "komal_tayde": "Hey I don't know if you'll read this but I just want to say that you've have helped me identify myself and I can be pretty for sure you are beautiful inside out thank you so much for being a ray of sunshine in so many people's lives. ❤️🤗", "khushal_movaliya": "Such incredible message for all , thanks for give us this message 🧠📖 @natashanoel001", "prabhdeep_singh88": "Respect n love", "natasha.dcosta7": "🔥❤️", "dhruvhariom": "🙀🙈", "lok9686": "Madam super", "the_wandering_chopstick_": "Kudos to you for bringing this up❤️", "gazal_maria": "Hats off to ur guts. U r one of a kind. Everytime I feel low I always come to ur page and tht makes me happy. Watching vedios of U laughing and playing around with dogs. Makes me so happy . Please upload more vedios to ur page so tht everyone can watch and be inspired of U. ❤️ lots of love", "shasha_latchu": "Salute😊👏🏽", "dhillonavjot": "khud ko khud se azaad kaise kro..j maine aapse sikha", "gowrilakshmi05": "Thank u sister❤️ you took it to the whole new level of positivity.. your wonderful ❤️❤️", "tusharpatil_4u": "Real beauty🔥🔥🔥", "jatin_s0204": "Thank you for being open and bringing this topic.. We shouldn't feel shy to showing what we get as part of beauty ❤️", "filmyndrela": "❤️❤️❤️", "071praveen": "❤️", "travel.sanely": "🤗🤗", "mr_solanki2103": "What kind of vulgarity is this 🤨", "mr_bukhalil": "🌹", "sahiba_kaur19": "❤️❤️🔥🔥", "saurabh_sharmaoo": "Ma'am you are amazing and I love you 💖💖 i feel so proud that I'm your student 🙏😇", "sushma_kukreja": "@natashanoel001", "andrew.caldeira": "Dont wear a tight bra...for all d time...do wear a cotton tshirt....& massage with pure coconut oil & see d difference", "shaji.copy": "The stretch marks are present only on one breast. Is this because of Ill fitting bra, or maybe wearing loose sport bras? Also, doing regular yoga ensures elasticity of the skin. Maybe you are not putting in regular concerted hours. You may also have lost weight all of a sudden. I am sure yoga can help beat those stretch marks.", "maverickraul": "I can’t see anything wrong with this picture ans it’s just so beautiful", "rnagarofficial": "Love your stretch marks..kyoki wo yaad dilate hai. Ki apne mehnat ki hai..💪 @natashanoel001", "arcotnitin": "I Respect your lovely soul 🙂 brave women", "graciehazies": "I don't care about it as much cuz I have that too @natashanoel001", "xx___eclipse": "Respect ma'am 🙏🙏 @natashanoel001", "uppal_deep": "Itna long lacture 😵", "nashtegaurav": "Confidently spoken on truth 🙌🏻🔥📸", "anandyadav04": "I must say , The actual woman empowerment is you. God bless you dear , lots of love.", "kushala_dhade": "You're a boss lady..so inspiring 😍", "imiez_san86": "💋💋💋💋💋💋💋", "poommpaata": "Thankyou for this♥️", "jan.art.ha.123": "🙏🙏", "cutielicious4": "😐I'm still insecure", "chowdhurybhadra": "@natashanoel001 Everytime I see your post, it gives me the realisation I am not the only one. You are you, always. The #truthbombmom", "sathya26398": "U have always been my inspiration ! And after this post ,it's must for all the women to accept how they are ! Thank you Natasha ! And thank you for motivating me always when I m low ! Even in the class when we were asked to write a person's name who's ua role model , it was ua name that I wrote ! So keep motivating us and holding up the self acceptance factor so firmly ❤️more love to you 🔥", "james.tammy": "More power to you..!! ❤", "girlsbaldbeauty": "@natashanoel001 Beautiful ❣️", "rishiznandi": "❤️", "technofreek5": "Hey girl u r a super women. Salute to ur emotional and physical strength", "aayushi_gaur": "Thankyou. You make me feel stronger 💖", "_.kratika_._": "@_.the.one.__ so be normal with those on your shoulders. And of u have time then read this.", "jesh_padaya": "Its Lockdown all over world... Aur inki kuch aur hi BKC chal rahi he 🙄", "nehadrawat": "@shashikeshav000 ...", "royontherun": "Trailblazer 👏👏 way to bring up and tackle topics that are so hard to address yet necessary 🙏🙏", "pratishtha_0408": "Ma'am! I can't tell you how pleased i am to read this post! I always felt by being a 17-year-old, how can i have stretch marks on my breasts. Thank you so much for erasing that insecure doubt about myself.❤❤", "kalranavneet": "Hey, Natasha such posts are great, but what if we open Instagrams in front of our parents how can we explain them the intent behind this post. I would request u to please think over it", "dhruoov_tomar": "@natashanoel001 I am a men ..I am following you for long time..you are actually breaking all the taboo what people say about everything ...you are true teacher... respect 😘😘😘💓💓", "lithika__": "now I have got to know something through ur this post, and I love you! 💙", "prasadbrahmane": "This is Prefect example of being comfortable in ur own skin.....stretch marks are totally normal....love and respect 💓", "avijit.1997": "I appreciate this. And you have a beautiful breast. Be happy dear❤️", "yoga_king54": "Superwoman", "murmu_bijaylaxmi": "Thank you. It's just scars, no need to be worry for this. Love the way you are.... 😘😘😘", "journoarundhuti": "You know this post makes me think...I usually have a regular body weight as in it does not flactuate much but in last six months, I have gained fat around my thigh, leg area. And stretch marks. Maybe because of the lockdown time and I stay all alone, but I was feeling quite upset that henceforth I won't be able to wear shorts especially in summer due to this marks. I think after reading your post, I will at least try and feel comfortable with it. I mean it is natural and things that are natural should be accepted by me first. Thank you Natasha.", "aditya_production": "I salute you 🙏 @natashanoel001 for this Post", "petiteaiglie": "Dear Natasha, the same applies to me, out of all the things in my body which I complain about stretch marks are sth which I don’t mind them being there. And I am wondering why? Can it be that growing up society didn’t care much about stretch marks so it didn’t engrave in me as sth ugly? I am trying to understand generally “who” is the one that put me certain ideas in my head regarding what is ugly and what is beautiful, to be at the point where I am today not liking so many things about me. Sorry for the long comment 🙈 thank you for everything 😘😘😘😘", "samy16dec": "You are so brave @natashanoel001 ! This is exactly how my boobs look like .🌸❤️", "kamlesh_dholakiya": "Mind blowing", "vaibhav_the_yogaboy": "@natashanoel001 your great, more respect and more power to you.. missing your session😞", "sarvanichowdhury": "♥️", "boseprasun82": "Good post ♥️", "iam_sandeepk": "I love the way u see u take everything ☘️", "artygraphy": "You have no fucking clue how much I look up to you. I mean all the anxiety all the thought process and everything you did to look after yourself and building yourself stronger each day. Girl you are like my super hero.🤗 I was 120kgs a couple of months ago and now on my journey to get stronger to be able to rock climb this year I am 90kgs and i have lost count on my body parts that have stretch marks. But they have never and will never stop me from being me.", "bombshell.chic": "Caption is lit as pic 🔥❤️", "ginmit": "I needed to read this. Thank you Natasha ♥", "supriya.rajput.nogal": "😍😘😍😍😍😍", "rosewoods007": "Stop this bullshit please of fake feminism.... take some time out ... and get over your own insecurities first ... women in india are strong and definitely not miserable like you as you think about them ... stretch marks or not ... everything is all fine ... people with sense in their head don’t bother about these things ... i am a man ... i have stretch marks ... common for god sake ... have some respect... i agree that you are or were not strong to handle your insecurities.... but dear let me tell you ... every second women in India is stronger than you ... they don’t have to cup one of their breast and have it clicked with a high definition camera to get some likes on god damn instagram from where they can get monetary benefits... shame and petty on you ....", "thejoannadiaries": "Thank you.. I've suffered for too long now... You have shared the truth beautifully... ❤️", "hari_preetham": "More power to you girl💪❤️🌟", "pree.tea.pens.down": "Yaaaasssssss Queen❣️❣️❣️❣️ @natashanoel001", "nawfalsha": "That much courage 💪.. hats off to you guys👏👏 @natashanoel001 @anno690786", "ideepudj": "Body positive 🙌🏻👏🏻", "seriouslyayushman": "Thanks for sharing.👍", "faizchoudhary5357": "lovely heds off to you keep inspiring woman 😎", "nlsnkmone": "After Corona lock down nothing left.. Now no more.... We got hope From you... Keep going... ♥️", "_the__mad__af": "Damn it helped . I often judge my body indirectly or unintentionaly . But thanks to u i have started working on to look at the postive side. Thanks for enlightening our stupid brain who is easily influenced by the stupid ads which is mostly related to body shaming. Love uhh💜💜😊", "_k.verma_": "Something not every influencer..will discuss or put light on ..... AMAZING ❤️... IT really requires guts to put on such pictures...and u do this every time .. every monday. ♥️", "jayzsujith": "💖L💓v. 💖Y💓u. 💖B💓💓y", "yuktiagrawal96": "💙💋", "bunny_m179": "Amazing girl💪💪", "g.n.girhe1": "Why exposed?", "umamiyoga": "Are you a LEGEND?", "adarsh_xerzkon": "🔥", "dolly__1999": "More love, power & respect to you girl❤️", "its_vdm": "U are brave more than I thought.. talking like very mature😍😍😍😍... Big Respect🙏🙏❤️.. @natashanoel001", "shane5114": "You don't have to be perfect", "roopakrewari": "We gotta embrace our imperfections. This is what makes us human. Such a brave, courageous woman you are, @natashanoel001 :)", "ekwondurlust.sami": "TruthBomb- love and respect for the post.. Stay safe and Stay blessed", "timetomakegains": "A Mans weakness 😭", "kim_mishra17": "So so so much love and power to you ❤️😍 thanks ton for this post and the Caption just took my heart 😘❤️@natashanoel001", "amritashivani": "@natashanoel001 you are such a courageous strong young lady....hope some day I can be this mentally strong, and can be just me for me......#stayyou #selfacceptance ❤️", "rrj113": "#respect#", "_shrishawesome": "❤️❤️🙌", "swati.bharat.choudhary": "More power to you ❤️", "indianbullyboy9000": "Love your boldness", "sukku_dukku": "You are a true motivation ❤️", "anima__mishra": "Thank you for these words 💕", "rasmeet_singh007": "Do u provide online services", "geets_freefalling85": "@natashanoel001 I’m a mom of two beautiful girls, so I have gifted with stretch marks abundantly and yes I did try those Shea butter marks, but as u said during pregnancy, it used to be so itchy, that I have managed to scratch well too 🤣🤣 I had a bad feeling about them for years too, but now I feel proud having them as they remind me having these two beautiful gals and I’m proud about it. This learning for us as women and for men not to body shame any women is worth explaining. And I believe, when we don’t care about it, even if one does, it doesn’t matter at all ❤️❤️ hugs .. u stay safe", "maverick.mishra": "Does any body part and any body marks defines the person? I don't think so.... Yes definitely in today's world looks and presentation does matter but agar kis person ko define karna hai toh wo uska nature behaviour aur thoughts define karte hai... 🙏 Forever respect @natashanoel001 🙏💖🙏", "basudev_pandey_": "More power to you!❤️🙌🏻", "the_music_machine_": "You are truly inspiring.. even I felt so much insecure about this..and I guess not anymore..", "raaa1808": "Nats 🤍🤗", "mosesdmello": "Amazing natasha👌", "notoriousking777": "More power to ur attempts n initiatives to educate society through ur own self n knowledge n examples ... 🖖💯", "benita_saha7": "their are few things we usually dont discuss but we have the curiousity to know why this is happening or that is happening... But sadly we don't, we suppress it... ur post is kind of education to me.. I bliv for everyone who have that zeal to know .... Grt...nd thanks for educating us ❤️❤️❤️", "ig_priyanshupal": "Much respect ❤", "ash143josh": "More respect and More Love to you ma'am ❤️👌👍", "isssha.k": "Omg! Thank you so much for sharing this i have this too and for the most of timei feel bad about it and my mum said if my futurehusband see this then it is bad for me!! But here im proud for having this❤️", "nishzak": "I believe stretch marks is the signal of our hard work.... Nd our sweat 💪💪... Be strong... Be helathy 💪💪", "sheetmolls": "😍", "theshark.tales": "Thanks for sharing this! I've had strectch marks since I hit puberty and yes they are soo normal! Thanks for this reminder for self love! 🤗😁", "justbeingaayesha": "❤️❤️❤️❤️❤️", "lubna_saba97": "We all have them we are united in this 🙌🙌🙌🙌🙌🙌 @natashanoel001", "akshu_siva": "Huge respect to you @natashanoel001 ❤️❤️", "gilli_suvi": "I ever seen this bold girl in this india", "piyutipul": "@anish_loves_you the bravery 👏", "psaeechotic": "I used to be fatter earlier, and I became very heath and fitness conscious due to insecurities. But when I became fitter and lost weight, I felt so good. I gained a lot of confidence in the process. Due to the weight loss, I have stretch marks all over my body. Literally. But I love them. They remind me of how I was unstoppable and worked out to lose that weight. Makes me feel proud whenever I see my stretch marks. It has never disturbed how I feel about myself, but only made me feel better. ❤️", "brindasm": "Absolutely needed in times when you feel bad about everything on your body. Thank you @natashanoel001 for your ever so encouraging blog posts@", "thisisdharana": "@peaceofsheeet", "evszzzz": "❤️", "farn00.v.f.vendetta": "some of you might say I'm crazy or whatever the fuck.. , but I actually really love stretch marks on my partner.", "vitu9741_": "Love ❤️", "tanyapriya88": "Relaxed now , respect to you ! 🙏 ❤️", "bindiyawali": "🙏 respect", "piallama": "You’re amazing. For me stretch marks have been the scariest things. Sadly so much shame and judgement they carry within their rivers. And it’s just the bodies way of making room. I feel really comforted and even love in this post. For some reason I just really trust you man. Thank you.", "marvelinfobox": "Thank you. I have stretch marks on my shoulders & stomach. I thought I'm the only one.", "lokeshlakshkar0": "very good think mem", "ankitapanwar0305": "I m having and m proud of it 😉 bt I like the way uh speak it out ...hats off 🙋💁", "mostly_artivist": "Love love love..❤️", "____its_me_starwin": "❣️Self-love. 🖤", "anju_me__": "Huge respect 🙌", "iam_upasnasingh": "Thanku so much ma'am! I have many people staring like anything when they see stretch marks...and if I wear shots ..those unwaxed hairs...it becomes very akward ...so thanku so much for all ur posts and motivation ...it means also to us .. whether we are girl or boy! We truley need this motivation to love ourselves more in the way we are ...not unwanted hussle for those costly artificial things🤗❣️", "kats.13": "Used to apply home made remedy for those stretch marks 😅.... After some time accepted that's just normal thing 😂... Thank you for sharing 😅🙏🏼", "_being_vinu_": "So Beautiful pic 👌👆🏻👍😃", "sumo_swain": "Knowledge💯🙏", "raj_punk": "The marks of strength ❤️", "themeerakisoul": "I have stretch marks at the back of my knees and I am pretty comfortable with them. I think we all should accept our bodies just the way we are. You are to good @natashanoel001 . Lots of love to you ❤️❤️❤️", "iarjun.balachandran": "Respect..!! Spread positivity. 😍 And i think more than personals, the shady tv commercials have made individuals feel bad about their skin.", "himanshi4mehta": "Some body positivity..exactly what I needed today...Thanks @natashanoel001 :)", "anwar.alienboi": "🔥🔥😁", "khanlala00007": "Iam male 26 i have stretch marks on whole body due to using steroids for End stage renal disease its normal ..also every obese person has these stretch marks", "shreeya._.161": "You are an inspiration for so many💖 thankyou for being you! Much love!!", "dharaa_13": "Cant relate more. @natashanoel001 you are inspiring us all to love and appreciate ourselves more and I think there is no better thing in this entire world. You have changed my life. Love you loads. ❤️❤️💙💙", "____divi_99": "Wow ❤️you're amazing🤗🙌", "isha59011": "Boob's marks ???", "anno690786": "It takes a lot of courage to post such a pic mam n explaining about stretch marks. Hats off to u. N kick ass to those who think this is sexy or asking for a pic of nip. Tell them to see of their mother,on whom u have sucked n grown up👏", "theplushkitty": "This is was so badly needed thank you❤️🙏😭", "prakruti.wellness.zone": "Ohhh! Heaps of Courage u have in ur soul, You Goddess!🔥 I Adore you So Much. Lots of Love & Power to you ❤️🙌🔥", "litty_mary_thomas": "Thank you for this Natasha !!! It really helps to have someone to be so open about things like this", "drkaushikravi": "Salute to you mam, it's NT easy to write and to post with a picture you need balls of steel 🙌"}