{"preethu_bs": "Your post made my day❣️ Thanks for being strong and making others feel the same! Loads of love❤️", "panchami.mallya": "The amount of courage that you have right now is so empowering in so many ways ! I'm sure many of us can relate to you in bits and pieces . The assurance you provide to yourself and to us deserves more than just a thank you❤️ deserves all the love on your way ! @natashanoel001", "jhallijaanvi": "Oh fuck , it made me cry.😭 You are strong and I love you ❤️", "cynicinc": "Hug.", "misha1993": "You know that you are a superstar right? If you don’t, then let me tell you. You are A SUPERSTAR, you are also special because you know how you coped with all these things. The world can be an ugly bitter place with sick minds but it’s us to have to move on and just treat people better. We love you for you, keep being you, and yes keep inspiring. I’m waiting for another ted talk 😘", "digee_": "Idk it's not my place to say maybe . But all this doesn't sound half as bad as my life! I don't think about it . And i believe that is very possible to forget.. You just need to try hard enough. Posting these incidents here? might get you approval and make you feel like a weight is of your chest or something but honestly you're just re enforcing those thoughts that you maybe didn't think about earlier . And giving people an Image of you to remember. I don't understand why would someone do that , but people are different ... Mental Thresholds are different too. If this made you cut yourself you won't survive a day in my life . But i choose to not talk about it and guess what it does go away ! I'm honestly not trying to demean you or something at all . Just hoping you realise posting such stuff is doing nothing other than making you and all your followers remember . Aka painting an image . Of a Victim . We all are victims of something , sexual abuse , emotional and physical abuse. But only a Few of us have the \" courage \" to label themselves as the victim . Don't ! You aren't ... No one is ... Life's hard but it will get better. It always does ...and if it's not getting any better , it's about to ! Honestly : There's nothing like ultimate happiness . You just pretend to be happy till you forget you're sad. \"Don't delete this comment let people see.\"", "misfitslave138": "We are going to be so cool when we are old. Random thought.", "keerthig5": "I just adore u!! 😘💕", "theglorifiedsoul": "God bless you dear!!! 🙏", "aslamshaikh7230": "Sexy", "shalinigupta10x": "I'm in tears after reading this... That is exactly what I have been thru in my life.. it's just like you writing my story.. @natashanoel001 I too have made peace and friendship with my young self. And this is exactly why I'm on a mission for all such women to come out of this feel and live a life they desire. Thank you for sharing this.. more power and love to you❤", "iam.r.k007": "Gorgeous beby❤️🖤", "shiana.moon": "💔", "namratasudhindra": "Aaaaaw big hugs you warrior girl!", "rifat_14": "You are an inspiration in the truest sense ❤️", "sameerbagga1207": "Rent of that flat which is infront of this window must be in crores 😍😜", "navreetkaurvirk04": "💜", "tanayashelar04": "So much crying rn😭❤️✨", "shraddha9107": "❤️❤️❤️❤️", "jerryisonfire": "STAY STRONG GIRL🔥🔥🔥🔥", "anoushkaiyer24": "Ohmygosh. Strength to you❤️", "manasviiii_21": "May God be with you and give you immense strength! Stay strong 💖", "kaanginemdragneel": "potty aai hai.", "rashidchasmawala": "👌🏿👌🏿👌🏿", "tanushukla25": "Simple. Raw. Truth", "dish3333": "Who is cute who is cute...", "nawabatifbokhari": "Round Ass don't tell a lie 🔥🔥", "bhagirathi.gujarathi": "More power to you 💪🏻", "makeoverlifestyle": "More power to u. You are an inspiration to many", "revo_lutionman": "Wow!!💜💜💜", "roshni_rollinmyrs": "Loved it! Thank a LOT to you❤️❤️❤️", "__liz.biz__": "You're a warrior❤️ more power to you!", "max.vortex66": "Hermosa😍😍🔥🔥🔥", "shivangi_chanana": "Natasha! You fill my heart with so much of love with such original and genuine confessions. With anxiety and any other mental illness by your side, it is so difficult to confide in anyone. And here you are brave enough to bare yourself on such a platform. More power and love to you.🤗🥰❣️", "rafiya04": "People have said everything already what can I say as a woman I just respect you from all my heart that will be there forever.", "tanvi.s0036": "OMG seriously u were sexually harassed ?? Even your cousin ?? That's so ridiculous wtf , but u fought back that's amazing I'm glad you're strong", "__muskangupta": "Love you soo much ❤️❤️", "komalkubsad": "Way to go girl! Lots of love!! 😍 keep healing and spreading this pure energy that you are! Love your posts. 😊", "dt.drishtiparekh": "Wow!! 🎩 off", "mahak_rathod": "Hey Natasha, I’m in love with the kind of person you are. I have been recently following you and thought where does all this positivity is coming. Deep down a person who has gone through so much has evolved into such a beautiful person and now helping others to change their life and bring positivity and so much self love. Whatever I have read until now is penned so nicely and relatable that no gal will feel they are wrong or weird in any way. Salute to the evolved you and the old you, who gave you so much to share and help others.♥️", "fire.of.shiva.99999": "Love your life and spread love....🌹♥️🤘", "ananyasahay": "Beautifully written. You're so strong. An inspiration for all of us. Made me cry 😭❤️", "gopipattni": "More and more power to you. I wish the world was a better place for us women to live fearless. But because of warriors like you, atleast we can learn to fight !", "x_dimensional": "I don’t know how we gonna change the environment, the mindset of people and hold them accountable. That’s why I’m trying hard to secure a job at a more secure and open and a happy country where there is some value of life and respect . Kudos to you . Such a bright smile with such a dark past. You are really a perfect role model to these women from all age group . Kudos", "achilis_thegladiator": "❤️❤️❤️", "deependra.sharma.39108": "👍👍👍👍👍👍", "jaya.tyagi._": "I'm so proud of you😭", "sonabhattacharya90": "❤️always", "i_kamya_sharma": "M speechless! Lots of love, light and peace to you. ❤️", "tamaneeee": "Just dropping a ❤️ for you.This is all I can do :) 😘☀️🌻", "sanju.yaduvanshi": "Very cute 💯😍👌", "lana_kamel": "That was a lot and just reading it all, i couldnt swallow the words and all that has happened to you. I am so happy you came through and to share your pain with everyone its not easy, it takes all of me to confide in one person let alone the world. I dont know really what to say other than thank you❤️", "mokshadosa": "Me too and on and on and on... bless you.", "aisharun27": "You deserve every bit of love on this planet! 😭", "rocker143143": "@fcukbitzz follow here", "poetryechoes.shailja": "Natasha, the more I read your posts, the more I like you. The depth of honesty and authenticity about you is rare these days. You operate from the heart . Dont worry about people advising you for trigger warnings. For your regular followers know you and accept you for who you are. Stay the unedited, unadulterated, uncensored, unbeatable version of yourself. More power to you. Cheers shailja", "pmpsaeed": "Pagal", "reality_bite": "🙏🙏🙏you are the one who blow my mind and when I read your post I jus ❤️ it", "bidisha13": "A tight hug for u lady ..I am so glad that I follow you.u r so brutally honest and really I am so so inspired by u .thank u so much ❤️", "leonard_anand": "Your clicks are always fabulous 😍 perfect capture perfect lighting’s 😍🤩🍫🍫🍫", "the_errantsoul": "My heart goes out to you. We have endured enough.😭 Now is OUR time. Sending warm hugs your way. ❤️", "optimistic_fairy": "You are so INSPIRING ✨", "bikramveganchick": "I still feel this way so I get it. I live in fear every single day.", "_warrior.yoginii": "This is mesmerizing, Caring, just immensely feeling the pain of every single women who is still dealing with this. Much tendency love ❤️ much power to you my lady 🙏🌸", "mybucketlistgoals": "If I'd be at your side, I'd have never shared my dark past. And i still can't do it. It's difficult. I'd often feel like people will judge me, nudge me, grudge on me after hearing it. I've trust issues. So bad that I can't even trust myself at times, forget about others. But this is deep pain. I'm shocked seeing the level of courage and guts you've. It's something not everyone possesses. But you're amongst the HANDFUL who do. I'm so speechless to react right now, I don't even know what to say ahead 😢🙏", "illakiyagovindh": "You are incredible❤️", "yet_another_speck": "So proud of your honesty and the woman you have become! Keep being the badass you are!! 😘😘", "kavdgal": "@natashanoel001 You are strong, beautiful and poise. Love yourself and live your life at fullest. Forget tomorrow... live today 😃🤗More power to you.", "swati.sharma883": "😘😘😘💗💗no words ..just lots n lots of hugs n hell lot of love to u...", "sidrocks1947": "@natashanoel001 hey Natasha saw ur Ted talk , thank u so much for choosing courage in ur life n sharing ur journey 💖🙏💐 Yes we are healing one rep at a time , one day at a time💖🙏💐 may u receive so much joy that everything , every part of ur being gets healed💖🙏💐💖💖💖😍😉👍 may grace be upon u , may u receive all d help possible from wishes prayer s n blessings of existence💖🙏💐 may u grow to ur fullest blossom💖🙏💐 Amen💖🙏💐", "dinimadaryani": "What you just wrote made me reminsce the first time I wrote a letter to my younger myself. I cried buckets full of water as I wrote each word down but it was such a rewarding experience.", "angelsintown": "Love u 💖", "pinkcosmosflower": "♥️", "sonal_kulshreshtha": "You are incredible..have you thought about exposing these people who have hurt you? How about making their like miserable?", "dipti_eshwaran": "More power to you and all of us sweetheart can totally realte😻🙌🔥", "poonamkhatri_rbk": "I m glad i read this !! N found you over Instagram ❣️❣️ u inspire !!", "imranpatel7": "Lots of love and power to you. May You heal and blossom again. ☘️", "prashantsharma369": "More power to you @natashanoel001", "sunjeev_sharma": "Lovely 👌👌👌", "crispy_turtles": "I don't what to say. This must have taken so much strength. You are such an inspiration. More power to you!! ❤️❤️❤️❤️❤️🤗🤗🤗🤗", "sarath7493": "You lovely inspirational piece of human being ..!! ❤️🔥 Thheeeee Bessst", "thelenayouknow": "Thank you for speaking these words. ❤️", "folk_soup_": "More power to you. You are absolutely wonderful.", "ragini_radhacrushnun": "Here’s to strong women @gopica_ 💯❤️", "rxya.uwu": "Wow this is beautiful", "nihahaharika18": "*in tears* feeling very strong this time. 😭", "gulraj83": "I just don't believe. What u hav written. I don't think d ppl r as bad as u r mentioning them. How can ur cousin b on top of u. How can ur own uncle masturbate on ur back. If u r right. Prove it to me. I vl make them pay for it. Else u apologize for wrongly mentioning all bullshit. I don't think our society is as bad as u hav described.", "chocolatecupcake8590": "U r fighter..omg u r such a strong lady..its ok to break down but u came back stronger n tat is not easy..i salute u..am so proud of u...n im secretly having a girl crush on u❤️..cse omg i love u soo much..n i love u potato..hahahax..n u r such a beautiful person inside n out..😘😘😘", "hotcurlymesss": "@drishti.canary", "vaishnavimsuresh": "Its", "bombayiiteatheart": "Tears and respect, Natasha!!!!! I have no words right now....", "cocofranklin1234": "We love you. ❤️", "fusionchef2508": "🙏🙏🙏🙏🙏🙏🙏🙏😭😭😢😢😢😢😢😢😢😢😭😭😭😭😢😢😢😥😥😥🔥🔥🔥🙌🙌😍😍😍😍😍😍👌👌that’s everything is true-U did everything & on that I m not against,furiously life is about respiration,some bitchs help to attack some innocent people,even its so hard to to get freedom of life-u fight because u have the fire 🔥 inside u from the beginning.U R BLESSED FOR THAT———- Some keep Quiet Some heel themselves Some protect themselves Some move on & on Some leave the house Some burn themselves Some do Sue-side Some change their sex Some became prostitute Some r still working Some take revenge Some give up to god 🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏 Do not get disappointed in life when you are right in the right position", "__nivita": "❤️ @natashanoel001 maam you are truly an inspiration!🔥", "sarath_t_shekar": "❤️👌👍", "walter_sammy69": "R u yoga instructor", "divyasrivaka": "🥺😢 Deep", "muskuratilife": "Oh my..you truly are a WARRIOR 💖💪. So much love and respect to you my girl👏. Couldn’t read without crying. Hats off my dear..wishing you love,love and only more love always. From a mom of a girl.", "bestcurvesfitness": "Superb mam👍👍👍", "vrindakhatore": "You go girlll😭😭😭😭", "helen_veena_sasi": "It hurts dear😌", "malinalli_xochitl": "😭 warrior, brave, strong, inspirational, motivational, beautiful, empathetic, kind.... all these words and more apply to you Natasha. Sending you love and light 🌱💫💞", "heyitsmeashwarya": "This is too beautiful ♥️", "yogic_wanderlust": "❤️ love you so so sooo much for your vulnerability and authenticity! Hearing your stories make me cry for a better world for the future but it starts with healing and you are healing for the rest of us too ❤️❤️❤️", "d._.anoushka": "Sending muchhhh loveee to you lady❤️❤️❤️", "chakshita87": "❤️❤️", "shuvangi1474": "You are such a beautiful soul! You inspire everyday @natashanoel001 💛 I love you so much! So much! You're my inspiration! Thankyou for everything! 💙", "scarlettrevster": "Your story is so powerful- you have risen above and not played the victim, as much of society today would have you do. You shine forth so much strength and positivity, no one would ever know you went through such terrible things. Keep telling your story, and keep putting down the lie that everyone needs to play a pathetic victim after something bad has happened. Everyone can rise, and you are such an amazing example of that.", "offl.kid": "*bow @natashanoel001", "dambarrimal": "👍", "pradmont": "Tandurusti", "ae_prabhu": "This gives me chills and just puts it into perspective that how real these cases of abuses and assaults on women of all ages make them secluded and feel self-hatred. I truly appreciate and love the way you potray yourself and just inspire not only women but also guys, like me, to be our best and also supremely respect each other irrespective of what they are!", "theunprecedentedgirl": "I understand you. I have been through what most of you have gone through. It’s sad because of our patriarchal society. Men are brought up freely by their mums. There shud b good upbringing at home. Then blame society. Society is what we make. That’s the main reason I don’t like living in India and mainly when mothers hush it off to adjust and be silent to preserve the respect of such non sensical elders.", "geemuuuu": "You are a Goddess ♥️", "chhavigupta21": "Each and every word... Every feeling... Resonates.", "sam.athematics": "Ur amazing and so beautiful!!!", "pam_jacob10": "Thank you ❤️❤️🙏🙏 sending you all the love... 😘😘", "leesha_g": "Wow, you went through all this and yet, look at you, you’re a million times stronger, beautiful, confident and an inspiration to everyone. Damn you had me crying. You are such a warrior, I will fight anyone who says otherwise", "mahimabathla": "I would say I am sorry that so much happened to you. But no, this is so beautiful that you go through with all the things that happened to you. You are helping so many of us because those things happened to you and you taught yourself to get out of them. So much power, growth and love to you ❤️", "deepakprtp": "You a real fighter and that's a great motivator", "shereshavodela7": "Oh my God @natashanoel001 I can't relate to this than anything else. So brutally honest and this I would say women experiences every day. Faced a couple of times men mastrubate in front of me. I punished my sexuality, covered myself in loose clothes, gained weight to hide my curves, and now scared to talk to men. I found many ways to blame myself for being me. Salute to you my girl 💝", "pallavizlife": "You made me say sorry to mine. I am really sorry to my younger self, for not saying how much I loved her. Today, I want to say I love you my younger self.", "cottonpearlss": "Dear @natashanoel001 I'm broken badly 💔 I fully understand how painful moments you came through especially in childhood.. I DM'd you.. You may get shocked... But I am in the situation to feel why should I love man when he teaches how cruel he is in every occasion..Sorry for my reply...But I am just in the stage to learn from you lot of things...My prayers for you always for peace 🙌", "reeeet29": "I feel youuuuuuu🌹🙌", "khushbu.sharma.923": "U r amazin man... More power to u💗", "mtrivedi23": "Hey @natashanoel001 firstly I would like to congratulate you on your success of becoming a powerful woman with great heart! You know like I've been following you since 2k16 and not a constant insta user but yes whenever I get time i do read your posts.... Firstly I used to think ure over aggegarating things.... I just jumbled the word hope u got it... But lately as I kept on reading ure posts I got to know that ure a true warrior n i respect u a lot.... Lots of hugs n kisses keep embeacing yourself... Me n everyone... 😘", "schrodingers_gato_36": "🙏🏽🙏🏽🙏🏽🙏🏽❤️", "lakshmi_kodandaramaiah": "Lots of love and hugs to you...🤗🤗❤️And hats off for your boldness..Truly a beautiful super woman..Respect👏😊", "lightograph": "Samane wali khidki ko pata hai ki AAP Uske samane rehti hai?", "neetea.desai": "You have no idea how much I love you for your goofy, raw, honest and super badass self ❤️", "cammeo_forever": "Huge shout-out to you boss girl ❤️ It takes alot of courage to stand tall in this world after whatever you have gone through and more courage to write it down. I feel so proud of you and more proud of being a girl myself. You are a true warrior and I am so glad your makes me strong and positive. Lots of love 😘❤️💪", "aashna_930": "@natashanoel001 Thank u for Giving this feeling a beautiful sentence in beautiful way.. Thank u so much for making me belive more in happiness and more in myself... And from now I also start loving my youngerself.. As a person I will be more amazing and wonderful..... Thank you😊", "latika_yoga": "You are a true warrior who did not give up anyhow👐, applause for you👏👏", "jasminelily16": "Your posts are just so real an heartfelt! So much love!! Everything you've been through is just so inspirational, loving your journey!! 🙌🙌❤️❤️", "j_bhimani1210": "@natashanoel001 No words for what you have survived but You are Inspiration.. You are damn Honest and i love you gril for what you are 😊❤ Salute to your courage and you.. You have proved we are beyond our skin and body .. Your soul is beautiful 🦋😊", "pm001600": "😍😍😍😍😍👌👌👌👌", "utsavi_prajapati": "Strongest woman on earth !!!! Feeling proud 💕👌👍", "krishnaprasad987": "Aap Pagal jai SA kyo look banate Ho Jackie apke under Jo sundar Natasha hai use apne itna batsurat kyo bana diya hai lagata hai kisi Ne apke saath kuch bahut galat kiya hai isiliye aap us Sundar aurat ko kahi Anne nahi deti apka jindagi apna hai style aur sundar hota yadi woh aurat nazar aati Jo real me bachpan me kahi kho gayi hai sorry but you really want to be overcome from this pain of aurat be happy and healthy and ossome do not cut hair your hair is your beauty and you looking ossome with longer hair you accept you are woman who is looking beauty without his past incident", "farhaan.mohd": "saw all ur pics dam cute", "imagebydebarati": "Gosh Natasha.. More power to you girl! ❤️", "dimension860": "Woww so dashing so sexy🔥❤️👍👌", "bhumiraj83": "Heart on sleeve 101❤️", "malcolm.brady": "Hot pic", "carpediem.zie": "You are ‘LOVE’, Tasha 💕 Much much love and tight hugs to both of YOU 🤗", "_pankhuriagarwal": "More power to you! What an inspiration!!❣😭", "eshwar.s.bujurke": "👌👌 U LOOKING PRETTY CUUUUTE PIC 💕💕💕💕", "akanksha327_official": "Its so painful.... But we are stronger than the thinking of ourself...❤️", "asthamalik": "@natashanoel001 You simply inspire 🙏", "slumberella.18": "Just want to say, I'm glad you didn't give up. 💙", "divsadarsh": "😘❤️", "theunidealwoman": "Everything you say makes so much sense. I have found myself escaping all the time. As if escaping would mean just jumping the pain and Suffering that accompanies such an experience. But it doesn't work. But how do we make a conscious effort towards embracing the pain and still loving ourselves? It's a dichotomy I fail to understand and playout for myself. Grieving is important but it takes a toll on yourself.", "tarak.king": "@natashanoel001 I appreciate ma'am. I'm great fan of you and your work.", "neharanglani_": "Salute♥️", "someone_shajee": "😍😍😍👍👌💗", "shweta_arora28": "Girl, you are damn strong. Stay strong.", "tanikaafanson": "❤️❤️", "iinakiyaii": "It shows how strong a girl can be❤️", "vidyarao23": "This moved me.. like seriously.... Thank you for explaining self love so beautifully... I wish I could hug u right now for being so inspiring, so bold.. loads of love...", "anandkadkol": "Which yoga it is plz tell me", "ashishchavan_292099": "Ur sexy figure❤️😘", "sandeepkbamane": "Fantastic", "valmypal9": "Your words are unsooken truths of so many girls,who too may have written sumilar notes to themselves or verbalised something similar..Theres alot I identified with as do I identify with your strength of how you have turned it all around for you and how you show thst it is an ongoing process of healing..Warm hugs and much love and admiratiom from a fellow survive in this thing we call 'abuse'", "megha.john225": "Lots of love to you!❤️❤️", "fahim.munir": "You are such a brave girl..❤️", "queenelse13": "It's not one single day where it all falls away, but one day at a time, one step at a time. This is the reason I observe all your posts and enjoy partaking of your raw, authentic beauty. Much love you you @natashanoel001", "ashitakushwah": "More more more power strength love..........💕💕💕💕💕", "sikandar_art": "Koi baat nahin sab theek ho jaega", "y0gann": "Dear @natashanoel001 lots of love to you...always..tc dear", "apar_naaa": "💙Lots of love💙 One true inspiration to love myself no matter what all shit I've gone through. Thanks 🌸", "rum_meow": "❤️❤️❤️", "jenajiya1": "Related", "samanthaaw95": "Oh my goodness, this breaks my heart! I’m so glad you were able to fight through so you could stand here today and be the warrior that you are. You stand for every person, showing them that they’re not alone and it will get better. I admire you so much for that, here’s to always growing to be better 🙌", "petiteaiglie": "You are beautiful Natasha! You don’t deserve pain, only love.. I have tears in my eyes. Nothing has ever been your fault ... Take care, you are strong 😘😘😘😘😘", "sumi_sekar_": "❤️", "sangeetha.pm": "Ek hi Dil h,,, kitni Baar jeetogi ? ❤️😭😭😭😭😭 #crying😭", "jeca_444": "❤️", "loveresayogaa": "👌❤👌", "jaatni_2347": "@sweety_singh05", "aakanksha__k": "Hi! It's beautiful to read everything you post. And my heart goes out to you for what youve been through. Just a friendly advice: please out trigger warnings before any posts that could cause retraumatization... Because I've seen people go down spirals when they read about such struggles, even if they really admire the content..", "propertyvaluation_connoisseur": "😍", "darkisbeautiphool": "More power to you.❤️", "exhalelabel": "Cannot even imagine everything you have been through! It takes immense power to actually forgive yourself! It’s definitely not an easy task! There is so much truth to your post that is really inspired reading it all the way through! I can’t imagine the kind of strength you actually provide people with through these mediums! Thank you for being strong so people like me continue to be strong! Lots and lots of love! @natashanoel001", "subhramoitra": "I bow down to you, lady 🙌. Not for being bold, but for being so true to yourself and to so many of our younger selves. Being so vulnerable yet so braveheart, for burning inside but being the light to the rest. 🔥💕", "theappychef": "How do you manage to pen your emotions in a way that you are an open book? Thank you for being so brave and saying what you feel.", "invincible_wini": "😢😢wow I mean I don't have a emoji of happy tears otherwise I would do that. People thinks it's so easy to love Ur self but they don't understand that loving Ur self and being selfish are two different things. God it's so hard to believe u r capable. And u r rocking it !!!! M proud of u girl!!!!!", "anitakerai101": "💕💗", "prekshajain_": "You're an inspiration ❤️", "hasmithagowda_": "Big hug💕", "naithaninikita": "It's so honestly written. 💙", "laxmi_maurya_43759": "I love you ❤️ 😘 and I do love me too ❤️😘", "devendra_suryavanshi": "Hot🔥", "patronuschauhan": "@natashanoel001 I'm crying. Sending you hugs & love. Is this the one you said in your story that you \"may\" post ?", "aiswarya_desaraju": "I love you 💞you are such an inspiration 🙌", "rakeshtomar95": "💛💛", "tanviprya": "More power to you. Sending you love!! ❤️❤️❤️❤️❤️", "hurtis_on_the_run": "@natashanoel001 it is beautiful to see your journey, reading your posts are so relatedable and seeing you grow out of it truly gives strength to people like me to try and do better", "aho.takle": "You amazing women, more power to you ♥️ @natashanoel001", "riactionn": "thank you for writing this. more power to you. x", "bindu_anju": "🙌🙌🙌", "su__surya": "You've penned down all those emotions which I've never been able to express in words till now😭❤️", "shravya_00": "❤️preach", "tanvipatel26": "You are such a strong force!♥️", "khannaharshita": "💜💜💜💜💜", "vikranth_rana": "Such a beauty 😍😍😍😍 and Ur so cute today btw 💝💝", "aami.bee": "💞💞", "akansha__vishnoi": "You go girl..you are a true inspiration🤗 more power to you😘❤️ @natashanoel001", "the_virago28": "Kudos to u girlie💋💋👏👏👏", "murphyvadhan": "What I went thru growing up, seems miniscule when I read this and yet the pain n trauma resurfaces , wen least expected. So I cannot fathom how you went through all this Natasha.. Bravo girl, for doing what you are do and the beautiful yoga bod you have worked hard to achieve , even wit all this pain.. as a fellow human n sister, I send loads of love to your present self n to that young vulnerable girl. I too am sorry what this world did to her. Keep up your beautiful smile and someday hopefully I will meet you and give you a big tight hug and learn a lot about how you do it. Till then, only love and light💟💟", "dsouza_girl": "You are brave gal ❣️", "alll_about_soul": "Yes most of the time I blame myself, wtf is going on dude it's just because of u n all shit and what at the end of the day when my tiny eyes fill up with lil amount of salty water 😂 I start flying in heaven... Like everything is okaaaaaayyyy u just keep flying...... #Phirseuddchalaaaaaaaaa💜 big hug @natashanoel001", "pragya.jainn": "💕", "poojaa2911": "Did the things you've mentioned above actually happened to you? 😐", "welcometoluckycity": "💙", "d_badass_slayer": "Relatable", "vimla_dindoyal": "I first came across your YouTube yoga videos by coincidence.. that’s how I first knew abt u.. n decided to follow u as I liked your goofiness and true self..never thought u had been through so much at such a young age.. I can only wish you all the best and stay brave.. u r a warrior and an inspiration ❤️", "i_am_dj_2018": "❤️🌷❤️🌷❤️🌷❤️🌷❤️🌷🌷❤️", "saeewalve_": "❤️", "bru.notte": "More power to you❤️😭", "saumyamishraig": "♥️", "liveforpages": "I have been following you for a while now. I don't think I've ever said thank you. Thank you for being real. It helps in ways I couldn't imagine. Sending you love and support always 💜", "prannyy": "I'm crying rn lol😭", "thatindianyogini": "Bravo! So much truth and pain in these words..🤗", "smruthyseb": "I'm so glad that you decided to post this💜. Lots of love💜", "amitanshugupta": "👍❤️👌", "manyajain._": "You are so strong! Lots of love!❤️❤️❤️", "_aashima_ash": "Wowowowwwww.u r sooo brave ..wowowowowowo🔥🔥🔥🔥🔥🔥 u go gurl❤❤❤ perf message", "priyamvadamangal": "❤️", "divya_kukreja215": "Much needed post... So true🤗❤️", "akash_chill": "You're a brave soul", "old__s0ul": "❤️", "_yxnshii_": "*goose bumps * You go girl. The strongest of alll♥️♥️♥️♥️♥️♥️♥️♥️♥️ much loveeeeeee .", "natashanoel001\nVerified": "Verified", "storiesbysurabhi": "PERF ♥️ we always end up blaming ourselves even though we have barely done anything. Perfect message. @natashanoel001 ♥️", "mads1088": "Love ❤", "shradddhha": "❤️❤️❤️❤️❤️ more power to you. Love You:)", "unaayrus": "This is so beautifully written. Made me tear up ;-; more power to you💕✨", "jaini03": "So much love and light your way. ❤️", "oriel_2702_": "Star⭐", "arjunsraj": "Beautifully put! More power to you, @natashanoel001 🤘", "taran.warner": "Beautiful!! This is what healing actually looks like. It's acknowledgement of the past and not trying to forget it", "jenyappleblossom": "❤️ you @natashanoel001 ... you're so inspiring💞💞"}