{"manishaisadass7": "❤️", "vulta_sidha": "You are awesome 🔥❤️", "himalayan.king": "💕💕", "i_am_mayurkapadiya": "Wow boom🔥", "taani_medha": "@natashanoel001 didi you are ♥️♥️♥️♥️♥️♥️♥️♥️🙌", "so__b__it": "That was enlightening! It's heartening to see women open up about sex. I wish you find all happiness", "theroamaround": "This is so honest! I love that you are able to share this! Everyone should talk openly about their experiences! Thanks for leading by example💜 I just feel sorry for the people who take this sharing in the wrong way. 💯💯💯💯", "yogini_chethana_hesh_35": "Really appreciate your honesty my dear friend... Keep smiling take care of yourself... 😍🥰", "misspunnybones": "OMG!! Can u be any better!! I have read so many posts n watched so many videos of URS, but THIS one by faar, has been one of the best that you have written!! Things that we are willing to say, but don't!! God bless u..More power to u!!", "jaya.tyagi._": "U r my favourite hooman ....u deserve all the happiness🙌", "joybhatnagar1212": "So brave of you to share this. Talking about sex and orgasms is still a taboo in our country. Men are still oblivious of the fact that a woman needs to be pleasured too. Porn doesnt help at all, it only screws with our expectations. So guys, talk to your girl, there's no harm is asking what she likes in bed, its a simple give and recieve. What you expect should be reciprocated, and never force anything. Love her, pleasure her and just go down man. Beautiful post, more power to you.", "vishu.jaiswal": "💖", "ravi0077780": "Just amazing...Fall in love ..❤️", "stantxheva": "Powerful woah!! Keep loving urself and ur vagina!", "vampire.69": "Super sexy pose 😋😋", "hasini.nakshmitha3631": "babe i dint get it", "william55666rrrrr": "Sooo hot and sexy madam", "okaylemme": "I didn't understand what does \"I love jet spray\" mean? I mean how is that associated with sex or.. someone please tell me", "kashmirimermaid": "This is awesome! I was many times shamed for being overly sexual or sexually excited all the time. I believe all us girls should love ourselves and explore - find out what makes us feel good before expecting it from another. Also - a partner should be supportive and working hard to your pleasure. Not the opposite! I’m sorry you went through that! Lots of love and power to you ! ❤️", "sharad_sehrawat": "U also get it in rishikesh💕", "jasraj23": "U have said and done as per your wishes finally .It has given wings to many .but don't mind my saying so as a moralistic or something else ,what bothers me is not ur views but some teens or underage followers of yours. Hope insta has a filter for that.", "vinayvtec": "WoW! You have keyed in the emotions in an amazing way. I wish people understand the difference of making love and just satisfying their lust. 🙌🙌🙌🙌", "michelle.murzello": "You are amazing. Soo beautifully penned down what you heart is feeling. Not everyone can do it..superb!!", "sureshan_iyer": "As a man, I would say your status not only an expression of feelings of some womens out there yet, education for mens as well to understand women further. Boldly penned down and you use some words which consider as taboo in Indian society. Kudos to your bravery and hope womens should speak louder than before, so that society can understand entire womens feeling from single women's voice like your status. Jai Shri Raam.", "harshish25": "Damn! I can relate to this on so many levels. Thank you for posting this. More power to you ❤️", "meenakittycat2344": "If someone hurts my feeling, I give them smile and leave...because I didn’t hurt that person by verbally or physically... hurt me ...it was nice knowing and leave...because I have many other people who knows me and never hurt...", "offl.kid": "@__chandhuuu__ this is it !", "gaganramachandra": "The honesty in this post is painful and beautiful at the same time! More power to you!", "rg2409": "Your story gives others the courage to speak up their minds.. I have always been faithful to my partner. I am sexually more active than my gal...I like going down on her but she always stops me from doing it so that she does have to return the favor. I have tried to persuade her do it with protection but it never worked out. I cannot cheat her but the only way to end this is make myself believe I am overdoing it", "shehara123": "👏 every woman would have felt some part of your story or all of it at some point of their life ! You hit a nerve in a positive way ! Women go through so much x💗", "sheethal_chinnappa": "You!! Goals ❤️ The first post i read this morning and i know nothing will beat this for the rest of my day. More power to you. For the things you've been through and how you help ppl around by comfortably penning it down... you are doing such a fantastic job 💕There is so much to learn from you @natashanoel001 💗", "adixtiii": "Wow girl that's some real guts you got and I appreciate you so much for that!! ❤️ things need to be spoken out loud", "laila.popatwala": "Thank you so existing.", "rohangupta6804": "👌", "pariwhoop": "You were so open in this post.. Its beautiful. Sexuality isnt something to be denied and I'm so proud of you!! You look amazing in this picture by the way. I'm so happy you have such a loving and supporting partner", "ridhi_kappal": "Wow just wow 😍", "sushmitaroy.15": "@madhumita_roy22 a must read", "gulfammotivation": "You are ordinary women, you can say anything which nobody can share hatts off you with lots of respect 👏👏", "bhardwaj_mansi": "@saakshieeeee", "babusha.jain": "@aijax23", "dharmendra_dewasi": "Just a curious question asking here because I never found the satisfying answer, tired of searching it. What is orgasm? In simple words men gets done when they cum. What about women? When do they get done? Do they also cum? If yes when and how when compared to men who cums when their penis gets stimulated or after continuous penetration. Really wanna know from the ladies themselves", "the_honey_effect": "U are awsome. Thankyou for sharing. I think we all should be able to speak so openly. Only then can we support eachother. Thanks for opening up 😊.", "rishiraj__dutta": "Good for you. Your happiness is received and blessed", "priyankasood8254": "I love how strong you are in sharing your story. I am the old you", "syama.d.nair": "❤️👌", "lucky_klicks": "It felt as if I Just went through one of my old conversations with a close friend.... Gals need to learn to say \"NO\" or connect to their Body and Enhjoy the Pleasures it offers them more than someone else. Keep up enlightening the world my Gal!", "aisha.tak786": "Overwhelmed with your courage to express this so openly just throwing all within you out.. Not to your partner but just to the world.. Like a volcano erupting.. Guess many have such volcano within.. The lava burning our selves within.. And we suffer in pain, traumas even though the act is supposed to give you pleasure or relax you.. De-stress you but you end up crying.. Like snatching a moment of pleasure is a big crime and as you tried to do, you pay with pain, tears and even your mind keeps throwing old traumatic flashes in between.. Girl.!! You really spoke for so many.. (my friend just forwarded me this post now and asked me to read, knowing me well.. And I just read this and wanted to see you so read another one and am so thrilled.. Following you.. Will definitely be looking forward to read all and feel connected as and when I can.. Thanks for being YOU)", "kav_ie": "👏🏽👏🏽👏🏽👏🏽 wow! 🙏🏽", "shenu_perera": "❤️", "sharma_ira": "Mind blown × 194847749301", "kunalgupta5689": "You are amazing, you write beautifully, more power to you. One day I wish you will write your own book on most serious issues that we are dealing with.", "ishiwije": "Well said", "anupqumar": "Great narration, really inspiring. Hope it helps many girls for getting out of their traumas and become more confident. Hope the sex was great and you enjoyed alot. At the same time, what sexy pic 😊", "paggyrider": "Love them heels🔥🔥🔥🔥👍👍👍", "puppiesnlambos": "💯💯💯", "bestcurvesfitness": "Super sexo", "floralpk": "❤️", "poppin_sid": "🙏🙏", "aslamshaikh7230": "Hotty", "mokshadosa": "WOW", "hillzville": "Wow what an amazing post!! So raw and honest and vulnerable. Thank you for sharing!! That’s wonderful you have a partner who will listen to you and support you. I know you said you love the jet spray (hell yes me too lolzzz), but have you tried any other sex toys - external or internal? I know I could rarely orgasm from PIV sex, but with an external vibrator it helped tremendously, especially after I’ve already came from oral or digital stimulation. ❤️", "princesaichand64": "S̲u̲p̲e̲r̲ m̲a̲d̲a̲m̲", "sangramghodkepatil": "So hot", "sapna.ramrakhyani": "I have no words to express what I feel after reading this......i m married for 21 yrs, for 17 yrs i would just have sex to pleasure my partner. I would fake the big O most of the times. Thanks to u for being so open and honest...love u", "mystic.light": "I would never be able to talk about my sexual trauma so openingly. It's amazing how you did it. This post triggered so much in my mind last night. I think I need to stop blaming myself and being embarrassed about the things that have happened firstly. So much more power to you ❤️", "gaiety05": "For the longest time this was me. It still is in some measure but I'm glad I discovered sex could feel good for me too. The shame of abuse and rape never really goes away. Even after all these years I respond to preconditioning of those years. Very often torn between feeling good or cheap. This post is heartfelt. I hear you, I feel you Natasha. More power!❤️", "puffs8": "You are amazing", "thesmilingtummy": "Thank you for sharing this 💕💕 keep doing you", "mynameismirzapur": "@natashanoel001 what do you mean he came in my mouth???? Like yukkk man..!!!! How can you do that like taking his cum in your mouth???", "placesnpeople_with_pallavi": "And I thank you for talking about sex ! Simply talking 🙏🏼", "mahnooor_malikk": "What a nasty w0man y0u are have y0u kn0w anything else beside sex??", "ishheee": "I love you so much 💗", "sagitzilbermanmusic": "Thanks for sharing. Enough with taboo’s around this subjects. This is amazing💛", "heldinea": "Yay! So happy for you! Thanks for sharing. 💝", "dixit_ghiyad": "I want sex with you really", "cottonpearlss": "@natashanoel001 Those shoes 👠👠 are 😍😘👌", "pilarmoragaphoto": "😍😍😍", "aryabehera143143": "U look insane in this sexy 🙂", "ammu11.11": "I connect💜", "satakshinandy": "❤️", "ammyco": "Wow, applaud you for putting this out on a social platform. If only more women would speak up.", "rahulvaidofficial": "🌼🌼🌼🌼🙌🙌🙌🙌 honesty on point 🙌🙌🙌🙌🌼🌼", "namita300888": "You are a beautiful woman. Even being aware about what's happening within is a huge step towards a change. And Now that you have felt the pleasure and know what it is like to feel and make love. Never look back and compare. 🙏", "avengeraadi": "That's what I call \" The Truth \" Expressing the Feelings", "manojzone": "Have never seen others to talk and discuss these things openly.. good going natasha more power to u 🙌❤️", "haritha_231718": "I wonder you.... I wanted to be like you... You are such a bind blowing person who speaks out the hidden truth of each and every girls heart... I love you for your own kind 😍😘", "chance_therachel": "This is incredible! Thank you for sharing your growth and past", "thebelovedprophet": "What are you @natashanoel001 ? I'm sitting here frustrated on not being able to be myself to the extend I'm not aware of who I am and what I want. I wish..", "boobear.panda01": "you given me new hope and words, thank you", "simplyununderstood": "Stay like this! Always...!!!", "subydoobeedoo": "You!! 🤘🏼 🤗 More power to you!", "bikshuyadav4060": "Attention Pose", "popo.s_girl": "@popo.s_guy Caption", "aabbheelov": "U didnt had best sex until u have with me", "gs03056_gagan_aujla": "M respect your feelings u awesome dear", "sonu_sandipan": "I'm really speechless, you are really a strong woman to express your pain and to try to move forward .May God bless you with all happiness.Regards", "trishalah_": "OhmyGod, I'm so happy. This is empowering. There is nothing wrong with you. It feels so good to see a woman admit that they've had good sex and love it. Please don't deprive yourself of that joy. Thank you for writing this, Natasha. Love 💙", "a_8_n": "Im just amazed...What you said is what I believe 80% of indian women go through. Because indian men are shit, self centered and dont care about anything else but themselves. It's sad. As a guy I have been educating my friends (girls) about guys, and try to warn them of a guys intention. And I love how brutally honest you're, yet a bit hurt about finding out you going through something like this! This is the pinnacle of life and relationship. I hope your partner is in the same. I hate men who take advantage of women, and yea there would be that 1 woman who will point it to me and call my a hypocrite", "menobodyyyaaa0": "I recently hooked up with a guy and all the time i was very very very nervous! I didnt get turned on at all and for days i was wondering something was wrong with me. One day i was talking to my friend I discovered I was practically harassed(my autistic cousin masturbated in front of me and it wasn't really his fault as he is autistic but i did feel harassed, attacked and really gross). This incidence made me really nervous with the guy.", "5556kritiqueen": "You are basically a model and rocking it", "thattrendstalker": "You’re liberating every girl out there and that’s amazing to let them know that ‘you aren’t the only one’. Love you gurl♥️♥️ more power to you @natashanoel001 ♥️♥️", "ash_thorat_": "Thanks a lot for writing this down. Trust me it's a story of at least 60% girls reading this. Keep up the guts @natashanoel001 . We love you.", "malabikasen": "❤️", "muskaan._.kataria": "This is mind blowing ♥️😍", "mrohit627": "Looking super hot madam ju", "madhuramohan_": "So proud of you Natasha ❤️", "robertdion621": "Salaam....you have old money or coins for sell...for a serious deal...and no cheating..... Ok..if you have pm me your WhatsApp number", "aiswarya_jayapreet": "I respect your guts🔥 that's lil🔥😘", "shivanisharma31": "This is so fucking relatable.", "isameerkhan110": "🔥🔥🔥", "floating.soapbubble": "Has therapy helped? I've ADHD and it is impossible for me to enjoy ANYTHING.", "racheltsingh": "🙌🙌🙌🙌🙌🙌🙌🙌🙌", "welcometoluckycity": "💙", "srushtiiyer": "❤❤ So true so real. I have finally come to the point where I have no qualms in saying that nobody makes me orgasm better than myself. And that’s not a comment on men. That’s just how my body is and there’s nothing wrong with that", "iampummyk": "Be happy 😃", "bethatgirlygal": "Seriously love you for this post❤️ Hats off to you girl👏", "thesoulwoman": "Read this and my heart exploded. ❤️ You beautiful honest woman.", "sonia.sheth": "Natasha! U nailed it.. ur post gave me motivation to find happiness in what u love fling.. keep it up.. love n cuddles 😘😘", "life_bhakti": "❤️", "tejaswiniinarasimh": "QUEEEEEEN YOUUUUU. Truck loads of loveeee on your wayyyyy❤️❤️❤️❤️❤️", "pushparajvino": "I'm fresher ;-) :-) Natasha eeeee", "capriciouslyyy": "Although, I've no experience to feel related, still all of this feels so relatable and strikes a deep chord inside !! 👏👏", "chintanrdx": "@natashanoel001 Highly appreciate it .... not easy to be so bold about it .... 👏😍", "misfitslave138": "That’s a first to see someone go into detail about that topic so detailed lol", "localzaika": "🙌", "gosai544": "બહુ બહુ બહુ બહુ બહુ બહુ બહુ બહુ સુંદર અને આકર્ષક છો એક્શન બહુ સુંદર અને આકર્ષક છે કસરત બહુ સુંદર અને આકર્ષક છે બહુ સરસ", "medical_muscle_": "#relateableaf", "shekhaarora": "You own your shit like no other! So proud of you! And so so inspired too!! Hats off", "abhijeet_arjun": "🔥🔥🔥🔥🔥", "gazal_tiwari_sharma": "💕💕💕💕💕💕💕💕💕💕💕💕💕💕😍😍😍😍😍😍😍😍😍😍😍😍😍 These are least expressed as far as this post is concerned.. Love 😗", "lookbeyondlookshair": "Natasha, you are a very beautiful and strong woman to express your experiences with many women who share these feelings with you. Sadly it is common and healing in silence is difficult. You along with @redheadwayfarer inspire us women to speak up. Together we can heal and stop this abuse for the future. Much love, strength and happiness to you 💕", "laxmi_maurya_43759": "❤️❤️❤️", "lipikaroy": "Love your posts❤❤❤❤!! Keep them coming !!!", "roseyessence": "Your strenght amazes me!!", "vikranth_rana": "Never thought a girl feels like this , I thought after sex or during sex both genders feels pleasure , but after seeing Ur story I can understand that some girls dislike a lot in sex .. I hope Ur partner after seeing this story realise Ur feelings and try to comfort you mentally too , and in those words \"I didn't want to loose my partner\" damm touched my heart re 💝 this shows that how much true in Ur relationship .... Keep smiling Natasha cayse we boys love it 😉💝💝", "dpksingh69": "I am glad you are getting out of your past experiences and you are a very strong woman... I must say that", "brewing_latte": "Best thing on internet today.. 💞 what are you made of?", "aesthete_bae": "You're an amazing woman Natasha🌺", "shruthika_shetty": "❤️❤️", "harsha_doriya": "You are so strong...thanks for sharing this♥️", "aeshwarideo": "♥️", "vish1009": "Beautiful 😍😍😍", "varunsetty6": "Gal u r damn honest n just like the way u express those words!", "muddie.puddles": "Natasha. You spoke a womans heart. never have i ever read, a more real , bare all post... It just made you sobrelatable. I am going to be comming back to this post and the one to follow . I am glad you and i are both healing..", "bhavyagadaknight": "You are just mind blowing 👍 stay like this bud we love you", "blasthustler": "Good to FINALLY see Desi women express their feelings in 2019.😍 Now take it up another level and come to America....", "yogi_ver.2020": "Girl.... More power to you 🙏🙏💪💪💪", "shalveeta_": "You’re honestly a Wonder Woman ♥️😭", "latikaprajapati": "You are such a brave women n am happy for you...you are finding happiness in every thing in your life...God bless you n everyone in the world", "vallabhaneni_sailaja": "❤️", "sakshi910": "@natashanoel001 respect respect respect ... more power to you girl !! ❤️❤️❤️🙌🏻🙏🙏😘🤗", "sunnyunni": "Bullseye and you struck a lot of chords. Keep inspiring and expressing. Ur truly unique.", "oviov": "I love you for writing this. Literally can see so much of me in this. I'm also so happy to see you healing, finding your limits, allowing yourself to recieve instead of thinking thay giving is the only way of a good sexual partnership. Truly does give hope to me and so many souls who have traversed a similar rocky terrain.", "schrodingers_gato_36": "🙏🏽🙏🏽🙏🏽🙏🏽 Good for you!", "imnaagesh": "🙌🔥👍 Chan, Khupach Chan.", "purbasha13": "More power to you.", "_._pauly": "The vulnerability💜", "nameless.wonder": "You are such an amazing person ❤️❤️", "mariyamalekar": "You've penned down not just yours, but almost every girl's honest feelings... Hats off!!", "jdee_force": "🙌🙌🙌🙏🙏🙏❤️❤️", "sunnymends": "Just love this ❤️❤️❤️", "wildgypsy_09": "Wow if this isnt me. I'm glad you have over come your insecurities. I'm still working on mine about sex. Hopefully with lots of practice and patience I'll be able to explore myself more. Lots of love!!🙏❤️", "garg_bharat": "Beautiful", "a_neha_singh": "Natasha love you loads", "love_spell_black_magic_specilt": "👉((🇱 🇴 🇻 🇪,,,💞,,,🇸 🇵 🇪 🇱 🇱)) ((🇸 🇵 🇪 🇨 🇮 🇦 🇱 🇮 🇸 🇹)) {{🇦 🇸 🇹 🇷 🇴 🇱 🇴 🇬 🇪 🇷}} 👉ʏᴏᴜʀ ʟɪғᴇ ɪɴ ᴇᴠᴇʀʏ ᴘʀᴏʙʟᴇᴍ sᴏʟᴜᴛɪᴏɴ 72 ʜᴏᴜʀ ɪɴ 💯% ɢᴀʀᴀɴᴛᴇᴇᴅ ,,,,,,ʟɪᴋᴇ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,, 1.ʙᴜsɪɴᴇss ᴊᴏʙ ᴘʀᴏʙʟᴇᴍ 2.ᴄᴏᴜʀᴛ ᴄᴀsᴇ ɪɴ sᴜᴄᴄᴇss 3.ᴇᴅᴜᴄᴀᴛɪᴏɴ ɪɴ sᴜᴄᴄᴇss 4.ᴠɪsᴀ ᴘ.ʀ. ᴘʀᴏʙʟᴇᴍ 5.ᴇɴᴛᴇʀ ᴄᴀsᴛ ʟᴏᴠᴇ ᴍᴀʀʀɪᴀɢᴇ 6.ɢᴇᴛ ʏᴏᴜʀ ʟᴏᴠᴇ ʙᴀᴄᴋ 7.ʜᴜsʙᴀɴᴅ ᴡɪғᴇ ᴅɪsᴘᴜᴛᴇ 8.ᴄʜɪʟᴅʟᴇss ᴘʀᴏʙʟᴇᴍ 9.ʙʟᴀᴄᴋ ᴍᴀɢɪᴄ ᴘʀᴏʙʟᴇᴍ 0.ᴇɴᴇᴍᴍʏ ᴘʀᴏʙʟᴇᴍ sᴏʟᴜᴛɪᴏɴ 11.ʟᴏᴠᴇ ᴠᴀsʜɪᴋᴀʀᴀɴ sᴏʟᴜᴛɪᴏɴ 12.ғᴀᴍᴇʟʏ ᴘʀᴏʙʟᴇᴍ sᴏʟᴜᴛɪᴏɴ etc. ⒶⓁⓁ ⓁⓄⓋⒺ ⓅⓇⓄⒷⓁⒺⓂ ⓈⓄⓁⓊⓉⒾⓄⓃ 💯% ⒼⒶⓇⓆⓃⓉⒺⒺⒹ 🇼ʜᴀᴛsᴀᴘᴘ & 🇨ᴏɴsᴜʟᴛᴀɴt ------------+91-6377848210------------- आपके जीवन की हर समस्या का समाधान जैसे की👉प्रेम विवाह,प्यार में अड़चन, पति पत्नी में अनबन,सौतन से छुटकारा खोया प्यार वापस पाना,शत्रु से छुटकारा विदेश यात्रा,वीसा पी.आर.में बाधा आना कारोबार,नौकरी में अड़चन आ रही हो किसी को अपने वश में करना या किसी का वशीकरण तुड़वाना हो 👉नोट~किसी ने आपके बेटा बेटी पति पत्नी प्रेमी को अपने वश में किया हो तो हमसे एक बार जरूर संपर्क करे 📲Whatsapp+91-6377848210 जीवन में कैसी भी समस्या हो 72 घंटो में जड़ से खत्म 100% गारंटीड समाधान ****हमारा काम ही हमारा चेलेंज है**** 🇺🇸🇬🇧🇨🇦🇷🇴🇳🇷🇦🇺🇦🇮🇮🇳🇯🇴🇩🇪🇨🇰", "harshit.subbu20": "Hiii lovely", "the_unarmedgirl": "Reality!", "sswaroops9": "Good evening", "pawsitive_potato": "Yass gurrlll!!!! You are a godess🔥❤️", "blackbrewgirl": "Every time I read your post, I feel confident! I really really admire you for what you are. You help me come out of my insecurities and I love you for everything @natashanoel001 ❤️", "kanikafreespirit": "Your post has given me a hope that I am not alone in this world 🤗🤗 also it is very important that we all must learn to say 'NO' and teaches the same to our coming generations 😊😊 more power to you 😇😇", "palkoush": "All I can say is 'thank you' ....♥️", "priyanka_jain.18": "Proud of you sista 😇❤️ , much love ❤️", "dhanshri1_warekar9": "A genuine admire towards u....u r meant to be showered with all u want💕", "mastan567544": "Madam u are my inspiration for overcome my problem", "kaktanya": "Best thing I read today! Lots of love 🤗", "harrysingh.sidhu": "❤️❤️😍😍😍😍❤️🙌👏😚", "agramofkomal": "💖", "heena_kat": "How confident & self aware can someone be to put this up ❣️ thanks for sharing. Lots of love😘", "geetoo__": "❤️❤️❤️❤️", "sonu18_abhinav": "Beautiful Rock🌟🌟🌟🌟✨✨", "raghavagabond": "Wow just wow, you have laid yourself bare before but this right here shows what a true fighter you have been and how gradually you have realized your energy! More power to you girl! A guy here who is a huge admirer of your truth bombs because the world needs to hear them!", "seemamanjappaofficial": "I hv no words but tears,every girl has similar story but one shud hv gut to express,your one wonder women I tell you,lots of love to you❤️stay blessed", "thats_so_r.a.d_": "You are the future!", "alishalazarus5": "@natashanoel001 I was going to come over last night. Glad I didn't. I'm the real person to thank here 😂", "ebikomaru": "🙌🏽", "rajarao.gurindapalli": "🌹🌹🌹🌹🌹", "mahiichopra": "I simply love u women. Ur awesome", "amacurlygal": "I can somehow relate... Though my life hasn't been as difficult as yours... But the fact that I am not able to speak openly about sex to my partner even when we are having it and and...what makes my happy, what I want... Most importantly, I can't say \"no\" when I don't want to have sex... Still struggling about it especially when I can't enjoy myself masturbating.... It's over! My sex life is over! Can u suggest something? @natashanoel001", "tewari.neha": "Woman❤️ you are such a badasss❤️ so sooo naked and open and bare, so humble yet so powerful. Neverrrr changeeee .", "leena_pradhan_": "You are a superwomen. @natashanoel001 💗💗💗", "vinay0502_": "Love you Natasha, for you being you always, stay like that forever ❤️", "ashwini.nair_": "Lot of power to you girl! It ain't easy to pen down your emotions in such a brutally honest way.Hope your life is full of tons of pleasureble sex, coz hey, why not?!", "injar88": "You are everything @natashanoel001 ❤️ (I just shed a tear)", "hippiefromthecity": "Look at you getting sexier day by day! 💕", "kwhair_": "This is amazing !!!! You go girl !", "rkn19756": "Beautiful❤️❤️❤️", "pratyusha_dash_08": "You are such an inspiration ma'am. I have never came across someone who is this open and straight forward about their body, their traumas, their experience, their doings, their pleasures etc etc. I don't know why I'm writing this it can be quite embrassing but I feel like I can share it with you. I followed you without knowing who you are or what you do. I followed you in Instagram coz I loved your tattoo and your smile which I saw in that igtv video of your hair cut. I then stalked your account and went through your profile and believe it or not I was shocked and immediately inspired by your posts. I appreciate you and I became to love you. You are a person to look upto and feel proud of ourselves. You encourage us(youngsters, adults) to be ourselves and have a pride on our flaws and experience in past. Thank you for being you.❤️💕🌸", "sirikuppalli": "Amazing write up!! 🙌", "sharika_dv": "It's amazing how you can just speak your heart out and it's even more amazing to see so many positive comments from women, more power to you♥️", "pri24pawar": "More power to you❤️. And I'm happy for you too.❤️", "rdebashruti": "I freaking love you!", "peter_taliadoros": "💪🏼", "pradeesh_deechu": "🖤", "bolo_annpurna": "@thegalboss read this", "aayushivarma": "#natashanoel001 thanks for coming with this issue as none has courage to talk about this, even I was also like that,just wanted my partners will and happiness and forgot about myself that what I need,fear of losing him.... now I never mind losing anyone and I just give them a fuck what they like if my partner can't satisfy my I luv to stop in between...🌹", "thatdoggonelady": "This is so strong and brave of you to come out and say. Honestly, I'm just in awe. And of course every happy for you. ❤️❤️❤️", "sucharitasom": "I truly admire you from inside...out🌸", "lljerseygirl": "Wow! The photo, caption and all that self-honoring truth...amazing! As many have stated, you speak for the majority and it’s always nice to see others unlock that door, so that we know we are capable too. Well done and thank you. 💗", "shreya__soni": "Oh Natasha, your transparency is just wonderfully endearing.", "being_aysh": "Thanks for sharing this deeply personal journey of yours. It's astonishing how normalized it is for us women to not ask, to not be on the receiving end and being uncomfortable when that happens. Thanks a lot. You deserve it, we all deserve, good sex and self love! Btw amazing picture😍", "aaliishaan": "You inspire me to live uninhibited", "lucyg_makeup": "When I opened my Instagram and didn’t clock who was posting, just saw this pic and this first line, and because of my own lived experience I rolled my eyes and felt disdain and annoyance, and probably beneath it all, sadness. By the end of reading it I was crying, for you and for me. So much of this I could have written myself. I have NEVER read something that sounds so like my experience in so many ways. I am not where you are yet, but until reading this I thought I was just broken and would always be where I am right now. I am so happy for you. And this gives me hope for myself. Thankyou xxxxxx", "gooftroopb": "@natashanoel001 that’s beautiful....i wish there were more people like you, open, true and just amazing!!! love it that you give voice to these issues and concerns that more than half of indian women face and almost always go without ever getting the strength to admit or say it to another soul, thinking that this is what they are for and what they deserve in terms of sex!! Lots of love and respect. 💕", "amruta.gajjar": "Oh my god! I never read such long posts, but since it was about sex it caught my attention, to be honest! Also I never let my ex go down on me!!! I have been feeling somewhat similar most of the times I have had sex with my ex. Also I had been feeling that I bored my partner, and sometimes I go into trauma that maybe that's why we broke up. I don't know. HeBut the next time I have it, I too want to be", "jxsh.sh": "hope you're fine now :)", "niloo.rzr": "breathtaking 🔥🔥😍", "pm001600": "Wowwww.... Extremely awesome pose dear.......😍😍😍😍😍😍👌👌👌👌👌", "caramelrainboww": "all i can say is, i am so fucking grateful you exist. the world needs so much more of you, please never stop. sending alllll the love your way, you freaking awesome potato. @natashanoel001 ❤️❤️❤️", "commoner_gonegreen": "Omg woman!! 😍 This is so pure. Loved every single thing you wrote in there and I am so happy you could come guilt free. This is priceless! 😍👌🏼 Here’s wishing you a lot more of enjoyable orgasms and energizing sex. You are rocking it ♥️", "niratravelsandeats": "I am literally having goosebumps now. I am saving this Natasha. @natashanoel001 ❤️ 🙏", "grub_n_curves": "Mine is a similar story to yours...we are connected in pain & pleasure (yet to come)..in jet spray & finger..in giving & giving..", "_iamjelta__": "@natashanoel001 More power to you !🙌for being soo real and sharing this💙", "nirali_1809": "You're so inspirational💙 thanks a lot for sharing this💯🤗", "monkeyonthehighway": "WOW! you've put into words insecurities ive had..i know im not alone now. And that theres no harm in waiting and recieving. You found someone that understands you, maybe one day i will too.", "sadhikaagarwal": "So much respect for being able to say what many feel but don't say. I read every word and said ditto in my mind! ❤️", "desouzalita": "Wow!!!! You are definitely something!!! I loved your dare to tell all, I always realized you are so many notches higher in being there for everyone to see and learn. I resonate with you in quite a few ways, but very much more older than you, at least 3 decades older!!! Now I am cumming and learning to live life on my own terms!!! Better late than never!!!", "abhayecc94": "The problem is with the man not you if he don't know how to pleasure his partner and say stupid things about her nothing to worry about but you are still one of my favourites 😍😍😍😍😍", "thefoodiedevi": "💯", "pratikchauhan5255": "Awesome", "divya.babani": "Don’t know why..but jst want to save this post...u r awsm ...potato 👍💪", "himalayan_soul007": "Oh my lord.. Such a strong, brave and open minded woman you are... Thanks for sharing, loads of love", "_priyagera": "@sakshi.788", "pathanianimmi": "Oh hon!! You penned down your emotions so beautifully . These are the topics which came across very rarely. Female orgasm their sexual fantasies . I think it should be spoken about openly . More power to you girl. For me you are a lady rock n rolla😘😘😘", "kamal_bishnoi23": "Thats so great and bravery to share this but truly a guidance to respect women for enjoyment of sex.", "oldpalaces_newroads": "Respect abundant respect for you woman. I got to know myself from this amazing post. Thanks 🙏🙇", "iysavad": "💔💙💙💙🔥", "theearthess": "This resonates with me on so many levels. I'm the queen of fake orgasms. ❤️", "lil_misscapsule": "I love you girl !! 😘😘 Stay this nude ! Stay this free!🙌", "rahul_jat_5445": "Fantastic body", "physio_mansi": "Hat's off for this post.... The post is so pure without any hesitation and true.... You go girl!!!!!", "akshitaagrawal19": "Isn't it the best !! Overcoming your traumas.. i can feel you and i m soo happy for you❣️", "awayfromlabels": "So so proud of you.", "eishamady": "I cannot think of someone else putting this thought into words better than you. This post made my day. Keep posting the truth love. 😍😘🤗", "sanjanasaxenaaa": "You NEVER cease to amaze me ❤️ @natashanoel001", "kaveshetty": "I normally never read long posts but DAMN! That was intense and moving. Really happy for you.", "swayamshah.shah": "Photographer???🤔", "crookedlightheart": "Thank you for being so vulnerable on a platform with various opinions, I absolutely loved how you penned down every little detail of how you felt and how you tried to overcome it all. It's beautiful. You're beautiful. Thanks so much, for this and for having such immense courage to put this out there. You inspire so many I can't even tell you. You go girl ❤🌈", "itsawesomesauce": "@natashanoel001 I so admire you for you ♡ I am mum, speechless. You are 🔥 and i hope you stay #unapologetically you coz you are a trailblazer in my eyes. 💜", "simpa_mandal": "Sexual trauma changed my life. There were always a strange guilt and cycle of withdrawal followed by it. You don't feel you deserve to be loved and when someone shows love either you get confused or mistrust. It's been a long long struggle for me. But I am healing. It's been constant conscious efforts. My body still withdraws a lot of time. But I know I am healing and healing takes time.", "travel.sanely": "I have a lot to second & further but I am speechless. Your writing touched my naked soul. You reminded me that we follow you for a reason 🤗", "aveenash.shetty": "Ohh man oh man.. Wonder woman you are.. much love❤️❤️❤️ nd ya i missed these self portrait of yours 🔥🔥", "trishalratnakar": "@nikita.penn", "alicewellbeing": "Wahooooo best post ever. Need to talk about this more 🙏🏼", "shinchan_1724": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "shufiinaaz": "❤", "anushtha_jha": "Ohh god, I can't believe how similar it is with my situation, while reading it felt like I'm reading my own story! Whoa! Kudos and love to you for sharing this ❤️😘", "rosettesoares": "Like WOW!!!!!! ❤️ You Go Girl", "mitraanujac": "You're so incredibly awesome. I don't know what it takes to be this courageous and honest, but I wish that someday, in some life, I will have it. ❤️", "shettyshefali": "This post right here.. Is one of the reasons i started admiring you!! You be happy girl 🤗 Always!", "sani_kalyankar": "You're amazing! ❤️", "__muskangupta": "You are so amazing❤️", "procrastinatorbymood": "@natashanoel001 oh my god...this is such a relatable thing you have written...we women don't really open up about our sexual desires or just think that I just need to keep my guy happy....#truthbomb....lots of umma to u 😘😘😘", "__zehnaseen__": "just love you lady , everytime u come u move the stage and then go , be it us moving mentally or dare for physical stuff , u just take out the tiger and make it shout out loud from us inside", "shrreal": "It takes real strength to accept (and share) one's vulnerabilities. You are all of us in one and you speak for us all. Time and time again. Empowering, strengthening, guiding, Inspiring. I bow! Take my love, respect and admiration. Our Femme Divine❤️👑 @natashanoel001", "kiritkiran": "Excellent post! This is articulated in such a mind blowing way. Cheers 🍻🍻", "h9zel": "LOVE this! ❤️", "neehareekah": "Beautifully written 💖", "carpediem.zie": "❤️❤️❤️", "jackdaniel9343": "Incredible big ass 🔥", "yogasadhana_kavita_sutar_": "👍", "kanchan_2708": "You go gurrrrrl🔥❤️", "forarogya": "This gave me goosebumps ya @natashanoel001 😭.. What are you made of? It's fucking insane that you can write this without any inhibition. I just don't have words.. Just, thank you. and we are in this together. You deserve all the love and more 💕", "ominousblackkitten": "It's like you've penned down my entire sex life up until now. You're so beautifully bare. I hope that someday I have the courage that you have.", "_deliciafernandes": "This post gives me life😭", "bindu_anju": "Natasha this is awesomely written down♥️more love gal😘", "aarohiranephotography": "I LOVE this write up. So open and so humble. Love u for this.", "manvik_leo": "U r simply awesome gal😍I love d way u always pen down your thoughts❤️", "piachks": "🙌🏽🌹🔥🙌🏽🌹🔥🙌🏽🌹🔥", "anupamakaushik": "@natashanoel001 i really love the way you write your heart out for every single thing about love and life. Please keep writing and keep inspiring us. Thanks 🤗💓😍 more love and power to you super women. #life #womenhood #love #sex #orgasms #life", "black_bearded_bastard": "@natashanoel001 That was beautiful, what you wrote. It was horrible what you were put through. I'm glad you overcame it. This is the Universe aligning with you. Your time has arrived. Hope, all the women read this. Sex is not about pleasuring the other-self. Read, Soak, Reflect and Implement, that's all I would tell my lovely ladies. More power and love to you. I believe you have put an end to your traumas. Don't let it haunt you back, ever. FYI - Did I mention how amazing your heels look?", "parikshitkothimbare": "Tumhara Kya Raj hai body banane ka aur fit rahane ka", "she.loves.to.live": "You Woman. .. you are the best thing!!! ❤️😘😘 Cheers to putting your hear out ❤️", "bijoya_vocals": "wow 👏👏 I’m so glad this got told! ❤ love and power lady 🌈", "shriyyyaaa": "I am so happy to know that you talked about this thing so freely. I guess everyone should learn to talkk about having sex and what sex feels like as freely as you just did. Love you for the way you are..good goingg womannnn💕", "paranoshirani": "This so beautifully and openly penned down...always love your work...keep it real always❤️❤️", "rosetintedchashma": "❤️🔥😍👏", "pooja__butt": "This picture is beautiful and you be the best ❤️🎀😍", "tanu_debnath": "❤🙌", "worldaroundaha": "👏👏👏❤️❤️❤️", "thanikal": "You are just awesome🤗😍", "saipriyasagar": "This is so beautiful and you’re the most wonderful and brave person ....ughhh cannot day much but I love you so much", "_anamikas_": "Wow, you have mastered the art of putting down the emotions and guilt so beautifully, each line is so meaningful and deep and comes with a strong message, You rock Dude❤️", "ayushk613": "@vriteshgera", "dips_sable": "FINALLY FINAAAAALLLYY someone said it out loud...👏👏👏👏 You incredible, courageous fierce woman.. I fuckin adore you.. I resonate with you on this 100% ❤️❤️❤️❤️❤️❤️", "youmatterda": "loves to youuuuu", "sathya_buttercups": "Woman! I admire you", "hass_theavacado": "I am in tears! Its like you wrote my mind in the post ❤️🥺 love you 💓", "kashayamm": "You are impossible 😍😍", "pooja__kv": "You are the best ❤️😍😭😭😭", "makeupandhairbychris": "So Happy to read a post talking about their sexual traumas... You speak heaps with just this picture, of how sex is not just physical but has so much to do emotionally as well ...More power to you gurl😘", "mangapasla": "Nice pick", "lakshmi_palaniappan": "OMG! Did anybody not tell you that you're awesome to share this💝", "obeautifulworld": "Thank you for sharing this ♥️♥️ May everyone be blessed with understanding and brave partners", "zubygeff": "What you have penned down here is bare, raw truth deep within your heart. Seldom do someone shows the courage to bare it off like this.. well done @natashanoel001 👏👏👌👍", "fusionchef2508": "😘😘😘😘😘😘😘😘😘🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥Wow u said so the experience of Kamasutra is the lesson.Sex is not a pleasure dear ,it’s a adoration of the partners one from another,to have long life prescription enjoy enjoy enjoy more n more & I like to hear the feelings of human being how they really feel the real sexual experiences", "_rohini_sen": "Thank you. Very much 💜", "patronuschauhan": "I know I'm not the only one saying this but @natashanoel001 you have written what most of us feel. Sending you love💗 Wish you all the happiness & orgasms ahead. 🤩 Love love love💕", "thejoyfultouch": "You give so many people hope and confidence by just existing. May the Universe bless you now and always 🤗", "ajinkyadhuri": "Nicely described", "sgk832017": "Fucking baby", "amulya_kri": "I love , I love how strongly you've put this up! Sure is a #truthbombmon ♥️ All the love n much more strength to you!", "dumbbellsandchips": "YAYY! You DESERVE all of it and more 🤗💜", "kirsty.mckell": "Wow, these words are the very ones tiptoeing across my mind for years and you put it so beautifully. Having been where you are in the past, and now, I can fully embrace the freedom that you’re now feeling. Its amazing! One thing I didn’t expect this freedom to make me feel was powerful! Like I’ve unlocked a super power in my body! It’s so exciting, I feel like a superwoman. Just you wait for what’s to come... pun intended 😉", "mohanakrishnanz": "@natashanoel001 nat your posts makes us feel proud about ourselves 👌Thanks for making us value us more 🙏", "agrimahahaha": "I love you dude ❤️", "itsmejvscorpionking": "Awesome never read a post so thought provoking n directly dil se", "sudeepkapoor": "This is really awesome . Thanks for putting it.out there. Self awareness is the first step to self improvement", "pranuthi_ratna": "Thank you soo much for speaking this out😭❤️", "shivaz_r": "❤️", "kritikan35": "We be the Queen...hail the Goddess first🙌🙌🙌 @natashanoel001 thanks for sharing Gurl!", "snehajrathi": "Your post just made my heart exolade with happiness. For you and myself and everyone for some reason. Love you dude (sorry for being a creepy stranger)", "tarunalachhwani": "Woman! What are you?! I am mind blown by how beautifully you have penned down not just yours but so many thoughts of each girl. PLEASE KEEP YOURSELF THIS BARE ALWAYS. Enough of taboos we have in this society already- someone please just open up freely and talk! Thank you!", "wetjeans1st": "💓💓💓💓 .", "prasithaprasad": "I follow each and every story and post of yours...But this one is the one that touch my heart so deep.. Feels so happy that you could actually speak up and express the feelings and thoughts of a thousand of women without hesitation.. Me myself was never true to myself. Whenever I tried to be me everyone felt it so weird or not as per our traditions. But I feel so happy to feel your each and every word....❤❤❤ You are an inspiration..for us ...n all", "arobarachelgeorgyy": "I fucking love you man!!!", "subrothob": "U are one beautiful soul mate❤️❤️❤️🤗🤗🤗.. hope people take ur post positively. 🤦🏽‍♂️ #stayraw #stayyou #fucktherest #1lif2live", "out_of_the_normal": "Natasha! i am so happy to read that. just a really nice cuddly hug from me ! and lots of good energy!😇😘❤️", "archanarelan": "@natashanoel001 very relatable but I appreciate your courage to share this with all of us. I hope someday I could be able to do this. Lots of love", "connectingtodivine": "Wow this explains sooo much of why I am the way I am thank you ❤️", "yat.in.sta": "What a beautiful picture to talk about such an important issue! I genuinely admire you AND your boyfriend. You both deserve each other :)", "aadimania": "I have few traumas of my own", "shailaarora26": "Wow❤️", "_boho_bella": "@natashanoel001 now we should understand this is a serious thing... Lady you are fierce 😘 #AaghyeLdki", "athlique_abir": "I heard this!!!✋❤️", "thatmalluartist": "Respect! It takes gut to openly say what u have in this post and be so vulnerable on the internet. U r one killer of a woman😘 🔥", "shiana.moon": "I am working on being comfortable with myself. Asking for what I want. I was raped and molested, & I always thought sex was about the other person and their pleasure always determined if the sex was good. I valued my ability to be a good girlfriend/wife on my ability to submit in the bedroom. Lately I have been thinking about being more \"aggressive\". I never make the first move. Even when I want it badly. I always felt shame in admitting that I had to initiate it. I felt like if I wanted it and he didnt, it didn't even KNOW I wanted it there was something wrong with me. Like I was ugly or unlovable. Unfortunately many women are told their sexuality is unbecoming. You are so effing awesome for sharing stuff like this. I am working on being more open and seeing things like this give me more and more confidence", "annikapanikker": "Those shoes new?😍 tell me more about last night🙊", "official.davidsandhu": "@natashanoel001 let's change the stereotype of indian people's", "poojaxjuwatkar": "Oh lalala😍😍", "zoooopppp9070": "Thank you for putting this up!!!! And I am really happy for all that you are now🔥🔥❤❤", "estmoii": "Thank you so much Natasha, I needed this.", "amritajaymohan": "❤️❤️", "ujaascraft": "Forever be this honest ❤", "dropsofpearls": "Don't let the creeps put you down!", "varsha_hongal": "U brought it out so comfortable...😇strong girl.", "deepthisingh_": "Queen❤️❤️❤️", "desi_dost__7773": "best step", "nipapaka": "BIG THANK YOU AND HUGS FOR SHARING THIS! SO IMPORTANT SO COURAGEOUS. Society isn't one bit conducive to such truths, but you went ahead and shared it anyway. Really appreciate what you do :) 🙏💕", "get_miniature": "🙌", "rishiigoy": "I don't know abt u but I felt like seeing a sun for a while till I close my eyes sorry u r good", "introvert_2910": "More power to you💞😍😘 How easily you come on this topics👏 bold lady", "reshfareed": "Keep rocking Nadhasha💕🤩", "adhishreep": "Damn dude. So much raw truth, you're the best ❤️", "dk_2596": "Hey Natasha, thanks a lot for sharing this post. Female orgasms are something which isn't spoken much about or cared much about, infact I have seen my ex-partner feel a sense of disgust when I offered to go down on her. While with me, she didn't feel the disgust. I thought that it was pretty normal for such stuff to happen, but somewhere deep down I felt that our pleasure ratio wasn't balanced and I was the only one in the recieving end. This post of yours has opened my eyes and I will be more mindful of my demeanour during my next session, and see to that my woman gets equal amount of fun and pleasure at the same time. More love to you 🙌", "heisenberg03": "yess yess yes we got it ,maine to dairy mai bhi likh liya k dis lady goofy lady n my fav person had best sex of her lyf ,itna detail mai kaiko likhne kaa ,hehehe😘, its sooo motivating every time i see u", "hausofgara": "This is beautiful! I am so happy for u!!!", "gramsta_pics": "Your posts are based around the same thing \"Your past trauma\" it's becoming far fetched as in if you still felt this way, why then share these stories? I mean I could understand if you was over your past trauma I would understand but you go in to so much detail (but I guess sex sells) yet make out you're not over it. Let me be clear no woman should have to endure any form of pain be it metal or physical but I can't help but think you're not being entirely honest.", "chaitanyaaa": "omg i fuckin love u. Thank you for this!!!!", "balancedfreak": "💕💕 amazingly written...@natashanoel001 you're the best and most inspiring women i have ever seen. Love u loads!!! ❤️", "sharothediya": "I look for you in my feed, thank you for empowering others. ♥️", "priyanka195": "Love this! More power to you💥", "renu_muthyala": "😍😍😍😍awww", "pam_jacob10": "Wow.. ❤️❤️ hats off and thank you for putting it out der.. 🤗🤗🤗🔥🔥🔥 sending you all my love and blessings.", "sreejita3007": "Sending loads of love in your way.❤️", "swapneshtiwari": "@natashanoel001 women empowerment = YOU 🙏❤️ .", "ish__ree__18": "hey Natasha !! U r a true inspiration girl ....... I love u loads ....", "aesthete______": "Fuck. Guts man! Guts!", "ishanibiswas_": "Woman you're amazing to be able to share your experiences :) 💟", "simran.r.ghai": "You are simply AMAZING. More power and love to you ❤️❤️", "sonali19__": "Wow", "anushreenair24": "Sooo muchh loveeeeee to yooouuuuu.... ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️💪💪💪💪💪💪💪💪😘😘😘😘😘😘😘😘", "dhiraj_sharma29": "This is beautiful ❤️", "eyesonmealways": "Wow 🔥 Queen letting her receive the pleasures ❤️", "the_lazygrammer_": "Beautifully penned! ❤️", "nupur_a_": "@natashanoel001 GUTS! ❤", "sujata.banik": "Hatts Off Natasha❤️", "piya__yogi": "Wohooo😍👌👌", "silent_em0tion": "❤️❤️❤️ Straight from the heart! 😍 Beautiful.", "devika_baburaj": "So much I can relate to. You just voiced my troubles...lots of love and light to you❤️", "artab03": "One word for this post “wow” ❤️❤️😘", "k7hash": "👏🏻👏🏻👏🏻👏🏻👏🏻🤗🤗🤗🤗🤗", "aparna_sharma2393": "Only a strong woman can come out so loud about whatever goes on in her head or heart. Hats off to you💕🌸", "barkha_verma20": "Wow you just put it across so comfortably.... yo go girl 🔥", "joleneannfernandes": "@humhu_ how amazing is this woman I can't. So much inspire", "adrita_sparklingthoughts": "Every time I think of the kind of energy, positivity, strength and courage u have... my mind is blown! I am like... how.. seriously, how??? 😘😘 🎩 off", "shannon_lynn_dsouza": "Sending all my lovee💕💕💕💕", "soniaasuresh": "@ravie217 I love her", "chelseagaya": "Oh hon, I love the jet too 🙈. One partner found my moans funny and laughed. Killed it for me. I didn't want to continue. I wouldn't stop with the sorry and he went on fingering. It hurt me down there obviously because I was no longer in the mood. Everything was so overwhelming, I couldn't say no. I just wanted peace so I faked it. Just so there wouldn't be a fight and I didn't have to hear the sorry. It's so relieving to find someone to relate to ♥️ BTW, I'm loving those heels 😍😍", "gourmand_beast": "This is inspirational, I have a huge problem in receiving and then in turn giving. It's a viscous cycle of guilt.", "that_woman_in_me": "Babe, I love you more now.", "anurupa_bhowmick": "Ye heels dekhkr hi mere ghutno me dard shuru ho gya!! 😂😂", "rutvisaxena": "In awe of how vulnerable you're allowing yourself to be on Instagram, considering the crap you'll inevitably receive from creeps. Beautiful photo, an so happy for you! ❤️", "notsosanskari": "Lovvveee you for this post!!💓💓💓 So so so glad to see your progress in \"Receiving\".", "panchhi_perspective": "Wow", "ashinarang001": "To meet u once is also on my bucket list😂😊", "mohit249201": "Sexy😘", "crimson_belle99": "Thank you for being so honest and bare with all of us. Believe me it helps. Love always, anddd happy for youuu❤️❤️", "_ariba_khan_": "Thank you @natashanoel001 💕", "natashanoel001\nVerified": "Verified", "reallyshiks": "Wow.", "dikshamisraa": "Yassss queen 🔥😍", "moonsoon_1996": "Hott bollu yaa fitt bolu", "stayweird8752": "🙌🙌🙌🔥"}