{"satyajeet6": "Are U Masochist?", "snehal_k_580": "U r amazing @natashanoel001 seriously there's no one as u😘😘🔥🔥💕💕💖💖", "someone_shajee": "Wow👍👌😘💗", "lea_4760": "People are always gonna label you. It's how you overcome those labels that's what matters 🙂", "dixiepatelfitness": "you nun of then dear natasha, u the best the way you are 💯💯❤️", "avrocks011": "She is pretty beautiful cute angel queen sweet and most important real", "matinahmed3416": "You meat", "dambarrimal": "Cute", "life_in_pinkk_007": "U Can’t Be Whore Bitch Slut U R The Most Beautiful Women On this World,Who Express Her Thought Without Any Hesitations. I’m already fallin love with your soul", "the_ice_crusher_": "🔥🔥🔥🔥🔥🔥🔥", "tejaswini_kantipudi": "U r the only person on earth who is actually living ...all others are just doing the process of in and out ...( this includes me ) ...huge respect ma'am 🙇‍♀️🙇‍♀️🙇‍♀️🙇‍♀️", "amruta9290": "It's a course", "sassy.titanium": "The biggest problem we as women have in ourselves is, we judge ourselves before any else does. It's true that posting liberal pictures in social media might attract a few cheap minded people who'd comment cheap about you. But according to my analysis, I've found that when someone post pics revealing their body, they attract more appreciation and logical comments rather than someone calling them bitch, slut or whore. But we as women think that before the world can tag us, let's give a powerful caption for protection. When I dress myself and look in the mirror, I'm always the first one to judge myself saying, 'i think I don't look good in this outfit, maybe I should try something else'. Which men doesn't . Which is also one of the sole reason why there are more male leaders than female. Instead of indirectly requesting the world to.stop judging me, we must stop judging ourselves first.", "petchimuthu_karthik": "🔥", "najimshaikh75752018": "Ur amazing", "nileshvjoshi": "One of the best looking lady... with great sense of humour... amazing body... I would say “Be yourself”... we love you as you are!... ❤️", "lokeshnayaka17": "👌👏 you are an inspiration live ur life as u like", "troublemaker.83": "Very well said.", "sandeep1.singh.u2018": "You’re the best", "ashishrajpxt._": "you're gorgeous, you are enough, you are an inspiration for us and we respect you🙏😢", "sawan_grg": "Be yourself and fuck up wat everyone thinks about you", "thi.nls": "Such words used mostly used by people who are lack self confidence and are envious of people who express themselves freely. Respect to you🙏 and greetings from Bhutan 😊", "naveed_whitesheep": "afte every one week, you talk about depressions, past this and that and this and in the end you talk about light and positively. Khatam karo yaar. “Pain is a pain princess, if anyone says differently is selling something”. You overdo it so much so it becomes vexing. Take a chill pill now that you have embraced self worth.", "mehdi_persianladka": "@mehdi_persianladka easy*", "_anuja.pawar_": "❤️❤️", "simrantulsi12": "u are daring woman i hv ever seen.. seriously jo aap ki trha honey ki soch b ni saktey wo ye bakwas kartey hai..bus tum chaley chalo .hum hai ap k sath..❤️❤️love n wishes for uhh😘", "crazy_lil_ladki": "Powerful caption🔥❤️", "aanch_tals92": "💗🙌", "crazy_manish83": "It's comes from heart but u won", "rajancharanya": "You're so so brave Natasha! Keep it going! ♥️", "al_the_fiya": "🙌", "vij_ragu": "Life as intention;Life is as intention", "sanjeevini_xavier": "Beautiful", "hrishik.07": "@disha_bhagat07 read the caption 🍁", "avi__love_": "Do you ever think , why people invented this words??? .... Kuch to kiya hoaga na iss ladkio ne .... Ya fir aesehi sab words banadiye ?????", "dimsume47": "💟💝💞💞", "legendary__thomas": "❤️", "flacko_krishiii": "Gajni 2", "jamesbond170581": "You have perfectly used right words you deserve😂", "susant_786": "❤️Really u r a good girl ever 👌👌👌", "seethala_992": "Hey @natashanoel001 .. checkout my msg .. I want to read out my pain🙌🏻", "memon.imran4": "😍❤️", "travelwithgoonj": "You are a hero ❤️", "mna.nadeem": "Even God can't understand u😂❤️", "bxvithx._": "Fire🔥", "siddhii.goswamii": "This is all what i think every fucking day..", "fan_of_notorious_mystic_mac": "You just burned all f*cking negative peoples by ua words🔥🔥🔥", "xo__panda__xo__": "U r best ..fuck about what ppl think of u ..trust urself", "minal.bhanushalii": "👍🏻", "prashanthabhat": "Add one more..mental. God has given you so much and why are you so depressed.", "playboirushie": "@aryansxngh @dev.gulati boys will be boys", "saeidpourmousa": "whery nice lovit", "suryaj.2003": "U R BLESSED...", "bhatta_pooja": "I just love you mam..Even I used to feel this way once ..I always felt I wasn't good enough.then I realised I dnt need any one else's validation to feel good about myself.I m much more worthy...more power to you girl❤️..@natashanoel001", "varun_balaji46": "🔥", "sreehari_kulangrakunnmal": "😍😍😍😍", "aim.ali.54584": "😍😍😍😍😘😘😘😘❤️❤️❤️❤️", "mainul.ahad": "😢", "apoorva.apps": "You may write me down in history With your bitter, twisted lies, You may trod me in the very dirt But still, like dust, I'll rise. Does my sassiness upset you? Why are you beset with gloom? ’Cause I walk like I've got oil wells Pumping in my living room. Just like moons and like suns, With the certainty of tides, Just like hopes springing high, Still I'll rise. Did you want to see me broken? Bowed head and lowered eyes? Shoulders falling down like teardrops, Weakened by my soulful cries? Does my haughtiness offend you? Don't you take it awful hard ’Cause I laugh like I've got gold mines Diggin’ in my own backyard. You may shoot me with your words, You may cut me with your eyes, You may kill me with your hatefulness, But still, like air, I’ll rise. Does my sexiness upset you? Does it come as a surprise That I dance like I've got diamonds At the meeting of my thighs? Out of the huts of history’s shame I rise Up from a past that’s rooted in pain I rise I'm a black ocean, leaping and wide, Welling and swelling I bear in the tide. Leaving behind nights of terror and fear I rise Into a daybreak that’s wondrously clear I rise Bringing the gifts that my ancestors gave, I am the dream and the hope of the slave. I rise I rise I rise.", "s.veg.as": "It's so sad that this has become a trend & now we see some post like this on monthly basis posted by women showing that women are vulnerable. Why don't we focus on inspire whole generations through business women, female rebels etc. Why do we always talk about about some incident that was unfair for women. Guess what? Shit happens! Society isn't fair. Yet It's up us whether to bring out the best of it or bring out the worst of it. If we want to change world we have to think of the best of it & act on it. That's how we develop it.", "_mrtn_tn_mathew": "Dee , i respect u", "rickyvilla2015": "🖤", "thenumbink": "Wow!! ❣️", "chloevaltopia": "You should do one of these with all the nice things people say or you feel about yourself ❤️ I'll start you're tough!", "roshanmohammad1703": "❤️😢", "sachindra_chy": "Wow💥", "rakshitha.rohith": "U r so inspiring Natasha😍I have started embracing depression now.lost both my parents, my dad passed away 5 years ago and my 6 months ago, I am feeling that weird void in my stomach but I am learning to deal with it...I read all your posts and get inspired by it😊u r healing many souls, keep going👍🏻", "mantu2219": "Don't think bad about yourself every one has a hard time in life", "m4nsi_____here1717__": "Your caption🙏💓", "__kamikazie__": "Go make us proud 😍❤️", "iamshavi_": "Gurl don't let what other people say let you down. This is your life so you have your freedom, you're able to make your choices and also, you can control the way you react to things! You HAVE CONTROL OF YOUR OWN REALITY! Even I was in a state where people used to say I was attention seeking af for every single little move I did or for the slightest thing I said. And I let myself be miserable and pretty much go into nervous breakdowns because of those nasty comments. But what I didn't realise is that I have a CHOICE of listening to them and simply being myself. This world is fulla people who are jealous, will let you down etc.. but don't stop loving yourself because of that. I'm glad you understand that now. So now, just don't give a fuck about what others say to let you down; to make you feel small. YOU HAVE THE POWER! USE IT WISELY❤️", "anjoos5": "That's me also !!!!! Something like this I needed..u r a great motivator too darling..love you💖💖💖💖💖💖💖", "ranjan_roc": "Kuc to log kahega dear don't think about these typ of people. ❤️", "kuntipruthasweety": "More power to you woman👍👏", "kajprit": "S U B H A S H I T H A! Life isn't about how to survive the storm. It's about how to dance in the rain. You have every right to a beautiful life. NEVER be ashamed of your problems... Your body... Yourself... YOU are worth LIFE. If you believe in yourself anything is possible. .Yogacharya Yogamaharshi Na sridhar.", "richiemounts": "Stay strong 🌹", "xx_silky_locks_xx": "Proud of you ❤️", "chucklee_stunna": "Women u are not that stuff 💯❤️", "m_devaliya": "ohho my god who this", "paarth_212": "But I find you hot and I'd totally wanna bang 🙂💦", "anish_jsr": "Strong lady..💪", "neenarana30": "Love you my dear❤😘😘🙌", "shamraz007": "Khallie wallie... never mind n tell them jst 🖕🏼🖕🏼🖕🏼", "mr.boogiemann": "Honestly, who all just read the first 3-4 line and the last 1-2 line and skipped the rest ?", "shwethavijayanpanicker": "💗", "changez_khan_sasoli_": "Yess these everything you are", "designersandhya": "@natashanoel001 I don't like whatever you hav written over your body, i haven't even read your whole post it gives me goosebumps and broke my heart. I just know that you are a superwoman and powerful and you are a true inspiration for each n every woman. You are a wonderful soul. Hugs and love to you 😘❤", "nawabatifbokhari": "Pornstar and listen natasha join regularly pornography you are suitable bitch specially anal and sucker", "daivayugmartwo": "Keep shining!!!!!", "thatstrangegirl__8": "Just in case nobody told you.. Hey beautiful💙", "sopu242.snp": "Respect❤️... But even we guys go through alot of labels ...", "ceciliaokugo": "@lennykravitz", "nandini_nagraj": "I love you so much for inspiring me everyday 😇", "perspectiveisevrythg": "You’re amazing and beautiful and inspiring and worthy and talented and loving and kind and funny and smart and loved by so many!! Thank you for being authentic. This is why I follow you. Xoxoxo", "ikaminey": "Gandu", "vshesh4": "Can't see 'Inspiration' written anywhere 🤔", "dhaagebypragatimathur": "Wow!! You go girl!! Such an inspiration 👏", "wonderwomenxoxo": "😆", "shomadixith": "Superb words!!", "swa_yognasha": "❤️Love you😘😘", "arundcunha88": "Don't care anyone find happiness whatever you do😊 be happy and bindass 👍", "nikitaetae": "❤️❤️❤️", "nabinmanu": "Unique.....❤️❤️❤️", "jvaldez_putoface": "Let me break out the violin, hold on.. 🎻", "fun4liife": "If you keep laughing no matter what others say, you have won the war 😎", "prachi.more1": "There are so many women who keep believing this negativity & lose there own confident if anyone read all & have a positive being will realise be what you are & don't let other judge u or say what u are don't play victim", "iamsubash_thebeast": "Who typewritered on you? 🤔🤔🤔", "sohai1sayyad19": "@natashanoel001 Sorry that you had to go through all this. Sorry no matter what gender has commented this on you but its utter a shame on those who have such low thinking abt another human being. With world and people of such harsh mentality there are few who respect, love, care, adore every human around no matter what. More power to u to fight against all this no nonsense negativity. 👍👌😊🤗🙌", "mukeshbabu1312": "U r a women i have seen ever with so much confidence so don't give up and love urself as loving...", "__.sakshii": "Women like you can only let every woman realize that she deserves far better🖤 @natashanoel001 you're amazing! 💋", "pujamandla": "❤️❤️", "kalpesh_fondekar": "U r inspiration to many❤️", "jujumahn": "Boss Lady 🙌🏽. Respect 🙏", "anchor_ankita": "Dude you’re the best! ❤️ We all love you for what you are!! More power and wisdom to you👍🏼", "crazzymax7": "You're Wonder Woman. That's what you're. 🔥👑❤️", "krishva831": "Love u sis", "sandhya_pugazh": "You are beautiful , you are an inspiration ❤️", "substantial_woman": "I don’t know why but I get so emotioNal Reading your posts that my eyes are filled with tears. You are my idol I love you Natasha", "rmeghanagowda": "Live ur life as you like dnt worry about others", "fitindia_": "#respect", "martafrancoiglesias": "You are absolutely wonderfull, amezing, more tan perfecto, more than enough!!! I love you!!!", "akshay_rajendra_londhe_": "🔥🔥 ka he asa 🤔🤔🤔🤔", "hemanikhire": "Superb answer 👏", "rajib_kumar_saha": "🔥🔥", "krupapdave": "Proud of ya...😘❤️", "yogeshadmane": "🔥", "musafir_huyaro1": "Kudos to you @natashanoel001 . Its always a pleasure seeing your post, such powerful messages communicated with so ease. More power to you 🙌", "johansbarnabas99": "You are a true inspiration, A power of positivity. Kind of funny too, Never change.....", "kqueen_jass.99": "We love u mam❤️... dogs r barking😏 let them do their business..they can only put u down becoz their ability to understand u is limited as per their mind sets...they r showing their standard ..ppl can make u cry but they can nvr makr u smile..so just love it self ..n again v love u too💚❤️ #selflove #youarealioness 😚", "sahil_foodie": "Think you are so knowledgeable and you have all practical knowledge of fitness... You are theee best person at your place don't think about narrow minded people", "m0m0_escapes": "Lots of love and respect lady.. u have put thoughts of many girls out here in the most perfect way.. thanks for expressing for many.. and may the fuckers/haters stay where they deserve to be.. in deep shit.. 😊🤘", "samalivee": "MORE POWER TO YOU 🔥🔥", "rajeshparidabati": "Gajnee", "zee_d_raziel_": "❤️", "careybabyy": "WELL SAID!!💜💜💜💜💜💜💜💜💜💜💜💜💜", "taabeer_zan": "I can't even begin to imagine how much courage is required to express your vulnerability , to express the thoughts embedded in the dark corner of your mind . Salute to you , who is brave enough to embrace her vulnerability with so much grace and elegance . Miss Natasha Noel you are a hero and you inspire all of us in million of ways ❤️ Much love to you . 🦋", "deepak.gautam.4444": "Yaar tum apne baal sahi kar lo bas", "fucktard_in_the_name_of_fools": "Natasha, most women go through this. I can feel your pain. I have gone through the same, just love yourself. I hope you realise you make such a difference in so many young women’s lives. Believe me, it’s not easy. Kudos to your strength. Much love,", "seriouslyayushman": "People are fucked up in india. They will say anything which comes in there mouth.😡", "sreevallitata": "Your the best and ur a true inspiration❤️💙 all love and strength to you😘", "shaaane_rodrigues": "♥️♥️♥️💯", "mitraanujac": "❤️❤️❤️❤️", "yoga_with_srishti_official": "Love to you 🙏", "ssoni0407": "Love u mam 💖", "prameshkapoor": "Thats powerful. Always remember you are priceless. You are powerful. You are a possibility to everything. You are an inspiration to yourself and to many. Keep going strong, to hell with what others say, they say because they can't be you. I respect what you are. God speed love to you.amen", "rishab198y": "U r amazing mam u r perfect mam salute u", "jessypune": "Screw the world and move ahead", "sincerely_yessi": "Wow❤️", "ess_bee_essbee": "Well said ! U r inspiration 🙌", "mohez7585": "U forgot to write few more words ..\"amazing wonderful adorable awesome etc\"", "harbagai212": "Let People say whatever they want Girl!! You are an inspiration for all of us. Especially Me!! 😎", "bala.murali.58": "So nice of you talking about it. All bad words are made for women but no word to describe any man who is having multiple gfs", "ketchup_bawa": "❤️", "the___happyjock__": "This is madness, Natasha. Stop all this living a normal life i request you.", "sparmpreet27": "Again you never loose rather plant ways to get fake sympathy from people only to get famous and for money,nobody said anything wrong to you just in today's cut throat competition world you want to be on top earning huge bucks so you playing these games rather than imparting fitness tips.people will report against your channel as all are not fools coming in your web some are smart even.", "krishnavision": "No .. U are such a beautiful soul in world.", "dillonchan": "Few words you need to replace those with are: loved, strong, inspiring, talented, adored, positive, accomplished, role model , outspoken, brave - they are a lot more.", "sunny_krishna_2310": "Strong🔥 really admire you!!!!", "jijo1981": "Never listens to other people", "__jesca07": "Simply put, this is Beautiful - the words you spoke, the person you are inside & out...Inspiring - the words hit deep in your soul 💜💜 #trueinspiration #beautiful #empowering #truth", "saurabhmhl": "@natashanoel001 just in 1 line.... Buri njarwale tera muh... Puke puke", "talukbulang": "Gajhini part 2😂😂", "movementsanctuary.bandra": "❤️❤️", "justindominic777": "Ouch.", "ayushi_the_storm": "👏👏 kudos to such a powerful inspiration by own", "alti_palti": "🤘", "im_shammash": "Respect ❤️", "_shivanamika_": "You r powerful ! Strong !", "pamelayolmo": "You are a survivor. You are strong, beautiful and brave and an inspiration to so many of us. Concentrate only on the love ❤️", "aheerd144": "Kaun bola...", "ms.prim_n_proper": "More love to you and your healing process❤️❤️❤️", "yogasoul12": "Bullshit who says these words to you 😡😡😡😡", "ashok_460": "Your are perfect women with inspiration", "hindyaan": "Even as a guy I could relate...😐😐😐", "naveenzenfieldz": "😔😔", "ohlyls": "Powerful words❤️🔥🔥", "payalgarg12": "👏👏", "ahk_1112": "I love ur insta stories ,ur daily yoga practise sessions have given me so much motivation to workout daily and pratise yoga daily at home,thanks for sharing ,and pls keep posting stories daily i am so much addicted to your stories and ur insta page,keep rocking girl 🧡🧡", "ezloveyoga": "💙💙💙💙 #CaptionLove this is real... Thank u for sharing", "sanja6285": "Don't think negative.simply ignore this type of word ... it's your life ..be happy always", "riya.majumdar": "You be the STUD, girl", "_i_m_jitu_": "#I_❤️_You_Mam😘", "_mystical_dimples_03": "❤️", "jonquil.sudhir": "Keeping shining 🌟", "gaurav.is.pride": "One request can you please maintain this haircut it looks awesome", "vikranth_rana": "Lot of lies in ur body 🤔", "johnabraham_foodlens": "You are the best...God Bless You dear👍", "mastan567544": "Thank you Madam for sharing wonderful information. U r strong 💪💪 lady I have ever seen keep going we are with you", "sanditi_rao": "You are a queen. Period.", "shelbybhala": "No no. Can't take these words on you! Women are everything in life. Without my mom how could I come here? Pls. Take off those words", "karishma9677": "I adore the way u write & respect the truth that u portray !", "gs03056_gagan_aujla": "Stay rexled and be happy find your self inside you ❤️", "oldpalaces_newroads": "I love you loads and loads. More than grateful about what u wrote, thankyou.", "kesavansubramaniam7": "❤️🔥", "varun3085": "Counting these words might be less...for anyone but you are the Real Human for yourself. You take care of yourself that's enough, You feed yourself that's enough , You have the courage to face the reality that's Enough. YOU live for yourself That's MORE important than what rest of the World think about You. CHEERS for Yourself 👍👍👍", "aumchaure": "Chill Natasha where there is love there is hate so like always look at the brightest side yaar Log kuch bhi boLe saLa we all will never stop loving and believing you", "flyingdude09": "Stop it.", "breezzzy97": "You live in a world , created by you in ur head. U seem to be obsessed with people judging. Its not a healthy practice dear.😊", "shraddha.bundiwal": "❤️❤️", "sanya_r18": "You're amazing! Like just so inspiring💕💕", "bhumika1231": "💓👌", "rijoykuruvilla": "🤟🔥", "krupali077": "Nd u r so beautiful Nd straightforward soul ♥️", "aapkiharshita": "thank you for sharing this. i couldn’t relate more. 💕", "i_am_rachnaagarwal": "🔥🔥🔥", "spiceofgoa": "Female ghajni @natashanoel001", "dine_sh07": "Respect @natashanoel001 one of t strongest n boldest women", "rebeljaydip": "Respect for you 🔥", "puja_pictures": "As usual you kill it.....hey @natashanoel001 you are amazing.....I have only love for you....your word day by day change me.... 💗 lots of love", "exceptionally_positive": "One of the best post so far👌 so positive 🙂 🔥", "aparnaads": "Warm hug Wala thank you @natashanoel001 💟", "bihani_aarti": "♥️", "chaitanyaaa21": "This really really touched 🔥🔥🔥🔥❤️ my god you are such ozm🌈🌈🌈 #lovefromkerala #muvahhh", "aditi_gambir": "💗🙌👏", "anwar.alienboi": "இவை அனைத்தும் உண்மை", "qasim_mirzah_noor": "IDK why my concentration was on the loser", "sekhar_maiti": "Pure Madness 😒😒🙄", "rathodb22": "😯", "sanyachaudhary11": "👏🏻👏🏻♥️♥️👏🏻👏🏻", "mybetterr_self": "😘😘😘😘", "i.shwetamishra": "🙌🙌🙌🙌", "rajatakre": "Ghajhini", "evil_king_chiranjit": "Bitch", "himanshunya": "Keep slaying. 🤗", "b__a_i__r_u": "Iyoo💥", "b_e_i_n_g_j_o_y": "A Complete mind changer.", "growing_lady_": "U r helping lots of other girls to understand their value n corn out of that \"m good for nothing zone\" much love to u , keep slaying ❤️", "design_divine25": "😂", "yasminchinappa": "@natashanoel001 Inspiring 🙌💪🏻💪🏻", "akanksha__1110": "❤️💯❤️", "bipulmak": "Mem you are an inspiration", "priya.kutty97": "#respectgirlsfeelings u goo girl💕❤️lots n lots of love to you 😘💝", "tusharkn": "You just landed on the other side of the world or you might have seen more world than me, nothing else to say", "divya.babani": "❣️", "mohitkumar9426": "No who told you keep smile", "subtleartof_amirmalik": "You are very diserving and very important dear ..", "babmburiya": "You are inspiration for new generation and you are not slut & cheap you are great yoga master anybody not compare with you bcz you are live in free mine life. ❤️", "_ashkasm_": "Mike posner - Be as you are !", "christina_exoxo": "Omg you are an inspiration to so many people. People that’s going through this but is not confident enough to speak up or is struggling to pull through. The world needs more of you.", "poppinscola": "Ur brave girl 💙", "balbir.sagoo": "Pls give yourself credit", "blu3lotus718333": "#POWERFUL", "im_aniketkadu": "@natashanoel ma'am you are a motivational person and speakers, actually I have heared about your struggling life .,,,, Hats up you ma'am And always you a grt work💯", "rahulraskar5979": "Actually sometimes when we tried to solve the shitty stuff in life, when we give our full efforts, the things go in the worst conditions ever... the negativity cuts out negativity.. being positive always won't work in this world, always try to attract the negativity and make the fucking loop of it and dump this negative shit into the ground, actually we are self healers...I think the more we insult ourself it results into formation the burning fire which motivates us reach towards our goals.. don't rush.. everything will be alright because time heals everything.. give yourself time.. spread love and be loved!", "umang_dwivedi_": "Are u an extremist", "nitashatiwary": "You're amazing 🙏", "the_vinodkr": "Psycho", "yogesh_2403": "@natashanoel001 You are the inspiration for many girls..!! You always rock..!! People who actually says to you words like that, are the people who are shameless and idiotic. I love the way you post on Insta..!! #respectwomens #womenempowerment #strongest #NatashaNoel ❤️❤️❤️", "rupeshsolanki9": "Omg ye aurat sachmuch me out of mind 🤣🤣🤣🤣", "iamabadboyfromkerala": "Gajni", "prateek.pb": "Inspiration for everyone 💝", "gautambhalla0007": "Pls. Don't say.... U are so pretty... Worlds best women", "defy_the_gravity": "More power to you🔥 people will talk about you because they can never be you. let them, how does it matter in any way.", "am_mr.nobody": "👏", "swatibangwal": "powerfull ❤️ @natashanoel001", "aiswarya_jayapreet": "🔥🔥🔥", "afraneyshaboori": "Keep being strong and wise", "sobohoboho": "So relatable 😘🤗", "kothari8737": "All u say about true but Ur good yoga teacher", "sayali.dd14": "Simply Amazing! Shine as bright as sun 😘😘", "manish17j": "N the one thing you hvnt mentioned their tht you are a pure blessings of almighty😇, a rare source of inspiration n motivation for those who already loose their worth❤️ I know many of mine female friends who still got motivation from your #joshtalks interview in such thing you simply blessing #hommie❤️❤️ #foreverpowertoyou😇😇 tadaa😄", "imroyaldeepu": "🙌", "vidyarao23": "Loads of love😍😍😘", "bhanu_priya_r": "U r beautiful 😍❣️ so adorable 😍❣️", "sneha_sule": "Keep it up🙌❤️", "jain_chandan": "U r such an inspiration for everyone ❤️❤️ who think they cant do anything keep spreading positivity ❤️❤️", "akshay_bharati35": "Pics art", "deepapal": "❤️❤️❤️❤️", "prakhar1607": "Overthinking gonna kill you mentally..", "prodipmar": "Superpb", "sanjay.kunwar": "Lovely", "narusmagik": "I see you as inspirational🔥🔥🔥❤️❤️❤️", "prachi_today": "I love you woman ❤️", "avinashs27": "Respected...", "causeimwarrior": "One question ,how u get these type of idea🙋🙋🙋🙋", "raneezrk": "👌👌👏👏", "prathip_pars": "U keep going gal keep rocking.. I’m stand next to u always a gud bud!! 👏🙏🏻", "bhavesh_dedhia": "Wtf. Y u down grade yourself. Let others opinion not matter u!! U are a great women.", "welcometoluckycity": "I love you💙", "nihilkirun_rev": "Start thinking positive ur behaviour is cute and beautiful ur brain accepts whatever u say so think good whatever u do there are ppl to tell u that ur doing wrong so dont mind anything. Do what u like", "4evauntamed": "Like they say \" Someone's opinion about you does not have to become your own reality.\" You just keep doing your thing and keep your head high @natashanoel001 ❤️", "annytany": "You are lit ...", "j_bhimani1210": "@natashanoel001 Girl you deserve love peace and happiness .. 😊❤", "gau_riiiii": "You're an inspiration. You're an answer to the narrow mentalitie. You're fire girl🔥", "dushyant94": "It's good you write stuff about the untapped issues and share your experiences but your posts have 70% negative sufferings you had and only 30% positive stuff to overcome them people usually prefer a positive boost after reading such long life story .just saying no offense and I respect you overcome your issues it's not easy I know.", "gillyontherock": "Ur the cutest potato I know😘😘😘😘😘😘❤️❤️❤️❤️❤️❤️❤️", "syama.d.nair": "❤️❤️❤️😘😍", "thakursherry": "🙌", "shahpriyansh05": "I love the way give the massage to society you always touch my heart dear", "mrdankdog": "this pic turned me on😍", "princekumarkalyan": "We love u~♥~", "devraju5868": "🙏🙏🙏❣️❣️😘😘heart goes for u .", "sharanya_chandna": "It's insane how much I connected with this it couldn't have been put in simpler and better words than this. Thank you This is 💕", "arsh.shetty": "🔥", "priiyallllll": "❤️", "aksharasunkari": "❤️", "gauravs93": "*claps for you* thanks for Inspiring mam", "wopatlasaladka": "Bow down to you ma'am.", "abdur_bleedzlife": "💪 well said @natashanoel001 and this my first comment on your amazing post. #truthbomb", "chocolatecupcake8590": "😘😘😘😘❤️❤️❤️💪💪💪", "rruchi24": "🔥❤️❤️", "jaydipsinhvanawat": "8", "somnagda07": "🙌🏽🙌🏽", "sonal_dolas": "You are the best! You are the best dear 👏👏👏👏", "aladdin__________": "FROM THE ASHES🔥 MORE POWER TO YOU🙌🙌 NATASHA 🙌🙌❤️", "amolkisms": "Y so negativi pic today... U r SuperWoman plz don't post such pix. N jo ye sab bolte hai for the there is saying ''अंगूर खटे है''", "mohanakrishnanz": "@natashanoel001 this is such a post adore you a lot keep going lady 🙏💪", "ddt.r": "Such a powerful pic!,", "vijayvinay9841": "Ena d ithu", "era.ali.982": "This is related with me", "mighty_mickybs": "Say to the world:- I DON'T CARE I LOVE IT", "jasdeepmago": "❤️❤️❤️", "sukhbir_dh_": "A woman is symbol of love mother of everyone and respected", "normaaaap": "❤️", "vikashvij": "Respect🤗", "assi_____": "fuck everything..🔥🔥", "moushmijacob": "U r a beautiful flower who was burnt by the hot sun and loving the wounds with your powerful mind and not hiding in woods...love u too much Natasha❤️😍", "shinchan_1724": "❤️❤️❤️", "bushrahusainqadri": "Iloveyouuu❤️❤️❤️❤️", "justavantika": "🤗🤗❤️ @ketakee read this.", "__riya._.mishra__": "JUST BEAUTIFUL 💜", "miss_nikkij": "@jithinnambiar_", "1minal.puntambekar": "❤️❤️", "anuyaphule": "You are so brave. Sharing your thoughts and your experiences with us, ot motivates us , makes us feel VALIDATED. But you just sharing all this shows how brave and a QUEEN YOU ARE ❤️❤️❤️❤️", "poonampatelkumawat": "Natasha you have been such an inspiration to all of us. I don't think it's necessary for you to think of anyone anybody out there who slut shames or does any kind of mental harassment to any of us. the only thing here is you are too open and these people take advantage of your profile but these thoughts and actions they do and have for every girl out there at some point. So we just need to ignore and fuck these assholes and their thinking.", "truuthseekerr": "please upload more photos like this", "srishtidigpal": "Sending u love and hugs❤️", "amitanshugupta": "Keep it up❤️👍", "photodoc_veer": "@natashanoel001 You deserve huge respect and love , and damn , \"we believe it \"........ you accept all what they said , so obviously you will accept what we are saying and trust me there are thousands of people who love you who admire you , and I guess thy are more then all thoes shit people , so yes go ahead and laugh louder as you do always , and keep your self happier because there are so many people who smile when your smile , 🌼 we all love you believe it ❤️🌼🌼", "meghaaggarwal013": "This pic is damn frustating", "bikersbrew": "Respect 🙏", "arathi.sen": "I have never felt as sad as.i do as I see this snap.", "misfitslave138": "Deep", "_stef_fit__": "❤️👏😢", "manveerkaur": "❤️👏", "prachee21": "These guys who talks rubbish i feel pity for them!! Whoever whenever pass these kinda comments they dont even bother to look into their OWN LIFE.. just post 💜💜 to their comments as they are useless", "branded_brands_": "🔥", "therajeev10": "❤️🙏", "kkhanna7": "Reminds me of the Sophia Bush moment in One tree hill.", "surbhi2912": "❤️", "abbasabbas8307": "Very very strong girls NATASHA...😘😘😘😘", "dilbag_singh0": "You are great and beautiful girl 😍😍😍😍love .......", "raudri._": "Hey, you're beautiful and don't listen to these fuckers who degrade you ☺️", "keena_zhimo_20": "R E S P E C Ted🔥🔥🔥 MORE POWER TO YOU🔥🔥🔥", "s_r_i_u_n_i_v_e_r_s_e": "Inspiring post Natasha ❤️❤️❤️", "anuraggoyal25": "You are a strong women.. Dont listen to these jerks.. You are inspiration to many people.. Do what you believe in.. Keep it up with your head held high... 🙌", "vinod_rathoddls": "❤️❤️ pain make as human if we didn't had pain we wouldn't be like machine", "hammadaks": "Hi. I am a musician. Want to say that I have been trying your exercises. Thank for helping everyone and me. I have lots of respect for your work and enthusiasm that you have. Be blessed. You have blessed me many times", "shyloud_10": "Thank God I came across one of your posts on Instagram this one day while scrolling! I am at a loss of words right now but please know ma'am that I kind of relate to you and seeing you exceeding limits and being able to accept yourself the way you are makes me believe that I will also be able to pull through and start loving myself someday. You are an inspiration ma'am. Thank you for existing and loving yourself.❤️", "coach_amandaparker": "😍💪😎❤️", "humairah_reyaz": "💕💕💕💕", "joshuaperera_": "❤️❤️❤️❤️", "aryan791": "Nailed it❤️", "peacemaker_anywhere": "Everything in this world in impermanent so, take it easy!", "j8lasoul": "🗣She is who and what TF she wants to be! Period! As a man, I should have no control or say so of any kind in defining that.", "saraswathysridhara": "Idk what to say, there is so much to say about this post but il just comment hearts ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ more love and power to you.", "mrohit627": "Looking super madam ji", "sahabsinghpawar74": "Bhut bolti ho", "nerdpapi": "I'm too ugly to call a girl any oft that. 😪😭", "godly_artist786": "Thoughtful... Very thoughtful🚨🚨🚨 🤔🤔🤔👍🏾👍🏾👍🏾👍🏾", "sammy_xclusive": "❤️❤️❤️", "ganeshjadhav1994": "🔥 Gajani 🔥", "gauri.om_": "Hey strong Girl, it's wonderful to see you growing so beautifully. At times I feel why u even go back to these thoughts. Soul is pure, heart is filled with Kindness n Love...what else anyone needs. Stay blessed 💖", "thevegan__vamp": "💓", "im_srkadiraju": "This post is framing your feelings, emotions into words and pouring them into a paper.... Can't get better🔥🔥", "suhaanaasuffer": "Natasha, you don't need me to tell you that you're a fighter or a survivor or that you're beautiful. You know all that already. But I would say this, I can only imagine what you've been through. Your journey is still on, of course. But it gives me hope, it makes me brave to think that you are what you are, despite of or because of or regardless of what you've been through. Thank you for existing. Your honesty is infectious. K bi. 💛", "introvert_2910": "Broken - But Beautiful😘😍 Keep going ❤️ #scarsarebeautiful", "a_for_always_arup": "Actually they forget that she is a woman like her mother🙏", "moitree__boruah": "Love❤️❤️", "suresh_kuma_______": "Sexy🍌🍌🍌🍌🍌🍌🍌", "shradhachamoli": "hmm 💯🔥", "richardmarshjr": "This is a heartbreaking post. I hope you never feel this again.", "davidsmeyers": "Beautiful...", "anandkharra": "Nic", "35655776sss": "Great words", "f.l.ypilates": "Respect🙏", "ethanmarvel2017": "❤️", "vyasaakansha": "🙌🙌", "chasiford65reidbvo": "More Power to you @natashanoel001", "storiesbysurabhi": "now lemme tell you something. you're love. ❤️", "bidisha13": "U r an inspiring Yogi for me @natashanoel001 .", "explore_with_lyffylife": "We love you @natashanoel001 .. you are amazing n a great motivation", "invisibleillnessind": "So powerful! You are extremely inspiring ! 💙", "yummygabby22": "@natashanoel001 You are most outstanding and healthy mind body and soul package.. 💋❤so give a f**k to those of feel so about you. Remember great minds mind their own business and not interested to poke their nose in others life but only bad mouth and poor souls are shitting around coz of their own discrepancy, it’s not your fault. 😎", "damnziii": "You are so inspiring 🙌🏻.", "er.nidheep": "Kuch to log kahenge... logo ka kam kehna... Chodo bekar ki baaton ko... kyunki Hume unse kya hai lena dena...", "letzci": "You are million good things and you are loved :)", "subrothob": "❤️🖤🖤 this is bold n true. Believe u have come far enough to even post this for negative people to read n understand. Your are an amazing soul ❤️❤️", "yatejmari594": "So sweet", "sharvi1027": "Kyn farak padta hai ki log kya kehte hain ...\"kuch toh log kahenge logo ka kaam hai kehna chodo bekar ki baton mein kahin beet na jaye raina\"so mam chill ...enjoy because your amazing..and most of all your pure soul ... 😘", "parthajitkalita": "Love you girl... You are doing great❤️❤️", "ma_reddy": "Survivor..hard worker..guru..animal lover..daughter..sister..fighter..", "b.rajashekar_reddy": "💋💋💋", "stylesavitri": "True that. This world is full of negative people and once we understand our worth and believe in ourselves, no negativity will stay for long ❤️", "sheshodiasuhani": "You nailed it. This is the best ever. Also the thought behind it. More power to you. And lots and lots more love 💞❤️", "its_jayeeta": "U r love ❤️", "shinoblin_lonley": "Your not a loser or a slut your a good person", "srisha_balan": "When ever I read ur posts... It gives me goosebumps.... Why r u so cool!!!", "raghavpar_94": "Don't pay attention to it @natashanoel001 You are an inspiration for youth & we admire u ❤️ 😄", "insavagecompany": "You said trigger warning but I didn't listen.. Fuck!", "aquarian.neyha": "❤️❤️ ur motivation", "amulya.nag.m": "🔥🔥", "saumitra2987": "Brilliant writings. Powerful", "shivanimalik11": "❤️", "secret.heart57": "You have great body", "architfaujdar": "Who care's when u have more supporters than haters ...❤️❤️", "mundramanish\nVerified": "Verified", "ww.w.sureshkumar940": "Super you 🙏", "sinha.khushbu": "😍", "poopoopoooy": "I adore you soo much .....Ur inspiring to many .....", "khan_aniq_5": "🔥🔥🔥 Keep it burning", "vidishabaliyan_missworld2019": "I love the way your thoughts and your attitude.We love and respect you always.keep inspiring.😊", "des_anshu": "@natashanoel001 you are such an inspiration so don’t give a fuck about people because kuch to log kahenge Kiu ki unki khud ki life me kuch hai hi Nahi instead of criticise other (a successful person don’t even have time to get into others lives) those losers are doing all that shit.", "sm.raikar": "Cud relate dis , Such a warrior 💋much love to you♥️♥️ @natashanoel001", "sncclicks_india": "@natashanoel001 more power to you dear... People's gonna hate always but you the better than others", "richa_mourya": "More power to you woman 😊", "priyankarao95": "This made my day @natashanoel001 🥰", "sonu_astroved": "ye kya gajni type likhe liye hai", "saibliss143": "U know..someone's opinion doesn't make ur reality...ur what u are ..as a yogi u will be proud of it .....the position ur in now proves that ...u dont care of s**t ..keepn on doing it work ..stay blessed", "__9teas_soul__": "This lady should b included under Inspiring women of the era♥️", "the_unibrow_charmer": "This post is as relatable as it can get 💯🙌", "vibhaparcha": "❤️❤️❤️❤️❤️", "jayanta7402": "Cool down!!!!", "tgod4400blk": "That’s me 😂😂", "papawillyy_": "Stop giving a fuck about what people have to think ,say , etc about you. Simple as that. Stay blessed .", "david_dhillon676": "Great work god give u more power confidance nd meditation", "deeenesss": "I feel you Natasha ❤️ Tight hugs coming to you 🤗🤗🤗", "the90s_kid___": "Yor are beautiful just the way you are and an inspiration to me😘😍", "sjs1403": "I would rather call u a sweet kidd learning life beautifully. ❤️", "jishnu_jish_": "Positive HUMAN..", "rohitpatel3212": "👏👏👏👏@natashanoel001", "__ikhushi": "Best 💯 you motivate me everytime to be a better version of myself ❤️ thankyou ❤️", "middhaaman": "We love you always @natashanoel001 ❤️", "sindhuraghupathy": "Love you sister @natashanoel001 😘😘❤️❤️", "dreaammmzzzzz": "🤗🤗🤗", "aaanandx": "❤️ @natashanoel001 🤘", "istaa_pistaa": "♥️♥️♥️♥️😻😻 @natashanoel001 i respect you .", "adhithiiiii": "This is so amazing!", "_xevka_": "❤️❤️ love", "naurinarshi": "I adore u n ur posts so much🔥🔥❤️", "natashanoel001\nVerified": "Verified", "mohmmadalipathan": "INSPIRING💪💪💪💪 @natashanoel001", "swarali_redij": "You're deserve the world❤️❤️❤️❤️ sending love to youu", "thebrownfirang": "You are such an inspiration!!!! ❤️❤️❤️❤️❤️❤️ keep up the great work ❤️❤️❤️❤️ i really loved your workshop on Saturday. Hope to attend more of them. Youre such a warrior ❤️", "silent_em0tion": "❤️❤️❤️ We love you... Always!!! 😘😘😘", "bavani_sukumaran": "❤️❤️❤️❤️❤️💐💃"}