{"kidwaifarzil": "❤️❤️😢", "vikas996988": "Wow", "gudivadapydiraju": "❤️❤️❤️🔥", "dark_angel_boy_": "Hy", "hasmukh_ladki": "Strongest girl 😍😍😍💯 virtual hugsssssss🙈", "harshyadav2019": "🔥", "nahrowiy": "Porno", "rikeshpatil": "👌👌👌", "taurean_bitch": "Facing panic attacks every alternate day ..n because of the fear can't sleep too", "savyasachi2020": "Yet..You are here..Fighting and Inspiring. Me along with all these people are with you. Take my Biggg Huggg to flush out all your sorrows, pain Keep Smiling", "vinod_p8500": "More Powers to u and be strong", "mohdabdul2902": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍very very nice baby One you Good", "malcolm.brady": "Beautiful hot and sexy", "123dvtn171975": "🎉🙂", "prakyath125.2": "❤️", "free_to_express_": "❤️❤️❤️❤️", "menmen_rika": "❤️💙", "vv3134892020": "😛 Send Nudes.", "lakshu_singer": "U r just me... Or the reflection of every woman in this world who cannot open their mouth and say... Reading urs is like reading ours. I thank me for getting to know you through this.", "mallu.portrait": "Beautiful❤️", "rahul_jat_5445": "I m coming in your bathroom", "ashikagupta": "@natashanoel001 can u pls txt me back pls i need to tok badly pls its getting tough", "seek_elysium": "Broke down after reading \"I just needed a hug when I was crying.\" because I've been seeking that all the 25 years of my life and have failed to receive. Perks of having a dysfunctional family when both your parents suffer from mental illnesses/personality disorders.", "teju3968": "Beautiful", "theunprecedentedgirl": "You are brave. So kindly do something for other women too who need help with your such a big fan following. To heal others one needs to get healed. All the best rock lady", "jat.malik": "❤️", "_rishabhshrivastava_": "💓🔥stay strong", "dhirender4406": "Natasha you are so strong 💪👍 and inspritatuon for all.Forget your past and think about your present and future. Love you so much❤️❤️", "ohmygwaaad": "Please go to the physician and ask for medication. 🙂", "bewdi_billi": "My love, I hope you will come to see that whatever we feel is not to pin point blame. You feel guilt because you're in control of your actions and want to be responsible. NOT because you did anything wrong. What others label as a blame game is merely you questioning the right ask of who was there to protect us child when someone should have. Your thoughts aren't meant to be justified to anyone who isn't making an effort to see your point from your view. Not worth. You're worth it all. Your feelings to your actions and repeat. What you deserve, the universe will shower you with it. Endless love and light. If you ever hit a bad mental space, please feel free to reach out. We all could use some calm and understanding. S O A R AND S H I N E ✨💙", "matharujaspreet": "Hope you are feeling better now , strength to you 💪💪💪💪", "rahul_kumar30": "🙌 You are strong as mountain", "mazharnaseemabbasi": "Perfect click ❤️", "mugdha_pattnaik": "More power to you. Sending you love and healing💛", "kundandavid": "If you believe in prayer you will be healed, cured. Miracles happen everyday.", "jayyyyjoshi": "Try ayahuasca! And thank me later :)", "gohelanil": "Janu", "misfitslave138": "You ok?", "ankursood07": "You are a warrior GIRL😍 Be like that😘", "sahanayog": "Thank you for sharing this especially today Natasha, I felt I was not alone fighting my demons from my past 🙏🏼", "iamtrinadh": "More power to you Natasha❤️", "rashideogam": "Lots of love and power to you !!! 💙", "phalgunshot": "With you @natashanoel001 stay strong and be you... Always", "sandipan.chakraborty": "😛😛", "yogini_chethana_hesh_35": "Be strong 💪 I am sending wishes to you have a blessings from krishna... Hare krishna", "yellow_production": "If u want to take out of ur mental dilema than ur only one can help u leave it the moment in past whats make it pause in yesterday only now ur strong soul keep it up and keep going longway to go", "akas9508": "Nats you are a yoga teacher how come you suffers panic attack. .dear anything or any kind of support you want fill free to talk to me god bless you my dear", "sureeaerospace": "🔥😱😱", "run_fattty_run": "❤️", "wremi76": "I really needed to read this today ! Thank you, you beautiful soul... for sharing your pain so others don’t feel so alone in the same situation... much love to the scared little girl in you ❤️", "prakashuchil": "🙏", "_rukmanikg": "🙏🏽 Stay strong sending love and support 💛💛💛💛💛💛💛", "nileshvjoshi": "❤️", "rayyyy_210": "Why you posting such dark pictures dude which gives out such negativity? I understand the caption of you letting out your feelings but wtf is up with the pictures ? And you intentionally capture it in this way. I’m sorry but it’s helping neither you neither any of us. The picture just looks disturbing @natashanoel001", "poojamahadevan": "❤️❤️", "taigar_abhi_zinda_h": "Ye ky h ye ky matlab h es pic ka ap", "nooonna10": "🤦🏻‍♀️", "_tiktok__kerala_": "💕💕💕", "indian_godfather": "Then do something, rather than just ranting! Every one of us is with you🔥", "t_chadwick10": "I hope you get to feeling better", "hydropanic.90s": "Your A Storng Girl 🙌🏻 Move On You Such A Beautiful Life 😍", "the_flavourful_life": "❤️", "soopermommie_": "💙", "mad_ovr_words": "So beautiful. Thanks Natasha for sharing. Ur healing beautifully", "always_a_dancingirl": "Stay strong❤️❤️", "be_postive29": "Nice message to seek attention and gain sympathy to reach Heights", "bazith_123": "Ahh Ilu", "hemanathbabuperavali": "You should not come across all these things.because you are yoga expert", "akshitshrivastava": "Wow. I feel so horrible you had to go through something like that. I've been having 20+ panic attacks in the last year and I wouldn't wish one even on a worst enemy. I was about to DM you this and to my surprise.. I saw that I had probably replied to one of your stories about panic attacks back in May. I hope you feel better soon ❣️😊", "aude.sunyogamoon": "Your post made me cry. I am a mum. My daughter is only 10 but everyday I tell her that she can tell me anything, everything...and essentially if anything important happens, if anyone hurts her, she must tell me as I think we can’t always heal alone and things have to be told. So I hope she will always be able to find me and hope you will be able to find your mum now. Sending you lots of love. You’re an amazing woman. 💙💙💙🙏🏼🙏🏼", "noelchigurupati": "Try Jesus 🙂 @natashanoel001 🙏", "ferozekutty": "Get up keep walking", "womanofxpression": "💗", "dekh_tera_baap_aaya___": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "girishnaik3gmail.com3": "+ve vibes for you", "khwabeeda.rooh": "I love you.", "sirajsd8": "Most attractive🔥🔥🔥", "hopebemine2": "This hit home hard for me, thank you for. Sharing.", "mugdhaa_kulkarnii": "You are truly an inspiration for many things in life... Whatever and whichever u write I can relate it to myself many a times..I feel you are saying something from my side..those words touch the soul.. Keep inspiring..love always ❤", "mokshadosa": "I feel you.", "bhkti_more22": "I am gone through almost same situations from childhood to now that bad touch it breaks my heart in pieces it burn my body with acid...pain is a lot my soul brecks with every that touch its painfull and hurts more when your closet people done that ...I learn to smile in this situation I watched girls who attacked by acid and inspire myself with their smile don't get panic whenever you think or watch that person take stand for yourself punch him or go for boxing trust me it really helps learn self defense and thanks for inspiring me love from heart let comes out your emotions your anger your cry your sadness should loud or break anything which is not your and trust me punch that tailor in front of your father he will be proud from inside", "harbinder1972": "Sometimes in life we find ourselves in a situation where we find loneliness despite the fact we are surrounded by people... And moreover we are unable to prove ourselves and others who are in front of us seems in good position.", "sahana.chandrika": "❤️", "reel_audio_media": "🙏🏾", "sionagoplani": "❤️❤️❤️❤️❤️ sending love", "ishanshsingh": "I want to say that I am glad that I attended your session in Bangalore! Keep up the good work 🙂 A recent good friend of mine told me ‘Future has infinite possibilities’ and hence ‘Stop living in the past’. Have an amazing 2020.", "roshny14": "@angeleyz08 this is so raw and honest", "its.all.illusionn": "❤️❤️❤️", "richard__rozario": "Hey .. u do realize right u have us :) ... U HAVE US", "agramofkomal": "❤️", "s_t_one_c_old": "I'm having.. A panic attack right now...i didn't know what else to do. My triggers are predictable and I keep saying I'm strong enough if I let no one know that.. In this anonymous platform.. I'm glad that I found you.. Ik that I'm not crazy for keep doing shit to myself and unable to seek help.. And this is calming me down knowing that I'm not alone. I thank you from the bottom of my heart and my snotty tears that I can't stop reading this.. ❤️Much love", "anikaaks": "❤️", "nevergiveupeverkeeptrying": "Little you know hun you are very strong woman... stop and look back and see how you have gone through and has accomplished and still growing strong 💪 just you alone has travelled this journey and you are so young i am so proud of you 💕you help thousands of others who needs this kind of strength and inspiration don’t stop keeping going we just have to tell our mind not many ppl can do it you need lot of inner power to do that and looking at pictures and reading about your struggles makes others stronger we all love you 😍 and never forget you are a gem 💎", "roking.ramesh6363563994": "Shame for u...", "introvert_2910": "Stay Strong❤️ You have reached here by all yourself & remember your \"WHY\" #youareworthyoflove #youareworthy", "sridhar.yerra.92": "Fucking you natasha noel", "tusharpandya1993": "I love u so much", "be_healthy_be_possitive": "Please take care of ur self dear sister Natasha", "lljerseygirl": "♥️🙏🏻 I just had quite a few realizations and I sadly just pass off my childhood, teen and adult abuse as “I survived it and moved on”. Thank you for being strong and sharing your vulnerability with all of us. Much love to you.", "bakedom_mumbai": "Love and power to you my love", "trishalah_": "I relate so HARD to this OhmyGod ❤️. Hugs to youu", "ranu_jp": "All is well ...its your inner voice", "banjarii_": "So true, so this feeling of anxiety visited me very recently and I am still trying to figure out the reason. Now a days I am also trying to know my inner self more. All the people who are suffering from any kind of inner imbalance I really want to tell you what i just understood that please be aware by what all is happening and then take a proper treatment. More power to all of you. ❤️❤️", "dr_writer_gurpreet": "Hey ....are you ok??? ...take care...god bless you", "johanny19802011": "Wow i feel bad for you i wish there be a way for me to comfort you to help you in some way but all i can give you are my words of comfort 😍🙏📿", "blackandwhite2610": "This hits so close to home... I'm so happy that you're finally finding the peace that you so deserve💕", "anx.kalsi": "♥️", "is1854": "Natasha ji.....you are the strongest girl ever. Yes, family is something we get the energy from when in need, when we are hollow inside. The world makes you strong mam. It gives you the bitter experience of emotion and feelings. But not to forget that whatever it gives, it gives to make you strong, not to get in that \"DALDAL\" again knowingly or unknowingly.", "ameetl": "Natasha. Please check DNRS by Annie Hopper. understand the program. Check the YouTube recovery videos. I am positive this program can help with anxiety and panic attacks. It can help your subconscious accept what's happened and move forward so you don't have physical reactions. Let me know what you think and if you have any questions", "rains.cat": "Sending so much love ♥️ Girl, I've been there -- the panic attacks, the trauma, the link to physical body and symptoms. I really want to share with you how I took back control. I think it could be really significant for you. http://limbicretraining.com/recovery-stories/how-it-works/ goes into some of the theory. It sounds like your system is in overdrive, fight-or-flight. ♥️ DM me and we can chat or skype. Sending love, you are so strong and can get through this.", "jwideman3": "Could any of this be side effects from your medications? I feel for you and have friends with similar mental issues", "gin_gin24": "Thank you for sharing your story with us. More power to you you beautiful woman 💜", "tusharshinde8": "❤️❤️❤️💪🔥", "anushreenair24": "Heyy!!!! You are very strong and brave!!! I cried reading your story because I relate so much. I love you soooooo much and you are a very big inspiration to me. Sometimes I feel nobody in this world understands me, I have no one to share what I feel and what goes in my mind. I am a single child, I never had a sibling to share my thoughts or anything. When I talk to someone about my feelings they start ignoring me and I don't understand to whom should I share. I feel sooo alone at that moment. But now I realise there is nobody in this world who will understand me except me. I am healing everyday by being strong and improving myself. Loads of love to you....❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️💪💪💪💪💪💪💪💪", "dinesh_k_777": "Itna Kon pdta be😂😂", "ma_reddy": "It is not your fault. I was a victim of anxiety attacks. It slowly fades..but it will take time. Friends and medicine will help upto certain extent. Immerse yourself with new habits..keep busy. Worry about things that you can control. Travel..life is too big. Everything will heal. We are stronger than we think. God bless you.", "azhermehdi1988": "I must say if you are standing today that's your answer to all that you have had gone through in your life! More power to you 👍", "optimisticpavni": "You are amazing. But I hope you will stop being the savior of other people because it continues to hurt you. Stop protecting everybody else and their feelings. They will be fine. Start protecting your feelings. We look out too much for other people, and only we can alleviate that burden. You are a fucking gift to your parents. They know that. They just can’t vocalize it.", "harshalnaresh_srivastava": "Innocent shower 🏃💨🚿🛁😌", "eshafromadbulb": "You’re strong and wonderful", "manishtayal14": "@shrimad_bhagwatgeeta its only solution for relax your mind ...pls read it.. And its may feel good", "reachzenith_pal": "♥️ u r a true inspiration and love♥️", "__rahul__regimon__": "who s the photographer", "practivist": "I relate too much to both the post and the following comment. It's too similar. I still carry it with me at 32. I haven't moved on and I don't know if I will. I can only offer you some solace in knowing that you're not alone.", "sameer.malik24": "Kindly check ur inbox and respond plz", "saigadapa": "Be strong", "miss_logan1": "Sending love and positive vibes to you my dear ❤️ thank you for saying and putting into words what I have felt but couldn't say!", "aishee_mandal": "🔥🔥", "rubabaleee": "❤️❤️❤️", "thelallalens": "Your post has really hit me hard. Something happened to me and I wish I could tell them or talk to them about it. But I can’t as it will hurt them and I know they couldn’t have done anything to protect me but they will blame themselves. Thank you for your posts. I appreciate them all. You’re strong and help me to be strong.", "ramnayantulai": "Good night", "dreamhigh_1995": "❤️❤️", "lnsurve": "Can you explain it in Hindi", "parikshitkothimbare": "😍😍", "araynnoutpal": "Wis dt B F9 soon🌹🌹🌹🌹🌹🌹", "pilita_jovane": "You made me cry! Sending love from far away🤗 we are all in this together!!", "moto_ronin": "Yo lioness... You're fierce & strong!! More strength & love & light & respect to you!! Next time any piece of shit tries to pull a stunt on U or anyone u know, chop off his balls and serve them to them itslf!!! Such crimes shudnt go unpunished!!", "i_neha_tiwari": "Just sending loads of positive vibes to you! 😊", "jetrig8000": "It’s good that your healing! Pls stay strong until your scars are gone. It happened once it happened twice what will you do about it? Don’t you want to teach them a lesson?", "dipashamulasi__": "Everything will be fine soon. All you got to do is stay strong like you are rn. Don’t hold it to yourself,you look so fine on the outside never thought you could be the one too.", "lifeluvershru": "♥️♥️♥️✨✨🌻", "dr.samikshaseth": "You are really strong to express and accept the situation.... Half of the healing lies in here... The rest half is gonna be a cake walk considering the brave woman u are... More power and healing to you Natasha 🌟", "peachyfitlife_": "You’re a strong warrior. I can’t begin to fathom what you went through. Sending you all the love you deserve ♥️♥️", "pri24pawar": "More power and strength to you Natasha❤️", "ebi_in_eden": "And a new day will dawn For those who stand long....❤️", "yoga__bliss": "Stay strong as always ❤️", "sanketsenapati": "Kya bakwass photo hey..", "miss_sruthyvijay": "More power to u girl... similar story but in a different way... don't give up", "snehalbhardwaj93": "We all just love u sooo much ❤️❤️❤️ @natashanoel001 💎", "soft_boi_alexander": "I'm sorry for what you've gone through. I hope you know... None of what happened is your fault. It's not", "_tiiana__": "Be strong🖤:(", "greencrackconure": "Breathe, and just be aware of your breath. Helps me in similar situations. Denial can get tricky at times!", "catrinepiaia": "I'm so sorry about that, I've been suffering panic attacks since I was 9 . I hope u get well soon❤️🙌", "itsdileepkumar": "❤️❤️❤️", "niranjan_three": "Finally you are getting way to heal. If you say family to someone it means they are for you and you are for them. It's better to say and cry in front of them. The way you are natural to the audience can't you be that natural to your family ❣️ and just remember You are stronger than this situations ✌️", "sohilshake123": "❤️", "i_m_being_shaan": "Ohh ❤️😍👌", "lightbearingsoul": "Thanks for sharing. Hope you feel better ❤️", "thad4xx": "Keep strong", "deb_anth": "To some extent I can feel the pain..during my childhood days I have experienced it many times..I was afraid @natashanoel001 .. It was one of relative... Hate that asshole from my core... Never said it to anyone till now... The pain the fear the guilt the sufferings.. suffered it all gal.. My parents still love that asshole.. but One day I had a confrontation with that SOB.. Yelled at him..said whatever I wanted for the last 2 decades... Slapped him... But that helped me to calm my hatred... So I can tell u this...stay strong gal u will have ur day... Don't give up... It's not ur fault at all.. It's normal to get angry on them who did not know the pain..as they can only show sympathy.. Stay true as always u have been.. time will show u the way... It's hard to do all these as it is a SOB Aryan culture which only knows to demotivate the girls.. still do what u want as it is ur own life.. And always u rock...🙂🙂", "tekla_k": "You are sooo brave!!! Your pain, I’m so sorry. ❤️❤️❤️ Healing. 💕🙏🏼💕. Sending you lot’s of love and warm hugs. It’ll be okay. Your are loved and not alone. ❤️", "bluegem41": "💛", "cageddino": "If telling social media helps, that's cool. Sad to say these things happen in life. Wish I could help more.", "akshit.saini.gagiyan": "Mjaaaa camera man ka hi hai", "rpsaini87": "U r Med", "s.p.i.r.i.t.u.a.l": "Here I send you positive vibes for you all the way. 😍😍😇", "ujaascraft": "Thank you so much for sharing this. Lots of love to you.", "vidhya.nair.359": "Even i feel the same and i stop talking to everyone and start self sabotaging me", "_._priyankaaa_._": "You are damn strong 💪🔥❣️", "epsita__": "☺️☺️", "pt227538": "🙏🙏🙏🙏🧚‍♀️🙈🙈🙈🙈", "kumardevyansh786": "Why are you upset and how deeply you are in your stress listen some (qwali ) it keeps you stress free❤️❤️", "yahiya.i": "❤️❤️", "the_aries_gal": "We love you girl... ♥️. You give us strength n more power. You may not know your worth but as readers and your follower you have helped us to get over with our feeling of worthlessness.. you can never be nothing coz u are a lady who helps uplift people of their own fears... U are important... Much love😘", "dhevamitra": "Thank you for this💛🌻😘sending love", "zahadsousa": "This post is amazing and really inspiring. stay strong Natasha👏👏👏", "gomlemumseklumpen": "💚💛🧡💜", "jkripal": "check out my page it has good quotes...it will help...@osho_onlly", "clareyoga_": "time to rewrite y(our) own story 🙏🏻✨", "kapil10010": "Take care of yourself", "thefireflies_inme": "So yeah, one way your words has become mine too, thanks to you. Hope you get better soon. Loads of luck and love to ya. Love yourself.", "_atypicalhuman_": "Yes, you are strong and everything! But Natasha, you can do what is in your hand.. that tailor which comes home when you were 25, stop that bastard and tell you mom that this ain't \"it happens\" wala scene. Parents don't understand a few things and rather choose to normalize it. You educate them! You tell them. You are NATASHA ! ❤️", "shantiyoga.paulina": "❤️❤️❤️❤️❤️❤️", "amybkeys": "💕💕💕", "te_amo_jay": "Be StronG n Be LoveD ur SeLf💗💗💗", "manoj6600kumar": "❣️❣️❣️❣️", "tamilyogini": "More power to you my dear 💜❤️❤️", "alessandro_bilato72": "Always go strong ❤❤❤❤❤You're a winner 🙏🙏🙏🙏🙏", "rashmi_0222": "Sending hugssss❤️", "onyx_erlz": "They are what they are and could do as much as they could to the best of their knowledge, conditioning and ability! This💯", "_anshumansingh_": "❤️", "gippsysoul": "Natashaoel001 u can DM me i can help u out for sure", "j_bhimani1210": "From holding grudge against them to sharing them what you have gone through.. is who you are and you are so strong and you are fighter... Because you fight every time with your inner demons that is anxiety, fear, feeling of worthlessness, feeling of being inferior, feeling of being burden and then making yourself realising that you are beautiful, strong, inspiration for others, a true fighter .. more and more love to you.. You are courageous to tell the truth about yourself and it shows you are beautiful and loving soul ❤️❤️🐿️🐿️🐿️", "going_circles": "🤗", "_being_vinu_": "Mast 👌👆🏻", "_priyanshi_shrivastava_": "Oh my God. You're so strong. I look up to you as my idol. 💙", "kanika_1809": "❤️", "salma_pathanbk": "Keep yourself busy and I love your workout videos...something which I am longing to do and you inspire me a lot👍", "shankar.thalari": "W❤️w open pl🙏🏾🙏🏾🙏🏾🙏🏾❤️❤️❤️❤️❤️💘💘💘", "chetan.joi": "I know fighters dont cry. But sometimes its better to shed out those \"Tears of Fears\".", "saraibrahim21111": "Same story here as well. Don't stop trying,after all you'll never feel worthy in front of those who never want to see you reach great heights.keep on doing it alone,we're all in this together", "sandeshsalunke00": "👏", "_kajalanand_": "❤🌻❤", "nutellaagain_": "❤️❤️", "thefitgirlwithstretchmarks": "Stay strong always❤️", "ranjit.kaur.247": "Please pray gal 🙏🙏.we all love u ❤️", "sharma18.neha18": "The ability of yours to express this clearly and to the entire world shows you are a brave and strong girl. More power to you Natasha!!", "martin_hyd": "@natashanoel001 💯😘😘", "varun_mertia": "Very Inspiring Stay Strong ..!!", "aggarwalabhi26": "Nyc", "shivmatangi": "👏👏👏hmmm", "swarali_redij": "More power to you girl❤️ You’re beautiful", "avee95": "😭😭💜💜💜", "jiteshravariya": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "sloth.diaries": "Stay strong natasha 🙏😊", "blackalsowhite": "Natashaaaaa 😭 baby girl you're so strong and so brave for being so openly vulnerable and open. You deserve to be loved and hugged and kissed without condition. Your pain is valid even if you're strong enough to hide it, pain is still pain and it demands to be felt. Much much much so much love Natashaaaaa ❤️❤️❤️❤️ #potatotribe", "tusharchinchmalatpure": "You are Natasha Noel don't forget..... U are one of best influencer..... Have self confidence.... 👌👌😍😍be happy we are In your support anytime.....", "bhavika_w20": "Check dm", "bhumika1231": "@_anu_official_ must follow her ..her journey will give u strength. she's amazing"}