{"_iam_sm": "The content you've shown in this video is superb 👌 keep u-p the good work 👍👐", "coach_amandaparker": "You are just toooo gud ..", "azano10": "Damn lady, I understand you aren't asking for it. But I don't think it's acceptable behaviour to be nude in public, guys or girls.", "niranjanaiyer": "@yashpathak06", "8330arthav": "Nice story", "deepu_baw": "Awesome u r so hot", "gurleenkaurrr___": "More power to you", "sukhbirsrdar": "❤️❤️❤️❤️THE STRONGEST SOUL❤️❤️❤️❤️ SAT SAT NAMAN", "kevin.bitw": "Damn bro that's crazy but", "rahul_jat_5445": "Sexy body", "mishamalik._": "More power to youuu😍", "anirudhverma429": "Only a fool won't be asking for it. 😅", "wontyoujumpnkissme": "Asking for what????", "arvindvishwakarma6432019": "👏👏👏", "namrata_dahama": "Wish I could be that confident", "satyaprakash_bbsr": "I think you like to be naked", "akki__rachhh": "So confident that people ARE getting aroused. Ha ha ha 😆", "shazrazubair": "@nadeepaws", "sphinx404": "Masha Allah cringed", "thebgwproject": "🔥🔥🔥 so powerful! Keep it up girl!", "kkhan.rock": "I m respecting u", "shabina_pathan13": "@natashanoel001 We understand the message that you want to convey. But then you may attract many of illiterate people by this. Completely understand, that it would not be your fault but its about their thinking but then there is a larger success rate when we change ourselves rather than changing the world. #nooffense #nosupport", "gh.prasad": "So sexy🔥🔥👌👌😱😱", "mn_in_love": "@pornhub 🤔", "harpreet.maan.5817": "Bang on", "kishore.pandu0079": "Nice body", "meghnareddyofficial": "Lovely video. Hard hitting.", "archana.pandey.3701": "❤️❤️", "superheat00": "🔥🔥", "_reshma.r.k_": "Mam huge respect🙌", "parveen3323": "Wows sweet", "kushalchandra_arya": "🔥🔥🔥🔥😍😍😍😍❤️❤️❤️💥💥", "belly_enthucutlet": "@deeevzzz", "ma.nn.u": "Respect 😍😍😍", "vaghelakirti": "This world will see your thinking in a wrong way ... I am devoted to you🌹🌹", "er_ganesh_official_": "Inspired by u....😍", "a_littlemuch": "Nobody's asking for anything anyway. It's corona time. Anyway let's shake hands on the commendable video and execution 🤝 😃", "ranjunadiyapra": "👍👌👌👌👌👌👌👌💋💘🔥🔥🔥👏Happy hot women day...", "chandrakalyan61": "@natashanoel001 So you meant to say unless you show your pussy you are not asking for it ?", "akhil_aachu__": "🤞🤞✌ peace broh", "nambiar_abhilash": "damnnnn..... m touched 😍", "sudeep_chowdary4567": "Really such a great u are 👌💖", "asif_____mhmd": "Wow", "amitkumar878720": "🤔🤔🤔🤔🤔😷😷😷😷😷👁️ carona time 😜😜😜", "shuvo_khan420": "👌", "varmagautam": "Very nice beautiful sexy sweet hot", "honey1479": "Wow Superub 🔥🔥🔥🔥", "naveen.kher": "👌", "bhavna.beher": "you are amazing just the way you are❤so thoughtful , happy good person loveeeeeee youuuu💕", "vjsinhpanwar": "Subah subah kya dekh liya bc ab pura din kharab jayega🤮", "ovim71": "Brave girl ❤️", "aanash.mohammad": "🙏🙏 respect", "vv3134892020": "😎😈Free Striptease.🔥", "imtiyaz_earn.online": "Hi Natasha, every woman has a right to dress the way she likes. It is the cheap mentality of few cheap people that needs a change", "princerogerprince": "😍", "ashlin_shajan": "Respect you Mam 😌💪👏", "babysanjz": "🔥", "__renuka._": "I feel powerful everytime I look at you❤️❤️.... thanks for being such a beautiful soul and thanks for existing❤️💯", "irfan_irfn": "😘😘😘😘", "sanchez4you": "Nice body!", "bamangpiku": "Wow 💓💓💓 Ur confident.", "someone_shajee": "👍👌💗😘", "aj_9579": "Embarrassing our country Yoga Liberal woman, if she wants to show yoga in clothes without even😂", "amalkrishnan790": "🤘🔥", "govindk.panchal": "superb❤️❤️❤️👌👌👌", "angloprakash": "Thanks More power to woman like you", "mr.reverie": "The expression on your face tells me a million things!!!. Your truly a warrior woman 🔥! And I truly respect that!!!", "gargi.b9": "Kudos girl💜🔥", "gopalkrishan7904": "Wow super SEXY 💋🔥🔥🔥 modeling", "prasad.janga.9": "🔥🔥🔥", "abhilashdeshpande555": "🔥👌", "rok33t_": "It's sad that we need to even have a video like this. Ironic that we call rape a \"culture \" when it shouldn't even exist as a phrase. We use clothing as a provocation as justification when there is NEVER A JUSTIFICATION! THANK YOU @natashanoel001 for being so brave and sharing this message. 🙏", "rag_the_writer": "Fucking sexy 👅💋", "ships_czar_": "🙌🔥", "kunalpunjabi8600": "@natashanoel001 loved this u r an amazing❤️", "_fearless_bird_": "Message❤️🔥", "bharadwaj.kalyan": "Honestly. This is the best one I have seen ever 👌 #respect 🙏 Natasha 🙏. A huge sastaanga namashkara for you from my side 🙏 @natashanoel001", "surendrakolipatel": "Sexy", "gangofsurgedvoices": "Only if women gave a shit about non human females. We want freedom while oppressing non human females. End speciesism and the world will change. #GoVegan", "ramithchangappa": "@natashanoel001 you have shown the real fustration of all women... Boby is just a boby.... All women have have the same... Never ask again... I love the statement... 😊 Girls shouldn't be looked for lust.. just seeing their big assets... Not all guys are slim and athletic body... Respect every girl and women.. Don't get into lust by looks or body of women...", "koena_22": "thats an inspiration ....tqq", "suvigyasharma01": "👏👏👏👏", "vins786": "Yes but women do not have to remove clothes on camera to prove it. It’s an awkward feeling to see the this. I would feel the same awkwardness if a man does it to prove a point.", "divyakrishnan07": "LOVE YOU NATASHA. ❤️", "batzbey": "🔥🔥🔥🔥🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾", "sree_rule3": "@natashanoel001 more power to you gal 🙌🏼🙌🏼", "ravi01012": "I am really not asking for itt👌👌👌👌👌", "sahil_shivdasani": "Mam maine apko JOSH TALKS pe dhaka tha.. waha se fan hu😊😊", "iamnotju": "Great message!!", "aamir549": "So cute 💋💋💋👌👍", "arathi.sen": "Very powerful ❤️", "_pappachan_": "😇", "drizzy1530": "So what are asking for is the true question 🤔", "avijit.1997c": "Love it❤️", "dushyantxo._": "Bestttt ❤️❤️🔥", "manna27__": "❤️❤️", "sakshi_bajola": "so bold, impactful ...bowing to u man...the way u r inspiring and giving messages... huge respect♥️♥️♥️", "i__apoorv": "Wow ! BOLD ENOUGH! #respect", "warrior_of_light96": "Your thoughts and posts have always been great and really really bold. You and I share the same opinions. Nobody should live in fear but everyone should always be cautious and more importantly thoughtful because no matter how boldly we hate crime we can't deny its existence.", "adhya_shx": "This is powerful and it takes a lot of courage to showcase yourself on this platform but someway or the other this video left me morsed thinking about the situation we are dealing with right now thinking how absolutely shit are upbringing is where a section of the society displays such schoking ignorance towards recognition of the basic rights of the other!", "rsa1852": "Damn... This is powerful", "iamabhijeetrai": "One word : EEEEWWWWWWWW", "ajay_aero": "💞✈✈✈✈✈✈✈✈✈✈✈✈✈yoga Rock's", "sejalldhawan": "@vanshika_1403 🔥", "avishek.bhattacharya.142": "Brilliant Concept Of Awareness, I Respect.", "jindal3364": "Madam😮", "prudhvi_chetty": "i like your confidence. keep your good work and motivate us more @natashanoel001", "solanki_mustafa85": "Amazing", "mr.id.u": "Takes so much to be this bold on social media. More power to you, girl.", "aj_willie_jr": "She’s cute even tho she not asking", "sonali_sharan": "🔥🔥", "__thanos__________________": "Ok sister.", "sunil.mehetre7774": "Wow😘😘😘😘😘", "amitnarayanchaudhary": "🔥🔥🔥🔥", "sashvita_poojary30": "💯💯🔥🔥", "iamarmymen": "🔥", "huffman27lowlow": "Powerful 💯💯💯💯💯💯💯💯", "myscooop": "The poem said by @priyasometimes", "anup_takloo": "That anatomy!!❤️ Damn!", "faded__nash": "I didn't read the whole caption but... I always supports woman's and whatever they do in their life......😍😇💖", "lloohith": "Respect to You", "venky6316": "I'm not asking 🤭", "luvkabir": "Kapde utarna has become the symbol of woman empowerment... Wow", "maggisaana": "Thanks for teaching to be confident with what ever you have its okay to be like how you are... We are nature and nature never covers it's unfavorable things....It's time to chin up dear world women are is getting wise we are behaving as we have to #being raw is nice", "ali_12112_": "This topic is really hard to talk about that's why we need to talk about it more. I saw a documentary by \"the Quint\" on Haryana rape culture where they asked people why rape happens and most of them said because of girls and the phrase \"you need both hands to clap\" it's really disgusting and shameful when people say that . We lack moral and sex education in our country and its still not being address by the media or the law makers of our country only kejriwal is making some efforts to improve the education system but what about the rest of india. We need to eradicate illiteracy and poverty from india one step at a time, helping one person makes a difference. When kids will grow up in a healthy environment of equality and harmony they will make a better future but right now our government is not focus on that as it has other issues to handle. Like economy slowdown and propaganda. When a government only talks about its achievement and not it's flaws it weakens the future growth of the community. Like when the gujrat government spend crores of rupees on build walls to hide the poor rather they could have spend that money from the start to build apartments for the people. Rather building a huge statue build huge buildings which could house millions of people that makes a difference in the life of people. I am sorry I know I said too much on unrelated topics but it's all related healthy childhood result in a healthy adult mostly.", "ms.eats_a_lot": "THIS is mind blowing, @natashanoel001 i just love you and your confidence levels is all i want in life lol and some 🥞. You are like EVERYDAY classic shot of motivation i gulp (along with some vodka ). Thanks for putting yourself and the darker self in front of the lens reminding me that its okay to have a bad day/week.Thank you for showing me that i need not perfect as long as im myself.thanks for existing 🤧❤️🙏", "_shreyash_0": "Message is very clear and powerful!! Ur confidence 💯💯", "aishwaryajagtap97": "Hats off to you Mam @natashanoel001 it is so true👍👆", "monalisha0489": "Wonderful Natasha.hatsoff to you lady❤️❤️❤️❤️", "jiakhushi_mou": "Very powerful msg 🙏❤️", "ashishadarsh": "Ye bkl pagal h ye larki", "0705_shree_": "Well said...😘😘😘", "yo_yo_cute": "Or kuch bcha h 🤣🤣🤣", "manish.meghnathi.52": "Nice figar.....& Hot", "mann.patel._": "@siddhi_maru4", "djboydeep": "You are amazing bro ❤️☮️", "babumunir": "Should have take off the last one aswell, was waiting for it", "debsandipan": "Kinta tantrum hain in ladkiyon ka.....humlog toh men's day pe nange hoke nahi dikhate....aur yeh sab karne se aap log strong hain define kyasa karta hain....kyan bakchodi hai....kaun hain yeh log....kya hain ....bhagawan ne muh ar dimag diya hain to kuch bhi bolo aur kuch bhi dikhao ...", "thefittestvegan": "Great POST💯💯👌", "chanufcplaytowin": "😮", "mostafabakri669": "He may seen a young hot beautiful girl and he couldn't have to do something to her. afterwhile you came across whatever .the rapists saw you as little girl you can't even to defend yourself. And they did so .if didn't cause of that i may be anoyher. If you are covering whol your body who would lot at you with atention of to rape?", "simranshori": "💖💖💖💖👏👏👏👏👏", "1111._.merkaba_": "A HUGE RESPECT FOR THE AESTHETIC SOUL MAAM ALTHO V ARE CONSIDER AM CONSIDERING ITS JUST A BODY BUT THANKS BTW FOR THIS POST OF YOUR BRAVENESS FROM YOUR SOUL RESPECTING ALTHO MUCH LOVE CUZ V R MOST GRATEFUL FOR YOUR SOUL V ALWAYS PROTECT HUMANS AND WOMENS IN ONE POV I ACCEPT I DO LOVE ONLY SOULS AND THOUGHTS NOT BODY...SOUL LOVE IS A KINDA CONNECTION...BUT YOUR BRAVENESS I HONESTLY APPRECIATING♥️♥️♥️", "sumerkochhar": "@d.pain.shutup maybe we found \"are you asking for it\" 2.0 #poojawhatisthisbehaviour", "johnshekar": "Perfect structure. You have beautiful body", "nandini.xx__": "Very great effort 💜 u have done an amazing job 💛lovedd it", "taiyzun": "🏹", "cheffisuresh": "I am impressed", "1andonlysrestha": "Brave 👏❤️😘", "aarushi_laxmi": "❤️❤️❤️❤️❤️❤️❤️", "vgopalphotography": "Cool !", "manu_20111995": "So bold 🔥👏", "debolinadontlikeyou": "❤️❤️❤️❤️", "cheeran_sony": "It took some time for me to get the message. Great one", "guntaj_gill": "@natashamalpanioswal 🙌🙌", "thajna_sm": "Proud ❤️", "kenny15_3_16": "@coronawasabeer she just did", "moondai.x": "You are LOVE❤️", "meenu_smagh_dhillon": "Though the msg is good but men will not even understand 5% of it.. even if taken these 5% as privileged they r gonna 4get it soon somhow..! Thts d irony of our repressed society... lots of work needed 2 b done ( in for initial stages & right grooming of healthy males)", "y0hannp": "Amazing. More power to you", "suji_870": "👌Superb", "sukanyaganga": "It's such a slap to all shits who wer talking abt woman dresses... Proud of u and ur confidence...", "nithyavendans_menist": "Wow it's really good madam, but make sure you are capable to face brutal beasts in our society. Men we have no right to say control your periods as same as women you have no rights to say control my erections . In my view women have more freedom than men. Example.. men we also having sexy chest but we are not showing our cleavage in public places , men we also have sex pack but we are not showing our naval in public, most highlights are if a men penis is visible in public places he is a pervert, but women are showing their camel toe in public places it's not a offense.", "kajolkapadia": "I am so happy to see such videos that inspire me and also gives self confidence ❤️ you are the best and i love u 😘 keep on making such good videos", "yoga_weights_harmony": "@natashanoel001 very strong message. But I wonder if you should do a similar thing on Facebook. This message should be more relevant for Facebook janta. There are many with this attitude on Facebook. Instagram on the other hand has more learned gentry. Thanks .", "rashig232": "Besttt vedio to show slut boys...so that they can get some respect for women 🙌❤️", "trucuban": "@xotichomes_decor", "smita_akhil": "You r amazing..more power to u love😍😍😍", "kick_her_feet_up": "A person walking around with alot of money and jewelry isnt asking to be robbed either but if u go into a high crime neighborhood with jewelry and alot of money and get robbed u shouldn't be totally shocked it happened point is be diligent about ur surroundings and try to do ur best to avoid putting yourself in bad situations", "karwasra.anil": "Not asking for it...", "nevergiveupeverkeeptrying": "🔥🔥🔥🔥beautifully said sweetheart ❤️", "lovesupremme": "❤️❤️❤️", "samarth.taneja": "It takes so much of guts to do this that even guy's can't do this.", "tamaalibarman": "You... And your boldness 💪", "aakhand.singh": "Sheer stupidity", "reetika_shokeen": "You are amazing😍😍😍💛💛💛", "darkcupid95": "No one asks for it. No one. Women need to understand that this is not their fault. I totally think you should post a vid where a man is in jail for rape, but everytime he makes an excuse like ‘she asked for it’ or ‘she made me aroused’, the more solid the bars get and the more chains and restraints get added to him  TL:DR", "take.it.easy.urvashi": "Goosebumps🔥such a phenomenal msg you gave everyone out there literally i mean I just love your confidence ❤️❤️ more power to you natasha 🌈🌞 @natashanoel001", "ghabili02": "My dream wching you in sex movie why not doing", "santosh_kumar5485": "👌👌👌", "_wanderingzen_": "That's a powerful message👏", "ravindran1987": "Non sense", "abhishekcharlieraj": "Desh age badh raha h. 🤣🤣🤣🤣So called feminism 😅", "dbc1992": "People that rape aren't normal. Soooooooo", "gaurav_w17": "You are Awesome 👌🔥❤️😍🤘", "sagarvatapu": "We all born naked. Clothes became more of fashion and less of necessity. Clothes are meant to protect our bodies, not to hide.", "m_manpreetsingh87": "@natashanoel001 That's the Power of Women's.... It's such a big slap to those who thinks to blame rape culture on how a woman dresses... Keep it up. Blessings👼🙏❤", "gillyontherock": "Our life our body", "rumpleblumpkins": "@natashanoel001 I love this! I love you and the messages you post here, it is so needed! 😻🙌", "_.alliswell._": "I am though. At specific times😭", "priyankanayak58": "What a fantastic message to all the people out there who judges girls based on their dress", "swarnabho99": "Respect 🙏💖", "_zaveriiiiii": "PREACH 🙌", "boogey.man._": "I smell a lot of sssssssimps in here.", "eddy__official_": "👏🏿👏🏿👏🏿Tell'em.. Happy womens day!!!", "___v.26": "100% agreed on \"not asking for it\", but lets not forget about decency in wearing any clothing. No matter what, nudity isn't right.", "prajapati_balram_": "तन ढांकने का बोला है जिन्होंने वो होंगे जरूर अपने बाकी आप छोटे करते जाओ कपड़े और जो तारीफ करेंगे वो जरूर होंगे गेर ,जैसे सोचेंगे वैसे ही चीजे सही या ग़लत लगेगी आप चाहे सारी में या बिकिनी में घूमो आपकी मर्जी है बस देखने वाली की नजर बदल जाएगी क्युकी सारी आपने तन को ढांके ने के लिए पहनी और बिकिनी तन दिखाने के लिए तो फिर कोई देखे तो गलत क्यों??", "rubenkara12": "Beautiful 😍😍", "an.any.a": "Guts 🔥 🙌", "pratipatny": "I can dig it up and try finding it for you if you didn't find it yet.. because I posted it in my story so it will be somewhere in my story archives...", "salmahaffira": "👊🏼🖤🖤💪🏼", "urstruely_vishal": "I also not asking for you..😂🔥", "faysal.sadi": "❤️❤️❤️❤️❤️❤️", "b.s.rajshekar": "Great dear...love ur courage and confidence ❤️", "mekoo_2207": "Such an inspiration you are💖", "akash.dayal": "🔥🔥", "himanshu.kr_": "Great lines Ma'am. 🔥 Happy Women's Day.", "sheenuarora84": "💕", "arushimalhotra2004": "Slayyy❤️", "anmolrajpoot": "O my God 😍😍😍😍😘😘🌹", "vishakha.shankar": "Wow.... Just wow..... 😍", "maaye_ri": "Yesss... This is what exactly all men need to hear...👏👏proud of you girl❤️", "vijayakumar.iyappan": "👏", "0ninezero1": "Amazing ❤️", "_sakshii____": "Such a inspiration🔥🔥🔥", "_.m_i_n_i._": "Hi I have been following you for a while now and you are really brave .You are breaking the rules of this hypocrite society and I'm so proud of you .I hope you'll bring changes.I wish more power to you .🙌❤", "bunny_m179": "Powerful💪🔥🔥🔥", "the_flame_age": "Your words one day became legendary 🔥🔥cool macha", "lionel.johns81": "The best women's day massage ❤️❤️❤️", "avinash78631": "What was that and was any reason to post such video not worth it.....🤨🤐", "kavini_15": "It’s a really really powerful message 🔥🔥", "raaajjjjiiiii": "You are the best ❤️", "johnwick.42": "As an anti feminist, i actually agree with you", "blanbizzle": "PERIOD", "deeksha.gathwal": "❤️", "shaheemmohammad": "Remove the last thing and still say not asking for it", "fashionhub4women1": "Omg! I thought you are on video call with someone 😶", "almost_harleyquinn": "dammnnn!", "sabrina.genesis": "👏👏👏👏", "likhi2497": "More power to you Natasha ♥️♥️", "shalini_0029": "👍👍", "s_bala27": "❤️", "deeptanshupathak": "Courage plus dignity ❤️", "blanknoiseactionheroes": "Hi. Please connect #INeverAskForIt", "i_am_crusty": "Its so powerful!😌 PREACH GIRLY!🙌🏻", "__im__ur__threat__": "❤️ love you...@natashanoel001", "tanmaytripathi_2803": "You are such a inspiration ,not for girls even for boys💯💯🔥🔥🔥the way you express everything is just awesome .I have seen a lot of videos today but this one is best ✌️✌️.You really have that spirit which can change the small thinking of most of the society @natashanoel001 more power and love to you girl 💞", "butterchickenwings": "More power to you beautifulll,n lotttss offf love ❤❤❤", "shailendra3922": "Happy woman’s day", "skiesofsummer": "This is beautiful. It's bold, it's powerful. More power to you! ❤️💪🏻", "ramy_mark102": "Lovely😍😍😍 hope there was more", "memon.imran4": "👍❤️🔥", "nithin_agnel": "❤️❤️❤️", "pavanisno1": "You're a really fighter ma'am hat'sof to you", "yogini_payal": "👏👏👏👏", "areeen.x_": "You go girl 😍", "fcukyourvibex": "You're awesome. Thank you for inspiring me ❤️😘", "joss_a_lynnn": "You're just amazing 🙌💕 happy women's day💗", "shriyaaaa_shirke": "SO powerful.. and more power to you girl🔥❤", "vimal_venky_": "🤦🤦🤦🤦🤦 my god I don't know wat is wrong with some woman these days... Your not asking and we are not telling anything.. please god bless this woman with a good health and a good brain. Anyways happy womans day. Real men will always respect woman however the way they are.", "kaattttumiraanntti": "Happy womens day natasha🌹🌹🌹", "seenu.thinkbig": "Keep it up. Ur awsome. Good human being", "jenayeinc": "This is such a powerful video! Thank you for existing", "vijaydesai_143": "😍🔥😍", "amitkundra8": "Your boobs is too hot and your panty is really very in shape exactly shoe", "grizelsiona13": "such a Grt msg on dis Grt day gurl🔥🔥🔥🔥always luv ur perspective n hats off 2 ur courage ♥ u speak out wat others actually wanna say ♥kudos to uh♥ n hppy womens day to uh took♥", "mehlani_love": "Qween 🙌❤️", "dearest.drea": "🧡", "chitsbb": "@blanknoiseactionheroes", "puppy_renu": "Is this some kind of porn?", "athleterashmika": "💪💪💓", "kashyap7rohan": "Superb ma'am👌", "namrata_107": "So strong and powerful ❤️", "djkinz": "Brave soulful hearted n a lovely soul you are", "9bad_ass": "The video seems inspired by BICHITRA BINDHANI :)", "anuragbisoyi": "Beautiful massage🙏.... HAPPY WOMEN'S DAY", "shafeeq_vpz": "Never", "hemiroy": "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "avin.ego": "Have any women asked themselves that maybe we guys are not thinking to give it to you, as well..!?", "gramdasnaik143": "🙌 ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "bikersbrew": "Why 🙏", "yes_haha94": "You're perfect 😍", "jayanta7402": "Nice devi....🙏 thanks for break our sick mentality. Carry on buddy.", "jigarsharma4762.js": "💋💋💋💋💋🔥🔥🔥🔥🔥", "molten_beauty": "Brilliant💋💋💋", "kartik._.gohil": "Very proud of women and today is women day", "kaura__saab": "NYC ji 😘😘", "aftab787376": "Mam hath hatah do👍👍", "helenmathew2123": "I love uu so much 💖💖💖💖💖💖💖💖💖 awesome video💖💖", "rashmi.__.sharma": "This is too good🙌 thanks", "_shreya_yadav__": "Hats off to you and your confidence. Loved it😍🔥", "yogagirlvibes": "Proud of you. ❤️🔥😍", "weloveuttarakhand": "Show end", "raghava_86": "👌👌👌👌👌👌❤️ 🙏🙏🙏🙏", "worldlingblog": "This is beautiful...", "sampetiwala": "Happy women's day 💕", "pinkflower_22": "Damnnn🔥🔥🔥🔥 you beauty 😍💓 and that bikini👙... Happy woman's day beautiful", "syedamaanakhtar": "hats off to your courage🙏... and also to give such a beautiful message... love, support and respect😊", "annikapanikker": "Was this the video you needed to finish before sleeping?😍😍😍", "notty_and_hot_boy": "Come on boys🍌🍌🍌🍌🍌💧.... Really mind-blowing wat a sexy hot ass and bikini line😋😋😋", "knicks_qe": "Powerful video !", "raj_indra_": "Confidence 🥰", "s_a_emraan": "Drama queen.....🔥🔥", "chaifortheday2": "So much respect ✊ Happy women’s day❤️", "coach_racheal": "Yes girl😍😍😍 powerful🔥 women's voices all around the world just screaming I'M NOT ASKING FOR IT! Men don't realize how often we're sexually molested/raped with their eyes words and touch! Just because we're attractive doesn't mean we want it! Keep voicing and sharing these powerful videos so many silent women we have to be strong for 💕 theri haven't found their voice yet💕", "go_cool.ba_20_kar": "👍👏👏👏", "vanitatharaney": "Way to go girl 👌", "asparagus_honesty": "and now I'm confused", "dumbbells_n_chopsticks": "U r the best 😍😍the way u put things up 👌 👌 ♥️♥️", "shivanisarrafgupta": "Oh my god... You steal my heart with your words 💕", "yogawithruby": "Loved the message. Very strong. Very clear. Happy women's day @natashanoel001 love you 😘", "mayakrishnamurthy05": "I can jus say , love you ur grt keep rocking 🙌", "black_mystery_11": "Omg!!! Wow tht was really inspiring....this makes me love myself and my body...I feel confident now...this is wat I needed 2day after having a bad day🙌", "looking_through_my_eyes": "courage mmm dats Natasha", "drnkphlsphr": "Could not have said it better. Consent is an important thing and I guess more men need to be educated in asking for it than assuming a right. Kudos. Keep doing what you are doing 🙇‍♂️", "cosmeticsatbest": "@feminist", "ferozkhan5001": "Fantastic 😍😍😍😍😍😍😍👍👍👍", "pt227538": "Pagal hai yar tu to 🙈", "swapnil_220": "Hello mam you are inspiration to many girls out there more power to you happy women's day 🙂", "_spartan_rohan": "🙌🙌", "anupammayank": "Why u have left panty ?? Plz remove it in next video", "ekanshagarwal21": "No one has ever explained it in a better version than this 🙌🙌", "itsbazinga_": "More power to you❤️ I follow you on YouTube and Instagram as well.. in this world of hypocrites, it's refreshing to see someone so honest and energetic. Happy women's day.. you are an icon ☺️", "__choco.cookie__": "seriously such a inspiration💞", "anoushkasingh123": "This is so powerful 💕", "philofthecity": "@natashanoel001 CAN YOU SHOW ME HOW YOU WOULD ASK FOR IT?", "sanchitanyk75": "Love this soo much madam ..very proud of you..💓🔐", "sourav.sps": "Dress not important maim ...its human humanity", "sreevallitata": "Happy women's day to the most amazing soul💙", "husmanwatnal86": "Honey boobs", "navelcentre": "Salute🙏👏", "amanpawar24": "Bravo", "arunkapoor24": "Fabulous... Gratitude to you @natashanoel001", "yakland": "👍👍 😘😘", "mmunishwar": "🔥🔥🔥🔥", "flixwavoo": "Nailed it happy women's day👍u r an inspiration for all of us👍", "rebekahmartyres6_9": "🙌 this is what ppl need to really understand", "mansiiig": "🔥🔥🔥🔥🔥", "shubh_loving88": "Amazing performance @natashanoel001 ye video un logo ke muh per Tamacha hai jo ye sochte hai ki ladkiyo ko poora kapde pehnegi to unka raoe nai hoga.... Actually ladkiyo ko bhi full freedom milna chahiye n wo jaise chahe wo pehne... n live as they want", "abhinavverma51": "Pheww", "puja_pictures": "Keep rocking....more power to you and all of us....thanks a lot 💕", "desidoll_93": "This message was powerful and well needed. Many people, men & women need to start understanding boundaries begin with their thoughts.", "pearlparekh": "💘💘💘💘💘", "stutimisra24": "Powerful,much love", "shob07": "You are bold woman Natasha 🔥", "sanaskotian": "❤️❤️", "deirdresingh": "Your message 👌abs 🙌🏽🙌🏽🙌🏽you💕", "kedarnath_narahari": "I want to reduce my weight can you give tips", "mr_igniter": "🙌", "somsuryananda": "250 Comments, 32K views and 248K subscribers. I hope u get the point here everyone. Not everyone is feeling this post rather enjoying it. 🤔", "shikhakhatar": "Thank you ❤️", "bajwas0155": "हम महिला है और नंगे होके सडक पे घुमे जब भी किसी को बोलने की जरुरत नही है 🤮 घूमो", "sonal_dolas": "You are a true super woman 😍😊👍", "monicaaswani": "So powerful 🙌🙌🙌...i pray every girl and woman has confidence as urs", "colourme_ashy": "That's me everyday preparing to go out during winter time!! ❄️❄️❄️ ❄️ 🇨🇦", "_areeshna_143_": "Happieee women's day to my dear powerful lady 🔥🔥🔥🔥🔥🔥", "komal_garg_kishu": "Hats off to you #greatmsg #godblessyou😇😇", "mans_trainer": "Guts kk", "srishtisingh.s": "Oh Natasha 😭 ♥️♥️😘😘😘 Love you woman!", "deepika_bhoir_04": "So powerful ♥️", "jaya.tyagi._": "More courage to u girl❤️ u r all courage and awesomeness", "minion1002": "Ma’am I respected you but Don’t Blam that Every Men are same", "mottogori1699": "I LOVE YOU SOOO MUCH 😭😭😭😭💞💞💞💞💞😭😭😭😭😭💞💞💞💞💞💞💞", "wanderer_anooj": "This is 💯 %packaaa exhibitionism. Better consult a doc and get well soon 🤟🏽", "abin_call_me_abi": "🔥🔥🔥", "nitinrshet": "Happy Woman's day. Nice lesson to rapist", "rahoulbhasiin": "Beautiful", "yatri.hippy_itey": "Crrrryyyyinggggg", "maryam_khalidm": "And why do you need to show your body and be naked, its like you need a reason to be naked and seek attention!!🙄🙄🙄", "uzma__khan_": "Really strong one❤", "rohitt770": "Read your story you are really inspiring🙌", "poopoopoooy": "Ur inspiration confident girl ,❤️ bravo proud of you 😘", "the_flavourful_life": "This is exactly what people and our society should understand, rather than pushing us behind veils. Your posts are amazing ma'am. So powerful ❤️. Happy Women's Day 😊", "shashwat": "🙏", "wanderingmind_rubo": "🙌", "tulsi_abhishek": "😍😍😍❤️❤️❤️ You’re an inspiration", "shubhamsinghx": "The poem and the content is more than perfect for this beautiful day💯🌠", "amishijumrani": "You are amazing!", "neeraj.bakshi5": "🔥..", "jiju_born2play": "🙏🏼the fact 👏", "nicegabru": "beautiful. respect you. god bless you 💐😊@natashanoel001", "thefitgirlwithstretchmarks": "This is a wonderful and honest narration that can help save so many women. Unfortunately, this is still an alien concept and people won't take kindly to it. Keep slaying anyway💓", "rythm_leena_sanjay": "Wonderful message I love the bold steps that woman like you use to aware the other women ... To se and love them self . What ever shape size you are just love yourself and be you don't care about the people society and any one else", "fictionaddiction03": "Lots of love and respect, fellow Josh Talks speaker ❤️", "_._mishu_.__": "That's an amazing message! More powerful to u girl, keep inspiring❤️❤️", "passionately_yogi": "You are just lit , I love you so much😍❤️💚💋", "lubanshi": "You are sooo inspiring, thank you for being yourself and happy women's day to you ❤️❤️", "ayush_tatooz": "Your such a wannabe,no doubt 😆", "yarlagadda_bindu": "You’re so so so so much inspirational to all the women out there. So much love to you 😭😭😭♥️♥️♥️♥️ Happy WOMENS Day 🥳 @natashanoel001 ♥️", "rpunamia": "❤️❤️❤️😘😘 proud of you woman!", "md_farman_04": "Powerfull❤️", "happymoonlady": "❤️❤️❤️", "sunjeev_sharma": "U r too much bold 👍🔥❤️", "pejman.jokar63": "your the best ❤️❤️❤️", "rashmi_fitness": "I suggest ,you plz keep sharing such articles more frequently so that some or the other day men will realize that its our body n we have right to dress the way we want.n even few females who keep judging each other will leran some lesson.", "miss_singhjaatni": "Thank u dear 👏🏻", "nature_awakening": "So proud of you for doing this 👍🙌", "ziigystardurst": "Dem titties doe 🔥🔥", "yogi_bhagavati": "🙌🏽💛🙏🏼🙌🏽👏🏼👏🏼👏🏼👏🏼", "raj9700a": "So bad thing", "jacobburns20": "Omg yes plz 👅👅👅👅", "gamyaaaa": "❤️❤️❤️", "_soniyapatil_s_princes_": "Ur fier suppr woman &perfectly good ur I.like ur inspired many ladies out hear good or bad ur not asking for it 🔥🔥🔥❤️❤️❤️🤗🤗👌👌👌🌹", "sameer.kaz": "Stripping is asking for it. So shut up", "__swati_tiwari_": "The world is asking for people like you miss🙌💯...you inspire thousands of females...thank you for your very existence ❤️", "swati_sridhar": "You are such an inspiration!!! ❤️ more power to you!", "38bigmal": "I love this woman!!!!!!!!!!😘😘😘😘😘😘😘😘😘😘😘", "sankary_richare": "You nailed the way you always does❤️... so powerful🔥 @natashanoel001", "sowmya9230": "❤️❤️❤️❤️❤️❤️❤️", "nathshaonli": "That body tho.", "king_of_borana__style_boys": "😂😂😂😂", "rkris24": "Bold", "piyushapatil1997": "This is amazingly awesome 😍 😍 You are just mind blowing 👍🏻", "_chitz_cpc_": "You are an inspiration ✨ WE LOVE YOU ♥", "arzeroeight": "👍", "vemurirenin": "👏🏻", "hemanrm": "Legendary NAT NO. rule book 101 she is never asking for unless she asks for it.", "gulistankikhoj": "#indianwomenresist", "hrishahaha": "More power to you ma'am. You are incredible.💓", "rohit_basava": "I'm not asking for I'm asking respect to every women and human with good vibes good culture and good environment you gave the most powerful message 👏❤️👏 wish you happy women's day @natashanoel001", "ms.charusingh": "Abs!!🔥", "_me_sophiaangeline_": "Deep🙏", "vikashchoudhary4525": "You are looking so beautiful", "ganesan6386": "So super removed the panty", "prachi__kukreja": "❤️", "crazyycupcake_": "the best post i’ve seen so far💕", "sanjayvashani": "happy women’s day", "sandy_evening": "Such a bold and beautiful 🔥", "yogabydiksha": "So glad to see more support here in the comments than trolling. Sigh! ❤️", "entertainment_03": "🙈🙈", "thenameiskgr": "Exactly!", "malaika_asif_x": "Your so inspiring ❤️", "divyaniyoga": "Such a powerful and true message. Beautifully done. Love. ♥️", "triciagovindasamy": "@natashanoel001 thank you for being an amazing ambassador and role model to all ladies out there! ❤️❤️❤️❤️", "__escapewithmee.__": "This is what exactly all men need to hear. I literally love the confident you go girll more power to you 💜💜💜💜 n on second note you come so far as you was talking about six years ago.... Yoga happend n your body transformation is inspiration to many 👏👏👏🔥🔥🔥🔥", "ww.w.sureshkumar940": "Wow really good pik very nice 👌👍", "aakanksha19yadav": "❤", "suncheetah_": "🖤", "reema_mathias": "🔥🔥🔥 So so very touching ... I m so motivated and touched by you that I dun let the negativity comes around me ever I say NEVER to the negativity.... It is very easy for people to speak negative things .. but what is important to get oneself charged is how positively u take it up and I have learnt it from u @natashanoel001 thanks and kudos ❤️❤️❤️ I wonder ur posts create so much of an impact when I meet u in person I will for sure be a changed person 👍🏻👍🏻👍🏻 look forward for a meet and greet 🥰💋😌", "inc0gnito00": "Best❤️ i love you ❤️", "iam_anglin": "💯", "winnie_vne": "@natashanoel001 2. Are short dresses responsible for sexual violence.", "acatharticjourney": "Strong message. #yougogirl.", "rashikapur": "Thanks to you", "kathak_palak": "beautiful ❤️", "shradddhha": "I love you💋", "yogeshadmane": "🔥🔥🔥🔥🔥🔥", "monika_azad_": "You are amazing 🥰💕🙏😘", "5upr1ya": "You are awesome ...my inspiration", "krishhh496": "Way to go gal...bravooo....u voiced many things with this video👍👍👍🤘🤘", "ibhatia8": "Wow! You’re a kickass woman! Continue to be one and inspire so many others! ❤️", "akay_wise": "🙁", "chanderchanda5751": "Just an inspiration uh are❤️", "_jugaadukalakaar_": "One word for you Dear..RESPECT 🙏🙌 #endrapeculture", "ss_goodwin": "Happy Women's Day", "jiteshravariya": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "___shivali__": "Love u❤️", "sunil_sisodiyaofficial45": "You are strong🔥🔥🔥", "dilipkumardash": "You are awesome natasha", "prekshajain_": "❤️", "jankiejkthakar": "Awesome video!!!!!", "unemployedmba": "So powerful 💜💜 and such a slap to everyone’s face who thinks that it’s okay to blame rape culture on how a woman dresses 🙌 full power to you 😃", "arti_manmadkar": "This confidence Natasha..... hatsoff girl🙌", "prabhav__s": "Made me cry so trueee🥺🥺🥺", "kompalmohindra": "Impactful❤️", "bear5beet5battle5targalactica": "Like Vir Das said a woman can just ask for it.", "kadhal_thozhan": "Inspiration ❤️", "manyajain._": "🙌🏻❤️", "geeta_patra": "More power to you🔥❤️", "kimberlyshah": "Fabulous and beautifully said. I have seen what you are talking about and can’t think of who did it.", "gowrineelavar": "YOU ARE AWESOME!!! 💛", "dagonislord": "Powerful", "heenaagupta": "Very true @natashanoel001. More power to all the women out there.", "shankar.thalari": "W❤️W 💘💘💘💘💘💘💘💘💘💘💘💘💘💘💘💘💘💘💘💘💘💘💘 n❤️ w💘rds m💘m poora open karo pl🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾", "saraswathysridhara": "Ufff here's me wanting your body and your confidence! 😍", "doodlerwholifts": "Loved this ♥️ you have shed so much, abs looking 🙌 consistency", "arunkumarkathirvel": "Braveeeeee 👍👍👍👍👍👍", "ttishaa_22": "Love thiss so fucking muchh❤❤🌟 You goo girl🦋❤ @natashanoel001 made my day much better🌹♥️♥️", "azuka_yoga": "✊✊✊✊✊✊✊✊", "suzaneljoker": "❤️❤️❤️❤️❤️love you 🙏🙏🙏", "lornasimpson": "✨🙌🏿🖤💫✨", "xaryanpuri": "GooD", "amateur_escritor": "I felt this in my heart ❤️❤️❤️❤️😭😭😭😭 Thank you for doing this! Loads of love and happy women's day ❤️", "bhaktiravalyoga": "@natashanoel001 .. Bang on 🔨 💪 💪 💪", "iamrenuka__": "Damn ... wonderful Natasha ♥️ What a phenomenal message to your audience,You have done an extensive job girl... #happywomensday love,more power to you .", "smaraki_swagatika": "I didn't like you at first. But day by day you are becoming my darling. Motivating and inspiring 😘😘", "glorious_luna": "But still that body gorrlllllll 🔥🔥🔥🔥 stunnnnningggg", "misfitslave138": "I like this video", "latika_yoga": "Loved the message,so powerful 👍👍", "im.entropy": "Joey when someone steals his underwear", "a_nush_a": "U r a trail blazer 😍🙏", "ankz2708": "@kalpita_19", "mokkshhika_lallwani": "Omg🔥", "scottcameron2161": "Wow...", "bindu_anju": "Oh god natasha❤️ its amazing😘", "heera_azemperor": "I'm not expecting Any further 👏", "the.prashita": "Yo go girllll 🔥🔥 Perfect", "agnes_cairoyoga": "i love you post and always saying things as they are❤️", "defy_the_gravity": "Inspiration pure inspiration for me🔥🔥 love you babe 😘💋", "puchuru_vibes": "So bold! Salute 😊", "skyecardoz": "This is so powerful! 💖💖💖💖", "miss_maru_": "This is beautiful!! Thank you for sharing!! #NOTASKINGFORIT #EmpoweredWomanEmpoweringWomen #InternationalWomansDay2020", "misha1993": "@lanaalbijawi", "the_mephobia": "I know you r not asking for this ---> 🙌🏻👏🙌..", "sheemabaharan": "💯💯💯💯💯💯💯💯💯💯 Bravo I’m very proud of women’s like you ... you are the voice of lots of Females that are suffering from judgements and bullying of some men and women", "subhashini_palanichamy": "Brave and powerful🔥 happy women's day😍", "dolvinsekhar": "Nice", "ameen_karma": "@natashanoel001 More Power To You Lady ❤️", "prawnjali": "Yaaaasss queen💕 happy women's day❤️ always so inspiring! Miss you xx", "thisisdharana": "💕👏🏼", "saumitra2987": "Excellent. Very powerful and agree wholeheartedly.", "thilah_arumugam": "Power🔥", "_moodymoon__": "@the_glowing_phoenix", "__alphakennybody_": "😍😍😍😍", "sheetalbanchhor": "The depth in your words❤️💓", "senti_______lubana": "😛😛😛", "mano_nevergive_up": "Keep motivating 😍😍🔥👌 and happy women’s day @natashanoel001", "clueless_susan": "The only question I've got is. Wasn't it hot with all the layers? Plus kudos on the message!!!♥️", "akumar78000": "Post some more hot shots", "raticusmusic": "💪💪", "daisychains._": "❤️❤️❤️❤️❤️ More power to women like you!", "_stylish_tamil_ajith": "@natashanoel001 iam now masturbate now💋💋🙈🙈✊🏻✊🏻💦💦💦💦💦💦💦💦wowwww sexyyy😲😲😲😲😲😲", "butterfingers_i": "Powerful💞🔥", "jainaayushi03": "Goosebumps ❤️❤️ Inspiration 🙏🤗", "manash.kalita.007": "You are so Beautiful and Brave 😊", "ccaroline.leonn": "Very much inspired😍", "seventhserieswithposerina": "Nuttooooo!🙌🏼🙌🏼", "mamtasofat": "♥️👏🏼 Thank you for sharing this @natashanoel001 ♥️", "aaditi__15": "Sending more love to you diii.... Happy women's day 🤗❤️😘", "amit_68kumar": "🙏🏻🙏🏻🙏🏻", "supes_rises": "Powerful🔥", "beautybykomal_": "10000000%🙌🏽❤️ love this so so much! You go girllllll💋🔥❤️", "the_brian_noronha": "Every guy should see this. Inspiring🙌", "gourii.__": "❤️", "p_s_r_reddy": "🙏 hord yaar", "26palakverma": "💞💞h~ppy women's day💓💕 \"inspiration\"💫", "maria.icp": "You're the best🤘", "supikol": "Faaadoooo fundooo💖💖❤️❤️🔥🔥... Aag hi aag baby... More power to u !", "bluee_piee": "I hate u, i love u.. still m nt asking for it! Thanks for the perfect msge. Power to u love and all women💕", "its_imadd": "That's what we call inspiration..❤️ love you mam keep inspiring we all are with you @natashanoel001 love you 🌏", "dramaticck": "Every word said oh so true !!♥️ love you 😘", "x_bbg._.susruta_x": "You're just so amazing. You really inspire me Didi. I love you ❤️", "rachnarshelar": "Stop being so Hot :))", "vinitha2112": "The Perfect Womens Day Message❤️❤ #Notaskingforit", "14bhoomi": "Amazing content. 👌🏻❤", "silent_em0tion": "Wat lines man! Such beautifully you made it... Happy happy Women's day!!! More power to you dude!!!!!😘😘😘😘😘", "_princesai005": "😘😘😘I wish the keyboard had enough letters to define you."}