{"diamondmonu": "😇its very heartbreaking to read this u r raped 🙏 God bless you", "rikuk73": "Absolutely what you just wrote here just blunt truth and blew my mind..hats off to you I came across your profile bcoz one of your talks on Josh talks..", "avirajkumarbiswas": "Baby love u", "mohitjangra25": "Sexy @natashanoel001", "subhash_mandavi_750": "Aag Laga Di Seene Me Jaan E Man 😍 🔥", "kishorerusthum": "👏👏👏", "ra.venkata": "Beautiful", "jaydeepsinh_111": "Nice masals", "nishant199131": "hats off to you", "tom_betancourt": "Beautiful", "jogi1415": "Oh oh oh oh so hott😍", "asim6626": "Nice boobs bra", "z.a.allahuakbar": "💕💕💕", "peterjungphotography": "A terrible situation at 7 years. Currently, it's not only your boobs that are lovely. It is the rest of your body that is pleasing to watch. Keep up the routine and you will look hot for a long time.", "yhvshgvsh": "👌", "bigsingh90": "🔥😘😍 very sexy bukini and body !!!!! And I really like ur nice boobs", "_saivaibhav24_": "U should be the example for other girls and ladies who gets raped and dies out of shame and discouragement . Plz try to get courage and the power of women in them", "san.benz": "Finally a good bikini!", "mahipatsinhzala": "Hot", "hudda.4169": "i was wrong but had this idea about you it made me cry", "tan_is_shq007": "Hottie❤️", "edenilson.silva.718689": "👏😘", "harpreet.maan.5817": "Very Hot", "a_boy_named_lsd": "thicc fap fap", "arshadsiddiqui2198": "You are a real girl....who faced lot's bad. Bt, still living lyf lyk everybody should live. Alwz b urslf as U are. You are an inspiration.", "ananthhhhh": "So before u used to cover it all and now u show it all?", "_khanrehan4786": "Amazing caption mam...u r such inspiration for all..", "ranees_umar": "Nice", "ishannnn": "@sablri", "rajansha2418": "Brave girl", "ori0ns": "@saieshashetty_ she writes everything well.", "ankan_malakar": "Lovely lovely", "s_i_n_j_u_067": "Hot", "ganesh_shooter": "@natashanoel001 no worries no problems you are just a gods gift to this world mam I am martial artist but I am interested in learning yoga due to your great stretching and core fitness levels thanks you have a great solid lovely body God bless you mam", "aleemjaved001": "Here comes", "bhargavi_healer": "I am with you @natashanoel001", "ratan_maan": "Wow Too sexy", "sandeep_the_realone": "u r completely down to earth....respectfully love!", "roshiniinus": "Stop sexualising breasts ?? Then y don’t u take it off that bra as well.", "sammy24042018": "Damn your big ass...your boob's are very big...", "abes1908": "To be comfortable and proud of yourself and your body is the biggest gift you can ask for. Full power to you. Nurture it. Own it. Work it. Use it. Rage on!!", "prmsh_swnt": "Inspiring!!!", "kichufrkut": "Super", "matchpointerz": "respect", "johnichayan": "Caption was much beautiful than the picture.", "sammysamuel143": "Hot bikini", "the_chubbby_little_thing": "I love what u wrote. I have been a victim of the same. Love to keep in touch. I have the same figure as u but now I have gained a lot of wait and I dunno what to do.please help me", "vinod333777": "So sexy", "insta_saurav": "So true. Thanxs for inspiring other women..", "a_bohemian_lonewolf": "More power to you girl! Lots of people they don't really work on the issues which is deep rooted in them,you really worked hard to reach where you are now.Once you let go of insecurities bugging you,life will take a beautiful turn.Cheers!", "d_e_e_p___gill": "Omg awesome super sexy", "hungryperception": "Respect this so much ! You've been a true inspiration", "raul_rahul_17": "There is no word to say about u r beauty.", "pallavnadiadwala": "Gorgeous", "_viishal_": "Awesome", "guri_sidhu21": "Sexi", "french_language_addicted": "Dear Natasha, all these words resonate in me, and every line of your post pierce through me. I fell your pain and fell your fulfillment of being proud you. Hugs to you my lovely sis. Questioning the real value of reality.", "jayeshgurav28": "Beutifull", "samiee__cool": "omg", "curryoncooking.ch": "Hugs... love your honesty and curves. 💪", "prashdeshpande": "What a body . . Natashaa . . 😍😘💓", "sawantswapnil894": "😘😘😘😘💋💋💋💋😍😍😍😍😍👌🏻👌🏻👌🏻👌🏻", "surendrabahadure": "😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘", "hemantsinghdavroyals": "Looking so hot and sexy", "asimkhan6688": "Nice tits...", "vikramdharmaa": "Kalakkal", "ar.shabaaz": "Getlost i dont need explaination i know and dont say asshole as u need then get it who r giving u and do u work its none of ur bussiness", "chetanzx": "So hott amazing looks", "akhil_srd1": "✊👈🍼", "neharamneekkapoor": "Just came across your profile. You’re awesome.", "fitness_model_pankaj_thakur": "Great thinking", "aurkobhaumik": "🙏🙏🙏🙏 nothing but luv n respect for u..", "bhartinarang": "@fca.punjabibhushan read caption", "anzar_799": "Are u sexy", "dolas_prashant": "Superb", "mandarkhole": "Love to take some one like yu to candle night dinner yu are super sexy", "tabbytabster": "Thank you for this! The world needs more of @natashanoel001", "mandeepacharya669": "Cut", "rodzkuo": "So sexy maam :)", "saurabhkapahi2277": "Well said", "sh_earthy": "@natashanoel001 ..I admire you ..At some point of my life i went thru such thoughts ..And whatever u tell in insta stories n now in this post , these things resemble with me ... Love love ❤❤...U are my sis 😘😘", "iampraveenpurena": "❤️❤️👙👙👌🏻👌🏻💪🏻💪🏻", "anu.shukla25": "@natashanoel001 You inspire us all. I believe that one's deeds show on one's face. So, if you wanna look good, do good. And you look awesome... It's all because you do good by being a role model to all of us and instigating the will to be fit and flexible. God bless... 😊🤗", "crazyrana143": "wow so beautiful and sexy Natasha", "yoga_khushali": "Very pretty!", "jolith.photography.old": "Amazing post...@natashanoel001", "kritishastry": "Hey Natasha, I’m new to your page and just came across this post. I totallyyy understand the journey you must have had and im so fucking proud of you to be where you are today. I’m sure there must be many things that are in the dark which you don’t put out on socials but You’ve stood tall and picked yourself up no matter what. And that’s strong! ❤️ Lots of love to you!", "sonuprajapati17": "You are a perfect", "sagarr4656": "Beautiful structure 😳😇😍", "patil_sach.in": "@agnimahi I think you relate to this 😉🤗", "yogigagandeep": "Waiooo...", "har_xxv": "Mam u dont get upset by these kinds of comments .. i support u as well as respect u ,, these kinds of guys should remember before commenting on any women that they are here because of one.!", "tushan_rahman": "come in massage@", "itsmeshravan": "@sandeep.meda", "power_parth": "Nyc", "naushadkhan.n": "Amazing", "venkatesh_kesav": "☺️✌️👍", "__gauri_71": "@amrita731", "reshakshay": "very apt psycholigical thought you created in my mind..Thanks", "vjsingh143": "Looking sooo sexy", "rahulaxerey": "Please mam come in Ambegoan at my Gym for Motivation of my students.", "nitharwalprakash": "Remove the best", "_blackmamba97_": "So beautifully written. You are perfect❤👌", "sanjeeth_sd": "@ajil_boss read this", "viral_b": "I salute you for what you r 😁", "mitwwe": "Dam sexy", "mr_sirc": "Nice", "praveenraju620": "Ooo woow superb", "fatfaceness": "@devdattt please read hun!", "ritesh.dhar": "Gorgeous 💕", "kgkirankumar": "Wow", "munishdograofficial": "@natashanoel001 you need a platform to change the sexual thinking of all mens", "gargarpit91": "And they say that there are only boobs on the first half part of the body of a girl to look at !!!! Bow down for those six packs @natashanoel001 u are a big inspiration !!!!", "prajakta.talathi": "Well said and quite courageous of you. Take care and God bless.. :)", "sarveshiiisarah": "@sonya_khorshidi", "a_for_antisha": "@natashanoel001 you inspire me 🙏", "bharath_manunited": "That's a bold choice ... Very less people dare to live free....", "pushparajvino": "Bold best women. 😃I appreciate u and u r such a good ones.one day ur dream will fulfill", "manigill1000": "U r cute..nd bold at the same time!!!I dont know how ..its!!!but u’r..🙈☺️😘love n respect😘👏🏻", "hrishi__kesh_": "Never give up⚡💪", "naveed.lambe": "Just tell me some yoga tips to reduce my belly fat 🙂😚", "pic_man09": "Fabulous figure", "sharma__pranav_": "Amazing confidence determination btw ur smile is awesomely pretty..❤️❤️@natashanoel001", "mohitkumar251099": "Hot ji", "prasanna.m87": "Wow sexy 😘", "aks_the_king_of_love": "Lovely pink", "vickymandauthi": "Attractive", "ecneret_odnanref": "Girl ur an inspiration.... i was like am i the only person who thinks dat it doesnt matter how you look but it actually depends upon your mindset and your confidence over your body...i was following you for couple of months(on insta) but this post just hit me hard and it is truly inspiring..thanks for it😊👍", "hitesh_6211": "So beautiful pic and good parsnlti", "devendra_suryavanshi": "Wow, hot & sexy👙😘", "philloraamit": "Well what I can understand and believe is you have an amazing talent and you are blessed with flexibility. You do lot of hard work and you deserved every bit of sweat you drop for training people. God bless you n wish you all prosperity in your lyf😊", "iamdineshhh": "So sexy nice figure umhhhh", "sinhaarijeet": "Hottie @natashanoel001 😍", "sandeep.malap": "Respect", "rajushaktigupta": "I inspire with you..... And ur body language", "rehmansaba": "@arpitade", "raghurdeep": "Woooooooooooow so NC looking", "arnav4466": "awosm", "marcus_instag": "Damn...those thigh muscles.. jealous", "mi_nandita": "U are sooo dam mindblowinggg", "_skyladsilva_": "I really really wish more women could have the confidence like you. So the world would know, that women are not just their bodies.", "ayaskanta25": "Awesome", "blackstar_sharma": "Beautiful ☺", "phillp_williams": "Absolute beauty", "fashion_fitness_overloaded": "Adorable & beautiful", "lady_killer76": "Hotty", "albertyzacharia": "You are a brave & courageous person, May God bless & heal your past completely", "shikhadalal05": "You're a beauty and all of us are🤘", "abhishek509009": "Nice figure", "moumi_sinha": "Even I feel the same 😑😑😑😑 what should I do?!", "tanzeem_0fficial": "Uffff ye figure", "dnyaneshwar_khaladkar": "So sexy figure", "kritika.mindswithoutfear": "It's good that you have started loving your body otherwise I would have called you stupid. Apologies. I have been working hard to get that body. I already love my body, no doubt but I would like to make it better. :)", "samaddarpritish": "Dear Natasha, I really respect each and every word you have written. I can see the pain behind .. but yes you did the right thing.. don't give a damn about sick minded people. It's your body...it's your breasts... God gifted you those...so take pride of that. Not many women are gifted with that. That makes you more beautiful... Pure... Heavenly... Complete. So don't give a damn importance to those idiot people. You are beautiful and gorgeous. How can someone tag someone ridiculously due to their physical features!!! 7 years...not even body is developed...rape...my god...curse these people...you are strong lady ...hats off ...respect ... I love your posts... Keep shining dear ... god bless", "narinder8201": "Oops.....", "indian566": "Beautiful sexy", "jeet_23rd": "So much gorgeous my sweetheart and sexy.", "heldinea": "Yes. 💝👏🏽", "hippiebyheartnimi": "So much power to you...respect!!!", "munishsharma278": "i am down to hear the words you use for your precious body parts ,,i am sad and depressed to know your past,,,but feel lucky to be fan of such a open minded and brave girl,,", "akraam_bhuiyan": "Sexy", "senkrishnan_k12": "When I look at you beauty save the world", "tarts132": "Just take Bigger Strides as you walk through The Adventures of Tomorrow ☺️", "100tusharanand": "😊 I.....respect your words always...!", "jaintarunn": "@hemani09", "faizchoudhary5357": "nicse bt why u take your toung in your teeth .lol that so cute byethe way ..gorguse dont have wrods to express u my dear .# love", "raj_8309": "I love u so much because u r a open hearted person.", "kyleswageshwar": "@cassianmjohn 💗", "hemani09": "@jaintarunn So nice", "herculesthesecond": "@xoankieexo", "patelerumesh": "Nice click", "shubhvox": "Hey... I dint find any problem with ur.. Body.... Its precious its really beautiful... Yaa it is.... Stop worrying....... About anything....yoga is a sadhna... Which make u goddess..... N u r a goddess.....do what ever u like to do..... But in limits.... Coz over limits also.. harm ourselve", "1994nilesh_gupta": "Lovly and inspiring body and your boobs", "pulkitrapguru": ".", "engineer_2016_p": "You are body is amazing and beautiful. Most of the times when people say something harsh to you about your appearance or your body its because they envy you , or maybe behaviour or your clothes are not compatible with their life-style or the way they think. But we dont need to live their thoughts or hurt our self because of their sick thoughts. By the way you have nice boobs😍😈❤🔥take care of them", "marmalade_bakes": "❤️❤️❤️❤️", "thatguyfromsydney": "i completely agree with every word you've said! i am glad that someone is passing such a message to everyone! I've been following you for about 3 months now and I've never agreed to something this much!👍", "singhutsah": "Nothing to say.. You know everything... Post is just awesome and so inspiring for girls who were thinking like you before.", "seventhserieswithposerina": "Nuttttooooooo my dear girlfriend... YOU are a MASTERPIECE! And don’t let anyone tell you otherwise! 😘", "ameytripathii": "@sakshi2624", "malameerad": "I feel your pain too. I’ve always hated my boobs since age 10 I’ve been wearing bra just to keep it down. Then after having my 3 children they got bigger. At work men would automatically focus their eyes on my breasts. I hated them every day both breasts and men for doing that. When I was 40 my husband gave me the gift of breast reduction done in USA. I was so happy. Now 10 years after, they are not back to triple D cup but just one D cup size. I am once again hating them but come to the realization that I’m getting on with age and I may as well embrace them and love them instead of hating my body and whining all the time. That said, I feel your pain. ❤️", "billycalderon14": "Beautiful", "the_scientist_is_great": "@natashanoel001 hats of to you lady ! Very brave and I really respect your thoughts on this !! Appreciate your thoughts", "raj_kadiyala": "Each of these word came from deep pain and heart which have faced a lot of abuse both verbally and physically. Well sad Noel 🙂still many of confuse them selves with sexuality and sensuality.", "govindk.panchal": "Wow👌👌👌👌", "theuglygangsta": "Show your pussy next bitch", "wokey_flokey": "Wow! 👌 @natashanoel001", "kristinvese": "💙💙💙💙💙💙💙💙💙💙💙such a wonderful way to express it!! All blessings!!!!!", "anoopgkumar": "Super!", "benny_max_fernandes": "Gr8 body", "jaisossy": "Super but is too sexy?", "stoicthewordbender": "You and in inspiration just for your attitude and approach to life. Keep this going and a big thank you!", "bhawaniskumawat": "Thais lovely hai", "dishanknayal": "You are 'the' beautiful", "tejaswichavan6": "Caption is juz so perfect....😚😚", "anitakerai101": "Love 💕💕", "pracheta_photography_official": "Beautiful", "thekarankaria": "You ! Yes you Miss Noel You are just damn beautiful ! Be the way you are !! You are an inspiration for many !! Stay Strong 💪🏻 God Bless you 😊", "amitpatankar29": "Lovely figure and stunning", "sahil_parvez": "so if you do not like your boobs then why are you showing them??? 🤔 cover it and keep yourself vulger less.... you are beautiful enough in cover, not in open...", "pratiksable009": "Well said @natashanoel001..... U r real Wonder Women.... Respect boss🙏🏻☺️ God bless you.... Tc", "mdsohrab.cool": "👌 🔥 👌", "sonijaydip": "Uffffffff Mar hi daloge", "hitesh.ruddyy": "Damn ❤️", "ashok5046": "Hottie...", "nikhilbagchi": "Mam u r too beautifull.... love yourself and be happy till the end", "subho_4786": "Hot", "oe_tawtute": "WEll said👌 .loving women", "bittu7363": "Ha ha🕵😜😷😬😆👌😄🙏", "iamrahulavengers": "🔥 ❤", "tanayadave": "Girl you rock ! 🤘 Being confident in your own skin is what young girls need to be made aware of rather than following a typecast!", "gagan8938": "Bomb..👌👌🔥🔥🔥🔥fire shot", "ronnie_1101": "💘 💋", "ajbalaji25": "Toooo Hot ♨", "deepak_acharya7": "U r words and u r expression doesn't match .anyways u r beautifull .", "sathish0075": "SIMpLy GORGEOUS 🍅🍅🍅", "r_rajkumar_888": "Wow", "utkarshsawhney1992": "You are a strong woman🙏🙏", "somya25dance": "Perfect person😍", "kaisarequbal": "So hot", "shivamchourasia718": "Enamor Model!", "maanshadotra31": "Yrr manta hu ki ap ek yoga teacher ho.. But har photo mei bikni ... Its too much... Yeh mat bhulo ki ap teacher ke sath ek girl bhi ho aur woh bhi hindustani...", "reneesmith005": "You are the rays of hope n love for all woman ... love ya", "arpan8867": "@natashanoel001 just to let you know, that you are beautiful, beautiful and just beautiful..and I know you are trying to agitate those women who in the inside somewhat feel what you felt about yourself, to all those women I want to say that please don't worry so much about any thing and feel good about yourself . We only get one chance to live this life that has been gifted to us, so let's not feel bad about it any live it to the fullest possible and enjoy it and be happy till our last breath..", "manu_udiyanoor": "Sach ma yar thu thooo pagal haa...😌😌😌😌", "prashansaruptake.1016": "hats off to you ma'am 💖you are simply awesome😘", "mysteriousmanisha26": "Respect #respect and way too inspirational ur words are hats off girl u r simply amazing jus be like this always or forever wtevr u feel will remain there for longer time😉 loads of hugs and 😘😘", "aaravriya": "Ravishingly hit.. beautiful", "boss_ass_bitchh7": "Claps👏...whateva uh go through...makes uh stronger as a being natasha...", "jordan_avirat": "Great.... Hard Respect ♥", "all_turn_j1209": "Stunning🔥🔥🔥", "deepk___": "❤", "sudhir2713": "Very nice", "hardcore_mumbaikar1987": "Must say...you have guts to say such things....great job☺️. Respect🙌👍", "dhritibaruah_": "@okruchi", "dipu_pitroda": "Hot... M", "shikhamgautam": "Power to you ✊", "ak.earthmover": "@nio2326 just explore the insights..anxiety & consent highlight..", "hippiefromthecity": "Beautiful you are :)", "di_ni_th____": "Sexy body", "tanujsaurabh": "Omg. 👌", "arushi_garg_": "You have an amazing figure. And your post makes so much sense. It relates to so many of us. You’re really brave and emotionally strong to be coping with everything with such positivity. Cheers to you !", "mr_vaibhav_eminence": "I read your all words which in above captions.... I think I have also share my feelings like yours. .... Everyone of my friends some teasing me that ladkiya dekhke kuch hota he kya. . I really feel bad for their wrost mind .. if you want see only girls and their body part. Than you have your Maa and wife and sis..and other female relative.....bcoz you Spose to get better reply from them.....sex is required for everyone accept who don't want... I m interested but not everyone. She'll be special and unique....still I m waiting for her.... that's means I m not vergin .. if I m. That's Means not I m not interested in sex. ..but that's means I have control and support of our mind...one of body part want to do f**** so I have to attention for it ...that's means I have to see porn and photos. .noway I m not agree with this type of bullshitt words and thinking..... . thank you..", "rajkocher": "Words speaks ❤", "jenelleglenn": "Oh my goddess #queen", "maunikrathod": "Madam you are an inspiration..I salute you 🙏", "churbyfool": "Natasha, You Are Beautiful...!!!", "shrutimelodies": "You look beautiful ♥️", "sassafrassbliss": "♡♡♡♡", "sachin_pawar_official": "super achievement 👌", "rankaatul2410": "Proud of you & all women.. 💪💪💪💪💪", "21mgoswami": "#simply_👑 #stronger_👸 #boldnbeautiful", "nikitawalia2311": "@_sshhrreeyyaa_", "megharaj8569": "Looking so hot & sexy. But Ur workout is proudof.", "whyshoe17": "@miss.kalki1991 my mother told me this a long time ago - if u try to teach a pig to sing, you waste ur time and the pig gets annoyed. Incase u have any doubts about who the pig in this statement is, let me clear it out for you - its you! But sometimes, one needs to say what one feels. Especially when it's rubbing it on the face of a morally pompous prick like you. Keep your shit to yourself. Stop ruining someone s day just cos everything is vulgar to your filthy eyes! It is people like you, who ruin it for others like us. Get off your high horse and please shut the hell up about things that don't make the cut unto your self-imposed puritanism.", "arora79monika": "Same thing with me ..like u", "a.j.i.t.h.a": "You are drop dead gorgeous! Embrace your beautiful body... Your boobs are a part of it! Be proud girl!", "luckyy_battu3464": "Superbbbb", "salim3179": "🌹🌹🌹💋", "mavinasha": "You're a freaking rockstar, @natashanoel001 !!", "brajesh_singh": "perfect curves..👌😍😘💓💓", "shalu_515": "😅😅😅😅😅", "nicanorromuardogon": "Hola hermosa", "angupta84": "Rape vo bhi 7 saal ki umar me...😔 Bad... But you look good and fit..", "rajatsharma913": "Waw.....you every day group high .....but now everything change in you... @natashanoel001", "sloth.diaries": "More power to you 😊🙏", "giriprasad37": "U feel happy when ur tits become breasts....once u feed ur baby u will feel proud..dont wry dude..", "sarasclixpix": "What a beautiful person", "satish_manyam_225": "Sexy yaa", "pankajc3402": "Wow", "pooja.aruna": "I can relate myself in starting 2 paragraphs @missharleen3007 @harleenkaur3007 @shwe_65 @rinigupta2911 @nikita_madaan @_vanigupta", "zainuddin_zu_222_offical": "✌✌✌✌✌✌✌wooooow", "mannusays": "👌☝👍🤘🍻🍺", "anmolrajpoot": "O my god looking so sexy", "riseandshine1010": "She talks about how she hated her Body and her rape stories then posts almosts nude pictures. An actual victim, be it a man or a woman will never be comfortable even being this exposed in front of another person, forget posting such pictures on social media.", "nidhin.k.k": "Why do I get the feeling that, u get little fat a day and then get trimmed the next day..!", "coachdiwakar": "True", "nishanntkumarr": "👌👌😍😍😍😍😍😍", "abhishekgupta5720": "@natashanoel001 what healthy boobs 😍😍😍😘😘😘", "_aamby_": "@rajeshwariragz", "nalla.clicks": "Sexy and hot.", "sheethal_chinnappa": "I can somehow relate to this post Natasha.... almost feel the same way about my boobs and butt!! I sometimes compromise with the clothes that i buy just to make it less awkward and less boobish(body fitting... you know what i mean)even though i want to buy something else. Body becomes a barrier sometimes... but now I've learnt to live with that coz being you and loving your body is the only motivation you can give yourself! ❤ Thanks for the post @natashanoel001 lots of love to you girl!! 🤗🌻", "zeeshan786me": "So sexy 😍", "bharat_r_s_": "Yes know u r hot n so sexy darling 💕💕😘😘💋💋", "sharma_raviraj": "So sexy", "dil_se_2016": "Sexy", "mohez7585": "Mindblowin......wallpaper worthy", "hiren_patel8833": "Natasha u r so hot n cute", "tamber_p": "Grttt girl. It needs courage 2 share things like this. Kuddos. More bravery and power 2 u.", "aniketgowardhan": "@natashanoel001 Proud of you and all the women you people are really strong 👏🏻👏🏻👏🏻💪🏻💪🏻💪🏻💪🏻💪🏻🙏🏻🙏🏻🙏🏻", "purnima.brightmoon": "It's seems like my story 😒. I struggle from childhood . But now I don't care what ppl think it's my body I know what I m . Kudos to u too dare to share u story 👍", "rahul.kalakoti.18": "Very beautiful", "babusha.jain": "@akankshaneware @tiwarystuti @nayakradhika24 @kmiraik please read this.", "ramanskapur": "More power to you girl, god bless you. Hope this not only is inspirational for ladies but also a learning for a few gents who objetify a ladies body.", "abhinavkbansal": "@karishmaglee", "chandrakantmaske": "Dazzling", "sanchubaba": "Breast is a God made secondary sexual organ which attract men even healthy mammary gland is gud ,it will produce enough milk for baby.", "amossimon": "@natashanoel001 Awwwwwww look at that smile 😘😘😘", "abhishek.kamble2500": "Yo SexxxY", "yvishal8626": "Lovely panty dear 😘😘😘😘", "maxout_queen": "Thankyou so much @natashanoel001 for sharing this. You did for self but i felt it was me , i have had same phase n kinda in same thought lines. Now i really work everyday on my thoughts to love n respect self without worrying about what other people think.. your post been a really good support thankyouuuuu.", "roving_soul_": "You are one beautiful soul that brighten up my day always! ☺️", "pateljp786": "Wow.. amazing body", "vjuuuu": "👸", "dhonifanforverclub7": "My family looks up to you, so keep up the great work😍 mom,dadi,nano,chachi,Bua,my boo are all into yoga because of you. You are wow.", "balasubramanyanagarajan": "Your awesome and beautiful dear.. You be what you are, doesn't matter what other think about you. You wear what u feel good and beautiful, if u covered r not, people tslk sormthign either. Your so beautiful inner and outer, amazing and very inspiration gal of the planet.. You rocks dear.. Chill karo and enjoy the life and pls keep inspiring all of us.. We all proud of you and love you bottom of our heart.. Just keep rocking.. 👍💪☺", "__being_me.__": "I wish i could say the same loud out... My support", "drsonal_chavan": "Loved the post #waytogo", "adityasawdekar": "Thanks for inspiring many Noelle", "jerminator90": "You look perfect", "yaqoob.amjad": "Hot piece", "aastha_raii": "You are so gorgeous 😍😍💖💖💖💖😭", "rocket.pocket44": "Nice personalitity", "karnikamishra": "I looked at the heading and saved the post in a tab to read after I leave from office, in peace. I used to feel the same about my 'Boobs' as a kid and it took some time for me to realise that things are the way they are for a reason and we should love to cherish them as they are...you inspire me Natasha and that's mostly got to do with the way you live your life 'unapologetically and freely'. You're someone who knows the value of self-love which many struggle with...I just love you..keep inspiring..much love 😙", "rohitofficiial07": "Super fit 👍👍👍", "lovingashish11": "👌👌", "raquela_fit": "Amazing you inspire me so much @natashanoel001", "urbanmogli": "My like today is not for the pic but for the writeup.. i wish to meet u personally some day n bow to this aura that u create just by ur words n thoughts..", "anwarbasheer786": "U look to pretty", "yatinkumar1010": "Breast is not sensual or sexy it is part of body it is natural and it's give mother hood to all women if anyone says breast are sexy 👊give the punch on his mindset he was unhealthy man. All these kinds ugly brainless man's one thing I will call them get well soon", "kgindermaur": "💜💜💜💜", "vidyasharma27": "@divyabhartisharma", "prasad7959": "Awesome yogaqueen", "the_ambitious_anubha": "Every girl should have such confidence.....U r going to be icon for them", "44kiran": "Well said dear...and I am glad you went ahead and wrote this piece..helps many come out of their shell...also the point about women seeing other women in a certain way. We totally need to have and give strength..be proud of ourselves and other women..that's the way to go.", "kheninitin154": "No comment only analysis", "lion.harshavnagisetti": "Well said sister", "yogesh.image": "So beautiful", "khushboovasant": "I want body like yours nattu u are pretty.....we all love you", "krishnakishor.b": "Look s gorgeous", "parasharking": "#impressive", "vickeyii": "Respect you, How did you do that more exercise ?", "saurabhmehra8325": "Miss beautiful", "krishnakumar8250": "Gorgeous", "tarunalachhwani": "@anishalachhwani", "findingshanti": "You are a star!", "_vibhor__gupta": "Brilliant", "ckdjsoul": "👍👌", "shefali_bhatia": "Such an inspiration u r.. Beautiful inside out.. U go girl!!!! So proud of u🙌", "ssalian": "Super super and always super smile is perfect", "dahm_mini": "@foofoos_girl @sharmeenrizvi read this.", "tusharshinde8": "♥", "sandeepcharkhwal": "Not sexy.. Hahaha", "deepaklakshmi57": "Beautiful", "zeishahamlani": "Oh man! So so awesome of you can’t imagine what it would’ve taken to put this out here but more power to you ❣️", "bhavesh_joshi0.0": "Looking beautiful man😍😍", "thewanderingbunnyrabbit": "You know what, I love you and you are such an inspiration 🤗😇😍", "kaveh.ranjbar2": "Beautiful", "kbachhav": "@natashanoel001 Respect 🙏🏻", "shalinvora1183": "😍😍😍😍😍👌👌👌👌👌👌😘😘😘😘😘😘🔝🔝🔝🔝🔝🔝👍👍👍👍👍❤️❤️❤️❤️❤️", "trupbee": "@akshatabablad", "sandeshjadhav106": "😍😍😘😘😘😋😋😋", "ashutoshuklaa": "I'm mesmerised by your confidence. Cheer up 👍", "shaanalamqureshi": "Very inspirational didi . @natashanoel001", "sushwitch": "@neilprabhu96 mala tee khoop avadte", "itsvinayunique": "you are an inspiration for everyone god bless keep inspiring", "chouta.deepti": "@smilitsweetie THIS❤️", "couplegoalsex69": "Gadraya maal", "suman.northland": "You deserve for a bra snd panty", "mystiqueminu": "Awesome write-up,u r an inspiration ...Never forget dat...", "picturesandprosery": "#metoo, in every way @natashanoel001. More power to you 💗✨", "arpit9106": "🔥🔥🔥🔥🔥🔥", "faizalstarkerala": "💘", "themeghagupta": "U are my biggest motivation ❤️ @natashanoel001", "solankisatish2": "Perfect Body....", "rebecca___stewart": "You are incredible 😍😍😍💚", "chathura_madusanka33": "Sexy", "dhirraj.chauhan": "Babes@ natasha", "heroic_swarna": "what a figure... lit af.", "roops.rj": "Sexooo!", "devilapprentice": "Is it ok if i jerk off to you?", "sammy_varun_joel": "super sexyyyyy 👌👌👌👌👌💕💕💕💕❤❤❤❤", "garimadwivedihrm": "It happens normally when u want to avoid attention such things grab the attention of people...Same thing faced", "namrata.kulkarni.03": "Sexyyyyyyy", "alandmash": "Much love 💖💖💖", "luv_u_zindagee": "@natashanoel001 loved ur bra. Can I know the brand pls?", "rdhruv17": "You're in india, half of the men will think you are asking for it even if you're confident and not shy. It has nothing to do with you and your body just testosterone going out of control.", "ankit_999999": "Sexo", "thirdeyegoddess_13": "Omg I just want to hug Natasha ♥♥♥♥♥♥♥♥ love her to bits. She's a true warrior goddess :') @see_bet", "abh4343": "Superb", "iamdollysingh": "Thank you from the bottom of my heart ❤️ @natashanoel001", "i_am_vineeshh": "Glorious", "prave.en": "Hahaha that expression 😉👌, good one.", "maddy19oct1984": "Just be urself all d time n d world u got @natashanoel001 its been ur life ur priorities so world s alws lukin for so many odd reasons 2 hide their dignity u have shown so great 2 hear wt u think stay blessed alwss", "miyuru9": "🙏🙏🙏👏👏", "kkriss712": "Your cool", "asahay811": "@debashreepoddar ☝🏽", "melroyl": "❤️bless you", "rukminion": "Dude I used to feel the same way until I lost my boobs due to excessive cardio. Or whatever. I don’t even know. Just love them ok? For me it’s too late.", "vidyashri.pula": "Hot n lovely", "myra_5508": "It's so true we got to respect our body and love the way it's 💖 we all are unique . @natashanoel001 🙏 hats off to you for being great inspiration 😇", "aruponry": "True", "madhukumar_pmg": "Sex baby looking hoti", "sanjay.kunwar": "Your boobs aren't object of desire....for some men or women They are masterpieces.. Keep them, nurture them and mostly love them.", "kisslifehelllo": "@desitadkah read this :)", "_nimo_19_": "Looking nice", "jat95454": "Omg", "praveen_mahar": "So looking hoti", "rahul.lalwani_impulsiverider": "Bikini babe💐💐💐", "shereshavodela7": "I just have so much, much respect for you @natashanoel001 I am so grateful to know you. Even I feel my boobs and hips ask for unwanted attention. Great going pretty lady. Hats off", "nikhil.shah.50596013": "Sexy babe", "prince.071988": "Beautiful....🌹🌹🌹🌹", "deepaksadana": "Nothing to say.....Just respect.... Inspiration......🙏🙏🙏", "bharati__92": "So proud of u😘", "twinkle2602": "Always a stunner ! ❤️", "bunty2924": "hot yr", "ardiuno": "That 😛 face though ❤️", "goldy_baba": "#kada", "apnibaatalaghaii": "You are an inspiration to one an all. Even to the opposite gender in full honesty. An ardent follower of your work, your stories and everything. Keep inspiring and getting inspired. 👏💕", "naomimccoo13": "Beauty.... Absolutely stunning😊💖", "tejinder_kullar_": "Awsm outfit @natashanoel001 dear", "s.n.i.handicrafts": "Tumhari jaisi padosan har kisi ko bhagwaan de", "aethermaster": "You’re a Phoenix 🔥🔥🔥 a strong one", "chauchanvk": "Hoty", "faisal.jack.794": "So hot", "thisindianbeauty": "Omg u r the greatest inspiration🙏🏻love you❣️", "aasthagodika": "@mallikaa14", "tone_house_gurgaon": "It’s always always been the same with me, tried all my life covering boobs, because they always were the first to enter a room.. but this gives me lot of courage, & hope. Thank you!!", "r_a_j_d_e_e_p_77": "Perfect @natashanoel001", "matzpk": "Well said", "maryannttaylor": "More power to you!", "_isshani_": "Yes..can really understand n lil relatable! @natashanoel001", "azlanazirah91": "Wow so nice", "agirlofherwords": "❤️❤️❤️❤️❤️❤️❤️", "run_fatboyrun": "I hate my boobs too. But I’m gonna cuddle them tonight Nattu. Thanks ❤️", "malinalli_xochitl": "Inspirational and motivational 💖✊🏽 ps I zoomed into your face 😂 I seen the little tongue action 😀", "vrushs": "👌", "vinod.khot.75": "Amazing. .", "jatu_idrish": "Beauty don't need to starve themselves to look beautiful.", "mohii_semwal": "Best words I've ever read 💞💞much much love #respect @natashanoel001", "aashish_lfc_cr7": "🙂❤️👌🏻", "persona_stars": "@natashanoel001 You are a gem of a person !", "bobz_gidwani": "Love you genuinely @natashanoel001", "_shardulpuniya": "@iam_dreaming_out_loud", "mariarosa_b": "Gorgeous🦋", "musafir_huyaro1": "Beautifully expressed @natashanoel001 🤘. I am a fan of yours and regularly see your posts, your stories and i must appreciate the way you put in your messages to bring in a change..to add on i must say you are a beautiful person and lovely soul..and m sure you don't give a damn to the world anymore.. And there is no need to think about the world... Love yourself the way you are👍👍", "ankitagaba": "Hey I would like to do a twitter chat with you. The concept is to ask a few questions using the hashtag #toughstory and present to people the issues and how we are fighting them. Thus encouraging them. Are you on twitter. I am twitter.com/ankitagaba https://twitter.com/ankitagaba/status/969241495701196800?s=21", "aakash.b": "Huge respect. Keep inspiring us🙌🏻", "official_kunalgaud": "@non_sane_psid", "sunil.bijlani": "Super Hottt 👌🔥🔥🔥", "b_sunnybaba": "❤️", "vidya.prasad.963": "Fuck them all who says \"you look sexual all the time\". You look awsome and have amazing personality which there fucking eyes just cant see. You are amazing and adorable. Lots of love to you❤", "vikramna1192": "Awesome body shape", "freudwasdumb": "I am so proud of you for sharing that💖", "yugal.trivedi": "❤️👌", "bbollywoodhungamaa": "Wowwwew charming n hottttt", "meetalidhootimageconsultancy": "You are so brave ❤", "kashyap8865": "so hottttt sexy pink panty🔥🔥", "tamaneeee": "♥️", "kavyagnair": "@natashanoel001 I started following you after watching your YouTube video on your journey that was somehow so surprisingly vulnerable and real.Though I have not been through your circumstances, your realness and vulnerability resonated with me.You are a beautiful person.More power to you!!!!!Cheers!!", "raunak070": "Arree hottiee", "warrior_prinxx": "I love this, you're incredible and your journey is so inspiring! 🌸", "preeti2703": "Oh I can so relate to this, infact unconsciously I started walking with a hunch just to avoid the unwanted attention all my life, I contemplated surgery so many times.. But after two kids and years of hating my body I have finally started to accept it.. Power to us all", "kiran_anklehold": "Aiwaaaaa", "timetomakegains": "🤤", "gangstervinci": "Nicely expressed. I hope it is liberating", "hiren9600": "Super", "hazel.blink": "What a bold, honest and stunning post 💯", "vinitha2112": "More love to u❤️ Keep inspiring!!", "chandnisfunspace": "Beautiful post! I love you Natasha. You are indeed one of the best person's i have come across on the internet. You are doing great. Lots of love to you. 😊😊", "4mheart": "You are more beautiful from inside girl those men lost to see the most beautiful part of you... God bless...", "livesthedevil": "Gorgeous", "gravi3979": "Wow", "srimperio": "God bless you @natashanoel001 😊😊😊", "aman_sukoon": "Only word for u #ResPect God Bless you@Natasha", "neha_aade": "My fiancé is an Australian! and he was left creeped when we visited India ,people look at me when I wear something which is not normal as per indian Local standard or little uncommon for my small town , he once said to me I feel sorry for you women that you have to go through it everyday(Eve teasing and creepy looks) . I explained to him I do not feel sorry neither want you to feel sorry for us but for those who have faults in their eyes . You are beautiful in every way and I’m so proud of you that you wear body proudly without any shame !", "vinay0502_": "Yeah that's true, even in the 20th century people have the Same notions about women and their bodies, I literally feel ashamed sometimes being a man myself", "i__pragya": "Probably one of the best thing i read today! Thank you @natashanoel001", "aviator_dhruvil": "You don't need to worry about your physical insecurities @natashanoel001. Your dorky expression takes away all the attention. 😂", "swatcat59": "Holy cow", "sanam5138": "Nic", "anne_shaji": "Natasha , these are my words that you captioned.", "ferojbashwan": "Omg your so beautiful", "abhijithgupta": "Ur one helluva gutsy, fiesty girl.... I must admit, u have what some men don't... #Respect", "lakshyayoga": "Embrace them! You’re a babe 💋", "behtinaak_": "Love you Natasha ❤️", "yashshreebhati": "So relatable 😔😔😔😔😖😖😖", "aadi_sk_official.1994": "Killer😍", "sasha_88warrior": "U r beautiful inside and outside too... n that is what matters!!! ❤️❤️always", "vintageisexpensive": "This woman is just my favorite ❤ #inspiration", "geeta.johar": "Not only well expressed but atta girl !! My unstoppable child !", "arshad_kabeer_khan": "U r beautiful... thats it", "elzelinevanderhoek": "Great insight!", "krish_sharmaaa": "Thanks for sharing. And though it means nothing, apologies on behalf of humanity. We've failed big time in aspects that should matter the most. 🙏", "cooljoel16": "Sexy", "vikrantjiet": "Well said dear", "trollonish": "Strong, independent, courageous. You are all of this!!", "mohansudhi": "World beauty💕💕💕💕💕💕", "acawadhesh79": "Luking bold n beautiful wid lvly yoga pose", "_ganga_ramesh_": "@sneeya_george ❤", "adv.tejas": "Very well said....", "_at.ray": "To all who so ever is reading this.. you're beautiful!🌼. I strongly believe that beauty lies in your mentality, your perception. Be beautiful within, rest will radiate! 🌞✨", "rajabhaatkhawa": "@josupriya", "iam_manooj": "Same to same priyanka chopra.... I must say your figure is better than priyanka chopra", "vasubasita7773": "Lovely", "__jo_hny___": "👉❤👉❤", "shwetadsilva": "Saaaaxyyyy 😍😍😍😍😍😍😍", "hunny_rathore814": "Respect ma'am🙏🏻 @natashanoel001", "sandy4pryu": "Fabulous...you are really inspiration...", "ruksar.syed": "Thank you.", "mohitester": "Pagal hai.. They look Damn good.. Keep them growing..", "guru_rudra_": "Yoga is best 👍", "humraah1890": "U r rock", "rachelle_kunders": "I find it so funny that after such a deep and meaningful message about a healthy body image and learning to love yourself, there are still the occasional people commenting about her being sexy hot and what not. I just wish people would stop idolising women’s bodies. Are bodies are made for so much more than being just a sex symbol! @natashanoel001 hats off to you Girl for having the power to stand up to your own mind speak it when most cant! Every woman is perfect in her own regard and should understand that ❤️💯", "samiyashakir": "I facking love that bra!", "latwal_man.sea_": "You go girl.❤❤❤ it ain't easy coping with body insecurities,they bother u all day long sometimes,but at the end of the day,what we can do then just to love ourselves the way we are.Dayumm!!! This is the prettiest thing ,loving ourselves the way we are.❤ @natashanoel001 okay .even i sometimes have thought,fuck man,what does she really posts simetimes,but trust meee. A hell lot of guts it takes. 💃 keep going girl.", "smogder": "Absolutely yes! Some people out there judges a woman by just looking at the breast LIKEEEE. .. CMON!! WHAT IN THE WORLD ARE YALL !!! ! :/ I feel sad that how we men captivate galat sooch! And this need to be fixed.", "enigma2501stunts": "Amen 🙏🙏🙏🙏 be blessed @natashanoel001", "pm001600": "Wowwwwww 😍😍😍😍😍😍😍😍😍😍😍😍", "boho_gram": "you are amazing that passage made a lot of sense.", "ismaildawoodjee": "So sexy", "adamsapple0_0": "We laaaav youuuuu mallu", "rashmi.jain": "So well said ....hats off to Ur confidence...", "ragini_1990": "Honestly... they are not that big...", "fernandesridge": "❤️", "jsmesbond007": "I'm really surprise how much care abt ur each other body part", "jatindersingh.jmu": "Nice loom", "sushil7855": "beautifully said mam, I mean you are such an inspiration", "ricccccccckyyyyyyy": "Wow😍😍😘😘", "muniyappa3051": "You are an inspiration for every Yong generation ...", "thathappytraveler": "Amen. ❤️", "arpitaaaaaaaaaaaaaa": "❤", "lily_10111": "They’r pretty 💗💗💗💗", "sai_kapoor": "You are inspiration to many girls out there and more power to you 👏👏", "jasna.gopalan": "Bold and beautiful ❤️❤️ so well written ✌️✌️", "kishore_joshi2106": "Awesome, cute, beautiful, sexy wild🐈eye, loving hot doll", "akshay___7057___": "Beautiful girl", "neeraj_bat": "more power to u", "ankita_ele": "U are an inspitation to evry grl..huge respect 4 you mam..😘😘", "rashionality\nVerified": "Verified", "_kapil_10": "Nyc", "ahmedkhan4067": "Nice u r truy beautiful", "sunny_lone_": "Looking hot an sexy...", "throughthe_viewfinder": "This is what I needed to hear today. Thank you. Just. Thank you. ❤😢", "meet_sharmistha": "So damn true", "chinnakaruppan_aka_siva": "The words worth it.", "princejayn": "Mtlb... Jivn ki haqiqat.... Aap ke liye salute h maem.. emotional kr ditta tussi😢", "sahibvivek": "When I look at you, I believe that beauty will save the world.", "muki_kuriyal": "Fuking you", "aryan05718": "What a figure", "nehanihalani": "Fiyaaah gurl 🔥", "chiragbarotmaluka": "fit body perfact sexy.....", "jaiwant_thomas": "💜💞💜💞💜💞💜💞💜💞😚💞😐💞😚💞😐💞😐💞😐", "kalpesh_fondekar": "perfect", "instakataria": "Respect 👍", "aahanaalbert": "You’re a really gorgeos person , and i love love LOVE your writing , they really keep me going ❤️ honestly only started following you bec of your beautiful posts , but the more i read your writing and how you throw shade and your haters (lol) the more i love your personality , stay the same ❤️lots of love 💞", "life_beyond_the_thoughts": "👍👍👍👍👍", "elroymeneze_boom": "Too", "murarka.ashish": "Massy", "kaura__saab": "Kaim", "sujit.wadekar2611": "Let it go ... Accept whatever it is ... Live it love it...", "chauhanasmita": "Beautiful ma'am 😍", "anshitakoul": "Beautifully expressed. Loved it and agreed. 🤗🌺", "sidhhelly": "Agree :) and you perfect", "roopesharakkal": "Dear Natasha, well written. 100% agree with you", "rupalinilekar": "You are Gorgeous, Bold and Beautiful. I wanted see your recent entire Ted talk video . Please do share on ur insta", "jordanking1993": "Are they real?", "avengers7777": "Wow...so sexy", "basavarajbhuyar": "Awesome..", "onlydeep01": "Nice", "bhavesh1052": "Supra", "nitinpawar8419": "Osm", "natashanoel001\nVerified": "Verified", "shrutipangtey": "beautiful! <3", "kuuggan": "♥️", "harleen101_": "Thank you. Thank you. Love you.", "patilrahul381": "Beautiful", "priyah_mishra": "Fittyyy🔥🔥#inspiration"}