{"aparnaa_03": "Was very emotional while watching this video ..", "meghanapalagiri": "@anushri___ she’s so amazing. Look at her profile", "me_suzzane": "U r a brave soul.god bless u 😊", "dmh1468": "😢", "realvijaygurung": "We proud of you such a brave girl you are love you so hard", "lithika__": "@dharani5314 I hope u got this message 😌😌", "sanjaykumar10732018": "Earlier I was fan of your yoga but now you have earned my respect also.... Individuals like you inspire young generation to face and fight back all odds !!#Stay strong #Keep going(y) #Jai HInd", "me_eshani": "lady....more power to u💝😘", "amrita.pillai": "You are an inspiration ma'am, undoubtedly.", "ashoknaidu.pagadala": "Your eyes are very sad", "mumtaz_0201": "@transformationzee", "shazdah": "💔 @neha_siddiqi @zainakhan3912 @taibahdesai @masira_khan23", "shob07": "You are a strong person", "ticklemegiggles": "❤️", "rolleyandy": "Strongest girl i had ever meet", "melanie_d.souza": "@mexicutioner16", "roy_shubhranil": "Proud of you girl.. so much respect..", "viratsanjay": "Great mam strongest evr. ... Hatss ooff... Respect more", "joyti.lovleena": "More power to you", "pavitra3399": "Love u tons🖤😘🤗💗💗💗", "ramyroop": "You are stronger than you know. Love and respect to you!", "avidiv16": "Dear Natasha, great respect for you and your warrior spirit. 🙏", "bikersbrew": "🙏", "vgladla3": "Ma'am I want to learn yoga so suggest me if u can", "iampummyk": "Be happy", "bmeshionly": "Respect......", "charukhosla92": "u r an inspiration... hats off!!", "devendraakori": "Salute to u.......", "punitha_gopalakrishnan": "My one the inspiration to live life with enough courage...i saw ur josh talks and also tedx talks today and i cried idk y...u taught me how to accept the past and heal myself", "r.agarwal_0284": "Lots and lots of love❤️ btw i also love ur tattoo😅", "arttrick.in": "🙏🙏🙏", "hussain_here": "I just watched this talk.. i wish you a joyful and inspiring lyf.. and thanks for sharing ur story.. Have lot's of blessings.. @natashanoel001", "amar.mhatre": "U r very strong , God bless u dear", "imyogesh_12": "Respect🙏", "chenthil.linux": "You are simply great. Respect u alot", "wakeup_station": "Superb you are. N very inspiring. There are so many who needs this.👏", "lucknowforvoiceless": "✊✊ be blessed.", "bombaysfoodie": "The world needs more of you @natashanoel001", "avijit.1997": "Funny stort", "monish_malleppa": "@pavi__pavu 😕", "chicaloca_travels": "@priiyankajashnani", "storytellingcanvas": "@arindrum.badum.tss wanna know me more ? Just watch the video once. You'll fall for her. Koinoyokan. ❤️", "l_h_o3": "Salute you Ma'am!", "pihujn": "Lots of love. ❤", "mehulsingla16": "mam 🙏🙏🙏🙏🇮🇳🇮🇳🇮🇳🇮🇳", "pushpachoudharyy": "@nehaishere", "fitmagmagazine": "@nachoz616", "olldushapa": "💞", "d.environ.mentalist": "Kudos to your strength:)", "sanyapvt1": "❤", "djmitzz": "Mam hats off to your strength... Youre an inspiration to lacs of them here .... 🙏🙏", "nimrauns": "@shaikh_tooba3", "thomasajenkinsiii": "You are special... You are loved and you are inspiration to so many. I just stumbled on to your instagram.. and as always i have been blessed to find another person on the same mission as i. Thank you for being you. 💗", "motoholic_776": "Inspiring for girls", "saiteja_nov": "Hi Ma,am..you are one awesome gutsy girl, salute and Respect.🙏 you are exceptionally good, keep this going 👍, May you get stronger day by day . keep smiling. May the force be with you !", "sangit6113": "Natasha ur superb strong women hats off to u 💪 strong one", "ms_bajaj1011": "U r amazing ❤", "rudra_neeta_dubey_": "Respect her", "madgirltulu": "This made me cry.", "varunshekharsharma": "salute to you and your courage ... lots of love keep going", "rathore_devesh_": "I can't bear that... World is so cruel", "geet2912": "@sujith3653 @kartik_shetts @anoopnagabhushan @incognito_shetty @yashmokashi @mandirabhatia", "onlynameinmyheartxyzabc": "Omg ....u r the real hero girl of the society", "issa_nomoo": "Btw madam thanks for sharing your thoughts it will surely motivate the girls to be strong and to speak for yourself and this is a tight slap on the faces of those so called mans/boys who thinks by using the innocent souls you will be able to put them in to a exile....Please respect womens....Keep going @natashanoel001 💖", "im_rohit34": "Motivation☺@natashanoel001", "irisaarun": "More power to you Girl, and all the girls and women in the world", "bhagyz008": "Ur such a true inspiration to all..... rock star ur", "i.am.sameera": "@prince__spencer", "akash.dutta_25": "@natashanoel001 U add more power to me.. Thank you", "kausenhusain": "i never heard this in my life before that these things can be happen with a Human being...", "bhartividyabharti": "I am also in the same process u r in... :-)", "raj_kadiyala": "I wish the things which you have gone through should never even happen to my enemies 😶😶", "soumyaisthename": "💕lots of love", "nthinsathyan": "@natashanoel001 respect and love", "cowgirl_63": "I blame myself everyday for not doing anything productive, I have completely shut down and don't know how to get out and grow. My body no longer works like it used to, all kinds of arthritis , my body can not support it self, only the bed. My mind is broken and there is no more glue to put it back together again.", "praveenjhayogi": "Aap hero ho 💪 love you Di😚😚😚😚", "wellbeingvoyage": "You are such an inspiration.so much respect for you God bless you always ❤️", "marsh.photo07": "God bless u. A real inspiration to those who give up easily to be more stronger", "kul.deeep": "@ishasheslay ❤️", "sdd149": "😍❤👍👌", "imaankhani": "Imaan Salam karta hai ap jaise himaath wali lardkiyun ku.... respect u frm heart.", "pulakhandamyaswanth": "Loads of respect to your fight back... Trust once lost is hard to recur... I must say I'm motivated to look beyond the smile #natashanoel", "chrysanscolorfulworld": "@g_r_g_7", "amanpehal": "I wish,I had words for your courage and strength", "meghaperiwal3": "Inspiration", "kashishgupta9": "It just occurred to me that many people are actually afraid to heal because their entire identity is centered around the trauma they've experienced. They have no idea who they are outside of trauma and that unknown can be terrifying.", "mr_siddo15": "Selut to yur life 😇", "liannegrsham": "To come and talk about it, hats off to you babe ! This will inspire many other women in a very positive way. So many women go through it but never talk about it", "miss_positive_vibess": "Love u", "anand.jakati": "I just watched your this video in fb.. next moment i opened Instagram and sent a follow request to u. So much pain for one life? Unbilievable..!!!!... many things to write comment box is not enough....... Get going u r awesome.", "kumarnayakaru": "Natasha , may god bless you. I am with you as good friend, but not with affection. As a good human being, I will try to heal up your problems and tries to take you closer to god. Thanks", "tmathew_67": "It’s really heart touching,Gods grace be with u always ,He is there for u always.God bless u.", "rajput__4rom__punjab": "@natashanoel001 u r truly inspirational for gals stay safe n stay healthy n don’t give a damn to those people who r abusing or disrespecting you through comments... u r amazing gal 🙏🏻", "maulioberoi": "@annu_gs must watch bae", "tungajeevan": "God bless you dear..", "neha_s_banga": "U r strong gurl", "raj_singh_randhawa": "Mad respect.. girl... 💪 @natashanoel001", "swathismilevibes": "One strongest soul you are ..❤.. Respect to you darling❤❤more strength to you ❤❤", "vibz05": "🤗😍😘❤️❤️💙 my superhero", "_sirishahaha": "You are a true inspiration, and an amazing person. ❤️", "travelwithjanella": "@natashanoel001 @prichawla she is a super woman ... what an inspiration ❤️", "sasha.dsouza": "@anishadsouza97", "palak_shettiwar": "Natasha, I watched your video and you are no less than an inspiration. I was in tears and it was not coz I felt bad for what happened with you in your childhood but coz I could relate to the phase of depression and how everything is a choice. We blame ourselves and then crib. It's no joke to get out of that phase but just like you i hope everyone out there is trying the same to love themselves coz I m trying that and I feel way better now.", "nishtha.26": "@utsav_chauhan", "princess31kup": "Respect Respect Respect 🙏😫😫❤️ Love You Forever.. . .", "aashieshsawant": "Hats off !!! Good luck and best wishes for journey ahead👍🏽", "alphawolf_19": "😞😢😢😢😢", "bhumiluxuryresort": "Respect respect", "amnikumari_": "Yes u r inspiration for me dear", "chaitalisoparkarkohli": "Yes #nevergiveup you know it or not I am not aware but you are waking me up every damn day to stay safe & stay humble. You inspire! And you move souls! You are healed already! Love ya girl!!!", "xxarushi05": "Wootttt @tanyasingh_05", "kaushikp_kp": "Truly a inspiration..Salute @natashanoel001", "ben_aquariun": "God bless", "anghanekta": "U r brave💪🏼", "mayankahlawat98": "I m inspired. 😊😊😊😊😊", "positive_souls_only": "Huge respect", "luvz_crammer": "Much love and respect for you ❤️", "niveditasharma780": "❤❤❤❤❤❤god bless her and girls like her 👏👏👏", "saitheja_ast": "🙏🙏🙏Haven't listened such an emotional speech from last few years 😰👌👌", "txksh": "huge respect for you", "hiren.raval.96155": "Live in the present & leave the past . This is the Way of life. This is only karma.", "hamsan__2511": "😢😢😢🙏", "white_water": "God Bless You", "judge9796": "Hmmm, short of words mate... Fucking hell, I don't even have the courage to imagine what you went through... I am fucking sorry that we all live in this world and it became like this without us trying to fix it, maybe there is fucking no cure to whatever we are going through right now... Keep staying strong for the broken hearted, you are an inspiration to us all. May Gods blessings be with us always", "shilpafoodie_micro_blogging": "I am in luv w u", "pinybuds": "I love you", "jeeti_sv": "I used to see your videos and have always appreciated it. Now I respect you for what you have achieved, what you really do for yourself and people around you. Respect 👏", "arun.banotra": "gosh. you are a strong girl.👏👏", "sms_sneha": "Mam god bless you have gud future ahead dnt wry smile plz", "dr_devanand": "You are really great and a strong women keep going 🤘🤘", "__.srishtii._": "I don't have words for you. Never heard anything as blunt but true as- \"a society can never handle a sad person\". Thanku for this inspiration.", "numb_spirit": "Respect @natashanoel001", "shivanimystery": "My heart exploded! ♥️⭐️😢", "partha.rakshit1": "salute boss..", "izavibes04": "Your are an inspiration to so many.❤ Your courageous and fierce. You will come out winning with what ever hell going inside you. Inshallah. I admire your strength and how you have dealt with your demons. Love you and more power to girls like you. Natasha my friend your the brightest shining star to people going through depressions and dark phase in their life. Keep glowing and Inspiring😙❤", "deepzvlp": "Damn strong u r girl. I had tears in my eyes listening to it.", "kaverichauhan": "More power to you 🙌🏻🌸❤️", "rmtejesh": "Oh sweetie!! Much power to you!!", "indichuesindia": "Hats off!", "jen4dr": "Beautiful!", "sagar_kanojia90": "Love u.", "subtle.ambivert": "Oh dear. Been following you since a yr or more and I really appreciate your honesty and free spirit. More power and love to you Natasha!", "nabeel__t": "🙏🙌", "ki_bling": "God Bless u.Spread love and peace ❤", "deepalimutreja": "More power to you gal", "swagger.manish": "Salute🙏🙏", "nomad_liar": "🙏🙏🙏🙏🙏🙏🙏 speechless!", "londheritesh": "👍", "navimumbaifoodies_": "I saw this video and i showed it to my mom my mothers father also burned himself when she was 3 she still remembers evrything natasha my bf told me to follw you when i was on a journey to lose weight and den i strted following you your workout idk how but i fell in love with you, your soul i feel connected to you. I was in tears when i saw this video i really wish to meet you. You have contributed alot to my confidence motivation and what not i just want to thank you i dont evn know wedr this comnt will come to u in notice and i love your sacasm and how u react to hate comnts ppl are so heartless just keep rocking natasha lots of love ❤️❤️❤️", "well_strung": "I’m shaken stirred and inspired...", "capture.420": "You're so so strong Natasha,keep going,you're such a great inspiration to many ladies out there. Don't ever stop loving. I want to talk about things with you but I can't do that here. I'll DM you :)", "cowboy_chicken_beeterz": "Wow that’s a strong women right there!", "sahir123tp": "😐", "jyoti.mishra2": "Amazing you ❤️", "sreez_z": "💪❤", "thebitchkitten": "You inspire so many people with your strength. Stay strong you amazing woman 🙏", "jayesh_sharma1": "❤", "anand_sharma008": "💐good guts you have... feel always proud....you’re coolest girl. I love you....👍🏻😚👱🏻‍♀️", "yashik_m": "RESPECT 🖐️", "srikanthclicks": "You are no less than a superhero! Keep inspiring us!", "punitmodhgil": "Love and hugs coming your way. Salute your indomitable spirit.", "mr.snapshooter": "Love and courage @natashanoel001 keep inspiring us thanks", "nav.gowda": "Very sad", "akashdalavai": "Lots of love to you 👏👏👏👏👏 ur so sweet, courage and inspirational to everyone @natashanoel001", "anoushka.gaba": "This was the best thing I've watched😍 your talk left me in tears! You deserve all the respect and love! You are a real inspiration. More power to you💓", "muchandi_sneha": "@ry_karuna", "rebecca___stewart": "@natashanoel001 can’t wait to watch the full, had goosebumps with this. Keep doing what you’re doing darlinggirl ❤️❤️❤️", "vaishalishah.m": "Respect, empathetic and proud of what you've done with your life after your wounded past.", "swapnil_8992": "U are real soul this is what I can say u are an inspiration for everyone u are servivor salute to the great and brave lady🙌🙏", "ravindercluster": "You are boss hats off girl I don't have words in my dictionary you are SHAKTI", "thatsmegoldy": "Respect 🙌", "sir_pablo7": "I am hatsoff on you", "swapmadiba": "@riya_matra", "danceeatrepeat": "Huge respect natasha for you. Sending you all positivity I can", "kanchansingh.19": "@natashanoel001 mam thank you so much for sharing your life story.. touched my heart ...motivated me ..and will do the same to others for sure ..i am gonna suggest this video to my friend ! Your fight with life and yourself is awesome ! Lots of respect and wishes for you natasha mam ! Muje agar aapse baat karne ka mauka mile ...muje bht acha lagega ..wish i can talk to you ..to gain more and discuss about life more ! Where can i write and contact you Mam its request !!", "prnz9989": "Salute to the strong SOUL of @natashanoel001 !!", "annujthakur": "You’ve helped me to survive something which was destroying me everday. I pray for you ♥️", "shahidkhan_2192": "😢", "findingshanti": "You are one incredible woman! Such an inspiration. Thank you for sharing your story, just the motivation and drive I needed to start my day with. Lots of love xxx", "rithunradhakrishnan_official": "😪😪😪", "firdoszt": "😞😞", "rahulchhaniwal": "Respect u,,,, U deserve more n more n more... U r a real Hero...Power flows within you.. no more words ...", "poojadpatel87": "Respect the women power", "cinecstacy": "You are way way stronger, than whatever has happened. Also, I can relate to a personal level because I have lost my mother in a similar way. But I am very sure she is extremely proud of you! Lots of love and strength to you. Always!", "magic_wolf09": "I followed you just because i respect you, the way you were telling your story i could feel that pain, i hope you would lead a happy life ahead and i don't know about others but you are in one of the people list who have inspired me...seriously hatsoff😃 stay strong and stay happy 😃😉😉 need any help always there.", "liveletliverajsalute6969": "Salute to you from this unknown brother.. You are the best.. Hatsoff.. Salute", "shrenikshah13": "Respect 🙏🙏🙏 you are some inspiration and god bless you always 🙏🙏🙏", "rohit_gaud7": "Respect to u", "isreedas": "❤", "kupeshr": "Respect 👏👏👏🙏", "berryboyiixii": "The only thing that I have for you is RESPECT, RESPECT, RESPECT and more RESPECT..", "armaaninside": "I saw this video n I just wanted to just thank you for sharing your story...", "arco__love_struck_devil": "Untill I watched this video I used to think that you are like any other wannabe social media influencer trying to put pics that draw the maximum crowd and that's pretty much it but after just 30 secs into this video I have immense respect for u Natasha , and I m sorry for even putting you in that category of \" Other's \" // lots of love and blessings full Power to u gal", "sats_in_insta": "You are such a strong person. God bless you 🙏🏻 we all love you here 😊", "mridulaganesan": "You are amazing! More power to you;", "31suraj": "You're the strongest girl on this planet.", "shredisha": "Love u mam... U r my inspiration.. 😊", "heartdebonair": "I've been following you for yoga inspirations for the longest time. I always found you strong, happy and a positive person. Knowing that you achieved all of that with a past so harrowing just says a lot about how much you took control of the shitty situations and braved through them. I respect and support you,girl! More power to you,today and forever.", "hunny_rathore814": "Respect🙏🏻 @natashanoel001", "meetvaibhav": "I take a bow your zeal towards life, You are a true inspiration. More power to you. Keep inspiring. @natashanoel001", "farahkhan_toot": "Please watch the full video on YouTube @_ayeshaahmed96", "ashruffaley": "Be that strong baby doll as always, #Respect", "david_banjul": "I respect u from the bottom of my heart", "aakankshac": "Thank you for being such an inspiration to the millions out there. Your a beautiful, strong woman and sending you all the positive energy. To the powerful woman you are. @natashanoel001 #girlboss #nevergiveup", "aksakhaan": "@farwakhan._", "sukanya_chhabra21": "Respect respect respect ❤️❤️❤️❤️", "sumanchowdary8": "😢😢", "hyperajita": "You are so strong! You are an inspiration ❤️ You deserve all the love and respect! More power to you ❤️❤️❤️", "tharusha_shehan": "You are amazing. After all these still standing strong more than ever. My respect to you.", "binoy_rajcalicut": "Respect u from my bottom of hurt ..", "abhishekkher": "Strongly Inspirational €π€®¶¥", "sarikathopate": "@dhanshreeb @melissarebello9 @bhavnanaryani", "ganysenthil": "Nice", "tripathi.brijnandan": "I salute u from my soul .", "nehadaswani93": "You are a beautiful soul and a true inspiration for so many people. Thank you for sharing your story..I don't know you but I feel proud of you.. Loads of love to you <3", "zeeshan786me": "Oh Natasha I salute u the way u HV lived ur life and make balance urself from lots of pain . Heartily say Natasha great u r ...", "badshah_ankit": "Hats off mam to give such motivation to other people 🙏", "getfitwithsnehal": "Respect 🙏🙏🙏🙏🙏", "inehathebrat": "You are amazing in every way.. You are someone who motivates people with your positive attitude.. love yourself first and universe will love you back. 🤗", "jerkysnake": "RESPECT🙏", "tanvi.kamble": "@priyummm baby watch it", "wickysolanki": "I can't believe this is want Happened with you. So sorry to hear this 😖😭😢", "prernadewnany": "I’m so proud of you. Keep going girl. You motivate me everyday ❤️", "sandyverma18": "So proud of you", "archanajais_9": "Respect 🙌🏻", "shrads.2301": "You are such an inspiration to the youth dear... specially to all the girls out there who all are victms ... every girl today needs to be strong enough to fight back... hatsoff to you girl.... stay blessed..", "keerthana.vishwanath": "You are really inspirational! You grow with the haters, you love your haters, you find positivity in their rude comments, and what not! You're beautiful! I always wanted to say that! 💟 well, I used to get irritated by your \"lots of stories\" (no offense 😃) I listened to them one day...and what I felt was, You're truly amazing! Lots of love, Keerthana! 💟", "fitness_maniac_": "You are amazing, respect", "thevaneezy": "Nothing but a million respects for you. ❤❤❤", "arghavanranjbar": "Thank you for sharing 🙏🏻💜", "zeba.zed": "So proud of you ❤️ such an inspirational character . More love and respect to u", "mr_tambourine_man__": "Who was that bloody hell telling u that no one will love u?????? We love u.. we love u very much.. we love ur spirit, ur enthu, ur talks, ur everything.. u know that u r an inspiration of thousands of indians.. Those people really love u respect u❤️❤️.. kudos to u", "mallikaluthra22": "Thank you for this 😭😭❤️❤️", "wanderlust_techie": "Respect, Motivating, Awesome 👌👍", "rizzbling": "Respect", "surveabhijit": "Sad", "ashwini6286": "Respect 😘❤️❤️❤️❤️❤️", "_theironaddict_": "@natashanoel001 this video made me fall in love with you, and what you are now only multiplied the love💕 may you be blessed and happy throughout your life, because that's what you deserve!", "patytav": "You are amazing. 💎♥️", "its_me_sia": "You are love Nadasha.. ur pure love breathing ..", "prateeksahoo": "Stay strong,Natasha. You are loved. :)", "missmedico": "Sending more love to you woman😘😘😘💚❤️", "callravi": "Just watched the video and being a survivor myself I can totally relate to the pain you went through, @natashanoel001. Stay strong, girl! 💖", "ruturajpawar": "Life is tough and so r u dear...salute to u.", "sultan_al_shabibi": "......... nothing I wann to said u no word its coming just I salute to u my sis", "prasanna.13": "don't worry I'll be always with you.,", "ashishprashant": "More Power to you @natashanoel001 . God Bless.", "sohailshaikhofficial": "😢😢😢😢😢😢😢😢😢😢😢😢😢😢😢☹ we are there with ur famly we all we are there for u 24×7", "sanjay_shahani": "Feel so sad but u strong person.hats off to un", "cutipie_g_i_r_l": "U r Diamond 😘😘God Bless u Dear", "sunil_joshi.moksh": "Even knowing this that u will not read this m still want to express my feeling here... Just 30 minutes ago i see ur name looked at ur insta profile nd watched ur video. Shared ut..nd now m in love with ur personality in this vry short time...will follow u in every social media site...u r my love of first sight. I am too a fitness lover. .nd now u willl add on one of my icons... Love you ma'am...💓💓😃💓💓💓", "vishwas.r": "i had respect on you. now \"huge\" add to it.", "chaosbreed13": "💎", "chauhanasmita": "U r superb girl.. love the way u r... 😍😍😘😘", "iamnehaofficial": "#Respect🙏", "shahjinaa7": "And i didnt know girl.. U r phoenix..respect🙌stay brave, stay strong, keep inspiring", "revathiiprasad": "Pretending to be happy when you are not is the most difficult thing. I have never seen anyone stronger than you. I have always wanted to meet you and talk to you! Hopefully someday. ♥️", "tl_karmakar": "Inspired and now i admire you more! You so brave girl! Respect!", "soulruhi": "Much love to you girl. Much love. Hope everything around you assures you of your strength and i hope you find trusting relationships. Admiration and respect.", "sahibaskaur": "You. Fucking. GO. GIRL. hugs and sending you a kazillion positive vibes for this healing process. ❤️❤️❤️❤️❤️", "theladyandthemonk": "You are bright and radiant precious light.", "yuv_batman": "Lots of love to you ✌ your inspiration 😚 I hope one day I meet you I remember that day when I see you you are running 🏃 doing your work out in streets of Mumbai 😜", "akshayadivarekar_": "Power to you", "crickharsh_231": "Respect....", "kepijoshi": "I truly respect for u dear...", "krishi_designtales": "So much respect for you girl!!!!", "nishantk_007": "Wow....yr kitna dare hai tumme.....hum tih kuch bhi ni hai tumhare samne.....u such a power to those people....who giveup.....and may god badly punish those bastards....who do all this....khoon krne ka mn krta hai aise logo ka.....but u are such a brave and strong girl....so daring....and high respect for you....👏👍#brave#daring", "ark0026": "👏🏻👏🏻👏🏻", "jithesh_raveendran": "ni ethra okke anubhavichit undo..ur r a fighter my dear lady..god bless", "one.badass.beauty": "#Respect 🙏", "stonericecreams": "A real leader is born after this. And the only way is heal and make others heal with example. You have shown the light to so many in shame and with insecurities. As you decide to look forward, we look forward to your great journey. Inspired.", "vilvinsabu": "That’s heart breaking", "vishak_krishnan": "This is very inspiring..Ur an amazing women..so much respect for u now..stay blessed 😊😊", "sidmaddy07": "You are realy a true inspiration @natashanoel001", "captain_gastro": "Speechless!! One word to describe you \"Braveheart\"", "shwetkamble": "Uaa great ✌", "zubair73063": "Respect", "a.estrella.bella": "Thank you for sharing your story, thank you for spreading love. I am so amazed by your light amidst darkness.", "mysterious_soul_17": "Respect 🙏🙏🙏", "harshal619": "I have been following you from a long time. Always used to wonder what is up with this girl. Why is she so amazingly different. I always share your post with love of my life. Even she loves you. But this past of yours is so shocking. I deeply emphasize for you and at the same time my respect for you have increased a lot. People who have seen nothing can't even handle anything and will keep on cribbing. Where as you have become such a inspiration after going through all the difficulties. Keep rocking girl. ❤️", "tanishakhushro": "Always an inspiration. Respect and lots of love ❤️❤️", "a_sarangi88": "Respect", "bindhunash": "Wow I have so much more respect for you.. And it takes a lot to be able to speak so bravely with that smile 🙏🙌", "running_rathod26": "Great", "ashish_________________shrivas": "🙏🙏🙏", "harmanp92": "I love u!! I have faced nothing close to u have but if u can do it anyone can. I have so much respect for u from the bottom of my heart. Lots of love for u💖", "thesaynick": "Wow tough life @natashanoel001 but still you fight. GREAT !!!", "sensiblyyours": "Thank you for sharing your story! You’re very inspiring Natasha ♥️", "gaurav.matey": "~Respect~", "meghajain.er": "So much to learn from you... #bravegirlsweare", "ravi_shrestha14": "@natashanoel001 strong girl. 🤗", "mel_2581": "Respect n a big salute to u ur a brave lady total respect to u", "_nameischaran": "I'm with u always...", "puneetmpd": "Respect!!", "abhijith_pramod_": "❤️ 😥", "not_vjaynegi": "Inspiration🙏", "arundeep_143": "respect for u coach", "pepo1205": "Just saw ur video on YouTube n i so loved it ..thank q so much for motivating all of us.. I so wish I could speak out my heart like you ..May god bless u always n give u all the strength in life 😊 A big hug to you 😙", "shiivanij": "@natashanoel001 you are pure love♥️and light🌟", "vishi2max": "@natashanoel001 More power to you Natasha. You've inspired so many people. Keep up the good work. Much love.", "samaresh.samanta143gmail.com2": "You are a brave and good girl.", "lucifers_world22": "It's very hard to forget few things in life 😢😢😢", "pri_king_": "!!GUERRERA!!.", "razorranjan": "U r really strong n inspiring 😭😭😭🤗", "pratishtha_goyal": "More respect to u.", "pramodshastryy": "More respect to you Natasha......", "shsingh90": "Courageous.......👏🙏", "glambypratibha": "Respect!!! You are sooo strong girl", "aashumivora": "Hi Natasha, I have been following for a while because I like to see your various posts on Yoga poses and being a dancer it's inspiring . But I always used to wonder, what made u write those lines or short stories below every post. I wondered why are u such a crazy, hyper, super energetic and optimistic person coz the way u talk on your insta stories sometimes shows that. I thought that it was probably a very bad break up that pulled u down in a deep trench or maybe someone who had very busy parents and didnt get enough love from them. But this I did not expect. I deeply empathize with you but at the same time I respect you for what you have made yourself. I respect the path you chose and the way u lifted yourself up. Thank you for inspiring me and reinforcing the thought in me that my problems are too small to crib about. Lots of love😍😍😘😘😘😘", "wan.der.lust.tj": "You just motivate me ....!!! I am thankful to you ...!!!", "maddy_azhar": "Loads of love and blessings 😘😘😘😘", "debonina": "You have come this far n there's a long way ahead waiting for you 😙", "arvindsiddharth2857": "Strongest woman... 💐💐💐", "bhaidanichintan": "Commendable! Awesome 👍🏼 you surely are an inspiration.", "berryshabby": "U r really v strong women....God bless", "aakash_shah212": "More strength to you girl !! You are one hell of an inspiration", "_smrna.s": "Thank you so much for helping others with your story. You are more than an inspiration :’)", "ranjani_t_a": "I have been following you and I am a big fan of how beautifully you do the yoga asanas and now this video .You are such a brave girl and I draw inspiration from you.Respect 🙏🏽👏🏽👏🏽👏🏽👏🏽", "sanjeevindialko": "शत शत नमन है आप को और आप के संघर्ष को ...🙇🙇🙇🙇🙇🙏🙏🙏", "the_fit_monkey": "Oh my God. Yoy my dear, are something else.", "housenazi4": "I'm sorry you went through this @natashanoel001 .", "eshwar_shyam": "We all love u!!! U r the best version of human being! @natashanoel001 <3 great fan of u", "mayanikamble": "You are truly great inspiration, hard to find… difficult to part with… impossible to forget…I salute you Natasha...😘😘😘😘😘😘", "rajchib": "Respect for your courage...God speed...", "makwanapiyush101": "Ise kehte hai jazba", "john.bobby": "😙", "cgowdha": "Total respect @natashanoel001", "kumar_raju_k": "Thank you for carrying great spirit. You’re not just inspiration for women but for the men to be more respectful.", "vibhor.b.srivastava": "#respect dude be brave # neversurrender", "ajaychandreja": "More power to you 👊", "nandee.ta": "Nadashaaa! You're just inspiration. That's all I can say. You give me reason to believe that people can come back from anything and do good for themselves and I'm going to share this with as many people as I can. When I met you at the Facebook Mumbai event, I had no background on what your life had been like, and even then your energy was INFECTIOUS and something I couldn't forgrt! Amazing amazing amazing... getting up there and telling it exactly like it is. No euphemisms, no shame in admitting to failure or hurt and ABSOLUTELY NO HOLDS BARRED OPTIMISM ABOUT THE POSSIBILITY OF THINGS GETTING BETTER. Take some unsolicited PDA! 😍😘", "mittmahatma": "U r an amazing person... Stay strong.. God bless..", "engineer_2016_p": "What did you do to the raper when you grew up? What is he doing now?", "travelwithshreya": "@natashanoel001 more power, more strength 😘😘😘😘😘", "shilpa_athena": "Awesome Natasha!!", "theunemployedfilmmaker": "Bring hell to the person who raped you", "sayan14041995": "Hat's off madam", "luminous_moves": "Thank you for this talk. Thank you for sharing. I am too still learning to laove and accept myself, and it's hard to do when you start in your twenties. Thank you", "andrieteyourfood": "Wow this is so damn inspirational. Keep going 👌❤", "heldinea": "Thank you for sharing. 💝", "yogavibes4ever": "Goddess in healing is what you are 🙏💕 thank you for sharing so that others may also heal. Namaste @natashanoel001 xo", "aknayirpladnom": "Following you from one year .. never knew about your past.. love you even more now.. yes I do.. keep shining always.. u are a rockstar.. 😘😘😘", "thirdeyegoddess_13": "Im crying. She's a freaking goddess warrior! My soul bows to her brave spirit. Lots of hugs ♥♥♥♥♥♥♥♥♥ @see_bet", "bhavendra_pawar": "Hi, I didn't know about you before. Just I watched you on Josh Talks on YouTube. So the search brought me here. Went through your entire profile just out of curiosity. Did see your Ex as well. I know the pain of separation, maybe most of us go through it at least once in a lifetime. Second thing, all men are not sex addict hyenas. What price you have paid for being a woman only you know that. As a man somewhere I felt disgusted after knowing whatever happened with you at tender age. You also said, depression is not a choice. But I say Love is a choice, choose Love over everything in life, no matter what. I wish you all the very best your life. You're sweet, beautiful, bold and brave.", "rajveer_saboo": "Hat's 📴 off to you you are such a real hero, real warrior 👏👏💞", "poornima_vedas": "You r truly an inspiration 🙏", "lubnabano83": "Me sirf yahi bolu gi I love my sister 😙", "titus_mani_": "You're a true hero!💜 The girl who once thought was a burden is now the voice of many who are burdened by the evils out there....... You're such a brave and fighting soul! The pain, the trauma, the choas you've gone through is unimaginable for me...but the spirit of rising above all these odds is commendable! I salute you Mam with due respect and humility!! Everyday when I'll rise from now, I will remmber @natashanoel001 you've taught a whole new chapter of life! What I have personally learned is to never give up even if the people out there or sometimes you yourself or the situation make you feel worthless instead be gentle to yourself and constantly love yourself and try work on yourself! Cauz ultimately 'I' is who'll help \"me\". My problems can't be compared to yours cauz I stand nowhere where you do! All I should say (must say) is you're such a wonderful source of driving positivity and love in! You're life motivates me to be a warrior within! Thank you so much @natashanoel001 💜", "adityahegde89": "Respect", "khandrmohsin": "Respect !may god bless u", "jog_an": "Epitome of courage and positivity.... Hugs💕", "bruce1046": "@natashanoel001 respect! ❤", "yasinhabib1129": "Respect Respect Respect Huge Respect 🙏", "sandrasebastiancamello": "Love 💕", "kurukshetraboy": "Natasha 🙇🏻want to meet you truly", "tion_none": "The real Hustler! Stay strong Woman! 💪", "tausifshah85": "Respect 👼", "anitaroseblossom": "This is amazing. I respect you so much for being so strong and humble and showing others that happiness still exists. Keep doing what you're doing 🙏🏽❤️", "dipanjali_saikia": "u r one hell of an inspiration @natashanoel001 💖💖. Have been following your inspirational posts for a while now but hearing your story literally doubled my respect for you. You need guts to come out of that mental block and establish yourself by being the person you really are. Have already met you once (am sure u don’t recall it 😀) but then would love to meet you again 💖...keep shining girl ! 🤩🤩.", "ayush.okay": "You are boosebump inspiration for me.", "mathuralilesvari": "Love to you. Amazing what you have achieved!", "vineet_potter": "so much respect for you @natashanoel001 I m so proud you I wish every women out there become strong and brave as you thank you so much for sharing your story.", "itsrahulkapoor": "Wow. Truely an inspiration @natashanoel001 ...", "i_am_himani": "U r a fighter lady....so much respect n love to u❤🙏🙏🙏🙏🙏😘", "rucksack_scholar": "You are a wonderwoman..@natashanoel001 will always remain an inspiration 😍😍😍", "rknatty": "Great inspiration.. hats off to you", "janak_bagdanawala": "Natasha u r really a strong 💪 n a great 👍 lady...I Salute to you", "beccaphilip": "You are a phenomenal human being! Lots of love! ❤ Thank you for existing. :)", "arif_fitnesss": "#respect", "shoauzainab": "Respect and lots lots lots of love 😃😃", "yesha_1001": "So proud of you! I wish i can also be this much strong one day. You're a true warrior. Thank you for always inspiring us💕♥", "siddybdrums": "Massive massive respect and love to you dear @natashanoel001. Looking at life in a whole new perspective now and thank you! Thanks for possibly pushing at least a little to make ourselves believe that yes, you can do something, people talk and that's how you hustle through. Society doesn't accept a sad person but why pretend then? It's who you are and you shouldn't change just so that society is happy with you. Rather be a change and show the world what every human being can do. It's a beautiful life, and you just made it even more beautiful! You go girl! Cheers! <3", "usasplendid": "You prove it with your charming smile.god bless and keep always this smile on you...it really suits you💙", "mylightonyoga": "😳😔🧡🙏🏻 you strong little soul! I have no words", "d3vilrc96": "Strong bravo🤗", "dharmesh_umrb": "Really sorry. Anytime required any help u can remember ur brother.", "rock.star100": "you are a strong women... respect and love", "sidsrbaruah": "U r a warrior.....", "chandann__": "So much of courage requires to share such kind of incidents and you've gone through such incidents but still you are so strong... mentally, physically, emotionally and spiritually..... and living life with full enthusiasm with a smile on your face every time... it is really so encouraging and inspiring.... complete respect mam.... hats off... this story of yours left me with a shock that how can one be so strong... lot of blessings... keep smiling... stay happy.", "fire_water_burn5719": "Insta ppl should come up with new symbol instead of heart- it should be 👏🏼or may be💪🏼. Amazing you are- more power to you. 🙌🏻", "irosenav": "Such an inspiration 🙌🙏", "arifsuriconstruction": "🎩 off to you dear", "wanderingsaadhu": "🙏", "bhardwaj_mansi": "@akshay_gera1", "iluvred1904": "You are brave, bold, strong, powerful, a woman of substance, Proud of you dear #natashanoel001", "maninigam": "Cheers to your strength and zest... cheers to all strong and beautiful people out there...❤", "deepa.arora09": "Love & hugs & respect! You are a sweeetheart! You are a supergirl!! Wish to meet u some day :) ..i love U!", "_lockjaw_14": "Respect ❤💪", "roydeepika": "@nadiyamutchusehgal @zeannedcunha ❤", "bollytravel": "I am sending you lots of love&hugs, Natasha :) 💜 I respect you so much for what you are doing, thank you for that ! 💜 Your fan from Prague :)", "maitreyi_c": "So much respect for you. You’re very brave. Keep doing what you’re doing and inspiring people!", "endlessindia": "@natashanoel001 love you for speaking & sharing the truth which was not required, but still you shared with all of us what you have gone through. We all take inspiration from you on daily basis whether it is your fitness tips or the real experience shared by you. You are not healing, you are healing others. Thanks to you...", "vinay0502_": "Stay the way, you are, don't change"}