{"eg5454": "You are awesome & beautiful...", "rajkumarkkd": "Well, to reach this perfect body shape and flexibility need lot of efforts and determination, hats off to you for your hard work and to your marvelous and gorgeous figure.", "everything.organics": "Beautiful!☀️", "arco__love_struck_devil": "Leotard ! Eureka ! , I actually didn't know what is that u were wearing called I was pretty sure it wasn't a swim suit :D , anyways big admirer and huge respect for u", "imsakibazizqureshi": "😳😳", "yogesh__yoga": "Sorry to say but who cares what u wear or not 😊", "amangeorge425": "what do u want to show", "aadihmoni": "Wow...what a flexible body u have...", "himanshijaggi": "@somyagupta94 look at her, brooo", "baret.sahit": "So beautiful feet", "mikkymikkypaul": "Sexy", "atifkhan3872": "Uff", "_made3ha_": "Your every move is so elegant. Respect", "travelleryogi_": "@gargee13", "suneelkumarkurra": "Mind blocked", "pauldas_942": "U r OSM babes.......keep up d good work....I LUV MY BODY", "stri99123": "Well done... Do more practice on this type of yoga pants.. i really appreciate 🙂", "this_is_abhi.shek": "Aapke leg dekhkr to wrestler bhi Sharma Jaye 🤣👌🏻", "rishad.hasan.52": "Gondho vutum shona", "rominkumar9009": "yaaaa nothing wrong in these cloths..", "bhanudas.patil.773776": "Wow..........!!!!!!!!!????????", "jadiyalifestyle8020": "Hey Natasha how can't do this", "nandabahadurrajalimagar": "really good xsize natasha you so beautiful & lovely love u so much", "billiehunk9t9": "Awesome yoga is the best", "tapan.raj.796": "Wow superb...", "aamer.bangladesh_wahid_salman": "very talented 👌👌👌", "vikas996988": "But u hv amazing thighs yoga queen. It's a compliment", "roshiniinus": "Hey is it really inconvenient if u cover up to u r ankles @natashanoel001", "indian566": "😘😘😘", "amandeep14": "Brillinat", "vidyamalavade\nVerified": "Verified", "poision_ivy7": "wow😍", "haris_kannamkulam": "Men Don’t Care whether you #online wear clothes or not. First time viewer may comment something but the moment they finds out you’re who you’re they just👉 Maza lega. Some Men follows strippers and you are One ☝️ Among them. By Ur Online Actions if ur parents aren’t feeling Shame why the hell anyone else should feel Ashamed ? You Can Call Ur flexing exercises Yoga 🧘‍♀️ or Bharadanatyam or whatever you like. Some woman sell body to make money, you show skin to make ends-meet. Ppl like you can never empower women but tarnish online women image. @natashanoel001 i hv lot more to say but cutting it short. I know next thing that I could be blocked by you that’s fine for me ‘coz losers hide behind/Censors", "swerdys": "You carry on lady, your body is amazing. Our skin is just that, skin, and those that are ashamed or offended by it need to get over their own hang ups instead of trying to project their negativity on others x", "bad_boy_maddy93": "You need to more control on your cg (center of gravity) I mean ur hip & neck movement with focus. U did great job 👏👏👏👏", "shmurdagates": "🤤", "rihsihs27": "I was thinking how can u achieve this level in yoga... It's almost impossible fir me to even bend ...", "lovelydeogan": "Amazing", "indiannaturalfit": "inspiration 💖", "vini_shh": "Nice", "snehajrathi": "Ooh you're so bendy! I love your outfits ok 🖤🖤🖤", "ankit5129": "Its perfectly normal. Its your body and your right. Let Nobody tell you what to wear and shit like that.", "aks_the_king_of_love": "U r👈 just 👉Amazing 👌👌👌", "univedsports": "You are brave and beautiful", "sneha.khanduri": "Wow ❤❤", "ravi_1700": "So white butt", "jayantasrk4u": "Excellent", "shraddha_chibade": "Go for it🤗 you are doing great...❤", "awakening_child": "one genuine question, how do one pee on this dress... If I get the answer, I would really like to wear this dress", "mohitrana_mj": "Your body is so flexible & you do yoga asanas with grace!! Keep it up.", "sopanvanare976363": "Very super", "grv.10": "Good ☝️", "jesal_vaghela_": "@shivani_ps1", "kartik130": "Music is so good", "dolas_prashant": "Awesome", "sandyforyouonly": "sexy poses man", "ranjana": "Love! (Also, Whats the song and who's the artist?)", "tina_kourkoutzelos": "Beautiful", "mpsp01": "Lucky I am not there or u would be pregnant 6 years in a row 😉", "karen_punneckal": "Go Natasha 🙌🙌💃💃 More power, love and positivity to you 🙌🙌❤️❤️❤️ Keep Slaying like you always do🔥❤️", "lovefromekram": "You’re beautiful 💚 what song is that omg 💜", "randysenevirathne": "Wow.. such an outstanding move 💪💪", "raticusmusic": "Amazing.. and sexy af", "mehnati_mitochondria": "I just love the way u are!! It's good to see someone like. Truly an inspiration. I feel pretty confident after looking at your post. Keep it up!!! Lots of love!!! 😘😚", "mystikmint": "I wonder how people even notice what you’re wearing?! Don’t understand how they can look beyond your flexibility and strength. I noticed the clothes after i saw the complete video with jaw drop and read your description.", "sandeshjadhav106": "Waaooo 😛😛😘😘😘😘😘😘😋😋😋😋😋", "sanjayjamadar15": "Wow", "making_piece": "I never read full captions of anyone post but i read this one and i really like it 👌", "patra4819": "Awesome.... I can't see stretch marks and cellulite...I'm seeing fabulous thigh & leg muscles.Why u talking can't upload? Plz plz plz upload thanks.", "project.haylel.tantra": "Incredible", "dalcyd": "Natasha you're amazing.. and an inspiration to many ❤️❤️XOXO keep up the good work beautiful 😘", "syedirshad.47": "You are strong and flexible", "princess31kup": "😍😍👌👌", "rahul.lalwani_impulsiverider": "Natasha u r simply fantastic...just wow", "pratik_vkarma": "@sajo11.12", "jmrogrs": "@meggysheppy she’s my fav yogi on insta ✨✨", "hsurap85": "This has motivated me to try yoga.thx", "kootenayraj": "everyone has an opinion you do you and that's all that matters in the end", "whitehornjm": "Haters gonna hate. Just be your awesome self :)", "simran_stuckinthe3rdimension": "Loooveee it. Also, man whatta cute bum(literally cute bum) you have. I hope mine can be as cute some day. And WHY CANT YOU WEAR IT. Wow! Let me tell you, my life's a wreck as of now. I'm deep into the shit I created for my self Idk. But you inspire me to do yoga, to do it seriously. Thank you. Love you. You look amazing in this! I will buy one of these soon! ❤️", "karan_vir_chandigarh": "just wow...", "snehal5389": "Supb..", "sundar8616": "Wow super", "bhukabhalu": "Nothing but respect🙏🙏", "raj____92": "Wow", "coachpeepsofficial": "To be honest @natashanoel001 ...I just want you to tell me where all your amazing body suits are from. Please can you tag the brands?", "luv_u_zindagee": "👏👏", "jiasingh": "You are incredible", "vklipsstick": "O M G...... No 1⃣ has ur style dear 😘 💋 💋 💋 👌 perfect 👌", "richer.n.richer": "TBH, bikinis is the only reason I watch yoga videos.", "munishsharma278": "very nice dear keep rocking!!!!!", "nitharwalprakash": "Ky yeah pure kapde pahne ke nai ho skta ky", "erik_i_dont_know": "Bitch is that women", "storiesbynehagoyal": "This is so true that everyone should know how to deal with love and hate... both are required to move forward.. I love this.. don’t know why most of the people in our country want to look fair ... y We are not comfortable in our own skin... Hats off to @natashanoel001 to present it this way... love 💕 you n #respect", "jitenddrachawla": "Hi We are doing free tarot reading sessions for a limited time. For more info pls visit our website. Regards Jitendra C Chawla 9892320922 tarot-coffee-reader.com #india #uk #usa #canada #australia #russia #uae", "mehdi_persianladka": "Passion*", "ruchi.marshal": "Whut? What stretch marks? I see only fabulous thigh & leg muscles that can send your naysayers kneeling down for mercy, at your feet. 😆😍😍😘😘may you & your tribe flourish and prosper. ❤️", "beginnerspoint": "Wow", "ya__gareeb_nawaaz": "Love you Natasha I'm your biggest fan😍😍you're the best motivator thankxxxxxxxx for unloading such inspiring videos you are ours motivator 👍👍👍👍", "aswathi_krishnan": "Amazing stuff dude! Really inspiring to watch you take a stand for everything that should be natural and normal with humour and positivity. Love your posts! Keep spreading the love!", "arwind0508": "Its amazing form .....", "__joharispeaking": "@natashanoel001 dude I was literally at the edge of my seat.. just hoping you don't break anything. You were inches away from either breaking your back or your neck. Phew!! Be careful man.. You're precious to us.", "rocshelbarron": "You go girl!!! ❤️❤️", "pritikakeswani": "Amazing😍😍😍", "tanumay_purkait": "You are very inspiring. Your videos give courage to try something new.", "riiny_amierah": "I love thats song", "vsunil_singh": "What flexibility u r too gud...Ur lil admirer....💪 U r a strong girl dude,👌", "shahnurshano": "Possibly", "sayali_gudhekar": "More power to you girlll😍😍", "eva.fdz.gnz": "Abducted by your calm and moves😵😍 thanks for show it", "kryptonite_kev": "Keep it going.. Care two hoots...", "ketanthosani": "Vulgarity soch me hoti, kapdo me nhi.", "knights_kings007": "Hot legs great body... Keep showing it off.. Ur body ur rules", "vchampion123": "Great", "gayatri_biswal": "Very inspiring indeed.You have tremendous flexibility.", "jaw.pvt__": "Omg😍", "theroshanbhatt": "Omg this is so good @natashanoel001", "dr.mehreenmalik": "Tips on being so flexible😥😓", "nickinikky": "U r awesome swtheart.....never change yourself in yourself for anyone.....u r doing great...n always keep smiling coz it influences us!! Luv luv😍😘😘😘😍", "satyabrata_jena6969": "Woow", "serial.healer": "Those legs look strong!!", "akashcool7": "It's your body and your life jo chaho vo pehnu", "dhirraj.chauhan": "We don't care you put whatever you want to post..", "niks.prabhu": "It's amazing how confident and positive you are! ❤️ Inspired!", "priyagopal6787": "You are beautiful just how you are. Those morons who judge you for wearing what you wear have no trouble at all when a skinny long-legged white woman wears the same. Be proud of who you are and keep on shining. Btw, don't let cellulite and stretch marks define who you are and define your beauty. You are beautiful.", "mksuraj11": "Ignore the haters...! Wear or not wear anything...anywhere...all day long...everytime ! You are da best ! 👍", "amitpatankar29": "Nice shape", "devendraakori": "Be safe take care", "__imajay": "Lol 😂😂😂", "gajendra.bharti_d": "Beautiful", "balasubramanyanagarajan": "Wow super awesome and beautiful dear.. Ur so inspiring and amazing person..👍👌💯💪🙏", "psyshy": "Exhale, connect your core; inhale to prepare; exhale and keep pushing your boundaries 💚 thank you for the inspiration", "vibhav_ale": "Cringes!🙈😍", "bariyaravi1982": "Wow", "bluestone_neil": "Wow", "anahata_yogini": "You are a star!!! 🌟💫 So much love to you 😘😘", "yohanc777": "Sometimes i see ur videos and get so inspired ..then my dogg looks at me ..and says..chalo chalo pehle walk pe to leke jao", "the_august_buoy": "Damnnnnn that #strenght #balancing 😱😱😱😱😱😱😱😱😱😱😱😱😱 @natashanoel001", "jess20_wal": "You are beautiful and your craft is incredible to watch🙇‍♀️❤", "boho_gram": "So graceful and the music also.", "linotchka": "@myinkimpressions", "missfit_maleeva": "I'm just so much more comfortable working out in a sports bra and tiny shorts, yoga or weightlifting.🤷‍♀️ Fuck what people think. You do you boo.❤️ PS. LOVE that yoga mat ! 😍❤️", "blue_g_e_m_i_n_i": "You're indeed very beautiful and i always love every posts of yours and thank you for all these inspiration. Hope you keep on inspiring and achieve great things . 😍👌👌👌🙌🙏🙏", "guptavicky999": "Waw sup", "did_someone_say_beach": "It's so AWESOME!! <3 <3", "_oye_aryan_": "@natashanoel001 how can you be so sure that all people think like this That “omg wali line”. All people are not same. Some people likh dete everybody have right to wear anything to do what they want. No one has said to you like this. You said to yourself like this coz that was in your mind and you put in on your caption. Dont blame people All people are not same .", "jassijesikoinahi": "Omgggg this video is so graceful. This world needs more people like you. You've reached this phase after facing a lot of hardships that no one else is aware of except you. You own it up no matter what. Will love you no matter what. You're awesome and you know it 🔥❤", "roopsigupta5": "You look so amazing! 😍 Also, what is that beautiful song playing in the background?", "parmanandkalaka": "This is not yoga ,this is the bending of body.", "brindasm": "@nata", "harsimran_sandhu.796": "U r gr8. Yoga with bhoga 🤣🤣", "kisvardaizsu": "❤", "iam_varan7": "sexy", "pjthorat": "Woww ... Just wow", "travelwith.w.ravi.foodies": "You have a body to admire.", "saheb9": "wow perfectly done", "fitsy_gypsy": "Previously I was focused on weight training but Because of you now started body weight training too and I must say it is making me more happy than weight training.....", "naweedzariwala": "Awesome control over body", "everythingatoncegirl": "Awesome back bend flexibility yaar!!! And love the outfit! Looks great on you!", "chubbybootwala": "I really fail to understand why would anyone have issues with what you are wearing! What you are wearing is beautiful and make you look gorgeous plus makes the entire video more creative ♥", "mirrorgirl_forever": "Extreme feminist! Extreme insecure! Always sadistic captions! Why this so? You can have graceful post cheerful videos. Anyways I'm not one to judge but stop your self being a victim,rape survivor and blah blah blah.... 🙏", "subin_sam": "Hey, Natasha! You're doing an amazing job spreading love and positivity. I'm sure every post helps at least one person who's looking for a ray of hope. I really have a lot of respect for you and for what you're trying to achieve. More power to you! God bless.", "nikunjharia19": "Woah!! 👏🏻👏🏻👏🏻", "dew_shabnam_khan": "You are beautiful 😘😘", "eshan_vali": "🙏super flexible u are", "__________.anwar_khan143": "😍😍😍😍😍😍😍😍😍😍😍😍😍", "19jayanta82": "Wow flexible 👌💐", "mr_vaibhav_eminence": "Dear can u send song lyrics.....if u don't mind.....bdw. Nice work", "sri_ksv": "Woahh 😳 how you are doing like this?!!! Superbb Yar..😍 I'll I'll tryyyy.. btw ur yoga mat is cool🙃", "sagar_bhandare15": "Omg.. ur body like rubber.. Really appreciate yar ..hatsoff", "preety_atreja_pahwa": "Omg so awsome... I cant see stetch marks and cellulite ... I m seeing just a strong and confident gal...", "mridulabvs": "@natashanoel001 Can you please show how to do surya namaskara?I am confused where to put proper force and stretching?", "bag_of_quotes1": "Omg how can u put something like that....u always give new meaning to health and yoga...xoxo", "malik_for_humanity": "Awesome 👍", "soumya.sarkar766": "This dress looking dam sexy...", "shweta_h1111": "This probably is the best of your posts so far! More power to you lady... 💕", "getfitwithtejas": "I just love it", "pooja_kanawade": "I wish I had this upper body strength and flexibility! 🐒🐒🐒 You are amazing! 😊", "harkesh_bhouria_harry": "Good", "aahanamulla": "Hahhaha .. nice ! Love it ❤️❤️ @natashanoel001", "unmesh.bamble": "Good grief...on a scale of 1-100 for flexibility you are a whooping 200❤️👍🏼💪🏼", "shveta.sarode": "Gorgeous...😍😍@natashanoel001", "arushigopal": "GOLD BABY , YOU ARE GOLD 💙💙", "jhon_chris61": "Inspiration video can u upload more in ur youtube channel thanks", "paramjeeeet": "Strong🔥@natashanoel001", "wanderin.me": "Damn!!!Those quads 🔥 😁", "abhishekgupta5720": "@natashanoel001 What a wallpaper 👍😀", "mumbaiyachhori": "You so sexxaayy! #Goals", "malikkkkzehnaa": "its amazing😻", "iamnotramyakirtana": "I think you're beautiful. Inside out. Don't listen to the others speaking crap. They're not even in touch with their own inner selves.💁", "mahervaghchhipawala": "Awesome You are Super Flexible Respect Respect Respect for your Hardwork and Inspiration", "mohmmadalipathan": "My inspiration❤ thank you for inspiring me and us everyday and every minute with your inspirational posts 👍👍👍👍👍💪💪💪💪💪", "anjuyadav___": "You+yoga+music😍😍😍😍😍😍", "mongamunish": "But I like this sexy yoga don't care about people", "vivekarora30": "Wowww.... What a flexibility.. respect . Yoga. 🙂", "safalfuture": "brilliant yaar...", "hemantsinghdavroyals": "So sexy figure", "suri_singaram": "Wow amazing", "siddhant8334": "Nic", "airoholic_lover": "Which is this Peacefull music💗", "nagpurdoodler": "Hey Natasha first of all I love your rants trust me it's really motivational and inspiring. 2 days back you posted about criticism and how to grow, it was amazing please keep posting such things. And even I'm ashamed of my stretch marks but I still try to wear off shoulder dresses and people try to make fun of it but then I tell them that's normal not everyone likes to flaunt it but I love it. I feel good that even you feel the same way. Lots of love kween♥", "gawdesslike": "This mat is so pretty!!", "simrinvijayakar": "@natashanoel001 you are simply amazing! I miss you and your classes so much!", "mustache.mane": "We don't care what you wear.... we'll always appreciate you and we always love you", "crazykhyati": "Ohhhhhhhhhh my God!!!! U are amazzzzzinggg", "phugeomkar": "That body control. 💯✅🙏", "giriprasad37": "Do u have bones or not!!!!🙄🙄", "razmatazmi": "Oh my god!!!! 😍the strength and flexibility. Wow!", "desai_khushali": "😍😍 strength", "the_scarcasmist": "What cellulite and what stretch marks you talking about, dear INSPIRATION? All I see is a phenomenal woman doing some really tough sport and inspiring me all the way to get out of my comfort zone and realize my potential! All I see is Beauty and Peace in you! You're POWER!!❤", "tigertiger8007": "Superbbbbbbbb", "shedac333": "The video. Your words. Amazing.", "abhisekpanda": "I would be also agree with you that, you can wear whatever you want and in which you will be comfortable in. Great skills to show up. Need to learn this. Couldn't able to do this one. Nor a headstand too. 😣😣", "king_boulder_": "Your body is magnificent keep it up 👌", "theparipassport": "Which song is this!!! I love it", "geovanna_xoxo": "You are inspirational 🙏🏻💛✨", "rubikapathan": "❤️❤️❤️❤️❤️❤️😍😍😍🔥", "aaravriya": "Really you are damm good..", "_czwhynot_": "Haha. You're just adorable. Hugss", "br4nm4n": "😍", "chandni_hora28": "You go girl. More power to you💞", "pratimaanyoga": "What beautiful song is that? ❤️", "nobsharma": "Osm"}