{"rajeshwarikubavat": "U r amazingly brave n bold... Hats off to you Natasha...it takes lots of courage to talk about this.. lots of love n respect for u", "vensila7": "Is ur incredible body achieved by yoga?", "munishsharma278": "baby you look beautiful in both fits--its only matter your's comforts---but i like the most to your 1st prefrence", "sarveshverma112244": "bra me sahi hai", "savouringsimplicity2019": "I feels like i am reading my mind.. all written for me.", "subbasanjy": "great keep it up", "jkrathour": "So beautiful", "matey003": "You live out of your imperfections and way ahead with it. Appreciate it", "harmanbansal8951": "Bra or without bra me", "msrawani": "Both r nice", "toyforts": "Gud work..", "cnkcnk97": "@prasad.k_b @vamshi_kiran78", "aish1195": "This is incredible!", "srik_soorie": "Nice thoughts", "vkl1975": "Without of course!", "ironakis": "Wise always....💪👍👊", "subhash_mandavi_750": "What is your bra size", "thenisha.kumari": "I just loved this post 😍", "chrisonichansenpai": "What about chest exercises? I think it should help.", "rajinder_jassal69": "U r great ❤️❤️. I haven’t word Ur thinking Nd mentality 👌🏻👌🏻👌🏻👍", "srbh_raj": "Love your post❤️", "zainghaffa": "👏", "iamsanjayajena": "A big fan💗", "1aim1love1destiny": "Yay for normalizing normal boobs! The #saggyboobsmatter movement is awesome.", "_rang.ha_": "난 너의 팬이다~ 항상 응원한다🤗", "g.o.d.m.a.d.e": "Without Bra. Free them from shackles.", "itsmeclorene": "I have a small frame with 34 G boobs. I relate to you so much!", "a_chaudhary_": "Perfect", "qaisaransari241": "You are very hot, my contact number is 8298 975 996", "doctor.dang": "@natashanoel001 So beautifully expressed❤", "ganeshsatkar70": "😂", "alka____yadav": "❤❤❤❤❤", "sahil_sharma9034466813": "Hutt sale fuddu log phr volti hai ukta bolte hai gwar log", "agnihotri.lohith": "Cool", "nadeembokhari333": "Without bra", "ca_sabby": "Abs", "aniruddha.aot": "Doesn't matter, still sexy 😍😍😘😘😘", "enggfuzail": "Beautiful", "nlshkmbhr00": "Doesn't matter", "rahulnagpal06": "Inspiration words☝ @natashanoel001", "vini_shh": "Sxxy pic", "rahulchoudhary4642": "Without bra ar u sexy", "mokshadosa": "Actually think without looks better!", "vijayasekarang": "Hi , u r a good entertainer in name of yoga... U exposed 90% of ur valuable assets without cloth and rest with clothes(which also not did it's purpose)... Hope u do well in future... Expecting more from u ....", "prakash____chaudhary": "♥️", "rahul.parjapati.51": "Nice with bra", "munishdograofficial": "🙏🙏🙏🙏🙏", "pvggn": "Your heart touching words applicable for all. Not for particular gender. Keep motivating", "syed_rahman_hasan_kazmi": "Iron lady... Lot of luv", "deepaksoni91": "You are awesome.. always.. #Respect", "spiralling.words": "It’s taken me years to even start accepting my bumps and such. And although I don’t always feel great about them, most of the time I think of it as part of my personality. But very much in a positive way. It’s a feature! Improvement is great but not when it stems from self-hate or fear. Well done on coming to this conclusion at such a age!", "shaikh_mh_sajid": "Nice shape", "__being_me.__": "Love you unconditionally...", "tanzeem_0fficial": "Yes nipples", "s_sd_des": "Omg", "arif_fitnesss": "Patli ho gayi ho, abdomen V line is visible. Thats cool 😎", "shiv_sonu_": "nice", "bhavesh1052": "Suppr", "shanehaider8872": "You each a high time woman I respect you🙌wo to kuch logo k khada baal hota h jo negative comments krte", "dileep_kumar453": "💑", "joshilayz": "Always an inspiration for people who don't talk out. Keep going. Keep strong. Never mind the naysayers.", "thebig_akr005": "U r just awesome n ur thoughts r damn cool👏", "mothersupreme3": "@natashanoel001 thanks for this 👍👍😇", "marrylandking": "@natashanoel001 its breeding science and long time of great evolution output. Nothing to worry. You had lot of wrong worries", "devrn995": "Mem.. Don't listen.. Anyone u r doing grt job.. I am a big fan of ur.. U r amazing flexibility", "murarka.ashish": "Nice job", "raj____92": "Hot", "abhishekgupta5720": "@natashanoel001 with bra👍👌", "casa_king78": "Respect to you but our indian culture not permitted without this🤣🤣🤣and with this you are most beautiful women in this world.", "neeraj_dohare": "Lovely body", "anand.anchal1991": "#respect women are shy to say about this... But coming up like this with such a nice write up it's amazing.... #morepowertoyou loved this post...", "ramesh_kasnia": "Wow", "shenoy_sanjay17": "Highly appreciated...take care", "_liiliika_": "@wholesoul_gypsy I love her!! She’s quirky, funny, strong, and so real. I like her workouts too! Such a breath of fresh air here on IG, no? 😍❤️", "avinash_bhandari": "So fit soooooo hot", "sourav4364": "funny", "ashok5046": "big boobs..i love this", "prabhasha": "Amazing word up.You are one big real Virgina.Much love.", "ankushjain9021": "Kalle sadeee hue niple hoge tere.. idiot gal.. divorcy.", "siddu_bangalore": "frankly saying u r great mam and if i got chance to learn yoga with ur guidance defintely i will......", "mr.mkswamy": "If same guys do , this will be treated as bad guy. Many appreciation for this snap, strange behaviours right", "prachiyogini": "Omg your confidence ... hats off @natashanoel001 more power to you girl", "arzeroeight": "I like u with ur yoga and without out mind that's love", "aashukia": "👏👏👏👏👏👏👏", "nitharwalprakash": "Natasa ji aap yoga guru h nt a sunny Leone", "sallugaga": "@natashanoel001 we r woth u", "abbasrameez": "KUDOS to you for putting this up....👍🏻", "keval_thakor_": "It’s your body nobody can stop each to do what ever one wants. # huge respect to you stay blessed .", "ayaz778612018": "Oooooooooooooooooooooooo", "mitbd80": "Best wishes", "beast_on_track": "Both ❤️❤️", "aphrodite_mars": "No naturally all girls have one boob bigger I also have very heavy breasts 44\" and heavy breasts sag it's natural u can do some exercises like raising both hands up like kathak then pull them in alternate directions", "bluntsofabong": "We in this together 🙌 much love 👻", "lenin_chembiyil": "Men will be men, be it saggy or perky your husband(if not married now, Ur future hus) will love it. Will love you not for only that but the complete you.", "shuvo__roychaudhury": "Not much different", "giriraj.gupta994": "Hot...in both", "leticia._m": "Not because I hate it I love myself.", "jay_patni7": "Looks great buddy 🤘", "devendra_suryavanshi": "Bra to dono me nahi dek rahi", "zombi7302": "U don't have big boobs", "chitrangimungekar": "Much power and love to you!!!!!", "a_boy_named_lsd": "without panties", "warrior_prinxx": "This truly made my day, I could relate every single thing you talked about! Thank you for being so candid ❤", "sanchubaba": "Now days the food we have and the medicine or the plastic bottle we use increase estrogen level for both ale and female so thr chest and breast is becoming huge", "outdoorbrodawg": "#REAL", "shivap343": "@adibhalla", "ronit9057": "Sexy 💣", "anurupa_bhowmick": "Can someone address the fact that all the big sports brands like nike addidas puma etc do not make bigger sized sports bras!!!??", "mithileahrawal": "Are chaddi pahni he", "maheshchangalath": "Ha good change", "prernarai12": "@ishasen95 soo true!", "soumick_neel": "Too hot...", "irosenav": "More power to you girl.... FYI I trade in a blink of an eye... I have no tits 😑🤣🤣🤣", "salah__dheen": "Truth unhidden in women...spoken courageous 😎", "bguncha74": "I have so dreaded my childhood years and beyond, thinking i am the only lady human blessed with bearish hair growth, ruining my memorable years on self despise. I wish I would reverse those wasted years and relive them with more light and perspect.", "chetna_sonu": "@natashanoel001 and I found u benchmarking your love through your soul in such a positive way that.. love is the only weapon for u to conquer the hearts which is just awesome.. speaking reality needs guts and u are loaded with it.. I m so much happy with all what u caters to us and help us resolve the issues which are constantly in our head... This thing is a big issues as people specially female are image concious but there is a difference between reel and real life which u made quite transparent here... Thanks for sharing.. 💫😍🙏🙂", "jayanandsupali": "So can't the sagginess be solved by doing some upper body exercises???", "venkat_thelastronin": "U r perfect in every way", "krishna_sharma.insta": "What is more comfortable with or without bra?", "brijeshsonu_08": "Respect to you...... 😊..lots of love and respect", "ravi_inn": "Stay natural without Bra 👌👍💋😘", "i_am_mayurkapadiya": "I like without bra", "saurabhmehra8325": "Ur a doll", "amitji001": "I am big fan of u mam I lov u", "anamiikashukla": "Maja agya natasha", "pritamtushu": "Agree with u... & Complete true", "mr_lazy8": "Your boobs fit looking very sexy", "sushantsar": "Without Bra", "ashish_salve6": "Just a simple question how ? How u do it ? Ur really killing it 🙌", "bverma20": "Relatable😛😫", "saraswathysridhara": "❤❤❤❤❤", "bharat_r_s_": "Pgl ho tum..", "take.it.easy.urvashi": "👏🏻👏👏👏👏 diii you nailed it ... This is the reason dii I love you and I followed u ...😊💕", "alandmash": "Much love. All women needed and more", "raj_veer32": "U r always look sexiii", "blissful_art_": "I love you beautiful soul", "souniya.khurana": "Ohhh holy mother of god.. how you just said every word of what I feel about my ladies.. thank you thank you thank you..", "kaur_robinpreet": "😗😍", "hungry_24_7_": "I FEEL YOU", "karaskarabhilash": "Sahi", "palak_shettiwar": "How can you be so inspiring woman?", "anticipatorybhel": "I see there are so many negative, objectifying comments and even that doesn't deter you from posting such solid stuff. Much respect and lots of love and encouragement for talking about such taboos. It's high time women take the steps to bring other women up, only then can there be any hope of change!!❤️❤️", "anonymous_abhi": "Making your flaws and insecurities a weapon to rule life. This is great. Lots of love ❤️", "blane_richard": "There should be a character Natasha on Family Guy! You are so dope!", "vijayetachaudhry": "Love all you post ❤️", "thefieryifrit": "You speak about the real issues. More than that I loved your use of all HUMANS with uteruses. Way to be trans-inclusive! YOU ARE AMAZING ❤❤❤", "whoopwhoop32": "It looks fine to me🙂", "charledell": "Wats ur next pic?! \"Wit panty and witout panty\" 😅😅😅", "inderjit8004": "Kudos to you. To fight ur insecurities and facing them head on. It's a lesson for everyone to learn and share your spirit. We always want to look good, but we always have our own body insecurities. We need to accept, embrace and love ourself the way we are built.", "sbprsqohpdf": "Beautiful 💖😘😘😍😍😍💕💕❣️👌🏽👍🏽💪🏻", "muralishastry": "👍👍", "knights_kings007": "Who cares with or without.. U r damn awesum😍😍", "sushmithaseshan": "Thank you, this made my day better.", "cindusmir": "much needed confidence boost💯🌸", "krthkh": "I could totally relate this to my man boobs , #manboobsmattertoo", "linodavidnelson": "You are amazing with your words I recommend every guy in town should read your posts. It may create bigger difference on the present day attitudes towards woman. \"True feminism is making the opposite sex understand your feelings, not getting offensive\".", "aditiya_ashat": "I'm 1000% sure .. you definitely bring extreme change in women's life. Keep going @natashanoel001 🔥💪", "antisocialbutter_fly": "You just blessed my timeline with your post! You're not alone, this is a struggle probably every girl with big boobs faces growing up and it takes a free mind and a positive attitude to love and accept them! 💝 thank you for sharing 💟", "shivangibagi": "@abhijeet8669 Read this 💜", "dhurbajyotiborah83": "Nice nipples", "tulsi_abhishek": "Beautiful you are , we need ppl like you #loveyourself", "koushikghosh07": "Not much visible but luv ur confidence", "gawdesslike": "Yasssssssssssss!!", "dr_arya92": "This one is for me.. Awww thanks to you.. There is someone like me except im still not used to it.", "nihalofficial_1": "Feminist....that's wat I can say..no offense", "akbar.patel2": "😀😀😀🐀😀😈", "marshall_ranjit": "I respect u mata but such pic do not gel with ur image", "vishaka1891": "I'm in love with you :)", "mrcool_rohit": "stiff boobs in both pics", "bharviee": "Girll .... i love u soo much ! 😭😭", "wickysolanki": "Hahahhaa thts very true 😚😊", "krupajadhav": "Love this post, so true", "abhijeet.arts": "Well, I am a guy, so can't say much about boobs coz m Not having one. But, I just can't understand why women are so conscious about their body. Ok, fine, one must keep their body fit, try to eat healthier, but why they want to transform their body completely to look like someone else. I being a guy, strongly feel that every women is beautiful, every body is sexy. Shaggy boobs, stretch marks, scar tissues, cellulites, they are extremely attractive(and trust me when I say that). One must try to stay healthy but trying to look different and starting to compare one beauty with another, underestimating oneself and in the positive process of trying to be healthier, starting to hate own body, that is quite illogical. Consumerism is partially responsible for this, where they will show you a slim body smooth skin perky boobs and would feed your mind with the thought that- this type of Body is only allowed to be called as sexy, if you are not having similar body, you don't deserve to be called beautiful. Then they would show you the products that can make you look like that. Plz let me and my artworks tell you very strongly. YOU ARE ALREADY BEAUTIFUL. Plz ignore them. You can hit the gym to stay healthy, grow stronger but that doesn't means you can't love yourself now. What are you insecured about? Wear confidence and you will look beautiful in any dress you wear. Keep smiling and you will look pretty always. And, I want to remind you again, YOU ARE BUAUTIFUL. ☺️", "dami_731": "What you think is for the real comfort/without", "vikas996988": "Both cases not visible", "viktortude": "My view has changed after this post. 👍🏻", "themanwiththecurlyhair": "Acceptance", "pushparajvino": "What is different with that? Both or normal", "the_humble_yogini": "Exactly my sentiments.. I have been dark skinned and I am still.. as a teenager I had insecurities with my complexion like any other dark skinned girl in this country. I had crushes but never had any bf as I always felt I'm not pretty enough for any guy to ask me out. One day I suddenly got rid of this thinking and I accepted myself the way I am. I started believing in \"dusky is sexy\" and it felt like the world around me changed. Since that time and till today so many guys ask me out. I have dated one of the hottest guys in the lot. Well it is not just about dating guys it's just one of the things related to looks and what we about ourselves. But I'm more happy and content since the time I have accepted myself rather than trying to change it to fit in", "tallgirlinsaree": "Imperfect? Girl, you look beautiful. That's why I came to your profile upon seeing just the thumbnail. I wish I looked like you! Know you're pretty and carry that swag!", "ketanthosani": "Bra or bra less, doesn't matter,u r best girl with best nature and soul beauty", "akhileshanaswara": "Nicely written 👌👌", "iriephoenix": "This I can relate to whole heartedly. Thank you for this 🙏🏽", "theautumnivy": "Natasha!! You just nailed it girl! Just so much truth in what you said, without any hesitation, especially the part when wrote about the boobs looking at the armpits while lying down😂😂😂 that just got me laughing so hard.. thank you so much for helping us women understand and accept our body the way it is.. God knows we all need it ❤️", "nidhicookie": "I love your posts soo much!! you're my favorite person on Instagram 😭❤️", "shedac333": "Transparency ❤", "divchandra_womenofindiasummit": "👏👏👏", "saloni.03": "Thank you for this!❤️", "ritikamurthy": "Was waiting for this post every day since you mentioned you would do it . This has been an issue . I always looked for someone or something to blame for it ( mostly my mother) and in hindsight she deserves none of the blame . It natural , its human and unfortunately it’s hidden and not glorified and discussed or mentioned as often or in the same context and the nice perky boobs !", "_.soumik.mandal._": "U r looking nice in both the picture", "abhijithgupta": "Ur guts is commendable", "pratik29970": "@sakshi.sinha", "drmiurujayaweera": "Love You for this.", "komalthecoolk": "If you were are peace with yourself, you wouldn't be constantly talking about these issues. You're still putting up a defensive wall and trying to look like you're not.", "akagamirz": "Not much different..lovely 😘", "sassymomworld": "😀 I love ur confidence..... #truediva ....", "raghunair": "So well written...so well expressed !!! ☺", "deepakprtp": "Wow yar, I feel amazed with your way of telling your thoughts and I can feel it though I am male. BTW you have nice body. It's always good to read your captions. Thanks for sharing.", "adrenaline_junkie_13": "salute 👍🙏", "vronny3822": "With bra or without bra u still a beautiful soul my frd", "mahesh7800": "exactly", "sai_pulipati": "I love your confidence...", "natashanoel001\nVerified": "Verified", "chidanand_2.0m": "Hi mam if you are looking for photoshoot please inform me mam", "e9jeunesse": "Check out our new products 😉", "remeshvivekanand": "Nice lovely😘😘😘", "ifernandaxavier": "Same to same hain. Hard work always pays", "vineetavaid": "You are bomb of a person inside out! 💥", "stylesnsmileschennai": "Bold girl", "shreya.sakpall": "Yes girl! This is the reason I follow you 🙌🏽 nobody understands the struggle 😥 only we can make it better for ourselves. Kudos to you for putting this up cuz I even hesitated to put this comment up. ❤️", "parvinsinghrathode": "Hottt"}