{"sam.iron": "Sexy.. tattoo... Hot", "sanath15487": "lovely tatto nats", "ruz_de_cruz": "@natashanoel001 what does that tattoo means ?", "dinesh_s9": "Nice tattoo yaar", "fawaad_khan12": "@janvi313 please you feel sorry about what you said to me... I mean Come on go through her all pics she can wear full clothes and do the yoga.... Sencless", "z.a.allahuakbar": "Very very hot", "yagyadeo007": "Osum poetry", "janvi313": "@khanqutub it's her choice if she wants to wear shorts or full pants or whatever.... log ab kapde bhi doosre logo ke issab se toh nahi pehenege.... fact is that no matter what the girl wears, shalwar kameez or dress, some men have such bad mentality that they think and do dirty things only. Kapde se aap kisi insaan ka character nahi jaan sakte ho... kuch mard toh poori kapde wale ladkiyon ke saath bhi zabardasti karte hain.", "_smrna.s": "@natashanoel001 posts like these make me want to love my body as well. This picture symbolises so many beautiful things at once and I feel it is paired with one of the best poems you have written. This is not just an inspiration but an awakening. I'm pretty late in seeing this but after reading most of the comments above, it is horrifying to see how people can take so much of their time and energy to make another person feel hurt for something they have done with an intention to spread love. Like how it said in a movie ' there are so many people to love us among the world of hate, we just don't see it '. But it's not like you were affected by these filthy words, but there are so many people who wait for your beautiful posts to read something that they always wanted to hear. Lots of respect to you for making this world a better place. I'm safe and humble cuz you reminded be to be so. :* ❤", "harpaljadeja09": "How does it feel to have worn almost nothing & making a mockery of indian culture?", "nihal_1_1_1_1": "It's nudes u r promoting for fame that's it, nw let's Instagram field decide", "drshn_shah": "lucky guys next door 😂", "meremortalinthewaking": "Just about perfect, the words @natashanoel001", "_aman_preetsingh": "Ufff", "yashik_m": "Detailed piece of ink👌 @natashanoel001", "raj_8309": "Wow", "ghdaghh56": "Wow 😘😍👄👄😋😋sexy", "artsy_quotsy": "That's an amazing tattoo. Can you post a better close up. You have any other tattoos?", "deepakpinku_007": "Beautiful", "saipreet_ajith": "#respect. To all those here who have a problem, I hope your thought process changes. @natashanoel001 you're doing just fine. Keep going. More power to you!❤", "shellysra": "Samne wali khidki Wala toh enjoy karta hoga apko dekh kr", "jasmine_12.16": "I thought you were talking about sex but it's an amazing poem", "thakie101": "U are amazing", "humanonaquest": "So, somehow I stumbled upon your post, checked your account.. and admiration is just really a word to express my lookout right now. And this poem is beautiful, the words, the kind of landscape your words express, it's very beautiful 💚", "ravipatelrd": "Nice", "madhuri.roy": "@shrishtithakur", "rominkumar99": "Yoga", "raja_sandeepkumar_pal8033": "Nice tattoo", "mangleshchaurasia": "I like your tatoo and you look beautiful in this tatoo", "rohanparihar2": "Gawwwd loved the tattoo 😍😍😍", "raaddha_c": "Bralessss so hot!! I m so fukin hot", "ronnie_alex24": "next time make it even better", "brentley_e_t": "@sj_orpen i thought you may like it :)", "sj_orpen": "This is stunning @manu1034", "one_of_the_12": "Beautiful.", "the_toughest": "What the hell are your neighbors @natashanoel001 whaaaaaaaaaaaaaaaaaaaaaaaat", "benatious41": "@chandani_92", "perrywankenobi": "Nice! Cheers! #fueledxcoffee ☕️️👌🏾", "chaiwithchands": "@benatious41 haha I already follow her love! She's badass af.", "metreee": "Her tattoo👌🏽@assyrianqueen", "vishaldeshmukh22": "What a poem. . It's so well written. . @natashanoel001", "camfreak247": "Superb poem", "ange_dsouza": "@natashanoel001 One word #respect don't listen to this negative people around you.. Just do what you love.. They hate you because they ain't you.. They can't do incredible yoga like you do.. They are only jealous... So don't listen to them..", "_wanderingzen_": "Which tattoo is it on the back?", "poornima82": "@panchalzubin it looks like Buddha", "suklaclicks": "Try using \"fill flash\", since the source of light is behind the subject (the window, your back being the subject)... Lot of detail (contrast) of your tattoo is lost (it does not stand out), the shadow looks more like it is in a shadow. Auto flash might work (correct / better way is to use flash compensation) .... Also you have a horizontal floor and grills which add to the picture when alligned ... (Your tattoo is interesting, wanted to to more of the details in yet... Hence the unsolicited gyaan)", "ujazz73": "Well written,love to learn full version of warrior pose in video.", "_fida.mane": "@tarajames1702", "nidhimohankamal\nVerified": "Verified", "rajput_arun_singh8596": "Oh my good so hot", "fasilusman.kp": "If you have that money to buy a flat, then go and get treatmnt for uwa phyco thought. Brroi", "rohit.sle": "Love", "spyder_mindbody": "I love that the narrator writes about how her love offered her protection and a space for vulnerability but the poem itself is a public expression of vulnerability! Don't need anybody but yourself!", "vibhor_mnm": "Loads respect \" A Fan \"", "chandwani4695": "Nice back", "tanvijona": "@deepak_m1216", "nilesh_artist": "Wow I can drwa @natashanoel001 m artist", "imakhan777": "Nice art🖌", "dr.febin_magj_wellness": "👌👌👌", "princesurajvishwasrao": "Luv ur tattoo... 😘", "rdbamit": "Bold", "iamgovindayadav": "u r fabulous @natashanoel001", "shruthi_venkatesh_24": "@voldywasp @niyati2622 her tattoo", "vicky_sandhu8811": "osm dear looking so hot and sexy", "shashinambiar85": "@natashanoel001 unbelievable", "iamdpkageleda": "@vibhor_mnm it takes a lot of courage to do something like this, to be comfortable in your own skin! No one need to act like a stereotype women!", "isha.chitnis": "To the people who think that nudity is not \"decent\" and that a nice lady like her should not be doing something like this- all the carvings of Gods and Goddesses which you travel to see are all nude aren't they? You still worship them, don't you? The exact problem with this country is this disgusting hypocrisy. If the Gods and Goddesses can be so comfortable in their own skin, why can't a human being? Clothes are a human invention- they were made for protection of vital parts, not for covering the whole body up. When you were a baby, your mother had to breastfeed you, right? You didn't seem to think that showing the body will be a problem then. It's a natural thing and you don't get to judge anyone because you've put blinds on your eyes and think that you saying that someone is decent or indecenct makes them that.", "cypher284": "Beautiful Picture @natashanoel001", "filterchai": "@natashanoel001 from where did you got your tatoo done ?", "rahulzach": "This is so beautiful", "iamnarendrabhai": ",I want to to something", "neeraj_narwara": "@natashanoel001 I like you're tattoo", "rodriguescandice": "@vibhor_mnm sorry but how does nudity make anyone less respectable? It takes courage to let the world see you, all of you, and I think we need to be supportive instead of passing judgement from our high horses.", "tapan_randhawa": "MOTIIIII😉😉😉", "tarun.mukhiya147": "Incredible India😍", "kabir_khatri": "awwwwesome tattoo", "ilovejuice69": "Lucky neighbors", "dhanu.dhumal86": "Lovely", "upeksha555": "@natashanoel001 you are amazing. We love and respect you", "danishjain93": "Ohhhh man!! U killing it Nats 💘💘👌👌", "aunshu": "awesome", "nathanielrodrx": "@natashanoel001!!! Someone got lucky!", "av08": "Love the tattoo on your back..", "feliciavakil": "@goanforever I think you should ponder upon your words,ponder upon yourself and then maybe judge others. ✌", "theycallmeveed": "Wow. @thatswhatsiegesaid You better make a thing before someone steals it. Also, did you read the whole thing? It's beautiful.", "dikshantsahu": "Chai... sutta....love...sexy", "tenphel": "You looking sexy", "aksheymandhanya": "Hatts off you respect you a inspiration your work your way wow awesome..", "sanalt82": "U look stunning as always", "somn3723": "Fab", "i_am_sjn": "Hold on to u tight... respect for being urself (y) go go go !!!", "theravinderrathore": "@natashanoel001 -you the inspiration for ol . U r the traffic elastic lady 😉 .your pose ,breath ur body is full moon which brighten to everybody. U r the that rose which is given to someone with full of faith and love.u r the that vapour which also comes from ur \"cigarette and Chai\" lolz and through water cycle again turns in the beautiful rain.💐 love and respect to and ol inspiration.", "21mgoswami": "Awsome", "tandlekarsachin": "No", "sajith.nambiar": "Lovely word and an awsome pose...lines are really inspiring @natashanoel001 🖒🖒🖒", "sahil.sharma4213": "Artistic expression @natashanoel001 . #lovedit.", "sreejithravindran": "Bravo⭐️", "_neel_1985": "Classy tattoo prettiest @natashanoel001 😍😍❤❤💯✌", "prekshakpreetham": "So beautiful nd artistic..", "natashanoel001\nVerified": "Verified", "sams091238": "spiritually artistic👌👍... looking awsm ....😋😍😍😍", "brittoabhijit": "Is it urs real???", "praveshagrawal07": "W T F", "chirpypunnu": "Girl you're a rockstar!! Please write a book soon. Your writings are so refreshing and everytime I feel low I am elevated a degree higher just by reading your posts!! You're like a bright beam of light in a gloomy atmosphere.. your boldness feels contagious, so does your smile! Be the wonderful self that you are.. and keep inspiring us with your brilliant poses and writings along with them! 😍🤗😘", "bagwesushant": "beautiful", "yohaninsta": "Thank you for inspiring me", "alohomora_life": "@ashwin.gk read this and chk the tattoo", "kelkardevendra": "OMG", "aayushichawlaa": "Perfection , thats what you are❤️ Such an inspiration @natashanoel001 ❣️", "a8_d7_blackcoffee": "Just one thought. Why does @natashanoel001 she have to be careful always, of the guys outside!!! Why cant the outside guys just keep their eyes in place. And she can just be the way she wants. Why always should a girl stop herself. She is very much within her house walls. She can be doing things the way she wants.. I dont see anything wrong here. But again, its my thought. Not everyone would agree..", "aastha018": "@dylan_urvashi caption !", "dharvidogra": "Oh my God! Why are people so sensitive towards everything man? @natashanoel001 you are one beautiful person. I have been following you from quite a while now. I love the way you have made yoga reach to so many people in different ways and now after reading this 'Chai and cigarette' of yours, I am in love with you even more. ❤ Your words show the purity of your soul. Keep up the writing part. I'd love to read more of your blogs. ❤", "urwashe": "@aastha018 woah! 😍", "rajivs04": "Bohot khub....👍👌u remind me of her....👸💖", "harshal_20": "Tattoo 😍❤️", "amybkeys": "@natashanoel001 So true...we are conditioned to constantly negatively critique & judge our bodies...our most natural and beautiful gift! But u are a Pioneer for us all men & women...bcuz once we love ourselves we can remember we are all one human family. Thank u for your work & damn that light u shine is StunninG 💚✨💫💚", "simply_harshu": "@natashanoel001 y do u even bother to reply dear.", "nish_3310": "Nice snap: I m looking for a beauty of your body curve which i seen in every pics ...@natashanoel001 but this pic is not express your beauty exactly. You are really more beautiful than this pic described you. I m your follower and i hve proud for it.😘😘", "vinay0502_": "Nice tattoo", "thesiegemusic": "@theycallmeveed chai sutta", "ritesh.dhar": "Bold and Beautiful. Yoga Love. God bless you.", "mscochin": "Beautiful! The words and you.", "saurabhkanth_1703": "Delight for ur neighbours", "mum2zs19": "Stay who you are. Fearless.", "arun_captures": "This pic is really awesome and at the same time it requires so much of guts for a girl to take these kind of pics... just a thought from my end don't take it negative... is that pic was very much required for u to pose? Bcoz u have very good followers and many followers...", "docshweta05": "You rock, girl !!!", "sid___22": "Wow", "syedshahjaffri": "😍😍😍😍😍😍😘😘😘😘😘 @natashanoel001", "yrc2356": "You amazing", "pankajkatkani": "Yaar ur also daasing", "owais.husssain": "A real Yogini", "anuragthephotographer18": "Kuch toh log kahengay unka kaam hai Gand felana", "ravidwivedi2288": "@natashanoel001 fabulous work ...what a creative mind you have ...nd how deeply it has been penned down ....hats off 👏🏻👏🏻👏🏻👍🏻", "tristan.95": "Keep up the hard work! #nevergiveup @natashanoel001", "candyforsandy": "Beautiful", "rajendragantayat": "Wonderful Yogini. Proved. No words to speak.", "dwivedidivya": "I really love this poem! Amazing. Loved it! ❤️", "prachiyogini": "Salute your confidence girl , such a inspiration @natashanoel001 love you", "beardedaviat0r": "Amidst the controversy created by retards, and those beautiful words complimenting that fabulous picture - I love that tattoo on your back btw! Everything about this post is beautiful in its own way. @natashanoel001", "jenyogagirl": "Beautiful 🙏❤️❤️❤️", "shrutidatar": "Keep going girl! More power to you", "pawanchawla1": "Hot", "abstruse84": "Blessed are the neighbours", "gandhi3124": "Superb", "mahendra_2227": "Ooooo full fire", "theadventuremonk": "Love all the way .... You are beautiful inside out!!", "_ksha": "@yoyoyogayo pity ur existence with every atom in my body, or any woman's body really!", "curliciousshanan": "@natashanoel001 love love love the poem.... love the pic.. love everything about this post...", "tinairie": "LOVE love love love love love love love love love love love love love loveeeeeeeeeeeeeeeeeeee!!!!", "jovinaf": "Dude, you have some serious patience. Reading this made me tear up because of how incredibly beautiful it was..until I went through the comments and now I'm livid. Im honestly just so incredibly angry. But I'm not going to say I'm sorry for you. Because I'm not. You're a woman of solid substance. Keep doing you!", "_that_bong_girl_": "👌", "its_me_nitin_vanam": "Keep up the work.....", "run_fatboyrun": "@yoyoyogayo why am I not surprised by your reply bro? Maybe because there's a 'Yoyo' in your name. There's another yoyo in this country who too happens to be a douchebag. So well done.", "sashaberry05": "@goanforever if you see this photo and all you see is naked then there is seriously dorm things wrong with your mindset. It's ppl like you that help create such silly thought process. Here a is a girl expressing herself in her truest form. Men constantly pose in their shorts /underwear is anyone questioning how their parents raised them?", "victor_yankeee": "Nice view for the neighbors though :D", "sime_suresh": "@natashanoel001 this is why I love you 😘❤️", "rakshu_doc_k": "Wow this is just mindblowing @natashanoel001 so truely heartfelt... wow.. another side of u for us all to love n adore 😍😍😘", "rohula13": "Lovely poem..i think it should be chai and sutta;)", "subrothob": "@natashanoel001 too awesome. Fantabulous amigo. Stay safe and blessed and keep doing what your heart say. U truly inspire. IT Soo good to learn things from young mind n soul. 🤗😬🤗🤗🤗🤗🤗🤗🤗🤗😘🤗😬🤗", "arclights": "Beautiful writing... Keep writing and keep inspiring. @natashanoel001", "amanv._": "❤", "amityhathos": "Uptill now appreciated ur jaw dropping moves but this time👍👌 for the poem", "reshmathomas_": "People defending natasha please dont pay any attention to that person because according to him or her natasha is a attention seeker but According to me the person tagging everyone and natasha Is a big time attention seeker", "poojask03": "Beautiful poem ❤️", "annikapanikker": "@natashanoel001 ❤️❤️❤️love it", "sayantim": "How to do ashshtanga @natashanoel001, it is so inspiring.", "seventhserieswithposerina": "Beautiful..... ❤️", "nileshdave.086": "Wowoowoow mem awesome", "thisiskalpak": "What's that tattoo about?", "beadamant": "@goanforever and who are you to question her parents or anyone else's? Who are you to call a human less of a human just because she's embracing her body with great spirit, you for sure can and should express your opinions but who are you really? What right does anyone gives you to parent her or any other body? She's a great human being and I say that with the kind of positive energy she displays across. With such great humility, she addresses us all as one. So who are you to diss the idea of peace and spiral your venom in this platform?", "akasasing\nVerified": "Verified", "farhan0096": "@faiz_akram43 @immo_1", "iamcaveman_": "@manish7987", "jokesingh\nVerified": "Verified", "manasi24": "@pradnya101 @kalyanisap @cool4life_avi @swapnakulkarniajgaonkar", "larissa_wlc\nVerified": "Verified", "waqi_hussain": "Tattoo is killing me😍", "quinquenium": "@goanforever i reported you for ranting and complaining about artwork. get an open mindset girl, maybe go smoke some weed and loosen up... good lord 😂😂😂", "musta_been": "Tere ghar ke saamne wala ghar to be sold on premium 😜", "anil_neil_kumar": "@natashanoel001 @_f.a.v_1996 remember they hate us cause they ain't us 😂🖖🏻keep rocking 😎", "vermakartik1601": "@natashanoel001 APK life hai AP kuch b kro.. n its about comfortable hum kese h . Koi mota hkr b khush h koi 4 pack 6 pack abs se b santusht nh", "kruthi_kaveramma": "Omg so beautifully written..you should totally write a book..😍 and one thing am sure you're wise enough to already know but just thought I'll tell u anyway is that no matter how good you are people will talk shit so just please don't even bother replying to them ..I went through every comment here n saw that most of them have appreciated u(both boys n girls) so you should just be proud ..and about people who have called u names this is exactly the kind of mentality that needs to change in our country for girls to grow but won't happen because of such losers who expect women to cover up n stay at home n achieve nothing but just be slaves so yeah..again super proud of u 😘 lots of love and power to u 😘 @natashanoel001 And @_f.a.v_1996 please stop wasting your time because that woman is a judgemental looser who just wants to spread her negativity so there's no point talking to her anyway", "bhupendrakadam": "Your such a great story teller, you make people imagine things through your words! N I feel that's the biggest achievement of any writer or speaker! I was totally involved in it! @natashanoel001 keep inspiring through your post and keep motivating through your fitness! Thanku 😊", "_apostate": "@natashanoel001 what does your tattoos mean??", "sharman_dey": "I love you. I think you're beautiful 😍", "tanyasharma1606": "Fucking Awesome.🔥", "anirudhchandra": "If one join Yogaclasses they will make You like this", "rahul.salunke.370": "Your back is sexy", "rajesh6231": "Good poses", "geek_consulting": "Pretty cool :)", "dev_kumar92": "Awesome😱🙌🙌", "titikhn_": "Cool❤", "yashasvirangaraj": "@_f.a.v_1996 well said:p", "dave_bhartendu": "That guy at window, luckiest person.. 😍", "mrittyunjay2614": "That tattoo explains it all", "aakashh_dhumne": "😍😍😍😍", "dkant1106": "Nice lines...", "umar00111": "@shashwatmadlani give me ur address I will come n see your sister,mother,or gf tats if you have 1. Who would wanna stay with a pervert like u.", "softkitty31": "म्हणजे काय?", "you.can.call.me.queen.b": "Love love love love @natashanoel001", "hbudaniya": "Love u", "busterkeaton912": "That guy...at the opposite window 😄", "aks_the_king_of_love": "Just looking ur TatOoo Uuffff", "shashwatmadlani": "@umar00111 classic reply 😏, super hero to rescue 😒", "sangramm56": "So sexy", "beingmuneebkhan": "The Chakras of Life and Karma"}