{"dmcrow813": "Listen I'm 66 and married with a son and daughter your age you are a beautiful girl doing what you were met to do don't let what people say bother you they have their own problems and it bothers them to see someone so young who knows what she wants in life their jealous of you my daughter Maria Crow was sexually assaulted by a family friend and is now having to go to trial in April to get this scumbag thrown in prison where men like him belong she's been called terrible names but refuses to give in she's strong like you so hang in there your doing right. Mike.", "vgopal_001": "You are beautiful ! you go girl ! :)", "ananya1paytm": "Need a wife like you 😄😄", "doublepattyhamburger": "Ly😘", "riddhimaadvani": "❤️❤️❤️", "irakihse01": "😍😍🔥🔥🔥🔥🔥", "akash__0519": "Well said 👏👏👏", "dm_patil.14": "👌👌😍😍", "s.me.agaain": "😘😘😘👌👌👌 haters will be haters... you slay it girl ❤❤", "afbestseller": "🔥", "metallover73": "So FINE", "safarsofar": "Fuck those cunts", "prabhikshi": "@radhikamayadev_ you both look same", "belsareshruti": "❤️❤️❤️", "sam_playboy4u": "🔥🔥🔥", "wontstopme77": "YOU ARE DIVINE MY DEAR! 💙💜🌲🌲", "bharatjadhav4581": "😎😎😎", "zhorkarakhim": "😍😍😍👏👏👏", "ravinapandey80": "Touche 🔥💯", "yogilovelove": "🔥", "ddesai709": "😍😍😍😍😍😎", "miller_liamm": "Need to feel that", "iamabadboyfromkerala": "Never too late", "ahmadaf5555": "🌷🌟🌟💘💜💜", "vinayak.k.varma": "You're not a hoe... You're the kind of sweetheart a lot of men imagine and fantasise about.. That includes me too... I have no shame in confessing that.. Be the way you are because you have too much love in your heart a lot of evil satans in our country can't digest.. Keep the fire burning... Much love from New Delhi.. ❤️❤️💞💞🤗🤗🔥", "go4kl": "😍", "manda251186": "They are just jealous because you have a confidence they don’t. I’ve only just come across your IG and I think your beautiful, strong and brave 💗 @natashanoel001 💗", "fitness.prithi": "😍", "h_ee_r_o": "🔥🔥well said", "bkzpapichulo": "Damn ur gorgeous", "mahyar.mardani.m": "💎💦👅❤🤘💦💎👅❤🤘", "no_names_just_stares": "Hot and mindful.💪🥂🧠💥💗", "neeju.560": "sexy penty", "mandar86rane": "@natashanoel001 don't worry about such people.. You are truly inspirational. Sending you lots of God's blessings and Love..", "gunner.dilip": "Well said... Much respect dear 🙌🏼🙏🏼", "urvashi_9450": "😘", "usernamecannotbeemptysowhat": "Wear hijab sister. and come to Islam.After everything you have done, Allah will still forgive you if you accept Islam.", "pj_vaii": "XexE😘😘", "rahulyadav220.ry": "Very good natasha love you.", "thesunilreal": "You are inspiring 👍 The woman who called you So is the real hypocrite.I am amazed seeing your dedication and commitment in what suits and what you believe in...Keep going,don’t bother about such people who comment like that some woman did to you.", "justinbromilow": "Nice undies style", "best_shootout_boys_and_girls": "💙💝💟💓💚🥰💞💟🥰❤️🤩🔥🤩🖤🤩💓❣️💕🥰❣️💞😍💞💙😍", "eliora_store": "@sensualbodytransformation 🙌🤘", "wangxomil_nazarevic": "😘😘😘", "sunnymends": "🤘🤘🤘🤘🤘❤️❤️❤️", "theindianindian": "As long as you aren’t hurting anyone else, do what you wanna do and be happy. Fuck em. Can’t please everyone.", "kumbhraj_chamling_rai": "Omg hoty", "avishek89": "Dear Natasha , have been following for quite a time on insta and honestly your posts have motivated me to overcome my own shortfalls a lot. I don't usually post or comment a lot but I would like to say today that keep up the good work of inspiring people the way you do. God bless you. And ignore the haters. \"Kuch to log kahenge, Logo ka kam hai kahena\"", "sa.ndeep4550": "NIC pic", "hexethedarkqueen": "Tell 'em! I love your positivity! Never let them keep you down you're beautiful inside and out. 🔥🔥", "meglawrence_fitness": "💪🏽😍", "missbhoir": "Trust me, nobody has a problem with you wearing less! You might as well free your tits and undies!! You gotta stop cribbing on nudity atleast and for f*ck sake dont club your nudity with women empowerment! I had to comment for once because the feed shows your picture sometimes without me following you, and you keep writing same crap all the freaking time. I had to once. I'm done. Typed a lot. Good day!!", "mumbaiactor": "Don’t give a rats ass to these insecured retards who might never ever have a physique & level of fitness like you. Bunch of baboons and insecure aunties, total dimaag ko shot. Ignore them like @kimkardashian gets ignored at @beyonce & #Jayz parties", "kissernlicker": "Perfect figure b", "venkat.kotagalla": "Beautiful", "burneros": "@natashanoel001 BE HAPPY, THAT WOMEN ARE JEALOUS OF YOU, it's a good thing..........aaaaand you're pretty", "churbyfool": "Your da best Natasha👍🎯😍💖", "garima3097": "Hi Natasha", "getfitwithsnehal": "I love you so much, I love everything about you.. You are dope... More power to you🔥🔥🔥keep inspiring.", "mahi.b312": "❤️", "di.nesh1635": "Shi hai yaar..watsoever..u r doin rally good👩‍🎓🤙💪bt still..in this pic..thoda jadaa ni hogyaa .. exposure....?", "cristhian_suarezb": "Amazing, wonderful, beautiful, nice, cute... She is!! 🙌", "raul_rahul_17": "You look sexy", "akbar_warunkar": "Often ppl are jealous about achievement , which seems to be impossible......", "sanjana_sehgal": "👌..right words👍", "nilesh.tupere": "Great", "sanu252": "❤️", "preetscanvas": "Screw them..live life like you have been @natashanoel001 ..on your very own terms.. more power to you", "arunsreeni": "😍", "dingdang4": "Love u darling ❤️❤️❤️😍😍😍", "yorz.bablu": "While all the people are busy criticizing you and diesel's sales will go up high high and high.. but who cares right", "albinbabu6990": "Can I eat your ass please 🔥🔥", "pogonophile2002": "Hurt people, hurt people! You said it girl! Lots of love!!", "hyper_spaces": "Hiiiii Good Night", "samirkhan4299": "Wow super girl❤️❤️❤️", "prasanna.m87": "😍😍😍🔥", "brightside2032": "Take it all off, be proud of what you got😘", "bipin.gamit.3": "👏", "naushera01": "Waaaaaaaoooo you have been more gorgeous & sexo😍😍", "bharath247": "❤️❤️❤️", "anandky149": "Super sister", "alexnavsegda": "Есть случаи когда азиаток, моделей, убивали из за их откровенных фото, вам не желаю такого.Вы молодая и красивая, целеустремлённая!", "thomas.bird.92": "Your words are truth. Life isn’t about being who everyone wants or expects you to be, it’s about being yourself and sharing that with people who love every little piece of you. If the pinheads of the world refuse to see your individual worth or don’t approve of what you do, screw ‘em. I’m sure you enjoy being a free-spirit and doing your own thing and you would rather be considered weird or a rebel than being a slave to conformity and the expectations of others. That’s self-worth, self-confidence, and balls! Peace and happiness always.", "thakorsuresj": "Wow so sexy looks", "dasrashmiranjan_official": "yes well said & thought but u r live with a family like a culture belongs to eastern & not western minded so that not accepted now.....cuz u don't go infront of ur families in dis outfit & the word u use fuck itz so disaster, if u believe urself so go forward,,,,,,, then nobody discourage u. thats all.....is well.", "mostu_mazumder": "👍👍👌", "viraj.inamke.officialss": "Nice photoshoot😘 @natashanoel001", "kunal_thaware": "Kon padhega itana easy", "josh07mjs": "🔥", "enriquejerezmendoza": "Keep walking!!!!", "ganesh_shooter": "Superb sexy Natasha", "rjvengkatkhan": "❤️🤩", "pratikmanhas2014": "Whateever people said about u, but u r realy awsme 👌👌", "luzardo_alex": "❤️", "iam_akshat_": "Awesome 😍@natashanoel001", "raja_sandeepkumar_pal8033": "Sexy look", "rupertrosario": "Ignore haters!! Follow your heart!!! More power to you!! Have a nice day!!!", "xtra_h_ot": "Chocolate chip 😍😍😍", "bijilsreedhar": "👏👏👏👏😍", "ghai.usha07": "Just move ahead if you keep listening to negitive people you will never the best ...you are the best & I know how much it take to reach were you are ...sky is the limit baby go for it ...😘😘😘❤❤❤love you ❤", "mthruska": "Don't listen to the negative people. They are the most insecure and they hate themselves the most.", "azam_shah_sameer": "😍", "blasthustler": "In America, we say DROP those haters off lol. Keep your spirits high.😃", "__feti_": "Yaaaassss 🔥🔥🔥", "seventhserieswithposerina": "Keeping slayin my beautiful Nuttoo!♥️", "emanovember": "Yummy", "amit_kapur": "You are Awesome, you are unique and you are one. I guess you are still not aware of the number of people you inspire and motivate. Just keep doing the good work you do. God bless you!! Let your critics be your strength and not your weakness. Stay positive and stay blessed forever. 🤗🤗🤗", "amitvirgo_phantom": "Basically the haters are insecure and absolute failures. Shaming others who are successful is their Job to satisfy their own Ego cravings. Haters hate themselves so much that they spit their venom on others in frustration as they can't come closer even 10 mile far. So Lady, you shouldn't worry at all. You are what you are, if haters do come along applaud them n kick them so hard that they Fall on their Ego.", "best_life_quotations": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "rajarao.gurindapalli": "I love your attitude.. keep going to inspire many souls those are looking for independence. Love you Darling... keep fuck all these negative 👎 people by showing your mental strength.", "zaki.saleem": "It really doesn’t matter what other people think or call you. Be who you are and what you represent. All the best Natasha", "shameen.dsouza": "More power to you.🙋🏻‍♀️👌🏼", "king_maker22": "@natashanoel001 you know what u are💪 #hatersgonnahate🖕 fuck'em #keeprockingmam 💕", "mamacerasa": "You're awesome, lady! And you're looking amazing! #thighgapgoals", "kellyyyjordan": "Please don’t doubt yourself or what you’re doing because of a bunch of ignorant jerks. Your account is so important and I’m so grateful to you for it!", "anupammayank": "Hi .. I have 1 request.. plz", "vishy_licious": "Do what your doing girl! Fuck the haters ...believe in yourself! Done", "rohan2002007": "Wowwww", "sir_h_c_h_ris": "❤️❤️❤️👌👌👌 I personally feel you have a loud personality, if I am not comfortable with that, it’s my problem NOT YOURS!!! Similarly if the people mentioned in your post, especially the lady, think such negative things about you it’s their problem not yours. It just makes me wonder who actually is the attention seeker here given that they came around expressing their problems to you, so in fact aren’t they seeking your attention!!! I very well know the pain of being body shamed especially since I was called mote (fatso) throughout my childhood (at times even these days) by friend, relatives and strangers all alike. People that persevere through such mental trauma actually demands respect for living aside such horrible people!!!", "anyagarika": "Powerful message, Natasha! 🙌🙌 You really are so inspirational. 😻", "ra_impressive": "Dangerous look....", "bishtomania": "Natasha u r an inspiration to much more than these haters...that matters. You matter ✨💖 Keep up the spirit. Do not let anyone stop you from being you...you have us. More lovers than these haters. ✨🤗", "ironakis": "Awsome 🔝🔝🔝🔝🙏🙏🙏💖👍👍👍", "rambleon_rosie": "Power to you lady!", "they_call_me_your_highness": "👍👍🔥", "bumbleabroad": "Your beautiful positive energy and truth bombs always make my day. Don’t ever stop bringing light into the world.", "1he_morning_star": "Looks like a camel toe", "sagar123727": "Very nice morning looking............ 🔥🔥🌷", "maverick_n_virgo": "You are not Hoe you are just Awesome and Amazing..... Keep it up.....😻👍😊", "pallavnadiadwala": "♥ @natashanoel001", "parasharamgore": "❤️", "chaarutaa.latergram": "Perfectly well said!! Love you for who you are😍 keep shining!", "mazboy82": "Oh my god....u have reduced like hell", "pauldas_942": "Hey Naty.....Ignorance has the biggest power.....so pls ignore these haters and keep smilling.....cuz ur smile gives u power to go on and achive the impossible.....", "one_eyed__jacks": "Who cares?", "surya1234go": "Good.. we love u", "subhamfitness_07": "Ur r great mam", "clementine_sunshine_art": "Haters are usually jealous, bored, or sad!", "msiddhartha": "Never give up, don't listen to them, you are a warrior on your path.", "a_boy_named_lsd": "Still sexy asf", "live_life_247365": "Who ever commented that are the actual attention seeking Hoes living a low life . You spread positivity & love and for that millions of us follow you and love you back 200% . ♥️", "colleenclarke": "@natashanoel001 GIRL you do you SO well, and I think it’s inspiring as heck! Thank you for being an authentic STRONG woman in a 🌍 where people hide behind locked doors to who they could and should be. Keep it up. Haters gonna hate 👋🏻", "merv8075": "Mam I loved your personality!! Specially after reading this caption. ☺️🙌👍", "psymafiya_rahul_": "😍😘", "_.inderjitaujla._": "Perfect👌👌", "nainapluthra": "The amount of hard work one needs to put in for that fab strong body you have, not many understand. I really like the broad work you do mixing yoga with cool apparels, modelling and good/reflective write ups. 🙌👌Jokers who inspite of having a choice to unfollow but still have that deep urge to talk negative pathetic words from their limited dictionary need to be sat down for a chat with Shashi Tharoor! A word he spoke about recently for people who indulge in crap like that.....Floccinaucinihilipilification Meaning - Action or habit of estimating something as worthless (cos they are lazy or jealous or undervalue their own lowly self all the while and unable to see others progress)", "yoga_weights_harmony": "Let me know next time you are in Delhi ! I want to meet you @natashanoel001", "parikshitkothimbare": "Beautiful", "vikasmane100": "Nice", "rheashah18": "You are an exuberant burst of colour! Your unabashed, unapologetic honesty about your strengths and your demons exudes an awe inspiring strength that so many draw from. Can’t stop a star from sparkling! ♥️♥️♥️", "ceeartstuff": "Why are you explaining to haters! You are a squirky beautiful Woman that people like to watch on social media and some people are jealous...period!👍", "nautiyal9113": "Very nice", "oneglobalchef": "Hey there! I saw your video for ankle pain. Do you have any advice/ video for shin pain. Yeah the good old shin splint needs some flexibility!", "spacencruz327": "Keep on you are doing awesome 👏", "brendapv7": "i Love you (from Mexico)😘", "allie_katt23": "I love reading your posts. I really look forward to them. You’re always learning about yourself and it inspires me to discover new things about myself too", "aquabhavzi": "@natashanoel001 more power to you 😘", "nagreddy53": "Keep going natasha no need to convince each and everyone on this earth, for every act some accepts some rejects, some appraises some criticises some love some hate some understood some misunderstood ummmm", "accursedsumon": "big", "sachindalvi83": "Be yourself...no matter.", "drsmart_85": "Hello. I found one of ur pic being used by one instagram users which is mainly posting vulgar and nude pics of women. Dm me for detail.", "cramer_gary": "There will always be some people who approve our actions ...our tribe and some who do not ...not our tribe ..", "charan_ansh": "❤️😍😘🙏", "vijayborkar24": "Kuch to log kahenge, unka to kam hai kehna. Just be yourself. Do what you love. Love what you do.", "riju4": "Looking great. Have you been approached by alo yoga? Just curious.", "glitter179": "Your an inspiration 💖", "t.u.sh.a.r": "Kuch toh log kahenge logon ka kaam hai kehna..... Ignore such loser's", "yahoo.sameerkhan1995": "PANTIES NAME NEVER TOO LATE", "hardikpatelpor": "Bas ben શરમ કરો થોડી", "sudeeksha_mukherjee": "Such shallow people will not have the depth to understand what you’ve written! You are beautiful inside out! Strong ! Inspiring and super cool ! Love you and feel keep following you .. 🙂", "___v___11.11": "Nothing but 💜💜💜💜 for you here!!!! For every worthless comment some lame took the time to “project their fear” onto you, there are 💯❌ more legit entrepreneurs, like yourself, too busy #hustling #makingadifference and loving life to stop and tell you that you’re just #perfect 😘✌🏼🤙🏼🖖🏼🤟🏻🙏🏼 #keepdoingyou And Happy #nov11th #1111 😘😘😘", "vjsart": "Wtf 😱", "chucklee_stunna": "U are a fine an beautiful woman an your yoga is wonderful they just jealous keep doing you beautiful Don't let know one steal your happiness 😘", "bharat.sharma87": "You are a lioness and they can't even stand while you yawn let so chill and God bless you Natasha.", "devikagurung": "❤️", "rohan_chawathe": "🔥", "oyechandigarh": "Bold. Move!", "suppu.s1103": "I started following you from almost 20 days ...and seriously u r an inspiration...u just inspire me to do what I like and what I love to do ...thanks..and lots of love 😘", "ca_sabby": "Portrait mode isn't working dat gud, plants on ur ryt are clear", "steve_is_fit": "There are alot of online critics/bullies. Be yourself and ignore the jealousy. Soldier on!👍", "fizzaphillips": "💯🙌🏼😍 #DieselHateCouture @diesel", "pradeesh_deechu": "🖤", "n_e_o_017": "You have never lived , if you haven't been truly hated..", "since_19ninty4": "Your who ur & u know what ur doing.. dogs barks like that only.. Ua such a nice human being. Stay strong ❤️", "johnshekar": "Fit as a fiddle. Nice pic", "painfullpinfall": "Oh such a nice thigh you have to adore", "aman.prasad.3975": "Self love in theory sounds easy! Practically ain't so easy! The fact that you do it so easily and they can't is what gets them barking! Why bother about all the dogs that don't know why they bark? Keep going! Those people can never be you ever in their life!", "missesg.fit.six": "Ive dealt with haters since elementary school and high school. I never knew why I even had them because I was an introvert. I went to school and then I was out. I never hung out around school nor was I 'popular' or socialized with anybody. Its like this til this day. My husband always told me if you have haters means you're doing something right. And no matter what you do you will always have haters but dont you forget that you will always have people that love you. So he says who the f*ck cares what you do! 👊😘 keep doing you. 💯", "stayhealthy.staysafe": "@natashanoel001 please never doubt yourself. All the people who comment on your body are those fat lazy asses who can't even get up from their sofa and open their shirts to show their body. Those losers can only comment. Ignore them. You are doing a great job for all of us . Keep rocking girl. You will get over your mental illnesses. We are all here for you.", "vibz05": "Love you human! More love and power to you 🙏💙😍 I believe you help so many out there with their life struggles mentally. As not everyone got guts to share what you share daily. 🤗", "lakshyee": "Loooove to see how much you have grown. Cheers to your light!!! Keep evolving!! Btw, the body looks fierce and fab!!! Keep it up! Loads of positivity you way!!! Stay blessed!!❤️😘 @natashanoel001", "yogadaniellerae": "Believe in yourself and who you are! Take nothing others say personally their negative is a reflection of them and has nothing to do with you anyway.", "bali_raghuvanshi": "Ye jo bhi apki tarif kar rhe hai bahot danger log hai we bachkar rehna....aise false people se wo bus tarif karke impress karna chaha rhe hai", "somanrakesh": "Good workout..👍", "thegurustone": "Some people wont get it. All your followers do. Please keep doing what you're doing for us", "bigvictor": "Please try to block out those that hate. I have followed you for a while and I have seen you grow so much. I’m aware of your story and you are a inspiration. I only wish I could be as strong as you.", "bttraj_a_k": "Wow so beautiful", "glendsfn": "Thank you for sharing, you just proved to yourself how much stronger you have become thanks to the haters. Keep growing, peace love and happiness to you ❤❤❤❤", "swurwolf": "Yep! Never.", "matt_austwick": "It's only a negative reflection of themselves.", "abhilash.sagara": "People always say shit. You do good, they dont like, you do bad they dont like, you do nothing, they don't like. You are awesome human being filled with positive energy. Be what you are and stay like this always. 😇", "_daily.punch": "Very bad", "ashok.achilles": "i'm following u in youtube long back! i love the way you love urself.. inspirational.. mainly ur tranformantion made me jealous even..", "chanakya_chatterjee": "I am against the concept of demeaning even a prostitute ... If people can sell their souls and be respected for being great businessmen then why demean someone who sells their body ...", "nehabareja": "Lots of love and positivity always to you! You are so inspiring! Stay like this !", "suraj_9966": "PUBG pose", "atul07me": "This is obvious you do all this just to gain attention...but besides this i personally admire you for your practice...", "adityanarayanpanda": "Do wht ever ur heart want..... Mast....", "vishnu_menon28": "Standing up for yourself is the key to shut such people out of your life. Keep Inspiring those who need you 👍", "the_usual__suspect": ".", "jitupanikker": "@natashanoel001 ignore negatives....and negative people ..and do what ur doin best ....and ur doing well...God Bless", "richardcw21": "so fit", "jaspal_nagra2929": "Sex bomb & sex machine", "pujamandla": "Natasha u r adorable in every way and the most courageous who has always talked about her fears n shames n insecurities in an upfront way ... people generally hide their dark sides but u never did tht ...... m so proud of u ..... power to u girl ....... tonns of hugs n lots of love", "kaur_robinpreet": "We love you ma'am ❤️more power💙", "yogpragathi": "Honestly speaking, I used see your pictures on Instagram and stories too. I never liked them much !!! But first time I thought of reading your caption!!! I just love the way you are!!!! I loved your personality!!! ❤️Be You!!! #inspired . I am much inspired by you. Love 💗", "jeeti_sv": "Coool 👏🧘‍♀️💫☺️", "mans_trainer": "Reduce little fat.", "pilates_with_aarti": "Beautifully expressed !!", "sherinshruthi_": "You are an inspiration ! And everytime I see you on my feed I get reminded to love my body unconditionally! And that's how much people like you influence me! Please keep doing this! And slay! ❤️💥", "vinayakdvtn17": "😂Do you do dope.", "drivenbybelief": "Stick then with the finger. If they don’t like what you post, why are they following you. We need more outspoken confident couldn’t-care-bs-attitude people like you in this world. We are who we are, you have a unique trait, don’t let any haters ever change that.", "vijaydesai_143": "Hoti 🔥", "jtsharmaa": "dont worry what people think ,u at all not convey nay negative feelings ,go girl ,n do whatever u feel to do ,", "asif.mon.395": "😘😘😘😘😘", "schauhan129": "Have stopped following her Because she is losing focus don’t know what she does yoga or modelling ? Anyways that’s her life .enjoy !", "maharajan.suman": "Natasha Ur different ya..", "stubborn4644": "Beautiful", "diviyanshi.283": "After writing everything in your post. There are some people who actually do not have much brains to understand what it means and what you trying to portray it's just sad. Do what you do best Natasha we've all been there. It's a struggle everyday just remember you've be much more in peace if you keep your focus on your goal than giving even bit of attention to these creeps on the internet. You're a beautiful human :) much love to you ♥️", "mri_dula": "Hi Natasha, this is unrelated. But could you make a video on how to improve ankle flexibility. I can't squat properly because my ankles don't bend enough. Thanks!", "ajitpal4singh": "So beautiful pic and sweet figure", "dancechoksidance": "Hi sexy! 😏", "koushik.sarkar.581187": "So sexy", "arjun.jun.007": "You are doing great be the same..It requires a open mindset to accept anyones personality..just laugh at them whenever you see annoying comments that they still dont know what is life....", "pra_g_matic": "Nudity does gets likes👍 oldest trick in the history of mankind....and then add a dramatic story!!!", "maheshbabu5981": "😂😂😂😂😂😂😂", "d_arcane_pneuma": "@natashanoel001 you're the kind of strength and positivity we all require badly 😇❤ god bless you always.", "satyavivvek": "screw them haters.. they'll judge you even if you're in a burqa!", "rocky.bolboa.73": "Wowwww.......hatsofff to your thought process.....I am so happy & connected with every single word.....", "aliali12221345": "Nice .... hot...", "unchained_animal": "Haha... Nice", "vivek9bankar": "intelligent people ingore... let it be nadasha...", "owais.husssain": "That sxc ass", "ra.venkata": "❤️", "macpdave": "Keep doing what you’re doing...👍🏻💪🏻❤️", "yatind6674": "Nice look", "archaa_sunilan": "💙💙", "shivani_s17": "You do you girl ❤️", "iammdmustaq": "So 🔥 or so fit👏", "skynetrulz": "If u are gud at your profession, ppl will follow u, if u are beautiful more people will follow you n if u keep posting bikini pics, well more n more people will follow u. Now wil that make a whore? definitely not! but will that make you an attention seeker, definitely yes. So just keep rocking 👍😎", "amarsingh1508": "You are looking so beautiful 👌", "simran_stuckinthe3rdimension": "YASSSSSS BITCH", "nehasingh1983": "How vella is their life when they come on Instagram to shame others?? Your account your rules....fuck the rest....", "harshit.subbu20": "Sexy", "chefchinuvaze\nVerified": "Verified", "gyangupt": "It takes a lot to realise who you are, and then a lot more to be who you are... in this pretentious world, it takes a lot of guts to be YOU... And then you will have that guts the world will hate you, not coz you are so great but coz they can never do what you have done. When someone judges you it's a reflection of who they are and not you.. BE YOU", "figurinefitness": "I'm impressed, do your job for you girl, not for the fuckin trolls @natashanoel001", "sanjayspn32322018": "Very very very very very very sexy 😘😘😘😘", "aditya.singh55": "Never give up", "akhil.4122": "Nice panty...", "rrsangamnerkar": "Leave the replies and messages apart, I always follow you on you tube. And I am benefited too much. All credit goes to your talent of demo and explanation.", "soraia.demorais": "Natashanoel001!! You are inspiring! Thank thank thank you for being you! And loving yourself I don't know you personally I just follow your videos and your photos doing your yoga talking about sometimes difficult subject that for most is a tabo. Being funny but honestly and real. And positive!! Sweety you are a very positive person in my Instagram and I appreciate so much your work and you struggle to find yourself and charge a bit with the world!!! Thank you thank you!", "sglickmandem": "Stay strong. Remember who you are. Keep moving forward. X", "emyestilo": "I love you natasha... This feeling you are getting now... Just go me... Badly. Trust me.... People are there who love us. Nd more to that.... We know what we are what we are doing. You are an amazing person. Generally... I don't follow but you were the first women who inspired me. Like to accept the way we are. Now I just see good qualities in people. I know you have so much of it. So keep it up. Don't let your haters to shut uh bcoz what you are doing. THEY CAN'T. you are only One and only @natashanoel001 RIGHT ???", "alka____yadav": "🌼🌼🌼🌼🌼🌼🌼🌼🌼🌼🌼", "gymsharklegend": "@natashanoel001 see i agree to one thing that i have come across women and men on insta that are actually seeking attention, begging or it literally and that's undeniable, there's one in your comments section also(wont name them) someone i know of 😅 but then yes you for sure aren't seeking attention because we are into fitness and we need to educate people about fitness and motivate them. if we won't then who will. @natashanoel001 so keep going girl🔥😎👌💪", "hiteshmehta141281": "Beautiful panty. It is really late.", "surendrasingh_chaudhary": "So sexy", "kuldeep_pushkar": "💕💕💕💕💞💞💞💞💖💖💖💖💥💥💥💥💥💥", "vlaute4": "So hot", "suman.northland": "Nice look", "iamsameerchoudhary": "@natashanoel001 these mfs are the one who act like they support feminism and they themselves defame it... they'll hunt for such pics when foreigners upload and will applause the same but when it comes to Indian woman , culture and traditional beliefs automatically plays the role..so it's not about the culture , it's about the mindset and mentality they possess which unfortunately is sick and needs treatment for within.. Concluding that the pic is awesome, it demonstrates how high you're at your potential, it's just the perception that matters, and these morons can't take it just because they're jealous..Moreover they want to be like you, envy you and the reality is they can't be like you...So jealous and pity of their own standard of living...", "azeez5323": "Cute plus nice👍", "sikanderrajwade": "Love the confidence and power..all the love and support! Kudos", "naina.kanwar.3": "Ignore them.... And keep it up 🤗🤗🤗🤗🤗", "_dhananjay_fit": "Well said Ma'am... I think ignoring negative people and focusing on positive thoughts and positive people is always motivating... Anyways Your body shows the hardwork looking beautiful😍💪", "vampire.69": "Wow wearing a t-shirts of my favorite brand Diesel 👌👌👌", "sridharganesan8097": "I think ur addict now to expose ur body to get likes and comment, your track is moving from yoga to become Actress??? Haha", "spontraveler": "Yes never too late 😀☺️🤗🤗", "gmeet15": "Some people be like that :/", "mr._aniket_chauhan": "Nice pic", "goutham313": "Typical Natasha way to handle haters ! Haters are people who are jealous. ! Ignore and walk talk nat ;) 💕💕💕 more love and respect to u 💕", "errolbenn": "Kuch to log kahenge!!! Logo ka kaam hai kehna!! Choro bekaar ki baton ko dear you awesome keep up the good work 👌🏻👍👍🤩", "biancanese": "FUCK THE HATERS WHO ARE THEY? MORE LOVE TO THEM CUZ IM SURE THEY WERE DEPRIVED. AND AS FAR AS YOU GO MY BEAUTY THEN KEEP DOING WHAT YOURE DOING ALWAYS BECAUSE YOU HAVE A BRIGHTNESS AND BEAUTY INSIDE YOU THAT REACHES OUT TO PEOPLE EVEN GALAXIES AWAY... AND WE ARE SO PROUD OF YOU THAT YOU ARE USING ALL THE ATTENTION PEOPLE GIVE YOU TO SPREAD THE MESSAGE OF BEAUTY.. SO HELLLL YEA DAMN STRAIGHT WE ARENT SURPRISE THAT YOU CAN DO SO MUCH WITH THE ATTENTION THE WORLD GIVES YOU... AND IF THAT MEANS YOURE AN ATTENTION HOE THEN SO BE IT! SO AM I!  Lots of love to you always nadashaaaa 💓✨🙏🏼🔥🧚🏼‍♂️🍃🌻🖖🏼", "captain_gastro": "@natashanoel001 You are just an amazing personality,stereotype breaker & a true free soul,I know those Comment really doesn’t matters to you you are one hell of a tough person,for those who abuse you or say shitty things about you,I’ve just got on word for them “VAFANGOOL !!!! Love you Girl,GOD BLESS YOU 😊👍🏻", "makeupbyguneetkaur": "U r love💕💕💕💕💕💕💕😘", "yako96": "You have 180k followers , people are not dumb , they follow you for a reason to be honest & when they appreciate your work , they follow you , period. You can do stretches half the women on this planet can only wish for , keep your head up man , You’re way way ahead of the game , best of luck & do your thing everyday. 💯💯", "onlydeep01": "Beautiful", "seanorion": "@natashanoel001 they say w****, we say baws!!!", "dnyaneshwar_khaladkar": "Sizzling hot🔥🔥🔥🔥", "adi.gautam": "🔥", "kishanraj8444": "Wow dam hot sexy babe cute navel", "sindubairavi": "Well said... 👏", "niranjankaushik__m": "@natashanoel001 haters make people celebrities 💞👍", "jootasingh": "why the hell the haters are so interested in what you are and what you do 😂", "speedytheroadrunner": "Nice 😊never mind what other think.", "ajaymahobiya55": "#beautiful_looking", "ms_gemini602": "👌🏻👌🏻👏👏💪🏻💪🏻🙏🏻🙏🏻", "vinothduraisamy1993": "Savage👌👌", "official_rathore_nitin": "🔥", "ausharia": "Few will probably never get it and that’s okay. They don’t deserve a place in your mind. @natashanoel001", "anandkumarsg10": "👌👌", "mandymferreira": "Hoe is a gardening implement. Ho is the word you're looking for in this context 😝", "gaurav.is.pride": "@natashanoel001 behen koi kuch bhi bole I die to get body like you so let the haters hate you work work work work and keep on inspiring", "nehamalikneha16": "You know ma'am..Actually people are jealous of other's people success.They can't stand other's achievements.. Many people are inspired by you and will keep on...Stay blesses and keep us motivating always🤗", "bushra2094": "You are such a beautiful woman inside out. Lots of love and strenght to u lovely😚", "aniketprateek": "More power to you ! 👍", "valresh": "I hear you friend ! @natashanoel001 I don’t know how you keep up with that! I too am so inclined to falling to negativity that I’ve had to remove myself from many spaces owing to the paranoia I naturally come with. Cheers to you and your spirit and for being strong with this! 🍀🦄🍭💖🙏", "bhavesh1858": "Disgusting 💩", "sudhir2713": "आपके काम से आपको बहुत लोग चाहते है और जानते है लेकिन आप भरतीय परम्परा में और अच्छी लगेगी मेरे हिसाब से ।।।।बाकी स्वतंत्रता देश की स्वतंत्र नगरिक भी हैं ।।।।", "senthilkumar.adyar": "People love to bitch about others what ever you are and how ever you are.", "bagyarajraju": "U r fit and beautiful", "its_manu.here": "You are inspiration❤️ .and I am shocked that a women said that to you..we all see u powerful everytime n we all love u 💕", "mrizwan85": "You are doing a good job.... ignore the negativity!!!!!", "cldkln": "❤❤❤ thank you for being yourself, for talking so openly, for keeping it going, for not being ashamed of who you are! That's so powerful and that is the most important influence you could have on people. That they don't have to back off because of hateful people! Sending lot of love🙏", "ichrisalvares": "365 days bikini 👙 wax 👍", "ekambaram.ekambaram": "Sexy", "swayamshah.shah": "Stunning.......", "sandeep.roy": "Stay calm & Slay them well! you're the purest soul ever🤗", "eyebeski": "Beautiful said! You keep doing you, and let the haters continue to hate and be sour in life.", "diveenchandramohan": "What ever we do there will be someone to pull us down by talking negative. Step on their head raise and shine. You inspirie many of us. We support you. ❤️❤️❤️", "aditi_sharma_anand": "Dude you're amazing!! Ever since I followed you, all your posts have been so inspiring always. I'm a fan of yours, and I don't say it for a lot of people. You have more lovers than Haters!! We all love you!! ♥️😘🍻", "choudhury3748": "@natashanoel001 let them say whatever they want..u just keep up the good work..", "rajnish_fatehabadi": "Wow wow wow what a #beautiful #gorgeous #adorable #pretty #curvy and #sexy #thunderthighs 👌👌👌👌😍😍😍😍😍 @natashanoel001", "vk8275": "Wowww♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "aligj1121": "👌", "vivs271": "Ma'am 🙏 u rock and we learn yoga from u ..and remmember in hindi it's ..Haathi chale baazar kutte bauhkee hazaar ..🤣", "mukeshtak98": "Sexy", "malletedsouza": "💪👌👏", "meenakshinihalani": "🔻 Stay Kool", "sophiestarface": "❤️💪", "raunakrai1301": "Looking Confident in bikini", "pujiwoo": "Love you 😘", "jithin_nair1616": "Im a fan of your work... Ur a fighter and an inspiration to many... Haters keep on talking because they are good at that.. U continue ur good work...keep spreading a lot of positivity around..more power to you. 👏👏🏻👏", "reshfareed": "The bad mouthing lot are losers and jealous... Don't both... Do what you please", "sree_rule3": "@natashanoel001 #respect🙌🏼💙", "rohit_sangle007": "Aag lage basti mai hum humari masti mai... haters gonna hate dont care about them.. you are an inspiration for the youth keep going dont look back... all the very best for your future ☺️👍", "shali_mon": "Some ppl are plain jealous of u...so just don’t care abt them dear...u r an inspiration....😘😘", "rajeshtekumudi": "Hooo my God really so strong", "eros_of_sunshine": "U rock!", "gagan8938": "❤️❤️👌", "vikyoups": "Heat the haters🙌", "wattan_singh": "You are a good one.", "balaji8535": "Kdkkk pic 😍😍💟💗💯🌹", "amitpal1950": "Results of your work", "kaurhkd": "Would you really care what he/she thinks? 🤷🏻‍♀️ You hv ONE LIFE LIVE IT ♥️", "bombaymode": "Hotness hotness hotness hotness", "anamitsen": "Let people say what they like, you KNOW you are on the right track doing the right things for yourself...", "tejas242": "Really u r inspiration to many bcoz u r not just physically strong but also from inside even mentally strong really love u r pics videos u really have beautiful strong perfect physique which u have gained through yoga a perfect beautiful bikini body which many girls dream to have for which they spend hours in gym dieting nd all but u have gained this through yoga without gyming so continue u r job do not think of nasty foolish comments nd I must say u r looking beautiful gorgeous stunning in pic @natashanoel001", "dipeshpatkar6": "@natashanoel001 May be u r #BrandAmbassador #NeverToLate", "ankit.amaze": "Nice penty", "ravibhatti1112010": "Ur focused on every goal ..nice photoshoot", "varun_mhjn_24": "Beautiful", "romeldias": "Attention hoe ya jo koi hoe...pyaare ho", "life_per_picture": "I love you woman, you inspire me so much", "partha013": "It takes a long time just to be kickass.... Be the same....❤❤❤❤", "sarahimtiaz_": "AN ICON LIVING 😭😭😭😭♥️♥️♥️♥️♥️♥️♥️♥️♥️", "shaju___han": "❤️❤️❤️❤️❤️❤️very nice pic", "iamstarlitwings": "You are just awesome @natashanoel001 . All these people speak for themselves... Their opinions and perceptions.... Reflect their own complex and negative self. We love you....@natashanoel001 more power and love to you❤❤", "annujthakur": "You talk all bout self care and confidence I really like that cuz that's comes from someone who has really struggled to become a strong woman but the real test for you is when someone calls your attention whore :) you need to shut them up and not question your ways relax stay blessed", "h.a.r.s.h_m.a.l.v.i.y.a": "Whatevr they call you, you’re million more than that- inspiration for many and may be crush for a lot..#keepthemguessing #keepthebarhigh", "theturquoiseshell": "So I was scrolling through the comments and for the first time ever maybe, I only saw one negative comment, which was the guy asking you to delete the picture, which for some apparent reason he thought he would be heard. Duh. But anyway the point is, I didn't scroll through all of them, but I think you're finally getting to people's head, either that pulling some one down or calling them names is not the way, or that if you don't have something good to say, don't say anything at all or the fact they just know if they say something, you and the rest of us will have a kick ass way of telling the person to mind their own business. Whatever the case may be, I think you shall pat yourself on the back because you're getting there.♥️♥️", "chint2471957": "Be YourSelf..... People Talk such things Because they are Not Capable of Doing what you do and Achive what you have Achieved.... keep Inspiring,Stay Strong", "nilpatel6456": "Nice belly", "bharat.choudhary11": "superb my lovely friend❤️💋😍😘👌👍", "pala_naim": "SWEETy", "monaz03": "Hey @natashanoel001 be yourself. I have been following you for a while and I believe you are a strong woman. Don’t be bothered with the negativity. There are people all around us trying to get us down. I am happy that you are strong.", "rishabhlegend": "You are inspiring and sexy both... and yes I follow you for the latter... I am honest about it... after a tiring day at office.. your posts serves as a supercoolant... Thanks for all your posts... They are really helpful.. and I respect you in my own peculiar way", "coachkirinarora": "Sweetie they are full of shit, dont even bother 🙋", "pi.uh": "Mam kutte bhokte h or bhokte hi rhege.. bless u mam 😇", "manindersinghdaroch": "so hot very sexy", "iampravinpatil1": "Wow🤘🔥❤️😘", "thealternatehippie": "Well we give what our cups are full of.", "mallu.portrait": "❤️❤️❤️", "maddypintu": "People who follow someone and then criticise them for their dressing or some unacceptable pics is like visiting a Shiva temple and then asking the priest to change the god as Lord Hanuman because u never wanted to pray Lord Shiva😂😂. There are other \"ethical\" yoga instructors like Baba Ramdev, follow them. Just because u r a follower doesn't mean u can control someone's liking and mood...grow up \"Saviour of Freedom of Speech\"", "jimvandergorde": "Thanks to the whole scandal, diesel sure has been quite the attention hoe... 😂", "wan.der.lust.tj": "You are great ..!!! If people dont understand you, no need of them in your life., people will say bad when u do bad and even when u do good.. Just screw them.. you motivated a lot of people and that is more important .. be yourself.. if a person doesnt matter you in next 5 years no need to give more than 5 sec thought to the person", "ramdevsharma": "If it was Hollywood actress, they praising with joy, no hate at all Indian mind set is very judgemental.. Ignoring is best option..", "i.the_me": "You inspire me so much.😘", "mahatorahul": "Haters gonna hate 😂 @natashanoel001 you're way too cool to respond to these idiots 😇 You doing a great job and so many people are inspired by you so keep it up and smile it away 😁 Love from Melbourne 😇", "poshqueen89": "Hi! I am from Malaysia. I started following you after you opened up about what you went through in your younger days. Now, look at you! You are a star! Sorry to say that women themselves blame another womens dressing for harrasing and sexual exploitation. But, you are a yoga teacher and you promote a healthy lifestyle with a healthy body. You SHOULD show off your body. It is a motivation for many young women to embrace the beauty and flaws of our body. You are a gorgeous and strong woman. An influencer. A positive influencer. Say bye to those bullies and fashion police. You are way better than them!❤Much love from Malaysia!", "cheers_people_": "💋💋💋💋", "sreejith_kinassery": "Go ahead..you are bold...and empowering personality... love you lot..", "anurag_panna": "Why do people get offended over a natural and healthy female body? They would be singing praises if some jacked up male bodybuilder would be posing in nothing but a posing trunk. If you get offended by Females showing skin then turn of the internet and sit inside your house. Anyways looking good Sensei numba 1 😍", "infinityfit_ash": "I love your feed! It's inspiring and motivational! 🙌😎💪", "craigthedesigner69": "Well said! Shine your light.", "adamhossayres": "Your fabulous and awesome and I love seeing you positive vibrations and love spilling out into the world ✨🌟 haters unfortunately are just projecting what they hate about them selves most often. Keep doing what your doing and let’s hope the haters learn about their insecurities and find tools and strategies to manage them better. Hopefully in this life time they can find some compassion and empathy through their own suffering to them project constructive energies back into the world ❤️🚀", "a_living_paradox": "All of us are attention hoes anyway 🔥. Much love and power to you 💙", "simone_dumonde": "I think for society they get scared of a woman's strength. Honestly. It shows them we can survive and thrive without them, aka they can't control us. That's why women have all these stupid rules and regulations thrown at us. You break the mold and that makes them insecure because they know you can't be controlled. Like the sickos commenting about what you're wearing here. They're trying to sexualize something so basic to make you feel uncomfortable, so they can reassert some sort of control. I for one am so inspired by what you do and the message you spread. So thank you ❤ Forget haters. Haters are noise and you are a bright light!", "rajvi_desai": "Go offff 👏👏👏", "nurav_rakerjak": "Mam log bs aapse jalte hai.. you are like too bright for them sope don't concentrate on those people just stay awesome and healthy 😇", "nishant_kumar_ojha_": "Had you been a westerner ,people would have had been showering respects for the very same thing you doing in the very same attire.But since you are an Indian ,our own fellow Indians started to take you for granted and objectify you.Not your fault,its just that our compatriots still need to evolve in terms of maturity.", "itsmeramesh": "Weak people ....REVENGE .... Strong people.... FORGIVE..... INTELLIGENT people ... IGNORE🙏", "jayeetxd": "All the shit they talk yet you're the famous one inspiring people and they're the people running their mouth like kids so don't even think about it 😅", "nakti_naar": "You go girl! 💜", "akashbose2": "Loveeeeee 😘😘😘", "beingalphamale": "Keep it up , there will always be haters and dumbminded people in everyone's journey. ❤", "_foundart_": "You are so beautiful.", "itsmejvscorpionking": "Superwomen just need a cape to go vith it", "shenoy_sanjay17": "Natasha I appreciate what u are and hats off for your guts", "itz_me_dadslilgirl": "Never care wat others think abt u. Juz be u. More power to u Natasha. You go girl❤ V luv u😍", "nadeepaws": "You go girl! ❤️😘", "kp__i__": "Noone has the right to comment... sadist people would continue exist and can't help... People are more interested in others business than minding theirs.... Sick ones are these...All is well :)", "hairfrisk": "Haters gonna hate.. Potatos' gonna potato... You change lives at times.. That's enough to let you know you're doing more than fine!", "abdude.kesh": "Man someone had the balls to mess with u?? Kick them ,yoga style hon cuz u r a blessing .😘😘😘", "linithsethjoshy": "Do what you love Nat. Open minded people like me always going to appreciate it. Someone criticise you it actually comes out of jealousy. Always love you.", "deepa.arora09": "Lots of love and power to you! You are a strong inspiration for many like me! :)", "sandeshjadhav106": "😳😋😋😙", "rks2354": "Fuck ❤️😍🍓", "the_oyo_yosy_sahu_": "Fuck u", "krishan__singh": "You're awesome :)", "sudipto.goswami.75": "@natashanoel001 just don't pay heed to those people just go on doing what your heart feels right and honest...In our lives there will haters who will go blabbering over all these", "amar.vaid.12": "OMG 🙄🙄🙄🙄", "yogawithruby": "More power to you girl @natashanoel001 . You are always my inspiration. Love you a lot 😘❤️❤️", "gusanichetan": "Killer", "wandering_wonderwaves": "More POWER , LOVE and POSITIVITY to you love 😍😘🤗 may you become more stronger in every aspect and keep inspiring this world full of dickheads. Keep going, love and admire you a lot for who you are 🤗🤗", "krishnakumar8250": "So hot and bold", "leonardperis": "There's so much strength and self-love on this post 💖💖💖💖", "nikitawalia2311": "❤️❤️❤️ more power to u", "sonu_astroved": "Haaaye never to late", "sunnythe_trainer": "i", "shristi_dass": "I follow you just because what you are and what you do. You are an inspiration. Being where you are now from where you were once amazes me. I love you. I wish you never change😁😘 all the best", "ifernandaxavier": "Nice ಅವತಾರ", "sunjeev_sharma": "👌👌👌👌👌👌👍👍", "hurry_emmanuel12": "\"Hurt people will hurt people\" Continue to do what you want and what you love. You are so inspiring 😃🙏🙏", "theoldgoan": "If I had to make a top 10 list of instagrammers I'd like to meet, you'd be right up there. I can't say that about all the real attention whores I see on social media. So screw the haters, and keep inspiring. That's what we really love you for. And know that every second of the attention you get is well earned and well deserved! ❤️", "niroshaneng85": "Very beautiful u cute girl 😍😍😍😍", "surabhi_1802": "It's actually my dream to meet you in person......I don't think I've ever seen a more positive person in my life....who can turn all the hate into positivity in such Manner💓.....if only I was even 10% of what you are.😪.. love you Natasha ☺️", "shaikhbaba5967": "Power full pic natasha", "manjot0011": "Dont woory do what u like and spread the positivity . U r the real inspration for girls...😍😍@natashanoel001", "simonne29mascarenhas": "Who this??? 😍😍😍", "annikapanikker": "Omg. She said that? You are looking FIT AF by the way", "uriba_zahur": "You’re stunning", "mess_si18": "Ur amazing the way ur are", "narendra_88": "👀😍😘😘👊👊👊💦💦", "derekdomnic": "People have no other thing than to just talk shit about others. You my friend are inspiring so many people around the world. Nobody knows the behind story of how you came to be what you are today Natasha you know the best. Don't stop what you are doing do it even more and don't give a shit about others. Just have a cold one with the bois and have a blast laughing on the nasty comments that you get. You'll enjoy it trust me. All the very best on this journey of yours ❤", "heyitspushpita": "Always in love with the confidence, the grace, the beauty that shines from your very self! It's a privilege watching you grow like this and talking about the issues so beautifully, making all of us do the same! More power to you love 😸🌈💖😘", "subrothob": "@natashanoel001 u are everything except what negative people say. U are killer, savage, real, raw , beauty. ❤️❤️❤️🤗😘😘😘😘🤟🏻🤟🏻👌Don’t give a fuck to negative sayers . Specially those who may be financially rich or may have some status in society. But if they have negative mind or comment they don’t even deserve a duck or fuck . #beyou #stayraw #stayreal #followyourheart #dowhatyoulove #lovewhatyoudo #gratitude #1lif2live", "ashinarang001": "I dont think u should think what other people think about u...u r truly inspiration for me...to meet u in reality is 1 of my dream...u r living life fullest and people are jealous for the same...go ahead take care and u r bestest....wish u a lot of happiness 😊", "shruja_prabhudesai": "Sooo Well Expressed!!!", "mouriya_3817": "@natashanoel001 💋. 💋💋💋", "sk86sehr": "Stunning love fantesy natasha u do what u want, like & not bothered what think other fucked 🌹❤️", "singhkshipra": "♥️", "drishtinandra": "Prettiest 😘😍😍😍❤️", "faiz.hussain11": "And somehow they got successfull", "shubhi_tomer123": "You are an amazing women..that’s all I want to say after reading this n moreover after following you❤️ Correction! You are fuckin’ amazing and beautiful😉", "bhavaniobsessiveiyer": "OMG u caught my eyezaaa today lol but u know what ur the sweetest looking thing on the gram n I'm happy to follow u my sweetest attention hoeeee... 😁😁😁😁😁😁", "vivekkgupta": "More power to you", "fatimasanashaikh\nVerified": "Verified", "shashank_dubey25": "Beautiful 😍😍😍😍😘😘😘😘😘😘", "mahabale.sanjana": "You are so strong!", "abhisheksharma_02": "I like the way you come up with this kind of shit thrown at you. More power to you because you give me the same through your unmatched glow and progressive being. 👮", "pallavicprakash": "You are so inspiring😇 There is no shame in being yourself.., lot to learn from you 😍❤️ Keep inspiring...!", "bhaiyajiismile\nVerified": "Verified", "vansharorxd": "You the best , fuck the rest . Keep spreading positivity because we really need someone who can teach us how to express our emotions and thoughts that are bursting inside our heads . I’m not the one who comments and likes even a single pic on IG but I just woke up and saw your post and I thought to make a stand for every person who is suffering from this kind of shit . Peace ☮️", "monncherrri": "Sending hood vibes and positivity your way! Much love! 💕keep spreading goodness", "avinashkunju": "People are sick Natasha. Don't let people harm you. Because being comfortable about the body is a great thing ever,those who are commenting they aren't capable of doing that,they are still in that inferior society wall. Kudos to you. As a follower of your. I really admire you man. So as Rajesh Khanna sings \"Kuch toh log kehenge logo ka kaam hai kehna,chhodo bekaar ki baaton mein beet gayein tere Raina\". Joh logon comment karte hai unki aukat nahi itna fit rakhne aapne aapko. You live in your way. You create awareness amongst people. The society irony is \"when you withdraw cash from atm ,at last there is an option for printing receipt (and it quotes do you want save trees,so avoid printing) but people still print it. So this is a sick world. Chill ingnore spineless and hypocrites.", "deepikaparmarmail": "Be yourself ..way to go girl! #girlpower", "vaishalibindal2": "@natashanoel001 you are an inspiration. Women like me look up to you. You are a badass women. U rock it bro . Lots of love and warm hugs to you 😘🤗 keep doing what you are doing.", "sureshsabale88": "U forgot Indian culture", "rashmi.jain": "Just follow this - you are the best .", "avinash_217": "Sexy 😍", "meenazsamol": "@natashanoel001 please dont let it bother you ... There are people who loves and admires you ... Lots of love and hugs to you ❤ you have motivated me when i felt my lowest!!", "unfold_ur_own_myth": "Woo hoo you rock girl ❤️❤️❤️", "dhuwaria": "You India's beautyful woman", "iamggpanda": "Can I get apparel with \"BETRAYER\" across it? Cause apparent that's what my family thinks of me. Much thanks. Love you. Hereafter don't even bother responding to them. Just save \"kthxbye\" on quick-reply.", "nindo_h": "🔥 haters gonna hate hate hate ♥️", "maddy19oct1984": "💕no one n this world have d right 2 put a question mark on some one's dignity or character ur a strong woman who can take these silly talks ignore the people who have a negative aura ur urself n a believer toooo to stand n this world have a gr8 success story n life ahead @natashanoel001", "meghnanaidu1\nVerified": "Verified", "timuffmamu": "U r brave, u r super 👍 u r beautiful, u r sexy 😃 it’s your feelings in whatever u do, so just let others fly their kite🤔🤔", "fitzealbysuraj": "More power to you. 🔥💖 Cannot relate enough! You be YOU. You be the BEST. Werk it! You're an inspiration to lakhs of people! And never again, get that self doubt feeling wander around you. Cause, the more you dwell in it, the more it's going to pull you back and divert from what our goals!!", "tabbytabster": "For every hater, you have a 100 that look up to you. Never ever let their insecurity affect you negatively. You are truly an inspiration, to many of us here!! Continue doing what you u and believing in you and slowly see these sad sad people disappear. Lots love from this side of the world ❤ @natashanoel001", "kristen__fernandez": "❤🔥", "nee_1730": "Girl....this post caught my eye....you have haters .....Coz you have large number of lovers.....doesn’t go down well with people ....carry on Human ....I love the ‘you’ in you.....", "swaroopakrishnamurthy": "When a foreigner does this , no one has a problem. But when we Indians do, they start calling names. Just ignore , you are such a darling and I am envious of your talent ( no evil eye though 😂 )", "aashish_380": "you can do that others can't even think😆 Here comes the jealousy factor. Unka bhala karna mushkil hai. So just keep going🤘", "a.nair9100": "Njoy what you do. Ignore all these negativity. We cannot change others attitude. That is something that someone has to do themselves.", "nativealien": "Our interpretation of the world stems from who we our.. our mind is the lens that colors our world.. whatever negative stuff comes your way is a reflection of the source and not you.. you’re an amazing confident person and the kind of role model today’s youth needs.. especially females.. Also love this campaign and the response.. kudos!!", "mr.vinayaka": "Ma'am You inspire people and your diet makes me fall in love myself for food what you're doing is just wonderful....😋", "foram14": "❤️❤️🤩", "littleindiafoundation": "🔥🔥All I can u set people on fire - enjoy the life to fullest u r awesome babies God Bless u always", "shankarcsk": "Just ignore them, just do what your heart says. #yolo #yogagirl", "shraddha_yoga": "I know ryt ! It's none of anyone's business whatever you're wearing. I simply can't understand where the aggression comes from. If u don't like it, simply ignore..ryt !", "devendra_suryavanshi": "Wow, hot & sexy👙👌🔥😍", "jatin_s0204": "Really attentive you're.. 😋😋😋", "manisha.chabria": "@natashanoel001 Love this and how you empower people to stand up against shit !! Thank you. Salute!!!", "pound_with_pj": "Bravo! Bravo! Bravo! You know your words and the attitude you learnt after so many damages in your like are working as medicine for me... Because the reason is I m suffering from “People-bothering “ diseases from last 11 months I had so much stress that all my muscles got so stiff that I need to took physiotherapy sessions and spent 7000 dh that’s a lot money. Thank you for being in my life through social media!", "momster_nicky": "Girl! You are an inspiration to many. You’ve followed YOUR heart and are doing things that make YOU happy. Period.", "peterdlomen": "You go girl.. Don’t give a fuck about these other jerks", "arunmachismo": "More power to you dear @natashanoel001 !! Keep rocking and continue bullying with your haters 😉😉", "prabhhav": "You are incredible.", "frybaba": "To hell with what ppl think n say. Carry on. Dont stop what you do", "priyamsaha": "You're wonderful and beautiful 💖", "anush.vj": "Hi Natasha, U inspire me a lot day by day ... They way u feel and fight. It's also me I am also fighting these things ... U are an awesome girl. I was worried why Natasha hasn't post anything on her insta story..... I am always with you Natasha ... Keep inspiring people .. they can change ... Love u ..😍😍😘😘", "shanaya.sharma.581187": "natasha you're AWSOME n you clearly know it. keep rocking stunner🔥🔥", "aapkiharshita": "Beautiful", "murali_manoj_97": "👌👌", "morning.star.89": "Wonder woman...", "makeshift_saint": "Shine bright. It shows their insecurities, don't let them trigger yours. You are an inspiration. ❤️", "vkypinto": "Hey nats u need to listen to this song \" kuch to log kahenge logon ka kaam hai kehna\" ur doing good n just continue the same.Stay blessed", "fravak.bharucha": "Ignore the nuts. You're plain gorgeous 💐", "parthsekar": "Hell with them! You are such an inspiration! Do you do cardio or running besides yoga? If running, more updates on that 😁", "shamiebubu": "Shame on whoever said such things! They dont have a tiny fraction of what you have! Love u lots! You are an inspiration. 😍😍😍😍", "indichuesindia": "U give what u have.Haters have hate. Spread love n positivity 💕", "ladaddy_tha_baddie": "Dude you’re hella hot! @natashanoel001", "yuga9876": "Loooking so fittt aaap exarsize kitne hour karte ho??🤔🤔🤔😀😀😀", "free_soul1608": "Ignore them nadasha....u r the bestest girl....🙌🙌🙌.....go girl....u inspire alot of ppl including me...love u loads 😘😘", "geets_freefalling85": "U go girl. Let the haters hate, u do it thing. Lots of love and hugs😍😘", "clairvoyantsoul": "Natasha, I am following you since last few months and whenever I’m off my track, I always look upon to you .I watch your stories and pictures and feel good. Its likee you’re an aphrodite in a human form came here for an awakening transformation . I feel you and I love youuuuu Man.💫", "jen4dr": "Just look at the positive post and forget the miserable haters! You are awesome 🤗", "amandazbarker": "You go girl! It's easy to piss people off or offend them. It's hard to inspire others and be a role model. YOU DO JUST THAT! You are an amazing woman and I look up to you and relate with you as do so many others. KEEP DOING YOU!!!", "nehaanoop_": "More power to you girl...💖", "hiren_patel8833": "So hot", "s__ha_nu_": "😍😍😍😍💓💓", "unfinishe_sentenc_": "Slap on the face! 🤣 You go girl! More power to you! Good to see the \"fuck y'all m doing what I want \" attitude. It is so important not to lose yourself in this fucking sea of mf asshol*s. God bless!❤️", "bindhunash": "It’s a tough stance one must take to stand apart from everyone! Ones who have the balls do it and the one who don’t have it judge and complain!! Keep moving forward @natashanoel001 😘", "rakeshkhan89": "What the fuck ina vadda status ki lorh aa ik photo paun nu....see d models bahar alia direct pandia ne bikini photos....apne indians ini feeling ik pic vaste...bhi sidha pau janke ik feeling ji create karan nu stop all this please", "sagarvermamusic": "More power to you Natasha! 😊🙏❤️", "yat.in.sta": "Hahaha I cracked up seeing this picture!! What's wrong with being an attention hoe...we all are exactly that anyway! :) At least you wear it like a tiara.", "anita.gera": "There comes a time when we realise that being comfortable with ones own imperfections, is the essence of real beauty. Way to go girl. You are brave!", "lenin_thegamechanger": "@natashanoel001 ur focused on every goal ...nice photoshoot😃😄", "shubham_goswami100": "Hi natasha dnt ever let someone destroy your positive vibes again.. All the best !!!", "superabad213": "😍😍😍😍😍😍😍😍", "sammy_varun_joel": "No one can be like Natasha 💞💞💞", "chapterwisedesign": "🙏🙏🙌🙌🙌", "maheshmahesh8010": "So sexy look", "parasjaitley": "You go girl... ❤️ Keep breaking Stereotypes And keep believing in your strengths.. you are inspirational And making a change.. keep going with this good work.. love your posts.. ❤️", "rahulcool_7": "Kuch toh log kahengey logo ka kaam hai kehna", "khyati_mystic": "Rise & Shine🙂🙂💕", "idivyakurup": "More power to u grl @natashanoel001 keep going 🤗❤", "guriwaraich38": "Oh yeah 🔥🔥🔥😍", "letmebe_your_hero": "Yess you’re absolutely right.. these people dont have any other thing to do and criticising others actually makes their day and its just a reflection of who they are!! You are amazing Natasha.. and be awesome😘😘😘🌹", "pliepalazzo": "You go girl! And now that you are in Andheri I am coming to you soon! So excites to see my body work it's magic with your guidance! 😁", "sayali_gudhekar": "🙋kuch to log kahengee... U flyy girlll👍👍", "sakshiguptayoga": "You my love are so incredibly goddamn powerful and brilliant and all sorts of amazing. Thanku for being strong and courageous enough to be so completely your self. 💜", "nesh_sh": "You so beautiful and your thoughts too! Proud 💙", "narasimhaonlyone": "🔥👌", "deeteaful": "Do you know that a common narcissistic quality is to demean others, only so they can feel better about themselves? Studying (and paying attention to psychology as a subject - the human psyche especially- will all of a sudden change the way you look at these people. It’s done me a lot of good, I can tell you. Now, most times someone unnecessarily hates on me, I understand their insecurities and mentally bless and send them love...so they can heal and feel better about themselves without having to bitch/put others down). You’re bold, and that’s amazing! You have to put yourself first, and that is you progressing in your spiritual journey...I understand why this affected you so much and I hope you come across words, conversations and everything that can equip you with enough information - so these comments stop to bother you and you look at them dispassionately. 🙏 If anything, as a follower, I think you’re amazing for voicing out and for being you, and unapologetically so! 🤗❤️✨", "wanderoramrit": "All the best, keep up", "krishnakumar_gymtym": "😂😂😂😂😂😂", "aparnasound": "They are just jealous", "vishnupriyak_96": "Love you always 😘😘", "vikram__0077": "🔥🔥🔥🔥🔥🔥🔥", "harleyriderinfauj": "Carpe diem! Hang tough screw the world", "carolinelouisethomas": "We need more people like you!! A loud AMEN to you for simply being YOU", "samridhi_aneja": "Such an inspiration.... for yoga as well.... 🤗🤗 Keep Smiling, lady 😀☺️", "sanuchow": "Love this ❤️❤️❤️", "aforaditee": "Hey. You are so beautiful from within.", "fernandesridge": "Ballin 🖤🖤", "ganinleigh": "So much love. ♥️", "daphynegracias": "Shine on. Lots of love:)", "rum_meow": "You go girl.❤️ Fuck all the haters! Insecure shitheads.😒", "rohith.pb": "Ha ha too crazy friend", "iamlupinder": "Don't worry ,just be U...", "themystic.tv": "God Bless You! May God give you more success and happiness . @natashanoel001", "26.7.1995": "😍😍😍😍😍", "abhishekrkurup": "You are a good human being in nd out... stay natural and fuck all the naysayers... cheers nadasha", "akshayc_11": "prefect", "sindukrishnaraj": "Made my morning!💕", "meheronfire": "Power", "thejeshgn": "❤", "ksakshi135": "You are awesome be as you are dont change...even u go nude for photo dont hesitate just do it", "djyazad": "😘😘😘", "rimyank": "Logo ka kaam hai kehna..ignore d ignorant..just do ur thing behna :-P", "pandit_op_ojha_astrologer": "Beautiful good hero", "thehappyyogii": "This was so difficult to read 😣 it's so sad that people do that to their fellow human beings. But you're as brave girl who's risen through her struggles. You'll be good. ❤️more power to you! Do your thaaaaang girl 🤗🤗🤗", "astrophilic05": "Ahh! The confidence! 💯♥️", "pahadanwholifts": "More power to you girl ❤️", "akash.kasurde": "Fabulous,ur inspiration...looking so nice.gud luck", "abhishek.kamble2500": "Oooh SexxxxY", "kirtiraj_raj": "🙌❤️", "tbfve": "Maybe she was referring to hoe, the object used for cultivation. Either way, she did take a 'dig' at you..", "amk__sk": "Cool", "dalbirsinghnirwal": "i think you are all rounder", "dishha91": "Haters gonna be haters... So live life the fullest.", "sarin_desai123": "Beautiful God bless you", "kaura__saab": "🤣🤣🤣", "chahana.k": "The first thing came to my mind while seeing this photo is \"She is goddam beautiful!! \" thb.", "silver_new_world": "Perfect role model 💙", "krishnalakshman_": "You go girl🔥 I really love all your posts❤️❤️", "raspberryblowing": "Can I be poetic About killing mosquitoes and wiping the blood over the side of my bed sheet Or stalking people I'm obsessed with, online, mostly girls I'm jealous of Or being the toxic one in my relationships and knowing it Or that I can never make my poetry rhyme and be beautiful at the same time, mostly neither. Can I be poetic about the way I pretend to be someone I'm not, Not in the cool way, but to confirm with the company, that keeps changing Or the way I imagine how kind a person who's watching might think I am, if I do something that's considered kind, Or the way I'm still not sure where I want to go and who I want to be, Or the way I'm mediocre at everything I do, And that I've never really done something substantial for anyone Or even myself, for that matter, something I can be proud of, I haven't. Can I be poetic though about the face lines around eyes of the old that dance you the music if you watch, Or the first time I saw the waves of the sea, not so long ago, Or the multiple little loves they reminded me of; The love for a skill I never get around to attaining or an exciting new dream or a silly boy or a cause That come and go in waves, some to never come back. Can I be poetic about how I want you to see me as poetic and deep and be slightly in awe of me, or at least imagine that. Can poetry come from a mediocre, ugly place that's me and stay in it's original state and still be acceptable. Can humans be.", "nitesh_agarwal56": "😍😙", "digvijay.damame": "wow", "khushiknarang": "FAV HOOMAN BEAN FOR LIFE YOU'RE SO INSPIRING 🌟🌟", "tathipremchandstudio": "❤️", "itsmeesomnath": "Looking so sexy", "krrish_kaus6041": "❤️❤️😍😍😘😘🤗🤗💗💗💗👸👌👌Awesome", "belhekarvrunda": "You go girl!❤️❤️❤️😭😘", "naseerkayam": "Beautiful", "sukhijaharbir": "Don’t listen to them distracting assholes. Do you thang. Fuck them. Ur awesome", "chetankosta": "Bravo tasha nailed it....keep it up"}