{"shelbybhala": "❤️", "chandan_singh8507": "Hot❤️❤️❤️", "doppelo3": "Girl I hear you,I feel you. You are not alone. You are hope of many silent voices. We all have had such experiences in whatever intensity. I say a prayer right away for your healing. You are healing. You are healed. You are growing. You are growth. You are human. You are God's child. I am looking up to you. ❤️", "amolthakur1928": "😲", "saravanakumarmahalingam": "Why taking this much risk 😢", "manish4879kumar": "Very sexy", "shwiyeng": "Very well written. more power to you gal", "sparklinggloryofthesoul": "You are amazing ,Natasha😍...very inspiring", "ajux8": "Two of my favorites in one pic! You both are inspiring us, everyday.", "sp_reddy_spandana": "Seriously!im crazy abt u .....love you♥♥", "manujmahajan": "Your livliness is inspiring as ups n fowns are in everyone's life ....so hats off to you", "dinu_twty": "Happy for you darling 😍😍😍", "22012002prmec_": "🔥Hiii", "mahishaikh406": "o wow take gutes to shere this amazing feeling on social media 👌👌👌👌👌👌👌👌👌", "ku.mar3900": "6396002714", "itz_raj4u": "So sexy flexible", "shandubai1": "❤️", "bvennikal": "Respect your inner strength and wish you more power, deep NN", "mandeepkumar7026": "Very hot 🥵", "sidchatrath": "Huge huge respect for your boyfriend and also YOU !", "prasannapansare": "🙏🙏🙏 Respect🙏🙏🙏", "danishhkhan93": "Appreciable, U are a great inspiration for many people. U have lots of positive energy n guts to express. I am also a certified personal trainer from k11 I have also many females clients who were depressed and unable to come out from but my efforts and ur words helps them alot. U r sch a great girl i salute u .", "dbnaik": "@natashanoel001 got to know about this amazing creature and her artwork @artwhoring AWESOMENESS I must say.", "mehr46f7580": "🔥🔥🔥🔥🔥🔥❤️👌💋", "shirinchinnu": "🙌🙌🙌", "guptaprakashjaiswal": "U are a true person who can understand relationship \"AND U ARE A VERY STRONG WOMAN\" LOVE U MAM. I HOPE I WILL MEET U SOMEDAY#RESPECT EVERY WOMAN 😃", "mna.nadeem": "@natashanoel001 never allow someone to treat u poorly just bcz u love dem... And girls hv habit of doing this mistake...lemme share u an incident...one of d person in my locality used to beat his wife...one-day when dat man was repeating d same, I in anguish thrashed n abused him a lot...but what hpnd den...I was beaten n abused by d women I spoke for n protected...my dad who is famous as honest govt employee nvr gave so much love 2 my mom...although in return my mom still a devotee to him...I don't know y most women choose to leave dat way, r dey less in intelligence or helpless...y girls always want boys to approach Dem..y girls can't be approachable to gud guys...bad guys r very confident by nature n dey use dis tactics to manipulate gud girls...n den broken girls bcm bad girls n manipulate n disrespect gud guys...and des days der r girls who wld say I love porn...what is der in porn to be loved...porn just promote inappropriate things n dehumanize women...no women who became porn star ever wanted to be a porn star...u can read their blog...About sex n love I wld say dat, sex can bcm a technique, but love can nvr bcm a technique...when love increases, sex diminshes...dt doesn't means intimacy will not be der...yeah it will be der, but in a divine way n more soulful... https://bit.ly/2BJNQFa", "sweet__criminal": "Thigh❤️❤️😘", "vishal_dave_photography": "Really you are strong woman ❤️❤️❤️ be strong 👏👏", "artist.arjun": "Transcending... as artist is like to paint you ..", "nithyanandmudaliar": "🙌🏼🙌🏼🙌🏼 bold enough love ur boldness some posts like this motivates broken hearts like us feeling pepped after read this post, continue..", "neville.driver": "Think you need serious therapy, dear. Please seek professional help. God Bless.", "chaysesoares": "Lots of respect goes to @natashanoel001 and love!! ❤️🙌👏", "jenik_patel": "Ohh fuck Pyar ho Jayega re pagli", "dipeshpatkar6": "@natashanoel001 they only troll,comment and abuse cause they can’t walk in ur shoes.u keep walking!u hv felt the stones n the sand.if u didn’t stop for the stones don’t let weak words stop u.you keep walking! Ignore the unnecessary,it will complain abt the sand too. You keep walking! The send will heal you.😁😁😁🤟🏻🤟🏻🤟🏻", "bharathb3": "Is this for Halloween.. 🔥🔥🔥🔥", "__ashiq__": "🙌🏼", "dinimadaryani": "With every post I love you even more! Its a journey ❤️ More strength like yours to all of us humans and more love from me to you 🤗🤗🤗", "vijeesh.pannikkottil": "Liked u r *assumed*...😊👍🏻", "onlyays": "💣😎😘😍 love u like this only", "helicopter_rakhi": "U r such an inspirational soul...love u a lot♥️", "mentalist93": "can't imagine how strong you are! No words for your willpower and the honesty which you possess ❤️❤️", "sanchez4you": "you look amazing by the way", "1ruby_naskar1": "Natasha your the strongest goddess....you inspire us sooooo much....lots of love your way..god bless you honey with more n more strength ❤️❤️😘", "yoga_king54": "Great godness", "prasanna.m87": "👌🏻👌🏻👌🏻", "d900sharma": "Glamorous Hot🔥🔥killer Bold🔥🔥 DIVA", "shivamsamyal": "You are awesome ❤️stay strong stay positive ☺️", "ashamohamed2613": "Ne eadhum mental ah enna..😝😝", "nishantagarwal4732": "❤️❤️🔥", "christyjohny": "Absolutely brilliant.you nailed it 😍", "amrutha_raj_": "❤️", "smiley_nehu_06": "Omg! You are the real person!! Respect and love 😍😘😘😘... Thanks for all the powers😘", "moment_catcher123": "Really its whoring", "monsur146": "Sex your pussy like it", "bharadhwaj_89": "I really consider you as my inspiration and mentor...Hats off to you 👌", "marvelinfobox": "Hamare mann me aapke liye izzat ab aur bhi badh gayi hai ❤️", "goddy_beast": "@natashanoel001 Ur amazing nats...😊😊😊", "asfighter": "Natashanoel001! Stunning 😍💐💝💋💋💋💋💋", "sam30252": "Thanks for letting people know its important to speak out no matter what....", "rhythm_blog": "You're an inspiration", "anwarhossain389": "🔥🔥🔥🔥🔥", "siddu_bangalore": "👍And I am ur big fan from ur words if possible we will meet", "aman.kumar18": "It take courage and confidence to speak up and yes u have it. You gain it after broke down instead of sitting you stand and this is your first baby step. So Many more to go. Keep rising and smiling. Hat's off to you girl.", "yashikasakti": "❤️", "outdoorbrodawg": "#REAL #HUMAN 🙏🏾", "kamleshseth8661": "Hey cheers to strong women's like you🙌👏 n me also from Mysore nice to hear that......", "shashank_dubey25": "@natashanoel001 Soooo pretty😘😘❤️❤️❤️", "rj_42_ksg": "Awesome👍❤️", "mg1829025": "😍😍😍😍😍", "the_sweetestdays": "🌸", "laxrawat002": "K.b.h", "this_is_drishtinegi": "Thank you for sharing this❤️ More power and love to you❤️", "prasadelayath": "@natashanoel001 this is a beautiful post. Much respect to you and for pulling through to where you are now. Beautiful inside and out!", "niharvasudev": "U are a real girl with whom I would like to spend my whole life but, you are already into someone...But huge respect for being so open...💙💙💙", "vinayakdvtn17": "At the time of National calamity it is not a time for bothering about personal pleasure & Hedonism😮.", "rsa1852": "It really takes eons of courage to talk so comfortably about sex. Kudos to you for inspiring so many people 👌👌👌👌", "ashtartashi": "Keep Shining!sweetheart! U are a brilliant ⭐️ 🥰😘🥰🥂🥂🥂", "chubby_bubblez": "❣️", "harsha_doriya": "You are fuck amazing😍.. more love to you 🤗", "jaspal_nagra2929": "Sachi maza nhi aya", "thattrendstalker": "@natashanoel001 first I didn’t recognise you from the picture. You look amazing. Doing a split in heels😍😍 Second I loved how to narrated and discussed about the thing we know but don’t put it out. Kudos to you girl😘😘 #inspirational", "prem_8871": "Nice... straight and clear about opinion .. Rare you are... Like the way as you are...", "chopra_shab": "respect..!!", "suraj_adhav22": "KATILLL🔥🔥🔥🔥🔥", "tanya.fernandes8": "U are just amazing... I’m getting hooked on to you and your posts Natasha.. keep them coming u beautiful soul.", "manaligajra": "OMG this post is so real", "shete4177": "R u a plus size model💦", "vaghelakirti": "What is this?", "sanoop_sathyan": "Huge shout out to @natashanoel001", "krish6101": "You...have balls of steel...lots of love...and respect..😍🤘", "aanash.mohammad": "You are my inspiration 🙏🏻", "nikhilnaik9": "🙌", "varsha_hongal": "U make me feel better everytime💝..n by ur thoughts I feel I m growing up to be better n broad", "elizarodriguesmedeiros": "👏👏👏👏👏👏😍👏👏👏👏👏👏", "thebrowngirls_space": "Oh my love you are just amazing .tremendous respect to you being so vocal which most of us can't be.I wish pray that this love lasts for ever.", "sakshiraizadakapoor": "Hats of gurl..I really felt so good after reading it..coz it take a lot of courage to speak ur mind and heart..I really hope to learn more things from u", "subin_sam": "It's sad how many women consider themselves to be just a toy for men to play with. You'll are so, so much more. I can't put into words how happy it made me when I read that you got out of it. I'm proud of you, Natasha! And much love and respect to your best friend. Good job, mate.", "p_r_a_b_h_a_t30001": "You are so sexy👌😍", "fawad7982": "Wow😍😍", "sadafissa": "No word in the world can describe you as person. You are extraordinary girl. Much much love 😍", "kanttushar": "😢", "sandeep.roy": "If every one is open and transparent as you are then India will be a rape free country. My respects to you 😌", "goldy_thakur702": "👌👌👌", "unique____kanhu": "So hot&sexy dear", "ajamy26": "Strong girl💪🙌🏻🙏❤️every one wants to learn from you", "shubha.priya": "I have worked/volunteered at this NGO called APSA, which is a home plus school for child labour rescued children. I have met some of the kids(girls and boys) who have been abused. They used to come in very disturbed but in some time they would be playing, laughing like any other kid. Lots of love from the staff, counseling sessions and environment where they are not judged by what happened to them is the reason for that. I am blessed to have interacted with many of them and have made some difference to their lives. Natasha, when I talked to one of the girls who had a nightmarish experience earlier, she was so casual and was easily able to put things behind. There was no bitterness, no 'why me??'. She said now that worst things are over, I will look forward to good things in life.", "rohan.nare": "Loved it", "conchita_barretto": "❤️", "shalini31mishra": "Ufff😍hats off🤗u preety lady...m a big fan f urs😍n i always respect ur guts....loads of love😘😘😘", "nagpurdoodler": "Thank you for sharing this. This morning for the first time I told someone what happened to me years back. And my sister told me something similar. I really afraid to get in a relationship now.", "andrey88231": "35", "subhamfitness_07": "Energetic😍😍", "ankita_yoga": "This is something soo nice to read, women powerful and courageous enough to talk about such topics. I totally adore you for who you are and the way to give shit about others.❤️❤️", "monikasharmaa": "You go girl! ❤️", "neha_s_banga": "Wow.... U r a womn with super powers ...💋🌹", "ratnavasavda": "U r such a brave girl @natashanoel001... Is there any way to pour ur strongness in me? 💗Lv u a lot", "billa.dhaliwal.7867": "👌👌", "myra_5508": "More courage to you man 💪 and respect for honouring yourself 🙏🏼 @natashanoel001", "swathi.yoga": "You are another level of awesome, @natashanoel001 😍❤️", "komal.murarka": "Hey @natashanoel001 l001 Thanks for keeping me inspired and motivated....you being so vocal and active about everything (sex, body, size, shape, etc), does not let me forget that i have to love myself more and more everyday...i love you for what you are. Much love❤️", "akash.pathak.79": "Wow 😙😙😙😙😙😙", "rosette.joseph.731": "💓💓", "shubha_walke": "When you can tell your story and it doesn't make you cry, you know you have healed.", "i_am_rajeshsingh_official": "Too straight views, fan @natashanoel001 ❤", "simran_y": "@themoon.child_", "ahkxoma": "My respect for you just multiplied ×100 ! You're absolutely so amazing ! I'm in awe of you 😍 You're such a strong person and have overcome all the obstacles life has thrown at you ❤️ You deserve all the happiness and joy in the world. Stay strong forever ! I love you so much 😭❤️", "aahil9119": "Pure innocence.. ❤️", "muslim_khanms": "Gzb", "smitakshi_sarkar": "You speak your heart out..that's what makes u a wonderful human being..stay blessed @natashanoel001", "tramtramx": "💜", "nikita_leena": "Thank you Natasha!", "ajinkyagaikwad7": "Authentic AF! 😍", "kennethpearson101": "Creeeeeepy...", "abrarliyaqat": "U look unrecognizable", "elinahsiung": "Yaaaassssss let’s goooo!!! ✨✨✨", "ni_kita__": "Takes guts to share something so intimate. Kudos to u 🙌", "bala___subramaniam": "Your really awesome👏👏👏", "zainghaffa": "Hmm", "rachita.agarwal95": "Natasha meet me 🙈 you are so so real and true about your life, it would give ppl like me a way out to just feel that it's okay!!! I'm sorry I spam your comment section, but you're an inspiration ❤️", "venkat.kotagalla": "Sexy and beautiful pose", "surbhinegi721": "You are such a brave soul😊", "swapneshtiwari": "@natashanoel001 huge respect to you... Only few people can talk so bluntly about sex and you are the one... Cheers lady 🙌🙌🙌🍻 have fun 😇😇🙏", "marshal7289": "Indian babes", "simply_metwenty": "👎👎👎😔 It took you ages to understand it n irony is you still don't know what it is. It may take you another life to understand it. I hope you understand n feel hunger, hot, cold, breeze, thirst... Lol you funny.", "preetirohta": "@ayushattri, I so want you to read this cause I feel they are not just words but what this beautiful lady went through and how she is healing. Most importantly, I love her for her being HER. Dear Natasha, thank you so much for being YOU. More power to you girl", "shoaibnishat": "BOLD N VERY STRONG LADY 💪💪", "rahulepch": "True inspiration @natashanoel001 ❤️. You are the one who motivates me in every situation. #SALUTE.", "_only_once_u_live_": "😂😂😂", "ramshankar11": "Strikingly relatable", "nindia_sharma": "Yeah i say... Don't dare give a damn about people who hate u for speaking against their lowly conservative minds... U r amazing... Have fun.. Loads of love... I follow u a lot... Amazed", "manyajain._": "You are amazing❤️", "devudi": "Respect to you", "malinalli_xochitl": "💪🏽✊🏽🙏🏽💖🌹", "ida_priya": "Damn....I'm speechless you are an amazing soul and you make all the girls out there to understand they're amazing in their own way... Much love and much respect #rockongurl🤘🏻❤️", "deepapadmaparajuli": "You inspire me in many ways you don't have any idea. I was crying while reading and I can understand how tough work it's to jot down like this. I have huge respect for you 🙏❤️. Actually i feel you, I wish i could \"Love Life\" or even start to open up like that. But you give me hope. Thank you so much and tons of love @natashanoel001 💓🤗. More power to you😊", "arunchsakthi": "Nice❤️", "maheshmahesh8010": "So hot🔥", "danceraveenasingh": "This is super special. Thank you so much for sharing!🤗", "shashank_roshawan": "😜", "nishantpratap": "Thank you for sharing. More power to you. And to your boyfriend! :)", "jayeshsaid": "Hot one ❤❤😍", "sruthi__menon": "You have noooo idea but u give me a lot of inspiration...and thank you for that😌❤️", "anu_valleru": "😍", "running_rathod26": "Respect 💪💪", "panindie": "Respect!", "asthakumar1109": "Hey u know some times what we have gone through even we also cant explain. That feeling make us hopeless, every night when you are giving your love sharing your love but what u getting is lust, and hopeless part is when u know what u are getting and what u deserve. But despite of that we try till the last we can. And when things end then we can not even think ki what was that either i myself ruined my life or someone else. Also to get over from that is again task. I can understand completely you. ❤️", "bede_d": "You’re a real inspiration to many girls out there who feel the same, keep it real 💯 as you always do @natashanoel001 p.s: your #1 fan 💜", "geor_wisdom2": "What is the program", "zue_zee": "I felt like you were actually talking it to me!! ❤️", "vispi.hr": "Class 👼👼", "yogawithruby": "You must have had cried while writing this... Thus is so intense .. huge respect for you my love .. @natashanoel001 . 😘❤️🙏", "janekiraum": "Huge respect ma’am!!!", "dumbbellsandchips": "The post we spoke about! And yet again, BEST BOYFRIEND ever💞 so glad you have him now and it was AMAZING to meet you today 🤗🤗🤗🤗🤗", "jay_dee.uk": "Well this life everything happened for a reason .. parcel and package of life .. just gotta face it and enjoy while you still breathing.. 👍🏼", "defy_the_gravity": "OMG Natasha ❤️ it's like.. am I actually reading ? Hats off to your guts my love ❤ more respect and love to you. ❤", "rajput_rudrapratap_singh": "🤗🤗🤗🤗🤗🤗", "akankshashettyy": "❤️❤️❤️❤️❤️❤️❤️❤️🔥🔥", "niteshking.117": "You both Looking like a ghost 🤣🤣🤣", "rajendra.grp": "Inspired 🙏", "dnyaneshwar_khaladkar": "😍", "j_the_god88": "😂😂❤️❤️❤️", "deeznutsmtl": "Lucky best friend boyfriend 😏", "jazzy_hans": "❤️❤️", "_.shanagirl._": "You are like the elder sister I never had. You are so strong. I wish and hope that every woman would be like you one day. Sending you lots and lots of love from Kerala❤️", "sowmya2891": "👌respect", "imran200789": "looks good", "mit00777": "It good to share feelings... bcz ... then the person hv feel light....you. Need to understand three words S-Sentiments..E-excitement with Energy..X—Explore.... and you did it... So wish a happy intimate time -life ahead...", "pizzasandcaffeine": "🙌❤️", "this_is_sathish_": "I can't express my self right now. We need more women like you. Thank you. Love you.", "abit9475": "You Are A Powerhouse Natasha God bless You", "narendra108ji": "😊😊😊", "glorious_luna": "Hahaha I remember this one 😂😂😂 and you guys look sickeninggggggggggg 🔥🔥🔥", "nel_chow": "Totally awesome.... much love n light to you🙏🏽😊", "anuxhkx": "YOU ARE THE QUEEN, I LOVE YOU! ❤️", "bull_taurean": "Respect for whatever u r right now and more power to you .. Very nice post ✌️", "bdlrzq4420": "💖💖", "rratheeshkumar5": "👌👍👍👍🤗💪", "aashirazeem112": "😘😘😘😘🔥🔥🔥🔥", "thesamalam": "Wow.", "eisha_megan_acton\nVerified": "Verified", "beenuarora7752": "U brave lady😍😍", "yogini_riadawar": "I find you extremely courageous and bold. Bravo 👏🏽 thanks for sharing your views and feelings.", "rashmi.jain": "🔥", "pam_jacob10": "Respect to u @natashanoel001 I am left out of words.. noone can be soo raw and honest to share something this sensitive.. all I can say is Thank you.. u inspire me everyday. 🙏😘😘", "vikashchoudhary4525": "Sexy louking", "sygygy_sobber": "Everything is in static! Nothing is permanent in this world! You, me or this moment! Everything has a meaning , good or bad and experiences and consent. And realisation and obligations and commitments or choice's. Either you make it or someone else will make it for you. Without purpose life is always meaningless and boring or in present moment. What we have today may not have tomorrow. And tomorrow becomes today. And what is now it is never. Happiness is a choice.🌼🌻. Peace!", "itsmejvscorpionking": "Awesome 👏 never ever in my life heard or read a women so open about sex ....standing ovation lady", "visualsbybasit": "I liked your photos :) Greetings from other side of the world 😊", "phugeomkar": "COURAGE♥️", "iamjolly55": "Mam can you tell me some excersice for love handles and thights plz", "thenotoriouskicker": "It take lot of courage to speak about your past and bounce back this way ! You deserve each and every bit of this girl ! ❤️ Take bow down 🙇🏻‍♂️", "aditi_ishar_sharma": "I can't believe u shared it with us.. ❤️❤️❤️", "eshu_sharma_": "Inspirational 😎", "sugaries_by_mahwishaziz": "You are brilliant and honest and brave. more power to you!", "parikshitkothimbare": "Beautiful", "anandhi_naveen": "Thanks for sharing natasha... Lots of love to you😘🤗", "chinna_pramodh": "U being so vocal like this.. makes me respect u even more @natashanoel001 ❤️🙌.. have fun!! Love life", "12gargii12": "🔥❤👏🏻", "shammas_kandiyil": "Eppum eppyum pic kannunondee", "gandhisakshi_04": "💙💙", "immeetnakum": "🙌😄", "ankur_dhiman4949": "What the hell is this!! You want popularity on this fucking thing..what are you doesn’t matter but what are you talking this is the matter..", "bhupinderkaur": ".. brave GIRL 🤗🤗🤗🤗🤗🤗🤗", "samakshisidhu": "Stunning!! 😍😍", "zzilyhuma": "Wow", "ruigveda": "I can't even tell you how much there is to relate in this post. Just a big tight hug! 🤗", "de._.fleur": "You. Are. AMAZING! ❤", "miss_maaya_": "You are a unpaid therapist, hooman! I lob you. 💞", "mohmmadalipathan": "I LOVE THIS WOMAN @natashanoel001 MY INSPIRATION💪💪💪", "dara_suresh_official": "I didn't understand this sex story", "rocky_rocks177": "U r awsome", "theroshanbhatt": "❤️", "busyinhimalayas": "@jeditina do give it a read. This woman is an inspiration.", "hardiksinh_cher": "Cutest", "mathewjman": "It takes courage to share something as sensitive as this, even more so because of the feelings you associate with the deed. God bless you, @natashanoel001 . Thanks for all the positivity over the months I've been following you. Loads of love your way!", "surniha": "You literally spoke on my behalf girl, you are inspiration u are rock. Trust me lots of love to you😘🌸", "vinitha2112": "Only U can explain this so easily! More Love to u😍", "aamir._.mehraan": "Whoa 😲😲😲😲 just whoa @natashanoel001", "gazalasoin___": "Iove you natts❤️", "gayatri_roch": "I cant express, but seeing you share..i feel these are words from my heart!❤️ thanks love😘", "ckajal16": "Bravo 👏🏻 seriously i dun have words for this post #deepthoughts", "almost_arty": "Thank You for saving my soul.", "_inside_trip_": "💫💖💫", "official_pendu12": "Top", "anikaaks": "♥️", "aishnaidu": "Omg I love you! How are you so freaking real and raw?! So relatable and I feel you. Baby steps eryday ❤", "fashionmirror.in": "This has even happened with me but I never had courage to share. You're so strong. Now I have a partner who actually loves me and he never asks me to do it if I am not in mood. And idk how he gets so easily that I am not in mood to hve sex but want to be loved ❤️❤️", "natashanoel001\nVerified": "Verified", "terwadkar": "U are great mam big fan of u", "rishab198y": "Omg", "francis_jacob94": "😂🤣😂", "jaishikha_21": "👍🙏 ... I respect your guts to share all of your feelings here...", "ashbelleroze": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥💯💯💯💯", "silentlychaotic": "Much power to you 💗 love 💗 #goddess", "madhu.shalini.7359447": "Whats going on here! Wired pose!", "billasunay": "😍", "shagis1983": "Is it you @natashanoel001 👌🙏", "crisptrepidation": "omf you're literally an icon,, thaNK U SO MUCH FOR BEING VOCAL ABOUT IT being a part of a society that still treats sex as a tabboo!! So much respect you for you <3", "janeoliviar": "So umm I must basically stop thinking too much and start loving myself right btw go check DM please 😊"}