{"__in_natures_lap__": "I needed this soo badly. Thanks. Alot @natashanoel001 for posting this. Today I might feel comfortable during workout in gym (and i am gonna wear fucking shorts today) without any fear 😎 🙌", "mirakeel10": "🔥🔥🔥", "ssameer2409": "Nice", "swagatamguharoy": "from my pov ur body degrading or what do u wanted to show", "floyd_fernandezz": "Bad", "simran.oberai.225": "You are real, and you really uplift humans.👍. A real girl 🙆 .", "official.aakash.choudhary": "Yuk", "_s.i.c.k_b.o.y_": "@_a.c.h.i.e.v.e.r.128_ @trustcatcher_allen.o6", "schauhan129": "R u okay I mean r u not depressed ?", "ekidmonst": "Wow.. Great 😍", "sulekhasingh677": "Mast", "sidkorke_274288": "@nutritionist_akshay_kone", "princess_of_thummala": "❤️", "hitman_07sj": "🔥🔥🔥🔥🔥😍", "aniketacharjee": "Still worthy is soo good yar", "rohit_rayn": "😍😍😍😍", "nishmita.pai": "Simply awesome", "kadyanjitu": "What a tight round ass", "prajai6996": "🍑😛😋", "rosette.joseph.731": "🌪️🙉🌪️🌊🌈", "mvp_404": "@z6shogun @noigblack #exotics #xop #exo", "lolalearning": "I needed this today. Thank you so much", "kichufrkut10": "✊💦💦💦", "amdouni_alaa": "Nice ass @natashanoel001", "kbobby606": "Bahut ganda lag Raha hai", "priteshgupta_": "Thanks 👍", "rizwan_akram_": "🔥🔥🔥🔥🔥🔥", "gururajkumarmali": "Yes It is so natural... Good to see you spread awareness about it... Thanks 😊👍", "naba_dip7": "U are amazing ma'am...lots of love ❤️❤️😊", "valomojoseph": "Yes baby your ass is absolutely beautiful... I personally like the. \"still worthy\" side better... but again your ass is so beautiful 😍", "bigsingh90": "😍😘🔥 lovely butt", "maikofishing": "First one looks better.", "itz_raj4u": "Like the gape", "unicorned_007": "I wish someone told me this while growing up 💕", "hippie.noodle": "@andreaabarretto", "sanirudh906": "👍👍👍👍👍", "kp_pluviophile": "Agreed...accept n love urself..", "aqon055": "Фууууу", "jeevs7": "@mennogill", "lotuspirit.yuj": "🍦 😍", "sunil.rawat.79": "So hot🔥", "rapgyal_": "Still its very hot ...... i want it", "maharana_of_mewar": "Is pic ko dekh k kya bolu. Atisundar Yoga teacher? Esa. Aap khud hi puch rhi ho tag someone who needs this. Aap samne se dene ko Taiyar Ho to acchi bat agar koi samne se comment Kare to offensive. Ohhhhh. Pls aunty ji. Apki philosophy apne pass rakho kam ayegi.", "q.ueen1513": "I love you.... You have your own talent... Don't care what people says... Leave urs own", "shalom05x": "Soft ass..", "mdnaushad268": "Bed ass❤️❤️", "ala_wi90": "💋💋", "rakm5v12": "For women it is natural to hold Fat, on their Gluteus and thighs science has proven that this is the safest place for Women to hold fat, biologically women are meant to have more fat cell (cellulite) due to the fact that women's bodies are made this is called evolutionary. However what you see in Bollywood is cosmetic surgery stay away from the hype and to all men love your wife's and girlfriend's fat on their Gluteus", "sam_playboy4u": "So damm hotyyy...bt i think it would even look hotter in G string...try that once also...", "aditya.dombe": "Workout for thigh fat loss", "mona12__": "@reem_alsalem23 ترجمي لي", "israr_jamali": "nic amazing", "kalpesh_6886": "🙌", "renwill7": "Why two colors 🤔", "vishal_pardhe": "🔥🔥🔥🔥🔥", "saurabh_talmale_01.17": "I want to fuck you....", "limaadenilson11": "❤️ love", "gobeeboss5": "😎🔥😍❤️😍🔥😎🔥😍❤️😍🔥😍❤️😍❤️", "antoniovasquez264": "You talk about cellulite,well I don't see None,but I do see a beautiful woman who has the most sexy poses I've seen. O by the way you have an awesome booty. SMILE", "modernawareness": "👏🏼💙😊", "tan_tore": "No that’s gross", "dee.de.willytres": "Back shots🔥😋", "lalitha.mahaadevan": "Love love love love❤️", "chaubey__jii": "😍 nice back😲", "reynavashishtha": "😍😍😍love to u n ur spirit", "9687550190__veer": "👍", "13manan13": "hi", "pablopresh_aka_fleakaso": "U are energy!!!!!!! pure energy isn't constricted to one ideology and normalcy is so unattractive lbs plus the spirit/mind will always b the blessing!!!! the body is just a bonus but without the loving spiri it's just a empty vessel", "aamit_mahajan": "Soooooo...nice🎉🎉🎉🎉", "iamram.k": "You literally face palming everyone...hahaha good job", "mdaftab260": "my cock is up to seeing your image why", "viyan_singhaniya": "What a ugly bum", "imriyajain": "Hey! U r awesome..just saw your IGTV rape video! So glad to have people like you who r strong..its okay to have flaws..and to let it go (u must cry when needed and not pretend) just by seeing that video..i feel so positive! Thank you. U r Beautiful😘", "__the__nomadic___": "@muks_bhardwaj need it", "sathyaroshith": "Super nice", "sachiltp": "I think it's a high time we meet😋", "joshi._.shailja": "Seen something worthy after long✌️✌️ Love ur confidence😘😘", "rakirakigmai": "Nice Warkworth", "dummynatrix": "Which is real and", "urmukeshverma": "You are showing ass and after that you speak that people rape you", "mukundjhaofficiall": "When he accidentally Inserts to Wrong Hole 😂😂", "shyagaraju91": "Nice", "_siraju_deen": "She try tell something about .useful in the world XD", "murat_u.s": "mmmmmmmmm sexy", "koomarindraneel": "Is se achha pose hota yadi aap nude ho jati. You are a physical fitness trainer. Youngsters must be watching your posts. Don't you feel that you are promoting obscenity? Aren't you ashamed of posting these kind of pics showing your buttocks? Please don't be so bold.", "66erdal66": "❤️❤️😘😘😘👄👄👄", "shankarcsk": "Truth is gross", "ig_user96": "Your butt is black why?", "praveen_n_devadiga": "Hot🔥", "blasthustler": "Looks very nice Desi mami.😍", "yogawithaditi": "😂😂😂😂 ur crazy and a very nice person too.... Oh real too 😂", "emirabitch85": "wah kya gaand hai", "jeet_23rd": "I need it sweetheart❤️", "rjn__1983": "@natashanoel001 Definitely worthy 👍🏼👍🏼", "sunnysoam": "You are amazing and we can see the change in you", "axita.singh": "I need this. How did you manage to do this?", "prifit111": "@natashanoel001 kudos to u 👏 .I like u alotttt. More power to u girllll", "vikas_mau": "😍😍😘😘", "icc_education": "lol❤️😜", "pritishnaik005": "I want to tast", "_daily.punch": "Je te hais tellement", "prathip_pars": "Brave n proud f u for being yourself 👏", "marshal_micheal": "#respect you go girl you are an inspiration to many ! Keep inspiring", "joppansgraphy": "@hues.on.my.canvas", "lilmissgurung": "God bless your existence", "mithailallal": "Nice", "rachdharmai": "😍", "yogpragathi": "@salonishrishrimal", "sachin1414": "नंगे को खुदा भी डरे. Best Natasha", "karthik_luvs": "💦💦💦", "zeba273": "@bloodparadise @priyagupta1095", "ayeshayy__": "Girl! You're doing it right 💜 so much power to you and more love from Pakistan ❤️ we always say that inner beauty matters but that's unfair to our outer appearance because Allah made us! And his creation is beautiful in each and every form! I won't tell you to cover your body because that's for you to decide, if you want to be open and show yourself then again it's all your choice, and i respect your choice 100% even though iam a Muslim girl, and all these people saying \"this is disgusting\" etc are horrible because it's your body and how can they comment on someone else's body? It's your choice whether you show it or not. They can not judge you on the basis of how you butt looks or any particular body part looks. You're amazing ❤️ you do you boo don't let the negativity get to you like ever, it's so important to appreciate yourself before anyone else does and i think you're doing just fine with that 💜 self love is important. And for all the haters, trolls, bitches.. That's how a ass looks (atleast normal people's ass look like that, we all have a butt crack and cellulite and stretch marks and spots unless you want her to act fake and photoshop and facetune it then ok well bro) maybe you can try looking at your ass for a second and tell me if you vomited or not.", "sanjayjaiswal8562": "😍😍", "andrey88231": "Умр😢👏", "taufeeq788": "Nice buns", "buntybehlolpuria": "Sexy", "divya_ddee": "You are beautiful ❤️", "sdfitnessjourney__": "You badass woman🔥🔥. Society needs more humans like you 👌👌", "neha_s_banga": "Fir ese haters pta hai kya post krte hai, #eating pizza #driving all night #midnight party #boozing #whiskey #feeling naughty #chinesecuisine blah blah blahhhh... Atleast shez sharing her journey of getting in shape, not like before after wala photo session like old desi commercials... Firangi kapde pehnne hai par waisi soch nhi.. Dhoti saree pehno..", "fitveined": "I feel so proud after seeing a woman like you. Even after getting so many hate comments on this post, you still ain't scared to show it off. I'm really really inspired by you! Keep going girl!!", "sobii_xo": "You beauty!! Inside and out. Such a real, free spirited, strong and inspiring woman u are. Lots of love ❤️❤️😍😘 🤗", "officialsaheb_": "Leave everything which people talking about for you keep growing really love your work @natashanoel001 🙏🏾❤️ god bless you gem", "cutepanda1010": "Sometimes being mentally strong also makes us lazy for doing workouts 😟😟", "vikramvijan": "men stop commenting ....this is for ladies....u can't wear a bikini...nyways", "h3llins0n": "Perfect 😘", "the_rishi_jain": "Fuck right or wrong... I'm happy as long as I get to see minimalist clothing", "_dhananjay_fit": "Well point number seven (7) is the most important in these Post 👍🏻👍🏻👍🏻👍🏻💪🏻💪🏻👌🏻👌🏻🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻👌🏻👌🏻👌🏻💪🏻💪🏻👍🏻", "kkushal57": "❤️", "yolanda12netto": "Guts man! U got it all!! More power to u girl!!!!! :)", "valresh": "True that mate! I share your stories with my students in school btw!", "fardinkhan5936": "Good", "krishhsp": "I guess posts like this has to come out more in public. It'll definitely help in bringing a thought of self-love amongst people. #courage", "rahulsingh143341": "Lovely dear", "erddrathore": "Sexy bombbbbbbbb😘😘", "akshayo821": "Ssly @natashanoel001 u can change the mind set of ppl just my sharing post ,love the way u inspire ppl n seeing u grow like this n making society gr8 its awsm. Love u @natashanoel001 👍❤️", "tanha.pathan.376": "How you do this I want also make", "kiran.ghag1": "Saw the pic ..I was like is she crazy? Then I read your post I felt yes, one should really be crazy to do this on public forum to educate them about their body and this is truely informative... appreciate it, thanks :)", "huffman27lowlow": "💯💯💯💯💯💯😍😍😍😍", "vaish_0201": "@natashanoel001 You’re goals ❤️", "sourabh__pandit": "Comment section 😢", "feap.duran": "@_nemanja_ka", "ms.journo_": "I respect you so so much ❤️The way you try to break the stereotypes and bring out the reality is something which requires a whole lot of courage .You are the best ❣️", "tyran.mowbray": "@natashanoel001 go get em girl!!!", "dara_suresh_official": "No matter about tans and cellulite. WHATEVER WE HAVE IS A GOD'S GIFT.. love ourselves ❤️❤️", "prissy_saya": "You are beautiful💞 don't listen to all the ignorant people. Girl power #metoo #girlpower", "shafaqat_khan_002": "To black", "chrissyaky": "All these little boys here ranting! You should see how awesome we look straight after pregnancy 😂👍😘", "genebrandy": "Body positivity 💓", "mdwaleem": "Good", "manishrao.2000": "You are hot and sexy...", "cadetashi2111": "So clean you are natasha 💁🏻‍♂️bachna nazar na laga jaye tujhe 😘 Believe in yourself n I like that most in you 💐👍🏻stay blessed 😇", "hemant_iit_ism_dhanbad": "Why government not taking serious against this.our ancient age women are very much respectful and now today you show all your private parts to the whole public.shame you Natasha Noel.", "rabail.tazeem": "❤", "arvindyadav4597": "Beautiful", "leviierodriguez": "Me excita tu celulitis", "imranmohd6780": "🔥🔥🔥🔥🔥🔥super hot", "dayne_britto": "@_nap_kween poi this is called", "malhaar_95": "@natashanoel001 you are same inside out thats why u dnt give a damn what society says. Nw thats what i call a fearless soul🔥🔥🔥❤️", "sluggani": "Wow. Thanks a lot for this. ♥️🤗", "shanu_mumbai": "Sexy ass🔥❤️💋💋", "rjvkumar565gmail.com_": "Mam u are giving answers to every questions, which is needless, as u will not get enough time to rest, remember '' kuch to log kahenge logo ka kaam hai kehna", "riddhimaadvani": "Cellulite or no freaking cellulite.. You make me smile and most imperatively you inspire the heck out of me . Much much love and more power to you.💕💕💕", "lightningatsea": "@thefashionfitnessfoodie i think you might like this girl", "baaby_gal": "Tis is so fucking ugly. Pls behave decently", "_noor_khaira_official_": "U look sexy in worthly", "vikas591": "I like your reply to all negative comments, and self-esteem", "sethmadan": "U just gave me a nightmare for tonight...🤣", "reality_bite": "Its ths pic real or edited.. i am confused", "minaxikibeti": "This is so important! We all know it, makes it so easy to accept the reality and focus on more important .. mental health :)", "krishnnasharrma": "Wow❤️ I'm always insecure about the way my body looks. You just make it all better 😘", "akhileshkumarn": "So nice", "ananthraj770": "Keep on rocking ...🤗", "ghosh_shekhar": "Is this your back portion.... Ho ho", "mi_rasikaa": "When i saw your 1st video on FB.. You become my inspiration & motivation.. you are super cool n super duper cute.. keep posting.. I love you !! N yes don't forget to simle :)", "raskar.jr": "🙏", "amol_pupulwad": "👅👅💕👅😘👅💋💋", "inderpreet1512": "Appreciable post", "sarveshalka": "Wowww... Yummy Ass😍😍🔥🔥", "tokyoghoulof": "Would still eat❤️", "bbrraaatt": "Yuks 😖 filthy", "anjalivasisth91": "Please help me natasha", "sarkarlong": "U r amazing..", "marta_sev": "True body 💟", "mamta_chamkar": "Inspiring post 👍 just love ur replies 🤣🤣", "knathc": "most wonderful", "nnushkii": "🙌 You are awesum ❤️", "sathishrajay": "Lovely", "1186max": "Bindass your 👏keep it up.", "thepreetway": "Slay chica! @natashanoel001 #gorgeous 💖💖🔥", "rahulawatramani": "buttomotivation", "khan.mohammadyusuf": "Have pit", "beingumaima": "Omg thank you for this.. i always wondered if i dont flexed my hips ( like your right picture) so there comes my outer thighs which makes me worry how can I get rid of these bad boys who ruin my booty shape..thank you for thisss", "artistvinay6": "fir kahenge dekhne walo ki aankhe or soch gandi hai...yar upload krne se pehle dekh lia kro k kya kr rahe ho.... wai upload kro jo dekhne mein acha lage....", "ianimeshvishwas218": "Yaaak so 🤢 sick u r", "shashwat.singh.144": "Perfect.. ❤️", "karanthakur8085": "😘 ♥", "kittu_paryal": "Come to punjab mam", "navaneeth0527": "😂😂😂😂😂😂", "memesdeux": "Squeeze", "rafikcan420": "ILOVE YOU ILOVE YOU ILOVE YOU ILOVE YOU", "amitkhante": "Hey r u in hyderabad?", "paranoshirani": "🙏🏻🙏🏻🙏🏻respect!!!", "koshikupadhyay": "👅👅👅😙😙💏💏", "hhimanshu_19": "Looks fabulous", "narendran_kumar": "My work here was done... @krishautoo Dude. Respect Women.. Men would be more careful of what they talk if they knew their mothers and sisters are seeing what they do.. Think about it.. You could have a daughter as well!!", "srinivasan729": "Ù", "amitkumar878720": "😍😍😍😍🤔🤔🤔🤔", "aslam.khan.731": "Wow nice pic", "the_satan_wth_holy_mind": "I watch your posts and watch your stories too but I never followed you ,You are an interesting person this post made me follow you , You are doing great by bringing awareness and destroying stereotypes I see a strong women in you , God Bless You Girl Keep Rocking 🤙🏽", "sr66658": "Arre ye sab ky pagal panti h ap aise kaise kar lete ho gandi harkate", "kinglipscomb12": "🔥🔥", "_s.t.r.e.n.g.t.h_": "@natashanoel001 Bro u r the one ..hats offf !!!!", "apsaranazya": "ha ha what a pose..nice", "blackmamba123_56789": "Lovely.....especially right one is more beutiful....looks natural.", "ashish_salve6": "Just tel how u do it I mean confidence level 🙌 stay strong stay blessed @natashanoel001", "luclaluz": "I so much adore what You are doing, it ist great. You are a very strong Person. There are too few people telling the truth. I think I found my guru!👍😃❤️", "justbeatsproductions": "👀👀👀👀", "sakhi_harini": "I always saw cellulite as a problem, my friends, family told me I wasn't beautiful enough because of that. This post had given me more power to accept myself! Thank u again Natasha for another enlightening post😍 love you and God bless xoxo", "yogafitinc": "You go girl! 👏", "neelam_kandwal": "Love the way you loved your body one should learn this from you ❤️😘❤️ @natashanoel001", "jamesss_bond007": "💚", "akash.pathak.79": "👌👌👌👌👌👅👅👅👅👅👅👅😛😛😛😛😛😛😛😛😛😛😛😛", "salabekka": "Lady just STOP THIS! you are the only (verified) person I've seen using f* word in your msgs, all your stories are full of maniac Show-offs and doesn't make any sense.. and then why wouldn't you attract bad vibes here 😑😶 .. all your 'witty' show-offs are the reason for your stresses.. it is called मोह-माया, which is the root of all evil 🙏", "sabiiha_mir": "plz take classes in south mumbai@natashanoel001", "balkishan.singh": "Omg🙏🙏🙏🙏🙏🙏🙏", "angelbinu86": "Looks same like your face with different expression,😂😂😂 hot butt with scratchy poo", "bricine_ariel_brown": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "devorn_massiah": "🍃natural bom bom💯👌", "wilfredo_algarin": "@wilfredo_algarin", "ria_merlyn__vaughan_charles": "i love you soo much di ❤❤❤❤❤ you are my inspiration and you are the best love you ❤❤❤❤", "unnati9817": "How old were you when you were 40 kgs and what you do reduce the cellulite ????", "the4582king": "@shreyasagar8262", "khushijain_3": "I feel sorry for all the people posting hate comments here. Like dude! rEaD tHe DaMn cApTiOn! What's so hard? A lot of them are missing the whole point of the post. 🤦‍♀️ @natashanoel001 you are doing great! We love you and hope to see you again! P.s. yours was a great talk at tedxgni thank you for inspiring us! 💕😊", "_maddy__popzienz__roachkilla_": "Do wt u like❤️..dis society is so bad at judging💯", "rks2354": "Sexy ass 🕳💦💦💦", "dr.cool_sportsphysio": "Ur ass got 3 on 10 point. U can manage better than this. Still ur sexy 😊", "jonty.sir": "What a amazing body u have ...@natashanoel001 😍😍", "sourav_bhadra": "💩", "rohitraina0786": "Trying to earn money from apps", "dikshitha.m": "Clearly, the love outweighs the hate. So, YOU GO GIRLLL💛", "gravitygaminggg": "I have a foot fetish Can you show your feet please ma'am", "soniadang11": "Hats off buddy! This is do daring. Love you!", "shadow_of_true_love": "Wow...nizZ", "kamakshee": "@natashanoel001 I've been following you for easily over a year now and honestly hats off to you! P.s-i might have spammed your haters with the word 'chutiya', but just like body positivity, that too is needed! 🙃", "lexisstar": "I wonder what Mrs and Mr Kuriakose have to say about this", "brianklingelhoefer": "You have a beautiful body and seems to have heart to match. You are a beautiful woman", "being_ali90": "😍Bad ass girl😁👌", "ktan_patel143______": "You need to assercise", "vithalkumarpatange": "@sheikh_ali_sam", "renisht_": "I have marvellous way of making the ass more sexy....let me???", "zakzakriya": "Ur soo cutey an free minded gal 😍😍❤️", "a.tfunny_": "Omg 🤗😍😍😍", "___sonya.99___": "Кончара", "indianukretuern": "Nice and sexy ass", "kalpa0109": "You've super guts to show your (not- for many defeated ones) so perfect self in this world which only approves of all shiny smooth well groomed plastic existence! And brave enough to actually going out and trying to break this belief that being your whatever self is not perfect and you ought to put fifty filters on before you go out and start living like any species on our planet! Irony! They run television shows on how beautiful every animal is with their own characteristics.. and next show teaches you how to look exactly like your neighbor (or whoever) Does civilization mean cosmetifying?? Thank God for you and your brains! May more humans like you prevail 🤗", "tanya.fernandes8": "U are jus awesome @natashanoel001 feels great to be motivated by these post", "iesuschristus": "Sadeli gand", "gayathri_anoosha": "I just freaking love your vibes! We need more people like you! Honestly, I started loving myself more after following you 😄❤️", "i._am_.mani": "Yess!!! Cellulite is normal 💗 #awesomecaption", "hukanamatata": "#YUCK🤢🤮🤮🤮", "pplayer832": "@natashanoel001 beat pe booty , beat pe booty", "deepdusaarna": "Nice", "akshay_solanki.78": "@ds_sharma_deepak @khoj_ @paylu_52", "chinmayee_bidaye": "How i love you!!!!!!🤗🤗🤗🤗🤗🤗", "_aarav_khurana": "😘", "mumbaiactor": "Real AF 🙌👑 @natashanoel001", "estefaniawilk": "❤️❤️👏👏👏👏", "chandrashekharrr007": "I am your fan but almost got womited for 3 times. It's disgusting.", "mukesh_rajput1982": "Which is one is you.....sweet😘😘😘", "dahanukarsandy": "Just forget Kim kardashian. ...i think you have the best butt I have ever seen in my life..trust me on this @natashanoel001", "roy19810": "Dislike button should be there", "animeshmarkrichards": "Too show this u should have worn G strings or be nude", "monica13091994": "Your workout stories are simply amazing, Started following you some months back when you uploaded your video of that virus which affected your face ... Ever since then I followed your page and never miss a single picture or story of yours ... What you mentioned in your caption is simply honest and amazing .... Felt like appreciating you today , for everything your words your motivation and ofcourse I just read a series of some bad comments on your post and read your sarcastic replies too ❤ Amazing Your Ma'am simply amazing ❤", "sameer_trekker": "What are you trying to show.. i did not understand the post", "padhillon_2328": "hw did??", "efermalexander": "🔥🔥🔥 finally a good look at your sweet ass!!", "amit.2483": "You are really an eye opener!!", "aamin1992shaikh": "Cool work out..", "viny.007": "😂😂 you are awesome @natashanoel001 😊", "shansa01": "@natashanoel001 by the hate msgs you have clearly achieved to sift through the ppl who still judge ppl on their exterior presentation knowing well most are faked to keep up with peer pressure .. u are doing a great service by challenging them and with style! More power to you", "jatin_s0204": "Is this your back? 🤔", "thiya_gesh": "Brave and bold to speak 👏 hats offf!!!!", "nikinapier": "Thank you for this post! Owning our truth is the best we can do, and it's so relieving to see someone I can relate to. If we keep the body positivity going, maybe one day we won't need to feel brave and explain ourselves and endure judgmental comments just to walk around in our own skin. Much love.", "ashita_11.11": "Rightly said ❤️❤️❤️", "drivecar382018": "Love ur TruthBonbMon ❤️", "invincible_wini": "U r always beautifull😘😘", "vikas__9": "Soo many are clearly missing the point here.", "the_ridingsoul": "❤️ it is so influential post", "mahgund": "🔥", "bryceintraveller": "For all those negative comments, read about FKK Germany and you guys will get an answer to your narrow mentality Other than than keep up with your great work @natashanoel001 , you are beautiful 🌹 ciao !", "bnmanoj671": "What's difference in that pic", "angelasha16": "love 💝", "tiktok_gujjus_": "❤️", "onepunchwoman_": "@cynsmiley", "martian_spacepirate": "What to do for red bumps on butt skin?", "mayur_pawar_patil__0707": "So sexy Ass and so nice change👌", "ruchibold": "Ewww sersly yar 😢 disgusting", "raviteja419": "You are doing wonderful ...🔥", "inthelapofthemaster": "Haha this is so funny.love it", "tomnicolas1987": "Beautiful ass", "alicewellbeing": "How can some people hide behind a screen and judge. Shocked at some of these comments. I dare them to post the same picture.. cowards. Love this, good.on.you.! Xx", "vanisoodforvedantu": "You rock Natasha, I mean you are such an amazing woman with such clarity of thoughts, you speak precisely what’s needed and every single time I read your posts I fall in love with you and my own body a lil bit more. We need so so so many more like you.. much strength to you", "nishkama_karmayogi": "You are awesome.💕", "sinhaarijeet": "Sexy @$$ ...keep sweating @natashanoel001 🔥😍", "sonamsawhney": "Thanks @natashanoel001 ... I fall short of words to thank u enough for making all of us love ourselves. Thanks gal 🙌🏼👍🏻", "cobiacardar": "I so love ur confidence to live in this society.", "sowmiaow": "Woah! You are awesome! What you do .. put yourself out there so we can change the perception of what is acceptable and normal! Some people just don't get it and that's really sad. But there is still hope for everyone.. and when you speak your truth so loudly and clearly, someday they'll also evolve and get you! Keep going and glowing. Love and light to you @natashanoel001 💜💜💜", "rustamgryzly": "Beautiful", "anusha_anu._": "You own every part of your body and all that happens...so stop hating your body and start loving it.. because you are awesomeeeee ❤️❤️❤️", "neerajchauchan": "So good 😘", "raman3515": "Wonderfully said @natashanoel001 the world sees the woman in a totally different way. You are making a change.. a change which every common person needs to hear out! Beauty comes from within and we all should learn how to respect and take care of what we have.", "kumar_303": "Yaaakkk", "tanishq_raizada": "😭😭😭😭😭😭 thanks for these words man!!!!!.... I genuinely love you more after this!💖💖💖 This is soooooooooo true \" #NaturalFuckingBiology!!! 🙏🤘 @natashanoel001 thank you for understanding and imparting knowledge on this very hot shot topic these day!", "katkar.shrikant": "So amazing. You deserve love and your, re so worthy love you", "thattrendstalker": "Rightly put!! This cellulite is difficult to get rid of. I’ve been working out since a year now and my abdominal area’s cellulite is reduced but not vanished. Now I just can’t do more. “Ab hai toh hai💁🏻‍♀️”", "rupesh_singh_rathore_rajput": "😜😳😆", "johnpeter5153": "What the $&ck is this..like a dead body skin..", "devika1306": "❤❤❤❤", "sreejith2638": "😍😍😍😍", "prabhatsen80": "Bom bom", "seochanaro": "You go girl. Keep spreading the love and we will do the same.💕", "lisacardoz": "@natashanoel001 You tell them girl! 🔥🍑🔥", "bichukbabu": "Welcome to the Reality.", "vijy__sharma": "🔥🔥🍫🍫😍😍❤️❤️", "meghana_mua": "I agree ! Love urself and it won’t look like a what people call it a flaw !", "___shivanirana___": "@bartwal_neha", "yasnasehgal": "You make my day so much better Natasha! Love you 💞", "sushmita_0327": "Most beautiful bums I've ever seen😍😍🍑 You are one in a million, you never fail to inspire me daily Thank youuuu amazing human😍😘@natashanoel001 I'm greatful for your soul✨", "ek_taj": "👌👌I think you captured a slow twerk !! 😍#newtrend ( **Slow claps to my pj )", "deletedmarch2020": "That looks like monkeys butt", "sameeramarana": "Yes! Thank you! Obrigada", "khushboo0393": "Woman, I love you so much and you have no idea how much you inspire me and yes definitely you have been helping me a lot with my mental health. I legit listen and follow every bit you share here. This is just so awesome!! I hope to meet you some day in person and you're just to natural and you make me love myself everyday a lottle more than yesterday! Oh yes, Cellulite is seen as something which makes a woman's body look ugly as it doesn't fit well as you rightly mentioned about it ( soft, smooth and flawless) , I mean why can't we just let our skin breatheeee?? Why does it have to look flawless always? Also, yeah guys stop over reacting seeing this picture, it is just a fucking butt not like some poop out on the plate, nothing to feel gross about like you don't have Cellulite? If you don't then also it's okay just be normal with people who has as it is FUCKING NORMAL TO HAVE CELLULITE ON YOUR BUTT, THIGHS AND STOMACH 🤩💁❤️", "mindblowingmahi91": "I just love ur spirit 👌", "bhaveshsolanki2186": "Nice Improvement I like it👏", "nishantagarwal4732": "Yuk chii", "trishalratnakar": "Hats off to you Natasha !!", "nareshsakhamuri87": "❤️❤️❤️❤️❤️❤️", "rohina_nerdydevi": "@natashanoel001 You are an incredible person. I stumbled onto your account when I was hating my body and couldn’t be more grateful for finding you. Thank you for what you do with every post. ❤️", "mansooralimalik50gmail.com99": "madam jii aapki gaand me daane ho gye hai 👏👏😂😂😷😷", "vinayak_aarti": "Mentally healthy really true 😘", "doctor_iris786": "Dirty ass", "arteb066": "عجب کونی عجب ماهی", "mahboobali719": "💣", "ugargi": "I am dead. This is awesome truth♥️", "kyatgurl": "❤️", "ekram.ali48": "She is really an amazing person who came out from such treamdous shocking fact of her life but it seems she belong from kerala she can do this.", "amreeen.s": "This is Soo gutsy.. to go out there upload not so pleasing picture of your body but very very bold and impressive of you to do something like this. Also, it was a really helpful read. Kudos. 🤩", "she_founder": "Thanks for sharing this. Orange peel bottoms for the win 🙌", "khushbo0soni": "You are so real.. ❤️😘 be the same always", "samiee__cool": "eeeeuuuuuu so dirty hips🤮🤮🤮🤮🤮", "the_herculesrage_": "I eat thrm 🔥😂", "sanjana_chitla": "You try to be super positive in all👍🏻 even I would feel bad about my cellulite but after seeing your post I feel it’s super cool to have and not to be bothered😊", "the_unprecedented_scrolls": "This post is literally a reality check. I never even knew what Cellulite was cause I probably had the least visible due to football and gym. But now that I have 3 major injuries to recover from I have gained quite a lot of weight due to my large appetite. Thank you for letting me know that this isn’t something to be worrying about. Only thing that matters is getting back up after every fall. Motivation for the week for sure ✌🏻", "b2gogoi": "Reality has hit hard on some of your followers 😛!", "akshayc_11": "wats dis", "arzeroeight": "People hide a mark on there face that shows there mentality... We all have flaws it's normal....", "the_uptown_mom": "Woaaaa! Killing it with reality. 💥🎖️", "mr.sohel_jkhan": "🤔🤔something somethings", "soniakashyap_": "Well maintainance dear i like your physic as well 👍🏻", "sonu_astroved": "So nyc", "twinkle_bablani": "@hiyakhubchandani chill da !", "tom_anand": "Is this real??", "ravaliyadavalli": "These lines are worthy", "psmirzapur": "You are an angel natasha.. love you for sharing this and letting people know the reality behind photoshop pictures of models and heroines. If a guy like @iamsaurabh0014 just sees your picture will feel yukk but the real men will not just appreciate you; will also accept his girl without comparing with models/heroine’s body", "anushka_sunkari": "Love Uh ! Ur d Best motivation for meh🙌💞🔥", "rohit_doot_rj23": "👌👌👌👌👌👌 You are rocking", "iam_coffee_boy": "🔥🔥🔥🔥🔥", "alkjoseph": "So well put together!!", "hukam511": "इतना सा कहना यह भी कॉल देते", "rohitchaudhary3253": "Yukh", "cute_nakhhul": "Nice", "azanuddin16": "What a bump", "mp_mahi1234": "Its okk to be bold but this is too much", "brunodeadpool": "Amazing👍👏😍🔥😘", "rikuk73": "You are boldest women I have come across on social media... Bravo @natashanoel001", "jeffkurishingal": "Eweeekkk bad ass", "deememoir_": "These negative comments on your posts are so sad. More power to you queen. May you rise even higher and shine ever brighter. 🌼❤️😘", "al_bino_88": "Always been worthy..dont hate yaself.thats the worst outcome.just do what you do. Its rad as 🤣🤙", "1magic_peach": "Thanks ma'am for sharing such crucial info💕", "thisisk_sadik": "😍👍", "kunal____rajput": "@kapilsharma", "cute007pari": "@natashanoel001... Kudoss👍you are such an awesome inspiration 😍😘💕💕", "lovepreetsingh6012": "Nice", "beautiful_punjab9": "Dirty....😖😖😖😖😖😖😖👎👎👎Yyyuuukkkkkk", "yashikasakti": "You are amazing dude.plucked the courage bravo woman.❤", "deepa_naidu": "🙏 u r amazing", "aladinchoudhary": "Is this any disease?", "night_king_0001": "Hot", "prateechee24": "U r so fucking worthy!!! I m so fucking worthy!!! 😍💖🔥", "ohsoarzoo": "Big fan! 🙏🏻 More power to you!", "kaur_robinpreet": "❤😊", "_the_pisces_thing26": "The perfect reason for loving u mam💘♥️", "mishallbphotography": "Hey Natasha! This is such an amazing post. Sorry for being such a spelling Nazi, but you misspelled height in your caption. Lovelove", "raja_sandeepkumar_pal8033": "Nice bump", "akankshashettyy": "Omggg you're an inspiration I LOVE YOU AND YOUR WRITING♥♥♥♥♥", "rajwar.kavita": "This needs to be on the cover of all Femina, Vogue.... and all so called female magazines who spread only lies,, Love this BadAss....", "aarif7369": "👌👌👌", "defy_the_gravity": "Love your spirit to infinity ❤️", "raspreetbhogal": "What have u been doing I need to know", "karishma_verma10": "Always being conscious of a butt with stretch marks, you inspired me today that even with the marks, my butt looks the prettiest. You're adorable ❤", "serene.seeker": "Awesome", "____t_e_r_a_n____": "❤️❤️", "payal_liaa": "You have courage and strength. Its so inspiring... All hearts to you", "mangsho.bhaat": "@shreshtha_pramanik", "sheenu3107": "@natashanoel001 So brave....❤️", "myprettybride": "Babes you are", "sashi_its": "Hmmmm. I love them", "abhishekrajawat13": "Which after which before", "shweta.006": "@natashanoel001 you are such an amazing person. I wish every single person should feel the same no matter what we all are amazing in our own way. Stop comparing with others and accept your body. Eat well and live right.", "kunalf44": "bold af !", "krrishdil": "You are an inspiration", "danaysha.tulsiani": "You are so beautiful", "gaurav_singh1810": "Nice assss", "shawji_vivaan": "@akashseth235 @the_phenomenal___", "teerexx35": "Hell yeah 😍", "jyotirana777": "You are my inspiration of my current life. 🤓 loved the caption. True it is. And once told, but repeating isn't harm. It l get into hard shell also.", "imshivam_tyagi": "👌", "_priyali_._": "I love you Natasha Didi 💘🔥🔥😍😘😘😘😘😘 You're dm motivated person 💞💞🌍🌍🙈😘😘😘😘😘😘😘", "tranquilthreads": "This is so resonating, thank you 😊", "parmar.law.firm": "Eww", "randhirpallai": "Welcome to Hyderabad!", "dumbbellsandchips": "You my girl, are AMAZING!🤗♥️😍", "debsylee": "Your feed is inspirational💖", "monalchoprasareen": "Girl!! You rock!!", "keerthu_111": "Natasha u know what u are like freaking amazing dude I just love u ❤️ u are just bang on 😚 all your messages stories captions are like fucking useful man I really love u 😭😭😭❤️❤️❤️❤️❤️❤️", "ashwiniashokan": "നിങ്ങൾ വളരെ മനോഹരിയാണ് 😘😘😘 ഞാൻ നിന്നെ സ്നേഹിക്കുന്നു 💗💗💗", "shmuhammadalimehran": "Sooooo hot really!", "amulya.nag.m": "🔥🙏", "namrata01486": "We love u for letting us love ourselves 😘", "omvagerwal_official": "😍hahahaha", "anamikamondal": "Oh nat.. I totally dig this. And I love your truthbombs so much. 😍😍😍 U r an amazing woman. Wish to meet u someday 💕💕💕💕", "i__love_kyokushin": "She is professional.", "m_chandor": "What it is?", "thehobbitfeetrunner": "💙💙💙 ✊✊✊", "mbeingfaith": "You speak the truth like no one else @natashanoel001 ♥️♥️♥️♥️", "shelbybhala": "Well said.", "komaldiwan": "💐", "messi_10_the_goat12": "Sad reality of india is feminisn has got down to levels that showing the negative part of body is took as a brave action.", "__imajay": "Elephant 🐘 🍑", "raj272272": "Super", "_ji_choudhary": "Hoooooooo chiiii", "nemisha17": "Thank you for this Natasha. I really needed to hear this today. I love your #truthbombmon ♥️", "trishalah_": "Yaas. Love this so much. 😍", "yogesh.sharma.102361": "Wow", "samson9176061": "@natashanoel001 perfect booty", "shoesizeus13": "Badly tanned!!", "swapniltalbhandare": "Ky dekha liya subah subah.... 😕🙃😕", "jordonakins": "I know a good excersize", "yoshini_sumithraarachchi": "♥️♥️♥️♥️😙😘", "srisshreya": "@tanmayeetyagi", "noerolls": "So true! This would be a good message to read by ALL the guys 🤔", "hey.its.diksha": "❤️❤️", "himanshurajput140": "Most amazing person on insta ryt now...u r awesome mam👌👌", "_pwnkumar": "???? Sorry", "samkodolikar": "@filbert.d", "indianarmyrj": "Love your body 😘😂 @natashanoel001 💙", "mheshpanwar222": "Owesm mam", "reshmathomas_": "❤", "nashtegaurav": "That’s Beautifull Asss 🍑🔥🔥", "gr8chirag1": "🤔🤔💩💩🤔🤔", "mohez7585": "We all can very well see the tan the cellulite and some freckles on your butt too ...just fyi😂", "taaaniiishaa": "YOU ARE SO FUCKING POWERFUL & INSPIRATIONAL! Thank you so much for this, keep doing you, more power to youuuuuu ❤", "emranyusuf": "Brave women .. everyone has flaws , no one is perfect then why to act, keep it up", "lilmissdahiya": "Seriously, thanks for sharing this. I have been resisting myself on wearing a bikini bcz of cellulite and stretch marks. This definitely gave me another level of boost to do it irrespective of what and why I feel it’s only me with these problems 🙌🙌", "devyani_aww": "Needed this", "mostly_artivist": "Love love love..❤️❤️", "aman_khs": "Why so much wricls on back", "smitten21": "Way to go babe u surely representing so many women by doing this 😘such an inspiration and I also wish n hope many people get some knowledge out of ur post 🤗🤗love and wishes to u", "ajesh_jayaraj": "Finally getting to see someone coming up with real ass than the make up version 😂😂", "aryana_sharma._": "yesss! Thank you for this.", "dr_shovan": "scary 😲😲", "maheboobcsk": "Super", "ishitapobaru": "@tired.ancient.woman", "vickybhamre2022": "Charbi vali gand he yr kya bat he", "this_is_drishtinegi": "Thank you for the no filter no nonsense self love message♥️ p.s. i really felt angry reading all the negative comments but then i was like i feel sorry for them because of their limited mindset💩 more power to you girl🙌♥️", "indian566": "😂😂😂", "srivastava5682": "Adhe gore Adhe kale cream lgao.. 😉", "gaur1952": "What is this natasha. This is not looking beautiful", "methideepika": "You are so fucking awesome Miss Noel❤️", "anand_raj_t": "One of the good posts i have seen today(actually the best, perhaps) Not everyone has the guts to do this on a social platform.. Kiddos dear👍 this might enlighten may people, especially girls, who goes behind those so called beauty stuffs, neglecting exercise & mental health", "nomadsha": "Honest n real 👏", "pankaj90s": "💟💟💋💋", "chauhanasmita": "Zehhh baat.. u rocked girl.. stop body shaming... 😘👍...", "soul__fuck": "Hahahahhahahahahaha", "neha_chawlaofficial": "U r amazing gal...", "umamelgk": "U r amazing babe❤️ spreading so much selfluv...god bless u😍", "kshitijasddesai": "You go girl!!🔥🔥🔥🔥", "irutujakakade": "Thanks a lot for whatever you’re doing always♥️♥️♥️♥️", "pretty_lillian_": "Thank you for this 🙏 ........", "ajaysukhdeosalve": "There should be a courage to show the hidden things in your body as you have shown the crack n tan on your beautiful butt...🙌🙌", "vishaashaa": "So you so vividly yourslef, amazing. Lots of love darling ♥️♥️♥️", "meet_gogo20": "Such a truth bomb mahn💯Just wanna say thanyou💛", "shagunasthana": "Where do you get this amount of guts my love💕 ,i luv u", "anusha_arumugam": "U nailed it. U r real truth bomb", "hariharan._kumar": "Mam u r the gift for us presented by god in the world of fitness", "inhaledstars": "!!!! Your tan!!!! You must have had such a good time in the sun!!!!! ((Always get the worst tans when I’m having too much fun to remember to put on sunscreen lol))", "parasjaitley": "Haha... Awesome", "uthayaa_": "Dear Natasha! Recently I had found you in Instagram and started following you. Your messages are always positive and motivational. Especially for young and confused girls and women. If you try not use of unpleasant words in your posts then these will become more powerful and worthy. Only reason that I am saying this just because you are trying so hard to be positive and empower women so why negativity like using those unpleasant words like “fuck” and etc. Removing negativity from one’s life is one step closer to positivity. Don’t you think my darling. I adore you so much. So please don’t take this message in wrong way. I could have PM you but in one post you mentioned that you normally don’t read PM. God bless you 😇", "alittlewiseralice": "You are super Kind, super cute and suppppeeerrrr Human being! Thanks for your post, i become more acceptable of myself, more kinder to myself! Its easy to be kind for others but be kinder to urself requires work😇😇 😘", "bolo_annpurna": "@natashanoel001 babes you are inspiration..... How to tighten butts like this? Plz suggest.... Plzzz", "krish_2310": "Why like this..", "yeah_buddy99999999": "Kya gand hai", "tek_sonu": "Do everything, whatever you can do", "shewillness": "You are wonderful!! Just the way you are, keep up the inspiration coming ❤️", "evania28": "😂", "iahmed782": "You are amazing..... Natasha you are beautiful a daring.. That's why I love you very much", "shwetasm": "Keep working out, be healthy but above all embrace yourself the way you're! This is such an inspiring post! Lots of love! 💞", "bagyarajraju": "I love you natasha ❤️ u r the most bindas person I had ever seen", "sk_nagur_basha_786": "Good🔥🔥💕💕", "shahanakrystle": "What a rubbish", "pt227538": "🙈", "sachin_pawar_official": "Courageous😁", "sehlinaaiyub": "@natashanoel001 God bless you darling coz you inspire the world soooooo much and I love reading all your posts and status as well ....I ❤ you", "__ikhushi": "You're truly an inspiration ❤️", "findingshanti": "You are so cool!", "pri_k_": "Amazing strength and confidence!", "internallygrateful": "I like it", "manojaumta": "❤️", "mansee_saluja": "Thank you for being you 💓", "akhil.4122": "What is that...some white and black colour there on your butts", "_the__mad__af": "U always made me believe that it's okay how u looks feel proud in ur skin on ur body. Tysm for making me believe in myself 😊❤💪keep growing gurl 🔥", "sayakartini": "Thank you for shedding light on much not talked about topics. You're awesome 🤩", "nonii610_": "Yu inspire me a lot!!😘😘😘", "jan_th58": "My stress buster your posts and videos love you ❤️❤️❤️❤️❤️", "kumar.lakhan007": "sexy 🍑", "timetomakegains": "Both look yummy 😍🤤", "shashank_dubey25": "@natashanoel001 you r amazing❤️😘❤️😘❤️😍😍😍👌👌👌👌👌", "candyselvey": "Ahh love this!", "gagansidhuz": "Mujhe need hai😉😉", "iamakshkumar": "Grosss", "roshianrk": "@natashanoel001 Behind Every successful woman is her.. Butt! Nice Yoga toned butts! 😂😎 And you are so courageous and your grit, confidence and self worth is in a separate league of its own! Hats off, girl! More power to you! You’re my inspiration for life!", "ranjankumarbauri909": "🔥🔥🔥🔥🔥🔥Fire back", "nidhitthakkar": "Ur so inspiring... I have been fighting this battle with myself for sometime now. Buy this makes me feel better❤️❤️❤️❤️❤️❤️", "arihant2018": "Needed this badly..thanku so much..😘😘", "valsankeerthi": "😲😲🤗", "guriwaraich38": "Oh yeah 🔥🍑😍👅👅👅", "singh_ghumman_singh": "Misss natasha ur a real women in world ..u just doing insprational work ..i wish that u will get more and more sucess...hats of to u misss...realistic heroine.👏🙌", "kim_rosekd": "@natashanoel001 your just too freaking fab with your content & you are jus so realistic ❤️ 🔥 unlike the other fake people around Instagram faking about fitness etc.... Lots of Love & Good Wishes ❤️", "stylesavitri": "Great 👍 More power to you girl", "yellownailbarandsalon": "@azminmistryvania what we spoke the other day", "__darkweb_carder_black": "You have one of the good galleries I've seen today 👌", "moksha_dedhia": "You inspire me alottt😍JUST LOVE YOU ❤❤❤", "shaheemmohammad": "Cracked ass ewww .. this is not being professional dear", "brunoindia": "Your worthy for thousand million years, your lifestyle melts me to be with you. But I know it won't happen in my lifetime,so I would like to have a picture with you beauty ❤️", "adrian.knowsitall": "love you 😍😍", "dillonchan": "Well said - thanks for sharing. 🙏", "ajaygoyal_beurownboss": "I just loves your smile", "mr_wanderlust_6565": "Real ya Feke?", "berryshabby": "are u in hyderabad Mam.?", "shrutiash": "You are so good, not because you can post a picture like this on instagram , but you are confident about your body to an extent that you don't hide which people even dread inside the clothes as well. In the picture i could see only the cellulite because i am so conscious about mine. More power to you.", "chitreckoning": "Alwaysssszzz!!!!!!!❤️❤️❤️", "__eric__m": "In both you look beautiful", "_curlmuhi": "Preach !!", "subhamsrivastava": "My sunlight you're.", "soniyashweta": "You are awesome... Thankyou for all the motivation and positivity... 😘😘", "910neha": "Its just not awesome its beautiful hahahhahahahhaha appse acha kon samjhega", "subrothob": "@tinasub lease read the content babes. Worth it. #love it all in you. 🤘🏻🤟😘😘😘", "riju_singh_": "❤️❤️❤️", "adam_8547": "@natashanoel your tan make it looks like from two continents..😮 how did it happen", "beradebasis": "It's a new type of tattoo 😍😍😍😍", "ak26anksha": "You are just awesome 💗 love", "nishantpratap": "👏👏👏 more power to you!", "_mr.fraud.__": "😂", "taurean_bitch": "Motivation = you❤️", "aka_sooperman": "To This woman guts 🙌💥", "ps_love_fit_life": "@natashanoel001 love u for this post😍😘😍", "maivy.in": "Yaaaasss 💪🏻", "amitabhaurora": "Worthy of?", "greatvibes.x": "Cellulite is normal yea.. but that tan line is definitely not🤣🤣 jk", "ryanrrm": "@natashanoel001 I like it 🤷🏽‍♂️", "trippy_procrastinator": "Needed this so much I didn’t even know it !", "nikitawalia2311": "You are so fucking worthy🔥❤️", "chaudhry.85": "Beautiful 🔥🔥", "ra_impressive": "Nice look... Ha ha ha...", "sudmm": "So well put 🏅", "tanya_sagar": "YOUR THE MOST REALISTIC AND AUTHENTIC person out there 🤗🤗🤗", "mrigha": "This brings me so much comfort and such an eye opener! Thank you!💕", "priti2984": "Magic buns", "sukh_kaurrrrr": "Why do u wear too shorts close ok that ur personal life but then post it ... if u sacred from bad society 😑", "devil_side__": "Girl, thanku for existing😘😘💖", "anandhi_naveen": "Thank you so much😘... Needed this🙏..", "abhishek_varshney": "That's gross🤮", "rhea.sonk": "💞U r so bindaas", "surbhivermaa": "❤️", "yvishal8626": "Lovely", "_cencal559_": "I'll eat both😂😂", "airoholic_lover": "Good job 👍😊", "iheartritz": "I always read it like TruthBombNom and idk why it's seems more fun", "farseen._1": "✌✌✌", "pc_liveinspire": "I look forward to your truth bomb post every time. You have been such an inspiration Natasha...wish you nothing but the best..lots of love 💕", "leemarose27": "you're awesome @natashanoel001 such an inspiration.... i love you the most ❤️❤️❤️❤️❤️❤️❤️❤️ you stay blessed", "haiyashjahan": "I really don't understand sometimes what are u trying to show , feel or to give any social message🤔", "ashwrya31": "U are amazing! ❤️", "sahibaoninsta": "Always worthy! 🍑🔥", "akki277": "Mam may brother is big fan of yours. He is little bit healthy he wants to reduce the weight could you pls help him in this process @jha__sooraj_", "shwetasakharkar21": "Reason why I love you", "nawabi_yogi": "🤗👌🥰", "prashant_mishra39": "Awesome", "snehaditya18": "❤", "cecil.adrian": "The TAN !!!", "mohit.bhasin.102": "I Just love the way you love yourself and comfortable with being real....rise & shine..!!!", "zahira_malahum": "You are amazing ❣️"}