{"vikas_suryan": "@natashanoel001 sahi hai , pehle koi aur phone ab iphone X", "judeubah1912": "In this post to be honest, 2018 is better than 2019.for me not for anyone else. But I really praise your strength to do such exercises. ....much love 😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘", "priyanka_bakhru21": "Hi Natasha, began following you a day back, and amongst your many other posts, i personally love and connect to this one the most. I have been constantly worrying myself on issues of breasts showing too much, looking inappropriate, or just constantly looking like an invitation for men to notice. For quite a while and to some extent even now, i really disliked this part of my body. Breast reduction has been on my mind ever since i was a 7th grade kid who was constantly teased for having 'mountains'. Your post really made me feel like, its a common thing and reducing them in a much more healthier and non harmful way is quite possible. Thanks!", "saifikhanzada": "Good improvment of your boobs...what's is the size now...@natashanoel001", "mariyams18": "@pankhuri387 read the full caption", "anant040": "I agree with you. Instead of telling females what to wear, we need to tell the males to behave. (it's an old one, but still rings true to this day)", "saad_lemon__": "2018 baby😍", "bollywoodchokri": "Before pic is awesome it's life moment", "snehabhalla": "How did you manage to do this?", "apoorv_modi": "2018 is better🔥", "am___akshu": "2018 you look 👌", "11_abhijeetdas": "This is sad😶. Although good for you!😍", "royal_chauhan11": "Sexy girl", "nimeshlthakur": "Very deeply felt emotions there. Be yourself, let the world go its way.", "bulischmuli": "Even if a woman walks around effing naked, it does NOT give anyone the right to touch, abuse her or violate her body in any way! People need to finally understand that...", "kitkat_v23": "I just found your YouTube channel and couldn't believe the comment section.... IT'S YOGA, and these men were all writing disgusting, sexual things to her or telling her she is a slut for wearing GYM CLOTHES?!! WHAT THE HELL??", "subho._.deep": "@amy_elia2209 read", "nidhikmurthy": "This post is everything❤️. I’ve had a love hate relationship with my boobs since I was a teenager. The amount of times I thought of a breast reduction is ridiculous🙈.", "anushtha_jha": "You're an inspiration for many of us 😘😘😘😘", "im_rajanluthra": "Mujhe kyu lga rha height choti hogi e 🙈🙈❤️❤️❤️", "yogadoodle417": "Im sorry for what happened to you, not sure exactly what but it's probably similar with my experience. I guess Barbie pajamas are provoking to some men? I dont want to live in fear but I do.... bc that's the reality. That I am vulnerable.", "kole_jeffray": "How can you overcome the insecurities about your body ? I have been trying like hell to accept myself as I’m. But everytime I do , there will be someone to tell me it’s not okay to be fat . And I’m done .", "akankshavish1": "🙌", "apsodisiac": "Absolutely love this.. I have big boobs and I can totally relate 🙌🏼🔥❤️", "sonu18_abhinav": "Beautiful gorgeous 🔥🔥🔥🔥", "adinath.gaikwad.1": "👌🔥🔥", "rpetrina27": "This world should have a lot more people like you ❤️", "sumit.maam": "You look better in 2018", "aditijaiswaal": "I can feel you", "vishwa_karkalle": "Ur boobs in April 2018 really perfectly suited y r u loosing them?? Y? Y@", "josh07mjs": "You are ❤️", "__uday____kiran__": "😢", "rocky_ssinghh": "👍 Transformation", "believe_me420": "Ohh shit", "spandan__p": "If you got some time ! Go ahead and check your dm! You are really a awesome human!💚💚", "rockysir1818": "First one better", "izzy4addy": "This makes me cry. Cheers to you . You re so inspiring !", "udayanchauhan": "Not only Body, i see tour face too. Somehow your 2018 pic is lovelier. Sorry 😐", "vineet_wtd": "You look beautiful irrespective of boob size , but apparently no tan on the left side , too much beaches happening in recent time? I guess haha", "9_aalisha": "You look amazing both the ways.❤️", "badrisunu": "Try saree. .I think it's cover all body parts..or ignore all chip minded people.. 👍👍", "sunilgour991": "2018👌👌", "sydellcreationz": "One thing didn't change and that's your smile ❤️", "aniruddha.warang29": "Power to you 💐🙌🏽", "muskan_jain15": "💕💕", "totally.tanmay": "@aksharakaranjekar", "karltonsharma": "now ur moto😆", "ybbtemp": "As per view.. you are looking beautiful in left pic..", "dvya_parekh": "How u did this change??", "shriyyyaaa": "Thank you to instagram for showing this post on my feed. I dont follow you but now that i know who you are and what a beautiful positive person you are,here i am following you and stalking you and obsessing over you. I love you. Literally,this post of yours changed something in mind. I had depression and i still cant stop hating myself. But i think your profile will help me alot to be better. Thanks. Hope to see more helpful posts. Have a good day💕", "pramchandani": "And I’ve always thought that when I get rich, I will get a boob job done. Because honestly so tired of being body shamed by men and women alike for being “flat” and not being curvy!", "kanikaapatil": "Girl, I love you and your boobs are fantastic. You’re fantastic. Really really look up to you! 💕💎", "arg_225": "👍👍", "mainak_z": "That damn smile. ❤", "priya_queen_mumbai_": "Nice", "xarmarohan143": "August is very hot n sexy but now 👎", "_reshuu._": "I've always hated the way my breast are. I am short (5'1) and have a okayish body frame but my breasts are big for a body frame like mine. I knew I wanted to get a breast reduction done, once I learnt about it. Not only are they disproportionate but also give me a lot of back strain. I've always hated some parts of my body, like how thin my legs are and how heavy my upper body is. But I have also come to terms with it. I know I cannot go around hating every little flaw that I have because I cannot change everything. I have learnt to love my body and the reason I want to get a breast reduction is because of my back pain and how it gives me so much trouble while exercising. Thank you natasha for empowering girls like us who just dont know how to love our body. But I am glad I am on this journey if self love and I am never going back. Better late than never", "sarthak.agarwal.969": "Hot", "vinayvnuzz": "Nice 👍, 2018 one is good photo", "lavish_singh01": "Amazing🙏", "iamalivingmemereally": "Boobs sucks", "pkmallick": "U look soo preety in both the pictures. But 2018 is more attractive", "ms_daenerys_bing": "OMG YOU'RE SUCH AN INSPO! ❤️😍🔥 Just came across your page after reading ur story on @officialhumansofbombay and trust me, I randomly checked out your posts, and ended up being inspired af🤯😍 especially this post, is my favourite since I've always had a problem with my boobs and infact, my whole body but recently I've started embracing each n every part of my body, because it's my own. If I can't love it, how can i wish for others to??❤️", "ravishingtwinkle": "I don't understand the fuss obsession with boobs , if it's small people have problem , if it's big people will google and again have problem. just let it be. You are inspiring for spreading the inspiring message on body Positivity and confidence. Most importantly feeling confident about our own body.", "dhw.ani": "i used to get a lot of \"your tits are so small, you're flat-chested\" comments (and still get them) and was kinda insecure about my boobs but decided to stop giving fucks and now i love my boobs (even if they're almost \"non-existent\" lol)", "ananyabhalla23": "You are very inspiring to us young girls! You are the true meaning and definition of a social media influencer. A person who influences other people to love themselves and accept themselves how they are and to better themselves towards a healthy lifestyle. You are amazing. Truly amazing.❤️❤️", "riyas_ibnu": "Boobs😭", "liliths_labyrinth": "most of the men here didn't even bother to read! a lot of them really do think with balls and write with dick 😒", "neilmban": "Nats.. well said. To put it simply, you cannot clean the world of garbage, just wear your own shoes!", "yuvanselva": "Am I the only one who feel that u look like kinda @selenagomez on the left pic Miss @natashanoel001 ? 🤔", "gouthamchary1725": "💋😘😘😘👌", "aladinchoudhary": "Nothing changed🤔", "atulrampal84": "Good morning dear friend.. you are superb fabulous & world best .. keep it up.. 💪💪😇😄🙏", "kazimdelhi": "Pehli hi achi thi", "shelbybhala": "Well said.", "flashbackstories_": "@natashanoel001 Y are you worried about n3gative people and negative comments. People are gonna be that way only. They have not got the life they want. So instead they get happy by posting shit comments on all the insta profiles, so chuck the negative ones and look for positive comments and positive people in life. Saw your story and felt like talking with u for that so commenting here. There are just two ways to deal with such people either give them a tight slap by giving them a savag3 reply or just ignore them. They wil comment once twicr thrice then they will feel ignor3d and wil leavr automatically. Be brave be positive be good. Stay happy and keep going. Lot more to life then th3se shitty heads. Cheers take care", "akshay_s_salunkhe": "Second last line..! \"The roots of mysogyny are deep rooted in women too\" True that. Women have been suppressed for too long in the history that they have started feeling supression is the norm and that's the way of life. For example in the movie Padmavat jauhar scene at the end portrays exactly that. But I also feel that if the woman if she's willing to do the jauhar because she feels it right it is justified. Not because she's a woman but she's a human being with a proud choice she's making. But then I also feel that we need to throw out this deep rooted mysogyny", "invisibleillnessind": "💙💙💙", "ibrar_idrisi": "Wow yr good👌😘", "mohamedalisulfikarali10": "I tell you the truth u are perfect in2018", "zohaib_happy": "💪💪💪💋", "pranabneogi": "Wow you have maintained nice figure ❤️", "hemant259": "2018 superlike", "shreya12384": "Omg sameee feeling... I too so want to get them reduced. Not because I find them inviting or sexual but it’s more of the physical discomfort it brings being a person with height just 5.2...I always thought there is no way out other than surgery. But looking at you I m inspired and hopeful that it is possible without undergoing a knife.. if u can plz help tell what all u did?", "keshavdhingraa": "Always a beautiful soul doesn't matter age years whatever 😇", "yesh.parekh": "You just genious, I am 5\" 10 n hvng 105 kg weight I able to reduce 5 kg wanna reduce my tummy n bums portion, having knee prb n too much sweating so pls gv some tip", "rainijunaid_rj": "This one was so deep !! Thanks for sharing ~ true gem of inspiration ur for not only for a particular gender but for everyone !! Your post are not like a normal peep but has a trustworthy inspiration quality !! It am sure it has made people to change their level of thinking and reacting to a situation #keepinspiringus 🙏🙏", "theyummydaddyyyy": "People are going to sexualise your (every man & woman's) body and there's absolutely nothing wrong with it. It's human and is a part of making sure we still feel like reproducing. There's no cultural upbringing involved in sexualising because there are far too many cultures to follow the same thing, and yet we do. Why? Because it's not a cultural thing. It's purely a scientific process. It's a human thing. TL;DR - A WOMAN'S BODY IS MEANT TO BE SEXUALISED, BECAUSE SO IS A MAN'S. WHY? BECAUSE SCIENCE.", "saikumarrachha92": "Natasha u have not changed a bit. Let me be frank", "pranay9500": "August one looks healthy man", "tanha.pathan.376": "Last year you look super not now", "kedarnath_narahari": "👏", "muskuratilife": "U r truly an inspiration💪👏. This problem is very common esp among girls. Always having some kind of insecurity related to our body or how one part looks. So glad to have followed ur page 💖. U r a rockstar.", "rolando.paredes.58910": "What's the difference you look good either way", "zohi_handicrafts98": "پارسال سفید تر بودی 😂👌", "rucha011": "This is so so so relatable. Ever since I've hit puberty ...I've been aware of my boobs and the fact that they are big. I'm a 5\"3. And side profile pics or certain angles are just not hapoenong", "coleyolyo": "Errrrrrrmmmmmmaaaaaaaggggggaaaawwwwdddddd girl, same here!!!! LOVE THIS AND YOU VOICING OUT ABOUT IT 🙌🙌🙌🙌🙌 ❤️❤️❤️❤️❤️❤️", "ron_o_marss": "How many of y'all think the previous one's were better??", "roshanmohammad1703": "Ur good in 18", "jorawar4039": "Nice boob's. Nath utter gyee", "dashmeshpopli": "As usual a true post. Anyways, u looked good in short hairs!", "devildentist99": "Thanks for such brave post , yes it's brutal when a child is abused wish to stop happening to any kid", "extra_sugar_and_wine": "Ans i can see some bag at ur back still now😜", "_emanuel_the_king_": "You're good at photoshop 😆", "shadafaq": "Oh god I feel u, and I'm gonna send this post to all those girls I know who think thier boobs are too big or too small💙", "edgability": "💘", "tanvi.fit": "❤️💜❤️💜 @janhavilonkar", "chandrakantvariya": "2018 better", "buntyips": "U were more fresh in 2018", "gutycs14": "Luv ya!! @natashanoel001", "mahesh______g": "❤️", "a_girl_born_to_be_devil": "Push up karu???", "shiva_banda": "2018 Pic is the best 👍", "_.i_r_u_n._": "What happend to your breast", "hussain.thami": "I think there is no changes in ur boobs? its a dare pic🙄😝", "arunkapoor24": "You were beautiful n you are beautiful n you will always be.. @natashanoel001 you rock", "beingadeelkhanam": "2018 better", "richer.n.richer": "@natashanoel001 I have never had a girlfriend that was satisfied with the size of their breasts. If they were big they wanted them small and if they were small they wanted them big. Did you get a reduction or just lose weight?", "sarin_desai123": "Lovely God bless you", "aksasa32": "2018👍👍👍😘", "yummy_marshmello": "Bt u look more cute. More beautiful in 2018 pic", "ur_vish_yo": "2018 sexy cool lovely hot pic", "surj.surya": "Your cleavage ohh my god😱😱😱😱😱", "the_barkhane": "It was my birthday (19th August) when you took that picture 😊😊 , p.s. proud of you", "evil_king_chiranjit": "Boobs massage karti ho kya??", "shahzaib.khan90": "Miss natasha noel tume q lagta hai k tum kisi k leye sirf aik object ho jo bas tum se apni pyas bujhayga tumare ird gerd esy log nahe hain jo tumari izzat karte hon tumari baton se to lagta hai tum kisi jangal mai rehti ho jahan koi sher tume kha jayga y so insecure about every thing", "hebunsharma": "@itsswats_iyyer how I feel as if this caption is for me only 🙄", "rj_pratik": "Abad ko barbad hote dekha hai", "parab.abhis": "💞😘❤️🌷🌷", "ajinkyagaikwad7": "Screw these botched up ideas from perverse pricks...you decide what you feel comfortable doing", "missfit_trailblazer": "your outfit is lit just like you.. i love you girl 😍😍😍❤️❤️😘", "maverick_n_virgo": "And Suddenly They are Gone.....😱", "saailin": "2018", "rahul_the_challenger_loaded": "You very real like that", "sethmadan": "I always admire your wildness....but fuck you, dont dare you touch those boobs. If u do so, i will hate you for that.......", "iamneelanjana": "Wow to these chisselled jaw line", "krishnareddyvoleti": "Size is decreased haha", "thissrilankangirl": "You are an inspiration ❤️ @natashanoel001", "raj_kadiyala": "I wonder what happened to the phone case ?? 😂🤣🤣", "the_curious_curator": "You inspire me always! Lots of love and light!!", "y.chaudhary": "Both are good but I like personaly 2018 @natashanoel001", "rajagopalan_iyengar": "What kind of exercise you did for that. Great. U did something impossible.", "liz.palmeiro": "I can understand what you say, also because what happened to you at 7 years old 😭 it’s horrible. Despite of that I think that we (women) never have to stop doing or wearing something we like it because of our bodies or even be affraid of mens look. We should be FREE to do whatever we want and BE RESPECTED for it as a human being we are! No matter if we are women or men, everyone of us deservs respect. I hope you didn’t reduce your breasts because of men but because of you 😨🙏🏽 Best regards ❤️", "sachinmathane7": "Wow nic improvement 😮👏👏👏👌", "damanamohana": "Lipstick that lasts 8 months! BigMakeup hates her! Click to know more!  Jokes apart, more power to you, @natashanoel001 , for doing what you do. ❤️", "ddesai709": "😍😎", "a.boy.and.the.camera": "You're looking stressed in the newer one.", "arain7275": "so you habe reduced your boobs or not.?", "ripper_sudhakar": "Kudos. One has to value themselves over nd above the opinion of millions who aren't happy doing so for themselves.", "polobearings": "❤️", "i_am_mayurkapadiya": "2019 or 2050 always pretty 👌👧", "guriwaraich38": "2018 u r so beautiful and pretty 🔥👸😍💘💞", "iamkunalbhatia": "Don't know what exactly to say but can feel that what feelings what thinking always go on in mind of women of so many things which man don't even think about it.... And so many thinks of them also I always appreciate you for work out your talks your way of sharing and madness bindassness you always share I hope mentality change of men's and even women's have relaxing and enjoyable and better life rather than a sexual master piece or whatever 😇😇😇😇😇", "hardeep546": "Super sexy model", "santosh_naiduu": "@natashanoel001 Even though it's looking Damn Hot🔥 and even before also ❤️", "shreeya.shetty": "@riyaaraii @aish.prakash10", "vikranth_rana": "Frankly to say i do sometimes look at girl's breasts , but I don't stare it continuously in a bad way. IAM boy I do look at it but I have a limit , I don't stare their private parts when they workout or playing games or they pass nearby me .... Natasha Noel ur stunning , ur curvy u have an attractive body ,I do look at you but not like \"kamapisachi\" I never looked at u in a bad intention in my view ur smile is the most beautiful thing about you and u have a gud heart .... I would always love u for that , ur smile is constant I am gone follow you even u become a grandma 😊😊😊💗💗💗💗💗 love u tons girl 💗💗💗💗💗", "khurana.gauri": "❤️❤️❤️", "solve_love_problem2008": "★.समस्याओ_से_परेशान_तुरंत_कुछ_घंटों_में_समाधान★_.....🔱 Acharya Siddharth 🔱 Call & WhatsApp-+91-850-484-9222 🚩.I will do 100% solution with in 24 🚩 hour.Love marriage, vashikaran, lost love back, husband wife dispute, home problem abroad problem.Kamdev MAntra for love ,,online black magic to get love back specialist baba ji,, .Lost love spells Voodoo love spells,,, .Husband Wife Love Problem Solution Baba Ji,,★!! Call & WhatsApp-+91-850-484-9222 ★!! Your privacy is our policy,!! ★", "aashimamathur": "I really could relate to what you wrote in the caption. But is it really my fault if they sexualize my body? This alway makes me hesistant in wearing what I want and I feel uncomfortable @natashanoel001", "shanilps07": "2018 is best", "ankitkr_sharma": "I like ur older version.. 😘😍", "the_vinodkr": "Why are you wearing same dress for an entire year... 🤷🏻‍♂️. go Change🤦🏻‍♂️", "sannysscribbles": "This resonates so much with myself. Although im no where at peace with them. I hate them with a vengeance but its inspiring to read this x", "solo_thought_traveller": "🔥❤️💕💕👏👏🙌🙌", "ani_g9090": "There are millions who are dreaming of what you have, just that you havent met them yet 😊", "chinmaybhagde": "😂", "vijayakumaralagarsamy": "Superb", "freakfit_ashish": "Hey it's good to accept your body the way you are . You look pretty in both the cases.❤️😍it's easy to pass judgements", "_wanderingwonder": "maybe your make up was inviting as well haha.. you are a natural beauty inside and outside always", "gora.brar.7545": "nyc pic.", "valeriapard0": "So hot on 19th Ag 2018", "supreetee_mua": "I literally have big breasts. And a few stretch marks on them. But I am damn comfortable with them, the only thing I hate is the weight my back has to carry. It hurts. I don't wear clothes that will expose the ladies too much. But sometimes, you know, sometimes they wanna peek. And then the most comments glares and difficult perceptions come from women and not men. Always asking you to put them back where it belongs. Dress thik Karo and without putting them in words. Just very stupid expressions. Rolling eyes. I mean I am damn comfortable, why can't you let me sit and enjoy a conversation without asking me to hide my breasts? 🤔", "j_rahul_8": "19 april 18 ..🔥🔥...😍😍😘", "sanchari2911": "What you spoke is the absolute truth that most women face and feel in their daily lives. Thank you for this post. I feel extremely personally connected to it.. you are an amazingly brave person. Be proud :)", "temple_chakra": "Beauty never die", "agrawaljaya": "@natashanoel001 Hats off!! I just love the way that how you embrace yourself, when your statements hit my mind I really feel that yes we are free to do anything we should not think \" log kya kahege\" I really appreciate you and your work. 😍", "mokshadosa": "Me too. 🙏", "bindiyawali": "I love u natasha.. Same problem.. I hate my boobs.. I use to shrink my t shirt i use to lossen my t shirt.. My mother use to taunt dat u r a gurl.. U cnt get rid of ur boobs.. We women cn neva get rid of our boobs.. 🙏.. But wat to do..😑 dat was damn frustrating..i hve been harassed because of my big boobs.. I started wearing xl t shirts.. But no matter wat i wear.. Dey stare.. 😖 each and everyday was frustrating.. Den one day i thought.. Y iam Ashamed of my body.m dey shuld be those r sexualizing.. From den i wear everyone thing .. Fuck 🖕 everything.. No matter wat we wear.. Dey will stare.. Because we r females.. So enjoy ur comfort zone.. Enjoy in wat u r comfortable.. People will come and go.. But teen age wont come again Adultness wont come again..enjoy every min..🙂.. And learn karate and do some weight exercises be strong to break jaws.. Simple( sry my grammer isnt dat good but after seeing dis post i felt same like natasha sameeee )", "raja_sandeepkumar_pal8033": "Sexy looks", "__agh_o__r_______________": "2k18 🧚💥", "mumbaiactor": "More power to you Princess.", "sameerjai08": "Old is gold 😊", "muhsin_muneer1": "Lipstick changed 😁", "rahul_naidu24": "Glow of your skin has decreased", "niteshking.117": "Looking great. But few months your mirror got dirty🤣", "rbiplab": "U r so amazing...U r an inspiration..Lots of love...God bless u...", "kodwanigopal": "Ur pic says that u update from anroid to apple..", "abhicool97": "Nice phone 😂", "gayatri_roch": "The commet section shows exactly the filth in the mentality and ubringing. Just see the comments men are posting. More power to you Natasha! ❤️", "rules_maker525": "2018 wala achha tha...", "mariajershu": "🙄🕵️ strong lie", "nlshkmbhr00": "1 saal me bahut fat kam hue", "iamseema_2018": "Did exercising helped u loosing boob fat @natashanoel001", "shaayaar": "from i dn knw her to hey,i know this girl", "mchandrukavi": "😂", "rashid_bin_reyaz": "2018 was good .... Boobs disappearing due to your hard work out.... In 2019😁", "bhairvireads": "You are awesome. 💖", "mr.india_1996": "@natashanoel001 Fantastic Yaar... Finally within span of just 8 months.. U have successfully changed the panel of I phone from Red to Rose Gold 🥂", "hannahbayl": "Love your post!", "afzal.shaikh100517": "Beautiful", "myrkavp": "You are right, we shouldn't care about other's opinion, the important thing here is how you feel with them. I have a friend who will have a breast reduction, but the thing is about health and comfort. It's being a problem with her back. I think you do a great education from your social nets, and I hope men start to understand step by step women are not just a body🤔", "psychonaut_98": "Love yoourr body lovee yourrr body love your body", "yalla.surendra": "U look good in 2018 not in 2019", "nobyalolita": "@natashanoel001 ok. All that understood and I can resonate with you. But now also please tell how could you reduce the size of your breasts , which is evident in the pics? Because I was always told that it's not possible through exercise. But if it is, then please can you tell me how", "anshk99": "Yeah whatever, but you have a really nice smile.", "smriti.galaxy": "👏👏 PROUD TO HAVE SEEN YOU ❤️ DEFINITELY THE SYMBOL OF WOMEN IMPOVERMENT 👏👏👏", "kothareprasad": "But by d way what did u do to reduce them", "hathi.ka.bacha": "So relatable. I've dealt with these thoughts since I was 12. I'd wear a salwar kameez and cover myself with a dupatta at that age of 12. Hopefully, my education enlightened me. But the thought of being fat and having a generous bosom has always kept me conscious. Plus these stupid bra companies make such designer stuff, Kuch comfortable support ke liye hai hi nai! So yes, power to you and Hi5 girl❤️❤️", "annoying_creature9": "Well your caption is lit like always, but the differences I noticed are 1.colour of your nailpaint 2. Colour of your lipstick 3. Growth of your hair 4.your mobile cover 😂 and the level of temperature you have increased with your transformation we can feel that ♥️@natashanoel001 lots of love from your baby j.i.joe's 😅💪", "rizwan3791": "2018 me jyada acchi lag rahi hain aap", "divya6913": "Hey Natasha! You are so real . More power to you 😊. Btw this is the first time i hv commented on your post , however used to see all of them. Tk cre .", "learning2bmom": "Sexualisation is definitely there also with a bigger size I feel that there is a sense of policing also...people keep on indicating to correct the neck line even if there is a hint of cleavage.... I hate that the most... off late I have started saying that if something is visible then I hope the view is good and just continue with whatever I am doing", "syed_abid_ali872": "2018🔥🔥", "cageddino": "Yay.", "som_chebolu": "Aptly and boldly put.", "aly.hussain29": "Girl touche' ....", "sureeaerospace": "Medam jaldi shadi karlo bcz...Both pictures may lots of difference lagre hai ...", "shah.hardik717": "Phone also changed😂", "vishal_pardhe": "No phehele wala he ache the", "vemjja": "You're pretty... I love your nose ring", "badassvegan_": "You Are Beautiful in both pictures 💖💖💖🔥🔥🔥🔥", "inc0gnito00": "Natashaaaaaaa i love you... I extremely love the way you keep your thoughts on social media and also inspire us... I hv the same issue... I just hated them from so long... My mentality was the same mujhe bhi esa lgta tha that they seems to be inviting i just want to be breast less for a long time now i understand that they are part of my body i just learned to accept tham and people like you changing our mentality.... Thank you so much ❤️ you are inspiration ❤️", "sunilkumar_ts": "I don't commit on your body but ur face also looking dull", "shubhamgajbhiye5": "Old is gold❤️❤️❤️", "_i_m_jitu_": "Huge difference.......👍", "vijiv_": "Wow💞😘", "branded.kamina143": "2018 is best", "i_ravianurag": "🔥", "prashant_dbot": "Grt but the first picture I saw is lokin more healthier n more sexier.....but I love the change keep practicing....😊😊", "singhhp73": "Very beautiful pictures 2018", "dharmisth": "stunner ...🌹", "siddhantlotia16": "A very hardworking girl ❤️☺️ keep it up dude . ☺️ any help required for making videos let me know mam ☺️", "anishrjput001": "awesome yll😍😍", "fpd34": "Me gustas muchísimo,mi amor, eres guapísima, dame tu Whapsatpp por privado y hablamos por hay directamente mejor ok,mi vida, besos 💋💋💋 😘😘😘 🌷🌷🌷🔥🔥🔥", "lenyjfranz": "Pretty Hot 👌", "engineer_2016_p": "I wish you never get rich", "kunalantinakaram": "A thought provoking write up", "haji_crescent_": "❤️🔥", "anantmallick5803": "Nice", "_sameer_singh._": "But you looks good with your old boobs❤️💯", "shrislife": "🔥🔥🔥🔥🔥🔥🔥", "meow_amour_20": "❤️❤️ ❤️ you are an inspiration to me! No matter how our body looks we are moving forward! No looking back! ❤️❤️👏", "mystery_curl": "One thing that hasnt changed for sure is that laundry bag. If i am not mistaken. That \"grey thing\" at d back. Jokes apart, u look great always.", "manasirsy": "2018 is sexy", "_its_blackwidow_": "@natashanoel001 I can so feel each and every word you. Said here. It sounded like I am talking. When I say this to people they just say you are just bragging your melons, who wouldn't wanna own them.", "your_werewolf.28": "In one year you just lost your iPhone back cover 😂🤣", "jen_vonhagt": "Keep going strong. Read all your quotes just superb and so motivating", "pejman.jokar63": "2018", "lucky_hsp": "weakness ho gyi aapko", "srinivasan729": "Hii good morning", "ajinkya_shinde_aj_the_cool": "2018 best", "sourav_sodo": "👏", "pinkcosmosflower": "This is so relatable and my state of mind since the last couple of years", "snehashikta": "I am so glad that I follow you. Thank you for this @natashanoel001 ❤️", "dimplekachwaha": "Love u gurl", "mrizwan85": "2018.... better!!!!!", "dagonislord": "Powerful post; thank you", "spaakohli": "Can relate to this sooo much i’ve had bigger tatas than my body type since the day i had tatas so i’ve always been conscious about them and have always tried to cover them..but recently since last 1 year i have started to like them and wear top which flatter my tatas... more power to you❤️❤️😘😘", "suchi.shiv": "👌👌👍👍👍", "_mockingbird_tales_": "@natashanoel001 i am on your side for this. I hate them now even more regardless what u wear or how smart and well presented u look they are always inviting and in the end u do tend to lose a lot of self confidence in this process... i have always had this problem and not sure how to embrace it bcz they dont listen to me at all 😢😭😞", "djshawnjermele": "Interesting! you must do you that's what's your life is about not about others just bout u!", "saisnigdhaa": "Hey Natasha you're such a great human being. But it's 2019 and there's still bodyshaming... Like I've been through it my whole life and I recently had one episode of embarrassment. People have always made me feel insecure about my weight no matter how much I try to ignore the negativity it gets to me at one point. Please help", "harshathulluru": "Looking awesome at 2018 pic❤️", "sneha_261": "I luv how real & raw your posts are! 🔥 #womenforchange", "reyin_on": "Great effort dear......... 🙌.. th old one was gud toooo😘😘", "_abhishek.majumdar_": "You know what remained constant throughout your year long transition? Your smile. I've observed this for as long as I've been following you. Whatever maybe going on in your life, you face it with a smile,, however hard the challenge maybe you face it with a smile! And yes, you've taught me an important lesson, that in an all serious world, sometimes all you need to do is lighten up because being grim doesn't help either!", "naseerkayam": "Hehehe", "sridharsri_r": "Omg @natashanoel001 wit in 8 monthz you changed your iPhone.... 😮😮😮😮😜😜😜😜", "sagar.ingale10.10": "boobs ki size kam ho gayi ...2018 best picture🔥😍👍", "iu_bhutra": "You inspire ❤️", "_punt_guitarstuff_": "19 th August was more beautiful", "simran_devghare": "You inspire so many girls out there. More power to you girl❤️❤️💪🏻 @natashanoel001", "meghi.aggarwal": "You look AMAZING, regardless of the size of any part of your body. ❤️", "itz_me_dadslilgirl": "It s always worth reading ur Post Natash. Look at those smiles!! Nothing s changed. It is very Contagious. Love u❤ & more power to u✌", "thekev69": "Well said 👏👏👏", "tanisha_1007": "Did exercise help you to get rid of the size...", "a186m": "Nice fig", "sid182918": "negativety at peak... Just insane", "saadharan_ladka": "I lost my mom,few days back! Depression and anxiety is something pushing me back! And people around me make it even worst,they are actually kinda destroying my inner peace! If u could help me pls do!", "crazykhyati": "I liked you then I like you now :* @natashanoel001", "k.r.sharma_44": "But they were amazing🙄", "clean_eats_and_cheats": "You are awesome! I like reading your posts.", "kaminibae": "Even i feel insecure wearing loose cloths or cloths that shows my boobs, how should i reduce them ?", "rajaputhran": "Really impressive piece of writing", "bijoya_vocals": "thank you for this! 🙏💕 being a fuller person.. I can relate to this so so much! wishing you so much healing 🌈❤", "marcus_instag": "The one change I noticed is that the iPhone lost its cover", "manavis4u": "U have changed Ur mobile @natashanoel001", "jakkulachandu": "Old is good", "gazenz": "Wow amazing stuff", "abhishekkbaghel": "🔥🔥🔥", "mhkeshkumarmuyal": "V. Good.. Lge rho... 😍😍👌", "nikitadadhich_": "Well..this is the very first post with which I left so damn relatable", "mysterious_soul028": "@natashanoel001 hii..I won't comment on the content as it obviously your body, and you got the rights to shape it as per your own choice. But I must say, u look more joyous and cheerful on 19th of Aug😊😊 and I hope outside negativity won't affect your determined confidence.", "vishu_ganguly": "Na phle achi lgti thi or na ab😏", "baig_asif": "One thing common in both the pic ur smile 😍👻", "nikhitaputta": "Absolutely! I noticed that when I am in India I am constantly cautious about my posture, what I wear, who I make eye contact with, covering my boobs etc. Like you said, I have tiny boobs and don't even have to need to wear a bra but am sexualized never the less. I am still a prey for those predators out there. I know and understand what it is like to live in constant fear. The only time I felt free was when I was in US. I was of course scared of racism & getting mugged but all the boys around me were scared of the same thing. I wasn't going to be a victim because of being a woman. That was extremely liberating.", "princess31kup": "Nothing wrong in you.... Be Happy", "nameissaravana": "I liked old one😘😘😘😘relay hot and spicy", "tina_ghosh": "i relate 🙋🙋🙋🙋", "sauravkumar21": "Always an inspiration👌", "ravindran1987": "2018 looks better", "thisismesindhu": "@athira_vikram", "crisarjun": "It's you who we love @natashanoel001 ..😍😍.no matter if you have big or small B's", "himalayan_brute": "August was quite impressive 👌👌", "gazalasoin___": "Fuck this Nats, I have been going braless since a month and I feel so fuckin free, I have fat titties too but WHO CARES. I love the freedom that I feel. Lots of love and power to you. @natashanoel001", "arkapravapaul": "U look fabulous 😘😘 just the way you are, we all love you ❤️❤️just the way u r. Breasts are a part of the body and not an object to ogle at. Panache and confidence is what makes a woman sexy and desirable not just her breasts or butt. 👍👍🤘🤘@natashanoel001", "diagarg19": "I love u that's all I know 💓💓... More power to u 😘😘😇✊👍💪", "divyanshi.s": "You're inspiration for each and every woman out there 💋💋", "shaktirupadash": "Phone cover is awesome in first one and also the coka❤️🔥", "niyaz.ahamed.9": "Best person to talk openly about all @natashanoel001", "shete4177": "Your smile is getting broader", "welcometoluckycity": "💙💙", "thehappytum": "Exact fear i have go through.. And it's really appreciated.. Thank You!! 😍 and Could you explain about how this transformation possible..", "skn_010": "@bhavya_rajput9436", "khushbu_97": "You’ve spoken for all if us! We hear you girl ❤️❤️❤️❤️❤️ @natashanoel001", "kavs.ram": "I went through the same thing as you. Hated my body, but then I learned to embrace who I am. And now I am a happy person!", "harmannat12": "Truly amazing❤️🔥", "asj.ind": "💪😎👍", "aditya.johny": "You take about any topic with ease💐", "jatin_s0204": "Keep all this for comparison after 10 years", "mayy_hair": "Your perfect the way you are. 💜👑", "khyatinagarsheth": "Soo relatable 🙌♥️", "b.rajashekar_reddy": "So beautiful", "apurvabansal_": "Your post was not even loaded and I liked it , you are such an inspiration , I saw you first on josh talks and I can't explain how much I respect you !! Much power to you 🙏💥❤ @natashanoel001", "manasmani1": "1st one is better than 2nd one", "nitesh_agarwal56": "killer look...always@natashanoel001", "aparna_sharma2393": "Real life hero🦁🌸❤️❤️", "ingridsarat": "Eres hermosa ❤️", "vishakha_hanumante": "Omg! The ultimate truth is here...you posted just what I wanted to made my body understand. Thank you so much! Lots of love ❤️", "txrushx": "Kween", "beradebasis": "Redusing😍", "the_introvert_men": "I like the prior one", "nivethana_manoharan": "@prashu_rj @sathyabalu", "sparklinggloryofthesoul": "I like both the pictures💕🙏", "mandirasometimes": "U r my inspiration Natasha I love u!!!!! I had a question-how do u overcome ur body insecurities and social anxiety?!", "arjunk0011": "Iron lady❤️", "te_amo_jay": "Why So ChanGeD.......?????", "shape_spice": "Awesomeness as always! 😍😍", "akshay_bharati35": "2018🔥🔥😍", "varunsudhakar": "Oh nice the phone got upgraded 😎..", "lostgirl_1111": "🙌", "sanyanarang": "❤️❤️❤️❤️", "mehakk.sharmaa": "I just wanna say, it's not bout our breast it's all bout there mentality. and i appreciate your words and thoughts. i've faced this problem that if you're wearing a turtle top you're \"inviting\" if you've fat bags then log kya khenge. and i would recommend who cares.??? i don't if you do then stare, i don't so i'll not give a fuck. and yasss i love youu❤️ you're the bestttttt. hats off to you.🙌🏻", "harshitttaaaa_malhotra": "Now, that’s what I’ll call working on yourself", "block4635": "Fantastic looking on both❤️❤️", "natashanoel001\nVerified": "Verified", "manthan__mk": "❤️🖤💖 NiCe | OsM 💖🖤❤️", "vikasbharti7777777": "2018 is more pretty", "potatoesanddeadlifts23": "Your phone had a great transformation tho🙌"}