{"iamkind_whatisyoursuperpower": "1. Charuta or Ruta for easier pronunciation 2. She/her 3. Teal 4. Anxiety, Recovering from depression due to rough childhood, CSA survivor 5. I want to help people get holistically well with emphasis on mental health together with Yoga and their choice of physical activity. My super power is empathy and being kind to others (and recently started learning to be kind to myself too). Big hug and lots and lots of love to you. I'm inspired by your mission to help people and love your daily efforts towards it. Appreciate your authenticity. Take care ❤️🤗🙏", "ayushgaur619": "At last i want to say it i enjoyed your post. Keep posting @natashanoel001", "joseph.4049": "Babe u r so hot, can I get a chance to be with u", "maharana_of_mewar": "So sexy booty n thick thighs🍑", "shivam_dhankhar_1997": "👍", "sumon_rahath": "Baby..U are so sexy...", "mr_solanki2103": "Lgta h baat ni krni then bbye", "innama.mirzaa": "Hii Natashaa...You are justt slayying🔥🔥❤❤ expect a reply from uh😄😂😁", "minisharma211": "1. Mini (my family n frnz calls me minz) 2. Her , 3. Red & black, 4. I was suffering from ascities last year.. by God's grace fully recovered now, i was completely shattered when i was diagnosed with this fatal disease but deep down inside i know i am a warrior :) 5. I am an animal activist & an ardent animal lover.. i want to spread the awareness regarding animal rights & tell people that \"All lives matter' my motive is to establish a shelter for abandoned, injured, ill , & homeless strays... and last but not the least @natashanoel001 you are a true inspiration ❤❤❤❤", "dukankirana": "World most beautiful figure...World most beautiful figure...World most beautiful figure...World most beautiful figure...World most beautiful figure...World most beautiful figure...", "maxmahesh_iyer": "Biggie 😀😀😀", "mahen_ashar": "Great look and great job", "umsram": "❤️🙌", "aayanmukherjii": "Nice thighs", "fazalmehmood4": "😢", "bsmalikbash": "Beautiful smile❤️", "sh.anu6404": "😀😉", "sirajsd8": "So beautiful", "bharat.godara_": "💜 #HeartTheHate", "kanbha74": "💜 #HeartTheHate", "priyagreddy": "💜 #HeartTheHate", "parthasarathy.arun": "1. Arun (Friends call me mama & family call me Aruna) 2. His 3. Any shades of blue, 4. I am a diabetic. Just trying to get my diet on track. Dont get sleep in the night. Have a doubt if I am insomniac. 5. To myself - obviously wanna do whatever I wanted to do from childhood, to the world - if not to the world, at least to India want to change the entire political system. Super power - if I had one I would have brought in the change as said above. @natashanoel001 - thanks for your posts. Great inspiration you are 💐💐", "tasneem.aliasghar": "1. tasneem 2. preferably they/them 3. BLUE 4. AAAAAAA ok mentally: bpd, anxiety, bulimia (recovering but keep relapsing), chronic depression, ptsd, body dysmorphia. physically: pcos, chronic pain in my ankle which makes no sense, and idk if this is physical or mental but an addiction to self harm. 5. id like to write a book that would change a life, someday. i think my super power is hugging, i give good hugs", "anemployedinkedindian": "Sailicii is my name - you can call me Sailicii pronounced as (sai-li-sii-) = she/her = fav color definitely green also my lucky color! == born and bred in Malaysia, by origin Indian, 5th generation of ancestors who have already settled down and now I am much Malaysian compared to being Indian but I have lots of my roots and I love my roots ==my super power is that I do not give 2 shits about what anyone would say about me, think about me and I have ways kept going on at doing things I want to do.. And it wasn't easy getting where I am now.. I have had my lows and my downs.. And that's how I motivate people around me.. As long as their in my circle I keep them up.. Motivate them to do what they want to do... Which is the only difference I can make from where I am.. And I work in a field very similar to doing that on a daily basis.. ❤️ And I love what you're doing on a bigger scale.. So all the love to you!!! 😍", "alej726gc": "Mmmm. Bb", "preetiching": "You are a beautiful humans being . There’s lot to learn from you ...I feel your positivity through your post and that is all we need . Good people and Good thought ... world will be a better place soon if we have more people like you around us . Keep rolling your best like you do . And yes I like those annoying faces that you make .... are they really annoying....hahahaha not really .... I like it ... muahazz", "imdarshangor": "🔥🔥🔥🔥🔥", "akhileshkumarn": "Nice curve and ur butt bb", "real.hindustani_": "🔥🔥🔥🔥🔥🔥🔥🔥", "thy_art_hoe": "1. Pulkit Kushwaha, call me Captain Jack Sparrow, please. 2. Her 3. Black 4. Anhedonia, Emotional Flatlining, Numbness, Depression, Anxiety, Overthinking, mild bipolarity. 5.Just want to feel again so that I can make this world a beautiful place by loving everyone.", "r.rashmisinghthakur": "Hi NAATS.. m Rashmi.. m a mum of 4 year old. And I know my kid need better environment and people around him. I just don’t know how would I do it. N u always inspire me to stand for truth.", "prasita.pasta": "Hey Nadasha!:) I recently started following you after reading about you in HOB.. And trust me I am completely awestruck by you!! You are doing an amazing job! So to introduce myself- 1. I’m Prasita, you can call me pasta! 2. She/ her 3. Pastel shades 4. “Obesity “ 5. Well, I want world to understand the meaning of happiness in it’s purest form. Happiness derived from the art you love, happiness derived from your work, happiness derived by just learning new things.. I think the society should value happiness more than money! :)", "aboualtou": "Sie ist schön 😍😍😍", "anandgowda825": "Superb structure", "atulrampal84": "Good morning dear friend.. Happy Baisakhi.. bless you enjoy your day.. 💃🍧🍨🍹💪😃😇.. happy smiling day", "sh1a2gg3y": "I want to see you full naked", "leebasubin": "Keep rocking!!", "agnihotri.lohith": "Nice", "risha.shettyy": "♥️♥️", "aujla.dilraj": "Keep smile", "chetan4409": "😍❤️👙so Beautiful👙❤️😍", "rohitksp": "1)Rohit 2)Rohit 3)Sky blue 4)No 5)Philosophy is my Superpower", "pt227538": "🙈🙈🙈", "manyajain._": "1. Manya. 2. She. 3. Pink💕. 4. Maxillary sinusitis and enlarged adenoids. Also recovering from mental health issues. 5. I want to prove the people around me that it’s not necessary for the whole world to be a doctor or an engineer. I want to be able to stop rape, molestation and harassment. My superpower is that I believe in myself and I know that I can change the world.", "shaileshsurat": "Nice pk", "mustafalahmetraj2th": "Ur smile is creepy no offense", "judeubah1912": "You are amazing", "stinkybuffalo": "I'm tired of your fucking smile. Fucking die and shut the fuck up. I'm done being happy.", "someone_shajee": "👍👌😍", "anushayzz": "Keep posting about body health mental issues can relate and ur thought positivity makes a difference 💙❤️ May Allah grant you with all ur wishes and bless u loads 🙏❤️💙", "ayesha_humayun_hussain": "Ayesha here idk why i comment but i like to watching your stories daily u post...i love the way u like yourself and how simple girl u r🙌much love from pakistan", "silverpinchinamerican2020": "You need a YouTube Channel!!", "imroyaldeepu": "Awesome Nadasha", "ajayduryodhan14": "Sexy", "abhi_abhi_ranjan": "Amazed, u r looking fucking hot, salute to ur confidence.", "tushal24": "Hi...", "abhi_ansari786": "I like this👌👌👌", "riddhimaadvani": "I love yoiuuuu 💕💕 so so much. You give the confidence that has been so hidden and not looked for thankyou MI lobe you so much. Your so not precedent but you are so freaking real. I love you 💕", "famystery": "@natashanoel001 1. Fahmi Logde, a very wierd name have always been told that. Everytime people mispronounce my last name as Lodge even the documents had to be made again as they had the wrong name. 2. Just by my name thts easier. 3. Black 4. I am dyslexic myself and always had problems understanding thins and always been called names like Bhonduram / Retard and wat not. Not completely out of a depression, suffering from an eating disorder tend to over eat when i get stressed out. Not at all happy with my body. Being called a Genda Fatso. Went thru times and even now go thru that no one wants me around. I have a problem of pleasing people even if its at the cost of my self respect which in returns hurts me to the core but i dont learn from my mistakes. 5. I knw i am not that strong but have been helping people come out of thier miseries i am a trainer by profession and a counsellor to some. I try my best to give them the best so that they dont suffer the way I have. I love to talk as well as listen. I knw i cld do better and I am still trying.", "sudhir2713": "saxi", "actorsoori": "Lusu delete ur photo", "hippiechaow": "🤪", "preethamjanchan": "Awesome", "itsdeepakmudgal": "Fav 😍", "carlosibarra252": "Preciosa😍🌷", "sunil_khamitkar": "Hii", "remyajerry": "@natashanoel001 ohh that's a new information..that you are a Malayali 😊IAM Malayali as well..in a story or a a video speak on Malayalam okay .just like that😍", "amritaoflife": "Hey hey Nadasha I'm Amrita you know that. She/her. I love yellow currently (keeps changing) I have anxiety issues. Have been on medication in past but I find holistic things way better than that. I despite being so connected with my food, I have a flawed relationship with food. (more from space of lack of self love) I'm working on it though. I want me + everyone to live a little more in life. Value everything that we have. Eat, live, dance do anything unapologetically. My super power is my vibe ♥️", "sunjeev_sharma": "👍👌", "sachinmathane7": "Oppss 😍😍😍😍", "thakuraain": "Hi Natasha, I got to know about you only yesterday and now you have a part of my not so healthy heart :)) I am Aishwarya, prefer my pen name Thakuraain. My fav colors are blue & white. I suffer from PCOD, a fibroid, a polyp.. basically a fucked up organ down south. I tend to stress a lot & over think and have a leaky tear duct :) tagged as \"emotional\" by most of them as if that's a bad thing. I stand for body positivity and have taken up a touch challenge to make my family understand that. Can't change the world all at once. My super power is that I'm aware of my surroundings, and on a journey of self love and have poetry & theatre as my cushion for the hard times :)", "omprakash_rudraram": "Awsom baby", "r.yewale": "So sexy ❤️❤️❤️", "ramankumar438": "Mam i love you", "humairah_reyaz": "Reading on the comments section i came to know that each and evryone is fighting their own battles evryone has their own story.....And i always feel that the people on instagram have sooo lavish lifestyle and here i am living my boring life....Really soo true never judge a book by its cover.Hey anyone reading this comment MAY ALLAH SWT bring peace and happiness in ur life💝💝keep growing keep loving urself💕", "itszealhere": "Hi Nadasha. 1. Hi i am Zeal. I like to be called Z. 2. She/Z works.. 3. I am colour neutral,it keeps changing as per my mood.🙂 4. I recovered from serious phase of health issues, clinical depression..but its all in the past now. Came outta stronger and better than ever. 5. I wanna be the best version of myself for myself. Impact..spread immense happiness and light to whoever i meet! Super power would be that NOW I CAN FILTER WHAT IS IMPORTANT AND HEALTHY FOR ME SO I CAN FOCUS ON IT AND LEAVE THE REST UNWANTED TRASH IN PAST...and you're a fierce strong witty lady,much love🥰❤", "prakash_goud85": "Beautiful sexy ass..", "billa.dhaliwal.7867": "❤️❤️", "vanshikadance": "Hey natasha first of all you are one of a kind 🔥...I am Vanshika Arora I preferred to be called anything as long as my name is connected with dance...my super powers are I can talk as much as possible and can dance on any sound or noise...I just wanted to say that I am a kind of a girl who have dreams and a passion to follow them no matter whatever happens...I ust want to change one thing not even change just transform one thing in this world..that is the way the people treat 1. Females 2. Poor people and 3. And most important Animals", "sin.s.k": "Super really looking you Nice❤️❤️👌", "rt_aaru": "1.Arati 2.she/her 3. maroon, black, blue 4. Back problems/migraine 5. I have this superpower of finishing several week's work in one day i.e. before the deadline. I want to make impact in scientific study in my country (I dont know how).", "iwannacomplain": "I go by Ish, she / her and my favorite colours are blue and yellow !! Ive struggled with depression and anxiety for a few years now and more recently I've been dealing with a long-term concussion (with a really unhealthy relationship with food since I was 13/14). I have gotten through what felt like rock bottom, and then I was there again and I'm here again now but I know that I've survived every bad thing so far. The most important impact I want to have is to make sure that all my friends and family know they are loved and always will be by me. I want to make sure they know that I'll always be there for them", "sushrita____": "Hi I m sushrita Nd as a Bengali have many pet names,i love all colours bcos each has its own beauty,i have a knee weakness bcos I used to overworkout at gym specifically jumping. Cardio etc.But I m sure I will be able to overcome that with proper yoga nd ur suggested exercises,i last but not the least u r my inspiration Nd whenever I feel like quiting I watch ur videos Nd start again ..love u for being there for us ❤️one little request if u could make a video on how to strengthen knees☺️🙏", "super_shanu": "Hi Natasha, 1. I'm Vincent, ppl usually call me Vincy 2. He/him 3. Also Blue 💙4. I'm majorly battling obesity .. trying to reduce my weight .. otherwise I'm fine ..I'm a ambivert.. hence I pretty much enjoy the best of both worlds .. ha ha ha .. and 5. I don't really have a superpower .. I regard myself as a normal person ... Just want peace and harmony but I kinda have a hobby ..I love to observe and study a person .. like in behaviour traits ..helps a lot to know who are we dealing with .🤘😋 And I've just recently followed u ..ur posts are cool .. 😎 will love to follow all your content . Life short hence let's 🎊 get the most of it 🤘😎", "angelbinu86": "Mallu ahhaaa... Enthanelum chechikke nalle kuthiya kandale onnu nekki nunayan thonnum I love you and fap a lot", "chithrapradeepakacp": "You're awesome!!😍", "anneyfashion": "1.pooja 2.she 3.green 4.i feel have have some serious anxiety issue after kids and donno why can feel so much negativity around me .sone days become burdon on myself .just a single word from somebody and I get completely out of control . sometimes feel I really need to visit psychologist 5.i am very much friendly person and can bring smile to anybody's face except me .", "glodeliah": "Hi Natasha been following u for months now....luv that ur gutsy open minded...🤗", "nature_by_frames": "🔥❤️🔥", "sassymomworld": "Rockstar girl ... Heyyyy Natashaaa 🙌🏻🙌🏻", "vilas_bhandurge_": "Nice fitness", "isindhuuu": "1. My name is Sindhu 2. She 3. Black 4. I'm recovering mentally and hoping to grow stronger and fitter. 5. I want to stay happy and make my people feel happy too. I can only change my own world , so I'd like it to be peaceful and full of laughter. Kindness is the superpower . And congratulations @natashanoel001", "amitadhana2791": "Hi, I'm Amit Adhana I'm from delhi, every colour suits me so there's no specific choice but yeah I prefer blue more, what should I tell you about my super power, well I guess my mind is my biggest super power just like (professor Charles xavior)😉😎to change the world I think we should change ourselves a bit.( by being human)♾♥️", "miss_diblin": "1. Varshaa Naik is my name. People around call me as Varu Angel. I call myself Meeraa Madhava (i fuckin love Lord Krishna). Also I'm Diblin(not the place Dublin, it's Diblin which means the fragrance of a soul) 2. I,me, she, her and we❤️ 3.Blue(the fuckin deep love blue!) 4. Survived Borderline personality disorder. Struggling depression. Leg pain caused by turning into obesity(I'm trying to be fit. I need to recover my health!) Wheezing. Panic attacks. I'll get through all these health issues but there's one serious issue which can't be treated. I smile too much and it's infectious and I can't help it! 5. I'm love ❤️ and I want to spread love so that everyone reciprocates that same and this world will be full of love! Love is my superpower. I own Love and I'm Love! ❤️ Love and healings❤️", "sbhatt5687": "Siya, lovy,all greens, digestive issues, depression, allergic to peanut, milk, tomato, mites,perfumes,dust, sprays etc, my superpower is I don't have any addictions, want overcome my certain fears. I never judge anyone", "yoga_harjyot": "I'm Harjyot, yoga trainer, he/his, fav colour black, I am fit soul with no apparent issues, I am here to connect to people around the world.. My superpower is my positive attitude and my strength to make others comfortable in my company so that they can open their scars and get healed... Just love your @natashanoel001 posts and I am a huge fan of yours... God bless you..🙌🙌", "sowmyashree12": "Hi, 1- Sowmya, you can call me SowCow 2- She (Suddenly I forgot what pronouns ment so I had to Google) 3- Black 4- PCOS (my friendly inmate) 5- I want to spread love and art", "uditas26": "Hey @natashanoel001 1stly thank you & Kudos to you for being who you are & radiating so much positivity & confidence in & out. 1)Name : Uditay Surana/ Udita Jain, 2) she/her 3) White & pastel shades soothes me.4) I have been suffering from allergy & hidradenitis suppurativa. Also recently into insomnia, anger & mood swings. 5) Intro- Hailing from Kolkata, shifted to Mumbai a year ago, I am a fashion designer, Exhibition Organiser turning into Holistic alternative Coach. Dream Decoder, Tarot & Angel card reader, Numerologist, Reiki practitioner, Silva mind power graduate, yoga enthusiast, Accupressurist, switchwords practitioner, Diamond grader & organic food enthusiast. Currently into Holistic nutrition & organic food supplies. I am working on myself & also do various workshop to educate people. I want to make India pill & disease free country by introducing Holistic & alternative medicine.& Become an influencer.... on that mission. I love the way you project ur body without any guilt & we all try to hide our flaws into clothing. More power & strength to you & blessings always. 🙏😇😘❤️", "yoga_king54": "Ab ye kosa pose h ?", "____bianka.andrade": "💜", "prishabudhoo": "@natashanoel001 ❤️❤️u're super inspiring Natasha.. Stay amazing... I love ur posts❤️❤️", "psychonaut_98": "❤️", "mystery_curl": "1. Hi I am mercy, i would love to be called so( but many call me manshi manoshi nancy n what not, which i really dont like.) 2. Us 3. Red yellow n black. 4. Fats almost everywhere. Haha. 5. I wanna see everyone around happy and thats y i try my bit to spread happiness, enough though the slightest at times is passing a smile and i can forgive ppl even when they hurt me bad at times n guess thats my super power. 🤗", "macahuja": "#nangdhadang #fuddu #dontpostsamething everytime", "santoshdhongadi143": "💋💋💋", "avi317": "@paraash_kamdar 🙌", "devildentist99": "1)astha , 2)asthi, 3) purple ,4) suffers from hypothyroid , obesity and body image issues ,5 ) I believe in love and kindness and karma too", "iamdkbishnoi": "Gatiya sakl ki drawani Surat 😡😡😡😡", "devika__.__": "1. I'm Devika 2. She/her 3. Turquoise 4. I've struggled with depression for the past few years though I haven't started therapy yet. 5. I'm a feminist so I wanna make this world safer for the next generation especially with regards to women's & children's safety. My superpower would be my ability to change myself cause I always believe in being the change I want to see. 😊 I recently started following your page from a post by @officialhumansofbombay . Didn't know you were a fellow Malayalee tho😃 Love, love, loooove the message you send out to everyone💕😇", "910neha": "1. NEHA MUKHERJEE (everybody calls me maha due to my school name jo munhe kuch khass pasand nahi hain lekin phir bhi dost bulate hain but not full part they just call me maha ) 2. She/her 3. Blackkkkkkkk, jet black,pitch black , dark black ,light black natasha black (this one i made my self cause natasha noel n black both are my love so it will make a good combo). 4. I m still discovering my health issues weak muscles though trying to recover from that apart from that sometimes i get confused what to say in front of people sometimes dont know whether it is an issue or not. 5. I wanna see the world without plactics n pollution like i fucking hate it but then there are few things in which plactics are involved n no matter what we have to use it still want that there should be better ways n really people to avoid plastics. 5. Well i also cant empower anyone we cant empower anybody we empower ourselves. Similar thoughts on this ..", "bhagatsinghmattewal1": "Bhagat Singh (that's the actual name ) or I also go by Mast Aadmi because one time a frnd called me that and I kinda made it stick . 3. I love all colours but green and black top my list . I wish to touch people's hearts an give them newer understandings of other people's lives by making movies that transport them into new worlds . By understanding people's stories from their perspective , people become more sensitive and more compassionate . I had anxiety and depression but I seem to have recovered and also I have bad eating habits ( not sure if they'd qualify as eating disorders , but yeah ) .", "venusarda": "Hey Nadasha.... I am Venu... like to be called the same. “Who” coz that’s always on my mind “Who the f... Are you tell me this???”. Today is Red... I suffer from a lot of mental issues that include equality, respect, the feeling of not being wanted.... many more I guess they keep changing according to situations. I believe in small differences that can make world better place to exists like be kind, smile everyday, no yelling on kids... and love myself @thevibeoftribe. I love seeing your post n stories... it is so good to see someone speak their mind out and not like only speaking in my head. ❤️❤️❤️", "bindlish": "Hi @natashanoel001", "khan_aniq_5": "1) Hi.. I'm Aniq.... 2) not sure 3) black 4) I'm a Borderline 5) my super power is i can feel everything with full intensity (not 'can' I don't have a choice really)... I... I can love without expecting in return... I can understand what people go through....", "vaishali_masatkar": "Hiii Nadasha! 1. I am Dr Vaishali Masatkar, 2. my favourite pronoun? Never thought about it, let's take 'we/ us' 3. Black 🖤 4. I have chondromalacia patellae which is basically a disorder affecting cartilages of knee joint and it restricts some movement at the knee joint, i am recovering though 5. Well as a doctor first of all i want to contribute in better health of the society in general, then i want to engage in free education for children, help poor kids by providing living and food, teach them to be self dependent.", "hemalathasekar": "@natashanoel001 Hi Natty !!!! 1.Am hemalatha Sekar,by the way you can call me Hem☺️ 2.She 3.Women in Black 🖤 Funky in 💛 4.Well I have huge anxiety issues within myself,but am just focusing to overcome it..! Along with that when I hit gym I am not having the power to do workout for long time..Am just getting drained off soon..!!!!! 5.My super power ! Being myself,making the people around me happier by silly jokes,being there for them in joy n sorrows...!!! Give respect n love !!! Yet it ll return....!!!! Lots of hugs NATTY💛💜💛💜", "pritibairagi4": "hi my name is priti ...frnds call me pree 2.she 3.red &black 4.nope .maintaning healthy lifestyle 5. just want to see everyone mentally and physically healthy...want to do something for education of poor children.6.belive in my self .I think I can manage myself in every situations.happiness is the key of my power and want to spread it everywhere .", "theapoorvkhare": "Bhot Sundar, Fit Ekdum", "colourdrools": "1.My name is lahari , i don't mind being called by my insta username! 2.she/her/them 3. Entire palette 4. No health issue but really bad stamina, and bad headaches all the time which i wanna improve on. 5. My super power is my kindness, but i need to learn hiw to channelise it .I sometikes let people walk all over me and its something im trying to over come. I seek beauty in all things around me and through my art and my being id love everyone to understand the importance of loving and being grateful to everything around you and for all thats happening to you which will eventually make all of us happy! What a society it would be to live in :') im your new follower and i already like you so so much ✨✨", "geethikanair": "Hi 'Nadasha'. First of all big shout out to you. You are doing an amazing job.1) I'm Geethika, liked to be called 'Geet'. I'm a mallu. 2) she/her 3)all shades of blue 4)i have PCOD, I have not had my periods for months altogether, backed by acne, facial hair etc. 5)i am still trying to love the skin I'm in, and I'm doing so by sharing positivity abut the same to others, tell people to love humans as raw as we are. Find happiness in the smallest of things. ♥", "aarya_ap": "Hey! @natashanoel001 1. Aarya ( and I do not have a nickname )born into maharashtrian family! 2. Her 3.Yellow and Blue! 4.Fortunately no serious health issues but I do have anxiety and self-doubt issues. Also wanting someone to whom I can show my real self without the fear of the reaction or judgement. 5.Well..i want to have an impact rather change the process of raising kids.. including educational and emotional growth..if that happens imagine how happy the world will be..💖 also I love how you are Soo expressive about real life issues... please don't ever stop..you make me feel strong! More and more love from me!!! Love you ❤", "seshachalapathipedamallu": "Hi Nadasha nice to see ur posts and appreciate wat ur doing I am Chalapathi u can call me seshu which I like most", "ananyabhalla23": "1. I’m Anya! 2. She/her 3. Pastel shadesss 4. My boyfriend broke up with me because I’m away for a few months and it’s very distracting but I’m happy that I’m not letting it completely consume me. But I do have some body issues that I really really want to discuss with you and I have DMed you regarding that. Because it’s something I’ve never really spoken about to anyone. So yeah hope you do open my DM. 5. What impact I wanna make is that girls out here should really know that supporting women and eachother is highly important. Slut/ body shaming other girls should really NOT be a thing.", "babraham12688": "Introducing myself: 1. Benjamin (my close ones call me Benji/Ben/Beni/Benjo), perks of being born in a mallu family... 2. Him/he, 3. Have a problem of getting attached with ppl easily ND getting hurt.., 5. Have a superpower of smiling in every situation, good or bad and wanna spread this smile with the ones loosing out on it....", "gillyontherock": "Hi Natasha my name is Jillian spelt with a G sadly my mallu teachers in school would screw my name😣😣😣 not much has changed even in Sydney on me moving here. I am dyslexic too...I suffer anxiety after loosing a parent .I love blue too. My best friend introduced me to ur story. Your such an inspiration and it must b hard on u but I love your perseverance. Your my inspiration 💕love u girl😗", "jananiravipositively": "You are doing something else with my mind long way to go you re not surrounded by positivity u are the positivity....🔥🔥", "anu_abraham_05": "Hello I'm Anumol as I belong to Kerala,everyone lovingly calls me Anu or Anumollleeee( bohot saara pyaar I get ,you know 😁) . I actually wanna grow and push myself from my comfort zone ,accept myself the way I am, create a healthy body and mind. Help bring smiles on faces . I'm not very sure about my super power though. I aspire to be like you , I love you.😊❤️", "theanesthetist": "Hey Natasha! I’m Lyba, practising as an Anesthesiologist. I have been diagnosed with dyslexia. School was hard for me. Dint stop me from getting to where I am now. ☺️ I still don’t know what I want to do with my life. You are spread so much happiness to everyone. Keep doing what you do", "castingakshay": "You are such a braveheart god bless you... Beauty with brains", "heythereitsb": "Your really really pretty natzzz. God bless youuuu😍🙌", "sanwarmal866": "Nice Natasha I need yoga help me", "amystevens_18": "Hi, I'm Amy Stevens, but everyone calls me Amy. I love blue, black and grey. I suffer from some form of osteoarthritis thanks to a basketball injury at the age of 15. I had struggled with my body image until very recently when I learnt to love myself. I have had borderline depression and anxiety issues which I eventually learned to channel into my art. This lead to me starting my own little art business @thecanvasdiaries that I'm super proud of. I believe that every person can do their bit to make a change. I intend to use art to create awareness about issues like mental health and environmental awareness. I have worked with organisations that create awareness about autism and the the stigma attached to it. My superpower is empathy and the ability to remain calm regardless of the situation💙", "manan.kaur": "Hi Natasha! I am Manan. Pronoun- she/her. I have been following you for almost 3 years now and I have been inspired by you to be true to myself. You are also one of the reasons that I see people (spl. bullies) as their own reflection and don't judge them for it. Love you with all my heart and I feel very happy that you have a wonderful family and a lovely boyfriend.", "alohomora.veena": "Hi Natasha, 1. I'm Veena, but often go as Ribena (like the drink, caz it rhymes). 2. She/her 3. Changes often, but I tend to like bold colours (black/red/peacock blue/purple/navy blue, etc). 4. PCOS (diagnosed), possibly endometriosis and I'm recovering from a lifetime of narcissistic abuse. 5.I would love to contribute as much as I can to making the women in our world strong, indomitable forces of nature. I want to help women choose themselves over and over again, and to create strong lives where they can choose to live a life of freedom, strength and success, making romantic relationships strictly optional. That's it, you're all caught up! 😂", "sandyy8711": "Soo cutee 😮😮", "biryani.r.aloo": "(My previous comment got posted, but its incomplete) when I was going through a bad phase and had to take counselling sessions for that, there were many who used to make fun of me saying that i am too weak too handle MY SITUATIONS. But what i have realised is that, not everybody has the same strength to bear with, and what's important is that i took care of myself instead of giving up. Everyone has their own issue and their own coping mechanism. I want to tell each and everyone that, NEVER EVER GIVE UP. NOT IN ANY CIRCUMSTANCES. IT'S JUST A BAD TIME, NOT A BAD LIFE. IT'S ABSOLUTELY OKAY TO STUMBLE AND FALL DOWN. BUT AFTER THE STORM PASSES, GET UP AND CARRY ON. YOU ARE ALL STRONG❤️ (Also, you have been a daily dose of inspiration to me. An year back, i had seen the video of your Josh talks in facebbok and since then, you have always been an inspiration. Sometimes, I even show your videos to maa, she loves them too❤️ Lots and lots of love, hugs, and kisses to you❤️❤️)", "dubeyv1114": "Hii", "missghosh_93": "Hi @natashanoel001 my name is Anamika Ghosh. My fav colour is red. I have PCOS and am extremely affected by it. I want to make people understand that we need to accept people as they are and just stop bodyshaming.", "writographer": "Hi I am Palashpriya Banerjee. I like being called Palash. Doggo mother to @nemoandbella, fiercely independent (I live absolutely alone with my two doggos so I sometimes call for my inner superhuman 'wonder woman'), creative with multiple aspects. Blue, black, white my favs. Dealing with overweight but struggle to remain motivated and work out on a regular basis, deal with sleep issues and migraine. I believe in 'kindness'. I find kindness extremely satisfying. I even kill my enemies with kindness. Kindness is the super power. And I find you very real and beautiful a person. Loads of love!", "mj5_555": "💋💋💋", "nikhilmalhotra3101": "Y toh bnde mrwane wali baat ho gyi", "farrie83": "Hiiiii... 1. I'm Farah or Farrie 2. She and Her. 3. Purple, black and I don't like pink bit pink loves me. 4. Type 2 Diabetic... In control. 5. I want the world to not stereotype each other. I want the world to be more accepting of all bodies irrespective of size, color, scars, disease... I think we all have a voice and words followed by the right action can start making small changes and in the long run bigger changes. My super power?? Calming down kids from grades 1 to 5. I don't know how I do it but it just happens. Lol", "madu_wp": "Hii I’m Madu.... Her...Love Yellow colour.. Im overweight want to loose 9KGs ... Otherthan no health issues.. I’m from Srilanka.. I want women to be empowered .. and see the positive side of the every incident ❤️ Love your insta page ❤️", "siddeshmangaonkar": "Hey strong girl, I read abt u on @officialhumansofbombay and I really felt ur life. Like really more power to u 🔥 SHERNI HAI TU 💥 Keep going nd keep inspiring 🤗", "satheeshsoorya": "Iam satheesh soorya .from beautiful kerala .ilove to do yoga every day .yoga is very powerful medicine in my life . Every day it carry me another world .i give respect all the yogies .i prefer all youngsters do yoga and get easier soft beautiful enlighted bright life", "welcome_to.my_profile": "❤❤", "harsha_doriya": "Hi .. I am Harsha..and i have fallen in love with whatever you post with so much pureness♥️..wish to talk to you once since i am also going through something weird..kinda stressed everytime..and too kuch mood swings. But yeah i know m growing strong and dealing with things more appropriately.. lots of love🤗😘", "ishwarya1909": "Hi!", "thatstrangegirl__8": "Someone few back called me 'Nash' instead of Nish. Now I call myself 'Nash'😁", "sanirudh906": "Cool....look quite fit enough to maintain a good body....not very many can maintain a good healthy body...👍👍👍👍👍👍", "rameshsadashivga": "🔥🔥🔥", "queensdreams": "Queens / pronouns....grammer not my thing 😂 / I love all pastel colours / medical issues..... Well.. Not physically but mentally yeah, this platform would get bored with all the stuff i'd put here/ Help girls like you / Super power.... Maybe.... Dignity, Being Calm, polite, being logical, patience./ I saw all your posts, read all 241 posts so far. Came across your story just yesterday. Firstly, If I ever meet you, I want to give you a teddy hug. I'm a mother, I have a growing daughter in her teens. So many like me might bore you with advice, but hey, let me help you with positive choices. Wear yoga gear that covers your legs. Rest, you are perfect! I admire your efforts and proud of who you have become. It's never too late to inspire and you are remarkable. I think you need to give people therapy instead 😂. Power to you darling. Lots of love 😍🙌.", "bomb_ae": "You make my day inspiring at every moment ♥️🔥", "quirkypeachx": "1. Shriya 2. She or her", "francisssss146": "Hotttttiiii😍😍", "tejaspoojary": "Heartly Congratulations @natashanoel001 for ur 251k Subscribers❤️", "sourav_guin_": "1. Sourav 2. His 3. Black 4. Fatty liver 5. Want to provide employment to a lot of people in the hills who don't get enough attention from the centre and from us.", "panjana95": "1.anj 2.she or her 3.purple 4.body issues 5.wanna help people to come to accept their body and soul and love themselves...super power?hahha i could give you a patient ear and listen to all your worries and give you support.... also i love how unapologetically you you are nadasha....i love your confidence..its what i aspire to be..keep being the positive sweet soul you are...and trust me you're helping a lot of people out there💫💫💫🔥🙌🙌", "shemzq8": "Lots of love from a fellow mallu Nadasha kutty and love what you're doing here girl 🖤💖", "anamikamondal": "Hi Natasha! M a big fan of yours! In a nutshell, I am Anamika. I do not have any fav colour. I love all colours ❤ I love all animals. And I want to change the world by making people more body positive and help.them boost their confidence. Just the way u do! And my super power is that I think I am a Cat who looks like a human. Meow 😺", "meenakshi_manibharathi": "1.Hii , I am yogameenakshi. Friends call me as yoga and family people as Meenakshi. 2. She 3.Yellow 4. I have autoimmune disorder disturbing my eyes ( blurred vision) 5. My super power is I try to help as much as possible to everyone people and animals (pet lover) . 😍. I have recently started to follow you. You are sooo much amazing and my day never ends without seeing your feeds love youuu.", "_.s.h.r.e.e._": "Hi @natashanoel001, I'm bhagyashree but it's a very long name so I like to call myself as shree. 2.she/her 3.white, black,blue.. All are my fav colors but if I have to choose one I'll say white 4. I'm 20, I'm very thin that I don't even have any breasticles hence I don't feel girlish at a times, also people comments goes straight to my mind. 5.I want to do something which will be eternal and I'll have chances of progressing on that every day, but I'm not able to find out what I exactly want to do, can you suggest something for that?", "lifeof_puppies": "From which part of kerala are you?", "alwayscrazzzyy": "Hey, I am Chandini. I like all colours. I have dysmenorrhea and body image issues and trust issues and daily try to battle that. I wanna be a harbinger of love and peace and happiness in this world. Wish I could take away all the pain and suffering ppl went through. I am studying actuaries and love dancing and reading and wanna become a writer. Nonetheless life is great.", "storiesbysurabhi": "1. Surabhi would like to call myself meow😂 2.her 3. All these summer bright colors like mustard turquoise etc. 4. Idk if it's a disease but I get panic attacks like my heart goes from normal to hyper when I see toxic ppl n m recovering from my heart disease-Arrythmia 5. I want that people shouldn't judge anyone on any basis, whether it is body type, the thinking, way of living or behavior because I feel everyone has their untold stories and are everyday suffering from it and we shouldn't let them down by passing judgments so yeah this is the impact I wanna make AND MOST IMPORTANT I WANT TO CREATE AWARENESS ON SAVING ANIMALS BECAUSE OFTEN BECAUSE OF RASH DRIVING HUMANS END UP KILLING THESE LITTLE CREATURES WHICH BREAKS MY HEART TO THE CORE AND THEY HAVE FAMILIES TOO AND SHOULD BE LOVED TOO SO YES PLEASE. I WANT THEM TO LIVE AND MAKE THIS ENVIRONMENT A BEAUTIFUL HAPPIER PLACE FOR US. Block letters because just wanna shout it out man! @natashanoel001 love you strong womannn🔥", "akanksha_08_": "Hii I m akanksha.... U r an inspiration to many people ..so please keep going .. u r our star girl ..u r born to shine♥️♥️ love love love n only love😍", "offical_arsh_preet_": "🔥🔥🔥🔥😍😍😍😍👌", "saikrishna_netha7": "Mental 🔥", "haresh_zaru": "storng lags💪🏻", "iamdimplek": "1. Dimple, call me anything you like. My nickname is Dolly. 2. She/her 3. Black, Blue, Purple, Red. 4. I don't have any health issues, I don't think I have. But according to the society I may have health issues coz I have more fat percentage in my body.. I love myself as I am. 5. I want people to be accepting to people as they are. Accepting differences is hard but not impossible. I want people to know that having less or more fat percentage in body is Okay and everyone is Human irrespective of all the normal things which is unacceptable to them seen as flaws... If we are thin we die, if we are fat we die, if we are fit we die, if we are unhealthy we die. We die ultimately.. So why not just live and let live!!!!!!", "gypsy_soulstrings": "❤️❤️", "yashagarwal99": "Hi Natasha, I just saw your ted talk last night, trust me I was feeling so low before that and watching it made me feel so much better, but more than that it makes me respect you and want to meet/talk to you, because you're extremely inspiring an individual! 👏🏻", "work_in_progress__always": "Hi nadasha,1. My name is akanksha, mostly called akku.2. she/her,3. Almost every colour ( they all look beautiful in their own place). I have long list of health issues - migraine, sinus, Anemia, pcod, joint pain, allergy and more. I think my superpower is that with all these medical issue i am still a cabin crew😊. I don't want to make big changes but a small change that I want to make is asking dgca to void the concept of a particular bmi range. Many crew who have heavy body structure starve ourselves to be in the limit of our BMI. We literally don't eat and drink water before weight check because even difference of few gms will make us lose our job. I wish Indian aviation ministers could watch Natasha and learn something😪", "sh_aww_lini": "I am Shalini and my favourite color is red. Pronoun: she/her. Not comfortable talking about the rest. I love you. You ll be fine. ❤️", "rudhs_07": "My name is Rudhrika, my friends call me Rudhs. US. Blue💙 Health Issues,Maybe.😅 but anxiety 😯😯 I want to see each and every child of this planet to be able to do what he/she wants to by some means. It's not always about everyone helping the others. We need to tell the youth of The country to take a stand for themselves and stand for what is right. 💙💙", "cynical.snitch": "Hi! 1. My name is Anushka Majumdar (Bong) 2. She/her 3. GREYYYY. because it's so classyyy. 4. Was diagnosed with clinical depression and anxiety as a symptom of the same. Had to battle it for a long time. Currently facing relapses. 5. I had always wanted to change the world and make it better, as a small child. My aim is to earn a buttload of money and open my own NGO. And I'll make sure it works well and not like other NGOs who collect a lot of money but the work is not proportionate. My super power is that I think I adjust well to situations and i am empathetic.", "innocen_aastha": "Hi nadasha ma'am mene apki insta pr video dekhi thi anxiety ko lekr or me tb se apki bhut bdi fan hu😊 you are so brave..👏 so kind,motivating, very inspiring.I have a huge respect for you love you😘 ❤", "apoorvclicks": "1. Apoorv 2. He/his 3. It changes between deep blue and dark purple 4. Nothing very evident 5. I'd like to tell stories of all kinds where everyone is included, every quirk every whim is entertained, every voice has a value. I'm into visual mediums so sometimes photography most of the times films! Also I'm an aspiring filmmaker working as an AD😊", "amyth_gullyboy": "Hi nadasha😊my name is Amith kumar garg,frns call me handy,tats cuz i used to be handicapped most of d time wen i was young...blue,black are my favourite colors...have been living in wid anxiety,depression from 5years since i gave up on some harmful habits,on my road to recovery by going thru your feeds n of many others...been following u since a while n appreciate ur sooper powers as a women...i m a born bangalorean from new delhi..i motivate from you to motivate others in my life..thank you😊", "sunnymends": "Suneera heloise mendonsa my name until when I went to college in st. Xaviers Mumbai and got christened as sunny... Lol so there you go...and I'm born in a mangalore Roman catholic family /Her/ Teal or black / well had this issue with trying to prove myself and though I was not good enough, I was not the feminine kid in college a tomboy totally... and yeah mediccal history I did survive and ovarion tumor so I think that made me rethink and I decided to make people smile and live life fully and yes have a small Lil princess all of 8 even with one fucking ovary and fallopian tube removed way before I got married..had polyp removals.. Also a doubt of cancer of cervix.. But all ruled out (just positive mindset helped me ) . And yes lived in a marriage and till I compromised things went well and now I'm headed to single motherhood.. It's tough when you are treated like shit and a slave after giving a total 100commitment so yeah walked out with my baby... And yes they never try to get you back.. They just say so and you have to do everything to build urself up after being body shamed cos I was obese post pregnancy!! Hated myself but yes now to cut it short I'm an artist and a fitness trainer...(took charge of myself) In Zumba.. HIIT AND Nirvana fitness.. So yes have my low times and yes you do pump me up a lot my dear... So yes staying positive as I'm still waiting for the ultimate freedom... Fighting every bit and living life complete and showing my girl and many others that life is what you make of it.. And you need to fuck fear!!", "chetan.joi": "Hi. I'm chetan. Just one thing. I like your guts. How you go all out. With no inhibitions. Love you 😊", "leo.smooth": "Hi Natasha thank you for your positivity. My name is 1. Leo 2. She/Her 3. I have ADD and I overthink all the time + impostor syndrome (hello ladies) Also I hardly gain weight and muscle... I had started to lift and squat and started to feel stronger when I got into a motorbike accident and fractured my T12 vertebra. No surgery thank god but obv lost weight and energy. Not to mention self confidence ☹️ I am almost fully recovered but I now need to do physio and want to start yoga for sure (for strength and peace of mind) but I am scared to pressure my spine. Any advice would be super appreciated! 🙏 What’s good? What’s bad? Thank you, you rock and India too!", "shweta88pathak": "@goldy982 bhai tere ko kya prob hai Teri tange hai kya...looser jaker lunch ker Soja or ho sake dubara mat utheo", "amitavsharma8": "@natashanoel001 hi Natasha.. Just wanted to say hi to you. You have inspired me in so many ways I cnt even😭 just love the way you look at life.. Tons of love.. ❤️❤️", "aura_n_t": "Hi Nadasha. Firstly, you are healing the world and opening tunnels for the hidden to explore and most importantly accept themselves. Thank you so much for that. Never stop on this journey. 1. I am Vini Gupta, since it's already a short name people have extended it to Vinna, Vinnyadi and even Vin. 2. On pronouns, same as yours. 3. My favourite colour is red, black and silver. 4. I was a thin person with actually tiny tits in my school life and PCOS (not a D, because I won't want to call it a disorder). So, I have been made fun about that. Also, i am a bisexual and had an affair in school with a girl (I am from convent), so the rumours were hilarious on the front but character sketching on the back. But as everybody says, there's a bright chapter after a dull one, I came to college and saw people admiring me, calling me beautiful. Since then I am found on cloud nine. 5. My superpower is writing. I write. Whatever comes to my mind I know I can frame it and people can connect to it. I also believe I am a problem solver and a good listener.", "ang3lz13": "1. Asha 2. She 3. Turquoise 4. Im allergic to bullsh*t 5. Love the imperfections, they add character, my super power is that I GREW A HUMAN BEING, I'M a Superhero!", "arisandfly": "Hi I'm Arianne, everyone calls me Ari. My favourite colour is teal like the Caribbean sea. My home. I have anxiety issues and because of that I want to help kids that suffer with anxiety and depression because it's often overlooked. My super power would definitely be thinking ten steps into the future and not being present. Ever! And thank you for bringing realness to this place. I appreciate every one of your posts.", "ddesai709": "Hot aen saxiy babiy i like u", "ilumau": "Ila. She/her. Green. Body image issues since childhood. I was overweight since adolescence but now am just fat in my head having lost a lot of weight in that last few years. I am exhausted fighting the fat girl in my head. Also I would like to stop being a worrier all the time.", "red_winchester": "Akshaya, people call me Aksyyy or just by second name Sesh. I loveee RED ( part of my handle name :P ). I had a fall while playing soap football two years back and kinda screwed up my right hand and backbone a bit. Lost my motivation to gym and ended up gaining a lot of kgs. My power power.. - Need the chance I to be there for people who need a person to talk to or something because being alone with thoughts kinda pulverized me", "srinivasan729": "Thanks", "salt_pepper___": "Hi my name is Rakesh Indira Yadav I would like to call myself as Indira because this is my mom name .he/him. favorite colour black.health issue well I am fighting with loneliness , diabetic(not a big deal).I really want equality in our judiciary system and society.everyone should be treated equal(for justice) as like any other powerful people there.I can make anyone smile 😊 and i just want to tell you this u are so powerful mentally and physically we love you and respect you. lot's of love ❤️❤️", "shivanijadhav11": "Porn hub", "sonu18_abhinav": "Beautiful 🤗🤗🤗🤗", "rini.holic": "1) Umaima 2) she/her 3)purple, red and black 💜❤️🖤 4) I have defficiency of vitamin D and I have a homeopathic who looks after me and now this defficiency led me to likoria and I can not reproduce ever in my life and whenever I get into a relationship that guy dumps me instead of understanding what I've been going through. My friends say that I'm a beautiful inside out but because of this disease I can never live happily. I've suffered a lot from what my elder's say and even my college mates now bully me. But you know what Natasha I'm glad that somehow I encountered your profile and it has helped me a lot. Now what my heart says is that just ignore the people and live for your ownself and my huge inspiration behind this is you ❤️ THANK YOU FOR COMING INTO THIS WORLD 😍", "sumit1356": "Hot ass🔥🔥🔥", "_rajesh_majhi": "Uff sexy body😍😍", "sonujangra216": "Jii", "shalinisharmajuly": "Congrats Natasha...love ur different perspective...I learn a lot from ur posts...", "akash.kasurde": "Hot fit beuty Natasha...", "smriti.galaxy": "Hey NATASHA❤️ ITS AMYRA... I like being called Amy though. People bully me alot because I follow two religions because of my parents and I think I'm mistaken to be born where I am. And they think that I'm a Tom boy. My behaviour, the way I sit, walk, talk EVERYTHING is like boyss 🖤 and at every point I'm stopped and told to do every single thing a typical girl normally does. I mean how can I change something which is with me from the time I were born. This is my STORY AND IN ALL THESE TIMES YOU HAVE INSPIRED ME A LOT ❤️ THANK YOU NATASHA 💕", "akash.pathak.79": "😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😛😈😈😈😈😈😈😈😈😈", "singhhp73": "😱😱😱😱😱🌹🌹🌹🌹🌹🌹❤️❤️❤️😍😍😍😍😍I miss you ❤️❤️❤️❤️", "vrindaaaaaa_31": "Hey Natasha, This is Vrinda! a girl of 20 from Mumbai, the city of dreams! (called as Vee! - by my friends and family!) I've followed you since your dance journey, was a part of TDX when you were a probationer out there and often got motivated out there when you did those spilts right at the centre and I often took my place behind you just to get motivated enough to get that right too! 😂❤️. Well my preferred pronoun would be 'her'. Favourite colour is purple! 💜 No health issues as such. Well, one of my favourite things to write and meet new people! So, the way I'd like to change the world is to make it a better place is by meeting as many people as possible, writing their stories and definitely make a change by making as many people to get motivated to those who have a tough space to be in! My best and super power is to, make people around me feel good about themselves when they aren't facing a good time, so I'd want continue with the same! ❤️", "mind_if_i_slytherin_": "Hi Nadasha, I am Shiksha, fav pronoun would be YOU. ( Sounds like a pickup line lol), Fav colour is green ( that's why I love seeing trees and plants around me) I have bruxism, sinusitis, and some major mood issues. My super power? I don't really know. I do know what I want it to be. I want to love a lot, listen and get to know others, help people who suffer from mental disabilities, help people who need help. But I need to work for that rn.", "indian566": "😘😘💋", "swetha_sharmaa": "Hello Beautiful! 😇 🌸 My name's Swetha , Call me Anything you want to...:) She/her..:) ! BLACK AND WHITE ( as an Advocate there is no escape from these two colours , part of life you see), Suicide Survivor, Battling Depression, Anxiety, Menorrhagia( I lose gallons of blood and sadly no doctor could really figure out what to do, 8 years its been so I basically talk to my uterus with love every morning hoping I would get an answer as she alone knows what is up with her)+ iron deficiency Anemia Advocacy was for two reasons 1. Wanna do something for the voiceless( not just the animals but also the young girls and woman, who are unaware of their rights and get abused harassed and tolerate it thinking they deserve it as they are sinners or maybe if is a curse or something), have been into counseling ( I battle emotional issues but still I make sure I'm there for the ones who need me as I know how it feels to have none and deal things alone), influence young gen into Books and Art, into Yoga and To connect with the nature, to believe in the vibes of The Universe, kids are easy to manipulate. When the whole internet is doing a great grave harm using the same tactic I wanna manipulate them into good, into growth, into life so they continue to resonate the same with their peers. 🌸 ! And hey @natashanoel001 you are a beautiful inspiration, I come back to Instagram to check your posts , read them before I go to bed. World needs gorgeous woman like you. More power to you. 😇🌸", "smritisingh_25": "You are my INSPIRATION @natashanoel001❤ keep spreading your love and stay healthy and happy 😄💕", "jasmin_3339": "@natashanoel001 hi... 1. m Pravita, i have so many lovely name like kuku, pari, pata, pravi 2. she/her 3. yellow 💛 4. may b eating disorder m an emotional eater 😛 5. i wanna tell everyone that growing more trees will help us in many ways so all my planetmates plzz do plant a tree 🌴🌲🌱🌳 n let's make our planet relax.", "junieworld": "Omg you are a Malayali!❤️", "thou_hypocrite": "1.Riddhima 2.On the same page as you 3.Red,Black,Pastel shades 4.Was diagnosed with depression 2 years ago. Still on my journey of healing and becoming a better version of myself. I have PCOD which is a cause of obesity, facial growth and acne with leads to my negative body image issues 😪 5. My superpower is that I am a very thick skinned person but sometimes even I have my low days. I don’t wanna change the people who judged but wanna tell others to not get bugged. You living your own life on your own terms is so important because the happiness being calm and self sufficient gives you overcomes all the negativity in your life. #liveandletlive♥️", "renette_rodrigues": "1. Renette 2. Her 3. Black / Pink 4. Recovering from an ligament reconstruction surgery , broken talus and stress and anxiety also has bronchitis 5. Since I've experienced being injured on bed for 4 months and still find it difficult to run jump dance or even walk for whole 20 minutes I'd like the world to appreciate every part of their body those fat cells and muscles are all there for a reason. Love yourself :D", "thakursneyhal90": "My name is Sneyhal..everyone calls me sneyhal.2) she/her 3) black Is my favourite colour 4) I have anxiety..depression and completely negative for my own self- health issues gall bladder sludge..PCOD. kidney stones and terrible body pain.. and very bad at expressing things 5) I want to get it into social services do something specially women and I write at times write blog want to spread awareness and break that medicine thinking of our society", "procrastinatorbymood": "Hi nadasha I m Praicey known as pst or prai...mallu by birth raised in Kolkata often mistaken as a Bengali...she/her....bullied by family and friends from school days due to be overly fat... apparently....went through severe depression in the past due to bad breakup....has trust issues and anxiety of a crazy level....mommy of a 20 month old boy okay bye", "sravan9700": "😲😲😲😲😲", "iamkaransharmab": "#iamkaransharmab 😘duck u😁 😁I wish @natashanoel001", "_joshpius_": "“Your preferred pronoun” Um what?", "_kajalanand_": "💕💕💕", "ann.diary8": "1.) Ann 2.) She 3.) Black 4.) I lost my period and messed my hormones because of over training and under eating, I was hospitalized a year and a half ago and was diagnosed with Bulimia. I'm still recovering. I don't talk a lot about it because I once tried and people didn't understand and weren't supportive of it. 5.) I want to publish my poems (someday) and make films, (write, direct and shoot) not Bollywood films (I've studied filmmaking) I think my superpower (even though it's technically not a super power) is that I can write a poem on any image/photograph. Also, kindness and humility. I love to see people smile and make them happy, even by the smallest of gestures. :) Sending you lots of love, you are teaching me how to learn to love myself and my body every day. ❤️", "dhvani.parekh": "Hi Natasha! 1. My name is Dhvani. 2. Preferred pronouns are she/her. 3. My favourite colour is red. 4. I am recovering from Tuberculosis currently. I have six months of daily medicines inside of me and it feels horrible to even visualise that. I haven't been medically tested with either anxiety or depression, but recently I have been showing a few symptoms of anxiety. Mild. 5. Ever since I was a child, I have liked helping people in whatever way I can. Listening to them. Make them feel better in whatever way I can. I want to work for children, with children and help understand life a little bit more in that process. My superpower so far has been teaching and I believe I will discover more as I go ahead. ♥️", "ranvijaysingh0001": "Pls take care of your teeths also", "kaushikraj.98": "Read your story on Humans of Bombay. It's so heartbreaking and inspiring at the same time. More power to you. ❤️", "gaya3_gajendran": "So lovely 😍", "vikramghoshh": "Hey! Well people call me Vikram, preferred pronoun he/him, favorite color is pink followed by black and grey. Well i love to cook and want to be a chef in future. I was diagnosed with bipolar disorder, anxiety disorder, clinical depression and ptsd. Well even though every day is a struggle i refuse to give up and i still am working on myself. Dropped 30kgs from 120 to 87kgs now. You've been a great influence throughout my journey so far! More power to you and everyone out there!", "vishu_ganguly": "😏😏😏", "zohaiblala.zexy": "😘😍😘", "aronjust7": "Woow", "thejoyfultouch": "@natashanoel001.. 1. Kriti. (also called kittu, maryaada, chicklet by three of my favourite people) 2. She, her. 3. Black. 4. Well, i skipped my periods for the first time and got it today after taking some meds as suggested by my gyna and will get an ultrasound done tomorrow to check if i have pcod or not. I hope not. Also, been suffering from health anxiety since last two years. It really gets to me at times. But, i am working on it. Have a supporting mother and the world's best friend and constant who is my personal therapist almost everyday :P but i have felt the need to see a therapist but don't know how, when and whom. Will be great if you can help suggest someone? I'm based in Delhi. Also, I'm a very emotional person and i say that with pride but then i carry alot of baggage and it affects my mental health. 5. I want to inspire people to just be. I want them to love everything about them and never feel small. I want everyone to stand up for themselves no matter who's in front and especially if it's family and people who pretend to be your friends. I want people to believe in their subconscious and how miraculous it is. I want to inspire them by first being someone worth inspiring. I feel I'm on the road to that. And you inspire me so much. I love you Nadashaaaa ❤️", "fitphysio.nehal": "1) Hi i'm Nehal Pandya, ever since I started this a/c people have been calling me \"Fit physio\" and I do not mind that 😁😁 I am kind of fond of it ab. 2) She/her 3) Surprisingly, my favourite color is Green (No, I am not the typical nature lover) 4) Have been living with 7 years of Chronic Back Pain as I have a form of Sero-negative arthritis, because of which Inflammation is flared/triggered in any joint of my body (so far affected are both SI joints, both knees, left foot ) Also, got diagnosed with Depression (3 years ago) alsoooooooo self-diagnosed Eating disorder (I had been eating my based on my emotions) NOTE: HAD BEEN 5) My MOST FAVOURITE PART OF THIS COMMENT- I want to change the conception that people have around Body weight/Body Size. Not only empower and open the options for people who are on the higher end of the BMI , but to maybe show them that they can do whatever the hell the want to! As long as they try it!! I want to reach as many people possible to show them that FITNESS and HEALTH is not in being Size zero or having visible abs 💪You have played a major role in giving me a perspective on how I can do this tooo! Thank you this post ❤️❤️❤️ following you, has been life changing !! Honestly! THANK YOU FOR BEING YOU❤️", "cruelfacekillah": "I wish you speedy recovery sis👑🌈💜", "mahika_rajan_07": "Check your dm", "stacyinthehood": "My name is Stacy. Everyone calls me Stace. I love the colour Blue💙. I've not medically tested anything but people say I got anxiety.. and depression. I just want to spread more happiness and positivity around because I believe more people need that!", "paranoshirani": "Hi natashaaaaaa🙌🏻 My name is Paranosh Irani and I am a ‘her’💁🏼‍♀️ My favourite colour is pink💓 I do have body image issues and my superpower is I am ‘unicorn🦄🦄🦄’ Well basically through the process of blogging I am learning to add colour to mine and peoples lives💜💜💜 Love you loads girl🙌🏻", "mammensharath": "Sharath, he, black, don't have any health issues. I wanna do something to protect our nature/animals on the brink of extinction.. superpower : I guess I'm a good initiator , but don't really complete a task at hand..big fan your mind and body..btw I'm a Mallu too", "mittu___718": "🔥🔥🔥🔥🔥🔥hot", "sunny____bhardwaj": "Sexy girl🔥🔥", "anusha_narayanan": "My name is Anusha. 2) She 3)BlueBlueBlueeeee 4) I am trying to accept me for what I am. I suffer with digestive issue . I am trying to mentally recover from the horrific past that haunts me.5) I would really like to bring an impact on people's mindset. I wish people would Stop judging I wish society and the world would let us live.I really would want nothing but equality peace and love and more dogs❣️", "sachdevaaashna": "Hi. I am Aashna. My family calls me Aashi. 2. She/her. 3. Blue, English rose. 4. Eating disorders and body image issues, PCOD diagnosed. Diagnosed with depression and recovered. Though I'm scared of relapse. Learning to love my self and my choices. And trying to have a long lasting relationship with myself so that I can have close friends 5. I'm an intern doctor, and I wish to make Healthcare more accessible and aspire to be very kind and be a smile spreader. 😊🌻", "9rishika": "1. My name is Rishika and that's it, do not have a nick name which sucks because I suddenly feel unimportant because everybody has a nick name but me! 2. She. 3. I love YELLOW and WHITE. They are such happy colors. Also, I have thought of it as my wedding theme, but also, I run away from the idea of marriage. How weird! 3. I have PCOD and I get severe panic attacks whenever somebody close to me fights with me or among themselves. I have this weird thing for fights. I can't see people fight but recently I'm trying to heal myself and be okay with people fighting. 5. I want to have a special force that saves children from trafficking. I know big dreams, but I still want to do this. Children deserve a right to choose their career path. They should be able to have the right to choose whether they want to be into the sex business. It shouldn't be imposed on them like that. It is inhumane and horrible. I want to stop all these mafias. I haven't discovered my super power yet, but coming soooon!", "bindiyawali": "❤️", "tanha.pathan.376": "🔥🔥🔥🔥🔥😘😘😘", "sarin_desai123": "Beautiful God bless you", "mahervaghchhipawala": "@maher_mast My name is maherdad Vaghchhipawala people call me Maher my favorite color is blue and black I put up a slipdisk while running a half marathon from last 3years not able to run put up lot's of weight but still fighting to be back to I use to run", "madhumita_49": "1. Madhumita here😎 2. You can call me Maddy😏😎 3. Blue🧢 4. The healthiest person alive 😏😎 5. If I could I would really love to beat some common sense in some people 😂😂 that people lack. And my super power is I can make a poker face for hours😂😐", "white_water": "Hi Iam George,@white_water, Fav colour is Blue,I want to reduce my weight thats why I am here just get some motivation from you !! ❤️", "rutchu22": "@deesha_c", "koffeecrazymommy": "P.S. colour: Red", "feellikeom": "1. I'm mariana, my friends called me Mar (sea 🌊) 2. She/her. 3. I've been into dark colours but now open to more colofour colours, warm colours. 4. I suffer from anxiety and ptsd, and depression, it's been a hell of a ride. 5. I wish people understand we all have struggles, maybe different struggles but we all go through them and we are not alone, we are not born to be perfect, be are born to learn and be loved", "11ag11ag11": "Natural beauty 😍😘😘😍🔥🔥🔥", "chaitanyaaa": "IM CHAI!!! (I’m also MALLU!!!) hahaha. She/her. BLUE/BLACK. I suffered from eating disorders (a range of anorexia, Bulimia and orthorexia) in the past... depression followed with that. I’ve definitely come a Long way since then. Although I can say I’ve recovered, recovery is a life Long process. I recognise how much more I have to learn, how many more authentic experiences I will be subject to, the more I’m willing to let myself be less subject to my own judgements and scrutiny. I want to impact the world with love. Art has always been an integral part of my life and I want to use music to speak my truth. to let people know and enjoy alongside with me the power we all have within us to create a loving and empowering self and collective connection. My superpower... well I think I laugh a lot and I am able to make the worst situations funny for myself. To take life as a joke sometimes and to laugh things off is as important. ❤️❤️❤️❤️❤️❤️❤️❤️❤️", "akshayc_11": "Sexy", "vinitha2112": "1.Vinitha, loved to be called as Vini.2.She/Her 3.Black,black and Black4.Pcod..being overweight..anxiety..5.I just wana say that it is okay..and everybody takes their own time to conquer.My Super power is I am a survivor..😅.Offlately...started running..and just love it..it keeps me sane..my solution to most of my problems are Run away from it..like literally🏃‍♀🏃‍♀🏃‍♀", "trishalafernandes": "Hi Natasha! Been following you for a while now, thank you for all the inspiration and love! My name is Trishala, and I like being called by my name. Also she/her works for me too. 3-My favourite colour is black. 4-Health issues - PCOD, asthma, chronic anaemia, a ton of skin problems, anxiety and major food/body image issues! 5- I've learnt the hard way to love myself and not give a damn about anyone who doesn't matter, I guess that counts as a mini super power. I'd love to just spread happiness, joy and love and cut out all the negative vibes!", "benaresi.lass": "2) Whosoever and she 3) Lilac and shades of Pink 4) Depression and anxiety", "jatin_s0204": "Yes Lovely Woman", "vijay.raj.rana": "Osm😉😉😘😘😘😘👑👑", "_legendarydonkeykong_": "read your story and I admire your strength u gooo gurrrlll🔥🔥♥️♥️", "thiviyakandiah": "Hi Natasha! 1) I'm Thiviya family and friends call me Thivi. 2) she/her 3) BLUE!!!!! Its the color that calms my mind at any given time and recently yellow! Crushing over getting a sunflower tattoo colored 4) mild depression, anxiety and lower back pain due to long hours of travelling (social worker life) 5) I wanna make people more expressive about their core feelings in that way we avoid so much misunderstanding which prevents hate!!! I also want people to become self aware, like listen to their own mind and body and respect themselves so that they can spread that vibe to the people they come across 🙈 Recently started following you and you've been an everyday inspiration to me 🙌 not that I workout everyday or do yoga religiously but I want to get there and be more self-loving and you are playing a significant role right now ❤️ so thank you 🙌", "anusha_anu._": "Hi @natashanoel001 myself Anusha a post graduate student in psychology from bangalore..3)I don't have any favorite color as such. Any health issues- yes I get easily affected by what others say about me. I wanna change myself first before I try changing the world. Kindness is my super power 🙂", "i_esh.a": "My name's Eshwari, call me whatever you like. She/her. PURPLE and black. Im.obsessed w purple. I have PCOD and am overweight, trynna motivate myself daily to push harder and reach my goal weight. Im an aspiring clinical psychologist, so my only goal is to spread awareness, reach out and help people with mental illness..yea! Thats about it! Love what you're doing, am.highly inspired by you❤", "chefsal_29": "Hie @natashanoel001 .I am saloni lotlikar. She/her. RED. Working my way through stage 1 anxiety, panic attacks, self image issues, and body fat. I exercise regularly and try my best to avoid junk and sugar. Yoga is my peace place and fat loss my aim. I love my body but sometimes I question it too. My super power is I bake. I am an entrepreneur,Baker,Cake decorator and cake artist . I run my own company called sana's Patisserie from my test kitchen. Self made turning dreams into reality, passion into career.i touch people's lives through my creativity and taste. I dont want to change the world, but change the perception of human beings. My goal everyday is to do be a good human,not just a human. Act like one. And help others realise they can too. I believe in hardworking and dedication and have utter faith in goodness. Love when small things make a difference. More to say but baby steps is the way", "gaur1952": "I will call you नशा सा", "_mishti_44": "Hey, I am Shreya Rathi. She/Her. Blue, Black, Grey are my favourite colors. I have PCOD and I have Bulimia Nervosa at times but it's manageable. I used to have depression in past but I have worked on myself. I do anxiety but I try to breathe at those moments. I want to make an impact towards mental health awareness, gender equality and body positivity. My super power is that I can make someone feel better by talking to them because I am very kind and compassionate. I want to change the world simply by liberating people through proper education, talking a lot about sexuality and sex, and making differences feel okay. Also, I can turn any talk dirty. XD", "aayushisingh_1702": "Aayushi Singh.. affectionately known as Chikku..born into a Thakur family, also married into one. Crazy for black and red colour. Fought anxiety and depression, also I had a fear everybody is going to leave me..I am almost at borderline obese , but also not doing anything about it, I am trying to be fit, eat healthy, I have hypo thyroid, diabetes, and muscular issues.. still not giving up on life..I have earned friends who are constantly making it easy to survive. I have been complimented to have a smile, which can lighten up anyone's mood, so I will take that as my superpower. Also...I am a potato..potato ..potato... 🤣😂", "borinchulo": "My name is Emmanuel. Everybody calls me Manny or Manolo. I love blue and black. I have asthma, insomnia, anxiety and PTSD. I hope just to make people aware that the answer is always within us, NOT the government.", "nsbegum11": "Hiii I am Natasha too @natashanoel001", "me_eats5": "Anju ,she, favourite colour would be violet, i got no health issues but i am normally skinny. I just want to empower people and stop body Shaming. My super power is that i am confident enough", "_a.n.j.i.t.a_": "\"You are an awesome potato, potato, potato! Love your body Love your body Love your body !!\" 👈 That's what's going on in my mind 😂😂😂", "oberoi.212": "Most beautiful and humble person you are 🙏👌❤️", "poopoopoooy": "Your are🔥", "shete4177": "U look so happy", "actorvinaymishra": "So gud physics", "iamak_0997": "Hey,,my love I just can't stop blushing whenever I see your post", "dhuwaria": "So cutee smile", "sarit_panwar": "Sbse sexy hot girl nats u nd without fear about bol jaatii ho aap ye have women power", "poonampatelkumawat": "Hey❤️❤️🔥 love you so much never miss out to comment and compliment you gurllll🔥 @natashanoel001", "zin_chris_dias": "@natashanoel001 u have so much of positivity that flows our of our post and touches mny ♥️ god bless u and ur journey 😍", "invincible_wini": "U r heart melting level of beautifull......", "_hima9_": "Love love love💙", "zubair_khan_offical777": "Pls come on diet..", "i_am_mayurkapadiya": "Hi my love and", "thehappysagittariusduck": "Hi. I am Sharmila. She/her. Fav color: Black. Without black, I don't know if I would be able to appreciate other colors. 4. Worked my way from obese to fit. Working on my health and fitness every single day. 5. I want to change the world with kindness. I practice kindness and compassion in every way possible and a little bit of love can make a huge difference, so why not change the planet with love?", "shiva.nagare.946": "Killer look you are osm Queen 😘💘👌", "khushmistry": "Hi I am Khushnum.. I am a she.. My fav colour is red and black.. I have thyroid issues but I workout like a boss.. Love powerlifting and all thanks to u love headstands.. I do a headstand/split/bridge everywhere I go.. I started following u in 2015 and loved u ever since.. I want to make a change in the world by introducing different ways of learning (i m into elearning and I wish to make a change in the way people r taught abt any subject in school, corporates or otherwise)", "reshmanairrr": "You are the best \"Nadasha\" ! 💕Keep empowering yourself and others!", "angrez": "1. Ashwin, family call me Ashu, friends call me Ash. 2.he/him 3. Black/red 5. Try to let people know that there is always two sides to a view :)", "sanjanasaxenaaa": "1. My name is Sanjana and everyone just calls me Sanju because what people just do not wanna be creative with nicknames these days! 2. I'll copy you on that 3. Blue and Black and white! 4. I have had asthma since I was three and was diagnosed with myesthenia gravis when I was 9 (well these are the two major ones!) 5. I want to make the world be kinder to the animals in general, and no I'm not a Vegetarian and I'm probably a hypocrite in that matter but j hate it when I see people being cruel to stray dogs.. so yes!! 🙈 That's about it..", "wasimalam4921": "Nice ass", "badassvegan_": "🔥🔥"}