{"909s0": "Bald is Beautiful 💖", "mdnaushad268": "Your ass is bad😍", "d_slytherindor": "This is why I did the same all those years ago. But you put in much better words than I ever could. You do you ❤️", "beauties___of_universe": "Hello Lady. 🌸 This @beauties___of_universe page is about inspiration. We are promoting self love among women and we need permissions to share your pictures so that you become one of the inspiration to other ladies. ❤️ For the description of your pictures, it can base upon your struggles that you overcome so that you will set examples. ❤️ Women can overcome problems and be bold and beautiful just like in your pictures. ❤️ please dm us if you are interested @natashanoel001", "paulinhaseixo": "@santos.carolzita", "saggy_a_sapre": "Great 👍👍👍", "nupze": "So ugly😂😂😂", "j33t__matharu": "🔥💓🤗", "serenity__vibe": "@priyanka_mhetre_", "viinii.sharma02": "@saxena_nitin_ OhMyGod! This is exactly why I want to do it too!", "heman1913": "anal booty", "vaidehi_singh47": "What you are doing is fine natasha and frankly I will be the last person to judge someone on their physical appearance but the society being judgemental has nothing to do with patriarchy. Men are judged too on a lot of things, it's just the way the world works. Stop blaming patriarchy for every little thing.", "vids_bio": "Hot🔥🔥", "bobby_paul11": "Sexy hot❤️💋", "viva.vliciv": "Marry me", "ayushi_ikonn": "Okay I might be little late to see this post . However , what shall I say . WOW!! SO much strength yet detached in one picture and caption ofocurse", "adhyaaa_roy": "Takliiiiii", "deepak.gautam.4444": "sssssssssssss hot", "shankar.thalari": "❤️❤️❤️❤️❤️", "harpreet.maan.5817": "❤️❤️❤️❤️👏👏👏👏", "alittaberson": "You're such a powerhouse i can't even deal. Thank you so freaking much for sharing your heart x", "babu9894118941": "U r great", "__anujprajapati": "😂tum pgla gyi ho", "atulrampal84": "Good morning cute and sweet day .. amazing power and strength .. stay fit & motivated 💪💪💪😇🙏💃💃. 😁👏🍹, I will pray for you", "onebody_oneearth": "I've tonsured and donated my hair previously but I've never had the guts to even take photos(let alone post) or come out to places. Your posts are giving me the strength to do it once again only this time Ima boldly own it with confidence. Lots of love @natashanoel001 ❤️", "stfu.charull": "This woman yes you I'm talking to you ....you're amazing I just love they way you live yourself 😍😍😍😍♥️😭🙈🔥 @natashanoel001", "vidipatel_1": "You are beautiful the way you are Natasha", "rit._.singh": "You are so cheap...I had never seen before like you just show off and attract the people, and you always show body parts it's called cheapest I'm sorry but you should have to wear good clothes.👌", "thats.what.c.said_": "@better_thansome my thoughts exactly.", "shreeganeshyoga": "Simbbllly beautyphhoool", "mohez7585": "Balls to be bald n beautiful", "kittuchinna26": "Be in bald for an year", "raj_rocker15": "Aise pic mat dala karo. Veerana lagri ho 😟", "priyankadeyray": "❤️😻", "sarin_desai123": "Lovely God bless you", "vickel_daniel": "Que fea", "bherwanivicky": "Pagaliya ha tu bahan chod", "rehan.raj4": "Looking gorgeous and 🔥", "aditipradhan27": "I see so much hatred in the comments. And am so sure that it hardly matters to you. Just came across your story in @officialhumansofbombay and was going through your profile. What you do is your choice. More power to you Natasha. And going bald, for a girl who had such lovely hair is a such a big step. God bless ya❤️😘💕", "rza_randhawa": "Yes we with you ❤️ babe...one love... I also depressed but I'm enjoying my journey... Its blessing... We becoming wise...and that's great feeling @natashanoel001", "sushritha_moorthy": "I get exactly what you mean!", "kshitijsgore": "Besan ladoo", "mohdumarkhan18": "Abe tu kya psycho h kya....", "abhishek.aggauta": "So finally i understand why u cut ur hair after reading your caption ... So no offence ..... It's your thought process...hope u will soon grow ur hair again.... We don't want to see you like this forever....", "depelated": "Why does hair matter? We are all atoms floating through the universe anyway.", "_sameer_verma_": "Look change?? @natashanoel001", "instamodel.agency": "YOU'RE OUT OF THIS WORLD Natasha. Kudos to you girl 💪💪❤️❤️", "internallygrateful": "You need a vacation", "jaydoug_2000": "You look beautiful 😮❤️", "creative_soul95": "Being Indian, I feel so proud of you! you just broke the stereotype! When we see world, people choose to do whatever the hell they want to do and it's really amazing! And people appreciate it! So I love the way you got the courage and broke the stereotype! I love the way you look! You look beautiful", "amol_pupulwad": "😍😍😘", "javidkhan3710": "Meu deus", "prasanth.666": "😜😜😜👌👌👌", "lovelymanly": "Very true", "pragya3852": "Ok...Just for showoffness u were going bald isn't it... Truthfully I was following uh bcz of ur strength inside n outside bt now u r going sick for intention and sympathy day by day...Going bald is ur choice bt I prsnly think dat u r just making fun of urself frm ur own post n rather gaining of ppl respect u r losing thru be strong be u...", "rahul.joshi.1829": "What non sense", "khalifa_chauhan": "Fullpower", "vikranth_rana": "😻😻", "kanoyoga_lefkada": "Investing in loss! Respect Natasha 👍", "kayneast": "You shaved your head big deal. No need for an essay 🤷‍♂️", "hybrid_scorpio": "i have been following your channel and page here for a while ...and i have never seem someone so true and transparent to themself and to the their audience .... everything you say comes right from your heart ..and it shows ..hope we could someday and do a collab or something on fitness..CHECK OUT MY PAGE if you can .PEACE ✌️", "gaylerodrigues": "Then why post a picture? 😀", "_.yashujn._._": "I dont know why since the day I have followed u ..I am just very happy I dono how are u inspiring me in really love the way u are ...#godmadeujustforme", "kasimbafraj": "Wow amazing", "dev_sukhdev_": "Love you ❤️❤️", "zebajahan730": "@natashanoel001 If success is a miracle then you must be the miracle worker❤❤", "mack_r_d": "You are an awesome potato..... 🥔😂😘", "krintanchaudhuri": "The baldness is surely effecting your looks but not your beauty. You are still the beautiful dragon lady. 👍👍👍", "mr.jakke_911": "I like vin diesel but I like you most😎", "samadhiblisshealingarts": "I've loved everything about your soul 🔥👑📿💚💎 #yogini #koshas #noteasybutworthit 🙏🏽", "sakethsarvabhouma": "U", "sanu.shekh": "😍", "varoonkal14": "🙏🏻🙏🏻🙏🏻", "zrstdio": "Man fabulous parson you are living a wonderful life woman you are awesome thinking person", "anandkadkol": "😍", "bhavita_singh": "❤️", "ghaziamalik288": "Ye kia kr Dia balon ko", "fashion_forever_dz": "Sexy😍😍🔥🔥🔥", "kavitanair4": "👍🏻👍🏻 Go girl !! I too want to donate or go bald for some reason and in some way this encourages and gives confidence that look beyond and there is so much to do! Thanks 🙏🏻", "dashawnhackworth": "Yout still sexy af 😝", "gymsharklegend": "@natashanoel001 even i have gone through depression for nearly 5-6months since last December and life was totally screwed up, felt bad about myself and stuff, had gone crazy. but one question why did you shave your head bald due to depression? may i know? 🙂", "harishravindranathan": "Look like small baby", "faristudiosart": "Respect ✨", "muzaffarali194": "Good", "shraddhaclicks": "One of things I struggle with in depression is washing my hair. Its painful and I always get tired", "king_to_himself": "Bvc", "mohitkumar3815": "Unfollowing you", "rajiv.rai125": "Love u babe they u are, stunning like superstar🔥", "alblaz23": "Luv the bald head, you have do whatever makes you feel good in life no one else. Still beautiful inside and outside. Be yourself and do you. It takes a lot of courage to cut such beautiful hair off I admire that courage and strength.🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🏆💐💐💐💐", "radhika1855": "R u mad.y u cut ur hair?", "margaritopalayot": "❤️❤️❤️👏👏👏👏👏", "krickgamer": "Your butt is so bad condition", "maryamnadeemawan": "More power to you 💙", "celebrity_dog21": "I'm shaving my eye brows", "sunjeev_sharma": "Superr natasha", "ibrahimbel_": "Your ass is so much ugly (after this shaving)😣😂😂", "vinuscrashsofficial": "Woww", "natorisatori": "@natashanoel001 I did EXACTLY THIS years ago in my early 20s. For months I fought this unexplained urge to cut off all my hair and when I finically did I realized I just wanted to see the beauty beyond the hair, my real face. I also struggled with anxiety and depression at that time... I never regretted doing it as it was one of the most empowering phases of my life! It was also I time that I got deeply in touch with my inner masculine energy, which ultimately gave me a nice balance between feminine and masculine. Most people are closed off to their own inner opposite energy and we need to be in touch with both sides to be balanced and whole. I love it 👏🏼 you rock it! And I get you 💯", "ozzy_talyor": "I've been following for a while now, to be honest I never communicated or liked any of your posts, still I keep following you I guess (or to be more honest) I know that I'm following you cuz I see u as one of the most beautiful girls I've ever saw... Seeing what u did lately - going bald - is one of the most beautiful thing u ever did, it really shows in ur attitude now, I can tell by the way u express ur self now... And one more thing, ur bald head is now ur ur biggest ' strength'... Beautiful 😍😍", "abhi_ansari786": "Oh wow ossum👌", "shetty_prats": "Kudos to u girl... @natashanoel001 ... proud of u", "justbeatsproductions": "My booty cut her hair! 👀👀👀", "aadihmoni": "Nice thought...", "rolando.paredes.58910": "I love your bald head", "swerdys": "💜💜💜💜💜", "ajayduryodhan14": "Taklu", "psy_naresh1127": "👏", "indiandesistyleb": "❤️", "yogi_bhagavati": "So much strength in these words and actions ::: thankyou for this - so many of us hold the Same thoughts through our hair so thankyou thankyou thankyou for being brave enough 👁💛👁 and surrendering aum aum aum", "rosette.joseph.731": "💓", "ash_the_yogi": "You are such an inspiration ❤️😍I'm so proud of you and the powerful impact you creat on this platform! Mad love for you lovely ❤️🔥😍", "yogenderkumar8444": "Sabit kya krna chahti h", "poojabirmole12": "1", "mukundjhaofficiall": "Why you shave off your #hairs beauty ??😍♥️ @natashanoel001", "carenshine": "You are awesome 🙏💐🤗", "raees_isakani": "🔥🔥🔥🔥👌👌👌", "_gm_asif": "😂😂😂😂", "mohamed_siddiq__": "😍😍😍😍", "dori.nax": "Zhoon che kiuni dari , bede bokonim baw 😍", "guriwaraich38": "Nice pose 🔥🔥🔥👸😍😍😍", "sony.italia.19": "One time post nude pic becose this is body you love your body.", "meher.tara.muah": "More power to u Natasha! Keep pushing your boundaries. We love u. 💙✨🌟💙", "ratheepan_ari": "#🍑🍑😍", "mahmoodshaikh123": "YOU R VERY GOOD LADY GOD WILL HELP YOU 🙏", "mylifeanswer1974": "Sext", "sarabpreet_kaur_": "I just love you nadasha...!!!! I wish i could reach at that level in my thoughts. Love love and just love from my side 😘😘😘❤️❤️❤️❤️", "var5441": "Greetings Hey 👋 Extremely appreciated I highly proud of u that u have guts to listens you n not fooling yourself as somewhere I did so but ur each n every actions really motivates me n I really mean that 😇😇 god bless u always n may u achieves ur soul over ur mind 😇😇😇 hip hip hurray for ur greatest achievement hatts off dil se proud to say I m ur follower 😇", "shrugopal": "@natashanoel001 you are beautiful inside out. ❤️Much love and more power to you. 🤗 Don’t give a shit about the negative comments. They know nothing about you. They are just shallow and immature. Do what you love doing. It’s your life. Your wish❤️🤗", "joana_art.unes": "Power to you, woman! 💪🔥", "sahil.sahani.39": "Hats off! To you.", "therock6892": "Nice", "pra_g_matic": "Now i know for sure.....some serious issues behind those smiles n launghs n songs n dance😕", "gan2267": "You are creating history ..by telling everyone .what to expect in life and how to deal with it", "photophile99": "Amazing pic", "nude_yogagirl\nVerified": "Verified", "tanvipaatyan": "Beaut", "hypnotizer__69": "Where's yr hair darling ....why u do that.....u heart me alot", "____hippy_sunshine": "Crazy look Dear=❤️+🖤×😉?🤦‍♂️", "petitemarie04": "@natashanoel001 you are a REAL individual and that is a rarity nowadays ❤️ and for all the people commenting negatively, measure your words before you say them...", "saumitra2987": "A photo of exceptional merit, lovely swimsuit and as for the baldness, the caption essay is simply splendid. Well done.", "verma_ila91": "Wanna donate mine too. Can you tell me how can I ?", "sagheerahlakdawala": "@anikhmohd The world needs more people like her❤", "shiiimalka": "♥️", "meditatewithrishi": "You're a true yogi 🙂🙂", "mumbai_cpl": "Shakal", "shi_boos": "😤", "akash____aka": "Sorry for your loss👽", "praj_05": "I fail to understand why people feel the need to be rude and aggressive towards someone's personal choice. Wonder what sort of twisted mentality they have. Instead of women supporting other women and uplifting each other in the process, they choose to focus on putting other women down. Live and let others live in peace.", "woofnroar": "I love you! :'')", "latikaprajapati": "I love you the way you are just pure...😘", "gaanarupini": "🔥😍", "sandeepvarma321": "You choosing to step outside of boundaries and not stay within the comfort/ safe zone (set down by society or yourself), inspite of the anxiety and depression, is inspirational as always, Natasha. I would earnestly want someone like you to be my child's partner for life !Fortunately for you, I don't have any kids... yet. 😈", "_tom_bentley": "Salute💝💝💝💝", "pankajgandhi_06123": "Takli", "gillyontherock": "Do anything to release your stress and b happy. U r a cute potato ....🤗❤️❤️❤️❤️😘😘😘", "zuhair_panchaity": "Fuck your body fuck your body", "mans_trainer": "Blaa", "monika_arora79": "😘Mastmoula hai ye ...ladki...or kuch nhi", "abhayecc94": "i love u", "___pradnyaa___": "❤️❤️❤️❤️", "dalal_alsabt": "Telling ur thoughts to people is a good idea, but it won’t make ur depression or anxiety any better since there will be people that will criticize u for these things ur doing . It’s just lack of attention and not knowing which direction to take in life so ur trying out everything..", "arhaanakrishna": "You go girl ❤😘", "kaveh.ranjbar2": "Great", "amitji001": "Ye kya kiya apne", "ravi_agarwal_1": "Wow, you are awesome. God bless you", "artofanoop": "From your posts, I get a feel you are the most happiest and bold personality out there. Where is the depression and anxiety sneaked from?🙄🤔", "saumyamishraig": "❤️", "devsaha7": "What the....", "dashescape": "More power to you girl💕", "serial_chiller0047": "Kya depression hai be tere ko bewkoof ladki", "thatcrimsonaffair": "You be the best @natashanoel001", "____nikks_____": "👌👌😱😱😱😱😍", "kavya.jayy": "the world needs more of you ❣️", "narenndr": "Awesome", "born_to_pizza01": "You amaze me every time🤩❤️", "_fashion.hacks.by.shrestha_": "Best", "surbhi.sachdeva.564": "You look lovely and love your content👌", "aakashmukherjee980": "Sexxxy😋😋😘", "danibragaglia": "Seriously you are the best!", "adorableangies": "You are beautiful darling", "kamthanakshay": "You are doing great 💪🏾 We respect you 🙏", "nikhitaputta": "Omg! That is exactly what I did in 2015. I felt like I was reading my story when I was reading yours. I was going through a huge transition and I needed something strong to let go along. Like you, I was obsessed with my hair, I used to identify myself with my hair and I needed to feel confident, loved and needed even without it. I felt this urge to shave my head and I did. And I can't believe the things that happened to me. I met my husband then.", "fast_torquer": "You kinda look like One-Punch Man now. 😂", "rihab.di": "My love, you speak from a very honest and vulnerable space, we don't have the balls🔥❤️.. blessings your way (thank you for representing us)", "popatnimehul2611": "Very nice pictures", "amitnandleofficial": "What are you posting??", "aliulmulk": "@munnazaahmad nachar gaderi hoe ma kheyala... Good going Natasha 🙌🙌", "gaur1952": "Looking beautiful", "_.shine_.jr": "🌻", "nikhil.mass": "Spa at Home Massage Offers Get Aroma Massage for 90 minutes session only for Rs 300 Only Get Swedish Massage for 90 minutes session only for Rs 350 Only Get Deep tissue Massage for 90 minutes session only for Rs 400 Only Get Chocolate Massage for 90 minutes session only for Rs 500 Only", "ishaayoga": "U r truly an inspiration Didi😊", "vj999999": "More power to you ❤️❤️❤️", "razzz_purohit": "टकली 😃", "geetikasillara": "Proud of u ! and u look awesome 😍", "peta_white1": "When I was watching your video, I was in awe of you. I thought a couple of a things, the first was ‘I can’t believe she is shaving her head’ (said with an admiring smile 😊). The second was ‘wow! How good it must feel to shave away our ego’. Then it made me wonder what I considered to be my ‘biggest strength’ or what ‘added more to my beauty’? What fuelled my ego? I’m still pondering this, I’ve actually been thinking a lot lately about my ego and the masks that I put on for the world. I’m so tired of having to be 𝓉𝒽𝒶𝓉 person, I’m slowly tearing down negative patterns and feeling more comfortable in my own skin. But I know I have a very long way to go before I can 𝓈𝒽𝒶𝓋𝑒 away my masks, feel liberated and free. I know that you have your own personal reasons for doing this and whether you share your journey or not is really your decision in the end. But I am so so glad that you did share it, because I got so much out of watching the process and it looked like you had so much fun and was surrounded by supportive friends and loved ones 🦋❤️🙌🏾😁", "yudishnee": "Dear Natasha you are so beautiful inside and outside, and this precious sharing resonate so much with me right this moment 😍 I was watching nappily ever after on Netflix yesterday and god I was also thinking about wanting to shave my hair so that I can truly experience that freedom that comes with it from inside as well outside and break my conditioning, be just detached and let go of judgement and this need for inner and outer perfection, girl i admire you and god you are so beautiful thank you for this post thank you for doing this, going bald scares me I’ll be honest but I have faith that divine timing will led from inner and outer fear to inner and outer love! Sending you unconditional love ❤️❤️❤️", "apurv_bhongade": "Ye tu kitni cute hai re 😍❤️.", "aatharva": "@___mitzzz.0.7", "aslamshaikh7230": "Nice back", "rishikmenon": "👌👌👌👌", "yadavchandan722019": "bkwaassssssss", "stornettabcolaco": "Mental illness is mostly ignored or overlooked in our country. With most people telling you 'its all in your head, snap out of it'. But as a person who suffers from anxiety, its not as easy as it seems. It's a constant struggle to find a balance in all that u do. And I would like to say hats off to you Natasha! Thank you for inspiring us to accept ourselves the way we are, imperfections and all. I wish you luck and light in ur journey. Sending much love to you😘😘😘😘", "warish_ali_7151": "R u crezy", "7th_ammendment": "Awesome🔥✔✔✔✔✔", "storiesbysurabhi": "❤️❤️❤️❤️❤️", "xatixh": "Pls check dm", "rayy_diva": "You're such an inspo, lotsa love ❤️", "fearless_smiler": "More power to you❤️", "sin.s.k": "Really looking you❤️❤️👌 super", "chinnu_99999": "But we can’t stop appreciating you 🙏", "sai.lakshmi": "I totally get that! You go girl! You are a sunshine truly! 😍", "ajithshankara7": "❤️❤️❤️", "nikkkuu22": "Thank you for teaching us the true and purest form of self love, we need more human like you. @natashanoel001 💖", "tiktokindiasocial": "Nice Post❤️Do msg me if you want to earn between 6000 to 50000 monthly on sharechat app👍", "timetomakegains": "Still see a beautiful lady 😍", "jeetking": "😂😂😂😂", "kedvir": "You are strong girl , not everyone can do this ! It needs guts !", "asadhssn": "Cactus on the butt. 🌵", "jhilmehta": "KWEEN 🙌🏻", "aaravriya": "Looking too good", "unfold_ur_own_myth": "Grl ur killing it... Loads of love to you ❤️❤️❤️", "shivasshakti": "You are a Killer Natasha!", "thesaynick": "@natashanoel001 so you got rid off of your obsession. Interesting🤔.", "aniket.kumar.gupta": "😂😂😂", "causeimwarrior": "Bald look, u look more beautiful...😊", "kanchannegi1205": "💕💕💕💕💕You r dammmmmn💕 g😍o😍o😍od 😍😍😍😍😍😍😍😍😍😍😍😍😍😍💕💕💕💕", "maryannerah": "A true inspiration.", "soundsaroja": "@rady_sun", "welcometoluckycity": "Horror 🖤", "singam_69": "@natashanoel001 u are losing it!!", "thekev69": "As long as we know in our hearts we are doing good, that's all we need to know. Stay humble, stay brave, stay focused, and hey @natashanoel001, have bad days too; it's what makes us human. And as for going bald...hey, less time spent in the shower, and more time spent doing 'good'. Keep on rocking it, girl...whatever that means 💪👍🔥❤️", "sayista_toskin": "❤️❤️❤️", "vishal_sahani": "❤️ breaking the stereotypes like a bawse! 🔥", "a_man_with_noname": "More power to you natasha! 💯💯", "itsamy_official": "I can understand cuz If I were you I would have done the same thing....😄", "naomibowler": "you are an inspiration. i have had thoughts and wishes of going bald too in the past but never had the courage to go through. 🙏🏻🙏🏻🙏🏻", "moodswingsaga": "This is exactly what I want to do once I grow up. Once I have a stable life, good career and my self esteem is at its peak. I want to take a step back and shift my self confidence and love myself for every inch of me.", "10_on_ph_scale": "Kudos to you. You're on fleek with what you want to preach. 💯", "roulette__r_h_artist": "👌", "himalayan_brute": "👋👋😘", "disheww": "Iloveyouuu♥️♥️♥️♥️💕", "baskarravichandran898": "Omg", "amzkang": "narcissist😋", "miss_sturmfrei": "Every post you posted, every step you take and every word you utter - you define what inner strength is. I am also deciding to go bald and seeing you taking this step made me affirm. ❤️❤️❤️ Natasha - you are an amazing person and i dove my hat to you😇😇.", "_ph_alguni": "Sexy", "sarazafotakem": "you are beautiful 🌹", "ddesai709": "👌👌👌👌👌👌😍😎", "shiva.nagare.946": "killer", "lets_talklife": "I always read the whole lengthy stories of yours , though each story make impact but this one is above and humans with uterus Am Loving this new definition of us 💪🏻, more strength to you girl 👧 or rather 👩🏻‍🦲🥰😘", "_esstrix_": "Haha you're beautiful! Butt, boob, bald and all!", "annujthakur": "Stay blessed", "trulygaurav": "Why :(", "sandeep.9t2": "New look awesome", "sowmya9230": "So brave😵👏👏👏👏👏", "jayeshsaid": "Hey Natasha ur a such cool person", "krushang._.shah": "Now shave off your eyebrows 😍❤️", "bujairvzr26": "Your booty fat", "sanyanarang": "I am so glad that I have instagram and I am your follower. ❤️ You are one of those people who are not really afraid of stupid and meaningless things. You go girl. I will make sure to meet you someday. Lots and lots of love to your courage and power. 😘😘", "preethijk": "Simply love your thoughts..and just you in general 💖🙏 I've always wanted to go bald too don't have the balls to do it yet but hey maybe soon!!!", "sharmaurvashi471": "❤️❤️❤️", "shruti__mane": "While scrolling i thought it was a baby picture. You look so cute😍", "glen_lovestoned": "Looks like moustache has grown on the forehead 😜😜😜😜", "marianafalaschi": "❤️❤️❤️", "anant.1612": "i totally get it.. you are courageous and willing.. u will definitely attain tht level of mental peace u are striving for.. just breathe.. and observe the breath.. nothing else is required .. to calm the cyclones withinnour mind.. just breathe.. and monitor.. airgoing in sme wher.. and air coming out frm sme where thru nose. .. thats all ..!! keep going..!!🙏🏼🙏🏼", "garima_95": "You are really amazing. 👍 I am so proud that women like you exist.", "ig4nw": "Make me feel tht world has enough idiots!", "tanya_sagar": "YOU ARE SO STRONG 😍", "nayaneshmehta": "🙌🙌", "riya_jeph": "I love you Natasha for being so genuinely yourself and you really inspire me a lot.", "sha.manisha": "This is the first time I'm commenting because I felt that you are amazing and already have so many people to applaud you. Just want to say, this is amazing and this post has uncovered the myths and fears I have for my body. I love you for your raw pictures and fearless attitude😍😍😍", "stefreal7890_": "cellulite", "hueman_____": "Who is your official photographer 😂 I know that u r a crazy peak ,and iam thinking how wiard yr photographer dude is...who behind all your posts😋", "skylife7480": "🤐 already pics were spoiled with those goofy expression plus baldy head 👏👎👎👎👎", "stephanekoumou": "Beautiful soul 🌻🌻🌻🌻❤️🙌", "srushti._.b": "You are such an inspiring person. Thank you so much for sharing this with your followers. It's really amazing how you are holding and I am so proud of you. I am glad I know you even if it is through social media ❤️", "sailushaji": "Love you❤️", "hungryclone": "Yo! I was planning to go bald this Friday(today) and I did! I just caught up to your feed and highfive!!! 🙏", "stylesnsmileschennai": "Hi, I am john stylist and styles n smiles we are helping for cancer people awareness & support for cancer initiating with Rejuvenating Life a for awareness that bald is not bad on women so many women's loosing hair and confident on treatment like to show your support & solidarity by donating hair call 97913 99136", "kajalkohlee": "Just loved ur page 💚💚💚💚💚", "ruchiemehta": "I have been thinking of it for a while now & I hope like you I find the courage to let go off my biggest asset ! You are a badass & I love you ! ❣️ Stay strong & keep inspiring 🤗", "perthstorm": "Legend 👍", "womanofxpression": "🙌🏼🔥💛", "jijo1981": "Hey nice", "bighairloudmouth\nVerified": "Verified", "dhananjay___joshi": "Sorry but bold not looks good", "nijj7681": "R you crazy", "meena5477": "Yeh kya hai picche dehko picche hahahahha😍😂🔥", "_a.n.j.i.t.a_": "We love you for the content, positivity and love you share with all of us and not for your appearance ! (Which is by the way soooo cute and even more cute nowadays ❤️)", "divyeshdroll": "That's A Killer Pic!!", "rafay.alam": "More power to you Natasha. Going bald for a bit is a great way to challenge your perceptions of yourself. Enjoy yourself 🙏🏽", "iyyanisujit": "Wow👍", "this_is_bhavini": "We love you.", "casanova0057": "Why u bold", "kanchanparikh": "Totes get it 💯 - so much courage, it’s commendable. Thank you for your post ♥️", "ramya_erasappan": "Still look like Queen 👑 👸", "chaitanyaaa": "I love you. You are so so inspiring and so full of life. Thank you for sharing, this is so accurate! ♥️Challenging your personal boundaries are always tough but doing it (and doing it to do good) is even better. Sending so much love your way, beautiful human!!!", "arg_225": "Wowowowowoowowoww", "yashashree____": "You have given me the strength and courage to accept everything. You have made me realize that only person who can make me happy is myself. I don't love myself, I won't get any further. Thank you for being a great encouragement", "stel.stella3": "You're a goddessssssssssssss.❤️", "alveerax": "🙌🏻🙌🏻❤️", "thakur_chander066": "U r the best....a💞💞", "priyankabhati08": "You are looking cute 😍😍😍", "zarakm": "Love the thought.. AND That flamingo suit! 😉", "riyaa._.20": "U r one of the nicest person i came around @natashanoel001 ...u r just not an inspiration ...but u make us smile everyday and make us feel more confident abt ourselves esp teenagers like us.....we all loveEu a lot......❤️❤️❤️❤️❤️😍😍😍😘😘😘😘😘😘i wish i could meet u in real once....i love u loads", "justxtannu": "Itna positivity kahaan se lati hai??!! 😊 Keep enjoying 🙃 Keep loving", "_yashjaisswal_": "Why this moustache is on your forehead 🤔......", "its_the_foodinator": "Shinchan eyebrows😍⚡😂💯", "natashanoel001\nVerified": "Verified", "vikkkkasss": "I feel there is something wrong with you"}