{"sikelivakawaletabua": "How many inches it got must be relly deep...\"", "aaditya_jangir__": "Reply karne ka mere paas time nhi h.. Your mentioning 😂bsdk😂 .hence same to u.", "anirban531": "I have been a fan and will remain to be that way. But I have a question. Do you clean than toilet by yourself ?", "siddhusiddharth_": "Just do it", "shayan._.0xx": "@x.zeba._", "_.askdance._": "@minatouza its a joke fgs 🤦🏻‍♀️🤦🏻‍♀️", "vikranth_rana": "Ha ha funny yet cute", "martz.lacoste": "U want to deliver my baby?", "mirchi.darling.1": "❤️❤️❤️❤️❤️❤️❤️🔥", "kapildubey53": "Looking so funny😋", "__tonishaa__": "Thanks for this information! I've been facing these for a few days and couldn't quite figure out what to do exactly. Now that I know, I'll see a doctor!", "hargunxoxo": "Thanks for the post. Such awareness is needed for common and not so common vaginal infection and tips to prevent. And this is first post I saw discussing the most common thing which is faced by every women yet it’s unspoken. You explained with much specification and clarity. Go girl💞", "angelikadavidd": "@maahi_af", "bobby_paul11": "Sexy 💋", "anushka_sharma1801": "❤️", "syedaaleezaa": "@tkhan____ read caption", "kalpeshpatel1460": "Right", "dpadatheffect": "Lol.. love this pic!!", "pantelakis.g": "Yo creo q estas en orgasmo mira justo donde esta el coño se vee mojado esta choreando😲😲", "meetsoham": "ha ha ha.. yes it feels like that", "roamingdoctor": "🍹good information", "yumyum_cor_18c": "You really enjoy.. 😁", "mansilausdeo": "Love that you used 'humans with a uterus'. It's far more inclusive than using females and transwomen. And much much more humane! I'm borrowing this terminology from you. ❤️", "poonam_pandey_india": "❤️", "mremyaraju": "Thankyou for this post..😚😚", "shreya_bhatt_acharya": "Shaving is good or bad for the vagina???", "pathakharish09": "Amazing", "heartlessboyfriend": "Awsomeeeeeee Natasha❤️❤️❤️❤️❤️", "birds.pari": "What causes leg acne and how to remove its spots ?", "kingstarbag44": "Nice sexy bathroom", "sohel.me": "❤️ nice post", "aishaa_world": "The reason why I love ur posts are😍 u are very Frank n everything here is relatable 😍😇loads of love. Proud fan follower😇", "rgunajee": "I like your precious tips thanks", "laughingbuddha_1": "Funny how you keep on mentioning humans with uterus", "merc.by.nature": "Jaja 😂👌🏾", "jitenddrachawla": "Follow @jitenddrachawla 💐⭐️", "sri_lone": "👍 Best information necessary for every female..", "tarunyoga1": "I would like to thank you for a wonderful person you are...there are things that being a boy I cant speak and which needs to be heard and adopted by our society..thank you for all your efforts and keep doing this good job😊😊😊😊😊 and yes you rock in each and every pic of you❤", "viktorcharl": "Never go full retarded", "ashima_basak": "One most important habit that changed my life that is using Panty Liners when ever I am going outside n not wearing panties inside home. TRUST ME GIRLS _ TRY IT_ONE SIMPLE HABIT WILL SAVE YOU FROM ALL VAGINAL ISSUES.", "riyavasthi": "Who clicked this?", "cvinitak": "You are women goddess.. thank you for all the effort and inspiration towards us females, love ya so much women! 😍", "itsmeesomnath": "R u Psycho?", "naeem.khan.7121614": "Gundi bachi", "shaheemmohammad": "In some other post u said that vgaina is a self heeling part and now u are speaking about orgasam, Seriously?? If u want speak about some one who has to go to a gynac what made u to speak about your feeling when u have orgasam? Looks like u lost some along with ur hair god please", "vjsart": "Are you ok 😂?", "khurana.gauri": "❤️❤️❤️🔥🔥", "khushbupanchall": "Thank you for this info♥️ @natashanoel001", "chetanchaudhary4": "Pagal ho gayi hai kya, 😜😜😜😜", "rjp6867": "Good Information", "vikramwaghmare.official": "Who is the capture this Photo", "sumer_rapper": "thanks for the ted talk video by seeing i got the inspiration that i can also do it", "vaani_manoharan": "💕", "lloangd": "😂😂😂", "__zehnaseen__": "Yup water and it in itself is sufficient , nothing else required..", "rashmi1_": "People also get confused with fungal infection and Urinary tract infection, UTI is very painful and they both are treated in different ways.", "rahul.lalwani_impulsiverider": "Wow..love you for spreading such awareness. More power to u", "charan_mcd": "Hey @natashanoel001 i started following u when u have posted potato dance video even that has some meaning initially i thought u r in mental and have some pain in u r mind for u r past later after few days of following i felt u r something different than anybody.. Great u r just guiding and inspiring to others loved u r different mindset keep rocking always 👏👏 and this is informative #ALL YOUR POSTS ARE INFORMATIVE 💯", "harshaaxx": "Inspiration ✨❤️@natashanoel001", "mjaneesh1276": "Peri Vandana lla", "raahul.handsome": "Real meaning of beautiful❤️🔥🔥😍", "viktortude": "Ur eyes 👀 😂😂😂", "choudhary.s.raja": "Kya hoaa", "rehtsedaniel": "🙌", "parvez_khaan": "Deewani ho gayi ye😂😂😂🤣🤣", "adv_thiagocastro": "natashanoel001 👏👏👏💪💪👍", "beauties___of_universe": "Hello Lady. 🌸 This @beauties___of_universe page is about inspiration. We are promoting self love among women and we need permissions to share your pictures so that you become one of the inspiration to other ladies. ❤️ For the description of your pictures, it can base upon your struggles that you overcome so that you will set examples. ❤️ Women can overcome problems and be bold and beautiful just like in your pictures. ❤️ please dm us if you are interested @natashanoel001", "roopaksharmasince80": "😂😂crazy Yoga girl", "saisnigdhaa": "Thanks for this ...I'm a medical student and everybody needs to know this. I'm so grateful to be following a person who is using their voice to educate people and empower them everyday ❤❤❤", "nareshyadla": "Your a special women in this world. Keep growing. All the best for your future.", "mahek08dhillon": "Hi Natasha ..any exercise is which makes vagina tight..apart Thankew for dis amazing post ..love u❤️", "middlemarchmoon": "Ohmygod thank you so much for this. I've been having these recurring yeast infections and I've been trying to take preventive measures. Your post just affirmed to me I'm doing it right. ❤️😭", "rosette.joseph.731": "💓", "nonvijitarian": "And cut sugary/yeasty food! I was told to stop bread and coffee when I had candidasis and switch to fermented foods like tofu, sprouted bread, idli, etc. Worked wonders!", "surfinland": "Nut case - when are you releasing your porn video", "krickgamer": "Kya h ye ...wtf 😥😥", "mrohit627": "Looking super", "mks0007": "Wah Bhai Wah mera desh badal rha Or dekho kitna aage badh rha hai....", "mychoice_mystory": "Thank you for this.. A big hug to u🤗❤️", "kritikaa_thakkar": "Also, thankyou for sharing the information it helped! ♥️", "rohit.k.5872682": "These days u are looking like mad girl😉😉", "criminaldefenselawyer786": "Kya hai yeh notanki", "bieberjustin6s": "why the skin around it gets darker", "j_rahul_8": "😇😇👍", "miztachemical": "@rathnavaikheswari", "shivaniv1902": "👏🏻 You are the rarest person I have found on insta, who’s spreading awareness about vaginal infection which is very common.. Great gal... keep it up 👍🏼", "monikart._": "I m a 16 year teenager and for me u r becoming most inspiring woman. Thanks for all ur work :)", "hairfrisk": "#thoughtonapot", "akhil.4122": "Hahaha your expresion was awesome ..your feelings was like that😊..anyway good message for girls", "dirtycaffeinater": "Yessssssss meeeee", "jitin_james_raj": "🤣🤣🤣", "vevee541978": "Wow. OMG", "guptain_sonal_": "Thanks for the post 😁", "eyebeski": "I swear u are the best! Keeping it real and with the best humor, just how I roll in life.", "sin.s.k": "Wow really like pik super👌", "cwbnutrishop": "👏👏💪", "vijay_99parmar": "Ye tho pagal ho gayi he", "saispandana18": "💓🙌", "aliulmulk": "@munnazaahmad Nachar emete gaderi beru berai... Wow Natasha that expression 😍👍👍👍", "welcometoluckycity": "💙", "sunnymends": "😍😍😍😍 @natashanoel001", "roger09thunder": "Wakanda forever", "shi_boos": "Best treatment first", "stfu.charull": "If we shouldn't douche than how can we wash it 🙄🤔🤔🤔 @natashanoel001", "umasuresh1422": "I love you a lot.. You are just awesome... A great motivator... Thanks for you... ❤️❤️", "the_smiling_khaleesi": "Recently I have discovered if I change the settings on my shower head so the water pressure is harder and faster it works wonderfully as a tool for masturbation. My question is, is there any health risks for using water for self pleasure? My main concern is getting water in my vagina...could that cause issues? Thank you so much!", "dog.ma.indisguise": "I got one of these... And it was fungal. Thank you public toilets that aren't cleaned!!", "luzie_sr": "This is so important!!🙌🏻 I also experienced that some kinds of birth control are linked to yeast infections.(Even my doctor admitted that this happens to a lot of women)", "zavareh": "Toilet paper role needs to be over .. NOT UNDER!!😂😂", "dr.neelrohithreddy": "👾", "_santosh_patel": "Unfollow", "kaur_robinpreet": "💙💙", "tiago.serenato": "natashanoel001 ✌", "khushey_soni": "Idk but i love you @natashanoel001 di ♥😘🙌🙌", "sanjanaroy276": "Thanks to share this.... Lots of love di 💕", "priyanshbairagi": "Tu layak he nhi h follow krne k ...I thought fitness post se inspire kregi but day by day bakwas chl rhi .. chee yrr", "badassvibes__": "You should do a bold on things like this which girls shy away from talking", "___aashley": "Love you", "sidguru": "@natashanoel001 hahahaha... This is so good. I am surely showing it to my wife.😂😂😂😂", "ms.allambaan": "You posts are so helpful.. a lot of people including myself are never comfortable to speak about these taboo subjects like this.. but your posts have done me soo good.. so thank you love💕", "deeptijames": "Very informative 👍 pls keep on posting such information for welfare of womanhood 😘", "sanhita_gram": "Thank you so much for the awareness. It has helped me.🙏💖", "dilipkumardash": "Wow", "aficionado_22": "You are not ugly but love to post ugly pics of your... whay kind of sickness is this.", "sachikumar": "Love this post ! It's so informative and every girl needs to read this.", "anilthomas1692": "@ajaypalsingh784 Ye dekh bhai maharani ka naya post😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁....i hope iske parents insta m ise follow nh krrhe ho😆😆😆😆😆", "miss.nonchalant.s": "OMG, thank you for this post. 🤗 I've had this problem for a very long time and I was slightly embarrassed to go to doctor. but because of another issue I visited a gynec recently and she tells me this is not as common as you can avoid talking about. So yeah it's very important to have a conversation with the doctor and talked about smallest or silliest symptoms we face during the day to day routine. you never know what it could mean medically", "rahilaskazi": "@a_dark_soul", "_erratica_": "Also avoid thongs!", "weiderindia": "you go girl!", "khris_85": "😂😂😂 You made me start the day laughing! 💯", "dev8000": "❤️❤️🔥👏👏😂😂", "enigmatico_dolor": "Thanks. I just love you!", "deepapal": "Oh My God !!!! I have had fun yet irritable days with so called THAT ITCH !! Mainly during preggo days. But no matter how pleasurable it went, went to gyno and had meds. And even now , once or twice in 3 months, I do have these episodes,I just drink plenty of water, avoid touching coz it gets more worsened. And your point 1 is do important to keep UTI ( Urinary tract infection) away !!! Had it but thankfully after my first pregnancy it vanished. So plenty of water intake is imp too", "saddam_e_khan": "gand mai khujLi hua h kya bc😀", "mukkks": "You look like Kancha Cheena, surely not an orgasm face 😂", "bharviee": "Damn I used to douche so often thinking it is the best thing . Thank you for this piece of information", "ishaapradhan": "😍", "svikrant599": "What shit u post these!!!! I mean WT happened to u?? 😕😕😕", "gharu_inder": "pagall sali", "sidhartha_singh_shekhawat": "No offense #zombie", "unicornsandglitterpoop": "This post is so helpful. Thank you❤️ I love you so much❤️ you're so, so motivational❤️", "bindushri_vijaykumar": "Thank you 💓", "riya_dola": "❤️", "shanaiya_d": "This was super helpful @natashanoel001 thanks for being so awesomeeeee l💕", "hb_sarang92": "Haahhh 🤣 so true lol 💜💜💜💜💜", "alsitomorenito": "Beautiful 💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻😘👍", "deepak.rawat.1989": "Pgla gyi ky", "rohit_rayn": "🤢 🤔🤔", "sumitkaushik21": "you a genius doctor hiding too in you @natashanoel001., you are doing a great job by spreading for a good cause :)", "poopoopoooy": "Omg Ur 🔥.....very useful information 😘", "ruchabhagat93": "Hii Natasha.. recently i started following you..your posts are amazing so you are..I lied your bio...breaking the stereotype..I have same thoughts..😊", "sharma_ira": "I don't think anyone could have put it in better words. ❤️ And the picture - can't stop laughing 😂", "syntk_ry": "Ur post ar so realistic .... U take up topics which no one talk about .....", "lust_is_my_love": "You are a crazy yet sweet person.", "mahika_rajan_07": "eat yogurt ? Google the side effects of dairy .. it’s not healthy in the long run .", "prasadsiba.94": "👍", "__alchemist_": "Genius or a psycho ?", "neethi_2p": "It's like you knew what information I should be getting today. Itch be gone!", "magic_spells4": "I recently found your account & I'm loving it!❤️ More power to you for educating the people about the topics everyone hesitates to talk about. Love ya 😘", "raj272272": "Super", "spoiled.by.style": "How do you come up with such creative ways to shoot ,I'll never know 😋😋😋😋", "cosmo_india": "Then when we have to douche if there is more discharge n swollen vagina ?", "coalstripe": "Needed this reminder", "mostly_artivist": "Thank you for this post..every girl need to know this..🙌❤️", "ayshaa986": "Natasha Mam.. U r the person I ever seen who doesn't fucken care about self talking. I appreciate and I love you so much. Wht is women's priority oh yeah human having a uterus... Only u can explain it so open. Love u honey 💞", "freezer139": "Phenomenal person you are and blessed human being with such diverse sense , learning a lot from you 🙏", "chaudharymadhu_": "I really like this post of yours.. this awareness is important 👍", "vampire.69": "👌👌👌", "kukuyoko_1610": "You're 🔥😂❤️", "livestrongolwyz": "Shakaal lage raho 😜😁", "ashok_fan_of_one8": "Funny pic", "ankita_meshram0109": "Thanks alot😘✌🙏", "shete4177": "I hope people get your point .what r u trying to say", "dreamchaseer": "Kuch bhi faltu Giri", "gillyontherock": "i had a shit day at work and just seeing ur face made my day..but oops sorry to digress from your post. it was helpful dear. Thanks love", "lavisha_garg": "Heyy Natasha.!! This is the first time m responding to your post. But i must say, i love your posts. Means the way u write these is amazing. I truly appreciate it. I just love the way you are. Keep doing this. Much love to you.♥️♥️♥️", "x_adultts_1": "ilaj krao", "terminator_tiwari": "Thank you for this post. You are love 💕", "shali_mon": "That expression.....😜😜😜😜😜", "i.am_tahirkohli": "why u cut your hairs mad", "ashlesha.official": "This is very useful info about females orgasm 🙏thankuh 4this @natashanoel001 ❤️❤️", "shreyachaudhary__": "Lol I just bought this thing two days back! That itch is fucking heavenly😍", "thebitchkitten": "Thank you so much for this! Could you also help educate people about diseases like PCOD/S, Endometriosis, Adenomysis etc etc, I really feel there’s not many people who know about these illnesses and live most of their lives in pain", "laveenabehl07": "Hi Natasha. If possible you can share some tips on how to keep our butt-crack healthy. At times there's an uneasy itch but I have no inflammation as such. I never seem to find any healthy advice on the same. Since your posts about hygeine of private body parts are so informative, I hope you find out something on the same. Thanks and much love!", "909s0": "Your Amazing 👌 Bald Look Awesome😍😍", "losobyron": "Yummy", "amiitabharat": "😘😘😘😘", "puresoul11.11": "Thank you so much for this immensely informative post.... Love ya gurl❤️", "airoholic_lover": "Stupidity", "sandeep.9t2": "👏👏", "mangesh_shete__009": "😅", "warish_ali_7151": "Pagal hai ye", "msinghc008": "ur unique 😂😂", "arts_kyu_liya": "Thankyou for the information", "dk_2596": "@wiskey_in_a_teacup read this !", "millennialgoddess1111": "Thank you for sharing this love😍 more women need to talk about this freely 😻💕💕💕 more power to you🙌", "bindiyawali": "Wow 🙏❤️😊", "gaur1952": "Body attraction", "neelam.gautam": "Useful @natashanoel001 I think I am fine till date. See if the itching is coming for me too, meanwhile will try and take precautions. Love you 🤗", "apurv_bhongade": "Natasha is a good human.", "borinchulo": "Stop doing that to your eyes Natasha, they gonna get stuck! 😁", "t.key804fs": "😂😂😂😂", "chandumens_physique": "@natashanoel001 u r day by day nd different message 😘😘🤘🤘👌👌", "stylesavitri": "Haha.. such a cool picture. Love it ♥️", "gautam.ruchika": "Man laughing stupidly ..", "mayanksharma486": "😂", "sanu.shekh": "What a funny", "dips_sable": "Thank you for keeping it real❤❤❤ you're a gem😘"}