{"surya14336": "dekho dekho is rapper to apni aukat pe utar ayi he ,stop this nonsense mam kindly do not make any fun of Hindu religion", "manavrock_agrawal": "To all fuckers who have brain in their ass.... She just animated herself in blue colour 🙄🙄", "poomathisundaram": "I feel this depicts the new modern world women with Goddess inside and adapted modernization outside.... I see this as Women being women and bold and beautiful and surviving this modern world.... Credits @therajakumari 👏🔥", "pujan_talajiya": "👎👎👎😠😡😡👊👊", "aura_jewl": "Wow, can you not? Just because you rap/are into hip hop really doesn’t make it okay for you to do this. Have some damn respect hun", "_anishajoshi_": "@joshanki", "_nidhi_549": "This is not done mam....you troll people is okay....but not god and goddesses... please delete this pic.. it's a humble request 🙏", "anand_aishwary": "Wtf is this @therajakumari are you fucking serious.", "riyasinh": "Wtf 😠😠😠😠", "cherry_kalkat": "That's nice", "y_a_s_h_182": "🙏🙏🙏💖💖💖🇮🇳🇮🇳", "sunny.2212": "Nice mata in new Avatar 🙌 for everyone who hates can left Rajkumari page and yes every women in the world have goddess because of them we are here the power of giving a birth to new life they have, Nari ek shakti hai bow down to it", "awkward_tip": "🖤", "maratha570": "ये क्या बेहुदगी है कोई और सब्जेक्ट नही मिल तुम्हे घटिया पण की भी हद होती हैं", "thesmeazy": "🔥🔥🔥", "arandom_ass": "Guys u all r bursting open on her for no Fing reason... Like do u know what godesses used to wear...every indian woman IS a goddess,in fact every woman is a goddess...u guys just have a sterotype that shes from america and she doesn't know no Hinduism...guys stop doin this for just fuk... Replies...grow up", "nononsensedefender": "@aninditaburman comments padh lo din ban jayega 🤣🤣", "sumit.pandey18": "😍😍", "priyank_biliboy": "Bc wtf is this respect our God @therajakumari", "mr._d_e_e_p____": "I m biggest fan of u mem @therajakumari but I think this is not gud ...... Hindu culture or hindu emotions k sath ... Me bahut jyada open minded hu ...Tark me belive krt hu .... Pr it's not fair mem plz do respect everyone religion feeling ..किसी की भी धार्मिक भावनाएं आहत करना ठीक नही ,, according indian constitution", "ocean_mr_ryan": "Butthurt indian nationalists coming 😂😂", "nikita_wadhawan_": "OMG!! You are my favourite 😍 i totally love this look duh😍", "drapurva_n": "I totally understand that this is your motto to promote Indian culture and hip hop but this is disrespectful. Wear whatever you want do whatever you want to do but not at the cost of hurting religious sentiments.", "_jalajchaturvedi_": "Just unfollow her n show the real place for this kind of fuvkin ppl", "viish.7": "You are just hurting a million sentiments by posting this .... If you belonged to the peaceful religion you would have got a million abuses by now. Have some shame, you shameless shithead.", "vanshmani.92": "Stopped it foolish and never ever dressed like this . This Vulgarity is not tolerated by hindus. So if you a hindu first delete all these posts and stopped all this", "riosha_kuar": "@kiki_kuar", "satyajeet653": "A dekho pata nehi kaha kaha se aa Jate he me rapper hu, mein rap mein revolution launga bol kar or India mein settle ho jate hein or A randi hamari devi par mame bana rahi he sudhar jao madam agali bar mat karna a sab faltu giri samjh mein aya Kay 🔥🔥🔥🔥", "abhi_sinngh02": "Unfollowed for this ..", "aayushisingh_03": "Mam u r looking so preety as always....Such a grt fan of urs😘", "pradeep_singh_suryavanshi": "Delete This Post Fans Ki Respect Karti Hai Aap To Nahi Unfollow Karna Padega Aapko", "phanimantrala": "Your creativity went too far.. Delete the post.. or ready to face consequences!!", "sadarpuria_honey_": "delete kr mc😠😠😠😠😠😠😠", "shiv_prabhu007": "Full trip", "pooja.fml": "So many old stereotypical asses burnt here by our one and only rap goddess @therajakumari 🔥❤🖤", "boi_with_the_smile_": "This is just an art, a beautiful art....and there is nothing wrong with this and those who r having any problem with this post then sorry to say but it's totally Ur fault coz u r imaging a deity in this form....not the maker or the one who posted this r thinking this way.....this post is simply representing the power within the modern women.", "charandeepkaur98": "Look at all of these butt hurt people 😂 relax everyone!", "naughtynitu": "Delete this post ..rundi saali..😡😡😡", "vinodmachani": "❤️❤️❤️lovely", "bhuvanshrivastava": "🔥🔥", "catta_lyst": "❤️❤️❤️", "rdrockzz": "Sab upgrade karo life western festern sab kuch.. But plz sanskriti ko mat chhedchhad karo.. Wahi ek chiz bachi he ..", "singhkartik430": "Not even your follower or fan but I really want to request you not to delete this amazing piece of art simply over some butthurt people. Let them say any random shit. It should not matter.", "ruby.pooja": "Goddess is here❤😍", "itz_b_l_a_c_k__a_n_g_e_l": "Fabulous nd jitne loag bol rhe hai na ki culture ki respect kro delete kro sale whi chutia loag jaat ko baat te hai ldkio ka rape ho to aankh bnd kr lete hai corruption krte hai or black money rkhte jitne bhi chutie hai na sale khud ko dekho pehle", "yogesh_ahdem": "It shows that you have ZERO knowledge of hindu culture...there is a huge difference being a broad minded and a matured person.", "prince_prasar": "Mam I m your fan. Plz collaborate with king.we want a song♥️", "ajithkumar46": "Dope art", "nycsheek": "@nitya_camille", "aslideepaksoni": "this is wrong❌❌❌❌❌", "blue_lion_12": "lol people getting triggered over the clothes clearly have not seen bronze murtis of goddesses", "s.anuroopa": "Idk about this", "babairkx": "Nice representation", "bulkshehulk": "Hmm its ok to alter things once in a while. But I wonder \"what if\" somebody portrayed prophet muhammad in Nikkers or Mother Mary in denim skirt doing some mordern shit. 💔 Somethings should not be touched. But again it all depends on perception. Peace .", "manojsavvy": "Lovely pic", "pawanguppi": "U should be ashamed for making fun of ur own religion... Unfollowing you", "kiran26s": "U r d best ... Haters will hate,, n how much dese bastards respect goddess,dey dont respect a woman in real life n coming here n bcoming religious gurus .. double standard people ..rajakumari is the best , this is just a pic n she nvr said in d pic dat she is portraying herself as sum diety .bcz by wearing or dressing up as a diety one wil nt bcum so . N wen one cnt bcum so den its no disrepect .", "shaggy25_": "I really appreciate your as an artist and a women. But the way you represent goddess durga is not acceptable.", "writpanda": "Shakti ki jai🔥🔥🙇🙇🙇 hail the power 🙇", "apurvaajain": "🔥🔥🔥", "watsupdoc111111": "U call names to a woman n u guys pretend to worship a goddess.. First u go n learn how to respect n talk to a lady then come n tell her.. Stop the pretend play people..let the lady do what she like.. It's just art.. If u don't like it get the fuck out of her page", "vaibhavgautam50": "ये सब बेकार की post है आप को इन सब से दूर रहना चाहीये आप एक public figure होने के साथ साथ बहुत अच्छी rapper भी है india एक religious country है मुझे नही लगता आप को इन सब मे पड़ना चाहीये क्यु की आप का नाम रानी और आप को bollywood की रानी भी बनना है और इस देश के दिल मे राज करना है देश की आवाज़ भी बनना है।।।। आगे आप की मर्जी।।। धन्यवाद @therajakumari", "mountaineer_22": "I am so enjoying the comments and getting a reality check on how people think I thought we were in 21st century, no one understand an art all people just want to take in the wrong sense", "rapper_yashu_boy": "Hard Hard Hard ❤🎵🔺", "rishirex.in": "Goddess can't be a babe .", "ke_lan_chan": "Heck yea...this is soo cool", "__the__goddess__": "I agree!! Every woman is a goddess in her own way 🔥 @ravi.mishra_india", "10cient": "❤️", "grn_11": "This is wrong... disrespectful... take down this post.", "aamirtyagix": "U r nothing sirf kuch din k fame \"🐃 buffalo..tatti artist", "caffeinatedmunchkin": "It is absolutely unbelievable that people are getting butt hurt over this. The only reason ya'll are saying God doesn't wear this is because that's the image that has been fed to you since we were kids. We were shown that Gods dress a certain way and act a certain BUT NO ONE REALLY KNOWS! So calm down tf down. Respecting someone be it a mortal or immortal being has absolutely nothing to do with what they wear. Are all of you trying to say that you would only respect people only if the dress a way you think is appropriate? Then people, we are in a lot of trouble. And don't even get me started on the whole this clothing doesn't translate into being pure and pious like a deity nonsense. She isnt pure and pious because she wears a saree she is all that and fierce as fuck because of who she is and what she did. That goes out to every god or goddess. So stop saying Mata doesn't do this or that AS IF YOU HAVE SEEN HER FOR REALS. You never have. And you never will. You can only assume so calm down.", "solhstore": "This is just pervertising something thats beyond your mental capacity to grasp.", "shubhhaammm": "If that's your depiction of yourself then there is no problem. People can believe in whatever fairytale they want to. But i hope that's not how you want to portray our goddesses as it is just so naive to thar", "_the_pavitra_papi_1444_": "tumhari jesi ladkiyo ki wajah se hamari hindu sanskriti badnaam ho rhi he kuch to saram kro @therajakumari ji", "h2modeltrainer": "😠😠😠😠😠😠", "guptaritik303": "Iss photo se apka carrier bhi end ho skta hai...", "your_secretthoughts_": "🔥🔥🔥🔥", "shreyash_sshitap": "Achhi najar hone ki jarurat he fir sab kuch achha dikhega don't blem @therajakumari", "officialdeejaysam": "This niggas yelling over clothes yet the real goddess wear wearing only saree n nothing lol 😂. All the haters need to calm your ass down. @therajakumari you’re doing it right ❤️", "kuber_sonar": "Yeah it's true every woman is goddess.", "vipoolbhanushali": "Hinduism is a religion of freedom ❤️ but sometimes we cross the limits. 🙏", "misha_nayyer": "Amazing art @therajakumari ! Shoes or not, clothes or not, it’s all in the mindset. Love the art & your live version in this! Totally Dope! 🔥", "dharmistha.h": "@therajakumari 💜💜💜💜", "ankitashah7307": "@therajakumari mam most of the people disrespect this pic but I genuinely love it and u were right every human being is a god/goddess. If they think u r not a goddess then why they guys take girls to celebrate their navratri pooja? Keep going mam wish u a luck for ur bright future ❤️. Luv uh😍", "hrajput31": "Dear @therajakumari.. I know u hv gt criticism about ur ds post. And i m also among those ppl who would not like myself or our nxt generation to worship god in this attire. Even country hs dr own dressing sense and they feel comfortable too see their god in the most traditional dress. U r part of @mtvhustle and i m sure they won't be able approve this pic in there show either. (u may ask the reason from them as they r d ppl u r more familiar with) i tried to put my thoughts in most humble wat way possible. JAI MATA DI..", "piyushbhatioo1": "😢😢😢😢😮", "resurrekt_": "Dil patthar ke hain aur humsab chalte phirte buth, khuda se dare bina khuda bane phirte khud...", "bookish_van": "Powerful🔥❤️🔥", "menaria_yash_12": "BC delete kar 😡😡😡😡😡😡😡", "1ncredible_infidel": "I Have Admired You So Much Cz Your Art Talks About Hinduism But This Has Hurted My Sentiments Towards \"Mata\" Kindly Take It Down It'll Be Highly Appreciated Pls🙏🏼", "amanelikarr": "@ravi.mishra_india u might not be an idiot but ur an As$&hole for sure u piece of shit!!!!Respect woman!!!!", "rajini2401": "7th dimensional vibes eh...!!!! 🤩", "manish_oyasco": "This is very bad @therajakumari . We Have seen Durga maa but not like this please remove this post . As a fans we don't like it that u understand hopefully thank u", "panda__love____": "@therajakumari Pls do not think about all these people.. They only show all the respect for their so called goddess only here... I am also a devotee of Maa durga but I did not feel offended.. These people say all sort of things here.. N then also abuse girls as giving them all. Sort of names", "preetyartist": "Uaaa Fucking awesome....and Uaa thinking in this pic is beyond the thinking........", "dilkhush___420": "Report kro esko😊😊😊", "thatman46": "@therajakumari sare would have be a great option instead of mini skrit! 😠", "imageofdreams": "You did a bold move Don’t regret it @therajakumari 🔥 Xoxo", "gauravkatara99": "is that disrespect to godess ...!", "sedriedanielle": "I think its amazing to see that its mostly Indian men who have an issue with this beautiful work of art. Believe it or not, its a form of self hate. How a woman values herself goes beyond culture or religion. But I can see how this might come off as intimidating for low vibrational, mortal men. ✌", "___komal___003": "@therajakumari Maam u r the best love of 1000 u r inspiring many people 😍😍😍😍😍😍", "_blackkk_01": "I love it ❤️✌️so cool.....", "djsuperdaredevil": "Jay ho Raja kumari", "rajanikrishna_": "Queen 🔥@therajakumari", "nilesh_4747": "Report this post 😡😡😠😠", "shivanii0701": "💋💋💋", "sonam.mahajan.792": "Pls delete this post though u r such a nice and talented woman but this post hurts the sentiments of many hindu community people including me ... You also hv equal respect for the same nd we know that too but this creation doesn't relate to our god our culture our religion...", "mehdisappointment": "QUEEN YOU SLAYIN' ❤️❤️", "ashantiomkar": "😍💜", "devil_1.9": "It's really wrong.. there is lots of wrong in the picture... It's disrespectful and sensitive issue", "skinnylocalmusic": "😍 wow", "mr.trish_tiktoker": "😡😡😡😡😡😡😡Delete Karto Ye post Tumhari Soch Galat Hai mata ke bare me Humari Devi Maa Aise Kapde Nhi pahan ti kuch b mat karo Famous Hone Ke Liye...😡😡😡😡😡😡😡😡", "swet_sharo": "Love the art and the power, kudos to the creativity 😮❤️", "atulyadav2312": "This cleavage is not admirable you also have a mother please don't", "kingbob_0": "Amazing this post shows how every women possess power in herself(as said ek beti agar lakshmi ho sakti hain to vo durga bhi ho sakti hain) You definetly should not take this post down ♥️ yougogirlwesupportyou", "xerxesbeatbox": "More power to you❤️", "shivi_g_1212": "Maata slaying🔥🔥😍😍✨", "eklauya": "Mentality change kro jitna yaha gyan fela Rahe ho use pahle utni respect to kro pahle . Ander Kuch or or br Kuch or", "lone_wolf_the_diablo": "❣️lovely mam 🔥", "ishagiri4": "Amazing💕🔥", "arshsngh2995": "And on the other hand she says every women is a godess", "pujad123": "❤️😘", "nakhre.waali": "Yassss", "suriyasiddharth": "Excited😍😍", "parthiagarwal": "DONT LISTEN TO OTHERS! YOU LOOK AMAZING!", "mr.svk1068": "nice🔥🔥", "ankita_gupta_09": "🔥😍", "himanshu_narayan_sagar": "@sam_madhu ye bht khtrnaak hai", "__sam_35__": "Mata wants ur location", "gingertiddies": "You really don't gotta answer to all the people who don't understand art and modernisation and open mindedness. You look gorgeous, ma was gorgeous. And nudity should be celebrated, every body is a gift from God's. Celebrate it. Modesty is a social construct", "harsh_jha428": "Bhag bhag bhag aayi sherni aayi sherni🔥", "ishakumari1056": "Yess i agrry with you .", "whitelines_": "I love your music but seriously What the hell? I thought you respect our culture.", "monkeyshanti007": "Niche jitne chutiye are asking to delete it should go and follow Baba ramdev and watch astha and Sankar channel ! 🖕.....its way beyond Ur capacity of understanding art and respecting god in any form possible ! It's a fab art ❤️", "ashritajenawho": "She's just modernizing it, no need to go all Hitler on her, duh", "khushi302002": "So many people triggered 😆", "sirsharanchakradhar": "Should I be happy or should I be angry at you ! You can only joke on the deity of us Hindus because this is the easiest work in this country!", "sankalpsharma1": "What the fuck is this bc", "akshaypatil321": "This is awesome!", "parikshetprabhakar": "To all those fucked retards who are saying this is bad. Get a life.", "saitejabasavaraju": "😞😞😞", "ashna_kaintyura": "🔥🔥🔥", "varoonkal14": "@sam_madhu @therajakumari 🔥🔥🔥🔥🔥", "directionr_bae": "Be broad and open minded but not this much!! If it hurts feelings then ya shouldn't be doin it!! Somethings are meant to be as the way it is already! Being this modern sucks!!! Respect Hindu culture and heritage!", "mad.dog.jones\nVerified": "Verified", "_mr_bittu40": "😍", "_solankivaibhav_": "😡😡😡😡😡", "horti_hor_": "Wow, the Hindu-Taliban is out in full force. Are y'all that insecure about your faith? Shakthi is a formless, faceless divine universal energy", "iamdiwakarghosh": "Beautiful❤️😍 and to those who are asking to delete the post, maa kali wears nothing except the 💀 skulls of the demons she kills...ja k padh lo khi.", "prasub22": "Unfollow", "bhartii_rajput": "🔥🔥🔥", "vishesh_rai_": "Yeah", "manishachhouhan": "Your eyes like such a radha", "_.khawaab_": "Delete this post don't disrespect ma durgaaa", "a_b._h._i": "What the fuck is wrong with you. Agar itna hi shauk hai or gand me dum hai to mohmdans ya jesus ke upar bana ke dikha", "jd_thakur_10": "really shit", "ladiosa.irinarakshina": "💜💜💜💜💜", "_rajput_dev____": "Delete it", "hahahahaaahahahhahahahahhahaha": "So sad to be a part of the illuminati.......do this do that or face the consequences 😤🤯", "thekaustubhrangari": "Dope 🔥", "arun.mehta1920": "@therajakumari mam i respect u too much, u r jabardast, but i feel hurt when i saw ur that post. I feel proud on u because in ur song u Brightened the name of the Hindustan and hindu religion. But that kind of art is fucking bad. Feel shame on u. What u want to show in this art. Humble request to u don't change the religions in modern.", "_vritikaaaa_": "Queen is slaying!!!✨🌍", "_akash_raj3": "Incoming hindu dharm rakshak 😂", "divyaac25": "😡😡😡", "nityaww": "badass!!!🔥 the goddess will be the goddess", "shivani_deshmukh_04": "😍😍👏👏", "sanatombiangom": "Lit AF 🔥", "rohan.hingorani_fanpage": "♥️❤💕💕", "balkrishan000": "🙏", "ashish_v_bhagat": "Delete it", "dynamiteblast": "😂", "sabbipbn1": "😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡 delete this post", "nick1529yl": "Please don't disrespect maa durga delete it 🥺😞😞", "swamiraz": "It's disrespecting 😡", "adirajput279": "Jay maa kalka ki bhot hard", "purnimavish29": "😍😍😍", "mahipals706": "I unfollow this page 😡 You don't know how to respect your religion😠😡", "misochichi": "🔥🔥🔥", "anmoloriginal": "Jai mata di", "imbhupindersingh": "😍 masterpiece", "nawab.khadbanda": "Wtf is this", "official_anuman": "😍😘", "killer_soni_47": "Jute nahi pehnne chahiye the", "bnsal9": "🤔", "atomicvins": "❤️💜", "_sinha_diksha_": "Bhayankar 🌋🌋", "drjagandeepsingh": "You should delete it.. don't take religion in yours hand", "rey_bash_": "I'm getting mad at this🔥", "sonasharma7034": "Phenomenal 🔥🔥🔥🔥❤️❤️❤️❤️❤️❤️", "virrla": "baddest mata of all time", "siddyzzzz_12": "Sherni 😈😈😈 #devil #kill 🔥🔥🖤🖤", "mehak_dhami": "💟💟", "01amann": "❤️❤️🔥🔥🔥", "__gully__girl___": "🔥💯", "_vibekanandarava_43": "Jai durga Maata .", "hs_himanshu_______": "Ye kesi art hai. 😠😠", "_nfrahul": "🦁🦁🦁", "bijoyaakayounge": "sick", "thekhushbuthakur": "😍🙏😘", "laysiaprincess": "This is so BOSS!!!! 👌😻💖👑", "trinadhmoganti": "Queen👏👌", "anish.nair.1614": "Amazing @therajakumari ..", "sarvanieloheimo": "Congrats queen! @sam_madhu", "suraj__609": "😘😍🥰", "akanksha_singh01": "Oohhhh mmmyyy ggggggoooodddd no words to explain the beauty of this art. Rajakumari!Daughter of the king! 🙌🏻🤘🏻", "rmayukh": "Jai Ma Kali 🙏🏻"}