{"zainabaliazhar": "Pathetic movie.", "sandeepchouhan242": "I hate this girl and his movie becoz overacting actress", "annapmmary": "Awesome one....such a bold character and which is perfectly played by dear @taapsee ❤️...", "pinaki_acharya": "What you think a man should do if a women hit her", "rajpoot_6062": "Yr aa photo ehni sexy ayi g krda kol hove ta pappi kr la...💯👌👌😂", "i_am_swastika": "❤️", "aasthaarora25": "What A MOVIE! ❤️", "karanraitani1905": "Go and watch this. @saaakcc @aastha_singh_11 ❤️ And tell your Mom, Sister & your female friends too. This has to be watched.💫", "ipsiiiiii": "Amazing work", "nagendrabsingh": "@taapsee I happen to watch Thappad this weekend along with my wife. I was so hooked up all along with so many emotions running while watching you portraying such a strong women character! After watching this movie, I started to become more conscious of all little things I should pay attention to as husband as it is so very important to keep married life happy! Can’t thank you enough for teaching us life lessons thru your act.. Thank you Taapasee! Respect 🙏", "sushil._.singhhh": "Yeh movie Jo bhi ek bar dekhega apni Puri life Mai Thappad Marne k phele 1000 bar sochega. @taapsee acting👏 @anubhavsinhaa story 👏", "krishnakushwah14810": "👌👌", "prachiahuja123": "Not okay", "izasetia_makeovers\nVerified": "Verified", "dabbabhati": "0", "yogi._.123": "Movie m roal tumne Kiya tumhe pta hona chiye ye to.....!", "amar151187": "Acting super mam, but I was sad when u took slap", "julien_victori": "😂", "i_ikramansari": "😢😢😢😢😢😢", "__vinni_k__": "Awesome story n movie was blown away by ur acting❤", "iamsoham101": "😍", "omg120175": "thapad se dar nhi lgta sahab pyaar se lagta hai", "meenakshilucky": "Her name is Amrita . #Thappad. #89.1Radio4FM. Thanks for filmy contest.Loved and Shared❤️ \"Amrita\"❤️ \"Would love to see it❤️", "07heba": "@sakshamdavesar", "mr.vats": "@richa_dewan", "piyushpatwari_official": "Jahan pyaar hota hai waha sirf pyaar hota hai Taapsee Mam, Thappad nhi💖 Pyaar me sab jayaz hai lekin Thappad nhi...", "beingaafreen": "Early reviews r damn good. Can't wait tapsee🙈", "divyasharma11554": "💕", "pandeysatyam353": "#unfollow... taapseee", "jacob_maju": "https://youtu.be/22INwuHE17c", "21nails": "@taapsee just got back from the movie. Was blown away by your controlled, subtle performance 👌🏻 And what an amazing support cast!", "arbaz_seth": "🏆🏆🏆🏆🏆🏆🏆👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👌👌👌👌👌👌👌👌👌👌👌👌👌👌💐💐💐💐💐💐💐💐✨✨✨✨✨✨✨✨✨✨✨🤝🤝🏆🏆🏆🏆🏆💯💯💯💯💃💃💃💃👍👌👌👌👌👌👑👑👑🧚‍♀️🧚‍♀️✨✨💐💐💐🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳💪💪💪💪💪💪💪💪💪🎬🎬🎬🎬🎬🎬🎬🎬🎬✍✍✍✍✍✍✍💯💯💯🏆🏆👍👌👌👌", "maniac.11": "Ab dusra gaal do film flop hone pe marengi public 🤣", "the.lost.one__": "Bs ek bat Agr yahi thappad Kisi ladke ko pade to use laughter music me de Ke Chod dete hai ku Why????", "n.maqso0d": "@mahirahkhan", "deependra_singh123": "Bass yahi baaki tha", "prerna.yadav246": "...no nai mar Sakta.. it's not \"just a slap\"...", "kapilang_xonowal": "Hi mam...you are so sweet..", "thythouthine": "@taapsee aapki movie hai to achchi hi hogi, trailer b achcha hai par jis *thappad* pr puri movie based hai wo incident party ya kisi public gathering ka na hota to behtar tha. Ab kahne ko kuch log ye bhi kah sakte hain k party me maara, itne logon ne dekha, akele ki baat hoti to aur baat thi. Isse apka subject puri tarah justified nahi hua qk jadatar is tarah domestic violence ke incidents akele me hote hai aur akele me hi daba die jate hai k kisne dekha, ye to tumhare mere bich ki baat hai, pyar me to itna hota hai. Ye *थप्पड़ * bhi akele me hi hona chahiye tha. 👏", "kusum_harsora": "I loved the trailer..Will definitely watch the movie. Domestic Violence should not be accepted right from the word go. A spark neglected burns the house", "shahjade_harshal_singh": "Thappad se dar nahi lagta Sahab pyar se lagta hai it's Dabangg movie's dialogue 😂😂😂😂", "sanketagarwal46": "@nimitakharat we are watching this togethere🤪", "dhruvjha08": "nahi bohot Badi baat hai Aur bohot badiya trailer", "ashish_dalvi": "While Shooting That Thappad reaction was real?", "_nikhilraj7": "😂", "curlybabe__": "Bilkul jayaz nhi b", "meghnavarma5610": "I don’t think I’ve ever even thought this about any movie poster...THIS IS SO POWERFUL! The poster itself gave me goosebumps! All the very best for the movie! The very fact that you have chosen to work on such a relevant topic is a victory in itself! Kudos!!", "cutecandyy08": "🔥🔥", "virenmakwanaofficial": "Faminist at top of the level", "hegde_manasa": "Awesome trailer 👌🏼", "anjana_rangan\nVerified": "Verified", "picturesque.ly": "What about bdsm?", "mukindrajshinde": "❤️", "abhinav_sangapu": "🤮🤮🤮🤮", "kaminibisht6": "I love Tapsee ma'am all movies and i know this is the blockbuster 😍😍😊", "r0hit_suguru": "So much cringe fr🤡", "ka.ran77901": "Taapse Didi you're such a disgraceful feminist ... You were very happily criticizing the thinking of makers of Kabir Singh and glorifying your way of thinking in this thappad movie ..... Hahaha you're one big idiot and disgraceful women of all time just one thappad you can make a movie of 2 hours and in judwaa 2 when Varun dhawan spanked your ass you were all ok portraying that 😂😂😂 what a hypocrite shameful piece of mind you have .... No wonder queen kangana criticizes you ... If you don't know now you know", "ankit4.0": "😂😂😂😂😂😂", "_vik_ing_ram": "Raise voices on the forced conversion of Hindu girls and forced marriage and rape in Pakistan. This is why CAA bill has been passed by modi govt. to save minorities in Pakistan/Bangladesh/Afghanistan.👍", "pazneiser": "😍❤️❤️", "bikash_suklabaidya_91": "No ...and never 🤨", "donimran1": "Favourite actress", "prettypinkclothing": "Alls fair in love and war 🙏🏽🤪", "soniyo18": "Outstanding performance 👌😘 This movie definitely help to that women who always ignores one slap.. And moving on...", "aakaash.rawat": "Don't agree with this .. love is very deep subject .. ur mom and dad love u and yes sometime they beat u as well .. on other hand if ur wife or husband slap u , it doesn't mean that they don't love u .. love is not only abut taking care pampering ,kissing etc.. most of the movies brainwashed the whole generation that love is only about these things.when u love someone u get angry on them, u feel like a family as u love ur mom and dad...( I don't mean it here , about violence ,which was due to some madness . ) Sorry mam @taapsee u need more oxygen in matter of love .. hope u get some time from worldy selfiss mumbia life and spend sometime in Himalayas so height of himalya can teach u that there is more big thing then ur ego .", "ms_.majumdar": "Great job 👌", "nitinh016": "Mam, pyar mein to log khud khushi kr lete hai, apne maa baap ko chodke chale jaate hai, duniya se naat tod lete hai, kuch to ek dusre ka katal bhi kr dete hai. I am not sure how this movie will portrays the character but i will tell you one thing In married life lot of things happen. But Kuch cheeje Thappad se jada hurt krti hai. I hope you don’t portray a negative kind of movie.", "shubham_shinde57": "U choose great scripts🙌", "alethea_soto": "Just watched manmarziyan. Y'all were fantastic. 👏", "_samar_000": "👎👎👎 chutiyapa hai", "aiman_gul94": "😔truly inspired...this shit is real 💔", "_being_aghori_2.0": "तुम जैसे वामपंथियो की मूवी पाकिस्तानी ही देखेंगे", "therealafreenrahmanatoshi": "Thank you for bringing this serious topic out and making people understand that violence ain’t okay and will never be whether it’s a slap or a punch.", "rushsush.pvt": "https://twitter.com/rushiesushie/status/1224242106463444992?s=19", "beyondsorrowsnhappiness": "yeh bilkul choti baat nahi hai. Coming from an abusive relationship, i couldn’t take a stance for myself, and thats what I regretted the most. No bad behaviour is worth tolerating.", "bushrawasta": "🔥🔥🔥", "ji_t_b": "@sunnyguptatsk jst see mam's hard work. She is trying hard to entertain us. So give her the best wishes.", "kinj17": "Amazing tag line to the movie. !!! Looking forward to this movie.", "farazaehmad": "tapsee aap ki ek boht bari khoobi hai jo aap ko pta nai or wo khobi kisi aam larki ya kisi insan mein nai ho skti", "sha.zad_ali": "Or aik flop @taapsee", "mymanmd": "Apne pitaji se bhi hisaab mang Lo thappad ka aur apni mataji se chappalo sandal sabka 😂🤣😂 bhai behen ne bhi seike honge 2-4 uska bhi hisaab mango🤣🤣", "indu_ik": "Awesome", "rohini45136": "I love ur Act Tapsee g.", "queenkaynat1": "Isse pahele iss topic ke upar aise film hua hai.... But they were not like of it... It's gonna Rock,....😍😍... Society ke niche soch Ke upar ghapaar marne aa Raha hai....", "ratneshvalanker": "I am waiting", "captain_rohit_05": "Kabir singh🤣🤣🤣😂😂😂", "deepprakashdp": "ultimate Trailer...", "apekshabacche": "The trailer was superb..waiting for this movie", "s.u.n.shine_._": "Follow @awkward_.ak to get a follow back", "beautymakeup_29": "Yaah yeah movie bhi hit jayegi like ur all films", "ps130186": "@taapsee coming with one new avatar", "donkarara": "Manamarjiyan me husband ko cheat bhi to kiya tha. Is it also we should look upto?", "laddigulshan2": "Samaaj ki soch pe tapaad👏👏👏👏", "peakyblinders015": "Can't judge trailer without full movie 🤔🤨😎ek thaphadd par poori film😜", "birendrakr.sinha": "👌👌👌👌", "_priya_raghav_": "❤️😍", "abhinavsinghvats": "Actors like you maintain people’s respect towards Bollywood by bringing out films with strong message and jaw dropping acting ❤️❤️❤️ hearts for your work ma’am.", "triyasha_rc_": "❤️", "aisha__writes": "#thappad dedicated to kabir singh🔥🙌👌😂", "vikashsingh_xn": "-ve concept", "vatsishan608": "Feminazi ka nagna nach... Aur kuch nhi", "impactlensphoto": "You are a conversation changer! 🙏🏾", "_the_psithurism_": "Awaiting🔥🔥🔥", "harshil8718": "Nice film about woman respect 👏👏👏", "jagdeepnishi": "Es", "namanguntiwar": "🤪🤪🤪🤣", "sunitasaroja": "❤️❤️", "rajkeni228": "💚❤️💙💜", "shikhar.ext": "Amazing trailer", "mrcovanbasten": "follow this page and win $$$ @tina_travel_agency", "poojadeshmukh228": "What a trailer......... !! 👏", "mypentalk": "Loved the trailer ma'am... thank you putting this immensely important thing out. ❤️🌻🤗", "iamtannawo": "@hassanz_91", "tonaved": "एक बार भी मारा है तो प्यार नहीं करता बगैर प्यार के तो जीना निभाने जैसा हो जाएगा", "manjuyadav.vns2017": "❤️", "bae_fizull": "👏👏❤", "pragaas_chugh": "Wow! So happy that such movies are made in bollywood❤️❣️🔥", "_fimisola2": "🔥", "iammehdikhan": "Dayumm 🔥", "alrykben7": "👌🏻👌🏻♥️", "amitgupta_2": "Follow me on Instagram @amitgupta_2", "rana_digvj": "This is called a befitting reply👌🏼😎😂", "ever_.unorthodox": "Agar khud ke parents thappad marein to 💖😂😁", "archisensei": "👎🏻👎🏻👎🏻🐷🐷", "stainedpixel": "Pathetic", "arhan.azmi2010": "Taapsee you are great ideal person😃", "raijaya2325": "Really proud to see this trailer and the best thing is that now it's really matters.", "iamanishachhabra": "Je baat", "record.killers10": "de kheech kar badhiya se... ek gaal bach kaise gya bc", "aakash_99_": "U deserves this for ur agenda😂", "boss__betty__blogger": "❤️❤️❤️❤️❤️❤️", "zahr.a619": "Eagerly waiting for this movie", "khushboomeher": "Proud of you❤️", "chaudhary_kamran_": "https://www.youtube.com/channel/UCNC1pPX9vSecqcBYAcGuIXA", "marketers.22": "5k insta followers for 750RS 10k insta followers for 1400RS 15k insta followers for 1900RS", "the_maven_lifestyle": "Your expressions are giving me goosebumps!!! 👏🏻", "deepu.shing.9": "Beshaq", "hdyslmlqhtny": "❤️", "joeanil29": "This could be a moral compass for country like Saudi Arabia. 😃", "_.rashii20.__": "Great Job !! ❤️❤️❤️🔥", "iamnaveed91": "super duper flop 3rd class concept", "senpriya": "This is going straight on Kabir Singh’s face!", "anjy0708": "One of the best trailers i hv ever seen , this is gonna b amazing ❤️", "ravi19653": "I will watch this movie for its message.", "sagnik_mukherjee69": "I dont understand the point of making this film. One slap between a couple who unconditionally loves each other is nothing.", "yadav_vaishnavi": "Amazing!!🔥", "_sterically_hindered_": "A relationship is made of four pillars trust , honesty , love and self respect ! p.s. the fourth being the most essential !", "meghz_37": "🔥🙌❤️", "__________3143": "Ni ni yl bhai jb mujhe maar ta hai na to bahut drd hota hai😂", "queen_of_insta10": "😍😍", "mitenderarya": "As perfect as u", "cs.niteshsingh": "❤️❤️❤️", "safeerjaffery_official": "Waiting❤️", "_____anandr_____": "Ma'am don't women slap more than guys do? I'm guessing this movie is about your retaliation.", "jord_nas": "My words spoken out loud ❤️🙏", "noorain12345khan": "Kaun Mara thappad??", "mahek_arawkarcute": "TRULY respect uh taapsee ❤️ keep making such content .. #bravegirl #thaapad hope aise movies dekh k log sudhar jaye .. all though great acting .. can't wait to see 🔥🌹", "gupta_neha205": "Loved the trailer 😊", "thevarunvats": "#boycottThappad💩💩 💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩", "mandalpooja127": "💗💗💗", "dhanu007rajpurohit": "Super duper hit.....", "priyaannnka_": "😍❤️", "_sparsh_sharmaa_": "🔥🔥", "mint.9.2": "Love u guys😘😘😘", "__e_r_r_o_r_i_s_t__": "#thappad can't just wait.... @taapsee love u ma'am😍😍😍", "sukhwinder______singh47": "😂😂thappad ? 🤔", "ayeee_shivani": "♥️", "jishan4321": "Plz follow me guys @jishan4321", "jas91185": "Respect you and your craft even more after watching this trailer", "shiva_m_reddy": "@sandeepreddy.vanga hi", "j.mitesh": "Your movie is always different and subject is very interesting,i and my family will definitely see this movie", "gs62364": "Ma’am I have seen the trailer ..I literally liked it ma’am but I simply have one question what if most of the people around u are of such way who disrespects girls then shall we take stand on single slap of the spouse?!", "parvathyprem": "Finally! Finally a movie that addresses the God forsaken \"bas itni si baat\" issue! Thank you for this one! ❤️", "shiv_choudhary": "@taapsee aap to picture bana k nikl logi.. par aapko ptaa bhi nhi hoga ki is movie k karan aur kitne ghar tutenge.. married life ko chalane k liye both husband & wife has to adjust, aise to aap bas ghar tudwayengi aur kuch nhi . U people are just encouraging divorce in our society & nothing else.. I'm not in favor of hitting a slap be it a men or women but this is not the way the society should be make aware or enlightened", "malhotra1110": "Isko dekhna.. ye thappad un logon ke muh par thappad hai jinko auraton ko thappad maarna “itni si baat” lagti hai.", "malikasrivastav27": "Superp👌🏻", "indianbanglesstore": "Check my page to buy Bangles set", "juligupta_": "Woooooooow what a trailor...its true", "mskh_": "Thank you from the bottom of my heart. Thank you for telling this story. If the film is half as good as the trailer, thank you.", "technology_solutions_official": "Ye movie zaberdast hone wali h", "tipleshamal": "Really amazing concept and good story line 👌 All the best to all #Thappad team yes I am waiting for this movie @taapsee mam you always select good story and ur performance is amazing", "innervoice2515": "Ye movie nhi dekha to kya dekha fir.. ❤️👌", "solitarywoodpecker": "Lots of blessings and good luck for this movie!!! @taapsee", "mudgalcharu": "A line to add-Kabhi Kabhi log bina thappad ke shadho se hi maar dete hai.... Sab Kuch apna invest karo and Wat u get in return is bad words.. *nahi karna chhayie tha* @taapsee hats off to u lady.... Isse", "terayarr_46": "Mam apki film or hm Na dekhe ASA. Ho ni sakta", "the_biker200": "A Gaye desh me gandh failane wale log, Bollywood is a height of hypocrisy. Why Bollywood never talk about the problems that men face due to the bloddy feminism, there are many men who get abused, or bitten but they never speak in public, there are male victims of domestic violence but shit like Bollywood would never think of making a movie on such topic, stop filling people's mind with all the toxins. #Icondemnthismovie", "nisha_human07": "Waiting for this movie 😊 #thappad #tapseepannu", "bareja0909": "Wat a subject!", "shivadi.khan": "Awsm👌 but u look like rani maam ❤️❤️", "jubayed.nabil": "2 2 3", "najimshaikh75752018": "Q logo ke ghar barbaad Kar Rahe Ho", "abhi00192": "@taapsee humne abhi iska trailer dekha or trailer ne hume bataye ek baat...jese humse jo log questions karte the ki sadi kroge hum khte the nahi ...fir bahi qus kyu? ..iska perfect ans nahi tha humre pass bus yahi tha ki sadi ko hum kicha ya chlana nahi chate majbori ho jese nahi krna pdta h kyu kre or kab tak kuch log to marte dum Tak karte h hum khte the humse na ho payega smjhana muskil hota tha ...but ab kah dege ja ke ye ek movie dekh lo ans mil jayega ..sadi k liye ek understanding hoga chiye bus.", "karshin7": "@itachiuchihaxn", "shelly_9204": "@taapsee wonderful concept n climax dialogue is EPIC 👏👏🙇‍♀️🙇‍♀️", "usha0923": "Loved the trailer.. it's simple.. thappad Mara, nai Mar satka👏👏", "singh6203": "Mai mere husband ko pakka dikhaugi movie bcz he's tell me gharelu hinsa little aam baat hai , samaz me ijat bchani jaruri hai chahe aawrat ki ghar me koi ijat rahe ya naa rahe ....", "zayn_kazmi11": "Ladki maare to kch ni aur agr ladka maare toh picture bana do #thappad", "hemal__shah": "The poster itself is so effective 👌 waiting eagerly for movie to hit the cinemas.❤️", "birandangi": "❤️", "archanagulia": "Superb!!", "shamy_c": "mza aa gya trailor dekh kr", "cyadav2": "Nyc", "vanshdeep.3": "Another acid attack movie @taapsee ?", "mahima.tripathi": "❤️✨", "theusernameavailablee": "Jhaaappppaaar", "satashree": "Fabulous! You go girl! ❤️", "kuldeeptiwari2690": "♥️♥️I known wo Mera comment dekhe gi bhi nahi mager fir bhi main ye kehna chahata hu ki tujhe mohabbat main mohabbat se jyada karta hu.es ek ehsaas ke sahare Tera didaar baar baar karta hu.tumhe apani dhadkon se bhi jyada Pyaar karta hu.my best wishes always be with you♥️♥️", "avi301983": "Mast... Must see...", "nandakumar532": "When ever the relise the movie", "preetimaheta": "Pyar me sirf pyar hi jayaz hota hai", "anuapandey": "Ur each n every movie is worth watching big fan of ur acting keep rocking👍👍", "sugamsrivastava21.05.88": "Haan bhai bas tum bhi badle mein laga do.", "thehumoristictales": "Thappad se dar nhi lagta sahab", "im_saloni03": "👌👌👌 superb trail looking forward to watch it in theaters", "hey_som_here": "She should protest about this at jnu bhaut bade baat hain", "garimabhatia17": "Kudos to you for your choice of stories 👏 it's a wonderful gift for an artist! 🤘✨", "titusingh999": "Chaye", "jacky_wacky93": "Loved it Tapsee❤️", "shankargogo": "इंतज़ार हैं....😍🙌", "srita_bisht": "@kanikaaaa___ letsss go😎", "khusshie._": "Excellent😌❤️", "surendra_rathore0001": "😍😍😍", "ga_7102": "Trailer looks absolutely brilliant will surely see , dialogues are worth thought provoking deep within #", "aarti.raj27": "Awesome trailer m.sure it ll be great movie..gud luck to u", "ft.lilmafiax": "Is taapsee getting slapped? Or is taapsee pannu slapping someone", "priyayadav1088": "👍", "broselima": "Beautiful movie", "insta_killer_ranjeet": "Im so exited mam", "shahana_abbas1": "An imaginary thappad to all toxic people like Sandeep Reddy Vanga... Shabaash Taapsee @taapsee", "_veronica._.singh_": "❤️", "raisulhsn": "❤️❤️🔥", "ashwinibhatia2610": "Taapsee ♥️👌", "sandy18481": "😍👌👌👌", "mr.uttam_nb": "Definately dekh k aani h ye movie to🤘😍 I love ur movies @taapsee", "_.shreesweta._": "Beautiful trailer, amazing acting as always 🙌🏼🔥", "2000.mehta": "I urge all of you to watch this movie ...It's a lesson for whom who are doing this ..Awsome trailor mam 🙌🙌", "sangampran": "Story Kya hai idhar?", "suryadoybanerjee": "Thappad mar kar maar dena chahiye tum aurat jaat ko.... Juto seh marna chahiye tuj jasi actress ko... Tu humesha humare juto k niche rahegi!", "saryaoo": "After Lucia se copy Kiya hai kya poster..", "prasad_kanasavi": "Congratulations 🎉 on your #hondaactiva6glaunch game win & all the best for #thappad @taapsee", "im4hit": "Taa🔥🔥see 👊👍", "viper37_": "All the very best 👍 super duper hiit honge @taapsee jii ❤️", "thestubbornevil18": "😍", "anandsingh8084": "❤️❤️❤️❤️❤️❤️", "rahulspeaks": "Awesome Trailer Mam ❤️", "tera._.baap._aaya": "Dm me to gain followers at a very cheap price", "prem_kashyap55": "👌👌", "proudly.petite_": "A tight slap to Kabir Singh", "veerusingh3340": "Kesny mara ek vare dashe to sahi", "jolly_dev_": "You go girl❤️", "hang_on_harish": "another time taapsee in a court scene", "jyotithakur_jb": "First time ever commenting on a actors post..i Love the trailer and no its not itni si baat... Well done👍", "_.itsparii": "🔥", "spryspirited": "Very relevant to the present population...who take women for granted everytime and think that women's being is directly proportional to accepting whatever and however she is being treated...", "_x.sexooo_": "🔥🔥🔥", "_nilam_n_navdhare": "Nhi ye itni si bat ho hi nahi sakti 🔥🔥🔥", "sagar_0731_": "😂😂😂😂🤬", "avanish_pratap": "My favourite star", "vijay6216": "बकवास हे", "ravinaah": "Just saw the trailer. We need more movies like this! #thappad", "pujapriya830": "Bahut acha🙌🙌", "sahil_gambler": "You look🔥", "sunandadutta934": "I'm waiting for your New upcoming movie #thappad 🔥🔥🔥🔥😇😇😇❤️❤️❤️ good wishes for your movie @taapsee Mam❤️❤️❤️", "nigam.chitra": "Love you Tapsee,❤️❤️", "donadeyy": "A correct answer to Kabir Singh perhaps 😊🤗 Go @taapsee ❤️", "preeti_jais_0919": "It's not a tiny issue ....", "binoyreal": "Mam I am a biggest fan of yours mam plz ek bar reply Kar dijiye plzz.", "shashimudaliar": "Expressions and acting...so authentic...superb..#waitingfortherelease...💖", "_sakshinyati": "Look😍", "pragyaaaaaaaaaa": "Kabir Singh : yes", "choudharyajay491": "Movie name should be \"baat ka bangad\".", "pawan_vk18": "A must watch.superb trailer😍😍", "abhiii__123": "Ek thappad ke liye itni mehnat aur itna make-up 😶😶", "__foramm__": "Yeh itni si baat nahi hai", "dp2gupta": "Hit hai", "mandeepkaur4418": "❤️❤️❤️", "moni2947": "👌", "_swetavijay": "Just saw the trailer.. this thappad will have an echo till miles ❤❤", "sonias.sharmas": "I like your all the movies mam😍😍", "bachojiramjik": "😮", "harshita_khandkar": "no no never, ye bas itni si hi baat nahi hai😠", "sonalban": "Another path breaking performance by Tapsee! Looking forward", "saurabh_lines": "❤️❤️❤️❤️", "wondergirl1020": "Ise dekhna to banta h 🙌", "memoriesofkvs": "#Education improves earning power of an individual and economy gets benefited from an educated citizen. #economics #economy #negiup #negiup_original #citizen #definition", "neh3052": "Looking forward. 😊", "superchargednavneet": "👋 bahut haaardd👋 All the best 😘", "ashokrpillai": "Look forward to it. Can't get enough of you. Super talented. Stay blessed.", "vikramrodney": "Baat toh sahi hai maar toh kisika baap nahi skata..", "liaqat.jafri": "इंसां सारी उम्र इसी गैरत की ख़ातिर लड़ता है।। दुन्या से पंगा लेता है ताक़तवर से झगड़ता है उस थप्पड़ से भारी थप्पड़ इस दुनिया में कोई नहीं।। इक थप्पड़ जो गाल से हो कर आप की रूह पे पड़ता है।।", "maira22__": "Just the topic had got my attention...looks like a MUST WATCH movie... the role you are playing in others life by putting up such opinions is appreciable... Thanks to your you and your team...for contributing in making this society look at these things from a better perspective 🤗❤️❤️", "viruhk": "Looking forward to watch this movie and glad to see you yesterday at IGI Airport 😊", "siddharthgaur4": "Trailer is too good mam and I think in end of the movie you return back to home #thappad", "anand.agnihotri.1656": "Good", "komaljmalhotra": "Eagerly waiting", "preetbaliyan07": "@rgsarkaar", "p.angdu": "Itnaaaa", "shubhamsharma3555": "Kisne maara tumhe usko pit pit k dum aaloo Bana doonga", "khanijo": "💥", "abhishek_sharma5555": "❤️❤️❤️", "saajal1210": "Ab Dusra gaal aage kar do! Shaayad saamne waale ko sharam aajaye 🤣😄😀", "atiksk_11": "Your my favourite plzz reply @taapsee", "yash.sable.123": "I'm waiting😏", "maloojalaj": "#boycottchhapaak kai jaise #boycottthappad hona chahiye", "sweeet_akanksha": "❤️", "sajid.3151": "Ye picture to dekhni hi hai chahe kuchh bhi ho jaye", "tottology": "Nice! Needed something anti-kabir singh kinda love story!!! Pyaar me thappad is ok type shit! @taapsee !", "p_r_e_m_i_u_m_accounts": "D.m me for Netflix account in low rate with warranty", "sonu_ku_das": "🔥❤️❤️❤️❤️❤️", "swati.sharma49": "Definitely dekhnii h 🤩", "amitassinger_no.1": "Bas itni si baat to ab janni hi hai @taapsee u r rock best of luck👍", "me_mrunmayii": "🔥🔥", "mrittika__3": "😮😮😮😮😮😮", "aashishbatane0079": "🔝", "bids2710": "answer to kabir singh😜", "shagun371": "Wao beautiful poster..... I ll watch it for sure", "dikumar8830": "All problem solution specialist समस्या चाहे कैसी भी हो जड़ से खत्म। बड़ी से बड़ी समस्या का समाधान। अपने मन चाहे प्यार को पाना, काम कारोबार, किया कराया, सोतन से छुटकारा, पति - पत्नी में अनबन, Family, love, inter cast marriage problem, marriage problem, husband wife dispute, black magic, Vashikaran specialist, relationship problem, any problem solution specialist Just one call change your life contact me... +91-9780450745", "shararat_unlimited": "When is it coming out? What time? @taapsee", "simple_yet_psychedelic_": "Hollywood wants to remake this using the name \"Spank\"", "viratsonkar.club25": "Is ka first look itna achaaa lg rha hai to movie kaise hogi", "ankit_chaurasia007": "This is what u deserve a big slap on your face🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳", "jaydeep14226119932018": "Taapsee aapki\"\"\" MULK \"\"\"movie Meri Fev movie me se ek hai", "kabirchauhan865": "Bas hogaya. ab?", "shweta.18sh": "Very excited to see you in this movie💖", "vishal_vn_": "Bas hogya. ab?", "tushar007.tyagi": "Femnism ko badhava doge...aadmi ko cruel dikhaoge.....is movie me.. kuch 10% aadmiyo ki wjh se baki ko badnaam kroge", "rahul_kumar74905": "Killer luke", "stark_004": "The face I make while putting jeera in hot oil.", "shubham_x_goswami": "Befitting reply 😤", "vikkysingh_its_yo_boy": "Taapsee shaadi krni hai apse ...i realy love u", "mdm.hossain.311493": "Love you taapsee", "bisht_gaurav28": "@dhyanisapi24 🥂", "sanjivani.bora": "😍♥️♥️♥️♥️", "cook_with_rashmisachan": "Wow mam...apki film ke topic sabki soch se hatkar hote hai...m huge fan of yours...so powerfull actress you r", "pragyapareek": "❤️👌", "choparaofficial": "पड़ेगा तेरे भी........दीपू का इलाज तो हो गया बस तेरा ही बाकी है तेरा भी कर देगी ये जनता 😂😂😂😂", "krvsai": "In mulk he had ur hair straightened too...", "_buried_quotes_": "Excited 👏🙌", "dilkash.n": "Agarr koi ladki thappad maare too bhii yee choti si baat hoogi🤔🤔", "_ashishdhingra_": "How many takes was done for this shot ?? 🤔💯", "chandrasekharraovanamali": "U r selection of roles simply superb tapsee. Go on👏❤️", "shayoniii": "Reminds me of something said by a renowned ‘film maker’ - Is it even love if the man can’t hit/slap his woman? I don’t believe in such love, there’s no passion no emotion", "as_anshul_official": "Trailer waiting", "runpwd": "i think this movie made for sandeep reddy vanga😂😂😂", "nehra6509": "Ye kya h..ni ni. Aisa ni ho skta", "dharamjitbhullar": "❤️👍🙌😊", "imran_khann007": "Bund par thappar", "shubhaamjoshii": "Ye film me jarur dekhunga", "askaizen": "Waiting. . . . Looking forward to all your ventures and collabs. 🙌🏼", "monish384": "🔥🔥💖", "sushilbaghel09": "This picture seems based on different concept ... will have to see this film.", "n.o.r.m.s_17": "I don't know about others. But I'm so psyched to watch this particular movie as I feel it might reflect what I'm going through right now. Also I might get answers which I'm looking for.", "ashcool24": "Tapsee I m so proud of you 👍🏻", "luvgunjan": "Beat of luck! And congratulations in advance", "dharmcool": "Jo pyar karta hai vohi fight bhi karta hai...", "tusharhiranandani\nVerified": "Verified", "itz_rohan_kashyap": "Bc ynha wife husband ko kut ti hai uspr bhi movie bnao 😒", "swapyawesome": "Sensational actress very excited for this movie❤️❤️❤️❤️", "social.marketing_105": "increase 5k insta fans for 999rs increase 10k insta fans for 1999rs increase 15k insta fans for 2999rs", "elliavrram\nVerified": "Verified", "sagaronline5": "इस थप्पड़ की गूंज सुनी तुमने राना. #thappadfirstlook", "mnainesh63": "Superb 👌💕", "arunramesh.rao": "Taapsee madam my best wishes and keep rocking with choosing as u same good script more nd more👍👍👍👍👍👍👍👍", "raunakroushan": "Hats off to your flexibility in acting ! Getting better with this new look ! Looking extremely awesome, so lets make it more awesome by watching this Pic !....🔥🔥🔥", "rsuraj_777": "Didi please aap shaheen bag pahuch jana", "givemechai": "You tell Kabir Singh! And Arjun Reddy and Sandeep Vanga Reddy!", "mrunal__1chaturvedi": "LAG RAHA HAI KABIR SINGH NE JO PREETI KO THAPPAD MAARE HAIN WAHIN SE INSPIRED HAI😭", "ajsahab": "Wtf lol kia bakwaas hai ap to blkul 3 bachoo ki maa ho", "priyagurjar444": "Mma to humesha bolti h.....thappd Mar k...😂😂k jisko pyar krte h usii ko....btao sbki mma nhi bolti kya", "ahmadjargam": "Mast", "sethi_maratha": "Old lady 😭", "vikasvermajolly": "❤️", "iii__shaikh__iii": "This film will 🔥🔥🔥🔥", "rizvan.mulla": "No", "rehma_idris_khan": "😘😘😘💕💕💕", "_kanha.dhameja_": "Zor ka jhatka hae zoro se laga", "social.marketing_101": "increase 5k insta fans for 999rs increase 10k insta fans for 1999rs increase 15k insta fans for 2999rs", "kkkijg": "Nice 👍😍👌👌", "hana_from_tunisia": "Ooooo🔥", "rehankhan14011": "❤️", "siprasingh96": "Kisi b ladki ke upr hath uthana kbhi b jayaz nhi hoskta.", "imaulikdoshi": "@taapsee the cover page is awesome 😍", "sarcastic_on_point": "😘😘", "nyr____07": "Finally you closed your eyes 👀!", "avisingh1515": ".", "inder.sagoo": "@keeratsharmasagoo_ 🤣🤣🤣", "itx_aamir_official": "💥💥💥💥Aag Laga dalo💥💥💥💥 @taapsee", "yravi820": "Is thappad ki awaaz pure hindustan ko sunaai pdni chahiye...🙏", "world_3490": "Hello, I saw your page and you have some beautiful posts !! Feel free to check out @world_3490 for some nice quotes!! I would like to see you ❤️", "ranjeettey": "Kab release ho rhi hai @tapsee_pannu7", "cheragh01": "KABIRRRR SINGH KE LIYE HAI 😂😂😂", "shivamdodtale": "@taapsee Releasing on? Putting a reminder", "binteshoaib1990_": "We eagerly waiting...tap", "shreyasartape": "Kabir Singh makers, *BURN* 😂🔥🔥", "that_happysoul": "😍😍😍😍😍", "sadi_madii": "OMG! Cant wait to watch it", "suridhii": "Wohhoooo❤️", "_4155191420_52491920": "u are admiring! ❤️", "sohiniichatterjee": "Killing it", "estie.i": "Excited for you as usual😌😌❤️❤️", "vishnu308kumar": "👏", "aakankshag1": "💘", "sachinwaliya": "Idk but i wish if you @taapsee Were my classmate i would have proposed you like million time 😅 she is desire like fire and calm like summer night", "_hemant": "One more hit @taapsee", "mislam94044": "🔥", "mustafa2020insta": "Will surely watch the movie.", "imkrishagrawal": "Seems interesting!!!🔥", "hrithik_kundra": "Hloo mam u r like ummmmmmmh😘😘😘", "tanzeem_sharief_10": "Bilkul jaayaz hai..💯💯💯 @taapsee", "its_akshu_aj": "When releasing?? Such a sensitive topic", "upasanasinghpal310820": "Sahi bat h", "sakshisharma_145": "Is this a taunt for kabir singh slapping preeti in the controversial movie🙃🙃", "pppiiiiaaa": "❤️❤️❤️❤️❤️🔥🔥", "ca_durgeshsahu1": "👌👌", "kratika.godbole": "Desperate to watch thie movie", "cuteprince_maahi20": "Taapsi ko bhi tapppd", "shrma.saurabh": "Family pack hai kya", "sushma.kaintura.716": "Wow 😎😎😬😬😍😍👏👏😏😊😊👊👊💓💓💓", "hardikkumar901": "Aray yr tapsee u r The best concept he itna acha h", "ankitkaushik02": "Your movies is just a delight to watch!!!🤘 I watched #Badla last year... And that was just 🔥🔥🔥", "jaiprakashyadav897": "Nice photo", "priyaamitjha777": "Film ko v yhi padega...", "prm8724": "Definitely a flop", "varun.arian": "Anubhav Sinha is on fire..... never expected a person who made Cash , Tathastu, RA 1 to make thought provoking films like Mulk, Article 51 and now Thappad @taapsee @anubhavsinhaa why where were you hiding your brilliance earlier ?", "comedy_union_": "🔥🔥🔥🔥🔥", "shubham_since99": "Amazing look!❤️❤️🔥🔥", "atulsharma2018": "GREAT 😍 😍", "dynamic_vj": "Only by the first look I am intrigued👏 waiting for another beautiful experience @taapsee", "anuj_d_grt": "To kya 1 thappad se pyaar khatam ho jaega?", "smitdesai19": "Nice", "sarahahaha____": "❤️", "panditvicky93": "❤️", "_.aryanjoshi": "@sai_somnath_420", "lionbhupinder": "Beautiful Taapsee", "wiseseaweeed": "CAN'T WAIT", "baba_macky": "This film will have a very strong content .. looking forward to it🔥🔥🔥🔥.. thought provoking poster.. 😘😘😘.. such films really deserves to be made.. kudos to Taapsee and the director of MULK & ARTICLE 15 - Anubhav Sinha 💯💯💯💯💯", "hirensakhareliya": "❤️💫", "imanshul": "Why do i feel like its a response to Kabir Singh @taapsee", "barsha_world_cutiepie": "Always waitin fr ur movies😘😘", "smiwhatsmiwho": "Uff baba.... This is❤️", "srbhve10": "Sakal k expression k hisab se gaal pr ungliyon k nishan ki kami reh gye .... 😵", "rj_pulkitafc": "first day first shw", "yougotmerollin": "She is so underrated!!! Nepotism at it’s peak!!!", "neha.raj7548": "@taapsee mam kab release hoge ??", "dsouzacressy": "\" From Judah, Nahson the son of Amminadab, Num 1:7👑", "aajaosare": "Superb reaction", "pallavi_nisha": "Looks awesome", "shivampalofficial_": "Love u 😍😍😍", "surajdewangan444": "Agar jayaz hai to dono taraf se hi honi Chahiye..👏", "mehuljshahlic1": "@taapsee when it Thappad will release?", "pankajdongre009": "🔥", "maham_iqbalxd": "Hi Taapsee ma'am Aapki Mera Naam Rihaana Movie bht Nice Thi Uss mai Aapki Fights Bht Achi thi", "ancurkumar": "Wow...💛💛💛", "mahesh_bhusal_07": "Wow🔥😍🇳🇵", "vipin_i_am": "I am a fan of yours.. one of the best actresses the bollywood has right now.. will this one for sure..", "mrsbrijesh": "Thappad bas itni si bat ni h.bht bdi bat h life se judi.i relise", "subbu_nandi": "Any physical assualt is not acceptable.But it is valid for women also.man & woman are equal.", "anmol_2401": "🔥🔥🔥💯💯", "sheela__devi": "❤️", "madme0202": "All the best @taapsee ! Was eagerly waiting to watch your next one! Hoping it rocks box office💝", "gurjot.s.kaler\nVerified": "Verified", "aashish.bhatt29": "kab hogi relese", "hariharansukhil": "❤️❤️❤️🔥", "monikasingh3117": "😍😍", "anu_podo_bamang": "🙏🙏🙏....bass yeh he reh gaya tha thappad???? Muje nhi lgta pyaaar mn yeh tek h", "pramitheus": "Guess who's not gonna watch this movie? Sandeep Reddy Vanga. Because for him thappad is an act of love.", "akii__akii": "Frirstlook is superb😍👍", "intelguy9": "A true patriot will never watch her movies", "_snowbubble_": "💯💯💯💯💯💯😍😍😍😍", "biswa.roop": "This is Kabir Singh from Preeti's Perspective 😂", "ansariparwejansari": "👌🔥🔥", "sagarsharma8498": "jab tak tum jaisi actress bollywood me hai tab tak pura bollywood deshdrohi activities krta rhaega ye thappad tumhe jad dena chahiye taki thodi akal aa jaye", "_dream_explorer_______": "You are my role model @taapsee keep inspiring us. Excited for this one.love you", "itsgurum": "@taapsee Sare Desh Bhakt is movie ko boycott kare... Ye Tukde tukde gang ke sath khadithi...", "indyyy033": "Keep inspiring✔️", "pii_tkur_": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "atikafarooqui1": "Ahaaaa ... lots and lots of love 💕 @taapsee badhiya kaam karti rahiye. Proud of you", "sujhandasmyname": "@kabirsinghmovie @shahidkapoor", "jaineil84": "Good luck for this movie sweet @taapsee", "e.gnaneswar098": "❤️❤️❤️❤️❤️❤️❤️❤️", "its_shubhsaini": "Great. 👌 Waiting 🔥", "rakesh.lakhotia.9": "Taapsee always surprise us,how?", "ishak4864": "Thappad ki jhalak hai ki anal vala reaction hai😄", "bdllhkhldlrjny": "So beautiful 😍😘", "the_abhishek_007": "Lit ❣️", "being_abhishekcool": "🙌🙌🙌🙌🙌", "prachicalley": "Good to know that all small and big Topics hidden that ppl never discuss even are getting a platform and a voice in Indian Cinema don't call me feminist but in our society at 2020 we need to make an Echo to these Voices. On a note ~ Prepping up for Generation next. 🙌", "hemantkumarrocks": "achi movie lag rhi hai", "sarabprit": "Bilkul nai", "sandeepsahu777": "Pakka ye BJP ka thappat hoga 😂", "yogesh__7": "Pyaar me bas pyaar hi jayaj hai uske alawa kuch nahi @taapsee", "emaannaima": "You rock maam you just awesome and your movie selection is just too good love you", "nazreenshaik": "❤️ dekhneki b zarurat Nahi.. already hit hi mere liye ❤️ love u taapsi", "aradhaygupta": "Can't wait 💕", "livingasvagabond": "Looking forward to the release of another fantastic film on a burning question!", "rk_official_0": "kitni cute lg ri hn.. tapseeeeee ma'am💕💕💕💕💕🤘👌🔥🔥🔥🔥🔥", "sumitt3000": "Kabir Singh ko wrong prove karne ke liye movie hi bana diya... sahi hai..", "akash_jn": "apki koi picture miss nahe karte to ye kaise kar denge ye to jarur jayenge", "pradeepgpremi": "You are my favourite actor", "manodoll7814": "❤️❤️", "vishal.shrivastava.75873": "👍", "jasmineahujsharma": "Thappad is opposite of Kabir singh", "ramaanwarf143": "🖤🖤🤩🤩", "razakhan2.0": "😲😲superb mam", "lunawatgaurav": "Waiting for this movie..", "vikash.agrahari.988": "Sach me dekhna hi pdega👌", "n_jayee10": "Wooowwww .... Phir ek naya jhatka ... Excited for this movie 😍😍🤘🤘🤘", "kavish_bedi": "Release date please.. yeh toh dekhni padegi 😍😍", "rajkrauniyar": "😢", "manovarchaudhary": "Hi", "parvezalam6792": "Kab arahi hai tappu", "ritesh19784": "Hiiiii", "amanloach1995": "😍😍👌👌 every time we got to film of your", "mrr_vikash": "😍😍😍", "tarit_me": "Release it soon🔥", "pri_dee_": "Looking forward!! TIFF? ;)", "lokhande_saaab": "Bas promotion ke liye jnu mat chale jana...😁", "ta.nu4796": "😍👏😍", "singhbintubintukumar": "👌👍😊🍺🍸", "thisisravishekharsingh": "Asse kese thappad maar raha hai koi naam bata dena bas", "winterfrost88": "Wowww so many movies of urs... Non stop!! 👍👍", "satishbooraa44": "😍", "laeeqhimself": "Unstoppable 👏 @taapsee", "anotherbestworld": "🌸We provide genuine services dm us to grow your page/profile 🌸📩👍", "rheachopra_": "Picture pr picture krti rho madam aap...aur hum dekhte rhengae....", "chhabravishwas": "I think this film has a strong content so pls watch it I too go for it❤️😍👍", "lahulkar": "Is thappad ka shor kitna hoga???", "dhakansboutique": "no it's not a small thing. and it's never justified.", "asmahkhadka": "Will be waiting....so eager!!", "mandy_bhullar001": "Aggey 10 saal tk logo ki shadiaa nh chl rhi divorce hui ja rh ha yh subject lakr or duration kam krdo ... Koi ese subject mai lekr aao k shadibor relation kese bchay na ki ghr brbaad krne vale subject dikhao ... Vse b ik survey k mutabik 80percnt mard peet tey ha biwo sy na ki auratey ...", "ssmritisingh": "Pls 12 bje release kr dijiye... can't wait❤️", "babitav1989": "I lyk to many movies which u hv acted lyk kanchana,judwaa 2, pink Bt manmarziyan is my fav I saw thousands of times but I'm not over it ur way if talking those straight forward lines especially dat one (ha dragon h me Tera khoka jalana h) I loved it.", "itsa_aditya_": "Pyarr mein sb jayaz B's ijjat nhi", "name_is_gaurav_": "Desh se pyaar karo sabhi movie hit hongi 🙏", "aditikule": "🔥🔥", "thelastmughal": "Powerful", "chnaveen89": "❤️", "solo.rider7042": "Impressive poster", "handcraftkurtis": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "ansarisanvaj": "Hii", "pratyush_24": "Sounds like a counter to the makers of Arjun Reddy/Kabir/adithya", "sameer_markande": "इस थप्पड की गुंज चारोऔर सुनाई देगी full hit", "ishika.barui": "❤️❤️❤️❤️", "deemapasoria": "🔥💥", "sky21290": "Wow wanting for your excellent moves again after bulls eye👏👏", "aparnasingh.baghel": "You are very talented mam ..we love you so much❤️❤️", "priyashah": "🔥🔥🔥🔥", "sauravkumar73520": "Love u dear", "avinashvp": "It's it ok to slap a guy?", "prajapat.varun": "Taapsee ma'am ki hr movie mujhe achhi lagti hai love you ma'am", "shruti__5621": "Waiting❤️", "awwwkanksha": "Just a tight slap to Kabir Singh! Kudos.", "chandansrivastav123": "Tapsee ji aap ne saabit kar diya ki actresses bhi apne kandho pr filme chala sakti hain, u r a lady #bigB", "rajesh7288kumar": "Ye thappad pada ya kuch or 😇😇", "tinababy143": "Mam app bhot achi movies banti ho 😍😍", "jaihind280": "Tukde tukde gang movie.", "sh_iv795": "Hii", "abraham.aju": "The poster is just awesome.. image is so in sync with the name of the movie.. excellent.. awaiting to see the trailer tomorrow", "sreku10": "@taapsee Your replay to the reporter was nice at that language delivery👍", "i_am_sandhu_824": "Baba trakee bakhsha👍👍", "mohittiwari.official": "Intzar rehta h apki movie ka @taapsee ❤️❤️🙏", "i.am_aami": "@taapsee Releasing date pls???", "theofficialparmarlionheart": "😍😍😍😍", "niidddhhhhiiiii___siinggghh7__": "Jo kahe k ye thappad jayaz hai, unse kehna k ye pyaar to door ki baat hai.. Unka rishta bhi najayaz hai 👍", "frozan.se": "Love every movie of you and im sure this one will be awesome too❤️", "bhupeshgangurdephotography": "Hum bhi tumhari filme dekhne jate hai aur hum nhi chahte ki tum deshdrohiyo ke sath jake khadi raho. Aur btw hamari tadad jada hai jo ki desh ko ek rakhna chahte hai. leftists se bahot jada, pure india me . To tumhari filmo ko humari wajah se jada fayda hota hai. Na ki JNU students se. Jhuthe students jinke pass movie dekhne keliye 200-300rs ka ticket kharidne keliye paise hai aur hostel fees 300 per month dene keliye ye garib ho jate hai", "4n15h_": "Kitni film aa rahi hai ye saal?", "royal_jat_bhaichara": "👌👌👌👌👌", "dixitnirali": "koi aur naam nai milla?", "ekvillain1511": "Aapko thappad se darr lagta hain ya pyaar se 😍😍", "knight_devil30": "Mam your acting is so good so I will see this picture@taapsee", "ava_dips": "Excited🙌🙌", "itshaadeel": "🔥", "official_sher424": "I'm big fan of your smile.. 🔥🔥", "dineshchasha": "Chinta mat Kar Tera picture flop hoga", "saronibhattacharyya": "Yes!! Can’t wait to watch! No domestic partner should slap their partner ever!!! Ever. Never.", "vipultyagi003": "Movie to shi h but promotion krne sahin baag ya jnu jarur jana.", "rajrathod1998": "Aap To Computer se bhi acchi Mutitasker ho....Kitni Movies Karogi aur wo bhi Dhaansu!!!😍 @taapsee .#computerengineering #electricalengineering 😍", "esha.khaan302": "❤️❤️❤️❤️", "eyegauriii": "❤️", "deepak3210jangidd": "Nhi bilkul nhi... @taapsee 👏👏👏👏😍love to see such issues in mainstream.... All the best 🔥", "mahaveer.r211": "Bycott tapsu", "dimpi23ami": "Hindi movies nhi kiya kro sb ko hindi smjh nhi aati... Apko pehle pasand krti thi mai but jab aapne hindi ka insult kiya tb se aap acchi nhi lgti.", "janhawi_cp": "Waiting eagerly❤️", "indiansensation5": "Best appearance by best actress❤️🇮🇳👌🙌", "deep_ak_shah": "I can literally feel the slap and its pain", "prakkash_114": "❤️❤️❤️❤️❤️", "jasmine.dsouza.948011": "Everything is fair in love n war.😂", "mrigank4740": "Tapsi ki movie hai to jarur kucch khas hi hoga", "ra_1886": "Stunning and Dashing❤️", "tabrez19": "Kabeer singh ki maane to jayaz hai....", "yogeshjoshi005": "@taapsee I like this concept. I am big fan of your's. Your every movies gives a message to society. I will definitely watch this also...", "imkumar.sandy": "Yar seriously tumhare jo film k story line hoti bhut unique hote h.. Or sochne pe majboor karti h ki ye shi me shi h... Waiting.. I personally think pyar ye toh bilkul hi jayaz nhi h voh chahe admi ho ya aurat.. All deserve to equal rights.. Hats off u do such amazing movies...", "nikkireddi": "@reddymithila gotta watch this", "raviprakash_45": "Is it good story?", "nilu_sehgal": "Never missed a single movie of urs 💝💝keep rocking 😍love u", "dhungelprabin": "@taapsee ma`am back with a bang! This film should be pretty much mind boggling and intense", "leodsilva1983": "U looks ravishing..all the best", "patil_bhagyashri_23": "🔥🔥", "gajgeet": "👋 Thappad 👍 🌟🌟🎶👏👏", "sf_writes__official": "👏👏", "innocent_princess_nahrin": "🔥🔥🔥🔥", "anushav1905": "I m trying to arrange money for my dad's treatment...... Please visit link in my bio.... Link has all details..... My dad is suffering from Liver cirrosis (non alcoholic Auto immune) and needs Liver transplantation... Even a small amount will help 🙏🙏", "madhvi_5493": "👌🏻👌🏻👌🏻👍🏻👍🏻👍🏻", "mukeshbalutia": "Toothpaste ads be like : Kya aapke daanto main jhanjhanahat hai ?", "saameer_b_gandhi": "Is gunj ki gunj sunai degi?", "prakash.mahto__": "@taapsee k movie k alag he maze h😍", "chaudhary_amris": "Yess.... A new surprise for us.... With A perfect & mind blowing performance.... U r my rock 👍", "rajvikas81": "Waiting for movie release 🍿🍿🍿🍿🍿🍿", "kuldiphetal": "❤️", "tamil_aunty_123": "Niec pic❤️", "shivanshshukla99": "👌👌👌👌👌👌👌👌", "amr1ta.t": "What a poster 👌", "labdechetan": "😍😍😍", "bitter_marshmallow": "Waiting waiting because bas itni si baat nahi hai, jayaz nahi hai. Period. 🙌", "gorav.deswal": "See your face very bad", "thshar3679": "❤️😍👍🎞️🙌🙌🙌", "virml_singh": "😍😍😍", "aasifmahi01": "Hope the best film", "supreme_4_real": "Bas tittle dekh ke film dekhne ka mann karne laga.", "vijay_421": "nhi dekhnaa iski movie...jo desh ke sath nhi me unke sath....nhi...", "mansoor__music": "🎉🎉🎉🎉🎉👍Good luck", "rohitrocks760": "Ur my favorite actress of this generation", "aayush.preet_": "🙌 awesome", "thefilmyofficial": "😍😍😍", "yixhinee": "Can’t wait to watch ur movie. I watched most of ur movie. I am one of ur fans from Philippines 🇵🇭❤️❤️❤️", "even.saints": "Legend who did that 🎊", "dhinesh_nd": "😍", "varsha_bobbili": "Whaaaooowwwww 👏", "elvish_logan786": "😃", "vishal.nayak.3990": "Actress with real act", "p_kaushik_ji": "😂😂😂", "idsux1": "Sequel will be called Mukka.", "ms_ssm_95": "I need to know how you are in so many movies coming out at the same time. It is amazing work ethic? Is it coincidence? Or are you just amazing? Lol congratulations on such an awesome career.", "findamarok": "Wooooow, Kya baat hai , एक झलक में बहुत कुछ।", "_ritikkk007": "❤️🔥", "alcologist": "I thought kisi ko thappad mara hoga", "sanober_kashmiri": "You look so glamorous being slapped... If it was me... I would have made 5 faces before being slapped😅😅", "nanojpandey": "Gret actres", "alokikmittal": "Best ❤❤", "sasskarinaari": "Looking forward to see this movie.. Great to see mainstream cinema addressing the issue of voilence against women 👏👏👏", "raj_____tiwari": "🔥🔥🔥", "shovana.bajracharya": "No. It's never \"itni si baat\".", "lollylit": "Ek baar pyaar ka thappad laga tha... Abhi tak dard ho raha hai.... 😅", "rautshubham1997": "Looks like a reply to THAT thappad from Kabir Singh! Especially the caption😅", "sanchita2554": "@ankita_das997", "sumitrashresthasumitra": "Big fan of you @taapsee 💕💕💕💕", "_alps03_": "Atleast thats what @kabirsinghmovie promotes right, that pyaar me thappad jyaz hai! Lets see the different perspective this movie has to put forward!", "soumiabenmoulai": "😍😍", "dhrub12345": "Mera 'bas itna sa khawb hain'. (Thappad laganeka .minimum ek thappad. ) is it possible? 😂", "kratikamishra.023": "Promotion krne jnu jaogi ya shaheen bagh 😂😂😂😂😂", "chandan.soni26": "Bilkul nhi", "geo.varampath": "All the best team 👍😊🙌", "yashpredictz": "@mind.if.i arey... Me vanga gurinchi cinema teesesaaru", "neetadasschowdhury": "👏👏", "cinnamongirl55": "Literally a thappad on Kabir Singh's thappad scene lol", "nishuda25": "What a makeover of your face ?? In some of your movies you look like a young 20 year old girl and in some of the movies like Saand Ki Aankh you look like an aged woman. This makeover i believe not only through the make up but it's your ability to think from the character's view and perform........ Needless to say you are one of the best character artist found in Indian Cinema may be after Smita Patil ji !!!!!!", "angestylish": "❤️❤️❤️❤️❤️❤️", "writingerotica": "To turn on your partner share my poetries❤️🔥", "rajshubham91": "Looking extra beautiful @taapsee", "anas_g994": "❤️❤️❤️", "ojasvita_alchemist": "What a perfect expression, it would have been really difficult to get this clicked right?", "its.akku.7": "Excited", "vivekrkt": "Bilkul jayaz nahi", "rama_7424": "Incredible LOok...😉😉😘😘👍👍", "chand0795": "❤️❤️❤️", "_kishor_mahida_46": "👍", "ymg_yatendra_m_goyal": "Let me guess... It's based on domestic violence...", "sumit.pandey.967": "First look is impressive", "imaadityasharma": "Wait for trailer👌", "bornhypershiv": "My all tym favorite #tapsee❤️👏", "umashankarsaini24gmail.com2": "❤️❤️🔥🔥", "bhavika_bodani": "Want to watch ds movie", "amithooda__": "@taapsee Waiting for this movie ❤️", "mahesh_coolz": "♥", "yousuf_rahimi_": "😍😍😍❤️❤️", "rashmeetkhora": "Every movie of yours is worth watching Taapsee.Just love your choice of work and so realistic acting.Inspiring❤️ @taapsee", "adiiiiiiiiii18": "Cant wait for it.So excited!!!!💕💐", "no.thing3220": "🤣🤣🤣", "kamrunkamal": "I can’t wait to see it. Too many times us women gets battered and we stay quiet", "tanujvashishth": "Waiting for it triler online.....", "princed303": "This will be again milestone movie for bollywood thanks @anubhavsinhaa @taapsee 👍👍👍 Best of luck", "smarty_ak1": "Nixxee 👍।।", "3b3b3kavy": "Aisa lag hai...jaise jnu wali dhulai ...pichhware me par rhi ho...kyu babe", "alfat_r_patni": "Poster aisa h, Socho trailer kesa hoga 😍", "jaysharma199053": "this movie will b blockbuster like all your movies 😍❤️", "saru7318": "👍👍All da very best taapsee", "sama_nikan": "💓👏", "vicky.bhutani": "❤️❤️❤️❤️", "harpreet.parhar": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥👏👏👏😍😍😍😍😍😍", "_.sw_a_ti._": "💗💗💗💗💗💗💗💗💗💗", "gangwar8855": "Tum to CAA ke protest me shamil hue the desh ke khilaf.", "jay_tahiliani": "Release date please @taapsee", "swetasingh2560": "Excitement 😍🔥", "shukla.raghunath.7": "OK cool thanks for your kind words", "ananyag8": "🔥🔥🔥 @taapsee 😍", "krupal99726": "rubbish acting @taapsee", "ibrahim_abl1": "Aged laag rahe aap 😇 but still love you❣️", "aniket.4": "Iss thappad ki gunj aapko national award tak sunai degi @taapsee", "bearfoot_nikhil": "I don't know.... It's not relate to many people.... Instead of you (Putting Boy in first look) having that Thappad...... More relatable 😋😂😅", "grumpy_aurat": "Its just that i can't stand the picture of you being slapped... But waiting for the release! Waiting for a good performance! Your amazing! ❤️", "ishtdev_pandey": "जरूर देखेंगे।।।", "taur_randhawa": "Poster🔥🔥🔥🔥🔥", "aimanminal_my_heart": "😍😍", "lanatiger79": "😢❤️❤️❤️👏", "kashifa.kms": "😅😅😅😅😅", "cgpriyadarshi03": "Excited!!", "sonam_a02": "❤️❤️", "vikram_jangidd": "Yeh movie dekhne bhi jayaz hai. 😍😍🔥", "x_jess.ox": "Follow me to see dirty pics 😍", "samraat005": "Mam I m ur biggest fan mai apki har movie dekhta hun apki movie or acting ki bat hi kch or h", "antaramukherjee69203": "😍", "sirivurisaikumargmail.com4": "👍👍👍", "saxenajikiladki": "Movie title👏👏 amazing❤️", "chaudhary_abhi007": "Full support mam🙋‍♂️😍", "varun_m_bhat_84": "👌😍", "liftimelove12342020": "😍", "radhagupta190795": "No..", "a.j.i.t.h__b.r.a.d.l.y": "🔥", "shivathakur007": "Dekhna pdega kisne kisko mara 👐", "junais_junu1": "💙💙💚💚", "mit007j": "😍 definitely..! One of my favorite #tapseepannu", "manc_kalsait": "🔥🔥", "rahul.kumar19412": "Kb release hogi.. ye movie taapsee pannu ji😍😍😍😍", "arunasish": "🤩🤩", "anvi_vaishnavi": "FOLLOWERS AT CHEAPEST RATES DM 👀", "gauravshanuroy": "This girl is female version of Aayushmaan khurana..", "dwinedj": "❤️ looking so amazing in new poster", "akpavan": "🔥🔥🔥🔥", "ashishkrishna_pendse.nef": "BTS of the Shot please", "prateekkagyan": "Kabir singh ~ to kya m job chhod du?", "rubyps0501": "Waiting💯👌🔥", "adityabirlamusic": "So much aggrevated yoh got! Made a movie out of it!", "dimple__77": "Whattee poster 🔥😍", "shabdonkepankh": "Such an impacting picture", "__.jatt.___": "😍😍", "_kajal_2_": "Why your all movies are u so good that i force myself to watch😢", "blossom24166": "Reminds me of chhapak ! Don't know y ?", "sandfallingthroughthefingers": "Chutiya topic hai... Thappad jayas hai ya nahi wo ladki khud decide karegi na.. No offense to performers..", "sheenthomasm": "So looking forward to seeing this one ✨", "raosumityadav": "Ye baat dilli tk jayegi 😂 #Dilwale", "rawallalita6": "No", "anjul_asawa07": "🔥🔥😍", "rajbhai7440": "Taapsee bole to Thappad", "shukla_umashanker": "🔥🔥🔥❤️😍😍😍😍Love you", "_ajeetsingh__": "Dilruba 💃+ rocket 🚀+ shabash 🏏+ thappad👐 = talented girl taapsee 💓 @taapsee 🇮🇳", "thevedankgwari": "Tu ladko ki jindagi jeher bana ke he manegi na? 😂🤣🤣🤣🤣", "kumarijyoti123456u": "nice one", "__mr____manhas": "Do aur lagao meri taraf se", "uamritesh": "Trailer kb?", "surendra.shandilya.39": "❤️", "rupesh10_": "You are real legend 💓💓💓💓💓 @taapsee", "aminadvani786": "Aap ne bollywood main Bohot Accha name bana liya", "shivanisuchak": "@anmolsuchak", "iam.mosaraf": "Woh wow wow wow..... 👌👌👌I am waiting this movie... To watching..... 😍", "rintin93": "@lalludada", "bushrasiddiqui53": "Nhi", "dbarkalle": "🙏", "swap_vernekar": "Looks promising❤️", "capt_jaideep": "Good Luck all the cast and crew !", "deepakumari0085": "💖", "varsha_mun": "Waiting for it🔥🔥🔥🔥🔥🔥🔥", "kdrathour": "No", "sagarmalvaniya": "❤️❤️❤️❤️❤️❤️❤️", "rubul.hussain.7399": "🔥🔥", "kaafi.sanskari_": "@ya_ku_m", "anjalidagar7": "Mast mam 😊", "manali_21789": "Waiting♥️", "_karishma18_": "not just a beauty face..but most versatile actor..who challenges the norms...(female actor can't carry the movie) her acting..and attitude towards challenging roles..is on next level..all the best..and yes definaltely going to watch this movie..", "sovg68": "🔥", "sin_abhi_": "Zor ka lga", "poojasaprabud": "hii tapsee love u....plz ...plz plz rply", "anu.sharma.9210256": "U", "mohan_r_thakuri": "Now @taapsee ke attention seeking haters be like #thappad se darr lagta hain sahab ! 😂 👍", "mkhandelwal423": "I am always see your all movies, this one also will be see❤️", "sanjeev_akashh": "Taapsee mam you are good . apki acting bhut achhi hai best of luck 👍", "amature_picart": "😍😍😍🔥", "_tauhid_sheikh_": "iss thappad ki goonz delhi tk sunaee degi... hope for the best", "mohapatra.sukumar": "@taapsee ..the producers and the director have identified themselves with their mother's name in the poster...hmmm....", "sharayusaigal": "Interesting! Looking forward!", "rawat_shab4029": "Thappd ki ghunj dur dur tk jaayegi 😂 🤗❤️", "armaanpatel": "Gorgeous 😘❤️", "krrushna13": "@taapsee U have made such high standards for ur films by selecting such creative/involving stories nd representations, that all ur movies are must watch fr me", "klpuneet79": "❤️❤️❤️❤️❤️❤️❤️", "manishakumarjaiswal": "📸❤️", "prasanthivattikuti": "You are stunning...", "anilu805": "@taapsee good looking poster...Kabir Singh has set wrong message....hope your movie is exemplary...all the best👍🏼", "aditya52_official": "😍😍😍👌👌👌", "poudel.rishav": "My fvrt actrees ever ❤️❤️.।। Tapsee pannu plzz reply me.।।।। I just seen u on haridwar ❤️❤️❤️@taapsee"}