{"vibssharelove": "Great job good movie❤️", "meherchikku_1": "Really love it ma'am 😍😍 bahut rulaaya 😕 best movie ever ma'am also love the song ek tukda dhoop ka 😘😘", "aasifask8": "😍😍💕❤😘🌹", "esmahanimciik": "Thappad 👍🏽", "sharon_mylabathula": "Amazing 😍 movie n ur acting", "kiranpatel2290": "Nice click", "_the_psithurism_": "💗💗💗", "chacharlee": "It was amazing movie but i think the real slaping (if it is true) was not necessary because they are actors and that is what they do act. So what next time they want to portray a rape they going to show really how a woman can be rape? this makes no sense.", "shalinisrivastava54": "HELLO Maam, I had always admired your work and appreciated your phenomenal talent. But after watching 'Thappad' Movie couldnt ctrl myself and had to write this for d very first time for an actress. You have played the character so gracefully and convincing that it touched my heart n soul deeply. I feel so connected and within a week watched this movie 3 times. THANK GOD I coukd watch it as it released before COVID.Sorry .I cudnt make it in theatre coz of some personal reasons. BIG THANK TO Prime video for making it available for us. KEEP THE GOOD WORK GOING. HATS OFF TO YOUR IMMENSE TALENT. 🥰", "vijaybharad": "Watched Thappad yet again. Thoroughly enjoyed your performance @taapsee love the way you carry those roles. Keep them coming", "manatoshm": "The movie was intense & so was your acting. I hope we keep on getting such brilliance from you in future. Thank you for giving us such a realistic natural approach.", "hitu_1610": "❤️", "nayanika_ar": "The movie is truly amazing ❤️", "komal_440": "👌👌👌👌👌", "jgjeeyo": "The best movie I have seen in a while! Hats off to the writers for such amazing dialogues and to the actors for such brilliant execution! Your performance was so subtle and absolutely perfect! So powerful! Keep rocking girl! ✊🏼💪🏼🙏🏼😘", "mann_cherrie": "Waaaaao what aa movie that was omg 🔥🔥 @taapsee", "khurana_akhilesh": "Just saw Thapaad and I'm totally awestruck by your performance !! Take a bow !! Brilliant messaging, superb screenplay and an absolute cracker of those dialogue delivery.. seriously no more words to explain.. just a big THANK YOU for this film !", "falakkhurmi": "Amazing movie! Very touching. Good work @taapsee!! As always. ❤️🔥", "_bharti_rai": "Really very nice movie i cryed alot the move ❤️❤️❤️😭😭😭😭😭😭😭😭 heart touching movie mam just now i complete watching movie really i loved itt😭😭😭😭😍😊😊 @pavailgulati ❤️ outstanding acting sir love u .The last song i loved it reaaly best movie 😭😭 tooth ke hum bikari .last part😭😭😭😭😭😭", "poonam358": "Watched it.. @taapsee Thank you for doing this movie 😊💕💕", "urvashi_bj": "Awesome movie mam not only this movie all of your movies are very close to my heart your roll and your in movie are fabulous I can't explain in words ❤️❤️ I've seen your movie manmarziya for 30 times but I'll never bored your emotions in movie are really real you do Your work very well ❤️ you're the first person in my life whom I comment I tell that am big fan of yours....🙏Love you dear 😘 God bless you and once again you're best 👍 I can't explain my feelings and respect 🙏 in such words... Big fan of yours 🤗", "poojapratiktailor": "Really a very nice movie", "thelumite": "This movie is lovely taapsee. I cherish you so much❣️❣️", "yukktiii": "Omg, thappad was so emotional but the way you acted in the movie Taapsee ji. It was awesome!!", "jen3216555": "itna over drama kaise karleti hai aap?", "shreya_purohit_": "What a movie. Superb!! Such movies may not be able to enter in crore club but, surely wins our hearts!! 🖤", "the_foodie.gupta": "Just watched thappad and it is one of the best films of the decade and I am a boy and it feels right to have someone judge us the way you did it in the film as no have has any right to tell anybody anything. Love your performance ❤️❤️❤️❤️❤️ love you too and more power to you😍", "ishita_samanta": "What a film.. ❤️", "dineshchoudhary.barliya": "❤️❤️❤️", "megha_singh____": "The BEST ❤️❤️❤️❤️", "all_with_mom": "Saw it last night!! & Loved every part of the movie. One thappad is literally enough!", "pavani_pvt": "Wonderful movie!!❤️❤️", "aditya_apurwa": "The word are not enough for this movie . Bhot khubsurat movie hai and this is the reality amoung our society .women dont raise their opinion on wagt they are suffering from.... specially your performance was superb. Abb tak ki sabse best movie thi yai ... loads of love ma'am ❤️❤️😊👌", "khushboomudgal24": "Totally loved the movie and story ❤", "gayatrivohra": "It's a beautiful movie Taapsee!! Such a wonderful and important topic you guys decided to portray!! Thoroughly enjoyed it with eyes full of tears!! 💗", "alankrita632": "I once threw a flower pot at my hubby in anger...he did not file a divorce for that...", "d______n________": "Wow❤️", "rajivkapoor007": "Very disappointed to see Thappad.. Bad script and for you also nothing much to-do... Be careful choosing script and your role.", "_sunnnnii__.ly": "Big fan ❤️🙂", "an_namma_": "Nice movie...❤️❤️❤️❤️❤️", "_travellertoinfinity_": "This is an absolute masterpiece❤️❤️❤️", "vashisth_priya": "Amazing movie ,concept was great .❤️❤️", "official_ravi_verma": "❤️❤️❤️", "medina647377": "❤️🌷❤️", "anuragtiwari320": "Aap saree me bahoot achi lagti hain aapka fan -Anurag tiwari", "megh_a04": "I saw the movie. It was great, the whole night i kept recalling your character. An imperative content which requires to be spread among people. Thank you", "farhanshaikh8442": "Hii", "gentlemanunlimited": "This is one of the most stupid films I’ve watched. I loved your acting, you were amazing, but the story line is ridiculous. One slap equals to immediately not loving your husband, even though he tries to fix things, especially that he has only hit her once? I’m not justifying that the slap was right but it’s so stupid how one slap equals to all of this 🤦🏻‍♂️ he is better off without her", "swapnalibailung444": "This movie is too good❤️", "ursb2020": "Mam IAM your biggest fan from North East ❣️❣️ we love you..", "shagun_juneja": "Why even a slap? 🥰", "myfofali": "@taapsee what a performance mam. Really very good movie... A power and pain of woman is mentioned in this movie. Hats off for your acting mam", "mayuraah_hingu": "Killler climax....diehard fan... Superb explanation to reality", "abhilasha_s_paul": "You are an iconic actress mam!!! All the love and respect for you, the kind of roles that you do in your movies and the justice to those roles you offer is amazing. Thankyou for being a part of Bollywood and taking it to next level in sense of acting and art ♥️♥️♥️♥️", "muslimabbas589": "Nice", "tanishaivi": "love you you’re a trailblazin queen👏🏽", "creative101pixel": "I love this movie ❤️❤️❤️❤️ your acting is perfect 👌", "sweety_talukdar": "Wow!!! Wat a movie...loved it to the core ❤️❤️❤️ u r the best @taapsee", "tariqnaik": "Absolutely brilliant performance and powerful movie 🙌", "shadesofpoetry._": "Hats off ma'am 🙌", "lowkeyexplorer": "Loved the movie ❤️❤️❤️", "kalsoomathar": "One of the fine pieces 💐", "g_e_s_s_7": "Such a shit movie..", "_un_monde_de_reves": "@taapsee i watched thappad 3 times back to back. Really i m short of words to describe the way you have presented such a big message. It was just a very thin line which you were trying to keep in the movie. It was not just a slap. It was your respect. Your confidence. It was a commendable movie. That i think each n everyone should watch", "_.pratibha1307._": "Ohhh wow that's really an amazing work and yeah this movie is tooo fricking goodd❤️❤️❤️", "positive_deepal": "@taapsee ~ jaisa dikhaya hai, hota wahi hai... lekin ab joh tumne feel karaya hai, aage aisa hi hoga 👌🏻 the unsaid story of so many women’s ... 🥂 cheers to your brilliant performance ❤️", "goldy0311": "❤️❤️❤️❤️, great performance by Taapsee.", "sakshi_sahani": "You are commendable in this movie. Felt every moment of your presence. Just watched it. Real art. Keep up the good work! 💯", "khantwal_ashutosh": "Kuch bhi movie", "ahsanshaw": "I just watched it last night. It was superb. I am still spell-bound and enthralled by the elegance of the movie. I love you tapsee soooouch for doing another worth watching movie. I made a list of movies to save for my kids whenever I get married in future. \"thappad\" is one of those movies now. I am from Pakistan but vicariously I hail from the Bollywood by the virtue of such a movies. ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "yolo_carpediem": "Hats off to Sunita (maid) for getting slapped innumerous times throughout the movie just to maintain the impact 👏🏽 you did well too 👍🏽", "lsweetiel": "Amazing movie !!! Starting loving tapsee❤️", "chanchel_nambiar": "Just finished watching the movie. @taapsee ma'am acting felt so real. Emotional and eye opener.", "rohitrana556": "Just seen #Thappad on #amazonprimevideo cried a lot.. thanks for making this movie... Loved it... Respect for u and #anubhavsinha ....", "shivanibhardwaj052": "@swati.bhardwaj.27 that slap was real!!!!", "sarakhan.ox": "Since being on lockdown in the UK I’ve watched three of your films, Badla, game over and thappad and I have to say you have become my favourite actress in Bollywood. Loved them all as they all have a sense of reality in them and your acting was 10/10. Keep it up I will definitely watch more of your films on Netflix and amazon prime x", "last_kash_sutta": "@last_kash_sutta follow my page i follow back you", "anupadawra": "@taapsee I can’t describe in words how much did I love the movie!! The script and grip and above all ur acting skills .. it’s like one of the movies which we can watch years later as well..", "nehayadav1872": "@taapsee Hello Mam today I saw ur movie at amazon prime, Movie was ok-ok, but it was very slow 🐢🐌 half an hour ki story ko kamal ka 1 hour 40 min stretch 💆 kiya.. 👏👏", "dp7702020": "My favorite actress", "purnima_tr": "Taapsee you did it 💙🎈", "prikshit_tewari": "Amazing movie 😍😍😍", "abhi_choudhary007": "Kal maine drink kr li or mera wife k sath argument ho gaya or usne mujhe thappad mar diya... To m jake case krdu uspe.... Come on yr agr ase rishte todne lage insaan to wo akela hi rhega bcoz ek thappad ki wjh jo bhar bhar k pyar hmare partner ne diya h usko nhi bhula skte.... लोगो को पथभ्रष्ट करना बंद करो 🙏", "geetagaur03": "Awesome 👌👌movie", "adii_c_official": "Follow me ❤️❤️", "photography_nikilicious": "I loved songs and movie also😁", "s.h.a.h.n.a.w.a.z___": "@taapsee sahi pada", "vaishhh.__": "@taapsee is good against domestic violence but if you see in urban areas there are good couple too who love eachother soo much for eg a woman slapped her man coz of some reason that doesn't mean she don't love him or will take divorce things happens in hit of moment if you love that person and that person hurts you (vice-versa) soo you're not completely right. 🙌", "ankitayamali": "Just watched your movie PINK it was amazing \"💖\"", "tusharn116": "Nonsense movie overreaction", "devika_dileep": "This was such a brilliant movie . Story, Script, acting , Message , everything was Soo good.. please do more movies like this.", "_krupa.hegde": "In a busy working life mode its after almost 2yrs, this was the first movie I didn't forward any scene and watched, every second was worth watching. Bravoooo!!!!! ❤️", "fiona.dalmeida": "I saw this yesterday when it released on @primevideoin ... I loved it ... you acted so well ... and besides the way you explain your situation to the mother in law had me in tears ... loved the movie ... 👏🏻👏🏻👏🏻👏🏻👏🏻", "sradha._.x": "♥️♥️", "divinedoto": "Lagi thappad", "kinzatariq34": "beautiful", "prashildeogade01": "Just a slap but nhi maar skta😘😘😘😘🔥", "tushar_aga": "Dil se banayi thi, Dillon ko chu rahi hai❤️", "shraaa_fr_insta": "I really wanted to watch this movie in theatre but was so busy that did not get a chance.. but watched it today at 3am on Prime and my pillow cover was wet with tears.. Fortunately I have not experienced the slap of a man till now and never ever want that.. but I felt the pain in the slap and in the story... Amazing Amazing acting.. @taapsee", "rushir10": "Great movie great acting I will watch it again", "gautamkumarbarik": "This movie reminded me of the fact that, it's a privilege to be loved by a woman and not the other way... @taapsee you are so amazing in this....kabhi kabhi movie repeat karne ka bhi alag maja hota hai... Hope u r reading it... 😍😍😍", "fc_virushka": "It's an outstanding movie..👏great work hoping that there will change in people's thinking....and also hoping to see u doing more movies like this that will change people thinking", "fardina_ahmad": "Watched it . ❤️ Just speechless. This movie has really made a Thappad in my unconscious mind ...", "keshrajput": "Pointless movie. I mean that is so unrealistic that it never would happen in real life unless you are brain dead. Just for the record, the wife was in the wrong not the husbamd", "apoorvaappyverma": "Today I see ur movie ma'am.you just nailed it and inspires a lot .Always learn something from you and your role.keep inspires ma'am.luv u ❤️", "sameera_chalamalasetty": "Beautiful Movie..Thank You for making it 💗", "shubham_sharma_010": "Worst movie bilkul....", "vj_1234supercool": "Love tapsee...... ❤️❤️ not only this movie but I love watching all your movies......ur south movies to Bollywood.... I love each n every movie.........", "suhana_ahuja": "M stunned by out acting in thappad..lots of love m blessings... more power to u😘", "imonmyway_india": "Taapse ur amazing person nd fabulous job", "theterritorialpanda": "I don’t know if you will ever read this or not! But i wanna say this! I am proud of you! Just finished watching Thappad and loved you in it! Thank you for being who you are! Thank you for doing such inspiring work! You know we are a pass out from the same college and today it all means even more! Makes me feel so good! Thank you for being such an amazing soul and making all the choices you have in life!", "adishrijoshi": "This is an amazing picture i loved this picture alot i loved it so much mam. You have done such a beautiful acting. Mam i am big fan of you and i love your acting in every movie.This movie gives us a inspiration and you are one of the inspiration mam..❤❤", "pixalay": "Faltu movie..", "i.garima.sharma": "You were amazing!!", "ambarydv": "@moong_vada seven takes and she's boasting. You got moorthy to bitch slap me 7 times every day minimum", "ahmad.nawaz.7121": "Amazing Just watch it ...Powerful performance More Power to u 💖", "purvi_khosla23": "@taapsee I love you💕💕you inspire me so much 😍😘😘", "kannaya58": "😢😢😢😢😢 worst film", "parthhere_": "Potty movie", "hiva_8343_": "Movie🔥🔥🔥🔥🔥", "himanshu_rajput_singh": "Sachi bol raha hu Mam koi. Apko mare mujse bardash nhi hota h", "meme.station11": "Follow us for memes on latest trending topics", "nidhibhagi1985": "@just saw the movie today on Amazon prime. What u did was brave I don't think many women have courage to do that. I am a mother of 2 kids I don't have this courage. Life is going on.. nothing else its just not a slap its something only the person can feel who got it. People still say areee ma bap ne bhi to Mara tha pati ne Mara to kya hua. Society is full of hypocrites that's where we live. Amazing movie I feel light now.for some reson....", "sandy_pacha": "👌👌", "___sukhpal": "Beautiful movie. U are looking wonderful as always😍😍. God bless..", "kochu_toons": "watched Thappad and it was well crafted i must say and i liked it... just a query... what would have happened if Vikram had apologised, as at the court, the morning after the party... will Amritha would have forgiven him or would have left.. If it was just the slap then would she have left him even after his apology... i hope you would answer my query 😊", "amruthavarma888": "Loved the movie", "manishjadoo": "❤️❤️❤️❤️❤️", "anirudh487": "Hey please check my profile and like my recent post and follow me 🔥🔥🔥🔥", "lolitsfine56": "Best movie ever... It rightly potrays the respect women deserves.. Just loved it... Thanks for this great great movie❤", "simran_panchall": "Never felt this strong. Huge respect💯 Completely speechless❤️", "rajan_azad": "Phenomenal👌👌", "dhartivikas": "Just watchd yesterday it's amazing movie as always like all yrs all movies👏", "nida.waleed": "Really liked it. Beautiful concept", "sangitamahajan1": "nice photo", "mayu_rgehlot": "❤️I Loved this Movie soo much Ma'am & there was great performance👌🏻 by all of them 😍 in movie ❤ 💯", "radhey.sony": "Miss universe 🌷🌷", "rubinasbakestories": "Just watched the movie - what an amazing performance and such an important story so we’ll told - kudos to you and the whole team 👏", "i_nikiz": "I love this movie♥️🔥🔥🔥🔥🔥🔥🔥🔥🔥", "vaidkritika": "Amazing performance 🙌🙌🙌❣️", "satyajit_mallik_official": "2020 ka sabse .ghatia content wali film...#flop", "sahilkhatri001": "Koi movie hai yeh illogical kuch b", "clown_jindal": "The message is delivered, and it is delivered well.", "itz_arviiii": "Follow me guys for like comment💞", "irine_sultana": "💛", "sufi_smarty": "Awesome movie 💕💕💕💕", "sheisshubh": "♥️♥️♥️ damn i loved the movie soo much...like everything was so perfect...the screenplay.. Everyone's expressions... And the mssg it conveyed is amazing😇♥️", "iaman_026": "#team_026", "ashish_swag": "😍😍👌😍👌👌😍👌👌😍👌😍👌😍👌😍👌👌👌👌👌👌😍👌😍👌👌👌👌👌👌👌👌👌👌👌👌👌👌😍😍👌😍😍😍😍😍😍👌👌👌😍👌😍😍👌😍😍👌😍👌😍👌😍👌😍😍😍😍👌😍👌😍👌👌👌👌👌😍👌👌👌👌👌😍👌😍👌😍👌👌👌👌👌👌👌👌👌👌☺️😚😋😚😋🤩😉🤩🙂😉🤩😙🤩😘😙🤩😘😙🤩😘🤩😗😘😍😗😉😍😗😉😍😗😍😉😗🤩😉😙😍😚😗😍🙃🤣😗🙃😍😗🙃😍😗🙃😍😗🙃😗🤩🤩😗😉🤪😗😜😉😗😜🙃😜😗😉🤪😗😉🤪😗😉😗🤩😉😗🤩🙃🤩😗🙃🤩😗🙃🤩😉🤩😙🤩😉😙😉😍😙😍😉😙😍😉😍😍😉😗😍😉😙😍😉😗😍🙃😍😗😉😍😙😉😍😙😚😍😗😘😗😍😘😗😍😉😍😗😉😍😙😘🙂😍😉😗😍😉😍😙😘😍😙😍🙃😙😍😉😙😍😘😗😍🙃🤩😙😘🤩😙🙃🤩😗😉😍😙😉🥰😙🙃😍😗😘🤩😙😉😍😙😘🥰😙😉😙🤩😉🥰😙🥰🙃😗😍🙃😙😍🙃🥰🙃🤩😍😗😍😘😗🤩😘🤩😗😍😉🤗😍😉😍🤗😍😉🤗😉🥰😗😍😘😍😗🙃🤩😗🙃😍😗😚😍😗🥰😚😗🥰😚🥰😗🙃😍🤗😚😍😗😍🙃😗😍🙃🤩😗🤩😚😗🤩🙃😗🤩🙃🤩🤗🙃🤩😗🤩🙃😗😍😉😍😙😘😍😗😍😘😍😙😘😍😙😍🙃😗😍😘😍😗😍😉😗😍😘😍😗😚😍😗😍😘😗😍😘😍😗😚😍😗😍😚😗😍😉😍😗😉🤗😉🥰🤗😉🥰🤗🥰😉😗🥰😉🙂🥰😉😗😍😉😍🤩😗😘😗😍😘😍😘🤩😗😍😗🤩😘😗🤩😘🤩😙🤩😘😗😍😘😍😗😘😍😙😘😍😙😍😘😙😍😘😜😙😘😜😙😍😘😙😜😘😘😜😙😜😘😙😜😘😜😙😘😜😗😗😜😜😗😍😘😗😍😘😍😗😘😍😗😘😜😜😘😍😘😍😘😍😙😍😙😍😙😙😍😙😍😙😍😚😍😙😍😙😙😍😙😍😙😙😍😘😍😙😉😍😗😉🤩😙😉🤩😙🤩😉🤩😗😉🤩😗😍😉😍😗🙃😍😗😉😍😉😍😙😍😉😙😍😉😗😍😉😙🥰😉🥰😙😉🥰😗😉😍😗😉😍😗😍😘😗😍😉😗😍😉😍🤗😍😘😙😍😉😗🥰😉🥰😙🥰😉🥰😗😉🥰😗🥰😉😗🥰😉🥰😗😉🥰😗😍😉😙😍😉😗😍😘😍😙😘😍🤗😘😍😍☺️🙂🤩☺️😗😍😗😉😍😉😍🙂😉😍🙂😘😍🙂😘😍🙂😋😜🙂😉😍🙂😉😍🙂😍😉🙂😍😉😍🙂😉😍🙂😉😍🤗😍😘😙😘😍😙😍😘😍🙂😘😍🙂😍😘😙😍😘🤩😙😍😘😙😍😘😍😙😍😘🙂🤩😉😙😍😉😙😍😘😙😍😘😜😙😘😜😙😜😘😙😜😘😜😙😘😜🙂😘🤩🙂😍😘😙😍😘😙😍😘🤩😘🤩😙🤩😘😍😗😘😍😗😍😘😍😗🤩😘😙😍😘😙😍😘😍😙😘😍😙😍😍🙂😘😙🤩😘😙🤩😘😍😙🤩😉😙🤩😘😙😍😘😍😙😘😍😙😘🤩😗🤩😘😙🤩😘😙🤩😘🤩😗😘😍😗😍😘😍😘😗😍😘😍😗😘😍😗😘😍😙😘😍😙😍😘😍😙😘😍😙😍😘😗😍😘🤩😗😘😍😗😍😘😗🤩😘🤩😗🤩😗🤩😘😗🤩😘🤩😗😘🤩😗🤩😘😗😘🤩😗😘🥰😗😘🥰😗🥰😘😙🥰😘😙😘😍😍😘😙😍😘🤩😙😘🤩😙😍😘😙🥰😘😙😍😘🤩😙😘🤩😘😙🤩😘😍😙🥰☺️😙😍☺️🤩😙☺️😍😗😘🤩😗🤩😉🤩😘😍😙😘🤩😗🤩😘🤩😘🤩😗😘🤩😙🤩😘😍😗😘😍😗🤩😘🤩😗😘🤩😙😍😘😗🤩😘🤩😗😘🤩😘🤩😙😘🤩😙🤩😘🤩😙🤩😘😙🤩😘🤩😙🤩😘😙🤩😘😍😙😍😘😙😍😘😍😘😍😙😍😘😙😍😘😍😙😍😘😙😍😘😙😍😘😍😙😘😍😙😍😘😙😍😘😙🤩☺️🤩😙☺️🤩😙😍☺️😙🤩☺️😍😙☺️🤩😍😚☺️🤩😚☺️😍😚☺️🤪😚😍☺️😙😍☺️🤩☺️😍😙☺️🤩😙☺️🤩😙😍😆😙😍😆🤩😙😆🤩😙😆", "jr.acharya": "beautiful mam", "akshatgahire_photos_": "Follow me 💕💕❤️😍", "nora_moktan996": "This is a commendable movie @taapsee lots of love for choosing such awe inspiring films!", "mehta_shru": "Loved this movie !! You were awesome. Such a great message for all the women’s out there ... more power to you for doing such amazing work ❤️❤️", "iam_syedhamedali": "Thanks for bringing this to us really appreciated ♥️", "ek.number": "This thappad is karara tamacha! @taapsee ......", "prag_kool": "Slow but Strong Message👍", "soso97__2000": "wonderful😍😍👏👏👏", "rahul_.chauhan_": "Fake Faminism ...", "dianakrishna": "Lovely movie", "iknowyouspyonmee": "Coincidentally i just saw the movie and am moved. I am amazed that how realistically this movie has covered all those big and tiny feeling we women go through in every stage of our lives. No words! Just 🙌 respect.", "akanshahahaha_18": "Great movie❤️", "dudess_0503": "❤️", "sheetalrc": "such a beautiful piece of art showed in the movie. the emotions were so clear and passed in our minds was so good. I watched this movie last night and I was shattered. Hats off to you @taapsee you are such a beautiful piece of art.. so proud of you♥️♥️♥️♥️♥️♥️♥️", "ankitjazz14": "One note constipated expressions dont work in a touching movie like this. She had to emote disappointment, shock, grief, anger and loss", "anupamaniit07": "👌👌👌gajab acting n movie", "nglove_20": "जब हाथ तेरा उठा इतनी सी बात कह टाल दिया जब हाथ मेरा उठा मुझे बदचलन बर्बाद कहा।", "parek_12ankit": "Pahuch gayi Dil tak. It was a beautiful movie. ❤️", "sdsagardhote": "Yes it's!", "waldia77": "Your craft is getting best with every movie. Wishing lots of success to you :) Loved this movie and you looked sassy in all the outfits", "priyanka1047": "Watched Thappad yesterday. What an amazing movie. Very well played Taapsee Congratulations 👏.", "anikagupta90": "Amazing movie ❤️", "s.y.rijon": "Great movie mam", "nupuro": "Phenomenal movie ! So many emotions, so many aspects! Really enjoyed it and wish it can reach all men and women", "pratthebrat89": "Just finished watching the movie and this was by far your best acting in a movie. It was so genuine and felt relatable.", "tukii7tukii": "Kudos and congratulations on a brilliant film dear @taapsee . Much needed wake up call for the much treasured patriarchy. I almost tangibly feel I now know Ammu in person after watching the film. My heart and hugs go out to her.", "shaista005": "beautiful movie", "typesofdesidomesticabuse": "@iamtaapseepannu I saw myself in this character . Domestic violence survivor 👏👏👏👏👏👏", "rahulp8198": "🔥 Hotness overloaded", "rakesha64": "Thanks for such a strong movie... ❤️", "pop.sayari": "Loved it", "your_health_my_mission": "Saw your movie and you have done an amazing job and everyone else as well", "priyankkaa.__": "❤️❤️", "yoursumitgoyal": "Watched it Yesterday...", "vishalsavaliya105": "Nahi marna chahiye tha🙌", "im_sjdtheprincess": "I hav already watched it day before tomorrow.. It's fantastic movie tapu..", "r_a_s_h_i_s_h_a_r_m_a": "Awesome work maam.... Your work is inspirational to many women 😍😘", "shrutijaiswal79": "Loved it absolutely..", "__v.i.n.a.y.a.k": "Bina faltu ka feminism", "sizzling_ridz": "True story at almost for every housewife . Your acting is wonderful❤️ mam. @taapsee", "missgautam93": "Ek baar ko to duniya k taur-tarikon se dil uth gaya than I saw positive side and felt self-love along with self-respect. I could not sleep for a whole night after watching this movie, ur performance was impeccable... Applauds 👏", "n.attaie": "Superb!! Totally loved it!!", "kanjinghatdivya": "so basically he made u get hit 8 times?", "tsesomola": "Yea I watched half of it", "dhruvsharma261": "Don't ask audience to watch your movie just because of real slap scene, it's our choice if we want to see your movie or not. So, Please keep your mouth shut you fool lady who is known for chutiya replies on Twitter.", "chaudharibheem7839": "I loved this movie ❤️❤️❤️❤️", "khushiag.18": "Pure dil tak pahunchi aur rona bhi aa gya❤️", "ranimagarade": "❤️💯", "rahulkumargoyal933": "Mam ,aap chai me kaun si leave dalti thi?", "poojisterr": "I can’t describe how much I loved this movie! Such a gem after a long time. So simple yet so beautiful. Put everyone’s thoughts and emotions so effortlessly. With a powerful yet a simple message. Each character was built upon so nicely. ❤️", "yassu_cool": "Ma'am ur film is really awesome and worth watching 😍 conveyed needed message", "jyotishman368": "Aj tak ki sabse wahiyat movie", "dj____john": "😂😂😂 total garbage", "drupad.mewada": "Third grade concept of movie", "mousam_pattanaik": "What a film! ❤️ so well crafted movie 😍. After watching this film from two days each scene in my head.", "sonal_kurdekar": "❤️❤️❤️❤️❤️❤️❤️", "vibhapat": "I watched it yesterday. Brilliant performance. Brilliant star cast. 💞", "anu_pennu": "loved it to the core, a simple word \"respect\" has so many dimensions, it's immaterial if u are rich or not...", "rajvansh843": "Eagerly waiting for it #thappad", "niks.199": "Good movie❤️", "nishant_patil_3112": "💞", "somya.tanwar11": "Lovely movie!!", "vipin5155vipin_gogri": "❤️ Most of all movies of yours I’ve seen & liked very much. Keep it up.", "lits_thakur": "It is wonderful movie", "itz_nive": "It was a superb example to my future husband... ,😬🤭😅", "kh_abhi_b": "please also make a movie on saravjeet singh and that girl who fled to Canada and left him with false accusations on harrasment and ruined his life @taapsee @anubhavsinhaa", "mamta.4444": "Absolutely loved the movie and the super duper performance by you even more!!! You are amazing and fabulous! 💕💕💕 Keep them coming!!!", "yogita_goyal02": "Watched Thappad yesterday. You were excellent. Better than any other present day actress and yes better than Kangana @team_kangana_ranaut", "galaxy_eyes_pritz": "It's really amazing🤗", "rgsingh1416": "Loved ur movie Thappad, loved ur performance in it", "frame_out_": "Superbmovie 🔥🔥", "chhaya.pandit1003": "Love this movie", "nam_snm": "Watch this @tsesomola it’s nerve wrecking good👍🏻👌🏽", "anjali_sugathan": "I felt connected to every bit of it, I could see my mom and me in it.. So proud of you❤️ your acting as always was commendable ☺lots and lots of love, go on and on and on😍", "mishra.kanishk": "One of the best movie", "priya.patnaik17": "Excellent movie ❤️❤️❤️", "jammy_freebird": "I just saw #Thappad on #amazonprime. Amritas parents felt so real that every dialogue her dad said felt like mine. Loved the film & love my mom dad. Thank you @taapsee I cried my heart out missing my family.", "sairahuddin": "Just watched it and I know it’s in my top 5 movies of all time ..I’m in awe of you .. magnifique 🙌🙌❤️❤️❤️❤️ I know I will be watching this movie again n again xxx", "khanabriz": "I watched 'thappad' today. And I am so proud that this movie came from Indian cinema. Thankyou for not supporting myths like multiple marriage or even thappad. I have always seen you as a star who has a point. This movie made me think that basic rights have become very difficult to achieve in this society. Thankyou for bringing this to all of us. And very soon I am going to catch your morning tea 😍..", "pramodh_chandrashekar": "How thoughtful can a movie be!? It made be emotional ❤️❤️❤️", "ria.kapoor42": "@kprtania krass...", "iam_lazy_1": "❤️❤️ amazing movie,I love it❤️❤️", "vishalmathur270980": "Watched !!", "me___.et": "Telegram jindabad!!!!", "heimilalwani": "Loved watching you in Thappar💕", "harikrishnanzz": "Teach me that THAPPAD tea recipe please..", "withlovesoniya": "I felt that hard to my core!! I felt that Thappad.. ❤️❤️", "simran_koul3108": "Movie that our society needs. Truely a masterpiece. 💞", "priyankaamunjial": "Congratulations tappsee very well made movie. Touched the right strings. An eye opener for parents and women who are enduring it. Go watch everyone , acted v well tappsee. 👏🤗", "theradiantsoul": "❤️", "bangtan___.fam___": "What a brilliant movie with a really important message. 💜 Loved your performance in it.", "cheta_njoshi": "Tapsi jee hi", "buzz.anirudh": "You made all women prettier from prettiest ❤️", "thulichori": "loved ur acting n movie🙌", "samiyasultana22": "😍😍😍😍", "shwetaarora121": "Dil ko gehra choo ke guzari ye khoobsurati mam", "karavinesh": "Enjoyed it 👌🏻 @taapsee", "_prateekjain": "What a masterpiece story always revolve around your own story", "ghoshrimjhim": "This type of movies are needed. I almost cried the whole time in the 2nd half. 🧡 Thank u fr always picking such movies", "always_haritha": "Loved the film! Recommending it to all.", "homairatamanna": "Love this movie awesome fantastic .....u r fabulous actress ......❤️❤️❤️❤️❤️❤️❤️", "muhammad_farooq_here": "Bohot hi pathetic movie banai hy any wali sari youth kharab hogi issy how you could this @taapsee Verified", "gandhijyoti67": "It is really a beautiful movie.thappad stands for respect of every women", "tps_pawar": "Loved your movie ❣️", "pankaj.gurjar.71": "You can live without love but you can't live without self esteem. This movie has been one of the most thought provocating till date . Tapsee has justified why she takes a drastic step , it is not just a thappad , it disrespect to the love and care she had for her husband. She was a homemaker, she was not a working women in office . The only earning she had was love and respect from her husband. If her husband demolishes it in front of whole crowd , she has all right to file a divorce . Plus she stands firm on her stance when her in laws and family told to compromise. Even her lawyer didn't ought to take the case . But she just changed lives of many people her lawyer,dia mirza and her domestic worker . She puts it right out their that this domestic violence is not the normal . She sets the new normal to stand against it and live a life of dignity and self respect . That's what the movie thappad is all About ... All credentials to Tapsee for being such an actor .... she has made a huge mark in cine world by doing such a movie .", "_v_i_n_o_d_": "Just saw your movie, it’s amazing.. look like real", "pinky_akki": "Awesome movie❤️", "thri.llerstories": "Plz follow me to read horror stories", "supriya8242": "For some reason I never liked you as an actor but after seeing thappad . I am your fan", "cotton_candii24": "Saw it on prime yesterday 🔥.. it was just a killer, hats off taapsee. Loved it😍", "ro.shni4320": "❤️", "romaticboy01": "Nyc😘😘😘😘😘", "zahraazamiiii": "Watched❤", "_aaradhyatripathi": "this film is fantastic👌👌. U did a great and outstanding work ♥️♥️", "lokeshsingh3027": "Really Sashi IHOP Joe's my kids 30yes cricket like jordtaaap", "djauhal": "Amazing work! Loved it Taapsee❤️", "kiranpatil9785": "Yes , definitely nice movie like always of yours", "im_mishty21": "such a brilliant movie", "rahulkumar49882": "Aapki ek movie dheki maine manmarziaan isme sahdi se phele awed samband waah kya bat hai.. Aur phir ye ki pati aapko ek chata mar de to aap usse talak mango.. Yahi sab message de rahe hai aap sab samaj ko..", "pandeyji_ka_ladka_": "@taapsee myne bhi aaj movie Dekhi mujhe bhut psnd aayi movie 😍😘", "anjalisuresh_": "Effortless relationships Daily routine Adrah wali chai Cuddling sleepless nights Swift moves of kathak Self realisation after years Self respect Unsaid ambitions Supportive parents Understanding in-laws : atlast of the movie She was there in every role- a house wife, a maid, a lawyer and a mother. Every single scene was a realisation for me. All because it was just a slap #Just a \"Thappad\" Great illustration of Amritha...@tapsee😍", "shrutipimplikar": "What a great film! 😍 Haven’t had such a warm feeling after watching a movie in recent times! Every performance was great! ❤️", "prittyyy2828": "Respect ....💖💖", "pratul.srivastava22": "कैसे बनाई वो तो नई पता, But after this scene I felt hate for Pavail Gulati until the end of this movie!! It's the most accurate portrayal on domestic violence and male chauvinism. Great performance by everyone. 👏🏻👏🏻", "nehakailadhir": "Watched Thappad today. It’s a movie which is a an eye opener for so many people even for the people who does appreciate their partners. It is not just the concept of a Slap but much more than that . The impact of this movie is so powerful and strong that it will stay in our minds forever. @taapsee “you are a SuperStar and genuinely Dil Tak Pahunch gai “", "inilam0802": "U r the Bestest... Taap # mam..... 💙 Respect... For u & acting... I know u dersve more ................... Success... & love... And U definitely Get ...@taapsee 🤗", "rajatrashmi": "My Dear Tapsee, I wanted to thank you for choosing Thappad, for being Amu and for delivering such a beautiful and necessary message. More power to you, I hope I am able to raise a good man of my son. God bless you. Lots of love from this Stranger fan girl 👧!", "divyajain_2303": "I am just blessed while watching this movie .. it's really Adorable and also the message given through it , is really necessary that everyone should know about it and you have taken the step ... 💯💯💯", "beingnaveed": "@taapsee you are the only reason i watched this movie", "payal_10_": "Best movie ever ❤️", "shruti_1809": "Awesome movie ma'am ❤️", "raghavbhatt_59": "Most irrelevant movie i hve ever seen .. boring .. wasted my precious 2 hours.. it’s good to empower women bt thts not the right path.. a boy has dne everything to convince a girl in dis movie.. stupid one 😴", "a_h_niki": "Nice", "neha2592singh": "Awesome movie...the message intended wa loud at par...good job!", "deshikar": "I mean wow wow what a movie", "shreyajohry_31": "Plss replyyyyyyyyyyyyyyy", "sau_times_better": "I watched it with my mom, two days back! It's indeed one of your best works till date @taapsee ... Amu was right and we loved it! ❤️❤️", "___.apricity.___": "I loved this movie. This is your best work 'till date.💖💖💖💖", "nilanjana._.bhuyan": "Best movie seen❤️", "sonkerhinu93": "Really tooooo good movie. I relate myself with this movie...👍👍👍", "ektapeterkhess": "Awesome movie", "jaysharma246": "Really nice movie, I loved it", "rash.mi6434": "Best movie", "abhijitdzz": "Itni ghatiya movie to free me bhi na dekhu ....plzz don't watch this shit🤮🤮", "escoba329": "This is my one of favourite movie because this movie is showing the ground realty of domestic violence and patriarchy.", "ig_bunter": "thapad", "_justmg": "This movie is change my thinking. Your done the great performance ❤️ god bless you", "preetisharmmla": "Watched thappad yesterday with my family what a beautiful way storytelling simple story you are very good actress I decided to watch Thappad film violence is never okay take a stand against it thanks 😘 you taappse because you giving me lots of thinks l learn you you are very proud precious person after watched my way of thinking changed we should stop at first slap Thappad is very important and beautiful movie thanks you 👏👏👏👏👏", "chauhansaksham007": "Communists piece of craps when they try to act smartass by taking right of freedom of expression. Le kantap😅", "crazydisha_88": "@Taapsee the way you portrayed the character of Amrita was commendable. It wasn't as if you were just acting, it seemed as if you were living her life. The way you portrayed her feeling of humiliation, those sleepless nights, the fight she put up to make Anubhav and everyone else that what he did was wrong and can't be justified was beautiful. It was as if what I was seeing was not a movie, it was a journey a woman has to make to just prove a simple thing : that violence is wrong! There were moments when I cried, and there were moments when I rejoiced at her small steps towards victory. Thank you for giving us a wonderful movie!", "vermareyo": "आज देखा, सचमुच आँसू आ गए, ऐसे ही बढ़ते रहो और अच्छी फिल्मों में काम करो @taapsee 👍👍", "dimpsehgal": "What an acting amazing movie and it's because of your amazing talent and acting ❤️", "gusain_nishu123": "Awsm movie 😘😍", "qeen_sanika_": "U Always my fav", "sudeshna5996": "Awesome movie👌👌", "__shivam08__": "🔥🔥🔥", "kanyanarayanan": "Great movie Taapsee :-) Ur evolving as a actor big time... Hats off to you... Loved all the roles you have played so far...", "anjalikumarisingh123": "I saw your movie Thappad on prime video. It was awesome. Great work Taapsee👏👏👏👏", "temptingayu": "🔥🔥🔥❤️🙌🙌🙌", "anu_anand_": "Awesome movie❤️", "___asmita___": "Pretty osm", "zenobia_gonda": "You were Outstanding❤️", "itspranavv": "❤️", "_saranya_7": "Important movie", "currentaffairs12.12": "It is one of the best movie I have seen mam there are not so many movies from which I get inspired but this is surely the one...it's all so relatable for me though I m not married but what is expect ahead is respect and happiness and at any point I don't want to compromise my happiness because I know I m not that kind of person", "beingvivekkpareek": "hi taapsee mam ,best movie , movie ka topic best hai, aab humko change hona hoga, kuch bhi ho jaye koi bhi aapne partner ko aise taappad nhi maar skta best movie aise topic pe movie chahiye thi", "kavita_maddala": "Hi @taapsee . Watched Thappad on @primevideoin and I must say this movie is more about a thappad to the age old norms of patriarchy. Loved it. Recommend it to all men as however well brought up they are some amount of casual sexism does seep into our day to day lives. More power to you. @anubhavsinhaa", "deeshpatel": "Omg", "sureshdakoju": "What a movie !!!!! I think yeh movie har mard ko dekhni chahiye..Though for someone who can't imagine hitting a woman.i was spellbound. U completely owns the space and u r marvelous.", "xania.sania": "Ahh Finally!!!! I was looking for this movie from long, now it will be easier to watch it👏🏽👏🏽 Love you tapsee you are doing really great movies❤️", "malv.ika.r": "i love you", "samridhi__nath": "One of the most touching movie I have ever come across❤️", "rach_na_d": "Tapsee mam it was amazing movie i literally cried during the movies how far a father can support his daughter is shown very truly in the movie and how a man whom u loved ur entire life can become so bitter is heart wrenching it had reminded me of my father he is no more but he was as supportive , loving and fighter for me ur acting it was undoubtedly awesome and beyond the beauty", "chiranjitdas2100": "Love you ma'am", "archanachintapalli": "Absolutely loved it! A story that needed to be told!", "mystrysoni": "I love this film its super clear concept without hurting or showing any gender down..", "priyagidwani14": "@taapsee #taapseepannu #thappad Dear Taapsee I watched your movie, Thappad on amazone prime. I want to share a few things with you, I am of marriageable age and ofcourse my parents are looking for a match for me. My parents do tell me often \"beta ladkiyo ko adjust karna padta hai.\" I am into marketing and that requires me to travel quite a lot, recently , my mother asked me to edit out the details of my job in my matrimonial profile, stating that \"travel wagera mention nahi karo baad me dekha jaega\". I am at my home in Delhi in lockdown and I do help my mother in the kitchen, I remember once she pointed out to me \"beta chapati to achi bana leti ho.. Fulke bhi banana seekh lo.. Kuck ladke fulke khate hai.\" Honestly, I have wonderful parents and I am blessed to be priviledged in some ways. However, when in the movie, you say to your mother in law \" kabhi ye nahi socha tha ki house wife banungi..\", \"Mera favourite color kya hai papa?\" I felt that this entire life, making girls independent is fraudulent. When in the movie Tanvi Azmi says to Amrita \"galati meri hai..Vikram ke papa ki hai.. Humne usse nhi bataya ki haath uthana galat hai.. Sandhya ji ki hai ..\" I felt my mother very strongly repeating her all time favourite line \"beta ladkiya zada zubaan chalati hai to ghar toot jaate hai\". I have a lot of other things ushering in my mind right now.. But I would leave it at that and express my gratitude to you for accepting and completing this project, because it is important for our mothers to understand that women must choose their self respect over any relationship and that not necessarily a married women is happy in a disrespectful relationship, just because she has a husband. And most importantly , the child remains happy if the mother is happy. Thank you Taapsee! Keep on doing such projects. Thank you to the entire cast and filmmakers of Thappad to present this film for us. Much appriciation and regards Priya :)", "paddy4000": "It’s too amazing movie. So deeply you played the role. Just an outstanding performance. The next day when you pretending that everything is ‘OK’ - that was the best scene. All the best @taapsee 👍", "_winnieethepooh___": "The BEST MOVIE Ever Watched! 🥺❤️", "rowsanla": "Nice movie❤️", "rubha_njoylyf": "Watched it excellent I wish all men women must understand n respect each other . Tapseee excellent acting as always", "mansurinaeem22": "Mem apki movie dekhi thappd", "sravanti21": "@akshayjjw literally finished watching this 1 min ago and I cried. What a masterpiece 😭", "reshmithxs": "Amazing performance. What a movie 🔥🙌", "zainab_fakhar": "Taapsee mam....i love u for thappad....m shedding tears from last half an hour for this amaizing moral you highlighted....i actuallyy can relate hell lot of incidents from real world where we just ignore in order to get afraid of the complications...u really taught us to get the respect yet with straight principles.#thappadstories", "beck_insta": "❤️Nice movie", "dharmeshkansara62": "❤️❤️💯💯", "kunalbaidmehta": "Really loved the opening scene with the orange candy as a hook.", "ameeka__": "No words to describe my feelings after watching this film..... It's so inspiring....Moreover, Tapsee Ma'am, you are such an awesome actress and you have always chosen mind blowing roles and your role in this film is superb too.... Love you and I have much respect for you...❤", "ashishjain.95": "@taapsee mam i saw this movie tonight, not sure what to say which I everyone haven't told you yet, but one thing I want to say, respect is the right everyone and happiness can't be there and doesn't mean anything without it.", "sabby_singh__": "@taapsee jst watched ur movie thappad on prime.. such a useless and story less movie it is jst inspiring other women to ruin their husbands life.. such a egoist character of u and ur husband was a very great and good man in all aspects", "_neha._.singh_": "Just loved it💕", "chinnu_joseph": "Too good 😇", "anuu_star": "koi meri comment ko like nahi karta hai 😔😔", "kanikakanak": "Your moive give worlds to the feeling which girls face.....keep the work going and if you want u also do something for single mothers if you can as all media ,Bollywood is going for charity for all but never and ever anyone come for this womans", "ansariishmail": "❤️❤️❤️", "miss_baaaadasss": "Sach me dil pe lagne wali movie thi ❤️", "rastogisupriya": "Loved the movie! Kuch kahaniya dil ko chu jati hain.. This is certainly one of them.. 💞💞", "foodieraghu": "I just watched it.. Salute you guys for giving us a wonderful film.", "jamesshakya_": "Nice movie....", "ii._brownsugar._ii": "Respect..❤️", "whothatsimonn": "The best @taapsee Loved the movie to its where bit ❤️", "monika_negi": "Made my boy friend see it. He got what I wanted to make him understand.", "radhikarathore6_": "I just watched it❤️", "govindsrandhawa": "@taapsee kudos ma'am I just watched Thappad it was so strong and beautiful. I'd say it was a perfect piece of craft. cheers", "guy3escapades": "beautiful movie...wonderful performances..love your movie choices and body of work of late..truly inspiring .. more power to you girl ❤️", "rissh11k": "Awesome movie taapsee you are amazing and hats of for fight for right. 👌❤️ @taapsee", "sayleee___": "❤️", "itsjustnickr_": "❤️❤️❤️", "sachin_____8009": "❤️", "sharanworld": "Loved the movie... it’s an amazing story - a story that women are experiencing in their life. @iamtaapseepannu played the role brilliantly.", "monika_6970": "Taapsee...u totally slayed it💜 kudos to this super brilliant performance.....", "aforancient": "Löwer caste shameless tribal monkey uncultured uneducated Homo sapiens 😂", "deepanshisinha": "I watched today and its a good one👍", "sittpoeeain": "I watch this movie tonight i want to say thank you for women so nice amazing movie", "mr.shubh_am_ingle": "#awesome ❤️", "rajatkaith9": "Nyccc", "asingh_2015": "Chutiya filmein hi banaio bhenchod saali.", "naresh11ven": "Bhout achi lagi or kafi kuch sikhne ko mila thanks for this one ❤️", "_ananyabhardwaj": "Loved it❤️", "farhasfoodfusion7": "You have rocked as always but this movie must encourage women especially in India! Just the way it made a difference in women from different fields of life in the movie. You are a gem @taapsee 👌👌", "beingluckysingh": "My net is over😭😭", "thakur_virat_407": "So sweet lovely 😛😛😮😍👌❤️", "anamikasaha_pinku": "I love your acting.....looking forward to much more astonishing deliveries from you in near future 🤗🤗🤗😍😍😘😘😘😘", "slim_maria": "What a beautiful performance from the whole cast and the message also.", "dutta4754": "I have loved this movie...and your acting ufffffff soooooo gooddddd👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌😘😘😘😘😘♥️♥️♥️♥️♥️♥️", "suwiaggarwal": "What a movie....@taapsee ..big black g fan after this movie...not oy your acting ..your Words but your eyes spoke so well.....very well made..direction...story..cast.. dialogue..everything perfect ...👏👏👏👏👏Kudos to the whole team #thappad #what a movie#taapsee what a actress.... Masterpiece mr #anubhavsinha", "simranwmpspp": "❤️❤️❤️", "s_h_a_y_a_n_________": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "himanshunkhatri": "Ek shayri is movie ke liye तेरी खुशियां मेरी खुशियों से कम जरूरी नहीं, उड़ानों को तेरी रोकना मेरा क्या किसी का हक नहीं। तेरे आत्म विश्वास की रक्षा करना मेरा फर्ज़ है, अगर मैं ही उसे ठेस पहुँचाऊँ तो तुझ पर मेरा कोई हक नहीं ॥ - himanshu @taapsee 🙏", "rukiye_zeliha38": "GT😉", "heermohi4": "❤️❤️nice movie ❤️❤️😍", "rimmy13_88": "We are watching it👍its awesome", "grumpy_gp": "Dear taapsee, you hv mentioned in your caption 'all possible ways a man can slap a woman'... No matter how many takes you do..trust me you can't sum it all. When a man abuses a woman physically, each time it breaks a belief in her and builds a hatred in her. Hatred for him, hatred for being thr, hatred for the reason 'why she'...hatred for society who doesn't support, hatred for family who doesn't care enough.. but there is no reason in this planet big enough for a man to seep hatred in a woman's heart and then expect forgiveness . I have myself been a survivor, and I am glad that I hv built a strong fort of belief from each brick of hatred he gave me", "rhea.rheaa": "Excellent performance 💕", "sheena.saxena28": "Loved the movie tapsee.. I literally had a quarrel in my ladies wassapp grp if divorce was justified just for 1 slap (then i hadn't watched the movie even) and after watching the movie, it exceeds my expectation , the way it is shown in so many small scenes where the message is so loud and clear. It is justified in every way to be honest even if it is emotional abuse forget about physical. So kudos to the team n you🧡💛", "officiall.yb": "#Thappad", "saianushalr": "Pretty ❤️", "csethiya": "A real appealing film.... And a nice message.... Loved the way... The story represents the truth that prevails... And self respect is the most... Great message@taapsee#thappad", "___nishu___41_": "all black😍😍😍😍", "amruta.vd": "Loved it ❤️", "accounterror000": "There are some movies that you can relate to and get awestruck to such an extent that you develop almost a sense of possessiveness over it. This is one such film. So beautifully put! How the selfless patience of a woman is sometimes underrated and how a suffering is accurately understood by the host only. One slap: infinite realisations. This shall always be a special movie to me. For the context I watched it, with the people I watched it with and above all, an innovative and much needed concept! Ek tukda dhoop has my heart! For giving such soulful melody to the incomparable struggle of attempting to pull a falling relationship back from the edge. Keep gifting us with more of the kind. Too PROUD! Take care! @taapsee ♥️♥️", "bonjirlynn": "Such a good movie ❤️", "nishuda25": "Hi Taapsee, just completed watching #thappadonprime and writing immediately a compliment note for you. What a performance yaar !!!! As a performer one wil always envy you the characters you have got to play in your career as of now. This one was such a natural character which can b found around us every day. But the decision which she took was bold and out of this world. The narrative of a movie was so beautiful and hats off to Anubhav sir for this. That dialogue \"nahi maar sakta\" is still in my head and not coming out at all. Literally it's a THAPPAD to our society...... Keep performing beautifully as always you do. Thanks.", "dikshitha_karahna": "Thank you for this film....", "10_04_1997_": "I loved this film so much..🧡 And your performance was speechless ❤️", "hemavaland": "Great concept 👏 it comes down to women what they will accept and wont accept. Moreover as portrayed she must certainly take a stance for what she truly believes is unacceptable ❤️", "nikkuosingh": "Really enjoyed the movie with my wife. Very powerful stuff here. Great acting and performance !!", "hitakshi.gandhi": "Hey.. I have never commented on any star profiles before but the movie that I just finish watching compelled me to do it. Speechless 😶..!! #thappadmovie@taapsee", "akasharya9395": "Tushi cute ho ji", "nabhan221b": "Outstanding perfomance of all artists... hats off you all... especially Anubhavji.... 🙌", "pranali_rane08": "The movie was just ❤❤❤when you had that slap.. Our reaction went from 😐 to 😦..we loved you tapsee 😘", "tanzila.beg5822": "I saw that movie and it was amazing , which is bassed on the housewives , who sacrifice her own dreams and desires on a man and his entire family . AND FINALLY, her husband show her value with just a slap !! i know it was happen by mistake, But why even by mistake ??@taapsee", "azharuddin7432": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "muskaansehgal05": "Amazing movieeee💖💖💖", "mnharika": "👌👌👌👌👌👌👌👌👌👌 I looooovvveeeee it...... We r just crying litrely n our eyes is swollen now💕💕💕💕💕 very good work all of you 👏👏👏👏", "itz_yashi__": "❤️❤️❤️", "sanwal.nidhi": "Such a deep thoughtful movie... thank you for the experience 👏👏", "kiransharma2963": "❤️too good tapsee", "payel5662": "I have a ques. Not related to movie. Movie was awsome no doubt but I just wanted to ask y were ur eyebrows were so thick and dark ut looks so odd. Full artificial dikh raha tha. House wife ho toh eye brows aise rakhna zaruri hei kya. Working woman ka thin and sharp hoga!!!!! 🙄", "storiesofescape": "No words 🙌🙏", "taruna108": "Take guts...mam..", "bakers_board": "Loved the movie,, every Indian family should watch this.", "akhileshakhilesh583": "I think your expression Thappad", "vaswanilata": "❤️❤️", "_kritika_nagar": "👏🙌❤️", "apoorva_bangur": "Best Movie ❣️❣️❣️❣️❣️", "shivamsingh__0092": "Awesome😘", "d.e.h.i.n.i": "Great movie!", "aakashh007": "Sari burai ladko me hi kya madam ha...mujhe to bilkul nai lagta ki dil se banai gai h ye sirf one sided story h or kuch nai... aj ladko ko jis trah se fake cases me fasaya jata h kabi sursat mile to uske bare me bhi apni aadarshwadi soch bataiye...ye propaganda mat failaiye ki sirf ladkiyo ke sath hi bura hota h...😡", "arsuyzeefah": "❤️", "roving_soul_": "Oh i can't tell you how amazing this movie was! I was planning to watch it in the theatre but because of covid outbreak i couldn't go. Today i saw it on Amazon Prime and i can't tell you how amazing this movie was, the dialogues , the acting the entire movie was so great! I am so thankful that bollywood continues to make such movies coz people really need to see this. Also i loved your acting ♥️ i wish you continue to do such movies in future and speak for numerous women out there, who need to be heard.", "srbijapure7": "Ma'am ur acting 👍👍👍👍👍👍❤️❤️❤️❤️❤️", "anmolgupta562": "baat ka batangad banane wali movie", "koyel1998": "It’s amazing you are so natural in the portrayal", "priyark283": "💖💖💖💖💖 nic", "love_looped_": "It's it's it's.....awesome💕", "anushkadwivedi7": "Amazing movie Taapse!! I loved your acting so much🔥", "suptibose": "Thank you for the movie Thappad🙏", "karandeep20": "You nailed it❤️❤️ The script is too good.. It makes me cry.. Dil ko chu gyi❤️", "lishasaggar": "❤️ it !! You killed it 🔥", "theshelby08": "Definitely a must watch movie", "crystal.soul27": "Loved it, absolutely loved it ♥️♥️..... people may think its just a slap what's a big drama there..... You won't understand unless or untill u be in there shoes 🤟 @taapsee", "poornasree96": "😍just love tis film.", "french_toast_93": "Phenomenal movie 👏👏👏", "geetameena16": "Hey Tapsee aap Amir Khan sir ka contact no ya koi e-mail address arrange kar sakte ho please...", "rusteangi_ruba": "Ohh no...I really should say that i wasn't expecting that sort of an end....the act was good but I don't think that slapping is something big kinnda mistake for a lady like amu..she's really strong and cool one but y did she changed like dumbass pagal one after she had a slap from her husband...and moreover her husband asked her to slap back but amu wasn't ready to do that...please don't convey such message cause there are lot people who's really keen into have such sensible mind which later turn into destroying happiness of lot for ones happiness....", "wannafuckuh69": "See my story fast", "el_arang26": "Awesome movie😘😘", "bvashwini": "it's one of the best movie.... loved everything about this movie..... hopefully people get the right message out of it.....❤️", "pankhurimathur_": "loved it. so inspirational really ❤", "g.k.5333": "Nice this is one of the most likely movie of my like .... I'm telling everyone to its not about sory ..All about love, happiness, ....Truly appreciate this movie...Love it", "_saumyasahu_": "Dil tak phoochi hai ma'am❤️... Your performance is flawless, you really are inspiration. Thank you ❤", "_.kaybe._": "Watched it ...and it was really amazing and i learned a lot u made it real ❤️", "arjulala": "cutipie😍", "jhakaas_bollywood": "Aap bahut hi badiya film banaaye hain 😍", "prajvanshi": "Amazing movie", "mehnaz.kaur.75": "Hi @taapsee salute to you I just watched Thappad really amazing 🤗🤗🤗😘😘😘", "piscopixie": "Watched this couple of days ago. 👍 @iamtaapseepannu Nuanced, held your own, and well supported by Ratna Shah and others.", "mepournami": "Loved it ❤️❤️❤️", "alisharachel.k": "Post watching thappad, I became a big fan of you and the movie! 😍", "oceaancalme": "What an amazing movie ,n your acting in commendable 🤗", "rathi.vijaykumar": "Such a soul touching story...Awesome Tapsee !!!", "g_h_u_m_n_a_m_gautam": "Sorry! I couldn't keep my promise due to this lockdown. But l am sure of watching it today❤️", "raj_angshu": "I just couldn't take my mind off from your amazing acting skills and the impression that it left on my mind is just amazing ❤️ I just loved your craft @taapsee", "arohinichowdhury": "You are my favourite throughout ...but your movie thappad it just blew my mind ... Still there are insane people who do not understand this sensitive issue...", "paridhipathak": "@taapsee mam the way you have acted 🤗 awesome ❤️", "suhailkhasuhailkha": "Nice", "inspirare2020": "Wonderful movie 👏👏", "mohiuddinbiswas05": "❤️❤️❤️❤️❤️❤️", "chauhanasha900": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "urmil_1412": "One of the best performance of yours. This movie has changed my way of perception where every body are self centred... telling their own problems to us but no one ever cares for a person who actually suffered a lot....thanks for making such movie✌️", "guggillaramkrishna": "Beautiful", "pkaur2444": "Didnt like it. One slap blown out of proportion. Another movie made where women are 'poor me' victims. I am also a woman, but im over these roles.", "saggitarius_14": "Great movie... Must watch really💯", "slayer_.x._": "😭😭u nailed it", "__purvaaaaaa__": "@gite_kanchan ♥️", "suma_gandi": "I just watched as soon as it got uploaded in prime,am happy for you taapsee for working in such a beautiful project 👏👏👏❤️", "leenag.1": "Superb movie yarr 😍😍😍😍😍😍 wowwwww Tapsee 🔥🔥🔥", "trivedisatyendra": "Taapsee - Nice relevant social movie. However the reverse happens, is happening as well and in the movie - it would have been better if the reverse was also shown like a separate thread in the movie with abuse being a gender neutral issue.", "sachin_kuriakose_": "❤️", "rdhwaghela07": "It's beautiful movie. ❤️❤️can relate to ur character😢😢", "beenu.kapoor": "The film has given an ability to cut through the layers of compromises that are insignificant one at a time but a huge pile over time (just like death by thousand cuts). Taapsee - Amazing portrayal of happy go lucky character pre-thappad and the thoughtful, deep character post-thappad. Well done. A pleasure to watch", "kabirchauhan865": "Chutiya jaisi banai hai chutiyon tak pahuch rahi hai 👎", "saral1338": "Story line is not so strong . Movie after the interval is dragging . Tapsee s acting is natural , worth watching . In many scenes , she loses out on facial expression , which she needs to work on .overall it's a 2 star movie . Effect of Hariyanvi accent can be seen in the dialogue delivery of Tapsee . Overall a weak story line", "renu_singh99": "Love this movie...love it😘😘😘", "shalini_dutta34": "Amazing movie I literally cried amazing loved iy", "ujjaval81190": "You have proved it with your selection of films.More power to you to continue doing different films.", "thegraphicsgeek": "Loved the film ❤️", "xoo_0019": "Dekh li🌹", "pranshulzen": "So true it really impact Alot.", "impriyankarao": "great movie....with great impact ❤️", "realsaifali_": "ALLURING ❤️🔥😘", "apneet_sandhu": "Hey just watched you movie... it is surely the best movie 🔥I have ever seen... you did great work❤️❤️❤️", "thekhan_007": "Oye ye Thappad to dill ko laga😘", "sunshine.__14": "Thankyou @taapsee for doing this. No one else could do it better than you! I don't know this hit hard. I had tears and just couldn't stop! Tho it was just a role for you I did want every women to be as strong as amrita❤️ There's no inbetween", "aishwaryaa_balid_polekar": "Yesterday I saw this movie. And i was like shhh shant raho sab.. because I don't wanted to miss a single scene. Your performance is amazing throughout the movie. 10 out of 10. God bless you mam. Keep inspiring and keep doing such kinda movies because it teaches lot of things. Loved it. @taapsee", "mustafa7337": "This movie should have been declared tax-free.", "fkahiazn": "@notnadiakhan wow", "chandran.rashmi": "You are a flawless actress and so consistent each time . Movie is very touching and realistic . Very well done", "jikijikichi": "Saw this movie... @taapsee, your work has been amazing, you made it look natural. I hope everyone takes this movie as protection of self respect rather than pursuit of whims and ego. Self respect is what Amu pursued, not intolerance", "jasleen_jasleen_": "Super crazy movie", "rawat.davil.79": "What a movie..........😮😮😮😢😢", "jask_awesome": "Really liked your movie.❤️", "yuukta.g": "One of the best movie I have ever seen. @taapsee mam you were just amazing & also the song “ek tukda dhoop sa” has touched my heart, I’m listening again & again. Thank you for making such a good movie❤️", "kiranmtl": "An absolutely wonderful performance as well as direction; the subtlety of the one-liners of sexism that are sadly commonplace, the nuanced characters, the powerful quiet moments (reminiscent of Irfan Khan’s style of powerhouse acting), all around beautifully done!", "bhattacharya_neha": "Dil se dil tak pahucha hai Mam, kaafeeee andar tak. I love you and all Thappad team for making this film. Love love.", "anudy123": "Dil tak pahuch gayi 😍", "katty_forever21": "You really did a great work @taapsee ma'am (loved the movie)", "hemant_bhrdwj": "Awesome movie", "drpruthvirajhanchate": "Just finished watching thappad ... acting is outstanding and movie is simply great ..but still hate you on your shitty political view...#dilemma😂", "mrs_chehal": "@taapsee Well done! Just the movie to be proud of 👏👏👏", "ankita_modak": "Superb movie..superb work @taapsee 👌", "kotianmanisha": "❤️❤️❤️", "hiteshwargaur": "Such a beautiful message. Great performance 👏", "bhagyashree_bavkar007": "Must watch 😍 itz amazing ....the message as well as the performance 💕", "sonimishrajha": "Taapsee aapke saat thappad na ....kai dabi jubaan ki aawaz banenge.....kai mard sudhar jayenge.....jo film k last time mein galti mani na .....wo niji jindagi mein shayad jaldi maan janalenge. .. thapppa marna bura nahin lagta...... Galti swikarna tauhin lagti hai.... Hats off....", "rabiadawra97": "mam just saw the movie ❤️ seriously loved it ❤️ . phli baar msg kiya hai kisi actor ko❤️❤️", "kiddofaroo773": "Great job. One hell of a movie👍🏻👍🏻", "didarhosenn": "My Favourite Actors😍😍", "dkimdeepak": "Irony is, In movie you are depicting that no one can slap a woman not even single one. But for name and fame you are getting it real 7. Too deep.", "alfi_mulla": "What a movie!!!👌🏼 Just Amazing!❤️", "piiku91": "Watched the movie. Im your big fan but the movie was so so.", "yadav_amitt": "Tapsee you genius.. I have watched it and loved it. I never thought that a movie could be made around a slap. But you did it. Everything is great. Every character has its significance, every action has some meaning. I feel sorry I missed it in the screen.", "pratyusha23": "What a movie❤️", "jessonamission": "Watched it yesterday with @life_nexttt_door. It was a powerful message thank you for choosing this film and being the voice of what many women are going through. 💙", "shazz1321": "Loved the movie... Just finished it.. it wasn't a feminist movie or anything.. it just showed what we Keep on ignoring in our day to day life.. truly all we want is respect and happiness.. it had a beautiful message and every character played their part amazingly..", "amanchaudhary93": "@taapsee touched my heart ❤️ loved it", "amelcharu": "Mam, what a great movie👏👏 you did a wonderful job!! 👏👏", "gauriwahi": "Loved the movie....n u ofcourse.....n hats off to u for this❤️😘", "anshshree": "Just loved it...thanks for letting us know every single detail we ignore... being married to someone dsnt give them the right to treat us like shit...i wish if everyone can act like the way you did... and can choose a better life for themselves🙏🏻", "swatii0624": "Hi Taapsee I just watched your movie tappad on Amazon prime.. wanted to congratulate on your superb performance.. also wanted to know.. what did u put in your tea.. that leafy thing😁", "nagarajachetan": "@taaThe performance was impeccable. This character probably could not be better emoted than you. Deep respects for for all your work. The Indian Nora could not have been brought out better than Amrita by both you and @anubhavsinhaa . I am none to congratulate but if this work touches those men and brings tears for the dreams their mother's have lost, the wings the wives have cut , the movie which does not end even after the last scene - it goes without saying that this is one of the great movies around.", "_yusrasultan": "The movie is outstanding... Your act is real like always...❤️🔥", "garima1349": "This is The movie... Rightly said..Dil se banayi hai..just now finished watching...I can't say that I enjoyed the movie... because the movie...the whole movie..kept me busy introspecting myself...it gave that smirk,that vaccum, those tears n pinch of pain throughout out..it will keep haunting my thoughts for long till the time I find my answers..I just wanted to say u thanks for this....not for acting so good but for choosing to do so....m glad I watched it...I can't say if it will make things better... easier... amicable...or the other way round but yes..it will bring change for sure..@taapsee", "smarty_flirty_1034": "Beauty", "sparklesupi": "Loved the movie and your performance was brilliant❤️ Had missed watching it in theatres when it was released. Thanks to Amazon Prime was able to watch today!☺️", "lalita5082": "Great work✌️", "luv.sharma28": "So good movie. I can't just tell how much i loved it🥰", "neha_tavargeri12": "One of d best movie 💗so beautifully depicting women's self worth👏", "amir.mathu.9": "Love you", "__varma__": "It’s an amazing movie. So captivating. Everything looks so real, beautifully shown! This was needed. Big time. Glad movies are now becoming a platform to show such stories. Thanks to you, for doing this, no other actress could’ve done it better than you. You’re so absolutely real in the movie.", "missbyriani": "I loved the movie @taapsee ! ❤️ I'm so glad you chose to do the movie. What a classy movie, handled every issue with such subtlety. I admired your character especially, how gracefully she handles the whole situation. So inspiring! Thank you ❤️", "poselikerutuja": "Movie..is tooo goood tapseee...wat a guts o take such topic...hats off to u for selecting such scripts...❤️loved itttt😘😘", "slow_togeteaten": "Vicky Kaushal ko kyu THAPPAD mara tha .", "mantra_mukta_mayoori": "So well made. These are the essential neo realistic movies we need today. And a very natural performance by you, Taapsee. Kudos🌹", "kavyamanjoosha": "@taapsee wakai mein dil tak pahuch rhi hai...Great movie 🙌🤗", "vbon_8": "Watched it with my family before even seeing this post of yours. The movie's really really intense. Most importantly because I've done this shitty thing in my life. Never proud of it. But everytime I lose my mind I'll probably have a better control on myself. Overall this will extend to other facets of a person's life.", "poojasingh81020": "Awesome movie", "monalkashive": "@taapsee this movie is amazing and ur acting was real# I loved it❤️", "_modishliving": "I love the movie..truly great acting.a must watch.@taapsee", "officialpuneet08": "👌👌👌", "goyal9164": "Hiiii DIDI or MAM.... aj mene aapki south indian flim mard ki zubaan dekhi... Didi aapne usme kyaa acting kari thiii🔥🔥🔥🔥...... Mtlab maje aagye dekh kar.....Kon kheta h ki bina fighting ke film hit nahi hoti.... Par aapki acting se wohh film mere dil me hit hogai", "sanam.sharma.delhi": "Great movie.....with deep message.... absolutely love it... great performance by all actors....❤️❤️❤️❤️", "_wagle.sabin": "Heard so much about movie that it is feminist and parody of Arjun Reddy before, but loved the movie, seriously!!. Loved the way it was presented. It just presents a normal life gracefully. You did amazing work @taapsee ma'am 🙂", "annahhdavid": "Watched and Loved 😘", "andrewpandainc": "bhen ki laudi", "cutiee_fairyy": "Jhaksssss 😍😍😘😘❣️❣️", "amrita.pillai": "It's a great film..moved me!😊", "_mahima.monga_": "@taapsee such a beautiful movie... Loved it ❤️ 😍", "archana.anand03": "Just watched THAPPAD. It's amazing. You justified the role so much so that every other women wud relate to AMMU. Nice script, graceful acting.The great kind of balance is shown throughout the movie which makes it more real🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌@taapsee", "yogya_2008": "Yes i saw... it was amazing.. nice movie for the whole family❤️", "sivakami_sizzy": "Again a best movie 👏👏👏👏", "ketki.tambe": "You are amazing❤️", "heyitsujjwal": "Such an emotional movie. You are brilliant in every movie 😍❤️", "bhavana_2k1": "Watched this amazingly touching film 'THAPPAD' yesterday.I jus fell in love with the way this character AMRITHA was written and ur mind blown performance made it soo complete . At some point I can't stop my tears watching some scenes. And believe me mam, soon after I have completed my chin is wet and I realized I was crying.More than anythng i really have lots of respect towards this film.This film remains in my HEART FOREVER❤❤", "vaishali.moghe": "❤️❤️", "jashan_xx": "❤️❤️", "rach.beee": "👏🏻loved the movie", "sukhvirsinghkang": "Very nice move ❤❤", "poojadhaduk": "Wonderful movie 😍😍😍😍😍🔥🔥🔥", "anwer_haseeb": "🙌❤️", "_muskan_1122": "NYC movie", "this_is_anshul": "Mam, amazing work😍😍😍I loved it🙂", "_anchal_fd_": "I watched it...Amazing concept ..And your were supperb...👌❤️", "techbykhatri": "This time u Really maked a irrelevant movie seriously u are going to destroy many relationships", "shalininairsd": "Definitely you did justice to the role @taapsee 💖", "supacoolmom1": "Watching it right now, what a coincidence 😍 💖- thank you so much for bringing awareness, keep making these, love you Ms. Pannu @taapsee", "vallabhasantosh": "Tag Sandeep vanga😂😂😂😂", "deekshyabk_sukyi": "❤️", "himaaalay": "Beautiful movie ⚡️⚡️❤️❤️❤️", "aparnasoni07": "❤️", "umesh.garg_": "What a movie❤️❤️❤️❤️❤️❤️❤️❤️", "kanchangayri": "Looking very beautyful", "devansh_garg31": "Awesome acting par Bohot hi bakwas plot tha", "shilpa_sagar_": "Pwolichu muthe", "akanksha.i": "Amazing ❤️", "twist_ed_myind": "❤️❤️❤️", "kotharimumbaiindia": "Congratulations tapsee how u r acting so good. U r awesome. Thappad is very nice", "nehatripathi97": "❤️❤️❤️❤️❤️", "manishmeshram51": "Amazing movie..", "jansheenazhar786": "❤️❤️❤️❤️", "admiration_enthu": "Great movie @taapsee 👏 ma'am loved your work❤️", "abraham_kerkar007": "@taapsee All great movie nice msg 🔥🔥🔥🔥🔥❤️💯", "shiningswati54": "In this movie every seen every words have many meaning. Yesterday after seeing this movie in teenager I learned many things #naarisakti❤️", "omprakashyadav571": "👌👌👌", "rathodbhavik786": "🙏", "grammer_94": "It did reach everyone’s ❤️🤝", "harsh______rathore": "I saw thapad, this movie really really emotional movie, I feel this story inside, and from this movie some people not all,means a part of some people will learn what is love, what is sorry, how to say sorry, how to feel others people happiness, sadness, wishes and will understand others presence in our life in everything, every moment, every work and happiness, because some people do everything for us and not thought about self because they forget everything which related self, only think about us, so finally I want to say a big thanks to you for this movie ,and I Am sorry for any incorrect sentence because I'm not a master in English 😊and again thank mam", "___plakhya___": "Free main dekhna hain? DM me", "vijay.palsra.5": "Beautiful 😍😍", "sushma_kaivaram": "Need This movie a big thank you", "moments_beyond": "@taapsee wow what an amazing movie so heart touching. Rula diya yaar aapne. I'm in love with your suit and bindi attire♥️. Keep shining keep rocking 💪 and Thank you giving us this movie. It made my day.", "manisha02224": "Very slow movie though it convey social massage", "minonza_sharma": "Good movie ma'am, self respect is important and why women of India are taught to that it is normal to be beaten up by their loved one, ignored by their loved one. Nobody is taught to stay independent and happy alone. I loved the movie. Inspires me how to live my life ahead.", "win_____zzz__": "Sorry dued but ye movie meko to shi nahi lagi because ek thapad me bandi ka pyr khtm ho jaay shadi ek samjhota thodi hoti h dued", "mzaidkhan429": "Very.beutiful", "neetakanpau1994": "Awesome movie, great performance. I enjoyed it I’m going to watch it again and again Taapsee great job, thank you for a great cinema. Love your work. Big fan. I also watched some of your south Indian movies .", "ruff.book": "oHH SOrrY ...I fORgOt sOMEthiNg....u R miNdBLOwiNg ACtOR...nOT in tHIS mOViE bUT eVEry mOVIE....cHAhE. WO naAM ShABANA....hO....yA piNK....yA mULK ...yA........👏👏👏👏👏", "rajinder_thakur1": "never settle...amzing script 🙏🙏", "pooja.khokhani": "Your performancd is amazing .. this movie is outstanding .. 🙌🙌🙌", "spellbound18": "Dil tak pahuch gayi❤️👍🏻👌🏻😘 loved it and loved ur acting as always!! Superb!!! Thank u for such a movie!", "khahokpa": "Just watched thappad on prime vdo, loved it. Every woman should watch it. 👏", "saifi2700": "💯", "mahajan_micky_": "I also gives u a thapadh for this thapadh", "ankit.sharma.89": "Mam you have done an incredible job in this movie. Just Loved it ❤️", "haresh.jain.85": "My friend slap his wife 3years ago,and on coming Sunday,both went for shopping and he convince his wife with some gift,life is running like that,after watched this movie,his wife filled a divorce case against him asking how you can slapped me.good going taapsee,ese movies se Ghar destroy ho rahe he.", "bandsnehal": "@taapsee I have watched the film. It's just awesome. At last,my eyes were filled with tears. Great movie, great acting, great execution😘. I just love u mam😘", "poojarani.1990": "Great work...truly admiring", "jhanfromjhansi": "Watched ❤️", "_.bhumikapatel._": "❤️", "nakulndsharma": "😘", "vd2408": "It is such a beautiful movie ! Thank you❤️", "shailesh_aswani": "Just saw the movie and what a great work done by you..🙏 #lovingit😍 @taapsee", "dumptyhumpty55": "Loved the movie", "gurjyotsethi17": "Pohch gayi g @taapsee @diamirzaofficial", "harshee112": "Awesome movie", "gb_1808": "Loved this movie @taapsee 😍😍♥️ You were awesome...🔥🔥", "righdeshwari": "💙", "varun.kukreja.904": "Unless you stop supporting anti-national elements and ideologies, time will be the one giving you this experience", "cookeatburp.official": "This movie has so much more than just a thappad!", "_get.me.a.coffee": "❤️loved the movie", "ojashwiii": "❤️❤️❤️❤️", "charubhaskar": "Amazing movie! You're outstanding Tapsee ♥️", "narenraghu": "U have taken ur acting to next level in \"Thappad\" especially after post slapping scenes, ur body language spoke volumes ...", "sajadhameed": "Watched it. You literally killed the social norm. ❤️", "ekta.m.d": "Gonna watch it tonight.", "piyagupta024": "What a beautiful movie 👏👏👏... In my teenage whenever this question crossed my mind, what will I do in this case??? I had the same response \"divorce\". Love is not above self respect... I could relate to this movie and still believe the same \"It's not just a slap\"... Thank you for making this ❤️❤️❤️ @taapsee @anubhavsinhaa", "nasakhtar42": "Domestic violence is horrible suffered it for 17 years one slap is enough to many well done you deserve absolute Oscar for this performance really bought my time back when I took a stand my mum used to say and this is in England \"its ok go sort it out\" no one can ever sort out my wounds I have bought my 2 son's and 2 daughters up to respect and hitting or mentally abusing each other is not love and no one has the right. You got this in the bag girl👍", "ratankarnatakam": "Thappad se dar nahi lagta sahab, Ab Divorce se dar lagta...🔥🔥", "sakshi_paunikar29": "What a movie ! ❤️", "ritz8527": "Hellooo ma'am....what a movie ma'am...what a movie....u were really Soooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo good...I am so inspired by u.......u r my ideal ma'am...ur acting in that movie...soooo good ma'am...the way u expressed every emotion...........hattsss offf ma'am... ma'am please like my comment...I am ur huge fan.....bahut ache ho aap..aapko movie gajabbb haiiiii.....kam shabdo mein bhaut kchh keh gyiii ma'am........m kal poore din emotional rhi....I loved ur movie ma'am..ye sbke liye ek inspiration hai........apni respect apne haath mejn hoti h.... bahut achi h ma'am...love uhh ma'am 😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘💞💞💞💞❤️❤️❤️❤️❣️❣️❣️❣️❣️", "momskitchenbykiran": "Watched it yesterday, really beautiful film with great message. Though my mum had been curious throughout the film about the leaves that u used to put in tea...if u could tell which plant was that n what benefits it has with tea...if u know.....😋", "rajsingh8438": "Just finished watching Thappad! What a great movie. Your performance was awesome.", "aaish2805": "Thanks for this movie too! 👍", "itzz_simran": "Liked the concept alot but disappointed with the ending of amu and vikram.. She must have forgiven him because in forgiveness God lives.", "diksharawat14": "Amazing movie!! 👏🏻👏🏻", "wagdaredahake": "Loved the movie...dil tak phauch gayi🙏", "dua.bint.jameel": "And you did a wonderful job ❤️", "viney_raina": "Awesome movie👌👌👌", "sweet_heart2204": "Congo mam m ur big fan and i hate ur trollers specially aashish who trolled u a year back and was representated on mtv", "grace_unbraided": "Bro u don't know how much we love♥️", "actress365": "@taapsee really speechless mindblowing performance👑- no doubt👏..specially the dialoge delivery at end👍....but this theme is so untold in general & not so talkd abt fact. .this is so easily ignored in families, in the name of so called tradition/society.🔵 being a movie buff and ur fan(read DHF die hard fan) , am nt revealing story here but at end my heart felt bit sad - yes u cannt ignore n just move on..may b he cud/wud had said/done something the same night, that cud be the reason to patchup & make a diffrent happier ending..not in name if family/tradition but to add a ray of hope/positivity in dark plots...hmm or thats the secret weapon to ignite thghts/emotions in ppl/society......anyways great effort n team work👏👏👏❤️❤️👍👍👑👑🔥🔥🔥🔥🔥🔥🔥 [a tribute for you posting tonight-anyways you might probably not see/read dis post-dont smile we all know it] be safe n healthy🙏", "guptacapt.rahul": "Wow❤️", "ankita.todariya123": "❤️", "hishamabdelkhalek": "What a great performance ❤️", "eternalrohit23": "One of the most sensible movie...🙌hats off Tapsee mam", "wiz.apps": "verry nicee movieee❤️, love itttt✨✨✨✨🔥", "that_mohitrajput": "Amazing script with amazing actors♥️", "_pooja_sawant_": "Beautiful❤️❤️❤️", "anchal1927": "Amazing creation @taapsee mam😍 Just loved the movie in every possible way. Thank you for doing such amazing films always☺️", "iron_muscleboys": "🔥", "__kajolkirti22__": "Was so eagerly waiting for this movie.... I can't express in words how beautiful this movie was❤️.... And how beautifully this movies has been directed... I am damn sure that many of them would be connecting with it and would change many lives and \"reboot\" themselves for a better life. It's a master piece... Keep going ... Love you @taapsee 😘😘❤️❤️", "ashish_guptaz_": "Dekhli aaj maine.❤️ @rohit__kumar1080", "sharathchandra_goud": "Great movie. Ur acting was so real n natural to every situation n u lived it 👌👏👏 @taapsee ♥️", "goelpriya20": "😢😢😢", "rizwan_dc": "Definitely dil se bnayi thi ye , it is so clear that the film is made with more intention of delivering the message rather of profit earning motive, you were soul of the film. And i condemn the message you gave ❤️", "suresh_wadhwani_1": "Just saw your movie Thappad... and I must say it was one of the best😊 Again I am impressed with the way you chose plots / storyline... it leaves an impact and make you learn and ponder on the subject. Waiting to see you again in jaw dropping story line. Way to go👍🏻", "jitha.j.a": "Finally saw it.. Amazing movie.. Killer performances by everyone.. Especially the dad n daughter moments @taapsee 🤗🤗🤗❤️❤️", "icingbyharleen": "U were amazing 👏🏻👏🏻👏🏻 Loved the movie n ur performance 😍😘", "vandy.kk": "I watched this movie today and movie was amazing and I m Vry much inspired by this movie that no one can hit any women.. and u r Vry well execute that movie mam .. good job 👏🏻 👍🏻 😘😘❤️", "chaitanyakulkarni10": "Truly Amazing Work... 👏🏻 Keep it Up...! 🙏🏻", "isha_8807": "@taapsee ,just watched Thappad and yes you are right - ki ni maar sakta. Its not only about the thappad, a house wife has been taken for granted from decades and best part that they don't even realised because they have been taught it part of their responsibility. A big thanks and congratulations to the whole team and you. I always urge the house wives around me always value and love themselves. The family is from you and family need to understand this and respect you.", "raksh_0504": "I don't think u will be reading this also...but i must surely mention how good this movie was....i am just 16 yrs old but this movie taught everyone around a lot ....of how to give equal importance to a women as much as a man in a society....n for my good i hv been almost raised by 2 beautiful women(ma n grandma) ......thanks a lottt for this movie", "ayushigoyal23": "Boring movie 😭", "aqaiyum429": "Beautifull....in one word", "45_mk": "❤️", "muskan.gupta1": "This film was truly wonderful... And yeah it did reach my heart😍", "sneha.thakur": "I never comment to anyone abt wat i feel after watch any movie butttt taapsee ...Thank You... touch my heart", "trishawadhwa_": "beautiful", "ahuja.ritika": "Me and my husband simply loved the movie 😊", "sneha_083": "Loved it ❤️", "aadithyanarayan10": "Idiotic movie logic less movie", "sweetsijo": "Awesome movie ....everyone should watch it", "shivanimassey1996": "❤️", "sandy18481": "😍", "anju_9892": "I loved the movie @taapsee. It clearly defines the behaviour of men in our society...I think it's not only the husband but also some boyfriends who does and never ashamed of doing this...they think it's their right. I hope yeh movie k baad unhe samjh aaye ki \"Even a slap is not allowed.\" I am glad that our Indian cinema is creating which has a positive message. Once again... love you and keep smiling ❤️", "rimi218": "I really loved d movie", "selfdiscovering99": "😍", "shilpisinghgotan2011": "Really heart touching & u did gud job", "anjalimishra1492": "I really appreciate you @taapsee for making this movie. After a long time , I cried over a movie. You have done a phenomenal job!! ❤️❤️👍🥂", "little_mrs_meow": "Watched it! Very good film👏🏻👏🏻", "tinabhateja": "Thank you for performing it so beautifully that evey emotion spoke out loud and welming....You are indeed Beautiful❤️ in what you doo🤗 Just watched it on Prime...thank for giving more reasons to love you🤗 let your charm always blossommm💖", "__vaishalidwivedi": "🙌♥️", "musafirhuyaro": "Amazing movie @taapsee . Your acting convinced us that it's not 'just' one slap. Kudos 👏👏👏", "ankit.4221": "Man outstanding work👌👌🔥🔥", "rohit05.js": "@shahzad_alam_22 @aman_verma_1997 @mohit.chaudhari.739326 one of favourite movie mam...👌👌👌😂😂😂😂🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣😂😂😂🤣", "shalu_06": "Thanks for this film🤗👍", "sidhantbastia": "Pathetic movie and the plot just wasted a chance for us to show how domestic abuse should be countered...u kind of made a joke out of it by stretching the issue in an unapologetic way", "5za_20": "Saw thappad yesterday, and wat a movie,,loved you in every bit of it!! Great cinema❤️🙌@taapsee", "wadekar.mansi": "Amazing acting 🔥🙌🙌🙌", "bhavana_10301": "Really loved your movie usne thappad mara hai nahi maar sakta 😌", "_shan_2812": "Must watch movie , I felt so connected with movie I dnt know why, I do think like Taapsee’s character in this movie since childhood, it’s not about being equal with men.. it’s about how much we respect n value each other .. shouldn’t be taken for granted ,. Thank you for such a wonderful movie 😘 I had tears in my eyes end of the movie .", "ekta.bhumpmir": "Watched Thappad today @Amazon Prime Its freaking time now to change our belief system under caution. Vent out the fear we are imbibed with, time to introspect with what our mothers and grandmothers taught. Do not carry heavy baggages of compromise. Do not make abundance adjustment with your respect and happiness that you messed up with your brunt soul. All good books state that you can love others only when you love yourself, you can make others happy only when you are REALLY happy. No more lies to yourself. Be amicable to you. Be resilient. Gazed skyward and proclaimed to be an ardent lover of yourself. Be maniac to you bcoz u r indispensable. I know its not that easy because of societal issues. But let us start with us as WE make the society. Watch the movie ,then do share the post. #ChooseToBeHappy", "harbhagwan_rohra_": "👏👏👏wonderful movie, you rock tapsee", "bhawna_melodiesforever": "It has become my favourite movie of all times ❤️❤️❤️", "ketkisarange": "What a movieee ❤️❤️❤️", "13_uk_wala_yaar_": "Mam recently saw thappad great peace of work nd dialogue delivery and narration was mind blowing.", "sukrutha_reddy_": "Just wowww 🔥🔥😘😘😍😍", "purbali": "Thappad is a film beyond the story of a single slap. There are many aspects in this film. Obviously when there is topic about a women's dignity and modesty a slap is not enough, need to commit more serious offence otherwise it's all overrated. Such a pity thing education is bounded within pen and paper when I heard such reviews.. To such women stop it in the roots being a woman is not a weakness.", "akanksha___03": "What an amazing movie😍😍😍😍I literally have some next level for you..big fan😍😍😍 learnt a lot from this film❤️❤️❤️❤️❤️", "ajay_patel_lucky": "Awesome Movie Ma'am. ❤️👌👌👌", "tejasviaahuja": "I would say one of the best concept and best acting of complete 2020 I wish for the success of this series.I never used to watch a single web series because I don't like the web series but just because of this concept I am going to watch it because it's something unique and something ultimate mind blowing. In short I would say I have no comments for your acting actually you deserve Oscar for this my wishes are always with you mam.", "thexperimented_angle": "Watching it right now", "sonaalit": "Hey tapsee . I just finished watching this movie . I had tears in my eyes 3-4 times watching it. I m not a person eho gets emotional very soon but these were the tears of satisfaction. I felt so right about my decision of giving up on a toxic relationship. It was long , a lot of times I thought there was love , it’s tough to find . Maybe I shouldn’t have given up. But i was lost in that relationship. This movie meant so much to me . Thanks for making me feel so right, i would have never felt this any other way . Thankyou so much ! ❤️", "sheetal.18": "I have always admired you as an actor and this movie has taken it to another level. Loved every bit of it❤️", "shweta_0122": "💖💖💖", "abhishek_anand20": "Absolutely stupendous..though I was never a fan of Taapsee but the kind of characters stories you are working on is incredible..loved the movie, every bit of it.. every conversation made a point loud too loud.. You are just nailing it Tapsee a very flawless performance keep doing the good work..❤️❤️❤️🤘🤘🤘🤘👏👏👏👏", "richiewalia": "Bakwas film", "bollywoodsongz": "Follow @mufasathebengalcat for cute videos and pics", "jagishaarora": "मैंने ये फिल्म जब थियेटर में देखी थी तो फूट फूट कर रोई थी. जैसे ही थियेटर से निकली तो मम्मी को फोन किया. उनकी ही याद अा रही थी देखते हुए. हम सबकी कहानी को आपने पर्दे पर बखूबी निभाया है. एक सिम्पल लड़की की कहानी हर लड़की से मिलती जुलती है. शुक्रिया अमृता का किरदार निभाने के लिए. :) मैं बहुत प्रभावित हुई आपसे. पिंक के टाइम भी हुई थी और आज थप्पड़ देखकर भी हुई. आप हर किरदार अच्छे से निभा लेती है. चाहे पिंक हो, सांड की आंख की दादी का हो या अमृता का हो. अमृता का किरदार सबसे ज्यादा स्पेशल है.", "ramoosraj": "What a movie! Strong..and on point.🔥", "rittikjindal": "What a movie mam 💕@taapsee means no words", "harshu1420": "Loved it❤️", "kkkijg": "😍", "shubhdush": "Tapsee u nailed this Role....... When our society will start apologising to Woman for all thr wrong doing.....if you are not opposing wrong by speaking..... means you are indirectly supporting it...... U taught me a lesson today 👍🏻👏🏼👏🏼👏🏼👏🏼", "richasingh558": "\"ghayal too yanha har ek parinda hai , magar joo phir se uddh saka wahi zinda hai!\"", "anyasalhotra": "Awesome work.🤗 One of your finest work", "prabhjotk19": "it was an absolutely amazing movie...loved every bit of it.... i really hope lots of women will gather courage to stand up for themselves and against the unjust as they watch and learn from Amu....😘", "mudita819": "This movie is really inspiring 😍 nd very grt msg to all the victims of this domestic violence....😐 everyone has their own self respect 💯so...one must be careful of their rights and self esteem 👍thankyou so much mam for making this incredible movie 🔥u are always my fav ❤️❤️", "aakash.1902": "What a pathetic movie", "sharmavaishnavi90": "🙌", "sriniwas8647": "@taapsee Watched this movie on prime yesterday, It’s a amazing and the message from this movie for Men and Women equalities awesome. In modern world most of the Men and Women miss understanding are due to the lifestyle they had, we must have to give time to our family and only family because no body can understand much better then family.", "uday_choudhary157": "😂", "sushilkumarjaijan": "Never thought this side of the story....Thanks for changing my thinking...❤️", "uttugunjan": "Watched fdfs on prime.. 🔥", "kangkan.p": "Just loved this movie... what a beautiful performance with a wonderful massage...❤️", "joshiggarima": "what a movie n i love you so much❤taken a stand for me in 2017 shyad galat nahi tha", "archanapatilbharvase": "Watched the movie. Worth a watch.No means No..... How can one slap u because just he is frustrated... Not accepted.. Tapsee u hv done a get job", "priyankakatariya556": "What a movie dear Mam.... Best performance Mam..... Loved the movie....💓💝", "miss_sadani315": "I’ve watched it twice Mam this movie is a true inspiration to women ❤️", "tanya_sharma4273": "Your every movie inspire me to do good thing and make me strong🙌🙌❤️", "sonia_shridhar": "Amazing movie @taapsee so amazinggg", "mr_agaush_07": "Beautiful", "twish1120": "Watched thappad yesterday.. i almost had tears !😍😘 Amazingggggggggg performance ❤️", "priyanka_manna_": "It was so lovely to see you in that movie uh are to incredible @taapsee thank you for making a beautiful movie like this 💞❤️💞❤️", "sharvary1117": "Mam ur so beautiful ....keep being the sam we love u mam🔥🔥🔥😍😍", "komal_2197": "What an amazing movie. What a brilliant performance❤️❤️❤️", "mishrajoy": "Just saw the movie Thappad, it is certainly ur best performance so far. The movie gave an insightful thought process to understand how our mindsets are prisoned and we just want to keep ourselves locked inside the world made bubble. Great movie❤️", "deepansahani": "U can surely act...", "mrraufbooharyahoo": "Hello everyone", "kakadeaishwarya54": "@taapsee ❤ I love this movie ❤. I do think that each and every woman must watch it...", "sejalarora31": "❤️", "pratima_syangbo": "so is it okay to slap for flim????", "vish_k_iaf": "Oooooooooo, slaping a girl 7 times for a Perfect Shot is acceptable, but same taapsee runs movement against slaping a child for their correction....... 🔥🔥🔥🔥", "rahul_omarr": "@taapsee Kal raat dekhi movie... dil le gaye yar tum... awsome", "arthurjokercarnival": "In Super Deluxe movie, Mysskin sir was slapped more than 100 times by the actress to get the shot right. Dedication what makes a scene, actor and a movie to a better uplift. Good movie mdm. Congrats!", "whattikulikes": "Wonderful movie... What a brilliant acting by you😍🤗", "namrata9537": "Super movie ..... nice job😍", "my_invigorating_space": "Every scene made me question the beliefs that are inculcated in gals.Which makes us believe that slap doesn't mean domestic violence !!The movie did show how each women of different classes tackles it .👌", "zainraza81": "I am so excited", "saurabhsingh1760": "So much intense emotions Tapsee", "durga_raute": "I don't want to wish wrong to any one...but definitely wish some male in your family dear one get a slap from a women and in return get fake case of Domestic Violence against him....", "pratima.mahata": "❤️", "diwasweddings_debarati": "You are natural in every film @taapsee", "scorpionwoman_": "Saw it now, cried so hard 😭😭", "roze_picturs": "Dil tak pahuch gayi hai , aate hi dekh li hai , soch raha hu kal , ghar ghar me hai ye natak mardo ka, bless and proud feel karta hu , kitna sabar diya hai bhagwan ne mahilao me ,,, really good work , appreciate your concept , congratulations for thoughtful gift.", "karannn_rajput": "randi rona 😂", "pavanchinna123": "Fan of u", "mahamatnourm9": "Thappad is a great movie I loved the history and spacial Taapsee ur acting is outstanding A1 for me keep making good movies to entertain us big fun of yours God bless ❤️", "swarajya_wheels": "Your are powerful actress in Bollywood who having good knowledge of script / story selection and excellent way to deliver. 🙌", "shreya_3970": "❤️❤️", "manu_doabiya": "Brilliant movie...amazing work done by all the cast and crew...mam you did a fantastic job...👏👏👏👏👏", "vikash09.cse": "Grt work mam", "niharsawade26": "Loved thappad. Sad that a movie which should be criticized is earning 250 Cr but a movie which needs to be seen by every person is struggling to collect even 35-40 crs.", "shreyabhowmik": "Loved your performance ❤️", "mdshakmasum": "❤️", "happy_soul_2118": "Maine kal he dekhe movie on Amazon Prime n its amazing beautiful and i loved your work mam😍😊❤️ you are an inspiration for all the women who want to take her step forward in everything she wants❤️😘", "_bansarithakkar_": "@arsheinbrar literally just watched it ! Real amazing, especially how they depicted all the stories, watch ittttttttt :D", "veerbhan04": "Spectacular performance in thappad", "___mr_decent_007___": "😍", "b.s.jangir": "Very nice movie 👍 👍👍👍", "sukhsidhu368": "👌🙏🙏 movie 👌👌", "princesinghsin": "👌👌", "laxman.acharya.16144606": "beautiful❤️❤️❤️", "aditya.vajpayee22": "Acha pada", "vidish06": "Hi tapsee!! Love from one of your fan !! You were absolutely tremendous and the movie was so touching. Watched this movie yesterday night with my wife @prime . You are a gem in film industry . And also u looked so pretty in saree. ❤️❤️ Keep going. Lots of best wishes and love from our family.", "shivanirajputo": "🔥🔥🔥🔥", "rahul_madaan": "Saw the movie w/o any delay and loved it.. very beautifully picturised and directed... amazing acting by allllll the actors.. every character justified its part BUT Taapsee, you were outstanding 👏🏼", "malvikaferns": "Thank you for this movie", "sh____ano": "Nonsense movie", "thesaini9465": "🌹🌹🌹🌹", "v.a.n.d.n.a_": "Watched the film😍😍 It touched my heart 💖 Well done tapsi 👏👏great actress you are. I love always I have watched all of your movies. U inspires me alot🥰🥰🥰🥰", "archi_karpe": "Friday night I decided to watch this masterpiece and let me tell you @taapsee you have done total justice to the role and thanks for giving us a reality check that how men's are raised to believe that they can hit their wives and how women's are asked to compromise their lives and dream to make marriages work... Thankyou @primevideoin for this masterpiece.. ❤️👏", "reena.sohi": "Such a simple movie with a real deep message! Beautiful movie! You were phenomenal 👍🏼", "fateh.mohd.90410": "Hii", "manitabedimakin": "Perfect movie 👍", "simran_.singhh": "Watch my story", "idiosyncritical": "Watched it tonight, expecting a stellar performance. And you did not disappoint. It was so realistically portrayed, hopefully it will stimulate women and men so that we can chip away at the vicious cycle of domestic violence.", "akantjaiswal": "Simply the best movie till date in Bollywood❤️", "spiritual_explorist": "Miss Befitting जरा औरतों का Emotional abuse/atyachaar, psychological abuse or mental torture भी बतादो film me", "amarjyot_singh_nagi": "An amazing movie with a beautiful message.😊", "shirinsakhuja": "This movie doesn't fail anywhere, well written , beautifully made and portrayed. This movie deserves all the recognition for being a medium in spreading well needed awareness among our society.", "gurioye7": "❤️❤️❤️", "muneer5zero": "One of the finest piece of bollywood. ❤👌 loved the movie", "seema8511": "@taapsee : I watched #thappad today and I learnt just about Respect, which till that I was ignoring and now m feeling what I was doing wid me, really its very good social message movie... I can not say in words how this movie touch to my Deep heart and finally now I left that person who is not respecting me nd I was just loving him.. Really now it's feel like m happy.. I dnt know how I was stuck nd couldnt get out of thht.. But after watching this movie I easily did that.. Thanks for making this movie.. Thanks to entire cast and tappsee who put all efforts and deliver this a movie to chang women unrespectful, happiness life....♥️♥️♥️♥️", "kunalkhosla93": "Loved the movie. Respect to all crew for this!", "13pihu.srivastava": "Outstanding movie...after a long time saw a wonderful movie..hats off to u", "manishaa_vivek": "Watched it yesterday and loved it. The message is so powerful.. ❤️", "soniaseal": "❤️", "maulshri": "Dil tak pahunchee hai ye movie “thappad” - @taapsee ... jiya hai maine ise. Ladee hun. Aur us ladayee main haree bhi par jeetee bhi hun. And I would not choose any other way. What a superb actress you are. Big hug 🤗 💕"}