{"amritascakery": "Yes watched...spectacular performance... 😍", "gurleen_singh_official": "You have sparkling in your eyes whole world fall in love with you twice 😍😍😍. Written by me for you mam 😊🤗. @taapsee", "official_chopra": "Love this movie👌🏻✌🏻", "_sunnnnii__.ly": "@taapsee Thappad movie is soo memorable for me I love these movie ❤️", "cosmoqueen_poojitha": "Add me", "mr_khatarnak_1": "main aapse bahut pyar karta hun❤️", "crazy_chhorii": "😍😍😍", "ankit_raj_haran": "Sab thik tha movie me bus Ek thappad ke liye itna bada issue nhi banana tha....ek bar chance dekar dekhna tha n next time hone par use maaf nhi karna tha....fir tumne jo kiya vo thik hota ❣️", "vikas.aj.127": "❤️❤️❤️😍😍", "__mr.tarun": "Bhot he emotional and lovely movi h! Lots of love❤", "abhishek.123.pnb": "A must watch for all men", "lostsoul_somewhere_": "U r my fav actor n Tappad Ka shooting scenes was awesome🔥🔥🔥🔥 🔥.", "simranjeet1320": "Mai kita tuhade nal 😘", "naresh.tambe.334": "आपकी थप्पड मोव्ही बहोत जबरदस्त है. हमने सिनेमा हॉल मे देखा. आपकी हर मोव्ही विशेष होती है. Keep it up", "ketaki.gangar": "❤️❤️❤️it is an amazing movie", "bhanupratap8594": "Ji jarroor dekhenge", "enithhassa": "Thappad movie is really good story, i always like your movies. You are very talented actor, this movie is best", "the_akshay_tyagi": "Tmse kiya h🤗", "fazila_lovepinkk": "It’s amazing very well put forth d humiliation one feels internally after domestic violence ... even if it’s juz one slap", "__priyav_dave__": "I bet you can't give me replay 💯", "neeleshjd007": "Number", "ajay_basoya_": "Hi amrita I am fan of you I am going to watching your movie thappad", "196.9max": "Relations are like glass; A scratch in one side will reflect on other side too, Always handle feelings with care because scratches cant be removed.!", "iamrohitdhoni": "Thappad super movie h main first day hi dhek li", "shxutii_009": "Fab👅❤️😍👄💋💘", "jitumali13": "Amazing Muvi", "_zaiduuuu_": "It's a great movie", "mumtahin.awny": "Loved it. ♥️♥️♥️♥️♥️", "arshadji": "Mam I am amazed that how u got a such a brilliant ideas u always fought for a different cause", "hikmatroshan2244": "I love the way you make films❤️"}