{"official_a_chauhan": "❤️❤️❤️", "lata.solanki.1044": "Mam aap ne bht accha kiya sach me i really proud of uh mam un jese ladko ki vajah se hum ladkiya apni tarah se life ji nai sakte unke vajah se hamare family bhi hume koi chutnai deti ❤️", "raj__thakur__07": "Nice pic mam", "nikhill_official1": "@taapsee Mam aapne boht accha kiya ashishsionly ke saath ye hi desh ki gandagi hai or inki wajah se hi desh aage nhi bad paa rha hai. awesome pic mam", "killer003silent": "😍👏👏👏👏", "sheikhnayeem63": "Nice mam", "dwivedi_avikadwivedi": "Mza aagya mam troll police dekh ke 🔥🔥🔥", "kanojiya3951": "Hi mam", "meshwa_joshi": "Gorgeous.....❤💞😍👆💋😘", "ayeefos__": "❣️❣️", "in.sta2913": "Well done for taking right step", "s_a_hil2424": "😍", "06shaikhsuhaib": "U r a really great fighter", "zeelmistry_1001_": "😍😍 seriously mam love u becoz of ur braveness that I have seen on troll police yesterday night... It was time when people thought like women can't work but women like u are hats off mam seriously I'm a big fan of yours ..", "j.a.s.o.n_28": "Hit like...who came here after watching troll police 👍🏻", "devraj61861": "Mene aaj first time ye pic dhund ke dekhi h vo bhi troll police dekhne ke baad .... Hats off to u ❤️😍😘", "shreyagiri2428": "A big salute to you mam😍❤️", "sanchalchadha02": "Thanks for changing a logo ki soch", "rukshan4235": "U are A strong girl mam troll police Episode Me Aap ne kamal kar diya", "vidula_2125": "Your troll police episode was amazing mam...😍...India needs many more girls like u🙌..", "_thejasspreetkaur__": "U look so pretty and gorgeous mam. In love with ur eyes💕", "briizen100": "Feeling so proud of you taapsee ji you are a so strongest women yaa, meko esa proud feel hora h apke liye jese aap meri family ka he hissa ho❤🙏", "nik_joshi1": "I love it mam... Yah hmre sath bhi hota h...", "amitgupta2164": "Mujhe nhi lgta tha ki koi calibraty pal bhar m jhansi ki rani bhi bn skti hai👍👍", "arishfakhah": "I love it taapsee mam mane aj ap ka troll police deka aj ap ne jo use pachada ha uska bade tho koe ladka ladke ka barema asa comment nahe kare ga I am impras Mame I love you", "chocoblast_29": "Strong and bold our own @taapsee .I watched @trollpoliceindia twice.Strong girl,♡♡♡", "riyamanik.123": "👏👏", "sahana_b_y": "Strong girl ever. Today i watched troll police 💖", "tapan.choudhury.52035": "Today watched troll police mam u r a very strong girl", "kirti__aarya": "Watching troll police today.. saw this episode ma'am. You're a strong woman and you proved it so well. Such people need this kind of treatment frequently @taapsee huge respect🙏", "muskan__chadha": "Such a strong lady .... with such a beautiful smile ..love you mam @taapsee 💖💖💖", "_naveen_official_143": "After watching trolls police u r awesome mam😍😍", "aakshi_karkara": "@taapsee you are really such a strong woman💕💕 hope girls who go through this cn raise their voice just like u😊😊lots of love", "saransh_khemka": "Aj deka mena troll police ka episode apka mam.. and apne bahut sahi kam kiya ha🙋🏻‍♂️", "sajjad.saha.796": "NyC👏", "_archi_011": "I'm here after watching #trollpolice you're just amazing ma'am with big heart ♥ ❤️😍but maaf ni krna tha Do chamaat lgaane the uske😠😡😡😡", "c_a_m_i_l_i_a_123": "Aftr troll police", "harshitarora.4": "Hnji mam g maine aaj dekha aapka episode troll police u are nycc person aap bhut brave ho sachi yrr esi thinking kisi bhi ladke ki nhi hogi dekhne main toh ladka kitna achha lag rha tha lekin aapne jab comments dikhaye toh bhut shreef ban rha tha but aap bhut good girl ho mujhe toh rona aa gya tha but respect all of you girls 😊☺️😚", "ankitamondal_423": "Nice one", "_guru.piyush29": "You rock ma'am", "india.gucci": "Hats off @ taapsee you did well. Inspiration 💕", "n_o_b_i_t_a__718": "❤️❤️❤️", "ajay_singh9021": "Bahot kiya mam uske sath", "dhiman._08": "#mtvtrollpolice i have seen your epsd 😍 u r really strong fighter😘luv uu dii @taapsee", "kashyapsinu": "Mam apne kya insult ki us ladke ki😍😍😍", "altamash.shakoor": "Awesome", "shruti_web": "Abey yrr koi uss ashish ka comment dikhao kab se dhund rahi hu 😂", "heermohi4": "Troll police 🔥🔥👏👏", "r.s.rawat29": "Mam nice pic", "nishushah65": "Nice mam😍", "ginni_8253": "You are so beautiful", "mech.deepjyoti": "😂😂😂Ashish ka kat gya😂", "__shayaliiiiii__": "Hats of to u mam 😍", "sarveshvashistha3": "Mam troll police pe aapne uski jo utarri heads of to that....🙏🙏", "baby_girlll8": "#trollpolice", "aayatsheikh224": "After watching #trollpolice I am seeing this post. Mam u are so..... Gorgeous. No one has the right to troll u", "write_ur._feelings": "After watching #trollpolice I am seeing this post...maam u r so brave...😊", "falguni_9026": "💕", "nirmal____1998": "#Trollpolice vala pic hai ye To 😅😅 ... imyourbigfan @taapsee ...", "nilakshiiii06": "U such a fighter ❣️ @taapsee", "kanchannnnn._": "💖🙈", "mr.akbari748": "After watching #trollpolice Ma'am you are so brillent Ma'am you should told to her parents and so her sister that he want to saw that post. Ma'am you should slap him. Ransir doing a nice job. I am proud of #trollpolice .", "amanbora00121": "Well done such a strong girl you are 'I Salute you", "i_chiragkhatri": "Troll police wala pic h 😂😂😂😂🤣🤣🤣🤣🤣", "sumitverma5281": "NYC pic mam", "deepak__rajput_0": "Kon kon troll police dekh k aayaa 😋", "secert__giggle": "Di Mai troll police dekhi jo sb hua tha aur bahat bura lag raha hai ki aise comments Aap ko mil raha hai .mujhe srif itna kehena hai sb logo se plz plz guy's aise comments mat do hurt hota hai sb logo ND well done #trollpolice", "ragniiiiiiiii": "❤️❤️❤️😍🔥", "janvibisht2004": "❤️❤️❤️❤️", "shweta_guragain": "🔥🔥🔥🔥🔥🔥", "kher323": "Who is where after watching troll police 🙌", "_avanti_tayshete_08": "Salute you mam ☺#trollpolice", "hamza__shams": "Hii", "kushkey_mishra": "❤️❤️", "its_mj_rony__offcial": "Mam aaj hi mene troll police dekha or mujhe bhut bura feel hua 😢😢😢", "nidhi__80": "🔥🔥🔥🔥🔥", "b_bishnu_45": "😍😍😍😍😍😍😍", "aastha.5816": "Love you", "mr.ritesh_jatiya": "Nice mem👏👏", "rjrajatchoudhary": "🤣🤣🤣🤣troll police", "_wild._.devil_01": "Well done troll police👏", "1432noddy": "Well done 👍 troll police 💪👊", "lite_bazz": "Well done #trollpolice", "noman_ahamad11": "Ma’am I am seeing this post after watching #trollpolice maam u r so strong no one has any right to say u like that u are very beautiful", "anitasharma652": "❤️❤️", "nitya_gupta145": "Jo muh pr kuch aur social media pr hewan bane fhir rhe h yeh ab woh tym nhi rha jaha lrkiyan ghughat kar kr bethi rhe ab ham lrkiyan bhi woh kr skte h jo yeh hewan jesi soch wale lrke nhi kr skte h", "__bad_boi_jigs": "KON KON TROLL POLICE KE BAAD YE POST DEKHNE AAYA HE ??🔥 SALUTE TO TROLL POLICE❤", "iamnaveen_navi": "M here after watching troll police ma’am u are amazing 👏 apne har girl k liye stand liye 👏 thanx and keep going ❤️ big fan 😍", "__harshd7__": "Big fan mam. Just watched the troll police. Its a need for our society to understand what's wrong and right. We all love you mam @taapsee ❤", "_shubhita_888": "Mam your such a great person . Now i can see troll police on MTV it was so NYC. Your so brave nd ya after watching the episode i am come here ..❤️❤️❤️❤️.. ...😍", "shweta_tiwari_23": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "say__sag": "Most of the people came to this post after watching troll police..I really surprised to see this all comments after this show telecast now a days...the season should continue", "su.nshine8765": "I'm coming to see this post after watch #trollpolice on @mtvindia no dout ur so beautiful So talented & So strung #proudofyou ❤️❤️ #tapsee", "abir.sarkar.52687506": "It's amazing realy", "shy.snicker_14": "Beautiful 🔥", "black_moon0190": "Who is here after watching troll police 🙌", "khatoon2889": "@taapsee mam aapko ashish ko chorna nhi chahiye tha aur maaf bhi ni krna chahiye tha 2-4 laga deni chahiye thi usko achhe se", "ayush_14_official": "Troll police ne to Ashish ki leli 😂😂😂", "anujkharepsit": "Watching trool police niceee", "hemant_kumar_rajpurohit_08": "😍😍😍😍😍😍😍😍😍", "karthik_lovablerascal": "Who are all came after watching #Trollpolice? Like me??", "harshitnick31": "👌🖤🔥🔥ma’am awsmmmmmmmmmm+", "i_shruthii": "Apne us Aashish ko maaf nhi krna chahiye tha.. or ek zor se thappad dena tha", "official_prashant4637": "❤️❤️❤️❤️❤️", "iam_kandoivitthal": "Mam u done good job in troll police proud of you mam.@taapsee", "virajdesai260304": "We'll always love U maam🙌👌🥰💐", "singhvaishu_288": "Wow mam u are amazing ❣️😍", "dogra.priyank": "After watching troll police 😂me come here", "global_art_india": "Ashish", "rakshittha132": "Watching the show,,Ashish realised thts good we support u,,,,u r brave girl ,,it's been three years still searched the post love u", "divyadevi_13": "Mam Maine troll police dekha n us Ashish k uper bohot gussa aaya ese logo ki esi thinking ki wajah se se ladkiya apni marzi se nhi reh pati n agar kisi ladki ki marji h kisi kapde ko pehnne ki usse koi problem nahi h uske mom dad Ko nahi hai toh woh hota kon h ese comments karne wala 😡😡😡😡", "queen_of_diamond_eyes14": "After watching troll police I came here. Feeling proud of you.. ❤️ and I wish ki logo ki soch badi ho or bdle...and everyone knows what is bhartiya sanskriti they understand also..🙏", "lol.its.me2005": "Sometimes i just feel blessed to hv u mam@taapsee as my role model...i hv been ur fan since a long time and after that case with ashish...i really thing u r the bravest person i ever met....i just want to say..be like this only mamm....never change for someone...thank u💕💕.....if possible can i hv onlyy one reply 🙏🏻", "abhiranjan_82": "@taapsee mam i am here after watching troll police😍", "officialsuvransu07": "Kon kon aj ka troll police episode dekh kar iss post ko dekhne aye hein like kro", "adityasinghchauhanadi": "Taapsee mam aaj Maine troll Police dekha waah aap nai Jo uski waat lagj aur jo samjaya usi jaise bhot khub👏👏👏", "kumkum_069": "Gorg! ❤️", "anu_raizada": "🔥🔥🔥", "anushila04": "❤️", "seeburajput": "❤️lovely Picture Mam...I AM here after watching Troll Police", "apeksha_pitaliya": "Mam aabb sabb aapki tariif karenge ISS post ke comment tho bash Gaye samjhlo🤩🤩🤪🤪", "sarfraz_soudagar": "Troll police kis kisne dekha like thoko", "ashuism_47": "Kaha ho bhai @ashishsionly_ 🤣🤣 I'm from troll police", "pavaniraju5": "Troll police please come back show celebraties ko troll karne valo ko ek bar show dekhna chahiye", "vanshika.925": "Mam you're so so pretty I'm here after troll police by @mtv you're such a great actress stay blessed let the dogs bark you'll rock 💓", "itz_saz_143_dz": "MAM YOU ARE SO GOOD HEARTED. MAM HATS OFF TO U❤️🔥😍😍😍😍", "faith20202020": "Love your post", "__sonu__350__": "❤️❤️❤️", "hacoonamatata1850": "When Getting famous only happens by troll police and not by your acting😒😒😒", "tanisha_saifi_91": "Maam your aree very brave girl😄 you're so so pretty😍 I'm here apter troll police🔥 by mtv you're such a great❤️ actress😄", "mulanivinay4": "Mam ur right 👏👏👏", "whospriyanshu": "Fantastic pic", "pooja_praniti": "I saw the troll police episode..Ridiculous😣..Ek thapad tho banta tha aap k hath se aise nhi jana chahiye tha mam..jis tarike se wo acting kar rha tha na mera man kar tha gala daba dun...Lots of love from Chandigarh❤️ @taapsee", "wasimkhan91": "@taapsee amazing answer.. sahi elaaj kia ashish ka", "upama76": "😍😍😍😍😍❤️❤️❤️❤️", "sanjna_kashyap_": "🔥🔥😘😘", "rach.it9191": "The rape percentage is very less as of compared to india in foreign countries despite there the women or girls wear short clothes. So why There the rape percent is low ...... There in there mind they have good thoughts for the girls and women and here in India the short clothes are in there mind . So please change ur mindset,dear Indians For the sake of development of our own country please change ur mindset . @ashishsionly", "niteshyadav648": "हेल्लो तापसी mam ❤️❤️", "jaweriya_gauhar": "How many of u are here from troll police??? Neech ashishsionly ko report karne aayi hu main", "darshandarshan6923": "Troll police is fake I think", "jimitlathiya8": "Trisha or mishti kya comments dekh rahe ho", "rahulgarva1": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "pranavsethi0116": "@taapsee Ma'am srsly u r amazing and a very brave girl who took this step to just put petrified feelings in that worse minded people .. who the hell they r to say bad things abt girls who wear short dresses ... literally this is the bestest example by trolls police n you .. i think most of the people who just think like that now have to change their mindset #stopbodyshaming #stopbullying #stopharassment .... one last thing HATS OFF TO U MA'AM to just deal with that things n take step over it... we all with you , love u and love ur acting 🙏😇", "_rai_.88": "Good job doing that with that guy well dona and also ranvijay sir👏👏👏", "namratamishra3964": "😂", "anshuverma424": "Ma'am good job you are doing a great work with ranvijya sir on mtv troll police", "kalpanaa_official": "Osm❤️🔥", "vaibhavmishra16": "Who else have seen Taapsee Mam on Trool Police, like here👍👍👍👍, I salute you mam that raise your hand for Justice for Yourself 😊😊", "lakshi_baani": "Ma'am yesterday I saw ur troll police episode it was grt, love uh ma'am ,vaageshwari from new Delhi❤🇮🇳😘🤗 @taapsee", "shinde5087": "🔥🔥🔥🔥", "x__mariam_.x": "Pretty girl❣❣❣", "ankita_chhetry": "🔥❤️❤️❤️❤️🔥💋", "dristi.d__15": "Ashish beta kaha par ho?😂", "bhat.azan.334": "❤️❤️❤️❤️", "gunnu_habowaliya": "Mam I am your big fan😍🙏", "life_lover_155": "Hats off to mam", "ansh9344": "And mam you are beautyfull dont care about nation kuto ka kaam hai bhokna", "_.annu._001": "Mam you're amazing..!!❤️🌸", "monikasharma98": "where is ashish😂😂😂😂 @mtv_troll_police", "surabhi_basumatary": "Mam today i saw your troll police episode.... It was amazing.. Proud of you man.. I love you ❤️", "rahulprasad_2407": "Mtv Troll police", "feroztantrey": "@taapsee mam i love you after watching your show on MTV troll", "trupthiwaddin": "Wow uh did good at trolls police...uh wer juzz awesome!!! Raising ur voice was actually really good action!!!", "art_of_khushi": "You are so sweet and cute and lovely😍love you di", "dia.deva": "🔥🔥🔥", "smriti4736": "Sab yha Ashish ko dundhne aa gye😂😂", "sadhna2175": "Heyy where is ashish😂😂...salaa chalaa tha ladki pe comment karne ab bechare pe comment hoga......very nyc taapse ma'am I'm proud of uh...ki aap yeh sab logo ki batt par naa dhyaan dekar...apni career pe jyda dhyaan deti", "saddisonu10": "So pretty I am very big fan u 😍", "rajanya_paul56": "Who's here after Mtv troll police", "cutie_smartgirl": "I am seeing troll police👍👍👍👍👌👌👌👌👌❤❤❤❤❤", "mr_aj_anshu": "Heads of about troll police", "komal__3300": "Ashish ki profile kisi ko mili kya🤣🤣🤣🤣", "je.suis.skarma": "Ashish ki to lag gyi 😂😂😂", "_.himanshuuu_17": "Saare troll police dekhke iss post pe aake 😂 baate kr rahae ho 😂", "my_self_shubhankar_": "❤️❤️❤️❤️ Hello man iam your big fan", "khan_muheeb_": "Ashish ki profile gayab..... I think wo sb fake tha troll police ka.... Cause i didn't saw any ashishs comment.. 🤔🤔", "innoscent_boy_praveen": "@taapsee hats off to uu.🙏🙏", "_mandla_neeraj_35": "❤️", "_pikapi_pikachu_": "🔥🔥🔥", "krishrockszz123": "@ashishsionly_ shame", "danish_5544": "@taapsee wow nice pic maam iss pic pr troll b hua tha ranvijay sir ke sath bt apke bht fans hain maam support ke liye to i think ur the best 😍😍", "dalaldesigner52": "Aap bohT sunder ho didi...And so cute🔥🔥❤️😘", "udhamsinghrajput24": "Hats off mam staying home is good and hats off mam of handling that men.I seen your mtv trolls clip hats off 🏀💗💗🔥🔥💯💯👌💞💞", "ishita_joya": "❤️", "aryan.0808": "❤️", "the_young_gentleman09": "Mam you are mad you are very bad girl you are not good girl 😂 PlZz call me in troll police 😂😂🔥", "brettlee_99": "Very very nice 😍😍😍", "syed_shahbaz902": "Ye batao troll police dekhne k bad kis kis ne ashish ku search kiya😂", "rupesh___01": "where is ashish ? 😂😂", "mayukhsharmask8": "Ashish beta kahan h", "boss_pm11": "Where is Ashish..?", "mistiii_dutta": "Love this picture of urs.. How can someone wrote bad comments on this... U did right to that guy in Troll Police.. Much love.. 🤗", "vape_king_prem_007": "❤️", "nabeehamughal2": "Nangi harami orat...najaiz olad", "faisalrauf97": "🔥", "habibur6425": "Very nice...Pok mam", "_.savage._.wk04._": "@ahishsionly🤣", "sinshapuri": "I really appreciate the way you discribe yourself and each and ever woman of our culture 💪 hats off to you. 😘", "its_all_about_happyness": "Troll police dekhane ka wo ladka ko pata chal gaya hogaya hoga and i hope abhi sa koi bhi ladka comments karna sa pahela soche . I am proud of mam..👏", "ranu_khan242526": "❤️❤️❤️ i love ur movie saand ki aankh.. ❤️❤️❤️❤️ aap bahut pyaari acting karti hai mam.. Big fan... ❤️❤️❤️❤️❤️", "_heart________hacker": "Nice", "sadmaniram.fahim": "Just came from troll police...i hope ashish learnt his lesson.. & hope he is a better person now... I hope others will learn from this... ❤❤", "roshan.chavan.29": "Just watched troll police🙌", "bormangourav": "Mja", "nick_chavda98": "Awesome", "ashif_raza143": "So lovely pictures mam", "shakoorm": "Hot", "baba.shanii": "👏", "rafsanasad47": "@taapsee hats off to u 💓", "bannaofficial_4119": "Kon kon troll police dekh kar yaha ayaa he like kardo", "alishaamjad3": "👍", "rajnagraj77": "🔥👌", "amritakhan79": "😘😘", "dipika7362": "Nyc", "khatri201": "in kw r btaonga k lrkiyn hi stronge hwti hn hum ghr ni churty larkiyn apna ghr chur kr ati hn ghero me yeh bh himmat h ek r us k bad us ghr kw smbhaltin hn yeh bh ek himmat h jw larko me ni h yeh troll sirf coments r pest peechy apny maa baap ka nam khak me mila skty hn agr tm unhn khush ni kr skty tw please un ka sar tw jhukny dia kro agr meri kisi kw bt buri lgi hw tw am so sorry r mujy rply kr k batain k meri kia bt ghalt h allah hafiz", "meherajsocial": "LOL⚡", "ghadgetejesh": "I m so hot u 😘😘😘😍😍🌹🌹🌹👌👌👌❤❤❤", "hamzaa_1104": "Awesome thighss😍😍 they r so milky. i m in love wid ur damn sexy and hot legs😍😍", "sapnagoursapnagour": "Super", "abdulali_58": "😍😍😍", "shubhamshukla948": "💋", "mr___rohit__": "🔥", "_kuldeepsinh_o11": "👍👍👍👍", "angrye_bird": "👏", "kashmirrony": "Its too late that i wached MTV troll police. its hards to hear that some pepole have there bad thinking about a girl or a person can achieved much respect. bye the way i watch your new movei #Badla its wassssoooomm work. blace to you. also o big fan off you from long way in Bamgladesh.", "sumairkashif.d": "🔥💯🔥", "dont_use_this_closed_acc_": "Arrreeee me to ashish k comments doondh rahi thi ... strong lady tapsee", "iabdurrehman21": "@taapsee troll police daikha abi 🌸🌸 were lukin pretty", "yamrj": "So cute my love", "vashiforever": "😘😘😘😘🖤🖤🖤🖤", "adarsh.bhardwaj.singh": "👏👏👏👏 for troll police", "___jid.___": "Mam i have just seen your troll police... It is just amazing... Your confidence is too good... 😊N i think nobody will try to do such a bad thing towards any girl... I'm very proud of uhh, n troll police who are helping the girls all over the world... Thank you troll police... And i love the way u r working... 😊😊", "gullraz": "Amazon troll police", "aiyaar_17": "Hot and bus", "rjdarknight777": "👌👌", "subhankarsharma2": "Super duper mam", "a_s_w_i_n_i7": "🔥🔥🔥🔥", "rahulrajput7620": "Just now i have seen your troll police episode and came to know how much you have to face on social media every day but we are with you mam also with each girl on social media who get trolled at such a level .and always we thier to supoort you. And keep doing you work.without any fear and hesitation.", "bhaveshjain75": "Now I have seen troll POLICE and come to your account we are with you mama ❤️❤️👍", "dipesh_mhatre_4734": "😘😘😘😘😘", "karn_bhullar": "Taapsee im big fan of you After watching you in the Trool Police more respect for you in my heart ❤", "shivani_1797": "Ma'am I've just seen your troll police episode...I really liked your confidence and attitude... you're a inspiration for many girls....loved Ur coolness❤️❤️", "vishalkumar4417": "Mam I saw your troll police episode.... It was amazing.. Proud of you mam... And u r very beautiful", "shilpashindewinnerlove": "💕 beautiful", "monikaamansingh1186": "Lovely pic 👌😘💕", "_nia_23": "Yes u r so amazing in troll police", "prince_choudhary_623": "Makeup pe tiki hui hai", "ratul10000coc": "Super hot 🔥🔥", "saadia.raahim": "you are soooper dooper bold best example for girls 😍😍", "kairakunwar": "💖💖💖💖", "rajesh70975": "Superve", "iamunknowman": "😍😍😍😍😍", "mdsohrab.cool": "Nice pic", "manishrestha07": "awwwwwwwwww", "anishasaha2021": "U look extremely awesome😘😘😘😘", "neha_2474__": "Awsm", "tuslim_musteri": "Love ur troll police show.", "ajaysingh3224": "Very nice pic", "pratu4029": "Ur so beautiful I love u", "sweetyblack98": "U r beautiful😍 nd ur epi of troll police was amazing 😊", "me_choc": "@tapseepannuofficial jst saw troll police ... proud of u ❤", "sniper_cheeku": "@taapsee Mam Hats Off To You... It Requires A Great Heart To Come On A TV Show And Face All The #Bullshit And The #Shit_Mentality Of #Cheap_Trollers You Are An Inspiration To Many Of Us... Your Movies Are Awesome... Keep Motivating Us... God Bless You... I Know There Are 0.01% Chances Of Your Reply... But Still If You Reply, It Will Be The Best Day Of My Life... #Thank_you", "dheerajbhandari1119": "One one taapse ##hat's off", "i_am_shaker": "Tapsi mam.. i am from Bangladesh... I saw your troll police show... excellent .... i am proud of you", "pragu_45": "Wow mam nice😘😘😘", "rushlanayat": "Love the pic and also the way tapu handle trolls at troll police that's the beauty of women empower!!", "nasrabelgium": "OMG I saw dat part of troll police.u were so gud.and cute oooo myyyy God u are so cool.i love u dear.", "iam_____razik": "Mam u r awesome n ur anger was fabulous", "muskaan2135": "Beautiful", "b.nafo": "You ❤ good", "kirankashyap970": "Love Ur troll police show and Ur line\"agar pasand nhi hu to follow hi mat kro\".", "mistry.anupam": "Beautiful", "cuttexishaa": "Taapsee mam u r soo cute and beautiful😍 I love you so much😘😘😘😘😘😘😘", "royalimrankhan10": "I saw u r troll police show it’s a grate I Dea @taapsee I really love u r films , I appreciated u 😍❤️", "gsgill4057": "MTV TROLL POLICE 👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻.... GOOD ON YOU GUYS.", "ig_wizboy": "You are looking awesome 😍❤️", "sushant_900": "Nice pic and saxy look", "shyammenariya": "Indian he dusro ki thali me ghee jyada nazar aata he", "real_khaliq": "what a chitrol wowww amazing job ranvijay n @taapsee yr respact kro apne heros ka me pakistan se hun bht like krta hun tumare Bollywood clebs ka yr inka kaam dekho or kch ni end of the day ye hum me se hi hain yr taapsee best of luck for mulk i know its against pakistan but we dont mind", "alk3bi_abdulla": "@taapsee respect for you !! Keep up the good work and I LOVE YOUUUUU !!!!!!", "maryammali13": "You look gorgeous and as a woman you do really good keep it up love you a lot", "jibonkhanui": "Nice.", "i_m_instakitty": "U r too good tapsi.. U fight for woman empowerment.. U r the inspiration for all the indian girls... U r trying to change bloody mentality of people. Which is very good. U r the strong woman 👩‍💼..", "angira_19": "Tu psychology student nhi h khud e psychology ka patient h .. upni bio de student hatakar patient likh", "iushrai99": "Tooo cool", "das.ritisha": "Nice picture", "iampradip22": "Super .......😍😍😍😘", "snehadas467": "nice poze", "srijitasen": "Cute 😗", "gunjan6424": "O", "meetsharma358": "So hot lgs", "_rozi_alam": "😍😍😍😍", "noman.dx": "Awesome 😊", "akjainmvd": "Became your fan and follower after watching troll police. The way you handled that troll guy is awesome. More power to you.", "nidhisingh2391": "I just recently watched #mtvtrollpolice ..u r such a fabulous actress ..salute of u @taapsee", "pulkitsamrat44": "Osm mem @taapsee", "manjulareddy6": "I am not able to see u because my eyes are not sufficient to see such a beautiful woman........even and never......with lots of love ur follower HaRsHithA..", "pankeshsagarsagar": "Mam ki id hai ye", "achintoviratmo": "Nice mam", "bobbyveergujjar": "Bobby veer gujjar तापसी पन्नू आप बहुत खूबसूरत हो", "jayayadav6741": "Yes's Mam ur looking to hot I think troll police mai jo Kuch hua i think usny jiyny bhi apky kriyr acting film fare life apki prsnl life kai barey mai jo bhi jitna bhi gnde I think vo delete kr Diya hoga", "khanrakshanda": "Awsm.... Good lesson I hv seen MTV. Now", "young_wolf_026": "Just now saw MTV troll police ...🙌", "harshil_hirpara5542": "@h_h_hirapara_", "ayush_jha_13": "😘😘😘😘😘😘", "arif5445khan": "Look so good...", "anisha_panda__": "@nilesh.n.mandode pehele appne soch ne ka tarika change karo....agar tum kisi ki bara bari ni kr sakte to....atlest ussko support kr na sikho...n Gandhi actress ni he...tumhari soch he", "_gourav_star_boy_07": "You are so good", "sakshi_mathur_14": "You are beautiful and strong ❤", "chandni863": "you r so sweet ..............", "pr.eet8198": "Nice", "manreen_.gmail.in0028": "Or agr koi daut h to troll police dekh lnna ho Sakta h next tum ho vha", "anasmohd1.2.3": "Wow such a beautiful eyes. 😍", "aishmehar_": "@Taapsee you are very cute", "adrija.biswas.167": "glamorous mam bohot ache lagrahe ho aap so pretty", "sonali953": "U r sooo glamorous", "laxmibuney43": "Wow outatanding", "varshapatel8384": "Good looking taapse mam", "singhsuny9452017": "So cute mam rellay hard worker", "environ12smita": "Cute shabana", "jashmeen_143": "Naji mam", "shaileegohil": "@taapsee u r very brave to handle such trolls...salute to u ☺", "pradipta__97": "You are bold💘beauty with brain😘m big fan of yours and deepika💕❣️@taapsee", "jayrajbonshi": "I m the biggest fan of u Taapsee..I love u . u r so cuteee", "vanshikaingo": "I am biggest fan of u mam", "viperr.305": "🌹", "__.puxvi.__": "👍", "saamidreamerz": "Beautiful love from pak", "atif.altif": "Mast show hai troll police😂asish ki to lag gyi thi 😂", "tas_neem5": "All.llllll the love to you taapsee", "sandeep.nigam.52206": "Ma'am mene aaj apka mtv par jo troll police aata h vo dekha to me apse ye kehna chahta hu ki aap bahut bahadur ho or jaisa apne us ldke ko apni galti realize karwaya ye hona bhi chahiye tha taaki kabhi vo aisa kisi ke sath na kare..love you ma'am...", "itz.samim.official": "@taapsee looking Nice", "_nidhi_nancy_": "😍😍 really love uhhh!!😘😘", "nasirkhan806134": "NYC😍😍😍😍😍😍😍😍😍😍😍😛😛😍😍😛😍😍😛😍😛😍😍😍😍😍😍😍😍", "mr.sahay_sahab": "Nic", "_.imarpit._": "Mam looking so good", "vikas.kamboj": "Salute yaar apko or ranvijay sir ko jo apne mtv troll se uski or bahut logo ki soch me change kiya nice love you both of you", "devsoni9911": "Good", "prashant_meshram": "Seriously... awesome episode of troll police ...", "smitaa9472": "u luking gorgeous .. love u so much .. best of for ur bright future ..m alwys wd u .. ❤😊😗", "manimeghalainandhini": "Just just soo preeety you are 😍😍😍😍😍😍", "mahendergarhia_hr_35": "I m already trying for mine dream but better you achieve what you want ,on your own bro", "yaqoobmuhammed": "U r so beautiful😍😍😍😍😍❤️❤️❤️❤️❤️", "hirrachoudhryofficial": "Axi khaaasi aallaawww pic ae....", "priyank4239": "So cute", "oindri_on_the_way": "Love u❤❤❤❤", "madhur_sahu_1000_": "Nice👍👍👍", "itsme_soham": "looking confident and comfortable....", "5k__i": "@taapsee I love you so much I love you so so much 🌹🌹🌹🌹🌹🌹🌹❤️❤️❤️🙏🏻 I love you so much I love you so so much 🌹🌹🌹🌹🌹🌹🌹❤️❤️❤️🙏🏻 I love you so much I love you so so much 🌹🌹🌹🌹🌹🌹🌹❤️❤️❤️🙏🏻 I love you so much I love you so so much 🌹🌹🌹🌹🌹🌹🌹❤️❤️❤️🙏🏻", "i_am_esneha": "@taapsee I looked forward your episode of troll police of this phorograph and I loved.your.eposide.maam😁💕", "poojapathak241096": "Lu", "kushtalwar080ya": "Abhi abhi iska troll police dekha bc m to dar gya are bhen mujhe bhi bula le km se km dekh to luga tumeee", "brijdevmalik": "u r strong tapsee mam .... u handle very better with troll .....u r my favr actress .....😘", "wajahat_ahmed_jawaid": "Many abbi abhi troll police dekha 👌👌👌👌", "zra143": "@taapsee jst saw ur #mtvtrollpolice show. Bravo. Keep it going!! 👌 from across the border!!", "mohammadnashim9": "Hello taapsee mam .it's great to follow u today .. I am happy because I watch in YouTube troll police. . It's very nice u r very strong humans. .I salute you. . Good luck for every day and future", "dhyana__56": "Love", "sheetal_lamba": "U r lovely tapsee so talented so beautiful.", "jigar5466": "Big fan of u mam..god bless u and love u mam..", "falakbano_6677": "nice", "mr__venkatesh_888": "Looking princess", "ishika7995": "Superb", "abhishek.dwivedi026": "I must say acha revenge Liya Apne troll se...,,.......after seeing this episode of MTV troll everyone definitely got some lessons that never try to troll someone on social networking site........you look pretty in every pic I am a big fan .......and l loved your work ........", "shalinisingh4605": "Solo beautiful pic mam", "sadhanagupta72": "Hi.. @taapsee mam... Just nw i sw ur episode of Troll.. D 1 think which i like d most tht u said u only used ur id nd read d msgs.. So hope so u r reading mine to.. Luv u mam # respect... Thnks", "avinashpatel1099": "Tysm", "__the_tall_girl___": "💜💜💜💜💜💜💜", "i.m.nisha.jain": "u r just mind blowing 😍", "b_h_u_p_e_n_d_r_a_godara": "I m ur big fan. 😍😍😍", "tamangzaya": "Looking so hot @taapsee", "waizofficial": "@taapsee beautiful ❤️", "srvmondal": "I like you", "mithundas12345": "Troll police effect can be seen 😋 . It's good that atleast people now thinks before trolling.", "sweethoney5217": "Hot 🔥", "skthewinner": "Right hain", "subhash.kumar.73307": "Am big fan of you", "sachchit_choudhary": "@ashis", "boss___raja": "Trool police ma serf wo loog jae gy jo apni maa behn ki respect nhi kerty soo chill", "chatterjee.archita": "Bold looks always expresses a strong personality.", "sa0151405": "R", "zainu_muslim_": "Just awesome mam. Love you 😘😍", "mayank25112": "@taapsee i lv u so much", "kncokay": "Glamour Beauty", "shahroz_sam": "U r so beautiful i like ur work n u also", "_yamphu": "😘😘😘😘😘😘", "rhythmadk": "Dont take it the other way😂😂", "x_akshata1206_x": "Nice", "j_kashish9": "Nice pic mam", "rubyxoxo.ig": "The famous ‘Troll Police’ pic lol, who knows Ashish’s account? He changed his username 👀", "animal_lover_680": "Luv ur figure😳😍😘", "pk5955": "Aawwsm😃😃😃", "itsnishahsan_21": "💜💜💜", "bhati9151": "Jordarrr", "aanushsingh": "Osm.. pic mam", "sonuthe8055": "Eahi picture mtv troll me aaya tha Bhai koi cmnt mat karo.", "saad_salman279": "Taapsee wese me Dubai se ho Dubai me M.t.v nai atta chanel mene troll police YouTube me dehka ta ab se sarre log ap ko tang nai kere ge", "azeem7447": "Ashish NY thek e bola tha taapsi", "amitkumar6937": "Taapsee u r beautiful pick", "rushikesh.jethurereddy.1": "Nice pic", "ahsan_n.k": "Beautiful :)", "nitinrana7895": "nice pic mam", "bhushan_gawade": "Looking dam. hotti 😍😍", "yumiko8653": "#Taapsee NYC pic mam", "sabirseikh8": "Hi", "kaushal2002mathur": "So what?", "imte_rahman07": "😍", "rohansingh83789": "Love uhh tapsssss", "mahaldar_akib": "Nice pich", "solemnlymade": "U r my favourite", "tashuthapa": "LooKinG Wow Mam😘😘😘😘😘😘", "jinhore": "You are so hot the one who marries you is lucky", "sufiyanahmad562": "1 hi Zindagi h has ke jiyo nice pic", "gunner7293": "This is a strict notice all the trolls. Na Karo, Varna bure fasoge. @taapsee Salute mam. Acha kaam Kiya. #latepost", "kapz9090": "I see your episode today..of Troll Police..Hats off your patience #urRealShabana", "mr._mister_mysterious": "I m proud of you ....that you are such a good actor.....and i am proud to indian that such great indian like you are there in our country....!", "mahesh_ramani08": "You are the inspire for millions friends", "_tathyashukla_": "I saw troll police it was awesome. I love it and I am proud to be a girl. BTW you look awesome", "ayesha6784": "Hey taapsee mam .... I am your bigggest fan I have watched all of your movies and just wanted to say that you are really beautiful and we all are really proud of you ...😍😘❤", "daniyalforeal": "Such an amazing lady I love you", "himanshirana05": "Looking so good", "ruhani555": "😚😚😚", "alifiacyclewala": "looking soo good... liked ur sharp edgie smile alot", "akku_____01": "Love it 😘😘", "samcurls": "Hey @taapsee I recently saw you on MTV's troll police. I loved you on there. The way you stood up for yourself was so inspirational. I was body shamed in high school and couldn't stand up for myself. But now, I'm in a better place because I have started working out- only for my own happiness- and it's people like you that inspire me to not give up❤", "suryavanshi_rathore_2770": "Yehi picture tha jisme troller ko pkda tha 😀😀", "kussum___": "Love u mam", "itsanishars": "Beautiful", "zainab_ukani51za5253": "Mam you are so beautiful like a Angel", "karan__khurana_": "Beautiful", "vik_ercel": "osm mam 😍", "jutt5183": "Taapsee g you come Troll police good idia today i see your episode i realy like you are sooo beautiful grl your work nice i like your movies pink very very nice movie", "_angel_friend_": "Watched troll police and whatever u said to him was really an inspiration for all the gir", "suchita.joshi20": "Mam you r so beautiful....like a doll....", "domain_of_ur_choice": "Most fabulous and super talented . Love u", "bicky_rider": "Troll police...u kick the boy..........gd", "yukroayush": "#respect an engineer", "ghusen": "Tapsee i want say to me hi and my name plz", "rkkc114": "mam your smile is killer mtlab agr me apni mother tongue me khu toh katti zher hai aapki smile osm", "junaiid_khan": "So pretty girl", "asha_massy": "Hiii", "oscar_boy_garry": "# superb reply to your troller ..", "i_justin_biber": "😊😊😊😀", "priyanku.dutta.5454": "wow", "bhaggya_indeewari": "@taapsee wow so beautiful and i really like your smile", "prshantkumar18": "😘😘😘😘😘", "pream2019": "1st i dont lik u n when u go in mtv tp.when that person say 100% right ur nth tapsi if u want me u r easly find me any time any where 👎👎👎👎👎👎 F..............k", "so_z6": "@taapsee most of ur photos r great but some of it change our minds like we start thinking that she will do anything for money i dont like to hurt people but if i hurted u forgive", "broto_ranjan": "Lovely 😍", "lovibagiana": "@taapsee troll police vala ta siraa lata g in future o dubara galti ni kare ga", "raj_pathak_official": "Mam I am big fan of yours", "ayush_das_is_happiness": "Mam please notice me I'm your fan", "frozen_neha_": "Mam u so so preety", "dushyants.raghav": "You are a great human being ❤️. Best of luck for your future❤️..and please ignore all types of ‘‘ Faltu ‘’ comments ❤️ @taapsee ..ly and please reply to me 😻", "mdkaifarchitect": "Osm looking", "kuldeep.yuvraj": "Sooooooooooooooooooooooooooooo cute ......of you mam.....i am your biggest fan", "shaikh.rehan.90475069": "You looklike awesome", "bhavna6177": "Hey Mem I just saw ur troll police it's is fabulous and I miss so happy for it and thnxx we proud of u and u respect to our girls thank-you so much mam", "junaedurbar": "My name is Asish see only...", "prerana_pathare": "hey taapse... I saw ur troll police episode... n I was burning out of fire wen I saw tears in ur eyes.... never ever bring tears in ur eyes for d ppl whoz thinking r shits abt girls.. never think that u r in wrong field whr dat field is ur passion.. u r our ideal.. we girls dare doing nethng bcz u r an example for us.. we appreciate ur struggle n talent both... u r Der so v dare to fulfill our dreams... always be u... wid lots of love from ur biggest fan..... @chillax_riya", "candeycane___missy": "Looking so pretty", "nahian_rodoshi": "@taapsee mam apka skin bohotie nice hay.......etni khub surti kese kiya jata hay .....mam please Bol do", "shreyasishreya": "Taapsee mam as a girl I m very inspired by u...u did a great job....mam i respect u so much ...and I love u so much......I m your biggest fan mam", "_prakriti_badal": "You are so kind and good", "sarwar785": "Nice 1", "pawarjayshri26": "I saw your troll police episode. ..n i really appreciate you fr what kind a girl you are ...proud of you", "_lavi_chouhan_": "I'm proud to be mam...n appreciate .....👌👌👌", "iam_.satish": "Mam apse ek request h mam plz contact me plz i beg you to contact me plz", "sumitkumar3975": "Troll poolice is doing very good job.... is pryaash se bohot log sahi line pr jroor aa jaayenge aur aage ghatiya comment karne se jroor bachenge thanks to u ranvijay sir and #mtvtrollpoolice...... koi bhi star aise hi bulandi pr nhi pahuchte, uske lie bohot mehanat lgti hai............ so stop trolling and stop nonsecence comment, change thought and relaize ur mistake its big deal of life.....", "rishikukreja.rk": "@taapsee you look stunning 🔥", "meren1592": "Awesome", "jamesanderson12347": "Osm", "sanjuktarout1234": "Aws", "unique_soul7262": "Hey mam ... aabhi jst apku troll police me dekha.. i mean apka dil bht accha h apne usse maaf kiya... but nahi karna chahiye tha", "rohan_sarvade_150": "Great pic 😍😘 support you 😋", "syed_kahkasha_writer": "Yes u r very brave girl. I love u😘", "_happy.pixels_": "Adorable as always mam", "sonal.sinha.94849410": "Love you mam", "swarnav007": "I just saw that troll police episode too. People don’t change, they find new ways to do what they want to do.", "wanderclix": "@taapsee This is the picture trolled and thank you so much for being so brave on #MTVTrollPolice. You and ur courage will inspire may girls out there. Be what you are and keep doing a good work. Don't give **** to your trolls. Tumhe wo kahavat to yaad hogi \"Haathi chale bazaar, kutte bhonke hazaar\". #LoveUTapsee #Respect", "the_mannurawat_official2109": "Fav", "its.shoaib_.007": "Big fan of u", "poonamverma97447": "Nice pick mam Mene apka Abhi kuch der pehly trollpolice dekha Apne usme Jo bola vo boot acha bola but use maaf ni krna chahiye tha vo har ladki Ko Galt or Ganda bolta h usne mafi bi dikhana ke liye hi Magi thi pr apne Jo Kiya Shi Kiya hoga i am big fan you", "lamaavi": "Luking beautiful", "cansha_10": "Hello am from mauritius, saw your troll police episode, and you did it right!! You fought for all the independent women.. Hats off", "prince_charming_sourav_thakur": "U are damm cuite nd i saw ur troll police episode nd u done a great job mam #bhartiya_nari_sab_p_bhari", "sanjana_hosangadi": "I feel so proud of what you did and what troll police is doing. ♥️", "v.s_rajput_": "Just saw mtvtrollpolice episode of urs.. done a great job mam...🙏 @taapsee", "adyasha_roma": "Respect!!.. the only work i could say after seeing troll police", "debashis_n": "Mam you're really brave", "iamyashpatil": "Great like always 😍😍😍😍", "its__choudhary__007": "Before loving someone,make sure you're loving yourself enough and treating yourself with respect before other. @taapsee Love u Mam", "prabhatmishra1008": "mujhe bhi bulao troll police me", "h_4_hammad": "Nice mem", "sharangopal": "👍", "rahul_rf_fathrod": "Awesome", "unkn1238": "👏👏👏👏", "shubhadiproyjpg": "Tapsee mam ur grt", "hemant_bhot": "nice tapsee mam i love you", "rihanika45": "So nice mam", "ayush__0711": "You are looking nice👍👍👍", "story.dekhlo.xd": "Hi", "sonalishinde9881": "looking so beautiful", "lone_wolf612": "JUST SEEING UR TROLL POLICE WALA VIDEO.......😅😅😅😅", "sanket282000": "Bhai troll police is dangerous .... But don't such activities.... have a great day !!", "iti.agarwal": "Troll police ka aj show see kiya maine aj bhut acha lga apko usme dkh kr maine 1st. Tm cmnt kiya h or y show dkh kr m.fan ho gyi apki mam..😍😍😍😍😍😍😍", "___varunn.___": "U r brave and very brave . That u went to Troll police 😊 salute to u", "micheal.paul.5074": "@ravi_bhendia bro thanx.....😎", "ravi_bhendia": "@micheal.paul.5074 Well said bro...naaari sakti jindabad", "55vishalkumar": "Wow nice", "mr_mk1504": "Best lesson To troll which he never ever forget.", "muzzamilkhan16": "Nice...", "baitya_mane": "Wooooow looking beautiful sweetheart", "mannat_7300": "Loved ❤️", "shubham_priyadarshi_07": "Why you not shap mam...troll polish..ashish", "the_bongo_sontan_": "Brave yaar....enough is enough.......u r really so brave. That u went to troll police 😘", "nupur_desale": "Ur osm.. Mam.. I am a big fan of urs ♥♥", "ashokarora123": "Mne jb s troll police ka episode dekha tb se i m a huge fan of yours", "_.__panda._": "Headsoff to u mam i watched ur troll police episode ur just amazing", "mr_guleria009": "Nice pic", "sanju_loverboy": "Great you are very strong ki aap troll police me Gaye", "_._dhoa_tulsi_pata_._": "After watching the troll police episode love u mamm .....", "__sampurna": "Hats off to you @taapsee ma'am ❤️ you did great in MTV troll police", "drnipztalukdar": "Perfect in @mtv_troll_police @taapsee. . Good job", "piyush318": "how did u cntr ur self baingn si shkl ka hrami sala kpre pehnna sikha ra sala or kya wo ***** wali pic sale chle ja well done mam hats off keep movingfuck that creeps @taapsee oll d bst", "jai.r2018": "You taught a good lesson to your troll Ashish .i am proud of you ,not even me but whole india is proud of you", "8678prerna": "😘😘😘", "mateen.raza.khan_": "Boht Shi troll ke sath apne", "abhishekpoothiya": "@tapsee I seen troll police. You are setting examples for other how to tackle things . You have such a brave soul. 🙌🙌 I am a fan of you but after seen that episode you have a big respect in my heart🙏🙏🙏🙏", "mdwkemon": "nice pik", "mr_moon11": "@taapsee ty mam", "s_patel0226": "👌👌👌😍😍😍😍😍😍😍😍", "sumit.nascent": "Just watched troll police damn u were amazing the way u taught that chubby hippopotamus. Btw where is he now???", "kaustubh080699": "Uncle Aunty ko namaste!! #mtvtrollpolice 😆😆", "_s_a_l_m_a_n____a": "amazing pic and u also your troll police epi is awsome and u tooo mem .i like your eyes mem", "ckashyap95": "Headsoff to u mam. I watched ur troll police episode u r just amazing", "raj_singh_777": "Osm", "aman_rawat_2000": "Love you mam😍😍😍😍😘😘😘😎😎😋😋😋😋", "ronnyy812": "@taapsee hello mam i am in USA just saw your troll police episode, so proud of you and you did right thing shutting that dumb ass ashish’s mouth. Total respect for you 🙌🏻🙌🏻 became a big fan ♥️", "iffu.mohammed.5": "😂😂", "shifatheophil": "I've seen ur troll police episode... U did ryt ma'am tit fo tat.. Ur d prfct combination of beauty n brain... Love u xoxo stay blessed...", "anjalianat": "Hi taapsee I was really appreciable...troll ko reply.", "kamal.sumal": "Fuck off", "hemad_khan__": "Totally fuck off #ashishconly", "singh___ratan": "Cmmet mam", "_therealsukh_": "looking cutipie", "flamable_ice_": "Really appreciate how u face ur troll in MTV troll police I like the show to find the bad people hiding in social media their mentality is coming out. They don't have any right to troll anyone", "sammy_773_": "Ma'am u were great in troll police .... Proud of u❤.....", "rehan_baraiya": "Beautiful", "priyanka.ghosh.33633": "I love you di. I proud of u..😘 😘 😘", "i_am_skss": "M tv Troll police great channel.....", "runjhunkhandelwal": "Ashishconly", "nipun_korwlikar_": "Nice", "shivamyadav6899": "Nice pic", "im.m0na": "No trolls are allowed. Love ur MTV troll police episode", "suryas_world": "Looking really very stylish...love u didi...want to meet you @taapsee", "guriasharma_debnath": "Soo lovely maam", "vishrutvardhan": "Mam ur the bst i just saw ur troll police episode and u were awsm in that and also ur awsm in ur career and films... Luv frm me Ma'am stay Happy😇😇", "d_rushi_96": "Listen #trollers if u are a troller then go and watch troll police dont post any type of cmnt which is bad tapsee mam log kuch bi kahe u r a best girl with the lot of talent 😍😍", "felling_love93": "😘😘😘", "dhamisuhasi123": "Plz di, do some challenging roles. Loved your role in naam shabana and pink but not in judwa 2. Women lead movies are always awesome and plz mam do another women centric movie. Best of luck", "dinesh_ghodake": "No anyone can demotivat person like you ... You are hardworker then you got succes ..", "shoronimredha": "iss picture ki troll ki to bajadi apne mam..... 😍😍😍😂😂😂", "tejas_nikose": "I like that what you did in Troll police", "_poojithaaaaaa_": "The way u gave the answer to the troll in MTV Troll Police was amazing taapsee mam. I think no Troll has the Dare to troll anyone in their life again after they saw ur episode. #Salute#setanexample#proud", "_heyy.ly_": "Wow didi I'm hely and I just saw your troll police and yu reacted perfect and you are best the way you are", "nishu_rajput_3657": "nice", "_kunalkohli_": "Great job mam @mtv_troll_police", "govindjoshi727": "Nice", "shaikh_rafan_18": "nyc", "nasim.shan.90": "Sunder", "ngawangyeshi75": "I think now negative comment on social media must be made illegal after watching troll police. Lmao", "rahantsorout": "Awsome", "samadhans.s.96": "Just watch troll police episode .....respect & love", "single_queen1234": "Im biggst fan f u... ur rockd on troll police... #rspct... lbh u mam", "iamchinmaya01": "U rocked in troll police. Proud for you people", "_deep_7777_": "Nice", "b3ing_uzef": "Ossam💟💟😍😍", "nightmare_8866": "This pic stopped my heart beat😍😍", "nehabarthwal": "U r so strong n after watching MTV trool police 👍👍👍 thums up #respect😘", "versatile_neeraj": "Well done tapsee mam ek rakh ke bhi dena tha use", "mojaffor_sk_official_": "Nice👌👌", "mr.sarang__4246": "Troll police खूपच मस्त शो होता.मला खूप आवडला.aapne accha punished Kiya.", "ms.sabasaifi": "@taapsee eeeeeeee😍😍😍😍😍😍 love ur smile❤😍", "cosmicjune": "@taapsee ma'am I don't know whether my comment would reach to you or not..I have just seen the troll police episode of yours.That's why I have chosen this pic for my comment.Kudos to you ma'am..u r such an inspiration for girls like me who kept quite about the abuses they suffer in daily life..I was completely moved by ur #pink but frankly I thought that can happen only in cinemas but u have proven me wrong..and I m glad for that.. Thanks a ton for being such an inspiration for me..from the nxt time i'd also be vocal about it..🙏🙏😊😊", "rbbristy182": "Osm pic", "ashim6706": "Nice pic", "shekharpriyankachandra": "Love to u r smile 😘😘😘", "arti_sharma._": "Nyc to see u in troll police...u did an amazing job..u r such an inspiration dear...luv u...", "sedsuhail": "Osm", "mohammed_sahil_raza_roman_era": "love u @taapsee nd my favourite actress is @kajalaggarwalofficial ....", "kritikasharma9821": "Yeah i also agree samjhne se acha slap bntta tha bez vo apni galti hi accept ni kr raha tha this is so bad it'z all about a human being think about a girl,a lady,a women respect is very import part. Jo respect ni krta vo akh human ni ho skta.!", "chosetasuske": "So hot", "iamvaibhavkale": "Worlds best pic mam", "its.arsal_khan": "Gorgeous. Love from Pakistan ❤", "kumar735": "Mam maine aapka episode dekha MTV pe Ranvijay sir ke sath........hatsoff to u mam", "harshal_sona_hs": "😍😍😍😍", "ontu_arafat": "I saw your troll police video", "nitz_luv": "@taapsee awesome pic with superb Attitude 🌹🌹🌹", "arihant_jain25": "Very effectively handled ur troll in troll police instead of hitting him,appreciate ur patience@taapsee", "ranjots473": "Cute sister 👍👍👍👍👍", "prahulsoni": "Hahaha.....i was laughing watching dat episode mam. But i salute ur patience level. M hoti aap ki jgh to kb ka usko ek jhapd lga deti🙌😘", "soru9874": "Bohat sunder lagrahaho #taapsee di😚😚😚", "jagruti_21": "@taapsee You look great !! ❤💯 Just watched you on troll police ...you were amazing ma'am...!! 👍 Such an inspiration to the whole conuntry!!! Hats offf to you ma'am..!! 💯💯", "i_am__raj__sharma": "Just watch troll police love your style you are god mam I am your big fan", "sk9782062km": "Nice pic", "asmitamalakar": "Didn't knew it hurts so much", "cruise0007": "@taapsee U looks great, i like your acting in #Naam_shabana, You brave, hats off dude.", "rockstar_aatish": "I love you taapsee", "a_ci_nom_": "😘😘", "shivholic_armaan": "Nice pic mam...", "ayuskmondal": "I love you tapc", "tanishapriyadarsini": "Mam we all are proud of you bcoz u were very much brave in troll police", "sandeepsansanwal": "nyc i see ur troll police video", "raslin1953": "Gourgues", "angel_ishu__": "Nyc", "kayraoberoi": "Well done tapsee mam.. Really proud of u for what u did on troll police 💙also don't feel sad due to those idiots... U r a star ND no one can change that 😍😍", "vaibhavj7": "ಯಾರಾದ್ರೂ ಹಳಾಗಿ ಹೋಗ್ಲಿ ನಾವ್ ನೆಟ್ ಗಿದ್ರೇ ಸಾಕು", "aadishrma987": "@musa_shah_ofical_musa_is_the", "shmena__": "Looking so beautiful gorgeous pretty no words for your pic", "dey.laxman": "nice pik", "clive_vk": "Mam just watched troll police and u wer so brave and matured enough to handle ashish.... Respect and love... may you achieve what you dream god bless", "ghosh_dipuu": "I love u didi...so nice pictures", "pacifi_c": "Wow never knew you were so brave #mtvtrollpolice", "s._r._chowdhuri": "Saw ur #trollpolice episode... It was great... Hatts off to u & that programm", "aleha_neha": "U r my fav actor and i love u so much.......keep on going", "sanjx.07____": "Nice✌️", "rasha_liyakkath": "Hlo tapsee maam i saw you in troll police and i really felt ssad for u that how people like him put coment", "riyahossain93": "Cute", "bhartendra_solanki": "#mtvtrollpolice great job mam💜💜 you are too good", "reenaklair": "Looking ghaint 👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻on mtvtroll polic", "kingsouravmondal": "Ossam cool Sexy", "the.doodler.artist": "nice", "rahat._.ahmed": "Love you so much mam.", "007sagarsoni": "Jordar shbak sikhya @taapsee", "sampad5615": "Good culture", "isodynamic_18": "Lookin gorgeous ma'am @taapsee", "beingarupdas": "So nyc", "poojashivam4740": "Wowww so nice pic", "vimlesh_here": "I lovE u💕💗nyc as alwaysaa😘😘", "rixwan_20": "Hello @taapsee mam, I saw ur troll police episode u were looking damn cute in angry Mode", "gkgolukhan21": "Osm pic", "neirajvaidya": "Very nice", "omkar_kalibag": "Where is aashis_sionly", "nimayporwal": "Looking good", "vishal_2147ns": "Love you", "rohitguptajiq": "i am searching for this gay who comments on #trolls", "tabassum_tashfia": "You are so cute ma'am", "bong_suvo_01": "nice...", "sr__sneha_sahu": "I saw ur epicode troll pulice....👍😊 awossm", "iam_ishaq__rathod": "Mam itne sare apko like karne valo ko comment to like kardo taki pata chale ke aap bhi hamare coment padhte ho", "kanchan7225": "Mam I am your biggest fan and I have seen you on troll police you are so strong women", "nimish.ghumatkar": "Just saw episode of MTV Troll Police !!You were Amazing as always!! And you truly are one of the bravest and talented celebrity in the film industry!!!!❤️❤️", "real_taarak": "#Gorgeous_mam😍😍❤", "amar_shinde.6868": "#awesom ...", "kritisanonlive": "Wow mam😙😙", "mr__cha_uhan__": "So cute", "notyourgoalsbae_": "😚😚😚", "sarita.bisoi2000": "Nyc", "himani_das11": "Awww .. you are fucking hott ❤️❤️ .... Haters will hate 🤘🤘", "anshumali_karna": "I saw this image first on troll police then in instagram", "vikashprajapati3284": "Superb", "shreyas__1o1": "I loved it", "sxhiva_": "hard and prefect click", "di_kaur": "@sandhya_koreti", "avadhutkale": "Nice", "sahilshinghania4786": "NYC pic looking gorgeous", "ajoy2128": "Nice pic", "_.s_.u_.s_.h_": "You are looking awesome", "iamvyankatesh": "Hi @taapsee i saw you troll police episode @mtv , its really encouragement to those who cannot able to raise their voice against slut shaming, eve teasing & all. As actress you are doing too well. I Must say that you will be a most successful actress in bollywood and of course in tollywood😉☺️keep doing well and god bless you dear.", "aarti_patel_31": "You are my role model mam @taapsee", "mac_sk__": "Mam you are so good and brave actress...I saw the show of MTV Troll police...don't be irritated by it..And you so be mercy that you give the gift of apologize", "aabhishekpandey4736": "Mam", "piyushgori": "You should have at least slapped the troll", "sonammalik0104": "Mam Ive watched episode of urs on troll police.... Its really inspiring for all of us seriously... N people like tht man who was trolling,r not acceptable seriously.. BT uh forgv him,,nd thts d biggest thing... We all really proud of uh😘😘 to forgv anybody we need a very big heart nd..,,wt uh did is very difficult😘 love uh mam.. God bless uh", "nehakrish9725": "Lovely", "the_poetic__journey": "#gajab", "taehiiyung": "Everyone after watching troll police be like: istg i won't troll anyone in life. Nice show", "neeraj.pod": "#TrollPic :-p", "im_meetpatel009": "Vo troll police Ka troll person milega to mar dalunga sale ko", "fardin_bishal": "@ashishsionly f", "nitika5588": "Wow so beautiful 😇", "theakashtiwari1911": "Beautiful pic mam", "i_am_mohitb": "#MTV troll police episode ..... Really very cheap thinking ..... apke uski thinking change krne ka method acha lga 👍", "raghuveer_raj_chaudhery": "Helllo mis beautiful. You are good To alll selebritise I'm Big fan Of u. Love you taapse mam", "radhika_9058": "AwSm ...tapsee beta👌", "m_e_g_h_a_r_a_j_r": "I like show TROLLPOLICE....today's show", "13rohilla": "Nice job in troll police I salute u", "am_piya": "such a u hv a strong personality...", "aj_n_y_k": "Nice looking", "_rufi_24.03_": "@ashishsio", "________miss__________________": "Smile😍😍❤❤❤❤.....", "sammahawer": "Super excited pics Mam............", "iqra_.fatima": "I saw the troll police episode😊", "rajesh6229": "Nice looking", "_nigamm.s": "I just watch troll police nyc", "ishitaajainn15": "Prettiestt Mam😍😍❤❤❤", "official_pal_nikhil_": "Love you #$is @tapseepannu you are so cute m yours big fan... Make a reply plx", "_prakriti_ghimire__": "The way you replied the picture trollers was really good. If this goes on , then we girls can breathe in free air!", "chauhanh066": "ur really so qute mam", "thepradipchauhan": "Uski family ko bhi bulaana chahiye tha", "insidious_uknow": "Bad comments na kreya kro MTV wale chak k le jande aa😁😁gharo lehn aade..toor nal troll police endd.. ❤", "smaranika_fiza": "Fab💕💖💗", "puneetkanojia__": "Lovely", "mannu70__": "😊😊😊", "9196_rx": "Grt show mam...Troll police.", "_chickuu_": "#mtvtrollpolice 😎👏👌", "rickdutta_07": "Your looking 2gd tapseer mam..😘", "bhavana2387": "Looking so good ...", "narendra_patidar": "Grt mam ....troll police show with Rannvijay", "ellielli_7495": "Hi ma'am . I watched you on troll police, u have done awesome , love you", "jasspreet_bonsra": "Mtv troll", "hkaushik14": "Appreciate it👌👌👌", "pandeyamit123": "U r supar 👩", "jst_mondal": "Nc mam", "mahisingh2003": "Mam pls kuch toh mess krdopls", "misam.bhojani": "MTV troll police Rannvijay 👎", "gayu_de": "U doing a great job", "solanky19": "Nice pic", "ayesha_akansha_walker": "❤", "alisha_dicuza": "😍😍😍😍😍", "rionarimi": "😘😘😘😘😙", "itz_princy759": "Am ur biggggggeeesssstttttttt fan😘😘😘😘", "tarun_yogi21": "Nyc", "miss_cutie_1089": "I really love u mam salute", "varshit_jain": "Mam saw your episode of troll police you are such a brave women with lots of guts hats of to you mam #truetaapseefan", "aasthathukral6": "Ma'am you are really awesome actor model n firstly a superb human", "s0hail_khan1111": "beautiful pic", "dishatoshniwal": "Oooo osm pic", "mj_nehal": "Human power 💪...aap ne jo kiya ekdam sahi...or @ranvijaisngh sir aap ne jo tarika socha hai bilkual sahi hai tabhi logo ke shamjme aayaga ki dushro ke bareme galt sochna ye kitna mehga padega💪", "charizmaticyash": "@taapsee you are really great actor. We indians love you and please don't get pissed on some cowards who are behind trolls. Just be awesome and cool. you are very strong and one of my fav actor.", "kalkutkiajit": "Cuteee pic", "mr_natkhat_ramesh": "Saw u r episode it was a very good inspiration for the youth of India and hats off to you", "ystar4u": "@taapsee Mami first of all I'm ur huge fan recently I saw your are in MTV show. Mam I definitely say that u done very good job ...😄 Hats of to u mam", "aakashgoyal5586": "Taapsee aapne ye sahi kiya", "daspriyanka_official": "Very nice ❤", "khanliza033gmail.com_": "Very nice", "owais_ash__": "So hot pic ❤😘", "vavinash1204": "Finally saw your episode Mam for Troll Police you always make me proud that I am your #TagJabraFan", "iaaryaman": "I just saw your episode in VOOT \"Troll police\" whaaaaaw ' you've just starred the revolution.", "ruqayya_srkfan": "@taapsee really troll police m aapne bohot shaandaar sabaq sikhaya us ladke ko... 👍😘😘💖u @taapsee", "snehachettri27": "@taapsee ... don't change", "rahuldas.2": "Nice look", "ojaswi_anshuman": "I see men barking here ma'am @taapsee justifying the \"old saying\".. really appreciated what you did with one of them at Troll Police with Ranvijay. As a person i salute your stand against what is wrong and as an Artist i would love to paint your portrait one day and gift it to you personally. \"Life is fine.. Fine as wine.\" Kudos real women. 🙋‍♂️👍"}