{"shadab_ahmed1996": "Off course. Koi bhi lafanda hijab wali ko nHi chhedega haa par koi ladki agar gande kapde pehen kar bahar niklegi to phir pakka hai", "afghan_sweet_winx": "😂😂😂😂😂😂😂😂😂😂😂 why don't u take ur sister lollll hahahaha can't stop laughing after reading ur ugly comment well honestly people like u we expected this kind of words 😂😂😂😂😂 teach ur own sister she needs it more them me.", "betsy_michael5": "What a silly question 😂😂😂😂 obviously it makes differences 😂😂", "iamsameer.x": "Yes", "_blexit_": "Oppression !!! NEVER", "speeches2000": "Qayamat ke din Aag ki kenchi se baal kate jayen ge jis musalman aurat ne apne baal khule chod kar zahir kiye gair mardon ke samne", "smbayan": "👌NO it's a personal freedom", "realbasant": "YEH SIRF CHUTIYAPA HAI.", "pakizah1989": "She is still the same person just covered. She is protecting herself from the pervert dogs which your country india has the most. So what do you prefer? Still beeing naked?", "aisha.pervez": "It doesn't make a difference. Abiding to your religion doesn't necessarily means you are oppressed. You can wear niqaab and still do wonders in life. What is necessary is that it should not be forced. I hope this movie changes people's hypocrisy. People keep arguing that they should not call a girl slut if she wears skirt or jeans. Completely agreed. But you also shouldn't call a woman oppressed or gawar if she wears niqaab. That's equality for all women. ❤", "saiyed_kalim_": "No", "sheytoon_xx": "😢", "waseemabbas2244": "mmmm", "megueni_fatima_zohra": "No For me, women are more beautiful with this hijab", "_.shah.1": "Yes it meam", "sandipan.chakraborty": "Yes it does....one is terrorism other is not", "_aliya_khan21": "Yes", "supriyastyle": "No", "official.aaxim56": "Yes", "sh___arba": "no♥", "shhhperson": "Yesss", "mishra_shivam1689": "Nops 😁", "hamdaabdigure": "Yes alot", "itz_me_nidu": "Yes", "sheikhsamsuddin30": "No", "nazia.ghous": "For many 😭it should be treat as a choice", "themieshasinghal123": "Noo", "amahmood298": "I am Muslim but I'm just as normal you are not any worse or better", "alihassanishere": "A lot", "sadaam050030": "😡😡😡😡😡", "neha__chawan_3012": "No", "blue.v.1": "Yes for sure", "marriam_hussain12": "Yess", "azqars": "Its choice and convenience of each and its also further fear of Allah not to invite strangers to feast upon ones beauty", "thehashmigirl": "لا جدال في هذا الموضوع", "girish_kiran": "A lot actually!", "haris_husler": "Yes", "jacqueline_lovers_forever": "Never", "hijabitraveldiaries": "no", "fasaaaad": "Wearing a burkha is not bad .. it depends on the person .. and one more thing if exposure of body is modernism then animals are more modern then humans ..", "anantsharan": "Banned hijab", "_arbaz808": "Hijab is best", "arsalansarje7": "No mam", "saavn001": "I FEEL SOO PITY FOR OPPRESSED MOELEM WOMEN TO STAY LIKE A LETTER BOX!! 😓😵", "tarasen246": "I like u most", "iamschaudhary": "Omg you are so low class you you think only for your movei promotion only you dony know difference you are greedy for money only shame on you", "rohanagarwal_7": "Then why does in many countries Burqas are banned?? @taapsee", "rohitgupta324": "If in burkha she/he did any activity against nation..How can u identify...Them..", "hani_khan7": "All brainwash uneducated people in comments", "mr.numero.uno": "It's lovely to see people support and respect other religions and defend our Muslims sisters ❤", "focallurebeautyindia": "No need to put up a post like this. I s no Dif in this post. and those who're commenting shittt like muslim women's are forced to do so. That's our rights. We cover our head not our brain, you guys don't need to teach us about freedom stuff and all.", "mayank_shukla30": "I really respect you tapsee....used to think u take bold decisions n stand for what is right. But apparently you take decesions for money or controversy/publicity.", "sheriseslikeapheonix": "Ur religion is a shame to mankind and so r u.. get ur other assholes educated first so they dnt need to kicked out fm ol the countries.. eg Myanmar,..", "vig6683": "Do you think we are jobless", "bhavuk7garg": "Yes it surely does , why a girl is asked to cover her whole body apart from eyes and if her body is exposed she is killed by her father husband brother why!!!??", "abhishek_pratap_thakur": "Sikh or christan ka tag kiu nii lgaya bs hindu muslim hi krna ata bc ..", "hshekhar62": "Yes it does !!! It makes a huge difference. Go ask out an Athiest about this, and he'll list you out all the differences. Wait, do one thing, ever heard of Sir Richard Dawkins ? If No, Google it, and listen to his point on Islamic oppression.", "nwna_1999": "No", "suhira_m": "@analyst_1oj as I was saying, a democratic country has to respect every individual and has to treat them equally regarding their race , ethnicity, cultures, religion and etc. Liberty, Quality and Fraternity. These are the basic foundation of it. That's why they have to give everyone their freedom of expression and speech. They have to give everyone freedom, freedom to do anything. They have to give freedom because they're a democratic nation and country. If they're banning a burqa because of veil and because it cover their face then they should ban every single item that cover face. If they're banning hijab then they should also ban a bandana, beanie,hat,cap,turban basically everything that cover the head .if they want to ban a religious dress code then they can do it,they should also ask Father, priest, cleric and nuns to dress normally. Because it is a democratic country , one religion is not above over other in a democratic country. They have to treat everyone equally but they're only targeting Muslims and their dress code. Why shpu", "glam_doll._": "@raziq.sherzad7 no u hve to chng ur mindset not she", "zynab_bi": "Yes", "_princenamdeo_": "A very big difference", "akshay_sajeev.790": "No diffrence...", "nooshafarin.a\nVerified": "Verified", "raj.khandkar": "Yes", "apurvashankar123": "Non-sense by Taapsee", "a33q8q": "Yes one like a diamond 💎 we should cover it ❤️", "shireen_fahdk": "Mam actually it makes no difference it is the mind set .. I myself wear a hijab n find it uncomfortable without it.. I love wearing it ..", "ashamed_shaik": "Tmhra mu tedha kyun hai kabi gour kare tm khuud ki movi me", "pharoahfootball": "Islam is oppression", "surajpat77": "Yes it is a threat to any nation in terms security reasons where each an every should show there face irrespective to the person belonging from any caste or religion go out in America and dare do such crap I bet they will shoot you in the face .", "warrior_never_dies": "Ya", "dasbeedisha": "yes against burqa i have problem . if a man hv bad eyes and intension of lust towards a muslim woman why she hide behind s burqa . it should be the man whose intensions and bad thinking should be changed and if pardah is to hide a woman from bad ills we should also make the man wear burqahs so no woman can put bad eyes and bad intensions ovee them .even a girl wearing burqa and not wearing it getting raped or victim of abuse or molestation it should be us as a society should change our thought process rather than hiding behind a piece of cloth . or if nt happening make new rules whr man should hide their face behind burqas to save their prestige from girls", "vdia.s": "Terrorist yahi se aate he. Halala ki nasle 😂😂.", "bibbidibabbedibu84": "It does", "ar.mujahid.habib": "Really a terrifying feeling when I put myself in your shoes, that uneasiness is disturbing 😅. @taapsee these comments and fights without any logic and i think when it comes to religion most people go blind. Best wishes for the movie. May God keep you safe and make you successful. 🙏❤️❤️❤️❤️💐 And keep up the good work ✌️ cheers", "harr_ssh": "Areee mam...toh apko kon kehne aaya bhi k its does make a difference??? Kyu jabardasti ka khudka soch normal ppl pe apply kar rahe ho???", "_._arbaz_shaikh_._": "YES IT'S MAKE A HUGE DIFFERENCE.", "shubhakhar_gupta": "kavi freedom ka toh kavi burkhay ka? confuse mat kar", "fareed.achakzai": "Yes it makes because problem is not with covering face its in religion some religion cover his face and some don't its a big problem", "nikhil_biswas007": "Yes loads of difference", "fayiza_vizuna": "Of course there's big difference coz if w are Muslims our religion is most power full and also only my religion islam says that women all her body is ''owrah\" and Islam is the best religion in the world only wait and watch for it and does ur religion teaches you to harras my religion Islam 💞 o", "mjadeja23": "yes it does", "numaanrehman": "Be indian first.... Dont offend any religion. Please keep the matter clean. Islam says respect all and respect all people feelings. We all are indians first. Lets keep it that way and please dont talk rubbish about any religion. Giving bad word to religion is not going to effect teaching of islam which to be pure and devoted to allah. It is only going to hurt sentiments of people. Which brings anger in minds of people. Where i stay in my mother land india and my locality with dont talk hindu and muslim. We talk being indian first.....", "dhruv_2207": "No", "_prem_thakur__": "Different .tooo.much", "sarahk211955": "Yes! just like how a chocolate with wrapper has frm a chocolate without one👍🏻 #HijabRespect! #RightToChoose👍🏻👊🏻", "yashnano": "Taapsee pannu posted this pic of difference in religion and made people fight over religion but she herself is not responding to her fan's comments she is just enjoying our fight😂😂dear taapsee Ji it makes a lot of difference I was a big fan of yours but when I saw ur this side my love for u has decreased in just 2 mins I'm not a fan of yours anymore 🖕", "mahak.astrologer": "No body is disowning anybody here in India. I have seen many Muslims who refuse to say Bharat Mata ki Jai even while breathing here. Many kids too and they say that their parents have ordered them not to. Now what do you have to say about them? Will you make a movie on such people??? No, you won't, cos underworld ka paisa lagta hai movies mein and underworld is all about Muslims. I am not against Muslims, my best friend is a Muslim, but always blaming India for everything is just not acceptable. What about Kashmiri Pandits?? They were dragged from their houses brutally. Why not discuss that? Why not let them be back to their houses?", "simran_kaur_1_8": "Big difference", "irasidd_": "Every religion is best👍 we all are 1 ... baki chutiyo ko bakne do jo bakte h", "sherin146": "Yes it does make difference miss @taapsee 😠", "sana.masroor.18": "So much hatred for one community ! Hope films like this leave a good impact ! @taapsee gud work 👍👍", "sporshiya_rhman": "😍😍😍😍", "puja8189": "yes", "madi.b905": "No", "views_outta_blues_": "Hypocrisy at its best", "naveed.afridi.58152": "If you permit me i would like to share my opinion.", "shivkanya_pratima": "there is no beautiful religion then islam it just takes right vision to acpt it .... I Respect ur all traditions 😊", "lboy9243": "yes", "shreyarium": "Yes it does make a difference... Hindustan hinduo ka tha hain aur rahega... jai Hindustan", "chirag____9": "Sab kuch theek hai Humare desh me...tum log bc kyun aisi movie banate ho.🙏bandh Karo tumhara yeh drama...@taapsee", "flp.param": "People will never ever understand . No matter how hard you try to made them understand. I am pretty sure that movie will be great and people will also enjoy it ( ENJOY ) they will not try to understand it. Religion means a way to live and a medium to connect to god. But people always tries to disgrace others religion. People who follow islam they have completely studied there gods book at age of 10yrs but people who says who to them they didn't even studied single page of there gods book . So people please try to understand each other . Nobody wants war , no body wants any terrorist attacks , no body wants something bad happens to his family but there are some people who are using religions to establish difference . Spread love and peace. Bcz that's what world need . I follow sikhism but don't hasitate to visit Masjids , Mandir . Respect each other.", "pacifikkk": "Quran: 8:39 : “ wage war on non muslims and kill them until they surrender and follow only religion islam” this is what ISIS and many other terrorist group is following and worshipping 😑 now fuck off you all bloody terrorist.", "yash_bankapur": "Yesss", "aadeez.neha": "Superb mam", "ajwakhan00": "Alot of difference", "lazyy_devill": "But yes we all are same!!", "sakeeb888": "Nobody force anyone to wear burkha it's completely their own choice and if you knew why they wear burkha u will be surprised how good it is for girls actually I think every girls wear burkha one way or the other like in Islam it says cover the head to keep out from dust cover your hand, so that sunlight doesn't damage ur skin & wear light long skirt or similar for comfortableness , even the Nuns wear same dresses just different color.... Some people wear hats to cover their head from dust same thing..... 🙂 Just different design!", "az_boutique__": "It's so sad to read hate comments about my religion(Islam).. Girls who wear hijab or burqa they are not forced to wear them they are comfortable,and happy to wear... How can you guys judge that they are being forced to wear. In Islam it is mentioned not to force your daughter or causing her harm to wear hijab or get marry........ Have a look at your hand the length of your fingers are not same ,similarly all Muslims are not same..... So don't judge.... Those people who are writing hate comments about my religion don't forget it shows more of your religion spreading hate... If you have a choice between being right or kind ,, choose kindness", "meaarushi.2066": "Yes,her face colour changed", "md_arfat_007": "Yesss", "freinds_call_me_sam": "BURKHA YANI HIJAB AAP NE KAFI LADKIYON KO DEKHA HOGA JO MUSLIM HAI LEKIN PARDA NAHI KAR TI UN KO KOI NAHI RAUK SAKTA AGAR KOI RUK SAKTA HAI TU WO HAI USKE BHAI USKA BAP YA USKA PATI PURI DUNYA MEI MERE HISAB SE (72 MAZHAB HAI) SAB MEI SIRF EK MAZHAB HAI WOH (ISLAM) JISME ZABAR DASTI JAHIZ NAHI HAI AGAR KOI AURAT BURKHA PEHNE TU USKI MARZI AGAR KOI NA PEHNE TU USKI MARZI KIYON K SAB APNEاعمال SE PEH CHANE JAYEN GE) BURKHA MATLAB APNI IZAT KO CHUPANA AGAR KOI ISE ACHA NA SAMJHE TU USKI MARZI (اسلام عليكم(I'M LIVING IN SAUDI ARABIA(", "kirit9361": "No....", "mr.shaikh_5": "Ha to bc tu paherti ho ja burkha", "humanity_always_first": "Yes it has made a d/f but need to understand but sorry to say that liberalism consider headscarves in negative sense.", "sayan.xyz": "Muslim behen burkhe sent azadi chahte hain kya dogi ? Flim banaogi is pe? Nakli actress jda uchal mat", "saleha.sultan": "Go and follow @manjullll please", "ananndhu": "Ya girl without parda and girl with parda 😁😁😂😂", "the_arpitjain": "Yaa! 1st defines neutrality and 2nd defines a religion code!", "darknet_renu1969": "Time is ripe for these beautiful women to show their faces publicly. The world has been deprived of seeing these beautiful women who are the greatest creation of god.", "fahad_siddique23": "All peoples are idiot wo apni film ka promo kar was Rahi aur tum yaha behas karre #wtfisthis", "sminjryprumz": "I don't know wat the movie will bring at the end. But all I want 2 say is when a girl put on lipstick and Kajol or any makeup and then when we compare it without makeup there is beauty in both ways u always have your choices. Likewise, well, when a women wear burkha or don't it's choices.", "mudassir_shaikh_officiall": "Duniya musalmano k liye kaidd khana hai aur kaafiro k liye Jannat hai", "hafsa_yasir": "Yes, it does!!", "vishalmarwha": "Yes Cute girl turning bitch", "chetan.shinkar": "Yes", "dhruval1289": "Yes one with burqe does not have any freedom and one wihout burqe have all the freedom.", "ayeshay.farooq": "@beard_lover_dobriyal its not like that bro Islam is the only religion which makes women more powerful. islam taught the women to fight for their rights. and islam is the only religion which made women and men equal. \"And for women are rights over men similar to those of men over women\" QURAN. search about it bro ❤", "zoha8536": "Yes", "_saa_varada_": "She had just put it as a part of her next movie's promotion. But the comment session seems like pre - Independence situation..", "pragya7110": "Perfect !", "insta.user07": "It's a girls personal choice whether she wants to wear hijab or not.no one should be this much racist it's everyone's personal choice how they want to look like", "mohapatrai": "Boaring", "_23_dead": "Yes ofcource", "utsa2006": "Yesssss..it makes a difference which is completely visible", "jmborah26": "U Islam told to beat wife do u think as a girl u should follow islam", "shabnam_inclko": "Wt type of difference u want to see", "shubh_sk18": "@taapsee yeah it doesnt make a difference", "ashishjumade": "Yes this makes a difference.burkha is a identity of Gulami,unequality", "duttad99": "Silly topic.Now a day's it is very popular topics. If a person wants to be in dark it's their choice. Let them be. But do not cry for gender inequality in other place.", "prabs4sure": "Yes, it does. 1st one be of any religion or no religion, but the second one is surely muslim. To all the earlier posts in favour of burqa, I should say that there's more women who are forced to wear it than who willingly wears it.", "rajinram_": "❤️", "umar_har": "One knows how to.respect herself !", "mumma_qureshi": "Yeah it makes a lot of difference. If i ask you to choose a candy @taapsee which one will you choose the uncovered one which is dipped in soil or dirt or the one which is covered with a wrapper", "xharry07": "Ofcourse🔥🔥", "aisha.ansari.35728": "No. It does not make differance to those who's religion is \"HUMANITY\"", "sanjaymahadevan": "for them..yes", "kirron_bindu": "It’s helps cover up physical abuse so yes it is a big problem . It causes vitamin D deficiency .", "_bharat_231": "Yess", "mr.love_buttu": "Mask", "raa_sik": "If u can't see difference,kindly refer to doctor", "tajmark_": "#Follow", "ameet_aj": "Stop portraying Hindus as bad and intolerant people.", "rahul_shitole": "Does this comment section makes difference...???", "anushkas.fp": "No", "music_5505": "Yes", "abhijit510": "No", "the_kevalpatadia": "Yes", "aakash.akki": "Can they tell bandey mataram...yes or no doesnt matter but they should respect their motherland....nt like kashmirians(some of them)..... I m nt seeing people as hindu or muslim or sikh ...i only knw one thing they are indain and i love all of indain ......", "rockstar_sabita": "😀", "bindass_ayesha": "Main kahu bande mataram itna joh hai baat ka yeh maat bano muslim terrorist nahi samjhe brother", "jayantchowdary": "It makes a huge difference but its fine bc we are all meant to be different, human kind is made up of different traits", "vivekyadav5750": "yes", "ashiqur4280": "yes it different such a fruit or sweet ugly or open but coverd item alaways save from bad devil", "0theraw": "Why these people are proud of their religion#hindu#muslim#sikh#cristian ?A person can live without religion and god . Muslim womens wears Burkha not by their choice , it's mandatory for them. Let them choose their choices .", "19ankit86": "@aisha.pervez don’t give gandhis example, his death was a murder not a terrorist activity .... kindly go learn history educated urself", "_sanket___02": "#rss jay", "arun.banotra": "yeh sub movie say pehlay kyun nhi poocha . for promotions you can you do anything. asifa ka rape hua. tab tou sara bollywood board pakady kda ho gya. m hindustan m ashamed. tou jab geeta ka rape hua tab koi bollywood star board pakda khda nhi dilkha humay board pakday. board padkay chodo kisi nay bola tak ni kuch uskay baarey mein.. islam ka phobia inko pta hai. lekin hinduphobia nhi dikh rha inko muslims ki traf say.", "sydaj_official": "People are so mad na all people's you want to change Islam but you don't know about Islam you want to change Hinduism but you also don't know about Hinduism mazab jessa b hai accha hai unn ko chor do please tum sub se zada wo intelligent ginu na mazab banya thaa pata hai agger kisi write ki story mein koi thora b change kerr da to uss ko kittna darrd hota hai tum sub appna app ko god manta ho mad people sorry for any abuse and thanks for reading may God help you @taapsee", "prashant24sept": "Yes it does make difference @taapsee", "nandinikoppunuru": "Not at all it doesnot make any kind of difference according to mee", "mdsheamkhan": "yeah it dose...... we should select right one for us......", "io_neeraj1": "Yes it makes if You take ghoonghat liberal says kuriti...bla..bla..when its come to burkha...liberal.says wallah...culture...respect...These liberal only creates different", "subiya_arneeb": "S it does", "poonambharara87": "No", "rohan_joshi1717": "Throw these Muslims outside the India.....these Muslims bullshits always do wrong thing in our country they always hurt our country...", "arav.sengupta": "Doesn't make a difference.. it's their choice.. but we see that differently coz burkha is not a common among other religions..", "siddiq.09": "Ha yes", "fayzu_xd": "Agar meri baat ak percent bhi sahi na lage toh mujhe jitni chaahay utni gaaliya dedena jaisa aap log duaro ko dete ho....I really don't mind that ..........Mere hindu bhaiyo or beheno Kisi bhi Burkhah pehenne vaali ladki se jaake poocho ki isme aap ko uncomfertable nahi lagta itne garmi me bhi....... agar vo Islam ko acche se jaanti hogi na toh vo ak hi baat kahegi ki Islam me dusro se pardha krna bohot zaruri hai...fir vo kounsa bhi time kyu na ho.... Ladki ko bas apne Maa Baap or bhaijaan se hi normally rah ne ki ijazat hai or apne hone vaale Shohar(husband)se......bas me yahi kahna chahta hu ki Islaam me Aaurto ko bohot Aala darja diya gaya hai 😊......per aaj kal ki generation burah or hijaab me bhi fashion krne lagi hai......or vahi per aisi baatien nikal ti hai..... 😥😶", "chaware.amit": "Nope", "mashalikhann": "yes! it does :)", "bhawanachandora": "Right @taapsee", "chherruu_2028": "No..", "hamza.hanif786": "Yes ......", "sohampuranik_": "Yess.... Mad", "labadesudhir": "@taapsee ..Yes it is difference ... Focus on your career dont get into . Otherwise we think that ur movies watch or not....", "mi_rahulpatil": "Yes definitely", "wazir_imad": "Yes........", "ranjantarafdarreal": "Ary you sure you are asking this question ???", "imjaved06": "Bbhot difference h hizab me rahogi log ijjat krenge hizab me nhi rahogi log comments kreng", "abhi_7676_pro": "Uaha", "rhythmtanwar2": "Nup", "jenetthomas": "Follow me for photography and personal blog❤️❤️", "_iamtalibkhan_": "We r living in a society where a girl wearing shorts and mini is asked to cover her body bt a girl with nakab is slave also they arguing to ban nakab. Hats off to the society.", "ithakurmamta": "Suffocation vs independence", "96k_eagle_2910": "Rights of individual", "keshrajput": "Comparing being naked to face covering is absolutely stupid. Tbf you have no valid argument. You try to defend face covering by comparing two different concepts. The argument is about face covering. Not head covering or body covering. Simple as that. When you start to differentiate these then you might understand.", "ankit_som_": "Whatever religion you follow,,, whatever religious believe you do have .... don't ever dare to say your religion is the best.... If you want equality,then respect all religions equally.... Those who are advising to read someone their religious book,,,they first need to go through the religious books of other religions. If you don't respect the religious values of others, don't expect the same", "kavya_vermadolly": "Let the lady decide in what she’s comfortable.. who are we to tell", "bloomingsensations": "#judgmentfreezone #respecteachother #liveyourlifethewayyouwant ❗️", "shilpa.gharde": "Yes", "sanmithahs": "It does. If it is custom y not for mens?", "kapilpatel1880": "Chudedan", "sam.sinhainsta": "It's horrible see a girl in burka in a hot humid days in India, and it's horrible in visually.", "shaista_kalam": "No", "nasrathullashaikh": "There is no difference in both of them...one is being precautious and other is not ....totally depends......jab swine flu aaya that to kya kare re the Janta....nose piece Laga ke ghoom re the na....veil or burkha Wahi kaam karta hai.....gandi nazron se aur gandi soch aane se rokta hai.....kyu ki mardo k muqable me aurat kamzor Hoti hai.....ab jab mardo ki baat aa hi gayee to ...Muslim mard ko chalte waqt Apne pairon k angoothe Ko dekhte hue chalna hai.....taaki ..aurat on pe ghalat Nazar na parhe....aur ..mard galat Nazar se baat dekhe....", "shubhasish.m": "Yes very much difference.", "kiziehungle_hemgame": "I love you", "akshit_bhatia43": "Muslim make themselves different. Not their rules.", "mondalssagar": "Yes", "souvenirutama": "wah nicee hadiah lucu untuk acara islami. kepoin yaa", "sayan1srk": "Yes", "kamalr_93": "No", "akshit.2.0": "Yes it is", "diipak.pvt": "Yes", "mak_ibne_usman": "Yes it does make a lot of difference, please do your homework properly, I am a big fan of yours mam, but I think covering your body & face in Islam is not by force it's by individuals choice , please do proper research on these subjects, Lots of love & respect 😇🤗 @taapsee", "xxslayer.khan": "So many educated people of our nation are spitting shit in the comment section about a religion they came to know from fake bjp it cell .", "arfi_the_vlogger": "Aree jo burkha pehenna chahte hai unko pehenne do aur jo burkha pehenna pasand nahi karte hai, unke sath jabardasti na karo.. Bas.. Simple sii baat hai.. Apna choice se life jiyo, majburi se nahi", "refizasouvenir": "keren 💙", "sameerkumar506": "Yes it make difference, if you cave covered your face by a cloth , especially black and silky , it's almost not possible to identify the person behind it. That person may be a threat to security too. @taapsee", "anni_singh_thakur_": "No this is just a showw off ...", "mohona7971": "No", "aishu_sari": "Yesss a lot", "samkashyapofficial": "I love u tapsee ..im your biggest fan in univerce..... 😍❤❤❤❤❤❤..!", "nadgire_": "Yes..", "afshanzafar61.49505": "Yas more than any thing", "moenbobak": "Yes", "youtubersshoutoutpage": "Yes", "gaurav_saha1144": "Yes it makes, if it doesn't why don't you wear burkha while travelling any where or while posting your picture.Just for movie you all can go to any extent. You don't had anything to do with it just playing religious cards for your promotion.", "_friendly_hero_007": "Are you Bollywood actresses are giving paid by Terrorist groups ?", "priya.indica": "Yes it does and now don't bring up the Hackneyed concept of religion of peace, all religions being equal and respect for all the religions . There is no such thing . Oppression is oppression whether religiously ordained or not", "iffi__doll": "We love tht", "faisu_hassu_addy_fan": "Yes @taapsee", "aliahussain.ah": "yes it makes a difference🤔", "haseeb.ashraf6": "Big difference", "priteshpathare_official": "For the security reasons YES it does.", "mangleshwar98": "@taapsee definitely...👍👍👍👍👍👍", "iam_adittya": "Ya it's make difference.. cover the face make it feel uncomfortable to others.. & u don't know what is inside the hizab, man or woman or terrorist 😂", "carinastylin": "✨", "zeeshan.iet": "It's women's choice if she wants to cover her face or not...", "rahulk11": "It does make a difference.. burkha clad woman have to sleep with her in law and sophisticatedly called as a nikah halala", "ankit.30": "If doesn't what about feminism??", "shahbanoahmed": "Those who donot know the difference shall know it v soon", "_manjit__rabha___": "Fake feminism", "jetsetter2025": "Yes. It does. This is 2018 and no woman should ever be covered like this. It is insulting to all normal men and women to see this.", "__iron__heart__3000": "No", "thakurpriyanshu_gaurav45": "Yes it make a difference of hindu and Muslim", "yasirarafat8811": "Yes it does, ek behaya hai aur ek bahaya.", "siddharth_tripathy_30.7": "Ya it's a huge we can't indentified the second one", "iam_themoulik": "Hypocrite Bollywood,always rise their voice for human rights,faminism, women empowerment.But now backing a religion's animuses,..@taapsee ...👏👏👏 Hypocrisy to the power infinity", "smodassir786": "Simple answer Bro duniya mai sab se pehle kon aya malom hai adam read saboot bhi hai chaye to srilanka jana hoga tumhai", "merijaanjannat29": "Yeh Jo burka or without burka kind baat par bola 80 % Muslim mahila burka pehnti hai", "sumit__chaudhari": "Ofcourse I see a slave...Do you not", "siddharth_gangele": "Yes it mee difference little bit only, one side girl becomes ninja on the other side just an ordinary girl 😋😋😋", "iamabhinavsharma": "I called them alien because they look different in veil. More than weird", "kapilpal27": "@taapsee yes it does.....when ur covered no one knows who the hell is inside it", "mainkuin": "Yes", "sandee_the_saviour": "It makes a difference if we think it does. Otherwise it's all the same ☺️✌️", "rukiyagamada": "Yes", "alex_ku_sanaya": "Very big difference", "rajeshgond0": "Big BIG difference", "amanmishra0799": "Obviously it does ....", "ssusheel14": "its a symbol of dirty eyes....", "nabhikantil6": "Shut up u bloody mind ur own business", "sksaksham8": "Different", "jeet.kashipuriya13": "💝😘👏", "gourav_sharma_0": "Yes it does..", "sami_fan_of_samantha": "Lot more difference", "snak3man": "Yup... The girl in black will boil to death", "sharon_florence_": "No every one s same don't feel insecure", "le._.bunny": "yes a big diffrence you dont know what a terrorist look like untill shes uncovered", "wanna_be_ca": "yes it makes a difference.... in 40+ degree heat they are made to cover their whole body as if a gift item... and if that doesnt make a diff why dont you fucking carry it in award functions or parties.... chutiya bollywood people", "simone_iranii": "Off course it does,we don't know what is the gender under the hijab???male or female???", "aksmb20": "Of course it does", "md_eilliyas": "Burqua dikh Gaya tho bas religion ki bat cheyddety hein log , Bhaiya yeh Dekho ki Woh donobhi ladkiyan hein ,aur Hun difference hein Woh yeh ki apni Sooch ki", "saifu.x_": "Yes", "ashu388866": "Yes, someone hiding a face from me, I cannot trust that person.", "ashishraazz": "Second one z still in the clutches of fundamentalist of their religion, I guess!!", "aishakhan9410": "dying to watch", "priya_singh290": "Only outer look difference... Ntg else.. I don't lyk", "foodie.raj": "Yes it causes vitamin D. Deficiency in most of mulim females....", "vkkk10": "Yes it does Mulli. Can you just use it for 1 month regularly and see how many movies you get further. #muslimwomen", "chiran306": "Apki dil juunhlee khai mil q nhi rhi???", "bablu02199": "Yes", "malikkk76": "May be not for you, but yes for a woman who loves to covers herself.. depends", "king_of_king_ss": "No", "aleezaahmad76": "@taapsee ma'am!! it says, \"tum naqaab mai raho, log auqaat mai rehengey\".", "umerkhan_m": "It does make a difference, but that’s also what makes you special! Being different is being special.", "anand_dhakane": "No", "viraj3988": "Tere ko difference nai dikhega", "anand1330": "@taapsee yes it makes difference. We are not able to see their beautiful faces under this burkha.", "arvindkumar.jaiswal": "Yes goto airport in the any part of world u will see difference", "rheak_007": "#equality#equalindia#equalreligions", "abdallah_s_ismail": "We Muslim do have respect for all the religion's no matter which religion you're or which cast . But unfortunately i saw many comments of Hindus are against islam and it proves that how much they hate us (Muslims) . Now i have only 1 question. Does Hinduism teaches to hate and talk bad about other religions? If so then Hindus are the worst creatures on earth. Hit like if you agree", "justmonu": "yes, she look like a thief..", "dougweiand": "killer page 👍", "md_shah_khan": "Yes lots of diferrence", "iamshivganeshsahu": "Join all my frnds my page designsvisions", "muaaviyaansari007": "Yes it does.", "fatima_roshni": "No it does not make any difference.. The difference is in a person's eye.", "shirshendughoshal": "A lot one religon treats women as slaves other as equal ,try the other would know the difference", "premmann880": "Ager apni merji hai to no different per agr majburi hai to is different and very big different @taapsee", "abhi950w": "off course a massive difference ,but propagandists won't get it.Skipping this movie for sure.This movie will just be a propaganda,nothing else.", "iamranveeryadav": "It's shows fear of society 🙄", "iammd55": "Umm it's make some differences.", "ravindrasinghshahi": "After knowing ur #talktoamuslim one muslim lady talked to him in zeenews and she got the awesome reply ... 3 punches on her face by a proud muslim in front of the whole country", "neha_thakur_0007": "No....", "lokesh_ltx": "awesome", "sayedfaraz3901": "Need of time.. looking forward to MULK", "mzm.ali.khan": "If a christian priestess covers her face according to her religion then she is not objected. Same in jews case. Sikhs are also asked to tie a turban on their head and not to cut their hair. And also have to keep a knife with them. Hindus worship cows and monkey as their hanuman but these all things are true because their relegion orders and allows these all. But if a Muslim women puts on a veil according to islamic orders, some mently sick people remember the human rights. If it is so, then why hindus burn their living girl with her dead husband?? Why sikhs are not allowed to cut and show their hair?? Why new born hindu children are given bath with nasty cow piss?? If there is no suitable guy for a hindu girl in her damn \"Kundli\" why is she forced to marry a dog instead of any guy?? And most importantly why all these shit is neglected and only Islamic values are pointed?? This shows ur sick mentality and nothing else. Keep ur shit to urself none needs it.", "akkihayat": "@taapsee i hope ur movie change atleast few of the mindsets.... disappointed to c so many educated ppl arguing illogically on dis ... dey have issue with hijab bcoz it gives freedom to a women to not let ny random guy see wat he wishes to c... n dis frustrate dem... so dey r against it ... if u r talking abt freedom den everyone should b free watever dey want to wear n u should nt dictate which dress is appropriate n Which is nt", "iam_sirajul": "Yes", "viv1ksingh": "Yes", "kamalika_roychowdhury_": "Yes of course it does....", "sherprs": "Yes it does", "md.iqbalali": "If other religion have given women so much freedom and power then why india is most dangerous country for women ahead of Afganistan & Syria..", "_soutikasm__": "For a country like India.. It does. 🇮🇳🙏", "chishtimaria": "Yes a lot", "hurairax_x": "Women should be in burkah", "young_age_soldier": "😂😂😂", "deeraj.kumar.167189": "No matter is difference... Mam 😃", "mrinalkaushal": "Yes it does ek me chehra dikh rha h or 1 me nai 😁😁😁", "ajaysingh117": "Do you support burkha or any other form of hizab or veil? Don't fall to nadir to promote your movie. Shame on you.", "waqarsiddiqui997": "😘😘", "_sami_chowdhury_": "Obviously it does", "tejas474": "😆😆😆😆", "dineshkirantadi": "Why are u doing a business with sensitive issues", "anushnakul": "Yes", "awaisahmad35": "Are you blind? you did not see Difference?", "godfather__x": "This question exist?😏", "adita_sharma0988": "Burkha in pehnenge to dozak me jyenge KY??????????", "im_ashish11": "Yes", "knowsudhanshu": "Yes it does", "sunilthebest007": "Yes, like same same as you said New Year crackers are celebration and Diwali crackers are Pollution.", "mani2167": "Yup there is very big difference", "hashtag_gyani": "Yes, kyo ek mahila ko use outfits chunne ke adhikar nhi hain?", "jnzeb": "Women is soo special thing so it should be cover bcz every special thing are hidden like gold diomond etc", "asjadhabibtarar": "Yes", "rrai203": "Just wear it for one day in summer and you will know the difference 😊", "wish_smile_": "Nice joke", "sampabhawani": "Yes", "vishu_panwar17": "Yes make", "its_vienni_03": "No changes, caz sometimes girl will recognised by her talent not by her religion, her dress can never measure a girls character", "abhishka105": "yes...religion has been mend us...not the what we are meant for. Gita saar.", "tikly_a_sinner": "No never", "shaguf_m": "I can see no difference because they will still remain a woman with or without burkha and secondly i can see lot of muslim people defending islam and its teachings to non muslims. I have a request instead of writing on social media about islam try to inculcate all that practice in daily life beacuse people will understand what they see and not everyone can research quran and study and thats why we are being told to show we are muslims through our actions and not our mouth", "xx_inzys_95_xx": "Impress the creature not d Creation @taapsee @ayeshh.farooq", "shanidap": "Just for ua movie promotions.. do you really feel this???", "sarunkumark": "Yes. I can’t see the hijab person if she is angry or happy.", "himanshusaini07": "It's make a huge difference between an Indian and a terrorist", "_gup_aakshu": "Liberty independence and cultural Orthodox me fark hota h", "shweta.50": "All d ppl commenting anythng abt Islam or burqa or freedom of muslim women shld frst know d religion and its values... Islam gives equal rights to both men and women, saying anything without knowledge is stupidity", "suhira_mehvish": "This comment section is horrible! Sad to see too many educated people with such a stupid and idiotic mentality. It's their CHOICE if they want to Burqa let them be. What's your problem? A Punjabi Sardar also wear a turban you guys don't question them! Why not? It's a garment. If you have problem with it then YOU don't wear it. If someone is comfortable with it then let them wear it. Why don't you guys also ask nuns to dress normally huh?! Stupid people.", "gabrurao25": "One will have one husband and 2 kids and freedom and the other will suffer multiple husband(her own cousins)/maulvi ka halala/many many kids/full restrictions etc.. @taapsee may be a good movie ...but if it's about muslim women then it's crystal clear that they had/are/will suffer", "shahid_md__": "Yes there is a difference", "vinay_01_": "I think difference dekhna waalo ki nazro m hota h......n 4 me there is no difference.......everyone have there rights so jine Jo pehana h wo wo phen skta h....n I hope kisi din sb ek dusre ko ache sa judge krega esa kpde , caste , face ya disri chigo ko dekh k Ni👏", "loveeyouuxoxoo": "Yessssssss burkha is for good people", "dinkar_thakur": "Not unless one is forced and other is criticised", "abdullhamishal": "Dont post that things you dont know", "abeer_jutt": "wow... everyone just comments that burkay sy azad kro . azad un ko kraya jata hai jo qaid mn hoty hain . muslim aurtay apni merzi sy burka kerti hain .no one pressure them . mn mannti hun k kuch aurtay pressure mn aa kr burka keri hain but is ka mtlb ya nai k jo b burka krti hai wo pressure mn krti hai . (i thing its just an silly question. )", "arwaalikhan93": "Ap mrdon ka msla pta nae kiya h poory kpry phno to msla, choty phno to msla ..... Chadur lo to msla ... Bikini phno to masla", "rahul7630rathore": "Ye mera javab h Tapsee Jara dhayan se padna", "mrcool_rohit": "Muslim woman have no freedom. Worst rules Nikah halala, triple talaq, polygamy. Please give Muslim woman freedom.", "im_deepak_5ingh": "Nooooooooo", "ayusha_k66": "Yes it does make a difference.", "cpt.mukherjee": "Never", "nfafab": "Let people wear what they want, what is your problem with that?", "adrsh.gaurav": "Yes it does..what kind of religious law is this who tell their women to cover their face...i wonder why these feminist doesn't say anything on the condition of muslim women?", "sobaan.qadir": "yes in cover it makes women more percious.. women's are more superior and percious thing are not easy available to see😊@taapsee", "sagarsharma8498": "yes it makes a difference the girl without burkha is independent and free and the girl in burkha is filled with narrow minded thinkings.", "roopali_15": "@janmeet_bhatia - after washing your hair vs you in real 😁😂🤣🤣 @manisha.g9988 what say?", "___ishanjain___": "Yes", "not.not.byte": "Muslim countries...is dust countries leave India..go Pakistan", "darxan__xarma": "Yes but it should not be.....", "antonslumberart": "Fuck it, check my page for AESTETİC LOFI HIPHOP content", "rajhardik98": "I had watched your movie Soorma on 19/07/18 an awesome job done by you. Keep on going and achieving heights. With lots of love Hardik", "shandilyavishwadeepak": "Yes it does", "rida_princess_fizuuu": "Yes", "habibroohani": "No", "sanaa0819": "Yes it does..... burqa or naqab is more satisfying for me .. bcz it give me more confindence and make me feel more protective from fazoool mens ... and it depends on you how you live ... your life your choice ... ni one is allowed to judge you....", "mhaldar24": "Maybe", "sam_15k": "Yes it makes lots of difference", "hishamx_xtoi": "Bhai log it does matter without hijab ab ye bat to smjhdar hi samjhen😐", "gurpreet_singh11241988": "I think women jis bhi clothes me comfortable feel karti hai use wohi pehana chahiye force nhi karna chahiye", "israr.s": "Dear sister @lipstik_in_the_city Aap Parde Mein Rahogi Duniya Aukaat Mein Rahegi", "kayita.manisha": "no", "pk_bunti": "Chehra dakh Gaya pata nai chalraha meena hai ya heena, Moni hai Soni....", "i_am_lucky_singh_gill": "Muslim pe bharosha nahe kabhi nahe mane kiya tha but they are evil and never think that you are friend ne er yr kabhi bharosha nahe.", "djyadav25": "Yes there is a difference like 🍁🌼", "prasann__soni": "You are right", "guppy_49": "Of course it does. One wld be blind to not notice the difference.", "_rafi.hasan_": "It does", "tarsem_singh04": "Nice", "jash659": "Yes there could be a male terrorists too", "niazi_alltheway": "Baat simple ha insaan ki souch theek ho bs jab dekhene walay ki souch saaf hogi tu burka and without burka doesnt matter Islam islam kar rahy hain sab baat parde ki ha manta hun but iska te matlab nhi k larki ghr se na aye souch ka parda sai karloo tu sab theek hojye ga #respect_women pls 🙏", "garima_shastri": "Haa..bhai..prr mei..akele koi kuch nahi kar sakta hai jb sab...saath mei honge tabhi yeh possible hoga..means agar kabhi koi girl problem mei ho toh aapko bhi help karni hogi aur muje bhi aur sabko jo log specially khade hoke dekhte rahte hai..jb girls problem mei hoti hai..tabhi...nation...ke kaam mei hum aayenge..humein sabko 1 saman hokar..burai ke khilaf ...samana karna hai☺☺☺☺", "ashanegi2015": "Yess it does . Surely", "amin_adaa_khan": "Now a days hindu girls also wearing Naqhab it's our choice", "official_lavi": "👌🏿👌🏿👌🏿💙💙💖💖😍😍😘😘😘👌👌👌👌👌👌", "sidraq_": "No difference i have seen many muslims wear burkha whereas many don't its just like many Indian ladies wear saree some of them not @taapsee psee", "blue_missy_": "U have always inspired me a lot 'n' i think the movie should be a big hit just to show people, it doesn't make any difference @tapseepannuofficial", "mann1794": "Yaa, definitely its matter, you didn't got the role by covered face😎", "sailor_friend": "Big difference", "vatsal_parmar_9": "Yes it do makes difference", "antikaliyuga": "LOLZZZZZZZZZZZZZZZZZZZZ ZZZZAAA ZZZZAAA..YEAH ..IT MAKES HUGE DIFFERENCE.......THE GIRLS MUST WEAR BURKA..ABAYA..IT HELPS IN FOCUSSING ON SMTHNG PRODUCTIVE ..THAM SMTHNG **REPRODUCTIVE** ..LOLZZZZZZZZZZZZZZ. @rakulpreet AEY RAKZZZZ..RE SAMJANA ISSE.... AEY CIRCUIT....YE MAMU LOG KO SAMJANA RE .... BIKINI ME SALLI LADKI DEKHTE HAI .... SALLI KHOPDI GHOOOOOM JAATI HAI ..360* .. @vindhyatiwary @vajanianeri @simransachdeva1 @ektaravikapoor RE EKIE...SAMJANA ISSE ..LOLZZZZZZZZZZZ WHT DIFFERENCE ??? LOLZZZZZZZ", "rajendrasrivastava82": "Yes,men and women are equal,if man have the freedom women also should have same freedom", "the_february_man": "Yes it does", "beniwalrajeev": "ये ही तो फर्क है, बुर्के में कोई भी हो सकता है आंतकवादी भी हो सकता है।।इसी लिये तो जांच होती है इनकी", "vinodkerala56": "Some Islamic scholars have stated the religion doesnt require women to cover their faces", "parasraheja": "No", "mr_perfect_khan_": "Iska jawab muslim ladki ko khud dena padega......muslim ladki ko khud bolna padega...hum ladke in jaise murkh log ko samjhayege to inlog lage ga k hum apni maa baheno ko force karte hai", "punit_kum": "yeas", "ampr1387": "A lot!!", "justmedeepak": "Yes it's makes difference", "anisamaity": "Woooow", "devendrasarswa": "Madam kuch or try karo ese nahi chalne wali movie", "habib.ishfaqq": "@taapsee , bad girls want attention , good girls want respect , this is what makes a difference", "ajeet_theboss": "Ye sare filmi bhand pure gyani ho gaye...Paiso ke liye halala tak karane wale gyan de rahe hai", "sumatijohri_028": "no", "vairaagi_shubham": "Yes", "devgauravdwi": "😅😂🤣", "ninder11": "No difference...... Difference is in peoples mind", "joy.choudhury.186": "Yes", "hamxxa_khan": "yes it does", "nick_patel81": "Tap", "sammy18072000": "Yes, it make a difderence...if she is forced to do just for the sake of religion...if it her choice then it is okk @taapsee", "ravs21": "Yes it does.. Why do they have to dress like a batman ? Scary", "iem_irshad": "No", "harini2409": "No", "namita378": "No it does not make a difference", "sudershan.s": "Movie ke liye kuch bhi karega", "renuka280996": "Agr yeh dfnrc h to apni cast ko bhi manna bnd krdo unke asoolo ko bcz usme bhi nht kch h or yeh kch glt nhi h isme hq ki bt nhi h yeh sirf india nhi poore wrld m h or muslim poore wrld m h jinko soch h usko bdl nhi yeh islam m h i knw mgr yeh yeh sahi h", "priyayadav1088": "👍👍👍", "subhash_jsr": "Wear designer dress and cover it with burkha, then ask same question to yourself.", "adhikaralasomashekar": "It makes no difference. Both women are in foreign attire and foreign looks.", "chitrasharma95": "No", "rizwanqazi7": "Nowadays in India it matters", "forever_akela_j18o20": "@taapsee aapko aaj yaad aa raha ye sab jab aapki movie aa rahi iske pehle ye sab par dhyaan nhi diya aapme kisi ne😒😒😒😒", "munira.ra": "There are Not differennce💋", "sanket.gupta.14": "Yeah..!! Girls with hijab can explode..!! 😂😂", "sayalii_0823": "What an epic idea through this movie could be conveyed is getting into deep thoughts to think and acknowledging them.. kudos!!! to the whole team for such an brilliant idea .. Specially @taapsee such a versatile artist ....💛💛💛💛 #mulk", "midnight_rambler1010": "Jab tum log movie leke aate ho tabhi tum logo ko ye sab baate yaad aati hai like...Burqe n all ...baki waqt to bss chill kartey ho 😅😅😅😅", "sipan_sk": "Yes", "ayantrivedi": "aur,puchte kyu ho chutiya bnane ke liye jb rply ni krna hota", "anup__17": "Ya a lot", "ramzyadav": "Yes it does simply as light and darkness.", "m.udaykiran06": "Yes, God gave face and a man gave bhurka", "__arnulf__": "Ye religious content wali filme banana jaruri hai kya??", "tapasdatta_sahu": "No", "dhrruv.sharma": "Ya they look eeyu", "r_a_h_a_m_a_n___": "Ofcours", "ayan.cute.arif": "Looking good in burkha", "ashwinigond284922017": "No", "princeguleria": "yes wear it on summer days then u wil come 2 know", "_ravinder._.singh_": "Good", "viraj_pandya_": "We all are humans. God bless everyone equally", "abhishektyagi4808": "Yes, it does. If she thinks herself Muslim before calling herself indian", "zarish_khan77": "😡😡😡😡😡😡😡😡 Tum logo ke pas Kuch kaam bacha nahi hai paise kamane ke liye to aese wahiyat tariqo se Kamane ka zariya nikal liye Hum khud ki khushi se hijab pehnte hai tumhe koi right nhi hai Islam pe Bolne ka beshram", "akadhana": "Yes", "inayah_khan06": "Yes, A LOT 😊 @taapsee", "its___bassanio": "No", "roark401": "You can ask what is the difference to the women in Iraq who started the dance revolution against burqa... they will give you a much better answer @taapsee", "vickytiwary09": "Yes.....at one pic the woman is free to choose her attaire !", "chetankr0210": "Yes , how many times you live with that . I m totally against it . It is against human right because our country haven't weather and geographical condition were it's need to wear .", "khiladi_ak_": "Tu burkha phen lo", "rupamela6": "Great post...", "preetilamgora": "Yes", "_sabhehe8_": "I know taapsee ji,what type movie it’s Gonna be. So proud that in society we have someone who understand this problem. Respect for mulk producer,cast director everybody. I want thank you guys for making this movie. So proud of you guys. Good luck ❤️", "umakant004": "Of course", "arsalanpathan1029": "Yes", "improhit": "Yes it does make a huge difference. I think there is no freedom for Muslim womens. Muslim women has worst literacy rate.", "youcanmailpragz": "Yes", "harsh_gupta_3145": "No it doesn't", "marvellous_dpz_zone": "♥️♥️♥️ʟᴋɪᴇᴇᴇᴇ ♣️♣️♣️♣️ʟɪᴋᴇᴇᴇᴇᴇ ♥️♥️♥️♥️♥️ʟɪᴋᴇᴇᴇᴇᴇᴇ ♣️♣️♣️♣️♣️♣️ʟɪᴋᴇᴇᴇᴇᴇᴇᴇ ♥️♥️♥️♥️♥️♥️♥️ʟᴋɪᴇᴇᴇᴇᴇᴇᴇ °•★°•○● ♥ ●○•°★°• 💕💥 ʙɪɢ💥ʟɪᴋᴇ💥💕 ʟɪɪɪɪɪɪᴋᴇ  ┊ ┊ ┊ ┊♥♥♥♥ ┊ ┊ ┊ ★♥♥♥ ┊ ┊ ★♥♥♥♥ ┊ ☆ ♥♥ ★ ♥♥ 🍁.•°°•.👑¸.•°°•.🌸 🍁( 💖 ʟɪᴋᴇ°°ʟɪᴋᴇ••ʟɪᴋᴇ~~ 💖 )🌸 🍁•.¸🍂🍂🍂 ¸.• 🌸 🍁 °•.¸ ¸. •\"🌸 🌺ʙ ɪ ɢ ʟ ɪ ᴋ ᴇ🌺 😍😍😍 🎻🎻🎶🎶🎻🎻 🌾🌸 🌼 🌸🌾 🍁🇱🇮🇰🇪🍁👏👏👏👏 ♥️♥️♥️ʟᴋɪᴇᴇᴇᴇ ♣️♣️♣️♣️ʟɪᴋᴇᴇᴇᴇᴇ ♥️♥️♥️♥️♥️ʟɪᴋᴇᴇᴇᴇᴇᴇ ♣️♣️♣️♣️♣️♣️ʟɪᴋᴇᴇᴇᴇᴇᴇᴇ ♥️♥️♥️♥️♥️♥️♥️ʟᴋɪᴇᴇᴇᴇᴇᴇᴇ °•★°•○● ♥ ●○•°★°• 💕💥 ʙɪɢ💥ʟɪᴋᴇ💥💕 ʟɪɪɪɪɪɪpᴋᴇ", "kartik_ladawa": "Yes alot!", "viraj_newoor": "Big difference", "im_maheshwar": "Different to madam bhuraka pahen ke aati hai... Aap hi btao agr ek ldki Saree pahenti hai or ek ldki bhurka (jiska chehra tak na dikhe) to different aayegi hi..... Aap acting hi kre politician na bne... Or paisa kmane pr dhyan de.... Nhi to na flim kv chalegi or na hi aap.", "narendra.anand.73": "Yes it's a huge difference", "aquibkhan_007": "@tapseepannu Wait... soon some #Bhakts will arrived with their... nonsense point of views..", "wagha_refugee_kohinoor_ak47": "All r 1", "_._prathibha._": "Yes", "i.am.ankur_shukla": "Srf woman nhi man ke sth bhi difference hoth hai or srf ye Hindu Muslim nhi other cust mai bhi hota hai or srf glt ek nhi hota hai sb equal responsible hai.... Sb ek dusre ko nicha dikhte hai.... Kbhi koi kheta hai Muslim glt hai or kbhi koi kheta hai Hindu... Not wo insn glt hai jo glt soch rkhta hai.... God is One.... Don't make issue we all r god son....", "get_ashish2006": "Burka me atankwadi bhi hote hai", "ma_fantaisie_1998": "Of course not at all", "sandip_debnath_": "Yes it does", "sherry_munir": "Yes alot", "am_tahseenmalik": "And i m really very happy to know that u non muslims wanna do something for us but believe me we r comfertable in burka", "_ayan__chakraborty": "Just boycott this movie..", "gkaur19": "It doesn't make a difference unless she is being forced what to wear!! I see people defining women as a soft and weak!! For all those people -\"we don't want ur help to protect ourselves, work out on ways how men with dominating nature should act with the upgrading society \" we should all be liberal in our thoughts..", "monis_khanshab": "Is cheez ko aap nhi samajh sakte", "lensmaniac_rs": "No.. Religion doesn't make a difference neither any sense", "mohanvishwas05": "Yes it make difference entire Bollywood has turned into Paid bigots you will even strip down to promote your movies and then you will call it a path braking act", "harshabhadauria": "Yes it does. It freeks me out. How to could anyone put that Thing every time they step out.", "__ammara15__": "Yezzzz alot", "bsouradip": "Why didn't you ask that before your movie promotion??", "niyas_niyaaaa": "♡ ♡", "_____rex______": "Yes", "saarasaritagusain": "Just a matter of thinking", "quixotic_ankit": "Yes it is!!", "rajiv_the_hindu": "Yes...its make more difference in freedom....in women", "mkantgupta": "Yaa definite!", "thakurakshanshchauhan": "We know and you know too,, Most Muslims are traitors and they are from ancient times and i'm a Rajput So i know this thing well you can read the histories of wars between any muslim and of another caste and ' sorry for all miss TAAPSEE ji,, And I have asked for forgiveness bcoz i'm fan of ur cuteness", "sadiq_patel_h_k_": "No", "raghvisankhyadhar": "jb baat muslim pr aati hai tb sarai bollywood star jaag uthtai hai😊", "mohit._.kothari": "A women is a women it does not matters weather she wears a burka , chudidar or any thing else treat every one with respect", "majhi.disha": "👩👩👩👩👩", "kukrejaanahita": "Not at all", "lt_col_chikara": "Yes it does", "robie857": "Yes face is covered", "nishitsalian2": "Legend", "ahmedsyed3268": "👍👍👍", "manishdev.singh": "Yup it does.... When u refuse to show ur face for the VOTER CARD , it does", "mo_junior44": "Yeah it makes big difference as well as sense its the difference between muslims and Hindus", "me_sankap611": "@taapsee - Chehra Khula Ho Ya Dhaka,Usi Ki Soch Ne Usko Baya Kiya.... From @me_sankap611", "akash_jaihind": "Yes it does..And if it doesn't then start wearing burkha in this super hot weather and then we will ask u the difference..", "sharmaabhishek10497": "Yes", "yd_official_edits": "No", "____s____k____y____7": "no", "_yadavjee_____________________": "Both Yes and No... Yes bcz one side freedom and other side slavism..No bcz women is women", "loudspker_achu": "Sahi hai koi fark nhi padta", "md.affan.99": "never...👬", "her__mysterious_eyes": "Really looking forward to see this movie. Lots of love. It really take guts to do such roles❤️❤️❤️❤️❤️💚💚", "akash_salunkhe_": "in India it makes difference...some have to show there love towards the country but some are assumed to be love there country.......its India nothing is fair here...sorry to say but that's true", "vikunjsingwal": "U r also spreading hate among people by sharing these kind of posts for ur movie promotion. And one more thing do u really support woman to hide her face bcoz a man can see her with evil. Is this ur woman empowerment?", "ishaan___07": "Yes it does", "chrgprk": "Yes", "mohdasad4020": "It matters if you are watching with the political spectacles otherwise not at all .religion is personal faith so I think nonody have any problem with one another", "iamshakirazam": "Yes alot", "khanmashal1009": "A difference of honesty to culture", "iamzacduuzha": "WheN you wearing hijap is the best", "sukhi_malik": "As a muslim girl yes....huge difference", "vishwa_sanghvi24": "Yes yes yes @taapsee", "thenamesaysumang": "Eagerly waiting what kind of Bullshit this is!!", "hashimjad": "It doesn't make any difference unless someone is already aware of the personal rights, freedom , etc etc whatever and still makes a choice to wear a hijab today and shorts tomorrow ..lol", "user20uu": "No .....", "iam_rawdydevil": "I don't think so", "mmpatil_456": "women's empowerment", "_shruthi.ii_": "Nope", "singh_abhaytomar": "yes it does", "suraj.agarwal.255": "Yes it make a difference there might be a human bomb behind burkha and now you all are not concerned about freedom for women,why they r forced to wear burkha were are bollywood gangs", "zahid.2002": "Yes different bhurka is safe.", "sheikh_saqibi": "Always @tapsee", "gunner_asim": "It's funny how every one who has said yes in this post are not Muslim women whereas for whom it applies have said no", "sumaiya_gel": "People choose to wear it or not, no1 is been forced, so get out of ur dark minds and c da picture clearly, do not mislead ppl, everyone has a choice.if u c ppl wd hijaab its dey choice does not mean dey r bn oppressed lik wise wen u c a nun coverd.", "jamil_shakib": "If u want to be naked go ahead its ur choice but mind it there is much more hot in hell than this summer in earth.", "shirishakandukurifd": "😄😍😍", "aditya8321": "Yes it does...", "karthik.tn": "Yess", "kohlirehaan": "Mam aap to yr religion ka fayda utha rahe apni film ko promote krne k lie. Its not fair", "vinit8178": "The later shows extremism, \"murder of feminism\", which I believe you yourself stood once and again. So ma'am, it really does. Please do not spread such an unreal propaganda which may mislead a population.", "rvjain05": "Yes ....arti malhotra halala or triple talak se bach sakti he...bt arti mohammad nhi", "iam_taarya_": "👍👍👍", "adibapopalzai": "For all of those who think women w hijab are forced, Are totally in the darkness. These young women are choosing to wear a hijab or a bukra w their own choices. Especially in the US. Islam is growing w the going generation!! But it should never be forced. It’s a chive.", "seenu_fr_dz": "No", "shubhs_2207": "You’re asking this? Is it not evident? Yes it does.... slavary!! Why don’t you try ask Swara Bhaskar, Kareena who converted from Christianity to Islam.... n enjoy!!", "adv.rukhsarkhan": "No difference! Becoz its our own choice. If a girl wants to wear uncovered its her choice and everybody agrees with her point of view by giving her freedom that she is living in a democratic country but I don’t understand why people have such mindset that somebody did cruelty with her thats why she’s wearing hijab ! I mean why such people go and ask or find what’s her choice ! May be its her choice she likes to wear hijab, she likes to be cover! Because all women in islam is totally wearing hijab right! Then why seeing the bad people and listening their bad comments which is totally in favour of wearing hijab ; states a religion on their comment, why! I don’t think in such comments a religion is driven, I want to tell you all who is in against of that please try to understand islam is not the religion who is forcing a women to cover their self with hijab , its her choice to wear it not an order to wear it. And if we the women like to wear whatever we want to wear then this all in the list because its our choice not others then please ✊ respect! #itsmychoice I am also Muslim and a law student and nobody force me to wear what i dislike & it can be anything and Mashallah my family my father support me on #mychoices", "luxmibhatta": "Kuch khash difference nahi hai bus burkhe pe face nahi dekh raha", "samad.husaini": "Yes of course", "sanjeev.balodia": "Yes it does. Ask the ones please who are under it. Will you wear it day in n out", "leeray2938": "A hell lot of difference not only in India but in foreign countries too", "bsonusharma": "@taapsee There is no difference in people it is the difference in thinking of people towards religion", "sumit__bhardwaj_": "Yes it does @taapsee.... Can't you see..", "proxvjrgk": "Ohh yes..a lot", "dasdebdeep": "Yes it makes a lot of difference", "saadgeekoli": "Yes prsnlly it makes difference but socially every prsn is same.", "sanjana_prakash96": "The only thing that Makes difference is choice.. and all we need to do is to accommodate and respect choices.", "1mananwins": "@taapsee : Yes , it does make a hell of a difference . If a society thinks that a woman is only an object of lust and thus she must be covered under a corpse cloth like burqa then there is something wrong with the society .", "bhav___naaaa": "@taapsee There is a big difference... please ...In todays world secularism is a threat for our Hindu religion... And if secularism goes on then one day will be there when #Hinduism will be a #history... We have to save it from Islams", "llaunso": "Maybe or maybe not", "rudyboyakki": "YES bhurkhe main ladki hi hai hum kaise maanle.", "bavekuf": "❤❤", "omnarayan937": "Nice", "mangalraj11": "U r the smart one ,and u know the difference. One can be identified another can't be.", "rocking_rohit_mandal": "Obviously yes, burkha is a tag that indicates that at any point you hav to undergo teen talaq and halala ! Aur kb kaun allah ki deewani andr bomb rkh k aajye aur jaan se hath dhona pd jye...😂", "niharikagoyal_16": "Yeas", "fmodi1": "https://www.news18.com/amp/news/india/man-who-forced-daughter-in-law-for-halala-with-him-booked-for-rape-police-1816463.html?__twitter_impression=true", "rahuljain9296": "I does", "starboy_dhruv_": "Yes of course", "sutharkh": "Ma’am you are killing it via asking questions again again @taapsee चाहे मेरे सीने हो या तेरे सीने में आग लगनी ज़रूरी हैं", "shobhitpoppins": "No and it's our religion to take this dress or", "shailesh___nighot": "Yes it does....😑", "shraddha_aisha": "Yes", "_cute__munda__0029__": "Nice", "devvvrat007": "Yes", "aksy_agrwl": "No", "bhpesh_shelake": "Yes It dose", "sajal_dabas": "One of them is a slave", "_k_r_r_i_s_h_": "No mam. Burkha pehen na ladies ki majboori nai he. Hindu community me bhi ladkia khud apni marzi se poore muh pe dupatta lapet ke rakhti he. So ese face parde me rakhna ladki ki khud ki choice he. Koi dukh nai he unne ese parde me rehne ka", "chowdhury_meghla_": "Of course baby there is a big difference", "nyk.rokx": "It depends upon place to place .", "ishqwala_ankur": "If u live in country like India ...then it absolutely makes difference", "sandeshkhandgaonkar": "Yes it does make a difference...burkha symbol of oppression...live under code of religion..not give freedom to live with own thoughts", "eshaanm18_": "Not at all", "xuoss": "😍😍😍", "rp_batheda": "Very big.... Freedom", "the_secret_girl.22": "Tq for support😘", "rahulkumar17091": "😎", "hkainat389": "Yes ☝", "vk.shastri.543": "#only_one_call_change_your_life #chet_on_whatsup_ +91-6377239965 #_समस्याओ_से_परेशान_तुरंत_कुछ_घंटों_में_समाधान_वो_भी_घर_बैठे पंडितो, बाबाओ से धोखा खाए जरूर आजमाए। #only_one_call_change_your_life #chet_on_whatsup +91-6377239965 I will do 100% solution with in 24 hour. Love marriage, vashikaran, lost love back, husband wife dispute, home problem, abroad problem.Kamdev MAntra for love by Babaji,,online black magic to get love back specialist baba ji,, Lost love spells Voodoo love spells,,, Husband Wife Love Problem Solution Baba Ji,,", "whoveenit": "2nd u cant see..and wonder if u can communicate", "the_silent_knight17": "No there is no difference between the mulks there is a huge difference between the thinking of people 🙂 that would be never change 💔", "iam_puneetkumar": "#TRUTH_OF_LIFE IT DOESN'T MAKE ANY DIFFERENCE THAT WHAT ARE YOU WEARING. THE DIFFERENCE IS ONLY IN THE DIRTY MINDS OF SOME PEOPLE'S. #WOMEN_EMPOWERMENT #AMAZING_THOUGHT", "israr1008": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "muneshshek": "Nice😍👌", "deadblackmetal": "Yes burkhe wali Ko aazadi nahi h aur Bina burkhe wali z free....It does make a difference...one is progressive nd other 1 z regrrssive", "dxnagar": "Yes", "lipstik_in_the_city": "Yes it does, why should she be asked to cover her face in this heat, I have a problem with that!", "khushisingla18": "Yes", "mr._.abhay": "No", "maanihehe": "No", "bearded_dobriyal": "Muslim mahilaon ko to aazadi hi ni h", "dear.shruti": "Not at all..", "isandip_life": "It does my friend, in the name of freedom ,please do not push people toward darkness", "abbas_selot_official": "100%", "anirudh_singh_jhala": "Vse fans y celebrity kuch bhi ho jae reply nhi karte hena", "sumitverma1608": "Noooooo", "rikitaupadhyaya": "No it doesn't make any difference its our thoughts which does the discrimination", "jashan_sandhu__": "No Difference 👍🏻 @tapseepannu", "panabamita": "Nyc.....", "chandra.mohan.murmu": "yes", "iam_s0nu": "Yes Clearly", "akash_powky_": "❤️❤️❤️❤️😻😻❤️❤️❤️❤️", "virat_cr": "No", "i_am_pratikbhaip": "No", "choudharyangadkumar": "Insaan ki soch", "fahimgul49": "Yes", "hussain_ashrafi3": "Yes it make difference", "gurmeet.3108": "Big Difference", "im_pasha_shaikh": "S", "mohd._.arslan": "Nope", "_manjusinghhh": "Wow", "priyapaul0710": "No difference", "hapee_b_l_u_e__fe_et": "S", "_awesome_girl_012": "awesom", "lalita.masih": "Awesome 😗😗", "ajaysuman0408": "Nice", "deadlyoungod": "😍😍😍😍😍😍💗💗💗💗😂💖💖💖💝💞💞💞💞💞😍😍💗💗💖😂💝💞💞😍😍😍😍", "anilpandole9063": "I love you taapsee mam❤️💓💚💜💋", "noorsaba9543": "Definitely not...", "k_a_h_i_r": "😍😍i really Luv ur hard work😘😘😘", "gc_hulk": "G", "in_my_little_wonderwall": "no", "rahul_soni_just4u": "no", "ali_murtuza7": "Big difference @taapsee", "_.akshi._22": "Of course not", "jwel_here": "Wow", "jeewanjotbawa": "First view", "_khushsidhu_": "Awesome", "rk_strack": "PLEASEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE", "zubairahmadmir": "Wow", "king_of_pubg2734": "No", "vatslagaur": "@snakes.head"}