{"swatcat247": "No i never wanna skip any video of yours❤u r my inspiration ❤my favourite, I've learnt many things from you like self defence, struggle, hardword, simplicity, being passonate etc... U were always awesome... I never wanna miss anything from u... U r such a fantabulous actress that I've been following ur work from a very long time... I also wanna become an actor and u r my idol.. I always wanna become just like u😘", "himanshu.swain.92754": "Waoo so miss arti Muhammad Ap ya bhi sochia Kyun ya Sab kuch sirf arti Muhammad ka sath hota ha kapoor ka sath nhi bcs most of terrorism is from Muhammad.", "savitaaswal": "Thik to hai...checking honi bhi chaey...", "ran_seema": "Very nice, but I think", "shivi_audichaya_": "😊", "uswaizum": "💞💞💞💞💞💞💞👍👍👍👌👌", "anjumsadiqa": "Thank u for giving a movie like mulk love u pannu for all ur work..", "lax_ahir____ll": "Nice", "mishra_shivam1689": "U are Inspiration MAM👏", "creatures_of__habit": "Creative thought.....", "shabbir_exceed": "Thank you so much", "noorfatima530": "Great❤️❤️❤️❤️❤️", "itsmeayesha284": "You are the best😊😊😊love you di.", "guptajatin07": "Kyoki katuwe madar", "akshayyadav96": "It's simple, Muslims are territorist and Islam Spreads terror @taapsee . Your act in movie doesn't make any difference, go change the mentality of Muslims first 🖕🏻", "rahsut311": "Sorry not only name changed. Your culture changes, your ideas change, your future generations change to believe in monolithic GOD. And you become majority, borders of nations change leaving minority with no rights or even life which you think ( think not truth) you are missing.", "chshaheer_zeerak": "make movie nam shbana 2..", "vijay1776singh": "Cultural change and acceptance of terrorist religion", "shaky_0007": "Salute mam 😍", "chalkeria_asmr": "hamesha se Muslim target huve hein.. If us till don't trust go and stay in Israel for at least 3 days.!! U will know the difference!! Why Hindu? Why Muslim?? Why someone have to target someone??!! Can't we stay in peace?? And about terrorists all Muslims aren't terrorists .. Instead terroriss aren't even Muslims.. Who does this sin they doesn't belong to any any religion they belongs to animals am sorry even animals r much good..!! But terrorist people have no religion !! How many times it should be explained like how many time to how many people??? If for example a Hindu does a wrong thing which is beyond Hinduism rules.. What do u call that person?? A Hindu?? Say?? When someone breaks rule which is not showed in particular religion then those that person belongs to that religion? Does that even person is termed as to any community say!! NO a big NO!! Why always pointing others religion stay in peace and harmony!! Open your eyes people open your eyes.. That's all which I can say!!!😢", "monicatripathi_": "तापसी कोई ऐसी भी मूवी बनाओ जिसमे तुम्हारा नाम रुकसाना मलहोत्रा हो ।।", "shubhammmahar": "Saw it today! I know it's too late but your acting it was amazing!!! Great work!!!", "queen_of_diamond_eyes14": "❤️❤️", "satyam_0308": "Kyuki kisi kapoor ya malhotra ne hindustan ko nahi luta aur na hi aakrman kiya. Muhammad ne kiya. Itti si baat pta ni iss bollywood ko smj kyu ni aati.. down down bollywood", "sahilmakhija24": "A first line of your dialogue I like 'you can skip if you want' really it attracted more to viewers but if this dialogue you said I shammed for you", "mack_d26": "awesome", "ravi_nagargoje_": "☝", "samratmgopale": "Great movi👌", "mrmaksud.khan": "You are right 👌👆👆", "devsoni621": "Indian constitution and Islam l don't nogh anybody comments Islam good n bad but my thgouts every Indian Hindu n Islam cast brother n brother 🙌", "mo_rteza413": "میری افگانی", "adilshaikh6280": "Thank u so much for giving a movie like mulk"}