{"mehdisyedadil": "Very Beautiful idea. You look fabolous.", "sanazoheb1": "How beautiful r u Dia, like a real life princess.may Allah bless you always", "amin_shahsavari_1995_": "i love you🙌🙌🙌🙌❤️🙌❤️❤️😙😙😙", "rahish68": "So pretty my beautiful sister💕💕💕💕💕💕💕", "as.hwin264": "U never dont know...i 💓u", "shubhammujumdar": "😍😍", "iamdhruv_20": "#nice #love #gorgeous #handsome @iamdhruv_20", "fatemeraeesi110": "Thank you.I couldn't agree more.", "zaidahamedansarisz": "😍😍😍👏", "gopal.bainada.9835": "Love a mam", "prashant_hasyagar": "Thanks for caring environment, everyone should follow the steps to #beatplasticpollution @diamirzaofficial", "pradeepjet": "Hello where’s my tag", "nayzjayz": "@relma29 @sunainashetty - stop buying water in plastic bottles", "nehachandra6573": "Cleaning this copper bottle is tough", "abbas_1261": "دوست دارم 😂😂", "happy.jhander": "I love u dia mam.m happy from amritsar.1 nd only u r my fav.bollwood female actress dia mam.mai bhut fan a tuhada mam.guru ramdas ji tuhanu always happy rakhan mam🙏❤", "oneyashwant": "@diamirzaofficial aur jab aaspas ro Or filter ka water or minral water nahi hoga to kon sa pani piynge ?🤔 One litter is not enough for me in travel or all day work 💼 in market some time plastic water bottle is good i think", "dolonbose30": "Looking so pretty 😍😍😍😘😘❤️❤️❤️❤️💙💙💙love you", "goyalharish383": "How can u differentiate between single use or multiple.. Every mineral water bottle is thrown after getting empty,still lot of single use substance are used", "call_me_sareen": "wow", "vulnerable_kid": "Nice bottle", "mahsw__aqaee": "Dia I love you so much you are beautiful", "manashtasa": "Glass bottle is also good. May be used as a substitute of plastic bottle.", "ostrich_ahram": "آفرین بر شما👏👏👏", "dr.sgkumawat": "😍", "sunshinewithbluesky": "👏👌Doing same for my kid school, office, n home..", "asta_prani26": "Cool 😎 max 💯", "urvisukhparia": "Have you given up meat considering effect it had on environment? Why such convenient concern for environment and why such hypocrisy", "saeedeh3886": "جذاب و دوست داشتنی 😊💖💖💖😊", "chaatpapri": "PLEASE tell your fellow industry peeps to stop promoting bottled water ! So happy that you are using your social media platform for promoting sustainable practices 🤟🤟", "arvindkumararvindkumar811": "🌹", "dimensiondrag": "Guys...Looking to \"Get Married\" Find Your Soulmate with us ...Visit Us@ www.joyweddings.in", "gurfatehsingharora": "👌ap jaisi sunder golden botal 😘💓", "f.momina": "Ur the anna hathway of india", "neerajaji": "So do you refill the bottle at the airport? Please guide, I want to do it, but it fails at the airport and transit journeys", "i_am_sachin_powar_": "So beautiful pic ❤ ❤", "d_sujeet": "Why everybody is expecting people's should get inspired and opt out using plastic. Idea is good but how much time will taken to this process, to educate and develop people's, actually in india the variety and education level of people's it's looking very difficult and time consuming way. Instead why government is not banning the production and shut down factories ? Attacking root cause is the best way. Whats logic to choose longest and toughest way. If plastic products are not being produced, then are people's making it inside house and use?", "minu_ganesh": "I reuse the keventers milk shake bottle and steel bottle as my water bottle and carry it everywhere and refill it whenever the water gets over.", "bhargav1901": "❤️good morning❤️", "pra.1940": "Stunning", "gujjaveeraswamy": "Ummmm", "sujaya_banerjee": "...Beautiful... 👧", "ni3parihar": "Even I purchased 4 copper bottles best alternative . Thanks for promoting it.", "kumar_aashay": "You are motivation", "anilsharma2831": "Examplary....", "bhawna.bhatt.feelings": "Applause 👏", "sat_ki_div": "Hi @diamirzaofficial mam, yesterday I finished your series #kaafironzee5 . I just dropped here to say you look stunning in this as usual obviously and my goodness your acting was just awesome. I love you Mam. You are my favourite among all the actresses. Since childhood I am watching your movies but after watching your series I am again falling in love with you. Keep the good work Mam. Love you 😍", "ra.askar": "💙💙💙", "shraddhachachadiya": "Plz tell me the name of your copper bottle brand.", "prem.jyoti.3": "Hi Dia, appreciate your efforts. I am living in a small city where proper sagregation and disposal of solid waste is not done by public as well as mc. Just a thought if plastic polybags n bottles can be recollected by departmental stores which are omnipresent in India.", "shahhoori": "Ur beautiful inside out. Making the world a better place", "arsh_941": "Totally right ...👏👍👍", "pr_6699": "Love", "giri4you": "Love for dia never since my college days❤️😍😘", "tabassum9295": "So preety🔥", "harishpanchal.kumar194": "Osm pic mam", "dayaljay_jd": "❤️😘😍💝💥", "aniket_sngpt18": "Mam we are not that rich like you so, Tupperware products are liable for us actually 👍", "sonu_7853": "😍😍", "kimshelar": "True that, and I too have a copper bottle and this year got my child a copper - kind of decorated version for school", "nawazjee987": "Wow your so beautiful girl ......... I'm big fan ..... Rehna hai tere dil mai😂", "qaisar.abass.902": "So beautiful and very nice so sweet lovely umhumh i really like you dia", "vibhakaleofficial": "Love you for this ❤️", "sethis_monika": "I have switched to steel water bottle that goes with me to office and a copper matka at home to store drinking water. I have started buying refills whenever possible. 😊", "_shrutimore": "@diamirzaofficial yes, even I switched to a new water bottle which is not made up of plastic, trying my best to avoid any plastic goods. #beatplasticpollution", "manali8.6": "Save Environment + improve health 😇", "ayandegram": "❤️❤️❤️", "shubham_maratha9990": "Nice", "nisargpatel6197": "🥰", "dipu8608": "Loking angle diya ji", "as.ena339": "۹", "jaliljalilsayyad": "🌷", "ayaan_mark05": "❤️❤️❤️", "sujeetsharma476": "So beautiful pic and cute l am use for Steel bottle with Milton", "yaseen.syed.99": "👌👌👑👑♥️♥️", "mofazzalhossainrizu": "Marry me mam!!", "ganesh.mhaskar.5074": "Very nice", "singhpayal14": "How to clean these small mouth copper bottles from inside.. I stopped using them, bcs of hygiene issues", "2rira": "It may has good impact on health . If I'm not wrong", "raashi_rastogi": "Great I also dont use plastic 👍", "asadtanha77": "I love you to meri jaan", "amitgupta.30": "👌👌👌", "vikas444": "#diamirzaofficial how can you be so beautiful....#rhtdm", "sagarsaindane30": "👌👌👌👌👌", "manuel.alvaro.921025": "😂😂", "sharukh7s": "I have started using stainless steel bottle and trashed my plastic bottle. Also I request everyone to do the same....", "swati_lifeisbeautiful": "Will try my best @diamirzaofficial ..u r so inspiring..❤️", "fiend.sj": "@diamirzaofficial i was recently travelling for work and the country has water companies that sell water in glass bottle, we should have same implemented in our country as well. Maybe you can take this initiative ma'am. Best option is to carry your own bottle but for those times when you don't then having glass bottle from big water selling companies would be helpful as well.", "chottu453": "Pretty Looking. 💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹", "mistiqex": "No plastic bottles since over 3 years now. Have more or less stopped using plastic containers for food and try my best to avoid using plastic cutlery. It's not easy to let go of plastic as there are no economically viable and easily available alternatives yet.", "jogenchouhan9966": "Good", "drparisha": "#metoo", "i.rahul.t": "Indeed.", "samadhan1712": "😍😍😍😍", "megablizz": "Tupperware is supposedly made from fruit pulp!", "ajayjamar": "🅼🆈 👑🅻🅾🆅🅴💚.🍫🎁", "raeesjawadahmed": "❤️", "shwetasinghccc": "👌👌", "rowdy_tiger": "Beautiful! 👌❤️😘", "iamparidhiagrawal": "Really great initiative ma'am...........I feel we should try n make an effort to stop plastic use as far as possible in all its forms...atleast we can give a serious try...it...not buying things in plastic bottles, containers.....n so on....look for alternatives of all products....I believe if we try seriously we can do it", "shasha_fanclub": "Vesi ki vesi kese dikh leti ho ? Rahetna tere dil me se leke aaj tak vesi ki vesi ? How ? Kese ? Kia khati ho ,Kia piti ho ,konsi excise Karti ho Kia lagati ho face pe 😨", "makwana8496": "Nice", "talhahumm": "❤️", "sh.alu592": "👌👌👌👌", "rahmanwali.rahmanwali.14": "Khaista", "shankar_skywalker": "You don't get drinking water fountains everywhere. How will you refill then when traveling?", "amit.parashar.mohan0052": "❤️❤️❤️", "thepavnesh_sharma": "👌👌👌👌👌", "themoodybaby": "I use glass bottles at home and a copper bottle like yours when I am travelling. #saynotoplastic", "khankhalid939": "Cute beutifull", "hassanshah527": "Innocence of face", "dalipbairwa": "Gift 1 for my School going daughter too.", "deepasha.s": "Yes ..trying to...yet there r many to replace !", "pallavmehta3333": "OMG 💓💓💓 Heavenly Beauty", "iamersheen": "In big cinemas like inox n PVR they still sell water in plastic bottles...how can we stop them ? Pls help ma’am @diamirzaofficial", "sharvarijo": "♥️", "iziziglassbottle": "IZiZi glass bottles, best alternative to a plastic bottle. www.izizi.in", "pratik_patil_bhagat": "I lv u dia", "mass2020805196": "💙🍀💋🍀💙", "sanjay_gate_official": "Nice..👌👌👌", "nawab_lovers": "Beautiful.", "znyyn": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "aasma.fayaz": "I do! Hate plastic now! I will do whatever it takes coz I am a Social worker and a strong environment supporter!", "badesabtamboli": "👌👍👍", "rahul_india123": "😍😍😍😍😍😍😍", "pankajnai84": "Copper is great nice ADD", "suneetajaisinghani": "❤️❤️👌👌👌", "ghanshyam1701": "So good...main bhi environment ki protect k liye logo ko samjhate rhta Hun...I am nature lover", "vishwesh365": "@shimmer_stardust", "shakil.mhod": "Hii", "salim_saiyed": "So beautifull, Good job..", "mowree.mobashary": "I stopped buying any kinds of plastic bottles, and it's been just few weeks. I solemnly believe that I can carry this on! Now, I am thinking to find alternatives of shampoo bottles. 😊", "beingrumaan": "Gorgeous", "bhavanabhatbhatia": "What about your hair color? Is that good for env? You wear a new dress everyday. What happens to the worn dresses? How many leather shoes and purses do you have? Sustainibility should be holistic and not limited to only water bottles.", "sandeepbalofficial": "👏👏", "messiashir": "Looking gorgeous 😘", "motivational__waves": "👌👌", "saurabh5979": "😘😘😘❤️", "bhosalepadmaja": "Il also join the non plastic and no leather campaign❤️😍", "raivenki": "Soo nice look like milky beauty", "elderdanielgaye": "😍😍😍", "nisar.khatri": "Nice and beautiful😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓😍💓", "chavhan7851": "I like this you are right 💐💐👏👏", "litudas_mumbai": "Beautiful❤️❤️❤️", "kp26_": "♥️", "priyanka_love_kkavya": "Sry plastic is a big no for us", "abdulheartthrob_khan": "Tumsa Aaj tak nhi dekha😘😘🥰🥰", "rajeshvyas.hrg": "❤️❤️👌💎💎💎💎💋", "vishal.shingade22": "❤❤", "akashgoila\nVerified": "Verified", "sbasu123": "Difficult to remove stains from a copper vessel especially from a narrow mouthed bottle. Steel bottles are easier to maintain.", "impratikp98": "You're having a greater and good initiatives for the society @diamirzaofficial ...You're one my most inspirable celebrity...👍👌💐", "aza2969": "Masha allah❤️❤️❤️❤️❤️😘😘😘😘😘😘👌", "morshed112": "❤️❤️💚💚💛💛💜💜🔙", "k_l_rahul_rai": "😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😮😂😂😂😂😂", "yadvendrasingh7": "♥️♥️", "davanal": "@diamirzaofficial Ma'am, where do you refill your bottle from?", "paul_preeti": "Very good initiative Mam, your this post will inspire lot others 👌", "kokostagrram": "😯😋", "amitk.111079": "💕....chupke se...hmmmmm💕", "basit.6575": "Nice you're real angel", "jadumoniboro": "Nice", "nidhigupta9": "Not sure how good copper bottle is, using heavy metals is another debatable story for our body...i guess steel is the safest bet!", "lenin_thegamechanger": "@diamirzaofficial would like to see u flairing the bottle😋😋", "dukeinsta10": "Wait. Full. Details.", "kakkar.mahesh": "I m your fan frome 2005", "iamsubhajitbose": "Is that arrey forest at the back ?", "sayu_vfx": "@diamirzaofficial ma'am I don't buy water bottles, packaged drinks, or even paperboat(plastic+paper container with plastic lid) for that matter.. freshly made juices at any juice centre (served in glass or paper cups/glasses) is always a first choice, anytime ! I just hope bus travel agents and @irctc.official start keeping metal water containers everywhere.. (hopefully cleaning them everyday) 🙌😁", "simmy.gill.98499": "👏,great", "mandeeparora1114": "Best😍", "puranjansarkarsarkar": "😍", "meysam_oveysi62": "👏👏👏👏👏👏🇮🇷🇮🇷🇮🇷🇮🇷🇮🇷🇮🇷🇮🇷🌹🌹🌹🌹", "paturdedeepika": "I also care my thermosteal bottle with me while going outside. within city or out of city", "pihurani35": "❤️", "dasp02390": "💖", "vikash_sersiya": "My true lovebs this word describe my all feeling for you.....💘💘💘", "baktkhush": "Sssssoooooooo cute girl😍😍😍😍😍😍😍😍😍😍😍👏👏👏👏👏👏👏👏👏👏", "saaduddin3135": "Zabardost", "nidhi_shah2612": "Are we allowed to carry these bottles at the airports in the hand carry ?", "jagatjeet_khurana": "Ban factories producing plastic bottles, direct impact !!!!", "humza1804": "Sksksksksks", "arunekta.74": "🙌", "rupa1865": "💕💕💕", "adarshshivamshivam": "Hlw ma'am u r beauty queen❤️😍", "ritu_r_rout": "@diamirzaofficial I use it since 3 years Mam and it has many health benefits too 😊. Individual actions & efforts really matters 💯, hope that people understand this soon and take actions 😇✌.", "aarti_nagpal2121": "Great work for saving environment... watched your video on BBC...thanks for sharing alternatives... trying to follow that...👏", "israfil.mdisrafil.507": "Hi dia ❤️❤️❤️", "avinash.kad": "👌👌😘❤️🌹", "sp.nature.photography": "😍👌💖", "ashishbhairohit": "D", "prince081094": "Mam u doing the best. Because of u chopping stopped at aarey's tree", "syzygy_ivo": "@cocacola used to pack bottles made up of glass but idk why they started using plastic bottles so do many companies started using same. Imagine how many bottles per day we buy and cocacola sells 😶 Railways instead of putting ban on water bottles started its own brand railneer . Which people throw outside on running track.", "amrishbhatt01": "👌🌹", "vjaynarwade": "Very good initiative to inspire people around the world !", "sidra_malik7": "👌👌", "ronysaha01": "Big Bottle", "algoleanil": "I will start using copper water bottles for me and my family 👏", "vickykumar7727": "Didi bihar m flood aya hua hai didi.abhi tk koi actor &actress bihar k liyae paisa donate nhi ki hai .aap bihar k liyae paisa donate kr digiyae nh dia didi .please didi.aap paisa donate kare gi bihar k liyae bhut acha lge gh dia didi .please dia didi donate kariyae nh didi.❤️❤️ Meri pyari baari behaan dia didi .@diamirzaofficial", "iuuyttdd": "توجه 👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻توجه🙌🙌 این کاریه که من برا رسیدن به عشقم کردم 👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻👇🏻 عزيزان خواستم دعانويسي و 🌟🌟بهتون معرفي كنم كه اگر ٢ نَفَر در جهان قلمشون اين قدرت و داشته باشه كه زندگي يه نَفَر تغيير بده شك ندارم كه حتما يكيش ايشون هست❤،خودم و خيليا كه ادعامون ميشد اعتقادي نداريم نتيجه گرفتيم همين امروز دوستم كه طلسم تو بختش بود به عشقش رسيد😍😍😍😍😍 و یک دوست دیگه ام که توی استرالیا هست مشکل اقامتش با دعای ایشون توی ۳ روز حل شد بعد از ۱۰ سال انتظار کشیدن واقعا کارش فوق العادست👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👍🏻👍🏻👍🏻👍🏻😍😍😍😍 مطمئنم نتيجه مي گيريد وبرام دعا مي كنيد🙏🏻🙏🏻🙏🏻🌹🌹🌹🌹 خودم شيرازم ايشون خوزستان هست تلفني ام جواب ميده با هزينه خيلي پايين كاري ميكنه عشقتون با گريه بر مي گرده والتماستون ميكنه فال با قران مي گيره كاملا متفاوته با هر فالي 🌹🌹🌹❤❤😍🙏🏻🙏🏻 این هم پیجش هست @sanaz93943 ❤❤❤❤❤❤❤❤❤❤", "mnainesh63": "So beautiful pretty 💕👌😍😚", "ambakshay": "Kisss me my favorite fan Diya", "john_mirza19": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥💘💘💘🔥🔥", "drgajendrasingh06": "Beautiful😍", "subhashguptabjp": "Looking cool", "gargshriom": "❤️❤️❤️❤️", "suchitrashamjetshabam": "@diamirzaofficial so proud of you for promoting such things. I use Cooper and stainless steel bottles even for my kid. There are various kind of Cooper and stainless steel bottles available in market", "shubhamsharmaaaaaakhhgfdtgv": "Love you", "hussu__01": "😍", "kavitharia": "Love the traveling bottle! My favourite is @chillysbottles", "styledestino": "Im always carrying mine too! I’ve got 4 bottles - different sizes and styles for different needs.", "lakhan_0814": "According to Ayurveda water stored in a copper vessel has the ability to balance all the three doshas in your body, (vata, kapha and pitta) and it does so by positively charging the water. The water stored in a copper vessel is known as ‘tamara jal’ and is supposed to be consumed after storing the water in a copper vessel for at least eight hours. @diamirzaofficial", "amol.amol.1110": "❤️👏", "shaik.fayeem.celebrity143": "👌👌", "shuklavipul33": "Prettiest 😍😍😍😍😍😍", "mohdsultan73": "Very very beautiful ❤️❤️👌👍😍", "celebfashiondiaries": "Beautiful❤️❤️", "d.k_bantai_love_you": "Love u", "karan_pure": "From where u bought this bottle did lol 😳", "jiyaizm": "Phenomenal ❤️", "a.m.s.aa": "عالی", "phenomenal_sam": ".", "rajumamodan": "Beautiful looking dear 😍😍", "_dhirajpatel": "Khubsoorat!", "expectobloom": "@diamirzaofficial brilliant initiative by you. While traveling how does one ensure the purity of the water that we refill?", "amrita_2432": "@diamirzaofficial aapke aa jane se❤️", "k.aroraaa": "Absolutely true even lots of scientific researches r providing above said evidence", "faridrazamehar": "Very nice", "sunitha257": "👏👏", "yuvapremi": "Yes, the simple solution is we should completely eradicate plastic from earth!! 🌍 🙄", "jagadprashant": "@diamirzaofficial , this is my first ever like and comment on any celebrity and the reason why I liked & commented is because it has strong message. Generally I don't like or comment on any celebrity pictures.", "the_rimjhim": "❤️", "amir_siddiquie": "Hey today i buy this bottel for me 👍", "hemant.sawant.92": "I always carry a Milton thermal bottle ..which is a bit heavy but very useful and better alternative to that damn plastic", "shamimzhcdu": "You are looking like teen ager😍", "zakir2258": "👍👍🚩", "panthe_a2": "♥️♥️♥️♥️", "priyata_0232": "I don't use any plastic bottles in my house .I throw it away and buy glass bottles.First step", "ervinmes": "❤️😘💙", "badogga": "Beautiful", "iam.anshu": "😍😍😍😍", "sri.vinay": "Wow", "rubal.sunshine": "Long back moved to steel bottle. We carry our water to every place-, flights, restaurants, movie, Shoping, outings. Even when we travel we get water filled from hotel kitchen instead to using bottled water they provide", "raj373811": "😘😍👌💯👍🔥", "kishorgandhi": "Super", "guptadrsurbhi": "Hi, I have been following u since so long and have managed to not use plastic bottle since 2 months. And yes it is possible. All it takes is little effort.", "officiallycp": "@diamirzaofficial great initiative. At the same time beauty products also generate the great amount of plastic waste found in ocean. But not taking any effort away as every effort counts. https://www.glamourmagazine.co.uk/article/plastic-beauty-products-environment-ocean-impact", "itsmeinder1": "I’m on this road for last 7 years and have abstained from plastic bottles.", "piksy1886": "I have been using steel bottles from past 7 years. I take them everywhere I go. Just refill and keep going..", "raulo_kanha": "This is copper bottle dia mam.", "touseef_fawaz_007": "❤", "indianbanglesstore": "Check my Page to buy bangles set", "v.art.pic333": "u are most beautiful lady💐", "afrinshanjidaoishi": "❤️❤️❤️❤️", "sukeshvorra": "❤️❤️❤️❤️❤️", "princesswardrobebydeepika": "diya... i hope u remember me... im Deepika malhotra from INDORE... we met twice... n i was glad u remembered me..Second time too... huge fan of u from the day i saw u at 2001...first movie... n from ur album days.... u r such a beautiful girl... not only in looks... butas a person also", "arijit__dhawan": "Today is my birthday please wish me❤️❤️❤️", "ketan.nardhani": "Have always been carrying my steel flask wherever I travel.... #SayNoToPlastic", "rajchauhan_5050": "👌👌", "zindagifashion": "Please visit our page", "alokbpradhan": "That's a really commendable and inspiring thing to do.", "beheshta.majeed": "l am an afghan women l alwayes see your films", "vala.nidhi": "Great initiative.. i too cary a insulated bottle. Can u suggest alternatives to things like garbage bags or milk bags?", "pksharma962": "@santoshvani", "pehu_piya": "@diamirzaofficial yes our individual contribution can help a lot saving our beautiful earth. Have switched to metal bottles also stopped buying plastics boxes for home use. Use glass lunch box. Tagrt is so replace existing plastic container bottleS.I agree they may be a bit expensive but it's one time investment.", "arindamballav": "I use glass bottles", "honeyronnie7": "@diamirzaofficial keep spreading awareness all others are actors but few like you are rolemodels..🙌🙌.Huge respect", "alam.faisal11": "Kitne khubsurat hai aap masha allah❤️", "anur.ag450": "Wow nice pic mam👌", "swagata.nath": "I carry my glass bottle everywhere I go. During travelling, if I am offered plastic bottled water which comes with the travel ticket...I don't take it, hence reducing the usage and doing my tiny bit for the environment. #beatplasticpollution #nationbuilding 💚💙", "prerna.neeraj.mishra": "@prateek_neeraj", "ajay_r_jainapure": "❤️wow....👌❤️", "d_e_v_a_n_g_a_n": "🔥", "sramonakar": "Have you found a solution for remaining plastic bottles yet? I am sure not because of course celebrities are miles away from science and research. Please do read about Dr. S.R. Maley's work and propagate it. He created a garden out of a dumpyard years back outside Mumbai. Celebrities can create awareness, science always brings in solution.", "shiva_prasad_pasula": "The best click", "peter___jay": "👍", "iamsrishtisingh": "Yes, we use steel flasks or glass bottles..🤗", "vikas__dwivedi": "💩", "ar.kumar": "😍😍😍😍😍 lovely💕😍", "rezaahassanpourr": "lovely.....", "jbairagdar": "Great thought of great human being we also try for this", "victoria_kelly9lbj": "699rs for 5kinsta fans 1399rs for 10k insta fans 1999rs for 15k insta fans", "pt_vaibhava_sharma_2003": "ℒℴvℰ-】ℒℴvℰ-vashikaran specialist baba ji love problem / husband wife problem / black magic specialist / vashikaran specialist / ((and))आप गलतफहमी के कारण अपना प्यार खो चुके हैं तो आपको ऐसी समस्याओं के बारे में चिंता करने की आवश्यकता नहीं है, जिसे आसानी से सम्मोहन के प्राचीन विज्ञान के साथ वाशिकरण के रूप में पूरा किया जा सकता है तांत्रिक जी के पास से सभी समस्या का समाधान करवाएं समस्या बताये समाधान पाये !जब कही ना हो काम,हमसे पाये समाधान #get_immediately_solution_for_your_all_problem। Call me or whatsApp no((+91-7014150708)) हम आपकी सभी समस्याएं हल करते हैं प्रेम विवाह, वासिकरण, पति पत्नी समस्या ((+91-7014150708))", "malik_zafar_iqbal_bara": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "rachi_naik": "@josh.ghosh3 every bottle counts.", "wajid.javed567": "😗", "mischeviouspratik": "You are amazing", "acedginmick": "@diamirzaofficial the best is to use a glass bottle.. till voss! Even metal bottles are not good after sometime.. they develop reactions and also result in fungi", "hemangi_mak06": "Princess", "mira_9249": "👌👌🔥🔥😍😍💞💞", "mannanzafarkhan": "🌹🌹🌹💚💚💚💚💚💚💚", "shanzida_tinni": "💝", "abhinavsingh24800": "👌👌👌👌👌", "__arambh__": "❤️❤️❤️❤️❤️", "aartz_dancestrucked": "@diamirzaofficial i have admited you from the days of Zara Zara ♥️ And its amazingly beautiful how ur concerns & efforts have spread the importance of nature and its beauty to be reserved. Be it cleaning the beaches, hand crafted ganpati and now globally making a mark n make sure plastic is far beyond d reach of humans. Way to go 🌟. I too carry a copper bottle with me now & have made sure not a single plastic is in my household & my near ones too", "soharahman7": "💖💖💖💖💖💖my favorite ❤️", "swap_sabale": "Journey from RHTDM to the social Awareness you are always decent for us @diamirzaofficial .. keep it up🙏🏻", "timetoslayy": "Hey peeps! Checkout my fashion and beauty blog @timetoslayy 😊❤️🌸", "sadabkhan358": "🔥🔥🔥", "quirkbird": "What do u do when you’re checking into a hotel that only offers plastic bottles and no glass jars or drinking water coolers?", "hadi_iv": "Uff etna bra kase lay lati", "atulsrivastav7777": "love it😍😍😍😍", "highlife.tattoo928": "Dia....keep doing what you do...keep ya head up....", "botti.13": "🌿👩🏻🌿", "bollywood_mode": "❤️", "salman_hashmi67": "😘😘", "herinasutionherinasution": "😮", "wajed.shaikh.7359": "👌👌👌👌🏻👌👌", "vinod_shinde_offical": "😘😘😘", "awanishgauatam": "❤️❤️😍", "dr.kjsinger": "😍😍😍😍", "yugantyadav": "Wow❤️❤️❤️", "abeersinghab": "❤️❤️", "sg59406": "Very nice diamirzaji", "sun_san2000": "Yes when we were young we used to have water bottles which we took to school made of aluminum and they lasted for years... Totally recyclable", "raghavendra_c_jannu": "😘🙋😘💋👌👍 happy Sunday supper👌👍", "iamabhish3k.23": "Thanks for taking the step mam, In our culture my grand parents used to drink water contained in a copper vessel, new generation started calling them uneducated and dumb. I am happy that now people are understanding how advanced our culture and Ayurveda is🙏 ☮️", "randhirsinghsaluja": "Nice Jee.", "sohail_hashmi67": "🔥🔥", "mohammadbashiri5432": "💝💝💝", "gaurav_garg_photogrphy": "👍👍😍❤️", "snehabagdiya": "https://www.facebook.com/105482547509020/posts/138196617570946/?sfnsn=scwspmo", "max.anar": "Beautiful...... A", "monyog": "I have a bottle exactly the same colour 😱!! Best thing I invested in. Keeping spreading the word, we can make the world 🌍 a better place for our future generations 👏🏼👏🏼💪🏼", "mashqinaaz": "Beauty in grace", "behnam_f1365": "دوست بهترین بازیگر هندی دوست داشتنی من", "aneesh_makhija": "Grt work 😍 ❤️", "anshul2279": "👸👸👸", "sunil__goswami": "🌷", "rare._.girl0": "Wonderful", "rowdy_hero_no_1": "I love you 03127318758", "parijatchakraborty_": "I also use thermosteel bottle for drinking watee", "atharjaved772": "Cigarette Tobacco pe Banned kyu nhi..", "diamirza__fc": "❤❤❤❤", "hea_b": "I use a Tupperware bottle. It's plastic but spill proof and I carry it wherever I go and refill it everywhere. I don't drink colas coz they come in tiny plastic bottles. I also buy refills for anything possible. Small steps", "amitsingh37383": "Gr8", "isubh_choudhary98": "I too use copper bottles... BTW u will be my forever crush😍", "ronnie240singh": "Sooo pretty", "syednomangillani": "Lovely gorgeous very beautiful cute sweet marvelous fabulous 😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😘😘😘😘😘😘😘😘😘😘😘❤️💗💗💗💗💗💗💗💗💗💗❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💝💝💝💝💝💝💝💝💝💝💝💝💝💝💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💓💓💓💓💓💓💓💓💓💓💓💓💓💓💓💓💓💓💓💓💓💓💓💞💞💞💞💞💞💞💞💞💝💞💞💞💞💞💞💞💞💞💞💞💞💞💕💕💕💕💕💕💕", "theabhijitkar": "Awesome, we should also carry a bottle to reduce the use of plastics. Thanks for raising alarm on us. ❤️", "rupeshgore11": "1st of all , looking Amazing Respected my Supermost favourite my aged #PrettiestActressinbollywood Dia ji ! I read ur total comments about this post . U r absolutely correct Dia madam ji , but here I just wants 2 ask u 1 Important question here that Is this Copper Bottle is Affordable 4 #CommonPeoples in our India @ its Prize ? Ok madam , today is #SingingGods #DeathAnniversary madam ; i'm telling u @ legendary gr8est #GoldenMelodyVoiceSinger #किशोरकुमारसाहाब , i'm literally the #भक्त of this #MagicalPersonality . Just I Reminded u here & there is no any Connection of this 2 ur today's post . Ok , gud afternoon Dia ji ! 👌👌😍😍😍🎉👏👍🙏🙏", "meenakshimakeover77": "#beatplasticpollution 💕👍", "niral_7135": "Looking so beautiful in floral😍", "souvik.thakur": "❤️❤️❤️❤️❤️❤️", "jahn.pyaru.1995": "❤️", "poryaeensahraeeiofficial": "💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓💖💓😘😘💋😘😘💋", "_tara_5668": "😘😘😘😘😘", "underdbluesky": "Simply Great Dia👍👍", "prateekithape": "Please send your hand tattoo", "hiteshrachh": "So beautiful ♥️👌👍", "ashikihsan": "It is a good solution Dia to use these travelling bottles instead of plastics. You are a good health specialist Dia", "khoslaketan": "❤️❤️❤️❤️", "yeahh_smin": "That's a really good initiative! May the world go back to it's natural self💚", "putthe_punjabi": "🔝💖🔝💖🔝🔝", "manal_755k": "Beautiful 😭♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "rikigogoidz": "So quite 💕", "aditi901": "Dia could you please let me know how portable is this travelling bottle? Is it light enough to carry? I also want to buy one for me!", "ajitboy794": "Dhany Hain Devi ji aap", "khiladi9559": "👌👌👌👌💞👌😍😍💞👌💞😍💞", "navnoor.singh21": "A very inspiring step Mam. Your this effort can change the future of the Earth. Every should follow this and soon our planet will be free from plastic.", "_devsharmaa": "👍👍", "rohantapse": "So beautiful 😍👌", "gurmeet.choudhry_": "Nice m❤️", "soni.ishan9": "@diamirzaofficial I want to purchase this bottle can please suggest tge brand/pure copper bottle??", "atanu.sarkar": "Very nice😊", "igz3ldris": "😮👏🏼", "_miss_daydreamer": "👌👌👌", "parmeshwaryadva": ",Biwatiful 👌👌👌", "abhishek8nov": "Better to make biodegradable plastic", "viper37_": "Nice 👌😊 👏👏👏 @diamirzaofficial", "dev.bhatia88": "Real beauty of Bollywood", "_._shivam_bilaiya_._": "😘", "preeti.565": "Real Beauty😍", "sayee_sree_ram": "❤️❤️❤️❤️❤️❤️❤️❤️", "_______shaan_____": "🔥🔥🔥😍🔥😍🔥", "sandeep.tomar1907": "Bahut sunder", "1_0_0_rabh_1_4_3": "🌺🔥😱😍", "afsar_1020": "I am from empire industries we are trying to reduce use of plastic bottles we are making bamboo botlle..u can contact us 9372247100", "ahmadhusani07": "🔥🔥", "mramanqrs": "😍😍😍", "zahraami5260": "❤️", "alexpais12345": "Very nice", "kalik140393": "Supreme Cute : O My Soulful / O My Serious Soulful / O My Core Cute Wheels : Carer / O My Complete Cute Wheels : Shaper . Immense Love & Deep Love .", "deep_154": "@diamirzaofficial mam I am botany student..and I totally agree with u because I m doing same thing but there is one problem...every people need water anywhere and they buy plasltic bottle in 10 or 20 rupees..Now shopkeepers have no alternative choice..if there is alternative choice it will cost high to common purchasers and there for our goverment should do something for providing clay bottles in same price as plastics bottles🌿🌿🌿🌿🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀", "rolandevolution": "Perfect! Love you !!! 👏 !!", "vahid_vahidi_v2": "💕💕💕💖❤️❤️❤️❤️", "aditimahajan10": "Same here. From last 4 years, I haven’t use single plastic bottle in or out of home. Plastic is strictly out of my home now!", "ashra2331": "I have been doing the same ,thanks, mam you are an inspiration!", "shakil.alam.96": "Lovely pic👌👌👌", "amanverma121994": "Wow", "zain_imam_6656": "👏👏👏👏👏👏👏👏", "mehtaamit95": "❤️", "bashirzadeh": "🌹🌻🌺🌸💜💚💙❤😍", "mr_robasiya": "Follow me please", "syedtahir7125": "Mashaallah", "jaryal_1996": "Kurkure ke paket to aate hai", "dear_crush_iloveu": "❤️🤗", "kritidhiman": "Yes...my copper and glass bottle...love them", "patilkallappa": "👏❤️", "makarandkayande": "❤️❤️", "qassh.np": "Fantastic", "ashrafmasood18": "@diamirzaofficial we are really appreciate your efforts towards no use of single plastic. We @thecountrykraft are also working towards better India 🇮🇳 @thecountrykraft also assured you to use copper products more for better life❤️ Follow us 😊 @thecountrykraft @narendramodi #beatplasticpollution #betterindia 🇮🇳", "smrutisikha88": "💕", "vishalgupta108": "Forever young💕", "pravesh.raturi.9277": "So cute❤", "vsa_61": "😘", "sopna.83.shikder": "💕hey superstar 💕", "alexandriterosa": "@rjrashmisharma", "ejaz1794": "👏👏👏", "i_am_aveek": "Amazing initiative ❤️", "mukeshkashyap8539": "Beautiful", "shailesh.malkan": "😍 You Look Lovelyyy ! O My Beautiful Friend, Diaa ! Stay Cheerful, Colourful & Loving ! Bye... ! Cutie ! Best Luck ! Stay Shining ! 👍👍👍🌷🌷🌷👌👌👌💕💕💕🔥🕺🎵💃✌🙋‍♂️🙋‍♂️🙋‍♂️💋.", "ashgalax": "Cool♥️", "bijaysinghchandel196": "Yes I have🤗", "saddam_sd_raj_official": "Tum itne khub surat ho pr hath alg hii lagte hai 🤪", "faheem.273": "Osm", "anuish_": "Your bottle looks as new nd fresh as you 😛. Nice .. Thanks for inspiring 😊", "arshad.ahmad.92102": "Hi Diya Mirza how are you so look Dress Friends Beautifull", "a_faisal2018": "#exemplary act,will follow immediately!", "rida_rida99__": "💓💓", "dhiraj1528": "@diamirzaofficial also there is a clay bottle which is also a good substitute for plastic bottles", "kamal_joshi_1": "Beautiful mam💖", "saga_r.143": "#Gorgeous as always 💋😍", "cressydza": "🙏", "jotprakash": "@lovingallthingsworld check this out", "aaakasharora": "U look so pretty much 😍 ma'am", "vandana_sharma7359": "Cuteeee😍", "sajwanankit1": "U are sustainable🔥", "tirfal_thesoulofcoastalfood": "👍 each one, can stop a Ton 👍", "hk._.7524": "❤️❤️❤️❤️", "anshumanpandeyofficial": "@narendramodi 🙏🙏", "astro_meghraj_shastri2": "[[[[[[[[[[[[[[[[[[🌹माँ भद्रकाली ज्योतिष केंद्र🌹] +91-8054417981)( बंगाली शक्तियो के माहिर){astro meghraj shastri}get immediately solution for your all problems} (1) vashikaran specialist (2) love marriage specialist (3)black magic specialist (4) love problem solution (5) husband wife disputes {A to Z समस्याओं का समाधान } 36वर्षो का अनुभव{} contact now=+91-8054417981 call&whatsapp", "sayantaniadhikari": "I have question.. how do v travel with this bottle for long drives?? I mean how many bottle you will carry.. I appreciate the idea.. but even iam trying to switch from plastic .. at home I use glass bottle..but for travels .. I again go back to plastic ☹", "mukeshsavla": "👄👄👄", "ishakatbhai": "🔥👌👌", "kashifbilalawan": "Aap itni khoobsurat kion hain..😍", "heartless_akku": "😘😘😘", "shoaib.sheikh007": "🌺🌺🌺🌺 🌹🌹🌹🌹🌹🌺 🌹🌺🌺🌺🌺🌹🌺 🌺🌹🌹🌹🌹🌺 🌺🌺🌺🌺🌺 🌷🌷🌷 🍃 🌵 🍀🍃 🌵 🌱 🍀🍃 🌵 🍃 🍀🐛🌵 🌱🍃 🌵 🍃🐊 🌵🐊 🌵", "prs12135": "به مژگان سیه کردی تو رخنه در دینم", "samiahmedofficial": "@diamirzaofficial beautifully", "mj_rayeen": "Super", "sustain.mena": "Totally agree!🌍💚", "sourcecoindia": "🌸💮🌸💮🌸💮", "rushikesh_rathod02": "😍😍😍", "iamamireftekhari": "Couldn’t agree more 👍", "aazzadkhan": "❤️👌", "xarebim_ji_ta_": "👌👍", "akshayasrani007": "Looking Beautiful", "sanjaymonty25": "Nice", "say2pupu": "Now it's time think seriously abt our environment n planet @diamirzaofficial", "995079lakhvinder": "Very nice", "wagh__on": "❤️", "muradbd99": "My favourite💖", "umeshsharma817": "Khoobsoort", "munna6276": "❤️", "lovepoint_____": "follow this page for love❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "viralsonizoomgift": "Using this copper bottle also help our digestion nd keeping water late in this bottle u got lots of good benefits", "__effulgent____guy___": "😍😍🙈🙈💝💝💛💛💖💖", "atanwar786": "@diamirzaofficial Good adaption and effort against plastic use.👍", "abhijeetb0803": "Beauty 💋💋💋❤❤❤❤", "sexy_hottism": "😘😘😘😘😘💕💕💕💕💕", "realamitpatel": "Looking fabulous @diamirzaofficial", "tarungoyal7291": "👌👌👌", "rohan1504": "@diamirzaofficial - I use similar one only!! 😁😁", "shrikantpatel22": "W❤️w", "fma626": "##beatplasticpolution", "birds_of_india_": "❤️❤️❤️❤️", "reena.walia_": "💫💫❤️", "ramchandrachouhan6969": "सो गुड लुकिंग दिया जी", "salman_kirat": "My favourite Queen", "singhchiranjeev064": "🥰🥰🥰🥰", "prashantchaudhary312": "Beautiful", "khobragadevipin04": "❤️❤️❤️", "aarmanaabdi": "👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌💞💞💞💞💞💞💞💞💞💞💞🔥🔥🔥💞💞💞💞💞💞💞💞", "officialyogesh23": "Like 👌 @diamirzaofficial", "b.r.i.j.w.a.s.i": "Hahahha", "deepak.bhalerao.77377": "Jhakaaas girl", "pajju_bha_rajput7_7_7_7": "🔥🔥", "suttailumang": "👸", "shubham_.goyal": "Nature girl", "shivangani_priya": "Mam looking so beautiful 😍 😍 😍", "fuckedup.comments": ". ( ͡ʘ ͜ʖ ͡ʘ)( ͡ʘ ͜ʖ ͡ʘ)( ͡ʘ ͜ʖ ͡ʘ) ( ͡ʘ ͜ʖ ͡ʘ)( ͡ʘ ͜ʖ ͡ʘ)( ͡ʘ ͜ʖ ͡ʘ) ~ We are creating a world record for the most comments on a single post. Come and be part of this unbreakable record🌍", "omary__tz": "😍😍😍😍😍😍", "hemid_seadeth": "🇮🇷", "acharjee.ripon": "Superb picture mam 👌👌", "_iqra.siddiqui_": "💚💚", "mrunal.gajbhiye": "❤️❤️", "saleem.s.q.007": "Very beautiful", "__khalid_hafeez": "❤️"}