{"ravisrkr": "#We supportCAA🇮🇳🇮🇳🇮🇳", "itz_suhailaslam_07": "😘😘", "mliyaqatulla": "I support you mam", "ashikihsan": "Dia, I will support you to save India", "mr._tiwariji": "What ever I clear informe to my muslim brother.indian muslim hamare hai or rahenge....ye desh hum dono ka hai hut rohingya ko support kbhi nai kyuk aaj indian me muslim kom ka naam kharab krne wale yahi log hai.........", "amitkashyap_": "@diamirzaofficial Bakchodi karna asaan hai Delhi me aakar dekho MAA behan ek Kar rhkk h tumhare students ne", "devee_17": "And fyi I've been and probably always be a huge fan. God bless you", "shivathakur183": "Shit... this post have changed all mood.... I was your fan. I stand with India ❤. Na ki kisi particular university k students k sath 🙏. Can't say further 😒", "coral_ated": "Shame on you", "aabha.srivastava": "Ekk baat to smjh aa gyi tjh jaise mulli kbhi nhi sudhregi sali jis sarkaar ne tjhe UN bejha Tu usi ko bol rhi h bdvii 😡😡😡", "thenameisrishav": "Madam aap toh itni badi idiot hogi yeh umeed nahi tha caa ko Muslim se kuch relationship hi nahi hai tu kyu bakchodi kar rahi hai tum", "beingmayank143": "U first do some work unemployed bitch MODI JI IS DESTROYING U BASTARDS 🇮🇳", "keertirai08": "Shut up bitch", "mirrrzza_": "❤️❤️💯", "mr.shivay23": "Unfollow you", "vshraj16": "https://m.facebook.com/story.php?story_fbid=456812821651472&id=379253735904493", "sanket_thakur007": "Nikal", "parul_singh._": "Now no celebrity will come and apologise to the government for wrong allegations they have made neither they'll compensate for the damage done by these riots for so called protest 🙄🙄🙄", "chiasharma4": "I love u❤️ please act smart.#isupportcab", "v_n0m": "Phle bhi pele gye the abhi bhi pele jaoge", "nangia_vivek81": "Yes absolutely. Once this is rolled back we need to show respect for Kashmiris and end this ind Pak conflict amongst people.", "dwarftraveller": "She, farhan akhtar, kyshap, Qureshi, shushant, etc etc never got on streets when illegal rohingyas missbehaved with Mumbai lady police officers when these rohingyas were vandlizing Amar Jyoti.", "shubhadippanja": "Fuy", "vibesmachra": "They are not innocent", "zaraali3": "👏👏👏", "thesaherahmad": "yes!🙌🏽❤️", "heena__0711": "I support #CAB#NRC", "imjitendra_13": "Ghar me baithe bolne walo acchi bat hai ...mai bhi student hu agar aap equality ki baat karte ho to yaha parr mai 3 lack per year paid karta hu engineering fees or wahi parr minority dikha kr ye aap jaise log 1000 rs bhi nhi bhar sakte ...ye konsi equality hai jo India mai dikh rahi hai aapko....#Shame Dia", "abhigarg1497": "@diamirzaofficial i was not expecting this from u.you are not supporting only the. Students btw you want the rohingyas,bangladeshi terrorists to be stayed in india.", "gangotripainuly": "I used to follow u but now u r BIG OMG.... GOOD BYE FOREVER", "humaira___khan": "U don't want to understand.", "mk11kailash": "Today!! What is happening in my country ?? Some news channels talk about the BJP and support the BJP ideology and there are some channels that support the Congress ideology and tell about the Congress ideology and there are some channels that are anti-national, which is the atmosphere in the whole country. They are always involved in spoiling... #WeBelieveintheIndianjudiciary #WeBelieveintheIndianDemocracy #Avoidfalserumors #Findthetruth #WeareallIndians🇮🇳🇮🇳 In democracy, everyone has been given full right to express his opinion. While following that right, I am telling you my opinions... Jay Hind🇮🇳🇮🇳#सत्यमेवाजयते। @mk11kailash", "ashiya.verma": "tumko v pitne ki jarurat h..cntry se nikl jao n ..itni takleef h to ..kindly fuckoff", "i_m_ashishppu": "Tere upar jab patthar padega...then pata chalega.. nonsense", "shazlisyedda": "@79ehtkm", "vijeta.hegde": "Get a reality check and please get a life! Anyway cant expect much from dumb heads like you", "swati.tulsiyan": "Why are the students protesting? It is clearly stated that the new laws will not affect the citizens of the country, and do you think police ended up in the university on their own to create riots??? Who was out there destroying public property? Even the police forces are human and have families, students cannot have the freedom to pelt stones at them. This is the time when people need to sit and talk. We all have the rights to have an opinion and not agree with everything that the ruling government says, but destroying public property is not acceptable. To all those people who have the power to influence (Bollywood celebrities), please use your power rightfully in stead of just posting statements without being backed up by facts.", "hixhu_11": "Peacfullg Word Hta kr bolo didi Shobha nahi deta ye wrd Ek Anti National Ko😂😂😂😂😂", "mansiloiya": "Shame on you,you are instigating people go and first read the bill and were you there in JNU ? Do you really know what happened there? Bloody UN Goodwill ambassador", "its_akanshasinghal": "people need to understand that u r anti national", "soulofaprincess23": "Wish everyone had a brain like you", "jagdish_menaria95": "You just *Fuck off*", "vsrishty": "Madam you are seeing only one side.. its not about you that you are saying stand with others in protest.. i think u hv not read the whole CAB.. atleast listen to it once and then give these types pf silly statements. Didnt expect this statement from you celebrities 😊", "being.brock": "@diamirzaofficial Dia Mirza tuin to masjid me Halala ki aulad hai . Ek baap Christian aur doosra musalman😂🤣😂", "swagatoktirath": "I always follow you but this time not agree with you.maam you should research more about this topic", "rakesh_nellekeri": "Why don't you see these students in college lectures?", "prashant.ranjan76": "Sorry now you are out from my news feed", "rakratod12": "Dia Mirza aur thodi din me bolne wali Pakistan india pe terror attack nahi karta india pakistan pe terror attack karta he karke aur Mirza madam batla house movie dekha nahi kya student kya karte he.", "sunny.kashyap.85": "Unfollowing you because you are here with an agenda go to hell", "goigarg": "WeSupportCAA", "_baseer_": "💯", "akshai__24": "Publicity stunt , double standards", "mirza__manal": "👍🏻", "taslima_akhtar_liza": "Im bengoli and British. It is very nice for you to post this because rest of the celebrities didn’t which they should have. Celebrities are influencer and can help to pass messages. I cannot believe that those who present themselves as being great human none seems to be borthered about this when kids women and elders are being beaten up. How do you expect the youth to stand and watch it happen while their neighbor their family being killed. Thank you @diamirzaofficial you are a truly human being", "abhutpurv_shukla": "Why should we give citizenship to illegal migrants", "mooopoints": "We live in an era of twitter lawyers, Facebook courts, youtube videos evidences and people judgments, where there is no law rules only people suggestions. so I could suggest to Indian Government.. please remove all the securities from the Borders, airports, close all the police stations.. let people decide what is right and wrong.. please invite all the migrants in india without any security check, who cares wether they are criminals, terrorists, rapists, agents and so on.. that will be our new India..", "spoiledsoul_96": "Can u pls explain me the idea of India.?", "dutt_pratibha": "Behan ... What is wrong with you ?", "terrificaiman": "👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻", "poo_bohra86": "U r simply provoking riots by showing Ur solidarity with students who are pelting stones on school buses carrying small children. Justifying their acts shows ur mentality", "_the_misanthropic": "Well , Fu", "tarique_______": "🙌 proud", "beatboxdcypher": "🤗❤️❤️❤️❤️", "muslimindiann": "To all saying the students destructed public property ( which they did not ) - for all of u ... DESTRUCTION OF PUBLIC PROPERTY IN UNLAWFUL BUT THE DESTRUCTION OF YOUR VERY OWN CONSTITUTION AND DEMOCRACY IS NOT ??????? Real Indian will feel bad if the constitution is being destructed . 🙌🙌", "harshil_19_": "Throwing stones on policemen is peaceful , burning busses are peaceful, aah another flop Bollywood actress trying to gain some attention.", "armaan1747": "Thank you so much Diya love u dear we still waiting for your support thanks again", "kr_akay": "Peaceful students fuck off", "priyashaanaayan": "Do you even know the name of the Vice President? I am sure you wouldn’t.", "realshwetasingh": "First go n get proper information nn knowledge about d bill then speak.... idiots....many of them (who r protesting )dont know .... what d bill is all about.....", "vjinsta4009": "सभी तेरे जैसै 2 बाप वाले नहीं है हिंदुस्तान मे😂तेरी अम्मी पुरी दुनिया मे गांड देती घुमती होगी इसलिये CABILL के against है इस्लाम मे आय बात बाप पता ही नही चलता तेरी अम्मी कितनी बार हलाला हुवा उसपर बिल बनाये क्या", "tomarmahima": "If you are with the Constitution of India then how your beloved students are protesting against it. You are seeing only one side madam.", "vintage_soul_vintage_life": "Burning buses ...beating police officers...damaging govt properties......ya very peaceful....hmm.", "mohammad.ghouri": "❤️❤️there is more gobar and modi bhakts then a human being left in india, thanks for raising voice against so called CAB which can creat another partition in india.", "toshin_vora": "❤️❤️❤️❤️", "thatcoffeeegirl": "Thank you for this ♥️", "adityasahu2504": "Itna problem h to kindly leave my country n go back to yr own...", "gulamsabirbaba": "✊✊", "priboi_squieas": "Thanks @diamirzaofficial for raising your voice on this issue when all other celebs have shut their mouth.", "chauphla": "🔥🔥🔥", "bksen29": "Did you see injured police officer?. Did you see burning school buses..no you saw only protest students", "prabhlynkaur": "@diamirzaofficial 🌟🌟🌟🌟🌟", "winterfire14": "@diamirzaofficial mam, Pls take a look at this.. I know you are a good human being and I love and respect you a lot.. Whatever you are posting if it's right then that's great but what if it's not and there is a lot going on behind these protests. Pls just visit the link.", "idkwurand": "You & your ideas are Shit @diamirzaofficial", "anand30choudhary": "Pahile CAB kya hai padh lo.. Aor baad me protest kyu hai soch lo.. I SUPPORT CAB and NRC", "rutvik_joshi_": "First see news what's really happened then talk, and burning buses, throwing stones on police, burning bikes, violence whole in the area, and is this way to protest. I support the bill . 🇮🇳 Jai Hind", "my_life_my_rules_2020": "Amazing Mam", "s21joshi": "Not agree with your statement @ all.", "santhoshsonale": "Turukru yavagidru turukrige support", "__doseofme": "❤️", "vishwajeet_pundkar": "Students selected on the basis of reservation fighting for secularism. What an irony! @diamirzaofficial even policemen were beaten in the protests! Nothing is wrong in CAA. Students are supposed to study and contribute in the progress of nation & not to interfere within the matters of govt. and create ruckus! CAA is new light of hope for all the persecuted minorities and they will get the homeland now!", "rupeshc_12": "😂", "journey_of_soul": "What else can we expect from a bollywood actress that make films glorifying the terrorist , looters and gangster. These people will oppose anything good for India.", "ashleesid_": "♥️", "bodybuilding_motivation17": "Please don't spread the wrong information", "sachin_rana_1985": "They killed They looted They Destroyed They Vandalised They burnt Railways They ravaged properties They wrecked University They smashed Furnitures And they are Misguided Youth But if you forward any of the above video clip then you are hate monger and hence be arrested", "instaagram_photographer": "Is it in protest allowed to Destroy Government premises , very shame Dia Mirza, are they really student those are only using Common citizens Tax", "ani_fredthered": "👎👎👎👎👎", "stellarone8": "Why?? When Hindu kashmiris were murdered, in their own country, that was not a tipping point?? When 260 non Muslims were killed in Taj Hotel by Muslims, that was not a tipping point??", "amitsiwas": "Teri maa ka saki naka.. what the fuck was peaceful about the protest.. sahi Gand tudayi huyi un antisocial elements ki", "junaid.siddiqui23": "👍", "i_laxi": "Ugh you don't know anything,do you? Ur just posting this coz everyone else is. Totally unfollowing you. We don't need such celebs.", "pattabiramansadhasivam": "I honestly thought you would be different, but ure just a mediocre hypocrite.", "mubin__07": "❣️❣️", "iam_the_anand_singh": "Bloody bullshit mirza", "sut_puutra": "Burning train, burning buses, beaten police force, stone pelting on school is peacefull protest from peacefull community ... You proved that kattarwad Khun me bhara h", "riazbabar": "سمجھوتہ ٹرین جلانا، مسلمانوں کو ذندہ جلانا، مسجد شہید کرنا اقلیتوں کو پریشان کرنا آپ کی بی جے پی گورمنٹ اس کے علاوہ کرتی کیا۔ آپ کے بالی ووڈ سٹارز اور انڈین کرکٹ ٹیم نے انڈیا اور پاکستان کے حالات بہتر کرنے میں بہت کردار ادا کیا۔ لیکن اس کے بعد بڑے اداکاروں نے اپنے فن کا مظاہرہ کرتے ہوئے اس خطے کے امن کو خطرے میں ڈال دیا۔ اب ہم سب کو سوچنا ہوگا کہ ہماری اس لڑائی میں فائدہ کون اٹھا رہا ہے۔ دونوں ملکوں میں غریب لوگوں کی تعداد زیادہ ہے، انکی بہتری کے لیے کیوں نہیں یہ سوچتے ہیں۔ میزائل چلا کر ہم یہ دنیا تباہ کریں گے۔ خدا نے ہمیں کیا دنیا میں عقل دے کر اسلیئے بھیجا ہے کے ہم ایک دوسرے کو اذیت پہنچائیں ۔", "shubham.343": "this is deeply appriciated @diamirzaofficial and love to see a sensible actor posting about this...", "rachnabhatt_": "Peacefully protesting LOL😂 I think you haven't seen all the viral videos yet go and watch first.. Jo dharm se banayi hui college me padh rahe hai wo hi dharm nirpekshata ki baatein kar rahe hai.. Yeh sirf india me hi ho sakta hai because of people like you who support this shit", "pterodactyl32": "U lost every respect today mam😠", "deegintown": "Hell yes ! Peaceful students burning buses and pelting stones. They even tried to burn bus which had passengers.", "seema.kajla": "You are one of a kind... Heights of stupidity. I saw you in indore when group of girls student asked for a pic with you and you pasted them... Remember during blenders pride fashion show... When you walked for rahul and rohit... So wtf you are talking abt... You are a horrible person.", "sher_singh_gabbi": "Ganwaar", "ashish_7453": "we should stand in solidarity with the constitution and not allow other to destroy it.", "eleaus_hrangkhawl": "❤️❤️❤️❤️❤️❤️", "vghat": "Burning trains and buses are called peaceful ..", "kxahid": "thank you mam❤️", "bhola_admi": "I have been shocked to see ur mentality... No concern with good or bad only islam fuck", "i.am.shubham_": "Thank you for stand", "maazkhan___8": "Thankyou @diamirzaofficial for supporting.", "pankaj_tahiliani": "I could not get the meaning of peaceful protection. If you mean the student protest was peaceful then i can say the ISIS is peacefully protesting the western world at syria", "thanksvir": "And what’s wrong in new bill, most of all developed countries have refugee programs where they allow refugees to live freely in these countries so if india would like to allow those kind of minorities refugees then what’s wrong in that.", "thebaddybisht": "Burning buses, pelting stones, destroying public property. You call it peaceful protest? Clearly you have no idea what you're talking about. Let's take a stand everybody, and yeah fuck you Dia Mirza!! Time to unfollow you", "anil_alka": "Diyamirja ko samjha k fayda nahi Hai usy to bus kitabi gyaan Hai ajkl uski dukaan bhi band Hai apny husband ko to sambhal nahi payee desh ko kyaa rasta dikhayegi 😂😂😂😂😂😂😂", "mazid6989": "Thnx mam for standing up on behalf of students", "khanhumaa": "👏👏👏well done for speaking out. Please create more awareness on this issue.", "beyondsorrowsnhappiness": "Unfollow her", "vas_happinin": "non Muslims brothers you can't understand the couses of NRC and CAB because it's not against you ( hindu, sikh, Buddhist, etc) it's against Muslims and our Indian Constitution. but you guys can understand that they are dividing us by the name of religion its disgusting you all know that just open your eyes and see whats happening and whats going happen in our country plzz 🙏 👉 WE ARE ONE 👈🙏 don't take it as a negative comment 🙏 i didn't have any problem living and growing together with hindu brothers and sisters 😍👍", "mr_incrediible": "Huge respect for you, ma'am! 🙏", "sumaiyaakbani904": "Well said🤘", "its_arif_mg_09": "🔥", "alhijab88": "This situation is like a Bollywood movie modi is sending his people to destroy stuff and blaming t on students", "simmokhann": "❤️❤️❤️🙏🙏🙏", "srvikrant": "@diamirzaofficial shame on you lady. Those students are not innocent. They are burning the public property and throwing stones on police. And you say peacefully protest!. Which kind of heart and mind you have? Delhi police done good job and we support them. I am also a student and I understand #CAB very well,but i am not like jamia's shit. Bloody fake, illiterate bollywood.", "vaishu_n_25": "Students destroyed public property..dat u shud know", "eeshathakur13": "✊🏾", "bunty18": "You certainly are a biased pretentious hypocrite. Giving minority refugees is a priority of CAA!", "rahuldaskashyap": "All Hindus of India should support NRC and CAA. If Hindus doesnt get protection and shelter in India,then where else???? In America or in Arab nations?? Moreover,NRC and CAA doesnt poses threats to Indian muslims....so where's the problem then ?", "xtremamar": "Yeh koi teri \"Re-take\" wali life nhi real life hy ye filmy duniya se bahar ake duniya dekh 🚩🚩", "ansaritamjid": "❤️❤️❤️", "jackdegrea": "Kitne bakchodi karoge tum Randi 😂", "akib6047": "❤️❤️❤️"}