{"mrkarate7": "👏", "kaustubhkorane": "U celebrities misguide the public.....just count the people's who want CAA ....Ur protest rallies are off now ...", "shashankcavalrybrat": "INDIA IS NOT A BLOODY DHARAMSALA, JO KOYI BHI YAHAN AAKE WOH BHI ILLEGALLY SETTLE HO JAYEGA. YOU MAY BE WELL EDUCATED BUT YOUR VIEWS SHOWS YOU ARE A DUMBASS AND ANTI INDIA. IF YOU ARE SO CONCERNED WITH PAKISTAN AND BANGLADESH AS YOUR NAME SUGGEST THEN PLZ LEAVE INDIA AND SETTLE OVER THERE. DON'T BURN OUR COUNTRY IN NAME OF BLOODY PROTEST.", "na.gendra713": "Pls support caa for India", "shukla.kriti185": "Time has come to unfollow you... Please go in details before supporting or being in against of anything... Being at this level you carry an important responsibility towards society....", "animeshspeaks_": "Fake n #socalled protest haha thousand's don't show whole Mumbai saying no to your #pseudoliberals please don't demean India if you hate modi shah ekbarr achee se CAA pad lo😉😝🙏🙏", "ashikihsan": "Dia I want to join the Mumbai protest", "itz_suhailaslam_07": "👌👌👌👌👌👌", "usmanhun": "But hindues no accept u as a muslims so then what next ?", "_yaassshhhh___": "Hindu apni gaand marate khudki hato se har baar.", "_mr._.mohit_": "Bhaiya jab ap sab Indian ho to ap dar q rahe ho...", "sahdevsur": "I support CAA.", "mr.irreprochable": "We #wesupportcabandnrc", "iamadi_chouhan": "#indiasupportscaa ,nrc", "rahulbharawa": "Paid patnership with left", "yogesh_s_rajawat": "Jb kuch pata na ho to hawa me teer na chalao smjhi what u know abOut caa, nrc, npr bss thoda rozgar mil jaaye in sb me aakr thode highlight ho jaaye bss", "prajapatinirmal": "😂😂😂😂 BHARAT MATA Ki JAY", "fariya48": "you are a good human really proud of you", "kanishkrathorr": "India supports nrc", "avishkar1997": "Support caa becoz this bill give citizenship to those who are targeted just becoz they are non-muslim", "vikas__bittu": "😂😂", "praveen_rathore_158": "Secular was never written in babasaheb constitution it was added by madam indra,have faith in babasaheb constitution but never read it😂😂", "kishan_sawale": "Support NRC CAA", "saurabhsingh6891": "99% didn't know the full form of NRC, CAA #i support CAB", "avadhutpatil01": "Radical Islamist dia", "m_sanmitra": "Yes to to NRC @diamirzaofficial", "rahaman.kiran": "👌", "chanchreek.ameta": "First read the bill then post about it.", "aajinkya_bhalerao1": "Yes we support NRC+CAA😘👍👍", "nysha133": "Thank you dia for making India an Islamic country.", "nangia_vivek81": "So true. I feel proud that I have attended my first every protest at jantar mantar same day when jamia incident happened. Say no to CAA and NRC.", "kopites_here": "Thank you ❤️ dia #indiaagainstcab", "sanket77": "Why are u afraid ??? Let the bill comes first and will see what is there in that... Else please share what is there in that bill if you know... Protesting blindly is not good... At least not expecting from people like you .... U are a celebrity... So people can follow you without thinking.... Stop all this...", "jadhavmrugesh": "Mrs Dia Mirza today it's clear that your are not getting films and popularity that's why you are doing it for trp but anytime your are stand for police that are injured in this volince the answer is no your are only a bollywood actress not a government employe or a ladies police who are injured ok", "thebaddybisht": "And yeah I say it again FUCK YOU @diamirzaofficial and many other celebs like you. For not only being Anti-CAA but also trying to spread all the negativities (that you posses) around you, by spreading such false messages. Shame on you. Shame!!!", "money_kaur2": "👍👍👍", "ujjwalsingh31": "According to the Indian Intelligence Bureau, the caa will add about 31,300 new citizens to India's 1.3 billion population. About 25,400 Hindus, 5,800 Sikhs along with less than 100 Christians and other religious minorities are expected to be immediately eligible for citizenship under the amended Citizenship Act. While NRC is for 1.9m ppl out of which 0.5 m are bengali hindus themselves. I ld humbly request ppl not to see both of them together.", "vishalpatel_1734": "I strongly support caa and nrc...", "amardeep_ambekar": "As being your followers or fans, Me & I think there are many your followers would like to know from you @diamirzaofficial , Exactly Why are you Against CAA or CAB? Please be specific with logical arguments. So it will be easier to understand & decide for all of us, to follow you or CAA / CAB !", "navinkhaware": "Most of them don't know why they are protesting", "mangeshnadgauda": "@diamirzaofficial please describe your understanding of CAA which has been passed by parliament?", "hussain.saddam01": "love you mam @diamirzaofficial ..!! you won my heart once again by daring to share this content..", "pheonix__5": "Half people there just came for making a Instagram post lol 😂😂", "krushithonaaasthi": "India supports CAB and NRC ... we dont need rotten pussies other than hindhus and buddhists...", "subhashkashyap978": "We support Modi ji", "triparna.dutta": "I support CAA and NRC 🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳", "r.rhyuhu": "Thank u dia for showing what major population of indians feel about this bill . imagine if similar type of nrcs are implemented across the globe and all engineers are deported back to India in similar way. We should not divide the nation for votes or publicity. India lack qualified politicians .", "riteishkk": "What is it all about ??", "vikrant_mhamunkar": "Guys do unfollow her. N show her your support for CAB.", "the_santanupani": "Actually this is the right way to protest against anything without harm anyone or violence @diamirzaofficial", "monuchahal61": "Support caa", "ashu_singh28": "Unfollow", "sidhujassi33": "I think majority of you might not even have any idea about what you will be going through if CAA and NRC is implemented. This is just a political drama to divert your mind from current real issues, and as elections approaching in many states in coming years they are trying to divide and rule what britishers did and they know it very well that this country is full of idiots & fools who will follow it and make them win in what they are trying to do.", "pramod_menkudale": "😆😆😆😆😆😝😝", "chaitanya_b_jhaveri": "Its shows how educated and cultured people you are staying in india..", "suchirasahani": "why its an issue if others will be counted as minorities based on their human rights. Why now we are talking about secularism when laws are discriminated previously. When Government assured “INDIANS” will not be impacted, why there’s a shout-out about unconstitution. Instead of being selfish..All of us should think wisely and peacefully.", "jawharahbodi": "♥️🙏", "iamrkarn": "We support CAA", "mr._tiwariji": "We support CAB,ask to dia did she know what is CAB????", "tanujvashishth": "Any new slogan.", "meenakshidpant": "Film industry people have no idea abt CAA n NRC... Everyone posting against it without any specific knowledge about the act! They are just against it without knowing what is it all about?! It has nothing to do with religion !! Phew... Kis kis ko samjhaye!", "pritam631": "Unfollow you is the best reply....कितनी भी कोशिश करलो कानुन तो FOLLOW जरुर होगा.", "juhee7830": "👍🇮🇳 I love India", "vimlesh8984": "EVM hatao desh bachao 🙏", "khan_sahab__313": "#indiaagainstnrc_cab , #indiaagainstcaa", "rajkerwa": "We support cab and nrc", "sharmanikitasharma": "Sorry to sy but the nrc, caa act are correct people should read it before protesting https://www.facebook.com/100009782988042/posts/1033859050283518/", "link__1996": "No nrc + caa", "rashidmominras": "😘😘😘😘😍👌 Diya jj ko Mera Salam", "biirdtt": "Kon kaha NRC pass ho Gaya??", "fun_time634": "Pehli fursat Mai nikal", "imjitendra_13": "There are 7 or more Islamic countries Go and live there ...#Shame Dia", "divakar_singh_rajpoot": "We support #CAA...Shame on u", "satendra_singh__": "Mam is act ka nrc se koi lena dena nhi h aur na hi indian citizens ka ye act shirf refuses ke liye jine indian citizenship milegi isme to kisi ko bhi problem nhi honi chayiye mam phle jaker is act ko shi se pdiye tum is protest m inculed hoker ye bta rhi ho ki tume bhi is act ke bare m kuch pta nhi h shame on you mam🤣🤣🤬🤬", "laataanand": "I really feel celebrities need to educate themselves...such a stupid comment...", "salman_hashmi67": "😍👌", "rohit.totawar.7": "🇮🇳We support NRC & cab🇮🇳", "zs_s_h_a_a_n": "Good job ma'am😍👏👏👌", "sanand_1": "बर्बाद गुलिस्ताँ करने को तो, एक ही उल्लू काफी था, यहां हर शाख पे उल्लू बैठा है, अंजाम -ए -गुलिस्ताँ क्या होगा। #ISupportCAA_NRC", "erprateekkhanna": "Bullshit. More then 50% crowd don’t know what this law is. It’s very sad for our country to have such low literacy level.", "zaki_hussain__": "@mustafa477", "anas.qasim.144": "Tujhse nhi mitne to mere pas bhej de", "rani_meeta": "So ill health aa 😉", "anik_deyy": "We support bjp", "dr.alishasinha22": "Yes CAA", "anshumanaluria": "Dia didi TB comment nai aaya...jb kashmir se 3 lakh kashmiri pandito ka rape KIA or nikala...vo b raato raat...didi ka TB b comment nai aaya jb 3yr old twinkle ka rape hua..didi ka TB post nai aaya jb hydrabad ka owasi ka bhai Ye bolta h..Ki 15 min ke liye police hta lo...hum hinduo ko dikha denge...but ab aaya...shabashhh dia didi..😂😂", "saimanaaz88": "🙌🙌", "denial606": "Please understand first... CAA is only for foreigners.... Not for Indians....and in our constitution there are rights for only citizens of india and not for other countries people.....", "lisaa_ray": "U r no less than those politicians who encite ignorant citizens for their petty political gains. U r working as their agent by feeding people with half knowledge and creating fear mongering among masses. Lost all respect. U R NO IDOL, UNFOLLOWING U", "yagnesh_001": "Shame on you @diamirzaofficial I am great fan of yours from childhood but you had disappointed me. CAB and NRC for better future of India. Most of protestors doesn't know any things about this.", "shamsfraganjum": "👌👌👌👍👍", "i_abhaygupta": "Diya Mirza What u think u ppls are protesting for .....please make a line what is in not favour of INDIA in the CAA bill. U ppls are Hippocrates....", "animesh___22": "Stop spreading fake news about #CAA it doesn't affect any Indian Muslims and what do you all want that muslims from neighbouring countries should also be Indian native so that you all can make India an Islamic state........ OR you people just want to disturb the country because it is being jurisdicted by people you don't like.", "sepidehimanioffical": "💖💖💖💖💖💖💖", "gulam_madani": "Lawde laga dera modi India ke.", "shitaldashrathkath": "Mirza mam CAA nhi h wo CAB hai .n we support to NRC + CAB .👏👏.ye hum Kisi bhi situation m krk rahenge .....Hume wo Muslim Chahiye Jo India k hai ..wo nhi Jo yha Aaye or rh rhe hai ...or bahar k Muslim log India se jab Jane k liye taiyar h to kyu zuti news bata rhe h .......jab matalb nhi pta apko NRC h kya..", "moahamednawaz89": "We need azadi from hindutva terrorism", "nicky_hindu": "Tukde tukde gang", "avkashmaheshwari": "होटल में बिना आईडी के रूम नही मिलता तो बिना नागरिकता के हमारे देश में कोई कैसे रह सकता है,हिंदुस्तान धर्मशाला नही है।। I support to NRC and CAB 👍", "aj_patdiya": "Bill padho shamjo fir bhoko 🖕", "vats_pv": "Don't spread propaganda. U Bollywood dumbs are greater threat to india than anyone else", "sonusinghr": "We are supporting CAA+NRC🇮🇳", "rahuldutt1981": "I follow you but this time you are not right.", "botti.13": "✊🏻✊🏻✊🏻", "shakti_nishapareek": "Peaceful protest?ha ha ha", "chiranjit_7": "🔥", "dixitpatel1978": "Educate yourself and learn to read...stop appeasements. You didn’t see the good it did for the real oppressed but whining for one community. Hypocrisy at its best. Last but not the least...it’s not against any religion including Muslims. Basic reading and listening skills.", "vsrishty": "You are such a senseless woman i hv never expected this 😊 these types of posts of yours provoking them to protest against the laws. You guys are taking laws and government very lightly. U think whatever u guys say they will do. Madame atleast read the whole CAB ONCE", "monujchemistry": "#dia🇲🇷😂😂", "chawlakhyati": "Instead of misusing ur social media handles and supporting the people who are not part of our country ur ready to create mess in ur own country which has given u so much u should ur self first understand what the bill is all about and what is happening in country in the name of protest is not right at all u do have some responsibilities as a celebrity so first understand the topic and react posting ur religion doesn't matter what post ur making on humanitarian grounds do matter ru happy to support the people who are harming police officials government property?", "reeja__81": "Yes", "amansinha239": "Jb koi implementation ni hua tb aap log kyu protest KR re ho jb glt ho ri no rha or sbse imp Chez ye matter court Mai hai toh road Mai aakar SB ka time Kyu khrb KR re ho. Aap log Kya fever hone Ke pehele hi medicine lete ho lgta hai.", "md.ankit": "I have stopped following you only because you have not understood this bill and you have started protest it....... NRC provisions are yet to be finalised pls understand tht #supportCAA", "sudheersharma1": "Plz unfollow the celebrity jo desh k sat nhi hum unke sat nhi", "saurabh.bhatt.944": "Bichari ko kam dhandha nai mil raha he na to dimag chalna bandh ho gaya he", "shivam_agarwal_official_": "Ye galat kar rhe ho aap!!!", "suresh_jadav": "We support CAA+NRC", "noorzianangarhary": "What wrong with you guys freedom freedom freedom 😂😂😂😂😂😂 go Pakistan", "rahulbhardwaj3443": "मेने पहली बार देखा है..बॉलीवुड भी अफवाओं पर ध्यान देता है..", "the_abusufiyan": "💙💙💙", "theizhar_official": "Oppose NRC & cab", "rangpencil1": "Wonder why police not dumping you in jail under section 109 and 155 of IPC. You are the #1 liar i know, doing things to earn easy money.", "ajp06111999": "😂😂😂😂🤣🤣🤣", "prashant07bharti": "Bhed ki chaal ,when protest is fashion irrespective of idealogy behind it", "syangel4": "👏bravo. we are against caa and nrc", "wolverine7553": "Wesupport nrc cab", "ivishal7": "We support CAA as it will not impact indian muslims and there is no need to talk about NRC when its not presented or approved in Parliament but some political parties are spreading fear in muslim brothers. No indian muslim will leave country for any reason forced by government. This is unnecessary protest all indian muslims are safe in india", "the_powerof_veganism": "Dia Mirza - you are posting videos which is clearing telling about human rights in India...Have you spoken or posted any picture or video about ANIMAL RIGHTS?? Don’t you think Animals are living beings and are a part of this society...They should not be killed for food and clothing?? Don’t you think animals feel pain and fear?? #animalrightsactivist #animalrightsmovement", "leearya": "Tum sari actresses Bollywood ki high profile prostitute ho ye sub ko pata hai tum log salle hindu virodhi ho aur Muslim actors ke chuse ne waliya ho main samahj tatha ki tum ek samajdar ho per tum bhi 🐷 premi nikli thoo", "thakrarmahesh": "👎👎👎", "naaz0101": "🙌", "sushnagaraja": "Yet another social media stunt😂", "surumi_kutty": "We are againt 👎... BJP burning Indian..", "praths.mahadik": "As mota Bhai wud day, kitna bhi nichod lo tel nahi nikal paoge", "nilesh_rajput24": "U people. Support terrorist..that is y", "kumaraahawan": "आम जनता को ये लोग दंगे फ़साद के लिए भड़का रहे है! कितनी शर्म की बात है कि जिसे हमारे देश की युवा अपना रॉल मॉडल मानते है! वही लोग हमे उकसा रहे है! अरे हमारे देश के शिक्षित लोगों ( वामपंथी उग्रवाद) शांति का संदेश लोगों को दो! हम गांधी , बुद्ध और विवेकानंद के पुजारी हैं ! हम हिंसा का बढ़ावा नही देते, हम प्यार से किसी का दिल जीतते है! धन्यवाद , आप जैसे कुछ आला कलाकारों ने हमारी आँखे खोल दी! नहीं तो वर्षों से मैं खाट पर पड़ा था", "er.ankurmisra": "We support and unfollw u", "rajnishpandey63": "Mumbai tera baap ka nhi samjhi toh aisa mat likh Mumbaiagainst NRC aisa likho muslim and librandu against NRC not Mumbai. Mumbai support NRC", "adnan_hamzah_": "❤️❤️❤️", "shaswati_m": "If you are supporting peaceful protest then it’s good, bcz I do support that too...but you are a known face of India... please do not say anything which is illogical...If you are saying NO to NRC and CAA please do mention why... just saying yes or no doesn’t work for celebrities like you... @diamirzaofficial", "rajas2880": "Bakwas", "hpmahato": "Chutiya .... 2 करोड़ बांग्लादेशी मुस्लिमों, ओर रोहिंग्या को बसाने के लिए ,पूरा बॉलीवुड उतर आया । और अपने देश से कश्मीरी पंडितों की इज़्ज़त लूटी गई उसका आज तक कुछ नही बोला ये जिहादी बॉलीवुड।।", "mayur.bhagwat": "@diamirzaofficial - We support CAB and NRC. Do u atleast have any knowledge of what it is and y you r opposing?? Stop spreading such nonsensical post on insta and dont divert people in wrong direction. If u feel u unsafe then u r most welcome 👍🏼", "mohantysonu": "I don’t get the exact reason behind this protest! Firstly, It doesn’t affect the Indian Muslim living in India legally. Secondly, it will provide citizenship to the minority communities who are having difficulties in living a life in Muslim majority countries. Thirdly, it detains the illegal immigrants who are living in India. So, what’s wrong in it? Rather India will be a more systematic and organised country if the government has a record of its citizens.", "tstrak0187": "@diamirzaofficial why is it that if Socialism is so great why do people keep escaping those countries and comes to India and won’t go to country like Swiss, or Sweden? If@you can answer that", "iamsunnyfaldu": "If you are saying that people of india believe in the idea of india that includes all then why there is reservations quotas in every field why didn't you raised your voice over there ?? It should be equal too right ??", "al.iya8019": "Well done @diamirzaofficial 👍👍", "sanaaa__56": "Well said @diamirzaofficial", "imran4roi": "@diamirzaofficial love to see your support..", "samarpitjena": "Peaceful, yet stupid, unwanted, and hypocritical....U Bollywood dumbos have no sympathy for the Hindus facing persecution in Pakistan in the hands of the Islamic jihadis....", "samsr0123": "Kya jahil celebrities hai india me", "gaganboparai.3": "🙌", "ndhaka00": "Unfollowing You", "diamirza_slay": "💓💓💓💓💓💓", "_cr7_param": "Madam ke ghar ke bahar security rehti hai taki koi ghus nah jaye but she wants our border should not be protected...dumbooo", "deo.amaraja29": "yesss. We are Indian.. and we should support to NRC+CAA... Jai Hind..", "shrutiarya1": "We support CAB & NRC Jai Hind 🇮🇳", "arzu_akay_film_yorumlari": "❤️", "itsyogi_k": "https://youtu.be/emfrg_9nnVs firstly see this video then support them to protest", "rohit7301": "Dear dia aap ab itna emotional mat ho kyu ki ye jitne b h na inke exam over ho chuke hai or jine exam dene hai vo de nahi pare hai so please don't share bcz u have a fan following ok sarakar ne jo Kia hai vo 2003 me congress kerne ja rahi thi but vo ab hua hai illigal entry ko rokne k lie ok so please don't be bhavuk be Indian nd trust Indian", "wizard230207": "U r shit Dia Mirza. Proved u r a muslim n nvr luv India.fuck off", "salim_saiyed": "Good job, we always support CAB-NRC👍", "tanishgupta390": "Ap padhe likhe ho ap aise faltu k kaam mt kro aur ap ko iss bill se koi dikkat nhi honi chahiyea kyuki ap ko koi nhi nikl raha hai india se", "the.energy.alchemist": "We support CAA", "samraaamirsiddiqui": "NO NRC ,NO CAA !!", "maulik.patel3239": "We support CAB", "shiv_mohi_ni_1428": "Yes👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳", "hassu173": "Show me any modi supporter who is real patriotic instead of muslim hater i m waiting... There must be no one because the only reason they support bjp is bcoz of their attitude towards muslims bhakts just ask a ques to urself if there is no muslims in india would u support modi and bjp specially after seeing the economical condition of country....just ask once....... Rip to these mindsets", "khanmantasha541": "Yeh kaise log h Jo Ulta bol rhe h RSs ke log hai yeh log Q nikle yeh desh se hamara desh h yeh azadi Mai hamare logo ne apna sir kataya h yeh desh chodne ke liye Nahi", "ranjishrajan": "Paid protest.", "its_akanshasinghal": "u are provoking the people shame on you we need to unfollow her", "sangelrally": "👏👏👏👏👏👏👏👏👏👏👏👏", "shaguftabeautyhub": "No to NRC+CAA", "chaudharrryyy": "Guys what are you waiting for..??? Aby unfollow karo dikhao inko jo tumhe nahi chahte unko tum bhi nahi chahte...", "life_is_a_parachute_official": "Nonsense idiotic ,educated illiterates", "vicky.ch.79219": "Nice", "idpesh": "Again🤣 5000 people us not mumbai 🤣🤣", "cheeky.8": "@diamirzaofficial please read this articlehttps://www.quora.com/What-should-everyone-know-about-CAB-and-NRC/answer/Ritul-Srivastava?ch=3&share=b632de1f&srid=P6IGu", "chandana_giridhar": "Useless post", "vikassharma2851": "Diya mam apko aise post share nh krne chaiye ghr u should hav shame on u", "magiciansahil": "@magiciananshul", "raj_dongare_2151": "Lavdi sali", "anurupbiswal": "I support NRC+CAA", "deebains50": "Diamirza is a clown . We support caa", "vikasdhoble": "Shame", "mywishmyrules": "Spread peace not hate . Come and see situation in Delhi it is very easy to post random protest pictures on social media being a celebrity rather than promoting a good way of solving this you people are only spreading hate . Students cannot go to school, metro stations are closed , roads are blocked, people are pelting stones ,internet is shut down is it Delhi or Kashmir ? And rather than promoting a way through which it can be solved peacefully Bollywood is putting petrol in fire 🙌🙌🙌people cannot go to work, females cannot go out is this a way to protest ask yourself", "ruchimugrai": "Shameful. ..before protest please understand the ACT then react ..seriously it's shows your chip understanding level. .shame on you", "dvhmd57": "I am proud supporter of NRC CAA", "meghanaathalye": "Ma'am, no one is taking away the rights of the people who are protesting. What is the reason for the protest? The rights are now given to the people to whom they were long overdue. Don't you think the protest is uncalled for and is instigated by certain political party? Politics is a game of selfish people. Though I agree with you that today's protests in mumbai were peaceful as there was majority of educated, young students who may / may not belong to the community they are supporting. There was a positive vibe. But the point is why to protest? If in your opinion it had not caused problems to anyone then you are wrong. There were traffic jams, water cuts etc.", "rituloiya": "@diamirzaofficial is your interference necessary everywhere 😈😈", "rohit__ydv": "We support CAB", "msmelkiosfoodstories": "Hope!! Thanks to celebrities like you who have not yet sold your soul to the ruling party and can think on your own with sense and logic.", "_jay_7373": "https://www.aninews.in/news/national/general-news/ahmedabad-19-cops-injured-in-violence-in-shah-alam-area-32-detained20191219230130/ ( please tell about this too)", "vipul.kakadiya.77": "Bed Indian Muslim???", "saurabh.singh2205": "Aur kuch kaam nai hai toh yehi karo", "sanchit171991": "We are against CAB and NRC this should taken down asap", "dhanusapalya": "I support NRC & CAA", "jasmine_siddiqui18": "You don't need to be \"Bhakts\" to support NRC , You just need to be \"Blind\" 💁 (Blind =Mentally blind)", "rastogi.srijan": "Shame on you😡😡...please support CAA and NRC # Jai Hind 🇮🇳🇮🇳bharat mata ki jai🇮🇳🇮🇳🙏", "thatsmepriyankarao": "Please understand what is CAB and CAA. We support it.", "tmroshan": "Guess one Bollywood celeb cald another... Let's do dharna let's protest without even reading the act. Shame these so cald responsible citizens are acting like uneducated disguised people of India", "iamarjunshah": "Unfollowed", "sharmashiv8989": "Mere samjh nhi aa rha ap jese celebrity CAA ka virodh kyu kr rhe hai jbki CAA me esa kuch nhi na to isse kisi ki nagarikata chin rhi hai na hi kisi ko desh se bahar kiya ja rha hai blki yh to nagrikta dene ka act hai km se km bahar se aaye sartharthi ka to khayal rakho unko bare me to socho ek bar pta nhi kyu virodh kr rhe hai log", "naaz_chowdhary3": "Log are gawars , it's better that you should disabled cmmt on this post", "vikram_singh_charkara": "Nikal", "das_trisha": "😘", "prashanttiwarimech": "Real face of these stupid celebrities..", "div_34817": "Tum indian nhi ho kyaa? Agar ho to tumko darr kyu lagrha hai ?? @diamirzaofficial", "snigdhapundir": "India supports NRC and CAA...", "theanimalmagnetiser": "Please go and read the act first and get your doubts clear... Do not misguide people like that.", "aslam_khan2804": "💪🏿💪🏿", "aramkhor.here": "Bhakts are those who are less educated or uneducated. So, there's nothing to worry as all the good-minded people are together protesting against these NRC and CAA. We're with you, go ahead...", "appijoshi2": "Unfollow karva ne ki ninja technique 🙏", "sunnysep1": "Few morons cannot take india for ransom remember india is a country of more than 125 Cr people few thousand people demonstrating hardly makes a difference which are politically motivated. Be assured that there will not be any Change in the bill nor government or court stance", "rooh093": "❤️❤️❤️", "ur_karan_rana2422": "why r u protestg this typ fuckn things", "shashidarpoojary52": "Saniya what the fuck ur doing ...mulli always mulli chahe wo clebrity ho ya jihadi", "_raghavlakhotia_": "Support CAA+ NRC , Support HINDU RASTRA🚩🚩", "shaileshparkar": "If u ask 80% of the people from this march does not know what NRC and CAB mean. We all support CAB and NRC in national benefit.", "naziya0612": "Very well", "puneet_upadhyay16": "What a irony they reject CAA & NRC but nobody is saying why...because they don't have guts and knowledge abt it...we support CAA", "belykbroinsta": "Anpad gawar actress", "sanket.bhise20": "Unfollowing", "smilewithsalil": "We support cab n nrc", "kavitakhadakkar": "U brave lady ..proud of u and people who are supporting CAA, NRC or CAB what in this is gonna benefit u as citizens of India ...frankly nothing we as tax payers only get burdens of refugees and extra people", "vshraj16": "Everyone+(Balatkaaris,Gaddaar,Criminals,Fakefaces,Atanksaadis) have rights in so called #Secularism #Democracy,,, But what mentality is this...as already cleared by gvrnmnt that no indian muslim or other religion get affected by #cab/Nrc... I m ur bigfan and want you to plz understand the bill first not only look and complain,dont see only one side... There r many people living in india illegally mostly in bengal for only local party benefit #Vote...What about that??? WHAT ab8 minority hindus living in other Islamic ruled countries having opposite human rights or culture from here as people are talking/doing here openly in full comfort,Law inhand, damaging public properties, beating security officials with only rumours spreaded,,This is OK for you?!👎🏻👎🏻& you as a VIP actor!!!!.... @diamirzaofficial", "aleem_baig10": "#boycottnrc🚫", "sarvagna_bhatt.13": "We support CAB and NRC. Har Har Modi.... 🙏🚩🚩", "rajput_pravinsingh0746": "Say Yes to NRC+CAA", "vaibhav4900": "I use to respect follow from very long time...do you know mam about what is CAB and NRC.. Why government is trying to implement ...", "aniket.barde13": "#iamwithcab", "kadamvicky_vk": "Shame on you @diya_mirza_officel do you even know what is CAA CAB for? Nobody is throwing Indian Muslims out. Just for preventing new comers. And remember one thing “Every Muslim is not a terrorist, but every terrorist is a Muslim”", "fiza_naazsheikh": "u r a beautiful beautiful beautiful soul... I hugely respect you... how i wish other bollywood bigwigs come out in this support... becoz its u pple who can bring a change, help in stopping this act... my India our India... thnks a lot mam... dil se.. am humble...", "vinod_saini258": "Namo namo", "i.m_biswajit": "I SUPPORT B.J.P.", "adarshhoizal": "Mumbai is not against CAA. India is not against CAA. Only muslims are against CAA.", "vikrambaligab": "Flop actress no other work to do no film nothing just want attention that's it 🤣🤣 bye to ur page", "monu4150": "We support CAA AND NRC", "deepshikharanarawat": "Pls jra China k Muslims k liye bhi bolo", "mousamsemily": "CAA is not for Indian citizens...it is to get Indian citizenship...and NRC is applicable process on every Indian...plz get the difference...", "saysumitbulan": "No nrc no cab", "anasanesnehal": "Its sad to see such opinion from people like who claim to be secular ... 😐😔 Atleast the educated ones can prove being educated enough...", "bhunendra_chaudhary": "Strongly support CAA", "sanju__54": "Jisko bhi apni citizenship jane ka darr hai wo dikhado government ko proof ki unki family ke amma papa yaha ke the...to koi problem nahi hogi...jo gus gaye hai unko hi taklif hai", "arpanraj48_17": "Don’t mIx asaam Nrc with Nrc that not yet draft First see What nrc bring then Protest.", "dharamraj_kava": "??? What is this", "hardik307": "You don't enter this matter you do your job", "shubham902": "The CAB, NEVER says that illegal immigrants of ANY RELIGION will get the citizenship. What it actually says - The immigrats from, specific 3 countries ie. Pakistan, Afganistan & Bangladesh. Will get the benefit of reduction of 6yrs (11-6=5) which means now they will become citizen after 5 yrs. And muslims will get after 11yrs. This act is Not applicable for remaining 191 countries. Which means immigrants of any religion, from remaining191 countries will have to fulfill 11yrs and other conditions to become citizen of India Things you should know- 1.After CAB muslims from this 3 specific countries will also get the citizenship. 2. Why muslims of 3 specific countries are not getting benefits, bcz these benefits are for those religion which have seen exploitation over there (in 3 specific islamic countries) •And muslims of those 3 countries can also apply for citizenship. Thn they have to follow same set of rules, which are remaining 191 countries people are following to bcm citizen of India (of any religion) 3. Muslims of India have nothing to do with this Act. Cz they are already citizens of india. 4. NRC & CAB are totally different things. NRC has nothing to do with any religion. •Documents required in NRC are- Birth certificate, post office/bank/LIC document, or any acceptable document. 3. Muslims from all over the world are eligible for citizenship of India. 4. If NRC came into Act, The Muslims which are citizen* of India have to follow same procedure, which the people of other religion have to follow. 5. Assam is fighting for ILP. And ILP is for vulnerable communities which are at stage of extinction. If ILP is provided to assam than in future every state will protest for ILP. *ILP is like visa , which means you have to take ILP from government personnel to visit that place.", "v._rikhi": "Sorry, not mumbai, hand full of people, who r silver spoons of opposition parties nd some flop filmwalas.", "akkicoolakki": "we support CAB and NRC", "sanjit.parida.520": "Tu to bas chup rah", "m.zafruddin786": "B j p ko band Karo India main", "sanam.ingenuity": "Jai hind!!", "jolleygood02": "@diamirzaofficial I respect you a lot. Please go beyond religious rhetoric and thing if CAA and NRC are good or bad for country. In my opinion both are very much needed.", "sameerdadhich302": "पागल ह क्या बे ... जो काम चल रहा हैं उसको भी फेल करवाएगी अपना ... सस्ती रंडी", "attri.abhi": "Resources of this country is for Indians first and last, muslims in neighbouring countries, want to come in India because they have nothing in their country.", "shivpratap_singh_rajawat": "Stupide peoples we support CAB &NRC", "vishalgoela": "Problem kya h CAB se", "sakshi051": "We all support cab ND nrc too.", "sagar_jamkhandi": "We support CAB and NRC # unfollow @diamirzaofficial", "iamankite__pexels": "Jisko bhi CAA , aur NCR nhi pasand woh chahe toh Apne katve muslim arbi countries me ja sakte hai jao #boycottmuslim", "saffron_reaper": "We support cab ! Please understand the official version beta", "chandanbandi": "Ranbir", "ross_shan": "We support CAA and NRC an ghode ki race me gadhe v doudenge pta to hoga ni CAA or NRC ke baare me bs bkwash krwa le inse", "anupambajpai755": "👂 🤔 लोगों का असली चेहरा अब सामने आ रहा है😃", "tamsilhussain": "Great mam..kudos..", "aakanksha.sh": "Protest... go ahead... BUT can u just gIve one logical reason behind ur protest..", "sunny_singh_1947": "Bhag sali kamini yaha se", "advriteshdawda": "I m sure u have not gone through CAA or understood its motive.... trust me there is nothing against Indian Muslims .... dont fall for this politically motivated drama...", "shaikhismail504": "First cab after nrc to harrass the poor citizen of India no cab then automatic no nrc", "sachinpavarr": "विदेशी लोग अपने देश मे इलिगल रहे ऐसें कोणसे देश का कानून है मॅडम", "varad_kulkarni.7503": "We support cab🇮🇳🇮🇳 राष्ट्रहित मे हमारा समर्थन", "gurpreet20k": "I am against NRC + CAA", "satyen_74": "I support CAA", "handsome_guysohit": "Mjk haim bhosdi ke nikal", "lets_define_love_": "@diamirzaofficial why you are against #CAB", "mahesh_akhade": "@diamirzaofficial I Like You for whatever you doing for nation via NGO's but For This I'm Going to Unfollow You.", "sumaidkhan.sk": "You are doing great mam 👍", "pari9652": "People just need some spark to protest without even knowing the reason..... of course BJP haters will say no to everything BJP does... my support for CAB👏", "d.pathakk52": "Ye cab ka nhi pakistan se jo hindu or sikh aayenge unka virodh hai i support caa😁😁😁😁", "satishsahu_12": "😂", "joengam": "@abo__tani", "hafeeznazar": "Dia 👍🏻👍🏻👍🏻👍🏻👍🏻💯💯💯💯", "anil_alka": "Apky husband kaha Hai 😂😂😂😂😂😂 wo kahi desh se bahar to nahi Kar diyee gayee, aaap jaise log agar aise msg share karogy to dangy or badkyngy apko pata Hai apko bahut log follow karty Hai admire karty Hai kuch acha msg do jissy acha ho.", "i_mitesh": "report inappropriate", "harendra_zatakia": "We support CAA and NRC.. If you have a problem then you can leave country.", "puja_24_singh": "Mam 1st time I'm nt supporting u I always appreciate ur good work but this time nt .", "its_arif_mg_09": "🔥 Love u", "dilgeer78": "O Dia... I thought you were an intellectual, but you too turned into a pseudo.... Tch tch", "sunilsunil1733": "Full support cab and nrc", "khush_charm": "Dia this was not expected from you at least its a very deep discussion and a long way to go and support for Indian citizens from illegal migrants. There are millions of people who is staying in india without any identity from across the world. This is one of the reason of indian population and tax payer are suffering there burden they have no rights to destroy any public property and harm anyone. I am true indian and will definitely support CAB & NRC.", "sumitkumarkes": "We support CAA &NRC", "rathaurrishav": "We support NRC and CAA", "lakhanks_1993": "We support CAA+NRC", "tapan4980": "Please take all the refugees to Mumbai....we don't want them in our states", "ainam_j": "♥️", "rajat_kashyap25": "Aur jo bhi protect kar rahe unhe act ke bare me puri batien pta nahi hai ya to jaahil hai sab...", "theburgerhimself": "Kam bol thoda! Zyada jiyegi. Apne kaam pe dhyan de... Rajniti zara kam kar. Tere ko congress ticket nahi degi.", "arre_golu": "boycott dia mirza", "pujadas5376": "Gawar aurat", "taklikarmahendra": "Kyu ap logo ko gumrah kr rahe ho", "fma626": "#citizenshipamendmentbill", "rahul_verma0601": "Wrong divya ji so wrong that you not supporting to CAB even you are so educated too..", "ashwinsinh.p": "We support NRC+CAA", "ary1122an": "Just on follow these people .. inko inki aukat pata chalegi .. jihadi supporters #shameonbollywood", "sajid_ansari0701": "No Nrc No CAA", "white_canvas_photography0": "We support CAA and NRC jay hind", "mousumi.begam": "Against caa agains nrc", "azamkhan9659": "😍👏👏👌👌👌👌👌👌👌👌👌👌❤️", "sspkudla": "Support CAB and NRC. It's for India and indians🇮🇳🇮🇳🇮🇳", "prashantjadhav03": "Shame on you Diya Mirza. I was a BIG fan since when i saw ur movie RHTDM. Person like you who is so Matured and eduacated is opposing this bill. Never expected this from you. Unfollow you Strongly.", "the.pankaj.verma": "Shame on you", "vvkkumar23": "Get lost", "vikrantgiradkar": "This is some people against CAA .", "nshi_i": "Hazar chuhe maar ke billie haj ko chali", "akii2641": "You can walk out of my country... We don't need you at all... Your presence don't matter to us, not even to this universe...coz whatever you are doing is is for publicity... You people are heartless and you people love to play with innocent people who gives you value more than you deserve... Stop taking advantage and do something with purity...Even less educated people are smarter than you many people understand the bill and supported...", "gaurav.dixit.89": "No one is against, except u", "tanya.chakravarty": "Dear Mr. Prime Minister and Mr. Home Minister, This is an open letter from a law abiding tax paying citizen echoing the voice of many. Do not test our patience. We voted for development and prosperity. Not for you to divide us. Not again. Yes partition happened and we suffered including my family. We have built everything back brick by brick despite the hurdles we faced. Not for anyone to take political advantage of it today. We are not and refuse to be a country that discriminates on religion. This is not the will of the majority. We don’t want to debate about religious identities, we don’t want to hate our neighbour. We are better than this, more evolved than this. Don’t teach us hate or selective inclusion. This is not the voice of your political opponents, this is the voice of the people of this nation. Voice of the youth on the basis of whom you market this country. Listen to us. We want the focus back on economy and development.  Roll back CAA.", "mayank.kahar": "AAP bhi shukriya ki AAP Ko unfollow karna hai ham s", "jasjeetgill89": "Great", "nani_88868": "😁😁😁 why these people waste their time and others in name of unity humanity protest 😁😁😁", "sanjayaggarwal1991": "Protest krne se pehle mtlb toh samjho.. Big fan @diamirzaofficial but I support CAB ND NRC😊", "adharshilathapa": "😘😘", "amal_v.v": "The whole ❤️Kerala❤️ is against #CAA", "manish.sahu77": "😂😮", "hiteshfaldu011": "I m not agree with u", "yogim88": "I request you to all how support CAB and NRC please unfallow her", "nishiniaz": "👍👏👏👏🙌🙌👌", "onlyvish333": "https://www-ichowk-in.cdn.ampproject.org/v/s/www.ichowk.in/lite/politics/nrc-and-caa-cab-full-form-kya-hai-hindi-mein-bataen-i-support-caa-nrc-image/story/1/16598.html?amp_js_v=a2&amp_gsa=1&usqp=mq331AQCKAE%3D#aoh=15767646746159&referrer=https%3A%2F%2Fwww.google.com&amp_tf=From%20%251%24s&ampshare=https%3A%2F%2Fwww.ichowk.in%2Fpolitics%2Fnrc-and-caa-cab-full-form-kya-hai-hindi-mein-bataen-i-support-caa-nrc-image%2Fstory%2F1%2F16598.html", "manish20jadhav": "Mam i think there is some confusion to understand the NRC & CAB we shud wait till its implementation many of people even doesn't understand the bill and spreading rumors, nobody can snatch the citizenship If anyone tried then crores are indians here to stand in fron of them even constitution law and orders are available We shud not listen and come to at any wrong conclusion", "vibhor.j12": "@diamirzaofficial Be reasonable! Do you even know what these bills are? Can you reason why do you oppose this? NRC is just Assam act as of now, CAB doesn't discriminate with Muslims. This is so evident that you do not understand this. Do you have an opinion on the illegal migrants from Bengal who have infiltrated every corner of country? Where would troubled minorities from Pakistan go? You need to learn more about atrocities Hindus face in Pakistan. If India keep welcoming these infiltrators, crimes will increase, so will struggle for each common man. I am sorry but I lost respect for you ma'am. Whatever you did good for environment does not hold any good when you post such things. You are welcome to block me if this hurts your ego.", "pritikarthik": "It is better people understand the good intention of CAA and not be carried away by false propaganda of pseudo Intellectuals and politicians who use people for their vote banks", "ballusingh023": "We support CAB n NRC🙏", "salwa_adiba": "Tons of respect 💓✊", "le_nikhil": "You were my favourite diya, beacuse you used to work for humanity.", "acgetu": "People are not aware of what CAA is and you people Bollywood ppl are spreading hatred", "aabha.jagota": "Ur first responsibility shud be to read the bill, and then drive ur judgements and support matter. Doesn't look like u have a fair understanding what the bill says. If so then u do have a shallow understanding to get the reasons behind the bill.", "tejpanthi": "👎👎👎👎👎👎👎", "shoaibrajput6441": "Ya Allah tera shukr hame Pakistan me bhej diya hamre baap dada bhi Indian the barwaqt Pakistan agaye sukoon se apne mulk me rahe hn allhumdullliah 😊😊", "shwetahegde011": "Shut up", "zarlishmirza0": "u thought like this amazing👏👏 love u dia", "arun_bisht7": "❤️", "aisha_khan054": "We are with both bills. You concentrate more on your movies rather than any other things. I don't think if you have given any hit😂", "igusername44": "Aye pagal aaaauurat 🤡", "moonlove.shines": "❤️", "nidhi.sanjay": "i support the bill..", "ms.sharma17": "Oh really... Do you even understand and have read CAB? Such hypocrite people you are. Jis desh ka khaate ho usi desh ka bura sochte ho. Muslims out of india has a choice of 52 countries to go. Pakistan ka concept isiliye aaya tha na.. Ki alag muslim nation chahiye. Aur tum bollywood walo ko toh india muslim k towards insensitive and intolerant lagta tha, tum hi Bollywood walo ne kaha tha ki india mein dar lagta hai, safe nhi lagta... Aur rahna bhi tumko 52 desh chodkar yahi hai.. Sharam karo", "zaid7860khan": "👏👏👏👏👏", "books_sayings123": "I support humanity not politicians vote bank, so NO NRC ..NO CAB", "pankit_s": "Shame dia...you hv lost your humanity...do you have shame or even thinking about a minority people living in pakistan Afghanistan and Bangladesh..?", "ayushi.tandon": "Pehle matlab toh samjhlo CAA aur NRC ka @diamirzaofficial 👎 unless brains", "reena10s": "Let's be calm & maintain peace. Be united against any external or internal extremist groups. Jai Bharat🌺🌺", "qudsiyabanu": "👍🏻🤗🤗 Proud of you Dia. Now bhakts will come here to bombard their half knowledge. 🤣", "aadietya_singh": "No we are not....we support CAB and NRC", "_bhavyapandey": "@diamirzaofficial aap log gire hue h thodisi fan following k liye aaplog kitna girr sakte h ijjat se aap chijo ko samjhna chahiye aap bhadka rahi h aapke andar ka muslman nahi bhoot saitan jaaga h stop fucking material and nonsense things😡😡😡😡", "bhosalerahul763": "Dia Mirza tu Sabki nazar me gir gayi hai..aur bhatak gayi hai..aur bhatke hue ko aur bhatka rahi ho..pehle khud to jaan lo NRC aur CAB hai kya..", "sabbirneki": "As expected from you 🤝. Great stuff", "yashwanth.official": "Hindusthan se azadi zarur milegi 🙏", "kimi_vash_jacklope": "Yea no to Bollywood z vulgar item dancers too", "ruchisudan25": "😍😍thnx dia atleast koi celeb toh hai jo bol rahi hai proud of tapsee u and sushant..akshay kumar pe to sharam aati hai aftr seeing his post", "alishan_yaqub": "❤️❤️❤️❤️❤️", "roosbalek": "💕💕💕💕💕👌👌👌👌👌👌", "pankkaj.arora": "Government won't need even a single document from you to decide if you're the citizen of India or not. Only phone number can decide your identity. Phone number Integration is capable to validate your citizenship. Phone number -> Aadhar Card Phone number -> Bank Account Phone number -> Driving License Phone number -> Car Registration & Insurance Phone number -> PAN Card -> Tax Information Phone number -> Employer -> PF Account Phone number -> Passport Phone number -> Visa application", "naush289": "Thank you dia .. we need more people like you... This shows how are you at your heart .. thanks alot for supporting", "niravliya": "Shame on you", "ajit_ch": "I support NRC & CAA", "choenyi1268": "Thank you for supporting these voices!", "gurfatehsingharora": "👌👌🔥👍", "ladyfrownalot": "Thanks for having and showing spine! Thanks, really.", "devvvrat007": "What is to do with CAA along with NRC Dia don’t misguide people! First read the bill which has to nothing to do with present Citizen of India it specifies that people who came before 2014 from neighbouring countries( Pakistan/Afghanistan/Bangladesh) they will get citizenship", "tee_s_g": "@poonam.sangha pls see", "mollenmist23": "Keep up these work", "hemangi_mak06": "🙌", "hasinfatima38": "We r against CAA+NCR", "pulkit927": "Paheli fursat mein nikal", "sameerprabhu123": "Diyaji, we respect u a lot. However, please see the response to your post. More than 90% of educated( this word is important) have wholeheartedly supported both the bills. The whole of India has seen that Several protestors across multiple locations in india are not having any clue whatsoever for what they are protesting.", "bhawna.bhatt.feelings": "👍❤", "arups_zone": "We support CAB... We support NRC", "ravithakur3575": "Bakwas mat kar", "cel.rizvi111": "Rise above nationalism and hindu muslim card played for petty gains by these politician dont be pawn rise shine awake protect nation above religion", "naresh.polasa": "We support bjp and voters support bjp", "robertrralte": "Its good oppose to the CAB AND ALL👍", "naheedali26": "No NRC+CAA", "vaibhav_kadam_96k": "🙌🙏", "pixie._dustt": "musl(I)mhi(N)dubu(D)dhists(I)khchristi(A)n!!!#peace#indiaagainstcab", "hashmi.shahnawaz": "🌼", "suneelkumar552": "Say No Why?", "padmakar.25": "https://www.google.com/amp/s/www.thehindu.com/news/international/No-Hindus-will-be-left-in-Bangladesh-after-30-years-professor/article16675228.ece/amp/", "_sagargaonkar_": "True indian will support NRC+CAA as i do 🇮🇳", "iqbal89in": "Dosto lage raho kamyabi zaroor milegi himmat na harna, mai apke sath hu", "nck.india": "Stop being an idiot....atleast give it a read before protesting", "bristy___fatema": "👏👏👏👏👏", "ajitpandey0086": "We fully stand in support of CAB n NRC. Islamic mentality will never be allowed in this country. This country believes in country law not in SHARIA.", "arshit_thakur.bunty": "We support CAB+NRC🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳 🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳", "kushal_5678": "We support CAB", "shorya_aditya": "What will you say when the same protest takes place on population amendment bill?", "mannanzafarkhan": "👏👏🙏🙏🙏🙏", "ashusirohi": "Diya r u beleive that NRC + CAA is not gud for India... Or did this impact any of Existing citizen of India... Which includes any caste... Plz answer did u against of this bill or in support of this...", "khan_sahab146": "❤️👏", "tanyasubramanian": "#IndiaAgainstCAA 🙌🏽", "d.naresh1": "Peaceful thought that a broad mind nothing upen situation reasonable moment don't worry", "isashasharma": "Saying YES to NRC + CAA", "deepak_vi": "😂😂😂😂😂 not all Mumbai Kar against CAB and NRC only paid are against.", "jyotik079": "Molana sarkar", "topplehartuni": "#IndiaagainstCAA", "leostar.24": "Bollywood sucks", "atinshabhargava": "♥️♥️♥️♥️", "puffbunnyj": "💙💙", "khatri_jass": "❤️❤️❤️", "fariharehman": "👏👏👏", "sachin3050": "@padmakar.singh10", "mohammedwaseem216": "How generously you are taking stand against evil mockery in the society being an celebrity and rising your voice against it great ❤️❤️🔥🔥", "logical._.memer": "We support CAA🇮🇳", "nilesh_new": "Bohot kam log hai...", "akhil_singh_rajput": "Bhtke hue log", "sabinamahmed": "💜💜💜💜🙌🏼🙌🏼🙌🏼🙌🏼", "yogesh_____2212": "Big fan @diamirzaoffcial", "sushie1990": "Yes! Sharing this !!", "kunjan_._parmar": "😍👌🏻", "anandrao434": "😍😍😍😍", "iam_arpit27": "You hav lost your mind completely"}