{"luchylua": "The lawlessness present in this country scares the hell out of me! I am sick and tired of what I see and hear everyday! This is just too sad", "cjidoko": "People attain wealth and power and use it for selfish interests and our citizens are helpless. This is a reality even in my hometown in Enugu state", "shantamlevel": "Jezzz I m really upset right now. How could d philanthropist do such. Some ppl are heartless", "freaky_nenye": "The injustice in this country is disheartening. Why should a civilian forcefully collect a lawyer's phone? Why should innoncent people be arrested inside a court? This is a slap on the country's face, this is a mockery of justice, It high time Nigeria defends herself and her citizens. Justice must be seen.", "v_jadran": "🙏💛💚✊", "wallflowaar": "Wow! God please help our country Nigeria break free of corruption and all its ills😢🙏🏾", "miss_udeee": "Amen 🙏 peace will definitely prevail", "ebeleeliora": "But ABBA people have been fighting Ukwulu people for years now over land that does not belong to them. Land that is even nowhere close to their town on the other side of the road. ABBA people and dragging land?? Even after Ukwulu won in the highest courts of law ABBA refused to remove their signpost from our junction. My people if you know how far ABBA is from Ukwulu junction you would shudder from seeing their big welcome to ABBA signpost right at the entrance of our hometown. People should dig deep into the root of this case for the whole truth. Sometimes people reap what they sow. Not condoning violence but let’s dig up the facts before giving the verdict.", "nnadoziechristie": "I was a witness to how n when he was searching out Abagana youths using his helicopter, even if he is a philanthropist, absolute power corrupts n could ruin the good deeds he has done.", "i_princess_bella": "It's really a pity. I'm from Umunya, so I understand.", "team_a.h.y": "@chimamanda_adichie I’m a Nigerian from the North that’s always admired your work.....This video showed how divided, bullied and voiceless we are due to the injustice that has always veiled the country as a whole....It’s depressing to see how our country looks like a sinking ship😭....but I pray someday Justice reigns. 🙏🏽"}