{"mrs.okolo": "@ubakaubaneze", "montserita": "I adore this woman. I think she is such a great inspiration in this much needed World of ours!! Thank you Chimamanda!!", "kach_kachi": "If the is any lady I would listen too with all attention after my mum, that's would be chimamanda - she's just a super role model with super brain and intelligence..", "arthur.rpds": "Brazil's population is facing a hard political era. And unfortunately, due to this weird kind of morality based on clothes, sexuality n etc. Feels like Half of the population is fighting for equality and freedom of speech, and the other half wants to turn Brazil into a dictatorship ruled by religion.", "4soul.luv": "Chimamanda for president 👏", "pharm_weird": "@chimamanda_adichie ,I've grown up loving you and you still haven't stopped being cool", "olufunmibiolajide": "I stan! Morality in terms of honesty, compassion and truth-telling. Character!", "mbonu19": "❤️❤️❤️", "amberina": "Fabulous. Thank you.", "ifuna_nya": "👏👏👏👏👏👏 I Love you Ma.", "favour_jesus": "Correct... Love u maaam", "obochifrank": "See why I love this lady???", "smilingprecy": "Ma, I love you ❤️", "carla___pena": "@israel__campos__", "alanchinnie": "Crush😍😍😍😍", "kirigo_mucina": "@paulinemunene", "limabotelho": "❤️", "obi_matthews": "Whew 🙌 Truth. Gospel truth!❤️👌🏼", "edio_moudosen": "Yes ma'am", "abikekeron": "❤️❤️", "sofiamaame": "@olamide.iyanda !", "cali_chick_inhtown": "💗", "a_girl_called_oge": "❤️❤️❤️❤️❤️❤️TRUTH!!!!!!!!!", "blueaprils4": "Oh yes! @ifeanyijackpot @edmundzlizzy @chukwuezugooranu", "obokongwu": "Honesty, compassion, kindness, and truth-telling!! Qualities that people should really be focusing on.", "mskhalishaa": "👏🏽 well defined!! 💯", "ogwasim": "Why wasn't I there? This is painful. I know I'll watch you talk in person someday.", "tightsonbikes": "Chimamanda, you both make me laugh where it's necessary and feel hope for the future in your words. I truly believe change can occur through education and open-mindedness!", "angieefu": "I can't stop loving you ma", "nnedidede": "I don't agree.", "houseofcanice": "M. O .R .A .L .I .T.Y.......", "boomsleek": "See why I love you💓💓💞", "lan_lah_ondgram": "I love you like die!🤩😘, I love the way you boldy speak your mind, inspiring!🤩🤩😘", "s_okoroafor": "@iamfranklinn", "myyownnlane": "🙌🏾", "presh_stylist": "If only every one will listen to this ❤️", "afromerikim": "👏🏿👏🏿👏🏿👏🏿", "charlyjunior01": "Every issue should be taking holistically, half truth is no truth", "thisisdamilola": "True talk", "kaayin___": "💙💙 I can listen to you speak all day 😍", "praiseobata": "truth", "rexygreen": "So true❤❤❤❤", "laurapepple": "Love listening to you 🖤", "danyelsizuchukwu": "I love this Adichie woman so much, it hurts 😩", "latifah__aj": "God bless you ma. I actually wasn't aware that you'll be at my school. Thank you for posting this video. May God bless you. You're such a blessing", "gabriela.gabz": "Yes 👍🏾", "bayo.adeniyi_": "To buttress the point made by @_____.evelyn. That's the point where the audience claps. However we need to sometimes critically engage our mentors. Not just take everything that say on surface value because it justifies what we want to hear. The speaker herself whom I adore is not shabbily dressed for the occasion. So we don't just misinterpret her intentions or give her words some kind of totalitarian authority which of course she has earned as a woman and a scholar. These days everything is debatable What is decent? By whose standards, in what culture or context? We should be reflexive and conscious of these complexities so we don't end up suffering from what Onoge calls \" crisis of consciousness\". We [listeners/readers] as well as [scholars/speakers] should also understand and identify our own biases as seen in Brettel's book title \"when they read what we write\".", "isahhall": "Woman!! You're so powerful and inspiring. I love and admire you a lot ❤️", "valerieeguavoen": "Yes! Reviving the moral imperative in our public discourse! I would love to share more about the work of @brepairers with you!", "mayrestored": "Politely blunt; look away 😀", "sue0513o": "Is the whole video posted somewhere", "amarakyna": "Yes @chimamanda_adichie", "nkem_vee": "@chimamanda_adichie 💜", "natcurrea": "Love foreva!!!!!🖤", "kudygold": "❤️❤️❤️❤️", "robinson_max.23": "@__meeldred the thing she said about clothing and morality just reminded me of you 😂😂", "smile.giver": "We underestimate the power of compassion and honesty. It's easily shuu'ed at. But Ladies and Gentlemen, those are the necessities for a kinder and peaceful world.", "x_kwizit": "I appreciate the clarification on what morality is really about! Too often we are focused on the mundanes while things of real substance and value are relegated...merci Manda!", "rhoda_babs": "Four years, I was in Unilag! Four years! I leave and now you visit? 😥😫😫😭😭😭😭", "prof.carolvalente": "Great", "davydpatrick": "COME TO FUTO 😭😭😭", "iamkimlaneclark": "Yes! 🙌🏽", "bukii_o": "yesss 👏👏", "op_poetry": "Morality is not really about clothing,but when it comes to church let's have some decency. I don't think wearing a miniskirt in church its being modest, I'm not exemplifying what women must wear but really a woman at the forefront seat with a mini? that's bad! Clothing is a matter between culture and traditions and it is not universal.So its really about how you culture and tradition views morality in terms of how decent is decency,but from a standpoint of African culture it's hard to get along with miniskirts", "naythan_naythan_": "Ma why don't you reply ppl that need your advice @chimamanda_adichie", "natalia_dsleite": "♥️", "closetqueen_empire": "Please ma'am come to Ph. You're just a rare gem💎", "melanieempress": "Happy Mother's day mama😍😍😍😍😍", "usenunyime": "👏👏👏👏👏👏", "bio_nation": "Super intelligent woman👏", "patyemydio": "My inspiration😍😍👏👏", "shackletonalfred": "https://youtu.be/Jle_HdHPPnY", "_____.evelyn": "I agree with everything you are saying and I would like you to also reconsider your approach to defining what morality is. We cannot fully define morality without touching on everything! Telling young women that “morality should not have anything to do with clothing” will only breed more one-sided “wokeness which is already the bane of modern Nigerian society - peep how they are in accord with that particular statement which will now serve as their next “excuse” to wear a mini skirt to prove the point. Dress deliberately and in a way that communicates your personality, add honesty, compassion and truth-telling...like that like that! 💕", "claudiamooz5": "👏🏻💪🏻👍🏻", "achal_ugo": "This has always been my opinion about morality,the ‘born agains’ think they are holy just by being critical of those who where trousers, we have a long way to go as a society.", "damola_kayode": "Please loud it!!! If don't like what someone is wearing look away.✨✨", "pjruskie": "Chimamanda! This is what it means to a cool woman. Will show my daughter every word that has come out of your mouth. MVP.👍👏👍", "theecloudwalker": "Iconnnnnnnnn⚡️⚡️⚡️⚡️", "slicksooks": "Chimamanda 2020 y’all", "i_am_kosi6090": "Still trying to digest the \"not judging the mini skirt\" part...... Thumbs up to every other thing said. BTW, who else noticed the difference between Mrs Chimamanda's foreign speeches and this one?", "gabimonteir": "Best regards from Brazil! Love your books and your speeches! You’re an inspiring woman!🧡", "denengethefirst": "This!!!! ✨🔥✊🏾🔥✨", "chy_vander": "Happy mom's day CNA! You will forever be remembered for bringing revolution to African women...God bless you", "vanessa_kanma": "👏👏👏👏👏👏👏👍👍👍👍thank you my princess", "zippiekn": "You inspire me ❤️", "stasia_philips_": "I love this.", "pritynita": "👌", "lebeneh1": "Oh how I love listening to this lady😁", "nicole_agb": "👏👏👏", "cyndubs": "Dropping wisdom as always 🙌🏽", "myabelle2002": "When a girl wears a miniskirt to church she’s judged more than when a corrupt/lying/murderous/rapist politician sitting right across from her.", "stephswallet": "Currently rereading Americanah because I can’t get enough of your writing ❤️", "debbieadaobi": "@hanzo_musashi why I love this woman!", "mari_zano": "Truth🙌", "faria__h": "👑👑👑", "i_am_vickthor": "Period! 🗣🗣🗣🗣", "_olaedo": "Happy Mother’s Day my mummy ❤️", "formanowiczclara": "You are amazing", "riotgrrrrly": "So many religious look outward and judge others, find someone who (they believe) behaves worse than they do. The thought of “well at least I don’t...” helps them justify their poor choices.", "tha_melanin_goddess": "🙌🏽🙌🏽✊🏽✊🏽", "dewycleaningreagents": "I love you so much", "oc.ee": "this is why I love you 💕", "sommie007": "Preach!!!", "thestyleinfidel": "A queen", "hvnkk": "👑👑👑", "christmysaviour003": "Muse ❤", "hle_juta": "We need such conversations on a daily basis👏", "milasueiro": "❤️", "glorykinah": "Preach ma'am", "tolafidler": "👑", "fyyzyy": "👏👏👏👏", "angella2llsplease": "I could listen to you speak all daaay", "renaesimo": "🙌🏽🙌🏽", "weirdfishj": "I love you ❤️❤️❤️", "veryblackfeminist": "😂😂😂😂❤❤❤❤", "leilaestreladelima": "Amazing!!😃", "i_lotanna_": "\"Morality, in terms honesty, compassion and truth-telling\"", "geneadu": "👏🏾👏🏾👏🏾"}