{"aprilqueen419": "Thank you for the acknowledgement!", "nankyalilacy": "How sad it is... Let the black Americans start coming to Africa. There's no need to stay in such hostile environments", "suindarass": "I'm amazed by your writing and by your strength. I'm a Brazilian and over here we're really oblivious about our roots, but something inside me keeps taking me back to my forgotten ancestors. Last month I've discovered by a DNA test that almost 20% of my blood is Nigerian, by that time I was just reading your book The Thing Around Your Neck. Your tales, especially the last one, took me back to a sense of belonging I've never met and for that I thank you so much!", "just_bym": "Prêach more , amen", "phankaralovers": "Love you mama🙌❤️", "alexadams757": "First-class!", "livemore_internetagentur": "Das ist fantastisch!", "rsbraga": "@gab.alima segue aqui também 😍", "eejoma": "Articulate, poised and informed as ever 🖤", "ebyoligboh": "And this is why I love her. She is enlightened and eloquent @emekaanyadubalu 👌🏾 A true Igbo Queen. I’m proud of her 🙏🏾", "shanhigg03": "This is significant", "temalam14": "👑👑👑❤️❤️❤️❤️✊🏿✊🏿✊🏿✊🏿", "nonny_dines": "Within our regions there are still tribalism everywhere I think its same everywhere, discriminations in every corner of the world even in families", "florencenkachi": "You're simply the best", "naomeeie_love": "Love you to the moon and back ❤", "stylerunsdeep": "This should shake every human being to their core. But I know the truth: it won’t.", "toni.ram0s": "This is amazing 👏🏾👏🏾👏🏾👏🏾", "world_of_unconditional": "💚", "e.joy_amagada": "Powerful👍", "kachikenneth26": "👏👏👏👏👏😢", "vera_panama": "@lialdina_hair_trancas_penteado não vamos comemorar mês da consciência negra. Vamos a problematizar", "fumiekeh": "😍😍😍😍 I love that you're courageous. I love that you are sincere about issues. I admire your strength ma'am. You inspire me @chimamanda_adichie", "iamher1908": "This is why I love you in all of your awesomeness @chimamanda_adichie", "drumisa": "I just cannot stop listening to your videos. You don’t only inspire me as a young man but you challenge me to strive for excellence in difficult situations", "pelczarska_1": "It’s 21 century and people still can’t understand that everyone is equal... i can’t understand how could they be so cruel to one another... @chimamanda_adichie you’re an amazing woman and i hope you’d change someones perspective ❤️🔥", "deborahcardosoribas": "One of my favourites speaches!", "joimariewrites\nVerified": "Verified", "daesal_ray": "👏🏾👏🏾👏🏾👏🏾👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏾👏🏾👏🏾👏👏👏", "dear_awards": "So proud of you", "omokehinde_o": "🖤", "eyeamkyri": "i aspire to be like you in so many ways when i grow up. my FAVORITE novelist/public speaker and role model.", "am_ajoke": "@chimamanda_adichie I saw the movie \"The Hate You Give\" this morning, and for hours later my heart was palpitating. It's terrifying to know that these things actually happened, and are still happening to black persons all over the world I'm a country that boasts of embracing diversity. I am not black, until I enter your country. I just want to ask white people, exactly what did we do to offend you?", "motolathedressmaker": "@chakabars", "mandaalinhares": "I adore your speaking and your words. Amazing 👏🏻", "tarunspandit": "#mostpowerfulperson", "yo_fhay": "I love you Ma", "alanchinnie": "Role Model❤❤💃💃", "watkinslavetta": "Hmm that’s true Other black people in different country don’t understand the African American strength and struggles however she is on the outside so she has not seen or celebrations or our demise so this is a bold statement but I need her to spend more time with different black people in the US not just New York, DC, or California", "i_am___ella": "Nice one Ma @chimamanda_adichie", "jushoney78": "👏🏾👏🏾👏🏾❤️", "house_of_mucha": "The day that white people realise that they are equal to black people maybe, just maybe the world will be a better place. This is why I’m going to teach my child black history at home because nobody will do that. We cn only allow our selves to suffer if we don’t know our history and purpose here on earth! Slavery isn’t that long ago really and black Americans of all folk should cherish their fellow Africans to embrace the different struggles that both have faced in the diaspora. Our roots matter more. Let’s conquer together ✊🏽✊🏽✊🏽", "455ify": "👏 👏", "ekazsignatures": "I wish you can do this and more for Nigeria and Africans In Africa 🙏🏿 @chimamanda_adichie", "sugarymama18": "Chimamanda, you continue to educate through your words and share your knowledge with the world. You use your platform for so much good. You are a beautiful soul whom I never tire of listening to 💕", "ezelawful": "❤️❤️❤️", "jerry_godleads": "Africans need to evolve. We need to take our place at the top! Even world atlas shows how well positioned Africa is. We need to be the centre of the world as God has placed us. But how do we do this? #Everymonthisblackhistorymonth❤️❤️❤️❤️❤️❤️", "outstandinganita": "So heartbreaking", "pretinhasleitoras": "Love you, @chimamanda_adichie ❤️", "jessmycupoftea": "@benjamin_shawww love her💕", "mofolasayoadeniyi": "It's a day closer to meeting you Ms. Adichie. There are so many mind boggling questions that only you can answer.👏👏👏👏", "nksdesign": "So true! Thank you 🙏.", "mashunyashel": "💔", "heymama001": "I agree every month is black history month. Damn every day is black history day 🥰🥰🥰", "ladylove.1970": "@noluv4em @layers_of_cash", "unesi_official": "........", "prettyandpolysci": "Is the rest of this speech publicly available?", "bohemian_char": "You are ENDLESSLY POWERFUL ❤️ Continue to bring us light and love; we need you.", "msfallonlaine": "🌹👏🏾", "solongmaryann": "❤️", "kevwesharon5": "The voice for the voiceless", "amakz007": "Good going @chimamanda_adichie. As Africans, we'll continue to strive to ensure that our voices are heard and our race never obliterated.👏🙌😘", "realben.c": "Your voice is our voice @chimamanda_adichie, all must not be swept under the carpet. Thank you beloved sis.", "i_lotanna_": "You are Everything anyone should ever dream of becoming... When I listen to you, I feel I need not speak again, cause over and again, you've said it all... And this 'fight' would linger on, our voices would be heard, and \"the world would not remain silent, while we suffer\"... I love you dear CNA❤️💪💪😍... #blackmagic", "bookednrunning": "Thank you 💛", "tiffiea": "As a black and American woman, I couldn’t agree more. Thank you for using your platform to speak for those like myself. 💗", "sharon.nakawungu": "Appreciated ✊🏿✊🏿", "priscystylesz": "I love your dress @chimamanda_adichie", "nisola_martins": "I'm still struggling with the notion that there's still safety in the world.I come into my home, I see favoritism . I go outside my home and I see tribalism staring me hard in the face and I leave my country and racism awaits me. I'm also trying to look at it from the white's angle, is it truly the hate we give or show to them that would warrant them to actually have a negative perception of us leading to how they mistreat us. Truth is, there's no excuse to how we've been considered and treated lower than them. They kill us all the time without justice, they harm us by introducing harmful substances and we always fall for their trap, we buy these things,get addicted to them causing us to misbehave in the society and at the end is jail. All these proving the point they created. Our voice, our opinion, our will is the strongest we have now. There's so much talking and fruitless protest. When do we truly gain our freedom because even in liberty, we are still wrapped up in the chains of slavery.", "sandylaborde": "❤️❤️❤️", "chekwube.collections": "My Madam🙌", "nneky_gem03": "I love you for always speaking your truths on issues that matter❤️❤️", "peachdiaryy": "🙌🏾🙌🏾🙌🏾🙌🏾", "werkingwitwisdom": "It feels great to be heard, to be seen, identified and understood. Auntie, thank you. Thanks a lot ❤️🤞🏾", "blessedandablessing": "❤️", "biblio.becca": "Yes. Yes. Yes. Yes.", "phumlacorlett": "Where can find the full speech please🙏🏾", "djaza___": "💙💙💙 speak mummy", "africanchique": "@chimnonzo", "marvel_lee23": "Role model❤️❤️", "pamchude": "👏😍", "lillian.313": "🙌🏾", "tofigart": "👍👏", "sabrina.j.persaud": "✨❤️🙌🏾✨", "dr.tamikalett": "👏🏾👏🏾", "la.maestra.lindsay": "❤️❤️❤️❤️❤️❤️", "alvan_oti": "I love you diversity and paradigm of thought. I’m proud of you.", "ja_ni_pha": "Love her", "gladys.maloney27": "Write a book", "ojusystech": "Your hashtag captures it all. Thanks for being strong", "catimum": "🔥", "tchoks02": "Always 🙏🏽🙏🏽🙏🏽", "iamkimlaneclark": "🙌🏽🙌🏽🙌🏽🙌🏽Yes thank you so much for saying this", "joaokorreia": "💕💕💕💕💕💕", "ayaannina": "Their resilience is out of this world.", "pwettyamanda": "Looking at you makes me so proud of being an African woman. . My desire is to sit and interact with you someday. You are the voice of the voiceless.", "mrscouragesylvia": "I love you very much @chimamanda_adichie ! Continue to represent us. I tap into it for my daughters 🙏🙏", "oliviahouz": "What can we do without your fight 💯💯", "tianie224": "@ti_clau1", "jennyfierce007": "We are getting there! Slowly but surely!", "connienyc1": "My woman crush😍😍", "officialgraceenna": "This dress is so cute", "mehdi_baghdad\nVerified": "Verified", "kodiio": "#everymonthisblackhistorymonth", "miss.paim": "I love this auntie. Preach auntie, educate all of us.", "habibat_ore": "Hate is so blinding and delusional to the point where shame isn’t enough to encourage change hmm.", "preciousakachukwu": "Legend", "bjustin1010": "Igbo kwenu!!! I wish you could in audiences like this one about the Igbo people and the realisation of Biafra just like the Jews everywhere in earth with authorities like yours speak for Israel .👏🏽👏🏽👏🏽👏🏽 Ya gaziere gi", "shineillustration": "👏👏", "codemerchant": "How do I get the full speech?", "tennbensays": "💜💜💜💜💜💜", "mmaolisa": "Talk 👏🏾 about 👏🏾 it 👏🏾", "ajuwasinla_aps": "I just love u", "iammissrobin": "Sigh....Thank you, I will fold this into my next syllabus-if I can find the entire speech. 😌", "africanstar": "Talk, Lady! People tend to forget. ❤️", "da_fashion_artist": "🙌🙌🏿", "coolejjy": "Always super proud of @chimamanda_adichie", "sommy_kays": "I love you,my role model", "enterprisingwomennigeria": "The African American history will be told eventually by the African Americans themselves. Reading Becoming Michelle Obama helped me glean some. And I have even more respect not just for their grit but their resilience. After the war - they were totally disenfranchised. Loans, grants and land were given to given to European migrants and the policy didn’t favor the negroes... yet they rise!", "thislittleliteofmine": "❤️❤️", "sandrakingz_da_mayor": "That voice of our time! 🙌😍🙏", "pivotalxm": "A legend 🙌🏽🙌🏽", "chrisrevelard": "👏🏽 Such an icon", "thewumanbrand": "Just reading the thing around your neck now and saw this post.Keep up the great work,Ngozi Adichie.Your mind is a blessing.", "armenia.oba": "🖤", "pbgerson": "I’m excited my daughter is graduating from college in two days, even more excited you will be speaking. Your words are so powerful.", "joannytee": "@__dollface__ @blessedsalisu", "iamishena": "So happy to see this. If people of African descent around the world got together to support each other in the different countries, respect each other’s histories, acknowledge the similarities and differences, came together...we would be unstoppable. Right now we are still divided among ourselves, so I’m so happy to see someone like yourself speaking up for our African American brothers and sisters. We are one.", "udokajane_": "Unfortunately all the things you mentioned still does indirectly exist, especially at work places. It breaks my heart to hear stories like this. When you hear directly from those who experienced it, you will understand why most of them are the way they are. However, you don't have to be defined by the way you were treated.", "callmechinazor": "You are my model when its comes to literary accomplishment @chimamanda_adichie 😘💕🌹", "mslavie": "You are awesome..thanx for speaking our truth. #everymonthisblackhistorymonth 💪🏾😍😍👏🏾👏🏾", "magnumarts": "The reading for Americanah is on repeat on my phone!", "hype_afro": "True African Warrior!", "lebogangm98": "❤️ oh black child.... unapologetically African❤️", "fiesta02": "Please come to Australia @chimamanda_adichie", "sg.beneteau": "👍So inspiring", "in_can_descent1": "💯🙌🏽👏🏽", "ogo_bekee": "We need to keep talking 👏", "finest_de_poet": "I love you @chimamanda_adichie 🔥❤️", "p_joush": "As Africans we need to understands the history of black Americans more and study the systematic racism that still exist. Thanks for this Queen😘", "losikawrites": "You are amazing.. ❤️😊", "chanelle_milandou": "👏🏾👏🏾👏🏾", "prosperelle.ventures": "Lovely hashtag 👍#everymonthisblackhistorymonth", "abstractintuition": "🚨🚨🚨🚨🚨🚨", "iam_marisgold": "👏👏", "austinobama1": "This is very true. Borrowing from the latter works of Malcom X, African Americans needs connect their struggles with that of non- African American, living the US and those in the motherland. Our struggles intersect more than we choose to see.", "juliemarie.___": "@misader olha!! Acho q foi nesse q vc tava presente!!", "lalalaudino": "I LOVE YOU.😍😍😍", "chisokingso": "The power of History is inevitable.", "enitanlagos": "Only Queen I Stan 👑", "vivi.c.santos": "@casadoblack", "i_am_vickthor": "🙌🏿🙌🏿🙌🏿🙌🏿🙌🏿", "thicopera": "Amazing speech", "luciana_zingareli": "@quebrandootabu", "myyownnlane": "This is why you are the best! Your insight is second to none. The way in which you articulate facts is truly a gift, and you use it so well. You are an educator! I would love ya nothing more than to sit with you and listen to you speak. 🙌🏾", "mahinge": "😭😭😭😭😭😭😭😭😭😭😭😭 It’s painful", "e.b.i.n.y.u.n": "Indeed #everymonthisblackhistorymonth AFRICA❤️", "jonesmachadobr": "👏", "seunshitta_art": "Did a drawing of you @chimamanda_adichie Kindly check my page. Much love!❤️❤️❤️", "glowiey": "When will we start acting😭😭 the talk is getting too much, we have to do something for a change", "cheeoma_abiakam": "I really do like the way you speak, clear and coherent. And I love the fact that you speak the truth regardless.", "ellenjoanp": "As a person who is not African American, I too am amazed (but also devastated and ashamed) by the history and tenacity of my fellow Americans. Power to the people.", "jibrilsado": "I'm always proud of the depth of knowledge and the wisdom you bring to the table. You are a true thought leader forever lifting the grey spots from the world's blotted lines of history. 💙❤💙", "browngirlreading": "❤️", "newday2shine": "You are an inspiration! ❤️", "iam_elsyy": "Your insight articulation of fact is amazing. Most confident voice of the voiceless.❤️❤️❤️", "ladeluve": "😥", "obi_matthews": "I stan!!! 🙌🙌 Your opinions are truly reflective of a whole continent! Your voice matters ❤️", "oluwa.busola": "Exactly! we need more than a month to celebrate the beautiful black gems that we are because our daily struggles still continue as blacks so, Definitely everyday!!! #everydayisblackhistoryday", "beingadanna": "I Stan 🙌🏽", "lereineyaume": "Perfect", "amos.ogunleye": "The world and it people are not yet wise to see the beauty of stunning nature", "kingjordanabiola": "❤️", "maevafafa": "😍😍😍", "noble_murtala": "🇳🇬🇳🇬", "nanacady": "Auntie speaks 💕💕", "kokolokidss": "Such a strong woman", "pwrempreendedoras": "You're amazing! 👏👏👏", "sakani__": "Momma 😍😍😍😍 I love you", "khumbs_c": "@kellogz29 this woman never ceases to amaze me", "peace_olorunyomi": "Role model❤❤", "jordanolucut": "👸🙌🏻", "jai_naba": "Rihanna fans are asking for new music. @chimamanda_adichie we need new books pleassssseeeee ❤️❤️❤️", "liviasousadacosta": "Unncub gi ....bki.9kyh", "kachyfrank_photography": "That glamorous wedding and events cannot be complete without the memory that goes with it..Book the professionals in photography+cinematography today lets help create a lasting memory for you...Visit our page on IG/FB @Kachyfrank_photography and be rest assured❤️❤️", "ofonime.udoh": "This is why I say African Americans should succeed by all means as a form of living above their oppressors and fight racism with dignity and not give them gas to burn them with, with all the black on black killing, selling crack by the corner, and all the negative things they are known for! Rise above the hate go to school black are smarter and can do anything they put their mind to", "shams_of_tabrizz": "💯🔥🔥", "chiedz_a": "I can't wait for the day blacks/Africans dominate (ps. I'm not racist). But some of the treatment truly is unreal and in the modern day it's done with a smile. Africans have such good warm hearts n have been hardened in harsh \"white\" environments. Love this lady❤️💛", "p_aganbi": "Speak Sister! ✊🏽", "girluplosangeles": "Hashtag 💯", "anaritaviaggia": "🔝♥️👏🏾🙏🏾", "_coelhomayara": "@janecori", "veryblackfeminist": "Well-said", "amazon_lilly": "I just watched a movie titled 'Detroit' about the Algier Motel killings of 1967 in Detroit.. What really amazes me is how close these events happened like some 52yrs back🤷🏻.. That is to say some of the perpetrators of this racism shit are still alive🤦🏻and I can bet they still feel superior in their minds", "43naturalchick": "🔊🔊🔊🔊🔊🔊", "a_babe01": "I love u soo muchh... Check ur dm", "houseofcanice": "😘😘", "lebeneh1": "Golden✨✨✨", "ucheartgallery": "We celebrate you", "beforeyouiwas": "I wish African Americans wished to be as informed concerned and acquainted with the actual struggles of non American black people the way we are about them and their struggles.", "londilenkambs": "Sad truth 😞", "goalexb": "I love you and I thank you!!!", "j_narelle": "A queen ❤️", "redbushwillow": "@chimamanda_adichie For how long shall we be amazed? Amazed by the facts that have been evident kubva kudhara (from long time). At what phase of our consciousness will the brown people start implementing solutions and contingencies? Tokumbira permission to be viewed as human beings? Why do we still complain and get hurt by the obvious? When will we start re-building ourselves as the Asians have done (they too were an oppressed people). When will the \"black\" narrative be decisive in evolving? Why do we continue to be amazed by the pattern on the skins of reptiles when we can use it to make belts? When will the story of our evolution be written if we keep expecting dignity from evidently murderous folk???", "mariettevalsan": "What a woman 🔥", "____janelovesjane": "Great", "febelz_suave": "You're inspiring", "kulture_illustrator": "❤️", "banaskoart": "This speech holds a mirror to European-Americans, to see their barbarism. #EveryMonthIsBlackHistoryMonth #MelaninGoddessMagic", "oyin_wola": "❤️❤️", "eugenejusticenwachukwu": "Hoping to see you one day", "andreabordeaux\nVerified": "Verified", "theintellectualwomen": "Phenomenal woman🙌", "ada_ejiejemba": "❤❤ My Woman Crush", "victorvictor9950": "Gosh.?u mean all these words spoken by you . Really took place in America", "queenethobetta": "I admire you", "360mums": "❤️❤️❤️❤️❤️ Super amazing woman", "deji_07": "💪🏾💪🏾", "dcookie8": "Speak", "ogeiheanacho": "👍🏾🙋🏾😘", "frank.lonewolf": "💕", "funnybliss23": "❤", "louise__ford": "💙", "mandyrachael": "❣️❣️❣️❣️", "am_sharonshazzy": "Nice one", "shexmiemah": "👏🏽👏🏽💛", "mrsexyuzzi101": "How sad... the devil is by no doubt a white filled with hateful thoughts.", "dearbrothamalcolm": "💜", "o_n_y_i_n_y_e": "Role Model 💯", "lenora___": "🙌🏾", "chizzi18": "You are a Queen !", "jeciespaze": "Yes pls. We know all this and it sucks", "ejioforsamson": "Eze nwanyi 👑", "winifredahupa": "Yasss Queen❤️", "afropaixao": "She make me proud to call My self a woman , particularly African woman.. ❤️", "thelady.sek": "Profound!", "kiluandamusic": "@noreturntozer0", "ijeomaokwuokei": "love youuuuuu", "akinyi.ongeso": "This is truly significant ! That as an African we begin to understand and interact with the African American experience from an informed perspective- not Hollywood 🙄 For far too long we have been separated by superficial ideas of superiority; between us- yet we are one, by stereotypes perpetuated through media - that create the most ridiculous images of African an African Americans. Chimamanda, I don't if you know how important your role is.", "shabackk": "Forever Icon", "__ojiugo__": "💔", "thobeka_thobza_sibiya": "Every month is African history month ❤️", "micpaiva": "@morcego.vinicius ouça a palavra da deusa.", "henrietta_ndosse": "The voice of the voiceless. I forever stand 🙌", "tenyin___": "✨✨✨ You're an icon and forever will be one!! Thank you for being a teacher to me💯", "lyndadozie": "Wow", "revolusegunalalade": "Beautiful. Great woman. Great inspiration you are", "obinnaoji": "@coko_4th just so you remember. 😁", "camarachi2": "Words on marble @chimamanda_adichie . Truely an ICON", "isabellachygo": "❤️🔥🔥🔥🔥🔥", "marchiamands": "Goddess", "amyoforreal": "💗💗💗", "chrissypooh0115": "Yasssss to all this!! That dress is amazing @chimamanda_adichie", "elzafifthbeauty": "❤️❤️❤️", "1stmissladii": "They are still throwing bricks at our children! Just in the form of educational policy...", "myquietlilworld": "❤️👏🏽", "plushytimmy": "Superwoman ❤️❤️❤️🙌🙌🙌", "_account_deletedx": "I proud of you❤️", "ms_johap": "❤💙💙💙💙", "seekinginnerpeace11": "@shaderoom 👏👏👏🔥🔥🔥🔥🔥🔥", "nkem.uzo": "💪🏾💪🏾💪🏾💪🏾💪🏾💪🏾", "itsalim": "preach", "y_ai.98": "Yessoo 😭😭🙌🏾🙌🏾🎯🎯🎯", "nataliasalgado": "❤️", "thestyleinfidel": "A Queen 🌟", "cleopatrafigure8": "Speak it sis 💜", "teethnation": "Make your teeth whiter and fresh with our charcoal powder and paste products", "r.simone.artist": "I💓u", "bunmiomolegho": "I love you so much🙌🙌", "thelmalina": "You were in Boston? How did I not know this?!", "minoutravel": "👏🏻👏🏻👏🏻 The story of this world needs to be rewriten, we're teaching too much lies and hiding an infinity of \"details\". I really think we can't fix the problems in ours systems as long as we are standing on top of so much lies...", "ada_ubah": "😍😍😍😍😍😍", "iphie4u": "😍❤️😘", "actordonald": "Excellent", "martenverheij": "🙌🏼🙌🏼", "bykasie": "Yes 😍😍😍😍", "unclejee44": "ily", "myblacksuperhero": "🔥👌🏾💪🏾", "akunyili": "Amazing woman"}