{"somehowimnotfat": "I mean there’s nowhere to go other than to buy essentials. But I honestly try to stay outside cause it makes me happy", "pinkdeiji": "Such a cute and comfy outfit 💗", "archipelfinlandaisetnature": "Yes, doing the same 😷", "petite_and_curvy": "#lessismorewardrobe #wiwtoday #styleaddicted #inspofashion #stylesubmit #ootdblogger #stylehunters #whatimwearingnow #instastyleblogger #styleblogging #fullfigured #luxuryloungewear #curvyrevolution #curvyconfidence", "m.rafiq3801": "❤️❤️❤️❤️👌😎", "ojaswee04": "You make even pajamas look glamorous 😍", "madebyjuul": "I am in love with that sunburst mirror 😍 I got a few little ones", "leslie8989": "😍", "amberhopestyles": "To be honest we need more thab 6ft. 6ft doesn't do anything. A sneeze n cough travel over 100ft. 😔", "volkmanadventures": "Nope we disinfect groceries before putting them away also! But we’re not staying “in” per se, just staying in our area, but outside the house instead of inside! Still flattening the curve that way too 💚 Also loving how comfy your outfit looks ❤️", "janellemangiante": "Yes girl! This is the cutest set 💕", "sarahldevries": "Love the outfit! I don’t look forward to grocery shopping anymore as the stores never have what I want now! Also.. I read that disinfecting is not necessary.. it all comes down to good hand washing. Washing your hands before/after preparing food. As well as before and after eating your food. But i also read, if it makes you feel better, you can disinfect your cans, or boxes. Running water, lemon water, or vinegar water should be enough to clean fruit and veggies. If I’m going to get covid it’s going to be from my husband who works in the medical field.. so I am doing what I can, but I’m not over doing it as a lot of these cleaning products are just as harmful to our health as this virus could be.", "shechonky": "I know you’re not the only one doing that for sure! Doing my best to stay at home and staying away from everyone when I do have to venture out!", "theelegantwanderer": "Buying groceries is not fun at all! I go once a week and I do the same as you - I wipe everything. Better safe than sorry 🤔", "haitchystyle": "😍😍Love your sliders 💕", "jennypolosbrandel": "Such cuteness!", "annette090a": "I’m the same. Disinfect disinfect disinfect BUT antibacterial wipes and sprays don’t kill viruses. I do it anyway but still wash my hands after touching packaging, plastic or paper. Grocery shopping is such a mission now and a stressful one😔", "lovetotravelgirl": "I love that comfy set!", "felicia_fotography": "I know it’s so crazy what we are going through right now and I do the same thing girl I disinfect everything and I’m constantly washing my hands - I’m hoping for the light at the end of the tunnel soon", "kbgautam1958": "No other option. 🙋😊", "ushagautam1708": "❤️", "just.youraveragetraveler": "I do the same thing. I am so paranoid. I feel like I'll still be scared after we are able to go outside", "sacred_beautygirl": "Those slippers look so comfy- I might have to snag a pair!!", "verystef": "Such a cute look - the colour on you is fab ❤️", "hellotoawesomeness": "Don't worry gal, its happening with everyone"}