{"jennypolosbrandel": "You are amazing! I’m much older than you and have the same body type as you . I have throughout my whole life fought my weight, allowed it to have a relationship of worthlessness with me, even up until today. God made me and my body beautiful with curves. I strive for the beautiful peace that you have at such a young age. You’re beautiful and priceless. I appreciate your post!", "aussiebeautybychantelle": "Yoga weights and cardio are my favs!!", "amberhopestyles": "Im about to do some exercise right now too🙌", "shechonky": "We’ve been taking our pups on walks! We have a backyard so we usually don’t but it’s been good for everyone!❤️", "natavivi": "Ya I’ve been doing weights at home too - not the same as gym but good", "volkmanadventures": "We’ve mostly been walking but trying to find a way to do cardio! Exercising is a struggle for me so I have to find ways to trick myself, like walking or jogging when my dog wants to play haha.", "theelegantwanderer": "I'm not into exercising, so I mostly walk a lot. I know I need to exercise more and I wish I would love a good workout 🤷‍♀️", "kintasin.holidays": "Hi dm @kintasin_official for colab", "geenamiller": "Hi! Are these fabletics leggings? What size and style did you get?! I’m looking to buy some but in between sizes", "sarahldevries": "I love cardio. I use my treadmill mostly, but I want to use more cardio/hiit workout videos. And add in strength training.", "somehowimnotfat": "I like lifting weights the most", "felicia_fotography": "I love a good run outside my neighborhood when it’s nice out but if not that I like do a good quick HIIT workout", "simonemillers": "Definitely been working out in my basement. Feeling good about this new life 💖", "fivefootfeminine": "Work it girl! I love at home workouts!", "justmetravel": "Dancing is my all time favorite! With some outdoor biking, yoga, hiking, and paddling :) you are awesome!", "pinkdeiji": "Love this body positivity 🙌🙌", "guddumahendrasingh": "Yoga is done by opening the shoe Petite", "m.rafiq3801": "💋💋💋💋💋💋💋💋💋❤️👌😎", "just.youraveragetraveler": "I would love to lift weights again. That's my favorite", "sacred_beautygirl": "I love running to keep my body active!! ❤️", "verystef": "Ahm, I’ve yet to find it 😂", "mutyyyaaa": "I love running outside! One form of exercise a day lol", "ombirnagar": "👌👌👌", "lovetotravelgirl": "I love hitt training ! So good!", "fithoagie": "i love this message girlie and you look great 👏🏻🔥 my favorite workouts during quarantine are anything that make me get out of the house 🙌🏻", "petite_and_curvy": "#curvywoman #bodyweightworkout #bodypositivity #positiveenergy #workoutroutine #petitestyle #petitefashion #petitegirl #curvyfashion #curvyrevolution #exercisemotivation #exerciseroutine #exercising #exercisechallenge #petiteandcurvy", "ojaswee04": "Ahh I wish I was like you and loved working out. I mostly prefer jogging or running. Currently just stretching at home 💕", "ellymagpie": "functional training all the way 🤗", "bfitamazighld.us": "WOW, You look AMAZING! 💕 Btw, would love to talk to you as part of our ambassador hunt! Kindly message us tell the girls Abby sent you 💕", "stylemeshort": "Dog walking and yoga...not at the same time!!"}