{"hellotoawesomeness": "Super cute outfit!", "theelegantwanderer": "I love this! For me it's so important to stay positive & that's the best way to do it - by checking out positive stuff! 💕💕🙏", "lovetotravelgirl": "How cute are those heels!", "ojaswee04": "Omg those shoes😍", "volkmanadventures": "Totally! I’ve been organizing too 😂 The news has been really hard to hear regarding covid, but you’re definitely right, we are doing our best to prevent the spread and that’s all we can do. Love your positivity and focus on health rather than sickness 💕", "sarahldevries": "I need your whole wardbrobe! I try to continue life as usual. I obviously stay home and do my part, but I try to avoid the news and the numbers and everything as much as possible. I have major anxiety and it just doesn’t help me at all to think it. I continue to focus on my family and my beauty business! I try to also keep my feed as positive as I can, but we all have our bad days. Keep doing what you love and showing your style, because so enjoy it!", "amberhopestyles": "I think we all need a closet and home tour🙌", "sacred_beautygirl": "I love that you’re getting ready to do at home things haha! I always feel better when I get ready for the day!!", "iamschara": "Babe. Cute skirt 😍 sexy body", "kbgautam1958": "Very nice combination 👌 🙋😘", "guddumahendrasingh": "Nice Dress🔥", "i.am.prettite": "Deets on the socks and shoes please!!!!!!", "m.rafiq3801": "❤️👌", "efe.ethem": "İyi geceler 💗🌷👄", "rhea.belle": "Cute outfit x", "verystef": "I totally agree with you. For me the main challenge is that I just don’t feel *that* inspired in the morning. I’m not going anywhere and I’ll be spending my day on a chair, on my bed or the floor (with little M) so need to wear something comfy that doesn’t add unnecessarily to the dry clean or ironing pile...", "maggieepxo": "Love the message, positivity and the outfit! 💕", "fashwin_": "Love this outfit! Hope you’re safe at home ❤️!", "spontaneitynow": "Oh how gorgeous you and your closet are!!", "just.youraveragetraveler": "Yes be the light in other peoples lives! We love it 🔥", "jeannieinabottleblog": "Super cute look 💖", "petite_and_curvy": "#followtrend #wearagain #londonfashion #petitestyle #indianblogger #whowhatwearing #effortlessstyle #petiteblogger #curvyblogger #curvywoman #curvyconfidence #curlyhairstyles #stylehunter #closetorganization #closetgoals #dreamcloset", "andreaantoniou_": "Your outfit is soo cute 😍", "pinkdeiji": "What fabulous heels 💕", "shechonky": "I love everything about this!! So true, it’s important to focus on the positive!❤️", "somehowimnotfat": "Self care is important!! Look good, feel good", "aussiebeautybychantelle": "Super cute outfit!! Love it", "felicia_fotography": "what a beauty !! && keep doing you my fabulous friend - we will all get through this one smile at a time 😁"}