{"mustardfitness": "Looking good! How often do you train?", "just_trish_style": "I need to start working out too", "volkmanadventures": "We’ve been going on walks or hikes a lot, but I’m definitely not making any fitness progress yet. I also don’t feel super body positive, but being told we have to stay at home has helped motivate me to start working out again to avoid further depression and anxiety. Started yoga yesterday 🙌", "thehappymenow": "I was so stressing out lately that I keep eating so much crap. I need to start exercise now to keep fit lol", "sarahldevries": "Way to go! I walk on my treadmill daily, but I need to get back into doing HIIT workouts.", "mdeskman": "perfect figure", "ojaswee04": "You are beautiful ! And that’s a wonderful idea 💕", "sa.urav8526": "You look very strong madam", "lovetotravelgirl": "You look amazing girl !", "madebyjuul": "👍It's hard to moti ate yourself... I went for a long up tempo walk yesterday...and every day I take out my 🚲", "the_school_of_artful_living": "😍😍😍", "felicia_fotography": "I don’t have a great body image but I’m working on it and I need to start working out at home too", "theelegantwanderer": "Girl, I love this post!! Loving yourself is so important! ❤️", "natavivi": "Haha I’ve been going outside to workout haha been fun", "amberhopestyles": "Its been so hard as a gym owner to Not go to My Business😭", "franciscovitor4049": "oi", "irshadhusain516": "Beautiful💕💕💕🌹🌹🌹👌👌👌💓💓😍😍", "verystef": "I ought to really find an exercise that suits me... mine was a walk every now and then - so I’m done to pretty much nothing now...", "just.youraveragetraveler": "I havent been motivated to workout and haven't been feeling my best lately. But I worked out yesterday so hopefully that starts my motivation", "truthandlovephotography": "Nice and beautiful gym 💯💯💯😁😁😁", "ata.7967": "❤️❤️👄👄💞💞", "runningatighttrip": "I need to start working out again!!! I also need to work on body positivity lol", "petite_and_curvy": "#curvywoman #bodyweightworkout #bodypositivity #positiveenergy #workoutroutine #petitestyle #petitefashion #petitegirl #curvyfashion #curvyrevolution #exercisemotivation #exerciseroutine #exercising #exercisechallenge", "cindy881122": "😍", "somehowimnotfat": "Well today is the first day gyms are closed. So I’ll be doing at home workouts", "m.rafiq3801": "👍"}