{"kbgautam1958": "Best is to use YouTube for new variety of dishes for each day.🙋 😊", "petite_and_curvy": "#shortgirlfashion #petitefashionblogger #springmakeup #freshlook #followtrends #indianblogger #stylehasnosize #curvyconfidence #stylehunters #instastyleblogger #styleblogging #inspofashion #ootdblogger #petitefashion", "somehowimnotfat": "That’s actually a really great way to stay sane", "feleciamoniqueblog": "Just have to take it day by day 😩", "thefloatingbed": "Tea and dressing up help SO MUCH! 🤗😍😘", "lovetotravelgirl": "Love this outfit ! It’s so pretty !", "sarahldevries": "I agree. I do the same. Even if you aren’t leaving the house, it’s good to get dressed up and ready for the day.", "theelegantwanderer": "I have to work now but I take this with a positivity and everything is a lot easier this way🙏💕", "amberhopestyles": "I need rest, and relaxation", "ojaswee04": "Totally understandable. Current situation has effected businesses and everyone in general. It’s very unfortunate. On the brighter side, you look beautiful as always 💕", "verystef": "Gorgeous skirt ❤️ i have some major anxiety at the moment - just trying to work with that...", "felicia_fotography": "Do what makes you happy girl - I love that look && I feel you on the job end because I just don’t know when I am going to be able to photograph any lovely people in the near future and that makes me sad but I’m just going to be positive and know this needs to be done to save all of us", "pinkdeiji": "Such a fun striped skirt 💕", "evinceboutique": "Gorgeous 😍", "pocketful0fhope": "Ooo girl those shoes! I have them in black! 😍", "hellotoawesomeness": "Great idea to dress up for tea and refresh ourselves!", "volkmanadventures": "Oh I love that skirt! And yes! I haven't dressed up yet but utilizing gratitude has been great during this time. I'm staying away from Facebook to cope with the situation. It really brought me down the other day! Also getting outside as much as possible.", "itsnisha7": "Wow❤️❤️", "dresswithcyn": "I love the skirt!", "natavivi": "Omg I’ve been wanting those shoes so cute", "mpalazoglu74": "🌷🌷🌷🌷🌷🌷", "ombirnagar": "👍👍👍🌷🌷", "thenaveensoni": "great thoughts", "just.youraveragetraveler": "I've been spending a lot of time in my yard. Fixing up the house and getting some sun"}