{"hellotoawesomeness": "Tats a great positive update!", "itslaurenfisher": "Should be smiling because of that skirt 😍", "donnamatrixqueen": "Love that skirt 💋", "felicia_fotography": "I hope it’s three months or less for us here as well but I have heard we haven’t hit the peak yet so I dk ... I’m still working and it’s tough but I’m taking it one day at a time", "somehowimnotfat": "I am in love with this outfit!!", "leslie8989": "😍💯👍🏼👍🏼 Lovely ! I am off work as I took 2 weeks off to go on holiday to Morocco today - Moroccan government cancelled all international flights not the country. I booked this holiday last year - did not seem to be a way to cancel without loss — but in this case the tour company had no choice but to make a full refund. Self employed - will decide if I should go back to work next week or take a break till after Easter 🙈", "sarahldevries": "Glad there’s been some good news.. praying this is over with soon. I’ve been working from home for a few years now, so this doesn’t really impact me.. but I did have a few trips planned this year that may not happen now.", "sitz_loves_photos": "The top though😍😍😍😍", "amberhopestyles": "Im cathing up on school work🙌", "lovetotravelgirl": "This room is so pretty ! So is your outfit 😊", "madebyjuul": "London people...Stay safe, get a facemask, handgel and keep distants ❤🙏 and don't go to the pub!", "pinkdeiji": "Love that pretty green! Stay safe 💕", "dresswithcyn": "Yes this week my company sent us to work remotely. I find that I’ve been able to focus more at home than I am at work 😆", "kbgautam1958": "Good luck and all the best. Keep always positive thinking and use this time to explore new recipe of different types of food items. 👌👍🙋😘", "erkan.oz.779": "👌", "just.youraveragetraveler": "I wish the US would get good news like this soon. I've been so anxious at home", "just_trish_style": "I love love that skirt 😍😍", "natavivi": "Always such good news! In Canada I think we are about to get worse before it is better :(", "theelegantwanderer": "I love this look😍", "tuvce_wac": "Omg you look gorgeous😍❤️", "verystef": "I wish I shared your faith in our PM. Our main problem/weak point here will the the NHS. Just scary 😢", "ombirnagar": "So nice Looking", "itskdn": "That's Good😍", "volkmanadventures": "Oh yay! That’s a great update. I think the US is a little more behind in our progress and we’ve just started quarantining as of the last couple of weeks. But the end is near! Our company is having everyone work from home for the next couple of weeks, which I’m okay with because I’ve been wanting to work from home for a long time now haha.", "petite_and_curvy": "#whowhatwearing #effortlessstyle #curvywoman #curvyconfidence #curlyhairstyles #stylehunter #dressedlikemyhome #livingroominspo #livingroomstyle #livingroominterior #londonfashion #ootdsubmit #indianblogger"}