{"petite_and_curvy": "#spain_vacations #lovespain #seetheworld #estaes_espania #amazingplaces #ig_spain #total_andalucia #ilovespain #visitandalucia #girlswhotraveltheworld #traveltoexplore #petitestyle #petitemodel #petitefashionblogger #travelgirlsgo #igers_wanderlust #petitestyle", "elita_survilo": "Gorgeous👏👏👏 I love so many places, its hardly to name one, but currently I miss Italy and lake Como with its wonderfull villas and gardens a lot💕", "ojaswee04": "Truly stunning ! Mine has to be California. I love the beaches there, the hills and the wonderful weather 💕", "princebilliam85": "Loving all your post darling!! We need to do a photo shoot! You in your stunning outfits and, well, me in mine haha! Well my matching bowtie and socks and scalfs haha. We could wear the same colours haha xx", "the_wild_wanderlust": "Beautiful shot", "felicia_fotography": "I love Portugal so much I can’t wait to go back !!!", "somehowimnotfat": "Gorgeous!! Everything about this photo is lovely", "sarahldevries": "Amazing! I hope to travel the world more once this is over. My favorite place so far has been flying into the Grand Canyon by helicopter. It was amazing.", "lovetotravelgirl": "It is so beautiful here!", "madebyjuul": "I like Granada but also Tarifa, Cadiz", "volkmanadventures": "Thank you for doing this! Two of my favorite places so far have been Banff National Park in Canada and Huacachina, Peru 😍", "theelegantwanderer": "My favourite place was Istanbul❤️ I miss Turkey and I can't wait to go back 😍", "just.youraveragetraveler": "I know I keep looking back at all my pictures wondering when we can travel again!", "jani5_5": "Love it❤️", "amberhopestyles": "I wish I could go.on a trip right now🤣", "meiandcojewelry": "Oh love this! Was just there back in the fall and this plaza was one of my favorite spots visited in Spain 💕", "diaryofalondoness": "Oh yes, Seville is definitely up there!", "verystef": "Beautiful picture. So many places I still want to visit!", "bombaybackpacker": "Mine too!", "jordi.layetano": "Oooohhhh😍😍😍", "ombirnagar": "🌷🌷🌷", "natavivi": "Such a great idea! We need this love ♥ - my favourite place so far was Disneyland hehe"}