{"mama2twohapas": "Such a cute look! 💕", "shivey_xo": "Stunning!💕", "amberhopestyles": "Beautiful skirt! I should take the opportunity to travel🙌", "jordi.layetano": "Niceeee😍😍😍👏👏👏", "felicia_fotography": "This is actually great advice - we can’t stop living", "theelegantwanderer": "Girl, you look absolutely stunning 💕😍", "petite_and_curvy": "#neverstopexploring #spainstagram #spaingram #andalucia_photos #spain_vacations #lovespain #seetheworld #estaes_espania #amazingplaces #ig_spain #total_andalucia #ilovespain #visitandalucia #girlswhotraveltheworld #traveltoexplore #petitestyle #petitemodel #petitefashionblogger #travelgirlsgo #igers_wanderlust", "ojaswee04": "Stunning place and you !", "lovetotravelgirl": "Loved reading this! I’m traveling in a couple weeks to the Bahamas!", "aclairetoremember": "Great advice!", "leslie8989": "Magnificent ! 👍🏼💯", "out_of_wuppertal": "Thank you for the information !", "thehappymenow": "Media string unnecessary panic. Same with people and panic buying 😑", "rhea.belle": "Gorgeous shot hun 💓", "takeapicturecris": "Hi. Just to say from North Italy near Milan do not underestimate this virus which has become a pandemic. The health system here is making huge efforts to save everyone. But we must help not spread this virus by stopping everyone to travel: we must stay at home for few weeks. We have no other medicine to stop it. Thank you", "just.youraveragetraveler": "I'm hoping it's not as bad as the news says", "volkmanadventures": "Great points! We don't have anything planned until May so hoping it goes down by then. This isn't a virus to be taken lightly!", "luu.olly": "Saludos Sevilla desde 🇧🇷 !!! Amoooooo España !!!!", "nupurchandra1": "Gr8 tips but it's not just about travel to a safe country that counts but also the travel through airports and public transports that matter at this time. No one wants to scare their loved ones unnecessarily, the whole world is scared right now and shutting themselves from each other. If travel cannot be avoided, precautions is all one can take. The cases that soared here in UK happened exactly after term break when most families returned from Europe and other destinations and unknowingly brought infections here via travel. We all by now know where this virus originated and how it has travelled world over. We can only try to be safe rather than sorry...", "verystef": "Such a glorious picture 🙌❤️", "dresswithcyn": "Beautiful photo!", "ombirnagar": "💖💖💖💖", "pinkdeiji": "Love the top💕", "pooja_travel_diaries": "Beautiful photo & great advice! 😍👌👍", "sarahldevries": "Great tips!! I don’t think I could stop traveling.. it would be really hard! Hopefully this blows over quick. I really love your outfit, glad you had a wonderful time.", "somehowimnotfat": "Oh my gosh it looks gorgeous there", "lostwithjess": "This place looks amazing!", "kbgautam1958": "Beautiful place and very colourful shot.👍"}