{"sarahldevries": "I love this post! It’s all about having a healthy relationship with food and loving yourself. I treat myself and I move my body not out of punishment, but because I love myself. And I agree, the more I limit things I like.. the more I binge on it.", "petite_and_curvy": "#bodyacceptance #allbodiesaregoodbodies #bopowarrior #fatpositive #fatandfabulous #confidentcurves #fullfiguredfierce #flauntyourcurves #stylehasnosize #styleandcurve #lovetheskinyourein #comfortableinmyskin", "hellotoawesomeness": "I love this post! I need a piece of cake!", "lauppfrosch": "🤗🤗🤗👍", "neha_sharma1602": "Pretty😍😍", "roceyrenee": "Love this so much! 💕💕", "somehowimnotfat": "My relationship with food is pretty unhealthy lol", "theelegantwanderer": "Yassss girl, I totally feel you and I love this post! The more I limit myself the more I want this food and this is certainly not helping me..", "ioldmonk": "More power to you girl", "ojaswee04": "I love the message here and agree 100%. as long as we are not jeopardizing our health, we should be eating whatever we want without feeling guilty 💕", "lovetotravelgirl": "Yes it is! Thanks for motivating me today", "just_trish_style": "This is such a beautiful post and I agree being healthy is most important ❤️", "pinkdeiji": "Looks delish! 💕", "kbgautam1958": "Lovely and tempting presentation. 👀👌👍🙋😘", "felicia_fotography": "I feel me and you are the same way in thinking - thanks for this !", "volkmanadventures": "I definitely binge eat, especially under stress. I love your post! Thanks for helping me see this differently. I struggle with image and appreciate your positive inspiration!", "ombirnagar": "💪💪💪💪💪", "diveasarin": "U look great", "natavivi": "so well-put! agree 100%", "verystef": "Oh my god. I miss cake (can’t eat wheat) 😂", "aussiebeautybychantelle": "Couldn’t agree with you more", "delightfully_deligne": "Need that cupcake😍😂"}