{"sherryshroff\nVerified": "Verified", "deevya66": "@sherryshroff ohhhh his tummy tuck looks sooo cool! Ahhaha love you guys! Cutest couple ever! Btw @sherryshroff I want to applaud you on how your conducted yourself when you saw haters commenting on your pictures! Don't ever let them get to you and always be a happy, smiling person 😊😊😊😊😊", "nehakbhonde": "@sherryshroff plz tell me WHR do u live in south Mumbai. Plzzzz", "hellot.o": "You have such loyal followers...you must be really proud of em @sherryshroff 😃😊", "shivamsharmaphotographer": "Is @vaibhav.talwar is your fiancée or husband I totally don't known @sherryshroff!!!", "sanjanaamisar": "@anoodles_ wants attention and @nand.singh @nishitaa_g @_nivedita_malhotra_ you guys are giving that involuntarily. Chill guys, normals can't deal with abnormality. We'll let @sherryshroff @vaibhav.talwar handle this. Let's not spam @sherryshroff phone for no reason. iPhone battery also sucks 😹", "thedaftdynamo": "Go Vaibhav & Sherry!", "gurpreetsdh_": "You better. Send me an invitation card @sherryshroff", "ashvira.r": "wow !!!", "g_kulkarni": "@apoorva_appy26 I am arriving there very soon.", "apoorva_coolkarni": "@g_kulkarni u will baby 😘 and I will post a similar pic 🙌", "starships007": "@priyasharma.27 @shriya_sharma27", "rawatchitra": "Awwwwaaa Sooo cute", "pandeypoojad": "Kudos!! @vaibhav.talwar it takes a lot of practice to do dis u guys are amazing love you guys a lot :* @sherryshroff", "kaun_kriti": "@anoodles_ u need to grow up n u noe wat sherry is verry successful n I love her n srry sherry bt I can't just be relaxed after reading this @sherryshroff", "ayushiparmar": "I wish I cud like some of these comments @anoodles_ is one hilarious character!!", "ishwarithadhani": "@anoodles_ I get it you think you're very cool and stuff just because you live in US but this is certainly not the place where you need to do all this. @sherryshroff is an amazing person and you don't have any right to say anything to her as she is a much better person than you 🙈 pls behave on social media.", "srushti__choubal": "Hahaha pls don't block her she was entertaining us so well!😂😄 @sherryshroff", "aswintilak": "Now I can see how u r on full of energy and smile 😊💃", "vaibhav.talwar\nVerified": "Verified", "anisha.alluri": "@sherryshroff u should totally block ppl like @anoodles_ she isn't worth it", "shreyaraha": "Why do i feel that this noodle girl hasn't ever seen a hot guy, so she is finding @vaibhav.talwar ugly !!", "shivansh.bhalla": "BTW...@sherryshroff much love😊", "clintonjeff": "Daayum guuurrrlll", "_nivedita_malhotra_": "Pls dnt say anything negative if you dnt hv anything positive to say @anoodles_ #noplacefornegativity", "justsoume": "😍😍😍😍 @sherryshroff this is another hater of yours!! Cause u have this man!! 😋😋", "kasturiverma": "Oooh !!! @sherryshroff you are one lucky woman!", "tishmee": "@sherryshroff @vaibhav.talwar Cutest couple on insta!", "priyankagolecha07": "U need lots of practice to do this..its amazing @sherryshroff", "nishitaa_g": "Dude are you cracked? @anoodles_ get a life man", "saditsha11": "@yashwantsingh4799 haha ikr!! 😂😂", "payalppatil": "@pratikshafirodiya @bhaktigujar", "vaash_": "@yashwantsingh4799 hahahaha good call", "nand.singh": "@anoodles_ its too tough to understand you... your english sucks!", "anusha97_": "He's so ugly!!!😒😒", "janhvitibrewala": "@anoodles_ listen first of all you are NOBODY to tell them how many subscribes do they have or how famous they are. Look at yourself first before telling others. Swallow your pride man.", "dailyavaswaggytail": "But I am a child...??? @anoodles_", "absolutely_janhavi": "@sherryshroff 😘", "pooja_proach": "@anoodles_ get a lyf gal...lyf is too short to comment negative about anything.....anyway u luk pretty in pp", "sahilbulla\nVerified": "Verified", "ayushiag": "@bhavyabubber", "sara_radkrish": "@sherryshroff- He's certified eye candy. Just commenting on this to tell you how lucky you are and so is he, to have someone who is equally gorgeous and admires him constantly. Keep posting amazing pics, you two!", "ragini_kuwalekar": "Man he is fit!@sherryshroff motivated to stay fit coz of u n vaibhav! Keep up the awesome work !😊", "jayatisampat": "@sahilbulla!! ♥ I laughed more than I should've 😂", "rimmigera": "@anoodles_ it's ok it's your opinion but u don't need to justify it cause @sherryshroff #shroffers don't give a shit .. stay calm ! Be positive 👍 shroffers- people write hate comments !! It's ok cause we r positive people we should handle it like a good person!!😊", "sitharaaimeka": "I think its better to report her inappropriate rather than having arguments. Do that guys :)", "lifewith_as_": "@anoodles_ so rude!", "smrutisoni": "Introducing @anoodles_ to the world, who is as skinny as noodles, and she says Vaibhav Talwar is ugly..:'D well we know whom she is kidding", "ayushhsh": "@anoodles_ I'm just sayin' that if you have all the rights to comment whatever you want to then other people also have the right to contradict you. And yeah being a hater is the most ridiculous thing you can be. Congo.", "rachyananth17": "@anoodles_ girl ! GET A LIFE !", "ishi_bhutani": "@sherryshroff those abs.. Please make a video on how you both enjoy working out.. Love😍", "aparnaadev": "wat has happend to this world... being rude is the new cool? thers nothin wrong in ths photo... ths noodle gal shud practice some yoga to get her head cool.", "tavleenkaurtaneja": "As you said that finally you can call him your fiancé and not boyfriend any longer! 😂❤️👌", "alexipanos\nVerified": "Verified", "doubletapbynima": "😱😱😱😱", "rachanaaraaj": "Hott!!!!", "nirajarane": "@thesecretclosettt 😍😭", "therealhappysoul": "Hehe :D @sherryshroff", "priyadahiya_": "Hot ;)", "bananajuice10": "hes so skinny!!😀", "chelseagaya": "He can do the abdominal suction so well!"}