{"_lifeofpai_": "Who is your favourite indian youtuber? Why?", "akankshaasiingh": "What is you best moment in your life? Why?", "shubhangnikapoor": "When are you going to marry ?😍", "crystle_zc": "what has been your fav holiday till now Sherry?@sherryshroff", "rupalikarekatte": "Chance", "anika.singh.99": "@sherryshroff te last book u read??", "aliyashaikh_": "My question to you is can u speak in british accent/ or just try speaking..? 😘", "aakankshachiplunkar": "@sherryshroff How would you explain about YouTube or what would you tell your followers who want to have a YouTube channel. Like about it's benefit and all.", "saileepatil": "I mean which place would u love to visit next with Vaibhav?", "priyankapatharia82": "Sherry wanna know your favourite teacher name , and she is in contact with u .", "crazyjai123": "Yusss @sherryshroff a cooking DIY", "ridhiasnani": "What do u generally do with your old clothes and accesories...do u use them till they get completely worn out or u give them away to the needy when u feel @sherryshroff", "beingmere": "#asksherry ur biggest pet peeve??", "ayeshu_": "Sherryyy.💛💛💛 Are you always brand consious.? Other than the DIY's and the sarojini nagar hauls (which btw we love),do you always wear tags? Or do you wear anything which is comfy and in which you feel confident? #Asksherry.", "shubhi_25_": "N I realised, this was posted two weeks ago😳..but still ❤️😁", "gurleennnagra_": "Royalty at its best @sherryshroff", "arja_aventador": "This look is so Arabian nights. Perfect for you ;)", "sherryshroff\nVerified": "Verified", "brainsofwhiz": "Whou was your first ever crush?!!", "mansilohia": "Vaibhav and you have been together fr more than 10 years!! 💕 what keeps you together? How do u deal when one geta angry? Pleaseeee telll 🙌🙌", "sneha_issrani": "What's your aim in life? @sherryshroff", "amysbinder": "#asksherryshroff when you were in like 10 grade how many crushes you had?", "mylifeasnayan": "How did you get that accent ?it's too cool 😊", "anoushka.gore": "How old were you when you got interested in fashion and makeup?💜 #asksherryshroff", "kaajal.singh": "When did you decide to become a fashion blogger? Any inspiration? Because mine is definitely you! :') @sherryshroff", "priyanka_k_adnani": "Can you please do more videos on nails like which colours are in faction, what nail art looks good,etc Thanks ❤️", "mumma_son_life": "@sherryshroff which design would you like to wear on your big day #asksherryshroff #iadmireyou", "tanyaaxx_": "Have u decided ur wedding date?? If yes when is it!!!! #asksherry luv u 😘😘😘", "nityaa_malpani": "Dear Sherry, how do you know if someone is cheating on you? I love you😘!#asksherryshroff", "darshivichhivora": "Hey! Sherry! Would like to know someone more about ur family with pics.....💋love u!!! #shroffers", "unnati211": "If u wud nt be a youtuber den what wud u be?? @sherryshroff ❤️❤️ will always love you", "ananya.poojary": "Do you love plants???", "sriyamaroju": "Which is ur fav dish", "adithi11": "Where do you usually buy your clothes from?", "14mohapatra": "Name one brand u cant live without throughout ur life.😊", "pavi_83": "🌸which camera's would you personally recommend to shoot videos 🌸", "dopetumblr29": "What is your fave song *-*", "banshareee": "Which your fav Bollywood actor and actress u have to answer it don't say I'm not a Bollywood person", "tej_v": "#asksherryshroff Did you ever consider acting in Hindi movies?? @sherryshroff", "pooja_proach": "Can u send me a virtual hugs ?😁", "lifeas.av": "Whats your fav song?", "bargavi_baradhwaj": "Which is your favourite show and movie(bollywood and hollywood)?? #asksherry @sherryshroff", "jasminesahukar14": "do u love being a Parsi?", "eshikajaipuria": "Which is ur fav dish?* @sherryshroff", "eakuskaur": "If u had a chance to act in a Hollywood and Bollywood movie, what movie it would be?? Btw- I love u a lot ❤️ #asksherry@sherryshroff", "shukra7": "@sherryshroff hello sherry, I really love your channel ❤️ my question is how you are so talkative and fluent in speaking?? And feeling confident about yourself?? please make video on this.", "adiittiii": "When are you marrying vaibhav and will you call some of us?? @sherryshroff #asksherry", "manasi27": "If*", "deannedsouza02": "#asksherry whos ur role model", "priyanka.toprani": "Sherry!! How have you been doing?! You are just getting awesome at what you are doing with your posts and videos! You are an absolute amaze and stay this way always😘 So I got 2 queries to ask you and il be super glad if you could answer them both. Question No.1 goes by Who do you think has a dream wardrobe and would love to steal it?! Question 2. Name few Indian Fashionistas to follow on Instagram . #asksherryshroff @sherryshroff", "avani.p": "#asksherryshroff pizza or burger?", "sukritigarg18": "What do you think about curvy girls? I'm one of them but I like skinny one's because they can eat whatever they feel like. 😝 #asksherry", "teamlillyindia": "#asksherry when did you start dating Vaibhav?", "this.girl.is.a.squirrel": "Just one vlog..", "devlina_bajaj": "Is der any event or part of ur life wich u think u cud hv done in a more better way? Wat is it ?", "prachiii4.10": "Hey sherry ! Hie😀 what do u do to when u feeel low... The one thing that always lifts up ur mood?", "nirmiti_patel": "When are you getting married???😍 #asksherryshroff", "bhavikarathod": "Where do u see yourself in 5 years down the line..", "anjikeralia16": "@sherryshroff new question !! I have started a new YouTube channel so fo u have any tips and tricks for a successful YouTube channel", "notgunjanswaroop": "Ugly and live forever, or attractive and die in a year? #asksherry", "farida915": "@sherryshroff out of all the places you have visited, which is your favorite and why?", "dwivedisukanya": "@sherryshroff Hi Sherry ...my question is...being a youtuber makes you a public figure , you share your life online with the entire world ..when ever u get all those sugar coated aww comments you are soo sweet...BT when some body give there opinion on your vedios that's straight forward.. Your all that sweetness just fade....why so?? Either u think your perfect n has no room for improvement... Or u just think everyone is always just gonna appreciate you..", "kritigoyal12": "How did you felt that vaibhav is the one? What was the sign that mad u be with him for likr sooooooooooooo long? Lovr", "rachenasawant": "You are so busy with youtube.. how do you take time for yourself and family?", "sindhushakoppu": "#asksherryshroff have you ever thought that you would be this popular by making videos ?", "riya071002": "When you were young, which sport was the most favourite of yours? Is it still ? #asksherry", "jainshreshthi": "Who's your anytime person as in whom do you confide in? Except vaibhav.", "yogawithramya": "which animal you think you signify and why", "tishajalan": "What kind of wedding would you want for yourself? Big fat Indian wedding ,church wedding etc etc or something simple ? 😀😀", "mommytosiabear": "If u had another chance at life would u do things differently or do all the things just the same?", "krishakukreja": "Hi Sherry, I am 11 years old and love watching your videos, It would be so so so nice If you can answer my question. So here my question is that... Can you please please tell us what has happened to your shoulders please for your fans?😞 Theresn no need to worry about they do not look weird, they suit you and there's completely no problem in it. Bye thankyouu☺❤ please answer?❤", "r.ealmy": "Are you planning to come Singapore anytime? Xo ♥#asksherryshroff", "srishtiborkar": "Who is your favourite Game of Thrones character and why!?", "riyabramhe": "@amulyaragam - *on Whatsapp", "moon_fun10": "#asksherryshroff how to be happy even in hard times ? When nothng is going d way it shud be what u will do ?", "anandbhavika": "#asksherryshroff who is your favorite Bollywood actor?", "ananditasalil": "Who isur favorite Bollywood actor?", "suasham": "How do you manage to shoot 3 videos every week? Where do you get such innovative ideas? Really liked yesterday's video on Coupling! 😊", "namastebrisbane": "What is the best thing you love about vaibhav??", "shinyasmani": "Sherry can please tell us some home remedies for getting good skin and even for pigmentation.", "payalchaudharysejpal": "From where do u get topics or ideas for your youtube videos??", "maithi.lee": "How many children do u want to have?#asksherry @sherryshroff", "bavana_18": "What do you do when you get sad? :/", "tanimarahela": "Sherry I am following the night cleanup routine as you do ..butt I want to know is there anything bad in doing this fr our skin?? Thank you", "_drishtiw_": "No questions . just wanted to say u and Vaibhav look cute together. Also I have started my channel called Music Fever. The link to it is : https://youtu.be/Er7-aZ-aU2I. I wud luv u to subscribe to my channel. Love always #Asksherry @sherryshroff", "srishti.aneja05": "Hey @sherryshroff ..i really love and appreciate the work you do! My question to you is that how do deal a fight with vaibhav? (If at all there have been any ) #Asksherry !xoxo😘😘.", "namrataworld": "#AskSherry How do manage all the stuff happening in your life? & how do you deal with downs.. if you don't want to share anything with anyone?", "umisha_khoja": "Would u rather shop at forever21 or H&M???? @sherryshroff", "jhanvi2105": "How many kids do you and Vaibhav want ?", "faitth_moves_mountains": "Wat are your favorite travel destinations? And also is there a daily healthy eating regime for u?? If yes you must share it.", "mandipadilla": "Who's your favorite YouTuber?", "sana.ahmed95": "Who's your favorite bollywood actor/actress? @sherryshroff", "vanity_obsession": "How to earn money from youtube", "brownbeautysimor": "Which cuisine ??", "thezenfulchronicles": "What's your pursuit of HappYness? #AskSherry", "life_of_jeni": "Cutee", "harshitahsingh": "Hw r like soooo much energetic ol the tym..??? Hw! Hw! Hw! @sherryshroff #Asksherry", "samhithajanaki": "Hey sherry....!!!temme one thing how do you manage ur time doing soooo many activities in just 24hrs....I mean I can't even manage to write a single assignment in a day....how is dat possible for you.....????@sherryshroff #asksherry", "aaayusure": "What is your favourite perfume #asksherry @sherryshroff", "mahreen009": "Do you think that u still are a tomboy? #asksherryshroff....sorry for going overboard with the questions", "nishthamehta_": "What are you from the two - Mumma's Doll or Daddy's Princess? #asksherryshroff #asksherry", "nupur.sood": "Things u hv done/not done till date that u regret #asksherryshroff", "gayatri_mehta22": "@sherryshroff a thing about the current Govt. that u would like to change? #AskSherry", "more_than_love_with_cakes": "Hi sherry!!its a relationship question..I wl be turning 24 next March and just finished with my masters ,planning to pursue doing my phd...and my boyfriend is 27 ...settled and doing well financially...We want to get married but sometimes I doubt how my parents may react to it (that's holding me back from asking them) coz they r d career oriented types (get settled first and then get married types)...my parents like him...but I think that they think it's a little too early for marriage for me...so please tell me how to go about it...I know it's a pretty long messege but I hope u have an advice for me", "sakeenam": "Would you rather eat chocolate for life or eat cupcakes for life???? #asksherry", "mounica.m": "Can u suggest best whitenning cream and sometimes ur so boyish when ur posing for pictures and all i want u tp be giry girly which reveals ur cuteness... Vaibhav is very handsome nd both of u make great pair.. Whats ur beauty secret particularly for that glowy face ... That is all becoz of highlighters or real glow on ur face?!! @sherryshroff #asksherry"}