{"reviewsbysadhu": "@sherryshroff no matter what you did a brilliant job ! Have seen so many brands literally going behind people with 10k plus only ! They are ready to pay them how much ever they demand !", "hudabeautycafe": "Thisnis one reason why i alwz cross check woth @shwetavijaynair 's recommendations before falling in trap with other influencers recommendations. We need more people like shweta and u. 🙌🙌🙌", "lashes_drama": "Many of us forgot about @myhappinesz @shrutiarjunanand @anaysa.in @shystyles2109 @komalgudan they all are sellouts for sure", "pragatiimishra": "Watched the whole video. Its such an important video. And can't appreciate you enough for making it. So honest and so needed. Our society is becoming a materialistic entity as consumers are being fooled around. We are being ignorant of the environment around us. And its all leading to be a capitalist society which will only work for the worse.", "saniyamukkar": "@krishnikaasawa sit with a tub of popcorn.", "skincarevilla": "The only one I admire is @simplyshalini ♥️♥️", "you.can.call.me.queen.b": "@sherryshroff I love the video. Watched it on a friends recommendation. But I have to tell you, when you call out on these influencers that they're wasting paper or promoting a brand that there's no way they use, they block you! It's a lose lose game 🙈", "manasi_moghe\nVerified": "Verified", "jahanvi.22": "It's also audience's responsibility.Why they are becoming crazy for so called influencers and buying those products?I hate this word. Man ,now a days people don't find Vivekananda as influencer but some random blogger who are sold out.Generation need to be aware and not follow this rat race.Not a single blooger talk about eating healthy, Farming,no pesticides.Recently I have made video on Nature only 200 people watched it.No,not because it was not less good content.Because our generation is just sold out among this chemical brands,Sigh!", "savi_bansod": "@komalgudan @shauryasanadhya @aakritiranaofficial this is so you. You need to watch.", "imbundleofjoy": "@thatquirkymiss she is the one who come to my mind when i see your video❤️❤️❤️❤️❤️ her content is so real and genuine too❤️", "maybeucancallmeshamata\nVerified": "Verified", "nainasalvatore": "Because of all the fake influencers I had stopped using YouTube I used to love seeing Indian YouTubers go so good and make India proud but lately it was so fake and unrelatable that it was best not to watch their voices thank you @sherryshroff for making such a great video💞", "bansi_shah007": "Hats off to your video that every damn so called influencers started using #ad...😂", "shamoly.khera": "Completely agree !", "beautifulbuddy": "I am glad I have stuck to my favourites for the longest @sherryshroff @simplyshalini @ratibeauty @stylish_by_nature and @mscocoqueen. The content has been solid and genuine all these years. Nothing fake and all of you keep things real. Wish you all nothing but the best, always 🤗❤", "fashion_lyfstyle777": "@kritika_goel @iamkarlrock @mostlysane @miriam_james22 you are genuine people! You cRe about your audience. Worst are @sejalkumar1195 @superwowstyle @aashnashroff @akritirana even instagram pe promote karne waale @kennethseb @_aashikabhatia_ sooo many people who just earn money through these paid advertising. It has to stop. We all complain about fair and lovely being promoted in India. Then what are these people doing? They are doing the same thing with some other brand.", "whosonalrajput": "Loved this❤️ Thank you for sharing this one🔥", "sukritivijayvargiya": "The r so many to name with such trash content still 100k + followers", "aas_tandon": "Sherry! Kudos & Big hug to you! ❤️ Finally someone has said it.", "foodie_to_fit09": "GUYS! Can we please please everyone together unfollow all these fake people? Coz till we don't unfollow, they won't stop. Let's list down the fake ones. Komal pandey Boho girl Sejal Dhwani bhatt Aashna shroff Malvika Please list more. .and unfollow all!", "anjana_choudhary": "Yes. Everybody should feel accountability including actors and actresses.", "shikha11990k": "just checked on social blade - @aakritiranaofficial uses fake followers.", "avnisaxena07": "People should watch this and understand the difference between real and fake content creators! ✅", "nishaaggarwal\nVerified": "Verified", "sherryshroff\nVerified": "Verified", "just_a_brown_girl": "Loved your video. I think it's time we hold people accountable on this. Most of beauty content these days are sponsored. Specially here in India. These influencers should be called out on their BS.", "sukanya_s27": "Atta girl! 💯💋😍", "curios_dreams": "Absolutely loved this video! We agree with each and every point you mentioned! The online beauty community, especially in India is at a very sad state. 90% of the beauty influencers will be promoting the same product at once, saying only good things about it without actually trying and testing them for a good amount of time, and also for example, promoting 3-4 different moisturizers in 1 week! It is so frustrating.", "vintage_mommy": "Thank you @sherryshroff for making this video you are the best in this industry always with good content , got to know a lot of things places products from your videos . Hope others learn from you and stop making fool of viewers .", "iniwsahsey": "@swethasri2507 what we were talking about!!!!", "hyggelig_girl_28": "This is an amazing video @sherryshroff Thanks for sharing this and it is high time beauty bloggers stop promoting everything and anything. Right from ponds to estee lauder!! Right from products having parabens to all natural products!! Till two years back some of these beauty bloggers used to have genuine content and would post relevant stuff but some of them have just been doing everything and anything now!!", "yuvi.says": "Loved the video. You nailed it. ❤️❤️❤️ watched it thrice.", "mukktak\nVerified": "Verified", "lilsakos": "👌☝️", "jessica_mendes06": "@lifestylejorden is calling out the influencer community in a hilarious way 😂", "frankly.speaking.tbh": "Ok all the comments are quite interesting. Few names that are continuously popping up are very true. Whatever I am going to say below while pointing fingers to the audience INCLUDES ME TOO. I am also a culprit behind making them famous. Lets start with Debasree- She takes all the promotions that comes her way and now she can afford to buy (read already bought) a Chanel 3 lacs bag. She personally can financed international trips with influencer money (only people would understand this who had been seeing her since inception days and her Q&A sessions.. it was clear she wasn't from a super rich background. Social media helped her). Moving on from fake skincare promotions she does, in what way her make up skills are good???? That too gets featured in Allure. None of the Allure people saw Saloni Mathur, Smitha Deepak, Shreya Jain??? That's not all Allure's problem because of that freaking COSMOPOLITAN had PRESENTED HER WITH AN AWARD this year for doing NOTHING partly based in our votes. (I haven't voted any of them but I am still accounting myself for the mishap). That award totally changed her vlogging game and we are responsible for that. Those so called influencers are coming out laughing from their banks because of that shitty award. Now bnbcloset had also started the trend so if anybody wins that will be on votes aka.. again our fault. Ankita (Corallista)- Doesn't know shit about hardcore MakeUp. Always plays with safer Colors.. haven't seen her doing a single cut crease. Total sell outs... Nykaa's robot. She selects her Q&A mostly of James and how they met. It's getting irritating (unfollowed her btw) Malvika- She has a modelling career to fall back upon but we all know she wont coz of the Cosmopolitan award. Again. We are taking a bowl of popcorn and sitting in front of our laptops watching Sunday with Malz. But let's be real playing with Colors Fushia and royal blue and making dramatic eyes with 'newly launched Nykaa gel eyeliner' does not make one a makeup artist. I feel like crying everytime I see their content coz believe it or not they all have Kickass edit capabilities. Malvika have 2 brothers to learn from.", "jayashree1979": "Started following you organically 🤗", "closetgossips": "Amazing 👍", "carebymathi": "Loved the content you spoke in the video. A lot of people text, ask to buy the products from Amazon, ask to review and reimburse. I really don't like this way of approaching. Like how does all this start !", "yusra.rais": "Most genuine instagrammer is - @beingmomtastic . Love herrr 💓💓💓", "manisha.goyal": "Loved the vedio sherry...i have been following you since years now...but i wanted to ask you something....the ad's that we see in youtube vedios are they paid? Like people add tons of of ad's in the middle of the vedio but why?", "simrannarang_": "Loved it 🔥🔥🔥🔥", "findit_yourself": "Loved you take on this. Honestly you are one of the best and oldest Youtuber I am following. I desperately wait for your videos. Also, you know I have been following you for years now but I was amazed with your 30 day lipstick challenge. This is because I never knew you had soo many lipsticks, from high end to drugstore because you never really promoted about them to the entire world. You are real, you are amazing!! ❤️", "urvi.lakhani": "Hi @sherryshroff , I think the most important point that you brought up was that many brands don’t allow the content creator to write that it’s sponsored content. I can tell by the comments that most of the blame is being put on influencers. I think the brands need to take some responsibility too. By showing that they are paying people to talk about their stuff. Someday the bad quality of their products will catch up to them. For eg, for every launch that @nykaabeauty does, atleast 10-15 influencers post about how much they love this launch. In the beginning, we fell for it and ended up buying some stuff. But then we realised that not all the products from nykaa are good. I refrain from buying any @nykaabeauty makeup now. Simply because I cannot trust what the brand or the influencers around them say. Shady AF.", "divyanshasingh41": "@shwetavijaynair and @mrjovitageorge and @shreyajain26 r most amazing beauty bloggers ! They r extremely honest and genuine and hard working try every product be it off 100 bucks or 10,000 bucks on their face just to give honest review ! They demand shade ranges , have a voice on social and environmental issue and love animals ! What more to ask for ! Love the trio ❤️❤️❤️ this may come as surprise to you coz I have always been a silent admirer of all of you ! But sometimes honesty needs to appreciated !", "iffat._.thakur": "💯🌟🔥👏🏻So Raw And Genuine.", "shwetavijaynair": "@sherryshroff I loved your video. Tx for keeping it real , as always.", "mounikamaddukuri": "@anushreeaaneja I think she should be given a lot of credit for being genuine. Girls like these deserve more followers. I see only organic content from her.", "khadi.k2": "Lovely video, sherry!", "mommynlo": "Fab Video.. totally on point and well said 🤗", "pallabiguha": "People with fake followers are commenting on this post & trying to prove themselves. Nice 😂", "iampallavidutta": "@sherryshroff This video was an eye opener for sure. People need to start talking about it more often now, especially the “influencers” & content creators. I’m just starting off my journey as a content creator & fashion blogger (who actually has a blog 😂) and this video kinda made me clear about the ethics & intent I should be creating my content with. Thanks a lot for speaking out loud about this! 🙌🏻😘", "muditajha": "Loved it!👏👏👏 Thanks for doing this video!🖤 You're very courageous.", "fitgymmers5": "According to social blade you gained 16696 followers in one day! 2019-08-20,then the next day it went back to 45🤔 Buying followers is wrong and unethical but buying and then speaking against it is hypocrisy no?", "dhara_chinna": "Eye opener video❤️", "swati.kandhari": "Haha! This was so needed. Glad you are not doing the #28dayolaychallenge and bull piece of shit!", "_iiiqraaaaaaaa_": "@larissa_wlc @siddharthkerkar", "thehappytrooper": "Awesome sherry. Unfollowing @malvikasitlaniofficial @shauryasanadhya @corallistablog and especially @debasreee", "dastidar_sangeeta": "One of the best videos I have watched .👍", "sanah_mehta": "This is hands down your best video till date 🙌", "khadijasalimsadiq": "@faridaakanchwala : Read this", "sachdeva.ritika": "👏🏻👏🏻👏🏻", "chips.could.chalk": "There are so many opinions that are just Sherry’s and may not be a ‘Fact’, they are still opinions and opinions of an individual is something that should not change the follower’s mind, facts should. Simply put, one person’s point of view can’t be all correct, to assume thay is just bad math. A few of the things she talked about feels much like rant! This such a lopsided view of things. For the first time I felt her video wasn’t the content I would want to see or hear because it just had so many points of bais.", "sonalsomaniofficial": "@sherryshroff saw ur entire video on youtube. Hats off to you. Brilliant video well made points. I recently had an incident with a brand where they wanted me to collaborate but they were not willing to accept my streetstyle casual style of dressing They wanted me to dress like a certain other blogger and create content for them. I dint have a choice but to let go the collab", "sohellalvani": "🙌🏻🙌🏻🙌🏻", "bronzinggeek": "Thank you for talking about these things... This was much needed... I see influencer promoting something new every third day...how?? It's so frustrating ...as I m one micro content creator who has to do everything buy myself .. and knowing these so called influencer haven't use the product not even for 2 weeks ....start promoting ,,as if it's the best thing in the world. And finally there is big hole in your pocket and a lot happens with your skin... I have suffered in past ... Now I no more listen to them,, instead use what is good for me and update about these only to my followers. ., But it takes a lot of gutts to come here and talk about this... thank you again👏👏", "megha_mukherjee_official": "I am so happy that a person like you is speaking about such an important topic. I am so tired of watching people buying followers and getting away with it. I am why are you even buying 30k follows coz you still have 66 likes on your post. 😆 I am happy with my organic content", "reshmitha_jose": "Thank you for sharing your perspective on this on-going debate @sherryshroff :) The video is insightful and relevant to content creators as well as the followers.", "khushnazk": "Thank you for taking the time to speak about this. There is no genuine connection on social media nowadays, it's all about numbers and business......", "shridelight": "Thanks for the video. 1) I find it baffling that people endorse a new brand every other day! If you represent a brand, it kills your credibility to endorse another brands products. 2) The reckless endorsement of cosmetics baffles me. I don’t see people with layers of makeup in everyday life, so I find those tutorials unreal and unhealthy. For one, that degree of usage screws up the skin in the long run. Especially if they are chemical based or “natural” as claimed and you don’t know how as @indietg pointed out. 3) Promotions pertaining to hair colour, curling irons, straightening irons are again concerning since they cause severe hair fall and baldness at a very young age! I wish there was someone who would actually educate people on such things so people wouldn’t learn too late the ill effects of following their favourite people blindly..", "annie_oak17": "@shauryasanadhya @aakritiranaofficial @thatbohogirl @aashnashroff @debasreee @komalpandeyofficial @malvikasitlaniofficial @thechiquefactor........ DID you guys watch this video??!??? Must watch for u guys!!!😂🙏", "kavita_bhandari": "I totally trust @thatquirkymiss .. pure soul", "ritcha": "👏🏻👏🏻👏🏻👏🏻👏🏻 Really tired of the BS going around! So glad to see you take it up ❤️", "varun_sach12": "Sherry I've been following your work. But even you had an unnatural growth in your followers. I can put it this way, its like how a thief denies the fact that he robbed when he actually gets caught 😂 stop pretending that you never bought followers. Whom are you bull shitting man. 😂 Putting down all the other influencers like @aashnashroff and @aakritiranaofficial or @malvikasitlaniofficial doesn't make you a great influencer of all time. Give it a break girl. Lol it seems like you're covering the fact that you bought heavy followers as well. If not then tell me the logic of getting just around 3k likes on posts having a following of 214k. Are you trying to tell that the remaining followers have not engaged on your post. Lol lol lol 😂😂😂😂", "shivzi": "Loved it. Yes social media was much more fun. Now there is zero reality and it's just number game. 😘😘", "edengyatsho": "Absolutely in love with this video due to which I just followed you and unfollowed many..😬", "aakritiaroraa": "👏👏👏 FINALLY!! someone said this.", "anjanadandekar": "I've been watching your videos since a while and I've always loved your vibe, but gurrll you just became the GOAT!! Damn, you really are gutsy🔥 You earned yourself a lot of fans for this!", "anku_banku": "@debasreee loling on her recent story. If you see one of her videos where she clears her room,we'll come to know how many products she was hoarding with her soo called ''work \"", "annewshahembram": "This is one of the most honest videos iv watched this year and honestly, it was so so so enlightening!!! Most of us know who is doin real work n who isnt, but i guess we needed someone from the community to speak up.", "mahek._.shaikh": "@malvikasitlaniofficial the best one❤❤", "mehstruck": "The most funny part is influencers or content creators from other parts of the world(and I'm speaking bout billioners too)are Soo humble that you ask them bout something they do take their time but they do reply and help you out no matter how many questions you ask them..whereas so called Indian influencers have some weird egoistic nature n hardly notice their followers😪😪 @shivesh17 @thatbohogirl", "21vms": "Very true for @komalpandeyofficial .", "shanayabansal96": "It is so disappointing when i saw everybody pushing belif aqua bomb. It has such huge denat alcohol content which is so bad. You as an influencer have a higher duty to double check things before pushing them. I know it’s not possible to go through every ingredient, but if you’re pushing a product , the least you can do is check if it has denat alcohol, like i am not an influencer and even i know it’s bad in the long run! I am tired of seeing posts like this is what the texture feels like etc etc. i am buying the product for the results, not the texture. 🙄 and literally you nailed it when you said that almost 10 people upload a story about the same product, like relax. And now bloggers are coming forward and saying oh but you buy it , it’s your decision. Obviously it’s mine but the point is my decision is influenced by the crap you’ve fed me. Even Shreya does sponsored posts, we’ve no issues because she comes forward when she doesn’t like anything no matter which brand. I just hate that influencers have become brand pleasers. Like I rarely see them criticising the brands with whom they do regular sponsorship. Like No thats not how it works. You’ve to say if you don’t like any of their products. And if somebody claims that oh they don’t wanna put across a negative opinion or negativity etc, i am sorry but it is more like constructive criticism", "sonalnagda": "❤️❤️❤️❤️ More power to u !! Gutts lagte h !!", "harshadaofficial": "One of the most amusing shit I’d noticed all these “influencers” do recently was ad for PONDS TALCUM POWDER !!!! Like shreya jain using it to mattify her nail polish 🤦🏽‍♀️ and someone else to bake under eyes 🤦🏽‍♀️ What was sad was their comments section - some people actually bought that bullshit 🤦🏽‍♀️ Such sellouts man !", "anisharoy_98": "Sherry, this video created immense respect towards you. Not just because you told what audience relates to, you told what you had to tell standing in the same industry which can put at risk for raising your voice! So technical, yet so so appropriate!", "aiswaryaray__": "@superwowstyle she uses every moisturizer skin care and shampoo and gives reviews. How can she be using every product in one month?", "yatzz23": "This was such a genuine and authentic piece of content, harsh yet real. You covered it all and appreciated some of the real content creators! But hey you missed out on @shreyajain26", "thepinkandyellow": "Glad that someone actually told the truth. Power to you! Well done 💛", "ankitata": "I’m so glad you spoke about this. I have got conned by so many beauty bloggers peddling products of Nykaa. The nykaa sheet mask burnt my face and for 3-4 days my skin was bumpy and sensitive.", "soul_blushh": "Lets promise to be honest and raise voice against the one who has this fake thing 💯", "_dhanyashree26": "@shreyajain26 The best one♥️ no hate for her", "iamfinelikewine": "Liked your video. Followed you. 🔥🔥", "mansiilleth": "Literally everyone burnt by the video has an insta story justification saga on right now 🤣 🙌", "_stayygorgeous": "@sherryshroff I hv just watched that video..ur every point is so true..brands r always go this no. Of followers not content or true reviews..n I hv seen so many people nowadays they r promoting anything just for money,I m sure they not even have tried that product..now influencers marketing is going to be corrupted 💔", "riya_rk_khandu": "We need @diet.influencer backkk!! Like, comee backk!! Btw, great video @sherryshroff !!", "wear_urstyle": "Loved your video. Even I wonder what purpose bot followers & likes solve for creators as well as brands. I get mails & msgs every day to buy followers I just don’t get it. It’s crazy to see beauty bloggers promoting 3 brands in 1 day. Which made me wonder how skin decides which one is doing wonders? Even about people promoting designer wear. Don’t you think they should be aware of at least cost of the outfit? There is long list of questions that run my brain everytime I open Insta 😬", "akriti_ranjan": "Watched the entire video and couldn't agree more with every point. More power to you Sherry❤️", "gypsycheesedip": "Thank you thank you thank you so much! You have no clue how much it means to know you're walking the right path as a content creator😭❤️", "m.kinjal": "Very well put and well said 👍🏻", "pranks16": "@reemsa1611 in the comment section on YouTube I have posted !", "hopefulseokiee": "In this house we love @aninditachakravarty for honest reviews and amazing videos.", "t.r.i.b.e.n.i": "Such a great initiative....eye opening video......lots of love ❤️", "thezeniairani": "Thank you for this video! When are we going to understand that engagement> following. Also thank you for calling Nykaa out indirectly. I've actually unfollowed few of the biggest beauty bloggers out there because they'd do nykaa unboxings and new product reveals every single week. I'm never buying anything from nykaa ever thanks to them!", "ramneekkaurbarmi": "Super insightful👏👏", "shreyapatel529": "Now all the tagged INFLUENCERS are justifying themselves and failing miserably. For ex Malvika Sit ‘official’ saying ‘why I’m tagged’ like really ?🙄n now she wants followers to find their vibe and follow those people only ! Ab yeh ‘vibe’ ka bhi ad Karo hee do pls 😂😂 @sherryshroff thanks a lot for clearing our stories from same kind of ads back to back 🙏🏻 It takes #courage to stand against the wind... FYI- now nobody has uploaded any #ad today hmmm", "tadapti.atma": "@shwetavijaynair is one gem in this fake industry. Take note you fake influencers.", "diet.influencer": "We were wondering about the sudden surge in followers, now we know 👏 Need such push and videos to start posting again. Totally agree that the platform does 0 about all of this", "tanvirandev": "Oh god this is so true. Recently I saw a couple of \"influencers\" travelling to China. I was waiting for them to eventually post something on sponsored and abracadabra all of them posted about Pantene's new range. This is why I don't follow that boho girl, aashna Shroff and a couple of others anymore. Can't trust them at all. I want to follow people who post about stuff they really like. Nowadays you can't distinguish between sponsored and organic content.", "quirky_bird_": "Loved it.🔥🙌", "luxurious_adore": "This was much needed Thank You 💕 @sherryshroff", "twiinkle_star": "Totally agreed!!!💯💯💯💯❤️", "non_existent_23": "@malvikasitlaniofficial", "king.kumkum1": "Happy to follow u ❤", "swatcat08": "@sejalkumar1195 @aashnashroff I'm sure you can relate to this. It's literally about you guys 😂", "notsoperfectmummy": "Loved ur video, brutally honest n on point", "kanishkapariani": "Hi Sherry! Loved the video and its vibe. I completely agree to what you saying. To this I want to add that even big actors and celebrities are doing the same thing. The will never use the products that they endorse. Why don’t we ever call them out. We know an actor who endorses a particular shampoo, soap, mobile phone etc never use it themselves!", "styleonmymynd": "I loved the video. First time ever I have seen a content creator talk about these things so openly. The responsibility truly lies with the viewers. I too have been baffled so many times seeing some influencers talking about a different beauty or makeup product each day. How do you know something is good or bad in one use?? Viewers too are blindly purchasing these products without thinking how this will affect their skin or hair, or not knowing the damage it can cause in the long run. I urge everyone to do proper research, read blogs as they share detailed reviews along with pros and cons, and most importantly know yourself, your skin, your hair, your body.", "komaljiofficial": "Woho!!!! 😘", "babiesbymyside_prachi.c": "Finally u said it.. Very well put.. What an awesome video... Its so unfair to people who actually buy the fake endorsement these \"most followed\" influencers do.. also so unfair to people who genuinely share reviews and experience with no fake followers.. 🙈 influencers, its such a great concept but its sad that it too has become one more paid PR activity...", "itscharuhere": "Loved it. Especially as someone who is just an audience to the massive content that’s floating around, it was quite an honest and genuine talk.", "anushka0333": "Sherry, loved every bit of it! 💕", "malinipanchbhai": "Shaurya Sanadhya will promote anything for money. She can’t even be called an influencer, Aakriti is atleast changing", "fashionufeel": "Loved d video. Finally someone said it especially brands wearing a blindfold and going after no. Of followers rather than d content and d relevance and being relatable.. serious crap", "nidhitomar03": "AMAZING!!!", "riya.jain164": "👏👏👏", "arabellajezelia": "@aashnashroff", "wanderlust_himani": "Saw this video amazing 🙌", "akansha_singh": "More power to you! @sherryshroff ❤️", "baswani_shefali": "Luved this video of yours...glad you are standing strong in the cut throat race of bloggers who dont add any value..❤️", "puja_nvogue": "Got up with this link on @komalpandeyofficial 's story. Love love love this video. You are just being you Sherry! Honest and Awesome! 🙌", "mrsglobaldesi": "Respect & Love 🙌🏼 Thankyou for talking about this sherry ❤️ Surely the best video I watched today 😇", "shaila232001": "Thanks for such a genuine review... u rock all the time .....", "tikoosmriti": "Great talk 👌@sherryshroff", "cheena_02_jpr": "@antarikshadas @shwetavijaynair @staceycastanha @shreyajain26 @sherryshroff @imdesertrose - The Squad that we can trust. These people are here to make a difference, not money!! The hunger is to create crazy content, find out amazing and phenomenal products that actually work for majority and talk about things that are otherwise not being voiced out or never were voiced out until they started the revolution. Please be this genuine, always! ❤️❤️❤️ The love and respect that we have for you, is beyond anything. ❤️❤️❤️", "catch_the_case_": "AWESOME !!!! BUY NOW PHOTO PRINTED MOBILE COVER @199RS ONLY", "thatfreespiritedsoul": "Just saw komal pandey's story and watched your video. That was like the best real talk video I have seen in a while. Also, followed you right away. More power to you ❤️", "ipsitaa.das": "Another one fake ki dukan... Literally anything and everything promotes for nykaa....beautyco/ritika amru... After this video unfollowed malvika,corallista,debashree,sejal,shaurya sandhya,aishwarya,Aashna shroff..", "mayurimaski": "@shauryasanadhya @aakritiranaofficial watch this. Learn something from this video.", "americandesimsm": "@sherryshroff your video is on point! I totally felt what you were saying with all the brand promos all happening at the same time! Thank you for this! You’re really encouraging to us smaller bloggers! 🤗", "itsswasti": "@sherryshroff ive very recently started following you .. and i just love the way you function, your ideas and how its all put together. Great going sherry. Power to you❤️", "avishi_013": "I just watched this video and I am so so glad you brought this topic up and spoke about everything that needs to be spoken about without pulling anyone down. More power. 💪🏼✨ @sherryshroff", "skinnygirldiariez": "@mynykaa @thefaceshopindia_official need to see this. The so called in your face with sheet masks is annoying AF. Chemical overload to be honest. Young girls are watching and the bloggers post like they been using those product since birth. They need to just put those masks on forever to hide from all the lies they post about shit skin care along with the fake likes, views, followers and pod comments...lol", "chatpatidiary": "Hey @sherryshroff while you've spoken about how audience can check and understand, I'd like to ask and add one thing which is happening off late a lot- Do bloggers/vloggers do a check on the brands they're working with? I know you do ( personal experience of speaking with you) but brands are copying content, products, packaging, hell even campaign but each and every blogger is promoting it left right and centre while they have prompted the original of it as well. I feel when bloggers stop and think, it'll be a reality check for brands too.", "my_closetdiary": "I usually don’t watch such lengthy video neither I create it thinking people will get bored. But honestly, loved each bit of your video and I agree with it 💯. We all need to be vocal about things we like or dislike. Thanks for sharing it . This one is my favourite video of yours ☺️", "ankita_ashish_garg": "@nykaabeauty @mynykaa @nykaafashion - the major culprit", "adi.val": "Well, Sherry - great stuff. About your commenting on @mrjovitageorge - I would beg to disagree on some aspects. I have asked her on many accounts, when she’s promoted Huda’s eyeshadows that have come out with warning as “not fit for eyes” or asked her why would she hark on her values when addressing the “brown girl” unfriendly Lakme MU but still endorse LIFW, and go promote their brand - she has been quiet. I have asked, not chastised. Tried to understand the change of heart but to date I haven’t heard. So I would also say, Jovita’s MU vids are great happy trippy stuff for inspo. Trust, I wouldn’t take it that far.. not from what I have seen in the past few months, unfortunately. But what do I know I am just a researcher. 🤦🏻‍♀️", "jesila_rathinam": "@sherryshroff i really feel sick seeing the influencer culture.... one day faceshop is good next day innisfree is good the next day clinique takes them to alibaug and release their product so clinique is good.... these look so fake to me and its done only for money... ppl are just trying to make quick money.... this influencer culture shd be stopped", "fashionpillar": "Loved the video... great content...", "nupur_pupur": "Way to go girl...super real 🔥🔥🔥", "iamswatee": "This was such an eye opening and a kickass video. Also I saw an old picture of you god knows where with long hair, SHORT HAIR ALL THE WAY!!!! Let’s make short hair the new long hair 🤣😘😘😘", "indiegoesgram": "Loved this one. From the heart and much needed. I think people who have huge number of followers should keep away from giving out weight loss,acne and dandruff dealing methods.These are conditions that need medical supervision and putting up random products or routines or what worked for one as the gold standard is not at all ethical and safe. Also a problem is giving out diy skin care products without proper understanding. Anything and everything natural, naturally derived doesn’t mean its safe and efficacious to use. So also many products cannot just be made with a bowl n whisk, store it in a bottle n refrigerate. Highly unsafe. As you rightly said, one cannot cause harm to another just by claims n non-researched, non-tested stuff. Many of these diy stuff get bad even if staying in the fridge or whatever and the colony of bacteria, fungi, mold, yeast cannot be seen by naked eye, can cause serious health problems", "aa.living\nVerified": "Verified", "bajaj_cheshta": "Spent good 20 minutes watching some really good stuff. I relate to it soooo much. Always genuine and fire @sherryshroff 🔥🔥", "swati_n_sam": "More power to you Sherry for speaking it out ❤️❤️", "pallavijainofficial": "Loved how you put about fake followers and influencers ❤️", "nikita__s3": "Thank you for this ! 👏👏👏", "plabita_borgohain": "This was one of the best content. Honest and yes authentic...hitting it hard at the right places! Coming out speaking about what's going wrong in the community...it takes guts. And you have that. Respect! More power to you!", "saumyatekriwal": "Thanks a ton! This was much needed. You dealt everything so well. Kudos! ❤️", "ishitapobaru": "This is what makes you, YOU, Sherry! Much love ❤️", "samikshamalikk": "@dietsabya i think it’s high time you start calling people with fake following and likes. @sherryshroff said it!!!!!", "beautybyarya": "The fact that #nykaa has spoilt the market and bought literally half the influencer community. They look the same , talk the same promote the same and that is deceiving. You r right , they all promote the same. They can even change a person who believes in cruelty free to promote a brand that’s not. This horrible mob mentality of yes women of nykaa needs to be boycotted. The face shop , belief , nykaa eye gel or glow serum or creams or other bs . Enough is enough! I trust only @shreyajain26 , @simplyshalini , you @sherryshroff , @komalpandeyofficial @staceycastanha @imdesertrose @antarikshadas and @shwetavijaynair . I feel you all will remain the same.", "nishagokuldas": "Thank you for this ❤️ most honest review", "accessoryfunkofficial": "Beautifully explained! Have been a fan of your work since the day one 🌈 Thank you so much for this video ☺️", "riyaaascollection": "Great information", "tejaswinigaikwad": "You are awesome! ❤️", "shurobhisengupta": "Woah @sherryshroff Kudos!! More power to you 💗💗", "payalbhattacharyamuchhala": "Fantastic fantastic fantastic post!!!", "sameena_gonsalves19": "Finally, Someone said it!! I really wish the industry shifts to organic and genuine content only! It's so unfair to the one's who are really genuine", "anisamaity": "Awesome 😍", "curldomination": "Great video. Content was to tje point. Thanks.", "itejasnamdev": "Just watched your video. Amazing 🙌 hats off to you 👍🏻. I am creating helpful content for budding influencers and bloggers, also i have commented my thoughts on the video, do check it out. I have just expressed my personal opinion there. Thank you so much for inspiring us ✌🏻😊", "inspirenotinfluence": "🤗", "cloudy_secret": "Most relatable video ever! 🙌", "shruti.vaity": "Very well put 🙌🙌", "neha_rahate": "Much needed 👍👍", "write_suruchi": "You are the best sherry! Such a genuine person!! ❤️", "chrisma.lobo": "Much needed 👏👏👏👏", "sindhuabb": "👏👏👏👏👏 you said it ! Once again ! Continue to be the true you. I stopped trusting everyone except you @sherryshroff and @mrjovitageorge ! Lots of love 💖💖", "flyingirl_12": "@shauryasanadhya gurl you have no personality and uniqueness but sponsored stories and yt videos @debasreee @malvikasitlaniofficial I love you gurl but you are promoting something every single day that you just looovvvveeee and is not practically possible", "chetasikane": "More than beauty products... I am sick of Dyson! When you see everyone on Instagram using Dyson... Its hella off putting. I know you did a collab with them as well and not throwing shade at you... You know I really love your content. But Dyson needs to tone it down, they are being tooooo extra!", "kritikamanshani.in": "It cannot get better than this @sherryshroff 💥💥💥 Thank you!!! 💞", "missshreya": "@vaanikhanna", "i__am_komal__": "🙌", "__kinali__": "Simply loved the way you put up your thoughts! I agree with each and every point you said. More power to you SS!!! ❤️❤️❤️", "the_diary_of_a_nomad_girl": "💜💜", "simplyclassymini": "I m ur true follower❤️", "jharanamishraa": "Thank you for sharing this and thank you for being you.", "bruisedpassports\nVerified": "Verified", "_richa.999": "❤️❤️❤️❤️", "anshika7": "Totally love the video. It's so damn true. Wish I could name some \"Fashion bloggers\". They are just so fake and artificial. They post content without even knowing the product. Thanks for making this video Sherry.", "luckysngh": "This had to be done. Hats off to you", "gauritg": "Loooove it, Sherry:)", "priyaajeswani": "👏👏❤️❤️", "aabhabahety": "Its my favourite sherry video yet!", "nehas1406": "It takes guts to be part of community n talk abt it...just watched the video n could relate to every bit of it particularly the endorsement part rather crazy endorsement...but kudos to u...love ur work..keep it up 😘😊"}