{"thetambrahmbong": "Did either of you even once think that it's not going to work out between both of you", "parihita": "😍😍", "colloquially.naisha": "do u guys ever fight for the ac's temperature? @sherryshroff 😂", "mscrazy_yashu": "I miss #beatit sooooooooooooo muchhhhhhhhhhhhh #couplingalong #awsomesauce", "sa.rayamaji.fc": "😍😍😍😍😍😍😍😍", "_sohini_m": "What is the one thing that you would never forgive your partner for?", "bhartiyamamta": "So excited u all are back.", "sia.merchant": "@vaibhav.talwar why so hot? :p", "beautyobsessed.sa": "Start a wisdom wednesday series and give your gyan to the youth @sherryshroff", "sanaibrn": "Why aren't you doing more videos?", "_prachii_sharmaa": "When are you both planning to have a baby ? Ps- love you bothh❤️", "ankita.rishi": "Where do u guys stand on emotional ND physical infedility", "sutonukabhattacharya": "How do you both manage to fight the routine of being in a relationship and still manage to find interesting and fun things to do after being together for this long ?", "precila_aro": "Why don't you'll show Vaibhav's mother ?", "shrutichintalapudi": "What is your ideal weekend together ?", "ayup7": "Yay finally!! Have been waiting for coupling video since long! Yall make such a cute couple 😍", "_evitize": "You both are goals😍", "shris_tea_": "which Netflix show did you guys last binge watch together?", "ashotanshroff": "Lovely", "lavhu8430": "Dubai 👌👌👌👌🔥", "trishita.tara": "When is vaibhav uploading videos on vttv!!! I miss his creative videos so much", "sunnyysideup\nVerified": "Verified", "theperfectshah": "What a great shot !!", "_shine.bright.like.a.diamond": "Since the day you met to this day, what is that one change in your relationship that is the most significant?", "magicsnowin": "As couples.. have you guys ever had apprehensions to communicate about life's tiny details with each other? Like for eg: although u are married may be an attraction/crush to the opp. Sex", "onetwistedtale": "Please do a video of shopping for each other. I know you have done that in past but it’s fun to watch.", "shreyasingh_333": "Why dont we see much of Vaibhav in your videos these days? And why no coupling videos? No cool challenges? Miss you guys!!", "shifaahmad19": "Do you guys spend quality time with each other?like do u guys have heart to heart conversation?", "whosarthakghai": "Favs😍", "bonginstates": "Hi Sherry and Vaibhav!! What are the other names you have for your dog? eg- Cookie Monster, donut hunter, sassy mama... 💕", "anisamaity": "Aww such a cute picture 😍😍", "arabellajezelia": "My bf bday is on 19th. Plz give me some tips on how to buy a present for him??", "abigail_momma": "When are you going to Seoul as a couple?", "becjurnis": "How do yall spend time at the end of the day with such busy schedules?", "shalakasardesai": "Are you similar or different in personality and likes/dislikes? If the latter, have you struggled with understanding each other or had many fights?", "thedikshamodi": "Did the two of you ever face cheating issues? Most couples do, don’t they? How did you guys deal with it?", "urmiladanga17": "Why is Vaibhav not posting on his youtube anymore?😕", "r.a.j.a.s.h.r.e.e": "Where does Vaibhav work at??❤️", "agrawalsangeetaaa": "#Askvtss please just share the link of the video u gyys did about. Ur wedding preps in which u showed the customised candies..the loaction.. I want to do the same for my parents 25th ..", "samirgandhi2000": "If you could become vaibhav for a day what would you do and vice versa ? 😂", "anoojamahadik": "Q &A", "anujarora1991": "👏👏", "manasasriram_": "What is that one place that you and Vaibhav love to visit?", "_____mangoisbae": "AND WHEN IS VT STARTING HIS YOUTUBE CHANNEL AGAIN?????", "charuisnotonfire": "Any relationship advices? #askvtss 🔥", "thepositivityzone_": "What is one of the biggest struggles yall faced as a couple?", "drswatipradhan4u": "When you have disagreement on any topic, how do you both resolve it ? How do you realize be conflict ? Who breaks the not speaking vow first ??", "astha_khimesara": "What is vaibhav's profession? What is his job?", "kritikagoyal13": "What's the best body part you like in each other? 😜", "nehpika": "how you got your first modelling assignment and what was your family's thought about it...? talk about your struggles if you can.. love you 😘", "shaista_r_khan": "@sherryshroff how did you know Vaibhav is the one for you?", "happy_quizworld": "do u guys ever feel insecure about eachother?", "notsoperfectmummy": "How vaibhav helped you through ur illness, did it make you bond more stronger?", "jainanubha_07": "Hey Sherry, what's best in vaibhav to which you are attactive the most? #askvtss", "mihishka_negi": "Travel vlogs. It's been a while.", "kaneez.12": "Have you guys ever almost broken up because of a fight? What is that one very bad fight you guys have had?", "deesmileo1": "When are going to see👪", "j.wajiha.jiia": "💖💖💖", "spantaztic": "Why haven't you guys been making regular videos on coupling?", "samidhasinghh\nVerified": "Verified", "anzi1604": "When do you plan to go on a couple vacayyyy? Can't wait to see your vlog!! ♥", "shatobhisha_7": "Do you guys get bored of eachother if yes what you do to get out of it", "archee_a": "We all know how vaibhav has helped in coming out from tb. What was his initial reaction when you were diagnosed . How did he support you in this", "priyanka_singhar": "How vaibhav helped you during your TB periods?", "akriti_insta.jpg": "When and where did you guys first meet? Also hiw did Vaibhav proposed you ?", "storiesofaisha": "do you check each others phones? 😋#askvtss", "_tamannaa._": "We want you guys back on coupling❤️", "nailswithprachi": "What is the one good quality that you have imbibed from each other? (Answer in hindi 😜)", "gulatiananta": "How is it like living together? Is it a lot of adjustment or you guys have just grown to enjoy each other’s habits and company? Love you two ❤️", "appyy24": "What would be your destination for an ultimate travel vlog?", "tanvi15945": "@sherryshroff When are you planning your next trip to your fav city NY and also go to Costa Rica as it's been on @vaibhav.talwar's bucket list for a few years now? #oneofyouroldestsubscribers #mostrawandmyfavyoutuber", "exoticworldofperfumes": "Do u abuse each other as in verbally friendly way or u play aapa aapa game ..", "juwayriyyah": "Y do u put #awesomesauce ??", "monica_saroya": "Hi!! How do you both manage your Finance.", "prernapandaofficial": "So when are you guys planning a baby? Your babies will look so cute ❤️", "the.pretty.butterfly": "top 5 best investment plans/policy for people over 30?", "go_fall_to_heaven": "Who is the person among u both...R calm in chaotic situations nd wat they mean to u in dreadful conditions#couplingalong❤️", "_ishfinity_95": "Does vaibhav like being around mars?? @sherryshroff @vaibhav.talwar", "devanshi.r.21": "How do you manage to spend time with each other even after having hectic schedules or busy days or when u travel?", "mystical_enchantress": "How is Vaibhav with Mars and vice versa ?", "photopado": "Such an amzing view with romance all over", "naina_khosla": "Would u both do nach baliye?", "nikiitanair": "Do you know BTS?", "harshita_varma": "Both belong to different cities. Where do u have your heart at, Delhi or Mumbai???😂", "1993suparnapaul": "It's been so long that u too appeared together...where have u been", "maitreyeep": "Does vaibhav like your short hair? 😉", "cuppavesham": "How do make major decisions? Who takes the final call?", "shivani_pradhan_": "What habits do you still have from your childhood?", "namrata_sachdeva13": "How did Vaibhav deal with your TB? We've known your journey and how you felt; however, would like to know what was going through his mind as he was the one who gave you strength.... Love vtss❤️", "rita_rejuvenates": "I love Vaiibhav he is one hell out of a guy. Do u think a guy should be like him", "embeekae": "Both you Leos don't face ego issues? How do you deal with each other's arrogance.. if any..", "apurvchatter": "When you both fight how do you coupe up after that do you stop talking to each other or resolves the issue immediately by one saying sorry to another", "avniiparmar": "What is your best travel destination ? love you both ❤️", "snackshii": "Does your professional life ever overlap? Would you like it to?", "hetashri_i": "What is that one thing you guys wished you knew about each other before you got married that would have made the transition easier?", "insta_paro": "How do you both keep up your CQ( cuteness quotient) thro the many years you have been together 😍 ...my #favouritecoupleforever ❤️", "sharithas123": "Wrchv u been vaibhav......😮😮😮😮??????", "diksharickshaw": "When can we expect some regular coupling challenge videos? Miss those!", "sushant_sd": "Where were you guys for so long....missed you two❤️❤️❤️ which Netflix series you wished was a reality #justasexperinceforonce😉🙃", "nikitavashist": "How do you both ensure you're always there for each other despite of your busy lives? And please make more videos! Miss you two♥️♥️", "lime_walls": "What spiritual/motivational content do you consume? (In terms of books/podcasts etc)", "instaankiiiii": "Why u both stop doing videos on coupling ? I miss u guys, u both are legit #couplegoals u both shud do videos regularly plzzzzzzzzz @sherryshroff @vaibhav.talwar", "shadafaq": "What was the first movie you guys saw together? Any show that u prefer watching together?", "natashashweet": "Why sherry has cut her hair so short and not growing it again? Does vaibhav love short hair or long hair? Im a new subscriber and watching all your old videos, your hair were so long back then.", "sakina_ibrahim_merchant": "My favs", "anujacob10": "What's the best in your relationship?", "manisha.ecstasy": "As all individuals, me and my husband are different personalities. Our opinions differ sometimes, which gets difficult to resolve. How you both work on your differences?", "pooja_travelbug": "One thing u love & hate about each other", "aleyakanji": "Why has vaibav been so mia? Hope all is well ❤️", "sowj_25_04": "When are you guys going to fully get into doing more videos on coupling like before....we are missing all of them", "shrutikhandareofficial": "You two ♥️ | Best relationship advice?", "design_your_nails_by_isha": "Which is your (both) next travel destination ? Lots of love #askvtss ❤️❤️", "mathangi13": "I am sure despite that butterfly like image that I have of you seeing your videos , you must have share of sad phased as well.. Can you pls tell us What is that one thing that has kept you motivated during dark/dull phased of life? @sherryshroff ❤️❤️ #AskVTSS", "richa_sonowal": "How to maintain a long distance relationship? Have been in a LDR since 5 years😭😭", "sayani__sinha": "Ok so @sherryshroff if you had to choose btwn anyone you doggo or @vaibhav.talwar then who would tht be and why??", "finufatemaa": "What is that one thing you both always wanted to do but haven't done it yet?", "sounhsansar": "Which Bollywood couple inspires you both *-*:))?????", "tiasachdeva11": "Where have you guys beeeeeen? 😭😭", "hash.0038": "All time favorite😍😍👌", "ziawardha": "All relationships have problems, what has helped you both survive and be strong all these years?", "garima_gupta_03": "Do u both get possessive as you are always surroundee", "pristine_blues": "Do you both do pranks together or fun stuff when you out or home", "inmyworld_neha": "What is one thing you love and hate about each other while traveling together?", "nayak_chinmaya": "Hi Sherry!! Big fan of yours❤️ My question is, how has marriage affected yours and vaibhav's life in terms of lifestyle, day to day small things etc", "chhota_bachcha": "When are u people coming back on coupling?💜"}