{"aromaoflife.blog": "Sorry to say this but @sherryshroff .. why don't you protest when so many soldiers are killed in pulwama? When stones are pelted at the army?? When these nations mentioned are all Islamic nations having no secularism, so isn't it logical that their minority would be non muslim and needs help!! Is India that developed a country that we can accept anyone?? At least we are trying to help these refugees by giving citizenship, and even Muslims of these places can get citizenship by naturalization of 11 years.", "nikki.ca.in": "CAA is a govt political agenda to grant citizenship to “persecuted minorities from 3 countries” .It isn't discriminatory. NRC is a SC mandated executive exercise which is aimed at identifying “all illegal immigrants”( despite of their religion)It is a legitimate fear in many eastern border districts that immigration has altered demography so much that Indian citizens are no longer in majority or will lose majority of things stand as they are. CAA+NRC isn't going to benefit any one group of voters. The need to give citizenship to persecuted minorities has been bipartisan. I can't see why anyone would stand against that. CAA is only for people who has migrated before 2014 , they are already in our country ,country is already spending money on them. 2) about NRC in Assam I would just say that search for number that how many illegals immigrants has migrated in last few years , it’s not threat to any religion but it’s threat to the citizens of the state - not having a single document is not justified excuse - you can still bring two witnesses in your favour for verdicts .  so called Educated People who have had read the act carefully wouldn’t have mislead people on the streets in name of religion . this is creating hate and chaos , don’t they understand how they are impacting country’s economy now ? These people either hate current government ( like you )or they haven’t understand the reason behind these acts. Again it’s not discrimination to any religion it’s act for “persecuted minorities” ! Note : these influencer won’t get affected , but people on the street would , one day of curfew has direct impact on their rozi-roti #notoprotest", "navyaaa0": "You too are encouraging stupidity and misleading people GREAT @sherryshroff what is wrong with you?? The funny thing is Universities having reservation on the basis of religion are talking about secularism. Stop posting shit and stop fooling people by saying \"secularism \" first you get your facts cleared about CAA . Also unfollwing you because you are misleading people @sherryshroff", "curlymalayalee": "Are you going to call all those people without proof as illegal immigrants?", "ashapagi4": "👏👏", "nupurvupur": "A lipstick swatch or hm shopping haul video would have been nicer and more appropriate for “influencers”", "nupursumukh": "T", "snehal_161215": "Dont do this...have an opinion but dont spread wrong piece of information...just writing that i dont want to instigate violence doesnt work...u need to act that way...", "nigga__higa": "👏👏👏👏 thanks", "alifa184": "So proud of you sherry....we need more influencers like you", "pitambarashekhawat": "Sherry please try to understand that this bill is not against any Indian. Indian Muslims don't need to worry ...", "anumansari15": "People are trying to Understand CAA & NRC seperately. However, both are interlinked. CAA is to given citizenship to Hindu, Jain,Sikh etc but not muslim of Bangladesh, Afghanistan, and Pakistan. However, NRC is for the people living in India to prove their citizenship. When A hindu or a sikh or a jain or a christian will fail to prove his/her citizenship, there will be CAA to help them and given them docs for the same. But, if a muslim will fail to prove his/her citizenship s/he will be called illegal and will be thrown out of the nation. Where is equality? This a clear breach of \"right to equality\", imposing section 144 to parts of different states is a clear breach of \"right to expression\". I am proud of you @sherryshroff that you are one of those who is speaking up against this clear discrimination. If our Voter IDs are not the proof of our citizenship, then our votes were invalid too, the elections that held were invalid too and the govt that is creating so much of chaos is INVALID as well. #indiaagainstcab #indiaagainstcaa #indiaagainstnrc", "suboohi_": "@sherryshroff People like you give me hope, sherry. At the time when maximum fashion/lifestyle bloggers are being mute spectators just so that they dont lose on their fans/followers, you speaking up means a lot. Let the haters hate and continue with their abuse. But know that you deserve respect.", "liza_dutta": "Assam just got back internet today", "vandanavikas": "If you think only muslims are singled out, please gather some more information on why them only! And are you talking about indian muslims?", "yaatris_": "A month ago, when there was a rape case happened with a doctor. Then nobody posted about it. That time nobody stand out. But now, when something good is happening then all these influencers are standing out. 👏🏻👏🏻👏🏻👏🏻 A big shame 👎🏻 iske bhi paise mil re hai ya publicity bhai 🤔", "cuzette.beauty": "Hi, @sherryshroff I’m from Cuzette Management.🥰 We would love to collaborate with you, kindly please check your DMs. Don’t worry its free of any charges. ✨", "namrata___joshi": "Dear Sherry pls watch this video by supreme Court lawyer Subuhi Khan. It might change your views. You being a lawyer you should have analysed it before putting up any hate. Sorry if these words were harsh. https://m.facebook.com/story.php?story_fbid=456812821651472&id=379253735904493", "siddharthajoshi\nVerified": "Verified", "akshatashenvi": "But the bill has nothing to do with our Muslim citizens according to my understanding... I'm just trying to educate myself here by understanding the situation rather than picking a side..", "swahavlogs": "Guys she is just sharing her views don't ask her question back . You may agree or disagree . I am confuse should I oppose or agree.", "bulbulraza": "Thank you for protesting against it, Sherry. More power to you. And to all the haters here, just like Pankazz (@ankushbahuguna) says \"Jusshhhudyomouth\"", "pausebuttonoflife": "❤️ I am so happy to be your follower! An influencer with a spine to stand against things which are wrong. Very few people have the guts to do it. Keep up the work sherry!", "muskan.khajuriaa": "How can you people can stoop so low for PR and marketing ...mtlb sab celebs bol rahe hai iss bare Main Mai bhi bol deti Hun interlectual lagugi🤔(mtlb yeh log toh desh ko hi khaa jayege)....waise poora law padha bhi hai Jo yahan photo post karti phirr rahi ho ....", "saumyasingh024": "@sherryshroff it's really sad to see you ppls call yourself influencers.... you dont realise what responsibility u carry on your shoulders.... without checking into the facts .... you ppl just belief what goes by your ears and behave in such a disgusting way..... may god bless u with some wisdom..... you guys are always ready for protest and revolt.... but never do anything for your nation.... atleast dont become bollywood copycat... if you have guts in you come and join upsc civil services and change the system come and join politics and change the system.... dont act like this.... you as a citizen is a disgrace to ous..... without checking facts just mongering around.... ... padho likho hoshiyar bank samjho cheezon ko...", "priyasharmaa_17": "@sherryshroff How come all the influencers are standing against CAB just because it’s degrading to muslims community? How? How come all have the same mind set to just oppose it?  Half knowledge is always dangerous. For your information NRC is only applicable on Assam Bangladeshi muslim refugees. It has nothing to do with muslims living in India.  Crazy how entire thing is left to Hindu muslim issue.. but nobody cares about what northeast is going through. If you are standing against CAB then atleast mention northeasters states. Kindly, research before posting on social medias because people like you misguide other people. Kindly read the entire CAB document, it’s history and how it all started after two partitions of India and what decisions congress took back then. Don’t just post things just to follow the trend.", "sherryshroff\nVerified": "Verified", "isandip_life": "Tell me two thing 1. What CAA says in the bill 2. Why do u think it has anything to do Indian muslims ?", "miss_p_targaryen": "@sherryshroff too many islamophobics and brainwashed bhakts in favour of a hindu rashtra spotted in the comment section. Do not waste your energy on them. And thank you for speaking out.", "harmeetkaurhundal": "👏u r so brave. U stood for injustice ❤️", "tiwarisomya": "Problem is that u guys have lack of knowledge it’s not against Muslims who are staying in India it’s only fr the Muslims who shifted after year 2014 they need to show the documents and government is nt telling to leave the country it’s only that they will not be getting Indian citizenship. That’s bcz the Hindus staying in other 3 countries are very minute in numbers and they are in miserable conditions so gov wants them to rescue first so that they can live better life so what’s wrong in that.. plz guys go and get the complete information and then do all this drama if you guys will do like this then what will be the use of this law. Go and see the condition of Hindus staying in other countries", "zorico13": "#nocab thank you for speaking up Sherry", "pooja.banerjeee": "I understand the protest in Assam, but you guys are acting like duds. And it hurts to see you in this herd of sheep. You could have done your research, I wish. Does the Act say that all Muslims will be deported or deprived from their rights? NO. A LOUD NO.", "lalitaantil42": "🤦👎", "shanayas_\nVerified": "Verified", "neethujacob": "Thank you sherry. Its disheartening to see that there are still many around who doesn't see the hidden danger when NRC & CAA come together. Those who support these, i would request to read the history of Germany and what circumstances led to the holocaust.", "tina_thakur90": "Kudos to you dear @sherryshroff for speaking up and taking a stand. Not many bloggers would do that and I always knew you are not like them. More power to u 👏🏻👏🏻👏🏻👏🏻", "speckledskies": "@sherryshroff thank you so much for being a responsible, socially aware influencer! ❤️", "shas7ch": "Raise your voice against this evil (NRC + CAA)", "vasundharaks": "This girl is a Parsi and I am not sure she even recognises the fact that the Govt. is giving citizenship to Parsis who have suffered for a long time in Pakistan. No wonder Parsis are the least united community. She is rooting for Pakistani Muslims immigrants who are a great threat to this country. All the terrorist attacks which have happened in our country had the support from Pakistani muslim immigrants to implement the attack. Pseudo secularism is a cool thing for people in fashion industry and bollywood. This is just another instagram photo op.", "tejuavadhani": "gonna unfollow", "smile_yheart": "U may loose many followers after this, people may unsubscribe u, but u stood for injustice and hats off, read most of the comments and hatred . All I want to say that we should respect others opinion, be it positive or negative. And before dividing us into religions lets not forget we all are Indians", "anshul.shailendra.tomar": "We support our government dec....don't spread rumours", "anjumfarooki9": "Kudos to you for voicing this issue. The bigots attacking u here r blinded by their religious and political bent. Will never be able to see how the constitution of India is being breached, unlawful acts of d govt and how it is not good for the country.", "alishba8037": "Being a pakistani muslim i seriously admire this... Hindus sikhs are safe in pakistan and have their rights so muslims should also be safe in india", "saranyathiyagu": "U ve a huge fan base n so u have huge responsibility to be broad minded and knowledgeable. Know the background before protesting and provoking ppl", "ahmsimi": "Omg the amount of hate here is beyond my understanding. Nrc is gonna cost the entire country crores of rupees . The economy is already in its grave. So proud people of mumbai came out today speaking against NRC and CAA. Good work sherry!!! 😊 be a resposible citizen not a keyboard warrior.", "modan1029": "🙌🙌🙌🙌", "kelsaangdolkar": "Wow ! Hats off sherry! Using your voice for right purpose. My respect for you has gone to another level. Thank you. 🙏", "sanaibrn": "Really surprised by the comment section here.. do you not realise that there are a lot of poor uneducated ppl who have no proper documents and no way to prove that they are Indians.. they are living here and contributing to the Indian economy.. if you want to make a non porous border for future, it very well makes sense.. but denying ppl reaiding here for ages just because they don have the papers is mere cruelty.. and the reason why it's singling out Muslims who are residing in India is because others can still get citizenship from refugee status.. but Muslims can't.. there are detention camps built, in which donno how long they'll keep, and the only reason being they couldn't produce papers, may be their spelling is wrong.. n you feel this is all correct.. #againstCAA", "hiten_krishnani": "Speaking about something is is TOTALLY A RIGHT THING but atleast need to learn something about it before giving a statement😂🙆‍♂️", "manasv_i": "It was an amazing non violent protest 🔥❤️💯", "couchpotato__17": "Yes speak up. But the way these protest have turned so destructive and violent towards my own country. Im sorry to say not gonna support them at all. Thanks and Goodbye", "simranparora": "Damn Sherry! So many bigots in the comment section. Don't waste your energy on them. Save it for the big fight! 🖤", "sujata.sawant": "Can you please read the whole new amendment.. I know you are a lawyer. You might have read. But still this bill has many other side also. Have you seen how many people are trying to enter from Bangladesh, Afghanistan pakistan ?? These are Islamic countries trying to demolish other religion.. stop being so blind secular.", "ambicagulati": "Yes.. good to see Mumbai standing up", "pranureddy9": "Pakistan doesn't need to fight india from LOC.. They have enough loyal supporters inside India... #CAA #NRC.... I support #CAA", "fathima_mohammed__": "#rejectcaa #rejectnrc", "bansal.akansha25": "Really disheartening to see this post. Sharing my point of my view too. At sensitive issues , when you have lot of people following you , its better to refrain from any extreme view , especially one that is promoting protest. When the protest is violent in most places. Its not a silent protest that is going on.", "ikomalkakkar": "Stop saying anything just for the sake of it mann please!", "shristikaushik01": "Without any reason you are opposing NRC. Atleast think of our country and citizens residing here. Your stupid posts are warming up the atmosphere, so kindly think off before posting anything.", "heena_bahukhandi": "DONT SPREAD RUMOURS", "arti.g.agrawal": "We support CAA.. don mislead people", "deepika.raman": "Thank you for braving the internet trolls and speaking up. You are an inspiration🌼 #rejectcaa #rejectnrc", "r0za.r0za": "@sherryshroff you go girl ✊❤️", "sumaiyyaahmed_sj": "🙌🙌🙌🙌🙌🙌", "adithimoogoor": "More power to you @sherryshroff 💪🏽", "deepagurnani\nVerified": "Verified", "iamkalyourpal": "Omg the amount of people attacking you without any reason. Please go and read about NRC and CAA. Then comment here. And even if you have different opinions, go and post on your page. You don't have to be do rude. I wish I could be there Sherry. I asked many friends to come along. No one was free or some were out of town.", "the_fierce_lioness": "Dear social media influencers pls read and understand what caa is. This act provides citizenship to migrants who have come to India before 2014 because of *religious persecution* from 3 countries - Bangladesh, Pakistan and Afghanistan. Please mind that these 3 countries are Muslim dominated. That's why Muslim migrants are excluded. and other religions mentioned in the act(hindu, Christian, parsi, jains, Buddhists.. ) are a minority there. If they are ill treated there and wants to reside in India, this act provides just that. By bringing some changes to the citizenship act. Muslim migrants who want to stay in India can do so by naturalization process that is staying here for 11 years. That nowhere means Indian Muslims are singled out.. This is not about citizens in India... This is about migrants. Without understanding that u still say reject caa... And what about NRC.. U say reject that too.. FYI: North east people fought for NRC( which is meant to deport illegal migrants irrespective of religion) both Caa and NRC are different. North East people are protesting because they fear if migrants are allowed to stay in India with this act. But No, the CAA is a separate law and NRC is a separate process. The CAA has come into force nationwide after its passage from Parliament, while the NRC rules and procedures for the country are yet to be decided. The NRC process that is going on in Assam has been implemented by the Supreme Court and mandated by the Assam Accord. NRC has nothing to do with any religion at all. NRC is for every citizen of India. It is a citizen register, in which names of every Indian will be recorded.Please Don't mislead people . half knowledge is a dangerous thing", "aninditakashyap": "#CAAprotest has been going on in Assam since 11th December. There was curfew till day before yesterday. 11+ people were killed by army for protesting. No banks, no colleges, no schools and NO INTERNET till today. But no National Media cared to broadcast it or non of you cared raising your voices for us. Why???? Because our cry was suppressed. Our protest were peaceful and we are from Northeast. No body cared about it.", "_theplanedriver_": "Proud of you. You are one of the few who are speaking up!", "terrificaiman": "❤️", "himanshisingharora": "Wish I could be there! Keep up the Josh, Sherry! 💯❤️", "preethi__z": "What is the reason that ur opposing..... Tell me", "fatsboot": "I was there!!", "roohinajiya": "So proud of u sherry ❤️❤️", "aartirathod2016": "Why Sherry?", "impooja_vicious": "I support #CAA 🙌", "liz_infinitehearts": "Thank you for this ♥️ one of the reasons we love u Sherry 🙌", "yashaz30": "@sherryshroff i love you because of this my favourite❤️ together we are stronger.", "shenanigiggin": "Why ?"}