{"shinjinisengupta": "Favourite perfume/scent ever?", "farahazimf": "What is the disgusting thing u did and do not regret doing it?", "vedikagurav": "Which lens do you use with your canon 700d to film your videos??", "august21xp921": "Do y'all plan on having children?", "little_miss_israili": "Hi. I am a big fan of yours. In your view which are the 3 best moisturisers for face. I have oily (sometimes combination) skin.", "supersiyaraa": "How do you manage your expenses", "simransinghpatel": "I am a major @thecwriverdale fan like you. What other NETFLIX shows am I likely to like? What are some of SEPHORA's best and must try skincare products? Has a hair spa ever made a differnece to your hair? If yes, where on Earth was that? Have you tried the protein Yoga bars yet? Can I find better health bars online? (Preferably chocolate) What habit/product would you recommend for a more sound sleep than usual? Can Zane ever be on a GIVEAWAY? (But who'd want to give that away! P.S he's my favv baby)", "sadhvinarula": "Whats your reaction to people who are hating on your new haircut ???", "therealkritigandotra": "Choose any one: Instagram stories/Snapchat stories/Facebook stories 🌻🌻", "prasitamukherjee": "Who's your favourite Indian fashion, beauty and lifestyle youtuber other than you ?", "crochetcart": "How do you manage your finances after marriage and what are the differences from when you were single? #asksherry", "sethi_purnima": "Which bollywood movie is ur favourite ? #asksherry", "mehek9901": "What do you do after a bad day? #asksherry", "muks_d": "Hi Sherry why dont you watch bollywood movies since ur sister is such an awesome celebrity stylist and works in bollywood??", "the_rightbite": "@sherryshroff which is a good hair straightener.?", "rainbowandsunshine_": "@sherryshroff please suggest some good youtube channels to watch! Apart from you ! Thank you! #asksherry", "ridhimaamohini": "Hi @sherryshroff what tip would you like to give me considering i am a budding youtuber? 💕", "sanjana_edara": "What brands of moisturizers top the list for odourless and light texture 😊", "eeshasinghh": "Top herbal skin care tips and tricks @sherryshroff #AskSherry", "disha._29": "Whats your fav colour n what do you hate the mostttt about Vaibhav", "a_l_i_n_a___s": "I am a big fan of urs ........my question is- who is your bae.....and who is ur homie", "siadayal": "Why did u cut your hair ? Tho u always look amazinggg in everything ❤️", "keerthana_chamarthy": "what did you first notice in a person?? @sherryshroff", "soundarya_krishnan": "Have you tried investing in crypto currencies?", "nanhegde": "Hi Sherry! I have 2 quesrions: 1. If you like a brand and want to collaborate with them, do you get in touch with them directly or do you wait for them to contact you? 2. Which has been your best trip in terms of food and why? ☺️", "mushkan.3": "what is your height?", "tina_j4488": "How u and Vaibhav met first time and how u get married ?", "sweta.murali": "@sherryshroff who is your current favorite youtuber? Why? Any new youtube channels you came across got addicted? #Shroffers #asksherry #sherryshroff @sherryshroff", "taniya_live239": "How do you maintain and take care of your hair", "priya_mohan_parmar": "Why did you cut your hair? And from where did you get your inspiration from ? 😘👍", "munibashakeel": "Please do a series like cooking with Sherry.", "shri_shti": "Where are zreh and zane?Some fun videos with the kiddos pls..❤😘", "asmitha_koduru": "What is ur hg skincare product dat u can't live without?", "anivrita": "How come you've never done anything to your hair like permanently straightening it or smoothening it? You've been a model so I am curious why you never got anything done to it.", "selsharock": "1.have u had depression or anxiety.if yes how did you dealt with it 2.when you sit in your couch relaxed then what do you think most about..any incident,story etc 3.Which is your fav north INDIAN and South INDIAN food 4.have you felt any situation in the past which you want to change", "sayli_gurav": "#asksherry how has youtube changed since you've started? And what more do you expect from the platform/any changes that you would like to make to it?", "myhappylilworld": "#shroffers What is the reason behind you starting YouTube?", "priyankadanane14": "Do you feel that Not knowing how to cook creates problems n makes you more dependent on someone?", "oshincognito": "Can u pls tell or link the youtube channels of other 2 girls who were with you in Malaysia maybe in this vedio or somewhere? Love u @sherryshroff #shroffers #asksherry 😍😃", "vally_baskar": "Being the foodie that you are ..how do you manage to maintain your ftv model body?", "anxnyajain": "#asksherry what is your dream vacation", "shifaaaaxo": "R u in touch with other indian YouTubers? #asksherry", "toiyaba_1599": "In one word describe the life of a YouTuber. #asksherry", "peeyaguha22": "How are you planning to celebrate your anniversary! And what camera do you love to use to shoot your videos?", "swatifuloria": "About your permanent hair removal. Would you recommend your followers to go for it? I am planning to do it but I'm not sure of the total cost for it. Need an expert advice", "mallikachhabra": "How tall are you? #shroffers What's your diet?", "ishaanasoodmajumder": "How do I clean my make up brushes? They lie on my dressing table and I feel like they transfer all the dust to my face. Any tips on maintenance ? How do you keep your brushes clean ?", "ruchi_mehta013": "why did your mom's first marriage fall apart @sherryshroff", "poulami.maz": "Plz do mom in law tag", "voyagerinvogue": "Which is your favourite perfume? #AskSherry @sherryshroff ☺", "samitaaa.15": "Sherry how do u manage hatters", "ameeparikh": "Do u follow a diet ?? What kind off", "eqra.mehveen": "What’s you personally philosophy in life ?", "subhakruthi_5": "Hi sherry..tell us something about time management and share your experiences from college days.. It would be so much fun to know about it.. @sherryshroff", "divya.hoon": "If apart from YouTube you had to find a job .. what would that be????? @sherryshroff #AskSherry #Shroffer", "aayushihemnani": "Competitions has been increasing in the indian youtube market !! How do you deal with you know increasing pressure and still staying relevant and true to yourself?", "rachna1102": "I really love your short hair and want to get something like that done for myself but i dont think ill be able to pull it off likr you? What do you say? Get it cut?", "simarmadhok_05": "Game of thrones .... friends..... suits ..... narcos .... crown . Rank them", "kainath02": "#asksherry ! I know for a fact that u r a big time foodie, but then where does the food actually go? U look so thin!! Love u lots 💝💝", "neela.naik": "Wat plans for your anniversary?😀💚", "aabrah_": "C I have concerned many dermatologist but acne scars r still visble on my face !! N 2ndly one dermatologist said me that to go for lasee but I fear like what if there b side effect ? How was ur laser experience ? #AskSherry #FangirlMumbai ❤", "aishwarya.bhanushali": "Best 5 diet things I can do to loose weight...", "tresa_3998": "At what age did you start to know which products to use for your skin, basically how did you start?", "ksarovar": "@sherryshroff @vaibhav.talwar how often do you quarrel", "farooqaaliya": "How do you afford to travel ??? #asksherry", "shaileeshah93": "What is the age to start using anti ageing products", "coffeeandbooks338": "How to stay positive in life??", "aprameya.ramesh": "Do you ever think you might get bored of doing YouTube?", "optimismrocks": "#asksherry If not YouTuber, what?", "sharithas123": "Hw about your planning for babies", "styleinsense": "Can you do some lookbook on YouTube?", "debanjanabhattacharyya18": "How you maintain your health while travelling???", "myla_isha": "Hi! How do you deal with stress? Bdw love ur work. ❤️", "katyayani.rana16": "Your current read? @sherryshroff ❤️", "sujatayadav17": "Who's your favourite GOT character?", "eishitaa": "What's the most often heard annoying thing?", "praj06": "Your favourite Instagram page", "delicious_home_bakery_": "@sherryshroff #shroffers #Asksherry if you don't mind me asking you which is your most memorable moments of your childhood and would never want to forget it all your life.", "booktacles": "What is your happiness therapy when you feel low?", "swimmi_dew": "How to treat active acne n acne scars..? @sherryshroff ..lov u sherry..big fan of u", "divya.2506": "How old were you when you found out that santa wasn't real?😂#asksherry", "diyankaapurbapaul": "#Asksherry #shroffers My question is : since you get to attend lots of events and meetndgreets , did you ever face any kind of wardrobe malfunction ? If you did then how did you handle the situation ?", "_shonyha_": "#shroffers where would you like to travel alone? Why?", "4_wanderlust": "#shroffers you recently got laser treatment done . Will that cause a side effect on your hormones and mensuration and pregnancy?", "saniya1208": "Your favourite indian tv show?", "rakshandha.rawat": "#shroffers You and Vaibhav are 💟 my question is - do you guys fight?? If yes who apologize first?", "_.banziiii._": "What do you like more? Cats or dogs?", "bhagyahegde5": "Do you feel peer pressure..if yes how do you deal with it. How should people who have peer should tackle it..", "mekehyata": "Why don't you ever wear nose rings? Might look good on you", "hey_swapnil": "How do you plan to set yo videos 10yrs down d line#AskSherry @sherryshroff", "chandanijaya": "#AskSherry how to avoid negativity in the house.??", "singhpriya91": "@sherryshroff If the world is to end today what are the last three things that you would like to do??", "anjali.balu": "Can you suggest a clothing for a school friends re union ?", "i_am_priyanka.s": "Where do you see your self in 5 years? Like what is your ultimate goal.", "footprints_on_sand": "Who was your favourite teacher in school and why?", "heena_sachala": "What's that one thing u can never forget from your school days ?", "padmamurughappun": "What’s the best and worst beauty product you have ever owned? #Shroffer", "urmiladanga17": "@sherryshroff what is the weirdest thing that you have done in your life?", "manvi_grover": "Do you and vaibhav like dogs ? Why don't you guys have a pet ?", "mundhra.richa": "@sherryshroff #AskSherry #shroffers love the work u do and the way you handle your personality.. my question is... list down 5 thing that make you laugh out loud...", "kaurajahnvi": "If you ever had the chance to move to some other city or county where it would be? #snapfam #asksherry", "r.a.j.a.s.h.r.e.e": "What you have to say about the growing women attrocities in India?", "aarushibaisla1994": "@sherryshroff Have you ever slept on the same bedsheet for two days straight?? haha! #asksherry #truefam", "deesmileo1": "Hello sherry i have always popped question on ask sherry n u never take that so once again im trying #asksherry vaibhav is good at dancing but hardly see you dancing...elborate about your dancing skills", "tvishasethi": "Hey sherrryyy! If you're answering this then you also must know that your videos are always so much fun to watch. And I want to ask you where is one place you've always wanted to visit and if you do then with whom?💖💖", "s_kru31": "What irritates u d most?", "darshivichhivora": "How do u manage Home n work n shoots ...? #shroffers", "missdeepthoughts": "What all preps you need to do before filming a video?", "ashxo.xo.xo": "When are you coming to chd?!?", "ayushigupta910": "How do you get rid of your facial hair?", "_jyoti.sharma": "Hey Sherry.Love all your videos 😍😍 U and @vaibhav.talwar look super cute always 😍❤ My question is : what were the formalities for the lawyer in your marriage ? How was all that arranged ? #asksherry", "mahrukh_30": "Give some motivation tips😍😘... stay blessed😘❤❤❤❤❤❤❤❤", "_kita_j": "Hiiii sherry!!! I absolutely love the way you conduct yourself. I wanna ask you is there anything about your husband you didn't know before your marriage, like some funny annoying habits!!", "karnikk_99": "How do you maintain your hair?", "badmaaash": "Would you ever collab with me? 😋😋 #AskSherry", "punjabineelam": "Do you get body shamed? And how do react to it? Love you❤️💋 #AskSherry", "_anamika_saikia_": "Some of best reasonable price handbags brand #asksherry", "shrutimangla": "What does youtube means to you? Describe a little bit of your story. #asksherry", "nini_1199": "What is one talent that you have and you think nobody else would #AskSherry", "shaifalisharmaasr96": "Who is your fav. House member and why???", "pragna.paladugu": "What is that one secret you never told anyone..??", "apoorvakrishniya": "How’d you grow on YouTube?", "theidyllicjournal": "Also, why did Vaibhav stopped uploading videos on VTTV? They used to be awesome! #Asksherry", "khushimehtaa_": "Your favourite Bollywood actress", "alisha_khan1796": "Hi sherrry.. my question for u is will u continue YouTube after kids... #asksherryshroff", "saywhatbeauty": "What's your ultimate skincare tip? Something you ALWAYS do.", "komalified": "What was going in your mind before cutting your hair this short ? #asksherry #youlookamazing :)", "mirnalinigairola": "How do you deal with people who keep bugging you with \"why did you cut your hair short...you had such beautiful long hair\" question ps_you look like a rockstar in this hairstyle 🔥", "aarushi_gambhir": "Will you colour your hairs in agency way/colour....luv u😍😍😍😍 #asksherry", "vidhi.018": "Why did you quit modelling and chose to be a you tuber?", "kaavsv21": "Love u forever @sherryshroff 😘", "vinikaaa": "@sherryshroff u and Vaibhav are my favourite couple of all time. And my question to u is when u guys are coming to Pune plz do a meet and greet. Plzzzzzzzzzzz @vaibhav.talwar @sherryshroff", "_star___ship_": "About your law career😅", "ii.shruti": "you enjoy car rides or rickshaw ride? #asksherry @sherryshroff", "dreamerrdrug": "Hi pls check my blog www.dreamerdrug.com and share your comments too i will appreciate that❤️", "dhanalisurve": "#asksherry one thing u wanna say to beginners starting their YouTube channel", "sadhviaroraa": "All about laser , cost , effects and results", "theunconventional_tribal": "What is the weirdest type of food that you have ever tried?", "raina_parekh": "Your New hair cut or the old one? Which one do you prefer? Lots of love.❤️ #AskSherry", "peachesindia": "I wanted to know how do u travel so much. Like do companies approach you themselves or do you approach them. I know youtube doesn't help you earn much but what else would you suggest someone who is just starting out ? Does posting a lot of videos help? Or posting few videos consistently helps ? ☺", "teju_7704": "#Asksherry ....hiiiiiiiiii sherry dii OK Question is how is your life ?? Are you living the way u want...?? Explain ......🤗🤗😍😍😍🤔🤔🤔🤔🤔🤔🤔🤔", "whiplash5897": "@sherryshroff", "__aasthakapoor": "Will you ever alter your appearance through plastic surgery / botox or in any way?", "thehappytrooper": "Your one of the few youtubers who isn't a complete sellout by making sponsored videos every other day. Still honestly it's a wonder how u make money ? I know you've explained in the past but it keeps me wondering as u don't do paid product reviews in every single video like the others do. Your content is very original and organic. #asksherry", "snigdhachanda01": "#AskSherry hi Sherry so the question is What is ur greatest strength nd weakness ?? I love u 💗", "1001_beauty_wishes": "Do you ever get bored making videos? What keeps you going in this domain when alot of the times the work is pretty repetitive?", "hisgrace07": "Ur favourite BOLLYWOOD actor, actress, film n song please...U never talk about it...!", "phoenixinthemortalworld": "Can we expect you, Anaita and Roxanne to come together for a sister tag anytime soon? Please try and do it! You could maybe video call them and record it too! I have a sister and love watching sister tags! Very relatable! Pretty please! And yes, I love your content and you. Original, trustworthy and fun. :) ♥", "aisha41294": "#asksherry how do you react when you are angry with vaibhav? Like when you expect something from him and he disappoints you...", "thebhoomijhaveri": "How is ur bonding with ur mother in law?", "ananyam101": "Pizza or burger for life??", "_xnoushkx_": "What do plan to do for your anniversary this year.@sherryshroff #asksherryshroff", "shubhangibhatnagar": "Has the adpocalypse hurt your channel in any way? Do you think YouTube will be enough to sustain you in the future? @sherryshroff #asksherryshroff", "the_joyous_times_": "Wonder woman or justice league #shroffer", "neharocx92": "Ur favourites skin care brand ??", "surbhi.agrawal5": "detanning procedures? and weight loss tips please.", "meghainsights": "How far is your new house from your old house? Also how’s your relationship with your mother in law? #asksherry", "procrastinatorbymood": "Archibald or jughead? And why #asksherryshroff", "dishaa.2403": "Do the brands that you promote/endorse, in return they too promote your youtube channel or not? @sherryshroff #asksherryshroff", "s2t_09": "#asksherry HOW TO DEAL with question like ....when are u planning for baby? I m also married nd i m fed up now with dese questions,where ever u go ppl will same question, even some of my friends have child now ppl asking her when his sister will come or when her brother will come ....some times its very annoying...ppl should understand dat baby is very big responsibility and couple shud go for it when dey r mentally, physically and financially ready for it.", "drashtidesai23": "When was that one single moment when you knew that Vaibhav was the one? Also what would be the best and economical tripod for a dslr? #asksherry", "prernasingh_": "Which is the best place you have travelled so far ? And what's special about that place ? @sherryshroff #asksherry", "she_is_aksana": "Hi Sherry... please share your fitness regime🙂🙂", "18_lasya_21": "What are the ground rules you would set for dating ?", "srishtidurga": "Get your MIL in a video please. Would love seeing a video with her", "_aishwarya_1801": "#asksherry hiiii, when are you planning to make a mother in law tag video! Would love to see that one! 😋 BTW I love coupling too! 😘", "bellykanungo": "Which camera do you use for vlogging? Do you suggest canon g7x series or Sony RX series for vlogs?", "nayanahebbar": "#asksherry we do not see you doing a lot of brand associations on YouTube nor does just monetisation makes a lot a of money. How do you make money other than these two ?", "chaithravasant": "MIL tag please!", "pouchofparadoxesofficial": "Do you think long distance relationships can work? Do you know any couple in a long distance relationship who are doing good? #asksherry", "archiellappal": "DC or Marvel?", "n_challa19": "Plz don't do this video. Ur channel is getting really boring. I'm a big fan but I don't think I entertain the same boring stuff so I might unsubscribe as well.", "rashi.agarwal": "Did you do something on your first wedding anniversary? Mine is coming up and I’m out of ideas :/"}