{"am_srishti": "Does it help for keratosis pilaris? @therapieclinicindia", "amol3233": "Maaza aaya k nahi", "username_not_auvailable": "IS IT IPL OR LASER?", "arti_behl_mehta": "What is it for", "shubhdeepsingh_": "@uuutuuuuu u6", "nandinidanani": "No side effects right", "manisha__panwar": "Doesn't it lead to any disease.... I mean is it safe?", "yo.mahii": "what is the cost and what is the usw of @ therapy", "nidhi_srv": "Hi Sherry! Any idea about some good reliable clinic in Delhi area? Would have been great if therapie was launching in Delhi as well.", "sonalisnarula": "Can this be done on teenage girls", "rao_vageesha": "@sannagandotra @arsh_jyot this is how laser session generally are for me 🤣", "sashanambiar": "@anaitanambiar04", "madhurima_1999": "V", "sheena_006": "@sheeba1134", "praj06": "What's the age limit for doing this therapy?", "blazingstar456": "Is it a permanent method..@sherryshroff @therapieclinicindia", "that_girl_mudita": "Hi sherry! Is laser hair removal harmful in the long run for women in terms of conceiving a child? Also could this laser be the reason for cancer for some people?", "saaksheesingh": "Is it painful? @sherryshroff", "ksimran_1998": "Is there any effects on hairs also?", "mrs_harshita": "How will skin react if we shift from a humid city like Mumbai to a much cold city like Nashik", "spruha_23": "Yes. Price and how was the experience and everything we wanna know", "acharya_arpita23": "How much does it cost?can I remove hair of all my limbs permanently to get rid of waxing???", "farhanaahm": "Cost", "richavashista04": "What is the right age to get this done? Also, is the treatment same for all skin types?", "apoorvi_b": "Does it have any major side effects?", "kaavsv21": "Does it pain during the process @sherryshroff 😘", "rrashmippandey": "M very much interested for this to know more", "shirazpatrawala": "Is the laser bad for the eyes? If yes, how does she see it!", "ketakeekwatra": "A friend of mine got burns on her face cos of laser, what are the chances of this..", "srushtisalunke": "HOW EXPENSIVE IS IT", "ambreenjaiya": "What to do when you are on a skin treatment and your dermatologist has recommended you to stop with your laser sessions till you r treatment is over? But the facial hair grows back in the meanwhile.", "aishwarya_shanbhag44": "Is it painful???", "oshincognito": "Is laser safe for the skin?", "sayantim": "How much it costs", "justsoume": "What is this for?", "harkiranjeetghuman": "Yes ,plz tells how much does your treatment cost ... so that we can get an idea ?", "tina_not_teena": "Side effects. Please talk about that. And since its laser is it safe in the long run.. and do one have to take special precautions pre or post treatment. Thankyou.", "rpiyu": "Is their any side effects if we do anykind of laser treatment", "suprividhu": "Does it pain or itch?", "sravanthichitturi": "How much it cost..", "travelwithgoonj": "The only question how safe is it?", "ashnaisrani": "Can laser b done on fine hair! I got it done once but now that a year has passed by m facing reggrowth issues!", "mohh_kaisa": "Is it painful n can it be done on bikini areas", "mystic_review24": "Is it good for our immunity?laser burns our hair follicles so is it safe.Does it pain as I have zero tolerance towards pain.", "kritikagoyal13": "I have very light and little hair genetically. Can I go for this?", "sassyjahnvi27": "Is it safe for a 21 yo girl ? Like is it really effective on us ?", "mudy1411": "1. How much does it cost? 2. Are there any side effects? 3. Does the hair never come back?", "charusahni": "Does the laser hair removal darken skin? Heard that's the main reason a lot of people don't opt to get the laser treatment on their face", "deepikasyal": "You are so young..why would you use these treatments ?", "parnavi_k": "Do they shave the hair before every treatment?", "neha.kapila10": "How safe is it for the pubic hair?", "rabia0296": "What is the cost for it? Any side effects? And how long does it last?", "sharma.kirti07": "Cost? And how safe it is?", "_anamika_saikia_": "Is it safe for people with sensitive skin? How effective and in how many session permanent hair removal can be done?", "nivrity_das\nVerified": "Verified", "anji2_9": "Does it stop or the hair growth slows down?? Cost of the treatment and which type is best?? @sherryshroff", "anivrita": "Does it hurt and is it permanent?", "nomadic_journals": "@sherryshroff how many sittings are required to see the results?", "the_rumisi_world": "What are the side effects to skin and is it suitable for all parts of body?", "priyankapatra11": "Side effects, if any. And cost of the whole package.", "poonam_sagoo": "Which laser therapy is this ??", "doctorricha2008": "Is it painful?", "pixelspersecond": "@sherryshroff how many sessions does it take to completely eliminate body hair? E.g. Facial hair 3-6 etc. How much does it cost? Is this safe?", "angel.karan11": "How much % of hairs remove after all sessions ??", "khyati_thakker": "Heard that the hairs do come back..and are there any side effects!? My frequency of facial hair growth is to fast..Wil laser help..and what's the expensive", "shivikanakra": "What kind of laser is this? What is this for?", "arpit7villa": "Does the skin become black after the laser treatment ? , that's what I've heard from many people ...", "jaeenstagram": "How many sittings do areas like upper lip and underarms usually take ? And the sessions are spread out for how long ? Also is there any difference in the area after the the treatment - like area becomes dry/skin peels/any special treatment ?", "jyothi.hr": "What is the cost per session? Please give a break up", "smokyblackeyes": "Please make sure it’s safe for your thyroid (since it’s being used so close to it). Makes me very nervous. My esthetician didn’t touch the neck.", "lillswati": "Is it painful ? And is it safe for bikini area ?", "kulsumaltaf": "How long does it take for hair to grow back after first session. Does it have any side effects?", "yashika_atre": "If they remove hair follicle then in future if we need scalp hair transplant then how would that go about?", "jagruthi3": "Hi sherry, hope you're doing good! I have few questions regarding laser hair removal treatment - Does it have any side effects? And how many sessions you have to do? And for how long does it lasts? It is good for all skin types? @sherryshroff", "sindhusha_pendyala": "Does it have any side effects", "sree_vkn": "How much does each session cost", "nikkiwalia5": "Is it okay for someone who has sensitive skin and suffers from vitiligo?? Please ask her, I shall be thankful!", "buttyboo_20": "Do our skin gets darker shade after lasering n does lasering sometimes cause skin cancer ???", "juhisahajwani": "Is it safe for someone who has a high tendency of developing keloids ? @sherryshroff", "womanssplainer": "Does it hurt", "krutiarts": "Any side effects?", "deeksha9690": "Does this hairremoval techniques cause acne?", "alveera.27": "Any side effects on sensitive or oily skin?", "freidasmonkey": "Is it painful?", "shaileeshah93": "Does it hurt? How effective is it?", "nups2809": "@chandrikasurana", "shanaya_rs_": "I heard about it doesn't work and not last longs", "neha0345": "I have heard the skin gets dark by getting the laser done as i want to get rid of my upper lips hairs ... kindly guide ... ✌🏻", "_shahana.shaikh_": "After going through all the sessions does the hair growth stops or it slows down @sherryshroff", "harshada.buddhe": "How much session will it need for complete hair reduction??? Does different parts of body need different time to show the hair reduction results?", "bhumzee_9": "Not last long", "smrutic09": "I have Lupus.. an Autoimmune disease.. can I still get it done?", "quinny_andrea": "How much does lazer treatment usually cost", "chandresh_chundawat": "Are there any side effects? Is laser treatment painful?", "shradhavjain": "Any side effects and in how much time shud one get it redone again n if sum1 what’s to get only chin n upper lips done is it enuf", "kashini.chopra": "What is melanoma? How does someone get it after laser?", "meghna_chauhan19": "Are there any side effects??", "im_manjusree": "To therapist...How long it will last??And any side effects??? @sherryshroff Is it painful??", "pink_elephant.21": "Will the skin break? And when it's dry skin is there any side effect ???? And will the skin burn?", "peckwoodhigh11": "I have always wanted to get the laser thingy done, but I have heard people saying that one can catch cancer post to that. How true is it?", "faaworld": "It's you? I thought its @eljuanpazurita", "janki.25": "@sherryshroff i would like to know how many sessions do u have to undergo for the actual result??"}