{"marfa.batool": "Never have we ever broken up", "enricadsouza_": "Never have I ever got arrested @sherryshroff", "milanraina": "Nvr hav I ever thot of dng drugs in a party!", "nashwaarifahie": "Never have I ever had a crush on someone else while being in a serious relationship?! A follower from palestine! Congrats on your wedding guys!!!!", "missprakash08": "Urinated on the wall", "shubhangi_somani": "Never have I ever cried myself to sleep?", "charusree14": "Never have I ever flirted ?!", "moksha98": "Never have I ever blamed someone else for my own mistake.", "afflictedmess": "Never have I ever said that a baby was cute when it obviously wasn't.", "sreesha_gs": "Never have I ever gone stalking about a cute guy\\ pretty girl in deep xD", "rajeshnarkar": "Never have I ever vomited in public", "pohalmegha": "Nevr have i ever hanged myself to death#lol", "saloni_jain": "Never have I ever stalked another blogger! (Barring @vaibhav.talwar )", "martian_love": "Never have I ever lied while playing truth or dare", "aayushinahar": "Never have I ever had doubt on u", "neverhaveievergame": "My company created a game called \"Never Have I Ever, the Game of Poor Life Decisions\" 😜 if you would like a copy send me a dm.", "sunita_1994": "Never have I ever used someone's toothbrush without telling them @sherryshroff @vaibhav.talwar", "sherryshroff\nVerified": "Verified", "keeratdadiala": "Never have I ever pooped or peed in the bushes when I was young🙊😋😂", "nomnomnomnm": "Never have I ever asked for a sukha puri from a bhelpuri wala 😛", "potatoes.before.tomatos": "Never have i ever peed in the pool", "batra.aakriti7": "Never have I ever hit on a random guy while drunk?", "_shaista.bibi": "Never have I ever pretend to be a friend to someone who I didn't like", "amiti_gupta": "Never have i ever pretended like a celebrity", "saalloniii": "Never have I ever lied to each other 💖", "radhikag99": "Never have I ever lied to your partner🐻", "muntahas24": "Never have I ever been to dubai?", "known_as_soph": "Never have I ever gone skinny dipping in a hotel pool....@sherryshroff", "moody__medusa": "Never have I ever secretly gone through anyone's stuff. @sherryshroff @vaibhav. talwar", "sakshita_30": "Never have I ever farted with my partner in the same room", "akankshaasiingh": "Never have I ever told a teacher what i really thought of an assignment", "vidhirb": "Never have I ever slapped anyone @sherryshroff @vaibhav.talwar", "smriti.510": "Never have i ever stalked a fan in social media", "anamika1391": "Never have I ever forgotten to flush the toilet after using it", "cheshta_gogia": "Never have I ever missed watching any of your coupling videos 😁", "palak__anand": "Never have I ever peed inside a swimming pool", "raufa184": "Never have I ever stolen something 😂😂 OR never have I ever cheated in Exams", "farida915": "@vaibhav.talwar @sherryshroff Never have I ever cheated in an exam", "sumitichitkara": "Never have I ever slapped anyone. @vaibhav.talwar @sherryshroff", "divya_shanbhag_": "Never have I ever visited a haunted place", "shweta_pattnaik": "Never have I ever gone skinny dippy", "saanvi_komarla_": "@sherryshroff given in questions in vaibhavs account", "shobhana_nataraja": "@sherryshroff never have I ever hit on a teacher/professor", "shreyargupta": "@sherryshroff never have I ever lied to my parents about low grades #neverhaveiever", "madhvi_5": "Never have I ever got in trouble at school @sherryshroff @vaibhav.talwar 💕💕💕", "sreya.bose": "Never have i ever thought of kissing an unknown person after seeing them for the first time", "ykyuhoo": "Never have i ever been in handcuffs!😂", "mitaliijoshi": "Never have I ever fallen asleep in the theatre", "malharnarain": "Never have I ever remembered/stalked a fan on social media", "kavya.mody": "Never have i ever stolen food from my girl friends plate in her absence😁", "zoe_phil_": "Never have I ever danced in the house alone to my favourite music", "rupansi29": "Never have i ever been to a strip club😜", "fusion_mart": "Never have i ever used someone's toothbrush", "prachibhanu98": "Never have i ever lied to someone", "riyaf20": "Never have I ever fallen asleep in a cinema hall", "akshitasharma263": "Never have i ever sneaked out at night under my parents nose @sherryshroff & @vaibhav.talwar", "gurleenchugh23": "Never have i ever farted n said I did not 😂😂 @vaibhav.talwar @sherryshroff", "call_me_mish": "never have i ever went skinny dipping", "originallypriyanka": "Never have I ever lied to parents about dating Vaibhav??", "suchi99800": "Never have I ever swallowed my own puke because didn't want to throw it in public.... 😆😆😖", "jyotigosain": "got jealous of vaibhav / sherry", "kanikabhatia26": "Never have i ever lied to my parents about a night out?😁", "riyax._": "Never have I ever given my fiance something to eat that was fallen on the ground/was disgusting.", "udeernavolety": "Never have I used somebody else's toothbrush @sherryshroff", "nikiitanair": "Never have I ever fought with my fiance publicly", "saniyaamoree": "Never have i ever slapped vaibhav!😂😂 @sherryshroff", "aswini_ramesh": "never have i ever given someone a fake phone number :P", "sayyoni__": "Never have i ever slapped my mom or dad in my teens @sherryshroff", "aasthaagarwalbansal": "NEVER HAVE I EVER BOUGHT SOMETHING VERY EXPENSIVE AND LATER LIED AND BRAGGED ABOUT HOW HOW EXPENSIVE IT WAS 🙆🏻🙆🏻👠💄💼🎩👝🎒👛", "shainamarwaha": "Never have i ever been caught cheating in school exams😂", "shinjinisengupta": "Never have I ever gone skinny dipping😆", "shyanjali_04": "Never have I ever failed in an exam.. 😂😂😂😂", "cyberbyte9": "Never have I ever ate all the food but denied eating it. @sherryshroff", "srividyakumar221": "Hi dr", "sunoynaroy": "NEVER HAVE I EVER SECRETLY TAKEN SOMETHING OF MY SIBLINGS @sherryshroff", "loraine_mangalam": "Drunk alcohol before the appropriate age @sherryshroff", "tanishaaaaa_": "Never have I ever baked @sherryshroff 😂😂", "ginisingh2009": "Never I have ever spend my fiancée's money on others @sherryshroff", "thesweetpepper": "Never have I ever hated a YouTuber😜", "priyadahiya_": "Never have i ever cheated on my bf ☺😜😜", "tanimarahela": "Never have I ever lied to my fiancé", "subhashini_macha": "Never have I ever laughed when someone fell down !!#lol", "_jhanviisanghvi": "Have to ever used each other's toothbrush", "sanjana.14": "Never have I ever met you guys!", "iraanyle": "Never have I made out with a stranger.", "akshatatata": "Never have i ever kissed the floor passionately. eep (≧▽≦)", "xoxo_theer": "Never have I ever lied in some #neverhaveiever questions to escape from embarrassment.", "kashish__ahuja": "Never have I ever had a fast for a day or a vrat", "1d_zquad": "Never have i ever used vaibhavs toothbrush without asking him😂😂", "xsumedhax": "Never have i ever pretended to be the opposite gender online", "_____jasminemadhok": "Never have I ever went to a party just for formality", "jubeetta": "Never have i ever used someones phone without asking them ?", "chubbycheeksx": "Never have I ever peed while bathing..", "shilpapanii": "Never I have ever have u all slapped anybody", "archiellappal": "Never have I ever lied to Parents to go out on parties", "muskanchaudhary": "Never have I ever given someone a fake phone number .", "vrutti_vru": "Never hav I ever made a fool of each other widout knowing", "modidhara28": "Never have I ever had food which was three days old", "anushree_poddar": "Never have I ever got drunk and done something embarrassing.", "pranita.jp": "Never have I ever been in a physical fight", "irhtayag": "Never have I ever given a wrong phone number to a fan", "bargavi_baradhwaj": "Never have I ever stole something", "fuck_off_aisha": "Never have I ever been in a serious fight with my sister", "pukukarki": "Never have I ever laughed till I farted!!! 😁", "aasthasachdeva": "Never have I ever missed any of @vaibhav.talwar @sherryshroff 's video", "sanika.karulkar": "Never have I ever made a prank call", "sruthi_peddada": "Never have I ever send a message to a wrong person 😁", "aakriti2402": "@kanikamittal02 @ashik.24 @johnkumar24 @harinikandadai 😂", "ayeshaajani_": "Never have I ever worn the same pair of socks for more than 2 days", "rrbhumi": "Never have I ever said something really awkward in front of my parents ???", "mansha.jpg": "Never have I ever pricked my nose in public .", "sparsh274": "Never ever i have ever got attracted to other person???feel like moving on or bored of each other", "_prachikumar_": "Never have I ever drunk texted an ex?", "miloni_1912": "Never have i ever pranked on a policeman!", "gariimasahai": "Never have i ever missed to like your single pic", "kaamya1021": "never have i ever been embarrassed around relatives/fans/some people", "anushka.purohit": "never have i skived class hahhaha @vaibhav.talwar @sherryshroff", "curveyors": "Never have I ever shared a toothbrush with someone.", "ishitasawantt": "Never have I ever shoplifted", "shumsahay": "The pic vaibhav shared had a footwear of urs under the cupboard! Where is it from? Couldnt ask in that pic cuz its too girlie for his handle🙈", "rashidhawan.16": "Never have I ever forgotten my house keys and broken the lock", "meghna_menon_": "Never have I ever kissed in front of my parents.", "shubhanshi_bhasin": "Never have i ever done something i regret @sherryshroff @vaibhav.talwar", "arshiyagedam": "Never have i ever lied to you . @sherryshroff @vaibhav.talwar", "noyonikaaa": "never have I ever dreamt of a thing and it actually happened few days later", "aliyashaikh_": "Wore a cape and pretend that i was a super hero", "drishti_.sharma": "Never have I ever Went for exam without studying", "aashnitalati": "Never have I procrastinated going to bed on a school night", "madhulikasharmaa": "Never have I ever finished your portion of food without your knowledge @sherryshroff @vaibhav.talwar", "priheheheh": "Never have I ever forgot the exam on that specific day and prepared for some other subject😁", "srujitharavula": "Never have I ever hit someone hard", "soumya.shende": "Have you ever had something the other person made and pretended to love it when actually you hated it @sherryshroff @vaibhav.talwar", "salonidhumal": "never have I ever kissed someone and regretted it later", "sayalitayade_": "Never have I ever stole anything", "__niraav__": "Never have i ever seen as much adorable couple as you both ! Have you !?😃 sorry this is the 1st thing always comes in mind when i see you both !😁", "_shravanib": "Never have I ever been drunk without telling your partner? @sherryshroff 😃", "amruuuuuta": "@pranjalsatav", "mansa.raut": "Never have I ever cheated on anyone!", "century_gothic": "Never have I ever been arrested"}