{"mahimasaini": "Best and your favourite online shops/website you recommend ? :)", "monika_srivastava": "Tips to tone arms", "priyanka_goutham89": "@asksherryshroff approximately how many days do you travel in a month and do you enjoy travelling ?", "bhargava.swati": "What keeps u happy & going in life... Everyday is not perfect", "izitaaa": "@sherryshroff #asksherryshroff hey sherry, whats ur views about the GM diet plan? Do u think it works?", "prasadiinii": "@sherryshroff #asksherryshroff Do you have any phobias??", "goonerette_21": "What is your skin care routine, can you make a video @sherryshroff #asksherryshroff", "yuutiiii._": "Hey Sherry, we would love to know that what were your dreams of your childhood... Pls let us know.. @sherryshroff", "ruhi_gidwani": "Please share your first video of your channel :) searched a lot but couldn't find @sherryshroff #AskSherryShroff", "priyanshibhatt": "Plz tell us something about ur memories or fun times while u were in college....n how ur college days used to be...luv ya!! :* @sherryshroff #AskSherryShroff", "jia_sitlani": "Hey sherry, Do you follow a particular diet plan or you eat whatever you wish to? @sherryshroff", "charusree14": "Do you have any passion towards something and still haven't done anything for it? If so what is it! #AskSherryShroff", "upsiii_17": "You have a very unique name, what we're the most funniest/weirdest pronunciations of your name? #AskSherry", "shweta_borgaonkar": "What are ur top 5 fav n budget friendly clothing brands", "biyani08._": "Whats your favorite footwear brand? #asksherryshroff", "_radhika.mehta": "Can you telk me how you deal with things that bother you? I really find you to be a great person! #AskSherryShroff", "an_shoe": "Where do you Street shop in Mumbai? #asksherryshroff", "sherryshroff\nVerified": "Verified", "shreyargupta": "Where have you and vaibhav decided to go for honeymoon? (Please answer this one) Love you😘 #AskSherryShroff @sherryshroff", "nidhi_purple7": "R u a fan of 50 shades of grey? Do u like Jamie or Dakota? #asksherryshroff", "siffanoorani": "In how many days does your wardrobe gets messy after you clean it! Mine gets messy in less than 2 days😅😛 #AskSherryShroff", "raashimudholkar": "How do you fit in a workout when you're on vacation? There's hardly any time or energy left with all the sightseeing! #AskSherryShroff", "ishaaa02": "Any unfinished goal or unfulfilled wish? #AskSherryShroff", "dheeralbhayani": "How were you in your school days? Like shy or bold? @sherryshroff", "tejaswigudati": "@sherryshroff what do u do with the makeup products after it's expiry date has reached ?", "shreya.apm": "Tell me the timetable for daily routine", "abhipsapanigrahi": "@sherryshroff what all ways can we style up (mainly jwellery )on a black n white skirt dress.", "aasthasachdeva": "#asksherryshroff I wanted to know how did you get the idea of becoming a youtuber.. What inspired you ? Which was your first video ?", "tanureet_kochar": "@sherryshroff...How do you manage to look so fit?", "muskannt": "One thing from your closet you could wear for the next six months ? @sherryshroff", "meghamodi44": "I want to know ur workout routine", "aashnitalati": "Do you know the names of any of your fans? If so, than can you state all the names? Thanks Sherry, love you💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜", "ishiii15": "#AskSherry if given chance to work in a Bollywood movie which actor would you like to work with?", "sandhya.fit": "How do you keep up with your long list of fans ? #asksherryshroff", "_sanjeeda": "@sherryshroff what does vaibhav do? Is he unemployed", "sindhushakoppu": "One thing you like the most in your life #asksherryshroff", "little_miss_crazy_thng": "are makeup products purchased from online stores original n safe to use? wat wud u choose btwn online shopping n big brand stores to buy genuine products??", "shivaaaaaanii": "Woah!!! You're a lawyer!😍 Are you a criminal lawyer or something?! @sherryshroff", "jueesometimes": "Who is your favourite fashion designer?!", "prachi8186": "What are your five fashion/wardrobe must haves? #asksherryshroff", "oaswalia": "I really wanna know how do u manage criticism??", "devlina_bajaj": "#asksherryshroff Back in college days, were you the hottie babe or a real studious student..", "amber_2367": "How old is vaibhav n how old r u ;)", "kaun_kriti": "Will u be intrested in doing modelling again?? #asksherryshroff", "_____jasminemadhok": "#asksherryshroff @sherryshroff Favourite TV show currently ?", "lavee10": "#asksherryshroff @sherryshroff would u love to wear a lehenga or a sari on your wedding? 😉", "whimsy_pooh": "If u were to live somewhere in India for the rest of ur life apart from mumbai where would it be and why😀😀love u sherryyyy 💓💓💓💓", "sshipra_singh": "Daal chawal or gourmet food..????@sherryshroff", "saruuuda": "#asksherryshroff hi sherry. You are one of my favorite YouTuber! I love the way you dress up and watched your recent Shoe organization video. I would like to ask you one question- inspite of eating such delicious meals how do you manage to stay so fit?? 🤔", "jassimagdum": "Which part of the world u are yet to travel? And places you want to see..", "anamika1391": "#AskSherryShroff who are your 5 fav youtubers in India and 5 youtubers from abroad", "meenakshi_nakka": "#AskSherryShroff r u interested to do acting again", "sreesha_gs": "#AsksherryShroff What are the three things you wish you knew when you were in your teens?", "srilakshminair": "#AskSherryShroff which is your favourite place to shop in mumbai?", "paarijaat_": "#AsksherryShroff how come VT and u r still going strong after 10 yrs? I have seen so many ppl lose interest as time passes... How do u guys keep the spark going?", "tanishka_k": "#asksherryshroff If given a chance to work in bollywood movies, which actor would you like to work with.", "riyabramhe": "#AskSherryShroff If you had the chance to go back in time and change one decision you made back then, what would it be?", "_rituuuuuu": "How many countries have you been to till date\"", "rashmeet.banga": "*aura", "khyatianand": "What do you like the most in delhi apart from Sarojini and big chill#asksherryshroff", "_ishasingh": "Hey Sherry! Whats your age? What do you want for your wedding? How do you want it to be? Do a sister tag or a family tag maybe please. What inspired you to start your channel?", "tabindaafroz": "@asksherryshroff", "shravani.saggam": "@sherryshroff #asksherryshroff How many product do you use for your daily make-up or for getting ready and what are they?", "shwetaness": "Why don't u colour /straighten ur hair ,max people are doing it ,any reason?", "skinandwords": "@sherryshroff How do you mantain your calm when faced with difficulties and challenges?", "kanankotak1": "I really don't have anything to ask you @sherryshroff but I wanna take a moment and thank you for whatever you do. And even though you've reached at that level of success you're still down to earth and lovely af. I love you Sherry :\") You're always an inspiration. Thanks x Also, take this as my question : HOW ARE YOU SHERRY? #AskSherryShroff because why not? 🙊❤", "shrutidhapodkar": "Ugly and live forever, or attractive and die in a year?#asksherryshroff", "raimitaliiiiiii": "If you were given one wish what would it be ?", "myinstadiaries": "Favourite mascara? #asksherryshroff", "riya_kedia": "One mistake you think you shouldn't have committed", "ksk1805": "If you had to take 3 things to an island.what would it be?", "shivani.gadhiaa": "What is your favourite childhood memory ? #asksherryshroff", "anushabableshwar": "Where r u and vaibhav going to live after ur wedding?? #asksherryshroff", "nvm.samridhi": "What made you start a youtube channel and wat makes u going ??#asksherryshroff", "priyaanepla": "#asksherry how did the beef ban affect you??", "noha.117": "#asksherryshroff Your favorite nailpolish??", "kritana_chettri": "@#asksherry I wanted to know what was your ambition when you were small? Did u achieve what u wanted to be? Or are you still on the process of doing something more😊😊😊", "syedaamreennaaz": "What u r planing to wear on ur big day..", "_jazz1221_": "#asksherryshroff do you miss modelling??", "jasleenbhullarr": "What do you love the most about traveling?", "sagarika13": "#AskSherryShroff favourite lipsticks", "deekshabhalla16": "Best brands for clutch #asksherryshroff", "san10m": "Where do you live #asksherryshroff", "_utxarxha_": "Which is ur favorite colour #asksherryshroff @sherryshroff", "arabhi.s": "What is your all time fav Indian makeup brand? #asksherryshroff", "kaamya1021": "I know this question is random#asksherryshroff how long can you stand on one leg(try it)???", "tithi_kumar": "Skin detan home remedies specifically for oily nd acne prone skin #asksherryshroff", "mrinaha": "Who let the dogs out? #asksherryshroff", "sana.ahmed95": "#asksherryshroff who's your favorite bollywood actors and actress, and what's your favorite bollywood movie", "zainab__college": "#asksherryshroff Hey sherry, your fashion style n sense has always differnt and loved by me ,so i jzz wanna ask how u maintain closet capsule coz u look always stunning. P.s i love u n vaibhav plz tell him 😘😘😘😍😍😍😍", "iipavnii": "As a child were u also in doing to much makeup", "tarinimehtani": "What's the biggest sacrifice you've had to make for your career?", "nehawanikar": "@sherryshroff what is your all time fave tv show !?", "aroshymaurya": "From all the household Activities which are there...which one's do you know? Or do on a regular bases ? And does Vaibhav Know any of the House hold stuff? Cooking,Cleaning ,Mobbing or any thing !!", "ritiksingh_": "@pankhudishrivastava Try to Tell them about its advantages...your passion and move towards it.", "pohalmegha": "#asksherryshroff wats the craziest thing u hve don lately lol angel beauty xoxo", "102nishi": "Why don't you drive?? #asksherryshroff", "chandreyeeroy": "@sherryshroff Please suggest a longlasting PLUM colour eyeliner and nailpolish ,available in Mumbai. #asksherryshroff", "bagchi.noyonika": "What's your favourite Marvel movie? :D #asksherryshroff", "lost_here123": "Regarding the shoes organiser vidoe you posted recently..i just have one question before placing them in plastic..do you clean them from down..and if you do could you tel us the whole process.. #asksherryshroff @sherryshroff", "payalchaudharysejpal": "Where do u see urself in the next 10 years #asksherryshroff", "huh_ritha": "Play your most played song of the week 🎶🎶 #asksherryshroff", "simranhirani97": "#AskSherryShroff Di you haven't told us much about your family! Tell us something about them? You mom dad sisters nephews😀", "yogita_balani": "Your ways to beat the heat this summer? 😁 #AskSherryShroff", "desi_girl26": "#asksherryshroff my skin is tanned due to summer heat. How to recover it and make my skin glow more ? Any natural remedy. Or tell me some affordable products which I can use to get rid of my tanning. Thank you. And lysm.", "originallypriyanka": "How to be an influencers for brands if you are a blogger or YouTube er or how we can find brands to be an influencers?? #AskSherryShroff #asksherryshroff", "znbbgg": "How tall are you? #AskSherryShroff @sherryshroff", "dhanashriiii": "What is your idea of a fairytale wedding?And you are very beautiful♡#Asksherryshroff", "kashish__ahuja": "#asksherryshroff What are your main everyday clothes for summer nd which is your current favourite snapchat filter .. ps- I love nd I've voted for u in the cosmpolitain blogger awards nd hope u win nd plzz plzz answer my question 💋❤😍😘😘💞💞", "aakankshasharma21": "How to get those glowy pinky cheeks :)", "aswini_ramesh": "#askSherryShroff How would someone get your special attention?", "vimmy_k": "When are you coming to Pune ? :p Haha I know I have always asked this question. But please feature this question in your video. I would be sk happy. 😘", "_sareenshikalgar": "@sherryshroff What's your favourite snack to binge on ?", "voyagerinvogue": "#asksherryshroff your advice what to do when ppl strt taking u fr granted", "sweetgal241295": "U r exercise routine video pls. Nd how to. b a Morning person...", "on_the_other_edge": "#AskSherryShroff 👟 or 👠", "mansi.savla": "Hi Sherry...I want to ask from where do u originally belong from ??", "raufa184": "#asksherryshroff what adventures (as in skidiving scoobadiving etc)u have done in your life n which are in your bucket list ????....love u alot sherry 😘😘", "punarvva": "#asksherryshroff what to do when u get bored in summers ??", "priyankadanane14": "Hey sherry.....what's your educational qualification? Lysm!!!", "pooojaaaaaa": "Do you like me?", "asthagupta197": "If you ever write a book what would be it's name ?? And what according to you would be it's last line?? Ps ilysm😘", "dumbolinaa": "If there's an apocalypse and you get to take your one, just one, favourite pair of shoes to a faraway land, which pair would it be?", "sameer_clicks": "Hey, listen can you suggest some indian fashion bloggers for men?", "sharold301": "Also,i stubbed my pinky toe this morning and its all swollen up now...i cant even move it...dont wanna go to the doc...what should i do?", "padminnii": "Hiiiiiiiiiii @sherryshroff #Askssherryshroff If you could act in any tv show , what would it be and what character would you want to be ? 💖", "krishakukreja": "Have you ever missed your own self ? And how you 'were'? Because If you actually have at some point in your life please share it Sherry 😌", "mohitfornow": "Wanted to ask your first Youtuber Crush ( sorry but I just wanna ask this ) lol", "nishitaakaushik": "What is your message for girls especially the kind of audience you get , girls that age to battle various issues like body image or self esteem issues or depression, and how people like you who constantly have to stay upbeat and in the limelight deal with it.", "mitsoct": "Who's your favourite YouTuber?!", "reebah_durraj": "How u started your YouTube channel ... What inspired you ?", "jainshreshthi": "How do you stay so optimistic?", "ridheee": "What inspired you to become a vlogger? Why modelling doesn't excite you any more?", "shruti.sv": "How do you save money for all your cravings like clothes and food. Give advice to us college going teens on how to earn/save money.", "yashica.shetty": "How did you tell your parents about Vaibhav! Because i guess dealing with desi parents in such things is not an easy job! 🙈", "khanjandesai8": "Is it better to marry someone similar to your nature or opposite? What's it like between you and Vaibhav?", "karmeshhemani": "Do u applay for solve project", "anjalim2626": "Do you watch game of thrones ?", "takiar.kanika": "U have such a beautiful skin did you inherit it from your mother ?😍", "kuku_99": "Basic make up for starters? Most effective way to get rid of pimple marks? And also you and vaibhav are goals 😍", "pratiksha_parak": "Although this isn't even a question. Can you and Vaibhav please please please come to Hyderabad?", "aainamehta10": "Would you stop youtube after a certain age or continue doing it till you can", "mistry_niyati": "@sherryshroff #Asksherryshroff Can you tell 3 fav facts about you??? @", "krucha_pen": "You're going to get your wedding dress designed from which designer#asksherryshroff", "stharmawia": "What would happen if Neo took both the pills ( blue/red) from morpheus ?", "yashaswinioak": "How do you have such clear skin??", "naina.gilani1990": "Hv your ever felt low self-esteem....if yes then when n why....n tips to overcome", "mitaliijoshi": "Can u conduct a meet and greet in Pune?", "komalpawar310": "Any phobias?", "shallet8": "If you could ask for a wish what would it be?", "ramneetmann_": "Favourite type of food??", "koyelsikder": "How do you manage stress/anxiety? #asksherryshroff", "sharanyaadeva": "Favourite brands? #AskSherryShroff", "its_cherry987": "Your favourite cartoon on cartoon network (90s)", "witty_lady_k": "What are your hobbies ....?", "frenahita": "Which school were u in? @sherryshroff", "theshreyaaaaa": "Are you still continuing modeling or are you a full time YouTuber now?", "aaliya19": "Favourite perfume ?", "priyadahiya_": "#Asksherryshroff What's the most memorable gift you have given to your parents and vice versa??", "meg_vaishnav": "Which is your favourite bollywood movie??", "saloni.choudhury": "@sherryshroff how do you deal with stress /anxiety?", "dhaaraa_jain": "#asksherryshroff When are u planning to get married?", "aditi_singh___": "If you had to choose between shopping and nice food what would you choose?", "siennaknows": "How are you so fit :) diet plan and workout plan please !", "madeeharshad": "How similar/different are Anaita and you as sisters?", "mrs._minhas": "Fav food ?", "menonnamita29": "What is your favourite pass time during holidays???? #asksherryshroff @sherryshroff", "lavinafatnani": "Your favourite YouTuber at the moment????", "salvi.gupta": "How to become a successful youtuber?", "thealiferousgirl": "Wats ur favourite indian reality show nd wat do love most about it?❤️", "hafsafarzeen": "#AskSherryShroff Ur fav food frm Hyderabad?? @sherryshroff", "meghna_menon_": "Do you watch Permanent Roommates? Don't you feel like you and Vaibhav are the same way😊", "priyapandey1113": "#Asksherryshroff what are the best places to shop in Hyderabad????", "padmamurughappun": "What is suggestion for a bright skin during summer? What are the essential products to achieve that look?", "aranyachuganee": "What are your traveling essentials ? ( like the ones you cannot travel without .. Love you and your vids❤️ ) @sherryshroff #AskSherryShroff", "msjahnavi": "Hey sherry. Are authentic chocolate wax available in India ? If yes where can I purchase it from ? Also how are they better than regular wax ?", "bhxag_": "Who is your favourite YouTuber? #asksherryshroff", "abhilasha_kanet": "How to start a youtube channel and be successfull in your venture?", "pranita.jp": "plzz suggest a affordable primer available in india @sherryshroff", "peculiere": "Launching soon : TriAD! The only place where you get stare worthy bling at only INR 999 /-!!", "sanahussain__": "Do u cook for urself??? And yes when are u coming to hyd??", "iigarimasharmaii": "What are your summer lazy day essentials? #asksherryshriff", "samesky_ag": "Harvey Spectre or Tyrion Lannister ????", "tanishaaaaa_": "Who is your inspiration? Did you ever thought of being so successful? I love you❤ #asksherryshroff @sherryshroff", "nishabhanushali611": "55How u maintain ur skin routine??#sherryshroff", "astha.seth": "#asksherryshroff what was the moment when u realised that u love vaibhav and how did u tell ur parents about him?", "eqra.mehveen": "Which is your favorite Indian fashion designer @sherryshroff ??", "prernamaynil": "@sherryshroff Please do a meet & greet before 9 June. A lunch meet probably? Preferably on a Saturday or Sunday. #AskSherryShroff", "mitalee_phatak": "#asksherryshroff Which is your favourite street shopping place in India?👗 Which is the social networking app that you use the most?? 📱", "sakshita_30": "How do you go about choosing a giveaway winner? #asksherryshroff", "mansi0891": "Your favorite makeup brand which you wil never stop using☺️😜😜 @sherryshroff", "mrs_butterfingers30": "Will u be doin ur wedding vlog?? we wanna bou ur outfits too!! lots of love to u sherry!!", "bargavi_baradhwaj": "Favorite Bollywood actor? #asksherry", "soundarya_krishnan": "Skin and hair care routines for peak summer?!! #asksherryshroff", "pretty_likes_pink": "#asksherryshroff 5 makeup products you'd suggest to keep in our bag???", "pratznadig": "What do you keep in the other three trunks?", "soumya.shende": "What have you decided to wear to your wedding @sherryshroff", "navelii_fashion": "If u want to gift someone ( a girl) a bag of goodies, personalized or else.. Upto 5k ... What items could b great.. Thanks.. Lov ur videos", "devsterslaboratory": "How do you manage to remain so fit even after hectic work schedules??", "simrankataria": "Favourite movie of alltime? #asksherryshroff", "geetanjali_gupta": "How often you visit salon and for what?? #asksherryshroff", "anujakal24": "Do you have a secret workout routine? 😄🤔😉 which you have never shared with us...", "makeupandbeautylove6869": "Whats your favorite perfume and nude lip shade???", "nandini_227": "Can you try the peel of makeup, which lit of girls are trying these days on youtube3😀😘😊😄💄", "pragatiiee": "What are your summer essentials ? #asksherryshroff 😘", "madhurya.sundar": "@sherryshroff Hi Sherry, I just wanted to know how you can maintain your fitness regime and manage to continue eating healthy when you're busy or traveling throughout most of the week? #asksherryshroff", "_ayeshasingh": "What is that one thing you cannot live without ? #AskSherryShroff", "simzzle": "What's your wedding dress going to be like? Are you going to have a destination wedding ? ❤️❤️❤️❤️", "riyolaaaa": "#asksherryshroff who is ur inspiration in life?", "ruta_2025": "Which Bollywood hero you like? Please reply 😊😊😊 @sherryshroff @AskSherryShroff", "khyati_sethi": "What are you going to wear on your wedding and other functions? Have an inspiration yet for outfit ideas?", "apuurva": "@sherryshroff chocolates or sour candy?", "iilittlemisssunshineii": "Collab with Indian YouTubers.", "vaibhavi_18": "Which is ur favourite dish cooked by ur mom ? Have u tried to prepare that ur self ? Love u", "fahad.beg": "@sherryshroff What goes up & comes down, But still remains at the same place..??! 😏#asksherryshroff", "thesweetpepper": "#asksherryshroff why YouTube?", "amrita731": "Who has influenced you the most in life and why?", "supritha_29": "@sherryshroff What's your favourite fun thing to do in summer? #asksherryshroff", "bollywoodarian": "Hi Sherry... I'm super awkward while receiving compliments :( I dunno why? Any tips on how to overcome this... P. S. I love you so much 😘 😘 😘", "_paruva_": "Why didnt you do a career in law ? What made you choose this field ? ☺ @sherryshroff #AskSherryShroff", "miprianca": "If u were to wear just a single outfit for lifetime.. what wud u wear??", "ayushi.bansal142": "Please collaborate with anaita!", "madhuboppana_94": "#AskSherryShroff what is weirdest thing you have done r want to do? Luv yu sherry :*", "faizahbeg": "@sherryshroff hey, since your wedding is this Decemeber, I wanted to know if you've any plans for the wedding outfit ? Is it going to be the typical Indian outfit (Parsi outfit) or some other plans, cz you don't seem to be too much into Indian wear #AskSherryShroff", "neena_emil": "@AskSherryShroff given a chance to swap a day with any celebrity, who would it be and what would you be curious to find out ? Swap as in like freakyfriday style:)", "jabeen.sarang": "Yeah. Where in Mumbai do u live and do u have a complete family? Don't answer if u wouldn't want too or too personal! 😄😄", "_jeevan.dhillon": "#asksherryshroff would you consider changing the content of your videos depending on the various phases of your life in the future.", "amreen_j_khan": "#AskSherryShroff As u know That our Trio always wins in ur Meet and Greet and v r always ready to meet u at any time any where. What do u think abt it and cn u show some of ur fav gifts which u recieved from ur fans", "zainab.abdin": "#asksherryshroff 5 wierd things you do every day.", "sneha_issrani": "Favourite place to go on a holiday @sherryshroff #asksherryshroff", "rishikagautam30": "Hi sherry love you and your videos 😘 so my question is what would you do if you wake up as the 5yr old you 😀?", "thekavicliving": "If you face any frustrating situation, how do u deal with it?", "missbhise": "Favourite brand/brands of wrist watches? @sherryshroff #asksherryshroff", "seriouslyynalini": "5 weird things you only do together?", "riya.ojha": "Hey sherry! Which is the most memorable moment of yours so far? @sherryshroff #AskSherryShroff", "akshatatata": "if you had to choose between contouring or highlighting or bronzing, what would it be?? #asksherryshroff @sherryshroff", "mhatari_pranjali": "if you had any superpower what would it be ????", "prachibhanu98": "#AskSherryShroff what is the best place in Mumbai you like to go when you feel low ?", "mansi_6": "#AskSherryShroff Whas is that one thing you wanna change about yourself?", "majorprocrastinator": "#asksherryshroff How do you deal with stress and depeession @sherryshroff ? I go into these depressed phases and mostly from a combination of small factors.. nothing major, but I can't seem to stop thinking about it and what I'm a sad state for really long. Extremely demotivated, depressed and unwelcoming of other people. Also I know it's not a YouTube, modelling, diy , make and fashion question. So no sweat if you don't answer. :)", "dimmy_chongloi": "Are you more like a dress person or jeans?", "anjalilal": "Please tell us some effective dark circles remedy and how is your wedding prep going on?", "mumma_son_life": "Hey #sherry what's the latest fashion trend ??", "meld_09": "If you had to choose between a lipstick and a mascara, what would it be? #asksherryshroff", "iinoskanii": "In your \"draw my life\" video you told that you were a major Tomboy. If you were asked to spend time(a week maybe) being a tomboy now, will it bother you?? #asksherryshroff @sherryshroff ❤😚", "vedantisonsurkar": "What does scherezade mean ?", "piaffee": "Mommy's girl or daddy's princess ?", "meera_subs": "When is your marriage??", "menon_ammu": "GoPro or Dslr while on vacation?", "kirtim_01": "@sherryshroff The wierdest thing u've ever done", "crazykhyati": "@sherryshroff #AsksherryShroff wt makes u so Cheerful n happy??", "swagkumari": "Did u face any struggles while modelling? Yes, u have done a couple of videos telling us about ur modelling career, but is it all happy happy or do u actually face a lot of hell?", "harshitasharma395": "Have you ever learned any dance style or wanted to??#AskSherryShroff💟⚡", "crazlinsane_0914": "Whicj r ur Favorite chocolates????@sherryshroff", "badenoughh": "Which is your favourite music band?", "gaurishukla": "What is your fitness regime? #asksherryshroff", "astha_singh15": "Hay sherry .. I love ur video 💖.. I always look forward to them ... U have inspired me a lot .😍😍. ... ......... 1 question for u ... Can dis be ur last question ... Yes or no", "monicayadav08": "#AskSherryShroff What's on your vision board that you have accomplished and want to accomplish?", "hiraloza.97": "I want to know which is your first video of your own channel.. Please let us know soon @sherryshroff", "gaurichopra": "Do you see yourself as a YouTuber, say after 10-15 years? #AskSherryShroff", "_anujatilak": "#asksherryshroff How did you and vaibhav meet? Where was your first date?", "nivrity_das\nVerified": "Verified", "gurushasbg": "If money was no object, what would you do all day?", "jubeetta": "Did u ever had any pet? Or want to have ? & which one? #asksherryshroff", "chhayachitra_": "What's the wedding plan? Punjabi wedding or parsi wedding? #AskSherryShroff", "creatorup": "So good! :)", "helsi_merulia": "What were your goals in life as a child ?", "hennamic": "Are u a heel person or flats?", "bhavikarathod": "U r going to get married soon so r u planning for big fat wedding with any theme or simple wedding?? & which honeymoon destination u r planning to go??", "itsdhvani": "Where in the world would u like to live for the rest of ur life ????", "lubnaalways": "Who is your best friend sherry? I've never seen you mention any.. Love you!", "haachanta": "Why dont u make a video with anaita!!!!!?????? Some style tips from her may be!?", "nikiitanair": "When will you do a video with Anaita??", "mary_maragkoy": "#asksherryshroff @sherryshroff Have u ever think to organize a world tour?If u do please come to Greece!!!Love you!!^_^", "pankhshrivastava_": "Hii sherry ! I want u to ask that what to do when ur dreams are very diff and u know ur parents won't support it but ur dream is evrything and u r ready for every sacrifice u just want to achieve it and there is absolutely no harm in that dream !! How should I deal with my parents ?", "aanakhanduri": "Why dont you choose a lucky winner , and visit his/her house , personally ? Btw i love youuu", "sanjana.14": "What kind of a wedding have you and Vaibhav decided to have? Any specific theme or a typical big fat destination wedding?", "shrutipathak25": "Which camera do you use for filming? #asksherryshroff", "sundowner882208": "Where do we get the best lace spaghetti or tube inners?", "_aimannaqvi": "Did you see Capt America: Civil War? @sherryshroff", "guptashivangi7": "Where you guys going for your honeymoon? 😍 #AskSherryShroff", "1kingshivani11": "Your inspiration???❤", "jshruti2695": "Where do you see yourself five years from now?", "hasmitachilukuri": "Have you ever been through a breakup ?", "ramyani.sarkar": "Your favourite online shopping destination? #AskSherryShroff", "roooshi28": "@sherryshroff who's your best friend? #AskSherryShroff", "modidhara28": "Tell us about your wedding plans! xoxo", "aa.living\nVerified": "Verified", "simranbhatia11": "Did ur family accept vaibhav in one go or did it take some time for u to convince them?? @AskSherryShroff", "apoorvi28": "@sherryshroff What do you suggest, will help decrease the rate if crimes against women in India? #asksherryshroff 🙁", "i_shwariya": "@sherryshroff wats important for healthy a skin???workout/exercise or daily care wid chemicals or daily care with natural ingredients available in kitchen...", "fai___zah": "What is your favorite lipstick shade? #AskSherryShroff", "janu_deshle": "@sherryshroff Where is the wedding going to be held? Destination wedding or mumbai?", "adi.anjaani": "#asksherryshroff who is your YouTube competition?", "parul_shukla28": "Have you ever worked in any firm or company before? Or you just started off blogging after your graduation?", "mala_9920": "@sherryshroff #asksherryshroff 1. Have you seen people selling make up(mac, urban decay, lakme) on the streets? If yes what are your views about it. Do you think that they're safe to use? 2. What is one bad thing about yourself that you'd like to change? 3. If you could re live a particular phase / stage of your life, what phase/stage would it be?", "design_your_nails_by_isha": "Hi.. Ur fav time pass.. & ur birthday ??#asksherryshroff @sherryshroff", "bhairavi_98": "Do you wax your arms? #asksherryshroff", "lakshiphogaat": "@sherryshroff If you were to swap lives with either Gigi Hadid/Beyonce/Vaibhav, for 1 day who would it be?", "tanyaagg11": "How do you edit your videos ? @sherryshroff", "shayani_maitra": "What is the first thing that you notice in a person when you meet him or her for the first time? #asksherryshroff", "shaneikagonsalves": "Favourite toppings on frozen yogurt?", "sunojoy": "Do you believe in reïncarnation? :)!", "asees_modi": "An incident in your life that you would wish to undo/redo? @sherryshroff", "_jisha_john_": "What are planning to wear on your wedding day ? 😃💗 #asksherryshroff", "ar.krishna.s": "Have u evr had suicide tendencies? Like in ur clg life whn u were not able to complete ur work or before exam or during ur thesis project?", "_kita_j": "Sherry!! Your flawless skin😍 what's the secret?? Do you follow any diet or something?", "sharonxritz": "What do you do when you're depressed??? @sherryshroff", "nomnomnomnm": "Tell us more about the wedding! #SuperHappy #SuperExcited! 🙆🏻💞", "_s.umaiya_": "@sherryshroff", "poojasisodia_94": "Do you think Ross and Rachel were on a break? Or do you think it was Ross' fault? Or are you like me who thinks that they were on a break but that didn't give him the right to sleep with someone? 😋 #AskSherryShroff", "gariimasahai": "What is your recommended brand for cosmetics? #asksherryshroff", "travadizx": "Please suggest a cleanser for normal skin?", "abhisha_shetty": "which is your favourite outfit for summer😆?#asksherryshroff", "gayathrikappagantula": "The roads in India are very dirty so our shoes(soles)get dirty too! But I see that your shoe(soles)are clean!! How?? 😭😭😭", "nashita_sharmeen": "how's ur wedding preparation going on?", "priyanka_gandhok": "What will u keep ur daughters name", "unfuck.the.world": "Why are you the cutest women on this planet ?", "kashini.chopra": "@sherryshroff Which brand was your first collaberation?", "irenekhosla": "How do you manage to bargain so well while street shopping? 🤔👌🏻", "niharika.d": "What is your favourite restraunt in Mumbai??", "shumaila_ali.moody": "Will u move in with vaibahav after marriage like a normal couple...&u look foreigner yet ur purely desi😁", "theunconventional_tribal": "What's your favourite meat, fish and veggies and what's your worst experience in food? #asksherryshroff @sherryshroff", "smritisjoshi": "#asksherryshroff how to shop more within a limited budget", "nishakaravadra12": "#AskSherryShroff Hey how are you, hope you're well! How is the wedding planning going for you and Vaibhav?? 👰🎩", "shriyagrawal": "What food do you eat when you feel stressed or depressed. :))", "_khushiibhatia_": "Your favourite holiday destination apart from New York? #asksherryshroff", "mahek_baradia": "If not model or a YouTuber what would you like to be in your life #askSherryShroff @sherryshroff", "anushitajain": "I have been following u since 2 3 months..and I always find you energized with zeal and happy in your videos.. :) which is really good . .. bt arnt there any days when u are depressed or sad..bt u have to pretend to be happy in ur video ? Want to knw this cz I find hard to pretend happy on sch days. :)", "pallavimastakar": "What is your favourite lip colour? #AskSherryShroff", "vrutti_vru": "#AskSherryShroff watz ur favrt wear?", "kate_shiv": "ketaki @sherryshroff what do you love d most about yourself...", "asmitajain_": "Where is your next holiday trip?? #asksherryshroff", "smrusridharan": "Hi Sherry :* What's the one thing you've learnt from your beautiful relationship? #goals truly❤", "katyayani.rana16": "Your current favourite lipstick ? #asksherryshroff @sherryshroff", "sonia_bedi": "Hair care and body care before and after swimming.", "mahandrilai": "#asksherry what do you do on a holiday ?", "steffrancinameyn": "When are u coming to Abu Dhabi or Dubai ❤️🙌🏻", "damnsuhani": "Where do you film your look books sherry?and if you do it somewhere in public doesn't it seem to be a bit awkward because people in India are continuously staring at you ?", "tanyaaurora": "What's your ideal plan for a day out with your girlfriends!? #AskSherryShroff", "prayashag": "How do you keep yourself away from getting tan?", "the_priyakapoor": "Ur fav timepass? 😁", "sainasekhri": "What is the scope of newcomers in youtube & blogging since the competition is too much?!", "gail_pereira": "What's the biggest fashion faux pas according to you ? #asksherryshroff", "salonidhumal": "Tina fey or amy poehler?", "lishasays": "What advice would you give to all the girls and guys out their who want to become a YouTuber?", "1ditamishra": "Your fav place in india and outside ?", "pavnigaurangi": "who shortened your name from the splendid scherezade to the tiny sherry ?", "sonalnain_": "your fav.hangout?", "unna_teee": "What your next destination on your travel bucket? And your fav clothing brand? #asksherryshroff", "gurkiran_kang": "Favourite superhero- girl and boy", "shinjinisengupta": "How was your trip to Darjeeling? How was the street shopping? How were the people? It's literally one of the most serene places on this planet. My grandparents live four hours away by car from Darjeeling so I have been there more than 3 times and I can't wait to visit again!😋", "mrsverleker": "I love gottadoindia, will there be a gotta do Asia #asksherryshroff", "sakshidoshi_": "Which designer are you going to wear for your wedding #asksherryshroff?", "sonia_duseja": "Where are you going for your honeymoon?", "aishwaryasreedhhar": "What would you be doing if you weren't a YouTuber?", "ishita.sureka": "Are you planning to buy and review the Kylie Lip Kits?", "chaotically.yours": "List your favourite 5 things to do when not youtubing (hobbies maybe)"}