{"sukritigarg18": "@sherryshroff would you rather ride a horse to @vaibhav.talwar's place to marry him 😁", "tanvee0194": "Would you rather be caught in public digging your nose or scratching your butt ?! 😂 @sherryshroff", "alam_sadaf": "@sherryshroff would u rather eat honey or use it as a face mask?? #wouldyourather", "acirle": "Would you rather deliver a baby or wish babies could be mailed at your door step? #wouldyourather", "mxyasau": "Would you rather be young and fat or old and thin", "sharvari_apte": "Would you rather be at home or be outside?", "sambhawigautam": "Would you rather live alone or with Vaibhav's parents after getting married?", "shreya_koduri21": "Would you rather not being able listen to music or not be able to watch tv?", "aasthasachdeva": "Would you rather have a head size of a tennis ball or the size of a watermelon ?", "shreya_mohta": "Would you rather set up a date for each other just for the one last time before wedding for the sake of enjoying bachelorette :D #NaughtyDare", "deeda_96": "Would you rather start a family or would you rather adopt pets?", "suvechchhya": "Would you rather have your brains working perfectly when you get old or would you want your limbs working perfectly? 😝 a weird question indeed! 😄", "siddharthh2610": "Would y'all rather like to meet the Kardashians/Jenners or spend a day alone on an island", "nimzychon": "@sherryshroff would you rather have your #House_burnt or #skin_burnt", "brinda_rao": "Would you rather reborn as a human or something else? 🙂", "the_gal_who_lived": "Would you rather do shopping or not at all?", "sherryshroff\nVerified": "Verified", "sukhman.ra1": "If u had 3 people and u could save 1 person,throw 1 out the window, let 3rd one burn---- virat kohli, varun dhawan, vaibhav and they have no other way of getting out, 😊😊😄", "whiplash5897": "@sherryshroff would you rather stalk Robert Downey Jr. or Benedict Cumberbatch?", "anaayashah_": "@sherryshroff Would you rather shave only your underarms or your legs for the rest of your life?", "ankita.bhalerao": "Would you rather be sherry's (soul) in vaibhav's (body) for a day or vice versa?", "tshering._.w": "would u rather be a famous singer or a great dancer ?@sherryshroff", "_ektayadav_": "@sherryshroff would you rather do waxing on your face or just do threading", "_bhoomigupta_": "#wouldyourather have feet for eyes or eyes for feet?", "mrinaha": "Would you rather reject hosting the Oscars and be happy with your YouTube career or host the Oscars leaving behind your YouTube career. #WouldYouRather @sherryshroff", "siddhibambarkar": "Would you rather sleep all day or eat all day", "shamblix._": "Would you rather cheat on your wife or kill her best friend ? (Hypothetically speaking ) ✌🏿", "vaishnavijoshi7": "would you rather smile for some time or laugh for a long while", "xipiaaz": "Would you rather go to zoooooooooo🐒🐘🐯 or the amusement park🎢🎡🎠", "00hayley": "Would you rather eat 💩 that tastes like 🍔 or a 🍔 that tastes like 💩??.. Love you sheryyy", "pohalmegha": "Would u rather go out wid a lipstick matte or a lipgloss", "1ditamishra": "Would you rather be pretty or wise.", "vrinda_sasidhar": "If you had to choose or else bad-terrible things will fall upon you as these forwards say, would you rather take away wit or sensitivity from your partner for life!!", "tanishaaaaa_": "Would you rather marry Vaibhav or Leonardo dicaprio?😂 @sherryshroff #wouldyourather", "priyanka_k_adnani": "@sherryshroff Would you rather go clubbing & dance all night or go to a quiet place for dinner or something???", "devtrambadiya": "Would you rather paid others bill instead of yours @vaibhav.talwar @sherryshroff", "anuuushkaaa11": "Would you rather dance offbeat or be just perfect at it?", "tanishka_k": "#wouldyourather would you rather like to shop from forever21 or zara @sherryshroff", "beccalicious.girl": "Which superpower would you rather choose Invisibility or Time Travel?", "inari.kitsune": "Would you rather get your heartbroken or be the heart breaker", "_keerthi.sai_": "would u rather have a pet dog or a pet cat??? Or something else?", "kashish__ahuja": "@sherryshroff would u rather go to newyork alone or with VT", "khyatianand": "Would you rather smell like an egg when you burp or have a green cloud appear when you fart?", "jaineedagli": "#wouldyourather get married in December or stay single for little longer ???", "katyayani.rana16": "@sherryshroff would u rather eat nothing and drink vodka or eat the worst cooked food and drink vodka?", "ritika__garg": "Would you rather do skydiving or scuba diving?", "kaamya1021": "Would you rather buy a puppy or a rabbit? #wouldyourather", "ria.kumbhat": "Would you rather eat desserts first or appetisers last?", "ashika.rele": "Would you rather purchase cosmetics from Mac or bobbi brown?", "udeernavolety": "Would you rather wear one outfit for your entire life or not brush your teeth forever @sherryshroff", "adi.anjaani": "Would you rather travel the world alone or live in the same house with your family for the rest of your life", "muskan_malik": "Would you rather be rich or famous", "darshika.tripathi9": "#wouldyourather eat one food for the rest of ur life or starve yourself and take supplements?? :P", "i.vidhibaid": "Would you rather be a brand ambassador for Gucci or personal secretary of Lewis Hamilton !? #wouldyourather", "gail_pereira": "#wouldyourather live a day on chocolate or a day on cheese?", "irhtayag": "Would you rather wear a bikini or onesuit in india", "khxshishah": "😂😂I took a lot of effort in thinking of these questions so please at least answer one of them XD, love you💕", "sophisticatedcallow": "Would you rather wear a saree or a gown at your sister's wedding", "surabhi_ganjiwale": "Would you rather go for your honeymoon to new York or to any luxury cruise????😊😇😘💖🗽🛳"}