{"miss_shradz_chavan": "Hello Sherry ♥♥ Firstly thanks a lot for such a beautiful opportunity. ♥ So My very First Reason to Shop with u is that u have millions of subscribers n followers , N m sure everyone would lovee to have this opportunity to shop with their favourite blogger. My mom says u r 1 in a million for me.. But I actually want to become 1 with this contest.. ♥♥♥ That 1 lucky girl amongst those millions of girls who dream to shop till they drop with you ♥♥♥ To meet u , to get to know u more , to know some secrets of beauty n life from u.. to shop like mads n pick dressss of ur choices .. hehe.. dont know when il be able to see u again.. but im sure this will be the best moment of my life if I win ♥♥♥ #fingerscrossed", "__potatoooo___": "@sherryshroff I'm new to Mumbai and I'm gonna join college here so I gotta do lots of shopping! Hope you help!", "simran.rajanee": "What is better ? Vouchers or shopping with u? Cant decide cos both of u are my favourites❤. I would love to shop with u cos i ssly like ur dressing style a lotttttt. My college is just begining n i definitely need a makeover but my dressing style sucks. So lifestyle will provide me awsome clothes n u will give me super awsome tips! #awesomesauce #lifestyle #shroffer", "bsechicknbiryani": "Just follow you for the giveaway?", "fandomnewbie": "I would love to go on a shopping spree with you because I think you have an amazing sense of style and I would love to have you as a shopping buddy. And also I read on Pinterest that women who shop a lot tend to live longer #truestory 😜 Just a side note, I love your videos and I think you're an inspiration to all girls! ❤️", "ayessshhhaa": "Hey Sherry my name is Aisha I m from Mumbai nd I really want this coz I want to shop in lifestyle but we're r 4 sisters which creates a lot of chaos so plzzzzzzzz if you give me this voucher coz even Eid is coming so I'll do some shopping", "shivaaaaaanii": "Hi sherrrryyyyyy! Ssup ! I would love to come shopping with you❗i'm just as crazy about sales as you are! You could help me out in picking up outfits😁 We could do a lot of girly talk and empty the entire store😂💜", "the_campus_project": "Heyyyyyy Sherrryyy. I love shopping a lot and it's my favvvvvvvvvvvoooorrriiittteeeeee thing to do. You have an amazing fashion sense and since shopping is my fav hobby (after eating and sleeping 😆 ) I'd love to win these vouchers and spend an amazing day with you. PS: We met at the Nike NTC event and we clicked a selfieee together. Hope to meet you soon❤❤❤❤", "raeesahotmess": "You know what's better than a sale? SALE SHOPPING WITH YOUR FAVOURITE BLOGGER! I have adored and envied and copied your incredible style. There could be no match to getting a shopping fix with you! Also, who am I kidding, those vouchers are an absolute DREAM. I don't know what could top a free haul with Sherry Shroff. Cherry on the top, I get to brag about it later 😋 @sherryshroff", "trushiee__": "Firstly i m ur big fan sherry ....jus love u ....ur personality is osum...the way u present urself is so good ....u r osum in all way ....i wanna win this coz shopping with u will b like dream come true ....would get n opportunity to meet u n style myself ur way ....which i feel will b amazing n most unforgettable day in my life ❤", "kanchannegi": "@sherryshroff @lifestylestores all must shop at #LifeStyleSale off sale because awesome deals at awesome prices are available . Trendiest fashion of seasons at great discounts, more savings and lots of fun awaiting at off sale 😊😊😊😊", "upsiii_17": "@sherryshroff @lifestylestores I am just starting college in a few weeks, and having new additions to my wardrobe would be the best thing ever, that too from Sherry herself.. I missed meeting you at the food truck festival in Mumbai, and I really would love to meet you, and shopping with you would be such an add on.. Lifestyle in itself is such an amazing one stop place for shopping, so both favourites put in one would be the best thing that could happen to me ❤", "nehakbhonde": "#sale#contest#win#giveaway @sherryshroff want to win 1 giveaway from u as or giveaway are exciting like u.@lifestylestores you are budget friendly and has exciting offers.", "queenwieene": "hi sherry first of all u r an inspiration and i m nt a resident of mumbai , i live in varanasi but i m ready to come to mumbai to meet u and also shopping and the answer for why i need it is first of becoz of u i always wanted to shop with u as i really like ur taste of clothing and secondly becoz i m joining my college this year and after all the formalities i have no room left to shop trust me( although i m going to one of the best colleges of india but i m paying 4 times more than an average aspirant like me) so i think i m in great need of this shopping. I signed in to insta today only just for this and i really hope u choose me . i would like to say more to u but here if i wrote it would look cheesy so i would say that all when we meet and also lifestyle i want to shop from u guys becoz as much i remember i never buyed anything from lifestyle and just thanku sherry for ur youtube channel it really makes me happy to see ur smilling fcae when i m in tense condition(studies) .", "khushali.dhadda": "Hey sherry❤️ Congratulations on 1,00,000+ subscribers. You totally deserve it, your work is amazing. I've been a follower since long. I am going to Goa next month and really need some nice clothes to bling up the trip so it would be a pleasure to shop with you and be a part of your channel. It's a dream. Hoping you'd notice. Thanks a lot.❤️❤️ #lifestyle #giveaway #sale #contest #getlucky&meetsherry @sherryshroff @lifestylestores", "mansilohare": "It's been great meeting you twice and the pleasure to shop with a fashion icon is gonna be amazing for sure. I love the way you carry you yourself and love love love your dress sense. Its legit cool! Since, college have already started here in Bombay it'll be damn nice to shop more for a year ahead. And and I would love to win this voucher. I'm a girl who loves fashion fusion and basics and Bohemian style side by side and you're the exact person who I can shop with. The reason I want to win this voucher is that I'm more of traveler and a party animal so I NEED CLOTHES everytime I go to new places. Every time I open my closet its like \"I have nothing to wear and that sucks.\" So I think its time to update my closet and jump on new stuff in my wardrobe. And you know what CLOTHES ARE LEGIT LIFE its more of defines your style. So I'm very much into winning this voucher. Its NECESSARY for me to watch all your videos and posts almost everywhere on social media. I LOVE YOUR VIDEOSS and you're an inspiration without a doubt. Hope the stars shine for me. I'd be obliged if I win this! Love you ❤", "sayalitayade_": "@sherryshroff @lifestylestores Honestly I love your fashion sense. It's always so easy and yet the coolest. I look up to you as a style icon and try to watch all of the videos so I could improve on my fashion sense. It would be my pleasure if you choose me. I really would love to go shopping with you and try out some stuff @lifestylestores Hope for the best sherry xx :D", "sheena_apur": "Oh my God!!! I'm from Mumbai. I'd love love love to shop with you. You're my favorite fashion vlogger ever! I would love to meet you and turn my fashion quotient up a notch!", "sherryshroff\nVerified": "Verified", "psyleeee": "Thisss @rutu_turutu", "roseypreet_": "Aww so sad - I missed it - and I don't live in India !!! But I am visiting on augest 3 rd but in punjab", "srushtisamant": "Hi sherry ,😄 I personally love shopping at lifestyle because you get everything under one roof. I love your style and identify with it But the best part about winning would be shopping with you and taking tips from you on clothes,shoes, bags and everything.I would be thrilled to shop with you and learn more about curating my wardrobe well ..Love 💙", "muskannt": "I want to win this shopping spree Bec 1) I mean who doesn't like shopping 2)who doesn't wanna meet u 3) getting famous in a vlog I think that's enough to say y I wanna win this love ya sherry", "kate721997": "@sherryshroff I love love love the way you make videos, they are super fun to watch. I admire you the most. Why I would like to win a shopping spree with you?! Because why not.. you have an amazing style sense plus I would really really like to meet you. It would mean so much to me. You rock.❤❤❤", "ashwini_c": "Shopping is my love and you are my inspiration . nothing gives me more positivity than your videos.i feel confident and I would definitely like to hear you myself without the chords!love", "_paridhi": "I would love to win a shopping spree with you because your sense of style is flawless. You pair up high fashion with smart street buys and the look is effortless. I'd love to incorporate such a sense of style in my everyday dressing. Since I have just begun working, I would love your help and insight into buying flattering fits for formal attire for a not so thin girl like me. Lifestyle stores are my favourite stores to shop from because of the immense variety of brands and styles to choose from for every kind of person, be it male female or kids. Winning this shopping spree would be a highlight of my new beginnings as a working professional and who better than the mighty Sherry Shroff to do it with. PS, I have loved you since up starred as one of the models in the Ek Main Aur Ek Tu video from Bluffmaster and was stoked to find you on Instagram and YouTube!", "shruti_naik": "Hey @sherryshroff !! I want to win this shopping spree with u for 4 reasons: (1) Lifestyle has got a very cool collection of clothes (2) My college is starting soon and I ll be needing lots and lots of clothes (3) You have an amazing sense of fashion which will help me and it will be fun to shop with you because we both love shopping (4) Winning this giveaway will not only make my day, it will make my year 😍 @lifestylestores 😊", "david_happ_": "@sherryshroff Shopping with you is like a dream come true!! You know this person whom I watch over a screen and try to relate with her in anything and then you get a chance of going for shopping with her, can be the best moment of my life. I would love to do that off screen as well. I hope I get a chance to do so. Hoping for the best xx", "jessica_mendes06": "I can't decide what's more rewarding. Shopping with you or going on a lavish shopping spree. Since my teens I have always shopped at @lifestylestores because they deliver such fashion forward clothes, accessories, etc at such an affordable price. My parents used to obviously pay my shopping bills back then. Now I see my friends buying high end branded clothes shelling out a lot of money but I see myself still picking clothes off the @lifestylestores racks. My last year Christmas dress was also from lifestyle and I will always be a loyal customer cause they always have what I need according to my budget & my sense of style. Winning such a huge shopping experience would take me to cloud 9!! And to top that, shopping besides @sherryshroff would leave me with my jaw dropped the entire time!! Really wish to get lucky!!", "deepika_patil": "I want to shop with u because now my college is going to start and i could get a new style in my wardrobe", "r.u.c.h.a": "Shopping with besties is fun ...you are my youtube bestie...sherry and shopping what else could anyone want ..XOXO", "samratdalves": "All time there for shopping", "herroyalhokieness": "Hi @sherryshroff !!!! (In the tone that you say hi 😉) It all started on a bored Sunday afternoon when I was randomly YouTube-browsing. I stumbled on a video of yours about types of bras you own, I think, and found it rather interesting. And so I watched another video, and another and so on. Before I knew it, I was hooked on to your channel and started following you on Snapchat, Instagram and YouTube; basically all the social media sites I'm active on. In about two weeks, I watched almost all your videos. I absolutely ADORE your style, your quirk. Your accessories, clothes, shoes, bags are just TOTALLY fab. So much, that I keep telling all my friends about how obsessed I am with your videos. So, yeah, I guess I'm a Shroffer too now 😁. I have been obsessed with very few things in life(about 3 things, to be precise). I wasn't much of a shopper before, but looking at your stuff just makes me want to shop all the bloody time. Now, I kind of lack a little in the fashion department (little being an understatement), so more than receiving the Rs.10,000 voucher from Lifestyle, I would LOVE to get a chance to shop with YOU and get your advice on things. (Not that I wouldn't just love the Voucher too😸) So, yeah, that's why I think I should get the chance to shop with ya along with that big fat voucher 😂. P.S I hope I don't sound wayyy too obsessive P.P.S. I like Frank Sinatra and vintage stuff too!", "ritagohil": "Hi @sherryshroff hope ur doin great..well ur a beautiful lady in and out.... ur a strong independent girl who just not proved to be awesome then any other but u give a neck to neck competition to all males too...shoppin spree with u would be to know u personally as a human apart from wat we all can get to know through social media.. u surely have the power and let me tell u that yes ur using that for a lott of good stuffs..may god bless u n u do more n more good work..meeting and shoppin wid u will be an altogether differnt experience...and yes i would grab the chance of getting all the style tips from u for my this shopping trip...hope we meet soon. Love n regards to u n ur family..love u girl😚😚😚 u make me even more proud as a girl❤", "amreen_j_khan": "Hey sherry @sherryshroff I love you so much. I have nvr seen a person like you. I am so awaited for ur meet ups and specially every monday and friday I wait fr ur videos even on wednesdays. It will be my pleasure to shop with u. U knw sherry I cnt afford shopping brands and expensive stuff but u r the one who fulfilled my dreams. I love you for that. You are very special to me. I cnt explain ky love for u. I really wanna win this I wanna take lots and lots of memory home. I hope u make my dream come true. I will always pray fr ur success and prosperity. U mean a lot to me. I love U", "mahikaachhibber": "@sherryshroff", "gadashikha": "Hello Sherry....I always wanna meet you...but just bcz of exams n all I can't....I really wanna spend time vth u n wanna shop", "junkylovesfunky": "@sherryshroff really want to meet you in person ... have always loved your dressing sense. .. #wishtowin", "dhruvijain17": "Dear sherry i really want to shop with u because i really admire u and ur dressing style and maybe u are like my elder sister and it feels that u guide me ❤ in my life i really want to experience shopping wth a blogger and if it really happens i wil be on thr top of the world shopping doesnt matter to be but ya! Shopping with u matters me alot❤ ILOVEYOU SHERRY! ❤", "regoarlene": "I want to come and shop with you ... first wow it would be amazing spending time with you..secondly who wouldn't wanna shop ...when it comes to shopping we never say no and to top it the sales:)", "thatgirldevyani": "I want to win this shopping spree because a shopping guidance by you would be great for me. And I would love to meet you. :') ❤❤😘 And haven't really shopped in ages now. -.-", "priyadahiya_": "I so wanted to win 😑", "__a_muse__": "Hey sherry, I m like the worst person when it comes to shopping...I hardly go for shopping my wardrobe needs a change..I follow u n u r style n would love to have a makeover from you ... July is my bday month n a new start to my college life this shopping spree with you would be perfect for a person like me who is a disaster when it comes to having an edge in fashion n shopping.. would love to get styling tips from you as I have a healthier body type would love to be styled by you...@sherryshroff @lifestylestores", "edu_divs27": "@sherryshroff I want to come out of my mom clothes, please help me shop a nice wardrobe sherry!", "hyderabdibiryani": "@sherryshroff I really really want and need this voucher because my birthday is coming up and I don't have any idea about what am I gonna wear. I had a plan of shopping for myself on my birthday but I still couldn't collect enough money :/. And it's my 16th. I might be buying a dress but I just wanted to try my luck here. (don't believe in luck BTW). :) ILY", "_peace_of_me_": "@sherryshroff I m a shopaholic and a fashionista at heart,But my biggest challenge of dressing up has been my shift from a medical student to a professional, and I am stuck with the challenge of satisfying my vibrant self yet being taken seriously at work. So need your help and a new wardrobe!!", "kool_fashionista": "@sherryshroff", "manali_18_": "Its been months n i havent done any shopping for myself plus shopping with u u is like dream come true hope i win this tym love u 😘😘😘", "saloninardekar": "It would be amazing and crazy to go shopping with you 👯", "ishika18m": "Oh no im in pune!", "leenabmewada": "Hi Sherry.. I would love to win this voucher and have a unique experience of shopping with you! Lifestyle store is India's Primark store.. lets go shopping! ☺👭", "smridhikalati": "Hey @sherryshroff , I would love to win a shopping spree with you because you have an excellent dressing sense. Love you. 💕😘", "betty.me19": "Hi dear @sherryshroff I always shop from @lifestylestores because they have very reasonable priced products. I would be very happy to go shopping with a young n beautiful mind like yours.", "vlp1994": "If only I was half as trendier & stylish as you are, I could have ruled the world! So let me go on a shopping spree with you & be the conqueror ;) What say? @lifestylestores", "ayn_dhrita": "Id love to shop wit u it's a lifetime dream to shop wit an model nd i love ur taste of dresses #awesome plus i havnt shopped long time need a voucher plus a smart company 😂😜😜", "deepika_96": "Me and my sister love shopping. And shopping with a style guru would be great . 💃🏻", "jyotiprabha_sahoo": "I would love to go shopping with you because of one and only one reason.. Shopping with Sherry in itself sounds so amazing that u need not have any other reason.. Will be super super super super happy if I get this opportunity.", "punjabirinky": "It will be on spot on for me ! I am switching my job .. And the best part of it is I can wear casuals everyday as there isn't a compulsion for formals unlike my previous job ! And am so happy for it .. This shopping could absolutely make me Happiest on this planet ! And am from Mumbai @sherryshroff", "amulya_1897": "Cause it will be fun filling the bags with every damn Orange thing ♥️", "drish101": "Mumbaikar who loves your style and lifestyle. Getting a shopping spree with you would be a dream 😍😍 I love your style tips and the effortless vibe that all your looks have. I'd love to learn from the very best while shopping at the best place 😆 Also, I'm a college student who never gets to define her style, this could be a wish granted ❤", "mmariammp7": "It would be great opportunity shopping wid yu nd getting to noe yu nd hw yu shop. It would be fun to click pictures wid yu cause yu r so damn funny nd cute. Nd of course free shopping is always a welcome😘😱😍", "aishwarya__auti": "Love your style and wuld love to shop with u 😁😁😁😁", "abhisha_shetty": "it wud b a dream come moment for me to meet you...and spending a whole day with you...i want to meet so badly😭i love you so so muchh sherry❤❤❤", "punjabineelam": "Hey sherry🙋🏻🙋🏻 i would absolutely love to go on a shopping spree with you because i think we have one thing in common thas is love for clothes😍 i love shopping no matter what and this time it would be like a cherry on the cake if i get a chance to come along with you @sherryshroff and also i'll be really happy as i would also get some styling tips from you😬😬 love you anyways❤️", "pranali.belose": "Hi Sherry😊 love to win a time with you as there are so many things of fashion that i can learn from you. You have really inspired me from ur videos. 😘😘😘😘😘😘😘😘 thank you.", "divi2107": "I want to go shopping with you .. as u may help me select good clothes which suits me as I have pathetic sense of fashion.", "literarychills": "I am the kind of person who is confident but I tend to get judgemental about my body and I am very conscious. Hence, my clothes are always from the usual generic rack.After I started watching your videos, I gained confidence. I love how you even proudly sport your scars and blisters. We need more women like you! I don't shop a lot but i would love to feel how a real spree with a fashionista feels like! First things first, we have a lot in common! I have tried a lot of times to make it to a Meet and Greet but :( I hope its high time! Let's meet and discuss the season finale of GoT❤😍 and also jam to the tunes of Nucleya! And shop till we drop! Lots of love to you @sherryshroff ! May the best one win!", "fianafashionforward": "Omg ! @sherryshroff big fan of your style I have seen all your videos and the lookbooks are totally #bomb.com . your outfit combinations are always #onpoint .I missed the meetups you hosted previously ! Love to go on a shopping day with you 😍", "artutopia123": "Hi Sherry, would really love to meet and shop with you❤😃", "rupali__n": "hey sherry ma'am it would a pleasure n life tym experience if I got d chance to shop wid my ideal 😆😄 i hope to get d chance to meet uh n to learn from uh 😆", "dassuneeta": "I buy most of my clothes from lifestyle. I need a whole new wardrobe because I have new projects to work on, my dress code at office has also changed and of course would be great to gets some style tips from u!", "snehal1710": "Hey Sherry I would like to come and shop wid u so dat i can talk more on game of thrones and orange is the new black series as even m a big fan of this shows and sadly I don't have any of my friends following it so we can meet up and go gapshap in it😃", "prachibhanu98": "and it would be Amazing To be in One of Your Vlogs as I see each and Every Video of Yours,Its funny and some are Helpful 😏", "kashish_rustagi": "Because it is my birthday soon and it would be amazing to get an awesome birthday dress owing to your great sense of fashion and style @sherryshroff", "localadkii": "My college is starting in few days and sadly we can wear only kurtis so i would love to shop them with you❤️ You are my style icon and who doesn't love to shop with their style icon..xoxo", "apoorva_jain_": "Lucky Mumbai Shroffers 😆😍", "amy_hot_head": "I love you soo much.. I literally follow u everywhere..!! On every YouTube channel..or any social media.. I love how u connect with us. N ya abt the voucher.. I wud lovee to go shopping with u..I have not shopped since 1n half Yr... So all I have is quit used.. I need some newness in my wardrobe.. With ur help I can shop my heart out and get the best of it for me..and your lovely company! That will be just #PERFECT #NeedThisSoMuch #LoveYouAlways", "madeehaxx": "Hi sherry ! I am 16. It's my parents anniversary the coming week and I would love to give her a few pieces that u personally pick up ! She has done a lot for me and I never got a chance to pay back. This might be materialistic but means a lot to me ! To a lady that has sacrificed her work, socials everything ... Something can mean a lot to her as well as me :)", "daivikak": "Sherry you are the kindest person I have ever met I love you more than my mother hahaha jus sayin but still I love you to that extent and so I wouldn't want to miss this opportunity to shop with my fashion icon and to get tips on fashion n firstly shopping with you and winning the voucher from you will be a dream come true .. it'll be a memory for lifetime with my biggest fashion icon and youtuber :*", "chubbycheeksx": "Hey Sherry! I really love the clothes and the styles that you pull of! Its really beautiful! 😉 I would definitely love to come shop with you and take a few tips and tricks on how to dress well. I hope I get selected! Love You Sherry! 😘 😌 😁👗👠💄👑💖💖", "_main_apni_favorite_hoon": "Hii sherry @sherryshroff ..I badly want this 10k ka shopping voucher ..bcoz .. at 17th July my momdad having 25th wedding anniversary ..soo I want too gift them .. soo fingers crossed😘 .. actually I'm your recent follower .. I meet you at colaba with my friends .. I have no idea about you ..my friend says ohoo I saw sherry I saw sherry .. n then you stop the car n u ask my friend want photo ?..n then my friends take selfies with you..I'm like woww you are very good person..who do things like this..😊", "shivalee_ghadi": "hey sherry! i would love to win this voucher because i love playing with clothes and styling and restyling the pieces i already have! Shopping to me is a visualisation where i keep thinking...wow.. .what can i create out of this piece!??? I am a college student and hence i have to shop within a certain budget...Also Shopping with you would be the best experience ever, having met you once I loved your vibes! I have followed the rules 😀", "malaicadneiro": "@sherryshroff hey sherry coz one need a good shopping partner otherwise we all buy things and never use them. With you it will be different . The perfect duo to spend on clothes worth 1ok", "archanalokahaan": "And I am also going Goa in September..so that's it.it will be great..❤👗👖👕", "vedantisonsurkar": "@sherryshroff i just finished my degree n planning few trips with my friends before joining the job ! Im on the heavier side so would love to get some dressing tips from you... Would love to shop with u & most importantly see u in person ! Ur d cutest 😘", "aditishah13": "I will be mosst happiesst person if i win this voucher and that too you il be helpin me styling that would be cherry on cake..soo i work as well as attend my masters college and m always clueless how to dress up for office and for lectures so i think you can help in this ! And it will be something new for u to style for formals wear..Hope i win and we may meet pretty soon :) Have a great Day.", "anjusrin": "@dalvibhagyashree @sandhyabis Check this out !", "_wonderfully_weird_": "Hahah! *Fingers crossed* XoXo", "dwiti_s_": "sherry i want to stay with u n just draw some inspiration from your style ... i really hope and wish that i get a chance to win this spree with you .. i am a genuine and true follower :) good day and i love you 😊 @sherryshroff @lifestylestores", "pallavimodi2501": "Whose the ultimate shopper?? Sherry ur the rocker, shop,it's a therapy, come let's go on a spree, sherry u n Me,, Me a future lawyer, u see <3 je suis et tu aussi... Qui qui qui... Let's go on the shopping spreeee @-}-- yamzaaaa!!!! B-)", "rajal_3197": "Because I am an Indian GIRL! Shopping is the best thing I can ever do perfectly! You give me a chance to SHOP when you give me money is the fantasy of my life.Moreover,the 'you' is @sherryshroff then hell yeah! I m no moron to not accept that offer😂😂", "nishthamehta_": "I have my birthday coming soon.. I mean next month.. Soo I do wanna shop for my birthday. Also, who doesnt wanna shop with a fashionista. Thanks.", "voguish_burger": "@rhea_althea305", "garvitaujjawalkumar": "Hello there!!! I love your videos so much it's like a routine of mine to watch them every week. Absolutely amazing you are!! Have started following you when you had only 10k followers. And so happy that you are about to cross 99k 😄 Please please choose me!! Pleaseee!!!!! @sherryshroff @lifestylestores #sale #contest #win #giveaway #please #prettyyypleassseeeeee ☺️☺️", "raw_egg_yolk_please": "@sherryshroff also my college will reopen in a couple of weeks.. So I want new clothes :) hope I win this.. Love love #lifestylesale #shroffer #xoxoxo..", "weirdoooo_18": "@sherryshroff i seriously wannaa buy clothes as my college as reopned n i would love to meet u aagain . Due to sum reasons i could not buy clothes dis tym so if i get the voucher i m gonnnaa buy stuffs wid u hoppe i wins it :) #sherryloveya #", "afewtastymorsels": "Booked my Goa flights tickets for July trip. Need to shop for it and who would be a better company than a most loved and reliable fashion blogger than THE SHROFFER ?? Also I am always clueless on what to wear and buy. It would definitely be a mad time for me if I'm the lucky one to get an opportunity to shop with you. #lifestylesale #shrofferlove #shopping", "shreya.apm": "Shroffers", "kaavsv21": "Going for a holiday want some amazing n cool outfits so would like to go shopping with u n we all know that your taste is WOW!!!😍😍😍 so if m lucky God would send me with u for some stupendous shopping,..it would be fun n maddening 😆😆love u loads n waiting to c if m the lucky one😉 @sherryshroff", "ruta_2025": "I want to meet you and I am a shopaholic girl so I think you should choose me ❤😘😍 love u loads! You are adorable😊😊😊 keep the good doing upp👍👌 @sherryshroff @lifestylestores ❤", "sophisticatedcallow": "I wish i lived in Mumbai", "_nikita_parab_": "I just adore you @sherryshroff the first video I saw of you was the one in which you spoke against the people who thnk being fair is equal to being beautiful..and that's the moment I started following you everywhere watching all your videos..you bring in a positive vibe with you..you are a model and successful youtuber but still you seem very down to earth and that's what I love about you and will like to see it personally..and what can be better that shopping for that..😁😁", "nikita.lafemme": "Nobody needs a reason to shop TBH. Having Sherry along is the cherry on the cake. @lifestylestores @sherryshroff.", "ankita_thekedar": "Because you hav fab choice <3 and your clothes r as vibrant and colourful as you... :-)", "tanishaaaaa_": "I sherry! First of all i and my sister came cross your channel just 6 months back and we fell i love with how you make videos about lifestyle, Fashion and what not! You have been my favorite youtuber since then. I have been always planning for attending your meet and greets but the plans always got cancelled because of my exams and other stupid things, i really want to meet and how cool will it be to shop with a cool person like you. Your style is so unique and amazing. Seriously you are the sweetest youtuber i have ever come across because some other youtubers don't even reply back but you always do. I hope i win this time and even if i don't i love you and just keep on making videos and making us happy. We are always with you and I LOVE YOU LOADS❤😘", "_juhi.tarde_": "Greetings!! @sherryshroff I'm not a fan girl type. I follow YouTube to a extend and you are on my top on my list. Other Youtube channels are too much about make up but yours is quite cool it's fun to watch. Taking about the contest. I haven't been shopping much lately because of my busy schedual. I whenever I shop i tend to pick up outfits similar to the ones I own. I mostly shop at @lifestylestores because you get everything under one roof. I really like the way you style your clothes and experiment with thm(tbh you look good in anything you wear ;) ) your clothing style is quite chic,classy , comfortable and easy to carry. So if you help me experiment something new with my body type it's going to help me transform my look. Plus I would love spend some time with you. Shopping is a bonus to it :p.", "prernajohal": "This is not done 😔 what about your Delhi shroffers", "_tanvigadkari_": "One of your oldest followers! Never really got a chance to meet u! Would love to! Also lifestyle has an amazing collection 😍", "vipasha_nigam": "@sherryshroff Because you're the only blogger I follow for fashion advice. I've actually bought so much stuff that you recommended in your videos. I'm getting married in August and as the wedding's coming closer, I've realised that I don't have a lot of Indo-western clothes that I can wear when I meet the million people i'll be required to meet and also wear it to work later. So i'd love to go on a shopping spree with you and now actually buy stuff with you instead of just looking for stuff that you wear or show in your videos.", "_mahikaajain_": "Because*", "dhanashriiii": "Hey sherry.....first of all you are my favourite youtuber and i adore you a lot.I love the way u are always cheerful and happy...i love the positive vibes u send.I have always wanted to meet u since i started watching your videos.And what better way than a shoppng spree that too at @lifestylestores.I love the way u dress up and carry yourself,and i can only imagine what fun it would be to shop together!And sale @lifestylestores gives us another reason to shop....@sherryshroff", "nilofurmulla": "@sherryshroff i want to win the @lifestylestores vouchers because i deserve to live life in style! I need to pamper, glam up, keep it neat and simple, fresh! Lifestyle is a house of brands - everything under on roof. I want to pick up some stuff for home, mum, dad, sis & bro. So everyone & everything is taken care off. I have so many reasons to put the @lifestylestore vouchers to full use with monsoon around, Eid, gifts for siblings, cousins.. hope i am the lucky one ☺ #sale #contest #win #giveaway", "bhumishah247": "Dying to shop wid u...I m from Mumbai only. ...love you", "aarya_patil": "Yayyyyyy! Sherry I'll be very happy to shop with you. shopping time with you will be surely funnnn ... I would love have your tips and tricks of shopping.. Also your dressing sense 😍😍 I would love to be in your vlog ! @sherryshroff! Loveeeeeee youuuuuuu sooooooooooo much #sherry", "sushmitamalgaonkar13": "Omg..love shopping+if it's with you I think this can't get any better..Love you loads.", "gail_pereira": "This is so EXCITING. Reasons I'd love to go on a shopping spree with you 1: I love the collection at @lifestylestores 2: my college is about to begin so I'd love a change in style 3: I really like your sense of style @sherryshroff so I'm sure you'd style me well 4: I always end up shopping for basics so shopping with you will also probably change the way I shop for the better and lastly i really want to meet you since i couldnt the last time because of my exams", "anushka.purohit": "When you think about sherry, what's the first thing that comes to your mind? Shopping! Just imagine walking around, having the best guide with you recommend clothes, shoes and most importantly jewelry for you - and of course sherry is going to vlog, so there's another bonus! It's the first time im in Mumbai for a month, and so having the lifetime experience of going out with my favorite Indian YouTuber will make my trip a 100 times better. <3 plus, going with you will allow me to pick gifts for you since I'll know your style - it'll be the first time I'm not relying on my mum! (That's saying a lot I'll trust you as much as I trust her!) Either way, have fun lovey! <3 @sherryshroff", "zahramuchhala": "I suck @ picking out cloths that suit me and so maybe you could help me out nd hello! Who doesn't love shopping 😅 I m crazy nd fun too...... we could go crazy together 😂", "miss.ponny": "Im you lucky girl with bday going on 1st july", "sia.merchant": "Cz i love u and i love @lifestylestores .. Simple as it could be 😋", "anaghabhosale": "Hiii Sherry.. It will be so much fun to go on shopping with you. I just love lifestyle outfits @lifestylestores You have incredible sense of style and I am your biggest fan... Also featuring on Vlog with you. What more to ask.. love you.. All the best to everyone ❤", "sssoman_18": "MY college just gonna start!I am gonna enter in FYBA so everything is new,new friends and what not.So how can I not go to college with new outfits and that too selected by THE SHERRY SHROFF😭😢😁So exited!💋@sherryshroff", "_beapineapple": "OMG! Shopping with you! That'd be insanely fun plus you have great taste and I think you could help me pick out some great stuff!! Also, I love the collection at @lifestylestores , most things really compliment my body shape. Lastly, I'd love to have a tête-à-tête with you because I think your journey to getting to becoming a vlogger has been really interesting, and maybe that could give me some perspective about some things I'd like to do in my life.", "nehasingh61089": "Hey sherry. This gives me a chance to write what I always felt about you. You are a beautiful soul and a favourite youth icon.", "sanjanaarora08": "Because I love both shopping and you 💕", "rumiammi": "Shopping is so much fun & if i get to do it wid you, it'll b a double-whammy. I have always admired ur sense of style & ur choice of clothing. A shopping spree wid u, where i get to chose the best for free is gonna b a dream cum true! Lifestyle stores hav always been my choice when it comes to fashion clothing so this treat is kinda unbelievable!", "anuja0206": "@lifestylestores & @sherryshroff. Isn't that a perfect combination! Plus Rs.10, 000 worth vouchers. The best thing a girl wants before going away to hostel.", "rishika115": "Hiee sherry...m sum1 who still doesn't knw hw to shop fr clothes fr myself thts y i always go wid mom...m nt at all confident n always end up buying plain clothes...i sooo wanna go fr shoppin wid u coz u r d best mentor i cud eva hav n mayb u can encourage me to experiment a lil bit...i sooo wanna go fr dis shoppin spree wid u...u hav such a positive energy tht i will pray to win dis chance n finally meet u...fingers crossed...proud to b a shroffer😘😘", "binal_thakkar_": "Who don't want to go shopping with u?😍😍😍 n this would be one of my favourite moment to go shopping with u if I would be selected.. I wish I could win so that I could share some amazing moments of shopping with u, waiting for this day...", "__navdeepkaur": "The best part about this meet we will get to know you more and would get to meet and talk to you personally.Like what all things we actually dont know about you.This will be probably the best thing talking to you more than shopping haha", "sakshikherde": "I really want to shop with you because I want to learn style from you. I usually mismatch and then end up wearing wrong combination. I want to learn it from you so I want you to teach me that.", "shikha_3441": "Well shopping with u ? Who an miss thy !! So finally I am entering colg soon for my degree coarse and I really wanna buy new clothes so that I look trendy and fashionable and with ur help and guidance I'll get the best of outfits ! Following u on every social media and seriously fingers crossed bcause I hav almost taken part in all ur giveaways but never won any 😕 hoping for the best 😁😁😁😘❤️😍❣", "beccalicious.girl": "Omg getting to shop with you 😍 Do I need a reason! Well btw I really had hoped to win the giveaway from What's in My Mail video as it would have been my 18th Birthday saviour but unfortunately didn't 🙈🙈 anyways winning this will be great as even my Best Friend's Birthday is approaching soon 😆 Hope to win this *fingers crossed* @lifestylestores @sherryshroff", "be_you_alisha": "Ds is nt done", "the_vivacious_alma": "Hey sherry ! I was not really a youtube person before but when I found out about your channel and I fell in love with your videos ♥ Now I have seen around all of your videos along with COUPLING videos . You are the one person I look up to as I find many similarities in us and you always keep it real ! I was not aware of all meet and greets. But I just wish to meet u once .I would really love to meet u and shop with u. First I admired your sister (anaita) and now I admire you too :-) ♥ I love you sherry :-*", "kinnari_desai": "Hey Sherry I would love to shop with you.. If I win it is going to be fun exp.. I watch all your videos and I really like the way you dress.. It would be awesome to get some tips from you.. I love all the haul videos.. After meeting you at the meet and greet.. I dont wanna miss the opportunity of meeting you again.. Muahhh 😚", "hitaakshijain": "I love shoping as m a fresher m planning to go foh shoping i hope i get a chance to shop with u @sherryshroff loads of love muahhh♡♡", "yogita_sawant55": "This is so cool . I want to shop with you also wanna meet you , you are so adorable😘 and I want to shop bcoz my college my new life in college is going to start 😍", "____moon_child_____": "I would love to shop with you as Eid is nearby and I love you ❤️", "books_netflix_burgers": "I want to hug u n my lifestyleshopping bags .... ... 💕", "tripti_2": "A shopping spree with you at @lifestylestores is like cherry on pie. I like what you wear. How you reflect your persona so a shopping spree with you will be great. Also the college has reopened and who does not need new clothes in their wardrobe and clothes of your choice will be awesome just like your haul videos. Honestly I wouldn't mind to go colaba with you for shopping spree. P.s:- Already dreaming a shopping spree with you @sherryshroff", "ananya_panigrahi": "Hey sherry! Shopping is always fun. But with you it would be like a dream come true. I have always wanted to come down to all your meet ups but some or the other exam used to come in between and my parents wouldn't let me go and before my college starts, I so want to meet you. Moreover 3rd July is my birthday and this is probably the best birthday gift I could receive. 💗 Love you sherry! Fangirling. 💗", "ruchimehtachauhan": "Lifestyle as d name suggest can style ur life n shopping with a fashionaista like you sherry it can further enhance personality with ur guidance and your style...so live Life Sherry Style....", "payalraghani": "Who wouldn't wanna go shopping with u? U have an amazing sense of style with comport ! I am in the process of loosing weight and changing my food habits a lot of cloths don't fit and I really need a change of wardrobe and a makeover and I love outfits at lifestyles reasonable and trendy and I am on the edge of finding a job as I got done with college and my parents won't finance me anymore which is a good thing to make me independent but Who doesn't wanna feel go when going to work 😋😋😋😋 so I would love to go on a nice shopping date with u ❤️❤️❤️ @sherryshroff @lifestylestores #shroffers", "aarzoo_dhall": "U r the idol and icon for fashion and going to shopping tht too for a store lke @lifestylestores which will help me to grace my looks for their wide variety of options and being wid u will guide me whch outfit will be amazing... Being a shroffer this a lucky opportunity and I don't wnna miss a chance to meet and come up on ur vlog. Pls pck me sherry😘😘😘😘", "raashimudholkar": "THIS IS THE BEST 💜💜. I do not live in Mumbai but I live in Pune and that's close enough :(. I could drive there.", "vidisha_ramani": "Hey sherry ! I don't want the vouchers for me but I want dis for a friend of me who's from a conservative family and the financial status of her family is also between lower and lower middle class so she is not able to afford any thing much and she is doing CA but when ever I meet her I get to c her in couple of dresses she own I really want u to give dis to her..Thank you", "zorico13": "Only Mumbai😔😔", "shivani.gadhiaa": "Bcoz I love you a lot and I love shopping too !!!!!! And plz I beg u plz choose me !!!! Plz take me !!!!! Hope you have more and more subscribers and followers !!!! Love u a lot @sherryshroff", "nudetoberries": "Hi @sherryshroff I don't know what much to say.. Like I'm totally blank but all I can say is it's my birthday on 2nd July and who wouldn't love to win something big like this on a birthday. I badly wanna shop with YOU. I need lot of fashion guidance as well.. I never won tho I always participate in all the giveaways n stuff 😖 this time I hope things work out for me 😉✌🏻️love you #shroffers", "shreya.shindee": "Aaaaaaaaaaaaaaaaaaaa *I'm screaming* A shopping spree with u 😍 This would be more than I have ever asked for. A perfect post birthday gift 😍 And the best part is that you'll be along and will guide me to pic up the most pretty outfits and I can finally have something what u will approve. If I get the chance to shop with u I will surely get a piece which u will pick 😍 WAITING TO SHOP WITH YOU ❤ XOXO SHREYA 😘", "sharanya.ramesh": "@sherryshroff ,Shopping with you is going to be as crazy it can get! Shopping with you in lifestyle is getting to combine the best blogger with one of best sale in the country! This would mean a lot as you are the ONLY blogger i can relate to ! #sale #contest #giveaway #win", "jainy_gala": "Your dressing sense is just the best !!! And it would be great shopping with you as I need guidance for shopping as I suck at fashion 😔 So hope that I would get to shop with you !!! Andddd if not shop atleast meet you once 😁!!! Love you #happyshroffer 😃", "ayeshasara98": "Okay so i always try n loose n i adore you so let me try again, i want to win this becoz eid is comn and i wanna shop n i m not allowed to spend money :( so hope i can shop with you fingers crossed😭🙏🏻 @sherryshroff @lifestylestores #giveaway", "desai_vaidehi_": "@sherryshroff shopping shopping and shopping... It would be my pleasure to shop with you...", "tabibazaman": "And where is the store ?", "malavikanair_7": "@sherryshroff first of all I love you , now why I want this ? To be honest I am not much into shopping I am pyjama girl but by august my college will be starting so yeah I really have to get some clothes for myself and in colleges as u know there r plenty of restrictions , so if u will there with me u can actually make normal tee also cool with your styling and yeah if I win this I will be really in benefit I dont think then I will have to shop again. For the whole year , and even though I don't win this I really wanna meet you sherry I adore you srsly so yeah that's it I love you", "dishasetia13": "I wish I was living in Mumbai.", "ceme_s": "I really love your clothing haul videos and so do i love your style. And who would miss a chance to go shopping with you ❤ It would be a great pleasure to shop with you. XOXOXO ❤", "keyashah47": "This is amazing ... I was just waiting for some opportunity like this .. I have missed your meet and greets and always wanted to hang around w you .. OMG I want to grab this opportunity because I just passed 10th and am getting into college so I need outfits also I am going for a tour... I have shopped from lifestyle previously and their collection is fantabulous .. I love you a lot ❤️❤️❤️", "rediliciousme": "It will be like living in the parallel universe if I got a chance to go shopping with you. With your styling help i would love to shop for not only me but also for my Mom & Dad & family as they have their anniversary coming up. Would love to gift them something with your styling advice. 😍😍 I think my family will love this too. Can't wait to get Lucky 🙌 fingers crossed. @sherryshroff @lifestylestores", "silky_maurya": "No one can resist the offer hence I would love to win this contest @lifestylestores @sherryshroff", "irupaljain": "I wont mind shopping with you anywhere! I would love to shop.with you in sarojini nagar also! I so wish I lived in Mumbai! You're just too awesome ar shopping!", "hippiekhush": "Heyy Sherryyy. I would love to shop with you, Like who wouldn't? Your such a great icon and so good sense of dressing you have. And I always get difficulty in shopping like does it will look good or will it suit me and blah blah. So I really want to shop with youu. XOXO.", "ayesha_1012": "Wow...this is amazing..please choose me coz ive not shopped for a vry long time and I would love shopping something for my mum as well as for myself and I think u would be the best person who could help me out in shopping clothes for my mum..@sherryshroff", "kashishtalreja": "@sherryshroff this is so cool I have been wanting to meet you so bad and have followed you from the start. Well I would love to win this contest as my college is starting really soon and guess what I got my admission in jaihind ✌🏻️. I really need a guide to help me shop for my FYJC. Hope I win. Love you so much 💋. #sale #contest #win #giveaway", "divya_831": "This is completely cray- cray !! Shopping with you would be awesome on so many levels I can't even ...!!!!!! I think you have great taste And you understand body type easily . I'm really really slim and it gets a bit tricky to get clothes my size . If I have an eye like yours to give me suggestions .. Well what else could you ask for ! So .. Well yeah . I don't have more to say . Have a nice day :)", "anaayashah_": "Mee 🙌🏻", "ria_tattoomedragon": "This is craxy! I have horrible fashion sence and it wud be a privilege to go shop with you.. Im Sure u wud guide me and help me buy the perfect yet stylish cloths that wud help. My personality stand out like how you do.. @sherryshroff it would be the perfect wardrobe. Makeover which I really need. also @lifestylestores is my go to place for all quick or casual or wedding shopping cause it's got all my fav brands and a huge variety to shop from for any occasion.. This competition is a perfect blend of the perfect shop with the talentd stylist. Amazing 💙 so hope to won. This chance!", "priyanka_dasika": "This is amazing.. I would love to win this because I just got a new job and need to revamp my wardrobe coz this new work place has a dress code.. Also I love @lifestylestores n shop from them a lot", "gurleeen_pabla": "@styleinsense @purenarcissism14_hiral @clickthatstyles @bhaavle @naturally.fashionable @_deboleena_ @runwayhacks_riddhi to all you fashion lovers.. This might be useful 😝😜", "aartibhagat_24": "Hii Sherry!! I really want to win this contest coz my college is gonna begin by next month and I really want to shop all awesome outfits for my college and shopping with you would be amazing!!! Plzz sherry I really want to win this contest! @sherryshroff @lifestylestores #sale #contest #win #giveaway", "pooja_amin__": "Shreeyyyy❤️ i please choose me", "sannie1307": "@sherryshroff I just wanna win these @lifestylestores vouchers because after such a long year finally my BF is coming home to meet me, when he was away he has done a really great job doing his stuff for me....& on my birthday which is 13th July he's coming to meet me & this will be our second meet & I really wanna look good & beautiful just for him 💖 please be my fairy godmother 💖💖💖 but as per your rules I don't stay in Mumbai 😟, I stay in Hyderabad 😞....but it's totally upto you 😊😊 it was just my heart's desire I commented here 😊", "kanchagarwal": "@sherryshroff @lifestylestores sherry, i dont know if i will win or not bt a opportunity like this is not to be missed. Shopping with you will make me understand whts your thought process when you shop. I am exceptionally bad at shopping, with my mom shouting at me almost everytime i shop alone 😅. A shopping day with you will save me from those future shoutings and meeting you would just be a cherry on top of a cake. #sale #contest #win #giveaway", "shrew_tea": "Liked and followed 👍I would love to win this contest as it would be great to go shopping with you and learn how to choose an outfit according to ones size and how to pair different clothes to suite my frame and get tips from you on how to plan a outfit according to any event ..you are such an inspiration to me ☺️ i would love to get your opinion and have an amazing time shopping @lifestylestores", "purvirambhiya": "@sherryshroff @lifestylestores Shopping is the only cheer that can make a girl happy. The only reason I would like to go shopping with you is because I can tell the world - who got lucky!? So hoping to win this one. Love XOXO Purvvv.", "darshanamaniar": "Who wouldn't want to go shopping with you? You're a style icon.. I have just joined office and find it really difficult to work with formals! I love your fashion sense and it would be great to get some #awesomesauce advice and go shopping with you sherry! @sherryshroff @lifestylestores", "scoopwithree": "@shivangireviews", "allaboutmonali": "All requirements done ! I would love to win this as you are inspiration to many girls @sherryshroff and who doesnt like shopping ? @lifestylestores is store which the most affordable and budget friendly too , i love to shop from there specially ginger is my favourite there .. As i dont have luck with winning , i wish i could win this .. Would be on cloud 9", "aishwarya_devade": "First, I want to go shopping because I haven't shopped in a while...it's literally been 1 year! Secondly, who dosnt want to go shopping with yoh? You have a great fashion sense and might be you could teach me a thing or two?! @lifestylestores @sherryshroff", "smiledisha31": "OMG.... This is so amazing... I am so excited... I would love to win this because I love your lookbooks and love your dressing sense so I would be great chance to learn something from you about styling tips and would be amazing going shopping with you.... This is such a great chance... Love you....", "ishwarithadhani": "I met you at the airport but were so sweet even then inspire of being tired, I can't even imagine how it would be if you weren't, it would be the perfect opportunity 😚😚", "boisterous_oak": "Take me with you kyunki aap janate nahi mera baap kaun hai.😂JK.. it would be so much fun shopping with you. Nothing will go wrong in making new impressions at the college with u created avatars😉. And that too free. That is sooo sone pe suhaga😍😍😍", "hirak.vora": "@sherryshroff I would love to shop with u at lifestyle because nothing but shopping with u would be a better present for me on my birthday which is on the 4th of July. I truly appreciate the good,amazing YouTube work u are doing n I am proud to be one of yr shroffers", "prettycheeks1291": "Ye..will definelty gona check out the stores..@sherryshroff 👍👍", "salonivartak": "I would love to win because my mom had banned me from shopping few months back I spended alot of my pocket money n now i dont hve money to buy clothes. Plz make me win. Sale is going on n i cant sit at home plz @sherryshroff @lifestylestores", "loudeaters": "Wohooo! Pick me pretty please 😇 #shoptillyoudrop @lifestylestores @sherryshroff #vloggersgoshopping", "a9iti_": "@sherryshroff and @lifestylestores :) :)", "drashtidaniii": "@sherryshroff I would love to shopping with you because I love shopping and I love you so if I think about it having both shopping as well as you with me what a wonderful evening of my life would it be..also I'm an aspiring YouTuber and blogger I need some tips and tricks about fashion and youtubing which who better than you could give me.. I love lifestyle stores it's been 2 years that I shop regularly at lifestyle stores so it's one of my favourtire store so that makes it three best things 😍😍😍 I'm dieng already though at the end of the day it's on luck so may the best one Winn ❤️ love you sherry❤️", "kapooraishwarya": "It'd be such a lovely experience to go shopping with you to a place that houses amazing brands! @lifestylestores has some of the best deals and to have your guidance figuring our outfits would make it for sure the best day of the year!", "the_gal_who_lived": "Some*", "garima143": "Being shopaholic.... Wen m shopping world seems awesome .. Lol ..... We all have being following ur shopping hauls ur so good at it who can loose a chance to shop wid u ...", "priiya.vishaal": "Coz i love lifestyle and a big shopperholic @sherryshroff @lifestylestores", "kshitija.sankhe": "@sherryshroff who wont like to shop with cutest YouTuber sherry shroff....I would love to shop with u coz I love the way u dress up...its not dull and boring....its simple yet stylish!!! Hope to win a chance to meet u and shop with u @lifestylestores", "nausheenmehta": "@sherryshroff I want to enter this contest for my sister as her bday is coming up and it would be a perfect bday gift if she gets to shop with you even minus the vouchers. She is a big fan and right now she's busy making the chokers you made a video about. She gets shy to express and that's why she has been writing letters for you but has never sent it since her last bday. She once saw you in town but was too shy to come up and talk to you. You are her inspiration for her. And because of you she wants to start a YouTube channel, so please pick her. @lifestylestores @sherryshroff", "aay_pathak": "I want to go on a shopping spree with you because you have an amazing fashion sense which I sadly do no have. Also, I need a complete wardrobe makeover because I'll be heading to college next month. So this could be of great help to me. 😊😊 This will be an amazing opportunity for me. 💙", "shhhivika": "I would love to go shopping with you! I'm soon going to start working! So I am going to have a lifestyle change, for which I need to start a new wardrobe. Girls always need advice from their girlfriends when shopping. And what better girlfriend to have as a shopping partner than you! I love your style and would love to inculcate that in my wardrobe. 💖😍", "monicayadav08": "It's high time i win something 😂 because my neice and sister are leaving the country in 15 days and i need to buy something for them as a farewell present. ❤ @lifestylestores @sherryshroff", "eatloveandshop": "Because more than the vouchers and shopping I would love to meet you @sherryshroff #awesomesauce", "amritadhande": "I wanna do shopping with you...thats it...so I wanna win... :) lots of love @sherryshroff", "bhavna_narang11": "Hey sherry i would love to shop with u... its would be a gr8 oppourtinity for me to shop n get some styling tips frm you... i hve nt been getting any good stuff frm ages i really need to do some shopping... hope to win this time✌@sherryshroff", "shradhaa51": "@_myra009_ join in", "beautyblogstudio": "@sherryshroff I would love to go on a shopping spree with you coz you are all about fashion and I would certainly know much more about it while shopping with you. I Absolutely love your fashion sense which is simple yet stylish. Love you. 😎😉😍😘😘", "ramona_lewiszaryekar": "Hi sherry I would love to win this competition cause evrythn I buy my bf and my I go like this is the thing sherry has or wore or reviewed about. I love your page and follow all the videos you post even coupling. It would be great if I would win because it would great to have you help me pick up new stuffs @sherryshroff @lifestylestores", "ms.adrene": "Because I admire you a lot and watch all your videos , I want to start my own vlog & with you it would be a great start! Shopping will be a bonus as it's my birthday month! @sherryshroff ! ❤💖 😙", "gala_bhakti": "I wanttttt to shop with you! You are such a style statement! I cant miss a chance to shop with you plus the cherry on the cake is I will be featured on the vlog as well! Love you!💕", "bhavikarathod": "Omg..shopping with u makes butterflies in my stomach..ur sense for fashion,clothes, specially funky accesories totally stands out😍 I would be love lucky one to do shopping with u..😊@lifestylestores @sherryshroff", "_prarthana_p": "Hi sherry! I want to win this bcoz ur fashion sense is just awesome (we all know that😜)...u can make me feel lucky by giving me a chance to shop with you..and yes, I love you 😘😘 @sherryshroff", "riya.sankhe": "Shopping with you would give me some better tips regarding fashion & also it would me fun because I have been watching your videos & they helped me kinda :p also I would take some tips for college collection! And also get a chance to know you a bit <3", "medha2195": "Well, I just completed with my graduation and going to start working soon, first jobs are always kind of a big deal! In need of work cloths and going on shopping spree with YOU and you helping me will just make me go gaga with happiness! 😃 #contest", "shraddhavanra": "Would love to go on a shopping spree with you so that I can meet you and second thing that soon I am going to new workplace...", "thatpisceangirl": "Because I simply can't miss this! You're my favorite blogger and vlogger and this would be my chance not just to meet you but also learn from you! Geee 😁 Also, coz lifestyle offers a gamut of brands under one roof, it's a treat shopping there! Hence, going on a shopping spree with @sherryshroff at @lifestylestores would be epic! Nothing more I can literally ask for, this monsoon season!", "suvi3890": "Its my birthday nxt month 😋😜 n ofcrse vll get chance to meet u 😍😘", "_khyatimehta": "I wud love to meet u and shopping with u will b dream cm true", "a_blah_naari": "Because I don't really follow many bloggers, and you seem to be someone whose head is actually below the clouds. And, I am also kind of a good company, I think! @sherryshroff", "arpitajk": "Which girl would say no to shopping, and with sherry it would be cherry on the top", "lavee10": "@sherryshroff Wow sherry this is seriously #awesomesauce I wanna win these vouchers coz I love shopping @lifestylestores all the time including when their is a sale coz they have so many brands in their stores so we are spoilt for choices Be it Ginger, code, Melange vero moda, only and many many more..And with these vouchers I can ship till I drop as whenever I go shopping there is a limited budget..Also along with myself I will shop for my mom, sister and my hubby as well 🙌 And going for shopping with u will be so much fun, will get to spend so much time with u and will also get to see ur shopping tips and tricks when there is a sale 😀 ..I have never won any of ur giveaways so keeping my fingers crossed this time 😉", "_khushbuk_": "I would love to go shopping with you @sherryshroff becoz you have an amazing taste in fashion and @lifestylestores has the most amazing collection in everything. You do the most superb haul videos , so shopping with you during sale is gonna be so awesome...#saletime #sherryshroff #lifestylestore", "vidithabhandary": "Sad iam not from Mumbai😔", "rajeshreemoily": "Omg!!!! I soo want to win this!!! just out of my maternity outfits and looking to get back to my style with lifestyle clothes. 💟", "sayligavhale": "Hahaha I hope you know where Thane is 😅😅 P.S. #iloveyourvideos @sherryshroff", "_bhoomigupta_": "My college is barely starting in a months time and I'm short on clothes, really I am, I know you'd really be able to help me with that and I'd be really grateful. I love you, thanks for the opportunity ❤️ @sherryshroff", "miss_nawabi": "Yaayyy!!! Cos im broke and i wanna shop something for eid 😒", "eesha_singhh": "I want to win because who wouldn't want to shop with u n get as fashionable as you are your dressing is goals n so are lifestyle clothes I really hope to win did all the rules", "thebeautyichh": "@sherryshroff I would be ecstatic if I could win this giveaway! I love shopping from lifestyle and I would really love to meet you as well.. Thanks for the lovely giveaway.. Love ❤️", "jyotik1990": "Wow. I would love to go on shopping spree with you sherry as your style is something i like the most,Sweet & simple & also i need someone who can help me out with the outfit that suits me the best. 👻", "upadhyay.nishita": "I love you sherry. I see all your videos as soon as they are out. So basically I am student and there is no source of income at all and I don't think I'll ever be able to shop so much ever. And I soooooo want to shop with you seeing you live is like a dream come true sooo please please 😚😚", "shrutigupta2610": "@sherryshroff and what about the delhi resident. Not fair😟😩😩😩😩. Luv u a lot sherry as others loved u. Do something for us also. Ill also participate. Anyways. Ill share this with my frnds may be they can win a chance to go shpng with u🙌🙌🙌🙌"}