{"antiboringposts": "Would you ever like to come in bollywood movies??? If no then why??????", "rabia_k9o1": "@sherryshroff what camera did you use for the first time to shoot a video/vlog? And how was your experience? What is your first ever video on your phone? #asksherry #AskSherry #shroffers ♥", "malavikanair_7": "Ur height", "poojasureshchavan": "Wats ur height age? And education did u pursue", "shrutieeejhaaa": "Whats your fitness routine? And how do you manage to eat well in your busy schedule?", "shradhamalik02": "Hi Sherry! What would you say about using color and other chemical treatment on hair? Does color damage hair? And are chemical treatments like smoothening, rebounding really helpful or led to worse consequences in the long run?", "akshitasharma263": "Whats your deepest fear????", "sancharipan": "To start with I find you super amazing. And I wanna ask you do have any plans regarding writing a book? I think you should.", "shweta_borgaonkar": "Are u gonna shoot ur videos in ur room also after marriage ? I hope u dooo...#loveya", "kumarii1234": "@sherryshroff please do a sister tag", "suvechchhya": "Are you going to opt for the same kinda doom that you live in now, after marriage? Please do so.. Coz we shroffers loooove your room <3 love you", "sssoman_18": "Who is in the picture with you?The photographes which are in your bedroom the ones we can see always behind you in video's when you shoot in your room😜Wanted to ask this from ages😛I hope you aNswer,exited who are they!", "the_vivacious_alma": "Hey sherry.... this might be a repeated question but I would like to ask u whether Which is your favourite fashion magazine and who is your fashion inspiration ? ♥ :-) #asksherry @sherryshroff", "sanishaforever": "What motivates you to get back after a long holiday or even a long day and still get going with filming a video? Your fans, passion or something else?", "the_priyakapoor": "How much time it will take to make a video(including editing)?? 😋", "its_rincy": "Imagine yourself in twenty years. What do you see?", "antiboringposts2": "Is there any subscriber restriction to earn money on youtube?please answer", "anushkamanoj.20": "Which brand would you recommend to shop for casuals ???", "black_21__": "How to have credit card to buy stuff if iam just a student", "sherryshroff\nVerified": "Verified", "devlina_bajaj": "What are your views on women who are dependent on men to support them financially?", "aakritigoswami98": "Have you ever regretted anything ?? And what was that?", "hera_shaikh": "Which movie would you watch again and again but still love it", "maithi.lee": "What is the thing that you would hold on to the most??", "samudralasreepranavi": "#asksherry Have you ever being mentally sick ??", "anaayashah_": "Are you Vaibhav gonna adopt a dog?? If you would which one?? #asksherry", "__anuveeeet__": "One lip color you wouldnt mind wearing for the rest of your life?💄 #asksherry", "raveena_tekwani": "What software you edit your videos with? #asksherry #asksherry", "madhulikasharmaa": "What did you wanna be growing up as a kid? #asksherry", "rashidhingra_": "Hi @sherryshroff love ur vedios. Also Vaibhav nd u look adorable together. 😘😘", "manyaaaaaaaaaa": "If you were to eat just three things for a month, what would you choose?", "seekha_swarupa": "If not then plz do a hair care routine inorder to smoothen the hairs...", "sohini.karmakar": "Would you like to or want to visit California? If so, do u have any plans in the near future?", "dikshaaa.p": "U and kanan are friends? O u both just had a collab for the video??", "deepika_patil": "why are youtubers more free sharing their life with every1 than filmstars???!!!!!!", "huzefa_": "Are you going to do more gottado India vlogs? We all loved them!! 💙", "anvikamaini": "Hi @sherryshroff request you to do a video for styling different body types . what is that one thing that heavier girls should opt when styling themselves to help flaunt their body type #asksherry", "shah_niddhi": "Which is your favourite Parsi dish? #AskSherry", "prettyskyfetish": "You have so many fanss.. I just want to ask if you could do everything that you want to just like that. What would you do for your fans.. (Who make you who you are. ) #asksherry", "dhrithi2002": "When are you doing a meetup in Bangalore ?", "aliak0998": "Hey sherry I know it's strange but...what's ur wieght?", "4_wanderlust": "How are you so adorable?❤️😍", "amiti_gupta": "What if there was no more interenet?", "arja_aventador": "What's your favourite flavour of gelato and what's your favourite cocktail? Are you a savoury person or a dessert person? @sherryshroff ^_^", "humakhurana": "HEY sherry! Ohk my question to u is wht was that 1st thought that made u to decide to become a Youtuber!", "_____jasminemadhok": "Most embarrassing moment ? @sherryshroff", "trisha_nagpal": "How often do you meet vaibhav ??", "kanankotak1": "When was the last time you fractured your hand? 🙈 and SHARE SOME CHILDHOOD MEMORIES🙈🙈❤", "nidheeee_": "What TV shows would you recommend? @sherryshroff #asksherry", "kumarshruthisasi": "Love watching your videos Sherry!! My question to you is regarding the bblunt climate control anti-frizz leave in cream. Does the cream make your hair sticky and after using it within how many days do we have to wash our hair?", "counsellor786108": "Hi sherry... I want to migrate to some foreign country.... Bt I hv never been to one... Plzzz suggest me its better to stay in india or foreign??? U hv been to many places... Plzzz help....", "upsiii_17": "Mumbai or Delhi? #AskSherry", "ash_0412": "#asksherry @sherryshroff hi sherryy i love ur videos alott and my question is can you make a video on intimate areas hygine and cleaning? And suggest any products to keep that area clean and fresh all day long?", "raashimudholkar": "What if you could eat whatever you want without having to workout ever again? #Asksherry @sherryshroff", "_nivedita_malhotra_": "Have you ever been to Punjab? If not, are you planning or wish to go there anytime in your life?", "sujata_salve": "@sherryshroff Justin bieber or one direction???", "dwijabaxi": "How do you maintain your high metabolism? How was your first Marathon training experience?", "rachana_sh": "have you ever fought with ur sister for silly matters ?? 💜💛💚", "prrernaa": "How did you start all this?? You're super prettyy 💓", "dishasetia13": "What will be the colour of your and vaibhav's wedding dress?? #asksherry love you :*", "punjabineelam": "Which is your current fav snapchat filter???😂😂 #asksherry", "zainab__college": "#asksherry how many kids u want? I hope its not too personal. P.s i love u", "aparajita.arpita1": "What was your very first job??? Love you and your videos sherry!!!", "vedantisonsurkar": "@sherryshroff ur favourite restaurant in mumbai n abroad ??", "keerthi_rao_": "Which is your favourite south Indian food?", "meera_subs": "Where do you see yourself in 7 years ps I love you😍😍😘", "_main_apni_favorite_hoon": "On which basis you select the winner of the giveaway contest? @sherryshroff 😂 bcoz soooo many people are interested ..", "alikaanil14": "Hey @sherryshroff.. I love u.. Could you please tell us if u are following any to-be bridral skin care ritual? And what all u shopped from ahmendabad.?..", "_reshu123": "What is the one thing which you love most in your room?", "gail_pereira": "What's your take on the Salman Khan comment ?", "vaishnavijoshi7": "your take on spiritual beliefs?", "fandomnewbie": "Who is your favourite game of thrones character and why?", "chhavimishra_": "Do a prank call on your best friend saying you want to quit you tube😝.P.S. I love u so much😘😘", "aartibhagat_24": "@sherry Describe yourself in 5 words...... #AskSherry #shroffer", "a.jha_dreamer": "Hey i wanted to ask skincare and haircare fr monsoon i hav combi skin and normal thin hair @sherryshroff", "msjahnavi": "If u ever get inked what would it be and on which part of your body", "kaur_mankirat3108": "Hey sherry.... Do you use face mist? How effective is that? #asksherry", "silky_maurya": "If you ever have a chance to 're live a phase or a moment of your life which phase or moment would you like to go back to ? #asksherry @sherryshroff", "simonedeee": "Would you like to study further like vaibhav ?👀📚 #asksherry @sherryshroff", "andukuru": "What is that one must see place in the world according to you? And y? Also what is your favorite destination in India? Love you😃", "hijaacckk": "Which is your favorite shampoo brand for curly bumpy hair? #asksherry", "dahee_wada": "What kind of novels do you read?! Which one's are your favourite?!", "gadashikha": "Go to ur gallery...swipe the screen 3 times n click a photo..n explain (without seeing)", "praj06": "Which is your favourite pet??why?😊", "aashnitalati": "List the names of all the fans' names that you know", "smruti_bapat": "Have you read hary potter??", "_aqsa_chougle_": "Which songs do you prefer Hollywood or Bollywood songs #asksherry", "nitin.tyagi.507679": "Sweet", "neel76": "What should a plus size woman not do in terms of makeup and clothes. Your tips and suggestions", "aarya_patil": "Heyyy which is your favourite book currently!?", "mrinaha": "If not a YouTuber, what would you have been? @sherryshroff #AskSherry", "mehek9901": "Tell us a quote that describes you... #asksherry lots of love 😘", "kuljeet_brar_kaur": "What are your travellingplans next? #asksherry", "abhisha_shetty": "your current fav song?#asksherry....and i love you so much❤❤❤", "cloudy_thoughts9": "You travel a lot and have to do a lot of youtube too..also other works...how do you manage all of that ..looking so effortless and amazing...?..#asksherry ..u r adorable..luv uu !😘☺", "rheajshetty": "@whynotniharika yeah 😂", "aditi_singh___": "Do u still have acne problem? If so then what do u do? #asksherry", "footprints_on_sand": "For humid weather like mumbai and kolkata, what should girls working for 6-7hours in non-AC offices follow as a makeup routine (Simantini)", "dvyarathore": "If you were a quote what would it be?", "__.ishu.__": "What's the worst pickup line you got from someone ?", "keerthireddy_kandi": "What are your future plans sherry??", "saruuuda": "Hi Sherry, do you really go through all the comments and analyze and then select a few out of them? 🤔Or do you just pick questions in random? 🤓", "aaliya_1401": "What is your take on a sensitive topic like rape? #asksherry @sherryshroff", "the.chromatic.canvas": "Do you have a way to receive compliments without being awkward about them ? I feel taking compliments is a tricky situation!", "mrs_butterfingers30": "hi sherry i wanted to ask bad experiences in modelling n y u left it??", "chandrimachauhan": "Whats your scariest nightmare? And your one dream you want to turn into reality?? @sherryshroff #asksherryshroff", "manishap2106": "How did you first meet Vaibhav's parents/family @sherryshroff #asksherry", "aasthamarkan": "what was your fav subject in school", "shruti_naik": "What was the cruelest joke you played on someone? #AskSherry", "alisha_khan1796": "Are u n @vaibhav.talwar buying a new house ???? Before getting married.... Love you n vaibhav 😻😻😻", "witty_lady_k": "How do you deal with stress or overcome the situation? @sherryshroff", "aaishwarya_s": "Who is your favourite Bollywood actress?", "trinaa.p": "#asksherry any plans to own any clothing or Makeup line", "melanie_kalvin": "Very nice", "nikita_pawar1639": "Where are you and vaibhav going to stay after marriage? And how are you planning for the interiors? Love you!! ❤️", "mhatari_pranjali": "If u could create a new snapchat filter wat would it be n why ???", "_jazz1221_": "@sherryshroff what would you suggest for a long distance relationship??", "kalingad_dynasty": "Anime or hentai", "red.september": "What are the most embarrassing moments of your YouTube career? @sherryshroff", "bhairavi_the_chubby_girl": "I wanna start my own YouTube channel plz suggest me some editing software for Windows. .!!!", "mridulasa": "@sherryshroff What has been the most embarrasing yet if u think of it now hilarious moment of your life?", "saha.sreyasi04": "Please suggest a good product/home remedy for acne scars! And also wanna congratulate you for your great work!! 😎😎", "sheena_apur": "Are you kind of person who'll get up and switch off the lights after you've gotten into bed?", "shambhavidhargalkar": "How can I convince my parents to let me move in with my boyfriend? We are both working in the United States, they are fine with the fact that we are together but they want us to get married before we actually start living together. We are currently in a long distance relationship and work in different cities. But we are planning to move to a place (either his city or mine) in a couple of years and would want to live together. My parents mean the world to me, but I also don't want to get married in a couple of years. We would eventually, but not so soon. I really hope you answer this Sherry, I am in a real dilemma. #asksherry @sherryshroff", "singh.snigdha": "Do u have nightmares??? Worst Nightmare everr???? Love you... 😍😍😘😘", "vhvbz": "Not a question but just wanted to say you are beautiful", "ikroopgill": "#asksherry", "coolkarni_pk": "Which was ur favorite cartoon as a kid? @sherryshroff #asksherry", "_jaikeni_": "Which r ur top five clothing and shoe brands???#asksherry @sherryshroff", "pavani_vedala_": "Your suggestion to girls or women who are broken and fallen down in their life. #asksherry @sherryshroff", "nidhi.sonii": "@sherryshroff wedding style?", "radiatelove21": "Secret to your style? And some tips maybe? Because i LOVE your style. ❤️ @sherryshroff", "anula.kathuria22": "If u were da director of GOT,one thing dat u wud change in da series?? PS- Assume dat da books don't exist,da story of GOT is ure own but remember u can change only 1 thing 😋😋😋😉😉 #asksherry", "shinjinisengupta": "@sherryshroff How was your trip to Darjeeling? Did you get to do some street shopping from the line of stalls and also did you get a chance to watch the most known sunrise at the Tiger Hill? Darjeeling is indeed one of the most prettiest hidden treasures of the world🙈💖", "arshiyagedam": "what is your favourite book ? #AskSherry @sherryshroff", "somyakhandelwal": "How many sisters are you? And do you enjoy the attention sometimes which u get from bollywood coz of anaita?", "mahi_kapoor": "Your most favorite thing about Vaibhav?", "salonidhumal": "What's the best thing about being a parsi?", "priyatabrajabasi": "In an earlier #asksherry you said ud like to be Daenerys Targaryen if you had to choose a character to play on #GOT. Considering you are Daenerys which male character would you want to marry?", "saniyaamoree": "Is vaibhav n you going to move out after marriage? #Asksherry @sherryshroff", "shruti_suri": "Best n worst part f being a youtuber / vlogger / model ? #asksherry @sherryshroff", "shriyaved": "How to get rid of stubborn ingrown hair on legs?? #asksherry", "beccalicious.girl": "Favourite song of the month #asksherry @sherryshroff", "blessing.550": "@sherryshroff hey :) I just wanna ask you \"if you had to spend your whole life in a single pair of clothes then what will you choose ? \"", "a.a.s.h.i__": "Did u hesitate even for once..when u started youtube? Was it difficult for u to build confidence or was it easy??? @sherryshroff #asksherry", "tanvisagvekar": "I want to meet u sherry can i visit ur house?", "aditisays": "Are you religious? @sherryshroff #asksherry", "shifanymarshall": "What's the best thing in living in India in your opinion #asksherry @sherryshroff", "faizahbeg": "@sherryshroff how you manage your skin tone equally all over your body? How you deal with patchy skin tone? Especially now when you're after your trip from Bali #asksherry", "geetanjali_gupta": "how are you planning your house to be after wedding?", "anjalim2626": "Where will you and Vaibhav stay after the wedding?", "prachibhanu98": "What or who comes up in your mind when you think about Purple Wig ? And why ?", "missprakash08": "Favourite achievement in life #asksherry", "tabindaafroz": "What qualities are needed in one to start vloging??? Is it everyone's cup of tea @sherryshroff", "v.puppala": "#Asksherry how to keep pepping ur mind or diverting ur mind from negativity!!", "raufa184": "#asksherryshroff @sherryshroff places in your wishlist that u would loved to travell ???.mlove u sherry 😊", "aparajitalahiri": "Have you ever considered leaving youtube and going back to modelling? #Asksherry @sherryshroff", "sumitichitkara": "Anything you love about vaibhav? #asksherry @sherryshroff", "tenzingangjuk": "Who are your Favourite Vloggers ? Anyone you religiously follow ? #AskSherry", "skinandwords": "@sherryshroff What was the most embarassing situation you ever faced till date?", "bollywoodarian": "What was your first thought when you wokeup this morning? #asksherry", "sanghaisurabhi": "#Asksherry how do you manage to be so enthusiastic and happy all the time? You are really pretty!", "madhuralad": "Which place do u wish you shouldnt have gone to?", "ritu2parna": "#asksherry ..your favourite actor in bollywood 😙😙😙", "lipti_lips": "which indian vloggers ur fav? #asksherry @sherryshroff", "jasminetalwarmaini": "How about to go on honeymoon to Bali ? Your suggestions please.", "sanghvipurva": "Your qualifications?", "nutcase_ninja": "#asksherry makeup or vt ;) @sherryshroff", "aryasinghal21": "Wedding date", "hairstyles.diaries": "One moment or incidence you want to remove from your past? #asksherry", "sanafarooqui5": "Which app do you use for photo eiditing..??", "_ruchitaparab": "Whats your bucket list for this year?#asksherry", "riyolaaaa": "What is your fav store to shop at? #asksherry", "sharithas1030": "Thng U hate in vaibhav", "niharikapujar": "@rheajshetty dude isn't this something like Sanjna Sachdev's edits? 😂😂😂", "vidithabhandary": "What is the process of your video making? #asksherry @sherryshroff", "trushiee__": "How you started for modelling ? 😁", "shaneikagonsalves": "If you could go back in time, what advice would you give your 10 year old self?", "vartika_b": "Hey @sherryshroff !! It's a little too early but what are you planing for your wedding?? The venue, dress, food and all. What are your thoughts on that?!", "aay_pathak": "How do you select winners for giveaways ? #asksherry 😊😊", "yaatrishah": "Who is your favourite Kardashian/Jenner?? #asksherry @sherryshroff", "ayesha_1012": "What's your current whatsapp dp and status ?😁 since we dont have your no#asksherry", "shruti.aisha": "Who's your favorite GoT character? Also who do you ship Khaleesi with?", "lavanyatripathi": "@sherryshroff how is your relationship with your sister or what kind of a bond you both share ?", "__kimaya": "What is your favorite outfit?", "ashwini_k21": "being a student how should we manage a in-budget wardrobe, dealing with new trends and style?", "isha_2989": "How to wear translucent off-shoulder tops.. Not d bold person to showoff my strapless bra.. @sherryshroff", "brooklynandbaileydv": "Do you do anything to keep your skin clear and healthy?", "mapsinturns": "what would a day without internet be like in sherry's life ??? 🙄? 😖? 🙇🏼? 🎣? 🛀🏼? @sherryshroff #damncurious #asksherry", "shaifalisharmaasr96": "Sherry since you are into fashion, i wanted to ask you something regarding the career choice in fashion industry. I'm pursuing bachelor of fashion n apparel designing, so what would you suggest in which field there is more exposure fashion media or apparel designing???😰", "lovesickcherry": "@brooklynandbaileydv wow people outside from India follow Sherry as well?", "_riya.abraham": "Whats ur body weight sherry? #asksherry", "shivalee_ghadi": "Any turning point in your life ? Which made you face lot of hardships and how did you overcome them?", "anika.singh.99": "@tanya_eapen 😂😂", "mariyababysharath": "Where do you work sherry? 😊", "_sanjanagururaj97_": "How do you keep yourself so fit? How does ur fitness regime work? And pls tell ur secret of such a clear skin... u r very beautiful!!", "ivaxi_s": "Hey @sherryshroff !!!! Do you help your nephews with their homework?", "nail_it_suz": "Hi Sherry, I'm new at youtube,and trying to gain subscribers. But it's like they never come 😟I really like doing this, but sometimes there is literally no motivation and 2 digit subscribers that too inactive can be disappointing. Any tips?", "meenal_devpura": "When will you do a \"sister tag\"? ☺️☺️☺️", "rainbowsunicorns_n_me": "Ur honeymoon destination ?", "1ditamishra": "Your fav place in the world.", "damnsuhani": "Yaa have you ever got drunk and done something damn crazy. @sherryshroff #asksherrf", "shivaniraje": "Are you a beach or mountain person? #asksherry @sherryshroff", "dhwani_0920": "Your favourite show apart from game of thrones ? #asksherry", "ramona_lewiszaryekar": "What keeps you motivated all the time?", "prakritigugliani": "Did your friends and family feel that you have changed after becoming popular? @sherryshroff #asksherry", "tanya_eapen": "Sherry!! have you had any weird dream??..tell us about it!!😂@sherryshroff", "__potatoooo___": "#asksherry @sherryshroff Suggest me some awesome sitcoms to watch. I've just completed my 12th std and am on vacations :D", "preitykhatri": "I love u sherry 😍😍😍😍😘😘😘😘", "muskannt": "If u get a chance to live someone else's life for a day who would it be and why", "sophisticatedcallow": "How did you meet vaibhav and what do you like the most in him? @sherryshroff", "ankkita_anand": "If you weren't a youtuber,what would you have been??#asksherry love you!!", "mysticdrish": "How do you stay fit?", "shivani.gadhiaa": "What is your most favourite childhood memory ??? #asksherryshroff @sherryshroff", "surbhikhanna01": "Can you please give tips on sun protection? I have a really sensitive skin. And I adore you soo much 😘#asksherry", "divya_maheshwari": "How u keep urself fit n healthy???", "be_you_alisha": "Why u don't like kajal .? I've nva seen u with dark black kajal or eyeliner", "shama1699": "Do you like superwoman??", "ishita.345": "How old are you?and how you keep ur face so clean and shiny", "priyanshirawat": "Any plans to collab with YouTubers from Abroad. ?", "amreen_j_khan": "What diet do you follow and do u keep ur self fit? What would u suggest for ppl with a plum body? Lysm😍😙❤ @sherryshroff and Are u gonna shoot some scenes of ur wedding😃", "themartingarrixlife": "Who are your favourite youtubers??", "_alphafemale": "How tall are you? #asksherry", "saalloniii": "Why did u start YouTube?", "shweta_pattnaik": "Do u sacrifice more in your relationship or is it vice versa?", "____shivampatel____": "Who among you and vaibhav is dominating? #asksherry", "asmitajain_": "Ur diet tips? #asksherry", "tanishaaaaa_": "The creepiest thing you have done till date and would you ever do it again? #asksherry", "yuti_desai_": "will u ever think to eat 100% pure veg. food nd no to non.veg.food? @sherryshroff", "drhetalpatel": "@sherryshroff hi sherry...! You r such a posivite n anthuziastic person. I feel so good n positivity wen I listen u.. Wnt to ask u who is ur idol, whom u follow?", "bhavna_narang11": "Whch is ur fav foregin destination??", "kajol_makwana": "how do u get new ideas", "madhuumithaaa": "Any life advice you would like to give to a 17 year old ?! 😃", "fianafashionforward": "Will you shoot your wedding and what's new in store for your viewers befor and after your wedding(shopping and #getreadywithme) !", "_.goodvibesonlyy_": "One thing you love about Vaibhav. 💕 #AakSherry", "userdoesnotexist26": "How do manage to do so many things? Don't you get tired? 😉 Are there days when you don't like doing anything? #lovefromdelhifam #asksherry #loveyou 😘", "gala_bhakti": "Your favorite genre in books or TV shows? And a must read book and must watch TV show for the viewers? Love you💕", "hitaakshijain": "Whats ur current obession?♡♡", "nehawanikar": "If you only had to eat one thing for the rest of your life what would it be #asksherry", "prettylilmakers": "Which Indian youtubers have you subscribed to? :P @sherryshroff #Asksherry", "muditak14": "Current fav. Song and app", "sakshidoshi_": "Blair or Serena?", "himani_chilkoti": "I want to know ...abt ur laser treatment...how affective is it? how much does it cost ? Would u recommend it to anyone? #AskSherry", "nidhiamlani10": "Hey sherry plz make ur watches n accessories video...... N plz mention were did u Purchase it from n with what it should be wore...", "harshita_mandoth": "What keeps you motivated and inspired always? Any blogs tht u can suggest to follow generally? @#asksherry", "shweta_khurana": "Who is you favourite beauty blogger? Both, India and abroad!", "___rhythmm___": "Hey sherry! Can you please do a video for a begginer makeup tutorial and what all should ne there in a begginers makeup bag.", "sushmita.guha": "What is the best gift you ever got?", "_shivangi_tripathy_": "Love u loads sherry di!!! What is your favourite book ? #AskSherry", "kaavsv21": "Halloo Sherry maam....✌️how do u maintain u r self so well look so slim n trim n so prettay😻💅🏻how do u do that ?Is it that u follow any diet or something pls tell us .😘😍❤️", "artutopia123": "When was the last time you laughed until you cried?😂", "mayurideka": "How do you manage to keep hustling and working so hard? You must have a very busy schedule.", "tulasi_p_": "Hi sherry..can you pls tel us your monsoon essentials?..@sherryshroff", "simranbhatia11": "#AskSherry when are you planning to do a meet and greet in chennai!!😊", "eeshasinghh": "HOW DOES A FISH SLEEP ? @sherryshroff #AskSherry", "aloo__paratha": "Your obssession these days? #asksherry", "unnati.gala": "Hie Sherry, i have a lot of red spots on my arms due to waxing! Any suggestions on how I can get rid of them? #AskSherry", "shrutigupta2610": "How u started to become a you tuber. Tell me how to earn money. Want to be self dependent. M confused what to do. Help me sherry. I m a postgrad girl. Dont know what to do. Have a 9-5 job or something else arrrrrrrr😲😲😲", "insha27": "What type of footwear should be worn by people with broad feet (especially heels ) @sherryshroff.", "pooja_agarwalll": "Hey Sherry....What is ur fav snapchat filter?", "ajplaysss": "3 things you cant live without @sherryshroff ?", "originallypriyanka": "Can you give basics tips on losing weight like how to loose weight and to be healthy?", "manalishawarma": "What would you be if not a youtuber? #asksherry", "tanishabedi167": "Your Mumbai monsoon survival tips ☔ @sherryshroff", "radwizardlove": "Hey, there. What is that thing that makes you jump out of bed, everyday in the morning, to do the things that you love? 👌🙌", "ruta_2025": "Tell us some funny \"fan meet scene\" or any awkward moment or demand by any fan.. and yes.. love u loads❤❤❤❤❤❤ you, Vaibhav, your channel, VTTV and Coupling are just #fab 😘😘😘😘😘 #inspiration 😊 @asksherry @sherryshroff", "roshini_abigail": "wud you prefer to date someone with bad breathe or have the bad breathe and why? #asksherry @sherryshroff", "bidisha_65": "What is ur age and also vaibhav's ?", "shradhavjain": "One of the most romantic thing Vaibhav has done for u and gifted u and ur fav romantic movie ❤️😘😊", "rishikagautam30": "Hey sherry, loads of love so my question is what keeps you so calm and positive and also tips fpr being an optimistic person another question would be what would you do if you woke up as the 5yr old you 😀😀", "shenoykrishma": "What keeps u motivated all year round?☆love you sherry 😁😍#asksherry", "yuktidhammi": "Have u started d wedding preps..yet?", "hiraloza.97": "You have been travelling all around the world.. What is that thing which u love about living in India.. Would u like to shift abroad or any other city in India @sherryshroff #asksherry", "trishadjani": "@jugrajbhurjee", "_prarthana_p": "When are you going to marry with vaibhav😀 @sherryshroff", "__aasthakapoor": "Which law school did you go to? How was college life? 👻", "nehalnathany": "Suffering from immense hair fall due to dandruff. What do I do?", "jahnaviy29": "Friends or himym?", "soumya_john": "You have the most beautiful skin I have ever seen!!..nt jus because you are fair bt you have flawless skin!...how do u maintain this?.", "krishakukreja": "The most Embarassing moment in your entire life till date .😄🙆 @sherryshroff #AskSherry", "asfia_iqbal94": "How you are so slim..??????????", "queen_monica04": "Hey sherry 💖 when ll u come jaipur? 😍", "ferbalicious.13": "Tips for freshers... dos and don'ts 🤗", "the_kompal_singh": "#asksherry hi sherry luv your videos . How can I meet u , am in Bangalore ???", "ayushiguwalani": "You travel so much and live in Mumbai where it's summers for major part of the year, how do you still maintain such an even skin tone ?", "kavya_menon_": "#asksherry hii sherry i am ur big fan i just wanted to ask u that wht is the thing that u like about ur fans ? Love u big fan ❤️❤️❤️", "_keerthi.sai_": "How old r u?", "trishnashenai": "What are the troubles that go into making a good 5 minute youtube video? #AskSherry", "tithi_kumar": "Do u use any home made stuff for ur skin care??", "voyagerinvogue": "Pls tell how to know tht a guy likes you ? Your observations @sherryshroff", "d._.amini": "Do you like Panipuri?", "its_cherry987": "Describe the best dream you have ever had ! (Nightdreams) or you can recall at the moment", "_mahikaajain_": "What is your main goal in life ? #asksherry", "simran.sharma28": "How have you been so hairless? I hv got hair all over body n face and somedays I can't wear shorts when my waxing is due. :/", "shubhraaa_04": "Hii dii❤ You make awesome videos! I want to know... Do you do bikini waxing or shaving!", "tvishasethi": "Hi di❤ I'm not a very old subscriber but I'm pretty addicted to ur videos..I think ur beautiful...I just want to know you're favourite piece of jewellery rn and an off shoulder top ur loving since I'm kinda into them💕", "thebengalibalaa": "How do you manage hate?", "_shrutiiiid_": "Suggest the best bb o cc cream for drk skin @sherryshroff", "abhilashavasudev": "😘😘😘😘😘😘just this", "thealiferousgirl": "What did u bought with ur first ever salary?😀😇 #asksherry @sherryshroff", "sindhu_bhanuchandran": "Hi sherry...how do you remain soo fit😍 and yes plz plz do a routine fitness..related vedio😊😊", "supritha_29": "How many haircuts have you had so far?#asksherryshroff", "indrayani.2085": "2 favourite songs of this month..", "ms_drizzle_fizz": "@sherryshroff do you miss your long hairs? #asksherry", "iamjatindersaggi": "What's your favourite cuisine? And which is your favourite shopping spot? #asksherry ☺️", "kamya_nair93": "How tall are you? #asksherry", "smiledisha31": "In which year were you born and where??? #asksherry @sherryshroff", "cazol_lama": "U were model before ? But why don't u continue modeling ? We want to see you making your big there too girl 😊 Do you only make YouTube videos ?", "bhuwalkashreya": "How do you keep sweat at bay in this hot n humid weather?", "priyacpmotwani": "#asksherry What kind of a person would you like to be remembered as once you are gone ?", "vrutti_vru": "How's your dream date like ? 😉...#asksherry @sherryshroff", "nidhi_purple7": "When are you going to start shopping for your wedding?", "humanvee": "Which was the first phone you ever owned? #asksherry @sherryshroff love you loads ur such an inspiration tbh❤", "dimplemahyavanshi": "How to get rid of pimples, blackheads, scars???? #Asksherry", "sail_vk": "How do you battle with insecurities? @sherryshroff #AskSherry", "ummihb": "Any One honest advice about love relationship from personal experience ? #asksherry", "prianca.sansare": "You have beautiful skin. And don't worry I mean clear and even soft skin. Please suggest the dermatologist you go to. It il b really helpful to me. I stay in town and you know how difficult it is to find a good one. Muah.", "zorico13": "Can you come to Aizawl?", "puneetkdhindsa": "Which is your one ultimate favorite book that you would recommend as a must read for everyone? #asksherry", "apoorva_jain_": "Will the same type of contest of going shopping with u be conducted for Delhi Shroffers also? #AskSherry", "kashish__ahuja": "Hi sherry my name is kashish , nd I'm 13 yrs old and I wanted to tell u that I love your videos and yes congratulations for the cosmpolitain beauty blogger award 😄😄 my question is that what book would u read of u would be 13 yrs old ? #asksherry @sherryshroff", "ishitagoel___": "I am very happy that you are about to hit 1lakh subscribers , I want to ask you that how you want your dream wedding to be like ?", "shaziyakhanofficial": "@sherryshroff when u will do a meetup in jaipur #asksherry", "eleena0000": "Pmpl blkhd scars same question mine", "edgeful_": "Love your videos sherry😀 Do you have any plans to visit UAE/ Dubai anytime soon?", "tahira331": "Best place to get laser done? And how effective is it#asksherry", "bisma_ramzan": "Where are you getting married #asksherry @sherryshroff", "shrutilad_kore": "One good thing about ur vaibhav and one bad thing abt him wch u wuld like to change", "monachopsis.x": "Can you share your all time favourite artists/bands and your favourite childhood memories?", "pooja_banerjee": "How did you guys manage to have 11 year of relationship ?? And still strong #morepowertoyouguys !!", "srishti2004": "Hi Sherry, I love ur videos 😍😍. How do u feel being a youtuber.😊@sherryshroff", "_deeksha_devi": "#asksherry if given a chance, what would be the one lost chance you'd chose to take?", "mansiugale": "Are you a cat person or more of a dog person? And Do you wish to have any pets?👀", "thestylespeaker": "@sherryshroff Up for a collab? ✌️😎", "mish200311": "Hi sherry first of all I love you soooo much your such an inspiration to me and my question to you is did you ever get bullied if so what did you do", "kokab_hasan": "Sherry how you got this accent!? 😜 #asksherry @sherryshroff", "meowch.in": "Do you prefer staying home in your pajamas with Netflix and luxury or do you prefer hiking and seeing new places, meeting new people?", "mominamirza": "what's your youtube goal?", "bagchi.noyonika": "If you had to an invent an ice cream flavour what would it be? #AskSherry", "bavana_18": "Where's your next travel destination!? #asksherry", "himshikha_": "How do you face people calling you skinny or with minimal boobs? Cz a ton of girls get bullied bcz of their breast size @sherryshroff", "meghnolini": "What's your craziest obsession?", "shyamalimac": "#asksherry Have you ever been to Assam or any North Eastern States. Also, any special cuisine from Northeast you've tasted? @sherryshroff 😘", "raksha_ravikkumar": "Heyyy! You're videos are amazing!! 😄 I saw ur video on how to shave ! Tips+myths in that can tell me if you use the same razor for underarm and also the cream? Won't it give you dark patches ?", "books_netflix_burgers": "Can u take me wid you for shopping ...?", "sahibabajaj": "whats your life mantra or life goal #asksherry", "karthikasm": "Hi sherry.How much of make up is too much???? Lately many young girls are obsessed with beauty and their body and looks.what is your thought on this?", "sheemaskitchentales": "If you ever have a chance to leave Mumbai and settle somewhere else, where would it be? #Asksherry", "ayn_dhrita": "Whats ur time pass?", "ai.sh.w.ar.ya": "Affordable daily makeup essentials for college girls @sherryshroff", "drishh.t": "Do you have alot of friends? #asksherry", "priyankaailawadi": "If you had to change one thing about yourself what it would be?", "namrathamohan": "How to get rid of pimple scars @sherryshroff", "arshiyaarora_": "Now that you have made your name on youtube, where exactly do you see your channel in say - five years from now? #AskSherry", "aayushikapila": "2 things you love about Vaibhav? #asksherry", "gurnoooor_": "What is your favorite place go shop in Delhi?", "maggi1506": "How does it feel to stay with parents? 😊", "dheeralbhayani": "Did u have long hair during ur school days?? #asksherry", "simran2210": "What's your qualifications?? @sherryshroff", "prachi_shah7": "What is the creepiest/weired thing that you have experienced while meeting your fans/followers @sherryshroff", "gaurichopra": "What is the one thing that you absolutely love about Bombay? Also is there something you dislike about the city? #AskSherry", "pixie.dust97": "What is the definition of love according to u ??", "thesoulartistry": "whats your greatest fear?? @sherryshroff #asksherry", "ruksmustaf": "How cn we clean up dose acne marks nd get clear spotless skin", "unna_teee": "Favourite clothing brand? #asksherry", "lifecoach.sakshi": "What makes you depressed? @sherryshroff", "that_turbangirl": "When are you coming to DUBAIIIII❤️🙏🏻", "maira.zeb": "The best thing about your bf @sherryshroff 😀", "aint_missnobody": "Wht is your most favourite dessert?", "sayligavhale": "How do you get rid of your tan❓ ( p.s. do you ever get tanned?) @sherryshroff", "juhi790": "Your favourite brand for clothes and shoes??", "pearlvij": "What is that one thing you would do if it was the last day of your life?", "manishakaila": "If you were a super hero which u would be and what powers would you have? #Asksherry . Pls pls answer this i have asked u question in ur previous once also but u never responded any 😔 #Asksherry", "nishthaaa_": "Favorite food", "navnitakaurmakker": "your fav cuisine?", "_s.umaiya_": "When are you coming to Dubai?😍 @sherryshroff ..Btw Love You😘", "fashion_lifestyle_nd_more": "Which type of exercise u do?", "sohani__": "Favourite thing about Delhi?", "gayathrikappagantula": "Are planning on coming to Hyderabad???", "srilakshminair": "fav place to shop in mumbai?"}