{"aasheena": "@attrioshin just got reminded of you :*", "smruti_bapat": "Never have I ever done/tried drugs", "diya_bb": "Never have I ever bunked school and lied to mom about it.", "cherinagamadia": "Roshan aunty looks lovely..@sherryshroff", "the_priyakapoor": "Beautiful 😍", "sonali.08": "so amazingggg", "sneha.shajan": "Come back soon sherry.... waiting for your New uploads @sherryshroff", "agarwal3770": "Jhakash", "palak009verma": "Never have i ever liked chocolates and teddies.🙈And yaa never have i ever made a tinder account.😄😄", "gupte.p_shraddha": "Never have i ever been caught red handed by my mom ???😂😂😂", "supz.raj": "💞", "rishilagarwal": "never have i farted and the the other person found out", "ashleenhora": "U do look like her 😍😍😍😎", "ruhani__0": "😄", "sonamahuja1994": "sonamahuja.wooplr.com", "vally_baskar": "This was the best haircut for you Sherry...come back to this 🤓", "mrinaha": "Never have I ever dated my best friend's ex", "gayatrisikka": "Very nice blouse @sherryshroff where is it from?", "namrata.pradeep93": "Never have I ever told my mom a lie about Vaibhav so that she does like him.", "kadam3475": "Beautiful pic", "_adrita.dutta_": "Never have i ever stolen makeup from my mom's makeup kit in childhood and got caught by mom", "bharatb90": "@sherryshroff it's evident now where you get you looks from 👍😃", "juileemathure": "U need food 😳", "spoorthi.narendra": "❤️", "the_loveleena": "💗💗💗💗💗💗💗", "dhiraj_miraanda": "For ur mom: Never have I ever raided my daughter’s wardrobe on purpose for a reason", "anujarora1991": "Nice", "purvikabhambhani": "Never have I ever bitched about a close one", "mhatari_pranjali": "Never have I ever put stuff under my bed or in my closet and pretended I cleaned my room.", "mega_dard": "Never have i ever gotten drunk", "apoorvi_b": "Never have I ever used the other person’s make up products secretly and ended up ruining them!", "patie86": "Never have I ever 'not celebrated mother's day'", "therealkritigandotra": "Never have I ever adopted a pup!", "sarcastc_vibes": "Who is she", "_.naila.khan._": "Liked by Sonam Kapoor ❤", "dharatri": "Never have I ever regifted a gift card/Gift!! 😉😅", "menonnamita29": "NEVER HAVE I EVER....HAD ALCOHOL AND PASSED OUT WHEN U GUYS WERE SMALL KIDS! @sherryshroff", "theordinaari": "This is so beautiful", "manalisaysthat": "Never have I ever been arrested.", "dargopatil_amruta": "Love that outfit Sherry!!", "shah.vidhi17": "@sherryshroff never have i ever stolen cash from father/husband and never told them", "nikita_hukumatani": "Never Have I Ever got arrested", "anusoma": "@sherryshroff Never have I ever cried watching a saas bahu serial", "yami_j135": "Never have I ever raided my daughters' closet😂", "nsharma2891": "Beautiful mem", "shambhavi_shrivastava": "💗💗💗💗", "colloquially.naisha": "Never have i ever pretended to know a stranger @sherryshroff", "priyankarajdev": "Never have i ever made my kid cry to avoid some work which i don't want to do...... LOVE You @sherryshroff 😘😘😘😘😘", "namratak.2601": "Outfit is so on point.", "shreyashivaprakash": "Never have I ever borrowed money from mum after I started earning", "styleinsense": "Never have I ever lied to my parents about my boyfriend 😂❤", "samraggi": "Never have I ever crushed on the same sex", "msmeehnia": "You two look gorgeous", "anushka__22": "Never have I ever made out in public place", "humandamu7777": "🙏🙏🙏🙏🙏", "devanshi.r.21": "Never have I ever checked sherry phone", "dsen997": "Y don't u involve ur mom-in-law in ur videos...", "pranjali.mali": "Never have I ever prefered one child over the other", "dhw_ani": "Never have I ever lied to my mother", "one.life.one.journey": "Nice📷", "poulomi1998": "Never have I ever had a one night stand", "happiestsherry": "Never have I ever punished my daughters for the mistake they had not committed @sherryshroff #neverhaveIever", "surbhi_berry": "Never have I ever lied to my mommy 😊❤️ @sherryshroff #neverhaveiever", "sp007k": "👌", "nidhibisani": "Never have I ever tried to copy my mom as a kid!", "riyajoshi__": "You both are so beautiful 😍❤ God bless you both 💙", "chasingpixies": "Never have i ever kept a deep secret from my parents 😅", "bless_a_j": "How did your hair grew so long all of a sudden? Anyhow you look gorgeous 💞😘", "umhazarika97": "Never have I ever stolen cookies/cakes/pastries made by Mum.", "hijabiinthehouse": "Never have I ever disliked someone and pretended to like them Infront of them.", "an_am.11": "scary mummy", "shopviolla": "Super hot @sherryshroff 🔥🔥", "papadontpreachbyshubhika\nVerified": "Verified", "uttarahahaha": "never have i ever applied nail polish on both of the hands' and both of the toe nails perfectly @sherryshroff", "p.s.idrawyou": "Never have I ever smelt a dress and repeated it. 👗🧥👚 #wickedgross", "__.dreamoutloud.__": "Never have I ever pretended to know a stranger😂", "jainshreshthi": "Never have I ever used my mother’s phone without her consent.", "geetsuri8": "NEVER HAVE I EVER SNEAKED MY BOY FRIEND IN WHILST MY PARENTS ARE SLEEPING.", "shazushah": "Beautiful pic", "darshana_singh": "What’s both of your heights?", "gyan.102": "Nice", "nehpika": "never have i ever got drunk so bad that i forgot what happened last night/day 😂", "llalexxbloomll": "Beauty", "girlintheeatery": "never have i ever killed people in my mind", "i_harinya": "Never have I ever pranked my mother @sherryshroff", "neena_emil": "Never have I ever scolded Sherry even though I felt she is doing or has done the right thing\")", "oendrila_oc": "Never have I ever checked my husband's phone in his absence. 😋@sherryshroff", "mehakbhuta": "Loving this lenga @papadontpreachbyshubhika", "simona1234456789": "Never have i ever wated a son in my life#neverhaveiever", "walrus_of_the_north": "Never have I ever eaten my daughter's share of sweets / chocolates", "simranatri": "Never have I ever sneaked out late at night", "nimishapatil18": "Never have I ever told my spouse he looks great when he is actually not😁", "upsiii_17": "Never have I ever regifted someone a gift I received and did not like.", "davina_jj": "never have I ever had a surprise party thrown for me", "maliniagarwal\nVerified": "Verified", "aakansha.shekhawat12": "Ur a duplicate of mother", "zarayin.bastawala_": "Never have I ever spilt milk on the floor while cooking", "sampreettt": "Never have I ever wanted to be one of the Kardashians", "hi2leann": "So pretty !", "nikytanahid": "Have have I ever borrowed a clothing item and didn't return because it was too good to return", "vipul.l.patel": "Both are sweet cute with mother?", "miprianca": "Never have I ever interfered or enquired about my kids personal life", "theunconventional_tribal": "Never have I ever fart in a room full of people and acts as if you are not the the who did it 😂", "rakshaajain": "Never have I ever blamed my sister for things I've done", "dhanashree1603": "Never have I ever eaten a midnight snack sneaking", "sanjana_kadlaskar": "Never have I ever lied mom about my boyfriend ;)", "sajari_99": "Never have I ever lied about who I was", "divya.2506": "Never have I ever bragged about something I have not done. @sherryshroff", "cloudy_secret": "Such a pretty picture 😍😍", "nitin000m": "💕", "priyadahiya_": "Never have I ever put gum under a table.", "naina_khosla": "Never have i ever ordered food from the restaurant but claimed its cooked by me", "famousgoenkans": "Never have I ever kissed an ex", "upbeat_shots": "@sherryshroff you both are looking awesome", "_damankaur_": "Never have I ever done twinning with my mom?", "nehabareja": "@jayanthnagaraj : See, same as what we did for Trends last year!", "zarlasht.iqbal": "Never have i ever killed a cockroach 😂", "arnimagupta9": "Never have I ever pretended to be sick to get safe from any event or cooking", "aakriti_oo1": "never have I ever beaten any of my kid", "lookfo_od": "Never have I ever lied my spouse", "preetdave8": "Never have I ever had a crush on any pilot or a cabin crew ?", "ashnamahajan_": "Never have i ever cursed my mother in front of my friends?😂", "ish_kk_": "Never have i ever used eachother makeup...never have i ever sneaked into eachother phones/text messages", "pujalkadam": "Never have I ever stole anything from shop", "charusree14": "Never have I ever discussed awkward/embarrassing situations together xD", "namrata._.sharma14": "Never have I ever.Asked my kids how old they were or momentarily forgot their names.", "ameeparikh": "Never have I ever looked at some ones phone/message without permission", "minionisathing": "Stole money in childhood", "aahtheyeahh": "Never have I ever cheated on a test", "ayushi_singh_98": "Wanted to do subscriber tag ...sherry I can make sketch for your mommy", "quirkiness_in_disguise": "Never have I ever slept during the movies?", "itsshreya99": "Never have I ever pretended I'm sick soo that I can not do anything for the day 😂.", "sbadsha29": "Never have I flirted with some other guy except my husband 😬", "utkarshsrivasta": "Nice pic Mam can I get one reply from you mam", "deeeeeepanjali": "Never have I ever stolen my mum’s clothes and accidentally destroyed it!😂 @sherryshroff", "rimpiduttae": "Never have i ever been locked in a bathroom as punishment", "vaishnavi_shetty_": "Never have I ever played never have I ever😂 😂", "thesnapkitchen": "Never have I ever cheated on someone", "chaahat_jain": "Never have i ever pretended to fall asleep just to avoid guests at home", "phoenixinthemortalworld": "Never have I ever hooked up with a stranger at a club/party!"}