{"iamreginacorda": "What is your favourite icecream flavour? #sawaljawab", "prernasingh_": "Who scored more marks in Hindi subject in school ?? @sherryshroff @vaibhav.talwar", "booktacles": "The above hair style makes you look super cute @sherryshroff. Maybe you could grow it back to this length again and keep it so for some time. 😃👌", "_sid_rao": "Do u know any hindi proverbs ??", "anchor_aishwarya_mulaye": "Agar aap dono par koi chalchitra bana toh us chalchitra ka naam kya hoga?", "mynk_singh": "Sing shape of u in hindi...🤩😎🤩", "saaaumya": "Aap dono ka kad kitna hai??", "sonalikalakra3": "What is your favorite thing to eat? Momos, cheesecake or chicken biryani?", "navya_ramamurthy_k": "do u guys have any nick names that u both used to call each other.. if yes.. what are they..???", "pramodsandra123": "Aap lokom ko bacha pasand nahi hai pls batayiye becoz I have asked this question earlier and there is no reply from the part of sherry", "sayalikolge": "Will you ask my question as a question in your video? 🤔", "mithumini14": "your funny reaction after pointless fighting. share one incident with us .", "missnamzy": "Who is the first one to apologise?", "pujabanerjee96": "Please try some baking or cooking challenge @sherryshroff @vaibhav.talwar", "cloudy_thoughts9": "What are your dream jobs if you guys wouldn't have been doing what you presently do?... Love coupling 💕💕💕💕😘😘😘", "prabha_kulkarni": "Are you Harry Potter fans? And if you are which house are you in and what's your patronus?", "priyanca5": "@sherryshroff one thing you both can't live without ?", "shivanideshkar": "Are you planning to grow your hair? Long hair suits you.💛💛 Lots of love.", "akanksha3159": "हिंदी में उलटी गिनती गिने २० से १ तक", "dusky_sparkle": "The most abusive words one knows 😆😆 typical हिंदी गालियाँ itll be so much fun", "miss_bundleofjoy": "Sherry nooooooooooooooooo it's soooooooooo boring 😩😬", "lavneesh.chouhan": "Aap itna momos q khati hai... kya momos aapka pasandida khana hai", "sanika_2303": "Who has better taste in music...@sherryshroff or @vaibhav.talwar", "tina_not_teena": "What is the one quality or trait every couple according to you should have for a lifelong relationship? #vtss u guys are my favourite.", "rishiikaa": "Confess your love for each other in hindi", "shruti_manda": "Vaibhav why you so handsome?", "roshni_kuk": "Pass a double meaning joke at each other", "paperbaagco": "Tell us one quality about the other, that you like and one that you dislike in the following activities- eating, shopping, travelling", "garima_mi": "Rank your priorities. Love, money, fame??", "malavika_c": "The simplicity that you both have is simply inspiring! Could you please share the most funny and embarrassing experience in your life? @sherryshroff @vaibhav.talwar", "___v.apurva": "Who is drama queen ???😂😂", "anushka.pptx": "How do you keep your relationship interesting even after 11-13 years of being together? Have you ever felt bored of each other? Felt stagnant, ever?", "simranatri": "Appke total kitne relationships rahe Hain life mein?", "sanjanaswani": "I want to know why you guys are not doing more recommend videos ..I love them ..and I watched or read most of the things ..we really want a part 2 video of movies n books ...also ..I want to know your morning routine???", "322436ee": "Aapke pasandidar hindi chitrapat kaunse hai?", "girlintheeatery": "@sherryshroff @vaibhav.talwar If one day aap dono ki aatma badal jaati hai... meaning vaibhav is vaibhav but in sherry's body and vice versa..what is one thing u will do.. and one thing u will not", "labonita97_": "Who is more likely to be adventurous?", "t.r.i.b.e.n.i": "When you guys will plan for a cute baby", "naisargee.rawal": "When you were little, what did you wanna be? 😀", "kalravshah_": "Will you grow ur hair any time soon ??", "mehek9901": "Kiski zyaada sambhavana hai ki woh Bahar jaane ka plan radd karde maamuli kaarano ke kaaran?😂❤️", "diksharickshaw": "Have you ever used your celebrity status to get away from traffic cop situation?", "dhillon__dilpreet": "कौन सब से ज्ञयादा लड़ाई करता है??और कौन सभसे पहले सौरी बोलता है लड़ाई के बाद?? @sherryshroff @couplingalong", "fashion.fluent": "Hey! Can you please check your dm! This ones just an important message!", "nancy_yadav12": "What is your old bollywood favourite movie", "s_o_m_a_l_i_k_a_": "Ap dono agar YouTube ya modelling nahi kar rahe hote toh as a career option konsa profession choose karte?", "cila.noh": "Who among you guys is a better dancer? Also I'm Celeste, am a huge fan of you both. Much love from Pakistan", "msohini": "Aap dono mein se sona kisko zyaada passand hai?", "_mahirane": "Sherry does vaibhav fart while sleeping and disturb you?? @sherryshroff #coupling #sawaljawab", "h_padda_0": "Please translate these words into hindi 1.excited 2. Mentioned", "sangeetakukretipasbola": "What r your job ? Work hard , Life is not easy", "griishshetty": "Who is your favourite kardashian??? And y??????, @sherryshroff", "trij_1510": "Can you try singing a English song in hindi?#sawaljawab", "_inikitasharma": "The one thing you regret and always will....??", "chaahat_jain": "@vaibhav.talwar Top 3 of your favourite books that you would suggest to anyone at any given time ?", "_star___ship_": "I love you guys & you guys are true #couplegoals❤️🙌🏻 Question-Did you ever faced insecurities issue against each other?", "divya.roxx": "Aap dono mai sai Kaun accha khanna banata hai?", "purestwithin": "What pet would you both like to keep?", "smarterthanyouraveragedesi": "What are ur pet peeves or who is the more clean hygienec one ?", "ameeparikh": "Both of u propose each other in Hindi ...", "tanvi_chakradeo2810": "Who has a better dressing sense?", "asmitas11": "What is the most useless thing you know how to do? AND what movie would you want life to be more like? :)", "ridhidimri": "Konsi recent movie dekhi h?", "perpetual.__.wanderer": "What's the thing which you absolutely love about VT ? 😊", "girl.on.the.terracee": "Such a cute picture! ❤️", "yashvi_karia": "#thisisus ka konsa character ya scene apka favourite hai?? @sherryshroff @vaibhav.talwar #vtss #sawaljavab #coupling", "swati_bharmal": "आप एक-दूसरे के बारे में सबसे ज्यादा क्या पसंद करते हैं?", "anutanwar2": "❤️❤️", "gauri06": "क्या आपको हिन्दी मे मुहावरे आते हैं?। दो-तीन मुहावरे बताए। 😁", "krushi.t_": "Who can cook/bake better?", "meameesha": "Sherry kya aapki ki saas aapke saath rehti hai aur kya aap unki sewa karti hain", "nehafredrickdas": "Do u guys find any sort of inspiration in each other ??", "imkovidniru": "Aap dono ne apna rishta Itne saal tk kaise nibhaya?? @sherryshroff", "sheetalc7": "Who is short tempered vaibhav or sherry??", "rushalisisodia": "I know both of you are bad at cooking, but why don't you try it out? Let's say there will be a day where only Vaibhav will cook and a day where only Sherry will cook. You can have a nice full day vlog of it as well. 😁", "whatsinthename1207": "Kripya niche diye gye tounge twisters boliye aur Jiske liye yaha sambhav na ho vo ek Hindi geet Gaye. Tounge Twisters kuch is prakaar Hain👇. * Peetal ke patile mein papita peela peela. * Oonth uncha, oonth ki peeth unchi. Unchi poonchh oonth ki.", "aditimazumdar": "Hey sherry, vaibhav ke gharwale and relatives aapka naam kaise bolte h? I assume that would be too much fun 😅", "arya_03.05.17": "Y dont u guys try a cooking challenge with each other?? @vaibhav.talwar @sherryshroff", "shreyashivaprakash": "Who is more fussy amongst the two of you?", "aakritisachdeva07": "Which is the the best hotel you guys have stayed in? (Can be individually answered or together as well)", "akshataajoshi": "Since you guys have vlogs on Goa, Bali, Korea, Hong Kong , etc.. It would be interesting to watch you both discussing on any of them in 4-5 sentences!", "lazy_forever_2230": "Who's most likely have big appetite #vtss @sherryshroff @vaibhav.talwar", "nikki_siddi": "One annoying thing about each other", "vrindanaredi": "Who is more possessive amongst you two?", "tanmayee_dalvii": "How do you guys manage fights?", "khushimehtaa_": "Name your favourite YouTubers", "s2t_09": "https://youtu.be/YBlctlrHCSU vaibhav can u propose sherry like dis? #askvtss", "divya.soni.02": "Do you guys watch hindi movies? Because i haven't seen you talking about hindi movies in any of your videos. #loveusherry", "prakartilulla": "What was your alternate career option ?", "aloo__paratha": "How do you guys tackle fights and indifferences amongst you both?", "aiswaryaav_aishu": "What was Vaibhav 's mom's reaction when she came to know about sherry - and vice versa..:)how did Ur parents treat u. .😋", "prajujo": "Who is the best amongst you both, in convincing the other ?", "prabhu_aishwarya": "What is your favorite bollywood song?", "dalallisa": "Where are you guys going to travel next ??", "shatobhisha_7": "What do you like the most about each other?", "chetna.sharma.961": "Can you please Sing ur favorite English song in hindi?", "dishabiyani3": "Are u an early bird or a night owl??", "mansi_ashar": "What was the most challenging moment in your blogging journey so far? @sherryshroff @vaibhav.talwar", "_anagha11_": "What difficulties did you both faced being in a relationship coz no relationship is perfect how you both deal with the tantrums of your partner?", "pratyashabhattacharya": "Aap dono ko ek doosre ke baare mein kya sabse pasand hai? Only 1 thing.", "janki.25": "Which is your favourite memory from the day of your wedding ??", "amiablecreator": "ap vaibhav ko vt-tv m aur videos banane kliye kyu nahin kehte?sherry🤗🤗🤗🤗🌸☺️", "pooh_gianani14": "What is the one most important thing you look in your partner before marrying him/her?", "_simranbakshi": "How did you even eat that shitty cheese omelette of lovely omelette centre in mussorie???", "tripti02t": "Who take more time dressing up ??? #vtss", "anjaliii_mehta": "@sherryshroff सबसे प्यारा दोनों में कोन है? प्यारा माने, क्यूट ❤ 🍊 #sawaljawab #hindi #coupling @couplingalong ई लव यू बोथ ❤❤", "_shaily.srivastava": "What are your wildest fantasies? Like any such wild thing you both want to do once in your lifetime.. @couplingalong", "shibani_2094": "Aap dono ka ek dusre ka diya hua sabse pasandida tohfa kya hai?", "smritib22": "How do u guys deal with fights?", "prapti__0.5": "Do you guys fight", "k_ghaley05": "Aap dono me se kaun raat ko kharaate martey ho 🤣", "vidushi97": "@vaibhav.talwar propose to @sherryshroff in Hindi", "amateur_escritor": "You are really honest on your channel how do you stay unfiltered with yourself & how honest are you with eachother ? Do you keep secrets from each other ?", "n.e.h.a.a.a": "Would you rather prefer to have Indian food or American food", "divya.2506": "What was the first impression of you two about each other?? #sawaaljawaab @sherryshroff", "cs_shreshthisurana": "Agar apko ek din gender reverse krne ka mauka diya jaye... Matlab sherry is vaibhav and vaibhav is sherry... Toh aap kya karoge?", "tulika_sr": "If you could change one thing about each other what would it be? And if you could learn one thing from each other what would that be? ❤️😘", "shobhanashrma": "How you both cop up with mood swings #sawaaljawaab #hindi #coupling #thisisus @vaibhav.talwar @sherryshroff", "smsakshimalhotra": "Punjabi family m aake Apne Punjabi seekhi Sherry?? Agar ha toh kripya 1 sentence boliye na..agar Ni seekhi toh Vaibhav kripya unhe sikhaye aur unhe boliye k vo usse bol k sunaye", "vidyajain207": "Who is more of a cuddler?", "anjali.g5": "Superb", "smruti_bapat": "Have anyone of you ever smoked or is a smoker?", "ezxplanation": "How were your families okay with marrying in another religion? Btw love from Pakistan ❤❤❤❤❤", "appyy24": "What is your Ultimate travel vlog destination?", "apoorvi_b": "अगर आप डोनो अपने रिश्ते में एक एक चीज़ बदल सकते भूतकाल में जाके तो वो क्या होती?", "monalisamalick": "Aap dono next kidhar ghumne jaoge??", "salvigupta16": "Life is Sabse badi achivement kya hai aap dono ki abtak?", "malkit_gill2697": "Aap konse saaboon ka prayog karti hai?", "femidamirza": "What is the most irritating thing about each other ?", "archanar25": "Are you’ll planning to have a meet and greet in Dubai by any chance ? 🇦🇪", "__shivangimathur": "What is the next thing on you to-do list ?", "mehikasaxena": "Aap dono ka baby kab hoga?? Koi plans hai Kya??", "harshvii": "Aap dono pehli baar kyse kab Aur Kaha mile??", "jeeyayadav": "Who’s better at maths?", "astha2506": "Who annoys the other more? Because in your videos only Vaibhav seems to be visibly annoyed by a lot of things Sherry does.", "sia.merchant": "Why so hot @vaibhav.talwar ??", "unnati.gala": "Youtube ke alava Vaibhav aur aap kya karte ho?", "pouchofparadoxesofficial": "क्या आप दोनों इन हिंदी के शब्दों का सही उच्चारण कर सकते हैं? 1. किंकर्तव्यविमूढ़ 2. विक्षनरी 3. संगणक", "suyash_goyal29": "Koi ek essa moment jisme aap dono pet pakad kr hasee ho?? #sawaljawab #coupling", "anishaaa.zzz": "Things that irritate you the most??", "its.me.nikita": "How and when was your first kiss?//Aapki pehli chumi kab aur kaise thi?", "shraddha_malakar": "Hi Sherry and Vaibhav! You both make a lovely couple. My question to you is - Over the years, what has been the biggest change you both have seen in eachother towards your relationship? Translation in Hindi - Itne saalon mein aap dono ne ek dusre mein kaunsa sabse bada badlaav dekha hai Aapke rishte ko lekar?", "pooja_2211_": "Aap dono ki ghumne k liye sabse favorite jagah konsi he in the whole world??? #vtss #hindisawaljavab😘❤️", "_madam_glam_": "Pick my question plz... how u guys communicate of leaving from a weirdo boring party ...???? @sherryshroff", "rashmikujur": "आपलोगों का मनपसंद टेलीविज़न कार्यक्रम कौनसे है।", "shaifalisharmaasr96": "Also, have you ever felt the negativity you face on social media effecting u in your real lives? Love love😙", "aishwarya.radia": "What is that best quality about each other which you guys love the most!? #sawaljawab #hindi #vtss Love you guys ❤🤗", "simisekhon21": "What are you watching on Netflix these days? And what do you like about the show?", "_ishfinity_95": "@sherryshroff @vaibhav.talwar aap dono me se achhi marathi kon bol leta hai?? Kripya krke kuch marathi me boley 😁😎", "prerna22_sharma": "Hey I love ur videos..plz cn u tell when you both r planning for a baby(cannot wait to see him..he'll be another taimur) and when sherry is growing her hair long?", "kanakaaaa_": "What is the weirdest/ craziest thing a fan has ever done for you?", "prinkalpaserkar": "Sherry when do u both were planing to have baby? Coz yesterday i saw u pregnant in my dream..😊", "findingdimple": "When was the first time that you both felt she's /he's the one and why ??", "lmaosayali": "@sherryshroff how to handle each other’s mood swings ❤️ ily Sherry", "toshivasistha": "I love you guys!!!!!! 💋💋💋💋💋❣️", "ketkisarange": "Cuties 🦋🎈♥️🌈", "gods_own_girl13": "No sawaal. But ☝️ I can see the best bond out there. ☺ 🤗 loadsssssssssssss of love", "makeupbyshubhrata": "Tell each others annoying habit...😁"}