{"punjabineelam": "If one day you had a chance to have a super power what would it be and why??? #asksherry", "chirpysoul": "HEY SHERRY! What do you suggest for the girls who have social media inferiority? How should they deal with it ?", "avipsa_rc": "@eshita_oishi ur question is a correct one.. @sherryshroff when will you do a meetup in kolkata? #AskSherry", "radhika_pulikkal": "Updates on your skincare routine", "arja_aventador": "Have you ever tried baking? Are you more of a sweet person or a savoury person when it comes to baked food? #asksherry", "vaishnavi_prasad_rao": "Which is your fav holiday spot in India ?", "raashimudholkar": "#AskSherryShroff Tell us your favourite memories from college/school", "raxitha": "How was bangalore!!!!!! #Asksherry", "meghaupadhyaya": "Would u rather live in the game of tgromes world or have real dragons in this world? #asksherry", "reethu_ast": "Whats your favorite food item #asksherry", "reetsrituals": "Sherry please tell something about colouring hair. I already have grey hair and am 26 year old. I want to colour my hair but does it gonna make my hair more grey ??? Please reply.", "shweta_borgaonkar": "whats ur fav thing about bombay?", "raniadadha21": "Didn't answer mine", "1ditamishra": "Fav actors ? #asksherry", "divya_purohit": "@sherryshroff Your fitness routine !! #asksherry", "instaankiiiii": "What is your favourite holiday destination ?", "prachisancheti": "Your daily dose of motivation ? #asksherry", "sherryshroff\nVerified": "Verified", "deeda_96": "@sherryshroff if you were granted three wishes, that would come true in installments, i.e. first wish today, second wish same day next year and third wish same day the year after that, what would you wish for and why? #asksherry", "hippieseawaves": "Any haircare tips for thin wavy hair? And can you suggest a haircut for the same? Pretty please!!?🙄💕 #asksherry", "milanraina": "When is dr gona b nxt meet up for shroffers at delhi?", "dheeshna_shetty": "How do u take people's comments n opinion on you n your videos? ...do you really bother that people may judge u ? N how do u deal with their negativity?", "shwetatikyani": "Pls suggest an affordable gud skincare regime!!!", "pritibhole16": "At what time do you get up everyday?", "cloudy_thoughts9": "What a random day in ur regular life is like?", "theinspirarevogue": "The most expensive thing you've ever bought? #AskSherry", "trishna21": "Hi..i really dont have any questions to ask you.i just want to thank you for making such amazing videos.You have been a great influence in my life ever since i have started watching your videos.No matter what you always have that smile on your face.And i love you outlook on life and how you find happiness in small things.You really inspire me. 😊", "ankitamehta_03": "I follow you on gotta do India as well.. And I love you as a travel show anchor too..👍😀 How did u land up doing that? How do u travel so often?.. I so envy you for it 😤😫 #AskSherry", "sadhvinarula": "Are you proudy??", "ruhi.chopra": "when are you getting married @sherryshroff ? 😍❤", "janhavisawant": "@sherryshroff what do you love the most ? 1) Footwear 2) dark lips 3) clothes 😚 ❤️love love ❤️", "amruuuuuta": "When will you do a meet up in Pune!?", "surbhikoths": "#AskSherry what is your deepest regret ?", "bhumikasutariya95": "How to message on YouTube ???🙈 Nd your fav Indian designer Nd vegetarian dish?", "siddhimadhwar": "Why so gorgeous?😍 Lol 😂 what as a girlfriend pisses you off the most?😜", "nimo9908": "Best way to remove sunspots for fair skin type n best skincare products to cure super dry skin.... Plz sherry us da answers in da video", "nandini_227": "Which is best way to de-stress?? As per your point of view😊. Since my exams are coming and i am tensed about it😟😥😐", "ar.krishna.s": "Would u pls spill some beans about ur wedding 😁 its like one day suddenly u vl post a wedding vlog and we will be like when did ths happen 😕 @sherryshroff good luck to u and vaibhav", "rucha_17": "Which is your favorite place for a vacay💕 #asksherry", "the_wardrobearchitect": "A look book or tips on Indian casual College wear. Ps: budget buy. 🙈", "utsi_09": "@sherryshroff What is the one thing you've always wanted to do but never had the courage to? #AskSherry", "jainshreshthi": "What's your life's motto or favourite quote?", "gurmankb": "Who is your favorite Indian designer?", "poojithareddypalwai": "What the best compliment you have got from vaibhav ??? <3 <3", "shoshita1243_": "نايييييس", "yashika.in": "Answer this. If you had won a loterry and you were to spend it all at one store... Where would it be... #asksherry", "mayuripawar0_0": "The bestest day in your life???", "richa_sharma04": "I wud like to Ask Sherry \" Is there any 1 thing (or person or memory etc.) which uplifts ur mood & makes u happy no matter how miserable u feel??\" In short ur permanent happiness maker..", "eeshasinghh": "You rather not get your eyebrows done for life or never eat your favorite food again ? @sherryshroff #AskSherry", "the_priyakapoor": "Who snore's more u or vaibhav ?? 😂 #justasillythought 😃", "p.r.a.c.h.e.e": "#asksherryshroff What's Your favourite type of dress 😊😊", "mannasaa_b": "Hi sherry I love you ❤ When are you going to come to Hyderabad😃😃", "ikroopgill": "#asksherry have you had an RCT done in any of your tooth? :p", "doshidrashti": "Hie Sherry I would love to know how you maintain your health and skin? Because it looks Amaaazing😍", "vrutti_vru": "Hey Sherry plz give some relationship tips...u n vaibhav r my fav couple ....luv u both😘😘😘 #AskSherry", "__neanna__": "Hey sherry everything has its pro's n con's...what are the pro's n con's of being a youtuber ??", "shaileeshah93": "Where will you guys be staying after getting married? Have you started prepping up your home?", "_bhoomigupta_": "Have you started planning your wedding yet and also are you going to uave it in Mumbai and will you vlog it?#AskSherry", "ms.plainspoken": "How to you motivate yourself to keep going... In the YouTube / blog world in particular? Did you ever feel like giving up when things plateaued?", "userdoesnotexist26": "#AskSherry How to start fashion blogging? As in how do the newcomers in this field mark themselves with limited resources as most of us are college students. Isn't there a scope for blogging without a dslr or contact with brands? @sherryshroff I would be more than happy if you answer my question 😃", "sri.thefaddict": "How many kids do you want? Girl or boy or both? 🙈😂", "_khushi.s__": "@sherryshroff can u speak Marathi ?? If u can could u speak a few lines ....luv u 😘😘", "shoileemaiti": "I am a college student ..And I have never used make up before..currently my skin has got dark spots all over my cheek that looks horrible...should I go for a powder foundatuon for convenience?( I have sensitive skin)", "simranbhatia11": "#AskSherry what does freedom mean to you??", "shreeya_iyer": "Where are the places you've been to?", "anushkamanoj.20": "Hi sherryyyyy, I am your big fan. I am from Bhopal and I love makeup and fashion. But in my city, there aren't a variety of brands available. Like there aren't zara, forever 21 and even marks and spencers. So can you suggest me a few good brands which are available in non-metros, and even some good indian makeup brands !?? Like I can't get bawse lipstick or kylie lip kit here, so can you suggest some online sites which can ship them to my city ???? #asksherry lots of love- anushka... 💖💖💖💖💖", "sancharipan": "Can you give some tips on how to grow a youtube channel?", "kaamya1021": "How to increase subscribers on youtube? And how to get many likes as well? Please try to answer it would really help as m new on youtube @sherryshroff", "adira_dutta": "Do a sister tag", "thecurlyheadgirl_": "How u started your modelling? #asksherry", "architaa25": "@sherryshroff what is the nerdiest thing you have done so far? #asksherry #loveyou #positivevibes", "saalloniii": "What was the most awkward situation you ever been in ?😍", "madhumanti_s": "What is your biggest pet peeve?", "manasareddy26": "Hey @sherryshroff which is the best sunscreen for swimming.? also some skin care tips for dry skin pls especially 'face ' 😔hopefully a video would make me more happy !! 😊", "_bismasajid_": "What would you ask vaibhav for, if you knew his answer was yes?? 😎😏🙆 @sherryshroff #iloveyousomuch💜", "malavikanair_7": "Which language you and vaibhav use most to communicate with each other ?", "bajaj_shikha27": "Were u born with that incredible confidence and personality or was there somebody or something that inspired you?if yes, who?", "miprachi1": "Which is your favourite dish from parsi cuisine?", "thesassyshimmer": "Hey sherry. You are outstandingly adorable. My question to you is about something every woman faces. If someday you have a choice to choose between your relationship and career, what will you do? Does relationship happiness weigh more than career path? :)", "kritika_nakshatra": "Sherry please can you suggest a day creme and night cream for oily skin which is affordable for college students. I love to take care of my skin but get so scared of acne, and also have to look on my locket. It will be really helpful. I do not know if you would really read it or not, but i really love you and vaibhav, you both have the best channels.❤❤😘😘", "julieatlife": "Tell us about your siblings....lik wat thet r doing and hw supportive they r of yur youtube life", "tabibazaman": "Who is your favourite bollywood actor/actress @sherryshroff", "shxrvari": "Who is your favorite writer and singer??? @sherryshroff #asksherry", "ainishaikh_": "Which is your fav day?? 😍", "veenashahane": "What is your favourite character in Friends? (The sitcom) @sherryshroff #asksherry", "nevillebhesania": "What date is your wedding? I forgot", "akankshaasiingh": "What's your BESTEST childhood memory. And any tips to make your childhood AWESOME..😇 @sherryshroff #asksherry", "shriyagrawal": "@sherryshroff Is there a perfume that you swear by?", "paridhiwho": "What inspired you to start youtubing? @sherryshroff", "krishika14": "If you had a chance to wake up as someone else and live a day like them who would you want to be?", "_shravanib": "A song you listen to when you feel low? @sherryshroff", "mitsoct": "Heyy how are the wedding preparations going on?! @sherryshroff", "rajvi_parekh": "What exactly is gotta do India? Like you own the company or you work for the company?", "kirtim_01": "One thing u can't live without 😀 @sherryshroff", "ritikarajamohan": "U have been making yur you tube videos for like more than a year.Wat are ur best moments and low side!!!", "thatshriya": "What is your instant getaway when you are in stress? @sherryshroff", "mouliimehra": "How tall are you?", "colliss14": "What is your honeymoons plan?😉", "darshu_001": "Whats ur fav perfume n deo? Do a video on dis", "smiledisha31": "Hey...Are you going to vlog your wedding shopping and preparations??? If not plz do..... Love you ....😘", "prachi29_singh": "hey @sherryshroff .y r u soo beautiful😘", "roshanadarsh": "Hello sherry maam :) Roshan from Lucknow. My question is when do plan to come to Lucknow for a gotta eat Lucknow video? P.s. hope it's soon. We have such awesome cuisine here", "anjalim2626": "After marriage where are you gonna live ?", "chrisannrodrigues": "What are your favourite apps at the moment? Apart from social media apps.", "taurian1991_": "Please please tell me how you fought with acne, like any specific food to avoid in that case or anything else.", "issa.worry": "@sherryshroff If there is a thing called 'agla janam' xD What would you like to be? Human or something else? 😂", "meet_gogo20": "Unforgettable incident or story of your life", "sharithas1030": "pls vlog ur marriage let us be a part of it we wud be so hapy and dat wlb da bgst thng u cn gv us", "shrxyah": "How do you edit your videos ?from wch app?", "_aatusa": "Which is your fav restaurant in MUMBAI? #ASKSHERRY", "la.1513": "Sherry plz make a video on ur wedding planning and bridal care ... tia #vtssweds", "basicallyaparna": "#asksherry 1.what are your 5 wardrobe must haves? 2. Could you do a what I eat in a day video? Would love to see that!", "iam_vja": "Where to shop d most fashionable clothes widout much load to d pocket😂 #asksherry", "nazliayazraj": "Do you have a PR agent like some other bloggers do? What's your take on that! @sherryshroff", "curly.chase": "What is the aim of you're life?", "manipriya20": "What is the one thing that u hv done tat makes u guilty till date n regret the most?? Love you", "shrutimangla": "How do you do not care about what people say? #asksherry", "yanita_ps": "Which place do you love the most in Mumbai?", "monika_srivastava": "Do u think about calories before eat anything?? How to stay fit even when being a foodie?? Tips to tone arms??", "soumya_john": "Wht do u think is the best job anyone could do???😃", "shrutigupta2610": "I really dont know what to ask. I just love watching ur vdos luv u sooooooooo very much. U and vaibhav. Come to delhi whenever u have time want to meet u.u r the first youtuber i subscribed too. ( now i watch other too😊) but u were the first one. And will be forever. Luv u sherry alot. Ok wait. Not a question but can u plzz pronounce ur name in the video. I m sorry i cant pronounce it. Tried but cant sorry. @sherryshroff", "itsananyaarao": "PS : we love you sherry", "ankita_dutta91": "How do you start your modelling career and also YouTube career?", "mahitha_rudraraju": "What is that one thing you cannot live without ? 😀", "ddivaa07": "Is there any incident of your life which you can't forget everrr or an incident which made you learn something and you'd like to give advise to shroffers on that. @sherryshroff", "sakki_2614": "Hey @sherryshroff I love your videos my question is how do you carry yourself so perfectly? lyk seriously u rock ur each n every outfit xoxo 😘😘💕", "navamidas": "Hi sherry...what is your most favourite make up product without which you just can't leave your house..PS: I am sooo happy I could meet you wen you were in Bangalore😁😁", "olivegreen_girl": "Hey sherry! :-)You're also a lawyer by profession. So how did you manage your studies? &From which college did you complete your law?", "1kingshivani11": "What 1st thing you do when you freak out?❤😨 #loveyousherry!!! ❤❤", "_ektayadav_": "How to deal with breakup?", "shivalee_ghadi": "when was the moment you realised that vaibhav is \" The Mr. perfect\" to spend your rest of the life with.", "tanishka_k": "Which actor would you like to work in bollywood if u get a chance to work in bollywood", "prakritigugliani": "What is the thing you love most about Delhi?", "_rituuuuuu": "What is the one thing you do when there's no work or no one around? When is the 'sherry time' and what you do in it?", "rincy_kaur02": "Hi sherry, how would you cope up with anxiety or depression?? If someone facing these issues often what would you advice ??", "krishakukreja": "Hi Sherry 😃 . My question to you is that which is the movie which you could watch over and over and still love . (1 Bollywood and 1 Hollywood) #AskSherry #QandA @sherryshroff ☺❤", "nandessha": "Hi @sherryshroff ... What are the negatives of being a YouTuber ?", "drishtir_16": "Have you ever been afraid of something that you know doesn't exist or u know isn't gonna happen? P.s:- I love you ❤", "ginni130": "#asksherry fave food stop in delhi aside from big chill?", "devlina_bajaj": "Who are you attached to more? Your mom or dad? #asksherry", "saanvi_komarla_": "#asksherry what are the Netflix shows you would recommend watching when your not having a good day ? ..", "_dramatickle.error_": "Do you regret about anything of your life?! #asksherry", "swara_shettigar": "What was the first thing you noticed in Vaibhav?", "pooja_banerjee": "What are your marriage plans ?? 😬", "simran.mally": "Skin care tips for someone with oily skin", "drashtidaniii": "@sherryshroff #asksherry if you ever meet your doppelgänger what would you do? 😛❤️ lots of love ❤️ stay awesome possom❤️", "_anaghaaaaa__": "Hii sherry! I love you soo much😘😘💗 . What was your ambition in your childhood? Where an introvert or an extrovert. Do you suffer from trypophobia? (Bcoz I do!) @sherryshroff #asksherryshroff #AskSherry", "kritikagoyal13": "Hi Sherry😘 where will you stay after marriage?", "vaiishnavvi": "Would you rather win all the #beatit challenges or have Vaibhav win it just to see his victory daaaance? #AskSherry 😀", "tanyaaurora": "Joey or Chandler ☀️", "manyaaaaaaaaaa": "@sherryshroff #AskSherry Hi Sherry! 5 things you cannot survive without? And if you were to eat only 3 things for a week, what will it be?", "salonidhumal": "what's the reason behind your Lewis Hamilton craze?", "amar_meyebela": "Hey sherry. This is 1st msg to u. My question is where do u see yourself in 5 years and if u can change one thing in your past what would it be ? I love u 😘 #AskSherry", "supritha_29": "#asksherry How would you describe your subscribers? Love you😘", "ummihb": "Boyfriend jeans or bandage leggings? I mean this is a genuine question, and i would love to know your answer❤", "chandokaishwarya": "@sherryshroff Can you please tell us about your favourite Parsi tradition or ritual ? Would love to get an insight about the Parsi culture ! #AskSherry", "madihakayy": "Hi sherry!!I'm from Jaipur. My question is how would you describe your clothing style? And I also want to know why you started your blog and YouTube channel?", "_sonia28_": "Do you speak different languages and how well?", "mish200311": "How do get the confidence to wear any type of lipstick or any type of shade", "i.vidhibaid": "Your wedding is on cards!!! How excited are you about it? Also, will you be able to vlog your wedding? #AskSherry @sherryshroff 💋", "vanshikajain4425": "Hi sherry I am vanshika I am from Kolkata I loved to watch your videos ....I have question which is your favorite beauty product", "onepeacefulsoul": "How much time you spent on v logging, editing, replying to comments and working on your other professional commitments in a day?", "imdesertrose": "Hi Sherry! I love your channel a lot and you're a huge inspiration for smaller creators like me. My question is - have you ever been approached by a brand to be their brand ambassador?", "preitykhatri": "Hi sherry preeti from Bangalore.. How u deal with the negative thoughts", "shortdresses": "@sherryshroff yay was waiting for this (sorry gonna sneak in 2 questions)😁-->what's your holy grail product ? If you had to wear one outfit for the rest of your life what would u wear?", "sharanya_18": "Your most embarrassing moment? #asksherry", "raveenavellore": "Sherrrry! Is there any chance of you and Vaibhav coming to Hyderabad for a meet and greet, anytime soon?😃 Loads of love.❤ #AskSherry @sherryshroff", "adaintysoul": "As a vlogger you get so many goodies by various companies..it's obvious you can't use all them. What you do with the rest of the products?", "tvishasethi": "Hi sherry! I've been following you for a while now and I rly like watching you👌 One question I have is what is one spot in the entire world that gives you the most peace and happiness? #asksherry", "ibeshalu": "#AskSherry @sherryshroff", "l_sonalsingh_l": "If you were supposed to use 3 makeup products for the rest of your life ..what would those be?", "poojadshah99": "Hey Sherry when are you coming to Ahmedabad?????", "footprints_on_sand": "Hi Sherry! I'm Simantini from Kolkata. I have watched your video with your grandmother. What is the one thing that you admire about her?", "aspire_n_dream": "#AskSherry @sherryshroff you being a great traveller could u pls suggest me top 5 places worth travelling according to your opinion?? - Bansari ..lots of love XoXo", "unna_teee": "@sherryshroff What's your fav clothing brand? #asksherry", "mitaliijoshi": "What's your greatest fear? #asksherry", "isayalimali": "#asksherry Hey sherry..@sherryshroff Sayali here.. my question is, Have you ever made a video and never uploaded it, thinking that the idea behind a video won't work or Coz of some reason.. is this ever happened? let us know!! 😃 #asksherry", "uswah.fatima": "What is the part of a wedding, that makes you the most nervous to plan/think about? @sherryshroff", "adiba.tamboli": "#asksherry @sherryshroff which is your favourite shop to buy shoes from?", "beryl.josephh": "Would you rather sneeze honey or sweat chocolate...??????? 😂😆", "akhil_6556": "@sherryshroff #asksherry my question is agar koi sherry ka sabse bada fan ho toh use contact kaise kare 😜?", "currrynaa": "Have u ever got embarrassed in public?!! #asksherry", "madeeharshad": "What was it like to grow up in Mumbai? Tell us some of your fondest childhood memories. #AskSherry", "illusionary_soul": "Where are u planning your honeymoon😍 @sherryshroff", "kanankotak1": "When is your next MNG in Mumbai? Also, how have you been?🙈 @sherryshroff #AskSherry", "s_h_u_b_h_s_": "@sherryshroff which accessories and type of makeup suits a geek student who have to balance each minute of time therefore cant waste evn a hour for getting makeup done 😅 #asksherry", "aditi_singh___": "If u were a boy for a day, what would be the first thing that u would have done? #asksherryshroff . And I loved meeting you yesterday. Hopefully I can meet you again 😘😘", "amruuu02": "If you could be a vegetable. Which one would you be? 😂 PS. I love you so much #asksherry", "nelma_nelson": "Pizzas🍕🍕🍕or burgers🍔🍔🍔.......luv u", "miss_neslee_toulouse": "Hi sherry. So my question is I think on behalf of every broke clg going girl. Please tell one affordable face wash toner and moisturiser. Thank you", "llanushkall": "Who is your inspiration??", "nisheeta_": "which is your favourite dark lipstick?", "nishifishy_": "If you were to live in the 'game of thrones' which character would u want to live as? Or which city would u live in? #asksherry", "darshna.laxpati": "@sherryshroff have you ever had a paranormal experience?? If yes, please share d story! 👽 #asksherry", "anhabelle": "Do u have any secret fantasy??", "raufa184": "@sherryshroff what all adventures(bunjing jumping, skydiving, etc.) do u want to do or is in ur bucket list ??..love u 😍😘", "tanyajalgaonkar": "If you had to choose between sleeping and eating what would you choose?", "weird_girl_in_the_world": "#asksherry what is your n vaibhav's height ?", "d._.amini": "Do you like PaniPuri?", "sakshidoshi_": "Chanel or Dior?", "peachesindia": "What is your all time favourite place to shop and why?", "shriyayayaya": "Who is your favourite band/singer ? #asksherry", "vedikav": "Whats your favorite lipstick??", "rashiunial": "What is your favourite makeup brand??and where do you live in Mumbai?", "viiniita": "What are the top 5 things that cheer you up on your blah days? 😊", "khan_umaiya96": "Please Sherry !! Hw to handle relationship as u R expert in it??", "vaishnavijoshi7": "#askSherry one place you have always wanted to visit but haven't yet?", "curveyors": "Are you both feminists? If so, what do you want to tell people who seem to 'hate the label'? Also who is your feminist lady icon?", "srishti.aneja05": "#AskSherry any funny confession you'd want to make?? Any childhood one or during teenage 😀😎", "takiar.kanika": "What do you imagine your life in the next 5 years ? #asksherryshroff", "sharmaanshika29": "Which couple do you like the most in F.R.I.E.N.D.S ?? 😁🙈", "soumya.shende": "When are you going to do a Delhi meet up?", "13_geetika": "What do you like the most about Vaibhav and how did he propose to you 11 years back? :D", "omnistyles": "Hi @sherryshroff my question is: who inspired u to become a Youtuber? 👍😄", "niki.abe": "@sherryshroff Your idea of an ideal holiday ?", "introverted.extrovert3": "I'm getting married in December! And all of sudden my skin has decided to break out all over 😑 I have always suffered from acne, but with homeopathy treatment over the past year, it had subsided. But now it doesn't seem to reduce, in spite of having a talk with the doctor and changing the medication. Any tips? 😥", "megha94verma": "@sherryshroff how to overcome any insecurities dat we gals generally have w.r.t body image and skin issues ??", "shivani.gadhiaa": "Which is your favourite childhood memory ? @sherryshroff #asksherryshroff", "cool_vandanad": "@sherryshroff how do u manage to be happy go round all the time???", "seriouslyynalini": "Which is the best outfit you like on vaibhav?", "tanishaaj": "Hey sherry, what are your favorite stores to shop at? Like, the kind of stores you know you'll definitely get something at when you're looking for something for a special occasion? #asksherry", "surandif": "@sherryshroff please come to Sri Lanka soon, there's so much to see and do plus it's so close. Can't wait to meet you😘", "r.a.k.a.1.0": "How to handle work, relationships and family together?", "zzeniaaa": "11 years is long... How have you and Vaibhav kept it strong??", "benanna_love\nVerified": "Verified", "rituparna997": "How do stay so positive all the time? Don't you get worried? Some tips on being you happy please.", "aayushiimishraa": "Suggest some haircuts for all face type and some good hair colour to choose from", "reemahgurnani": "Hy sherry uh seem very positive n full of Lyf ! How one can b positive in tough situation #asksherry", "prerna.harsha": "What do u think might be the worst moment or incident in your life related to ur profession #asksherry", "reyshma999": "Hi Sherry! Tell me some basic must have accessories that go with almost every look. #asksherry", "sunoynaroy": "What's your fitness mantra ???#asksherry@sherryshroff", "_a.p.e.k.s.h.a.a.a_": "Cuteness", "harpreet_likhari": "Hey Sherry when will you visit Hyderabad ???", "trishalakapadia": "@sherryshroff wat do u fantasize about ? Ur wildest fantasies", "shivangipandey9": "When will you visit Lucknow?😍😍", "aliyashaikh_": "show us one of your super funny photos please #AskSherry", "puneetkdhindsa": "One thing one can always find in your bag", "muskannt": "If you get a chance to live someone's life for a day who would it be and why @sherryshroff", "prachibhanu98": "#asksherry I am 18 now I wanna dye my Hair but my Moms says that I should wait for a little bit as colouring your Hair ruins it's quality.please Suggest me what should I do ?", "rakshithasridhar": "What did you want to be when you were a kid?", "divya_.30": "Any details about your wedding that you would like to share??", "notdingnungmodi": "Well.. what is your secret to happyness??☺i find you are happy all the time☺ps i adore you", "ananya.poojary": "Please Show your room at the current moment . @sherryshroff #asksherry", "ashritaaaaa": "When are u gonna a do a video with zreh and zane ?? Sorry to ask this question again and again.😞🙁 love yaaaa", "kathyayini_m": "How often do you meet Bollywood celebs as your sis is a stylist and who is your fav celebs", "ramona_lewiszaryekar": "What makes your relationship stronger because coupling gives me relationship goals", "shreyayaaa": "heyy sherry❤ which one this the most expensive shoes you own? #asksherry", "ruksmustaf": "Sherry i juss need to ask u abt how to fade scars plzzzz", "nayanahebbar": "Hey sherry . . It's been long time since you shared your hair care products .Are you still using Pantene shampoo or changed to a new one ?", "ishitagoel___": "Hey Sherry u r an inspiration to all of us..n I also want to start a beauty channel on YouTube but my parents are not allowing... Idk why but they think that it's not good n it's not safe...can u suggest how can I convince my parents ??💜💜", "anam_husain05": "Things that you love and hate about yourself? Also, if you could change your past or fix a thing about the future, what would they be? #asksherry", "the_vivacious_alma": "Which is your most favourite national and international designer ? #asksherry", "kushamalhotra": "Honeymoon destination? #AskSherry", "gargi0605": "Since when did you start blogging?? And what all things are required to start a blog? #asksherry", "bhanushalidishaa": "Hey sherry I wanted to ask you that why it looks cakey when I apply makeup. Is something is wrong with the skin or Am I using wrong makeup products?. Please if u can ans or do a video on it, it will be very helpful. Love you #Asksherry🎈", "_sahajjj": "Any tips to handle exam stress?? #asksherry", "meghazaveri_07": "Ur current fav perfumes", "griishshetty": "Hello sherry u r such a positive soul... love u alot.. i wanted to know how easy or difficult is for you to make a video even wen on a vacation ??? #Asksherry #loveu #uramazing..... #biggfaannn", "palak_ki_jhalak": "Favourite animal???? Any pets you've had?", "devna_khandelwal": "Favourite fashion destination? #AskSherry", "sakshita_30": "Why don't you wear shorts?", "sejal_karmaran": "What are the 3 things that you plan to do with Vaibhav after the wedding?", "samira_yez": "What's your favorite blush ? #asksherry", "shenoykrishma": "Which is the best moisturizer for combination and sensitive skin! Love ya sherry!!😀😁", "namratakanjani": "What would you do if suddenly one day the attitude of Vaibhav changed towards you and seemed disinterested in you?", "mansi_khanna": "Hey sherry... Idk if someone has asked this before... But I was just curious to know what Zane and zreh call you or refer you with... Like how we have massi or mavshi and since you're a parsi Idk what it is... And was longing to ask this since a long time but would always miss post....", "khushichandrashekar": "What about Bangalore did you like the most?", "jksuri24": "#asksherry which city would you prefer to live in except mumbai ? 😘😘", "maitri_chopda": "#asksherry i love your room it has that old day charm, bt are you happy with it or want to move to posh locality", "vaibhavi_b09": "Would you miss your room after the wedding.. What all stuff will you take from this room to your new room after wedding? :) #asksherry", "disha_soni99": "@sherryshroff when are you planning to learn driving ? 😝 #asksherry", "shinjinisengupta": "@sherryshroff Your top three absolute favourite books?", "anchal_khetan": "Hi sherry.i love Your skin its sooo wonderful..an u pls tell how did u get rid of acne @sherryshroff", "harshitha_sreeramula": "Do you enjoy making DIYs and fashion videos or makeup videos?", "silky_maurya": "Who/what gave you an idea of being a youtuber?", "anushka_n_19": "On what basis are you going to give the give away 😔😔 I really liked it and I am beginner😣. Pls help me out ❤ love you @sherryshroff", "be_you_alisha": "Where are you going for honeymoon #asksherry", "priyanshichoksi": "Do you love your short hair or you miss the long one's?", "anishajasti": "#asksherry What is the craziest thing your fan has ever done ?", "_nidhh": "Do u work except blogging ?", "medhaviis": "@sherryshroff sherry from u gona shop for ur wedding?! #asksherry", "kanika_dogar": "Would u ever consider moving out of India permanently....why/why not #asksherry", "upsiii_17": "Cab you ever imagine a life without Vaibhav in it? #AskSherry @sherryshroff (I am sorry but I want to know the answer to this question 🙊 It pinches me to even ask you about it. VT and SS are my favourite OTP! 🙈)", "enricadsouza_": "If u get a chance to meet someone who was taken away from u who would it be @sherryshroff", "theskewstyle": "which designer outfit ur planning to wear on ur wedding or it is going to sweet and simple @sherryshroff", "leebangera": "As your wedding date is getting closer... What are your feelings? 😘", "mahima_sawant_": "How u used to manage your study and modelling schedule?", "damnsuhani": "#asksherry sherry don't you feel awkward when you do an outdoor shoot because people in India continuously stare at us? And also where do you change into other outfits? Love you xoxo💟💟", "___ayezaa___": "Wer do u leave..??n wer u met ur boyfriend 1st time..??", "pooja010": "From which college did u complete your gradution ?@sherryshroff", "quirkynightingale": "When you will be coming to Kolkata for meet and greet #sherry @sherryshroff", "kashish__ahuja": "@sherryshroff beach or pool? #AskSherry", "aayushiiigandhi": "Plz sherry make a video on \"how to start blogging.\"", "ritikakrishnan": "@sherryshroff what did you like the most about yesterday's meetup in Bangalore? And how's Bangalore's traffic xD", "anand__shruti": "Ur fav shopping destination☺☺", "yuvika_fatnani": "What are your personal favourite skin care tips @sherryshroff", "mushkan.3": "Other then Netflix what you love to do in your free time?", "devanshis1990": "@sherryshroff wht is ur life goal ?#asksherry", "shaziyakhanofficial": "@sherryshroff when are you coming to jaipur for a meetup #asksherry", "vijayalakshmi.09": "How was the blore meet n greet? I wish i could come 😣", "travadizx": "If there is one place you wish you could be right now, what would it be? #AskSherry", "findit_yourself": "What are your views about coloring hair? I mean do they damage hair and make them dry?", "_____jasminemadhok": "@sherryshroff Netflix or Hotstar ? #AskSherry", "ceena_rai": "won't u visit to Nepal sherry???", "missbhise": "@sherryshroff what are the best affordable online shopping sites in India?? #AskSherry", "nishthaaa_": "@sherryshroff who all live with you in your house", "likhitha.kummera": "@sherryshroff what was the main reason behind starting a YouTube channel #asksherry", "shwetaagarwal1694": "@sherryshroff u please give some tips on skin care regime for dull dark dry skin tone girls.. #asksherry 😄😄", "anvikamaini": "Hi sherry!! In most of your how to start YouTube channel videos you always talk about the things that you're currently using. what was the camera and the equipment that use writing started two years back#asksherry", "amanjotkaur4": "Do u watch big bang theory?", "siddhikodre": "Will you be vlogging your wedding? Will we get a few glimpse of the day?", "banshareee": "Netflix or Hotstar", "pujitha21": "One place u want to visit before u die ? #asksherry", "nehaa_makol": "Where are you going to live after marriage? In the same house as Vaibhav lives currently?", "mansi_6": "What's that one thing you wanna do before you die? #AskSherry", "_pixiedust26": "hey sherry😻....What is your favourite music genre?", "originallypriyanka": "Tips for new youtubers. Like how to promote their video/channel? #AskSherry #asksherryshroff", "goonerette_21": "Will you continue making YouTube videos after marriage?", "chandreyeeroy": "Two things u will carry to an island for 6 months.Love you😙", "rifadamani": "Which is your dream vacation destination? #AskSherry", "srushtisalunke": "how did your parents react when you told them about vaibhav?", "ugyen_p": "@sherryshroff y did u choose modeling n youtube over wrking as a lawyer?? #asksherry ....i am in bangalore n sad thing i couldnt meet u yesterday bcz of exams...", "sophisticatedcallow": "Were you always interested in modeling and blogging or did you enter this industry by chance and had some other aspirations in childhood?", "somewhatartbyraash": "Are you planning to move out with vaibhav after you guys get married ? #asksherry", "sonia.varghese_": "What is ur fav place to shop ? #AskSherry", "srilakshminair": "favourite place to shop in bombay?favourite show of all times?who is your fav character from FRIENDS?", "meenal_devpura": "When will next meet up in mumbai happen? 😍", "asthagupta197": "Which is the best book you've ever read ?? And any books you are looking forward to read?? #btwloveyou", "shravyanair": "If a celebrity is gonna crash into ur wedding.. whom would u like it to be ?!", "natasha_dsouza4": "Love ur lips n dat shade which shade", "khyativarra": "What is that attached back of Ur ph that green round thing #Asksherry", "irhtayag": "Your biggest fear and how many kids do you want @sherryshroff #asksherry", "mansa.raut": "What r u scared of?,#asksherry", "prianca.sansare": "You have a beautiful skin. Please spill the beans... Who is Ur dermatologist sherry? Muah u go girl", "polashravya": "@sherryshroff Which is your fav city for meet & greet?", "nitin.tyagi.507679": "Cool moments", "vithika_rai98": "Being a foodie , what's your favourite dish?😁", "nighaxt": "What are your phobias?", "sindhu970": "who is the most romantic among you n vaibhav?!😍", "iinoskanii": "Can you curl your tongue?"}