{"siddhishedge96": "What kind of inspiration do u both get from each other? Love u both 😘😘", "shoegirl.sabi": "Sherry looks awful", "himanshu78912": "Is she bihari?", "priyatiwari_07": "How you both met?", "sukanya10das": "What is that one thing that you both dislike about each other?", "thetanujamodi": "What's the best sejal kumar video that you like and vice versa ?", "sassy_neetu": "Internet queens @sejalkumar1195 @sherryshroff", "meenusethi1985": "At what age you both had your first boyfriends?", "anshikapathakx": "Which is your fav food ?", "ruchir.11": "Comment on each other's fashion sense..", "mhatari_pranjali": "If you could change one thing about YouTube from a creater's perspective ,what would it be n why?", "laxitasoontha": "This is so awesome ❤️❤️❤️❤️", "thewritething123": "It can't get more genuine than this. I mean these girls can't exactly feign anything... Whatever said comes from a genuine place... And I say this especially for @sherryshroff though I also believe @sejalkumar1195 is similar too :)", "galaxygroove_mansii": "Who is ur Girl crush amoung Indian and abroad youtubers ❤️❤️", "rep.himanshi030": "What's ur both funniest movement??", "simran445": "What is the most grossest thing you have done in public??", "tanavirana": "What trips/ vacations have you planned for this year?", "monrose384": "Is she your sis? Are you full siblings? Same parents?", "riyaa_2001": "How do u manage time so well n does utube videos gives u satisfaction?", "palpasha.ns": "Love u both @sherryshroff & @sejalkumar1195 my fav two ❤️❤️", "tara_sp05": "Fav and worst thing abt each other @sherryshroff", "sumedha_rastogi": "Which is your favourite dog breed?", "racheal2930": "@sejalkumar1195 Shd try haircut like @sherryshroff", "shruu_ti": "How many boyfriends have you had?", "the_resting_fatass": "How to tackle with fat body styling", "harshita_tanwar": "You look younger than sejal", "reetikaaatandon": "What is the one thing common in both of you?", "rhythmandnitya": "Hey guys! So here's my question! What advice would you give to 3 years younger you?", "rishiikaa": "It'll be amazing if you guys do a 'do I know you tag'", "supz.raj": "💟💟", "ishaan_anand": "How do you guys plan to work on your respective channels to sustain the competition?", "queen_rushda": "Why didi you cut off your hair?", "sakshinsta1603": "The most awaited collab 😍😍 what's your each other's favourite video?", "madhurima_p": "Yay!! My two favourite YouTubers 🤗🤗", "sharon_kammattil": "What made u guys work together and how did u guys get to know each other ??", "tanugoswami0609": "My favs you two 💖 yayyyy 🙌", "niveeeus": "What prompted this colab?", "_._aarushiiii_._": "Are you going to cut your hair again once it starts to grow!?☹️🙂", "rathore_neelam": "Oh my fav youtubers together 😍😍", "priya._.645": "What is the best app for editing a video? Pls tell me . I m an aspiring YouTuber", "meenakshi_nakka": "As she is younger than you. What suggestion will you give her about life and everything", "srikanth_xavier": "Post sex selfy😂", "nsharma2891": "Kayamat hai ji .. bawaal", "khushi_301": "Being from different cities, if you had to recommend only ONE not-so-famous place/restaurant/fav spot in your cities, to the other one, which would it be? Xx", "auchingc": "Yaaay!!!", "aaanamikaaah": "Finally !!", "jahnnnavi": "What would you do If you wake up as the other gender? ❤️ @sherryshroff", "iayan7": "Oh yes", "sharmistha19": "Do Blindfolded makeup to each other", "puspendra_yadav2512": "Good", "anushreebajpai": "How did two of you meet ?", "asthachetan": "Have you both got jealous of each other at any point of time due to their success 😛", "nikita_hukumatani": "Which college did you guys go to?", "pankhurikanodia25": "Finalllyy!! Waiting for this collab to happen since so long!! #persistancepaysoff 😂😂", "rupali.shekhawat": "What u guys love the most about each other's channel ?? Luv u both ❤️", "shettytrisha678": "How did yal meet?", "anushka17.in": "U both are mah fav 😍😍😍😍😍😙😙😙😚😘😚😘😘😙😘😙😘😚😙😍😚😍😙😍😍😚😍😙", "namrata_107": "Where do each of you see yourself in the next 4-5 years? @sejalkumar1195 @sherryshroff", "nivzz_": "This is gonna be hard, now GO AND SWAP YOUR GUYS CURRENT OUTFIT! 😂", "yourstylist_net": "Love this picture😍😘", "divisayswhat": "Your guilty pleasure??", "_ayushirajvanshi": "Omgg Omgg Omggggg", "priyankazargar": "@mahekchopda chk we have same top", "bhatiaaarushi2512": "What do you think about each other's work?", "nelma_nelson": "One thing u adore and dislike about each other", "vinitasethuram09": "Finallllllyyy!💕", "pragatiiee": "What about a couple channel sejal? Just like coupling sherry and vaibhav have.", "thatbrowneyedgirl_03": "👍❤👌", "vibha__balaji": "When would u recommend sejal to marry mohak", "srilakshminair": "Favourite indian youtuber?", "sancharipan": "Let's have a Delhi v/s Mumbai conversation on Street shops!! Like, colaba causeway vs sarojini!", "anna_taurus_1905": "What is the most weird things u guys have done in a public place? @sherryshroff @sejalkumar1195", "sonia_vernekar": "What do each of yu hate about yur guys? Vaibhav and mohak respectively and find thats common btw yu too??😛😛", "arushi95": "One specific thing that you like about each other’s content. Also 3 minuet style swap challenge.", "avneetkhosadhillon": "Which are your favourite 90's Bollywood movie 😀", "radhika044": "Shopping haul at Hill road, Bandra ! Challenge under ₹ 1000 @sherryshroff @sejalkumar1195", "mariss._.a": "If you could go anywhere in the world, just for a day Where would you go?", "jasminetalwarmaini": "Style swap ?", "zaisha234": "What is the one thing that you hate about each other", "lydiamashudi": "Tips on saving money?", "anoushka.jolly": "Style swappppp", "lilacrosewine": "Do you have something in common??", "anujadandekar": "What does Sejal like and dislike about Mumbai and you like and dislike about Delhi?", "lini.varghese25": "What do you like the best about each other's style???", "meowtza": "What is that one thing you dislike of each other?", "dishaadevlekar": "How many boyfriends have you guys had?😏❤", "anushree_poddar": "One thing about the other person you wish you had", "devinagupta_": "What does a mumbaikar think about a Delhite and vice versa ? XD", "ishaaa02": "Finallyyyy ❤️", "nipunmudam": "My two most favourite youtubers", "venujain08": "Fav shopping place in india ? Sarojini Nagar or ZARA? And why?", "siri___reddy___": "The craziest thing you ever did?", "nandini_227": "Which is that one wild animal you would pet??(extinct ones included)", "ishita16_": "Times when you regret your expensive purchases", "ii.shruti": "oh whaaaaat... two of my favs together. .. @sherryshroff", "sarah_hoon": "Firstly ..so excited to see the two of u making a video together!!!! Yayay😄❤❤", "_simranbakshi": "Sherry, u have followed sejal on instagram. But why havent u followed sherry, sejal??????????", "msana_": "How do u deal with insecurities seeing outher people more successful than you?", "annyesha22": "How difficult or easy it is to maintain a healthy working environment in both of your spaces when there's a constant comparison or unnecessary friction & negativity created between female YouTubers @sejalkumar1195 @sherryshroff ❤️", "anmola_0209": "Omg this is the most awaited collab😍😍😍😍...would you dress up with the outfit choices of each other?", "simarmadhok_05": "A piece of fashion advice for each other !?", "nandinidanani": "Please visit my online store for varieties of clothes and accessories for www.nandinidanani.wooplr.com", "styleinsense": "Oh damn Yasss !!", "shriyasonie": "Best brand and style both in western and ethnic wear for middle class family you feel..love you both", "enspireco": "Why do you think it is important for our generation to fight for #feminism ? @sherryshroff @sejalkumar1195", "snehatea": "Delhi fashion vs Bombay fashion", "promitathakur": "What would be the biggest fashion faux pas according to you two? Have you ever made one?", "rachanarane_": "Tell about each of your style statement", "nrupali_007": "@probonoshots This is a legendary picture and also a legendary picture for our friendship! ♥️", "_iamnehal_": "Two of my fav 😬😬", "izunicorn_00": "Tell about some thingss that Sejal you love and hate about delhi and sherry you love and hate about mumbai ??", "sanashaikhsayed": "how you girls maintain tat fabulous figure n beautiful skin...especially sherry u r flawless😘😘😘", "makeupbytvi": "Two absolute favourites in one frame 😍😍😘😘", "oendrila_oc": "What do you do when you are not interested in attending a party??@sherryshroff @sejalkumar1195", "pals1111": "Two of my fvr8s", "sangs.fnf": "1. What is one talent you will steal from the other. 2. If sherry was sejal’s future and if sejal was sherry past, what mistakes will you make again that shaped you", "nikita_keskar": "Tell your experience when working with fashion magazine. For Sherry is not new but sejal is new to this. Would love to know about the shoot stories, etc. ❤❤❤ Finally a collab 😘😘", "322436ee": "which on is better? delhi or mumbai??", "priyasalunkhehihai": "What you guys think about each other's style since you both make styling videos for your respective channels 😬 #qna", "karishmarai78": "wow 👌", "janhaveejadhav": "Yayyyyyyyyyyyyyyyyyyyy", "sonali.08": "so nice", "aashvi_": "How do you feel between the generation gap that you share? And how does it show the difference between your youtube content?", "renuka0129": "Two of my fav..", "akanksha669": "If you have a chance to change something from sejal and yes from sherry also then what it would be.", "_tamannaa._": "As you both love travelling. If you got a chance for a trip together then which place will both of you go. #loveusejalndsherry", "diksharickshaw": "Can You do a challenge video with each other? Challenge games like vtss.. would be fun to watch!", "sak____0": "Jab Sejal met Sherry❤", "koikuchbolega": "When did y'all first meet and where? Love both of you❤", "monica_raja20": "Style swap please!", "faaworld": "Hows the life of youtuber? Pros n cons", "snehal_r_j": "Had you known each other before meeting? #qna", "_sushmitha_k_": "Wow this collab was unexpected..but here's my question to you Sherry. If you are of Sejal's age now in 2018 what would you do..something that you couldn't do back when you were of Sejal's age..considering you were a 90s kid..", "anchalsharma444": "hey, what are you guys binge watching on netflix lately?", "riddhibali_": "Stories with other youtubers", "94arpita.roy12": "Is sejal also love trying food just Like sherry 😉 coz sejal never make videos of food though she travel so much 😊", "meeradagar": "Ohhhh god two of my favourites are doing a collab Soooo excited!!!! Talk about similarities and differences in Vaibhav and Mohak", "pratiksha19813": "What u guys think about each other’s style? PS. U both are my favourites 💜❤️💜", "thealiferousgirl": "One thing you like and dislike about each other!", "binisha_ravindran": "Please do a styling challenge ...where Sherry dresses up as per sejal choice and vice versa", "apoorvi_b": "If you guys had to switch a day in each other’s life? Would you?", "anishadixit\nVerified": "Verified", "shreyargupta": "What was your first impression of each other?", "ridim.ch2": "Wow both my favorites in one frame ❤️❤️", "khyativarra": "style swap 🙏🏼 or style each other", "vijaiprerna": "Are you’ll actually friends? 😁", "divya.2506": "What’s that one thing you hate about each other?#asksherry", "quirkystyles_18": "Discuss about indian youtubers not supporting each other and if you’ll have any experiences about the same... 😃😃", "sonali_chugh": "Do you wish taking blogging to another level may be where it's socially relevant in the sense of making some change. Not that you are already not making enough, but I mean ground level association (once in a while) for relevant cause and speaking on issues. Of course you don't have the onus to be the voice, but nothing exist in reclusement and since you have people listening why not have a voice on pressing issues that may move you otherwise.", "romilapatnaik": "Favourites ❤", "kitikat06": "Does age play any role for being youtuber?", "zarayin.bastawala_": "Omg wow so excited", "bishtniyati": "Best advices for curvy fashion, if any?", "pranjali.mali": "You both pretty much have the same principles on brand collaborations...how does that make you survive?", "aakritismile": "Finally you too are doing a collab.. eagerly waiting for it", "jassimagdum": "How u guys stay so positive n happy all the time 😘😘😘", "merlgram": "When was the first time you guys met?", "_shreemann_": "You both are models and now youtubers, what else you wanna be? Or could have been if not these two", "dishabiyani3": "Whats your current favourite show on netflix?", "riddhi_sonetta": "My favorites🙈", "darshnanegandhi": "@sherryshroff @sejalkumar1195 favorite video of each other", "m_krushi": "Yes finally. Damn do a blog or shopping in time video.", "sampreettt": "People usually compare you both. Has it ever affected either one of you?", "_mahirane": "Sherry rate sejal on her clothing sense ! #qna #collab", "rhea30._": "Heyy Sejal n sherry have u had a ghostly experience ever tell us about it pls", "mansi_teaparty": "So glad to c u both togther", "evoceur": "Such a stunner", "mayurii_pedhambkar": "May be you can talk about Delhi vs mumbai", "khan_umaiya96": "do a challenge in colaba causeway", "mi_rajkumari": "What do you two admires most about each other @sejalkumar1195 @sherryshroff", "archee_a": "My ques is for you sherry. You have posted so many times about ppl spamming you on increasing your likes and folowers. What's your comment on that", "avilasha_hazarika": "Hey. Would you guys like to do makeover for each other ?", "kaashvidubey": "Would sherry try sejal dress and vice a versa also to re create each other last video😍@sherryshroff @sejalkumar1195", "gayatriholkar": "Ohh yayaya...finally. My two favorite youtubers❤❤❤❤❤", "selsharock": "How did u meet each other for first time", "nikki_deshpan": "Shop under1000 +style swap", "nehafirdose": "U both luk like twins😃.....what's on ur both bucket list???", "riyah_1712": "how do you know each other?", "nischitha_hegde": "What was the reason for you guys to join YouTube?? :)", "tanmayee_dalvii": "Kya aap Hindi mein baat Kar sakte hai?", "srao7": "Yayyyy :) much awaited! Where would Sejal take Sherry for breakfast+lunch+dinner in Delhi and vice versa in Mumbai?", "nair_manisha97": "Sherry... what kind of vidoes wud u like to do that sejal usually does. Nd same qstn for you sejal 💕", "tanyaaurora": "What was your first impression of sejal? And what was the first video that you watched of hers?", "anam_elyas_": "Who is more likely to hangout with younger people or older people ?", "nancy_yadav12": "Your favourite youtubers", "djain875": "Hellooo sherry and sejal 😍❤️ i loveee u both..💋 i discovered sejal’s channel through sherry’s channel.. soo just curious.. since when are u both following each other? ❤️☺️", "tvishasethi": "Whats the one day you will never forget in your life?", "neha.joshi09": "What are the similar challenges u guys faced when u started your channels", "khaute_choi": "My two fav.😍😍", "_wonderfully_weird_": "When can I meet you both!!!!", "mannanigans": "Finallyyyyyyyyyy!!!! :D", "_theworldofamethyst_": "Would u like go go on a Hair cut like Sherry has?", "amiablecreator": "what you guys hate being a youtuber", "nidhi_purple7": "@sherryshroff u should style @sejalkumar1195 and vice versa #sherrymetsejal", "itsmepipoka": "If you could exchange something from each other what would it be? Love you guys. So excited that you both are finally collaboration", "_mstpfc_": "What's your hygge?!", "creativemiddle": "Two of my favourites!", "aiswarya_ellath": "So, both of you tell us the first thing that comes in ur mind if u have to talk about the other one.obviousluy apart from YouTube blogger tag 😃", "janki.25": "Heyyy @sherryshroff @sejalkumar1195 you both r my fav! So my question is if you both would like to go on a vaccy ( just because i wanna see best of both vlog) where would it be???? Pls reply", "rakshandha.rawat": "Do a style swAp", "myinstadiaries": "Wooohoooo two of my favourite YouTubers together... A treat to the eyes ♥️😍", "mkmratta": "What colors to wear in summers..?", "shraddhapaniya": "It'd be fun if you guys enact each other!", "vedikasoni": "What are the similarities and differences between you too as you tubers", "sindhusha_pendyala": "Style each other would be even osmm", "_shubhangii._": "What's your take on the female security nowadays?", "vernier_callipers": "Could you have been friends if not through youtube? @sejalkumar1195 @sherryshroff", "rukaiyahalai": "Good to see you both together", "sakshi_dora": "Okay, so finalllly it's here!!!! So excited to see", "urvi_kadu": "Best video of each other @sejalkumar1195 @sherryshroff", "nikitasharma213": "Which is your favourite video from each other's channel?", "apurva_kakad": "What are the common features you find in each other as a YouTuber?", "gyan.102": "Cool", "milzz__09": "Most awaited video 😍", "divyareddy9755": "Great combo..best shot of each other during Vedio", "anshika_mad": "Why there is such controversy about you in the air?", "shruteeeeeeee": "How did you guys meet?", "sanjana_kadlaskar": "Since how long do you know each other ? 💕", "justjilanithings": "Delhi vs Mumbai! Which one’s better?", "itishreeray": "@sejal-has sherry has anyway inspired you to be an you tuber", "queenie_dmello": "Favs😍", "sakshi_varma": "What is the thing u both have in common !! We love u both❤️❤️", "ananyasalunke21": "Each of you describe YouTube in one word", "puriaparajita": "Hey. How do u both maintain urself so we'll ?? And what would u do to conserve the environment ?", "nikiitanair": "Bitch about Mohak and Vaibhav", "janu20954": "If you guys had a chance to be in someone's shoes for a day, who would it be?", "anoushkaa_19": "How are you both different from one another ?", "itsvasundhraaaa": "Faves ♥", "ananyattt": "Bombay or delhi?", "rxchelbiebs": "Hey Rachel here ..I really love it videos and what is ur current fav song", "tannu_dahiya15": "Sejal kumar?", "shenoykrishma": "What language besides your native language, can you speak", "shrutimangla": "Comment on each others partners?", "neerja_.__": "What struggles you guys have to face on regular basis as a youtuber ? @sherryshroff @sejalkumar1195", "magicxoxoz": "What are y'all favorite things to do", "harshitha.pulivarthi": "Haha, tell us your weird obsession", "md_mokbul_islam_13": "👍👍👍👍", "pri.asawa": "What is it that one thing the other one has and you dont? So excited to finally see you too together ❤", "sshreyasingh16": "Both are my favourite YouTubers 💕💕", "sanjana.14": "Describe each other's style and go-tos by their Instagram.", "piaffee": "Describe each other in one word with the opposite of the word you want to describe in.", "khushimehtaa_": "The best thing you like about each other?????", "riyabramhe": "Two of my favs ❤️", "agent_of_ennui": "what's your favourite off track travel destination?", "vijeyta.sharma": "YouTube then (when sherry started) and now (more recent when sejal started) how has it changed? How have challenges changed?", "girlintheeatery": "@sherryshroff @sejalkumar1195 what is it like being two YouTubers of such different age group and background", "paree_9": "Omg favssss", "dalallisa": "So where did u guys meet ???", "manvi_grover": "Mention your favorite YouTube video of each other.", "preetdave8": "Is this your first collaboration video with another YouTuber , if No , then name the first 3 collaboration with a YouTuber !", "blogsbyanusha": "Do a segment and enact each other", "sayli_gurav": "Is there a difference in your work because of where you both live? Delhi/Mumbai", "meghnamedar": "Hie sherry! Hie Sejal! I have a dark skin and I am suffering from major acne problem for months now! Tried doctor's suggestions as well but nothing seems to work out and it's too embarrassing.. Do you guys Have any suggestions? Much love❤", "priyanjalidb": "If you could drop everything and travel to one place rn, where would you go and why?", "upbeat_shots": "What are your plans for the next few months and for the next yr...@sejalkumar1195 and @sherryshroff", "hcshilpa": "Uff Finally!!!!!!!!!!! Can't wait", "heenadhabhai": "You both have different style....style swap", "prathanaah08": "What would you two be doing , if it wasn’t youtube?", "awing.spangle": "Do the eat it or wear it challenge", "chitvann": "How has @sherryshroff inspired @sejalkumar1195 being in the same fashion world?", "raveenavellore": "E P I C 🔥", "chinmayee_04": "Which fashion trend are you bored of?", "pooja_travelbug": "Two of my favs in one frame! Looking forward to this one!", "pavani_priya2": "Would you like to collaborate with her again?", "priyankaalmeida": "Which website are good to shop in cheap", "shagroo": "Two of my favourite youtubers together. 👏", "varshu06": "Both of you being foodies, tell us. 1 your favorite cuisine and name a specific item 2 what is best food item you had when you travelled (in a foreign country)", "chinmayeeb_": "Your favorite school memory", "pixelspersecond": "Wohooooooo!", "18_lasya_21": "What is the best piece of advice anyone has ever given you?", "helishahhh": "Give each other a makeove", "_ritika_yadav_": "What advice would you two give to new youtubers and bloggers?", "sha_v_ka": "Hi.. so good to see you'll together 😍Question : (1)if you can take two things from each other, what would those be..? (2) - what is your common favourite brand of makeup. Happy YouTube-ing 🤩", "rampal_nehal": "How did you guys come to know each other as on sejal’s first video the 1st comment is by you sherry😀", "prachiparasor_13": "What one good thing that u would love 2 have from each other....", "astha_khimesara": "Your individual experiences in journey of YouTube", "mehtaanjali11": "Yess!! Finally a collab between my favourite youtubers! ❤️ What is THE craziest thing each of you have done ?", "dsen997": "When sejal is getting married", "tetraaaaaaa": "A fashion trend which you would want each other to try!", "anusha.goswami": "MY TWO FAVOURITES!!!! 💖💖💖💖", "shraviyasaravanan": "A thing u would like to borrow/steal from eachother ?", "tanishaaj": "5 things u guys have in common?!!!! 👩‍❤️‍👩👩‍❤️‍👩👩‍❤️‍👩 #teamsejal #hahaha #oops", "ayn_dhrita": "When did you guys first meet and how did you find the journey of modeling @sherryshroff", "deepikarma": "This is awesome!", "sparsh274": "I would love to see fashion (clothes swap) videos of u guys", "prachi_potnis": "This question is for both of youuu about having a meetup in Pune 🙈🙈🙈🙈 sherryyyy I asked this question last year in an q&a to you n vaibhav.", "shaguntripathii": "Yaass", "faria_tahsin": "This is amazing!!!😁", "a__girlhasnoname": "Tell us your dream destination", "sangeetakumar": "My favourites😍😍😍", "gaurilogy": "jab sherry met sejal 🤗🤗🤗", "she.bleeds_ink": "what is the thing that u guys got inspired from each other", "yadav2309": "What a combo both of you are my favorite ones❤❤.Sherry mam a reply from you will be great for me .", "arya_03.05.17": "Would u guys like to do style swap with each other?", "___s_m_i_l_e_y_": "Sejal and sherry... What a combination.. ❤️", "shazia_barkathullah": "My two favourite youtubers", "mansijivani19": "What are some relationship advice you would like to give to Sejal by the experience you have with Vaibhav.", "ibelieveincrazy": "Finally!!!! A collab I was waiting for since long😍", "stutithaleshwar": "If you were given the opportunity to travel any where in the world, where would you go and why? 💖", "divikamath": "Yayay excited !!", "prachi_soodh": "Guys, do something related to fashion!!!!", "mehaktiwana": "How and where did you guys meet?", "shibani_2094": "The much awaited collab! Yay!", "rousiey": "Yasssss! Two of my favorites! Love from 🇵🇭"}