{"fashiovoyage": "Really wish to win", "anjaliii_mehta": "@sherryshroff done done 😘", "_shweta_gupta_28": "Participated...🙈 greatest desire to win this beginner's kit... coz i m a student n i m truly crazy about makeup now a days...😆 so i really wish to win this giveaway... 💫 hope for the bst...🙏🙏 @sherryshroff", "dishasetia13": "Best best best video ever❣️❣️❣️❣️... Everything one need to know is there.. You have helped a lot with this and I love you for this😍😍❤️❤️... These are the things every girl would need to have that look.. And you looked stunning... Just stunning😍😍😍😍... Your skin is flawless and everything is just right about you.. I loved each product and would love..... Love to have them... 😍😍😍 This is all I wanted ever.. Was waiting soooooooooooooooo much for this and it's finally here..😘😘😘😘 I would not leave this chance to get that perfect kit..😍😍 I'm not an expert and this would help a lot and would do everything to get that perfect look... Things will get a lot better if I get this... You will not know how much happiness it will bring to me...❤️❤️😀😀😀 Please please please please please please consider me..😀😀😘😘😘 I will be the happiest on the earth 😘😘😘😍😍😍😍 I have shared this on Google plus... ❤️", "dikshaaa_tiwariiiii": "@sherryshroff 9th september super duper excited fo d giveaway really wish to atleast this time...:) God bless :)", "miss.maurya_": "participated Everytime but never won a giveaway....please consider me😁 finger crossed...hope to win.. super excited😘💕", "aditi_abhyankar": "I hope I win this giveaway! It means a lot to me because if I win this makeup kit I will wear it often and especially on my birthday. It will be the best gift! 😍😍😍 @sherryshroff", "ms.adrene": "Hi sherry🍍🍍🍍, first of all , I do use basic kajal and compact, but I really want to know and start using other products you have shared in the video ,I am the third year of degree and we have presentations coming up, want to look presentable for the same, also it's my sister's wedding next month, I am desperately wanting myself to look stunning for the affair! Plz plz your giveaway will be of great use to me @sherryshroff Please choose me this time!! I want to look as flawless as you! Love u! Regards!😘🍍🍍🍍🍍", "padmawagle04": "Hi Sherry I'm a complete newbee to make up products!! I've just started using bb creams and liptints ..your video was tad lot helpful to know what products to invest in... This is my veryy first giveaway participation.I hope I'm lucky to have a headstart with your giveaway products !!!! .fingers crossed Nd love you!!!!", "manishareddya": "I soo wanna win this giveaway ..means a lot to me ... And much needed products as I'm entering college 💓💓", "rooni_begum": "Last day... Finger crossed.. Wish to win", "_dramatickle.error_": "Do I have to share it on all the social medias mentioned or any of them?! @sherryshroff plz rply di..", "sanasingh_": "Entered! ❤️❤️ @sherryshroff", "sharmaruby26": "@sherryshroff shared on Twitter n FB.... Waiting. Fingers crossed", "itsmesipra": "Is the winner name out?? @sherryshroff", "_axifaali": "Love u sherry di", "rpunamia": "@sandy_sonii 😍", "shoileemaiti": "@sherryshroff Hi didi...I love your videos..can u please help me to choose between two products..'loreal infalliable pro matte\" and \"clinique beyond perfection powder foundation\" ..I have oily and sensitive skin..I dont have any make up brush or beauty blender..And I am not \"make up\" person..But recently I got many spots on my skin .So I bought a concealer from clinique which is a shade darker and warmer than my skintone...So I decided to buy a foundation...I felt powder foundation woulf be convenient for me as I am not a pro and i want to keep my make up routine simple...But then I read good reviews on loreal infalliable pro matte...I want a natural finish ...a medium to lihght coverage would do..But i just dont want my foundation to look powdery..so I am confused...Pleaseee help", "colliss14": "Done Donna done done 🎉 🎊. .... entered and really wish to win and good luck to everyone...", "ms_j.alfredprufrock": "Entered... shared the video on fb on Google+", "aishwaryaps_": "@sherryshroff and this is the best cosmetic giveaway that I've ever entered. Keep it up. Loving it ❤❤❤ Fingers tightly crossed 🍀🍀🍀🍀", "vaiishnavvi": "Participating.. shared on instagram! Loving the kit! 😀😀😀😀", "namratasiddhu": "I hope i win this giveaway. M a beginner so i really wanna try this. Its just so beautiful 😍 @sherryshroff", "nilloferlatheef": "I would love to win this kit ...", "kalpana_verma2007": "Hope to win..", "prajakta_dhone": "Hey Sherry, I love you and your videos so much. You are an inspiration to me. You are such an positive person and I really admire you so much❤️❤️ I've also participated in your YouTube giveaway and completed all the procedure. Hope to win💕 @sherryshroff #giveaway", "overlyhormonalraptor": "Amazing video. For a new comer like me into make up world it helped alot. Thanks sherry! Much love! @sherryshroff", "archivesbyalee": "I haven't used make up yet.. And this video helped me a lot. . Thanks sherry.. ilysm.. winning this giveaway would mean a lot to me", "live.for.liam": "This video is so helpful.. but I won't be lucky enough to win this giveaway", "abrolsaab": "😄 Thanx,followed all d rules😘", "sherryshroff\nVerified": "Verified", "siddhimadhwar": "@sherryshroff Fingers crossed✌i wish to win this one😍", "aabrah_": "@sherryshroff thanks for uploading this video for beginners", "bajaj_shikha27": "Was looking for something like this so bad. Dying to win the basic makeup kit. I really wana own a makeupkit. Fingers crossed!", "its_bishakha_here": "Hope to win..fingers crossed..great video# thumbs up..love love..@sherryshroff", "taz.70526": "I want it because I want it as a gift for my birthday.. Basically I want to try new make up products and after watching this video I got guidelines on what products I should try. Even if I may not win them I will definitely try those and share my thoughts. Sherry you are too good.", "_preeyyaa_": "Entered the giveaway already @sherryshroff hope to win", "joylovefaith_apoorva": "Like it 😍 love it 😘 want it 😜😇❤️❤️❤️", "shirazsk": "Yeah @ruchi.p", "nazma2518": "Luved the video and really really wanna win these amazing products as a gift from u beauty💗💗", "anushka_n_19": "Hey pls see the video on YouTube!!! I am Anushka Nagvekar and I really wish to win this hamper please please please❤.I have shared this is on fb, insta and google as I am not on Twitter.. I would to win in ❤ @sherryshroff", "iyesha786": "Already done 💖", "priyankapalav254": "After watching this video i really feel lyk using dose products but my pocket money is not dat great so i can hardly get few things for me ... i wish to win this giveaway☺😊Participated a", "mysterious_beauty13": "M new to your world buh jus in a day i'hv watched number of your videos and i liked them all. But this 1 is my favourate cauz its more relevant to me i think.I don't want this.....Rather I NEED THIS! 😍 i am a beginner and i need this so mucchhhhh😍 And as mentioned earlier it would be the best birthday gift i'l eva receive 😍😍😍😍", "aiman__rais": "Hey sherry!! Absolutely loved this video. I have my wedding after a month and as a beginner in makeup I would really love to win this giveaway as my wedding makeup collection and also as a gift from my favourite youtuber. Please consider me. I have shared it on facebook and instagram. I really need this. Fingers crossed 😘😊", "the_burningsky": "its me rishika...!! Hiiiiii Sherry....!! you r soooo good... jst pretty amazing...!! many of your videos have helped me throughout except for the makeup ones... because i haven't started it yet... i don't even have a makeup kit and m in a huge blunder and confusion about what, why, how, and where to start...!! i'm currently in grade 12th and soon i'd b going to the college... my farewell from the school is not so far and so is the college's freshers' party... i really wanna start this stuff and get it right... as every girl's dream... i too wanna look pretty and gorgeous at both these occasions coz they are once in a lifetime events..!! obviously, seeing this video i'm a bit toooo excited as i now have at least a ray of hope... and as growing up with brown parents, you know its nt easy to convince them for anything... so goes for the makeup kits...!! i'd b grateful if you choose me...!! please help me out...!! P.S.- i have shared your video on Google+, instagram, and facebook, bt i actually don't have a twitter account... sooo... if you can consider...!!", "samiksha_0090": "Choose me this time please 🙏🏻", "a_v_a_n_i_": "I was waiting for this from soo long @sherryshroff", "olivegreen_girl": "Dear sherry can you please upload the picture of these makeup products???@sherryshroff", "vaishali1203": "Already entered ! Cant wait for the results 😊", "noorain226": "Wil v recieve all d 3 shade of lip and cheek stain or jst 1 shade?? @sherryshroff", "duo.diaries": "Follow us for all fashion & lifestyle updates", "anushree_poddar": "Your skin looks so radiant in this video. I really wanted to win this giveaway but I can't participate. :(", "arpita_agnihotri": "Hope to win this time @sherryshroff", "chethanag31": "Hi Sherry.. Shared this video to all my friends :) Keep sharing more videos in the future. We love you!", "pritibhole16": "I wanted this video soo damn much❤❤ and you uploaded it on the right time😘😘", "zainab.abdin": "I have also participated", "tanya291996": "@tanvi_kaura See it", "shwetasehgal7": "Wao", "yanita_ps": "It's a helpful video ☺", "aishwarya5626": "I Dont hv gd shopping qualities on me for makeup and all goodies for beginners are superb!hope i ll win!", "cosmetics.onlineshop.india": "Hey guys, check out our page for reasonable priced makeup products :) Don't miss it! Xoxo", "cloudy_thoughts9": "Superb as always!! Also entered the giveaway already....hoping to win these!!! @sherryshroff 😘👩💅💋💋💋💋💋💋💋", "badmaaash": "Totally loved the video, and learnt hell lot of things! Hoping to win the giveaway this time🙈", "david_shakya": "Hey sherry you're going to get me so fat by watching all of your gottadoindia food videos...yummy 😂", "malavikanair_7": "Why are you so amazing ..? I love you sherry 💕", "nidhi.sonii": "So perfect ❤️ @sherryshroff", "shikha_s16": "Meko. Chahiye yehhh!!! @sherryshroff", "mahek188": "Yeah!!!!perfect for me @sherryshroff", "akshitamehra1": "I m your subscriber since ages and i have like commented and shared your vedio and i do the same with your other vedios too! I need makeup kit bcz it will boost my self confidence good luck to mee😊", "rricha3": "Loved ur video it really helped alot. I thikn i am finally ready to start doing makeup... u r the bst scherry 😘😘😘😘", "aartirathod2016": "Best wishes to me. Nice video.", "aanchalsurekaa": "@sneha_deora", "artutopia123": "The video is really good for beginners! Thanks for uploading it Sherry❤", "bookswordsadda": "Amazing video for beginners!!! Thank u soo much and good luck to me and fingers crossed...😍", "richa_sharma04": "Loved it...!!! Happy dance happy dance💃💃", "surbhitaalbhii": "Queen!💁🏻", "pratiksha2650": "I had participated hope win this time ! ;). Love love sherry", "meghanaadimulam": "I hope I win dis time😁", "deepalid10": "Win win!!!!", "divyadhankhar_": "Entered the giveaway @sherryshroff !", "be_you_alisha": "Already participated", "kaavsv21": "u look simply gorgeous @sherryshroff", "harshita.jsr": "Hey sherry !!! I love your skin ya !!!", "cherryysharmaa": "Loved it!!!", "darshna.laxpati": "Hi sherry! U look wow in dis video!! Like just wowwww! 😍> this emoji is my expression currently!!👌🏻👌🏻👌🏻 @sherryshroff", "the_style_guide._": "Entered the giveaway,i hope i win this", "janhavisawant": "I simply would love to have those goodies because coming from you❤️❤️ love love ❤️❤️ @sherryshroff", "merinaghoghwani": "But am i the only one who cannot comment on youtube video?", "shweta_bhojwani": "@the.brown.female this is for me 😋🙈", "ananyaa101": "It's helpful na? @malharnarain", "shreyachoudhuri": "@sherryshroff YOU MAKE-MAKEUP SEEM SO FREAKING EASY-BREEZY 💅💄👌👗👠💄💅", "mitusomani": "I hope to receive a goodie from u @sherryshroff", "sharonmistry": "Hope to win d giveaway👍💖", "shrutigupta2610": "Gift me these. Plzzz i really need them. @sherryshroff", "sayyoni__": "I am enteringggg💋💋💋❤❤❤💙💙😘😘😘😘😘😘🙈", "karishma.nihalani": "Watching the video and entering right now ✅😍", "monika_nidhi": "Thanks sherry for sharing... I want u to use same products n give us a tutorial on how to use it... Would love to hv c that...", "anushkachow": "That's really awesome", "hetvi_tanna": "Omg Yess finally!! Ws in desperate need of this video! 💋❤️", "richa_va": "Nice !", "mitaligaur_": "Watched it..! And LOVED it! 😍", "couchpotato__17": "Yayy! Thank you @sherryshroff .Such a great video", "diksha1278": "Awesome"}