{"football_legend_star1007": "Go BALD sherry!! You would love it and you would look Amazing... Every woman should experience it once in a lifetime 😍😍😍", "darkanddecadent": "Go for a razor trim and colour your hair globally. I've always wanted to do that, but school🙈", "cierra.rowe": "half these comments are so negative.. i don’t know why people care so much about what YOU do with YOUR hair.you do you girl, you look amazing!", "alveera.27": "The first one looks so cool on u😍", "nand.singh": "@sherryshroff long hair, short hair I don’t care! You have been the same amazing constant fabulous person through all your hairdos for the last 11 years! Love you for who you are not for what you look like or do with your hair for God’s sake!", "pbadge1994": "🔥", "iadhuna\nVerified": "Verified", "xyzabc8882": "Side shave and cool funky colour @sherryshroff", "priyatabrajabasi": "Go for whatever you feel like", "miss_rahmaan": "U need to hv hair for a haircut dear!", "jinzey7": "I prefer your long hair", "sadiajabeen_92": "I think we all have been there (including me). All it takes is a single thought of ' Ok I am bored, let's get a haircut' 😅. So at this point honestly, you can let grow a bit just so that there is a something for the hairdresser to work on. That will be worth your buck too @sherryshroff 🤗 P.s- we love you any which way tho 💕", "pallab.chatterjee.524": "Biggest YES for u go ahead make a new trend", "arunima_seven": "Hair colour", "kathleenlobo": "Hair cuts change! People don’t! That’s true for my bestie Sherry! Always beautiful! @sherryshroff @nand.singh 😘😘", "ananditaegbert": "@sherryshroff that’s not hat you said when @anaitashroffadajania had given you the katori mushroom cut 😂😂🤣", "akshit07": "1st one", "nv_24496": "I want to see you in long hair u look beautiful but after all it's your choice", "_miss.unicorn__": "Colored Hair💜💛💚❤", "ar_sara": "I don’t think short hair has anything to do with gender. Some people suit short hair and some don’t. And it’s a bunch of BS that short haired girls have more confident and power. It has absolutely nothing to do with that it’s just a preference and what suits you. I think it’s awesome with short hair on girls. And I’m jealous because I wish I could pull that off but I can’t because of my features. And sherry you are a beautiful human being and you do you, but if I have to be honest this hair cut does not suit you. We always say that we should dress according to our bodies and shapes. Some people rock a bodysuit others rock vibrant colours. We don’t all fit in one size and same with hair styles. But in the end it’s your hair and you should do what you want with it 😊", "shneha.sharma2": "I love your short hair ! Make them shorter as much you can", "_.taha._tin_": "Please get long hair", "zainab.abdin": "I loved your long hair. Please I beg you don't get anything bitchy", "shipra_jha_58": "Queen!!", "saborni_poddar": "If a women shares a personal preference why does it become subject to such free and open judgement! So much of \"keep it this way...not so short...you look like a boy\"...@sherryshroff your comment section on this post is a horror story! (Barring the sane ones of course). I have been an advocate of short locks for almost 3 decades and \"you look like a boy\" and \"long locks is a woman's best asset\" rankles me. The sheer gender stereotyping is irritating and here we are saying that we live in a progressive world. Gah!", "rajashukanya": "I stop seeing ur post after ur haircut.. It's very ugly for u. Haircut doesn't mean equal to men. 😃", "nancy_archana": "Love your confidence sherry ❤️ #boldandbeautiful", "curlypearlygirl": "Sherry more power to you ! You should always and always be yourself and be ready to expiriment with the look . Whats the big fuss with your short hair ..you look lovely", "kalpana_singampally": "I like the 1st hair cut😘😘", "procrastinatorbymood": "@sherryshroff how about buzzcut and a hairtattoo", "shreyasensagoli": "So chic with short hair don't care!", "oldschoolclementine": "I'd love to see you rock crazy colored hair and undercuts", "hemangiagarwal": "You are so beautiful 😍😍❤️", "footballmg10": "It's a perfect time to go bald and embrace the beauty of a bald head and show people that's its just hair, it grows back...you would rock the bald head because you're not your hair... #baldisbold #Baldisbeautuful", "8niha_rika": "You look cute in the second picture", "shivaliclicks": "@sherryshroff your caption literally states that haircuts make you happy,aren't we all entitled to do things that make us happy,(of course without harming others)?? Haters will write useless comments,and you shall still be happy! Love you for all the happiness you spread everyday! 😍😍😍😍", "sravani_maramreddy": "You look amazing with short hair!!! ♥️♥️♥️♥️", "shreyayallapragada": "@scchandana.t_amjad Dude if you don’t have anything nice to say just don’t say! And what is this looks like boy? Lol", "bhukkad_bangali": "Go for a mohawk Sherryyyyyy", "aamnanajmi": "You are killing it and I love you ❤️@sherryshroff", "_up_up_show_me_the_way_": "Your are pretty anyway Sherry.. There will be a lot of criticism, about you looking masculine and all but if you can carry it off, feel confident about it then you are good to go. No one can define whats best for you except you yourself. And tbh I love your hairstyle.. I loved all your previous hairstyles too🤗❤️", "___s_m_i_l_e_y_": "You look fresh with short hair", "unikornamo": "Love the hair style in the second pic, from left to right! ❤️", "tapasyatrivedi": "@sherryshroff I hope you don’t let these silly, negative comments affect you! Follow your heart ❤️", "shrutiiiiiiiiiiiiiiii": "NOOOO!", "himanshi.singh": "U look young Sherry. More relax and free.", "nilanjanasahaa": "I loved the first look!💗💗💗💗", "urbanwomaniya": "❤️❤️❤️ Short hair don’t care! Go get ‘em chopped girl", "omgirl09": "@sherryshroff I love your really short hair cut. It's cool and best for the summer times. I actually just (a week ago) went straight from hip length hair to jaw length short hair cut.😀", "v.s.d.89": "You cut you hair..don't cut your hair...go bald... Whatever... You will still look beautiful", "atimhsus.s": "Why not shave it on one side! You'd look super trendy!! 😍😍 @sherryshroff", "pandevani": "You rock them @sherryshroff and you look very much like a woman contrary to what others say.", "aditiupreti06": "Its fascinating that somebody cant talk about their hair on their own page.. and how does somebody’s hair length or color define their mental state.. its called freedom of expression and not attention seeking!!", "notdramatic_watre": "🔥🔥🔥", "smarterthanyouraveragedesi": "Woah is this a coincidence? I literally just came back from the salon and got a new haircut tho not this short", "thesnehanandurkar": "There u go girl. U are different ,breaking stereotypes😃😃😃😃😃 #amazingly_amazing_sherry!! Lots of love❤❤❤❤", "jingleway___": "You look so beautiful in every haircut!☺️", "hrishikasingh27": "You do you girl! What do you think of adding some colour in the mix?😁❤️", "srushsharma": "I love you @sherryshroff .. You rock in every haircut .. much love from Hyderabad 😘😘", "adwitiyasen": "Awww you look so cute😘😘😘😘😘😘😘😘😘it suits you. I wish I could carry it just like you😞", "shrunil": "Might be some color?", "ashimachadha99": "I personally love short hair and you but i miss your long hair now....its been long 😭", "_silkthreadbangles_": "@sindhu970 Malli 💇", "ayesha_lal": "Hey sherry really liking ur short hair u should have more ear piercings 💋", "aisha41294": "Shave it off completely", "urviantala19": "Sexy haircut sherry😍❤️", "shefali_chaudhary": "I love your spirit @sherryshroff! Long or short, it's your choice, but the reason behind is so amazing! I wanna donate my hair for a similar cause, can you guide me?", "schhere": "It's not about looking like boys its about what suits you. This haircut doesn't. Telling this because am your fan and want to see you pretty.", "muskaan.sharma26": "Do whatever u want..dnt listen othr ones ❤😎 u r lookning prfctly beautiful my girl @sherryshroff 😘", "sonali.08": "😟", "nixnxnyx": "Girl get it, chop off as much hair as you want, get a Mohawk if you feel like it, it’s your hair and it’s your choice and the opinions of the others don’t matter!! I’ve been watching you for years now and I love your style 😍", "gauri06": "Her life 🙋 her rules 💪 her gamla 🙆her phools 🌹🌹💇.Take a chill guys. If you like it, appreciate it. If you don't then 🙊.", "the_sheen57": "Love the way you change your hairstyles everytime from such long hairs to this short you look amazing all the time", "priyankaailawadi": "You look amazing ❤️", "herroyalhokieness": "Try an undercut?", "girlwhoscribbles": "Defining gender with mere hair 🙄 even in this ultra tech world it is saddening so read through such comments. Sherry you are rocking as always. Your appearance is your wish and nobody has got anything to do with it ❣️", "priyankaroy9": "The 3rd look is my fav", "nikita.purkayastha": "Me too @sherryshroff", "yusrasiddiqui12": "Mmmm.. don't know what to comment.. it's cool.. but like every month u have been chopping.. well do what u love..😘😘😘", "sindhusha_pendyala": "New hair colour somthing like pink or blue 🤔", "prabina_nitin": "I think any haircut/hairstyle that makes one feel confident is the best.. 😊", "ankita_chandel": "It’s time to grow back.. you look much pretty with long hairs. First one was the best.", "rashmi_sacher": "Short hair and feminity was defined decades ago by one of the most beautiful actress Audrey Hepburn. All in for short hair👍. Hair don't define us, we do. It is just an added accessory more like ghar ki kheti😋", "mridulasa": "@scchandana.t_amjad How can a girl look like a boy? On the basis of the length of the hair? Its just liking each one to its own, moreover there are women who like longer hair and for various reasons have to cut them short and tht doesnt make them look like a boy, I have always had long hair coz I like it tht way but my grandmother always had the shortest length and Thts the way she liked it and trust me she looked beautiful😀", "durgathackeray": "I love how experimental you are and how you are embracing every look so well sherry! I admire you so much for the confidence you carry!Love yaaaaa❤❤❤", "sindhuja_dudala": "You look beautiful in whatever hair you have. It was beautiful while it was long and it’s beautiful when it’s short. Just go for whatever you like, who the hell is anyone to tell you you look like a guy. You look like yourself, which is perfect♥️", "shibani_jain": "Color it!🙄love the hairdo! So liberating!", "kalikasahni": "Can't wait to see your new hairstyle 😍😍😍😍", "racheal2930": "Do what ur heart says girl I wud suggest sides and back buzzed short to zero fade. Some hair on top", "_ananya__08": "Go bald/ dye blue 🔥", "design_your_nails_by_isha": "Cool👍🏼", "sharuu_k": "One side long hair cut looks so nice on you", "angada5": "DRIVE SHERRY, DRIVE! (Sounds like Run Forrest, run!)", "onmykamand": "I like the top left so so so much", "aviari0714": "Thou,i love the 3rd one.. 😘😘💃💃", "hairsation": "@sherryshroff definitely an undercut 😊😊😊", "mikherto": "How about growing your hair back to the good old days?", "nikhita_shinde": "Undercut ! So that you can play with the designs ... And colours .", "sidhu8477": "Go bald u ll b happy forever....", "pranjali.mali": "Just don't go bald", "_ishfinity_95": "@sherryshroff Do anything that brings a smile on that beautiful face dear!! 😍😁😎", "ektadangar": "Please grow ur hair... dont cut it 😔", "khushbu8376": "You are over doing when it comes to haircut.. atleast let it grow then go for haircut...honestly have some length else rest ur choice", "zorico13": "This is too much @sherryshroff you know I've been following you for a year.. Never ever comments on any of your thing. Actually I do like your vibes, spreading so much positivity & to being contended & confidence. But as I fan of yours, it's really hard to accept your hair cut. P. S. i knew our opinion is meaningless but just saying", "shivaaangi": "@akhilaeshapula 😭😭", "veevamoitra": "Let it growwwwww", "_drishtiw_": "Bald?", "arshdeepmann": "1 is the best", "nirvanalyf": "Plzz grow it long like bfr", "amol2887": "Again hair cut.", "_shonyha_": "Go pink 💞", "trusha10": "Go bald.nothing like that", "carineuppal": "Bowl cut!!!! 😂", "jennchacko": "Colour it blue or purple", "diptangi": "Go girlll", "deepapatil2401": "Add some colour", "sanjana_kadlaskar": "Shave", "naheshhh_": "bald?", "nomadic_journals": "@sherryshroff first haircut was good", "whiskeyshiskey": "Colour it pink and yellow", "aisha.nayer": "Come back to the original sherry with hair a little above the waist 😭😭", "shrijajha": "Go bald", "deesmileo1": "Dnt u think u r overhyping or trying to justify your look.go bald now..will that make u happy..but stop just talking about your haircut..", "mrsmukherjeeganguly": "TRIM and Colour it RED! ❤️👁️👁️", "anam_elyas_": "Shave one side", "bombaymode": "Do whatever your heart wants", "goyalprakriti": "You can get a mandala hair cut", "smridhimarwah": "Grow them out for the first one😍", "_tw1sh_": "Undercut with hair tattoo !!!", "vishalsane_69": "Ganju ❤", "swaroopmishra_": "No haircuts please!", "sanandasarkar96": "First one look is the best😍😄", "its.scchandana": "Big no no for such short hairs..I like you sherry but in such cut you look like a boy. .😯😯", "isha__sachdeva": "Go purple!!!!", "preetikaww": "You fill me up w positivity IDK y🖤🌸", "ab016": "Go bald 😁👶🏻", "bhawna____agarwal": "The first cut was far good 🔙", "madishree": "CUUUUUUTE AF", "dhillon__dilpreet": "Go for undercut", "kajalsometimes": "Love your haircuts after watching you even i chopped my hair and trust me i feel so light weight on my head 💇 @sherryshroff", "icanseeyagogoi": "SHAVE 😍", "shwetavdoshi": "One side shave. Like in mockingjay", "its_bishakha_here": "The first one is the best..with that swag bang...i loved it..😍😍 @sherryshroff", "raveena_isabelle": "Any style suits you @sherryshroff and that's freaking awesome!", "pocl_84": "Get a buzzcut🔥💇🏻‍♀️", "beautyphiles_diksha": "Girl!! Plz no moree haircut. I used to love you with long hair👌🏻💗", "ramyanis": "Don't chop it off.. you may try some colours instead..", "lydiamashudi": "Noooooooo please keep your hair long like really long like how it was before haha! But you're always gorgeous either way!", "ysdnsingh": "Go bald", "gaurichopra": "Buzzcut!!!!", "dsen997": "Please share Vaibhav's expression....", "apurvanicky15": "I don’t think you have many options!", "sristi_jaiswal": "Noooo! Plz!", "famma07": "The first one looks so good 😍", "bethh_ny": "Bald I think 😍", "apoorvamodgil": "Waiting to see what is coming next 🤔🤔", "___sunandinisaha___": "One side shaved 😃", "shruthi_udhugot": "😇"}