{"uttaraiyerr": "Please give me some tips on starting a YouTube channel and posting content on that consistently @sherryshroff #AskSherry", "durgasekaran19": "Had or still have a crush on any guy other Vaibhav? Check out other guys?😜 @sherryshroff", "kandadai_akshitha": "Boo", "tasbiashah": "What do u think about having space in a relationship is all about? Does it necessary to have space or it’s just mind concept", "zapomago": "if and when are you going to let your hair grow again?", "raufa184": "What is your most joyful or happiest movement in life ?? Except marrying vaibhav😄😄", "prapti__0.5": "What is your favorite food item", "ishitakapoorr": "Your current favourite snapchat filter??", "nehaimran____": "What’s your favourite restaurant in Mumbai and why?", "meenayadav235": "@sherryshroff how did you get those awesome hand musles? Share some fitness tips", "farhankylez": "💪💪💪💪", "littlekhanna": "Can you do a meet & great with zreh & zane?", "sanaagupta": "What do you do for your skin @sherryshroff ?? Its amazing", "lotiononmyfeet": "Sherry how do you generate ideas for your YouTube content?", "aishwarya.bhanushali": "Start a series with zen and zreh", "thinlinesthickskin": "Do you like reading books?", "vernier_callipers": "How to get along with the husband's family?", "chandrika_hazarika17": "@sherryshroff Can we still send you letters to the address you have give in your youtube intro section? Or have you changed your address.", "sugandhaarora_": "How do you deal with people who are fake and only interested in you when you are at a higher place in life?", "blossom532": "Can u suggest the right age or a minimum age to get laser done?", "wreckoner": "What is your content creation process? Why do most Youtubers constraint their contact to weekly or biweekly, why not post videos whenever they get fresh ideas or content?", "__m.a.n.s.i__": "How do you manage to go for a run in rains ?", "girlwithawishlist": "@sherryshroff how did u like taking break from youtube ? I surely missed u.", "allaboutjesus06": "What was taking a break from YouTube like? We missed you thought😭", "pratyusha_royc_16": "#AskSherry would you advise someone to get married to their best friend or stay friends.", "oendrila_oc": "@sherryshroff which is your favourite hangout place in Bangalore??", "fernweh_2612": "Which sites are good for shopping clothes online?", "deesign20": "If you had to spend your whole bank balance within a day..how would you spend it?", "ramandeepkvirdi": "Hey, any tips on how not to overeat sweets. I eat sweets every single day and my face seems like I have allergy", "scentsofbliss.co": "Can you tell us about your love for scented candles?", "sindhu0705": "R u going to have a pet after Simba", "gulabisherrr": "Are you planning to have babies??????? @sherryshroff #asksherry", "tanvi_thakker28": "What would you be doing now , if you were not a YouTuber?", "takiar.kanika": "Why don’t you own any pet?", "madhurima3006": "How do u split finances between u n vaibhav?", "shreyusingh18": "When will we get to have a meet and greet in Pune much love to u and vaibhav♥️", "kamya_yadav_": "What is your current skin care routine and what would you suggest for dark circles and pigmentation... thank you...much love ❤️ ❤️💕", "rashmi_sharma1204": "Sin care routine with herbal or home remedies @sherryshroff", "farooqaaliya_": "How to save money in college or even earn it to buy the things you eant? #asksherry @sherryshroff", "meghaattray": "Do you think there is space for new content creators now with so many already out there?", "iamjananijc": "Hi sherry!! Will you able to manage vegetarian food for a week long? Since you are a hard -core non vegetarian?? @sherryshroff", "smruti_bapat": "Have You ever tried drugs?", "nehaa_makol": "We are curious about your financial situation? How do you manage to afford such luxurious lifestyle?", "kavyasirivolu": "#AskSherry what’s your fav brand of Sneakers for both lifestyle n training", "asmaansari2464": "Sherry doesnt hve kids lol @annu.cherian", "pretty_terrarium": "#AskSherry why did you cut your long hair??", "zarinlifa": "Are ur parents Indians? Cause u are so white and don't look like an indian.", "rajanya_sengupta23": "Hi Sherry I will not ask u any serious question.Rather I would ask you that describe one of the happiest moment of your childhood.", "ayushibhatia96": "Despite of eating junk how do you have such a toned body?", "deepalijeste": "Hey @sherryshroff You are my fav YouTuber #asksherry Have you started Driving????... It was on your list for 2018...Drive sherry Drive... love you", "_jisha_john_": "Where have you been all this while ?? 🤔🤔", "rifatrashidaa": "Which college have you studied in?", "mahi.seema": "Hi sherry.. Plz share some tips on saving and investment in money for long term. 👍🏻", "sharithas123": "Planning for babies", "vishhhhakhaa": "One fashion trend you absolutely hate?", "snackshii": "If you had to shift cities, which one would you go to other than Pune?", "prernasingh_": "Would you like to shift to some other City later in life ?? @sherryshroff", "jasleenbhullar17": "What shows are you watching currently?", "layaa._.09": "Best restaurant u visited In hyderabad?", "dharekta": "Hey Sherry! Tell me about ur fav moisturizers", "samanta_moumita": "How do you cope wid d humidity? Some tips/tricks? How to tame frizz in such weather?", "anjaliepaul": "@sherryshroff If you do receive any hate mails or messages, how do you deal with it?", "_.prerana.ms._": "Did u have any past relationship??? tell us about it", "deepika.padukone00": "Are u planning to grow your hair anytime??", "neethukrishnann": "What made you decide when to marry?", "jayni_08": "Do you ever run out of clothes😂😂❤️❤️ #asksherry", "anoushka.jolly": "Get your mother in law for a video!!", "phancy_drama": "Sherry are you up for a YouTube collab with a new youtuber ?", "ritusharma47": "#AskSherry Choose between 1}Vaibhav or Prawn Curry 2}YouTube or Instagram 3}Food or internet 4}Friends or GOT", "___v.apurva": "What is your favourite maharashtrian dish??? #AskSherry", "gaurivyas02": "Hi there, YouTube isn't easy, and it takes much efforts to reach great levels. So, as a motivation, would you collaborate with small YouTubers?", "divya.2506": "Things one should keep in mind while planning his/her career???#asksherry", "upbeat_shots": "#Asksherry @sherryshroff how do you get over anxiety when everything is just falling apart?", "himakshimalhotra": "What would be the title of your autobiography? #AskSherry", "alkaarora_": "Define your youtube channel in a word.", "momfunda": "Hey Sherry! Which are the best resorts to stay in Goa? And also please some tips for those who are travelling for the first time 😊. Love your work! Elina ♥️", "sharanya_18": "What do you do when you feel that everything is falling apart?", "itttzzzz.sweta": "#AskSherry...Hey Sherry I just love your videos...just wanted to know that when did you decide that you want to be a YouTuber ?", "tanvi.16": "When r u doing video with Zreh n Zane. Really want to see those 2 munchkins 😆", "footballmg10": "You look so beautiful in short hair and also did a inspiring video on it...how short will you be going? Will you ever go completely clean bald and show girls that girls are not their hair and bald is beautiful...m sure it would really inspire people to donate hair to cancer patients and also the patients of cancer and alopecia would feel nice. 😊", "shraviyasaravanan": "How to be updated with discounts and how to shop smart, like see the best discounts and get the best deals.", "padma_amo": "Sherry ! Do u feel any cultural differences with Vaibhav interms of daily routine stuffs ?", "arshia_2513": "Hey what do you do to stay so slim and patla😂?", "_khushiibhatia_": "Your all time favourite 90s show?", "zaib_sidiki": "Hi my name is zaib. I am from pakistan.l am your huge fan. What's your age? what are your makeup essential? Plz make a video with komal pandey , shurti arjun Anand and my miss Anand.#loveyou", "priyamehta1069": "since you and Vaibhav bought your new house with your own money, what tips would you give while buying your own house", "sayli_gurav": "Since it's your birthday month, what is the one thing you learnt having reached this age?", "disha_kapadia": "Do you prefer living in abroad or India??? 🤔🤔🤔", "sanjanagangolli": "U are lively person", "niharikakanala": "how did you find hyderabad? i saw that you recently visited hyd.", "harshada_kamble": "Where are the pants from in your last post?", "fashionvibes_happy": "Your education?", "poonam.mundepi": "Hi @sherryshroff !! These days most of the vloggers content is the same sponsored content. I feel only you are the one is not following the same boring content of sponsored videos. How do you still manager to keep your channel away from all this when you see everyone doing this??", "tejasvikhurana": "Your parents are not conservative.. and they let you be..what if they would been strict how would convince them to be a YouTuber ? And what challenges you faced to be a YouTuber.", "akshatakulkarni_": "Sherry, how do you overcome low self esteem? Loads of love from Bangalore! 💕❤️♥️ #AskSherry", "manpreetkchhina": "Your channel lacks content of any sort now , same repeated stuff . Can we hope for better videos like the old times ??", "meenakshi_nakka": "How is Hyderabad.", "_khushaliii": "your fav emoji? Any Netflix show you would love to be in ?🤔", "sackofstyles": "Just wanna know wat kept u going when u were not married bt u were in a relationship with Vaibhav i mean there might be some fights some miss understandings so how u guys use to resolve it becoz even i have a relationship of 6years and now its lyk we suffer from many misunderstandings and we are i a distance relationship so give some tips to make it a happy relationship or share sone incidence of yours", "asmita_wt": "Have you started driving car? P.S your new year resolutions #drivesherry", "little_dhokla": "When are you collaborating with Zane and Zreh? Love when you shoot with your nephews!", "aishwaryanair15": "Hi sherry! love u a lot...pls tell us your favourite street food in Pune #asksherry", "meeradagar": "How is Vaibhav as a husband is comparison to what he was before the marriage?", "chanusonia21": "What's next after covering all Indian states?", "stuti_patil": "Wierd vaibhav/celebrity habit that you have come across #asksherryshroff #Asksherry", "gayatri723": "Share your experience as a masi. The best moments from there birth to now. Ppl say masi are the cooler version of mother. Do you agree?", "mikasaattkerman": "Hi Sherry🤗. I love the way you speak. Can you please tell what's your accent esp the one in your \"How well do you know me\" video on coupling?", "kalravshah_": "Do you run gotta do India ? It’s your channel ?", "urviantala19": "What makes you roll your eyes everytime you hear it?", "zorico13": "Do you wished to have a Baby Girl or Bay Boy first? How many children do you want?", "poulami.maz": "How do u deal with jet lag..??", "_srushhti_": "If you could change your hair colour what would it be ?? And why??", "the_scribble_scape": "@sherryshroff What unethical experiment would have the biggest positive impact on society as a whole?", "nikita_hukumatani": "How and when was your first kiss?", "tasneem166": "How to balance between family commitments and work commitments... you can either give your 100% to your work leaving behind your family or give 100% to your family leaving behind your work", "siddhishedge96": "Would like to know about your view on how to be a multitasker and how to maintain a balance between our responsibilities towards family, work, friends and ourselves?", "the_rightbite": "Best brand for good sunglasses", "shweta_pattnaik": "How to stop hair fall! 😭", "vedal_r": "Heyy Sherry!! ... lots of love😘😘. Name your two favourites based on the following categories!! 1. Bollywood movies 2. Lipstick brand 3. Cuisine 4. Netflix series 5.footware brand. #AskSherry", "ritu_kumarr": "Do you earn enough? Can YouTube be a smart choice for a career? What do you suggest?", "emmygeminious": "How do u feel comfortable without wearing n e makeup inspite of bein a blogger wer every one wears dozens of mkeup", "niyatipshah": "When are you making a video with your nephews? They are too cute❤️ @sherryshroff", "sonali.08": "you are gorgeous 😘😘😘", "kenny_choksi": "#AskSherry tell us some funny moments and funny topics on which you and Vaibhav fight on 😂", "simmi_newoscar": "Current fav lip bam ?", "tridha_mukherjee": "H&m or zara? 🌼", "tanmayee_dalvii": "Tumhi Marathi boltat ka?", "almadiisha": "What did you do in this last vacation? I missed your videos and posts and I am glad you are back. 😘", "juhhhhiiiiiii": "how come after so many years also you two still love each other.dont you guys get bored of each other.???", "patilankita_94": "How do you always manage to be and look so energetic?!", "retina_naskar": "How do you pronounce schedule? Sche-dule or sca-dule !? #asksherry", "rocho.123": "What were your board exam percentage? And your favourite subject?", "therealkritigandotra": "#AskSherry what do you do when you feel low?", "pragya.singh.1441": "You never thought of acting ?", "biswas_priyanka": "#Asksherry where are you traveling next with vaibhav ?", "thefablesofgluttony": "How do you manage work life balance when you work almost all the time ?", "brar_nvnt": "Do you believe in destiny?", "pooja_y_": "When you will grow your hair back? #asksherry", "___thesha.hs_world": "Who edit your videos? #AskSherry @sherryshroff", "pranamya_praveen": "One gift from Vaibav which is very much close and special to u", "_destiny._.17": "What have you done in your studies and from where", "asanshika09": "Your favourite nude lipshade and eyeshadow palette???????", "nanhegde": "What are your top travel tips that you swear by? You must be an expert by now. ☺️ It would be great if you could make a video about this separately.", "_.parvati._": "What all lessons did youtubing teach you? @sherryshroff", "khushishah1406": "What percentage did u get in 10th n 12th standard?", "un_way_shaa": "How do I get to meet you in person?", "iroshnichatterjee": "When will Vaibhav post a new video on VT TV ?#asksherry", "thenikitaagarwal": "Are you good with kids? I mean can you handle them?", "xareenax": "Wats ur favorite perfume ?@sherryshroff #asksherry", "janvi.prasad": "What did you do with your wedding outfit? Just curious to know how do you use these designer clothes again ?", "smarterthanyouraveragedesi": "What is one life lesson that really hit u hard ?", "sowj_25_04": "What are the 5 things u don't leave home without ?", "keyasharma_": "Yours and vt story!", "kanchan0730": "Hi Sherry! How did 'Got to do India' happen to you? Was traveling always your passion?", "chadography_": "Any travel tips or restaurant recommendations for Paris? Btw love “got to do India”", "archanajha026": "#asksherry Lots of love Sherry ❤️My questions are 1. Who will be the one person with whome you can swap ur 1 day of life if given a chance. 2. First thing which inspired u to became a youtuber? 3. Can you sing a bhojpuri song for me.", "mynk_singh": "Wht makes u really angry in real life and on social media both ..?", "bkashwini": "I have started blogging newly... Pls help me with some do's and don'ts.. pls @sherryshroff pls help me... How to get attached to agencies for them to invite me for an event... Help me", "surbhi0308": "Hi... Tell me one thing how do you manage to keep your self so Happy?? I mean be some issues problem.... But how do you still manage to avoid that.... You always smile, laugh.... I love these things about you.", "aint_missnobody": "Where is ur dream vacay destination?", "srushtisalunke": "What kind of capital on an average should one spend for a good vlog camera", "_poojakamble_": "Hi Sherry!! What keeps you going and motivating in the world full of expectations and judgements all the time? The constant pressure of you have to be perfect in everything.", "anku998": "What u like to do most apart from travelling?#asksherry", "sindhusha_pendyala": "What’s the best thing u liked about Hyderabad in ur recent trip", "surbhi203": "Hi sherry, i am getting married on 7th August and i am getting pimples daily 😥 can u suggest me the solution @sherryshroff", "salonitrip": "Hi sherry could you please tell me is your full body laser treatment helpful ?", "neha_bhanot_13": "Hie sherry!! Where can I find all seasons of friends online", "amateur_escritor": "You are consistent on your channel , coupling & gotta do India . Vaibhav had a channel too why did he stop posting videos on his channel ? Also in between your busy schedules how do you & Vaibhav make time for each other?", "sheenievarma": "Hi Sherry! What is the one mantra you swear by? Much love ♥️", "quotes5700": "Plz do a video with anaita shroff", "aashanarealme": "What’s your favourite sushi spot ? #asksherry", "nehusrivastava": "Hey Sherry... why are you little bit lacking behind in video making nowdays??? Isnt this your first love anymore 🤔😟", "darshnanegandhi": "Street style shopping or Shopping from good brands.. your preference????? #AskSherry", "adiitttiiiiii": "The top 5 things u cannot live without", "arpitas_gram": "You do a lot of travelling...but still manage to stay fit and healthy and have a naturally glowing skin all the time.. how???", "swimmi_dew": "What do you do apart from YouTube nowadays...??#asksherry", "thenatashagaur": "Where you feel yourself right now? Bf turned life partner? New home new responsibilities add on with previous ones... How you can suggest one to maintain an equilibrium!!", "ashwini.mondhe": "Will you do meet n greet in goa?", "sharanyaadeva": "I've wanted to start a blog related to styling and fashion for the longest time now. I don't know how to go ahead, to start it on blogspot or sites like that or make my own website kind of a thing?", "mrs.bewildered": "#AskSherry how do you keep your skin flawless?", "labelalertco": "As a one woman army, how do you start marketing your passion project?", "whiplash5897": "What is your idea of organising a dorm room? @sherryshroff", "raimitaliiiiiii": "Where do you see yourself in 10 years ? ❤️", "faheema_jaffarin": "Do you think YouTube is an easier/ a less stressful job for the money that they get paid compared to other professions like being a doctor,an engineer or a teacher?", "deepikamenda": "How do you maintain your mood and your health in this rainy weather ?", "khan_umaiya96": "Y dont u watch any Bollywood movies??", "debaratisanchora": "How do you have this positive vibe all the time? Your voice lifts up the mood always!", "pri_ria": "Have you tried Bullet journaling? If no, then will you ever? If yes, then a flip through video would be appreciated.", "kirti_kulkarni": "Is there a procedure to get a TLC show?", "isra_0229": "We've pretty much seen you eat everything..but is there something that you don't like to eat? #asksherry", "pixelspersecond": "@sherryshroff hey sherry! Looking to buy lenegas for my Mehendi and sangeet. Could you please suggest a few stores in Mumbai and Bangalore. Prices ranging between 20-30k. Please help! #AskSherry", "prathyusha_tadimeti": "Driving driving driving? When are you driving? #asksherry", "meghainsights": "What do you and Vaibhav do apart from Youtubing? #asksherry", "punjabineelam": "Could you do a video with both your sisters? It would be super fun to watch them on your channel! #asksherry", "tresa_3998": "What kind of make up routine would you suggest for those who are new to all of these make up world ? #asksherry", "kanikas26": "Who clicked your honeymoon pictures ? And what camera did you use ?", "puneetkdhindsa": "Can you tell the difference between coke and Pepsi ??", "ishahaha18": "Some advice on procrastination, i procrastinate a lot need some help", "mansi_teaparty": "Travel essentials", "__jiya__v": "Hi sherry di just want ti say I loved your yt channel tips for YouTube bigennners", "ananyaaa.kheraaa": "Do you believe in life after death? #asksherry", "dargopatil_amruta": "What do you do when you feel low?", "smridhimarwah": "What next?", "vishalsane_69": "Voh bahar casualty me koi marne ki halat me raha toh usko form bharna zaroori hai kya 🤔#asksherry", "purvavs": "How frequently do you and Vaibhav fight?? 😂😂", "sohini.karmakar": "What is your fav thing to eat during the monsoon season in india? Anything special..that makes you feel good? We bengalis have special stuff like kichdi :)", "ayushikamboj": "How did you get rid of your stretch marks? You once mentioned in a video that you had some marks which developed during puberty.", "tanvi_chakradeo2810": "Who has a better dressing sense amongst you and Vaibhav?", "shreyashivaprakash": "#asksherry your favorite pizza outlet in Mumbai?", "richa_sonowal": "Hello Sherry..You are my favourite...I have few questions for you: 1) What do your prefer- taking decision from the heart or from mind? 2) Who is your biggest inspiration? 3) What is your favourite shopping destination in Mumbai?", "pranureddy9": "Have you been to any pace or country alone I mean on a solo trip... If yes where... ? 😍", "preya_pathak": "Hairfall tips!", "krishna_patel2": "How many countries have you visited as of now ? And how many are still remaining on your list ?? 💙", "seemabwaqar": "do you like to cook for ur husband ?? as it’s said that the way from a man stomach goes straight to his heart !!", "preetdave8": "List 5 best birthday gifts / birthday moments you ever had till now ? It's difficult to pick up 5 , I'm sure all your birthday were best but still , give it a try ! #Sherrysbirthdaymonth #Asksherry", "sandalwoodcloset": "What tip would you give to college freshers?", "pranjali.mali": "Where is your mother in law?", "smrutic09": "Review iwatch", "yangkyidoodle": "Sherry, what do you have to say on being unambitious??", "gautampragya06": "Excellent Picture", "shivani.gadhiaa": "what does vaibhav do which irritates you or what do you do to irritates him?? and what do you love the most about rains??? #asksherry @sherryshroff", "walking.mermaid": "Isn’t it less complicated for everyone if you just use ‘questions’ feature in instastory ?", "dhanalisurve": "Zara or h n m?", "nikki_goli": "Do you believe in the concept called destiny ??", "simrangoel": "Do you like to cook? 😀😀", "raksha__thapa": "hey sherry.. i have been watching your gotta do india series. i must say you have great appetite😝 and in one of your videos you have also mentioned that you don't diet. and also i think you are not a gym person. so, my question is HOW DO YOU MAINTAIN YOURSELF WITH SUCH AN AMAZING BODY?? 😢😢 please share some tips. I am your biggest fan ever", "thezenfulchronicles": "What kind of lifestyle do you aspire to live? What are your priorities in life? 😇 P.S. - You are amazing.", "sunsetiyer": "Why does society rate success over passion... Is money the one all? Would love to hear your take on this #AskSherry", "iamiratyagi": "Hi Sherry❤️❤️ Lots of love from delhi ❤️ you and vaibhav would also fight one time from the other! Who is the peacemaker 😍😍", "sail_vk": "Hey Sherry! Why don't you make videos with zreh and Zane? What are you binge watching on Netflix now?", "nishitaakaushik": "@sherryshroff how’re you doing on your resolutions!?? We’d love a video of you giving them a good old college try!", "nancy_yadav12": "What is your present favourite song", "srishti.aneja05": "Hey Sherry! How have you been??please suggest where to buy some elegant jewellery pieces from?", "anushka__22": "Do you ever see yourself living in any other city than mumbai?", "imaleen_deka": "Your spirit animal", "ebanhyams\nVerified": "Verified", "sassy.sizzle": "Your favourite holiday destination?", "shruti__thakore": "Pls pls pls respond to this. When r u having a meet up in ahmedabad? Would love to host u and show you around. Greatest shroffer from ahmedabad..", "pri.asawa": "The first question 🙈😛😘", "wishing_well_chair": "What's your favourite bakery to eat at ?", "aakanksha2410": "With your busy schedule that includes so many activities and jobs, how much sleep do you get? And how much you think is necessary for everyone? #asksherry", "rishab_bardhan": "Which college are you from ? #asksherry", "palak_khandelwal1": "Baby????", "pranitadhikary": "When you planning to have family"}