{"vashishtshagun": "@sherryshroff ur so so so so cute sherry :) wish u the happiest marrige and happiness there after 😄", "rituparnakumbang": "Who is designing ur wedding gown.... ❤️❤️ and congratulations.... @sherryshroff", "sherryshroff\nVerified": "Verified", "anu_pekayare": "@sherryshroff do u get emotional with the thought of leaving ur mom n dad and ur home..and moving to a new home leaving ur mom and dad..??", "khan_umaiya96": "I know this would be funny or like wierd qt but in ur wedding any celebrities will there or not!! 🤔😌 @sherryshroff", "deeda_96": "@sherryshroff Could you please do a new house tour? 😊 #asksherry", "afreen_afu_": "I have searched for your first video but couldn't find it..so can you link a few of your very first videos..😁 and yeah couples obviously fight..so how did you manage to overcome all those fights ? Any tips ? So happy for you guys ❤😘😁😍", "padmawagle04": "Hey @sherryshroff what a bummer!! There were a bunch of good questions in the last update!! I really wanna know bout the long distance phase you and Vibhav had and the difficulties you faced then and how you overcame those !!to be the strong couple you are now!!😘 And congratulations on your marriage!!I hope you answer my question love ya😘😘", "kavya_menon_": "Hey sherry what happened to our giveaway? @sherryshroff", "kasturiverma": "@sherryshroff thanks a lot", "upadhyay.nishita": "Love Love love love you @sherryshroff you are the best and I even watch your travel vlogs on gotta go India and I have seen almost all of your family members through your videos except your 2nd elder sister, if you have mentioned anything about her in any video except the draw my life video, please let me know. Also congratulations for your big day💜💜💜💜💜💜💜💜💜💜💜💜", "sabharwalvasudha": "what kind of hairstyles suit curly hair?", "swiffyvidhya": "Hi..... Do you know to cook? 😍😃💞", "aishi.barman": "Would you like to have pets in your house? #asksherry @sherryshroff", "natasha_shahmak": "winners of giveaway diwali giveaway??", "vaiishnavvi": "When are you going to shoot a video with Zreh and Zane next 😀😀😀😀 I miss them!! Love xoxo", "janhavisawant": "I really like the fact that your not materialistic, your natural @sherryshroff please be the same ❤️ love love ❤️", "samarsaiyed": "@sherryshroff who is ur best friend(except vaibhav)..???#asksherryshroff", "goyal_umang": "@aayu_y", "muskaaaaaaaaaaan": "I am super duper excited for your wedding day @sherryshroff @vaibhav.talwar you both are one of the best YouTubers I've seen. You guys have almost said everything about your lives so I just wanted to ask about your outfit for your wedding? I love you sherry❤", "cloudy_thoughts9": "We all love you and wish u very happy married life ahead!!😘😘", "stylishqueenbeeee": "What is your worse nightmare?", "srushtisamant": "Do you remember me ?🙈", "sonalimendonsa": "hi sherry!!!!!! congratulations!!!! u currently live in colaba if m nt wrong :? where wil u be movin to .. within mumbai...? how does it feel leaving ur space n movin n settin up another home ...? I love ur room ...", "duttaabantika": "😍😍😍😍😍😍😍😍😍😘😘😘😘", "tanvi_pawar": "Hey Sherry!!! Congratulations to you n vaibhav.... My question is when n how did u tell your parents abt ur relationship with vaibhav n wat ws their reaction??? 😘😘", "siiimmrann": "In your recent video, after your wedding trial you went home (which is in andheri I suppose 🙈) and after that you went in a bank which is in Churchgate. So why did you travel so muchh? Anyway congratulations and ily❤️", "uttarahahaha": "Hey Sherry ! My questions are - 1) In the time span of 5 /10 years where do see yourself and your channel ? 2) how do feel when you are leaving your old home and moving into new home express your feelings in one word. 3) Do have any allergies or phobias? 4) are you planning to have a meet-up in Mumbai any time soon ...... And lastly I love you Sherry I admire you. #asksherry @sherryshroff -with love , your 12 year old fan , Mumbai 💕", "tripathiupasana": "#asksheeryHey sherry my question is how will your life change after getting married ? And love you like alwaz😘😘", "safa.ali1": "What do you think about the Indo pak argument and stuff? @sherryshroff", "icey.twinkletoes": "Do you like Harry Potter? @sherryshroff", "kripaprajapati": "#AskSherry is it true that once you marry vaibhav you won't be allowed inside the parsi temples/holy site??", "vivek.kumar1": "It's me when I see the known girl", "sushmita.guha": "Will you be doing a moving out or setting up the new house video? @sherryshroff #asksherry", "antara___10": "Ur education?", "karnika_singh": "Tell us about your law school days?", "_passionista": "What kind of a wedding will it be? Indian or western?", "navyakhurana2010": "Are you nervous about a married life?Your feeling as of now :) #asksherry", "pratiksha2650": "Sherry are u excite ? When is ur wedding", "priyadahiya_": "When u met vaibhav and you guys started dating.. did u have any idea that u'll be marrying him someday???", "artutopia123": "What was your favourite tv show when you were a child? #asksherry", "shivaniiii_97": "Will you be filming a house tour? @sherryshroff", "jot2822": "Hahahha i love dis 😙😙", "_sonia28_": "Do u love kids? Will u and vaibhav would like to have your own kid? 😋", "ramneetmann_": "When are you going to get married☺️💕 by the way love you X", "raashimudholkar": "Favourite book? #asksherryshroff", "peachesindia": "What wud u suggest. Few expensive clothes or lots of fashionable street side clothes 😃😘 @sherryshroff", "leixhang": "Modeling tips nd ur height", "the_gal_who_lived": "What would you choose Netflix or Hotstar? #AskSherry @sherryshroff", "prajakta_gawade": "Givewayyyy result please choose meee @sherryshroff", "silky_maurya": "What would you like to name your autobiography? #AskSherry", "colloquially.naisha": "which adjective suits vaibhav and u The perfect couple or the The sweetest couple@asksherry", "yukthaguna": "who is ur favorite designer and why ? @sherryshroff", "aabrah_": "#AskSherry - what will be the one thing u vl miss most after marriage ? & And after ur marriage will you change ur surname on social media from Shroff to Talwar 😘 #Mumbai #Fangirl😘😘😘 I actually forgot my last q. That I posted .😀 😘😘😘😘😘😘", "karishma_o": "Will you vlog your wedding?😋", "aroonema_koteyal": "when are you going to Vlog the new house? <3", "fashion_cruiser": "@sherryshroff Which is the best holiday Destination you have visited in India & abroad??", "richa_sharma04": "Heyiee Sherry.. I want to ask how do u keep urself calm & composed when u hv a To-do list running on a infinite loop in ur head #asksherry", "chaotically.yours": "Almost one month to go for the wedding!! Give me three words to describe your state of mind now!❤ #vtsswedding #asksherry", "_tanya_sharma": "What kind of wedding you ll be having, parsi or punju style?", "aashanarealme": "Which is your favourite place to have momos here in Mumbai? #asksherry", "natashaagandhi": "How did u develop interest in F1 racing?!", "ykyuhoo": "What was ur last dream about? (Or share any of ur interesting dream)", "nishthamehta_": "Did you guys plan your Honeymoon Destination?", "zainab__college": "Would you like to go in bigg boss house ? #asksherry and i love u", "anoushka.jolly": "New home tour #asksherry", "beccalicious.girl": "Were you'll ever on a break ? 🙊", "batra.aakriti7": "When will give us a house tour of your new house?", "chitvann": "@sherryshroff what are your must have's for your wardrobe??", "yusra_siddiqi": "Can you please suggest a way to loose weight and also some money saving tips @sherryshroff", "niki.abe": "@sherryshroff do you like watching cricket ?", "dhanalisurve": "Can u suggest some good editing software for windows? #asksherry", "khyatianand": "#asksherry how did you know that vaibhav is the one", "pallawijain": "Do you workout? How do you maintain your lean body?", "diyajaini.__": "Where do you shop from @sherryshroff", "monika_srivastava": "What is the one thing that you are most excited about after marriage?", "meenal_devpura": "New home tour video🏡", "prakritivermaa": "You and Vaibhav are together since 10+ years. Has your relationship ever had any ups or downs? Have you both ever broken up? Give some relationship tips of how to keep the love alive to today's youth.", "manishareddya": "Are you half Persian ?", "anam_answers": "One thing about marriage that really freaks u out??..n one thing about marriage that realllyyyyyy makes u excited about getting married? @sherryshroff", "vrush_1003": "@sherryshroff which planner have you decided to get for 2017? #asksherry", "v_anki": "@sherryshroff #what r u gonna wear on ur wedding day? #asksherry", "upsiii_17": "We all know Vaibhav and you are hardcore meatlovers.. could you ever imagine your relationship if either of you were vegetarian? 🙊😂 #AskSherry @sherryshroff", "shweta_pattnaik": "What should the bride's sister wear during all the functions of an Indian wedding?", "joannmachado": "I'm sure u use whatsapp and YouTubers usually click a lot of DSLR pictures so I'm curious to know what u guys keep as ur whatsapp picture, a high quality picture of yourself or a picture or a selfie with family and friends #AskSherry", "vinaya595": "Hey sherry! You are a doll! My question is... When was the first time you felt that what you and Vaibhav have is real?", "kavi.kagwad": "Could u please guide me on starting my career .. I feel very down with my confidence as I have break of career post my marriage and baby", "insha27": "Cheap Matte Lipsticks in India ?", "thealiferousgirl": "As a kid everyone has a dream to become something in life or achieve something.. what was yours?❤️ #asksherry", "basicallyaparna": "Is it necessary to match your sneakers to your outfit? #asksherry", "anushkamanoj.20": "#asksherry how do you feel when your wedding is just one month away ?", "aprameya.ramesh": "Is the modelling world really as bad as the movie fashion portrayed it to be?", "sssoman_18": "Where is your new house located? #AskSherry", "niralishah_01": "@sherryshroff You're parsi, Do you know gujarati? I have been curious about this.", "jugneey": "How do you manage drawing a line between your personal life and YouTube? #asksherry @sherryshroff", "sahrish07": "according to you ...what is the right age to get married ?", "sonalmishra45": "@sherryshroff #asksherry favorite character in F.R I.E.N.D.S ? WHY?", "ft.muskaan": "@sherryshroff what are you gonna wear at your wedding??", "smruti_bapat": "Congratulations @sherryshroff!! When are you announcing the winner of the meet n greet??", "anishajasti": "Name you favourite youtubers..", "shrutidhapodkar": "#asksherry pls do shoot a home tour video pls pls", "kritikagoyal13": "Will you miss your old cute little room? Will you miss your ME time? #asksherry", "shreyaabhyankarr": "@sherryshroff #asksherry which genre of music do you like ? which is your fav band ? and which is your present favourite song?", "openorclose_abook": "Would you like to permanently shift out of india someday given the opportunity or you prefer to stay in india??", "kabyashree_": "Hey Sherry .. what are you wearing for your wedding?", "sayyoni__": "How do i get rid of continuous smelling underarms even though i have just waxed them and clean them everydayyy...😷😷😷😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭 @sherryshroff", "thatscorpiofemale": "Sherry I would be glad if you share your most memorable moment till date with us", "_keerthi.sai_": "Where is ur next abroad trip?", "merlyn_chettiar": "Quick tips on setting up new places... Since you guys r shifting to a new place... Things like furniture, electronics n so on... #asksherry", "paaalaaak": "What is the most treasured thing for you? #asksherry", "sagarikaforreal": "Hi sherryyy! I love u! My question is how did u manage fashion n law together! #asksherry", "ashimagambhir": "Hi sherry since your wedding is around the corner so if you had to vow to vaibhav what would it be ? #asksherry", "dikshakam1": "@sherryshroff #asksherry hey sherry. Love watching your videos. Congratulations on your wedding which is next month. My question is Are you experiencing any marriage jitters??", "brooklynandbaileydv": "What are you wearing at the Wedding?", "_anamika_saikia_": "What are some of the best low budget yet amazing gifts to gift a guy?? #asksherry", "vedanntiii___": "What is the colour of your wedding outfit #AskSheery", "nitishagoveas": "A fashion trend you can't stand? #AskSherry", "damnsuhani": "Do you think that there will be any massive change regarding YouTube after you get married ? #asksherry", "jlo_2.0": "Did you face any problem due to the recent currency ban since wedding preparations are on? Whats your take on this? #asksherry", "sanashaikhsayed": "How has the currency ban hit you", "yuga7": "#asksherry If you allowed to get away with one murder who would you murder ?", "kapooraishwarya": "@sherryshroff What are your thoughts about Trump being the new US president? Also who would you vote for if u could? 😊", "sravani_jasti": "#asksherry @sherryshroff wht is the craziest thing u do ever..", "bhaktiirao": "@sherryshroff how are you feeling about your wedding ? #asksherry 😃🎉🎉", "acirle": "Where's your new home located? #colabato? #@sherryshroff #asksherry #dontmeantoinvadetheprivacy #justabigfan❤️", "natasha_dsouza4": "Wat is the secret to ur glowing skin", "bavana_18": "Thoughts on the US presidential election? #asksherry", "shivani.gadhiaa": "@sherryshroff hii do u have a ac in your room??? I have not seen one ! #asksherry", "__radhikaaa__": "If you had to dye all your hair to a certain colour what would it be? And if u had to change your name to something else what would you keep it as? #asksherry", "procrastinatorbymood": "@sherryshroff first of all big hugs for the new phase which is going to start and did u always wanted to have a civil marriage instead of a social one?", "celeswilson_": "@sherryshroff ..hie sherry...my question for you is ..how do you deal when you are mad at someone?..like..what do you do to calm down when you are angry! Meditate??...listen to music??...pls give tips!...much love ♥ :)", "nitya26joshi": "What do you think you will be doing in 10 years @sherryshroff", "pvt.vnm": "Can u pls show us your wedding dress. Cant wait to see it #asksherry", "farooqaaliya": "what is your way to remove stress at home any motivationa quote about life you follow? #AskSherry", "saumyachopra": "Have you ever dated someone other than Vaibhav?", "ruhi.chopra": "@sherryshroff pls tell me how to pronounce your name? #asksherry", "ishitamirani": "Are you going to vlog ur wedding? #asksherry @sherryshroff", "anjalim2626": "Please can you do a house tour of your new home when you completely settle in ?", "jannatkhh": "Both of you are Leos haha how do you manage with them fiery traits?😂", "paramdeepkaur22": "#asksherry @sherryshroff please tell me things to kept in mind while going to buy bridal dress..i mean color,silhouette,jewellery which is going to suit...i know its depend on personal choice but anything which you can help for to be bridals....?💏💖?👰", "shilpadasofficial": "@sherryshroff you are so popular on social media and you ofcourse have to constantly update posts.so does it hamper your normal social life in any ways?", "aishwarya_v__": "Have u ever seen any south Indian films!?? @sherryshroff", "rashi_1029": "Sherry narcos or game of thrones?!. @sherryshroff", "romal_bhojani": "@sherryshroff Tell us more about your relationship with your sisters :)", "saniya1208": "@sherryshroff i lovee youuuu 💕💕💖💖 my question is what do you have to say about trump's win? 😈", "adithi.xx": "Hey sherry best of luck for wedding. 👫 my question is where did you buy the light glow cover for your iPhone and where you get the holder from ? Love you loadsss 💞❤️❤️❤️ @sherryshroff", "niharika.d": "What is your favourite food and also your favourite restraunt?", "ashritaaaaa": "Hi @sherryshroff I wanted to ask u if your name was not scherazade what would it be ? I hope Im featured in your video!!! Loads of love 😘xoxoxo", "tanzila_rizwan": "Hi sherry! When are you guys coming to Calcutta? Please please please come soon. I love you a lot! 😘💗 and how do you feel about your marriage? Excited? Nervous? 😁😁", "taaaanayaaaa": "What genre do you think that Indian YouTubers are killing the net? (Eg Diy Makeup)", "neville19": "Oh my god! @sherryshroff can I please do a video and answer all your questions??? I promise I'll be great", "gayathhriii": "#asksherry if you could elect one of the youtuber as the next president who'd it be?🍂", "rainbowsunicorns_n_me": "R u having some kinda separation anxiety ? Coz u r going to live apart from ur parents after marriage. @sherryshroff #asksherry ... Love :)", "susmita_mukherjee19": "How did u became u an youtuber .....lyk how could u make yr mild @sherryshroff", "_.kavyaa._": "What according to you are the beat and the worst things about getting married?? #asksherry", "vibhasimha": "@sherryshroff Love coming from Oman. Butterflies in the stomach since wedding is nearing??? I wanted you to either answer me or do a separate video for Ankle Boot styling. With clothing style would be bonus but I would want to know, how to lace it up? How to turn it around or different ways of wearing the boots and to play with the lace. Thanks much. Wishes for you ❤", "juikale": "What are your post wedding plans? @sherryshroff", "swetha_bee": "How are the living arrangements going to be? @sherryshroff", "its_kanchu": "Kya shaadi ke baad aap apna naam change karengi?? #AskSherry", "suvechchhya": "#asksherry so, your marriage is round the corner...what are the top 2 things you are expecting from your married life? :) Love you always :*", "devanshis1990": "@sherryshroff which is honeymoon destination or ver u wana go ??", "simranhirani97": "Where are your guys travelling for your honeymoon❤️ Will you guys upload a wedding video like josh and collen did? I love both of your channels coupling and the main channel. #vtsswedding#asksherry @sherryshroff", "neena_emil": "@sherryshroff what is the one favorite thing you would love to take to your new home post wedding:)", "itsananyaarao": "Answer my question please Sherry @sherryshroff ,#vtsswedding #asksherry", "sharmaanshika29": "#asksherry @sherryshroff ^^", "srishti2004": "What is your current favorite dish? #AskSherry😊", "j_kiran_": "After marriage, will you be cooking at home ? Do you look forward to be a housewife and a youtuber at the same time ? #asksherry @sherryshroff", "simranbhatia11": "#AskSherry What is the most empowering thing you have done?", "theshreyaaaaa": "Are you going to be posting videos from your wedding ceremonies and fucntions?", "raveenavellore": "Are you walking the ramp anytime soon? 😃 Because I think you're a great model and I'd love to see you walk the ramp! 😄❤ Sending loads of love from Hyderabad.❤❤ #AskSherry @sherryshroff", "avipsa_rc": "What is your next big plan after your wedding? @sherryshroff and why can't you comment in YouTube? Have you talked with them about it?", "shailyshambhavi": "Would u give us a house tour on your channel after your marriage? would love to see that..@sherryshroff", "tvishasethi": "Hey sherry❤ what is the one thing that is on top of your bucket list?", "shubhraaa_04": "When will you post your bridal tutorial? #AskSherry @sherryshroff", "rachanakashyap": "My lips are dark (especially upper lip) and they are almost always dry. Do you have any lip-care tips? I use Burt's bee. #asksherry", "nishifishy_": "Do you untie your laces when you remove your shoes? #asksherry", "a.n.jali": "#asksherry what inspired you to do what you love doing as a career?", "issa.worry": "#AskSherry Which is your current favorite song?😺", "leela__99": "What's your wedding date and venue", "phalesharawal": "Best place for Pizza ? #asksherry", "_dramatickle.error_": "How r u? How was 2016 for u? #asksherry", "yanita_ps": "Which bollywood actor and actress you like?", "ritvishetty": "What do you think about Trump being elected?and the amount of sexism that still exists?", "prakruti.shah": "This might be a cliched question, but I really want to know, as I just recently ( yesterday) found your channel and binged watched almost all your videos. So, what inspired you to start your own YouTube channel? #asksherry. P.S: You and Vaibhav are absolutely adorable together.😍", "arthoe123456": "I have acne prone skin and since using a sunscreen is always so tedious i dont use one, can you please let us know more about sunscreens and which ones are the best (dont clog pores, dont leave a whitish cast)??? @sherryshroff #AskSherry", "prachibhanu98": "#AskSherry What are you most excited on your Wedding day ?", "rabia_k9o1": "❤❤❤", "jo_joy_jyo": "#asksherry Honeymoon destination??😄", "nayanahebbar": "Sherry when will you give us your new home tour ?", "shenoykrishma": "@sherryshroff where did u get inspirations for your new house love you sherry#asksherry", "priyanka.toprani": "Heyy!! Lots of love and luck for new beginning! Wanted to know what were your designer options for your wedding?", "karkeraditi": "What's ur favourite Indian dessert❤😘", "1ditamishra": "Since winter is coming wanna know the best moisturiser for dry skin. #AskSherry", "chhayachitra_": "@sherryshroff giveaway winners?"}