{"vidhi_setia": "Hey Sherry! ❤️💖 First of all Congratulations on crossing 250k. 🎊🎉 You truly deserve this and even more. 😘💐 You're probably the only YouTuber with whom I can connect to a whole new level. 🤗💕 You're one of the most genuine and real personalities on social media who strives to steer clear from any negativity. 💖And this is the only reason I am participating in this giveaway. Receiving something from such a pure soul would really mean a lot. 🙈🤗 Also, I am searching for some good skin care solution and makeup products, thus this will prove to be highly beneficial for me in finding some effective products. 🌸😊💖❤️", "ridhimasethi_01": "Heyyy @sherryshroff when will be winners announced?????!", "neena_nenna": "One amazing thing's here . 😭❤ @__neha__d @sayed_muskan1", "ispita_har": "Sherry di I really want the AA Living Frida cushion cover. Last time I won a giveaway but I gave it to another person as I had told you I'm not a huge make up person. I think I deserve this for being so generous. Please send me the cushion cover na. I'm a huge Frida fan. I love home décor stuffs. And I love you too. 😍😍😍😍😍😍😍😍😍🤗🤗🤗🤗🤗🤗🤗🤗🤗😘😘😘😘😘😘 @sherryshroff", "nirali_doshi98": "Congratulations @sherryshroff 🎉. All rules followed. I would love to win the Benetint or the makeup hamper 😍. Entered the giveaway...tagging @navami.padiyar @krishnachopda @pranmi @nidhimoily", "streetbugavanish": "❤️", "mehtamamta26": "Participated and excited and nervous", "mystic_review24": "I have shared it in the story and followed all the rules.", "martini_roy": "@sherryshroff when will you announce the winners of this contest?? 😻", "rach_x_o": "@sherryshroff Can’t wait for the giveaway 💕", "chetmots": "Have the winners been announced for this @sherryshroff ?", "afreen_siddiqui15": "Sherrry please announce the winner i want to win the makeup hamper soon as my sis is getting married on 25 so it would help us alot", "priyanshishah17": "Awaiting results ❤️", "mrinalimathur": "@sherryshroff are the winners announced of this giveaway?", "thegreen_chandelier": "Thank you for so much ❤️..got the archtype planner set ..they are huge n beautiful too..love you Sherry. Mmmuaaahhh thegreen_chandelier", "kavya_phalachandra": "Congratulations @sherryshroff ❤️! I would love to win either the Estee Lauder or the Clinique hamper! These skin care products would mean the world to me, thanks to the pimple minefield my skin's become 😕 @abhijithb_n glass skin for the win😛. Can't wait!", "ashika_sara": "Congrats sherry 🔥🔥", "denooooooo.__": "Enyering this giveaway for Estee Lauder Hamper @sherryshroff tagging @lochumlo_shitiri @jc_kit123 mention me in the comments and make sure you follow her....thanks love😘 ❤❤ congratulations once again @sherryshroff", "i_am__rekha": "Hey Sherry.. When will this result be out? I requested you on video comment section to choose me for muji aromatic diffuser.. I really love that.. I also checked the same piece here in Delhi. Totally loved it. Being a minimalist, I would love to use that and surely it will add value to my life. .. Thanks for making nice videos. Keep growing. Love you a lot.. . @sherryshroff", "navyatakumar": "congratulations🙌🏻 just watched the Colombo haul today ! Hauls and favourite videos are definitely my favs😍, entered the giveaway a while back. Hoping to win. Lots of love", "kituu_jain": "I wanna win travel neck pillow because my mummy has cervical neck problem so this will be very comforting thing for her while traveling or while we are going somewhere even in the city 😊 @sherryshroff @mujiindia 😘", "tanuja.kr": "Netflix please ❤️❤️❤️❤️❤️", "addyz_world_": "Excited for the Winner announcement @sherryshroff 🥰🥰🥰"}