{"rabia_k9o1": "#asksherry", "mitaleeshukla": "Any vacationing plans this year?! If yes then where do u plan to go?❤🛩🚃", "priya_ananthan": "Have a really absurd qn to ask. When I subscribed to your show, I thought it was going to be all about high end brands/pdts coz you know you are Anaita Shroff's sister; but you turned to be a girl-next-door kinds ---at some level this didnt make sense to me, but this is a quality I absolutely admire of you. Can you please pass on your attitude to some of the girls out there? Its so sad to see ppl think tht carrying a tag brings class.", "hardiparmar07": "Want to the the period in your life when u were modelling and simultaneously studying what was that period like?? Along cause I'm right now in that situation Oni", "antisocial_butterfly_9": "Things you wish you knew before starting a YouTube channel?", "tejaswini_singh": "From where did get ur home furniture??? 😍😍😍 #besthouseTour", "nivsdesai": "Does it feel any different to be married than to be in a regular boyfriend girlfriend kind of relationship? ❤️", "kiran.saleem": "What your father do? Never seen him around your videos,seems strict too. Please tell. #asksherryshroff", "gaurii_": "How different you feel after marriage and before marriage? #asksherry", "dipica.s": "How do u feel staying with ur mother in law...is it same as living with your parents or quite different???#asksherryshroff", "jasminetalwarmaini": "I recently got married too. So I was wandering to ask you how is the feeling to leave your everything behind and moving to a new home.", "cloudy_thoughts9": "How are you soooo amazing in every way?😄 Also how do u deal with negative people?", "whiplash5897": "How to to survive college?", "sherryshroff\nVerified": "Verified", "ananya_singh_8": "Hey, please tell about your career as a lawyer. Are you still into it?", "soumi_ghosh": "Do you think after marriage women should share household expenses with the husband or just leave it on the husband? And take care of her own parent's expenses instead? And what would you like to do? And I love you @sherryshroff and love love love @vaibhav.talwar and you together. You are my most favourite couple :) lots of love from Kolkata 😃 ❤", "ishtpreetkaur_": "Which country would you like to visit next?", "tanzila_rizwan": "Hey sherry! I just want to ask when are you guys coming to Kolkata? I am so eagerly waiting for that day. Love you both soooooooooo much.😘😘😘😘🙈🙈💕💕💕", "meet0011": "✌", "iiankitaroyii": "#asksherry", "sanam._t": "what are your plans for the future? ❤️ ily", "__potatoooo___": "What do you think till what age are you gonna live? 🙈", "aayushi_bhat": "What do u do to maintain yourself and your colour?", "karkeraditi": "What is your favee color😙😘✌💕", "vinayamapelkar": "Where do you live now?", "anjali_brnwl": "Can I have ur autograph plz......", "aparna_walia": "I love the way you look at vaibhav in between ur videos.. what do think at that time..????? I interpret as if you take time out in between your videos and feel how blessed you are to have him! P.S. you won't admit it even if I am ryt I know.. @sherryshroff", "appyfied": "@sherryshroff how is your married life different from bachelor life?", "suhani_1204": "Hey sherry dii I am 14 yrs old and i absolutely love ur videos!!!!! And i love watching friends ,I wanted to ask u who is ur favourite FRIENDS character", "sachi.04k": "What is 2+2 ? 😎😇#Asksherry", "yodalovesmini": "Hey does your mil live with you?", "sonali96arora": "Want to know more about your other sister Roxanne!", "gold_silver_123_": "Where did you get your belly pierced? And how was the experience? Any advice on doing it..", "aastha.sehgal": "Hey Sherry ! Could you tell us some of the little things that have changed after marriage ? :)", "kity_kaju": "Which software you use for editing video?", "_arshiiiii_": "What is your dream destination?? Have you already been there? or waiting for the perfect time?", "shweta_borgaonkar": "Do you get any credit if we save the video offline?", "colloquially.naisha": "if u had only 2 lifejackets with u and one is for yourself who would u give the other one to if vaibhav,anaita and ur parents are there? #asksherry", "darshnanegandhi": "Which F.R.I.E.N.D.S. Character you like the most and why #Asksherry @sherryshroff", "simran6398": "What would you tell all the girls in their eighteens?? About career and life???!", "poojasureshchavan": "What kept u motivated and focused in your life to achieve this moments #Asksherry", "mahek36": "What was the best moment during the marriage?", "burg2001": "Wat do u feel is the difference between being single and married?", "stepheni1203": "Were you a virgin before marriage#asksherry", "dikshajhaaa": "Where is your new house? Any plans for another meet and greet?", "noorain226": "Wher is ur new house?", "kaavsv21": "What's ur favorite brand and what did u wish to become when u were in ur childhood?😊 love u so much😍❤ @sherryshroff", "sweetyrashmi": "What is that you miss the most after marriage? @sherryshroff", "lillyismyqt": "Are you gonna change your IG username to \"sherrytalwar\"?", "shwetaagarwal1694": "Best all time wearable nude lipstick shade for dark skin tone girls with dark lips ?? 💋😄💕", "asthagupta197": "We know that you shoot, edit and do all of the stuff on your own .. but do you eventually plan on having people to do all this for you and having a team or is it always going to be a one man army ??", "shweta_1480": "How do you feel......when u r finally married, shifted to ur new home , accomplishing these goals?????", "aayushi.desai": "How does it feel like to be married ? Has your life changed ? If yes how ? I love you Sherry !! Happy makar sankranti !!!!", "iamshathi": "What is your weight? And height 😅 just want to know 😆#AskSherry", "v_anki": "#asksherry..hows ur new life..not abt ytube.. after marriage...wht r the new changes u r experiencing?", "batra.aakriti7": "Since Vaibhav's mom is living with you guys...do you eventually plan to move your parents in with you guys too? Like a one big happy family?", "jinal_5021": "Hey sherry ! What's your favourite instagram filter ? #asksherry", "riya24_": "If u are stuck on a island what are the 2 things u carry. #asksherry", "rinnulizbeth": "@vishrule Ditto your copy!", "tikoosmriti": "So cute😘😘😘😘😘", "ridhima_00": "How were you as a kid in school? Is it true that you started modelling at the of 16? @sherryshroff", "vanshala_sammi": "Hi sherry I've been watching all your vlogs they are amazing 😘 my question is from where did you get your furnitures for the new house? I just love all your furnitures ❤", "richa_freebee": "Hi sherry! What is best and worst thing about vaibhav? How do you keep your love alive between you and vaibhav even after like 10 years? Thank you☺ love you😘", "nandini_227": "Also I luv your videos very much 😍😊😊", "anmola_0209": "Hi sherry..Your house is just so adorable..I want to ask how has your life changed after the wedding? And what are the pros and cons of getting married?? Love you both😘😘", "chaotically.yours": "#Asksherry would you and dance all night w Vaibhav or eat wedding cake all night w him? Heheh❤", "nikita_hukumatani": "When was your first kiss with a boy?", "sayali._.sayali": "#asksherry can u do all the stuff after marriage which u did before? Like reading novels, watching TV series?😋", "sharithas1030": "Are u planing for kids or u wana take time #asksherry", "riya.ojha": "What qualities do you hate in a person ? @sherryshroff #AskSherry", "swateeshekhawat": "Sherry how's life after marriage...??", "celebrations_by_bhamini": "#AskSherry how has life changed after marriage? Or is it the same? #loveYou", "nandinii.sajeesh": "Sherry can u do your house tour video plzzz @sherryshroff", "sharonmistry": "U went for may queen...then y didnt u try for miss india?? #asksherry", "charu_apan": "Has vaibhav made u compromise anything after marriage ?#Asksherry", "happynupi": "Sherry..your new house looks very beautiful. Did you guys designed it yourself or someone helped?", "sharma_goru": "Hii", "mansimittal4": "Educational qualifications?", "jaaanvi21": "Love ya sherryyy!! How much did u spend on ur wedding?????", "chaahat_jain": "What are the reasons or qualities that made you love vaibhav? And how you people stayed together for so long?", "shivani.gadhiaa": "What is your favourite school memory ? @sherryshroff #AskSherry #awesomesauce", "soulsearcher_pritha": "Is living with your in laws really difficult?", "kanakaaaa_": "@sherryshroff why didn't you put mehendi for your wedding? Even your sister did but the bride didn't... ☹️", "mau_prapti": "What r ur plans now ?", "nilakshigupta1104": "@sherryshroff what was the best thing about the wedding and what was the worst thing?", "debanjanabhattacharyya18": "Hii Sherry!! I love your videos!! They are sooo real! 😃", "inshaa_siddiqui": "If not a YouTuber, what do you think you would have become?", "nihaprasad": "Who wears the pants in the relationship?", "raveenavellore": "@sherryshroff how is hair so voluminous? 😍❤ #AskSherry", "kushamalhotra": "What are the changes that you feel have taken place after the wedding? @sherryshroff #AskSherry", "nidz_shetty_": "Hey sherry u r the only youtuber i hav seen who have managed to look the same throughout the years! I mean u persist having the same size unlike many other youtubers who initially were thin and then after few years started putting on kilos..I still remember u still getting fit into that jeans that u bought when u were 11 years old #closet confidential tag...How do u manage to maintain yourself? & the fact that u are a non- vegeterain, a foodie & a traveller who travels so frequently n still inspite of all these factors u manage being fit makes me more keen to get know the reason ..obviously its not that u r naturally slim or anything..plz lemme know dear😘😘Plzzz i badly want this to get answered plzzz plzzzzz ..lots of luv❤ #AskSherry @sherryshroff", "naina_marwa": "How has ur life changed post marriage ? Share ur experience🤔", "akhilababy_mathew": "How often do you visit your old home n parents? Aren't they missing you ? #asksherry", "bhavya_____10": "What has changed majorly after your wedding? #asksherry", "ishita._.agrawal": "If given a chance to change something about your wedding day Is there something you would like to?", "singh.bhavana": "Hey Sherry... How is your and Vaibhav's relationship dynamics... Do you both argue and disagree a lot or do you have mature conversations about disagreements... Basically how do you both get along as partners.... Lots of love!! 💖", "swathiiii5": "Fav YouTuber", "kavitawakpaijan": "How it feels to get married?", "sejal_karmaran": "@sherryshroff Share a funny incident that happened during/after the wedding. XOXO", "suktinaryal": "You have a sweet tooth or a savoury person ?", "yuvika_fatnani": "What are your travel plans for 2017?", "_vaibhavisingh": "How do you manage your finances after marriage?", "shivaneevbhagwat": "Hi Sherry! How does it feel to be married? Has anything changed?? #asksherry", "_keerthi.sai_": "What's your favourite song?", "megan.slatt": "What is some advice you would give your younger self? And best skincare tips?", "jyosheart": "Your house looks fabulous! Did you decorate it yourself", "sakshidoshi_": "Do you plan on having kids? When? How many?", "mita_lily": "Did you like the video I made for your one month anniversary ? #asksherry", "aneri.shah52": "What was your favourite wedding gift? Who gave it? #asksherry", "shxrvari": "Which is your current favourite book? #asksherry", "preetush": "where did you buy your home antique furniture from? #asksherry", "mrudulakashyup": "How do u organise?? #asksherry", "aur.gupta": "Do you ever want children?", "damnsuhani": "After , you moved out, how DID you feel ? Was it weird to leave your parents and live with vaibhav's mother and him ? Even if you do visit your home often , it might have been difficult, I guess ? #AskSherry", "jubeetta": "What do you most miss about your old home? #AshSherry", "udeernavolety": "Are you planning to tour and visit other places in India ? If so, come to Chennai 💕", "salonidhumal": "pop or country?", "m_y_n_ir": "Can you please let us know from where you shop for home decor? Especially the antique rusty wooden things you have in your new home?", "meeradagar": "Hi Sherry! I hope you give the answer to this Message. How far away is your old home from the new one?? How much time does it take for you to reach your old house from the new one?? #asksherry", "mrinaha": "How are you so pretty? How do you maintain your skin and hair so perfectly?", "sharmistha_m31": "Please help me tell how to manage my skin and hair with reasonable price products??and how often do you thread your eyebrows??", "saharious": "How to even tone your skin ,you face and your body? Vaseline healthy white dsnt help. Hehe", "snehalchhapani": "And I love you @sherryshroff ❤😘", "shivanishanbhag96": "What's the best part about being married ?😄", "rheanayyar02": "Your fav indian blogger ! #asksherry", "devrajnascar": "What Is the Best Thing About getting Married and when Are you guys planning a honeymoon anytime soon? #asksherry ... Thank You For Being The Coolest Indian Youtuber! 😁", "prixaaaaa": "Fitness", "kajalatrey": "How do u feel when u woke up and see vaibhav besides u?😊 and who woke up first?😂", "rajvi_parekh": "Any one thing that did not go the way you wanted it to go on your weddinf", "sharmeen0301": "Will you be planning your honeymoon anytime soon???#asksherry", "jo_joy_jyo": ":'))", "nb_inquisitive_": "What do you like most about your mother in law ???", "norysca": "What is the best personalized gift you can give your boyfriend?", "urvi_raoo": "What do you like the most about your mother in law?", "ankitachopde": "If offered would you do a bollywood movie ?? #AskSherry", "anushka.purohit": "What's one thing that has changed after your marriage??? #AskSherry I love you!!", "meow._.knowsmagic": "When are you coming back to manila? I was in india when you visited philippines. #AskSherry", "swatifuloria": "Do you have a new year resolution. If yes, what is it.", "sachixoxo131": "Any advice for wedding planning?? I am just starting to plan my wedding!! It's so exciting but scary at the same time #asksherry", "rida_u14": "Would you rather Have a foot long nose or a foot long tongue?😊", "gunnikkaa_": "Hi sherry ...... do you know to cook ??? Lysm 😙", "siadayal": "Hii sherry ❤️ how do you keep ur skin so flawless and perfect and acne free even in India where there is so much pollution ?? #AskSherry @sherryshroff", "aditiupreti06": "Hi @sherryshroff why havent u and vaibhav done a hanoi/vietnam vlog.. was really looking forward to seeing ur expriences!!", "asmaajmeri_21": "Also can you do a hair care video", "sajia.tahsin": "have you cooked anything for vaibhav after wedding or vice versa? or have you ordered anything special for each other from outside? 😀", "simtiwari": "@sherryshroff Hey sherry! What are your thoughts behind the decision to add Vaibhav's last name with your name? I'm getting married in March and I feel like by adding another name (which I don't want to do) I'd be acknowledging the patriarchal society and also kind of branding myself. I believe in to each his own but would really like to know your reason :) It might reduce the negativity associated with this in my head 🙈🙈🙈", "vedika_t": "Who cooks now ? You or Vaibhav ? #asksherry @sherryshroff !", "sanjanav28": "Does it feels the same to be with vaibhav After marriage??? Has he or you changed ????? #asksherry @sherryshroff", "takiar.kanika": "Is marriage a happy thing? #asksherry", "nehawanikar": "If you were an animal which one would you be @sherryshroff", "i.sagaracharya": "Are you planning for a baby soon? If yes would you youtube those personal moments as a family?", "clothes_accessories101": "Are there any changes in your skin after marriage? I heard that it starts to glow!", "muskaaaaaaaaaaan": "After marriage what are the topics you both have an argument on? Is it easy to calm a person down when you love under the same roof? #asksherry", "saylee.kir": "from where did you get your vintage furniture <3 it's awesome!!!", "chandni_kukadia": "Who does the housework??? I love you xx #AskSherry", "palakchadha_": "What is your favourite thing about Vaibhav and is living under the roof cool ??? #asksherry", "tejparwani": "Tell us one secret of Vaibhav that no one or a very few close people know! #asksherry p.s you aee one youtuber I look forward to!👍🏻😁", "vani.korepu": "Hey Sherry!! I'm a big fan of U💕..I would like to knw what's ur heigh!! #asksherry", "shik_aaaa": "What do you miss from your parents house and what is the best part of new house?", "jalapeno_2020": "How is your life after marraige? What does it feels to be married? Whats your equation with your mother-in-law", "thetracydsouza\nVerified": "Verified", "okaymallik": "What do you do to keep faith when every reality of your life is lost and you don't have anywhere to turn to and no one to hold on to.", "simranbhatia11": "#AskSherry when are you doing a meet and greet In Chennai.", "sonakshi_rai": "What hair color do you have? Please details", "hisgrace07": "Weirdest gift received in ur wedding...!🙈🍍🍩 # AskSherry", "aparajithaaa": "Biggest pet peeve? #AskSherry", "draotheexplorer": "Can you talk about Inter-religion marriages were the people getting married are not too religious but their families are #AskSherry", "ramneetmann_": "How's married life for u and is there anything u want to change about your wedding ❤ lots of love from London x", "m_a_d_d_y_l_u_v": "Wat do u do wit all the hampers u get as gift like cosmetics & stuff? Do u really use al of tem 😯? #AskSherry", "yashashvii": "@sherryshroff if you could do anything, absolutely anything without any boundaries, anything that requires no qualification or what so ever. Then what would do? Like starting your own fashion label or what?", "shrayeemukherjee": "Do you practice law? #asksherryshroff", "eeshasinghh": "Do you and Vaibhav plan to ever travel together to the North Eastern part of India ? @sherryshroff #AskSherry Sending loads of love from Dibrugarh XOXO", "komalpawar310": "Special Wedding gift?#asksherryshroff", "poojanayak_10": "Do you plan on getting a dog anytime soon? Especially after Simba being such an integral part of your life? If yes, what breed? #AskSherry", "shrutij_": "fav food?", "ishika18m": "Choose one: Rings or bracelets? 💙", "quietgenre": "Name three traditions you're glad to call your own? Also, is there any book that changed ur life? If yes, which one? :)", "bookswordsadda": "@sherryshroff can u tell me abt d places in ur bucket list, places u want to travel and places that u have already travelled...#asksherry", "menang_menuo": "If you were to make a rule for the rapist in india... what would it be?", "the.classy.affair": "How do u feel after getting married 👰and what all the difference u see in your life #Asksherry @sherryshroff and u too gives serious couple goals ❤️😍 Its a treat to see both together @sherryshroff @Vaibhav.talwar", "navyakhurana2010": "When you were about to start YouTube,how did you gather the guts to post one without the fear of being judged?", "angieeferns": "Your Favorite Novel and Author ? #AskSherry", "shradhakrishnani": "What changes have occurred in your life after marriage? @sherryshroff", "smriti.singhr": "One thing or mantra that has made you what you are today ??", "raashimudholkar": "PLEASE tell me what you eat/drink to keep your skin glowing! #AskSherry", "aprameya.ramesh": "What do you feel about people living with their in laws? And do you?", "deeda_96": "@sherryshroff if you were given a choice between ballet-workout and cirque-de-sol workout, what would you choose and why? #asksherry", "pavithrachettiar": "#asksherry please do a video on office wear", "radhika16sharma": "Is there any major difference u felt between ur and viabhav's family.. In terms of different cultures.. Like as punjabis and parsis.. 😊 @sherryshroff", "shraddhakhatavkar": "@sherryshroff have done any treatment for your lazy eye ?", "ketzzz_here": "Hi mam!!!❤What's ur biggest turn 😌on after ur marriage???💯", "evanshika_hotra": "What you do with all the products that are sent by different brands?", "shreyaparashar": "You can choose ONLY ONE, Eyeliner or concealer?", "__seaweedbrain___": "what is your favourite cartoon from 90s? #AskSherry", "karma_lakee": "@sherryshroff y is ur hindi not so good as ur english☺.?(just inquisitive)#Asksherry #qna#youtube#shroffers", "anz.zz": "What is the true definition of love for you ? #askSherry", "anushka_sm": "One thing you could change about your wedding?", "dhvansss": "favourite TV show?", "meameesha": "hi sherry can you do a video on how to get rid of blackheads", "theunconventional_tribal": "How was it to live with Vaibhav? Any new things that you get to know about him? #asksherryshroff", "pallavi02071990": "Any plans for honeymoon ? Where?", "karishmadutt": "Favorite quote", "_deeksha_devi": "Hi Sherry💜 congratulations first of all! So much love to you and Vaibhav 💐 my question is when you first held Zane and Zreh in your hands,how did it feel? :') did you shed a tear or two? Lots of love💜😘 and please upload the entire video of anaita raising a toast..it's absolutely beautiful :')", "vedikav": "Which is ur favorite favorite lip shade?", "_mahikaajain_": "#AskSherry has getting married made a difference in your daily routine ?", "_park_sejal_": "Can u watch one of the kpop songs i recoment u to watch bts blood sweat and tear and wat do u think abt itt", "snackshii": "As someone who's parents aren't too cool about this, I want to know how marrying someone with a different religion is like? (Tell me the good things too). Also did anyone in your family take more time to understand? #asksherry #loveyou @sherryshroff", "keerthireddy_kandi": "Just sum up your feelings after being married @sherryshroff", "extrarpita": "@sherryshroff any random thoughts on life?.", "travelwithgoonj": "Sherry please give tips on how to dress up in winters", "kritika_taya": "Who between u and vaibhav is a better cook? #Asksherry", "infinitequotes12": "Do you think giving second chances to people is a correct thing?", "pallavi.daga": "If you were stranded in an island, what are the 5 things that you cannot live without? #asksherry", "_nabeela.raza_12": "@sherryshroff I just wanna know that how you manage the household things after marriage?? I mean cooking cleaning n your job ?? What's your balancing equation??", "salwa_salman_mulla": "Please tell how did u and vaibhav meet and how you fall in love @sherryshroff", "hey_baig": "How's life after marriage and do you cook and do all the routine stuff that usually bahus do??😜 Btw my name's Haleema Baig! @sherryshroff", "felix_.feliciss": "What's your favorite shopping place??? #asksherry", "priyankaroy9": "Whats the first dish u have cooked in your in-laws place?", "rhea__trivedi": "Favourite jeans brand n whyy?? P.s- vtss is lovee❤️", "cloudy_secret": "@sherryshroff How you maintain to be soooooooo damn cute always??? How your life has changed after marriage? What is the difference between boyfriend VT and husband VT?? 😁 #asksherry", "ramsha.sultan.khan": "One thing you absolutely love in your husband? 💓", "vinaya595": "If you could change one habit of yours and one of Vaibhav's; what would they be?", "yellow2288": "#Asksherry i am aisha baba from mumbai (colaba ) . You are so adorable sherry. I love you more after meeting you recently ! :). My question is could you tell us the 3 best things your husband did for you after marriage? 😄💛😍 @sherryshroff", "_nikhitha.26_": "I wanna Noe de secret behind Ur succesful relation..I too have 1..N I wanna make my relation too as succesful as urs..@sherryshroff can u plz gimme some tips bout a healthy relationship?!😬", "anushkaaaa.02": "Where is your next travel destination?#asksherry", "rooni_begum": "Hehe.. Cutie😘😘", "s2t_09": "Hey sherry as we all know dat u both r big tym foodies and we love to c ur traveling and food related vlogs too ...infact we love every thing about u both 😊...... so my question is plz suggest what to order in big chill (delhi).?", "its.scchandana": "Any big change in ur routine or life after marriage :D", "_dramatickle.error_": "The worst and the best decision of your life till now..#AskSherry", "harshamelwani": "#Asksherry congratulations on your wedding..!! Jus wanted to ask when you guys are planning for kids..!!??", "sangeeta_sahaay": "💖💖💖💖💖💖💖", "siddhishedge96": "What was the last movie u watched?", "irhtayag": "Who would you thank the most for and in your wedding #asksherry", "nishthaaa_": "Favourite movies of 2016?", "aishwarya_cr7": "Y is Vaibhav so cute?How did he call in love with you,where did u guys meet?Y'all are goals manh😭😭😭❤", "samayita27": "Hows is it managing the daily house chores after marriage?", "artutopia123": "What's your favourite song right now? #AskSherry", "the_un_stoppable": "Hey sherry Congo for ur wedding u r the best couple l have ever seen . I am 15years old and l want to start using makeup is it ok or else l need to still need to wait for wearing makeup .I am a bit confused on this. Is it ok for my skin or not . #asksherry", "monika_srivastava": "Did u get to know of any weird or annoying habit of vaibhav after getting married to him??? Even when u already knw him for so long", "srilakshminair": "Favorite F.R.I.E.N.D? Which is your favourite movie of all time?", "manasichohan": "Couple of days after your wedding, a popular tv actress wore a similar outfit (wedding one) for her wedding reception. What do you have to say to that, given that a bride likes to have her own unique outfit. #AskSherry", "huma_sultana": "What is ur routine? Like do you cook nd do stuff like a proper housemaker?", "rosh_menghani": "How did you both decorate your house???Whose ideas was it???#AskSherry☺", "zee.kay": "#AskSherry Where do you see yourself in 5 years?", "oshin_panda": "When are you guys going to honeymoon?? Will we see any blog videos?😄😄 #AskSherry #shroffer #qna", "_.bougainvillea": "On what topics do you and vaibhav usually fight?", "jahnaviy29": "Where are you travelling to this year?", "paramita__13": "what are the three most important long term relationship advice? #AskSherry", "chaitali_salvi": "#AskSherry will u change u r name in legal documents . I mean u r married now so on legal documents like license, pan card, passport u will be scherezade shroff or scherezade Talwar #just curious nothing much don't take it wrong way", "ritu.sood": "Hey sherry!!! Congratulations to you and vaibhav ...Please suggest best under eye cream and the song grooving in your mind right now", "brillarofficial": "What's different in your relationship after marriage... are there more responsibilities than u thought.. has anything changed? Plus how do u share the expenses... is it like how it generally is like men take up more responsibilities... basically how to do u divide it ... or is it mutual... .. u could do a whole video on this on coupling... how to manage stuff while you're in a relationship or after marriage", "avipsa_rc": "How to start a blog please give some tips? Coz i am thinkng to start.. #AskSherry", "niharika.d": "What's your favourite food and cuisine? #AskSherry", "dom30love": "Can you tell us more about your experience of studying law? And any tips for someone aspiring to be a lawyer? @sherryshroff", "ayusshii_pandey": "I just wanna ask what it takes for a person who is inspired by bloggers and YouTubers and wants to pursue a career in it but knows completely nothing about it so what will you tell such a person probably a student would you please guide me", "chitvann": "What keeps you positive when you're facing difficulties in life or facing some sort of a deadlock.", "m_krushi": "Hey sherry... a very Happy new year and big congratulations for your wedding. You were looking absolutely beautiful. My question is how do you earn on YouTube.??? #AskSherry", "mahiiieee": "Are you fond of nail paints? Currently favorite nail color you would suggest?", "saniya1208": "How do you feel after your marriage? I mean any sort of difference or is it just the same?", "iipavnii": "@sherryshroff # asksherry", "irashi_negi": "@sherryshroff The best part you both have realized after marriage....", "priyadahiya_": "How has life changed after marriage? How is your mother in law?", "harshita_r13": "What makes you keep blogging about different things and how come you thought of starting a YouTube channel plus i love your videos keep it up", "jain_muskan157": "#AskSherry what advice would you like to give to those girls who would want to become a successful model like you ??", "prajakta.13": "Which is your favorite movie?", "confidencewithcontour": "Where are you guys planning to go on your first trip as a married couple ? 😍 #asksherry", "aint_urbabyy": "#asksherry Hey sherry , So I love watching your videos ,vaibhav's video , couplingalong .Recently there was house tour video on coupling ,From where did you guys bought those colored rustic shelves in living room ,they are really so cool yet antique.", "richa_va": "Who forgets to flush after using the 💩!", "theshreyaaaaa": "Best shopping spots in mumbai? #asksherry", "preetishastri": "I liked your house tour but it would have been so nice if you shared from where did you buy all those quirky and antique vintage themed stuff!! Loved it. @sherryshroff - btw u looked lovely on your wedding, many congratulations ❤️", "prakruti.shah": "What is the most important thing you feel is needed to become good at something? You are a multi talented, what made you stick blogging?", "beloved1050": "#asksherrry shorts or long skirts?", "soumya.shende": "Would colour your hair again , they look pretty good rn", "ms_drizzle_fizz": "@sherryshroff What's the one thing you miss about being unmarried? #AskSherry", "pizzawarrior231": "Why did vaibhav change his hairstyle? #shroffer #proudhappyshroffer #asksherry", "tanzil_bawani": "Are we going to see any collab videos in the future? @sherryshroff #asksherry", "sargam.garg": "Do you plan on getting any pets?", "kayal_roy": "How do you introduce yourself to someone who doesn't know what YouTube is?", "anuhya.nature": "Do you work apart from modelling and being a Youtuber?", "seerat_dhir": "How to get rid of dark circles and pimple marks", "rimpatell": "How would you describe your wedding day in one word? #asksherry", "suzyryy33": "Hi👧 Why did Vaibhav have such a drastic haircut right after the marraige? Was it some sort of bet/joke that you guys had in your early dating days? Did the two of you have a bet that if you both will ever get married he will do this?", "hennaadvani_": "What are ur plans for the coming years?", "vmswiftie": "#asksherry Do you have any tips for teen fashion? Plz do a video on that @sherryshroff", "karishma_o": "How is your equation with your in-laws?", "thealiferousgirl": "One thing you want to do for your parents and why?😍 #asksherry", "thestyletreat": "#AskSherry hi Sherry, I wanna ask you something which that your sister is a stylist and I wanna be a stylist too can u pleaseeeeeee tell how to become a stylist, and is it important to join a college in India or abroad to become a stylist and how can I get internship opportunities under your sister or in any Magazine ?", "anjaliepaul": "@sherryshroff What keeps you going as a Youtuber?", "isha_arora_701": "What are the best things to do in Mumbai?🙈 #asksherry", "aryaaa_d_": "Hi Sherry how do u maintain yourself ? U r so beautiful !! ❤️❤️❤️", "shresthasingh": "what r the pros n cons being a famous fashion blogger ? #asksherry", "aprajitanegi_": "#AskSherry who gets up first in the morning and cooks breakfast?", "_sagarikak": "What changes have you seen in yourself after the marriage? #AskSherry", "srishtisingla99": "Is there any change in life you feel after marriage....Love you alott😍❤❤", "nehasingh_2222": "Hii Sherry! I would like to know your age. 🐒", "cherryysharmaa": "How it feels like to be married?? #asksherry", "amritaaaa__": "Hey Sheryy .... what are your educational qualifications? Congratulations to you and Vaibhav!! I love you guys a lot! ♡♡ #AskSherry #qna @sherryshroff", "_sejal13_": "Does it feel any different ..Being a girlfriend then a fiance n now a wife?? How has Ur life changed n how do u feel about it?? #asksherry", "suvechchhya": "@sherryshroff Is there anything that you miss about your single-hood? :) I love you VTSS", "_drishtiw_": "What are the changes you have made in ur lifestyle or routine after marriage? #AskSherry", "13_geetika": "How does it feel to marry the love of your life and has anything changed after marriage?", "mayuri._s": "If u r given 1000 rs nd asked to buy 1 thing for u and 1 for vaibhav wat wud it be @sherryshroff", "tayyebafatima": "What's the best part of being married? Love u and vaibhav ❤", "jessikagoel14": "When will you shoot your solo video in your new house??", "jasmine._kaur": "Hie sherry it's been wonderful following you and looking at all your videos all this while . My question was when did you realise that you wanted to get into fashion and travelling and what made you so passionate?", "kaku._.s": "Every time theres a #asksherry post, i forget all my ques 😂", "sneh_joy": "Can we expect a travel vlog in few months time considering that you and Vaibhav might travel as newly weds? 😃#AskSherry", "varsha_venkat": "Are u both fighting anytime for anything after ur marriage ? Cuz myself and my husband were not fighting that much were we were boy frnd gal frnd but after marriage we had many fyts for the first two years of married life🙈", "adi.anjaani": "You prefer lookinh different or just wearing whatever you like?", "docalak": "Would u ever be friend of ur fan? Friends ? 😘😘", "weirdoooo_18": "Have u done any makeup course ? Why did u choose dis as ur carrer ?", "chand_in": "@sherryshroff What do u do with the empty bottles of the products that u use ? #AskSherry", "sans_shh": "@sherryshroff Is there anything you really want to accomplish in 2017? Like learning a language, or visiting a new place?", "pranitadhikary": "Any different things you seen after marriage with your husband", "saniyaamoree": "How is it like to live in your new home with vaibhav! #AskSherry", "_.goodvibesonlyy_": "Tell about Your First meeting with @vaibhav.talwar ? #AskSherry", "komalbahal": "Why don't you drive ? #asksherry", "ms.snehim": "#AskSherry Hi beautiful! How has your life changed after marriage? What is the best and the worst part? Also, would you please keep making more haul videos? I love them!! Love you so much!! Bye ❤", "malvimisra": "How is it living with you MIL? Are you both close as well since you've been with vaibhav for so long.", "prerana_ys": "@sherryshroff : Do you like Vaibhav the husband more or Vaibhav the boyfriend more? 😀😘 #AskSherry #qna", "saanvi_komarla_": "#asksherry if you guys fight how is the one who apologizes? How do resolve your problems?", "ruchi_mehta013": "Which habit of vaibhav do u find to be mst annoying? #Askshery 😂", "tvishasethi": "Hey sherry! I rly wanted to ask you what is smthg of yours that you will miss from your earlier house since i know you've recently shifted. Could be material💕💕", "tripti_chugh": "If you go out on a date do vaibhav check out other girls? #asksherry", "manjushree_205": "@sherryshroff First like by me", "radhikachemburkarrr": "How is your life after marriage? #asksherry", "sxkshi13": "Could you like my posts?", "salvigupta16": "Are u expecting a baby?or this is something to be delayed?", "shreyusingh18": "I love u", "iamsampriti": "Haha....too cute", "anshikadixit___": "How to be happy...when you are facing lots of difficulties again and again .. 😤", "saanyaxavier": "How has marriage affected your life #asksherry", "carol24d": "Your fav dress code like Indian western or else n fav makeup brand", "a.n.v.e.e": "Which is the darkest black eyeliner? #asksherry"}