{"asmitas11": "Who's most likely to have better dance moves?", "asmaajmeri_21": "Who is most likely to chaet on a diet ??!!!", "sunidilicious": "Who's most likely to write a best seller ?", "khan_umaiya96": "Who is most likely to have weird phobias?", "swarnimaaa": "Who's most likely to initiate after fights?", "jeshwamehta": "Who's most likely to forget birthdays?", "ajuniisinghh": "Who's most likely to throw things in anger?", "25deepi": "Who's most likely to say sorry first after the big fight? 👀", "bhoom._.ika": "How is more likely to drop their phone in the pot?", "vampire_tanisha": "Who is most likely to wake up whole night and watch Netflix???? Plz give me a shoutout if u answer this question 🙏🏻🤞🏻🙏🏻🤞🏻", "chitvann": "Who is most likely to stop the car frequently to pee on a road trip?", "90.s_maiden": "Who's most likely to start a fight? 😉", "gunnikkaa_": "Who's most likely to wake up early??", "anoushkamehta33": "Who's more likely to say something romantic after a fight", "ishtpreetkaur_": "@sherryshroff who's more likely to take longer to reply..luv ur videos sherry❤️️", "sherryshroff\nVerified": "Verified", "mrinaha": "Who's most likely to win a swimming championship?", "twisted_pia": "Who's most likely to plan a surprise for the other?", "aditii_22": "Whos more likely to through a surprise party or surprise vacation?", "fathimatanisha": "Who's more likely to fart in public 😂", "priyadahiya_": "Who's most likely to save more?", "kusumdhalia": "Who's most likely to get irritated first with slow internet?", "authentic_dreamcatchers": "Hello ma'am pls check dm", "foodconversations": "Whose most likely to watch a game of thrones episode alone?", "enufdrama": "Who's most likely to come up with a new idea for a you tube video? 😁", "kavyamanektala": "Who is most likely to fail a maths test?😂", "neyhabatra": "Who's most likely to snor while sleeping?", "mehrjulka": "Who is most likely to do a crazy dare in public??? Ps.love you guys so much 💗💗💗💕💕💗💗💗", "myshavats": "@sherryshroff Lose temper", "aektadagaa": "Whos more likely to do imitations.", "ananya.maloo": "Who is most likely to be on time ? #coupling who is", "ritubhoite": "Who is moat likely to finish a whole cake/pizza by themselves", "pranita.jp": "Who is more likely to get fat when dey grow old??", "m.ridhima": "Excitedddd....Waiting fr it😁😁😁 Post marrige whose likelyy tooo😉😉", "faziabatool": "Oho yha ques pooch rahh hai @marfa.batool", "marfa.batool": "Who's most likely to say sorry first", "zainab.abdin": "Hi sherry di😀....it's my humble request please don't cut ur hair now.... U used to look so gud in long hair..... Pls di....fulfil ur shroffers wish😭😘😘😘😘❤️❤️", "abhyudaybohra": "Most likely to have an argument @sherryshroff", "_kita_j": "Who is most likely to cancel the plan or holiday!??", "nikita_hukumatani": "Who's most likely to fight more?", "_xnoushkx_": "I'm most likely to my dad", "benz990": "Who is most likely To be More messy... 😛😋..? #coupling #mostlikelyto #sherryvaibhav 💕😘", "muskan__madaan": "Who is more likely to give surprises?", "shreyargupta": "Who's more likely to cry while watching an emotional movie? ❤", "itsananyaarao": "who is most likely to spend all their money on something stupid #coupling #mostlikelyto", "books_netflix_burgers": "Who is most likely to pee frequently?", "mehaa1190": "Who is most likely to wake up late?", "ms__zacharia": "who is mostly likely to fall asleep in the middle of a serious conversation?????", "shresthasingh": "who is most likely to keep fast for a day(not eat anything throughout the day) ?", "bhavna28": "Who is more likely to eat a large pizza all by herself/himself??? @sherryshroff @couplingalong", "simrnbhalla": "Who is most likely to to get irritated first???@sherryshroff @couplingalong", "_shravanib": "@sherryshroff @vaibhav.talwar Most likely to keep the house clean?", "chintala.harshini": "Who is most likely to be clumsy? @sherryshroff", "garima_tintin": "Who's most likely to get angry easily", "anmola_0209": "Who is most likely to eat away all the mangoes this season?", "_ektayadav_": "Who is most likely to get into arguments @sherryshroff or @vaibhab.talwar..", "muskaaaaaaaaaaan": "Who is most likely to initiate a fight? @sherryshroff @couplingalong @vaibhav.talwar", "manognagottipati": "Now that you guys are married, who is most likely to flaunt the \"i am married\" tag?", "teawannabread": "Who is more likely to get jealous ?", "shikhathakur2196": "Who is more likely to be kam kharchila??????", "_bhoomigupta_": "Who is more likely to get injured?", "thatscorpiofemale": "Who's most likely to fall ill?", "iamneha_g": "Whoz most lkely 2 cribble?", "kumbhatchasvi": "Who is most likely to get in a argument", "thealiferousgirl": "Who's most likely to plan a date?😻 @sherryshroff", "shritipatil": "Who's most likely to be stinge spending money", "soul_beautician": "Who is more like to shop, get drunk, do belly dance ,eat ! 😂😂😂😂😂😂✌", "sanarizvijadhwani": "Who's most likely to fart in public??? 😛😛🙈🙈", "prakruti.shah": "Who is most likely to suprise with unexpected gifts? @sherryshroff or @vaibhav.talwar", "t.a.maliha": "Who is most likely to be honest when it comes to complimenting/critising the other one? 😂 love you guys ❤️ #couplingalong", "_rashiiiiii_": "Who is most likely to snore???!!!", "sheena_apur": "Who's most likely to become cranky when they're older?", "ayushii__yadav": "Who is most likely to have weird phobias? @sherryshroff", "sparsh274": "Likey to fart the most", "mad_hura": "Who's most likely to pass out drunk?", "preeti__khanal": "Who is more likely to travel new places @sherryshroff @couplingalong", "sharonjerome_": "Who is most likely to be possesive ? @sherryshroff @couplingalong @vaibhav.talwar", "emerald_princess29": "Who's most likely to splurge money on unecessary thing?", "tasneem166": "Who is most likely to manavofy the other person after a fight", "khushboo_panjwani_": "Who likely have a hilarious sense of humor 😄😅", "its.scchandana": "Who is most likely to be miser and love kids more 😊", "serebutterchickencurry": "Most likely to get a lot of tattoos.?", "i.vidhibaid": "who's most likely to go on a solo trip!? @sherryshroff", "anxrudh": "Who is more likely to buy an Android phone?", "hritikkaa_6": "Who’s most likely to….Forget birthdays!! 😜❤@sherryshroff", "anjaliyadav5203": "Who is most likely to get jealous/possessive ?", "swethapushpanathan": "Cry watching movies?", "daisyanthonyinsta": "Who's most likely to make up after a fight no matter who is wrong? 😬", "pooja_agwl": "Who's most likely to get possessive", "tavleen1109": "Who is more likely to get jealous \\ possessive?", "anaayashah_": "Who is Most likely to eat a fries & pizza over the best gourmet meal ?", "thatssosonali": "Who's most likely to make random plans ?", "vinny.kaurr": "Who is more likely to do the house chores??? @coupling", "raghavi.krishnan": "Who is most likely to start an argument and then later on loose it?", "shashwat_gautam7": "Who is more likely to be good with children", "raizada_saumya": "Who is more likely to sleep while watching a movie?", "nishthaaa_": "Get grey hair first", "shainamarwaha": "Who is most likely to get jealous or possessive about the other half.@couplingalong", "disha_soni99": "Who is more likely to argue in spite being wrong.", "anushkaa_kumar": "Who's more likely to turn into a typical husband / wife?", "yowomaniya": "Who is more likely to have a fashion sense?", "jumanaa36": "Who's more likely to hog the bed?", "kashishhaggarwal": "Who's most likely to shop more", "long_hair.do_care": "Who's most likely to react over negative comments? @vaibhav.talwar", "ishikaagupta_": "Who's more likely to wake up late in the morning?", "upsiii_17": "Who is more likely to go bankrupt faster?", "raveenavellore": "Who's most likely to eat a LOT of food?😃 @coupling @sherryshroff @vaibhav.talwar", "laraabara_": "Pay the bills??? @vaibhav.talwar", "kairavi_bajaj": "Most likely to dance on a Bollywood song!!", "saily_k_": "who's most likely to stalk someone's profile on social media??", "ruchilulla": "Who's most likely to get up early in the morning", "vaishvi_30": "Who is more likely to freak out in awkward situations???", "saksharora": "Who's more likely to stay without having to shower for a week", "mouni_gangula": "1)Who's most likely to forget birthday or anniversaries? and 2)Who's most likely to be hungry 24/7?😂", "priyanka.toprani": "I got 3-4 who is most likely to's. Here they goo...1.who is most likely to have the most piercings? 2. Who is more likely to appear on a reality show? 3. Who is most likely to pass out on a flight ?4. Who is most likely to go on for 3 days without showering?", "tanishabagade": "Who's most likely to steal a part of the bed @sherryshroff or @vaibhav.talvar. ?", "saniya1208": "Who is more likely to watch a hindi movie", "arshia_banduni": "Who mostly throws up a tantrum about stuff?", "7.richa": "Who's most likely to flaunt his her dress all the time", "prettylilmakers": "Who is most likely to get a tattoo of the other's name? 😂", "kaurajahnvi": "Who's more likely to fart 💨", "avniiij": "Who's more likely to socialise more with family?", "drunkstonedstupid": "hell yeah", "dulcet6": "Who's most likely to be star struck if you guys meet your favourite celebrity?", "mitaleeshukla": "Who's most likely to say something embarrassing and then regret?😬😬", "whiskeyshiskey": "Who is more likely to shout at the other one for not doing dishes/laundry? @sherryshroff @vaibhav.talwar", "rashmeet.banga": "Who's more likely to want to have babiea first?", "chaotically.yours": "Who is most likely to suffer from the foot in the mouth disease?😂", "raashimudholkar": "Who's most likely to give all their money to charity?", "uttarahahaha": "Who is more likely to forget about things often @sherryshroff @vaibhav.talwar", "umang.14": "Who is most likely to come up with creative ideas?", "simran6398": "Who is most likely to not take a shower for a week????? 😂😂😂😂😂 who is most likely to spend all their money on something stupid???!😂😂😂😂 #mostlikelyto @sherryshroff @vaibhav.talwar", "shaileeshah93": "Loose things ...", "ddivaa07": "Who's more likely to stay at home and chill OR go out and have fun?", "kothari.aditi": "Who's most likely to adopt a pet?", "damnsuhani": "Who's most likely to act dumb in public 🔥", "im_bb31": "Who is most likely to initiate romance 😃😃 #mostlikelyto @sherryshroff @vaibhav.talwar @couplingalong", "komal_kawale": "Who's most likely to be Punctual for every meet or occasion?", "nehal_koradia": "Who is more likely to comb hair frequently?", "tanishka_k": "Who's most likely to be good in Maths", "dimplemahyavanshi": "Who is most likely to cry while watchng movie??? 😛😅😅", "ashwarya_chadha": "Who's most likely to get angry?", "shivamijaiswal": "@sherryshroff who takes a lot of time when shopping?", "piscean_27": "Who's most likely to apologize first @sherryshroff @vaibhav.talwar", "crazy_varsha": "Who's most likely to plan an amazing holiday?", "niks.prabhu": "Start a fight. Or get tired first during a trip or trek. Or be late to a meetin or event", "diana.g.fernandes": "@sherryshroff Who is most likely to initiate romance? Sorry for being so nosy 👃🏼.", "munira.mb": "Who agrees it was their mistake willingly and who agrees wid great difficulty😂😂 ???@sherryshroff", "gaurav_kadam1": "Most likely to sleep first? @vaibhav.talwar @sherryshroff", "lekha_ashok_reddy": "Who's most likely to laugh at the wrong moment?", "garimamotwani": "Who is most likely to choose for show to binge watch?", "kedaarr": "3. Whose most likely to say sorry after a fight? 🙈", "_shruti.jadhav_": "Who is most like likely to get hungry anytime???", "batul_vaziri": "Who's most likely to cry in a sad movie??", "aditi_308": "Who's more likely to eat all the ice cream and pretend they don't know anything about it?", "1ditamishra": "Get angry first on a mishap", "valentinie21": "Cry alot", "somya_rawat3": "Who's most likely to fall asleep while watching a movie? 😂😝", "varshalamba": "Who's more likely to forget dates?", "dami.tyagi": "Who's most likely to start an argument?"}