{"darshanaunnikrishnan": "Just came to know about this... Sad to hear... Pls do take care of yourself and be back to good health soon...", "shilpashetty86": "Take care..", "prianca5093": "i had TB back in 2013. it was soo bad but i learn way too much being in bed rest. i started traveling a lot. now most of india i have seen. sometimes illness happns for a reason. its wakeup call to do new things. as u cant do any thing staying at bed. lol. lots of love from guajarat. jaldi sara thai jav di. 😋", "life.of.jigyasa": "Hey u Will be fine. Love and wishes", "andreeredbird": "Not your fault, TB is in all the interesting places and you are an explorer. Good to take extra special care of yourself ❤️", "_angelbedi_": "Speedy speedy recovery to you trooper 🦋", "urmidaga": "More power to you❤️", "tanishaarora9": "Take care ❤️ so much love to you", "deepali_nagar": "Get well soon.😃", "prabha_kulkarni": "Get well soon Sherry! I hope you are well!♥️", "ananasharma": "Get well soon! You're really brave ,more strength and power to you. Loads of love !", "gypsymaal": "Get well soon R.O.C.K.S.T.A.R 🌈", "anjalikir": "Hey Sherry, get well soon ❤️❤️❤️", "pavnigaurangi": "@anaylized see", "sanyakhurana_": "Read Those Pricey Thakur Girls by @anuja.chauhan! Or any of her books, really! 😍😍", "shuhnanabuhnana": "Get well soon babe ❤️", "gulrukh.lindsay": "❤️Get well soon!", "divya.mishra07": "Get well soon dear😊", "rishkaur": "Get well soon sherry!", "triparnamaitra": "We love u... take care!!!", "dt.drishtiparekh": "Takecare lots of strength to you", "shivanginess": "Get well soon @sherryshroff ..🙌", "quotes.as.fuck": "Hope you get well soon. You're really inspiring. Just when you ask god why me? Be happy it's you and not your loved ones😢❤", "_gowthu": "Hope you get well soon.❤️ @sherryshroff", "dimagkashot": "Get well soon!!! Miss you", "amritaoflife": "Sending so much love & healing vibes your way ♥️", "imperfectly._.reckless": "Get well soon!!! Make positivity your tool😇😘😘😘", "brindanagarajan": "Hey @sherryshroff I have been exactly where you are about 10 years ago and I know it really sucks to be diagnosed with TB. I was all of 20 and bam got to know my lungs were drowning in their own fluid and I was immediately put on a rigorous 9 month antibiotic course; it sort of completely derailed my plans for the future, but here I am still thriving and happy. Nevertheless, Stay strong and kick mycobacteriums ass. Also please stick to your course of meds and take your time to heal physically, emotionally and mentally and we will be back to seeing you as your chirpy self on our screen in the not so distant future! Lots of love and sending positive vibes❣️🤗🤗", "woman_wonders": "Hope you get well soon🙏🏻", "thevoguefrosting": "Get well soon Sherry!", "salonimaathur": "Get well soon Sweetest ❤️", "mrinalinichandra\nVerified": "Verified", "srilekha_uppalapati": "Get well soon sherry ji!! God bless u!!", "margastnel_911": "Get well soon 😘", "mr.deepest.soul": "Take care baby girl! 🌟", "vmswiftie": "❤️ Take care Shez, health should always be put first 😘", "khandelwal_anchal": "Take care, come back soon 😘", "blossom532": "Get well soon Sherry!!❤️", "thelemongrasssalon": "Get well soon 💐", "ishitabbhatt6": "Hey you are going to be absolutely fine more power to you ❤️", "meghasharmaz": "Get well soon Sherry. Recommendations watch You and New season of Grace and Frankie is back!! Take care. Feel better!", "hollowheart1119": "get well soon sherry ...love you", "sejalkumar1195\nVerified": "Verified", "rashmiadlakha": "Get well soon Sherry.💝💝", "kachhink": "Get well soon💞", "snehach_36": "Get well soon sherry", "himanshibathla": "Well just read that, I recently saw this series called forever on Amazon prime. I was really touched so may be you'd like it. Also to boost up that positivity I've been reading life's amazing secrets by gaur gopal das. Would help you aa well😊❤️ take care. Get some red roses for yourself today🌹 sending all the love❤️😘", "mruddula": "Get well soon Sherry ❤️", "cathsibs": "❤️", "ashwini.laxman": "Sherry take care & get well soon😘", "drish101": "Hi Sherry, do take care of yourself and get well asap! We love you and miss you dearly. You are in our prayers and best wishes ⭐❤️", "sackofstyles": "Get well soon Btw have u and Vaibhav broke up??", "quirkypostcards": "Sending you loads of positivity and good vibes.... Get well soon Sherry 💗", "mahreenmeow": "Dont worry or stress urself love, you will be fine!", "ashalatajhankar": "We love you sweetie... Please get well soon", "larissa_wlc\nVerified": "Verified", "sunaina_kunnawar": "Get well soon Sherry, all our good wishes and prayers are with you 🤗❤️", "kritikakulshrestha": "Get well soon Sherry! Loads of love, wishes and hugs.", "abhilasha_kulkarni": "Miss watching your videos. But there's nothing that i want more than your recovery! Get well soon sherry. 😘😘😘😘❤️❤️❤️❤️❤️", "sangeetakumar": "Get well soon beautiful!xx", "sherryshroff\nVerified": "Verified", "kanchanmalasengupta": "Ohhh gooddd!!! Wish you a speedy recovery. Even if you get back to work please don't overload yourself ❤", "payal.kshatriya12": "Sending a lot a 🤗 prayers for your speedy recovery and I am sure you will rebuttal very soon with more strength 😀", "mehjabinhaq": "Speedy recovery. Get well soon", "karnika_singh": "Take care Sherry..😘", "yamil_bug": "Are you pregnant?", "sohinisinha.ss": "Get well soon Sherry , we all are there with you & for you . Lots of love .... 💗 @ sherryshroff", "styleinsense": "Shit. 😭 Wish to see you back ! Get well soon 🙌 and it's quite shocking since you're super healthy. Take rest and care, it will get better ❤️", "angada5": "Get well soon, Sherry🔥", "princessvids": "Sherry please take care & get well soon! 💕", "astha_khimesara": "I wish you get well very very soon. I love you sherry💜💜😊", "millymoitra": "Omg girl get well soon. You'll be in my prayers 🙏🙏", "hriddhi_k": "Get well soon Sherry!❤️🤗", "witty_writer_malika": "Get well soon. With you always. You are an inspiration. I love you.", "bruisedpassports\nVerified": "Verified", "namrata.agrawal": "Get well soon Sherry...", "tinazkapadia": "Get well soon. 😃", "optimismrocks": "Get well Soon Sherry!!! ♥️♥️♥️ You're amazing , you got this , take extra care and take meds properly!", "shivani_v_07": "Get well soon sherry , even though we miss u too much & terribly here i know u will get thru This. You are a fighter , you always have been and i wish you nothing but love, and a steady health. Miss u come back soonish and healthier and stronger. Love ya❤️ You are our awesome sauce !", "nilanjaana": "Take good care of your health Sherry. U r the one who has always given me Internet show ideas, and am waiting. so girlie you better get better soon and come back with a banggg !!!!!", "kulfigram": "Omg . May you Get well soon!! . Prayers your wayy...", "roshnichopra\nVerified": "Verified", "adira_dutta": "OMG take care, sending you loads of love", "sulakchana_kalita": "I was missing your blogs... was continously checking... if you have uploaded something... get well soon:.!!", "nehashoppy": "Get well soon sherry.was wondering why you didn’t post any video🙁", "komaljoshi239": "Get well soon!", "nivirka": "Get Well Soon !!! Power to you", "nandinidanani": "Get well soon sherry..u are strong lady so far..will wait for ur amazing vlog", "ayessamohapatra": "Get well soon Sherry ❤️😊", "sanjukta_acharya": "@anushmita 😐", "aakankshachiplunkar": "Get well soon, Sherry. 😇", "hyggelig_girl_28": "Take care of yourself 😍Have a speedy recovery", "rizutiwari": "Take care. Get well soon.", "mansi_pharswan": "💝💝", "samriddhi_srijan": "Get well soon Sherry ❣ Sending all the positivity and love your way 💕💕💕💕💕", "msmakeupaddict_official": "\"Hey Guys\" is just enough to give that much amount of positivity in us!!! You are such a blessing my love!!!Hope you get well soon, take good care of yourself, come back with a bang!!! I guess you can use this beautiful time to take care of yourself, have some me time 🕒, maybe give a break to all the forms of social media activity😇😇😇love you loadzzzz.....", "ritiindia": "You’ve got this! 🌺", "sadia1784": "Get well soon....u can get over it", "ckklqwe": "Check out @dushkaamateur post, read captions, she is a wonderful writer and popular quoran", "iamthe_poem": "Get well soon😊 Waiting for your videos eagerly😊", "aparjotsingh": "Hey @sherryshroff I am a Pulmonologist (MD Pulmonary Medicine) working in one of the premier institute in Delhi!! So, if u feel lyk discussing any thing regarding Ur illness in respect to diet and medicine.. feel free to DM me.. GET WELL SOON.. B in high spirits!! #goodvibesonly", "baljotbenipal": "Get well soon sherry. And watch Mirzapur if you like that kind of content", "madhavikarthikeyan3712": "Get well soon sherry!!! We want to see u much more healthier.. stay strong", "sizzling_saggitarius": "Get well soon ❤️", "poshpride": "Hope u get better soon 💕💖", "nehaghose": "India is endemic for TB, but the good news is that it's completely treatable with good compliance to medications. Take care!!", "drmaithili22": "Hey take it easy on yourself..😘. Ur positivity is & will be your strength... Just eat right healthy, take medicines properly... Ul bounce back to the healthy you very soon", "cnaaaa_re_": "Take care Sherry . Hope you get well soon ❤️", "sonireena": "Get well soon @sherryshroff", "kulkarniishani": "Get well soon Sherry!", "karishma3441": "I too had TB ...", "shrutisekar": "Plenty of fruits and healthy veggies, meds on time and a whole lot of rest. My mother had TB a few years ago and all of the above did her body and mind well. Try to destress as much as you can. Helps rebuild the body's immunity, Sherry.", "zarnapala": "Get well soon Sherry💐💐", "gayathriram14": "Wishing you a speedy recovery.", "superprincessjo\nVerified": "Verified", "prithaaa9976": "Get well soon @sherryshroff love you 💕", "priyankaa.anand": "You're a strong lady. This too shall pass. 🤗", "saasbahurasoi": "Get well soon", "roxanekhodaiji": "Wishing you Gods speed for your complete recovery 🙏", "bhumika_raikwar": "Take care of yourself 😘", "smarterthanyouraveragedesi": "I know how that feels , took a day off yesterday myself ,couldnt even get out of the bed lets hope it gets better now 😢💜💞", "khusi_routray": "Get well soon 😙😙", "ashotanshroff": "Waiting to HUG YOU", "palden": "Get better and make sure to complete your course of meds!", "dipsgoswami": "Get well soon Sherry...", "dimplepdave": "Get well soon dear", "sharayuail": "I loved 'Derry Girls' on netflix. Its light and so funny", "mystical_enchantress": "Omg...Please get well soon Sherry...Fit and Fine...(*lots of love)", "karzomkyi": "Get well soon ❤❤❤❤", "natashachib": "Get well soon!!", "candid_scribbler": "Get well soon sherry. It’s just a phase and you will come out stronger than ever.🙏🏼", "yaanooshh": "Get well soon💜"}