{"satya_sheety": "How did u guys met and who proposed first", "anushka0619": "Have you ever had those emotional airport departures?", "anushreya99": "U guys have known each other for 10 years now. How have things changed between when you first met and when you got married!?????? P.S. love you two... Such. Cute couple....💜💜💜💜💜", "kaurajahnvi": "Your favorite coupling video?", "riya.arora": "#ASKVTSS Sherry: which is the most punjabiest thing you have done after meeting vaibhav ? And Vaibhav: which is the most parsi thing you have done after meeting sherry?", "anushkaisnutz_": "What are the things changed in ur lyf after marrying him", "ishaaa02": "What keeps you both going so strong? #AskVTSS @sherryshroff @vaibhav.talwar", "cloudy_thoughts9": "Daily routine??😘😍😍", "__sampurna.biswas__": "Friends or Riverdale??", "manognagottipati": "Vaibhav-the husband or vaibhav-the boyfriend? Similarly Sherry-the girlfriend or Sherry-the wifey? Although you guys don't have much of a choice now :p", "hardikamishra": "Bahubali 2 dekhi??😂😂", "aakriti2804": "#ASKVTSS How do each of you make up after a fight?", "chinmayee_04": "Your next holiday destination", "samairaaaaa._": "Who is more miser and who is more spendthrift ? @sherryshroff @vaibhav.talwar #AskVTSS", "anjalinatani_": "what do you like the most about being a youtuber?", "preetisingh717": "Who is likely to be more close to the other...he as:- boyfriend or husband, she as girlfriend or wife...😋😋🤗😚", "rumpi_ytt": "Give us some hint about your honeymoon destinations 😘", "sherryshroff\nVerified": "Verified", "nikitamenghaniiiii10": "What is your daily routine like??(in short) #askVTSS@sherryshroff @vaibhav.talwar ....xoxo♥♥", "shrutichintalapudi": "Who wears the pants in your relationship?", "lamwamlam": "What's one thing you strictly disagree upon ?", "jingleway___": "@sherryshroff #vtss sherry can you lift vaibhav!??", "shinjinisengupta": "@sherryshroff favourite tv show to watch together?", "rose.aggarwal": "What do you guys love n hate bout each other the most? 😋😋😋", "aswini_ramesh": "@sherryshroff have you both had any major life shocks? If so, what have you learnt about yourself (includes both vibhav and you) , each other,and ur relationship??", "samayita27": "#AskVTSS @sherryshroff When are you guys planning for an extravagant honeymoon?", "jyotiprabha_sahoo": "How often u guys fight?? Do u guys drag it till morning?? Or Raat gayi baat gayi 😀", "sampiigrover": "#AskVTSS Things you like the most about getting married and living together than just living together like in a relationship....... has getting married changed you're relationship or is it the same .....p.s Love you both soooooo much", "nainakatoch007": "Travel back to past or see your future", "priya_n_ka__": "What is the mostly reason for ur fifht", "shwetaagarwal1694": "Hey @vaibhav and @sherryshroff I love u both a lot and met you guys once you guys make such a lovely couple God bless you both!!! Xoxo 😇☺️😘😘💓💓 So here is my question Whats your quick healthy tips to stay fit and to have amazing healthy looking glowing skin just like yours guys??", "pragati187": "R u planning for new house?? #ASKVTSS", "be.colorfool": "How are your regular days like ?", "neela.naik": "Wat is your respective OCD? 🙋", "anjaliii_mehta": "@sherryshroff @vaibhav", "stuck.up.bagel": "How did you guys meet and how do you convince him to follow and participate in all your diy videos?because most men refuse to do any of this as it makes them look feminine. You are damn lucky * touch wood* truck loads of love for you guys❤❤🌵", "vaibhasharma0290": "What are your current favourite shows? Please suggest any nice mystery showsss 🙈 love you two ❤ #askvtss", "mypvtaccount99": "Who is more dominating?", "sim17_8_88": "I wanted to know what ur future plans are like 15 years down the line ..As u cant continue as a model or fashion blogger when u r above 40.", "krew_tikka": "When will you visit Malaysia?", "not_nitika": "Who is more dominating and moody? #askvtss ❤", "sssoman_18": "Where do you stay? #AskVTSS", "viniee_gangwani": "Which is your common favourite food anytime? #askvtss", "malhotrashourya": "How do you guys manage to sort out any fight? #Askvtss", "laya_ekkirala": "Did you guys discover anything new post wedding?? #Askvtss", "vasudhamudgal": "Does Vaibhav pamper you like a kid?", "vidisha_ramani": "#AskVTSS as mr and mrs tell me one habit of your partner which make u boil with anger..?", "shinjini2105": "WHAT WILL YOU CALL YOUR FIRST BORN? #askvtss", "mahek_inamdar": "Di how are u both so cute 😍 ps-ly u both 😘 @sherryshroff #askvtss", "charumalik22": "One thing that Vaibhav loves to do and you don't and vice versa. #askvtss", "harsha.sachdeva13": "Who is your latest crush, vaibhav? #askvtss", "aashi__varshney": "Who earns more you or vaibhav?", "ettika": "Fun!", "soumi_ghosh": "First of all what is this pic??? Looks bizarre..", "sayani__sinha": "Vaibhav.. if u hd a chance of marryin sum1 else odr dan sherry... dn who wud dat be.. same ques to u sherry!!😃😃", "aruna_yerramsetty": "Who proposed first....?", "jyoti_jakharia": "Is there anything new you learned about each other after getting married, even after knowing each other since ages? It can be minimal thing also. :D", "ksarovar": "Question to both.. education qualification?", "ramya2220": "Will u buy a pet ? #vtss", "asfiyaskng": "What do u think is better- married life or bachelor life", "mom_does_makeup_": "How do you guys make time for each other? #askvtss", "findingdimple": "Hey @sherryshroff @vaibhav.talwar 🙋 I'm madly in love with your channel 💗.. Loveee the crazy stuff u both do together in your vids 😂..#FavoriteYoutubers 😌 // #AskVTSS What's the craziest thing u both have ever done together ? #EagerlyWaitingForANewViddo", "aniketa19": "How do you find all these challenges that you do? Like research from where?", "tanishkjuneja": "#AskVTSS HEY sherry and vaibhav, which is the most romantic memory for you guys. ❤ love you", "annanya_23": "How is sherry n her mom in law going together #AskVTSS", "itsdhvani": "#askVTSS Date night with Vaibhav Over Netflix?????????", "manasa_chintalapati": "#AskVTSS Any one thing you guys got to know about each other post wedding will be?....💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟 love you guys!", "vaaridhibagrodia": "What are your top 3 date night restaurants in Mumbai?", "anushree_poddar": "For Vaibhav- Do you see any changes in Sherry post marraige? For Sherry- Do you see any changes in Vaibhav post marriage?", "anshujainofficial": "Has anything changed professionally after marriage ??", "piya_94": "Have you both ever had trust issues especially during long distance? If yes how did you over come it?", "retina_here": "Would you rather lose all your vedios or all your subscribers??? #Askvtss @sherryshroff @vaibhav.talwar", "batra.aakriti7": "How do you make up after a fight? Do you do anything special?", "shruti.a.joshi": "#askvtss any rule or ritual u follow to keep d spark of ur relation going..lots of lov.!!", "avkohl": "#askvtss there are so many memes about women being indecisive with regard to food, do you guys ever face that problem where either of you can't decide and the other wants to smash his head on the steering wheel? And how do you solve it", "mim_an_sha": "Generally who talks first, after a fight? You or Vaibhav?", "snehalsolat77": "Tell us About ur future trips in these years", "mississippi2804": "Are you both mastikhor couple or boring couple @sherryshroff @vaibhav.talwar #askvtss", "nevidakhadpe": "You guys are together for close to 12 years now... What is that keept you going??", "vijaiprerna": "Who manages the finances of the house ? #askvtss @sherryshroff @vaibhav.talwar", "spam_13245": "What is the best part about being married?", "the_dream_queen": "You guys have been together for so long. What made you decide that this was the point to get married? P.S: V you have been putting up some really good videos on your acting workshops/ journey. ✌ Love and sunshine to you both ❤🌻", "monicaachantani": "How long your fight lasts? 😋 And for how long was the longest one 😅", "sakshinsta1603": "What you guys admire the most about each other?", "sarika_joshi": "Who is the prankster in the relationship? 😋😋", "thatssosonali": "What's better - Married or Unmarried ? Did you guys ever had a tiny miny breakup for a while ?", "sizzling_saggitarius": "#AskVTSS when are you going to plan a baby 😍", "juhikamal": "@sherryshroff how do you react when seeing Vaibhav's work in films in the past ? For example love break up zindagi is one of my fav films and seeing Vaibhav so uptight in it was kinda hilarious to me . So thinking how you react ?", "mithu_121_": "What qualities u like about each other???#askvtss", "xsumedhax": "What was your first impression of each other?", "jainnisha": "The crazy two 🤗.... When and what was your first fight about & how did you make up????", "kathyayini_m": "how u ppl met n tell us ur dating story 😁", "samitaaa.15": "How did u tell ur parents about ur relationship", "ankitha_sathya": "Are you both pet lovers? And if yes do u plan to buy one?", "foreverragini": "#AskVTSS Your favourite memory of your partner?", "nishtha.vermaa": "#askvtss since you guys have been together for a while so what is your most memorable moment so far ?", "priyanga5749": "Wow.... u both ve good outfit 😉😝😜", "charmi_shah27": "#askvtss who is more lazy and sleepyhead?", "lakshitaaaxpvt": "Would you sell your both YouTube channel for one billion dollars?😂", "vijay_simha99": "Is there fart comfort between u guys? ?(-:", "anatummyoffood": "Marriage yes. But what keeps it going?", "love.ruhi": "#askvtss what all has changed after marriage..as in habits, tastes,thinking,emotions etc. You both are adorable😙", "simran.rajanee": "When did you tell your parents about your relationship?? Were they cool about it?", "tanzila_rizwan": "@sherryshroff @vaibhav.talwar I hope you guys come to Calcutta soon. Sending love from Calcutta. #comesoonplease", "ishikajain": "Hi. You look great together and are one of my favourite YouTubers. 😅 I know that Parsi laws and rules are pretty strict. I've heard that when a parsi girl marries someone from another community, she ceases to be a Parsi. Is it like that after your marriage? P.S. not saying that you are no more a parsi or anything, just curious to know about your community and your life related to this😀✌️", "mahreenmeow": "How did ur wedding impact both of ur lives? Don't u both miss having ur bedrooms all to urself and not sharing with each other ?", "aiswaryaav_aishu": "When did ur parents come to know abt ur relationship ! Wat was there initial reaction ?😃 Question to both !", "_ayeshasingh": "How different is it to be married than to be single ?", "shaleen.sarvar": "what do u guys like most abt youtube , n how is it better than other jobs u hv / had", "piyush_1296": "#AskVTSS Is YouTube your only source of earning?", "simrann97": "Do you play fun games like treasure hunt?", "_nom_nom_chomp_": "Do u fight ?", "emmygeminious": "Do ull feel offended by each other on the basis of (fame,money & status)", "anishadixit\nVerified": "Verified", "prachi_shah7": "Since both of you have siblings and have been married before you'll. Is there any quality or things you have seen in their marriage that you wanted to or want to inculcate in your marriage ? @sherryshroff @vaibhav.talwar #AskVTSS", "ishita_jain24": "You parents in law support you both fully for you tube videos?", "greeshma_maleficient": "#AskVTSS Are there couples you look up to, what do you respect about their marriages? #vtss", "shrizans": "Hilarious 😂😂", "anshuminz_": "#askVTSS the most adorable moment shared by you both ?", "paridhi8desai": "Who knows to speak more languages and which all??", "serebutterchickencurry": "What's your PET PEEVE about each other? ❤🌸 #AskVTSS", "raufa184": "#askVTSS any song that you guyz would like to dedicate each other ?", "mehabanaudha": "Who farts more...vt or ss? .😂", "littlemiss_sunshiny": "If you had to live in one city outside India for the rest of your lives which city would that be?!", "siya_panandikar": "#askvtss how did u guys meet?", "allauddin_asma": "Who does the house work? N who makes d bed?", "prachigupta1609": "@sherryshroff What marriage advice(before marriage) someone has given you which you thought is funny and won't be needed but later on after marriage realised \"Yayyeeee! Dude it actually works\"?", "annora666": "What is your age and weight", "reetsrituals": "What about soul mates? Do they really exists? What if am unable to find mine. I am horrified of arrange marriages. Please help #askvtss #vtss", "dianapinto_x": "What's the weirdest or most embarrassing thing u guy have done as a couple? #askvtss", "dristiwadhawan_": "Were your parents always supportive of your relationship?", "shalabhaa": "Have you guys found a disgusting habit of each other yet? Also, who does the most work in the house. Much love 💝", "namrata_107": "Has Vaibhav learned Gujarati?", "cloudy_secret": "Such a cool pic 😬😍👌", "ashleenrandhawa_": "What has changed between the both of you after getting married?", "makeupbymonikaa__": "Have you ever asked vaibhav to sleep in the other room after a fight??🤣🤣", "anandi321": "Tell us something you are guilty about", "sisodia.singh.saumya": "What is the one thing that you love and hate about your respective in-laws? 😄", "sharonmistry": "Tell vaibhav to tell u something in Gujarati....😂😂", "_simrankulkarni": "What has changed after the marriage..@sherryshroff #askvtss", "ojusvini.agarwal": "Would you both rather give up travelling or give up shopping? 😁😂 P.S. You both are couple goals ❤️ #askvtss", "bhagyahegde5": "Where are you planning to go on your minimoon next....loads of love .stay blessed.", "_ektayadav_": "Who is more dominating...?", "srishtidurga": "How is it like living with your mum in law?", "hemanshi0411": "What is one thing that make you fall in love with each other all over again?", "zorico13": "When are you having your Honeymoon? Where? Do you still feel the same feelings after marriage or some how its change? Is marriage a good or bad than you've expected #AskVTSS #vtss", "kairavi_bajaj": "What are your valentine's day goals??!!!", "swara_shettigar": "On what topics do you fight over now? Have they changed after marriage?", "notsuzann": "Which is the best memory you'll had together??", "priyanka.kolla": "What would you give up youtube or travelling?", "pavnigaurangi": "@sherryshroff who does the cooking?", "jatin_tanwar": "Will you ever meet and greet in Delhi?Or when?", "aroratanya01": "What has been the best trip you guys took together?", "leyasusanvarkey": "Which was your best time ever of being together??😀😀🤔🤔", "thesmalltownblogger": "Hey There! I have a \"relationship\" question for you to answer. What do you think are those things that you guys can't do now after getting married and staying together? I know every relationship is a solid building made of compromise and understanding. There are times when I think maybe I will loose my freedom! So yeah, back to the question - What are those things you don't do now?", "isayalimali": "Hello VTSS, this question is for Vaibhav and just for fun.. No OFFENSE.. Did you ever experienced being a \"Joru ka Gulam😂😂😂😂\" atleast once when and how and even if you havent why.. Share with us😀 TIA 💜", "anjaliepaul": "@sherryshroff What do you guys call each other for fun?", "vrunda_vachhani": "How did you guys first meet?", "nehawanikar": "If you had to associate a character from any tv show with each other which one would it be @sherryshroff #askvtss", "smithss_life": "Who does more shopping vaibhav or Sherry #ask_vtss", "labyrinthofdreams": "Did anything change after marriage between both of you? #askvtss", "exuberant.kanika": "One thing you both hate about one another and one you love! #askvtss ss", "anam_elyas_": "Whose the master of the house ? Or who takes the final call .? How do you manage your house so beautifully with such a busy schedule ..", "adesitrotting": "Inter religion marriage : how do you plan to give the best of both worlds (Zoroastrianism and Hinduism) to your kids? @sherryshroff", "shikhathakur2196": "Is vaibhav is a possesive type or husby or nt??? Did he ever scolded u ......when & why #askvtss", "makeupandhairby_parularora": "What you guys do if any of you have bad days...#AskVTSS", "laraabara_": "Who pays more bills on dates @sherryshroff", "anz.zz": "What kinda Tv shows you watch together??", "snehaagarwal__": "Who starts fighting .. Who wins and who lose...", "dhwanisanghvi1": "Where do you guys see or want coupling to be 10 years down the line!? #askVTSS", "_aniiii28": "What language do you'll speak at home? #askVTSS", "mohitgadgil": "Who takes more time to dress up??", "smridhimarwah": "I was thinking about this since a long time, You both don't cook so do you guys eat out everyday?or order meals from outside?or have a cook? *very random* #AskVTSS", "_shanteeeeee": "How do you both relax yourselves after a really busy day at work? #AskVTSS", "ikritis": "By what names do you call each other as in any funny or cheezy names? #askvtss You too make a perfect couple 👌🏻😘😍", "tashu14": "How did you guys met ?", "nehal_koradia": "What is that one thing you both dislike in each other?#AskVTSS", "watertweetie": "I love you both a lot.. For what reasons you fight the most ?? And who apologizes first ??", "utkarsha.it.is": "What do you guys like to do in your free time!!🦋", "aashanarealme": "Which is your favourite sushi restaurant #askvtss", "kritibardia": "How did you make the ootd t-shirts?? Please share", "kinali_mehta": "When you guys were dating how did u manage the expenses as in for food?? Did u guys split or was it the same old ' a guy has to pay'. ?? @sherryshroff ... I have seen that u guys said that Vaibhav gets angry faster.. what do u do when he gets angry .. how do u stay calm??", "maitrimehta910": "#askvttss When will u both going honeymoon ? Which places in Ur mind ?", "sayantim": "😂😂😂😂", "keyashah340": "Would you watch netflix the whole life alone or be together in a scary forest together? #AskVTTSS", "_ramya_13_": "Y didn't u still go to ur honeymoon!?? Was just wondering Luv u both!!😍😘#askVTSS", "palakbandelkar___": "How did you both manage long distance ??? Ps: the way sherry looks at vaibhav when he is talking is the cutest thing ever 😍❤. #askVTSS", "medhavi_a_patel": "Firstly I would like to say that the two of you are seriously #couplegoals❤ !! And my question is, Sherry although I know you don't cook but have you cooked anything for vaibhav after the wedding and if yes, vaibhav, how was it ? Honest answer please 😋 #AskVTSS #vtss", "anahkhann": "Any new secrets you got to know about each other after your marriage? #AskVTTSS", "anoushka.jolly": "I love you channel and you guyssssss😍😍😍😍😍😍😍🌬😍😍😍😍😍😍😍😍😍😍😍😍👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻👻🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈 SO TELL ME THAT WHO MAKES FUSS FOR FOOD MORE AND WHO LIKES HOME FOOD MORE OR OUTSIDE FOOD MORE ??"}