{"dsen997": "Y don't u do travelling videos except coupling videos? Do u follow karaannate? N one more .. Y vaibhav had blocked me?😂😂", "shivanjani_singh": "When u r coming back in ur old look? The long hair one 😍", "tanzila_rizwan": "Apke bimari k dino me wo kaun si 3 cheeze hai jo apko sabse zyada motivated rakhi? What are the 3 things that made you motivated during your sickness?", "happiness_is_here___": "When will you do coupling videos ...i loved them ..btw ur videos are amazing do more vlogs 😊☺😘", "khyatianand": "Why don’t you do a video with your sister Roxanne", "the_jabberwocky_": "What are all the languages you can speak?", "mscrazy_yashu": "#AskSherry 1 when are you going to challenge vaibhav for beat it on coupling really miss those videos ...", "sonalikalakra3": "Hi sherry. I know you swear by Estee Lauder night repair serum. But it's too expensive for me. Can you suggest a cheaper yet effective alternate for wrinkles and pigmentation?", "sajia.tahsin": "who is better photographer amongst you two?", "shreya_mohta": "Top 5 places in Mumbai to feel “Mumbai”❤️", "akshatakulkarni_": "How to overcome low self esteem? Loads of love to you ❤️", "karishma3441": "What is #awesomesauce", "deesmileo1": "#asksherry apki teesri behen k baare mai btaye", "booktacles": "How did u build your stamina for a such long runs? I know it must be consistency but what motivated you to keep going and build your stamina?", "bangtanandpoetry": "Do you think your popularity as a YouTuber has reduced?", "ishitashukla2810": "Beautiful picture dear.😘😘", "trinizzleswafizzle": "Wow she looks like Freddie Mercury here.", "16__smg": "@vrutantshroff : you guys not only share the surname..but the looks too😎", "sunshi_nish2009": "Ab tabyat kaisi hai? Apni Sejay k bare me bataye?", "urjaaagarwal": "#Asksherry when are you gonna have kids? 😂", "sujatharavishankar23": "When are you guys planning to have a baby ?? Love your coupling vlogs ❤️", "mharshita95": "@sherryshroff kya aap running and jogging k bare mein hume aur guide kar sakti hai? Ur past videos have been very helpful and motivating.", "damanic_sreya": "What advice you have for people in their (early) 20s?", "brightorangecola": "1. What's your most embarrassing memory from school. 2. Is there any phase in your life that you'd wanna go back to/look forward to? 3. How do you deal with failures.", "libasindia": "1. Favourite summer outfit - Indian and western 2. Skin care routine ... we know you were born with it but still", "sachiiiparekh": "Hi !How long have you been a blogger and a youtuber ? And what are your further plans?", "jeeyayadav": "A novel that changed your way of thinking.", "kritika1595": "Your fav. cuss word in hindi? 😝", "laxmi.m20": "Not really a question but i genuinely feel like organic content like yours is not being appreciated these days with youtube becoming more and more money and sponsorship based.. youtube was so much better 5 years back. I wanted to ask you if this demotivates you or makes you want to become more competitive and keep up with the kind of content thats being produced these days?", "vanshikadvn": "Aapki glowing skin khoobsurti ka raaz?", "saloni_jain_cc": "What is the definition of career for you @sherryshroff", "jannat_stha": "Where is your favourite place/ store to shop??", "amiablecreator": "how you dont get influenced by other creators", "dollupwithyashika": "Babiesssssss 🙈🙈🙈🙈", "aayoushe7": "The question is in Hindi too - Kya ap kabhi kisi aur sheher mein lambe samay rehna chahoge? (Would you like to live in some place other than Mumbai? If yes, where and for how long? )", "shradhakrishnani": "Which was the last HINDI movie/show you watched?as you only watch english movies and shows...😁", "mihishka_negi": "Other income source.", "pradnyadiwan": "#AskSherry do you speak in hindi when you go to the famous brand stores in India? If not then why?", "shatobhisha_7": "Sherry who does grocery shopping at your home and who decides what to eat and when to- Aapke ghar kya bnega khane me aur kb bnega ye kaun taye krta aur uske liye bazzar se samagri kaun lene jata?", "raks2richezz": "Hey Sherry! Came across ur name somewhere on YouTube and then started watching your vlogs about 2 weeks back.. and must tell you that you are of the nicest persons and so positive and full of joy and I have watched almost all of your videos in your channel..keep it going girl! Ur just too awesome! ❤️😊", "shumz._.stypayhorlikson": "What does Vaibhav mean to you?", "akratibajpai": "Kya hum mil sakte h lunch dinner ...as I m following you from do many years it feels you my friend .. I want to just have coffee conversation with you", "vad__ab": "Try talking in telugu!!!😋", "ansh_1108": "How do you cope up with migraine? What are your tips n tricks you do.", "kripalecious": "How hard is it to stay to your roots in this big competitive influential world.", "shivani.gadhiaa": "vaibhav ke saath aapki sabse pasandidaar aur anubhavi chutti ke baare mein batayi yee @sherryshroff", "jasminetalwarmaini": "What lifestyle change you made after you got out of the disease ? And would suggest people to make it anyway for betterment.", "sayalikolge": "You’ve lived in Bombay your whole life, why is your regional language so bad? Why do you have an accent?", "shambhavi9": "@sherryshroff aap ne video edit ka naya tarika apnaya hai kya?", "_tamannaa._": "How to handle yourself when you are feeling low and get irritated about everything around....", "apoorvi_b": "How do you stay so true to your content and not get influenced by the current trend that's going on Among influencers?", "lennymathew": "I love how simple and elegant you are. I wonder what is your goal in life, what motivates you", "anjaliladdha16": "What is your biggest fear?? @sherryshroff #asksherry", "rita_rejuvenates": "Sherry tell me something about vaiibhav we dnt know", "sssoman_18": "When we will get to see your team?? You alone do your videos so perfectly but videos will be much much better when you will have your own team, and also you will get little more time for yourself🎈 #shrofferforlife💕", "suemeeeeeeeee": "What do you think about SOOO MANYY youtubers popping up these days? Does it affect your content/ follower base?", "disha_kapadia": "Describe your morning routine in Hindi 😂😂😂😂😂", "t_a_n_y_a_a_r_o_r_a": "Have you achieved your dreams that u always wanted to regarding life?Does life goes the way we always dreamed of? . Need motivation. Please do answer #iLookupToyou ❣️", "ishitabbhatt6": "Do you feel that despite the constant hustle and such good content, you are not as appreciated as the other youtubers?", "emmygeminious": "How u maintain ua relationship so well with vaibhav , has there been any huge fights for 2-3 day?", "meeradagar": "Describe your YouTube journey in Hindi 😂❤️", "aashi_mehta23": "Please tell us 1 thing each that u love , hate & tolerate about Vaibhav @sherryshroff", "swami_97": "Hey Sherry!!! Why don't you grow long hairs ya? Not that you look any less beautiful in short hai. Just asking 😊 you're the best!!!", "sumayya_ys": "Could you suggest affordable scented candles to gift someone ?", "becjurnis": "If you ever want to tell Vaibhav some secret in front of others, do you use a different language or how do you tell him?", "divya.2506": "Haha omg it’s gonna be so much fun in hindi !!😂 so my question is if you could be someone else for a day, who would it be and why?? Btw love you so much❤️", "pallabi18": "Sherry . Which youtuber do you follow the most....", "evil_little_thing__": "What are the 5 things that you are scared of right now???", "sukanya10das": "Are you driving full fledge in the streets of mumbai now? 🤪", "shre.yal": "I really wanted you to win the cosmopolitan award,but never the less there’s always next time. So just wanted to ask do you have any strategy or plan to win any other awards in future???", "iqrakhushnood": "ur looks are pathetic", "piaffee": "एक ऐसा रूम जिसका खिड़की न दरवाजा, बताओ क्या ?", "miss_bundleofjoy": "Sherry u look smart in short hair but still miss u r long hair specially ur big bun do u have any plans of growing it back .?", "promitathakur": "Did you ever have a fan girl moment? Vistaar Mai bataiye please!", "sakshi_garg2794": "How are you now Sherry?", "kaurajahnvi": "What’s the last time you watched a Hindi movie? 😛 #asksherry", "yellowslippers": "What is your guilty pleasure?", "prajujo": "वो एक सबसे बड़ा सबक क्या था , जो बीमारी की वजह से आपको मिला?क्या आपका जिंदगी के तरफ देखने का नजरिया बदल चुका हैं? 🌷", "nidhikandwal1910": "Heyy sherry...plz make a video on your perfume collection.", "_sadhu_sant_": "What is your biggest takeaway from your 2 month sabbatical due to TB ? Has anything changed in you as a person?", "itishreeray": "Aapne aksar bola hai ki aape bahat sare zimeedariya hai toh aap bataye aap unko kaise nibhati kaam k sath aur apke shaadi sudha jeevan ko fo", "anjali_nair124": "Your Favourite Bollywood song and did you dance at your sisters wedding on it? #asksherryshroff", "deek.thadi": "How do a hair brush and a quintessential comb differ? 😋", "bhukkad_bangali": "We've seen Anaita several times on your channel, why not the other sister of yours?", "sha_v_ka": "Everyone is coloring their hair fiery red.. would you like to do it?", "sugandhaduggal": "#Asksherry ➡ what is ur advice to new youtuber who don't have much money to spend but still working hard ➕ what should one do for genuine growth on a insta and youtube because their algo change like a blink of an eye.. Thanks.. Buddy youtuber Sugandha 😘", "vanshika19309": "Sherry. When was ur first kiss", "peachesindia": "Apko barish pasand hain ya Dhoop 😁", "pink_blossom1990": "How do you prioritize and how do you deal with the fear of the unknown ?", "tanvi_chakradeo2810": "What is your educational qualification?", "hira_mon": "Why don't you watch Bollywood movies??", "komaljiofficial": "THIS i NEED to see", "lmurhy": "Did you ever consider acting as a profession", "0786_garimasingh": "Please tell us about ur bracelts , accessories🤗", "footballmg10": "What are you planning to do with your hair next? Will we ever be able to see you sporting the bald Avatar ? 😍🔥", "shvetmishra": "Explain your skincare regime in Hindi! 🙈", "richa_sonowal": "Hello Sherry!!! What is best thing that has ever happened to you?", "mulay.rutuja": "Aapne bataya tha aap 30+ ho.. toh aap itni young kaise dikhti ho?", "diyabandyopadhyay": "Aapke paas kaunsi aisi cheez hai jo sabse mehengi to hai par aapko bilkul pasand nahi aayi...?", "colloquially.naisha": "@sherryshroff have you seen any change in Vaibhav after he got to know about ur t.b", "asmaajmeri_21": "What is your biggest fear?", "shellysuprava": "😍😍", "snehalchhapani": "हिंदी में किसी एक गाने के बोल, जो भी आपको आता हो या पसंद हो वो बताइये। #Asksherry 😁😁😁", "fantacystar14": "How do you manage to stay fit and healthy?", "varundivinity": "Larka hi banja koi kasar chori bhi hain tune larka ban ne me ullu ki patthi gadhi", "sw_pt013": "Hi, i love u, and happy to see u healthy and happy, how u stay positive, wats the secret and how to maintain a positive and healthy relationship, sometimes i really hurt people unintentionally and don't know how to correct it", "mitusomani": "Challenge or story time with Anaita please..", "rishika_bhasin_maken": "I’m sure you have travelled to many cities in india. So which is your most favourite city in India apart from mumbai? “Aapka manpasand sheher kaunsa hai India Mei mumbai ke ilava ? “", "_praptishende17": "Aapne kabhi maharashtrian khana khaya hai? Agar ha to aapko sabse zyada Kya pasand hai ? Aap bahut pyaari hai. ❤", "kruthikaa_03": "Apne kabhi marathi movie dekhi hai? Agar haan toh kaunsi?", "stella1607": "Hi Sherry, good to see you all healthy and fit. Love your content, love you the way you are. And may your positivity touch everyone's heart! Since it's going to be hindi ask sherry session, My question to you is jab aapke aur Vaibhav k beech me jagda hota hai tab ek dusre ko kaise mannate ho? #AskSherry", "neeelvora": "आपको हिंदी में सबसे मुश्किल कौनसा शब्द पता है ?", "sunandanamandal": "Sherry how to look tall and a bit fat for a girl who is very short and thin? Plz share some styling tips", "cosmetic_po": "Please talk a little about tower of scilence!? No disrespect.. just curious what you think about it.", "shradhavjain": "5 qualities of Vaibhav that made u fall in love with him and important while choosing a life partner. Pls do answer this 🙏🏻", "the_pos_vibes": "Sherry aap itna optimistic aur motivated kaise rehte ho??", "shaifalisharmaasr96": "How and when did you come out to your parents about vaibhav and you? Was it scary? 😯", "kritikagoyal13": "Apka pasandida ice cream swad kya hai ? Kya ap ek chocolate person hain ?", "harshi_nandwani": "Which are theTop 3 Fashion streets in Mumbai according to you? #Asksherry", "nainasahney": "Tumhari Sundar twachaa ka raaz kya hai ???", "prishitasingh_": "Since you've lived in bombay all your life, What do you love the most about it? Also, I love you. ❤", "kanchan0730": "For how many days do you think you can survive without meat?", "keyuriarvind": "What do you fear?", "bharat.soni36786": "🌸", "rheactions": "First of all I m glad you are healthy n fit again also I love your smile ... N question is was it scary the disease.. did you feel depressed and that you were never gonna make it out ../?", "sax.2203": "Hi i wanted to ask that when r u planning to have a child? And how is ur health now?", "crazy.aquarian": "Kya aap colgate karte hai? 😂", "priyamehta1069": "What do u do when you don't like what your cook has made and you know restaurant food is not healthy all the time", "mp_prerikha": "Meet and greet in Hyderabad sheryyy !! #shroffer #asksherry @sherryshroff", "thebrightsoull": "💕💕", "amrita.vrao": "#AskSherry how did you feel after sharing you tb story on youtube ? and who is your style icon or inspiration? you are amazing 💕 lots of love @sherryshroff 💕 you inspire me ❤️", "wanderwoman101": "When was last time you got really angry and how do you control your anger😊", "pramodsandra123": "Sherry did you have any plans to grow your hair back long?? Even if the is no its completely ok...just want to know what your plans for your hair....anyway you are very beautiful love you sherry😘😘", "tasneemgadhoke": "What is your relationship with your mother in law like ? How do you handle any sort of unpleasantness or difference of opinion when it comes to her ?.", "ceme_s": "Can you please share the mushroom recipe? #asksherry", "thateclecticone": "Since it's in hindi...I'm gonna try n ask in hindi as well 🙈😂😂 ...aap itni sundar & Dil se pyaari kaise ho? Ok I give up. You're really pretty & also such an energetic person where do you get all the positivity & energy from? 🖤 And also..what was the one thing that you learnt after falling sick? That you would wana tell any1 suffering from any sort of disease? 💪", "salvigupta16": "Which is biggest fear ? Aapka sabse bada darr Kya hai?", "nikita_hukumatani": "what was your major in college?", "parinita_kapoor": "Have you got a video editor?", "itsmeeshaaaa": "Favourite all time top 3 go to designer ?? Totally love you’re content Lots of love 💙💙💙", "itsveehere": "Any shopping tips for a student in the states. Where can I find good and reasonable clothing? Specifically in Boston. Till now h&m is doing good for me. Need more options.", "ruchitadua": "Where do you see yourself in the next 5 years!? Love your new hair colour!", "ishitakapoorr": "Tell us your first period story !!#asksherry", "himanshibathla": "Your favorite childhood memory?", "himanijain16": "What's your favourite brand for watches !! Love you❤️", "onkar.jpg": "When is the next video with zane coming up?", "___sunandinisaha___": "How you can be good to people everytime?", "ojasvi.ozil": "What was your favourite thing about Rishikesh?", "rainbow_butterfly_unicorn": "What would u choose career over relationship or relationship over career not directing it to u.. just a personal thing 😊"}