{"thewomanofwords": "@thekiranpathak Participate ❤️", "hillgirlinthecity": "Bran Stark will sit on the Iron Throne 🧐 @gublootubloodiaries @shaffy16", "ruchitadunung": "All die and only Jon’s and Danny’s child survives to rule the throne! @avichalmisra @sanikatidke", "joelphilip21": "Jon Snow will sit on the throne as he knows nothing. Tyrion will be hand of the King as he drinks and knows thing. Together they both will drink and know everything. #giveawaymumbai #giveawaycontest #got #valarhotstar @hotstarpremium @clintonkarl @prashantsngh47 @glennyboy_cardoza", "shivani_v_07": "@_sagarcasm_ u shud play this", "aaru_gupta18": "Arya Stark will win the Game of Thrones, because A Girl has No Name, but She will have the Iron Throne. #ValarHotstar #HotstarPremium #BeFirstToTheThrone @hotstarpremium", "fatemehmirjalili": "Sansa will be sitting on the throne! Her journey has been quiet, but it’s been the toughest. She’s learned how to play the game from the best players - Cersei and Little Finger... and she’s a force to be reckoned with. Pretty sure she’s going to be Queen soon! @zahra_mirjalili @twinklechhatlani", "jayesh_w": "I can 't help but notice that Gendry has a larger more complex role to play could he infact be the son of Robert and Cersei that \"died\" all those years ago what a bittersweet turn of events to find out that it was Jon and Dany's fate to save the kingdom, but never to rule it. Also i have watched many theories about who should sansa end up with it would be cool if at the end she doesn ' t have a husband and arya ends up married to gendry..It would be iconic that the girl who dreamed to be with,the perfect guy who didn't want any of that found true love. #got #valarhotstar @hotstarpremium @shakir_khan__ @pooja_bijlani", "sonalgarg": "Sansa Stark, my first instinct. The Night King is second @sheetalgoel @renudhk", "smritripathi": "@bini_mishra @snnuhh @suruchi.gupta.9275 beginning of the end.", "jainabhuva": "Gendry or Khaleesi @nehabhuva @vyominihemani", "cxt_96": "@photographiebysagararora", "ritubhoite": "I think Arya Stark will sit on the throne. And she deserves to own the throne. Since episode one she has shown so much bravery and courage to fight against the odds of growing up without her family ... With all the sexism and betrayal that came along her way. She stood up fearless. That woman fears no one. And I cannot wait to see her in this season . ... @omkar_gouda @sansskritiii we have been big fans of game of thrones 😭😭♥️♥️♥️♥️ I hope I win thisss ... @sherryshroff #valarhotstar", "ronitchotlani": "Jon Snow because i think he will be the only original character left alive at the end of season 8. @sa11il_stark @vishal_31", "shivani_sunil": "@jahanvi.gandhi @bless_.this_mess", "mobile_magnet": "Jon and daenereys child will sit on the throne and tyrion will be the hand of the king. Arya will rule winterfell ❤️ @kati_patangg @vivekskarande", "karanvyas11": "It would be Tyrion Lannister as he is the only who has interacted with almost all the big players from thrones since beginning. He would only survive after deadly war. Denny will be killed in war killing knight king . Jon will survive but after showdown he will join ... knights watch ... and retire just has Grand Uncle . Jamie Will kill cerci. Arya will become king of the north ... or lady of winterfell... while Sansa might not survive..battle Of winterfell. Which leaves Tyrion a wise political mind to seat on throne ... while Jamie on his side as hand of the king. And Tyrion will narrate the entire events of game of thrones to master Samwell Tarly . And show was from Samwell’s historic accounts. We might see ... Jon and Danny’s daughter at some unknown place taking care by Missandie ... and she receives Gift Of Few Dragon 🐉 eggs 🥚 and Show ends.", "megha_watchthatswatch": "No one deserves it more than Daenerys Targaryen. I love Samwell Tarly’s character, so brave, loyal and adorable. I wish he’s Grand Maester. @gautammadnani @meghamadnani", "de_knees13": "Probably the knight king at least the aftermath looks like that😂🔥 @jobin_jacob @jonathann.11 @rahul_daund10", "ambareen_khatri": "@mugglewanderbuff @suvaiba_ismail I really hope it's Jon Snow 😍", "tk_1910": "CERSEI LANNISTER", "reviewsbyroshni": "Who will win??? @thenomishasrivastav @_aayu.k", "he11ohe11": "White walker @bassi.harry @gajbir", "smritib22": "😔😔", "prachi_shah7": "Ghost and Nymeria will let all the people in the 7 kingdom know about the knight king, help them to get together so they can kill the army, also distract viserion so that Cersei can kill him and eventually kill her for killing Lady. The great Wall just falls and everybody gets crushed beneath it and dies😏 and there my friend you get the king and the queen of the 7 kingdom the true to the throne❤️ @vatsal_sampat @manoshi_dey 😂🤫", "primanghani92": "@radhika.raheja18", "divyashree98": "@nitya99raj", "quotes.as.fuck": "I think John and Dany will have a child and that child will sit on the iron throne. Cause john and dany both will die fighting the army of the dead😢 @meenal__12 @priya.xox", "priyankaravuri": "@thewomanofwords @tejasmishra", "ersandrafrancisphilip": "@skippin_panda", "tanvidhariwal": "@divya9327 @charulrmehta", "_sass_only": "@semontig", "ranjanachhabria": "GOT has taught us that whatever you think is going to happen is not going to happen and whoever you think will sit on the throne may be the first one to die🗡🗡 so I want to think that the night king will sit on the throne and hopefully the dead die again🔥instead of sitting in the throne😂😂 @roshni_lumiere @yeshadongre", "dipalibhatt": "Arya Stark...along with nymeria..all the way.🔥 She and Night King are anywhich gonna kill everyone. @charmi_gandhi21 @reshma_gandhi3108", "natasha_ambavle": "As much as I would like to go with Aegon Targaryean aka Jon Snow I think it very likely will be Tyrion Lannister with Sansa as his queen. Unlike Jon neither is Tyrion hellbent on being honest and time and again he has proved to be the smartest and deserving contentor in the conquest for the throne @sherryshroff @prashant316 @romana_fernandes @_tanya_sharma @chaugulepankaj @hotstarpremium #ValarHotStar #HotstarPremium", "whatisthisbehaviouramar": "I think nobody would be able to sit on the Iron Throne as it would be destroyed during the season just like it was created (Dragonfire)... And I very highly think Lord Varys❤️will be a very big deal ... @_sejal13_ @sleepy_jacket @radhaa15 @shreyo17", "valenie_lopez_": "@pearldsilva06", "rashikins": "@rishabh_sareen21 so traveling to Mumbai?", "ishaniij": "@ravleensuri", "bhaiiravi_savurr": "@shady_karan @vedi_kaaa", "shilpaawww": "I think Dany should. Jon snow might be the true heir but I have a feeling he'll give it up for the sake of love, th mother of dragons (and his own to-be child). Also he'd rather serve the realm than rule it. He's a gem. @hotstarpremium @akshaytiwari15 @rajatleo @bendang_megha @fitness_withmeg @chubalasharma @shreyadhawan #valarhotstar", "meera2897": "Aegon Targaryean 😍❤️ @gazal.kothari @dhartimamania #ValarHotstar @sherryshroff @hotstarpremium", "vedi_kaaa": "We need em @bhaiiravi_savurr @inspirationdangwani", "gazal_kothari": "@meera2897 @dhartimamania Jon snow.. oops.. i mean Aegon Targarean🤫😋❤️ #valarhotstar", "switching_nah": "ma man Theon Greyjoy who's chilling in the sea is gonna get some mermaids along with Yara and get the party to them white walkers and sit on the throne @aishi.b @lix_tetrax07", "puja594": "When everyone dies only Tony stark will be alive... 😂 @_vira_blast @parmar_bhoomi", "sno_g": "The Night King. Because, sab ko maar dalo! #valarmorghulis 😁 @aral.gonsalves @wilfredgonsalves", "parakh.shah": "Valar Dohaeris - All men must die @nishthamehta_ @pranalirgandhi Sirf Trivedi bach jayega 😎", "swathy_nandakumar": "@sherryshroff Drogon coz he can just burn everyone and take the throne, can’t he 🔥😂", "nourish.sweat.rekindle": "It has GOT to be Arya Stark 😍😍 @siddharthpanikar @sheetal2812", "moumita_kar": "Arya Stark 😄😍 @iaayushi @anjalimarathe_", "helishahhh": "Ned stark will come out of nowhere in the picture and become king and sit on the throne😂 @mariadcunha", "sidetrackedgirl": "Jon Snow, the undead, true amalgamation of fire and ice, is the one true heir of the throne! Its about time that he sits on the iron throne 😊 @sardarni_uk @outlandishmag", "gouravi_t": "Faceless man from the free city of Braavos and Aarya💥 @pragati_dabhi @_mahesh.mane_ ✨", "ratz0303": "A new mysterious night queen and her ice dragon 😍", "kaos_personified": "I think it will be jon snow in all likely hood @aslisona @iyergopal1726", "its_shafali_taralkar": "@sherryshroff @hotstarpremium the night king.", "p.s.idrawyou": "Podrick Payne & Missandei - the wise ones paving their way across seasons 😏 @gargshobhi @ritikad14", "dhanashriib": "@bhaiiravi_savurr @jayana.jain", "meghna_francis": "Gendry Edric Storm. Robert Baratheon's own flesh and blood. Jon Snow knows nothing, Daenarys is gonna go all Mad Queen, Cersei will be killed by one of her brothers, Tyrion is too smart for his own good. @zacs.kitchen @meghnificent_", "the_joyous_times_": "John snow for sure @pranali1169 @dhiraj_gavnang", "preet_sh": "Tyrion Lannister or Arya Stark @curly.hair.one @vyasaditya", "raufa184": "This is soooo exciting. I feel that John Snow would sit on throne 🤗 @minaz.shaikh @amogh_dongre", "mugglewanderbuff": "The night king 😆⭐️ though I really wish its Dany♥️ @shrayeshk @ambareen_khatri", "immortal_dreams26": "Jon snow and dany's daughter..", "hetvi150799": "OMGGGGG! Can’t believe this. It would be a dream come true to attend a GoT screening. As per me, no one is going to sit on the throne, the characters together will fight against the white walkers. The throne will be destructed and dissolved and the material from the throne chair will be used to destroy the white walkers. Because we all know that WINTER HAS ARRIVED!!! ❄️ @hetvshah1999 @impal_99 @ishan2468", "shru_pckb279": "George R R Martin (he's always been the one sitting on the throne right from the beginning.. IT'S HIS THRONE 😉) @anks_thegame @monkwhosoldtheworld @milanmandani @amita_bhoir #giveawaymumbai #giveawaycontest #got #awesomesauce #ValarHotstar #mumbai @hotstarpremium", "blueriband.official": "😍😍", "aditi_vr": "Gendry Baratheon could be the dark horse!! @rutvik14 @pratikchandak", "saggi96": "Girl with no name -Arya Stark 🤘@_gako_ @s.shloka", "rachel_r_almeida": "If I don’t win the coins can I have the box? 😂😂😂 @sherryshroff", "panse44": "Whoever sits on throne, won't be happpy with the way it happened.. My bet on John Snow after killing Danerys for fulfilling a prohpecy.. @akki_bansod @onlyaksha @sakuragirl.24", "storiesbysurabhi": "Lord Varys maybe🤯 @sherryshroff", "its_rachel_green_geller": "John snow or Arya stark 😍😍😍💋💋💋💋 @anishadvani @_iisshhhh_ but my fav is khaleesi😍😍😍 but feel like shes gonna die giving birth to john snows child 😭 just a theory hope it's not true", "sarahsaroshh": "Tyrion Lannister Please 😍 @purnimavasaikar @roash__", "afrakochra": "Jon snow with Daenerys Targaryen @atiyadarbar @nourish.sweat.rekindle", "beyond_reverie": "Jon snow with Daenerys.. @4actsofstory @binny.sharma.123", "jasmita333": "Arya stark @sharyu_page @prasad", "postyanshe": "@aakritimathur1 could you help me and yourself with this????", "_sareenshikalgar": "Arya Stark all the way!💯🔥 @its_akd @chanchalnenwani11", "liza_dutta": "Just for Mumbai😒🤕", "tejas.and.stuff": "I think no one. Because in order to kill the walkers, they will melt the throne. @_v_jas @rdbishop17", "tsundoku__": "The Night King 🔥❄️ @sherryshroff", "priyavish_": "Omg this is really super amazing! Thanks sherry for the chance! I strongly feel jon snow should sit on the throne , as he's the one who literally convinced everyone and by all rights ,(by birth) the throne is his. I'll be be so glad to get those coins 😍 what do y'all think? @shivaninirbhavane @heheheheet", "priya_sreenivas": "@the_other_sreerangam", "anusayap": "Sansa Stark @dsouza_ee @manas_lohani_7", "purnimavasaikar": "Daenerys Targaryen @sarahsaroshh @tamannaisrani", "ferbalicious.13": "Tyrion Lannister @_sakshigoyal__ @vipulgupta2048_", "sumeet818": "The bastard of Ned Stark Jon snow @only1henry @istalriraudhr", "dhvansss": "jon and dany's kid is gonna be on the throne #trueblood", "saily_k_": "Tormund with Brienne as his queen😌 @siddhirmore @prachi___d @tejas_1.0 @rohit_dhokte @shivaniee_d_", "alittlewonderwall": "@sameer_rauthan @traveldevi ♥️😍♥️", "some_ew_story": "It's Jon snow aka aegon targareyn", "kiddiegram": "Sansa Stark will sit on the throne! So far she’s shown most impressive leadership qualities! @afrakochra @rabiazk", "brewyou_vivin": "Arya is the rightful heir to the throne! @ayush025 @go2piyush"}