{"thefashionablefooodie": "Thank you so much @sherryshroff for such an amazing opportunity!!!! I would so love to get my laser treatment done as it’s really painful getting waxing done all time and every time because I’m just 20 days here I’m all hairy again. And I get so conscious if I get little hair also and unfortunately go on using razors which I know is bad. This would really be a great opportunity for anyone to get laser treatment ❤", "aaashkaaa": "I hope to win this sherry!! Lazer is an amazing alternative and I’m already in a middle of the treatment. I don’t like the machine I’m using right now and would like to shift to @therapieclinicindia !! Winning this giveaway will be an amazing chance for me and of great help!! @sherryshroff ❣️❣️ @aashkaaa @mxhxka08", "thenextdeadpoet": "@makeoversbydrashti @drashtimehta_95", "docshreya": "Winners please! @sherryshroff", "shweta_pattnaik": "This is a super awesome chance to go hairfree!! It’s summer and I would love to win these and try laser. @saloni_tripathy @pattnaikasha", "nikksflicks": "I have been taking laser sessions since quite a long time and there is no drastic change as such. I would really like to take laser sessions from @therapieclinicindia and experience their treatment as I have just been disappointed all this time. @parita18 @srushti_96", "manjri_s": "Due to pcod have hormonal imbalance...this would be a great opportunity to try it.. And hoping to find a permanent solution to it. @jewel1910 @poojapanchal1309", "wadhwani_sonal": "Hey.... their is no particular reason but if their is even a slight chance of winning than why not give it a try 🤪🤪 @shreya_03_24 @prachi.sapkale bhai tum log bhi try kar lo", "minakshitamuli5": "Tagging my two friends @ayecoffeejunkie and @kusumikag 🤣", "sayali.mahadik": "Hey sherry, I am a diver and a swimmer based in south mumbai, these sessions would help me to just not care about my body hair anymore and swing that swimming costume on any time. 🐳", "bomb_ae": "@saamiikshaa @___saloni___", "c_pooh07": "Need these sessions in life to flaunt those flawless legs or underarms this summer💞.THERAPIE has one of the best laser hair reduction technology and issurely worth trying.❤️ @komalchohan @kajalchauhan7007", "anmol_12": "@vrushti08", "chaitrali_jadhav17": "This will save a lot of time for us working women from all the hassle of scheduling your waxing appointments weekly, hence winning this will sort my life to the T, & I would later go for other parts too😍🎉@dr.kirtikuber @anuja.naik93 😇 @therapieclinicindia @sherryshroff", "vinitagrawal169": "Hi Sherry! My reaeon is that I have a problem with ingrown hair, so waxing isn't the best way for hair removal! Also wanted to try laser from a very longg time.. what better way than getting it from the best place @therapieclinicindia in town! I really wish to win this give away! Thank you. I'm tagging my friends @donetacohelo @welaughlivelove", "reena.varghese": "Hey sherry........would really like to win it.....as I have undergo laser removal for my hairy birthmark I have in my head.....and where I took it wasn't a proper place to do so......so hopefully along with the giveaway offer.....I could even consult @therapieclinicindia for my birthmark.........and it would help me out......@shriya.agarwal.14 @asmitakanade", "karishma_108": "I had previously tried laser about 8 years back and wasn't very happy with the outcome! I'd love to win this giveaway to give a try once again... Tagging @giribala23 @palakh.dharnidharka", "batra_ridhima": "Hi Sherry, Can i win this please #tryingforadesperatewin", "yaminisandhu": "Omg you have no idea Sherry, how terrified I’m of laser hair removal. But if I get the opportunity, at least i can have that piece of mind that I’m getting it done from a place which you trust. Keeping my fingers crossed!🤞🏻♥️", "aradhitamaheshwari": "Hi Sherry! I'm a medical student almost reaching my final year now. I travel about 3 hours everyday to and from college in addition to completely unpredictable college hours. It becomes too difficult to wax regularly and for that reason I've literally stopped wearing sleeveless. I've been wanting to do laser for my underarms since very long but didn't know the right place to do it. After watching your video about your experience I really hope and wish I can win this giveaway! And on a different note, you were the first YouTuber I ever subscribed to and have always loved you and your amazing content! Always keep making videos for us! ❤️", "_.manasi_ingale._": "I want to try laser hair removal for a really long time. And, here is the opportunity to win it! Also, it is really safe because you have tried it personally.It would be amazing (I guess) @therapieclinicindia. I don't like waxing infact I avoid it. So, the best solution is get hair free with laser technology. I really wanna win this❤ Lots of love to @sherryshroff. Tagging my two friends here - @_apurva1432 @dishaa_deshmukh", "rosanna_717": "I think laser is by far the best solution to all our hairy problems, being an Indian also means being blessed with thick jet black hair that grows back the very next day .... even waxing doesn’t do the trick for me ! Laser is my only saviour .....😔 I was so scared to try this but ur blogs defn helped me get over that fear All I want is soft and smooth legs ❤️ the best part is - it’s for life I will never have to shave again and besides I hate shaving or waxing @thereal_estibeiro @jacquesferns 💋", "karishmapariani": "I’ve recently got married and my husband always calls me a Sindhi bear at the end of month when I’m due for waxing. I have really dark and thick hear and it hurts a lot when I get waxed every month. And I’ve been thinking about laser every since I was in school but never got the chance to. I’m tagging my friends who equally need laser as much as I do cuz we’re hairy Sindhis 😂😂 @anishakhemani @tamanna_pm", "rana__parul": "I should win this coz .... It's in Mumbai n that'll b like a super great opportunity to meet my long distance beau ... Coz u see he's doing his internship n my college is here in Haryana ... So if I wanna go n meet him there .. this will b like..., \"Mom come-on ! I have won this hamper I have to go\" n she'll b like, \"Ok bcha .. ja jeele apni zindagi\" .... So I'll just be paying for the tickets to come n go n I'll be getting my hair removed + meeting my love ! So it's like a sone p suhaga thingi that'll give me n him like a seriously good opportunity to meet up ! Coz in our day to day lives it's like m bogged down by my college course work ... N then planning for a trip is like so cubersome ! BT this will b like now I have to go ... U know what I mean ! I hope I really win this one !!! @shauryagupta14 @i_avantikarana", "krutikapaneertikka": "I want to get rid of the hair on my legs and hands and underarms foreverrrr, because everytime i go to a parlor to get it waxed, i get to listen sooo many tantrums from the parlor wali and I keep arguments with my parlor lady all the time , and crib about me being a girl because i have to go out of my way to get it waxed or shaved etc. My underarms are getting darker bcoz of alI the waxing, would save me the hassle if i have a laser done there. 😛 I also have thought of doing laser for a really long time for the hair on my face (more specifically my upper lips) because i hate threadingggg tooo, but i can't get a laser done because i cant afford it for now. Maybe few years down the line but definitely not now 🤣🤣🤣 wud be grateful if i win 😛 #laserforthewin @falguneeee @__mxxnnsiii__", "badalpepaonhain": "I have always been a hairy kid. Ever since childhood i thought i need a permanent solution to this. I was looking for a long time for good laser clinice. After watching your videos @sherryshroff and getting such honest reviews for @therapieclinicindia i visited the clinic and got myself booked for underarms and lips. As those are the most pain point areas for me. Shraddha was a great consultant. I hope to win this giveaway and also get my legs done. I m getting married in November. It is the best time to feel more confident about myself. Thanks again for yourhonest feedback. It helped me take a step towards laser hair removal. 💓 #lotsoflove💕 #laserhairremoval #hairfree #awesomesauce", "neyotee": "Reason: I'm so fkn done with body hair and waxing and shaving. It's a huge expense and growth is so fast that's it's annoying. And waxing/shaving both leave unnecessary marks on my leg. I can cry omg help pls 😭😭😭 @nandiniagrawal26 @whimsicaldiary", "preksha155": "I wish to win this because waxing is not for all! Through laser removal being hair free is made easier! @kothari_purvi @shaifali_7 @bhmaaheshwari", "pooja_s15": "Wanted to get it done for a while now as it’s a lot easier to run and workout without hairly skin since we sweat so much. A lot more hygienic too so 🤞🏽🤞🏽🤞🏽@inforstyle @garvitagarg @shantanukarnad", "meherzinpithawalla": "Well being a working woman I love keeping my self confidence high. When I go to meetings I always feel that oh I have hair and it just doesn't make you feel the way you should..", "mammu1602": "Lastly @swetavora05 @sapna.vora", "dr.ashyta.31": "Hi! Sherry. Huge fan. I want you to choose me so that I can get rid of my body hair safely. I am 33 year old virgin and may be being hairless, would help me look prettier. Also, I can't really afford an expensive treatment like this coming from a middle class, I'd be glad if you oblige to choose me.", "shazdah": "i really want it done from a long time @neha_siddiqi @zainakhan3912", "mayanglens": "I want to try the laser hair removal to feel clean and later book more sessions at @therapieclinicindia. Thank you @sherryshroff for the extensive video on your laser hair removal thus giving us hope to go ahead and take up sessions for ourselves. I would like to tag my besties and lifelines, @purplemel03 and @dcostamignon to participate in this giveaway themselves. It’s a headache to regularly go for waxing and I would love to get a laser done to get rid of the pain of waxing and fixing appointments for it. If I win this contest, it will be my first win ever! Fingers crossed :)", "misaundarya": "It could be a great experience!coz I no more want to feel like a bear🐻😂", "komkatofficial": "❤️ Thank you so much for this opportunity @sherryshroff 💙 My reason is quite simple... I m quite hairy all over the body 🤣🤣so if i get this laser Treatment @therapieclinicindia I'll have 1 less part to be waxed.... N my 2 friends @deepika_jain22 @bhumikahiran i want them to win bcoz Deepika is married she usually don't get time for waxing so it will b a great @bhumikahiran is about to get MARRIED so this will be BEST BEST @therapieclinicindia Wedding Gft for her💙💙 🤞🤞💥💥", "deepamkakka": "Hii @sherryshroff... laser hair removal is the best thing that happened to us. Who doesn’t like hair free skin!! I am myself undergoing laser and would like to gift this to my daughter!! Hope to win this ❤️ @sherryshroff @therapieclinicindia .. @mxhxka08", "ekta08": "The lasic would help save all the troubles of having to go to the parlour frequently and also boost Confidence! @mitisutaria @mansiturakhia", "aasha_kandyala": "Am a hairy 🐻 who shave n wax every mnth or for every 15days ... spending a lot of 💰...and I believe sherry have got laser treatment in one of the best clinic", "rizvana.k": "Awesome!! Want this because i don’t want to waste any more time,money,energy & precious tears on waxing~plus its pain free & lasts forever ♾ @lishcreative_studio @alinaarsiwala._", "drishbajaj": "@yeshikabatra @ishwarinandgaonkar Reason: my girlfriend has always been very insecure about her hair. She has been teased for having too much hair since her childhood. She also always complaints about the pain when she has to get her hair waxed. She's been wanting to get laser done but hasnt gathered the courage to get one done. I'd love to give this to her", "ojha.niki": "I have always wanted to get rid of the torture of waxing and threading..it gives me anxiety to go to parlour and anticipate the pain. ..i really want to be free of this", "priyamargretsaldanha": "Reason: 1) The ingrowth on my body and the amount of money I spend every month. 2) Probably the only clinic in India I've heard/seen honest and positive feedback on lazer hair removal treatment. 3) I live in Bombay and I'm willing to travel (FYI) - @dipsonatrip @gloriapeterjoseph 👩🏻‍🦱 #hairfree", "saminakurawarwala": "Hhey sherry ...love u n have never won ANY ANY ANY giveaway ... would love to travel to Mumbai for this treatment any time from Udaipur.", "ingrid_xxo": "I really want to win this giveaway because I have very hairy legs and having to shave every so often gets too frustrating. Tired waxing, but it hurts too bad and so I don't end up doing it :( @sadiaslayy @sonia_m_97 fingers crossed!", "tahira_menezes": "Reason - to be able to wear anything, anytime without worrying about visible hair popping out. @ninipinii @desimenezes", "thebighoom": "No more pain, only gain. That’s my reason. @owlsnest20 @juhikothari_", "wormin__": "YUS!! Tbh the reason is that it was a little expensive. I went to @therapieclinicindia last year and wanted to use your discount code in March and even got a trial done but it turned out to be too much. And since I’m still studying it’s a little hard to save up that much money. I also have sensitive skin so I can’t ever wax - it has to be only shaving or laser. And my ideal scenario is to get rid of all the body hair so don’t have to shave every couple of days. Hopefully this will make me reach there slightly faster. A big thank you @sherryshroff for doing stuff like this ❤️ @malhotranisha @sherenchin", "mxhxka08": "I was just going to go for a consultation to the therapie clinic at fort!!! Winning this giveaway would be a pleasure as my birthday is coming and I was planning on doing laser then. @sherryshroff @therapieclinicindia I hope yall make this happen for me 💓❤️ @aaashkaaa", "anaghakulkarni": "Hey, I wanted to try laser for the the longest time but was just so scared. This would be an awesome opportunity get it done from the place where u got it done which makes me feel so safe and I can trust them totally. Tagging my husband @thebhukkadbeardo and my BFF @nomnomnommn", "anushka_bagwe": "Hey Sherry, the idea of getting lasered scares me. But watching your videos made it a little easy. Hair removal for me is really painful even my parlour lady told me to get laser as my skin is sensitive to hair removal. And also a trusted Laser clinic was also an issue. It would be really awesome I get this opportunity to win this treatment. If I like it I will get other parts lasered too with them. Thankyou for hosting this ❤ Tagging:- @tawadeshraddha @n0t_s0_k0mal", "dhwaninanavati_": "I’m tired of constantly having to shave my underarms and legs in the summer, just so that I can wear my fave summer outfits! And I can’t wax because it doesn’t suit my skin well. This laser hair removal will be a boon for me! @zinalkjoshi @akshata.k_", "shreeyabali": "Meeee !!!!! I really want to do this I could use the Lazer treatment for my legs since I am already doing Lazer treatment for my face and my underarms and since I am a student it gets very expensive and at the same time shaving and waxing is too tedious. 🙈🙈. I want to win this so I can finally wear shorts when ever I want without thinking about the tiny hair I have left on my legs 😅😅 and live hassle free 💪💕 #girlpower 💋 @minnkkyx @shivanijaveri @quuixxotic @aryaa.b_27", "_nandiiiniiiii_": "Hey Sherryy..!! Want to use this give way because I have PCOD and have hell lot of hair on my face as well as on my whole body..couldn't miss this chance as I want to have flawless legs and underarms..would lovee to win this..! @jan_takeover and @vrushali_patkar knows the pain of my unwanted hair..😂😂🙈", "commonerstale": "@sherryshroff I want to win this hamper as I really can’t afford laser hair removal right now lol😅 this would surely help ! #beingbrutal 🙈 @sushmavanjani @preyaasoni", "payal.jagwani": "I want this giveaway so that I can get a trial and then do it for my entire body😍😍😍 And I love watching you Sherry💕 @simranmahatme @archana_panjwani", "nihabhasuthkar": "I loved the video of yours on hair removal I would like to give it a try", "chhabrakhyati": "I want to get rid of hastle to go to the parlour when have to rush somewhere like a party Or get togethers. @nityakumar342 @divya2887 @baidsapna", "vad__ab": "I’ve always wanted to get laser done and I enquired @therapieclinicindia and got disappointed after finding out that they’re based only in Mumbai. I’m planning on starting my sessions there itself as soon as my exams are done in May. So having a part of it for free will definitely make me less worried about all that traveling I’ll have to do later!!😁 And I have these two cuties to join me @sravya_keertana @amulyagandhi (just trying out my luck😂)", "tikoosmriti": "@am_srishti @rajeenabasheerkp", "dhruvviiiiii": "Ohk so i have been dealing with undergrown hair on my leg for this whole time now so i really need this @gandhihasti3_3 @miss_ujasana", "priya_mahto": "have been following your laser hair removal video since months now and the moment back when u introduced therapie clinic and the doctor in the video i had an urge to go visit them as the clinic is near by my college (the institute of science ) but i don't know for some unknown reason i could never have the confidence or say guts to go try them . i see this giveaway as a great opportunity 🙈 tagging: @thakurunnati @supriyamahto", "priyanka7790": "Who wouldn't like clean, smooth & hair free legs/underarms 365 days..life would be sooo easy without having to think twice whether it can be a short dress/skirt/sleeveless day or fully covered day.. would really love to win the giveaway.. Big Fan, Sherry! much love 😘 @shrinidhi06_shetty @rumasoans", "medha2195": "I’ve a really really sensitive skin! Whenever I wax, I get boils all over which doesn’t go away for a week! So I constantly have to plan wax schedules according to events that are coming up so during that event I’m smooth as a feather. Getting a laser reduction will help me not only get rid of the hair but also this constant headache of waxing cycle! @jardine_395 @disha_0495", "kritinkhetan": "I think I should get this is bcoz I would love to get laser hail removal. It is extremely inconvenient when I have to think what I have to wear bcoz of this @taniaf249 @ishitasureka", "charmie_solanki": "All my life I've struggled with excessive facial and body hair due to pcod. I've always wanted to get laser done because I'm way too hairy for a normal 23 year old girl. This giveaway will change my life for the good. @kanchi_baldota @shreyagoradia", "manishasadani13": "Hey.. reason is that I have lichen planus spots on my arms and feet and hence I cannot wax at all.. and shaving everyday is such a pain when you’re an Architecture student.. I feel it will help me be more confident in wearing the correct clothes to suite my persona.. @krishmasadani @chehakmalik", "live_happy_let_live_happiest": "Cos i take time to read all your post and i deserve to win atleast one giveaway cos u never let me even one at all.and i would love to be carefree while wearing short sleeves and sleeveless tops.", "pardeshitaniya": "Because every month waxing is too much of a hussle and in case if we're in a hurry, there is no option other than shaving which leads to ingrown hair therefore this laser hair removal will be helpful for anytime outing. @aayushi_2304 @tanishkahagawane", "dams.gpt": "@sherryshroff @therapieclinic I am too lazy to do wax and also want to free from painful wax. 😬 @archanagupta2867 @ektabhadauriya", "aditicd": "I study in the US I’m from Mumbai and the beauty services rates here are sky rocketing plus there’s no time. I miss parlor services in India and doing everything on my own is a pain that’s why I want to win🙋🏻‍♀️ @explorers_ecstasy @mediasharma 😄", "highonfries": "Everyone deserves a fairy godmother once in a while and if that godmother happens to come with an offer for laser sessions, that's even better. My birthday just went, so this will be the perfect birthday gift! I'm very excited :) @daddyslilmonster97_ @girlsdreamtravel", "juhisahajwani": "Struggling with pcos , and extra sensitive skin and non acceptance of a hairy skin , has made for more than a few painful parlour sensations . Laser hair removal would be a Godsend . @priyanka.sahajwani @namratasahajwani", "shriyahanat": "I’m as hairy as you were. My trips to the salon are so frequent that everybody knows what service I’m about to avail! It’s annoying. Also not to forget the stage where the hair is at a weird length and waxing won’t help. And shaving is not an option for me as my skin gets irritated and starts breaking out. I believe I need this more than most of the girls out there and would rid me of my biggest problem! Also i wish you speedy recovery and good health sherry💕 @nikkiita16 @vaidehiee", "hastirambhiya": "My reason is becuz i will enter in degree college now i will b hving a bigger exposure of things abd people plus removing hair on hands and legs really becomes a thing before entering the college...... I hv hairy legs and hands 😬😬😬😬😬😬 plus everytime bearing the pain while getting waxing done ob legs is too much for me..... Hair growth on leg is relatively more thn on hands so pain is also more😬😬😐😐😐😐😐😐 hence it wud b amazing if i win this giveaway....... Thank u❤❤❤😊😊😊😊", "kinshuka_ms": "Cuz i gonna get a laser", "pradyyk": "With no one to pass on the information of proper waxing 10 years back I ended up using veet and other products which eventually made my underarms dark. This has lowered my self esteem that I don't wear sleeveless tops anymore. Would love to get laser treatment done on my underarms to be free from painful waxing. @praneeta_kokare @karunae", "thekaratechic": "Hi Sherry ! It would be great winning this giveaway , always wanted to get Lazer done , maybe this giveaway will give me an insight on how effective things are after lazer and encourage me to get a full body done soon ☺️ @_aleee_20_ @jennygeorge_97", "theuppereastside21": "It is hard to keep up with the hairy underarms.. And shaving/waxing them is just too much for someone who likes to wear sleeves outfits. I really want to win the underarms laser hair removal session. It's my birthday coming up and it ll be great if u pick me :) Mumbai Resident 💥 @minakshig @jasmeenmatta", "sreedeepa_saha": "I have never taken part in a giveaway before cause I have never come across such a unique one. I just love how you @sherryshroff are different from the others and this piqued my interest to an extent that I actually ended up taking part in it. I am just tired of facing the annoying Parlour aunties to get rid of my body hair who think my skin isn't a sense organ and thus ruthlessly wax the hell out of it. If I win this it will like a lottery for me 😛 ... Hoping for the best! @jain_simran_ @ankita_1224", "chitwan_a": "I wanna win this because I have a serious problem of ingrown hair and it has left marks on my legs. I am afraid of getting waxing now. The more I try getting rid of ingrown hair the more serious it is getting with waxing. The marks never tend to go. I really wanna get rid of this problem and try this. Really hope I can.", "shweta_bhojwani": "Hey @sherryshroff ! First of all I want to thank you for introducing me to @therapieclinicindia ! Since childhood I've a really thick hair growth from head to toe 🙊 I could literally give you a competition in this! But you're a hair free person now 😋 I always wanted a permanent solution for my hair growth plus the ingrowth issues! But I didn't have much knowledge and I was not sure or confident about the laser but now I'm all set! So thank you sherry! ❤️ So the following are the reasons why I want to win this giveaway! I'm just tired of waxing! The pain which i have to bear and the money which I spend every month! The parlour lady who keeps on telling me that my growth is so hard and she literally just keeps on pulling the waxing strips because my hair are just not ready to come out in one go ! Last month my skin got peeled because of waxing so I'm literally done with this ! I hope to win this😇 Tagging my best friends who knows my situation 😅 @shwetajain_ @sagarjaisinghani", "shruti.rao.57": "I desperately require it! @just_anshu @renukholapurkar", "_shreyakankaria_": "There are two types of people- One who go to the parlor once a month and the other unlucky set who has to go and get waxed every other week (or shave ) , sadly I fall under the latter. So I definitely need this 🤞🤭 #awesomesauce @sherryshroff @therapieclinicindia", "chetalisavalia": "I should win since my underarms are already been taken care of and awaiting some giveaway for my leg hair removal! #laserisbetter", "rashmiubhe": "Hi There, I have taken laser sessions previously, I wanted to avail some more was just trying to figure where next, is when I came across this post. A couple of friends would also be keen. @prriyaubhe @anushkaduduskar", "meher_ichhaporia": "Laser removal will literally be a like a God sent gift from heaven.Under arm hair removal is excruciating and a bloody (literally)painful affair, with hair refusing to come out and even after plucking and tweezing if I did manage to extract it ,it grows back with vengeance with 2-3 strands of hair growing out of the same folical. I would love to see a day where the parlour lady no longer can crib about using a razor(when i haven't but the course hair always makes her think otherwise 😒)@therapieclinicindia @sherryshroff @rayomand1234 @jezreen_mody", "m_r_u_n_a": "bcz i dont like the underarms hair grow and i hate that ..I tried already lots od things", "littlegreenbackpack_": "@clickclickflashh do this!", "jyojois": "I have been thinking to get laser done since 2006. Went to Kaya back then but then they convinced for some other treatment. After seeing your video, I realized it was goid that I could not do it then. I am based out of Hyderabad and willing to travel to Mumbai for the treatment. Tagging couple of my friends @sowmya_annaiah @nchauhan88", "spurtirayanade": "I have been wanting to try this from long time but didn't get the right place. It would help me to do full body or atleast face laser treatment if I get chance to try this.@gayathri_swamy @sobiya_masthani 😍", "sejal_karmaran": "I should get this because I have been a loyal follower since your long hair days, applying for all giveaways and still not winning any. :( @cosmic.hues @diivya.jain", "riyaasharmaa10": "Coz i am tired of being a hairy godmother. I’d rather just be a godmother! Plus all the shaving and waxing take a toll on you after a point of time. I get painful bumps after waxing and shaving takes up a lot of time @frankii.cash @amyt.episode", "darshivichhivora": "Who would not want to hve hairless underarms and hairless legs ... meeee✋🏻✋🏻✋🏻✋🏻..!!! @rushi.r8 @mokshaa_chheda", "anikaparekh_": "I’m someone who loves wearing sleeveless tops but I have sensitive skin and shaving tends to give me rashes. This laser treatment will be a saviour for me as waxing my underarms everyday is not possible. I’ve followed @therapieclinicindia and have been following Sherry for the longest time already! Hoping to win this one! Tagging my 2 hairy buddies that will love this treatment too ❤️ @vidhii11 @ahdimasraklarak", "prachibhanu98": "I have been watching you for a long time also i have the hairiest leg possible #genes I would love to win this contest", "snehal.sapkale": "i absolutely hate getting waxing done as it is so painful and ingrowth is irritating as hell. it would be so awesome to not be worried about hairy legs before wearing anything i want to. thnkoo for the opportunity. @anuja_suryawanshi @sdiksha2004. thnkoo for the amazing giveaway @sherryshroff @therapieclinicindia", "thegirlinapinkscarf": "Who doesn’t want hairless body? And getting rid of regular Parlour appointments sounds like a bliss so I would love to try the laser hair removal treatment. @anokhi1999 @kwinashah", "aayushi1992": "Who doesn't like a little deforestation at the right places ? Need of the hour !!! 😛😂@natasha.tekchandani @kiranm21 @tanushri.narang @sheena.murpani", "vidu.22.08": "I have always been scared of getting lazer done as I am not sure if it would work well. But I am not so scared after you shared your experience so hope so I win this and can further share my expensive with others... Tagging @thelibragirl0 @urvi_shah_", "nidhi.0902": "Firstly Sherry I love your personality😍.and I wana win this Bcs I wana get rid of the painful session at the salon.", "tulika_nb": "Hey Sherry, (@sherryshroff) I am a travel freak and a sucker for skirts/dresses and everything sleeveless! I need to get my hands on the laser treatments from the best @therapieclinicindia to enjoy what wardrobe I have made for myself while I'm traveling for a hassle-free smooth skin 😍❤️ @nabarmanasikekre @yashi79", "kwinashah": "@therapieclinicindia @sherryshroff Who doesn't want to get rid of the forever trouble of that waxing and pain! I always wanted to go for laser sessions but always find it to be damn expensive 😂🙈 but at the same time want to get rid of this forever waxing and pain mahn it would be of a great help if you help me with getting rid of this solution permanently. Tagging: @aayushi__19 @rutu_vora_09", "tarika15": "i would like to win this giveaway coz i hv alrdy done my facial hair removal from therapie clinic after watching your videos and reviews...so thanks for helping me get rid of facial hairs and look more pretty😁 😉 i would like to win this coz i really wanted to get laser on other parts of body but just cudnt afford it at present...so i wish to be the lucky one to win...🤞 taggin @hema0404 @riya_wanderlust_designer #laserhairremoval #giveway#hairfee @therapieclinicindia @sherryshroff", "snehal_sohal_sabhlok": "Really just want to get rid of those rigid super fast growing hair forever. @amritakhokhar @komal2ray @sherryshroff @therapieclinicindia", "nishhhthhha": "We all know and love a formidable woman who is her own top priority. So access to a little luxury with this convenient solution, Coz destroying the follicle is really worth the time and pain for that fuzz free skin @chahatdhawan @simonekadne", "jeelgala": "Wow!! This will be a great opportunity to try it for one part and decide if i want to do more. Also the clinic is at kala ghoda which is walking distance from my office which is even better. I have been contemplating lasering some hair on ky body but always chicken out. I am also like you that I get irritated seeing the hair on my nody and do it for myself. Lots of love💕💕", "sparklelife777": "Having suffered for all my life from ingrown hair and chicken skin, I would really appreciate being able to start my underarms at @therapieclinicindia and then maybe consider doing more. Finger's crossed and being optimistic, hope to win one for a change @tanushribaikar @mansijain88 @bianca_thadhani @sbshilpa796", "lifeofmamta": "Honestly I have never tried hair removal technique earlier but I am super excited to try something new for myself. Have heard a lot about hair removal session and definitely want to get my hands on it @minakshi13.03 @ranade_shilpa @mehtapooh @thegirlinapinkscarf @thefoodiesneaker ❤️😘", "vvidhisha": "I feel like I need to win this giveaway because I am tired of being the bear haha and they (@rimple01 @_art_autre) the smooth penguin skinned sisters will stop making fun of me! Also it would great if my fellow bear sister (@hinal_01) could win because she is as hairy as me 😝", "dayap82": "Hey Sherry the reason I need this giveaway is I had tried laser with one of the clinic (don't think I should mention the name) and they weren't very effective all though it was cheap cost wise but the results weren't effective. And I really can't afford to pay that much 💰 again.", "shraviyasaravanan": "Cozzz waxing every once in two weeks is a pain.. and so is wearing full pants or trousers in summer 😅😅", "pranjaljain_": "Reason: Because I'm one of that person who has 3x hair growth on her body than hair on an average hair female body. I'm a very hairy person who has thick hair and If I win this, it will be one of the best achievements of my life and I hope I'll be able to do my life much better with this. Also I'm an architecture student and I'm an aspiring Architect who needs a lot of confidence with her portfolios and to face the clients. So yaa wish me luck. I REALLY NEED THIS.", "tasneem_mahuwa": "Because i am lazy. @moniideepa @insi_mahuwa", "uppalstuti": "I've always struggled with my extreme hair growth. Hair removal is an exhausting and time consuming process for me. I've been researching laser hair removal for sometime now and would love to be able to try it at such a premium clinic. @apsara.af @sumedha16.10", "anjushabhattacharyya": "Being a model I am always on the run and having permanent hairless body would be such a blessing @sherryshroff @therapieclinicindia I can save up on so much time !! @ankitaparmar @anjubhattacharya", "tahseen96": "I have actually been planning to do it since a long time. I did a trial with my upper lips and I really liked the result. I would like to do it to my facial hair also now @justjilanithings @bombayhippies", "bombepooja": "Hie sherry... Getting rid of monthly deforestation 😍 for forever ..what could be better then this 👯👯 ... All my love ❤️ @sherryshroff @therapieclinic @therapieclinicindia ... Tagging @skpooja @prajakta_santosh", "xsumedhax": "I'd consider myself really lucky if I win this because I'm extremely hairy and its one of my biggest insecurities. Please change my life sherry!😭🙏", "saloni_bhatt": "Have been fearing it since years. I think here's an opportunity you have to make me jump into this pool without any fear as I trust you and @therapieclinicindia :) @bhaktisarvaiya @apoorva21s", "divyas_1998": "Its a hassle to sit n shave daily or wax monthly. Both being time consuming i wanna escape from these methods. @divyas2903 @pavi_sv", "divyas2903": "Its a hassle to sit n shave daily or wax monthly. Both being time consuming i wanna escape from these methods. @divya_____1998 @pavi_sv", "anjali_gala": "@kunjika.js @rosh3196💕🙈 Had Failed Laser Attempt due to old machine😩😩😩😩😩", "nimishasamania": "Getting a laser sessions will be my first ever experience as I won't opt for it otherwise if it weren't for you as I am equally pumped that I might meet you 🤘🤘🤘@nancygupta12 @uditsamania", "bhaavya_venkat": "Hey.! .. I'm a BEAR !! and I'm done with this waxing jazz and because of this waxing thing I'm very lazy to go and cause pain to my body... And also I use to wax my underarms and they are super sensitive which would lead to tiny skin peeling off or slight bleeding .. so I just want to get done with this program @_srinidhimohan @tanv_t @manishvenkat", "vidushiinigam": "I want to win this underarms sessions because I'm just tired of getting them waxed. @__muskan11___ @shreyasi2218", "purva.k.patil": "@reshmathavai @srush_belieber because always been a junglee and would love to get rid of it and yes can't afford it😂", "nataana.45": "Hey Sherry ..!! Want to use this and give my wardrobe a favour to be worn everyday and not just for the week after waxing. All my shorts and sleeveless tops are waiting to be worn .💜💜💜💜💜💜💜💜💜 Tagging 2 friends - @sanjana.23 @devanshi.01", "shreyaa25": "Always wanting to wear those favorite pieces but feeling like a bear- sums up my existence pretty well. Forget crying during chums, I cry around THIS time of the month. And I've always wondered what it would be like to live without worrying because this. Forget love, all I need is a life without parlor woes. @ayushi_teotia @aishwaryakapil @singh__ishita", "rashijain302": "I would love to win this giveaway as I’m going to Australia for further studies and therefore permanent hair removal will be the best and cheapest option for me in the long run....", "shreya.chatterjee": "@shreyac.reads @kolkatacombs", "thevegstonia": "I have super duper sensitive skin and hot wax burns my skin with red marks everywhere . Adding to this , I tried every wax however it does not help at all, I need to keep patting on my skin with a lot of ice cubes to save myself from the fiery feeling 😢,and I hate the pain which comes every month 🥺. I did try razor to escape from this but it resulted in lotta ingrown hair in my legs. Phew! A never ending saga. I want clean legs minus the pain 😟. Honestly this will be a boon for me ❤️ @ohh.__ellora @shradhapani", "girlatcloudbase": "Hey @sherryshroff and @therapieclinicindia , as an adventure sports (paragliding) athlete I have to travels a lot for my flying training and don’t get time to get waxed or get any parlour treatment done. I have to do it by myself and the results aren’t the best. Thus I get really bulled and made fun of my body Hair and spot due to razor/shaving. I always get told I dress so dull (can’t wear everything if you aren’t hairless). If I get the opportunity I would love to get the laser treatment done. It would help my confidence in my sport and carry my body in any clothing I choose to wear. 😊❤️ @rach_betty @kananthakurx", "plumptopretty": "@the.mad.hair.scientist @love.them.curves We got to be ready for that booty call anytime! Definitely must win these ladies 😂😍", "hiraljakharia": "Heyy..Reason is that I've always had problem with ingrown hair on my legs so I always avoid getting my legs waxed.Have always avoided wearing those one pieces and skirts in public as I feel ashamed.Will be really happy if I win the laser hair removal treatment by @therapieclinicindia and make me more confident", "theiratewoman": "A long-term solution to painful waxing sessions one has to undergo every damn month?! Sign me up please! Also, these sessions come at the perfect time - SUMMER! All those sleeveless tops and shorts of mine will see the light of the day more often if I win. 😂😍 @the_ann_chronicles @roshee13", "bhoomikadhiman": "I have hairy legs like a man and this makes me feel underconfident most of the times and i also restricts ne in many ways..so i always wanted to get a laser treatment...so i wish i win this one @therapieclinicindia @sherryshroff i tag my 3 bffs @icey_kit @komal_dhruvansh @padhysweta1995", "neha_wadkar09": "Because waxing is so very painful and yes i am lazy...laser hair removal is always what I wanted @sherryshroff", "kritidandona": "Being hairless is being beautiful and every girl needs to feel her beautiful self all the time! I want to feel beautiful each day every day, and live with no stress of having to go the parlour and go through the painful effort! ☺️", "asif.shaheen29": "Woaaah ...honestly every girl needs this blessing of no shaving no waxing and free of hair day so tht we don't have to choose clothes everyday according to it hehehe ...so yeah even I think I should win it because I want to get rid off the pain man😢@anjuman.shaik @shaikjahanara", "tanavibhoir": "#truestory coz waxing makes my skin dry scaly etc etc my skin doc has told me not to wax..so this will be d best gift for me ever n ever...@bhoirmegha @abhilasha24 #laserhairremoval @sherryshroff", "perneet11": "Because i want to throw up my arms all the time like I DONT CARE! 😆 #LaserAway @priyankamitra27 @nishtha.uniyal", "doctor.aditi": "Because waxing doesn't suit me at all and I want to try out laser. What better way than winning a giveaway😍 @beingsaiesha @rajeshreehinge", "itz_me_unicornlover": "@sherryshroff @therapieclinicindia Amazing and needy giveaway for me...As We all need silky smooth skin with no unwanted hair on our body💁...As I am gujju and all knows that we have lot of hair growth and i am spending lots of money in parlour only for waxing every 15 dayz...this amazing laser hair removal will save my time and money will give me permanent solution of my problem...I would be glad to be winner of this really really really useful giveaway...💁💁💁Tagging my parlour buddies @neha.mehta.718 @rachana_mehta9 girlz do participate and spread the words...Itz called our type of giveaway...#laserhairremoval #contest #giveaway #awesomesauce #hairfree #win", "jiyasanghavii": "Heyy. I would love to win this and honestly it would fix a huge part of my skin. The reason being, I have so many uncountable ingrown hairs all over my body and I wax regularly and shave very very occasionally. I’ve tried several really expensive waxs/scrubs and all other things to remove them but they just don’t go. I really hope I can win this so this problem doesn’t occur again as the hair follicles are going to be burnt from its roots. @tanamongeau @xjiyaah", "gitika_97": "@nikita.pasad @seedhijalebi This is dreamy.", "avantika.arun": "Winning this would be super cool, waxing would no longer be a consideration while deciding what to wear - which increases my options manifold! Fingers crossed. 🤞🏼 Tagging @reshma.14 @reeyabenedict", "fatema_29_11": "Hey I should win the giveaway because it is best for a hairy girl who could use some help.......i have entered all ur giveaways....so please have me win this one i am willing to travel to n fro to mumbai for this 🥰🙏🏻 @_alefiii_ @zainab30_7", "rakshita0023": "Reason is that i am in the world of business so i have to become formal and get ready for the work as soon as possible so i need it 😊😊 @neenasharma.nsh @akshitasharma263", "nshahdaan.99": "My honest reason of winning this giveaway will be I am already taking my laser treatment from therapie clinic for my face and it will be so amazing if i get the laser treatment for other parts also ❤️ Secondly , Best clinic and Shraddha was so good she suggested & helped me to take the right decision with laser treatment and i’m so much satisfied with the laser treatment that i can increase on my investment at the clinic. Third , I’m a look conscious person so i want it and get rid of the painful wax and scolding from ‘parlour dee dee’ when i ask them to stop in between. Haha! I sometimes really want to kill them when they are harsh.", "makeupandhairbybhaktivv": "I am a hairstylist and I know that hair looks good only on Head. @shraddha020 @priyanka_yuga", "shazacharia": "It would be the absolute dream to pick out that cute skirt to wear without having to double check my waxing schedule each time... What say @shaiforaneye and @poorvaroid ?"}