{"roohinajiya": "Its been years but my acne r just not going .. i have tried almost everything nd now m tired", "manishisumathi": "Pimples are leaving scars behind plz let me know solution", "chaudharydivya": "Hi Sherry @sherryshroff. I feel lot of us staying in Bombay struggle with Humidity and at the same time Dull Skin. Moisturizing it can b tricky cuz skin gets very Oily. Can we have some guidance dere. Also throw in some anti aging care n products for ppl like us. Early 30s n struggling with time.", "mahimashokhanda": "Hi.. what is the best way to remove marks left after acne? Also anything good on blackheads, I have the deepest and blackest blackheads on my nose area!!", "manvi_grover": "Hi Sherry ! How do I get rid of white heads , acne and redness on my face? @sherryshroff #AskTheExpert #asksherry", "harshi_nandwani": "Hi @sherryshroff!!!!.....I was waiting for you to do a video about acne for a long time... and finally its here!!.....Actually i have been suffering from open pores and oily skin for a long time...So can u plz help to solve my skin problem!!", "l.sampurna.l": "Will charcoal mask help for pimples? Nothing seems to work!!", "chinmayee_joshi": "Solution for acne and blackheads. P.S. I've oily skin.", "nikhita_pothina": "I have developed pigmentation on my skin and I am lost as to what to do.", "__gayatriiii": "Full /High coverage makeup products for acne prone skin?", "malvika_sri": "@sherryshroff How do I reduce Acne on my skin???", "happilylost22": "I am visiting a dermatologist and my condition has been improved over 8-9 months but still i get those random pimple and they take forever to go", "mallickk": "How to control pimples arising due to PCOD??", "rekhli_4": "I have visited dermatologists for couple of time to cure my acne which was in past though I don't have severe breakouts I still sometime get pimple on cheeks and red marks of previous pimple are not completely fading.. Is there any permanent solution for removing them?.. Also help us understanding difference between dermacleaning ur face and taking regular facial clean up at salon.. Which one is recommended??", "nireeksha__": "I get lots of blackheads on my face specially on my forehead and also how to remove the acne scars from the face #asksherry", "anamitraa31": "I am having lots of cystic acne which is occurring due to Polycystic Ovarian Disease. How do I deal with these apart from lots of work out and eating healthy which I am already doing.", "kuku_99": "How do you reduce bacne? Please do suggest some natural or effective meds for the same ! Thank you sherry for this series and loads of love from Bangalore❤", "aswagle": "Hi sherry, quick question since I'm working I don't have the time to do the whole beauty regime. Any quick fix or any one thing that I should use for combination skin?", "jyoti_30": "Hie.. my question is that i keep on getting breakouts on my forehead very frequently what could be the reason?? Could dandruff or pcod be one kf the reasons??", "zinster_in": "What do I do about large pores or literally craters on my face?", "pankhurikanodia25": "I have a combination skin and one or two pimples pop here and there but in the last month a very nasty pimple popped up on my chin and its not going away its been like 2 weeks. To top it A new pimple has also popped up next to it. What to do??? Pleasee help!! 🙈🙈🙏🙏🙏🙏🙏 @sherryshroff", "arzipanchal": "Hi sherry I have a combination skin. The problem with acne is that I get them mild but they do leave a stubborn scars behind and it takes a long time for them to go. Please help.", "rubichaudhary": "Can you plz suggest some dietary changes kr home remedies which I can do along with the treatment. ..I have oily skin", "nitya.gupta.291": "Hi sherry..i dont have pimples exactly but i do have tiny oil spots kind of thing around my eyes, what can i do for that?", "ishani_chandra": "I have severe adult acne which refuse to leave my cheeks and U zone. No home remedy or various types of chemical/non-chemical combinations have helped my case at all. What is the best remedy? PS - my skin is severely oily despite everything so there are open pores too.", "beautifulbuddy": "My skin has been acne and pimple prone while I was a teenager. Now I am above 30, mum of 2 and I still have a pimple pop up every other day. Will this ever stop. I have combination skin, oily at the T zone. And I use minimal make up and go easy on skin care routine..", "alibun_doc": "@sherryshroff i have developed acne since June 2016 and there hasn't been a single day when my face is clear .. they are all sizes and even the dermat treatment didn't work.. i have a dry skin .. plz suggest something..", "shwetaagarwal1694": "@sherryshroff What's the Myntra to get fair, glowing, lively and talking skin? ☺️💓", "d_deepthi_reddy": "i occasionally get acne but the spot aren't going so my cheeks are filled with dark spots.What can i do about them?", "shailee24": "looking gorgeous ..which lip color u r wearing?", "preetinderk20": "I went for a laser treatment last year for acne scars. Superficially the skin looks clear but in hot weather or when I workout I get open pores and all my acne marks are clearly visible. How to get rid of these scars under my skin??", "anisha_verma5": "I have a huuuuge acne problem because of PCOS, always have horrible acne during my periods. And because of all the acne and scars i have pits on my cheeks. What can i do about it?", "meenakshi.p": "@sherryshroff can acne caused by PCOS cured ? If so what r things which we need to do... and how to get rid of those dark spots left behind the pimple ???", "sheenakaur11": "Hi sherry @sherryshroff need to know about the little bumps (like acne) on forehead & cheeks... why does it happen & the solution for this problem pls?", "sniggie.jpg": "Hi @sherryshroff I don't get any pimples but I do get a lot of black heads and acne? I face is oily all the time except of my nose which is always dry?How do I take care of it? What skin routine do you suggest?", "triparnamaitra": "Wow.. xctd!!", "trups_corner": "While treating acne under doctor consultant... Can we use any kinda face mask or sheet mask??", "ishikajain": "I have oily skin, and all grades of acne from 1 to 3. I'm 19. But it doesn't stop. I have taken treatments and everything. Nothing works. I'm sick and tired", "gurmanchm": "How to get rid of rigid pimple marks i have a habit of scratching my pimples and it has left marks on my face", "shruti.a.joshi": "Some home remedies pls", "priyadsai7": "how to remove acne scars i hv tried so many expensive products n peelings but nthng work", "___maheshwari____": "How to get rid of acne scars?", "avniiij": "I have been using Clinique three step program for a while now. Doesn't seem to be doing much to my skin. Are there any other products that I can use? I get acne before my periods start.", "richa.tulasyan": "How do we get rid of a blind pimple?", "chaudhary_namita": "What should be the skin care routine for people with oily and acne prone skin? @clinique_in @sherryshroff", "ananya_birmole": "I have a lot of acne on my back and my forehead which I suppose is due to dandruff. How can I get rid of that? @clinique_in @sherryshroff", "gunjan.godwani": "How do i resolve acne and acne scars on the back?", "rushalisisodia": "@sherryshroff i have a clear skin but the black spots that remain after pimples go away still exists. Initially i thought it'll fade away. But they didn't. Do help me with this. Lots of love. 💚", "pratyashabhattacharya": "I am 21. I never used to have acne before. But now, I've seen after I started to remove my facial hair , I am having acne on my chin area a lot. I don't know how to stop it...please share some remedies.", "rakshita_modi": "I want to know the reason for small bumps on forehead although i don't have dandruff issues and remedy regarding that..please help.. tried everything", "karishma_gulyani": "Skin care tips for acne prone skin? @sherryshroff", "sounhsansar": "Being PCOD teen...what foods should be avoided so that I can keep my body clean??", "rroma20": "Scars that won't go :(", "thecheesecakebabyy": "I wax my face every 2-3 months. Usually I have few breakouts on which I apply ice & aloe vera gel & they disappear in the next couple of days. But last week after I got waxed, few acnes started appearing on my cheeks & chin the next day & slowly they grew in number. I want to know what could have been done wrong this time & a remedy for this. Thanks!", "sahatania008": "How to get rid of those pimples which especially occurs on periods days?", "zeaayu": "Since last 2 years my both cheeks never got clear skin always there is circle of pimples or marks left , plz help to get clear skin. I have almost tried everything possible.", "akankshasareen18": "@sherryshroff I've really dark red scars on my cheeks and it's been ages that I last saw my skin clear. Also my t zone is super oily but my cheeks dry out. I get pimples on my cheeks. So my issue is of having pimples on the dry patch. And I've tried almost everything every remedy every medicine but nothing worked..please please put my question out there! Thank you so much! Lots of love!", "tanyaraii": "Is there anyway to prevent the pimples you get right before your period? Thanks a lot ☺️", "at_garima": "Hi sherry, how to improve skin and get flawless look naturally. What skin care régime I should follow, also what to eat to get flawless skin. Thanks a lot @sherryshroff", "witty_lady_k": "Is there any safe way to pop a pimple and how to get rid of the black heads?", "ideepti_kaushik": "I have post pregnancy acne prob. My son is 1 year old. Nothing quite works fr me. Plz help", "monica_subramanya": "Daily skincare routine for acne prone skin ??? Sherry plss ask my question", "muskaandube": "How to get rid of the dryness at side of the nose and between your lips and chin?", "sheena_apur": "I've dealt with acne prone oily skin all my life. I've finally gotten it under control by using only organic products on my skin. But, I've still got a little dull skin and acne marks. How do I make them go away?", "naynikaaa": "How to get rid of acne/blackhead kinda things near or on the lip line?", "apoorva_coolkarni": "Dull face sometimes and dark circles. Cheeks are fair but the rest of the face is dull. What is the solution for this? Please please ask my question, I have tried everything possible.", "shruti_karande": "And wat is the remedy for acne zits", "aditi_des": "I have oily skin and get a combination of some zits and small bumps on my face. How to avoid these? @sherryshroff very nice initiative!", "sangeeta8469": "Hii sherry wen i was 13 frm tht tym i had some pimples on my face i m fine with pimples bt the scares are still on my face i m jus 21 now n luk muc older thn my age bcoz of the marks..plz suggest some remedies", "ananyadey67": "Hey Sherry!! Hope you're doing good, I have this weird problem with my skin. Whenever I go through a facial cleansing my skin tone lightens and I feel fresh,but after 2-3 days the pores start producing excess amount of sebum and sweat, which makes my face very oily. Should I stop going to the parlour? Or is there any alternative? Please suggest. Thank you😚 @sherryshroff", "aisha41294": "Hi sherry... i have oily skin and get a lot of hormonal acne... will any of the clinique products help in fighting these.. thanks for such a nice idea... u r really different... ❤️ u loads", "nidhichinai": "I have an acne problem, I get pimples pre menses and then it settles leaving marks, how to get rid of the marks and reduce this problem?", "nikhitamavinkurve": "@sherryshroff After every shower I tend to get patchy redness on my face which stays for about 10-15min. Tried many different products but none worked. Any remedie?", "sree_vkn": "Hey Sherry at one point I decided that", "kanishkaborana": "How to get rid of oily skin and hair full of dandruff at the same time?", "minakshiapandey": "How to get rid of acne marks?", "khyati_goel": "I have pimples from quite a long time. Whenever I take some medication, they do get fine. But ASA I stop taking medicines, they get super worst. Please. Some suggestions on what should I do? PS: I have oily skin. And also on how to get rid of acne marks?", "simranbhatia11": "I have tiny bumps on some parts of my face. That makes my face look uneven. How do I get rid of that?", "711neha": "Hi sherry❤️.. I got a facial done last month after that all of a sudden pimples started coming on my face which has never happened.. how to get rid of this now😒", "delicious_home_bakery_": "@sherryshroff well my skin is extremely dry and sensitive and itchy at times my skin is not an acne prone or pimple type of skin #asksherry will my query be answered.", "riamalik98": "@sherryshroff I used to have bacne and now acne is not there but scars are still there . What can be done to remove or lighten the scars.", "atrankii": "i have combination oily skin and i use clinique CTM for the same twice a day. what should be the routine pre and post workout other than regular morning and night skincare?", "nehusrivastava": "Hi Sherry. First of all I would like to congratulate you for all the hard work u put in ur videos... i love you and i love ur work. Keep rocking 👍🏻 @sherryshroff my concern is that i have tried many treatments and creams but still not sure of what nighttime and daytime skin care is required. I have combination skin and my age is 25", "nikkiwalia5": "Nice initiative... can prove to be of great help 🖒", "karmalakee": "i hve seen some pimple scar and some just fade away why is it so? #asksherry #qna #acne #pimpleopper #youtube # help #skin #nomakeup", "tanyaaurora": "I get these small little bumps that irritate my skin a lot and I don't know how to get rid of them", "amritashukla": "Hi sherry. I have a funny skin. Its great sometimes and at the most important events, it starts showing its true colours. Even if I have a balanced and fit diet, pimples are my skin's best friend. I have tried la roche posay, tried body shop tea tree, tried medimix even according to your video, though i hate using a soap bar, but still wanted to give it a try, dint work enuf and i am currently using kaya acne routine kit. The spot corrector was also of no use. Pimples go whenever they want. They come whenever they want. Should I go for a dermatologist? Also, does toning our face affect the pimples? Thank you 😀", "swatz_g": "What to use for clearing dark spots left after acne", "aarzoo_dhall": "What to be done fr to cure the marks tht acne leaves on the face.. Ny treatment fr tht????", "mehra_ahmd": "I have acne scars which refuse to leave my face😾 . Have tried using honey and lemon mix and also other face masks since im not much comfortable in using any other cream or medicine on my face. Ive stopped using face wash thinking thats the reason i get pimples. please recommend a good fave wash for normal to dry skin", "bhavna.10": "How do I remove my pimple marks??", "anuradhaananth": "My acne is just increasing so could you please suggest a good skin care routine. Not the usual moisturize, toner and hydrate but something that all of us are doing wrong. I'm suffering with a lot of blemishes too. Please help.", "kiran_panigrahy": "Firstly thank you and congratulations on the initiative you've taken. Acne scars are just too stubborn. Please suggest a remedy for that. Thanks in advance. Much love.", "aroushieee": "How to remove acne marks", "shubhyaatri": "How to remove acne scars?", "amm_jay": "Any solution for two tone skin?", "magentaeyed": "how to get rid of tiny bumps on the forehead ?", "curlyhairedwitch": "Please give some natural remedies for pimples and acne scars", "hisgrace07": "Acne scarsssss...", "sarvaniananthagiri": "My 3 year old kid has acne on chin .. any home remedy?hers is dry skin", "kuhuchoudhary": "So I have combination skin which is heavily acne prone with scars. Whenever I go outdoors it starts itching a little even if there is no sunshine. What can possibly be done for this ? @sherryshroff @clinique_in", "sindhusha_pendyala": "I have a combination skin . I have lot of break outs on my forehead they reduce when I exfoliate. And over exfoliation is not good so could you tell me how could they be controlled @sherryshroff", "moon_starlover": "I have acne or more specifically small zits on forehead. They are persistent and has been there for years. It doesn't go off with whatever I tried. I did cleanup at a parlour once and reduced the intensity. Can you give me some suggestions on how can I cure these small zits. Love you @sherryshroff #desparateforhelp", "nikita_hukumatani": "Hot to get rid of acnes overnight naturally?", "beautifulovingsoul": "I have pimples on my back and arms. They appear to be red. I think that it is because of dandruff. Can you tell me some cures for it❤ thankyou in advance❤", "not_nitika": "I have acne on both lower cheeks. I have tried every way, nothing is helping. Please help.", "chandhna_mushkam": "How to get pimple spots and uneven skintone?", "_p_r_e_r_n_a_kate": "I hv eye products allergy suggest best kajal n eye linear whc won't coz itching n I love you sherry", "nv_24496": "I have white acnes just below my eye circles and on forehead wat shud I do @sherryshroff", "shreyusingh18": "My face is very oily and i breakout often", "donttellmewhattodoo_": "I like to keep bangs as they really suit the shape of my face. But that leaves my forehead filled with pimples. Please help", "simranhirani97": "I wanted to ask I'm going through acne and seeing a dermatologist as well. So I reside in Mumbai rn but keep going back to my hometown i.e Agra and my skin acts differently bec i keep going back and forth. Please suggest me something.", "greeshma_maleficient": "#AskTheExpert please give me the remedy to ever returning acne on the same place... I have just one acne and whenever it appears it's on the same place and wouldn't budge until it's done with its time...", "snehiieee": "I used to have so much acne on my face and I consulted so many Ayurvedic Homeopathic Skin specialist doctors for that but it didn't help. Then I stopped taking medicines and changed my diet and that helped. My skin is much better now but there are spots on my face still and open pores are there and skin feels so dry and dehydrated and dull. Can you help me remove those acne and make my skin glow?", "anu_pekayare": "I have a really dry skin and suffer from acne too..dry skin acne is very rare so there are not many products for the same..acne clearing products dry my skin out..and moisturising creams cause breakouts..please suggest some products that i need to use..", "rarereverie": "Hey sherry. I have a combination skin and m really troubled by the constant black heads n acne on the T area. Please lemme know how to get rid of it. And I also want to know different remedies to get rid of pigmentation and skin darkening. Thanks!", "maryamrafeek": "I have oily skin please suggest me a good sunscream", "thatssosonali": "Hey sherry. I have a combination skin and I m really troubled by the constant black heads and acne on the T zone. Please tell me how to get rid of it. And I would also like to know about some remedies to get rid of pigmentation n skin darkening.", "shweta_pattnaik": "Acne spots removal?", "1ditamishra": "How to have a glowing skin ?", "aabhabahety": "I have super duper oily skin. I've been watching people talking about how toning will do wonders for the skin, instantly, but I feel toners cause break outs on my skin. Is that possible? Or am I using toners wrong? Have tried multiple toners across brands, have the same problem with each and every one of them. Also, no matter how much or little I exfoliate, there are always whiteheads on my nose (even after facials and clean ups). Please advice. @sherryshroff @clinique_in", "simarmadhok_05": "My ACNE is more because of BIG PORES , i get WHITEHEADS every second day even if i clean them . What should i use on a daily basis ?", "neena_emil": "After a pimple ,it leaves dark brown spots making me look freckled. What is the best waybto diminish or lighten my scars?", "aarushisinha7": "Hi Sherry! I have been getting pimples on my forehead since i was 13-14 yrs (i'm currently 20). They stopped for a while when I was 17-19. Now they're back and im getting them on my cheeks now. And they're increasing day by day. Some facts-my skin and scalp are oily. I currently use an ointment recommended by a doctor but it tackles it temporarily. Any solution?", "__aashi__": "Hi sherry ...this would be of such great help ...thank you for starting this ...my question is ...finding the cause for acne is such a great task in itself...have been struggling to find out one ..plz help", "trishlabhandari": "What's the best way to get rid of the blemishes that acne leaves ? Also I have early nodulocystic acne for which I can't take meds for various reasons , what's the best alternative treatment for it ?", "gulsheen_sabharwal": "What is the best way to get rid of a pimple without damaging the skin?", "sumaiya_tanveer": "I have a lot of dandruff coz of it I get dry n flaky skin,what's the best remedy coz this dry n flaky skin hurts. Please help", "dristiwadhawan_": "How to get rid of acne scaring?", "akankshas01": "How to treat milias.? I have a few around my T section... Please suggest something", "makeupby_nikita_": "I have a combination skin of dry nd lil oily in the T zone.. I've been getting white heads on my cheeks nd chin lately and I want to get rid of them.. what is the solution?", "rachanadave": "What are the best products for acne prone skin - moisturiser, sunscreen, serum, face wash and mask? Also is there anyway to keep the oil and sweat away for longer durations?", "sanjanaa_25": "Good skincare regime consists of?", "artigupta34567": "Can specs be a reason of pimples and acne on the upper cheek region??also how to get rid of scars", "anjaliii.pradeep": "I have lots of tiny zits all over my forehead . How to get rid of them ??@sherryshroff", "mahikaajain": "My pimples don't brust for a very long time and when they do, they leave a mark. What should be done?", "shubhi_1710": "Hi Sherry! I have three non specific questions. 1) Does Micellar water actually clear off the dirt from face and if it does, can we use it daily? ( Not replacing CTM ) 2) How authentic is liquid peel ? 3) Do machine exfoliators damage face skin? Don't u think the more we exfoliate, our skin produces even more sebum? Thank you :)", "aditi_kamdar": "does applying toothpaste on a pimple actually work? is it medically tested?", "akstraveldiaries": "Hi Sherry love your videos and simplicity in you. Thanks for starting this series. Here is my question - how to tackle remained pimple marks, any effective and fastest way. Thanks", "mahek_inamdar": "Are pimples and heat boils similar?", "prabanjali": "How to get rid of pimples marks,?", "gravy63": "How to get rid of back acne.", "sharithas123": "Whats dat one skin care tip i have to follow every day which is the best", "pixelspersecond": "@sherryshroff Is there a way to make clinique products less expensive and more accessible to everyone?", "ajuni_b": "How to get rid of acne and oily skin and the scars that acne leave behind and also the and i get a lot of pimples on my lower cheek area please suggest", "disha814": "How to get rid of acne marks?", "i_priya_chawla": "How to get rid of stubborn acne scars? I have taken few sessions of microderma but scars are still visible.", "siddhishedge96": "How many times in a day should we wash our face with face wash? Specially if we have oily skin.", "shruhegde": "Do parabens cause acne?", "prerikha": "How to get rid of the dark acne marks ??#asktheexpert@sherryshroff", "kajalsometimes": "How to get off from this acne this fucking acne black heads pimples are runing my life i am avoiding oily food sleeping on time drinking as much water as i can hiding my face with a dupatta every time so i can protect my face from dirt please help me sherry please please...😭😭@sherryshroff", "shraddharaheja": "Do pimples at different places on the face mean different thing ? If yes, then what?", "morning_dew1101": "How to get rid of pimple coming around same area ?", "prerna22_sharma": "How to get rid of small bumps", "bsechicknbiryani": "I have recently moved to Mysore from Mumbai, and have developed some acne.. and acne scars. How do I take care of my skin in cold conditions and hard water? Also, what to do of the scars.", "neethabijoy": "I get a lot of acne just before my periods..by the time the the acne goes it will be next month.. what can be done about that?", "sindhuriby": "DO THEY EVER JUST GO?", "disha.zaveri": "Does pimples in particular area determine something ? Like if it on cheeks we have bad stomach?", "_i_you_she": "I get a lot of pimples on my forehead and they never stop! There has not been a single day since 3 years now that my forehead has looked clean and pimple free. Tried medicines but that didnt work. Help!! #asksherry #asksherryshroff @sherryshroff", "isnehamaheshwari": "Why do we get pimples on chin and that too very big pimples and they lead puss and it's very painful also .. I have been having lot of pimples on my chin nd around my lip line which is hurting as well as annoying even though m drinking 3 litres of water per day so plz ans my question", "rashmi_98": "How do I get rid of cystic pimples( pimples with no heads)???", "snooflake": "@sherryshroff the area around my nose gets very itchy and pink and when very irritated leads to break outs. What can be done about this? I have oily skin.", "faizasmk": "What's a good way to avoid small whiteheads around the nose and chin area?", "aashrithaaa": "I get a lot of acne on my right cheek n forehead but now after using many creams the acne marks are not going from past 6 months", "the_chaos_lover": "Humidity wrecks makeup with oil secretion and makes my pores visible making it ugly. Any products that can help me?", "sanjana.14": "How to get rid of the redness from acnes scars? Any specific treatment or products? And how to prevent them from spreading all over the face?", "akanksha_nibudey": "How can i get ride of those acne spots ?", "_xnoushkx_": "That's really innovative of u", "harshitarajagopal": "I have acne prone skin and it can get really frustrating at times, is there a permanent solution to it?", "tavleen1109": "I get a lot of acne on forehead.. also what to do with acne marks?", "s_ruchika": "You look just like your mum here! Between the three of you, you resemble her the most!", "anmolgill20": "I got my nose pierced about a month back and i keep getting this weird pimple/heat boil above the piercing. What can i do about it?", "perriflow": "I have small bumps of acne on my forehead How can i get rid of em and make my skin smooth", "kittuhappy": "humid weather + oily skin= Pimples 😬 how to have control ovr it!!", "tayyebafatima": "I have acne spots in my face how to get rid of them!!!!??? Also I have a lotta tiny pimples on my forehead! What to do?", "aishwaryagore": "I have crossed my teen years, still suffering from a lot of acnes and acne marks on my cheeks. HELP !!!", "kanikachopra301": "Why do we get acne on the jawline? I have been having a lot since a couple of months. They run from chin to ears on both sides. So frustrating", "priyankapatra11": "I get these really big pimples where thy lead puss kind of solidifies and it cannot be popped. It doesn't even go. What can I do about those? Another huge problem that I have is the spots that stay behind. :(", "mehnaz_1016": "@sherryshroff hiii sherry...I have very sensitive n acne prone skin, i have got rid off acne but there are few marks n pigmentations on my cheeks...i think most ppl complained abt this.. so please give us expert advice on it..😊", "megan.slatt": "How to remove hyperpigmentation or acne marks?", "shanzehraheel": "How to get rid of acne and their marks ??", "rachnaaaa_": "Hey!! I have some pox marks in my face, it's been a year since I suffered from pox. Any solution to remove that??", "pruthvi.vaghela": "I have a lots of whiteheads and random pimples popping up.. also the pores are too large.. what routine shall I follow and products to look for.. thank you so much for this series", "aditiupreti06": "i get whiteheads on my forehead and small zits on my chin.. is there anyway to get rid of them by following a routine", "priyadahiya_": "How do i get rid of blackheads on my nose??", "shravya.addagatla": "hey.. how to remove acne marks?", "rabia_k9o1": "What do I do for acne scars ? @sherryshroff #asksherry", "zouey_kimi27": "I get acne on my forehead and i cant seem to understand why. It comes n then goes.", "sharonjerome_": "Does eating eggs cause pimples ?", "mahima_ramchandani": "@sherryshroff #asksherry how do I avoid black spots?", "sukhmanchawla": "Any remedy for ingrown hair?", "fionadafleenlobo": "Pimple problem Sherry @sherryshroff ...plz help", "vedikasin": "@sherryshroff i have a lot of acne on the side parts of my face like where we usually contour. And i have tried everything and done possibly everything to get rid of them but nothing is really working for it. Help!!!!", "anush.vj": "Hi Sherry , my husband has acne /pimple on his face .. he used to remove it with his hands . So that's becomes scar /small hole in his face . What should he do to go off .. thanks in advance this #asktheexpert concept is really good ...", "sakshigoodvibes": "Hi sherry, these days I am getting a lot of white pimples (small pus filled pimples) on face. How to cure them .. also how to keep skin acne free all year round :)", "tanvviii": "Hey ! I had a spotless face before . Its been an year I have shifted to other city and I have been having lot of facial hair and repetitive acne. I consulted a gynae who said there can traces of pcod . I have spots of pimples on my face and get pimples every now and then now.. what to do 😐😭😭", "archiee_29": "Hey sherry...i get really pesky and sometimes painful whiteheads along the chin and nose area..Also many times we know that a big bump is going to appear on face but whatever remedies I may do i cant stop it from coming...i would really need help for that!!!!", "pallavi.r.goel": "I have been having acne since past 5 years..I am 28 years old..acne mainly is seen on both the cheeks..and keep coming one after the other and leave a scar behind..plz let me know what should I do to cure them..cure scar marks..and instantly apply on them @sherryshroff", "yashim16": "Super sensitive skin.. combination with acne.. suggest a mild facewash, toner, hydrating cream, spf!", "curlystory26": "Pigmentation due to acne", "arnikagawand": "How to minimize open pores of pimple", "the_priyakapoor": "What to do for random pimples?", "sniccsnaccfriccfracc": "Hi. I've been using Cetaphil face wash since almost a year. Everytime I used another face wash for a change I observe that I get pimples or breakouts on my face. All the face washes I've used except Cetaphil are of high quality like forest essentials etc but still my skin doesn't work with it. Why so?", "saywhatbeauty": "How many times is it important to wash your face?", "nomad_in_the_mix": "I have darkspot of pimple and I have done everything nothing works and pimple which come every now and then", "awesomeghna": "I had PCOD, but the cyst doesn't exist anymore. How do i get rid of the acne on my face?>", "girlwhoscribbles": "I have a dry skin more like a T zoned skin Cuz my nose is oily when I wake up. Of late for past 3-4 months now I am continuously getting acne and it leaves mark. What can be done to treat it. Like stop it as well remove those spot it has left.", "dhvansss": "is putting concealer on acne safe?", "kritijijjaa": "@shwet__18", "kit.ash": "I get pimples which won't burst out and eventually reduce to ending up as a red bumpy spot. These marks don't fade or go away. What do i do?", "dimplleparmani": "How to prevent the acne that happens due to face waxing and how to get rid of them?", "rashmikujur": "I get really big acnes on my forehead. And it spoils the entire look. How to take care of it. And how to take care when a pimple bursts ?", "_nikita_parab_": "@sherryshroff I have many whiteheads and blackheads on my face and not only on the regular parts but also on my cheeks and forehead. No amount of scrubbing or masks help. Please tell me the reason and way of getting rid of it PS: I have oily skin. #asktheexpert", "_paruva_": "What can we do for the acne or pimple that arises only when we are close to menstruation dates?", "ziawardha": "Hey I don't have an acne related question. But have a very sensitive skin, that I get rashes really quickly and as well have a swear dark circle problem. I have tried alot or remedies and medicines but not much tends to help. Please let me know about how to take care of those darkcircles", "sunshinerainbowclouds": "I want to ask how to prevent taning? How to prevent bumps on face sometimes we get in night or during day randomly ? Also how to decide which cream is good for our skin n and one last thing what should be our daily routine in morning for skin i.e facewash then cream is it enough or other things we need too?", "sur_cusp": "Thanks for doing this @sherryshroff !!! I have recurring acne areas on my cheeks which I am not able to get rid of. It gets filled up with acne again and again.", "shaifali_7": "Hey what kind of diet should be followed keeping in mind acne prone skin and how to fight back acne problems .", "parulagarwal208": "Does rosacea get better with time?", "richa_maru": "I have heard people using Neosporin ointment as a spot treatment for acne. Does it work or make ur acne more worse? Also please suggest some spot treatment for face acne :)", "maheen5fatimah": "@sherryshroff plz include tips to avoid acne", "rydhumr": "I always get pimple around the nose @sherryshroff ? # AskTheExpert", "kavitha_reddy96": "I have facial hair whenever I try to get rid of it, immediately the following day I get acne on my face and coz of them I got acne marks on my face . Please help me with this @sherryshroff", "deepikamenda": "Can we ask anything besides acne please ? What cream should be used on daily basis for women in their 30s ?", "shivika.sharma13": "Hey sherry I am suffering from PCOS ( POLYCYSTIC OVARIES) so I have acne problem for a while now and the breakouts are sudden one day my skin is clean the other day alot of breakout occurs . So what can be done to reduce these sudden breakouts and their marks ?", "upsiii_17": "Nothing really suits my skin as t is extremely sensitive, even Patanjali's Aloe gel gives me an allergy. Is there any thing that can help with my Acne which is a little affordable?", "toomanyishus": "What home remedies do you suggest for breakouts?", "soumi_ghosh": "How do you stay so young like this? Like you don't age?!?? @sherryshroff you are only getting younger it seems", "kritikagoyal13": "How to get rid of pimple marks?", "vaishnavikaza0803": "How do I deal with pimple or acne marks on skin??", "bealwayzyou": "Without medication, how can the pimples can control? Food? Any specific food recipes for acne skin? Also natural products that work for oily, acne or sensitive skin", "prernamamtani": "How to get rid of acne scars and dark acne spots @sherryshroff", "rachanaaraaj": "I keep picking at my skin even though I know it's bad for me and can't seem to stop popping my pimples.. it's just very satisfying at that moment, but it's left my face completely scarred. Is it possible for me to ever have a clear face in the future?", "_nayanas.photo.phactory_": "Hi I'm from Kolkata, I start getting pimples on daily basis whenever I go to Mumbai 😡 Is it due to humidity ? Any special things to use or avoid ? Please suggest", "dreamydhara": "Is serum is good for acne prone skin? If yes then which serum one can use? Plz suggest", "ikroopgill": "Its whitehead bumps that turn into acne", "ritikakrishnan": "What are some basic oily skin do's and don'ts for teens? Also please suggest a basic, simple skincare routine for teenagers with pimples. T", "palaklunia": "@sherryshroff what is the best face cream and face wash for acne prone and oily skin?", "priyanka.kolla": "Hi Sherry! I got chicken pox 2 years ago. At first I thought that blister to be a pimple and scratched it. Now that turned into a mark and it's just not going away. Please ask the expert to let me know how to reduce that mark. hopefully you read my comment!", "dhanashree1603": "What should be the basic skincare routine for everyday so we have a flawless glowing wrinkle free skin for a long time . ?", "fatmaghayyour": "Any skincare tips for acne", "gunjeetkour": "What would help deep acne scars? Also anything to make skin glow and remove dullness ?", "sonal_suri": "Since the 3 step skincare routine is the holy grail.. Which are the best cleansers, face washes and toners for sensitive skin?", "supsudhanshu": "I always get pimples on my upper lips and chin, though i eat clean and healthy exercise regularly, can you please help? Its very embarrassing and i am irritated with such sudden breakouts on my upper lips and chin!", "roxainne04": "What causes acne? They say that if your parents have had a history of acne then we have acne too, how far is this true?", "soumya_dixit1": "How to reduce acne marks (brown marks) naturally at home?", "nehabajaj01": "Is there a permanent solution for acne??😥 @sherryshroff", "moksha.gaur": "What's the best way to get rid of the blackheads on nose? Scrubs just don't do the work for me ☹️", "jeya1312": "Why do I get tiny white head pimples after I wax my chin? I don't get those anywhere else after Waxing! And yes I do apply antiseptic cream after Waxing . @sherryshroff", "shalinamehta1110": "How do I minimise my pores? I get random tiny boils cause of dirt and dust", "jizannkhan": "@sherryshroff I have my wedding coming up soon and I have oily skin,I want remedies to have a clear acne free face fory wedding and want the glow too...so I need a solution for this!!!", "samriti1910": "What daily routine to follow for oily skin? How to get rid of acne?", "neetusingh4457": "I have acne problem bt scars more now on ....it's from last 9 yrs now I am 29yrs old mam pls help me", "vedavati.d": "How do you deal with acne scars?", "yuvika_fatnani": "What are the foods that trigger acne and foods that help combat acne?", "nikiitanair": "Best immediate pimple clearing crem/treatment? For those 2-3 random pimples..", "varleensandhu": "Best way of preventing acne", "rupaliwadhwani": "What is the recommended skincare routine for oily, acne prone & sensitive skin?", "samitaaa.15": "Hey sherry so I'm going for world championship to be held in London and I'm 13 so i have acne want to reduce it as far as possible and i do have combination skin", "chetna.sharma.961": "How to remove acne marks?", "rucha_17": "I think a dermat would be a better person to ask those questions to, rather than a person from a skincare brand.", "amar_meyebela": "How to treat acne coming out on back and chest ?", "vazinderkaur": "I always tend to have acne which are under skin acne.. Means without the face of pimples.. I don't knw how to explain... But i think u will understand 😂😂😂 and they take lot of tym to heal by self bcoz as they r under skin initially so take long tym too heal n ooze by self....what I want to knw 1.acne skin regime esp for adult acne 2.how to clear acne marks and pits 3. Instant solution for sudden acne 4.permanent solutions for flawless skin plz recommend affordable and effective solution .. Lots of luv 💕 keep rocking 👍 👍 💕 😘 😘", "originallypriyanka": "My forehead as well as my cheek areas always have tiny little acne all over it. I want to know what I should do to reduce it and have a plane clear skin? I have oily skin and regularly follow the CTM routine.", "anita.patri88": "How to get rid from blackhesds & Whiteheads ??", "09priyam": "@sherryshroff Hi Sherry! Pleaseeeee ask the expert How to treat colourless Bumps like Acne, but not actually acne all over the forehead?!! It just doesnt go!! Thank You!", "noory_laiq": "How to avoid or get rid of whiteheads??", "akrititian": "Please give detailed information about the products we can use..the cleanser,moisturizer,toner etc.", "vansheeka30": "Does taking steam help in dealing with acne? And how can we deal with oily skin", "simran__madan": "How to get rid of face rashes😷? ..help me please", "tvishasethi": "Hey! I want you ask you for some tips that you use to take care of your skin just before an important event or time coming up. Also how do you treat them if they do appear?", "geetsuri8": "Stubborn acne marks", "rashmigour": "How to identify the ideal toner for one's skin type?", "serebutterchickencurry": "I ALWAYS burst my pimples and am left with reddish marks on my face. How do I fix those ?", "ayushi_sharma_______": "How to get rid of whiteheads ? Could you tell some home remedies for that ? And how does the charcol peel off mask work ? Is it really effective ? If yes then could you suggest a charcoal peel off mask that is under budget ?", "mega_dard": "How to treat whiteheads and blackheads?", "shailyshambhavi": "Hey hi. How can I get rid of congested pores.", "pujalkadam": "💋💋💋💋💋💋💋💋💋💋💋💋😘😘😘😘😘😘😘😘😘😘😘 love you sherry 😍😍😍😍", "moody.patel": "The whiteheads that pop up after threading and remains in place for a week or two. How to get rid of them ?", "ambreenjaiya": "How to manage an oily skin and prevent acne?", "cloudy_secret": "How to deal with the random acne that appears just before the special occasions!! Any easy solution for a vanishing them in a quick way! 😅😌", "shrawanii__": "Acne marks are more irritating..How to get rid of acne marks", "_radhikaaggarwal": "Can we improve the blemishes that have once scarred the face after acne ? 💋💋😘love you sherry", "namrathamohan": "@sherryshroff how to get rid of small acne bumps and acne scars?", "meenalsonik": "Ways to deal with oily skin n acne?", "nurlinagafoor": "How to get rid of black/pigmented acne scar..😢", "aarushibaisla1994": "Pimples they do go away after sometime. But what about the bad pigmentation n scarring marks that they leave behind? How to treat the marks? @sherryshroff Love and luck🙌", "vanyajaiswal": "What is that one product which would help in getting rid of those stubborn acne marks?", "archanakrishnan17": "@sherryshroff how to get rid of dandruff, dull & dry hair after chemically treating the hair? For clinque, how to get rid of tan? None of the sunscreen are working on me.", "anatummyoffood": "How much is acne related to pollution. As a working professional, what are the 5 basic tips you will give to prevent acne in the mid 20s"}