{"sherryshroff\nVerified": "Verified", "myhappinesz\nVerified": "Verified", "darshanamaniar": "@sherryshroff so nice of you to reply to everyone! It's not easy!", "pracheemashru": "Just saw it. Loveeee 😍", "aislinnc.2020": "Oh Sherry @sherryshroff I was so happy to talk to you on our vid chat a few months ago! When are you coming to Florida?? I want to meet you in person so badly😘😘", "juliannagermono": "would u rather sleep on nails or sleep on snails", "asidbejodjrnfon": "Thank you so much!! :D Love it 😍", "zelina_w": "#asksherry @sherryshroff Which school and college did you go to?", "tanishabedi167": "Yayay you replied thanks for replying😘 @sherryshroff", "shahipaneer": "Where in India can I get the tee shirt transferors?", "doubletapbynima": "@sherryshroff thanks for replying love.... you are so kind👍", "chandnidialani": "What equipment do you use to shoot your videos?", "malaikanangia": "And tell us how you and your boyfriend met, you guys are too cute💖🎀", "shxkshi": "Thaaankkss @sherryshroff", "justjilanithings": "@sherryshroff #asksherry", "k.xshi": "Is vaibhav a model for some indian clothing brand cause I think I saw him on an advertisement for manyavar in the cinemas", "meghaashahh": "Did you read 50shade trilogy?", "ashnapatel27": "#asksherry who motivates you?", "teamlillysingh": "Who's your closest YouTube friend", "jayatisampat": "Next meet up!!!!!????", "nand.singh": "Is it true that ur secret goal is to be as perfect as nandini", "1975nish": "If you could only choose to do either YouTube or modelling for the rest of your life, which would you pick? X", "ridarohail": "Your fave fall outfit?", "thesarcalect": "Would you do a collab with any new Indian YouTuber if they ask you for it.??", "nivirka": "Whats your fav go to outfit for lazy days", "ami.babaria": "What's your favorite movie? 😍 @sherryshroff", "mahimakathiria": "Who is your inspiration for fashion?👗💄@sherryshroff", "s0385": "Why don't u wear concealer everyday ?", "gurpreetkhuttan": "Favorite youtubers", "preethiprasad": "Fitness secrets pls..", "mahemakhurana": "What makes u happy totally eee😁😁 kinda feeling??", "madhulikasharmaa": "#asksherry How do you feel inspired?", "eram.shaikh20": "Hey sherry lov u so much... u knw wt I lov u the most becz of ur attitud n evy tim u rply me I feel supr happy..... Thnks for evry rply can u pplllzz tell ur fav low end products undr 500 lov u", "rsuazo22": "What do you love about your culture???", "gab.est": "Why did you start your channel?", "nitya.266": "How do u imagine u r self after 10 yrs", "namaste.sonakshi": "What is your nationality ? #asksherry", "ashikajh": "do you have any plan on maybe going on a world tour, and having meetups in a bunch of different cities In the future?", "kaylafraancais": "What is your favorite tv show!", "varunsmirks": "who are your great inspirations?", "a11ergiess": "Who are your favourite youtubers? (If you know british ones then from british)", "rheadaga": "What's your motivation to do work?", "dancinginndark": "When can you do a meetup in Toronto? @sherryshroff #asksherry", "sushmita.x": "How fast can you braid your hair, put It in a bun, and take it out?", "manavimehrotra": "@sherryshroff which is your favourite lip product?", "extrarpita": "At what age you had your 1st boyfriend or crush?..@sherryshroff", "isarahxo_": "#asksherry @sherryshroff what makes you happy?", "saibahaque": "@sherryshroff #asksherry Sherry how do I manage my time and not procrastinate on all the things I have to do? Like balance school, social life, free time, etc.", "prishabatra12": "@malaikanangia she has a vid for it", "sharaahmed": "Hey Sherry!😆 Could you please tell me how to cure blemishes and what products to use? #asksherry", "ananditaegbert": "@sherryshroff when are u coming to see me?", "queen__stormborn": "#asksherry do you have any bad habits?? Pls come to chennai 😍😍😍", "dhawanshi": "#askSherry will you follow me?!???", "arpita09": "#asksherry did you love your school days better or college days ?!?", "thatbajwa": "I love how you are so positive all the time. Any tips you would give to someone with almost no confidence and low self esteem? :)", "mahimalahrani": "How are you so fit!", "unpoquitode_beth": "When you come to visit México?? Please 🙏🙏🙏 I love you @sherryshroff #asksherry", "chinmayi23": "Hahahahaha was going through the comments and found @vaibhav.talwar 's comment...yes yes that's a nice question! :D", "shreyansiv": "#asksherry do you prefer living in india or new york?", "reva2495": "#asksherry name your fav 5 youtubers!! 🙌😘", "sharodia_roy": "#asksherry ily When are you going to come to the USA??and btw I have the same name as u 😃", "simran_976": "I love your videos!!! Do u plan on coming to Australia soon??", "ahsfxfc": "How do you see yourself 10 years from now? will you still be making YouTube videos for us? #AskSherry", "tanimarahela": "Have you been complemented for your BUNNY TEETHS??????? Thanku :)", "yashashvii": "Some of your favourite places in Mumbai for brunch? :P #AskSherry", "dr_shivanijain": "How to get rid of blemishes and tannes ?? Too sensitive to sun", "apurvaaaa_": "@sherryshroff who is your role model? #asksherry", "svarina": "What was your best experience being a youtuber? #asksherry 😊", "shivalee_ghadi": "How should short girls dress up? To look a bit tall ...?", "mitali17": "Try and do a bollywood item dance 💕 @sherryshroff #asksherry", "mistry_niyati": "What are your future wedding plans?? @sherryshroff #asksherry", "khyatilodha": "The most embarassing incident you have had so far? #asksherry @sherryshroff", "a.n.jali": "#asksherry at what age did you start being a youtuber? What is the ideal age for starting a channel?", "piaffee": "As fashion guru..what do u suggest for wedding season...outfit n make up n ornaments? Can we have video on it plz", "saniarafiqkhan": "What according to you is the best thing about Vaibhav? :)", "makeupbyyashikamahajan": "What r u giving away next 😁😂 @sherryshroff", "mary.dud": "What are the pros and cons of being a youtuber in india? @sherryshroff 💖💖", "shrew_tea": "What is your workout routine???please answer it.. #asksherry", "chunztenz": "@sherryshroff #asksherry any plans to organise a bloggers meet in delhi soon😋? So excited to meet you #prettyyou", "grosgrossss__": "how often do you come to the us?", "dolantwinsindia": "#AskSherry who is ur biggezt inspiration in this world??", "thesgrewal": "#asksherry hey @sherryshroff which video editor do you use?", "pri_ash247": "What was your childhood dream? :-)", "deekshakapoor_": "#AskSherry what is the thing that you love the most in this world? What makes you happy?", "_nurnazreen_": "#asksherry", "tulip.majumder": "What was the last place you visited and where do u plan to visit next? (Overseas)", "suhanikacharya": "For how many years have you and your fiancée been together ? 😍 you guys are my OTP 💕❤️💜 flawless 💚 #asksherry and also when will you be marrying him #justasking ❤️"}