{"neelam.s": "❤️", "debsterr": ":’)", "funnyinmysunnies": "I read your work for the first time today. Till the end . I used to find it long so usually never stayed till the end. I am glad that today I did. It was funny, sad, witty. All in one. And a lot my style of writing as well. I look forward to tomorrw’s write up. Till then enjoying the Goan Bouganvillas.", "wabi.sabi21": "https://mumbaimirror.indiatimes.com/entertainment/the-kapoors-at-wits-end/articleshow/17966261.cms", "eleonoraguantini": "Thank you beautiful soul 😍", "siddhivalanju": "“If that man would have stayed, every relationship in my life would have stayed unexamined and broken” ♥️ @regajha you said it!", "theneophilianerd": "A friend sent this post to me today. Thank you for this, Rega. I am going through the same life-stance. Was supposed to start work in Malta in February, a new life. Got delayed by you-know-what. And stuck on a boy too. And not feeling too much of anything, just a quiet wait. Funny how one finds solace in shared experiences. Hope you have a good day 🌸", "gauriibansal": "Did not want this to end!!", "borges.andre\nVerified": "Verified", "aasmaaneerang": "Beautifully written", "gourmand_beast": "This is too real😭😍", "hufsahnasir": "I was all set to immigrate to Canada on March 27th. Quit my job packed, my suitcases, said goodbyes and then suddenly this happened. Flights cancelled lockdown in place. This is the most beautiful thing I have read about this pandemic. Feels like I’m not alone ♥️", "mansterrrr": "Thanks for sharing. My stuff is lying at a friend's place in Amsterdam and it's also a move waiting to happen when it will...", "apurvtyagi": "❤️❤️", "meanbeansquirrel": "Adopt me rega! I’ll become a cat for you", "cherrypievenndiagram": "This is exactly what I needed to read today. ❤️ @hannahcui", "lynnraj": "@regajha you don’t need to know how to write a book. It’s writing itself.", "loveleenabawa": "That's was beautiful Regs.", "dextaaaar": "Such a lovely read!", "deepu.077": "@tish.thomas", "tanmaybahulekar": "Wow.", "alishapathak23": "At wits end in the crying lane.", "anuworld29": "❤️❤️❤️❤️❤️", "bhavya.vatrapu": "Love love love this! ❤️", "sanaally": "@garimashaarma because wits end! :)", "sufiyan_1920": "🔥🔥💯", "shruthishirali": "This is simply beautiful ♥️", "tanxchan": "This is so beautiful", "aranyajohar\nVerified": "Verified", "samlivious_": "My best friend @geetikapandya told me that a story can be relatable but need not be a replica of your story. Wit’s end society is that for me and I suppose for my best friend too 🤗❤️", "mnafees": "Reading through these words were like walking through the trees to the clearing were the river meets the sea. I am glad a friend shared this post and I stumbled onto this. ☺️", "ek_taara": "Loved😍", "abhinavhinger": "❤️", "deksha.g": "This is so damn beautiful Rega! I'm such a fan of your writings! Sometimes, I save your posts to read again later, no kidding! You're brilliant😭❤️🙌 l love you", "sabre_of_smarts": "Please write a book. :') please just write one already.", "hamnahabeeb": "Aaaaaaah!❤️", "damini_chavan": "What is this?! What even are you?! This is so honest and beautiful ❤️", "talitha__koum": "❤️", "wholesome_goofball": "💛", "swastiii_": "Beautiful 💕", "sheen13": "These words, damnit! They are magic 🌟🌟🌟 It’s one of the most beautiful pieces I have read in a long long long time - and in a world overflowing with content, empty superlatives & flowery adjectives that’s saying something. More power!", "lisamishramusic\nVerified": "Verified", "brotherbadri": "This is beautiful and tender @regajha, Thanks for having and transmitting delicious feels. I'm sorry for the pain, and grateful for the grace.", "poojasiv": "Your words!!! They drip with such sweet sweet life", "saloniidesai": "LAST PICTURE/BOOMERANG HAS ME !!!! so calming", "fareehakhtar": "Pls write a book i’d very happily buy it!!!!", "varda.s": "@maytengo I love this", "pinkijha98": "❤️", "tara.kapur": "Beautifully written. ❤️", "amul_butter": "This made me feel warm and made feel like tearing up ❤️", "nostalgichobo": "The feelings expressed here are so real ❤️", "grishmakanuga": "❤️❤️", "ritikadhabaria": "@niharika_agrawal !!!!!", "allthismaya": "Listen, I love this. Love everything you write. Pls never stop😭😭😭😭", "atishagupta": "Beautiful!", "topbastard": "Damn, can you hurry and GIVE US A BOOK How much more patience is required, I can’t even have tameez anymore.", "lovedreamsandcoffee": "Lots of hugs Rega", "sarangiwankhade4": "When the wave catches us off guard......❤️", "divyabharathk": "You outdo yourself with every write up, yes. But this...this is just something else! Thank you for existing. Thank you. ❤️", "iamshalinichoudhary": "@regajha just..I cant even! 💜", "tiwari_swati": "Beauty of words !! Write more 😘", "purvithacker": "@simkochar please read this", "ibarthwal": "Love you rega. Just love you tooo much. My precious Instagram best friend 💖💖💖💖💖", "anuva05": "As relatable as if you had read my thoughts and capture with your words the emotions I couldn't pinpoint. That's a precious gift, just to be able to do that! Wish I could unjumble my thoughts with that much clarity. Keep writing.", "holaanyaaahereee": "Rega 🥺💜", "ankushb_": "Goosebumps! Cliche' but I needed this and I didn't even know that I did", "parulassudaney": "Your words inspire me to write! You go, lady!", "pallavisomethin": "Omg. @regajha you better be writing that best seller autobiography soon. I could.not.stop.reading.this.", "suncradledbynight": "Rega.. thank you for this❤️", "kuhelisanyal": "♥️♥️♥️♥️♥️", "pragyasachan": "Wow wow wow♥️", "tinatom31": "Just delicious. This was devoured.", "aparnamammen": "This is beautiful❤️", "rachelparekadan": "❤️", "kashondelivery": "Ufffffffffffffff👏🏼👏🏼👏🏼👏🏼", "stutiashokgupta": "So beautifully written and how. ❤️", "sanjsin": "Loved this Rega. Please keep writing!", "roshramchandani": "🧡🧡", "fammamalik": "♥️♥️♥️♥️", "nandini_19_": "We need more of these stories please!!!! 😍", "vani_prabash": "❤️❤️ ❤️", "misssvibe": "Your writing makes my day rega 😭", "sanyuktabafna": "This is so beautiful 💗", "cokepiya": "Ek hi Dil hai kitni baar loge", "riyajoshi__": "This is so good. :')", "bhargesh": "How are you so good at writing? 🔥", "popand_colour": "This is not a favour. There is a concept called corporate social responsibility.", "prachiix": "💓", "chaitali_karadge": "So beautiful 😭😭😭😭😭", "shrabani_rout": "❤️❤️❤️❤️", "liana.hu": "You and bell hooks 🔥", "chaifortheday2": "I lived at wits end society at the end of the beautiful crying lane for 5 years. It was a beautiful beautiful time where I grew to be who I’m meant to be. There’s something so quaint and romantic about the lane and the quiet green space around the building. Thank you for your little note about this magical place that is wits end society. I love and miss it so much. ❤️", "nikhitapai": "This is perfect ❤️", "gunavinamehta": "❤️❤️", "shamitaa_": "Rega, your writing is so comforting. 🌸", "tub_zee": "This is beautiful", "sumbulusman": "This is beautiful", "dhananjaicharan": "Didn't know you could put a comma after '!'", "riddhibangera": "This is so beautifully written and expressed❤️", "alluring__chaos": "So nice yaaaa", "occasionallynormal": "💜💜💜", "ayushikroy": "Many parts of me needed this. Thank you Rega ❤️❤️", "pranidhidas": "@thegourmandizer", "hinghanghong": "❤️❤️❤️", "smittencurve": "This is so beautiful 😭", "pranitart": "To uncertainty ✨🥂 ❤️", "gehnakundra": "THIS IS SO BEAUTIFUL", "wear_urstyle": "❤️ Beautiful", "kanika.a": "@architagoyal read this!", "nazreenfazal": "So beautiful Rega! Took my breath away ♥️", "sara_ki_duniya": "❤️", "_shubaika_": "❤️❤️❤️❤️", "thisjenlewis": "I love you I love this", "itanya_gupta": "Wow. That's one of the best I've read in like months. ❤️❤️", "kanishka_saini_": "This is just so fineeeeee ! \"Life takes it's time with it's punchlines\" this will stick with me for a while.", "theheirofgandhi": "Love this read! ♥️", "master_shifu27": "Lovely @regajha 💜", "riachauhan12": "@stutisareen 💕", "nikhitabajaj24": "You write so so well! The way i could feel the emotions penned down in this note - they became a part of me and would definitely keep coming back to me at different points in time - when i’m thinking about life! Just want to say thank you for writing t! ❤️✨", "aliceoncaffeine": "Write that book already ❤️", "appleonthetree": "So many of us are waiting to turn the page, in our lives. Hoping that the next plot twist the good one,", "i_am_lil_dippy": "Beautiful, Rega.", "ayman.gulzar": "I love you ❤️", "varshitha.01": "Beautiful!! ❤❤❤❤", "jazzminefrancis": "Read this. It’s what we talked about, beautifully drafted! ❤️ @drkulkarnipooja", "areenaqureshi": "❤️", "mani_s528": "Just lovely 💕", "niki_the_traveller": "❤️", "farkhandazahoor": "So much love and power to you Rega! 💕", "devikapatel1": "💕💕", "champarani": "🎈", "fernweh_akira": "@regajha you are amazingly amazing!♥️♥️♥️♥️", "watermelonysmiles": "Girl write a book so I can buy it and cherish it forever thanksss", "annmariabx": "I've found this soothing and anxious- the good type that makes me want to practise patience. For the, 'more-than-the-20th-time' inspiration, much thank yous to you🖤", "shuklaain": "So so beautiful ❤️", "_shraddhadabral_": "This is beautiful😭😭", "anshsanyal": "“But somehow in this grieving, I’m not actually sad. I’m just itching to turn the page, to find out what happens next. All I feel is curious” - ♥️ 💯 That hit hard coz I’ve been there sooo many times. That curiosity is sooo worth it. Keep at it.. and my god.. keep writing!!", "youtubewaliaarti": "“It takes years after the happening to know what really happened!” *HUGEASS SIGH*", "lifeslongpreperation": "“It takes years after happening to know what has happened” “life takes time with its punch lines” “you don’t know yet where in the story you are” Quotable much?", "abhishekr02": "@sappysnappy @safiaally_", "kinzakhan008": "This is so so so beautiful", "seepagrawal": "you know the moment you read something which significantly changes your life? this is it for me, in such an incredibly long time. thank you Rega :)", "bhavita.kumar": "How you manage to always find the right kind of balm to soothe the days and file thoughts away is beyond my comprehension! Thank you for writing @regajha ❤️", "bhoglechinmay": "This is really good, Rega :)", "poojadhingra\nVerified": "Verified", "secret_introvert": "I don't think I have read honest prose like yours in a long long time. ❤️", "kashmirichai": "Beautiful 🙈", "christinahpaul": "This is ❤️", "lightatheendofthetunnel_": "You’re coming to Goa yay❤️", "indianmentalist\nVerified": "Verified", "sujanarajgurung90": "Best piece of writing I have read all day thank you!", "sanasangli": "you don’t know how much I needed this. thank you.", "sarahkhalkho": "💖💖", "pritesh.arun": "I live in Mumbai and always thought will meet you some day but now it seems like the probability is now got more lowered. Perhaps someday will head-on with you ! I hope that your story plot gets a twist which is even ahead of your imagination and is Beautiful and Human just like you 🌸", "aashnasanghvi": "Amazing ❤️", "sakina.dohadwala": "Love this 💗", "theopanna_": "beautiful 🌻", "meerananda": "So beautiful ❤️❤️❤️", "invisible_trooper": "Reading it hurt me, so I can only imagine how much it must’ve hurt. Be good.", "happy_lanes": "This is so beautifully laid out! :')", "travelshenoynigans": "@namyamehra", "sprousespouse1": "❤️❤️❤️", "mindful_troubadour": "✨🌸", "whatboutpriya": "Loved this...thank you for telling me where I am :) haha", "gogoi_krishna": "\"Just itching to turn the page....\" Relate level 💯", "will.e.wonk.a": "Thank you so much!!! I needed this today.", "thestarkguy": "♥️", "riaparikh": "So beautifully written ❤️", "thelazyinsomniac": ":')", "thnx4daalchawal": "You 🥰", "bestmekaever": "This is so beautiful, Rega! 💕😍", "blumdumdoo": "Rega!! This is so damn beautiful!! 💜🌸", "ishasharmaaa_": "Beautiful! 💙", "ssmehrotra": "Love it! When the hero of the film is being beaten, you just have to wait for the climax. We're all heroes in our individual lives. We always win. Eventually. Until the next story begins.", "himalayan.hilbily": "I don't know if I've come across more relatable post more recently", "saur_casm": "Irritating how Instagram isn't accepting longer captions. Beautiful writeup ❤️", "pritibharath222": "🐝 Sooo good well written.. as Steve Jobs said... you can only connect the dots looking back..", "saminders": "Amazing 😊👍", "christie.maria91": "This is ssooooo beautiful ❣️❣️", "uddgaye69": "SO BEAUTIFUL.", "pyjamastheterror": "This is beautiful 👉🥺👈", "aastha.vij": "You are a wonder💕", "tanmaybhat\nVerified": "Verified", "tynevillan": "@praisemasilang", "drish.krishnan": "Something I really needed to hear today. You're one hell of a writer @regajha ❤️", "tumultuoustwenties": "Now you can relate to all the cancelled Goa plan conversations! (Your words are therapeutic)", "aakankshagupta175": "Your writing is so beautiful and candid. Thank you for sharing once again 💝", "swatisaini_": "Beautiful❤️", "theinternetnargle": "Thank you so much for this I really really needed this.", "peelijay": "So so beautiful and moving!!!", "ananyagee": "Can I see that desk please? ❤️", "sweta_priya": "This is beautifully written, ❤️❤️ :)", "nikhitakini": "Are you even real Rega Jha 😡😭 Are you an AI that has studied every emotion that was put out on social mediums by vulnerable people and is now giving us reality checks and forcing us to self-evaluate? Just say it 😭", "sangeethasivaraman": "So beautiful 💕", "kunaljain23_": "Favourite for a reason ❤️", "thefoodietrails": "Yes, the bougainvilleas are in full bloom. And splashes of colour take you by surprise at every turn . And a few months back I actually happened to go to that lovely light filled room in Goa 😊. Your story resonates in more ways than one, the lane ,the wits end ... Have been down that lane and that road ( metaphorically) I found one in Goa itself 😁 . Also the fact that we are used to reading books with a beginning and an end, we each have had to bookmark this time, waiting to read what happens next.", "pranavi_tan": "had me cryin @_the__bro_", "deya_777_goswami": "This is beautiful! ❤ Also taking a moment to thank you for being so Amazing and yet so relatable and for making me believe \" this shall pass too \" and that there is a lot to life coming up for me . Keep inspiring ! ❤️", "illuminitii": "What font is that?", "pratulnoshade": "💞💞", "richakoul": "You write so beautifully everytime♥️♥️", "priyasometimes\nVerified": "Verified", "sehrish.hazarika": "Beautiful. Just like you. 😘❤️", "realsidt": "this is beautiful", "goodslice": "♥️", "shriyakrishnan_": "This is so beautiful!💞", "pragyagi": "“...the knowledge that life takes time with its punchlines.” that is a master stroke of a line. a lovely, succinct way to capture a feeling I have felt for years. Thank you for your work! 🥰", "kaju_advani": "This is so well written👏 absolutely beautiful😩 loved it❤️"}