{"prateekeetarp": "High on symbolism 😍", "khushi.agarvval": "Stop being such a hater.", "dikshaa.22": "Stop spreading negativity", "mufffin.head_": "oh shut up !!!!!!!!", "rashim.bhandari": "If you have a better plan then kindly tweet him, if not then dont post negativity🤦🏻‍♀️", "amansadathia": "Critical thought is sometimes a rebel without a cause. And here you distract yourself from the distraction with another distraction. Good luck !!", "viinii.sharma02": "Yas. Exactly.", "_pranjalnaik_": "Seriously?!? I can't believe this post", "devina.medda": "🔥🔥🔥🔥🔥🔥🔥🔥🔥wah wah wah wah", "c.nikitha26": "To all the people talking about negativity...health care workers don't need your claps, your candles,you banging your utensils from tour balcony. Sure, being appreciated is nice. But you know what else is nice? Protection equipment for those who are fighting this from frontlines. Compact solutions for the management of essential workers. This isn't to criticise the what the govt. is doing. This is to urge you to think critically. Stop praising the govt. for doing the minimal of the minimalistic things. The point of democracy is to ask your govt to work for \"YOU\", the people, who have elected them into office to work for you. Health care professionals don't need your positivity. They need protection.", "coolguy262007": "But u won't ever work to become a people representative,and yes Galti criticism is easy", "harshactually": "Fuck you!!!", "avelinadabreo": "Hey there is an app for repost !", "vaibhavshree.shekhawat": "Haters gonna hate hate hate hate hate...shakers gonna shake shake shake shake shake...shake it off shake it off #stopnegativity #stophating #createdonthate 💙💙💙💙 what would have u suggested? What should be done? Please share your precious insight...and enlighten us!!", "millennial_lettering": "@singhleton this is so amazing🙆🏻‍♀️", "sahasubhradeep": "Love u for this post @regajha ❤️", "shachixoxo": "Morally pathetic sick mind can write this. Specially at this point of time where we actually need to stand together. For each other.", "_vaish.navii": "So wt have u done about Corona virus yet🤩that u think u r capable of saying all this", "prarabdh_raj": "Yes ' being distracted by absorbing the negativity. '", "_kirtisometimes_": "Because of your negativity toward honrable prime minister I'm gonna unfollow you 😒", "be_goth_am": "The truth never did require many words", "umaira.c": "Love and support this. Stay real and be honest. 😊", "namrata.gupta14": "🤣", "the_anomaly_girl": "Distraction for what exactly ??", "yuktie": "Repost for Instagram is the best app for reposting. All it needs is copying and pasting the link of the post you want to repost.", "jain_sapan": "Also I would like to kindly say this that we discussing things here on ig have the privilege of online entertainment, cable TV etc and we partake in it too.. Bt a big part of population doesn't and for them this solidarity Cal means something.. Empty days and free mind of theirs must be so caught up in negative thoughts for them this is the therapy that you so actively talk abt and promote as a part of the awareness for mental health..", "san_d_trader": "unfollowed tc", "bhagy3sh": "I have so much to say .. but i just can’t waste my time on someone stupid as you!! But to help you grow in your bs career one tip from a nobody :Please before posting/tweeting stuff please back it up with some context, have supporting literature, compare with others, and when critiquing policies please suggest better ones.", "dubey.jagriti": "Tmhare jaise bullshit writer mil jaye India ko.. inspirations or motivations dene tohh.. Pakistan ki jarurat hi nhi hme.. shame on you @regajha", "unknown_filmmaker": "Well said!! 👏", "rajeev.kumar.insta": "What the hell she thinks of her self. Don't have any respect for our PM. Leftist Bitches, you have been unfollowed.", "_swatantrayadav_": "Well said 👌", "roshnibleh": "How do you sleep at night with all that negativity in you?", "ankitbanerjie": "Leftist in India are more into promotion of what so called “Corona Jihaad”. I appreciate their cause of getting jealous of Modi. As leftist are criticising Modi but all over the world people are following what Modi is making people follow in India.", "workinprogress.in": "👍👍", "5sensesandmore": "Pls see the bright side. I think these 5 mins and 9 mins brought the country together. Forget country, Within our block of flats, I could totally feel that. People really loved doing that together from their balconies. On the other bright side, our PM knows the seriousness of the pandemic at hand (hence the country wide lockdown) as opposed to many other countries’ leaders who just denied the seriousness upfront. Can we even imagine the mammoth-ness of the decision to lockdown or not weighed against what will happen to certain sections of community and the economy at large? I can’t even fathom the number of things to evaluate before making decisions for an entire country. Our country’s population is such that there’s always groups of people hating those decisions. But given that the issue is at hand is that of survival - our very basic instinct to survive, let’s all be nice to each other so we get through. 🙏🏻🙏🏻", "jus_sneha": "influencers being so negative for our own nation!! if nothing spread love!", "varsha_kumarijhala": "You can hate the government not the country. India is at better position. And influencers should put their energy in keeping people at home. Instead of complaining about every move government takes. Aware people for self safety", "singhleton": "🙏🙏", "yogeshbiyani": "The words you have embroidered are completely true. We are indeed addicted to being distracted. Every human is. But in this case, distracted from what? I hope you know that the lockdown will be extended. It is needed. But here's the catch, it's not so easy for everyone to understand and grasp that fact. People will need to stay inside for more time. And this more time is indefinite right now. As an Indian, you must know how difficult it is to keep 1.3 billion Indians under discipline with sincere instructions to follow. With so many people frustrated from being able to do nothing, I see this 'distraction' as only a positive act of hope, and there should be no wrong intention attached to it. Moreover, when it's about our country's preparedness for the pandemic, I think we are taking the right steps at the right time. The foremost being attempting to limit the spread that comes along with a big tradeoff of slowed down economy. It could be my lack of information but honestly, I haven't seen articles/complaints from doctors/policemen that they are not getting enough support from the government. The only thing this whole world needs right now is to slow this down. Slow this down, so that the available medical facilities shall never get overwhelmed by the number of patients to treat. So that no such person dies who could have been treated and recovered just because there is no bed. What we should be focussing on is, keeping calm, supporting the govt's actions, staying interested in life, following the real instructions, and all this while continue to improve and increase the healthcare facilities so that the overwhelming situation may never arise. If you really have questions into masks availability for doctors and other healthcare equipments, do check out the Ministry of Health Welfare updates on their website. Stop blaming the PM for everything. Even the best of the countries (will all the money and technology) are unable to cope up, and they don't even have to handle citizens who would garba during the lockdown. So please, instead of spreading words that will only make people question their faith in the govt. and its instructions, convince them somehow to stay in.", "justexpressyourselffreely": "कंमेंट्स पढ कर लगा के मै गलती से Republic bharat के पेज पे आगया 😂😂", "aritreeh": "You are stating a fact. We need to address this head on in order to have a different future, a change in the disfunctional structures and oppressive systems beyond propaganda. And hence, must call out propaganda. Even if the voices are marginal they should not rest in silence. Anyway, there's a reposting app. It's not inbuilt here", "akanksha_bn": "Most people are going mad just having to sit at home, doing nothing while he has to take decisions for 1.3 billion people and hope to do it right coz guess what? This is an unprecedented situation for ALL of us 💁🏻‍♀. And by the looks of it, he's getting a majority of it right.. Just compare the number of people affected and dead to that of some countries whose healthcare systems have been ranked HIGHER than ours for many years.. But you're probably right ma'am. The one 'mistake' he's probably doing is not telling people enough of all the things he's done to control this pandemic (which has gotten global recognition and applause), which is leading to everyone mocking the things he's doing so people don't go crazier than they already are going! #givecreditwhereitsdue", "dhanush.chandan": "Can't say much to ppl who can't give gratitude. Some one rightly said gratitude cannot b preached.", "tara0gemw": "Hi y dont u like the concept of showing solidarity ?", "ansh.chrs": "So if people of other countries are doing similar thing then people are like \"hats off they doing great job lifting spirits of people amidst the tragedy\" but if happens in your country then it's \"stupid\" and senseless. I just don't understand these double standards. These acts are not distraction its a way to keep people's mental health in check. There is a lot of stress and frustration among people small things like these give people a sense of control. Of course those who overdo things are doing it wrong but that doesn't mean that entire idea was wrong.", "curiousreader1301": "It's very irresponsible from U miss Rega.... people keep abusing him.... he is not saying that this will kill the disease and this is just to unite the nation and name any other national leader who can unite the country so effortlessly for any concern.... stop spreading negativity, it's already choking everyone..... and if u r so hatred with his ideas then come forward with ur own....", "afrohead_harsh": "I'd disagree with what you said. I've been following you since long and just love your content. But here, it were some stupid ass people who should be blamed for the shit happening. Modi just tried doing something to cheer the people and so were everyone around my place. Blaming the intentions and the thoughts of someone is something wrong I feel. No pessimism I'm trying to create here but just saying what I felt could be true.", "the_uncurious": "A question, what would you want to do in an ideal scenario", "mehekmehra93": "And slaves !", "lovlacious": "When we all are coping up to stay positive , our PM makes an effort to break the monotonous routine n negativity we all are in ... he should be appreciated 🙏🙏", "aakashtuli": "Thank you so much for this. When an average citizen of india could anticipate that this stunt will again give people a reason to crowd in places... Why couldn't the PM?", "psychedelic_night": "Okay guys, @regajha is always being positive. If she has opinions, the least yoy can do is not put a damper on it. Don’t bring unnecessary negativity to her life, no? Let her have her freedom of speech and thought and let her shine. It’s her account and her mind, at the end of the day.", "aarushijain92": "Hey! Whatever happened to you emitting positivity. I miss the Rega that was so full of sunshine. I understand raising voice against something inappropriate is totally justified but this was a simple thing of lighting diyas. Let us not spread negativity please.", "sumit_gulati": "Did you misspell dictator and dictated?", "tathaagata": "A 100% true thing which you have written. Our PM should have known after that 'thaali bajao' task that a lot of people in India would take it to the streets thereby violating the prime reason of this lockdown which is social distancing. The initiative taken by our PM was good but not applicable to India because of some people.", "srikaanths94": "Keep crying", "dr.ravenclaw_": "Wow", "dhiraj_chaudhary": "💯", "rahulshivanicrazy": "You are the prime distracter... 🔥🔥", "crazykhyati": "Download Repost app and login from there and then share @singhleton 's post. @regajha ❤️", "gauri_kothavle": "@aastha28 reposting problems are common 😂", "prateekakamath": "Why add more negativity to a world that's already dealing with so much tragedy? I miss your optimism when we need it the most. :/", "sayjalpurohit": "So so so apt for our country and it’s janta.", "themysticforce": "You have to download a separate app for reposting and then it’s self explanatory from there 🙌", "chatakmatak": "So so so so true! No news on how much fund received, where is it deployed.. All mann ki baat is just a distraction..."}