{"charmitrevadia": "I feel this in my soul.", "_susanna_e_": "Beautifully written❤️", "aanandnama": "Aah!!", "pathak_purva": "So beautiful, so real!❤️", "ann.wesha": "oh my god this 🙌", "thebluesheeptirthan": "It has been tough to explain to the men around me why I ALWAYS carry a can of pepper spray only when I'm in my town. It's hard to explain why I am still on the edge when the threat of being attacked by the number of men I have pissed off in my life is a thing of the past. Why I am moving my can of pepper spray with me from my car to my house. It was hard to explain to my friend while we were camping and some people who knew me saw us pitching our tent up there, why I was stiffing up everytime I heard a footstep or a branch crack, ehu couldn't sleep all night. Our lives are always spent under the shadow of an immediate threat to our lives. Everytime I am scared of something like this the only thing that keeps me sane is that can of pepper spray and my husband's company and that is a pretty fucking shitty existence. Everytime I hear/read that women are most likely to be killed or raped by someone they know, I clutch my can of pepper spray tighter, I plan out a million escape routes in my head and distrust every man who I know has the power to hurt me in the back of my head. That's one of the reasons I cannot wait to get old enough that no one would want to hurt me, call out after me, rape and kill me. Thank you Regha for writing this. It needed to be said ❤️", "gaya2.0": "Omg this. It is exactly what I have been thinking about for a while now. That \"finding yourself\" seems like a man's pursuit. It also seems like trying to ape their behaviour and thinking. Where to find yourself has also been told so eloquently by the men who were privileged enough to do so. So maybe it is time for women to find their own way to do it which need not necessarily be the same.", "purvai.soni": "Glad to know that I am not just \"too paranoid\" and others feel this too", "ananyalovesfood": "@vivs96 caption", "nidaa_jkay": "Woah🔥", "mounicabattula": "Damn Relatable!", "mudita.ppt": "you put it into words", "ummyeahokayyy": "I love you. Thank you for this", "maithili_pai": "@rewamarathe", "panthi____": "You need to read this. @shreyamalhotra__", "rinbee2309": "@ashutosh_bawa2311", "neenasinghart": "Wow so wonderfully expressed ..even in fiftees i relate to this ..😍", "_________smitraj_______": "😍", "vanrikafish": "@urvikins", "mariajohnsmiles": "@benitha_balu doesn’t she remind you of @swathyajay", "jjaypal_99": "Hola amigo😍😍😍💞", "miss.chanandlar.bong": "didn't even realise our frame matches", "samikshasant": "@aditijoshi_007 Dude! Ye lipstick color 🔥", "yatrraa": "May i know that lip shade please 😊", "satannyst": "what did we do to deserve a queen like you, rega 💖", "the_curly_chaivinist": "Uff. This is so beautiful and real❤️", "ritiindia": "Gosh! This is so relatable.", "sanjeevjha99": "Stunning ❤️", "autumn_of_harmony": "This is beautiful beyond words 😭💞", "timoxylinbarbibutanol_": "Its a beautiful piece. The way its been thought, its really different. Its so try yet we never noticed it. Its just amazing. 🔥🔥", "moohblooh": "Beautifully written and very relatable which is actually so sad.", "vaidehipathak_12": "This ♥️", "ramyahasu": "Awesome ❤️❤️", "jesila_rathinam": "@regajha thanks for this rega.... so beautifully written and i hope i can write like this some day.... please write a book and hoping that will happen soon...", "feministalert": "@kaafi_chaotic max relate bruh🙄", "unruly.like.my.curls": "Just wow!", "spilled_luck": "This is the most unsaid thing about soul searching. I've felt like this every single time I've stepped out, away from my family to sit in peace. You put on earphones yet constantly turn your head around to make sure no ones creeping around silently.", "twilightfairy": "Even though I shd be careful in such situs, I end up running towards the alarming thing! Not always wise 😛", "sakshi____shetty": "Thankyou for this❤️", "stutiashokgupta": "Damn girl. This is so well written. Thank you for writing.", "_sassysha_": "I swear! First women weren't allowed to do a zillion things and now that they're allowed, they're threatened to do them! Screw patriarchy, damn!", "evlynsam125": "@pinkygolacha", "anubhadeshpande": "All the words sre absolutely true . I was sipping some green tea in my patio last night peacefully and I heard some guy singing in distant. Living alone and thinking of someone knowing about my tea time ritual took me back to criminal mind episodes. I went back in and disturbed the entire zen moment .", "saloniidesai": "Oh my God, I've felt the same way too often. Every time I'm alone on a bus or travelling for an event.", "donanela": "Heartbreakingly true 😕", "jeneatss": "I feel this. ❤️", "bibliophile_rashi": "Beautiful😭", "whatinvalhala": "This is really sad but really amazing❤️", "_bhavahni": "Hi Rega, Sigirid Nunez expresses something similar in 'The Friend'.. on how women are often disrupted in their attempts to saunter..", "ankita__pattanaik": "Can't wait to read the book that you're going to write.❤️ You are a blessing!!", "lawideer": "Sad but true. Thanks for sharing it. I love reading your posts.💕", "kunaljain23_": "Ma’am please write a book. Also please create a mini clan. Also please let me in that clan. Regards", "niki_the_traveller": "This is so true, but also so sad.", "anjykurup": "Wow", "kitikat06": "Your words ❤️ you are a gift to all of us telling that it’s ok.", "purnimajhaa": "@niharika.prabhakar @saumya2803 @neha_padbidri caption guys", "ishhhhita": "@chehek4228 chak le mennu", "pranitart": "Your words, Rega ❤️", "litty_s": "@kirimuthyala @fontinaz ....... @kirimuthyala something she says about women in Athens is gonna remind you of somebody from work 😂😂😂", "_sreya.r": "Your words create a picture more vivid than ones imagination, and more compelling than a painting ♥️", "theliteratepassion": "This is brilliant!!🙌❤️", "pooja.tiwari": "Hey!", "pt.anecdote": "“I wonder how my mind will ever be completely alone in the wind and still free enough of jitters to sink into itself. This is near unheard of for womankind” - I felt it and it speak me out and may be many other women siting in her hype city life and visualising all that you drafted.", "veebee97": "Eat Pray Love and Wild are perfect in fiction. In reality, they always seem scary to do. Women or people in general may have had successful solo trips. But in reality, it's always a gamble. 🙈", "priyankakallem99": "Beautifully written and relate to this so hard. For me, walks alone in the night, or trying to find a few quiet moments on rooftops to see the stars have underlying tones of fear. All the voices and footsteps I hear, immediately make me jump and ruin whatever moment I was trying to have- my next goal just being to get home, to be safe . Male privilege once again, men can do any of this spontaneous, nature-loving, random adventure stuff without that same fear.", "raa.she_": "❤️", "beautifulandthedamned_": "@atul_mishra__", "_roshnasadanandan_": "This is so beautiful 💕", "ayushikroy": "My heart, rega. ❤️", "anushree25": "Of all the posts you’ve written, this is my new and forever favourite. The sheer reality in this is overwhelming. Love it despite the sorry state of affairs outlined in it.", "alexander_sandraa": "This is art.", "_.roshnibasu._": "This is so beautiful. You put it into words! What a wonderful, wonderful piece.", "preeti_kamath": "Deep", "darth_enfys": "This is so aptly described , it hurts. Thank you for actually wording what every woman deep down fears and curses❣️", "benaresi.lass": "Loved the last thought😂❤️", "roastmaloneee": "It's not only that women are threatened, I feel it was only because you were alone. Even I would have, even after having travelled a lot, protecting my girl like Mike Tyson and flexing abs on every party, taken a back and sit quiet in the room. Well, but this is not what I'm wanting to convey, I want yo drive you to this fact that how I feel we have misunderstood the legends. We've been told that solitude is the best way to find ourselves, but those who have found themselves were always with the nature. So when we looked for ourselves and our highly frightened souls into the books of Dostoevsky or Orwell and crawl inside the bed, we miss the monkey-gathering or coconuts whispering -- not that they would have been helped to find ourselves better than Woolf or Fitzgerald have, but that it would help us to keep a company with nature that helped \"them\" found \"selves\" that wr are seeking. Just this. Only.", "6nidds9": "Waiting for your book @regajha", "confondue": "This! I relate and feel this on solo trips so much haha🙈", "dulhanmeriazadi": "Regaaa please please write a book!!!", "leo.lion1851": "What a great read, thank you 💥 @regajha", "_thesupergirl": "Omg! Loved this! So relatable ❤️", "aishwarya.img": "@beingpaulo_me", "merlinmaria__": "thank you for this!!❤️🌻", "pure.heroine96": "I can't wait to read your book.", "divyapreet_": "💔", "natashanoel001\nVerified": "Verified", "vara_raturi": "Beautiful. And so true. You need to write more!", "jeni_justine": "😱😱😱😱", "_chit1_": "So beautifully written, I just cant even", "vanyajaiswal": "Love this so much, Rega! I don’t think I’ll ever be able to go on a solo trip, for this very fear, no matter how much I want to. Not in this lifetime and definitely not in this body of a woman.", "anaganibhavana": "You once said that “what we go through is some where felt and written “ for us you are the one making us realise that what we feel is normal. Kudos", "mandiravirdi": "Beautiful 🖤", "sunpa01": "You are so, so admirable Rega. Always look up to you. 🌸", "__monicakoshy": "❤️❤️❤️", "theshreyansjain\nVerified": "Verified", "samriddhipandey": "♥️", "beverly.d24": "look at you writing and all 🙌♥️", "pearlparekh": "so beautiful", "shmoonshine": "Nice lipstick what shade", "neha_writer": "Every word rings true, Rega. And it makes me so sad and angry that it does.", "devikapatel1": "You naaaa 🔥", "kishiyolo": "I love this is on so many levels. Levels, I didn’t know existed before I read this💕", "iamjagritip134": "Such a GODDESS 💕", "prateekakamath": "Your imagination 🌟", "vs_photographyofficial": "🔥🔥", "kasturilutade": "This is just Profound!", "ananyagouthi": "This is so relatable unfortunately 😭", "aarushi01": "@manpreetsgarha", "shaviestaa": "😭❤️", "j.shroff6": "Regajha why are you? so amazing.", "anujgosalia\nVerified": "Verified", "akankshaa.mishraa": "💛", "swaraangi_shukla": "@oh_i_forgot_that_you_existed read this!", "nishnu": "This hits home. Thank you.", "gaythrimadhavann": "Sadly on point! Well written, as always 🙌🏼"}