{"nitu32182": "❤️❤️", "ridhymic": "💙💙💙💙💙", "pillochhh_": "❤️❤️❤️", "hema_loganathan": "@mandalacious", "michaelkaynes": "And that's how capitalism begins.", "devangtewari": "Superb😇", "girl_who_draw_": "Makes me think, is the character of Damini Rizvi Roy from Four more shots inspired by you?! 😍🖤", "shifa_khan18": "Check Dm for Brand collaboration", "karthik._.gopal": "Too much to read♥️", "insanely_poetic": "I relate to this story so much! I was also depressed but I kept my calm by writing my thoughts and converting it all to poetry. I hope to complete my book soon. Keep inspiring Rega!!❤️❤️", "saman_khan12": "This just broadened my horizon of it means to follow the loose threads. Thank you for making it easier for me. Life these days is confused and confined. 💓 love you", "_kiarak02": "Wow so good 😘😘", "shrutijha____": "💜", "u20kars_h": "Dear Rega, You have no idea how long this is going to stick with me. Sending lots of love and positivity. Stay safe and healthy ❤", "uditapiu.99": "Love you rega!❤❤❤", "misha_gada": "❤️❤️", "fammamalik": "Im crying 😭", "sushree_art": "😊😊", "jasperinthangavelu": "@kristen_sylvia - Check this out!", "tushar.wasake": "❤️🔥 story", "chhamiya": "\"Joy isn't something you perform\"", "jiasingh": "Loveeeeed reading this especially that last line ❤️❤️❤️ thank you for sharing this 🤗", "jhumnapahuja": "If you have this kind of clarity at such an young age .....you are doing well in this journey called life ........! ❤️", "snigdhachowdhary": "Lots and lots of love to you @regajha ❤️❤️❤️", "_meet_mahesh_": "❤️", "banhi18": "Needed to read this today. Again. ❤", "casually.hopping": "I loved what you have written. As I read it,I felt like these were the words l needed to hear today.", "shefa28": "@shefaalid a reminder for our sed class'2020 feelings", "storysailors": "This is so relatable and more power to you for this. 💜💜💜 @regajha", "adityanarayanh8": "Inspirational ❤️", "bubble_in_the_ink": "Thank you for this.🌸 🐣🥂", "garimasortey23": "couldn't relate more.", "utkarshatakalkar": "❤️❤️❤️", "puppyshame": "You did not lose weight? Why??", "simranwashere": "❤️❤️❤️❤️❤️", "avantinagral\nVerified": "Verified", "meerananda": "😍😍😍", "divyabydivyaanand": "❤️❤️❤️", "maesterofnone": "❤️❤️❤️❤️❤️❤️❤️❤️", "khanjanhariyani": "I felt every word of it @regajha and this was the first time i was reading you. Thank you for giving words to my feelings and emotions burning inside me. It feels good to know someone felt the same.💗", "alkapuri91": "Rega... what a fantastic post... so true, relevant and from the heart ❤️... wish you continued success and happiness as you forge ahead ... lots of love rockstar 💕", "roja.pvt": "Wow❤️", "chiaoscuros": "❤️❤️Moments to remember.", "neelam.s": "❤️", "tanyadjoshi": "❤️❤️❤️❤️❤️❤️", "themissfit_girl": "Loved reading this 😍💕", "aanchuziastaa": "❤️❤️❤️❤️❤️💯", "srishtigupta_2905": "So happy for you 👏👏", "rashmutalik": "🙌🙌❤️❤️", "karishmasoch": "❤️", "inshiyald_1": "@mohdbengali", "niharika_mahajan_15": "I should have thanked you a year back, but better late than never!! Thank you so much for sharing your story, because somewhere it helped me a lot!!! 🙂", "vineetsarna_24": "I don't know the future , I just know that i love you and you are such an example. For writers, women, for humanity and thank you for being an inspiration.🌼❤", "_anukritisharma": "Much needed at this point of life❤️ feeling so relaxed", "24savannah_": "cheers to you!🌸 the girl who taught me to love your own flaws and make a peace with it! thank you. hugggsss", "nobreadbutterjob": "You are such a gem of a person and a big inspiration for me ♥️♥️", "eshnakutty": "Aaaahhhh! ❣️ The last sentence hit home! Thanks so much for sharing this Regaa!", "rekhay_97": "👸", "shradha2202": "@regajha \"its knowing who you are when no one is looking\" that just hit so deep.. most thought provoking reads.. all the best for everything.. ❤️❤️🔥", "bonfire_heart90": "♥️", "blissful_banjaran": "You know, there are things we are well aware of but don't really understand it in its essence until a certain someone reiterates it, maybe with no idea that their spoken words are gonna affect someone so much that it changes the way they look at things and life in general, for me you are that person Rega! Needless Isay I love you", "ravisha93": "I really needed to read that rn.Thankyou for resharing, @regajha ❤️", "mudita.ppt": "Love you", "thelostwords00": "🌞", "sanasangli": "@regajha bro who are you. I love you", "mansi.raut_": "ma'am you inspire me :)💖", "prathyusha_chittala": "Always an inspiration 😍", "the.ashish.saha": "Aye 🖤🖤🖤", "anushka_dhawan": "I feel you.", "lifeandlaughters": "I feel like this is my story. I quit my job because I felt anxious and envious all the time . But during the time I spent by myself I realises what j really wanted . And I am much happier now after I started all over again", "curlyshma": "@running_behind_pizza Rega! ❤️", "gurmeharrr\nVerified": "Verified", "rumyeah9": "❤️❤️❤️", "shyama120993": "❤️❤️❤️", "narmathamoorthy": "@vjyv7", "meowish.ali.q": "🌼", "janvivora20": "Wow❤️❤️❤️", "drkhushboo89": "Hi @regajha can relate to every word u hv written ..so strong that you came out of it.kind of resonate with ur life . sincere request if u could share the details of the therapist", "manyasharan": "proud of you♥️", "isamarsood": "something much needed at the moment! ❤️", "seeker_sr": "You are an inspiration. I love you💕", "blumdumdoo": "💜💜💜", "sakshijain2299": "So inspiring @regajha🌸", "nikkkhil_panday": "❤️❤️❤️", "adornedhavoc": "Hey! Its commendable the way you jotted down everything so explicitly and accepted that perfects are just a hole in mind and can create a hole later in hearts. Cheers to new you❤️", "devesh0303": "thisss❤️", "nismachauhan": "You know I often wonder that people who do eventually have it all are in the place to say omg you know what it's not worth it. There is more. I wasn't happy. I mean sure but I would like to check those boxes first too, be an achiever and then tell it for myself. @nudrat.kamal 🤷‍♀️", "aakashtuli": "What's your narrative now? @regajha", "rashionality\nVerified": "Verified", "tynevillan": "@praisemasilang mareeeeeeee", "veeresh_stig": "♥️", "udan_khattola": "@regajha was so independent by then that when HOB asked her to narrate her story, she said that 'it's already written by me, u guys just need to take my picture & we're good to go! 😹", "amit_sidhanii": "Love what you're doing. Keep up the work! 🙌🏻🔛💕", "tejaswinikabadi": "💜", "nousernameavailable98": "I admire you so much ! Wish you the very best of everything ❤️🙌", "neha.click": "Thank you, for finding yourself and hence helping others find themselves😍😍", "munazzasparklemerous": "Thankyou for writing this. More power to you. ✨❤️", "so.rahi.hai.sejal": "🙌", "regajha\nVerified": "Verified", "loveleenabawa": "Great going Rega. Wish you success in your search for peace and happiness always.", "nakshatra_rao": "❤️❤️❤️❤️", "disha_2454": "The caption is so gooood😍😍", "the.turningpoint": "👏👏👏👏", "j.nil_": "I really doubt if you would have changed before experiencing all those privileges. Once you achieve stuff you ever dreamt of only then you go to what actually you like. Plus, not everyone can do what you did. So more power to you, girl.❤️🔥", "rashmitha_rathnakar": "@rhidheema_rathnakarr @shantam.gupta21 why does this pinch.", "harita___k": "@sampada_deshmukh28 Read this.", "gauriibansal": "I love you.", "thisisayushjha": "🙏🙏🙏🙏🙏🙏🙏", "yesokayhaan": "❤️🙌"}