{"vaishalishashikant": "Thanks for sharing this.. ❤️", "stuffednstarved": "Hit me hard", "aadhya4": "Much respect!🙌🏼❤️", "shivoom": "Glad, that I followed you. Keep making this world a better place to live in. ✌. More power and love. 🌹", "florenceraj": "❤️🤗 @regajha", "ismileshk": "@toshu_happy_saint pls read the caption", "ku.kku_": "@dxvlxxna_ Read", "sonia.sabnis": "So so real❤️", "dabahety": "I think everyone would relate to this!! And if you don't, I seriously envy you.. jk😂😂😂 but I really loved this one. Truth for a change", "dhruvshah96": "@regajha You always have so much eloquence in what you write. It’s incredibly beautiful and inspiring. Nothing is more exciting today than an authentic transparent creator / influencer. This is celebration worthy. ⭐️🎈", "akshaya_shekar": "❣️❣️❣️❣️💗", "shraddha_mishraa": "Reality check every second person needed. This piece is gold🙌", "p.sierraaa": "Beautifully written ❤️👌", "roja.pvt": "This kinda inspires me to show more of our true lives on social media in life in general 😍😘", "abhinav.prakash": "@rukmoni Check out the post. Quite real.", "tootoku": "@haleymartins read how perfect this is. This person is amazing!!!!", "soumya_jainn": "💙💙", "bsomiya_25": "@_shruti.pandey_", "simrankaurgrover": "Thankyou, thankyou for this.", "unofficial_humanbeing": "🙏💕", "milindsharma2000": "Thank you Miss Realjha❤️", "hahaharshita": "Rega ❤️❤️❤️", "ms.muskan._": "This is so true and so real! 💙", "tewari.neha": "So freaking true.", "doc_ps": "♥️♥️❤️❤️", "meghabhat93": "❤", "y._a._g._a": "💯💯💯", "swarnaa_k": "I love you Rega Jha. I love you.", "et.tu.preksha": "Let's just be who we really are. Thanks for writing this.❤️", "rj_saru": "Now this is 🔥", "saaalanautanki": "Every person in the world needs to read this ♥️", "monicadharma": "Oh my God ♥️ 🔥", "purnima_sriram_iyer": "Thank you!!!!", "shrabani_rout": "@sonal_tiwari ❤️", "ujj.well": "I love you so much ❣️", "bi.popular": "❤️", "akulchamria": "So real ♥️💯", "sir_naps.a.lot": "Saying what matters. Saying it at the right place. Saying it like it needed to be said. 💯", "_kanishkad99": "This. ♥️", "shachiboltaay": "@__chetana__ read.", "akshay_k21": "True", "komalminz": "Ok I'm in tears now..this above written caption is real...god damn real shit we need to read and realise that it happens with everyone ❤️", "iamlendu": "@aknee_79 pura padh caption", "himanshi0312": "@shrutiimaheshwari19", "shreyashi_j": "Oh my! Wow! This is wonderful. Thanks for sharing @regajha ♥️", "aditi_unplugged": "❤️❤️❤️❤️❤️ I have been lately feeling the pressure that maybe I am not happy enough.....about endgame.....it's not that big but @regajha u put it so wonderfully😍", "_.roshnibasu._": "Wow.", "nishchithahahahaha": "@princess_morbuckss read the caption.", "shoumik_g": "@ritika.tripathi caption", "agrawal_rupal": "@nightwing0 Read this", "shilpaajoseph": "YOU ARE SUCH A GEM", "anniemookerji": "This post..... To be very honest, I started following you on Insta very recently, like a couple days ago recently.. But now I understand why @shayan_roy or @srishtipatch posted things about you the way they did.. Your everyday stories or posts like these talk about the ugly, gritty, honest everyday life and the mental (and/or physical) situation we carry or experience every single day.. This particular post actually brought tears to my eyes coz of the immense and hard truth it held.. I speak for myself when I say that sooo many times I feel I lead a meaningless life. Nothing new happens.. I sit n smile n laugh n be cheerful but CANNOT show my sadness or pain outside.. I feel a pressure coz everybody knows me as this \"happy-go-lucky\", extrovert person n I feel like I have to carry out this facade for them n for me coz showing any other emotion would act as a betrayal.. So I go on smiling.. I become honest with everything else... Just. Not. This.", "tavleen1109": "@_being_creative_by_ashima_", "neeleshaaaaa": "Thank you for resharing it Rega!", "roosshhh": "@ayushi_awale literally sabbai Janna nai hami jastai ho k lals 💕", "richabigghe10": "@rbigghe this !", "modibutbetter": "@mitushi_bomb", "oniondairy": "@no_one_but_jackson please. Read", "saumyashukla__": "@shivanshishukla", "selenophile_n_stars": "💖", "tanyahasan3": "@archana_manmohan Here! Read this.", "raikaaaaaaaa": "@antithesis89", "anjalilal": "This is sooo inspiring ❤️ Thank you!", "bhavana_dandu": "@sneyy_134 tell me if you relate to the caption", "sreyabose": "@sennistic", "saumyamadan": "This is sooo nice @mehta.aishwaryaa", "meghaiyer12593": "❤️❤️❤️❤️❤️ @regajha", "himalilad": "@apurvaa.s @saylee_lakhe @aashika_vichare @p_vaishnavi caption vaacha❤", "whimsical_wallflower": "Gotta bookmark this one 💛", "nellymirchi": "❤️", "ishandthat": "Beautiful ❤", "thereser90": "🙌", "smita.kumar": "Thank you for this 🌻", "eshasshah": "This post is beautiful. Thank you for that.", "dianedragan": "⭐️", "thebuskingman17": "🖤🖤🖤", "noel_j92": "Absolutely powerful piece of writing", "beverly.d24": "i don’t usually read instagram posts with long captions but im so glad i read this one. very true and a really good reminder to everyone who’s addicted to social media (like me). thank you rega ♥️", "san.tra": "@tanyaakakkar", "mils": "Miss you @regajha ♥️", "esha__mishra": "This is actually the best summarization of all our lives, you put it really well.💙", "brokeymcpoverty\nVerified": "Verified", "madhur_malpani": "Thank you for sharing this. Finally have words for all my incoherent thoughts. ♥", "nishswish": "❤️❤️❤️❤️❤️ you're incredible inside out, with or without filters. Thank you for existing and making both this place and the real world better.", "thedakshita": "@shinjinijain", "awhisperingpine": "Thank you for writing something so raw. This needs to be reiterated. 🙌🏽", "nameeter": "Beautifully written", "ananya_garg21": "@prinstanshu", "richakaulpadte": "I think about this all the time. Literally, all the time. Major hugs 💛🌻", "shivamsr01": "Hear hear", "trulynomadly": "So. Goddamn. True. There’s no hiding from the fact that we’re lying on social media. Makes me wonder tho, seeing sad and raw updates on unhappiness and loss don’t make me feel any better. I don’t feel like I’m winning at life. So it’s weird how someone’s happiness makes you feel worse. 😕", "amal_saxena": "Finally someone says this!", "karishma_sehgal": "Thank you, Rega!", "nikitasahota": "❤️", "shalinisainath": "Beautiful message , @regajha", "the_krystalbug": "Feels good to have read this❤️🤗", "arunimajoshua": "🦄🌈🦄🌈 @vinitav27 yesterday we were like \"It's so much pressure\"", "rahulgarg_edu": "Fuck man! This is so damn straight! Thank you for writing this.", "smokey.kokila": "❤️", "sameeraappana": "Damn! 👏👏", "roop.tera.asthana": "That's the best thing that I've read today ❤", "rituu55": "❤️", "maliniagarwal\nVerified": "Verified", "lifeofpoo": "♥️ I loves u muchly Jha Jha", "twilightfairy": "Everyone does this.. Mostly because bad things are considered private while happiness is shared easily.. This is also why social media tends to give a good inferiority complex because all one sees is glitzy lives!", "nismachauhan": "You are love @regajha thank you for being you. 🙌", "o.m.g.kale.rx": "This is so real, important and significant! ❤️", "heshachimah\nVerified": "Verified", "nidzk123": "❤", "zahra_motor": "This is so true! So glad you've shared this. @regajha . Much respect. 😊🙌", "akankshajain.space": "♥️♥️", "sigynra": "Bless your heart @regajha", "theshenator": "This is so well written, Rega. So glad to have read this 😊", "duskendale": "Rega, lots of love to you. You're awesome and you say it as it is. ❤️", "the.firstalphabet": "That's it. I'm marrying this woman.", "poojagururajmukherjee": "This disclaimer hit home @regajha. Want to tag the world here. More power to you being this self aware. And, this real with what you share. 💙", "briefpauses": "@saurabhsiyal wow! But why me?", "anshsanyal": "Extremely well said. ❤️. We all just need to learn to just be.", "blrgirl": "Thanks for this, Rega. I needed to read this, today. ❤️", "sokneeoh": "As someone who gets to spend at least 40 hours a week with you, I'd like to say that I do think your life is lit because of the effort you put in to make it the way it is. 💋", "mallikadua\nVerified": "Verified", "karthik.vv": "Becomes a vicious cycle. We start following happening accounts for motivation and the same accounts instead of motivating you, get an inferiority complex for the same reasons of not being able to do picture postcard holidays and sculpted bodies and awesome relationships. So if u don't curate what is the solution, u don't act as if things are alright, that life is just great, don't expose the craters that are there and don't sport a smile and sulking around is hardly going to help. Keen to understand what is the alternative", "thesuitedsatsangi": "Rega, this is so significant. And this coming from someone who has a large following and is in a position to influence a lot of people, is so important. I'm so glad to have read this. ♥️", "sowmyaganti": "@sravyabobba my thoughts exactly...", "dpanjana": "💙", "scissortongue": "❤️", "anushkamulchandani": "This is everything! ❤️", "radhika_rayan": "💕", "sidratum_m": "Thank you for this @regajha ♥♥♥", "aafreen_alam": "@welshyogaholly", "saurabhsiyal": "@shivangiadani", "niquotein": "God, this is gold. ✨", "its_alicia": "Love this so so much x", "misspunekar": "I don’t remember the last time I read something so real. Thank you.", "needywadhwa": "@aakaaashhhh", "my_foodstory": "This is so real Rega!", "thedessertedgirl": "I love this @regajha , been feeling this way for a while now, especially here on Instagram and this post made that feeling a little more positive!", "preetilit": "I love this", "akshay.natu": "You're a wonderfully sorted person @regajha", "garimabablani": "@nimisha_1812 plz read this", "gauriawasthi": "Absolutely double tapping this post. ❤️❤️ More people need to acknowledge and read this. Thank you @regajha 🙏🏻🤗", "danieldrepper": "Preach, Rega, preach. (Seriously!) Support from Berlin!", "lakseriously": "💞", "avantikasmankar": "thank you for this! 🌟🌟", "thatvirdiguy": "♥", "_ayushaditya_": "@radhikathanvi", "rootika": "<3", "ellievhall": "You are wonderful and brave and I'm glad to know you @regajha ❤️", "payoshni_saraf": "Reminded me of something similar you said in the best 9 photos @prasanthnori :)", "nomadiclives": "@regajha man this hit home and how! Thank you for confirming I am not the only one who feels this way 🤗", "meharluthra": "This is the most real post I’ve ever come across! As someone who’s constantly trying to improve my own mental health and figure out what makes me happy - you go girl! 🙌🏻", "shachilavingia": "I can relate to this on a thousand different levels. You've said it so well! Thank you for this :)", "lavina5": "@ruchita_hasija", "theshahreport": "Have you seen Ingrid Goes West? Super relevant", "meerananda": "🙌🏽", "__surrealism": "We’re proud of who you are today, suffering isn’t a choice sadly. :(", "ghorba___": "Yes Rega! ❤️❤️❤️❤️", "meriam_raouf": "Incredible. Thank you", "madras_pennkutti": "Go Rega!! ❤️", "devinlloyd24": "Thank you for speaking these truths, Rega. You are ❤️", "arpitamehta_": "This is SO important", "anvita": "👏🏼👏🏼👏🏼👏🏼🙌🏼🙌🏼 #YouGoGirl", "akshatk1106": "but you have got someone as amazing as tanmay by your side. I wonder why you would be ungappy ever.....", "sabina_panday": "@regajha Thank you for this post. You're someone that never ceases to amaze me. Sending love 💕", "sinclairsavio": "Thanks for this one @regajha!", "bhagchandani.jayesh": "This was so real. Thanks for sharing, Rega. :)", "vishakhajain28": "@regajha you are a wonderful human being ♥", "adrijaa": "@sreyabose", "manubarem": "❤️", "shivani_bafna": "This was epic and way too real. Thank you for being a genuine human and admitting something we’re all guilty of ❤️", "gulu83": "Literally the best post I have ever read. Bar none ❤", "myinnersummer": "This is such a great post @regajha For me it was Facebook in my 20s when all my friends seem to have nicer lives than my own... luckily for me I learnt very quickly that when you're genuinely having a good time there's no time to write a post about it! I LOVE Instagram for inspiration but in my 30s I know it isn't life. :)", "dwayne_r33d": "Thanks for this ✨💕", "msahaaaa": "One of the best things I have read today and that too from someone I admire so much. More power to you Rega ❤", "rijjjj": "Literally what I think about EVERY. SINGLE. DAY. @regajha", "rowsh_mathew": "@regajha - when I saw this post of yours now, I just realised that it was I who had messaged this to you (after vigorously double checking wmy inbox messages). While I agree that we are all about curating our own content in this world, it definitely does NOT need to have you feeling guilty. You ask Why? That's because there's so much of general sadnesss out in this big bad world, that it takes a lot to just find the goodness in the smallest of things and find happiness. And the fact that you see that is lovely. Because being the optimist that i am, thats the only way how one can get through every day. Trust this makes your feel better. Because honestly, we all deserve our own kind of happiness in this world :)", "nimartanarang": "This was absolutely amazing to read. Thank you for your honesty - it paves the way for mine ❤️", "kwongsong": "What a courageous and perceptive thing to say! I admire you @regajha and hope you are giving yourself all the love you deserve", "poogramster\nVerified": "Verified", "rmlowin": "agreed on every point! so beautifully said, rega (as always). i'm trying, too. ❤️❤️❤️", "ramyadraj": "Thank you for this post. It's something everyone needs to read", "manan_0308": "@ruchikaa_99 read the caption.WHAT A WOW", "rheakimaya": "SO IMPORTANT 💛", "kashondelivery": "Take it easy", "vritisach": "🙌🏾👏🏾😘", "rjsyedlive": "👏❤️", "nirali.s\nVerified": "Verified", "riyavatnani": "More power to you! 💙", "ayushikroy": "I love you. I love you.", "shefaligoel19": "Thank you for keeping it real. ❤️❤️"}