{"bawaakanksha": "@tanvimanocha22 makes sense", "diptijaiswal": "Wow", "neharamneekkapoor": "Yessss. So much is expected out of women. It’s as if “weak” women don’t deserve respect. Respect shouldn’t be a measure of how much you can endure.", "jayasawadhwa": "YESSSSSSS to vulnerability 🙌🏻🙌🏻🙌🏻", "shankari_tripathi": "Preach!!", "__mshh_": "This 🙌🏻 @toobajbaig", "gulabiglares": "I so relate with this. I'm proud of being an emotional Ball.", "sigmundfreudv2.0": "So effing true", "sinhavantika": "Ive always wanted to put to words whaf i truly feel about being a woman and wanted to let other women know,and this summed it all up. Thank you @regajha", "8484pri": "Amazing girl...your thoughts are inspiring 👏🏻👏🏻", "ms_potterhead_": "This 😍😍😍😍", "pkshekhawat": "@regajha. No one cares. Go back to Stalin's Russia if you want to live in a classless society. In the free world, people can assume whatever they want to. Stop telling us what to do. This doesn't further the cause of women. You can also talk about people still wearing a burqa. But you won't", "ad1ty7": "And same goes for men! My fav men are all emo as F! ❤️", "drunk.on.words": "Thank you for this 🌸💝", "meghamehtaa": "Feeling deeply and being emo is my superpower 🐒 @vashishth.dave", "druv_wagh": "❤️❤️", "mammamiaitspriya": "@natashatmodi", "yashsharmajii": "Arey kehna kya chahte ho.jpg", "meerkotter29": "Thank you for this.", "garvitnarula": "Yeah so it's a great idea to not be strong, perseverance through hard times is stupid, and we should all just give up and start crying. Preach! 👏👏👏", "sonicscrewdriverr": "There is something problematic here(imo). Glorification of strength is NOT a patriarchal hangup. Because strength isn't only a male characteristic. The face that basic human emotions are being divided into masculine and feminine is in itself, problematic.", "kartike.ya": "Lmao. This is so stupid. Strength has nothing to do with patriarchy. Being strong doesn't mean that you'll lose your sensitivity. You want to be vulnerable and not strong? Good luck facing the challenges life offers everyone. Lol. Pure feminazi bullshit.", "bohoheartt": "Love this. I am done being strong.", "kavitapeddinti": "This is on point", "agrawal_rupal": "Because don't cry, don't be vulnerable, try to be strong are expressions of psuedo masculinity and we defy it.", "gowriii89": "Celebrities like @sonamkapoor sometimes don't relaise how much of an effect they have on their fans by sharing such things. Absolutely no accountability for them. #didnotexpectthisfromsonamkapoor", "shivangied": "But strength is a near necessity, whether in men or women, whether patriarchally constructed or not, whether overrated or not. Never saying vulnerability should be looked down upon. As much of a human trait and necessity as strength. Let's recognise strength too for the same. Not like one who fumbles and then learns isn't strong. :) Dismissing strength itself simply because patriarchy used it for creating inequality (that too just the physical and subsequent forms of strength, prolly) isn't the fairest. :/", "purabi.ch": "Basically, just be women. and fuck people who try to tell you that being 'better' women means embodying traditionally 'masculine' traits. Allow women to behave like women.", "boisbeautybox": "Quick q though: why can’t one be emotional and strong? Vulnerable yet resilient? I’d like to think I’m all of these things wrapped into one tiny dynamic person (not woman). And so are most others I know. Feelings are essential as is the ability to stand right back up when the wind has been knocked out of you. 💕", "prishieofficial": "👏👏", "arghyadeep_": "@muskaan_the_noceur 🌈❤️", "ashna_misra": "@sadhvi_kewalramani", "nehamordia": "LOVE! Reposting... ❤️", "myth.of.sissypuss": "Be strong if you want. Be soft if you want. Don't be anything if you want.", "reeniekazim": "❤️❤️❤️❤️", "avantikasmankar": "i love this!", "shru712": "Like! But I guess in a way being vulnerable is a kind of strength? Because not many people can expose their soft side, their vulnerability.", "iamlikeothergirls": "💚💚", "maliniagarwal\nVerified": "Verified", "maybepranav": "This is soooo true! Plus it takes much more courage to be vulnerable and reach out than it does to pretend like you're strong", "fashionopolis.in": "Thank you for saying this!", "nitimajethia_": "Love love love this! ❤️", "jayaardee": "Maybe its a patriarchal hang up cause we've been conditioned to believe so. We must embrace strength as we embrace vulnerability. There's nothing wrong with be strong, and there's absolutely nothing wrong with being vulnerable. Emo is fantastic Strength is fantastic. We are fantastic.🤸🏻‍♀️ What if this 'being strong' is a facade? What if we've always always always been strong?", "sanchi_sehgal": "This post is ALL PERSPECTIVE 😍", "aanamc\nVerified": "Verified", "avipsharayamajhi": "omg yessss exactly what I think!!"}