{"balaaj_1": "Hmmmm", "nirali.s\nVerified": "Verified", "samueladams1789": "Cute af yes, but your eyes are captivating. 😮", "_.unnati": "Damn Regha Jha 🔥", "optimismrocks": "Love this post. ♥️ It's a validation for me as I did the same today 😂😂😂", "prp97": "That's validation from the highest authority", "trulynomadly": "Not everyday needs to be productive, work-wise, no? Days like these where you're just catching a break and not exercising those brains are successful too, imho! There's just too much of an unhealthy amount of focus on hustling and doing. Being a bum is underrated, you must applaud yourself for being one today 💛", "tenthunknown_": "One dopamine effect a day keeps bad day away.", "atom.bhai": "Wonder what busy day dopamine comes from. 👽", "alifaakbar27": "Cutu💖", "wtfxbritt": "I ❤️ you for this", "isahanali": "Good morning 🔥🔥 eyes so cute", "gulshancrazy": "These eyes. Now I know where people get inspiration for esoteric poetry.", "sydneymoondra": "@hasinipanini this is me today zomg. also follow this woman immediately she is everything that we wish to become and more and then some more. she is the ultimate human crush", "anupbarker": "😍😍😍😍 cutieeee", "pigpen2973": "Dental appointment, pain killers, sleep for 12 hours.", "im_vaishh": "@zuck is proud of you", "lanaahsi": "Sending you 147,000 kgs of validation♥️", "m.cm.xcvii": "You're killing it in the selfie game! 😍😍😍", "sumitandthecity": "Love this photo!", "saffrontrail\nVerified": "Verified", "parag_rai27": "💯🔥🎉🙌#buzzfeed is life💯", "rsbgarg": "Not sure if it’s oxygen or this super cute af selfie. But I’m dying here slowly. Crushing over @regajha is like breathing, sabko karna padta hai.", "mind.sam": "Eyes cute", "sarvesh_is_wow": "I hate myself for not knowing you existed until the Under 25 summit", "manjusharma2196": "❤️💖❤️💖❤️👌👍", "karishmaanaik": "Bhar bharke buckets full of validation 😍😘❤️", "udaypanchalh": "😍😊❤️💕💕😘😘", "teekay_thesedays": "Hi. So I've been a huuuuge fan of your work for a really long time but I only started following you on social media recently. Must tell you that your posts are a glorious combination of relatable and inspiring. ❤️😍❤️ Also, your selfie game is on point.🔥 Much love.", "kanikagupta2.0": "15 rupee ki Pepsi, @regajha sexyyy", "surbhi.bagga": "works 100% of the time ✨", "theprateekkotha": "@regajha : eyes/ice/i's", "_shraddhadabral_": "Also sending bucket loads of love and validation to you always, you don't even need to ask pftt💖", "abbiinayaaa": "SO FUCKING PRETTY 😤❤️", "rushikesh__sapkal": "Eyes😍🔥", "ankushbahuguna\nVerified": "Verified", "srini091": "Eyes and nails also look like “Mac with whiskey something dobara mat poochna” colours now 😁 Rombavey cute selfie. 15/10 would agree", "_adigos_": "What ever it is but your eyes are soo f...ing pretty @regajha love u💕", "gunjiiiiiiiiii": "@octo_._bear validating our gap year one post at a time 🌸", "chromonobo": "@nidshegde 😂👌🏾", "thecipherstory": "🌸V💜A🌸L💜I🌸D💜A🌸T💜I🌸O💜N🌸", "abbaniii": "Relatable.", "shreya.lifecoach": "Hahahaha I have one of these days every week. It’s now even scheduled into my calendar", "thecheesecakeproject": "Half kaajal 💕😍", "bhagchandani.jayesh": "Rega! 💯"}