{"veerdomusic": "@an_weird_weirdo", "__lonewolf_": "Your voice should be heard loud. 👏", "a.nimaaaa": "Pro-Hindu folks are not Modi. Haters are not Modi. People with fucked up ideas are NOT Modi. That being said, Modi has never personally endorsed those actions or encouraged them, correct me if I'm wrong. Your argument is solely centred around the fact that you got a lot of hate from people wanting to misguidedly preserve their culture/tradition. But here's a fact: hate is inevitable. Be it UPA, NDA or whatsoever alliance comes to power. The only difference is that it was highlighted under NDA and I believe it did help a majority of us to grow as individuals. So, while, yes, hate is rampant, Modi, is not it's ambassador.", "lenin_has_risen2": "You inspire me to vote for Modi. I voted for Modi in 2014 and voted again in 2019.. jai hind. Pls keep cheering for your beloved good looking Pakistan cricket team ( reference to your Pakistan love tweet )", "kirk_dsouza": "Amazing!", "pooja.1393": "@arushirawal30 @bhagyam26 @palaksheth", "jharnalist": "@mananchauhan read this", "maithili_3": "Day by day I am getting stronger in your fan following🔥🔥❣️", "maryamkhan11_": "Bestest post I’ve come across in a long while. The hate comments make the post worth more ❤️", "sundermanbegins": "SHOOK AF. You 🔥", "chandni.nagar": "This is what happens when you spend your entire day on Instagram and have no touch with ground reality. 😂😂😂😂😂😂😂😂", "priya.chetty": "Oh you privileged people will gang up to spew venom at the things that we commoners need desperately. India needed cleansing from the years of atrocities against innocent taxpayers that saw so many scams, but do you care about that? NO. You’ve got rich parents paying you a fat load of pocket money every month or on demand. You’ve got parents who are happy to live in a regime that allows you them to walk Scot-free when they keep their money stashed at some first world tax haven. You’ve got enough in inheritance that you don’t have to worry about the next generation. So shut up and don’t teach us what the fuck is good for Indians. And no I’m not a Modi or any political party supporter, I just want to see my country free of the chaos that would have descended for sure if the government hadn’t changed in 2014.", "jayaakrishnn": "Sasuriii, ab kaha ho tum?", "grandmasterpurple": "FUCK YOU BITCH", "___b_a_d__b_o_y__": "Did the burnol work?😂😂🤣🤣", "ganesh_mantra": "Morning walk peh math nikalo @regajha kamine log wapas aagaye 😅😅", "travel_gourmet_world": "Loose post with immature ideas - thumbs down", "aswatijose": "I wish you'd come back, be the voice for the voiceless. It is only a wish. I do understand the trauma you've been through. Peace.", "gurmeharrr\nVerified": "Verified", "roadtrash123": "Har har modi gher gher modi", "snobster_": "Rega, if I could, I'd grant you an honorary degree from JNU aka Anti National University but since I can't, take my gratitude. It takes a lot of courage to be in an influential position and take a stand. More power to you. x", "rajeevbritto": "I'm with you on this. To be part of a DEMOCRACY is to hear both ends of the argument. And to deny anyone that fundamental right to express and be heard without threatening them is the birth of fascism. India is a land of different cultures, and we should be better off appreciated our diversity and not demolishing it. These mistakes have already happened before. Let's not repeat it again.", "your_besst_friend": "Why don't you blame your States CM, your states people who are threatening comedians etc etc others because they are not properly educated. Blame your state police for not maintaining Law and order and for not protecting your rights as you said cyber cell didn't filled your report or whatever. You can always go to court in the end if even Police is not helping you, just go to court and you will enjoy the power of the Constitution.", "kaneezsurka\nVerified": "Verified", "thecbrkid": "Fuck you and fuck feminsm. Stop taking victim card. #modiagain🔥", "maliniagarwal\nVerified": "Verified", "desi_renaissance": "@regajha is a COLONIZER. Realize this, and all becomes clear", "shiv_vii": "DIL SE KAHO FIR EK BAAR. ABKI BAAR MODI SARKAR!!", "iamvineet.tiwari": "Modi modi", "isha_nair99": "HAR HAR MODI GHAR GHAR MODI", "shridharan_kun": "R for respect,", "brokencamera__": "🌟🌟🌟🌟", "madara_uchihaa__": "@regajha My brother is in the army, he lost a friend in Pulwama he wanted to avenge his fallen brother modi government allowed him to take direct action against any kind of terror attack. Air strike were also carried out in Balakot under modi government. Relationship between Russia and India has significantly grow a lot including other countries. If you are too blind to see all this and only care about you BuzzFeed and your priorities well good luck because people will hate you and you deserve it.", "un_arth": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "ajay_asap": "Boo-hoo! I can't make memes anymore this is so sad😢😢😢 😭😭 let's go back to the govt who messed India so I can make memes 😎😎 yes that's what I am gonna do. Pls staph", "imagesbysud": "Alok likes you", "harsit_agrawal": "Toh kisko kare ?", "adi_tya_nair": "Powerful, needed this", "thesixstringaffair": "More power to you! Inqualab zindabad! 🙏♥️✊", "vasusell": "👏👍", "pratik_chiku": "You are writing, fu*k the rss fu*k modi-shah-adityanath in a facists country??? thats a new form if faciism I guess", "narendranag": "Excellent. Vote. And then channel this rage, the battle against bigotry isn’t won yet.", "manan_pandey": "It's funny how people with shit in their heads think the best way to gain publicity is just to abuse the current government and modi.These attention seeking bitches like kunal kamra should be deprived of what they aspire and once again @regajha If you think you're offended by this go cry to your mama.", "tohar_sasur": "Now I know why Buzzfeed India is comparing Bappi Lehri with different sweets🤦‍♂️🤦‍♂️", "ryandsouza100": "@anamika_91", "trekpedition": "“Fascism marches upon us” 😂 someone book her a one way ticket to North Korea pls.", "vaaibhavvv": "Bitch fuck u too", "elysian_paradise": "Oh lady,I appreciate how you put it raw before the public,so effortlessly,💕Yet I still hope ppl get sensible enough to have their own opinions rather get influenced by anything running over the internet to support each one's individual angst or support for whatsoever the propagandas reflect!", "insharahman": "@sunmbulrahman read this!!", "vardhman25": "Amazing Rega! More power to you", "the_prince.robot": "You go girl 👍👍❤️ and while you're at it please don't vote for Congress too because they don't have a human for a leader it's a plain idiot who's their candidate and pretty much the same all over", "baesharmaa": "@umbreeze_ og qt", "atharvashigvan": "I think u have sold yourself cheaper for Congress party💯😁", "authentic.anant": "Fake liberals coming in 3...2...1..", "kartiksharmakk": "Buzzfeed india is literally the most cringy normie shit tier memes , now u seem to find another source of money , good for ya", "deepak.40000": "BuzzFeed is a piece of shit... so are you idiot", "akshatsood__": "Wow you want a better fucking internet environment over development ?? Nice choice.", "whenthatlitgirlfromhimachal": "As soon as I saw the brave ladies you tagged, I knew the fuckery was real. Fuck the RSS? Sis, do you even know the full form of RSS? Do you even know their principles? No, you don’t. You are just one of those Urban Cool girls who’ll spread the Naxal agendas under the cover of ‘jokes’. You won’t feel any remorse when hindu genocides happen. Eat whatever you want, you don’t have to show it off! Pray to whatever God you want, you don’t have to show it off! And also, fuck whoever you want (please use protection, we don’t need little Urban Naxals running around right now, pehle hi bahut hain)", "hrishismm": "@bagam02 aayenge toh Modi ji hi", "i_am_thakur_rishabh": "Fuck everyone and don't vote anyone? Is this your idea of Democratic India, give us solution, not just your opinion. Everyone has their own. Thanks.", "theabhay": "@regajha if anyone can defeat BJP , is sp-bsp alliance in UP , nothing else.", "ash_mertia": "Aayega to Modi hi", "reallyrishi": "Yaar itna cringe😖😖", "sadafahmed07": "Also, I love how people are asking you to justify various scams and murders and conspiracies! @regajha", "mr.xinsituations": "Dress is excellent", "urvisukhparia": "Be safe. You have put up some thing strong and THEY will find you and troll you. Take care and hats off for the courage💓", "jai.arxym": "Fuck Modi and the entire Indian Political Scenario. It's stupid as fuck and so is 90% of the population out there. The internet is saving us. Not the government. Outside of it and without it, India had no room to develop and that's how it's gonna be until someone understands the sole purpose of development and existence.", "not_the_otherguy": "@ayushhiiiiii", "privacy_pleasexx": "Girl, You stated facts🔥🔥🔥", "xeninfinity": "Love this! ❤️", "anika_n_mamma": "And after reading this post ppl started unfollowing you .. as m i .. BYE!", "akanksha__utkhedkar": "Fuck politics! Our government sucks!!!", "eagle_foxtrot": "Ayega toh Modi hi, kya itna woke hoke kya faiyada 🤙😹👌", "shahin_zainab": "♥️🙌", "tarungurjar3211": "Actually I uesd to Follow you on Insta..But after this post ..i m unfollowing u right now..u r just a piece of crap who don’t have a single knowledge about politics abd spreading hate towards Modi..Fuck You and fuck this post..", "anvithapillai": "@naveen_cin", "sohamtripathy.21": "Dear @regajha , You don't know how much you inspire me to stand against all odds. People like you strengthen our nation. It is very difficult to raise voice against the powerful, but I'm extremely proud of you and no wonder why I love you so much. I'm a mere 18 year old, but I promise I'll do something someday and make you proud. 💓", "chandrika_rawat": "THIS SAFFRON WALL WILL FAAAAAAALL!!!! 🔥🔥🔥🔥❤️🔥🔥🔥🔥", "swapna_rameti": "The reason I love you ❤️", "retr0cactus": "I LOVE YOU FOR THIS", "shanaiamalkani": "@abrar.tohid", "snobby.__": "You go girl!💗", "tanasha.amlani": "@son_of_a_human @pranjalimorchhale read the caption", "tushrathore": "Kya chutiya h yr ye..😆", "harshal__7111": "Oh wow!! I FOUND A URBAN NAXAL YEAHHH 😂😂😂😂", "shiny_bot": "Yes fuck them! So much love and power to you woman ❤️❤️", "prernaakashyapkhatri": "You know what? Fuck you. Fuck everybody who is praising you. Learn how to to criticise someone before you preach about your 'freedom of speech.' You and your leftist gang are REBELS WITHOUT A CAUSE.", "akkian__forever": "Aayega to modi hi 😂😂😂🙌🙌🙌", "political.drama_": "Fuck Of !! Fuck Of !! I repeat Fuck Of !!", "rahulraj.pro7": "In everyone thinks she or he is a intellectual. But in reality they are just a disgrace.", "kanikajswl": "This girl has to do nothing except supporting her shitty friends...I swear modi ya bjp wala janta bhi nhi honga ...isko aagae liberal ka jhandaa lia😂😂😂😂", "aditya_tss": "#bommabom", "galiliaxk": "So....who do we vote for?", "meghashrimali": "@junkkdna", "geetoo__": "You should become the PRIME MINISTER 😍", "arjunaa___": "HARR HARR MODI, GHAR GHAR MODI", "sheikhimaan\nVerified": "Verified", "abhish7": "Best thing you've ever posted.", "nivesh.kandwal.12": "Fuck off you prostitute", "shabeehshakkir": "Kuddos you got the guts to speak this !!✨😻", "xoomm__": "Communist bitch 😂😂😂😂, ayegaaa toh modi hiii 😂😂", "prasannta_priya": "More power to you woman❤️❤️", "anyadaftary": "💜🔥Thank you @regajha for always being a fucking awesome person!!", "shhaaambhavi": "Fuck yourself bro", "myiasdream": "🔥🔥🔥🔥🔥", "a.k.s.h.a.t.m.i.s.h.r.a": "Dam nhi g*nd me bate Kare Brahmand ki", "sam_kulavoor\nVerified": "Verified", "ra.aa.j": "Mmmmmm....fake feminist😂", "muddie.puddles": "I was going through all these hate comments you received on here. They have nothing specific to say just some random humbug and obsenities. That is all they can do. And this sarkar has given more power to these individuals. Now these low lives think they rule the country with Modi and his goons.", "dhr0v": "❤️", "aswin.or": "🙌🔥🔥", "gupta_somya": "Hi Rega, I believe the issues that you raise are important but don't you think development of this nation is more important than discussing these first world free internet issues? I'm not pro BJP, I'm a neutral Indian citizen wanting my country to shine out on the globe because it's something many generations have longed for. The social media only picked up its pace in the recent years but the real issues like Poverty, Corruption, Unemployment, Scams have been going on for 70 years. As much as I hate to see Muslims being lynched, I also hate kashmiri pandits being hurt. We say that look at the MP and vote but do we realize that we would still need a PM to lead the country. All these years Congress kept fucking up this nation, 70 years later Rahul Gandhi still talks about removing poverty when that should have been done long ago while his older generations were ruling the nation. We brought Modi for change and now when it's happening its making us all uncomfortable. We talk about \"change\" all the time but we forget that change is the basis of growth. All the fuck ups that BJP did wouldn't have taken place had the nation not have been fucked up so badly in the past. Demonetisation wouldn't have been needed if the black money didn't exist in the first place. Also, as far as free media is concerned I think you saying Fuck Modi is enough for you to realize that it actually is free. You're expressing your opinions dissing the PM. Sharing your thoughts and with full freedom. The problem is that we are privileged people, we don't have to think about issues like sanitization when we now even have period pain relief available at our disposal. We don't have to think about roads because live in metropolitan cities and travel in cars. We don't have cry about coal chulas because we have regular supply of gas. If you will look dig the surface you'll realize what kind of change is actually needed. My vote is for development and for all those poor people who need basic amenities and for those who don't have toilets. I feel you're just scratching the surface of the real issues. Ask a villager if they care about toilets or Twitter. You'll know all the answers. @regajha", "_saachishetti_": "Hold on. I do not understand this sublime hatred against the Prime Minister. After all that he has done. After so many years of inactivity.", "thesulips": "Everything I wanted to say, better articulated.", "shagufta_e": "So brave! 🙏 thank you!", "yugalsinghmahara": "You say this now comfortably sitting in your house in a metropolitan city. You wouldn't say this if you were a woman living in our villages when Congress was in power, you wouldn't say this if you had to defecate out in the open, which has changed now thanks to Modi sarkar. You wouldn't say this if had to cook three meals a day in a small hut with fire wood and the smoke making it difficult to breathe and eyes tearing up and so much discomfort till a point that it feels like you're suffering. This had changed all thanks to Modi.You wouldn't say this if you were a Hindu girl in UP who is kidnapped, forced to change your religion, forcefully married, and raped everyday, which is reduced drastic measures due to Modi sarkar! I just see who does what's best for India! Jai HInd!", "ksowrya1": "Fuck Modi and Fuck the RSS", "kshatriya_yadav_vansh": "Abe bhak Teri mkc 🖕 @regajha", "ashima.salaria": "YOU'RE THE BEST REGAAAA. I LOVE YOU. KUDOS. I wish I could be like you too. ❤️", "aadi._.1": "In jese bhatke huve logo ko samjhane ka koi fayda ni h... Aayega to modi hi... 🙏", "fathima_asharaf": "🔥🔥❤️", "bhavita.kumar": "YASSS. Finally someone saying something sensible🙏🏻", "pranavdixit": "Thank you for writing this!", "dhrumil_10": "@payalrohatgi", "gulia_writes": "The real truth ! This nation need more people like you.🙌", "kaushikieeeeeeeeeeeeeeee_23": "#aayegatohmodihi 🇮🇳", "gui.ahuja": "yayyyu😭", "paras_1604": "Nothing can be done for illiterates like u.", "ravishingtwinkle": "I have my hopes on Kejriwal 😃", "shrutipathania": "Finally ! Ure allowed to take the time to heal or to feel safe . So fucking important that this be said ... again and again and again.", "shaivi.mehta": "THIS COUNTRY HAS BIGGER ISSUES THAN FIGHTING TROLLS. Think about YOUR NATION. 70 years of Congress and India is still a fucking developing nation. Jeez. Stop your trolls. You can make propaganda memes, but when people point out your hypocrisy, the silent mockery of peoples beliefs, mocking the prime minister, is okay? But if people call you out for it, its Saffron goons? Stop your generalisation of an entire religion, second after years of mockery of “insert religion, beliefs, strong personalities” if people have finally woken up and are standing against that bullshit then the country is intolerant? Fuck you and your playing the victim card.", "shamitabangera": "@regajha common girl if u do bullshit that's ONLY MEMEing ...have guts to take the backlash... Even Modi Lovers are trolled... So What??? And all this was only upto internet world...but modi supporters like @theplacardguy was attacked in real world... What abt that... @regajha help urself block such trolls... POLITICS has been all abt this..u won't get \"daddy's little princess\" type treatment here.", "jaykaymm": "REGA FOR PRESIDENT🔥", "sigmundfreudv2.0": "Bravo!!!", "anjumfarook": "!!!!!!!!!!!!!!!!!!!!", "they_call_me_meme_girl": "#AyegaTohModiHi", "the_prabhuji": "Modi hi ayega💓", "saffron_sniper_23": "Dum nahi aand ka gyaan chodenge brahmaand ka", "tyson_n7": "@fmf_insta_official @fmf_army @anjalisinghbaisa @shamitabangera don't reply to me. Alag se comment karo iss post pe. Afterall, we are a democracy, so our opinions should also count. Note that if she blocks me and everyone who doesn't agree with her means she is against right to speech and freedom of expression.", "ursila.ali": "Yaaaaaas fuck fascists fuck communal losers", "miss.quilley": "More power to you gurlll💪", "imprachical": "\"As Modi ascended to fuckery\" shows how fucked up this woman herself is , could have said the same stuff against the gandhis during emergency and would have been welcomed into the new age voter crew with garlands. Well, fuck you.", "i__m__nyk": "Tum jaise chutiye log hmko sikhayenge kisko vote dena hai??.apni had me rho na...agar rahul gandhi hi pasand hai to usse shandi krlo..agar marx lenin psand hai to unke pass rho..yh bas sirf paise milne vaale honge is liye yh sab post dalenge...hm modi ko hi vote krenge...aur fatne hi vaali hai tum logo ki...dekhna...aana hi chahiye ab to modi..fake seculars sale", "kafiroon": "This shows how you brought up. I blame your parents. God bless you", "baidehid": "@regajha Kudos ❤️", "im_vaishh": "MORE POWER TO YOU, GURL!💗 Your voice is light💜", "apekshagajjar": "Agreed. Is your other option any better?", "msketotraveller": "❤️", "so_azman": "Glasses goalz 💞", "deepankarbhade": "@vshalp04", "lakshitaaaa": "Ilu woman! ❤️", "pug_n_doberman": "❤️❤️❤️❤️❤️", "_shuvio": "💗💗💗💗💗💗", "vaidehei": "🙌👏👏🔥", "officialpreetisingh": "❤️", "jessyrossanna": "@vineelabellala", "mithleshgupta19": "😂😂lol i don't know why people like you and your supporters are dumb enough to look at reality", "murmtheworm": "yessssssss🔥🔥🔥", "rajmeetdey.07": "Keep burnoil in stock kid bcz you will need them heavily on 23rd may...#namoagain 🇮🇳", "sierra._.bravo_": "U HAVE USED THE F- WORD FOR A RESPECTED PHILANTHROPIC N WORLD CLASS ORG LIKE RSS...N ALSO U HAVE ABUSED THE PM OF INDIA NARENDRA MODI...THIS WON'T GO UNNOTICED....U R A TRAITOR...I HAVE TAKEN SCREENSHOTS OF UR CAPTION N I AM COMPLAINING TO THE POLICE...I AM REACHING THE POLICE STATION right now to Lodge an FIR AGAINST U.... GOOD LUCK TRAITOR...MEET U IN COURT...GR8 JOB👍👍👍", "shivum__": "Aayega to modi hi", "gayatripatankar": "@nikhildxt", "rohit_1910": "Thank you for this! And might I say, well written !", "snehavii": "More power to you, back hopefully back to all of us, the people, this election, Rega!", "saffron_reaper": "Fuck you idiot", "pigpen2973": "Stunning view", "that_coffeegirl": "Inspiration af and so so true. To everyone who can, please go out and vote. For what and who you believe in. Preferably a liberal and tolerant India.", "jagrutiverma": "There is so much I don't say online because whenever I say even a pinch, bullshit comes my way. These are not threats but bad enough to send shivers down my spine. Thank you so much for putting up this story. 😭 More power to you, Rega. ❤️", "alluring__chaos": "@abhishroff12 more reasons why I’d never go for bjp", "bipinbisht1619": "Ayega modi hi🤣 kuch nhi kr le", "xpallavii": "🙌🙌", "shreya_1911": "THIS! 🙌🏽", "awokehindu": "\"Earlier we just used to spread our propaganda and used to brainwash youth and if anyone objected we used to spit that 'just a meme bro' wali line but then people became aware. They started to question. Our propaganda was not working like it should be, we weren't able to hurt sentiments of Hindus like we used to before. People started pointing out our hypocrisy. All this due to Modi. This bloody modi. We used to take PM as granted before but now we can't even abuse the most powerful person of this country. India is becoming intolerant and all this because of Modi. We will never talk on Kashmiri Pandits, we will never talk on tukde tukde gang, we will never talk on fake cow lynchings wala scenario which was another propaganda by the left ecosystem because otherwise how will we earn? 😭 And as we all know modi is a fascist because he made me love my country and made me say 'Bharat mata ki jai'. Ewww that sounds so communal, doesn't it? He also made me proud of Hinduism and their culture. Bro Hinduism is shit, we are atheist, we don't believe in a culture which treat cows as mata Lol. And yeah fuck liberals, fuck pseudo feminists, fuck your propaganda, fuck you too 😊 🇮🇳\"", "rahideroy": "Necessary ❤️", "a.man.calling": "Hats off🙌! Although there is no point of arguing with these \"Bhakts\" coz anyone literate enough would get this point till now by himself. And those who don't, we'll check what the word \"Freedom\" means in ur dictionary and try to correct it.", "priyoritized": "♥️♥️♥️", "rutvik_sadhale": "That's what happens when you take the wrong meaning of feminism", "__adityag__": "I have come a long way too.. i used to follow Buzzfeed, hate Hindus, i was a typical Leftist. I moved the fuck on and left your suppressive, toxic ecosystem. #AayegaTohModiHi", "prashanthkallur": "🙌🙌 im so grateful for all the people who overcome fear and raise their voices for the things they believe in. The environment on the internet forces a lot of us to keep quiet, fearing ridicule. Keep doing what you do (as long as you can) maybe one day people like me will have the courage to speak up. I love what you post btw. Your content is very grounded and self-aware. Thanks for choosing to share a part of your life to the world.", "___raaahul___": "Fuck the king ,fuck the queen....(ser clegane: the hound) ....... Game of thrones ka mausam ..... Finally winter is here😂😂💞😍😍🔥", "haangul_l": "Amen sis", "harshvardhan_kabra": "Lol, in a facist state you are not even allowed to speak or write your heart out. Glad to see liberal brigade coming out and still complaining about FoE. And yes, hatred is not one side way", "harshahippo": "Someone needed to say this 🙌 more power to you girl 🔥", "chikuag": "You just said the truth of politics that the whole country is facing. There's no one to hear us the youths, the maker. everyone are so involved in there own world that everyone just wants to attack others in hatred. Love for the speakout. #vote", "jburkespraker": "I’ve followed you since you came to India and always loved your Twitter. Your light is missed there. I am glad to see your light still shining brightly here. I especially love it when you show the mess and break through the filtered illusion of Insta. Peace.", "daniel1245am": "⭐", "mrmorningstar_3": "This is PURE Regga BOMB 💣🎤", "thecipherstory": "I wish you posted more about politics. 🌸🌸🌸🌸", "worsecozitsclare_": "💜", "jha_piyushk": "@regajha times changing slowly tho bt people will understand never the less", "sanjeevjha99": "❤️🤗🙌🏼", "subraminion_a": "More power to you woman! And to those wondering who we should vote - NOTA, and those commenting about scams and political crises , suggesting you dig a little deeper into the crises the common man is facing at the very basic level. Religion is not something on whose lines victories should be taken.", "_rahul_kumar_tiwari_": "I love following you on Instagram..you r inspirational...learnt from you a bit to write...but I am unknown of the use of fucks in you para..#modiforever #modiagain #modifyindia", "srutitravels": "❤️", "anand.bhatt": "BS gyan for the day", "sheennuts": "This is a very powerful post so I will let go the non-capitalisation of the word at the beginning of each new sentence ❤️", "simpleandsober.mostly": "@bhokali", "komal.2207": "@zavierparmar pls start giving a shit.", "pukhrajranjan": "💪🏽💪🏽🥰🥰", "snehalgpawar": "Finally! Someone said it out loud!! More power to you! 🙌", "ibarthwal": "@bhav", "sumitandthecity": "Yes, yes, and yes! 👏🏽👏🏽👏🏽 Thanks for using your platform to post this despite all the shit you’ve had to deal with.", "atul_m": "May the force be with you!!", "ghauvas": "@regajha You make me feel so strong, best person I follow, so far😍🙌", "shireenstagramz": "I bow to you lady!!", "farheen126": "Thank you❤️", "ashialee": "@regajha I am not from India, so I do not understand how terrifying it must have been going through the things you described above in your caption, but I do wanna add that MORE POWER to you for having the courage to sharing it now🙌🏻 You never know who might get inspired from your post💕 I hope you and me both get to see and live in a world where no one ever has to experience it this ever again!!", "sabbafatima": "U said exactly what I'm afraid to say... Imagine being afraid to speak in our own country... More power to u ❤️❤️❤️❤️", "arts_i_have_mastered": "🔥🔥💖", "harshitha_820": "❤️❤️", "alqama.irshad": "CAPTION says it all .🔥🔥🔥", "krithika95": "YES! EXACTLY! Finally someone said it, power to you 🧡🔥", "sophiembaron": "You’re amazing", "ritikapassi": "\"fuck being silent\" - a 1000x yes.", "mycocktail_life": "@rgs_chronicles", "snehalsurekha796": "Wow!! It takes a lot a courage to write and post on internet......... In today's day n age, where some people won't waste a second to troll, even if you write something meaningful and worth......... But big time hats off to @regajha u r queen 🌠🌠❤️❤️", "divyauppal_24": "💖", "manjusharma2196": "❤️❤️❤️❤️❤️👌👍", "lifeluvershru": "You spoke our heart out of how we've been subdued to such bullsh*t ballistic crap for these 5 years! 💯 This stands as an important reminder for all of us! Love & light! ✨❤️", "veronicabahl": "@pranaav.krishnann caption", "mauryadivya07": "👏👏proud of you lady 💗 i know it takes a lot to speak about it, i happy you did😊😊 👍 More power to you 🔥", "reginalovesdonuts": "sis you gon get some bad shit for this one...", "meharluthra": "Yes yes yes!!!!!", "manojkumar7mvk": "@narendramodi @narendramodimission2019 @bjp4india @bjp4gujarat @myogi_adityanath @amitshahofficial", "masaaldosa": "Love love love ❤️", "vanditarohid": "A-fucking-men", "oomszter": "YAS! THANK YOU. 💪", "anushkabhoj": "fuck 👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "praveenmadhavan_": "Lol what a joke. I'm sorry for your personal internet attacks. But you're fighting for party workers who offended you and saying Modi and the BJP have done nothing good because of your internet caps? Utter stupidity. Congress and the rest will provide so-called freedom as long as you give them the power and freedom to do what they want without your interference, which you clearly don't care about. Good luck, and good luck to people who'd tread your path. Congress is literally hiding it in their agenda to silence the media and you think BJP has been silencing? 😂 Prob spend a minute to check up on your facts.", "reddevil_ayush": "Mad respect for @kuna_kamra as well. Thank you for showing us the true picture kind sir.", "youfoundme_914": "This post absolutely made my day❤️", "suhanikacharya": "YES! more power to you 💖", "thesharannair": "REGA FOR PRESIDENT", "corakess": "🙌👏👏👏👏", "zainab.qureshi_": "This caption says everything I've ever wanted to say since 2014.", "beingmeraki": "Let's spread this as much as we can before they take it down.", "bsmartest": "🙌", "iyeronicallyme": "👏", "snigdha.ahuja": "@aakriti_m", "_shraddhadabral_": "THANK YOU", "iqipiqi": "you 👏go👏woman 👏", "amymehta_": "@_abhijaysingh_ serving you more reasons why I won't have that conversation with you", "_awksi": "Preach them all❤️", "_zaveriya_890": "💯💯More power to you @regajha ❤️❤️❤️", "sid.chatt": "THANK YOU", "starquake_viceversa": "Our country was invaded everytime because lack of unity and a great leader is leading those peps after so many fancy speaking peps(like her) led their country towards corruption and provided those traitors with interracial benefits just for their votes, can't you see we are on begging status now, your fancy English just makes me abuse you because you are going on holidays and thinking what bajrang dal is fighting for, they are fighting so a group of PIGS can't rape a poor Hindu girl after cutting her father's throat. Don't go to Pakistan they don't like peps how hate speech their own people,go to America they will accept you since your black skin is toned after using excess moisturizer on holidays... If you hate me plz follow me for more content I don't fear too.", "dreamstr._": "🙌🔥", "agramofkomal": "You go, girl. 🔥 Much power and love back at you. 💗", "armyofvan": "👏👏👏👏👏👏👏👏👏👏", "avantim": "❤️", "riana_mammen": "LOUDER👏FOR👏THE👏 PEOPLE👏AT👏 THE👏 BACK.", "nidofido": "🙌", "megbee79": "👏", "ayman.gulzar": "I posted something about peace after the Pulwama attack and people of my own class. People I called my friends branded me with an Anti national tag and literally whole of the class had boycotted me.", "archith_s_kamath": "❤️❤️❤️", "thicclittlelady": "This was needed", "amrisha_rai": "@regajha I'm proud of you. I say this with tears in my eyes.", "sehlengethodaclub": "Bruh you are brave af. Kudos and cats and pizzas to you for being brave enough to put this up👏👏", "dikshajhaaa": "More power to you 🖤", "shefalisharma_": "YESSSSSSSSSSSSSS. THANK YOU. 👏❤️", "cyrusdaruwala": "Yesssssssssss...🙌🙌🙌🙌", "ratherwrite": "Thank you so much, Rega! You inspire us. 🖤", "shivani_bafna": "@sakhxi", "amartya.pradhan": "@anonymousmylord 🔥", "aise.kaise.chalega": "The end reads like the hound going fuck the king. 😂", "sabahath_afra": "Thank you for this brave post @regajha 🖤", "shamilajibin": "Just when i thought i couldn't love you anymore. Thank you for all that you do❤️", "sanyuktabafna": "❤️", "kulxum.04": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "samina_zabi": "Wow.... It's good to see someone you admire, share your thoughts😊🙌🔥", "obserwere": "Fuck BJP AND RSS", "ashascaria": "Thank you for this post. You are very brave.", "rach_silmas": "Thanks Rega for standing strong 💚. P.S.Cat posts are allowed too", "tbfhsammie": "👏👏preach👏👏", "parag_rai27": "Fuck lit Post 😇", "dcunhahaha": "I've been following you guys at BuzzFeed India since the elections happened which was a weird coincidence, so I too can completely relate to each and every word you have mentioned. We needed this ❤️ thank you @regajha", "human.in.hindi": "Voting is the only way to make us heard. We'll make this one count.", "theskybluebubblegum": "You brilliant woman! I hope things fall in place for us🌼", "holaanyaaahereee": "Everybody needs to hear this. Thank you Rega! 💜", "ashifa_sayed": "🔥🔥", "libin_7thomas": "🔥", "must.be.sleeping": "Thank you for this posttt❤️❤️💞💞🙌", "shivanivikramsnegi": "Woah!!!!!", "suhadmohammadi": "\"saffron DP'd dudebros\" 😂", "ashna__98": "Well said!! 🙌", "nooshanusha": "Thank you for always being fiesty and angry and honest", "siddarthsuvarna": "Yesssss🙌🙌🙌🙌, fuck all those hypernational idiots who think they and their religion is more important than a person's life and above the law", "kaywhy28": "@lazyzubin", "saiganesh": "👏👏That takes courage! Thanks for posting this inspiring message, in the middle of everything else that you do - which is cheering people up. \"They can't silence us at the ballots\" needs to be on a t-shirt. 😆", "khanakmadhok": "🙌🏼", "ankitaakesharii": "You go girl!!!!❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "pt.anecdote": "Having said that, you have brought on the table that each of us is noticing the change. Some of us have even experienced it. Not as huge as your yours and I ones posted my thoughts about the Pulwama attack and what I got in return was few DMs reminding me that my page was supposed to share medical experiences not political crisis. @regajha you spoke my heart out here!", "msahaaaa": "I was waiting for this from you Rega💕 thank you !", "harsharma_12": "Voice of a strong girl!!! 💜", "sukanyajanardhanan": "PREACH. Thank you.", "thequeermuslimproject\nVerified": "Verified", "farzibengali": "Modi Go Back! 😘", "thesahanarudra": "!!!!!", "dhar.akash_": "This is so true!! Fuck BJP", "keerthu2910": "More power to you Rega ❤", "oyeshika_dutta": "Preach💞", "jaanvichopra": "you go girlll ilu 💪💪", "shankari_tripathi": "I have been waiting for a post like this to come. It is brave and important. You are brave and important. I love you woman thank you for everything.❤", "heartmiracles19": "HOLYSHIT REGA", "powershawarma": "fuck!", "nushki_c": "THANK YOU FOR PUTTING THIS INTO WORDS", "tiwarituraj": "@tushpreetsokhi @kritishrivastava Give this a read.", "richakaulpadte": "YES 🌟🌟🌟", "arunimajoshua": "💯💖", "awestruckbabe": "I love you so so much!! This year was my first vote so I don't know much about politics of course due to my careless attitude towards politics but this post makes me think about politics all over again.", "rucchiitaa": "🙌", "raktima2015": "A hundred ❤💞 for you.", "albert.asha": "Thank you for this very important post. ♥️♥️", "theinternetnargle": "GOOSEBUMPS THIS IS WHAT I'VE BEEN WAITING FOR THANKS ILY", "thecheesecakeproject": "I love you Rega! And yes, fuck these people. Thank you thank you for putting this up. Thank youuuuuu. And big big big hugs! And just in case, you need to take this post down, we'll understand. And we still love you and we're going to try to change the shitpot we landed into five years ago."}