{"hituubhatia": "Ye khushi ke aansu hai pagli😭😭♥️", "safety_pinned_heart": "Lmao I didn't knew I was syncing with so many people 😂♥️", "sanjana__gill": "This Happend to me today..despite 12 years of experience 🤦", "glamnfit00": "I respect men who don’t mind period blood 😍", "ektameinanekta": "@regajha well done!! And for people who can't seem to understand the purpose of the imagery are exactly why we need to normalise seeing it. Well first of all, noone ever has to look at your poop. You yourself don't look at it mostly. But this is something that does occur, in your bedroom, or hall, school, workplace. And normalising it across genders will make it less stressful for women to deal with this. They don't have to be embarrassed, feel guilty or run like PT Usha to clean it and hide it and set up the scene like nothing happened even if she's cramping and hurting.", "y.thapax": "It ruins my mood every morning this happens!!!", "sakshriyan": "@sreejoyee.s Bdw if you apply an ointment on your lower back, it might help better than applying it on your lower abdomen. I have similar pains, exercise of all things helped me.", "kavi____ivak": "Cheers 🥂", "_muskan.09": "Are you saying you're the best?", "ser_rhaegar": "Just because you have an instagram doesn't mean that you'll post every stupid shit you come across including yourself ! Fag piece of shit 🖕🏼🖕🏼🖕🏼", "ilaxmee": "If i will take take picture of mine in this situation then it looks like someone spilled a full glass of wine.😂😂 Heavy flow problem.", "the_liberal_flawesomist": "Waiting for instagram to go 'Bruh we need to take this down ASAP cause this is not for public view but let us know if you want some dick pics we allow that'", "run_richa_run": "I felt i was the only one at age 28 doing that to bedsheets", "thatwipgirl": "Love this!!💛💛💛", "emmanuel_masy": "What is it", "_shxchx": "No it happens only to the best chaddar of ours", "_rutujam_242": "@anushree25 Read the entire thread. I see what you are saying and I totally agree with it. What came to my mind was I loved watching the movie Piku where poop was explained in detail which did not gross me out but I still got the point. If that movie would have showed me poop with every shot I would have thrown up. Can’t agree more with you :) I love how patiently you are responding to all the comments ❤️ We can all agree to disagree guys!", "spaxsha": "Spent around 8 yrs with this problem! How do we stop this, the problem of staining and over flowing..... does tampons really help in preventing staining!??! I get its completely normal and it’s ok but when you go to someone’s house as a guest or maybe live in a hostel what do we do Help!", "optimismrocks": "♥️♥️♥️", "ruchikaa_99": "@christina_pereira11 @megha_thakkarr", "batool_zehra_i": "I can feel you girl😢", "eshaaa._.s": "@kruti_ravindra those 5 mornings, every month be like.", "badalsahiba": "Yep..", "asukarakshata": "1", "ednaphsedanile": "Ewww that bedshest has the worst pattern", "ishita_mehtani": "True.", "bombaysfoodie": "And it’s absolutely okay ♥️", "viprapathak": "It is so frustrating , no matter how hard you try, every precaution you take.", "sjo.ray": "Im on my 1st day and I can't stop crying. The cramps are painful AF. How do y'all cope up with the cramps during your work days?", "aadarsh.001": "@suryanshu_singh7", "sugandha_banga": "Who here is “the best of us” supposed to refer to? All women get periods. There’s no good/better/best amongst us.", "_sakshideshmukh": "@wonderwo97", "travel_gourmet_world": "Attention seeker - fake feminism 🤨", "ashiville": "Story of my life ! Always never felt disgusted by it thou 👏", "radhaaboruah": "❤️❤️", "sagittarian.mind": "Yes! Even after 15 years 🙄", "stuti.xp": "So damn relatable", "sassstree": "💙", "islandmakinen": "This is me this morning. And the ONE TIME I wear colourful panties smh 🙄", "aryanmannann": "Dunno why y’all trippin, all I see is wine stains", "arjunclickx": "I hope you have big bucket of ice cream .. 😊😊.", "nirupamahalder": "😘Want little stain on pants to b this casual", "tanya_hasija": "Every.fucking.time 😭", "sarahhbabar": "HUG!", "navie.uwu.exe": "😭", "farzana.jpg": "😍❤️", "thegirlwiththetbrpile": "Ugh, yes. Thanks for posting!", "ahana.roychoudhuri": "😩😩", "bitchariii": "Ugh yes!!!! Aaaaa", "comfortably_rum_": "Zinda mein hoon, mark idhar hai", "christinakatelobo": "💪🏼💪🏼", "gunjanngupta": "But weren't you using mcups!? Leaking? Get a better fit.", "csarkarsmile": "Yup happens... That's why I put a cloth under me", "human.in.hindi": "Hope you eat all the things you Crave 🔥♥️ and not gain the calories! 🔥🔥", "ashmitaagupta": "I thought you'd switched to menstrual cups and they don't leak.. but this?", "shona.ahmed78": "@ahmedtasmiya @maariyahsiddique", "_samhi_": "Every single time!", "retrospective.scum": "I don't think this is graphic in any sense, we face drops of blood like this everyday and tell our friends when they have blood on their skirts or pants. This isn't something controllable exactly as something rega is trying to show. Comparing it to poop, no one turns around to look at their poop unless they have piles or something. Blood-soaked pads might feel disgusting but I wouldn't say that this picture is in any way graphic.", "myiasdream": "Good to see such posts. We men should learn the practical happenings of a women.", "alya_ektaa": "@anushree25 I don't see a Problem in seeing someone's stains. Let's not stigmatize strains at least!", "ms.chanandler_bong7": "It does! I feel this so much.", "reema_dutta_16": "♥️", "ng.nemesis": "I think the world knows it happens to the best of us....and there's no shame in it .... similarly no point making a big deal about it...women have been having period since the EVE got puberty so relax girls ...why is this even an issue...whose family doesn't understand in this day m age. Come on find a more pressing issue that needs repair for our country like safety of Indian women, human rights..et", "kabir_shri": "i don't get it...what is it?", "thinkofanamel8r": "Even with the cup? I thought those were leakproof", "tnzm009": "Now I’m impressed 😍", "manjusharma2196": "😍", "vineee_23": "More power to you 💫", "adtpatel": "Smh I felt this picture", "ananyasahay": "I use something which ensures this never happens to me !!!", "salonigupta97": "@anushree25 I understand what you mean, however I think it's important for you to know why it's necessary for this to be graphic, and why your comment may be offending to a section of the society. Periods are considered far from normal in our society, as you know, because our society just doesn't comprise of the urban people like you and me. I come from U.P., and so many friends of mine who come from educated families are still not allowed to enter the kitchen when they are on their period. It's stigmatized to that extent. Hence it becomes important to not just create awareness by talking about it, but by showing it and getting graphic. We want the world to see it's just blood, and not a taboo. I really think if you get uncomfortable by two drops of blood, then you should increase your threshold a bit. Moreover, everyone has a right to express whatever they want in whatever form, and I believe comments like yours will only further discourage people from coming out and being open about these things. And believe me, we need to be open about it, especially in India. Please be a bit more sensitive before you comment next time. If you still don't understand what I or others mean, I at least request you to not bother others by leaving such comments and just let them be. :)", "sanjanaa_babu": "♥️♥️♥️♥️♥️♥️", "van44_": "❤️", "ojohhey": "YES", "the_baalika": "Cheers 🥂", "iamjagritip134": "❤️❤️", "mohdrehankhan": "You are fucking crazy.... You are confuse female, who don't know how to promote feminism. There is no need to take photo of it. And show to the world. Crazy", "storiesbysurabhi": "Yes story of every girl. 🙌", "ruchiii_25": "@priyal.xo been 13 years for me and this still happens. To each of us once in while, I guess😌", "cindrellaprakash": "🤗", "gudbrother": "🔥🔥🔥", "the_book_monger": "So you think you are the best?", "activist_sakshi": "Cheers", "tanvi_dhote": "Doesn't matter how long for it has been your friend. At times it never forgets to leave a mark", "karishmaduggal15": "❤️", "abbraccia_alberi": "Yep... happens to everyone. And posts like this will help reduce the shame and stigma many women feel.", "poogramster\nVerified": "Verified", "blueswalaguy": "Ek chutki khoon ki keemat tum kya jano Ramesh babu, isn't it?", "_anahitaa__": "You are a strong woman and sis I’m there with you. Need more fam like you🤟🏻❣️", "suneera7": "Spotting since 2001", "the_maithil_chick": "I have washed bedcover, bedsheet and a lower bedsheet and that is my girls the most horrible night of this natural nightmare 😂", "thisisluckey": "It so bloody does!", "aruushisharma": "I strongly recommend using a cup! No leaking, no staining, no effort. ✌️", "moumita_kathak": "It damn happens and I m 22 yrs old.. Still no issues though!", "alammoumita63": "I think it happens with everyone...@regajha", "s_a_m_p_u_r_n_a": "💓💓", "yohana_de_andrade": "there there 🍷🍷", "imavnisharma": "Careful you might offend instagram and get it deleted just like it happened to that girl XD", "nayantarabagla": "People hating on this love watching blood on Game of Thrones, Gangs of Wasseypur. Idiots.", "theladybonkers": "Happy that time of the month!☀️☀️", "sabahulmani": "😍", "_ayyo.paavum_": "❤️", "shireenstagramz": "🤝💗💕😒", "intersectional.desi.activist": "Me: wears a huge night pad. Even adds extra liners in case there aren’t any. Sleeps on stomach despite the discomfort. My bed: 🔴you thought bitch🔴", "thehazelglimpse": "This brought a big smile on my face! ❤️ Happens to so many of us.", "totaly_imperfect": "🥂", "inshia_31": "Thank you. I needed this😭😭😭", "_sendcatmemes": "😭", "the_austere_girl": "yeah no biggie ♥️", "nikkkhil_panday": "🙏💯", "hazarika_krishnali": "30 years of age and still happens to me at times", "kaveriroy": "Always thought it's something that I do wrong or weirdly to lead to this! 🙏♥️", "obeautifulworld": "Happened to me even with my cup! Need to get a bigger size.", "mycocktail_life": "Crimson goddess", "anushree25": "You can say it without actually showing it. I’m a woman. I get periods (thankfully). I am not ashamed of them. I still don’t get the point of showing them for the world to see. These are natural processes, almost akin to our daily rituals of answering nature’s call. Doesn’t mean we go about photographing poop next and splashing it across social media. We can create a revolution without getting graphic. Just a thought.", "pablo.chokobar": "❤️❤️", "the_reaper_lady": "We're synced😂", "sonal1401": "Yep. Despite 20 years of experience!", "anjali.g.krishnan1": "Must be hurting like crazy. Take care! 🦸‍♀️", "_mugdha_": "🍸", "joshmyjoseph": "It happend to me today😊", "radhika_0309": "💞🙌🙌😂", "florenceraj": "❤️❤️❤️", "oliviagomes13": "Blood sisters✨", "smittencurve": "Mine are late😭", "budhu.sa.mann": "❤🤗", "nazzzzuk": "true❤️", "aree.zz": "💕", "daggerwal": "Urgggh !! I am on my second day and I have already washed out 5 pairs of bottoms !!!! 😡😤 I feel you sista !!!!", "shreyahaha__": "❤️🌚", "kilanil": "This was my morning 🤦🏻‍♀️🤦🏻‍♀️"}