{"claire._.elizabeth04": "I love all your outfits sososososo much!!!", "emmasophian": "yes omg it's been a struggle. it's especially hard bc my introverted bf still has to go to work so he's socially BURNT by the time he gets home while i'm excited to finally get to socialize", "mollieslittlesnapshots": "In the same boat, I need to go see friends and leave the house and my partner is an extreme introvert. Please share your tips!!", "alyda.marincovich": "I’m definitely starting to annoy my introverted boyfriend, but it’s also nice bc we’ll do work beside each other or play video games in the same room so he gets to do his own thing while I have another human with me", "hillary429": "I love that nothing in the background changed haha", "florencechollet": "I'm slightly less introverted than my partner and so far I also had to adjust to doing things in silence/while listening to the tv in the background and accepting that we don't need to talk all the time. My advice would be : loads of podcasts to simulate being part of a conversation 😂 (and also accepting that your relationship is not over because it doesn't look like you're having reckless fun and deep convos all the time)", "sarlouise.x": "Yes!!!! My bf isn’t fully introverted but more so than me (I need so much contact!!) and it’s making me quite stressed and anxious but we’re trying to work on balancing time together and time alone and also getting me some hobbies along the way. He’s being a real sweetheart about it", "kirileebb43": "My fiance is an introvert and was loving it, then we had to move house into my father's for a few weeks in between places and he hates it. I was the opposite, I was so bored and miserable having next to no contact with anyone (I still am), but moving in with an additional eprosn has helped me tremendously. We struggle with this all the time though as my idea of a perfect weekend is something Friday night, saturday day and night, Sunday day and night. Only mornings for sleeping. His idea of a perfect weekend is something Friday for an hour or two and that's it!", "anniinavir": "I'm an extrovert and by partner is introvert, and this whole situation has been much harder for me than him 😕 but I have a lot of video calls with my friends (while he's doing something else), so that helps a lot 😊 also, we just moved in together three weeks ago, so suddenly being together nearly 24/7 is quite a challenge - but so far everything has been mostly okay 😅", "paulewstrmnn": "big problem in the beginning of isolation. Her (extrovert) wanting to spend all the time with me to have quality time as a couple now that we're free while the pressure of feeling like I have to 'entertain' her already minimizes the ampunt of social time I can have. Uff. We're currently copeing by being together in rooms but doing our own thing or be in seperate rooms and only spending the evenings together", "laurbingley": "I'm an extreme extrovert and my boyfriend Ben is introvert! He makes an effort to fulfil my social needs (ha! before nestling away to game). We play board games, read together and are currently working on a DIY cocktail cabinet project! We do a weekly zoom pub quiz with 10 of our friends and I make sure I video chat my friends/family in between him gaming/reading. We are also key workers so I think that helps because I'm socialising during work so not going completely stir crazy! I think I feel sorry for the introverts locked away with their extroverts though because I'm sure I'm being extra annoying and high maintenance as I'm not able to socialise with my girls 😂 🤞", "plunkybug": "I’m the introvert and hubby is the extrovert in our relationship.", "scientificallyexplained": "Why do you have a linea nigra? It usually happens in during or after pregnancy.", "laura_jukes": "That outfit i NEED IT hannah", "hannahburdyy": "I am finding it pretty tough balancing everything as we're a fairly new couple (a few months) isolating with his parents 😬😬 As an extrovert, he's always calling/gaming with his mates and being 'really blaisé' about lockdown whereas my introverted self needs a lot of reassurance and cuddles as I can get really fixated on negative thoughts 😕 I'm really struggling to find purpose and productivity as I can no longer complete my PGCE course", "laughandsmilexx": "Sameeee it's nice to hear there are other extrovert introvert couples out there feeling it 🙈😂", "abigib": "I have no advice but my boyfriend is going stir crazy and I’m stressed from working more than pre pandemic lolll", "procrastelinaa": "I need this advice more than I can tell you.", "sowebeat.on": "Extrovert boyfriend spends his free time playing online with his friends and introvert me is having a great time working on my computer and reading/playing Sims/having a drink on house party with my friends once or twice a week. But we take our meals together and cook/bake together every day. It's working really well :)", "onehundredfortywinks": "We just posted a full blog on how we have been dealing with isolation as a couple!", "meltrimarc": "Yes! I’m living with my partner and best pal/roommate, they are BOTH introverts and I am an extrovert. It took a lot of trial and error before we got a routine down but I found having some kind of consistency to our day helps both of us a lot (i.e. knowing when each of us feels best interacting, communicating about using space, using exercise/walks as time to do what we need to do around the house alone etc)", "isakson_hughes1": "Wow I always wanted to see the Dark line on your tummy 😊 .... Does Dan like it too?", "karimkhan441": "You're very sweet and beautiful", "miekosasha": "We’re both extroverts, but under stress he becomes more introverted. We usually are our best and thrive when hanging out with others and having parties so being along together for so long has been strange. We’re figuring each other out and I’ve been reaching out to others more. Both his work and his hobbies involve being on the computer. It’s hard to tell when he is working or when I can bother him so I’ve instructed him to wear a “work hat” as an indicator that he is working. 🤪 I think we are figuring it out but its a process", "stephanihani": "I'm the introvert and have been using our bedroom as my 'alone time' space when I need it during the day. I also started an online course in quarantine and I work on that when I need my space.", "_jojosaurus": "I'm working from home trying to be normal and my partner is self employed so it's been binge watching Louis Theroux and other crime documentaries. For me, it's switching off from work. The journey from work would allow me to calm down and leave work behind and now it's just here in my safe space.", "ljunehall": "We have an interesting dynamic. My husband is more extrovert and I’m more introvert but he’s a home body and I’m a busy body who loves to be out of the house. I’ve been loving having alone time but am SO antsy cuz I just want to get out! But my husband suffers from fibromyalgia and mast cell activation syndrome so he is immunocompromised so that’s been helping me because I know by staying home I help him. I’ve been pouring my antsy energy into packing (we’re moving!), cleaning, studying for my board exams, and in-home workouts. My husband had a bad flare up to his condition so having me home has been helpful and he doesn’t feel like seeing anyone or going out anyway.", "barefootinadress": "My roommates are ALL introverts to some degree and I am rly rly rly struggling to get to social input that I need to thrive. We’re working on directly acknowledging what we need - e.g. “I can see you’re dying for human interaction, but I really need to be alone right now.” But it’s so hard to accept that I just can’t get what I want/need right now. Digital interaction isn’t the same.", "micahlee_19": "Yes! My husband is a total introvert and accountant working from home and I'm a textbook extrovert who usually gets to spend all day playing with preschoolers! It's been rough honestly.", "dramaticlittlegirl": "I'm an introvert, wife is an extrovert - I am a keyworker, so get some alone time at work, and if I need it, I can tell my wife. Thankfully, we live in a house share, so if she needs people when I need myself, she has other people to be with ❤️", "___hannahjayne": "@laurbingley you and Ben are the most introvert/extrovert couple I think I'll ever know!", "piercing_power": "I'm an introvert and my bf is an extrovert. I've been cleaning and decluttering the house, working on my PhD, reading, watching TV and doing some at home exercise stuff while he's been constantly on his phone talking to loads of people or playing online games with his friends. It works pretty well although I started feeling a little neglected, so we're trying to play a board game together, just the two of us each night and making sure we have dinner at the table with our phones away :)", "lalalaulaura": "Living at home and my mom is more extroverted, while my dad is more introverted. Which means my dad quietly works on his own, while my mom keeps commenting out loud on everything she does, as if I'm part of her work. Which is challenging when writing your thesis 😅 Regular breaks together to chat work. My mom also keeps herself busy with the most random chores around the house. That also works. But that sometimes means I'm sorting through old cd's with her, instead of doing my work 😂", "culturalmaniaq": "Well, we are both a mix of extra and intro each so it's complicated 😥 very important to divide spaces to fulfil both", "steve.morgan.186590": "Are you extro or intro", "robot_and_alien_dude": "Glad to see you two striving ✌️", "philippa.bingham": "I'm an introvert and my dog is an extrovert and he thinks I'm being mean because he's not allowed to play with his friends or go on long walks so he has tantrums, does that count? 😂", "sofie_corn": "Yes definitely! I’m introverted and my extroverted bf is like an excitable puppy 🙄 I’m trying to give him bits to do, mixing jobs and fun stuff as he’s not very good at self-directing his energy. It’s hard going and looking forward to being allowed back out for our daily exercise as that was helping! (both currently in with mild symptoms thanks to frontline nhs jobs!)", "cait.malloy": "We live in a semi rural area but we like to go on drives, walks, and we pretend to get coffee. So we make coffee at home go on a walk with it and then come back feeling like we did something. Not sure how that would work for you in a city though, I’m the extrovert and I’m struggling just a bit, while partner is an introvert and is doing just fine", "mkaela__": "I’m an extrovert and my partner is an introvert. He’s quite happy to play video games all day while I miss seeing friends and running around work annoying my colleagues 🤣", "megan.rhi": "Two ambiverts in an ldr and we are going crazy (': Minecraft has solved a lot of our problems though! Get to spend time together from a distance <3", "cookiescoop": "I've been furloughed (so stuck at home) and my partner is still working, which means i get alone time easily but he does not. We are doing okay so far but we had a conversation about how to navigate it!", "cdalton1231": "I (extrovert) find things to do around the house and play with our kids(7,9). My wife (introvert) pretty much stays in our bedroom. She spends time with the kids periodically throughout the day and we are going to start watching a Netflix series together. One episode a night.", "bethanyann37": "My partner is an extrovert, I’m an introvert. We’re both working from home together (in separate rooms). She’s having a much harder time - not being able to see her family, have people over, etc. We did a virtual game night yesterday which I was drained from, but it made her feel better. She’s been on Houseparty a lot and zooms and Marco polos her coworkers multiple times a day. I am trying to get more reading and chill things done. I feel more energized than normal and less clumsy (don’t know if it’s related, but I’m generally very clumsy and have noticed less drastic mood swings and clumsiness). Still heightened anxiety on both sides. We’re taking drives sometimes to get out of the house without seeing other people. I find working in separate spaces (is possible) has helped a lot. She’s loud and on the phone a lot, so I can listen to an audiobook and drink some tea while on my computer.", "hapfairy": "I'm an introvert (plus have a chronic illness and work from home as an author) and husband is an extrovert. I thought he would be really struggling, but with having online meetings all day as well as Skyping friends etc he seems completely fine. And he has the Final Fantasy 7 remake which is definitely helping!", "crystachesbro": "It's not easy, I need to keep busy and he's happy on his computer doing his own thing. Thankfully we are both working again but tips would be amazing", "lisakennedyrealtor": "Yes! I am the extrovert and my fiancée is the introvert - he also has a j pouch for 20 years! Yeah he loves isolating - I am doing everything I can to connect with people :-)", "almamanjana": "Denmark and another country has announced opening after easter. Sweden never closed and did no worse. It's over.", "nikki_beckett": "Yes, I'm an introvert and my boyfriend is an extrovert. He's definitely been more bored than me but at the same time there's been times when he's been really sad at not being able to go and see his friends and go to work and I've not really seen him like that before. We're both working from home and fortunately, we're in meetings quite a lot and often are too busy to really speak to each other during the day so it's not too different from a normal day at work. The House Party app has definitely helped him get out his extrovert energy 😂", "kindergifts": "Gosh, so many extroverts in here. I’m an introvert- can work quietly all the time ... lots to get on with these days but even so, I miss getting some external motivation-:)", "ameliaweller_": "🙌🙌🙌 Want to know your thoughts about this. I most definitely am!", "amyjmcdonnell": "It's difficult. My partner really values his alone time and sometimes I find it hard to accept that it's not about me. One thing that's worked well for us (living in a tiny studio flat) is communicating whether we'd like to hang out in the evening after working from home. If he says no, I'll take some alone time. However, I often ask whether we can hang our for an hour or so we're both getting what we need and want.", "redhead_in_love": "Same! My husband is an extrovert who needs to be around people and engage in adventures daily. Meanwhile, I've rather enjoyed the excuse to stay home and work on my little projects. 🥰", "sustainabilityiscool": "Boyfriends an extrovert walking in circles hating everything whilst I’m an introvert low key loving it", "sally_barrs": "Oh my god please! I'm an extrovert (+very restless and active) and my boyfriend is an introvert, he can happily spend all day (and weekend) playing his PS4 while he's furloughed.. Which is fine when I'm working but I can't stand sitting still for long periods of time I NEED TO MOVE 😂😂", "natcat_1": "I am the introvert and my boyfriend is the extrovert. We're both working from home & it can be a little bit difficult for me because he makes noise of some sort constantly 😂. Taking an extra long shower and just chilling out in the bedroom on my own for a while is helpful. I really miss social interaction face to face because I HATE messaging, so I feel more socially isolated than him because he'll xbox and facetime with people.", "panzer_princess": "Ugh it's been a struggle. My bf is working from home but I've been laid off, so my introverted, depressed self has wanted to do nothing but sleep while he's up and working like normal and bugging me to do things with him in the evenings. I barely have the energy to deal withy own fucked up emotions right now, let alone try and play monopoly without crying....", "pauluvjb": "Make the bed! Lol", "trishhalyn": "Too relatable. My bf and I are living together during this isolation and he is an introvert and I am an extrovert. It hasn’t been too big of an issue. Just when I have to convince him to go outside with me! Would love to hear what you and Dan come up with!", "sandycorgis": "My wife and I consider ourselves introverted and the quarantine is tough on both of us. We had routines in place that took us awhile to get accustomed to that fulfilled our needs to socialize. With that gone we’re really out of sorts. I don’t know any of my introverted friends who are emotionally thriving contrary to belief.", "rebel.ghoul": "I am an introvert, my partner is an extrovert. I feel like I have to work hard every day to keep them inside! (except for walks) They always want to escape to go to the store but I’ve not let them, which they do appreciate in the long run. It’s kinda hard for me not seeing people right now so I can’t even imagine what it must be like for them", "heathersmith113": "Yup! Me and my girlfriend are in the same boat. I'm extroverted and theyre introverted. Weve had to plan out down time and time we spend together doing fun stuff and time to ignore each other😂", "brittamosxo": "I LOVE LOVE LOVE your outfit😍😍😍", "forthe.girlwhowaited": "We are both introverts and I think that's playing into it as well. We both have time where we dont hang out with each other but we see each other all the time which we are not used to. The strain is real", "heyheyitssteve": "We’re finding it... interesting? Trying to balance my extrovert need for interaction and contact with her... not that. Both working from home indefinitely, so have taken to working from separate rooms so we can live our lives our respective ways. Going for a ‘quality over quantity’ approach to free time, to compromise on our respective approaches to life.", "lisahunt96": "Different perspective: BF and I are both introverts coping with mental health conditions so we need lots of alone time in a cramped space. We tend to sit in different rooms with different stimulus and then come together in the evening to watch Netflix and have dinner☺️", "zorritodelavina": "😍", "stephwild_": "Yas! I’m a mega introvert and I absolutely don’t miss anyone or face to face social interactions right now, hubby is an extrovert and is actually doing okay becuse I’m around, but I’m getting to the point where I want space from him 😂. Also his work have been very understanding about the whole and mine completely haven’t, and I hate love it! It’s total jealousy but gah it’s such a bizarre time 😩 xx", "miaredwine": "also allowing us to have our own time to do different things has helped me bc when i feel overwhelmed i can watch a youtube video to focus on other things or just do an activity that calms me while he watches a movie that calms him (he could watch movies all day😹)", "_pictwii_": "The nice thing about our situation is I (the introvert) was laid off and can do my own thing all day while he (extrovert) works from home and needs to focus. So I get 8 hours during the week where we talk a few times very briefly but I otherwise get to be left alone.", "shannonbookworm": "Yes! I'm extrovert abd my boyfriend is very much introverted", "rakesh121_00": "Please", "ethomas11": "Yes. My fiancé is happy to play video games all day. I have to find things to do. It’s led to tense moments and blow outs. I’d love to see what you guys come up with.", "efaashman": "Where is ur pinafore from? (selfishly hoping it wasn’t a charity shop steal...)", "juniorcasttro__": "❤️❤️❤️", "narflet": "My introvert friend with an extrovert husband and two small children is finding it very challenging times. 😬", "mek2009": "Luckily, we are both introverts who prefer to stay home... I feel for those who are not the same as us and are struggling right now ❤️❤️", "rebecca13_x": "Not much has changed in my day to day life now we’re on lockdown, but having my family around me 24/7 is really starting to drain my introverted self", "flydorsch": "My partner and I are both introverts but I'm definitely an extroverted introvert. My partner is totally leaning into his introverted side now which is annoying sometimes because I want to talk and need attention. But I keep myself busy with cooking, reading and replotting plants. But we have our days when each of us just finds the other irritating 😅😅", "meggs467": "My partner and I (5 yrs) are having to suddenly become a distance couple because we don't life together and we are definitely relying heavily on open communication on what both of us needs to sustain this time apart. We both normally have very different needs in the way we express and receive love, so I'm glad we have the background of working together to figure out how to keep each other feeling \"full\" even from afar for an undetermined time 🤷🏼‍♀️👀", "brettcarrutherstrash": "Have you felt like the isolation and change has had any effect on your stoma?", "nik_josephs_life": "Slightly different situation for me. I'm working remotely as an introvert [I've been training for this my whole life!] While trying to get my extroverted kid through distance learning school from home.", "mymatesid": "As a natural introvert I’ve noticed that a lot of our well-being is dependent on knowing that there are people out there, doing stuff. So while day-to-day might seem the same, we still have that background anxiety that extroverts do. Oh, and my more extrovert wife is doing fine - as someone who normally travels a bit and mostly works from home she could actually do with a few fewer video calls from all the colleagues that don’t:)", "sznlpn": "Oooo sounds interesting !!", "chrisdefontaine": "Beautiful Pictures ❤️😘", "charliewhitear": "Yes completely!! We thought we had it all worked out until lockdown turned us all upside down, and suddenly I'm the introvert and he's desperate for interaction?? It's all very strange and we weren't expecting it 😂", "ellsbells16": "Today is my first day of furlough, my introvert husband is also furloughed. Today I have done A LOT of tidying, chatted to a friend on Skype, done some revision and made a cake. He’s done... I don’t know what he’s done 🤣 meanwhile he’s perfectly content and I think I’m going slightly mad...", "baumgartnerchristopher": "😍 ❤️", "rachaellawrites": "My husband and I are both introverts, but his sister is living with us at the moment and she's very extroverted. We've had to talk her out of inviting people over a few times 😬", "roxsincich": "My husband is the extrovert and I’m the introvert. We’ve found that he really needs “projects” to stay entertained (he’s been doing a lot of sewing and baking), whereas I can just read all day. We spend time in different rooms for a lot of the day and then come together in the evenings. He FaceTimes with friends a lot! So do I, but he definitely does it more frequently than I do and for shorter bursts, whereas I’ll FaceTime friends for a couple of hours. So far, all is well! Such an interesting experience!", "starscattered": "Your leggings are amazing, where are they from?", "little_miss_dalton": "100% me any fiancé! We normally both work hectic schedules and cherish the time we have together... At the moment we are driving each other potty! Love him, but balancing our personalities and interests. 6 years together but lock down is a TEST!", "hannahjsikora": "Yes! It’s definitely hard when you are used to seeing your SO for a few hours a day (during working days) to now being in the same space 24/7- no matter how much you love/like each other, it’s hard!", "tombstone751": "It’s gas how a lot of couples are like that ( well of who I know at least ) . Love your Instagram stories Hannah very entertaining 😉👍", "supersophs": "I'm a massive introvert and my husband is more extroverted (but not massively so). He's got his fix by having some video chats/xbox chats with friends and family whilst I have happily opted out to sit quietly and play animal crossing! I'm quite enjoying not having to see people but know it's probably not best for my mental health overall 🙈", "karen_hobbs": "Cuuuuuttteeee pinny! ❤️", "fivebyfivewhat": "Very much so!!!!! My husband is the extrovert forced to work from home and I am the unemployed introvert unable to find a job and therefore hibernating...", "novemblr14": "it's funny, my extrovert fiancé is isolating because his jobs closed and me, the introvert, has to keep going to work because I work in a grocery store. It's so annoying 😂", "isobel.fp": "I am extrovert and my boyfriend is introvert. We both work for the same company, I am on phones all day and he is doing IT. We work in the same room and now spend most of t he day in the same room. We are coping very well tbh! I think even though we are so different socially, we are both very laid back and chilled so it’s working well. I’m just making sure I speak to my friends and family over FaceTime a lot ❤️", "ipreferging": "Where do you get your sports bras??😩😩", "harshit211997": "I love how you had to clarify that you infact did take a shower! 😂", "annemarienc": "I'm so glad that my boyfriend and I are both introverted so this quarantine isn't hard for us haha. But it's a little difficult because he is still working normally since he's a produce clerk at a grocery store but I'm out of work for now (I work at Universal Studios and they're closed) so I have to try to give him space when he gets home from work. But when I'm alone all day I want to hang out with him. So we are also working on finding a balance in all this.", "call_me_shawty": "My husband and I have implemented a system: I (more extroverted) ask him (introvert) if he wants to do X together and then leave the room for a couple minutes. If I ask and wait for him to answer, he will say yes to X even if he desperately needs to be alone, but if I give him some space, he can actually consider whether or not he wants to.", "brac828": "Always pretty @hannahwitton", "love2follow2020": "I love your gym outfit 😍😍😈😈👀💦💦", "evafelina": "Me extrovert: hanging out with our newborn all day, FaceTiming/phone w/family & friends, walks around the neighborhood (some limited interaction with neighbors), baby always keeps me company but sometimes I need a break too! Husband, introvert: started a garden in the back yard, hobbies like beer making", "jopineapplesuk": "Do you shower together?", "raaz78657": "😘😍😍😘😘😘😘😘😘😗😗", "lucia.inthe.sky": "Pleaseeeee my husband is an introvert & I’m an extrovert 💕", "arpad62": "❤️❤️", "shaz1006": "I'm introverted and am literally spending my time binging things with the odd motivation to do extra bits here and there I.e. baking, exercise, playing music. My partner is super extroverted and is spending his days fixing up an RV he owns. Keeps encouraging me to leave the house and join him but I just don't want to!", "chicadragon": "My girlfriend is an extrovert and she is about to start shouting from the windows to meet our neighbours, meanwhile I'm an introvert and I'm totally fine on the social front. If I have two Zoom conferences in one day, I get overwhelmed... Please help us. I will try to live in the mountains when this is over and she will probably move to a comunal house with twenty roommates if we don't do something.", "fabiennesings": "I'm an extravert and my partner is an introvert. I can still get my required amount of contact as I'm working from home via videocalling my clients and once in a while videocalling some friends together (And every once in a while I'll see if I can annoy him for a little bit while he's working from home as well). So far it hasn't lead to any problems ✌️", "angaxa": "Yes I'm an introvert and my partner is an extrovert. I like my alone time and I'm also at risk health wise, so I'm staying in as much as possible. My partner is going out for groceries, and a run a day and that's helping him. He's also on video calls with friends a lot whereas I'm less. It's going well so far but we'll see how it is with time 😂", "sickofreading": "Yes, I am an extravert but need a fair amount of time to myself, and my partner is the most introverted of introverts. We cope by going on a walk most days so we can have an activity to do and by me spending a lot of evenings video chatting with friends. He sometimes joins for an hour or so and then goes off to do his own thing. We've also been doing friend pub quizes once or twice a week which he likes because structured socialising is easier for him so he doesn't have to come up with something to say and there's something else to focus on!", "morillo__gladys": "I’m really happy I’ve gotten my profit from Mr kravets I started binary trade not quite long and it has been going smoothly for me and there have been no complaint with him @kravets_fx_trade I have gotten a profit of $12,580", "sarahmikaelaa": "My partner is an extrovert and I'm an introvert. I love wfh and feel more relaxed with no commute and less oversight. For my partner wfh is tough because he needs daily coworker interaction. It helps that we've got a 1 bedroom apartment. I can be quietly working away on my own, and he can have all the zoom meetings he needs in another room. Mostly this experience has drawn us closer together 💛 (so far 😏).", "kdanger45": "My partner and I are in the same boat!! I’m an extreme extrovert and he’s an introvert! We just spend certain parts of the day in different rooms! We have two other roommates so I’m fine with them and he gets to be alone", "sarah.davs": "Yes!! Extra so because my introverted bf is busy writing his thesis and revising, meanwhile I've been furloughed and have nothing to do all day except annoy him haha", "jasmin3lise": "Yep, my bf is an introvert and he’s having the time of his life (only slight exaggeration). We work in separate rooms so he gets to have a bit of quiet and I can run around in the rest of the house. We tried working in the same room and it was awful! Would love some tips tho!", "viopedia": "My bf is slowly starting to go crazy. He especially misses going to the gym most days of the week and having a set routine, seeint his buddy and stuff. I'm fine with being inside and playing Animal Crossing all day. We finally went on a short walk today, so that was nice 🌞", "caitlinlewis__": "My partner is an introvert and I am very very much an extrovert. We live together, myself being a student of a closed university, him being a worker of a closed factory. So we are in full isolation together. Most of the time things are great, but as you can imagine he often struggles with never getting some form of break from eachother. As I'm an extrovert, it doesn't bother me as much as constantly being in people's company is something I love. We've set a plan that he gets a few hours a day to himself, in a separate room. I can, of course pop in if I like, but I want to give him that space so he can rejuvenate his energy with some me time. It seems to be helping him alot. For all those out there in a similar situation, know that the odd argument is normal. This kind of situation can be a struggle for both parties but working together is the best way forward xx", "simply._.alex": "introvert and loving it", "hanagazeley": "We’re two introverts but our child is an extrovert (work that one out!) and needs loads of attention. As an only child she doesn’t see any other children except the kids we bump into at a distance. We’ve sort of worked out that we do Class A attention with a walk, crafts, tickles, baking etc until 3pm, then the tv goes on and I recharge my introvert batteries. I tried giving all I had all day but the three hours between her bedtime and mine were not enough!", "moraespes": "You just gave a name to my relationship... Thank you. Please share!", "hmay_yyc": "What a coincidence: My name is Hannah and my partner is named Dan, and I am an extrovert and he is an introvert! I’ve been off of work for two weeks (I am a teacher on a modified summer schedule in Canada which means I get two weeks of spring break) abs we are now just starting to tackle how to balance needs. The biggest thing we’ve landed on is not hanging out as much during our respective “work days” and scheduling in time at night for each other, while being mindful of our needs to separately connect with friends and family. So far it’s been okay, with the exception of a few instances of me being extra social and him being extra in need to quiet. It’s a bit tough trying to navigate this in a small apartment, but we’ve also managed to carve our separate spaces in the home for each of us, whereas before only he had a separate office (I have a desk in our dining room now).", "mazcirca1984": "Interesting I'm an introverted extrovert (husband is the same) so we can spend time apart doing other things quite happily. We sometimes WhatsApp each other from different parts of the house", "acllos.shop7": "DM FOR COLLAB 🌸 @acllos.official", "jennymwhittaker": "The phrase \"I really like you, but I'm going to go and have some alone time. I really like you by the way\" has been very helpful. 😂", "damn_your_kiss": "I'm pretty good at finding things to do at home but my fiance is struggling as he is very much an extrovert. Me working from home while he is just isolating has not been easy for him.", "norwichbooks": "My wife is an introvert and I'm more singing and dancing so we just need our own space sometimes!", "niphredil12": "Im an introvert and have been unemployed a lot over the last 5 years, so this situation is 1. Kinda nice and 2. Kinda familiar to me. But my fiancé is an extrovert and was in the middle of his internship working with teens, active, outside, etc. so he’s seriously struggling and it’s hard for me bc I cant relate", "gustempler": "Not myself but my parents are one of those couples! I've noticed my Dad (introvert) making a lot of small things to make my Mum's (extrovert) experience less traumatic, like keeping her busy by watching her tv shows with her, pulling out old tapes and lately baking pastries! It's quite adorable ♡", "em_milner095": "Yes, me and my bf are going through the same thing! Looking forward to hearing your tips...!", "letitiakiu": "Yes!! I keep my extrovert habits on animal crossing and talk to friends. That way I don’t exhaust boo with too much conversation", "sdsrstephen": "mmmm that body so sexy", "saskiahorton": "This is the COOLEST topic evaaaa! Much needed conversation around this 🙏🏻✨💜", "plessixmarceau": "@martinplantade", "laurentvianaud": "The 2nd photo is very pretty", "danieljbrain": "Not a couple. But I have one really out going social flatmate and another who is very reserved and with me somewhere in between. We have agreements in place that if we're feeling the cabin fever. Announce it in the group chat, we'll do our best to accommodate. Extrovert housemate seems to need a bit of shit Talking during the day while he's working so that's my job. Pop in and talk shite for half an hour then leave him be. It's working well so far", "_chalkstory_": "Spend time in different rooms away from each other 🤷‍♂️ thats if you get irritated with one another", "kel_leesi": "@a.mich.burn.book I have never heard anything more relevant to you", "k.rlijn": "Love the outfit!", "lovelyawe": "I'm an extrovert and my partner is an introvert who already worked from home full-time. So basically he is living his best life because not only has very little changed for him, now I'm home all the time which he loves. 🙃 I on the other hand am going crazy and struggling with keeping my brain under control and not spiraling out of control. He tells me to video call people a lot.", "frejarose_": "My boyfriend and I are currently apart but both in self isolation. I am very much an extrovert so rely on others energy to get me through and he is an introvert. Obviously I am seeking the interaction all the time and he isn’t necessarily responding, we’ve had a chat about both of our needs but these are still very testing times, I think for me especially! Any advice is greatly appreciated, I’m starting to go crazy on my own 🙃🙂🙃", "littletrini": "Having this exact issue. Other half not coping well with my 'need to be entertained'. Main coping mechanism is me just trying to occupy myself so as not to annoy", "beccadargue": "Yep! Isolating in a small flat where I need alone time and my partner is grumpy from being stuck inside all the time. Would love to hear what you came up with 😂", "amzie_lopez": "My husband is an extreme extrovert. I love being home. We go on walks. Do FaceTime with his parents. Try games and activities and personal time.", "barryaldridge1983": "Not going to lie I have been able to self isolate really well as I did it a lot before the Lockdown probably after my birthday in February where I couldn't do much because of money but this really helped.", "megan.barstow": "I'm isolating with my girlfriend right now and althought i wouldn't exactly call her an introvert (I'm an extrovert), she definitely is more comfortable with staying inside and away from people for long periods of time. We've definitely been learning how to respect our own needs without the other having to follow the same behaviors or schedule. Even though we're now seeing each other time, it's important to be managing ourselves and not trying to manage the other person's life just because they're there.", "guistjean4": "So hot 🙌", "victoriacallanan": "We have this dynamic going on here too. Husband is an introvert and can work from home with no issues, I am an extrovert but one who needs complete silence and no disturbances to work well from home. I have been doing some video calls with friends but really struggling as it’s not the same and doesn’t energise me. Interested in the ideas you’ve come up with and all the best for the next few weeks in lockdown. 💛", "megan.harrison_": "Love love the dress, where’s it from!?", "jackcorthinephotovideo": "I’m just learning to direct my extroverted energy elsewhere so I don’t end up becoming excruciatingly annoying 🤣", "beetoledo": "Not my partner But my sister is super extroverted and wants a lot o attention hahahaha", "mela.swayze": "The introvert / extrovert dynamic in isolation must be wild! Good for you for naming it and acknowledging it - makes it a lot easier to process objectively without placing blame. 💜  Thanks for sharing!", "dailycreativecourtney": "Hubs is an introvert, I’m an extrovert! We’re staying mostly in separate rooms during the day and I’m doing loads of FaceTimes to get my people time spread around.", "madlittlegreenone": "Your dungarees are fucking adorable"}