{"flissskiltonriley": "Rent bikes and cycle round the tiergarten", "__efferremme": "Tempelhofer Feld, Kluncherkranich, Teufelsberg and check out some clubs (Sisyphos just to name one)!", "lenas_coloured_memories": "Holzmarkt!", "naimanader": "Omg I'm from Berlin:)) paul linke ufer and admiralsbrücke is rly nice to have some chill drinks in the evening, you lucked out on the weather!", "_juliajule_": "Visit the Restaurant Mugrabi :)", "ausdemakoerbchen": "go have dinner at the aaamaaazing restaurant ”Mädchen Ohne Abitur“!!! 💞", "elly.anders": "you should go to the flea market at Mauerpark, it's every Sunday and honestly so so cool!!", "thegreatfoxby": "If you want to have a look at sex Ed/sex positivity in Germany go to „Other Nature“ a vegan, feminist sex shop in Kreuzberg (U Mehringdamm) 🔥 they also got a Book section !", "alexlunamarie": "Lots of currywurst! 🌭", "marinamwirth": "You are in Berlin😍welcome to the city of crazyness and beauty. Shopping Tipp: @changelingerie in @mallofberlin_ . the place where I found amazing bras for the first time and am still going for their bras after three years now. #lovetheirbras #bigboobs", "frustraitlin": "Head over the dead chicken alley for cool graffiti, a brilliant comic/zine shop, and make sure to get a ticket for Monsterkabinett (give it a google, it’s an animatronic/circus show thing that shows most evenings)!!", "grace.gallis": "The Berlin dungeons and do a river cruise it's amazing!!", "xdfrxnz": "Berlin was geht ab? Wo seid ihr?", "dom_random_c137": "Wow. Actually here rn. The reichstag dome is pretty cool and it's free too. The memorials are worth visiting too, quite sobering. Jewish memorial. Roma and sinti memorial. Soviet war memorial, and definitely the berlin war memorial. The DDR and Checkpoint Charlie musuems are pretty interesting although a little overpriced. Also the topography of terror. Very sad but very detailed and well done. Worth a visit.", "koralgolster": "Museum für Kommunikation for some interactive fun 😀", "philthecaveman": "I love how the ivy has grown! It's great 🙂", "kirsten_tensen": "Mauerpark on Sundays 😍 also the RAW is an amazing area with lots of cool places and cool street art", "faithwarbler": "Love love love Berlin. Definitely check out the Egyptian museum", "tanjaktx": "it’s Pride here tomorrow if you haven’t heard ☺️", "anna_blsr": "And if you need to cool down a bit visit the Badeschiff. It's a beach club at the Spree that has a swimming pool in the river. Also tonight there is an awesome street food market next to it at Arena Berlin! Great food and music. :)", "solelymememe": "Du Beast in Neukölln is a wonderful open mic location that hosts every thursday and is also a great bar any other day :)", "mrs.annahovakimian": "❤️❤️❤️", "s10_fftb": "This top again ❤️❤️❤️❤️", "abihoper": "The Stasi Prison Museum. Really difficult emotionally but so worth a visit", "pindorela": "Watch the sunset by the Landwehrkanal! 💕", "_keiradoody": "go to Cafe am Neuen See it’s the most beautiful hidden spot for some food or drinks at night time!!", "maia_loubee4": "Ottos workshop for the blind! X", "rmenzies3032": "Hannah if you make it to the city centre of Berlin the Motel One Hotel Bar has more gin options then you can think of, if your up for a night cap", "franziniska": "Hello there. Hope you still read those comments. Today I’d recommend you to spend some time at the “Wannsee” to cool down a bit... that’s where locals go to as well. And in generell I highly recommend a free guided tour though the Reichstagsgebäude and if you can’t get any tickets for those you should at least go and check out the dome of the building.", "magali.decleyre": "You look great! (Not Berlin related)", "claire.collins2000": "If the weather is nice, go to Strandbad Wannsee for a nice afternoon on the beach", "dave.georgee": "What abt vienna", "fisoglou": "Mustafas Gemüse Kebab is the best take out", "erin_goes_for_a_walk": "@berlinerspreepark ... so good! Creepy and weird and lovely. Plus the guides were really friendly. (Really informal “tour”- basically they’re just there to make sure you don’t get totally lost and answer questions)", "sinceresally_team_kalani": "Hey Hannah! cute insta. Let’s collab.🍒 Msg main account @cherrychapstickswim and tell them we sent you!", "hannahlovesncis": "La Focacceria at the Fehrbellinerstr. 24 is a great place to eat if you like something different than just plain pizza😁", "alena_elei": "Cupcaklade is a super cute cafe in Schöneberg", "krisserstorm": "Victoria park! Nice park with a great view over berlin in Kreuzberg. prinzessinnengärten, it’s a lunch restaurant also in Kreuzberg, where they only serve dishes made from their own grown vegetables. There is one dish pr. Day, and it changes day by day, and sometimes they sell out and then thats it. And you sit outside and eat 😄 oh and you must eat their kebab, it’s the best i ever had (at least compared to Danish kebab) 😋", "danielafd": "The \"Jüdisches Museum\" is one of the few sightseeing points I recommend to everyone. The architecture of the museum itself really struck me.", "groot.daantje": "Teufelsberg! (devil's mountain) Only the locals know about it and the history of this place is wild.", "veggie.in.training": "Check out Potsdam for some culture and great atmosphere if you want a day to just be strolling through parcs looking at excessively beautiful castles 😊😍", "alexandrak_89": "Berlin underground tours- really interesting and great guides. I also like the museum district and just walking along the spree", "nycsally": "you should definitely go to the flea market in mauerpark if you're there on sunday!", "libby_ayres": "I’m going there tonight!!", "jacquelinexlondon": "Burgers at Peter Pane! They have loads of vegan and veggie options too and make the most amazing sweet potatoe fries!!", "mudpumpkin": "Klunkerkranich! It's a beautiful rooftop bar ✨ and for parks, gleisdreieck is reeeaally nice ☀️", "photovirgin_": "Me and wife came across one of your videos going back to when you had stoma op.....You never stop smiling you've inspired us... were knackered we've Bing watched", "ash.hunt": "100% you have to do an underground tour!! There’s a WW2 bunker that was too close to a metro to be destroyed, so it’s still there like a time capsule and the tour guides are fantastic!", "bea.trice.bacci": "get a beer and just chill on the landwehrkanal in kreuzberg it's so beautiful and such a casual berlin vibe!!", "akshay0bhandari": "Also - the German Spy Museum!", "saskialeach": "Berlin Zoo is meant to be good 🦁", "alivegurl": "Visit Nusantara if you ever fancy Indonesian food. It was a great place to relieve my homesickness when I came for a visit 😌💞", "lilaaaaay": "A Dunkin donuts hot chocolate is all I can recommend 😍", "claytonbouldin": "Potsdam is cool too.", "2019kenzu_dopethreads": "Love the vibe of your IG! Want to collab? DM @whiteyteethclub and tell them we sent ya!✨", "sandra.ga_": "How come I’m German and you seem to have seen more big German cities than I have? 🙈", "sabrina_haake": "You can do sight seeing tours by bike in Berlin. It's a pretty cool way to see a lot of the city.", "abi.rumney": "Burgermeister! It's so great! (As long as you go to the original one!)", "katiehorsburgh_": "Berlin recommendations: The Spy Museum!!! Bun Bao for Asian style burgers The Anne Frank Museum (So well done and so accessible with brail etc)", "lirum_laarum": "1) The templehofer Feld is great, it used to be an old airfield but now it has turned into an open space for all sorts of sports and creative things, or generally a great spot to chill or meet friends. 2) the cannel in Kreuzberg is beautiful, for example Maybachufer 3) the Bohemian village (Böhmisches Dorf) in Rixdorf is cute If you generally want to get the Berlin vibe - grab a beer at a Späti (the little shops you find on most streets) 😉", "gaetanharris": "There’s this kebab place that always has a line in Kreuzberg called Mustafa’s Gemüse Kebab, it’s cheap and filling and delicious 😋. I think it’s just outside the Mehringdamm train station? Highly recommend.", "iamsnoopy_3018": "You're so sweet💓", "emmalinakelly": "house of small wonder for brunch!", "juliaprksch": "CAFE MORGENTHAU !! All you can eat brunch, the very best!!", "saraluna37": "Monbijou Park! ☀️", "mollymer_": "If you’re there on a Sunday go to the flea market at Mauerpark! Alexanderplatz is also a great place to roam around, and definitely go to Klunkerkranich for a nice rooftop view (for an even more spectacular rooftop view check out the Berliner Dom, though it does involve a lot of stairs). Also the Reichstag building has a really cool glass dome. For food, I can’t remember your specific dietary restrictions but if you eat burgers I strongly second the Burgermeister recommendation, and if you can eat döner and haven’t tried it yet I would definitely do that! For coffee, Kaffe Käthe (I think it’s in Prenzlauer Berg) has some really nice ambiance. I hope you have an awesome trip, Berlin is my favorite place!", "ohmahlanta": "The DDR museum is 👌🏻 would def recommend!", "hotdamnitstessa": "Also the Holocaust Mahnmal is a sight to see, though I find it very hard to be around all the tourists taking cute instagram photos in a piece of art commemorating a mass genocide.", "lucyanncrocombe": "Definitely get yourself to the berliner dom (berlin cathedral), the views from the top are beautiful", "anlui297": "My recommendation is come to Frankfurt😁", "johannaposner": "If you go to the Lake Wannsee I would highly recommend going to the Liebermann Villa, it has a very beautiful garden and it shows how the rich people during DDR times lived their lives... It's also quite close to the place where the Wannsee-conference took place, I can highly recommend going there as well, it's very interesting but also very exhausting", "faselwesen": "Ohhh Welcome (back) to Germany!", "amberrxc": "icebar or monkey bar (monkey bar is at the top of the 25hr hotel and looks over the zoo!)", "charlottermitchell": "The panorama museum", "kaarlenemeier": "Minty! It’s a Vietnamese restaurant Schönhauser Allee 134 10437 Berlin!  If you want some history stuff, I went to Sachsenhausen concentration camp! Did a tour there in 2016!", "sextalkwitheleni": "Clarchens Ballhaus - watch people take dance classes while you eat dinner, then join in! 💃", "a.grygiel": "The vegan curry wurst close to ckeckpoint Charlie, with a giant sausage on the roof ♥️", "the_unicorn_with_a_camera": "Would love to visit Berlin! Have a great time 😊", "kiahj11": "Tiergarten is BEAUTIFUL for a long stroll, it’s 5/10 mins from the Brandenburg Gate", "maddieu_": "Free light show at the Reichstag every evening at dusk", "marcelscharf": "Hope you’re not sweating your boobs off in this heat these days 😉😄", "crumblpie": "Also \"Haferkater\" for ultimate hipster and very good oatmeal porridge in numerous variations.", "florencechollet": "Have a drink at the Klunkerkranich ! It's a very chill rooftop bar/café and my favorite place when I lived there ☺️☺️", "really.ruthie": "The Bauhaus Museum!", "tove_westerling": "I did a project in school on the Jewish museum last year and it seems really interesting", "_gracelatter": "Also, look up Mobile Kino. Loveliest guys, and a cool af moving cinema.", "lisa_story_of_my_life": "On Saturday here in Berlin is Pride... Also I really like the Teufelsberg. It's an abandoned place from the cold war... Really interesting.", "supersteph163": "Vegan capital of the world 😁 find the vegan doughnuts 😍", "kampfkaetzchen": "Tukaduis heaven for extraordinary jewelry", "kunterbunt1995": "I live in Berlin, would love to show you around 😍", "marchapri1may": "I went to Berlin for a Uni research trip in March. Would definitely recommend the two zoos, if you want something a bit different then Tier Park Zoo is great. There’s also a really cool place called Tufelsberg (that’s probably very badly spelt) which is a disused spy station built on top of a man made hill. The hill is made of loads of rubble from the bombing of Berlin which was piled on top of an unopened Nazi training camp, it’s very interesting. There are loads of conspiracy theories about the hill and the spy station", "matildaspivey": "Badeschiff outdoor pool!!", "alysgwillim": "Kreuzberg and Mauerpark flea market. They do karaoke in an amphitheater 😂❤️", "alexandra_i_a": "Kreuzberg and Friedrichshain are beautiful parts of the city. Lots of younger people and students. The vibe is a bit more alternative than other parts :)", "babitferreira": "It has been 4 years and Hannah is still looking for something she lost on the ground lol 😂😂😍😍", "rachellucygreen": "Bikini Berlin is a really cool concept mall near the zoological Gardens!", "leoja_21": "You should definitely check out the farmers market at the Maibachufer in Kreuzberg (Tuesday & Friday)! There is also a vegan donut café called Brambibal's which I absolutely love :D", "nikolaj_87dk": "I remember going to the Jewish museum and the holocaust memorial site, very powerful 🕍❤️", "c.r.boxer": "Stasi museum for sure", "quel100s": "The free walking tours...just go to tye website and check the time...I learnt so much about the city and so kany funny antecedots and the guides nromally are really charismatic...highly recommended", "missele12": "Deffo do Checkpoint Charlie and the wall. Also Brandenburg Gate and the Reichstag", "_ha.nnah": "4 euro cocktails at the restaurant/bar outside the Mercedes-benz arena (by east side galarie) also Kreuzberg/Friedrichshain area is really cool.", "william.geis": "Five Elephant roasts some of the best coffee in the world, go to one of their cafes!", "introvert_ali": "The computerspiele museum - its a museum full of video games that you can play, they have alot of retro stuff there too", "deanmorris90": "I always loved walking down the tree line boulevard on the way to the brandenburg gate and then taking a stroll through the forest on the other side", "jegography": "Oh, and the natural history museum there is really good. Lots of interesting exhibitions, but the brachiosaurus steals the show; it's so mindbogglingly tall!", "friedloeyenmaex": "You gotta check out the computer game museum! It has a lot of old school arcade games!!", "finarfine": "Yes, take a train to Cologne 😅👍", "lewis.robinson98": "If you get the chance Potsdam is awesome if you haven't done it (like half hour train out) basically Prussian version of Versailles with the Bridge of Spies, Sanssouci and a lovely town with a Dutch Quarter :)", "lux_immanuel": "the jewish \"Mahnmal\" is a must see and also the \"Museeumsinsel\"", "ruairidh_smiley": "You should definitely check out Dussmann das KulturKaufhaus! Its a beautiful multi tiered bookstore in the city, they have a great english book section, spent like 2 hours there when i went over in February 😁", "novelvet": "mauerpark, @brammibalsdonuts , hackesche höfe, east side gallery :)", "lucymnorth": "A bar called 'the pub' near Alexanderplatz do amazing burgers and the best mai tai :)", "eve_westwood___": "Go watch some buskers and street performers by the spree in James Simon Park ❤️", "saraharyoung": "Are you here on Sunday? Go to Bonanza coffee - for a coffee then mauer park is just next door great family and fun vibes! For a drink on Saturday afternoon you should go to tanzfläche At Monbijou park! Highly recommend!", "pia_maria_rsk": "Go to the Tempelhofer Feld 😍", "meganxrse": "The SS Museum is really interesting 💛💛", "2galaxies": "definitely visit the museums ! also Mauerpark on Sunday, Boxhagener Platz ( and surrounding area ) !", "jenny.day.wunci": "Welcome to Germany! Will you be traveling to any other German cities? 🌈", "bitsy.pout": "Go to the Reichstag parliament building! Also dowload the app 'lime' and scoot around on those electric scooters - so cheap and quick. Berlin Zoo is also amazing-the most species in any zoo in Europe!", "julianrice13": "Digging the shoes!", "sofi.kaefer": "Monkey Bar/Zoologischer Garten. Klunkerkranich/Rathhaus Neukölln. 1990 Vegan living/Boxhagener Platz. Enjoy your time in Berlin! 😌😌", "haendchen": "Oooh, we‘re there this weekend as well. I think there’s pride on Saturday, at least that’s what my friend told me. The Ramones Museum is really fun if you fancy some weird band pieces but their cafè is super nice as well! Definitely go to Friedrichshain and visit some quirky stores (the hipster touristy place right now lol) and amazing bars! (The Dachkammer for example) If you fancy museums I’d go to the Naturkunde museum because it’s really cool.", "j0nahh": "Hop on hop off buses are sooo worth it. You can do an alternative route it’s a green bus? If you go to Alex’s der Platz they’re there. We did it a couple weeks ago and it was so good 🙌"}