{"rowan.coogan": "i love your swimsuit top! where is it from?", "boncure": "You are so strong and beautiful !!!! 👍👍😍😍😍", "grace.pwr": "Amazing, girl!❤️👏🏼", "brooke.tw": "💛", "linnerfors": "Omg omg. I got a stoma when i was 6 years old. Had it for 14 years. Went though absolute hell when it comes to body image. I wish people like you exsisted ob social media when i was a kid 😭👏❤", "miu.iroomba": "What's a stoma bag?", "methos_3155": "You're so beautiful... and your hair is getting long...I love it...", "shelliegail1986": "Such a cute bikini! 🙌🙌🙌🙌🙌", "missmandalayofficial": "You look amazing in our Southbeach bikini 🙌🏽😍👙", "jj_squirrel_star": "So proud of you for giving it a go! ❤️", "raquellezmar": "How many times do you have to change your box?", "stevehit1999": "❤️", "eliushi_thelifeshelives": "If you just feel better with high waisted bikini bottoms i think it;s better to just wear them. If i understand it right it's not only that you feel insecure, but it also doesn't feel good phisically if the stoma isn't coverd with a tight peace of fabric so it doesn't move etc. So if you want to feel good all day on beach days, i would choose the high waist bottoms (not for other people, but for yourself). But anyway, low waist and high waist bikini bottoms both look gorgeous on you. I personally would hardly notice your stoma. I'm so proud of you that you do al the things you like, because you are just a gorgeous young lady.", "josephbriscomb": "🔥🔥🔥", "xoxo_emmab_oxox": "My dad had Colitis and has a stoma bag and hasn’t been swimming in at least 10 years. I think you’re very brave. ❤️❤️", "cloutieralain21": "👍👏", "nolimitsostomy": "Love this Hanna! #ostomyproud", "lumoslisa": "@little.sunsprout", "ostomyturkiye": "You are a great example and a source of morale.👏💪👋🙋 Greetings from Turkey👃👃", "jameslawhorn7882": "You are always beautiful 💕💕", "hockeyhoff7": "😍😍😍😍", "alishavw98": "@olivia_helden", "nicolas.mata.925": "❤️", "yvonneagram": "🌈🌈👏", "demorecroft": "@sarah_with_the_dodgy_bum if you don’t already follow @hannahwitton you should!", "lynniejolly": "Xxxx", "rhonarabble": "Only thing I thought when I saw this pic was she looks like she's having an awesome time. No thoughts on the bag until read the blurb.", "395northwest": "Oh, bless you, @hannahwitton! You make Ostomates proud! Thank you!", "rae_holtz": "Fluffin fabulous!! 😍", "erinsevink": "So much love ❤️", "yesiegabs": "👏👏👏", "risaalitchi": "You look so amazing!", "_amelia.h": "I’m so so proud of you Hannah. You look radiant also 💘", "mi_chael8386": "Have a wonderful time.🔥😍", "milogweilz": "❤️", "hannahbiksadsky": "You are so bloody amazing!", "wessywok": "@vanillablush high waisted bikini bottoms have an internal pouch, which help me notice my bag even less!", "bodyhairpositive": "So happy for you! You look happy 💖", "eirinikardamaki": "Omg I'm so proud for you. This made my day", "krazy_1972": "❤️🙌", "samsan20012": "Congratulations on dominating your fear! 👏👏", "ostomummy": "You look amazing. Well done. Love this picture! ♥️💪🏻", "bloodhoundfostermomx10": "You look beautiful!!", "taragrant18": "@alexmcturk13 this brings me hope", "adp429": "Need more biki pics", "paul_chewy": "Looking beautiful Hannah x", "wellness_by_norah": "So proud of you!", "haleyannebechler": "That's such a cute bikini! You totally rocked it girlfriend! 🙌🏻💖❤️🔥", "hancwilson": "@hannahwitton you look amazing!!!", "andyirish91": "You are very hot", "rmoyer25": "🔥", "jillybeanez": "💕✨", "fevertrip": "aw good for you man", "gazcrooksculpture": "Love it 👏❤️", "mabelryto": "👏🏻👏🏻👏🏻", "jasondanielsauthor": "Well, you look beautiful in it :)", "almanamiali": "Pls put the high waisted and that's it", "imgovind_ashi": "Hanna u need to work on your fitness baby as u r really fat, it looks bad on u seriously,", "gelfling6977_": "Hi Hannah I am a stoma a grandma. New to the game. You make me so proud. I really admire you. Dosent the wate", "jason_jdubb": "You have sexy curves", "emjayuc": "yesssss go girl 🙌 I was self-conscious the first time I wore low-rise bikini with my bag too but felt liberated after I stopped caring what people think. I’m with you though - wearing high waisted is just more comfortable and feels secure when you’re in the water. congrats on the milestone 💜😘", "angaxa": "You look so great Hannah!", "nathanwickens": "You look amazing and beautiful as you are, most ppl don’t care or worry about your bag. Your so inspirational xx♥️", "millwright93": "👏👏👏👏👏👏👏👏🇨🇦", "chronicallywitty": "You look Fab in this! Thanks for giving me perspective on body image.", "liveeeeehhhh": "This is a beautiful story and photo. So proud and I hope ur so so proud of yourself. ❤️", "smokey4861": "🔥🔥🔥That was awesome good job I’m happy u 👍🏽👍🏽👍🏽👍🏽❤️❤️❤️❤️❤️❤️😍😍😍", "leahwitton": "Love you xxx your amazing xxx", "dknicholson1990": "@hannahwitton still beautiful no matter what", "dreamngo4it9": "LOVE THAT TOP!!!! Where’d you get that?!?", "alakinamann": "You are a queen", "paul.driver.1401": "Looking stunning 💚 rocking the bikini", "ianmack17": "Btw you look and are amazing", "smackessy": "@niamhdebraa like wow! Body positive at its best. Hannah is absolute #goals", "ellio_94": "Is it alright to get your stoma wet? Like it doesnt affect it?", "motorfish": "HONESTLY you are a spectacular human and the world is damned lucky you walk upon it", "qtminou_and_me": "Just do you as comfortable you, you are always assume and beautiful 💚", "franzthegreattt": "Thiccc💯🔥", "mvporange": "Well done👍👍👍", "beechwood567": "It's great to show that if your got a problem doesn't mean you can't try things out.", "the_mahala_show": "Do you mind sharing why you have a stomach bag? I’m a new follower :)", "larryvanmersbergen1": "❤️ Very sexy", "chinobling03": "😲😲😲", "jeffevans6627": "You look gorgeous, as always!!", "rdelvax": "easy for me to say, but it's \"just\" a bag, nothing to be ashamed of... Now if you had a face like mine for example, that would be reason to stay inside 😛 I don't have a beard for nothing 😅😂🤣", "jxtskx": "🙌🏼❤️", "amber.the.sad.potato": "Well done!! 🔥 It seems like you could use the low rise bikinis for sunbathing and lazing about but need the high waisted ones for activities! High waisted things are so sexy! 🔥", "_alexsmith23": "@billiejademartin1 inspiration right there", "gayrudegrrl": "Love this whole concept 🌈 except please don't use \"girlfriends\" when you mean friends, it sheds darkness on lgbt girls when we use the word in a lesbian way, a.k.a. it's not helpful (just perpetuates heteronormativity) 🌈", "katieew94": "You SLAYING 🔥😍❤️", "hajof": "Yey you! You look amazing! 👏🏻😍", "wholeheartedlyjk": "To be quite honest, I didn’t even notice the bag initially. I didn’t see it until I read your caption and had to go back and look! Your confidence is beautiful, as is your physical being!", "finlaymackaydesign": "You’re strength of character is amazing, another milestone crossed ❤️ comfort is everything keep smiling it’s infectious x", "simpeers": "You are amazing.", "amberdoigthorne\nVerified": "Verified", "carlaturner_leoga": "❤️", "delia0684": "Well done Hannah! ❤️❤️", "_xox_abi_xox_": "So inspirational, well done💕xx", "katermurray": "@aimeerosemurray @stevehit1999", "vollermagie": "Congrats, hannah! That milestone is yours!:) thanks for the honesty☀️👏🏽", "ryan_underwoof": "Still fit thou Hannah", "lyndsaykancher": "You look terrific! 🙌", "ollii1995": "U rock xxx 😎🤜🔥🔥", "coreaestheticsltd": "YESSS keep raising awareness. Cala D’Or is our favourite place to holiday. Enjoy 😊", "aweebitblue": "firstly, you are rocking that bikini. secondly, I’m so glad you didn’t make yourself persist with something that was less practical and comfortable in the name of body positivity. the flapping and filling while flapping sounds annoying at best. glad you’re enjoying your holiday, paddle boarding looks fun!", "marianne_power_writer": "Wonderful!", "jenbob1990": "Looking gorgeous as always darling. By the way, if you're that side of Mallorca, I'd suggest visiting Sa Coma. Went there with my boyfriend a couple of years ago, lovely place xx", "kaylabsimon": "You da best 💖", "dbaldingbaxter": "You look great!", "caitythistleton": "You 👏🏻 are 👏🏻 gorgeous 👏🏻 SLAY", "richard.1384": "Congrats and screw what others think. You got this.", "thechronicpainlife": "❤️❤️❤️❤️❤️❤️", "jay81uk": "Is that really a see through stoma bag?", "craftyrenate": "What an amazing picture! You look so happy, beautiful and confident. 🌞😁 What a victory that you did that, woohoo! 🙌", "bethshew": "😍", "unfugius": "Looks Good 👍👍👍", "ale.was.here": "Hell yeah! Body positivity for the win!🙌", "melusinepa": "I'm proud of you! You look stunning", "ericleslie80": "You look great! 😃", "rosie_roams": "You look awesome😍i always go for high waisted too. Just feel more secure and helps with those bulging situations!", "rrcassandra": "So lovely!!! ✨", "jelliefizz": "LITERALLY SO PRETTY", "miska.serdelova": "you are so amazing Hannah! ❤️", "stinekristensen_04": "You are a fucking boss, Hannah! Keep doing you 💪🏼", "abfab_rozee": "Hope you're having an amazing holiday! You look amazing 😊", "christy_.cooper_": "❤️❤️ Such an inspiration to people of all ages", "the_spectacled_bear": "Go girl! You look fantastic.", "wernee49": "😍😍❤️❤️", "cherrined": "Amazing 😍", "pfrebold": "... understand what you are saying ... not the same but ... my grandfather used to say, clothes should be put on and not be a worry, not need constant adjusting, they should be out of mind.", "hetalaakso": "Hannah, you are such a big inspiration to me! thank you for being so honest about everything! i also appreciate you telling about living with a stoma, it’s really important to raise awareness about things like this! you are a superwoman! 💛💛💛", "jamierosedee": "you look beautiful and happy. i admire your bravely to be so open and honest online. don’t let anything or anyone stop you from being you ❤️❤️", "stefaniajw": "I am so happy for you", "chronicallytravelled": "Yassss Kweeen!", "olivetreetis": "Yaaaaas Hannah, glad you felt comfortable to do so, and you look fab! Understand going back to the high waisted though, but you rock both. Woo 💕", "adrianoalvessales": "@luciana.sales.984 olha ai", "erinmaglietta": "👏🏻", "library_of_imaginations": "Is this stoma temporary or do you have to wear it for the rest of your life?", "gman4realz": "👏👏👏", "mindbodyguts": "Well done! 🥳 I do a bit of both too", "ann_liseeva": "You look WONDERFUL", "_amy.wells_": "Yaaaaaaaaaaaass!! ❤️", "competent_equestrian": "You are incredible", "emfoulds14": "Comfort over fashion for sure 💕🙌", "ksbkitty3": "You look SO cute, I love this bikini on you! Where is it from?", "nommsynoms": "Rocking it 👏👏👏", "wisemamawitch": "Totally understandable, I wouldn’t consider that a loss at all! It’s a win for figuring out what feels best for your body. Physical comfort is as important as body positivity, arguably more important IMO. ♥️", "heymadelyne": "Work that bag girl 😍", "lilly_lametta_": "I AM SO PROUD OF YOU!!!!🔥❤️👏", "coreymaybin": "Hannah, you look beautiful. The best feeling is when you reach point when you don’t give a shit what anyone thinks.", "kbmq60": "You look stunning 😍😍😍", "jamiewalllbank1990": "Go you 👌😍 look amazing too", "samanthazoz": "Just a question. Can you Buy Anything that Has a hole for the Stoma Bag to Sit in? sorry if that's a stupid or silly question! just wondering xx", "tjamieson23": "You are rocking that bikini and that beach. Happy and healthy looks good on you!💪🏻💜", "shsketchesanddesigns": "I see no bag, just a lovely smile. 😘😂😂 xx", "james_p_carr": "Bit of a legend, you are.", "keith8420": "You look amazing 😍", "livstrother": "you’re incredible Hannah🙌🏻", "justicekenneth57": "Just so Sexxxy HOTTT An BEAUTIFUL", "phylkd": "Just look at the smile you’re wearing 👌🏻", "domesticdiva53": "You look lovely. And so does that beach! Enjoy chica!", "missele12": "Yes girl! I prefer high waisted or swimsuits for exact same reason. Just holds bag tighter so it’s not flapping about. Have a fab holiday! ❤️", "aharp82": "👍👍🙌🙌❤️", "hannahj8558": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "jenvano": "Congrats on the milestone! Glad you had a great day regardless! ❤️", "rach_timmins": "Well done hun xx", "kaymonmichelle": "You are absolutely STUNNING ILY✨", "amalbarks": "Chapeau 👌", "emlouiii": "Yas!!! Congrats & well done! Amazing what the support of our main sisterfriends can do for us 🖤", "rebecca__judd": "Looking AMAZING 💪🏻 I wore mine on show this year too but like you it just gets in the way, I’d much rather be comfy which my high waisted bottoms give me👍🏻 well done though; all about the little wins isn’t it 🤗", "teapetrichor": "❤️👑", "adriansims28": "You go Hannah !", "drzoewilliams\nVerified": "Verified", "yogiwillow11": "Fuck yes Hannah!!!!!! Your an inspiration", "rjdorsey": "I love how confident you are in your beautiful body! I'm still trying to get there but I did get a beautiful Freya swim top this summer", "lisagillespie_": "Can you swim with a stoma bag? I work with a lot of stomas but that is a question I’ve never asked🙀 also you look amazing!! 💜", "veryberrycosmo": "Babing ♥️♥️♥️ so proud!", "star.marvel": "proud of you!! Little wins are a huge ass start ! And you look stunning by the way ❤️", "ciarandefaoite": "Well done Hannah 😍😍😍😍", "sarahvlootman": "I saw a girl on the beach with a stoma today and didn’t even really notice it. Because you showed so much of your stoma on your youtube/instagram it didn’t seem weird to me, even though I’d never seen someone with a stoma before. Shows how much effect your content has! Keep up the good work and positivity, you’re doing great!! 💖", "jade_mg": "Congrats!!! 🙌🙌", "cbirdward": "❤️❤️❤️ @ibekimbo", "andymedinar": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "colitis_mummy": "You look gorgeous!", "henry_pollard": "😍😍😍", "mattricjacks91": "Truly inspiring. Well done!", "lettingitalloutofthebag": "Love this 💜💪🏻 you look amazing 🔥 xx", "eltoria\nVerified": "Verified", "jemappellekaz": "You have no idea what an inspiration you are ❤️", "alivelittleman": "Nice rack.", "infamouswitcher7": "You look fantastic", "julieahowell": "Whoop whoop 👍🏻 fantastic achievement well done you 👏🏻👏🏻👏🏻", "xjade97xx": "Well done💕 love all your content on here an youtube. Very inspiring", "texteb": "👍🏻❤️🌹", "joey.zaza.986": "Thicc!😍", "guhreefoh": "Gorgeous 💖", "christiannerisman": "I have the nicest pair of black high waisted bikini bottoms from ASOS, they are high leg so super flattering and a cheeky bottom for max bootylicious vibes. I can send you the link if you want! You looks amazing 😍", "jopineapplesuk": "Well done @hannahwitton - you look joyful ❤️", "fanofcallie": "Way to go Hannah!", "brian_wilson_1985": "Gorgeous! Love the smile.", "brian.rees.792": "Well done babe🤩🤩🤩", "katy_crockett": "Where is the Bikini from? X", "ibd_katie": "Well done!💗", "belairophon": "You look great", "themusicofalice": "You look so beautiful and happy 💛", "leahdawn98": "💜💜💜💜💜", "chloeameyx": "Proud of you you look incredible Hannah 💖", "gemmakhone": "You are amazing 💞", "jjk1120": "It's the little wins! Good for you!", "swervature": "I commend you. When I'm on vacation and my brain starts (foolishly) wondering what others think of me, another part of it overpowers it with, \"Who gives a shit? I'll never see any of these people ever again.\" LOLZ. You do you.", "thea_tre": "You look so gorgeous and fierce! An inspiration!", "firechikn91": "You are beautiful and amazing! A great inspiration! 🌹🔥❤️", "queenofquadz": "Looking freaking awesome!!!!! Xxxx", "avaniandlife": "You look amazing Hannah! Thanks for raising awareness for those who have stomas! 💕", "emsclark_": "You go girl👏", "dazzleridoo": "Gorgeous human being 😊", "janainaandradecam": "Fiz minha cirurgia vai fazer dois mês ainda não acredito, você precisou de ajuda", "melaniiemurphy\nVerified": "Verified", "hopecaitlintreasures": "Proud of you always Hannah!! 🙌♥", "ashley_osto_life": "Truly beautiful", "laurenbedford13": "proud of you💪🏻", "_kristincayla_": "You look amazing! 💕💕", "francescafragole": "Han I’m so happy for you! You’re so inspirational❤️", "lewis_dude2_bishop": "Wear it with pride x", "jodie.17x": "proud of you!! 💛", "neverenata": "You look amazing 💕 ly 💕💕✨", "notdeadjustyet": "this fellow stoma user/wearer is SO PROUD of you! and you look AMAZING!", "eshacindy": "Go you!!! 💛💛", "_kirstymcleod": "This is amazing! This week I went swimming for the first time in 4 years after having my ileostomy op! Felt SO proud of myself, took me long enough 😂 you look so fab! ❤️", "crohnswithme": "You look amazing 🙌😊", "thisthingtheycallrecovery": "Thank you for being so honest and giving those of us without a stoma a realistic insight so we can further our understanding! 💛", "lonewolfealex": "You are Absolutely Beautiful Hannah! I feel really bad that you have to have that bag but at least you conquered your fear! You are truly Amazing! Keep being Amazing!!!!!", "scarrednotscared\nVerified": "Verified", "tunes63": "I love your courage Hannah!❤️ You look sexy in your bikini! I would give you a smile if I saw you on the beach!"}