{"6tabsopen": "That reaction was how my partner knew he loved me. He travelled for work and missed me. Like a lot", "sarahsrabbitts": "My husband works away for most of the week, every week, so we are pretty used to long distance. Easier if there is a routine to it though and sometimes I miss him way more than usual(and I miss him a lot anyway) out of the blue. No advice tbh, but you aren’t alone in finding being separate hard! Love him so much and I try to focus on the next time I will see him ♥️", "ravenpuffleslytherdor": "I’m on a vacation out of the country right now with my family, and my boyfriend was traveling with us but flew home this morning since he starts a new job in a few days. I still have a week left before I can go home and I already miss him. Tonight is my first night without him there. It’s nice reading these comments and knowing I’m not alone either haha 😅💕", "katieew94": "My fiancé moved to Shanghai a few weeks ago to teach out there for a year. I felt nothing leading up to it then it all hit me at once when he boarded that plane, and I cried for days! I think it’s all about adjusting to a new routine, and seeing it as an opportunity to focus solely on yourself and do things you might have stopped doing when you met your partner. I’m making sure to talk to him every day and have rejoined the gym, something I didn’t have time for before. It honestly is totally normal to feel like you’ve lost somebody, even if they are only gone for a short while! I have more time for friends now too, so it’s all about the positives, and the little messages you can send letting them know you’re thinking about them ❤️ xx", "kyrstin_kayla": "Mine is leaving me for the first time and I'm not sure how I feel about this! I'm always the one leaving 😱😱", "songsaboutghosts": "LDRs are completely different because them not being there is the default (once you've been doing it a while)! Getting into it in the first place, you need to believe in why you're doing it and you need to keep yourself cared for and occupied as much as possible independently of each other.", "abbie.bm": "long distance requires a LOT of communication. visiting each other every 2 months, constant whatsapps, daily skype calls, and a collaborative stardew valley farm help me and my partner :)", "amberwoodxox": "i survive by staying single😭", "marinasertam": "@karoljstutz pessoas generosas e fofas compartilhando suas experiências ❤️", "chadmcsteely": "@altruisticabby", "anissiya.art": "I die every day. Also cause I don’t know whether I’m ever going to touch him again. He’s on another side of the ocean, and neither of us has visa to each other countries and can get it any time soon. We can only afford a couple of short video calls per week.", "lydp": "My boyfriend was gone for ONE NIGHT this week and I could barely sleep. Yet I sleep like a baby when I’m the one that leaves 😂 go figure that one out!", "fairiepoppy": "Some of us are not so lucky as you as to have a partner and every night is lonely missing that person who no longer holds you in the night Xxx", "deerdust_": "My partner of what will be 8 years in December is going away for SIX WEEKS in January for a uni internship and I found out last month and have been crying about the very idea of it since haha - we haven’t been apart for more an a week or two in our whole relationship and I have no idea how I’m going to cope!! (spoiler alert, I’m not gonna cope)", "sagaafriman": "Me and ny boyfriend lives 7 hours away from each other. Trust me, this is me reaction every time after we said goodbye to one another and when i have to sleep alone after a weekend together.", "outesspace": "see, these are the perks of being as lonely as can be: you don’t miss your partner when they go away because you simply don’t have a partner lmao", "rohitankam": "shaggy n welma", "jazzjazzflora": "Omg. My girlfriend is currently in Japan (for 3 weeks!) and I have being on the struggle bus! I’ve had a very similar experience, thank you for sharing— I am so grateful to feel seen, validated, and a little less alone💘", "larry.amend": "Get a pillow made from one of his worn shirts; so you'll have something to hold with his scent on it.", "63jacs": "No. I love the peace and quiet and space. Plus I have a Labrador for company.", "gemtakesphotos": "Totally the same but usually then get angry at my husband for him not being here 😂🤦🏼‍♀️ cos I’m nice like that 😑 #hormones", "mimsiemcd": "Yes. I find this so difficult. My husband often travels away for work and although it has got easier over the years, I can still find it really hard emotionally even after 6 years of it.", "marie.photog_": "@hannahwitton I'm exactly the same, I guess once you get used to the routine of being with someone who makes you so happy, being without them is just so confusing and overwhelming. Humans are social animals, we're not made to live alone. Try spending time and reaching out to friends in your area to take your mind off it, that's what I like to do. Or I just distract myself with video games 😋 Hope you get good sleep soon!", "girlwithbigdreamies": "I have no fuckin idea how they do it - and I'm saying this in process of becoming one of those people", "salem874": "@hannahwitton, yes most definitely!! Well...kinda... Long story, but I (yes, as a male) was an absolute mess emotionally when someone had to go. Felt empty...never knew that kind of feeling was even possible... well, I guess I did, but it was a new experience for me 😢😢😢😢", "animalsoupoftime": "My wife worked in Edinburgh for the summer while I was home here in Canada, it was honestly kind of brutal. I thought I had handled it well until I realized I was using really unhealthy coping mechanisms to cover up my loneliness xD", "heather_marie_5": "His cologne on a teddy bear or pillow case, and either good night messages every night, or a letter written before he leaves that I don't read until the more difficult nights. There definitely is a difference between being the one leaving or the one staying behind. It just hits harder. (I also steal his side of the bed lol) 🥰", "ruxandram3": "Bf is away from Wednesday to Sunday and it’s so hard and I feel so silly cause it’s not months we’re away but every week it’s hard and my Sundays can never be ruined cause I know he’s coming❤️ so yeah, I know what you mean gurl 💗", "pink._.moon_": "@mokrani_zizou I get super emotional 😭😂❤️", "_jojosaurus": "My partner (also called Dan) went away for gigs and festivals and I genuinely cannot sleep in the bed by myself. I have to have his pillows and wear one of his shirts to feel relaxed.", "kmhayes218": "I hate it when my husband goes away. I (mostly) keep it together pretty well during the day, but dinner and bed time are awful!", "the.mrs.turner": "My husband and I were long distance (lived about 2.5 hours apart, not the worst but still awful since we were both in college and very busy!) during all of our dating and engagement (about 3 years!), and it sucked!!!! We hated it, and now that we’re married we’ve only been apart for more than one night once, when he was away for a whole week, and I almost went insane 😭 never realized how bad I was at taking care of myself until I had to live alone for a week! Also I was a complete wreck and absolutely sobbed the first night he was gone! Love it a crazy thing 😂", "crimsyy1": "I know your pain!!! I'm in a long distance relationship myself xx", "jamtoastxx": "My partner and I have been together almost 2 years and he's been a FIFO (fly in fly out) Engineer the whole time so you would think by now that I'm used to him being away but it still gets tough sometimes. Not having him to snuggle into when I roll over in bed in the middle of the night and can't sleep or not having him to give me a hug when I'm feeling a little down, that's the worst part.", "nicolecorp": "Mine just left for two weeks, and the day he was leaving I was really grumpy and mad, and didn't know why. Turns out it was my tactic so I wasn't upset instead.", "destcmndr": "Typically in long distance relationships, you never get used to them bring there all the time. So it doesn't have the same effect. At least that was the case for me. But in my current relationship, yes, I feel different when she's gone.", "perplexterry": "It's so nice to hear I'm not the only one who has that (or had that because I'm single now).", "tiffy.lo": "I am in a long-distance relationship and every time meeting up is an emotional rollercoaster. It helps me to think that long-distance is a new phenomenon and people might not be build to take the distance and the short time spans of seeing each other easy. Guess there were no long-distance hunter and gatherer romances :D", "stacey2161": "My partner 2 years ago was diagnosed with Chrones (you know all too well) and was in and out of hospital alot while they tried to find something to stabilize it and that was so hard being at home alone at nights especially, knowing that they were in the hospital (1.5 hours away from where we live) and in pain made it all worse so i know excatly how you feel! Luckly they have now been out of hospital for over 12 months ☺", "meanpantscaitie": "My boyfriend is gone two nights out of the week for work and it is surprisingly hard. I'm glad to know I'm not alone! I try to make sure I can get out of the house those nights or at least call or text a friend.", "pinkjar_": "My partner tours 200/365 days a year. It’s really really hard and I wish anything made it better but it just gets sadder??", "lisakateostomate": "Me and my OH are long distance and it was really hard at the start, we both cried our eyes out when I had to go back home. But 4 years on we manage ok and see each other every month. We Skype every night and txt/what’s app call every day too. So as time had gone on it’s not as bad as it was the first time. But it is hard don’t get me wrong, but I wouldn’t have it any other way. Can’t wait for the day we move in together. I sleep with his T-shirt next to my pillow and he sprayed his aftershave on it. So it’s nice to have there when I feel sad. He’s got Crohn’s too so it’s hard too being apart when one or both of us isn’t doing great as we can’t travel. Im in Ireland and he’s UK. It’s hard being away from the one you love, but I know it won’t be this way forever.", "vanessairenelata": "In a long distance relationship. We always make sure to go to bed together of a night whether it be phone call or video chat. It’s comforting to hear his snoring lol. Whoever’s awake last will hang up right before falling asleep or if we both fall asleep then it’s when we wake up after a sleep cycle. Luckily we have unlimited calls. 😅", "ellierae98": "My boyfriend has been away for 2 weeks on tour and ohmigosh I can't remember what sleep is. I miss him and the security and safety I feel when I'm with him and its really affected my sleep and anxiety. Weve been together 3 years and to be honestly, it never really gets easier for me when he goes away. I have to keep myself super busy seeing people and staying with friends and family a few nights x", "nicolelouiseeeb": "@allisonnelliott your twin I swear", "tater._pot": "My boyfriend only lives 45 minutes away but we can usually only see each other for 3 days every other week because of our work schedules", "supersoniccheeseburger": "When my boyfriend and I first moved into our apartment, he got a second job. Meaning he worked 60 hours a week sometimes. It took me such a long time to adjust to him not being there to hangout with me and I was not used to be alone! I would sit at home on a Saturday when we would usually be out and about, while he worked and I sat at home and cried because of how alone I felt! It makes me appreciate all of the time we do have together much more and it did take time to adjust to the differences but I can confirm, things like this are normal ❤️ any kind of emotional environmental change like that is hard! Xo", "georgiagraynz": "We did long distance with a 10-12 hour time difference and 30 hour flight 😅. We had two rules that made things work. 1) always reply to messages, even just to say sorry can’t talk right now (or send a message to say sorry I’m off my phone this time to this time today). 2) always say good morning/goodnight. Some days that’s all we had time for. But we survived 18 months, seeing each other only 3 times in that time. 5 years later we’re preparing our wedding.", "casa.olins": "My husband and I were long distance for the first five years. It was unbelievably hard! He now travels for work a few times a year, and I spend most of those weeks losing my mind. I think back to when we were long distance and wonder how we ever put up with it. (LOVE, love is how we put up with it 🤪)", "phoebzy": "Same for me here. My boyfriend has started working and I'm still studying so it's hard for me being alone at home all week long. (in the evenings he works from home, so we don't spend much time together.) it's especially bad if he stays over at a friend's house. My anxiety kills me and I can't sleep knowing he's out. It's pretty bad. I always thought I was possessive or crazy. Thanks for that post and all the comments!", "jesscalutz": "My man and I have been living together for almost 3 years now and I'm a mess everytime he goes away. I always cry when he leaves and that lasts like a half hour. Bedtime is always the hardest!! It's so hard to sleep without him. I usually end up sleeping on his side of the bed because the pillow/sheets smell like him. It's totally normal. You live with someone because you want to be with them more than without them, and so having to be apart it hard. Especially when you are the one at home with no exciting distraction, just a home that feels to empty.", "natalie.caulfield": "I entered into a long distance relationship 3 years ago, UK to Brazil, I haven't seen my bf since April. So many people ask how it works and I don't really have a definitive answer. I really just love him a whole lot and I know from the times we are together that he is the person I want to experience life's adventures with. I've had plenty of sleepless nights and breakdowns when we've been a part because I miss him and the emotions can become overwhelming when we're not together. But I know we're doing this for a future together and it is only for a short while, in comparison to the rest of our lives together. So it's 100 % normal, don't worry about it", "lizzi_who": "I also always cry, but I just try to eat a lot of awesome food and watch all the trashy movies he doesn't like! I also always have some video on in the background. And cuddle with his pillow and sometimes a shirt or something :D", "jessicaashleyturner": "I’ve just returned home after working in Canada and meeting someone whilst I was there and we’re kickstarting a relatively new relationship with roughly 8 months or so of long distance 😂😭I plan to go back out there next year with a visa to stay but we know this is going to be hard!! And we’re only currently 2 weeks in 😩😭", "ffi_wuh": "My boyfriend and I are in a long distance relationship and it suuckkss!! We used to live only two hours away from each other but now he’s in Vietnam for a few months so it’s a bit harder 😂 I found taking up something new and having a goal to reach for helps like I took up running and I aim to be able to run and not be dying by the end of it 😂 keeps my mind busy and body so Keeps me distracted! It sucks but your relationship come out stronger than ever before at the end I hope you’re okay and it gets easier I promise !! 💕💕", "superloobyloo": "My husband spent months away at a time when I worked from home and I became a hermit! Getting a dog made a huge difference for me then. He kindly popped home for a week for our wedding, but was gone for another month after that 😂 I work in an office now so I'm alone less, and we also had a baby recently which keeps me busy! Not suggesting you do that though, haha! It's just normal now I guess, but I just distract myself with chores, shows and projects x", "elisabetom": "I just see my boyfriend on weekends, and we just have a day and a half to be together... And this is kind of my reaction everytime he has to leave. With time I'm getting used to it, but it is sitll difficult.", "theepicplace": "I’ve done this! I’d be away traveling and not get why my girlfriend was so sad until I was the one alone at home for a few days and it hit me. 💕 I agree it’s proof of love 😂 or chemical addiction but still it was good to see what it’s like for her as well.", "olly.olly.oxen.free": "Whats weird is the first night he's gone it doesnt feel weird, but each day is harder for me. Therefore, I make my suchedule focused on me and try to be tired when I go to bed so I dont think about it. Sometimes I make a body shape out of pillow so I can put my back up against it, throw my leg over, etc. Having that person gone when they are around all the time is hard.", "heyitsmeganvalerie": "@shevvvy94 it’s not just you😂", "ninamaiac": "Long distance is hard! Just spent the weekend with my boyfriend and I'm dreading going to bed alone tonight... 💔", "rarelyjovial": "My boyfriend was away working on Love Island this summer and when I watched one of the episodes (where Tommy’s waiting for Molly with her cuddly toy) I fully broke down and sent him a voice note telling him how much I missed him. At least I think that’s what I said, it was hard to make out through all the sobbing 😂 Perfectly normal to miss your partner. You’re not alone 🥰", "soffiparraguirre": "I have the same reaction. My boyfriend goes away for a month every year and it is the worst. The days go by so slow", "daisy.twizell": "My bf and I are currently long distance bc of uni, and omg it's hard. It does get easier after those first few nights, and eventually you'll develop your own routines as well as one you share together. It's painful, but you can get through it if you really love each other - that being said, absolutely cannot wait until we're together full time ❤️", "samtea": "I’m in a long distance relationship and was an emotional dumpster fire last night with the realization we only had one night left together. I felt silly and embarrassed and overly dependent, but hearing you have the same feelings makes me feel validated and “normal”. Thanks for sharing 💕", "alisonjohnson._": "My boyfriend spent 2 weeks in hospital a few months ago and I went and stayed with my Mum! I couldn't handle being in the house by myself, it just felt so wrong him not being there!", "alexlunamarie": "My husband and I have never been away from each other very long and it KILLS me when he has to go away even overnight...when I travel, at least I have that to distract me, but when he travels, I'm a mess. 🙈", "lyonblood": "I always like to think I’ll be fine when my wife is away for a night, and then I’m an absolute mess!!!", "_c.l.e.o_o": "I live in London, so does my girlfriend. But we got together in my first year of uni after being friends for about a year. However, I got to uni in fucking Cornwall. 275 miles away from London. It suuucckkks ass and we broke up on Valentine's day this year. Then I came back and now we're back together. But we've basically talked everyday for 3 years and now I'm going into my final year of uni. Apart from going back home as often as I can, and talking all the time, I just countdown the days until I can see their dumbass again. We also don't live together back in London, so it's kind of a LDR all the time which is a bit shit. But this is my last year so, I'm hoping this'll be the last time we are that far away from each other. I have to go back to uni in a week and I'm not excited at all.", "hproctor96": "I met my boyfriend on my placement year in uni, so it meant going back home to do my final year and being long distance, and honestly I think the fact that I was so concentrated on uni helped massively, so I reckon if you have some sort of 'project' to completely distract you, it makes it a little easier, but also I was in the environment that didn't remind me of him, it must 100% be harder when you already live together so the home is that constant reminder. Still would not recommend in the slightest, it's also hella expensive too 😂", "thetsundokuchronicles": "Ahh i knowhow you feel. When my husband goes to visit his family i hate being at home alone. I tend to binge watch shows on Netflix in bed and order pizza to help me through. It does get easier to manage though that feeling never really goes that you miss him. ❤️", "charlottereadsthings": "Used to go 2/3 months without seeing my partner and then we moved in together and he went on holiday for a week and I was just a total mess. Don't know how we did the distance for 5 years 😂", "chronikayleigh": "My partner and I don't live together, but we have a routine/schedule of when we see each other that's pretty consistent. Wednesday & Saturdays. This weekend we were both sick so we missed our Saturday. On Sunday we video called and I broke down in tears cause all I wanted was to curl up next to him. Even though we don't live together I still have trouble sleeping and am a big baby when I'm sick and without him. I'm glad to know I'm not the only one who gets that way when without their partner!", "gemc200": "We text all the time and send each other memes. It makes me feel like we're having a long, constant conversation. It really sucks 😭 I miss his smell and being able to hug him whenever I want. He lives in another city for uni while I've got a job so it's harder for me to move. I do all the travelling. It can be tough emotionally and physically (I tend to travel on a Friday after work, back again ON Sunday - 220 mile round trip) but we love each other so we make it work and I'm proud that he's getting educated in a thing he loves to do 😁💜", "gemmabliss_x": "It feels like your missing a limb..", "ohthatkimberley": "This happens to me when @michaelrisley is away, I become a crying mess and make up songs about how awesome he is. I miss him so much! 😭", "madgie.smith": "I‘ve Been long distance with my bf for 2 1/2 years. He moved away to go to Uni just 3 months after we started dating and we stuck it out. Don‘t know how we did it, but I still remember the first year was hell. He‘s moved back now until february to do an internship and we both couldn‘t be more over the moon with it! I Love him so much. It was so worth the wait and we‘re both glad we didn‘t give up on our relationship in that first year ❤️", "madelinepound": "My partner of 3 1/2 years moved to university this weekend, and I’m doing the same in a few days. We’re not seeing each other for 6 weeks and it’s hard... what more can I say ☹️", "shirinroseking": "My husband had to move from Sydney to London nearly 6 months before I could follow him, and I broke down sobbing into his dressing gown the first night without him. The rest of the 5.5 months I was alright, mostly because I went to stay with my parents, but my husband had a hard time on his own in a new country 😢 He made friends, but it wasn't the same. We're fine now though ☺️💕", "zoefarrugia": "Literally I’m away all the time and my boyfriend is about to leave me for TWO WEEKS, and I’m a mess already!!", "meganewrites": "The first few months of long distance are rouuuugh. My partner and I started long distance after only dating for 8 months when we both went back to our hometowns after college. We were only 8-10 hours away by car (2 hrs by plane) but it was still rough. But eventually we got used to it and we just fell into different routines of showing our love for each other. Every time we saw each other (usually for a few days/week every three months) it felt like a vacation. After a year of long distance, we now live together after I got a job near my partner. We love each other very much, but I’d be lying if I said we didn’t enjoy our time away from each other. If he has a late photo shoot, I get to cherish my alone time 😍", "rnl.alicia": "A few weeks back my bf went to his parents' for a week, the second he walked out i cried my eyes out, i even caught myself smoking ??? (He's a smoker and im not), who could tell i was THIS stressed by my new job haha", "ellieclairesmith": "@andrewdine96", "51_mran": "When I was with my ex-partner I found it really tough whenever we'd be apart. We split up six months ago and I still find myself doing the exact same thing, so maybe I'm not the best to give the the advice (I'm clearly not right in the head)...", "hahnsolo74": "My boyfriend and I just had to start being long-distance back in May when he got a job in a different part of Texas. It’s rough but we talk on the phone every day and visit each other when we can. Although it’s not fun, I have found that we have been able to spend a lot more quality time together when we see each other and I know we won’t have to be long-distance forever.", "brittamosxo": "I’ve been with my boyfriend for 3 years and we’ve never actually been together. He has been at university for the past 3 years and now I’m in Canada and USA travelling and next week we will be reunited forever it’s going to be so strange!! Just keep in constant contact with each other even just little messages and give yourself things to look forward to when you do see each other xx", "gabhain_sa_ghairdin": "Awww cute", "alicehayward123": "My boyfriend is at uni and I get to see him at least once a month. It hurts most around this time because I’ve spent summer with him and got used to him being around then he’s suddenly not here again 😭 Don’t worry, even though we’ve being doing the long distance thing for over a year it doesn’t get any easier. I cried my eyes out to him last night on ft (what a god ft is) and will probably continue to do so. The best times are when I’m enjoying doing something with a friend or family member and I get a message from him telling me he misses me. It sucks but like you said, it means you really do love them. Good luck Hannah, you’ll get through it x x x", "starlightpixie": "This makes me feel so much better about how much I struggled with my boyfriend being away. He had to work abroad for 6 months, he came home on the weekends but if anything I feel like that made it harder. We’d only really get a day together, but he’d be exhausted from travelling and I was just a mess (it was also bad timing because I lost my job at the same time so generally was miserable). We’d only moved into our flat 6 months before this, so I just couldn’t cope with being in the flat on my own, I cried myself to sleep most nights - it stopped feeling like home. I honestly don’t know how people manage to make long distance relationships work, those 6 months nearly broke us, but we made it out the other side. Sorry to hear you’re also struggling, but as you said, it’s nice to have that bit of proof of how important he is to you 💕", "niksmyshka": "Boyfriend and I used to be long distance but we moved in together 2 years ago and now I already miss when we are apart for one day 🙈", "goetze_kim": "I recently started a long distance relationship and we try to video chat every night when we are in bed... most nights I fall asleep while speaking and wake up to a lovely message from him telling me how cute I looked asleep and other nice things 😊🥰☺️", "rlellingham": "I don't always deal very well with my partner being away and she really struggled with how I didn't cope. I had to do so much work and planned to be nice to myself when she wasn't around, including cooking myself actual meals and watching tele she doesn't like! I still find it hard but it helps! Audio books for bedtime for deffo as well!", "sheylight_": "My husband is military, and is gone more often than he is home, and it's a struggle. He just left for Germany yesterday, and I'll be joining him in a couple of months, and the hardest thing I've done is say goodbye. I mostly try to keep myself busy, and keep moving, otherwise, I'd curl up and not get anything done.", "charlylizz": "My husband is away helping my sister with a bit of a crisis, and even though I'm so happy he's supporting her I miss him so much 😭", "florencechollet": "My boyfriend just left for a month in hospital to have a big surgery done and I am a m e s s ! I wanted to ask you if you knew what the difference between co-dependency and a healthy \"I'm going to miss you so much\" moment is.. I usually am very independent and even solitary but yea... I miss having my boi around 😔", "katryna_": "Wooo nelly my husband went to a conference in the states when I was 12 weeks pregnant and it was about the most separation anxiety I’ve felt in my life.", "pascaline003": "@laurafrge si ça peut t'aider à te montrer que tu es \"normale\" ;)", "miriammutig": "We have our own appartments which i love. But when we've spent many nights sleeping in the same place or after a holiday together i have trouble sleeping alone. I used to also having to get used to his presence again after some time sleeping alone but now its pretty much only when being alone again.It‘s a lot less tho! It all becomes more normal after a while", "secretlifeofabooknerd": "Yes. My partner and I did long distance for almost 4 years before we were able to move in together. Half a year we were on different continents. He is currently on his first trip without me because of work and it is so strange to be apart again after having lived together for two years. And I'm like you were Im the one who travels a lot.", "mandyceline": "I used to struggle a little on the longer trips, but now I just take it as time for me, and have the gals over or go visit friends and have some over due quality time or crash at theirs. Also do some masks and have a self care routine. It includes a long ass bath with netflix too. I try and spin it positively. I miss him loads, even one or two nights, but it’s made me also happy to know I take care of me in those times. We’re really independent people and not codependent fo sure, but it doesn’t mean nights away aren’t hard sometimes", "meljmccab3": "I knew when my other half was going to be away for tour and I was going to be living with his parents in his home town. I joined an Amateur Dramatics group so I had evenings taken up and so I had autonomy over my own time despite him being away. It helped me find some kind of routine despite his chaotic comings and goings. It’s hard but try filling your time with the things you would otherwise feel guilty for taking that time up with? 💖", "amelia.kmm": "My boyfriend and I are long distance, and although I know you’ve said you and dan aren’t big on calling/texting a lot while apart, it helps me a lot! One thing my bf and I do if we’re going to bed around the same time is to fall asleep on facetime with each other. Helps to hear each other’s breathing even if you don’t actually have them there", "shortie_0211": "My boyfriend and I went from living 20ish minutes away to living states away from one another (Washington State to Utah, US). Any time we visit each other, the days after are always super hard. But he always leaves a shirt that has his cologne on it for me to sleep with, we talk every day, and try our best to only focus on the next time we'll be together, instead of thinking about the fact that we're so far away. I started to listen to YouTube videos too!!", "gabby_diane": "I don’t know how long distance people survive! My boyfriend doesn’t live with me but is about 10 minutes away. I get so sad when he leaves and then I don’t see him for 2 days. I tell him I’m a weenie 😂", "gaby_atho": "Me and my boyfriend both work away on cruise ships. We've been on the same one before and we've been on different ones. It's hell not having him there or just being able to pick up the phones (time differences and no signal) but it makes the moments that we share just a little bit more special. We don't have the time to ever get even slightly annoyed with each other, we're just grateful to have the time together that we do!🥰", "_maisieeemardle": "For most of my relationship, my boyfriend and I have been apart because of university. We FaceTimed every night, and visited when we could. This is my first year without any of that, so I completely understand your struggle. It is weird, not going to lie, but these past few days have been a bit wired emotionally.", "heloise_boyce": "My partner works away every so often and I have a habit of making spontaneous and usually pretty permanent decisions. Last time I shaved part of my head, time before that I got a tattoo, time before that was a giant cat tree that nearly bust the budget. I’m home alone at the moment actually but so far I’ve not made any big decisions, have had a few “close shaves” though. Not outta the woods yet though... this was supposed to be a “it gets better post”... sorry.", "zuzannajadwiga": "I couldn't sleep for months when get back to Poland and my partner stayed in UK. Cried 3-4 months almost every night. So yes, it's normal when you really miss your loved ones. It's getting better with time& practice.", "schreurs_anne": "Long distence awnser we don’t survive and specialy the moment they leaf and you are alone againe in your bed it is the worst", "natalieaseeva": "It's completely normal and will definitely become easier to deal with in the future! I still sometimes get a bit sad when my partner is away, but try to get the most of it, for instance, watch something that we normally wouldn't watch together, like a genre he doesn't like :) Congrats on your engagement btw! 😊", "sianpeters.me": "Yeah I’m the same babe. Lost my shit the first time my boyfriend went away without me. Have gotten slightly better with practice. But he’s hoping to go into the RAF so I’m like I NEED A DOG FIRST thank you please lol! Bonkers eh. Being properly alone for the first time was absolutely traumatic xxx", "asho_394": "With LDR’s it’s tough but if it’s worth it you make it work x cheesy I know but shur💗", "shannenstraveldiary": "Me and my husband have been in a long distance relationship for 5 years and just got married 3 weeks ago. He’s in Texas and im in Ireland. If we are lucky we only have 1 more year apart!", "beatrixhull": "My boyfriend works away for 8 weeks and then back home for 4 on rotation. You get used to it eventually, but it really makes you value your time together ❤️", "m.a.good.egg": "As someone who's mainly been in LDRs I think that not everyone *can* do long distance. The furthest I've done is Kiruna - Kiel and we didn't see each other for up to 3 months. More than that even I wouldn't be able to handle. The week or so after they/you leave is always the hardest. Routing really helps though, because at a certain point you know that you will get through this and you will see them again. The rest is just communication I guess 🤷‍♀️ oh yes, and having their clothes to cuddle. Nothing like breathing in their scent before sleep 😌 feel better soon 🌸", "beth.macaulay": "I’m the same, cant go a night😭", "ellencharlarson": "The comments on this post are so comforting! Lived with my boyfriend for the last year but now I’m away for work. Very lucky to be doing a job I love but have found adjusting to a new routine hard. It’s silly but having to buy meals for one again, cook it and then clean it all up has suddenly felt like such a chore! When I’m with J one of us cooks and the other cleans. We’re lucky that we can still see each other, more frequently than other long distance couples...just less frequently than we’d like! ❤️", "ashleenhora": "Invite a friend over?", "mariekexstoe": "In a long distance relationship and yeah, it can suck. But it’s not just physical distance but all things, good and bad, make me cry! I’m such an emotional mess with my boyfriend 😂", "danielvollstedt": "Started off long distance for almost 2 years across the country. Now with jobs that include a lot of travel, I find myself slipping into old routines again when I'm on my own for a couple of days. And I even like it sometimes.", "guesswho_mel": "I was exactly the same when my boyfriend went away for 7 weeks! Couldn’t sleep and was just always crying without him!!", "lorenthecrumb": "First time my partner went away for a week I was terrible the first night I was on the phone to him blubbing away", "heulwen.sj": "My fiancée travels a lot too and I hate it when he's away! Fellow pillow spooner here! 🙋🏻‍♀️", "nathalie.sophia": "Have been doing long distance with my boyfriend for over a year now and at the moment even with an 8 hour time difference. It’s absolute hell. But the first week is always the worst. 7 more months to go, don’t wanna go a single day longer.", "hollywood_maddie": "Me and my boyfriend were long distance for the better part of the last three years, while I was away at uni, and it was really hard at times, but I think knowing that you can be apart for that long and realising that your relationship can stand that kind of test, is a sign that you've got something really special 💕", "bammesdottir": "I live in a long distance relationship, so normally I am fine but the first night without my boyfriend is always the worst.", "orlagh": "Ahh my boyfriend and I were long distance for 13 months and could only see each once every 4-6 weeks. The physical ache is real!", "_milky.tea": "spray his aftershave and take as many baths as you please!", "alexmccormick95": "I feel you!! My boyfriend used to travel with work the first time he went away for a week and I cried so much and the day he came back, he picked me up from work and I cried so much!😂 I got used to it after a couple of months and thankfully now he doesn't travel with work :) but yes it's horrible!! Haha", "rachelelsewhere": "My boyfriend is two days into a month long holiday in Japan, and I thought I was really silly for missing him already / knowing I’ll miss him so much. Glad I’m not alone!", "charlotteblakeley1": "For 2 years I’ve been in Bristol and my boyfriend in Leeds... and I still cry and spoon my pillow and struggle sleeping 😂 just that addiction keeping us together ❤️", "rmenzies3032": "Hi Hannah my wife hates being by herself and I go away most weeks for work which is really not great. Makes you appreciate your partner more then you realise and makes you question why you go away and leave them when you feel this way. There’s a simple answer.... don’t do it. What you have described is you miss Dan when he is gone but you don’t miss him when your gone as your busy. There is not an easy answer.", "thepretentiouspoet": "Yeah, no sugarcoating, long distance suuuuuucks 😂 You get used to it tho, I've met my boyfriend twice and we've been together for a year and a half. I do like snuggling their hoodie while we're apart", "shortnsweet1413": "My hubby is out of town frequently for work (sometimes anywhere between a few weeks to almost six months once) and it definitely is not easy...especially since we're attached at the hip anytime we're together haha I actually took up reading again, made a gym schedule that included a yoga class several nights a week, picked up a bunch of projects and got back into some hobbies I used to love but thought I didnt have time to do anymore. Keeping yourself busy is my best advice. That and maybe getting yourself a giant puppy. My 100+ pound German shepherd/lab mix is my snuggle buddy stand-in while the hubs is gone and that definitely makes me feel safer and just generally better when he's not home. Stay strong lady! It gets slightly easier with time!", "annabananahere": "I’m married to a man in the army and I can tell you it doesn’t get any easier 😭", "daisyhvnter": "Thanking for posting this and making me feel a bit normal 😂 I thought I was the only one who went into crisis when he goes away.", "manonwy": "Yes🙋 I just binge series all night and do self-care like shower or a bath when I'm somewhere with a bath and go to bed way too late while hoping to pass out from exhaustion 🙈", "sylwia_soj": "It's diferent when you are not together all the time from the start. And also, you can get used to being alone. I like it for 2 or 3 days once a month, but after 2 nights apart i miss my husband like crazy. Our cat does not like it as well. Few years ago, we lived in diferent cities for a year and it wasn't as bad as I thought it would be. But we knew that i was only for a year", "flydorsch": "My partner has to travel a lot for work and it gets really hard. But then again you get some alone time and can do all the things you want on your time. And you get really excited for the time spent together. But it's still tough and I prefer it to have him home with me 😊😊😊", "deer.julie": "I can't spend a night in our flat without my boyfriend. I totally freak out, can't leave a room without a light on, I jump when I hear a little noise and I can't fall asleep unless it's the middle of the night and I've ran out of things to watch/read. The worst part in this is that I've always been like this even before living with my boyfriend. I can't live alone. I would loose my sh*t 🙍", "zarah2810": "My boyfriend is in London whilst I’m in Southampton and although we’ve done this for two years so far I still sob every time he gets on the train. It next gets easier but for me it proves my love❤️ @nathan_lacey"}