{"alicecoleman_": "I was on the pill for almost 10 years because of painful, heavy periods and have recently come off (married and if I get pregnant it’s not a big deal) and we aren’t using anything except vaguely tracking my cycle. I have had a steep increase in pain during my periods though but to my surprise my cycle seems to have snapped back to being pretty regular (I had one in 3 or 4 months on the pill). I’m aware of my options and will probably use an IUD after I’ve had children and will encourage my husband to get a vasectomy once we’re done. My contraception should be easy to use, reduced/light periods and not impact my mood in a hugely negative way. Currently, the ability to reverse its effects is important but once I’ve had children, this won’t matter to me.", "thelaurelwreathcrowned": "Why do health practitioners still push bs like \"the pill controls your periods\", \"the pill helps with acne\" when the pill has been shown (in studies) to not do anything beneficial to the body and to only help with symptoms (taking the combined pill will give you a bleed every 28 days, but it's not a period). As soon as someone stops the pill, their acne and irregular periods will be back. The pill doesn't cure anything, yet why do so many people (also here in the comments) say they're on the pill for acne? That just makes me angry 😤", "lilli99kh": "I went on the pill at 17. I stayed on that until I was 18. It was horrible. I had migraines multiple times a month, constantly nauseas and my mental health was bad at this point and it just made me 1000X worse. It wasn’t for me. Because of this, I just went to use condoms, yet when I got into my current relationship, I knew it would be best to get another form of birth control. So after 6-7 months of dating. I got the copper coil. I knew that hormones wouldn’t be good for me, so I just decided to get it. It’s been amazing. I now don’t worry if my period is a few days late, as I did with just condoms because of the just in case situation. And it hasn’t affected me that much, aside from making my periods go from 4 days to 6 days and my cycle go from every 35 days to every 30 days. A small change really. I’ve had the coil since May 2018 and I can have it until 2023, then decide to either get another 5 year coil or the 10 year coil. I’m only 20, so deciding to have a longer form of contraception wasn’t talked about much with me at my facility but, when explaining what happened with hormonal ones, my doctor did agree. I just wish that it was more open to think that yes. Women who are younger want this longer lasting birth control, so they don’t have to worry, instead of the pill, patch, mini pill ect. The common ones to suggest.", "sophiee444": "In contraception I want something that has minimal effect on my natural body state. So I don’t want my mood fluctuating or anything like that. I don’t like the idea of having something I can’t remove myself or stop taking myself. I do know all of my options yes. I don’t like condoms though as they’re uncomfortable. So I started with the combined pill, microgynon, I loved it but I kept on getting migraines. I was on it for like 4 years. so I switched to a progesterone only pill and that was for 9 months. I couldn’t cope with the side effects. I was constantly on my period, constantly in pain and just lots of issues really. I then got diagnosed with suspected endometriosis. So I decided to do something I never thought I would which was get the coil. The coil was extremely painful to get in. I had a terrible experience with the nurses and everything in the process. However since then it’s been fab. No bleeding, and my pain is normal for my diagnosis. It also stops further growth from my endo so that’s fab! The only thing I don’t like is sometimes it’s painful during sex. Anywho!! That’s my story ahaahha 😉", "andrepereira6167": "Enjoy ☺️", "peppieluna": "What matters to me is that it doesn't affect my everyday habits. I know my options because I researched them... but no one explained to me that there was something else than the pill when I first asked for a contraception. I now have a copper IUD but will probably have it removed soon... so I'm back in the game of trying to figure out what works for me 😭. So sad cause copper IUDs seemed to be the perfect contraception: you don't think about it, it doesn't have any hormones and it's super efficient.", "kailey_h424": "I’m on a combination pill and have been for three years now. My partner and I also use condoms because I don’t take ANY chances concerning pregnancy. I’ve heard about the pill having nasty side affects but it regulated my cycle and made it lighter, cleared my skin, and made my boobs slightly bigger. No complaints from me!", "ealuke": "Went on the pill as suggested by my gynecologist to treat my PCOS, so far it has worked well for me to manage that! Thinking of possibly switching to a different method of birth control once I have children, probably something a bit longer term like an IUD, but will need to do research/talk to my doctor once that happens!", "thatdeafgirlkj": "YOUTUBE CAMPAIGN: INFLUENCERS, CAPTION YOUR CONTENT! Hey! I am Deaf and looking for influencers who currently caption their Instagram/posts", "mirelleharris": "Excellent 💗", "teresa_herbst1": "Love that biscuit shape, 😊 please, where did you get the cookie cutter you used for it? X", "marinepoof": "Are you going to eat that??", "hannahmro": "I currently use the V-ring which, really works for me. It's nice that you only have to think about it once a month and can skip a period now and again if you want to. my menstrual migraines seem to have gotten better as well as I don't have such spikes and falls in estrogen anymore. The only negative thing is that my libido is practically non existing. Which makes me wonder what I'm actually paying for, as my sex life is suffering. I can't think of an alternative that would be better, as I don't want anything \"implanted\" in case I don't react well, suggestions?", "gracie.appl": "I was on the pill for a few years then got the implant when I was 18 and had that for over 3 years until I had it taken out. I realised I’d been on hormonal contraception for so long I had no idea what my my body was like not on them and mostly if my skin would be better without it... basically I’m the same but with freakishly regular periods and the skin of a 14 year old boy 🙄 I want to know what the best long term contraception is to manage my PCOS symptoms and whether I should be going back on the pill to manage my skin 🤷🏻‍♀️", "shelbymolluso": "I would like to know how contraception can affect your libido", "billiecupcake6": "I'm not sexually active but I'm very \"combine your methods!!\" when I chat with other ppl about contraceptives. I've mildly/moderately researched a bunch of methods, but I just use the shot. I have an ovarian cyst that makes my period unpredictable and abnormally painful with uterine pains throughout the month, so the shot makes it so I get a light period every 3 months and that's it! And I don't have to remember it every day like the pill or worry about it effecting my garbage skin like with the patch.", "vikipelyva": "It is true that the hormon pills can mess up women's natural hormon balance and coming off the pill may cause unregulated menstruation cycle?", "phoebzy": "I've switched to condoms because the copper iud freaks me out (I've had a hormonal one and I had really bad cramping for 10 days, so much so I wanted to rip out the thing or just stab myself to distract myself from the pain) and I don't want/need any hormones in my body. And since I'm in a long term relationship, the cost of condoms vs. Any other method is actually really good! Let's face it, after 3 years in a relationship you don't have sex twice daily haha", "jesspenhallow": "I am currently on the skin patch and it works great for me. I wanted something that didn't involve a medical procedure or lots of appointments but was longer lasting than the pill so that I didn't have to remember to take something every day or fret if I was away from home and couldn't take my pill. I found out about it from my friend in spain and was surprised that I was never told about it as a contraceptive option. My doctor had no issues putting me on it once I asked and I've been using it for 5 years with no issues (except the curious looks when I wear a bikini!).", "meghanmurphymusic": "Can you ask about non hormonal/natural birth control like tracking your cycle? I have chronic illness and my body is very sensitive to the pill and I am not interested in getting an iud because of possible side effects (my body already has enough to deal with). Thanks!", "kulkat2": "*of Super heavy bleeding during my period every month (its becoming less over time). Its definitely my preferred option for sure!", "nperkins03": "I’m currently on Junel Fe (the pill, I believe it’s a combination) for cramps and all the other symptoms that come along with periods. I would get horrible cramps and back pain all throughout my cycle. And along with that my periods were super irregular. Been on it for four or five months now and so far so good!", "ktchan1114": "I have metrorrhagia recently (lasted for 1 month) and (very) irregular periods. But it doesn't affect my daily life much and I'm not looking to have a baby anytime soon so I don't think I need a doctor. But do you reckon I should go to the doctors to have it checked and possibly take the contraceptics for regulating my periods?", "triin_truu": "Yaasssss, video with Dr. Dustin Costescu please👏👏👏 he is super sweet and knowledgeable 👍🙌 please talk about why women are afraid of hormonal contraception and if it is justified at all", "curlymaxx": "Check out the new free IUD news in New Zealand!!!! Put it in ur pleasure trove vids!!! So exciting!!! 💓🌟💓", "__amber__x__": "Love this! 1) I want predictability and to not have to worry about it. 2) Yep, have run through them all several times as I’ve been on contraception pretty much since my periods started! 3) I’ve got the implant in my arm, I previously used the hormonal patches. Went for it because it has the longevity of a coil without being the coil! I’m in the last year of my implant and will be getting a new one 🙌🏻", "maren_hilke": "I would be interested in why there is this myth that copper IUDs are only suitable for people with a uterus who have already birthed a child? At least in Germany there are some websites that say that you shouldn't get it otherwise and for most people I talk to about contraception their first reaction is that they are surprised to hear I have one. (I have been using the copper IUD for almost four years now and it works perfectly for me although I am not a mother yet 😉✨.)", "kitcaz": "What matters most is that it works! And I prefer things that allow for spontaneous sex (so not a fan of condoms, caps etc). I also vaguely have a preference for no hormonal, but that's just because I'm one of those people who can't have oestrogen, so hormonal options are more limited.", "xxcatrionaxx": "I really want to know more about the side affection like depression / mood swings / weight gain / loss of sex drive / acne and how common they actually are as its these that are scaring me from starting hormonal contraception (want to get implant as long lasting and no periods but worried with all these side effects I won't feel like myself )", "iamlucymoon": "🙌", "mattytaylor00": "nice elephant 🤣", "kristina.freeman9367": "Hi there. Here’s my answers: 1) what matters most to me is no fake hormones going into my body and not having to actively think about my contraception everyday, 2) I didn’t know my options until I realised that the contraceptive pill is not the answer to all our prayers - one visit to my gynaecologist lead me to get not just a copper IUD, but the lesser known IUB!, 3) I went for the copper IUB Ballerine because hormonal birth control sent me bat sh*t crazy (sorry boyfriend) and it actually made me depressed. So I went to the doctor and got the ‘copper pearls’ IUB Ballerine. Three months in and so far so good 😎.", "kaitlinelizlee": "What matters to me is that it suits my lifestyle and doesn’t impact my health, because I live with chronic illnesses, some of which are hormonal! I’ve tried a whole bunch of options and currently use the hormonal IUD and LOVE it. My naturally light periods are nonexistent and I don’t have to stress about side effects from the pill or about backup barrier methods failing.", "erin_aitchison": "I started on the combined pill for my acne and stayed on it for 2 years. I thought it was working well for me but it made my blood-pressure sky rocket and once I went off of it my mental health got better. My skin had cleared due to me getting older so I investigated my options and went for an IUS. It works really well for me and doesn’t impact my mental health. Took a while but it’s been the best option for me❤️", "jodieellis13": "What matters to me is not getting pregnant, and with my forgetfulness it needed to be something that I could get done an forget about. All hail the ius 😂", "cerysbuzz": "I have two wombs and two cervixes so I actually can’t have the copper coil (even though that’s what I’d ideally like) so the combination pill is what i take, and I guess what I’ll take till I’m ready to stop ¯\\_(ツ)_/¯", "rosie.liza": "The copper coil was so trash so I’m on the hormonal coil now and it’s gr8", "charloburto": "I was on the pill for about 4 years and just a few weeks ago stopped it and got the implant in instead. I stopped the pill because of depression and mood swings mainly, but also cause it's just a hassle to have to take every day. I haven't had the implant for long enough to know what it's like for me (I have my period right now but doc warned me it could take 3/4 months to settle down and become regular) but I'm hoping the lower dose of hormones will help with the mood! ... While still helping with the horribly heavy periods I get and awful cramps too.", "stormy.song": "What kinds of contraception are recommended for older women approaching perimenopause/menopause? And can hormonal contraception help with perimenopause/menopause symptoms? (I'm 37 and the hot flashes are too real!)", "shepherd3569": "too icing or not to icing, that is the question whether tis keebler on the shelf to suffer the choice of frostings, or to deny them ... aye there's the rubb... for in those empty tubs of frosting may smile be, or make such smiles and dreams are maid of... *grin*", "emily_greenwell": "I have an IUD bc I would never remember to take a pill mostly😂 I don’t mind it, but I have a lot of trauma surrounding the insertion/removal of my second IUD. Next time, I’ll be trying out the arm implant because I absolutely do not want to have the IUD procedure done again. I want to know why anesthetic is not considered necessary for IUD removal/insertion as it is an internal procedure with risk of accidentally shoving the device through your uterus if you move! Women are expected to tolerate too much pain/trauma when it comes to birth control.", "l_a_u_r_a__m_o_n_a_g_h_a_n": "I got the IUS around a week ago and started swimming earlier this month so I’m keen so go back. All information online says differently on when it’s safe to go swimming after insertion. Also can I use a tampon and if so what time?, I saw you can pull the IUS out of place taking out a tampon but if I’m spotting while swimming won’t I need it 🤔 all answers are welcome 💕", "andrewrtasson": "Ooh an elephant!", "ox8na": "are there any options for men besides a vasectomy? they always talk about stuff \"coming soon\" or \"in clinical trials\" but years later there still doesn't seem to be any progress", "taliathurbs": "I have a question! Was told I can't use a menstrual cup with an IUD. Are the disposable flexi cups different?", "cassiee711": "I chose a hormonal IUD because I know I don't want to start a family for at least ~5 years and having 1 less thing to worry about on a daily/monthly basis sounded so perfect! I've always been a \"rip the bandaid off\" type of person so even though the insertion was super painful for me, I'm SO glad I don't have to think about my birth control anymore.", "hiimlisaaa": "I've been on the pill since I've been a teenager because my mom advised me to do it and now it just feels like the easiest option! I dont want to go through the pain of getting the coil. Why is there not one good option without side effects/pain??", "charlottepw1011": "Currently on the implant because my memory is awful and I’d never remember the pill, I also have vulvodynia and vaginismus which means for me the coil could cause me extreme pain, and I’m too scared of the injection, but the implant seems to make me grumpy and fat 😂 so I’m at a loss really", "accio_hot_chocolate": "I've been on the pill for almost ten years, I started it because that seemed like the most \"normal\" option for women, and because I had really bad cramping and irregular periods - which I still really care about. I've been curious about coils but they sound really painful and possibly have side effects that wouldn't make it worth it for me.", "illyrienne": "I've been on the mini pill for about a year now, but what with Brexit and everything going on I'm considering getting an IUS, as the pill I take is one that's rumoured to be affected by Brexit", "laurars95": "I was on the pegesteron only pill at 19 as I figured that was the best choice, my knowledge was slim! At 24 I stopped the pill due it majorly effecting my emotions, moods and mental thoughts! I got the hormone coil fitted as I actually educated myself on contraception options and realising that there were options that meant I don’t have to think about it daily and a flare of Crohns shouldn’t cause any issues. It’s made me realise how little education is offered to young girls about the amazing options available and that the Pill isn’t always the best choice for people! I lost half a stone and went down two bra sizes coming off the pill, and my mental clarity majorly improved simply from the same hormone but a much better application. Thank you Hannah, you’ve taught me so much!!", "peckhamite": "Are my only options for non hormonal contraception the coil or condoms? Are tracking apps a solution?", "soph_.c": "I'm just about to have an IUS fitted, after being on the combined pill and then briefly progesterone only. Had to come off the combined pill due to risk of stoke as I realised I was getting migraines :/ but I'm looking forward to the IUS as I did so much research on it and is ultimately the best option avaliable. I find condoms unreliable and give me anxiety. Doesnt help that most of them contain Caesin (a milk product) and as I'm anaphylactic to milk that would end badly... Progesterone only seems okay as i've used it for 2 weeks however i know that the window is short and with brain fog from CFS and ADHD, I know it's quite possible to miss a pill. The thought of that also stirs up a lot of anxiety 😅 I was surprised that IUDs/IUSs just weren't talked about as much as an option - I guess it makes sense as it's intrusive, but it's more reliable and has less hormonal effects or side effects as contraceptive pills.", "trav.ellen.belgium": "I have factor V Leiden, which gives me higher risk of blood clots. Hormones, especially estrogen) increase the risk. This reduces my options for anticonception. I now have an implant for 2 years already. This is also my first anticonception. I don't have periods anymore, only some spotting every month or two. As I can't forget it like a daily pill, it is really stress free. My boyfriend also apreciates the fact that I can't forget it.", "oliviahopec": "Currently on the pill, I went on it when I was about 15 to clear up my skin and reduce my period pains, unfortunately I grew into the habit of not taking it exactly right every day and often missed pills so whilst I’m trying to get better at taking it at the same time everyday I still use condoms to be safe. Easiness is something that matters to me so I’ve been wanting to change to the rod so I won’t have to remember the pill everyday, However my clear skin is still a really big thing for me and my doctor said I can’t stay on the pill for my skin and have the rod, Is there any contraception that has both aspects: “fit and forget” and will keep my skin clear??", "jessicafowlerr1": "I’m currently on the implant which I started about a year ago when I started going out with my boyfriend. I did a lot of research before hand especially because of my issues with anxiety and depression. Honestly I’d love to know more about non-hormonal option because as much as I like then implant I’d love to be able to ditch the hormones 🤷🏻‍♀️💕", "annadreissig": "I’ve been suffering from depression for the past two years now and have gone back on the pill. I noticed I would always have extrem lowes during the end of my cycle, so just before my period, and taking hormones to disrupt my cycle has worked quite well to combat these :)", "luuferguson": "Been on the combined pill for yeaaaars but recently wanting a less hormonal choice of contraception, my doctor recommended the progesterone implant as it’s a much lower dosage of hormones...Heard that it can make you bleed for a year though 😂🤔 anyone have an implant?", "emiilyyy602": "For me it needs to be something reliable, preferably that I don’t need to think about because I’m pretty forgetful! I researched thoroughly before choosing the implant, which I’ve been on for the last 6 years, with pretty minimal side effects, aside from slightly sporadic periods. Went for it because super effective and long term (lasts three years)", "herrengels": "This is gonna be so useful and interesting!! I'd love to know more options!! Excited for this project. I'm myself using just condoms, but now in a monogamous relationship it's getting pretty expensive, so I was thinking about going on the pill but afraid of the side effects... Would love to know any other options and male contraception!", "nichcool": "Heyy so i've been through a rough time on the pill and got off of it for mental health reasons. Now i'm in a long term relationship and use condoms, though i would like something a little more carefree (kinks and stuff had us ripping and flipping all around a few times...)", "vixarooni": "The only contraception I'm interested in is my husbands vasectomy once we have another baby.", "kathrynintheclouds": "I started on the pill for like a month before stopping as if you're overweight you're more at risk of blood clots. I then watched every YouTube video including The Hormone Diaries to figure out what would be best for me and I came to the conclusion that the implant was the way to go. It's put in your arm and then that's you sorted for 3 years! I've been on it over a year and I've been loving it! Barely any side effects and if you're in a long term relationship it's perfect 👌🏻 but thank god for people making videos and breaking the taboo because without that I would have been so lost! 😂", "simply._.alex": "cutieee 💞", "kelleybellyjelly": "Unrelated, how are your teeth so stinking white?!?", "alexc010": "I’m on the pill but I think it’s made my acne worse (my skin got worse around the same time I started it and they’re all hormonal, I’m currently on one that is also used as an acne medication and my skin is still terrible) so I want to stop the pill but the coil kind of scares me - I would want the copper one because it’s hormone free but i’ve heard it can make your periods really heavy and painful", "bryony_hiscock": "I like to feel in control of my contraception (I don’t like the idea of having to wait for an injection to wear off or wait for an appointment to have something removed from my body), I’m overweight so my main option is the mini pill. I’ve been on it for 4 years and I’ve not had a period since I started on it. I’ve had very occasional spotting (like 3 or 4 times in 4 years). Also - it’s been reliable birth control for the 4 years I’ve been on it.", "d0000dle": "I'm on the implant, have been for 9 years and have just had my fourth put into a couple weeks ago. For me the most important thing was having something I don't have to take everyday because I am very unreliable. I've never had any problems, I still get periods every couple of months but it works well for me. I don't have to think about it and I'm safe from pregnancy. I don't need to worry about STD's because I've been in my monogamous relationship for 9 years too.", "emilylindsayewell": "I was initially in the pill for irregular, painful periods but even if I missed a dose by an hour my hormones were thrown off. I got the hormonal IUD because it’s a lower dies of hormones, I don’t have to “take” it, and it lasts for years. It’s regulated my hormones which has helped my PCOS, depression, and PMS symptoms. Granted, I still have issues, but they’re much more manageable.", "rebecca13_x": "What matters to me is ease and being as painless as possible. Despite no adult around me telling me what options I have because of you I've been educated on the different types of contraception. I've also used the quiz on the NHS website to help guide me on what contraception would be best for me. I'm currently on the pill (the 21 day cycle) because of a medical condition and this seems to be the only medication that works. The side affects of the pill do really annoy me but as I'm only 18 and single I think the pill is probably the best contraception for me right now, maybe reevaluating my options after university but for now sticking with the pill. Some things I want to know are the trends in age and what type of contraception people use, also the development of male birth control.", "gaia_ronja": "I came off the pill after 8 years, started taking it again, now coming off again after around 3,5 years. I'm getting pimples all over. I hate my oily skin but I'll be ready to accept it at some point, without the additional hormones from the pill. I am thinking about getting the copper coil but I'm scared as it can cause more painful and longer periods. What are the statistics (I will be looking them up myself but I'm sure that a lot more women would be interested), how much longer/more painful will my period potentially be?", "daniquewelmer": "Was on the pill for years and then quit because of returning spotting each month. Was a year off the pill and never felt better, but tried contraception again when starting dating. I'm on the implant for almost a year but it really backfired on me. I love that I don't have to think of forgetting a pill, but the constant dread of wondering when the flow will happen everyday is the worst. Bleeding probably over half of the time when calculated an average over the past year. So really wondering what actions to take next.", "jessmuller16": "Reasons a teenager shouldn’t use an IUD? And is it okay to use an IUD if I just want to use it for period control and not contraception? I was on the pill for my skin but have recently stopped when I started to use it to stop my periods and ended up with lots of breakthrough bleeding", "nimbob94": "I’ve just stopped taking the pill after 4.5 years and am waiting to see how my body adjusts to it. I have PCOS so it’s going to be interesting and probably annoying. I liked the pill but I don’t think it’s the right fit for me right now.", "lemmiwinks96": "I was on the combined pill for 3 years when side effects started accumulating, including nausea, mood swings, depressive feelings and heavy periods. I changed to the hormonal IUD and despite initial pain and a long period of settling, I'm happy I made the decision. I don't have to remember to take the pill anymore, its safe and effective and most of all: no more painful periods, or other unwanted side effects! Based on this, my question is: how often is depression/depressive feelings overlooked as a side effect of the pill? I feel like doctors are quick on sending you to therapy if you report feeling down often instead of asking first if you're on the pill and changing the contraception form, despite depression being listed as a common side effect.", "emily_gracee18": "1)I want to know more about men’s contraception, there really needs to be more options available as men are just as responsible as women for their bodies. 2) Also, how long has the pill actually been around for and do we really know the long term effects. 3) And from personal experience can your ‘natural’ cycle and symptoms such as PMS still occur whilst on the pill?? And I am the combined pill, I have been on it for 10 months now because I got into a long term relationship last November and so want to be safe as possible, doctors put me on it as they said it’s most suitable for my age group ❤️🍆", "heddafh": "I've got a family history of thrombosis, so it's important for me to use a contraception that won't increase the risk of that. Also as I'm in a monogamous relationship I don't have to worry about STIs. I feel like I know my options pretty well, but am still a little bit confused about whether or not you can use a period cup if you've got a coil 🤔 I've been hearing different things, and it was one of the reasons I didn't choose the coil when I recently switched from the mini pill to an etonogestrel implant in my arm (as well as fear of the pain and the fact that I might wanna get pregnant in a year or two). Not super thrilled about my current situation thought (my periods are long lasting), so might change again next year.", "astralgrace": "what’s matters to me is something super effective, and that i won’t have to worry about for the next few years! i’m on the pill only because my gyno won’t give me an iud, she keeps saying it’s not worth it at my age (18) (which frankly i don’t agree with at all)", "windowstodifferentworlds": "I'm on the implant, currently on 2nd one so have had one for about 5 years. I did this as my BMI was too high to continue on the pill I had been on before that. I do not want kids, they are not in my life plan so I want as a reliable contraception as I can get. Nurse told me implant was about as effective as being sterilised. Had irregular bleeding with both implants so take a progesterone only pill in addition which means I don't bleed at all. I'm not sure I like this, putting 2 lots or hormones into me. I feel like my sex drive has been affected for the worse and I'm likely to have a scar added to my arm every 3 years but as I really don't want kids I am reluctant to move to anything else if this is working.", "fififrecklesmcg": "I don't really know what options to consider and it's a huge minefield. I know that because of my BMI I am not allowed the pill. I've had a hugely negative experience with the implant - I had near constant periods and mood swings that were awful, so I'm very reluctant to try hormonal ones again.", "yfkeosinga": "Right now the only thing that matters to me is the least amount of periods, so I’m currently on the pill. I know my options and I feel like I made the right one given my circumstances.", "caoimhe_hpkns": "Is it bad to stay on the mini pill for a long period of time (10 yrs or so)? I’m on the pill right now but am worried about the future.. I have a very low pain threshold so things like the coil and implant scare me", "joshuaglass86": "What is your bust measurement?", "linds_cat": "I’m currently on the pill! I like it because I feel like I have more control. If I stopped having periods I would get super nervous so I like that I still get one each month but they’re lighter and shorter. And if I want to skip a month I can easily just start the next pack. Taking it each morning has become part of my routine so I don’t forget!", "christinasweeneybaird": "On the pill and it works amazingly for me - I have painful periods which it hugely helps, the idea of having an IUD inserted for me is 🥴 and I’m good at remembering to take my pill. Also I like that when I do want to have kids I can come off it easily without any potential of long term physical damage. Also tempted by the pill injection but I’m happy on what I’m on for now", "hazel_tetsill": "I was on the combined pill for 6 years to help with heavy, painful and irregular periods. I also have Crohns disease (diagnosed 2009), and only THIS YEAR it was pointed out to me by my new IBD nurse that oral contraceptives are less effective for Crohns sufferers due to malabsorption. I was so frustrated that I’d never been told this (or read anything and I consider myself quite informed about Crohns) so now i am exploring other non-tablet options and I didn’t even know some existed. Also, because Im not sexually active I definitely have felt brushed off by the GP when I tried to ask about other options, as if using the pill to lessen the pain and heavy bleeding and the knock-on effects it has on my crohns aren't as important as avoiding getting pregnant. I wish there was more information about how periods and hormones interact with other long term health conditions and medication for those conditions.", "marta_martins8": "For me ir matters if it is effective and if it Will alow me to have children eventualy!I'm on the pill and I'm good so far (for 2years)", "crystachesbro": "I want to know how birth control effect PCOS. Which options are better and help what problems", "altguy23": "Is it just me or is this topic not as updated to give options for both sides equally?? I may get some shade for this, but I feel most of the options of contraception is aimed mainly at females when us males are getting away with less painful and risky options!! Grateful for your platform and looking forward to “More Hannah”! ❤️", "sariahseb": "I love reading everyone’s stories!! I was initially on the pill but got off to try for a child (had a beautiful boy who’s three now 🙂) and because the pill really amped up my anxiety. Ever since then it’s been condoms. This is mainly because I live in the US and am unable to afford health insurance so I’m not able to explore other options with a doctor and there are no other affordable options for me right now.", "nicksgr8": "I thought it was an elephant...", "lavender_bea": "1) What matters to me is that my contraception is hormone and side effect free. 2) Yes, I did know my options and did a LOT of research before settling for one. 3) I have been tracking my cycle according to the rules of Sensiplan for over 2 1/2 years now. It did sound complicated and like a lot of work at the beginning but as soon as you get the hang of it, it's all fine really.", "jenn_atk": "I went on the combined pill for painful periods, not primarily for contraception. Went through 6 or 7 different types as every breakthrough bleed was worse than the one before. I ended up going on the mini pill after getting visual migraines and I have been on it for over 3 years. I really like it, especially not having any periods, but I am just rubbish at taking it on time so my face gets super angry at me! It is only after doing obs+gynae in medicine at uni that I was properly aware of all the different options and more importantly how they worked - especially the one I was on! I wish I was told more about how they worked and discussed what all the options were.", "bethydennis": "▪️CONTROL! I want to feel in control of what I'm using and not let it run me; long lasting; don't have to think about it▪️I am much more aware of my options now I'm in my twenties but literally thought the pill was the best and easiest option when I was 16 ▪️I'm currently on the implant as it lasts 3 years and had heard relatively good things. I hated the pill I was on from 16-20 so really wanted to try something different", "shahrax": "I use a diaphragm and spermecide gel! Love that it has no hormones! I tried various pills, the implant and hormonal coil and hated how they made me feel more emotional, they made my periods worse and I never felt like myself.", "katlantas": "The implicitness of some people concerning “girls taking the pill” is still incredible to me. I’ve been off it for years and do not consider getting on it again (side effects including depression). I don’t think there’s enough awareness about all the different kinds of contraception just yet (so shout-out to you Hannah!). When discussing this matter with my boyfriend he seemed very uninformed about most things available to women (which probably isn’t even his fault). Where I am from, the coil (hormonal or other) costs between 200 and 400€, which seems a silly amount for young working women or uni students to be able to afford. I’m basically still outraged by the limited number of choice and their prices. A vasectomy in France is 10€, the pill for women just as much per one package (3 months). And people don’t seem to be very aware about those vasectomies as well anyway. Male contraception is not talked about enough and female contraception in my eyes way too expensive still... this needs to change! Basically I’m currently on no contraception since I can’t afford them (430€ for the coil at my doctors office!) or I am not informed enough of better, cheaper options in my country yet. Meh. This is basically just a general statement haha The market needs to expand away from only the pill being as popular as it is.", "khenry_art": "I live in Canada and I'd love to know where things are regarding MALE birth control. I used to have an IUD and my body really didn't agree with it, so I'm back on the pill for now, but my partner and I are looking at other options for the future, up to an including a vasectomy.", "billieandersonx": "Yes! 💪I really think we need more education with contraception. I was given the classic ‘here’s how to put a condom on a banana’ and that was it 😂 I can’t go on the pill so I’m on the implant & im so happy! I feel so in control & like it really suits my body. Which is so important 💪💖", "gemma_louise08": "I’ve been on and off the pill for about 11 years on numerous ones I’ve lost count how many different ones. I got put on them due to painful periods. A few months ago I finally had a scan and it showed Adenomyosis which I can’t find much information on how to deal with it other than having a hysterectomy which at 26 and no children is not an option for me. I would like to know what other options are for me apart from the implant and IUD 🙂 love your content btw x", "aynilaa": "I‘m 23 and on no contraception at all. Yes, I do have a partner, but we don‘t see each other that much and because of vaginismus, penetrative sex would be really painful anyway. And I‘m not a fan of putting a daily dose of hormones in my body, so if in doubt, we use condoms.", "rustam552": "Покажи", "lauderbaughkatherine": "Control over my body , yes I do. I’m currently on the myrina coil and I went for it to reduce period flow, due to intense pain and nothing else working for me.", "melaniiemurphy\nVerified": "Verified", "iamman95": "I really want to know when we will have Long Acting Reversible Contraception for men! When will Vasalgel be available for commercial use?", "skakitty83": "I read leaflets when I was younger but I guess it’ll all be online now (I hope)", "ro_goes_rawr": "I would like to know how to get into gynaecology. I think I maybe a bit late as I don’t take chemistry but maybe gynaecology nursing as an option?", "meg_lakey": "Im on the mini pill now but its caused acne all over my face so im coming off. I used to be on microgynon for years and was fine so going to ask if i can go back on that, only came off cause i was experiencing some medical symptoms that turns out werent related to the microgynon. I dont think id go for any of the other options for contraception, other than just condoms 😊 x", "shesaysdisco": "I’ve tried four types of birth control (combo pill, hormonal IUD, copper IUD, and implant), but none of them worked for me in terms of managing awful periods and PMS symptoms. Last week I got my tubes “tied” and had an endometrial ablation so now I can’t get pregnant and shouldn’t have periods anymore! It’s something I’ve been thinking about for almost a decade, and it’s a permanent change to my body, so I don’t want people to think it’s an easy out if they don’t want to have periods (though I totally understand).", "niciidk": "my questions are really PCOS related! I hope he can answer some of them! is the pill really helpful for curing PCOS? what contraception would be the best option (if there is any) when you have pcos? I read somewhere that taking the pill for too long while having PCOS can cause complete infertility, does that have some truth to it? also more generally: is there any contraceptive that might cause infertility (or less fertility) if you take it too long? (and if it fits, is it true you have a harder time conceiving when you have PCOS? do I have the same risk of accidentally getting pregnant when my contraceptive fails as someone who doesnt have pcos or any fertility problems?) as to your questions: To me it matters how I feel. Does my contraceptive make me feel better or worse or indifferent. Is it easy to integrate in my lifestyle. is it safe (for my health, body, mind, stress level) what is the safety index, how well does it work. generally I do know my options, a lot thanks to the job I‘m learning, but as of suffering from pcos I‘m not sure if I know my ACTUAL options (thus the pcos related questions) I‘m currently on the pill, the dual one with 21 days of taking and then 7 days of pausing. I‘m on the pill for 3 main reasons: >1: getting a period back. I had 8 months of no period after a mentally very traumatic and challenging time >2 PCOS, my doctor said it would help against it >3 cosmetical reasons: having terrible acne, growing very dark long hair around my jawline (that actually didnt even fully stop) I‘m STAYING ON the pill due to now being sexually active and due to the reasons I went on the pill in the first place. but I dont think it‘s the right contraceptive for me anymore", "kirstinbrie": "What matters to me - convenience, few/no side effects, no hormones (I don’t respond well to hormonal options)! I’ve tried or talked about nearly every option available and settled on the copper IUD (coil). I have the 10 year coil in (!), and despite heavier periods and cramps, I LOVE it!", "katedizzzle": "my question would be re ‘taking a break’ every now and again from hormonal contraception mainly looking at the combined pill? is this something worth doing? i’ve heard the chances of side effects can increase when going off and on again? help haha", "em_sampson": "I’m on microgynon because the progesterone only pills make me bleed 24/7... literally. But the oestrogen in microgynon gives me headaches and sometimes migraines. Anddd I don’t want to risk not being on a hormone contraceptive as I’m sexually active, and also my periods are extremely painful and heavy and I bleed almost 24/7 when I’m not on a pill. So I’m screwed really so decided to risk the headaches and occasional migraines 🙄 are there any other options for me?", "alexandra_i_a": "I’m on the pill. If I could choose a contraception, I think that I wouldn’t have chosen this one. I’m on it because my gynaecologist said it would be the best for me because of my PCOS. I’m reading a lot about this topic and I’m not sure if it is actually the best option for me. I’m thinking maybe going to a different doctor and asking them for their opinion on pcos and the pill. So my question for Dr. Costescu is: what he thinks about treating PCOS with the pill. And btw very interesting campaign you’re part of, Hannah ! :)", "katieejayne": "Comfort and ease matters the most. While I feel I’m pretty well informed a lot of what I found out I had to look up myself. I’m on the pill and have been from age 15, I’m now nearly 23. I went on to assist with menstruation issues but found it be to be perfect as a general contraception ☺️", "lady.bex": "I started on the pill because of very infrequent periods and migraines, but, now that I've been on them for years, I'm thinking of getting off them to see how it will influence my chronic migraines. After all, I'm not sure what I am actually taking. The amount of information I was given when I started them 15 years ago was limited and I never stopped to ask question later on.", "clicliiii": "1. that its effective, easily accessible and not too much hassle 2. yes 3. the contraceptive hormonal ring after 4 years of the pill because I only have to think about it once every three weeks rather than every night and the lower dosage of hormones", "emmact12": "I'm currently on the injection which i love because I don't have any periods🤩 only problem is....i love powerlifting and hormonal contraception can massively affect muscle growth and strength which my GP doesn't really have any info about! I am interested in the copper coil but have friends with horror stories about getting it put in or moving about etc. I am VERY interested in other non-hormonal options such as the IUB 🎉"}