{"alliegrce": "I got primary gryffindor and secondary slytherin which honestly explains a lot", "jessicannerose": "Gryffindor primary, hufflepuff secondary !", "sprinkledsunshine": "Gryffindor primary and Hufflepuff secondary! The Gryffindor bit surprised me but it does sound like me", "iwanttobetheboytoeat16saltines": "Ayyyyyyy Hufflepuff gang", "ellamumby": "Oh no the story link expired. Does anyone know where I can find the quiz pls? 🥺", "mepockell": "The link isn’t there anymore, can you repost?", "tori.s_travels": "I think I’m a Gryffindor primary and a Hufflepuff secondary. Can you put the link up again?", "gabrielles.lens": "Primary Slytherin and obviously, secondary Slytherin. A snake through and through, always 🐍", "paperplaneshift": "Primary and secondary Ravenclaw that could model Gryffindor", "hermionecortez": "How do I find this quiz now?", "jamiejoart\nVerified": "Verified", "francesemilyp": "Snap! I got Hufflepuff Primary and Hufflepuff Secondary 😁 It suggested I could look at a model Gryffindor too but it didn’t feel right for me.", "tashstravels": "I LOVE your skirt! Where is it from? 😍", "mripley13": "Hufflepuff Primary, Burned Secondary Ravenclaw. This matches every test I've ever done before.", "zooeyschmooey": "Hufflepuff primary and secondary; which truly makes sense as I am often told that I wear my house on my sleeve 💛💛💛", "katiemayflo": "I normally get Ravenclaw but on this quiz I got Hufflepuff (primary and secondary) and modelling Ravenclaw on both. Super interesting!", "gudnyhk": "Slytherin primary and Hufflepuff secondary and i primary model Gryffindor. Yet every other test i’ve taken always says i’m a Ravenclaw", "chlo_614174": "I missed the link in your story 😭💛", "mimionigiri": "Only saw this post on my TL now (stupid insta), can't find the quiz 😢", "barefootinadress": "Double hufflepuff as expected and desired 💛🖤💛🖤", "abitalks": "Stay Goofy! 😂", "_evagroot": "What was the quiz?? Story is gone 😭", "katiekamazing": "That Gryffindor primary Gryffindor secondary life 😂🦁🔥🦁❤️", "la_bca_la": "Burned Hufflepuff primary, burned Hufflepuff secondary, model Slytherin !", "k_wat96": "Hufflepuff primary and secondary, sometimes primary model Slytherin 💛💚", "tkmpatt": "I’m a primary and secondary Hufflepuff too!", "its_natashac": "Double gryffindor✨", "holycrappitsjo": "Ok, I also got Hufflepuff for both. Which weirdly made me cry, because I've been told a lot lately that people think I must be Ravenclaw. Does that happen to you? I feel like, since so much of your content is knowledge/education based, and you seems so goddamn organized, maybe people guess you're that house too!", "jenny.glickman": "Slytherin primary (which I expected) and Hufflepuff secondary (which I was not expecting!!)", "hurri._.cain": "Burned Hufflepuff primary and ravenclaw secondary", "catty_moon": "Primary Slytherin and secondary hufflepuff 😂 I always get Slytherin so not surprised", "jessicalframe": "Burned Ravenclaw Primary, with both Gryffindor and Hufflepuff Primary Models. Hufflepuff Secondary with a Ravenclaw Model. Apparently I'm complicated lol", "alexisolaes": "I'm also a Primary and Secondary Hufflepuff!! 💛💛 When I was younger I was convinced I was a Ravenclaw and when I was eventually sorted into Hufflepuff I was upset, but I'm so obviously a Hufflepuff now that it's funny that I ever thought differently. I wear it with pride now. We are caring, kind, and we want the world to be a better place!!", "sofie_charlotte": "Ravenclaw primary and a gorgeous secondary! I feel understood!", "marit.nygard": "Hufflepuff primary and Ravenclaw secondary; I always identified as a Ravenclaw but this makes so much more sense haha", "katy_la183": "Gryffindor primary (no news here) and Hufflepuff secondary! I like it!!! 😍👏", "activismelie": "Same!! Hufflepuff primary and secondary and I model gryffindor 💛", "just_eve_all_over": "Slytherin primary and hufflepuff secondary. Yay 🐍🦡", "risaalitchi": "Double Burned Hufflepuff... now it makes better sense...", "the_in_visible_girl": "Burned Gryffindor Primary and Hufflepuff Secondary, and modelling Hufflepuff 😁🌻", "melissanatasha": "I’m a burned hufflepuff primary and hufflepuff secondary 😂", "monikashoop": "Slytherin primary & hufflepuff secondary 😊😊", "phoebelizon": "i got the exact same !! 💛❤️", "omg_its_kay_bee": "Gryffindor primary, Gryffindor secondary who models Ravenclaw", "hannahrimm": "Primary and secondary Hufflepuff heyyyy", "sweetblood009": "I’m a primary and secondary hufflepuff", "lynn_zilla": "Hufflepuff primary, Hufflepuff secondary and I model Slytherin.", "karleineken": "the quiz crashed on me in the end, but my primary is definitely burned Hufflepuff and my secondary probably burned Slytherin. So basically every test that told my I’m a Slytherin wasn’t wrong at all, because the text said burned Hufflepuffs can be easily mistaken for a Slytherin 🐍", "hazste": "Hufflepuff primary and hufflepuff secondary! ❤️🦝 (pretend this raccoon is a badger please)", "emma_louise_239": "Hufflepuff through and through 🦡💛", "emma__jane13": "Hufflepuff primary and secondary 🦡💛", "marjoleinc92": "Huffelpuff primary, Ravenclaw model and Gryffindor secondary. I loved that. Because in my heart I am a puff but I value other traits too. It was fun!🍩", "carogonzbr": "Gryffindor primary and secondary 💕 and I model Hufflepuff in both instances hahaha 💛", "cherrypi86": "Gryffindor for both. I've never come up Gryffindory before! But... it does sound like me. I've been Slytherin on the original Pottermore, and Ravenclaw on it's more recent update. But currently? This feels right.", "draciidroo": "Primary slytherin, secondary Hufflepuff and often model Hufflepuff. Fits me perfectly but I will always identify as a hufflepuff no matter how slytherin I can be 😂", "bronwen_roses": "As soon as I saw this I had to do this quiz! I’m a Primary Gryffindor & Secondary Hufflepuff. This was so interesting though because while completing the quiz they also suggested I may be a Slytherin 😬", "abiloustello": "Where is this beaut skirt from pls? ✨", "hi.imali": "Slytherin Primary and Secondary with a Gryfindor model 💚💚❤️", "katyob7": "Really enjoyed that quiz! I'm Primary Slytherin and Hufflepuff Secondary with a secondary model of Gryffindor... Every testive ever done says raven law but I think this one is most accurate 😂😂", "freyfrey1995": "Slytherin primary with burned Gryffindor model and Hufflepuff secondary 💚♥💛", "unnecessaryh": "Slytherin primary, Gryffindor secondary, model ravenclaw. It's wild bc I always got Hufflepuff before but after reading the description it makes so much sense that I'm a Slytherin/Gryffindor lol", "linamachadocm": "Primary Ravenclaw and Secondary Hufflepuff! I also think I model Gryffindor.", "pagebypaige1": "Life changing revelation that indeed I’m a “Burned Hufflepuff.” This whole time thinking my affinity to slytherin was just a little bit off 👀👀👀", "megan__heather": "Burned Hufflepuff Primary, the secondary shorted out when I tried to find out more so I’m either a Slytherin Secondary OR a Burned Gryffindor Secondary. I’m more inclined to believe the latter (despite Slytherin being a common house I get, along with Hufflepuff) but I wasn’t able to find out more cause the quiz glitched", "dialtones_and_daydreams": "I got Ravenclaw/Burned Gryffindor primary and Hufflepuff secondary", "anitachaplin675": "Gryffindor primary and hufflepuff secondary!", "shiningfaith": "raven primary, huff secondary with a raven secondary model", "tannsarah": "Slytherin primary and Slytherin secondary 💚🐍 I’m always Slytherin and I couldn’t be prouder! Honestly Slytherin gets such a bad rep.", "lizzalina": "Burned Hufflepuff primary and Slytherin secondary", "plunkybug": "I’m so confused. Every test but one has me as Hufflepuff. The newest Pottermore has me Gryffindor. This had me a Slytherin with possible Burned Hufflepuff or straight Hufflepuff. Or model Hufflepuff. But some of the descriptions just confuse me more. I can’t decide. I might try it again later.", "worldofjosien": "I’m a primary Slytherin & secondary Slytherin 💚🐍💚 it’s been quite a while since I did the test so I don’t remember if I model anything.", "ashyb29": "Ravenclaw primary and hufflepuff secondary and a primary model slytherin 💙💛💚", "sensorcelled": "Ravenclaw Primary, Hufflepuff Secondary.", "ginger_cowgirl": "Burned Gryffindor with Hufflepuff secondary. Pottermore/Wizard world says Slytherin....", "carroll.lynsey": "Burned Hufflepuff primary and ravenclaw secondary. Interesting!", "megananne89": "Primary Burned Hufflepuff and Secondary Hufflepuff", "geekycaligirl": "Burned Griffindor Primary Hufflepuff Secondary may model Slytherin Primary and model Ravenclaw secondary", "privictoretti": "Burned Hufflepuff Primary and Hufflepuff Secondary and I model Slytherin Secondary. Always knew I was Hufflepuff but never tought about Slytherin! 💛💛💚", "the_new_number_2": "I got Hufflepuff for both & it said I could also be a Gryffindor primary", "briannaberniece": "Gryffindor Primary, Burned Gryffindor Secondary, and I model Hufflepuff! Move over Meyers-Briggs - this quiz just saw right into my SOUL.", "addiemae.xox_": "I wasn’t surprised when I got hufflepuff primary and hufflepuff secondary because every quiz I take says hufflepuff, but was very surprised I had a slytherin primary model! 💚💛", "paty_lubo": "I’m a Slythering primary and a Gryffindor secondary, I’ve always felt a bit thorn between the two but leaning more into slythering so this makes A LOT of sense! Love this quiz!!", "nycfcoco": "Burned Hufflepuff primary, Ravenclaw secondary with Hufflepuff secondary model...", "chlobo_webbo": "Burned slytherin primary, hufflepuff secondary ☺️", "mycolourfulbookshelf": "Primary Ravenclaw, secondary Hufflepuff😊 this is both extremely accurate and also the result I would have wished for :) I always get Ravenclaw results on sorting quizzes and I really identify with that house but I definitely have some Hufflepuff qualities that I love so these test results made me really happy😊", "flyingblackbirdie": "Hufflepuff primary, ravenclaw secondary, modelling Hufflepuff secondary. Which is what I have always been saying! Mostly Hufflepuff but with a bit of Ravenclaw too!", "rebscallion": "I got Slytherine Slytherine 🐍 or I’m a burned hufflepuff! Which is spooky because I always wanted to be hufflepuff as a kid 🤔", "rarelyjovial": "I am also a primary & secondary Hufflepuff 🤣 I actually have a Hufflepuff tattoo on my thigh, so it’d be unfortunate if I came out as anything else 🦡", "_priscilla_hill": "Ravenclaw primary and Ravenclaw secondary💙💙💙", "amyducky": "I’m a Hufflepuff primary and secondary 💛💛💛", "tahnaemia": "@franraynham @hollyanitamartin do the quiz!!!", "stepiksayshi": "Gryffindor primary, Hufflepuff secondary, and Ravenclaw model!", "onlyjustalison": "burned gryffindor primary, burned ravenclaw secondary, and ravenclaw model...", "caitlinscott00": "@joannamcl squid hat", "emberkay": "Thank you for giving me the resources to finally prove to one of my friends that I'm a Ravenclaw!!! Got primary and secondary Ravenclaw!", "anyalabelle_": "Burned Gryffindor primary and Ravenclaw secondary! 🧡💙", "tammy_alysia": "I am a Slytherin primary , huffelpuff secondary and a model Slytherin secondary", "amtl12": "Burned Hufflepuff primary with a Slytherin secondary that models Rawenclaw 😊 Really cool quiz! 👍", "phreyah": "I'm a burned Gryffindor primary with a Ravenclaw as a primary model + Ravenclaw secondary!", "50shadesofwilsongray": "I often joke that my lifelong dilemma is not knowing if I'm a Gryffindor or a Ravenclaw and this test told me I was a stall hat between the two 😭 it did end up steering me more in the Gryff way though", "rhia__w": "Hufflepuff primary and secondary but with a model Gryffindor primary and model ravenclaw secondary! Ngl I feel like that is so me, I've never felt so seen by a personality quiz... 😱😍", "sparklehorcrux": "I did that awhile ago and was so nervous it would tell me I changed houses! I’m still a Ravenclaw but I also got Hufflepuff as a secondary!", "laura1white": "I'm a double hufflepuff too!", "_maggieholtz_": "Burned gryffindor primary and gryffindor secondary🦁❤️ obsessed with this quiz!! i’m making everyone i know take it", "brontedav": "Gryffindor Primary (Models Hufflepuff), Hufflepuff secondary who can perform Ravenclaw 💛🖤", "yellowphever": "Primary grffindor Secondary hufflepuff", "rxthjinx": "gryffindor primary and hufflepuff secondary (the secondary description i super relate to) weird i was always a ravenclaw as a kid 😂", "erin.quoll": "I'm a Gryffindor primary and a model Hufflepuff primary and a Hufflepuff secondary", "emilyjellyfish": "I'm Hufflepuff primary and secondary too! 💛💛", "lainesse13": "I am shooked! Gryffindor and then, an Hufflepuff! I tought that I would be a hufflepuff and Ravenclaw since I always got one or the other in every sorting hat quizz I took! 😲 Hope you are enjoying your time in Canada!", "alehanska": "Primary 🐍 & Secondary 🐍💚", "allee.gette": "I’m a burned hufflepuff primary, a slytherin secondary, and I primary model gryffindor... this feels so true", "ruth.boey": "😻", "rosieposie80452": "Hufflepuff primary who models gryffindor with a hufflepuff secondary!", "ruairidh_smiley": "Burned Hufflepuff with Secondary Slytherin, not bad! 😁", "rosie_sloan": "Primary Hufflepuff and Secondary Hufflepuff 😊", "angaxa": "Primary Gryffindor with secondary Ravenclaw 🤔🤔🤔", "perelandfh": "Primary Gryffindor, Secondary Hufflepuff 💛", "jameslawhorn7882": "I just need a peak just a little peak💕💕💕💕💕💕💕", "ostomummy": "Gryffindor primary and Hufflepuff secondary 💪🏻 ♥️💛 ⚡️⚡️⚡️⚡️", "gerdavm": "1000% Puff, as was to be expected ❤️ #PuffPride", "theircapitolways": "I got Ravenclaw primary and Hufflepuff secondary! 🦅🦡💖", "sjmvl73": "Double Hufflepuff Same!! #HufflepuffWowow#Wowow#GoGirl#Huffle-Hannah-Puff. What is Dan?", "mockin_bird": "I got primary Gryffindor and secondary Hufflepuff, totally wasn't expecting that I'm Hufflepuff in some ways 😄", "lindamaria27": "I am also a hufflepuff primary and a hufflepuff secondary 💛🦡💛 I read ‘the princess and the fangirl’ recently and it referred to one of the characters as a ‘burned hufflepuff’ and I had no idea what it meant, so this has cleared that up for me too!", "knxsa": "Hufflepuff for Primary and Secondary!", "ivyginny": "Lol, I'm also a hufflepuff primary AND secondary. No-one is surprised.", "emma.campbell2000": "I feel like the quiz and I had no idea what was happening with primaries, could have been anything except slytherin at first, but I'm actually happy with the ravenclaw primary we got to with the end. Then secondaries I think hufflepuff secondary, potentially burned, but modelling ravenclaw? I never fit into any boxes on personality quizzes, and ive always said I'm ravenclaw but felt an affinity with hufflepuff so maybe this solves that? Who knows! 😂", "kellymaire1824": "Slytherin primary and slytherin secondary. 🐍", "amy_lester1997": "Burned Ravenclaw primary and burned Hufflepuff secondary and a Gryffindor model. Such an good quiz, the “burned” concept was so interesting 🔥💙🔥💛", "deductionsinthetardiswithpie": "same!! primary hufflepuff and secondary hufflepuff!!", "duck_and_puddle": "Burned Hufflepuff primary (but I model Gryffindor), Hufflepuff secondary 🔥🦡 💛🖤", "thatshortgirl94": "Burned Hufflepuff primary and Hufflepuff secondary 💛🖤💛", "gracefulyours": "hufflepuff primary and gryffindor secondary 💛❤️", "ohlookmeshell": "Apparently I’m very complicated 😂 Burned Slytherin primary but models Gryffindor & Ravenclaw secondary but models Hufflepuff", "helenaf_09": "Both hufflepuff as I expected!", "clareyb89": "I got Burned Hufflepuff for primary and Hufflepuff for secondary. Sorted into Hufflepuff, so I’m happy 🦡💛", "luciaalbon": "I'm a primary Gryffindor, primary model slytherin and secondary hufflepuff", "rosiannahalserojas": "I am such an influencer", "jenny_little_wren": "I think we might be the same person @hannahwitton ! I'm also Hufflepuff Primary and Secondary and when I was sorted on Pottermore I was also a Hufflepuff and have a Dolphin patronus, just like you (I think!) 😁🐬", "luxiez": "Burned (somewhat) Ravenclaw Primary, Hufflepuff secondary that models Ravenclaw", "haendchen": "Apparently I’m a primary Gryffindor (never thought about that) that models Hufflepuff and a secondary Ravenclaw (the house I always felt I belonged to). So a pretty colorful mix I’d say ❤️💛💙", "allthatjessz": "Burned Hufflepuff Primary and Hufflepuff Secondary", "damnit_danni": "Holy shit. This quiz. 😭😭 I'm a Primary Burned Gryffindor (app crashed when I was on my secondary but might be Model Ravenclaw) and everything makes sense now.", "freymartian": "Gryffindor primary, ravenclaw secondary 😍💪", "selinamcollins": "Ravenclaw and burned Hufflepuff secondary.", "ellsbells16": "Slytherin Primary and Secondary -no surprise there! 🐍", "spoonfulof_sugar": "I'm a burned gryffindor primary and a hufflepuff secondary 🙌", "clockworkmonarch": "ravenclaw primary and secondary and model hufflepuff secondary!", "earthtomatylda": "Hufflepuff Hufflepuff ✨", "ems.charlottee": "Hufflepuff all the way!! Thank you so much, this was by far the best sorting quiz I’ve ever taken (and I’ve taken a lot 😉)!!!!", "cloud.girl": "I got a Hufflepuff Primary and a Hufflepuff Secondary (but it also thought I could be a Gryffindor Secondary but reading through it it didn’t sound like me. 😅)", "anabsolutejoy": "Primary Hufflepuff, secondary Ravenclaw. 💛💙 Which makes sense as I'm never too far away from being Ravenclaw when I take the complete test and definitely display some Ravenclaw characteristics. I'll always be a Puff overall though.", "m_orishia_tfc": "Slytherin primary, hufflepuff secondary. Really confused me because I always thought raven claw would be my secondary house (always Slytherin first though)", "laurennicold": "will you keep it in your highlights? I don't have time right now but it sounds really cool ☺️", "dorothykelsey": "I’m primary and secondary Hufflepuff but could model Gryffindor 🎉✌🏼 Hufflepuffs for the win", "lilaislovely": "Primary Ravenclaw, Secondary Hufflepuff and a Burned Gryffindor. The Hufflepuff thing makes me laugh, because for a while I thought I was Hufflepuff (and Pottermore told me that at first).", "laurenbedford13": "hufflepuff primary, ravenclaw secondary and gryffindor model?? so basically i’m DEFINITELY not slytherin🐍", "natalieeamber": "So I'm a Ravenclaw primary, a hufflepuff secondary and a gryffindor model... sounds complicated!", "hannah_stubbs": "Both hufflepuff 💛💛💛", "posttwee": "did this quiz just use the concept of sun/rising signs to keep Harry Potter relevant omg", "imogenaquilina": "hufflepuff primary with a gryf secondary! 💖", "jodieellis13": "Burned hufflepuff primary and burned slytherin secondary!", "alexc010": "Hufflepuff primary and secondary 💛💛", "samanthaomalley444": "@aine_oc15 Take the quiz it’s linked in her story 😜", "__sianmorris": "I’m gryffindor primary & secondary ❤️", "kimbo_crane": "Slytherin primary and hufflepuff secondary. I always knew I was both!", "vioromani": "I loooved this quiz! i had never heard of the burned houses and models before. a real treasure for a potterhead😍", "nathaliaigliori": "Gryffinpuff over here! (Gryffindor primary and Hufflepuff secondary)❤️💛", "becka_bearsy": "Very happy with my resulta got gryffindoor then hufflepuff i always called myself a gryffinpuff. My hubby got hufflepuff and slytherin x", "andyandy___": "Ravenclaw primary and ravenclaw secondary. 💙🦅", "ciaraaa.oc": "I’ve always said I’m a Gryffinpuff with an emphasis on Gryffindor...and this quiz just told me I’m a Gryffindor primary an Hufflepuff secondary!", "hadasdrukker": "I can never decide if I'm a Gryffindor or a Ravenclaw. \"Great!\" I thought, \"this will help!\"... But nope. I'm a Burned Gryffindor (similar to Ravenclaw) primary with a Ravenclaw model, and a Slytherin secondary with a Gryffindor model. Now I'm even more confused 😵", "ackilpatri": "Gryffindor primary and secondary!!", "balane8": "I am exactly what I thought I was a burnt out gryffindor with secondary slytherin. Yup. ❤💛💚🖤", "bramirez37": "Ohhhhh Hnnah you cuty pie", "annachristopher_58": "Me too, primary and secondary hufflepuff", "zoe_cheney": "Same as you hufflepuff primary and secondary!", "an_iida": "Primary Hufflepuff, Secondary Ravenclaw!", "anastasia_ramazzotti": "Primary burned Gryffindor and secondary Ravenclaw", "em_rosanne": "Burned Hufflepuff primary and Hufflepuff secondary 🦡🔥", "gareth.ward.7": "Gryffindor primary, hufflepuff secondary..", "dixavd": "Burned Gryffindor Primary 🔥❤️ Burned Hufflepuff Secondary 🔥💛 I don't really remember much of what the houses mean but there you go...", "natasha.julianne": "I got gryffindor for both!! Odd because last time I got sorted I was a hufflepuff 🤔", "katiejwill89": "I'm apparently a Slytherin primary and a burned Hufflepuff secondary...", "swirell": "Hufflepuff all the way✨💛 thought I might be part Ravenclaw but nope!", "ashleighelizabeth19": "Gryffindor primary hufflepuff secondary 💕 I’ll take that", "d0000dle": "Interesting quiz! I got Burned Gryffindor as primary, and Ravenclaw secondary. Never registered as a Gryffindor before, always Ravenclaw.", "shelbie.elisexx": "I'm a burned hufflepuff primary and hufflepuff secondary and I primary model Gryffindor 💛", "thepeachiespoonie": "Cute! ❤️", "alwayslmevans": "Burned Hufflepuff Primary (similar to unburned Slytherin) and Gryffindor Secondary (or possible Hufflepuff)", "jessicaczn": "I am a double Puff too 😂", "sapphire_quick": "Primary and secondary ravenclaw 🦅", "heddafh": "Cool! I got Hufflepuff primary and burned Hufflepuff secondary, as well as modelling Ravenclaw secondary :)", "chantal._.bell": "This quiz confused me so much. I've always thought of myself as a Ravenclaw but I've been very fond of Hufflepuff as well. The quiz tried to put me in southern and gryffindor?! Cautiously settled on burned Hufflepuff as a primary, and Ravenclaw as a secondary.", "nicoledearest_": "I’ve read about that system and it’s super cool! I’m primary Gryffindor, secondary Hufflepuff 💛 that’s what I identify most with", "rebeccaeliize": "Hufflepuff primary and Hufflepuff secondary. HOUSE PRIDE! 👏🏻", "bookish_belle": "Everyone else is the comments: talking about their quiz results Me: geeking out about the Ripley's Aquarium....", "murrayheikes372": "Hufflepuff primary and secondary here as well! Never considered myself a hufflepuff before now but it makes so much sense 😂💛💛", "ro_goes_rawr": "Burned hufflepuff primary burned slytherin secondary", "fridabystroms": "🦡💛 HUFFLEPUFF 💛🦡", "waller19d": "Now you can swim in red ink!", "charlottesimply": "Burned gryfindor primary, hufflepuff secondary yet every other test I’ve taken always says I’m a ravenclaw", "hayley_anastasia": "Burned Hufflepuff Primary and a Ravenclaw Secondary. My pottermore house is Ravenclaw but I’ve always thought I’d be a Hufflepuff so I am really pleased with the result.", "kathrynxjane": "Hufflepuff Primary and Secondary here too. They said I could model Ravenclaw Secondary too but Hufflepuff Pride over here 💛💛💛", "emilynewman23": "Wowweee I got the same; Hufflepuff Primary and Secondary! Very happy with that! 💛💛", "bethanlour": "I got Burned Hufflepuff primary, Slytherin secondary. I've always been Slytherin in sorting house tests previously, but almost all of my nearest and dearest are Hufflepuffs so clearly it's rubbing off on me 💚💛👌", "cloudslikethis": "Wow Gryffindor primary and secondary 🦁", "itsmebazza": "Ravenclaw primary and hufflepuff secondary", "aimeesmusings": "I'm a Burned Hufflepuff Primary and a Hufflepuff Secondary. :)", "nicoleplanc": "primary ravenclaw, secondary burned ravenclaw😬💙", "debbywanderlust": "Another Hufflepuff here 💛", "sarahscript": "Hufflepuff over here too!! ✨💛💛💛", "miriamcarriere": "omg i need to do the quiz", "teapetrichor": "I took one and it confirmed Hufflepuff (pride, natch) and then my secondary was Ravenclaw and I was like naw I’m an idiot, that can’t be right?! 🥴😬", "itzel.mx": "Alright Hannah if you insist", "gxilttripping": "Slytherin primary and Hufflepuff secondary ... very surprised about the secondary! 💚💛", "floweringem": "ravenclaw primary & secondary !!", "disappointing_egg": "Ooh, Hufflepuff primary, SLYTHERIN secondary!! What?! I mean, cool but WHAT?!?! I knew I was a Hufflepuff but the Slytherin surprised me!"}