{"rsshorty28": "Happy 2nd stomaversary", "donaldbieszczak": "You look great Hannah,hope yiu", "ste.vierose": "i admire your confidence so much", "jndogss": "I'm glad you're still health and doing good,", "reds343": "Boobs", "shereeashleigh": "I wish I had the same confidence. You go girl 🙌", "ravikant.verma.58152559": "❤️❤️😍", "rrikotin": "Has it really been that long already! Woah, time flies but you stay fabulous ☀️😊", "juliesteph1970": "Thanks so much for sharing your pic! I’m still getting used to mine after 7 months xx", "rhcreed": "The top with the flowers is super cute!", "charlottelouisegreeny": "Beautiful 😍 you are such an inspiration x", "s.sophielewis": "wow i remember you getting it ! has it actually been 2 years wowee", "apparentlyitsasin": "@hannahwitton where did you get the bralette in the first pic? It’s gorgeous 😻", "spearitofgfbc": "🎶You're sexy and you know it🎶", "doucette.james": "Did you get the surgery to make the stoma permanent?", "macanazza": "@isacanazza", "whatabigaildid": "@flisssnape", "josslette": "@amshealth this lady :)", "nomipalony": "@forward_moving_fliss are you following Hannah?", "sufworld": "Nice boob very good boob, i need boob, dm me for big", "scrubs4heroes": "You are beautiful! 👍 Shout out to all those giving confidence & fuelling Love! ❤️", "claudipepunkt": "You’re so amazing, me too living with a stoma since 8 years and it’s the best time I’ve ever had 😍 much love ❤️", "nm_kid": "And may you have many, many more. Happy stomaversary.", "craigpricestephens": "You're so beautiful. I still miss you old cute body though. xxx", "nikki_j_mcdermott": "So brave 💜", "rubie_lou16": "❤️. I’m so glad that we have you as such a beacon on light to all of us too scared to be confident about our bodies. ❤️", "tavey1511": "Such an inspiration 💖👏🔥", "usandthewild": "You are all the amazing!! 💕💘", "lovekatebray": "Happy stoma-versary! I think I speak for tons of us #ostomates when I say I’m so happy that someone with as large of an audience as you brings so much awareness to our world. You inspire me so much! 💜💜💜", "dario_prespljanin": "😍😍😍😍😍😍😍😍🙌🙌🙌🙌🙌🙌🙌🙌", "myoki_van_den_heuvel": "Strong lady!❤️", "quantlife88": "Yum 💕", "jensjourneytofindherwaist_sw": "Happy Birthday Mona!", "ceciliaradmard": "you make having a stoma look SEXY. which makes me feel like MY stoma is sexy! BLESS you and your BOSS BABE confidence ⭐️😍🍓", "candieshop": "Love your spirit so much Hannah!!💕💕💕", "_priscilla_hill": "I relate to that last photo on another level lmao😂💛", "jeffg144": "😎😎😎", "lvlovespr": "My mum has a stoma and sharing your positivity has helped her when I’ve shown her your posts xx thank you xx", "kriya.bungre": "♥️♥️", "aharp82": "👌👍😍", "rac01hel": "Cutie! Super strong lady ❤️😍", "levineshira": "Where is your bralet from in the first pic?? It’s so cute and I can never find one that fits!", "soulsutras": "You’re incredible 💗", "my.gut.instinct": "Happy stomaversary 💜💜", "sarah.l.jacobsen": "@hannahwitton I recently was diagnosed with crohns and am having surgery this week for a partial small bowel resection. Seeing you rocking your scars I think is really beautiful! Thanks for bringing awareness to these conditions! 🥰", "kennowell": "@hannahwitton I don’t know if I would have the self confidence that you do, but you keep kicking butt!! Wishing you the best!!", "sarahh2335": "😍❤️", "thatsmedinesh": "😍😍😍 gorgeous. 😉", "iggy_and_elvis_mummy": "@hannahwitton is that a bravissimo sleep bra?! Would you recommend I’m considering it! X", "webbtracey1988": "@sashafancy123 this is who lili needs to follow!!", "inezrodriguezdalmeida": "You are such a positive influence for people going through the same situation!", "hander2005": "Thank you for being so open about life with a stoma. I have a temporary one (reversal today) from colon cancer & your videos really helped me prepare for life with it.", "tferg__": "You are precious!!", "42grammsofheartattack": "Omg it’s been two years already! Time flies 😅Hannah, you rock!❤️", "t717mck1": "Go topless with nip covers 🔥🔥🔥", "lostonstrategy": "Weird question: in the first picture, where is your lingerie set from? Need some new bras and on the hunt for something good", "rachwel": "🙌", "ronadoesstuff": "Can’t believe you’ve been together for 2 whole years! Mona & Hannah 💚 #Moannah?", "ashleeyoungblood16": "Casually scrolling through the underwear pics without realizing the dentist had come back in and was standing behind me. 😂😭", "_daniellemcallister": "Happy two year birthday Mona!", "mikesandyikes": "which ostomy bags do you purchase or whatever? yours look so much higher quality than mine", "perkins_geoff": "🌹🌹💪💪💪🌹🌹", "sleibo": "You are an inspiration!", "stephmlayne": "Hi! May I ask if you wear your bag horizontally ever so you can use a stealth bag or something?", "shanboody\nVerified": "Verified", "mollyjodisley": "😍😍😍", "lsweyk": "KILLING IT!!! 💜💜", "_lili_ap": "Sorry may i ask what is stoma? and also you are so cute", "jadesofiee": "Yaaas girl rock it!", "gowestmygirl": "You’re so amazing ❤️", "powerlift1000": "You rock 🤘🏻🤘🏻🤘🏻", "kara.christine8": "I have a scar on my stomach similar to yours, but from a spinal cord injury. I love seeing this. I can tell how happy and confident you are. I hope that I can get like that, too!", "anderson.edward13": "Happy Stomaversary!! You are such a beautiful soul!♥️🔥♥️", "louloukins01": "OMGOSH I can’t believe this was 2 years ago! 😱 It really doesn’t seem that long ago that you had been in hospital etc. Wow!", "henry_pollard": "You remain extremely hot throughout", "theprettygeesus": "You're so inspiring! Im currently undergoing diagnosis for my bowel condition. So seeing your strength is helping me through the discomfort I'm suffering rn, thank you 🖤", "erin2416": "Congrats!! Also, where is that bralette from? I can never find any in my size!", "babitferreira": "Is there going to be a video about it? About your core and muscles and strength? Say yes, please", "orlagh": "Your smile is just beautiful! 😍", "bethanysoutham": "Happy birthday Mona! It's great to see you thriving Hannah you're and inspiration :)", "the_amadeous_co": "Rock that contidence! 😍", "mummyspaininthearse": "Amazing beauty 💖💖💖xXx", "strxwberrymilk": "love love love how candid you are hannah! so glad you're happy", "zakiyah269": "Hannah id love to see another what I eat in a day with a stoma video!", "abifiggins": "Where are your shorts from in the last picture? They are so cute!", "shokeex": "Yes queen!!! YOU’RE KILLING IT 🔥", "travelingsarahd": "Super. Woman. 🙌✨", "chrisatkins22": "❤️ ❤️❤️ your so very very sxy ❤️❤️❤️", "ayyes": "Best chest on youtube ❤️", "lucy.chesnaye": "💘💘💘", "ankanaakbykaushiki": "You are an inspiration!! Best wishes always!! It feels amazing to follow you!! Loads of love❤️", "kullyem": "Mona and I share the same birthday. Happy Birthday Mona!", "mkuskie727": "Those boobs tho", "princesssbelll": "💖💖💖", "j.see83": "Looking fabulous", "johndruddy": "Fair play to ya!", "rachelpotter1994": "Seeing how happy you are makes me feel calmer about the ‘what if’ this happens to my partner who has Crohn’s", "ibd.cannabis": "💜💜💜", "jamielang123": "Pixie the hair 💇‍♀️😍❤️", "severine_darkora": "Happy Stomaversary! 😊💜", "charlotte.ellison90": "I’m also incredibly impressed with how much your hair has grown!! Tell me your secret as mine doesn’t grow 😂😂", "trouble4me": "And even sexier throughout it all!!😍😍", "funkylilalien": "😍😍", "cimags360": "You should come to the US!!", "madeliefjuuh": "You look like you feel very happy and beautiful! Which you are❤️", "hatt619": "Hi beautiful xx", "rachelm_91": "❤️", "nananyongo": "You are such a beauty 🔥🔥", "shaolinbounce": "Looking fantastic doing so", "revalaatkar": "😍😍😍SO MUCH LOVE TO YOU ALWAYS. This post makes me soo happy ❤️✨✨✨", "laura_jelly": "Omg the holiday vibes in the last photo. Just showered in the evening and back in shorts with your hair in a towel is like proper sunny holiday vibes 😭", "hanlvenn": "🙌🏻👍🏻😍", "riniclv": "You go girl! 👌🏻✨👊🏻", "irlegend": "You are a incredibly beautiful woman in mind, body, and spirit. And that only stronger as time passes.", "klaramsoderberg": "Such a beauty 😍", "lucyjane.fashion": "You go girl! Mine will be coming up to a year next month, crazy how quick time goes but it’s been the best year ever! Thanks for being such an inspiration✨❤️", "flynwick": "Happy two years💛💛 I did get confused by the first photo for a second because I thought your stoma was on your right side. Then I realised it's a mirror selfie.", "aliheaton": "@andi.heaton forever gives me the kick up the arse to smash life ❤️", "suzieclair11": "Legend!🤩", "loveandlondon": "The best ❤️❤️", "eminquotes": "Proud of you!", "stringtheorymcr": "You go girl! Thanks for making another of life’s potentially shitty (pun intended) things be completely normal and beautiful. Please keep on being you and helping others. 💜", "kayleighegerton": "Looking lush babes x", "swychingitup": "Hannah, you’re bloody fabulous. You’ve helped me so much in getting my head around having one. What an absolute babe you are ❤️", "fightmeeuwu": "Happy Birthday Mona 💞", "emily_runz": "2 years now? Wow I remember I subscribes during the hormone diaries and when this happened I really felt for you as one of my friends has crohns and had a temp stoma. So glad your living your best life 💪", "aardbeibaby": "❤️", "fanny_tld": "You look fab ✨", "eviealbanyward": "My dad got a stoma just before Christmas and following you has been so helpful. Thank you for spreading the good stoma vibes 😍", "aura.clothing_": "Happy stomaversary Hannah🙌🏼 We would love to collaborate with you 💜 #ostomyawareness", "unfugius": "😍😍", "bmariaxx": "Happy 2 years! ❤️❤️❤️❤️❤️🙌🏻🙌🏻🙌🏻", "lolly_cooper": "It’s my stomaversary today too!! 1 year!! 🥳", "nadimwallani": "You're inspirational sweetie", "crohnsandcolitisuk": "💜🙌👏💪😊", "e.mileekate": "Happy 2nd birthday Mona!! 💩", "nikkimcmullen": "Happy two years! I’ve just been diagnosed with crohns and your account makes me feel so much more positive about that ✨", "wlnyc": "Hubba-hubba! ❤️", "livkelly._": "and we’re so proud.", "itahisard88": "❤️", "karolina_kubinova": "happy stomaversary! 💕", "mateocifre": "Happy 2 years, and how das all this time 😉", "dustyduster1983": "Still a hottie ✌️", "ashesmck": "Wow that's incredible! The time has really just flown by! Happy 2 years to a solution that helps you live life!", "chloroseknightt": "@alf4495", "getittogether_blogs": "Looking amazing 😜🔥💕", "steveblystone": "Cutie! Happy anniversary!", "stephen.psb": "I had one from sept 2014 to June 2015 and it was pretty awful, will you ever remove the stoma?", "cristaldeglace": "You look so happy! Also would love to know where the bra is from in the first photo", "love2follow2020": "Love seeing you in lingerie 😍😍🔥🔥", "vanstiel": "Well.. Just stay fabulous 🤷‍♂️", "lightningman94": "Aww you're amazing!!! 🤗💞💛💛💛💛😍 @hannahwitton", "goudvis888": "♥️♥️♥️", "pauldave1987": "Love the new podcast hannah!", "_about.lina": "💪🏼♥️♥️", "mattyg_1991": "I’ve had my stoma since 2013 / 2014 when I had my op still have it now still to this day I don’t have bottle to take a picture with my shirt off showing my stoma bag off", "emsladedmondson": "Fave hottie. ❤️💕❤️", "coloplast": "Happy 2 years Hannah! 💙💜🎉", "autonomous_ultra_instinct_95": "Beautiful hannah im a subscriber to your youtube channel", "b3rnhard_33": "For me it is the same😍", "aliciaheldin": "🥰🙏🏼", "davis7856": "Happy Birthday Mona the Stoma!", "lrnelzbth": "two years has gone so quick! you look incredible ❤️", "mikehardeman99": "Honestly pretty sexy to me❤️😍 @hannahwitton", "ununpentium": "I'll be 2 years in May with my ileostomy 👍🏻", "dreadfullyinadequate": "Hannah I have so much love for you! You’re rocking Mona!", "kat_ashton": "🧡💛🧡💛", "ejthompsonx": "Happy birthday to your stoma! Give it a birthday sticker or something"}