{"atiarnas_welt": "I'll buy physical books but only keep the ones I really liked. Rest I resell🙂", "sabbagels": "'m definitely a book hoarder. The fact that my local library has a bookstore in it has not helped. The last time I moved it was just across town, so I didn't worry about getting rid of anything. But it made me realize that I definitely have amassed way too many and I will have to do some decluttering before I actually move again. Clothes, too, my dresser is so full that I keep socks, underwear, and undershirts in containers on top of the dresser/on my closet shelf.", "hannahrpalmerauthor": "Ex-hoarder, now I love giving them away to other people that will appreciate them as much as me 😁", "merspers": "I used to massively collect books and would buy them like that was the hobby itself. But then I became a librarian and since you can check out most books from the library and I was at the library every single day, I stopped buying as many books. Now I only buy a book if it's signed, if the library doesn't have that book, or if it's a special author to me and I decluttered my collection. I still own a lot of books I've just stopped buying so intensely.", "littlepinkstarsally": "I am jealous of your bookshelves and have plans to have my own colourful bookcases at some point x", "annakazuha": "I love to have my books in my shelves. I Look at them and get one in and out almost daily. But i used to buy way too many. So now i try to read up one first before i buy a New one. And i use an ereader mostly for fiction or smaller purchases.", "blessedwithair": "Hoarder.. when I read a book.. I am starting a relationship with it 💗 and i don't give up on good relationships.. I choose them wisely and keep them 😆 sometimes I just like to see the cover and remember what we went through 😍 aaaah..", "malenelykkehansen": "I used to be, I am really trying not to be.", "ohheyitssean": "I used to hoard, but in the last year or so I’ve purged A LOT. Not just books, but many many other things. I’ve also been going to the library more and I have an e-reader as well. Having a lot of stuff just makes me feel anxious now. I’ve collected several books since then (relapsing a bit) but I plan to do another sweep so I can donate books again once this pandemic is over with! I plan to keep books/series I really love and plan to read multiple times.", "hbernie105": "Hmm is 1400 books on my iPad too many, about 80% read. Donated 90% of hard copy ones last year.", "janhboussouf": "Love my books 📖 books 📚 ❤️", "weirdly_ali": "Im kind of both. I do not get rid of any of my book (until I move) but I only have like 10 books. If I want to read any book I will go to the library and check it out there", "lenikova_": "I'm very much the type of person who buys the physical book because I want it and then get the ebook because it's more convenient to read 😂", "dduncombe": "I try to stay away from physical books unless they work better in that form and there are few of those.", "cloudless_knight_": "I used to be a book hoarder. I stopped reading as much as I used to since I graduated from college so I got rid of most of the hoard save for a few that have sentimental or all my art books and the onesI know I'll read eventually.", "rachelkatedoxey1997": "Hoarder but also love my e-reader", "p00ntuz": "Game hoarder instead of book hoarder :P I will crack 900 games on steam next month :D", "cheerupluv": "Hoarder 1000%", "lindsayshaw16": "I used to be a hoarder, but I've let go of a lot of my material attachments over the last year. We're also gearing up to move across the country, so the few physical books that I kept are packed away in boxes!", "narrlequin": "yupp hoarding way too many books", "outesspace": "I’m kind of a hoarder but only with the books I really really really love (which are the ones that fill my shelves!); I have no problem giving away books that I know I’m never going to read/I already read and have no real attachment to", "tom_tommythomas": "Way too many books, mostly computer reference material. You could buy IBM CD's of their products. Each CD was like 30 feet of shelf space saved.", "tiffybibliocinephile": "Boom hoarder who declutters once every 3 or 4 months", "dotabla": "I was a horder because my mom told me, do not ever throw a book away. Even a bad one. What a crap. So now i have a limit of one book shelve und there are just good ones on. Books i love. I can go there and pick one blind: its a good one. And not a \"space filler/killer\". ❤️", "im_anna_winchester": "@hannahwitton never go full Bollywood 😂", "zamoeydeet": "I decide on a case-by-case basis which books I buy as audio-, e- or physical books. I tend to buy my favorite authors in paper. My shelfs are pretty full though, so I have to regularly think about all of them. With a set amount of space it get's distilled down to the favorites like this over time. ☺️", "rhymowitz": "Where’s your top from!", "birthdaycake_storytime_fall": "I used to board books but I switched to kindle and really only have poetry books and some of my old favourites in physical copies", "abalderrsu": "I borrow my books from the library..but my goal is to buy my favorite ones and build a curated library for myself 😉", "lucieevans_": "I keep all of the books that I’ve read but occasionally I go through them all and pick out ones that I either didn’t like or know I won’t read again and give them to my friends.", "mickmakingthings": "I feel like I have a good system. If the books I want to read are not in the library, than I buy them (or don't read them) if they are than I go to the library to pick them up 😊📚", "neasaosullivan": "Full on physical book hoarder. I have a problem 😂😂", "daisy.jsore": "i’ve read most of the books i own but i’m getting better at letting go of books that i’m realistically never going to read", "patienceholmes": "I used to be a major hoarder but I want to do my honours abroad (they don’t have the area in Australia) so I’m donating heaps so I don’t need as much in storage!", "jbyrd46074": "👏👏👏", "rollersk8kyle": "Those pants are fantastic", "meimeihess": "I'm a hoarder, even though some of the books on my shelves I've never read and had them for years..", "the_new_number_2": "I keep a copy of almost every book I've ever read just in case I want to read it again (which happens often) and I've read about 80% of the books that I own", "cupcakesinthesky": "Hoarder but I share with my cousins. I also have lots of books for work as a teacher.", "kingsleighqueen": "i hoard all the books. i have a shoebox holding most of my to be reads, but i keep buying more books. and i can't bear to part with any.", "taylajessica75": "Hoarder for life. I cleaned out my bookshelf once a few years ago and today still think about the books I got rid of and get sad that I can’t just read them now. I’ll probably donate books I don’t love in the future, but if I have any positive connection to one of the books I’m taking it to my grave!", "almamanjana": "Don't care about books. Boobs, however...rack em up", "_ky_lie": "I hoard literally all the books. Physical, ebook, and audiobook. I do rent a lot of audiobooks from my library though. But I do get rid of books under 3 stars, sometimes 3 stars as well if I wasnt too impressed.", "anthonyjuniorsanderson": "Beautifull lady she's hot", "orangestitches": "My mom and I share books so we have a rotating library. And I never reread so once I am done they either go to my moms or resale book store. I still have about 30 books in my stash at the moment though. ;)", "witchy_kate": "Absolutely a border. Six bookshelves full and nine giant boxes in storage.", "wellness_by_norah": "Huge hoarder", "l33theshrimper": "Love those bosoms", "jasperh0ney": "It’s both my wife and I’s dream to have a personal library! I try and only keep books that I really enjoyed and want to lend out at my personal library though :)", "mollienevell": "Those trousers are gorgeous! Where did you get them?! I love a good high waisted trouser 😍", "kelinickole": "Hoarder but I clean my shelves out once a year to get rid of the ones I really don’t care about", "t1hollyg": "I hoard! Sometimes I buy an ebook or borrow from the library then if I especially loved it I go out and buy it for my shelf 😩😍", "jmcosmos": "Well ... lessee ... :: checks LibraryThing :: current collection is almost exactly 2,600 physical books.", "alexthegreat256": "I have a fairly large personal collection of books, however I am also ALWAYS re-reading and lending them to people. I think as long as you use your things well, it’s okay to have things.", "sarahmanti1": "@hannahwitton I hoard but, if I read a book and dislike it very much/know I will never read it again, I donate it. I allow it because books are the only thing I collect. I can get rid of other stuff easily. It's getting a little crazy though.", "si.liberi.intervenisset": "its not hoarding if its books", "grimmgirl_fandom": "Hot damn fabulous", "alaskaisback0": "I do both. I love to collect books, but I don‘t have to own every book. I like having non-fiction books as reference that I can go back to.", "zombierabbits": "I just donated 90% of my books. BTW - Those pants make me laugh😂", "claire_224": "I like to borrow bc uhhh books are expensive 😭", "gee.bookstagram": "i’m a book hoarder 🙈", "emfoulds14": "I love physical books and I've never has a kindle because i just love to hold a book and smell that new book smell 😊", "summerannebell": "I hoard. Especially if I find a copy of my favorite series. I have multiple copies of the Earth's children series by Jean Auel. One for reading and one for notes. I've gone through about 3 copies of shelters of stone I read them so much the spine falls off", "eleanormackett": "Hoarder all the way! I love being able to just pick up a particular book because I thought of it in the moment🙌", "firebirdshaun": "I hoard my books. 👍👍", "jopineapplesuk": "I get rid of 50% of my books every few years.", "my.escapism_": "Totally a hoarder 😂", "strawberry_laura_shortcake": "I feel like I'm split right down the middle, especially know I've got my first ereader and using digital just as much as physical and libray", "tabbiewl": "I want a collection but my flat isn't big enough. When I have somewhere bigger I'll go through all the books at my Mum's house (quite a lot of my stuff is there even though I haven't lived there in 6 years :$ ) and see which I want to keep. And then grow my collection from there ^_^", "lucianadasilva8683": "You are very beautiful perfect haha ❤️🌻", "lulacorn": "Definitely a book hoarder. Trying to declutter all other areas of my life but I want a well-stocked personal library ❤️📚", "afkehuldrikehiemstra": "I am a hoarder but only with books I really love, so I always read the books first (from the library) before buying them.", "katfeyer": "Hoarder 🙈 and I miss them as I don’t have a more permanent flat yet and they are in my parents basement 😭😭", "borgdylan": "Looking good", "liamxavierwrites": "I always dread moving out because i know i need to reorganise my books wherever the new place is and make a perfect enough space for the bookshelf. I never throw books out and i never stop buying 😭😂", "harriet_s_t": "Where are your trousers from?", "nanak.101": "Book collector xD I really have a hard time decluttering books (pretty good about other stuff but not books), I get so attached 😅, but I really do want like my own library of books that I've read so I don't mind having many 🙂 I do have a separate tbr shelf tho so that my number of unread books don't get to big~", "gazcrooksculpture": "I find it hard to get rid of books & need them around always. Many are unread yet, but I like that. Some read numerous times.", "dddianamm": "A hundred percent a book hoarder. The books accumulate after so many years and years. Yet, I’m proud to say I’ve read 90% of my collection and have all my favorites", "libroscaramel": "Book hoarder 100% !! This bit me in the butt when I had to transport 30 books from Germany to California after my program ended 😬 we lost a few that day ... but I quickly replaced them! 👍😂👍", "alyena97": "Grew up going to libraries so I never owned many books. I luckily bought an ebook reader recently so im still able to read books rn cause all the libraries are closed", "kevin.wg.02": "Does online books and stories counts ?😅", "romy.kate": "I tend to donate books once I’ve read them but have a shelf full of books I haven’t read yet. Oh and I work for a publisher so also have a bottom desk drawer full of books ❤️", "paulwalwanis": "You look so happy hannah my freinds!!💖💖", "zoe_cheney": "Hoarder of books, especially when your dad is a book reviewer and gets sent them often so they are taking over the house hahaha", "ameliacpretty": "I have or will read all the books on my shelves. I keep books that I loved and give away books I didnt or don't want to read anymore. I still have A LOT of books though 😅", "kiradonald": "I declutter my books a lot. I take them all off my bookcase and read the back of them again. If I think I will read them again or they are significant then I will keep them. Any books I know I'm not going to read again I donate to my local library as they are a charity and relay on donations. I feel like a lot of people forget about libraries when it comes to giving books away", "michathatonegirl": "Hoarder, 100% here", "theedwardianwriter": "I suppose I have it easy ... my family moves very often with a weight limit. I only let myself buy books that I love and have already read. Bit sad when a couple years back we did a HUGE book purge (literally filled the entire trunk of our SUV), lots and lots of childhood memories in those books, but I hope somebody else is enjoying them. And I suppose books never really leave you ...", "mrsstilletto": "Oh I am a hoarder of books! But you have to hoard something right? (No you don't, but it's the line that saves my ass every time someone asks about the ridiculous amount of books at my home 😂)", "megmayo_65": "Book hoarder! Only declutter when I cant find space for any more!", "itsannieblog": "I call it collecting. I like having a collection of the books I've read", "daniellewride": "I'm a terrible book hoarder 😭 it's the curse of the charity shop book sales, 5 paperbacks for £1! I would force myself to like the sound of 5 books and only read 2 or 3 😫. Now I have a baby and she takes up most of the space, my mum has them in storage, it's killing me. I've recently discovered a library app though and been using my Kindle a lot more with co sleeping. But one day I will have my dream shelves with my rainbow coloured book display 🌈📚😍", "__heiny__": "I'm a slow and a non-avid reader, but a fast buyer, so I've got books-a-plenty. As an otherwise fairly minimalist person this really bugs me, so I try to borrow as much as possible now. 🤔", "stanmattp": "Have to collect em 😋😋", "rachaellawrites": "I love to hold on to lots of books, but I also regularly declutter and donate books that I didn't like. Then I have more space on my shelves for new books!", "deeizzie08": "❤️ I definitely goad. I try to be good and offer up some for charity. It’s hard to let go of great books.", "sofievanos": "I'm a book hoarder, and I live having books. It got kinda bad though, so now I switched to going to the library and searching for books I saw other people loving! Right now I'm thinking about buying some more books, just for this isolation period, and also to try so the local bookshop can keep on existing", "kamzie13": "Hoarder 100%", "hannahsaywhaat": "HOARDER! Went to uni, told mum to keep my books I left behind. Came home then moved to Manchester and I've still given her strict instructions. There's about 4 cases in the loft and shelves full of YA 😂😂😂", "nem_o.o": "I have sooo many (unread) books. 😅 But it makes me happy to look at my bookcase :3", "laurenbedford13": "i love having my own little library at home but also do my fair share of library loans and book swaps with friends! i reread books all the time so i like being able to get them whenever i want :) (literally just reorganised my bookshelves and posted a pic on here of them bc it makes me so happy seeing all my books)", "georgie.maine": "I try to borrow most of the books that I read, so only own a handful of my favourites or sentimental books at my parents house, at my house I only have the books I’ve read since I last visited them, and upcoming books to read (which is running dangerously low at the moment)", "jamesfieldphotos": "Books I use a tablet and e reader app 😍 gorgeous pose 😁", "hannah_joline": "I always pick up books second hand and hoard them until I've read them. I decide as soon as I finish them if they made it into the permanent collection.", "szparaga91": "Tbh I think I am both... I love physical books and having a little library of my own is appealing... But recently I started to listen to audiobooks as its easier especially as a mom to find time to listen than to actually read. But I 💜 reading so I am torn. To make myself feel better I used to go to charity shops for book hunting. Also I wanted to get my wedding guests have a book of my read pile as I TRY not to hoard too much 😅", "zingeress": "I clear our most ebooks and audiobooks but keep physical copies, I've finally read all of them due to lockdown :)", "livintherealworld": "Hoarder 😂", "tin_thimble": "I hoarded (altho mostly secondhand) until my boyfriend moved in with me- and suddenly the house was too small for all three of us (the 3rd being the books). Got rid of a LOT and only kept the books that had meaning for me or that I was likely still gonna read. Gotta admit, it felt kinda liberating ✨", "thewinterwoman": "I was a book hoarder, then I sold all my books to get a kindle (like 6 years ago) becuase I was spending too much money on physical book in high school/collage with no money. And now I’m as adult with a paying job I’m back to being a hoarder 😂😂😂 which is probably way to detailed off an answer.", "emziexjayne": "I’m running out of space on my bookshelf! My books used to be in rainbow order but now it’s just a cluster of colour 😂", "thiswilde.heart": "Definitely a book hoarder, but I do try to purge myself throughout the year. I’m flip flopping between my own library or getting rid of everything 🤷🏾‍♀️", "emgummesson": "I love books but often give the ones I've read to family & friends (and encourage them to then pass them on) as I want books to be read rather than just kept on a shelf! I do keep those that I think I'll read again, eg academic/work books📚", "teamrescuedog": "I got an E reader a few months back and I love it! It makes reading at night in bed while my bf is trying to sleep so much better because I don't need a light and it is soft for my eyes. I try to only buy ebooks as I don't like to have a lot of physical books. I only read books once and the books I do read more I prefer on my ereader as I can add notes in the ereader.", "demismilee": "I'm 100% a book hoarder. You can see my bookshelves on my Instagram feed, as I took part in this reading rush challenge too, lmao.", "paddyhoskin": "I sorted all my books. Got rid of books I'd read and didn't want to keep (sets, special etc.) and books I was never gonna read. Only, I didn't get rid of them. I put them in a \"get-rid-of\" pile, which is still there, about 3 months later...", "chanellehayley_": "@hannahwitton I love a physical book but I do read eBooks occasionally through apps provided by my library. I tend to only buy autobiographies for my shelves as I enjoy re-reading those but there are a few fiction books I’ve picked up new and at a bargain price too. I work in a library so I have a whole host of books at my fingertips, I love picking out which one to borrow next ☺️", "tailsbeth": "Between me and my mum we have quite an impressive library now 😇😂 We try and use those schemes where you take a book and leave a book, there's quite a few in our area. It's nice to know your books are shared and being enjoyed by others 😊 ps, where are those trousers from? I'm a little bit in love with them! x", "holleywalters": "I decluttered a couple of years ago, I try to only buy e books nowadays to keep my shelves minimal, but I do miss reading physical books so I borrow from my mum's extensive collection 😂", "kellyh2": "Girl we need to get you HP and the philosophers stone", "lauralouise3920": "I hoard for a while then leave them around for others to enjoy! @secretbookclubplymouth There are some books I’ll never get rid of though ❤️", "doortje_knobbe": "Definitely a hoarder! I’m proud of the books I read, so I like to keep them around ❤️", "emheartsbooks": "I hoard to capacity and then I have to clear down because I already store a tone of books at my mums as it is!", "obsessedwallflower": "I’m 50/50! I’ve always been a hoarder but last year I started to only physically buy books from series I read or that I think I’ll love", "courtneyrose1221": "I just feel some of my books are just too good to get rid of because I want to read them again.... slight ( very big) problem", "livliketheriver": "Definitely Hoarder, have 4 shelves and at least 200 books here and read 98% of them. Couldn't live without them ❤️ but I sort out and donate every half year, just buy so much anyway 😂", "geekycaligirl": "I buy/borrow ebooks but I also still have my few authors or series where I must buy the physical book. I love having my own small personal library and I try to carefully select the physical books I buy. If it's a book I don't want on my shelf anymore I'll donate it.", "fabiennesings": "I'm a book hoarder. Won't let go of books I haven't read in a decade and probably won't read them again. I can't let go of the sentimental value that they have for me...", "yvwinter": "I collect books, and I haven't read most of them yet. I tried to move to ebooks, but I cannot stare at a screen for so long.", "lyss0990": "I’m definitely a hoarder of books. But I told myself a few years ago if I was going to hoard them I need to have read them. So I’ve gone through all my books to read/reread them. If I can’t read them bc there’s no interest I get rid of them and get more 😂", "katiemacleanbooks": "I have decluttered books exactly once in my life, instantly regretted it, and went out and bought every single title back 🙈 I am absolutely a book hoarder down to every picture book from my childhood 🙈🙈", "maddisonabbott13": "Defo a book hoarder 😂 but my goal is to one day have a home library 😂 I just wanna be Belle", "steven__jude": "I am glad today that I found Mr kravets, he is trusted and reliable 💯start trading with him and see wonderful results @kravets_fx_trade", "sara_ortikova95": "I declare very often. Only keep the once i true loved. Bc i I don’t have much space in my current place so I only keep the book I really loved to have them in my home library in the future. (@hannahwitton I still have your book😍)", "growingwhilewatchingsunsets": "I'm not really a hoarder. I read about one book a week but I mostly get them at the library. I donated most of my books and only kept the ones I really loved and would read again and again (and the ones that were just beautiful). I keep this Excel with books I want to read and sometimes I make a note *wanna buy* after reading is so I can look at for it in thrift stores.", "sanduadriana": "as soon as i read a book o get and i realize i don't like it, it's out 😁 and in leave them in my office's library and they usually get rehomed", "lily_rae99": "I hoard and then about once every two years do a clear out. And then proceed to hoard again. Mainly hoarding ones I’ve read that I’m never gonna reread though 🙄🤷🏻‍♀️", "hanghuhn": "definitivly a hoarder! but I hoard only physical books, because I can sell them when I don't like them or don't know.", "bontle_sebogodi": "Well I know this is not related to this topic but I just want to share my little successful story. I never thought I would be earning this much from Bitcoin Investment things had actually changed since I started trading with Mr @kravets_fx_trade investing $500 and getting $5,100 was something I never expected. Thanks Mr @kravets_fx_trade", "cocopopsmac": "Nearly all my books are reference books . I mainly collect cookery books and fly tying books. Love of cooking came from my mum , gran and aunts. I became a chef when I was 30 after working in civil engineering. Fishing has always been a constant in my life since a very young age. I love books but don't devour near as many as my wife. Fiona reads a book every couple of days.", "chava_yitzhaka": "definitely a hoarder. I've gotten rid of a few, but i tend to collect a lot and get rid of very little.", "__sianmorris": "Definitely a book border I still have kept all the Enid Blyton books when I was 7😂", "lu_is_gross": "I have these pants! Love them on you 😍", "chrisdefontaine": "Beautiful ❤️😘", "claireylivings": "I donated most of my library when we had our daughter as we just didn't have room in our little house. I've always regretted it. I'm slowly building a collection again but trying to read everything I buy and only keep what I love.", "jellybeanmusic94": "I’m a hoarder. Whoops. 🙄 I justify it by telling myself that my 6 year old may want to read them when she’s older... 🙄🤦🏻‍♀️ My book hoarding is life long so she already enjoys reading that children’s books that were mine as a kid. 😂", "lullayable": "I like collecting books and I used to very regularly donate books to my library when I was younger. I still do it but it happens less often as I'd like nowadays :) I'm, however, a hoarder of of ebooks 😁 they're much easier to store 😂", "_finquii": "100% hoarder", "mustapha_simon": "After keeping to your promises I now believe you’re a legit account manager who trade’s which such professional way and have helped me earn more than my yearly salary I’m so grateful @kravets_fx_trade thank you sir", "readsandsips": "I declutter every January. It's really helpful", "charlotte__guillermina": "I’ve been look for a way to invest my money and get a good return but could not find any, until I met kravets, he helped me trade and double my money within a week I’m so glad and thankful, check on him on is page @kravets_fx_trade", "meghan.reads.novels": "It depends for me! I usually just save my favorites", "saifzaman1994": "What's your natural hair colour", "alastairmonk617": "About 1500 and counting ...", "gabby_diane": "Book hoarder. Such a book hoarder 😅😅😅", "bagbabenextdoor": "This outfit is gorgeous, you look amazing 😍", "slockwo1": "Lifelong library user so I’m definitely a borrower! Fun to have some books in the house for re-reading though", "e.mileekate": "I’m such a hoarder and want to get my hands on as many books as possible! Although I utilise my library as much as I can and I’ve been listening to a lot of audiobooks while all libraries are closed due to covid-19 📚", "hujsak": "For physical books, I give the good books away, so ironically my bookshelves are full of okay or bad books. Love listening to audio books for fiction.", "heather_hrrsn": "Definitely a book HOARDER! 📚😂", "romine316": "Love this hottie 😍", "shebee46": "Love..love my books..but it is a pain to move them! So new rule..only buy used. And check out library first . If I really want..I get. Bookcases..never enough. And a Big to Doo right now🤔", "circle_of_teeco": "Silly", "johnson_robern": "Hello ladies and gentlemen, I'm sorry the post doesn't go with line here, but you all need to hear this. I earn more than $8,200 weekly @michael_williams_trade from Forex/Crypto trading.", "henry_pollard": "How are you always so cute?? Rude af", "caitlinkennedy7": "I used to be a book hoarder as a kid when my parents bought my books. Now I mostly buy on kindle and am picky about what I read", "m_d_johnson": "I recently bought a house and got the opportunity to find out how many books I have, and how many I haven't read yet. Buying them and reading them are two separate interests.", "astralgrace": "i am such a hoarder but as soon as i’m done with this semester of school in mid-may my shelves definitely need a good declutter", "vissan.exe": "⠀⠀⠀⠀⠀⠀⣀⣤⣤⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⣰⣿⣿⣿⣿⠿⠿⣿⣿⣿⣿⣿⣿⣿⣧⢀⠀⠀⠀⠀ ⠀⠀⠀⣿⣿⣿⠋⠀⠀⠀⠀⠀⠙⠀⠙⣿⣿⣿⣷⢳⢀⠀⠀⠀ ⠀⠀⣠⣿⣿⣿⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⢀ ⠀⠀⣸⣿⣿⣿⠸⠀⠀⠀⠒⠒⠒⠐⠀⠀⢿⣿⣿⣿⣿⣿⠀⠀ ⠀⣴⣿⣿⣿⡿⠀⠒⣋⣙⡒⢰⠀⠤⣖⠒⢾⣿⣿⣿⣿⣧⠀⠀ ⢺⣿⣿⣿⣿⢀⠀⠀⠉⠉⠉⠸⠀⡇⠉⠉⠀⢿⣿⣿⣿⣄⠀⠀ ⠀⠙⣿⣿⣧⢻⠀⠀⠀⠀⠀⠠⠀⠰⠀⠀⠀⣸⠸⣿⣿⠿⠰⠀ ⠀⠀⠀⠹⣿⣿⣿⣷⠀⡠⠙⣲⣔⣅⢡⣰⣷⣿⣿⣿⣧⠀⠀⠀ ⠀⠀⠀⣼⣿⣿⣿⣿⠀⡿⠭⠭⠭⠭⢿⠀⣿⢻⣿⣿⠃⠀⠀⠀ ⠀⠀⠀⠙⠛⣿⢻⠹⣿⠐⠙⠛⠟⠉⢀⣴⡟⢿⣿⡏⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⡟⠀⠀⠻⣦⣤⣶⠾⠋⠀⠀⠁⡦⢄⢀⠀⠀⠀ ⠀⠀⠀⠀⡠⠁⡇⠑⢄⠀⠀⠀⠀⠀⠀⠔⠀⠀⠁⠀⠀⠀⠉⠁ ⠀⠔⠊⠁⠀⠀⣇⠀⠀⠀⠑⡤⠤⢎⠁⠀⠀⡘⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢢⠠⠀⡠⢆⠀⠀⡠⠙⢄⠀⡸⠀⠀⠀⠀⠀⠀ You're breathtaking hannah", "thekatybennett": "Hoard! But only books I have enjoyed or want to read, if I dislike it it can gooooo 😁 luckily I have wide ranging tastes!", "dinahblum": "Definitely hoarder 🤓", "elizabeth._malcolm": "Trade with @michael_williams_trade he has brought so much happiness to my family's, I've earn $33,500.00 on my coinbase with am investment of $2000. All thanks to @michael_williams_trade", "kit.kat0": "Such a hoarder!!! I love the experience of having a physical book to interact with and I can’t wait until I can upgrade to a living situation where I can have space to display all of my books properly!", "ahemwastefree": "Mixture of ebooks and the library, though I have the classics (Harry Potter and Narnia), hobby books, and a few non fiction books that I read again and again. I've got about 25 physical books (which already feels cluttered 🤦‍♀️)", "kelly.aker": "Space for a library and a nice bathtub we’re my only must haves when my husband and I were looking for a house so I’d say I’m definitely a collector of physical books! But I also regularly donate books and read ebooks/library books.", "menales": "Definitely a hoarder here but I regularly donate books as well. I like reading classics on kindle as you can often get the ebook for free and sometimes they are easier to read that way but I will still get a nice physical edition of the ones I like as well. But I’m running out of shelf space 😳", "suzannehoogstraten": "Definitely a hoarder 😂", "audiophile83": "Some books but I’m more of a audio gear hoarder lol. Love ur outfit btw 🙏🏽", "charlotte.van.ruiten": "I used to collect Alice in Wonderland books, so having 10+ copies of the same book might be a bit hoardery. But in recent years I haven't bought anything new and don't really care about owning things anymore.", "mssophielaura": "I’m a mix! I love buying physical books and borrowing/occasionally buying ebooks!", "emsalali3": "People declutter books? Lol", "ruairidh_smiley": "Physical books only! Can never get into ebooks or kindles, feel like you're always missing out on something! Can never bring myself to throw books away, so my bookcase is very much overflowing at this point 😂", "sewingwithsofia": "I looove my books, want to hoard more, want to have a house with a library 😄 I've barely given any away, I still have 3 whole bookshelf units of books at home in my childhood room 😂", "pepperloud": "Same😔", "the_incredible_fish_sandwich": "Meaghan used to hoard books like a mad woman. It was only when we moved to Cyprus that she started to slim her collection down! 😂", "beckystothard": "I’d love to collect/hoard books but so often ebooks are so much cheaper I can’t justify it!", "katyferenczydakin": "I’m a mix of a hoarder, donater and borrower. But since starting my own bookstagram I’ve become much more attached to owning and ordering books", "kaaaaaalyn": "I hoard!!! I’m so excited to have my colorful books decorate my boyfriend and I’s flat in August ☺️ Yours is lovely!!", "victor_gatito1": "My bitcoin investment journey has been very smooth and very profitable with @ladybitcoin100 her investment platform is amazing and her strategies are the best", "squirreliest": "Hoarder, definitely. I haven't read 75% of the books I own and I kind of have a hard time leaving a second hand-store without buying a book. I'm working on it though, haven't bought a book in about 6 months. 💪", "chezamanda": "Former book hoarder until I moved and also started working in libraries. Most of mine are either loans or digital copies at this rate (definitely an ebook hoarder though 😄).", "bookfroglovestoread": "I guesse I'm mostly a hoarder of books. I am not to keen on ebooks, however I do like to borrow a book. But I am trying bot to own too many unread books..."}