{"johnlee8606": "You must have been awesome at uni🤣👌", "harrysutton89": "You look like you were the wildest of wild children on nights out - would have been honoured to gift you a shot of apple sourz.", "freyarhianne": "Ah, an old Sexian! I always thought Ellie looked familiar and now I remember why 😅", "punkbuster313": "Good Lord!", "justinand1069others": "You're beautiful ❤️", "madgoss25": "You looked awesome! And still do! It’s so cool to see ourselves at different stages and see what works for us now and what did for us then. I was looking at old photos of myself the other day (I’m almost 20 now) from when I was fifteen and looking at how nice my skin was, but I also like how I look now and I think it’s so cool that we can look different all our lives and still look awesome and ourselves and get to experience different bodies and styles and haircuts. It’s a cool part of being human, we aren’t just stuck with the fur coat we were born in - (my pet rabbit just glared at me😂)", "cxntwithacapitalc": "If uni isn’t the time to show your pretty bras, then when is the time?🥳✌️", "aznil_amran": "damnnn😍", "bob_winter_uk": "@hannahwitton what did you study in uni?", "nattynatty22": "Trading has been a lot more easier with Mr Raymond @earn_with_raymond I invested $500 and got a return of $6,500 after 14 days of active trading. His transparency and accountability has always been difference 100% profits and payout. I highly recommend him to anyone looking forward to invest in bitcoin @earn_with_raymond", "zoe7day": "UoB represent!!! 🔥🔥🔥", "rob_colbourne": "Scrolling through I was hoping for a Victorious Sponge cameo 😂", "timd201783": "Can we have more uni pictures please lol 😀", "mystomaandi": "UoB 🙌🏼🙌🏼🙌🏼", "irenelewis04": "It’s the mean girls shirt thing!!", "iwantmythunder": "You saucy minx", "barryaldridge1983": "Reminds me of my uni days @hannahwitton", "420_sq1dc0m": "U where on MDMA", "annabellesaundersx": "Omg your hair was insanely cute, what a look! Xx 😍😍😍💕😘😘", "holman4574": "👏", "embracethatabsurd": "Why are people being so gross in these comments 😢 I love you Hannah 🙌", "hfm93": "@hannahwitton cool scrabble earrings!!", "dhruvit2408": "2nd so hot", "rob_spark20": "Hello i really need a sugar baby i could spoil and take care of...... Weekly allowances of $700, Dm me privately, like and follow... I will HELP with all college fee too if you don't mind.", "millwright93": "❤️❤️", "zakiyah269": "I’d love to see a video on what gaining weight in your 20s- you seem so confident and nonchalant posting this- while everyone I know is so ashamed for that 20s weight gain", "helloems_": "Nothing says 20 like being wrecked at Fab & Fresh", "lost_on_meme": "i would’ve made out with you at freshers", "genejr18": "Wow you look so different.", "hannah.mitchell98": "Omg, the UoB history inhumane shirt 😭😂", "lostfox27": "You've changed maaaaan", "stultzies": "Gorgeous then, gorgeous now. 😊😊", "flegel.dave": "STUNNING!", "eves_eva": "@fam_239 lol it’s your friend", "wpatrickmontgomery": "The Inhumane bar crawl should be a worldwide brand.", "hannahdykeman": "You looked like Lily Aldrin in the first season of How I Met Your Mother!", "trudderrs": "I went to Brum as well!", "katgrimez": "You look beautiful. You seemed real skinny, was it because of ulcerative Colitis? My cousin has it and when it was bad she was SUPER SKINNY.", "sunflower.x0x": "You look like Rico from Hannah Montana in that first photo😂", "franki.barra": "It's amazing how little you've changed 😂❤️", "87yy": "I bet you boobs were huge since you were born.", "krogansoul": "aged like wine", "nashdogg2k12": "I remember this hair 😂😂😂", "ninjascotsman": "@hannahwitton when did you go?", "eleanorbrowning_": "i saw this then a pic of george harrison with longish hair (1964 ish) and i can see the resemblence oml", "notmacin": "the scrabble earrings are really speaking to me", "orangemily_": "Omg this was a great night abhahahababahaha", "henry_pollard": "Wow you have always been hot and continue to get hotter, seems unfair", "harden.beth": "Did you go to snobs? 😂", "isabella.alice": "love that vodbull have not changed their logo in 8 years", "zoecuss": "Blue in humane history shirts all the way! Got my first inhumane T-shirt this year!", "mr.teal86": "Damn girl", "marianne_louu": "H earrings could stand for Hannah or History... but actually stand for HUFFLEPUFF", "adriansims28": "😆😆😆😆", "antoinette.kly": "Nice hair!", "katia_vik": "Miss your videos with Ellie ❤", "jojojoseph11": "You absolutely gorgeous back then too. 🙌🏼❤.", "cherrymistry": "@devp.123", "error_4o5": "you need to get those glasses back lol", "ragnars_20": "Earn £7500 from @imelda_fx_trader", "ghost_zilla13": "Told you kids I was cool when I was younger", "amberrxc": "I went on the inhumane bar crawl last year!", "phil_ingood": "That's actually quite scary 🤣🤣😉", "lindabarsi": "Hahaha I LOVE this 😂❤️🎉", "ellaleversha": "love these 😂👏🏻", "minnie.life": "Vodbull still goin strong lmao", "jeffg144": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "m_orishia_tfc": "Wait you look like a pixie with that hair cut 😍😂", "lucas_warren": "Sorry to be crude, but you were an oddly proportioned human being.", "thisisnaomigale": "These are EVERYTHING ❤️❤️❤️", "_insertcreativenamehere_": "I would do this but it's still half a year until I'm 20 lol", "_rdecker_": "DEAD", "_karina_nosova_": "So hot!", "susannahshep": "@madozets omg school disco and inhumane", "ibrahim_gbn": "Wild things ❤️", "sdsrstephen": "That 2nd picture will help me out in quarantine. Thank you Hannah. Goddess.", "jopineapplesuk": "The 2nd pic....I bet you were popular:) x", "stressedserenity": "What were you studying? [between these photos] 😂", "aharp82": "🔥🔥🔥🔥👌", "whofanchp": "I almost didn't recognize you", "brettcarrutherstrash": "What is going on in the first picture? Lol", "fergus77": "Christ I miss my uni days now 🥺", "rachelm_91": "The best ❤️ I remember that school night so well... you probably don’t 😂 love xxxxx", "love2follow2020": "Would have loved to party with you at uni 😍😍😈😈", "megzsarah": "Such dark hair!", "justmarthaok": "Tragically different in a good way", "kevin.wg.02": "Were you a \"Party girl\" ?😅", "cora_fm": "The inhumane bar crawl lives on 😂 I have a 2018 t-shirt", "thatpoetrylady": "THAT SECOND PICTURE WOWIE", "nataliasiemens_": "@indiawent @ellie_steelee ahhh the inhumane bar crawl hahaha", "anna.kerensa": "The second picture gives off strong Jean Milburne (Sex Education) vibes, fight me", "chelsea.h987": "Just realised we were at uob at the same time... 😂", "naimajm_": "smoke show", "whyaliceofcourse": "This gives me flashbacks to my Uni days too...", "izzyworrall": "@katherine_bryant the vodball top the traditions are still living", "pete.ski101": "Party party @hannahwitton", "iosonofrekt": "MARRY ME", "tisjen": "UoB still does inhumane!! Team history all the way 😎😂", "francescafernando_": "please tell me u lived in snobs", "lumaluus": "What did u study?", "sampaul_masi": "Crazy as always 😂💯❤️"}