{"joinxthexdots": "Welcome to the club 💜", "heysophheyy": "My dad got this surgery when he was 20 years old so I know just how incredibly brave and strong you are! #bagforlife x You’re a true inspiration ♥️", "charityfashionlive": "Sending all the love 💕", "aileen__moe": "@oz_lem9494", "lisatitch23": "Your definitely an amazing person xx", "bestillwithchrist": "You are amazing !!!", "sarastacks89": "I love, absolutely love! how positive you are. Stay this awesome please.", "sheenaomurray": "*I wish you", "punk.rock.cinderella": "YAY! I dont have a colon either! It was the best decision I have ever made! UC sucks! How come they were not able to do a j-pouch?", "lynseyei": "@hellzwillz", "adisorn_petchchuay": "✌✌✌", "doonie_ladypoopbag": "I said good riddance to my colon in October last year. Best thing that could have happened. Proud of my stoma and her little bags. I've missed so much of my life but now, at the grand age of 43, I can start again! Wishing you a speedy recovery Hannah xx", "beforchange": "Wishing you all the best Hannah 💪💜", "girlinhealing": "Hoping you feel better soon! 💜💜", "mary.duhhh": "Hope you feel better!! 💙", "_ellie.douglas": "Get well soon lovely ❤️", "jovana.miljanovic": "Lots of love stay strong 💖💖💖", "lovetobreathe": "You’re amazing, Keep staying strong! Sending positive healing vibes your way! 💪🏼❤️✨", "spoonielifelover": "You are so strong Hannah. You rock that bag girl 🤗👌", "ericapeberdy": "hope you’re alright x my mum has had multiple stomas due to having crohn’s disease so i’ve grown up knowing about it all😂💗", "natgonnalie": "@mollyollyostomy !!! she’s one of my fav youtubers and this made me think of you", "sadeshart": "@hannahwitton I’m so sorry to hear you went through that! But I’m happy you’re now on the mend. I had the same operation last July and it saved my life! From a purely selfish point of view it will be great if you are able to share your experiences on YouTube. The more awareness the better, when you’re ready of course. Sending love from a fellow #Ostomate x", "ally.mjk": "@romey.rose if you need a surgery like this, I know you will be ok too ❤️", "fiona_curry": "Get well soon ❤️", "lorijomurchie": "Hope you feel better soon ❤🌻", "dantangle": "Welcome to the stoma club! Hope your recovery is nice and quick - and you gotta name your new pal poking out ASAP! Franks been my best mate since my op!", "valencamposn": "💕", "trevorwatty": "✌. Hope you be back on your feet soon !!! 😘. 💕.", "daryadee": "@itssahrak !!", "lydiaruth18": "Hope you feel better soon lovely!!", "sophiespacebuns": "#bagforlife go on Hannah!!", "beingarpitaapal": "Get well soon 👍😊", "inf3rno5": "Wish you all the best", "mow_your_lawn_oren": "Get well, Hannah ❤️", "thefatbombus": "Hope you recover soon, love 💖 rock the poo bag 😚😚", "melbsbb": "Absolute rockstar 🌟", "cjellis0213": "I'm going through the same thing!!! :D", "gehrburr": "sooo happy you’ll be okay!!", "donaldbieszczak": "Brave young lady!", "daniellecalifornia": "Here’s to a good recovery and that things will now be okay! GI issues are no joke. :( When ya feel better check out @letstalkibd she’s an nurse and has an ostomy . Her videos are very informative", "nickalbano1": "My mother had that surgery get well soon ❤️", "ms.why": "You're amazing, keep being happy, it's what you do best :)", "s.j.diantonio": "At least you'll never have to worry about running out of toilet paper ever again...and when at the market, when they ask you \"paper or plastic\".... You'll confidently say plastic!!", "samrutfield": "You are a fighter! Sending good energy.", "luisenrique_art": "Get well soon Hannah!!! My best wishes you awesome person :)", "rubyw4nts4p0ny": "Bag for life as in youll have to poop in a bag for the rest of your life???!", "the_brownish_haired_girl": "Get well soon beauty girl. Love 😘", "poturtle": "Get well soon you lovely human, i hope this improves your life!!!", "notserena17": "Get well soon!!", "_fernella": "You’re super strong, never give up.", "aubreycamp": "It’s been 10 years since I had a colectomy for my ulcerative colitis. It was life changing! Before you know it you’ll be an ostomy pro 💪🏻 Wishing you a quick recovery!", "madisonjmims": "I hope you get out of hospital soon Hannah, and a speedy recovery after that! 💐💐🎉", "blueboystew1878": "Good luck to you honey....if your future is as bright as that smile.....happy days..x", "satsumasacrilege": "Get well soon lovely", "juanita_9730": "Take care Hannah!! 💙💙", "lucy\nVerified": "Verified", "jenmanrique920": "Get well soon.", "wln_desy": "U're strong!!! Get well soon 💪💪😘", "khals_1": "@ginagambetta absolutely not 😳 my poor baby 😫", "allthatjessz": "Get well soon!!! Hope you are already feeling better 💛", "bethanysoutham": "My mum has a stoma and honestly her quality of life has improved. She's a member of a website called inspire where you can talk to others with stomas. Plus it's essential that you give the stoma a name!!", "deetwelve": "A speedy recovery and best of luck with your next steps. Get better and stronger!", "lucymight": "Wishing you a speedy recovery 💕❤", "paulroberts1969": "Get well soon.", "charleymichel": "Wishing you a speedy recovery! My dad has a bag and it saved his life. You’ll have your moments with it and you’ll end up in some very awkward situations (cue bag explosions in public places etc) but they’ll provide you with some funny stories to tell! X", "sky_1722": "I wish you the very best Hannah I love you very much and I will be praying for you to get better soon!!❤️ @hannahwitton", "neil.richardson.1023": "Get well soon woman xx", "jasjinawfe": "Wishing you a speedy recovery ❤️", "ginagambetta": "@khals_1 omg did you know about this!! X", "esperanzalruz": "Get well soon honey!", "paigejoannaa": "Babe you’re amazing! I’m a Crohnie and you are so brave! I hope the bag brings you better quality of life xxxxx", "kaymarfar": "Get well soon Hannah!", "severine_darkora": "I've had mine for nine months now and it's given me my life back. Wishing you a speedy recovery. 💜", "ysaa_silva": "Guerreira❤❤😍", "pennyjarkins": "❤️❤️❤️", "tinybastian": "get well soon 💚🍀", "clueapp\nVerified": "Verified", "tonniknudsen": "All the best to you. Got a study buddy who has a bag as well. Maybe kids won't understand but you can change that 🎖", "gracehinks": "Get well soon!", "aniky": "Aww..take care", "graceevans_9": "My mom has a bag also my sister is having surgery on Thursday to have hers removed to. Hope you recover quickly. 💖💖💖💖", "kel_mhb": "Wishing you a gentle smooth recovery", "mscharlylester": "What @alixfox said - but in my tone of voice, which is far less effervescent 😘xxx", "sh24_nhs": "Get well soon! Lots of love 💖💖💖", "emily_ann_day": "@naomi_day_ poor Hannah", "lucyanna_illustrations": "Get well soon Hannah!!! ♡♡♡♡♡♡♡♡♡♡♡♡♡", "carlymoore_": "queen", "summontheluminaries": "#bagforlife ❤", "marts_tone": "Best of luck and best wishes on fast recovery♡♡♡", "shashwatimishraofficial": "Get well soon!!! And brave of you to put up a big smile like that!!! Lots of love💞🙏", "thailaskye": "It's been 8 years since I've been living with a bag - best thing I ever did! Hope recovery goes well!", "loretomcfly": "My grandma has a stoma too. When people find it out they’re like 😱 but it is allows you to live so it’s freaking cool. Get well soon♥️", "scarrednotscared\nVerified": "Verified", "dereinzigwahrebohrer": "Get well soon! check out https://www.jasminestaceycollection.co/ when you're feeling better. They make really cool lingerie for women who have a stoma bag :)", "justmissshaw": "You are so fucking stellar!! Your positivity and bravery are inspiring. Wishing you all the best in your revovery and lots of hugs and love when you need them the most!", "lia.penny": "<3 <3 <3 and lots of hugs!", "anastasiabeverlyhills\nVerified": "Verified", "beanniify": "So glad you’re okay Hannah ❤️❤️❤️", "jcr.cornelio": "I'll give you my colon Hannah!!!!, get well soon!🦄🦄🦄", "stephameye": "Wishing you a speedy recovery xxx", "verityroatlanguagesolutions": "You poor thing. Feel better soon!", "jamalstrowder": "I don’t know you but I wish you a speedy recovery 👍🏾", "fantastic.looks": "love u smile！", "sjmckell": "Best wishes all the way from Sydney x", "anyasfrancis": "Get well soon 💕 big loves x", "maire_93": "All the best to you :)", "manutdsmurf13": "All the best with recovery Hannah. Your fighting spirit is an inspiration to me!!!!", "myfaveplaces": "Hey you are very brave but also very strong 💪. Don’t forget to take time out and really look after yourself. We’ll be here when you get back. 😁", "daisyb4by": "Does this mean you no longer have ulcerative colitis? Like, will you still have to take meds? I'm so happy for you, hope you have a speedy recovery! ❤️", "misss_megannn": "My sister is also going through this surgery right now. She got the first surgery a few months ago and is going to have the next one in a few weeks. Congratulations for having the courage to got through this journey! Best of luck and best wishes on a fast recovery! 💖💖💖 @roseythestoma", "rukirenji11": "I hope you recover quickly sending love ❤❤❤❤", "abril_galfer92": "So sorry to read this. Those types of surgery are tough. Lots of love ❤️ Get well soon Hannah!", "jessie_yqm": "Sending lots of love from Malaysia ♡", "chainsmok36": "Recover quickly", "benshapihoe": "Oi, the poop-bag-things really suck. Recover quickly! 💜💜", "nina_mjd": "Sending you good vibes Hannah! <3", "sarah.seager": "Good vibes!! hoping for a speedy recovery", "s.e.b_14": "Get well soon👍", "nikeshj0shi": "What a spirit!! 👏👏 Hope you recover soon and keep up the spirit!", "jess.norm": "My darling! ❤️❤️❤️ who needs a colon anyway baby", "yayarocks117": "You'll be up on your feet in no time", "ell.slo": "Had no idea what a stoma was! Doing some reading into it now- bodies are so hardcore radical and cool!!! Wishing you a swift recovery and happier, colon-free days.", "izzygale_x": "Wishing you a super speedy recovery! 💕", "sophietaylor_98": "Bee strong and beautiful like you are xx", "matsumakito": "Wishing you the best!!! 😘🤗🙆🏻☺️", "murphy59": "😮❤️", "bexpix": "I mean it was being a real asshole- good riddance is right! 💕💕💕", "ogbillp": "So Happy to see you are going to be alright", "portait_of_a_poppy_lover": "Stay strong Hannah! Seems like you are having a seriously difficult new year. Hopefully everything starts to look up for you from here on out. 🌸", "kellylouisebby": "Your upbeat positive attitude is so refreshing and inspirational. You got this. 💛", "msahaaaa": "Stay strong beautiful and wishes for a speedy recovery 💕💕", "realitysx": "@hannahwitton I had my permanent stoma in June last year... it makes such a difference!! Pain levels are lower and I feel a little more human every day!! Sending you massive supportive hugs!! You’re right.. you will be fine!! Keep fighting beautiful 💜", "pwrfoto": "Hope you're making a speedy recovery ❤ After reading your description my insides clenched up and haven't released yet, you're stronger and more brave than I'll ever be!!", "roxanamariabanea": "Get well soon! ❤️", "kojoanimlive\nVerified": "Verified", "grace.o.carter": "You are amazing. Get well soon x", "jessxmltn": "Get well soon Hannah!! Xx❤️❤️❤️", "sunidasari": "Get well soon", "thehopefulsnowflake": "I hope you feel better soon!", "alesscelauro": "So much love to you Hannah!!! 💖💖💖💖💖💖", "lauren.stafford": "My mom had this surgery!! After a few months of having her stoma and bag, she got a J pouch", "caitroseatkins": "Get well soon, Hannah!!", "sonderandbeam": "You badass ❤️", "justinismostlyokay": "Hope you'll feel better soon. Lots of love ❤️❤️🙏🏼🙏🏼", "traceynatasha": "I’m waiting to hear if there gonna #bagforlife me I hope they do are you at paget", "juuust.bea": "Good job Queen! Gtfo colon 😉 xx", "thesextalks": "Best sincere and all good wishes from us for a speedy recovery, and a comfortable and restful time recovering! You’re super courageous 🙌❤️🌈❤️🙌⭐️", "georgia.oneil": "get well soon!!!", "pinkbby.doll": "Your attitude is amazing💘 wish you well", "jbrannan81": "Get well soon!!!!", "alihamzaawan_": "Stay strong beautiful! ❤", "thelifeoflenaelizabeth": "Get well soon beauty ❤️❤️❤️ when I was younger I had a stoma, you’ll be amazing!", "laceycrean": "💚💚💚", "thejaredjackson": "Stay strong little lady ❤️", "iamchelseagray": "Wishing you a speedy recovery pretty ❤️", "thatshortgirl94": "Sending you lots of love and healing vibes!! Just a new leg of the journey! ♡♡♡", "bylaurat": "Lots of love little sunshine ❤️", "tycarni": "YAYYY I hope u feel better soon ❤️❤️❤️❤️", "callmebyyournish": "Sending only love and best wishes for a speedy recovery!!!✨", "thepiquantfox": "Well done going through the process and surgery! Good things to come :)", "comet.jayy": "Aw babe get well soon!💕✨", "atuckey99": "❤️❤️❤️", "nickypowell07": "Get well soon 💟", "brogansambrook": "@jadesharrock ouchyyy😩😩", "racerjosh": "Good to here", "niamhmcorcoran": "Sending wishes for a quick and easy recovery. Proud of u and your stoma 💖keep fighting x", "mmcw9": "hope you feel well soon :)", "essie.ruth.makes": "Omg, Hannah! I’m so glad you’re ok 💖", "dreamerwonder": "You go Girl! 💛💛", "sjeannettes": "You’re wonderful. Wishing you nothing but happiness!", "lizzalina": "Yessss what an amazing thing you now get to raise awareness for on your platform. Would love some videos about diet etc following this, it's often a big change and learning curve.", "helenstafseth": "❤❤❤❤❤❤❤", "zarbeauty": "My Mom had UC & had the surgery as well ❤️ Prayers for a speedy recovery 🙏🏻💕", "deanna__21": "Lots of love ❤️", "fenrielle": "Get well soon Hannah! You are an inspiring person ♥️", "mylunarose": "Get well soon 💜", "brutaldjc": "💕💕💕", "mariatroullides": "💜", "travelphotos93": "Is it permanent @hannahwitton 😘", "cheekysteph28": "Hannah get well soon lovely im glad your feeling loads better 😘 you girl are amazing!", "marziesreads": "Hope you heal well and quickly, Hannah! 💜", "sunfloweryyellow": "I don't know you but this made my sister and I cry 💔 sending lots of love xxxxxxxxxx", "ajkolikes": "Sending lots of love to you Hannah <3", "__lifeisnofairytale__": "I hope you get well soon ❤", "agusledo": "First I’m glad you found a solution and are keeping a positive attitude BUT what will happen with drunk advice?!?! @antosagarminaga", "cherdynamite": "You’re a total boss, I hope all went well and you heal excellently. Feel better wonderful girl ♥️♥️♥️ x", "jesslunamay": "💜💜💜💜💜", "mab600": "Sort of good news /bad news. Hope you are back on our screens soon and feeling better. Here's a funny octopus 🐙", "leenanorms": "You still looking banging to me. Come back to us ❤️❤️❤️", "lauram10x": "Aw man get well soon!! Well done for being so open about it too. Hope you have a better quality of life now seen as you had a lot of trouble with it before!! Xx", "overtheplace": "You are going to be FINE.", "renpiedrasanta": "Glad you’re doing okay and thank you for sharing this with the internet community when you don’t necessarily have to. Hope you get well soon and fully💜", "sadeyedgirl": "wow you’re a warrior! best wishes 💘💘💘", "marytheteddy": "Get well soon!", "vemmaj": "wishing you a speedy recovery! 💕", "tom_kinchin": "I know how shitty (😉) it can be because my mum has one but you'll get used to it pretty quickly. Just have fun if you get a dodgy batch😂", "mattcarey8": "My Mom had the same surgery. Sending lots of healing vibes.", "cupcakesinthesky": "Hope you have a speedy recovery. Lots of love", "patriciasoaresgomes": "❤ get well soon! You brave girl you! ❤", "missabowbissa": "YAS KILL THAT BOWEL BAG", "peterhughes93": "It's a big culture shock afterwards, you'll get used to it. Check out the sub Reddit, a load of wonderful people there to support you and have helpful advice.", "quinny_26": "💙💙", "laura__ellis": "Love that you’re being vocal about this!! Well done and hope you recover quickly xxx", "merleredbird": "Get well soon!! And glad you’re ok after surgery xx", "katieew94": "Get well soon Hannah! I know you never really just ‘get well’ when you live with a chronic illness but I’m wishing you a speedy recovery and the best of luck for the future ❤️ Keep being your awesome and inspiring self!", "valu.knj": "Get well soon!!!😚😚😚", "haaalllleeyyy": "Welcome to the club!", "estrellallertse": "Lots oft Love 💚💚", "lavendaire\nVerified": "Verified", "walwanisp": "We all love you honey 😍😍😘😘", "mkunit3d": "Get better soon 👍🤗😘", "puertoricanbutterfly_049": "praying and wishing you a speedy recovery doll.", "elliebombelli": "Get better soon my love💞💞💞", "lea.schokominza": "hannah, you are truly inspiring. 💚", "pops_of_rainbow": "I actually spent like five minutes researching this surgery and it doesn't sound pleasant, so I wish you a speedy recovery and nice day.", "ceryscole": "Get well soon hannah xxx", "rachthompsn_": "Get well soon Hannah, you're so amazing and inspiring xxx", "julia.ggomes": "We're here for you, you besutiful strong powerful amazing woman ❤", "hhannah.blum": "get well soon 💛💛💛", "laura.oconnor41": "Wishing you a speedy recovery ❤", "stilljustkim": "Bye colon! Get in the bin!", "kupofjoe": "Feel better!", "sofiaa.rosas": "Get well soon!! Sending you lots of heath and love x", "zetasinorita": "Aaww Hannah! Well done for getting through this and I hope you get home soon!", "wheeebs": "Sending you lots of love and a speedy recovery. Xxx", "viviamfavila": "Glad you’re ok!!!!!", "marenbea": "@hannahwitton I am so proud of you! I’m getting a colonoscopy in a few weeks to see what’s wrong with mine—I’m scared but glad to be finding out. Also my friend @mollyollyostomy runs an EXCELLENT account about living with an ostomoy—you should check it out! ❤️ sending you much love and healing energy", "bridgette_fitzs": "I hope you life live freer now Hannah, wishing you a speedy recovery from your surgery and to a happy and healthy future xx 💕", "hannah.kkh": "God bless you! I hope your recovery goes well. Lots of love ❤️", "sarahdespenc": "💓💓❤🤗 get well. Hugs.", "oldbort": "❤️❤️❤️❤️❤️ you’re the absolute best. Thanks for sharing this Hannah, rest up xx", "emilyventress1": "I had the same surgery in March 2017 and also volunteer for Crohn’s & Colitis, any questions or anything i’d be happy to help!💜", "rachelellathomas": "Sending so much love gorgeous! Xxxxxxxxxx", "picketspickets": "Hannah you are amazing. Sending all the peace and love in the world 💜💜💜", "chloeameyx": "Get well soon Hannah x", "emmacauvin": "Get well soon Hannah! 🌻", "meereefox": "You are amazing!! 💖💗 get well soon - and you know, what doesn‘t kill you... 😉", "great_gordito": "Woo! look at you go! #bagforlife 💙", "_oliviabardsley": "My grandad also recently had a surgery like this and had a stoma. I hope things go well for you ❤️❤️", "joshuwaa": "You’re so brave. I wish you a swift recovery Darling 💜", "mike_shapes": "A friend of the family went through something very similar Hun - about 20 years ago now. She’s been so much healthier - thanks for sharing your story and get well soon xxx", "ursulaoliver": "Big hugs Hannah! This time last year my mum was battling with colon cancer and also had hers removed. I remember her saying the recovery process isn't always pleasant but once you get there it will feel like second nature. Also once you've trained with the practice stomas they give you there are etsy shops with cute stoma covers 😊 i got my mum a hufflepuff one. Obvs!", "orlrose": "❤️❤️❤️❤️❤️❤️", "katrihollo": "Get well soon, Hannah! ❤️", "hannahbiksadsky": "Hope you have a speedy recovery 💗", "joburford_": "Very brave and positive attitude👌❤️ much love x", "antoramajumdar": "Yay! Hope you feel better soon 💞", "aimeemaysmith": "All the best, hope your back on your feet soon!x", "jessiejane1990": "Huge respect for you to post this online. Bravery indeed. Wishing you a speedy recovery and hope that you can help others with your open ness. X", "alliegrce": "Glad to hear you’re on the way to recovery! Lots of love to ya", "jasmin.kswz": "get well soon cutie ❤️", "kyahfae": "wishing you the best of luck during recovery ❤️ much love xoxoxo", "vampirethyme": "Glad to hear you'll be okay! Get well soon💗💗", "daydreaming.becky": "Get well soon 💜💛💚💙❤️", "torty.newman": "Bless you. I’m sure you have lots of offers of help, but if you have any questions AT ALL for someone who’s been through it, I’m very happy to help and answer any questions however big/small/embarrassing 😘 I’ve had a bag for my Crohn’s since I was 15 (I’m 29 now) so I’m pretty sure I’ve seen it all..! It saved my life and as tough as it was to accept, it’s the best thing that ever happened to me. Lots of love and I hope you’re feeling a lot better soon. Xx", "nayelle__": "You beautiful brave girl 💜💜", "wktro": "You're facing this so bravely, I hope you'll only get better from now on, much love, you're a true inspiration to everyone ❤", "bazzrice": "Having a stoma saved my mums life. You will be up and about in no time ☺️ x", "andreaspromenade": "I’m glad you are better", "danskprince": "i hope the world blesses you and your recovery", "rawj_lilac": "So much love your way!! You’re so very brave and I can’t imagine how tough it’s been going through all this. You’re doing amazing!! Lots of well wishes 💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖", "sarahlousteelex": "Hope you have a speedy recovery ❤️💩 #bagforlife x", "mark_lyttle_728": "Get well soon Hannah", "xylochrisbeaumont": "Sounds like a wise move - will avoid other more serious problems in the future. Best of luck, as you can see - everyone is supporting you, wishing you well. C", "vanessa.laughtland": "Get well soon girl! My best friend has ulcerative colitis too and she's been rocking the bag for years. I hope you feel much more comfortable now! xx", "anisuarezs": "Get well soon Hannah we miss u ❤", "morganhhobson": "Better off without it, I hope your recovery is smooth & the transition not too difficult. Such a tough event to experience, but if anyone can do it, you can.", "ladyorancho": "I wish you a speedy recovery! I admire you so much for staying positive ❤️ lots of love and support", "molly.ratcliffe": "Speedy Recovery Hannah. Rest up and stay strong xx", "geraldphoenix": "🙌👊🤘❤🙏", "rileysauruss": "so sorry, but so glad you’re going to be okay! stay strong, even though it may be a little hard, you’ll feel so much better now! trust me, i’ve been there! wishing the best for you, stay brave 💗💗💗", "faulesb": "💕💕💕💕", "romina_schmid": "tHE WAY YOU`RE DEALING WITH HTIS IS SO INSPIRING AND BRAVE", "alinamoschal": "@minzi_ninzi", "sctarlover": "💚💚", "luisramirez2323": "I hope you feel better soon 🌹✌️", "jwcoffeefish": "❤️❤️❤️❤️ get well soon Hannah ❤️❤️❤️❤️", "miss_annelizzy": "Colons are for pussies", "charlottemoores": "Get well soon lovely ❤️❤️", "kmakeup_pro": "Feel better 🌷❤", "rachelm_91": "♥️", "tassedecamomille": "You're so brave. Take care. I'm glad to see you're in recovery now!", "jacobtrueman": "Babe, get well so fucking soon. Genuinely thinking of you.", "zoevandermeijden": "Get well soon!😱❤", "j_immy_g": "As long as you're ok, feel better soon", "martinkp1955": "Very, very best wishes from a total stranger. Good luck with everything Hannah.", "parisienne8375": "Get well soon !", "bambicitizen": "You had me worried honestly", "_miss_healing_": "My mum had one of those!", "valerian.bryan": "Hope yo feel better", "will_lack": "Sending love", "liliesarelike": "Sending you my love and thoughts. You’re one amazing brave lady.", "bajaman64": "@hannahwitton always take a spare clip with you. You'll need ot when you drop it into the toilet.", "rayxfsun_": "hope you feel better soon 💜", "lisamccrissican": "Glad everything went well for you, Hannah! Wishing you a healthy recovery. ❤️", "xandraleigh": "Glad to hear you’re doing well!", "chloemelissaxo": "Awwwh, I hope your feeling better soon. Wishing you speedy and healthy recovery. Honestly your son rave and strong and I'm so glad that your going to be okay. Just know we are always here for you no matter what! ❤️💜❤️", "mansell.evans": "Get well soon, you very brave lady.💙💜💙💜💙💜", "marisamaresa": "strong — stronger — Hannah! Never lose your smile!", "jimmy_jam_james2": ":", "coffeevf79": "Rest up and keep smiling. Colons are over rated 😀", "jlorenz05": "Get well soon Hannah ❤️😘", "swissmiss329": "Speedy recovery!", "its_ameliajane": "Hope you and your bag are fit and ready to head home soon! You are truly amazing. Get well soon xx", "gina_anne13": "💛💛💛", "zlion017": "Get well soon girl!", "lumaluus": "u look so much better already :)", "kpix46": "@amyldall- out of curiosity, what would the lingerie collection have to do with Hannah and her stoma?? thx", "adamcole5052": "❤bless you Hannah", "tiffany_marilyn_": "Hope your feeling better soon! ❤", "tmazdd": "Yay you're safe 💛💛", "this_wayfarer": "Get well soon 💜", "jazzislam": "Get well soon!!", "bettymay_12": "So amazed by your strength and the way you’ve gotten through your health difficulties is truly inspiring to all of us. Keep chugging on you beauty!! Xx #bagforlife", "klaraskrzynska": "Get well soon Hannah", "nikolgoldy": "Wish you all the best 🤞🤞", "ciaramaryan": "Rest up Han!!!!!💖💖💖", "kristyk_fatgirl": "I wish you a speedy recovery! And hey.. aren’t we all just walking talking 💩 bags? XD", "lulufionna": "FEEL BETTER!! 💞💞", "hannanewnham": "@_queenani_ !!!!!!", "lemon_ste": "Happy for you, it's not gonna be easy but better than what you were suffering. Good luck and indeed good riddance it it haha 💕", "elonnabettini": "Sending you some good vibes rn 🖤🖤🖤", "d_krny": "UC is such a bitch.", "avis03": "Sending lots of love your way for a good recovery 💗", "8illyb": "Enjoy the morphine", "softeloquence": "You’re so inspiring and strong Hannah 💞 I hope you feel better soon", "lilzabee": "Lots of love- you’re such a positive ray of sunshine ❤️❤️❤️", "beth.maidment": "love you hannah!!", "aoifegill_": "Hope you feel better soon 💕💕", "emilycupka": "bless!!! glad youre alright 💙", "ebrent88": "Sending you lots of love Hannah 💛", "ourali.iriel": "I'm glad you're okay! Feel better soon ❤️❤️❤️", "claybkr": "Hannah you're the bravest, thank you for being so open about it ❤️ Hope you feel better soon", "michellleveillleux": "Hannah, you inspire me so much. Good luck adjusting and soooo much love sent your way. ❤️❤️❤️❤️", "lyndaob_": "Get well soon Hannah!! 💕😘 #nocolonstillrollin", "marcepalaciosz": "@dannymarie14 what is going on omgg", "hopemcleary": "love you always xxxxx", "pand0rasb0x": "your caption is so positive with such a life change, What a strong, beautiful lady! You keep inspiring thousands! I hope you have a speedy recovery 💛💛", "ainesn": "Get well soon, sweetie. #bagforlife will not stop you, I'm sure 💞💫", "hannahlilybennettx": "So sorry you’re unwell! You will rock the stoma! ☀️⭐️", "2galaxies": "Get well soon, love ❤️", "intuitivelyfree": "get better soon xx", "margotlissens": "Hannah, you truly are one of the biggest inspirations on earth! You're such a possitive and bright person! ❤", "shavinism": "Wishing you all the best ❤", "moskopia": "Your very tough! Thank God for everything!!! Come home 🏡 soon!", "tinamories": "Speedy recovery! Xxx", "emcarcliff": "You are so loved and so bright and such an important person - as a stranger and someone who only knows bits and pieces of your life, I want to tell you I’m so proud of you and only see the best in your future. Big love. ❤️", "autumn_has_a_hungry_heart": "Congrats on becoming a bag lady", "annie_tee": "Your colon was a pain in the butt! Get well soon!", "castillman": "Hope you feel better soon! Glad you're going to be ok x", "sianroalf": "Wishing you a speedy recovery! ❤", "karolina_kubinova": "you look super happy, hope you had some cake (if not, you should rectify that mistake) and hope you heal well :)", "mitchel_simpson": "Brave😊", "carmarugaz": "You are more beautiful than ever ❤️💃🏻🌸", "lavendrboots": "enjoy the morphine while it lasts!! and congrats on the poo bag 💪💪", "lynzmack30": "Get well soon x", "noisynoina": "You're so brave !!!", "cmcmullan": "Hope you get better soon! You are so strong ❤️❤️", "laurenbedford13": "you are gonna OWN it and i’m so proud of you", "ells_ax": "WELL DONE YOU FOR BEING SO POSITIVE ABOUT A SHITTY SITUATION. (Literally) Sending you ALL the love & a speedy recovery❤️❤️🎉🎉", "_lmgr": "It's incredible how positive you're being - I hope you're like that behind closed doors too, but if not then that's okay too & I'm sending you so much support & love!! I hope your recovery goes okay 💜", "potayto416": "Here’s hoping you heal quickly, sweetie ✌️ I’m down an ovary and Fallopian tube so I know the feeling of being “lighter” 😂", "leechlamashtu": "Why do you look good in a hospital bed? There should be a law against that. Anyway, get better soon! 😊", "mshammy91": "gute besserung!! (can't think of the english way to say it right now, sorry for rudeness 💙)", "louisewhitton": "You’re so brave Hannah❤️ how are you so positive? xxx", "fumeecharnelle": "Sending love Xx", "libertyclare93": "At least you're sorted! Hope you're feeling much brighter in yourself and having lots of yummy treats. Loads of love you brave lady xx", "kimmie_chan95": "All the best Hannah. I hope you have a quick recovery x", "andreea.rossi": "So brave hannah! You're gonna be rocking that bag with your amazing personality all over the world🔥🔥💜💜", "cata.loon": "Wishing you a quick recovery 💕", "mrsclairebennett": "Hope you have a speedy recovery Hannah x", "kelly31987": "God you really are an inspiration, Hannah. I hope you feel better soon and can get back home to your snug xxxx", "cobie_g": "Well done Hannah! Wishing you a speedy recovery 💜", "ninamharmens": "Have a quick recovery, beautiful💙", "thegrowingbutterfly": "Sending my love to you Hannah! Wishing you a healthy recovery 😘💛", "scoutclark": "💜💜💜", "93funnymfer": "What a shitty thing to happen. I hope you make a full recovery and get back to living your life, the way you want to. Many well wishes and hugs sent your way! 😗", "rebeccaingamaria": "You brave soul! Speedy recovery xxxxx", "ubiquitous.me": "What an amazing positive attitude you have to this. Nothing but admiration for you. Stay strong, and hope you recover from your surgery quickly.", "maelstr0m__": "Colons are overrated", "haru13enchanted": "You’re my inspiration. We love you so much! You’re so brave!", "fayebea_": "Get Well soon Hannah, very brave of you xxxx", "martynamakes": "Well done Hannah! My nan had a similar surgery when she was battling cancer. I love you even more for speaking out about this!!", "hopecaitlintreasures": "Sending you lots of hugs!! Your certainly made of tough stuff ❤️", "blannah": "Get better soon!!", "tiabelle06": "Love that you're being so public about it! Too much shame about stomas and nephrostomies. Get well soon xxx", "sophielouise93": "Sorry to hear youve Bee suffering Hannah 😞Wishing you a speedy recovery! Sending you lots of love and light 💕", "tanyapotocea": "Get well soon Hannah! We all love you and cheer you on xxx", "marble_gray": "Get well soon!!!! I'm glad your colon is gone... doesn't seem like he liked being in your body!", "macydelrey": "💓💓💓💜💚💘❣️💛💘💛", "nixmhb": "Wow, I’m so glad you’re okay. That’s a big deal. You seem to be dealing with it well. Bet there will be lots of videos on stoma’s now!! x", "lexgetshreddy": "hope you feel better soon lovely ❤️❤️", "softly.el": "Wishing you a speedy recovery Hannah!! Hope you feel better soon love ❤️❤️", "thewindow6": "Does that mean you don’t have to wipe your arse anymore?", "katie_odowd": "You are so strong. Incredibly inspiring! I hope the healing process is speedy for you 💛 x", "alexa_burt": "Wow what a strong lady!!!!! Sending you healing vibes - if anyone can rock a stoma it’s you!!!! Just been watching yo on YouTube and you are so funny!xxxxxxx", "freyavocado": "Sending my love xoxoxox", "mxriee_priv": "Get better soon Hannah ♥️😇", "p0512399": "Get well soon Hannah! Love and good energy from austria! 🍀❤️", "doddleoddle\nVerified": "Verified", "nickegibbons": "I hope everything is going well with your recovery. I’m sorry this happened to you but on the bright side, second book story!", "gracemadss": "Get well soon! We’re all rooting for you to recover quickly!❤️❤️", "mauricejb44": "Get well soon Hannah", "kevin.wg.02": "People can live without a colon :o ?! I had no idea", "kirsty.a.inman": "You’re so brave @hannahwitton glad you’re on the road to recovery. X", "libby_ker_": "So happy you’ve had this to help. Love and support as always. Keep fighting you trooper!💜", "adanna_david": "Oh dear @hannahwitton I know exactly what you've been through (but from practice and not experience) and for you to have such a positive outlook on it, at such a young age?? You're a very strong and courageous woman!! I'm sending you so much love, hugs and everything good. You are so brave! Kisses from little Kian 😘💕", "ohladysamantha": "So glad to hear you’re recovering. Be strong! Love you!", "criisphens": "Hope you get better soon!❤", "emmalouisee3": "Get well soon Hannah❤️", "jaayemmbee": "Get well soon! Stay strong!", "marceaguilar02": "Stay strong! We love you", "jackferry": "♥️", "rob_d_32": "Colons are over rated anyway! Hope your feeling ok after surgery x", "brihannonstrathern": "Aww bless you hope you have a speedy recovery xxxx", "amethyst.fae": "💕💕💕", "victoriaroselock": "Aw hannah💗 wishing you a speedy recovery and get well soon!☺️", "simx": "You will rock the bag!!! Best to do what you need for your health xx", "rebeccajowinsor": "Awesome Han! So great that you'll finally be on the road to recovery", "allyoriordan1": "@ciaramoynagh1", "thatphiladambushell": "#bagforlife LOL glad they didn’t take your sense of humour!", "laurenfrench5": "Fair PLAY to you! Brave woman Xx", "riyadhk\nVerified": "Verified", "lucythegardner": "Absolutely love you girl. Big hug coming your way and lots more when I see you xxxxxxxx", "smich1979": "Sending positive energy your way! I hope you have a quick recovery 😊", "vanrhyne": "I hope you have a speedy recovery!! ❤❤❤", "daphnegrace_": "Hannah💔 This breaks my heart, I'm so sorry you've had to go through this. But I'm glad you're recovering and still have that positive attitude! We love you❤", "martaquemarta": "Sending love 💕💕💕", "bbbbobbbb": "Hey Hannah, you came across my search/explorer page and for some reason I decided to click on this photo, but I just wanted to say that in a such a life changing event, you still show so much positive and humorous affirmations. Just wanted to share my thoughts even though I don't know you, but wishing you on a speedy recovery and stay awesome!", "bayleesnyder18": "❤❤", "pauldays": "Hang in there, we are with you all the way.", "intestinesnotincluded": "Omg Me too!! Welcome to the ostomates 😘", "carinaboni": "Hope you recover quickly!! ♥️♥️", "demi.storm": "Get well soon!", "dan.frederiksen": "It's not temporary?", "cayleyb12": "Sending good vibes your way 😊", "nathalie_tals": "Have a celebration that you can finally take more control of your health❤️ #rock that ostomy! Hope you have a speedy recovery from surgery and an easy time getting used to it xxxxxx", "bird35998": "Get well soon!", "thebremner": "Wishing you a speedy recovery Hannah 😊", "guroaf": "Get well soon! 😻", "ellenxclare": "Glad to hear you’re on the mend! Sending love x", "_valentina_b._": "We love you❤❤❤", "bellamshea": "My dad has one I hope you have a speedy recovery", "emilysalamy": "Get well soon💕", "klairehumanoid": "Take care Hannah!! 💜", "mellylynn12": "So glad you are recovering well and in great spirits! ❤️❤️", "elenacoorie": "You go girl ❤❤ get weel soon ❤❤ love from spain", "nataliebyrne": "Sending out lots of love ❤️❤️❤️❤️", "barry_happy": "HELL yeah more girls with bags need a confident role model like you to look up to!!!!", "ellakw__": "Welcome to the club! Feel better soon ❤️", "claire_rbrtsn": "So glad you're on the mend and while the stoma may take some getting used to at least you can be confident that you have taken control of your health and your body for the better ♥️", "artistiqella": "Glad you're okay ❤ sending love!", "hollygrwd": "my mum has had a urostomy bag since she was 6 and she manages amazingly! thank god you’ve come through the other side, good riddance colon!!", "roberautrice": "Glad you're okay!", "alittleshortforastormtrooper": "Wishing you a speedy recovery! 💖", "rikkeeinarsen": "You are an inspiration! I pray for your quick recovery, Hannah ❤️ Lots of love coming your way 😘", "melsamouse": "Hope you fee better soon :)", "sharonmoura_": "glad to hear you are doing better! sending you positive vibes and well wishes hannah 🧡💐", "brogantatexo": "Get well soon Hannah xxx", "backstageblues": "You are one strong human!", "lottiec8": "Get well soon! Sending you love 😘", "paulamanuelvieira": "Hoping you will recover quickly from your surgery 😀💙💛", "chloeedelane": "❤️❤️❤️", "leannwoo": "❤❤❤❤", "revoche86": "Colostomies are cool!", "maryagnesconstance": "My dad has lived with a stoma for the last decade. Makes pat downs at the airport interesting 💩💩💩 Hope your recovery goes well xxx", "spanglepics": "Glad you are on the mend, I had my op in 2005 and never looked back. You finally get control back of your life.", "masha_babe19": "Oh my love. Get well soon", "laurarevnic": "Sending all the love ❤️❤️", "sarah.troke": "Hannah, thank you for being so open and honest about this. I’m sorry you’ve had such a rough time recently but I hope that this helps and you recover quickly so you can get out of that hospital! Sending all my love 😘❤️", "katarina_t": "Hoping for a strong recovery!", "marislawa": "I wish you the best and hope you get better soon. You are strong ♡ you got this ♡", "zaydaliciousdesigns": "Hope you heal quickly! Looking forward to some very educational videos on this experience on your channel. 💛💛", "taylor_amg": "Only up from here my love!!! So constantly proud of you!!!", "kavyadespisesnorms": "TAKE CARE HANNAH! MISS YOU SO MUCH 💔", "lilyaliceharper": "❤️❤️❤️"}