{"sandra.ga_": "Thanks for sharing everything you’re going through. Always loved the videos you’re making but not only being open minded about topics that nobody’s talking about but also sharing something that must be incredibly hard (physically and mentally) is just incredible. Really looking up to you. Hope you’re getting better every day. Best of luck for everything that is coming up. I hope your body and brain can heal from what has happened to you over the last months. And try not to worry about stupid things that other people who don’t even now you and you’re story say. You’ve taught me to always love yourself! Keep being strong 💪🏽☺️", "isawitfirst\nVerified": "Verified", "daniellemccx": "Omg I love your bag where did you get it?", "annsophie_dp": "You go girl!!!!", "shankar_wng": "You're effing brilliant girl 😎👌 you've actually made lemonade out of the lemon thrown at you by life 💜 thanks for inspiring us with all the positivity Hannah 😇", "lacedcoffee.withpoison": "Youre so strong 💖", "wildwaldorf_": "يروح من الجسم بعدين مو @rafeef_alhayali", "camicrazi": "I really can't express how much I admire you posting about everything... I have never been that brave. Thank you. 💜 someday I'll wear crop tops!", "miriammutig": "Dear hannah so sorry you went through all of this and now have to again!! But loving the bra tho... if that helps? ... i hope you're gonna be fine! And it really is a nice bra", "centuryhousedw": "@hannahwitton - I don't know you but think you popped up here because @firstaidkitband follows you, and I them. I'm sorry you've had to suffer this. I have some 'issues' but not to this point so far, but it hurts to see you've had this instead of the blissful oblivion most get to enjoy. Thank you for sharing, and this Texas guy wishes you well.", "dario_prespljanin": "❤️", "johnathan_scott_g": "#poorHannah #Getwellsoon 💖💖💖", "copingwithcolitis": "💜💜💜💜💜💜💜💜💜", "isa__23": "Side note: where did you get your bra it’s v pretty and looks very comfortable", "kellie.tipton": "I would love to know more about dressing with an ileostomy bag.", "jaymonstar6": "@hannahwitton hope you recover and feel better soon. then come to America for our wedding lol ( you and me😘❤️)", "i_dont_do_ladylike": "I recently had a bone graft from my hip, and I had the glue. They said picking it off once it'd pick off was fine. However, if they told you that the glue ment it wouldn't scar as bad, DON'T BELIEVE THEM! I mean, like it might get better, but it also might not get that much better.", "tamararushton": "Hi hope ur doing ok how are u feeling u are so so brave sweetie how u coping", "mrcolitiscrohns": "@hannahwitton Hope you are well. When you get the opportunity please direct message me your email address, I have a proposal to offer you regarding your rehabilitation back to full strength. Hopefully hear from you soon.", "hazelnutmusings": "Hannah I just read your story on the Metro website and OMG I'm so in awe of you. I feel sorry for myself if I have a cold let alone what you're going through! You're such an inspiration! Well done 💕", "aadhi0623": "Hope Get well soon", "beckyemberton": "I'm still lost as to what happened ): can someone explain to me what happened?", "unatulig": "You are so brave for sharing, I really look up to you (don't know if that's how you say it in English 😅)", "tegangailor": "so prould x", "liquidlen8": "You being a writer and all, please forgive my spelling and grammer flaws.", "coffeestainedoptimism": "As someone with Crohn's this is always a possibility for me and honestly, an idea which used to really frighten me. Your positivity makes it all seem that bit less scary. Thank you for sharing your story xxx", "enya788": "You're amazing! As someone recently diagnosed with UC and still getting over the initial shock / what this might mean for the future, I've found your page to be so helpful and uplifting 💜 Thank you for your positivity 💜✌🏻", "richard_baker6": "Just watched your you tube video Hannah. You've been really brave. Hope your recovery continues. As a UC sufferer your positivity has cheered me up 😊. Take care x", "rachelmcpeake": "Thanks for sharing your progress! I've had severe UC for 10 years and have always opted for stronger and stronger meds, none of which have worked. Your story has really helped me to start considering that surgery could actually be a positive thing instead of living life being constantly sick! Wishing you a speedy recovery, take care x", "dardooodles": "I’m really jealous that you got to keep your belly button.", "afflerbachsabine": "❤Bestie😚", "yourunclesayshi": "Damn! Hope you're doing ok!!", "photocreep1311": "Happy to see that you’re making a good recovery. Will keep you in my thoughts and prayers as you go through this journey.", "rubyw4nts4p0ny": "I don't mean this in a vain way but is the size of your waist going to change? The shape as well, now that you're missing so much insides!", "g_zimmer_69": "💖💖🌈🌈💖💖 GORGEOUS 💖💖🌈🌈💖💖", "edgarsan64": "I know what is that, be strong Whit help oh God.", "aljphotographyy": "Hope you feel better soon remember you still strong and independent Hannah we all know and love xx", "lizzi_wa": "❤️ i’m a nurse, and i talk about your positivity all the time to my patients and friends!", "technicolour_magpie": "You really are amazing. I have a genetic disorder which has required a fair few ops including spine surgery which left a scar just above my bum. I never minded them but becoming single after 5.5yrs, I felt a little self conscious. You have made that disappear! Thank you x", "davidbartonmus": "Yep, guilty...I’m afraid I picked off the glue and scabs after I had my gallbladder out - in a curious way, I kind of felt ‘cleaner’!", "ameliaboswell": "Brave lady, you look amazing and strong 💪🏻 x", "mollyraeettaj": "I can only wish to be as brave as you ❤ you look so beautiful xx", "sam.outlaw17": "You are more beautiful than beautiful will ever be!!! I’m so proud of you and I hope you have a lovely recovery!! Feel better love!!!! ❤️", "melissa.bml": "Are you going to do a update video on how you are feeling right now? i hope you are ok 💛", "summeringue": "💓", "xallie": "You are gorgeous and such an absolute ray of sunshine. ❤ go you. ❤", "swervature": "Thank you for documenting all of this. It's one of the things I always wondered about but was too lazy to Bing, lol.", "claire_rare_bear": "Awesome! Show off your scars as much as possible. It's more fun. 😉", "0dusia": "Hi Hannah! You're beautiful inside and out. Don't believe whoever tells you anything different. Even if i don't personally know you, i'm so happy you're good now and feeling better! Kisses from Italy", "sofiasolb": "♥️♥️♥️", "delusional._": "You have such an amazing body ❤️ keep fighting girl you got this 💕", "do.not.look_at.my.bio": "DON’T READ MY USERNAME ❌❌❌❌🚫🚫🚫🚫🛑🛑🛑❌❌🚫🚫🚫🚫🚫❌❌❌🛑🛑🛑🛑🛑❌🚫🚫🚫🚫🚫🚫🚫🚫❌❌❌❌❌❌❌❌❌❌🚫🚫🚫🚫🚫🚫🚫🚫", "misslexxashand": "I love the bra! Where is it from?", "brihannonstrathern": "Glad it's healing!! Xxx", "authenticallyrebecca": "Such an inspiration! Adore your bravery and honesty to not shy away from something that most people would only whisper about! ❤ Hope you have a quick recovery xoxo", "susan.paulsen": "You are so strong and beautiful 💪", "morgan__erskine": "#stomapositivity", "fechernivi": "Your bra is cute af😄 I love you so much, thank you for posting a picture of your scar. It makes me feel better about mine💛", "james02deane": "This photo is inspiring 🙌🏻💪🏻💙", "rhian.em.may.deans": "@hannahwitton I picked mine off to! An my nurse did also when cleaning and changing my dressings. Don’t pick to much though 🙈. The world needs more women like you! Xxx", "thatsnotmynqme": "❤❤❤", "ingardiumleviosa": "you freakin badass. thank you for sharing your journey with us. you are doing amazing.", "elle.barto": "That is a seriously badass scar! I think it's wonderful that you're so openly sharing all of this stuff. you're doing a wonderful job of normalising", "kittysoos": "What a lovey body girl! Beaut", "chadnapper": "Really proud of you Hanna. You're hella brave and there's a bunch of us backing you.", "thejseven": "That is strong af!!!", "meganleanne_f": "If someone asks you about it you should give them a serious look and just say “You should see the other guy” and then walk away. Mysterious, sexy, and dangerous! 😎 In all seriousness, you’re an incredibly strong person and this is just living proof. Go on, Hannah! ❤️", "christo_4u": "Ur always in my prays. Get well soon and I pray for ur health ❤️❤️", "mangomarmalades": "Stay strong ❤️❤️", "yaman_annabelle": "Beautiful. Stay strong. 💕", "chrcoluk": "hope it heals more and you stay healthy for the future hannah", "thousandmilesgirl": "I adore and admire you Hannah! Beauty is a concept that is defined by everyone's personal story and you're so beautiful for being free from ulcerative colitis. I am excited to see you grow with your new experiences and with the health that is yet to come ♡", "limportante.fr\nVerified": "Verified", "sarahahahahahidontcare": "hannah you’re such an amazing human being you are gorgeous", "matt.tahir_": "It’s healing well. Stay strong. You got this. 💪🏼", "crustyjelllo": "BEAUTIFUL STRONG QUEEN 🐈❤️❤️❤️❤️", "peruvianjoe": "You need to look up Youth Rally. I think you could benefit from it to grow and learn about your new life style :)", "gretsola": "So glad you are recovering, stay strong Hannah 🏋 you are a rock!!", "anja_dre": "Isn’t it crazy what our bodies can recover from? I’m so glad you’re healing and doing better. I know I can’t imagine what you must be going through and how tough this whole thing is. But I really love that you’re putting your story out there. Keep it up and fuck the mean comments. You’re absolutely gorgeous! And also your body is fucking resilient. That’s something to be proud of and not disgusted by! You’re a badass lady!", "em_ormonde": "you're doing so well💕💕 such a strong lady 💪🏼💪🏼💪🏼", "spacexplorer_": "You’re still beautiful and you’re so strong ❤️", "laurensianmitchell": "Girl be proud of your body! You look GOOD! Your body has been through so much this past month, and you’ve done so well to overcome everything and be positive! ❤️❤️", "flipsteo": "As scars go, I think your scar looks super dope 😎", "sheeny90": "your a wizzard @hannahwitton ⚡", "ajatuskartta": "the way you talk about this process is so empowering!! you're so strong and beautiful 💜", "katefirthod": "thats cool as fuck u look badass", "rebeccabeckery": "It's beautiful!! I only have a small scar from stitches I had before, but this is impressive and it was so well done! I hope it heals fully soon! And pls don't pick at it 😂", "kaihlyndmontgomery": "Keep wearing your scar with pride! When you get around to rocking the crop tops and bikinis remember lots if sunscreen! Burned scars are no fun (I've learned from experience) haha... You are awesome & beautiful! 💪💪💪", "poppy839": "💛💛💪🏼 you got this!!", "tryphena93": "You’re on your way to recovery xx", "catwyns": "I never commented any of yor pictures but so glad to see you healing! You're such a brave woman, hope you'll love your new beautiful body and the way a scar may tell a story ♡", "kathyhope_": "❤️❤️❤️", "restlesschildcz": "I think scars are cool. They're like storybooks. This scar makes you so unique - it has a story that only you have. All of your feelings, a time capsule, that's in it. It can be a reminder that life is really cool and worth fighting for. It can be anything you want. And if people ask - you can also make stuff up (it was a bear/my pet unicorn did it/I was smuggling drugs...)💛💛💛 You are a gorgeous human being, a little scratch on the outside layer can't ever change that.", "abhi_demkeys": "Scars are fuckin awesome! And you're handling this like a fuckin boss! Good on you man!", "wildbirth": "You just added to your gorgeousness. You were a beautiful young woman before this happened and you are an even more beautiful woman now. Please never forget that xxx", "insta.nik": "Considering the seriousness of the surgery, i think you're already looking like you're already healing up nicely (your insides may be telling you a different story😂)! 😊 Keep posting pictures like this - the world needs to constantly be reminded that beauty is not restricted to catwalk models! 😊 Stay strong - you're doing an amazing job 😊", "n0tjesss_": "Your scar looks beautiful Hannah! Sending you so much love xxxxx", "doitall_thetime": "so so so proud of you xx", "kate_reis": "👑", "geoff_warner_clayton": "I had to get a stoma bag when I was seven, I had it for about a year or so. It wasn't easy to get used to. I think your courage is stunning Hannah, and your strength of character remarkable. Thank you for your self-sacrifice in helping to normalise these procedures, you're going to help so many! I wish you every strength and joy in your journey. 💜", "katherineloretta": "Beautiful strong warrior woman 💛💛💛", "ansley_the_meme": "Feel better xo 💋❤️", "katicanz": "You'll rock this! Just another unique part you :)", "zoegurl20": "You look beautiful and I am so grateful that YouTube, and the wider community of the internet has you to remind them that sad/bad things happen to people from all walks of life, but it’s how you choose to deal with it is the difference! It must be so hard to go on the internet and talk about it all", "definitely_not_scheming": "Heal well, Hannah! I still have my colon but I will be getting my 3rd ostomy (first ileo) this fall!", "valencamposn": "💟", "bea.a.taylor": "Your positivity is so empowering.", "xov.zaria": "Stay strong girl we love u", "iamem_": "❤️❤️❤️", "whoyourmaddy": "@hannahwitton still a beautiful strong woman. Sending love and positive healing vibes ❤️", "ericleslie80": "I remember the long process of getting used to my chest scar. It will feel strange and unfamiliar for a while, but it's part of you, and it's a good part. It's amazing that we can adapt and heal, and signs of that healing are meaningful and important.", "racerjosh": "Do you have to have the bag the rest of your life ??? Glade your doing well", "ruchi_saw": "Yaaay! Battle scars of a fighter! So great to know you're healing well Hannah ❤", "bazsimoe": "BADASS!!", "mclkeefe": "Have you heard of @kristenschronicles, Hannah! I think you’d like her! She’s the sweetest, and has a stoma as well!", "beechwood567": "Your a very strong woman your amazing", "sippingonmaletears": "This is amazing. Your body is amazing. It is fierce and unstoppable.", "jedi2257": "Your colostomy bag doesn't change you! You're still beautiful, bag, scars........", "ruxandramaria_x": "You are so beautiful and brave! Thank you for sharing your journey - wishing you all the best and I’m excited for updates! And to learn more about stomas!!! The body is freaking amazing! 💪🏻", "dduncombe": "Glad you're on the road to recovery. I would do exactly the same thing but I would be more of a wuss.", "briancarlosgreen": "That's so cool", "amummytoo\nVerified": "Verified", "archaeobails_": "So badass!", "maddelpop": "Your strength is beautiful, thank you for sharing it with us ❤️", "cc_grandy": "You inspire me. Thank you ❤", "laurensheridan__": "You're so incredibly brave❤️", "alandreaallyson": "Oh Hannah I’m so happy you’re recovering well. 💪🏾💪🏾💪🏾", "essie.ruth.makes": "You are a BAMF - what a thing to live through 💖⭐️", "dogz_n_frogs": "No sun the first year @hannahwitton. I can't imagine all the changes and adjustments to your life. Stay strong cutie pie.", "ajkolikes": "It's absolutely beautiful that you show us your gorgeous body, you go girl! <3", "celep11": "Keep holding on Hannah, you are strong, send you lots of love and support 💛", "rebeccastandke": "A strong beautiful body where within lives an even stronger and beautiful soul !", "crafty_elle": "You’re healing so well and fast @hannahwitton thinking away about you! I remember back to my first surgery feeling so delicate and scared, it’s incredible how you’re able to share these photos so soon. You’re so brave and beautiful. ❤️❤️❤️", "emmayhil": "Just read your instastory about some peoples’ comments. Hannah you are beautiful, your body has been though A LOT. And you look gorgeous, you really do. Beauty is in the eye of the beholder, and I for one think recovering/recovered stoma Hannah is a stunner. 💛", "alicehxff": "you're so gorgeous ❤ your positivity about your scars and the way you're proudly showing everyone your beautiful body after such a hard battle has honestly really helped me. I recently had a spinal fusion, and I'm not so embarrassed about my big scar anymore. I recovered! I got better! I should be proud of my souvenir! You've really inspired me and I feel so much better about my body, four weeks post op 😊❤ Thank you Hannah!!", "phoebelhanson": "Thank you for this, it’s so incredibly important and close to mine and my family’s hearts. It’s so sad that we live in a society that shames people for something that keeps them alive and well. Please don’t let ignorance stop you from improving others’ lives 🖤", "its_sara308": "Your such a strong beautiful woman ...I’ve got bravery scars from when I was younger and when I look at them I see how far I’ve come ..mine wasn’t as severe an operation as yours but you should be proud every time you see them ❤️❤️💕💕 the journey is never easy ..but you can do it (love how you always show a smile 😁) xxxo", "adibaker": "You're healing so fast! Way to go human body!!!!", "nicksgr8": "That is one badass scar. Nice one", "g00d_listener": "So strong and beautiful :)", "lalabelmont": "Wow! Glad you've healed so well! How does the bag stick on?? Does it not fall off?", "whatjessiesees_": "Way meaner then harry potters ⚡️", "caroline_marie_me": "I don't know what to say so -->. <3", "da.mar.a": "I love that bra! So cute! This is so beautiful!", "ranjivenkat": "It’s amazing what your body can do!! Glad to see you healing and getting better @hannahwitton", "sourceevents": "👸", "sofia.monteirosa": "I feel like scars are tattoos you don't choose to have, but are a part of your story. And your story is beautiful :)", "armandogodinez_jr": "✊ To good health again", "mayermily": "Have you heard of @crazycrohnie? I've followed her for a few years now and she was given an ileostomy bag at the beginning of last year quite suddenly just like you. I personally find her very inspiring and I'd absolutely recommend following her if you don't already. Hope you're feeling okay hannah 😊💙", "petra0258": "hannah u r beautiful and strong 💖💖", "majatrzop": "You’re the baddest badass Hanna! Very inspiring & Amazing! 🧡🧡🧡🙌❗️", "wheresmyostomy": "Looking incredible ! Keep up the good healing 😘 xx", "ambkathleen_": "You're so strong and so inspiring. Best wishes for the rest of your recovery beautiful lady 💗💗", "carlyraeaustin": "Ouchies, hope you are feeling better lovely xo xo", "nonsenselliot": "you're so incredibly strong, wishing you the best recovery and experience getting used to the changes in your body (i worded that very poorly)", "hexpositive": "Battle scars 💕💕", "dani_jaybird": "Awesome battle scars! Just shows how amazing and strong you are. Heal up quick babe 💕🤗", "duktigigelkott": "Hanny Potter⚡🐻🧡🧡🧡", "erica_bacon": "Glad you're healing well!!❤️", "mannerschnitte": "you are amazing", "soyunavieja": "you go gurl!! ✨💅🏽🤟🏽", "rachelkxte": "I had the same operation and i have a silly belly button too, it’s cute xx", "ariadna_cz": "Battle marks! 💪I hope you're having a great recovery 💖", "lumosprophecy": "You are as beautiful and strong as ever, anyone who leaves negative comments is a fuckface and you shouldn't give a rats ass bout it. Just sayin. Lots of love and positivity <3", "kevin.wg.02": "Don’t listen to the few haters !!! You still look great !!", "themuffinkhan": "Guuurl you got abs! That scar is like 6-pack foreva!", "imagine_miracles": "The scars show where you have been, how far you have come. They demonstrate how strong you ate!", "artamyis": "you look great! hope you'll get definitely better as soon as possible!!", "euius": "Scaaaabs 😛 it's too much of a temptation - resistance is futile 🌼🌻", "olivious3": "You look like a fraking badass!! But I guess that's no surprise because you are one", "amyyhampton": "What a babe you are! So strong, carry on healing boss lady 💪 💃🏻", "redhead.readings": "It looks pretty badass tbh - like battle scars that show how strong you are for making it through all of this 👊🏻 hope you're feeling better 💕💕", "raffaela.mp3": "You’re so amazing!!!! ♥️"}