{"jessbh30": "Happy Birthday! ❤️ 🎂", "_peterbrooks": "Happy birthday ❤️ 🎂", "phoebehubbard_x": "HAPPH BIRTHDAY HANNAH!!💛🧡", "popynes": "Happy birthday Hannah ! You know you were born the same day as Millie Bobby Brown ? How awesome ! So glad to have been born the same day as two such inspirational people !!! I Hope you have the best day!", "mxryelizabethporter": "HAPPY HAPPY BIRTHDAY!!!!!! I love youuuuu", "mariannajenkins": "Happy birthday!! X", "sophiazimt": "Happy birthday, Hannah!!! ❤️", "sianadventures": "Just wanted to stop by to wish you a very happy birthday! I hope that for this new year of your life you'll keep learning new things, get inspired, go toward your dreams, be surrounded with amazing people who bring you hit and make you laugh 🎂 💐", "w3bbd": "Happy birthday @hannahwitton", "thewxckedwxtch": "Happy birthday love. Greetings from Spain!!!", "ro_goes_rawr": "HAPPY BIRTHDAY TO MY AMAZING GORGEOUS GIRL (you are an idol to me)", "jenlauraantonia": "Happy birthday! 🎉", "anna.behrens": "Happy birthday Hannah! You’ve always inspired me so much and I hope you have the happiest and healthiest year.", "foxesandkittens2037": "Happy birthday 😊", "stellafisherr": "Happy birthday!!!", "nakattack_27": "I don't know why but you reminded me of Mary Poppings.", "lyannaxxh": "cutie", "truancy_ham": "Enjoy the walking stick while you can. It’ll be gone before ya know it!", "carb23": "I have been walking with a stick for nearly 2 years as I have chronic illnesses that will get worse with time. Mine has unicorns on it and a badge. It's nice to see that young stick users are being proud! Nice to see I am not the only young person using one.", "leisurevirus": "Get well soon! 🎉", "tamsinhogan": "I want me one now lol", "liljpow": "@soopah_g sticks are glam poppet! Get rocking yours gorgeous girl Jx", "ajaykumar.elet.10": "Beautiful", "gabischiller": "🙏🙏🙏", "kate.griffiths_": "happy birthday!!! ❤️", "eviejobrown": "Happy birthday!!!", "mrs.kelseyf": "Happpyy birthday Hannah!🎉🎈 I've only recently become a subscriber (october).I admire so much your fearlessness and how much of a generally well balanced person you are. All the best for this new year of life.", "_valentina_b._": "You are literally one of the sweetest, kindest but also strongest people out here. Your videos always make me happy, you're proof that there are still good people on social media. Happy birthday Hannah, I hope you keep getting better ❤❤❤", "lira_marie": "Happy happy birthday😊🌼", "g00d_listener": "HAPPY BIRTHDAY HANNAH! Thank you for inspiring me to be authentic to myself and proud of who I am. You're so fearless and brave,you always make me happy and I admire you,thanks for spreading the positive vibes. You're so strong and I'm amazed at how positive you've been these past few months when life has been very tough. Thank you for all the amazing advice that school doesn't teach us and also some things i might not of known if i didn't watch your channel. You're such a role model to a young person like me,love you lots hope you're having a wonderful day ❤", "robynelizabeth2802": "Happy 26th birthday Hannah! X", "softhands77": "You are looking wonderful!!!! The walking stick is a great idea!!! Carry on love!!! ❤️❤️❤️", "giiuliadiaz": "Happy birthday ❤💪😍😚🎉", "n._.spiteri": "you look great in that outfit!", "jordan.fayers": "Happy birthday 🎁 🎊💛💛💛💛", "alexzarelli": "Happy Birthday!!! ✨💗", "liki244": "Happy birthday!! ❤", "sarahcurran.13": "Happy birthday Hannah!!", "princeasiafan": "Happy birthday gorgeous ❤️✨", "claraisabelcomini": "HAPPY BIRTHDAY HANNAH 💞✨", "louisedrory": "Happy birthday Hannah!!", "hayleyarizona": "Hannah you're looking better and better with every post! Hopefully your recovery is super speedy and you're back kicking ass and taking names in no time! ❤️", "vegalien_": "You look SO amazing. Your positivity is so contagious, too! 🤩", "gl563": "Go girl! 💚💚💚", "e.mileekate": "Happy Birthday, gorgeous!!! 💓", "scarlettpoppy95": "Happy birthday! ❤", "b_vangaalen": "Happy birthday", "l.m.h": "HBD 🎈🎂🎈", "karina__wa": "happy birthday!!", "tc_ccw": "Happy Birthday🎂Wishing you a healthy and great 26", "spider.kate": "happy birthday hannah! 💕🎉", "mariairlyani": "Happy Birthday!!!!", "ellenjohl": "I once had to walk with a cane because of illness and I’m turning 27 tomorrow and just wanted to say, you’re rocking it! and 26 is the BEST age!! Happy Birthday! 🎉🎈🎁", "lisamurnanepan": "Happy birthday!!!!!!! ¡!!!!", "agnesjones.s": "Happy Birthdayyy!!!!!!!", "the_unicorn_with_a_camera": "Happy birthday 😘", "jackel_snake": "Happy birthday hannah", "crevettexxl": "Happy birthday to youuu! 😘😘 We're born on the same dayyy hehe, I hope you'll recover soon ❤️ You're so strong", "marianafm23": "Happy birthday!!", "renyxputman": "You make it look so stylish, I could never pull that off😂 you go girl!", "hollyspiers": "it’s my bday tomorrow too!!!", "kerstin_mb_": "happy birthday hannah🐳💛", "passionatesatsuma": "My aesthetic is fashionable and functional mobility aides 👍", "floatingmilk3": "Happy birthday!! 🎉♥️", "anamavre": "Happy birthday!!! 🎈🎉🎁", "sophiekatie_": "happy birthday!!!!! 🎊💛", "hermit97": "Love the aesthetic you are rocking. Pumpkins are my fav.", "ashanotasia": "HAPPY BIRTHDAY GIRLIE", "jesslmm91": "I tried to draw you but it won’t let me tag you because I’m a new account. I think you’re so inspiring and I’m glad you’re doing well!!!", "highschooltyler": "Happy birthday!!!!!!!🎉🎉", "melhandford": "Happy Birthday!", "thepiquantfox": "You look fantastic! Stylish, spunky and like yourself! The cane is a great idea xo", "haru13enchanted": "you’re so strong!!! You go girlllllll", "crafty_elle": "Haha you legend @hannahwitton you look beautiful! Recovering like a champppp! ❤️", "meganfrxnces": "Yesss you are an inspiration 🙌🏻🌟", "carolinebramwell": "Love the look and wishing you a speedy recovery. Once you're healed up you will be able to throw away the stick and do so much. I was a couch potato before my ileostomy surgery but now I compete in Ironman triathlons. No need for a seat on the train for me, I mix it up with the professionals in races. Having an ileostomy will show you what you CAN do, not what you Can't. I'm always happy to chat.", "oliviaa.pj": "This is the cutest", "jaymonstar6": "Waking happy", "miss_emma_laverton": "You're looking amazing! Nice to see someone young showing that walking sticks and other aids are nothing to be ashamed of at our age. My mum had arthritis and a hip replacement at the age at 25 and she was always too afraid of being judged for using a stick until she was past 50. Only now, at 57 has she started using one and regrets not doing it years ago 💗💗💗", "abxbee": "nice to see you out and about 🌻 Xx", "karinasarahk": "You should pull a Lucius Malfoy and have your wand hidden in your walking stick!", "jlcfan": "Mine is better. It’s blue with waves on 😉 xx", "carynton.h": "Stuntin' on these streets lol", "mgcakers": "@jltopham sex ed extraordinaire & my personal colon-spiration", "bagomabs": "Brilliant, I hope it works and people are aware. That skirt though 😍! You rock x", "justice_chords": "Cool, i had one after a knee surgery and it was very handy. Especially because people are more careful around you. But yours looks much better than mine 😂👍", "stuckwith_harry": "CLASSY", "mad_colorado": "lookin gr8 👍👍", "that_405_guy": "I feel like you may have that walking stick longer than you were letting on", "chronicallywitty": "As someone who has an invisible illness, before I had a service dog I hated when people just judged before knowing I was super sick. Glad you're finding a way to manage! It's all about the little things. Have you seen the ostomy bag covers some people have?", "dreadfullyinadequate": "You go girl!", "phreyah": "That walking stick is sooo fab!!!! 😍", "katka.soukupova": "Damn you're rocking this outfit AND the walking stick!! I knownfrom my own experience how ignorant people in public transport can be. Hope this will allow you more comfort while commuting 😊🤘", "cupcakesinthesky": "Yayy!! You look beautiful!! ❤❤❤", "gouachepot": "YOU GO GIRL!!", "adayinthelifeatnumber28": "Your so amazing", "daniellemccx": "You got this bishhhh p.s luv the skirt", "miacatnz": "You look amazing!", "cat_eyed_": "hannah, you are a queen", "koocnmutua": "And you can beat them with it if they don’t jk 😹", "mathoubaby": "Walking stick tip: the national gallery has literally the prettiest walking sticks I've ever seen in their shop, they're all flowery and colourful and beautiful and overall badass", "abbeylamb_": "Where is your stick from? I walk with two canes and can never find any pretty ones😍😫", "kevin.wg.02": "I didn’t know you needed who of these ?!?! How is it to walk with that ?", "zetasinorita": "Great! Now you can whack people who don’t give up their seats for you 😉", "beanniify": "That is so fucking cool", "kate_reis": "👑 👑 👑", "ohthataly": "LOOKIN STYLIN'! coordinating cane with outfit is always the Ideal Look! (glad you're feelin' independent and ready to roam with your walking stick too--welcome to the club!)", "livtupi": "You're like a way cooler version of mary poppins 😀🌼🌻🌺🌹", "cerrie_xx_": "You got balls girl !!!! I am reg blind and still don’t have the guts to use my stick x", "rachelellathomas": "You’re just a complete angel 💖", "mrshanetucker": "You look amazing Hannah!", "olovne.godine": "you look great! is the walking stick gonna be your pal permanently or is he just temporary?", "ecas_emma": "I have that same walking stick!!", "le.petit.ari": "Getting my cane has been such a game changer. Mine is in the pattern \"void...\"", "samilizzyquinn": "also, smart!", "robotpinemarten": "I have a hot pink one and pink crutches but it’s made such a big difference I wish I’d got one sooner", "daphnegrace_": "You are ADORABLE", "he_gentleman": "You kinda look cool.", "goodwinter19": "So beautiful!!!", "unfately": "You’ve got this !!!", "_bookish.love_": "I know what you mean, I've got a crutch to use when I'm not at work for an ankle injury, I've noticed a huge difference in how people treat you, so much patient! Xxx", "finoladonohue": "I love that outfit omg 💞💞💞", "bmrdx": "TFL have a badge for people with invisible illnesses, it says please offer me a seat, might help you :) mine works for me xx", "isa_bgm": "That outfits suits you sooo well! 😱", "kyladawn15": "I love your mindset around using a cane!! I work with seniors and there is such stigma around dependence on a walking aid that even the ppl most labeled as needing one are resistive to using them!! I’m going to share your perspective with them!! 👌🏻💕", "osanneart": "You look like a modern day witch. A good and kind witch.", "mylunarose": "You look awesome 👍🏽💕", "mansell.evans": "You go young lady. Hope you're getting better.💙👍", "akilahh\nVerified": "Verified", "jen.ohogan": "Kickass!", "shevstar27": "That outfit is cute AF! Walking stick sets it off quite nicely! X", "svetiksilverfox": "You look cool 🤘", "jessphotograph": "I struggled so much after having my kidney removed, nobody seems to care but it's because they can't tell", "immysrw": "What about getting one of the tfl “please offer me a seat” badges https://tfl.gov.uk/campaign/please-offer-me-a-seat", "faby_bl": "you look like a hip young hogwarts professor 😊 that's amazing", "ambo3924": "You rock it fabulously! So happy to see the progress in your recovery!", "ladieswholaunch_": "We would love to see you at our #ladieswhobrunch @hannahwitton", "hiccup42": "So fancy! You look glorious and happy!", "privatiye": "That outfit is amazing! Is the walking stick temporary or will you need it from now on?", "katia_vik": "You look gorgeus! A happy witch who is up to no good 🎃", "fabiennesings": "Looking fierce with the walking stick 🙌😘", "lornaizzet": "You'll be amazed how much it helps when you are out and about!", "ambervanheumen": "Classy x", "bc_bilge": "YOU’RE SO SO CUTE! Also have you read the six of crows duology??? That might make you feel even moreso badass right now", "immasquidling": "That's badass!", "tasya.shu": "You look like a wizard or showman! 🤗 I wish you the soonest recovery❤️", "r.patoou": "Fab!!!", "chloetebbsie": "It’ll also be good for any impromptu dance numbers 😎💃🏼", "freddybo48": "😍", "cassiehayle": "Yesss you look gorgeous!!!!!! 💓💓💓💓", "shelcea94": "And you of course look AMAZING. Hell yees", "bethanyjademillin": "You could also apply for a ‘please give me a seat’ card from transport for London cx", "marleengeens": "You look amazing! Have a Good recovery!!", "jonathanrhunt": "Helpful and looks cool too! I always think of Willy Wonka spinning it around, stopping the kids from entering, just to welcome them with his stick.", "inkyplum": "I’m usually on crutches because of a chronic illness and often find people can be quite rude on the tube - even when the illness presents itself as being more obvious! Constantly have to ask for the priority seat and am often refused. Sometimes people are shits 🤦‍♀️", "sarahehartsmith": "Your outfit is lush too!", "darianrobertson_": "Ij", "rosiiecampbell": "hopefully you'll also be able to master the anticipation that people feel when they hear your walking stick tap it's way down the hall👏", "maddie_birks": "Badass 👏lady 👏", "florastreeter": "You can apply for a ‘Please offer me a seat’ badge for the London Underground to show that you have a chronic/not necessarily visible issue. So that you don’t have to awkwardly ask or try and make it more obvious", "kdwinchester": "It’s beautiful!", "shadokyn": "Hannah got a pimp stick", "foragebotanicals": "Looking fly", "pieter_roefs": "That's one bitchin' walking stick! You look great! :)", "grace.wxlmsley": "You look so pretty!! Hope you’re feeling better 💛💛💛", "denaapple": "Great idea!!!", "shimmerandrotxo": "Yas girl! I have one as a just in case, it’s nice to have the support there. 🧡", "heather.lianne20": "One of the most surprising thing you’ll find is that elderly people are actually the rudest people to you when you have a disability or something to help you get around. It’s quite disheartening really", "kopfnik": "I love the cane. <3", "alexc010": "Have you signed up for one of those badges they give for the underground that says ‘offer me a seat please’ or something similar - it’s to help people with invisible illness ask for a seat without having to actually ask - might take some of the anxiety away", "eszterkate": "You look really badass! It's so awesome that there are options besides plain black to really make an accessory out of a walking stick. :D", "bazinga_hippie": "😍😍😍 this has made me feel less bad about having support myself, so thanks Hannah", "jnnrss": "This pin would be perfect for you https://www.etsy.com/listing/563712256/babe-enamel-pin-babe-with-a-mobility-aid", "irosarioc": "🧡🧡🧡🧡", "_laura.kay_": "Invisible illnesses suck so hard :( I had this trouble after I had brain surgery a couple of years ago, and I never had a stick or a pin to specify that I couldn’t stand up for very long without falling over. I hope your stick makes people less ignorant, love❤️", "bamblingsofnaffy": "Love this 🙌🏽🙌🏽", "_plummer": "This is fuckin wonderful to see, I'm so happy to see this kind of content expressed in a positive, happy and optimistic fashion... You're an inspiration, Hannah!!", "tasha.maria_": "The coordination with your outfit and your stick pleases me", "samflag": "Omg so cute Hannah!!", "instarsila": "💗💗💗!", "mikko.j.saarin": "Looks great! Can we get a close up of the stick?", "kujmous": "You are so charming, and I love that you're being careful with yourself", "rizzle_sanders": "You might have already considered it, but you could get one of the “Please offer me a seat” badges which TfL make? 😊", "jessingmeowt": "You are truly amazing, Hannah. I know this hasn't all been easy, not by a long shot, but you're taking your experience and using it to promote positivity and educate people. Thank you. You are someone I am constantly learning from and always proud to have on my feed. 💜", "vgangcharlie": "Hannah, your feed has got me through! I have same condition, and I’ve just been in hospital but managed to avoid the surgery. But honestly do nice to know I’m not alone! Xxxx thank you xxxxx keep going xxxxx", "edgarsan64": "You look very good, congratulations, because the operation not was easy", "count_bill_dennis": "Get out and enjoy yourself but please be careful Hanna.❤❤❤", "sarahl1303": "I’ve got a walking stick too and felt super self-conscious when I first had to use it. Thank you for being so honest with your recovery! Rocking at walking stick in the 20s is the new fashion #recoverylife 🙌", "_beckythorp": "Love the outfit!!! That skirt is beaut 😍", "caroline_._roberts": "Girl, you're rockin' that stick :) GET IT!!", "karan935": "❤️", "krisartsee": "You look so adorable. It complements you so well", "katharine_wiggell": "Your videos, posts and YOU have been so inspirational lately during what has been a really hard time for you! I am sure there are times you don’t feel it is true, but your mental and physical confidence is fabulous. The fact that you are taking a negative personal experience and turning into a positive one and using it as a chance to educate other people is so great. Wishing you a speedy recovery (and hope that you don’t encounter too many nob’eds on the tube) 🌷", "lauren.brock15": "You’re so adorable. Best of luck to you in your recovery process", "frozenflorals": "You look fabulous", "derj03": "Looks really good with you :)", "niamh_rose_clark": "Where did you get it from ?", "ducayink": "Go girl!! 💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼", "hannah.conway_": "#babewithamobilityaid", "rebeccastevensstitches": "Gorgeous outfit too! x", "kirstieemily": "👏😍", "wintersouldeer": "Cute!", "goldringi": "Don't forget that swordsticks are illegal.", "joarnx": "Omg where did you get that skirt it's soooo pretty!? Congrats on the stick too!", "umm_aiya24": "My daughter has a walking frame we got it all sprayed pink and glittery... she has a new one now we r going to bling it up. All the best on you recovery and for being such a positive person 😘", "gracelynscarp": "You just rock so hard. Congrats Hannah on being a rockstar.", "heyamyjane": "You look beaut and I love how your outfit coordinates with the walking stick! Here’s to your recovery Hannah 🎉🙏💕", "ken_courtice1": "🎭You are doing so remarkably well Hannah! We can do what we set our mind to do, “its more about what we got, than what we don’t got” 🎭 Keep that pretty chin up @hannahwitton Good to go Country girl in the Big City with the walking stick decor. 😂👍🏼🦋", "harryistired": "so proud of you Hannah❤️", "emmiejaynea": "You’re honestly so beautiful x", "des.alba": "Yay! My best wishes for your recovery!! So glad it's going well💛💛💛💛", "sophiabarinov": "You look so cool, and your outfit is beaut, and so are you. What an icon", "lisadobarro": "You look perfect !!! You are Mary Poppins 2.0 😏😂😍❤️👌🏼", "wtfscientists": "UGH hannah you’re a lil inspiration :) U also have the best name 🤷‍♀️🤷‍♀️", "letsovershare": "You can also get one of those badges from the underground that says please offer me a seat 💗", "__midy__": "Gorgeous ❤️", "immywebb": "Hi Hannah! In terms of getting a seat on the tube, if you want an extra “signaller” for people, you can order a (free) badge from TFL which says “please offer me a seat”. It’s like the one for pregnant people but for those with disabilities / chronic illness instead. I have an unseen disability & the badge helps me to feel more able to ask for a seat. Good luck ☺️", "emymarielucy": "You look great 😊", "annemieksken": "💛", "harleyanncarter": "Rock it queen. That cane has hufflepuff vibes honestly 💓💗💕💖💞💘", "sofiwhitey": "You look stunning, that outfit is gorgeous ❤ happy recovery!", "_lmgr": "I wish I pulled off my stick as well as you do! 🔥", "parisiansissi": "You are amazing Hannah 😊❤️", "chloeegrayy2000": "So proud of you! You're doing great so well in your recovery and you have all of us behind you. Onwards and upwards from here 😘", "jebeeeee_": "You look so gorgeous! @hannahwitton ❤", "ltyler_1": "You're so fab. Love your YouTube channel. Keep going lovely x", "jbduderz": "I used my crutches for this purpose and some guy literally barged through me - he did apologise after when he realised but it’s annoying how little people show consideration when out and about sometimes! Hope it works well for you! XX", "toothless.15": "And now you can bash children's skulls...", "jessbarnes1991": "I love your outfit, looking good! X", "mattbobross": "Where is it from?", "mu.cssrd": "Love you dear Hannah 🌺", "geekweatherby": "Hannah you look amazing!!💞"}