{"kylaasutherland": "How do you cope with all of the changes to your body both physically and mentally since your surgery? I just had my colon removed due to severe Ulcerative Colitis about 2 months ago. It’s encouraging to see someone (close to my age) else going through the same thing.", "hebe_ellena_may": "How do you cope with wanting to talk about the things you’re going through, and let people help you, but not wanting to be / feel like a burden? X x x", "meowgical_mew": "Have you had any awkward sex experiances since having your stoma? Is there anything you can't wear now because of", "hkswanda": "What is your favorite citrus fruit? 🍊", "vantran2684": "nice bra", "dev0n_r0dgers": "What questions have you been getting from students at your seminars?", "fisoglou": "Can you have anal sex with a stoma?", "zuru.toys\nVerified": "Verified", "optimus.27": "How many once have the boy masturbate .tell me please !!", "evieleanor": "@lisadaymond xx", "x.katieriley": "When should I go to the gynaecologist? I’m 13 and I feel like it’s important to go check what’s going on down there and also breasts...", "sasha.ryder": "What is the best thing about a stoma?", "ashley.elizabeth.fit": "Is the stoma for life now, sorry if this is too forward", "sarah_harper16": "@angela.mcdougall", "martbarragan": "Which kind of workshops would you imagine doing when you get old?", "harmony_mackenzie": "I need help to be confident in my body because I just can’t see myself as pretty or attractive", "pi_bye_2": "Damn hoy", "kishan_lg": "How to start a relationship and i have a crush with a one of my friend actually she is my close friend i need to ask from her i have a crush with you ( 7years Friendship ) her name is Nathasha can you tell me how to ask from her that ? @hannahwitton", "darlin_le": "How do you stay motivated when you want to do nothing? I need to do a bunch of stuff for school but I just want to sleep and rest for a while.", "rsabasjr": "How do you know a woman is satisfied after having sex?", "bke.wie": "It‘s nice to see how u deal with this disease so positivly. I found an article about u and your story which was published on facebook. So I would say welcome to the club of parties concerned. Well done with such positiv energy 😉Kind Regards from Germany🤗", "nga_group": "Top Beautiful And Gorgeous Pretty Cute Angel. 👆💓💘💓😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘", "daniel_mm_omran": "What is that paper?", "ostomyturkiye": "You are an example to us with the photographs we took with Stoma. thanks you My sister. 😙😙👏💪💪", "mjrniki": "i'm 17 now and i don't really get that whole dating thing like i've had crushes but it never lead to anything. everyone's in a relationship and i feel like i'm missing out and not really \"enjoying\" my youth and being a teenager, but i don't want a relationship just to have one you know? i've never had one before 😂 so do u have any advice maybe??", "geo_savsta": "What GCSEs and A Levels did you take? How was the workload?", "stormy.song": "Do you have any advice for partners with mismatched libidos?", "madeleine_porter365": "Hello :) This is about your stoma- I'm just curios as to where your rectum leads now that it's been detached from your bowel (I think that's correct?) and whether you're able to put anything up there safely (sorry if this is too personal 😅) x", "jordanlee2478": "What do you want to accomplish this year? Xxx @hannahwitton", "gallamoose": "How has your stoma effected your confidence sexually?", "comicgirl32": "How do you manage time with balancing family, a boyfriend, and crazy hours at work?", "anishapai": "do you think someone very poly be in a relationship with someone very monogamous?? Are they incompatible? Will they cheat if they agree to monogamy?? what's a good compromise? alt q: do you think there's a correlation between polyamory and how many partners someone has had?", "liquidlen8": "How do you stay feeling sexy either solo or with your partner while having your stoma on? Can you be \" bag \" free for any length of time?", "oddlygothic": "@seeko119 Screw you! Hannah's beautiful!", "catherinehickley6": "Do you think there is such thing as a feminist? Especially during post second wave where activists are less outspoken?", "nyjna": "do you ever miss being single? or some parts of being single?:)", "ameliasabey": "Got any tips on body positivity? I have Got big boobs and I am really short and I struggle to feel good when people are tall and skinny beside me. Thanks x", "lewis_2146": "Hey Hannah 👋🏻 Me and my penpal from the Netherlands have fallen for each other and we are arranging to meet up for the first time at the beginning of June. We have Skyped loads so we both know each other is real and half of that is smiling at each other and laughing about stupid things. I know soppy as heck haha. I just wanted to ask if you have any ideas of things we can do to be close despite the distance? Skype dates? I don’t know. Love your videos and hope I sent this off in time 😊", "_master._.disaster_": "What are your top tips for exams/ general life stress?", "whammyfox": "Please do your sound movie reviews !!!!!! Luv u", "garliq.bred": "How did you pick the subject for your channel when you started it?", "ambervanheumen": "HOW DO I STOP PROCRASTINATING?!!", "janelleghamilton": "Question: Waiting for 'the one', any advice? (22 yet to be in a relationship, and hoping now just to meet the right person)", "sarith0722": "What's your favourite toy??", "valeryolympia": "Hey, I contacted u a while a go on twitter for colonoscopy advice, and I wanted to let u know that it really helped and that I don’t have crohn’s! 🎉 so my question is actually pretty simple - what’s that thing on the back of your phone? :P I’ve been wondering for a while", "georgixox0": "Are you still planning on doing your masters ?and have you picked a uni to do it in ? Also any uni recommendations?", "eemmiibee": "What impact has the stoma had on your work as a self-employed creator?", "megangleggett": "What are your top tips to maintaining good mental health / staying positive? 🌻", "fechernivi": "Did you find it comforting to name your stoma? I have an insulin pump and i named mine topas, I just think it's interesting how naming the object that helps you is kind of popular thing. I really love your content btw. Thank you for making it!!", "hannah.mimiec": "How can I avoid my parents finding out that I'm on birth control?", "annikolie": "How to stay motivatated even when everything is falling apart? Xx", "jaanacranston": "do you think you would still be doing the same kind of work with your life if you were male?", "francesactually": "How did/do you deal with the frustration of not being able to do things after surgery? I have really struggled with not being able to a)exercise and b)run at full mental capacity after I had emergency surgery on an abscess a little while ago (just two months before A-Levels whoop whoop thanks bod)", "iamdenimlondon": "Hi Hannah, check out our awesome jeans at www.iamdenim.co.uk #jeans #ostomyjeans #bodyconfidence #surgery", "anabel_gm": "If you had all the money you needed, what would you like to do with your life? Would you still work?", "taif1ghter": "How to get over work colleagues bullying you? I am on a gap year and the adults who I work with full time are being horrible.", "andimarie2": "Are you happy with where your weight is now, or are you hoping to gain more to be closer to your pre-hospital stay body?", "rainbowcreepie": "Weird question here, but how does it work with a stoma and anal intercourse? Just a bit curious", "lennybee223": "You mentioned on Twitter that you were seeking therapy. How's that going? Has it made a difference in your post stoma surgery life?", "teaghan_spiers": "Your lost a bit of weight after surgery are you trying to get back to a healthy weight if so how??", "joseph.burnett.2001": "Hello, I was wondering where a gay guy can find useful information on sex, cause all I can find is porn which isn't ideal. Thanks", "e113van": "@hannahwitton give masturbation advice to men and how it holds in perspective to women. Should men feel that they can masturbation and not feel that they prefer themselves over women? I struggle with this also, is male masturbation still a thing without ejaculating?", "rachel_cox98": "Do you have any top tips for a history student at uni? Either related to the subject or just general uni advice. 🤔 💖", "skeletnn": "What advice do you have for someone wanting to become a sex educator? Any books/sources/courses you'd recommend?", "oli.kathleen": "Okay um.. blowjobs. How does that work? I feel like people don't talk about it as much as other stuff and I'm kinda scared of messing up haha xx", "dm_kiwi": "Do you have any advice on, how to not panic about the future and feeling it's not \"going the right way\" because of ones mental health stuff 💕", "rainbow_king1812": "Any tips or tricks to help with a balance between work, life and friends", "its_just_em_": "I need help coming out. My friends all know, I just can't find a way to tell my parents.", "oliver_wesson": "OK,May l have sex with u😂", "mrs.jillianmorrison": "What happens to your butthole when you get a stoma?", "steveratke": "What's your favorite stoma/poop joke now?", "thestephhumphries": "What advice do you have for someone going through a breakup that they cant geg over when there still in love with the other person but they dont love them back??? Would really appreciate it if you would answer! Love from Australia 💜💜💜💜💜💜", "haddymamilton": "Thoughts on age gap relationships? My current partner is 22 years older than me and it's been a long personal journey to reach personal peace with it", "swervature": "Q - Where did you find jeans with a left side 5th pocket?! 😉👍👖💚💚💚", "llilitse": "How to get over social anxiety with people u like", "maggie.tsee": "sorry i kinda barged in lol but if it helps im speaking from personal experience of doing the opposite.. anyway, couldnt help but say something. at the same time, try to take the word of internet commenters with a grain of salt and do what you feel is right", "wrenniehiggins": "How do I stay awake in exams, I’m always tired. No matter how much sleep I get!", "toadlord": "Is your stoma permanent?", "aine_brownie": "Do you think it's better to have your first time with someone you're in a relationship with or with a casual thing?", "anitachaplin675": "Hey Hannah! I tend to buy way too much stationary for my own good, I love organisation and pretty things way too much. What is your favourite/most useful piece of stationary and how do you store the stuff you don't use often?", "alex_chisholm": "What do you think about sex therapy? Would it's principles be something you would encourage being taught in Sex ed classes?", "gab.venditti": "do you have to wear the bag 24/7, forever?", "coffeeboy_2000": "How do I practice being motivated to help myself be motivated naturally in the future?", "sashafriese": "Now that you have a stoma and you don’t technically have colitis anymore, can you donate blood?", "schwinned": "Advice for a 26 year old college student dealing with school burnout with a little over a year left of school? 😅", "jeffers222": "What are the odds of you seeing my question?", "theotherbrief": "How’s your mental health today?", "caitlinmckenzier": "Is your stoma easily infected? I know there is a bag on it, but does it ever come into contact with your jeans or pants?", "zoetheram": "Can you get funky stoma bags with cool patterns and colours?", "phxebe_rose": "What are the steps you take to get back out there after finally moving on / getting over a past relationship?", "emilyseebold": "Would you be open to making a video on vaginismus? I presume you don't personally suffer from it (correct me if I'm wrong!) but I think your channel is a brilliant platform from which to educate people about it given your love of sex/sexual health education xx", "dont_omg": "How was your experience with natural cycles? Considering coming off the pill for an array of reasons and I wanna give my body some time off. Would you recommend?", "bokibizarre": "What's the amazing thing you talked about on twitter? And are you gonna go for it?", "immy.r": "How hard is it to fit the bag under clothes?", "ma_frofro": "If you could go back in time, would you wish not to have your stoma? or is that now a whole part of you and an life experience that just make the new you and you wouldn’t change it for anything? Do you sometimes find yourself changing opinion about this? Love your talks, your spirit and openness ! (and your cute british accent)", "tregurtha_abbie": "How to you cope wth on going health issues particularly before diagnosis and to not be scared 24/7?", "florencebbruneau": "Are you going to bring back drunk advice with you sober? How has your mental health been with post op struggles and your stoma. How have your friends and family taken this new yet same Hannah. Has your surgery changed your orientation of your life/career goals in any way?", "nicoleackman16": "Any advice for someone who is 23 and very inexperienced sexually and a bit worried about how to explain that to future partners?", "azx3r": "Hey hope you’re doing well Hannah. Do you have any tips for getting over a breakup? Also do you have any book recommendations for people who don’t read often and want to start light?", "sonnydriveby": "Hey! If I want to lose a condom with someone - is an STI Test enough or do both also need to do an HIV test..? Not quite sure what is included in the STI Test and very confused... (also I just want to tell you how thankful i am that you are making videos - i really wouldn’t know where to get my book recommendations or sex Ed if it weren’t for you x)", "05meervs": "This may be too tmi/personal, but have always wondered if people with a stoma can still have anal sex, or if the space left down there is too small or has no feeling? Sorry for the awkward question!", "chantelmarieg": "As a feminist, how do you enjoy music/songs that degrade women?", "erin.coin": "Are they any books you recommend young(er) girls/or guys read that can help teach them about sexuality, sexual health, relationships, body confidence, feminism etc?", "mollypolly14": "How do you know if the relationship you’re in is right? How do you know if you’re actually in love?", "lordelikesteeth": "Advice for teens struggling to come to terms with their sexuality?", "iang_12": "Do you still feel like u have to poop", "_sydeandnight": "Hey Hannah (and Mona) I need help. I’m currently a teacher in the US and I’m dead tired. I’m 24 and already burnt out. Any advice for finding a new job? I just want time to figure myself out. I can barely feed myself most days.", "le_foz": "What advice would you give to someone lacking self-esteem and confidence? I turn 30 this year and struggling with all the self-hate from my 20s. Thanks in advance.", "maddi_jones_": "Please talk about how your mental health was affected from the surgery! Depression, anxiety etc.... I’m assuming it would take a big toll on your mind but you have handled it so well! Xx", "mrsynara": "hi !! so uhm I'm dating my brother's friend's little brother without realizing it and i tried to talk to my brother about it but he just turned away and told me that he didn't want to talk about it. I've seen him smile at me and at my boyfriend ? Our brothers tease each other about it. I mean like, my.brother and I aren't close but.i thought this would mend a bridge. what do I do and why doesn't he want to do so?", "sarahswift91": "Are you going to gain the weight back and eventually fill out these jeans?", "bretteelana": "You made a comment that your fertility is not affected with your current stoma but would be if you would choose to have the reattachment surgery. Can you explain how it would affect you should you choose to have the second surgery and what the pros and cons of it would be", "xabigail_v1x": "FINDING LOVE TIPS PLS HELP", "_lucy_e_": "Do/did you ever struggle to accept your “adult female” body. I’m in my earlier 20s and despite going through puberty and changes to my body shape quite young, I feel like I’ve only recently just started to accept my body as that of an adult woman. I also lost quite a bit of weight over quite a short period of time and I think I’m still struggling to accept my body as smaller; I struggle to choose appropriate clothing sizes as I still see myself the way I was. Any tips? X", "username92847218": "Whats that white disk? Im not caught up on witton Lore", "anabundanceofem": "Graduating from Uni this week! What do you think the best thing is to do for a new graduate?", "esther_bli": "How do you deal with people that complement or comment on your loss of weight even though it's because you were sick?", "ayeshy_wyeshy": "Is it important to have experience sexually before looking for a relationship? I'm 18 and am at uni and everyone around me is doing both and I'm not sure how things like relationships work in the real world", "anna.behrens": "Advice for you 16 year old self and advice for teenagers now?", "elysha.tracey_": "@hannahwitton how do you boost self confidence and love? Atm I am very low about my appearance and it’s affecting all parts of my life thanks! 💜", "trystanjobin": "What do you do to get out of a “slump”? Whether is writing, reading, your career, how do you stay passionate?", "heroemily": "What was it like trying to find somewhere new to live in London? How has moving in with Dan affected your relationship? :)", "hurricaneheels": "How does one learn to distinguish when one just likes sex for the emotional validation?", "georgiourebecca": "I'm studying History in Germany on my first Semester and I feel overwhelmed, I feel like I don't have time to do the necessary studying. Any Uni tips?😊", "e.llhunt": "Do you have any advice on dealing with having to see my ex all the time? We still go to school together and have lots of mutual friends, and i don't want to show that I'm pissed off. Also i love you very much💛", "tasmetu": "What is your dream at the moment? And are you working on making it a reality?", "aimilynne_23": "Hey Hannah, I love your channel. You said you have no abdominal strength anymore since the surgery. In past you said you love sport. When you are recovered (it's a long journey I know) do you think you'll go back to working out? Good luck on recovery!!", "jopineapplesuk": "So, how does anal sex work if that area isnt connected to anything?", "nicolelilly98": "How would you recommend adding sex toys into the bedroom?", "beautifulnrocky": "How do you become self employed/make the leap to creating something that's independently driven by yourself?", "_saf5_": "What positives are there about the stoma life?💜", "kay.tay.lor": "do you have any advice on how to approach talking about sex/relationships with parents l?", "charlotte_iona": "What are you most looking forward to about moving into your new house with Dan? And is there anything you're nervous about?", "alltimechelsea": "Can you get pregnant while having a stoma?", "samanthakuban": "How do you personally take a creative idea and put it into something material? Ily 💖", "robbie_musiclover": "What’s your advice for choosing a career?", "hannahewengerd": "Have you ever had to deal with “back-handed complements?” I’ve just started feeling more confident in myself; however, I often have other female coworkers who try to bring me down. I logically understand that they are simply projecting their insecurities onto me, but hearing it day after day takes a toll. Do you have advice for someone who works around negative people? Or to females who are torn down by other females? (Your blog and videos really are inspiring, keep up the good work! Love from one Hannah to another :)", "neal.murray": "How much has your breast size changed from leaving the hospital to currently?", "brookerobynstone": "Are you still doing your masters?", "kim__bla": "Wow, so many questions🙈 I really like your account and you are a very inspiring person!! Where do you get your stoma- products and do you change sometimes the Producer to try something new?", "alicediebel": "I’ve been planning to start writing a dystopian fiction novel for ages, but don’t want to start because I’m a perfectionist. How did you start writing your book(s) (I know non-fiction is a bit different) 📚📖and how do you fit writing around a full time job? Xx", "anna.kosinski": "I'm heartbroken by my self for liking someone who I know will never like me back. It's been like 9 months and I'm still not over then in fact recently I've been feeling more heartbroken. What do?", "rhythmandjas": "Has the operation you had or the fact that you have a stoma has an impact on the IUD you have?", "karoline_noer": "I have diabetes type 1 myself, and just like you, I carry around a device 24/7 in order to survive - That is my insulin-pump. How do you cope with the fact that you got 'a device' attached to you all the time?", "bububnfhddnd": "Do you think you’ll ever take your career in a different direction? If so what would you do instead?", "heatherscreativeplace": "I’m heading to uni after summer, do you have any tips for looking after your mental health when moving out for the first time?", "pantsorama": "Hey! Any career/school advice on choosing between your passions? I keep changing majors and changing plans because I can't decide what to invest in. It's difficult to find ways for everything to mix and balance is hard lol", "ellisr0se": "Do you ever become disillusioned with feminism and/or think there are problems with certain people who aren't doing enough actively to fight for the cause?", "millywebster": "How are you doing in your relationship? Moving in together and all must be so exciting!", "altguy23": "Do you think that your success is social media driven, or self driven?", "kaboome_": "I'm just about to finish my last year in University. My plan was to be a teacher but now I'm having doubts. I have lost a lot of my passion and drive to study and am worried that it will happen in the future when I start teaching. I'm worried about becoming that bad teacher that ruins kids and doesn't really help them. I guess my question is whether or not I should get my diploma next year, or find another job. Is the stigma of getting a job that isn't part of your degree real or is it just something to get over?", "airapirate": "How do you stay so happy and positive and energy sparking with everything that comes your way? And how do you manage to give yourself some rest without feeling guilty about it? You truly inspire me, thank you ❤", "duhmaid": "How is your IUD going? I've just got to my 7th month on the Jaydess hormonal and my period is really irregular (started, then started again 2 weeks later) this month, I don't know whether to go to the doctor about it or not.", "rachelblynch": "Have you received any glares/negative comments for using disabled public bathrooms as your stoma isn’t particularly visible to an onlooker?", "poppywickenden": "how do you motivate yourself to revise and get down to a full day of uni work when you’re going through a bit of a sad patch", "nicolaxo_": "How can I keep up with school work when I’m mentally unwell and stay off school because of it? I have exams coming up and I need help", "mariiamagnolia": "You once briefly mentioned that the stoma you have now does not affect you having children in the future, but that the \"reverse\"-surgery would.. can you say more about that? And how that makes you feel about it? I hope that's not too personal! I am absolutely amazed and proud about how you deal with everything and take the chance to educate people. You truly are a role model! 💕", "aesthetic_phandom101": "How can i do exams with bad anxiety and mental health", "hannah.eliseie": "What to do when your skin is so bad you can’t wear makeup but have school/work?", "naomicullinan": "How do you cope with chronic stress? Uni is really tough this semester, and Ive been pushed to my limit for the past 9 weeks and ive got 6 more to go till its all over. I haven’t got time for things like hours of socialising or massages or a bunch of self care like cooking my own food or meditation, im too busy! How did you cope through uni like this?", "coco.powda": "Was there a moment in your life when you started to live fully and at least trying to always stay positive, or it's more of a slow change kind of \"fake it till you make it\"? :)", "marionwhiting": "How do you personally measure your success?", "carinamargit": "Where/When can we read/see the interview you posted about yesterday? :)", "vero_fonsecac": "What is your advice for people who are finishing their teenage phase and starting the adult one? How can you cope with that big of a change? (For example staring university and finishing high school)", "noah.hella": "Career tips for when you leave university and don’t know what to do next? :)", "elena.dijkhuis": "How to deal with alevel stress going on to do medicine? Tips on how and when to take a breather?", "pizzacatsezrelax": "You’re one of my favorite youtubers I’ve been following you for a few years now your confidence and strength brings a smile to my face I enjoy watching your videos when I’m having my poo time in the morning no question for you but keep doing what you’re doing because it brings happiness to the rest of us", "afortnightaway": "What is your opinion on open relationship? Could you imagine having one? Would you think different about it if you only had one long term relationship so far? On what does it depend, in your opinion, that the construct open relationship work?", "ffinlo.w": "So are you going to upgrade to an iPhone X like @evanedinger recommended?", "lauras_life2014": "If you could travel anywhere right now where would you go and why??", "rcsblain": "Can you talk about hookup etiquette? Recently a guy invited me over, we hooked up, and then he asked me to leave at 1:00am. I said I didn’t feel comfortable driving home that late and he agreed to let me stay, since that’s what we agreed on beforehand, but I felt awkward about it! How should one deal with these situations?", "lucy._johnson": "I dont know if youve spoken about this before but when was your first time? How did you deal with the emotional side of things?", "mariapapitaa": "How do you deal with work rejection? (Over and over and over)", "smolivertwist": "I've been invited to a wedding but I will be going on my own. I'm a bit nervous to go because I won't know many people there or the area where the wedding is. I want to go though and see my friend get married. Any advice for going to a wedding solo?", "emily_halpin": "What is the best way to deal with Fuckboys? As a young girl I hate the idea if being taken advantage of and I'm sure others can relate :)", "43ketchup": "How can I get through my a levels to get the grades I need to study when I keep having severe IBS flare ups from stress and food and then more stress because of the flare ups?", "noorsk.i": "I wish i had a good question but i just can't think of one...", "remarkablyplain": "How do you know when you can be self-employed full time? Is there a threshold you cross when you know it’s safe to transition from part time self-employed to full time?", "hhfregg24601": "Any new developments on doing a Masters? Love your videos ❤️❤️❤️", "reyoggu": "When did you lost your virginity?", "caroline_._roberts": "Any advice on making friends as a young professional?", "_stressed.potato.recovers": "Are you gaining weight to get back to where your body naturally wants to be like before? And what is your fave book to film adaptation?", "zoe_ellenwalton": "Do you have any advice on leaving college and going out into the real world in a months time?! Cause it’s hella scary! X", "aga.letn": "How should I ask a man to \"prove\" to me that he hasn't got any STD when I want to have sex with him without a condom (because I use another method of contraception)?", "andrewwildmusic": "I have a friend whose boyfriend is a huge control freak and super jealous. Because I'm a guy he sometimes doesn't let her see me. What should I do?", "paul_brown____": "Hey Hannah how does mona effect your everyday life from sleeping to showering to just life x", "sollara_xox": "Can you do a video on the impacts of a stoma bag for someone with severe autism as my older brother has a stoma bag and is constantly fussing with it and worrying about it is it possible for you to be able to make a video to try and calm so of his worrys about having a stoma bag as I think it would help him if someone also has a stoma bag it's fine if you cannot do it?", "lisamariamp": "How do you feel about friends with benefits?", "jekkalove": "How does one get out of a dry spell when you still live at home with your parents. I’m going on 4 years and it’s starting to become annoyingly long.", "evanlamar70": "What’s your number one tip on your first time having... 😂", "clemence_lambert_": "Hey! I wanted to know more about your work, what you do (besides your youtube channel) and how you managed to do it. Love from Switzerland❤", "richardwinter_1": "Why is it that when it comes to sex if a man has had loads of sexual partners he’s classed as a stud where as a women as a whore or slut and why is this then reversed kinda when it comes to sex toys for example with women it’s all ok whereas with men it’s classed as weird and gross obviously these are stereotypes but you get the point and what do you think could be done to change people perception of these", "mollyrobinso": "Wondering after your closet clear out video if you are interested in minimalism or kon Mari attitiudes towards possessions?? x", "hazel_lucy13": "I'm so sorry to sound like a massive knob but posts about drastic weight loss (even if relating to an illness) are a bit triggering when there's several of them xxx", "elliebeeattie": "Any study/ exam advice you could give xx", "rejuristy": "Seeing as you’re moving house, what’s some advice you have for someone who’s thinking about moving out of their parents house. I feel mentally ready for the change but don’t know if I’m ready financially and just want to know how you knew it was time to make the leap", "sarahvgriffin": "How do you cope with worrying about things that you can’t change/are too late to change? I try to follow the ‘will I be worrying about this in six months time?’ rule but really struggling 😂 also a big ty for making me feel so confident and comfortable discussing/researching sexual health! Big love ❤️", "_peterbrooks": "This is a question I've been wondering for a while but can you still have Anal sex?", "jordangreenfieldd": "Any tips on ways to motivate yourself ???😇🤷🏻‍♀️", "kain3.14": "Hello Hannah, do you define yourself as disabled ? And do you plan to talk about sex and relationships, feeling attractive,... This kind of thing as a disabled woman ? (i should say that i don't use \"disabled\" as a slur, it is just that i'm disabled Myself, and more precisely i'm autistic)", "caleighrosebud": "Moving tips? We’re moving soon and not sure if we should do it ourselves or get a moving service like last time lol", "monica.saxton.music": "have you ever been in a long-distance relationship and how can i deal with it?", "alicevgoodwin": "Do you have any advice for someone going to study history at university?", "mxriee_priv": "Hi Hannah, What would be your advise for after graduating, I know people always feel so lost and it's worrying to me. What advise would you have to your 19-23 year old self?", "tylerseriously": "advice for gcse & a level students Stressing about exams, especially with a mental health condition??", "niamh_m_kelly": "What advice would you give to friends of people with ulcerative colitis to help support them? My housemate has UC and I want to be a supportive and helpful friend for her xx", "olly.olly.oxen.free": "How had it felt to have your life on blast through youtube?", "carolinelaline": "😘", "samvlad27": "How do you use HISTORY in your career now? Do you have any advice for fellow history students in uni about different ways they can use their degree?", "msmith0110": "What advice would you give to someone who would like to explore their sexuality but don’t have the chance to??", "sankewitzhanna": "What was the most annoying thing, situation coursed by Mona?", "hayleyarizona": "I was diagnosed with Crohn’s in December and while I’m so much healthier now (I’m on two immunosuppressants) my self confidence has taken such a huge knock. I’m so embarrassed by my body and the thoughts of being intimate make me so incredibly anxious! Do you have any advice on regaining your confidence after being so sick?", "syd_ruel": "Do you have any funny stories from being intimate with a stoma? Any times it got in the way or it started leaking and you were like hold up stay right there 😂", "hollywood_maddie": "Do you have any advice for coping with a long distance relationship during third year of uni, when there's less time available to see each other? Love all your videos, you inspire me so so much!! 💕💕", "serialoholiczka98": "How to manage too high expectations when It comes to relationships? I feel like popculture, tv shows, movies, books made finding a boyfriend impossible to me.", "jule_1231": "What do you think about heteronormativity? Any advice on avoiding it?", "blink182wasright23": "Have you ever had sex with someone with physical disability? If so, how did you accommodate?", "tierneyvt93": "Were you afraid people would laugh at you when you started YouTube?", "nxt_hxn": "How would you say having a stoma has effected your dating/sex life?", "sagaurora": "How does one stay bodypositive? What’s your thoughts on polyamory? How much time and though do you think one can spend on another person while being in a relationship with another person? When is it time to leave a relationship? How does one get over someone?", "itsoliviasparks": "Can you have anal sex with a stoma?? 🍆🍑", "mia.nxlson": "What advice would you give to people not only going through exams but who are also having a hard time with depression/ family/ eating disorder and have too much to deal with?", "gingerr.foxx": "Has losing so much weight messed with your head at all, and where do you want your weight to go from here? Ily 💖", "noms_l": "Tips for a stressed out high school student?", "theoriginalpixi": "How do you feel sexy with a chronic illness? And how do you deal with NOT feeling sexy because of it? Sometimes I just feel terrible and my body can't deal with my libido. I'll be too fatigued or have too much pain to act on any desire I might have. Have you ever dealt with similar issues?", "britt_8linco": "What’s your favourite reptile?", "emilybrigid": "How do you keep going with your uni degree when you have lost all motivation and dislike other aspects of uni life (e.g. housemates, living area, transport). I’ve just finished second year and I’m struggling so much but dropping out now seems silly!", "sunflow3rhappy": "This is a weird question, but can you still have anal? I’ve always questioned it but never wanted to ask cause it seems rather rude. I’m sorry if that is the case I am genuinely just super curious! 🙈", "ashleeyoungblood16": "I know you said at one point you thought that your coil had caused the flare up that landed you in hospital. Did you consider having that removed before you went through with surgery?", "georgienius": "What a levels did u do and what made you pick history at uni?", "k.seylaz": "What are some tips for a victim of sexual assault to enjoy sex again and not feel threatened? Thank you in advance!! Love you 💗💗", "thegamingpastry": "What's your favorite dessert?", "l_mowliney": "Update us on your masters plans?? I'm applying for masters for this year (I don't think ill get in this year but still) so really I'm just being nosy", "lady_stark_19_": "Hi Hannah! I'm 18, single and virgin. I've got a terrible crush on a guy who lives far from my place and we've met only once through a common friend and I don't know how to make him noticing me and how to get his attention cuz he's getting really famous, storming the newspapers with his film and awards.. So that's my sick state of love life.. Also I wanted to know that what precautions should I take for the first time during sex.. Bcoz I'm scared of bleeding.. It'll be a great help if you answer this.. 😇", "agaaathe_hb": "Did you had to adjust your clothes to the stoma? Like buying jeans with a lower waistline or something like that?", "josieaellmore": "Did a part of you not feel sexy and not 100% confident as you used too when you first got your stoma ? Xx", "matthewhanley05": "Can you still have anal sex ?", "rhiannondeveraux": "When you have days when you're feeling a bit low or unmotivated, how do you push through that and still get things done?", "cayleyb12": "One thing you wish you knew before starting YouTube / social media?", "levi.with.a.hat": "what do you do to combat negativity about your book and openness of sex, illness, mental heath, etc…?", "zohrafelicitasb": "How do you explain the idea of feminism (or: your idea of feminism) to people that might not be familiar with that subject yet?", "artax_luna": "I would ask how can I cope with society. I dont have aims or think I need to be anyone but still If I want to live I need a job and money. I have my career but I dont like it anymore and i have been the past 3 years trying to pass some stupid test to become a social servant. I am so tired of todays society. I just want to be alive!! I can feel how my best years are thrown away...Any advices for that?", "itstomrichards": "What is your favourite Harry Potter moment and why?", "bitsy.pout": "What A levels did you do?", "emma_walshe17": "I really struggle to cum cause I’m on antidepressants... I’m almost 20 and I still haven’t had a really full on orgasm... am I broken?? Do I just need to keep trying or do you think I just haven’t had one at all???", "rikyjanne": "What is the most interesting point of critique someone gave on Doing It? (Btw loved the book, it should be a part of everyones sex ed)", "smilesriver": "As a 14 year old gay feminist, I often get nasty comments from people who say feminists are angry, men hating lesbians. How can I reply without fitting their stereotype?", "annakonsor": "What was your favorite tv show or movie when you were a little kid? What is your favorite tv show or movie at this moment in your life? 🎥 🍿", "aliciapaige0905": "Do you have to change your clothing style so it doesn’t press on you stoma bag?", "lilobeetle": "How do you know when to stop using condoms with a partner? Obviously this is a mutual decision, but how would you go about it, would you ask them to get tested, and so forth? How do you know to trust them?", "lucinda_king": "Have you bought any new clothes since your wardrobe clear out?", "alec_wimmer": "Pre/post-stoma how did pain from your illness impact your relationship?", "chris_huff_photography": "(If you use this comment please dont show my name or picture) I have a crush on my boss and can't do anything about it because of workplace rules. However in a few months I have to quit, and then there are no rules against it. Advice on how to proceed would be appreciated 😂", "trish__ryan": "Are you still planning on doing your masters ?😊", "gingerroux": "What was your sixth form experience like and advice for uni?", "heim_kind": "Hey lovely, in germany it's not so easy to find a relationship with a stoma lots of women don't like a relationship (sex) with a man who had an ostomy. I know a lot of girl they a friends for me they say but no one will make a realship. I'm now since 5 years single and without relationship and sex. How did you do that, any tips? What think your sex partner about your stoma. Thanks you are great and so beautiful. Love from GER Xx", "luke._.razer": "This is a bit of a weird one but I'll ask. I have a friend that won't admit he likes someone, even though he does. (Seriously, he does). My question: Do you think 14ish is an okay age for your first relationship and what are the Pros, cons, dos and don'ts of your first relationship? Have a gud day, an thanks! :D", "brettball": "What was your favourite ‘era’ of YouTube?", "em.sars": "I am an American considering going to university in the U.K. In my research of differences between US and U.K. school, I have found that you generally jump straight into a major without the liberal arts and general education we have in US universities. Because of this, I have heard that my major plan would be very difficult because I wouldn’t have as much opportunity for breadth of study in the U.K. My question is, how possible would it be for me to major in History, minor in Gender Studies, and still complete the pre-requisites for Medical School at a U.K. uni? Thanks!", "_lmgr": "Do you see yourself as \"different\" because of your stoma?", "francamill2300": "How to get shit done and not procrastinate 😂💔", "olivianicolson": "How do I deal with being made to feel like I’m less respected for having sex with multiple people after a long term relationship has finished? Should I feel like this at all?", "bryan_rustenhoven": "I'm still interested about any notes you may have about Anal penetration with a stoma!", "sofiahole": "Are there any people with a stoma that inspire you?", "legionuktv": "I did tweet it but what do you think of the NHS recognising sex addiction as a full on aliment", "wcharlton16": "Do you think there is a stigma with period sex? Follow up question. Why do you think that its a taboo about period sex?", "lauraadaavies": "I know when my dad had the same operation he felt alot more comfortable going out because he could do more and not have to worry. How has having your stoma positively affected you?", "hhannahmary": "How do you cope with sex and mental health? It gives me such mood swings that one minute I want it and the next I don't. It's so frustrating as being intimate is such a huge part of a relationship.", "lib.lob.z": "What A levels did you do? Your degree sounds really interesting! 💖", "addielederman89": "Hi Hannah, I'm curious how you handled the transition from being single for years to being in a committed relationship. What sorts of changes did you actively choose to make vs. what seemed to come naturally?", "meko.4": "Hello beauty ♥️ quite a personal one, sorry if it’s indiscret.. can you have anal sex? Or is it not recommended? Thank you for your amazing videos and energy ♥️", "bellahooperrr": "Have you had any negative reactions about your stoma? And has it made your life any easier or worse? Love you so much x", "niko_ne_zna_": "any tips on adulthood?..", "alice_spencer_": "Hi Hannah, before I ask my question I would just like to let you know how amazing you are (which needs no more explanation)! I suffer from chronic pain and it is particularly bad down my right leg. After seeing you rock a walking stick I am considering getting one, but I cannot get over how I feel like a young person in an old person's body. It makes me so depressed and I just feel like no-one takes me seriously. Do you have any tips for using a walking stick with confidence?", "supertell": "Did you always intend your youtube channel to be about sex advice when you very first started it? If not how did it come to be this way?", "pintucris": "How did you manage to be paying a mortgage in London? I am thinking on investing in a flat in the near future (but in Barcelona).", "zoie_does_stuff": "How do you wear clothes with Stoma bag? Do pant waistlines go over it on the bag? And underwear? Also, sex? Also, showering?", "sophiewallace30": "Do you think that being in a serious/committed relationship has helped when adjusting to having a stoma? Do you think that if you’d had when you were single it would have affected your confidence in dating/having sex with new people?", "liv.mcc": "Do you find yourself looking at clothing differently now that you have a stoma? Rather than just fashion do you need to look at functionality as well? ((Ps wear what you want, you’ll still rock it)) 💕", "magicaltayswift": "Okay weird stoma-related question. Do you still pee like you did before the surgery? I just have been wondering for a long time 😄", "natashaboylan": "I've been having problems with my stomach, I've been getting really bad pains in my lower stomach to the point where I just need to stay in bed with a hot water bottle for the night. My doctor isnt sure what is causing it, but they are wanting to do some of the same tests that you had before your surgery! do you have any advice for me to prepare for them? 😯 also I love your videos 😄💖", "isabelljburridge": "Did you find that when you were on the pill, the pill made you gain weight, cause acne, anxiety, etc? I’ve started mine and frankly I’ve heard some bad rumours 😅", "nakesha_beith": "How does Dan feel about your stoma?", "xrachelanne": "Ik you're on the coil now but like I'm a couple weeks into cerazette and I'm having the time of my life! No spots, periods or mood swings for me! But I feel like this is unusual. Did you have a positive experience on it or is it like just me? 😂😂", "kaymacdaddy13": "I asked for help for my mental health. I’m all about not believing the negative stigma surrounding mental health, but why do I still feel some amount of shame now that I’ve asked?", "irosarioc": "I’m dealing with chronic illness right now & struggling to accept my body’s new limitations. How are you mentally coping with not being able to do things to the same capacity, and do you have any advice for slowly building strength/stamina?", "_jojosaurus": "I feel like me and my boyfriend have hit a rut somewhat. We'd planned to move in together a few months back and it still hasn't happened; I know moving in is a BIG thing, and I feel it's the next logical step in our relationship, but I feel since we went past the \"alotted time slot\" it's not as appealing. Any advice?", "theaudaciousapple": "Only got one question for you- how have you been?", "ionapixix": "QUESTION best advice for someone looking to leave “proper” work to do videos/blog? Also just to say I adore you and your content! Another also, thank you for being so open about educating people about stoma, because of you I feel I’ve been able to help the patients at my pharmacy better because I know what they’re speaking about now! Xx💜", "lucyhannahsmithxx": "I don't know that much about stomas. Was it easy to get used to having a stoma or was it strange making some of the changes", "hieser1973": "I love your spark.", "carmen_quint": "I am 23, finishing my master's degree soon and I still do not know what I want in life. All around me I see ambitious women who know what they want in life and I feel really insecure about it. Do you have any tips to find a purpose in life and deal with such insecurity?", "margot_wb": "Hi ! Are you going to pursue a master degree in the future ? I know that you have talked about it in a past youtube video , thank you ☺️", "rikkeeinarsen": "I live in Norway and I’m going to university in London in the fall, any advice? Ps. You are the awesomest person on youtube 🧡🧡", "katerubyy": "Does your stoma affect what you wear?", "freeman_zoe": "How do you tell your best friend of 15 years that you are falling in love with him? Do I just leave it? Is it worth it? What if the friendship is ruined?", "kyra_leibham": "How do you deal with loosing the butterflies in a long term relationship?", "kellyduncan12": "Before your surgery, did you know what a stoma was or know that you possibly might have to get one?", "valeriam.s": "Have you ever been unemployed? If so, how do you cope? I think there is a lot of young people dealing with this and nobody talks about it. Sending you love! 😘", "beanniify": "How do you feel confident in your height as an adult? I’m 21 and 5’3” on a good day and I constantly feel like a child if I don’t dress it up (I can’t wear the things I prefer because I feel they make me look young) ❤️", "curveysarah": "you are inspiring. luv u!", "shil_cock": "How to cope with stress when a levels are looming and life is sTReSsfUl", "lake.of.dreams": "You mentioned once in one of your older vids that you were thinking about maybe going back to Uni. Any news on that front? Just really curious, cause I recently decided to quit my full time job and pursuing a master degree instead.", "_lauraemily98_": "I had a serious operation on my hip 12/13 years back that has left me with a massive scar, and parts of my body look uneven. How do you learn to be confident in your body even with scars and uneven bits?", "ellie_martin": "Have you heard much about links between UC and Jewish heritage? (I have UC and another condition prevalent in the Jewish community so thinking of finding out about my ancestry)", "lucyandotherstuff": "How's your move going? Are you buying any fancy new home items for the new place, or eyeing any up?", "lollipop0978": "Are you able to sleep through the night or do you have to get up to empty your bag during the night? How often do you have to empty it?", "feliciabugge": "How does the stoma affect peeing, pregnancies and sex? I’m sorry if those are stupid question lol I know almost nothing about stomas 🙈", "lara_cerys": "How are you today Hannah? X", "annabarnardwright": "Advice on how to decide what you want to do after uni if your degree doesn’t lead to anything specific?", "juujkfhaulw": "Do you have tips for making friend when you have social anxiety? I have few friends and I keep trying to build new relationships but my worries of being too much and annoying the other person always get in the way. Do you have any ideas?", "_.nevermindd_": "Any advice you'd give to someone who wants to study (history) in the UK?? It's been my dream for a while but I'm also scared", "kerstin_mb_": "how are you ?🐢", "tatjanacelia": "You sometimes talk about an operation to reverse the stoma... Why would you or would you not do that? Are there health risks?", "hollie_roe_x": "Perhaps TMI but I’m curious, what happens if you apply pressure to your stoma bag, like if your partner laid on top of you during sex is there a chance it could pop?!😳🤔", "lowripolypudding": "What’s been the most unexpected way in which having a stoma has changed your life? (Day to day or just in general)", "justfemininethings1": "How has having a stoma bag affected your sex life? Is there any positions that you can’t/don’t feel comfortable doing? And has Mona made any awkward appearances during sexy times?", "_karolinax": "@hannahwitton how do you know when you're ready to be in a new relationship, how long do you wait after the break up?", "lazytyler91": "hot", "juanita_9730": "When is your next sex liberation party with @melaniiemurphy , @riyadhk and callum?", "katrihollo": "You are an organized and tidy person. I wish I was too. Do you ever get sentimental about stuff and how do you keep yourself from hoarding too much things? Do you have any tips on how to learn to get rid of stuff?", "e_moore_13": "How do you think Game Of Thrones is going to end?", "dulcinea.hw": "Advice for healthy relationships but also being independent and following your own path? Also any good life advice for your younger self or any good life tips in general? Thanks for all your wonderful videos and posts, they really lift up my spirits.", "beatrice_hooper": "What do I do if my period has come but it’s more like thick discharge & I haven’t had a period since November? Xx", "sabina.blades": "How do you arrange your organisation / schedule to accommodate days where you're not feeling brilliant?", "nadinelylex": "Can your stoma become infected? Also can you still have children with a stoma?", "pwrfoto": "Is it possible to do sexy-time butt stuff without a colon?", "hannahjasmines": "Can you still have anal sex with a stoma?", "axxcia": "What can I do if sex hurts? I’m a person with a vulva", "amberpankhurst": "Where do you find nice bras? As someone who also has bigger boobs, I struggle to find bras that fit but also look good! Love your videos by the way! Xx", "wearingyellowtoafuneral": "what’s your biggest achievement since your surgery?", "katarinaknight": "Do you still use a menstrual cup?", "aideenquirke": "Your body shape, weight, hair colour etc has changed a bit since surgery - do you want to go back to exactly how you looked before or do you want to maintain how you look now? X", "supersonicwomxn": "how do you not be an insanely awkward person while being in the dating/hook up scene?? i’m going to college in the fall and i’m so single.", "jayferg730": "My girlfriend doesn’t like showing her skin but wants to feel more sexy, what can she do?", "ninanxious": "How are you doing today? Also, any advice on reaching orgasm with a partner?", "m.artha.s": "How did you deal with GCSEs and UC at the same time?", "sophiekati.e": "If you could only write books, do YouTube or do radio, which one would you rather do and why? (I love your videos and how honest and candid you are about life 💗)", "celineweb": "What is the worst about getting a stoma? I am a nurse, And i would really like to know what it feels like for someone Who has actually gone through with getting a stoma 🖤", "cathlmorgan": "Why am I on Instagram when I should be researching for my end of module essay??? Help meh", "adventurous_pioneer": "Hi Hannah! Any advice on getting through the last month and a week of the school year? I’m struggling to find reasons to continue working and not letting my grades slip.", "jerome_meunier_": "How many books can you read in a year?😂😀", "valentine_mrl_": "Also would you recommend getting back together with an ex? Love u 💕", "lanafleming": "Where abouts do you get the bras you've been wearing in your recent photos? They're lovely x", "cat.stigwood": "Nearing year 11 how do my friends and I navigate the world of teenage sex and relationships?", "l.aurenbailey": "Best comfort foods!", "bettborg": "Do you have any tips for buying bikini tops for a bigger bust since swimsuit season is just around the corner?", "kitten_millie": "How do you add more frill back into a long thrm relationship? xx", "notanniemrrs": "what’s your favourite colour", "twospazzyspaniels": "How are you feeling about your new body? I know you weight has been mentioned in your videos quite a bit, you are beautiful at any size, but coming from someone who fluctuates a lot, I would like to know where your head is! -Kathleen", "abigailmoriahsmith": "How has this ordeal affected your relationship with Dan? Are there any chances he’s had to make, and how are y’all working through this as a couple? 😘", "asiddigm": "As a YouTuber and supposing that most of the work you do is online, how do you keep your self focused only on work during the daytime (from 9:00 to 17:00) and not get distracted by other things like watching your favourite YouTuber new video, replying to messages, or playing video games etc..?? Any tips and tricks because I'm really struggling with this!", "gabbysuddy": "Is there any right age to have sex, and is losing your virginity as such a big deal as everyone makes out?", "isabeljparke": "How do you balance work with fun when you're working from home - it's so difficult to find the motivation to get going some days!!", "fridabystroms": "According to you, is being 'sexy for one self' as a feminist empowering or just simply still following the patriarchal standards with feminism as an excuse?", "_aminahbq": "What kind of glue is used to stick the stoma bag on to your body? Doesn't it just fall off if you stretch too much? I find it really cool that you can see your intestine. I sound weird. Bye 😂", "jitterbug1939": "I've just been diagnosed with Crohn's and just feel so angry with my body failing me. How do you get over feeling this way/ do you ever stop feeling this way?", "proseccoqueen8": "What’s your opinion on the fact that PSHE is non statutory in schools?", "chloeelliot": "other than the pill, which form of contraception do you advise for a teenager to use? i’ve been on the pill before and it completely threw my hormones out of place! any suggestions? ♡", "laurenlollu": "Have your periods started to come back? And before surgery, did you use a menstrual cup regularly as your main form of period protection? What was your experience with the cup like?", "epoxxy": "How about running, swimming etc. with stoma? Is the adhesive water and sweat-proof?", "lauren__hund": "How do I pick a major/does what you major in really matter?", "poturtle": "What are your top tips for getting through a creative block? I’m a photographer and I feel so trapped in my own mind, it causes me to take less and less pictures, which causes me to hate myself, its a circle... ❤️", "natalilies": "Do you have any advice for people starting uni? I’m going to manchester in september and I’m really excited but also terrified!", "lorcaesar410": "@hannahwitton My English wifey 😍😍😍😍", "emiliacaste": "what do you think is the most important thing in a relationship and to keep a relationship together?", "megan_dessent": "What’s your all time favourite album?", "glasgowanna": "Would you ever consider training to become a sexual health nurse? 👩‍⚕️🍑💉 I think you would rock it!! ⚡️☺️ xx", "alex_edwards_14": "When do you think you’ll have kids?", "julia.toth": "How to deal with the fact that you are developing feelings for someone while both of you are going to move away in less than a year and know that long distance is not for you? #deeptalk", "liz_art_illustration": "How do you feel confident in your sexuality and deal with people who don't believe you bc you haven't had sex with a person of the same gender? And also, how do you deal with gaining weight? (I gained about 20 kilos in 2 years) so stretch marks, peoples comments etc.?", "katybroad": "Advice on how to get into having casual sex. How to make the first move, where to start and how to talk about it appropriately. x", "alexcardosowastaken": "Hey hannah! I'm visiting London next month, what are some non-touristy places I shouldn't miss? (Harry Potter themed spots are encouraged). Ly 💜", "mel.dryland": "Thoughts on wearing a bikini in public with your stoma bag on show? I’ve had my stoma for a year now and I still don’t think I have the confidence to do it!", "petralikethecity": "what has helped/is helping you the most with your mental health right now?", "julianrice13": "How has sex changed since having the stoma? Is it worse/more difficult?", "aliceebxox": "How do you tackle mental health stigmatisation when you don't want to reveal to colleagues or friends you have bipolar disorder?", "a95kelly": "How do you stay positive throughout your your journey with health issues? I currently am recovering from pneumonia and sepsis and finding it very difficult to accept the way my body is at the minute. E.g limitations mobility and energy wise plus change in appearance due to medication especially steroids. Recovery has been really rough on my mental health.", "annabelle_s_17": "What was the first sex toy you used", "celesamuel": "What do you do when you re down? Sad? How do you cope? I hope you are well .", "sofi_hourcade": "Did you ever thought about going vegan? Since it has a lot to do with feminism", "lookingpoison": "Even though I'm over 16 is it still illegal for an older man to try and pursue me?", "sinfulsrw": "For once I have an actual question. My girlfriend can't masturbate. She has tried and tried and she just doesn't enjoy it, we have gotten her toy after toy and she just can't reach that moment with out me. So if we spend a lot of time away from each other she gets frustrated and can't release any tension. Any ideas on how to help her?", "a_very_potter_fan": "When did you first start wanting to have sex with people? I’m sorry if this is too intrusive I’m just starting to worry about myself 😊", "_catrinevans_": "Any tips for boosting your own sense of self-worth when outside influences like grades and work make it difficult?", "eeeeemily_c": "How’s your day going?", "die_optimistin": "How did you deal with changing your career plans or more realising that you won't take the way everyone imagined for you?", "tom.chandler22": "Relationship Advice needed: my closest friend is currently in an abusive relationship and he acknowledges this but carries on putting off breaking up with his girlfriend, partially because there’s other stuff going on and partially because he’s scared of what will happen. What can I do to help him get out of the situation ASAP because it breaks my heart to see him go through this? I know his is a bit serious but you’re quite a wise person so maybe you could help 😂", "doddle.vloggle": "Any tips for body confidence? Mine is non-existent and id love to have some", "saskialeach": "Is your stoma permanent or temporary? Xx", "zara_sandhu21": "If you could do any job except the one your doing now, what would it be ?", "giastbury": "How did you stay body positive and happy both during and after your surgery?! X", "jessie.dp_": "How was school life for you? What did you get for GCSEs? Xxx", "xandraleigh": "What was your original goal for a career and how has being a YouTuber effected that?", "madelinebailer": "Who is ur biggest inspiration?", "laurensartistry": "I’ve had an ostomy for 3 years due to my colon rupturing and was soon later diagnosed with Crohn’s Disease but my question is, how have you become so confident with it? I really look up to you in that way. If anyone tries to talk to me about my Ileostomy I try to avoid it but how do you open up and have the confidence to flaunt it? It’s been 3 years and I’m still not fully there 😭 thank you!!!!!", "nicks_desirae": "How do you stay motivated/positive going through something so difficult? I lost a couple family members to suicide and other sudden deaths and I still struggle to find the positive in things.", "xemilymanchipx": "How was it having sex for the first time after stoma situ? 🙈", "kate_mooo": "I just had to go to a family planning clinic for the first time dyou remember your first time? What was the reason for it?? ❤❤❤", "caitlin.abbie": "How to deal with a breakup? Also when you lost your virginity, did you feel disappointed at all or just a bit weird?", "alessandro.canale": "What’s your advice to really insecure people that feel shit about their bodies?", "msmanuelaaa": "Not really a question.. Just wanted to let you know that I adore your bubbly personality and that admire your strength to keep on kicking ass @hannahwitton", "rosecoffees": "would you ever do a video on reproductive illnesses (i'm not really sure what to call them) such as pcos, endometriosis, etc? i feel like they're really unspoken about in general and there's not many videos talking about symptoms, what's normal for a body and what isn't, removing the stimga, etc, and i've yet to see an sre discussing dating and sex when it comes to these things.", "neutralsophie": "How do you rock that bobble on your wrist like it's an accessory?", "novelvet": "Any tips for moving to London??", "still.lily": "any tips for surviving school?", "ellie.jane00": "A bit of a weird question, but I'm studying for my a levels and I wondered how you revised for history? I've applied for a history degree at Brum as well so I feel like you're a good person to ask!", "nbglenski": "Kind of personal, but what’s sex like with having a stoma? I’ve tried looking up some videos on YouTube about this question and no one has really talked about it? I’m not looking for laughs or anything. It’s a genuine question. 😊", "bethanymary__": "Do you prefer to get your pubic hair waxed or to shave it yourself? Pros and cons of each?", "rachdb39": "What’s your favourite part about having a stoma?", "_paranoid7": "Does your stoma hurt while doing certain things, like having sex, exercising or wearing certain kinds of clothes? Keep doing it like this, you're awesome❤", "_ellieforrest": "How is your boyfriend with your stoma? Does he struggle with it during sex? To look at? 💗💗💗", "r.stratta": "Hi Hannah! My questions for you are : 1 after the stoma experience, would you ever consider including it in a future new book? 2. Being a Londoner yourself, how do you feel about the recent violence escalation in some parts of London? Love u, Roberta ♥️♥️♥️", "dommymartinez_": "Hi, Hannah. How are you? Lately I've been wanting to be in a relationship for the first time. The problem is, though most of the time I don't really consider it a problem, I'm very picky. I don't want to be with someone that doesn't think like me in some things (say feminism, lgbt+ issues, sexuality...) This is really really important to me, and it's been the main thing why I've never had a boyfriend; and I don't want to be with someone that I don't really feel attracted to physically either. Now I have those things clear in my mind, but sometimes it all feels as an excuse, as if I was scared of a relationship. And I kind of am, of course. But how would I know if it's actually fear what's keeping me from enjoying my love life? Hugs and kisses, Hannah. I hope you're ok", "leoniejayne_": "You always mention being in love with Wicked, but are you interested in any other musicals? 💚", "hollyisabee": "any advice for thinking that you should aim higher than your current dream job?", "devora_iv": "Any advice on how to get over stage fright? As soon as I step on stage my whole body begins to shake, my hands become freezing cold and my voice becomes quiet, starts cracking and sometimes nothing comes out. I really need to get over it because I adore singing and I’d love to do it with confidence.", "allee.gette": "Body positivity advice would be super helpful! How do you avoid comparing yourself to skinnier/prettier/whatever-ier people?", "solasuaine": "How do you deal with the body dysmorphia that comes with having a chronic health condition? I find that really hard to try and control", "amaya.corrine": "How do you talk to your partner about your chronic illness without making it feel like you’re burdening them? (This is something I’ve felt guilty about for a while and it’s affected my relationships in a pretty crappy way.)", "ginger.curls_": "Do you have to (not) wear certain clothes because of your stoma bag?", "hannah_c_page": "Do you find that since your stay in hospital, and the massive changes you’ve had recently, that there’s been a change in your libido or desires/sensuality? How has your partner approached these changes?", "carrie.like.the_movie": "I've got some pretty wicked self esteem issues. I used to be much larger than I am now (I've lost 120 pounds) and my body shows it. Now, I can't exactly get any cosmetic fixes and exercise only helps so much to keep things (i.e. excess skin giving me bingo wings to the extreme, excess skin hanging out on my thighs and stomach), and because it's only a superficial problem, insurance won't cover any removal surgeries. What I really would like are some tips on how to accept my body as is, how to allow myself to be intimate with other people (because I have not let anyone see me naked in years), and how to simply be more caring about myself. I'd never tear anyone else down for the things I tear myself down for. It's a problem. Thank you for your time, Hannah!", "mmrsmry": "i read on your blog you're coming to austria. what are you doing here? will you be in vienna? 🤔", "smiles_and_moons": "I am a lesbian which usually doesn’t bother me but I feel so behind. I don’t let my self have crushes on people out of fear they will hate me for being a girl and liking them. I have never kissed a girl or even been in a relationship with one. I have been out for two years and still feel so behind. Any tips or advice?", "leoniexherb": "This has been bugging me since your first stoma video... Can you have anal with a stoma??", "elliesmonks": "What did you do job wise after uni? Nearly finished my final year of my degree and have no clue what to do next 😱", "bossdeaths2113": "Do you think boob motorboating is a turn on or turn off?", "shanayaaa513": "How not to let stress get the best of you?", "georgialaa": "Going out of my mind having finished my work at university but am not going back to work for another month, any ideas on what to fill this time with? Xx", "charlotte.oatley": "Advice for uni? Any top tips for studying and living away from home for the first time? I’m going to uni in September so any tips would be great! :)))", "jess_garrett21": "Are you taking steps to avoid a hernia (ie good support wear)? I though as a fit 21 year old I'd be safe but I was WRONG and now have a hernia 😭 seriously be careful xxx", "alinasaman": "hi hannah, your skin looks really healthy bless , I'm a med student and i have read about stoma quite a lot, it is not a easy phase to go through but you're acing life girl! Props to you, my question is do you believe in affirmations? Is there any specific set of words you remind yourself often in case of difficult times", "jade_beardib": "What is key in a relationship when you're both very similar - do we try more to discover our differences or embrace that we have a lot in common? 😊", "alba.smn": "I was rewatching your rant about big boobs video the other day and there was a moment where you said \"God forbid I put anymore weight or lose the weight\" or something like that. How's the bra situation doing now? Love you💜", "bradleyywatts": "From one Harry Potter fan to the next, which Harry Potter book is your personal favourite and why?", "jay.dreamer": "how would you begin to ask about mental health, as in if you were concerned for yourself and looking to speak to a doctor or something? just unsure of how to start the conversation", "zoeee2591": "What is life for you?", "carolina.calheta": "A weird bucket list goal you have. ❤️", "lisanicolest": "Currently awaiting an IBD diagnosis, endoscopy and a colonoscopy.. any tips on dealing with the longest flare up, and the effect on your mental health from being ill for an extended period of time? I’m also terrified about the procedure so do you have a positive experience you can share? Also how is the coil treating you? X", "toothless.15": "Have you seen Infinity War and if so what was your opinion?", "fay_etson": "What is the no.1 thing in your life that has changed since your operation?💜", "sharkgandalf": "not so much a question but did you know that my grandfather was one of the guinea pigs for the stoma bag? love your content!", "isidoraperezurzua": "Is it okay to feel lost and overwhelming about one’s future? (Due to the life of one’s peers)", "annie_leia": "How did you become so clued up on sex and relationships, is there a course you can do? Did you research it yourself?", "djjazzyjoff": "What operation did you have? AP resection? Hartman’s? Panproctocolectomy?", "hatosweatman": "If you could be another hogwarts house, other than hufflepuff, what do you think you would be?", "loreleijager": "How can I be confident with my scars?", "dkg3784": "How's your sex life now with the stoma?", "rogatron96": "I am interested in your thoughts about sex education in schools. How much and when do you think student should be taught?", "honey_bee26_": "Any tips for never being able to orgasm even during self pleasure. I started having sex recently n have masturbated for a few years but have never been able to achieve orgasm. #askhanna", "nika_kapushesky": "What is the best advice you can give for someone stressing about GCSEs and future life? (:", "noah.j.ones": "What’s the different between a lilestomy (I probably spelt that wrong) and a colostomy?", "_megandavidson": "How to gain more self confidence? X", "alternative.au.fn": "I'm writing a story while keeping up with my life as a med student. How do I make sure to set aside time to write relatively often, considering that I can get lost in my studying if I don't realise? Love you🌈", "haha_miller": "What's your advice for ending a fwb relationship but still remaining friends?", "nemstagram_": "What's it like not doing a 9 to 5 job? Do you think you would prefer it?", "txmxson": "Who was your biggest inspiration growing up?", "anoukksmith": "Ignoring any financial/work/physical restraints, if you could travel to anywhere right now where would it be?", "wallflower_ellie": "What’s your best after sex tips?", "r.osiebarry": "bit of an odd one but have you ever felt less worthy to be somewhere/ be part of a conversation because of your height? i'm 4'11\" and find it hard to be taken seriously/ feel like i don't belong aha xxx", "k3zh24": "How does your bf feel about what you do for a job. And your stoma ?", "queerwitchyfriend": "How are you dealing with sexytimes now that you have Mona? Can she make things akward?", "janicew9": "How do you fimd bras that fit well? I feel like I am consistently unhappy and uncomfortable no matter the price point", "chelsea_cope": "When do you feel the most sexy, pre surgery and now post surgery with Mona xx", "frankiemillard": "How have you adjusted your diet with your stoma? This is something i’m still personally struggling with", "_.h.anna": "Hi Hannah my question to you is I know this might be awkward but how do you have sexy times with a stomach as I imagine that it would get in the way by the way I love your channel and find it very informative and fun", "daphne.cp": "would you recommend history at uni? i’m choosing my a level options and part of my really wants to keep doing history but i feel like 3 essay based subjects would be too much", "brvar.eva": "How does the first sex ever feel? Does it hurt a lot?", "crabhands_emily": "do you have any book recommendations that aren’t on the banging book club list?", "nathan.tompsett": "Any advice for A-Levels and how to stop procrastination? I am so awful at procrastinating.", "mrjarwson": "A book you're excited to start reading?", "equineish": "Any advice on not wanting to be more intamite with a partner if you don't feel like you're ready even though they are and you feel like it's damaging your relationship that you keep saying no?", "darkangeltish": "@hannahwitton you may not have much knowledge of this but do you have any advice for a relationship with a trans person and a bisexual person? Thank you!", "jennybgoes": "Any advice for finishing university and transitioning into adult life/a real job?", "alisha_lester": "Would you ever get a tattoo 😊 if so what of?", "ally_ici": "What are your relationship deal-breakers and what things do you think we should all see as red flags in a relationship? P.s. Love Mona in this pic 💛", "agusledo": "How long does it take for sex to feel comfortable during a relationship with someone new?", "lelaaina": "any tips for dealing and coping with colitis / IBS stuff in general pre stoma?", "phoeb.eh": "how to find your dress \"style\" without breaking the bank? I'm hate most *mainstream* clothing so am struggling a bit!", "izzyllloyd": "How do you motivate yourself when it comes to work/writing/etc?", "pammringwoodd": "Apart from Sex and Relationships advice, was there anything else you wanted to do?", "claudia.grace.h": "How to stop liking people when you know you’ll get hurt?? HELP!", "extraidiot": "Has having a stoma affected your YouTube. Like subscribers gone up/down correlates with the stoma vids?", "coulthard265": "Who is your idol x", "living_with_endometriosis": "Advice for moving to London after uni??", "competent_equestrian": "How are you?", "geo1gia": "Hi I’m currently in y9 nearly y10 and wanted to know weather when you where this age you knew what you wanted to do when you where older because I don’t know what I want to do ?", "kopfnik": "What are you currently looking forward to (life-vice)?", "whales.on.snails": "I like someone and I don’t know what to do he knows I like him, should I ask him out ?????", "camillepamperin": "Are there things you can’t do anymore, now that you have a stoma?", "emily.sheeehan": "What can and can't you eat with ur stoma? 🍕 and do you agree with animal testing? 🐰", "definitely_not_scheming": "How do you avoid Mona being active while you're in the middle of sex? Or, how do you decide when she's inactive enough to attempt it?", "abii.hotchkiss": "Advice on safe sex for teens?", "davey.92": "I’ve got a crush on my friend but she’s said she’s not interested, I still want to be friends with her but I think I need to move on. It’s long distance as well. Any advice?", "hello_hl23": "Buy smaller jeans but keep your original ones. Just in case :)", "gabriele_go": "Hi Hannah! Do you have any podcast recommendations? 🌿", "megan_crofts97": "How do you cope with finding the balance between wanting to get good grades and not letting your education/grades harm your mental wellbeing?", "mateojaramillovargas": "@hannahwitton I haven't had sex in a while, and i've been thinking that i may feel uncomfortable when i'm with someone again. Any advice? Also, how to make the other person comfortable and relaxed before & after sex?", "tegangailor": "what’s it like having your first boyfriend! and what’s a good age to have a boyfriend? love u han your such an inspiration💜", "t4yl0r17": "Advice for young feminists who get abuse for being such, and feeling angry but also feeling trapped because you don’t want to prove the stereotypes right??? I love your point of view on lots of important issues so thanks for being a role model!", "k.drew18": "Is there a way to cope with being single for a long time? I haven't been in a serious relationship for 2 years and I'm surrounded by lovey dovey couples.", "paganiniester": "What is your advice to someone that is failling to get a job after university?", "zoe_zori": "What keeps you motivated? I know it's easy to fall into a depressive state when things aren't going right, or you feel different from the norm.", "gracemariecross": "any tips for nutrition/ favorite foods / recipes currently??", "ima90schick96": "Have u ever been walked on in a passionat momment ? If so what did u do when it happened ? X", "lilybeam_": "How do you feel about your body post surgery? You lost an unhealthy amount of weight, but with societal pressure to be skinny, was there a part of you that felt good about having lost some of that weight? I love you and your confidence to share your journey.", "zoe_h44": "Any tips on body positivity, especially since the stoma? Xx", "mykie__m": "Have you found it awkward at all being intimate with the stoma", "afanador_studios": "I love seeing your videos and this page.", "nat__crook": "were you nervous the first time having sex again with a stoma or were you excited for a new adventure? 😉💛", "leah_nott": "What is the biggest difference in your life with a stoma?", "corriecozla": "Do you want to get back to your pre-stoma weight? X", "sidemenxmartianclouds": "@hannahwitton dose your stoma hurt ? And have you got any advice on life? Btw I adore you !", "bumblingliss": "Ooo yey! Got any advice for dropping all the shit in life and starting again in a new place?", "abfab_rozee": "How are you doing Hannah? 😊"}