{"marketa.wollrabova": "Hope you get better soon Hannah. Sending lots of love ❤️", "hadaluna2": "Sending you love all the way from Dallas", "thejillbradshaw": "Sending love!", "rose_eagleton": "Oh gorgeous xxx", "oddlygothic": "♥❤♥", "tamararushton": "Hope ur ok sweetie can't believe u having go through it again hoping for a quick speedy recovery and hope ur health stable again now sending my love and hugs to u xx", "lenkleinchen": "This is brilliant. Not what's happening to you but that you manage to mock yourself and have a bit of humour in this time is simply amazing! Get well soon little fighter!", "johnadam_m": "Get well soon :(", "jjessicaowen": "Hope you have a quick recovery! True inspiration and idol to the IBD community x", "mark_2500": "I hope your okay .my pray are with you mark", "benfra1": "Keeping you in my prayers! Hope you feel better very soon!", "nickblue_ish": "Hannah Love you, get well soon!", "eve_mee": "I’m a nurse and we call him Baxter! xx", "readreadwriteread": "Just got out of surgery myself... love you Hannah! Hope the healing comes quickly!", "crystal.gem.nad": "We love you sweetheart", "georgieporgie144": "All the love in the world to you Hannah 💕", "cat.o.leite": "get well soon, best wishes!", "earthtomatylda": "Keep on keeping on 💖", "sophie_kit_": "Get well soon!", "janebrackston": "Get well soon xxx❤️", "blackwolfecherokee": "Morphine made me nauseous, so they switched me to Demerol. Either way, those pumps are a life-saver!", "mrcolitiscrohns": "@hannahwitton How bloody hard is it to fathom the energy to sit in that chair 😅😅 Take me back this. Get well soon Hannah.", "jaclyndemmert": "Hannah :( ❤️❤️❤️❤️❤️", "zm_z_a_i_n": "😢", "elliesmonks": "Get well soon xxx", "mikayla.alexandria": "Oh my darling 😢", "jedi2257": "Recover soon. Make sure you don’t go without pain relief x", "xrandomprincessx": "How are you feeling. Sending all the positive vibes and prayers your way. Continue fighting strong as you always have and hope recovery goes smoothly for you. Wish the best in health mentally and physically for you Hannah xx", "insanitycentre": "Get well soon!!!! Hope you don't have to go through this again 🤞❤", "jwcoffeefish": "❤️", "kennowell": "Get feeling better Hannah from across the pond!!", "cc_grandy": "You are awesome! I send all my love to you 💜", "oguilucortes": "Get well soon! You are a wonderful person", "pranavdhomne": "Get well soon hannah", "dennywillett": "Use it well and get better soon", "electrasnow": "Wishing you a speedy recovery darling xx", "sophiekatie_": "get well soon hannah 💓💓💓", "dr_toerag": "Hope you get well soon. Much love.", "theglambeauty": "Hopefully you feel better soon 💕💕 Stay positive x", "_faithy_roo": "Sending all my love and best wishes to you sweet girl!❤️", "annimrossi": "Get well soon! ☹️", "laura_jaine": "Hippie you are feeling better soon xx", "rosaliarussoniello": "Get well soon!! Praying for you", "whosnatb": "Sending you lots of love ♥", "booknester": "Lots of love Hannah, hope you'll start to feel better now 💛💛💛💛💛💛💛", "immerfm": "get well soon x", "aylaelizabethx": "Sending so much love to you Hannah - all that I possibly can xx I follow you mostly on Instagram but have fallen in love with your strength and the positive message you spread. You are so, so strong xo", "ffionforthewyn": "Get well soon :)", "paperroses_17": "Good luck, sending you good vibes 💕", "mxriee_priv": "I wish you the best Hannah! You've got this! You're so strong!🔥💎💎🦄🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀", "camicorfer": "Hannah I love your channel, hope you get well soon, good vibes to you. Greetings from Chile", "rederin1996": "Good thoughts to you. Be better soon", "ximeelena": "Love you", "golden_shortie": "Oh no. Sorry you had to have another surgery. Hope they're taking great care of you.", "x.katieriley": "Get well soon Hannah x", "leah.elizabeth.14": "I hope you feel better soon ❤️", "jjacko17": "All the best, get well soon. x", "mark.allen9033": "Thinking of you at this time. Your a pieces 🐬so your driven and have goals you want to do. You will get better. I can see your a positive person so any moodiness & obstacles that get in the way, bin that straight away!!.I send you a virtual flower, which is a water lily 🌸which represents high expectations which is just you. 🎓", "anna.wardell": "hope you're okay x", "ansleus93": "Wishing you a speedy recovery ❤️", "haesitans": "get well soon!", "_scutty_": "Get well soon Hannah :) x", "maguilo71": "💪💪💪💪💪🇦🇷🇦🇷🇦🇷😍😍😍", "littleblip75": "Get well soon xxxx", "dowaj": "this brings back so many memories for me I know how your feeling get well soon.", "soumayaqsk": "😙😘", "j_immy_g": "Very happy that you're ok", "kjhaughey_ibd": "I had the same surgery 5 weeks after I got my stoma. Take it easy and heal well xxxx", "_sophiereeves": "Hope you feel better soon!", "racerjosh": "@hannahwitton wow did you have to have another surgery?? Wow get well soon prayers", "scarlotcharlot": "You're strong, you're determined, and while this is a setback you will recover and fight back the way you did before.", "lorcaesar410": "@hannahwitton you got this baby girl u a Queen you'll best this frfr", "laurengeorgiarogers": "I’m so sorry xx", "hannah_mead_": "Sending so much love!!❤️", "khelysi": "Thank you for sharing this journey with us, you have all the love and support behind you. I hope you make a quick painless recovery", "its_wamere": "Get well soon.", "hannr9": "💕💞", "kylaasutherland": "I’ve been there haha... they can be great 😊. I hope your recovery goes quickly/smoothly! 💜💜💜", "viscious_uv": "Get well. Enjoy the morphine!", "sophieforstr": "Lots of love ❤", "nicolefarver": "This was literally me two weeks ago after my most recent leg surgery 😂 I’m sorry about your setback and wish you all the best moving forward ❤️", "annakate_birdie": "Xx", "kristinarasband": "Feel better Hannah! California is thinking about you ❤️💕", "kerrie_realm": "You have to have surgery again? Hope you feel better soon xx", "youmnahussien92": "Speed recovery lovely Hannah", "karlybrownlee": "So glad that you’re alright!💕", "annagaunt_": "You're amazing! Hope you have a speedy recovery 😘❤", "katelynjoe4": "💛💛💛", "bigk73089": "Get well soon love", "zoefrances1": "Get well soon babe xx", "severine_darkora": "Glad your surgery went well. I hope you make a speedy recovery. 💜", "kmakeup_pro": "Get well soon 🙏❤️🌷", "dodieclips": "❤️", "___lois.___": "Get well soon u lovely ladyyyy", "sarayohansson": "💛💛💛", "littlekaatie": "Wishing you a speedy recovery! 💜💜", "abigail.af": "Hope you get better soon 💟✨", "clarence_maslamoney": "You be strong.", "natachee77": "Lots of love 💙💚💛🧡💜❤️ Get well for good. You're so necessary to so many people!", "joliemontetb": "Sending so much love your way!!! ♡♡♡♡", "sammyalbon\nVerified": "Verified", "songbirdtomeo": "There's no better relationship than between a lady and her pump 😂 Wishing you all the love Hannah 💛", "annarxdgers": "Good luck with recovery ❤", "aylieeeee": "Get well soon 💖💖💖💖", "katimorton\nVerified": "Verified", "peacock.dream.z": "💗💗💗💗", "marziesreads": "(((Hugs)))", "808bry": "Hope you fill better soon Hannsh", "katyallred": "Poor Hannah. You are strong af! Hoping you get to feeling much better very soon", "phoeb.eh": "sending so so so much love 💜💜", "seyiakiwowo": "😘😘😘😘😘", "grace._.diane": "❤️❤️❤️❤️❤️❤️❤️❤️", "allieconzola": "You're so strong for staying positive through all this. Really hoping things get better soon, and sending good thoughts your way!! xoxo", "daphnegrace_": "Sending you all the love in the world Hannah, I hope you heal quickly❤❤❤", "frankiemillard": "💜💜", "msmanuelaaa": "Can't believe you're going through this again... I just watched your travelvlog. Hope you feel better soon ❤️❤️", "emily_runz": "What happened? I hope you are okay you have just gained strength. ♥️♥️", "hannah41295": "Feel better soon 💕", "lee.warrent": "😮 hope you’re on the mend 😘😘🤗", "isabellejistanes": "We love you sweetie. Stay strong! 💪🏽❤️", "bayleesnyder18": "💞💞💞💞💞", "affrickgato": "Ily hannah! Get better soon! Xx.", "randyripoff": "So good to see you back on your feet and making jokes", "lorijomurchie": "Hope you feel better soon ❤️", "christinetibs": "I'm so sorry! Rest up and take advantage of your friends and family they are there to cater to your every whim. ❤️❤️", "mariemellark": "So so proud of you! You’re a fighter and you’re awesome for showing us your best and worst days! I hope you recover quickly and it’s going up from now!❤️ Lots of Love🎀", "simply_milica": "I am so glad you are okay 😁 sending you all my love and positive vibes ❤😘❤", "mab600": "The drugs do work... 😈", "swissmiss329": "Sending all the love and good vibes!", "rachelmayhart": "You really do not deserve this. All my love xxx", "kayleigh.louise.568847": "Oh no, hope you heal soon beautiful x", "gossip__gurl": "🙏🏻💐quick recovery Hannah 💪🏻", "janikammm": "Hope you get well soon!! Keep us posted how you’re doing 💕", "papa.becc": "❤❤❤❤", "hey.anu": "feel better and hope you have a fast recovery!! you’re an absolute inspiration to me, and i know that you’ll make it through this strong. keeping you in my thoughts 💕", "nagoreca": "Get well", "_ahmdsaint": "Speedy recovery @hannahwitton ! Stay strong as always ya ! god bless :)", "natalieaviv": "Sending you all the love and best wishes Hannah ❤️", "osamu.wc": "Man this is why I’m spooked about everything with my ostomy, I really don’t wanna head back to the hosptial. Get well soon and hopefully recovery isn’t as slow as it has been for you!", "clairefielder": "Please get well soon & stay strong sending all my love xx❤️", "marineweber15": "Sending lots of love ❤️", "without_an_e": "Stay strong", "cheshirejkatz": "I hope you get well soon! More surgery sounds like zero fun :( sending you lots of love!", "howtotrainurdragon": "Sending you love. You are so strong ❤️", "chapilusion": "Good luck Hannah! Keep up the good fight! ❤️", "luisenrique_art": "Get well soon, all the love to you <3", "lizzi2590": "Hope you ok 💖🤞", "dodieclarke": "get well soon honeyy", "mansell.evans": "Hope all went well Hannah, sending love, and best wishes. 💗", "petrainneverland": "Get well soon 💙", "mmmmmkays": "Get better soon Hannah!!", "dogz_n_frogs": "Bet you can't wait for 2018 to be over and all this a distant memory. I'm sorry you are going through all this but thank you for showing us how strong and beautiful you are. Hope you get to break out of hospital soon and have a speedy recovery.", "mrjarwson": "❤️❤️", "weelisalou": "Hope you get well soon, Hannah 🖤", "niamh_m_kelly": "Love you Hannah, wishing you a speedy recovery xox", "emilyglassmeyer": "I LOVE YOU.", "ellescreates": "get well soon 💕💕", "kim.caroline": "You are such a strong woman! Wow, wish you all the best luck!", "anacatarinaapl": "❤️❤️❤️", "kendall.rebecca": "sending you lots of love and prayers💕", "clodaghgribsx": "The morphine pump is your friend, but be careful you don’t overdose! Doctors say you can’t. But believe me, you can. 🙃 Wishing you the best of luck and a speedy recovery!", "the_unicorn_with_a_camera": "Sending you lots of love, glad it went well 💖", "swarada.b": "💚💚💚", "alliegrce": "Wishing a speedy recovery ♥️🤞", "charlottesimpsonxox": "keeping you in my thoughts Hannah, love you so much xxxx", "jenskimalinski": "I'm so sorry to see you struggling with your health again after all that has happened this year! Sending lots of love and I hope you get better super soon! X", "adriansims28": "😦😦😦", "essie.ruth.makes": "☹️💕", "edward.viteri": "God will heal you, have faith", "varunnaa": "Stay strong hannah!", "beetoledo": "I hope you get well soon! We love you Hannah", "nadia_ella2002": "Sending love hope you get well and heal soon xx", "duncan.noel": "Get well soon lovely xxx", "ambervanheumen": "Happy surgery went well hope you feel better soon 💪❤", "tayherbertsonn": "❤❤❤", "vanessa.falcone": "sending love 💓💓", "theaprilweasley": "💚💚💚", "nicetsukki": "You’re honestly so inspirational, thank you for being honest with everything you’ve gone through whilst still maintaining a positive attitude❤️❤️", "hargreavesgracie": "Good luck, Hannah! You’re such a trooper- xxx", "pheebs_9876": "Hope you're doing okay babe 💜💜 sending you lots of love, from one Hufflepuff to another 💛🖤💛🖤", "fecked_upgirl": "You are such an inspiration, Hannah! Take it slow and feel better soon! I wish your recovery will be smooth 😘 You deserve the best 🧡💪🏻", "jen_christian_1998": "get well soon lovely", "janerix": "You're so strong for sharing these kind of photos with the world. Hang in there, you can do this! xx", "kevin.wg.02": "Who doesn’t love morphine 😅", "mynameisnonameya": "I really get a lot of courge from u. U can easily become very weak. But you look u are trying the best even under the hard situation. And i think that can mean a lot of things to people who suffer from bad things.", "kaztafff": "Praying for you sweet pea", "xenaknox": "That’s an itchy kinda love right there! 😘", "kizzyhorse2000": "Morphine is great stuff. I'm on two slow release tablets daily. It keeps body and soul together. All the best for your recovery from someone also in hospital since Monday though hoping to go home today or tomorrow", "ana_maria_celestino": "Sending prayers for a fast recovery! 💕💐😊", "maddiegreg_": "Lots of love 💙", "laurentullyy": "Thinking of you, get well soon❤️☘️", "edenrae43": "Sending you love, your courage is truly inspiring 🧡", "unatulig": "Sending you lots of love❤️", "mylunarose": "Get well soon 💐❤️😊", "julieevans_dowrick": "Sending you well wishes.", "daytonamills": "Your positivity is just amazing and inspiring 🙏🏼🌈🌟", "celesamuel": "Have a good recovery !!! Sending good vibes to you.", "superted001": "Be careful with that stuff", "bestsebever": "Get well soon Hannah :-) Hope you're feeling better already", "c_r_armstrong": "💛💛💛💛💛", "phoebetea": "So pleased it went well, get well soon lovely 💛 such a brave little bean!!", "tibbarcimsoc": "Get well soon 💙", "eleanor_kaye_": "You’re so brave 💗", "kermits_frog_blog": "I hope the surgery went well xx wishing you a speedy recovery", "trevorgeorge66": "Hang in there kid", "jarisaleh": "I miss my morphine pump 😭😂haha low key for reals tho", "rodrigoballeste": "😘😘 @hannahwitton", "jen.ohogan": "Sending all the hugs your way. Here's for a speedy recovery. 💜💜💜💜💜", "tabby_ellis": "Get well soon you are the strongest person on earth and I hope recovery is quick and not too emotionally and physically taxing cause you are so positive and will get through this now!!!!!🧡🧡🧡🧡🧡🧡🧡🧡🧡🧡", "nicoleee1396": "❤️❤️❤️", "averekriz": "poor honey, we're all thinking of you.", "alakinamann": "So much love", "merleredbird": "It’s good to see you being better and still being able to joke around despite your shitty situation (pun intended)", "natlovespandas36": "💕💕", "fanny_tld": "💪🏻💪🏻🧡🧡", "antoryan97": "Morphine pumps are great 👍", "katwrightx": "I hope you recover well Hannah 💛☺️", "oloni\nVerified": "Verified", "water.protector": "Last year I had exactly the same health issues as you stoma...etc. Turns out it was triggered by the IUD I had fitted. Get it removed ASAP!!!!!!!! Doctors aren’t aware of the connection but trust me the IUD will not be helping. There is a a new paper coming out about IUD causing autoimmune attacks especially gut related. Praying that you read this!!! If you need anymore info let me know xxx", "kulvin11": "Lots of ❤️", "joemahon1": "How come I get an epidural and everyone else is on morphine feel like I'm missing out 😂", "_fay___fay_": "I saw someone with your new yellow backpack and thought of you. Bright sunshiney yellow and orange loving you!", "thisalexwilliams": "Hope you’re recovering well xx", "adelagonegreen": "Sending some positive vibes from Denmark. Hop you'll have fast recovery!!", "journalsbysophie": "Sending you lots of love and good thoughts love you", "morteza.bozorg": "Excuse me what is your problem I hope you will get better", "cmcmullan": "Sending you lots of love for your recovery 😘😘", "vanesski": "You are so strong, keep on fighting! Love and hugs! Xx", "mellifluousprism": "Sending you all the love in the world - I hope things start looking up for you soon, and then bloody well stay that way! 💞", "ruthy_98_": "Oh wow you can already sit in a chair! That's good! 💪 you go hannah!", "maxofb": "Get well soon! ♥️", "dagger323": "Good luck with your recovery, I wish you a speedy one 🙏🏼🙏🏼", "sara_schm_": "Oh Hannah you champ! 🙌 wishing you a good recover & lots of love to you!! ❤❤❤", "miriammutig": "😳 oh man you poor thing!! Wishing you all the best", "mark.biker.man": "Hope u feel better soon", "mariettelalire": "You're so strong, you will kick this recovery's ass. I love you so much.", "lizziemaydesign": "Sorry to hear everything you’ve had to go through, wishing you a speedy recovery 💓", "sippingonmaletears": "Sweet, sweet pain management... recover well ♥️", "outesspace": "You are so incredibly strong; wish I could express how much you inspire me. Hope you get back on track as soon as possible 💓", "melaniiemurphy\nVerified": "Verified", "ajayrious": "Good luck with your recovery, take your time and know that all of your followers are with you on this journey. There will be bumps in the road but you will get there :)", "a.ritacorreia": "Hope you get well soon. Sending you love from Portugal 🧡", "ella.haid": "I'm so sorry you're back to square 1. You've done it once you can do it again! Lots of love ♥️♥️", "lucyjane.fashion": "Sending you all the love and hoping your recovery goes well, we won’t let Colitis beat us!!💜💜💜", "sophietrinity": "You go! Get well soon ❤️", "suzettefjc": "get well soon💛💛💛", "that_one_metal_head_": "Don't get addicted it's very easy to", "evie_c94": "Glad your surgery went well. I hope your recovery is as swift and smooth as possible Xx 💗💜", "toplondonsnappers": "“Wow! Love this image :)”", "louisee147": "❤🧡💛", "scarrednotscared\nVerified": "Verified", "duktigigelkott": "💛💛💛 Strong bean. Sending you love from Sweden xxx", "via.mayy": "get well soon!!💘💘💘", "mariebellemarcha_": "Such a strong women ❤️💪 everything happens for a reason, I’m thinking of you💕", "dannforbes": "You poor thing! Hope you have a speedy recovery x", "simpilot99": "I hope that's a temporary thing. I'm glad surgery went well, though.♥️🌹🌹🌹", "norah_russin": "Get well soon. We love you!", "bibatiz": "Lots of love, get well soon ♥️", "deductionsinthetardiswithpie": "i’m so glad surgery went well. i hope you recover quickly ❤❤❤", "darkora": "glad to hear your surgery went well, get well soon!", "nikimalyziak": "Get well soon. Wishing you the fastest and best recovery possible", "lilienneo": "It will get better love ❤️", "hannu_lukkarinen": "❤💪", "p0512399": "❤️❤️❤️❤️", "babelsmit": "Get well soon! Hope it was the last surgery for a loooooong time (forever). ❤️", "sean_toom78": "Speedy recovery and take it easy my thoughts with you 💙💚❤️💐", "iiinger": "Get well soon✨", "paulasglasmomente": "Sending lots of energy and love ! You’re wonderful and incredibly inspiring 🧡🌼🌞", "wolkenlove98": "Sending you all the love!! Hope you’ll recover fast :( x", "cherdynamite": "Get well soon Hannah, sorry to hear your recovery has been set back x", "orlagartland\nVerified": "Verified", "shelcea94": ":) sign that you will get better. Lots of love 😚😍", "stevo_howson": "Get well soon! Wishing you a speedy recovery ❤️", "emmadeliefde": "❤️❤️", "asmaamhzm": "Fast recovery Hanna <3", "stargazerhellraiser": "Sending so much love❤", "olaaawhitney": "Cannot believe this is happening to you again! You truely got the shit end of the stick (pun intended) Sending well wishes all the way from Australia, hope your surgery goes well and that your recovery is quick!", "the_empty_space8": "Get we'll soon", "jadefrizzle": "So sorry to hear that your in hospital again. Best wishes for a speedy recovery.", "grimshaw_pole_n_yoga": "Sending you loving healing vibes!!", "wholelottaro5ie": "Oh babe I hope you get better real soon!", "willow2659": "I hope it went well- enjoy the dreamy haze of morphine :) xxx", "alexlaurenb": "❤️❤️❤️", "monaalkhelewi": "Sending you so much love 💓", "_izzeehh_": "I had surgery a few days ago so SAME! I can't relate more 😂 hope you get better soon 💕", "salome_esteves": "Sending lots of love 😊💪🏼", "ellen_141": "So so brave, get better soon ❤️", "chloeincurve_\nVerified": "Verified", "lavendersuns": "Feel better 💗 much love", "joinxthexdots": "Oral tramadol is the one 🙌💜", "lyndzerella": "Thinking of you and hoping your recovery goes smoothly! 🧡", "katetyrer": "Sending well wishes xxx", "celine_hrg": "Sending all my love", "laurennine": "💜", "caitlinm25": "Get better soon ❤️❤️", "hmmsaurabh": "Hope you will recover fast Hannah❤❤❤❤❤❤❤❤", "aerial.grace": "Get well soon Hannah!", "_alalat.m": "You inspire me a lot to be free, inteligent and humorous woman through your videos. I love you and get well soon xxx", "crabhands_emily": "sending love!!", "iamkatietye": "Sending you so much love and positive vibes 💚", "e.mileekate": "Sending love, Hannah 💖💖💖", "superfluous_umlaut": "The morphine pump, the post ops best friend", "peterhughes93": "Just try not to abuse it and enjoy it before they take it from you <3", "hollybob2906": "Heal up soon xxx", "matildasansomm": "All the best wishes and love 💖", "rachael_leahanne": "Hope you start feeling better soon!", "charliesmallxox": "Hope you recover quickly xxx", "jeanclaude_browncloud": "Hope you're doing okay :( poor Hannah", "musicnotherthings": "Jesus babe hope your alright💞💞", "s3zz0": "Hun, sending you all the love and morphine", "thesunnysynopsis_": "💖", "jingleheartart": "❤️❤️❤️❤️❤️❤️❤️", "ingridtamm": "Get better soon!!!! Sending all the love 💗", "sadnash": "Get better soon x", "sofi.kaefer": "Get well honey!", "emilyyygalvin": "Sending so much love!!!!!"}