{"imogenfreemanx": "I once started my period in maths class I went to the toilet and saw what was in my pants oh fuck that’s all I thought I went back and grabbed a pad put it up my sleeve and said to the teacher I needed to go back to the toilet when I came back I sat down quietly and hope no one noticed. But about ten minutes later my teacher came up tapped me on the shoulder and said “you all sorted now?” I have never felt so embarrassed however looking back it wasn’t that bad and she was probably one of the best teachers I’ve ever had. But however hard she tried I still do not like maths on my period or not.", "sabrina.bergin": "Dear Uterus, why do you have to conspire against me with my back and give me day long aching and discomfort, it’s not like I can lie down all the time c", "__becausegrunge__": "Dear the mini pill, thank you for regulating my PCOS symptoms like PMS and my silly hormones and for making my period non-existent. You make me feel like a normal woman. I'm sorry we went on a break last year, I missed you so much but if we hadn't have had that space I would never have realised I had PCOS! I'll never not appreciate you again. Love, Megan", "booklover132": "Dear uterus, The copper IUD was supposed to be my holy grail. A non-hormonal, long-lasting form of birth control?? Practically unheard of! But you decided that you didn't want something in you. You decided to let the IUD be inside your walls and look crooked. You decided that the IUD wasn't for you. As someone with an eating disorder, hormonal contraception wasn't working because if it didn't cause monthly yeast infections or severe boob aches, it caused immense weight gain. My body and my mind couldn't deal with it any longer. Three years of oral contraceptives and I was done. So I finally made the decision to opt for the Paraguard IUD. One month in, however, it was crooked. So they took it out, and three weeks later, put in another one with ultrasound guidance. And then? AND THEN?! I go to have a routine intra-vaginal ultrasound (seven months after the last insertion) and find that it's a lot MORE into my uterine wall. WHY?! Why couldn't you just let me have this? I feel hopeless because the medical world isn't as invested in uterine/vaginal health as we'd like them to be. I feel hopeless because men are the ones who make the decisions for people with uteri. And I feel like I've lost my agency. The only thing left is condoms, and while there are internal condoms that go into your vagina, those are more expensive than penis condoms. Which means, I have to rely on my partner for contraception. (Yes, I realize that I can buy the condoms, but I still have to rely on my penis-wielding partner to put it on and I have to trust them enough to not take it off during intercourse). So, uterus, tell me why you don't want me to be happy. Is it because I told you that I never want children? Are you angry at me for that? Are you angry I've rendered you essentially useless? Does that mean you never want me to have pleasure in my life without a small voice in the back of my head always panicking that this is the moment that I get pregnant? Uterus, I know you probably don't understand. Neither do I. But I wish we could help each other instead of being angry. I wish the world were different. I wish there were more options. I wish, I wish, I wish... Sincerely, Arely", "mariam_haiba": "Dear regular periods, thanks for not making me worry about any surprises.", "xabbie_cliffordx": "Dear PMS, but not really \"pre menstrual symptoms\" because you happen a good week before I start. You are the reason I cried when I dropped a spoon and your the reason I sang at the top of my lungs at 12 am to hamilton. Regards and annoyed 15 year old... that has to put up with this foreverrrr", "katherineudall": "Dear vaginismus, I hate you. You make me feel so venerable at such an intimate time. How am I meant to explain to someone I want to have sex with you but it’s difficult, I just wish I could just sleep with someone without having to considered how I’m going to tell them about you. I just want to experience sex with ease just for once to know what it feels like because I don’t all I know is pain. I understand are trying to protect me but it’s been 5 years I can protect myself now. Love Katherine x", "crszyhairkirsty": "A penned note to my menstrual cup; You've been with me through thick and thin (literally). I thank you for the comfort and the ability to forget you're there. I thank you for the much fewer bathroom trips and not having to subtly carry my bag with me when leaving my desk at work. I thank you for being there, even on the 'just in case' days because I had a stressful month and threw off my cycle. I thank for the no longer lingering worry of TSS. I thank you for removing the thought of 'do I smell?' everytime I shift in my seat or seperate my legs. However, I will not thank you for the awkward sitting and manoeuvring it took to understand how you worked. I will not thank you for the first few days of 10 minute squats trying to figure you out. I will not thank you for having to constantly put you in and moving around to only have to take you back out because the stem is still too long and scratchy. I wil not thank you for the moments I realise you aren't fitted correctly and I 'spring a leak'. Weighing the pros and cons, my life is so much better with you in it. I only hope you can help others too. Plus helping the planet on the way can only be a good thing.", "logan_garrick": "Dear bodwar-we need a chat. WhY do you hurt sO much? Do you feel the need to prove a point, to make a statement? Each jab I feel in the week you are here feels like a reminder that my body isn’t how I wish it was. And why, on the week leading up to you, do you make me feel as dysphoric as i do when you are actually here? You hurt mentally, emotionally and physically and you are so exhausting. I am trying to train myself to become less connected to you, because basing the validity of my gender identity and masculinity on you is pointless and hurtful. I wish with all of my heart that you would leave me forever, along with all of your sore, annoying and depressing side effects. However - although I personally dislike you grEatly, I do disagree with the stigma around you. You are a natural occurrence and I understand that, so maybe I am too hard on you, and it is me that needs to change, not you. It’s just really fkn hard when you hurt so bad, and make me feel as though I don’t have control over my own body. I guess it’s just strange to think that something so natural and normal could hurt so much and feel so wrong. -Logan", "missymoo1998": "Dearest pads, WHY YOU LEAK WHEN I SLEEP??? 😡 thats all, bye!", "zoegurl20": "Dear High School Teachers, I fully understand that you have for some fucking stupid ass reason trained yourself into believeing that every student who asks to go to the bathroom during your lesson is CLEARLY just trying to avoid your class and learning (even if they are a straight A student like myself) but I wish you would consider 2 very important factors! 1. Periods! Yes I know I had the opportunity to go to the toilet at break, however, what you don’t know (and what I feel way to embarrassed to tell you) is that I have such a heavy flow that I bleed through tampons and pads (and both at the same time some days) in about 40 mins, so that 50 mins class or that 80min class is way too long for my uterus! So yes ten mins before class I had to ask to go to the bathroom, but you said no... I ended up bleeding onto my skirt and had to go home early...thanks... maybe next time you should consider that no all people have the privilege to have light periods or no periods at all. 2. UTI’s did you know if women hold their bladder for too long they can contract a UTI? No, Cleary you didn’t because you said no when I really needed to go to the toilet... so yeah thanks now I got a uti... Dear education system, Can we educate our teachers on this please! Because I have has so many embarrassing moments because a teacher didn’t let me go to the toilet- at some point you have to realise that kids know when they need to go- why the fuck is it a teachers final decision if a kid is allowed to pee? Seems fucked up to me! Thank you Zoe", "bitchbecauseican": "Dear blood flow thank you for being predictable and consistent, medium-heavy-light, every time. Thankyou for only and always being 3 days, i had to figure out mine was every 26 days not 28. I didn't know 3 days was normal i only heard about 5-7 day long periods. Dear thighs, why do i feel my cramps in you? Dear hormones thankyou for being fairly stable. Dear boobs you don't hurt or are ever sensitive. Dear lungs why do i get shortness of breath randomly before and during menstruation? Dear pads F you for not getting everything, leeking, feeling wet the entire time, and for the wings bunching up. Dear tampons i like you better, i only use tampons if i can help it. Dear first period im not happy about starting when i was 11 and the day before the first day of school (6th grade) i had to wear a pad that was large and thick that felt like a diaper. Dear cramps you hurt but you could be so much worse.", "weirdly_ali": "I spent 6 YEARS trying to get my diva cup in to finally be able to at 18 then have my periods stop less than a year later...WHY?", "sarahselchert": "Dear PCOS, YOU SUCK and I am REALLY fucking starting to resent you! I've known about you for at least 3.5 years. I never really had a problem with you up until now because my IUD/Coil kicked your ass. You were causing me to have month long periods which REALLY sucked, and then the IUD/Coil stopped them for 3 years til I got it replaced. The recent resentment is because I am actively trying to lose weight. Although, I do not blame you for my weight problems, but I can definitively say there is resentment for making weight loss difficult as hell! Also, even though I am a CIS gendered and a \"not straight\" women, you on some level have caused gender dysphoria. This might not be 100% your fault as I have spent near 3/4 of my 24 years of my life getting miss gendered by society who automatically assumes someone with my body type and clothing choices = a male(even with hair down to my butt!) However, hair growth on my face and hormones that are \"out of wack\" makes me wonder sometimes if it would just be easier to transition even though I have zero desire to ACTUALLY do so. a sincere screw you from, Sarah P.S. on a positive note IUD was legitimately a game changer for excessive periods!", "adrianclose": "Oh boy, i had the worst PMS whenever i had my period. Pysical pain, nausea and crying over EVERYTHING. I'm now 7 months on testosterone and it's been 6 months since my last period i love it", "xthelifeofgab": "Dear reproductive system, something isn’t 100% normal, this isn’t healthy for my anxious mind. Birth control is unable to control periods, limited options of birth control for me, horrible symptoms during my cycle, irregular bleeding, rapid hair growth and the list goes on. My best friend is now my menstrual cup, that I’ve not long began to use. It’s my lovely, eco friendly, money saving, easy to carry little friend that my body loves. It’s my little way of feeling like I’m in control in some way. Please give me answers soon. Unkind regards, a pissed off 22 year old. 🖕🏻🖕🏻🖕🏻", "halletttime": "Dear menstrual cup: thank you for being so amazing and helpful but oh my god PLEASE don't make such loud sucking noises when I break the seal to empty you in the cubicles at work. Sincerely, a slightly embarrassed but still avid fan.", "lauderbaughkatherine": "Dear PMS, I have experienced you ever since I got my period and you bloody suck. You make my depression try crawl back into my head, you make me an emotional mess in the worst way, and it’s really hard to be the person I want to be when I am trying to fight my hormonal imbalances. So Please stop being so terrible.", "theroamingreader": "Dear my period — why is it i have had you for over 11 years yet you still haven’t worked out when you want to turn up? Like would it be so hard to stick to that 28 day mark, do you really have to turn up early every time? Except you’re never sure just how early, you want to surprise me each time. And when I have unprotected sex, you just have to freak me out and come a few days late, don’t you! Just to keep me on my toes even though I know there’s no chance of pregnancy! Also if you could not be so heavy in the middle that would be great? I get nervous about wearing skirts/having white sheets and that’s just not cool! 🙄", "pearlnunn": "Dear endometriosis, I wish I knew if you existed inside of me. My gyno says you probably do. But the only way to diagnose you is to have surgery. That’s right, there’s no scan or anything. Medicine hasn’t advanced enough. On average women take 10 years from the start of symptoms to get diagnosed with you! And it’s not necessary to have surgery if medication is working (thank you so much Norimin 1 pill- You Rock!) But still, I wish I knew if you were in me. Currently the plan is to never know for sure if I have you, unless I have trouble getting pregnant in the future (40% chance of not having children if you exist). If I never try for a baby I may never find out if you exist. You may possibly be fictional, and I may never know. Much love, Pearl. P.S. I wonder if men could get endo if there would be an easier diagnosis or even a cure? #definitelytherewouldbe", "t.b.raden": "Dear Period/Pill I first met aunt flow when I was 13 yesrs old at a CONCERT.. Avril Lavigne to be exact. Boy was that an experience, I had no idea what to do.. did i have anything on me? Of course not. Why would I? So I did what I believe anyone would have done and loaded my panties with a crap ton of toilet paper went back to my seat and enjoyed the rest of the concert. When I woke up the next morning I told my mom everything, we went to the store got me a bunch of different pads to try out. My mom decided she was going to call my step mom who then thought it would be a great idea to call the WHOLE FAMILY and let them know I just got my period for the first time.. seriously as if I was embarrassed enough? 3 years went by and I was introduced to a birth control, Tri-Cyclen Lo to be exact. I was to young to really remember what my body was like on it. I do just remember my doctor switching me after 2 years to Alesse when I was roughly 17 years old. I've been on it ever since Im now 26.. planing to go off of it esrly next year! I've never had a single problem with taking Alesse other then the normal spotting in between periods and the odd time sore breats. NOW for whatever reason.. my period does this weird thing, days 1-4 everything is good not a strong period but just what I find as a regular flow. Day 5.. not a fricken thing in sight.. nothing.. I call it a \"Grace Day\". Days 6-7 she's back and regular. I find it so strange, however apparently I'm not the only one who's period is so kind to give a grace day too!!", "rachelrosejeffree": "Dear my 4 WEEK LONG PERIODS, it's been 5 months since we last hung out and I have to say, I have not missed you one bit. You started so beautifully at 10 days every 2 months. But you got angry at my implant and I understand that, but 28 days non stop was too long for me to hang out with you, and it had to stop. Since going au natural, you have been so much more happy with me, and I really appreciate you're short visits nowerdays. Maybe someday soon we can consider a non hormonal friend to join our monthly meetings, we shall see. All my love, Rachel", "mcmancilha": "Dear, damn hormones. I'm 27 years old Brazilian, married to a guy at the same age. We got married really young (controversial) and decided we did not wanted kids ( more controversial). I am a smoker who have taken the pill since I was 15 and was really concerned about thrombosis, specially cause I love to travel and work with tourism, which involve long flights (smoke+pill+long flights=serious risk of thrombosis). I was prescribed a pill that did not increased the chance of thrombosis and also stopped my periods. I was in heaven. But, I knew that it was still not the best for my health. It wasn't easy, but we found a doctor that did a vasectomy on my husband (Brazilian ethical medical principles do not care for couples who don't want children and Drs can loose their license over that). So, I stopped taken the pill two weeks ago. But I am CRAZY. I do not know how my body works, since I have always been on the pill, but now I am crying all the time, have headaches and I am not sure how my hormones are interfering with my mental health, since I have a struggle with anxiety and have been taken medication for that for almost 10 years now! So yeah, not very happy with those damn hormones right now.", "ayman4961338": "♥️💋💋💋💋💋♥️", "rozelleelizabeth": "Dear the nurse at the sexual health clinic, the reason why I subjected my body to 6 years of injected hormones. I know you probably had monetary reasons for refusing to give me the implant, but you did not need to speak to a 16 year old in the way that you did! Especially when they were trying to be responsible! The subsequent years were some of the toughest to get through. Becoming completely numb (emotionally) and gaining a lot of weight as I simply fell out of love with myself. I don’t resent you, but I do wish you had been more sympathetic and listened to my request. It was a big deal to even make the appointment.", "amymcilfatrick": "Dear my period, why tho ?", "freida.bal": "Dear my brain, are my cramps even real?! Is all just a big placebo and I only experience cramps because i “think” I’m meant to? Because sometimes I think it’s all made up and I don’t know how to cope with that or even how it makes me feel. Love Freida (even though you’re pretty annoying sometimes)", "juliannakocsis": "Dear period, I've heard horror stories about waking up in a puddle of blood, days or weeks of preliminary pain and suffering, followed by another week of bloodier pain and suffering. And I just wanted to say thank you for being so merciful towards me. A two day average with cramps usually only on the first day and the occasional headache? It seems unfair that this is my experience. Tbh, this makes me think there's something wrong and I'm infertile, which would make me sad, but for now I'm already with having a lighter sentence than other people. So thanks I guess, Jules", "wrenegadesmom": "I recently restarted taking a hormonal oral contraceptive and had my period for 22 days. It was horrible. I’m giving it two more cycles to see if my body will continue to react that way or not, but it seriously sucked. I was not a nice person towards the end of that 22 days. I was tired, sore (especially in my boobs), and just super emotional in an irrational way. I did stop bleeding after the sugar pill week, so hopefully it doesn’t do it again this cycle.", "whyellie": "Dear Menstrual Cup, You have taught me so much about my body and what happens to it during cycles. From the Nuva Ring to Mirena to nothing to my copper coil. I have seen the differences and know the impacts these birth control methods have on my body. AND you eliminate my least favourite part of periods (shudder as we say it, \"Feminine odours\"). - Ellie", "makenziemcl": "dear pms, why do you feel the need to get worse every month?", "kathleenjmckee": "Dear my period mood swings, Why must you exist?? You like to swing by right before my period every month. Yet every time you arrive, I am confused to why I am feeling sudden mood changes. You range from slow burning anger to extreme sensitivity and crying So quickly. I am unsure of what do with them and how to help ease the swings. But do not worry, I work through it and will continue to work through it every month. Lots of love, Kathleen", "erin.ellouise": "Dear cramps.... do bugger off. I don’t need you there as a constant reminder, the excessive bleeding out of my hoo ha is bad enough. Love, Erin xx", "solenestone": "Dear Thinx period panties, thanks for providing an eco-friendly way to manage my period every month, without feeling like I'm wearing diapers.", "kathiamrivera": "Dear period, where are you? Are you lost again? Please stop being a brat, menstrual cup and I are anxiously waiting your arrival. It’s been over two months. I know you only like coming around when I’m on contraceptives but I can’t do that right now. If you make your appearance before I go on my trip that would be fab. Come back, I miss you. You make my body feel like it’s working. See you soon, hopefully. - Kat", "ni.amh.x": "Dear cramps, I’d really rather not be having you and blisters at the same time. While I appreciate you being minor during my classes today, I’d prefer to not being feeling nauseous while sitting curled up under a tree half way through my walk home.", "ebony.lauren": "Dear PCOS: Please can I just have one normal day. Just one. A day without pain, or spots, or a beard, or diarrhea. A day where I'm sure I know what's going on with my body. A day where I can feel feminine. A day where I feel comfortable in my skin and not like a frumpy whale because you won't let me lose weight. A day where I feel sexy, and intercourse won't hurt. Talking of sex, it'd be nice if I could take a contraceptive pill without you making it hard for me and making me try pretty much every pill out there. Could you please let me have a normal, regular period so I can sleep naked and not have to wear sanitary towels every single day just in case it comes. When I'm on, I'd appreciate it if you didn't make it feel like I'm dying every month. I wouldn't even mind the cramp if you kept them to just one week. I'd also appreciate it if you could let me get pregnant without giving me miscarriages - you know how much I long to be a mum. I just want a bit of normality, PCOS, is that really so much to ask from you?", "dont_omg": "Dear menstrual cup, WHY MUST YOU HAVE INDUSTRIAL STRENTH SUCTION? Sincerely, every woman who has been in the bathroom for half an hour pinching the base to no avail. 🤦‍♀️", "jess_cant_find_a_username": "Dear period, what did I do to deserve the way you treat me? One of the first times I had you you tortured me so badly that we almost rushed to the emergency room - who knew you'd strike so hard?? And now, you choose to return solely according to your whims. 56 days? 35 days? Who knows. You leave me hanging all the time. But once you're back, it feels like you're attempting to rip my limbs off. But hey, once you've completely knocked me out basically, you usually leave me unharmed for the remaining days. Thank you for that, I guess. Love, Jess", "farouhabadr": "Dear uterus, I know our relationship has been turbulent from day one and in spite your poor punctuality you have actually been really nice to me, starting to bleed at convenient times and never ruining a mattress for me- that being said many undies have fallen victim to the red stain but that’s fine- you only bleed lightly and for a couple of days which is more than manageable and for most days I am very thankful that you’re the uterus I have x -Love Fay", "vonnypoo": "Dear my life saver, my pill, Cilest. Pretty name! I would like to thank you for really helping me out the last few years. Growing up I had the worst period pains. It would cause me to vomit, pass out and unable to stand for the first 2 days. I was in constant agony. No amount of painkillers really did kill my pain. I went to my very old fashioned doctor twice begging for something but he told me he didn’t believe in the pill so refused to give it to me. Teenage me was naive and thought I wouldn’t get it off anyone then, so I spent my entire teen years dreading that week of pain. That was until I changed my doctor, I also had a boyfriend and wanted to protect myself. So I finally got myself on you my beauty Cilest. You made me a very happy lady as my periods were so light and pain free. And my boobs no longer hurt. And I always know Friday evening my periods will arrive and Tuesday they’ll be done for another month. Thank you my love for all the support you’ve given me. I love you! 💖", "georgia_96_lauren": "Dear My Implant. At first you were great. I got you two hours before an exam and you made me ache a little but all was fine. The healing process was weird, you kept shifting and making me cringe and I didn't really appreciate that. But then my period VANISHED for 3 months and it was SO GOOD. But then we jump to now and I have a period EVERY OTHER WEEK! I'm fatigued all the time because of iron loss. I'm so emotionally unstable because you make my brain go crazy the day before the blood starts which is FAR TOO REGULAR AN OCCURRANCE NOW. You made me attempt to sleep on a stairwell because of the instability. So, my little implant, I thought we were friends and we were onto something good but now I kind of hate you. Oh and please stop giving me awful acne it doesn't help anything", "bamblingsofnaffy": "Dear Period, It was thirteen when I realised you would never come. At the time I did not know how to feel. On one hand I knew there were girls who would say its a good thing. On the whole I was good with knowing my hormones were so imbalance I would never see you in my lifetime but I wont lie there were time I wish you there just so I could feel part of the crowd.", "izziedesu": "Dear PMS, Why do you have to turn me into an ugly, depressed, rude, miserable, pissed off monster every month? I could have had such a pleasant, wonderful day but you would ruin it all over at the end of the day right before I go to sleep and I'd end off on a bad note, feeling depressed and miserable. You are the reason why I could be commuting to work on a train and I suddenly have the urge to bawl my eyes out for no reason. You are the reason why I had the worst week of 2018, which so happens to be my birthday week too. I'm wishing for the day where we used to co-exist alongside each other, instead of overwhelm one another. I'm wishing for the day I can comfortably talk about you with my boyfriend, without snapping and getting pissed off at him at every little petty thing. I know you like to be unstable and unpredictable, but it's hard for me to stay optimistic about my day-to-day life. Love, your emotionally exhausted body, Izzie.", "_.i.am.sherlocked._": "Dear uterus, I know you probably don't like me very much but do you have to torture me with those cramps every month? I would very much appreciate being able to sit up while I'm on my period and not curl up in a ball of pain for days because everything between my thighs and lower back aches. I'd also like to not be so nauseous that I can't eat. Also, dear boobs, you don't have to hurt for over a week before I get my period, I know when it's coming anyways, appreciate the effort but no thanks. Trying to be kind regards, Vivian. PS: Probs to you though, period, for usually starting during the weekends, which may completely ruin my weekends but at least I can sit (more like lie) the worst out without having to go anywhere.", "melizadaniella": "Dear my endometriosis, you've taken a lot from me in the past few years. Social occasions have been ruined or cut short and people decided to stop inviting me to things. But who can blame them really? I've had you for 8 years of my life and I'm only 21, most of my later teenage years were filled with anxiety of if I could go anywhere on my period without soaking through my clothes. That was of course on the days where I could actually leave the house! I missed around 2/3 days of school/college almost every month like clockwork because of you. Doctors didn't listen for the first 6 years, they said I was being dramatic or if I'd tried taking painkillers? I was taking paracetamol and ibuprofen every single day alongside my pill which they had insisted would make me feel better. Apparently I just had difficult periods, that's all. When I started on the injection around 2 years ago, things got much better, my periods stopped and my flare ups were decreasing. The first 6/7 months were bliss, and then everything started again. I still wasn't having a period but found myself bleeding randomly, puking from the pain and the cramps. My stomach would swell until I looked 9 months pregnant. I went back to the doctor and by luck was given a new GP, the first one in all those years who had been understanding. She organised a plethora of tests and examinations to rule out anything else, when they all came back clear I was referred to my local gynecology department at the hospital. It took around 9 months for me to be seen by the consultant and on our first meeting she was convinced that I had endometriosis, something I'd been trying to tell people for years. She put me on the waiting list for a laparoscopy, I cried whilst signing the documents. Not out of fear but out of relief, finally I was being listened to! The next few months whilst I waited for my surgery were difficult health wise and I was convinced my university work was suffering as a result. The night before my surgery, I had the worst pains I've ever experienced and I randomly bled so heavily. It's like you knew I would be getting rid of you! You were throwing one final bitch fit at me. (Continued)", "heidi.anne123": "@shereeashleigh", "andrea_matson": "I just went to your blog and i feel like i could have written it! It feels so amazing to find someone JUST LIKE ME! We both have hypopituitaryism. Although i have a", "ella.gator": "Dear Uterus, You’re being operated on on Friday to figure out why you’re causing me so much pain. Be very afraid 😉 -Ella", "hannahmaynex": "Dear 18 year old me, you’ve done loads for contraception and why couldn’t you have just started on the Depo injection it’s so much easier than remembering to take a small pill? It’s easier to have an injection every 3 months and soon your heavy periods will disappear and the pill made you bloat up after you came off it and now the injection has made your life so much easier and you’ve even overcame a fear of injections, and even better your periods have gone and no more period pains! Love, Hannah", "haleyannebechler": "Dear pill, thank you so much for helping me not be in agonizing pain with heavy flow every month. But why, period, do you cause my legs to feel like they're each a hundred pounds? And why do you make me such a tired, weepy mess? Signed, Haley.", "saltyfingerprints": "My tits literally swell up two cup sizes when I pms. They are so heavy and hard, they hurt, and get hot to the touch. I feel your pain Hannah", "lucyscott888": "Dear Menstrual Cup, when you work, you're all I ever need. When you don't, there is never a betrayal so bitter. Although I do enjoy how safe and cost effective you are. Not yo mention your ability to confuse and scare many people 😊. Lots and LOTS of love, Lucy x", "lelllah": "Dear menstrual cup, I'm actually literally scared of you. I bought you because I figured I'd try you out when everyone's been raving about you. The few times I tried to use you though, left me scared to ever try again. Once, you got stuck up there for so long I started crying in panic while trying to get you out. It's good that you work well for so many others but you're not the thing for me.", "esther.tigrounette": "Dear cup(s) , I've been using you for almost 4 years now and I'm really happy that way. You've allowed me to feel like nothing's going on some days even before I really get the hang of it. You also made me look at what was in you and let me say there were some strange things. No pad would have allowed me to see the chunks and get worried at just how big/long they could be. I feel like I know myself and my body so much better because of you.", "kazziw_88": "**Embarrasing school moment alert** In was sat in school assembly for about 2 hours when I suddenly started heavily and obvs couldn't do much about it... yeah. Nice bloody puddle on the floor!!!", "bilal_nazim": "@aatiqah31", "barnard.phototography": "Dear my period, why? Just WHY?! I really don't like passing out every time you come around. Because of you, I had to go on the mini pill, which is a whole other story...love, Becca x", "lauren.margaret.mh": "Dear Uterus, I really didn’t need you to make my cramps so painful that I couldn’t tell my appendix ruptured a full 4hrs before I sought medical help. I literally went to a lecture with a ruptured appendix because of you. - forever your slave, Lauren xo", "alivegurl": "Omg how perfect! I'm currently on my period and trying out menstrual cup for the first time 🙌", "maya1632": "Dear my regular cycle, I have been so so happy to have you since my first period. It’s convenient, keeps Clue nice and neat, and makes periods as simple as possible. Except when YOU DISAPPEAR for no reason and then my anxiety instantly makes me fear for my life or at least for my uterus when my period is anything more than 3 days late. Going from a near perfect 28 day cycle for 6 years to waiting until my period finally shows up again at day 40 is not fun. So as much as I appreciate you, you freak me out sometimes.", "allythewolfking": "Dear PCOS. You make my periods unbearable, cramps comparable to going in to labour, I can’t get out of the feral position for a week, have to take hard core pain kills, that just take the edge off enough to sleep, I have constant vomiting and runs, flow so heavy I have to wear nights run the clock and change everything hour and a half, and blood still gets on every thing and I never know when it’s coming, at least it’s not very often tho. Lots of love Ally", "samihaigh": "Dear my period, I never thought that I would miss you. Ever since the first time you came into my life, I have resented you. Now I'm on the implant, you don't come to call at all. Maybe one day, I'll get you back, but if I don't have to I suppose you'll stay away. If you do come back, I hope I don't resent you the way I once did.", "ansleus93": "The first time I got my period at 12 I was really embarrassed and felt awkward. But then my pulled out this cute little make-up box full of pads and tampons and nail polish and other presents. It made me feel so much better. Bless my mother", "tall_daisy": "Dear Clue. You are a saint reminding me for three weeks in a row every month to take my pill at 9am. Without you I would have been pregnant a dozen times by now. How I wish I could actually keep up with you and enter the full data to make my experience even better. ((p.s I love that I can add my friends cycles, what a feeling of sisterhood))", "femme_bizarre": "Dear iud, thank you for making me not bleed and basically taking away my cramps, that’s super nice! However I still have pms symptoms like evryone else and it is more frustrating because since I don’t bleed I dont have that “oh that’s why!” Moment when I start my “period” and I feel like I might be depressed but I know it’s just you hormones! Also thanks hormones for making me extreamly sad, giving me high anxiety, worrying my boyfriend and making me horny like alllll the time 🙄👌", "mel.endowarrior": "😚😚😚😚", "something_with_climbing": "Dear menstrual cup, I wish I had you in my life sooner...there wouldn’t have been so many ruined undies and that day in high school wouldn’t have been so embarrassing. Xoxo Lauren", "louison_dessus": "dear uterus, why do you have to bleed so much and make my cramps so awful?? i can’t sleep at night because of you. you really suck (lack of) love, louison", "shethequeenmag": "You are so beautiful! Love this new project idea!! 🙌👏", "chanel_rob1123": "Dear cervix, you have always given me many issues, including causing me crippling pain, not being regular and making me bleed for upto a month or more at a time, and giving such awful fatigue, I've had to be on contraception since I was 14. Now I find that you being tilted has been causing a lot of the sexy time pain and other issues I have. Colour me unimpressed, but I still love you. Xoxo chanely Bean", "hannahrad_cliffe": "I used to have really baaaaad, painnnnnful, longish periods (7 days). I’ve been on the pill and off again. My periods returned shorter (3-4 days) and mostly less painful. Belta.", "_jadelizz": "dear uterus, why must you push against my stomach so much that from the side i look like an alien might pop out at any time? there’s so many better ways to show me i’m bleeding than making me look pregnant, but i get it. you’re just mad that you spent all month preparing for a real pregnancy but it was another month lost. i’m sure the day will come when your work will pay off, but just cut me some slack for now! please!! lots of love, jade💕", "s3zz0": "Dear Period, I should know better by now but could you stop coming back a surprise day after I think you’ve finished. I have nothing against period sex, but surprise period sex is another thing all together. Xxx love Sarah", "its_just_em_": "Dear period, why must you be so showy? I am trying to blend in as a non binary human but you are there for a week every month reminding me of my past. And can you stop changing my boobs, that might help.", "daisy_may_roo": "Dear nightmares....why? Why would hormones make you have nightmares? Aren't you supposed to be evolutionary beneficial? How do vivid, sweat inducing, insane nightmares relate to this at all!? Cramps and tampons aren't enough I now have to awaken at 2 in the morning to the fear of putty like creatures sucking my face off! Great there goes my night! Seriously though, before my period starts one prevailing syptom is intense, realistic dreams. Followed by life like nightmares most of my cycle. Sometimes I am blessed with realistic sexy dreams but sadly it's almost always weird dreams or terrifying nightmares. They are so real and vivid that I wake up covered in sweat and usually turn all the lights on. It's only on my period I seldom have nightmares any other time. Hormones can't just leave my mind alone and attack my body,no. They need to mess with everything. Lol I will say the nightmares are my giveaway symptom, if I have scary dreams ...I'm on period in a few days. Never fails. scare the pregnancy away. Signed, terrified and bleeding", "kaytlynnschehl": "I was raised by all women (my dad left when I was little so my mom, aunt, grandma, etc all took care of me) and no one told me anything about periods. School didn’t explain anything either so I was in the dark for my first two periods before I learned about pads. I was a junior in high school (16 years old) when I figured out ON MY OWN how to use tampons", "revato": "Dear Uterus, why couldn't you be more like my friend's Uterus, with their 2/3 day, low-flow, crampless periods!? What kind of a monstrous hungry child are you planning to bear unto me!? But also I guess thanks for being regular-ish. Love, R.", "danika_oconnor": "I just moved to Bangkok where I learned that they don’t have tampons here. Send help. That’s all.", "carolina.lopezgonzalez": "Dear pads, why are you so uncomfortable? You feel like I am wearing a diaper and no matter how often I change you, I always get as sore as a baboon's ass. Hopefully I have found the love of my life, the menstrual cup. Pads, don't wait for me because I won't be coming back. This is good bye. XOXO Carolina 😘", "whatsmybodydoing": "OMG RUCKUS SECRET PHOTOSHOOTS ARE REVEALED!", "kendyljaclyn": "Dear reproductive system, when will you figure your shit out?! At 17 you made me have to take the pill to have a period, whose hormones contributed to depression, and ridiculous weight fluxuation for the next 4 years. Now 2 years off the pill you're still a confused, irregular mess, but at least the depression is gone! Though you still randomly make me cry for no reason and I can't even begin to guess when a period is coming. Thank goodness for my menstrual cup that's always around and eases every day that I do get a red surprise. Best of luck pulling yourself together, Kendyl", "katelynjoe4": "Dear my cloth pads, Thank you for finally entering my life last year. I've longed for you since I was 14 and my older sister showed me that you existed but my mother was not convinced and so I never got to have you. That is until last year at 22 where I finally got to take the plunge and use you for an entire period. I didn't realize how much you could help my vulva from such disposable irritation, and my hormone and ph balance from being messed with by toxic chemicals making my periods so heavy and painful. And not only do you help with all of that but no more embarrassing ripping sounds echoing throughout the bathroom when my disposable pads needed changed. No more having pads that were too short so I always had leaks. No more blue dyes and itchy plastic. You are so soft and cutely shaped with so many fun patterns to choose from. Like I now own a pad that is 16 inches long for overnights and lovely 4-6inch pads for daily liners and everything in between!! HOW HAVE I NOT DREAMED YOU UP???? YOU ARE A MIRACLE!! NO! YOU ARE JUST FABRIC USED IN THE MOST PRACTICAL WAY!! gah! All the love from my body, mind, and soul. x Katelyn Joe x  ps: even cleaning you is easy!!", "_mishella": "I had the rod inserted in my arm and am on my 4th week of bleeding 🙃🙃🙃", "jasgatti": "Dear period poops, Why are you so annoying!!", "_lmarck_": "Dear Period, It has been 4 whole years since you have been a part of my life, and honestly I’m better off without you. Done are the days when you make me scream and sick from all the pain, and unable to move for two days out of the month. Turns out you aren’t normal so I IUDed the shit out of you. Sure you tried to come between me and my new relationship with the IUD for months after I moved on, but now I could never be happier. Others may judge me for leaving you but I know deserve better than an abusive relationship. So thank god for choice... at least for now. Bye bitch, Laura", "ohdipdonkeydoug": "Dear my body, why do I always think I’ve shit my pants when my period starts??? Or that I’m about to for about 4 days beforehand so I waste a bunch of pads protecting my undies? Also is there a way to stop me from being so depressed for the week before my period starts?? My depression gets so debilitating during this time and I don’t really know why... Sincerely, Freya", "teaforbees": "Dear Period, thank for letting me know I’m not pregnant. But I got the message 76 days ago when you started, kindly bugger off xxx", "shmoolaroo": "Dear cervix, why are you overactive? I was so excited to be pregnant for so many reasons, one of the big ones was no period for at least 9 months! Woo hoo! Know what's worse than periods? Bleeding every day of your pregnancy. All the info I got was you, cervix, were overactive. Hey, off of the treadmill! I don't need the mess and stress.", "veronicamilroy": "Dear period, I was so grateful to you for not showing up till I was 17, but why (WHY?) are your trying to make up for lost time now? Ten years later and you are long and heavy and painful. Can we go back to being 17 and running and dancing and swimming and climbing without any of the worries that my friends had? Because that was ace <3 xo Dear Uterus & Cervix, Can you both please CALM THE FUDGE DOWN and stop cramping quite so much? You're making it pretty hard for me to use that pretty menstrual cup. Dear boobs, Thanks for being so small and for never hurting. You're great <3 <3 Yours until Menopause, Veronica xo", "dancingkouign": "Dear periods and PMS, before I started losing weight you were so fucking awful I would feel like absolut crap 2 weeks a month. Now period you're kinda okay but PMS my man can you stop making me bloated and emotional, it's not fun. Thanks and here's to hoping the last symptoms go away with the rest of my weight. PS: I'm 18 now so let's all agree that 8 years of acne is enough and stop making it come back every month.", "goaway_hdhdh": "Dear period why have I never had cramps or mood swings all my friends had them but why not me even tho I don’t want them I just wanna know Ive only have my period for 3 years and it’s regular now", "tsampika.panaghia": "I bought two menstrual cups to save the environment. I tried a few times, but I judt couldn't insert it correctly. I gave up. I eish I could stop using pads. (I have some fabric pads that I use at home and then wash). I eish I could have 2 days leave from work. Like a premenstrual day for napping and the the first one to suffer in bed. The mensteual day is a right in my country, but I am too ashamed to use it. I don't want to look lazy. I think it should be socially accepted.", "cilla.rhea": "Dear uterus, Just a quick question. Are you actually trying to twist into a tiny ball onto yourself or do you just like making me feel like there's a black hole where you should be? Please stop being so ridiculous. Sincerely, my entire pelvic area but especially my lower back", "merleredbird": "Dear period, why are you so annoying? 3-5 days they said. Some blood they said. Mild pain they said. What they didn’t told me was that that’s just an average. And there I was, with 10 days of bleeding through the thickest pads they had in store and fainting from the cramps. Dear period, you did just hurt too much, that’s why I had to find a way to make you stop. So I hope that someday when I will get off my pill that stops you completely, you will be a bit nicer to me", "__saumya.singh__": "It was in class 8th when I was in my school and I thought that it was some sauce or something that was there on skirt as I don't use to think or care about such things at that time but then my best friend took me to the washroom and told me to do the needful. To hide the stain on my skirt, I wrapped my blazer (winter season) around my waist and everyone in the class was like what have you done, why are you roaming like this and then I got irritated stood in the middle of the class and yelled at the top of my voice that \" IT IS MY BLAZER, MY WAIST, MY WISH, WHAT IS YOUR PROBLEM\" and everyone was stunned. @hannahwitton", "a_miss_aimee": "Dear my period & cramps. WHY? When I was 17, did you start to be so heavy and painful, spending 2-3 days in bed or a hospital bed doubled over and pale from blood loss. Then deciding to try contraception. IMPLANON made you worse, bleeding for 2 months then 2 days off and bleeding for another 3 months... Thank God I got you under control with a combination pill. However the weight gain did nothing for me... 6 years later, back on IMPLANON and it's the best time of my life, barely any bleeding, no cramps, also no sore boobs. 😊 A", "mini_cleeblaettchen": "Dear boobs, thank you for being so small at least you don't hurt. Dear back, you do not have to compensate that by hurting so much. Dear rest of my body, thank you for not becoming fat even though I eat the unhealthiest crap during PMS and my period. Love you, Claire", "mimilucyross": "Dear period, why do you give me a migraine for 5 days straight and make me want to vomit for 5 days straight. You really don’t help with my busy schedule", "underscoreannie": "dear period cramps, why don’t you happen when you’re supposed to? You show up before, during and between my periods. What’s up with that? Lots of hate, Annie x", "abbeygraceharrison": "Dear Endometriosis, why is it that majority of people can have a functioning uterus that doesn't decide to turn on itself and cause pain for majority of their lives?! Why can't you just be a uterus like everyone else!! Please get it together. Love, Abbey x", "blxck_ct": "Dear cervix, why must you always leave the biggest glob of discharge in my knickers during fertile week!? Honestly sometimes I think I’ve wet myself. Please stop so I don’t have to pick up a ball of slime anymore. Love, C.", "sonyamarxdances": "Also ugh why do I have to feel like I am literally being knifed in the ovaries at intervals for like a week and a half before mine starts?", "jaymeeslattery": "Dear 16 year old me...don't worry it does get better. In a few years the doctor will prescribe a magical pill which will give you a break from periods, needing a hot bottle every five minutes, using handwarmers down your jumper in school to help with cramping and you won't get sick every day during that 'time of the month'. Life will be great, in this respect at least, love a 22 year old you x", "_jualves": "Dear menstrual cup, I know we've had our problems in the beginning, I had to buy a new brand, there were several leaks and it took me a while to learn how to use you. But I love you, my life is so much easier now.", "ellie_canavanwhite": "Dear my period, Why did you have to grace me with your presence whilst I was on a sunny beach holiday? Because you make me bleed so much, I have to change my tampon very very regularly and we decided to hire a boat for the day. This meant I had to change my tampon on a tiny boat that had no inside bit, whilst we were anchored by a beach where my parents were swimming around and looking at the fishes. Although I laughed at the whole ordeal, it was really kind of inconvenient. Please don’t do that again. Also, why must you make me feel so ill and give me so much pain that doing anything is such a struggle, even laying down doing nothing? I would appreciate it if you left me alone please. Much love (I don’t really love you), Ellie x", "jessicagluch": "Dear body of mine: Thank you for blessing me with periods that are so easily managable. Thank you for the dream period, really - for the regular, usually barely painful period that never messes with my emotions or the rest of my body, that responds to painkillers if I do need them, that I can prepare for. I haven't gotten the hang of not staining the sheets - or my underwear - yet, but that's the only thing I ever worry about, and I'm so blessed. Keep it up, body. We're doing so well.", "mimionigiri": "My periods were the worst thing ever (a lot of blood loss every day of my period, heavy cramps to the point I was sweating and screaming for 5 out of the 8 days I had them for, nausea, dizziness, constipation,... Not to mention the serious mood swings and irritability the week before!) and then I started taking the pill. I've been taking them for over half a year now and there's no blood loss whatsoever and barely any pain either. Was against taking hormones for so long, but the pill turned out to be a life saver when it came to my period misery! Glad I changed my mind!", "everythingscominguphayley": "Dear uterus, why do you decide to skip an entire cycle when I'm anxious? Do you think that constantly waiting for you to fall out into my pants makes me less stressed? Sincerely, Hayley", "umbreon_caitlin_88": "Dear period, I know we had a rocky start (if you had worked out whether you wanted to be a long or short cycle a bit sooner, that would have been great, thanks) but I'm happy that you seem to be finding your rhythm after 4 or so years, even if you like to surprise me every once in a while by having angry rodents chew on my reproductive organs while a horror movie plays out in the bathroom. Sure, I forget you exist and get surprised every month when I suddenly start crying at cat videos and cute fanart, but we normally part ways fairly easily and you stay away long enough now I can get stuff done in between. One thing though, why oh why do you have to mess with my intestines? I know it's you, and I'm certain you know how unpleasant constipation is when your muscles are already chewed to bits. Stay in your own lane buddy! We might play the \"am I bleeding or am I sweating?\" game more often than I'd like, but you've shown me I'm far stronger than I know by making me push through all these years, exams and lessons while bleeding what would otherwise be considered a serious amount! You remind me what a badass I am, so thanks. Love Caitlin. Also P.S. I don't know what it is you love so much about @hayleyrodgersxx 's house, but it's starting to stop being a funny coincidence and is getting weird. Why must you be this way?", "natashaboylan": "Dear Periods, when I came off my pill I realised how to figure you out, and learned a lot about my own body, when I have sore boobs, your due next week. When I have a random mood swing, your close by. I now understand my emotions and can tell when I am ovualting 👀 (this is good cos im not ready for kids) but it's safe to say I much prefer you without using any sort of pill or implant, you didn't seem to like them very much. But I'm glad we have a better relationship. Love , Natasha x", "hannah_.stark": "Dear Ibuprofen, thank you for allowing me to function while I'm on my period. Without you the horrible back pain and the cramping would make me stay in bed for the first two days of my period. But because you are there for me in times of need, I have never missed school (except of P.E or just called sports in Germany) or missed out on fun activities because of my period. Plus you help with my many migraines.", "mrsvalkiria": "I don't hear a lot of ovulation pain!!! Between my period week, the pms week, the ovulation week and the previous week to those I can't live in peace 😩 I get this feeling of needing to pee all the time when I'm ovulation and I'm bloated all the damn time is horrible.", "gizemkalacc": "Dear energy and willingness to live where the heck have you gone? I have a general assembly meeting a company establishment and a hearing at criminal court this week i cant do this while im constantly dizzy tired and feeling nauseous", "mandalouise13": "Number one most important thing to share would be that if you have pain that stops you from going to school/work this is NOT normal! See a doctor! You could have a condition like endometriosis and the earlier you start detecting this the better. It takes 7 years in average for women to be diagnosed with this awful disease and that's often because we are told period pain is normal - if panadol and over counter drugs doesn't stop the pain, it's not normal :(", "cukrows.ka": "dear pms, please shut up. when combined with anxiety, you turn my life into hell, making me feel even more scared and alone, and also angry with people who have nothing to do with you. you even had me break up a friendship that lasted for seven years. leave me alone. I have enough trouble with my emotions already. ps. thank god for the clue app - that way at least I know when this shitty time is approaching.", "flaherty_aisling": "Dear uterus I know it seems fun to have a bouncy castle inside of me and to jump around when pe is on or when I'm around attractive people but can you please stop running my life all time around because I can just about deal with it on my actual period than all the symptoms except the blood follow me around", "icanbelieveitsbutterfield": "Where is that blouse from? (Not related to my period but it’s a cute blouse and you also have big boobs so I trust your fashion judgments).", "rebeccarmeier": "Dear Period, Thank you for making me miss the only college class I have ever been absent from. I wish you would calm down and let me, y’know, have the strength to get out of the bath after I’ve been lying in it for 2 hours, but maybe we can work on that. Love, Becca 💛", "chloe_sophia_mcdade": "Dear PMS, kindly give me back the countless time you have wasted making me feel depressed, angry, sad and lonely. Please also take back the rivers of tears you made me cry and the look of confusion on people's faces when I say I'm this sad because of PMS. Shout out to the pill for making my PMS worse! But at least the pill made my periods regular, less painful and shorter. I'm still trying to lose all the weight the pill made me gain! The ever changing libido was confusing too! But now I'm off the pill my periods are irregular but my PMS has gotten a lot better! Love/hate, Chloe x", "beccaoxlade": "@georgeyonge ❤️❤️❤️❤️", "valeriam.s": "Dear pms, i just want to know why do you take my anxiety and make it ten times worse one week and a half before my period start? Also, wtf with me being super sleepy and tired that week too?!!! I think i need to get some suplement to make that time easier for me. Anyway, period thanks for make me feel alive and that i have a healthy body, you remind me how much i want to be a mom in the future❤", "nicolemchugh_": "Dear my uterus, why oh why do you feel like stabbing my to death every month, why do you feel like it cool for you to just knock me down a peg or five for two whole days straight, why do you make my sciatica 10 times worse when I really don’t need that extra agro, why do you make me hate being a woman and why can’t you be like those uterus’s that are happy out and don’t get angry and painful, xoxo Nico", "juliabroskie": "Before going on hormonal birth control my period was out of control. And I thought it was normal! I would skip for 8 months then have it for two weeks straight. Or have it three weeks on and off. And sooo heavy like jumbo tampon + maxi pad and bleed through both heavy. I passed out, threw up. I can’t believe the lack of education I had that I thought this was normal and didn’t go to a doctor for years. These topics need to be talked about every day. And not just between people with uteruses.", "chrisaa00": "Dear birth control, Why do you work wonders for ending my period troubles yet make me so manic and anxious? I loved the fact that I could go months without a single drop of blood, debilitating cramps and back pain all topped with intense PMS, however, on you I feel like my anxiety goes a-wall and i’m out of control. I just would love a simple balance. Off you now and I feel so much better. The thing is, mother nature is yet to return after a month passing. I’m just praying that it’ll all return a little kinder. Love, chrisa x", "lemonysherbert": "Dear my menstrual cup,", "earthtoorla": "Dear period, why do you give me THE SHITS the day before you start and the day you arrive. Not cool, just stick to making me bleed thanks 👍🏼", "celesamuel": "My acné was so bad i try different things but i had to go back to the pill after a year off 😣", "legsxmas": "Dear hormones, why am I crying watching the finale of a show I've never watched before?", "klaristes": "Dear my period, why are you so confusing? I hate you the first two days you're there, because without painkillers you make me feel like dying. But when I survived those, I am so happy, because you also somehow make me proud to be a woman! Also why do you always visit me, when I'm on holiday? Not cool! P.S. thank God for menstrual cups!!!", "defeat.the.sleep": "Dear Body, why 2 weeks before I come do you give me major flare ups in my back condition? What did I do to deserve one week a month of minor pain? Love Beth", "juanita_c02": "Dear cramps, why do you always have to ruin the best day? The strongest paracetamol or ibuprofen makes no impact as you make my mood deteriorate significantly. You always make me get so sick that I can feel my sore muscles the day after. We used to have a good relationship but now, nope. ☹️", "geeky_zebra": "Dear Period Pain, WHY do you still rear your ugly head every month even though I haven't had a period since I first got the implant 6 years ago? You were the worst part of my monthly cycle and your the only part that the implant hasnt stopped!", "luisa.hempel": "My dear short cycle, I guess you taking only three to three and a half weeks is a good thing once I want to start getting pregnant. It probably means that I have more fertile days in a month than the average menstruating person. But you gave me a hard time in my teenage years! First I had to find out about you in the first place while being really scared that bleeding again only two weeks after my last period finished meant that I must be bleeding for another reason. A bad reason probably and OH MY GOD I'M GONNA DIE! 😭 I had to find out that there are not only regular (4 weeks) and irregular cycles but also short regular and long regular cycles. But the knowledge about it only helped a little bit. I was still frustrated with you. I felt like I'm almost always on my period. I constantly felt uncomfortable. PE class was a struggle as their was a 50:50 chance on how well I could perform. Yeah, I really didn't like you. I went on the pill when I met the love of my life 5 years ago so I forgot about you pretty much until today. The next time we'll encounter each other will probably mean that I am ready to start a family. So today I want to apologize for disliking you. I was just too young to appreciate you and embrace your usefulness. Simcerely yours, Luisa ❤", "zeexjune": "Dear vagina, thank you for being healthy.", "abisaysblog": "Dear Past Ovaries, I would have loved if you just slowed down a little bit. JUST a little bit, because damn. You made high school super tricky 80% of the time. Many thanks, Abi", "wheezy_lsc": "Dear pill- thanks for the glory of not getting pregnant. Quick question, is it possible to do so without a detox day of anxiety, eating, worthlessness, nerves and exhaustion? Thanks.", "worldofjosien": "Dear period, thank you for letting me know I'm not pregnant! I'm happy you do that, even though the pain and PMS could be turned down a notch, yespleasethnx. But we got help for that so now I just need you to cooperate a bit more!", "market.sestakova": "Dear period, I would like to make peace with you, because you're natural part of my life and one wise woman told me that I should love you (and my body) and not hate you. I really would love to do just that and I'm really trying but you make it so damn hard. Could we please cooperate? Could you please try being a bit more predictable and even? As in, not being a random mix of months where the stomach and back pain is bearable and months where I'm cursing you out with everything I have, which is not much in those moments because I'm trying to find a position in which the pain is at least kind of bearable and trying not to throw up. I know that these things get better after the first day if I just lay in bed and do nothing, but that's not realistic every month, you know. I'm trying to do just that but sometimes I have to go to school, work or something, you know? And don't let me start on the diarrhea. Or the stomach pains during 4-5 days before you arrive on the scene with a bang. Okay, I'll stop complaining now. Seriously, I want us to cooperate. Please.", "rrachaelanne": "Dear my uterus, WHY DO YOU HAVE TO HURT SO MUCH??? I get cramps when I ovulate, just before my period, during it and just after and it's awful!! Plus I almost always only get reallyyyy bad back pain (to the point where I can barely move, and where I've fainted and nearly fainted multiple times) rather than stomach cramps and I still have no idea why!! And really bad headaches!! And painful boobs!! And I can't act rationally towards anything for that entire time and instead turn into a sobbing mess!! However, even though all that sucks, it's in a way something I'm very happy and incredibly greatful to experience because it means that I have the amazing ability to have children one day and that's awesome :) love, Rachael x", "anxiuoslylethargic": "Dear PMS, why do you exist ? You can’t possibly be evolutionarily useful, can you ?", "madisonkemp1995": "Not period related but.... Dear cooper IUD, why did you cause such pain when you were there to ‘help’? I got the copper iud and from about 2 minutes after it being place I was in excruciating pain. Intense cramps everyday that would take my breath away and cause me to drop to drop to my knees. I had a similar experience with it affecting my bowels too. I would get horrendous bum spasms. I was put on IBS medication and had some tests and ultrasounds and doctors denied it had anything to do with this contraption. I got it removed 12 months later, and not sooner, because apparently I hadn’t ‘stuck at it’ for long enough. 12 months of excruciating pain, spasm and heavy heavy bleeding! I knew what my body was telling me.", "_.maddy_hunter._": "Dear period, thanks for arriving the day I had my appendix out. I wouldn’t’ve minded if you’d given warning or actually come on time (you were a week early dickhead). At least I couldn’t tell I had cramps with the morphine and post surgery local anaesthetic 😊. Thank you to the nurses who laughed and cringed with me when I physically couldn’t get any underwear on or move to the loo. I’ll never forget you, period of September 2018.", "tiin.a": "Dear PCOS, why do you make my period half a year late every time just to then give me THE WORST most unbearable cramps? Thanks, but no thanks", "claire.lacey.96": "Dear period, why must you flow so heavy and occasionally come late.", "space_is_fun_": "Dear period, i hate you. You make me hate my body even more than i normally do. I cannot wait until i go on t and stop having you", "cupcakesofie97": "Dear my period, why did you disappear for months making me bleed little to nothing and then you decide to take an 180 turn and make me bleed SO heavily? (Also thanks for making me bleed through my pants in H&M, it’s always a good time when you have to change all clothes below your bellybutton in a tiny stall of a public bathroom)", "anjelliica": "Dear mooncup, I love you. I know we don’t see each other very often since my periods show up like twice a year but you changed my life. Sorry I swore at you that first time but you were a steep learning curve and the amount of blood on my bathroom floor was quite a shock. But we’re good now, I know you’ve got my back ❤️", "ethanisaac01": "Dear \"shark week\", I'd been dealing with you well for the couple of years before I discovered I'm trans and that's when our relationship changed. I still accept you as a perfectly normal thing for me to experience and will probably miss you once I've started T but you can be so annoying at times that sometimes I wish you didn't exist. I know its weird for a trans guy to be completely fine with you but I guess that's just me being as quirky as ever! You must have known I'm trans long before I did because your pains have never been as bad as I thought they would be, so thank you for being so kind to my sensitive soul. At least now I have experience of dealing with you I'll be able to help my future partner when she gets her period! Always and forever, Ash", "theedwardianwriter": "Dear pill, bless you. You changed what used to be a completely unpredictable cycle, involving two weeks of sore boobs, one week of blood, and cramps so bad I couldn’t always go to sleep. You’ve made it so that I can walk around on my period with only minimal wincing and no painkillers, and you’ve made it so that I can actually predict when I’m going to have my period. Even better, I don’t need to prepare for a tsunami of blood, rather a more gentle wave. The first time I had a period with you, I was so shocked that it came when expected and the whole box of pads and tampons I had taken with me (just in case) on a trip weren’t even necessary. You make my life so much more liveable and I’d rather not think of parting with you anytime soon.", "ellieorjerry": "Dear cramps which are so bad they keep me bed ridden for a week. You’re the reason I now have surgery scars, and the reason I have to take a small, but powerful hormonal contraceptive 365 days a year because otherwise I can’t have a life. Love Ellie 💁🏻‍♀️", "crazyhairedgirl": "Dear menstrual cup, thank you for years of guilt free (and free-free) periods. And allowing me to go full days without worrying about changing you. And for making me get in touch with my period more. Love you xx", "_annabelsweeney": "dear my irregular period, please can you understand that normal people do not miss three or four periods, have a v heave one for a solid week, and then not have one again until you god damn please. sincerely, my period app", "papaimss": "dear periods, i hate that i got you while i was in school and my anxiety prevented me from asking to go to the toilet. i hate that once i literally had to write on my hand \"i need to go to the toilet cos period\" bevause i was too embarrassed to ask. i hate that you sent me home from school because i had to chance my tights, youre the reason im on the depo injection and it was the best decision ever, thank you !", "m.artha.s": "Dear tampon, it started out so well and you were so convenient. It has now been a few periods and I have no issue inserting you, but as soon as you're as far as you can go I get crippling cramps for two or three minutes. I have no idea what you are doing to me but it doesn't feel right. No one online seems to have had a similar experience. I know I could dump you for pads but they are just so uncomfortable. So please sort yourself out, love Martha x", "ellaporter13": "Dear My Cramps, I'm just writing to say that I don't miss you at all. I don't miss the excruciating pain, the nausea, the light headedness, the dry-heaving, and the almost fainting. I don't miss the days of turning my heating pad to max and putting it on my stomach, thankful if it was just a little too hot because the pain from the heat distracted from the pain from YOU. I don't miss the days where I took painkillers only to have nothing happen. I don't miss spending an entire day incapacitated, curled up in bed and waiting for you to go away. I'm so thankful that the lovely NuvaRing came into my life so I don't have to deal with your shit anymore. Sometimes you still try to stick your nose in, but I can overcome you now. I'm just making sure you know how much I'm glad you're gone and I hope you never return. 🙂💁‍♀️🖕💅💋", "velvetshock": "Dear my last period, I will never be able to explain why you were heavy and lasted two whole weeks. I still don’t know why the blood was so bright red, or why you were so painful. At least our friend the menstrual cup kept you under control. I’m glad that you’re over because I hate having random cravings that I’m unable to satisfy. Now you’re gone I hope that the next period isn’t like you because as much as we had some good times, I’m better now with out you. It wasn’t me, it was definitely you. Thank you for the good times and I was happy when you came into my life but I’m better off now without you. I will remember you but I feel I’m over you. Love from Heather x", "noah.j.ones": "Dear My Testosterone: im trans. I’ve been taking you for almost four months. WHY DO YOU STILL MAKE ME SHED BUCKET LOADS???", "sso.sarawindfield": "I honestly have no comment other than when I get my period I turn lowkey suicidal for a month.", "karlie__h": "Dear period, So where’d you go? You were gone for a whole year, and now that I’m on the pill you decide to come back?? Like why do I need hormones and stuff to make you appear? I’m a woman you should just be there!!", "shadow_wanderers": "Dear period, go away already. When ever you come around I’m moody, feel fat, eat way more sugar then I need... also I’m not a girl I’m a 17 year old boy that can’t get out of bed 4 days a month because I’m in so much pain. I did the hole birth control thing for about 2 years it didn’t work it only made me get more cysts, I stoped because I had my T consult... I got approved but December will be one year since then and I still haven’t started..... I wish you would just go away already", "elizabethstarx": "Dear wee pre-period, thanks for letting me know that my period is coming by burning the day before and giving me the urge to go to the loo far too often. Cheers, elizabeth", "_jessloveislove": "Dear period , why do you have to be so annoying and never come on the same sort of time each month and just surprise me a day before I start college for the first time and also why do you have to be so painful one month but not as painful the next months and thank you for ruining my favourite onsie when I first had you", "nati_dutzi": "Dear period cramps, FUCK OFF! Yours truly, Natalie", "rebeccaabrennen": "dear my body, thank u for being so weird & for working even when i don’t wanna<33 love, becca", "peeerola": "Dear period, we've known each other for a while now, I guess it's been approximately ten years. I have learnt to appreciate you over time, you've always been somewhat regular - yes, you are painful sometimes, and a little uncomfortable, you put me into some really embarrassing situations and you ruined a couple of panties... But I loved seeing my body work the way it does naturally and being able to monitor the changes it goes through each month, I miss it now that I am on hormonal contraception. Love, a 23 year old girl", "missele12": "Dear Post Stoma body, WHY do I now suddenly have crippling period pain a whole day before I bleed when I did not before?! Please kindly bog off. Ele", "caleykid": "Dear period, do you have to cause me so much pain that my legs occasionally give way, I can barely move and I have to dose myself up on strong painkillers once a month that have their own side effects. You make me feel unlike me for a few days which is nasty. If you could calm your shit for a little while that would be great. Love Laura x", "katiesoddsocks": "Dear uterus, I appreciate that you’re on time and everything, but WHY does it feel like an ACTUAL EXPLOSION is occurring internally every month??? Paracetamol and hot water bottles just don’t cut it, and frankly it’s unnecessary. Also, I resent you for causing period shits. Yep, I said it. I went there. I don’t even want children, though every one older than me deems it necessary to tell me that I’ll change my mind, so really, all of this is for nothing. Thanks a bunch, Katie", "oesterzwamsnack": "Dear coil, thank you so much for sparing me the annoyance of bleeding so much. Oh, and thank you for making sure I won’t get pregnant any time soon. Not that I’m not already making sure myself by only having sex with a woman, but okay. There is a negative side effect to you, though. You might not make me bleed, but you are not fully stopping my cycle. You are taking from me the satisfaction of going “oh THAT’S why!!!” after two days of being sensitive and overreacting to everything. But that’s all right, I’ll get through that. Mostly I’m pretty happy with you. Love, Eva.", "foxytravelsuk": "Dead period, we may have known each other for 16 years (thanks btw for arriving the same week my mum was in hospital, so my ‘you’re becoming a woman’ talk had to come from my grandmother) but why the hell do I forget, without fail, that you make me cry uncontrollably for an entire day exactly 4 days before you rear your head? Every time I think I’m being emotional for no reason, then BOOM! There you are! See you soon! Elle", "faulesb": "Dear period cramps, i hate you. You give me anxiety. I hate that I'm anxious about getting my period, because I never know how bad the pain is going to be. And for some reason I always get my period when something important is happening on that day. For example my brother's wedding. Remember when the pain was so strong my arms and legs started tingling and I couldn't move normally, so my parents called an ambulance? Turns out when you breath too much your limbs start doing that until you pass out. Love it! Doesn't make me anxious at all! Also why must you fight against painkillers? What has paracetamol ever done to you?? Or all the other pills, that people have told me help with strong pain? Let them do their job!! I'm afraid to be home alone when the period starts and the pain is so strong I can't walk! If I wasn't so afraid of the side effects of the pill I would have tackled you to the ground ages ago, you lucky bastard!!! But thanks for not appearing two years ago in Berlin when I went to that festival, I guess. You could have ruined the whole trip, but somehow you didn't. - Stephanie", "lovelykuhn": "Dear period, Did you have to first come when I was on the high bar during gymnastics class in 5th grade? The red head dreamboat liked me until he saw my white shorts go red above him. Which also happened to be the same colour my face turned. Why did you not want to go away? I tried everything, but you kept coming back with your embarrassing victory stains and pains. I am so glad I found your destroyer. I don’t miss you at all. Love Sarah and Mirena", "abbeyginger": "Dear Me: It happens every month. Since you've been on the pill for over a decade, it's happened every month LIKE CLOCKWORK, for eleven years. So, why are you always shocked and confused by your crazy PMS symptoms? Being hyper-sensitive, baby-crazy, anxious, furious, and then deeply depressed in \"random\" spurts isn't what's happening to you. It's your cycle. Track this nonsense so you stop scaring yourself and your husband with your ups and downs. Sincerely, The Saner and Not PMS-ing Version of Me", "kuhu.jpg": "Dear period, thank you for being so perfectly irregular. Each month you seem to know exactly when I can afford to have you and when I can't, you run circles around every event and big thing I have lined up for the month and come only when I have nothing to do so I can handle you with care. You even know what days to go hard and what days to take it easy on me, and you never give me any pain. Dear period, thank you for being possibly the best period ever. I still crib about you a lot because well, I'm only human, but I know a blessing when I see one.", "ctlnbrynt": "Dear uterus, we have always been in a love hate relationship. We have been on this journey since I was 14 and we still haven't gotte it quite right. You have ruined so many pairs of underwear with your unexpected surprises. You have helped me discover the menstrual cup which is the only product for me now. You have also made me writhe in pain from cramps. But overall you have done your job. I'm lucky to say you haven't been too bad over these last 11 years. You're efficient, organized and overall pretty interesting. So thanks dear friend. ❤", "kimmstuart": "dear anyone who can manage to use tampons or menstrual cups, how do you MANAGE to stuck that thing into your VAGINAS??? because i just CAN'T. it's so much pain for me, it's AWFUL and I HATE IT. please send help.", "shreyashewde": "Dear menstrual cups, why are you unavailable in the country I live in?! I could technically buy you online but that's super expensive and I'm not sure whether you'll be the right option for me so I'm afraid to spend so much. Please make an appearance at local shops! Love, Shreya~", "this_wayfarer": "Dear period, you are still not forgiven for the day I almost passed out in the shower and had to curl up in a ball for 20 minutes before I could stand up and get on with things. It's only happened once but I'd rather you never did it again. Fingers crossed for a more manageable experience in the future.", "jillian_patience": "Dear combined pill, I never thought I would say this, but thank you for helping me alleviate my PMS and for crushing those cramps that often made me spend time with my head over the toilet. I am extremely grateful, and plus side now I do not have to stress about pregnancy (no more ghost pregnancy symptoms). Thanks to mytherapy and clue for keeping me in track. With love Jill x", "jesca.hardy": "Dear period, its been a while. After getting the contraceptive implant i understand you are mad but to keep sending intense cramps even when you dont show is a bit of a bummer. Cheers, a disgruntled and heat-pack loving Jess x", "zhermz": "Dear masculinity, Hey. It's me again. Can we talk about something real quick? Cool. I wanted to bring up the fact that yea, it's a bit blurry on what you are or look like, but can we get rid of your social stigmas? I've been struggling with how to overcome societal pressures on what a \"man\" should be like. If I want to self care, then I shouldn't be limited to buying products labeled \"Men's\". Self-care is overly feminized by society, and damnit if I wanna wear a charcoal mask at 11pm after I've used my toner, used my derma-roller, applied my vitamin C serum, WITHOUT looking too\"\"\"\"\"girly\"\"\"\"\" (whatever that even means), then I will! If I want to read a book called Doing It! by Hannah Witton on sexual positivity without feeling like my construction working co-workers will think oddly of me (as they continue to ramble on how they [\"read the bible\"] with their wife so hard last night), then I should be able to! If I like wine over whiskey, so fucking what? Does it make me less of a man? The list goes on and on, and I feel like since the world is evolving, why can't you. Sincerely, Zack.", "digitaldestined": "Cool outfit!", "maygpickles": "Dear cycle, for once in your 30 day lifespan be on time and period don't screw me over with that I'm finished- jk, I'll come back another day?!", "mebejulianna": "My periods have never been normal. They’re heavy and have caused me severe anaemia and severe pain. I am currently fighting for a diagnosis trying to figure out what is wrong with my uterus and ovaries. I’m about to have my third surgery, this being the third in about a year and a half. Doctors thought my pain was fabricated or I was being too sensitive. I don’t feel like doctors really know much about our reproductive systems, because no one can find an answer. And I know I’m not the only one!", "erin_templ": "Dear period, why in the world did you decide to last for ten days and doctors can't find the reason? The hell, dude?", "reallyalex98": "Dear hormonal IUD. You have taken away my period (thanks for that, by the way), but you also have a lovely way of simultaneously allowing me to not think about being pregnant but also increasing my anxiety that I am experiencing an extremely rare ectopic pregnancy when I get cramps without bleeding randomly throughout the month. Love, me ♥️", "marleycambridge": "Dear My Period, why are you two weeks long and only give me a week of relief from you!? Well, i know why (i have endometriosis) bUT WHY MUST YOU BE THIS WAY! Makes me feel so drained and tired and blugh! Kind Regards, a girl who's SICK of cramps", "mollycraggs": "Dear PMDD, why are you the bane of my life? I basically live two lives, my happy, normal self & my PMDD depressed, semi-functional self. You also make me sensitive to hormones, so I cannot take hormonal birth control. Yay hormones.", "evelynbec": "Dear my period, do you enjoy leaving me bed bound for days every month? Did you find joy when I fainted and fell down the stairs due to the pain you gave me? Why must you leave my left leg paralysed? But then again, I must thank you for the overwhelming relief I get when you appear. Love? Becca", "_justahufflepuffnerd": "Dear my body: At sixteen years old, I still haven't started yet. I have another blood test in a few weeks to test my hormone levels, and a gynaecology appointment coming up to check my development and bone age. There is a slight possibility that I may be infertile. I want you to know that whether this turns out to be true or not, I love you and I really hope anyone else who experiences this loves themselves two. Love, L.", "notavakola": "@hannahwitton I FELT that last pic. Literally felt it... I am currently going through it.. 😂😂", "amberamzy": "Dear Periods, when you first arrived I hated you so much, I used to wish you wouldn't come and spend hours googling ways to make you go away faster! But now you've been around for a good few years I think I can handle you much better when you come visiting each month! I still don't always appreciate your extended stay but I do appreciate the relief of knowing I ain't pregnant so ta! I have to say the pill has made you much more manageable, since I'm always prepared for your arrival, but more so I always know when you are leaving 😉 you might be an inconvenience as times, but hey, none of us are perfect! (I've been warned however that you become much more annoying as I get older, so be grateful I'm being as kind as this today!) Much Love, just another Lass! X", "slayerofvampyres": "Dear my pill, why do you take away my cramps but give me flow so bad that it physically pushed my tampon out in the parking lot of a Panic! At The Disco concert? You ruined my shorts, my underwear, the towel that I sat on to clean it up, and the backseat of my car until I was able to wipe it down. I would abandon you if not for the sweet sweet relief from cramps and fever symptoms. Here’s hoping it will improve.", "megscorner": "Dear period, thanks for only showing up every other months and staying for not more than three days. Although I occasionally do miss you, cuz ya know... pregnancy scares. It's cool tho, xo M.", "irie.ewers": "Dear Semen-Allergy, It seems like body has forsaken me. Just when I thought Mirena had given me full autonomy over my sex life, you appear. Out of nowhere. Or so it seemed. Having severe allergies, including eczema all over my body, has been a consistent battle for years. Who would have thought this sensitivity translated all the way to my vagina and into my inner core? I got Mirena to protect myself from unwanted pregnancies and to finally take the plunge...full on ejaculation into my body. Everything else with this coil has positively affected my life, and yet you, Mr. Semen-Allergy seem to have come out of nowhere. Are the two linked? Will this allergy continue forever? When I wanted a passionate BURNING LOVE, You were not the thing that came to mind. 🔥 The one positive thing I will say in this entire situation is that I have a medical recommendation to never wear underwear, to let my lady parts breathe. Thanks for putting a huge damper on my sex life, Semen Allergy. You da best.😘", "walwanisp": "We,all o", "eseaereaeseua": "When I was on the pill, I used to complain A LOT about pains and all that stuff. I got off the pill and got the coil. NOW I know what real period pains, cramps, PMS and bleeding are. I hadn't had a real period in three years. I wasn't prepared.", "samchilds724": "Dear period, thank you for turning up every two weeks and keeping me up at 3 in the morning with your cramping and pain that makes me sick and faint and also thank you for bringing along your best bud pms just to make me moody with aching boobs and constantly exhausted. Hopefully you’ll learn to sort you s**t out sooner or later. Lots of love Sam", "orla.l.w": "Dear my period I have had you only a year and a half and you can be a bitch but at least your not that bad I would also just like to say thank for turning up whenever you feel like it instead of getting into a nice little cycle. You give also me cramps,mood swings and who knows what else however I just want to say I don’t hate you from the person who has to deal with you, Orla p.s I’m still to scared to use a tampon although I have had my period for 1 and a half years", "torshabhattacharya": "Dear PMDD, thanks for absolutely ruining a whole week before my period starts. You are the reason I cried hysterically for 3 hours straight because I did not find a new dress for my birthday. Also for my rage and spells of depression that I have to endure since I was 11. It has literally been 14 years. Thanks for nothing. 🖕", "aliciajadeb": "Dear period, Thanks for letting me know I’m not pregnant and all but is all the pain necessary? Do you really need to make my mental health even worse and put me in so much pain I can’t stand up? Dear menstrual cup, I’m sorry I haven’t tried you again but the FUCKING CONTRACTIONS you gave me sort of scarred me for life so you’re staying in your box for now. And finally, Dear mini pill, You have made my life a lot easier so thank you. Love Alicia xx", "chicadragon": "Dear menstrual cup, you are a godsend. I have never been more scared than when I pulled out a tampon that had been inside of me for three days. Also, dear body, thank you for taking all the crap I put you through, you are a hero. This is what motivated me to buy a menstrual cup, but I didn’t realise what a privilege you were until I lived in Bolivia for two months. Two weeks after getting there, my period came with the usual cramps, exhaustion, hunger and general I-want-to-die-soon feelings. I used to walk for half an hour to get to my work at a special education school, but I couldn’t those days, and I was fortunate enough to have the money to take the bus; so many teachers got to school close to fainting because they had to come in from the other side of the city while basically bleeding out. I had the privilege of going to the bathroom every hour to empty my cup, I had the privilege to be popping pills left and right to numb the stabbing pain, I had the privilege to eat whatever and how ever much I wanted because I was ravenous, and above all I had the privilege to own a menstrual cup that helped me manage my extremely heavy period when there was no light and no water in that tiny, dirty bathroom, and feel clean and healthy. Sharing my experience with so many women who just had to woman up through their period with no help made me feel so, so very lucky. I love you, menstrual cup, for helping me and the environment, and I just wish you weren’t an unattainable privilege for so many people.", "forsythkaitlyn": "Dear uterus, thanks for the endometriosis pain that was so bad that I now have an IUD to shut you up. You’re the best.", "abbiehopesmith": "Dear hypermenorreah  Why do you make me lose 250ml of blood a month. Why do you make me bleed for 25 days without stopping. Why do you like to leak every 45mins so I have to wake up in the night. It’s been 3 years. Get it together mate. I’m only 14. Leave me alone. Let me go to sleepovers or parties or trips with my friends. Stop. You never let me sleep, faint every 2mins and the bloomin doctor doesn’t care. Just leave me alone mate", "betsy_goodfellow": "Dear irregular periods, What did I do to deserve you?! You’re so annoying. You’ve ruined so many bed sheets and so many knickers. You’re the most annoying thing in my life. You make me vomit, get spotty and grumpy. And I want you to stop, well stop or at least become regular because at least I’d know where we’re at. You’re making me consider going on the pill but I’m a little scared of the side effects, so I really don’t know what I’m gonna do. Anyway, irregular periods, you’re very inconvenient and I wish you would chill Love Betsy x Ps: please stop ruining my favourite knickers it’s really annoying when you trash my pretty pants rather than the old ones I only wear when I’m on", "emma.eliza_": "Dear PMS please stop making me eat everything in sight the day before I get my period. Also periods in general stop screwing over my friends who have it way worse than me", "h_u_n_g_r_y__": "Dear exams, why do you have to take so long that I leaked onto the chair? love chloe", "d.mi.marie": "Dear PMS, please stop making me feel like I'm still in the depths of my depression and contemplating whether to take my own life or not on some days. I know it's just you and I know that Thyroid is making our life extra difficult, but STAHP! You do realize that we are actually fine, right?", "bridie.cox": "Dear period, why have you refused to settle back into our old reliable cycle since I broke up with my last partner? It was TWO YEARS AGO DUDE we’re still best friends with her, it’s okay!", "mannerschnitte": "dear menstrual cup, thank you for showing me that i bleed a lot more than i thought i did 💫", "thatyamperson": "Dear PCOS, Do I even have you??? Every doctor says something different, nothing matches up, test after test and yet the opinions are split, and they just keep saying I don’t need to worry about it for now anyways, I’ll need to worry about it when I want kids, but after nearly 10 years I think I deserve an answer. Very unkind regards, an annoyed 24 year old.", "x.katieriley": "One time I was on my period and my boobs really hurt and my friends little brother whacked my boob accidentally whilst we were on a walk up a big hill and I fell on the floor (which were rocks and mud) and cried.", "kylaasutherland": "Dear my PCOS, Why have you made my life so complicated? I’ve never felt like a “normal” girl since I don’t have a cycle that is even remotely normal. Dealing with you hasn’t been easy, especially since I can’t take estrogen based birth control due to my other conduction “Lupus Anti-coagulant” aka “Anti-phospholipid Syndrome”. Since puberty you’ve given me lovely symptoms such as cysts on my ovaries bursting and body hair to deal with. After being diagnosed with Ulcerative Colitis and then having my colon removed I have to admit you’ve taken a backseat. Who knows what we’ll deal with next? Love, Kyla", "amyskye_": "Dear the implant, I would just like to thank you for not getting me pregnant for about a year. However, I do have some questions for you. I'm not sure why you decided that for an entire year you'd stop my periods and then give them to me all in one go? 😭 My implant work amazingly for a year and the one day I got my period and didn't stop bleeding for 6 months. Because of this I became anemic, I was then prescribed something for the pain (I had very bad cramping) and my body reacted badly to it and my kidneys began to fail. BUT I would like to point out that I should have gone to the doctors much sooner😂 I am all well and good now, and my mini pill is doing me well x", "daisyb4by": "Dear periods, you were chill and regular from the off at 13, especially after going on the pill at 16. My only query is when I came off the pill, at 22, where the fuck did you go for the first 7 months after? Never been more stressed about my body than during that time. Sincerely, me (still 22)", "scarlettbayesie": "I had my 10 year anniversary of having period this month's and it was honestly the worst one (heaviest, most painful, felt the shittest) I've had to date. I had a copper coil fitted 3 years ago and since then the volume of blood that has some out of me couple probably fill a pool...not that you'd want to swim in it 😵", "natsantam": "Dear kind-of-regular cycle: when we were young and first knowing each other, you almost always came to visit me every 34 days, and it was great seeing you, because you also gave me the same signs of your arrival. Now it has become more difficult to prepare to recieve you, because you arrive anytime from 28 to 47 days every month and type of discharge isn't as evident as before, and it is a bit more of an stressful event. You've been doing this for four years now. I know we grew so much in every sense of the word since we met each other at 12yo, but I wish I could understand you better. Best regards, 28 year old me.", "itssophholt": "I missed sex ed at school bc I moved schools in Year 6 to a school that had already done it. Therefore, I knew nothing about periods. When I first started my period, I got home from school and thought I'd shit myself (obviously it had dried during the day, cringe!) I went to my mum crying that I'd shit myself, and she laughed at talked to me about it and was fab. But still v embrassing 😂😂", "aalex.he": "I just started using a menstrual cup and I absolutely believe it is the right thing to do but I really struggle to get it out which stresses me and makes me not want to use it", "ch4rliej": "dear hormones, why you gotta make me look like a big ol crybaby in the days running up to my period? you’re ruining my attempt at a “stone cold bad bitch” persona. get it together girls. 😤 love, charlie", "spookyincarroti": "Week before: killer cramps, also I've stained so many clothes why do you do this?", "ruby.eve.geddes": "Dear uterus, I really appreciate you obviously you are incredible. It’s so cool how you clean yourself and can grow another human. My fave organ for sure. Just one thing. If you wouldn’t mind not doing what feels like a hip hop dance class of pain inside my body every day of my period that would be fab. All the best, ruby", "millieonaire92": "Dear combined pill, thank you for making my period go steady with me. Before you, it was so unpredictable. It used to ghost me for weeks, even months without any communication. No spotting, no mood swings, no sore boobs and then, BOOM! \"Hey, wuu2? Long time no see!\". Since you came into my life, I know where we stand. No more months of radio silence. We're so much more akin to each other and happy together. In fact, could you help my period back off a bit now?! It's coming on a bit heavy! Much love, Emily.", "adelaide_kate": "Dear implanon, thank you for making my periods super irregular. I love bleeding and spotting for three weeks straight, it does wonders for my sex life 🙄", "_sazberry": "Dear my period as A WHOLE, why did you never regulate? Honestly it had been four years of inconsistency, and I ended up having to sort it out myself. I prefer my pill over you, IT doesn't make me bleed for a week solid or give me the worst headaches ever. Guess what? It even gave me a boob job! (And they don't hurt!!) I'll take being a little emotional over the last four years any day. No love at all, Sarah", "k.drew18": "Dear brain, why did you forget to put a clean pad on after you removed the dirty one, on the heaviest day of my period last month? It was a sad day for my favourite jeans", "sabrinanbol": "Dear everyone why must you assume I'm on my period because I'm grumpy or upset? Believe it or not, not every woman gets PMS and I'm guessing the majority of us are NOT in fact on our period when you acuse us of being on it.", "gothyvegan": "Dear endometriosis, I fucking hate you Please leave me body alone", "indiam_music": "Dear period, why did you appear every day for 8 whole months? Which lead me to faint every other day and to being put on a pill that gave me heart palpitations !!! And also for your friend pms... why have I had you for 2 months? If I don’t have my period for a while, I’d rather not be pmsing! I’m getting rather tired of the mood swings. Lots of hate, India", "maddieshort00": "Dear period and cycle: Why are you affected by stress? I’d be less stressed if you didn’t show up 9-11 days early, or 19 days late. We had a good thing going for so long.", "dannforbes": "Dear mooncup, why are you so hard to get out 😂", "eleanorwilkinsonactor": "Dear period. I want to love you. I lost you for four years due to mental illness. But you leave me with so much negative PMT that I start hating my body and I don't want to hate it or hate you. Can you have a chat with the hormones and tell them to go easy on the chemicals, please? Love Ellie. XX 💜", "kaatpocket": "Dear menstrual cup, we're only getting to know each other and i'm so sorry for dropping you in the toilet that one time. But i hope you can forgive me and we can become the best of friends. Love Kaat", "beckastagram": "Dear society, why is Polycystic Ovarian Syndrome not discussed more? Why do sufferers have to think they are weird and strange when not listened to by drs? Why is it seen as disgusting to have symptoms that you simply cant help? Why does my body have to fail at simply being female?", "hatosweatman": "Dear my period. Thank you so much for coming the week before my holiday to Spain so that I didn't have to worry about tampons when I'd rather be swimming. And thank you for never giving me cramps or any symptoms that would mean I miss school. Although I have to say I'm not a fan of feeling ill at the sight of carbs on day one of my period every month. Also, why did you come two weeks early? What's going on? I hope you're ok. Love from Harriet", "treestone94": "Dear Moon Cup,", "delightfullydiana": "Dear PMS, please let me fuck I peace.", "aylieeeee": "Dear body, why did I get a 4 week period after coming off rigevidon?", "hannahbartl3y": "Dear PMS, please stop destroying my life, mood and confidence. Much love, hannah❤️", "that_souffle_girl": "Okay, so I was in P.E (Physical Education) and we were tramperling and it was my turn so I got on and my period started. No one noticed because it was light. The more I jumped the more I leaked. It was unexpected because I always get lower back pains before my period. So this was a shocker. I hate my life. BTW BOYS YOU GET TO TALK ABOUT YOUR BONETS ALL THE TIME SO LET US TALK ABOUT OUR NATURAL PERIODS. THANK YOU!", "aims_elizabeth": "Dear Period, Why do you make my boobs hurt so badly I can barely touch them for 5 days before my actual period starts? And please please stop making me cry the day before I come on and convincing me it’s because there’s something else going on, I always know it’s you. You’re not fooling anyone. Can’t we just make this easy and no longer so painful I feel like you’re ripping me inside out? Sincerely, Amy.", "rinofthemill": "Dear my uterus: the last time I got my period in public you cramped so badly someone tried to call an ambulance on me (don't worry, you do it in private too, this was just extra validation of my pain!) The doctors can't diagnose or treat you, the pms that comes before you makes me suicidal and your primary focus makes me feel sick to think about because I'm trans! Please stop, love, the person whose body you reside in 🗡", "paula.cortesg": "Dear Menstrual Cycle, Thank you for teaching me to respect my own rythms instead of forcing myself to be on 24/7, like I thought I was supposed to. Thank you for showing me all the things I didn't want to deal with during my premenstrual phase, thank you for helping me be less introverted during ovulation, thanks for waiting for me to show up and support you so you can show me how to do this self care thing for real. Paula", "majaro_": "@jackowusch schau, du bist nicht allein!", "nikki_beckett": "Dear the combined pill, I must sincerely thank you for helping me deal with the horror that is my heavy periods. When I was 14, my periods were so heavy that there was one occasion at school where I completely soaked through my pad and leaked through my school uniform onto my chair. Fortunately it was the end of the school day and I just legged it, cycled home, proceeded to cover my bike seat in blood and cry throughout the duration of my shower upon arriving home. So thank you combined pill for saving me a lot of money and embarrassment with sanitary products. The oestrogen withdrawal migraine that I get every 6 weeks is completely worth it. Nikki x", "anikaaaaaas": "Dear uterus, Could you please stop hurting when I’m at work. I would appreciate if you could wait until I’m home again, where I have my Eeyore hot water bottle. Thanks in advance!! XOXO you’re owner who is actually kind of you boss so listen you piece of shit", "robbie_mai": "Dear the doctors who did not feel confident giving me contraception. In October of last year I started the pill rigevidon, after two months of using it (on December 23rd 2017) I was almost admitted to hospital due to the inability to eat, sleep or stand without keeling over in pain and screaming - after dealing with the symptoms for two weeks. After heavy dosages of painkillers, lasting almost a month and being taken off the pill, I was never given an explanation, justification or cause to what had happened. They simply said 'you are okay and that's all that matters now'. Now in late September of 2018 I have been seen four different nurses, a gastroenterologist (to see if the pill affected my stomach lining) and three gynaecologist of which all said they do not feel confident in giving me any controception due to the way my body reacted last time. Each time they say I am not an urgent case because I am not currently having sex. But dear doctors, I shall only say it once but please listen: PEOPLE WHO USE HORMONE CONTRACEPTIVES DON'T ONLY USE THEM SO THEY CAN HAVE SEX WITHOUT GETTING PREGNANT. I was on them due to extreme period pain and heavy flow and without them each period I have means a day or two off because of the pain. So once again, dear doctors who would not give me contraception: I may only be one case from your working week but please spend the time to help me, you may never see me again but I will remember all you did for me forever. Love, Robbie 💗", "baguettes_save_lives": "My periods physically aren't too awful, I get cramps and feel like shit but nothing crippling physically, however as a trans guy the fact that I have to endure anything like periods is frustrating and even more of a downer than my symptoms.", "grimshaw_pole_n_yoga": "You’re awesome :) 🦄💪💃🏼", "abbybubble": "Kinda unrelated, but my uni had a talk about consent yesterday and they showed us a video of yours to explain further; so this is just a thank you for being a great role model for this generation! 😊", "heyitsebs": "Dear PCOS please stop making my periods irregular and painful beyond belief, been battling this since the age of 9 I’m now 21 I think I’ve done my time", "elliesmonks": "Dear my PMS, WHY do you insist on making me so tired for the whole week leading up to the bleeding??? Also, I’m pretty sure the very severe cramps should only happen DURING your period, not for the whole week before?", "joeyd614": "Hello there beautiful.... looking absolutely amazing as always 🔥❤️😍😘❣️", "benjyverheyden": "Dear everyone, why do most of you seem to be disgusted by period sex (talking to duys and girls here)? It's a loving gesture that is healthy and helps the poor period victime with the pain, and honestly the cleanup isn't even that hard, so no excuse!!! Just buck up and try something new ;) Kisses", "rezasoph": "I’ve used the CLUE tracking app and it is wonderful sign yourself up pals !", "_josie.quig.jay_": "Dear My Period, if you could not team up with cystitis against me that would be great. Needing to pee all morning as well as cramps and blood isn't how i imagined my one day off (although thank you cystitis for going from once a week to once a year, I appreciate that). Also if you could sort yourself out that'd be great, the implant is trying to protect you from baby trauma. You don't then need to punish me with unexpected month long periods. Work with me please. I'd like to turn our relationship into a positive one. Love Josie 💕", "whosthatgirl_js": "Omg the two-week-pre-period-boob-pain is THE. WORST. 🙅🏻‍♀️", "jessp2101": "I have endometriosis and because of it I get crippling pain when I ovulate, pain before I bleed, pain when I bleed, random pain when I pee, pain with sex, nausea, hot flushes, random tears when I drop my phone and generally have about one week a month when I can forget about my ovaries! Periods are gross but women are epic for getting on with them 💜", "fridarooos": "Dear vagina, please stop bleeding like a waterfall every month? And please stop making my whole back hurt for two days straight? Thank you. ❤️", "jessicarebelodesign": "I day before I get my period I turn myself into the worst version of myself and I feel so sorry for all the people around me. I can’t help but yelled at my kids for stupid things (when I’m usually so patient!) and I don’t want my husband to be around me at all. Once I get my period things fall into place and I become a normal person again. This is so hard even for me, even when I’m conscious about it it’s like I’m possessed by another person 😥😤😡😱", "taako.yaknow.from.tv": "I have a rough relationship with periods. I have endometriosis and that meant i was cramping 24/7. I didn't get a break. My actual periods lasted 2 weeks or more and during them tge pain escalated tremendously. I now am on medication to stop my periods and a hysterectomy is in my near future.", "niphredil12": "Today I arranged my week off work for the week I get my endometrial ablation!!! No more periods!!!! Forever!!!!! 🙌", "tiegan.ellie": "Dear my Uterus, WHY MUST YOU BLEED SO MUCH??? Not only do you bleed HEAVILY, you also hurt like there's a chainsaw in my womb! And WHY must this mean to the rest of my body that fainting is the outcome??? I'd rather not turn grey and pass out every month thank you!! Lots of love, Tiegan (who is now known to everyone as 'The Fainter')", "rosieohora": "Dear PMS, please stop making me cry for literally no reason. I have run out of tissues & I think my boyfriend is starting to worry 😂 love Rosie x", "tiamxller_": "I have horrible periods. The first day of my period I am in bed. I get severe constipation, stomach and back pain, hallucinations, sweats, the lot. I am home educated now but when I was in school, I ended up being that poorly I had to come home. So grateful I am home educated now as school was hell with my periods. I tried the contraceptive pill but had to come off it due to the fact I have had several recent orthopaedic surgeries and obviously the risk of blood clots. It wasn't really doing anything anyway"}