{"sallyrosagraves": "🔥🔥🔥", "mirandabrb_": "You are sooooo coool 😍💪", "bitchesngravy_": "Your tummy is only out because your booty is pushed out! You're very lean, Hannah.", "_ellielara": "you look gorgeous, your eyebrows are great, I love your pajamas, your hair is so cute :) everyone feels bloated/fat/unhappy with how they look sometimes! thank you so much for being so honest and posting something like this. keep being fab and such a good role model!!❤❤", "alicefleurtucker": "You insprire me honestly and I love how honest you are", "movedsounfollow": "you look great", "anushkamenon": "@shefali.shenai Amazing☺☺", "jetcoww": "It was beauty that caught the beast's attention. You're a beauty.", "galact1cwav3": "Mom you're a hottie", "jaclynglenn\nVerified": "Verified", "bram.van.oploo": "You look fantastic Hannah. There is no standard. Don't invent one of you're feeling good and you're healthy. You're just awesome, intelligent and beatyfull. Enjoy it. That's what I do anyway :).", "_liabiga_": "check out @nourishandeat !", "insta.nik": "You should definitely be positive about your body - there's nothing wrong with it and a hell of a lot right with it :) What makes one person beautiful is not the same as what makes another person beatiful, but that doesn't mean one is better than the other :)", "soliddump": "Feel like people just use body positive as an excuse to be lazy. Being healthy is whats important.", "littlecomet13": "Wish I knew you in person..thank you for your positivity and the fact that you choose to share it to millions of people♥", "naimanader": "Who said she's not healthy? @soliddump", "_will_the_don": "You're absolutely beautiful 😊", "le_foz": "I've lost 2 and a half stone to try and feel positive about my body but I still spend most days feeling crappy. You're beautiful just as you are and sometimes that's hard for us as people to understand unless we conform to the sterotype #neverchange", "kathyhope_": "Hehe @abiw_01", "i_have_lungs_too": "love your honesty!", "scampbellb": "You look AWSOME!!", "bazza_da_bin": "Well i think you have a beautiful figure and body so be proud !! ❤", "chrcoluk": "you look good hannah dont worry about it", "vincentjbateman": "Your body is gorgeous thanks for sharing", "macamyroni": "Thank you for this 😊", "courtneyjf22": "Still look incredible 💗", "wortmaus": "cute pants :D Thanks for being honest :)", "teahunting": "You look great, and it's good that you're accepting what your body does too 😊 one lil thing though - please fix that posture, girl the curve in your back is huge and I guarantee that if you straighten up, tuck your butt in/pull your pelvis forward a bit, the curve at the front will shrink. And it'll be better for your back too ❤", "kaptainskittlez": "Keep your head up! Bopo is just as much about the bad days as it is about the good days. Learning is always a process. \"Trust the process\"", "all_legs_and_panic": "I think you look absolutely stunning and you should never be ashamed of the body you have. As the time tested saying goes: \"treat yo' self. love yo' self\"", "racheldddday": "remember that you're your own worst critic, hannah! you and your body are both gorgeous! despite society's often poorly ordered priorities, health is the most important thing at the end of the day and that video you posted a few months ago where you mentioned that you jog regularly showed that you're serving your body well x", "livia.page": "Would it be weird if I told you we have the same body type and that makes me incredibly happy because you're so pretty? 💙", "sara_schm_": "😊💫💛", "steph.egan": "20s are hard. I struggled in the early days a lot but I'm finding solutions and working out what my body prefers and that's making me feel much better!", "bambicitizen": "Your body is ok , I would marry you in a second.", "cyrius.s": "Blatant self delusion ! If you truly feel ok that way then be it(you're a sexy woman) but you obviously don't so go ahead and work out.if you fail,try again.we only have one life(that i know of)", "alicja_bednarzewska": "I know, probably most people already said something similar, but: You look amazing, just as you are! I know how hard it might be, when you're struggling on your body. But really, believe me, you've got a beautiful body! In my opinion, it's better when a woman has her curves, and curves doesn't mean that you're fat! Maybe you've got a bit of a belly, but you still look normal and fine. Please, stay as you are, beautiful! ❣️❣️❣️", "gingerlionesseva": "My body is doing this thing too and it makes me feel better about mine knowing yours does it too!", "bonniesheppardd": "So refreshing ugh it's summer in Australia and all I'm seeing is skinny girls in bikinis and everyone comments 'omg hot you're so pretty omg' and I'm over here like yes you're gorgeous but not because you look good in a bikini gahhh. I think you look lovely <3", "bonololno": "isnt it funny about the more weight you way the less specific you are about the number. but somehow the less people weigh, the more specific they are about the number and i think that shows a lot about the way people view weight and how unnecessarily nit picky we get when it comes to being as thin as possible. idk i get like you are a lot - especially around my friends so this is a thought to think about for when that happens.", "livrylan": "Needed this, surprisingly enough xx", "rated_ren": "You are still beautiful, but how did you put on so much weight Hannah", "romeo_sierra359": "Yeah still would.", "writinganocean": "@hannahwitton I am gaining weight too. I am 16. I call it \"gaining weight fashionably \"", "scarrednotscared\nVerified": "Verified", "laura.abbd": "Drinking lots of water helps with bloating :)", "ohsophleil": "You are beautiful!", "florenceelily": "❤❤", "lizzzylou358": "we all have bits we dont like that much! just try your best to focus on the great bits, like your butt 😉 but mostly focus on how intelligent, bright, funny, and lovely you are 😊❤️", "aditi_sachdeva09": "Hey you're good! I'm like really skinny and I'm tired of people telling me that because I already know it but there's nothing I can do about it. No matter what I eat I just don't gain weight. I'm 23 but look like 15 and I'm starting to embrace myself like that.", "lizzalina": "I love this post - thank you!!", "bykotney": "Thank you.", "trembros13": "Gorg😍😘", "chloedh9": "💙💙", "mscharlylester": "Having just trawled through a feed of ridiculous unrealistic pictures of people in bikinis, I can't tell you how refreshing this was. Chin up gorgeous girly xxx", "avelinawashere": "You're beautiful💙", "shefali.shenai": "That caption ☺ @anushkamenon", "_lilypoe_": "❤", "longcroftrecording": "Look perfect to me x", "dylanmcneal04": "you're so pretty and whether you like it or not you've still got a rockin bod", "jennalrayne": "This post made my day", "jaranizacija_kolektiva": "@hannahwitton Just like with all things in life you really have to look at it from the positive side weather it's your love life, work (this one was a bitch), body etc and even though it's a pain in the ass it works out in the end no matter what. Im a guy in my 20's so body changes don't really occur that much i'm still a 6 foot 6 stork as I've always been and it only takes a few looks in the mirror and saying fuck you to your self with follow-up of i look damn good then grabbing a nice cold beer to celebrate xD 😀 so just keep shit positive down a few good beers and fuck all 😂 Cheers 😉", "fstop.josh": "Hey! At least your smile", "cw122": "@callmecare I know most people aren't being mean most of the time. It's just hard to get out of my US mindset where people aren't as \"open.\" Lol", "jopineapplesuk": "I think you're awesome - so that's all you need. X", "snowhitesally": "Xx", "janiealice__": "You go girl! You're still gorge", "lilsmarti": "Same blehh h", "skammyfresh": "You look fantastic... do your thing!", "arran.ferguson": "👌🏻", "callmecare": "@cw122 oh, Latin America. The land of criticizing people. I known it's very different to the US and I know it's very cliché but you just gotta ignore what other people say. I'm sorry. 😐 People aren't being mean (most of the time).", "margonton": "<3 Nothing wrong just beautiful :)", "heyitslory_": "You look amazing love xx", "oliviaxxmurphy": "i like your body it's v cute. i also like your personality xx", "lelaaina": "thank you for your honesty ❤❤", "beckarusselllynch": "You look wonderful. 😘😘", "tayente": "Yaaasssss we can't look like 18 year Olds forever. We're women now. Embrace the curvessss", "pauliepatches": "You look amazing. Keep smiling", "rebecca.rose.vaughan": "I feel you ! But your gorgeous no matter what !", "nickegibbons": "@hannahwitton firstly go you for posting a pic you don't think is flattering. Maybe we'd all have better body image if more people did that. Yes your body is going to make changes, especially after the feasts of Christmas and Hanukkah. Sadly you can no longer eat anything and everything and look the way you want to perceive yourself and maybe believe you should look. It happens to everyone, now it's time to make some assessments as to what to prioritise. A pancake flat stomach is 30% gym and 70% diet according to most personal trainers. Also remember you're the only one who can decide what's right and wrong for your body. I've never got my body back to my uni days and tonight was my fifth trip to the gym this year. Please don't over compensate or you will injure yourself", "deadpan28": "I needed this tonight <3", "sweet_ness45": "I feel this so much 😥 youre beautiful girl", "benmo4": "I think that this is 100% posture. Straighten up your back, shoulders back. You're slouching because you're feeling crap, and slouching makes anyone look a bit rubbish 😊", "trinityawp": "😻😻😻😍💖💖💖💖", "kya.amber": "It's a working body we're lucky to have them! 😘 x", "ourcianjohnsmith": "Chin up, you look great!", "millihawkes": "Wow you're amazing I really love you alot 😂❤", "pieter_roefs": "You look absolutely stunning! I like the cats on your pants 😊", "leapurcell": "I love your pants!!", "agg.82": "You look amazing!", "ashleegai_": "I feel the same way today, but we're always beautiful 💖 much love from Sydney", "maggiefying": "Absolutely gorgeous hannah!!", "tpfdowling": "Soon to be 28 year old here right with you :-).", "lucyacarr93": "@hannahwitton I'm very new to your channel but you're quickly becoming one of my favourite youtubers. Your content is so 👌🏼", "clarascissorhands": "❤️❤️❤️❤️❤️❤️ thank you for this post. You are so beautiful Hannah!", "mnichol29": "Your confidence is beautiful", "wabinez": "😍", "_beckythorp": "Can totally relate", "greendale911": "It's one thing being positive about your body when you're living fairly healthy, but when you're eating unhealthy stuff and your body is declining because of that you have to change something.", "lieselritchie": "The pattern on those pants is so perfect. Also yay for respecting your body even when you're not feeling it, on my crap body days I just remember that I literally live in my body and that's enough for me to cherish it", "anyasfrancis": "I love your honesty I feel much the same of my body in my twenties @hannahwitton plus weight gain from medication :( muchos loves xxx", "jesslington17": "You're still gorgeous Hannah don't worry about it xx", "thechelseascott": "Still lovely as ever", "mikamarisol": "cutie patootie 😘", "zojoroberts": "❤️❤️❤️", "izzy_nc": "you are more than your body x and you honestly are so gorgeous, you're always gonna be your own harshest critic and people find judge you as cruelly as you judge yourself x", "felicitywalston": "You're lovely ⭐️", "vivanco_fu": "This made my day, you're beautiful and our little bellies are beautiful! （⌒▽⌒）", "hrh_abby_": "😍", "amber6162": "I was so excited when I found someone with a very similar body type to my own. I often look to you for my own body positivity because I always think you look great and it helps me believe that I am also great, thank you💙", "catherine_tin": "Body positivity @x.jessthomas these are things you have I didn't as a hormonal teen😂 (sound like an old woman)", "megimoonchild": "Regardless of your appearance and body, you are a beautiful human 💜", "moominclature": "you're honestly one of my biggest crushes. this photo only reinvigorates my 😍 for u", "livkellis": "❤️", "leohernandeznj": "Still beautiful in my eyes", "juliereyne": "💙💙💙", "johannahuis": "You're a babe", "paytonvee": "I find this really enlightening because I often wish I had your body but in reality you are insecure just like everyone else and that makes me sad because you're lovely. So beautiful too ❤️❤️", "emiliasmithh": "You're stunning", "alicebown.x": "+ I'm so proud you uploaded this even though you're not fully comfortable with it. Big inspiration, 😋", "heatherrobbinsactor": "I feel the same, I feel the more I get into my 20s, the more bloated I get. But we should celebrate our bodies as females are all different etc :)", "jaediesansom": "Appreciate the realness", "fallingintolovingmyself": "Beautiful 😍", "hplerman": "This made me so happy", "shadokyn": "you still look hot, keep strutting it :D", "thelootqueen": "Growing into your adult female body can be tough. We only ever see the teen version in magazines, and that can mess with you. I'm 29, 7 months pregnant, with stretchmarks and perhaps a pound or two too much. But there is only one me 👍", "hannahtthl": "I love this, I love you. I can take a picture exactly like this and still I'm slaying it - and so are you ❤", "laisalii": "It's true let your body do its thang :)", "_chloeasquith": "💞", "tamaraq.22": "that's what my body looks like and I'm 15 xx", "tsampika.panaghia": "It's sad that we worry about having a 'perfect body' when our contribution to the world has nothing to do with it. It's a form of control over our lives. we shouldn't be bothered with this.", "anoukksmith": "Beauts man", "sean_toom78": "You look absolutely lovely", "spadaroberta": "You are amazing both in and out", "luis_trak": "Gorgeous as always !", "tomtrials": "😍😍", "kassjordann": "beautiful ❤", "kizzyfennell": "Gorgeous ❤️❤️", "iantshanks": "You are still my favorite female YouTuber Hannah 😘😍❤💜💕 @hannahwitton", "miia.jenkins": "You're my role model 😍💞💞💞", "caarmiee": "you're so cute, focus on the good things 💜", "danieltkilleen": "you don't need yourself to do it...i gotchu", "vanessa.laughtland": "Refreshing to see someone else who looks like me 😊💖", "hx.wds": "Gorgeous💓", "babygirl_godin": "Thank you for this, it's nice seeing someone with my body type. I see it so rarely so thank you💜", "elinoksana": "👌👌👌", "sml_goth2000": "❤️❤️❤️", "seeairuh_k": "Gorgeous! 😍 also i love your leggings!", "charliepeet_": "I really needed this. I'm normally completely in love with my body but recently been really down about it!", "caitlin.abbie": "Your body is a masterpeice. Look at the butt. And your boobs. And those damn toned thighs. Think about when a cat has a little more belly on it. It makes it so cute. Then look at your little belly and look how damn pretty and cute it looks on you. Yeah thats how amazing your bod is", "courtneychr": "I love you for posting this", "mila_therese_": "Your pants are super cute😊 and so are you!", "ayla1195": "You're amazing. You and your videos/posts inspire me every time. Lots of love 💜💖💪", "cloelaura15": "This is a beautiful picture I often feel the same way you are amazing ❤❤", "notaino": "u r so beautiful hannah!! we have v similar body types i think", "redefinedojo": "We have almost the same body! 😊💜", "olovne.godine": "You are beautiful, never forget that", "james_dean_photos": "Its not want others think that matters Hannah. If you're happy, then thats all that does 🙂", "rhys_g": "As a fellow twenty something who's always been skinny I still think you're alright", "m.olliestephenson": "I love you 😘😘", "lbozzie": "You look awesome.", "alextyteofficial": "💋🌹 you're \"🦊-E\" 😊😍", "alexthroughthelookinglass": "You're beautiful. Never forget it.", "erosrise": "You look great! 😁 Not just saying that.😒", "evalunny": "You're beautiful and I really admire the way you discuss bodies and body image", "sofi.kaefer": "Same here. But over all, you look so good! And so do I in the end! Lots of love for you and your work! ❤", "teztheairedale": "Those eyes though....", "lau_arnaud": "So much love and admiration for this. You're so gorgeous inside and out 🌸", "tom.met": "10/10 Regardless.", "msaddy123": "You have an amazing body, try not to worry about these things because bodies are always changing a little bit. Lovee❤️❤️", "jazmin_leia": "Beautiful. Heart, soul, body and mind 💗", "niacpr": "Having the same battles now I'm 22! We can do this Hannah 💪", "hannah.mimiec": "It's so nice to see another body like this, I have a bit of an obsession with my stomach and this brings a lot of comfort to see that someone else's looks like mine does sometimes ☺️☺️", "lou_naema": "I've been feeling the same. Our bodies are our best friends, that's what I tell myself. Take good care of yourself, you are truly beautiful ❤", "dreadfullyinadequate": "I love you 💗💗🙏🏻", "savageryclothing": "You're a stunning person, regardless. Chin up! Keep grinding!", "georgialilyy_": "I needed to hear this... Thank you... I love you", "abidev1ne": "beautiful!!", "madalynfeder": "You're beautiful", "kevin.wg.02": "I thought you were pregnant ^^", "toyman72": "You're beautiful just as you are.", "wietskejanse": "YES Hannah! I've been feeling to same way as you about my body today as my stomach just wants to keep stretching out as if I'm pregnant (which I am not). But I am trying to love my body for keeping me alive and I think you look bloody gorgeous so you should do too! Lots of love <3 xxx", "boahsokuhl": "❤❤❤❤❤❤❤❤❤❤❤❤❤", "olive.hampton": "You're so beautiful, Hannah! 💕", "xgeorgia_annex": "❤❤❤❤❤❤❤❤", "alyssa.bel1": "seeing this really brings me so much comfort. my belly looks like that too at 19 years old and i'm really struggling with it. it's so comforting to know that i'm not alone and that somebody i really look up to looks just like me.", "dominic_j_": "you're beautiful.!", "jamietinsleyinit": "What on earth are those green bobbles.", "lena_ruten": "your beautiful!", "jos.dvs": "Ur a spicy queen, u slay", "hayley_kaz": "you are stunning; body and soul!!💕", "lady.alz": "you are so stunning hannah. EVEN IF YOU CANT SEE IT WE DO ❤️❤️", "fernevans_": "@hayleynightingalex she's great! Another gooden that you've introduced me to!😄", "emmayhil": "The fact that you are posting stuff like this is so helpful and encouraging Hannah, no caption needed. Keep doing you, you gorgeous gal! ✨", "the_awkward_giant": "You're body rocks Hannah 😍 always beautiful!", "maiaava_": "Thank you for always being so honest and real! You look wonderful x", "september.gold": "Life is always going to find new things to throw at you but just remember, the sun will rise and we will try again. 🌅", "katherinelea_": "At the end of the day a human body is just a vessel for the mind, and you have an absolutely brilliant mind. As long as you're healthy, that's the most important thing in this world ☀️"}