{"_simply___sarah_": "Pretty💓💗💕", "freefromthreads": "Thank you for being so open and showing people that having a Stoma is nothing to be ashamed of!! Uoyr journey is amazing 💪💪", "wuzgoodkimberly": "Your openness is healing ! 🙌🙌💙💙", "dario_prespljanin": "❤️", "lorenadantas91": "@tainar1318", "cvermaat": "You are very brave being so open! I have only experienced ‘living with a stoma’ from a sideline, as a good friend of mine had one. In that respect, he has become a significant part of the main character in my books ( TREGUNNA) in which I try to express that someone who has a stoma, can live a normal life and can work like everyone else.", "zoella1974": "I had my J-pouch surgery 16 years ago and I am a healthy and happy human. I was weirdly fond of my stoma too! The key is to learn to love your body, no matter how it looks & feels at any one time. Appreciate it’s not always a good experience for us poor sufferers, so my heart goes out to anyone suffering today ❤️", "shellydj52": "God Bless You💚", "krycha": "MONA ❤️😍 HI GUURLL", "carlos_duarte_vaz": "Respekt from me. I have this 9 Month. I know what that is👍😊", "curtisimo69": "🙏🙏🙏🙏🙏🙏👍👍👍👍👍👍", "3a___90": "Beautiful 💗 thank you for sharing this you’re amazing 💕", "dee05iscrazyaboutcats": "Inspiring! 😍😍", "fearney14_xx": "@rebeccazamolo", "sarahwithstars": "Happy birthday Mona, thanks for keeping mum alive for the year xxx", "freaksgoalscouples": "Hello 🐔", "world_egg_mother": "Hey im a mother please help me😢", "invisiyouth": "We are so thankful for you being so open about your health journey! It's massively important to bring that awareness amd get conversations started! You are such a rockstar in our eyes👊👊", "iammbubbless": "Babygirl 😜😻", "julian_lewiss": "That’s the grossest thing I’ve ever seen please don’t post that again", "lucie_bassom": "@vicmuller @lou.vandroo @clemencehalflants la fille dont je vous parlais", "itsclaireyeahh": "Wasnt expecting to actually see it wow", "let.diamond.handle.it": "My brother had ulcerative colitis! He got the Jpouch surgery almost seven years ago!! He's still going strong with it!!"}