{"severine_darkora": "I follow mostly IBD/ostomy stuff, cute animals (mostly pet rats) and then a few friends. I like to see how other are doing with their own ostomies/IBD as it helps me to deal with mine. The animals help me feel better when I'm down and remind me of my own pet rats when I'm away from them (I miss them alot right now).", "freyarosetanner": "I just like your personality and love what you put into the world! 💗", "zainablalala": "I tend to follow people I connect with, whatever their content is based around :) the type of account doesn't matter so much as the person behind it and what they're trying to achieve with their posts", "ajayrious": "Mostly I follow people to get an insight into their lives and to be entertained when I’m on my hour long commute.", "ottercandleco": "Cuuuuuuuuute!!", "harammuslim95": "I follow a lot of musicians and artists that I love, I also follow friends & family to keep up with their lives. It’s also to post funny/personal insta stories and updates on my own life.", "so_viel": "I follow a weird mixture of friends, people I somehow know but are not friends, political accounts, hot people, celebrities, lingerie bloggers, and people I've been following for years for no reason and still want to keep up with their lives even if tried unfollowing several times 😂", "hair_stylist1991": "@hannahwitton your a huge inspiration where you been all my life", "philthecaveman": "Cats, gardening, people who do interesting things (you belong to this final category) and podcasts I listen too 😊", "_sofiponce": "😍😍😍🔥🔥🔥🔥", "star.marvel": "Mostly fandomy stuff/ celebrities & ppl i like watching on youtube. Instagram's for stuff about your life! What yr up to- creative stuff, funny stuff whatever!", "sara_ortikova95": "The world is full of things to worry about but if we only focus on bigger issues and problems to be fixed we can just get lost in them so everyday things like a cute outfit or new hair is something gives us little breaks. I follow people I think in my mind friends thats i just haven’t met in life like yourself. I don’t just don’t think of YouTubers or public speaker as these people that know it all they are more of my friends with whom I am learning and laughing together just like you do in real life. So please feel free to talk about anything that comes to mind we love you for who you are not just the things you stand for. (Hope it made sense)", "malexc": "Well for friends and family and people I care about who I don’t know (such as like you and Dodie and Taylor Swift) I follow to keep track of y’alls lives and make sure you are all doing okay and what’s been going on, especially if we’re separated by time or distance or even fame to some extent. I also follow people if they create art (even if it’s as a simple as an emotional caption like Shannon) because I love being surrounded by art that people create. It makes my life feel beautiful. I also follow meme accounts, animal accounts, and old fandom accounts to give me something small to smile at. So, don’t ever feel ashamed for posting about something as simple as a haircut. If it makes you feel happy and confident then it makes me happy to see.", "miuaisha": "\"Who cares?\" She says as she has 16k likes on her photo. 🙄 delusional", "dario_prespljanin": "🔥🔥💋💋❤️❤️", "caitydid2911": "I follow a mix of people I know and a mix of people I admire. I love following people who put a lot of work into their captions. My favorite example of this is @barry_happy. As a writer I’m always looking for writing I like/that inspires me and IG is one more place to find that inspiration.", "sofiakieloaho": "You have made a huge impact for the audience, especially people with IBD. Things (even the awkward ones) that includes to the disease are not the easiest things to share. So it’s very admirable to see that you have that much courage to do that for all of us. I know this sounds pathetic, but you gave me so much support in my latest surgery. And that’s why I love to follow people like you. Strong, independent and inspirational. It makes me want to be that too. So thank you 😊❤️", "sarahdespenc": "Cute hair 😍😍😍", "lilachaa": "I follow people I look up to or like their style. I mainly get inspiration put of it but whenever I feel it starts to get me down I delete the app from my phonr", "outesspace": "I guess my tl is a mixture of friends, people who inspire or educate me and stuff I just find interesting or entertaining; all these are directly linked to the purpose I try to get out of instagram, which is exactly inspiration, fun and entertainment, somewhat lessons or education and the ability to enjoy whatever beautiful pictures the people around me choose to post", "phagocyteaddict": "A mix of it all really. I follow people who inspire me and plant related Instagram cause I love indoor jungles and have one of my own.", "lafrad": "See you post about normal stuff, reminds me that there are other normal things going on for people out there... And is a good feeling. Your hair looks nice, BTW 😀", "izzytakespictures": "Honestly I hardly follow any celebrities/influencers/whatever on Instagram, but I like seeing what you’re doing because of a mixture of relatability and life envy I think??? Really trying to psychoanalyse myself here", "walwanisp": "You look so nice hannah !🤗🤗😘😘", "katarina_t": "I curate my insta feed rather harshly. It’s 1/8 friends, vloggers and family, 3/8 plants and garden; 1/8 winter sport athletes and 3/8 nature photographers. I’ve noticed that I enjoy well thought out feeds, a lot of nature and a space that is positive. It gives me a chance to go to my Instagram app and get a little nature and happiness boost. ❤️", "sarahchillomg": "I hate the comparison that comes with social media and the obsession of preforming the Self etc but like, I also like taking blurry pictures of stuff that I baked and dumb selfies, and liking my friends’ blurry photos of their food and their dumb selfies. And strangers’ too. I’d argue that mundanity does add value to the world because it’s a universal experience that humanizes strangers and celebrities, which in my naive optimism I’d say increases empathy for them. Also, I don’t think talking about yourself/your hair/the things that matter to you detracts from the value of your posts either. The things you choose to share—your opinions, your experiences, the causes that matter to you, the wardrobe malfunctions, the selfies while you’re waiting for your face mask to do its thing, your Starbucks order, your hair, whatever the hell—they add value because they are yours and no one else’s. . I think at it’s best, social media could be a chronicling of the human experience, recording history as it is made and our reactions to it. And it can be hard not to feel like it’s at its worst between people spewing hateful words at each other and thinkpieces about this generation’s narcissism. But we are all curators of our own corners of the internet, and I think it is possible to both be a thoughtful social media user AND post the daily experiences of haircuts and random cats you saw in a McDonald’s parking lot.", "yasminjohalx": "i used to follow majority vegan food accounts but it was super boring. now my feed is 60% mums (influencers and random ones) and 40% friends and family and i looove it. idc about aesthetics or themes i just like the updates bc i’m nosy and like peeking into peoples lives haha", "becca98001": "My feed is mostly friends/family, celebrities and youtubers I like, photography and style.", "melaniiemurphy\nVerified": "Verified", "ellenbrimacombe": "I follow for your confidence 👌🏼", "bamblingsofnaffy": "I love it you look amazing. I follow people who bring me joy and information which inspires me", "ostomate_and_the_city": "I started this handle because I wanted to bring awareness. The only way to take down stigma is often by sharing and bringing forth understanding. So I follow folks that are doing the same. Just wish IG feed would go/order in time posted as I can miss things for days", "_sorrow_child_": "A mixture of friends, family, hobbies, celebs I like... but not politics or people that rile or upset me. In fact I try and avoid a lot of the general news because it's often argumentative, disappointing,", "secondchapter_": "I totally understand your point, but I do think it’s interesting! Yes you are happy with your new hair, and what you are putting a picture up of is you feeling confident and good! It’s a celebration of simply feeling good. To me, there is nothing wrong with that!", "ebonyedmonds_": "I follow the majority of content creators I watch on YouTube, because they are interesting and some are brilliant photographers. I also follow a whole bunch of little family blogs and creative ones 😍", "xanderb100": "I follow people I know and people of varying game levels that make content I like. I follow because I like them and it's interesting to see them as humans and not media machines, and to that end, post pictures of your hair (which is cute af btw) or whatever you want", "swervature": "\"Does this photo bring me joy?\" [holds tablet up in both hands] \"Yes, it does!\" [continues to follow @hannahwitton on social media]", "redellemarmotte": "Kitten. Is there something more important than kitten? I say NO.", "lilirdzn": "Unknown interesting (to me) people", "helalinnea": "I follow mostly family/friends and then a bunch of feminists and activists, mainly body positivity. And a few influencers/youtubers that I find fun and inspiring 😊", "orelgs": "Hey Hannah, here's something that'll change your life: Everytime you start a video with \"Hey, it's Hannah\", it's literally 13 Reasons Why for me all over again 😅 Anyway love you ❤️", "ladycamilot": "Okay so... 1/2 my insta is friends an family and the rest is mostly photography with a little bit of celebrities, memes and food", "taylor_fuller": "I love your hair!! I follow a big mix of people and if I’m honest half the time I don’t look at anyone’s photos haha", "oogiexboggie": "i have two accounts, this one & another which started out as just a kmusic account but has shifted a bit. on here, it's mostly animal accounts, friends & celebs", "joeyd614": "Well don’t you just look absolutely amazing.....❣️🤗🔥🔥🔥♥️😍❤️🌹", "emlaa22": "Friends, food, photography and interior design. Lots of positivity and seeing your smiley face was lovely this morning :)", "corrinemacraild": "My first thought when I saw it was “wow your hair😍💁🏻‍♀️” I think a filter would have hidden this!", "zooeyschmooey": "I follow people who I care about and want to see happy/doing well in life. Be that someone I personally know or someone I have never met but admire. Everyone I follow is someone who I cheer for and wish the utter best and who makes me happy to see on my feed; whether they are sharing life's milestones or the scone they had for breakfast. I just want them to share things that bring them joy because knowing that they are happy makes me happy too.", "alwaysgettingthere": "Your voice and your thoughts add value to MY world 💕", "champagne_dance": "Humans like to make connections, I think you attract people with your content (body positivity, sexuality, etc) but then we naturally want to learn more about the person behind the posts 😊 in short, show off the hair pics queen.", "melodycutiecupcakes": "I often follow Youtubers I like because I like to know what they do and I guess to know more about what kind of people they are. Also to have updates on tours if they're musicians like dodie and Tessa.", "bobbykingtv": "Photographers, to support their art! 👏🏻👍🏻", "megbai.ley": "I mean I have thoroughly enjoyed the hair pics and could happily scroll through more", "phreyah": "I think part of the reason I'm more prone to like selfies is that I instantly know what the picture is about. Other pictures may take a longer time to understand. I know that I do support a good selfie. I don't like all of them though. Sometimes I catch myself actively NOT liking a selfie and then feeling rude, haha.", "denimdoodles": "my feed is mostly artists (seeing as i do art myself), people i follow on other social media (like youtubers) and friends!", "johan192000": "I have cats, cute and hot people tattos and friends so yeah i actually like that you post photos of you hair. You go 😁🙌", "mraawp": "I really like to compartmentalise so I've gone through a lot of phases with who I follow, but usually it's a mix of friends/family & creators I want to be up to date with. often there's some sort of hobby or something thrown in, but now I use my other account for the more activity based stuff", "purple_tranquility": "Am I the only one who doesn’t follow someone just because they are hot?...", "ryan_underwoof": "hair looks adorable", "janiealice__": "I follow many different people, mainly Youtubers, friends, and quirky little shops that create their own merch/products", "anatoearancibiaphotography": "I don't really care about uploading only pictures of myself and what I'm doing (exactly for that \"who cares\" reason) .I have focused my account on teaching about the species I photograph, since I'm a wildlife photographer, I feel like I have the duty to educate people. I also try to follow people who teach me something or are interesting people in some way or another 💚", "anapi91": "I actually find that kind of mundane self-serving posts most inspiring and natural😊", "brin_speaks": "Mostly artists. I like seeing their creations and it makes me happy to have a constant input of things people have made. I used to follow a lot more celebrities but it didn’t have the same uplifting vibe, so I stoped.", "thewildlemons": "Also I low-key spend my time on insta obsessing over how gorgeous people like Kylie Minogue are and thinking it's not fair they are straight and don't know i exist 👀 🙈 😂", "itsrebeccalucy": "I follow a lot of hikers and outdoors-related people (especially women) because their posts really resonate and inspire me to go outside and explore the world.", "angaxa": "I follow about 10 YouTubers im subscribed to + lots of cat and animal rescue places :)", "laurabeam": "I would say that I follow about 1/4 young adult authors, 1/4 people that I think promote body positivity an/or talk about chronic illness/pain, and 1/2 people I know.", "crystachesbro": "I don't know really why I follow or look at anything I do. I only care about 3 people/families I follow who I like who they seem to/ are as people and I feel like they are friends and I want to keep up with them the best I can. I sometimes read other people's post, but a lot of the time it does just look like bragging and showing off and I really just don't care... I follow to follow and have content to scroll through.", "emilyjackbutler": "My Instagram feed is 100% YouTubers, celebrities, and Tyler Shields. I like to read Shannon’s captions and see how ripped Jessieb’s abs are. I like all the different tricks and weird things people do with their stories.", "lisahunt96": "I’m not sure if it’s just me but I can see a tad look alike to The Doctor in this photo! I mainly use Instagram to follow friends, look at comics, animals and youtubers / celebrities. I prefer using their stories to keep updated with what they’re doing since the algorithm is crap and it’s never in chronological order.", "nay_schachter": "My Instagram is becoming more and more following activists and less friends and even less celebrities. I follow people like @laylafsaad @rachel.cargle and @kendriana.speaks . They’ve completely changed my life. But I also follow the Jonas brothers sooo.", "greendale911": "I have two; one for my friends irl and people from my area and the second is for celebs/random other hobbies", "patrycjajpiekarska": "Just post whatever you want whenever you feel like it because I think that’s entertaining. Just seeing something real once in a while really makes me smile. And post as many pics of your hair as possible if it makes you happy!", "meo18": "I honestly don’t know what my feed is made up of any more! I have a lot of people from my “real” life, things (ex. cats) and people (ex. podcasters) I like and just whatever I think is living authentically. I honestly would prefer a true, filter-free, honest to life photo compared to a staged and filtered photo any day.", "mandymandy88": "You look like Scully and my heart just melted 😍", "carterplasek": "Honestly, even the \"mundane crap\" feels awfully interesting, for it represents a snapshot of thought.", "kitcaz": "I mostly follow friends and family. I have a lot of baby cousins and instagram is where their parents post most of the cute stuff. And my friends share pictures of their pets etc. I follow about 4 youtubers because it's a good way to keep updated but mostly it's friends and family.", "errydaywonders": "Instagram is like a photo diary for me, and a way to follow my friends visually from afar. Also keep up to date with musicians and vloggers and such. Post what you want my friend, it's your platform!!", "web_guy1": "Love the smile though 😉", "looking_for_a_lighthouse": "I follow mostly art and social politicS-type acounts here or things that makes me happy. Seeing you happy makes me happy, and i love all your subject matter and your message/attitude. Post about your hair if you want to! It makes me happy! ♡ Hair looks great by the way", "kmhayes218": "Well, first off, I’m glad you shared this photo because your hair is super cute! As far as who I follow: lots of ultra runners/runners, friends and family, and then people that I find inspiring or who are putting out a message I need/want to see.", "micahlee_19": "Aesthetic. New brands. Just a couple of creators. Cool cities. I don't follow a lot of \"issue\" or campaigning type people. I prefer that kind of thing in my email inbox or elsewhere. I like Instagram to be pretty!", "emma.keaveney": "Food", "amzandco": "Sex educators, inspiring feminists, lgbt babes!🙌", "bamlaw99": "I follow you totally for the hair updates alone. :-D", "chad_dt": "You look amazing Hannah ❤️", "eni.mp3": "people i like who i care about because they post content i appreciate and enjoy and now i’m invested in them and their lives and love their otherwise “uninteresting” content in the same way you care about your friends even when they’re not being exciting or wild or living their bEsT LiFeeeee you know, like... i like seeing people just living, and i support ppl i know are good and wholesome living their best and most good lives", "heatherljump": "Family/friends, celebrities, and dogs - I want to smile when I’m on Instagram", "afinch67": "What a delightful pic. 😊", "earnshizzle": "Jeeez Hannah... where to begin. I’ve followed you for a heap tonne of years and honestly just think you’re down to earth and make an effort to understand how your messaging affects many different groups of people. I think you’re a great intersectional feminist - one that I’m doing my best to follow in the footsteps of. But I guess in terms of this post, it’s important we share ourselves, like you are (for me it keeps me sane). But taking about and being aware of what that looks like and not wanting your page to become self serving is pretty damn cool in itself.  The people I follow are generally friends and people I admire for the work they do. And of course, we can’t forget the cat videos for the wholesomeness.", "cupcakedninja": "I think I like to get aesthetic inspiration/look at people’s outfits, whether they’re posting saying “look at my outfit!” or posting for another reason with outfit included 😅😆", "simply_maya_b": "I follow a whole weird mix of pages and people, because my interests tend to be all over the place - I'm subscribed to over 500 channels on YouTube as well, if it's any indication! I also work in social media, so instagram is unavoidable for me, might as well make it interesting!", "iamman95": "I follow a strange mixture of things on Instagram. Friends and family obviously but lots of accounts I follow are to do with my interests - H.E.M.A.; Star Wars; sexuality; environmentalism; mindfulness; motivation; mental health; Buddhism - who I follow on Instagram tells you a lot about me. @hannahwitton, you keep posting as you have been posting. I follow you for a myriad of different reasons - you're someone of a similar age who appears to have their shit together and I hope to improve myself by your example; I've learned a lot of useful stuff from you online; I think your views on certain issues are insightful; and sometimes you're very funny. Even saying you feel this post is self-serving is helpful because it's saying it's okay to doubt yourself a little. Keep being an excellent example for young adults, keep being a much needed educator on a subject a lot of people want information on but are afraid to ask about. Keep up the good work!", "lily_the_cat_nd": "Mostly cats and quilting 😂", "sextalkwitheleni": "I follow about 1/3 friends, 1/3 miscellaneous and 1/3 sex education/sex positive accounts. I had a very similar crisis about my own posts on instagram, and whether I was putting any ‘good’ out in the world. So, now I put sex education in the captions of my images and I’m having a fab time with it! 💦☺️", "belairophon": "Your chompers are impressive!", "arianeargyris": "Instagram is my daily source of art/diversity so I try to follow pemople who make art or make content that remind me of the immensity of this universe ahah", "parmesan_dra": "Most of my friends and family only use social media to lurk on each other. Some of them never even post anything but they like every single picture I post but never comment. 🙄 I mainly follow musicians to get footage of concerts and their „backstage“ life or look at pretty pictures to get inspired where to travel to next. I also love people who actually get off their a** and try to change the world for the better. That’s why I follow you. 👍🏻💪🏼You inspire me! No worries, we know you are not turning into a Kardashian just for posting a selfie every once in a while! 😜 don’t be so hard on yourself! 👌🏻", "carveyourpath": "Activism 💪🏼", "mattybwestside": "I follow people who inspire me: whether it's artists who make me want to draw, creators who male me want to create, or just people posting about themselves that make me want to love myself more, it's all inspiring somehow.", "lorcaesar410": "😍😍😍", "kujmous": "The only people I follow specifically on Instagram are photographers and one model. For the most part, it's an extension of twitter for me.", "_leonastone_": "With one account I follow people or projects I am inspired by on the topics of sex and mental health and on the other I follow craftspeople, herbal medicine and spiritual wisdom. There is some crossover 😉", "bulba__": "I started following you IG because of how open and true you are towards your scar. I have one identical to yours and you gave me confidence, so you’re allowed to be a tad vain and impulsive because why the hell not ahah", "gabyk_lib": "I have a Facebook, two Twitter accounts and an Instagram. Gotta be honest. I'm bored of Twitter- too many aggressive opinions by strangers. I like Facebook for the family and extended family feel even from non blood relatives and Instagram I like fun and soothing pics. I love cute animals, clips of my fave shows like Star Trek and glimpses of friends and others lives. I think too many selfies gets dull but for me.if ya wanna put out the odd - I love my new hair post (or preferably I love my new hair story) it's not going to put me off really.", "ellie__chandler": "I follow people that I idolise and aspire to be like. These people tend to be authors, vloggers, body positive activists, feminists, etc 💕"}