{"finlaymackaydesign": "GWS ❤️", "magictardis": "I just got diagnosed with #ulcerativecolitis today. It’s part of my life now, it sucks but I just have to keep moving forward. Your an inspiration @hannahwitton ❤️", "chocolatewestie": "We are awesome!! I’ve got fibro & M.E then a few other health issues. M.E is really kicking my ass this last week, lost last weekend, missed out so much 😢 But we then get up & smile 😊 we really are super hero’s! Well that’s what my 8yr old calls me.", "theincrediblemayo": "wait wait wait is my phone glitching or are you actually here in hamburg?", "xjowarrenx": "So I was on FaceTime to my boyfriend and he goes “Babe what is a menstrual cup?” So I explained what it was and why people use them he didn’t say anything until he said “what...the...fuck... there’s a REUSABLE PAD! I’m so glad I’m a man” 😂😂😂I think the internet has traumatised him", "wonderfulwanderings": "Hope you get better soon! Happy I got to do your assignments yesterday😊", "hujsak": "Yeah, flares suck. I usually get mild ones while traveling with eating out and having different booze than im used to. It does get in the way of life. Hope you are able to get your disease under control soon. Best of luck!", "domesticdiva53": "Hang in there lovely.", "enjcltaire": "this is a mood i love you", "pnndpenning": "I was a sufferer of colitis 🙄🙄 I had every thing removed & it was the best thing I have ever done 🤗🤗 no more pain. Go for it. I wish u health & happiness 😁", "feedgeneralstore": "Glad you got that appointment sorted 👌🙌", "fangirldaily": "Honestly, the worst feeling cancelling plans or cutting them short. Ive had health issues for 13 years and its honestly so debilitating on the mind when your body acts like an arsehole", "lottylangdon": "🖤", "thousandmilesgirl": "I suffer from rheumatism and I feel you!! We've got this, stay strong #autoimmune #fight #spoonies", "aly55ia_": "So pretty!!!😻", "ila_amu007": "Pretty cool....", "ricaroo19": "@whatsmybodydoing my body is dishing out Anal cancer again. 🙍🏼‍♀️I’m in the road to a stoma at the end of March and I will be glad for it to be done now. #getthisthingoutofmeimmediatly! I’m sorry you are feeling poorly again @hannahwitton .", "justaspooniegirl": "Thankyou for this! I've been struggling with the unpredictable nature of chronic illness lately, but knowing you do too when you are so successful gives me hope. ❤❤❤ hope your flare ends soon Xxxx", "zoepaatz": "Feeling this at the moment!", "xoxokirstyelizabethxoxo": "I need to call my ibd nurse 😢 azathioprine just isn’t working!! Hope you feel better soon. #crohnsdisease", "chronically_emily_": "Spoonie right here! (UC warrior!)", "walwanisp": "Happiness!!😍😍😍😍", "jndogss": "I have Crohn's disease myself. My remicade treatments usually keep it under control with small flare ups every now and again. I'm thankful it's not bad enough to have surgery on it.", "mrsb13x": "My husband has UC and is getting worse, not better. He self injects currently but that isn’t working and life is hard for him at the moment (not wanting to go out etc). What meds did you try before your op? Xxx", "alanahfrances_": "You look INCREDIBLE. Thankful for having people like you to look up to in this mess of a world 💞 @hannahwitton", "zoksilv": "I am amazed by what you do while being chronically ill. I’m stuck in bed every day and mourn my healthy life, but I hope I can get to a point where I can still put on a brave face and show everyone how awesome I am. Thanks for showing us that it can be done!!!", "emilyjackbutler": "💜💜💜💜💜", "haleyshealy": "The fit ❤️", "samflag": "Loving the haircut hannah ❤️❤️", "jen.marie.usa": "Love your outfit", "benfra1": "Your an inspiration to a lot of people! Im handicappable too!", "namastiger": "❤️❤️❤️❤️", "rachel_weaves": "I’m currently in a nasty UC flare, so I FEEL YOU. Literally read this from my bathroom.", "harriet_s_t": "Good luck with your appointment. Trying to get my own sorted because I think I'm heading into my first proper Crohn's flare up in 12 years... Nothing like your friend buying you lunch and then seeing in reverse a few minutes later.", "emmajayo": "I’m traveling right now and it is so hard realizing that my chronic illness is GOING to stop me from making the most of every day. There are things I want to do that I just can’t. It’s been 14 years and I’m still not coming to terms with it, still calling myself a coward and lazy and weak, and if I tried harder I would be able to do everything I want to do. I am ashamed that I am letting my illness dictate my life. It’s so hard. Sorry for venting here", "larissakoedood": "We’re trooper poopers! Lololol it’s too early for a Saturday. I have recently developed IBS, and the fear of having cramps and having to run to the bathroom is becoming quite a thing these days.", "myoki_van_den_heuvel": "You sure are a trooper!😊", "louu_scorer": "@hannahwitton I’ve always meant to ask, what does #spoonie mean?🙋🏻‍♀️", "jilljill24": "@kellygreenhalgh87 💕💕 saw this and thought of you", "hollyclearyy": "I have endometriosis, and it’s just horrific, but we can always try our best to look on the brighter side of life! thank you for being so open about your chronic issues, because it really does help us to be positive ♥️", "charlie88": "Gorgeousness", "mssophielaura": "I’ve got Crohn’s and I relate to what you’ve said 😞❤️ But it’s nice to know that there are people who understand and I’m not alone, I really hope you feel better soon 💛💛💛", "taybowieling314": "hold on you're in hamburg?! feel like coming down to mannheim any time soon?💕", "alisha.vernon": "Are you on suppositories?? Pentasa ones helped settle the blood which came from my rectal stump xx", "monksnaps": "It's things as trivial as seeing events on the calendar pass, expensive train tickets wasted, letting people down, etc, on top of the chronic illness... Like that isn't enough. 😢", "fayezyfizz": "Yep my rectum is giving me grief toooo 🙋🏼‍♀️ 🤦🏼‍♀️. Big ups all the fellow IBDers 😘 xxx", "goudvis888": "♥️🦔", "baguettes_save_lives": "You're an absolute icon. I was diagnosed with asthma just over a month ago, and I'm still struggling to adjust to having a valid reason why I can't do certain things, and having to miss out on stuff because my body just decides not to work. Seeing stuff like this makes me feel a bit better. 💜", "sleepymcninja": "Pooper troopers🤣👍", "elliephant89": "I have adapted my plans rather than cancelling tomorrow, my friends are going to play mini golf while I read in the bar. Then we are all going for pizza and more cocktails 🙌🙌", "ima90schick96": "Awh hannah :( i thought with your operation the flare ups with stop happening :( i hope it gets sorted soon its awful x", "lynseyj__": "My partner @frayzurr went through the same thing. You both are strong, inspirational people. 😍😘 Xx", "lydia_beckx": "My asthma has flared up to the point I stayed 3 days in hospital im still recovering and god have I got fomo", "katy_la183": "I've also just learned today that my surgery to remove a lot of screws and nails from my spine and pelvis cannot happen as planned. Apparently I need to contact a different hospital that has the correct fitting tools in the OR. So I'm back at square 1. Aaaaaaah!!😤😢🤤!But as you say, Hannah, we are troopers!! #nevergiveup #dowhatyouthinkyoucantdo #spinalcordinjury", "qualiteacontent_": "chronic asthma!! i miss out on a lot of activities especially during winter because my lungs literally cannot cope with being outside for longer than an hour at a time when it’s cold", "backinastitch": "I feel ya. Had to deal with so many butt problems today. Endless reschedualing is, eheh a pain in the butt 😄😉", "whatsmybodydoing": "Unrelated but this is such a CUTE LOOK", "not.your.average.colon": "💪🏼💪🏼💪🏼💩💩💩", "hannuh.warren": "pooper trooper!", "pyromastyx": "In the middle of a flare-up of... something to do with my gut. I have a 13-hour flight Monday, and I'm worried. Least I know my biggest food triggers and can avoid them.", "chuso47": "I hope you will be better sooner or later.😚", "autumnshaymartin": "Love you! 💕 Btw, possibly dumb unsolicited advice, but I have IBS and I just realized a couple of months ago, after 8 years of symptoms, that tight belts and waistbands REALLY aggravate flare ups for me, and it only occurred to me after I saw another person with IBS post about their problem with belts. I think our stomachs just need adequate room to do their work, so I’ve been sitting like a grandpa at thanksgiving with my whole gut hanging out anytime I can, and it’s actually helped a lot lol. So there’s that.", "noosie_": "I’m currently undergoing investigation as the hospital think I have ulcerative colitis, I’ve trained in colorectal surgery for 6 months but the whole prospect still scares me 😔", "joeyd614": "Take care of your health first so that you can have more fun later...❣️🔥🤗♥️😍🌹🌷🌹", "letsovershare": "I have endometriosis and fibromyalgia and I am under investigation for probable IBD. I totally get the whole, illness getting in the way of life sometimes. You gotta take those wins and be kind to yourself on the bad days. 💗", "alternosphere": "Okay but you look bomb 😍", "xdenise97": "I don't suffer from a chronic desease but as a nurse I love to see you living life to its fullest. It can be a pain in the ass (no pun intended) but you are an idol to many boys and girls, women and men out there. You are appreciated and loved. You are beautiful the way you are. ❤️❤️❤️", "joinxthexdots": "Go Barbie butt 🙌💜", "littlepinkstarsally": "I'm having issues in the same area. I've got a temporary ileostomy which was supposed to be for 3 months but I'm now 6 months with it. The reversal has been delayed due to fistula and god knows what else is going on down there. I do wonder if it would be better to get rid of it and get a permanent stoma.", "namelessssarah": "Much love for this post ❤️ If only we could know when symptoms flare up, I hate having to cancel plans but often have to! 🤷🏻‍♀️ For the last year and 3 months I haven’t been able to work because my chronic bowel problems! Literally now it’s me and my bowel first and then every other relationship in my life follows! Who knew one organ could cause so much havoc?! Sometime I just have to laugh about it or else I cry lol 😆", "ejgeyy": "@hannahwitton I sympathize so much, currently waiting to see whether I have celiac and it honestly gets you down having so many horrible symptoms 💗xxxxx", "cassidy_sage97": "Had to cancel plans recently because my fatigue was so bad I couldn’t lift my head up and I sobbed all night because I felt so bad having to cancel", "hannahsaywhaat": "Sorry but I am LIVING for this outfit and now need a banging pair of high waisted black jeans (but you are such a strong cookie and are absolutely soldiering through everything life is throwing at you♥️)", "alexesther": "I had a rare off day yesterday. Ups and downs. I didn't feel well enough to get the task done but I drove over, got it done. Now I can move forward.", "maya.iisabel": "I really needed to see this today!! I've been in a flare up all week and i dont know why and I'm so frustrated!!! Doctors don't exactly realize I too have a life and want to be doing things. Instead they push off crucial testing for months instead of helping.", "euaggeliafr": "I truly admire you so much! You make me feel so empowered you are a role model for so many people including me 😊", "_justcol": "Thank you for sharing the realities, forever grateful for you, sending love ❤️", "frankiemillard": "❤️❤️❤️", "flawsomedandelion": "Amen girl, I feel you! I currently have to cancel so many things cause of a flare up, annoying ugh 🙄", "hellieviegas": "Oh noes! I hope you feel better soon! How long are you in Hamburg for??", "prettystuffandfood": "We are definitely troopers! Sending positive vibes over to you! Take a breath and clear a bit of your headspace so that positivity and positive things have space to enter.", "ellynlouiselaws": "Thank you for speaking up about this! I’m waiting for my third kidney transplant, but first as an adult and I’m feeling so left behind! ❤️🙄", "naturallydenise": "I FEEL YOU!!! I have Crohn's disease and last June I had surgery. Now I'm also having a flare up... 🙈 I hope you feel better soon 💪❤️", "emma.pocock": "@barry_happy have you spoken to Hannah? Not sure if you’re familiar with her but both of you are super inspiring and have really opened my eyes to the everyday need to be sensitive of those with ‘invisible illnesses’ ☺️❤️", "roisinellier": "Currently sat on the loo with the struggles of fistulas caused by my Crohn’s disease so I FEEL ya girl ❤️", "swervature": "It may be getting in the way, but I bet it's it's not the shits ;)", "peggy.kellettjones": "I suffer with chronic back pain (caused by nerve damage throughout my entire lower back) and I know it's not the same as what you experience, but you really encourage me to push on. Finding your Instagram has really helped me have a happier outlook on life, and I just wanted to say thanks ❤️", "mattnav_travel": "Keep being awesome Hannah 😎 (btw I spotted your cameo in Jay Foreman's latest video 😉)", "ljaytee": "This is my life at the moment - bum death is the worst death imaginable. Chrons not colitis but I feel the struggle", "emsladedmondson": "💗", "brettcarrutherstrash": "So what's next in trying to fix it?", "laurenatalie": "I feel your pain 😞 currently on infliximab for Crohns and due my infusion on Monday. Suffering with all the stomach cramps and phantom urgency right now. IBD is so tough, us warriors always stick together 💪💪 ❤️", "jayadams215": "Same has been happening to me for the past year. The plan is to get the butthole bit removed at some stage this year. Dreading it even though it's an ACTUAL PAIN IN THE BUTTHOLE!!", "bri.lovehavens": "Stuck in bed this morning with a really bad flair up and feeling alone and like I'm going crazy. Thank you for these posts. 🖤", "glyn.davies.9": "I hope that the hospital visit results in an improvement in your conditions.", "hly.witt": "This pic is cute af", "gemmakhone": "Thanks for this, for being real. I feel your pain though- CHRONIC ILLNESS SUCKS! I hope you feel better soon ❤️", "ericam8x2": "When they ...REAR their ugly head 😂😎😻🤷‍♀️ fingers crossed things can get sorted out!", "kathrinepandell": "I have food allergies and an immune system weakness so when I'm having my flare ups I'm stuck on the loo for hours a day, I hate all the things I miss when I'm just pooing 🙃 I can't even just go to bed and sleep it out because I HAVE to sit on the loo... 🙄", "muckyfingers": "Hips don’t lie", "elliemaysletters95": "I feel ya 💜 i hace a chronic bowel adhesion problem from previous surgery and, after 3 years of freedom, have had 2 hospitalisations in the last 3 months. I also got told at a checkup yesterday that there's no real way of avoiding it...or prediciting it...Its a real bummer (geddit)?", "thatfibrolife": "💜💜", "nolwazinkwandla": "This brought tears to my eyes. I'm currently struggling with y blood sugar due to diabetes and me not eating the way I should. I need to remember that although my diabetes is limiting me right now , I can still live a full life. Thanks for that @hannahwitton ❤️", "pauljeremiah": "❤️", "laurenbedford13": "i’d share my spoons with if i could my love, i hope you get your answers soon💗", "_s.m.k___": "Literally fuck butthole symptoms this shit is ANNOYING", "invisiyouth": "Totally understand this struggle @hannahwitton!! Navigating life with chronic illness, especially as a young adult, is an art form👊👊", "leahdawn98": "Hannah I understand this completely. I have a chronic illness and just when I think things are going well, I crash and have to miss out on a load of stuff. Be strong, you will get there, and you have the whole community’s support. I know it’s so upsetting. But remember all the good days too. I really hope you can get this under control. 💜", "womens_glamorous_fashion": "Hey gorgeous!We love your pretty style.DM us for getting a surprising offer.We just got for you.😍", "competent_equestrian": "You're amazing!!!!!❤️❤️❤️❤️", "lorcaesar410": "Wifey🔥🔥😍😍😍😍 @hannahwitton", "niamh_kempton_": "i possibly have ulcerative colitis and i’m really scared", "litenogfehn": "Yeah girl! My endometriosis is such a pain like that. We can do this tho 💪💪💖", "zoecollins1994": "Love you for this, Hannah. Thanks for reminding us spoonies so regularly that we've got this...and so have you 💪💕", "bubbletiii_": "You are seriously an inspiration I have Colitis and it pretty much sucks in moments like these! I found your YouTube channel around the time when you got your stoma bag and saw what a badass woman you are which gives me strength that maybe someday I can be a badass woman like you at least a little bit! 💛 Love from Germany 🙈"}