{"annaadsett": "'Just keep swimming' helps me to just get through this difficult task or day cause i know it WILL get better!", "mckoss": "It is adversity that makes us stronger. Thank the universe for helping you become a stronger person today.", "aniwaniwa.xo": "No! But i do need to start my collection", "heloisehami_": "I just go for a run. Sweat all that shit out.", "mieliboo": "I tend to have a \"I've survived all of my bad days so far\"", "josefienswennenhuis": "I listen to music that I reserve for those days! My playlist consists of songs like Dancing In The Moonlight, This Will Be (An Everlasting Love), and Surround Me", "thalia_soul": "I have this coffee mug that says: \"Cry a river, build a bridge, get over it!\". At the beginning drinking from that cup helped me pusg through tough moments, meanwhile saying the mantra in my head already helps... I love the idea that you shoyld be allowed to take time to feel bad an even sorry for yourself when things go wrong before working on a constructive solution. And finally, \"getting over it\" and myself helps me to take my own hardships with a pinch of self-irony, always remembering that no matter what is going wrong right now, overall I am a very lucky person. Plus, struggling means that you care and sometimes we need to remember how beautiful and fullfilling it is to truly care - about a specific cause, a professional career, and also our selves.", "katiec1743": "I say to myself if things get a bit too much: Deep breath, everything is going to be OK; tomorrow is a fresh start. I also use @whitneyysimmons ' mantra: Its a beautiful day to be alive. I hope this helps you Hannah.", "uli.tschi": "My mantra when minor things go wrong and i'm constantly contemplating giving up is \"Don't kill my vibe\". One time my Computer deleted almost all references in a 25 pages paper - which nearly had me breakdown crying. But then I didnt let it kill my vibe and made it through.", "lessrubbish_rach": "Everything is gift! No matter how meh it is, you can learn from it and use it to grow! - I think @adrienelouise says it in one of her videos xx", "pauline_levesque": "Love that dress and hope you're better soon😍", "outesspace": "I honestly still haven’t figured out how to fight this type of feelings, I guess I just go on with my life and wait for time to do its thing (as well as spending time with my friends and doing the things I love); I can only hope you’ll feel better soon!!", "jopineapplesuk": "Mantra ..everyone deserves a little forgiveness.", "autumnhaworth": "Looking in the mirror and talking to myself how I'd comfort/hype up a friend is always a good start for me. Even if I'm not 100% it puts me at a point where I'm ready to face the day", "claudia.rose.d": "My personal mantra is \"prima o poi tutto passa\", which is the Italian for \"sooner or later everything will get better\". I took that from a book I used to love when I was a child, as it's the phrase a warrior princess recites as she nearly faces death. For some reason this mantra has stuck with me so I instantaniously feel better as I think those very words 💖 have courage and be kind dear Hannah, you'll see that prima o poi tutto passa, for real 😚", "philthecaveman": "I've had a similar day, I feel your pain! I always just say \"it'll be fine\" and generally it is in the end.", "oddreyrutherford": "I love your earrings!!", "mrsoftalk": "Lovely Photo of you", "fely0022": "Beautiful", "ricaroo19": "I tell myself, It’s ok, ride the wave, this won’t last forever. Allow yourself these moments Hannah, it important for your progress. Xxx", "c2floors": "See a solution - not a problem", "rosehexe": "New/fresh start tomorrow, and that it is normal to have awful days. Sadly they happen too 🖤", "dario_prespljanin": "💋💋💋❤️❤️", "cautiously.drafted": "You don't have to do today again. It's something I read in someone's caption the other day and it changed my usual \"tomorrow is another day\" forever. Whatever happens tomorrow, it will never be today all over again. It's heartbreaking in the grand scheme of things, but utterly comforting at the end of a difficult day.", "intvlt": "Oh and my molly and I say it's not the end of the world a lot", "xanderb100": "I tell myself that though today may be bad, there's a whole future to look forward to, and it could be so awesome. I'd hate to miss that", "lynseymac1": "I don’t really have a mantra, but I find @morganharpernichols and @thelatestkate’s accounts really comforting if I’m having an anxious day! 💕", "emilyjackbutler": "Now that it’s been a few hours: That lip color really brings out your eyes.", "amieeb": "“You can do hard things” is something I tell myself when I’m struggling. But I also second @morganharpernichols like every post had me feeling like she’s seeing into my soul.", "spuriousdiphthongs": "You never have to do today again.", "courtdelaknight": "The pattern of your shirt? Gives me feelings 💛", "ginger_cowgirl": "I just mumble “plot twist” and move on. This might also be yelled to the heavens if no one is around. It tends to help ☺️", "carterplasek": "Not so much a mantra but \"you're not alone\" from there David Bowie song \"Rock and roll suicide\" always reminds me of the better days.", "liebthaltweiter": "I felt similar yesterday. I told myself it's pms, because it usually is and that helps me understand that the misery isn't based in reality and also won't last. I also try to find ways to not wallow in the bad thoughts, because in those times, that rarely helps. (didn't much succeed with the last one though lol I cried lots)", "zooeyschmooey": "March 2018- this past week has been exceptionally non stop for me with periods of hibernation followed by a flurry of changes and it has been hard adjusting to it all while having to let deadlines pass me by with nothing to show because I was too burnt out to do anything. But the thing that has keep me afloat through it all was remembering that I am feeling whatever I am feeling for a reason and if it needs to be felt I will let myself feel it.", "elysermnpp": "Omg I have the same dress! One of my faves 🌻 I’m feeling down today myself, gonna read through the comments. Thanks for posting 💛", "zoe_cheney": "I don’t really have a personal mantra but sometimes I talk with my friends", "theorap22": "As a Yehudi Meshechi, I find strength both in the teachings of TNKH and the Brit Chadasha. But that's me. Maybe they can you some insight.", "oli.kathleen": "I always think \"I've felt happy before so I'll feel happy again\" and I'll keep repeating it to myself until I believe it 🖤", "heatherlucy98": "“A little too much” Shawn Mendes helps to pick me off the ground", "jennypearson400": "“The best project you’ll ever work on is yourself” reminds me that nothing is as important as my physical and mental health and that if another project isn’t going well, that’s fine, so long as I am happy and growing and being the best version of myself. ☺️", "lucy.j.smithx": "‘You have been assigned this mountain to show it can be moved’", "liseklevstuen": "I always think: Either it will be okay, or it will make a good story!", "aleasilver": "Always look up. You'll see and do the most beautiful things x", "caroline.shirlaw": "@val.laurie3 this is who you should follow x", "n5syr": "Look at yourself in the mirror and say\" I am a sexy-ass unicorn. I know it and your approval is NOT required!\"", "hopelesshearrts": "My 2019 mantra is ‘make it work’", "jbyrd46074": "Cute!!", "brigitte_is_writing": "Things are always changing. Tomorrow is another day.", "chandrawijaya2407": "Love it❤️❤️❤️❤️", "_priscilla_hill": "If I'm having a hard time or struggling with something and i'm getting frustrated i say \"it's fine\" \"you're fine\" a couple times and its just habit now and it keeps me collected", "jenniferwlynch": "“Will this bother me/matter in three weeks?”", "torshabhattacharya": "I take a deep breath and repeat \"THIS TOO SHALL PASS\" 💗", "tonyr3284": "Beautiful photo😍😍😍", "ruth_high": "😍🌻x", "asifclocksdidnotexist": "My mantra/coping mechanism is that I always make sure to laugh and smile every day. So even in my worst depressive episodes, I am always watching sitcoms and looking at memes. Those are nice because they’re not connected to my self worth or stressors, just reminders that I can also feel joy.", "chuso47": "I'm unique.Life is stunning!", "kaitlynwithakay": "It’s kind of an inside joke, but mine is “you are a valid human being!!!”", "line.of.books": "My mantra is \"I am a flickering light, but a light nonetheless\". Came to me after a particularly emotional acting class two years go and has stayed with me ever since."}