{"lii_books": "I've just started Silence of the Girls, and am really excited about it!", "symptomaticstardust": "where is this jumper from!!!", "outesspace": "under the volcano for my literature class!", "woolleyhead12": "Currently doing essays on Dolls House by Henrik Ibsen, Miss Julie by August Strindberg, Taming of the Shrew and the Duchess of Maldi by John Webster 😪📚👓", "ebonyedmonds_": "I’m reading five feet apart currently, it’s brilliant", "therealmisshitchcock": "Currently reading Everything I know about Love, by Dolly Alderton. Everyone should read it!", "deeizzie08": "I’ve 5 books on the go in paper, kindle and audible. Seven sisters by Lucinda Riley. The corner shop in cockleberry bay by Nicola May. Sea of Memories by Fiona Valpy. The ultimate self help book by Yvette Taylor. The one you really want by Jill Mansell.", "cathyadams91": "1st game of thrones book!!", "wellthereigo": "The Republic of Thieves and The Final Empire.", "hklovesloths": "I just finished “the art of asking” by Amanda Palmer and next I’m reading “the things I would tell you: British Muslim women write”", "cliffany_1022": "Rose and Rosie’s Overshare", "wuetendesglas": "I'm reading 'On Beauty' by Zadie Smith. Have to say it's not my fave book by her but I'm still enjoying it a lot!", "pyromon": "I've started Circe by Madeline Miller and im in love 💖💖", "justmissshaw": "Children of Blood and Bone by Tomi Adeyemi. On page 74 and really enjoying it so far.", "scottroberts4042": "Where did you get the sunflower poster in the background?", "lovelylollyb": "Not able to respond to your to do list on stories, but I’d be really interested to know your thoughts on Bonding. I watched it, all in one go, & really enjoyed it, BUT, I think it’s only really enjoyable as entertainment, I’m guessing that sex workers aren’t going to be that thrilled by it...", "wortmaus": "An anonymous girl", "kinimodd93": "Reading Book 1 in the Throne of Glass Series by Sarah J. Maas", "kelly31987": "you look amazing 👌", "joel.champion.9041": "I love you hannah. Your biggest fan and crush. Keep up the good work. Love ya always for better or for worst. Your my hero. Xoxo", "sabinevddrift": "I just started reading ‘The Reader’ :)", "satkills": "U look like a hotter version of Emma watson 😍🔥", "lucchi_supremeson": "The video you did this day was very interesting ❤️", "aleesha_fran": "@hannahwitton I love that lipstick! What is it?", "annessrup": "Tales of Beedle the Bard.", "swedish_rose": "Anne of Avonlea! I’m finally trying to read the whole series, and not just Anne of Green Gables.", "eviltwin96": "Started reading Educated by Tara Westover after your favs video and ❤️❤️❤️! You tend to suggest things I'd never pick up on my own, but haven't been disappointed yet!", "snugglingonthesofa": "I'm just about to start Aurora Rising and I'm so excited to get into space!", "laurene_gt": "It's a brilliant book! So is Normal people (which I actually prefered)! Enjoy!! Everyone should read Eleanor Oliphant, don't you agree @missele12? It's bring much more tolerance and empathy in the world.", "despicablem3l": "Aurora Rising by Jay Kristoff and Amie Kaufman", "heloisehami_": "I'm reading Lethal White by Robert Galbraith (JK Rowling) and I just can't do anything else 🙌💘💘💘", "popynes": "Too many things at the same time 😱. But mostly Harry Potter and the order of the Phoenix (which I have never read, I know I missed a whole part of my childhood), a Sherlock Holmes and a book about badass women who have been forgotten by history.", "kimfacethecat": "I've just started 'two can keep a secret' it's very intriguing at the moment so looking forward to where the journey takes me", "verityroatlanguagesolutions": "Love in the Time of Cholera. Had my copy since I bought it from Shakespeare&Co in Paris about four years ago and finally getting round to reading it!", "lucyamoulds": "Lanny by Max Porter 🤓📚", "kate.ellerton": "The seven deaths of Evelyn Hardcastle, it's an Agatha Christie style murder mystery but it's got a huge twist and omggggg it's so good", "mayahjh": "I’m ready the City of Brass! I rarely read fantasy but I’m really enjoying it!", "sara_m_martins": "Good Omens in preparation for the series release at the end of May", "isabellazella": "Love it.", "danielle_ferrel": "A Gentleman in Moscow", "frederiksen_dan": "I don't read books. It's like radio or podcasts. Just fill timeslots for money.", "anniefwrites": "Am I There Yet? By Mari Andrew and it’s such a quietly wonderful book with lovely illustrations!", "katie__bethan": "I’m half way through Conversations with Friends and I cannot put it down honestly you will love it I want it to last forever!", "asingerwithaspringer": "I've just finished Eleanor Oliphant is completely fine and I really enjoyed it! Deffo recommend it. Have started 'My body and other parties' which seems quite different (short stories of women and sexuality). X", "lyndan_h": "King of Ashes by Raymond Feist", "avis03": "Showmance by L.H. Cosway", "princessboub": "The Lost Girls of Paris... first historical fiction in a while so lets see how it goes!🤷‍♀️", "saridhm": "oblivion a memoir🇨🇴", "sensorcelled": "Tricks of the Mind by @derrenbrown for research 😂", "tao_gadd": "The graphic novel “Marbles” by Ellen Forney!", "chronically_emily_": "Crooked kingdom - Leigh bardugo. It’s amazing😍😍", "laurenbedford13": "i literally have this jumper saved as a bookmark on my phone to remind me to buy it... i may just have to copy you now😂", "lanttsss": "The truth about keeping secrets 😍", "lucymarymain": "'Brave New World' by Aldous Huxley, it's very thought-provoking! 😀", "awritedreamer": "I need that jumper 😍😍 I’m going to start re-read Harry Potter like I do every year around this time!!", "irisma03": "The Kingkiller Chronicles, The Wise Mans Fear. It’s taking me ages tho,I’m 800 pages in after 3 months and have another 300 to go 🙄but it’s soooo good! Wish I had a little bit more time to read", "mandiapple": "Smoke and summons. A really fun fantasy novel series.", "alohaitsmaddie": "Welcome to Night Vale! Exact same tone and humour as the podcast, no idea where the plot is going but laughing along the way", "the_unicorn_with_a_camera": "Great jumper, might pick one up as I'm a part time librarian😊 im reading Dreams from my father Barack Obama and loving it!", "lucaselliothilton": "Yellow is definitely your colour 💛", "flaherty_aisling": "Read her book \"Normal people\" it's brilliant", "jessnorman8254": "Three things about Elsie by Joanna cannon. An amazing book that will make you laugh & cry. Brilliant read", "hannahrose99_": "where did you get this sweater? 🥰 and i’m reading from twinkle, with love!", "c_hiney": "Just finished Becoming by Michelle Obama and started reading The Power by Naomi Alderman!", "xmanoek_": "Listening to On the Come up by Angie Thomas right now", "ilsedewilt": "I’m reading the beauty myth! Definitely a book that makes you think! Short but powerful!", "immy_hd": "Reading Mansfield Park right now ✨", "_oneinamil": "I’m currently reading Rich People Problems by Kevin Kwan (the third in the Crazy Rich Asians trilogy) and loving it!", "emfoulds14": "I need a t shirt like that haha 🙌", "ahlakritz": "read part of conversations with friends and then skimmed through to the end at one point...hope you enjoy it tho!reading pete buttigieg’s memoir rn", "judicadd": "Ugh I just keep buying books and not reading them 😩", "chris_huff_photography": "Just read Everything Everything (forget the author) but it was fantastic, read it in one night", "l_robertsx": "@hannahwitton I've just started Game of Thrones books", "sarahgrimey": "Just finished \"the silence of the girls\" by pat barker, definitely recommend!!!", "elysermnpp": "It’s so good!!!!", "glyn.davies.9": "The Butchering Art by Lindsey Fitzharris. The story of the revolution in surgery made by Joseph Lister. Perfect for a history buff.", "hammysynne": "My Soul to Take by Yrsa Sigurdardottir🙌🏻", "myspiritualpursuits": "Pussy, A Reclaimation... Bloody brilliant! Have you read it? Xx", "jennifer.claire": "Great book!! Really enjoyed it. :)", "tolstojsniece": "Currently reading Lady Chatterley's lover! I really enjoy it, too.", "shinshan96": "I would love to hear your thoughts on this book! I finished it recently and still not sure how I feel about it. Currently reading Milkman by Anna Burns 😊", "thesalalmon": "I just finished Our Homesick Songs by Emma Hooper and it was AMAZING.", "ginalearmond": "Happiness for humans, actually loving it!", "liagroundwell": "The Book Thief - 100% recommend ♥️", "rosie_camille": "Part way through 9 pints by Rose George. The amazing story of blood 📚", "jamietanzer": "Your book 🤗 my bf got it for me for my bday yesterday!!!", "lily_rae99": "You look super cute 😍", "simplychritter": "My nerdy self is reading the third Resident Evil novel, City of the Dead 🤓", "illuminatedrain": "I'm slowly getting through Gargantua and Pantagruel by François Rabelais. Not sure if I'm liking it!", "arunscullerjackson": "The Simpsons and Their Mathematical Secrets by Simon Singh. Incredibly nerdy stuff but mind blowing", "heather_hrrsn": "The Help.. addicted!", "toupet_drine": "My sister recommand me the After serie. I juste bought them at school and I can't wait to read them!", "tinelogan": "I loved Conversations with Friends! Same though, especially at the beginning I think what gripped me most was the fact that I had no idea where it was going 🤷‍♀️", "baldybaldwin": "I have this jumper! Weirdly excited that we have the same one 😂 I'm reading Confessions of a Sociopath and loving it 📙", "kellycavolo": "The Lowland by Jhumpa Lahiri! I've wanted to read her books for years and just got around to it", "books_and_wonder": "I started The Hunchback of Notre Dame a couple of months ago and I am now continuing with it (this time probably more sad)", "biddibee": "The Remains of the Day by Kazou Ishiguro! Just started but I love his other stuff so I have high hopes!", "jennallondon": "I’m just about to start Do No Harm by Henry Marsh. I’m currently halfway through Blueprint by Robert Plomin but I’ve had to put it down until I get my genetics exam results back 🙈 LOVE the jumper", "alexandra__mcleod": "Away from you by Melanie Finn 📚", "erikaasvensson": "Currently rereading Dances With Wolfes", "avron18381": "In one year (quite some time back) I read 200+ books. I owned 50+ I had not read at that point. The two are not mutually exclusive.", "kiradonald": "The Flatshare by Beth O'Leary. I'm absolutely loving it, I haven't been able to put it down!!", "vagentzero": "@ciaosamin 's Salt Fat Acid Heat - such a great approach on how to think about cooking.", "j_rex_gaming": "The entire H.P. Lovecraft collection. I've gotten into the whole Cthulhu mythos lately.", "hujsak": "\"Old man's War\" by John Scalzi.", "zaydaliciousdesigns": "7 Deadly Sins manga", "julianrice13": "I'm reading Che, it's absolutely fascinating to follow the life of such a controversial figure from birth to death and beyond.", "mathildefongen": "Heart, Sass & Soul by Greta Solomon. Such an inspiring book about creative self expression through writing! :D", "pauldave1987": "Just got done with ready player one and good omens would absolutely recommend both. Especially ready player one", "gershgorin": "I'm reading two books🙈 Blood Work by Michael Connelly (I love the film!) and Bazaar of Bad Dreams by Stephen King. I'm really into his longer works, but his short stories have always been a challenge for me. But the audio version makes all the difference!", "sugglet36": "Reading your recommendation: \"Prisoners of Geography\"!!!", "louisehendy": "@katiepadfoot we need", "zooeyschmooey": "Rereading harry potter but this time its the special hufflepuff editions.", "garylucas5103": "😍", "jenniferwlynch": "Just finished “You Know You Want This” and you would 🧡💛❤️ it!", "sunniva.hp": "I’ve just started reading Mythos by Stephen Fry ☺️📚", "hardik_____harsora": "Really looking forward happiness", "tamsinsomers": "I have jut finished 'Alice' by Christina Henry. A really different, slightly twisted, thriller about what happened to Alice after Wonderland. Very intriging but thrilling at the same time.", "iamman95": "‘The Sword Through the Centuries’ by Alfred Hutton. First published in 1900. A guide to swordsmanship techniques and accounts of famous duels from the 11th through to the 19th centuries. I’m loving it.", "dinnerbell_kat": "I’m reading The Master and Margarita by Mikhail Bulgakov. I’ve got just over 100 pages to go until I finish it. 🤓", "nixonsophie97": "I’m reading The Ladies Guide to Petticoat and Piracy AND that jumper just arrived for me today! ❤️", "charlottekath": "Where is your jumper from?", "missele12": "Eleanor Oliphant. So good and resonates a little.....", "mrjarwson": "I'm currently rereading two books 😂 Dracula by Bram Stoker (my all time fave!) and Norse Mythology by Neil Gaiman, such good writing 😍🙌🏽", "frombeewithlove": "I just finished conversations with friends! Found all of the characters really annoying but I really loved it 😂", "nyekawhitaker": "I have no book to read right now😫 Recommendations??", "anneboleynstagrams": "I just finished Journeys To The Other Side Of The World by David Attenborough. I’m just about to start re-reading The Walls Around Us by Nova Ren Suma. It blew my mind the first time I read it!"}