{"count_bill_dennis": "Make sure that bf looks after you and I hope you get well very soon Hannh.💝💝🙏🙏🙏", "outesspace": "Hope they'll figure things out soon!! :(( Anyways, on the meantime you are here looking like a snack", "2018as18": "Loved your my life isn't better video. Expressing lots of how I feel also even though I have a different illness. So sorry to hear this new news and hope you are getting lots of cuddles xxx", "climatizador": "Ánimo guapa!", "goodasgold_akr": "@hannahwitton My lovely Colitis in my rectum is flaring up too, be interesting what care plan they give you, it’s fun isn’t it 🤦🏼‍♀️", "ra7394941": "Hope you got better really soon x", "petrapanreviews": "If there’s one place you don’t want a camera, it’s up your bum. Sorry to hear you have to endure all of this!", "lfragaville": "I'm so sorry Hannah. Hopefully the docs can help fast.", "vincentjbateman": "In/out job no pun 😂", "claudia.grace.h": "Can you get your ass amputated", "iwantmythunder": "RIP Hannah’s rectum... hope this means no more mucus/phantom poo", "missfenderr\nVerified": "Verified", "feistymashkin": "Hugs! You are such a fighter ❤️ and my god, i honestly believe you have the best human by your side- your bf 🤗", "alexandraroseaus": "Sending from from one IBD patient to another xxxx", "tumunu": "SERIOUSLY - HANNAH: you must have it removed. It WILL become cancer. It's a matter of when, not if.", "supersofia": "But you are beautiful in this picture...", "ashhardell": "Sending all the love 💙", "cooochiequeen": "why tf is this coming up in my feed. i don’t follow u", "walwanisp": "Take careof your health my freind hannah!! 😘😘😘😘", "erinsevink": "Lots of love.❤️", "ahsanteb": "Sending you positive vibes!!", "liveitslow": "What have you tried to bring down the inflammation?", "tabitharayne": "Sending gentle hugs too 😢❤️", "frostbite939": "Wow, wondering how it could still be an issue with your bypass and hopefully, nothing going down towards your pooper b", "mckoss": "How is that even a thing?!! So sorry. 😢", "808hawnbry": "Get better soon🌹", "mizlauren2u": "Pouchitis or rectal inflammation? Just curious, as I regularly fight both", "karinasarahk": "Ugh, so sorry to hear that Hannah. Wishing you peace and a speedy recovery 💙 love from halfway across the globe xx", "syd.mazz": "UGH crohn’s and colitis can DIE", "reeceaxie_": "@hannahwitton since I had my bowel removed the remaining 20cm of bowel hasn’t had any problems thankfully! Felling for you tho!", "bigalkykevindwayne": "Hi there beautiful hope you feel better hannah", "harley22twin": "❤", "paperplaneshift": "I hope your flare eases soon!", "jojolondon8": "That’s so annoying. The seven remaining inches can cause a lot of agro! Did you do the steroid suppositories?", "glyn.davies.9": "Hopefully they come up with a treatment plan that is effective and not to invasive. Good luck.", "caffein.elf": "Sending big love, you sharing your journey with chronic illness has helped me so much to come to terms with mine ❤️❤️", "mvporange": "Good luck", "cyrin_watson": "Feel better.", "benfra1": "😢 sending prayers!", "pizzacatsezrelax": "What are the pain symptoms like if you could relate them to anything", "madisonuwish": "❤️❤️❤️", "romypanayiotis": "Fit in and out of hospital", "kitten6461": "Sending prayers! 🙏🏻 😘", "eljanefolland": "sending lotsa love!! may not have the same as you but feeling those invisible chronic illness feels for ya ❤️❤️", "adrianacalocf": "Good luck from Argentina", "ashleighnicolewatson": "Awww you poor thing. Rest up and fingers crossed for a speedy recovery xx", "rmenzies3032": "So sorry to here your back in hospital. Thought they got rid of it all the 1st and 2nd time. Not great to be back for a 3rd go. Get well soon 🥺", "oneilljoe19": "Do thy take a selfie up there 😁", "tobynickerson": "Get better soon I know chronic illnesses suck and I have a chronic illnesses but Get better soon", "dave.tomlin.96": "😲", "katka.soukupova": "Sending positive vibes 💚", "jrkirkley82": "So happy you're home....but it's got to be a pain in the ...ohh sorry......", "chronically_livinglife": "@hannahwitton how long have you had your ileostomy?", "iamsherrylsinclair": "Sending you love - I hope they find a good care plan for you 💖", "graciekemple": "Thinking of you ❤️", "llyfrau": "@jess_schof I love this woman, she brings chronic illness to a new level ❤️", "canda.dragone": ":( sending you all good vibes ✨♥️", "abisaysblog": "Hope you feel better soon Hannah :(", "phoebestreatfield23": "Sending lots of love ❤️❤️xxxxx", "ollii1995": "I had it all removed, just left with my stoma xxx", "kevin.wg.02": "I thought you were done since they cut out the infected organs", "ashleenhora": "How can u look so beautiful even in the hospital 🙈", "bkishmalion": "🙅🏾‍♂️Everything will work out 😂", "eleanormackett": "Hope you have a care plan soon, and I hope it gets you back on track! Rest up and take care 💗", "wiamlou": "You are so positive", "jbsprings35": "🙏🏽🙏🏽🙏🏽🙏🏽🙏🏽", "theoriginalcham": "that's crap, so sorry for you but at least you still look fiyah in the hospital gear", "anneboleynstagrams": "Hope you’re ok. Xxx", "laurenbedford13": "the fun never ends! hope they get a plan for you soon love💗", "karolina_kubinova": "i know uc/crohns can still flare up after an ostomy but i don’t understand why - i thought the immune response that causes it happens in the intestine, and after you’ve had an ostomy the food doesn’t get that far, so i’m legitimately curious why it happens 🤔", "courtney_jai95": "I have to admit your a huge inspiration I know there's alot of people suffering with this condition and you do it with a brave face and alot of elegance", "mattiexoxx": "The colitis must of had a bad chilli or something. Maybe it just needs some colitis-special Gaviscon?", "chezdaz1": "Best wishes Hannah xxx", "funktionjunktion": "Wish I could look that hot when I'm in the hospital lol 😍", "fdorsettom": "Ah, inflamed :( that's a bum-mer 😔", "racerjosh": "Sorry hope you feel better soon", "brighid.hughes": "Hope they can get back to you soon so you can start treatment ASAP!", "lottedb310": "I wish you all the best and hope things will feel better soon! ♥️", "missbb2015": "Oh no hannah hope your okay. Pamper yourself from the comfort of your sofa or bed", "sabina_hope": "Hope it goes well! I recently have an abdominal fistula that I needed surgery on so I’m resting and your video on what you wear with a stoma really helped me find new clothes with my recent surgery scars and stuff! Thank you Hannah", "tee__bean": "Sending love and hugs 💕", "heyitstigerlilly": "Sending prayers to you Hannah and I’m glad you didn’t have a serious flare up again💕", "pinkflowers40": "Feel better", "heyrowanellis": "Damn girl dat ass etc", "overtheplace": "Everything is going to be fine, just stay strong ❤️", "maddiegreg_": "Ugh I’m so sorry!!! Colitis can suck it 😔", "crazy_beautiful_life_17": "Feel better!", "kaaitlynnryan": "Have you been told about Vedolizmubab (100% spelled wrong) I’ve been on it for a few months now and I’ve had colitis 6 years and I’m steroid dependant. It’s actually working and it’s just a infusion every 2 months!", "claresmeats": "Ok, I know this is a serious post and Hannah I’m so sorry. BUT, how have you avoided the in/out joke with a camera up the bum procedure 😂", "hey_schwartzy": "I have UC bad I’m struggling right now. I get entyvio infusions but I still get flare ups and mentally and physically I’m exhausted and my body just hurts. I’m so sick of being sick! It’s really taken a toll on my mental health as I just feel so blahhh and if I could sleep a millions hours each day I would.", "dovejahit1965": "Had that yesterday too 😱", "stefaniajw": "Unfortunately medicine can only do so much. Please, don't just rely on sugeries but seek different options too. Alternative ulcerative colitis I've heard work for some are a plant-based paleo diet + sodium butyrate", "bgrimpe": "Hang in there kid! I’ve had a colonoscopy almost every year since being diagnosed with Colitis way back in 1998. I tell people it’s the best damn nap I ever get!", "adanna_david": "Get better soon Hannah 😇💕", "spanglepics": "are you going to have another operation, worth it in the long run", "tourner_la_paigee": "Hope they come up with a good plan asap💛did you have the camera under sedation?", "james_elam_": "Hey hope you get better soon! I had the same problem after my stoma surgery! It was a literal pain in the ass! 😂 rest well", "audrey_coplichen": "Fuck. Wishing you the best. Take care.", "deitaphobe": "I pray, so I'm praying. Much love and healing.", "justmissshaw": "Wishing you all the best for you and your remaining rectum 😂 x", "rsshorty28": "Hope everything gets better soon.", "michellegortmans": "I just want to give you a big hug! I hope you feel better soon. 💕", "kimtanti": "Wishing you a speedy recovery! Were u in my country, you would’ve been in my ward and I’d be your nurse! xx", "hazelnutmusings": "Oh no. Hope you feel better soon!", "ericatweed": "Hope you are okay 💗", "bamblingsofnaffy": "Oh babe! Sending you lots of love and positive vibes! (If you would like a care package let me know)", "aweebitblue": "at this point (actually before this point if we’re being real) colitis needs to fuck right off. you’ve had more than enough to deal with. glad you’re getting cuddles.", "drewsteadroad": "Sending good thoughts! Rest up! X", "peachstink": "I hope everything can get sorted soon :(", "mdd2014": "Hopefully you get well soon", "keely_wrighting": "Poor you get well soon x", "kate_hegan": "Sending love 💗💕💖", "primrosebigwood": "Sending loves girly, hope you feel better soon! X", "celesamuel": "Oh god I hope everything works out 😣😙", "getyourbellyout_official": "Thinking of you and sending our love Xx", "creepycactus": "That post anesthetized glow 💫💛", "chuso47": "I expect you feel better sooner or later.Take care😉", "riazfraz": "😍", "kylaasutherland": "Sorry to hear that! I know how you feel though. I’m having those same symptoms, but I haven’t had a scope to officially check things out. How’s the procedure work? Hope you feel better 😊.", "aud0981": "Sounds like suppository or enemas. I work for gi in the us.sorry you're going through this. Prayers for quick healing and remission!", "rebekahr_": "Fingers crossed it’s under control soon for you hun 💜 xx", "myoki_van_den_heuvel": "Hope you feel better soon! Does this influence yes/no permanent stoma?", "chronically_emily_": "Sorry to hear this, IBD is tough💜sending hugs", "forcefullsoul": "Love and prayers", "gemmakhone": "Sorry to hear Hannah. Sending you hugs 💛", "lucyjane.fashion": "Such rubbish news to hear ☹️ but I’m sending all my love and hoping they can get you sorted! I got some pretty shitty news today Colitis related but it won’t stop me! Keep battling on💪🏻🥰", "buckets_of_tea": "And this is why @crohnsandcolitisuk invisible disability campaign is so needed. You’d never have guessed your stump was glaring at the @getyourbellyout_official ball 10 days ago. Hope things start to improve for you soon x", "aliciamac": "hugs & wishing you health & as little pain/disruption in your treatment xx", "competent_equestrian": "Hope you recover soon!", "justjem": "@hannahwitton Hope everything gets better soon. Thinking of you 💕", "anne_in_ireland": "💚💚💚 sending lots of love your way!", "dr_radha": "Take care lovely Hannah xxx 💖", "luvstoski": "Ugh... Wish you well.", "gurkhyvel": "Noo im sorry, hoping for a good plan 🤞🏼", "l.lghost": "Honestly I’m currently starting my ibd journey as they think I have uc and the moment it was mentioned I thought of you and I was relieved. Someone who I respect and admire has managed to stay sexy and positive and amazing through it, so I can too", "nixonsophie97": "Hannah working that hospital gown", "hannah_mead_": "Thinking of ya chick xx", "cllris": "Did you get to watch it on the little screen? Never thought I'd get to see my own bumhole in such detail 😂", "woyski": "Sending love and well wishes Hannah! You bloody trooper.", "sean_b2020": "Get well soon Hannah", "missele12": "Salofalk foam enemas were a godsend for me - hope they find you something to help xx", "tjanssennn": "Hope you will find a way someday. Take care.", "szanna85": "That absolutely shit! Hope you feel better soon 😘", "mgbee4": "Hope they come up with a plan soon 🌈 Would you ever consider having that area removed to make your stoma permanent? x", "deniseflattery": "Get well soon @hannahwitton", "taylorjobye": "Sending all of the love 😘 Invisible diseases are the worst (my best friend has crohn’s and I have lupus) but thank you for being such an advocate for awareness and health! We need more Hannah Sutton’s in the world ❤️ Wishing you all the best as you move forward with your care plan!!", "iamangharad": "I admire you Hannah. You are so brave 💕", "iggy_and_elvis_mummy": "@hannahwitton you’re working that rectum camera chic lady x", "pcucurullo": "Feel better soon Hannah!", "abigail.amber": "Oh friend I'm so sorry, hope you're feeling better with all the cuddles!!", "amyjanehuntley": "@hannahwitton I’ve just got back from seeing my #ibd nurse and I’ve gotta have another colonoscopy. First one since my stoma reversal in July xx", "jessperry96": ":( hope you’re ok and the doctors can sort this for you soon! 💕💕", "shethequeenmag": "Get well soon you strong beautiful human being. We love you so much.", "heather_joseph": "all the best. this was me beginning of march. never experienced agony like it.", "alicescanlonsmith": "Oh mate 😩 sending lots of love 💜", "ron_schoumans": "Hope u get well soon.. i know as a first how it feels. I have Crohn's for over 8 years now.. had some of those procedure's as well. Prepping is the sucky part. In Holland they put me down for the procedure. So i wont notice it.. take ur rest and get well!", "sophieissoft": "sending love to you hannah 💕💖💞💝", "aleatoirefrancais": "Tbh you look way cute for just having had a colonoscopy! I’m a wreck until I can eat again every time! Sending you good thoughts for the follow-up 💗", "scarrednotscared\nVerified": "Verified", "machedavvero\nVerified": "Verified", "criptasticly": "#hospitalglam ♿🔥❤️ well life with a disability is never boring!", "akilahh\nVerified": "Verified", "thechronicpainlife": "Sending you loads of love Hannah! Rest up 💕", "cloudfightback": "Again? Well, shit.", "jenni___far": "I'm 25 years old and I got my j-pouch in 2011 and had my stoma reversed in 2012 - if you have any questions or want to talk I'm happy to share my experiences with you! Lots of love", "donaldbieszczak": "And many cuddles from your Instagram followers👏", "soph.vega": "oh no :((", "mikefalzone\nVerified": "Verified", "hellolovelyjubbly": "Rubbish! Hope you get sorted soon x", "gemlovalentine": "Sending love ❤️", "wtvnvm": "Oh my god. Again??? I'm so sorry. You got this Hannah!! You and Moana got this!!", "eloiseelford": "So so sorry to hear this. Really hope you feel better soon xxx", "jemimadavies": "I hope you feel better soon Hannah 💖", "mandiapple": "I hope you feel better soon!", "littlemisstumble": "I’m sorry you’re having a bad time ago. But you look amazing despite the hospital gown. 💫", "jayadams215": "Is it ulcerative colitis or is it diversion colitis? I didn't have any inflammation in the remaining part until quite a few months after surgery... Then because that part wasn't being used anymore it developed a thing called diversion colitis! Nothing to do with the UC I had before! Annoying!!", "ayanakelly2": "Oi vc vai ficar boa ...também passo pelo mesmo problema é tenho muita fé q vou ficar boa deste pedaço que ficou😘", "sarahselchert": "😔😔😔hope you're feeling well soon", "aasallydoll": "💔 Sending love your way.", "baking_addict88": "Sorry to hear it’s flared up again. Get well soon x", "doddleoddle_fan123": "🤞🏻💛", "narflet": "☹️", "leahdawn98": "I’m so sorry. Sending so much love 💖💖 we are here for you #spoonies", "shawn.kirby": "Love your nails!", "tonniknudsen": "😑 damn. Sending Happy thoughts", "charlotteteakle": ":(( sending love", "beccabop96": "Nooooo! Hope you get well soon Hannah 💖", "stelamo": "so beautiful 😍😍😍😍", "kiwispam84": "What a pain in the ass!", "katieemay1": "So sorry to hear this! Mine was the exact same and it really isn't fun. Sending you lots of love 💜 💜 💜 💜", "annepeart": "Just sending love and compassion x", "robodevi": "Oh noooo. That Colitis is stubborn huh. What is the next step!", "ejgeyy": "Hope your ok @hannahwitton 💖", "ajayverma000001": "❤️simle and beautiful", "thenameis_nuwanda": "Get well soon, sending virtual love! 💛", "me.and.penelope.wren": "🙁", "martesommen": "i wish you the very best, thinking about you", "ellen.sarah16": "Sending love and hope for a speedy recovery!", "charlbendall": "Sending love and 🙏 🌸", "brad.hayton.mul": "And yet you look calm, collected and are doing great 👏👏 Doing great Hannah 😄", "amummytoo\nVerified": "Verified", "charlottemoores": "Sending love💕💕", "mssophielaura": "I’m sorry Hannah :(((( Sending love and I hope you feel better soon 💛💛💛", "becca.rogerson": "oh dear :(( does that mean another surgery? x", "lissa_hnslr": "@bernie_hnslr", "nickegibbons": "Sorry about your 🍑 Hannah", "jess.wright92": "Hugs xx", "thady_daniel": "Hye I'm a big fan just want too say I love your videos on YouTube keep it up stay beautiful as always I hope you reply hehehehe 😊@hannahwitton 🔥❤️❤️❤️❤️❤️", "roxannajessica": "Hope you feel better soon, @hannahwitton 🌿", "thailaskye": "Gah! 😫 Have they got a treatment plan lined up for you?", "lisahmck": "This sucks, hopefully you get it under control quickly 🤞🏻", "laurrenwest": "Sorry to hear this Hannah! Sending you love and hoping for a speedy recover. Thanks for sharing the ups AND the downs of life with chronic illness💕"}