{"becdolina": "Regular walks to the park with my two year old and our doggos. And hubs too on the weekends. I work casually which is perfect as it allows for a couple days a week for walks. Low impact steady exercise is my jam.", "genejr18": "Just in time for the fitness channel💪😎👍", "bird35998": "Get into triathlon!", "lilyamartin_": "Hannah, look out! Oh my god she has her AirPods in she can’t hear us.", "it_never_made_sense": "Hi Hannah! I go cycling everyday for an hour and I try to do some light workout twice a week 😊", "clairbear1989": "I sign myself up for runs with my v sporty friends. She does the longer distances (half marathons) whilst I sign up for the 3km - 5 mile ones at the same events. It forces me to put aside time every other day to ‘train’. Helps that we go to new and exciting places to do it! Next run - Hà Nội, and im pushing it a step further to run 10km 😅", "outesspace": "since i don't have the time nor the money to go to the gym i just walk every time i need to go somewhere (no matter how far it is lmao)", "bendyzebra101": "@hannahwitton could I private message you regarding ibd questions? Way to go with parkrun", "alohaitsmaddie": "I play roller derby! It's the most ridiculous game but so fun and requires so much energy", "ka_osmond": "Play hockey twice a week and lifts weights in the gym.", "whatsmybodydoing": "I’ve been meaning to get a 6 week pole class FOREVER", "emsladedmondson": "Gym three - four times a week and occasional run. I like resistance training and weighted cardio for some endorphin feels 🙌🏽", "joxer2309": "I do a spin class most days, try get in some weights and some circuits classes. To be honest, before and after my surgery, my little gym community were my sanity and my sanctuary and they helped me through it all. 💖", "germanlawblr": "I do nothing and don’t know how to change that. 😣", "alegedly": "@hannahwitton I rock climb! It’s social, mental, works out your whole body, pushes limits, & tons of fun!", "sophiaa.viger": "You should do a video with @carriehopefletcher", "claire.collins2000": "Walking with my dog has been instrumental to my recovery - last week I went on a jog for the first time in four years! So, Hannah, get a dog 😅", "thismumtravels": "Boxing! It’s the best exercise I’ve ever done for all round fitness. I also do Hot Yoga which I think of as a treat as it feels so good! Occasionally I sign up to random courses in stuff I want to learn...gymnastics, snowboarding, circus skills! I’m actually learning to ice skate at the mo! You have to enjoy whatever it is you’re doing. Walking up hills and in nature is what I love to do on a weekend :)", "mariiameel": "Olá @hannahwitton , boa noite! Gostaria de convidá-la a conhecer a página da Maria Mel. São inúmeras fofuras, confeccionadas inteiramente à mão, com muito carinho. Espero que goste! Mais informações, entre em contato. Estamos à disposição. Um abraço, muito obrigada! ♡♡♡", "ubiquitous.me": "I run 30K per week 3 x 10k. As I run quite a bit I also need to do 2 x 1hr strength training per week (using own body weight excercises) and 90mins bikram hot yoga on a Saturday morning. I find the strength training and yoga prevents injury. It's quite full on, but I enjoy it and no expensive gym membership.", "umpalumpakicku": "🙌 in :-\\:-\\=_==_=:-*:-*k", "walwanisp": "Have a happy time hannah my freind!!😘😘😘😘", "gracedealvaro": "@sportshaimakeup ❤️", "stefaniajw": "Take a walk everyday and sometimes (maybe once every two weeks) I go swimming. It's enough for me, I could never do more.", "thedevilwith.a.halo": "Running and boxing is my thing🤘", "brighid.hughes": "What style of dance did you try?", "rainbowsonmymind": "I also did a park run today! First time in 3 years 😄 Ive been trying to get back into running recently (not that I was ever really into it 😅) besides that I love dancing, although sadly I’m not able to do it at the moment", "jmcosmos": "Active? What is this \"active\" of which you speak? With scarred and ruined lungs and exertion-triggered asthma, exercise is Teh IN-IM-EE.", "orangesinwinter": "I walk to and from walk 5 days a week. It's 25 min walk in one way. I also do at least 40 min of toga every day. On weekends I go skating or biking.", "mmelonish": "My chronic pain is all over the place making it hard for me to do regular scheduled exercise as much as I'd like to go to fitness clafsses and I find the gym so boring. When I was a kid I used to be so active I did ballet and tap for 11 years, I did yoga, I was on my schools netball team but as I got older that all stopped. I tried netball at uni but classes and pain got in the way. I boxed for a while but the classes stopped. But recently I've started dancing again, all be it in my house following YouTube tutorials but it's still exercise, I'm planning on starting doing yoga at home again, AND I bought a skateboard so I've started that and that uses a surprising amount of muscles and energy so a surprise source of exercise", "theastybe": "I live with a couple of mates and we go to the gym together. We don't workout next to each other necessarily, but it helps. Plus, I've been taking a lot of different classes, because I'm going with people that like different ways of working out. So I've tried spinning and yoga for the first time. And I think I might be getting in to yoga ❤️❤️", "rainsfetch": "I belly dance whenever I can! I have a wonderful teacher from Belgium who is very good at it.", "emfoulds14": "Weight training and walking! I love it. Well done you for prioritising your health and fitness! Go girl! 🙌", "rmenzies3032": "If there is one thing that my Fitbit has made me realise that walking is less impact on your spine but is nearly just as good as running. Add that to some good country side or a game of golf and it’s better then you think 😉", "shanshanlaflaf": "I have a gym membership, which is luckily inexpensive, and try to go at least 3 times a week. If I have less time I’ll find a workout video on YouTube and do that at home.", "kierstinmina": "My daughter and I go for walks every day, she rides her bike and I walk beside her. We usually do this right after supper in the evenings", "lacey_kickers": "Roller derby. It's the best thing that I've ever done. Also gym 3-4 times a week to boost my fitness levels.", "jonpaladini": "👊", "ryandbischoff": "I work in a car factory and average 12,000 steps by the end of work. I’ve lost about 20 pounds since I started working there end of November 2018. It’s quite the workout everyday.", "emmacat_13": "I do a weekly \"clubbercise\" class - as someone who HATES exercise (but loves a night out), I essentially trick myself into doing exercise while being distracted by the tunes and disco lights 😂", "philiphon8134": "🔥😍🎉", "jasondanielsauthor": "You are looking amazing. Well I try to run 4 miles 5 times a week and I have 12 different dumbbell exercises I do. I want to start planking again because that really helped my core when I was younger.", "erindoesballet": "getting a gym has been the best decision I ever made - for me putting a money value on fitness has been the push I needed to actually go and work out", "jollych1pmunky": "I do mouy Thai it’s great all round workout and keeps my strength up, as well as just a lot of fun in doing😝🤘", "kelsey.olivier": "Weight lifting and yoga! Both amazing for core! Are you still doing physio? Would still be interested in fitness/recovery related videos from you!", "lou.mtl": "I row once a week, run with my dogs and I will start biking to work!", "matthewfletcher1": "Delivering people's shopping is enough for me, as long as I can avoid temptation on the road with all the fast food and cafes everywhere I go 😂", "emilythomson99": "Try @thebecomeproject ! Fun and gets a sweat going and definitely lots of core work 💪🏼", "kvardagsbiblioteket": "I play football, having a social aspect to my exercise makes it so much easier to stay fit! Also love the competitiveness of a competitive sport. But if it’s outside of season I try to run and do yoga.", "drnicolajones": "I just ran my C25K on the hotel gym treadmill at 5.30am. Who is this person....?! 😳", "sandycorgis": "Me and wife recently back got into weight and power lifting. I've done it over the years but we got her a trainer. She really enjoys it and we've discussed how incredibly sad it is that most women stay away from weight training because gyms are just so darn intimidating. It's amazing for those who dislike cardio and has incredible health benefits, especially for women.", "girlidkmyself": "Hiking is great! You can take it at your own pace and ramble or set yourself a time goal! That’s one of my favourite ways to keep fit!🙌🏻", "mst0rms": "For a strong core, make sure to do squats and deadlifts in the gym. You’ll feel like a different person!", "mlsmith9": "Yoga a couple times a week, gym in my building sometimes and trying to get my body stronger to hike", "frederiksen_dan": "You can invite a friend over to do the exercise with you", "ahyira": "Pole dance and yoga 💚", "gaia_ronja": "Crossfit, swimming, running and a lot of walking even when I could take public transport. Luckily Vienna is so beautiful and we have the danube river where we have tens of kilometres to swim without bumping into anybody, from May to October the water is warm enough to go for a good swim :)", "penn_merrill_20": "I played sports in high school, but now since I’m about to graduate I lift weights on the daily and run 2 miles every other day", "19akina93": "After a year and a half of terrible anxiety/general mental and physical health, I decided to put myself first and start making time. I started weightlifting about 4x a week back in January and haven’t stopped! I feel so much healthier in all aspects of life, plus my little 🍑 is poppin! We always hear that physical activity improves mental health, but I never thought it applied to me (🙄). Wowza, was I wrong.", "umar_zaff": "I wrestle with my younger brother 🙂", "franziskadodl": "Bouldering is super fun!!", "amars726": "Pilates!! I’ve always had a bad back/hips and it’s the only thing that doesn’t hurt. It’s so good for building your core too!", "hannahbrockbank222": "I struggle with cardio because of fatigue, but have found yoga and strength training to be my jam 🙌 just come back from a workout and honestly feel great, it gets me feeling back in my body and the moment again 😊", "sunnyskiedlaura": "I’m a runner! We don’t have parkrun here so i just run solo. I’m running a marathon in 2.5 weeks!", "alessandralilac": "Pole dancing!!! It's hella helpful for your core too, and you're having too much fun to even realise you're working out", "laurensartz": "I have a chronic shoulder injury so I have to be careful with what I do for exercise even though I would love to just lift weights all day! I have a PT session once a week where we do a lot of strength training(mostly legs), I run, do Sh'Bam(dance fitness class) and hike.", "romy.kate": "I used to dance a lot but as an adult it’s hard to find classes that have the same difficulty of choreography but where you don’t have to commit to shows and exams (I liked the look of the one you did, but I’m not in London 😩). I’ve also started Kettlebell recently and am attempting C25K again 😊", "marijnriemsma": "Yesss! I so agree with that making fitness a financial priority. This year I've subscribed to a gym and a boulder hall (climbing without rope) and it takes quite the chunk out of my bank account, but so worth it 🏋️‍♀️👌", "take_me_to_spain": "Me and my friend are going to barre and yoga classes together! Oh and walking my dog for as long as he'll let me lol", "dancingtenbears": "Here in the uk we have open air gyms aswell, as an influencer how about standing to help create more of those in your local area? How is the free green gym situation where you are?", "rachel_eleanor92": "Running! Started running nearly 2 years ago through couch to 5k. Did a 10k in March last year, a half marathon in March of this year, have entered a 10k in a couple of weeks and a half marathon in October this year. Hoping for PBs on the races this year!", "victoriaparrett": "I’ve been doing strenght training classes outside for the last 6 months or so which I’ve absolutely loved despite the cold weather! Im lucky to have found someone who does these classes for just £5 and I can walk to it! Also started running again in the past month, I love seeing my progress and as I haven’t had a job recently it’s great as a thing to get me outside and achieving something! I just hope I can keep it up once I’m working again as that’s when I tend to get less healthy 😏", "isabel_barclay": "I play for the women’s rugby team at my university, will be starting the grace fit guide after exams and do the park run whenI’m home from uni😊🏉🏋️‍♀️🏃‍♀️", "gemma_gem_": "Horseriding has been really good for me physically and mentally tbh", "theamandadecothe": "I think the goal is to find something that you are comfortable in doing. I tried gym twice, and hated twice. Looking for things that I might like, I found skate and ballet, and now these are my two new passions.", "sabria.behilil": "Mainly I'm a marathon runner, but i do loads of swimming and cycling too 😁", "madbohemianpoet": "Have you tried yoga?", "vanessa_nz": "You inspired me to download the couch to 5K app. I’m on week 7 now and planning a parkrun at the end of May 🏃‍♀️🏃‍♀️🏃‍♀️", "__sianmorris": "I go swimming 2x a week, play hockey and rugby - I also do spin cycling X", "simbazon": "I lift weights 3 times a week. It's done wonders for my mental health as I get fulfilment out of something I suck at!! And I'm now working on applying that to the rest of my life and it seems to be working😊", "malouinstared": "Ride my bike to school", "philosophiecal.ms": "I do a lot of walking and it has made my mental health profoundly better😊", "sianroalf": "I just signed up for a couch to 5k program! I also do at home workouts with either body weight, dumbbells, kickboxing etc. I also go swimming once or twice a week, go for walks and hikes", "matt_b90": "I bike 2 miles to and from work each day :)", "hatty_gardner": "The only exercise I enjoy is running 🏃‍♀️", "cassidy_sage97": "I completely gave up exercising for almost two years because my chronic illness took over my life, and now that my new medication is helping A LOT (it’s not perfect but it’s so much better) you’ve inspired me to get back into fitness, I just downloaded the couch to 5k app and can’t wait to get started!! 💚💚💚", "collectorofcurios": "Pole / dancing fitness! It's so much fun and works all parts of your body, particularly core and arms. That feeling of finally nailing a trick you've been working towards is just 👌", "saran.rhea": "I do ‘bed yoga’ occasionally, but just day to day living is too much for my body to cope with so exercise is off the cards (unless stairs count?!). I’ve had to change how I view activity and exercise so I don’t beat myself up so much about not being able to do it.", "berylandme": "I walk a lot now im quite slow but running is not an option, just moving about helps i am very stiff these days but just try my best x", "ellieangharad": "I’ve been doing Roller Derby for a year. But I’ve just (really badly) broken my ankle. So I’m out of action for a minimum of 3/4 months before I can work, and I’m gonna have months of rehab and physio (I completely shattered part of my leg as well as the ankle). I’m feeling really down about it 😕 I only just found this sport I enjoyed, and now I’m going to be really rather unfit after these months of not being able to even walk 😔 idk if I’ll go back to skating ... cause now I’ve done this once, I could do it again. But I want to keep fit, and get my stamina back. Idk, feeling quite down these last few days since getting home from hospital and being immobile 😕😕", "elmagdalie": "You could start with gym and focus on exercises that don't require gym equipment except of mattresses, weights and trx maybe. When you learn how to do them right you can stop and start working out at home (and run in parks as well). This is my plan because gym is expensive and the music is bad and loud. xx", "bethydennis": "I’m using couch to 5K too and hoping to run my first 5K for the race for life in June after being inspired by you! I thought; if Hannah Witton can go through all that and do it then I can get my lazy arse up and give it a go too! I feel so much happier and healthier in myself when I routinely exercise. ☺️", "s3zz0": "I go to a bouldering (rock climbing gym) 3 times a week, will pay almost anything to do this as it has a noticeable positive impact on my memtal health as well as physical 😊", "annemarleka": "I reccomend @rebeccalouisefitness !! She has a monthly workout plan ( #Burn ) with videos for every single day😍 and it's REALLY cheap!! It has changed my life ☺☺", "tam.h.x": "I’m walking everyday this year, for at least ten minutes, for no reason other than walking (I.e. my walk from my car to work doesn’t count!). Managed it so far - even with having a major op 6ish weeks ago - although the day of the op and day after it was to and from the car! I’m amazed that just walking is going so much for me mentally and physically! #tamwalks365", "alexrose312": "Ninja warrior/obstacle training and pole fitness, occasionally dabbling in parkour and aerial hoop too", "kirsty.36": "I try to do parkrun as often as I can too, even if I wind up walking most of it! (Btw it’s “parkrun”, all one word & all lower case)", "gerdavm": "I run, do Zumba, go to dance class and go to the gym for weightlifting", "nlauritz": "I’m a competitive hobby swimmer, so I swim 5-6 times a week +strength training. I also like to run and play tennis", "seyiakiwowo": "Come to dance class on Monday xx", "moey_on_monday": "So jelly of your eyebrows ! xo", "graham_m_hand": "What is this world ACTIVE you talking about? Lol", "missele12": "Pilates for my core once a week (and for stoma strength), and running since doing couch to 5k (inspired by you!). I did the 9 weeks and did my 5k in 34 minutes 46! Had my Barbie Butt surgery 4 weeks ago so on an exercise ban for another 3 weeks but I can’t wait to get back running!", "pnndpenning": "I now go to a ladies gym 3-4 times a week after having my colon removed 2 years ago. Then last year had 2nd op to remove final piece of bowel (reversal not possible for me). I turned 50.in Feb & I am now in the best shape I've ever been in 😁😁😁😁 feel so healthy now. #fitatfifty", "avastrough": "I road cycle (so good for clearing my mind after a frustrating day at work and I get to enjoy nature)! I love the fitbod app for strength training. I'm on 14 week streak!", "lauraa.dev": "Hockey season is over and I'm in desperate need of some exercise so I'm starting the couch to 5K today! I've never been a runner so we'll see how this goes haha", "helenmelonnx": "Climbing!😁", "williwillswissen96": "Riding my Roadbike but when I don't feel that fit I just go for a walk 🙆🏻‍♀️", "tayherbertsonn": "At this stage im just trying to go for a 10 minute walk every day. I was diagnosed with CFS about 4 years ago and while im so so much better now, things have gone downhill a little bit again so im just trying my best to get a bit of exercise in", "romy.mayy": "i’ve been trying to run everyday and i’ve just got a gym membership, to go with my friends :)💛", "bluepenguin600": "I am an overly keen cyclist. The distances have gradually ramped up over the years till now when I go 60 miles in a day for fun. And tomorrow embark on an 8 day 470 mile effort to London from Glasgow. I have been called insane and told a plane would be faster.", "em.rys.k": "Korfball, running and some gym time!", "angireads": "I walk ALOT! I do for work... but I like walking as long as I can see nature.", "katiec1743": "I go to the gym and lift weights and do HIIT cardio. Just got back to the gym after a month off due to stress and life taking over. But I feel better going back to the gym! 💪", "rebecka.killander": "I try to go out for a run every morning because I’ve noticed that it helps my mental health loads, but I’ve been struggling with aching knees all my life so running isn’t amazing right now. Hopefully I’ll be able to go back to running soon though!", "gershgorin": "I walk a lot with my dog in the morning and also I've recently fallen in love with Nordic walking!", "myawatkinsxo": "i do nothing i’m so lazy lmao. any tips to motivate me? x", "neve.francis": "reading this at the gym!", "livingtheleonelife": "I really enjoy popsugar fitness on youtube, so many different workouts to try!", "eoin_sandford": "I'm having to rebuild myself through bad injury in January. My key exercise is yoga and cycling and recently started back building up my core strength through gym work. Check out #everydaymay to see a load of people like myself exercising each day for May.", "calwhyte": "I enjoy team sports, doesn’t seem like exercise when you are participating with friends.", "nixonsophie97": "I’ve got a gym in my student accommodation next year I’m going to use", "katy_coulson": "Running with a few gym classes thrown in - would really recommend yoga/Pilates for you, it helps build core strength and clears the mind. You’re such an inspiration btw x"}