{"hopekcbs": "✨❤️✨❤️✨❤️", "trubluemits": "Girl you are amazing and I love watching your vids and reading your posts! Supporting you all the way from Singapore ♥️♥️♥️", "neeuff": "This👏is👏so👏 important!!!! I understand exactly what you mean by wanting your \"old, normal\" body back and I definitely shy away from showing my insecurities in pictures but I'm trying to embrace the way my illness effects my body and not let it stop me wearing what I like", "orsu_radiance": "Yes 👏", "eden_sedman": "Daaaamn girl you rock 😍", "fpadmore": "Honestly, you are so inspirational Hannah. Never stop absolutely killing it 🙌", "sidibe8428": "Nice", "samhevans8": "You are such an inspiration. I am a Pouch Nurse Specialist at St Mark’s hospital and I always encourage my patients who are struggling with the fact of having a Stoma again go follow you. #inspirationalpeople", "erroll72": "👏👏👏❤️❤️❤️", "sian.kaye": "Hannah I struggle the most with thinking back to how I felt more comfortable with a flat stomach and to really frank I know having a stoma saved my life I still have on going issues with this condition due to my rectum still in brittle bones and gaps in my back mean no operating can know be carried out. But hey you just have to keep positive no other way is there. Great words of wisdom thanks Hannah you spark of sunshine", "ruth_high": "Thank you so much for talking openly about this 😊💕xxx", "kohowch": "Okay but your stomach is perfect", "chloecharlottehawthorn": "you are so gorgeous Hannah!", "erica_demartini": "💓💗💓!!!", "brionhall": "Are you wearing panties under your bikini?", "joel.champion.9041": "I LOVE IT!!!.SUPER SEXY AND YOUR POSITIVE ENGERY IS GLOWING.. YOU ARE AWESOME AND SEXY.LOVE YOU HANNA!! KEEP UP THE GOOD WORK", "fuk_the_rainbow": "So gorgeous ❤️", "jaediesansom": "Thank-you for being frank about your struggles💕 We’re pumped with so much negative body talk it can often feel like the only answer is to scream the positive out in an effort to balance things. But sometimes, we just need to have a moan and wait for better days, and I appreciate knowing I’m not alone in that. Much love 💗", "redneck0605": "Still beautiful", "dario_prespljanin": "💋💋💋💋🔥🔥🔥", "rebeccamrti": "You look fucking amazing 🙌", "silvanap.schneider": "I am confident. but very scared", "javad.mashhad1225": "Wooooooooow sexsi🤩😍🤭", "williamwise1976": "Sexy", "kingofallmarks": "Hottie!!!!! 🚨", "eveliensinke": "An ICON.", "priscilladmb": "@jee_dee_wee hannah is ook geweldig voor body positivity", "dvd1162": "Hottie🤗", "the_legion_system": "You are a stunningly beautiful woman not only because of the way you look but also because of who you are. You are kind, honest and caring and let's be honest pretty damn sexy as well.", "wlnyc": "Well done!", "browningiii": "Looking beautiful and confident", "newuknudist": "I think you should do a classy nude shoot to show how positive positive body image is for good mental health. You're already inspirational and that would really help, I believe. 💪🏻💪🏻", "justicekenneth57": "Your so sexxxy Hanna", "damndsol": "CUTE!", "chloverthinker": "Bod! ❤👌", "ems_stomalife": "You look amazing 🙌 xx", "jillybeanez": "Thank You for sharing. Very pretty 💕✨", "richard.page6": "Very sexy sweetheart", "gaia_is_sucktastic": "You aren’t exactly my build but very close and seeing this on social media really made me smile! Keep up the good work and hopefully more youngsters will see this too and realize that this is a normal body and everyone is worthy of respect and love!!! Love this message and love you! 🧡", "lilirdzn": "You are a beutiful human being. I admire you", "dendennz": "I think you are ridiculously beautiful. Gorgeous gorgeous gorgeous in every way.", "outesspace": "gosh what an inspiration you are", "adriannachmiel1": "I mean you could lose some weight and get that flat stomach back, it will still have the scar, but it will be an in-between 😊 let's not demonise weigh loss, if its done in a smart way and for health (yes even mental health) then why not 😊", "robathersmith": "🍉 🍉 😮", "fechernivi": "I never understood what you said about your bellybutton until now. But so cool honestly, your scar is amazing and you're amazing and I love you so much even tho I don't actually know you. Also!! With every picture that you post I just fall in love with that haircut!!", "muppetcp": "@hannahwitton you look amazing scares and all", "ewa.floryn": "Love you for that pics 💕", "moey_on_monday": "Hottie ! The best insta post that ever was. Love you Hannah ❤️❤️❤️", "iwantmythunder": "Yaaaas girl 💕", "sarahswift91": "Finally got that pre illness thickness back and you look sooo good", "simplyyysophie": "This is absolutely everything to me❤️✨", "jane.fysh": "You look absolutely KILLER. Gorgeous inside and out.", "alexesther": "I know the feeling about comparing the physic of my past self. I'm glad I made the choices that I did when I did. My path would have been very different, maybe very dead. I do my best not think about what was and work on what is. Still not ready to flash all my scars, but I'm working on it.", "jelly_b_and_vitamin_g": "Beautiful", "krazyc88": "You are Gorgeous!", "beautydaze": "I adore you 😍 xx", "wanstillet0": "😍😍😍🔥", "fightmasteryoga\nVerified": "Verified", "vdaddy002": "Your body rocks 👍@hannahwitton", "ambervanheumen": "cute🌸", "itsyourfaultjana": "Hello! I’m brand new here. I went down a little to try to understand better your story. I’m sure I don’t know even 10% of it but I can already see that you are a true inspiration for so many girls/women around the world. Thank you for that, I’m happy I ended up here ❤️", "mvporange": "Hi Hannah, what is the black thing under your bikini?", "coopey71": "Gorgeous 😍", "sasharuggiero": "You’re beautiful and a total ICON😍❤️😘", "becxa_s": "I love and appreciate opening up my Insta and seeing you rock your \"perfectly imperfect\" body. But there is nothing imperfect the way I see it. Your beautiful and absolutely inspiring. I am only 19 and was diagnosed with an autoimmune thyroiditis or Hashimotos and it has caused me to gain weight. All my life I was the slim tall girl, the skinny of me and my sister. Now I am 20 pounds more me and it has been really hard to accept not only the physical challenges along with my Illness but the mental challenges. I am starting to re love my body. Cellulite, scars and extra weight. I'm still me. And seeing you helps me realize that so I thank you a lot.❤️❤️❤️", "nanoerick": "🙋‍♂️👏🏻👏🏻👏🏻", "primezulu101": "👍💕👏", "juliawho.x": "FIERCE", "stultzies": "You know what, though? You're gorgeous. Normal tummy, scarred tummy, skinny, whatever, you are freaking gorgeous. I've seen before and after stoma surgery photos, and you are every bit as beautiful now as you were then, if not moreso. 😍😍", "lisamccrissican": "You’re a warrior, Hannah. You’ve got the battle scars to prove it. 💞", "imjaywatson": "Beautiful 💕💕💕", "jasondanielsauthor": "You are looking really beautiful and sexy Hanna! :)", "quietsalem": "PLEASE ADOPT ME", "gracielamulder": "@gabrielamulder", "miriammutig": "😍", "rachelmckenna_1": "You’re amazing ❤️", "manonbln__": "Beautiful 💕", "tuttcase": "I feel like that too, you totally captured how I feel about my body and my new standard :)", "solstice.sunrise": "I hear you. It’s good to speak to it. We become such Warriors yet it’s complicated. Through all my sickness my body changed too and I love it fiercely now more than ever but can simultaneously have pants of grief for the old body for its fun parts.", "aiden_keel": "Do you just flex that spit bag", "littlepinkstarsally": "Having previously been a 6/8 and extremely active with a flat tummy I'm struggling with my new 10/12 body and curved and sticky out stoma. I'm happy in much better and everyone tells me I look great but I'm still struggling to get my head around my larger waist and arms. It's not the end of the world, just the end of my relationship with my old clothes that no longer fit. Now I'm trying to find new clothes to fit my new figure but still missing my toned body.", "kujmous": "💜💜💜💜well said", "sarahjoymakeup": "I'm starting counselling specified on body issues next week and honestly, I'm so excited. I've had a terrible relationship with my body ever since I can remember and it's contributed so much to my depression. I never admitted it to any previous councillors and am excited to finally help myself in this way. Anyway yeah, just wanted to say that really. Completely understand your feelings Hannah. Always talk, talking is so important 💕", "daytoncarrie": "STILL YELLING! GO OFF QUEEN!", "j_immy_g": "You're Beautiful Hannah, never forget that. 😍", "carolinelaline": "💗💗💗", "salah.ismaili96": "@hannahwitton for how long ??", "hhannahmacdxoxo09": "Where do you get your bikinis from because I always struggle to get a proper size of bikini top for my boobs as there quite full and big? X", "harriet_davis_x": "you’re such an icon literally such an inspiration to me. gorgeous! 😘", "k.seylaz": "Where did you get this swimsuit??? I can never find tops that fit my bigger bust! You look beautiful ❤️", "happy_little_student": "Will you have the aroma forever? @hannahwitton 😘 you look gorgeous in these photos and so confident even if you don’t feel it 100% of the time 💛", "gordonh79": "I have the same scar and same iliostomy bag! Love your videos too! Xxx.", "hangouldy": "You are FAB 💕", "rebeccaelisabethxo": "Where is this bikini from? I have big boobs also and struggling to find good ones! Also what size did you get? You look amazing! Confidence really changes everything xxxx", "gemtakesphotos": "Beautiful inside and out❤️", "nommsynoms": "Yesssss queen!!!👏👏👏", "myendometriosisjourney": "Gorg 🔥", "strrakova": "I live you!! You give me the nidy confidence i neeedd!!!", "aharp82": "❤️❤️❤️", "evieoliviachurc": "YES HANNAH!! xoxo", "agatha.n": "Agreed!", "kennowell": "Work it Hannah!! I hope you are having a blast in California!", "hubertgaulin": "Hannah, you are amazing. 😍", "andrea.oor": "soy tu gan", "miss_emma_laverton": "I'm mostly housebound with CFS so I can totally relate to rapid body changes due to health issues that are out of your control. I used to think I was huge when I was about two dress sizes smaller but I'm oddly okay with my body image despite having gained a fuckton. I guess I've kinda made peace with it. I still have bad days, of course, but most days I'm chill with it now", "ellacatherine95": "You are so inspiring ❤️❤️❤️", "thecoach_s": "❤️❤️❤️", "atanshubashi": "You look gorgeous", "sabina_hope": "I feel this SO hard🧡", "god_was_played_by_a_woman": "I have UC and I’m scared I’m gonna have to have a stoma some day because I don’t know how I’ll feel about my body", "kayleekruisen": "You are rocking that swimsuit. Seriously it is so flattering!", "thegrowingbutterfly": "You are one remarkable human being Hannah 💛💛💛🌸", "andrewmcn": "@hannahwitton Gorgeous", "kayleighjweb": "so proud of you hannah!!! 👏❤️", "gemmaxcampbell": "❤️", "adgdtfyhhjjvkbkngnbbnfg": "Cant get enough of your heavenly body and huge suckable boobies!", "simonbee07": "Feel proud of your boby, its yours to be proud of!", "liisakrips": "💛💛💛 im in recovery from a long lasting eating disorder and a lifetime of broken body image, self hate and deep shame. My body has changed A LOT. I finally feel like i actually made it and im doing good. I struggle a lot with photos too, both taking them and looking at the old ones. I feel like losing a body and the identities and hopes and dreams it held truly is like a full grieving process. Its been really hard.", "seyiakiwowo": "🔥🔥🔥🔥 (I want your boobs tho)", "brooke.wallwein": "I love your body😍😍", "annabobannabannana": "Gorgeous 😍😍😍😍", "elliephant89": "I am trying to be kinder to my body. I'm the heaviest I've been but also the sickest. Need to be nicer to my body and get more nourishing food in when I'm well enough to eat properly.", "navsandhu22": "Wish I can meet you 😊", "j_rex_gaming": "Thank you for sharing this. You are such an inspiration. I believe we all have scars. Some are physical and some are mental/emotional. I also believe that it really helps to talk about them and get them out in the open. So, again, thank you for sharing and being open about this.", "sablowe": "In 2016 I had two major ops and ended up with a 15cm scar across my stomach. I was always pretty content with my figure. It wasn’t perfect but wasn’t terrible. Then it was highlighted to me whilst in hospital that it should be an issue between me and my fiancé - we were planning to get married 18months later. People seemed to think it was okay to say this and didn’t realise that prior to them bringing it up it didn’t actually cross my mind. I now wear bikini etc and don’t care about it. Even tho people still ask directly (eg at the gym or on honeymoon). Nice to see this post as I did a similar thing yesterday", "mygrandcanyon": "I can relate! You’re gorgeous 💛", "guesswhoiam7171": "Beauty much, so much beauty. 🤩🤩🤩", "cloudfightback": "Proud of you!", "alinasaman": "so much love💕💕", "celia_e_jones": "You are incredible and also 🔥", "becca_mac123": "Beautiful x", "katieadams____": "💗💗", "amygilliganxx": "Another relatable body! @charlottegilliganxx", "w3bbd": "You heal quick @hannahwitton", "recklessbabe": "Thank you!", "xarine_m": "I wish I could be as confident as you are. You're a true inspiration 🌠", "donald_iii": "Gorgeous body+accessory 😉! Love your rocking your bag. Such a sexy woman!", "trevor.osborn": "💯", "footlessjo": "Yes girl. Thank you so much for posting this and talking about it. 💜", "angaxa": "Really appreciate these unedited photos Hannah ❤️", "lesucrecandy": "You are such an amazing person and you also look stunning 👀 💛", "benfra1": "Looking good girl!!#", "shanboody\nVerified": "Verified", "mrstevendarby": "Mmmm beautiful body.", "martha_km_": "Your confidence in your body and your confidence to speak up about your insecurities is wonderful 💕", "competent_equestrian": "You're amazing", "leahwitton": "Love you xxxx", "bellpeppertoday": "💓", "mrchefmurphy": "You are so beautiful", "iamsherrylsinclair": "Adore you & your honesty - thank you for being so raw with the world 💖😭", "lozzaheeley": "I’m an accountant and was reviewing one of my clients bookkeeping the other day, spotted the company had made a charity donation to a just giving page for a 100 mile bike ride, donating to the Crohn’s and Colitis charity. My clients wife had a similar op to you and now also has a stoma. I instantly logged in to my just giving account and made a donation for her, as I’m so aware of how it can affect your life from following your story over the past few years. You are such an inspiration and I think you are so great at raising awareness and educating others about this condition 😊💛 you are FAB!!!", "jesslmrayner": "Hot 😉", "queens_gambit1502": "You are so beautiful it's unreal", "hoblynjason": "Looking beautiful, before and after ops x", "jindijoosten": "💕", "pamacostaaa": "Is that a j bag?", "httpsdanielle": "I admire you so much Hannah. You're chuffing gorgeous too", "samhufton1": "That's okay. No one is satisfied with themself and no one has to be. That's how life goes. Sometimes we use that to motivate us to do more, sometimes we become content with being imperfectly satisfied. You'll always be beautiful Hannah ❄", "ashleenhora": "Where do u get ur bras? I cant find one for myself!!!", "yannasworld": "🙌🏾🙌🏾 You’re an inspiration", "racerjosh": "Sexy", "indysamrai72": "You look lovely☺️💜", "horstbecker31": "Beauty❤️", "eadarby": "What bikini is this??? It looks so cute, plus I reckon that’ll keep the girls on lockdown for me! 😂", "randomizedamy": "YOU'RE SO PRETTY OMG", "alisj155": "Very hot", "holman4574": "I have similar thoughts but a totally different medical problem. Thanks for opening the conversation about it.", "fi_haley": "You look gorgeous 💜 xx", "philiphon8134": "🔥😍", "alana.dono": "You’re so gorgeous!!", "kylaasutherland": "You look amazing! I completely understand where you’re coming from though and it’s something I’m working on myself. Thank you for sharing pictures like this and supporting body positivity for other ostomates 💜", "ericleslie80": "You're a radiantly beautiful person, Hannah, and that hasn't changed one bit from before your surgery. You just have a new dimension of it to share, and bravo for doing so with honesty and good humor. ❤️", "charlotteeneal": "@bradsav2 this is the youtuber I was on about ages ago that raises awareness for her stoma bag x", "keepitsimpleok": "Welcome to PS ✌️", "blacktulipbeauty": "You are SO gorgeous ❤️ I appreciate my body more than ever since having my ostomy xx", "atpugsada": "Queen 🙌🏼", "vagentzero": "❤️❤️❤️ You're amazing. Even with our mental illness, we are enough, even - especially - when our brains tell us otherwise .", "pollypocketwhore": "💕💕💕💕💕💕", "mizlauren2u": "Love you. Love this. Proud of you. 🙌🏽💜", "thewildlemons": "Your strength to share these kinda things with the Internet always amazes me. You are invincible 🔥", "nacorthi_aka_steve": "😍🔥wow!", "samueledward": "Said it once I’ll say it again. Your amazing 😁😁😁 such a positive message all the time!", "anthonymouster": "You're great, I admire you so much", "emjayneross": "You look fab Hannah ❤️", "narisamel": "your body is beautiful and so is your mind 😘💜", "emilynewman23": "You're gorgeous. Thanks for continually helping to raise awareness of Crohns and Colitis. Xxx", "themindgeek": "Yes! 💛 As a fellow IBD-er, I’m so happy we have someone representing our badly-behaving-bowel community with such an honest, body neutral perspective! A great message 😄🙌", "beyondapostcard": "Always such an inspiration 💛", "leannavis": "💞", "bakinganalyst": "#PinkScarDontCar-e", "livstrother": "iconic", "connie_bronwyn": "Can I ask where you got your bikini from?? :) I find it so difficult to find bikini for us bigger boobed ladies 😭", "zvtdwbimojzr_": "You look amazing 💛", "tom.pcc.humphreys": "You're confidence is so glowing. If you were in Manchester i would love to shoot with you 😇", "julasadowska": "You look so beutiful, Hannah! ❤️🤷‍♀️🙌😍", "emanuelaagostinetti": "I love your confidence, it's truly admirable", "rubyofmyeye": "You absolute stunner this is such an amazing photo 💕💕", "richard_baker6": "You have a very hot bod Hannah! 😊", "maisie_marsh": "So gorgeous! Seeing your posts helps me stay positive with my scars and stoma, thank you❤️", "amygatenbyy": "You absolutely look incredible", "fu4real": "An icon and a beauty, the hufflepuff is strong with this one 🙌🏻", "ciaramaevemcc": "You look beyond beautiful", "chr1sleach": "Queen 🔥🔥", "nixonsophie97": "Yass 👏 we all have those days where we don’t feel as confident but there’s much more to us than just our image. You’re a beautiful person Hannah.", "annasterli": "You are so beautiful, inside and outside 💛", "jos_journey82": "You look beautiful 🥰🥰x"}