{"inezvermeulen": "Ice cream 😬", "kitizl": "Coffee Clan Unite!", "brooke_is_trying": "I don’t like whole fruit. I can only eat it chopped up or in a smoothie. I have no idea why. 🤣", "wayward.daughter67": "I don’t like bacon or anything lemon flavored or that has actual lemons in it", "rbeccamaec": "White chocolate - absolutely vile stuff...", "egg.boiii": "I dont like most cheeses and people always seem shocked/upset about that!", "feetthattravel": "Wine", "simmostreehouse": "WHAT?!!!", "heyellie19": "Tea. And coffe. And any hot drink really.", "tinaaamarinaaa": "alcohol, coffee", "_catprincess": "I don't like it either", "line.of.books": "Books by Margaret Atwood. And Charles Dickens. Which is apparently very weird for someone who majored in English lit 😱", "chatwithlyds": "OMG I hate tea haha! I’ve always tried to get into it but just can’t ☕️🚫", "outesspace": "i don’t like candy lmao (which is weird because I ADORE all sweet stuff),, I don’t like tea either but it’s not really a big thing here", "niamhdulsonormsby": "Bacon/Pizza/Fizzy drinks 😂😂😂", "miscreative_adventures": "Can someone please tell me where I can find that tea cup though?? Apparently my Google skills (and general knowledge of porcelain) isn't up to snuff to find it on my own!", "who_the_f_ck_is_lena": "Wine🙈", "rosieecross": "Jacket potatoes 😢", "theqdust": "Donuts XD", "nuria89sb": "@etniabarcelona glasses 😍", "rona.c.j": "I don't like Doughnuts, gross", "kevin.wg.02": "Sorry but I'm not British and when I hear an English girl doesn't like tea I just found that a little funny 😄", "thewindow6": "You can leave your passport on your way out", "kaaaaaalyn": "I don’t like hot drinks at all. I absolutely hate the idea of WAITING hours just to not burn my tongue 😂I think that drinks are meant to be cold, and I’m from a part of the US where it gets extremely cold, icy, and snowy in the winter. I’ll be the gal sipping iced coffee when it’s -20 Fahrenheit (-28 Celsius) 😂 🤷🏻‍♀️", "josefinceh": "Cucumber 🙅‍♀️", "calest_nightstalker": "I don't like bread. I don't consume bread. Ever. And people find me weird.", "verity10": "Meat😂", "inghostlycompany": "Fizzy drinks. No tea 😲 I feel hurt haha", "a7xbatgirl": "Mushrooms 🍄 🤢", "erin.gayle.95": "@hannahwitton I cannot stand soggy bread or bread that has had something soggy sitting on it for a while. I refused to eat sandwiches for lunch at school because I have a weird thing about spreads seeping into the bread. To this day, I just can't stomach it.", "hatty_gardner": "Gin and Tonic", "saralucy_1": "Chocolate cake 🎂", "kathryn.flood95": "Marshmallows", "b1m555": "Sushi &/or raw fish 🍣", "abigailnotabi": "I don't like tea and coffee and I don't really drink fizzy drinks. People always ask how I stay awake, especially doing 12 hours shifts/night shifts 😂😂", "nvious_arts": "I abhor coffee and all types of alcohol. Sorry folks, just tea for me 😂 @hannahwitton we should swap (I’m Aussie)", "kaitlyn.payne": "I hate cake and everyone is always shocked when they hear that!", "thorn___rose": "I really dislike whipped cream! And no one gets it lol", "dan.robards": "I'm with you on that one. Heated dirty water with no benefit? Bruh I'm good thanks 😂😂", "stephanieyeboah\nVerified": "Verified", "oykuisman": "Coffee....", "laura1white": "Nutella", "p00ntuz": "Coffe and sparkling water :P", "anlui297": "Anything vanilla flavoured is not gonna pass my throat and no I know gets that😅", "chloethefawn": "I’m the same, not a tea drinker either, ppl think it’s odd although I actually don’t mind the taste of ice tea funnily enough lol 😅", "starsandmoooon": "...pizza", "henry_pollard": "You look like you’re in a Quentin Tarantino movie planning a heist", "wordssave13": "I dont like tea either!!!!!", "mightymelli": "I don’t love all cheeses.", "katewan_": "Tomatoes 🍅", "saraluna37": "And I don't like tea as well", "themuffinkhan": "I hate pumpkin with a passion.", "karli.jd": "alcohol...every single kind of alcohol i've tried has been SO disgusting i'm convinced no one actually enjoys the taste! i've had like 2 wine coolers that were good and that's it", "annefien": "Chocolate", "joshmillermusic1": "#CancelHannahWittonBecauseSheDoesn'tLikeTea!", "notkuul": "Most desserts also bacon", "lili.stevens": "I don't like sparkling water(la Croix or otherwise) or boba tea 🤷🤷🤷", "mildly_manic": "🧀", "ryandbischoff": "Ice cream", "lostfox27": "My cousin doesn't like tea, alcohol or potatoes (we're irish the last one is important).", "keynlok": "People", "leanne.miron": "Butter", "easy_lemons": "soda / pop! (and sparkling anything... i’ve always hated carbonation) 😬🤷🏻‍♀️", "froztiq": "hannah can i talk with ya privately?", "carriejohnson96": "I don't like cheesecake!!", "lozbrennan": "Avocado!", "motta_rapha": "Since I was a kid I never liked ANY kind of fruit. It just smells bad for me for some reason", "ella.hopkinson": "Omg I don't like tea either and I always feel so unbritish 😂😂 nice to find a fellow btitish tea hater 😂", "optima_palatino": "I hate cheese and butter and pizza and many other things as I am picky and autistic", "madeleinebombshell": "Peanut butter", "avis03": "Soda", "lucialveroy": "Nutella 😅🙈", "alysonsaidwhat": "I think Sunday roast is abysmally boring.", "rebeccafarren": "Ice cream- it’s too cold! But I love Dishoom!", "gigigalazio": "I don't like chocolate. Just praline <3", "henriemik": "Coffee and tea 😅", "keira_n00": "Beef that tastes beefy , so i can eat things like lasagne but i cant stand burgers or steak etc", "irislovescats": "I absolutely hate mint, it gives me stomach ache and whenever I smell it, I just feel sick. No one really understands. I also hate coriander but there's a big community for that 😂", "haleyannebechler": "I hate any condiments (ketchup, mustard, relish, mayo, etc.). I find them all disgusting and no one understands me. 😢", "sleepymcninja": "I hate cheese", "walkeremmaa": "I'm the same, I just don't like tea 🙌", "rbwinter313": "Mint chocolate chip ice cream. Tastes like toothpaste to me🤷🏻‍♀️", "emsladedmondson": "Glamorous mate", "nuriadiez14": "Lemon ice cream. But I also think that most european are crazy because they like sparkling water, why would you put gas on water? I doesn't make it fresh, it makes you more thristy. I'm spanish and that just blows my mind.", "ncastreaux": "Coffee. People in Brazil are obsessed with it and call me an alien almost everyday", "leahmarie_tea": "All seafood. Hate it. No exceptions.", "ves_h93": "Raspberries", "o_franny_o": "Coffee 🙄", "alicia_dmt": "I don't like cheese and everyone loves it 🧀", "cjcxx": "sex", "popynes": "I HATE melon 🍈 and every summer I get the \"how come you hate melon, it's sooooo good!\" 🤦", "angaxa": "Also absolutely hate basil (the herb) and people think crazy...", "murmeli29": "I‘m german and I don’t like beer 🤷‍♀️", "missing_puppet": "Ice cream 😂", "sisiliadestaillats": "Cheese", "lucybenjafield": "Roast potatoes 🙅🏼‍♀️😅", "chestnut_princess": "I hate peanut butter", "lia.penny": "Beer", "mayviee": "Bananas 😒🍌", "minealindqvist": "Green peas 😖 They just have the worst consistency 😅", "wouterdemy": "She's so beautiful", "bookaholique": "Don't like Chocolate ! Shame on me", "kr.lk": "Coca cola 😂 and also mayo 😝", "yasmin_weav": "Hi Hannah I hope you will see my message on the direct 💕", "lil_lyn": "Haha I don’t like tea either my other half tells me I’m not truely British 😂 x", "clairbear1989": "I didn’t like cheese at all until a few years ago. Now I still only like if melted. Also, coffee", "like_lava": "Mac and cheese!", "aharp82": "How incredibly cute do you look 😍❤️", "tamara_ellis1984": "Tea and coffee ☕️", "zimnotutaj": "I hate anything sparkling. Cola included. 🤷🏻‍♀️", "pippawolff": "Fresh coriander, bananas, and coffee.", "rosiemegansmith": "wine 🍷", "sophieloucourtney": "Lasagne 😝", "sarachico": "Chocolate!", "ella_g_mitchell": "Rice", "jobydove": "The inside of elbows 🤢", "lobatosn": "Yeah that’s weird 😝", "emiily.clare": "Coriander 🤢", "justicekenneth57": "Sexxxy", "theunsophisticatedwoman": "Pineapple🍍", "laura_halifax": "Coffee, avocados, coriander and kind of fish/seafood.", "lynstagram2": "I don’t like gravy.", "alicejmalbon": "Tomato ketchup and also mayonnaise!", "carmen.mra": "milkshakes", "celesamuel": "Beer 😣😣😣 people look at me like I kill someone when I say it. IT tastes like piss . #sorrynotsorry", "diiind.h": "Noooooooooooooooooooo", "little18alice": "Liquorice and beer. It just tastes weird.", "bxkkdori": "apples - literally can’t stand them, I especially hate when someone eats one near me and I have to hear and smell it ewwwww", "magrog44": "coffee", "melie.and.her.books": "Cheese 🤮", "niphredil12": "I dont like strawberries or vanilla ice cream", "lucas_fraser87": "@hannahwitton I'm from the east coast of Canada, where we eat tonnes of lobster and crab, but I can't stand it", "mya.temanson": "Mashed potatoes. I love potatoes any other way, but mashed is absolutely abhorrent. I think it’s a texture thing.", "lawrence_pitt_2": "Bananas i just don't like em", "copingwithbehcets": "I don’t like tea either! When I’m sick I drink hot water with lemon and honey, but never tea 😜", "sophieopaton": "Most fruit 😅 (all except lemons and raspberries) I love processed fruit though (smoothies etc) but just not the texture of actual fruit haha", "jimmyshootsfilm": "Coffee, olives, Football, Love Island, Feta Cheese, toxic masculinity... all I can think of off of the top of my head! 😂", "lad.slo": "Well I’m Belgian and I HATE beer so I really feel you there 😂", "oli.kathleen": "Even the smell of pizza makes me wanna throw up xdd", "eerieleer": "Avocado. And alcohol.", "chloejb89": "Cheese. I can only eat it melted on pizza. Otherwise it's disgusting.", "emmaelpe": "Fondant fancies 🙈🤢", "geekycaligirl": "I don't like coffee. People use to ask me how was I surviving college without coffee like tea doesn't have caffeine.", "ubiquitous.me": "@hannahwitton Have you tried the tea cocktails at Yauatcha in Soho. If not you really should. Also the best Dim Sum in London. I promise you won't be disappointed!", "romy.kate": "I don’t like coffee or alcohol which pretty much makes me a social pariah 😂", "guttedgoth": "Tea!! And also warm tomatos, so no tomato sauce for me", "amelooloo_": "i hate bread. everyone gets really mad when i say that but i just don’t like it 🤷🏻‍♀️", "krystalynpayne": "Tacos", "nostdaems": "i hate cheese! :( 🧀", "jacqui_2302x": "I never liked tea until recently, but now I have at least one cup a day! It helps my tension headache :) xx", "hazzab22": "Pizza", "swervature": "#DearTea -- You taste SOOO awesome chilled and served over ice. Hot, you taste like warm #DirTea water. Love, a Native Okie. #DearJune", "sinceresally_team_franchesca": "Cool photo, loving your style. Wanna collab? DM @hoursandminuteswatches and tell them we sent you! 🔥", "kylapyneapple": "I don’t like rice 🤷🏼‍♀️", "peppieluna": "I don't like wine... and I'm French. I don't like mushrooms... and I'm vegetarian 🤷‍♀️😁", "_chloede_": "cheese", "theimperfectcreative": "Puding can't stand it!", "linda_wstfd": "Pizza do not understand at all", "svvs58": "👑🧚‍♀️ 👑 So cool 💎👸💎", "transitorydreams": "Probably the most controversial thing I don’t like is jam..??? I like marmalade, but jam #nope!", "hesterquirlpuss": "Wine. 😖🤢", "reading.ace": "Uhm... Oreos 🙈", "trashcansam.__": "I don’t like bubbly/sparkling water. gross", "corvidaerex": "I've never liked tea. The closest I've probably gotten is very sweet milky bubble teas, but in the past year I've found some pretty nice herbal ones... But they're so hard to judge because they might smell lovely but taste of absolutely nothing!", "allij24": "I dont like chocolate. 😯🍫", "basicwinebitch": "Which tea don’t you like?", "reynaaa_02": "Coffee, tea, horseradish, most sushi", "saraac1313": "What.", "shawn.kirby": "I don't like spaghetti and people think I'm strange", "initaseetheworld": "@isobelsquire What a fitting topic for today 😅", "misspipsalot": "I am Dutch and I hate biking...", "anna.marie.kk": "I don't like our most typical Czech dish which everyone loves 🤷🏽‍♀️", "lellia88": "Melon flavoured things 🤮 Like candy, gum or sweets... I instantly get a headache and feel really sick", "lozzaheeley": "I don’t like tea or coffee ☕️ only cold drinks for me please 👍🏻", "chris.tastrophy": "Peanut butter.", "sophieissoft": "i don't like eggs! everyone judges me for it but i can't stand them", "ulik.sulik": "I don't like pizza and nobody get it 🙄", "faithh.jones": "I don't eitherrrrr, also cucumber people hate on me for that?", "bree.maree": "I found out my friend didn’t like gravy after spending my whole life thinking everyone loved it 😱", "queenofcarrotflowerz": "i hate ketchup! i can’t even smell it without wanting to vom lol", "cassiehayle": "Cold tea good. Hot tea bad.", "aki_shoe": "I also don't like tea, i'm half japanese, so that's also nearly a crime 🍵 besides that, i reaaally don't like donuts and i've tried many different kinds 😝", "highwatertrousers": "Raw tomatoes and cheese that tastes too much like cheese 😅", "1000linka1000": "Chocolate...", "philidordefence": "I used to love tea and abhor coffee. I'm drinking coffee right now. ☕️", "shanboody\nVerified": "Verified", "cjsynesthete": "I don’t like pasta. I DESPISE pickles. And I also don’t like mineral-enhanced drinking water because it tastes bitter.", "justanotherfoodlover": "I don't like tea either! I don't get why people are obsessed with it?! Coffee is another story ♥️", "mirmeris": "Cheese 😷 Why would you put something that smells SO bad in your mouth??", "livliketheriver": "I hate strawberries and people think I'm an uneducated alien for this reason :D", "idaschelhase": "I dont like bacon, and im Danish ..", "insidethecask": "Me neither", "graysonkali": "Most people love avocado and I can’t seem to like it at all", "rmenzies3032": "Hannah you need to go to Europe they don’t do Tea but coffee is like tar and a quarter of the size.", "littlepalmer": "Live in Canada and don’t like the smell of syrup 🇨🇦", "m_kolpin": "I don't like chocolate.", "ducayink": "Pizza 🤷🏻‍♀️ (don't hate me)", "ailis_steele": "I’m an Australian that doesn’t like vegemite or beer, so, not to reduce down our culture but", "ward.dexter.charles": "I don't like cheese. =p", "sarah.brown__": "I only like chai tea and people think that's weird too 🤷‍♀️", "alexlunamarie": "I love hot tea! 🍵 But...I live in TN, USA and hate sweet iced tea so...💁🏼‍♀️😷", "alyssaeve97": "I don’t like pizza and I don’t eat meat (or fish)", "hen.gro.44": "I have like 6 cups of tea a day, i can't live without it", "gayicon101": "Same x", "merrynkt_": "Bacon😅", "katyanderson9": "Tea , Coffee, Milk, Butter and Eggs oh also Mayonnaise!", "annvlin": "Beer! I think it’s disgusting...😅this is almost a crime in Germany 😂😂", "corazon.de.melon.98": "I dont love coffee... fairly strange I a Starbucks/frappuccino/cappuccino/cold brew/caffeine jolt obsessed society.", "rainsfetch": "I don’t like chocolate very much. 😂", "amberoostra": "FINALLY SOMEONE WHO ALSO DOESN’T LIKE TEA", "katie.marie.15": "I'm a vegetarian so people thinks it's weird that I don't like meat", "christy_.cooper_": "WHAT? Tea is great!", "firefly24601": "I don’t like tea, either. Nor coffee! 😁", "annikafrida87": "I don't like tea either. I've tried to like it but nope.", "teapetrichor": "😳☕️🤗", "peripherbee": "I have always really disliked cheese 🤷🏻‍♀️ even if it’s fake cheese like non-dairy cheese alternatives", "hujsak": "I don't like peanutbutter. That makes you weird in the US.", "laurajustynaabby": "Vinegar, mostly because of my hate war with pickles", "competent_equestrian": "I don't like the twilight series", "yejicy_": "cake and tea and scones are gross"}