{"portrazdacamera173": "Gata linda maravilhosa", "inspiringjoanne": "🙌🙌", "theordernovel": "You look great love 🌈", "winninattitudeboutique": "Booo", "lupita_101216": "You and I have very similar body types, and it makes me so happy to see someone else so comfortable in their own skin. It gives me hope that one day I will be that confident and strong", "aura.clothing_": "Hi Hannah, we are a new UK brand that creates clothing for ostomates! We would LOVE to collaborate with you😍💜", "kadenklupfel": "Hi", "dlobrienusa1": "Very sexy in your underwear Hannah? Need help removing them?", "se.xed.podajdalej": "You’re so beautiful and wise ❤️", "annabelle8817": "This is so inspiring and beautiful @hannahwitton", "chrstiank": "You makes me melted by seein this 🖤", "smooedvevo": "Very nice picture @hannahwitton", "izukumidoriya13_official": "Nice big boobs you got there hannah?❤️", "sim_chau_": "now we can give iron-man a run for his money 😉🦸‍♀️💪 #superhero", "camillas.ostomy.life": "Love it 🖤", "americanclouds": "IBD Warrior 🙌🏻🙌🏻🙌🏻", "jameslawhorn7882": "Omg you r so sexy😊😊", "daverummer": "Gorgeous and sexy!!", "pigpen2973": "🤩", "ashleeski": "This made me emotional! I had an ostomy that was reversed due to my colon cancer and I’ve been afraid to show off my body due to the scars, but your Instagram just boosted my confidence and gave me so much hope. You’re so beautiful! 💖", "lil_ben_g": "Wow you have humongous tits ! There nice 💯👌", "sandramoncores": "Corajosa", "fiveseven92": "Your naturally beautiful and you should always be proud of how confident you are about yourself @hannahwitton", "bryce.crane88": "💙👜", "whosdavesalba": "Always tea 😋", "hargreaves1088": "Perhaps somebody can make designer bags for us- just to be a bit more colourful 😎", "rahaf_rabe3": "❤️❤️❤️❤️❤️❤️", "lulurichards": "@callumislost such a babe😍", "luis_monteiro_correia": "😐🙂😍😍😍🍆", "pauulatorre": "💕💕💕💕", "edgarsan64": "You look great", "pacytaz": "Supieras lo que me subes el ánimo mujer ... me alegras mil .", "_nevellelongbottom": "Soooo beautiful 💛💛 house pride xxx 💛💛✨", "megdt932": "I started following you because of IBD. Not videos like “watch me not wear a bra for a week”.", "nacorthi_aka_steve": "🔥🔥🔥🔥🔥🔥😍sexy!", "s10_fftb": "You are one heck of a lovely person", "outesspace": "thank you for using your platform to share the important stuff; it sure is a beautiful skin 💓", "asmuni44": "U need excercise", "its_ajbrown": "❤️", "fryhrz": "@_blue.crush", "josh_baum7": "You have better skin than me by far!", "le_foz": "Hannah, you look absolutely beautiful. You are amazing.", "georgie.estelle": "What a stunner 💕🥰", "gazcrooksculpture": "Thank you for your honesty.", "luke31.89": "You seriously look amazing! Beauty-full!", "richard.page6": "Very sexy sweetheart ❤️", "mrs.annahovakimian": "You go 👏", "genejr18": "So bad.", "gooddaykelly": "What a wonderful way to reframe... The skin I am Alive in💕💕", "jasondanielsauthor": "What beautiful skin it is :) ❤️", "amelieasia": "Beauty queen 👏🧡", "joeyd614": "The word of the month should be BEAUTIFUL...❣️🤗♥️😍🌹", "imjaywatson": "You look beautiful Hannah 💕💝😘😍💖", "bayleebutton": "I’ve always felt like a weirdo because I am petite with thighs and my thighs curve outwards like that too! But they’re totally normal/beautiful when looking at someone else! Thanks 💕", "mdd2014": "Beautiful", "tittieeeeeeees": "Tig ol’ bitties", "thepoorwayfaringstranger": "Ok. I apologize for being rude. But you seriously got some fat titties. In a great way.", "notmacin": "these selfies are so amazing to me because I RARELY see women in the media with body shapes like mine. seeing you feel comfortable and confident in your body makes me feel like I can do it too 💞", "atanshubashi": "And a gorgeous skin it is.", "nireevilo": "Was just finishing your Periods, Contraception and Hormones Roundtable vid when I opened Insta and saw this. You are a wonderful inspiration and advocate. Thank you for all you do💕", "meggynoodlez": "Oh thank you for this! You have no idea how much I needed to see a real human, a real body.", "caparod": "Sexy 😍😍😍", "heymadelyne": "Beauty and confidence ❤️", "jaikhe": "Ur beautiful", "primezulu101": "🔥", "kiki034": "#Alessia cara", "_annarebecca": "You are beautiful!! ❤️", "brentheilman": "You look beautiful stoma and all❤️❤️", "gfrbr": "and I wish we would be dating", "brian_wilson_1985": "I love the skin you’re in. You look absolutely beautiful!", "orlastynes": "I really admire you. and the fact you have the confidence to post picture that people would find hard to post shows just how incredible you are!!", "hannahtheginger_": "After listening to your podcast, omg your belly button is pretty weird 😂 you’re still beautiful anyway mind you xo", "bendyzebra101": "@hannahwitton. You are beautiful. I wish I could be this comfortable in my skin.", "rosesamuels4": "💛💛", "jenskimalinski": "You are such a wonderful person! I am going through some issues with a chronic illness at the moment so have lost lots of weight suddenly but your content has taught me to be comfortable with the skin I am in no matter how much I weigh. Thank you ❤️", "charlielilyy": "Ugh you’re such a queen 😭⭐️", "millwright93": "❤️❤️❤️", "emily_runz": "Our bodies do so much for us especially yours Hannah with your surgery and your running afterwards. We don’t give our bodies enough appreciation. They help us when we have colds and mental dilemmas etc", "justicekenneth57": "Sexxxy lady😍", "charliedrakoulas": "“Take off all my makeup, cause I love what’s under it.” #littlemixstrip", "kiss__my__asthma": "💜💜💜"}