{"tyeyanabeale": "Your**", "nanoochka": "What a nice thing to do! Thank you for being such an awesome lady and an amazing source of style, body positivity, and inspiration. <3", "krystalclyne": "This is so thoughtful of you. And this is exactly why I follow you 😊 #youreamazing", "thelookbookdiary": "Keep on inspiring us all @gabifresh 😘", "mrzberry215": "@gabifresh I am appreciative of you because you inspire me to love and be comfortable in the skin I'm in. I no longer feel like I have to live by the world's standard of beauty. I am beautiful because God created me. Thank you.", "shariiiiiiiiiii": "You're so awesome and inspiring! @gabifresh", "chloepierreldn": "@gabifresh i just wanted to say hi and thank you for continuing to post awesome shit! You know I love your blog and have done for ages! You continue to inspire me and look forward to seeing what you have in store for 2016 and hopefully being finally able to meet you in the flesh my friend! To 2016 and beyond X", "nellebellesconfections": "Just thank you. For being beautiful and awesome and showing that you size can't stop that part of you (or the rest of us) from showing. Happy new year.", "inspiremeartworks": "Hoping to grow my business in 2016 , I am so passionate and Love LOVRE what I'm doing, for the first time and I'm 56! Never to late. Follow your passion,give back to the world and have a big heart, LIVR INSPIRED!!", "gingersweettpie": "I know the contest is probably over but I'm now seeing your post and I've always wanted to say this: \"I love your page and what you have been doing for women (plus size or not). You go out and rock what you want with style and grace loving every part of you! Your confidence is amazing, your smile is contagious and your swim suit line is flawless. From your Instagram page anyone can tell you are a beautiful woman in and out. I remember the first time I saw you was on another site (either Huffington post or Buzzfeed) and I was like 'I have to follow this girl on IG'! And I did lol. Keep up your awesome and I can't wait to see your new line tomorrow💜💜 (I'm still obsessed with the black white and pink 2 piece but I missed out on getting it smh) Congrats on your success hon!", "aquabrown": "I'm all kinds of late, but I want you to know I dig you- your fashion, beauty, confidence, girly swag..all that!", "gabifresh\nVerified": "Verified", "ayesha_khalee": "@gabifresh Goodness is about character - integrity, honesty, kindness, generosity, moral courage, and the like. More than anything else, it is about how we treat other people and this act of pure generosity you are displaying, shows you have a heart of gold. We are living in a world nowadays where ppl are too self consumed and sometimes and we forget others. I know this may sound cliche, but you helped me find my confidence in a world so cruel. I've been following you since your YFF days and Queen you have gave me sooo much information. You're like my BFF in my head lol. I've done enough rambling, but from the bottom of my heart, THANK YOU 💜. #QUEEN #GENEROSITY #PURE #LOVE #FASHION #FASHIONISTA #MELANIN #heartofgold 💜💜💜💜💜", "sincerely.gen": "@modestyandfashi0n thank you for that. I've never won anything like this before, I honestly feel like it's a gift from the universe 💗", "thekaycoleman": "Gabi, this is amazing. I know that you've been super busy making moves and such, so I check in about twice a week to see what you're up to. Beyond this extremely generous gesture, it has been a joy to watch your journey and witness your evolution as one of our generation's most enterprising business leaders. Since YFF, you have remained true to yourself while building the captivating brand that is #GabiFresh. Initially I didn't consider posting, but then I thought about my niece Faith. She's an 18 year old (beautifully plus sized) young lady and lives with a condition referred to as hydrocephalus (a.k.a. water head). Faith graduated high school last year after doctors told my sister that she would never walk or talk. As she transitions into the next stage of her life, I would like to bless her with some extras to include a few wardrobe additions and a girls gettaway. Faith has a heart of gold, always shows concern for the well being of others and although she has endured multiple surgeries along with some physical and cognitive challenges, her ambition to lead a productive and happy life has not wavered. Life is about creating priceless moments and blessing others along the way. You make the world just a little bit better by sharing pieces of your journey with people from all walks of life each day. I am touched by what many of your followers have posted here. From those who shared 'hearts' to the more elaborate statements, I know that all of us are immensely moved by what you're doing. The true blessing rests in knowing that the world is still full of kind hearts. Sending lots of love and holiday cheer to everyone here! ❤", "aliciagon829": "@gabifresh I love you. I just wanted to say your such a great person for giving back! Congrats to the winner!", "anhsmith": "Though its too late for the giveaway, I want to tell you how much I appreciate you Gabi! When I found you about 4 years ago, I was in a bad relationship with my body. I'd always been curvy but after having two kids I felt depressed about my looks and gave up on the fun and sometimes wild clothes I always loved. I started dressing old because I felt like I had an old lady's body (at 29). This despair was hammered home by the barrage of style images coming at me; because everyone I saw looked so different than me, I felt very outside of the life and joy of expression people with great style have. Until YOU! The first time I saw your picture I just stared at the screen because you looked like me. Seeing you rocking it helped me reconnect with a part of myself I missed. Seriously you brought my love of expression through fashion back to life and helped be gain confidence to be myself. I would see clothes on you and realize that I could wear that too, and it freed me from a perspective of defeat I'd adopted toward my body and the image I project to the world. So thank you my blogger twin for giving me vision. <3", "shannanjanae": "I believe it's a gift from God. So happy for you. Enjoy the holidays and enjoy this blessing! @gencuesta", "samlovescheetah": "Honestly alot has been going on i was in military college i had got pregnant and moved in with boyfriend since then been nothimg but down hill working dead end jobs to making nothing almsot. Found out my boyfriend not happy anymore with me i been so depresseed no one to talk to or turn to nd only way helps to get dressed and dolled up and look at myself and fight another. Regardless of what im going thru my son needs a mom and that what helps to keep me in postive mind set and keep pushing. I cant go home mom she kicked me out when was in college really wana go back to any college and just get a career kinda wana do what u do just dont no how. Hope god hears my prayers thanks gabi for listeing", "kimical_rheaction": "I don't know if it's too late or not, but I just want to thank you for being an inspiration to me. I've been following you for a while and your body positivity and confidence has helped me to be more confident. Your style is impeccable and I credit you as my fashion influence. You are truly an incredible person!!", "thickspot": "I'm a struggling artist . With a newborn baby. ( well she's 7 months). All acts of giving is must and much appreciated.", "queen.i.v": "I'm grateful for role models like you that show women like me that we should always feel beautiful and create our own happiness and opportunities. I believe beyond anything else that if more women empowered each other we could be an unstoppable nation, and bit by bit we are getting there, thanks for doing your part!", "courtneyemcgee": "You have been a fantastic inspiration in body positivity! ❤️❤️❤️", "midwest_nik": "Gabifresh.com makes shopping easy breezy this holiday season!", "qt203": "@gabifresh Thank you for your inspiration. You are the reason I feel in love with fashion. Thank you for helping me to love who I am.", "curlsandcontours": "@gabifresh thank you for being such an inspiration for women. Happy Holidays!", "domrynae": "🙏🏾🙏🏾🙏🏾 Bless your heart for this BEAUTIFUL AND GENEROUS gesture that you are doing! Continue being a blessing and an AMAZING inspiration to others!! May God bless you in return...10 fold! 😊💕 Happy Holidays everyone!", "gothy_womxn": "I'm so glad I found your blog years ago. Your body positivity has been such an encouragement as I've begun to navigate adulthood and self esteem.", "camille_myers_": "I just want to say how much of a impact you've had on my life personally. You and others as well. I'm a 16 year old female who has issues that I would like to fix and trying to fix. But with those issues iv learned from past experiences that I have to love who I am and everything about me. Before I can try to \"fix\" something that doesn't need to be fixed in any way. Beautiful people like yourself inside and out have had a positive impact on my life thus far. And will continue as I aspire to become such an amazing and talented person. For the past 5 years iv had knee problems and in the past 2 years I have had 2 Surgies on my right knee. The first surgery didn't go well at all and caused even more pain. For that reason iv missed a lot of school unfortunately. And just recently I've had my 2nd surgery in October and on my way to recovery. But if I was to win this prize. I would spend it on my mother. She has had to take many days off being with me and what I'm going through. And even before that with my sister because she had something similar happened to her. But my mom has been through a lot and just to give back to her for all that she has sacrificed for my family would just mean the world to me. But even if I'm not the one to win this, I really from the bottom of my heart want to say thanks for this opportunity. And thanks for being the person that you are...💕😊👏 God bless you and your family & Merry Christmas!! 🎄😃❄⛄", "fatinthecity": "#blackgirlmagic", "lilacangela": "First of all I think this is amazing of you, and it would be a great blessing if I was the lucky winner it would really help my situation.", "rashareigns": "Gabi I've been following you since you were taking pics in your living room and doing your first Asos Curve review. As much as I need to pay my bills I'd love to take a vacation and join my bff in Puerto Rico for New Years this year. Be blessed! You totally rock for this.", "_castellanos__": "If I won my family could actually have Christmas!!", "ashleymccarty_": "Hi @gabifresh my name is Ashley, I love your page and feel inspired EVERYTIME I'm on here. I seriously get in my Instagram app just to be inspired by your body positive image you are my role model! I wish I could meet you and hope you will forever have your Page. Thank you so much for inspiring me to love me for me. @gabifresh", "mariaana_c": "Im probably late with this comment but you were one of the first people i followed. In a world were everything seems to be about being skinny and model like, you made me realize that accepting my curves was the most important thing.", "bwebb27": "You're such an inspiration! So happy you exist.", "psandersmakeup": "Thanks for being true to who you are. It's easy for us to want to compare ourselves to those on social media and feel as if others success is the ideal and ultimate success! This post alone shows just how true you really are and that you fit into no one's category but your own! All the best to you this holiday season! Love!", "nays_voice": "Enter- thanks for being bold and living your truth in a world that wants you to live a lie.", "lmdub19": "Yes you're dope and inspirational and all that but for real for real, bless you for brining emu oil into my life--Happy Holidays!", "dtregs": "So glad that women now have such amazing and articulate women teaching them about body positivity and learning to love themselves. THANK YOU for all the positive work you do! 🙌🏻", "rinababiix3": "Well for the past 4 months I have been dedicated on a weightloss journey. As tough as it has been I have never felt so much better about myself! 25 pounds down and in hopes of dropping another 25 before my birthday. Being obese all of my life I have been ridiculed, people can be so hurtful! I've always been the fighter! I've always dressed however, but being BOLD is always criticized.. It has broken me down. But I have realized that I love me, and as long as I love me everything everyone else has to say no longer matters! Anyhow winning 1000$ would be nice considering I have never won anything in my life! And I been thinking about taking momma bear on a mini vacation! lol 🙈", "teabells": "Been following you for years!! You are so fabulous and I love how confident you are in your skin. So influential and stylish. Keep doing what you do!!!", "courtlyncarter": "I've been reflecting a lot lately and - to keep it brief, these past two years have been far from kind to me. I've got my fingers crossed that 2016 is the year I find some peace, accomplish some goals, and get motivated to put focus back into my passions. Stay gold, Gabi! 💛🎄😚", "frosyafortochkina": "Wow,a great Christmas gift for someone🎄🎁 Thank you! Send you my love from Ukraine😽", "maybesiegel": "The year (and years to come) of the big girls! Things are starting to feel good and represented and big and beautiful.", "leonorssilva": "Gabi you are such a good person. It makes me happy. You know... You inspire me. One day I was this skinny girl, who didn't know the power I had in me besides my curveless body... Than I saw you! You inspire me to love me, my smile, my body, my mind, MY SOUL! If you only knew the difference you make in people's life! Thank you for everything babe! Kisses all the way from Portugal ❤️", "claudia_gttz": "Awesome 😎😎😁", "splashymsparker": "Winning the money could help me out this holiday season I have really been down since I lost my job I apply to 10 jobs everyday in not getting any luck with that I just wanna feel like myself again thank you for listening fan from DC", "specialval": "Lovely gesture at the holidays! Thanks for being a glowy person to follow ✨", "__justkiersten": "You have definitely been a contributor to my spark in self love & self esteem. I haven't always felt pretty or been confident in myself, but while frequently visiting your page, along with a few others, I've been able to see my self worth through the confidence that I've seen. Thank you for being an inspiration 🙏🏽💕", "hellokells": "positivity is such a remarkable thing, no matter what it is associated with. your body is something absolutely necessary to be positive about, so thank you for setting an example for everyone that is seeing this post, for all the teenagers like me who need positive reinforcement. thank you❤️", "50shadesofvon": "Would love to win😩😩😩🙏🏾", "sandieau05": "Excited about tomorrow!", "tank904": "Maannnn... I'd pay my momma's mortgage like 💁💁💁💸💸💸", "loveplus_": "Laying here while my baby girl naps, catching up on IG on a rainy Saturday when I should be packing for our upcoming move. 😘", "toocurvytocare": "Couple yrs back my mom told me about you. Went to your page, you were wearing a black and white dress. And I was like wow! A curvy girl like myself pulling off all these styles. I was amazed. I had never seen fashion done how you do it. And I've been a follower ever since. Following your blog yrs later you show so many women to be comfortable with themselves and what they wear. Fashion for plus size women has come a long way. And I must say, you have had a hand in that! Xoxo", "jessicacea": "Your site was the first site who presented fashion, politics and a woman's right to some goddamn confidence in a way I finally recognized. GF.com is a mirror on the good days and an inspiration on the days I need a boost. Thank you.", "kbaby_82": "First i just want to say i love your site and ive your being following it for a few years now. My current mood is frustration due to.the fact that im going through a break up with a guy i had been dating for three years .Starting a new job a couple months ago. Trying to train and get through the holidays as newly single and act like everything is okay is hard but my mom is that one person i can always vent to to help me get through.i have friends but i dont to vent too much to them..i feel embarasesed that whole being in my thirties ppl assumed we would get married.i do look forward to starting school again to get my degree in criminal justice in the spring so im just trying to stay positive.", "rogerliciouss": "Just 😍 that's all 💁🏻", "theunexpectedtype": "Because the world needs more people just like you, who will give back just because.", "quannie_babie": "I remember growing up believing that all plus size females no matter their age would always dress like grandmothers especially on Sunday's when it was time for church. I hated getting dressed especially if I had to go with my friends bc I was always the frumpy one who wore oversized Nike tees with ill fitting jeans. As technology advanced I got into fashion blogs but I got frustrated bc they did not look like me until I stumbled upon your site. Going through your post was like a breath of fresh air because you showed me that being plus size doesn't have to mean you wear frumpy clothes. You have taught me a lot about being plus size and fashionable and I thank you for the dedication and hard work that you have put into your website, swimwear line, and magazine Columns. Love you Hun and keep doing what you do.", "shaza.jpg": "Thank you so much for the giveaway opportunity. I always get so happy seeing women like you uplifting one another. The world can be so tough on women... especially black women so it always warms my heart to see us supporting one another.", "kelseystancliffe": "Hi Gabi! I have been a fan for a while, and love your swimsuits made for plus size girls like myself. This past year, I went to residential treatment for an eating disorder. The look on peoples faces when I told them that I, a fat girl, had an eating disorder were so shocked and hurtful. Recovery is hard, and recovery as a fat girl is hard and even more taboo. In treatment, we had to talk about our recovery inspiration--and you are mine! I strive to be confident, help others, and kind, like you. I hope that you continue to see only the good in yourself, and that you never let the light leave your life. Thank you for all that you do and for being my recovery inspiration whenever I hit a tough time. You are the best!", "faisaluvs": "Congrats on your success. You've come a long since those pics in your Chicago living room!", "missbossbeck": "Hi Gabi! Thank you for helping revolutionize plus size fashion. I remember growing up (especially in high school) and struggling to find flattering and fashionable clothes that fit me. It is amazing the transformation of the industry just in the last five years. Not to mention that purchasing your bikini last year was the first time I have felt confident in any bathing suit in...probably ever! I enjoy following your page and gaining inspiration from your style. Can't wait for ur new line to drop next month! Happy holidays!", "misshollywoodz": "Thank you! #BlackGirlsareMagic", "__knotontime": "I think it's great that you show how many ways plus size women can be sexy. And we also like the same mascara from benefit!", "hearthouseastrology": "My friend Natalie told me to check you out after I told her I was looking to be a plus size model and was curious of her favorite clothing lines!! So glad I did!! Loving it!! 😍", "the.leaux.down": "Thank you for your style, your grace and for being an inspiration to the curvy community! I love your blog and I'm thankful I came across it! Because of you, I found the confidence to be happy in my body, my life and to start blogging in 2016! Thanks for doing this contest! It'll truly be a blessing to whomever you pick! Happy Holidays to you and yours and keep inspiring! May god continue to bless you!", "itsshaybe": "Im one of those people that have been following you since your YFF days and even had the chance to meet you in nyc when I was shopping in forever 21 time square you were so nice! I knew I would run into because we just so happen to both be at MTV i was interning and you won that job with them. Its been cool seeing your journey and how youve inspired so many including myself. Keep blowing peoples minds one outfit at a time!", "_justnaledi": "🙋😉", "reduced_fat": "Thanks for always being true to yourself, Gabi! Thanks for being a positive example for plus size women all over the world. Your confidence and platform has given us a voice! Love you!", "frank_lucas_carter": "Your an inspiration to us all. I'm a single parent of one and I didn't realize until a month ago how much I have let myself go. I work two jobs so I barely have time to myself and when I'm off work I spend all my time with my son. I decided to get a new hair do and spend a little money on myself. I brought a few dresses, slacks, and turtlenecks (yes turtlenecks) I feel sexy with big hair and turtlenecks. I've gotten a lot of attention since the big hair. I'm currently living with my sons grandmother and its begining to get difficult. I have always been an independent individual. I moved out of my parents home at 20 and haven't been back, its just now times are a little rough and I'm looking for a jump start in my new year.", "zuriogletree": "I'm so happy to see women conquering the business industry. To wake up everyday to know God has bless you with a gift, bless you with some type of talent, to be your own boss and not letting anyone tell you different, is #girlpower . You are girl power, i'm girl power lol. You are a true inspiration to young girls and women around the world. Allow God to continue to guide you for all of your days, for the rest of your life. I don't need the money. I want you to know that. Stay in God's path Gabi, big huge doors about to open up for you. Be bless!!! #GirlPower #girlbossmoment", "theideapusher": "The fear of fat its real. Being a plus size girl who has ALWAYS been a big girl I feel confident now more than ever! There is now power in the plus in the fashion industry. Because of trend setters like you and others we can have the tools and ideas to turn fat into fierce and be fan at it. Confidence is the best outfit and I wear it proudly NOW! #What a time to be a alive! #loveandlight", "much_vibe": "Beautiful spirit! Thanks for being that \"push\" during those insecure days, the beauty that is beyond the norm and the love we all need a little of. May God continue to bless you so you may bless others. Whoever wins....Congrats! Let's continue to uplift each other higher. ♡", "mz_ekezie": "You dont actually realize how many plus size girls d world has deemed as fast you inspire stay slaying", "brooketrout.c": "I've been following you on social media for months now and yesterday finally got off my butt and back on Instagram to search for you (and others) to follow. Your sense of style is TO DIE FOR and I love your confidence and message of body confidence and the fact that you're a feminist. Even if I can't afford/desire to replicate your looks just checking out your blog/Insta makes me go model my own clothes in the mirror and feel super happy and into myself lol. And whenever someone I follow on YouTube or social media I just always want to thank them for being so generous, so, thanks! Keep on doing you and have an awesome holiday season. 😘", "ahneetabeat": "That I can make a small difference by loving myself and in turn reciprocating that love to the people that need it the most.allowing myself to ask for help and realizing ive got everything I will truly need when I look in my sons eyes because he contains all universal love in his tiny frame.", "elenisatrazani": "How I feel right now? Back home after a month in a really stressing and tiring lawschool, with everyone trying to make their schedule and not caring about mine, with a friend who has put me in friendzone for over two years, almost sick only to find my mom and dad yelling at me for having a small change at my hair, when what I only needed was some peace and a hug. If only we didn't put so much pressure on our loved ones and if only everyone could have the strength to tell everyone to go to hell, walk their way and be fabulous...Girl, continue to rock! Sorry if I was irrelevant", "aikamnl": "Love you Gabi! I've been following since YFF days and look at you now! I'm a mom now to a beautiful girl and I have no regrets! But to be honest, it's hard to be be body positive all the more. The scars and marks are there, gaining weight and losing weight is an everyday battle. Thanks for making it inspirational and of course stylish. Kudos!", "annface": "This year, Gabi and so many others in the body positive movement have given me daily inspiration to encourage and support the young women that I work with in after school programs and music lessons. Embracing self love is so much more than an inward movement--it is truly a radical act of love for others and the world.", "saying_what_you_think_": "I get so much inspiration from you and many others that I've discovered via blogs, social media etc... It's funny how encouragement and support can come from the most unusual places. I've found so much strength and confidence through people that I've never met and from total strangers. I've only been using social media for a short time, just got a Twitter account 😩, but had I known the positivity that would come from it I would have explored it sooner. Anyways, I wish you and everyone on this post many blessings and love overflowing❤️", "creollita": "love your style! your looks are always on pt, and they inspire me to dress up and flaunt my curves.. from one gabi to another, gracias 💖", "curleighh": "Thanks for wanting to bless someone!!! You have inspired a lot of women.", "sothisischristele": "I just want to say a huge thank you for the boost of confidence that you give me every time that I see your post and your message in general. As a big girl all my life I have hated my body as soon as I understood what it was that society seemed to be \"pretty\". But seeing you be so obviously confident with yourself let's me know that I can be that girl that can look at her self and see something not just pretty but beautiful. Gorgeous. ME.", "msmarq_": "Thanks for being a blessing! Not just with this contest, but for building confidence in women who don't often see their body size reflected as beautiful and sexy. Your style is amazing!", "claugi20": "I just found your page and I immediately loved it!!! I am plus size and is so hard for me to find something that will fit and look gooson me but with your page I found a guide. Also I felt like its ok to try something new. Thank you", "neutronandleia": "Train yourself to look for the good in others and make it a habit to appreciate, to acknowledge. Help to engender a sense of belonging one person at a time.", "asharianaxo": "Thank you for giving me hope, confidence and the motivation to be great, sexy and successful. The world needs more beautiful souls like yours.", "shelbyjanner": "This is so sweet! 😍", "queenmegreene": "I love your style it gives me confidence! If I won this money I could take a master's level class so I can follow my dreams.", "notjus4ne1": "This is the most amazing giving without a laundry list of things to do to qualify. Thank you!", "colombianlupie": "Your such a beautiful role model. Thanks @gabifresh. Simply wonderful", "ohmymeg": "You help me, love me. Thank you 😘", "tiffanika": "Hi Gabi I love your page. I follow you on IG snapchat and I read your blog on a regular basis. I would like to win the money to hep me relocate to Florida and get a fresh start on life I would be very appreciative if I was the recipient and I am thankful that you are giving us this opportunity for a chance to win. You're so gracious and you have such a great spirit it's been a joy watching your brand grow and seeing your success. I am hoping if I can emulate you and your drive I can be even half as successful. Happy holidays!", "raat.ki.rani": "For raising up body positivity and fighting fatphobia with style and grace, I appreciate you!! 💞💞💞", "brosemusic": "Every day it is getting easier for me wake up and look in the mirror and love my body because of people like you. The other day I showed my boyfriend photos of you and Nadia and told him that these women are the reason I felt confident in myself. It gets hard you know? My life revolves around music & I am a singer/songwriter and part of my struggle is going on stage and being judged by what my body looks like. At the same time I'm also a starving artist struggling to be discovered and make a dime to even get myself dinner, so just reading this giveaway post gave me hope. I cannot thank you enough for just being yourself, not giving a fuck, and showing women like me to love ourselves.", "abbyyyy": "Your style inspires me. This $$ would help me shop for new clothes and embrace myself as a plus woman 💜", "mukamtagaraw": "This is so nice of you! Can't wait to reach the point that I can do this for others #givingbackgoals", "kymmie5": "One of the littles spent the entire day running back and forth in short bursts, calling out \" I'M THE FWASH!\" (flash) I thought he would eventually tire himself out. He didn't. Thinking about it now makes me laugh but at the time, in my classroom, I was reconsidering my career path.", "biancabruno": "You are a major inspiration to so many women. I'm so glad I found you and other stylish women who embrace who they are. I'm glad I learned to love myself in my twenties and I'll spend the rest of my life practicing self love!", "biglovely89": "What is the number one thing you want in this world? I want world peace, the pursuit of happiness, & students in college!", "madewusi": "you make me want to be me...no doudts.no insecurities...just content to be beautiful and fearfully made.😊", "ms_ginarose": "❤️", "kasscrd": "I really like your sense of style and I think it's really nice of you to do this type of giveaway😊", "teachinginhawaii": "Thank you for being a feminist and not being ashamed to claim that. I am grateful to have strong women like you on IG and in this world. You're an inspiration to me and my students. Mahalo! With love from Hawaii.", "angie2juicy": "This time of year is always a happy and joyful occasion. I am truly thankful for everything that I have and have accomplished this year and in life. It's so sad to c things like the San Bernardo shooting or the Paris bombing things like this make me truly appreciate the little things n life . I have been following you for many years you r such a fresh breath of air and a inspiration u give plus size girls confidence and such a stereotypical judge mental world. Thanks for always being yourself, fly and fabulous.😍😍 happy holidays 🎄", "chelsea_milan": "Your confidence has shown me that's it's okay to love the skin you're in and that it is so important. Your constant slayage gives me so much life so please keep doing what you're doing❤️love your hair btw!!!", "ruwimbomakoni": "Beautiful minds inspire others. ❤️", "malynem": "I won't tell you why, but I could really use such a generous gift. Thank you so much for offering this to us! I am grateful for pages like yours. They show another side of beauty and it has definitely boosted my confidence. You are proof that we can be fly at any size! TY!!", "2fillesordinaires": "Christmas Spirit right here. Here's to a rocking 2016 🍾🍾🍾❤️", "starrykat": "Gabi, you're one of the first fatshion bloggers I followed, love visiting your site and seeing this warms my heart. Thank you for being you and thinking of others", "abitofarecluse": "What if aliens think the Alien movies are trashy reality programming?", "parisldn": "Just when I thought I couldn't admire you any more than I already do! Thanks for your generosity!", "soulshine": "Love is the answer. ❤️❤️❤️❤️❤️", "youdntknomylife": "This is dope! Tis the season ❤️", "angelndisguys": "Been rockin with you since I found your site back in 2011. How now I don't remember but youve given my so much fashion inspiration. Thank you.", "8thspiff": "Ahhh this sounds so kind. 😇", "thekimgonzales": "Love you @gabifresh! Glad you're doing what you are doing. Means a lot to many people ❤️❤️", "moniemahara": "You were honestly the first person to inspire to me to step outside the box with my style. As a big girls was always told to of course cover up but when I saw you I thought \"wow! She looks amazing! And she's plus size and beautiful!\" The money for me would just be a blessing with holiday season and bills of course but just see you out here willing to give from your heart is a really beautiful thing. I've followed your journey from those mtv days lol and I can't wait where you're headed next! ❤️❤️❤️", "mcbooknerd": "💞", "pamaranian": "Thank you for being that life changing and empowering female figure I have always looked for in life. You're beyond amazing❤️❤️❤️", "hail_king_sha": "You're so amazing and I live for your blog and fashion inspiration. Because of you I now show #boohoo and #asos faithfully. Thanks for being a freaking trendsetter 😘", "tishsjuts09": "You have been an inspiration to me since I was in middle school, before gabifresh.com was the official website. You opened my eyes and instilled confidence in me. Thank you so much for all that you do and the work that you have done within the body positive community. You are appreciated greatly <3", "chasingskinnyblog": "How kind of you! Thanks for changing our perceptions on what is deemed beautiful. Keep doing what you're doing, it means more than you know.", "marsandbackagain": "When I first saw your blog, I love that you was so confident and looked amazing. Just like every other girl I've battle with low self esteem, but you help me feel more comfortable in short sleeve, and shorts. I was a big sweatshirt, full clothed girl throughout high school. You truly change my outlook on my body, but what really got me was the lingerie shoot you did, I love lingerie, and have a problem finding nice bras for my cup size or affording them. I decided to come up with my own lingerie designs for all cups sides, and for women to feel sexy, confident,and empowering. I think it's important that I help other women inspire to love themselves and motivate other women, like what you do for all of us. I just realize you taught me more then to be confident, but to inspire other women. Happy Holidays", "kmchecrnbrd": "It's amazing what happens when one chooses to open up and share their story...thank you for sharing. May the one receiving your gift also be a blessing to someone else or others.", "itsaishanicole_": "You are a blessing! ❤️", "missjae1908": "Thanks for being you!", "liss_est1985": "You are beautiful! Inspired by you", "soshenell": "HIM: You are so pretty, but I've never talked to a big girl. ME: Im sorry did you think this was your opportunity? -shenelldujour #mytruth #mystory #howIhandledit. My dialogue has been shared throughout social media and has rendered awesome feedback and even many sharing their own experiences. I am happy to say ppl were empowered by my dialogue, hence it has further encouraged me to say this.... We have entered into what I call cuddle season. From now until February well be reminded of all the joys of this year and high expectations of the next. However, some will be forced to think about what they dont have and also how this season is torture for those who may not be romantically involved. Yes this can be a season that's perfect for a couple-one that requires keeping each other warm, but if in fact you have to deal with ignorance over physical preference, trust you are in a perfect place(single) no matter what the season is. Enter into the next year believing you will never settle for thoughts like this dialogue. You are more than JUST ENOUGH, YOU ARE EVERTHING! Learn to \"Love yourself without interference\"-shenell. You are the first to accept your beauty in the perfect package its wrapped in. \"You are not your size\"-shenell. I offer you the gift of self confidence, worth and love\" -shenell. I pray you open it with high expectations. @gabifresh thank you for showing me the route to share my truths, I love blogging.", "kasey_sanch": "This is what the holidays are all about! Thank you putting a loving act out to the world! 🙏🙌👍👏", "harrell422": "Congratulations in advance to the person chosen. Pay it Forward when possible. Love your curves, love yourself. LLLL (Live, Love, Laugh, Life)", "rachrholley": "Gabi, you are an inspiration to myself and many others. Thank you. You're beautiful, intelligent, and hilarious. I feel like we could be best friends in another life! Lol! Thank you for your generosity, and good luck to everyone! 😘😘😘", "believeloveinspire": "I'm grateful for my children, my health, life, love, family & friends. Everyday is a blessing💛", "s.emily_parker": "I'm so happy to have a supportive group of body positive instagrams to follow. I just love being able to see positive thoughts and support on so many levels. Thanks for being more than expected, and part of encouraging others to be more than expected. ❤️", "mkaufmannyc": "Hi Gabi, merry Christmas and happy holidays! It's been an unbelievably rough few years, but being able to log on to your website and plug in to someone else's life for a bit has given me a little bit of light. This is the first time in a long time where I've been able to see myself in the mirror without wanting to turn off the light, so thank you so much.", "ohheykristin": "Thank you for helping me love my body again.", "malik_akz": "I'm now so much more loving of my body, thanks to you, Gabi! I am finally able to wear flowery dresses, smart clothes, full on makeup and feel I can concur the world!", "like_a_kodak": "Don't stop what your doing Gabi, we need more role modles like you", "onceuponapoet": "grateful for the folks who pray for me & remind me I can do anything. grateful for books & trap music. for my sisters. for all who feed me & keep me sane.", "ronishalenora": "I sent you a message on tumblr like four years ago because I just started college and was insecure about my body and height. you told me be myself and the best way to dress is comfortably because if you're not comfortable it'll show and confidence makes up 90% of the outfit, you said other supportive things but I'll never forget what you told me. you supported me in that moment, so I'll always support you. every time you've replied to me or favorited a tweet just reassures me that you still support me, whether you think so or not, and it means a lot to me. I really hope I win but thanks so much for everything you've done for me already.", "victoriious_": "I've been following you after I saw your swimming suits that you released a few years back. I just wanted to say thank you for being a strong confident woman of color that I can look up to. There aren't many women out there who look like me, so thank you for stepping up and filling the void. Every day I strive to have more confidence and I'm grateful to have women like you to look at.", "chelciex3love": "I found your page as I was just starting to love myself and my body. Finally I was finding all of these body positive plus size models that looked like me. All my life I didn't have a very high self esteem because I didn't really have anyone to look up to and to tell me my size was beautiful. I've always been super into fashion and when I found your page I felt like we were very similar and it helped me gain the confidence I have today! Hope you have a great holiday. 💁🏻", "founderellie": "Love you style! Very classy and fun.", "nicolettemason\nVerified": "Verified", "dredaydizzle": "Thank you for always keeping it 💯 and for being a role model with a great outlook on life!", "mgdiez": "Good deeds do exist. 😘", "shamzeh": "Ooh awesome", "ruth_rebeccaa": "We get sorry about being pretty. Let's be pretty kind. Pretty funny. Pretty smart. Pretty strong. @words_of_women Have a wonderful Christmas and I hope you are fine😊🎄", "natashiapa": "Presence!! What I learned from following you! That it doesn't matter who you are, how you look, being present is what matters. Especially during the holidays people get so focused on buying presents and getting the perfect outfit for the occasion in order to be happy and look beautiful... but it goes farther than that. By being present in the moment with your family or friends at every moment is what grants you those great memories which brings true happiness and that utmost joyful bliss that makes a women truly beautiful. Thank You for sharing that with us!", "e_daniela22": "By following you it has taught me that you dont need to be a size zero to be beutiful and confident. Thank you for that.", "inspo_28": "I have always felt like I needed to hide myself, or felt like my body wasn't beautiful or acceptable enough to be embraced. I have recently started a beautiful and positive journey to change the way I think and the way I carry myself. Just because I'm plus size, doesn't mean that I can't dress up and still be fashionable. I always thought being plus size meant that I couldn't wear the same fashionable things as most girls that I see. I just created this new Instagram page for myself as I start this new journey and started following people like you who could inspire me to be the person I know that is dying to come out and show the world who she really is. This for me is just only the beginning of a beautiful journey, and thank you for being part of that inspiration @gabifresh", "claudiapompoms": "Wow, this is so generous of you! I don't remember how I found you, but it was via a blog feed, and I started following. You're so beautiful. You gave me courage to walk around in swimsuits, just accepting my 36g bust. Embracing my body, comfortably. Take care, enjoy 2015 out. ❤️", "oribrolyat": "Fat!so? Riot don't diet", "moka_ru7": "This is very generous of you taking your own money that you worked hard for during this season, now I'm not saying I couldn't use it we all could, lol, but knowing it's benefiting someone who really needs it. Happy Holidays to all!🎄🎅@gabifresh", "yoyo_cosplays": "For 2016 I want to learn more about fashion and body confidence. I've always been plus size and I love being me. But I am human and sometimes get hit with negative thoughts. But I'm feeling hopeful for the new year and I've been finding youtubers and people on Instagram that are very positive plus size people that I can relate to one way or another. I forgot where I was going with this lol but thank you for your fashion and positivity.", "vistetequevienencurvas": "You make me dream. You and the others women (models, celebrities, bloggers) who loves his body, and make that others women love his bodys. It's a really nice present every day of the year. Sorry for my bad english and Merry christmas 😘", "schipmypants": "I really enjoy following you on various social media platforms. Following other women that are positive & support other women is really important. Society & the media tries to tell us that women can't be supportive of one another & that we're catty & jealous. Most of us aren't. Following women like you, Nadia, Tess, Jes, etc. are a good daily reminder that we're all in this together & we should fight for one another, not each other. ❤️", "twillaamin": "I love this! There is so much disheartening news happening that it warms my heart when people do good. Keep sending out love! Love, love, love", "nique.either": "I admire your spirit😍... May God continue to Bless You!", "anactingangel": "I can never get my black eyeliner as dark as my soul and it's terribly frustrating", "confectious86": "This is a great giveaway! I have loved your blog for a log time. This would be a great giveaway to win, my grandfather passed in June alone in his home. My mother inherited his home and we found out that it needs a lot of repairs. The roof has holes and needs to be fixed, my mom is very nervous that it won't make it through the winter. If I won this giveaway it would be given to my mother so she can put a deposit down on the roof work.", "raelaur": "Thank you for promoting all beauty! You yave helped this teacher feel good about herself.", "tahamene": "An sexy, you've really inspired me, ive started to attend events again. Thank you", "carolelizabeth1": "This is incredible! Good for you for doing this. Giving to others is the greatest gift we can give ourselves...always found that to be so ironic yet so true. Happy holidays to you and yours😊", "tracifool": "Love seeing you on my dash to know to follow my goals, you came so far, and I hope I can reach mine as well 💞", "chloekiyoko": "@gabifresh you never cease to amaze me 💗 I've been following your blog since I started High School, back in the YFF days. You helped give me the confidence to express myself through clothes without caring about what's \"flattering,\" and watching you and @nicolettemason SLAY fashion later helped me get through an eating disorder and the most miserable time of my life. Your generosity here is overwhelming, thanks for being an amazing role model and person 💕", "breequixote": "Thank you, effortless beauty! I'm sure whoever wins will be blessed and hopefully continue the chain of human goodness. It's such a sweet gesture of you. Thanks for considering me! ❤", "jds008": "I really appreciators bloggers and fashionistas like you. You really inspire me to love myself on the inside and outside. Whenever I have days that when I am not feeling my best or my most confident with my body, I go look at your pictures and remind myself that it's ok to have bad days, but I can be beautiful at any size! Thank you for your inspiration! Happy Holidays! ❤️🎄🎉", "ambnic87": "@gabifresh Really enjoyed your Jidenna snap the other day! Please snap more of him if you ever get the opportunity, ha. :) He's very easy on the eyes.", "curly_binky": "Gabi, you're the real MVP. Like most, I've been following you since I first found YFF. It's been a pleasure to see you step into your purpose. In advocating for yourself, & the many other young women like you...you inspired me to start an organization at my alma mater (see: @KSUGirlsRock) that encourages young female HBCU students to have pride in themselves, & use that pride to positively change the life of their campus & community. It is my wish to use the total funding for the giveaway to use as a book scholarship for one young woman at my alma mater. I am a believer in paying it forward, & that is exactly what I intend to do. Providing a scholarship to one of my girls has been on my dream board for quite some time, & to act on this would be a true gift. Your hosting of this giveaway is inspiring me to do & be more! God bless! ❤️", "mvrion": "I read a book last week and the author mentionned a poem about a man and a woman who were living appart, each one a star but because they love each other so much, they manage to build a bridge with the other stars through the sky so that they could always be together. I just thought it was beautiful. Love from 🇫🇷", "zaeviltwin": "This time last year I celebrated the holidays with my partner, like I had done the past 3 years before. We aren't together anymore and it's been a tough few months since we ended it. Working hard to stay positive and keep my head up. We are all beautiful, amazing women and we deserve the best that life has to offer. Thank you for sharing your beauty and your support for all of us! Merry Xmas from one fabulous lady to another! ❤️🎄😊", "nnathan78": "Thank you for all you do.. I've been a secret admire of your work. Being body confident hasn't been easy but having you and other vloger and your confidence has help me. Your style and grace is very becoming and I admire that. Thank you for all that you do not only for me, but all your fans. From my family to yours Merry Christmas. :)", "rachellet93": "I wish world and body peace to all, happy holidays! ❤️", "thatcharmgirl_": "To be honest... I really love your hair actually getting this style done after I saw it on you! Also I lobe your style you give me great ideas as a plus size woman 😊", "alix_krahn": "I love every time I see you on my Insta feed!", "lissalaine": "Even though it seems impossible, I've recently discovered that my dreams might be attainable. I'm learning to be quietly confident in myself and my abilities and I can't wait to work like mad until I achieve everything I've only dreamed about!", "kikidevine": "Before the multitude of plus size bloggers and the explosion of instagram you were the first plus size woman that made me think, plus is beautiful, plus is sexy and here is were you can shop to achieve your goals. For this I thank you.", "southern_sophisticate": "I love you style. That's all. Thanks for being an inspiration ☺️", "queencaroline85": "I simply want to express thanks for your work! I've been following you since your Young, Fat, Fashionable days. I've seen you grow from your GMA clip through your swimsuit launch and more. Although I'm not a terribly active commenter I've loved seeing you grow and haven't expressed that thanks. You were part of a small group of bloggers I began following when I needed to rebuild my self esteem. Your fashion is amazing and your words, to this day (hello post about the VBO), continue to help me remain confident. I love your style and love seeing how much you've progressed, how much you've succeeded. Thank you for your role in the body positivity and fashion movements. Thank you for what you do! This holiday season has been more reflective for me as I've grown in many ways and although tiny for some, having people in the media that represent me on a certain level is empowering. Happy holidays!", "annafanjoy": "I've been following since the YFF days. Congrats on all your success!", "wolfandfinch": "You may just be my favourite body positive model and it's not just because you're giving away $1000. You're giving away a better way of life. You're awesome!", "jacqxzdiva": "I saw this post on my way home from my second day at the gym after deciding to finally let go. And when I mean let go, I mean let go of not wanting to live my life until I was skinny, not being able to enjoy the moment because my mind was in a perpetual state of worry due to all the things I'm not doing and the way I'm not looking. Letting go of counting myself out before I feel counted out by others. Letting go of the nagging voice in my head that makes me treat myself as an \"other\" because of my body and then overcompensate for this by always making my presence felt. Letting go of feeling the constant need to be the life of the group since I didn't look like the stereotypical beauty queen. Now I am actively pursuing positive energies from the universe around me because I am committing myself to happy, to treating myself well and to TRULY loving myself, listening to my mind, body, heart, and soul. To knowing who ME is, without the extra noise. I know that finding amazing women like yourself (whose fashion sense inspires me to pursue my own styling dreams of bring couture to ALL women) is part of the energy that the universe is sending my way and I thank you darling. It would be nice to win the money (I mean heellloooo) but I know what I've gained in my journey, no amount of money on earth can buy. So along with entering this contest hoping to win, I am writing this praying that anyone who reads this can also find it in them to let go. Thanks love! Keep being fabulous!", "judy25saywhat": "Darling I remember when you were 👑 mtv first tv TJ . You came a long way from Detroit and you are such an inspiration for me 🙌🏾😘 from your multiple partnership with major brand , your fabulous capsule collection with Asos girl you rock, you make me want to reach my goal even more 🙌🏾🙌🏾🙌🏾so proud of you wish you all the best for 2016 cause I'll definitively be watching and gurl let me tell you I ❤️ your swimsuit collection with swimsuitforall they fit perfectly 🙌🏾🙌🏾 stay blessed Gabi 👑💯", "imrishine": "Thank you for showing how beautiful plus size women are.", "female_hysteria": "Lady. You have made me feel so much more comfortable with my body as it bounces back from a couple different eating disorders, I wouldn't feel as confident on the street or in the sheets as I do now without your words and your photos. You are so smart, insightful, sexy, and beautiful inside and out, and it has seriously helped me accept myself like I never would have before. 💖💖💖", "torimarie36": "You were one of the first people who helped me realize that style wasn't something that was for people of a certain size. I have been thinking about that a lot lately as I've tried my hardest to love my body for what it is right now. I've spent years feeling like I took up too much space or that I could look good when I was skinnier but I realized I was going about it all wrong. I've never felt more inspired to live my life with the body I have in the moment. ❤️❤️❤️", "xoxodomow": "I just 💕💕💕 you! You have inspired so many women to just go for it. In terms of fashion and in terms of being a true FRESHER THAN YOUUUU boss. Thanks for being so sweet & as a fellow Michigander it feels good to see you following your dreams. Fondest online memory: Will always remember you singing about keeping \"snacks in your hoodie\" from your boyfriends song.", "nikkiwy": "That is amazing! I wish I had half the confidence you do. I've been through a lot in my 34 years and I can only hope to one day love myself and have some confidence. Until then, I'm a work in progress!", "cclarkmetallo": "I love that your posts speak for themselves-- it's an effortless confidence, which allows any size, race, gender, class be inspired by your creativity!", "september_bleu": "I think this is great. Personally I just think it's awesome to have women like you visble to the masses. You all help show how beautiful, dynamic, and amazing all women can be no matter the size. It honestly is surreal to see so many larger women out here killing it. I would've loved to see such images growing up. It makes my heart so full knowing there is a generation of girls who have you and others to look up to. Hell I'm grown and I look up to you as well. Keep up the courageous work you do and know we'll continue to support. God bless you! :)", "miss.d.anna": "Love your style. I'm not at all plus sized myself I'm actually really small framed but I'm always inspired by what you wear and how you wear it. So I'm always looking at your blogs, ig and magazine appearances for fashion ideas. Anyhow this giveaway you're doing is super nice of you. I would use this extra cash for plane tickets for my two little girls and I to go visit my niece and nephew in temporary care for the holidays.", "patsycolleen": "I'm in love with all of the people commenting on this. Everyone has such inspirational stories and even the people who are facing hardships are staying positive. You inspired all this!", "carotworld": "Find a woman like you with your confidence and strong make me feel better with me. You always looks beautiful, happy and shining. Thanks for your smile from Spain.", "alashab": "Your posts make me happy and/or smile (always). Thanks.", "naturallyxdom": "2015 was honestly a very trying year for me. Hopefully in 2016, I will be able to find the joy and laughter in the moment rather than dwelling on the past or the future. Keep doing what you're doing Gabi!", "katniss_vond": "I don't recall how I found your page but I definitely am glad!! You are beautiful and radiant and I absolutely admire your confidence. 😍 I've always had a problem with my physical appearance and have never been comfortable and seeing how you are 100% confident is truly inspiring! Keep it up!! 💙💜💛💚", "keke.loves.orange.soda": "2016 will be great.", "_gloang": "For a good majority of my life I battled with low self esteem. It was hard not being able to find clothes that fit..losing weight and gaining weight and losing weight again. I realized that it was a journey that I had to go through to become the woman I am today! Thank you for being a great example of beauty, confidence and style. It means a lot to a lot of women!", "daintyyscreations": "I am grateful to have stumbled on your IG a couple of months ago. You had given me confidence when I had gained weight. You changed my life and that I should embrace every inch of my body thank you!!!!!", "gorg_jess_1": "I just adore you Gabi...", "xocurlykate": "I found your page from all the buzz from your swim suits for all collection. I will be getting a suit from your next collection. I think I will finally try a two piece. Say whaaat? 😊", "tiffany_and_comua": "I have read many plus size blogs but yours has been one to stand out over the years from different things I've gone through such as break ups, my father's death, toxic friendships and other things that could effect one's mood. However, you've inspired me to keep confident no matter what I'm going through and that inner beauty never fades. Thanks! @gabifresh", "courageousrach": "Hanging on to hope hasn't been easy lately, but everyday small things inspire me to let me know that hope still exist and love can prevail. Hope starts with me and what I choose to convey... I choose to be respectful to everyone I meet, smile at strangers, crack jokes with my friends, pick up my nieces and nephews to have a Netflix sleepover, be passionate at my job, answer my phone when I don't want to be bothered, hold my tongue when I'm angry and pray for patience... Happiness is a struggle and hope is elusive... But I choose hope over despair.", "mhzattitude": "I found your page while looking at fashion forward plus and ever since I have been hooked. Your style is amazing and your beautiful. When u launched your swimwear I was so proud of you and they all looked great. Following you helps boost my confidence even though I have a bigger frame but I get inspired from the pieces that you wear. I follow your snaps and Instagram to keep up with you. Keep doing what your doing cause am pretty sure am not the only female that you inspire and boost our confidence. Happy holidays!", "kimberlyainn": "What an amazing thing to do for someone!", "iamalexiafoster": "Loved your most recent interview with simonedigital.com!", "shaniquamarie": "You never know what curve balls life will throw at you and I'm learning that each and everyday! I walked in work last Wednesday and was told my position is being terminated as of Jan15th. I'm still kind of in shock,and don't really know what's next for me. I'm not what to do or where to start but I've been praying and hoping GOD will show me what I need to be doing! For anyone who may be going through a though time like me, remember that this too shall pass and that with GOD all things are possible! Most importantly DON'T GIVE UP, because you are worth it and have a bright future ahead of you! So here is to new beginning no matter how scary they may be! #itsgoingtobeokay", "katefisher22": "I think what you are doing is really positive 🙌🏻", "ricki.elaine": "I don't remember how I came across your page, but I instantly fell in love with how confident and you were and how much self love and worth you have for yourself even when people are so cruel. This is a very kind thing to do. Stay beautiful", "echohawkd3": "Know your truth, that's been my mantra. My truth is I am beautiful no matter what size or weight I am. I refuse to let others define me. I love that your blog speaks to me in that way, the truth that says just because I'm plus size doesn't mean I can't wear a bikini or I don't have to belt a shift dress so my \"curves\" show. That fashion is accessible to everyone, thank you for speaking truth!! @gabifresh", "beautycorrupted": "It would be really amazing to win this. I've dealt with a lot this pass year for only being 20yrs old. Honestly people like you inspire me to keep pushing through. It could be extremely hard when u have no type of support and living pay check to paycheck but that will never stop me. Even this simple act of kindness from you , shows me that you're definitely more than your image and we all appreciate that. Thanks for being you! 😊", "jazzlondon91": "@londonloveslondon", "_sherrrnn": "It would be just AMAZING to have that money to put towards my college funds. I'm slowly trying to build it up, so this would be a really great place to start. Im a junior this year but what better way to start off my freshman year in college with one less problem to worry about! Love from Frederick, MD 😙", "l1zg": "If you were a president, you'd be Baberham Lincoln.", "vikz__": "You're one of the best dressed woman I've ever seen! You work everything you wear with such a positive confidence and it inspired me to do the same! 😍", "abracadabra631": "Who ever wins I hope they pay it forward..", "torrilynn1": "In a world of waist trainers, body wraps, 'miracle' teas, and such, I applaud your transparency and your love for your body. You give ppl like myself the goal to post full body pictures, not just of my pretty face! #minuswell #2016goal #idpayabillwiththemoney #andbuyanoutfitortwo", "itsbrittanybeech": "I have been following you for a few years now and think you are so witty and love you sense of style. I bought my swimsuit from Swimsuita for all when your collection dropped and got so many compliments lol I just enjoy your posts and confidence the way you've helped girls like me by just being you needed to be posted :-)", "emilyannmanning": "I just hope that next year is a better year than this one because I don't know if I can deal with more loss.", "clothesmindedbyjo": "Just a bible scripture that's been on my mind for a few days now.....Because of the tender mercy of our God, With which the Sunrise from on high will visit us, TO SHINE UPON THOSE WHO SIT IN DARKNESS AND THE SHADOW OF DEATH, To guide our feet into the way of peace.\" Luke 1:78-79", "beyoutifulnatural": "I love ur style. U remind me that I need to be comfortable with my body. That's the route towards real beauty:)", "ayeitsluhray": "I always check your page & just scroll in awe of everything you have built for yourself. it's really inspiring to see a girl who \"looks like me\" out here making boss moves & slaying while u do it! you're just dope! happy holidays 😘", "afrolibre": "I would love to say I would use the money to help someone else but the reality this year is I would help myself that may sound selfish but a year ago I fell in love with an amazing man and we have had a tumultuous relationship ups, downs, lefts, rights but he recently fell on hard times and unfortunately I learned that some people are actually living in the streets and it's real I must say I am behind on every possible bill you can be behind on but I would actually make this Christmas a merry one by bringing us together for Christmas he had to move out of state and truthfully just being able to afford a trip to see him, to hug him to look in his eyes and say \"Baby we may still be struggling but together.....\"", "missnatalieclements": "I am grateful for my lovely family who always accept me. I just lost my grandpa and I'm very thankful for the time we've all spent together. This holiday season will be raw but beautiful. I'm feeling very grateful.", "miriampoulsen": "Thank you for being an amazing role model in a society that is immensely lacking in that area and forever teaching girls they are not good enough. You have helped me come so far.", "_nebraskajones_": "Hey Gabby! I'm Paris K. 😊.....I've known about you for a long time and you've grown as a blogger and in other ways too I'm sure. What I always notice when I scroll through your page or see a random pic of you somewhere is the confidence you exude no matter what you're wearing. So many of us struggle with that these days, big or small, and I personally am trying to change that about myself. Seeing you rock your outfits gives me inspiration and makes me realize I don't have to wait until I lose weight to wear cute clothes and look good in them. I can look good at every stage! That thought has always been on my mind but I've never verbalized it lol....it feels good to write it out. Besides the money, I'm glad I scrolled by your post and that you made this a place to speak our minds and not have to tag or repost anything. Thank you for that 💚!", "__bloblo__": "I love the way you fashion those lovely curves! Thank you for the inspiration!", "lavidaluci": "I first saw you in Seventeen Magazine years ago and I've admired you ever since. Thank you for being who you are and for showing the world that bigger women can be cute, confident, and fashionable.", "michelerauschenberg": "Thank you for being you! I have been following your posts for the past year. You really have inspired me to be confident in the skin I'm in. ❤", "reesecolbert": "Love your style!", "loyalty_is_vintage": "Just a black woman out here trying to find herself outside of this depression I'm in. It's people like you and other women of color that give me the strength and motivation to keep pushing through. I know there is more out there for me, and I will find it! Thank you for being what black women need in a world filled with so much negative imagery of us. I applaud you and what you unapologetic stand for. 👏🏾👏🏾👏🏾", "denisemmercedes\nVerified": "Verified", "stephephanie": "What a wonderful and generous thing to do, in addition to all you give to us already. As everyone above says, you're inspiring and help all of us who struggle with body confidence!", "ges84": "Gabi, you truly inspire and challenge me to be my best. When I saw the photos of your gabi swimsuit I saw myself and thought wow she's gorgeous. She has curves I have curves 😊 I don't have to feel ashamed of my body. I embrace it and love seeing your snaps and when you pop up in my newsfeed. #gogirl", "rozanala": "I discovered your blog about 3 or 4 years ago and I've been following you ever since.I find you and your work very inspiring and I think that promoting body positivity and actually loving yourself is admirable!You go girl!👍Cheers from Athens,Greece!😊💯✔", "tangible_trydas": "I've spent 30+ years hating my body. Then I found your IG and everything that comes with it. It's been inspirational. I spent 82 days in the hospital this summer, came out with scars from a traech and dialysis tubing and then my hair fell out because of all the meds...but the strong image you put forth has helped me step out in style, regardless of the size, the scar, the hair, etc. Thanks for being here :)", "kaylalaynaheluk": "I love your way of allowing all women to realize that there is some sort of confidence available to them. You're truly an inspiration. You allow us to see that there ARE possibilities and endless ways to be confident!", "idoubliss": "This is so kind ♡", "justifying_netta": "Hi Gabi, my name is Janetta. This year I was diagnosed with lupus. These last 6 months have been the hardest for me b/c the meds I was on made my entire body swell almost until I was unrecognizable. My body has slowly returned almost to normal now since the meds have been changed. Your ig and blog posts, and your snap stories have brighten many of my days. Also being plus sized myself you have inspired me to be comfortable in the skin that I'm in.", "anaguilhermep": "Hi! Love you so much! Thank you for being part of a so positive body image and encouraging so many people everyday and for being you!", "mamachicajj": "Hi Gabi! I love you, your style and confidence. I see you and other plus sized women and think I DO look good and if they can rock it so can I! Thank you for being that beacon I needed. Merry Christmas!", "therosietree": "I have been following you since the YFF days. Its amazing to see how far you have come in your professional career. But, not just professionally, you are visibly more confident and your style has matured and changed in a good way. Wishing you all the best as you continue on life's journey!", "liz__solis": "I love that you express yourself through your clothes👗 and don't care what negative people have to say about it🙅🏻, I admire your confidence and that you encourage us everyday.😊 I love your account so much! ❤️", "jazminbautista": "Always giving me so much life! Thank you. Because of you, I no longer just wear oversized hoodies/jeans. No more hiding here. Also I bet LA>Chicago, am I right?", "lyndaabraham48": "You have taught me to be myself. Love myself and appreciate your God given awesomeness and never let any negativity stand in your way. Be Blessed!!", "petaldawn": "Fantastic idea!", "aecetcetera": "It's always a good day when you cross my dashboard - I'm Alex, nice to meet you. I love how you are able to pull together cute outfits so easily! I'm not very good at finding clothes I can afford bad out together nicely, but I love seeing the possibility that now I can with clothes that actually fit me! Thank you!", "5_6inheels": "The first time I saw you was on BET Rip The Runway. I never new there was a such thing as a plus size fashion blogger. I honestly thought I was one of the few plus size women in this world that loved fashion, & was highly disappointed in what they offered us in stores. When i saw uou i went straight to you blog and have been hooked ever since. You opened me up to a new to new plus size stores and a love for myself. You have also inspired me to start my own fashion blog. For this I thank you. I'm not sure if you will see this or not but please know that you have touch so many lives & have inspired many young girls with curves to love themselves. Please keep doing what you do.", "keshadejuan": "What a beautiful soul! No need to consider me for the prize, I just wanted to tell you that it's amazing what you do for women like myself who have always lacked confidence due to having a physique that is not recognized in the magazines or on the runway. Thank you for shining a light on us and proving that you don't have to be a size 2 to be beautiful! 👏🏽 well done! 💋", "its_jas_c": "Not only do you inspire us through your confidence and style, but you are a beautiful person inside and out! Keep inspiring and God bless @gabifresh! :)", "tinyboom": "I remember when I first found your blog while searching for plus size fashionistas. I loved you instantly. Thank you for inspiring women!", "jordieedelin": "\"We ask ourselves, who am I to be brilliant, gorgeous, talented, and fabulous? Actually who ate you not to be? ...And as we let our own light shine, we unconsciously give other people permission to do the same. \" By being yourself and doing you, Gabi Gregg, you have inspired me and everyone who follows you to be the best people we can be, in spite of everything and everyone that says we can't, or we shouldn't because we don't fit the mold. #BreaktheMold Thank you.", "lailasulemana": "It doesn't matter where you are coming from. All that matters is where you are going.", "eye_improv": "You're an inspiration. 💜", "bethany_herman": "After thinking 2015 was going to be the worse year (losing a beloved grandparent and going through divorce), life had a way of showing me that when opportunity presents itself to create positive change and to experience a great love, you have to embrace it, conventions be damned. 2015 will be the year that brought the worst to my life only to make room for the best in my life.", "tiggersux": "Thank you for helping me know it is okay to love ALL my curves. 😙", "iambrigethiaarai": "Hey Gabi! My name is Brigethia and I am a up and coming fashion blogger. When I seen your blog it inspired me so much . Not only to blog myself but to feel beautiful with the skin I'm in. You embrace your curves and I love that about you . With my blog I was to make all shapes and sizes feel beautiful and sexy in their skin. I am in my last semester of college and my plan is to grow my blog and be successful! Thank you for the motivation and encouragement. 😊", "silkohapsi": "♡", "heartshapedglasses": "What's in my heart is possibility. There's always possibility.", "meboemio": "I'm grateful for how awesome my friends are...and for cheese.", "shethoro": "PEACE AND LOVE", "world_of_voguecraft": "So, in the spirit of the New Year and the proliferation of New Year's resolutions I decided to do something mildly radical. I decided to NOT make a list *gasp*. Instead I will take a different approach. I will write down lines from my favorite authors and quotes from my favorite books and put them in a sock (we have to keep things festive my dears). Come new year's eve I will curl up with a bottle of wine and randomly choose a quote from the sock. That quote will be how I will live the next year. Time for this little mouse to take some risks ;)", "angelkdillion": "I just think this is the sweetest thing. There's so much dark in the world right now, and this is such a ray of light. Bless you and yours.", "olekamagnifique": "@gabifresh you and your style tho...... Dead the scene every time I see it. I mean, #cautiontapeeverywhere 🚧⚠!!! I absolutely love seeing plus size models with such great taste showing and teaching what they know and what they learn. Thanks for being my big girl inspiration! 😍", "hsquared19": "I love your blog and your Instagram. It's so great to see such a positive role model for women and great fashion for plus sized women!", "kimpreston1281": "Hope you have a wonderful Christmas and New year with your family !!!", "i.am.candice": "Wow! That's the most genuine reason I've ever heard of for a giveaway, and so selfless. Thank you! I would like to say that your blog has been vital to my gaining confidence in myself, and gives me encouragement to share my interests and experiences! I am a mother of 2 kids, and homeless. I haven't had a home for 2 years. At times I don't know what will happen in the future, but your inspirational life helps gives me hope. I love seeing life through your eyes, your beautiful wardrobe, and your travels. As long as I'm alive I'm going to keep trying to make a better life for my now struggling family. I have hope that this is just temporary. As we go along in this adventure called life I will keep looking at examples to keep me motivated, and I thank you so much for being just that! ❤😉", "atlantafembot": "You are an inspiration to us all!! 💕💕💕", "andra.melinte": "You are a woman I look up to, not just style wise but also as a person. Every since I found you, I look at you in awe and be like: #goals Thank you for being an amazing person and endless source of inspiration to people all around the world. We sure could use more role models like you in my country. I wish you the best of luck, happiness and love! Happy holidays! Andra", "seshiseshiseshi": "you bring joy into my instagram feed, thank you for that", "qimzel": "Such an amazing initiative! There should be a whole lot more kindness in general.. I have some health issues (chronic illnesses) and have watched people turn away from me ever since I've had my diagnoses.. I know I'm maybe not the most fun to hang out with since I can't do much physically, but still.. People seem to forget really fast that it is not my choice to be in this situation! Oh well, I still have my lovely furball who means the world to me, unconditional love! 😻", "___mknz": "Yes, yes please 😍", "lucylum73": "Wow. This is awesome!", "considerately": "You're gorgeous and an inspiration. ❤️", "savannah_hutton": "I found your page via the bodyposi community over the summer and stayed for the style blogging and how you rock a mauve lip! 🤘🏻✨", "tvandygriff": "You embody confidence, confidence breeds open mindedness & dialogue, dialogue leads to love, growth, spurring through painful topics and ideologies and ultimately making the world a better place. I've seen you do this over the years and you have inspired me. MERRY, MERRY CHRISTMAS! 😘🎁🎄🍾", "m_a_r_l_e_n_i_s": "You are the best ur style the way u carry yourself I love you so much 😘 hope you have a merry Christmas 😘🎄🎄🎄🎄", "nikslam01": "This would go a long way in helping me to get to my grand daughters in Colorado. My heart is breaking that I'm not with them.", "awna_bonana": "You were one of the plus size bloggers that changed the way I look at myself, and also the way I feel about myself. Whenever I see you post pictures with other plus size fashion bloggers, or see you hanging out with them on snapchat it makes me so happy. So excited to know that you guys all get together and encourage each other to live a body posi life. You're so beautiful, inside and out. Thanks you for being a great role model. 💓", "jcotton0623": "You inspire!", "ecilla98": "You are so beautiful, inside & out!", "lcancarr": "Hi! Last three years have been so hard for me, and right now I think my life is just beggining again. I have some big plans for 2016, the biggest one is to leave my parent's house and move to London, to be close to my best friend, the best guy un the world. If I win this, it will be easier to start in UK, but if I don't win, I'll do it anyway, at all costs. So c'mon girls, think big! Live your life and enjoy the good things! Happy hollidays!", "ul.tima.te": "My daughter is having difficulty being in her own \"skin\" and unfortunately she does not have the coping mechanisms that I had at her age. My jay bird is 16 and so consumed with the wrong perceptions of beauty that she has yet to realize that her beauty is within. Her smile and almond eyes can lighten any room and her tall stature will force you to take notice. I often tell her that her full, plus size, shapely, figure does not define you and you should not allow others to validate you or how you look. Yet, unfortunately this generation and their social media outlets is a battle that I am slowly loosing. Still, I will never ever give up on her bc she is my rock...who I constantly advocate for...who I push to exceed her own expectations. Mommy loves you! Forever and for always.", "blancamorrison": "Thats very beautiful, thank you very much <3 es un gesto muy generoso de tu parte, espero que la persona ganadora sepa aprovechar al máximo ese gran regalo. Un beso", "melodymoruarte": "With your help I have been able to find the joy in fashion and the confidence in my body needed to have fun with what I put on it. Thank you!", "lovingadeola": "I think you are amazing at what you do. Stay strong and keep inspiring more women(all sizes included) 🙌🏽👸🏽", "sunny.jpg": "you are an absolutely beautiful person. i aspire to become as confident and radiant as you, and it gives me hope that it's possible when i see your pictures and how sucessful you are. ♡", "shapesofcolors": "With your positive body image and can do spirit I look forward to your posts and read your blog with a happy heart. I have found clothes that I love wearing and that I look good in. I'm no longer hiding myself in whatever I can find but wearing fashionable flattering clothing. Thank you 👏🏽", "tanjerine_dream": "Gabi! You truly are the OG plus size blogger! I've been following you since you started Young, Fat and Fabulous and when you won that gig at MTV... As a plus size WOC with dreams and aspirations of feeling fabulous and beautiful in my own skin you exemplified what it meant to be a role model. I have followed your progress for so long because you truly believe that style has no size and I admire how far you have come with your success passing on such an inspirational message. Being a dark skin, fat girl with a mental illness I constantly have to deal with negative images, stereotypes and perceptions of people who look like myself in media. In order to find comfort in body positivity and self love I've come to look for representation from beauty/fashion bloggers who exist outside the realm of expected beauty standards and forge their own way by creating social change. Plus size beauty blogger and fashion models are so awesome because of the community that they support and among them you are an icon, girl. If it wasn't for you, I wouldn't have so much confidence on the beach NOT GIVING AF what people think of me in my bikini... big belly, back rolls, cellulite, stretch marks, thunder thighs and all! 💜💜💜✨💫 Love you and will continue to follow you and your style for years to come! 💜💜💜✨💫", "honiibzzz": "\"Be brave enough to live life creatively. The creative is the place where no one else has been. You have to leave the city of your comfort and go into the wilderness of your intuition. You can't get there by bus, only by hard work and risk and by not quite knowing what you're doing. What you will discover will be wonderful. What you'll discover will be yourself.\" -Alan Alda", "rabbigarcia": "@gabifresh you help me feel beautiful about my body and your style is infectious. Your posts remind me to embrace who I am and be body positive. It is inspiring that you are doing this kind of a give away... I'm not going to go on about why I need the money but it would help me pay medical bills. Truly inspiring thank you for what you do ❤", "atruebeauty": "GabiFresh! What can I say about you doll? I have been following you for a while now. Not sure when I started, but it has been a while! I just love your style and how you simply opened a gateway for plus size beauties. I truly admire the way you pair your outfits, and also allow followers to see what other companies are out there. Thank you for your “I don't care\" attitude when it comes to fashion. It gives us to view the unconventional pieces paired off by your uniqueness. It just all flows hunny! Continue to be (always) you, and continue to represent for ladies with style and what? Grace! Muah! With all saying this, I could be honor to receive your giveaway. In so many ways it would aid me. There are certain things I would like to accomplish in this upcoming year. And I would also be a blessing to others I know as well. Thank you doll!", "jeny.md": "Gabi.... thanks for making me more comfortable in my Skin", "lauvly": "You're amazing! There are no other words for it. You're an inspiration to women everywhere. You keep doing you! xoxo", "izzydora16": "I learned a hard lesson this year...to listen to my heart no matter what others expect (good or bad) or the circumstance. I am thankful for my experience and for finding my voice in the midst of it. Thank you for allowing women to view themselves from a different lens. Blessings to you!", "mspatticakes": "Your style is so inspirational ❤️", "foxxi_cleo": "I've always followed you for your impeccable sense of fashion and your body positive attitude. But you really made me love you when you touched on the topic of cultural appropriation and light skin privilege. These two topics are scarcely discussed by people who have the platform to do so. Thank you having such a beautiful heart.", "minty_morning": "For some reason I always heard that the magic of Christmas dies away as you age, but for me it's the total opposite. Now Christmas isn't just about me receiving presents, it's about giving back to the ones I love. However on a part-time minimum wage job it's hard to get what I truly want to give for everyone. This would be a blessing to shower those I love with gifts they truly deserve.", "honeyluvatl": "Positivity is my constant mantra of life so coming across your IG was truly a blessing. Social Media wears me thin at times but to come across something positive can really shift my mood. Thank you for being the awesome person you are.", "mrs.dunnigan": "What an awesome idea!! You are awesome!", "adifarage": "💗💗💗💗💗", "joitootheworld": "Ive been a follower of yours for about 2 yrs....I love your fadhion sense, and enjoy watching your growth as a blogger...keep up the good work", "thedreamyteamy": "Very cool of you! 😍😘😍", "_brittany_bradley": "I love following you and your posts. When I'm feeling down on myself, they help remind me that I'm just as beautiful as anyone else. I'm a good person who cares about others and takes care of my family and friends. Fat will never be the worst thing I can be. Maybe it will be the best thing I can be, because it's shown me to love everyone, regardless of outward appearance. I love getting inspired by your outfits and to go out there and just do me. I will not put limitations on myself whether it's in fashion, health, or just living life. The world we live in is sometimes a very sad place, but it's important to remember all the good and focus on that. There is always good, just have a heart that finds it. ❤ Merry Christmas and Happy Holidays to all!", "bricortez94": "This is great. Thank you! 😙😘😚", "emilymarinaro": "Thanks for everything you do for women. Xoxo", "missmolly_2013": "That's really nice you give back to your followers.", "emmalie06": "Gabi, you're my moho hero! 💗 Proud that our alums are working hard to fight body issues on such a public platform. You go girl!", "bbybrit": "Its people like you who honestly make the world not such a scary place. It makes my faith with God much stronger. To give something to others out o the goodness of your heart is truly the most amazing thing you can do. My parents always raised me to help those less fortunate and give when you can and love all. I try to follow that everyday of my life. Even though my times are hard-my dad has a lot of health problems with his heart and liver and kidneys so he can't work and my mom got hit by a car so neither can she for the moment-theyre still trying to help others. I think you are an amazing person. I'd also like a chance to thank you for giving me confidence BTW. I am too a bigger girl and seeing how you rock your clothes without a care I have been able to be more daring as well. I wish you and your family all the best. God bless!", "chelleari": "Bless your heart. Thank you for being an inspiration to so many of us who have been told that we don't \"fit\" in... Pun intended! 😂😍🙌🏻👌🏻😘", "redwine789": "Gabi, you are a total inspiration to me, style/beauty/life goals for sure. I think it's awesome that you're building your own life, business, etc and it's awesome that in doing so you share your awesomeness with us 😍 It's been amazing following your journey. Hoping I can be as brave as you someday! So far I just try to channel your attitude and style whenever I go shopping 😉", "elizabethfellis": "With everything we as women go through on the daily you help this single mom love her curves, be strong and stay positive. Thank you.", "morgan.dallas.james": "Waking up every day and remembering that all shapes and sizes are beautiful! Having the strength to love myself and be loved in return. I love seeing positive posts reminding me we are the perfect flaw. I hope you choose a worthy person. Merry Christmas xx", "em_kay_pee": "It's so inspiring to have such a body positive role model! I work in a heavily male dominated field and always felt self conscious at work with my curves, and you've helped me improve my style and feel more confident with the skin I'm in. I'm about to move to a new place, leave my relationship behind and start over, and any additional source of inspiration is always welcomed with open arms! Thanks for being you xx", "jessicahinklestyle": "Been a reader since YFF, one of the first introductions to body positivity I had. Being able to share that message and educate other people around me on self-love has been so powerful. Not everyone has jumped on board. But what I'm really thankful for is the people around me that have joined me in my journey to self-love. My guy, my closest friends. We've learned to be better to ourselves and to others and it's opened up my heart and helped me to personally grow.", "kung_pao_kitty": "Inspiration, happiness, joy, grateful and pure unconditional love", "mara_iara": "I hope the next year has the promise I'm choosing to believe it has. \"I've never thought of myself as my own human being\" is a nutty thing to say, but it's true: all exoskeleton, no endo. I'd forgotten how good it feels to like the way you are: the way you think, the things you like. My whole life has been a worry over goodness, and whether I can keep it up if I achieve it. I'd love to say some evolved ah-ha moment happened. Really, I just got sad and tired. Let me do what I want. I'll build my backbone from there.", "tnleak": "Roses are red/ violets are blue/he used to call me on my cell phone/but he messed up/ now I don't answer. Lol *snaps fingers*", "colleenmrrow": "Women like you and many others have empowered me to believe that we all are truly beautiful. Thank you for that.", "thesedriftingthoughts": "What a wonderful thing for your followers! You are the best!", "wendyomgwar": "I don't know what to say 😊 just thank you for being you.", "kellmemore": "I almost cried reading this. Thank you so much for being so generous, Gabi. I would love to be able to visit my friends and family as I've been volunteering abroad for 5 months now. But I will honestly be happy for anyone who wins, that will be such an amazing gift.", "kristeenamonteith": "Thank you for existing as you do, in your skin and body. You were the first body positive fashionista I happened across 2 years ago when I was 19 and you made me believe it was possible to be happy and beautiful. So thanks for being you.", "fannylaliberte": "Thats so cool of you! Thanks for all the positive post and all the colorfull pictures 😀", "marixxxo": "@gabifresh love you Gabi and seeing your journey and success. Been a reader since you were living in chicago❤️", "nicoleraychelle": "@gabifresh You're one of the very few reasons I check Instagram daily!", "boatwright6": "Gabi, I love that you give back to your IG followers!😊", "rosexcolored_glasses": "I struggle with when will I have enough. Enough to make sure my little on is taken care of,bills are paid, food is on the table. When will I ever have enough. But on the other hand God has blessed me beyond measure. There are millions of ppl in this world who wish they had a bed to sleep on, running water, electricity, a job to go to. So why should I complain... So when I think when will I ever have enough. I have to remind myself I already have more than enough and be thankful for those things that put life, existence into perspective. Thank you.", "sashaledawn": "Awesome! Thanks for giving back and for being stylishly creative!", "thewayfaringwoman": "That's so brilliant! Thanks for giving back and showing some love!", "_cassiedodds": "Wearing a new shirt gives me a little bit more confidence throughout the day :3", "dlhershon": "This is so kind! I love the holidays! ❤️", "congogrrrl": "This has been a tough holiday season so far but seeing something like this warms my heart.", "anissimapaula": "Thank you, Gabi! This is very generous from you. 😙", "jubilance1922": "@gabifresh I met you at Target HQ last year and it was so wonderful, I tell everyone how sweet and gracious you were when I fangirled all over you! Thank you so much for what you do for plus size women! 😙😙😙", "mer_yannuzzi": "Happy holidays @gabifresh peace to you ⛄️", "a.marie333": "This is a wonderful thing you are doing for your followers. Happy holidays. 😊", "msvava": "Thank your for being true to yourself!!!", "annieduprey": "😀😍😙", "babycakesjk": "What an incredible show of your generosity! It would be an awesome surprise and relief to be lucky enough to win. Happy holidays.", "my_cookie_hobby": "You are a beautiful soul,inside and out. Happy Holidays!!", "missdajamarie": "Love you girl! Truly an inspiration to me thanks for all that you've done!", "melaninteach": "This year, I've gone through a lot. A battle with depression, learning my parents are not who I thought they were, and my dream being deferred by fear. But looking at you, Nadia, Callie, and others I follow chase your dreams kept me alive and my dream in tact. Because of Gabby Sidibe I know that I can make it in entertainment and look they way that I do. I've had to learn to love myself despite others making me feel like shit. Thank you Gabi! P. S. One day I would love to meet you and wear that big curly wig and feel more like a lioness than I already do! ✌🏾️", "niecykohso": "And now these three remain: faith, hope and love. But the greatest of these is love. 1 Corinthians 13:13", "rmol": "In a world with too much negativity and intolerance, finding the love and acceptance that YFF offered was a blessing.", "curvadelica": "Thanks for being different!", "hopee06": "Stay at home mom. I so appreciate the style inspiration!", "iamcarriezara": "You are such an inspiration, thanks for all that you do!", "candiijolie": "Being positive during difficult times a challenge. Completely overwhelmed (work, school, personal life) Hoping this will all work out and my true purpose will be revealed.", "tontilicious": "This is amazing! Keep doing your Thang Gabi!", "thebazile_": "I really live the holufays becausr of the lights. They are shinning and everywhere. And the songs. They make me happy ! 😍", "claiis": "Have been experiencing ups and downs the past four months because my boyfriend and I moved 5600 miles away from each other (Belgium to Cali) which is tough when you know you're meant to be together, but right now I'm on an all time high because I'm flying over next week on Monday!! I'm staying for five weeks, spending the holidays with him and his family... I couldn't be happier :)", "asims8645": "Showing love!", "loveofmylyfe": "Thank you for your fashion inspiration!", "coastal_realty_queen": "Thanks for all you do. Seeing you and other women who are positive about their bodies makes it easier for me to love myself for who I am. Keep doing what your doing, you may be just taking a picture of your cute outfit but for some young woman out there you are inspiring her to love herself. Happy Holidays 🎄🎉🎅", "justanothersarajo": "Thanks for being you :)", "ebrealist": "Body Positvity for me is following/watching you, Essie, Readytostare, Dandy, and ganerstyle has really given me the boost of confidence since 5 yrs ago. All my life until my Junior year of high school I was picked on about my size and glasses. So following yall ladies keeps me from reliving the past and keeping the fire lite for fashion. I don't post a lot of my outfits but the people around me keeps me with a smile on my face because the always say I'm a fashionista and wants me to take them shopping lol. I owe all to you and the other plus size models. Thanks for giving me Body Positvity.", "loviscrazy": "Peace on Earth!", "kourtneyunique": "Gabi you have been a sort of like a Instagram sister to me lol...you've have always gave me advice on outfits, inspire me with quotes, and and always seem to make me feel better about myself when I get discourage on my own style or business lol but anyway Keep doing what you are doing and continue to pave the way that anything you want to do for life is possible!", "kellyball62": "I love your designs! I'm going to look fab on the beach in Cuba in February ;)", "mlfromnj": "You are awesome and I am awesome and really that's all! 👍🏼👄🤘🏼🤓💃🏻🍾👌🏼👏🏼", "molle_3": "Thank you Gabi, this is really sweet. happy Holidays.", "sofiasra": "You inspire 🙃", "bdoll_334": "Love you and your designs. You're truly an inspiration and have helped me not only embrace my self as is, but flaunt it as well. Thank you, happy holidays.", "maxxed_out3": "For a good 13 years since I left my home country for a better life in the UK, I had felt so lonely, so rejected by my own family being treated as a lodger or house maid. Coupled with self hate, and low self esteem I wanted to end it all on so many occasions but the constant thoughts of giving my mother (who is back home) a better life Always stopped me from going over the edge and finally seeking help. My heart was hurting for so long, I never thought anyone would touch me let alone love me. And now I look over to my left side of the bed and I see a hard working man who sees me. Who wants me to be part of his family, he and his family welcomed me and have showed me such love in such a short period of time. Showed me that I am not a bad person and I deserve love too. Miracles happen 🙈😊", "shawne_dejonae": "This is awesome! I started following you for fashion ideas and to steal some of your positive body image vibes. 💚", "kashmadame54": "You inspire me as a person to love myself more! I just remember when I messaged you on Tumblr and you responded! That was awesome to know that you do care about your admirers!! You have inspired me to take up the challenge to find my style and to love myself! Thank You!!! 💙💙💙💙💙💙💙", "problemily": "The most incredible things happen when we learn to love ourselves as we are, making no apologies for the shoes we haven't grown into quite yet. You taught me that. ❤️", "velocellaraptor": "\"How did you know you were meant to be a healer?\" -Because I kept falling in love with broken people. \"Then why are you alone?\" -Because I am broken too/So I am falling in love with myself/To get a taste of my own medicine. (Kwavena Foli) Here's to daring to fall in love with ourselves!", "mamapanda915": "I am so grateful for my little family this holiday season. I've been really emotional lately and it just confirms how much I love my family and I don't take the time often enough to reflect on this and give thanks to God for them. I am so blessed. Thanks you for giving us a space to just say what is in our hearts. Love ya girl!", "jmoandcurls": "you show me how beautiful I can be.", "_classycurves_": "You changed my life! Thank you❤️", "melody__fitz": "I'm sure you hear this a lot but YFF changed my life and started me on the road to accepting myself and my body. Thank you.", "happily_ever_zanni": "I love seeing your beautiful pictures!!your a role model for woman like me who are not a size O. I have always been scared and ashamed of my body. I wish when I was a little girl that I had a better role model that would of helped me with that. Thank you for helping this adult woman feel better about herself. God bless and merry Christmas", "oliviaweightman": "People like you make me proud. Although the only connection we have is that I follow your work, I am still proud to have that connection. With every bad thing that happens in every day life from something as small as someone dinging your car to the monstrous acts of war people can easily forget to be good and to be inspired. This simple act of kindness that you are doing will send waves, I hope that it will remind all of your follows like it has reminded me to be kind, good and allow themselves to be inspired. Thank you for being an inspiration and shoeing me with every post that beauty is in everything.", "fabrice.joelle": "You are amazing! So generous! 😍 I would use the money to fulfill my dream and go to berlin to live there for a while and just start over after my life has been an up&down the past few years ☺️", "thewiscowallflower": "You are simply the coolest and the best", "jkay_p": "You've been so helpful for me, especially when it comes to finding new brands to explore and shop from. I love seeing how you've grown, and it gives me hope that I'll get it together soon too ☺️", "crodriguez224": "I am inspired by you and any young person doing something unique, that promotes positive body image. Thanks for doing that for my daughters, because I'm 42 and back when I was younger everything was about trying to look like a supermodel. Well, my latin curves didnt fit the mold and I suffer for it. It's great that my girls can see strong women in the media that they can relate to.", "mpenger": "💗", "madbulb": "this is such a generous way to give back ❤ you have a good heart", "thoroughbred718": "Creating your own path isn't easy, but we do that shit effortlessly, knowing that each day we're creating a legacy. Happy Holidays G! 💋", "mother.soulwriter": "@gabifresh I'm a young Mom going on baby number 3 come December 24th. As exhausted as I am both physically and emotionally from carrying this little guy, I'm thankful for a healthy baby. Even more I'm thankful for thus experience because with every child I have learned to love my body even more. My four year old daughter calls my stretch marks Zebra powers, and I've learned the power of self love through watching her. So this holiday, I'm thankful for this imperfectly perfect body that has managed to carry life into this world stretch marks, thigh dimples, and all. Merry Christmas Gabi.", "nikkinetteanna": "I actually discovered you one day a few years or so ago via a post on plus size fashion. I was reading through the post and you stood out to me. The main reason was the confidence you exuded. I started following you on Twitter and discovered that not only did you take gorgeous photos but you are not afraid to engage with those who believe in one beauty ideal. Also, you're pretty hysterical as well. You've shown the world that every woman, no matter her size, is worthy and valid. This is an amazing way to pay it forward. Hopefully this inspires others to spread love and positivity.", "chilelai": "A thousand dollars would make a great difference in my life right now. Thank u for doing this", "njlawson1": "Wow Gabi! What a way to thank your followers and give back during the holidays. I don't follow many people on IG but your blog has been inspirational to me and all curvy women. Keep being you. We love it!", "mynameisjessamyn\nVerified": "Verified", "toukotakku": "You are badass lady. 🎀 Thank you for being you and thank you for this huge giveaway. 👑 You have a good heart. It's been pleasure to follow you. I have some big issues with my sleeping quality and that's a burden to my self-confidence too. But when I remember bodypositivity and the fact that I am enough I can handle this. Happy Holidays & Greetings from Finland! 🎇 #inspirational #thankyou ❤", "misstiquechantay": "I am grateful for my generation's audacious pioneers.", "simoneoliveraraujo": "I am sincerely grateful for so many plus size bloggers nowadays talking about body positivity! I wish I had someone like me when I was 15 saying it was ok to love me and do everything I wanted the way I was! I did find the strengh to tell that myself but it's nice to know I am not alone anymore! Thank you! 💚💛💜", "painted_duchess": "You are such a generous and beautiful soul, Gabi. You could really change somebody's holidays with that kind of money. I love how (most) people find a way to be loving and generous at this time of year. Drowns out the negativity! xxx", "sweeteepie25": "I really appreciate all that you do, certainly inspire me to be yourself without limits", "kat_withabat": "Gabi, I'm so happy about your success! It's amazing and hopefully a lot of girls and women out there see that they don't have to be a size zero to be beautiful and successfull. You're an inspiration to women all over the world and I hope you continue to be! Wishing you all the best from Germany, Kat", "jetheubet": "All I'm going to say is, your swimsuits are the only reason I was able to go swimming for the first time since I was a child. I was never one for exercise, and I honestly don't know where I'd be if that small change in my life last year hadn't happened. You promote self acceptance as well as inspiring me to do better. I probably owe a lot of positive changes in myself to your blog, which is a scary thought! I hope a lot of people feel the same way, and you always have confidence in what you do x", "laerkebob": "You're such an inspiration and you have helped me in finding my confidence as a curvy woman😍", "jei_nesaiquoi": "I love how the holiday season inspires us to consider others more. It proves that we can choose to love each other and not spread hate. The main thing I hope to resolve in the new year is to learn to love more, understand more, and hate less.", "joanatabata": "I got to know you through that flawless video and I gotta admit, that piece you did has helped me in several ways. I now, most of the time, see myself as the goddess I am and don't accept less than I what deserve. Self-loving can be a daily exercise but it gets easier when you have some great role models.", "tamarageeee": "Gabi! Thank you so much for your inspiration and showing the world that #plussizematters 😊 I've never been a slender person and I've never really learned to accept my physical features until I began to lose weight. I thought I looked better with a smaller waist. When I gained the weight back within the last two years, I began to lose confidence again. Then, I started following you on IG and Tumblr and my first reaction was, \"she is freakin gorgeous\" and she's a plus size doll 😍 Now that you've inspired me, I want to inspire young curvy to accept themselves and embrace every because they are beautiful!", "maadmuffins": "@tiggermtd See, now this is sweetness. It's that", "smelgirl": "Wow! what an amazing way to give back. I know whoever wins will be and feel so very blessed. I've read a lot of the comments and you are an amazing person and inspire so many people. Glad to be a follower!", "kecia714": "This is a great way to give foward! I've been following you for a while now and you given me so much inspiration in the body confidence and wardrobe department. Good luck to you and your future endeavors!", "courtneydejean": "This is lovely!", "v_valdovinos": "I find it very inspiring to see where you are now, as a longtime follower I've seen the evolution of your blog and style. 😊", "veronicacuevasm": "I found your YFF blog looking for sources and shops for my size, I experience a Major change the way I dress and my confidence. Please continue with your work and keep inspiring women from all sizes. Thank you!!!", "vanessajkerr": "✊", "lisbirdie": "Love following you and seeing you still so humble and kind even though you're getting so many followers. I could really use the money for my education to get trained as a clinical psychologist. That's really my dream and I hope I'll soon be able to help people with my profession", "tabithachiuri": "Hi, a 1000k us dollars translates to something close to 90,000 Kenyan shillings and that's money if used wisely can go a long way: my last semester tuition fees, Christmas gifts for my mum and bro or a few pieces from your next swim wear collection @gabifresh", "nnkmll": "Hey Gabi, wow, not really sure what to say? Have been following you for a while, and you've been such an inspiration. Your style, sense of humour, and business are all so amazing. I've gained a lot of weight because of a chronic illness, and I used to be really upset. But it's people like you that helped me realise that western/European beauty standards are insane, and that there is a whoooooole range of beautiful that feels like undiscovered territory. Thank you so much for that <3 I wish you all the best in all the years to come. <3 =*", "assiram222": "I'm grateful for learning to love and be loved.", "be_youtifulbritt": "Let's all stop planning for the future and accept what's really waiting for us.", "jessicaeden81": "Wow, you are so generous and inspiring. \"To know even one life has breathed easier because you have lived. This is to have succeeded.” - Ralph Waldo Emerson", "__ms_wolf__": "I don't want the money. I just want to comment to say what an absolutely beautiful thing to do. Can I just be your friend instead?! I've been following for a long time and find you such an inspiration. Thanks for just putting so much positivity out there each and every day x", "dani_moreiras": "hi Gabi. I am one of your recent followers. I do not even remember how I got your page but it was love at first sight. You do an amazing job showing us that plusize woman also deserves and can be beautiful and be at peace with his own body. I have learned a lot from you. Unfortunately here in Brazil and especially in the state where I live we overweight women still can not have the right to consume fashion, there is no standard numbering clothes and large sizes are still those clothes formless and ugly. Often we can only make a giant effort to lose weight and fit into the clothes, which can become a violence to our own body and our essence. thank you for being an inspiration to me and to so many other women. A big kiss and happy holidays.", "martinemiiiaam": "Cherish the small things because the smallest thing can be everlasting and held forever ❤️", "renai99": "I don't know why I keep letting myself get hurt by the same man... Time for me to make a REAL change in my life.", "patcattie": "Your confidence makes me feel confident", "xoxobeemarie": "Hi Gabi! First off, let me say thank you for being such an inspiration to many of us curvy girls out here. I remember when I first came across your blog and was so inspired that there is a curvy girl in this world who has so much style. You've taught me so much about confidence and being true to myself. Since following your blog(from YFF to Gabifresh) I was introduced to many plus size fashion bloggers and I have to thank you for that. It's amazing to see all the things you've accomplished and I know you will be blessed with even more in the future.", "viksknits": "Life can be a struggle, being plus size is who I am.", "ginasaywhat": "Thankful for the blessings and lessons and can't wait be better me everyday", "_misterfilipo": "After so many times of wanting to give up, I finally graduated after 4years, from art school with a bachelor of fine arts. I got my degree 2weeks ago and it's probably the best birthday/Christmas present I could ever have given myself. Self determination and hard work really pay off and I'm sure you know this. I can't wait to begin my next chapter of saving enough money and moving out of my parents home here in New Zealand and taking up a 12month visa in America. The future is lit!! Merry Christmas Gabi! A very generous gesture you are doing at this time of year. Bless you and thank you for instilling confidence within my self 💝", "chef_opy": "You are blessed @gabifresh", "chelseamarie1215": "Thank you for being inspiring and showing me that I can be confident and like how I look at any size. Merry Christmas and happy holidays!", "sicklittlejag": "I've admired you since the days on LiveJournal and it's truly awesome what you accomplished once you set you're mind on a singular goal. May you continue to inspire wardrobe envy.", "clearstyleinc": "Authenticity", "hellokat80": "Inspired by your fierceness and positive attitude.", "ruxyghimp": "Social media is giving me a lot of anxiety. I feel pressure and rush, that i need to be there and do this and that. But all i want is to take it easy, slowly. I can only be myself when i'm doing things slowly. I have time to think about anything and plan my own life. Sometimes i feel pain when i'm looking in the mirror, when she tells me there is not my size in this store, when they can achieve better things faster just because of the looks. I truly believe in the power of positivity, self-love, but this love it the toughest one. When someone tells me they can not forget their lover, or they can not love anymore i feel bad for them. I am stuck in my own love for life. I need to figure out how things work in my mind and my soul, and i don't care about their love about me.. I am my own love.. I need to figure out how i feel about it every single day. Please stay inspirational. People need it. ❤️", "beshalivin": "You're a extraordinary woman, bless u.", "thecohesivedreamer": "I'm constantly afraid of doing everything. And for once I'm going to do something that scares me. Being brave is unheard of for me but it's time I start taking the leap of faith. Embracing myself and the body I'm in. Finally, I'm going to take chances on things I would never do. Bless you and those who set examples for girls like me. Be brave, beautiful and most importantly yourself.", "boheme_noire": "I always thought you were amazing at showing women how to style clothing for the body they have. Not one the media shows them they should strive for. So glad you've come this far.", "estherwanjiku": "Lots of love from Kenya", "gumpowder": "🍪", "momo_all_luv": "Thank you ever so much for all your hardwork in changing the fashion game for plus sized hotties😙😋👏👍.", "klaukehontas": "normally i dont like these \"smart quotes\" , especially when you read them on instagram, but one really touched me: LIFE is SEARCHING for yourself and then ACCEPTING it! LOVE yourself!", "rebeh26": "Feeling great on my own skin was never taught to me, I was always told the \"you are pretty buuuut you'll be prettier if you lose some weight\" thanks to your blog (and some others) I was able to gain confidence and found clothes that make me feel great. Now I know that being a specific size has nothing to do with being pretty and that confidence comes from within and looks hella good in amazing clothes :) Thanks!", "janoaishroyer": "Missing my dad during these precious holidays!", "jemma.lorenza.martin": "Happy Holidays! 🎄🎁❤️", "brittwils": "When i came across your instagram i felt empowered to be proud of all of me. No more being ashamed of any part of my body. When you send out positivity you get back positivity! 😘", "jeeontherun": "I refuse to believe that the world is full of evil. Love is light and it is stronger than any darkness out in the world ❤️🌍.", "1234brtny1234": "I am going to use the money to buy something nice for my momma. God knows she deserves it", "jamieson.sheriff": "I am rich in all the ways that really matter.", "jazmynia": "You're honestly amazing for doing this and everything you do and I really hope someone in need, someone having a really bad time atm wins this money!", "sharronicanyc": "I admire what you do and I appreciate women who set goals and achieve them. It's really inspiring.", "mrs__mcdaniel_": "💞", "chantelanyanwu": "God bless you @gabifresh 😊😊", "fanniefullenweider": "You helped me love my body again, simply by not being afraid to show yours.. Thank you. You rock. ❤️", "annannabelle": "I've been following you on IG for a while now and I love everything that you represent, but this weekend I've been particularly touched by your interview on simonedigital.com. It takes courage to open up like this and I'm grateful that you did, as it gives all of us battling with depression a great deal of hope. Thank you 💖 (On a side note, I'm not a fashion blogger but I'm all for the Paris meet up @hedyasdy suggested ☺)", "myownskye": "Thank you for giving just to give without any strings attached! This is a lesson I'm sharing with my girls this season and hoping to continue to every year to come. Thank you for being an inspiration to me and reminding me to embrace who I am so that I may raise my girls to love themselves too. Happy Holidays @gabifresh", "iamuhura": "I hope 2016 is the year I find my voice again. My light, my creative power, my heart has been troubled and prone to darkness for much too long. Pen to paper, may the words find their way again.", "imfreshtodeff": "Don't mock a pain you haven't endured.", "shaaarrr": "I first discovered you when I was working at an educational publisher on a textbook about fashion. I ended up scrolling back, waaay back in your blog--I couldn't get enough! Your confidence and keen fashion sense is so inspirational. Keep up the amazing work you do. Happy holidays to you and your loved ones. ☺️", "solatheshark": "We all die. The goal is not to live forever, but to create something that will.", "katiegu": "crazysexycool.", "bleraandaqamili": "You're why I started to love myself just the way I am.Thank you!", "lynrabii": "I find it super super great / inspiring that you're giving away a present like this for the holidays !! but, to keep with the spirit of it all, I'm super grateful to have a roof over my head, and to be healthy enough to work every day to keep myself afloat. you're an inspiration to so many people - keep up the good work !! 💜", "red_october": "I am grateful for all that I have!", "meowmersmcpurrface": "Happy for new beginnings at work.", "najjaog": "I love everything you're doing for the plus size fashion world ! This has resulted in a confidence boost for me in offering snazzy styling tips and designers for my body type ! It has been a pleasure following you!", "talitaaatalita": "Your style is life giving, and inspirational to big girls everywhere! So happy to have followed you!", "bizzy_bee_": "I love your style you're amazing!", "maiamesanger": "High hopes for my country and for my world. From a French woman.", "emilycannan": "Since the beginning, nothing but love 💖", "theoriginalciku": "I tend to be long winded @gabifresh so no matter how much I try, short and sweet just ain't gonna cut it. Hahah. I first found you while in college when stress, loneliness, and an additional 30 lbs on my belt had me feeling lost, depressed, confused and not beautiful. I've always been a lover of \"beautiful things\" and clothes were no exception but all the lovely fashion blogs and runway stills featured beautiful young women who looked nothing like me. That's when I Goggled \"fat girl fashion\" and came across you. The rest is history. You've exemplified beauty inside and out by simply being YOU and while I am still more of a surveyor than a participator in \"beautiful things\" I appreciate and understand that the image you portray outwards can be... SHOULD BE a reflection of the beauty within and that accepting the person I am NOW is healthier and much more beneficial than waiting for the \"perfect me\" (physically, financially, career-wise, etc.) to start enjoying life. So thank you! Thank you for starting your lovely fashion blog and for being an inspirational young lady who continually shows that talent, persistence, hard work, and a dream CAN make \"it\" happen and that being beautiful doesn't end with makeup and hair. Appreciate you and happy holidays! ✌🏾️", "lux_24": "I believe I found you on #effyourbeautystandards but I can't quite remember. I've admired your style and loveliness. :) thank you!", "hannahowlbeth": "Your blog cheered me up when I was feeling down on myself so thank you! Also you're gorgeous and I wish I had your fashion sense 😊 @gabifresh", "samy.aah": "hi gabifresh! ⚜ I dont think i can win cause i'm french and that very often, the giveaway is not about us but it doesn't matter 😌 As a young black curvy woman, I had to overcome two great discrimination and you was my inspiration! Your confidence and your joy is so contagious, you show us everyday that we must not be limited to large vest / trousers but can also wear crop top, short dresses etc. Thank you for everything you do, you and every other curvy blogger, make our voices heard and represented us so well, thank you so much 💞✨💁🏾 PS: You should come to Paris and make a big meet up!", "maybliss2": "Thank you for being fearless in fashion", "carlabear84": "This is very kind, if we (everyone) was a bit kinder imagine how amazing and positive the world would be... that's the sort of world I want my girls to grow up in. Thank you for being an amazing inspiration again.", "iameska": "Thanks for being my Inspiration for over 2 years now... 💕", "supshadizzle": "Yea confidence and Christmas cheer!", "lapinelazuli": "I'm grateful for strong educated women that inspire me to learn, wear, and do what I like unapologetically. Happy Holidays 🎉", "theugliest.duckling": "Thank you for giving me the confidence to defend who I am and what I look like. And encouraging body positivity in me and others. Huge fan 😘😘", "jessiecrow": "this world needs more strong and confident women. you inspire that in me and others", "maripraxedes": "I just want to use this chance to thank you for being such inspiration! I started to gain weight because of my anxiety medicines, now its already been +30kg and counting. I felt really uncomfortable in my new body, I didnt want to go out home like this, I didnt want to be seen like this, I thought about giving up my anxiety treatment because \"the price (my body change) was too much\", but thanks to you I can feel fine in my body again, I now know my health is more important than society standards. Thats already so much more than I would ever be able to ask you for ❤", "magdastiak": "Your smile and confidence is so inspirational and unique. I wish you a merry merry Christmas, with people you love and love you!", "suitfil": "Woa! Just.... WOA! 🤘🏼😮", "khawl4h": "I love your style !", "bryoneycook": "Living life with a new mindset of acceptance of myself and my body. Thank you.", "jhosie123": "Your love for your own beauty is truly inspiring to me. You're a prime example of someone who lives life with true confidence, work it girl! Thank you for this, it's rare to see it in our world today. Wishing you and everyone else a great holiday season 😊", "hayleys_world": "\"Sometimes you just have to walk your potato\" When so much is happening and you're finding it difficult to focus and make sense of it all. When you just wanna scream and stay in bed forever because dealing isn't an option. When it feels like no one actually actually has the time to listen and see the panic in your heart. When you can't breath and you've had enough right up to here you actually think you're going to explode any second........! but you don't. You breath and you love and you feel and you process, deal and smile - women...", "jennydoodles_": "Yay!", "parisian_rose": "I read your interview with Simone digital and you are truly an inspiration. So many of the things you spoke about, from your struggles in college to growing up as a mixed African American women, I can truly relate to. Thank you for giving your fans the opportunity to get to know and understand that part of your life. You are truly an amazing person. Thanks for being one of the best bloggers in the game! Happy Holidays!", "joyofmadrid": "I started reading YFF and was saddened when you decided to move on... But now I love it, whenever one of your posts comes up in my Feedly I know it will be a good one! Thanks for the constant style inspiration - and lots of holiday love from Madrid! 💫", "glambyceo": "@gabifresh that's a really cool thing to do. You are an inspiration to a lot of plus size ladies all over the world( especially me). Keep it up", "bananabriii": "Your beauty and your confidence wearing all these great outfits have helped me feel more confident in my own skin. Your makeup, hair, and clothes are always on point 💁I hadn't been excited about bathing suits for so long until your collections came out haha! Thanks for helping me and many other people feel beautiful too by being brave and confident, putting yourself out there, and showing us how to rock any outfit. You genuinely seem like such a lovely and funny person. Lots of love and happy holidays! ❤", "isoamyl_": "Gabi, you're just an amazing person.", "megstersssss": "This is truly amazing and this is a great way to give back!!! Smooches!!", "thenighthoney": "@gabifresh I think this is truly awesome what you are doing, especially since many of us are having such heartaches and hardships. I know when one of us is the winner it will truly be a blessing and go towards a good cause...like sharing/paying it forward during this holiday season. #THANKYOU", "marianamuchogusto": "You are beautiful 💕", "tinah_m": "I'm fairly certain that the $1000 is the driving force behind the comments, but when I sat down and thought about it for less than 30 seconds I realised just how many people around the world that you have inspired. Over 2000 comments.. All I can say and mean from the bottom of my heart is congratulations & #keeponkeepingon 😊 light and love x", "mandarinafrog": "You inspire me day by day.thank you!", "wuslon99": "Wow... this is a great idea... i would love to win.", "mlletaco": "You are my amazing 🎅 Thank you because in France we need to see that real beautiful persons exist. 💋", "lelamyrick": "I hate my math class, but I have my last final of the semester tomorrow #grind Thank you for being you", "roxdepina": "Inspiration", "deathcabforjordan": "finding you, i started my recovery process. thank you. <3", "ericaethrifts": "I did everything I was supposed to do in life and now I couldn't feel more lost or unfulfilled. 😔", "quietstorm89_": "The Most important feature a woman can have is her confidence. I Strive to teach my daughters this at an early age. Be confident, be true to yourself, be kind to others, and you will always be beautiful.", "thegingermagic": "Watching and learning from your beautiful, confident, and unique style has inspired me to be a more confident person and to develop my own sense of style and find my own confidence with myself! Thank you for being such an inspiration! I'm working my way through my last year of school as a stylist and you are such a big reason that I chose this as a career to begin with! I can't wait to see the work you do next year! You da bomb chica!!! 👠💄👙🎩🕶🍾🍷", "ossajessicabih": "You're such a beautiful person, inside and out! You inspire me in so many ways. I hope to one day have as much confidence as you do. 💓", "neobn_03": "Hello @gabifresh. I'm a young lady from South Africa, in Africa. I hope that you are well aware of the fact that you are big in SA as well. I got to know about you from a blogger here in SA (a Plus size blog) and I've loved you every since. I want to start my own blog but don't know how and what it will all be about. I find myself wanting to do many things but not knowing how I should go about starting them. I love, love, love clothing and I love seeing people do justice to it. Anyway, keep up feeding some of us some fashion tips and enjoy the festive season. Mwah! Love Neo.", "bri_r": "How cool! What an awesome thing to do. I'm already jealous of the winner lol. Happy Holidays!", "cafeconana": "I'm currently sitting down and stressing while in the midst of taking finals in uni. I actually deleted the app because I get way too distracted but alas, here I am! That's really all I want to say. I'm very stressed with school and life but I've learned to have the mentality of knowing that everything is temporary and soon I will be happy and sleeping and not worrying. It's helped me a lot with test anxiety I think and life in general. So I just wanted to say that and that I'm happy I came across this picture while I distract myself more. Hopefully by the time you read this I'll be stress free and home.", "pseudo_functional": "Thank you. That's all.", "plussizeontherise": "I'm graduating college this December #11days! Two days after spending Christmas with my family I will be packing up my life and making the move to Los Angeles. That's 2,000 miles away from my family and friends. Yes I'm beyond excited but I'm also really scared. This last semester has been stressful but also rewarding because I have really great grades this semester but I still have one more week (finals can't bring me down). I haven't posted as much on my blog/social media as much as I've wanted to but my passion for fashion is something that's really helped me grow as a person and I'd do anything to land a job in LA that has something to do with plus size fashion. I've applied places and haven't heard anything yet but I have hope that I'll hear some amazing news soon! Happy Holidays to everybody! May you spend time with loved ones and be merry!", "briannanunley": "I find you wonderful and inspiring. Thank you for simply being you.", "glorida7": "Your outfits make me smile. That's all... nothing deep. Keep slaying.", "_forever_patience": "Wow thats a wonderful thing you are doing. You are a role model for me and I have learnt to embrace who I am and feel great and look awesome besides being a + size girl. Every time I feel down about how I look browsing through your posts gets me up again. Inspired all the way from Harare, Zimbabwe. Merry christmas🎅🎄🎁 so excited you get to read my post!", "jule_tee": "I'm currently working on my MA thesis and trying not to stress too much about the daunting job prospects for lit majors and really focus on writing this thing. I'm kind of overwhelmed with your generosity right now, so I don't really know what to write. Have a fantastic holiday season and keep doing you ❤️", "adhesiveheart": "This is an amazing giveaway, girl!", "thicc.0r.treat": "Happy holidays to you and your family. 🎄🎅 You're doing amazing work!", "gmgarcia": "A year ago I finally realized who I wanted to be and how to truly love myself. During this time I also decided to surround myself with amazing people like you. I wanted to be as comfortable and free in my own skin as you seem to be. Thank you for always looking amazing and making jealous of all the great clothes you get to wear! 😁😍😊", "nessakilgannon33": "I know there's a small chance of you seeing this but hey, I won't let it stop me. For the past 3 years I've been the primary caregiver to my abuelita (grandma) who's 93, disabled, deaf and mute! It's quite a combination and at 24, I've had put my life on hold and put her well-being above my own. I haven't been able to work with my unique circumstances and without an income, I haven't been able to afford to pay my way through school. As you might imagine it's hard to have much of a life when need to dedicate so much of your time to someone with her type of limitations. I've been struggling with my needs and wants (to finish college, move out and pursue a career) versus the needs of this woman who can't speak or do very much for herself. It's a difficult life and it's a struggle even on the best of days, but I'm also going to feel grateful for the rest of my life for being given the opportunity to spend more time with a grandparent I hadn't had the chance to build a relationship with as an adult. If I won, the money would be so helpful to help pay for a class or two of night school so I can continue to work towards my goals while continuing to care for her. I think it's so incredible that you want to give back to your followers in this way. Wishing you and yours seasons greetings and happy holidays!", "s.woodzz": "Have you ever loved someone soo much, the Mere thought of loving someone else is just sickening...lol Happy Holidays Everyone. Enjoy :)", "moa_starts": "You are one of the best things I found in social media @gabifresh. Finding a new picture of you with new hair, makeup or style and seeing how you are decorating and celebrating your body is just amazing! Love and kisses from Germany! 😊", "talysataylor": "\"Learn how to take our differences and make them strengths” - Audre Lorde", "lovesickfawna": "You are genuinely one of the kindest, most beautiful people, and I am so glad to have found your little corner of the internet.", "misslysa": "This is amazing! I've been following you for so long now and it's truly motivating to see you following your dreams. You were one of the first plus sized bloggers I've followed and I definitely think you helped pave the way and shed doe positive light on the plus size community. I would absolutely love to win this giveaway!", "syddddeny": "It is so hard to feel confident about who you are and what you look like in today's world and your blog shows people that it's okay to be who you are and most importantly, love who you are. It is so important that there are strong, confident, women like you out there for other women to look up to. Thank you for being you, because it has helped so many others find themselves. Peace and love🌻", "catrionahm": "I've followed you since the days of wiwt on lj (lol) and it's so amazing and inspiring to see your success. I feel so much more confident about my body and wearing what I want than before. I'm currently doing a Masters degree which has made me so broke and SO stressed, some extra pennies would allow me to have a break next year and go away with my friends - I've promised I'd go to Iceland with about 3 different people so I'd better start those trips soon... Thanks Gabi x", "alongthekurve": "I read your interview and I appreciate you being forward. Sometimes, it's hard to know who is truly behind all the pics, and the posts. For years, and I mean literally years, I have wanted to start a fashion blog. So, after many years of lacking the confidence and mere procrastination, I FINALLY recently started a blog. TBH, I wish you would just take a peek and let me know what you think. I respect those that are in a position I am striving to be. Thank you for sharing your story, thank you for being you. I hope you and even I, one day, can inspire many, many women in this world to just love themselves. Because I know how hard a feat that can be. Peace and love. @gabifresh Keep up your hard work. ✊", "hartofkatie": "I am truly grateful for the amazing people in my life who remind me that I am beautiful inside and out. 2015 has been a roller coaster kind of year, I'm looking forward to a different kind of ride in 2016...💌", "sweetbellyjordan": "I'm watching Bad Santa while I'm crocheting. I love to crochet and watch Netflix. Just put up my tree. Merry Christmas!!🎄🎅🎄🎅😘😘😘", "awit.m": "there's a lot of bad and sad in this world. so it's special when you see the good. like body positivity and self acceprance. and cute clothes for people of all shapes and sizes. i hope everyone sees or hears something good today :)", "pinkylouise": "Such a lovely thing to do, thank you.", "laurenalegre": "There's a light in you. Happy holidays!", "dee_squared": "You are one of the (many!) positive voices that has helped me feel amazing in this body, so... Thank you!", "itztrisha": "Your body confidence is inspiring. In a world where there is so much shaming! Thank you for being you. Happy holiday!!😊😊", "amieng_a_23": "Beautiful heart in a beautiful body. Thanks for reminding us what this season is about. May you stay blessed and keep on being a blessing to others.", "ktdid627": "Here is to 2016 being my year and big things happening!", "valerie_nyamori": "You're doing an amazing thing here. I'm proud of you and your work. As a feminist I find it very important for us women to love ourselves and to be very confident. I see these qualities in you and through your work I also see a lot of women inspired. God bless you. Happy holidays to you and yours.", "sweetasjam": "I'm always wondering what you're going to \"pull out the closet\" next; I enjoy you sharing your self, your confidence, your flyy & making me think yes I can go wear things I have doubted but then killed with boldness. Thank you for making me challenge my style & not staying in the proverbial box of what I \"should\" wear because \"🎤 I'm not built like a super model\" ... Stay Dope & Continue to Slay! #inspirational 🤗😍", "moanahwebz": "You were the first plus size blogger that I followed and helped me develop my style!!!! I started by reading your blog and was so in love with ur style! I wish you still lived in NYC! So much love ❤️💙💛", "yendyssydney": "Wow merry xmas! This is so nice!!! ❤️", "julespigeon": "This is so sweet!", "beeguile": "You are an inspiration, and I hope your holidays are filled with happiness and love. 💗", "my_loveduga": "Thank you for helping me accept me🙂", "hyunglove": "Today I completed an assignment for one of my college classes where I documented the ups and downs of the last 12 months of my life. My favorite addition to the timeline was \"bought my first bikini (it was a really big deal).\" Following you here on Instagram led to little things (like buying one of your beautiful swimsuits) and big things (like getting a huge, lasting confidence boost). Thank you for everything you do, Gabi 💞", "imloran": "You radiate positivity and I strive to do the same. Stay amazing, you awesome human being you ❤", "jspat80": "I started following you because I follow Nicollette Mason and Fluvia all beautiful inspirational women!!!! You caught my eye because you can make anything you wear wonderful and stylish!! As a plus size woman myself it's hard to find good role models or women to give you hope and show you that you can still look good, no matter what!!! You are a genuine person and you are always smiling and seeing your pics everyday gives me confidence and the drive to look my best every day, for myself first and foremost. As a working woman, I am the main provider in my family. I have two beautiful children who deserve more than they get. I know that I can't give them much for Christmas but all that matters is that we give them love and confidence and teach them to be themselves and love others, like we love them. Thank You Gaby for motivating me and giving me the confidence a woman needs to survive in this world. Much love :-)", "itsseleneee": "Omg this is so generous and kind of you! Hope you spend your holiday and your Christmas in a great way! Thank you for the opportunity 😘🎄⛄️", "dianabeenana": "You helped me feel confident about myself. Thank you.", "_pppriscilla": "@gabifresh -while we try to teach our children all about life, our children teach us what lifes all about- i. #layneearabellasoifasasfy", "ei_ra_mm": "I just want to thank you for keeping it simple. What a nice gift to your faithful followers. One can only wish to be as bold and feeling beautiful as you look when you slay each one of your photo sessions. Many ppl feel envy of smaller sized ladies but one look at your style and I'm like 😒 we got this too!!😏", "thegdurst": "Your confidence and your beauty is stunning, and you make me aspire to that same confidence. I'm typically a heavier girl from a tall family and I've been in the military a few years, but their image standards have really taken away all my confidence. But you've shown me that nobody can take away your beauty, and that you can rock the F**K out of everything. In short, you're just immensely inspiring to me, and good luck to the winner of your awesome holiday gift!!! ❤️🎄", "timeenough_atlast": "I've felt super family oriented this holiday season @gabifresh they are back east in New York \"Bae\" is in #chiraq and I'm in Cali. But work is work and love is all around us. You're awesome at what you do.l, so thanks.", "babyruth728": "Happy holidays! Your positivity and style are a great combo and I love seeing your posts 💕", "windchijme": "This is refreshing. Thank you.", "jessicaisham": "YOU ROCKED THE SH** OUT OF A CROP TOP. That's how I started following you. There was an incredible confidence about you and I admired your bold spirit. You looked super hott in something that, despite my confidence, I still would have shied away from. I wanted to fill my newsfeed with positivity and inspiration rather than clutter it with waist trainers and fad diets. So keep rocking the sh** out of everything you do. 😘", "mrsleeferg": "You are so generous to do this. Also, you're absolutely gorgeous! #bodygoals", "i_am_ms_niss": "What a great idea. Good luck to all. I love your page and blog. Happy Holidays!!", "katripa": "I have been lucky in my life. I have been so lucky. I worked so hard to accept myself and my body and somehow I found love on my way. But my mother is alone. I feel so guilty living so far from her. I'm studying and counting my money all the time so I could do little surprises for her. She doesn't have a job and lives alone in a small house that is slowly falling apart. I know you didn't ask how I would use the money but I would use it for her. She raised me and my siblings alone, depressed. And she did such a great job. More than anything I want to give her something back. Something to help her to be able to keep living in her house. My mother is truly my hero and that is on my heart right now.", "brazenlymimie": "Wow! Now this is true holiday spirit! By sowing this blessing, your 2016 will abundantly more plentiful than 2015.", "annamatronik": "You are one of the prettiest people in the universe. I aspire to one day have enough confidence as you. Not quite there yet, but getting better every day.", "mirmaid_207": "I started following you shortly after you graduated from dear old MHC and it has been a true pleasure to watch your career grow. I'm tall, fat and fabulous and you have inspired me to no longer settle for clothes that aren't quite right and to rock what I wear with confidence. Thank you for all of the good work that you do! Love, A proud MHC alum, Class of 2010", "juwayriyahk": "Thank you for being a role model! @gabifresh", "liz.rio": "Best of luck, to the lucky person who wins this!!! Xoxo Gabi", "jessicalsss": "Everyone is beautiful! 😊", "hillbreyjonas": "I just wish to inspire people like you oneday ☺", "iliana.matos": "I spent my youth believing that the man who raised me was my daf--my life changed 12 years ago when my mother handed me a photo of this stranger and told me he was my biological father. I met him for the very first and only time two summers ago.", "lara_gregg": "You inspired me to want to wear a two piece and to rock out in it! ...and we don't know each other, yet have the same last name 🙄! You're a dope chica!", "la__rosita": "Tis the season to give and to take care of each other. Let's feed the hungry. Visit the elderly. Shelter the homeless. Read to our children. Pray for peace. Love one another. Gabby, you're incredible influence. You're appreciated!", "lehua.lemons": "recently i found out im moving to japan (i currently live in hawaii) and 3 months before im due to leave me and one of my good friends of years decided to basically end it and we are now not on good terms. I realized that that friendship was already falling apart and it was for the best and now i can focus on my real friends before i leave to a whole different country. Ive gotten a bigger appreciation for everybody around me. Im truly blessed for everything ive experienced.", "vicki_secrets": "This is an amazing gesture. Happy Holidays!!! 🎉🎉🎉🎉🎉", "mewiwy": "I love how confident you are! Its so encouraging. You go girl. 😊 Happy holidays. From Kenya with love 💝", "kellimm312": "I've been following you since seeing a link to YFF on Bust magazine's website in, I think, 2009. I've learned so much about fat positivity and body positivity since then, and I credit you for opening those doors for me. It's been amazing to see your popularity grow so much over the years, and you deserve all the success you've earned!", "sashajentley": "Life has been weird lately. My dad was on a DNR and came out of it with little brain damage, my older brother is an addict and lonely and I wish I could help him but he also seems to be making steps to pull himself together, my younger sister didn't go to college so feels extra lost and is moving to Australia, my mom just bought a house in Australia and says she will live there at least 10 years, hard to hear when I'm planning to stay my own family and am thinking of all she will miss (and what I will miss). I just wanted to write what I've been going through. Nothing terrible tragic or even unique. We all go through these sorts of challenges. But there are lights that appear during darkness. I met up with a friend that I haven't seen for 9 years and that was amazing. I'm attempting to start my own business and work hard and long but enjoy every minute. Bernie Sanders could be president. So the light could turn up at any moment. What's important is we, as individuals, can be as positive and caring as possible. I recently watched the documentary I AM (watch it) and it brings back the ideas that one person can change the world. One kind act at a time. This can create community in a time where we separate. I'm thankful to have your light in my community. I was referred to you by a big girl (I'm one myself) but I follow you because of your confidence, intelligence, and personality. Because you bring light! And to more people than just me. Happy holidays! 💗", "jessicabraindelhoffman": "Second night of Chanukah and trying to keep the festive momentum up for all 8 nights. Wishing you a happy holiday and a beautiful season of lights!", "marthiebe": "You encourage me to look at myself in a better light, chin high and confidence up. Thank you and God bless you. Much love 💞💕", "abarnett1587": "This is so generous of you! Your positive message always brings a light to my day! Keep up the great work, gorgeous!!!", "toriidaniielle": "I never thought that a plus size women could look beautiful until I found your instagram and website. From there I have followed other women and it is so nice to have daily inspiration. I see you and I see myself in you! Keep doing what you do!", "jaimierzzz": "I work at a very high poverty middle school, and had a heart to heart with a student on my caseload who was feeling bad about her size and I talked about you and some other fabulous ladies and hopefully got another one for the body positive movement!!! Thanks for inspiring always", "allykuhle": "You inspire me so much!!!! Xoxoxo and happy holidays! ❤️", "teesieramon": "What a cool thing to do.", "mambawifeforlife": "Very cool! Following you from Vancouver bc!", "imajin3that": "First I would just like to say thank you!! Thank you for being yourself and loving your body. You have been a great example. Thanks for letting God use you to bless someone this holiday. For most people like me holidays are hard when you have to celebrate alone. It would be great to take a vacation somewhere warm to just get away from the over saturated images of what the holidays are. May God continue to bless you and all you do. I will be on the sideline cheering you on. Put God first and everything else will follow. Goodnight from one of your day 1 supporters.", "_towhomitmayconcern_": "I've been following you for a little over a year and all I can say is you were such an inspiration to me ! As a girl who always struggled with my weight it was awesome for me to see someone who embraced their body and looked amazing and was proud of it ! I was always made to feel ashamed of my body and one day I was just like enough and started wearing what I wanted and never looked back !! So thank you for that girl !! So amazing of you to do this ! All the love and blessings xoxoxo HAppy HOlidays", "mjack3412": "I think what you are doing is super awesome. I starting following you because I needed someone who was plus size confident and who I can look up for fashion. I consider myself a confident person but sometimes you need to know that there's other people who feel the same as you. For the most part I never enter a give away because I feel that I won't win but it doesn't hurt to try. The money won't be for me if I win. I have a sister in law that I treat as my own sister. My wife and I have been helping her in all we can, food, anything she needs for her kids (she has 5), bills. She's a single struggling mom and she does it all by herself. We got her a xmas tree but she has no money for gifts. I would love to win the money and give it all to her. I want her to know that there's still hope even in the most darkest time. Thanks!", "heatherleelee": "Wow! What an awesome thing to do! Thanks for inspiring so many women across the planet to not only love themselves but to love one another. I know there is a very deserving follower that will truly benefit from your generosity. Thanks for all that you do!! ❤️", "nadiamooon": "I'm just an over all blessed person. Thanks to you and a lot of your pictures and words and interviews I learn more and more about the blessing I continue to have in my life and for thank I am soo thankful. God bless 😊😊😊", "lmcpherson0912": "What a way to giveback! This is so awesome. I've always dreamed of being beautiful, but I felt that couldn't be because I was a big girl. I was bullied about everything as child. From my weight, to my glasses, clothes, hair etc. It wasn't until I started following you and other beautiful plus sized women that I understood that size didn't determine beauty. I was beautiful from the inside out as I was. Great page! Keep up the good work!", "amjoy_m.ed": "Gabi, I have been a follower for a long time. I ran across your blog on accident. I was on my tumblr account and saw a picture of you. I clicked the link and was fascinated at the fact that a plus size girl had so many options. Before that I didn't think it was possible to even find the clothes that was trendy or in style. You opened my eyes to not only become comfortable in my skin by wearing shorts or even two piece bathing suits but to also feel beautiful. I am actually thankful that I did run into your blog and I see that you have inspired so many people. Now that I am graduating college , I look to your post still to have inspiration to what I should get for a professional setting as a teacher. You have helped me in so many ways, in and out. I am only 21 years old but your blog is not only an inspiration to women but just a girl from a big city. I appreciate you for loving yourself and teaching all of us who read your blog how to began the process of finding our own style and loving our size", "soniasavs": "Your blog is inspiring-- been following since lj haaa 😂 thanks for doing this!", "laubrioux": "I'd love to buy my mom reindeer slippers for christmas haha. Love you Gabi 💜", "teenerwiener": "💯👌🏽😘🌈✨💘", "nataleedesotell": "Looking at your pictures & personal style makes me think I might be beautiful too.", "sincerely_nkirote": "Hey Gabi! Sending you love and light all the way from Kenya ❤❤ Thank you for being so confident with your body, because by stepping out in your own skin, you've enabled young girls like me to also feel proud of how we look. I'm not plus size per se, but I do have thick legs and I struggled with wearing revealing clothes for the longest time. Be it short skirts and dresses, or even tights. But every single time I stumble upon such beautiful bloggers like you owning your curves and being unapologetically you, I start owning my own body. Your style is impeccable. And you're so stunning. Believe it or not, I sometimes run to your blog just to see how I would look in a certain style of trousers, or even how to pose in some shots, seeing as I'd also love to jump on the bandwagon of style blogging... Long story short, thank you. God bless you immensely and Happy Holidays.", "mindygee_": "Just got off from work. Had to send a patient to a higher acuity (ICU) setting because he was going downhill fast. Hope he gets better but I don't think he will. Just needed to get that off my chest.", "shikowachira": "I'm a follower all the way from Nairobi, Kenya. Our African society has been in an evolutionary state. Plus size women were always seen as a symbol of power, beauty and wealth, sadly, today's African society is looking at plus size women how Western societies look at them, with disgust, without love and as the most unhealthy individuals. I'm a plus size woman, (uk 16/18) and day by day I draw courage, self acceptance and self love from you. You have shown me that i'm a person, and a beautiful person too. You are really beautiful btw and your body is perfect just as it is. That is what i'm learning everyday and that is what I have learnt to tell myself everyday. Thankyou Gabriel for teaching to love myself.", "asiahmae": "I'm just really grateful for this past year, for coming out of my shell, for letting things go physically and emotionally. For finally loving me. That's been the best part, loving myself, doing things that make me happy, finding my why, healing myself so I can help heal others. I really love that you're doing this, because one day I hope to be able to do things like this for the folks in my community. I want to remember all the people who helped me learn what self love is this last year, who helped me to let go of the material things after the flood came to SC & remember that life was more important than shoes lol. Thanks for letting me write this, and remembering what the season is about: being grateful & sharing love.", "irynne_69": "I follow becoz of ur style and ur are a brave gurl and i admired u for showing the world size doesnt matter ❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤", "myriezame": "You have an amazing spirit, and an inspiration and a bless for a plus size women. God bless you!", "72nsunnie": "Hey @gabifresh ! I remembered the first time I stumbled upon YFF and I admired how brave you where. Since than I watched your brand grow and you grow too. You have always kept it 100 from sharing about your depression to baring it all in your lingerie posts. You are an inspiration. I remember when I saw your fatikini post that make me inspired to wear and buy my first bikini! Enough though I didn't wear it till this year you are making differences in women's lives especially in a world that is so plastic that constantly tells women they have to be peferct. I'm thankful to have found your blog, I love you style and you confidence. Peace !", "evesa": "A follower since YFF days! I just wanted to say because of you I started to wear whatever I wanted. I would always wear something that wouldn't attract people's attention. But, since that first time I saw you on Seventeen magazine and started to follow your blog. I started to see myself in a different way. You made me become more confident and made me not giving a damm if someone my size should be wearing a piece of clothing that was risqué. I always try to preach it to my peers. If you love it ,wear it. So, thank you for being a truly awesome role model for us. 💕", "lyn_marie_": "Bloggers like you make my friends and I refuse to apologize for our existence. Thank you.", "worldenoughtime": "Adding a note of thanks for sharing your journey!", "tashilaaax3": "You're so giving, thank you!", "karasperryjohnson": "Very much looking forward to this holiday season with family and friends!🌲❤️", "iamgolightly": "You are a trailblazer for us. You're inspiring, courageous and brave. Thank you for not backing down and bit by bit making the world a better place", "danicflo": "I look fly in your swimwear!! Thanks for the brave hearth", "_strawbrey": "I'm exiting a time of certainty and entering a time of.. Not that. Your posts are one of many things that help me to remember how fabulous we can make our lives, just by being true to ourselves. Thank you 💜", "becca_french": "How amazing are you! Currently loving your hilarious snapchats :)", "monahengthope": "For someone who lives in Lesotho n is a plus size ..u hv been a inspiration n u hv bought so much to de lives of young plus sizes like us....n I personally thank u for being my second go to fashionista ...", "keannacakes": "Very unique giveaway concept in today's age", "brown_beauty_nish": "I've been following u for a while now and I really njoy looking at ur pix and all the new ideas u give that I can use for me...it's not to many plus size women that wear they figure as well as some of us so I think ur amazingly beautiful...n i like to change it up every now and then so thx for the tips.", "dreamcocoon": "I worked in the Archives at Mount Holyoke (where you've been featured on many a blog post!) and have consistently been inspired by you as an alum and as a role model! Your swimsuit collection was life changing for me and seeing all these women online with cellulite, thick thighs, and tummies helped me love mine a little bit more each day. Love from a fellow Mount Holyoke sister and the happiest of holidays✨", "brisharushing": "👋🏽😁", "so_sahl_t": "You are such an amazing person that with just your pictures. You inspire girls but not only girls people in general that have to deal with learning to love their bodies nomatter what size they are. You give such a positive vibe. Thank you so much for that.", "missssschavez": "Inspiration at it's finest!", "splendidcorella": "you are lovely and inspiring and this is such a great thing to do! 💕", "queenbullay": "😊be blessed", "djwittlechipmunk": "Life is empty without love.", "molovedatoohwee": "I am so thankful for being on this earth. The good, the bad, and the ugly. I KNOW someone didn't and couldn't wake up this morning so each day I thank God for blessing me with another day. As long as I wake up in the morning, the battle of that day is already won😁", "thetallestreindeer": "Gabi, I've been a follower for awhile now. You were the first plus-size fashion blogger that I ever followed, and my life changed because I realized I could be fiercely fashionable, beautiful, and confident as a plus sized woman. Thank you for providing me with an place to find designers, ideas, and inspiration. Thank you for proving to me that I don't have to be below a size 16 to wear my first ever bikini. Keep being your incredible, inspirational, outrageously admirable self and thank you for everything! Xo Jen", "theinspospot_": "I just wanted to thank you for being real! It's really easy to think that people have a perfect life because of their amazing photos, or tons of followers, but you've always kept it real! Thanks for changing my views on body positivity and plus size fashion. You're an inspiration! ❤️❤️❤️", "jesspeachie": "I'm working on accepting myself. Allowing myself to, unapologetically, be this shape and this color in this world. Your blog is one that has inspired my journey to self love. Thank you.", "lovefourzeta": "I really enjoy your posts & your outfits. 💚💜💙", "darcelt": "Love Ya, Gabs!! Thanks for spreading fun, love and fabulously fierce fashion for ALL!", "cat_dog_mother": "Hi Gabi! I remember you from NUF! Way back in LJ! I have always enjoyed your personality & style. I'm so happy to see how many ppl you reach & how your style & life is so transformative to many many people. Take care & happy holidays. Xo Jamie", "theerikacordova": "Thank you for being an amazing role model. Keep shining! 💜", "paoespinoza_": "You are such an inspiration! Love your style and your attitude towards life.. Xoxo from Maui 😘", "ceemohre": "I love seeing how all of your hard work has paid off this year!! 😘😘😘😘", "_07nan": "Simply an inspiration, with lots of love to give .💕 May God bless you", "jennlcalgary": "Happy holidays", "rebecksie": "This is a great idea, way to spread som Christmas cheer. Keep it up girl! Xo", "bombashmom": "I love all of your positive vibes! You are truly fabulous, and I'm super jealous that everything you wear, you look amazing in ♡", "jaylee0510": "❤❤❤❤❤ you're beautiful", "becca_wue": "🙈🙉🙊", "chekdemon": "I dig your style. Thanks for inspiring me to step outside of my box.", "maryanastasia6": "Thanks for helping me realize that just because I gained a lot of weight doesn't mean I have to look frumpy or that my size dictates what I can and cannot wear. I wear skirts now and sparkly tops and even, dare I say, crop tops! and dare people to say damn she looks good! Thanks so much for helping me get back some of my confidence and you always look so killer! ❤️❤️❤️", "kamye_": "Continue to inspire girls/women all over the world like you've inspired me. 💕", "maddieles": "You've always been an inspiration to me because of your determination. I find myself trying to improve as a person daily because I have people like you reminding me of what I can be. I recognize this post as extremely generous but also inspiring for others out there in the way you've always been to me. I hope that the winner spreads the same cheer and support that you have with someone else who needs cash. I hope 2016 brings just as much for you as 2015 did!", "ldjuhasz": "So glad to see all of your success, especially as a fellow Moho! You're such an inspiration to so many, keep doing your thing!", "mrsjustwright": "My Mom first introduced me to your fresh style @crochetfan as the body positive advocate she is...always encouraging me to embrace my own beauty. Thank you @gabifresh for sharing your beauty!", "ms_sweetpea_": "Hi Gabi. I love ur energy from day 1 i started following your blog. Then i followed you on IG. First thing I admired about you was you loved the skin you are in. I used to hate being tall... im 5' 10 and a size 18. I hated shopping, couldn't figure out what matched and where to get clothes from. I took a chance and i wrote to you about shopping and clothes just on a whim and was shocked you replied back to me!!! I love that you actually interact with ur fans. Even if im not chosen. I just want to say THANK YOU for all you do for girls like us @gabifresh", "femlow": "I am just thankful for the many blessings of God in my life, particularly the gift of being able to rely and trust Him through the best and the worst!", "sienna.barley": "I'm gonna keep it real.... I just want to SHOP with that $1000. Thanks for the giveaway @gabifresh . We love & appreciate you.", "imogendlrioja": "Hi Gabi!Just another reason I'm thankful I came across your Instagram, your spirit and energy, and kindness. I was searching for fashion ideas and I came across your pics. I started reading your upbeat posts and loved your energy and confidence that I had to start following you. Just wanted to thank you for contributing to the positivity and strengthening the image of women today. It's harder to be a beacon of light than take the easy road and be negative and superficial. Bravo!", "weirdcynic": "You're such an inspiration to us plus size queens in Nigeria! We don't have a lot of representation fashion wise but thanks to Instagram Every young curvy girl knows GabiFresh and her slaying ways 🙌 Thank you for letting us know that you can be fabulous at any size! 💕", "curlyhairedbear": "You make me happy with my own body!", "crystalcanseenoo": "Wow!! Beautiful inside and out! We all need money.. Hope whoever wins uses it for something they really need👍🏼👏🌎✌️", "maritchki": "You send lots of positive energy into the universe. What goes around comes around! Thanks for restoring my faith into humanity, en te souhaitant le meilleur pour la nouvelle année xo", "amandajschroder": "Thanks for sharing your style and beauty with us, it's inspiring.", "tiffanytried": "Can you pay my biiilllsss ? Can you literally pay my telephone bills? 🙏🏾", "nd500wow": "Only a certain few people would do something like this. It's a testament to the type of human you are. Way to pay it forward! This also confirms that God leads me to kindred souls. Keep sending your positive vides into the universe! One ❤️", "moria.hill": "It's nutcracker week for my 7 year old daughter, which means it's nutcracker week for me too. It's only monday and I'm psyched and drained all at the same time. She has earned time on stage and I can't wait to share that with her, as I did when I was a kid.", "ivydonn": "I believe the first time I saw you I was at work. I think I recall you doing some type of collab with Addition Elle. My memory could be wrong, as if worked there for many years now. But I remember when I came across you I smiled so big because I remember feeling so happy that there was a women out there who is successful and proud and happy and who also happens to have the similar body shape to me! I love your work and everything you do. Lots of love. 😘💋💞", "ktbrew08": "I can honestly say I don't remember how I came across your page and started following you, but its one of the things I'm most thankful for. Growing up, I hated myself. I always thought that being a big girl was horrible. I was told that to be the weight that I am was disgusting and that I would never be loved. I spent the last 13 years believing this. When I found your instagram, I saw that being a big girl/plus size/fat whatever you want to call it, wasn't disgusting, it was in fact beautiful and something that added a little specialness to us. I saw how much you embraced yourself and I decided from that day on that those people who told me I would never be loved were wrong. I was going to find the love that I deserved the most, self love. And I have you to thank for that. If it wasn't for you, I'd probably still be hating myself to this day. And there's enough hate in this world, we don't need to add to it by hating ourselves. So thank you! @gabifresh", "tempika": "Thank you. 💙💚💛💜", "iammonicagraciela": "I am so grateful to live in a world where someone like you is a leader and a role model. You remind me every day of the beauty INSIDE ME and I love to think that this experience is magnified over and over in thousands of minds and hearts all over the world. Keep being and sharing yourself. You do it so sweetly and remarkably...elegantly. Being you, on purpose, is having a loving influence on this world and making it ever more beautiful! ✨💖✨", "existentially_randa": "I'm just homesick and feverish for Philly. I moved all the way to LA to start a new job. I've been thinking home about ever since I got here, but I did this so that I can start my career in media where I want to promote body positivity and roles for plus size people that aren't cliches and stereotypes.  That fat women can have leading roles and don't need a make over to find love or be successful. Christmas is my favorite holiday and I would like nothing more than to lovingly harass my family and friends. Not to mention my best friend of 10 years is moving to the Carribean to start med school in January and I'm trying to make it back to say goodbye. LA is cool, but it's a long ways from home. It just don't feel like Christmas here. I've made attempts to adjust, but nothing is prettier than Philly Christmas.  I'm just trying get back home without compromising my dreams. I think a trip home will make things easier. I'll get see my little sister and show her how well I'm doing. I'm doing this to show her that her big sister can be smart, slay, and be funny all that same time without being apologetic for her size. I just want her to see it's ok to shine.", "lolochum": "❤️❤️❤️❤️❤️❤️LOVE", "thisnight_by_jin": "This is such a kind thing to do. I guess I'd just like to tell you that I truly admire you, you have inspired me be more confident in myself. Pushing past my insecurities has been very difficult but you've helped a great deal. Anyway, I hope you have a wonderful holiday and good luck to everyone, there are people who really need financial support and I hope whoever wins puts it to good use.", "kmosinyi": "The blog is just amazing, im from a little country in Africa called Botswana! So very refreshing to learn to be comfortable in your own skin. I gained about 50kgs after an abusive relationship. People here have no filter and would always rub it in my face! But I'm starting to learn that if I can dress for my body then im still beautiful! And it's such a challenge finding clothes for my size. But I make do with what I can find around. Keep on rocking @gabifresh", "abgljhnsn": "Bloggers like you inspire me to finish out my education in apparel merchandising and get ready to start my career in the plus size industry. Thank you for the daily inspiration and most importantly for spreading the message of self-love! Even though I'm still a student, I hope I can be as much as an inspiration to people as you are to so many. ✌🏻️", "andreawaves": "Thanks for sharing your self, your stories, and your style. You're helping those don't always feel it or know it that all bodies are good bodies. 💜", "kdgk10": "Embrace yourself. Always. On the days when that dress makes you look like a movie star. On the days when nothing fits. Beauty is a feeling. Not a look. Xo", "socialmarci": "You are the BEST!", "ahputnam": "I think what you do is important, maybe more so than you even realize. I've been a 'normal' straight-size for years but seeing beautiful women inspiring each other remains one of my favorite pastimes on social media. You are more than your (stunning) looks or your (gorgeous) sense of style; the courage and inspiration you ignite in others is exactly what our world needs right now. Thank you for doing more than your part.", "ashleysamscott": "Merry Christmas !!!! And I love that you are just doing this to give back and you clearly state you aren't doing to gain more followers. In a world where likes and views rules this is refreshing to hear. I loved the Simone interview because I'm biracial as well and I have lighter skin then even my half brother and I've witnessed first hand the different treatments different skin tones get. I relate more to a black girl I just look more like a white girl 😹😹 .... Also you are just smoking hot and gorgeous and everything you do is always on point 🙏🏼🙌👏👌😇", "middle_finger2": "You are amazing. So inspiring. I'm still very far away to reach your kind of positivity and self acceptance. i really thank you for all that you do, please dont stop and please stay fresh. You have a faithfull follower here in Uruguay", "cardenas.12345": "Beautiful simply beautiful gabi!!", "neonesquire": "I've had a heavy heart this year. I'm trying mightily to lighten it in part by accepting who I am and not who I wish I was.", "sleepyemma": "been following you since I was in middle school and on LiveJournal, so amazing to see everything you've built for yourself. very proud of you, Gabi. killin it girl.", "heybeccab": "I'll always love the Halloween costume from a few years ago with your boyfriend, the Hilary Banks and Fresh Prince costume! So so good!! 😄", "crystalrocketship": "Happy Holidays! You're one of my wife's favorite bloggers!", "melkenza": "This is so generous & amazing! Hope you'll have happy holidays! 🎄", "sarahlola": "While everyone is telling me to be thin, thanks for the \"be you\" message. That one is far better;)", "theblkdove": "I love your energy and positivity and it has definitely helped me appreciate who I am! Stay blessed and positive! 😊", "chrisalen": "Merry Christmas and a Happy New Year! You have inspired me to wear pencil skirts again because I love them so much but was always concerned with how they looked on myself. Your body positivity and attitude is a beautiful thing and it has inspired me to love myself more than I was before. Thank you for that.", "desertamoeba": "Never underestimate the power of a great outfit and a smile! Thanks for the inspiration, Gabi.", "pglanell": "I've followed you since YFF and the Fatshionista livejournal days! I was a lil baby back then (like... 16, 17? I'm 23 now!) but that community and your posts helped me form my own fashion sense and (probably over inflated) self worth. You told me I had a killer haircut once on Fatshionista and I'm probably still coming down from the confidence boost. Thanks for helping me be obsessed with myself from such a young age and for showing me what hard work, confidence, and good taste can do for a person 👑💪🏽", "cindica.xo": "I'm really trying to get my life back together right now. I'm emotionally unstable but I'm trying my best, you inspire me sooo so much, love you!", "divanicole": "How amazing is this. Thank u for being such an inspiration to many, especially me. May God bless u abundantly all of your days. Much love to u & yours. Happy Holidays!", "saraellis": "Took me 30 years to love these thick thighs... But now I'd be devastated to lose them!", "_natty_tash": "Well for me it's how you always look good in your clothes, you know how to dress for your body type and makes as have confidence to dress in our body types. Happy holidays", "iridescent_madness": "The state of my life right now is in so much turmoil. I keep getting the floor pulled out from under me and am persistently trying to pull myself up and forward. People like you help brighten days and many are appreciative. I just want to be a better me and to have a happy life so that's my goal. Just some thoughts and feelings I'm dealing with. Hope your holidays are full of fun and love.", "redrose15_140": "Thank you so much for doing this giveaway. I started following you bec I liked your sense of fashion and I could relate to you. Happy holidays and thanks again 😊", "allisonbretz": "I've been following you since the WIWT days. Always happy to see your success!!", "traceelc25": "It's amazing to see someone so beautiful on the outside be the same on the inside. Thank you for being a true inspiration to all women everywhere.", "lalaluna05": "12 weeks with a sticky bean, this holiday season seems so much brighter ❤❤❤", "adorezmoi": "Would love to win ! Happy holidays !", "ursnicholas": "Keeping it real as always! True inspiration for us all. Happy Holidays!", "kristyrohnhome": "It's a true blessing to be in a position to give back to people and with no questions asked. Bless you and Happy Holidays!!", "howtobeinfinite": "Thank you for being such an inspiration. If you never try, you'll never know.", "livelifecurvy": "I remember when I found your blog..I was on a hiatus from social media ..so no fb no insta..no nothing lol..search for plus clothes found you blog and admired your journey strength and confidence.. And still do. Thanks for being one of many plus pretties to open doors for all plus prtties xoxo 😊", "tamaramarbury": "🙌🏾👏🏾👌🏾👍🏾", "kristenholland": "Merry Christmas! Love your giving spirit!", "mjay1187": "I've followed you since your YFF and always wanted to be just as fabulous/confident/beautiful/adventurous as you are. Over the past few months I've done the some of the scariest things in my life. I threw myself into life and stopped sitting on the side lines. I quit the job I loved, but that was keeping me stagnant and using up all my talent without adequate acknowledgement, started grad school to be a social worker/therapist, and have started to get to know and love myself inside and out better than ever before. Constantly people remark on how much happier and more confident I seem. Sometimes they are celebrating me, sometimes they are trying to pull me back down, and sometimes they are looking up to me which is something I could never have fathomed. You and women like you are setting off such a chain of dominoes. It's a simple chain really. You're allowing us to love ourselves regardless of what those around us think or need us to think. You inspire us, we inspire those you can't reach, and they in turn will help us raise up the next generation of humans who can simply love and accept themselves and others. I appreciate you and the power I've found within myself by following you and many other truly beautiful women out there. I have never been happier to be alive, be in this body, and be me. There's no more powerful give away than that, thank you.", "rachelmcnmara": "What an amazing gift you're giving to someone. You are making someone's Christmas and their families. What an inspiration!", "keighleypage": "You are so beautiful, inside and out. You amaze me and inspire me to be the best I can be! ❤️", "staticsleep": "This is incredibly kind of you <3", "salty_beefcake": "You are the embodiment of what we should see more of in the world - generosity, body positivity, fun, women embracing their lives, taking care of themselves, and feeling beautiful. Thank you for what you do.", "bridgebrou": "This is amazing", "toniolivejuice": "Thank you for being positive!! Your confidence allows many women to take pride in their own bodies including myself. ❤️😊", "lexa.brown": "My sister is the one that told me about you! And I'm super glad she did! We're obessed!", "janet.213": "Keep on inspiring! Our youth need to see more people like you on the media. 💞", "bgurl7": "This right here is TRUE BEAUTY Gabi. And it is priceless. I hope your generosity comes back to you tri-fold!", "carlystong": "I think this is the sweetest giveaway I've ever heard about! Talk about the spirit of the season ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "katyedgington": "You are a gorgeous, fashionable, generous soul. Thanks for providing fashion ideas and general inspiration every day. Happy holidays 🎄💕🕎", "nerdybookishbeauty": "Thank you for your inspiration!! God bless!!", "abetterbre": "Being a young curvy black girl I had no one to look up to or aspire to be in the fashion world and one day I stumbled across your website in an Essence fashion article. I said to myself if she can be fashionable so can I. Thanks Gabi 💕👑😍🙌🏾", "pearl_of_africa": "❤️❤️❤️❤️ you're style @gabifresh", "nicole1983ml": "I've loved watching you evolve since the beginning of YFF. You werk it like a BOSS 👌👍💁🏻 xo", "styleby.lola_": "I'm grateful to have my family this holiday season, not everyone gets the chance to have all members of their family durin d holidays especially with the unrest in our world/country today, I'm grateful for my beautiful neice, n ma amazing sisters n mother. And most of all grateful to u Gabi, for lettin me share.", "natalieann629": "This year I finally feel amazing. My career in legal aid is firing on all cylinders. I feel gorgeous and competent and intelligent and I refuse to give any time to people that detract. A big part of that has come from discovering your work. I wore a bikini on the beach this year and LOVED it. I finally feel at home in my skin and brain. Thank you.", "icaneatthatthanks": "Holidays are stressful, but when your family puts pressure on you for your weight, it can be even more difficult. Thanks for always showing every-body that they can be beautiful. I know it helped me. @gabifresh", "brittanydorsey": "I've truly enjoyed following you! I found you by accident but I like seeing your take on clothes I want/wouldn't think to try. You inspired me to embrace more of who I knew I already was and not feel out of place. I've learned a lot and done a lot this year I didn't think I could do and it's because of the belief in myself! I'm just working on pushing it out to others and making sure they trust in themselves enough to be happy!", "stephlombo": "Hope you have a great holiday - what a way to give back 🎄!", "foodette": "This is so generous :)", "lesliecampuzano_": "DAmnn with all that money I can get my sister a barbie house..", "kea_lim": "I'm Always going through your page everyday, like paging a fashion magazine, just for Inspiration and more. 🔥Your beauty and body is a plus, making your page even more interesting. 💋🎁💝", "jessicaegolden": "Thanks for the inspiration!!", "be.real.be.plus": "As I saw this post I had to read it twice because I hardly could believe what I was reading. Although the chance of winning may be small this deserves to be commented. I really like your style but even more now I like just you. It's inspiring how you made your way and do this just to give something back. Honestly. I was amazed that Marc zuckerberg planed to \"donate Facebook\" and that you will give 1.000 $ to you followers just because of kindness. This make me believe in the good things in mankind! This post wasn't planed to become so emotional but I just had to say this. ☺️ I'm sending greetings and a huge thank you from Germany!", "americas_erika": "Nothing special here I found you through a mutual friend and you helped me with my body dismorphia that it's okay to have flaws and that my body is beautiful. My confidence is slowly growing every day.", "regan_templeton": "I'm not plus sized, but I'm not small either. Seeing a woman own what her body looks like and sharing her beauty (inside and out) helps me love the body I have, rather than focusing on the body I want.", "stilettoslytherin": "literally amazing. You are a golden light in a sea of terribleness for me today.", "partiesbylayn": "I don't usually win anything, but hey, everyone needs to catch a break sometime right? I would use this money to help my mom out and pay back the family that helped me. This is very generous of you and congratulations to whomever wins. Have a happy holiday😊", "steph.strode": "Thank you for giving back!! You are such a positive, beautiful inspiration. As I hold my two month old daughter, I pray she is more comfortable in her skin than I was growing up. I was bullied and it took me forever to find my confidence. I want to surround her with beautiful, positive role models to instill confidence and strength in my beautiful baby girl. Thank you so much for being you. ❤️", "lynsiestout": "I've been following for a while because I found you to be so body positive and beautiful. Tonight I bought a dress that fits well and makes me feel confident- the first dress I've purchased in 3 years! So here's to learning to love your body, and here's to a happy holiday season! Cheers!", "skyjenni": "I never knew how much God was working in my life until recently. I have never felt so blessed even in the midst of finals week and some struggles at home. I just want to remind everybody that God is watching and that he hears your call to him. His plan might seem crazy at times, but remember IT IS HIS PLAN.", "cyncara": "Am thankful for the year 2015, God blessed me with a shelter and a job to take care of the family. However on the 15/10/2015. The house was set on fire 🔥 by my cousin's boyfriend. Because I trust in him, I know next he will provide for me to rebuild it. I live by this phrase' in life you need to come across problems in order for you to grow'.", "kungpaola": "I always talk myself out of trying because the chances are slim I will succeed. I think it's time to give trying a shot.", "hanaelujah": "It has been an honor and inspiration to watch your journey while I have experienced my own over the years. We're friends in my head lol. Anyway, this is an awesome gesture, and you will receive so much in return for your continued generosity.", "theriahmo": "I'm graduating college next week and I'm a little lost. I have the next 3 years planned out, but as it turns out, I'm much more of a free spirit than a planner.", "mamahop1975": "Kudos to you first off for doing this. May god bless you for being so given...it may not be a lot of money to you but to someone it could be a life saver... God bless you!!!!!", "riieke": "You are an inspiration in so many ways 😘", "andreaxdenee": "\"Breathe in, breathe out. Let the human in.\"", "katnappp_": "I'm what you'd call \"recently plus size.\" Some health problems has caused me to gain a significant amount of weight. Every time I feel down about it, I come here and look at your pics to remind myself that you can fierce, stylish and beautiful at any size. Thank you for the inspiration and the positivity. ❤️", "amelieford": "I'm grateful for God's grace and mercy.", "bettinaruthtlbs": "I just wanted to say hi to you @gabifresh. Keep empowering plus size women all over the world. 💕", "stunningdays": "I've always been a confident person, but I've never been considered the \"skinny girl\". You were actually the first curvy blogger I started to follow. You allowed me to know that's it's okay to be what I call a Double Digit Diva!!! That we are not excluded from the fashion world and a plus size woman can make major moves. Keep doing what God has designed for you to do. Blessings!", "jinianaustria": "I'm grateful for having a support system when my depression gets bad. ❤️", "the.zaftig": "To be honest few people give us people give us plus size women and the few that have inspired me each give me something different you give me soft and graceful beauty and I love you for it", "colepartain_": "My best friend showed me a picture of you when I was really down about finding a swimsuit. You were and are such an inspiration to me and I'm so thankful that she chose you give me the confidence to be bold in my choice of clothing.", "jalima10": "Struggles Make You Stronger! I am ready for the new year :)", "chrissalyons": "I've been following you since I saw you in Seventeen magazine years ago! You are so inspiring to everyone! 💗 thanks for this awesome opportunity! 💋", "tiffanika05": "Beautiful on inside and out!", "amy.soyoung": "You inspire me in so many ways 💖", "allasamma": "Thanks for lighting up my feed with your beauty and confidence.", "lovemoxo": "My Brothers passing is in my heart right now, he was the provider for my family and such a fearless inspiration.", "ladyaka02": "Its great to SEE someone you can relate to that LOOKS like you. No matter your shape, you gain inspiration to keep loving yourself when there is a woman who is teaching in her actions. Keep inspiring women to love their bodies and to embrace THEIR individual styles! Keep grinding!!", "findingyourfamous": "This is so sweet of you to do! Thanks for the positivity & fabulous SLAY all of these years. I look forward to seeing your career continue to grow!", "rtotheissa": "This isn't an entry but l have to say: I've been following you since your youngfatandfabulous days and met you briefly at this year's Create+Cultivate LA. I sometimes think you (and others like you) don't realize the positive impact you have on the lives of those who follow your work -- myself included. It takes courage to stand outside of what society says is good or acceptable and say \"naw, you guys are wrong this is good too\" and you do it with a grace and a goodness that is unparalleled so -- I just wanted to comment and say thanks. You are shifting the tide and making a way for others and the world is different and better because of you.", "blobbygui": "\"The only weight you need to shed is the one parked heavily on your shoulders, screaming ‘You should not exist’ because of your size.\" I wrote that over two years ago on my tumblr, right before I found out my boyfriend at the time wrote an anonymous post that ended up on @thoughtcatalog about how \"all his friends think he likes bigger girls\" but really he's just to insecure to go for the skinnier girls he wanted. Needless to say we broke up once I saw it. In the 2 years that followed, I lost 50 lbs, and gained it all back after I left NYC this year. I've had to rediscover who I am, and thanks to great examples of confidence like you, @nadiaaboulhosn, and countless other figures in the industry who continually prove we are all good bodies, no matter what shape we take. It's ours to define. I basically just wanted to thank you. You've played a huge role in me finding comfort within myself, and I'm sure so many others.", "kasheena_p": "Wishing everyone a happy and fashionable holiday season!", "candybegood": "Thanks for brightening up our IG timelines with dope fashions and positive vibes! Blessings to you.", "burningwithlilith": "What a wonderful way to thank your followers... It's beautiful and bold women such as yourself and your followers that have given me confidence again with my body... 💜💜💜", "wynt_her": "You're awesome! ... I'm not considered plus size but I admire how you own your body and it has helped me become a little more accepting of mine and what I consider to be flaws. I came across your page by way of a okus size friend that follows you and I thought damn she's badddd I have to follow her.", "thegimonster": "Wow, just another reason to admire you!", "ittybittyshark": "wowza 🎈🎈🎈", "maggsssie": "Wow! Just thank you. This is such a generous gift to help out those who follow you! You are such an inspiration in more ways than one. Much love mami!", "xoxo_lynette": "You have such a beautiful soul💓", "darafisher": "You make me feel like I could be fabulous and love myself too!", "mrsmax12": "Everyday is a new day to choose to be who you are...how you are, no worries, stay high on love, life and family!", "bean_franklin": "Love you and your line of swimwear. I finally found something that I love to wear to the beach and worry about covering it up because why cover something that is so pretty. Thanks.", "kimakeishasam": "I've been following you for years. I admire you so much and wish you a very happy holiday.", "ambahjoiii": "I'd love to \"enter\" but then again, no. Just want to say that this is beautiful. Proud of ur success. Thank u for the inspiration to accept me as I am and enjoy the me that I am! God bless.", "ohthatgrl": "Thank you for being the beautiful woman that you are. Just seeing you and how confident you are gives me that extra encouragement to be as fly as you!", "baerica_": "This is so generous! You're absolutely wonderful!", "alethea_odell": "You're awesome!", "caathyrozay": "I found out about you through the FAMU circle...I was living in NYC and the HBCU circle is pretty tight...anyway I feel like I have grown with you. Through you I discovered that I can be curvy fashionable and SEXY..you're swimsuit line inspired me to get out there and embrace my sexy summer self...thanks for owning who you are and inspiring me to do the same.", "janae_marie29": "I love your style @gabifreshvery very dope.. Merry Christmas!!", "misschrissyful": "I am having a bit of a rough evening. One of my cousins who I also consider one of my closest friends passed away unexpectedly. She has alway been a big girl and was a severe asthmatic. I don't want to down everyone but sometimes it just feels better to share! I am so thankful for bloggers and vloggers like you that provide a community of positivity, love, and support! I have been following you for years and have loved getting to watch you grow.", "muffinsisfat": "You are so lovely oh my gosh ☺️☺️☺️☺️☺️", "wendymaritsa": "So generous of you.... You're an inspiration in so many ways!", "smizzycityusa": "You've been the biggest role model is my journey of self acceptance. I'm working my up to buying a swimsuit this year, and being able to walk around head high no problems. Enjoy your holidays mama 💋✌🏽️", "oof_sydney": "Your instagram has helped me so much with my body image. Being 16 with acne and homework is hard enough, but feeling bad about my body constantly made me sink into a deep depression. Then I started surrounding myself with body positivity and love. It really changed the way I feel about myself and your account is one of the reasons. Thank you so much!", "sarahthibeauu": "Seeing your Instagram posts makes me feel like I can be beautiful too. Thank you for being so proud of who you are. 💕", "childofmosthigh1": "Wow I have been following you for a while and I can say that what you are doing is so inspiring. Whether I win or not I hope we all can be like you and give back to others in one way or another.", "miss_jaaay": "@gabifresh this is great! You have such amazing style! I look forward to seeing your posts and it inspires me to feel good and look good at any size. Happy holidays", "its_millym": "You radiate positivity, self love, and acceptance and know how to dress for you.", "ebwiggans": "Your style inspired me when I didn't see inspiration in magazines. It still does! Thank you!", "shirawill": "Happy holidays!", "nylonandsugar": "you are such an inspiration to so many! I've never been \"pretty\" by societies standards or I was \"pretty for a big girl\" and I hated feeling like I wasn't okay in my own body. You and so many others have used your platform to show that all you should worry about is being/loving yourself. you in particular have helped me see how fabulous I can be and that I don't have to cover myself head to toe because I'm not \"small enough\". As I grow, I am able to encourage my daughter to see her own beauty and not seek validation from this crazy messed up world. God bless you-you are truly wonderful! As @tessholliday would say #effyourbeautystandards 👊🏾👊🏾👊🏾💋💋💋", "mckenna.macmillan": "I always look forward to posts on your Instagram account. Body positivity, inspiration and motivation. When you lose inspiration in yourself finding it from other strong confident women is amazing! Teaching women to love their bodies and rock their confidence! Amazing 🔥🔥", "tatyx18": "So sweet of you!", "latoyahowardbeauty": "I was going to keep scrolling because I said to myself I wouldn't win....& then....just a thought......what if I did? Could I use it we all could. Do I want it hell yes! I always try to remember \"ask the universe for what you want\" so........can I be the winner? 😊😊", "beccathom1": "You are such an inspiration. I love this account!", "natshov": "@gabifresh thank you for being you, lady! i admire your spirit and personal style and am so thankful for someone like you, with such a body positive message of confidence, finding their voice in this world! can't wait to see what you have in store next!", "hannahf313": "Wow, thank you for your generosity. I have never seen anything like this on IG. You are awesome! 💖", "iamdeonna": "I never thought I'd feel homesick but my recent move to the east coast did the trick. Being away from family has made me appreciate them even more. I can't wait to spend time with them in a couple weeks.", "joy_musyoka_mutinda": "Your confidence is beautiful! Happy holidays", "mrsdiva908": "That's very sweet of you...win or lose, happy holidays to you and yours !!", "aketrasoposh": "Grateful", "colleenmariet": "I really need financial independence because it hurts when the ones you love holds it over your head that you depend on them. I only have my son in this world and I have to do better. I hope you choose me.", "alwaysdede": "No matter who you give this to, it will be a blessing! Thank you for showing us that I doesn't matter what size you are, as long as you own your confidence, you can own whatever style you choose. God bless you @gabifresh and happy holidays ✌😘🎄🎁🎉🎆", "aishabeeating": "So grateful for all you do in the fashion industry!", "tam_n_pursuit": "All I want to say is I LOVE your style and how you represent plus sized women!! You are a beautiful full figured women who has embraced her FABulousness and has touched the lives of women everywhere! That's important and what really matters...i'm a believer that people with clout or influence should use their gifts to make positive impact which you have done! You should be proud☺️☺️", "appleberry_velvet": "This is what the season is all about giving back and remembering His birth. @gabifresh you truly have a sweet and kind heart and may what you give be returned unto you double triple fold!! Thick girl's rock!! Merry Christmas!!", "raemcv": "All I can really think to say is, 'thank you!'. I know you hear all the time what an inspiration you are, but never forget it! The more we see of you, the more we are reminded that beauty is all around us!", "la_calena_del_cibao": "\"To Thine Own Self Be True\" Easier said than done. It's something I've been learning to do and am achieving as of late. You among many are admirable in helping others achieve that milestone of Loving oneself! @gabifresh you truly live by the quote \"To Thine Own Self Be True\" Many continued blessings on your journey. 💙", "roseymomma_life": "Wow! This is an amazing giveaway. I know that this would help my family but I know it will help anyone else too. Thank you for what you are doing! God bless you and your family at this time! And merry Christmas!", "chic101": "Well aren't you awesome for this. I only started following you a few months ago and it was mostly because you reminded me of a very close friend of mine. To me you both favor. She is full figured and fabulous. Watching your post everyday I began to see that you are much more than a fabulously dressed woman. You are a business savy, confident, funny, a fashion mogul and a actual real person. It's really hard for plus women to get the recognition they deserve in the fashion industry. I just wanna thank you for being brave enough to take on the challenge of asserting yourself in the fashion industry and also congratulate you on taking it by storm.", "ohabtbj": "You bring so much contagious positive energy ⚡ to the table @gabifresh Obrigado! 🙌", "ahemwastefree": "wow, what a great gift to someone! You inspire me to be confident in the body I have, regardless of my size.", "sweetdreamsloyd": "@gabifresh I had this beautiful moment last weekend. I went into the world wearing a crop top. Me, a size 20 fat girl. And you know what, the world didn't stop spinning. I felt so free, like I could do anything. If only for a few hours. Representation matters. It matters so much.", "nuthinnewgandc": "This is the kind of gesture that allows people to get a true glimpse inside of you !! Now thats humility! !", "kesliesunrise": "I cried today and the tears helped my strength grow. The journey of strength in oneself is not a stable one, but it is steady and never stops. Progress is in the process.", "crystal_ineka": "Hey @gabifresh....I would like to thank you first and foremost for your beautiful persona. You are the epitome of style and savvy. All of your looks are amazing and you are always ahead of the trend. Thanks for thinking of your viewers and followers. I could really use the $1,000 because I recently experienced a flood in my NYC studio apartment last month. A lot of my items were damaged such as furniture, clothes, and important papers. I was devastated. Can you imagine, the water kept pouring down vastly and I called 911 frantically in tears. The fire department came and broke in the upstairs apartment where a pipe burst under their sink. The SAME day, the ceiling collapsed where it flooded in my kitchen. The landlord refuses to fix the ceiling (and it had previous water leakage before and he never fixed it) and he said, its better if I move out and find another place that meets my standards. He said he will make repairs when I move out. I always paid my rent on time and he stated that I am a good tenant. However, he also gave me until January 6, 2016 to move out. I have to smell a rotten type egg smell from this water damage and to make it worse, I suffer from allergenic asthma which can trigger breathing problems for me . I am trying to move and if you were to select me, I'd use the money as rent towards the next place or for moving expenses. Thanks for reading my post. Happy holidays.", "sherriedvs6": "There are so many people that feel lost right now, whether due to the loss of loved ones or loss of hope in their lives. Thank you for giving hope, love, support, and encouragement in not only this but in all you do. #awesomebeauty", "amitch2415": "@gabifresh I struggled and still struggle with my body shape but seeing you and reading your blog has really helped me dress my body and have more confidence. Just the mere fact that your beautiful inside and out makes me so happy because it reminds me Im following the journey of someone amazing. I love you more than I love cake 🎂", "greeeno": "@gabifresh thank you for always being an inspiration for body positivity! You have helped and inspired me to love my body and myself! ❤️", "tocarraelise": "This is a really beautiful way to give with a happy heart. I needed to see this. I hope to model this heart behavior soon. Happy Holidays to you. X", "apothicfairy": "Thank you for being you. Your presence is appreciated; it's a breath of fresh air. Happy holidays!", "darklady1230": "I always look to your post to find different ways to put together a outfit. From the first time I started following you I was like this gal here! We have the same body type and she works it! I don't have the budget to buy the things I see you in, but I would lobe for you to style me. Lol. My birthday is 12/30. I know I won't get choose Gabi, but please keep doing what you do. For women like me!", "maritzavegaceske": "We are all winners here. Money or not we are all together loving and learning how to love our bodies. I think that's the biggest gift of all.", "jillianbeck04": "I first saw you in the lingerie shoot for hips and curves I believe I said to myself I want to feel that sexy and care free and have that confidence she is beautiful I've followed you ever since you help me be more out going in what I wear and how I present myself and I thank you for being a curvy girl out in the business your in its hard just to find that in yourself and you've helped me find that in myself thank you 🙏 @gabifresh", "dvinemisse": "This is amazing! Your generosity is what continues to bring blessings back to you! Keep doing it and inspiring us all to be our fabulous selves!", "nuyoricanteacher": "Lately, I'm learning that it's ok to not have it all figured out. Just got to follow one's heart... Or gut. 😊", "aj.ren": "I have learned to love and respect myself so much more because of people like you. Very cool of you to give away such a great gift just because. :)", "jennifergster": "I have been fat a long time and comfortable with it an *almost* equally long time. But there is a difference in being happy with yourself, and in seeing so many happy, confident people who are comfortable in their own skin(or on their way there!) Your blog was the very first body acceptance blog I came across and it opened my life to a whole supportive community! For that, and for your fierce fashion example, I thank you and wish you(and all of you) a holiday filled with joy and peace.", "shenequedotcom": "Since I didn't love myself enough, I stayed with a man who didn't love me at all. I gained about 60 pounds since my mother passed and felt like I was unattractive. When I met my ex I was at the biggest I've been in my life. I thought \" wow... He loves me like this\" . Then I gained more weight in our relationship. He too was big but then started to make me uncomfortable about my body. So at that point I started to lose weight. well after almost 2 years of ups and down and mostly talk and no action. I still stayed around for more....until I his fiancé called me to tell me she has been with him for 10years. The thing is I knew he wasn't a good person. Deep down I knew that he had to be lying to me. I immediately blocked his number and haven't spoken to him since. I realized that it's wasn't my size that affected that relationship .... He was just a person with bad intentions. I still feel slightly unattractive, but I have a healthier life style now. That life style is not just food.... It's who I let in my life. So all in all the unhappiness went away and I'm not 100% now at all... But girl I'm better than I was before😘. Happy holiday", "jesrefugio": "@gabifresh taught me to love myself. it room me many years to know it's ok t9 be yourself.", "theonlynaomii": "Thank you gorgeous", "nae1919": "I truly admire your passion and love your style ☺️", "radiahflores": "Thank you!", "mayraeeee": "You are an amazing, beautiful woman.... You are inspiring. :)", "mselectricity": "I appreciate you because right when I was starting to decide that, \"Hey, maybe I AM beautiful the way I am ...\" I discovered you. Young, Fat, and Fabulous was a SHOUT! A confirmation of everything I'd been trying to believe about myself ... So THANKS!!!! I'm grateful that I got to watch your road to success. Happy Holidays!", "johnnalaurenn": "You are my plus size fashion inspiration. I hope you have a happy holidays.", "lizzlebee923": "Gabi, I've only followed you for a few years, but you were like gateway to the beautiful world of body acceptance. Because of you I wore a swimsuit in public for the first time in 10 years. I take more selfies and buy clothes with bright vivid colors and patterns because I've accepted that I don't need to hide my body. I went on a date for the first time in years the other week and for once I felt good enough and deserving of a nice time. You and other bloggers like you are my foundation for this new found confidence. Thank you so much, and I hope you have a wonderful, colorful, holiday season. 💜💙💚💛", "daniellecords": "How thoughtful! This is so nice", "yewandethorpe": "I stumbled upon your blog a few years back and I've loved you ever since! Thanks for being an inspiration 😘 oh and for making the first bikini I could actually wear 😂👙", "elenalipsiea": "Love. Myself. My body. My story. My truth. Love. Others. Their souls. Their pain. Their beauty. Their difference. Above all love. @gabifresh thank you for being a gorgeous embodiment of love. ❤️ May I have the courage and the wisdom to shape my own life with such an intention.", "outsidebonez": "Your fashion is incredible. I love your look. You're such an amazing inspiration! Some day I hope to be on your level 😙", "flor_de_alcatraz": "Happy holidays! @gabifresh this is what the holidays are about. Giving and giving with love. 🎄🎁👼", "ashers_in_the_city": "Today I was tired, but made it to gym. Love wrapping up my day right with a good workout! 💪🏾💪🏾", "chelsea.carey": "Literally so nice 😩😍", "wifeagirlthatcooks": "One day I followed @nadiaaboulhosn and felt overwhelmed with her message and how easily she existed in her truest form ...and one day you popped up on her page (ass shelf) and snap chat and I felt that same gravity towards you. You just remind me that social media isn't all bad and daily I'm reminded through you both to continue to be my truest self no matter the opinions people will force upon you. So...Thanks I know it's never easy to make your private life public...the proof that you change people's lives through sharing all of you is 👆🏽👇🏽👈🏽👉🏽🙌🏽", "jeraldinaa": "Thanks Gabs for giving away money 🙌 you're the bomb dot com. I'm a relatively new follower so I don't know your journey. I saw some really cool looking swimwear on S4A and saw your picture and link. That's pretty bad ass. I love that you worked so hard to be where you are by doing what you love and being unapologetically you. You've inspired many girls to not be ashamed of their size.", "andrewthegirl": "@gabifresh I can't believe you would be so generous, it truly speaks volumes to who you are as a person IN REAL LIFE! I've been checking out your blog for years now and you have inspired me to love myself for who I am, but today you have inspired me to pay it forward! Thank you for reminding us, especially in a season where it's seems people are only concerned about what they get, that giving is the key. 💖💖💖", "thezoechien": "Gabi, your blog and insta combine two of my greatest loves: fashion and body positivity. Thanks for the inspiration! ✨👗💖👙"}