{"tinatassels": "so good!!!", "not.your.nigga": "Your weight! It's just so......quantifiable!", "ytrayo": "Nice!!!", "pettydd": "❤️❤️❤️", "curadadeespanto00": "You look great!!", "moodexchangetoy": "Let me say it for u... fuck em!", "jjcpix": "JLo wore that dress like an amateur compared to you", "anescanlon": "Dress us gorgeous & so are you!", "let_them_eat_cake27": "Wow it's funny how ppl talk about body shaming yet if you had in fact lost weight folks would shame u for that! Sad.", "miss_hoyos86": "Loveeee this", "marketolog_alina": "Cool 💃🏻💯👍🏻", "daniellalopezxo": "Where is this dress from!! You look amazing!! 😍", "cheacas": "Rocking it, looks awesome like jlo. Really impressed you were able to find the material to make the dress. You go!!!", "colleen_ann": "Slaying!!!", "sprinklenosebunnybutt": "✨🙌✨", "garcial85": "You look beautiful ❤️", "thetravelingstorier": "And if you did loose weight or edited your photo so what?!!! Do you girl!", "therealbrittanyshow": "Love It! Keep doing what you're doing babe ❤️", "embellished_dame": "It's amazing how ppls like to spend so much time concentrating and analyzing other people. Hater gon hate! Do you girl! Your awesome! #bodypos", "iseetrina": "Gabi! This is 🔥🔥🔥", "angelamermaid": "You're beautiful.", "erikas_kloset": "Love it!!!!", "sheismela": "❤", "denissev__": "Why am I just seeing this pic though?!!!! Love it !!!!!! 😍😍😍😍 This is awesome!!!! Also... I always thought I was the only one who thought it was rude for people to say horrraayyyy you're losing weight ... unless I publicly announce that I work out etc.. people should really mind their business. I have friends who have lost weight due to an illness etc .. or depresssion .. so to glorify weight loss (especially if it's clear that I'm body positive) it's just BS. I'm like ok 😒.. I'm just saddened that people can't just embrace themselves or others as they are. Watch me.. don't watch my weight!! Lol anywayssss def love this .. continue being fabuloussss as always !!!!", "melharaja": "You're amazing with the shit every year. 🙌🏾", "madeupbrightside": "Yep!!! You rock.", "kurvykatie": "Uugghh people are fucking stupid. This is a dope ass pic.", "madamkisot": "I cant recogze ypu in long hairs 😂", "elisa.asare": "Amazing costume!!!! JLo for the win!", "comesailawaywithlee": "Love!! 😍", "thoughtiebynature": "I'm so sick of you having to explain yourself to these people! Ugh! Like, jobs will really fill that empty time they have to come to your page.", "b_squared312": "Sooo cute! I love JLo and love your style chica! 😍", "ras_shady7": "https://www.instagram.com/p/BL-Exv4hvHr/", "yalina_m_": "You look amazing and on point. Some people are just mean because they're unhappy with themselves. You keep shining!", "_phenx": "Every single thing about you is gorgeous", "pelitosrojos1": "Fuck the haters", "itsbreezybaby1": "@enilove2 she nailed it.", "hellokeila": "Look at you out here slayin.", "catherine_144": "Where is P. DIddy?", "pola_weber_wong": "😍", "fayazali_khan": "Nice", "finessecurves314": "Dope!! Nailed it!", "fundamentallyme": "@gabifresh im not justifying anyones comments and I think you look amazing. Definitely that JLo flow 😋😋😍😍😘😘. What I will say for myself is that it gets super frustrating when I finally see a woman of my size or closely representing me and then all of a sudden after notariety she bellows to what I consider the pressures of \"fame\" or maybe its the financial benefits of having access to those weight loss options and then ends up being this woman I can no longer see myself in. Its disheartening for those of us who follow those women. We can all be plus size and healthy but what happens is instead we end up getting skinny and \"healthy\" which changes the views. I DO NOT SUPPORT IGNORANCE ON ANYWAY THOUGH. #justmyperspective", "dawniemarie": "But where did you find the exact dress Gabi?!?! Ahhhh this is greatttttt", "elisalouisemeow": "I love this so much! You look so amazing! #gabifromtheblock", "colleensullivan12": "You have the BEST Halloween costume ideas!!", "laureshane": "@dwinlok but isnt it just a wig for her halloween costume", "glamsamiam": "You better do that doll!!!! 😍🙌🏽👍🏽👊🏽", "amandavirginiao": "@gabifresh i'm from brasil sorry my english. I admire u soooo much. Think u funny, gorgeus, beautiful, perfect. i am a writer and i have a book tha i wrote is all about u. Janine is the name of the girl. Is just like u amazing and inspirate. Just sayng in Brasil u have many many peoples who loves u. Very much. And i am one of theses", "merchy76": "@gabifresh People should mind their own business, you look stunning anyway... 😉", "bellatatyana_": "Haters gon hate.", "curvily": "You look amazing!", "karennnnd": "Either way YOU ARE BEAUTIFUL!!!", "_tassiamarcondes": "@tabatamarcondes", "_marcimarcimarci": "You won Halloween! Everyone go home! Lol you look amazing and you killed this costume!", "astaibmouna": "@gabifresh you are sexy 💃 love your dress i think is Versace ? Love you from morocco ❤️️", "_jazzyat_": "I live for this!!!!", "briellena": "Such a cool idea!!", "royalanointedapparel": "Didn't Jlo have a dress like this?", "simoneoliveraraujo": "People are crazy! U look bomb!!!", "mara_iara": "@gdeboneire the lyrics, the do, the grammy, and the damn tropical cleave window dress, and nada, huh? 🚫 🔎 😂 😂", "nancydali94": "Touché", "bellissimaforza": "@yerba.negra on point!", "beccabot89": "Omg, I love your costume! Genius!", "ibrittanica": "@gabifresh Don't even pay attention to these haters tryna dull your shine, boo. Just keep slayin like you do. 😘", "marylambertsing\nVerified": "Verified", "natkingkole89": "@pinkpiratecow loving all these throwback pop culture costumes", "jessicagiugovaz": "@angelaquintinho @jocelynquintinho", "deborahcruzdiaz1985": "You look great! Where did you get the dress 👗? @gabifresh", "lpjallai": "Boobies on fleek. Werk👏", "teresa_sarona": "Slaying!!! Love it!!!❤️", "miatheboss": "❤️❤️❤️❤️❤️❤️❤️", "pinkthaichai": "This is such a great costume, you did once again 😍😍😍 @gabifresh", "evelily9": "Flyyyyyyy 😍😍😍", "casey_vee": "Is no one gonna talk about how realistic this Grammy looks?? I mean creativity at its finest! Lol!", "tatianainsf": "@_jackysface i wish i had no party lol", "butlikemaybe\nVerified": "Verified", "stephania_photography": "😘😘😘", "peruvianjew": "@itsvalerious omg yesssss", "keshiacorbin": "You bomb AF!", "msjerrice": "🔥🔥🔥🔥💣💣💣💣", "garnerstyle\nVerified": "Verified", "prettyandperched": "@gabifresh you are so dope! I was thinking about your hair and boobies. I almost didn't recognize you with straight hair. Outside of that, regarding the overall costume, you get a yessss bish yessssss😝", "destined11": "Werk, werk, werk, werk, werk (in my Rihanna voice).....you absolutely rocked that fit!", "_pinchemonica_": "Damn girllll 🔥🔥", "beccalovelove": "@gabifresh I love the Grammy prop!", "paleobosslady": "So proud of you & your message", "cutecreepycrap": "@tatianainsf you should of done this lol", "ziedarling": "Brilliant costume!! And that dress is 💕", "californikkation": "@ohirms YES 💯✊🏾", "gabifresh\nVerified": "Verified", "elyserenae26": "Well done!! Best costume of yours yet!! 🔥👏❤🕯😚💛", "tiffloveswords": "Such a great costume! Haha I'm still obsessed with Waiting for Tonight...whooah.", "alaurice": "Yaaaassss", "aureliethionville": "We love you the way you are. @gabifresh 💋💋", "itsdjmary": "@gabifresh thank you for that caption! So many people think that social media is a free invitation to comment on the parts of us that are most personal - our bodies. Love the costume!", "pshuckleberry": "Werk werk werk werk werk, I hope my chest holds a dress like that!", "lilmrsdoubtfire": "You always kill it for Halloween!", "potsiec": "You look flawless!", "frauleinaudrey": "You are amazing. Seriously, Halloween royalty every year. 👑", "yoni_dw": "Love the dress!", "misterlawson": "Diddy gonna propose. I feel it", "officiallynicol": "😍😍😍😍😍", "meanmeanrachelfrie": "@ms.ericamorales love this!", "ohirms": "This whole page/pic but also this caption is 💯 @californikkation", "cachy_mhm": "Girl you're killing it, haters gon' hate. Who cares what others think fuck that and do you!", "mjwonder": "@chocolatecoveredasian yaasssss I love this so much!", "chels1676": "@gabifresh you look AMAZING!!!! You rocked this @jlo look", "lucy.a.branco": "Somethin is up with bottom of this dress, zoom in, this pic was definitely retouched, sorry", "lexofhearts": "Such a great costume!!!", "cheyy_b": "@rose_sena18 I saw this last night and I was amazeddd 😍slay all day", "mefabulouskc": "@sheshanti I'm about to be about it tomorrow lol. My 18 yr old niece is visiting and I'm like, do you know how to duck tape boobs? ✔", "meaghanpoconnor": "THIS IS SO DAMN GOODDDDDDDD!!!", "sharpie57": "You look beautiful.", "rose_sena18": "@cheyy_b this is amazing", "daisyxchainsaw": "Your weight isn't their biz anyway. Great costume you look killer. So sexy!!", "hollysturgeonofficial": "Images*. Ps - well said gab!xx", "sheshanti": "@gabifresh @mefabulouskc I thought the same thing when I saw the photo. What kind of undergarments are you wearing to keep the girls in check? I have a feeling NO amount of duct tape keep mine stable 😂 Fabulous costume!!", "megs12_12": "Amazing costume!!!! 👍👍👍", "lockwoodkai": "You look fresh and alluring 😘", "tanyanickle": "Awesome costume idea @gabifresh can I borrow it ;)", "kaelahumphries": "You look amazing!!! I love the dress🙌🙌🙌", "bluth_ish": "Omg yaaassss!!!!", "mochaliciousjane": "I love this", "mrsericay": "Killing it! Looking great"}