{"sympleeche": "These suits are everything!!!!!!", "sohostadity_": "I remember this blog post like yesterday 😩😂 Wow 7yrs ago 🤦🏾‍♀️where's time but thanks for this Great Journey 💁🏽", "princesskatrinalove": "@karalinagurl her story is awesome! I must admit I'm a fan. It pays to be different!", "karry_b": "Wow congratulation so happy and proud of you.", "cr_spady": "@jusresults look at this one", "chariiiiiiiiiii": "I remember showing these pics to my girlfriends. It empowered me to see you be so fearless. It was refreshing then and still is. Thank you for inspiring. 💕✨", "abigailcanelaa": "@ketkatz", "smiley_theoriginal": "Can you please bring back that pink swimsuit just have to have it.", "ny3224": "@lynaya_k ^^", "betuldems": "@elyaself j'me rappelle des photos là sur son blog comme si c'était hier", "iijuswannasing": "@dsbydwanshantae", "lovemarik": "Bad bitch story for the win. Yes!", "handmedown_genes": "That is a life changing story!! I can't even imagine the struggle you went through before and then sense of accomplishment for changing an entire industry to be more welcoming of size and body shape. I'm a size 36D bra and it's still hard for me to find clothes that fit right and bras that are comfortable. Size Large for bralettes in stores like H&M or XX1 usually aren't big enough but I also am too small for plus size bralettes. I'm a strange in between! 😆", "claud_n": "Thanks to you it is going to be my third summer with my bikini :) i am still looking for a hot pink one maybe for your next collection you should cone out with the original hot pink one :)", "heavens_property": ",,*", "lessliecaro": "I love you girl!!!! You're awesome 👏 💕✨✨", "trinipastelles": "😍😍", "_amberdion_": "@threadest", "plumdiva": "All I want is this black bathing suit she is giving life....", "lovemsbianca": "Im still crushing on that bikini from 7 years ago!!!! My favorite color and all. 😍💞💕💖", "calidreamtravel": "I remember this picture! And being like wow what a babe! Congrats on everything!!", "movewithambre": "👍", "ny_rm78": "@katedossiersecret", "ayarimarie": "@betzalie.adriana gorgeous and i want them!!!!", "valel.e": "@dany_marquezr ella vende!!", "south_key901": "Muva👠👠", "mailob_": "Such an inspiration. Im from argentina and they are all in one colour. Your designs are beautiful", "thecurvystylist": "So so awesome!! #proud #importedfromDetroit", "brb_onvacation": "@smileatmybeauty check this page out", "vltorrey": "@bittyboop", "nikitaontheinternet": "Ur such an icon proud to know u", "ellevalera": "Reading this literally gave me shivers. #achangegoncome THANK YOU from all of us curvy girls!! 🙏🏼", "givemekisses": "Yasssssssss", "honorcurves": "Your suits are beyond amazing. And you are such a style icon. So thankful for you.", "portlandbellejay": "This is the picture that made me wear a bikini for the first time in my adult life x", "amira320": "So major. Congrats!!", "anukwublessingcibori": "Good day pretty angel am prince blessing,please chat me lets get to know better as I seek away of seeing you. Please reply me", "zulefernandez": "BRAVO!!👏👏👏👏👏", "econlibra": "Thanks for remaining faithful to your dream and having they ultimate confidence to push through when others closed/ said no", "danielleshelilevy": "@morganmodica @sadgirlphoto69 omg did you see this?", "yourfriendmyra": "Loving ourselves, as we are now, is both rebellion and revolution. Thank you @gabifresh for showing us the way. Can't wait for part 2! @swimsuitsforall", "pammybcakes": "Congrats!", "globalmindsetlifestyle": "I remember this", "lpjallai": "Apparently industry people think they know everything and never do. Time for new people in those industries.", "dbc_models_events": "Hi!! We hold Events for fashion designers and find work for curvy models follow us & email us we'd love to bring a pop up shop to Philly 👙👠👢👚👜👗👑", "valleyskyy": "Yes ma'am!!'n", "curvyrocks": "So so so proud of you!!", "alongthekurve": "Brava beautiful 🙌🏽👌🏽🤛🏽🤘🏽👏🏽👏🏽🎊🎉💣", "williraj": "Congratulations! That's awesome news. And congrats! @gabifresh for making this list. http://www.instyle.com/reviews-coverage/social-media/body-positive-influencers-instagram-follow", "eclecticmeagan": "I love your confidence!", "kkevin1970": "Wow congratulations", "musicgal1989": "Hi would like to ask where do you buy bikins like that im from the Philippines and can't find bikinis for my size 😥 thanks", "lydybear": "Yaaas you are #1!!", "nataliesanders": "You literally changed my life!! Thank youuuu!!", "margedtrumper": "thanks to you I discovered a bikini for me at 38 and own 2 of these and many others (now I have a sorte of mad nessuno though haha)", "angelams1019": "Awwww That picture in the pink bikini was the first picture I ever saw of you (and the moment my girl crush began!)", "solangefranklin\nVerified": "Verified", "lacenleopard": "This is so awesome! Congratulations! I remember you posting my picture on Good Day New York in my bikini during this time 💕💕 That was one of the most awesome moments for me. I appreciate you and all that you do in the plus size community. You are truly an inspiration!", "itmustbebunnies": "I still remember discovering your first line of bikinis. Never would I go swimming with friends or to the beach and now I wear a fatkini around for fun. You changed my life! 💖", "cocodreamee": "These are gorg. Maybe I should just try one on...and just see...but you, you NEED to get one asap!! You would be sexy for ya self!! Lol @systahgirl7", "socalcharles": "Wow what a great story and congrats on your success. I love following people like you on IG.", "lovelyinla": "Congrats on Nordstrom that's a big deal 🙌🏻🔥🔥🔥", "frankietavares": "Salute to you! Always an inspiration!", "trendsettersince83": "Wow congrats!!!🎉", "calliethorpe\nVerified": "Verified", "oaklandtoindy": "Amazing....congrats!", "lovechucktaylors": "@gabifresh you are an inspiration! I tried to find your contact info I want to send you some of my custom Converse shoe collection! Please dm me!", "lovesoorgasmic": "@gabifresh I really love your designs because as a big girl I went through the same struggle and had to settle for basic swimwear with absolutely no support! Thank you for your beautiful collections, I bought one of your swimsuits today for the first time and I can't wait til it arrives! 😍💖", "itscool2btrue": "babe 🔥👙💖", "eugiseleluz": "", "sydneyscloset": "💣🐚", "sheilalomonaco": "just fantastic 👏🏽👏🏽", "jessicarenee83": "I own the one in your 5th photo and receive endless compliments. I lovingly call it my fatkini. ✌🏾", "donnagmarie": "Love mine from ssfa!!! You've created an amazing line!!", "ej.obertthorn": "YOURE SO BEAUTIFUL SLAY MY LIFE", "frecklefacedgoddess": "Loveee 😍❤", "ayeblood": "Years ago I was planning a trip to Vegas and saw your fashion blog and seeing that galaxy bikini, I HAD to have it! Of course it was sold out. I ended up getting just a regular black one piece. The next year I went to Vegas again and pre planned. I purchased the colorful tribal print swimsuit and I was in love! You make fantastic pieces and I am so happy to hear the good news! That photo shoot is where I fell in love with you and @nadiaaboulhosn !!", "missjeewelz": "I just saw a #GabiFresh @nordstrom!! Congratulations!! 🎈🍾", "meg.cantwell": "Hey Gabi! I have admired you for so long and I'm happy to see you breaking into a mainstream market with your suits... I was late night shopping (because, what else is there to do when you can't sleep?) and I noticed that Nordstrom's swimsuit images are HORRIBLY photoshopped to make the model appear thinner. Can you please reach out to them? Plus size women have enough going through our heads when we bathing suit shop. Comparing our bodies to that of a photoshopped woman shouldn't ever have to be a concern.", "just.a.lovah": "Great photos", "mbr_25": "Thanks Gabbi! Will be heading to Nordstrom soon. Last summer you inspired this sz24 40 year old to rock a 2 piece for the first time since I was 7! No going back now! Thanks for paving the way!!!!!!!", "jzoluv": "I still remember when all of this started. I bought the Monif C Sao Paulo Leopard print bandeau bikini because of you. I rocked that 2 piece everywhere I went. It's still sitting in my drawer waiting for summer 🔥 Thank you so much for creating your collection and standing up for what you believed in and giving me he confidence to say fuck it to all the haters ✌✌✌", "calypsogyrl": "Congrats to you for taking the initiative. I teared up reading this.", "honeybomb": "YAS QUEEN. You changed my own thoughts about being a plus size woman. You've inspired me forever. 😘", "theblolzzz": "Thank you! Just thank you!", "ch_anna_m": "SLAY GIRLS SLAY 😍❤", "notaflaca": "Still want the galaxy suit", "its_tha_t": "✊🏽", "clairefountaine": "You're amazing! Love everything you do! 👐👐", "viatunisia": "that's amazing. congratulations Gaby!", "rachael_glory": "😍", "gabifresh\nVerified": "Verified", "basicallynita": "YAS!!! Congratulations!!!!", "tnoelle09": "This just brought tears to my eyes. THANK YOU FOR WHAT YOU DO!", "diia_moha": "@queen.israa", "niaboo": "@iamsqa she changed the game !", "i.am.keisha.eveyon": "Congratulations!", "omphibear": "Freaking amazing!!! You inspire so many of us!! I hope to meet you one day! ❤🙏🏾 Would love to pick your brain!", "emmisnicker": "Yey so amazing Gabi!! 💕✨", "literarynerd": "I have to tell you that the article included in these photos changed my life. I was at work and I received an order of padlocks, when I unpacked them they had used newspaper to pad the box. Amongst the crumpled up papers was the article on the rise of the fatkini, it caught my eye and I took it home. It opened up my world to a new variety of not only bathing suit options (I ordered one that night) but also to plus size fashion and body positivity in general. Thank you for what you did.", "antinousxwild": "so so proud. thank you so much 😭💕", "favoredmoments": "Congratulations Gabi!!!", "commonsgirl01": "BRAVO @gabifresh Keep pushin'!", "lenetteranger": "Yay Gabi, I have the two piece palm print bikini. Love you.", "blancasanders": "Love this story ❤", "fiercelivingmomma": "Werq!", "jadessugar": "Dope 👏👏👏👏", "gregtodanderson": "Your cute", "lizmurph_": "Can you please make high waisted cheeky bottoms next? :) very hard to find.", "fayedaniels": "Get it! #bosslady", "adventuresofll": "This is awesome I absolutely 💖 it", "hillarymariefox": "Thank you for kicking off the revolution. I spent the month of September last year at the beach and had so many wonderful options from swimsuitsforall to keep me looking sexy as hell. I took photos and posted to Instagram and Facebook because I'm no longer ashamed to be me, curvy, and in a bikini. My actions even inspired some of my Facebook friends to go buy some suits because of my posts. Bravery brings beautiful results. ❤️", "skrrt_steak": "Couldn't love this more. You are changing the world, girl!!", "kldub_dfdub": "Way to go @gabifresh !! You are an inspiration to me!", "garnerstyle\nVerified": "Verified", "danawantsablog_": "Time flies. I remember this picture. Beautiful!", "jackie_p__": "Thank you for sparking such a light, Gabi.", "charisse.kenion": "Yes! This is how you make a difference", "demalliek": "👏🏼👏🏼👏🏼👏🏼", "whycomekass": "That cactus print... I need!", "stefaniejaynestout": "YAAASSS. THIS! I can't tell you how many \"fatkinis\" I own now. Thank you for giving us bigger girls confidence pool and beach side. Keep doing you, it's working for all of us. 👌🏽💁🏻💋", "melroseee": "I remember discovering your blog and having a revelation that fat and beautiful were not mutually exclusive. I credit you with my body positivity awakening and finally figuring out how to love myself. And of course, helping me figure out how/where to shop! Because of you I have a drawer full of beautiful swimsuits that I love to wear. Thanks for everything and keep on slaying it. 🙌😘", "jillianaustin": "Im so proud of you!!!", "curiousmagpiebydesign": "Epic 👑 x @gabifresh", "iamstaceygee": "We have come a long way indeed. Thank you Gabi 💓", "mizwoochic": "Congratulations Gabi! I remember discovering and loving your blog when it was called Young Black & Fat! Thank you for being a fearless trailblazer🙌🏾🙌🏾🙌🏾", "hadyouatsalaam": "Gabi I'm so proud of you!!!!!!!!!!", "shivkumar2990": "Sexy", "amandareow": "I made a post about this when I went shopping for a bikini at Target and I was sooo disappointed that nothing would fit properly. I am so glad you are helping this movement and are such a beautiful part of it. Thankyou 💕💕", "ms.sheresejackson": "Congrats on your journey of success!!!", "jamusxxoo": "@lexi_licious91 😍 swipe", "stephydmarie": "Congrats @gabifresh !! So glad to work for a company that stays relevant in ALL sizes of fashion!", "b_squared312": "Congrats girl!! Been following you since your VJay days with MTV and totally love your swag! Love that you keep it popping for the thick girls! 😍🤗", "lizwilartstyle": "Great swim suit girl!!!!", "justnancyg": "@sunflowerfields__ what a great caption , #happygirlsday", "mexicojane": "Thank you!!!", "nnenna_marlene": "Amen! Look at God!!😍💜🙏", "tsholothreads": "Stunning 😍", "alexisgriggs": "I LOVE THIS 😍😍😍😍😍 So happy to see your collection being sold at @Nordstrom now. That is AMAZING.", "femigirlx": "It always seems impossible till it done, well on your achievement. You rock😘😘😘", "jubastosju": "U slayyy", "soopgoddess": "Congrats love!!!!", "not.the.average.girl": "Amazing! Congrats to you and all in the industry who work hard to accomplish equality!", "sperit32": "Amazing!!!That's do dope😉", "patoyamarie_designer_model": "Congratulations Gabi you deserve it!", "miss_prisssy": "I used to be one of those girls who settled and I had 2 one piece swimsuits and i would wash them in the sink on vacation. Now I have those plus Eight bikinis!! Thanks for getting it started!", "summerose": "So amazing, it's been wonderful to see you bloom from all these years! Blessings, many more years of success and love to come! ✨💗", "finky51": "I love my @gabifresh bikini! It's the first I've had in my adult life and it's amazing! It makes me feel like a Bond girl!", "sequoyadakota": "i remember when you got yours!! 😍 @niaboo", "sheeshbri": "It's been so amazing to watch the snowball effect! I've been a follower from the very beginning and you're a true inspiration to women and girls of all shapes, sizes, age and color. You're phenomenal! Thank you for all that you have done and continue to do!", "misslissted": "I remember that ZigZag suit and thought to myself \"Now THAT is a gorgeous woman.\" Well done!!", "bochxx": "@davina_yego just see 😭😭😭. All the pictures aki", "d.ianale": "Holy crap, this is incredible!!!!", "cakeandsequins": "@mzbestrong @jaingerous_313", "monifcplussizes": "@gabifresh 😍😍😍😍 congrats love!", "labellanani": "Get it @gabifresh", "noiglauren": "@kamrynimani Ummm 😍😍😍😍 these are perfect 👌🏼", "therealjoynash\nVerified": "Verified", "sylvia.wakana": "You go girl. You inspire me every day. ❤ Miss you and hope to see you sometime! Let's grab food?", "sunshinejar": "You're amazing!!", "anishasud": "Amazing girl!!!! What a huge accomplishment!", "missmollydollygoldstein": "And you created a revolution 😄😍😍", "grantlbee61": "Congrats Gabi!!!!!", "msvashionista": "@littlemsjetsetter 😍😍😍😍", "mali_the_5_footer": "Congratulations! You are a trailblazer 😘", "kizzykizzy26": "I still want and love the Galaxy print bathing suit with mesh panels I wish I could get a right now cuz I would get it.", "currentlyworking": "Amazing. Well done!!!", "dollieshunaa": "Congrats Gabbbbi❤️", "1800tryf8th": "💜💜💜💜", "issaraeof_ny": "Tears in my eye. So beautiful!", "whoistanja": "Crazy!!! Congratulations girl you deserve it. You definitely changed the way I looked at swimsuits - thank you!", "sofancy513": "@ms_carter_24", "mz_brox": "@hoggs_41510", "karen.tl": "This is what a plus size model looks like.....not Ashley Graham!", "lookingthroughhercloset": "Amazing! You go girl", "shabbyyetchic": "I looove this. I wish you made tops in bigger cups for smaller backs ! I am a 8-10 but wear an f/g cup. It's so hard to find suits and I so looooooooove love love your stuff ! You are a queen, keep slayin !", "nama.stay.ready": "Just wish i didnt have stretch marks 😢", "iamlilry": "W!!", "divine_qinc": "Super great! Ordering tomorrow. Thank you. (Tips hat)", "mogprof": "Yet another reason to love @Nordstroms", "alexmbateau": "Proud of you", "tershie2": "@gabifresh Please consider making these gorgeous swimsuits in smaller cup sizes. Not all plus size girls have a C or bigger cup size!!!", "thesassypeach": "Congrats Gabi! So amazing!! 🙌🏾🙌🏾", "shoesaremydrug": "This is so huge!!!!! Been following you forever and couldn't be more proud. Get them coins girl! Congratulations!!!!🎉🎉", "judy25saywhat": "@gabifresh amazing story , I love your drive and Thank you for your fabulous bikinis I own several of your collection and the fit me perfectly . Finally Someone who understand plus size and curvy women ❤❤ can't wait for your next collection 🙌🏾🙌🏾🙌🏾", "amberiman91": "You are more than amazing!!", "hayleylovesdonuts": "Adorable!! Great color", "kue_williams_esq_": "@Leeann.sims", "lauren_conlon_": "Yes!!!!!!🎉🍾🔥", "modern_demeter": "🙌🏼Thank you 👍🏼", "steffyfullstyle": "DOPE!", "atul_gohel_dt": "📷📸🙏🏼", "marlaegarcia": "Gabi you're such an inspiration! 🙌🏻🙌🏻", "prettyeyesandthickthighs": "@caileentherese i need a better one", "leeann.sims": "I love her @kue_williams_esq_", "fitisgoals": "Yesssss! I love your swimsuits 💕", "seli1004": "I wish they made plus sized bikinis for women who have smaller breast", "tweevalleyhigh": "You gave me \"permission\" to wear a bikini. It never crossed my mind that I was \"allowed to.\" Society makes you think ridiculous things sometimes.", "simply_sharhonda": "Loveeeee this! Soooo dope @_c.nicolee", "clowe721": "You're such an inspiration 🙌🏽🙌🏽🙌🏽", "happylovingperson": "Awesome!!!", "chamayne": "#BLACKGIRLMAGIC", "katyjoeidaho": "Yes yes yes! Get it girl! As a plus size gal, I remember that first bikini pic you posted. It helped me feel more confident about my self, and clearly, lost of other gorgeous and fabulous women. Rock on 👑", "randi.rose": "I have the galaxy bikini! It made my summer that year! Thank You! 💖💫", "coverme_upp": "✨happiest vibes here✨", "sarahkkhan": "You look gorgeous!", "doll_1972": "Love swimsuits4all...been buying swimsuits from them for years...they are cute and great quality", "marymacn": "Go girl!!! So awesome 😍", "shawneeo": "Congrats!! 😍", "angelfacemua": "Amazing, @gabifresh!!! Congrats to You!!! ❣❣❣", "realtygoddess": "Purely Gorgeous!!!!", "kstraker2014": "Beautiful 💞💞💞💞", "gso326": "Great just wished your suits came in B-cup! @gabifresh !", "chouette_style": "I am SOOOO EXCITED!! I can't wait to sell your suits to my customers, and rock one myself! Congrats, you deserve all of this 🙌🏼👙", "the_real_cantankerous": "Now that my friends is a movement!", "patty_keen": "@gabifresh my sister from another mister! Finally someone knows what I want in a bathing suit.", "stellanoogallc": "Great workㅡ👀 +sizes are getting more #streetcred cause of u😎", "libertyfennell": "👏🏻👏🏻👏🏻", "mrsjqbinion": "Beautiful 😍", "taranicki": "YEEESSSS! This is awesome! I love a 2 piece because everybody top is not the same as the bottom. Koodoos to you. Continue on ur blessed journey👏🏾😃", "cassattack2e": "@gabifresh congrats, girl! So happy for you and your success. It has been so fun watching you progress and wearing your suits throughout the years. Keep killing it!", "therealmichelleramirez": "CONGRATULATIONS ON YOUR SUCCESS! !! #Day1stan", "thereclaimed": "Thanks so much for being bold enough to wear one! Definitely inspired me to try it this year!", "carrae07": "Thank you!!!", "bunnzinaaa": "I needs!!!", "werenotcrazyorg": "just bought my first gabi fresh bikini last week!", "mamarose928": "@patty.cakes319 love love ❤️", "shaydee_k": "Love this! You're amazing!", "4c_hairstyles": "You've lost some weight! The bikini suits you well.", "briebines": "Ohh shit you in Nordstrom's Ivanka can't event get back in that bitch 😂 Yassss Queen!!", "mmy.maria": "🙌🏽🙌🏽🙌🏽🙌🏽", "shaxxon": "And thank you so much! I wore my first bikini ever because of you. Confidence is at an all-time high. Please do another collection next year! 🙌👑👑👑", "stacymichelle": "😭😭😭😭😭💕💕💕💕💕💕💕", "bettyreads": "Wooooo!", "kristinajaniece": "Congrats!!! So happy for you! And so happy I got to watch your journey from beginning !", "beautifullymade2010": "Work it girl! Super cute", "dinopebbles": "Congrats!!", "laschleesh": "You are a QUEEN! 👑 I wore your Midnight Zipper suit in Cabo last week and I LOVED how it made me feel!", "bidajuice": "Congratulations", "neilybad_": "Yassss Gabiiiii", "lovebrownsugar\nVerified": "Verified", "nvhxesq": "Congratulations!! 🍾", "thekristawhite": "Yassssssss", "ashleygraham\nVerified": "Verified", "kabesgotinsta": "Could not be more proud of you!", "gabbyheinzz": "Congrats, what a movement you helped created for plus size women!💛👏🏽", "freeblackgirl": "Go @gabifresh! You gave me and so many women the confidence to wear bikinis. ❤", "morgan_eldon86": "THANK YOU FOR ALL YOU DO!! 😭🙌❤🍹🌴👙", "curvily": "YES Gabi!!! I have a suit from every collection, and it's been major for me to have these options. Nordstrom is going to take it to a new audience - so exciting!!", "kingkandake": "I'm not plus sized, but I wore my first bikini because of your blog posts. I aspired to be ballet dancer as a kid and spending all that time in front of mirrors gave me some pretty intense body image issues. Fast forward to 2014 when I bought my first bikini for my month long stay in Cuba. I thought it would be easier to be brave if I were outside the country. I chose a high waisted piece that went with the whole 50s vibe of the vintage cars in Cuba. It was great! Last year, I wore my first string bikini. Because of you, I decided that I wasn't going to wait to be perfect to enjoy my body and love the skin I'm in. Thank you so much for being so inspiring! You really are a pioneer!", "smooothjas": "Omg that black is everything!!!!!!", "bluth_ish": "👏👏👏👏👏👏👏", "lynnhoutaha": "👌🏼❤️️ the fuscha", "saraluke25": "You posting these bikini pictures literally changed my life. You made me realize my dream of wearing a bikini (which seemed more like a far off fantasy) was totally possible. And finally buying a bikini changed my confidence for good. Thank you for everything.", "allison_says": "@gabifresh, I am so proud of you and everything you have accomplished! So glad to be able to say I knew you back when! 😂", "syrod80": "YASSSS🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "fashionmeetscurves": "Amazing! 🙌🏻", "clcruz1010": "Congrats! What an inspiration.", "maddbanker": "Congratulations!", "k__extraordinaire": "Congrats Gabby. Been following your blog for yearsssss!!", "ena.angeline": "Now THAT is a testimony!! Congratulations girl, you deserve all of this!", "nad.nats": "Right on! What an inspiration. Get it girlfriend!", "rachael_dundas": "Yaaas girl! You're the first plus size blogger I looked up to. You changed my life, keep doing your thang☺️💗", "i_amchelle": "Great story!!!👊👌", "akelsick": "What an inspiration! Thank you @gabifresh ❤️✨❤️✨👏🏼👏🏼", "mdaipageant": "Yaaaaassss Queen YAAAAASSSS beautiful Thickum @gabifresh", "_lelyh_": "Thankyou for making a change 👏🏽💪🏽🙌🏾😁", "stylenbeautydoc\nVerified": "Verified", "zeebr.wn": "😭😭😭😭👏👏👏👏", "midwestlolita": "Congrats!!!!! I've been following you since day one. So proud of your progress!!", "haleygee_": "reading that caption almost made me tear up! Amazing girlfriend 💕", "memoirofkiki": "Queen 👏🏾❤", "missbertie": "That is awesome!!! Go gabi!!!! @gabifresh you just inspired me to my core!!!!!!", "flowerhitsthebigtime": "Obsessed with that suit. Pretty in pink!! 💛💖✨", "ashmichelle.c": "Whoaaaaa! Nordies? That's a big deal! Uhh, you didn't mention how other retailers began copying your designs (poorly). Happy for you. Been a fan and follower since just randomly seeing another cute curly girl on Tumblr.", "anthonvodden": "Yaaaaas I remember me and Callie catching our lives over the monochrome 2 piece pic! Well done doll! You're an inspiration!! X", "unclejemima99": "I remember fangirling ALL THE WAY OUT when that gallery came out. Congrats-so so proud of you!!", "janerarose": "I'm so happy for you, Gabi! Like many others, I've watched your growth and have been inspired by your success -- You deserved allllll of the great things coming your way! 💎💕", "brownbelle": "Yes! Super dope 🙌🏾🙌🏾", "notyourtypical_mayra": "👙👙👓👓😍😍", "latanyapikula": "I love this story! I love that you are pioneer for this! Go girl 💥💥💥💥", "margonista": "Thank you! Great post. Great advocacy. Incredible way to change a market!!", "kimical_rheaction": "Thank you Gabi for being such a trailblazer for the full-figured women! You're truly my idol!! 🙌🙌🙌", "drea.flow": "Congrats Gabi!!! ✨🎉🎉", "thesunniside": "💙💚❤💛💜", "ceceolisa\nVerified": "Verified", "shabbysweetcottage": "WOW! Congratulations", "gypsylovesgemology": "@gabifresh Simply Adorable , thank you for giving women like me courage! 🙌🏼 you know what i mean right? 😘😉😍🌈💅🏽💄", "sunnipics": "That bikini is AWESOME 💖💖💖💖💖", "paleobosslady": "Brava sister 👏🏻😘", "doza8376": "Look @saez_1990 this year I plan on purchasing my first two pieces!", "azu_186": "I AM SO PROUD OF YOU @gabifresh 😭🙌🏽 LOVE YOU SO MUCH IM A STAN!", "dianabeenana": "That black and white bikini is what started it for me. I remember seeing you in it and being in awe. You completely changed the way I felt about my own body and I've been super comfortable in my own skin since. I'm so grateful for you and your confidence Gabi 💙", "dondress": "Hell Yeah!!!", "clarkconquers": "Yasssss", "feemarie_83": "Yes girl yes!!!! ❤👌🏾", "frk.tolstrup": "You look soooooo stunning !! 😍🙌🏼", "sgardnerstyle": "Yaaaaaaay Gabi!! I'm so so so excited for you!!!! Congratulations lady. So very well deserved👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "mischamichel": "SO AMAZING!!!", "sarazucker": "Ugh I love this post so much", "bgi_chickadee": "Great color on you! ⭐️⭐️🔥🔥🔥🔥🔥💥💥💥", "jaazz_3": "Amazing!!! I've been following you forever and this is just amazing! You did my makeover years ago and I am still so grateful for it! Can't wait to see whats up next! ❤", "88molil": "Very inspirational", "thimblepress": "Love this on you girl!", "rshragge": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "anothermarch": "You are an inspiration!", "regiina9": "I'm so proud of you. You are one of my inspiration for love myself. Thanks for all, and you grate evolution inside your heart. Because curves are beautiful forever, but the heart, mind and personality it's more difficult. Thanks 😘😘😘😘😍", "katelyn7610": "I just want to say thank you!! I'm 40 years old and wore my first two piece just this week!! It felt amazing and I wouldn't have done it had I not seen so many positive images of curvy women, rocking them in the last few years!! Keep up the good work and may young girls never have a second thought about wearing whatever the fuck they want!!!!", "vlrwdmr": "Congratulations!!", "tiffany.nicole718": "So proud of you and Thank You for making us look and feel beautiful in our swimwear!!!! Thank You!!!!!!", "lorena__reyna": "BABE. I'll never forget seeing you for the first time on tumblr 😭😭 game changer", "lizzobeeating\nVerified": "Verified", "glamlite\nVerified": "Verified", "_ladybenz15": "This is so nice and tasteful that you for making plus size women feel sexey I never wear a swim suit in my life", "sdelage": "So proud of you! Thank you for being an spokeswoman for us big girls. It's amazing how far the plus size industry has come the last few years because of creative and strong people like you. We appreciate you. It's now a little easier to be a plus size girl who doesn't want to just wear baggy clothing 24/7. Love you girl!", "smramsey1": "❤️❤️❤️❤️", "cocoscurvycloset": "Amazing!!!! 🙌🏽🙌🏽🙌🏽🙌🏽", "powitskim": "It's lit. 🔥", "jauntingjamera": "So dope! Congratulations 🎊", "gabrielaaahhh": "This is fantastic! Love it.", "kwrig12": "@yhtak7 ❤️❤️", "54olivia": "🎉🎉🎉🎉🎉🎉🙌🏽", "my_mothers_shoes": "Congratulations from one Moho to another!", "ncrozay": "Looooovvveee this! Congrats!", "lil.pochaco": "you are incredible. never stop", "petrawantsaflowergarden": "❤ queen", "fresheima": "Is ja his seriously 7 years ago! Wow I remember this picture 😍 and it changed the mindsets of so many fat woman 💞", "jasminn_nicolexo": "CONGRATS !!!!!!! I love your designs", "the8thofjanuary": "@tailormade1980", "themattiejames\nVerified": "Verified", "joannasimkin\nVerified": "Verified", "kjbusybee": "Queen!!!!!!", "ever9577": "Thank you!", "supplechic": "Soooooooooo incredibly proud of you GABI shit I'm emotional 😭😭", "breezee1003": "😍😍😍", "laila__kay": "@gabifresh I have been a follower since your YFF days. It has been amazing to see what you have accomplished!", "sarah.aboulhosn": "CRYING!! so proud at what you've accomplished", "bircharnica": "You had a vision and you rock", "the.lasso.of.truth": "Hell yes!", "sexydredlocs": "Congrats", "robynplusmodel": "Love everything about this ❤", "rdanipear": "AMAZING ❤️❤️❤️❤️❤️❤️", "ari_liah": "I remember this... this was sorta legendary for me!", "madelinewilsonojo": "I remember this photo! still love it.", "parisphotosandwine": "This is amazing. Thank you and to @swimsuitsforall for paving the way and tearing down the walls that were keeping good fashion away from gals like me.", "tishab11": "Amazing ❤️❤️", "twanda_fenise": "Read this! @cocoloveaquari", "nikillakilla": "I still kick myself for not getting that bikini in the 5th pic", "ktms1": "I cried ❤️❤️❤️", "allisonfaxbeauty": "You are such an inspiration, Gabi!!!!", "m4drude": "Omg!!!!! I remember all of these pictures!! Such a major accomplishment. Congratulations and thank you for always being such a gracious and courageous source of inspiration for myself and so many!!! This is incredible", "radiantbeauti27": "Inspiration", "danowensmgmt": "Wow this is actually too much for me.", "gowiththat": "Thank you Gabi! Two years ago was the first time I wore a two piece in my adult life and it's because you gave me a reason to! XOXO 😘", "lucilovegood": "😭😭 happy tears for you!! I've been following you for years and have loved seeing your career grow. You are awesome!", "stickysweetdanish": "You've changed the entire industry, Gabi, and we're all eternally grateful. Congrats on your latest huge achievement ❤👏🏻", "courtforshort2": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "dreyetotallycare": "Been riding with you for years!!! Your post got me thru grad school and continue to provide much outfit inspo!!! Congratulations!", "theexquisitetruth": "Your awesome!!", "curviecrush": "I remember this so clearly! I was blown away. So wonderful 🙌🏼🙌🏼❤", "salamahsaurus": "So gosh darn proud!!! ❤️❤️🙌🏽🙌🏽", "itsbellmade": "Wow. Girl. Just wow. Congrats man.", "itsbrodfresh": "I remember being in high school and having to shop the old lady plus size clothing. Grateful for all the work you put in so we can look as fabulous as we are!", "tamfal": "Amazzzing!!! 👏🏼👏🏼👏🏼 u should be very proud!!", "prettyyoyobrownn": "And we thank you for that!!! Congratulations 💋", "lornalitz\nVerified": "Verified", "rachmakesart": "YOU ARE SUCH AN INSPIRATION ❤️❤️❤️❤️❤️❤️", "meaghanpoconnor": "All. Of. THIS 🙌🏻 So well deserved - congratulations 100 times over girl!", "allison.davisrow": "😭👏🏾👏🏾👏🏾👏🏾", "denisebidot\nVerified": "Verified", "yourcautionarywhale": "I hope \"what's next\" is bikinis for over a size 22/24 because that's even less available than a bikini for a size 14 was 5 years ago, including on swimsuitsforall. Size diversity and inclusion can't and shouldn't stop at a 24.", "aishanikora": "Seriously amazing!! Not only are you an inspiration you have helped this movement become what it is today! Now here's to hoping Australia will take some advice and stock more plus size clothing in our department stores! ❤❤❤", "_es_la_ali": "I have one of ur suits from last season and can't wait to get another. Love all u do 😍", "igobylu": "Wow, congratulations, that is so amazing, and you are soooo deserving of this! Seeing you in a bikini years ago made me realize I didn't have to be a size 2 to wear one, and I could just wear one! I went to Jamaica a few years back, and wore a 2 piece, and felt amazing!!!!! You are everything!❤❤❤👏🏾👏🏾👏🏾", "iamkristinbooker": "OMG GABI! CONGRATS! Girl, set this world on 🔥🔥🔥🔥🔥!!!", "chassidywonders": "❤❤❤", "jojobirfday": "👙💕 🎉", "florezalexander71": "Mmmmm q sexy hermosa mujer linda mmmuuuaa", "ghettofashnista": "Uber proud and I can't wait to wear my swimsuits for all suit in Mexico!", "3thechicway": "Gorgeous!!! @cristalnotcrystal", "_brittany_bradley": "Literally my hero @gabifresh ❤️❤️❤️ I'm glad you are so proud-you should be!", "thebiggerblog": "🙌🏻🙌🏻❤️", "jillmariejillmarie": "Omg yesssss I have the infamous galaxy print still!!!!! I literally almost sold it on eBay because cause I could've made much dollars on the profit. I'm so glad I kept it. I keep it in safe condition for when I need to stunt at the pool/river", "b_h___b": "So proud of you ✨💫", "mrslesliemariel": "🙌🏾👏🏾💋👸🏾", "griselangel": "🙌🏽🙌🏽 #girlpower", "joniquekevilynn": "Daaaammmnnn!!! That's wassup! 👏🏾👏🏾👏🏾👏🏾 thank you & CONGRATS!! 🍾", "treymonet_": "I remember this!! So happy for you!", "vanessatakesphotos": "THIS IS THE BEST! CONGRATS!", "teyahgetslife": "Congratulations!!!", "nobym": "Gorgeous girl!", "lolcoolj": "Yes!!! You are such an inspiration! Thank you for everything you've done for us plus size girls! 🤘", "jenesaisquoithe": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "denita_anne": "So happy with your accomplishment!!!!!!!!! I look up to women with your passion and audacity, you are an inspiration to so many girls.", "j_lopex": "Olha @catapires que lindos", "boomloves": "Wow!! Very inspirational. Love what you're doing!!! 😍🤗", "missalexlarosa": "👏🏾👏🏾👏🏾👏🏾", "jrandyannasmom": "I love your swimsuits they are all beautiful I wish that I had bigger boobs because I can't fit any of the tops. Im plus size but I have small boobs😭", "_lr0chelle_": "Love! Love! Love your awesomeness! Congratulations!", "mlaw812": "You are FIERCE. thank you for bringing sexy back, literally. I bought a bikini from your line 2 years ago - my first two piece since I was about 13 I think? You are an inspiration! 🔥", "brainsquint": "yay gabi!!! i remember that very first pic~ always an inspiration for going for your dreams ✨", "mss_wasabi": "Where i live everybody wear bikinis, no matter what size they are", "kiermellour": "You're amazing girlfriend", "chunkyandfunkymaddie": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "theeshawna": "I have your flamingo two piece and it's freaking fabulous! Thanks for all you do for all the ladies of the world. 👏", "dodgegirl1966": "So stylish. Your rockin that look.", "nickynickienikki3579": "You inspire us all!! Thank you!!", "court8187": "💗 Congrats, Gabi!! So impressive, and such an inspiration, friend. 💗", "juss_chrissyb": "Yessss!!!!! 👏👏👏👏👏👊👊👊", "rp1313\nVerified": "Verified", "kellz_wynnz": "Congratulations @gabifresh 👏👏👏", "camaritadexime": "Aaaaaw, I remember the old posts!", "mahoganydre": "Omg Congrats Gabi!!!!!!!!! 😍😍😍🎉", "homegurlnextdoor": "👏👏👏", "reesa.tree": "@nordstrom makes it too easy to order! Order placed! ✔️ ❤@gabifresh", "nikki.shoppes": "Congrats! Hoping to see bigger cup sizes because I love your designs!", "redpants_designs": "Wow......you are awesome", "miss_kaya_anne": "You're amazing! Thanks for being such an inspiration and advocate to all of us bigger girls.. and all girls really 😊 keep slaying baby 💖😍💖😍💖 xxxx", "tayisharebecca": "Awww Gabi I remember dese days 😻. I've been your fan since then. You deff broke the Internet before Kim! Can't wait to see u next week at sxsw !", "tyramadesimple": "wonderful", "aritheheiress\nVerified": "Verified", "whosepetticoat": "#boom", "frenchnastyy": "Proud of you💜 been following you since I was like 14 !", "emmag_": "Yay!! Congrats!!", "rcroseking": "U luk amazing...Luv da suits!!!", "jessicajacksongrams": "Yaaaaassssss so proud ✊️💛", "storyof.keria": "I love it they are so pretty @gabifresh", "iambeauticurve\nVerified": "Verified", "blackgirlinom": "black. girl. magic. keep going @gabifresh ✨", "dezirahhh": "Thank God now I can use my nordstrom card lol", "flixbyjaymye": "That tumblr gave me life. I see you sis ❤", "missameliahart": "💕🙌", "ms_fabz": "Wont he do it!!!", "glamazon2you": "Congrats to you!! 👏🏽👏🏽", "mermaidsdonthavethighgaps": "This CANT HAVE BEEN 7 years ago omg!", "tiffanymbattle\nVerified": "Verified", "klv": "Love you!", "donijo": "Yaasssss 🙌🏾🙌🏾🙌🏾 Congratulations Gabi!!! 🎉🎉🎉🎉🎉", "lovecindyxo": "So proud of you. Thank you for what you're doing. You're impacting so many lives. You are so important, Gabi ❤❤❤", "sweetnside": "Congrats! Go Gabi!", "f3istypisces": "Dope.", "_imiej_": "I wore a bikini for the first time in 2016 at age 27 thanks to you!", "aut.haines": "❤️❤️❤️❤️❤️", "curvygirlchic\nVerified": "Verified", "darkuki_": "😍😍😍", "sincerevintagefinds": "Holy smokes! That is amazing!!go girl!", "emilysears\nVerified": "Verified", "wick3dallusion": "Thanks for being you and paving the way!!!", "jezra_m": "👏🏾👏🏾👏🏾✅🙌🏾🙌🏾🙌🏾", "simeoneelissa": "Such a badass!!! Love you for everyone your doing for our community 😘❤️💁🏽", "essiegolden\nVerified": "Verified", "that.girl.just": "❤"}