{"ayyyylaurita": "yes!", "jessicahotwatson": "Violence used towards ignorance and violence, makes sense. 🙄😏", "anjeanetteharris": "@hawiianflower12 I think you hate black people, just like those people in Charlottesville, VA, with their neo-Nazi signs, etc.", "commonlyuncommon": "🔥🔥", "cosmoalien": "😍!", "witchy_chef": "hell yes!", "virginiamariecakes": "@jreid279 follow her!", "simoneboyce\nVerified": "Verified", "patty_mosso": "How can I get two of those Shirts ? My 18 year old daughter and I really want well.... We need them! And I agree with your post 10000000% so well said. I can not stand what Trump is bringing out. And he is the Fuel to that Racist 🔥. I can only PRAY THAT JESUS / GOD hears us.", "avilaingrids": "!!!!!!", "fatgirlsnackguide_culturedlife": "preach fuk trump and his hateful as platforms", "amela_rodrigues": "🙌", "priddy_chick": "That skirt from? 👀", "brazenartistry": "🙌🙌", "k4veckaite": "umm disagree .. i think too much white was mentioned in a caption :) not only white people are rasists...", "bitchisloseingit": "@veganmisandree you need this top like last week", "tangeliaspeaks": "Yes! Say it for the people in the back", "r.b.mathews": "Wow was really loving this profile until i realized there was hate and violence in your heart. 2 wrongs dont make a right, gorgeous. Blessings!", "wellimaginethat_": "Straight up \"cracker\" is as equally ignorant& bleak as \"nigger\". Be more crafty. Good god.", "kairagnes": "Where is this skirt from??", "call_me_cheeto_": "You’re just a fat fuck", "ethanbmcleod": "Your an idiot", "poetcurious": "That tshirt!!! Yes! Fuck all the noise from the fragile white folks in the comments! Yes!!", "kbrochaim": "@fabulously_sarah I just showed this to Lexie and she said “I don’t get it, what’s a Nazi?” And I don’t know whether to blame her or the public school system so I’m blaming both.", "islandgrul": "Yes i agree with the message as well", "gabbydinga": "Preach!!!", "aleeshamorgand": "❤❤❤", "kenshiro1975": "Wow, that skirt😍😍😍", "butterfly621": "Love ❤️ that skirt but it not there on asos☹️☹️😞", "kittymcfierce": "This is a one sided opinion. Only fuck the white side of racism? What about taking the word \"white\" out and just saying fuck those supremacists, sympathizers, and nationalists that stand for any side but the side of unity and equality. Sorry, but I don't agree with your opinion. I am a multi-racial child and so is most of our generation. It's sad we have taken so many steps backwards but opinions like this don't press us forward they only instigate and solidify the issues already in existence.", "planetrenesme": "Yes girl 👏🏼👏🏼👏🏼🙋🏻", "miss.jewlz": "Thank youuuuu", "diaindeed": "You go Gabi", "taylarem": "🙌🏾🙌🏾🙌🏾", "snaeros_sindradottir": "@gabifresh I love your message but I need that skirt in my life. Where can I buy it?!", "nttknjstnrsrv": "✊", "ashleybelle": "Say it again for the people in the back 👏🏼👏🏼👏🏼👏🏼", "amneht": "😍😍😍😍😍😍", "hamlet_the_piggy\nVerified": "Verified", "rache.86": "Yaaaaaaas! Preach girl! 🙌🏼💕", "lizellii": "LOL @hawiianflower12 pulled me to another page bc she has nothing better to do with her life than be a racist neo nazis sympathizer but at this point I should just call it like it is. She's a racist", "pollyjofrantz": "THAT SHIRT THOUGH", "elizabethacjones": "Yes!", "sandyaggz": "YES", "pookah.pnduh": "🙌🏼🤘🏽🙌🏼", "_best_of_bella_": "@peterthestoryteller", "curlyredhairednewfie": "If you're a white person who takes issue with this shirt, you are part of the problem.", "gogomaps": "Also so pumped @ these white women who are being exposed in the comments. Your racism is showing sweaties", "anatase": "Yas!", "bazilicus": "👌🏻 spot on ❤️", "coopertootsypickles": "@Peterpanarchy omg.", "annalysera": "✊️❤️👊", "milli_staxx": "@gabifresh I bet you're block button is getting some serious action. Slay on honey!", "tinashanee": "I fucking need this shirt.", "neilybad_": "Fucking yes!", "misfitdeno": "Where can I get a tshirt?", "queenkatieoh": "Queen of my world", "vaaanna": "Yessss @gabifresh you didn't say anything wrong. You have the right to subjectively state your opinion, which I happen to agree with. Some people are just so rejective to take accountability, so they have to play the blame game. Anyone comparing BLM to White supremacist have privileged mindsets, and due to that, they just can't be rational.", "amorcitoxcorazon": "Yaaassss all of this! I appreciate you @gabifresh for sharing this on social media especially with the power and reach you have! I'm so done with folks trying to make us \"listen\" and be fair to white nationalists AKA whit supremacists. There should be no space made for racists and bigots. Those actions are violent! Also where can I get that shirt though! ❤❤❤", "unholyjodi": "Dear other white women in these comments that just don't get it: STOP telling POC what their emotions and experiences are or should be!!! If you can't stand a poc speaking their truth then don't follow them, don't talk to them, don't purposely try to demean them on THEIR OWN social media platforms, just move along like a decent person?! I know this is hard to grasp for some of you, but how @gabifresh feels about all this 100% NOT about you or an attack on your whiteness. There is no call for white genocide here, or from black lives matter (whose website is easily googled), so calm the hell down. Call out your questionable white family, friends, state representatives etc., instead of wasting time policing poc and we might get actually somewhere.", "josip0si": "Girl. YAS", "emwise": "@hawiianflower12 @acarrillobarron @celinahulsey are Nazi sympathizers pass it on", "celinahulsey": "This way it is because people keep 1. Buying pathetic shirts and other garbage and wearing it out 2. The news and people in general dragging it out and 3. Some people just don't have enough sense to stand up and say enough is enough. I'm not racist at all but I'm so sick of everyone wanting to label everything these days as racist or racism however you see it. The statues everyone is destroying is our HISTORY people where it's black, white, Hispanic etc. Get a life and respect where your from and heritage. We all came from God wether your black, white, Hispanic, Arabian and so on. Please let God in your life because if not your gonna have to answer to him or Satan.", "thatvegaschic82": "Amen girl!", "richh_rostarr": "U rocking that skirt", "emilie_mercury": "fuck yess ! 😘", "kizisgreat": "@hurlamaboc her t-shirt!", "ketrin_kubizna": "You have no idea what you're talking about in this post @gabifresh Bullshit. Not true at all...time will show. Btw... Find in a vocabulary what 'nazi' means.", "misspopnails\nVerified": "Verified", "pri_ab": "I need this shirt! And thank you for your post!", "kellen.hugs.all.the.trees": "YES 👏🏽👏🏽👏🏽", "hannaheartless": "I need this skirt. Also I bought this shirt months ago when I saw you wearing it and I love it.", "jeraldinaa": "The entire world literally went to war against Nazis. WW2 was about fighting against Nazis. Why do these people need rights? Again, why do they need a fucking platform for? This shouldn't even be a debate.", "xashill": "But nothing is worse than those who scapegoat leftist as what's wrong with this country and that we are to blame for the retaliation and actions taken upon us for standing up to our rights. Also if you are spewing your garbage opinion at least let it be yours and not fox news bs. Blame for our problems. Racism and oppression is EVERYONE'S problem. Actually learn what is happening out there. Black and brown people are literally being killed for just being Black and brown.", "breanak90": "@raymarbuck I thought you would like her shirt!", "jamsers": "YES", "lizwearswhat": "👏🏻👏🏻👏🏻", "miss_giulia": "@sjthedj be this cool", "vongeek": "Anyone who hates someone based on their skin color or where their family came from ... is an asshole . Plain and simple", "yellocttenor": "Speak", "luziehtan\nVerified": "Verified", "meganrascal": "🙌🙌🙌", "awhi07": "🙌🏽", "soleilnatural": "👏🏾👏🏾👏🏾👏🏾👏🏾", "sull22": "So much yes to this post!!! We will NEVER go backwards! 🙌🏽👊🏽💪🏼", "ieshamitchellpr": "Thank you Gabi!", "coachmaliksp": "😍", "deadbeatnymph": "You can't fight fire with fire, but you can fight nazis with punches.", "marlabelle1981": "YES!!!!", "styled_4u": "🖤and for the caption", "imc_queen": "✊🏿", "daqueen626": "Cool shirt. 👍🏽👍🏽👍🏽✊🏽", "sarahjaybee": "🙌🏻", "korazon_d_melon": "@bettywolfanger ...perfect explanation ❤️❤️❤️", "bee.ren.duuh": "I want this shirt", "cindy.cox65": "I LOVE this, so flattering and fresh on you!", "modeusementmuse": "✌🔝", "ebonymonnet": "It isn't worth an exhale to argue with people who support Nazism, white supremacy and white nationalism. If they believe it they're on the wrong side of history. People like @hawiianflower12 and @celinahulsey and @sadnotbad.dreams have a right to voice their opinion however inappropriate, insensitive, ignorant, ill-informed and racist it may be. Trump told Americans exactly what he believes. Which is why it took him so long to condemn these hate groups; you don't denounce what you identify with. Now I don't know if the president is truly racist but if he isn't he's definitely racist adjacent. After hundreds of years of pain, sorrow, progress and fight it's shameful to live in an America with a president who clearly doesn't see black folks or ANY minority group as equal.", "nana_theknockout": "#thisshirttho @maggpye Go Gabi!! @gabifresh", "clemfandangoh": "On behalf of white people, I apologise for the fucktardary of the white bigots in this thread.", "lerondondada": "👊👊👊", "frannamstyle": "It pains me that your president didn't name them as domestic terrorists. Almost as though he's scared. If he is afraid of them maybe he should think about how his people feel? The ones living with the threat of terror on their doorstep.", "whatupmegs": "Yes! ✊🏼", "carmen_lelli_curve": "😎😍", "shamisai": "So now we just punch people we don't like!? Uh uh! No ma'am! Uh uh! No ma'am. That way madness lies. You're a nazi for thinking it!", "missverandaa": "✊🏻", "xiozee1": "Bold T-Shirt. Bold caption.", "sterlstacos": "👏🏾👏🏾👏🏾👏🏾👏🏾 I agree. It's sad we have to defend ourselves all the time and have to say why nazis and racists are bad. I've seen so many people stand up for them it's ridiculous smh", "kaysha.honey": "@reddjane we need to get shirts like this", "chubbycartwheels": "Fuck yes to this shirt! I just ordered one!", "kristykoutsogiannis": "Fuck Yes", "lrghrt": "Goals.", "favereys": "hear hear", "aphrochic": "✊🏾", "dayija": "🙌🏻👏🙏", "cml186": "#noweshouldnotherenazisout YAS!!!", "janus.makeup": "Some of these comments gotta gooooo", "gabriellecorney": "AGGGRRREEEDDD!!!", "ckappiahh": "I love that skirt but most of all that shirt!", "_mrs.adams_": "YES GIRL YOU SAY IT!", "dktpvnv": "You dont known what nazism is. Its a political-economical system. Those people are rednecks or racist, violent scum. Nazism is just the best form to run a country, and its against capitalism.", "ebventures": "PREACH!!! 🙌🏾", "lisarose00": "EVERY WORD OF THIS. YES. My god why does it even need be said...", "darlingtiara": "❤️😍❤️", "hawiianflower12": "He spoke afterwards when it happened, it's not his fault that this happen and people like the left today just shows how much more of a hate group then any other people I know because not only did you guys started protesting , first you guys protested against hate in this country but yet I see antifia facist flags and I see you guys all dress in black with some nasty signs, and then you guys starting screaming FUCK TRUMP, FUCK OUR PRESIDENT, so at this point I have no words for you guys, I'm sorry if I offended you in anyway but it's sad that both sides are doing this not one", "curlyminxy": "@chantzilla I mean.... can't go wrong", "syd_th4yer13": "I don't think we should respond with violence, but you're absolutely right that they need to be shut the hell up! Love is stronger than hate, but how do you show love to those who hate? Just some food for thought ♥️", "black_jinkies": "👏🏽👏🏽👏🏽", "acarrillobarron": "They are not natziz just red necks like Donald Trump and if the americans citizens would have care about human rights and equal treatment, they would be more engaged in their elections, whit all respect thats what americans are, they care much more about kardashians than they own politics, and violence is not the answer, neither your t-shirt and Instagram, if you want to help your people do some volunteering on the streets.", "wileshaaaa": "‼️‼️‼️‼️‼️‼️‼️‼️‼️‼️‼️", "carolina.quira": "I love your outfit ♥️", "chanelnijmeh": "Where is this shirt from? Cuz I need it", "curlyqpgh": "@chantzilla seems legit", "nadiaaboulhosn\nVerified": "Verified", "sheedaaaaaaaxo": "Amen. 👊👊", "laurapew": "YASSSSS QUEEN! #snapsallaround 💯💯", "kerrieann123": "On fire 🔥- hot hot hot; love this look", "annasun817": "👏🏼👏🏼👏🏼", "caitthegreat21": "YES. @gabifresh thank you for saying this 🙌🏾 it's so exhausting to constantly explain what is happening and has happened in our country. The occurrence of racism IS A FACT. There's no debating it. 🙄in order to move on and heal we must first acknowledge and sit in our truth as a country.", "dreamt": "👏🏽👏🏽👏🏽👏🏽", "lessaboutmore": "😍 grrl you fucking rule and you look hot as all hell. Punch all nazis!!", "colonelgrandma": "Now this is a fucking LOOK 🙌", "caughtinmyfro": "Someone come get all these white women in these comments 😩😒", "jackie_p__": "🙏🏾🙏🏾🙏🏾 YASSSSSSSSSS 🙏🏾🙏🏾🙏🏾", "evilchantal": "@curlyminxy @curlyqpgh", "devonmurt": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "rosasmodernlife": "Where did you get that shirt I need it!!!", "gabifresh\nVerified": "Verified", "brioney365": "🙌🏻🙌🏻🙌🏻🙌🏻", "hgd731": "Amen sister!!", "a.s.h.l.e.y.e.l.i.z.a.b.e.t.h": "🙌🏻🎉👏🏻❤️", "julia_rafferty": "Where'd you get this shirt thoooo", "halfspice": "💃🏻💃🏻💃🏻💃🏻💃🏻 👏🏼👏🏼👏🏼👏🏼👏🏼", "stylenbeautydoc\nVerified": "Verified", "styleisstyle": "@gabifresh for president 🙌🏿🙌🏿🙌🏿", "fabulousquisha": "Say that!!!", "jayelletee": "Yes!!! Shout it!", "quirkyunicorn": "Where can I get this shirt?!", "dylan.mcbreen": "Well said", "alisonfreer\nVerified": "Verified", "mandeebloom": "Loud and wrong @sadnotbad.dreams.", "considerately": "Truth. 💜", "thessea": "Yes, @gabifresh !! 🙌🏻 It's a tough thing to face when you are a firm believer in free speech and the right to choose over your own life; but freedom of speech has it's limits - and this is defiantly and undeniably one of them! We should not give Nazis or white supremacists (or the KKK!) the \"benefit of the doubt\" and we should not \"hear them out\" nor \"give them a chance\". That has been done one too many times - and it cost MILLIONS of lives. Speak out against it. Do not let them silence you! The only thing that can drive out this type of hate is pure and unapologetic LOVE. So spread that sh*t as much as you possibly can - smother the bastards in it. #armyoflove #naziscanfuckoff", "nooooemigil": "😘😘😘😘😘😘😘😘", "forev3rr11": "Omg @gabifresh 😍😍😍 why you so hawt", "wild_like_thewind": "🙏🏼💜🤙🏼", "kymchinlee": "Love it !!!", "shoplysande": "WHERE CAN I BUY THIS?!!! #PUNCHMORENAZIS #FUCKNAZISCUM", "lizlilac": "I'm drooling 😍🖤", "aneshaisaplus": "@madimeredith1 can you please show me your references as it pertains to the BLM movement murdering anyone? PLEASE show me! Actually. Don't waste your time. Ain't none! Stop willfully being ignorant. Get out of your box of privilege and open your dirty little eyes! Black supremacy? That's laughable, seriously. Smh. Your brain is in my prayers.", "van6506": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "savvyp123_": "❤️", "melisgreat": "Obsessed with you!!!!😍😍", "golden_strokes": "@lofztrendy I NEDD THIS SKIRTTTTT😍😍😍😍😍", "_nilyac": "P R E A C H and let your light shine bright. Sending love your way 💕", "melibeee_": "To people bringing up BLM, they wouldn't exist if racists bigots were not hunting us for sport. What do the kkk, 'white nationalists', or Nazis have to rally against? Free speech and giving the Nazi salute should not be synonymous, and yet people are likening them as if they are under the sane umbrella. People died trying to eradicate the damage they've done, and ignorant fucks are making a mockery of it.", "sweensster": "YES!", "emti5": "Gabi had time today PREACH", "erinkat_": "I love the boots!!! ❤❤❤", "jalexandra_1994": "Where did you get that shirt, @gabifresh ? Love it!", "asiyajuleese": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "serena_hamont": "Ironic use of colour. F*ck racism.", "heyseantaylor\nVerified": "Verified", "mrslaurenstanley": "Yes yes yes!!! Loving all of this from the outfit to the voice!! 💪", "kkaaatii": "Where is your shirt from?", "laroxay": "Yyyeeeesssssssss", "brittany_nicole": "YES GABI", "mademepretty": "Fuck yes✊🏿", "justalyroc": "I want this shirt!!! where can I get it", "laurenb1188": "Couldn't have said it better!! ❤️❤️❤️", "prttylilmonster": "Let em know!!!", "econlibra": "Yes❤️❤️❤️👌👌👌👌", "nick_name_nelly": "👏👏👏👏", "nic.taliaferro": "YES!!!!", "cloealan": "🙏", "jfennho1": "@gabifresh need that shirt. Where can I get it?!", "brxtrmn": "🖤❤️", "emnarruc": "Yes! Thank you!", "mojotastic": "That's an amazing shirt. I can't believe we're still talking about nazis in 2017.", "officiallyjustc": "Every freaking thing about this!!! 🙌🏾🙌🏾🙌🏾🙌🏾", "mckenna.irl": "Yesssss 👏🏽👏🏽👏🏽", "tansssss": "Exactly ‼️‼️‼️", "_luna_11_": "Yes 💯!!!!!!!!", "monroesteele": "Yes LORDT", "hi_myong": "@gabifresh yesssss!! Speak!!! Love this!!", "amiemae27": "And I'm good. 😝", "logophilicmind": "@gabifresh and @nicolettemason THANK YOU for speaking true to your moral compass. If fashion is an expression of humanity and creativity, yall are doing it right. #preach", "rachael_dundas": "@meagsmcn gunna need this shirt", "scottmczeal": "👀", "puffbaddie": "@bettywolfanger I love you ! I love everything you said !!! Thank you !", "jess_i_ann": "👏🏻👏🏻👏🏻", "_holabombshell": "Yassssssssss", "weirdofrompluto": "I need that shirt in my life 👏👏👏", "hgoldman16": "Yoooo where do I buy this shirt???? @gabifresh", "salvi_gem": "Yes!!!👊🏼👊🏼👊🏼❤️❤️❤️", "topdollareash": "@apb73 go die please .", "lucybiancacassie": "My thoughts exactly they are all garbage", "cheriejubilee": "Yes!", "misspurplereign1": "Yes you", "miss_tami_t": "Well said @gabifresh", "keturaaah": "Yessssssss!!!!! 🙌🏽🙌🏽🙌🏽🙌🏽", "emmdeejaybee": "@gabifresh Where's the lie here? 🙌🏽👏🏽", "amor.amour._": "Those fucking toes are gonna give me nightmares.", "itsmee_brii": "WHERE DID YOU GET THIS SHIRT?!?", "callista5454": "@gabifresh where did you get that shirt? I really would love to buy it!", "rachael_glory": "🙌🏻", "mountaingirl24": "Yes!!! #slay #fucktrump", "lovemetalmitch": "Jeez Louise what a shitstorm this has become.", "brit_weldon": "@gabifresh where do I get this shirt???", "anilumagloire": "👏🏽👍🏽🤛🏽💪🏾👊🏽", "nashwaaaaaaaaaa": "Tell them!!!!!", "alicethegeneral": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "glamazon2you": "👏🏽👊🏽✊🏽🖤", "zetti.d": "@gabifresh outfit details ?", "amfarrell93": "Yes 🙌🏼❤️", "_erikamichelle": "🗣 YAS", "sciencestuffwithsteph": "🔥🔥🔥🔥", "mere_bear333": "This! 🙌🏼🙌🏼🙌🏼 Also, I need this shirt @gabifresh", "lagrosera": "And also, is that a for real latex skirt and where can I get one?", "finessecurves314": "Ayyye! 🔥🔥🔥", "justagirl.and": "All of this! 💯👏", "ashleynicoleb_": "Well said 👌", "_lashunkita_": "YAAAASSSS 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾. You better SPEAK THAT TRUTH!", "junethrusept": "❤️", "grant.greschuk": "Yasss!", "psitsfashion": "💯💯💯", "catherine.monast": "Lots of people are shedding white tears and crying reverse racism... we ( as in white people ) need to check our privileges at the door and learn a little. First, White racism doesn't exist.", "chelseabrianne_": "💯💯💯", "nicolettemason\nVerified": "Verified", "erinn_is": "Amen. All day.", "gchic23": "👏🏿👏🏿👏🏿👏🏿", "drea_iris_": "Why does this automatically conclude Trump to be a sympathizer??? Has nothing to do with politics. People are evil- all over- in all colors. These actions are not to be tolerated by anyone.", "shes2official": "Need the shirt 😍", "lostlamb_": "Fuck yeah", "stylishtruthdealer": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽💕", "sophoodie": "❤️", "caschca": "I need that t-shirt!", "1331bucklehorn": "🙌🙌🙌", "valpadma": "Love it!", "sha.rron": "\"Black supremacy\". Christ, y'all sound stupid. 😂", "doublenic": "🙌🏿🙌🏿🙌🏿", "theblackbandita": "PREACH GABI", "sosunshinebrite": "👊🏽👊🏽👊🏽👊🏽👊🏽", "charel85_hair": "@madimeredith1 I'm not mad at you, but your statements are a part of why there is a divide in our country. I can tell that you mean well and dont condone hate, but if you wish to understand why BLM is not included in your list of racists or supremacists, I am more than willing to converse with you. You can even DM me if you wish.", "hipwhitwhit": "Love this and love you Queen! 🤗❤️", "muva_maverick": "@april_iacono here you go sweetheart. Your president https://www.facebook.com/HuffPost/videos/508580662819419/", "christian_omeshun": "I just love you @gabifresh !! ❤️❤️❗️", "di_marek86": "🙌🏼🙌🏼🙌🏼 When someone compares the BLM movement to the KKK I almost want to throat punch a bitch. BLM welcomes EVERYONE, no matter color, creed, gender etc. The KKK and those other nazi mother fuckers ONLY WELCOME \"their kind\" aka a bunch of inbred, hillybilly, cousin-fuckin', uneducated, toothless, greasy losers. BLM and the KKK are NOT one and the same, and it's a fucking insult to suggest otherwise. Fuck the KKK and the nazis, and the alt-right, and most of all, fuck that sub-human vile creature that's currently occupying the White House.", "missmollydollygoldstein": "👊👏👏🏿👊🏾👏🏾👏🏼👏🏻👊🏾👊🏽👊🏼👊🏼", "damn.it.lexi": "@april_iacono he just said that nazis are \"fine people\". Are you stupid or just clueless?", "coolbreeze6886": "Chanting the word genocide is a lot different than committing genocide.", "stephariah": "Need that shirt! Where can i get one?", "jasmyninbloom": "Political activism and stylish outfit rolled up in one post, major props to you 🙌💕", "lpjallai": "At this point if you keep defending it you're supporting it. So, we don't need to hear it.", "crystalcoache": "Need this!", "withl0ve_rae": "neeedsss this", "mskristine": "👏🏾👏🏾🙌🏾🙌🏾", "miatheboss": "Thanks for this Gabi! You articulated WELL! Love you for using your platform to say this!", "the_butterflychild_": "@gabifresh thank you, that's exactly how I feel!", "ali__mama": "@angxoxo_xo #blacklivesmatter has a very well explained list of demands and principals on their website that you should definitely read. Never once do they demand to be regarded as a superior race or for the extermination of a race. Neo-Nazis, white supremacists, the KKK, the Alt-Right on the other hand do. Meanwhile, #blacklivesmatter is asking that black people not be killed and jailed disproportionatly by our government. Why should they even have to ask for these basic human rights? It's like comparing a group of people who want all the water on the planet for themselves to people who just want a drink.", "thegigijiggles": "👏🏽👏🏾👏🏿", "timiljones": "✊🏾✊🏾💋", "sleepinbooti": "Love your shirt where can we get it?? 😍😍", "aad.en": "!!!", "kimkiminy": "Say THAT!!👏🏽👏🏽👏🏽", "cookie_chips": "Yesss details on the outfit pleaseee...", "emmalie06": "Yeah, Gabi!! ✊🏿✊🏾✊🏽✊🏼✊🏻", "angxoxo_xo": "I love how it's about violent racists but you want to exclude BLM. Your racism is showing. Use your platform to promote peace not segregation.", "leajubah": "I need this shirt!", "cdlabreezy": "Yes!!! What are the details on that shirt?!", "jennifermakesart": "@madimeredith1 clearly you are retarded. The black lives matter movement was created due to being black men being shot by police not about supremacy you ignorant cunt.", "lightsaltglam": "🎯🎯🎯🎯🎯", "ebey04": "🙌🏻", "lauren.b.jonas": "YESSSSSSS", "kimfalardeauramirez": "👌🏼👌🏼👌🏼👌🏼👌🏼", "annethology": "support support support", "kharenacoleman": "All Day", "annamixlin": "❤️❤️❤️", "ingridvwells": "💖💖💖", "nogoodlover": "🙌", "make_it_write": "I love that shirt!", "nolatrees\nVerified": "Verified", "anniebsf": "@sf.jessie miss dion mood", "liblibby": "Neeeeeeeed this tshirt!! You're spot on with this. Thank you for using your platform even though it opens you up to stupid, stupid criticism.", "meghanxtyne": "Hell yes! All of this @gabifresh 🙌🏾", "fullakafactor": "👍🏿👌🏿 well said.", "an.ariele.view": "🙌🏾", "clever_madi": "It has everything to do with BLM, Barack Obama, and Hillary Clinton. BLM burned buildings down and STOLE, AND murdered/injured countless. Barack Obama gave them legitimacy. EVERYONE knows that these nazis are pieces of shit. Fuck black supremacists, fuck white supremacists, fuck ALL supremacists. Quit throwing \"white\" in their when its convienent for you to promote your racial divide agenda.", "mic_suggah": "@4the_lifeofme @ayelysse ❤️🙌🏽", "beautybylmarie_": "Queen shit!!!", "sugar_wraith_knife_fight": "Wore*", "aliciae__": "Yessss!!!!", "rorabeee": "🙌🙌🙌", "amydjackson87": "Well said. Thank you. This is what the President should have said, instead of the word vomit he decided to spew for us today. He needs to stop pointing the finger at the former President, Presidential candidate and the \"Alt -Left\" and do his job. 🙏❤", "notpielcanela": "🙌🙌🙌", "sophiarai": "✊🏽", "jussysjungle": "LOVE THIS !", "curveconscious": "✊🏽", "drownsomebody82": "bae @gabifresh came through with that epic caption to an amazing pic.", "my.miel": "❤💙💚💛💜", "jjjassminee___": "This look good 👑", "medium_cool_": "That's a great shirt by @thechrishaley", "marindadiane": "Yesssssssss Gabi!!", "blvkqueen91": "Girl i need this shirt 🙌🏽", "_simplyangie": "Where can I get that shirt? Caption is 💯", "bshawnab": "😍 yes @gabifresh, I need this shirt! 👊🏽 from #charlottesville #hometown", "_ellsssx__": "FUCKING PREACH.", "sophisticatedcurves": "Beautiful!", "clumpsofmascara": "Let. Them. Know.", "nick_naxx": "@brit_weldon", "rissalarue": "@gabifresh but imma need the shirt details tho. 👀🙋🏾", "hormann_nicole": "I love your hotos!!!", "debbiequilts": "Well said!", "_beingjade": "😍😍😍😍", "yelzieee": "💯🌹💯", "princesshawthorne": "@iamzetaj", "alexmichaelmay": "Yes.", "misskredman1913": "I need this!!!!!", "nycrecessionista": "YAAASSSSSSS @gabifresh!", "loraquelnelson": "Preach preach preach! Much respect to you @gabifresh and using your platform to speak! Thank you thank you!", "jewel.mailloux": "antifa ✊🏽", "bigbuttandbiggerheart": "Yes yes yesssssss! 👏🏻👏🏻👏🏻✡️ this Jew is with you girl.", "travelgnome": "You can't wear that shirt and not tell me where to get it!!!", "allieviolist": "👌👌👌", "heytrinasmall": "It's always someone with a private profile and 5 followers trying to start ish. Take those hammer toes and beat it.", "heyrhon": "Why if anyone says anything about a hate group, people always want to talk about BLM. Get a grip on reality,BLM never no one else's life didn't matter!", "amber.indigo": "Yes yes yes yes yes 😻👏🏾🙌🏽", "girlgofar": "I can't like this post enough", "blair_wish": "Dammit I love you even more for this !!! 💞💞💞!!! It brings tears to my eyes !! Thank you for standing up and using your platform and voice for black lives !!!", "anastasiagphoto": "Can premme make these t-shirts?", "excess_jes": "Where can we get this shirt?! 🙏🏽🖤🙏🏽🖤", "keep_up_with_this_jones": "💯💯💯💯💯", "134340_kayla": "👏🏼👏🏼👏🏼👏🏼❤", "donna.delia": "🙌🏻🙌🏻🙌🏻🙌🏻", "ohitsryan": "🙌🏻🙌🏻🙌🏻🙌🏻", "19goose86": "Girl let me buy you a drink tho!", "lishnik": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "bklyn.est86": "PLEASE don't come for the homie🙌🏾❤️ Well said @gabifresh", "nitaneet3": "👏🏽👏🏽", "modeljulienelson": "Fuck yes!", "dlovemua_": "I need that skirt in my life", "dannib87": "Well said!", "vincethegram": "👌😚", "mmmousou": "Thank you!", "curenccy": "@gabifresh Exactly Miss Gabi!! 👊🏾🙌🏾✊🏾", "unskinnyshero": "🙌🏻", "daveybaby": "❤️", "robinlgiles": "Yes! Yes!! 🙌🏻", "nuclearnicole": "Amazing!", "mamabear_honeybee": "Fuck yes!!!! 👊🏼❤️", "curvily": "THISSSSSS", "ashleysallsmiles": "👊🏽👊🏽👊🏽", "encyclopediaclown": "LOVE THIS!", "3thechicway": "Sad fucking times...", "theonlyamaris": "🙏🏼❤️", "retroviolette": "Beautiful! Love the skirt.", "ayanahellogorgeous": "All of this!!!!!", "yazleal": "✊🏽", "raqandrollwithraquel": "Amen!!!!!!", "galadarling\nVerified": "Verified", "girlinabearsuit": "That shit is everything", "jazzmynejay\nVerified": "Verified", "anastasia.furrow": "Love you!!!", "jennyhorror": "So well said, thank you Gabi! 👏👏👏", "bola.bee": "💕💕💕", "ihatefitzfromscandal": "Thanks Gabi 👏👏👏👏👋👋👋👏👋👏", "sparkle_farts": "YESSSS!!! 😍👍🙌", "saltedkaramel": "@mrskareesmith I need this shirt and her outfit is on point!", "og_golden_grrl": "Love this. ❤👊", "shesallfatpod": "Yesssss where is this shirt frommmm", "ray_deezy_": "Dope shirt ❤", "noblessh": "🙌🏻", "angela507diamonds": "Tell 'em Gabi!👊", "snackstation": "Please sell these shirts!", "_mariana_ob": "where did you get that shirtttt!!!!", "the.curve_": "📌📌", "calamity_d": "Loving your tshirt game of late, gabi.", "ange.nom.nom": "I love that shirt. I need one 😍", "lydiahudgens": "❤️❤️👊🏻👊🏻", "tikedi": "🖤🖤🙏🏾"}