{"somewhere_under_the_rainbow": "Well Monday has come & gone but I'm gonna continue to manifest this abundance in my life - both of giving and receiving. 💜", "xpiotivaxtina": "Forget giving away the 700€ you should give away that jacket. It is the cutest 😍😍😍", "madsencreations": "Niceeeeee!", "erdianj": "Beautifull", "navya.g._": "❤️😍😍😍", "artistrybymarquita": "I’ve been following you since you were on tumblr (2008ish) thank you for being your true authentic self #superfan", "regina_beauvoir": "The color combos you’re wearing are 🔥", "kelsallsmiles": "Hey babe, I first commented when you had posted this contest. I just found out today that my doctor I work for has sold his practice to a big company. I won’t be getting a check for almost a month. And it won’t even be for the amount I usually make. I’m super stressed because I just made a payment for school. If you choose me, I’d be super thankful! 💕 Thanks Gabi! 😊", "jordan.manga": "That's u my baby", "mamzelleclo19": "Your coat...!!! 🔥👌🤩", "purelypurnell": "Who won this giveaway?", "kaushal_darji82": "Sooooooo beautiful", "vergecreative": "💘", "ohthemediocrity": "Your collab with swimsuit for all back in 2017 changed my life! my inner bad bitch has been in full effect since then 😛 also girl, I need my summer wardrobe updated😘 @gabifresh", "g2dc_gabreclarke_g2dc": "Yes gabfresh are so neat an nicse also best yes gabfresh from the east west rated as the best its gabreclarke", "pinkkisses9": "Omg my fro sista!!!! Love your hair and vibe!!!! @gabifresh I would love to work with you!!!", "mafongo01": "Elegant", "_naturallycha_": "Congratsss on 700k... but gurl did you think that number wouldn't boom?? I mean like really??!! When a bad ass bish, shows the world how we fun size women(yes we are fun size) always had it on lock... lingerie, swimsuits and a dope line. And let's not forget about that amazing skin of yours. Continue to grace the world, being unapologetically YOU! 💗❤️", "beckydolex": "BIG love from the UK here🇬🇧I haven’t been aware of you or your platform for very long but I have quickly become obsessed!! Due to a lack of confidence I haven’t been in a swimsuit since I was around 18 (5 years ago roughly) but your pieces are enough to make anyone want to go swimming. I particularly love the retro barbie collection and can’t wait to own one. P.S congratulations on the 700k no doubt you’ll be celebrating 7m soon enough💕", "hamoudghaiath": "Amazing", "madhatter_24": "You radiate 😍", "springflower02": "❤️❤️❤️❤️❤️", "latanyashowers": "Yassss the only store I don’t have to check prices 😂😂 You look amazing, love the vibrant colors 😍😍", "carmindancer": "😍", "sylvia.wakana": "Congrats on the 700k!! And 😱 You deserve the world, girl. You are always an inspiration (seriously). I miss you! I’m a bit tight with money right now (I’m trying to change tracks a bit and focus more on my own stuff and it’s a little rough but really exciting!!!) BUT this was a perfect reminder of how grateful I am for what I have and I just venmoed a couple of other struggling friends a little bit of cash who are even worse off while trying to chase their dreams too cause you know, we’re here to support each other. 💕 Thanks for the reminder and for the push to pass on good things when I can too! Let’s catch up soon.", "cheleta3": "Soooo I would use this 700 to surprise mom n dad on a mini beach trip. Funny: it’s only 3 hours away. But they deserve it because it’s there 50th anniversary🎉🎈😍", "thoughtiebynature": "Congrats boo! You out here winning! You look good, ya man a snack and you stay getting the bag. Proud of you and your growth!", "maxeygreene": "Such a babe!", "lastboa": "Gabi I just started following you because when my daughter who is 14 gets so down when she has to shop for clothes, people like you inspire her. Shopping should be a fun experience for a teenager and it’s not for my baby. She doesn’t want to have insta because she doesn’t want to get “bullied” her words not mine. She is smart beautiful girl who wants to just “fit” in. As much as we pump her up about body positivity, we have to remember she is 14. Thank you for your message to young people.", "itskarathomas": "love you and your style! thank you for representing women of color and curves so well! Blessings 💕", "abrownelle": "Could bore you with what I need, how bad & why BUT truth is a lot of people have need these days. I’ll just say 𝐓𝐡𝐚𝐧𝐤𝐬, for inspiring all of us aspiring hustlers and reinforcing what’s possible when you invest in your own business & brand! If I won, I’d offer my services in return AND pay it forward. ✨ Keep shining, Gabi!", "clarissa_brooks": "I found your Instagram account from an article on Snapchat, it made me inspired. So I decided to give you a follow, best decision. I’ve felt more secure and confident with your positivity on my feed! Much love and support!💗", "annachubbybanana": "congrats!!!✨ I just bought one of your bathing suits from swimsuits for all, I have been scared to leave the house, let alone enter a pool, since diagnosed with PTSD and gaining weight from meds...but this suit is lavender with an orange belt and too cute to leave in the house!!! I'm determined to suit up, grab my service dog and head to my condo's pool this summer once my suit arrives. Thanks for the inspiration, it was the picture of you in the suit that convinced me I might be able to pull it off!!💖💖", "jcgoof": "Lord I'm praying you pick me. I cant afford to live in LA county anymore and I have move up north and this will help me do that. I only have month to be out of my apt. I can only send up my prayers. @gabifresh", "homestead360": "😘", "kirstin329": "Omg I love your outfit 😍😍 thank you for just being you! You inspire me and so many😍", "mariajcoaching": "💪", "yazzjpardshe": "$700 would pay my rent and save my life to be 100% honest.", "ohmycakessss": "I just barely followed you and I love your style❤️😊", "low.qi.in.public": "even though i have a snowballs chance in 700,000 and i’m just gonna use the $ to buy shit that makes me feel good instead of catching up on bills- my breasts and butt would greatly appreciate the opportunity to elevate them to their former glory in new bras and draws! Congratulations on 700k and thank you for celebrating women and bodies of all sizes!!!", "melvis333": "Congrats! You are truly an inspiration!! Keep kicking ass!! 💓💓💓", "cryssyvgetsfit_": "You are my sunshine, my only sunshine You make me happy when skies are grey You'll never know, dear, how much I love you Please don't take my sunshine away 😍😍😍😍", "lisadipietrosmith": "Wow 700k followers🎉 it must feel amazing to know that YOU personally have stepped into each one of these women’s lives & touch them right where they are, inspiring them sometimes at their lowest ‘ugliest ‘ moments & empowering them to see more of themselves 😘 Touching that inner beauty & self worth that can sometimes be hidden beneath feeling unworthy because we don’t fit in a size2 ( though society says we should) You have given 700k women a smile 😊If that isn’t an act of generosity & kindness I don’t know what is 😘. Thank You 🙏🏽", "randyatthinbeautifulbluesmoke": "🙌🙏👍", "kimmy_ohio": "Winner or not... I’m a new follower and constantly inspired by your style and the message behind it. Thanks for giving us BBW a voice in fashion and life. 🙌 🙌🙌", "bethalovealbert": "The original IG plus model in my eyes! You have paved the way for beauty no matter size, color, gender, etc. I remember finding you back in 2012 and thinking, “look what my girls will have to look up to! Amazing!” Congrats on 700k! 💗", "ceo_bunnie": "I’ve been following you since the beginning (young fly and fat if I remember correctly❤️)!! You’re growth is so inspirational especially since I’m starting my journey as a serious entrepreneur (I wasn’t serious in the past) anywho you’ve always moved at you’re own pace and that gives me peace of mind in knowing I don’t have to rush this journey! Happy 700k to you Gabi!", "momofbugs": "I have nothing funny to say. I could use $$ tho going through a divorce, single mom, starting over, & attempting to go back to college to make a better life for me & my little one. Uhhhh $700 Self-Care could be the best care.", "ithinkitsmorgan": "You helped me feel good about myself at some of my lowest points just by existing so thank you ❤️", "lilaclemonlavender": "Oh u rich rich?😂😂😂 What a lovely thing to do", "simone.barbour": "Congrats Gabi!! This is great and you have done so many wonderful things to lift up others, represent, and inspire confidence in all!!!💜 For me $700 would be AH-MAZING! I just made a big move for my 1st job out of college, spent a lot of 💸 to do it, and student loans just hit me 🤦🏽‍♀️. I couldn’t have done it without the blessing that is my mom to help me along the way so honestly I would pay her back with this. She’d say it’s not necessary, but just as thank you (and a super late Mother’s Day gift). It’s also just a tiny dent in the millions I’ve probably caused her to spend through life! 😅💕", "ls85ls": "It's ok that you match. The 99 cent store has been giving me life for years just like your outfit. 🖤🖤🖤🔥", "tfbbj": "You're an inspiration and light up Instagram. Congratulations on reaching 700K may more should find you and follow.💋", "dr.entwife": "I’m in love with this jacket! My very first Bikini was @GabiFresh I finally found a brand that can make fun and flattering suits for all sizes. I used to hate swimming, I always felt so frumpy or uncomfortable in bathing suits. But then I found that bikini and it made me feel like myself and able to enjoy the pool and water parks again. ❤️", "doctor.meagan": "Thick thighs tell no lies! Congratulations!", "drissbop": "Pink panther! 💜💜💜", "rashareigns": "Congrats on 700k you should been at a milli already. Girl $700 I need a vacation b4 this fibroid procedure *whispers* and some new lingerie 👀👀", "oyesomi_jr": "Where is this gorgeous and pulchritudinous baby from other than the world?", "ninetysixth_sense": "This is THE coolest thing to see after getting access to my long standing insta account again FINALLY today. 700 dollars would go far for my fam, thanks for being an angel", "model.lynnrose": "🙌🏾💖", "arcarmicheal": "😍😍 Gawwwwgeous! I need that jacket!!!! (and the $700 wouldn't hurt 😉😂😘🙏🏾)!", "ladywatt": "Hubba, hubba, lady!", "amichelejones": "Are you at Aldi's and why does this adorable outfit go with the super market background? So cute and gitchy, at the same time? 🛒🛍️🏪", "stacy_downer": "I bought a yellow dress last year. It was brilliant on the plus size model and $5.00. This weekend I wore it been sick and had no clean clothes. I add a yellow head wrap-just took out my weave. My daughter said “mom you look like the lady that sell syrup” yikes. I added red lipstick and earring my 10 year son said “ hey Beyoncé, hey your lemonade on, you look nice”. Note to self focus on encouraging my little daughter to give compliment as well. So I would like to buy my son and daughter something nice. One for their honesty and another for the encouragement. Gabbie stay Fresh!", "craftyafternoons": "Something. Okay I said something. Does it make you laugh. I hope so because I sure want $700.😂", "jazminnunez": "Ahhhh Gabi is about to give me money for a trip 😎", "stephanynickole": "If helping someone would make you feel better, I sincerely hope you choose my comment! @gabifresh", "jessicajade.c": "TRUE STORY from an OG blog follower since '08: My bestie/college roommate 💃🏾 @tarevaleselle and I used to construct these elaborate late night fashion photo shoots in our dorm room using HOT PINK, TWIN SIZE bedsheets as our backdrop while wearing tube tops, tight jeans, and glitter makeup. 👡💄I was the photographer and she was my model! 📸 IT WAS SO DAMN FUN. You helped make attending an ivy league university where there were so few plus size POC like us more exciting. Thanks for giving us *life* and fashion inspiration! #ainttooproudtobeg #givemecute #hotstuff", "pinkladyluck": "Yazzzz ‼️👏🏽👏🏽👏🏽", "woah.shell": "That's a beautiful jacket! I love the whole color palette of this photo", "snookjerry8": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "lindsayscolala": "First, love the jacket! But thank you for making the world a more colorful, loving and happy place. Thanks for continuing to bring a smile to my face and few cute swimsuits along the way 😉", "unlikelylib": "🙀🙌🤞🙋‍♀️", "4tiphied_boss": "🥰🥰Love this color combo!!!!", "iamchiclymade": "It is amazing to have watch your growth since you first came into my life as a TJ, it has been many years later and you have made an impact on many, Thank you", "raefelicia816": "New dollar store line coming.... and I am HERE FOR IT!! 😂🥰", "sydmschachter": "$700 huh?? What to do with all that coin? PREMME ANYONE? Imma just blow it on summer wardrobe. That 💰💰💰💰is going to be gone faster than you can say EXPRESS SHIPPING. Thanks lady.", "mrssclmn": "Looking like a million dollars in front of a 99 cent store... alpha move", "gabey68": "Such a beauty. That’s for helping me see myself with fresh eyes. Congrats of the 700k. Woohoo 🎉!", "nataliemcvittie": "Do you ever get tired of looking so dang good?", "aposhsizedlife": "I scrolled back and forth three times before deciding to say something. An arson burned down my little hometowns restaurant and bar two days ago. I’ve been really down. But the thought it spreading love really resonates. Keep up the love @gabifresh", "femmefatima_xoxo": "Congratulations love!!! ♥️♥️♥️✨✨ I promise I’ll spend all $700 on clothes from premme 🤗🤗 (and prob pay a bill or two lmao)", "ayeshawrites": "Reading the comments like bruh damn its hard out here we all need this money 🤣", "pourlafete": "Congratulations! I always quote your statement from your early blog days. Wear whatever makes you feel beautiful, even if it comes from the maternity section. Your outside the box concepts are themes I live by. You’re fearless! Congratulations on 700k! 🍾", "tammq": "Wow congrats on 700k. 😊", "og.op": "@gabifresh girl listen I live in Anchorage Alaska I’ve followed you for years now and you have literally inspired my cute juicy self for so long, I’m getting ready to move to Arizona after living here in Alaska for the last 16 years and your girl is beyond scared 😱! This is about to be the biggest thing I’ve done In my life any advice to offer while you consider helping a sista out 😂 #oneofyourgroupies❤️ @gabifresh", "ms_flouncy": "So beautiful. 😊 congrats on 700k! I don't know that I'm witty or funny enough to earn the $700, but thanks for inspiring us!", "kiwicurves": "Babe ❤️", "helenaartates": "Love all of this so much!!!! 🧡", "beautifuljustthewayyouare1996": "Lord your gorgeous 🔥❤️ and $700 would really help myself and my family out right now my car just broke down, then again I'm sure many more could use it more so chose the people you feel compelled to help. You'll be a blessing to many ❤️", "itzellovato": "Wow a generous queen! P", "leauxness": "Well the 99cent store always has hidden treasures, and you happen to be a treasure so it’s fitting that you match!? 💕😘💕", "iam.superwoman": "Seven is my favorite number, it is the number of completion, the number before 8, the number of the month I was born, the last number in my birthday (27), and the number that is going to help me become $700 dollars richer 😂😂", "lagrosera": "I would buy so much literal cheese with that much cheddar", "lush.touch": "It makes me so happy to see your pics in my feed. Seeing people who are shaped similarily to me look so confident, beautiful, colorful and happy, well that makes me happy. So thank you. Thank you for spreading the happy.", "arayofaimee": "Learning us how to be fierce, love!", "beautifulblends69": "You have legitimately inspired me. You were one of the first plus size bloggers I followed. Great to see your growth and thank you for helping make Fat, FAB . Salute to you 👏", "truly2blessed1": "I love your light @gabifresh you’re a boss, beautiful black woman and a fashionista! Keep Killin’ It", "lizdaldal": "You give us all the courage to step out and be ourselves. 🔥💕🔥", "riahrae13": "You are just plain beautiful. Inside and out ❤️", "sosefinahulu": "700k soon to be a cool million + followers ! Just being you and real from the jump start speaks/shows volumes! Do what ya do Oh So Gabifresh🙌💕🙌 101% spreading love on a international level~ love from The Bahamas🇧🇸", "miabligh": "Yass gurl u have snatched our weaves again", "shehasbigplans": "I hope everyone’s having a beautiful Saturday ❤️", "lucky.love.xo": "Positivity encourages positivity. ❤️ Love the engagement here and inspirational comments. 💋", "fromevansridge": "💕Thank you for just being you and congrats on the 700K followers!", "hollynh": "All I could think when I saw this picture was “wow, you’re like, really pretty.” ❤️", "kawanita11": "Loving everything from the hair to the earrings to the jacket 🥰🤩", "myfairkatiebug": "Your sentiment \"I’m just trying to change the world one fat girl at a time\" gets me through tough days!!! Some people really hype up Francis Perkins, but you're my fave Mount Holyoke Alumn!!! Consider this my red Pegasus '18 self sending your blue Lyon '08 self love.", "meganplayforth": "Wow this is so nice of you 😍✨", "asap_sara_b": "Well deserved follows. You are an inspiration and a joy❤️", "jdaythediva": "Yasss! 😍 Congrats 🥳🎉Thanks for all that you do for the plus size community. I'm so happy I found your swim collection, underclothes, and clothing. I'm grateful to your platform that emphasizes body positivity. It's awesome knowing there are sexy clothing / swim options in my size.", "feministandfluid": "So imma keep it 💯. I will first buy my child a few necessities: • Pants because even I know high waters are not “in”. • Underwear because going “commando” is only cute when it’s a choice. • A Play kitchen because one of us needs to learn how to cook. I’m also going to buy 1 thing I need: TWO DAYS ALONE. • Two days reading books WITHOUT pictures or a potty. • Two Days listening to music WITHOUT obnoxious hand gestures (ie. baby shark 🦈) • Two days eating at restaurants WITHOUT “free” toys (FYI: they cost $1). For 363 or 364 days (his birthday is literally #leapyear) it’s ALL ABOUT the munchkin. And I’m cool with that. I just need TWO DAYS. (Ps. I’ve already picked out my swimsuit - the green one you’re wearing drinking a #moscowmule). Fingers crossed and thighs juggling, B.", "lesliemg87": "Congrats Gab :) you're one of the main reasons I'm not afraid to wear a bathing suit", "ltinthecity": "Walking past the mirror, oh, damn she fine! 😍", "sierra_camille": "Been on a huge journey of healing and loving my body and as strange as it is, you’re one of the people who’ve been helping me get there🖤", "styledtosmile": "Wow, you are in incredible human being 😍 I love your style, confidence, boldness, and kindness. Thanks for being the kind of person we need more of in the world 💕", "riamichelle": "Ok Miss Oprah, we stan a generous queen 😂🙌🏾", "complexkiz": "😍😍😍😍", "darylmiles8": "By looking at your face I can only remember one thing, a tomato🍅 can", "minacakes": "Why couldn’t the toilet paper cross the road?..........................................................................cuz it got stuck in a crack! 🥁🎭 😂🧻#thatsmybestjoke", "han.ec": "Thank you for the work you have done for the plus size community & for making women like me realize how beautiful we truly are 💖💖💖", "alainamarissaco": "Your glowing radiance from the inside out is breathtaking and inspirational. 💜✨", "tempika": "anyway seeing your smile is priceless (kissing one cheek and another in Russian style) :))", "jaisav": "I don't have anything funny or witty to say but your outfit and style are STUNNING, especially love this look ❤️", "joneexo": "Thank you for just being you.", "siempresobrealecia": "I mean...I just ordered two new bookshelves without telling my husband. So if I could tell him “my friend Gabi brought them for me” that would be clutch 😂😂He might start asking questions about why I have some woman buying me furniture...but....🤷🏽‍♀️", "urbandimpsx_": "Congratulations!!! 🎉🎉 I wish I had something funny to say 😭 but Your one of the main reasons I started my online boutique!! Your so inspirational and your the epitome of a girl boss 🙌🏾 I’m now in the process of revamping my boutique and making it the best that I can and that $700 dollars would literally help me more than anything 😩", "msginger2013": "Living and loving yourself.", "hotmargaret": "OG follower from the LJ days who needs $700 to split : 350 goes to abortion rights; 350 goes to my addiction to buying clothes for my kid because I don't fit anything 👏😚", "mztonigenea": "Chameleons match wherever they go!! Killing em with the curls!😎", "riagreg": "You deserve it! I’ve been following you for a while now and I enjoy all of your posts. I may not comment a lot but know that you have supporters out here watching! 👀", "creativegoodness_": "Gabi you are the first blogger I started following back when I was in college. Your message of self love and embracing the skin your in helped me. You are so f****ing fly. Go off sis. So proud queen 👸🏾!", "maadamss": "Love seeing livejournal folks thriving ❤️ thanks for starting to reframe my thoughts around fatness, Gabi.", "pigsflyy": "One day while looking at my son’s report card, I realized he had an ‘A’ in Spanish so I said, “Awwww! You have an ‘A’ in Spanish. Say something in Spanish”, and he looked me dead in my face and said, “¡NO”! 🤣🤣", "theiseult": "👍🏼👍🏼👍🏼", "nichelleinberlin": "I have always loved your style and your beauty! Thanks for sharing your style with the world!", "ms.nickles": "Aww congrats girlfriend and yessss spread all the love🌻🌻", "carisahatfield": "Are you matching the 99 cent store or are they trying to match you...? Just sayin 🤷🏼‍♀️ Congrats on 700k!", "winter_clicks": "I wear bright, happy colored swimsuits in the summer time with my little girl and I give zero cares what anyone thinks because of you. If you want to share money with me, I’d appreciate it, and will fix my car’s air condition, but if not, still thank you so much for being you and using your influence for good vibes and confidence. You got good karma headed your way...👍🏾", "findingkendra": "@gabifresh with $700 I could throw my cat (Murder Mittens) that Bar Mitzvah he’s always wanted", "beautifulutahmountain": "Owe you look like a beautiful barbie doll.", "hyppi.magik": "Gurl I love you help me be a thot in Miami next weekend. That money would make my vacation lit lit then more lit 😩😂", "pinkeevee": "Gorg🔥", "definemii": "The 99 cent store said it's just trying to match your flyness lol continue to kill it, sis", "bamitstam": "I’ll buy some more Gabi x Swimsuits for All stuff and it will be like you never even had to give me $700!", "jemmyluv": "Nice... please does this generosity include your african fans? Asking for myself 😭 but on a serious note thank you for teaching me how to have confidence and to love myself more😗😍 you're the best😘", "teccorrabracy": "You are so inspiring for so many thiccc chicccss! Thank you for being you! 💞", "polynesian_princess": "💗 love the fit 😍 even more so it matches the dollar store I can relate more to that than of it matches the gucci store 😅", "_lovemecee": "Omg how dope are you! Cannot wait til I can do things like this + you look amazing per the usual 😍😁", "stacycitron": "What you think about, you bring about 💕 your page makes us think only the wonderful things! Thank you!", "emilygoldhammer": "The 99¢ Store is the JAM. One time I found a can of Spotted Dick there. 👀", "misscarolineann": "Seriously you are stunning! Thank you for giving me confidence to be my true self on my Memorial Day trip with not so loving family. I will love myself no matter what ❤️", "peacesofakid": "I just need some money so I can visit the crew since I missed their graduation 😩😩 @_nyco_ @mardochetelusma @patriceanne_ @katburnn", "_itskeeks": "Idk if this will make you laugh but I passed a Mexican restaurant today that said “in queso emergency call 9 Juan Juan “ 😂", "wynterwondaland": "My pride is like bih Don't comment but my pockets is like 👀 say something funny bih or it's ice for dinner tonight again 🤣😂", "nayyirransome": "A Chinese restaurant line cook decided to launch a rap career. You know what his first single was?", "cachimbona_fefa": "You got us all out here sweating in the comments trying to think of something to write 😂 but I would like to see some $700 👀", "afrovocative": "If you’re still giving away cash, I’d use the $700 to get a new lens and lighting kit for shooting my documentary about black masculinity. 👀👀🤗🤗 *cardi b voice* all i need is the money! 💃🏾💃🏾", "destinyy.jay": "We need more bathing suits! 😩😩", "kayangelle": "Thanks for sharing who you are with the world. Not only does your beauty shine, but you have redefined sexy for so many women! Thank you!", "sonya_nicole": "Congrats!!! I love following you and your story and you make me feel happy in my own body ♥️", "xenathediva": "I lived in the IE for a few years and I loved the 99 cent store! I convinced my Cali born and raised bf to move with me back to my home, MN. My boyfriend was disappointed there are no 99 cent stores and he couldn't but Soil Love anymore. So his mom shipped us a box full of it! Congrats to you on 700k followers, I'm actually surprised it's not more!", "rachelinpublic": "if this isn't a world on wheels, wanna dance with somebody, we likes ta party look idk what is! 🔷💓🔷", "bourgeoisiekris": "🔥🔥Thank you for those 🍊 velvetttty ass pants 🔥🔥 PREMME4EVR", "imanisasa": "So. Once upon a time (not yesterday), I spent hundreds of hard earned white privilege adjacent bucks at the most joyless place on this earth for some toddlers to ogle a fake duck. All the younger one wanted to do was sit in the parking lot watching busses go by, but then he reluctantly entered purgatory with us and refused to leave the bench that this particular real life duck kept telling him to meet up at. Meanwhile, the older toddler lost all of her act right reserves when I made the completely illogical parental decision to save $10 and just buy ONE balloon for two toddlers to share. Of course the younger toddler won that battle. Then I spent my last $10 on another ballon. Just in time to come back to the other one busted up and all the tears flowing. Lesson from the Universe: it IS ridiculous, but...Spend that $10, mah. It’s worth the 4 minutes of peace and quiet.", "ohheyolive_": "Don’t worry @gabifresh we’ve all been humbled by a dollar tree at some point in our lives. Matching the exterior, debit card being declined on 1 item… happens to the best of us!", "andirockzz": "💓💓💓", "lenhlee_": "❤️", "brittanykingpleas": "You a real one ♥️", "veronicaaagiii": "@gabifresh $700?!? Babygurlllll! So you telling me I can actually now keep the clothes I try on for my youtube hauls and not have to return them!?! Is there a god lawd??😩🤗😂 Thanks for creating a lane for us big gals who are told we take up too much space...you created the biiiitch hold my purse I got this for all of us!! 😘💞", "eb614": "@gabifresh thank you so much for being the designer to design cute fresh swimsuits I can feel confident in. You couldn’t pay me to get into a swimsuit before I found yours.", "shadabenz": "🙌🏾 Congrats on 700k. I enjoy your posts and positivity", "casa_blancaaa": "After suffering from food poisoning and no cell service the last two days, seeing you is such a treat!✨♥️😭", "_lena_bean": "WOWZA!!!!!! You are a Babe-O-Rama. So is everyone reading this, no take-backsies 😎", "waldopi": "Gabifresh out here serving us \"Ilana from broad city discount diva\" yas yas yas girl pop dem tags!", "leonoork": "Please donate ‘my’ $700 to @theoceancleanup to rid the oceans of plastic, so that one day, we are the only thing that’s plastic fantastic", "dannidsc": "You deserve it. You’ve been putting in work for a very long time. Young fat and fabulous changed my life and my perspective of self. Congrats🙌🏾🙌🏾", "synniesthesia": "I lost out on a job interview because I sprained my damn knee and am on crutches! Accessibility is no joke. 😬 But that’s life! Could use a little 💸 my way 😂 Congrats on the 700k 😍 All that love is well deserved 💓🙌🏼😘", "jenfloss": "Your fatkini piece changed my life. I'm so glad 700k people get to be inspired by you too. You deserve the absolute best! ❤️", "iq07": "Gab thanks for spreading the love ! You are showing us that can look extremely gorgeous!", "pusssybow": "I didn’t even realize this was a giveaway on first glance and instantly liked it bc of the dollar store comment 😭😂 but now that i saw the post again I gotta throw my name in the bag bc kids are crazy expensive 💀 especially when they have a mom with a shopping problem like me 🤷🏻‍♀️", "thegirlkimbo": "Okay, so I love you and am thankful for you and many others who laid out a platform for us! As a beautiful, thick, woman I am so for this!! ❤️❤️ And I also could use $700! 😂😂 Thanks @gabifresh for being YOU! ☺️", "marfasmif": "💖This inspo got @janellemonae ‘s PYNK !!", "emilyruthless": "🎶Gabi Gabi Gabi can’t you see sometimes your posts just inspire me, and I just love your fashion style, and how you always go the extra mile. 🎶 sing to hypnotize by BS. 💛💛💛", "fashionably.bougie": "CONGRATULATIONS! That is the true definition of GIRLPOWER 💋💋💋❤️❤️❤️", "sunshinewalker": "Of course you have 700k followers, because you choose to be a positive roll model and bravely put yourself out there. You’ve worked really hard and what a blessing that you get to give back to those that love and support you! Keep rocking and rolling, lovely! Thanks for all the inspiration you bring to the table. 💝", "nataliemeansnice\nVerified": "Verified", "kjbusybee": "YOU are the reason I wear crop tops and bikinis 🙌🏻", "shmwhit": "Gotta toss my hat in this ring! My girlfriend and I make enough (thankfully) to pay our bills but that’s about it! I would give my Aries sun a summer vacation where she can charge her melanin in the sun and I can just watch her shine! 👩‍❤️‍💋‍👩🌞no one deserves it more than her. She works FT and goes to grad school FT. She’s going to change the world one day 💕", "luz1prieta": "The curls? POPPIN The skin? POPPIN The fit? POPPIN Beautiful in deed 😘", "rainydayrita": "💖", "mraybaybay": "Glad you hit such a mark!! Always enjoyed following you and your fresh-to-death style here 😍🎉🤗", "charissahogeland": "Your style is THE MOST. I love everything you wear 😍😍😍", "dopeboyz_wyf": "😍😘 gagging at your humility, charity and flyness inside. Sis be an inspiration!!!💪🏾", "margueritebb": "i remember in HS when i first started following you & was so in awe that someone finally showed us how much style and DRIP can come out of curvy girls! been following ya ever since! ya da best!", "ms.adair": "This is so very nice! Thank you for your generosity❤️", "normasinsta": "So pretty!", "alyssalevisee": "@weirdbutacceptableflex spreading the love to you my dear. Thank you for everything ❤️", "meglacasse": "Daaaaaang 😍🤩😍🤩😍🤩", "aneesafolds": "Lol idk how to make myself standout from the rest here but lemme just say when I was scrolling BEFORE I EVEN READ THE CAP. this pic made me stop and audibly say “DAYUMMMM” on a whole subway 😂😂😂😂 so hope me humiliating myself in public for you is enough 🔥🔥🔥😍😍😍🙌🏾🙌🏾🙌🏾", "a.sound.heart": "Honestly so happy for you 😍👏 I started following because of your swimsuits but I stuck around for your positive posts and your additude. You are absolutely stunning and I'm happy to be one of your followers", "elizabethwest": "So kind you’re doing this! If I won I would put it toward my vet bills for my 12 year old chihuahua. It’s been a rough month but I always look forward to your posts!", "calisunangel": "We were once in a spa together and I was totally fan girlin on the inside, naked and all 😂😂😂 you were super sweet to me, we shared kind words and smiles. Thank you ✨💖✨", "sexandthequeencity": "I'm poor. Cashapp me 🤷🏽‍♀️🤷🏽‍♀️🤷🏽‍♀️", "sades0123": "I don't want to be entered. But you deserve love and I am happy the 700k think so too. Keep it up! 😘", "keelymccoy3": "I could pay off 1/394626th of my student loans with $700!!", "bohemdgy": "Where is this jacket from? You look stunning", "a.sardelis": "where does the general keep his armies ?  in his sleevies!", "mikaelabolds": "Thanks for being a great role model for everyone out here that looks like me honestly! Found your page awhile ago and I so enjoy your content! Poor college student over here that’s been working 3 jobs and powering through! This would help!🎉💕 👈🏽🤞🏽", "katieyeilding": "Pls flex all over me I just lost a job and idk how I’m gonna pay my rent but I also just love you no matter what congratulations! 💚 You inspire us all dayyyy! 🤗😍💚", "holistichoneydip": "Here’s a little affirmation for everyone: I am abundance , I am success , I am generational wealth. I gracefully dodge every bump in my path , I face every challenge bravely and my inner strength bolsters me. I do not comprise my values and integrity for anyone or anything. My success will last to inspire others beyond my time on this earth. 💞", "jenniquess": "Can I vote for @bettinasays as a winner?", "ohhhhhhhhhoney": "Gabi!!!! *curtsies* omg please make it rain on some broke college girlssss so I can take me and my best friends on a trip to see family! We are dying to get out of BFE Louisiana for a min and we’re all broke AF 😫🤩 We promise to send postcards!!!!!!!!!!!!", "jenny.cola": "This is super kind of you! 💕 Idk what it is about the Plus Beauty Community but you ladies and your supporters are all so amazing at paying it forward. Finding influencers like you made me feel less alone and I know many other people feel the same way. It feels like I joined the coolest girl gang and we are all rooting for each other while looking fabulous 💁🏻‍♀️ I hope the money you are generously giving away comes back to you 10 fold!", "thatzdeck": "$700 going right back into your pocket since i spend all my money on @premme.us and @gabifresh swimsuits anyway lmao", "bail.bear": "🤩🙌🤩", "jennfricksof": "@gabifresh you deserve 700 MILLION FOLLOWERS!!!! Thank you for all the hard work you’ve poured into the plus/body positivity community 👏👏🏻👏🏼👏🏽👏🏾👏🏿 We have come a long way from where we were even just 5 years ago. I’ve always been plus size and never loved my body until I saw your swimsuit campaigns. I saw you and was like... “that’s me!” 😳 you represent my body and so many bodies that I started my own body positivity movement. Nothing large scale. Now I take time out of my lunch to go around to women AND men in my workplace and tell them how beautiful they are regardless of dieting/exercising, etc. I just want to spread the love and make sure they know that they are perfect just the way they are. LOVE YOU FOREVER!! ❤️😘🥰❤️🧡💛💚💙💜🖤❣️💕💞💓💗💖💘💝💟☮️", "ansleyandmomma": "Amazing!!!!!! 💗💗💗💗💗 So generous and kind!", "beautytowne": "💖💖💖", "juneprzdiaz": "Here I am barely able to afford ramen packs and Gabi over here is like oh I will give out $700 to 7 followers. You know how much ramen I can buy with $700 .....alot. maybe like one hundred or sixty. Idk I'm not good at math...but still that's a good chunk of ramen!", "fatima_tall": "Found you last week and instantly loved how literally EVERY outfit you post slaps so hard!! Shine that light! I’m tryin to roll up this summer lookin as bright and fresh as you are! 💫🌟", "sachafierce": "You having 700k shows how much you have embraced your mind and body. To show people how to love themselves just the way they are. And that you don’t have to be a size 2 to be a model or an influencer in this world thank you", "jazmineshepard": "@gabifresh strong women like you inspire other strong women like me, to make power moves! Seeing you as well as so many others inspired me to move to NYC, now I’m trying to make it in the blogging world, I just turned 21 (May 23rd), moved to New York with no job, and now work a minimum wage part time job that I hate, so you can say I need the money! I want to make this my reality, and not get back into couch surfing! Love you!", "shellyrozzelclark": "❤️❤️ Cutie Pie", "fanycoco": "Gabi the GOAT! 🙌🏾👑💃🏽", "jackie.jaxxs": "You mean the world to me🙌empowering, fierce, fly, beautiful, fearless, phenomenal women! Continuing to Push the norm with curves. Love love love you continue to shine so bright❤️❣️💋😘", "sasi_chickett": "Love the jacket!", "dlmiles7": "💕💕", "inhak_mrjwperforms": "700k followers! 700x7...3500! Wtf you still doing shopping at the 99cent store? Never too good to grab some dollar munchies:)", "jmeezay": "Congrats on 700K! Your style is such an inspiration and I love your brands collabs so much. Keep going, keep representing and I'm sure you'll be at 1 million before you know it 😘", "glambynicole_": "Girl this jacket 😍😍😍😍", "justmeceleste": "Gabi Fresh to death like a million bucks 😍", "mstoilj": "Gabifresh serving up dollar store looks because style has no price tag! 💁🏽‍♀️", "chrissyazevedo": "I’ve been following you since you were a blog. You made me more confident to wear more fashionable clothes instead of the black drapes I used to wear. The first time I saw you in a bikini- that was the moment I no longer accepted to wear an old t-shirt and basketball shorts to the beach. You continue to inspire me to take care of myself which before you wasn’t something I considered of value. Never stop being you!", "yourfriendmyra": "Thank you. Love, Fat girls everywhere.", "kvinson22": "Congratulations and you are amazing..I love following your page 🥰🤗", "kimkatrinc": "That is such a kind thing to do for folks just to celebrate 700K, you really are spreading love ❤️", "utdiva4877": "Get it lady!! Been watching you from wayyyyy back! Thanks for all you do to keep us laughing and living in style! 👏🏼👏🏼👏🏼🙌🏼🥰", "candi.nicole.35": "You are so beautiful and truly a inspiration to us plus size ladies , congrats on the followers, girl lemme get that $700 and I'll be right on swimsuits for all buying a bathing suit from your collection slayin on the beach killin the boardwalk like it's a runway", "kahytal": "I've worn leggings as pants for the first time in my life the other day and I felt so damn A.M.A.Z.I.N.G. 🤯 And that's all because of you and the body positivity community. How can I ever go back to regular pants now that I can comfortably kick at any given moments, at any given places? Look at me becoming Bruce Lee 🤠", "ni0nn": "I JUST discovered you, your kindness and generosity is healing, uplifting and absolutely beautiful as it shows through everything. Finding that peace, confidence in ones self through somethin as fluid as fashion. I grew up with a seamstress with fatphobic tendencies, unlearning that is difficult yet possible and necessary . Much love to you honey, a gem of a person, make that coin stack that bread , modern robin hood to the community. 🌹💖🌹💖🌹", "_alexanichole": "Congrats on the 700k!! 🤩🥳 I love seeing fellow women that have similar body shapes to me flourish in life! 😍💖🥰 It’s a good reminder that beauty comes in all shapes and forms!! Keep prospering mamacita!! 🤪😘", "kimmeew": "You are stunning inside and out. I’m glad more and more people get to experience your positivity and feel inspired and beautiful. Keep up the good work because you’re making us all better", "soopgoddess": "the fact that you got it like that. #YRB", "fromunderthecorktrees": "Those colors look amazing on you!!! I love a good jewel toned outfit 👍🏼👍🏼👍🏼 I would be able to do so much with $700, like pay off some of my debt so I can actually relax for once! 😅 Thank you for being so grenerous! 💜", "navydotz": "I had never heard of u until I was just reading a Glamour magazine article by LINDSAY SCHALLON that was on my Google feed & she mentioned you as an inspiration. So I clicked the link & Lord behold a beautiful WoC looking fierce in eye popping metallics. You go girl! 💙", "kaitlynquigley_": "When you match the store because you’re the best value 💁‍♀️ Congrats on your growth and THANK YOU for creating swimwear that gives curvy+big busted ladies like me cute choices!! Your line gave plus swimwear (especially 2 piece choices!!) more visibility and I’m forever grateful.", "vizariz": "Congratulations and keep being your beautiful self! 💜", "belwoz": "Love is the greatest of all", "let_em_know_nique": "You’ve inspired me to be myself in more ways than one. Thank you for sharing your light and congratulations 🎉🎊🍾 👏🏾♥️", "tbdsince1983": "Like lizzo I am on Soulmate and I know how love me...aka listen to more Lizzo!", "crimsoncanecakes": "You are my total fashion crush, u kill every time! May God continue to bless u #onelove", "tehgreat": "💕💕 What a generous gift! You’ve brought the plus size community a long way.", "missenocha": "You deserve it love ❤️", "thoughtthnkr.phd": "$700‼️ Goes to write a caption...comes up with nothing 🤦🏾‍♀️ #INEEDThatTho🥰", "shibby_pie": "@gabifresh I just wanna spend my whole $700 on @premme.us. 😎 So if you're looking for a return on your investment, pick me, pick me!!! 🙋🏽‍♀️", "everydayrunway": "I’ve been following you since your Young, Fat & Fabulous days. You always broke the unwritten fashion rules and showed us plus size girls how to be confident, love our bodies and where whatever the hell we want! My fave Gabi moments over the years are watching your journey to become MTV’s twitter jockey and when you broke the internet and rocked the fatkini that time in Vegas, I think. I had the pleasure of meeting you at BlogHer in Chicago several years ago and I’m just proud of your growth and how you helped change the landscape of fashion for plus size women! Keep going, I can’t wait to see where you end up! 🙌🏾#xoparker", "leahdahlia_": "I just ordered two of your swimsuits! I got them in the mail yesterday. Both of them fit PERFECTLY, and I felt like such a boss bitch, I wore one around my house for the rest of the night!", "courtcampy": "your skin is absolutely glowing 🔥🤗 & it’s clear that a kind soul lives behind your eyes 💕 i hope your weekend is lovely!", "peerhussa": "🙌", "considerately": "What did you pick up at the 99 cent store? I’ve heard they’re full of great summer party decorations right now! 🏝 🍍 🎉", "claudiayankee": "You are radiating! Your makeup. That jacket. Everything about you in this pic is too fabulous! 💕🔥", "eliselicious91": "😍😍😍😍", "honeygums": "That money could really fucking change my life right now.", "varouna": "Congratulations! I hope your partnership with the dollar store is fruitful. 😂", "_vaishu.21": "✨ bless you", "roraboriealice": "You are such a bright spot of positivity in the community. I bought my first, second and third bikinis this season evacuee of Your amazing looks!!!! My belly hadn’t seen the light of day since 1999. But I saw You rocking some awesome two piece suits and I had to do the same! Thank You for that. I may be 40 but wearing a bikini has me feeling like i’m 25 again!!!! 💜💜💜", "danni_with_the_vibes": "You might match the 99 cent store but you, my friend, are priceless! Totally killing it...curls poppin, outfit fresh, skin glowing! 😍", "dopegirlfresh": "something i keep reminding myself of: i don’t have to apologize to myself for how i survived a hard time. nobody does. we get to examine those survival tactics and then do something different, something that reflects how far we’ve come and how we’ve healed. 💕 💕💕💕💕💕", "sino_seastarr_trpl.s": "Yassss gal FRY US we are your eggs 😎💋💄🍳", "natassjabetancourt": "I need that jacket to be the fiercest🔥 wheelchair curvy b*tch in town", "laurenkellybenson": "It’s so hard to see it on myself in the mirror... but I seeing and loving you makes me realize I can see and love myself! As I am. Not in some one-day-I’ll-lose-80-lbs kinda way. Thank you for that gift! 😍👑💪🏽", "cronxdogandme": "Hey Gabbi! Monday is my dogs birthday He could for sure put that $700 to good use! 😃❤️", "chelynnrenay": "You are so beautiful and an inspiration to all of us fat/thick girls out there to wear whatever tf we want and be confident in it. We have no choice but to stan. Lol. 💕💞💖", "spacecatrules": "Last night a friend and I were discussing living our bodies and liking ourselves as we are NOW. We perused Instagram looking at examples for us. Women who are not hiding themselves. You were one. Thank you.", "gailywaily1989": "550 GBP for free???? Long live the queen!! and I’m not talking about Elizabeth xx", "shelbyqqq": "Been there since the beginning so happy for you ⭐️", "cassiekoos": "Wow I love the Matching outfit to the setting! “I got 99 cents and my fashion has won” 😍You look beautiful and I love the earrings, your hair a smile! Rock it! Wishing you a magical day filled with joy and bliss!", "abbyrobywright": "The jacket is AMAZING 😍😍", "jessicaviveross": "wow i think what really amazes me about you is hat you genuinely feel that you care & in such a world as this, thats SO hard to find. you truly are a genuine caring person and im so happy to have stumbled upon your instagram. sometimes i dont have the confidence to wear certain things but following you for so long, ive gained this sense of confidence .. BUT BETTER. & no amount of money could thank you for that. i was so low when i first found your IG, but i rly wanna thank you for that. truly. ♥️", "funschein": "I’ve been following along since almost the beginning, I think. Since before MTV when you were living in...Chicago(?) and the best options we had were Torrid and Lane Bryant. I’m so happy to see how far you’ve gotten and how many people you’ve reached, and I can’t thank you enough for the positive influence you’ve had in my life and, most importantly, my closet. ❤️", "c00kitup": "Just stopping by to say thank you for your existence💗 I’ve been a follower for at least 6 years now since college and you’ve consistently inspired me to push my fashion in the direction of authenticity and what makes me happy. I’m grateful that you’ve stayed a positive voice in our community (and for providing us with the baddest bitch swimsuits ANNUALLY! I’ve been in love since the first galaxy suit! 🙌🏾✨☺️)", "happyis_u": "💖LoveLove💖your Jacket 💖", "mamidebaboosh": "I love that you did this accidentally because I think I might fully do this on purpose just for the gram 💕😂", "craellish": "Whether you call it paying it forward or sowing a seed into someone, this kind of investment can affect a life long after the $$ is spent. You are a true visionary!! For the Nos we’ve been told, you’re about to send 7 Yeses*! Thank you!!", "sonja_1988": "Congratulations 🎊! You look amazing by the way! Curls on 💯 and pink is definitely your color 💖💗!!!", "vees_the_bees_knees": "I just want to pay Navient and not have to worry about my others bills being behind because I don't have enough this month.", "jametar": "Such a cute and fresh looking picture", "amanda.moorer": "Laugh because you have breath and life is good good!🎉🎉", "nadjahmdabney": "LISTEN Sis! 🗣 You are ALL THE THINGS! I just remember that Black Enterprise cover when you first started in your career. So amazing to where you are now! Congrats on everything! 🙌🏾", "earniebean": "Silent follower, since joining insta. Congratulations.", "afrokittydc": "Congratulations, @gabifresh! Know that you also inspire us older followers. I’ve stopped wishing I had influencers like you when I was your age and now just appreciate that you’re here now. I’m applying all this fabulous mindset, energy and opportunity for beautiful clothes at age 50. We’re never too old to learn, grow and evolve into the best versions of ourselves (even with less collagen and not so perky boobs 😂). Cheers to you and your continued success! 🥂", "blubirdcreative": "You are so wonderful and wholesome and a force. Thank you for being grounded in your confidence, being an inspirational support for anyone who doesn't feel like they can be or wear whatever they like, however that looks. So much love for you and the 700k followers of stunning, powerful women who look up to you 🙌❤️", "endimion_tuki": "😊", "alwaysacandygirl": "You got the juice now 😜😜❤️🤣🤣", "daqueen626": "I love your hair. What is the name of the cut?", "jennblakely": "I ❤️ that pink jacket!", "muva.mara": "Keep inspiring. 💕 Not as poppin as you but I did just get my master’s on Thursday. Feels cray 😂", "mz_purrfection": "Gorgeous!!! ❤️❤️❤️", "dralexea": "Aaaaaaaaaaayyyyyyyyyy 🙌🏾💖💪🏾🤗🤩😍 what a dope thing to do!! So generous!! Thank you 😊", "regincredible": "Your hair is iconic! The cut really shows off your curls! 😍", "willow.tremaine": "🎀 Pink is life 💗", "kekepicturesbelike": "I love love love your hair❤️!!!", "spunky_brewstah": "I’m here for it!! I’m also here for $700. I want that. 🗣SPECIAL DELIVERY! I need that 🗣SPECIAL DELIVERY! Can I have that? 🗣Special Delivery! Give it to me ... {harlem shakes like a mad woman}😂😂", "yojaida_": "congrats babe!! 🥂 a toast...to all the poorly sized clothing that didn’t have the chance to get on our beautiful bodies, you truly WONT be missed! *dj khaled voice* don’t ever play yourself!!!! also need to stop playing myself racking up my cart with 700$ worth of stuff 😤", "maggierosie10toes": "You are beautiful inside and out and an #inspiration thank you for being you - you help role model confidence in this crazy, troubled and stigmatizing world. Thank you for you ❤️😍🌈🤩", "mimi_brudiosa": "Shout out to you for being as free as you and for sharing so much of yourself with us! This $700 would come in CLUTCH so I could jumpstart my business. Trying to be a boss ain't cheap lol. Take care, xo.", "lets_make_snow__angeles": "Tbh you’ve inspired me so much with slowly learning to appreciate and love myself. It’s taken me a very long time to get to the point where I don’t mind if I’m wearing a croptop or a bodysuit or a bikini. And it’s all because of inspiring and powerful women like you. Your line and who you are are so influential to so so many people and i am so entirely grateful❤️❤️❤️😭 KEEP BEING YOU AND NEVER STOP 🥰😤", "rachelannmorris71": "Perfection", "kvinnokonsten": "🔥🔥🔥", "writtenbyjai": "Sitting in the middle of the Balearic Sea on my way back to Barcelona from the Amalfi Coast with one of your swimsuits on just hoping my Spanish can carry me through my time in the city. All I remember is, \"Donde esta la biblioteca.\" Plus, rent is due when I get back to L.A. and I'm sick of bills being due every month. I just paid them shitz lol. I'm getting paella regardless.", "sarahpalisi": "Congratulations! Thank you for being part of the folks that show up for diversity in beauty or simply diversity period. Social Media has it’s problems but people representing a variety of bodies, identities and perspectives on Instagram has been a gift ❤️", "warriormom_za": "Thank you for always making me smile... Either making me feel better about myself or with posts like these that just brighten my morning 😉 who knew a 99c store was this fashion forward lol", "french_and_foreign": "Without you I would have never accepted to go the beach and enjoy myself and wear cute bikinis and just be happy. Thanks @gabifresh 🙌🏾😘", "inspiratesi": "😍😍😍😍😍😍", "nananmo7": "99 cent Store Haiku for @gabifresh “She radiates light / Her journey from there to here / Is inner freedom” Congrats on 700K! Though it severely underestimates your influence. Thank you for all the ways you use your platform to bring positive energy and your beautiful smile into the world! If I’m blessed to win, I’ll give it to my sis who has a big heart like you. She is saddled with so much student debt. I wish we lived in a world where education—especially education geared towards helping humankind—didn’t indebt so many people and worsen inequality.  Onward to millions more followers!! You make me proud to spell my name w-o-m-a-n!✨✊🏾✨", "journeyinglou": "🇨🇦❤️🤗😎🌞🌎😜🤩😻👌💄💋👠🐶🐣🦄🌹🌝🌈🍔🧁🥛🎧🎼🛵🌅🔮🧿🗝💌❤️☯️⚜️🆗2️⃣0️⃣1️⃣9️⃣↕️↔️🔴🕛🇨🇦", "slotved_slotved": "Since I found your insta im smiling more when I scroll through. 🙌🌟", "annabellfromhell": "@gabifresh @margotmeanie It's strong, beautiful, fun, fresh, diverse, caring, loving, positive centric people like you ladies, that make the world go round! Also here's a joke for everyone [its not an original but I would call it a golden oldie]: what do you call cheese that's not yours???? NACHO CHEESE! 🧜‍♀️ Spread love and cheese! 😘😘😘🧀🧀🧀", "amandawesscoast": "I'll use it for art supplies to make you and all your friends amazing earrings😂💙👀👀👀", "patrolboatjudy": "Ahha I love seeing your face all over the internet, I remember you from LiveJournal days via @bular!", "missraek9luv": "Live. Love. Laughter 💗", "unforgettable_queenbea": "My juicy girl inspiration 😍", "tsunamichiqi": "You're amazing keep being an inspiration to women, following you and seeing you slay all your looks from regular clothes to swim suits and lingerie makes me feel good about my body I see you slay and I want to do the same congrats in the 700k. Keep being amazing Hun ❤️", "licmisikri": "thank you", "maritmisund": "🎉🎉", "lcpeichel": "Knock knock.  Who’s there?  Tank.  Tank who?  You’re welcome. In all seriousness, thank you for being you! Your bad ass entrepreneur skills and overall slayage are so inspiring. The money would be nice, but I wanted to thank you for all that you do. ❤️", "byutaful12me": "Pretty in pink! What a blessing to pay it forward! 🙌🏾💃🏾💕💰", "tdubb412": "@gabifresh I need this $700 so I can buy all the @premme.us. Just all of it!! I don’t have nearly enough. 💃🏽", "esmebuxtonphotography": "💕💕 heyyy Gabi! I’m an aspiring photographer and $700 would help me to afford insurance for my camera equipment. I aim to bring joy, love and happiness to the world through my photography so any help with getting the business up and running would be such a blessing. Thick females looking out for each other is what I’m alllllll about! Love you and what you stand for 💕💕", "bukhemomo": "I'm from Kenya, I just love how your IG page sends positive body image vibes.. I love 😍 😍 love love love your page, erthing down to the swim suites.. You confident in your skin and I want that too.. So lots of love. Cheers", "candycane121636": "Congrats on 700k! Thank you for being a long time inspiration for me and giving us a voice! 💕", "anastasia_kurakina_art": "love the colour!Charming happy smile", "my_year_of_cancer": "You look 👌😍 love how fearless you are and that you have shown the way for so many women 💜💜", "mrbulld0g": "Since you're giving @99centsonly such good exposure, they should give you a discount code or something for your followers. Or a special emailed coupon?🤣🤣🤣", "brianna_hurley": "Girl you may be in front of the 99 cent store, but you a dime 💕. Thanks for always being the example of being and feeling worthy/", "plantsare4ever": "@elizabethmutan this is the giveaway I NEED 🙏", "etta_beauty": "Can I be one of your swimsuit models....or plus size model period? I love youre looks! 😍", "thisismeagankerr": "Um, I love that you match the 99 cent store but also look like a million freaking dollars! Thank you so much for all you do Gabi, I’ve been following you for what feels like forever and it’s so cool to see a plus size babe absolutely killing it. You’re an absolute icon and I’m so thankful to have people like you paving the way (even though I’m pretty sure I’m older than you by a few years *cough cough*). Congrats on 700K @gabifresh, and thank you 💕💙", "fancy_foufoune": "Just quit my job cuz they refused to give me sick leave for surgery 😓 $700 would be such a blessing at this moment, plus I need to get my haircut right quick. Gonna ask for ‘da Gabifresh special 😬", "jalanaphillips": "I am indeed a poor soul & i love and admire u lol", "susieb1978": "Following you on insta for years now—thank you for helping me realize I can be big AND fashionable. Taking fashion risks at a larger size is hard—but you made it accessible and easy. Congrats on all your success, you deserve it! 🙏🏻🙌🎉", "style.empress": "I’m reading all these comments and it’s amazing to see how much you are loved & appreciated 💕💕and also how many people really need and deserve the $700.. May the best men or women win! God bless you for this grand gesture 💓💕", "hilly_fresh": "I'm Hilly Fresh,You're Gabi Fresh! We are clearly related,!! SOOOOO... Can I have some moneys?!?!! Orrrrr naaah??? @gabifresh", "sophie_hines": "I am SO here for that outfit x 1000", "dillishjacksons": "Where is my comedian identity when I need it.. Thinking of what to make people laugh 🤔 hmmmm.. Oh well. I guess I can only make people laugh in awkward situations like when I mistakenly go into a public toilet and find someone inside and I'd have to come up with something like \"wow it smells like fruits here \". I'm hopeless 😂 I'm winning but congrats to the winners", "ambi_baby": "I see what ya did there! 99cent store is Home of the most accurate pregnancy test, according to some sheee sheee poopoo magazine, now you’ve set the stage for a grandiose gender reveal for the next shopper 😂💫🤸🏾‍♀️💫.", "womfo": "need money for swimsuits 👙👙 so everyone can be blessed by my big ass out and shining in the sun this summer", "megskehan": "Why is every dollar store near me a nasty green/yellow combo & you get the privilege of a sensual magenta/purple???? The nerve!!!!", "as_told_by_freebird": "You may match the 99 cent store but you are worth so much more than that store lol such an amazing accomplishment! Thanks for being an inspiration to all us curvy girls", "savvysprout": "You are such an inspiration for curvy girls 😭😭 thanks for being a bad ass boss babe", "ola.sashenka": "Instagram used to be just pretty pictures. Pretty, but unrelatable. And somehow, because of positive people, it became this place of daily affirmation, appreciation and education. I love that. Thank you gals from my feed!", "phunmie3107": "$700!!! That would buy me an entirely new wardrobe (", "rachelgunn97": "Take a smile, leave a smile 😊 👇 start a thread in replies 😊😊😊", "miggiewithdafro": "Serving all the face. 💋 I started working on my baby plants today. I gave them some extra love and cut off the dead parts of the plants. I also played some feel good music to them (Badu, Minnie Ripperton, Beyonce) and even purchased a humidifier for them inspired by the one and only @ihartericka 🤘🏾", "jamieharnacke": "I flew out to California just to be a part of your open casting call for Swimsuits for All. I live in Illinois. It was one of the craziest things I’ve ever done. I just went by myself. I almost missed my flight because I forgot my ID, but they opened up the plane door for me by some strike of luck. It was a scary trip at times being all alone across the country, but it was worth it. Seeing a community of women who’s bodies were real and unapologetic was a start to a journey of loving my body like I never have before! Truly.", "fanzaaah": "I wish I knew someone like you when I was small (plus size, of colour and rocking natural hair). I always felt like I was wrong and needed to be like everybody else. It's never to late to learn. Thank you for existing!", "poodrey": "I can't even be bothered to wear a bra to the 99...", "ima_hufflepuff": "Mazel on the follower count! NGL, I saw the photo and thought it was a sponsored post for something 😅 Love the colors and look fine as 🔥 💞", "fairenkia": "Check out my campaign #lovethybelly all about self love, self acceptance, and self desiring", "jessicahinklestyle": "$700 would really help me feel old, fat, and fabulous.", "tildaisonline": "Growing up as a big girl wasnt easy but it is when i found you that i knew that it could be possible to look stylish but oh so different . i just love everything about you and you are a true inspiration to me a big girl from South Africa. Keep the saaassss and bring us more outfit idear", "foodbythenikkigomez": "Fabulous as always!🙌", "melanatedmamaof5": "@ihartericka brought me here. Looked around saw a whole bunch of light and love. If you're reading this just feel compelled to say I love you. Yes you. And you're freaking beautiful inside and out. Xo! ❤️", "alivewwildflowers": "Congratulations Gabi 💖 700,000 is an incredible achievement. So great reading through these comments to see how great of a community you have behind you. Love that you’re using your platform to spread love, like you said the world needs more of it!", "cheekylisa86": "@gabifresh you’re beautiful. You’re looking like you just got off the runway, when I’m over here at the 99cent store looking like I just rolled out of bed. You’re an inspiration to us curvy ladies. The world needs more women like you, kindness goes a long way. 💕🌻🌟", "kathrynlstamm": "pink! curls!", "hello_mimi": "So if I win I can buy 700 things at the GabiFresh Dollar Store? 🤞🏻", "lollipopsnfists": "I’m not sure I need it...I saved hundreds of dollars on my car insurance by fleeing the scene of the accident....", "bee.ren.duuh": "@sway_to_the_99 #Fashion", "cherryg0d": "seeing all these happy comments makes me smilleeeeee!! you’re such a light in others lives, promoting the love and positivity that you do. you make me feel hopeful for the world in the midst of all the shit goin on. keep shining, keep thriving, and promoting the love you do on this downer of an app lol. congrats❤️❤️🌈🌈🌈", "bridgetlynette": "Thank you for all you have done to make the fashion industry expand it's view of what is beautiful. You are incredible and we appreciate all the hard work you do (and that you look damn good while you do it!)", "jessmarbel": "I would use the $700 to start a 501c3 called Tough Titties, dedicated to collecting thin tears in jars and and then using them to make cocktails for women who misunderstand feminism really loudly. (I would buy crop tops and eat potato tacos at Trois Familia and pay one student loan.)", "lifeisjustaknockknockjoke": "I’m officially not entering but want you to smile anyway. Thanks for doing what you do.", "fancybyaccident": "Are those fuchsia and aqua shopping carts? Wowie!! 💗💗💗", "pammybcakes": "Thanks for creating @premme.us and giving so many of us a body positive and safe place. I never saw a non skinny rock a crop too and be so happy and confident until I found you. Thanks for this platform and for being my goals 💞", "theautari": "I daydream a lot and its easy for me to get carried away in a mental fantasy about what I want my life to be, where I want to go, things I want to do, who I want to love.. I began to meditate more and give thanks to the universe. I also realized that everything I want is mine, and life will unfold as I grow. I have to prepare myself for the things I say I want, and then work to nurture it in my possession, even if its temporary. Every experience in life has a divine purpose and is aligned with the lessons necessary for our growth and healing. Even in darkness I found love within, because the light cannot exist without it. 🌿", "holliewood801": "More like 99cent store accidentally found itself matching one of the hottest ladies on insta - love those colors!! 🦋🌸💎🔮🧬📘🎀💙💗🔷🛍", "lindsayhollister": "I would pay for the 7 cars behind me at Del Taco but only if they all look skinny", "katecarrington28": "The light literally shines out of your face 💖", "deanda_cris": "I could buy out my local 99cent store with $700 😂", "99bepoppin": "Congrats! Love your outfit! The 99 is always poppin' 💜💜💜💜💜", "gh0ulbabie_2": "girlll I need some new clothes, some new hygiene products you know we struggling buttttttttttttt I gotta tell you, looking at this picture of who must clearly be Rihanna has absolutely made my day and that's on PERIOD. The struggle is real, but at least there are people like you who are kind and generous that make the world seem more tolerable. And give hope.", "jrockinurworld": "Thank you for teaching me to love my body the way it is ❤️", "savdemi": "Ummm please I need to make rent loL", "aesco_pse": "You’re a catch, act like it ❤️", "soft__switch": "Damn, I'm so glad to see you glow up the past few years! ✨✨✨ I started following you in college in an attempt to find some type of bathing suit to contain my I-cups 🍈🍈 thanks for being a bad ass babe and making clothes that let my curves speak for themselves! 💘", "jillybeanez": "If they create the new store uniforms like this, I think they'll get gazillions of new customers❣ Looks really pretty 😃", "putsomerespeckonmyhair": "You have a big heart! This awesome! ❤️", "purplepurpleblue": "What does a ghost wear when it's raining?", "haiku_b_doobie": "I wish I had your confidence. Gorg!!", "itsalexijo": "First of all, the 99 cent store is my favorite store because you can go in and get 5 things and actually feel special like you treated yourself!! Second, if I had $700 I could finally get a car to lug me and my 2 kiddos around. I have been taking the bus for a year. Finally finishing my pregnancy and I have taken the bus 3 times a week to go to doctors appointments + all the other busing with my 7 year old. I’m finally going back to school in August and I’m so ready to take the bus with 2 kids everyday, but I car would truly be a BLESSING!!! I’m happy my sister sent this photo to me. And even if I don’t get $700 I just wanna say thank you for reading my comment, and thank you for spreading smiles across the world 💛💛💛💛💛💛💛 much love xoxoxoxo", "rosiexwaugh": "congratulations gabi, you deserve the absolute world. thank you for being a constant source of inspiration and for changing so many people’s lives for the better 💓", "camillekspeaks": "Curls poppin', 'The Girls' on display show stoppin' ... issa #WCEVibe You look goodt girl! Now somebody help me finish p", "mskita42": "Just started following you, accidently came upon ur page and was inspired. Keep being you babe, by the way that jackets fab 🔥🔥🔥", "slynbutter": "Hehe ... Lemmings ...", "justalyroc": "I just love you your so outgoing, a go getter, and just beautiful 😍😍😍!! Your definitely a goal getter and role model for plus size women like me.❤️", "rivi57": "Congratulations 🎉🎊🎉🎊🎉🎊🎉 very cool that you give when you don't really need to, everyone will agree you are a pioneer in this crazy business of \"all women\" are beautiful & deserve to look & feel beautiful. Thanks✨✨✨", "_sugarsugar": "Your fabulous everywhere you go, slaying at the 99.. And saving money. You can make a good dinner from there and decorate your entire house ect. I love it. 💕💕💕", "d_nakhole": "LOVE YOU!!!!! #bekindalways #fyourbeautystandards ❤️", "frau_lhmn": "Du siehst mega hübsch aus!! 💜", "shanell411": "Gabi Fresh Dollar 💵 store line! 🤔 Dream Big ✨ And Congratulations 🎊🍾 May you continue to have continued success and prosperity!", "deviousdanid": "Been riding since day one! So proud of you and all of your success. Much deserved😘💗💗", "kelseystancliffe": "Plz give me $700 so I can give my big ass dog Daisy a better life AKA a new bed and more treats. She and I are both curvy hot ladies and we love you.", "riiahlove": "Send $700 my way! Ive been good! Karma come thru! 💜", "ferrero.roshae": "My parents always told me I’d never find love, I’d never be beautiful, or successful unless I lost the weight. Now, thanks to plus size role models like you I look in the mirror and love myself. I’m saving up for an apartment to get my little sister and I out of my parents toxic house. 700$ would really help me get to my goal. But either way, I just wanted to say thank you for everything 😩❤️", "rcbest": "You know how people talk about going into Target to buy cotton balls and leaving with $100 worth of shit? That's legit me at the 99cent store. Do I need a wine glass with a suction cup base? No. But it's only $1 so why the hell not?! Oh and the one near me sells wine so...yeah, I'm definitely livin my best life😎", "mspatticakes": "Amazing to see your growth! I met you at a Maurice’s event on one of the shittiest days in 2016. I looked a hot mess from crying all day but you had nothing but the kindest words to say, and it made my whole day better. 🥰 Always meant to say thank you for sharing some of your light - wishing you nothing but the best!", "stacey_snake": "💜💜", "britsonderman": "Gurllllll you’re out here slayyying! I’m just so inspired by your gram everyday! Thanks making this chubby mom of 4 feel good in her skin for the first time in a longggg time! Rocking my two piece swimsuit and fashion pieces like I never have before and feeling sexier than ever! #chubbythighsforlife", "thecurvyclassic": "Congratulations! I’ve been following you since the beginning and it’s been great seeing you become a powerhouse! You were one of the inspirations that made start my blog. I was super excited to meet you at Curvycon! You were so nice & took a picture with me (we had the same hairstyle & hair color 😂) You’re only going to continue to grow and do greater things! ❤️", "elle_simone_scott": "Coming up short on anything funny to say but that 7 STACKS could give me ONE solid good nights sleep. oh and you look purty @gabifresh! P.S. this is a fly 99cent sto. 💕", "authorscorpiolove": "🔥🔥🙌🙌", "iriseleonora": "💞😍 Wauw", "littlemissbee6": "Pick me! I bought a swimsuit from your first swimsuit for all line and to this day I still love it and feel beautiful in it! Also, that money would help me pay for my books for the next semester of my PhD program, or a quick trip to Cabo to celebrate finishing my first year! 🎉🙋🏾✅ Congrats!", "boyimhighmove": "Looking like scoop of raspberry sorbet on a hot ass day 💖💖💖😍😍😍. Keep shining!", "bigbeautifulblushboss": "Congratulations on that SEMMMHUNNNID!!! I pray you continue to be blessed!!! I’d like that SEMMMM tho!!! I’ll settle for $70... 😂😩😂🤞🏾🙌🏾😂😂😂😂😂😂", "lyttle_lindsay2016": "Beautiful!! Love thrifting - it’s my life! 💋 My fave find was a pair of Batman converse sneakers - couldn’t believe it but they were brand new and had the tags on still. I also find some great vintage dresses too! My wedding was vintage themed even. My bridal party wore sneakers 😆.", "zahabx": "you're lush", "mimilively123": "You look amazing as always! Thanks for holding it down!!", "twillaamin": "😍So happy for you! I've been following you for a while and I can say you are my for real style inspo! You continue to inspire so many by boldy being yourself, unapologetically. Thank you for all you do. One day, I will be able to afford a consult with you. Until then, keep slaying sis!", "dorabethsandiego": "I’ve been following you since you were posting selfies in your living room. Now 700k! I remember when I read that you went to Mount Holyoke and I thought, “I guess I can be smart and into fashion too.” I know you’ve been at this for a long time and put in a lot of hard work. I’m happy when people like you are successful because it makes me believe there are still good things happening in the world. Thanks for all you do to make the fashion world more inclusive in so many ways.", "skoogurlq": "Looking BOMB per usual, duh you have 700k LOOK AT YA!!🤤🔥❤️", "stylings_of_lauren": "“I’M RESPONSIBLE FOR MY OWN HAPPINESS? I CAN’T EVEN BE RESPONSIBLE FOR MY OWN BREAKFAST!”", "stephkaplewis\nVerified": "Verified", "_kimcat": "Making that 99 cent store look like a million bucks! 😍😍😍", "rbkh_twd": "I expect to see El Pollo Loco and In-N-Out color schemes next! Congrats on the 700k 👏 #watchoutforthebiggirls", "hello_tallulah": "I was scared to leave NYC and start my own business but here I am surviving. My blogger background has definitely helped. It’s officially been a year and a half of me opening my own vintage store. It’s a struggle but it feels amazing to be my own boss. It’s been a year of ups and down, I lost my rescue pup Tallulah who was everything to me (still paying off her medical bills) but I’m slowly growing my business! Summer is suuuuuper slow so I’m a little scared of the coming months so yeah monies would help lol also it would help add to my savings for my bf and I to get married in Vegas someday. 😘", "shay_6one7": "That jacket tho! So hard! 😩🔥🔥🔥🙌🏾", "smaybels": "Honestly just getting inspired reading everyone's comments 💜 glad you've created a space and a brand of empowerment", "evolving_elise": "you’re gorgeous and your vibe is so genuine; love ya gabi 💕", "vivalabbo": "Some people are born to change the world...thank you @gabifresh for giving the curvy girls a seat at the table. Because of you so many lives have been changed from those who couldn’t find cute clothes that fit, to those like me that never would have tried to wear a bikini. You affirmed our beauty when the world didn’t. Thank you for paving the way. ✨✨✨💕 Also watch the 99 cent store start trending because of this post LOL 😂", "iamreshauna": "Gabi is the real MVP!", "wiggity_wiggity_whit": "Oh dear laaaaaawd!!! Sweet baby Jesus please don’t let me be too late for this good blessing!!!", "ebenezershesateaser": "Congrats on 700k. It would really be a blessing if I was chosen as a winner. I remember watching when you won that MTV social media contest and now to see all you have accomplished especially your amazing swimsuits!", "justright85": "Yes sis!! 😍", "hautepinkpretty\nVerified": "Verified", "humansoffashionf\nVerified": "Verified", "mamachicajj": "Thats so awesome! You deserve it. I've been a follower for a while. Love your style and your inner/outer beauty! Here's to the next 700k! 🥂", "harley_butler": "Damn I don't have anything interesting to say I'm just a broke ass bitch who needs $700 to be a hot broke ass bitch wearing #gabifreshxplayfulpromises 🤷‍♀️🤷‍♀️", "isthatracquel": "I'm celebrating being alive everyday I can!", "kennadisings": "Shout out to all of us fat, black female QUEENS!!! Period. 😛🥰✊🏾", "tweevalleyhigh": "DANG, you’re a body pos inspiration and literally make me proud to rock bikinis and fancy underwear. Also I’ll never forget your Fresh Prince Halloween costume. It’s #goals", "thecheyennerussell": "This could help me get my collateral to be on my Gabi entrepreneurship ishhhhhh 🙏🏼", "icherryefresh": "congrats Gabi!!! 💛 happy 10 year anniversary to us!! 🥂🍾 a friend introduced me to you in 2009 when she sent me a photo of you in a fatkini! I saved that photo and would look at it every once in a while and wonder if I could ever find myself wearing anything like that😊 I’ve followed you ever since - thank you for inspiring us to follow our dreams in anything we want to we wear as plus sized women!! My other friend and I would spend hours at work going through your latest photos and just being in awe of you! Thanks to you I was opened up to whole world of body positive advocates and I’ve since pursued my own plus size style blog, bought a fatkini or 2 😅😉, I’ve lived my 20s in crop tops and I’ve started my own accessories brand because I’ve realised through you that people will support you if you’re authentic! Thank you! It’s been amazing watching you grow over the years - here’s to more fresh moments with you! 💛🥂", "theoreticalfuckyou": "P.S.A: THREE MONTHS AND TWO DAYS UNTIL NATIONAL DOG DAY!!😙🐶💖", "mom_washed_her_hair_": "Lipstick pink. The only pink fit for a queen 💋👑", "lily1ann": "Girrl You can drop that cash and that jack like it's hot, okuuurrr🤑🤑🤑😍😍", "msrubyann": "I found you on Pinterest and then saw your blog. Been following ever since! Your content has made my closet much happier and my wallet a little lighter but, it's worth it when people ask me how I got so confident. Best compliment I got so far, \"She's happy with herself\". That's in part to you and others like you. Thank you!!! ❤️❤️❤️", "tasteitphilly": "Earrings 😍😍😍😍", "gods_hands_around_me": "The Lord went through the depths of hell, failed grabbed my hand, and pulled me back into his loving grace. I'm now here, typing a message on page, which I adore, letting it be known that I'm liberated from the thoughts of fear and I love this gift of life, including everything that comes with it. 💚 ya sis✊🏼", "abigail_r_": "Yesssss! I love your clothes and swimsuits. I just stumbled upon your line and I was instantly IN LOVE. Body positivity is sooo under represented today in media and so it just makes me smile so much seeing this. Truly you’re a queen. I’ve always grown up thinking that I’m lesser bc I’m fat and now that I’m in college I am understanding that that is the farthest from the truth. You’ve touched this college girl more than you could ever comprehend and I am forever grateful for that. ❤️ keep shining, hoping for your endless success", "charanor": "$700!!! Now this is is the most useful prize I’ve ever seen anyone give away 💵. Prizes on IG are usually like “..Win my used lipgloss!”💄", "_ccboomer": "But also fat met gala, theme: supermarkets edition?", "napppturner": "Oh hey hi you cute and I’m broke 👋🏾", "cyclopticcupcake": "i remember the first time i saw you on a national morning show i literally thought: the revolution is coming. thanks for the work you do.", "uhliz": "You inspire me so much❤️ from one Detroit girl to another, thank you for continually being you and embracing every aspect of yourself. ✨", "ogmills_": "Gabi, my good sis, I WOULD usually say that I would do the responsible thing and put the $700 towards nothing but school, but then I had a vision of me in your pink bathing suit (the one @jazzmynejay wore in a BuzzFeed video as a shirt) so I’ve gotta alter this comment a lil bit. Me +700 = school + Gabi Fresh x Swimsuits For All pink bathing suit", "diamondgirlo3": "Pink it's the color of passion A-cause today it just goes with the fashion.. 😂 love your style 👍", "lea_reunion": "You are beautifuuuuul (avec un belle accent francais)", "preeyabehal": "You have a heart of gold and it radiates in your pictures. Thanks for always lifting others up, what a sweetheart you are 💖", "luv_redbone": "Just Beautiful...Queen!!!!!", "adashofnat": "How about some light hearted dad jokes. Did you hear about the restaurant on the moon? Great food, no atmosphere. 🙃", "clevergirledu": "What a generous gift! You are a whole blessing and that jacket is bangin!! ❤️❤️❤️", "esoteribull": "For once my smart mouth ass ain't got shit funny to say. Damn.", "azz_azman": "Well hello there little miss bubblegum - you're lookin' popping in pink! ❤️❤️❤️ Congratulations on the milestone and to many many more outstanding outfits and colourful content that inspire people like me to embrace that fashion is for EVERYONE - shape, income, colour, gender and whatever boxes we put ourselves in be damned!", "mirmaid_207": "Congratulations!!! You’re making Mary Lyon (and this Moho, who’s been following you since YFF) proud! - Miriam, MHC’10", "na_luu_": "😍Gorgeous", "abbsjl": "So might sound odd, but I find it so inspirational every time you have a sponsored post. I’ve seen you get more and more over the last few years, and watching someone I can relate to get that coin and get a lingerie line? Super inspiring. ❤️", "obeythecupcake": "I keep trying to find something funny, or inspiring, or thoughtful ways I’d spend the money on myself, but I know that every time I ever have extra money to spend on myself because I desperately need it... I spend it on my son so he can much flyer than me 😭😂 so, you’d probably be inventing in a 2 year old fashion mogul with that money, lol. Thank you for inspiring body positivity and being so you. It’s so real.", "tayladawnmarie": "What a beautiful way to pay it forward!", "drnicolina": "I got that Lilt Hair And ‘Don’t Care’ Stare Cuz My Birthday’s on Monday Oh Yeah! #BeingSilly #ThisIsHowWeDoIt #MightPutAnOldSkoolHipHopBeatOnThatToMatch #KeepDoingYourThingGabi🙌🏽 #LoveYouG-Fresh💕💚", "mizchambers": "I feel like the beauty in your soul jumps out of your pictures with every smile. You exude straight kindness and that’s why I would ask if you happen to choose me, I’d appreciate you donating that $700 to a charity of my choice 😊 💕", "sydnaayyy": "No witty comment but your posts have helped me come a long way with self love 💕 . I’m happy to be a part of the 700k🎉", "ashdanley": "That money would go straight to my tattoo that has been unfinished for 5+ years. Hell, I’ll put your damn name in it!", "msb1983": "Wow! I literally looked at this post earlier and was like yasss Gabi loving the hair & your jacket and not once reading the caption! Lmaoo 😂 I only realized it after looking at your IG story BUT, seriously I love your sense of style and how you’ve opened the doors for so many plus size women! Oh, & I stan a curvy Midwest girl (like myself) making a name for yourself and grinding as hard as you do yet being so real and engaging with your followers - it’s good to see this from a long time follower! Keep growing and creating in the world fashion for us plus size ladies!", "tonnietee417": "🤣🤣🤣you and the 99 cent store are still flyy though!!", "kerleishaj": "This is amazing! You were one of the first plus-size bloggers I followed and I'm so glad I did. I'm not as kind to my body as I should be (working on that (every. day.)) but the awesome body positivity and self love that I see from yourself and other bloggers gives me so much joy and inspiration. Sending you love and congratulations!", "kathy.thomas_": "I am 40 this year so remember the days when I was a teenager and my only plus size options were Lane Bryant and a department store. And they definitely didn’t cater to hip fashion 😂 And god the awful bathing suits. I was a lifeguard in the 90’s and early 2000’s and ended up wearing grandma style one pieces with skirts! I remember being so excited when the internet started opening up more options. I have been following you for a few years now. My husband lost his job this week so the $700 would be a blessing. Just know I am grateful for all the style blazing you have done!", "theresidentsadgirl": "I owe my mom student loan money this month 😂 and I also want to treat my dude and our dog to a nice day out on Monday!! he's been following his dream as a barber and busting his 🍑 and we need some down time 👀✈️💖", "wernerwoman1": "We fly high, no lie, you know this (ballin'!) 🎉🎉 ... this is so dope and you look great!", "shaleelee": "This is amazing 💕", "ericahearts": "I’d buy 700 pregnancy tests because this lewk got me knocked up", "thatgirlizme": "You’re a breath of fresh air 🙌🏼🙌🏼🙌🏼 so inspiring ❣️😇", "oh_brehave": "Can I just $700 worth of @playfulpromises ?? Cuz the way my underwire situation is set up ima have a free piercing soon😩", "imjadah": "Ok so, this money would be a BLESSING. My mom literally works her ass off to support our entire family. 5 kids, disabled dad. There are times when it's been a living hell. And I just want to give her a good summer. That's all I want. Just a good summer. So hey, if God allows this to fall into lap, that would be SUCH a blessing. 💕", "im.cleow": "Help me send my #3 daughter to college with the 700 or help me help #and #2 pay student loans or you could even help me put the 700 up as a college fund for daughter #4! I’m a single mom with 4 amazing girls . Any way you bless me, is alright with me!❤️", "heyheyhaleyjo": "ALSO THAT COLOR PALETTE THOOO 💕💕💕", "garichild": "Continue to be a blessing sis!😘", "r.g.major": "🌹🔥🔥🌹 👍👍", "queenmoluv": ".....when you wish you were as fabulous as Gabi....but the world just gonna have to take what you give it! *sigh* 🤦🏽‍♀️", "kristiner89": "You are the living embodiment of a Lizzo song. Plus your clothes even make people that way. I would say that is a legit feat.", "no_the_i_is_silent": "*tries to think of something funny/inspirational* 😔 anyways I love your account and I’m so proud of your success but this is only the beginning!! Seeing other big girls being beautiful on ig and other social media is so inspiring to me and I appreciate it so much ❤️💗", "sarcasticblond": "Just wanna thank you for showing the world that style knows no size limit! You’ve inspired me to stop buying all black and buy vibrant colors & prints. Thank you💖💕💜", "deschats_rouge": "Cerulean and fuscha is everything.", "natty__xo": "As a young girl, you were the first model I saw and that made me feel that my body is my own and it doesn’t matter what I wear, I can rock anything I love and I haven’t looked back since. Thank you for being the fabulous, beautiful self that you are. 💗 xx", "cantbeboxedin": "700? It’s lit!!!! 😂 I first found you in 2011. I was 22 (a bitch is basically 30 now). I was at probably the lowest point in my life. I had dropped out of college, moved home, and my self esteem was shot. And finding you showed me that I didn’t have to wait to lose weight to start my life. I could be great now, i could be fly now, I could LIVE NOW!! It was a process but your blog was a catalyst to me finding not only comfort but love of my body and my skin and my hair. Finding your blog made me realize that there are communities for me where I belong, even if it’s online. I hope anyone who reads this from the place where I was in 2011 finds solace in knowing there is light at the end of the tunnel and deserve your best life right now!!!", "toodalookatie": "Ahh yay! So exciting! You have changed so many people's lives and made so many people see just how beautiful they are- I'm so happy that you continue to shine and share your light with all of us ❤️", "adryanasandiford": "Yayyy! I hope you are having an awesome day @gabifresh. You inspire me everyday to feel confident. For everyone else I hope all of you beautiful people have the best week of your life starting now! ❤️💜❤️💜", "thelobazul": "I'll take $700 in dresses since I cannot even afford a third of the fabric they are swen in. Greetings for East Los!", "bluerich_00": "I wanna say thank you for loving yourself and inspiring other young women to do the same 💕", "annannannaa": "you may match the 99 cent store but your worth is infinite! so happy for you and 700k, you are GLOWING so bright that I don’t even know if 700$ could cover the cost of the eye care needed after being blinded by your infectious light. ...but the 700$ could help pay off student loans and medical bills from a year of physical therapy🥴 😯😭 anyways, cheers to you you sweet, inspirational, powerful woman. it’s been such a pleasure seeing you take the world by storm. the confidence you exude allows me and so many other people to feel comfortable in their skin, and comfortable showing it off! THANK YOU FOR BEING YOU GABI, cheers to this 700k and the next 700k, and the next 700k after that!!!!!!💙💖💙🦋💖💙🦋💖", "sai_durgesh_chethri": "Looking so beautiful👌👌", "alley__dreamer": "When you got that hot pink 80s vibe ayyy 💛💛💛", "saundralissette": "It’s so nice to see all the ladies I admire in the comment section. You ladies make me so happy. Great women empowerment. We need more of this. 💪🏾💙", "candyluxecc": "I forgot you could even have that many followers on Instagram! Congratulations!! 🤣❤️🎉", "killmesofter": "Don’t sweat the petty and DONT PET THE SWEATY", "bad_arden": "🔥700,000 🔥that’s amazing but where is that pink jacket from!!!??? 💕💕💕💕", "katherinethebrave": "I didn’t know that things were suppose to actually cost 99 cent or less until I went into a dollar tree. 😂", "therealkelseyrose": "When the zombie apocalypse happens I won’t be at Costco. I’ll be at the 99cent store because I wanna die stuffing my face with off brand snacks, surrounded by cheap perfume candles and wearing butterflies clips from the hair section. 👯‍♀️👯‍♀️👯‍♀️👯‍♀️👯‍♀️", "curvyfashionvista89": "I’ve been following you honestly since 2014 , your growth is amazing . You have really made women like myself gain confidence as well wisdom . I’ve always found its favor in those who learn to love themselves. Thank you for being one of the ones who paid the way . Congratulations and I wish you much more success . 😘", "ericummm": "the generosity jumped out! wow babe, you spread so much love light, not new to this you’re true to this and i think i speak for everyone when i say you’re an inspiration to us all. congrats, the world deserves to know your name 💕(also $700 would literally flip my entire world right now ijs)", "theresawonders": "You were the first person I followed on the journey to fat acceptance and I still remember how it changed my life when I read your blog and realized that you can be fat and amazing and gorgeous and worthy of love. Thank you so much for that. 💜 it seriously saved my life. (And if you sent any money my way, I would use it toward a new mattress because my current worn out one is not doing my fat body any favors!)", "featherheather81": "You are fabulous! 🤩", "clairedarling_": "I may wear a two piece bathing suit this summer...for the first time in 20 years. Thank you.", "misstaylor423": "Thank you for this blessing. Good luck everyone! 🖤", "krischavis": "Congratulations!!! I’ve been following you for years, and love watching all the awesome things you’re doing!", "bae.smith__": "Not sure if this makes anyone feel good buuuutttttt I am a 2 time college drop out and last year I made the decision to get back in school. I had to pay out of pocket while working 2 minimum wage jobs AND I am so happy to say I finished my last payment for school today and I will be walking the stage this August 🙌🏽🙌🏽🙌🏽🙌🏽", "liazurloewen": "ur the reason why I started feeling comfortable in my plus size body, why I allowed myself to feel beautiful and loved not in spite of my body but bc it is who I am and I am worthy, Ive directed your insta to so many ppl because you’re inspiring, simply put you have changed my life thank u girl I cannot thank u enough 💕", "sigearsc": "Girl the curls tho....ima need your product line up asap", "ezemcdaniel": "I could use that $700 to grab some of your gorgeous swim suits for the summer AND to replace all my jeans my thighs rubbed holes in this year 😂😂 #thickthighhssavelives #butkilljeans", "thesmilingsweetheart": "You’re kickass, Gabi!! Wishing you so much more success!♥️", "tenderheauxni": "I learned how to suck dick in my living room on Easter Sunday. Thank God for friend couples that are with the shits and champion “hands-on” education 😉. My CashApp is $kitchentblbae.", "alicialatonya": "You are truly a blessing!!! 🙌🏾", "buhhreezayyy": "Queen, you deserve more than dollar store items. Stop wearing pink, it stops your period! * in my hotep voice*", "rhechristine": "Being an inspiration and rocking that pink jacket! We plus babes can rock anything we want and you have made that abundantly cleAr!! (Fav is your swimsuits!!) thanks for always being so kind to your followers and continuing to advocate for all of us plus babes", "ashycoe": "even tho I originally followed you to see your clothes, you can tell you're truly happy in your photos and your smile makes me smile too. 😊", "just1jenniferlynn": "Amazing! Thanks for shining your light ❤️", "goddess_shante": "Ok, Pretty in Pink, I see You!💞", "mandypandy_5": "Your👙 line gives me lifeeee... but the way my bank account is set up😭😭. I still follow you though, because you make being plus size and fabulous seem effortless and normal... a girl could always do with a reminder of how not to give a **** about what society thinks you should wear.😊😎", "haysorensen": "I just finished the mcat last week and am beginning my dream of applying to med school!!!", "megsinmaine": "I think you were the first plus size blogger I ever followed. Before that I felt isolated as one of the only fat girls in my town who cared about fashion. Seeing you in crop tops and bikinis really changed the way I felt about my body. Thank you for your influence. I’m so much happier now loving my body than I ever was hating it!! ❤️❤️❤️❤️", "miadetejas": "Gabi your spirit is lovely and your curls are always AMAZING! I am a teacher and $700 could pay for some self care and amazing outfits for this summer. ♥️♥️♥️", "rudytravels": "This tired worn out middle school teacher is ready to ditch the cleavage covering cardigans for all things GabifreakingFresh. Swimsuits for alllll, y’all! 🙌🏼 And weeeeelllllllll a little extra 💸 would mean I could ditch teaching summer school too! 😂 #checkonyourteacherfriends #weredead #drabanddead", "bronzehunny": "Remember, doubt and fear cannot reside where faith lives and thrives! Love your style and energy ! Congrats on 700k", "fashionablymoore": "Yas! My style inspired. Love seeing all of the things that you do.", "iamtheoneicequeen": "How to enter?", "rettazclozet": "Continue to let the good Lord use you 😁", "brii_sp": "❤❤🔥🔥😍😍🔥❤❤🔥🔥🔥🔥", "miss_bri__": "FREE MONEY!!! 🙌", "infinite_blue_": "$700, yes please!! So I can finally have a portion of ya style!! 💖💖💖💖", "welington_madeira123456789": "Linda", "sheilabocchine": "700k! You deserve all of them! I've been following your inspiring journey for about 8 years. Thank you for all the sunshine and beauty you give us. I'll be here when you have 1M fans. Thank you for the $700💜 😘", "blaqgrwl": "thanks for making my fat tummy and brown skin just as couture as any other model. it’s comforting and inspirational to have someone like you to look up to. i hope the fashion world embraces more people like you for years to come, and with your passion for inclusivity and comfortability, my excitement for every plump black femme out there won’t be contained. 💌 management", "sensitivebore": "🌈🌈What a blessing🌈🌈 keep walking the walk and talking the talk❣️ spreading JOY💕 #gabi2020", "vivalacurvy": "Congratulations!! I just got laid off from my full time job and it's been tough $$ wise. Wouldn't mind a nice giveaway like this. But regardless, you're an inspiration to me and one of the first bloggers I followed 7 years ago when I first started looking into this \"plus size\" fashion world. I have that two piece bathing in all the colors (the wrap one) and can't wait to see what else you come out with. Also, premme is amazing and I was so excited to wear it at the teen vogue party. Keep on going girl. 😘", "the_great_tyrant": "I was going to write about how shitty my situation is but then I thought nahhh that’s not what Gabi is about, I found you through happenstance and you’ve been lifting me up ever since. I will say your generosity is amazing and so inspiring and I hope you pick someone that makes you smile and warms your heart 💜", "dria_annedromeda": "Dolphins are the only other mamal besides humans to have sex for pleasure and not soley for mating purposes @gabifresh", "chantaleliseart": "You’re among my favorite accounts on here and I love your style so much!!!! ✨ ✨ ✨ ✨ Congratulations! ✨ ✨ ✨ ✨ Here’s my favorite silly joke: did you hear about the guy who got the left side of his body chopped off? He’s all right now. *ba dum tsss* 🥁 please help me, I am so broke, I literally have like $30 to my name. 💰 💀 Lol. Thank you and Goddess bless. 🙌", "courageousjaz": "7 hundred dolllllllaaaaaaaaarssssssssss????? *soulja boy* haha!", "lkay88": "@gabifresh I need #gabifresh x Torrid collection", "screwperfections": "@gabifresh that is so cool off you to do this. There are so many people in this world that needs alittle help. Ofcourse I hope I'm one of the 7 people. I've been going through a rough time physical and because of that my finances have been depleted. But I continue to strive and push myself to work a full time job because in The end all you can do is try your best. I love following you because you're such a positive inspiration and always spreading love I wish you all the best and continue success ❤ Lolo 🤗", "aliceraign": "What you gonna do when you hit 1 mill?! 😂 Congratulations lovely lady 😘", "jactastic": "Just your average fat girl tryna win some money so she can by some cute clothes. My fat girl crew and I are heading to Palm Springs next week for a girls weekend and $700 could buy us all new swim suits from your line 😭 pick meeeeeee", "dj_lush": "Always remember to be patient with yourself and others, you never know the whole story until you view it in hindsight", "gwynduns": "This is just to say, I spent an hour this week trying to find all the items to replicate your outfit. Thanks for the inspo.", "msbrandbae": "@gabifresh you were one of the first fashion bloggers (forget the plus size label) I followed. You and Fashion Bananas were my faves in the early IG years. I remember Googling Fashion bloggers, plus size fashion bloggers, etc... You spoke to me. Your presence made me feel more confident. So, thank you for sharing your life with us. 🙏🏾", "lovelesky_": "Legend.... PERIOD! 💞😍", "ndamu_farisani": "Spread love no matter the distance! I'm your biggest fan in South Africa ❤️🇿🇦", "laraeariana": "So proud of you! Thanks for inspiring us and showing us what a strong, fierce woman is. So inspiring keep it up ma 💕", "missburnsred88": "This soo amazing! Thank you for the opportunity and being such an amazing inspiration!", "aes101": "WUNDERSCHÖN ❤️", "edee80": "Thank You. I am Grateful.", "ohchazzycake": "Congrats! I started following you when BET featured you on rip the runway!", "sarahjanereign": "Okay so this fit is giving me nostalgic roller rink vibes and I'm not sure why - but I'm 100% here for it! 🙌🔥💕 Cheers to 700k and beyond! You were one of the first plus size babes I ever found on Insta and my life has been so much kinder since! 🤗", "emr_wagner": "I went in the ocean today and my grandma used my correct pronouns!", "trmb91": "PLEASE HONEY!!!", "ally_farrar": "⬅️⬅️ winner winner chicken dinner 😍🤞❤️ this would be SO helpful for our palm springs trip @madmadamnims, which is basically inspired from the bday/girl gang trip you had with @nicolettemason", "ellocampbell": "When you show up late to the giveaway, like is there anything left lol!👀", "rhonda_ashlee": "Heart full💕 From one Michigan girl to another, I am so proud of your journey!", "maloney_09": "You and your beautiful curls bring me joy! 👑 ❤️", "birdylyn": "💞💞💞💞💞👑👑👑👑", "aurora.alida": "Shooting my shot & hoping this is my lucky break 😩🙏🏿", "vleigh_lo": "Seeing you confidently rock swimwear has made me get right with my postpartum body & flaunt my stretch marks. I'm also obsessed with the fact many that ads and store posters stopped photoshopping real bodies!! Congratulations on 700!!", "alfred._.bitchcock": "Single mom trying to make some PLAYFUL ass promises!! 💕💕💕", "_shrimpinainteasy": "Help me, I'm poor", "marsh_7726": "I need money to buy all the outfits you’re wearing!!! 🙏😱😱", "nodaaysoff": "Gabi, I just wanna put it towards my rent 😩 🤷‍♀️😂 help ya girl out!", "mpls2mia": "Ayeeeee the 99 cent store is poppin over north!", "bebeautifulla": "“As you vibrate higher you attract more genuine people who vibrate higher too.” ~ #LalahDelia  We See You @gabifresh 💛✨", "adrian_carrolle": "From Young Fat & Fabulous to now you have been an inspiration to plus size girls everywhere. As a full bust chubby girl I gained so much confidence just by seeing you rock bikinis, crop tops, and bodycon dresses. I stopped accepting ugly frumpy clothes at retailers and started searching outside of my comfort zone for color, and print, and true glamour. Mainly I want to thank you for taking the stigma off the word \"fat\". I embrace it now, because eff it, I'm fat, but I'm cute as hell and so are you! Congrats on all of your success!!!", "charelliam": "Since you’re at the 99cent store give us the deets on how we can get the look for less 💛😂", "itsher_marlitahh": "$700? Let me holla at you for a sec baby gurl 😂😂 In all seriousness, that is amazing of you @gabifresh you will definitely put a big smile on these winners faces ❤️", "divagirlrn": "Please just keep being you Gabi!! You have inspired me beyond words! Thank you for being you and helping women realize we’re all beautiful!", "sharizzlevandizzle": "I NEED THIS JACKET 😍 (I dont want the money btw, I'm sure there are others who could use it more than me, I just wanted to say you look INCREDIBLE!)", "tenenj": "Congratulations on adding to the Black Girl Magic of 2019!!! First all the women and women of color added to Congress, 3 Black beauty queens, and Gabi just to name a few 🙌🏾🙌🏾🙌🏾 Keep it up and here’s to 700k more ❤️", "kimmy_k_95": "❤️❤️", "hm.coro": "The biggest joke: being rejected from 100+ summer jobs from all industries! LOL! The money would help me pay for next semester and make me feel like less of a failure", "p.nicole_n": "This is so sweet and amazing! I’m not gonna give a comment bc Im on a high for from life and I know there is someone out there who needs it more! You’re dope! And like been dope! From like back back back in the day! ❤️🙌🏽", "ashy_lisa": "Hiii 💙", "carlyforchange": "Congrats babe!!! ✨❤️ My daily inspo to stay true to myself and love every single smoooshy giggly part of my body 🥰🥰", "iman.mrnhl": "Ohemgee that would make my month! Your style helps me see what works on my body.", "tamnificent": "This is so dope! I’ve been following you since your blogging days, met you once (many moons ago) at an event you hosted in NYC, and it’s been incredible to see your growth from then till now. You have helped me be comfortable in wearing whatever the heck I want, even now your fashunz are *chef kiss*. Your collab with playful promises helped me feel genuinely sexy in lingerie at my big age. Keep up the good work!", "_belinda_griffin_": "You were the first ever curvy girl I followed on social media. You were the first to make me feel like I was ‘allowed’ to enjoy fashion at any size, and proof that looking fabulous doesn’t come with a size limit. I, like many others, still struggle with self love, but I’m closer than before thanks to you and other wonderful women like you. One day I will be confident enough to buy a Gabi Fresh bikini (although hello terrible Australian dollar and international shipping 😂) and I will rock it on a beach, grateful that you contributed to that confidence in more ways than one.", "breebree_55": "As a college student I support the 99 cent store & this matching😂", "brenna_coleman": "I just ordered my first @gabifresh swimsuit and I’m hoping I can turn into the plus size goddess you are! 😊", "el_stepho": "TBH, I’d essentially drop all that coin on all the GabiFresh wears out in the world - you know when the underwire breaks in half it’s time for a new bra!", "hail_king_sha": "You made me start scouring Zara for plus size dresses!!! I hope you know how monument and influential you are in the plus size fashion community, and just to women everywhere. Bless up Queen 👸🏽 Congrats on 700K💜", "mrssabrinaaw": "Congratulations on making 700k!! You were the FIRST fashion blogger I followed. You opened my eyes to so much and helped empty my bank account lol thank you! You’re an inspiration! Congratulations again!", "lala.g.15": "That’s pretty awesome", "christigallup": "You may match the 99 cent store but you look a million times better!!!", "concordcanaries": "Ok, well let's tall about how I was just in the littest 99cent store in America! They had alkaline water, fresh veggies, and a fully stocked party section. All they needed was alcohol lpl", "charmainermorgan": "Girl the 99 cent store could never!! You look great!", "megan_plus_sd": "Love love love the 99¢ store! Need a charger? 99¢. Need a new lamp? 99¢. Need a week’s worth of groceries? 99¢. Need a bag of gummies? 99¢.", "lovealwaysneenee": "I live for your haircut!!!", "saj_mille": "Your jacket inspired a memory of my Mom. Back years ago during the recession, I had to move back home & my children were not living with me...my daughter's Birthday was coming and my funds were tight after bills. When she came to visit, my Mom (not a regular B-day gifter) suprised my daughter with a vivid Fushia jacket similar to yours. Although she loved that jacket, my daughter later reminded me that she really enjoyed that birthday just sitting there while talking, and laughing with us. Mom who was a hair stylist, has passed on, but her gifts and the wisdom that she passed on to her grandchildren is memorable..💖💗💖", "daniellecaii": "Hi Ms Gabi ...Im your youngest fan and today I just finished kindergarten! Im headed to first grade and proud to be the tallest in my school. If you choose me my mom would approve.", "kristikida": "Made it through breast cancer surgery 2 days ago! Life is 🤩", "jessjjasso": "Girl, love you so much!", "freespirit87": "Ah this should have been a whoooole production. With the hair and the shine, I now have you doing a version of 700k magic in my mind. Do one when you hit a milli! Congrats!", "___94011": "I was just wondering who was gonna pay my automoBILLS this month!😉 You reaching 700k is awesome if for no other reason than in this moment you are showing thousands of people that your success does not infringe on anyone else’s. It actually provides greater opportunity to share. Sharing, of course, is not obligatory, but a testament to your character. Thank you for sharing your light with us over the years — across multiple platforms — while consistently reminding us to never dim our own. You know you #goals or whateva, sis! 😆 Continue to win.", "son.rizas_": "First: congrats on the following you lovely human!!!! Second: 700 dollars?! Oh my!!! Please pick me and I’ll love you forever. Honestly, even if you don’t pick me I’ll love you forever 😭😭", "shardesearches": "Congratulations!!! You deserve this and so much more. I and love this whole look. Giving we dope millennial Pink ladies from Grease realness. 700 would go a long way to helping me invest in some needed training for the blog I run on a PhD student budget and schedule.💛💛", "mikellechyree": "@gabifresh is wearing my signature color!! #pinkalldayeveryday 💕💋", "jozmama8672": "Hi gabifresh just giving a shout out to you .all the way from Suriname South America.", "olvkrane": "Everyone is being all inspirational and I’m over here like, Don’t waste a trip to the 99 cent store!!! Get in there and drop 40$ on redecorating your guest bathroom!!!", "jlaurel_j": "I was talking to my ten year old niece the other day about how hard it is to find clothes because I'm fat. She responded with \"you're not fat!\" And I said \"oh honey, I have to shop in the plus size section. I'm definitely fat. And I love it.\" She laughed pretty hard. Trying to spread that phat-positive mentality with the young ones thru humour", "mjsoulsqueeze": "You fancy huh? Light bill, car note, everything paid.... With $700!! 😭🙌 Talk about an opportunity to share and change people's lives. You've inspired me and my friends in many ways. #Iconic yet #humble ✨💕", "captainkazza": "The first time I tried an open mic night for stand up I went in bright red y front underwear and did my bit about Miss Mens, the period powered superhero. She fights the men of pause who work for Mother Nature. She shoots her tampon torpedo and then flies away because her jet pad has wings. Crime stops with her, period. I had to listen to so many dick jokes I figured I'd try to balance it out a bit.", "itsmedeedam": "I am inspired by you. I am a plus size and it has always been a struggle to feel good and be confident. But, seeing you and how you carry yourself is a reminder for me to love me and how I look. What ever size you are its not a hindrance. Never a block to feel good and be confident. I want to start building myself and try things I am always scared about this will definitely help me in doing so. Thank you for inspiring and for lifting me up!!! 💕", "ktwill2007": "We’ll slide that CashApp to $ktwill2007 I wanna see if my CashApp still works!!", "maddoxsmommie": "Pinkie and the Brain will conquer the world! #amandasealesvoice come thru Pinkie", "misshollywoodz": "Congratulations!!! 🍾🎉 That jacket is 🔥🔥🔥", "queennedraa": "Thank you for making us feel beautiful when we wear your bathing suits!", "alambzzz": "Pretty and poppin’ in pink! 💕", "rosariummm": "Omg I love you so much and you inspire me like crazy💕! I’m a broke ass bitch with a internet window shopping addiction, I literally fill my cart up with everything I want just to see how much it would be, maybe if I win I could actually buy something for once! 😂", "jessica_leveque": "Soooooo you giving money huh lol stay away from over spending at the .99 cent store 😂😂😂😂", "escandalosa24": "Thank you for helping me gain confidence in my body 👑 you are a queen and slay all the looks 💕", "queenstravelingdarling": "Thank you for being an inspiration. Periodt. The money isn’t even important, just know that every person following you is doing so because of your light and energy.", "trixiedarko": "u were the first fatshion blogger i ever started following when i was a teenager. not once have u compromised your fatness to fit in even when evolving into such higher visibility and that’s the tea. thank u", "hotpinkandglitter": "Matching 99 but looking 💯 👏🏼👏🏼👏🏼", "justdmp": "✋🏿💜", "burgundywolf": "I want it for the same reason as @reztothecity, but for me. I don’t have kids. 🤣", "msgigggles": "It’s incredible how simple this outfit is, and yet still captivating! So rush of you girl!!", "niaskindaneat": "I’ve been following you since like 2015ish (I’m pretty sure your hair was short blonde and straight) because I was learning how to love myself, and my body, for the first time and I really needed to see someone who looked like me on social media. Your success is exciting in and of its own, but it’s also a reminder to people who look like us that you don’t have to lose weight to be successful and to achieve your goals! Thank you for the years of inspiring content, collaborations, and all the beautiful pieces from @premme.us. Congratulations on hitting 700k, hopefully we’ll get to one million by the end of the year 🍾🍾🍾", "lauren_v3.8": "$700 can really help. I can finally go top shelf at the sushi bar.", "callme8ty4": "Matching the 99Cent store, but looking like a Million bucks! 🤑🔥", "juneericudorie": "When I was 17, my mom strangled me and kicked me out. I was homeless for a while and never thought I would make it to college, or even survive. A friend told me about you and every post made me feel proud of my body, my values, showed me the value of hard work and inspired me to keep going, to keep chasing my dreams. Because I saw you do it, and so I knew that if I focused on winning, I would eventually get there. Now I’m a rising junior at Duke on a full ride. I may not have my family but I have my integrity, my dreams, and a roadmap on how to love myself fiercely, most of which came from watching you. Thank you for showing me that I am more than my circumstances, and dreams do come true.", "foryou_ido": "I have always loved that color combination. Gorgeous", "_bellathevegan": "If I win $700 I’ll donate it all to @abide_women in Dallas to support black mammas & their babies!", "mlbee": "The thing about bright pink jackets is that you’re either 💯 wearing it or you’re friends with someone wearing it. Both are valid 🎉", "claudialogut": "🐝U🍵FUL", "ayan.khs": "😍😍", "ceruleanhoneymoon": "GIRL IM TRYNA PAY OFF MY STUDENT LOANS, $700 WOULD RLLY TICKLE MY PEACH", "tocarraelise": "Oh hey, Queen! love you and everything you do! You always seem to drop new product right after I’ve gotten paid🤔. I almost stopped following you to avoid over-drafting 😫but I’ve added “Gabi” to the budget and the Lord and the bank have been good to me. Moral of the story? ✨if you stay ready you don’t have to get ready.✨ 🤣", "znickerz": "Amazing 🔥😱🐉💃🏻", "midniterivers": "PS-- I'd gladly and proudly match the 99¢ store if I could have that outfit. 😂😍", "x_galaxygal_x": "I’m just saying, if my Barbie doll had looked like that when I was a kid my therapist would be much less busy now. #representationmatters", "_oh_heyy_im_jasmine": "Well that’s dope! Hell im sure anyone could use $700 cash so that being said I’ll just make sure I add you in my prayers tonight that my commen is one of 7 and if not FUCK IT your still dope sis!!🙌🏽💕", "alice_annabelle": "It’s been heartwarming seeing your journey. I’ve been a follower for years. Your confidence and style has always made me feel like I have the ability to be beautiful and strong without changing who I am.", "stiletta_sactown": "Aw, this is dope - the matching and the 700k followers.", "ludahchris": "Daycare is expensive! And combined with NYC rent, doesn't leave much to spend on myself. I could put the $700 to good use and treat masself", "thearialex": "🙌🏽🙌🏽This is dope Gabi, and not just the contest—the entire brand! Yo I didn’t have anyone that looked like me while I was growing up—even now the options are limited. To have people like you and Nadia and Kelly Augustine and Chasity—all working together 👭to build not only each other but the entire BoPo community—it empowers me to not only grow as a person 🥰but to share MY story (which is a fucking struggle) with other people to empower them💪🏽 What your sowing into the world is going to multiply ten fold 🌳and I just can’t thank you and everyone else out here being unapologetically themselves enough. Much love and light to you girl😘 please don’t stop what you’re doing 🙏🏽✨", "shelbybytheshore": "I am so thankful for your line because even though there is a more visible presence of plus size models on websites when ordering clothes (so friggin important so I can get an idea of what the clothes will look like on my size), there were never any that also had a large chest. I will never understand this. I only ever seen models with my body shape (G cup, hellllo) wearing your line. Every single plus size model online are pear shaped and although they are beautiful and I’m so happy plus size models exist now, it’s still not inclusive when only one body shape is being represented. So thank you, thank you, thank you!", "love_macrhe": "Love & Light to you beautiful 😻", "llamaface1414": "The Madison fishnet bra and undies was the first pieces of lingerie I bought EVER. Life changing. I'm an addict now😊 Thanks for showing the world chubby girls like pretty knickers too.", "brynnplumm": "Gabi!!! Everything you do, wear, speak makes me feel more free to be me. You’re also the realest in the mfin’ game, and haven’t wavered in your authenticity through the glow up, not even once. From me and the 699,999 others who love and admire you, THANK YOU!", "wes_moonz": "$700!!!!! I’m buying everyone shots of Tequila!!!!", "unapologeticallykat": "So it might not be hysterically funny but you inspired this fat ass to wear a bikini to the beach and changed my whole damn life. You're the OG fatkini and I'm glad that everyone else has finally realised it!", "fashionably_famished": "I HELLA knew right away that those carts were 99 cent store carts. What did you buy? Congratulations on the the followers!", "doonty69": "I could really use new clothes! Ever since I've become plus size I don't feel like I know how to dress anymore! I follow you for inspiration!! Thank you!!!", "therealrakinah": "👋🏽👍🏽", "abercrombiemommy": "Also have you heard @tripp new curvy girl anthem, Chubby Sexy? @sassyredlipstick #spreadingthelove", "_biiiaaalonghairdntcare": "That’s an amazing milestone! So congratulationssss!! 👑🎉🎊 and I just want to say thank you for always being an inspiration and always giving me confidence so for that I’ll forever be grateful 💖💖 😘", "krutmanmiller": "You are one of the first plus bloggers I followed and you opened up a world to me that I didn’t know existed. Thank you.", "helencletus": "Awww you’re amazing and so inspirational to me!! Oh I saw a swimsuit style I’d like you to make for us plus size ladies 😊", "yuzu.exe": "700$ to buy myself some lingerie to feel cute for no one but myself !!!", "ebwiggans": "I love how you’ve inspired me to feel about myself!", "sammie_ru": "This is sweet as fuck. 😍😘", "chef_opy": "Keep on shining💥💥💥👑👑", "therealdwolfe": "@harris8643 the OG", "nazifaw": "I hope everyone is having such a special day. Good things will come. If you’re in a rough patch, remember how incredible you are and you are allowed to feel whatever you want. You are strong and wonderful and it’s okay to not be okay. ❤️❤️❤️", "makalakamaka": "Thank you so much for always being a positive influence for everyone.", "alyshaclarkeee": "omg then I could add guacamole 😭🙌🏻🙏🏻", "alicefay33": "Are you serious? Celebs literally never just hand out cash. Well if you fancy being just cool to me? I’ll prob buy something I don’t need and just feel fabulous with it. 👌🏼😂❤️", "kelly_guggi": "Thanks for the inspiration to love myself no matter the size. And of course rocking your natural hair is definitely a plus. I just love it. Keep on rocking ❤️.", "prettycreepycute": "You look gorgeous in pink! You don't match the 99c store it matches you! 😂😍😍😍", "som12luv": "Ok girl let's get in formation! Without even trying to coordinate and looking flawless! 🔥 Congrats on your following. Continued blessings", "puzl4216": "Girl! 99c store or not, you look great in anything! 😍💕", "curlylisamarie365": "Omg I'm in love with those curls. And the rest of you. Thank you for sharing all your awesomeness with us. You're def on my list of girl crushes 😍😍", "goddessthay": "You’ve literally been an inspiration for creativity since I first started following you back in ‘14 . You’ve made the confident plus size women i am today and I thank you for always being you 💕", "michtone45": "Ready set go 😃", "kaseymeaghan": "I stumbled across your account (as one does) and it has helped me find a voice in a space I didn't think there was room for me.", "they.love.tiara": "Bless your heart ♥️", "karmynmichele": "💖💖💖 This is what I love about social media...how perfect strangers believe, support, and cheer one another on as if we’re old homies 😂😍", "daliaoriakhi": "“Introducing the 99 cents ambassador for our new clothing line, @gabifresh!”", "t_moneylovesjesus": "Oooh, yes! Pick me, pick me! 👋🏽👋🏽👋🏽Who am I kidding?! My $700 will just go right back to you with my awesome Premme finds! 😘 But gon' 'head a let a girl hold somethin'! lol", "shetellstory": "I’m a teacher...in need of a vacation after school ends next week...along with a @premme.us outfit to stunt on some heauxs 😩🤣🤣 congrats @gabifresh!", "houseofzarta": "Iwish i was in a more funny space today. You are amazing! And give me inspiration to be a more sexier version of myself. Im working up the nerve to post a picture from your playful promises collection. Keep being you an inspiration to all the beauties who don't think they're good enough yet", "katieobrienpoet": "accidental matching is my FAVE 😍💓💙", "nmsurrey": "Winning would be really cool - but lady, I already won because you have brought swim and lingerie to my life that makes me feel SO SEXY!!! Honey, if I could talk to my high school self? I would tell her you were coming! 😍😍😍🙌🙌🙌🔥🔥🔥", "ruwimbomakoni": "Yay Gabi! Joining the ranks of all my favorite emojis 💕🎀🌀💙💘🗳🙏🏾🧠💦 *insert trans flag* (need Apple to get on that!) ✨", "mellen7": "@gabifresh : as badly as I would like to have some money, my girl @lindsey09 deserves this. She not only empowers other women on the daily, she also helps kids in need, is going for her masters degree, is always on point with fashion and despite going through some serious sh*t still came out a bass lady. She also introduced me to you - VOTE FOR @lindsey09 (I also wouldn’t mind it too lol) #ladylove", "nolalove": "So gorgeous!!!!! 😍", "solemnly_free": "Who said Gfresh 99cent store Bomb collab...socks !! 🧦 ahaha", "kerrieann123": "Love this 💜", "aanniieegee": "love you gabi❣️i’ve been following you since the young, fat, and fabulous tumblr fatshion blogger days, and you were one of my first style inspos 💕congrats on the 700k🤩", "hiiipower_1": "congratulations on 700k followers! you are so amazing and inspiring!!! and absolutely stunning! thank you for always being a beacon of (body) positivity and designing dope ass clothes and swimsuits!!! 😘😘", "marthamaryyy": "@gabifresh, I found your blog when I was really struggling to accept my body post ED. Reading your words and seeing you own taking up space in the world really helped me to change the way I perceive myself. Also, you led me to the brilliance that is @nadiaaboulhosn and @nicolettemason for which I am forever grateful. 😘", "cindylylyly": "With $700 I could pay my USCIS application fee to become a US Citizen 🇺🇸", "rubydanger": "I’m just speechless bc you’re so damn radiant!! Your spirit is just everything and I’m just a useless lesbian who has never looked that good at the dollar store, let alone anywhere else, in my entire life....bless you! 💖💜", "glencocolaflare": "I wanna lay my head on your bosoms and eat ginger snaps 😍", "dreafashionista": "Congrats! Well as an esthetician and makeup artist I spend every day making others look and feel beautiful and I’ve lacked some of that myself. I have to reassure myself of my confidence, intelligence and hard work. I try to post self love to my clients and followers and spread positivity. Everyone deserves to feel beautiful 💜", "chabrina.creates": "Ooo please put that pink color on a new bathing suit or a bra!! It would be so cute and I would scope asap! Also this tired teacher could really use that money for some self-care and some new bikinis", "witneyoh": "@gabifresh your page sparked my dying flame of self-love. You’ve inspired me to not only accept myself for who I am, but to embrace the qualities that make me, me. It is so incredibly freeing to overcome that after so many years. So much easier said than done, but man, when you finally let go of other peoples expectations of who should be and what you should look like, it’s so worth it. I hope to inspire others the way you’ve inspired me, regardless of your giveaway, you deserved to hear that. Part of my change has included allowing myself to be more vulnerable. Putting my thoughts into the universe and not watching from the sidelines. The best way I’ve found to do this is complimenting and celebrating other women, because that’s the only way we’re going to overcome this barrier: together. 💕", "aijuoyoat": "700$ to grow my closet! (Current one has 4 bottoms and 7 tops)", "twoaronwa": "@tinanchutty you of all people deserve a break! Raising an amazing daughter who was considered Terminally ill and staying by her side through years of Surgeries and treatment. It’s incredible that she will be graduating next week! We are all blessed to be a part of Acacia’s life- can’t wait to see what both of your Wonder women have in store for this world. Comment on this thread when time allows. @gabifresh is truly inspirational, just like you! ❤️", "mimosamommy": "Love a woman who loves a deal! You look fabulous 💕💜", "pkld29": "What kind of bagel can fly? * * * A plain bagel!! * * * P.S. Thank you for being so awesome and inspiring!!! You’ve definitely helped me feel so much more comfortable in my own skin. Sending you love!!", "queen_notorious_1": "😍😍😍😍😍", "hellokiyo": "700 dollars is enough to buy everything I want at premme and more! 😂", "divasingr": "I ❤️ your outfit and your spirit 🥂", "lookieboo": "This is a dope idea, love it. 💖❤️", "ghobobo": "Have lots of children. Four to be exact. Would love $ to lavish my 12-year-old daughter with. 🙏🙏. We love u so much and you give hope for all the plus sized girls and women out here. Please pick me!", "tea.leaf": "💜💜💜🔥", "kellsjuskells": "$700! That means playfull promises, yoga pants and chipotle! 🙌🏾 🎉🎉🍷😂😂 congrats @gabifresh 😘", "cortneypark": "I’d finally be able to get some of your lingerie and swimwear 😍. Honestly I’d just take a few of those instead of the 💵 💰!", "taramj38": "A thick chick could really use a new summer wardrobe 😉", "iamdanicanada": "Nobody:  Absolutely no one: Me: 🗣 Gabi Fresh looked fly AF at the 99 cent store, so EYE tried to look fly at the 99 cent store too. Congrats on 700K, swimsuit gawdess! You’re personally responsible for making me and my yams look good! 🙌🏾", "sirensauvage": "I only hope to one day reach your levels of success and continue to pay it forward! duality always is present on your ig: ass throwing mixed in with uplifting all of us! 💞", "blacskywalker": "So beautiful!", "no_name_in_the_street": "Dollar store slay!!! Okuuurrr!", "melissalbbward": "Congrats on all your success... you’re amazing! Thank you for introducing me to so many fab brands such as Asos etc... Thank you for showing all of us that every body is a swimsuit body. Cheers to more high waisted bikinis and endless blessings to you. 🥂🍾", "love_element": "Yes❤️❤️❤️ you're looking super cute, as always!!! So to a fellow fabulous curly haired curvy girl, lemme holla at you about this $700. 😂 I'm trying to go get my doctorate School starts June 1st. I have a 10K Fundraiser on Facebook and all. 😭 Help a sista out! ❤️ Leslye Tinson", "katesfigs_": "i’m moving from america to australia i could really use an extra $700 for just existing... IMAGINE!!!! 💛", "synaesthetic.world": "You are a wonderful person, what a nice thing to do 😀", "therealcocomac": "@gabifresh #curvewatch2018", "nanoochka": "You also look gloriously like the Nerds candy of my childhood in these colours cos you a whole SNACK girl 🔥🔥🔥", "watchmetoke": "@yelah_muabsun I love you sooooo much you’re a real light in my life ! I’m so sad you’re missing this weekend, but we have many adventures ahead of us !!! You’re a dream and I love you always 💕✨💕✨", "dollface_dose.of.melanin": "Wow that's AWESOME, such a blessing! A small gesture of kindness can really BRIGHTEN the day!!! ☺☺ One of my favorite quotes... \"When you learn, teach. When you get, GIVE.” — Maya Angelou. 💞💞💞", "chiamakaaa": "the fact that you would even do this is a step in so many right places. congratulations always gabi 🍾", "kimpennington": "Girl I have been following you since we met on the set of MTV when you were hosting a tv show with Charlemagne if I remember correctly??? How long ago was that! Now look at you!!! Almost at a milli followers. I liked your style then and here we are all these years later and I still follow you and still love your style!!! Thank you for being a boundary pusher, the OG thickiannnaa repper, we thank you and lord would my car thank you for a new oil change 😅", "tootie.416": "Thank you for making \"fatkinis\" a thing. So many more options thanks to you!❤️", "poshmark\nVerified": "Verified", "marion.claire": "WoW capitalism used for good??? What??? This idea is almost as beautiful as this pic (& the color of that jacket 🙀)", "anyneverywhere": "Won’t he do it?!!!!! 🙌🏾 Congrats to you! I promise I’ll spend all the money on your bathing suits & lingerie. 🙃", "brickmansion_": "Congratulations you really are officially that rich auntie!😂🎊❤️", "think.shan": "I have been following you for about 6 years and I just want to say thank you for inspiring me and others. As an aspiring plus size blogger, you made me feel that I can do this. You don’t understand how much of an impact you have made on women of all shapes and sizes. I have always used your blog as an guide because for years I struggled with finding nice plus size clothes. And your style was always on point! Gave me so much inspiration when it came to my personal style. And please keep making swim wear. They’re so bomb! I look forward to ordering more. But congrats Gabi! You deserve the recognition! I can’t wait to see what other big things you will do. Many blessings to you! 💕", "chouette_style": "I’m only surprised you’re not at a mil yet!! Been following along for years and I’m so happy for you! ❤️", "merrystyling": "This jacket looks fierce on you!!💋", "saracai101": "Girl... I need to know where you got that jacket because you look bomb in it!", "57snowmonica": "Firstly I'm loving your jacket! It's my favorite color. Second I'm hoping one day either postage to australia gets cheaper or you find a store here to sell your clothing because that would be awesome!. Thirdly thanks for the creativity you show us and the positive vibes you spread. 👏 finally of course I'd love some money but who doesn't?! Either way I'll still stalk (in a totally healthy way) your page 😁", "kuntymckunt": "I like big butts and I can not lie You other ladies can't deny That when a girl walks in with an itty bitty waist And a round thing in your face You get sprung", "chonknugget": "you are truly a magnificent person. congrats on 700k! you deserve many more followers, but you’ll get there ✨ to everyone on this post or in the world, you are spectacular, you are brave, you are bold, you are lovely, you are amazing. if you ever need anyone at all to speak to, be friends with, vent/rant too, my messages are always open. feel free to message me anytime. i hope you all have a great rest of your day/night. keep slayin boos 💫", "milliestotts": "Big beautiful girls have made their come back! 💪🏻💋", "chelcity1": "Gorgeous + kind = a killer combo! Congrats on all of your success!", "totmonster": "I sit back and think about $700 and how it would help with my student loans, and then I just laugh. 😂", "geewhiz555": "Girl, in regards to this contest, I'm not focused on winning, because you already are!!!! Thanks for your messages of beauty, confidence, and positivity!", "0angie": "Everything about this picture inspires positivity.💕 The colors, the confidence, the smile, the hair, that’s style. Good vibes. Positivity. And happiness.", "amberbritt25": "My closet is full, but my wallet is empty because of your inspirational outfits lol. I pick outfits with new color combos and prints because of you. There was a time when I only work a baggy tshirt and jeans, with these terrible clunky tennis shoes. Now I love skirts, dresses, and cute shoessss(so so many shoes)", "lazykal": "https://youtu.be/Q0rDBz7EOVw please make one of the winners SHIRLEY RAINES of BEAUTY 2 THE STREETS. Support beautifying the homeless @beauty2thestreetz U are amazing! I have way too many premme and gabisuits to count. Keep shining bright!💫💫", "naturallybougie_": "$700!!!!! Hell that’ll help me prepare food for my baby shower! And that’s just me eating $700 worth. 😂 #firsttimemommy", "byieshabrown": "Wow what a blessing", "plathological": "99¢ store but you look like a million bucks, or 10,101.0101010101 99¢ stores.", "marymillikenartanddesign": "pinky AND brain! @milliemilliken 🤗", "czgathers": "To anyone struggling with mental illness/hardship/dark thoughts: You are worth it, there are people that love you, and know that you are not alone. Do not give up and extinguish your light ❤️ Shine!", "applegeechiepeach": "I have 2 of your swimsuits..and they make me feel a amazing!!! Stalking and waiting to purchase my a Premme piece!!Fluff fashion finesse", "texusjms": "I would spread all the love over the #GabiFreshxcollection!!! Congrats!!!", "shamarah_": "This is so cool!!!! I have a story to tell :) I graduated college in 2012 and had just started finding plus size fashion that made me feel like myself. I was reading all kinds of blogs and videos by plus size content creators. When I looked for my graduation dress online, i found one post of a curvy woman around my age in a cute pink dress styled with a turquoise necklace and I KNEW I had to recreate it — and it was YOU!!! You inspired me then and still do now. Thank you!  PS what does a karate black belt say when you’re adjusting his artwork on the wall? “HI-YAAAAAAAAAAAA” (higher)  LOL. 🤓", "_honeygee": "Yo Gabi, I'm also Gabi. I stinking love you and appreciate all you've done for us girls who have had to push harder, work longer and hustle our game and still get up early to work our day jobs and do so with CONFIDENCE. 700K is AMAZING and I know you're gonna make it to the milly soon enough! Honestly the 700 would be nice, but really just a shout out to my favorite Gabi 😘🔥💕", "sweatmoustache": "I have your steamer", "ebony_not_ivory": "You got moneyyyyy. I need this so I can upgrade my wardrobe. My options for shopping were always so limited. I started following you years ago and you exposed me to soo many brands and made me feel like I had options. You are the baddest! You’re such an inspiration. I went through a phase of super ripped jeans because of you. You made them look so cool. $700 would help me step my game allll the way up and buy a fire wig lmao! I can’t wait to see what else you accomplish!", "_beautybyjan_": "Throw me 700 so I know it's real!!", "blaireblanco": "Following you for the past 10 years has given me so much cofidence. I’ve literally been following you since Forever 21 body con skirt days. Meeting you this year was the best thing!", "emaleigh_jd": "I am BIG inspired by you and your ventures!! Especially Premme w/ Nicolette 💕 I’m working on starting my own business as well! An intimates brand for the gender queer community! Having that money would really help with start up costs. Even the idea of it is amazing! ❤️ You’re amazing!", "marlielifts": "Love this so much 💕😘", "ena.angeline": "You and Crissle out here doing the lords work. Thank you for the positivity you spread and for introducing me to a two piece swimsuit. You and your curls are everything. Be well 💛💛", "danielle_710_": "I passed my nurse practitioner boards on Wednesday. I’m a single mom of a 3 and 5 year old and I literally gave every single penny to my degree. I have 10.38 in my bank account. I started following you and Ashley graham because I grew up plus size and was made fun of all my life. Y’all made me feel like it was perfectly ok to be me! I can’t wait to find my first job and pay it forward every single way I can! My favorite thing in the world is when someone buys my coffee In front of me and then I buy the one behind!", "lovelygreen77": "So great your growth! I have followed you for years and the glow up is beautiful. Keep it going lady!", "auntfunerin": "#thathair #thatjacket #thatcleavage 😍", "jboogiemontano": "Dipping’ and doing it at the 99!! Love the look! 🙌🏼 #99runway #thisiswhyilovethe99 #lookinglike99billion 🤗", "iwantonebean": "Thank you for being so inspiring to so many people and encouraging us to match the 99 cent store", "hani_potpie": "$700 = 7 new gabifresh Swimsuits for All about to hit my mailbox. Bring the cash to mama 👙❤️😁", "bee.poshek": "This would be so lovely 💓 I just graduated uni and I am trying to get enough funds to move out of my parents home as quickly as possible. I spent a lot of time at uni healing and being honest about who I am as a queer disabled enby person. And it's really challenging coming back into this toxic space filled with addiction and emotional abuse as the new person I built. This version of myself feels fragile and new and I dont want to lose them. Either way, thank you for the lovely content, congratulations on 700k followers! That's a lot of hard work and energy to get there. 🙌🏻💫💕", "fullafizzy": "It has been such a pleasure to watch you grow from a niche blog to an inspirational woman in the mainstream. You were the first blog I read in 2010 and I’ve been rolling with you ever since 💪🏾❤️", "kimikowakamatsu": "Thanks for giving me a community to look up to, and to help make me feel whole in my body. You’ve also given me the opportunity to wear clothes that furthers my positive relationship with my body. You’re a real one. Honestly, I’d use the money to buy work clothes for my new promotion as Vice Principal! I’ve worked hard in the last couple of years to build up a wardrobe that makes me feel good about myself, but I’m in need of some professional office apparel.", "thisisboonie": "Man look how far you’ve come. Been down since young, fat, fabulous! Keeping killing it and being fucking fab!", "ashalerp": "Seeing you smile makes me smile every.single.time. 💜", "libbyreagangarcia": "I “discovered” you from the Busy swim episode and LOVED IT!!! Then I went on your page and adored everything!!! Thank you so much for the amazing representation!!", "missmissybrown": "I remember my new trainer at work asking everyone in the room to think of their favorite Instagram star that they follow and why. I said you because you are an amazing positive role model for plus women. I had to work with the old lady section at Sears when I was a teenager until I found Lane Bryant which isn't heated towards the younger crowd. You have great style and show women that they can wear whatever they want no matter their size. This is extremely important for women, especially the younger ones. And you even have your own line! Such a positive example for women! Keep on kicking ass and thank you for being you! 👏🏻", "bitz_of_mitz": "Although I need that money...lol! just hanging out with you one day will suffice. You’re such an inspiration Gabi I can’t find the words to explain how much I admire you! Thank you for everything you do!!😍😍😍🤩🤩🤩👏🏻👏🏻👏🏻🙌🏻🙌🏻🙌🏻💪🏻💪🏻👊🏻👊🏻❤️💖❤️💖❤️💖", "summerof_86": "I’ve been following you for years! Such a positive role model for us juicy girls! Stay beautiful ❤️", "effvee_": "Gabi, you are gorgeous inside & out. I don't know you IRL or even online, for that matter, but I like your social media posts & blogs b/c they've help me to feel good in my skin & to just appreciate my body more... it's the only one I got, right? So, thank you. 💜💕💙", "ellelovegabs": "WHEW CHILLAY! Gabiiiiiiii sista sista with the Same name! 😂 i need that $700 cause I need a break from this waitressing job! Honey Me, my thighs and these poor feet are SICK & TIEDD of these customers! Lmao so that money will help ya gal take a well needed rest!😂", "anisacoa": "Your so radiant, love your outfit!♥️♥️♥️♥️♥️", "gabbalicious82": "Loved you forever! Our nicknames are the same because Gabi is just built in (Hi I'm Gabrielle😁😁) and my car broke down and is in need of repair! Blessings to you!", "my.ka.lee": "Thank you for sharing your gift, your voice, your creativity, you to the world. Your presence has helped me loved who I am as is. And for that, I’m forever grateful. Happy Friday and congrats love. It goes to show the positive impact you have made in the world.", "fearlesslyjustme": "@gabifresh Thanks for the reminder that we all need some love and in turn, need to spread it as well. Been struggling lately but my work and people like you continue to inspire a fellow OG to keep pushing. Thanks, mama and congrats on 700K!", "gabibagabrielbr": "You should come to Brazil, bringing the $700 to spent with me all over the beaches, wearing the most beautiful bikini and drinking Caipirinha (google it😄) Can you imagine two Gabis together? 🤣🤣🤣 🤜🏻🤛🏻", "bayleeannee": "This is the content I love to see 👏🏻 a friend just recommended you as one of her favorite body positive instas (cause we all need a someone to look up to) and I’m already a big fan. Thanks for being YOU so we can see that it’s okay to be US 💕", "one_awkwardhannah": "700 would help me pay off my rent for the next two months and your page has given me the strength to continue being me even in the hardest of times.", "karidrolshagen": "You are so inspiring! Also I wish I had 700$ to giveaway so if I do win this I will donate a portion to the local church!", "caileydarling": "congrats! you so deserve it! if i had $700 i would take you inside that dollar store and let you pick out anything you wanted 🤩🤩🤩", "kristenina": "Gosh you’re lovely", "l_e_h_c": "A whole snacc", "ilajadee": "I’m definitely late to see your game but I love it!! You are inspiring and just straight up killin it! And with 700$ I would get to pay my family and I’s rent while I’m still working on my art! Check out @ilajadeembroidery if you ever need something custom, I got you!!! Xoxo", "prinzsjul33": "LOVE this ensemble!!", "beckyarooney": "Once I went to the new Canadian Target in a red sweater and khakis and everyone wanted to know where stuff was??", "thejessbess": "i’m proud of you Gabi 💞 i remember being enamored of you & your pics on pinterest before i had steeped myself in bopo & plus size culture online (before i knew it was an option!). thanks for being you & zaaaaam keep it up!", "marglaza": "Thank you for reaching the ladder back down to help others rise!💗🙌🏾", "jer.glyph": "Gorgeous rosy glowing aesthetic here! I’m rocking my fro in all yellow today so word to the sisters glowing across the globe!", "southerngirlinanorthernworld": "I've been following you for years now, and you are lovely inside and out! I just have to say that your swimsuits are 🔥🔥🔥 Also we need more gals in the world like you 😍😍😍", "shae2665": "Hey beautiful! You’re always slaying in whatever you wear- ok carry on and have a good day", "marionteniade": "I remember meeting you at @simsimmah’s birthday dinner YEARS ago and you tried to convince me to watch Jersey Shore. “It’ll make you feel better about your life being in shambles” you said. Externally I was like “lol k” but internally I was like “how does she know about my life being in shambles...”😭", "wesleyeatsphotos": "$700?! That would be amazing to win this so I could pay for my last class and finally get my degree from Mount Holyoke. 😩🙏🏾", "greenpangie": "Congrats. You've been a great inspiration to me and world hence 700k followers. Keep shining", "gabrosecruz": "last week my friends and i were leaving a restaurant as it was getting dark and when we were just about to get in car, one of the girls screamed and ran towards something in the parking lot. it turns out, she was chasing a raccoon that she thought was a stray cat😅😂 (ps im living in new york for a month starting next week and $700 could help so much🥺)", "sabreeta": "🙌🏽🙌🏽🙌🏽 That would be such a blessing!! Please help me and my 2 toddlers out! I have a 4 yr old son and a 2 year old daughter! My cash app is $SabreaOrange 🙏🏾🙏🏾🙏🏾", "waitwhhaaat": "Thank you for being the beautiful force that gave plus-sized people the opportunity to feel beautiful in a bathing suit! Young femmes shouldn’t be shamed into covering up and you helped pave that way! Still rock my swim suits for all, suits! 💜💜💜", "samedaysamemoon": "Congrats on this milestone!! I can't wait to see how you and your work grow in the future. I wish you the best of luck ❤❤❤", "solidsnake297": "What tah chicken fajita!! Thanks!!", "coolncurvy": "You are fabulous 😍", "realtalkvikki": "My past relationships have taught me a lot, so in my next relationship I am asking for a $3,000 ‘Security Deposit’. Upfront! Cash ONLY!💵😜", "jackie_p__": "@charmainermorgan uwwww look at God. Push through Jesus I’m waiting on my blessin 👏🏾👏🏾😩🙌🏾🙌🏾🙌🏾🙌🏾"}