{"neerajgopalanpulayan": "These are images shorten to words 👌", "kpjumana": "❣️", "pri_ya.25": "🔥", "nayantara.shetty": "Such beautiful words!", "rashydhanyee": "I will take time to recover from this poem. This is so amazing and raw and beautiful ❣️", "hootyandthescalesofjustice": "👏🏻👏🏻👏🏻👏🏻👏🏻", "drishti2266": "Its a wonderful expression of how woman stop recognizing who they are in front of the man they love its painful and exists in 75%indian society . They'll be beaten up they'll be humiliated in front of millions but just one sorry is enough to cover all the wrong doings ..", "paruldiwedi": "❤️❤️", "clara_the_trans_gal": "This is beautiful, thank you for sharing", "frenzied_mind": "❤️❤️❤️❤️❤️", "themilindpurohit": "This is too powerful yar", "rev_wati": "More power to you❤️", "ruhisheikh_": "❤️", "banana_with_an_i": "This is beautiful 💛😭", "cynical.snitch": "I was able to understand the entire thing but it's bugging me that I'm not able to decipher what you mean when you say paisleys. :/ what is that representing? Really want to know. Very interested and amazed by the poem.", "jashchhabria": "@om_pawa teri wali", "mahathi.g": "❤️", "madhav1824": "👏👏❤️❤️", "being_roman1994": "Happy transgender Day🙌", "brains_on_rent": "You give me a lot of courage! Thank you so much for existing. Thank you.", "divyakashyap": "♥️♥️♥️", "lost._.wolf": "Danmm🙌", "sunflowersnsunshinee_": "This is beautiful!!!", "kshipraoverhere": "❤️", "bud_wiser09": "This is so beautifully written 💕", "blooming_me_": "Omg. I'm gonna sit in the corner and cry a little now.", "achlapahwa": "You are amazing 🌟 so much power in those words ♥", "ayna_ii_anya": "I don’t know if you’ll see this but throughout your posts I have always noticed and seen this sense of strength and vulnerability in your eyes. Whether staring into the camera or not. And it keeps on reminding me whenever I’m scrolling through IG and find your posts that it gives me courage and support of “you can do this”. You’re so beautiful and inspiring. And I’m so genuinely thankful to read and see your posts🌹🌹", "panditaradhikaa": "Oh. My. God. This.... I haven't gone through any of this, but even I felt the pain, it's that breathtakingly heart wrenching. I love you so much and I'm so proud of you for being who you are today. I love you. 😭🖤", "ishrita_": "This is beautiful and well written. Thank you ❤", "acethetic_madao": "This was ethereal. Way too beautiful.", "the_prickster": "Wow wow! This resonates so deeply! 💕", "karuna.subbiah": "❤️❤️❤️", "heyarsh": "This is so pure, I can't even comprehend...you should seriously write some books😍", "rakserpentina": "This is so stirring. It's beautifully written. 💛", "not_thefirstofmyname": "This struck chords in me that I'm mostly moved on from.. Moved on, but never forgotten.. May the Universe give us all strength", "jellyintheskywithdiamonds": "Beautiful beyond words", "mindfulpursuit": "Beautiful poem💕", "chitrasrinivaz": "Holygod, i had goosebumps", "theglorioussoul": "❤️❤️❤️❤️", "vibha_rao06": "This is beautiful.❤️", "bluester26": "❤️😭", "manognaa.s": "It's just Heartbreakingly Beautiful ❤️❤️❤️", "prathyakshaa": "So touching and wonderfully written (goes without saying)! Your writing always pierces hearts. 💕", "gundeep47": "Thank you for this. ♥️", "kawaiibloggerchan": "This echoes in such a deeply personal, yet practically universal, place for me. Its something that most of us have known far too well. Thank you for this articulation. To be loved isnt a revolution. It isn’t asking for much. Thank you for the reminder that I need to hold potential partners to a standard higher than... “tolerance”. ❤️💕", "d.shailen": "Damn! Those words", "un_arth": "💖", "kritiahuja_01": "This is beautiful 💕❤️", "iwillgoout2017": "Ooooof this is beautifully written 💔", "watashiwasharma": "♥️♥️", "smready": "@dishlexsick omg read this", "samuelrith": "❤️❤️❤️", "floofy.eli": "🖤🖤🖤🖤🖤🖤", "xoxodisappointment": "this is so beautiful I cri 🥺"}