{"cthroughmyies": "I don't know what is Modi and his PR team smoking", "thatgrlaashna": "Trinetra listen to me... I like you and you are beautiful... And this i meant it ..👍💜🎉", "mahathi.g": "Glad you got through it. Thank you for persisting and for continuing to make an impact. Grateful to have you and wish I could have extended a hand/empathy when you needed it. Doing it virtually now ❤️🤗", "reclusive.hoe": "Ahahha fuck yes", "sumanthbhatkal": "Awsome pic 👌😊", "diddlydoo987": "@ind0ctrination no one forced you to go through with the surgery. You knew the complications and the effects it would have on your academics and other aspects of your life. Stop being a baby for once.", "vanshika.shukla": "More power to you", "rajinder_sainani": "Beautifull", "amar2271975": "Sorry this is out of place, but you're looking prettier than ever😍", "aahh_poo": "Have you considered listening to the Wu-Tang Clan?", "anis_the_creator": "People aren't sensible these days & not at all thoughtful , they can't understand or feel what their action can do to themselves , leave others .", "mountainsandflipflops": "You know I love you, so don’t get me wrong. I think everyone’s struggle is valid. Yours in your own way- and as much I want to understand it, I will never be able to feel it in the way you do/did. Even my empathy (which is my strongest quality) will find itself lacking. It’s the same with any other struggle- mental or physical. We are in no position to demean or quantify other’s struggles, no matter how big or small. When someone says they are going through shit, who am I (or you) to tell them that the stuff they’re going through isn’t shitty enough? Just because we’ve seen the worst.. Empathy isn’t selective- this is not a competition. No one, no one at all, should deliberately be made to feel unseen/unheard/invalid.", "secret_introvert": "Just read your explanation (and I am pissed at myself that I had to read it to get context. Still a long way to go I guess.) But oh my God makes so much sense as to why I, personally, have been not getting so worked up about the situation. If you are anything other than what the society deems is perfect AND \"normal\", your world ends everyday. As someone who has been religiously shamed for my body, my mental health issues and my sexuality - overt or subtle, this realisation just made me clutch my phone tighter. Even the most sensitive of us don't get unless we ourselves suffer. What a terrible information to grasp on. Sigh.", "snehaarora260": "You are inspiration sweetheart🔥♥️", "un_arth": "💖💖", "awristhrottle": "Yup, avavanuku vandha dhan theriyum, vaandhiyum baedhiyum 🤷‍♂️ #empathymatters", "im_lawyerguy": "Ti apni marzi se katwane gaya tha isiliye lockdown tha, corona kisi ke marzi se nahi aata.", "iwillgoout2017": "💔 may the world change after this, when we emerge from this after months or however long it takes, may it make us more inclusive and empathetic to everyone's needs. Hugs", "rai_sahab24": "I understand your frustration though not completely but get the idea of it.", "ape_trail": "Umm. We didn't know what you were going through?! Atkeast I didn't!", "_bhargavi_murthy_": "i respect your views and don't let the fuckers get to you✨", "shreyareads": "you go girl!", "ddevh": "No reason, no empathy. Everyone's selfish. Best to avoid the hate and focus on your growth. Fuck them all.", "souhardh_k": "Understandable but I don’t think it’s comparable to what’s happening now"}