{"_muhamadparvez_": "@viralbhayani If you are neutral and have guts then post this one too. Do not show only one side of a story. Come on man if you have guts then post all these slides. @viralbhayani", "aman_singh_24_": "Just give one freakin footage of the above mentioned events...why is it not on a single news channel, leave aaj tak and zee", "rohitisnot": "Well put. You could rewrite it hindi and post it to tik tok to reach the ones who are more in need of this indoctrination :p", "gutsy_goon": "In simple words the crime is capital this time, they are fucking throwing stones and spitting on the gods of the hour even after what they have done, so its useless comparing the above incidence , you are the one making these things religious! Cause media even focused on gaumutra for 2 days but this time the cases have gone double in a couple days and most of the patients are of the jammad don't you see??? Just don't make it religious 🤫🤫 All are being punished according to their crime and not all the jammad people are under custody only the one who should be questioned so please stop making it secular 🙏🙏", "rahulmvns": "There is some thing really wrong with jamatians and understanding of Islam by followers. Why only people of one community always against government. Doctors, police. Now I feel the govt needs to be like communist to get free of coronavirus.", "ghost.is.travelling": "They are spitting everywhere. What if people die after getting infected of their spit? Are we going to hang them? What would be the punishment?", "anushanegi": "I think so the news channels have never mentioned the term religion bcz they clearly understand the difference.The topic is not religious at all it's about humanity.But doing such unkindly things to doctors and nurses in the name of religion is wrong.We should respect every religion and remember one thing all religion firstly teaches us humanity.Understand that", "sama_ssaammaa": "Respect to you ❤️", "vaishhh.__": "You can talk about gau mutra party mock hindus and then say freedom of speech and all and now asking why others are criticising this and defending this Hypocrites and also one wrong doesn't defend another wrong! @ind0ctrination and of that is not Islamophobic that doc is giving you ans in to own lang this people deserve that and you term everyone Islamophobic who oppose you vaahhh!", "adityapandhare": "Although the anger at every one else is justified, police are hardly to be blamed here. They warned the Jamaat repeatedly and have proof. As to why a stricter action was not taken - it's generally very difficult in India to act against any religious events/ gatherings. It gets easily politisized by either left or right. If they had taken stricter action, the might have seen some of us questioning them for picking on muslims. And keeping that aside, understand that jamaat was only emptied 2 days back after personal persuation by NSA. The reality of these areas is that police can't even enter there on legal business unless blessed by these clurgies and shit.", "siddharthsridar_": "finally something that makes sense", "nakedbjp2020": "Is baat m koi shaq nahi ke insaan ko uska bhagwan/Allah hi jindagi deta hai or ek din wahi le lega", "anish_strong": "Hello mam can you please check your messages", "nandwani.arpit": "You are just trying downplay the Nizamuddin perpetrators involvement. No matter what the govt does, it seems you are always gonna complain. Our govt. acted in a much more swift and decisive manner as compared to Italy or US. The cops can only do so much, rest is dependent on the citizens and as in this case, those angry reckless self centered idiots of Nizamuddin. Instead of asking for help to evacuate of get proper check up, they freakin ran away infecting everyone on the way. No excuses for them.", "justice4everyone1": "Feminist clown most negative and propagenda leftist page ,I hope you really trying to have neutral view but jurno about yogi shared fake news , and those people at jamat n many Muslim intentionally trying to spread it like it's Allah given and even making videos on tiktok. You didn't know about jihad , I have seen land-jihad in my area and attack on hindu procession is normal thing, becz I am a kaffir for them.", "the_unorthodox_nerd": "The last post was literally my mind voice....being a medical student myself", "patiladi96": "Jamaati bhadvas getting triggered", "nakulalex": "Who’s saying Islam is the only stupid religion? All of you are assholes. The country asked everyone, Hindus, Muslims, Sikhs etc., to be in your home for 21 days. But for all of you ‘religious’ and “god fearing” idiots, we are now in danger.", "imsunnyboy01": "Let the pandemic curse this destructive generation of ours and may there be mass wipe out to make some bright space to breath for the future generations...WE HUMAND ARE LEADING THIS WORLD TO DEVASTATION AND DOOMS DAY..Humans with No Humanity👏👏👏", "ishwarya26": "This is disgusting... How could you even compare the ministers propaganda and cultural gathering with that of the filthy act done by people at Indore over the doctors? Doctors are putting their life at risk to save others. If not given respect,at least shouldn't hurt them. Of course there are faults in govt side... But in the name defending... Please don't talk shit @ind0ctrination", "afshan.fathima": "Thank you for addressing this. Everybody attacking only Muslims is not the solution to the problem. Only the oppressed know how it feels to be scared without reason just because you belong to a particular community of people. May the knowledge be spread and let the truth prevail. Thank you @ind0ctrination you've always been a mental support through out ❤️", "_umashanker_": "This is horrible!", "merav_dsouza": "Fully agree with this!🙌", "visualsofsrijan": "Thank you for this.", "ornate.brute": "Thank you so much for making sense. Whataboutism isn't going to fetch us any results.", "xalxo.s": "I was itching to use the right words in the right way to make my point and for some reason I couldn’t. Thanks for saying what a lot of us wanted to. You’re doing great", "pene.lope9940": "You are amazing...thank u soo much....❤️❤️❤️❤️❤️❤️❤️", "benishajulian": "Somebody hose these people down.😒", "vocal_avacado_": "Can I share this please?", "pastels_n_polaroids": "THANK YOU FOR STANDING UP!", "ind0ctrination": "Speaking of migrant workers being a threat to public health as a result of their mass migration - OF COURSE IT GOES WITHOUT SAYING - this was a result of poor planning and inefficient communication on the Centre's part. OF COURSE they shouldn't be punished for something that stems from a direct lack of daily income and reassurance that needs will be met.", "a__bashu": "Thank you ❤️", "reyaz.hussain": "@s.i.m.r.a.n_09", "_stolen._.king_77": "Corona is now a MUSLIM so 🤣🤣🤣", "dikshithas30": "I suggest we lock up EVERYBODY, indiscriminate of religion, gender, caste, etc. who disobey/ed the curfew for whatever purpose that isn't a basic necessity and let them all die.", "droopyeyesalways": "People don't give a shit about doctors. They are using this to demonise Muslims. Literally not a single comment on that video of things being thrown at the doctor are about the doctor. They're just about killing Muslims and other graphic horror.", "loveaashiq": "Thank you sister... Atleast u understand they are suppressing us by all possible means...", "anachronomaly": "Idk if any of the commenters mentioned it. But I’ve come across the info that the context to Indore video is that a whatsapp forward had reached people where it said since there’s no cure for coronavirus, suspected positive cases will be poisoned by doctors. Then when the team reached, people were paranoid and angry that if they fall sick they will be killed. Needless to, with all the talk about goli marna etc. it would sound like a credible threat. I’m not justifying any violent behaviour. I cried when I saw this video last night and I’m still shaken. But now I’m also angry about WHY such rumours would be circulated and who would get up to such assholery.", "steelo_steal_yo": "Congrats", "harshit_official": "It's about the way some of them are following it. Their so called maulvi was saying that corona is nothing, it can't affect us and all, he was misguiding them, in international records it's mentioned that this jamat has connections with Al-qaida and just check the letter which is written by the nurses of the hospital where these people are getting treatment, it states that these people are walking naked, and doing wrong actions. No one is targeting any religion but the values some of the so called fake maulvis are giving and people believing him.", "_aruushi_": "Thank you for putting all the points together. ✨", "aahh_poo": "Most sensible post on the Internet rn!", "saumyyyaaa": "Glad to see nuance isn't dead", "closehan": "thank you for always using your platform to inform others ❤️", "shubhankarotikalyanam": "So there's this video going around of March 23rd post the event, of the police requesting the leaders to evacuate the people still there from the event which ended on March 15th. Apparently there wasn't exactly supportive behaviour from the management. Unverified though.", "drshiprarai": "👏"}