{"___________eto___________tanya": "Sweet story!❤️", "shamaya_silver": "So cute this choti is😘😘", "iiwinchesterii": "I wish you'd buy those clips and flaunt them. I hope you get your wish fulfilled. 💕💕💕💕", "rajkritisinha": "Beautifully written. Much love and power to you. 🌹", "_wherearetheblues_": "How beautiful are you!!! All love💕", "di_a_riya": "My heart goes out to the little child who had to endure this and to the woman that child has grown to be💕", "believer0.7": "♥️❤️❤️", "divyashappinesshive": "Much love to you Trinetra @ind0ctrination. Its so hard to believe that adults do that to kids. We go though the phases of healing which in turn builds the strength of our character. This is what I wrote recently: Broken adults raising broken children, people can't give love which they never recieved. I hope more and more people are healed, for our heart is a muscle too, we flex it with love, it gets healthy and spreads love. I am hopeful, we all can spread love 😍💃", "kneeharikaa": "iʼm sorry you had to go through that. with regards to the incident in particular, teachers need to stop using humiliation as punishment. sending love ❤️❤️❤️", "shrutim3110": "This is heartbreaking and beautiful at the same time. The evocative articulation and the realisation that how as humans we fail in understanding the most natural aspects of human life itself. Trivial things as they may seem, are clearly not so little for some. But this story, as we see now, has come to a victorious and empowering conclusion. Lots of Love. ❤️", "anny.singh_02": "Do u think about writing a book on ur life maybe later when ur a successful doctor? Just to help others like u? Because girl I think u should", "lostlove.e": "Hot", "anjukris": "This one made me tear up. Much love and hugs 💜", "nn_yuzhou__4ever": "Girl this made me cry.. I can't think of how much you'all suffered during that young age .. Baby Angad is so cute and I don't wanna imagine tears on his eyes😭 .. Hope you'll have happiest days ahead", "saumyaahahaha": "I hope your days now be more happier and peaceful 💙💗 you deserve all the wonderful things in life. 💛", "wholesome_goofball": "💛🌸", "pure.heroine96": "Trinetra, I hope every adult who read/is reading/will read this post, learns to be more empathetic and kind towards children. Thank you for writing this. You're gonna change lives. 💖", "musafirhu_yaaron": "Perfect", "potfislife": "I'm furious at your teacher's insensitivity and urge to punish, to humiliate but I'm so glad that you've grown out of that and are able to talk about it today. More power to you, girl. 😘 @nastyhabibi", "minilad": "This is so mean. I’m sorry you had to go through that. Bullying should not be normalized. ❤️", "oldpalaces_newroads": "I love you. Would you like to go on a date with me?", "shubhasinghsisodia": "This is heartbreaking but at the same time it inspires and pushes us to make a change in whatever little way we can. We should all start with the children in our own houses so that one of their classmates or themselves don't have to face such a humiliating experience. It's also heartbreaking to think that a kid had to keep her desires buried inside and never ask for the things she wanted. Even imagining such a scenario suffocates me. I wanted a lot of things and most times i couldn't get them because of financial restrains but atleast i could ask for what i wanted, can't imagine not even being able to say what i wanted. Also, The teacher not just insulted a little kid but also womanhood for her womanhood was laughable.", "chibisubaru": "That’s so mean, what a horrible person", "giah0402": "@mightymoron23 she is actually so beautiful.", "s.h.a.i.l": "I love you❤️", "eishitaa": "There is so much homophobia and transphobia in educational institutions and school curriculums. More often than not, adults want kids to mirror them and become exactly like them because they don't know any other definition of being \"normal and correct\"", "kleeee.shay": "@ind0ctrination teachers shouldn’t be this insensitive(for the lack of a better word).☹️ That makes me feel so bad about the younger you.😔", "bombaychuddies": ":'( 🤗", "traveleatslayy": "Your story reminds me to be all the more empathetic to others and strong myself. Such an inspiration❤️", "phrootjoose": "Heart breaking. So beautifully articulated❤️", "thatduskydamsel": "I cri.", "ellegranger795": "@ind0ctrination Dear Trinetra, I'm sorry you had to go through so much trauma. But you should also know that you're so strong and loved rn. We are so proud of you, and you will always have our love and support. Hope your scars heal someday, but let the marks remind you of how far you have come. Thank you, for not giving up. ❤", "versyna": "You're an inspiration, more love and power to you ❤️", "vinivi._": "You are so strong and brave 🌹💖", "haimahaldar": "Always wanted a daughter, just so I can do \"hairstyle\" for her...I think that's the career I would have chosen had I not become an architect...Remember all the experimentation I did on my poor mother...once had cut her hair so short that she could no longer braid it and she didn't talk to me for days...when Ogu and you were small, I was once again this self styled hairstylist...both of you had haircuts from me till you were old enough to go to a barber...when Dadu was old and frail and one could no longer step out of the house again giving him haircuts fell on to me...over the years styling hair is simply something I love to do...Remember the many times in your child hood when I would tie your hair in 2 little ponytails, often in mismatched rubber bands...😂😂 look forward to you growing out your hair and some sessions of serious styling...without the scissors, this time...❤️❤️", "snugglesnatch": "Weeping", "_umashanker_": "I still have that rakhi btw♥️", "kanmaniray": "I am sorry you had to go through this. Trinetra, sending you hugs and lots of love 💜💜💜💜💜", "__navs1398__": "This is so deep 😭 how can a teacher behave like that like seriously 😑", "ind0ctrination": "Y'all help me heal and it's so wonderful thank you ily", "raidentail": "❤️❤️", "ipukerainbowzz": "❤️ you're so brave", "storiesrevolutionary": "Hey Trinetra, we absolutely love how you have articulated your emotions through this story! Would you be willing to share this story through our page as well? Hoping for a positive response 🌻", "samesexldr": "I have no words Trinetra, only love and respect for that yearning little girl who’s now a Queen 👑🌹", "theofficial_dr.golu": ":'( ♥️ i just had baby angad image in my head reading this all this while", "an_apocalypse": "You inspire me, every day. 💓", "thegoodslytherin": "I'm just always at a loss of words when i read your captions. More power to you, Trinetra❤💕", "shruta_nair": "Ohmygod! This is heartbreaking 😭", "mohibaurooj": "You're a woman of substance! :')", "kriti.j.das": "How Dare she ? How can someone claim to be an educator and be this toxic? For shame. More power to you, Trinetra. Here's to your long locks. Adorn it with all the prettiest clips ever, love. 🌺🖤", "bbrain_ded": "so vivid, so beautiful.💕", "yoshiartist4": "which teacher does that I mean that's ridiculous. Oh my gosh I am crying literally seriously this is duh how to put it in words I I love you . Thanks for inspiring each one of us each day with your posts I adore you🌼", "_ipsitamishra": "@sarthakp01", "vanshika.k": "More power to you 🌼", "oorja.mp": "Could visualize it so well. You have beautiful hair and that braid is goals. More power to you girl.", "yourstrulyaziraphale": "🖤", "thorns_nd_flames": "You have a gift Trinetra ❤️ so proud of you❤️❤️", "properlypurple": "😭😭😭💜💜", "n_e_h_h_h": "❤️❤️❤️😍", "tanvijaipuriar": "Heartbreaking ! Thank you for sharing ! ❣️", "ankyitsme": "Imma cry", "ofnosurnamefame": "What are you doing in a medical school! You should be writing and that’s all you must be doing. This is beautiful.", "sumana_kasturi": "You're so strong. You inspire me everyday💖", "barelyswati": "❤️", "manjunatha12poojary": "Nice", "thecurvedprobe": "Teachers and doctors shouldn't practice or teach without learning the meaning of sensitivity or empathy...", "amiefuzz": "Could almost visualise it the entire time I was reading it. Probably because the memory is still so vivid and detailed in your mind.", "sancharyghosh": "This is heartaching, but also very poignantly written💙", "__an.and__": "♥♥♥", "thesighmachine": "That's how you tell a story. Hoping you'd write a memoir or literary fiction soon."}