{"aiman_57": "💜🙌", "rk457999": "I remember 576104. Also, you inspire me😁", "raunakdhupar_": "This is so beautiful :,) more power to youu❤️", "nadeepaws": "Wow. You write beautifully. ❤️", "isurbhi_joshi": "Reading Your posts I always start to feel more powerful as a girl.... Seeing your comfort with your own body and mind really pushes me to accept mine more.... Love these words.... Thank you for this post.... More power to you! 💗", "sabyasachi_talukdar": "Hope. Kudos 😇", "wewake.up": "💜 I've never read pieces that transcend me to another world until I read yours'.", "chandhana_singaravel": "@vanjulaoppili", "rendezvous_93": "Nice earrings there ❤️", "femanusha": "Such an inspiring segment of Your life. Small thoughts/ideas to solidify self and also future which will become a dominant force to lead and excel individuals for better tomorrow. Kickarse girl.....go get it!! 👏  Luv 😘", "lightermachis": "Can't think of a befitting gaali for the cissies.", "senpuja13": "Wow 💞 Your writing is incredible! And so are you. You are an inspiration to many.", "yoshiartist4": "You make me believe in myself Everytime I read your posts you are an inspiration.🔥", "crispy_turtles": "❤️❤️❤️❤️ It's crazy how touching fricking Insta captions can be", "therucksackgypshe_": "This is daunting and beautiful. I could feel your words. All power to you", "soulfully_saroja": ":')", "the_philotherian": "You're love by many.", "roshhed": "All love, good things and hugs to you 💕", "ariya_jayan": "❤", "nainamenon1": "Your words are so magical and inspiring! More power to you babe!", "meghasawhneydraws": "❤️❤️❤️", "explorerkv": "Feeling too many emotions at once. Much love !❤️", "abuiyer": "You're beautiful", "thismadrasgirl": "You write so, so well! Just came across your profile and have been sitting on all your posts for over an hour now! Thank you!😊", "fucked_up_anon": "Heyy, you really are inspirational. Can I ask you a question?", "ironboobies": "Not only are you so phenomenal in your being, but also you write gorgeous prose. The more of your posts I read, the more am I in awe of you. Though we've never met or even had a more personal conversation than this, and I don't know if it means anything coming from a stranger, know that there are millions out there who you inspire in way more than one. More power to you, beautiful! ❤", "ayushidixit_97": "❤️❤️❤️", "manjunatha12poojary": "Nice❤️", "gayatri_roch": "This is what I needed to read right now❤️", "sim04_bfc": "I'm crying rn. You're such a bundle of hope🌈. Much love.", "aishwaryav21294": "I smiled at \"don't call me Anna\" (cuz MIC alumni right here 🤗), but smiled wider at the end of the caption. Good on you, you're a 🌻", "anubhasawhney": "You are forever..🤗 also, here's to rocking the winged eyeliner har baar, baar baar!", "ipukerainbowzz": "I love the yellow nath so beautiful you look 😍 you're very beautiful T ❤️", "vqueer": "We will meet soon, share lots of these stories, cry, laugh, and make merry soon! Meanwhile pyaar!", "the_intrepidsoul": ":') ❤️", "shamaya_silver": "Years ago I saw you on a beauty and lifestyle blog...I think it was atryees page .", "in_search_of_me": "❤️", "nehaanvar": "so happy for you 🖤", "eshita.dubey": "This is beautiful 😍❤️", "ekta__chawla": "You are so brave ❤️❤️", "harshita__dubey": "So so proud and happy for you ❤️", "anuradhav.menon": "I hope life always gives you opportunities ( good one's)and time to write. You inspire a lot of us you dont even know to be better people, every step we take.", "madhurimakarfa": "Such a powerful piece of writing. You piece together your thoughts and feelings with such coherence! Thank you for sharing your experiences, this kind of honesty is very hard to come by. More power to you! Your resilience is inspiring and gives hope to a lot of us out here!Wish you all the happiness in the world.", "eeshwar1228": "Girl, u r Soooooo brave!!! Kudos to u for standing up for urself even after ppl treating u that way! I wish I could b as brave as u, tbh!", "pradeepthi_27": "You're an incredible incredible woman, Trinetra. I'm so glad that you let us into the hardest parts of your life and every post you put up, leaves me in awe. Onwards and upwards, Queen!💙🙏", "ishitaupp": "Your captions are immensely beautiful- I'm always in awe of the stories you share, but almost more so of your writing capability. You do a great job.", "alice.eli0325": "Genuinely from the core of my heart .. can I express wat I feel ?? I feel ur writings similar to Ruskin bond . I really really really get blown away everytime I go through your style of writing ! 😊😊😊 Ily😍😍😍", "s.w.a.tii": "Your writing is so powerful.", "mockinghawking": "Such an inspiration ❤️💓❤️. Where do you get all that confidence from? Give me some too. 😭😭😭", "electronherder": "All the love to you Trinetra!", "alchemist_dr": "Why u should not call Anna?? Insight pls", "aami.ajith": "You write so beautifully!", "hitaishirathore": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "mk__aishwarya": "❤️", "haavbhav": "your posts brighten up my day", "pavithravenkat__": "Why must you be so inspiring all the time? Every. Single. Post. Every single caption, every single story.... INSPIRING AF. Please give us a break.", "_umashanker_": "Lovely kalamkari print. I'm a big fan❤️", "_afreensultana22_": "❤️", "undapakru": "beauty and bravery incomparable 🌻", "bomblaasi": "More love and power to you🌈", "_imperator.furiosa_": "wThat selfie doesn't do justice to your entire look.. 😍", "sarahali0605": "Its people like you that make the concept of hope and courage believable ❤️", "anjukris": "💜", "rakshika_aphale": "You're such an inspiration Trinetra! More love and power to you❤️", "chiaramcr": "Your captions are beautiful", "asefa_h": "❤️", "kl_soundarya": "❤️", "aqsa_arabesque": "Omg you’re so beautiful, literally too much love to you😍💖💖💖", "riactionn": "so so proud. ❤️", "freee_child": "♥️♥️♥️♥️♥️♥️♥️", "thebarodababe": "This is the best thing I've read today 😌 much love to you and your strength ❤️", "haimahaldar": "The dress looks so good on you...❤️❤️", "floofy.eli": "You're an inspiration. Fuck transphobia 🖤🖤🖤"}