{"xoxodisappointment": "So FUCKING PROUD of you , more power to you .", "praveen17k": "Awesome 👍😍", "sasseshwari": "May the force be with you always to fight back the social evils😇💖", "sim04_bfc": "So much love and power to you 💖💯💞", "drishygraphy_": "Ufff 🔥", "dr.atharpasha": "Divine😍", "floating_petal": "Beautiful", "chauhanronit0": "Majestic ❤️", "prathikbm_": "🔥🔥", "gypsy_janii": "❤️", "divya_ddee": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ So much love to you", "shreshthabharti": "♥️♥️♥️♥️", "karuna.subbiah": "❤️", "namastey_stay_away": "💕❤️", "iwittyness": "💯💯", "ishan28mkip": "That picture is so beautiful but your courage even more so. Inspired 💯", "shamaya_silver": "❤️❤️❤️❤️❤️❤️.you are a rockstar.", "shivangi0731": "Sending rainbows your way🌈🌈🌈♥️♥️", "taniapaulx": "More power to you Trinetra ❤️ Stay strong.", "raidentail": "Wow..❤️❤️❤️", "revmxgrae": "What a beautiful act of preservation and shift.💜🙏🔥💪", "versatile_paradox": "So proud of you... Extremely glad that you discovered your power!", "izanagijuly": "I’m sorry you had to go through this but even though I don’t know you well I AM SO PROUD OF YOU FOR STANDING YOUR GROUND AND TAKING CARE OF YOURSELF AND OTHERS. Nothing about what happened was easy but a warrior woke once again inside of you and you LET HER OUT. 💜💜", "aditwrks": "omg 😭😭, more love and power to you", "naumanahmad.6398": "Lovely", "pathak_purva": "More power! 🔥", "eonmedicalspa": "I am sorry that you had to go through this. Unfortunately, being a woman comes with being sexually harnessed/assaulted. Thank you for sharing your story. Did you report it?", "umlaah": "I hope you are in the process of healing. Sending you lots of strength. And this must have been hard to to do, both writing it down and the act itself but so glad you could do both!", "sarcastic_arakki": "You have no idea how much hope you give me to fight. I've been traumatized by similar events in the past but all I did was tremble in inordinate fear. I shall now learn to reclaim my respect too. Thank you for being strong and letting us know that we could be strong too. More power to you, girl.", "_pearldsouza_": "More power to you.", "iam_sreejani": "I am really sorry you had to go through this; but unlike me, you actually had the courage to rise against him.", "curious_tresses": "A very unfortunate incident. You are a very strong woman, may the force be with you and may you always have the courage of doing what is right for you.", "veedaqueer": "❤️❤️", "sayssharmi": "I'm so so proud of you! Biggg hug! 😃 You do you!", "vipsa.a": "I’m very proud!", "reshu_bhatiaa": "🔥🔥", "visualsofsrijan": "❤️", "goga0201": "You're super brave. Don't stop evolving, it's inspiring 💯", "aradhika_aj": "More power to you Kween", "thegoodslytherin": "I'm so sorry you had to go through that.. more power to you, you're an absolute force❤", "jayesh__jp": "🌼🌼🌼", "payelinsta2018": "❤️", "lady_gabbbar": "This picture 😍😍😍", "abhiraj4333": "Dii can I ask u a question ?", "lingamharagopal": "More power to you Trinethra . You stood up for what was right! Takes immense courage and self belief during situations such as the one you were part of.", "human_ki_lodi": "Sending hugs to you and your friend🤗", "parsatee._.99": "Sexy nari in a sexy saree😘", "surej_ukrish": "More power to you 💯", "pradeepthi_27": "You're a warrior princess.💕", "vaishnavii22": "Strongestttt person on my instagram!! People mostly upload there pretty pictures but are not themselves pretty....but guess what you are beauty inside and outside both...and the strongesstttt....all the love to youuuuu💕♥️🔥🙈", "_umashanker_": "I'm so glad you did what you did. I hope that ass**** is smarting in more ways than one. I fervently hope he's punished severely. I'm soooo proud of you, so relieved that your friend and you are safe. 🤗🤗🤗❤️❤️❤️", "masoom_tamanna": "Don't wanna sound Cringy but I swear I m drooling over you...#justurbigirllol", "deee_tales": "❤️", "aiman_57": "Sending loadss of love to you and your friend 💜", "theariesxx": "You're unstoppable👑", "show_cage": "❤️", "ilasyama": "more power to you lady ❤️", "red_starla": "I’m so glad you and your friend are ok. I’m so sorry hands were laid on you in this way but so full of respect and admiration for how you defended yourself and your friend.", "ofnosurnamefame": "You did good. Full power to you, Trinetra. Now, and forever.", "adichandorkar": "♥️♥️♥️", "rakserpentina": "💜💜💜", "canopic_eyes97": "More power to you di", "dabblepen": "Okay. I looked at the picture and I went ‘ Woah’ and then the caption and went ‘ Woaaaaaah’. So there you have it. ‘ woah woaaaaaah’ 🐼", "ankita__pattanaik": "You are so strong😭❤️ Here's sending you lots of strength, power and LOVEEE❤️", "irrashinal_": "Publish a book. Thx.<3", "alinamerinmathew": "More power to you♥️", "frostedsloth": "Ily ❤️", "pragya_mis": "🥺👏", "mr_curly_hair": "🔥🔥", "_m.e.l.i.s.s.a.a.a.a.a_": "And you're amazing.", "shrutithakurr": "I’m so proud of you and you’re an amazing person ❤️", "abanti_849": "YOU ARE FUCKING COMMENDABLE", "bansal__aastha": "❤️", "ind0ctrination": "Cut to two weeks later - the incident has changed several things. My relationships with people, with myself. Bruises and cuts have healed. College authorities have been informed. Action has been taken, as best an inquiry committee consisting only of men can do. For now, it's enough. For now, the universe makes a little sense."}