{"serendipitush": "Respect. Lots of respect for saying it like it is. ❤️", "kheeekhee": "Ayy hot wuhman❤️ looking flyyyyy and confident", "thegoodslytherin": "You are a brave soul. Keep fighting, and remember that myself and a lot more people are always there with you in spirit. More power to you💙✨", "chaitanyaaa": "Thank you for sharing. I cannot begin to envision what you’ve gone through and continue to go through. Our society needs to dismantle the patriarchy! power to you ♥️", "eshita.dubey": "More power to you❤️❤️", "kkchdrn": "🙌", "elsa_stm": "I love the way you spoke about this. Trans men, women as well as those who don't conform to the binary gender, all of them are beautiful in my eyes. You all are shining brighter than stars. Society sucks, but individuals like you who don't give up to the societal pressure and just be true to themselves are the ones who are truly genuine in this world. God bless you all.", "new_indian_collection": "❤️❤️", "dirtytales2019": "No words 🙌🙌🙌after reading this", "7_jay_hind": "Gazab", "movie._.reviews101": "You are a disgrace to the women community", "ind0ctrination": "After all, I was raised in a society that trains us in the conditioned reflex of disgust toward certain bodies. One has to remember - much as I, a trans woman, like any other human being have no absolute right to be wanted and desired, I do have the right to question what we as a society deem desirable - to question our notions of womanhood and who/what constitutes a woman - because respect, attraction - these things are never fully inherent to us. So much is conditioned/acquired, tied intricately to structural notions of what we as a society deem worthy. My response to this marginalisation is almost always the same - it lies in asking to be seen, understood, desired for the person that I am, and for most, it is asking for too much. We have no choice but to persevere, and hope that in this impossible struggle to find worth within, those around us do too. Sometimes, lovers take photos like this one, we'll pose like we belong on the cover of Vogue, statuesque. Much like anyone that has been marginalized one way or another, I too hope that in the learned confidence the world sees, those around us also see how active an effort it is not to feel dirty. I too hope, that one day, someone like me can think about curing disease without feeling like one everyday. #TransIsBeautiful", "nupurr._": "❤️❤️ ❤️ all my respect and power to you❤️❤️", "funkybindiqueen": "You just must hear it one more time love - you are brave, you are strong, you are beautiful. We are all victims of what people think of us. It takes strength of your heart, soul n character to shine on. That’s what you are. Much love n God Bless - Always!", "jayesh__jp": "❤️", "sumo_oranges": "Also, you have such a way with words! 😭", "aarohi.exe": "all the love and power to u ! 💖", "sayssharmi": "Shine on girl! Shine on. Yess #transisbeautiful", "anubha25": "You are beautiful inside out! This world takes its own sweet time to adapt but they will some day *hope* What I see, is a strong bold trans woman, not afraid to speak her mind out and being her gorgeous self always. Being Trans is not a disease!!! PS: Those prying judging eyes are always there, you people face it a lot but so do people with long term illness. The world is built like that I suppose, sadly! Having a disease/ illness the judgy eyes don’t change, you feel they have sympathy but all they have a judgy attitude hiding behind those layers.", "ananya_mazumder": "I hope your pain passes and i hope you know you are incredible in your strength 💛", "varunkhanna97": "You’re an excellent writer", "pradeepthi_27": "You're a gift to humankind, Trinetra. A warm, strong, kind and beautiful gift.💕"}