{"imperfect_queertrans_therapist": "One such Transperson I know thats is you, who builds so much hope during such times through your expressions in writing or talking, is just so empowering. Thankyou for putting in so much in this movement! 🏳️‍🌈", "saumyaahahaha": "So much power to you.❤️ You're more powerful than poeple think and you know. You're the emblem of change. I hope people recognize your struggles and support you even if in the smallest possible way they can. I love you! I admire you! I hope someday I can be half the person you are. 🔥💙", "andriavinithalobo": "Damn soo beautiful you are❤️❤️", "_adithi._.gh": "You're bold, beautiful and inspiring. ❤️ :')", "goldbarbie.fq": "✨", "the_ridiculous_writer": "Hey, I've tried contacting you about a research project. However small the effort, it could mean something for the trans community. I hope you reply @ind0ctrination", "arudhi_verma": "You don't need validation to keep yourself going. If you can peirce through their unwanted opinions and choose your true identity, the one that is your only identity, you can go through anything that they throw at you. Don't forget, this world has never let the people live in peace who choose themselves over their trash opinions. You are a strong woman ♥", "srivastava.garima": "You prettyy❤️", "anjilamukhtar": "Power power power!❤️", "theyinfromtheyang": "You're looking sooo beautiful ♥️", "_the_enfieldian_beast_": "Beautiful💕", "utharanjali": "❤️", "appynotthedrink": "❤️❤️❤️ more power to you", "faiz_firoz": "🔥❣️", "aishwarya_ogrey": "@ind0ctrination Every word of your write up shows how much emotional energy you’ve put and what you’ve gone through. Every word can be felt. And, you look gorgeous in saree and always! ❤️", "sumo_oranges": "Please stay safe. It's horrifying to know that someone you know has died. And ik it's against your moral fibre to not do anything. But you are helping. I just don't want you to undergo anymore trauma than you already have. Idk I'm unable to express my thoughts properly 😓", "geetikaaa7": "Gosh you look so pretty! 😍", "_the_duskygirl": "Ohh my god...!!! U look so beautiful😍😍😍", "ukip_95": "Looking very beautiful, too gorgeous and quiet very adorable @ind0ctrination Mam", "mk__aishwarya": "Bold and Beautiful❤️", "parvathysreenath": "So pretty❤️", "sasseshwari": "Well it's shame to the medical fraternity that medical professors loose empathy over reality, at the same time your presence is a matter pride for the very fraternity. Doctors like you will make change in this world. Trans woman like you will make change in this world. Artists like you will make change in this world. 💖💖💖💖💖💖 Love you Trinetra.", "natashapunnoose": "You are so beautiful!!! Mentally, physically and spiritually as well!! And loved your Saree ya!!! 😘😘😘", "eepseeta_parida": "🙌", "vee.dabee": "You give me strength!", "nimah.mehrin": "Mashallah❤️", "kartick_007": "You make Influenza like a disease I want to contract. More power to you! ❤️", "_aditii_singhh_": "Omgg your so pretty 😍😍", "anugummaraju": "It was way too hard for you, and you’ve paid the price for others who will come after you. For those others, they will see a difference in the way they are treated by your profs, their peers. It sucks balls to go through what you have. The pain, the anxiety, the literal terror of losing everything to a new voice, is something no one should go through. But you did. And I hope you are better for it. I know we are. Wear that sash with pride too, because they don’t know what it means. You do. Always love.", "she.the.evol": "Reading this after seeing this gorgeous photos makes me so sad, you're utterly brave and kind, more power to you💕", "dasaceae": "Just when I thought you couldn't be more inspiring and amazing, you post this. The caption, especially. And the pictures of course.. ✨✨", "_ananyabandopadhyay_": "So friggin’ gorgeous! ❤️🔥", "allan_castelino": ":')❤️", "shameeksha4181": "💓💓💓", "_maskerade": "You look so fucking pretty!!🌺", "ind0ctrination": "I wonder if my batchmates realise how privileged they were when they dismissed my need to express my gender with \"bas mauka chahiye isko/how opportunistic\". Much as the sash that certifies me Insta Influenza is hilarious, I also find it a painful reminder of just how exhausting the forced inaction is. I find it a painful reminder of everyone that continues to see my existence as skin showing, attention whoring, unnecessary - be it peer or professor. I wonder if I'll get to protest on the streets. However, from my very first day in medical school to this day/ABCD, when I showed up feeling more comfortable in my skin than ever before, I figured that there exists one thing no amount of disrespect or disregard will ever take away from me - my ability to make my presence felt, online or off, to make my voice heard. That will continue in whatever capacity, limited by whatever circumstance. That much I will continue to do. The sash certifies it. @allan_castelino and others at @manipalthetalk - THANK YOU SO MUCH FOR THESE GORGEOUS PHOTOS!", "theblindpixel": "❤️"}