{"preetam_casimir": "❤️", "vi.o.lette": "❤️", "femwav": "Thank you for your strength ♥️", "soul_wandering_dino": "All strength to you. Thanks for being inspiration and voice to many less privileged people and everyone who is trying to exist. ❤️💚💙", "frenzied_mind": "❤️❤️❤️", "ajmlmmoochi": "Fug fascists", "meghanayerabati": "Respect existence or expect resistance! Love that line!!", "modabberahh": "Trinetra you are an amazing human. I am glad I stumbled across your profile. You are a source of strength. Keep yourself strong. The world needs more people and more doctors like you. Lots of love, respect and strength to you ❤️", "suchetana_bauri": "❤️", "aj_anujoseph": "❤️🤗 .. proud of you", "moonquak3r": "Kudos to you and the community you stand for, Tri ❤️. You’re a brave, fierce soul and don’t let anyone diminish that within 🤗 Am sorry that a trans person has to go through so much and wish the world, in general, would become a far more accepting space. For trans and for everyone else.", "_pratyushaa": "You are an inspiration for the people who are suffering and who think they aren't :') More Power to youuu ♥️", "omkarshinde_21": "More power love and respect to you💗", "acreativewildflower": "More power to you! 💖", "yashasvisharma": "Lots of love. 🙌🏼", "ayeshashanediwan_": "Much love!! ❤️✨🌼", "amihhima": "💐❤💛💚💙💜", "stray475": "#Respect", "good.for.nothing_": "❤️❤️", "pampikumaryadav2000": "Hi", "abantiwh0": "A big hug from across the country (probably). You are very strong. You don't know how many people you have inspired. As a sixteen year old brought up in a conservative household, I have always been afraid to speak about my sexuality openly. But your words give me strength. Keep going girl! We will always love you and support you. And yeah, fuck everyone who tells you the opposite.", "theriotpixie": "I dont think I could ever be this brave. You made me cry. Thank you. You're an incredible amazing person.", "thebombay_doodler": "Respect 🙏🏻 BRAVE CHILD🌸", "saaganguli": "How can I say that this soul has witnessed every pinch of this world's good and bad! Only if, I'd the courage as strong as you, things would have been different ❤️ Much power and love to you 🕺🧡", "manasi.menon": "🌻", "divya.desa": "💜💜💜", "theqr8r": "Trinetra. You are absolutely fantastic. The words you employ always give me hope and have many a times healed me and reminded me to fight harder in my neverending battle with bpd2. On some level I don't even want to say thank you because that would certainly not be enough. Watching you live your life and talk about your daily struggles, highs and lows is genuinely one of the only things that makes coming to Instagram worthwhile. I cannot wait for the day your words are immortalized as books because you really are a voice of an entire generation and somehow reading every single thing you write as mere captions feels like some gross injustice has been done. I host two of India's leading LGBTQIA+ podcasts and if you're ever in Bombay I WOULD LOVE it if I could have you on and talk to us for an episode or two. Regardless, thank you for being. ♥️", "___________eto___________tanya": "Ur a sample of strength and devotion! 💪🏼", "geethy_ka": "Respect 🙌🏻💕", "chezd2000": "❤️", "negasonic_warhead136": "Superwoman ❤️", "prayage_": "YOU ARE A QUEEEN", "yeahiamworldwidehandsomehello": "Respect existence or expect resistance.💗", "ashuk.3152": "What happened", "zeina_sravya": "More power to you! Thank you for putting it out there! Thank you for putting yourself out here! You are an inspiration to many. Continue doing what you do! You are precious and strong! Believe it! ❤️", "mehak.gupta83": "I really admire you boss!!❤️", "taesty_koookie": "#Respect More power to you woman!!❤️", "positivemindsays": "Can I get ur contact no. I mailed u but u won't reply 😢", "undapakru": "🌻", "s.w.a.tii": "💖", "osnap_pictures": "As a KMC alum myself, I’m proud of you!! I’m with you!", "ajay_chandran95": "❤️", "tambrahmpostergirl": "May I use the last sentence on a poster for the protests?🔥", "mukundkapur": "Don’t bend down ! Fight your right out @ind0ctrination", "eshabahal": "Love youuu and in solidarity with you. You're doing so fiiiine. Fuck em haters. 🌻🌸", "aaminaabdulla": "❤️❤️", "the_philotherian": "Tell mum and dad, this world is proud to have you and you're an inspiration to so many .... People look up to you for strength. You've saved lives. When I felt suicidal... Your post came up once n it showed me if she can put up with so much n still smile n spread happiness, why not me? If she can put up with so much physical n mental trauma.... I too can. My worries are ants compared to yours . And that's what gave me the power when I needed it. SHOW MOM DAD THIS COMMENT. ❤️", "akshatjha_": "Massive massive respect for you!!", "door._.darshan": "More power and love to you ♥️ you are an inspiration ♥️", "kaushiki95": "♥️♥️ thanks for putting this up.", "abna_iqbal": "❤", "pratish_aggarwal": "Glad you didn't make account private...", "drshiprarai": "More power to u woman ❤️", "whisperin.art": "You are a Brave Queen! 💕", "ilasyama": "Powerful beyond words. More more power to you girl, you lead the fight for many...", "stephenmyers103": "So powerful! I really hope you can stay strong!", "anugummaraju": "Who in the family is telling you this, re? I might just like to talk to them", "shivangi0731": "🙌🙌", "_umashanker_": "👏👏👏 so proud of you girl! Love you to bits🤗♥️♥️♥️♥️", "thecurvedprobe": "Affection is too spineless to exist outside the bedroom... So succinctly said.", "girl_with_glitter_": "I don't know you personally nor i have met you ever but i do know you as the strongest m fucking person alive and you will remain one for me always. Thank you for sharing your struggle. @ind0ctrination", "neerajgopalanpulayan": "Shocking to know such truths. More power to you, and the community.", "nirbhika_": "\"Respect existence or expect resistance\" 🙌 YAAS QUEEENN ♥️♥️🙌", "nitikasachdev": "Grateful for you and your voice ❤️", "lainasingha": "♥️", "__call_me_vish__": "But like minded people like us will strive against this injustice🔥", "ujclicks": "❤️", "saumyaahahaha": "This 🔥 !!!!!!!", "anth_13k": "I sent you a big hig from Puerto Rico", "softservedgentleman": "Are you stealth?", "imperfect_queertrans_therapist": "May I also share??", "jyotsnika": "❤️❤️❤️❤️", "reveurnj": "\"Respect existence or expect resistance\". Salute!", "krishikasata": "Respect existence or expect resistance 👏🏼✊🏽❤", "harjeevahluwalia": "❤️🔥", "cats.ncuddles": "Inappropriate- but I fuckin love you and everything you stand for ❤️ Never change.", "gaurstatic": "YAASSSS QUEEENNNN!!!!!", "zaffar_hq": "🌸🌸🌸", "may.bee.not": "Support 🙌❤️❤️❤️", "spiders_across_stars": "👏👏👏❤️", "anjaliramamurti": "May I share?", "dhanush_1507": "💛💯✨🦋", "son_of_god_566": "More power to you 🙌🙌 .", "shamithak_": "YOU GO GIRL!! ❤️❤️"}