{"ramansgdeep": "Sending more power, love and kindness your way ❤️", "purposeponderer": "May he rot in hell! May they all rot in hell!", "srushtisalunke": "would you mind if I shared this on my story and tagged his work place? I want to call him out but I need your consent prior to posting. @ind0ctrination", "_i_am_sona": "You are an inspiration🔥🔥and you are so brave, we all love you we all are with you and we respect you!", "mister.jitters": "To get this vulnerable requires a mountainload of courage. You inspire me. I wish you healing and peace. And sending love. Thank you for taking care of others while taking care of yourself. 😘", "ebaearu": "I'm so sorry you had to go through that! We adore you, your strength, I hope you'll heal out of this situation soon!💜", "whutheppenwuz": "sending you so much love always.", "cloudsd14": "Don't worry about motherhood.Just make sure that you end up with a partner who loves you beyond these things and respects you.Pretty sure you ll find happiness.", "the.lava.effect": "Shit.. I'm really fucking sorry..Stay strong.", "ali_khan_o9": "I feel really bad but the last thing you need is the advice from a man 💔", "imodelstyles": "Hey there @ind0ctrination . I'm so, extremely sorry you had to go through this. I tried messaging you earlier to talk about something similar, though I'm guessing you currently don't have the spoons to deal with what may come your way as you read my message. So I'd honestly and sincerely recommend staying clear of me. I just want you to know that if ever you wish to talk, so long as I'm alive (not sure how long that's gonna last given my current state of mind) and have access to the net, I will be there to listen. I'm a 22 year old pre-op trans girl, so I can imagine what you must have felt. I don't know if you're in a vulnerable state right now or not, and what I'm about to say stands regardless of how vulnerable you are when you read it (if you read it)... you're beautiful, wonderful, amazing, lovable and worth being happy and respected. I'm not sure how many times you've heard this before, though I'm gonna say it anyway, I really look up to you and respect you. May you flourish and bloom. \"Wildflowers are the toughest of all flowers, because they grow in the desert, the toughest place on Earth. Though as soon as they get the chance, they reach for the sun and bloom because they are survivors.\" - Carla Bennett (Nikita). Tears are coming into my eyes as I write this for the amount of love and respect I have for you and for the five years of abuse that I've endured. I truly hope you find someone who sees you for the beautiful wildflower that you are.  Tons of love from someone who is trying to convince herself despite daily tearing up that she has no feelings and isn't worth anyone's love.  A fucked up weirdo named Aanya.", "sryja": "I'm so sorry this happened. he'll pay and we'll make men like him suffer one day", "tanvi.s0036": "That's really fucking sad , as transgender you have really been through alot and now this is how your first time endup to be , that's really fucking sad I can't believe this happened , I think u froze up there and u were unable to think what to do or how to tell him to stop as when we fear we dont know what to do anymore and can't think straight , im really sorry to hear that", "sarcasm_wala_boy": "Shame on such ppl", "tera_sarmayaa": "People like him pleasure seeker are absurd people😡😡", "shivani.tiwarii": "More Power to You💙", "homo_mami": "d", "highqwriter": "I’m SO SO sorry you had to go through this. You’re so brave for being out here and talking about it. Lots of love to you. Stay as strong as you already are. 💓", "ihatetoxicmen_": "I am so sorry to hear this. Be calm, take your time to heal and thank you for sharing. ❤", "sau3012": "I'm so sorry this happened to you and thank you so much for sharing ❤️ lots of love", "rheality._": "You are a very strong person ❤️ I hope nothing like this ever happens to you or anyone else again 😔😔", "fittemu": "I am enraged at what happened to you and what this asshole has been able to do to other women, facilitated in part by dating apps that don’t do due diligence in removing sexual offenders and creating effective reporting tools. Please get in touch with me if you ever want to pursue any legal action and I really hope this guy gets what he deserves.", "kaafiprecious": "WHAT THE ACTUAL FUCK!", "anubha25": "Thank you for sharing this and you are beautiful not dirty. You are who you want to be and that is beautiful ! It’s good that you shared this. It will be helpful to others and yes keep them safe.", "aboxofmundanewords": ":(", "portalsandstuff": "Disgusting. My love and thoughts are with you.", "snehalsinha_": "This was very brave of you", "the_philotherian": "This is so much like my ex. All the sweet talks....n boasting up after my previous breakup. Gaining my trust... Making me fall..all for physical pleasures. And then... VIOLENTLY ABUSING THE HELL OUT OF ME FOR 9 MONTHS. jaw dislocation, wrist ligament injury, hematomas every now and then. Ughhh....n me the fool...took all this in the name of love... Cz they \"when you love someone you don't leave when things get dark...\" Right? Or \"when you really love someone, you stick around even on unpleasant days...n you accept them whole..and you sacrifice\" RIGHT? Yeah I felt that too. But WWRRROOOOOONNG. when you love someone you want their well being...n them.hitting u is not well. Neither for them nor you.", "dhw.ani": "we love you, please take your time to heal and don't allow anyone to gaslight you or manipulate you into believing that what happened wasn't disgusting", "sampritiroychowdhury": "This is insane. I can only imagine the kind of trauma you went through. I'm so sorry that this happened. And thank you for speaking up. It takes an immense amount of courage to do so. More power to you. Take care ❤", "apocalypseaaja": "Sending more power to you and healing", "oldhonewtricks": "I'm so so sorry you had to go through that, wishing you strength and love", "b0n3l3sss": "shit I'm so sorry, it's sickening", "tanishafagwani": "You’re so brave and I’m so sorry you went through so much. Thank you for telling us your story", "curry_mean": "I'm so sorry you had to go through this. It hurts to just read through it. So many women, young and old, go through their lives with partners like this, without even knowing why they feel abused.", "prachi_parmita21": "This shakes me to the core.", "shivam.kmr": "thank you for being this strong. I hope he pays for his wrong deeds.", "divya.desa": "I'm sorry this happened to you, Trinetra 💜 thank you for speaking out. You are wonderful, and deserving of so much love and affection. xx", "raidentail": "I'm so sorry.❤️", "just_an_afterthought": "I'm so sorry that this is what happened, and thank you so much for putting this out there", "mee_nak_chee": "Thank you so much for sharing this. I am thanking because I matched with this guy and we almost had a plan to meet this Sunday! Which he cancelled saying he is dealing with \"personal issues\". I now know what his issues were. Disgusting people ugh. Lot of gratitude love and hugs your way.", "not_thefirstofmyname": "With you in this, sister. Been through something like that. Ever need to talk, we're here. You're strong, I see people reminding you of that. Let me tell you it's okay to break down. Because that's how you truly rise. The Universe is looking out for you", "thatgirlincoffeeshop": "I'm shook... I'm sorry this happened. Thank you for speaking up", "rutuja_patil14": "I'm really sorry to hear this, but thank you for being so so brave ❤️", "ria_spirit28": "It’s really takes lot of courage to share something so personal. 👍🏻", "prernas_reflections": "I am so sorry this happened to you. Your pain and trauma is real and I can relate as a survivor. It's understandable that you were confused by the difference in behavior and the transactional nature of the interaction, I've experienced similar manipulation. It takes some time to figure out what the fuck just happened here. Anyone who doesn't pay attention to their partner to check that they're comfortable and enjoying the sexual (or non-sexual) interaction is an asshole. You consented to potential exploration before you met and a lack of enthusiastic consent is not assumed consent.", "aethelwulf9": "Why aren't you guys putting his picture up, or even liking his profile or something, like just asking, also sorry regarding what happened to you and thanks for warning others", "bedardibaalma": "@schbang this is Julius Pereira, who has worked with your agency.", "missrachelprabhu": "I'm so sorry that you had to deal with that nasty fuck. Sending you love ❤️", "izanagijuly": "I’m so sorry this happened to you that’s a terrifying concept of being with him and I know the feeling of what you went through. I went through it too. Sending love in this tough time 💜", "aries.thirunal": "Trinetra, I am horrified that something like this happened to a wonderful human being like you. You've come so far in life. Please don't let this scumbag take you down. Talk to someone you trust. You are wonderful the way you are.", "tendercoconut88": "So so sorry. Sending love", "somyasinghhh": "Oh my god. I'm so sorry you had to go through this. You're really brave for speaking out, more power to you❤️", "aekabira": "I'm so sorry. You deserve the world. Hope you feel better 🌻🌻🌻", "anvitasharma99": "I'm so sorry you had to go through this horrible experience. More power to you and you should know you aren't alone. Sending 💓💓", "hashtagg_singh": "See @ind0ctrination very simple logic... take time in choosing people for whatever... when it comes to in bed, please take even more... I understand its your life you can do whatever you want to ... but I wanna reccomend to all the people around here that finding people via Instagram isnt tough these days .. like.... for sex, no ways... very easy... but you being a doc, please try reading people even harder... though it wasnt your mistake whatsoever , but I have seen people getting gaga on people via insta without even judging them completely... like completely... much power to you .... please take care... it hurts I understand but again I'm not trying to get attention from you! Take care... much love!!!", "notrutvi": "Such a brave person ❤️", "rahuldsouza": "I’m so sorry this happened to you!", "xfnroco": "Be brave ,this too will pass 🖤", "funkybindiqueen": "You are brave! As a survivor I fully empathise with you. Reading this broke me & I teared up too. You have all of us, standing by you n rooting for you. That’s not a privilege many survivors such as me can claim to have. Not even basic understanding. I’m sending you the tightest of hugs n love. Every time you feel low, just consider yourself hugged one more time by me! God Bless. Stay shining!", "ind0ctrination": "All y'all well intentioned men giving me advice, no thanks. Not needed. I think my last slide on this post does that already, and it comes from a fairly personal account of experiencing patriarchy on multiple levels. I do not need men telling me what to take away from this. What I do need, is for you to be better.", "kunsahuja": "I AM SO SORRY TO HEAR THIS. WE’RE ALL HERE WITH YOU, NOW AND ALWAYS.", "spooky_puff": "You are a brave girl to put this on open front", "tejashri.jay": "Girl, putting this up takes EXTRAORDINARY courage. My heart breaks for you and every other woman who's had the misfortune of associating with this worm. You have no need to feel guilty for only going through \"this much\". We're here for you. We're standing with you.", "chandni_ghatak": "I’m really sorry for what you went through. I laud you for coming out like this and calling this person out. I hope in all this pain you find relief in the fact that you speaking out today, is going to save a lot of others from this kind of suffering 🧡", "tehrimazmat": "Love and hugs to you❤️ Stay strong.", "corramonga": "@micmanipal", "riturajsharma_": "More power to you🌸🌸", "aditiks": "More power to you Trinetra. And thanks for the courage you've shown in outing a threat to women.", "payal_bathija": "This makes me sick. I'm sorry you had to go through all this :(", "rajkritisinha": "I'm so so sorry, Trinetra.", "judithlalthapui": "I understand what it's like for sexual experiences to happen in a grey area of \"were they wrong or not?\", so I extend my love and empathy. If you felt hurt, you were hurt, and I'm so sorry someone took advantage of your kindness. Sending warmth and healing 💛", "mishtidoiii": "this is horrendous & i feel vv sorry. More power to you & you're brave enough to expose people like him. Hugs & bhalo theko.", "booboothefool16": "I'm so sorry this happened", "divyakastwar": "❤️❤️", "_sanjanaprabhu_": "What he did is absolutely enraging, disgusting and horrifying. I'm so so sorry for what you've gone through. Much love. I hope you heal from this. More power to you. ❤️", "piya_r009": "What the fuck he was 🙄🙄🙄. You should learn to say no to assholes . Sorry about the pain you're going through 😫 lessons learned take care of yourself. But please learn to say no to people who r trying to take advantage of u .🤧", "theorythirsty": "i’m so very sorry this happened to you, i cannot begin to comprehend what you must have been through, i hope you get stronger with every passing second. big hugsss", "thegoodslytherin": "I'm so sorry this happened to you, I hope he pays for all of the hurt he's caused to so many people. Sending so much love to you. ❤", "ananyahiyer": "I’m so sorry you had to go through this.", "secret_introvert": "I am sorry Trinetra. Sending lots of strength and love your way. This must have been incredibly hard.", "srishtiuppal_": "This breaks my heart. You deserve better. Sending light your way ✨❤", "prisnir": "I am sorry this happened to you. Hugs. This man makes me so angry.", "roshhed": "I'm sorry you had to go through this. I admire you so much for putting this out here and calling him out. And so much respect and love for standing up for yourself and still staying kind and considerate despite what this shit and others throw at you 💕 sending you love and hugs.", "hyperboxofrandomness": "Oh God. There's nothing I can say to make you feel better. But I hope you feel better, stronger and healed. Sending love. 🌻", "thoughtstruck": "Holy fucking hell... Firstly, thank you for sharing this. Further, you have no reason to feel dirty, sis. The dirt is on him. My first time was kinda similar, minus the (huge) experience of being trans. It's never on us. It's on them. I hope you come to see that the fire within is what cleanses us from the disgusting filth they fling at us. Loads of love and power to you. <3", "in.ixes": "Oh my God, Trinetra. I'm so sorry this happened to you. This is horrifying. I can't believe how disrespectful and outright predatory he's been towards so many women. I hope you and the other girls he's hurt can recover from this. Sending you all my love and support. 💜", "skyler_kh": "People disgust me", "snxha_": "Men are vile pieces of turds and I hope every assaulter out there pays for it. You're a very strong woman and I hope you get all the strength & positivity to heal from this.", "theshrinkette": "Jesus I'm so sorry. So much love and support.", "khushboo_7707": "Happens with me every fucking single time.... Though I can't come up with that cause getting love is soo kuch difficult for US!", "heartandsoulpayno": "im so sorry you had to go through this im so disgusted im so so so sorry you're verybrave to put it out and i just wanna say we've all got your back", "_the_shubhster_": "I'm so sorry for what you had to go through! More power to you, love.", "aarohi.exe": "im so sorry 💔 sending u all the love and strength. ur very strong talking about this!", "tbhaveee": "It is very brave of you to put this out on social media. Kudos to you! More power and strength to you 🌟 Take care! Take your time to heal 🌟", "kav_yay": "More power to you ! ❤️", "aaruu._.shee": "Wowww..... i m honestly disgusted by these kinds of ppl..... but kuddos to u and ur bravery ... especially to share ur story ... ur a true inspiration", "kleeee.shay": "It’s really saddening and I cannot tell you that you’ll forget it because it doesn’t happen like that. I really hope that you overcome the pain and sadness and able to study for your finals. Don’t let that bastard ruin the efforts you’ve put in the last 4.5 years to become a doctor. Atoo bhalobasha!❤️", "_whyyshush_": "More and more power to you. Sending you lots of love and hugs. So proud of your courage ❤️", "nandwani.arpit": "From his behaviour, he looks like a pickup artist who doesn't care for anything else other than doing it.", "nishant.mishra007": "😮 don't worry we are here for you and as for this idiot why don't you file a sexual harassment case?", "chaavinist": "im really sorry you had to go through this. thank you for speaking up and for looking out for other women.", "sunraydope": "I'm sorry this happened to you. Thank you for voicing out and sharing it with us.Sending a lot of love and courage to you❤️", "dalmeidaized": "Sending you all my love, babe ♥️", "she.the.evol": "More power❤🙌", "electronherder": "😣", "tameemashraf": "I’m so sorry this happened to you, Trinetra. It’s really brave of you to share this on social media. More power to you. 🙏🏽", "elsa_stm": "Omg I just read about this same sick guy from pooja on twitter this morning! I'm so sorry he did this to you. 😖 Sending love. Tc.", "akash_kallingal": "I don't wanna see you as a victim or eyes👀 of sympathies... You are a 🔥 fire that won't easily fall out.. Just see this as an experience that to know which is bad and which is good for choose... It's not easy to judge anyone on first move.. But now you know it 🔥🔥🔥 and keep that flame high and be others light...", "mishal_bolkeri": "Sending love and power your way!", "pearlparekh": "more power to you, love and support to you, please stay safe and take care ❤️", "shrutithakurr": "I’m so sorry this happened to you. I admire the strength it took for you to speak up. More power to you 💕💯", "pooshyaaa": "I’m sorry that you had to go through this. Sending a lot of love your way. More power to you.", "kritikabhutani26": "Not sure how to trust anyone who shows kindness. Felt this! Get well soon Trinetra. Take your time to heal.😘", "postcardfromapoet": "I am so so sorry you went through this. Sending you lots of love and hugs. I hope you find the strength, love, and support you need.", "prashastishreshtha": "I am so sorry you had to go through this. If you feel this way then surely you must not think that you brought this onto your self, not even for a minute. It's solely your call, but I believe you have valid reasons to report him. Stay strong ❣️", "oldpalaces_newroads": "I just want to say that you are a very strong person. And you are not guilty of anything. One more thing, you are not dirty and u should never feel like one. Given wat has happened you don't have to blame urself. Please say no anytime, whenever the need may arise. Even if you are in between a sexual intercourse. Your soul always know wat is right. If you don't feel good bout how someone treat your body, it's ur right to throw away anyone, kick, punch, slap. And when I say anyone I mean anyone who don't love you the way you do to urself. We can never allow ppl to fucking manipulate us. We are wise, intelligent and brave. Next time u see that person ask him to shove that thank you up into his ass. Period", "ariachoudhry": "This is just unacceptable on so many levels. I am so sorry you had to go through this. Take your time to heal and bounce back braver and wiser. Be the fire that you are.... Be the fire that can light things up and burn things down, if it comes to that. 🔥💯💕", "kishnika": "@amritaketchup", "rojabaiju": "This just broke my heart 😔", "9bad_ass": "You're brave and courageous and you inspire me. Thank you for looking out for others. You're truly brave girl. ❤️ I'm sorry for what you went through. I share your posts with my friends who aren't on ig to spread awareness. Again, this helped and thank you. 😭😭", "tanvi.n.tagra": "what the fuck did i just read! no wonder i hate humans! All the love and strength to you! ❤️ karma will get this dirtbag ten times harder.", "avanteegarde": "@_oojx_ oh my fucking god!!!!!!!", "schrodingers.corpse": "😟", "pavithravenkatagopalan": "I'm so so so sorry for what you went through. Hugs.", "illusion_507": "I'm so sorry dear, I hope you're doing fine 💕", "wont_share_coffee": "@ind0ctrination I just want to give you loads of hugs. Hope you are feeling better. I'm sorry I don't have anything better to offer you than just being truly sorry for what you and the other girls are facing ...", "zimpy": "What an asshole! I am so outraged that these kind of things happen to women out there. It breaks my heart that sometimes men can be pigs and fucking dickheads! Honestly! It takes a lot to share. I admire you for that and sending you lots of love and care okay. You are a fucking diamond amidst the coal. Remember that.", "ahonasaha": "I'm so sorry you had to go through this.", "cosmo_rani": "Sending more power to you and healing", "bhavno": "oh my god, I am so sorry this happened. More power to you for speaking up 💕", "kayceethegoonerette": "This is extremely sad to hear. Cheer up girl! You are way stronger than this ❤️", "_firewhiskey_": "Oh my god. This is so heartbreaking and you are so courageous", "_umashanker_": "Lots of love and hugs to you🤗🤗🤗❤️❤️❤️❤️", "kurtcocaine.ai": "I fucking can't believe this shit omg I am really really sorry about what happened", "thewallflower13": "What is it about Manipal that bothers you??", "isanghansonyeon": "I'm so sorry you had to go through this :(( it's an awful feeling looking back and regretting not seeing the signs. Thank you so much for sharing your pain, hopefully reading this saves someone else from a similar experience.", "frenzied_mind": "I am so very sorrryyyyy this happened to you. This is disgusting! love to youuu❤️", "umlaah": "I am so sorry that this happened to you. I hope you find the strength and the support to get through this truly difficult experience", "apparate_away": "so so sorry. hugs 💝", "adilicia17": "I am really, really sorry this happened to you, I hope you are in a safe place right now, sending you love and care 🌸🌼", "sokneeoh": "I'm so sorry to hear this, Trinetra. You don't deserve this at all. Please take your time off social media if required. Take your time to heal.", "irettaivaal": "@ind0ctrination Trina I'm so so sorry this happened to you. Especially when i know how special and beautiful you are. I'm sure his ass will be handed to you to kick shortly.", "rvndrsingh": "On Twitter, many women have come out against him. He's a creep. Sorry to hear this 🤗😔 here's the link.  https://twitter.com/rasmallaii/status/1227579362121330689?s=21", "achintyaprahlad": "Why should you feel dirty? It's HE who was in the wrong.", "gayatri_roch": "\"Iam not sure how to trust anyone that shows kindness anymore\" m angry and crying reading this..I relate!❤️", "_thrishnaa_": "I’m in awe of your strength, bravery and candour.", "_yosoypreeti_": "Stunned by your strength, much love❤️", "visual.dalia": "Thank you for sharing.", "kanchii_": "You deserve so much better.❤️ More power to you.", "bass.rani": "I only pray that you have strength and grow with positivity from this moment.", "abhyudaybohra": "utterly gross. I'm so sorry. You deserve so much more ❤️", "peeyushchauhan": "I'm so terribly sorry", "sumo_oranges": "Fuck I'm sorry this happened. I'm so angry. And yeah how to trust anyone after shit like this keeps happening", "pranjoli": "I'm so sorry this happened to you! I believe you, and I admire the strength it took for you to speak up. Solidarity and love xx", "siddeshhhhhhhh": ":((", "its_steve_rodgers": "More power to you.❤️", "swagata3.14": "Really proud of how you're holding up. Hope he gets the shit he deserves.", "untaara": "I'm really sorry you had to go through this. I can't believe any of us ever trusted him.", "apurvaaaah": "This is deeply saddening. I'm sorry you had to go through this. We're here for you. We believe you. Stay strong and beautiful. 💕", "irrashinal_": "This is wrong. Plain wrong. I really hope you're doing okay and are able to cope with this", "paabhilash": "No person should ever have to go through this level of dehumanization. Extremely sorry that this had to happen to you and the others, @ind0ctrination :(", "radhika_chander": "This sucks. And what sucks more is how some women stay with men like this for life in marriages, all the while priding themselves on not giving up and getting a divorce.", "neem.k": "I’m so sorry. sending solidarity and love your way, more power to you.", "n.eeshh": "i’m so sorry this happened to u and to the other victims", "choo.who": "Hugs. 💛", "memesaab": "He sickens me. Love and hugs to you. You deserve so much better 😭", "vanita_07": "You are braver than my guts ever could be.more power to you(:", "autumnalways_": "I am sorry about what you had to go through but please don't take guilt on yourself because of \"the worse didn't happen to you\". It's not your fault that he is not a good person or doesn't get consent or the fluidity of it. also Why is this name familiar. This guy famous or something?", "_paganwitch_": "You're brave to put this on social media and expose people like them. Many women just suffer in silence, which is so wrong. Kudos to you. Bhalo theko.", "s.w.a.tii": "fuck. Didn't think it would get worse than yesterday. I'm so sorry this happened to you. Sending you love.", "aysha__shaima": "😞😞", "karunaaaaah": "Experienced similar stuff with a guy who seemed to be too perfect to be true. Only after bad treatment after the incident I understood that what I did that day, his hands did it otherwise. Ladies take it with a pinch of salt. If it’s sweet then it’s gonna kill you some day.", "aahh_poo": "This is probably the most real thing I’ve read today. 😞", "vidya_k": "I am extremely angry and upset that this happened to you!"}