{"__blueberrieee__": "Awed. We are with you. More power to you♥", "_umashanker_": "Well said Trinetra👏👏👏. We have to remember that a woman's character does not lie between her legs!!", "amritaketchup": "fuck you, Julius Pereira ALRIGHT UGH! time to reclaim our spaces and our powers ✊", "sanikapaw_": "thank you for this articulation. more power to you trinetra❤️", "inquilove": "Let us all shatter every single stigma related to sex. Let us destroy \"virginity\" itself so that no woman ever feels bad for not having that \"special\" \"first time\".", "fruitcakerani": "Reading this gave me a sense of peace. Thanks for writing this ♥️", "trishalah_": "More power to you. Love, hugs and healing 💙💙💙", "kemo_saby": "You are amazing ♥️", "arushiaishwarya": "more power and love to you💗", "shreyaachakraborty": "🔥🔥🔥🔥🔥", "radhika_binani": "MORE POWER AND LOVE TO YOU! ❤️", "achintyaprahlad": "The testosterone thing - thank you so much for pointing that out!", "nikita_merlyn": "This is why I love the fact that I follow you❤️ to hear you be vulnerable and outright honest about how terrible you feel, and then how well you process those feelings and rise above it and grow from it. Love the shit out of you❤️ it's like watching a Phoenix burn to ashes, and then rise from it. Ur truly an inspiration 🙌", "zaffar_hq": "🌸🌸🌸", "hotdiabla": "We stand with you 🌷", "ebaearu": "MORE POWER TO YOU💜", "chinmayisripaada\nVerified": "Verified", "thunderbbbird": "Thank you for putting this out 🌸 sending love your way ❣️", "manjush_vasudevan": "Power to u queen, fuck everyone who treats us like we ain't humans but just some dicks/vaginas/holes for gratifyin their lust.", "surabhiipawar": "🙏🏻❤️", "aditi_prakash_00": "THIS. WAS. IS. PUT. INTO WORDS SO BLOODY WELL. 💖", "_raunak192_": "more power to you. stay blessed. We need people like you to stay strong and inspire others and together we can stop Juliuss from taking the world for granted.", "reevan100": "Pls share his photo here so we get to know his face", "darsh_thegumdoc": "It's nice to see people coming in support of a victim instead of shaming her. Proud.", "jananee_iyer": "More power to you❤️", "pare.shaaan": "This is an incredibly brave and admirable statement, and you've come up with a better understanding from this situation than I would have in this short of a ti", "goddamngayatri": "You are not alone! And yes, fuck that shit... More power to you... 💕", "constantneedforchange": "more power, strength and healing to you 👏🏽 can resonate a lot w the realisation that nothing you could’ve done differently would change the outcome bc u weren’t the one in the wrong and yet at times still struggling w the feeling of feeling dirty and disgusting bc of what happened. it comes and goes in waves and it’s hard to shrug off. but ur doing amazing and as is anyone else’s who’s dealt w this or lesser or worse. we are on the right path and those who have to be held accountable will pay 🤞🏼💖", "karthikasiv": "Wonderful train of thought. It is so deeply embedded in our psyche that sex is a zero sum game.", "_the_shubhster_": "I am so proud of you for coming out with your story. It is not easy to be vocal about something like this. Sending you lots of hugs and positivity! More power to you.", "aabshar.shaikh": "More power to you💖", "thecurvedprobe": "Resounding applause 🤗", "ironically_ahsan": "You go girl!"}