{"bev.er.lee": "I feel this in my bones.", "oldpalaces_newroads": "How true. And I have exactly faced the same shit, I m telling u the exact shit from men and I made it a point that I confront each and every men who makes me feel I m trash. Most of the times, according to a few men, we woman has to have worth, so that our modesty can be outraged, our rights be violated in public, your experience reminded me of an incident which happened to me two years back. Where I was starred with nasty gestures for over 20 mins and when I confronted them they told me \"tere me hain kya, jo hum tujhe dekhe\" And when I choose to call the police because he did and spoke every word to malign my character. His mother and other locals supported him by saying that \"tere jaise randy ko nahi bolenge toh kisko bolnge\" And they threatened me by saying \"humare beta police me hain, woh tujhe dekh lega\" Considering the very fact that I m a woman and I m from North East they assumed everything. Thinking of the situation, nobody deserve to be treated this way. Not any woman, a student or a prostitute, or wherever she is from. So you are true, we should never be quite not until it is made known, clear and loud. Not until every ounch of trash is cleaned. I m proud that I have dragged those trash into court. Last but not the least, more power to each and every woman. We shall fight we shall win.", "pokeronn": "I had a similar experience when I was out with my friends. We noticed continuous flash in our direction as if they were clicking our pictures, I asked one of the boys who was clicking Pictures with a camera to show us what all he clicked. He showed us the pictures he clicked and then we asked other boys to show us their phones because we were still doubting on them, what if they deleted Pictures on their camera when they saw us walking or what if they still have pictures on their phone. One of the guys refused and started \"yelling ki are you prostitutes that we'll click your pictures?\" I was like even if we were you have no right to. This boy who was yelling was trying to start a fight and pouncing on me, his friends stopped him and mine took me back.", "komal____bhardwaj": "This is what a lot of us have experienced too and we just ignore this as these shits are pretty normal. People like these do not understand what are they doing and patriarchy rules as always 🙄", "themomflair": "This happens at every corner, every day, every time, everywhere with every girl...and that’s d saddest freakin truth of this country. Need to voice against them, but also the after effects are sadly patriarchal and sickening too 🤯", "whatever4009": "Sorry this happened, but proud that you stood up for yourself, i hope those assholes die in a car accident or get cancer.", "_anonymous_abn": "I am glad you shouted and screamed at them...... it's high time to show them our resistance in the loudest possible scream..... or through any action..... really without ignoring it... yeh chhoti chhoti issue aage chalke hamare country ko world's unsafest country for women in the world banati hai... see sexual harrassment is just not that moment of being uncomfortable...sometime it becomes a nightmare...more like a movie...and you being the actor, not acting but feeling every inch of it.... please guys just let the creeps know we are human enough to understand what they're doing.... we need to show them.., we won't shut our mouth...we won't ignore it...", "finger_guns_bi": "I'm very happy that you created a scene. I do and surround myself with people who do make a scene. It's valuable if only to establish that it was Not Okay.", "calliope_s_lyre_": "I swear, every time I hear this cell phone thing, I really have to wonder if there’s any girl left who hasn’t experienced this yet.", "_swagata09_": "Hats off to you. Had it been me, I would not have known what to do. But yes, I'm proud of you for 'making a scene'. That was much needed. We need to shake them down, not let them gaslight us.", "taniapaulx": "I honestly wouldn't have had the strength to do what you did. All this has become such a normal part of my life now and I've always been told to ignore it. Going to be drawing inspiration from this and standing up for myself next time. More power to you🙌💛", "vmharsh": "Glad that you did not become a silent victim of this. Raising voice and anger at the scene itself is the immediate verdict. It’s a known shame that audience will just smile and look in awe. It’s the victim who has to take matter in hand! The more you raise voice, name and shame such goons the better. They take pride in doing this because of the lawless land.", "keeeeeeerti": "Fuckers!", "roshhed": "I feel you girl. It's just sick. A reality which almost every girl faces in her life at one point or the other. It's disrespectful. It's harassment. Everyone to stand up for the girl when this shit happens. Particularly the men around. To ask the questions with her and stand by her side when you see a girl being harassed, stared and snickered at. I m sorry you had to go through this 💕 love and support to you.", "aryan98.08": "I feel sad that you had to go through this and I don't understand why people judge anyone on the basis of the clothes they wear. I see it many times when I walk with a female companion that generally men have a tendency to judge every girl that walks with a man as they are doing something shameful and I especially hate when they give you those looks as they are scanning you or something when their eyes go from up to down. This really sucks. I hope people could realize this that we live in modern society and the world couldn't be a better place unless we do something. Something as small as not judging anyone can make a big difference and I urge everyone next time if this ever happens to anyone don't be just a stranger stand beside them and speak out against awful act.", "_tanya.sharma_": "I feel like such incidents have become more frequent in manipal recently. I went from finding Manipal a decently safe place in my first year to getting harrassed in broad daylight by entitled men that don't stop looking or following you even after being called out, in my third year. Idk if it's an influx of people from the surrounding areas but I just feel that there's some people in this town that weren't there before and it's almost like their sole purpose in coming here is to harass girls. I'm glad you did what you did in that situation and I'm sorry this had to happen.", "__pyromancer__": "These are just the bottom level objects of patriarchy. Unaware and unchecked. Proud of you for voicing yourself. ❤️", "born_pessimist": "Sad to say that I could show this post to all the women I know and most of them would say they’ve been through the same shit . Mighty proud of you for standing up to them 💙", "kcmn00": "The behavior of Indian men is the worst. Now that I live in another country, the difference is like night and day. A cultural shift needs to happen for change.", "eeshwar1228": "There are people in this world and then there are some creatures that have unlocked the infamous reverse evolution and had become something worse than those called as creatures these things are called as \"dumb monsters\". To evoke common sense in such a thing, one might have to go through an enormous stages of polite talk, education, shouting, etc, if all else fails mental asylum or a jail might work. But if u encounter such a thing beware they might b dangerous as they r extremely stupid.", "yashasvini__": "The main reason that prevents people from using their voice is the fear of provoking them further or making a scene :(", "shefali0303": "I am not even happy or glad to say that this is relatable, so so so relatable but thank god for someone like you voicing it for the whole lot of us!! ❤️", "thehyderabadii": "It's a scary scene. Had a lot of experience of such with my friends. The thing which I can't just absolve is the pride in which those crass men move either into police station or to their destinations after it happened. No form of regret. Had a very similar experience with my friend in a chai shop and after that guy was caught by the police he is questioning the police of not being innocent of the crime but about hearing those women who smoke!", "emma.marie.sf": "We won't take it quietly at all. PS harassments are very bad here in San Francisco. We are being beaten and slurred daily.", "anny.singh_02": "More power to u Trinetra", "lapetitemort18": "Fuck the patriarchy and fuck these arsewipes. More power to you for fighting the good fight. You inspire. 🖤", "nikhhii": "I would like to share something that happened to me....so i was returning back frm clg during a sunny afternoon so i had my dupatta fully wrapped around my face in a way that only my eyes were visible and that day i had worn a long sleeved t shirt which was lose fit ....as i was walking i saw these creppy truck drivers were staring at me and started following me . I was literally scared coz there was not much people around there i walked as fast as possible and also dialed my frnd and wen i reached a shop where there were some people the creeps left .......and still people say that ur clothes provoked us to rape or assault or molest u", "gayatri_roch": "😢girl! Much love to youuu😔", "blackandwhite2610": "You're most definitely not making a scene. I'm proud that you spoke up. Most of us don't even dare enough to speak out.. and that's part of the problem why guys like these get the guts to be such assholes.", "ankita_kathad": "I Have been through this situation a couple of times. The only mantra I follow is to always check their phones even if I have just a .01 percent doubt. Even if they delete the picture in those split seconds that they get by the time, I approach them ans make sure that I have searched their galleries and their recently opened apps. You write our stories so well. Thanks to you.", "idkaditi": "Oh my god what a shame! When safety at your usual “safe” place is threatened! THIS MAKES ME SO ANGRY! FUCK THOSE BASTARDS! FUCK PATRIARCHY! Fucking ASSHOLES! HOW DARE THEY and how DARE THE SECURITY LAUGH OFF! I’m sorry you had to go through this! I’m sorry we all have to go through this EVERYDAY OF OUR LIVES. To a point where it’s now a “normal” part of our lives! THANK YOU FOR STANDING UP TO THEM! THANK YOU FOR MAKING THEM KNOW THAT SOMEONE WILL STAND UP TO THEM IF THEY DO IT AGAIN! More power to you!", "tontangbi": "❤️❤️", "dulllichand": "We love u and youre not alone, youre hope to me and alot , youre stronger than u think 💜", "thecurvedprobe": "Sigh. This is how it feels to be a woman in India.. 😣 always on alert while men laugh at our tense plight", "shwetavaidya17": "Sorry this happened to you Trinetra. This really sucks. But you held your own, and more power to you.", "bookstana": "Brilliant write up for what my body and identity goes through on an everyday basis. And not even that, seeing patriarchy and male privilege play out between two stranger children where the boy gets to hit and annoy the sister while the adults urge him on, that sucks.", "electronherder": "😢😢😢", "shivangi0731": "What motherfuckers", "primadonnaguy": "what the fuck this situation could’ve gotten so much worse than it was and the fact that the security guard was not only inept but FULLY LAUGHING ALONG REALLY DOESNT HELP i’m assuming this was somewhere in/near campus which makes it even worse if that’s not all i’m really sorry you had to go through this, trini. we can’t keep letting situations like this slide and be deemed “harmless” i’m disgusted", "_umashanker_": "Oh my god! I'm glad you yelled and made a scene. I would have too. Stay safe my brave fighter!!🤗🤗🤗❤️❤️❤️❤️❤️", "sumana_kasturi": "I'm sorry you'd to go through this. More power to you.❤️", "_raj.laha_": "Damn annoying😤 freaking swines, I'd give the security guard and the owner an earful too. And yes, fuck them over if they even look at you ever again in the future♥️", "sabrina_ssiv": "I genuinely hope they suffer for what they did.", "lilipillika": "Bastards", "kairavi_patel_": "✔✔✔✔✔✔✔", "finch_and_flowers": "It's disheartening and disturbing to hear and see what's happening around us! Sometimes I feel hopeless and feel like surrendering to this shitty society but simultaneously this disgusting feeling compels me to yell back at the society's crappiness.", "aysha__shaima": "I feel super sorry that you have to deal with things like this... all these really should stop 😞😞😞😞😞", "22_hungrybuns": "Be strong! Real humans will be there for you. ❤️", "divya.desa": "☹️💜💜💜 sending hugs."}