{"tanishamoreorless": "There's no shame in it, you'll be a doctor in the end anyways", "human_ki_lodi": "Sending hugs and love💙🤗", "rithikat_cherukat": "I haven't been able to follow your story throughout as I only recently came across your profile, even so, I'm really glad that you posted this. I have immense respect for you for not giving up your dream despite whatever setbacks come from being in a course that comes with heavy, time-sensitive work. The compassion you have towards yourself and others is what makes me feel that you'll be a genuinely incredible doctor one day. Take care, I hope these six months will really help you rejuvenate! 💕", "wholesome_goofball": "💛🌸", "aparameter": "You go girl!", "un_arth": "💖", "spaceykasey1": "We live in such a white knuckle society even here in North America. Enjoy your break you deserve it.", "simranrij": "😍😍", "rahuldsouza": "Years after my last degree, I regret forcing myself to meet the minimum grade I needed to pass respectfully and just give myself time to come to terms with some stuff and just do an extra semester. Honestly, I wish I took more time in the larger scheme of things. Don’t worry, this isn’t as bad as society conditions us to believe that it is.", "awristhrottle": "❤️🔥💪", "anoushkhap": "❤️❤️", "h2mathew": "This is amazing, especially the last line. We put too much unnecessary pressure on ourselves, as if medschool itself and the path ahead isnt enough.", "_brownotbrown": "6 months does seem huge, it was the same when I had to drop out for a year for my psoriasis treatment. But now that I look back, it healed me, though not completely, it helped me a great deal! So in the long run of life 6 months will seem like nothing... And I bet you will feel much better and will be able toCome back with a clearer mindspace! I wish you all the happiness and peace with blessed healing! ;) @ind0ctrination 💜", "karuna.subbiah": "❤️❤️❤️", "ritikagad": "@ind0ctrination I took 6 months extra because I was so anxious and experiencing similar feelings to what you've described. Looking back I'm really proud I gave myself 6 months to heal and recover mentally, especially because medicine is a long journey. I'm really glad you're taking it in the right spirit. Also, taking the exam late gave me 3 unforgettable months at home, which I would have really missed out on! :)", "mostprobablysinging": "I couldn't take my General Surgery exams in time for the exact same reason. The next 6 months, however, turned out to be my best 6 months in a very long time. I hope you feel the same way when it's all done and dusted. All the best!", "half_sunshine_half_grave": "Much love..❤️ Felt this as someone struggling at academics due to mental health issues...Power and strength to you💜", "achintyaprahlad": "Again, thank you for sharing this!", "shruthi_._._._": "Rest hard and well! You'll come back as a brighter phoenix 😍🔥", "leonardperis": "I had to repeatedly retake classes, because my anxiety was so severe, that it prevented me from attending classes. but I eventually did get my degree. You got this. We believe in all of you!! 💖💖", "zeina_sravya": "You need the rest and the time to heal! And stay rest assured you will rise from your asked just like a phoenix. You are brighter than this and will continue to shine! 💜", "kingnqueen.alwaysnforever": "😍😍😍😍", "poojasinhayadav": "Medical school is best done with pauses. Wishing you love ❤️", "dalmeidaized": "I'm glad you are putting yourself and your mental health first, love. You are amazing and you'll continue to do wonders. I believe in you ♥️", "irettaivaal": "Hit that Pause button hard ♥️ breathe and Just for the fact that you can do this makes you a better human and a doctor", "mee_nak_chee": "I did nothing from March 2019-january 2020. Faced huge deal of pressure from everyone. Dissociated for most part and finally worked on myself. I am finally starting my career after 2 years of randomness when all my peers are at some level of \"success\". We are successful enough to have been self aware.", "shreya.lifecoach": "You are very powerful for taking the time to address your needs. Isn’t that what being a doctor is about anyway - healing! Sending you lots of energy and love. ❤️", "memesaab": "As my mother says, what's six more months in a life of 20something years. I can tell you what they're not: they won't be miserable", "alwaysdsd": "You are the master of your fate, you are the captain of your soul! Keep holding on!", "crazyyash": "@ishaaraa", "suprkam_95": "You're gonna be a talented surgeon one day and the world will look up to you", "anjaliramamurti": "From personal experience, this is this best decision you could have made for yourself. You are going to come out of this a stronger and wiser person. All my best wishes! 💙❤️", "am_archana": "I wish more people would read this. I wish people would understand. This life that is asked of us ain't all smooth. And being medical students what pisses me more would have to be the approach of my peers to the concept of having a \"mental health day\". Vividly remembering the times when peers would come around and say how things could've been worse or how bigger hurdles are yet to come. See, this is the bigger hurdle i was afraid of yesterday. As long as we ignore the dynamic of healthy mind and healthy body ourselves, our medical degrees are just paper scrolls.", "di_a_riya": "You are an amazing and inspiring human being. Never forget that. I love you bb.💕 Take care.", "kl_soundarya": "🙌❤️🤗", "annjoseph1311": "Having had the opportunity to tutor your batch, I remember you as the bright Angad who had questions like no one else in class. You have made me want to get my concepts in check cause you made such a smart crowd of students. I have noticed your absence in my classes and then your re-emergence as an even powerful and vocal personality. I have always hoped the energy that this transition demanded of you shouldn't make you any less of that bright and potential student that you are. In hindsight these 6 months would hardly matter. Give yourself a break, give the preparations your all and then appear for the exams. I know you will excel. More love to you !", "barelyswati": "Mental health first. You'll get there. Take your time : )", "hasbipsyzco": "😍", "aisha.a.mapara": "As an ex medical student I too had to do 6 months extra twice. Once in second yr. Once in internship. Both times it was because I was too exhausted emotionally/ mentally/ depressed to push myself out of the house. And all through it the professors who btw are also doctors found every way to humiliate and ridicule me rather then help me. At that age I wish I had better knowledge/ tools to know better. To know I was justified in taking off even if it reduced my attendance and forced me to stay in that hell hole for a year longer. I am glad you know better and dont blame yourself like I did. Take care.", "akshata.chonkar": "Good on you girl! 6 months more is going to make you a better doctor, and if we’re all puppets of capitalist productivity anyway, then you’d rather be a good doctor than just a doctor. And that means taking some time off to rest. Good luck🌻", "ananyayayaya____": "Mental health is important. Good luck girl.❤️", "tanushree_zehen": "Listen. I don’t know you. And my two cents shouldn’t matter either way. But I’ve been following you for the past few months and you. are. Incredible. Clearing entrance exams and getting into a medical college is ridiculously difficult to begin with. You’re going to take 6 more months to become a Doctor - someone who holds other people’s LIVES in the balance. And you’ve been through So SO much. We can see some of it through your social media posts - but I’m sure SO MUCH MORE that you’ve dealt with personally and EVEN MORE inside your head. So, you do you. Your family and friends need you and completely strangers like me need you to be your happiest self. Keep kicking but you amazing human.", "n.tripathi121": "🧡🧡", "drshiprarai": "6 months is minuscule in the long scheme of things. Take the well needed break and get back at things stronger. Its only in India that we dread not finishing stuff on \"time\". And we end up compromising on things that matter. Wish I knew that when I was in medical school. Anyway enjoy the 6 months off.. ☺", "megh5.mathew": "More power to you @ind0ctrination 🔥. Mental health matters the most and there's NO shame in taking a pause for yourself.❤️", "daddydranks": "You're doing great❤️", "rmk_ro": "I took a year off before joining Architecture school to recover the loss of my grandmother. I was too attached to her, and in her last days it was tough to handle the ill health and as family, taking care of her during her last years. It got to me and was very hard to cope with the loss. I took a year break and then gave my entrance exams, now I look back and I’m proud that I recognised the need to take the break to heal, get better. So no worries. We are proud of you. Its a very hard time of change that you’ve gone through. Like a rebirth. From now on, it’s just 6 months. Time flies. It takes tough people to recognise the need and do what is required and it’s the weak, who succumb. As always, you are AWESOME!! And we love you!!! 🤗🙌❤️", "rahul_chaudhary1011": "take care and all the best for the future ! 🌸🌸🌸", "anubhasawhney": "No biggie. You'll be back, stronger and better. Focus on Trinetra right now. Love..", "eshaangill1d": "You got this queen.❤️", "floofy.eli": "Take care! You're awesome. ✨", "mishalikethatbear": "What is six more months when you consider the larger picture? Mental/physical health is more important than every other thing and I’m proud of you for prioritizing yourself. Too few of us were brought up with the permission to do so.", "sumo_oranges": "It's ok! Ik it sucks coz I wasn't allowed to write a subject in the finals due to low attendance (anxiety and depression meant skippimg so many classes). You'll get through this!", "juyal.shruti": "I think people need to realise that growth and productivity is not only in terms of your marks and how much you have achieved academically. And I feel in your case if you have overcome the stigma attached to marks and percentages and the baseless cut throat competition, then that’s a progress and growth in itself. All the best to you!", "haripriyapasuparthy": "I have been following you for a short period of time..but from what I've seen, I'm impressed..I totally agree that it's ok to take time off to get ready to take that exam..it is often frowned upon, looked upon as something that's an excuse..I went through this too..mbbs and MD.i was going through a lot mentally and felt I was definitely not ready to take my exams and so I took a break...took it one day at a time..faced a lot of backlash from my decision but I stuck through it and did things my way..coz like u said, having a good support system doesn't mean u get better soon, u need to get better at ur own pace which is different for each person..hope you feel better soon!", "pyaa._.ree": "More power to you.", "brobdingnagianass": "@chunweifei Just a reminder that taking a break isn't that bad a thing. Mental health is v imp.❤️❤️", "sabrina_ssiv": "You should be proud of yourself, this is a very difficult thing to go through!", "p_singh_k": "Take a break ! You deserve it 😘😘", "closehan": "trinetra 💛 your honest relationship with yourself is something we can all learn from. taking the time you need is the more responsible decision, and the one that will make you succeed!", "_umashanker_": "Take the break Trinetra. It won't make you any less competent as a surgeon if you earn your degree six months or a year later. The point is, you're going to be an amazing surgeon, one we definitely need. 🤗🤗❤️❤️❤️❤️", "babablyatsheep": "Thank you so much for this post. And you will get through this. 💕", "shamaya_silver": "Also , when I see my doctor colleagues, oe interact with them, or when a patient comes to.us for treatment, this doesnt even matter ❤️❤️.", "omrita.baskar": "You have had a massive year of growth and you should be proud of yourself. You will be a doctor, if that's what you want, a wait of six months is nothing in the long term. There is absolutely NO SHAME in hitting the pause button!! Rooting for you 🎉🍻✨🌈🥰", "__unalome_": "For me the best part here is how the picture and the caption are in congruence 🤗", "spoopema": "Mental health first! 10 years down the line you'll be grateful you took care of yourself more than an exam taken a little later.", "thecurvedprobe": "Couldn't have said it better myself. 😊 6 months is nothing in hindsight. Just keep your eyes on the prize.", "trishalah_": "Been through this! There is no shame. Don't let anyone tell you otherwise. I'm proud of you. You can do this! All the best for your prep!", "mydarlingmay": "💜💜💜", "cattopixz": "im so proud of you for posting this! i took a break year when i joined IIT last year- i eventually dropped out when i realised the place just wasn't for me. im so glad you put yourself first, and i hope things get better. sending much love and hugs to you. 💕💕", "kheeekhee": "sab chill hai.", "_apoorva__": "This read felt like a hug 💛", "the_philotherian": "Wow. I flunk too. N that's okhay. So basically...I too had this anxiety of going to postings, mostly when I missed one day...I was anxious answer about it the next day... So one day leave became a week... Or so. But I also knew my attendance was Important n not having too many CLLLLLOOOOSE frnds in batch meant no proxies either. So one day I prepared myself for aaaalllll the gaali I'll be getting from processors...n trust me I knew they were bad at humiliating, but TO MY SURPRISE, nothing happened. They just asked me how much of my quota is pending n till when do I plan to finish it. N I realized, the posting is FOR ME. so I can learn. N then ... I'd go even on bad DayZ n make them good. Good luck to you. You have that power within. Go. Let them talk. Let them bark. Just go FOR YOURSELF.", "rohinibhattacharjeeee": "❤️", "bweehee": "I see people put up with the notions of productivity, while putting their mental/physical health in jeopardy. I was one of those people till about 6 months ago. Glad you’re taking that much deserved break ❤️ All the best for your preparations (which you sure are going to ace) ❤️", "anirudhzep96": "Been through the same. Had to take a break year just to feel close to normal again. Everything at it's own pace.💜💜", "chandhana_singaravel": "YOU GO GIRL♥️", "anitarane": "😍", "neha.click": "I am Proud of you and you inspire us to put ourselves first. It is liberating to learn that a break is a valid career step. Thank you once again for being you."}