{"theavinashsinghrathore": "For fuck sake stop this bullshit. Act a little responsible when you have such following on social media. Tahir hussain is the guy who has been taken into custody for providing shelter and causing riots. He's been held responsible for murdering IB officer ankit sharma. Stop concluding when you are sitting in the comfort of your own house and posting this. Yes lives have been lost but you are no one to conclude", "rxshrutixr": "SHAME ON YOU FOR SPREADING MANIPULATED INFORMATION", "the_aesthete_mind": "🔥🔥🔥", "dalmatian_1128": "\"Upper caste hindu\" could have been written just as an Indian citizen. @ind0ctrination", "soberdoobie": "😂😂😂😂😂 if this is how you guys get your news I feel sorry for you", "mahendrasinghdeor": "🙏", "dowpaluppal": "GO READ THE NRC AND NOT ONLY THE ‘relevant sections’ and then come back", "anoushkajhaveri": "Why are people acting like it's Hindu Vs Muslim it should be the educated vs the uneducated oof", "yogeshsingh_bd": "Lmao guarding the radicals from one specific community with mask of ' bro Secularism bro'. People like you are the reason that the present society has become so freaking communal. Your selective outrage is the reason Modi, in spite of being a hatemonger will easily win the next election too", "misdelocaliphobia": "The truth in what you speak really reaches out and touches. More power to you and thank you.", "harigasti_teiwa": "Privilege is continuing failed systems after failed systems under the pretext of changing society.", "aaryanabbass": "@iamjustavintagesoul", "bee_honey97": "Stfu dude. You dont know shit.", "oldsoulvaruna": "And you speak about 2002 riots?? If your talking about the Past, then you should also talk about the Exodus of the kashmiri pandits and the Goa Inquisition. Your just being very conveniently biased", "ind0ctrination": "Literally thank you to every brainwashed closeted/unabashed bhakt for proving the exact points this post was intended to make.", "simermal": "You canNOT have an excuse or any kinda explanation for this!. Any kind of violence towards any citizen of the country is not right...its democracy for God's sake", "sana.sanji": "From Muslims around the world, this means a lot. Thank you!", "rohanvora16": "Stop this religious targeting and making it sound like ‘one group’ is to blame, both sections are to blame for the riots. You’re making the issue more polarized than it is... under the guise of promoting solidity. You coward", "ytnico": "The people from the second slide are pretty smart", "alde_57": "\"😭ask your poor mawzlim frands how they do, me upper caste Hindu so sorry\"- fucking nonsense. You blindass bigots only enjoy writing such shit when it gives you some humanitarian display brownie points. Every day several human rights violation, murders, violence is happening. But you hypocrites choose to share this template based sympathy on issues that gain most media attention. You're nothing more than a wreck😊 now suffer in depression", "prajkat": "Anekantawada, if people would just understand the word, and stop posting anything, in support or protest. Keep their beautifully shaped shit to themselves. People in India would have been at peace. It is necessary to have an opinion, but if you keep it to yourself, you give a chance to others to figure it out themselves! You need to understand, you can also be wrong sometimes! You need to believe you are a human who can make mistakes. And every human has a right to their own mistakes. So please dont spread your opinions, keep it to yourself. After you see something on a legal document, and you are against it please move on to the protest stage. Do not ask people to join, let them decide.. as I said. Your view is true for you but not necessarily for all. 'Anekantawada'", "thesnugglingbookaholic": "😢", "akkipatel3": "I didn’t support the riots But indeed Don’t be so biased that you see only one side of the coin According to this post only hindus made it worst and all this is happening because of them But it is not actually like that so don’t only blame them for everything that is happening The one you pointed as victim might not be a victim at all Just don’t be this much polarised", "rajatkumar94": "Stop provoking! You don't know shit what's happening and I don't either . I have not problem admitting that I am not fully informed but you are, you are fully informed from your information you get through posts like this lol.", "being_meher": "Fuck you.. wht the hell were u doing taking photos instead of saving or trying to do something else 🤔", "pessimistbitch": "@___manshukshyp________ read this", "ruchigidwani": "💜💜", "vidhya_shankar2612": "Btw, violence was started by the idiots protesting against CAA", "anirudhsingh_": "@ind0ctrination Ohh you remember what Kapil Mishra or Anurag thakur said but where were you when Waris Patan publicly issued a threat, ppl who defended Sharjeel Imam’s INFLAMMATORY & SEDITIOUS speech as FOS, ppl who have been enabling riots across India thru their inflammatory tweets, r now blaming Kapil Mishra for escalated violence in Delhi. #heightsofhypocrisy", "aryan_raj.7": "A drilling machine was drilled in skull of 19 yr old Guy named Vikas. A guy was killed because there was Jai Shri Ram sticker on his bike. An Upper Caste IB officer and 3 other people were killed and their body thrown in Drain. Houses, shops of many hindus were burnt. You must be wondering why I am only talking about news where Hindus are Victims. Because, Aap jaise logo se hi sikha hai. You guys are vile. You force others to stoop down to your level. You always paint Hindus as aggressors and Muslims as victims. Jab back in December, Delhi and UP mei Muslim mobs clashed with police, burnt public properties, tab to Hindutva mob nahi thi road pe. To fir tab kyu aatank macha rahe the.", "natu.pranav": "You are fucking mob leacher . Don't you se how police and constable suffer who just want peace . I don't hate Muslims but if you fight for a baseless cause the it will give a hard recoil .", "neharamneekkapoor": "Thank you for this", "ajitesh_harshit": "Where were liberals like you in 1990s, when Kashmiri Pandits were thrown out of their land, during Gujarat riot of 2002 and during Sikh massacre of 1984. Fucking hypocrites...oh sorry seculars ..", "vedblr": "I shouldn't be concerned because I'm a \"Hindu\" or because I'm \"upper caste\" but because I'm a citizen first.", "arunimajoshua": "💜💜", "szafar87": "Thank you", "hotchocolateandcroissant": "@ifly_shourya", "risheeraj_s": "I know 75% of the people sharing this post don't know shit about fascism", "behadawkward": "@kartikkdhingra", "krishzaverikz": "Both Hindus and Muslims have been killed , people like you just promote more communal hate on social media , i have family in delhi and even they are scared . Do not spread hate on social media .", "bohemian_soul_25": "@kshitgod", "ggingerlemon": "@aparnarao423", "bonvoyagesadie": "❤️✊🏽✊🏽", "lesage_sooraj": "Hey. This is quite a valuable post. I'm kinda posting this to my status. If not cool let me know and I'll scrub it. Thanks. 🍻🍻", "ameyguptaa": "Thank you for this beautiful post and wording out the feelings for us. ❤️❤️", "pooohmygawrd": "The grass is always greener on the other side. Nobody really cares about anything happening in the political scenario unless it directly affects them. So I suggest you to stop with this hypocrisy.", "heckinhey": "💔", "being_aysh": "Thank you for this. Many of my friends are also struggling with this. This will make things easier for them", "themomflair": "It’s a shame, Thankyou for this!Sharing it", "_ibin_": "@archu.kins", "pavithravenkat__": "Do you have the permission to share the picture of the man in the first slide like that? Privilege is when you participate in trauma porn.", "jahnvikumar": "@jyotikumar27", "abhishek97yadav": "what about waris pathan ? sharjeel imam ? where they asking for peace ? 15 crore bhari pdhenge 100 crore ! waah re bhai ghr pr phone kr k bolde ki papa cool bn gya m post kr k ! what about head constable martyred ! 19 saal k ldke k sar m drill daal di inn logo ne bhai kya baat kr rha h tu chutiya si !", "malvikaas": "Thank you for this💜💜💜💜", "arshi.ihsra": "@ind0ctrination trinetra 🙌🏻🙌🏻🤗🤗🙌🏻🙌🏻🙌🏻♥️", "artbysylph": "😲", "prernas_reflections": "May I take screenshots of this post and share on Facebook?", "tontangbi": "Thank you for this. Many of my hindu freinds laugh at me for being so anguished, that everything is alright, that it's all in social media, that I should remain neutral. But long back I decided, for my own mental peace that neutrality is not a choice I should make. I have picked a side now.", "arpita_0701": "This. Least the privileged can do is understand the matter at hand and reason and amplify. Call out what it is. This thread is important.", "akshinwirathu": "You need to chill. Nothing is happening", "emp_lone_wolf": "All the his involved in violence must be punished. Fools started protest without reading what it was... Fools opposed people who protested. Fools followed politicians. Innocents dead.", "imperfect_queertrans_therapist": "Copying this. 😁", "shasvathi": "Extremely well written. THANK YOU!", "kaushiki95": "Very well written can I share this.", "drake.george12": "Bold and necessary :)", "_shivangipandey": "❤️", "h_i_s_h": "Well explained. THANK you.. 🙂", "jackfcuk69": "I couldnt care less,they are killing people. cause v are \"protesting\" ,while hes killing people ,just get him out already ,protesting india is like crying,we are crying like ,\"noo we dont like this rule\",and PEOPLE with revolvers killing people like its nothing,what v should ev done is IMPEACHMENT", "kidrauhl.forever.26": "Thanks for wording this out. ♥️", "ek_garam_chai_ki_piali": "💯💯💯", "ivvin85": "Thank you...🙏 You say it so well... Every word... With such honesty...", "priyankaketkar": "This is brilliant. Thank you for writing in such a simple, yet effective manner.", "urvi_8589": "@jiya_pvt7", "hima_cicilia": "Thank you for writing this. ❤", "theorythirsty": "♥️♥️"}