{"brownbutter1": "You are a woman in every sense of the word and you deserve to be. Fuck the disbelievers, you are a woman. With or without makeup, with or without the hair or the clothes or the curves, you look like a woman. Because you are a woman. Period. ❤️❤️❤️", "jennyscradle": "I thank my friend @aarsi_02 for introducing me to you. You really are a role model. @ind0ctrination thank you for validating what I feel about transitioning. I used to be so open to the world. I used to almost walk with a tag in my forehead that says \"trans\" to make sure everyone know. But i noticed, it made my dysphoria even worse. Because then a lot of people would ask me questions I am not okay to discuss.. . Like genitals and stuff, and people then starts claiming I am distinguishable. See I grew up hating myself, my body, my life. I was suicidal. I didn't care about my own life because I thought I didn't deserve to live. But transition gave me new hopes and dreams. It made me felt right to be alive. Although I am still living with anxiety and depression, now I have the drive to fight to live. You're right, we all have the right to be visible and invisible in the unsafe world and we can always switch between those. I chose to be invisible to people I don't know and be visible to people I care about. People I feel safe with. 🙏", "pervaldezsassmania": "Someone who confidently says they would identify you as trans is speaking through their bias of already knowing who you are. Considering Cis women get misgendered or bullied all the time because they don't look \"feminine\" enough simply because feminity is such an arbitrary standard that changes from the perspective of person to person, I think this applies just as much to trans people as well. This probably won't help a lot with dysphoria, but maybe it will help filter out less than helpful comments from people around you. All strength to you. PS: you look beautiful everyday.", "medhawi_kriti": "Those who tell you this are idiots and you have been my woman-crush since the first time I chanced upon your account! You are so damn beautiful, inside and outside❤️", "whatever4009": "I don't think in your case it's that easy, you just look like a tall girl. I think your friend said that because he knows you, for a stranger it would be very difficult. You are an inspiration to many.", "being_aysh": "Where can they get a fresh pair of eyes? It's their outdated ultra-feminine standards that are messed up.", "harshkeduuu": "❤️❤️❤️❤️❤️", "twadledee": "🙌🙌💖", "ruhanika_aggarwal": "Expressing love Or appreciation is the trait of a true gentleman. Hope u meet a true gentleman someday. Trust me... They don't judge. And for the ones you have had met so far.... Well...... Hah😅", "tanushree_zehen": "“People will know” ka kya matlab hai?? They SHOULD. You’re owning who you are. Maybe some day in the future SO many people will be able to do that (because of lesser toxicity from OTHER people) and you’ll be just another normal. Man. You. Are. Amazing. Keep at it. Uff. My heart. 😅", "theofficialniharikaramesh": "Nice one Angad, now please shut up", "chibisubaru": "❤️❤️❤️❤️❤️", "shireenstagramz": "😍", "gulshan_chauhan": "First of all...I could not figure it out..until I read. But anyway you don't need to blend in. Huh. U look amazing. Also, fuck those who tell you otherwise. More power to you.", "singhsmriti15": "I barely knew there are people as strong as I just saw... I believe only now that they do.", "rockdemonxx": "You are beautiful", "sukhsamruddhi": "So sooooo beautiful.", "nagarabhishek": "You were not born to blend, but to sparkle 🌟", "naini.ka": "Just wanna put it out there, you're one of the prettiest girl I've ever seen 🥺💓😍🤗 just tell me how 🥺", "rainbow_girrl": "Hey you beautiful hoooman. Glad to have you here on planet earth and showing courage and inspiring me everyday 🌈🌈🌈", "srishti_21_arora": "Oh my god you’re beautiful! 🙃🙃", "theunidealwoman": "You've very nicely put a very complex internal conflict, that which is beyond the binaries or extremes. This is usually hard to articulate but I could feel you 🙌", "_korobiii_": "❤️❤️", "albedo.dust": "Tri, please reconsider the closeness of that friend. That remark is something that can never be contextualized into okayness :/", "suchetana_bauri": "You're such a diva. ❤️", "satvik___": "More Power To You.❤️❤️❤️❤️❤️❤️❤️", "_anecdotes___": "Hey, I want to connect with you for one of my projects. How can I contact you ? Will be really glad and thankful if you reply. Thankyou. Regards.", "ariachoudhry": "You're beautiful. 💖 These boys ain't shit.", "calmie.the.mami": "This is entirely people's perception bs. I know that once you lose transphobia, it is NOT there. At all. Whether someone has transitioned or not, you start seeing them as them and nothing else. There isn't something like being more woman or man fr. I don't know if you're following but Alok Menon been recently sharing some eye opening stuff abt how gender perceptions formed through history. This feeling self doubt doesn't belong ❤️", "dauntless_aman_s": "❤️", "ratyadityagram": "Standing with 5 cis women and someone still being able to distinguish. I don't think it's about outer appearances ultimately. People who actually care about the humanity in you, see what you're inside by looking deeply into your eyes. I think it's beautiful who you are now. You're softer. You're more you on the outside now. Transitioning I feel has helped your mind align with where your heart is with the aide of your body. You are beautiful and strong. Any human being offering and seeking love would see that in an instant and totally fall for you. You be you Tri. You're the best version of you that only you can be. ❤️🌸🌸 Lots of love - A star eyed gender fluid human.", "shamini1995": "Love to you.", "anny.singh_02": "\"Every individual has the right to be as visible/invisible as they please in this unsafe world\" And everything u said after that... I hope u keep coming back to this part cuz even tho they're ur own words, u might forget them in the future in ur times of doubt.... More strength to u 💪💪❤️", "tanushi_bansal": "as someone who prefers to be invisible in every situation, wanting to be visible or invisible is about your comfort, and no one should get to comment on it (i think)", "anushhkanair": "You are BEAUTIFUL girll don’t let anyone make you feel you’re not . So much power and love to you 💕💕💕", "ashmeetsachdev": "Beaut", "thanvishareddy": "More power to you and Massive respect. Hugs", "devyani_agrawal": "More power to you! And u look beautiful @ind0ctrination", "amrisha_rai": "Trucks full of love to you❤️", "jaybees_world": "Here's to a better, judgement free world.🥂", "akshata.chonkar": "Your thoughts are so powerful, I hope you find as much courage for yourself as you inspire in others everyday! <3", "hammylove_x": "At least😍😍😍😍💯💯💯.", "nayrafem9": "❤️😍😍😍😍", "thewallflower13": "So what if you'd still look different than other cis woman. The fact remains that you aren't a cis woman, then why must you be expected to look like one?? Wouldn't trying to look like an ideal cis woman be just another dysphoria you will feel shackled within?? And i say an ideal cis woman because there are cis woman who look remarkably androgynous without being trans. We as a society should work towards normalising trans women and being comfortable with them rather than expecting trans women to look and behave like cis women. You're a beautiful and elegant woman. Also this feeling of not being enough is an issue that most humans face in many different ways, although I will agree that the sad reality is that some battles are more understood than the others....", "panditaradhikaa": "🥺🖤", "properlypurple": "😭😭😭😭💜💜💜💜💜 I don't really have many words to say, but this is all super relatable.", "irettaivaal": "Manly*", "idooontknowwwww": "you would stand different because you are, you are unique♥️", "thats.what.c.said_": "You're really powerful for being who you are. Such an inspiration. A lot of love. 💛🌻", "madrashe": "Hey there. I'm an absolute stranger, I know. But let me tell you this. You are one of the most beautiful women I've ever come across. Trans or cis aside. You had the courage to choose to be yourself and that is pure inspiration to all of us here. Those who can't understand the courage or be able to muster up the basic strength it takes to accept the unknown will always find ways to criticize and bully it down. Doesn't make what you chose anything short of being a Queen. Remember. It is not your job to open their eyes. They are not your circus, not your monkeys. Not unless they have the basic courtesy to at least listen to you sans any judgement. None of these unknown unimportant people matter. You matter. You are the sun and the moon and the universe. Hugs. Power to you woman. (PS. Boobs and hair don't make a woman. Even if she were bald and flat chested, your mom will still be a woman right? You are a woman cos you choose to be one. And that is as legit as it gets.)", "get.lost_withme": "You are an INSPIRATION girl 😊 I'm your admirer ❤️❤️❤️ more power to you... Much Love 😘", "the_bongshell": "You embody strength. I learn from you everytime. ❤️", "un_arth": "💖💖💖💖", "notanoosha": "I love you with all my heart", "dikshabijlani": "❤️ So much love & pride for you, my queen", "huesonmycanvas": "I know I am no one to tell you anything, you know way better. But I just wanna tell you that you are one freaking gorgeous woman and you light up my feed everytime you post. I have never found so much inspiration in any being on Instagram before. You have become everything that you chose to be. And a guy on tinder who knows no shit has no right to tell you who you are. More power to you. I am not good with words and unsure if I could express what I feel for you but I love you. Keep shining! 🥺🥺❤️❤️❤️❤️❤️", "sowwieeeee": "You're very beautiful. 😍", "this_is_bhavini": "I LOVE YOU SO MUCH", "krantikarikutta": "More power to you ❤️", "thesilentreader": "You are so damn beautiful💛 It may not help you but it's a reminder all of us could use :)", "nirumaaa": "🥺🥺❤️❤️❤️", "_umashanker_": "Hugs to you Trinetra 🤗🤗🤗♥️♥️♥️", "_vaichuz_": "More love to you! 😍😍😍💞", "phoenix_bhavya": "Tri u are such an inspiration..dont let others words judges you. You go girl❤️", "shivanitaaa": "I hope you don't call that guy friend \"close\" anymore. Close friends don't point out your insecurities. What can we possibly expect from strangers if our close ones do that to us?"}