{"christie.maria91": "❣️❣️❣️❣️", "an_apocalypse": "I am so proud of the fact that I know you and get to read your posts here. More power to you woman. Grow grow and save lives soonest you! 💜💜", "ris.hi__": "👏👏", "neha.click": "So Proud of you! More power to you, God bless you for the good work you are going to do as a Doctor😊", "booboothefool16": "💞💞💞", "illusion_507": "More love n more power to you💕🔥", "thoughtstruck": "Brought tears to my eyes. Thanks for sharing this. ❤️", "doveye12": "Been following your insta page for a few months and I'm very proud of you. Keep up the amazing work, Doc! You were, are and always be fabulous. Shine away!", "ishitaananya": "❤️❤️❤️", "noirmypinot": "Thanks for writing this, Trinetra. I'm sure you're a brilliant doctor 🌼❤. I relate to this on so many levels as a therapist in training who also lives with psychosocial disability. I'm sitting my ass back to study now❤️😭😭", "raj.geriya": "Absolutely amazing 🙌, what would you say about the notion doctors have been taught to be emotionally detached from patients ? I think its unhealthy for their own mental health...", "shrugarwal": "Surgery is such an exciting profession!! I wish I knew that before I chose mine. Maybe in the next lifetime ♥️", "theunofficialniharikaramesh": "Nice work Angad", "ashwinibhusari_": "❤️❤️❤️", "__rudracasm_": "❤", "motoriousman": "Damn... 💯 rockstar!", "nancygoesfancy": "❤️", "d1o1n1a_": "Your beautiful💟", "dudani.k": "You’re beautiful and amazing! 🔥", "ig_vicky_offi": "🔥🔥", "bharath_harish_kuruba": "@ind0ctrination keep inspiring people , good luck ☺️", "sakshisin.gh": "You Are incredibly admirable!", "shwerlock": "♥️", "mae.heck": "hang in there, trinetra! you give us hope. we love you.", "aakritijoanna": "You’re doing big amazing great things and I’m so proud ❤️", "xo_darshii_ox": "you're amazing. and this sounds scary. everything will be alright.", "notyoaverageindianjoe": "More power to you :)", "_umashanker_": "You better get back to it darling. I'm banking on you to save my life some day!🤗🤗🤗", "rk_me125": "Love this. Life of a undergrad medico indeed! Learning every single day", "ankushpdas": "❤️", "peek2mykitchen": "I always think of you while watching Grey's anatomy.... Only difference is you save real lives❤️❤️❤️❤️", "seek_elysium": "So proud of you doc!", "titasbhattacharyya_": "You're incredibly strong❤️", "sowmya_srikrishnan_mrs.k": "I'm so glad that there will be great doctors like you in the future...😍"}