{"suprava_1": "আরো সুন্দরী হয়ো ওঠো। 😍 Proud of you 😍", "__an.and__": "You are beautiful ❤️", "chaavinist": "thank you for writing this♥️", "calliope_s_lyre_": "Once you well and truly fall in love with yourself, the love others deny you stops mattering as much. I hope you find reasons to love yourself more with every day.", "lostlove.e": "Ur beautifull", "jayant_eternal1": "Complete respect miss 👍", "miss_waffel_": "Stay positive alwys beauty is a state of mind not about the body !!❤️❤️ 🙌", "kevin__joshua": "Beautiful 🌸🌸💜. You never seize to amaze me dear.... More strength to you🙌 \" A beautiful women is one with a beautiful heart\" and you possess one❤️", "lightermachis": "feeling called out at doing squats excessively hoping for a better, more \"feminine\" frame.", "human_ki_lodi": "Hugs and love🤗💙", "kingnqueen.alwaysnforever": "😍😍😍Goddess 😍😍😍", "positivemindsays": "I love my head hairs they grow so fast but due to so called society people I cut every 2 month.... I love my upper body... But not hairs on the other parts of body.... They lower my confidence.. U r really blessed..", "kanaya_bhattacharya": "Ei it's okay to gain weight/lose weight. Right now we just have to get through this pandemic. Just reassuring you, that you look beautiful. And fat/skinny fat/malnourished etc everyone gives labels without thinking of the repercussion it has. But pls try not to let that get to you. It's hard. But we should not believe in labels like that, nor should we entertain people who do. Be it family or friends. Body fat and weight, are scientific terms which are just factual and people/society has found a way to make it degrading. And again, tui khub shundor.", "vishnu_wnderlust": "👍👍👍👍 Sup", "revmxgrae": "You're so inspiring. As someone who's nonbinary, I can't always fully relate, but I still relate, if that makes sense. I'm so glad you're making progress, and recognizing it.💪💜❤️😍💖", "moonchild1985": "This has a special space in butch wolf whistles! ❤️", "paintthatwallred": "What even are you insecure about ?. Look at you", "sapphic.in": "Ma'am you're beautiful js 💞🏳️‍🌈", "unicornsandglitterpoop": "More power to you❤️", "maazisofficial": "Ewww trans🦄😂🦄🦄", "abhiramkurup007": "Every person is beautiful it's just that simple u are just an awesome person and keep being an amazing inspiration for others ❤️ God bless u 🔥🔥", "subinsebastian44": "🔥🔥", "officialthelearner": "I love that type of girls who have guts to post this type of PIC ❤️❤️", "shubhomoyguha": "🔥🔥🔥🔥❤❤❤❤", "iamalsoakshaysingh": "you are amazing, and you are all of us. it is comforting to see that you can say your voice without hating on the larger (not so kind) world. thank you.", "raidentail": "😍😍❤️", "thelovemess": "Beautiful 🌸❣️", "roco_hunter_": "you are geting more 🔥🔥🔥❤️❤️❤️❤️", "samesexldr": "Royal curves 👑", "janvikamyjourney": "Going through the same. I am anorexic", "veer52520": "In lock down you gain weight ❤️", "ishaanbhardwaj": "I know I feel so weird with body hair, I do everything to get rid of it!", "sdkuril143": "🔥🔥🔥🔥", "un_arth": "🖤🖤🖤🖤🖤", "plays.jason": "🤤", "vania__dsilva": "chacka", "pavemented\nVerified": "Verified", "8366rahul": "😂😂😂😂😂😂🔥🔥🔥🔥", "aravindx25": "Thanks for being real😊💕 You hav come a long way and im happy for you that you are winning some (even when u lose some) but you never give up.That is something admirable and more power to you.\" Insecurities remain but they are work in progress\" i loved this line", "anoobhu": "I've developed some new issues over lockdown too. I really pick up strength from people like you.", "stephenmyers103": "You are a proud and strong woman!", "karwana_e_faiz": "Those words are powerful. You're an amazing human. My favourite lady. Love. 💜", "asquare89": "💯🔥💯🔥 More Power To You 💯🔥💯🔥", "wherearethetuurtles": "So so proud of you. 💘", "tanshu679": "@ind0ctrination as i always said to you that you are Goddess 🔥❤️", "_urban.bloggerwala": "It feels though👙🔥🔥❤️", "tanvi.s0036": "Me I get so much dysphoria I hate hair on my body I like to keep my body clean but my parents really are against it idk they just think about society too much , but anyway I recently am really trying hard to love myself as im , my hair on top I want to grow them long but my parents they just keep bugging everyday sayin cut it cut cut it !!! ,, But the most hurtful thing was they dont want me to be myself they want me to live a lie forever they told me to my face and it really hurts to see they're trying everything to find solution , cure or whatever , tho nothing is working and now they want to get me sperm count increasing operation they think it will make me fine I dont even want to use my dick damn it", "dipsoftartarus": "Thank you for writing this smartly. I find so many people talk about how ugly being fat makes them. It's really hurtful to see other people in pain about their bodies and humiliate the fat body type in the process. When pointed out, they only feel targeted and don't realize how internalized the fat phobia is. Thank you for giving fat bodies the recognition they deserve. Favorite thing on the internet today. As for the rest of the caption- more power to you. ♥️", "_m.e.l.i.s.s.a.a.a.a.a_": "Yes. Yes. Yes.", "photo_phactory_303": "Yess.. May be I know how does going through this feels❤️", "rosemathew_996": "You look beautiful, love ❤️", "sushmitaroy.15": "This is so beautiful ❤️", "_hue_avenue_": "More power and love to you! 🙌🏻❤️"}