{"ponnu_ima": "Thank you for writing this 💜", "a_fancy_name_": "I don't know if I can relate to this, but this is sick. Hope you are doing fine and all the people here who have been through the same, More power to you guys 💙", "gayatri_roch": "You❤️ thankyou girl", "me_medusa": "People who relate to this follow accounts like @salty.biitch and @sheratesdogs. This is a very clear example of playing the victim, so annoying. ( also it's annoying to hear one hasn't earned their body? Wtf does that even mean, what have others done to earn what they have?)", "sakthi_kr": "@aswathi_kv", "beeeeeseeeeek": "Don’t know if people would agree, but even as a guy this resonated really well. Even after it’s been years since it ended, the constant manipulation to provide emotional and mental support and the fact that I made myself believe time and again that she needed me since she doesn’t have anyone who understands her like I do(also because she said so) therefore I was under the obligation to be there for her, untill I decided not to be anymore.", "pare.shaaan": "A relatively minor thing but the \"Oh shut up\" on the 3rd slide chills me because his obliviousness facade slips when you get right to the issue and he's a flash of fury", "flaww.x": "I really appreciate this", "gaysifamily\nVerified": "Verified", "_debparnaaa_": "Tell you something you're insecure abput and then say \"I got so angry they said that\" like wtf? Do you think we're still dumb enough to play that game. You CANNOT expect me to worship you for putting out the fire you caused.", "ngcd04_fa07": "Happens with men too😕", "weirdobong": "It breaks my heart to see so many of us have been through a toxic relationship. I am glad you are aware of these now and it's okay that your older self wasn't aware about it. I thank my toxic relationship which made me more aware about myself and how I react to these situations. It's really a confusing state to be in when u feel guilty about their bad state of mind which wasn't even because of you. It's not in our control what they perceive. Thank you for sharing something this personal so that people who are in a toxic relationship realise before things get worse. Also one doesn't have to try explaining them how they are toxic because they are in denial and it's not our job to teach them. They will learn through their experience. This doesn't mean we should not stand-up for ourself. You should call their toxicity out for your sense of mental peace as it stays in one's head why didn't I say this to him. I am still healing and sending all a truck load of healing energies.", "divyangmokariyaa": "This is so brave of you!", "triplensation": "I love Professor Jordan Peterson. He’ll help you dealing with your emotions. this hate is gone too far.", "adityaarpitha": "This is GREAT! I hope more people start doing this. Share proper examples of how gaslighting happens, how negging happens, make it widespread knowledge so that no one can use it without being called out immediately.", "new_girl_vibes": "Shit this is so so so familiar.", "sarksour": "Came across this post and it reminded me of my experience with an abusive ex bf. He used to blackmail me, stalk me, slut shame me to my classmates, and the worst part is none of his friends, including his female friends, tried to stop him. Most of them silently observed and stopped talking to me altogether, while the rest participated in this pathetic charade of abusing me, they used call me and text me and abuse me, until I threatened to call the police and report them. I spent an entire year in college alone, started suffering from anxiety and depression, stopped going to college to avoid these people, my ex threatened me that if I don’t take him back he will continue making my life miserable. Best part is I kept my head high and never once went back to him. Still waiting for their apologies.", "kritiesharda": "I am so happy you mentioned gaslighting. People don't know much about narcissists abuse. Imma cry rn. Thank you for posting this", "you.can.call.me.queen.b": "Thank you. 🙌", "rajatangri": "This made me block an ex of mine who was chasing me like anything. Telling me she loves me so much and still cares for me and want to be with me. I mean such a toxic loser she is! Thanks ya", "chitraangadaa": "Bro. This is my last relationship summed up. Just that it happened outside a chat box and in reality", "ritts_97": "@greyimpress_97 I RELATE TO THIS ON ANOTHER LEVEL!!!! Just look at the texts!! This is the exact thing that I had faced, just the circumstances were different. This is why I broke up... I was tired of putting up with his bullshit. There's a limit to how much I can forgive. He kept on making the same mistakes after HOURS of me explaining why what he's doing is detrimental to my mental health and he would repeat it again and again and AGAIN!! I'm sure you can relate to this too", "dish_kyaow": "Thanks a lot for sharing this. I know how far manipulation can go, it makes you doubt your own self and that is absolutely terrible. Men often say things one wouldn't believe could come out from the mouth of a human adult. And it is disgusting how a toxic person's skewed logic has the capacity to break you. It is disgusting to even know that humans are capable of being this way. We have to keep telling ourselves 'The fucked up perception of a toxic loser cannot define us'. It's sad that we even get to a position to doubt us. But I hope we get to know better, I hope we women/non cis-het men overcome this and hope these jerks do not have any power over us. They won't. Thanks again, for sharing this. Helped us in finding some strength.", "vaish05": "Really support you in this gal", "an.k.i.t.a_": "@annasination check this out.", "agnessamuel1": "@bees.knees8", "senpuja13": "I know a friend who was in this kind of toxic relationship. I have seen her struggling, she had to go through so much. It exhausted her so much, and she could not do anything about it cause she was once in relationship with that man. Good that you posted! 💞", "rikrivu": "I’ve been there. Seen that. To say the least I’m happy I’m out of that space.", "missmimizan": "I'm so sorry you had to deal with this... You're so strong and brave for coming out of it. Also sharing it! 💗 @ind0ctrination", "scriptedartist": "THANK YOU FOR CALLING THIS OUT", "priyyaa71": "Been there! Never knew it was this common! You did the right thing. It takes a lot to share all this More power to you! 💯💙", "kjlshrm": "😂can I send some of mine over too?", "cwazyfrank1905": "Sometimes people close to you, non romantic partners, platonic relationships even, I and so many women I know have had to go through this awful back and forth, these taunts, fanning the flames and then blaming you for the fire. Making themselves out to be the innocent bystander, caught in the crossfire of the whole thing. Of a woman who is 'always so mad', 'over sensitive', 'dramatizes everything', and so much more offensive bullcrap I won't even write down here. How is it that men think they are entitled to being heard when they're 'hurt', change the intentionality of their choices that led to their fuck ups and thereby never take responsibility for A THING? They think they're entitled to our time and our effort in 'hearing them out' even when we've very clearly cut them off, and shamed and attacked for saying \"No.\" For prioritizing our sanity from their toxicity, for keeping the boundaries we've set for ourselves, for maintaining the END of a relationship. And if women were to text a man as much as these men have texted us, in even a remotely similar fashion, we're called clingy or needy or psychotic. And even if this isn't all men, it's too many to ignore.", "kunalpls": "SO MANIPULATIVE!!!! Omg this is so gross", "neerjaaaaaaaaaa": "Okay it is true, like fuckin true ... I mean someone tried blackmailing me after breakup, mentally tourchered and later that douchebag wanted a clouser and wanted to get back again.", "anushhkanair": "Do proud of you for putting this out there . A lot of women deal with this but fail to realise that they are being emotionally manipulated and even if they do realise , they hold on to the relationship and fail to end things . This is something that’s not been spoken about as often as it should be , thanks for being brave enough to talk about it . I’m so sorry that you had to to go through this , so much more power to you girl 💕💕", "moonchild1985": "I'm so sorry you had to go through this. So many of us put up with a lot of bullshit but seeing texts like this makes one realize that one doesn't have to! More power to you for calling out toxicity.", "thesethu": "Is it that guy that we know or is it the other guy?", "borges.andre\nVerified": "Verified", "dead_sike": "Relatable", "miss_boulevardier": "These texts made me realise that an ex I had been trying to break off with, battling so much guilt over ruining his life, was nothing but a manipulative asshole. Thank you for sharing something his personal. Almost every sentence triggered something huge. As someone still dealing with C-PTSD, Reading all these without a racing heart was impossible, but this helped in cleansing some buried emotions. Mind if I keep a copy of this post with myself to go through it every now and then?", "draconiste": "I've dealt with being gaslighted so much, it was awful. It's really affected my self image and self worth, years down the line. I'm happy to see you're at a point where you can reject it completely. Power to you 💜 💜", "therealsomdutta": "I got out of a long toxic relationship with someone who did exactly this. Played me on and make me feel small to feel good about himself. Exact same narrative. Wow! Reading your msgs were like reliving those moments again ❤️❤️😘", "shivanivani_": "Omg the whole \"I'm so broken without you, you're the only person who can fix things, I'm an asshole but I need your help and your help only\" shtick is soooo recognisable. I'm sorry you had to go through all that and more ❤️ I hope you don't blame yourself for not seeing this before though, you were only being a good person and trusting and showing care for a person you had feelings for 🌸 take care and stay safe ✨", "theakshitaaurora": "This completely sounded like my ex. I’m so sorry to hear that. :/", "irishavsingh": "Nothing can me more appropriate 😭😭😭😭😭😭", "keeeeeeerti": "I'm glad you dropped his ass sis. Don't let anyone make you feel that you're obligated to do something for them", "drag_hiba": "I know it happens 😭🤨 be happy like you dont carry his shit along and he will really understand how positively you live your life 💗", "sowmya9230": "Sooo toxic... I'm so happy you were so strong! 😘😘😘😘", "bombaychuddies": "What drivel 🤮", "aditiiagarwal": "Hitting right in the heart! I'm unable to even read all of them.", "tambrahmpostergirl": "The scariest part is, when you're vulnerable, you might get drawn into this roller coaster ride. And spend another few months being thoroughly abused by the douche. Man, do they play their cards like sociopathic pros. We need to talk about this, so the young and the vulnerable know. It still won't stop the mistakes they need to make to grow. But it might save them a lot of relapses and pain.", "vidya_k": "What kind of a sports is this? Assholery!", "a.s.m.a.q": "Thanks for putting this out here @ind0ctrination the fact that you took time to call out what behaviour was exhibited in the texts 👏🏼 With gaslighting, it’s such a slippery slope to identify Thank you so much for sharing something so personal @ind0ctrination", "darthsidious7": "Wow. Dude needs a damn good thrashing, I'm sorry I'm worked up!", "apekshawrites": "This is exactly like my first relationship. Emotional abusive relationships are so common that it's impossible to realise what is going on when you are in one. It fucks your mind. Other person has the full power over you.", "vanshikatewary": "Fuck. This is something I've been through. This does really hit.", "soul_wandering_dino": "This is classic man ego and toxicity, such people make the majority, #dismantlepatriarchy", "_.deep._.tea._": "Grateful to you for your courage to share this with everyone. Seeing these texts made me realize how a majority of us go through these experiences and how we're expected to keep quiet about all that we face. Lots of strength and love to you. And lots of admiration for your strength.", "chezdivya": "Omg thank you for breaking this down 🙌", "nih.a.rika": "I’ve been told you’re so fat I don’t want to have sex with you anymore and 3 months later, I am sorry. I realise my faults now. I love you and I know you still do too. And when I said I don’t he went ahead and told me I had been brain washed. Classic.", "tess_s_winx": "@arey_archi some of these reminded me of our deal with some of our friends", "thegoodslytherin": "I'm so sorry you had to go through all this bs. Thankyou for sharing! So much love and power to you, as always! ❤️", "machirajukashyap": "I think this conversation is highly peraonal, I hope you have the othe person in on this. I can sense the toxicity but doesn't put you in a good light either for posting this.", "kaafi_uwu": "people need to talk about normalised abuse/normalised anxiety inducing toxic behaviour more often! THANKYOU FOR VOICING THIS. MORE POWER TO YOU.", "justbeingaayesha": "@mallikaroy03 This is what I was explaining it you. But still be kind and suggest them therapy. I love you. ❤️", "umachatter": "Can relate with it at so many levels. Omg kudos to you. Stay strong", "memesaab": "I hate that this person calls you tree cuz it just sounds so condescending to me (I may be wrong) but usually using a pet name during an argument is like \"I'm giving affection pls stop hating me uwu\"", "thecurvedprobe": "Don't delete it. Let it serve as a reminder of how Indian men treat women.", "anukritix": "looking back at the het relationship I used to have, man this is literally a mirror image. I used to think it didn't work out because I was gay but because they were a manipulating asshole.", "kkeshikasri": "i've gotten manipulative texts like this from men who i wasn't even in a relationship with.... reading some of these is so so familiar and honestly, it's heartbreaking. i'm so sorry you had to go through this and so glad that you managed to remove yourself from this \"relationship\". more power to you 🙌❤️", "aryan_n_n_": "guys playing the victim card and doing the \"I HATE MYSELF\" routine is too old now man, they'll have to come up w something new", "cherylmukherji": "OH MY GOD THIS IS MY ENTIRE ABUSIVE EX RELATIONSHIP FUCK", "priyanka_mohurle": "I felt that. Feels like my ex's texts . This feels so sad. I don't understand how people be so traumatizing. This things can't go away whatever u say somewhere it haunts . This toxic peoples cause damage to our mental health. This is so relatable 😭😣. #Staystrong❤️ girl", "prasannta_priya": "This is so much like my first relationship, except my ex gave me rape threats when I tried to breakup. He still finds different ways to harass me though. And I know how hard it is to share your personal life, especially on a huge platform like this. So, thank you for sharing Trini 💛❤️", "skruued": "thank you so much for sharing. it makes us feel like we're not alone and helps us build solidarity as a community, even if virtually.", "sanjana_kakodkar": "This is MAD. The part where this person brings up something triggering/induces the insecurity and then goes on to say nice things or tell you that they attempted to \"protect your honour\" to portray themselves in good light is.... Scary. Scary that people's minds can even work like that.", "bemycandyfloss": "I'm so glad you're okay and that you recognized the signs. Take good care. 💖", "crazy_n_green_menstruator": "This is crazy! Been in such relationships like thrice before. I don't know how I always found such assholes. I m sorry you had to go through this. This definitely affects self-image, self-worth. Mine got damaged and taking years to heal.", "aish_war_yaaa": "Damn.", "sreemoyee_m": "I relate to this. So glad you got out and got it out of your system.", "nidhi.jpeg": "I felt like this was me receiving these text. Honestly, i have read a lot of such texts. They manipulate you and then make you feel bad to get manipulated. I am sorry, you had to go through this. Take care :)", "colour_outside_thelines": "It takes major “ovaries” to do this, thank you💛", "cats.ncuddles": "This just made me block my ex 🍭🍭🍭🍭", "aakriti.pandita": "@andreejaiswal kisi ki yaad ayi ye dekhke?", "oorja.revivestyle": "This is so, so typical and I feel like almost everyone has dated this person. It's so sad. I'm so glad you stood your ground, I know I haven't done that so many times when I should have", "ruhanika_aggarwal": "I can only hope that you get the most out of your life and have a healthy life❤️❤️❤️❤️stay blessed trinetra🙂", "arushiaishwarya": "Why is this so relatable 😭", "sasseshwari": "Oh yes! Just dealt with it last week! It's so subtle that it's annoying and one falls for it every single fucking time. But not anymore! Ab bass ho gaya! Ab haseena nahi manegi😎", "volatilekum": "no one: abusers: dO yOu tHinK iT dOeSn’T hUrt mE tO huRT yOU?", "aparnashandle": "Fuck! You are so fucking brave! 🔥", "kawaiibloggerchan": "JESUS FUCKING C H R I ST", "trishalah_": "Gaslighting is so common, I felt like I was born yesterday. Especially the part about trying to induce insecurity and then say nice things to induce trust. Thank you. You're helping a lot of women out there. Hugs 💕", "anik_aaaaaaa": "Been there. And you know, once you have actually realized that all this is just to manipulate you, you feel like if I was that same fool who fell for these kinda statements before, I would have been fucked !! And now you laugh and just watch them use all their tricks.", "vantagold": "Oh my god... This fucking hits home.", "karunaaaaah": "Why is he talking like he is the only guy who’d be willing to date you despite all odds? They use your insecurities, act all good and once they’ve had enough they’ll show you what they are. I’m sure this guy just wants one more chance to prove something which will eventually hurt you -.-", "irettaivaal": "🙌🙌🙌🙌🙌🙌🙌 this is every single ex who didn't want to be with us but yet wants us as their emotional support animal. I tell ya it's like they go to a Uni to learn this shit. You handled yourself so well. I for one have fallen prey to this sort of thing and it's something that haunts me. There is a reason the block option exists. Hugs @ind0ctrination you always amazee me", "anton.david.paulson": "Some entitled idiots clearly lack the maturity to hold themselves accountable over the garbage they spew. Not to mention, miss out on therapy!!! I'm glad you stood strong. More power to you, Trinetra. 🐝🌄", "varun_lokre": "@ind0ctrination, I'm sorry you had to go through that. Allow me to say when ever anyone makes any mistake (they know subconsciouly that they are doing wrong) one needs real guts to accept their mistake or to take responsibility for their action. The Partiarchy is such that instead of taking responsibility of one's actions, simply blaming it on other is so much easier. I personally believe that it's the highly inflated \"Male Ego\", that makes some men play the victim and that \"I can't live without you\" crap.", "ravinamehra": "Did I just read, \" a relationship is all about its mistakes\"? Ugh! He needs to go back and revise his ABC's about relationships!", "sowmya_srikrishnan_mrs.k": "This explanation feels like a thorough guide to identify toxic people.. I wish I had this years ago when an idiot did the same... Woman, write a book !!!!!", "dystopiangeek": "Thank you for sharing these. I went ahead and re-read texts from my ex and realised what he was really doing. I didn't know what gaslighting would look like in words or in a really subtle way. This helps. Thank you!", "meghna_n96": "This person is the biggest asshole I have seen since my ex. Felt like a conversation with him only. Ditto.", "appy._.b": "This makes a lot of sense ❤️ sorry you had to go through it all. Unfortunately the only way to avoid such people is educate ourselves about how they work and the tactics they use. All the power to you for sharing ❤️❤️❤️", "mepournami": "Good riddance ❤️ #icanrelate", "joleneannfernandes": "Wow this is so many toxic, gaslighting boyfriends and Im glad you dumped him ❤️❤️", "the_philotherian": "I agree. Doens't make sense to OTHERS. will always make sense to you. But I've done this too. Trying to show people what kinds damage TOXIC people do to you. But you know what helped? NOT GIVING IT THE POWER TO AFFECT YOU. not giving it your time and energy. 1. You could block. 3. You could leave on read. 3.", "aarushiray": "This is so damn true. Too many men have come up to me and said things to first induce insecurity and the show themselves to be my \"knight in shining armor\". And then they have the audacity to ask for things from you - be it sexual or emotional. So damn sick of it!", "punitamaheshwari": "Stay strong. You did the right thing. Thank you.", "luminous_esh": "And also, how I need to stop indulging in these conversations.. even if it gets provocative.. bcz that's probably what they want.. 'you to talk'.. Thanks for the strength and courage.. and I'm sorry you had to go through this.. hugs💖", "thatonemaverick": "Been there.. Read the comments. Scares me that the whole manipulation n victim card play by men is this common. Sure felt like i was reading my ex's chat. Much triggering 😖 n damn i ve said the exact same thing to the guy to just stop the loop of me being available n getting manipulated everytime...that..\"l just pretend you dont exist.\" Those words f mine set me free in some way.. n i keep repeating it to myself sometimes.. that \"it dsnt exist ...so live on.. Breath\"", "bitchiyari": "Been there, two years back. I didn't even had this much grit to hold on to my self respect. Was mistreated on so many levels I apologized for every single thing, and not just to him, to people around me normally. Left me scarred emotionally and sexually. Self esteem, self respect took such a bad hit, I'm still trying to recover. If only I can begin to put it in words, been two years now. Recovery is a fucking journey.", "ms.tribbianii": "Thank you we needed this", "aishwaryav21294": "Oh, man. \"Yes I traumatized you but how dare you tell me I traumatized you, now I'm angry at you\". Fuck, why are they like this and why did we let ourselves get this ahead before knowing any better. Shit. Feel it in my bones, this BS. I hope we all have the collective strength to realize better for ourselves.", "anamorrphic": "It's the same every where. Fucking toxic bullshit!", "kavya.rain": "He's full of shit. Don't even waste your precious time talking to him.", "wherearethetuurtles": "This is very important. I've been through a very similar thing way back when I was 16 and I could not even understand that it was manipulation until so much later. I'm sorry you and so many others have had to go through something or the other of this sort. All my love and power to you. 💙", "saucysamosa": "@ind0ctrination lot's of love to you yaar , you have the courage to bring out such loser who are nothing egoistic self absurd asshole filled in with nothing but horseshit..", "aanchalguptaa_": "So relatable! ❤️ Thanks for sharing.", "ma_jyotanwaali": "Saare toxic mard ek jaise hote hain BC. They literally have the same vocabulary and things to say. Thank you for sharing this. It only makes these asses easier to identity.", "ipukerainbowzz": "I neededto see this .", "simrrrrrann": "This is as real as it gets. More power to you honey :’)", "comradecompost": "oh my god, this is exactly how i spent all of 2018-2019. i am still recovering. so much of the gaslighting, emotional manipulation, holding me hostage (showing me he would hurt or kill himself if i left him- or even just wanted some space for a day or two) i’m ashamed to say i couldn’t even see how bad it had gotten until i left. i had to move out of the country to get away from him but that wasn’t enough from us staying in touch. i finally deleted and blocked his number two weeks ago. i know how terrible this is. sometimes airing it out in public is healing and helpful, even if you want to delete it later. we all have different ways we need to process it.", "in.ixes": "Yikes. What a douchebag. Glad you didn't let an idiot like him crawl under your skin. Hoping you never have to tolerate this behaviour from future partners.", "prayernaaah": "Wow. I felt like I read a part of my own chat box. With you. In sol.", "_prathami": "I'm happy you were in a play", "ariachoudhry": "It is relatable but I wonder what position you've put yourself into. Sometimes we've got to look out for ourselves. Cause if we don't, who would? I am scared that in your attempt to wary the world of such men, you've jeopardized yourself. Tri, please don't post content about your life so publicly. Your life is private and the world doesn't need to know the entirety of it. Sure, the world needs to be wary but not in a way where you put yourself at risk. You're too pure for this world. And I'm sure alot of women have been appreciating you for your efforts but there are alot of them who are just silent observers. Who won't say a word of appreciation or contradict you but then leak info which can be used against you. Social media is not as friendly as it seems. Please protect yourself and be happy. You owe it to yourself. 💖🤗", "dhruti__sampat": "This actually helped me understand what gaslighting means, and now i realize I've been a victim of it. All the self-doubt and hatred was because of it. Thank you for helping me realize that there is absolutely nothing wrong with me. Here's to a step forward than we were yesterday.", "sana_omfg": "@viiniiithaa", "arty_shenoy": "This \"I'm a monster, you knew I was a monster, but your love (ability to put up with assholery) made me less of a monster, so you should continue to love (put up with assholery) me, for my sake\" BS. I am so over it 😂", "schrodingers.corpse": ":(", "rahul_1.618": "This person sounds like they have the maturity levels and cranial capcity of a middle schooler and the toxicity levels of a bollywood item number", "wolfie_kulfi": "Thank you so much for this. A lot of vulnerable people are constantly targeted by those in a place of higher authority or power.. this is so powerful, much love to you. ♥️", "janvikamyjourney": "I felt like i was reading my ex boyfriend's texts. This is sad. Why would he tell what his classmates say about u? Thats so insenstive and hurtful. You are beautiful inside out and you don't need toxic people in your life who cause damage to your mental state. Wish you shared his picture. Women should know who he is so that we remain careful", "dritiprasad": "Really relatable ❤️ much love to you and your courage !!! You are such an inspiration 💗", "mindfulpursuit": "Just because s/he is going through these issues doesn't mean you need to go through them too. I can see you're compassionate enough to engage, and this also gives you some reward that you are not the \"bad\" person, and there are no solutions or advice for the unique interplay between different psychological beings. I was (un) fortunate to have a similar (not same) experience with someone I later found had been diagnosed with psychopathy. The lesson was cartoonish that I tried to do the right thing, when that person only wanted to manipulate that fact. It didn't scar me, but it did help me listen to my internal voice. I hope you listen too", "manognaa.s": "I'm sorry that you had to go through this. Thanks a lot for putting it out here, Most of them doesn't really acknowledge the fact that they're being ill-treated and emotionally abused by believing that It's just love and that's the way the person loves them and it's gonna get sorted and shit. It is never freakin okay. I just hope people realise that they're in a toxic relationships. More power to you ❤️", "ambypure": "This is a mirror image of my first relationship. 💔 Can I share this though?", "calmie.the.mami": "Ooof this haseena mam jaegi mentality. SUCKS.", "shreyasjadhav_26": "This post is gold. I know a lot of people who need to say this, sharing right away! Also, thank you tons for posting this❤️❤️", "feministflowercrown": "This is so important. It does make sense, so much sense. I've thought about doing one of my own for some time but I couldn't and don't have the texts anymore. Thank you for sharing. Love and power to you ❤❤❤", "scopeheenahihai": "This is so fucking relatable. So much love and power to you. 💖 Do you mind if I share this?", "nandee.ta": "Makes sense. Every single word. Been there, felt compelled to respond to every word of it because always feel like there's something to prove, then pulled out and realized I was blaming myself for someone else's (sometimes entirely unintentional - it's so deep seated) manipulative and toxic behaviour. I hope you're better. 😊", "iamronaldoantony": "Thank you", "__n.e.h.a_s.h.a.r.m.a__": "❤️❤️❤️", "dumb_young_broke": "You're a badass🔥", "nikita_nishiprava": "I feel like I must've been born yesterday because I didn't know that any of those stuff were gaslighting/playing victim. I thought these were normal because a lot of people always say stuff like these in front of me, to me. Perhaps that's why I normalised it. Nonetheless, I'm really sorry for this jerk of a human being. Stay away from these creeps 💗", "shereinbansal": "\"a relationship is all about its mistakes.\" Ye lo. 🙄 Abbey FUTT. And oh noo.. he was about to defend you and get into a fight with the transphobes but his \"great friends\" stopped him. Arey ye toh devta nikle. Even just the fact that you had to explain your triggers/trauma to someone over \"hours\" - I'm so sorry you went through this and I'm SO glad you got out. I got out of my toxic rship years ago too. Fuck them all.", "minazuddinkazi": "More power to you Trinetra, you’re too good for these douchebags", "ssaraswati2304": "Proud of you", "akashadeep": "Thank you for sharing❤️"}