{"adtyxb": ":3", "soumauve": "Thst is not true. If this is true then Islamophobia is justified & we can say all muslims are terrorists. Then we can say all Americans are violent. All Japanese are cruel and all Europeans are racist.", "janmejai23": "Shit!! Look at first slide...U look like enjoying doing this...so sick...", "_geetikpriya_": "#notallmen but #enoughmen", "rajatangri": "I have observed a pattern. The idea is simple behind your posts. Demean a gender on the based of a recent event and when someone counters that come with a point to speak on the issue than defending the gender or NotAllMen. But my concern is, isn’t it hypocritical of you when you tell people to focus on the issue when tend to defend a segment of a gender which is innocent while on the other hand, you have done the same by bashing the gender and deviated from the issue. In your recent posts, you have very nonchalantly linked the whole boys locker room incident with men patriarchy but never talked about reforms or how to avoid those, responsibilities of society and parents. To bring up the facts, what happened was done by children (non-adults) between the age of 15-17. Don’t you think it should be parents to be blamed who didn’t teach them thoroughly? Or the society or the schools? You have portrayed one side of the story. Manav Singh case where he was accused of false rape! Don’t you think it’s imperative to address such concerns as well?", "siddha.r.th": "You just read my Crazy Bitch comment not the other ones where I talked about the solution to uplift the women who are underprivileged. You are a hypocrite", "ivana.dilauro": "You’re a guy", "darkwebinthemidstofeberything": "Chal be chakke", "moilypratik": "Revolutionary without a cause.🤣", "vaishhh.__": "@ind0ctrination Then all muslims are terrorists? Coz you just said all men", "obsidian_platinum": "@comment.raiders", "shayar_yaar": "😂😂😂😂 didi, yaar snapchat screenshots ne to aapke saare posts hi waste kr diye.. Lol", "_sulema.n_": "Then if all men are held accountable for rape harassment and abuse then all women should be held accountable for the same done to men too if all men r trash then all women r trash too🤷🏻 just because u don’t hear much of stuff done to men doesn’t mean it doesn’t happen in society men r thought to shut up about it and a man about it and move on which isn’t right but no one talks about it do they everytime an action happens against a woman its all over the news and media. A girl slaps a guy he’s sexist, a girl slaps a guy she’s courageous.", "menba_imsong": "2nd slide made me wonder what kinda fucked up society you were born in. 😂😂 India must suck.", "tanvi.s0036": "Patriarchy is the root cause", "_shuchiii": "❤️❤️", "i1shana": "hi i love you thank you for this", "09.joshuaa": "I want diesel patches to make a video on you but then I remembered you're not that relevant", "filteredyetraw": "More power to you! Thank you for penning this down so accurately! ❤️", "abhinandan.png": "Not all men are wrong not all women are right.", "lily_the_gay_penguin": "So many of these comments disappoint me… as a trans girl, I can tell you that everything here is right. Everyone has this responsibility", "gokulxnr": "❤️", "hitashasharmaa": "Wow.", "manyajagadish": "You are sooo empowering ❤️", "_bong_014_": "I understand where you are coming from, or atleast am trying to, even though i never fully can, but I'm just asking : What about the small populace which understands, or like i said, tries to. You can't group us with everyone else, because that is unfair, and that's exactly what you are fighting. So what about us ? Are we just going to be called cruel and unfair, even though we are trying to back you up ?", "reorik": "Your so pretty ❤️.", "ivan.dionysus": "Cringe SJW moment, this is wrong on so many levels", "yes_all_men": "To all those men who say 'Not All Men'. Let me tell you why it is all men. Every man in this world, has at numerous times in his life sexually assaulted women. You dont become a rapist just by raping or molesting a girl. If you have ever masturbated or fantasised about a woman without her consent, then you are a rapist. If your eyes go down to our tits when we wear low-necks, then you are a rapist. If you watch porn and enjoy the atrocities that happen with the women in it, then you are a rapist. If you stare at us, or our asses when we wear tights, then you are a rapist. If you ever have had sexual feelings for any girl without her having those feelings for you, then you are a rapist. And if you feel, that any of the points mentioned above are incorrect, it's because you are living in a patriarchal world where watching female porn, masturbating and fantasising about women and staring at them is considered okay. Masturbation, porn and fantasising is equivalent to rape and every man, including your dad, grandfather and brother have all done it. So yes, every man, including the ones in your family, are rapists. It's just that this fucking patriarchal world does not accept it.", "lalposter": "This is so so so beautiful. Thank you. Thaaank you for taking the effort, Trinetra.", "4renaissance": "Lot's of love 🌈🌈🔥🔥", "sonder1144": "Thank you for this. Very well articulated.", "isitastupidusername": "I LOVE YOU SO MUCH❤️❤️❤️❤️❤️MORE POWER TO YOU❤️❤️❤️❤️", "_itsupiki_okami._": "You have my love and support. I don't give a damn about age, gender, sexual orientation, anything. Humans are humans.", "aiman_oblivion": "More power to you! Thanks for sharing this. ❤️", "minoritarian": "Gurugram boy committed suicide after being accused by girl on social media, was that fair?", "thepototo": "Honestly you are so amazing and I hope we can all fight this together. Just hope people can be compassionate, empathetic and self critical. We need a lot of love right now and I think the dumbasses who say dumb shit might also respond to compassion, since they don't seem to take logic very well.", "kungfu_kutta": "I completely agree with you on this, yes all men should be held accountable for patriarchy. But #yesallmen sounds like we are being excluded from this movement despite embracing it. That's the problem. You have explained the term but you can't deny the other side of the coin, of this hashtag, that a huge part of feminism of this day and age includes demolishing stereotypes about gender right. So isn't it hypocrite to label a whole community even those who have changed and are now with this movement. Also the other reason why this is wrong according to me is, apart from the other two reasons I gave above, is poking people who have changed. A lot of people have defended this tag by saying all men or almost all men were misogynist and partake in objectifying women, but I am saying isn't it morally wrong to point out the past wrong of those who have changed like what happened with Rishi Kapoor after his death when people started digging his old tweets. Also ❤️❤️", "aparnashandle": "Patriarchy hadnt done anyone good - man or woman. It was made to dominate men and women both, nobody understands this. It's not a privilege people, it's the biggest shackle.", "viraxrasam": "so much love to you❤️. I'm sorry that ppl are demanding your labour when you do so much already. love, healing and more power to you💛", "laxmipriyasn": "I think you are an icon..not just coz you are so uber cool but look at that articulation and critical thinking. How can these entitled cogs in the wheel of patriarchy EVER ever understand what you mean. And if they don't understand when you are being 💯 level clear and articulate then we'll they stand a chance NEVER of redemption nor innovation in argument", "indiancinemamovies": "Also, people who are hash tagging girls locker room are the ones who feel guilty that they have also been a part of boys locker room and they wanna hide their mistake by hash tagging girls locker room. Even though the one which was exposed was the boys locker room and not the girls. That’s basically like, A talks shit about B and everyone starts saying A and B are both wrong even though the one that was exposed was A. So if B complains and proves about A talking shit on B, B and A will both get blamed instead of just A because the truth and fact that got exposed was A and not B.", "the_feisty_feminist": "Amen. ❤️", "nope_ur": "Bn", "vijayasrivastavaa": "You have all my heart and all my support. I know this is not the right moment to say it but SKIN CARE ROUTINE PLEASE!!!!!!!♥️", "_athira.n_": "Love this and love you ♥️", "saisravanthi_kilari": "❤️❤️❤️", "hridyashokan": "Much love to you sweetie❤️", "siddharthsridar_": "You didn't have to take this unpaid emotional labour but you still did, and you explained everything so accurately. The hate you get really shows the mentality of people who have a problem with #yesallmen", "thamannarazak": "This is so eloquently put, thank you ❤️", "umlaah": "This is such crap. I am sorry you have to deal with this crap. You are a star, thank you for doing the work you do. Men. Are. Trash.", "kumarkhatrianuj": "Ok so what am i suppose to do now sexchange operation?", "snortingiggles": "You Are Beautiful! Inside out! You’ve been through a lot & you are an inspiration today! More power to you girl! ❣️", "christie.maria91": "Thank youuuuuu♥️♥️", "rashmi.13": "Thank you for doing this, so much love and power to you ❤️", "papermonk": "Thank you. 🙏😁♥️", "mitushi_27": "“No struggle can ever succeed without women participating SIDE-BY-SIDE with men. There are TWO POWERS in the world; one is the sword and the other is the pen” -Jinnah", "megha.a.a": "The 'not all men' people are like wounded babies. #FuckNotAllMen. Thank you for doing this. Thank you for speaking.", "mwhorin": "Sending you love. You inspire all of us. ❤️❤️❤️", "u20kars_h": "This has been a conversation happening everywhere over and over and I don’t where else to put this so here I go. I think the issue with not being okay with the idea of all men are trash is that we refuse to understand the role of implicit bias in making men the product of patriarchy. Just like all straight people are homophobic by default as they just don’t have previous experiences to base their judgement on, all men are sexist given that they have no previous experience of being a women to base it on. Privilege here is more than just being a men, it’s about the ability of refusal to listen as it shatters and changes your world view. I mean as someone who finds masculinity as a part of my identity and redefining it as a part of the process of being comfortable with myself, the notion of calling men trash does hit home. It can feel very dehumanising to have to challenge that identity but I don’t think that’s enough of a reason to give the larger idea of this away. Men are trash is an expression of not frustration but education that allows us to think within about how our privilege makes us stand better off in the world.", "_fudge.cake_": "More power to you 💜 thank you.", "saurus_sne": "@ind0ctrination I am truly sorry about the hate you receive on a daily basis. For me, the ONLY positive thing to come out of this shitty locker room episode is discovering your page. You are an amazing human! I and others here really need to pay you for all your efforts. Sending many many air hugs and if you ever visit Netherlands, please know you have a place. 💜", "beatles.divyanshu": "You simply spoke my heart—love, power and hugs to you. ♥️", "im_the_hero_of_my_life": "I'm not lying, reading the comments was gut wrenching. There's no way decent human beings talking like that. Much strength to you!", "nameisnikhil": "All the fuckers who think, ab ye sikhayegi humko, aap mard hain lekin insaan nahi.", "rainbow.drama.cookie": "You're so so so beautiful! 🌸 You inspire me deeply! I'm so glad that I get to hear from such strong personalities like you (thanks for SOMETHING IG). You make my day!", "dayitaaaa_": "After a whole day of fighting baseless 'not all men' arguments on social media, this post is so relieving. Bless you yaar, you're an idol😭💓", "richa_rao54": "I am awe inspired. Thank you so much for being such brave heart 💓", "artwhoring\nVerified": "Verified", "vqueer": "Girl, the hurt men are the same. They really have nothing to say. They have no nuance. Nothing to argue. In the last dozen years I have heard men say the same shizz. These men are not part of any movements nor will they take responsibility for their own. The men’s rights movement is now deeply Hindutva. It’s not like these men are there arguing with those men - because now it’s not all men because it’s muslim men, and dalit men and so on. They take no responsibility for the vile stuff men say in their capacity as politicians and doctors and the rest. Actually strangely not all men is the only community they have. The not meaning they will not participate in solidarity, they will not be held accountable, they will not check other men, and so on. I have attended more men’s rights conventions than any of these men. And as feminists, we were the ones to begin work on men and masculinity - both academic and activist. Sadly, these men don’t even know the history of their own articulation of vulnerability. But like all the work we do in the domestic, emotionally, and politically; men will reap the benefits. And be the last to even offer the solidarity of gratitude. Because what’s most imp is being in the right (pun intended). Fathers all of them!", "kaafi_uwu": "Queen 🙌✨", "sl_kiran": "The main issue here is that when you say #yesallmen you mean to hold all men accountable for demolishing patriarchy. But the ones who are getting offended and saying #notallmen aren't saying not all men are accountable for demolishing patriarchy. Instead they mean not all men are disrespectful to women or transphobic nor do they believe in not having any emotion instead of anger nor that they 'must' degrade women . And the fact that your just mentioning #yesallmen in the first slide instead of elaborating what you mean (which could be done just in one sentence) following it up with sexism, misogny and your caption dosent help in sorting the confusion. Lets be real some people get triggered with just that and might not even read the full post and head straight to the comment section. If you wanna get your point across to the the people who are getting triggered, because they are the actual problem, you could make it a lil more clear in the first slide itself. Im not trying to dictate anything if it came across like that but yeah just tryna say instead of both sides triggering each other if everyone can be a lil civil about it then the conversation would move forward instead of all this negativity.", "ithink_loud": "Thankyou Trinetra! This is brave. This is sad amd your expertiantial perspective makes it so powerful. We, as a society, seem to be devoid of empathy. Every body deserves and should feel safe for being themselves. Sending love and power to you! ♥️✨", "shamini1995": "@ind0ctrination Trinetra, I've been following your account for a while and the fucking labour you put in makes me want to either run and be part of your revolution or sleep for a hundred years. I don't have much to say for the level of transphobia, misogyny and stupidity you go through but I promise you that if we ever meet I'll offer the stiffest drink on the planet and a meal with all my heart. Meanwhile if you need to rant or talk about anything else even, my DMs are open or just call. Hugs x 100 💙", "yushaayy": "Let me explain “Men are Trash” using snakes so even the dumb [expletive] can get it (also because we are snakes): We all know that snakes are dangerous, yet there are some snakes which are not deadly at all. However, you never hear people say ‘some snakes are dangerous, some are not.’ They just say ‘snakes are dangerous’ because it is hard for the average person to tell which snakes are dangerous and which snakes are not, so they urge people to be cautious of all snakes.  Even if a snake is presented to you and you are told it is not deadly at all you will still feel uneasy and take extra precautions with it because you know what snakes are capable of.  That’s how women feel because of men, yet you want to come here and complain just because they didn’t single you out as the good guy you THINK you are “ —Jesse Vhasy Rasoesoe All the love and power to you and to us ♥️", "akademimag": "More power to you, Trinetra! Thank you for taking out the time to pen this down, we’re all better because of it. It takes a lot of moral courage to use your own personal experiences to help others better understand the functioning of oppressive systems. Thank you #FuckNotAllMen", "adithyarajeevan": "All these shiz and you still never gave up 🙌grow from these, glow from these ♥️just keep going", "april1513": "Wow, so you are truly AMAZING💜 and I read your comments on this post too. You deal with the stupid ones and the who think they are really smart kinda stupid ones so well, Bravo 👏👏👏 I am sorry I just shared your post on my story without your permission 🙈 I can take it down if you want me to 🙈 really sorry about that, I couldn't help sharing it but I should have asked first.", "maybehitarthi": "I’m so incredibly in awe of you, you fierce resilient woman ❤️😭", "maxima_agonia": "*yawns*", "siddharthrajan96": "Who is this anuvaa ?? 😒", "an_apocalypse": "You perfect human, sending so much love your way! Thank goodness you exist. Thank goodness. 🌸🌸🌸", "diaries_of_mad_moon": "Here are my views. Hoping for a discussion. 1. Today sexism is not confined to men only. Every man, who grew up to be a sexist, had probably been influenced by both men and women in their lives in every aspect, including gender sensitivity. So, I think not just all men, but every human. In this sense, all men seems a bit narrow. 2. At some point in life, we make choices - political inclination, religious beliefs, societal rights and wrongs etc. So, many a times, when people say that patriarchy originated from men, hence men are the accountable even for those women who regress women. Then it seems like at some point it is a choice everyone, irrespective of sex, has to make - whether to continue what I was told and taught or to break the mould, just like, say, the child of a smoker may or may not become a smoker. 3. Does all men take into consideration that the men who actually want gender equality may feel disappointed that they, despite not causing harm, are being made to feel unjustified and could it not hamper their mental health? Please don't say those are very few hence ignorable. I find it genuinely distasteful to put human beings as mere stats and numbers.", "xalxo.s": "Ahah I haven’t even read it yet and I already love it judging my the template", "sowmya_srikrishnan_mrs.k": "You are the strongest woman I've ever come across... I'm sending u lots of hugs and love trinetra... I'm sorry ur being sent so much hate.... You have my respect love... Post again and again...we love reading and learning from u....aaravi sends her hugs too", "sangu421": "I love you♥️♥️♥️♥️♥️ Thank you for this.", "arty_shenoy": "How many of the men complaining that women are the privileged ones, that men also get abused, that men are also hurt by the expectations placed by them, etc etc actually bully others who don't fit norms themselves? How many of them have refrained from mocking a \"less\" masculine guy, or even better, stood up for him? Only when they see someone who is obviously hurt by patriarchy and is trying to voice the hurt do they come out and spout nonsense. Stop. Doing. This. Direct your upset feelings towards changing these things. Or admit that you enjoy feeling superior as a cis het man, and that you feel entitled to lording over and even protecting those who are not cis het men.", "olakatu": "❤️❤️❤️", "akku_kkuttan": "Would it be okay if I posted this in my account?", "damselneverindistress": "keep shining as always dear @ind0ctrination ❤️", "ind0ctrination": "Some chutiya will now say wow she posted one hate comment twice what a feminazi bitch", "thilak._.bukowski": "❤️🔥", "chinmaya_s_saras": "I completely agree ma'am", "samruddhi_nale_11": "Hey!! I don't know if you read this..but I had to say this.. people abusing you for your past shows how hollow they are as a human.. I guess its about upbringing..and I really don't see why the fuck being gay is used as gaali..like WTH! #menlikethis #notallmen but majority! @ind0ctrination you are very strong! Keep bashing ppl like these!❤️", "iamthenose": "Trinetra you’re giving us so much life during this time! ❤️❤️❤️ Hugs!", "_.deep._.tea._": "Love you so much 😭😭😭😭♥️♥️♥️♥️♥️", "vinimoksha": "❤️", "sid121199": "❤️❤️❤️❤️", "calmie.the.mami": "So proud of your transition tho baby gurl 💖", "pooja_n_rajwani": "Fuck everything... You are gorgeous woman. More power to you❤️❤️❤️", "bhatt_13": "Pyaar ♥️", "parishmap": "Sending you all the 💓💓💓💓 @ind0ctrination you're the star you've always been ❤️", "khaamakhasai": "Omfg this makes me feel sad and angry and scared all at the same time. Wtf is wrong with people??? These guys need to understand that it's not women vs men. It's good vs bad. Bad that affects everyone to a certain extent. EVERYONE. It doesn't matter if you are a guy, a girl or transgender person or non binary, patriarchy is bad for everyone. It's people who directly or indirectly benifit from patriarchy vs people who are affected adversely by it.", "anuli_peesara": "You're a wonderful human being❤️ please know that there are people who have nothing but utmost love, respect and admiration for youuu❤❤❤ Hugs❤", "abhizilla": "Hey, I love that you acknowledged issues both sides go through here and chose not to isolate either. That's very responsible of you.", "goddamngayatri": "Thank you!!! I am so fucking exhausted debating with men in my DMs. I am going to slap these dumbfucks with a link to your post.", "logger_heads": "More power to you, buddy!🔥🔥 You rock. I am sorry you went tackled all the transphobic shits out there alone. I apologize I didn't speak up at all times. But I take responsibility to try to make the world a better place. The onus lies on me. Have a better life ahead :)", "vainglorious_narcissus": "This post is so true and hard hitting. Thank you for sharing. ❤️❤️", "imperfect_queertrans_therapist": "Cis k liye bhi stand up and apne khudke identity k liye bhi! Phewwww!!!", "shatarupaaul": "You're a beautiful, beautiful human being❤️", "0sheen": "⚡️⚡️⚡️", "siyahinblue": "Thank you!!! 💕", "shrutiyapa": "You’re a beautiful and a brave person 🌺", "priyaa.shetty": "Can you please check my dm pleaseeeee please", "vintage.desi": "You go gurrrrllllllll💞💞💞💞💞", "prabal_prince": "♥️", "sangha.deb": "🌹 power and love to you.", "ameedul": "I should have used \"all women play the woman card\" or \"victim card\" when my harasser was let free. I was harassed too but I know the difference between a particular woman, \"some women\" or \"all women\". Two wrongs don't make a right @ind0ctrination", "noor.saifi.7771": "@_shamakhan kitna shi likha h", "oxymoron1995": "Thank you. So much.", "hash.ig": "I don't even know you and I would be there for you if someone hurt you, so much more love for you ❤️", "theshaguftasaba": "❤️❤️❤️", "tarang_guptaa": "Thankyou for being the voice we need, even when when society has failed you on so many levels❤️", "unicornsandglitterpoop": "Love you for this❤️", "girl_with_glitter_": "Ohh my god finally I m going to post this on my story for the all not all men supporters", "ayu_so_random": "Thank you for this Trinetra ❤️ YOU ARE AMAZING ! ✨🌸", "alinatamkeen": "And u looked beautiful 😍 u look beautiful 😍 u have a beautiful soul❤️", "hanzalaaman": "More power to you, Trinetra!", "the_nerd_style": "Arent you awesome!♥️ More power to you!♥️", "gangulymridul": "I am glad you did this. No one deserves to be at the recieving end of such disgusting behaviour. Some people will never come out of their bubbled existence. This is not about proving innocence but holding people accountable for what have been normalised for so long. This is way above small fragile egos. The irony is so sharp in their responses and still they remain ignorant. I wish you strength and patience. 🌻💛", "miss.francis_s02": "❤️", "riyaahooo": "I love youu😭♥️ can i post this on my account?", "harshitha_manjularaj": "You go girl, you're too fucking amazing!", "vantabronze": "\"girls have more privileges than men\" yep, being of the gender that thinks twice before going out past 10 and constitutes maximum rape victims is a real godsent privilege, thanks! I'm gonna stop being a feminist right at this moment", "mono.no.aaware": "I couldn't agree more with every word you speak. Trinetra you are my hero ❤️🔥", "a_sass_inator": "Also how come every other woman you know has been abused in some point of her life by a man... But every other man you know has never been called out for his abuse.. That's what this shitty system of patriarchy does to you and the ones around you.", "brinda0101": "@ind0ctrination so heartbreaking to see all those comments. Very brave of you to post this despite knowing very well that these vile transphobic comments will be thrown at you by the \"lovely\" people of the internet. All power to you❤", "ritu.raii": "Thank you for sharing this ❤️❤️❤️", "soc.ialjusticeworrier": "People might not realise why you're doing this. People might not see the subtle narcissism. People might not see that after this provacative post, your followers increased by a few thousands in just a couple of hours. People might not see that you're getting your dopamine hits from all the validation your getting through the likes and shares. People might not see how you secretly enjoy this fake brittle popularity. People might not see that you yourself are privileged. People might see that you're flaunting your \"luxury beliefs\". People might not see how hypocritical you are. People might not see how big of a brainwashed idealogue you are. People might see you as \"Real\", but I see through it all!", "srushti_rocia": "You are amazing! More power to you!! 🔥✨✨", "kardashianpampam": "Caption🔥🔥", "satvik___": "Beautifully summarised❤️", "kmarigsing": "You my dear have more balls than most men i know.....stay blessed.....never let ur focus waver!!!", "kneeharikaa": "no but Trinetra you don't understand. i MUST bring up the fact that i'm one of the better ones even when the issue is clearly not about me and i MUST receive a medal for not being a fucking asshole i don't think i'm asking for too much.", "shrejal.2909": "Thank you so much for doing this. People spamming with all the trash they have to say really takes a toll on my mental health, specially if it comes from people whom you have known all your lives. I was really feeling drained by all the nonsense going around and hearing some of it from the people I have been with, all my life. So when I see your posts it gives me so much strength to stand up and fight. More power to you Trinetra. Keep doing what you do and don't let anyone tell you otherwise. ❤", "being_aysh": "Thanks for sharing this. 💟", "feminist_mirrors": "Babyyyyy ♥️♥️♥️♥️♥️", "joshitassingh": "❤️❤️❤️❤️You Go Girl..XOXO..!", "streeelex": "Trinetra, THANK YOU. I wouldn't be able to sleep better if there weren't people like you who are fighting every single day for honesty and integrity. THANK YOU. It gives people like me the hope to see a tomorrow that is healthy and safe for all. A tomorrow that is probably a thousand years from now. But it is possible to even imagine of such a distant tomorrow because of people like you. SO, THANK YOU. We all are in this together. So, let's put up a good fight. And if you feel lost or tired on a particular day, remember there are people like us who are fighting harder on those days just like you have for when we were silenced. Hum honge kamyaab ek din. Unrealistically, I so want that Ek din to be TODAY. But we know, it will be a far distant tomorrow. Tab tak ke liye, SHUKRIYA.", "eshita.dubey": "You r amazingg❤️❤️", "badgalviiiiivi": "I’m so sorry you had to go through this, you’re amazing and oh god so beautiful ♥️", "irettaivaal": "All men simply must take responsibility and be culpable for their actions mainly because they still reap the benefits that stem out of this shitty unfair misogynistic system @ind0ctrination", "yukta.h_": "Thank you for this, more power to you 🙌❤️", "waywardandproud": "More power to you 🙌🔥", "hopelesslystoic": "Hey I'm just curious. Does it make you feel uncomfortable to view those pre-transition pictures? Just wondering because I've seen some trans people feel that way but you're always posting those pics like it doesn't faze you", "bhaktiiiozaaa": "You're beautiful and brave and you deserve so much! So much love and prayers for you and your safety ♥️", "yoginijhingan": "🙌🏼", "_blair.witch_": "we stan a queen 👩‍⚕️ 👸", "nirumaaa": "😭❤️", "haert.nebula": "queen is going OFF", "anny.singh_02": "I really don't know how u deal with so much online harassment... And to think u have been dealing with worse since childhood gives me chills... I wish I could just give u a really warm hug. U literally are one of my biggest inspirations ❤💜", "animesh247": "The Queen Slays again!! Trinetra for PM🙌🙌❤️❤️", "arshi.ihsra": "🤗🤗🤗❤️❤️❤️❤️🙌🏻🙌🏻🙌🏻 @ind0ctrination 👍🏻", "boss22607": "Nice❤️", "primadonnaguy": "i fucking love you", "baggybags_": "The 5th and 6th slides!!!🔥❤️", "saanviwadhwa": "more power to you, Trinetra!", "anu.shka.das": "More power to you 💕💕", "emhore": "Omg this so real!! All power 💙", "alkamehta_31": "You're amazing. You should be proud of yourself!", "cartel.madras\nVerified": "Verified", "tharkimonkey.fit": "Lmao what doesn't kill you makes you stronger ka example right fucking here🤣🤣🤣🔥🔥", "almost_bobby": "♥️♥️", "jayaajayjunior": "Thank you for sharing this Trinetra ❤️", "aanchal.anejaa": "You have put this so nicely❤️.", "inquilove": "Beautiful ❤️❤️ I love how you always speak to the point", "thegoodslytherin": "Do I have your permission to share this on my story, Trinetra?"}