{"trinz.xo": "glow on our warrior constillation... 😘 😘 😘 😘 😘", "sabahatshkh": "I'm so happy for you. Genuinely. ❤️ Take care of that cooch. 😭 I'm so damn happy for you", "baamaxx": "😭😭👏👏", "gayatri_roch": "Iam going for an operation today, they say it hurts bad, thank you so much for this post. Thank you for this strength. Thank you for being so brave. Thank youu!❤️", "vaiconic": "Wow. ❤", "_umashanker_": "I wish you weren't in so much pain but also glad that you forged ahead and are in this place now. So happy to see you posting. Love you dear♥️♥️♥️", "ishaanbhardwaj": "More power to you! 💖 Lots of love and god bless you hon 🤗🤗🤗!", "suparna_bh": "Can you walk?", "navleenhopes": "More power to you ❤️, so have been so brave, so amazing, keep shining ❤️❤️", "__call_me_vish__": "❤️❤️❤️💞", "kcvlaine": "💜💜💜 take care fren!", "harsh.vats.237": "I wonder how you summed one of the worst terrorist attack on the country , you being molested by a bunch of men from islamabad and you needing \"dilators to keep your cooch open\" in one post. Way to keep it real dude 🥂.", "chadurvd": "Hows ur health?", "oldpalaces_newroads": "Wishing u a world full of happiness, love and good health", "iamlucky_95": "Take care ❤️", "vansoffthebinary": "yes and yes and yes!!! wishing you a speedy recovery ❤️❤️❤️❤️", "timetravellingshutterbug": "So happy for you ❤️ stay strong", "__shrishtea": "❤️❤️❤️❤️❤️❤️", "mradulsinghh": "I saw you here loving yourself more and I felt good. But then I saw your YouTube video. I feel so angry and agitated right now. The stress you had to go through. NALSA was passed way back and still these basic changes have not been brought up is very saddening. I wish you more strength and more strength and most love to help you love yourself more and shoo the pain away ! YOU ARE A ROCKSTAR GURL ♥️❤️ God loves you most, he may be stressing you now but he for sure loves you most, that smile on your face speaks volumes 🤗♥️😁", "arushiaishwarya": "Love the last line ❤️ Hope the pain disappears soon. Take care 😊", "iam_ur_crush.1321": "Inspired by you my love ❤️❤️❤️", "goldbarbie.fq": "🦋", "appy_fizz_1995": "I am so proud of you and I am bursting with tears in happiness for what you've achieved finally!💖", "krishnanobis": "Girl, I wish I was half as brave as you are. :’) You give me so much strength, love.", "in.ixes": "I hope you recover soon, Trinetra. You're one of the bravest people I know and you always have us for support. Take good care of yourself. You're a Warrior Queen. 💜", "pavemented\nVerified": "Verified", "rajnish.j28": "❤️", "my__aliya": "👏", "vaishnaviisuresh": "You teach me so much every single day, I'm so, so happy for you. Hope the pain reduces soon. Love you always ❤️💜🌺", "atshantanu": "moved !", "anafeelingana": "😭😭😭😭", "girl_on_the_shore": "♥️♥️", "xshinzo": "❤️", "treadalone": "Take enough rest, my love. See you soon! 💟", "lingamharagopal": "Pain is temporary. Quitting lasts forever. 🙏🥂🍾", "nerdishika23": "Congrats @ind0ctrination ❤️❤️❤️ get well soon", "electronherder": "Stay strong, power ahead 💟💟💟", "joleneannfernandes": "@humhu_ this beautiful trans woman do ente her journey on Instagram.", "pranavimaruvada": "Wishing you a speedy recovery and a wonderful journey ahead♥️", "thepalettesofshikhar": "Much love and more power to you! ❤️", "eyesightclicks": "Love yourself everyday,we all deserve it.", "bweehee": "Everything about this post is just so so good. Lots of wishes for a speedy recovery 💕", "mirror.lexi": "The last sentence omg!!! Ily💕", "kartick_007": "More power to you, Trinetra!"}