{"eyesightclicks": "All our love and prayers for you to heal ♥️", "ughchal": "I don't think I could be happier for you❤️", "mayuromycin": "Our body can do almost everything...it is your mind you have to convince", "zubairaliii": "Much much MUCH love to you!", "keeeeeeerti": "Hang in there. You were determined throughout. Now be determined and taste the sweet freedom at the end!", "___________eto___________tanya": "Here u are🌹", "sweta_lizi29": "Get well soon ... recovery on the way ... loads of love and wishes ...", "nikkidominoes": "Wish you for speedy recovery.. More power to u ❤️❤️", "witchcrew": "I hope you feel better soon", "lass_on_wheels": "Stay strong..If our mind is strong enough, our body can be flexible... never leave ur aim...👍 Get well soon..will keep u in my prayers dear😊", "vishnu_suresh_official_": "wishing you a fast recovery...... @ind0ctrination", "dontwhinedrinkwine": "Omg guuuurl I'm crying 😭❤️❤️❤️ so happy for you", "_neetika20": "You're such a strong woman and I know you'll get through this but having said that, I know it's not easy so take your time sweetheart. You're so friggin amazing. 💗🌸", "sunil.basfore.sb": "Get well soon dear 😘💕", "oldpalaces_newroads": "You always wanted this. And believe the decision u made was the best. Obviously there will be times when the process of recovery myt take a toll over u mentally but yes, as ur dad said, its temporary. This too shall pass, u made everything happened wat u always deserve", "spidy_foodsaver": "Hey I don't know you but humans don't always get all thoughts straight.its a fight to see everything through the end....you can make it...the low points as you say will push you hard ...👏👏", "vidsistrance": "Congratulations. I’m so happy for you.", "bitchybhouni": "Congratulations and best wishes Trinetra :'D", "loweinair": "So happy for you Babe 🌈🌈🌈🌈🌈🌈", "suk6847": "👏👏", "__call_me_vish__": "Get well soon", "trippykatrina": "Congrats .....more postivity n luv 💋", "nsfwmihir": "😍😍😍😍😍😍😍", "shrubs80": "I am so happy for you.. God bless u.. Have a speedy recovery...🙂", "lgbt.teens.india": "😭😭😭😭", "goodfornothing_kalmady": "🙂", "meeee.410": "Wish u a speedy recovery,you wonderful wonderful woman❤️🔥", "what_an_ace": "More power to you, you beautiful human! Stay strong! 🌈🌈", "bare_feet_and_biscuits": "Good luck darling, you will look and feel amazing I'm sure as soon as all the crazy adrenaline and drugs and pain and swelling are starting to subside 😘❤️🤗💪", "mockinghawking": "Congratulations again. I am so happy for you. 😍😍😍😭 🏳️‍🌈🏳️‍🌈🏳️‍🌈", "whyamilike_this_": "❤️❤️", "appy_fizz_1995": "I know you are feeling a lot of pain right now. But just think of what you've achieved. When you'll see your fully healed body, you'll realise that this pain was so worth it. You've waited for this for so long. This IS going to be TOTALLY worth it. You are finally in a body that you've always wanted. You can finally BE YOU. Sending of love and good wishes your way!💖", "tcefrepmi_rrretsim": "You are too lucky", "trinz.xo": "getting those wings come out of the flesh is always painful but when u cover the skies with those colorful spectrum of colors all becomes worth it.... u r our powerhouse trinny 😘😘😘😘", "adrijabhattacharjee_": "Congratulations♥️♥️♥️♥️", "ankyitsme": "I’m crying 😭😭😭😭♥️♥️♥️♥️", "ankita_narang_": "Have a speedy recovery... So happy for you!!! ❤️💞", "_umashanker_": "Hang in there Trinetra. Two surgeries at once is tough, but it's over now and you can move forward. All my love. You'll soon be back on your feet.🤗🤗❤️❤️", "madhavsingh1105": "💖💖💖💖💖💖💖💖💖💖💖💖💖khush raho🙌", "run_the_style": "I am so happy for you. God bless you. ❤️ Lots of love", "amanrai625": "I hope you have a speedy recovery! Stay strong and we are always there for you ❤️❤️", "suparna_bh": "Tri....hang on...you are brave", "thepalettesofshikhar": "So proud of you Trinetra. Rooting for you! Stay strong and hope for your well recovery! Sending love and good energy your way! 💕💕💕🌱🌸🌱🌸🌱💕💕💕", "theyaminikamal": "500th like and 500th virtual hug♥️ Wishing you a speedy recovery xx", "makesomeshitupstupid": "Stay strong 💪", "aries.thirunal": "You've come a really long way in life, Trinetra! Don't let the pain dull your shine. Here's wishing you a speedy recovery and a wonderful life ahead. Continue being the awesome human being you are. Thank you for sharing your journey with the world.", "sunnykumar7351": "You stay strong frnd god bless u 😊", "ragzphotos": "🙏 for You - Be Strong - No recovery is easy - This to shall pass 🌹", "kritikabhutani26": "Love you loads 💖💖💖💖", "shreyapawarrr": "You go girl❤ Stay Strong🔥❤️", "lgbtwarsaw": "Congratulations to being trans women", "dark_dreams_11": "Stay strong girl. This too shall pass. And in the end, it's all worth it. ❤️", "aksshayy_": "Happy for you", "arushiaishwarya": "You can do it. Stay strong. So happy for you", "neha.rajagopal": "Congratulations beautiful! You got this!", "dr.siddy": "Everything will be counted. All these sufferings are path to new happiness.. biggest hug ❤️", "shilpakamath": "Sending you healing hugs for a speedy recovery 🤗", "roseliza_nheik": "💕all the love! Speedy recovery my friend!", "karmic27": "Sending all the love and power your way yet again! Have a beautiful recovering journey, my love! I know you CAN make it! 💫", "deeda_96": "❣️❣️❣️❣️❣️❣️", "sasha.lobo": "STAY STRONGGG❤️❤️❤️❤️"}