{"__call_me_vish__": "You are awesome you don't need to pay any attention to shitty people's words.......to be honest even I have heard some of them..... The most common one is that many people has said me is that \"you look normal\" i don't know what normal even means to them..... I am so pissed with guys that I don't even feel like talking to anyone....", "shivankurghosh": "THIS IS LOVELY. ❤️", "akshayyymathur": "@emerald.williams the fourth pointttt🤣😂❤️", "m3ghx": "❤️", "musicalmelll": "Prettyyy 💞💞", "apoorwahwahwah": "The caption tho!!💜💜💜", "____taran______": "Om gosh! just love love for u being pretty firm on your viewpoint 💖 and knocking some sense into dumity dumb dumb heads!", "panneerpayasam": "Wooooooorrrrrd💯", "rehansahab7": "U really look good ☺️", "the_stormfly": "3 though 😆 Yha .. although hatsoff in the life you are leading and turns out it is rough and bumpy roads ahead.. still you manage to drive through all of them and here you are .. 😙", "vishwarupa_21": "Beautiful 🖤", "ertan9181": "Sexyyyyy", "atinasequeira": "So very beautiful ☺️💞. Also 3rd on killed me 😂..... beautifully said 😭🔥🔥", "iamshadabaslam": "I have been on Instagram for, what, 6 months maybe. Seeing everything about the social media as one ironic involvement, this is by far one of my favorite posts. So much grace, power, sadness, anger, disappointment, confidence, acceptance on here - and self love, yes. I am glad this was in my explore page. God Bless.", "choconymph": "🔥🤤💦", "iamrodali": "@shatabdi_mahanta", "vinaete": "🔥", "rehmat1886": "Straight figured", "henrick.ricky7": "Sexy bikini body structure", "archie.gupta.79": "\"not asked to*", "nsfwmihir": "😍😍😍😍😍", "raghavendra072": "❤️❤️", "deep__beep": "I Love You😍, NOT for how You LOOK, but for how You THINK! Ma'am, I would have loved you even if there was a DICK poking out. Cause I DON'T CARE😍", "too_messy_for_being_positive": "Victoria models are shaking", "sharbanibose": "You're gorgeous!!", "durgagawdestudio": "Damnnnnnn girllll you smokin ! 🔥", "zainab_engineer": "The caption is amazing 💜💜", "somyax": "WOW CONTINUING TO SLAYYYY 💙", "thatduskydamsel": "You are so inspiring @ind0ctrination 💗💗💗", "mattianazz": "Your unique no matter what and thats what makes us different and beautiful...your urself and dont let anyone say otherwise...i love you always and very proud of you didi. Good luck and excited to meeting you again❤️❤️", "bpalma.01": "I know that feeling when taking you're first picture in you're panties ❤️ 🙌", "_anirudh_iyer_": "You go girl! 💜🔥", "siamaiyya": "You know what will be Shakespearean? You act in a play where your character starts out as a man and had to disguise as a woman for the plot twist. Make it happen!", "frxnkie_m_": "youre so frickin beautiful and so intelligent!!!! wowow!!! much love from the UK 💕", "adipangam": "You seriously look stunning ❤🌷", "rockyew": "Geek chic", "himanshu_bundele": "Ooo", "okaakash": "More power to you !!", "aishani.maz": "TELL THEM GURL! This is the trans agenda: empowerment and equality. We are not performing for anyone and we sure as hell don't need your back handed compliments in the name of acceptance. We demand respect and the same playing field. So proud of you!", "binz911": "Beautiful!!!!!!", "_don.nananana": "Woah🔥", "banerjie.ajita": "Love and power to you! 💛", "praveen17k": "awesome 😍🔥👏", "narayani_s": "Caption ❤❤❤", "anubhasawhney": "Gorgeous! And I'm so jealous of your slender waist... 😍", "asaleoftwotitties269": "For someone who claims to not read much, you can often be witty enough for two.", "alinaanil_": "😍😍 now that's what you call PRETTY 💯💯.. I'm so jealous ek tho sunderrrrrr and upper sa doctor 🖤🖤 you are inspiring", "jordy_ohno": "You are beautiful and that is all. 🌸", "babualina": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 girl you're slaying it", "gohilpria": "❤❤❤❤❤❤", "mrsahil68": "😮😮", "theluckybum": "Damn! You really amaze me with these posts! Like you take the shit, analyse it and throw it back! I'm soooo... in awe!! Well of you in general! And the stuff you've been through, and the way you share it. 🙆 #sorryforfangirling", "_.xipra._": "Beautiful.", "_the_only_crazy_minion_": "The caption🔥❤️", "wandering_dreamcatcher": "😘💗💗💗", "harshscorpion3": "Oh God. You really moved on.", "ashline_anto": "❤️", "vansoffthebinary": "\"Congratulations, you're probably heterosexual. How exotic.\" YOU RLY DID THAT 👏👏👏👏👏", "the.wifi.is.broken": "I used to say shit like the first two to trans women all the time and it took ages to realize how shitty it was. Ya look fierce, my love", "strawberrychaoz": "You look so damn good 😍", "himahekkbye": "I love the caption! But I love you more! Thank youuu for this!", "bxdxpto_x": "@victoriassecret isn't she serving the fantasy ? 💓💓💓😍", "properlypurple": "Omigod you're making me gayer 😄😍😍😍😍😍", "anu_radha_k": "Wow🔥❤️", "trishalah_": "👏👏👏❤️", "pridewear69": "🔥👏😍😙 you go girl!", "inappropriatelyyours": "the fourth point im screaming ur????? icon????? wow im-", "_imperator.furiosa_": "🔥🔥🔥", "adityagoushal": "girl you look🔥 the caption is something people need to read because it could be one is saying all those things with a good intention but these are offensive and aren’t actually a compliment", "tansquare": "I am so so so happy for you!!! ❤️❤️", "apporpoise": "Serving looks!!!! We love!!!!", "sunainapuri95": "I don't think I've seen more confidence or happiness radiating from your pictures. So thrilled for you! 💕", "vaishnavi.shanbhag": "More power to you sis 😍😍", "alizehxr": "Only all the love, light and positive vibes for you. I hope you're recovering well. 🌸", "samanvitha_bhagavath": "😍😍haawwt 🔥🔥🔥", "sasseshwari": "3. And 4. Meri behen khel gayi 😂😂😂😂love u 😍😘😘", "purpatter": "So happy for you! Lots of love! 💖", "simarjeetlamba": "Did I burn my finger double tapping this post? 🔥🔥 #CheesyNotEasy", "shreyapawarrr": "Omg the last point!! You should totally do both💕 Much love❤", "thecheesecakeproject": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "neha.rajagopal": "Dang sis.🔥", "shruthi_._._._": "A stunner 😍😄 So beautiful!", "prawnzuignorantslut": "AAAAAAAAAAA YOU'RE BEAUTIFUL😭😭😭", "chaos_and_disaster": "more power to you!", "drsamanthamason": "Yes girl, there are a lot of idiots out there that need to hear and “listen” to those comments!! ❤️", "ankita_raisinghani": "Love this caption. Way to go !", "kartick_007": "This is my favourite post so far! More and more power to you. You're such a fierce and graceful woman! :)", "jellyintheskywithdiamonds": "You're a force to be reckoned with :') Very inspiring.", "middlemarchmoon": "OMG this. You go, girrrlllll❤️ love and power to you 🌈", "lanaahsi": "I'm so happy for you. More power to you sis. I'm so proud of you for all that you been through. Finally u been smiling. Oh my god. Bless u😩😩♥️♥️♥️", "lingamharagopal": "👌🍻🌩🌩🌩😍😍😍", "sumehdha": "Yass. You're so perfect. Brb gotta cry.", "ashfakh__": "❤️"}