{"femanusha": "All the best dear 👍🖖", "what_an_ace_": "Sending you love and strength. Good luck with the conference :)", "devanrk79": "❤️❤️❤️", "dsouza_ani": "Good luck❤️❤️", "dr.aqsa.shaikh": "Go Trinetra Go... Speak your heart out and it will reach the hearts of the audience.", "guacamoleee16": "All the best! ✨", "kebab_abdullah": "All the best trinetra!!!!", "oftrailsandtales": "Good luck :)", "meeee.410": "You are so gonna rock it 🤗❤️", "kar__annamalai": "All the best!!", "britts_marts": "You got this trust me .You'll Do Great ! 😘♥️@ind0ctrination", "chefplatedmanipal": "There is good fear that motivates and bad fear that devours people. You seem to be gripped by the former never to succumb to the later! You have a legacy to build based on doing many things that scare you...you may fail sometimes, but for all the battles you lose; you WILL win the war! God bless!", "frincel_lobo": "Good luck ❤️❤️❤️God bless 💖", "madhavsingh1105": "Best of luck👍👍", "saaahill.027": "I trust you, you will definitely rock the show💯🙌😇", "now.is.the.living": "Sending lots of love and prayers your way❤️ Nothing pure of intention, that comes from the heart, can be construed as messing up. 👐 You will definitely rock!😌👏💥", "moo_px": "Hope it goes well for you sweetheart x", "mizarcle": "Hey, I heard you talk today and you were wonderful. I know that it's important to tell yourself that there is space for you to screw up or that you have prepared enough and won't screw up but as a person that just met you, you were amazing", "contrapuntally": "You were absolutely fantastic. 👏🏽👏🏽👏🏽", "vansoffthebinary": "we believe in you ❤️❤️❤️❤️ you're gonna do great!!!", "joslindalmeida": "All the best...", "lightermachis": "Good lord, you're beautiful.", "mickyarya19": "All the best diii❤️❤️❤️❤️", "oh_hi_rose": "I wish my liner could look this good! Teach me sis😍😍😍", "arudravavilapalli": "YOU GOT THIS ♥️ YOU REALLY DO", "4dityanarayan": "I'm neither of the two communities, and you've floored me right from when I got to your account. My prayers go with you all the way. You're an inspiration to me, and I can only imagine the number of people who've found their voice through yours. You're gonna rock this, and you're definitely not alone :)", "mirror.lexi": "You're one of the most amazing and inspiring people I've ever talked to and I'm sure your talk will be amazing!", "sowmya_srikrishnan_mrs.k": "You will be at ease when u speak... Trust me... It will just flow..sending u hugs and kisses.. When I tell u what ur going to do tomorrow is life changing, I mean it", "adityalicious": "Kardo pagal okay?..", "siddharthbaxi": "Best of luck 🤞", "_umashanker_": "All the best Trinetra! You'll do just great♥️♥️♥️", "nithya.sri": "😋", "dreaming_about_luna": "You're already effortlessly magical, Trinetra. You'll represent both these communities perfectly just by being yourself. ❤️ Good luck!"}