{"faiz_firoz": "Wow ..... congratulations 😋👌🔥❣️", "_apoorva__": "I'm following you for a while now and reading everything you've shared here and am in awe of you. Totally! It's so, so positive for me and opening up to your perspective on things is broadening my own perspective in an amazing way. You're your own person and I love you for that. You're really strong and it's also very contagious, I swear. Big hug to you 💖", "blissful_banjaran": "🖤", "not_a_c": "Hell yes 👏👏👏", "dhw.ani": "and please write a book i'd buy as soon as you release it 😩", "capriciouslyyy": "More power to you !! 💗💗", "dal_khichdi_": "Wow!! I felt this..", "lookbeyondlooks": "I have so much respect for you 🙌🏽🙌🏽", "cgfeminist": "We Stan a strong woman 👏🏾", "rosethoornn": "Yes slay queen", "nostraightlinesoverhere": "❤️❤️❤️", "mahua.ghosh": "Well ....the Bald was also Beautiful ❤️", "postcardchronicles": "More power to you 😍😍", "ay.esha9252": "I guess you should start a youtube channel and tell how u transitioned and stuff to help others like you...", "_ambikaaa_": "You’re so beautiful ❤️ more power to you Trinetra✨", "krit.anjali": "You are such an inspiration 🙌❤️", "avikamalhotra0234": "But really shocked", "apusstate": "Thank you for your courage, truly.", "nuwu.u": "Your journey has been meaningful. You’re here now, and your existence is so magnificent. I hope you’re proud of yourself, because I am💖💞", "_aakankshaa": "@aanchkebab she is so inspirational", "archie.gupta.79": "More more power to you lady 😘", "manushribhat": "You are one gorgeous woman 😍", "biffandi\nVerified": "Verified", "ironically_ahsan": "Perfectly summed up. The trans life", "heyyutkarsh": "♥️♥️", "haru2485": "Hugs 🤗 I can’t even imagine what you must be going through. Take care!", "therealdebanjanroy": "my heart ugh", "_atheetha": "Tears", "nobodyaskedsangti": "You look beautiful either way!", "mc.gone.gal": "\"A hundred haircuts,a hundred deaths \" WOW", "thescatteredartist": "You look sooooo beautiful!! 😍", "payal_bathija": "❤️", "graveofpersephone": "👏👏", "aakriti.pandita": "@natashanoel001 i think both of you would get along well. Two amazing women who are breaking stereotypes and inspiring so many in their own way", "radhika.py": "More power to you.", "dr.aqsa.shaikh": "Well said Trinetra. Can relate with it completely. We are so pushed against the wall, that we have nothing else to do but to embrace the wall and kick back. We are all turned in to rebels this way. And each day we raise our head proudly out of the deep shit and shout, \"Bring it on! \"", "rahul_1.618": "❤️❤️❤️", "karwana_e_faiz": "Proud of you. 💜", "now.is.the.living": "A hundred haircuts, a hundred deaths. Damn.", "pseudostars": "❤️❤️❤️❤️❤️", "raidentail": "🔥🔥🔥❤️❤️❤️", "iamshadabaslam": "Even if one person, after seeing you flourishing in your own way, after dying million deaths with every forced haircut that you got, and not feeling safe for years, even if one person could find it easier to unlearn a lifetime of pain and alleviate the pain of letting go, it'll all be worth it, inshallah. ❣", "gayatribhatnagar": "So much respect and admiration for you. 🙏🏻", "mohibaurooj": "I've been following for quite a while now and each thing you write impacts me. You convey your thoughts with just the right intensity. Wishing you all the love and happiness. :')", "onlypavithra": "This is how it is when Truth gets a face!💥", "shambhavi.shastri26": "So proud of you. More power to you and everyone going through all this💕", "irrashinal_": "And ur hair,donate pls", "a_u_r_o_r_a__": "You're so beautiful! Loveee and power to you ❤️", "badasswomxn": "Shine on, princess 🔥❤️", "thebarodababe": "You're fire and ice both 🔥🔥❤️❤️🔥🔥", "muse_by_mathu": "all support 2 u and ur voice...fight hard...will pray for the courage...", "ananta_bora": "You write beautifully ❤️", "karmaholic_ta": "Super proud of you! And my my you're only getting prettier by the day:)", "darling_dips": "You are strong & beautiful❤️", "aishani.maz": "Fuck yes!!! This is accurate. Our transition isn't a sport like many treat it as. They are fascinated with the transformation, wardrobe etc but the real transition happens inside as we let go of the self that felt mutilated with the years of trauma finally able to breathe and show the world who we are. Love you babe!!", "phogatbaby": "😍😍🔥🔥", "adabutnotlimon": "Thank you for your courage, always.", "nehasumitran": "💛💛💛🍃"}