{"thecheesecakeproject": "Sigh.", "trinz.xo": "as long as doctors r saving lives the masses shud not expect anything more from them.. after they r also human beings... and who knows maybe this realisation of being empathetic and valuing human emotions more sensetively will bring some change in the procedures and the overall system by time... but till then m sure we r grateful enough for life saving angels like you 🤗🤗🤗", "madishree": "So glad I followed your profile! I have always wanted to listen to a doctor speak their side of the story. You all truly see the worst. Thank you for sharing this with us!", "akkshiita": "@priyanshi.mehra", "jayychak": "@outofmydepths my respect and love for you quadrupled while reading this post.", "taaniyarora": "Thanks for sharing this.", "t_h_e_p_a_t_i_e_n_t": "😍😍😍😍😍😍😍😍😍😍😍", "anny.singh_02": "You are stronger than most... You will make through it", "kas_roy_bardhan": "You are so brave for fighting your way through this!! Respect! ❤️", "nitin_19t": "Beautiful looking😍👌", "amazing_shopping_centre": "Nice", "khushisingh.25": "@ind0ctrination so i saw saloni chopra's story about you and so i checked your profile and tbh, right now i am so fuckin overwhelmed and so filled up with this positive vibes from each of your post. And damnnnnn girl you sooo aesthetically beautiful.😭😭 i love you❤️❤️😭", "janavii16": "can you please do an eyeliner tutorial? 😍😍😍", "amisaraaah": "Eyeliner on fleek 🔥🔥🔥🔥", "ruchi_parmar": "My greatest fear is turning into a de-personalized, bitter person I am starting to see in the mirror with each passing day in the hospital.", "fearlessly_authentic09": "I couldn't agree more!! Well said! It's always with a want to make the world a better place we join med school in the first place...but the realities are crazy harsh!!", "mickyarya19": "I love you diii most 💖💖. You are my inspiration 😍😍😍all the best", "2wheelzforever": "To all those with \"looking beautiful\" comments just read the fuckin caption😑", "sunny.singh358": "Hi dr im shree patna i aslo want change my gender bt the problem is this ki i need ur help will u help pllzz say ..rply me in cmnt", "iam_ur_crush.1321": "Love you my babe u are my inspiration always ❤️❤️❤️", "ameyahemmady": "So beautiful in all your pics Trinetra. You are growing prettier with every post 💗", "sayooni_": "Really hoping you'll make it out without turning into one of 'them'. We have faith in you. Please try and turn the tables. We need more trustworthy docs. 💛", "anvita.ahuja": "I have my final University anatomy practical tomorrow and I spent the past couple of hours reading your captions b'cuz I discovered your profile today. I still don't have any regrets. Every second spent on this page was worth it. This page is more educating about the profession than any teacher at any medical school can ever be.", "murchanaburagohain": "U r damn beautiful 😍...more power to u 💕", "thebarodababe": "This is so true... While working in a civil hospital , there is no time just because of the workload , doctors are bound to turn to numb humans", "_umashanker_": "Sighhh", "dhw.ani": "you are such a strong woman ilysm 💖💕", "earthtoianna": "Can't believe how people can be like that still", "punsexualnomad": "Damn.", "sainipeyush": "You look so pretty :)", "specialspoon._.87": "😍😍", "sakshimehra12": "@eeagerbeeaver", "apoorv_singh_asr007": "this is heart wrenching 💔", "nofiltersnina": "@laureencm what you were telling me", "joleneannfernandes": "Love and strength to you Trinetra", "dirtycaffeinater": "Completely agreed.", "nooshanusha": "You reaffirm my faith and give me so much hope that there is enough good in the world if one's is willing to find it. Sending love and light to you.🌼", "shobhana93": "It's beautiful and reassuring to see a budding medical professional be mindful of one's journey. ❤️", "kohliashita": "You know I had the same point of view during my mbbs. In internship I saw the other side. Being engrossed so much in death, the impending doom, diseases and poverty all around you it's sometimes necessary to have a cold heart to survive. But yes, I do agree with your point. Having humanity is what describes a doctor but at the cost of your own survival? That's a question I'm still seeking an answer to.", "___________eto___________tanya": "Wish u a best of luck b devoted n happy with ur choice sis", "vasundhara_naidu": "👏💯😍", "madamobese": "Watching pwople suffering upfront. And still giving them one sort of hope is is nothing relatable to other side of the world. The kind of mental situation you go through and still keeping yourself together is the kind of strength that is needed. I don't even know if luck works, but if it does, it belongs all the the person and to you. Thanks for inspiring. Love!", "shreya512": "I read about this in Paul kalanithi's book When Breath Becomes Air. He faced the same. Maybe reading his words will help?", "palki_hatangadi": "Well you are made of stronger and braver element than most. So luck and love to you. And max we can pitch in is to have a more sensible and empathetic next generation", "adabutnotlimon": "I'll never get tired of saying this: I love you too much, and I'm so thankful you exist in the same time as me.", "ankita_raisinghani": "There is no way but to switch off your emotions while at work.", "emmlinna": "You look so beautiful ❤️❤️", "nithyaa_g": "you're going to do just fine 💕"}