{"______anaa______": "Awww beautiful kid ❤️", "apusstate": "This is so touchingly articulated, I have tears in my eyes 🌸❤️", "ankita.maddi": "Much more love and power to you @ind0ctrination ❤❤", "shweathing.itout": "I am touched by the kindness that you are publicly showing yourself that you so truly deserve. I hope your pain heals and there are days when you sleep with a smile beneath the sky. There are assholes in this world who communicate brutally in violent ways. I hope you create a safety net for you during tough times. I am always inspired by your way of seeing things in life, by your courage, and by your vulnerability. I hope these strengths stay with you in your journey. Wishing you peace and love ❤❤", "properlypurple": "Thank you so much for writing this 😭😭💜💜💜💜💜🤗🤗", "sharlicheen": "I just want you to know that everytime that I'd feel like anything happening with me is sad or out of place I'd think of trinetra. I would think of what a beautiful woman you have become. You would inspire me for so so long. I thankyou and millions of others like you teach me so much more than i thought i knew. So much love to you❤", "darts_in_the_sky": "Hii I've been following you for quite some time now. Your posts are extremely positive and empowering. I wish you all the love and happiness in the world♥️💯", "samclouder888": "You're amazing. You went through so much and came out stronger, kinder and just as beautiful if not more.♥️♥️♥️♥️", "payal_bathija": "It gets better :')", "__an.and__": "You're an inspiration ♥", "ratchetaffirmations": "♥️", "sowmya_srikrishnan_mrs.k": "I'm. Going to save this post... It gives me hope and peace", "iamfakeskillz": "*hugs you virtually* ♥️♥️♥️", "dhw.ani": "you just inspire me to love myself and people around me SO much and it's true, you ARE a goddamn rainbow and i'm fortunate that all of us are getting to see your colours 🌈❤ love you forever", "yajnaseni_": "I came across this post in the morning, but I chose not to read, as I knew that it would be a disturbingly difficult read. But I could not resist my temptation to read it. This brought tears in my eyes. I felt as if you were speaking to my 15 year old self. It's saddening to come across people who share a heart-wrenching past that's common and familiar on so many grounds. Wonder how many more children will lose their childhoods to this hetronormative patriarchal society! We can't change our past, but we can certainly work to ensure that no child gets subjected to the tortures and atrocities we were once subjected to. BTW you look very cute in this picture of yours. You are a beautiful person. :)", "gdhungana": "❤️❤️❤️", "art.soopified": "Lol she can win the spell bee", "royal_kingboy06": "🙏🙏", "chinmayeekuber": "LOVE YOU SO MUCH! ♥️", "jainriddhiman": "Hi Trinetra! Please। check your DM!❤️", "_seema_rawat__": "Beautiful soul who is inspiring many others to live their life on their terms 😘", "_vikas_katoch_": "Come to daddy", "akash.narendran": "Thank you for this love letter to yourself.", "arunima.chakraborty1996": "You are an inspiration! @ind0ctrination", "rakhigautam99": "YOU ARE AN INSPIRATION. MUCH LOVE TO YOU❤️", "freaky_reader": "These are the kind of words that make an impact on scared credulous minds. The kind of words everyone needs to hear every once in a while. The kind of words that splashed my insides with peace today. Thank you so much for sharing these words. 🏵️", "nezreen_ashraf": "Seeing you transform to this beautiful woman who fought against all odds, got through the tough times and still managing to wake up every day, believing that Today would be different makes me wanna be more stronger n positive like you. You inspire me.❤️ Much love and God bless.", "amyra__007": "This post breaks my heart😔❤️", "mickyarya19": "Love you di . 💖", "iamoliviadeka": "I couldn’t help but find my heart so full of love for you Trinetra. This is one of the best things I read today. More power to you. You’re a ray of hope to all those 12 year old struggling to fit in and questioning themselves. Losing their confidence and self esteem as days as days pass by. I hope they find you, they see you and they can see that they have a beautiful life ahead waiting for them.", "iwittyness": "The 5th point is my favorite! 😍", "shwetavaidya17": "Thank you for this ❤️", "mridula_swaminathan": "This letter is beautiful :')", "middlemarchmoon": "It makes my heart sink to know what 12 year Trinetra felt, I can't even begin to imagine how it must have felt. :( But, also I'm so so proud of the inside-out beautiful woman Trinetra is today. And, also of her strength to be vulnerable, facing and battling the world like a warrior. SO MUCH LOVE AND POWER TO YOU ❤️", "_himaya__": "Huge respect!! 🔥", "an_artistic_ailurophile": "I'm crying 😭 this post is so emotionally strong and so much inspiring.i hope God gives you more strength and power 😭 and we all love you and u shall never care what the world would say to you 🙏", "hetalvaya": "All power to you 🖤", "_prajnagangatkar_": "More power to you, you beautiful beautiful being🌼", "specialspoon._.87": "You're an inspiration", "iscareguys": "What a beautiful person", "sumehdha": "6. You, your life and your story inspires each one of us to hold on, fight for what we deserve and love ourselves despite our flaws. Our society never fails to disgust me but you never fail to amaze me. You help us to be strong enough to face our problem with a strong mind and brave heart. You make us realize how petty and trivial our \"troubles\" are and how much we crave for materialistic things when there are people who don't get the basic \"privilege\" to be called human. Hats off to you and your journey and I know that twelve year old is so proud of you. You're one of my biggest inspirations. Keep doing what you do and I'm sure one day your happiness reaches heights we can't imagine 💙.", "pavithravenkatagopalan": "@ind0ctrination - what's the legal procedure to change your name? I hope you'll have a beer or two the day your college changes your name in its roster", "forevermad03": "More power to you ❤️ this is so emotional", "trinz.xo": "ishhhh kandali tohhhh 😘😘😘😘 oh maaaaaaaaaa... thanks babe for this plz show me a way to post this on facebook", "sahida_apsara": "I am in love with this sacred narrative ritual of writing to your younger self. I have spoken to my little self many times but I haven’t written a letter, so you’ve inspire me..I’ve experienced something similar with childhood sexual abuse and violation.. would’ve been so healing if our younger selves had pen pals that they could’ve confide in..#inaparellellife", "wali_rahmani": "Very cute 👌", "anubhasawhney": "🤗🤗 gorgeous, then and now!", "itsfine.imfine_": "Holy fucking shit . I fucking love you . I respect . YOU'RE AWESOME", "mockinghawking": "This post is so awesome and intriguing", "neelam_0_8": "💓", "_doodlum_": "Love and hugs ❤️", "_umashanker_": "🤗🤗 I wish I could've been there for you ♥️♥️♥️♥️♥️♥️. I talked about you all the time, totally unaware how unhappy you were.", "amymehta_": "Beautiful soul you ❤️ It only gets better;)", "daddydranks": "💜 beautiful", "muskans8_": "You're a braveheart! ❤️", "afshan.fathima": "Brought me to tears. So many emotions and struggles for a 12 year old is too much. We live in a society where one of the above stuff comes to life even with the females and some males around. Your post gives these people a strength, a vision and a hope for a better tomorrow. Keep doing what you're doing. You are one amazing human and no one can put any labels on that. Lots of love and cheers ❤️", "nikisridhar": "🧡🧡🧡🧡🧡🧡🧡🧡", "_m.e.l.i.s.s.a.a.a.a.a_": "❤️", "flying_dutchmen_nadeem": "lovely Smile 😊", "musaafir_diaries": "You're an inspiration", "anusha0101": "OMG.. your innocent smile is the sweetest.. love love love and more love to you", "pranithahaha": "I love this so much"}