{"naumanahmad.6398": "Awesome", "_atheetha": "Thank you so much girl!", "forktoyoursoup": "So much love and power to you ❤", "vishitdidnthappen": "Brave woman", "kashifsharkhan": "😘😘😘😘😘😘😘 so hot 🔥🔥", "bisht_misha": "Let me tell you sister.. You are perfect in every way and you are beautiful in your own way.. I know the world is full of ship people let them be straight or cis but you got it sister💓💓", "wanderlust_ink": "The caption stole my heart. More power to you ❤️", "211sksksandioop_": "YOU'RE A QUEEN AND NOTHING CAN CHANGE IT! FUCK THEM 💕", "uir_aa": "Massive respect for you 🤗🤗🤗", "being_roman1994": "Please don't😻😍😍😍😍🙊", "anubhasawhney": "You are lovely. And very very brave for baring your innermost thoughts, fears and doubts. Lots of love and hugs..", "lostlove.e": "Sexy", "praveen17k": "damm hot", "laal_salami": "@sampikay @abhinavsingh101_ in continuation of what we were discussing today", "te_justlife": "Wow 🙌", "_boroe_": "❤ you're beautiful the way you are", "sagargehija": "uh look💯🔥", "barelyswati": "Breaks my heart. You're so beautiful. Lots of love and a big hug to you ❤", "nsfwmihir": "😍😍😍😍😍😍", "khan_waliullah12": "Nice", "rums_n_raisins": "❤️❤️", "aadil_qureshi_91": "Supeb", "mantasha0107": "I wear US 10 shoe size. Does that make me less of a woman? I am what society calls a \"woman\" I don't know or intend to know how to cook or do household chores. Not very womanly Hun! We women don't come with a sign that says we are supposed to be petite and good at household work or any damn thing! If you don't like certain parts of your body it's your choice. No one likes everything about their appearance. But that doesn't mean you're any less of a woman!", "shramika_soonthodu": "Night", "kanmaniray": "I remember saying this to my therapist today, who asked me, \"what do you want to do if you forget everything that is going on with you right now\" . I said, \"I want to pass off as a woman\". This absolutely resonated what I felt at that moment when I said that. Immensely proud of you & thanks for being there. Thanks for writing this 💜", "sarfarazalizafar": "wht iz thizz ..whtout wearing oooooo no", "immortal_asshole9666": "I struggle with the small side if the spectrum. Since there is a joke about hands and feet being the size of a man's penis I do get a lot of slack from people (some I don't even know!) Some days are worse than others with dysphoria, but I try really hard to stay positive. You seem to do the same, that's why it's always such a blessing to see your posts! You seem like a very strong woman, and you're amazing to follow. And thank you for sharing all you do, I'm a trans man, it still gives me hope that other trans people can be happy, positive, and be who they want to be. Much respect 💜", "activisthood": "I'm a cishet and I cannot be more privileged. I'm so glad to be able to read this. I'll never experience what you're going through but I now I've read about it. Your struggle is real and you and the trans community matter. Your voices will not go unheard!", "sowmya_srikrishnan_mrs.k": "Hey girl.. What did I tell u the first time I dm'd you.... U have the most beautiful features... Lakshanamana face...", "wherearethetuurtles": "More power to you. 🖤🖤", "ukip_95": "@ind0ctrination may I please know the name of the documentary.", "trishalah_": "Love and strength, always. 💙", "sruthx": "I have so much respect for you, for going through what you do every single day and choosing to remain strong despite all that. Your posts are so freaking beautiful and inspiring to read. Much love to you❤️❤️", "agirlofherwords": "Sending love.", "professor_charles_xavier_1895": "I see you. And I totally get it. On days when I feel so dysphoric that I would practically cut my chest off, I look at old pictures of myself. I don't have access to hormones. So my face hasn't changed but I work for my body to change. When I see my real self compared to my old and suppressed self, I feel less dysphoric because I did something, no matter how little, to change. I see you. I force my voice lower on the phone, I avoid men's restrooms and hold it until I find a family bathroom, because I'm terrified. Truth be told, I don't pass. I look like a butch lesbian, so I avoid areas that are mostly populated with men. I constantly worry if my chest is flat enough, and I hope to anything that's out there someone doesn't recognize me. I see you, hon, and I know. Stay strong and fuck society's standards of how we should look.", "fotogs.andy": "Beautiful", "rakshithaarni": "@swamii96", "nitin_19t": "So beautiful😍👌", "_aradhana098_": "@ind0ctrination everyone has their own shit to deal with. Society doesn't spare anyone. And you outshine everyone. So proud of you and what you do. Keep inspiring beautiful. Stay strong stay healthy❤️", "oh_hi_rose": "I would have fallen in love with you had I been a guy❤️😍beautiful ! Btw I'm still in love with you🌻", "properlypurple": "Thank you so much for sharing this 💜💜💜😊", "mallika208": "@instagrapher89 @owl.sharma", "nooshanusha": "I love you and I look up to you. Thank you for all your strength and resilience. Sending love and light to you, Trinetra. 🖤", "transxmafia": "Wow.... Reading that just made me realize something so obvious.... I never saw my dysphoria as something that was related to the \"standards\" this society forces on us, even though it's plain as day!!! So technically, if this was a loving, open minded, non-gender conforming society, then I wouldn't have any dysphoria.... I would have grown up loving myself for who I am!!! 😐", "ind0ctrination": "All your comments truly warm my heart. I make sure to read every single one of them. Thank you. ❤️", "whadafaquwant": "The story of a happy face!🔥💕", "hamsabalagurunathan": "💞❤️💞❤️💞❤️💞❤️💞❤️💞❤️ HUGE AMOUNT OF APPRECIATION AND HUGS AND LOVE YOUR WAY GIRL❤️", "paglichef": "@ind0ctrination i think you are perfect!", "wewake.up": "This is so beautifully written❤️❤️", "a.chaotic.masterpiece": "Beautiful as always❤️", "ranti_dev": "👏👏More power to you!!", "anamika_sudhakar": "More power to you for sharing your personal experiences and life with all of us via your captions. You're so strong and beautiful. I can't even imagine the amount of courage it must take to write all this, just so that others also feel they can share their experiences as well. Thank you for all that you're doing. You're an inspiration.", "oldpalaces_newroads": "I really want to meet you and document ur experiences largely representing the trans community in my research work. Can we?", "aisha.a.mapara": "@sayanib this is the girl I wanted you to follow.", "alchemist_dr": "You have so much courage and admire your mental strength. We could learn a lot from. Wishing you more power😊", "_.prusti._": "This was such an enlightening post. All my love and more power to you ❤️❤️", "mous_sur_latour": "@burns_in_the_chills_of_ice", "too_messy_for_being_positive": "I came into comments section with sword lol", "sana_omfg": "How beautiful are u 😍", "hyacinthsreya": "Love your strength girl❤", "lingamharagopal": "😍😍😍👌👌👌💥💥💥", "shar7am": "Thank you 👏", "nancy_nayak": "Thank you for sharing this Tri 💓 makes me reflect.", "irettaivaal": "I was always a tall big girl and I have a voice which is now popular as husky but was hell when growing up when kids in school would bully me for it including some teachers . Now am not saying how we have had the same issues ( absolutely not since I have not faced even one percent of hate you may have ) and every bank call telemarketer calling me sir ! I completely feel where you are coming from . Sometimes incorrect them but yet . We must strive hard to break these norms . And Am here talking from the Cis perspective and even then they are sorry excuse of people !!!! I'm so glad you wrote about this ♥️♥️♥️♥️ sending you love", "lissa.comm": "You're amazing 🌹", "snape_and_the_forty_thoughts": "I know saying you’re so brave here doesn’t instantly translate into a complement. I can’t imagine the daily struggle it must be for you just to be seen as a human and feel the same. And I am sorry for that. You’re only as different as any two humans can be, no more no less, it’s us who are shallow. To have to be brave about things which should be so basic is a shame. Reading your post did something to me. I am not an unkind person but I’d be lying if I say that i don’t feel a little bad for someone when they don’t immediately fit in. That isn’t sympathising. That alone suggests I don’t see them as equal. And I am deeply ashamed and sorry for that. But I am trying, and you’re awesome. 💛💛", "arushisc": "You are fucking beautiful. Fuck them up.", "izanagijuly": "I’ve been having a hard time with this due to the fact that I haven’t had my hormones in months due to money problems. People call me she and her. People take double glances because I refuse to cut my long hair to make other people around me feel comfortable. I’m trying to use this time to reconnect with the feminine aspect we all have, so I may hold onto that part of my strength. But I will admit it’s hard. I’m in fear for my safety always as we all are. Being open and vocal can be dangerous but it’s also so important. It’s a shame that our rights and our lives are always in jeopardy. Thank you for speaking out, I wish the best for you and for all of our trans family members. We can find strength the more we come together. You’re an inspiration and a leader to our cause. Thank you sister 💜", "janavii16": "You’re an lgbt+ icon sis! ❤️", "sakshi10101": "You are absolutely amazing! ❤️", "eshabahal": "Sending lots of love 💖🌻", "raidentail": "🙂🙂🙂", "sasseshwari": "Ur legs are long sexy!!! 💖 u are a tall beauty!! 😍😇", "samclouder888": "Keep going. You're such a strong woman and one day(let's hope), you'll completely be free of dysphoria.💯 More power to you 💯", "trinz.xo": "omg so true ... this seems like one tiring unending battle with the standards... thr amount of scanners that we go thru every day is unimaginnable... we are what we are... and yes no matter how much tiring it is we will get back up and rise everytime... #fukcisstandards 🤘🤘", "antara_munshi": "More power to you♥️", "shwetavaidya17": "It does help. Thank you 😘", "ishaanbhardwaj": "Big hug sista🤗 and yes fuck CIS standards", "specialspoon._.87": "Beautiful❤️😍", "wanderwomandee": "@shobhit_k - relevant to our discussion yest @spacetimecake - jus coz I like to share everything that touches me 🙂", "karwana_e_faiz": "Power to you, my favorite girl. ❤️", "dikshabijlani": "this breaks my heart. love & hugs trinetra.", "ankita__pattanaik": "Learning from you is a blessing. More power to you darl.❤️", "xoxodisappointment": "You are fucking gorgeous no matter what people say or think about you !! Fuck cis standards ."}