{"antara_munshi": "More power to you💕", "____gelato": "how beautifully written. more power!", "tattvamasi666": "Happy pride month, youuuu! Sending you love. 🌹💕", "himani.mitrolia": "I'm falling in love with you day by day. Keep moving. You're a warrior!💚", "isheetazzzzz": "You're absolutely beautiful , inside out . We love you❤💫", "swati_diwadiya": "inspiration for many who are struggling to find their place in this society 🤗", "gujaratlgbt": "Always beautiful", "pritigaikwad777": "That Caption🔥", "aparnashandle": "Salutations 🙌", "ranbeersawhney333": "🔥🔥🔥🔥💋", "armayankrajesh": "Caption 😇", "emmlinna": "Why you are so fucking sexy❤️😢😢😢", "henrick.ricky7": "Sexy soft boobs", "shubham_kaushik_1": "Bhai kya bakchodi hai yei 😂🤣", "jaichauhann": "Wait ✋ Which operation ma'am?", "rashida.prvn": "You're such a beautiful person, don't let Bd Chaurasiya's restricted human anatomy texts define you. 💗", "_brownotbrown": "@ind0ctrination I'm so very happy for youu😍😍😍🥺😭", "nihal_otu": "hot", "nsfwmihir": "😍😍😍😍😍😍", "aadil_qureshi_91": "Wow", "_srv_islm_": "Damn hot 🔥🔥🔥🔥", "the.satanic.saint": "Does the piercing hurt when someone pulls it? @ind0ctrination", "aditya_gupta1996": "Wear stocking", "dhw.ani": "listen, stop making me fall in love w you more and more each day, i'm running out of love 😤", "nandini_0201": "More power to you girl🔥", "apoorvabora": "You're amazing. Thank you for saying this. Some days these are the words that lift you up. And as @_umashanker_ said, you're exceptional! 💛 Sending warm hugs and positive vibes your way!", "desidarklord": "I'm so happy for you. More power to you! 💙", "khushoe_": "QUEENIN' LIKE A PRO 💗", "lostlove.e": "Ur too sexy miss", "prernas_reflections": "Sending you hugs and strength! <3", "sarfarazalizafar": "whttt is this", "hootyandthescalesofjustice": "💗", "vaisha_93": "bold and beautiful", "lonehunter03": "Do u live in Bangalore ?", "little_things_from_g": "Ok first of all...Dayuuummmm !!! Looking good gurlll 😊 You are so inspirational to many, both to those who have transitioned and to others..to really open minds and be body-positive :) 😊", "navleenhopes": "More power to you woman @ind0ctrination you inspire me, and many a thousands ♥️", "shramika_soonthodu": "I want you to write a book or a chapter that enters the medical textbooks🤞", "maniiarora": "Really can't imagine the strength and courage you must have had to become the person you are after going through so much. I can only wish to be this strong. You really are an inspiration", "6nidds9": "🔥🔥", "___gardenofeden___": "Your captions - the way they pen down thoughts so sly and wispy into tangible diffusible magic to the reader is sublime. Your captions are proof that with words, humans are capable of magic. ♥️", "sakshriyan": "How's the post op pain", "ironically_ahsan": "Just something sexy about tits and glasses", "earnofff": "So you might be craving something big in the new comfort place", "mister_shetty": "Calling 911 🔥🚒", "unnatirajput": "Wohoo what an amazing caption 🔥 more power to you trinetra 🌻❤️", "khurdura_chinar": "This is beautiful :')", "gaurilogy": "beautiful soul you are. much love😘", "art.soopified": "#HappyPrideMonth 🌈", "sidharth.ramesh": "So happy for you that your transition is coming along great!", "_umashanker_": "You're not an exception. You're exceptional. I'm so glad that your relationship with your body is getting better. More power to you!♥️♥️", "smriti.s08": "❤️❤️❤️❤️", "roshnigrace_": "You go girl! ❤", "raidentail": "Elegant.", "aishwarya_jumde": "On fayyyyya! 🔥", "amonajourney": "Trinetra, much love and more power to you for being so candid about your feelings. 💙", "butribum": "More power to you. Sending dher saare good vibes your way girl ❤️💜", "clairee.jjacob": "woop woooopp!!! I'm so glad everything is well and you feel and look like who you truly feel you are! I can't even imagine what you were feeling and yes it's so stupid that there isn't more in textbooks and in education about the trans community, sexuality and LGBTQ+ in general. I love your page it's so illuminating yk? thanks xo", "ameyyazing": "🔥🔥🔥🔥", "fool_gurll": "Much love much love💖💖💖", "sushmitaasharma": "You are beautiful inside out! I love the way your mind works. 🔥😘", "ratn_divyanshi": "So happy for you.", "theferass": "You have no idea how much positive vibes you send out to the world , making it a better place. Stay blessed :)", "ramypower97": "Thank you so much for doing what you do. You really do put out much needed positivity ❤️ so very happy for you", "__shru.tea__": "This was so heartfelt, more power to you❤️", "a.chaotic.masterpiece": "❤️❤️❤️❤️", "nitin_19t": "So beautiful😍👌", "lilknitty": "I'm so proud of you! My heart swells with joy for you! 💖🌸🙌", "_.pawyall._": "@ind0ctrination this is so well written! So proud of you and happy for your recovery. You've got a body to flaunt, girl! ❤😍💯", "artwalahoe": "OMG you're beautyyy💕🏳‍🌈 happy pride month", "karwana_e_faiz": "More power to you, braveheart!", "dr.aqsa.shaikh": "❤️", "snugglesnatch": "You are so beautiful🌸", "pratikshaggarwal": "THIS IS THE BEST THING I'VE READ TODAY. MUCH LOVE AND POWER TO YOU. ♥️♥️♥️♥️😭♥️♥️", "ladyminerva8": "Proud🔥", "afshan.fathima": "Better late than never. Take care of yourself. Lots of love to you. May the god almighty bless you with all the strength you need. You are not an exception but a beautiful part of the nature. You are a ray of hope for many. Your words are an inspiration. Keep up your work. We look forward to you ❤️❤️❤️", "trashhboxx": "Queeeen", "dr_pixel_": "Caption !!👍👍", "_the_enfieldian_beast_": "Congratulations on feeling better ur a true inspiration❤", "mk__aishwarya": "♥️", "tansquare": "Absolutely stunning! I'm so so happy for you 💝", "rit_shank": "❤️🔥", "awww_podartho": "The way you put your feelings into words- it's feels so nice to read. Also, power through life. Always. 😍", "mustyouknowmyname": "More power to you 🙌", "_shaheen_15": "@ind0ctrination Much love to you😘♥️", "sharlicheen": "You are amazing ❤"}