{"thesassygourmet": "A question: what pronoun do you prefer? I was talking about your account with a friend a few days back, and I refered to you as 'she/her' and then immediately realised I didn't know your preference.", "shraddha_9876": "Beautiful🌟", "aditirajagopal": "You’re gorgeous and such an inspiration thank you for sharing your journey with us 💎 love always", "nitin_19t": "So beautiful😍👌", "lostlove.e": "Hot", "_._papillon_": "❤", "faiz_firoz": "Looking wowwww🔥😍", "naumanahmad.6398": "Beautiful", "rumjhum__": "You have converted into a beautiful woman♥️", "dizains6": "Hoi❤️", "itstulikaa": "Wow ♥", "anubhasawhney": "Much love 🤗", "keeeeeeerti": "I am so glad for you now", "diarra9390": "Sexy baby💋💋", "dylan.hessing": "Youre never going to be a woman, just an ugly man 💀", "anushreenataraj": "You are a fucking Goddess! Wishing you good health and more strength! ❤️ You are such an inspiration. Thank you!", "mehul16": "Oh my God! I just found your page and you’re inspirational! More power to you 🙂🙂❤️", "sona_akku": "😍", "being_roman1994": "Are you still in mangalore 🙂", "anushkamoray": "You are so inspiring, and so beautiful ❤️❤️", "nsfwmihir": "😍😍😍😍😍", "manushribhat": "😍😍😍😍", "____gelato": "i feel you, parlour didis are the hoarders of bodyshaming", "nooshanusha": "All my love to you🖤", "royal_kingboy06": "Plz reply me... I have so much of confusion.. Plz🙏🙏🙏", "ruuxhhh": "You have come a long way, and together we all will go further. You motivate me every single day :)", "zoyarazdan": "@ind0ctrination wonderfully worded....i think this is the sad truth all trans people have to pass through.....I think I will always have to thank my soul sister @trinz.xo who is finding her own path on her own but paves the path for a sister like me and guides me when I stumble 😘", "nidhi_ahire": "You look pretty my girl❤️", "but_a_fool": "What an insight on salons as gendered spaces. 🤩", "specialspoon._.87": "I really hope people understand😢❤️", "shwetavaidya17": "Uffff that last line had me in jitters!", "trinz.xo": "makhoooooonnnnnnnn... mmmm. #buttaahcup 😘😘😘😘😘", "sakshriyan": "Guts man XD I could never imagine giggling when that lady puts that burning hot devil liquid on me", "aditya_vikram_shrivastava": "I wish these places become more inclusive for all genders beyond the binary. You have a lot of courage, lots of love and power to you ♥♥♥", "dr.bhanu_chauhan": "🔥🔥", "jprakash_": "You are always beautiful ❤️❤️", "n_e_h_h_h": "Much love to you!!❤", "_okayokaykk_": "♥️"}