{"state_ur_business": "Pfft why even bother living in this country.", "i_harish_bohra": "What was that ,are the people insane!", "kshitij_gaikwad96": "Saviors needz Savior today😑", "nitishnagar_a4l": "The worse parts about all this is that Mamta \"didi\" didn't even show support to the doctors of the same state in which she is ruling as a fucking CM and the media is not covering this issue, instead they show utter bullshit like aliens taking over the planet and what not..🤦‍♂️ Least we can do is spread awareness about this issue and raise our voices in support of the incredible doctors in this nation!❤️ #protectdoctors", "shreespecialcare": "@vintage.desi I started writing to her in solidarity but the way she spoke to me just confirms that doctors always want to come across as ‘holier than thou’. I am a dentist who is also public health professional. I have seen doctors mocking patients, ill-treating them, abusing them and what not so if i see the same pattern in the post, I point it out with only one intention that the protest must not come across as classist in its way given how power dynamics works in India (between doctors and patients in public hospitals, not private). But yeah. AgEnDa AgAiNSt ThE SavIouRs. Fuck off.", "insane_ajay": "PLEASE FILE AN FIR AGAINST THE ATTACKER AND POLICE WILL DO THIER WORK CAUSE YOU ARE A LOT OF PEOPLE TO MAKE THEM DO IT.IF THE ATTACKER GETS PUNISHED PEOPLE WILL LEARN A LESSON IN YOUR AREA. I ALWAYS WANTED TO BE A DOCTOR BUT NEVER BECAME ONE 😥ITS REALLY HARD.", "_swagatam_debnath_": "😂😂😂ye aise gawaaro ki waja se apna desh aage nai badhrha. Kehke lenge WB govt. Ki👿.", "aakarshitsingla": "The peaks of illiteracy in india#iamwithnrs", "bhavdeep_patel": "Only if i could get his name", "arav7723": "Yes mamta banerjee is doing wrong but why ima is selective why no angers shown when children were dying in gorakhpur and muzaffarpur..", "abhavyaa": "@narendramodi 🙌🙌", "akash_bhardwaj99": "India k log chutiya h.", "akshbaghla\nVerified": "Verified", "mr._dpdash._": "Ye kya chutiyapa he boss.", "shreyayayayayayayayayayaya": "Oh my god this is sick, what is happening to this world oh my god @aaayuussh", "pihu_chauhan_": "@divya._.chauhan", "nishchay_official": "Very rightly said. We indeed need to spread the word.", "gs_cheema0": "@narendramodi ...🙏🙏", "rxjveeer": "He protecc... he attacc... He take tension... But most importantly... He gives behosi ka injeksion", "trillionaire_guy_official": "🔥🔥 I just have a question- is it okay/legal to share a patient's details- like what health issues they had? And what medicines were given to them?", "peekab000ooo": "Let mamta get sick one day...and she will visit a DOCTOR ...and then every doctor will refuse to treat her...and she will die.❤️", "shamaya_silver": "Doctors are not God. We are here to do our job with passion and honesty . Not to be put on a pedestal . Not to be assaulted ever. How is this being condoned by fellow non medicos is what I fail to understand.", "hey_its_neha_negi": "@monikaakochar Wtf Happening?? Bro be safe !!!!", "_siddhant0512": "@pavitraashankar what really happened", "pratibha_arya_": "@raghavjuyal need you to see this 😯", "riyayya": "This is really heart breaking.", "shubham.baraj": ".", "ann_phil_ip": "@ind0ctrination I suggest you watch laakhon mein ek on amazon prime. Your the person that came into my mind when I watched it! I hope you’ll relate to it too!", "yasnasehgal": "This is sick, just like Mamta Banerjee.", "tannu_priya208": "I dont know about this case...but doctors do take some cases for granted...i lost my sister long back as the doctors in delhi gave her a very high power newly dicovered injection just at the time when she started recovering at a young age of 11 and she could not bear the powerfull injection nd died on spot just because of their experimentation...my mother", "arushiejain": "@s_a_y_a_n_t_i please read this", "kartikeyabh": "I just wish more doctors had stood in solidarity with Dr. Kafeel Khan", "_krishangi_": "@hazarika_celeste @parash_talukdar @dr.bhargav_7 @bhaskar._.bunny this is so disturbing.", "aanuradhaaa": "This is not the first time this has happened in NRS, that's my locality and I've grown up seeing doctors being beaten up. And as far as the political leaders go, there was a religious issue based on which the person gets vote, so she ain't gonna help shit. But I'm glad that so much of social media attention has been caught... For the first time there some hope that this doesn't happen again.", "kohliashita": "If a bridge collapses and kills 20 people are we lynching the engineers and architects? No, of course not. How would they know the bridge would collapse. A terminally ill patient who has lived way beyond the average life expectancy in a country dies, ITS THE DOCTOR'S FAULT. KILL HIM. It's our duty to treat patients (which we highly respect and strive for) but isn't it our right to be treated as humans?", "vintage.desi": "The fucking silence of \"liberal\" media houses from The Quint to The Wire is outrageous. The mainstream media is beyond the pale of sanity, but it's so disheartening to see that the facts about this case especially the latest news about acid attacks, rape threats and attacks on hostels are only reaching us through social media and students present on campus. Not one article condemning the our very own regional fascist Mamata who is openly threatening students who are demanding better working conditions. I'm so done w this country.", "sakshriyan": "This is horrific to even think about. I hope the injured get well soon and something is done about this god awful situation.", "pragnyarao": "Behosi ka \"injeksan\". Like seriously. Somehow, I can picture a guy actually saying this. And the cheap trick of one like/one share can help poor people it seems. We as doctors are the ones that are fucking poor. Despite sacrificing so much of our lives to the overall benefit of humanity (minus the flaws in the system), I'm afraid we can never garner 200 blind people just by saying some shit that somehow sounded like the truth to those guys. It's a shame. Real shame. Also, 200 Kya, I haven't been able to get 20 of my non medico friends to actually voice these concerns out. They're just oblivious/reluctant/desensitized until they have some \"I have a stupid medical question/doubt to ask\" stuff.", "ruidas_indrani": "I am from NRS Medical College. Thank you so much for this. Thank you for the support. We are in this together. #savethesaviour", "anishpa6": "❤️❤️❤️❤️❤️❤️❤️💜💜💜💜💖💖💖💗💗💗💗💗💗", "vaishnavi.iyer14": "The ultimatum issued by the honourable Chief Minister of WB is what set everyone off. Instead of addressing the issue at NRS and talking to the Doctors,she chose to threaten doctors into calling off the strike orelse they would be forced to vacate the hostels and wouldn't be issues ICCs. Since when did fighting for our own rights become Selfishness?", "anubhasawhney": "Not a doctor but (obviously) and totally with you on this. #ProtectDoctors #InSolidarity", "samarpita_banerjee": "We all stand together in solidarity with a strong of hope of at least beginning to end this life threatening trend of \"hooliganism\" that hovers in and around hospitals not only in Bengal but throughout India. Doctors aren't Gods but mere humans of hardwork and skill. The right to live and work in a safe environment is granted even to daily wage workers, so are we not human enough to be granted even this? #insolidarity #standwithdoctors #standwithNRS", "dr_pixel_": "🤘👍👍"}