{"vincenza.gi": "@fragueci", "indiavslife": "This was a perfect morning read x", "sophievenable212": "You are a Queen 👸🏼", "v__moe": "Your hair is on point in these pics🔥", "juliaploum": "be naked a lot?", "dot_t_71": "Style has to be part of the attraction...then I have my way with their wardrobe and add my own touches. Slowly getting rid of the yucky stuff LoL 😂", "arianacydney": "Living proof. We are going to get married. I choose my big and fuzzy sweaters, and he chooses me. @jzeppie3", "juanelly": "No", "allynicolesmith": "Omg I also have a giraffe onesie suit! 🦒", "nbl702": "Never. But I’d give it a shot to see if I could gradually change their fashion ways - but ultimately people are comfortable in what they are wearing, otherwise they wouldn’t be wearing it. Just like that post of yours from a month or two ago: “Dress for the sex life you want”. I need to be into her sense of style as that triggers a big part of the attraction - and the same goes for my style and his she feel about it. I suppose it comes down to chemistry - and part of chemistry for me is the sense of style she has.", "lunamedina": "Some question but with music.... 🤔", "leannelovsin": "@erikahenry can u?", "pomadepunk": "Definitely not, it would be a constant irritation to the senses...", "mightyjoesmom": "No, u cannot. You also cannot date someone whose name has too many vowels in their name", "meredithhjohnston": "I’m here to tell you. You can.", "jonathan.a.kling": "haven't had to deal with the situation.....but if someone is committed to a certain style and is unwilling to branch out....that is more what I would have a real hard time with.", "roccobavero": "I know its off the subject but just want to say that I love when you post these multiple pics. The more Karley the better 😁", "reputsinner": "Soo.... 😍", "ivan63nadj": "Yes", "nikkithephotog": "My boyfriend has no style at all! But that’s why i pick up things for him to help his style. Plus i love him, so... ☺️", "maddoxwong": "Yes if I had known her well, and no if I just knew her :)", "vintage_heidi": "No", "not_very_interested": "Such a beautiful woman...", "koffenos": "Can you slowly change it over time tho...", "altcitizen": "All about the shoes", "corinne_furlong": "Pretty sure that’s a hard no", "bekkywithegoodhair": "@martefla topic på Wien-turen kl 01", "synnovemoshop": "Yes you can❤️ if they are smart and hot enough... 🔥🔥🔥 My relationship pattern... And I work with style.......", "elle_e_79": "Dont. Will turn out bad eventually..", "thefuzzyguru8": "All of them positive and negitive has to fit.", "rosiekavanavoch": "Absolutely!", "femn_abigail": "Oh I have opinions. Jazzed to read. 👏🏻", "bleudiablo13": "I would soooo date you!!! Love from the ATX", "darcy_shitbag": "Pretentious vanity", "romcnamara": "No.", "femmbellish": "Depends how tacky we’re talking... but if they’re sweet and appreciate my style then we’re all good 😘", "ashpriessnitz": "Yes bc I hate my style too 😔🤟🏽", "pyt.loves": "I tried, and no.", "bopnhoym": "@twofatjewishgirls", "constancetenvik": "Good question - I always laugh when Amy Schumer talks about the date when a guy showed up with an exclusive shirt with like a bow tie painted on it. On a different note - you in this sweater is uplifting!", "p.spencerphotographer": "If they’re as hot as you , absolutely! 🙌", "gabriellarowland_": "@lottie__edwards LOL", "jill_lips": "If the person is like gold who cares what shitty style they have.", "tboogs": "It’s impossible. You can’t do it.", "betonyvernon\nVerified": "Verified", "roberto.casti": "It's not about someone' style, it's about their breath", "cryofwolves": "I was literally just pondering this thought line, but, like if the style u don’t like is, uhm, the art they make", "thisisbolly": "Emphatic no.", "jeffreyt881234": "love u", "hannahmosity": "sadly it’s a naw", "odiumcarnaticum": "Depends on the pillow top", "estrojennie88": "❤️ YOU🔥🔥🔥", "zeldavision": "No.", "jnthnab": "💚", "caitemmaburke": "@miki__mb 🤔", "albadeniaa": "Uffff idk", "opal.olivia": "Didn’t work for me 🤷🏻‍♀️ lol", "killam_with_kindness": "Yep, but then you change them and they resent you and you break up 1.5 - 5 years later 🤷🏻‍♀️", "steveschlemper": "will another season of slutever?", "jeantuke": "You the modern real life Carrie Bradshaw", "juelsgem": "Hell no. I accepted it until he was hooked and then threw away all his clothes. 17 years later and he's still not allowed to pick out his own clothes. 😂😏", "immzmimi": "Gorgeous 😍🔥😍🔥😍🔥☺️", "effyonfire": "hi 😍", "kadykry": "@emcneill824 the only answer to this is no", "paul_of_paraphilia": "No, but my tastes are broad and hard to run up against.", "bkwrmgal": "Or you help them because you love them & they weren't taught how to take care of clothes because their mum did all of that so then finally the CEO of their company says \"thankfully you found Valerie and she fixed your wardrobe because I've been wanting to make you a Director for 2 years but couldn't because of the state of your clothes\" #truestory", "in_the_claudz": "Absolutely not", "leeyahtrbl": "nope, style is important", "aevetom": "No you can not", "quantum_paradox_": "No but I have no style so I probably wouldn't know either way.", "__yeahnahyeah": "@baltichousecollective I think you'd like her writing, the link is in the bio. I personally love her sm 😍💕", "chris2fer65": "Is your sweater itchy?", "thepoopqueen": "Dream sweater 💚", "chrissaycakes": "No", "steve16457": "Amazing 😍😉 ❤️", "sgraceyg": "@tt_mama_tt power color", "2mychagrin_": "Still remember when my ex told me he liked la-z-boy chairs in all seriousness", "stosdada": "Nope @bailey_keezy", "hollyy_frances": "@miaraheather 🤔", "bentspine": "Nope", "zzzzzzairaaaaaa": "Fuck no", "djroogirl": "No.", "dr.uke03": "No.", "mother.planter": "Yes, I accept him for who his is. He makes up for it in other ways :)", "marciavidaljewellery": "Can’t even shag them 🤷🏽‍♀️", "chanelcap": "👏🏼", "bizzzara": "@maxlehmanludwig this is what I was saying about shoes", "carexio6": "What sexy girl 🔥", "alexandravolou": "@georgevantoniou omg that woman gets me", "lizstoned": "Yes - success story. Their bookshelf and DVR are another story.", "poutfits": "nah", "_theperfectdrug_": "NO", "uncle_heidi": "Nope.", "blckjaguar": "I think it’s okay to prefer not to. Style to some people is a turn on in itself. Style has nothing to do with physical looks. As long as someone has a style I’m attracted to, is funny, and great personality I’m in! Some people don’t care about physical features or style and that’s okay too!", "jllgib": "Why bother?", "jessrdecker": "If there is actually style there, I can learn to appreciate with the person to some extent. If you're just a mess, then no. 😂", "d_moneythoo": "I’d marry you.", "twenty_won": "No", "meowzilla505": "Sorry, no.", "meghan.wallace.james": "♥︎ THIS", "hadleystacks": "NOPE", "lainierobertson": "I have in the past. It’s not fun. I’m now dating a hottie with good fashion taste. Life is better this way.", "somethingsomeonejr_": "Yaaaaaaas! He may not be fly, but doesn't mean I can't be", "truthxeniya": "absolutely not", "lambchop333": "Maybe for a hot min.", "hopeless_ly": "No, unfortunately", "wojiaocata": "🖤🖤🖤", "baronessblackmaille": "Depends on how good they are at eating pussy.", "jessy____brewer": "@logan.bock go read this rn", "jonther": "If its you, nope! Lol", "jairus70": "This is where u belong 🔥!", "georgeforemanisfromouterspace": "No it’s not possible.", "tonyfunyugo": "@bryant__east you", "justtrilce": "No and I’ve tried with my whole heart. Ultimately style has lots to with personality and other factors that do influence a relationship", "vanessaosman": "@karleyslutever only if their underneath the clothes style works for me! 😂😂😂", "sim_oneness": "Nope", "justin.spiegel": "Yes. I just use to throw away all the embarrassing fashion items away", "obrien431": "You are beautiful 🔥", "shaktidas": "I have and it never worked out...🙌", "insta_stam": "God I hope so, I have awful style 💯", "leancarey": "@clarakirk", "dudkinowska": "Can you date someone, if you hate their tattoos?", "anrabaro79": "My wife married me and she hates how I dress ... So I would think the answer is yes 😂👌", "tanzania.ar": "Been there done that. He wore fanny packs back in 2009.", "jdevoe_": "Yes, and anyone who says no is UNBELIEVABLY shallow", "davidcantugzz": "Im in love 😍", "kristendaniellegill": "Man... my partner wears CAMO CARGO SHORTS with T-shirt’s with “funny” sayings on them. I love him anyways.", "tkqt": "not a chance!!", "lizfrompittsburgh": "The answer is NO", "gregorygrodecki": "No", "luisammlima": "NO and trust me I've tried", "zchao\nVerified": "Verified", "antoinekenobi": "Impossible", "kjw6twelve": "🔥❤️", "int_anto": "No", "anasofiadelacamara": "@bchmllr u know who", "serenabuttarelli": "Can’t wait to read it babe 💕", "juliane_ja": "NO", "ginaginaginaaaaa": "Left swipe!", "azboyle": "Absolutely not", "lizzi_sandell": "So good!!!!", "elicantu1980": "@karleyslutever Your wink kills me! Like pegging murders me!", "collmorr": "Not for long", "artbybrix3": "💗💗💗", "gabyherstik\nVerified": "Verified", "adriansims28": "Probably wouldn't last long. Depends on how much you like/love her personality.", "realizashun": "NO", "wasabiwillis": "no", "idontdrinkthebeers": "Try me 🙋🏼‍♂️"}