{"juiceboxevents": "Come party with us 😝😝🍹💦🌈", "stvhght": "No. Also “Dr” Phil isn’t a doctor anymore.", "absickle1": "Not if you watch it together 😉🔥", "geo.moriarty": "Dr Phil is a right wing conservative Christian. I bloody love him but of course he thinks porn is cheating 🥴", "spacecase1380": "No i dont think its cheating no phys contact", "710.wildcat": "Testosterone & Estrogen loss from watching porn are a concern but Cheating.. seems to be just a construct of religious matrimony", "imamac11": "Porn, when I was younger, made it harder for me to get off on regular sex. Now I realize, it was because I put to much pressure on myself to please the women. After finally figuring out that I can’t give a girl multiple orgasms and also get mine at the same time, I started focusing on me and became horrible, apparently. I’ve been single ever since. Went from having two off and on girl friends who always came around a few times a week, to nothing. I’ve been with over 100 women.", "treelady91": "I do NOT think so! I’m married 30 years. Porn is not bad. Just like anything else, in moderation.", "oz_graphic_design": "Ehhhhh... I feel like thats like saying masturbation your meat is cheating.", "firatsalgur": "It's like watching food recipe videos when you are on a diet.", "cdsxcalibur": "Is that really Jacob and Bella?", "kodekat": "Don’t think it cheating sometimes I think it would be fun to watch it together as a couple", "beeareeyeteeteeeneyeee": "Lol of course dr Phil would think that 😂🤣", "smockgirl21": "I think it depends on your relationship and the boundaries oh set with your partner. Some people don’t feel comfortable with it and feel like it’s cheating (which I understand especially if porn is becoming a problem) but if it’s something that is cool with your partner and it’s done in a healthy open way (as a general rule I think if you feel like you have to hide it then maybe you shouldn’t do it or need to talk about it) I’ve had relationships that it made me feel incredibly uncomfortable and it was pretty unhealthy (partner was an addict to many things) but in my marriage it’s totally fine and sometimes we watch together :)", "chichichichia_93": "Only if the person is extremely childish amd repressed sexually. Personally, I think I'm Poly and a swinger now. I like Freedom and Liberation. I want my romantic partner to choose me but not have any boundries and still choose me in the end or in a crowded room with all her options open..", "darkangelto": "Monogamy is unnatural.", "chubtone_guitars": "You mean Phil🤔No Doctor.. Just Plain old Phil💯", "miofeturdan": "Well it is a very short answer. If you would rather watch porn and pleasure yourself, or have your partner do it, so much you don’t really want to have sex with your partner then in someways it might be cheating.", "vinpan1": "It's not cheating!", "mmkassa": "Forms of cheating are subjective...", "kimba107": "Not cheating ❤️", "nadiasm_96": "I may not consider it cheating but it is not like your mind is being monogamous if you willingly engage with the idea of having sex with someone other than your partner.", "kentheken": "Fuck you, Phil.", "ferrisbuehler87": "somebody please tell me which porno this is from so i can go watch it 😋 #vintageporn", "ex_culture": "If doesn’t involve physical interaction with another partner, it is not non-monogamy.", "nobodyshome1111": "Find a new home for Now Apocalypse.", "justoph": "@raff_bcgr", "rebelbarbie5": "What? That's just crazy. Mayyyyyybe if you choose porn over your partner consistently, I could see an argument for it being cheating. Maybe.", "sheldrake1960": "Porn helped my wife and I re-ignite our sex life....", "sublime_crazy_fool": "That's hot 🔥", "i_am_nathan_beck": "THERAPY - NOT cheating", "lana__rae": "Dr. Phil has probably never made a woman cum in his entire life", "whoanow": "We only watch together...", "olivieramsellem": "The shoes 💎", "kellycomatose": "Jesus. No it’s not cheating for fuck sake. Let people do what they want when you’re not around.", "steve16457": "Nope it’s not", "iwokeupforthis": "absolutely not a form of non-monogamy! dr. phil, we know that you’re doing some kinky shit at home so lay off!", "juszaawi": "God, it's not cheating. I get inspirations from porn plus it's good when your other half is not near and suddenly you want some action 💦 My man watches porn and I'm fine with it. I'm watching porn and his fine with it. Probably soon gonna watch it toghter because why not 💁🏻‍♀️", "jessica.m.larsson": "My husbands always look at girls that are really like me at these sites . But he often searches to long for that, because there isn't anyone like me 😍🔥 we watch together", "davidkeiser1963": "I love the beautiful name", "joemorsi": "Only if you’re watching porn while having sex with someone who isn’t your significant other.", "senioritaugly": "No", "biancadeonde": "Of course not. And if we watch it together, is even funnier 😘", "carleymareejoynorrie": "I think it depends on your definitions of “porn” and “watching porn” as well as your preferred relationship style. I also think that it is okay and for lack of a better word, normal that the answer to this question exists within a spectrum of possibilities that varies between individuals. What feels right for me may not feel right for you but that doesn’t mean that it is not inherently right for me and my relationship/s and vice versa.", "heroicvice": "There are so many variables to both ‘pornography’ and ‘relationships’ that deeming either one as ‘good’ or ‘bad’ seems quite simplistically dumb. Grow up @drphil and others.", "zi_colconi": "Some couples believe it is, not for us haha for me, it is a good place to have fun, and also research, new positions, new fetishs, new crushes haha just healthy", "matagram78": "No it's not. Alexa? Next song.", "jauntybass": "Dr Phil ain’t even a doctor. Fuck that guy. People should make their own boundaries/limitations. Leave that Texan out of it.", "miti101": "It's not cheating. HOWEVER, when someone constantly chooses porn over actual sex with his/her partner that's a problem. When someone forces his/her partner to do things he/she saw in a porn movie,that's a HUGE problem", "kaycwpdx": "Dr Phil is an asshole.", "attagirlashley": "It can be hot. Sometimes it makes me want my partner more because it uhh, “gets the wheels turning”. 🤷🏼‍♀️ Some people develop strange, obsessive attachments but then it’s really obvious they need help, not to be shamed, isn’t it?", "haleyelizaf": "@unhappy_hipster omg do u watching slutever", "phaedrustheghost": "These are absolutely the right questions", "brmitchell63": "Dr Phil:) I love his utterly mainstream views on well everything really but wouldn't choose to live my life around them", "muratisik_writes": "No, no and no. 🌿", "jsof2010": "Oh lord. Sure is. Totally. For 17 years I watched porn and fantasized about women other than my wife. After a divorce I met a different woman who didn't like porn. I decided to not only give up porn, I chose to fully restrict all my sexual attention and aim it only at her. It transformed me. 7 years of monk-like but joyful discipline led to states of high ecstasy and one of the most powerful sexual connections I've ever had. It is good.", "bridzor": "@hannah_louise_gal", "maddeostlie": "Dr.Phil should know better.", "roccobavero": "I would love to watch porn with you", "jason_de_graaf": "What if I fantasize about having sex with someone other than my partner, would that be cheating according to Dr Phil?", "brockmanchest": "Dr Phil looks like the btk killer", "crystal._ball": "Hell no", "havefun.begood": "Hard NO. (pun totes intended)", "huffl3puffinthetardis": "Watching it together is a good idea, but the answer is no", "helenamagdalena": "Loved u in easy!! Your such a sexy bitch!!!!", "mollymistr": "Hard no", "thehedonisticegalitarianman": "Cheating? 😂 For me, no absolutely not. Although if your partner has expressly said they don’t want you doing it and you e agreed not to - and then do, yes that’s ‘cheating’. Cheating is doing something behind your partners back without their consent - no matter what the subject.", "alejandrotoled0": "It depends on the porn, if it is good as this one, you are ok.", "kevinkelleherphotography": "Maybe credit @barbaranitke for her fucking work. Just a suggestion.", "dajuud": "@rrene_ed", "amyisonline": "What? No! If it's an extreme circumstance where one partner is so addicted to porn that they're neglecting their partner and lying about it then it's a problem. However, that's not the porn's fault, that's an underlying problem.", "0ldboy5150": "Dr. Phil is a shitbird.", "kjw6twelve": "Only if you ask your partner to participate and they say no. Yet you endulge anyway..... maybe 🤔", "williamfuentes": "Cheating mentally is a gateway.", "robfiacco": "Ya but Dr Phil is a fucking clown.", "adriansims28": "No its not cheating.", "jademcnagger": "Dr Phil is very judgmental when it comes to sex and sex workers, he can honestly go fuck himself properly on this topic.", "fannymeekes": "Who listens to Dr. Phil? 🙄", "mrarchivist": "Dr. Phil is a Doctor of Douchebaggery. Fuck that guy.", "sofiaacierno": "Lol no shot", "nh0981": "Dr Phil probably has the shittiest sex life", "mrteasuk": "Dr. Phil is a dick.", "zadora30": "I watch porn all the time its fine. Dr Phil don't know what he's talking about, he don't know rather to wid his watch or scratch his ass.", "fatal_vigz": "ya ok. i call BS", "amnakamala": "Porn is great! But like all things that are fun and exciting can be addictive.", "narduchita": "Really up to the relationship I suppose on what they both think", "ryanjames423": "Just watch it together.", "the_very_rev._deepfry": "The loudest anti-porn voices are from those who love it the most, and almost all of them are religious or recovering religious.", "heyyyooowayyy": "We cheat on each other if this is true @jordan23mllr", "fabfreckled": "Would depend on context and how much. Is your partner choosing porn over you ? Then yes not okay. Are you partaking as a couple and agree you both like okay! But I think this is whatever the couple is comfortable with and respecting each other’s feelings here.", "orlandofr17": "Just live and let live. ♠️😎", "anjunalove": "Dr Phil can suck my ass", "omri_the_savage": "Dr. Phil is very wrong.", "arrowkneeta": "Well I cheat on my man regularly then...", "rikaa338": "Not cheating...couples just have to find ways to enjoy together🤗", "carlitos.diazherrera": "Not cheating and specially if you watch with partner", "bluebomb72": "Some people do think this. I think it becomes more of a taboo if you forbid it as a partner. It has become such a part of our world and easily accessible. How can you forbid it. I think the partner will be constantly be betrayed. You have to open up, let your partner explore.", "jdfraga": "Doctor Phil is not even a licensed fucking doctor anymore. Fuck that dude with his stinking thinking bullshit.", "funkehouse": "Am I cheating on my Diet if i watch the Food Channel? Me thinks not", "lolapoprocks": "To think porn is cheating is the most ridiculous thing I have ever heard. But that's just my opinion.", "osocampana": "Fuck Dr. Phil. Goofball.", "kelseypribilski": "Fuck Dr. Phil.", "washdc23": "Haha..what is this screen shot from...looks like late 80’s?", "theworldaccordingtolulu__": "Fascinated by the actively judgmental tone a lot of these comments are taking. I’m not fussed by on SO watching porn but imagine assuming people who dislike it are automatically insecure or prudish 🙄.", "jessicvt": "I’m an insecure piece of shit so I don’t LIKE seeing porn my SO watches or knowing anything about it but I know it’s dumb as fuck to expect him to not watch it because were all human so 🤷🏼‍♀️", "tone_415_sf_": "That dude looks like Jim Carry 🤣", "takingbackmari": "It completely depends on the boundaries of your relationship", "very_mad_max": "What's the uhhhhhh the sauce?", "gill_stipe": "Phil is missing out", "malbis1999": "Dr Phil is a jerkoff", "allyson.spencer": "No...no it's not.", "dramieharwick": "👏🏻", "yaelgitai": "Nooo 💦", "caseymfish": "Dr Phil is trash", "saejarha": "no..", "slapthebasil": "Who cares what Phil thinks, I'm not fucking him, neither are you. His opinion on my relationship doesn't count.", "kurtrichardson9": "Will you marry me", "drillingholes_________": "No fuck dr bald dipshit", "ellie_cat_tat": "I think it can supplement a healthy relationship & harm an unstable one", "westonphotoss": "If your partner knows about it and it’s all good. Then it’s fine. It’s when it’s behind someone’s back it isn’t. If you aren’t telling. You know it’s wrong to do. It’s about respecting each other", "noodel_": "My husband is a porn addict so in our relationship it is non monogamy. But personally I used to do sex work and I love porn. I want to get back into it because it makes me feel sexy and powerful", "lopeserranosol": "No, it is not.", "consciouskingcrab": "I think moderate porn at the right times improves libido.", "miked9130": "Gimme a break🙄🤦‍♂️👎😡", "poewing": "Thats not Jim Carrey?", "xxlunawitchxx": "My favorite articles and episodes are when you visit the Chateau :)", "ozmanoos": "Thought this was Married With Children for a second 😂", "m_o_x_y": "@hardcor_decor", "8thavearc": "My wife and I both run \"adult\" stores, she has a porn collection similar to a warehouse, I have 3 in my collection. It's just like watching TV to her.", "amandarachael4": "Dr. Phil also thinks that mustache is a good look so let's all keep some perspective", "aaronchase__": "Dr Phil...lol", "mr_mojo_risin08": "We Phil has cooked it", "cesarmondragon": "Its self abuse", "gibby_1989": "Dr. Phil can go fuck himself. Porn is definitely NOT cheating.", "cbeeeeezzy": "porn is NOT cheating.", "rcam14": "😂", "just_that_one_guy_named_kyle_": "Fuck Dr. Phil.", "the_official_kelly_k": "Watching Dr Phil is more harmful to your relationship than watching porn...", "kixkixmykix": "I don’t have a problem with it", "asdotu": "Dr Phil is a Douche", "fingersarefood": "Going on the internet is cheating", "cashmoneymariah": "Not cheating lol", "5arahrella": "Who the fuck listens to dr Phil really tho that guy is bullshit", "gordon_coled": "Dr Phil is a fucking idiot.", "tttodayjr13": "Not cheating. Dr. Phil must have a wild imagination.", "vincemaverick": "Link?", "evilqxeenn": "I dont think its cheating but its disrespectful and degrading because it would make me feel like I am not pleasing my spouse in bed.", "jacqthestripper": "THIS PHOTO ⚡️🤣⚡️", "juliedeuxfois": "Not cheating. However, porn isn't very good to a healthy sex life.", "itsyourgirljordy": "What is this photo from??", "kassiusclay86": "No with a hell no times 2", "mathyoutoo": "Is he yawning?", "justill88": "Hi Karley 💛 Will there be another season of Slutever?", "obrien431": "My girl 🔥❤️😍😘😘", "virgochic5": "WOWwwwww Dr Phil thinks watching porn is cheating?!?! 😂 is he a f*cking saint? Lmao", "ashleyfatale": "Dr. Phil can go suck a fuck🤷🏾‍♀️", "mcdad123": "What happens next?", "sashbell": "Definitely not cheating.", "chippysdad": "It depends on how much of an insecure prude one has chosen for a partner", "giovannialvarado30": "I don't think it's cheating but it becomes addictive and then you sometimes choose watching porn than having sex with your partner.", "kimgracia": "No it’s not and anyone who thinks it is has deep insecurities that they should work on before getting into a relationship.", "snoozyfloozy": "Not cheating, just as recreational drug use is not a problem for a relationship when agreed on. Addiction on the other hand and the lies, disengagement and tensions that come with it is a massive problem. I feel strongly that having a private (solo) sexual life is healthy and this can be part of that.", "maybe_some_other_time": "It's cheating as much as watching a true crime doc is murder", "alexandrarose.storm": "Lmao! Dr Phil thinks that? If you don’t let your boyfriend watch porn, youre policing him and your sex life is going to suck...and don’t you wanna watch porn too?? 🤔", "mariam_realest": "Is this photo from a movie? Which one?", "t1000ramey": "Anyone have the link for this scene? 🤷🏻‍♂️", "jessica_falconer358": "Biggest eye roll of life for the people who think this is cheating 🙄🙄🙄", "will1999iam": "If he chooses that over you then it is..", "takkun169": "Dr. Phil is a dirt bag.", "rclark755": "Not if it’s on a vhs tape labeled “Rudy”", "burbujabig": "Porn is a way for amusing our sex lives. Absolute monogamy is unreal because there are many hotty people you would like to f..k.", "gold_blooded_niner": "Well, fuck...", "meganjaepearl": "When your partner would rather watch porn than have sex with you, yes. @karleyslutever", "stephynow\nVerified": "Verified", "allicripe": "This photo is amazing hahah", "lokis_buds710": "This seems like a question of sexual compatibility rather than a question of fidelity. Some people are totally ok with porn, some aren't, but I don't think it could possibly be interpreted as cheating considering it's a solo act.", "lozzlebezzle": "Nah not for me. It's pretty functional as a thing and doesn't affect mine and my partners relationship negatively at all. We've a strong relationship so it doesn't feel threatening to me. ❤️", "fredafelcher": "Dr. Phil is an idiot.", "carapatch": "I don't see it as cheating. Doesn't matter where you get your appetite as long as you come home for dinner 😊", "kirstinmccarlie": "noooooo", "rehab4candy": "Dr Phil is a load of bologna", "sarahemoore_13": "Probably not a simple answer. It depends on how uncomfortable the partner is with it and how it affects their intimacy level.", "maxdirects": "def not! just the opposite... prevents cheating 😉", "williamantonio34": "I don’t think it so!", "anthonydigitalmedia": "I’ve had gfs in the past that considered it cheating..", "honey_cutie_xox": "Then watching romance movies must be cheating too, then, because you become enamored in someone's else's relationship 😂😂", "cleointhedark": "Not cheating.", "laurenbelfoy": "It’s only betrayal if either party has a problem with it", "anhedonia__": "Lmfao. If that's the case then I feel almost everyone has cheated on one another.... Means I've cheated on every partner of mine 🤣.... Dr. Phil is an idiot, and not even a licensed doctor outside of Texas AFAIK.", "bronk33": "No its not cheating lol", "bmill23": "It seems so contextual to me. To answer the question, is porn cheating, depends on so many factors. I think partners have to communicate about what they are comfortable with. My partner and I both watch, on our own and together, but if I found out he was repeatedly engaging with the same girl on a live video, I might have some questions.", "elevatorparty42": "Lol there's definitive proof Dr Phil is A MORON", "djpayne": "Dr Phil is full of shit", "sith2814": "My girlfriend watches porn with me, we take turns picking out what porn we are going to watch. She has her favorite porn stars and I have mine. We share our porn experience with each other, and it keeps our sex life crazy good.", "cakedupcassie": "I definitely don’t think there is a one size fits all answer to this! I also don’t think that watching porn is cheating at all, but some people may be more comfortable with it in their relationship than others might be. It just depends on the boundaries set within different relationships!", "koller_anthony": "There is an interesting film called The Untamed, that might shock you 😮🤣🤣", "thegoodtony1": "🤔", "northernexposureniagara": "We must recognize that monogamy is not static, it is a continuum", "pixelwhip_": "No", "randylaheyfreedom35": "\"Dr\" Phil is not a Doctor so who gives a fuck what he thinks.", "badnews_kreitzka": "Dr Phil is a fucking idiot", "ericj_rash": "Haha no we both watch it on our own and together 🙌", "vim731": "It's not cheating at all. At least @chrissyolithic said it's not when we were together", "jon.trout": "Dr. Phil is a turd", "lizzi_sandell": "🤠📽💦", "porscher_m": "Absolutely not! My partner and I watch porn together and separately. Would never consider it cheating.", "liiiopatra": "@karleyslutever dr phil killing the vibe", "lesslyamador": "It’s a humans right to masturbate", "isash0911": "@karleyslutever : Why is it cheating when we arent hurting anyone ...! Still a big question ^^"}