{"xyunaya": "♥️🤙✨", "thewhitneyyoung": "Looooved your character. ✨", "friofontaine": "My dream girl. Slutever", "princessofthegracefulfield": "Favorite episode", "natsguarin": "Just saw this! Soooo good 👌🏼", "stephlynnsprau": "@jocelyn_mcd13", "ozcelikjefe": "I just watched it. Totally loved it. I think you should do more stuff like this", "grannyrugg": "Loved it", "adinamills": "You were amazing in this episode!", "twocoloursinmyhead": "@dee__bees", "beingparth": "Ma'am, that was an excellent episode!", "laynaisle": "Amazing! Well played, lady ! X", "paigeashleysmith": "I LOVED this episode so much! Bravo. Looked you up afterward and was delighted to discover you're just as sex positive and progressive as your character! Keep killin' it xo", "salbutamol": "that was funny!", "sharmishta": "One of my favourite episodes from Easy", "other.account09": "@devilkennydog no", "_ghost.piss_": "I️ loved this so much.", "ophlllier": "One of the best episode of EASY", "mflakes4prez": "I jus got so excited, like “Holy shyt, that was the chick from ‘Slutever’”", "jacqueline_o_my": "I KNEW I RECOGNIZED YOU!!!!", "ersklife": "I just saw this episode. Quality. \"I feel lucky to be alive right now.\" Priceless. I am def anti-ano, your body's rockin!", "ricop2003": "I need to see this.", "superduperandyomfssrsly": "It's cute. I love a chick who will shamelessly dodge the law and conventional norms. Not legit is LEGIT.", "jonathantaylorthomas": "Hey, I️ just watched this episode and you were really awesome in it. It’s awesome to see you continue to rule with every thing that you do.", "adaywithoutlove": "thuglife", "alebaabe": "Loved this episode!! You’re amazing ❣️", "simwest": "I just watched this tonight and I loved it so much @mona.chatskin @alanawest", "hthr.mason": "I absolutely loved you in this!!", "christinampfaff": "You were amazing in this episode, amazing ✨🙏🏻", "rubyhankinson": "@lakehire", "laura_t11": "@smeeeee", "subtle_t_": "Great job 👍", "oursharedlens": "Amazing episode. I watched it and immediately looked you up to see more of your work. I'm blown away by your acting/writing etc. Sign me up as a huge fan.", "smeeeee": "love her @laura_t11", "lafleish": "I loved this episode, you killed it. Great job 👌🏼", "annamaria.igorevna": "This was my favorite episode, great work!", "de.jaja": "You were 🙆 in it!", "tom_izzo_vk": "You was too fire in that ep. My love", "joannaleesimon": "Just watched. You were AWESOME!!!", "pbvacca70": "Beautiful!!!!", "neilodriscolley": "Good job! Act more pls", "heykristina": "I discovered you just now by watching this episode. You were 👌🏼", "diuvic": "Was actually expecting a tamer version of an escort but they really went for it (Which they normally don’t do.) Looking 💯 Karley", "alexisarabia": "You were good ! Congratulations !", "marvyd": "@karleyslutever you were beautiful. Thank you so much. I wish you all the best !! :-)", "bunnymadeafunny": "I loved this episode. You are outstanding.", "natepsyches": "I just finished your episode of Easy and I really liked it I thought you were very sexy and acted well, good luck in future acting xo @karleyslutever", "ani_rn": "This was amazing!", "gagandhillonn": "Great episode! Hooked on the easy series!", "ohcnapbettina": "Omg I just saw your post on @voguemagazine’s Instagram — I used to follow your blog religiously when I was an adolescent (10 or so years ago). Glad I found you again!! Your witty writing and sense of humor made me a fan then and still a fan now. 💕", "tonykieraldo": "Watching now with my girlfriend. Really well written!", "joyisnothere": "Probably my fav episode out of the season!!! ❤️⭐️", "lolochambo": "Babe, I watched it yesterday. I was shocked... in a good way. You are next level natural. I love you 😘", "briana.turnbull": "Love this show and loved seeing you on it!", "currentlycreative": "Such a great episode!", "al.around.town": "Great episode. Loved how you all come together at the end.", "bboyd1980": "I love this show and just stumbled upon this episode. You are a goddess ❤️", "itsmeemily_": "Ah shit I just watched this today!", "michaelscharloo": "I will actually watch the show now and give it a shot. I seen a a show you did on the Viceland channel and you did so well that I respect and want to see anything you are in.", "amandaisbored__": "One of my favorite characters! Hope you’re back in season 3!", "mrp2019fenix": "@karleyslutever beautiful bless", "andamtshemla": "Loved this episode", "lucas.obi": "Me enamore de tu sonrisa =)", "no_identity_tities": "I have watched it it’s perfect. You’re perfect x", "eddieveddersgirlfriend": "Um? No you don't. That story line was stolen from sex workers and given to the burlesque episode. You play a swer who is filmed for civvys, by civvys.", "michaeladartois": "I loved you on this @karleyslutever your character was amazingly written and executed", "magnanimous_maurice": "Congrats! But geez, you could have said spoiler warning first.😄", "studiosrh": "This episode was so good!", "lokogtb_": "Amazing job!!", "anrabaro79": "I'm so glad you're not a real escort ... that would be my ruin", "juavie": "Congrats and amazing!!", "karamcginley": "Omg! @josielatimer", "cmprz": "act more !!!", "leatheranderson": "I loved this episode. You were fantastic", "mynameiseve": "An incredibly powerful episode - thank you for being part of the team that put this message out there !", "iffy.okpon": "Fascinating show.", "thesharpfacet": "I immediately had thoughts of @iiindiiia the moment Jane's character mentioned your writing...phenomenal episode and very much what I envisioned a fully realized @Netflix show could be. #sexpositive #erection #realcurves #streamingtv 💟🙏💖🎁👏", "jandifollowill": "You were absolutely brilliant in this episode 🙌🏼💖", "catdisco": "Amazing episode!!", "shameless519": "Just watched ep3 you got a new fan", "numberoneblob": "IT IS SO GOOD. 👏🏻👏🏻was extremely excited to see you and a character like that. Love that show and you!", "minasalome": "I thought I saw you in the trailer! That's awesome, excited to watch ot", "gmarkgmark": "Made it", "alonsoag86": "Loved the episode ! Queen !", "itsmyinstabye": "Absolutely loved it and you always 🖤", "ste.gamba": "You are the best", "vysedrex": "Oooo", "courtneymaywald": "You are so fucking good in it", "thedeathhead": "I just saw it today and I think you totally killed it! 👍👍❤️❤️❤️", "owlbait": "👏🏻👏🏻👏🏻👏🏻👏🏻", "jennifer.ankarsten": "You killed it!!", "jennifermmoyers": "@joeyyeartx", "mingjoi": "SO GOOD", "fragilemind": "Omg I just watched this tonight, you fuckin' ruuuuule 💕", "seitan_desu": "my favorite episode of the season!", "emphasismine": "You were fantastic! I loved that episode.", "harveymushman48": "added to queue...you look great there", "ahhhsatan": "👏👏👏👏❤️", "onaartist": "Awesome!!💕", "mrskristyjanssen": "Just watched this episode. You were brilliant 😘", "blueaura": "Watching!!", "lizzi_sandell": "We watched it all today 😏", "sunny_hart": "I started watching it and was so pleasantly surprised to see you in it. You did an amazing job and you / your character was so full of life and personality. You are so warm and genuine! You did an incredible job I loved your episode", "nick.fitzhugh": "Congrats Karley! Love it :)", "ccregan2": "Just watched it today and was so excited to see you! I loved your portrayal of the character", "hayleyjeanclark": "Watched it yesterday, great acting!! + you looked hot as fuck", "maxastein": "YOU R ON 🔥", "pamelalove\nVerified": "Verified", "coffeebeankilla": "He looks astonished", "nooeynookins": "@grty86 ❗️🔥🔥🔥", "marinefourie": "🤘🤘🤘🤘🤘🤘🤘", "officialmariabello\nVerified": "Verified", "itsactuallyimogene": "I love this series! Yayyy!!!", "francescasphynxie": "@heidipom", "lauriecollyer": "Can't wait", "jeffgilroy": "Season 3?! You’re in it?! No way!!!", "chakrubs": "⭐️👏🏻👏🏻👏🏻", "solitaryanimal": "Just watched this episode actually. Really fucking awesome. I feel like your character in the show is probably similar to you off the screen 🙌🏾 was that role written for you in mind?", "iamthefrizzlefry": "Watched it last night. You did an incredible job!! I did not know who you were and waited for the credits so I could look you up. You really did an amazing job.", "betsyboo43": "Going to watch it!", "betch101": "Your crazy and I like it! 😉😘 @karleyslutever", "hannahrosebroom": "You played the part with depth and authenticity 👏🏼👏🏼👏🏼", "oliviajcarmel": "I'm watching it right now and LOVING IT. You're amazing and representing women/sex workers very well. 💕xoxo", "psychedelicnature": "My gf & I just watched it. Great stuff! Very natural on camera.", "hwuahrehz": "It was fantastic! Loved your episode."}