{"hanimix09": "Do she have snap acunet or sexy page??", "caffienddd": "@karleyslutever Will there be any way to watch this other than on cable TV? A huge portion of your target audience (people in their 20s & 30s) don't have cable. Seriously, I know one person under the age of 40 with cable, everyone else streams 😂", "opiumden69": "One of my favorite viceland shows😍", "etais_ici": "Amazing", "sirjazzmine": "I loved this episode, I've been wanting a happy ending massage forever. Any of the services I've ever seen charge like 4 times the amount that men pay for one which really pisses me off!", "sackville.and.co": "👌 so good, love the 1st episode, can’t wait for the rest.", "heyangella": "you’re my fav 💋", "maggsssie": "Just finished the first ep and all I can say is- AHMAZING! 👏🏼👏🏼👏🏼 It was touching, funny, and oh so positive. Well done!", "hakunatawanda": "EEEEEEEEPPP!!!!!!!!!💗🌷💗 I LOVED IT!!! Thank you for inspiring female sexual empowerment.... I’m excited to see the next episodes.. and I GOTTA KNOW: DID MR. M GIVE YOU A HAPPY ENDING?!?", "thecorinneoconnor": "@karleyslutever this first episode is inspiring! Thank you for this 👏🏼🙌🏼👏🏼🙌🏼👏🏼🙌🏼💚", "nikkiefromheaven": "My opinion is, the reason why no one offer happy ending massage for women is because it's too risky. So if I pay for someone to make me pleasure with happy ending, I expect the happy ending, but we all know girls, the female orgasm is more complicated than just \"lie up, relax, enjoy and come\". I can imagine this method doesn't work for 60% of women. So it's not a really good business. But I am also don't agree with this situation, that we have no possibilities for enjoy fast solutions, without bullshit, when we are horny.", "kaylaluvz": "Your show is everything 💕😈 Can’t wait for more episodes!!", "sheldonsmama": "Loved this so damn much! I actually have done this, in Delaware of all places. Wasn’t discussed, it just sort of happened. Amazing.", "1luckylynne": "@itscarlawiththreecs watch these", "iron_lung_louie": "Im here for you ladies 👌 I gotchu", "ashleymilano_": "@karleyslutever DID YOU ORGASM? Did you get your happy ending???? Let a girl know", "libbylivingcolorfully": "@holleysimmons", "chad_micah_johnson": "I would have done the massage for free.", "rjpiar": "Greatest first episode of it’s kind for it’s creator. Truly amazing. Great post work as well. Brava!", "tantricactivation": ":)", "kyngshyt": "I think a mans orgasm is so simple because it’s purpose is more about reproduction. Where as a woman’s would increase chance of pregnancy. It’s mostly about pleasure.", "thepinkepanther": "I’m a bit taken aback that you haven’t mention fosta yet talk some much about being pro sex workers?", "elisamelon": "@yourstrulyalio Oh and it’s on Hulu 💖", "helenruckelshaus": "Who is she!!? @indiatehranchi", "maya_lowe": "Keep up the amazing work! I love how you bring to light the different and insightful perspectives of sexuality that most either don’t think of or are in fear of seeming to “slutty” to talk about. You’re breaking down barriers and I look forward to what else you have to share!🙌🏼💕", "jackburlesque": "Ur awesome", "ninalliu": "@eun_yoon", "davidsolomini": "💓⚪️💓", "santoloco504": "Awesome episode.", "yeoldefunwrecker": "@karleyslutever finally got to watch the episode! So good and informative. Did the last person you encountered actually make you cum?", "liza_lu": "@letsgetitsean hahaha this!", "baconrays": "Just saw you in the show Easy. Great job!", "kellylabanco": "Yasssss @karleyslutever 🎉😽", "franklymydear42": "I have watched all your Vice vids and loved all of them! I love how you bring to light such a sensitive and stigmatized topic in a very informative (yet sexy!) way. Stoked to see more! ☺️❤️", "hairbangbaby": "🎈🎉 @divin3moth3r", "devonkearns": "@lennond from easy", "sam11712": "Did you guys post the video by mistakely on YouTube and took it down ?", "sacha.strebe": "Can you please narrate your book and make it available on audible??? @karleyslutever 💫", "0.point.photography": "i dont see anything triggering about this...i am easily triggered too haha!", "felicityta_": "Not available in Australia 😭", "rich_piana_tribute": "Can I be your happy ending👅💦", "pumpstress": "@megatron405 @bex_n_effex This is the woman I was telling you about that I love. She’s a great writer and has a rad show on vice", "tesco_metro_addict": "Not available in uk??? :(", "sherrieh": "🧛‍♀️", "alemope": "@gaquiros @danna.mathews !!!", "piinkcookie": "HELL YES!!! I missed Slutever vids", "ganeshsaidheeraj_": "Not available in india", "strolloco": "\"Video not available\" - not possible to see the video..", "danae_ashlea": "Also blocked in Australia, this is some bullshit", "lowannalillian": "🙌🏽🙌🏽🙌🏽🖤", "sweet_carolllliiiinnnneeeee": "@karleyslutever I loved it! Gonna be my favorite show on @viceland", "human_spam": "Good episode but let’s be honest if there were a real market for the service there would be no shortage of dudes lined up cracking their knuckles", "dankasaurus_memes": "There’s like a thousand of them in flushing lol", "allisonnyskies": "So amazing! Can’t wait to read your book!", "ethan216_": "Are the old original slutever eps not canon anymore? Why is this Ep 1?", "ern_estot": "Omg I’m obsessed and I just found out you’re a real person!", "misscoupleofficial": "LMFAO my first boyfriend tried that Lewis & Clarke expedition line on me and turned me off to men for years. 😂 When I heard the yoni massage guy say that I was like \"omfg no wayyyyy!\"", "bacteriaguurl": "Is there a way to watch if we don't have cable???", "indiatehranchi": "how cool is this girl?!!! @helenruckels", "cails_m": "@jongemily @mayrose94", "barbieferreira\nVerified": "Verified", "noelyrolypoly": "Can I interview you for my school project", "hollywoodlouisville": "Based on the amazing episode of Easy you’re in, I’ll have to catch this.", "phillipahoran": "Easy to find in London", "itsbellajiang": "ily can't wait to watch", "koolaghoul": "@dede12933", "jeremyboatman": "Absolutely beautifully shot and edited. Sexy As.", "nazness": "YaSsss karley xxxxx", "anneclaire.rohe": "Amazing! Already hooked on this! Well done 👌🏼", "bylandandc": "Get it girl! Literally and figuratively!", "dannibankz_": "🙌👏🏻🙏 loved it", "playframe": "Trigger Warning. 😂 So true.", "kateberesford": "@mariapappas", "pearet": "Omg those exist :’) ??", "rachelovesalt": "🙌🏻", "anthonyhitchcock": "I dig this episode series", "martadeub": "So bad the video cannot be played in Spain (idk why), I was so exited for this new series😭😭😭", "jessicasai": "@layegan @theonlyale", "isabella._louise": "@yasminebenafia this is a series we need to see for research", "ashnichole.23": "But how easy is it for men to find? I wonder 🧐", "rymdkakor": "I was so stoked my dudes, saw it on VICE's channel and was about to watch it but then YouTube blocked outside of the US (I think)", "sthorstensson": "Att Internationals: Hola is your answer", "dmonacowpg83": "Ah great - wish YouTube would let you pan down haha", "justine.march": "It says not available!!", "caintookthese": "I love how sex positive you are and how you’re all about owning your own sexuality and embracing it !! Totally inspired me to wanna get into sex journalism and things similar to what you do !", "scafarella": "🔥🔥🔥", "chrisf00se": "I want to lick your pussy!", "chellysea": "Thank you for inspiring me today. I needed this", "killla.kate": "🔥🔥you're amazing!!", "sky_uncensored": "Loved it, Karley! 💦", "blackmedvsa": "I absolutely LOVE this episode and am so happy that Slutever is back. 💖 Where did you get that yellow dress, though?? 👀", "daughteroftheelements": "Not in Canada 😿", "jamelia411": "Awsm show so far! Good job! Ive wante to do something like that girl! Love it! Love everything vice since 4 years ago.... !!", "djjlee7": "Isn't it exhausting being so sexy?", "acxr50": "Was a good watch for sure.", "karenemmert": "@hummusexual_lil_bitch - Lets watch Sunday?", "nicola.elise": "Is there any way to watch this is the uk?", "jungkarls": "Yessssss", "lushie_420": "Amazing concept", "hellocaitchy": "@rois52 nice we documentary for you", "segibsons": "Wait. July ?? 😞 I hope you mean January.", "rossrobbx": "I usually grimace when I orgasm", "_mellowjello": "Triggered", "gypsterdarling": "Yaaas!", "3rdproject": "Dreaming of you lying like this for me one day I’ll sweep you off your feet ✨🙃", "idiotbastardson": "@my_understanding_cat follow her", "myleneq.v2": "@psarahrios record it!", "i4m.unknown": "Keep the beautiful work 💪🏻💪🏻", "acidtripper666": "Is anything graphic shown", "dmarine0331": "I heart you. Can’t wait to watch.", "coffeebeankilla": "Seems like there mite be mature content, I'll have to ask my mother if it's ok, hopefully she says yes"}