{"jeaninnemarie": "The episode of sugar babies, when you were talking to a doctor who was a former sex worker, what brand of glasses were you wearing?😍", "celmasu": "@nellyzagury 😊", "jonnyhrdwood": "I need to get caught up", "robecho": "I’ve binged the season 😍", "lichk1ng": "Tag @yourtoxicaddiction pls", "jdvetloz": "@mwdhammer", "beatriztarancon": "@alternativegirl95", "billf64": "I just watched your \"Strippers\" episode of Slutever (On Demand on Viceland). I'm an older guy (but everything still works very well, thankfully) and I must tell you: you looked so hot in those black leggings and T-shirt at the end of the episode, when you were doing some moves on the pole, and having some really cool booty moves while sitting on the stage. I went to a few strip clubs years ago, but it's just not my thing. With that said, I would go to a strip club if you were there as one of the strippers/pole dancers. And not just because of who you are (although admittedly that is a factor), but more so that I can get an idea of how flexible you would be in bed (with me, in my dreams). You really looked great sliding down that pole your legs wide open, and you swirled around that pole like you'd been doing it for years. One of the best Slutever episodes. Well done, Karley❤️", "battlewaifu90": "Was this the finale? :( @karleyslutever", "valeriemkell": "@_erinowens_ I didn’t know she had a show and I’m freaking out.", "zoeyzoezowie": "whyyy isn't all this available for everyone online? 2019, Vice!", "martinigirl2004": "@karleyslutever I adored watching you attempting to master the pole. You are our every woman.", "reybies1": "Cant wait for the new season", "conjertipanekl": "Just watched this one!!☺", "ay_cup": "shouts to @devilspointpdx !!! 🖤🔥", "vinayak.sharma.7549": "Will there be another season", "hello_amycrow": "@hb_r", "shallowater": "@sam_czumak good speaking with you yesterday! Don’t be a stranger this summer!", "auryalescordes": "à quand la suite!!!??? =D *O*", "lexarenee__": "@amandimir_putin", "pupiniaalvarez": "@isabellamazzola @hagarlicknots @peternacionales @gardenofedyth @sewfalcons @wagnerchorus @sirainamusic @wagnerhightheater @corvyxofficial @thatboyyphil oh i forgot to blab that my 19 yr old autistic niece taylore took very good care of her 54 year old sugar auntie 😮 being live auditorium guests watching every minute of sing 2020 with no bathroom breaks so congrats again to issas team winning sing 2020 2nd year around while we all brag it about in our rehashed 5-10 sec instagram stories in the entire cafeteria like a bunch of whinny goo goo ga ga baby twerps cracking open a couple of sodas to splash on modenas pretty face getting all those 1000 likes thinking we're all superior than everyone else since we freeload out of our wealthy middle class privilleged 60 year old grown parents in our hug box singling out low income families that cant afford to enroll in sing and any other wagner high club which is so too bad 😂🤣 thank you pavelec, cutick, corn, mcloughlin & marinelo for having all the nepotism recommending my down syndrome asperger sister joelle for a guidance counseling position after she finally got her 8 year masters degree in nyu 2 days ago & happy wagner falcon pride of 2020 while the same rehash cycle repeats over & over.", "tatum___rae": "@currentlycara", "millouxsuicide": "..the one featured in this video", "livyvongoh": "@enxchante 💖", "skeletonkey8": "Great episode ❤", "elstatler": "Slutever is the only show I watch on Vice since Trixie and Katya went back to YouTube. 💗", "michaellynann": "I'm an ex-stripper, ex-pornstar, and ex-nude model. I love your show! I find it empowering as a feminist too.", "pixelmumbles": "@nrose_22 @binz2463 @darcied_ @odette.ross @shellstocks85 i love this show", "jacquelin.w": "LOVE YOU", "zafarwestern": "❤👏❤👏❤👏❤", "douf007": "I respect them because they are people like me and you.", "nikkaluh": "Head on over to the post about this on the @viceland insta for a h e a t e d discussion 😋💥🔥", "caughtupwithcrystal": "Tag my girl! @yourtoxicaddiction", "kawaduh": "@crystal.ball.kid", "vazztand": "🤤", "casino_mom": "@joaoqm", "ladyday817": "@mrs.cuen", "bailaraq": "Just climbing on the pole like that is actually super tough for a complete beginner!", "purpplehippy96": "Awwwww I feel like this was such a short season 😭😭😭😭😭😭", "gas_mask_girls": "@karleyslutever do a gas mask video ;", "l4ur3n_pl4nt": "I'm waiting for the strip/drag hybrid that involves crazy acrobatics and costumes. Like a kinked up cirque-du-soleil", "modamami": "@alexlucke", "jimrim0411": "Girl friend can swing that pool 👍👍👍🤪🤪🤪🤪💕💕💕", "fleuredeflorida": "YASSS now I’m watching this because y’all done right getting @yourtoxicaddiction on for this segment!!! 👏👏👏🙌🏻🙌🏻😻😻😻", "blackunicorn1974": "I love the show and must admit, I've learned A LOT! 💙🤘", "nomiruiz": "Stressed", "sidneywiththei": "werk dat pole... love ur show girl! @karleyslutever", "chosenffew": "@milliemcgall", "la.vita.nuova": "When will season 2 be available in Aus ? 😍❤️🌈", "skinnykatwoman": "you being on VICE is one of the best things to ever happen on that channel 💖", "liferoaming": "@heaneyxo you on the pole! 🔥", "beckypaws": "@alice_faeland is that you in the clip?????", "bepeculinary": "🤘🏼 🔥", "scarlettedo": "@steffmeisterr we should watch this!!", "madsjensen": "Rlly dumb question - but is stripping considered sex work ??", "jesse_j_fitz": "When are we going out", "ophidiainherba": "@petergadiot", "kevincake": "@ak_lmn", "mairanamira": "@curumina1", "pspdead": "😂karley looks like there’s a snake on the ground", "thelocaltalentpodcast": "🤔👆💯🔥", "1993foxbody": "So jealous!! Rock that shit girrrrrrl! 💃🏼", "triggagram89": "Looking good 💪", "smutbutt": "I freaking love you Karley", "koors512": "Love this one.", "holdencaley": "@alotta.ricotta this is the show I was talking about", "jaidalopez": "Love the show! 😍😍😍😍 All of your shows are extremely informative! 👌🏾👌🏾👌🏾👌🏾👌🏾", "emily_ott12": "Is there anywhere I can watch season 2 in Australia? I've looked everywhere but it won't let me.", "ludeste": "@naturegirl.x", "elizajbishop": "@wwbishop", "rubymidge": "@namelessnat this is guna be a goooood ep", "adriansims28": "😍😍😍😍😍😍😍", "cleodnine": "Omg omg omg my dream episode @panti.establishment", "jennifer_rose_12370": "Fascinating moment for me in 1992 in the woman’s restroom at Scores for the same reason... anthropology at its best!", "ash__trey": "Can't wait for this oneeee", "kitty_chesher4": "@kirstygoodacre", "lyzolko": "💕", "metalchris36": "@leena.gee Thought you might like this", "baz___lloyd": "Jou fokken naai man! Voetsek", "ptownkaia": "@themoonmama on tomorrow. Dude your fav. Dancer looks a wee bit like a puffer fish", "succube.666": "@racheledelapuenta and @linalemarin", "jillamunn": "Last episode?! @viceland y’all need to give her more production time and money, we need more episodes!", "pagcelt": "@whatstitch need to watch this!", "lolapoprocks": "We can't wait to see this episode tomorrow!!!!", "emmaloves__you": "@chrisgallagher21", "gizelred": "@_denisee07 I just saw myself 🤔😅🤭", "catdisco": "@1epicfish haha the beginning of the video is me trying to pole dance 😂 “show me what you can do” *nothing* “okay”", "anaelsav": "@kiimyross", "thecrystalfairy_": "@nickyaudio movie night? Haha", "brittany.may.no": "Is there a way I can watch this in NZ?", "nakednews": "Amazing work! Maybe a feature on Naked News and having you go through the audition process 😁😁", "k9troy": "You gotta take something off for us", "trinaaweena": "You forgot @yourtoxicaddiction", "steve16457": "You did good on the pole❤️❤️❤️❤️😍🔥", "thatsnatss": "You are wearing pants girl, you can’t grip the pole !;-)", "alexandrarose.storm": "🖤🖤🖤🖤🖤", "annathropology": "SEX WORK IS REAL WORK 🙏🏻🙏🏻❤️", "lozzlebezzle": "Once the clubs stop extorting the girls, and they’re protected like you are in any other profession it will be good. Until that time, most parties (bar the clubs) are the losers...I spent 8 years doing it, and flipped from feeling empowered, to feeling like the industry was taking advantage of everyone...", "noperesentt": "Fuck it upppp Bitch show them how its done", "yourtoxicaddiction": "Don’t forget me @karleyslutever", "heathafeather": "@cwright9fl", "wefuckinghatedonaldtrump": "Awesome work Karley!!!! 😍✊❤️", "meetmeinmontaukkkk": "Excited for this episode. But very sad it’s the season finale 😭", "blackswandon": "core strength is a lifestyle", "yourcassket": "Is there a way I can watch this online at a later time and not just sundays at 10 pm?", "nevie_stix": "👏🏻👏🏻👏🏻", "opal16_a": "Great show", "ill_art_illustrator": "Hi I'm a graphic designer... Kindly message me if you need quality artworks such as: Cartoon portrait 🔥 Illustrations🔥 Logo designs 🔥 Album cover 🔥 Song cover art 🔥 Flyer designs 🔥 And many more 🔥🔥🔥🔥 At affordable prices DM ASAP FOR MY SERVICES", "trajanjan": "@arcus.costas 💥check this", "barrierbabes": "LMAO Karley you go gurl", "ariannavargo": "i can’t wait", "hector_torres96": "That shit is hard.", "felicitydarling": "@lvbusby @knicolson", "crewel_art": "@jengoeswest *slides quarter over."}