{"iamtehran\nVerified": "Verified", "kisses_hannah_kisses": "😍😍😍", "fredy.dc": "what is the weirdest thing that turn you on (sexually)?🤔", "jewelosophy": "@highlight_reel_barbie_", "thelocaltalentpodcast": "Season 3 🤔", "the_mad_harlot": "This sounds spectacular ❤️", "princealiny": "@rebecca.lynn7355", "villanousone": "Love it!!!!", "andres.neumann": "Impossible to buy from Italy, any advice?", "brookaa": "@karleyslutever I absolutely love the series. It opens my eyes to all the weird and wonderful shit people get up to AND it prompts really in-depth conversations with my partner about our sexuality and desires and I thank you for that! Additionally every time I watch it I want to be best friends with you, you are so much fun! Keep doing the amazing work you are doing to start the conversation Karley X", "bolshoinoff": "when will episode 9 of s2 be aired? Thnx", "nigs282": "Love the show Karly. And you too 😍", "jessicvt": "This show is fkn EVERYTHING", "vdcguy": "Polyamorie, guess that would be hard for me, without love maybe but after a while, guess you start liking, loving that person. It's then that it all starts. PA, easier said then done, but i would try it to better myself💗💞😘👍", "stephjcaldwell": "I love your show!! You are frickin awesome💗", "simoneelise.x": "@mikailagodfrey here I am 😂x", "jenelleplett": "@amberneufeld", "nobrahnotevenonce": "You rode the cock carousel in your 20s and 30s and now you are surprised why you are the only single woman in your group of friends 🙄 keep giving women garbage feminist advice 😂", "a_is_for_enigma": "@myourick this is who I’ve mentioned a few times. Love her!", "tjk74": "🏆🏆🏆", "rashikdgaf": "best show", "nikistixx": "@gemstonepiercing", "dabbindeya": "@ryanferragamo this show 🔥🔥🔥🔥🔥", "tmullz": "@pagethrasher27", "mr_plantbased": "Love your 👄😉", "mdm_ees": "Can’t wait to binge watch! 🖤💋🖤", "billf64": "I am hopelessly in love with you, Karley. Thank God for women like you.", "agnesegustaite": "@imelenahart", "jenncostarica": "😍😍😍😍😍😍", "dexpeck": "Seriously...... How hard is it to find Bi guys?!? We're all over the place.", "artbybrix3": "love itt", "jesse_j_fitz": "Good show anti social host though", "iveth12089": "Your piece on bisexual men really helped me and my husband. After we saw that episode, my husband came up to me and told me that wanting to be in an open relationship. I told him, “yeah im fine with you doing that but it’s not for me.” We established our rules and all and we have never been happier. :)", "shamshamwow": "Loved this season!!", "too_gallus": "Karley how can we get in touch with you on behalf of @galpaluk", "danielacarusomodel": "Ciao sono una modella professionista", "all_world_is_yours": "amazing", "turfer198": "You are a beautiful!", "lila_kush": "💙u Karley!", "nattys_essentials": "@beellabee 😍😍😍", "in_state": "Loving the bi male visibility 🙌⚡️🙌", "soymariomartz": "Yas!!! Btw slutever should totally be on netflix", "beellabee": "Come over slut!!", "dinoaz20": "I fucking love you Karley. You are so beautiful and sexy 😘", "nastasiablackfeathers": "❤️", "garrettothomas": "Love this, 🔥🔥🔥!!", "hanniebode": "@sirkzz @tangerinedreamzz MOM", "k____dobson": "Yo @stephviatos Series 1 is on NEON", "im_yourhucklbarry": "I bet you are a freak! 🤞🏻👌🏻", "orientalrage": "Going to Westeros first", "yoyosup69": "Uncensored?", "tyson_tua": "Can’t wait till after work ❤️", "prom000": "Bisexual man for the win! 😍", "frequent__flyer": "Beyond thankful for you! You really helped me find out the true meaning behind pussy power. Because of you, I’m more confident in myself than I ever have been. Thank you Karley♥️", "lolapoprocks": "I had my sleepover Friday with my kinky sisters and introduced them to your show! They loved it!!!!!! We think you're amazing! There has to be a reason three!!! 😁", "martinigirl2004": "@karleyslutever My generation needed a woman like you. Rock on sista.", "dante.cerda.7": "Love the show Slutever cat Manor from the pet play episode was one of my favorite things 😍 ❤️.", "winklerdane": "I love this photo", "_errthangg_skanless43": "Damn that body is to die for and your sexyness omfg🔰💯💯💯💯💣💣💣👌👅👅👅😁", "still.alex": "Yayyy", "lgamma": "✨✨✨", "zahiaofficiel\nVerified": "Verified", "zafarwestern": "👏❤👏❤👏", "age_of_austerity": "Too bad It’s still not available in Europe, at least not in France 😢", "eaglesfan228": "I learned about weed lube on slutever and it was a game changer for us. 🤞🏻season 3. Do a episode on Molly sex", "mentallygrowing247": "Binge watched that shit and its AMAZING!! SEASON 3 where ru??", "granadojamie": "Karley you are so beautiful!", "cheyxnnee": "Why was this season shorter than the first season?? 🤔🤔", "michelleluisce": "I love this show so fucking much. Love from México 💜", "preston98": "This show is incredible! You’re incredible! Sex positive QUEEN!! 💖💖💖💖💖💖💖💖💖💖", "gzoldos": "We need to keep this thing going! @karleyslutever you are quite possibly the sexiest woman alive on so many levels! 🔥🔥🔥🔥🔥❤️", "matty__weiler": "@suhweetlu", "jonnyhrdwood": "Hottness🔥🔥", "noperesentt": "This is MY mother superior", "idgd_mario_perez": "You have educated me and enhance my abilities as a #vaginawhisperer thank you for all the #vaginaworship enriching and enhancing my abilities thank enriched my life.🌈🤘💞 #sandstar #Ballybunionbeach", "poodle_booty": "It was a good season but I feel It lost alot of the Pzzazzz that brought to Be a Fan Of Karley in gen. Over all season one was better (in my humble opinion) but none the less season 2 was still very educational minus the horse ep", "klyne": "@sophiavock omg should we switch our bar dates to slutever-n-chill dates???", "patticakes2point0": "Sounds amazing! Can’t wait to watch.", "waltonsworld": "Love this!!!", "eric___charles": "Purchased!!!", "jolisa__": "just finished season 2 so good! Bi men was my fave episode 💦💕", "jstarrb": "@ohkatieturner this show is slutacular ✨", "adrianferr": "🔥🔥🔥 season 3 ??", "bryguyspix": "Season 2 is already over??? T-T", "vim731": "Bi-sexual men?? Look no further.", "ronnarsh": "I want to be a slut", "sarasharnoffchesley": "Season three??🤞", "nataliamantini": "♥️"}