{"ritika_ht": "Do some research on this big issue instead of just position anything on social media. Lots of people following you at least have some courtesy towards them. I request to all of them stop influencing such kind of things on social media platform. 💙", "murthysid915": "Hippocracy from liberals.... Kashmir is only a part of J&K which includes Jammu and Laddak also...it was the right move...I stand with the decision of the govt", "limitless__affection": "Sorry your opinion is irrelevant.", "samchoudhary333": "Jo apni Maa ka nhi hua...Bivi ka nhi hua...Deshwasi us se ummeed lagaye bethe hai...Lage raho👉Ummid pr duniya qayam h", "shahbaaz_siddiqui": "When kashmir was accepted as seperate terrority so y again inko yad jagg uthi", "pranati.1209": "I am a big fan of urs.....and thts y I found it necessary to comment upon this post of urs", "mytaleoflove": "I respect u more and I mean it ❤️", "aniketbhikule_cr7": "Ye jihadi Soch wali Didi hai kya ?? 🤔", "wildfiresax": "Nobody gives a damn about your opinion in politics, they followed you for entertainment.. stick to that.", "heyitsjeeya": "Finally someone who choose humanity over patriotism. 🙌💜", "dimpledfox": "@priyasometimes I am a Pakistani and I truly appreciate your bravery for standing against the tyrant Modi. More power to you", "standforkashmirrr": "Thank u", "manideeparakshit": "I love your work and love you for championing feminism but, I do not agree with this take of yours on Kashmir. Kashmir was an integral part of India and thankfully will continue to be. #thankyoumodi ❤️", "hikabieber": "🔥", "mrcooltiwari": "Mam, that's @withkashmir user is not found any more. So I wish you have some sense & dnt ungli in everything.", "amitsinghlive": "It's delivered. Loud and clear.", "dentist_abhishek": "U r good for nothing.go n do something other than playing with mobile.. shame on u.", "tejas_tailor13": "@priyasometimes unfollowing you. Good bye. Disgusting thinking. Can't tolerate", "_veenmra": "Kashmir mai chali jaao didi. Army se bolenge stone pelting ho ya kuch bhi activity ho waha tumko bhej de 😄🥰", "mistercalcutta": "Loktantra😏", "kanzmair": "Pakistan Zindabad", "myname_ratan": "Chal hatt", "asrarjaat": "GOOD TO SEE SOMEONE STILL HAVE COURGE TO SAY", "mehroliyasamar": "Now I should unfollow u", "tanishaghosh95": "But, how is that account getting the updates when there is is blockage of internet and phone calls. How? Well, we know how. I adore you for your work, ma'am. But, you should for the least try to use your senses and question. If PM's message is not reaching to the Kashmiris ( according to your post) then how are the Kashmiris sharing their problems through internet.", "indian_fashion_network_ifn": "Sony worry very soon it ll be delivered", "kamalsharma08": "Come out of narrow mindedness .. this problem is temporary. But what has been resolved is permanent, so instead of breast beating you must cheer up ..", "sreebhakumar": "Unfollowing !!", "kiranprakash63": "All the pakistanis commenting here are supporting you. Then think about that 😊😊😊", "bartwalriya": "I don't know why celebrities and these Co actors disappeared when something happens with india people.. Muslims k time per aise tweet ho jate hai jaise they belongs to them.. 🤦‍♀️🤦‍♀️🤦‍♀️🤦‍♀️🤦‍♀️", "cynicinc": "I can't follow this account! Has Instagram blocked this account?", "s.pushkar05": "India ki chal rhino hai toh Gaddaro ki jal rae hai. Koi propaganda nae chalega tum pseudo intellectuals ka isbar. Aajtak governments sirf kehti thi ki Kashmir hamara hissa hai iss government ne Rahe sahe doubts bhi clear kardiye join galatfahmi dunia pale baithi thi. Jai hind aur bhaad mein gae tum sab unfollowing you", "soumik_namrata": "Never knew u cant host our national flag in a state in india before monday that's the darkness we were kept in during the congress era and you shithole liberals do anything for publicity by gaining a few followers after slanging a few ppl on national television", "muhammed_raqib": "Finally ... Someone raising voice 🔥🔥", "amarjeet17": "unfollow u disgusting leady👎", "kunika_24": "U need to get ur ass off from this country then😂😂😂 ! Pseudo intellectuals get some life n start learning...", "abinashpanda29": "👎👎👎👎 Unfollowing.", "aasiya_anas": "Well said priyaaa👏🏻", "m.zaiqa349": "Thankyou so much for this and don't worry about the people unfollowing you, it's good when the trash takes itself out:)", "asifmarium": "@priyasometimes really appreciate your post! Ans as far as the following comments are concerned, would like to say that\" kuch tou loog kahay gay, logon ka kam h kehna!\"", "getrohit33": "Get lost u..we support the government", "iamchoudharyvivek": "Take a chill ! 😂 Mota bhai 😘 @amitshahofficial personally handling this matter. 💯👍", "dhrumil_98": "not acceptable frm uhh😒💔✊🏻", "kaynatriaz": "Your tweet is everything.", "nirmohi03": "User not found, what is happening", "ninja7078": "she has no brain instead of standing with PM of india ,playing in the hands of separatist .Unfollowing her", "soulful_priyya": "Sorry Mam, but politics and entertainment are two different jobs. To run a country sometimes leaders have to take tough decisions and if u have any other option then only get involved in these things and if not better go with the decision and later do best as what an Indian must do for their Kashmiri friends and countrymen.", "mauktikgupta": "Aree didi... Aise kaise chalega didi 🦉", "deebafarah7": "🔴", "aishwarya.bamhankar": "Sorry priya unfollowing you. Followed you for your talent. But deshke aage kuch nahi. Kashmir sirf kuch logose nahi banta. Ladhak aur jammu bhi hai. Whatever was done was done for safety of people. Agar dange hote to bhi aap log hi neenda karte aur logoki jaan jati. Ab sab safe hai", "mayankind": "Akal anusar tu yehi expected tha. Sahi mayene main with Kashmir hua hai AJ Hindustan. Kripya tukbandi jari rakhe akal anusar", "asstappernipplefapper_": "BULLSHIT", "kirti_turkar": "Stupid woman, u don't deserve Indian followers.. Wanted to say a lot but my time is precious to me..! @priyasometimes", "notsabunnirma": "When will he type these english words himself rather than through his pr team?", "tasr.a": "This tweet is everything", "vids_always_blessed": "For the first tym disappointed by your point of view,it could be ok the way u think but it's for the beneficial of people there !!! What could be the selfishness behind this !! Requesting you to just re think once😃", "lopa_s_samant": "I am gonna unfollow you right at this moment miss pseudo intellectual...👎🏼👎🏼👎🏼 @priyasometimes", "collapsedcore_": "😂😂😂", "koushikdeepti": "As if you saw everything by your own.... Anti India", "yy_zz_x": "Nikal na bey pehli fursat me, bigg boss intellectual se itni hi ummed thi🤡", "ms_upadhyay414": "Thanks for the reminder madam to unfollow u by tagging the anti national account which don't even exist now... 😉 Kind of people like u Plz stop being the parasites for my country.. 😓😓 We don't need u at all.. If u really do care about them.. Help them in the best way possible.. And think about what you have done for them.. Otherwise go n get a job lady😏😏 #जयहिंद 🇮🇳", "hassan_bin_tariq_official": "Tum log ho hi begharat", "i_am_bhartii": "I followed you and was really impressed by your writing . I was one of your biggest fan till the moment I saw this post but this tweet and post proves your are antinational bullshit", "prgns77": "Dnt dnt try to mislead ppl ders evrythg oki in d valley..ur game of chasing popularity by mkg such tweets against our INDIA vl nt b tkn as granted..n fyi for ppl who say dt dis is inhumane dn wt abt kashmiri pandits who wer forced to leave der homes ovrni8, womens-girls wer raped.. Jst think wt pain dey suffered frm.", "bonny_prinxe": "😂😂😂😂", "sojaaao": "Unexpected.", "_akash_tiwana_": "😂😂😂 behti ganga m hath dhone aa gyi behn soch rhi h edi bhane fame mil jaega 🙊", "shubhi__chauhan": "Anti national spotted!!", "im_shiv_damade": "Unfollowing u!", "browneyedbaba_": "Lady u messed it up 🤣 hope you will do some research next time before posting shit. 😊 Unfollowing as of now 😌🙏", "sug_princess": "You know what's funny, no one is bothered about Jammu peoples feelings 🙄", "twinkle_2109": "User not found", "nivesh.saraf": "Unfollowing you!!", "harshit.gaur": "Am sorry ma'am but this time we don't care about the message is sent to the recipients or not, this time is we care about the nation , there is always some pros and cons of every decision we make in life but it doesn't means that we stop doing,", "osa.mughal": "And the page has been taken down...", "kaushik_aastha01": "Unfollowing you ! So Disappointed", "the_journalist4197": "Oh plz @priyasometimes keep ur shitty nd idiotic nd hatred Speech with urself..if u have so much problem thn where were u whn stone pedlers hurting our army nd making Kashmir valley hell", "dr.arneja": "@priyasometimes they have blocked @withkashmir Shameless govt", "the_baisa_nishima_ranjan_singh": "@priyasometimes kindly see news not these fucking terrorist page...bcz many Kashmiris r agree with it...", "apratimkhemka": "User removed. The government is behind their asses. Bastards of the first order", "narmeenfawwad": "Thankyou for #beinghuman❤️", "chokobartea": "Was really a big fan of urs but today you proved that you are also one of those who is playing the religion n kashmir card here n never expected you to be so irrational! Jnk doesnt only comprise of kashmir remember that! It comprises of jammu ladakh n leh as well...while kashmir enjoys all the facilities,ladakh n jammu suffered all these years in silence and there was no industrialisation or development in jnk for this section but ders hope now! Go n talk vd ppl of jnk n educate urself! Even ppl of jammu are replying u in the comments lol", "dineshchandila23": "@priyasometimes mam aap he bta do ke kya ho raha hai valley m ?????", "rupinderkw_": "🙌🏽🙌🏽", "thakur.monu.448": "Ms. malik its really...what kind of human you are...you are forgetting Jammu and Ladhakh and many kashmiri pandit... who has lost their house...to jo ye hua ye shi nhi lga...", "sagarpandey_07": "I know there's group of people who're always ready to oppose any decision taken in the favour of nation. I don't understand what kinda rubbish mentality there're carrying in. I'm unfollowing this lady rn! (It feels bad when you follow someone for their good work for society and when the time comes to show their love for nation, these craps raise their voices against the betterment). SHAME! 😑", "thebhram": "Solidarity? Or bruning?😂😂", "parteek91": "This is the bravest decision made in Indian History. What is your problem?", "__rohancool__": "Now she will look at abusive comments, take screenshots and post it. Again she will blame the government for abuses. 😂😂 #modihaitohmumkinhai #jaihind", "attika_sheikh": "We need more people like u.....💯💯💯respect....#courage #guts", "priyanshii_mehta0xz": "Are you kidding me ?! That acc is anti-national. It’s run by separatists. I REALLY admired you. You’ve just enraged everyone who once respectED you. Please do your research. Have you even heard the CM of Ladakh speak about this?!", "malavsukharamwala": "I had too much respect for you since bigboss but the way your approach is on article 370 is just freaky.!", "sohailrafat": "True. Very sad", "the_stubborn_leo": "Hypocrisy from you was never expected. You're actually defending separatists who have long intended to disintegrate Kashmir from our motherland? You're protesting the abrogation of a law that guarantees the complete integration of the valley with India? You're defending the tukre-tukre gang who keep screaming anti national slurs,such as, \"Bharat tere tukre honge\" and \"Kashmir ki Azaadi se, Bharat ki barbaadi tak\" etc? Are you insane? It seems normal for you to allow separatists and fear mongering politicians in the valley to continue attacking India's sovereignty and integrity! Horrendous approach, I must say. This is quite alarming, to see pro Pakistani stance coming from you. Now let me tell you something, I'm not affiliated to BJP or any other political institution, but I sure do support the abrogation of article 370 and 35 A and will continue to, because as an Indian, national security comes foremost for me. Does the same logic applies for you? I will continue to glorify my armed forces because I owe my life, my security and stability to them. The Indian Armed forces are as much as responsible to the Kashmiris as they are to any other Indian citizen, and it's only because of them that Kashmir, even though 3 days have passed since this despicable act has been scrapped down, not one separatist, fear mongerers or Pakistan induced terrorism has been successful in causing instability in the valley. Apparently, human rights violation is only an issue when it concerns minorities,eh? Why do you \"liberals\" keep mum when asked to comment on the exodus of hundreds of Sikhs and Kashmiri Pandits? An attempt to disintegrate and fuel communal hatred amongst Indians? Well, let me tell you something, doesn't matter how hard, people like you, people like Kunal Kamra, Kanhaiya Kumar and that guy in blue t shirt who demanded an Azad Kashmir in JNU yesterday try, Hindus and Muslims will continue living together in peace and harmony, just the way that it's supposed to be. Radicals and their fabricated propaganda of lynching minorities to defame Hindus won't work anymore. A Hindu would never hurt a Muslim for differing on religious beliefs and the other way around as well.", "luna__zorro": "This profile has disappeared??", "radhikasharma_jk": "Why are you forgetting Jammu n ladakh here. Are you aware evn a bit of these two??", "mc.savasher": "Bohot hard", "sandy1sharma1": "Mere friends ke ghar hai abhi bhi waha pe,ab unko apne ghar wapas jaane ki umeed jag gayi hai.unko nikaal diya tha waha se.tab kaha the ye intellectual people .Thanks to modi government.", "the_tea_riffic": "O u just loose not solidarity but many followers because u generally stand with the right thing but here u just acted oversmart.", "leo_dives": "Why ain't u with laddakh and Jammu?? Why only with Kashmir??.... How can we expect intellect from a Bigg Boss celebrity", "beedecent": "How toxic and negative you are.", "shawhassan7": "Immensely appreciate your gesture 🙌", "pastprsent": "Disappointed in you Miss Malik", "ajayjasoos": "Yes it will madam. Am replying to you from jammu", "honkmr": "So that is weird. You just removed the kashmir account u had tagged . Why? Also I was also against as to how this decision was executed but ran a quick eye on the now deleted account link and saw all ANTI-INDIA posts. Like all and few pro-pakistan. A page that does not even post balanced nuances from both countries , you support them? Wow", "dipps_chaudhary": "@priyasometimes I really respected u.n ur opinions.but recently your views and thinking has forced me to dislike u..n unfollow u..we as citizens of India should be supporting our govt in this kashmir issue..n scrapping of article 370..but people like u are disgrace to this country..", "farah__alavi": "🙌🙌", "dharam_desh": "In 12 hrs, whole valley was purged and non-muslims eradicated", "creativvecrab_": "Jammu b aata hai saath mei hi", "mehriyaab_umair": "I stand with kashmiri people's😢", "sara_ali_bhatti": "Really u r with kashmiri ppl?? Appreciative 👏", "maynkdarji": "Don’t worry. They will. Ajit Doval is in Kashmir to deliver the message. You can play on twitter while actual workers are busy on the ground to deliver the message.", "shubhi_rockstar": "I also feel that the way it is announced is inhuman, but i think certain decisions are takem considering all consequences, if they haven't send those many army troops who will take responsibility of massacre, protest, burning of property in the Kashmir as no one can deny the fact that there are lots of secessionist/separatist in the Kashmir who may have taken decision destructively", "abhisheksinghania90": "But if u want we do deliver you to hell", "merabhaidaaniyal": "Savage😂"}