{"ashutoshshindephotography": "Amazing composition.. keep them coming🤗👍💐", "soniiaverma": "Causal dating ki iss duniya main , haath pakadne wala dhoond rahi hu❤️", "lavinabachchani": "Casual dating ki is dunia mai.. hath pakdne vala bhi doond ri hu 😍", "thecookingsoul": "Casual dating k zamane me hath pakadne wala dhund Rahi hu", "life.is.a_retrobeat": "EVERY LINE IS ❤️", "nra946": "\" Ig stories ke zamaane mei koi kahani sunnane wala dhund rahi hun\" aare ma'am very beautiful line . P.S. apne case mei bas dhundh raha hun wala scene hai😋", "ambareenshaikh": "GOLD! ❤️", "_girl.from.the.star_": "Instagram stories ke zamane me kahaniyaa sunne aur sunane wala dhundh rhi hu! Me 2019 me 1999 dhundh rhi hu ♥️♥️", "nishta.patelpvt": "Beautifully written😍", "kkathpalia": "Jise na Meri commitment se dar lage.. Na space mangne ki Jarurat pade..", "simranbrijwani6": "It's beautiful. So difficult to pick a line when every line of it becomes your favourite. ♥️", "rojalins": "Soya milk coffee ke jamane mein ek adrak wali chai dhoond rahi hnu....I drink soya milk coffee almost everyday but whenever I get chance to drink adrak wali chai it touches my soul. Love each word of the poem @priyasometimes 😊", "niyati.kothekar": "❤️", "picked_a_pen": "Jo Gucci aur armani m hi nahi, sade kapdo m bhi khaas lagta ho....❤️", "maggi1506": "Jo sirf armani or gucci kein nahi, saade kapdo mein bhi khas lagta ho💕", "lilcutie__04": "Casual Dating ki iss Duniya mein haath pakadhne wala bhi dund Rahi hoon Mai 2019 mein 1999 dund Rahi hoon😇😍😘...This lines are literally awesome ✨💖", "arshyy_khan": "Main 2019 me 1999 dhoond rahi hu ❤️❤️❤️ @priyasometimes favourite line. Le gayi wapas purani yaadon me wo bhi ek hi pal me. Yaaden jo ab bhi dil me taza taza hai bas bayaan karna mushkil hai kisi ke aage. 😍😍😍", "winsome.cupid": "#insta stories ke iss zamamne mein Khaniyann sunne aur sunna wali dhoond rahi Hoon......🥰🥰♥️♥️", "imnids12": "Jo keto diet mein nahi.. roti, dal, chawal mein vishwas rakhta ho.. @priyasometimes 😍", "coasterland__": "Jo shirf armani or gucci m ni, saadhe kapdo m bhu khaas lgta ho💕", "ranjana20july": "Casual dating ki iss zamane main, hath pakadne wala bhi dhundh rahi hoon.... ❤❤❤", "abeer.asif96": "casual dating ke zamaney mein hath pakarne wala dhund rai hun ❤️", "subi.khan05": "Watever u write and narrate is my favourite ❤️❤️❤️❤️", "manpreet.k.mahal": "Instagram k zamane main#kahaniya sunne sunane wala dhoondh rai hu", "lilmisskataria": "Instagram stories ke zamane Mein kahaaniyan sun ne aur sunane wala dhoondh rahi hu! Mai 2019 mai 1999 dhoondh rahi hu ❤️ behadh khubsurat", "thegarimastha": "Soy milk coffee k iss zamane main , adrak wali chai dhoond rahii hoo", "shantankhare": "Mai 2019 mei aise jazbaar dhundh raha raha tha. . Thank you so much for reciting n writing such a beautiful poem ! ❤️", "aayushiak": "If I may say each and every line would u agree ? ☺️", "paruularora": "Instagram stories ke zamane mein, kahaniyan sunne aur sunane wala dhundh rhi hu. ❤️ This has my heart completely! I have that melting feeling inside whenever I hear it...& you bet I have heard it a thousand times but never seem to get enough 🤤❤", "banddana_sahu": "High speed broadband ke zamane me, kahaniya sunnane wala dhoond rahi hu💖", "shadab_hussain27": "All the lines 😍😍😍", "invitedin": "काश तुम मुझे 1998 में मिले होते", "birvabhavsar": "Jo sirf Armaani or gucci main nahi, saade kapdo main bhi khaas lagta ho 💜!!", "anks.bany": "This will stay with us forever♥️", "new_bee97": "Instagram stories k zamane me kahanio sunne or sunnanewala dhundh rahi hu !", "iiateeqii": "Best ever ...idk y but i had tears in my eyes ...so touching 🔥🔥🔥💜💜❤️💙", "hadiyamalik20": "Jo sirf Gucci or armaani mai nhi saade kapdo mai bhi khaas lagta ho❤", "himaensh": "💜💜💜💜💜💜💜", "thegurpratapsingh": "Adrak vale chai!😍 . Once upon a time u also quoted this : \" sardiyo ke dhup, ghar ka aagaan aur garam chai.\"", "shrutijain22": "Every word of it is just fantastic...loved it to the core😍", "gitanshluthra": "\"Kaash tum mujhe 1998 mein mil jaate!\"", "crafting_the_green_earth": "Vertical garden ke jamane me ek tulsi ka podha dhundh raha hu, main 2019 me 1999 dhoondh raha hu! 🌳🙌❤️", "sadi0590": "The entire poetry and the way u recite it 💖", "ritikaanshul": "Every single word👌🔥🔥", "sanjhari": "\"Highspeed internet se Ek Dialogue\"👌👌❤️❤️", "_riya_dutta": "No strings attached ki iss duniya mein, raghbat ka Kaleen bunne wala dundh Rahi hoon.", "aaaakankshaaaaa": "no strings attached ki duniya mein rugbat ka kaalin bunne wala dhund rahi hun🙌", "kala_surabhi": "The poem is simply amazing.My friend sent me the link to hear this .I now became fan of yours.Like literally m going through Ur each poetry.Hope to u meet you soon in person..😀", "the.wayward.lady": "The entire poetry is love 😍", "preet_1405": "It's the whole poem..that too relatable❤️", "prince_of_zilch": "No strings attached ke iss zamane mai, ragbat ka kaleen bunne wala dhoond rahi hoon.", "kaur_1310": "Jisse swatantrata pe kaboo Nahi Mere Dil me jagah banani ho❤️❤️ Jise sirf hawaye nafz ki parwah Nahi Meri Khair o aifiyat ki bechaini ho 💞", "afffrriinn": "Instagram stories ke zamane mein kajaniyaan sunne aur sunane vala dhundh rahi hoon❤️❤️this line got straight way to heart❣️@priyasometimes totally in love with this piece watching everyday just like you listen your favourite song again n again❤️", "shivamrajput.28": "iPhonex ke iss zamaane main, Nokia 3810 dhoond rahi hoon, Soy milk coffee ke iss zamaane main, adrak waali chai dhoond rahi hoon, Zuchhini noodles ke zamaane main, vegetable chowmein dhoond rahi hoon, High speed broadband ke iss zamaane main ek dial up connection dhoond rahi hoon, Instagram stories ke iss zamaane main, kahaaniya sunaane waala dhoond rahi hoon Main 2019 main 1999 dhoond rahi hoon Jisse Netflix ka craze na hokar, Shriman Shrimati ka chaska ho, Jo fat free almond butter na hokar, fresh paav pe laga maska ho, Jo Keto diet main nahi, dhokla undhiyo main vishwaas rakhta ho, Jo sirf Armaani or Gucci main nahi, saade kapdo main bhi khaas lagta ho, Jisse meri swatantrata pe kaaboo nahi, mere dil main jagah banaani ho, Jisse sirf hawaye nafs ki parvaah nahi, meri kher-o-aifiyaat ki bechaini ho, Jisse na darr lage meri saari se, na khauf ho mere miniskirt ka, Jo sirf waqif hee nahi lekin aqeeda bhi karto ho mere feminism ki sabhi daleelo ka, Jisse na meri commitment se darr lage, na space maange ki zaroorat pade, Jisse qurb ki tishnagi ho, jo mohabbat ko shiddat se kare, No strings attached ki iss duniya main, raghbat ka kaleen bunne waala dhoond rahi hoon, My place or your place ki duniya main, apne nasheman ko mere aagosh main dhoondne waala dhoond rahi hoon Main 2019 main 1999 dhoond rahi hoon, Casual dating ki iss duniya main, haath pakadne waala bhi dhoon rahi hoon, Sun roof ke iss zamaane main, parchhati pe chhadne waala dhoond rahi hon Main 2019 main 1999 dhoond rahi hoon, Main 2019 main 1999 dhoond rahi hoon, Kaash tum mujhe 1998 main mil jaate ....mere toh poori poetry favorite hai Mam ❤😇", "smruti_khadse": "Soy milk coffee ke zamane mein adrak wali chai dhund rahi hun!!! 😘", "swati_tamanna": "Main 2019 mein 1999 dhund rahi hu....❤️", "samvednarajput": "Instagram stories ky zamane mein kahniya sunne aur sunnae vala dhond rahi hu", "tik_tok_wala_ladka_": "Status stories k zamane me.. love lettwr dhundna 😜", "nandhanaaaaa": "Every single line from [2019 mein 1999] is my favorite ❤️🙌🌸🌹😍🙏", "akanksha__chauhan_": "जिसे मेरी स्वतंत्रता पे काबू नहीं, मेरे दिल में जगह बनानी हो  जिसे सिर्फ हवाएं नफ़स की परवाह नहीं, मेरी ख़ैर-ओ-आफ़ियत की बेचैनी हो  जिसे ना डर लगे मेरी साड़ी से  ना खौफ हो मेरी मिनी स्कर्ट का जो सिर्फ वाकिफ ही नहीं लेकिन अक़ीदा भी हो मेरी Feminism के सभी दलीलों का  जिसे ना मेरी कमिटमेंट से डर लगे  ना स्पेस मांगने की जरूरत पड़े  जिसे कुफ़्र की तृष्णगी हो  जो मुहब्बत को शिद्दत से करे I like all words of your poetry ma'am @priyasometimes", "alwaysandforevermo": "Jisse na meri commitment se dar lage na space mangne ki zaroorat pade jisse qurb ki trishnagi ho joh mohabbat ko shiddat se kare 🔥🔥🔥", "kirti_dhanuka_": "Every line ♥ how can I select anyone!", "ssajwan0901": "No strings attached ke jaane.....", "merakimysoul": "\"Jo sirf Armani aur Gucci mein nahi... Sade kapdo mein bhi khaas lagta ho\"- the best line... Because that's something which I feel from within that a man/woman should look good not because of brands but because of what he/she is.", "ayushisinghgaur16": "No strings attached ki is dunia me, radbad ka kaleen bunne val dhundh rahi hu. ♥️", "nanditasatpati": "Agar main kahun ki mujhe 2019 me 1999 wala har baat ek hi thikane par mil gaya hai .....😍 Isn't that so romantic......", "ankitasahoo_": "Jise na meri commitment se daar lage , naa space maangne ki jarurat pade.😌💕", "p.kacker": "Airtel ka network bhi", "nehal27": "No strings attached की दुनिया में रग़बत का कालीन बुनने वाला ढूँढ रही हूँ", "rashpathak01": "This is one of my most favourites Priya. Loved it ♥️", "revtirazdan": "Instagram story k zamane Mai kahani sunne,aur sunane waala dhoondh rahi hoon", "the.____.lucifer": "Whole poetry was awsm mam❣️...it was so heart touching and heart warming♥️apki har poetry Kisi na Kisi trha se inspire krti hai✨", "__curlyaffair": "It's difficult to tell my favourite one, I'll end up writing the whole poem 😍😍😍😍❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "anjalia04": "❤️", "aasthagupta615": "The one you have posted 👌", "anjali.kashyap216": "सच में आपकी आवाज की दीवानी हूं मैं और उपर से ये जो आपने हमारा बचपन से रूबरू कराया हैं। उसके लिए आपको बहुत बहुत धन्यवाद!", "rbnarora": "My fav \"Kaash zindagi mai, kaash ki ehmiyat hoti\" and word is \"Kaash\" aap kahi pe laga lo, pura scenario change kar sakte ho... kaash", "prashantdingrani": "Jise sirf hawayein nafas ki parwaah nahin, Meri khair-o-aafiyat ki bechaini ho Jise na dar lage meri saadi se Naa khauf ho meri mini skirt ka Jo sirf wakif hi nahin lekin akida bhi ho Meri Feminism ke sabhi dalilon ka Jise naa meri commitment se dar lage Naa space maangne ki jarurat pade Jise kufr ki trishnagi ho Jo Mohabbat ko shiddat se kare No strings attached ki duniya mein Ragbat ka kaalin bunne wala dhoondh rahi hoon", "sania.saifi_": "Casual dating ki is duniya me, main hath pakadne wala dhud rahi hoon .", "anweshaaaroy": "Instagram stories ke zamane mein kahaaniyan sun ne aur sunane Wala dhoond rahi hu! ❤️", "_sidrah___": "Jo sirf Armani or Gucci m nhi, saadhe kapdo m bhi khaas lgta ho❤", "gauravadani": "Instagram Stories ke zaamane main kahaani sunne Aur sunane wali dhundh raha hu❤️❤️", "58.barsha": "Casual dating ki iss zamane me hath pakadne wala bhi dhund Rahi Hu..❤️", "r_anchal_mahar": "Casual dating ki is dunia me mai hath pakadne wala bhi dhundh rahi hu..💕", "nushahaha": "💖", "samarpana_singh": "Instagram Story k zamane me, Kahani sunne sunane wala dhundh rhi hun 💕", "dikshapaudel": "Soymilk coffee ke Jamane me ek adrak wali chaye dhoond rahi hoon... Each lines r precious😘❤️ mein 2019 me 1999 dhoond rahi hoon😍", "alolikasutradhar": "Although all the lines strike a chord at the heart but these are a bit more special than the others to me \" Jo sirf waakif hi nahi akeeda ho meri feminism ki daleelon ka \"", "_miss_mess_up": "जिसे netfliex का craze na होकर sriman srimati ka चस्का हो.....❤️", "_beingesha_": "Love from🇳🇵🇳🇵🇳🇵.fan since bigboss ❤️❤️❤️🙏🙏🙏", "garimajodha": "Casual dating ke is zamane me, hath pakadne vala b dhundh rahi hu.. No strings attached ki dunia me, ragbath ka Kaleen bunne vala dhundh rahi hu ❤️❤️", "ahbiv_007": "My place और your place की दुनिया में अपने नशेमन को मेरे आगोश में ढूंढने वाला ढूँढ रही हूँ 💖मैं 2019 में 1999 ढूँढ रही हूँ 💖 @priyasometimes", "krishna__vala": "insgram story ke zamane me kahani sunne or sunane wala dhundh rahi hu ♥️", "aachal_agr": "Jo Fat free almond butter n hokar , fresh paw m laga Maska ho!! ❤️. Jo Srf Armani or gucchi m nai , Sadhe kapdo m Bhi Khash lgta ho ❤️❤️", "decemberist_girl": "No strings attached ki is duniya me, radbad ka kaleen bunne vala dhund rahi hu", "pre_ttypatel": "instagram story ke zamane me kahani sunne or sunane wala dhundh rahu hu @armyaksh ❤️❤️❤️❤️💋", "ritikamarkandey": "Soy milk coffee ke zamane main adrak wali chai dhund rhi hu💕. Instagram story ke zamane main Kahani sunne aur sunane Wala dhund rhi hu❤️", "__nikita_sometimes__": "Instagram stories ke zamane me kahaniya sunne or sunane vala dhund rahi hu", "kinda_stranger": "Jo sirf armani aur gucci me hi nhi sadhe kapdo me bhi khaas lagta hai ..... so cute ♥️", "deepti_gupta__": "Instagram story ke jamane me kahani sunne awr sunnane wala dundh ri hu", "shubhammishra1148": "Each n every line because bahut achi poetry h apki 2019 mein 1999 dhund rhi hu 😍😍😍❤️❤️❤️", "unrevealed_tale": "जो सिर्फ Armani और Gucci में नहीं सादे कपड़ों में भी खास लगता हो जिसे मेरी स्वतंत्रता पे काबू नहीं, मेरे दिल में जगह बनानी हो... Casual dating ke zamane mein hath pakdne wala dhoond rhi hoon... Aur ye sunte sunte mein aapki fan se die hard fan banti ja rhi hoon😍😍🥰 @priyasometimes", "aniiiishaaa": "Casual dating ki iss duniya main, haath pakadne waala bhi dhoon rahi hoon, Sun roof ke iss zamaane main, parchhati pe chhadne waala dhoond rahi hon😍", "saumya.o_o": "Instagram stories ke zamaane me, kahaniyan sunne aur sunaane wala dhoond rahi hu.😌❤ these lines said it all. Thanks for putting these hard to find feelings in this poetry. @priyasometimes .", "indiancurvychic": "Every line is so amazing, it's so hard to just choose one. Loved it and have been listening it every day again and again. ❤", "manisharatnoo7": "इंस्टाग्राम स्टोरीज़ के ज़माने में , मैं कहानी सुनने और सुनाने वाला ढूंढ रही हूं....casual डेटिंग इस दुनिया में हाथ पकड़ने वाला भी ढूंढ रही हूं... मैं 2019 में 1999 ढूंढ रही हूं♥️♥️", "ommchaturvedi": "No strings attached k is zamaney mein ragbad ka kaaleen bunney wala dhoondh rahi hoon❤️❤️❤️❤️", "tareba_raza": "Jise sirf hawaye nafs ki parvah Nahi, Meri khair o aafiyat ki bechaini ho", "nihu_024": "जिसे ना मेरी कमिटमेंट से डर लगे  ना स्पेस मांगने की जरूरत पड़े  जिसे कुफ़्र की तृष्णगी हो  जो मुहब्बत को शिद्दत से करे 😍😍", "pearl.mathias": "Instagram stories ke zamaane mein Kahaniyaan sunne aur sunane wala dhoondh rahi hoon 💜", "writer.and.foodie": "Beautiful poetry ma'am.", "aasthachoudhary_": "No strings attached ki iss duniya mei rugbat ka kaalin bunne wala dhundri hu", "nandini.matta": "\"Coffee ke zamane mein ek aadrak wali Chai😍dhoond rahi hu\"❤️💕 hats off ma'am🙌", "roshnaa._": "Casual dating ki is duniya mein mein haath pakadhne wala bhi dund rahi hun😻♥️", "i_am_vaibhav_02": "Casual dating ki iss duniya mai haath pakadne wala dhood rahi hu"}