{"abhijitbiswas": "Leftist and tukde tukde gang supporter. No comment when temple was vandalised and our hindu goddess photo was burnt and when they were chanting chahiye azadi hindu se. Best way to handle such psedu naxal mindset in UNFOLLOW.", "tanishk_official": "They are saying beti bacho beti padhao and here no beti is safe even beti's are also brutally beaten up ....cruel people", "yungmonc": "Lame.", "krishnapriyasings": "👏👏👏", "yash01_05": "Ab log sadko pe aa rhe hai de rhe the vote unhi ko gaa rhe the gungaan unhi ke tb andhe the kya?", "kanthariaharsh": "Good work on JNU #gotwhattheydeserved", "yaseen_a_ansari": "👌👌👌👌👌👌👌👌👏👏👏👏👏", "rashmi_das": "@prachijha26030", "sameerchandratreya": "#jnuattackbyleftists", "roshni5130": "Jo is sarkar ko support nahi kiya to...aane wala samay may desh jazoor khoon.....may........aap samjdar ho.....", "007ocean": "Mere taraf se unfollow rhega aapko.", "komalsingh_24": "Haa 1984 Sikh riots , UP me itne riots sab me to bjp hi thi n, kuch bhi bol ke chutiya bna do logo😅", "thatmessyone._": "Little knowledge is dangerous. #nohate @priyasometimes", "ohnopersephone": "The akhand, absolute ignorant chutiyaapa in the comments will leave you scratching your head with how these people continue to live on with this fucked up mindset they have. More power to you @priyasometimes", "therishank": "Film industry valo ko........ Kuch bhi.. kabhi bhi... Kahi bhi.... Bas bakwas karva lo bina jankari ke....", "namu_mita": "Shame on you pretending to be indian but totally antinational you are ! Ohofcourse you are from Australia! Shame on you lady !!", "biharan_tale": "Hey, it's @biharan_tale here. If you like fresh new Poetry then follow me for more daily fresh contents.", "ankursinghthakur98": "I am.going to unfollow u", "mama_and_arjun": "Madam aapki history knowledge zero hai ! Kabhi Kashmiri panditon, Sikhs pe hue hamle 1984 me, Golden temple me ghus k marna, ya for hazaron santo ko", "theweekend_detox": "Now JNU ppl are supporting to jammat ppl. Wahi jammati jo desh aur desh me corona failaane k kaam kar rahe he.", "owais_97_2310": "RSS people are the one who have supported the British to stay back and rule in India.", "insta.deepti": "Oh really priya?? @priyasometimes you have recently started living in india after bigboss and so much concerned?? It's nothing new ok... Stop blaming one side. If you are so called intelligent then think and speak both sides. You have bigger responsibility so think before you post something!", "sharmapuneet01": "Ye maharana pratap, shiva ji, Prithviraj chahuan ki veer bhumi hai.", "shailesh.2400": "JNU is totally dramaebaaj. Ban anti national JNU", "pizzawithextracheese20": "🙌", "jyothisingh88": "Well said🙏😍", "kahkashanchishty": "🙌🙌🙌", "sakht_boi_3112": "Agar wwiii hoga toh meko pehle India me dekhna hai q ki Hindu Muslim ki ladai saalo si chali aa rhi or ab tak chal hi rhi hai 21 century me bhi or yaha par sirf 2 hi din sab ek hai aisa dikhega 15 aug or 26 Jan ko baki ke din ye bjp se hai ye yani ye Hindu hai or ye Congress se hai yani ye Muslim hai ek hi baar khatam kro yaar q ki yaha par koy insan nahi hai sab particular dharam se belong karte hai", "therimerqueen": "Kashtiyon ko kinaare mil hi jayenge khoon sarkar bahati hai to kya dooriyan dilon ki hum khud mitayenge kehte hain doobte ko tinke ka sahara hai kafi toh tinka tinka jod kashti apni khud sajayenge", "dp_kuldeep": "Kuch bhi🤣🤣🤣", "vintage.whiskey": "Koi bataye inhe AVBP ... Koi sarkar nahi hai ... 😂", "dharam_desh": "Professional protestors , with bias and prejudice are constantly fanning opinions of young minds with one sided story ! They are on puppets of people who are driving their narrative through the paid Celebrities !", "sorabh_chadha": "1984 ki baat kar rahe ho !?", "abhisalunkebgm": "Ab khun dikh raha hai... Pahele jinka khun baha o pani tha pata chal jayge kisne jnu me atack kiye hai juldbaji bayan mat do log apko folow karte kay iska fayda mat uthav...", "shivam07007": "Tu australia ja behen", "amit_dwi24": "Propaganda of fear mongering starts without knowing reality or both sides story & by making assumptions through Anurag Kashyap's tweets .", "sardarni1092": "My mam my dreem aap se ek bar milna ji🙏🙏", "dineshchandila23": "Mam people like you .. no proof no case sedha bta dete ho ke yeh ush party ne kara ... kuch toh sharam kare ... court bhi kese baat ke liye hai .. yaha aap jese log he btate rahenge kaun galat hai kaun sahi ..", "mr.xinsituations": "JNU ko ban kar ke", "vikrant.sehgal13": "आज़ादी के नारों से जब तक तुम्हारी गुलामी की जंजीरें टूट नही जाती तब तक हम बढ़ेंगे हम लड़ेंगे जब तक खून न निकले कानों से तुम्हारे तब तक हम अपनी बहरी आवाज़ से बढ़ेंगे हम लड़ेंगे हमें देखना है कब तक लोग खुली आँखों का अंधापन लिए अपनी ही बहनों के सिर फोड़ेंगे हम लड़ेंगे इन आँसुओ में पसीना है सैलाब है, तुम्हारे भी इंक़लाब का हमे देखना है कब तक तुम्हारे बारूद इस घर में जलेंगे हम लड़ेंगे कब के मर चुके हो तुम हम जानते हैं, मग़र देखना है अपनी सड़ी लाश का बोझ कब तक साथ लेकर चलोगे हम लड़ेंगे।", "shrutisweet14": "My Cutiee Pieee Miss You🤗😘😍✨🌸", "_harpalsinh.hs89_": "🙌🙌🙌", "pradipshrivastavaofficial": "ऐसी तैसी तुम्हारी", "cloud._.walker_": "आप लेखक है आपको हजारों-लाखों लोग पढ़ते हैं, कम से कम आप तो वास्तविकता को लिखिए। पहले देख लीजिए समझ‌ लीजिए कि कौन है वो लोग जो देश में अमन को पसंद नहीं करते। या फिर आपका भी जेएनयू के विद्रोहियों से पुराना रिश्ता है।", "spice102490": "Heartless government making youth leaders bleed. Democracy has been humiliated and abused. Goons rule the roost. Anarchy, oppression, destruction, distress are what achhe din have given to us. But will not say ‘cry beloved country’ because we will sacrifice every thing to keep it smiling. WE SHALL OVERCOME"}