{"peterob2112": "Which government? You are talking about the ones give no freedom of speech to their citizen’s right?", "pinakp": "If people like u earning money thn there is no crisis... no talent n Haa Darrr Accha h 😂 @priyasometimes", "shubhrahanda": "👍", "sagar_mahi79": "OK no problem I have not given vote for onions prices increases in India . I have given vote for the government to do something which is delayed by 70 years", "abhi_sing": "Social Naxalites", "rishabh_goyal99": "U know what ,ur words have started overpowering my love and admiration for u . Yeh kaisa drr hai jo aap ko sareaam kuj bhi bol dene se nhi rok paa rha , i think iss drr ne aap ko aur sashakt bna diya hai ,(BTW i am a punjabi,itni hindi iss liye likh rha hoon kyunki aap ko pasand hai) , aisa drr bhagwaan kre sab ko ho .JAI HIND.", "pkavari": "Sick minded.", "sayn1313": "😢", "ruthor98": "😂😂", "ambernayyer": "@arslan_khushnood", "chander4806": "Kabhi kashmiri pandito K baare mai bhi kuch post krlo, ek tarfa secularism kaa thekaa matt lo 😠😠😠", "itsgurum": "@priyasometimes Urban Naxalites", "rosiantis": "wow", "khaledjix": "Many crisis and Happy New Fear", "sufiii_i": "👌👌👍", "lazy_soul35": "and we all persecuted Minorities want to wish go back and read, Go back and real all amendments.", "tanmay_vk": "#SupportCAA", "prithvi._._": "And the same woman is critizing and simultaneously crying that govt. Is curbing freedom of speech.... hypocrite_didi", "kashyap__sid": "If there was crisis you wouldn't be able to afford data and write criticisms. If there was fear you could not have posted this socially.", "sid_089": "Fear of staying in a country like Syria or Afghanistan? or getting beheaded by ISIS?? Or fear of stuck in war? Or fear of begging for refuge in other countries?? Or fear of not allowing you to practice your religion? Well all these are in Middleeast. If you are from those countries then do post in social media. Don't post like a naxal if you are an Indian. Be Happy that your govt is not like Middleeastern countries.", "thakur_sherkhan": "Heyyyy Urban Naxal. Best wishes !!", "tyagidrnatasha": "👎👎👎👎👎", "dpk_garodia": "@grumpyreads your doing!?", "_p_a_n_k_a_j._": "Sick", "kahkashanchishty": "Hm bahut khush hai yeh caption dekhkar ki aaj bhi aap jaise log ,hai I salute ur humanity , thank u , Allah bless u Priya malick jii", "_lina_sarma": "Gosh😶", "harshitroxz": "Absolutely rubbish 😡😡😡 spreading hate should be eliminated at any cost... @priyasometimes you are worst than garbage bullshit", "anjelina357": "👏", "vikky7006": "chutia", "hon3yverma": "There is ISIS in crisis", "yashdongarwar": "Get well soon", "himanithakkar21": "Urban naxal, isis bride!", "almas_minhaj": "their is atleast someone who understand", "dasavik": "Not worth 😞😞", "poeticsometimes": "शाबाश👌", "fyb_karma": "🤣🤣🤣🤣🤣", "inconnu11i": "Change your name to Priya Ghulam. Ghulam to the Jihadis, Gandhis and the Lutyens mafia.", "babaldhillon_": "🙁😤", "mukherjeepronoma": "Loved the caption @priyasometimes!! Truly wish the new year reflects the wisdom of secular and democratic india!", "_bad_impressions_": ":(", "paps0311": "Priya tu bhi?", "thebohobaalika": "Hahahahah epic", "vinodjhaveri": "U need to convert to priyabibi.....", "choprapam": "😂😂", "raj.zainab": "😂😂😂", "wattssneha": "😂", "nazeef_writes": "Happy new tears too 😭 @priyasometimes", "shivamrajput.28": "Fear is important for Some People😊", "dummy.dreamer": "Yuppp", "fledgling_0": "😂🔥☹️", "migkamal": "You are an influencer and people do get influenced by what you say ❗BTW, the crisis and fear has not been created by the Govt. but by the opposition parties who tend to misguide the general public and in particular the minorities, on each and every front. CAA is about giving nationality to minorities of other Muslim countries who are being forced to live in constant fear and whose population is dwindling there. It's to support those who are suffering in other countries and not to those because of whom the minorities are suffering."}