{"hasmithapoojary": "🔥", "parijatverma1799": "you look like samie from The Circle❤️", "kashyap_mohit_786": "Love it 😍 Mem 💐", "myselfali": "today is my first time that i know you through youTube and i realised you are such a great personality in almost all field, i wish i get a little shadow of yours,,,", "bhattal_saksham_": "C'mon", "vdevil_068": "Tere ghar walw tujhe aisa krte honge bahenchod", "tisarahman15": "You looks like @aashnashroff", "thatlovabledrug": "Happy holi 🌈", "iamprathvi": "Bura na mano holi hai aur hum toh khelenge tum khelo ya mat khelo rang toh hum lagayenge 🔥🔥🔥🔥🔥", "madhav_singh_sodhi": "And then you talk about feminism, but you want to be treated specially in Holi too, just because of your gender.", "rv_chandra_28": "Fuck boys ke sath holi khelogi tho ueahi hoga behanji, ladko ko identify kerna sikho,ko harami hai sabyi mens ko badnam kerna band kero, jab dekho tab sirf mard ko he galat tarike se target kiya jata hai", "xchinthanax": "@supritha._n please send this to Nikhil", "magems786": "@farhaz_.ahmed", "imguru99": "Ladko ke saath khelo he mat...", "verdentspace": "Aapke aise hath me cross banane se log bura khelna band kaise kar denge 🤔", "_ishh_k": "I just love you ma'am! ❤️", "mr.elixirr": "बूरी नज़र वाली #@# मुंह काला", "kitty_shines": "Im a amateur photographer.....there takes place a religious parade during holi in Kolkata, by a prestigious community. I was groped and terribly soaked with colors....till the point my eyes were red and teary. Trying to touch your breats in the group or come close enough to press your dick from behind....it was so blurry becaause they kept throwing colors in abundance...we could hardly see.....I was disgusted and it was so hard to do my job. Two things that are heavily assaulted during holi are Women and cameras. That day when i came home i felt so terrible, spoke to my friend and asked her is it a crime for women to want to be photographers and do street photography. Was doing my job. Would mention i did push the assaulter hard but i was worried that my camera would be damaged if i did more.... Its worse in UP, have heard that even men with cameras are harassed when they photographer benaras, mathura, vrindavan, cant imagine as a women if il be able to do that safely", "aavaaree": "@shivanghee you look like her. Though idk why she’s famous", "rahultripathi7675": "Kya bura na khelo,khel khel hota hai achhe se khelo bola jata hai.....😂🤣😂", "forkanamplete": "😂", "josephanakuzhiyil": "You look always angry!", "ananyachawla__": "You inspire me. Love and good wishes to you, always, ma’am !", "sandeep_phour.live": "❤️yes", "sakshipunjabi98": "💝 so well said🌸", "mariakhan277": "Innocent people are being killed ,becoming homeless and u so called humanitarians celebrating joy. #shame#hindu#shame#", "ly918sgr": "سسسسس", "majestea_m": "This is so important. People around need to understand that it is important to let the festival be enjoyable for everyone. Do not overdo things. Please.", "limitless__affection": "Good. Hopefully you will spread same message on Bakri-Eid where they kills Goat in large number. Spread Dirt, pollution & blood.", "udaypanchalh": "Please help sirji", "thebeautywonk": "You remind me of @boosheri 😍😍", "vd2408": "Selectively offended intellectual spotted! God knows where were you raised and with whom do you go play Holi to get groped ! What about Tahir Hussain and Delhi protestors lynching several policeman and not just groping but stabbing 400 times and killing am innocent officer..that time why did you not start a campaign ! Anti Hindu paid sleeper cell ! That is what u r !", "manisankar000": "🙌🙌🙌🙌", "siddha_arsenal": "Ohh plz Don't lecture", "priya_malik_fanpage": "❤️❤️❤️", "ravishing_lavish": "Good initiative", "highlandernegi": "Shabash seedha kehna theek ..", "iam_sachindra7": "Yes Agreed 👏👏👏❤️❤️❤️", "nasty_womaniya": "❤️🔥", "prince_of_zilch": "❤️❤️❤️", "iswatisingh1": "Can you make it a 6 by just adding 2 lines? Soacho soacho.", "sim.832005": "Absolutely. It should be a safe celebration for all.", "_shresssssssssssyyy_._": "You look like sara ali khan", "nidhilodha1": "🙌🏻", "anupamcinema": "Very well said 👏👏", "author_avinish_pathak": "well said mam I will definately do this", "miracle_maitri": "Ah ! Definitely Even I was going to upload A writeup On It and Spread awareness about the same 🔥Now For Sure I'll Do it and use hastage #Buranakhelo too 🙌 We Women spread Awareness Together🔥🔥🙌", "iamanmundepi23432": "I m ur greatest fan...since from big boss I m kind of following you insanely.... Mam ur electrifying personality is ruling over my mind... ur madly nibba🔥🔥", "diaryofshweta": "I totally agree!!", "me_aman_speaks": "❤️❤️❤️❤️", "vikhyat_i": "I am glad I came across this wonderful post of urs , glad atleast someone brought it up 🙏", "srabi_285": "Totally agree👍👍👍👍", "dilhitohe": "आप को होली पसन्द नहीं"}