{"_kevin.dsilva": "😍😍😍😍😍 bestfriends i was so Happy when you showed @priyasometimes that you truly love him and you are a true bestfriend to him☺☺", "sidra_asad_attariya": "- Rishabh Your The True Winner <3", "k.k._the._erinyes": "@priyasometimes ....rishabh n u both r awsm....m big fan of urs..both.", "kohliholic_18": "Damn uh both luv uh guys!👆😘😍 @priyasometimes", "princessdhjk12345": "Wow", "bhargavpriya13": "Mee tooo #rishabh yuh r bestt persn i uv evr kwn too@😍😍😍✌🏻️😘", "brindabhandari": "@sejaltayal02 Check your DM", "usrah____": "@marwa_asaam", "tryingtolovenimisha": "In love with rishabh please tell him 😂 @priyasometimes", "nidhimoonysingh": "My #chantbahu @priyasometimes", "ikhashu7": "@priyasometimes did you steal that from a kid at red light. Come on get your own high time 😂", "banijudgearmy": "Cutieeeeeeee", "manav_1701": "@rishabhsinha.official u deserve to win dude but though u were d real winner😎", "mr.npk_": "U both r real winners for me😘😎 @priyasometimes your voice is amazing... Missing it...👌👌👍👍", "dietition_kirti": "Priya you r Darling ,the way you stood up for d right things,the way you performd tasks,those argumnts,tears... Uff Y rishab z so cute , true Man n A true winnr of bb9 .. you both were Amazing in the show .. may you get ol d Happiness of this world ..keep smilng n spreading love ♥", "latifkh19": "love u both of....u......u both the real winners of bigg bosss9", "sandmanbeach": "You guys are the best thing in #bb9 and off course gizele", "shafinasalahuddin": "You were blunt but you were honest . That's way better than being a backstabber. Kudos to you guys. I wanted Rishabh to win so bad. Nevertheless. :)", "newindiadeshkiawaj": "Love for alll", "aakanksha.nigudkar": "Luv u guyzz really wished u should have won d show instead of dat prince", "akashkumar047": "When was u get evected from bb9 from dat day I stop watching BB dats show how scripted was show is. For me u r da real winner of bb9 and Rishabh is second one. @priyasometimes hats of to uuh 👍🏻", "__unsi.raza": "We really really miss rishabh... hope we could see him on tv again", "royal_friend": "Best Jodi in bb", "farhana_juti": "I love u guys", "admirer.ali": "Real winner", "__goku_gohil__": "Real aap Ho prince nai....😉😊", "rajput_swati": "U both r winner dear realy", "fazlova": "Real winners of BB9 !! Prince sucks👎", "komalaaay": "@chminaal", "azi.sweet33": "Rishabh so cute", "12ahulgupta": "@rishabhsinhabb9 😊✌", "manpreet_sherni94": "👌👌👌👌👌👌", "puneettg": "Love you", "desi_indian_club": "Prince deserves", "simrankhanna_xo": "love u guys", "theloveyfashion": "Rishabh deserved to win but I am so happy he was in finals", "hardy__06": "Love u both... Best people in the house", "ibharghavirameshnaidu": "Rishabh winning hearts 😍", "asma.malik11": "Rishab rochell prya kieth aman .best people in bb 9", "sabby.singh.7758": "Winner's f million hearts.. NYC jodi..", "rakshyax": "This jodi won millions of hearts ! Love you guys 👏❤❤", "ash_amatya": "Can't believe Prince won! @rishabhsinha.official u were amazing 👍🏼", "xotahminaxo": "Love you guys awesome u guys deserve to win", "aru_baa": "I knw u were supporting Rishab but at least put a pic wid Prince too as he is a winner @priyasometimes btw Rishab looks amazing!", "mikhilsandeep": "@priyasometimes u and rishab rocked u guys made bb9 entertaining simply it was fun watching u both prince mite have won the trophy but history would always say that u bth were real winners keep rocking luvs", "iii.iii.mcmxcix": "Rishabh deserves too win", "guptaakansha381": "Rishab z d real winner", "bhavi0305": "@priyasometimes @rishabhsinha.official pls u both do some work together we want to see u both again in some show 🤗", "besu_31": "Tell rishab to be active in social media n create insta 🙂", "aslam_wajiha": "@sophiyaaslam", "surajchauhan1990": "Love u both & miss u tooo @priyasometimes 😚", "shrijana_upreti": "Rishabh the best💕", "ansh_ul_": "Mam,I don't know where to start from.I really really don't have words in your appreciation.. Mam you are just 😍😍. Mam want to meet you just once,really am dying to meet you.. I am just praying to god that this could happen.I know it's next to impossible😭 but phir bhi there is thodi si umeed 😖😔.Btw we all love a lot😘", "nkakjann": "@khadijahpatel95 crushing together lol", "rishabh_fanclub": "Priyaaa plzzz tel him to tweet on Twitter his fans are waiting for his tweet since ages plzzzzzzz 🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻", "sanamansur_": "Rishab is the real winner💁🏽", "zainabsadiq48": "Thnku sooo muxxxxh @vinitahalwai 😘😍😚", "bahadur_bacha": "The real winners", "ayushi_jainnnn": "Tysm @zainabsadiq48", "tania.hothi": "Rishabh and priya you guys should have been the ones who were standing at the stage.... You guys were the two best contestants in bb9, the game was so dull before but u guys changed it all around and after u guys came bb9 was actually fun to watch.... Since priya you were not standing at the stage I really wanted rishabh to win.... I was so disappointed that you didn't win, you won so many hearts. While in this show and one thing I can tell for sure is that you are NOT fake. You literally diserved to win this title... My eyes were tearing up when they said prince and not rishab... For me and for all ur fans you are the ultimate winners of bb9...we all love you and wish the best for you😘😘😘😘😍😍😍😍😘😘😘💯💯💯", "jotiraman321": "Hey priya does rishan have Instagram?? If yes tag him. So we can follow him"}