{"_its_me_riyaaaaaaaaaaaaa": "Merii priyuuu jaan ♥♥♥ love you sweetie", "farzana_linda": "U r my favorite! Lost interest to watch bb9 😒", "mainak_____": "Dude ...you are the only good thing that happened to BB9 ....I think your eviction was the worst! For many people....you are the winner! well played @priyasometimes", "officialsandeepdwivedi": "We wanna more to see u in indian television....u r d real entertainer @priyasometimes plsss revert maam", "thisisanjalika": "@priyasometimes ma'am plz stay connected😢😢😢😢😢😢😢😢😢😢♥♥", "rabiyanadeem15": "Vote for rishab pls..", "samrahsohail20": "@priyasometimes when ever you come to Australia pls come to Melbourne i so wana meet you....much loveeee", "sarinsharma": "Were you scared of @princenarula??", "ankitabakshi04": "I love her bio. Gimme eyeliner or gimme death @abhilel", "neha3456": "U are very humble person", "malikathapa": "Lovely seeing you on bb and you are an amazing person", "littlemiss_happiness": "You are the true winner of this season @priyasometimes !!! You bought back live to the show!! And also you are an awesome human being!!! We love you Priyaaa!!! 😘😘", "athar_azam": "@priyasometimes an amazing person.. totally adore u..bless u always..", "hrithikasachdeva": "ugly", "kanangaroo": "@hrithika_a fuck off hater! .@priyasometimes love yea!", "nishkajain19": "Salman i luv u y r u so handsome n cute???? @beingsalmankhan", "aniketsiingh": "Luv u @priyasometimes", "mariam_mir": "Just watched it until you left.. such a boring show this time.. u were the best !!", "rishi0407": "Love u priya", "mad_sam_101": "😵 I wanted u to be the winner.", "sabaahasan": "Luv for u priya! Cudnt vote from Pakistan though!!! show is totally boring widout u 👎", "umaimaahmad143": "Priya i love you so much, ur biggest fan from PAKISTAN 😊", "uniq.orne05": "You were my fav .. Stopped watching after your eviction :(", "imparina88": "priya malik can i know ur birthdate plzz i am ur big fan plzzz", "anikaaldin": "U r so strong", "groversarthak": "U r too amazing", "mystry.saznee22": "U played amazingly priya....huge fan of urs:):)", "mahavirsinh_raulji": "Guys vote for Rishabh...", "rahul_rajhans": "Ur d most irritating creature", "saurabhgoswami94": "True Nd best Women in this big boss season Love you ma'am. One women army :* You nd Rishabh are best best Peoples nd my favourites too in this season. Loves your point of view Your vocab :* Your hairs your style Your sports spirit nd most importantly your vocab :* such a nice human being :) Huge respect from my side to you. Hope you will get a successful nd happily life :* Love you ma'am :* Dil Jeet liya is show me <3", "tanveelilothia": "I'm really sad after this eviction. I badly wanted @priyasometimes to win this show too as she won big brother. She was such so strong. Not just as a contestant in the house but also as a human being. You have added another fan in your fan list and that's me. I love you from the bottom of my heart. I have learnt a lot from you everyday .. Even though just for an hour but yes that was okay. I always loved when sometimes you smile in the middle of arguments. That shows that you don't hold any kind of grudge or a bad feeling for others. You are an amazing human being and I wish all your dreams come true. You really made me a proud fan. I wish you the best of all. God bless always. And all the very best for life ahead. Lots of love and hugs! ❤️", "minnidev": "All the best sweetheart 💖", "shrubham_143": "We all luvs uhh mam u juz rocked it #bigboss9 nd Ur d actuall winner f bigboss9 for all f us...", "being_myhself": "@priyasometimes u really rocked ! A fan from Pakistan 😊", "yougotmerollin": "I stoped watching after your eviction. So disappointing! DUDE you were the real player!!!", "sari_60595": "You are a true inspiration for girls priya :)", "priinikk": "Ohh sad. I don't watch 😂 @ashviita", "chandan.singhmunda": "#OneWomanArmy 👌👌👌", "tasr.a": "InshaAllah this is JUST the beginning Priya!", "swatishukla754": "@priyasometimes such a #NICE &SWEET teacher..ALL d wayyyy best 4 ur lyf..!!✌✌✌", "veronicatwed": "Against not for*", "h.x.x.x.x.x": "@_x_zoyaa_x", "garryk_": "luv u @priyasometimes i was really disappointed after ur eviction.....", "mysteriousmehhh": "U need to be in the bb house ma'am...biggest supporters of urs....luv u ma'am wid soo much of respect😊", "iam_aashisahay": "We loved you on screen priya 🎈 we support you and we hope we keep seeing u on indian television.really appreciate your personality dont ever change 💙 #teampriya z", "nikki_bhaskar28": "still cant believe u r out of the show ..!! u were the lifeline of bigboss9 will miss you !! best wildcard ever seen you r the best !! :*", "bhavi0305": "Not watching BB9 anymore we miss u come back soon on tv😒", "instachetalionline": "U are already a winner.....", "vanita_07": "You were amazing in the show. You are the winner for us.", "romaan.saba": "U won hearts priya! bb9 just a show ❤", "thebadboy1987": "U already a winner for me.", "lelamajno": "Vote for rishabh ♥♥♥", "pihootpiee": "U juz awesome ....", "rimzhimsrivastava": "I can't believe that you got evicted. I'm sure it came as a shock to everyone. I hope we see more of you soon. You're the real winner for me. I don't think anybody else deserves it more.", "tubbuansari24": "U r a teue fytr priya loved u real bb9winner for us :) :) now rishab should b d winner :)", "jasleen_matharuu_fan": "You were superb 👌.. You deserve to be in finale.. But we all know it's a #biasedseason #scriptedbb 😏 😏 😏", "bilalsaleem4": "I couldn't vote from Pakistan, but I've seen all the episodes. Imam Ki Adalat, that made my eyes teary! I wish I could see more of you.. 😢💔 #OneWomanArmy", "jessie_shergill": "You are my fav lady 😘 you are strong , elegant , beautiful and brave woman . Will miss you rest of day in BB9", "ashitosh_ghatule": "Miss u", "direwolf.x": "You will b d real winner ! Strongest contestant of bb9 ! nd this is d biggest mistake of bb evry season ..dat no wildcard won the title ..isiliye nahi kyunki unki ability nai hai ..bt bcz of votes..! As salman sir said..ki tumhe ticket to finale mila..ye bahar sab ko sahi laga...! Agar aap jeet b gyi hoti to bhi aap deserve krti thi ye title. Actually , im a supporter of rishabh sinha..nd in this season I don't think dat anyone deserves to win the title except wildcard ! Hope so now rishabh wins #rishabhsinhadevil #Verygoodrishabh @priyasometimes @rishabhsinha.official", "yuvikadev": "In my eyes you are already a winner..the rest of them do not deserve to win..I don't want to find out who wins now because it does not matter to me at all..You are a winner in every sense..! Way to go ..! All the best for your future endeavors..!", "raunakprakash": "@priyasometimes congratulations for making it so far .i am not a fan of yours but still u handled it well u were the one deserving the title ..", "akkus_26": "U were a deserving candidate ... Will miss u ... U r lv ❤️❤️", "sahirmoosani": "I thought you would come third", "ashishinzone": "U were awesome Priya, n u were deserving inmate. U will be missed surely", "kulturequeens": "This seson is RIGGED fucking pigs. You were a clear winner @priyasometimes we didnt believe it when we saw you leaving. Rochelle should have gone instead. She dont deserve to be in the finale same goes for Prince he is a scumbag. You are a winner @priyasometimes no matter what. Bigg boss 9 is the worst season ever with worst contestants but you were the one and only who deserved to be the winner. Hope to catch up with you someday when you are back here.", "siimmaa": "You totally deserved to win! Hats off to you for your strong personality. I'm a huge BB fan but this season disgusts me. You becoming the first finalist was my last hope that something good can come out of this disastrous season, but now I have no reason to watch this show. You ARE a winner! Keep shining! ❤️💫", "simran_jaap": "@siimmaa so true", "richa_rich": "No no please don't let this be the Aakhri Salaam on our TV screens, want to see the more of you! You are one strong woman, I seriously love you. It would be the world for me even if I could just meet you once :')", "rai0132": "#onewomenarmy #respect", "ayesha.i.malik": "Its not fair at all", "toobawaresi": "Love u priya", "arjunmanhas_": "@priyasometimes plzzzzzz Make a vote appeal for devil", "yahyatariqqureshi": "Nafsiyathi Aurath 😂😂😂", "hreetuanthwall": "Smartest bb contestnt ever in bb history !", "__ash75__": "Be the way you are.. Honest, brave and straight forward!! Love the way you are.. Specially the way you talk..", "sumedhapdessai": "😞😞😞😞 i'll miss u a lot @priyasometimes !! Damn .. I wanted you to win dis show ❤️. I'll be supporting #rishabh now .. #goodluck for ua future .. Stay da same 😌❤️", "_p_r_i_y_u_": "😚😚😚😚", "_.angelicaax": "😭😭😭 I wanted you to win this show ffs, all of my hopes were on you Priya. Anyway, I'll be supporting Rishabh now. All the best for the future 😘😘😘 @priyasometimes", "finick_gal_356": "Priya I love you... you hv won many hearts ..nd you are my favourite... we want to see you more nd your logical thought .. I jst love you ummmmmmmaaaaaaahhhh", "noorf_873": "Respect how u played game. Really really sad.", "redfoxlover": "I'm Done watching BB9 :(", "tahanizaidi": "Will miss you terribly in the house. All the best for future. Love from Pakistan :*", "abeeratahir4": "Priyaa you r the best ! For me you r the true winner of bb9", "djneejay": "#nothappy #unfair #priyamalikrocks #teampriya #proudofyou", "sort_of_unsorted": "You are the winner for us @priyasometimes no matter who gets crowned.", "angeleyezz90": "Priya i love you 😍", "akanshamalhotr": "@namitapal25 lol why is there so much hate in you..go channel these negative energies and make something better out of this.. no matter what you say people are anyway gonna love @priyasometimes stop complaining and indulge in something better.. and if you dont like her, then why have you been fighting with her fans and posting these things on her page..justdont get bothered.. makes sense eh?", "iam_akshayd": "Former bbau contestant and most intelligent and smart player of bb9 #priyamalik u already won this show when u enter bb and with ur strategies and personality u made this show watchable. We love u n support u top6 @priyasometimes", "moons.24": "We miss you #bb9 is over without you 😞😞", "iworld09": "Will miss u priya", "wz_zua": "You are the best", "mominaxo_love": "I basically stopped watching the show after you left in so fucking disappointed I wanted you to win I hate bigg boss", "arfakins": "I love you Priya!!! You were the real definition of a WILD card! You go girl! 💪😎💋", "gayatri_bhatia": "No doubt u were best among all 😊 good luck for future.. will definately going to miss you watchng on tv.. u were rocking.. heart broke little wen dey took u out of the house :') u atleast deserved to be in top 3 for sure.. loved watching you ☺ you r one of my best contestants ever 😊😊", "rashaasalim": "This is Dissapointing !! #LoveyouPriya #BB9", "rohannayyar0114": "Highly disappointed.! Wanted priya to win :'(", "gayatri__chawla": "For me u r the winner", "ab_sol_ute": "@priyasometimes stay back in India, indian audiences would love to see u more ..", "ash_w_ani": "@priyasometimes .... Winner of bb9 for ur fans..... We love you...😘😘 looking fwd for watching u on our TV screens.. Gud luck... Stay blessed😊😊#priyanakahandamalik... #alumiofmycollege...#supersenior..#venky...", "fireandblood122": "👍👍😔😔", "shepotle": "INDIA LOVES YOUUU", "sharma.alia1400": "for us u are the winner", "mayankmalik0001": "Hey u r already a winner ! Priya :) ;) n I also malik :) :)", "_jiyyaa_": "@priyasometimes you slayed in big bosss and no doubt that yu are a trueee winnerrr bae i lived yur hindii its soo clear and loved yur voice too", "moin8649": "You are best", "namastay._.inbed": "😿😖😭😭😭", "muskanrizvi75": "💃💃💃💃💃💃💃💃", "ikshulicious": "Literally the only well deserved person.. was in tears! No joke -.-", "aashnasachdeva_": "Priya u were amazing in the dont know hoe u got eliminated", "roopenzal": "Loved watching u .for us show has end.👌🏻👍🏻👍🏻", "dhuha_56": "Will miss u so much in Big Boss😓 for me u are a winner😘😘😘", "pushtii_amlani97": "I wanted u to win lady😣.....u deserved to be the boss.....", "mahimavlalwani": "The best thing about bigg boss 9 was you priya!! Loved you in the show. Good luck @priyasometimes 😘😘", "akshatapalankar": "You played very well 👏👍☺", "marbar_._": "I think keith should have been eliminated since he has been performing in any tasks and plus u can hardly see him taking any stand he is non exsistent in the house idk why people in the house think he is a deserving canidate", "hermosa_cruinnee": "Loves u alot ...u r winner for mee @priyasometimes"}