{"thisisanjalika": "😢😢😢😢😢bb9 is not gd now..M not gonna watch it", "minnidev": "Priya miss u I have no interest to watch the show anymore after you left.. U r winner as per me", "big_fan_darshan_": "Bat so sad me you so miss you and vote you plaz all rishab", "realsubhannader": "Missing u priya g 😭😭😭😭😭", "richa_rich": "@saradavid_x Priya was bae indeed : c", "banijudgearmy": "Vote for Rishabh!Xoxoxoxo", "priyank.aaaa": "U should have won", "_rahmaafzal": "She is superb ♥", "saira.mah23": "Supporting*", "dhaarna_srivastava": "Sad got uh dear", "hasanpanhwar": "Priya Hello from Pakistan..i saw the way you play in Bb9 ..you win already :) stay bless", "eman.alzadjaliii": "@mawii.za we love you priya 😻☝", "zaveriamina": "love u alotttttttt😚", "niharika_saxena_12": "U r my fav contestant...seriously u deserve to win this show but after rishab...:-) @priyasometimes", "ruksaar.s_": "@nirma.ng 😍😍😍😂", "nirma.ng": "@skhr.ruksaar to larmer seryer 😏", "harshna1": "Lovee d way u expressed urself n maintain d dignity❤️❤️ much love frm chicago❤️ #respect", "puullkkkitt": "bakwaas😂", "j_s_bamrah": "Great persanality", "rose_shweta2007": "U r just awesome priya", "_alafiya_": "One woman army.. 😘", "shauryarsl": "Priya u were my fav contestant in bb. If you had shown your real personality in bb then you are a great personality. I like the clarity in you speech, humanity and genuineness. All the best👍", "simran_jaap": "Priya you are such brave person everybody else in bigg boss is useless ... U are only only person to win this season .. Bigg boss was boring as hell until you came to bigg boss house . I don't get this voting system . You truel deserve to win .. You are only 1 person with brain in bigg boss house .", "aashutoshd1": "Priya to nikl gyi but uska sapna pura krna h hamein guys vote for rishabh priya ne kaha tha na ki wo rishabh ko jeetata dekhna chahti h to guys if u r priya fans then plz vote for rishabh sinha", "arihantshiyal": "Vote fast", "lakshya_j_singh": "Priya u rocked at BB9.......", "rubymhate": "U r a lovely soul....:-)", "jamwal_nidhi22": "Luv ur eyes...😘", "rishabh_fanclub": "Priya ill miss ya . U were amazing!! Love u alot . Wish u d best in life ahead @priyasometimes . ❤️❤️. You inspired me alot in so many ways. !! I really love ur bond with rishabh..true friendship..❤️.. Gosh! Never saw anything like u two . Such nice human beings . Loads of love from London", "bagga_chetna": "@priyasometim ur the winner. Most intelligent and very calculative women ur. Im upset ur out frm the house. Best of luck for the rest of ur future lots of love 😘😘😘😘", "dhawan_saahil": "You deserve to win", "slaysha_14": "You are a true strong woman. I really wanted you to win the show. I dont understand what went wrong. But for me you are the winner and the most deserving one. Love you so much. 😍😍 @priyasometimes @jesuisdurrani", "jesuisdurrani": "Yes! Omg😢 lots of prayers and best wishes for the future Priya! Will miss seeing you on the screen. You're an inspiration and a true winner for me no matter what anyone says just keep doing you! 💪💋love from the UK❤ @priyasometimes xx", "bebo_37": "@priyasometimes 🌹", "shradhachandrakant": "Priya miss u dear you actually deserved to win", "balarenu592": "I love u priya u deserved to win", "rb_791": "We will miss... This eviction of you was surprising.. You were the most deserving person to win big boss 9 season.. Whosoever win now doesn't matter to us. You really made us feel proud, really nice to know a person like you... Very humble and beautiful human being.... Bhushan is a lucky man... Wishing you all the very best for your future endeavours.", "pratimarana23": "Wish you all the best Priya , you were my fav after Rishab !", "divyakehr": ":( this is so unfair! You should have won", "heyitsiqra": "Love you priya, You were the best thing about BB9, you were my favourite! And it doesn't matter if you got evicted because to me and to alot of us,you are the winner of Bigboss 9 ❤️ @priyasometimes", "saradavid_x": "@r4hul_c my bae was evicted yesterday 😭", "shifa9887": "Don't worry you're the strongest and prettiest woman I've ever seen love yan best of luck! @priyasometimes", "ginanopk": "U r the true winner", "preeti_singh_021": "Soft yet bold...yu can inspire million oda women in our country priya...so proud of yu...olso i luv ur diction n vocal skills...pls stay ova here in india nly...dun go bkk to aussie..#love yuuu", "neeshashastri": "@arafia92 you're wrong on so many levels lmao", "direwolf.x": "@muskaannaagar Seriously ! Worst evictions . Only rishabh seems good now..agar aur koi jeeta to pta nai kya hoga. Nd ye show hamesha koi deserving insaan jeeta hai nd rishabh jeetega.. ! Muje lga tha priya safe ho jayengi nd rochelle evict hongi kyunki wo gharme kuch nahi krti . Bt god bless oll audiences ! Acha hota agar rishabh nd priya jaate finale..me kyunki dono hi deserve krte hai ! Prince ab finale me bhi jhund me hi jayega..huh shame on him srsly . Vote rishabh guys #rishabhsinhadevil #Verygoodrishabh", "rabiyadanish": "Bahut acha hua...hahahaha! Miss FAKE ACCENT! Ur true colors came out when u were angry with prince...tab kaha gaya accent???! Lol bechari", "w.fairy94": "My princess😘😘😘😘", "shahbaaz_siddiqui": "U were best there your talking way uff I have totally copied and I m depressed with that and your way of delivering point", "ellemagenta": "Don't be depressed. We love your fighting spirit. Keep it up.", "abeeratahir4": "Genuine person in bb9 :-*", "rrs_rahul": "The way u played made u d best...out of the \"jhoond of sher\"", "kowlessurpratima": "Lov u u were z best in big boss", "baangaali": "You actually deserved to win. But oh well. Haters gonna hate. Hats off to you though :)", "pihootpiee": "Frndz lets make her fav win", "inclementwetter": "Motha. Has arrived.", "radhika_bahuguna": "Uh r love ❤❤", "parvati_nair": "I really loved you.You deserved to win", "tarun_1234": "priya vo log chuitye hai jo tumhe juge nahi kar paye ur the god women of this season ..!! 🙏🏼🙏🏼 tumne akelai en sab ke g@@द maare है 💐💐", "chauhansangeeta123": "U r real winner priya luv u", "manavbhati": "I want priya maliks fan to vote for rishab because thats all we can do for her...! And one more thing priya luv you best player of this season", "ckanval": "U r the best...for me u r the winner of bb9...", "koushita_soobhug": "Love you priya ❤", "arijeet_ghosh": "Priya malik u will be missed 😥 but keep supporting your best friend rishabh sinha 😘😘😘😘😎😎 #risians", "how_u_dng": "Forget abt the game bigg boss or hw u played it, I actually think u r a really nice human being :) love u priya ♥", "noorf_873": "Your fans r more depressed than u", "bhavi0305": "One woman army", "balaniyash9": "@priyasometimes seriously m a biggest fan of urs.. For me ur the winner of #BB9😉😎", "neelambhattschryer": "We will miss you on the show. Love from Canada 😊", "rishi_world": "Awsome player", "lelamajno": "Lovely priya♥♥♥", "zahur.virani": "Omg well played 👌", "vedant_pradhan": "Big big big biggggggggg fan!!!!❤️❤️❤️❤️❤️", "mysteriousmehhh": "Y Rochelle....?Keith ka ky kaam in d house!!", "aaryaaj": "You are BAE ❤", "saniyyaaaaaaaaa": "LoveYou ma'am❤️", "wz_zua": "Miss you 😭", "chaand_mehra": "U rock 😎", "nishad__shakur": "I love u grl💖", "croysti": "who is voting 4 dis mdana n roshale dis is completely wrong priya deserved to win....😭😭priyaa lub u", "navinabhatia": "U were the only one who deserved to win..the show is over for me...its amazing how you always know the right thing to say...blown away by your intelligence, straightforwardness and honesty... dont go back to Australia, u r a gem we would not want to lose...much love", "_p_r_i_y_u_": "Don't be sad!! You don't need any title of \"bigg boss\" ... U already have so much fame and popularity !!!... U r already winner... Only people like prince need to win, just to get popularity and some work too... Love you 😘😘 keep smiling... We love ur smile😊😊😊", "himani_6": "For me among all of them u were the only one who deserved to win.. Will miss u in bb9!", "pasang.sangye": "U r my favorite contestant n u have already won in our hearts!!", "justanashish": "😘😘😘😘😘😘😘u proved that kabhi bhi kisi wildcard ko undrestimate nai karna chaiye 😘😘love u priya and ppl gonna miss U lot , be active on on istagram and I quite watching BB 9 coz u r the one who have put jaan into ths season and its like bejaan now without U 😴😔all the bessst fr ur life love U 😘😘😘", "sussana_x": "You deserved to win! ❤️", "snehathorul": "LOVE YOU♥", "allaaaayyy": "You look amazing @priyasometimes", "kalpanathea": "You are a winner Priya .. My fav contestant", "shalini8434": "All the best dear :*", "dilraj_44": "😢😢😢😢 app sey asha koi nai ha bb9 mey 😢😢", "imsiwaf": "I luv u priyaaaaaaaa miss u already on #BB9 stay safe,,love ♡ from Kenya :) @priyasometimes", "shivergravity": "@priyasometimes probably not gonna watch bb9 after your eviction. Man,your awesome and really,a one woman army. Love you and you were the soul of the show xx", "leannepinto": "Wanted you to win @priyasometimes 😭 on the brighter side, however, you have won so many hearts all over the world, which outweighs winning the reality show title. Much love from Dubai x Wishing you all the very best ❤", "john_sondhi": "♥winner♥awsm♥my fav♥", "instadipanwita": "U r the true winner of the show.. I haven't seen any contestant as genuine and goodhearted as you ever ...in any season of bigg boss!", "sugarynspice": "You were the best girl. And you stayed the same there as I know you to be. You won all the hearts. All the best for all future innings. And come visit delhi 😙", "tehmina1723": "Hello priya I m big big fan of u after bigboss I am v disappointed after your eviction you deserve te win any ways may u have much more success in your life you are one man army so proud of u bless u and love u 😘😘", "molly_sinha": "you r the winner Priya...", "sweetyy_p": "You are awesome ❤️u Priya one woman army✌️", "_khansaab20_": "@dinalmalviya 😭😭 She looks so Elegant and Bold. Thanks Priya Thanks A Lot 😭😭😭😭 @priyasometimes", "devnath": "Reallly unfair and still cannt belive wont be able to see you on bb9.. stopped watching bb9...supported n voted you but stil result was unexpecred...", "updesh_khandelwal": "Im #feeling So bad ! That U are Out #priYa im #shocked that you are out of the house ! But jo #Hona_Tha_Ho_Gya...!! But ur #awesome..! #loveYouPriya #HugeFan 😘😍❤", "vips_raw_official": "U r out m hppy", "sreelakshmisivan": "Love u gal ,. . U r winner already, very disappointed. . Fake ppl still in the show . . After priya eviction confirmed fake Prince will win. . All haters of Prince vote for Priyas kid rishabh. . Let her wish b fullfilled", "prasuk_jain18": "U were ossum priya, i am a die heart fan of urs...!! U were just perfect winner for bb9... Its all just unfair to make u out... It was all just plotting... But u r a winner for me... U have everything things that a contestant of bb9 shoukd have... 😘😘😘😘😊😊😊😇", "tubbuansari24": "@priyasometimes Best contestant of bb9 :) love d way u played priya totally unfair looks lyk ds season z scripted ! :/ but neva d less u hv surely won a zillionnnnnnnn hearts! :) :) :) now my vote goes to rishab ur kiddo! :) :) loved the way u speak :) :)", "11_sk": "This so not fair... I mean u were really good.. after kish, I wanted u to win.. but then u got evicted.. u played the BEST in the house.. anyways best of luck for future.. lots of love from Bangladesh. 😘😘😘", "nolongerauser222200": "You played FANTABULOUS", "surendra_mertia_panchalwara": "You ar winnr priya malik.....", "malinakharel": "you were awesome.You made the show worth watching.love you.", "jyochamoli": "You were fab !! None of the contestants inside the house r deserving !' U r already a winner !!", "diya_ahuja": "Priya !aussie won !in the australia vs india match !!! @priyasometimes !!", "pranav.satti": "U r superb priya....prince should not win the show", "being_asra": "Love you priya.. The only contestant who played the game strategically.. Love you priya.. U won millions of hearts😘😘😘😘😘👍👍👍👍👍", "23_heena_4": "👍👍👍", "iam_akshayd": "@priyasometimes u became our favourite for #allthetime", "pranjaldangwal": "Feeling vry bad & sad for u @priyasometimes mam... bt as its saying \"The Show must go on\"... so all the best for your future. Stay Blessed.", "omkar929s": "Well she got evicted. That's sad and fucking unfair. But somewhere down the line it's our fault too , we didn't vote her enough. We should've voted her religiously, or it could be fixed . but she deserved to win..", "twinklebairwa": "Believe me I've been watching Bigg Boss since last year but I never felt that I should vote for any of the contastants. You were my favorite this year. I desperately wanted you to win this season. You are real, and this is what I support only. Feeling very sad about your eviction", "jasleen_matharuu_fan": "You were the best.. 😍 😍 You deserve to be in finale.. Miss you priya.. 😍 😍 @PriyaSometimes", "tasr.a": "😍", "kunal_has_it": "Injustice and unfairness to a whole new level . Evicted or not , you're the true winner !", "nirmal.nadeem": "Priya u were the most deserving person in the house.I did not expected that u will be evicted this week and felt so sad about your eviction.You were amazing!!", "sahil.stanishqs": "Miss you", "adityasingh11": "#thewinner for me. ❤️", "_therakesh_": "On point ! But still u wer so good in biggboss 9", "iimady": "Priya 4 me you are the winner of bb9 no matter who wins👏👏💕", "smridula1589": "Love the way u played it !!! Well played .. U always had self respect and dignity in the game ... RESPECT!!", "susub": "Aww priya I'm soo sad 😯😯😯", "achal3375": "U r my winner of bb9... Baki sare contestant gye bharr me..👍😊", "aniezafar": "You were the best! Fan from Pakistan", "sayed_mehmood": "I mean how could this happen .......shocked...i m the saddest person....u r d winner ...", "chandan.singhmunda": "U r just Amazing Ma'am!! Kind Hearted person..Love d way u doing Something in BB house .Love u bonding wid Rishabh. I wish Aap Dono ki Friendship lifetime rahe..Miss U..", "sumayya_haneef_hashan": "Feel so sad priya...u were an amazing lady...", "rahulnarulaa": "U had just an amazing job....keith jese insaan ko...ghar me rakhaa kahin ka competition nahi hai ye..@priyasometimes aaapko ni laga ke stupidity hai kitni..phle...aapko finalist banaya...then aapko nikal dia...dekhenge aaj raat ko aapke intrvw with salman but..sersly i was shocked jab aapko nikala how it is possible keith is just like most pagal ni house...vaaaaaaoooo apni trp gira di kishwer ar aapke jese contestants ko nikal ko ye baat aapki sahi lagi bus ab risabh ko to jita dein...agar use bhi nikal dia to wishwaas uth jaega mera to.. 😳😳 soo sad sersly too much sad😔😔😔😔 @priyasometimes", "akanksha246789": "U are superb nd u have strong personalty..", "arifmh1985": "Hi", "puneetkaushal6060": "U luk fab 😍😘", "its.hsnn": "<3 :)", "karishma__kundu": "I really wanted u to win... D eviction was like a boom shock to me 😈😭 #priyasometimes", "pizzas_world": "Girl my whole family was rooting for you!!", "theloveyfashion": "Thank you for being such an amazing genuine friend to Rishabh. You might not have won but you won all our respect and love. You are a strong woman and I am so proud of your journey in bigg boss. So muuuuuuchhhhh respect for you.", "simmykaur786": "Luv u baby", "mohitrulesworld": "😍.. Depressed, as most deserving contestant is out of the big league!! #mindflipped", "dinalmalviya": "@priyasometimes the biggest fan of your life --> @faiz220815 he literally cried when you got eliminated.", "userdiedrip74": "@faiz220815 😳😳😳", "mozhda_naz": "Lovely woman @priyasometimes", "admirable.queen": "❤️❤️", "mipallu": "Will Miss u priya in bb-9,,,u were my favourite contestant😘", "anuragsingh143": "U always winner of bigg boss in my eyes", "s.h.r.e.y.a.n.k.27": "Hello priyaa... u must try the advice of imam... for the hair cut...!!! It would be superbbbb... plzz for the fans...", "laurencuce": "💜"}