{"eeee.shaaa": "@priyasometimes", "absolutely_sheetal": "Priya u wer deee best👍👍👍👍👍 ily soo much n i was really sad wen u left the house😩😭😢 but np we cannot change destiny n good luck for future....loadss of love 😘😘😘😘. P.s. bb9 was fuckall till u made it interesting....", "pizzawithextracheese20": "She is the true winner of bigg boss season 9 @priyasometimes", "sanazulifquar": "@hinaa_khan", "anoop.as226": "Thx", "shalini8434": "I have posted domt forget 2 reply", "mrs_manz_xo": "Totally love u priya, it's such a shame u weren't in da top 5. U wer my big boss winner. The rest of them inside are typical lowlife idiots.", "xosukh": "Can you please do other indians reality shows???? I am missing you toooo muccchhh 😭😭😭😭😭😭😭😘😘😘😘", "sanha9791": "I hope keith,rochelle or rishabh win.They are deserving.I dont see why u dislike keith n rochelle.They always stood up to u.and secondly anyone will get frustated with each other stayin in the same place.", "lelamajno": "Priya vote for rishabh ♥ ♥ ♥ ♥", "aysha92": "Priya tm best ho aur deserve thi top three mein aane ke liye priya ke fans plzzz vote for rishabh", "jutt_1145": "Vote for rishab", "banijudgearmy": "Vote for Rishabh!", "priyankaarora973": "@priyasometimes pls tell where to ask questions on d site", "r_rajput12": "Strong lady salute u", "salman.sh25": "Xtrong lady.", "ayesha.are": "Rishabh to win. So glad priya is supporting him aswell!!!", "showmasti": "@priyasometimes Love u Priya..a good human!!", "tubayyy_": "Rishab💖💖", "tanishq.sharma.3781": "Luv u I'm ur nd rishabh big fan", "richa_rich": "Posted my question, here's hoping you see my question and answer it ❤", "viny1183": "My favorite❤️", "madi_muzz": "You were too good in the show, I wanted you to win", "akshaykhilod": "@priyasometimes you told just because of task prince can't deserve to win biggboss title ? is it #AashtaChannel ? Salman and biggboss licking mandana's ass .... and all the ppl talking about that kish using prince to get all attention and protection and during that task prince played for himself thn whats wrong in that.....and we all know all the fucking drama going on just bcoz of TRP ....... but you guys can't bring down like that ..... when mandana fucked you badly now she is okay with you? salman khan bhenchood kuch chutiya hai sala .....", "sawant_heramb": "Will u pls stop talking shit aboutsalman@ak.khilod he is not partial", "aakriti_monga24": "Love uhhhh priyaa :) uh were mah fav contestant !! Uh r a real winner for us ❤ May uh b blessed abundantly with pink of health, best of moods ,peaks of glory nd bliss. Keep soaring skies 😘😘 heaps of wishes nd love", "bey_shaks": "@priyasometimes u wer so amazing in d show.... I ws really sad to c u go.... bt wid or widout the award u r d winner fr me cuz u played a fair nd honest game, smthing dat no one evr did b4 in dis show....loads of love nd best wishes 😙😙", "simran_jaap": "@rajshergill8122 no Prince has nothing to be get jealous he is fake evil person ? He doesnot even 1 quality to win bb9 that fucker khusra ? Don't even compare him with Priya ?", "morpees": "Agree @simran_jaap", "laadddoooo": "Agree with u 😂😂 @simran_jaap lol : nice rply !! Y r people so dumb !!! Prince is really not deserving", "ruchikardahiya": "U r Rockstar", "prasannadhulipala": "Priya I have become such a big fan of you and how articulate you are and kind you are . You and Rishab are my favourites . Love you tonnes", "royal_friend": "Priya plz ask your fans to support Rishab as you two were the most deserving C ontestents.....now that you are out we really want Rishab to win!!!", "sidhu_sagittarius": "@priyasometimes @priyasometimes", "your_kartikeypandey": "exactlieeeeee... bro @sidhurampie", "thelittleraksh": "Why were you hated unnecessarily by bb9 cocontestants.?", "farzana_linda": "Priya my favorite !", "roopam_vashishtha": "u were amazng in bb9...my fav contestant....luv ur voice nd d way u tackle any issues in d house...u r nw my inspiration,i ll vote to rishab ths tym to make u hppy....luv u @priyasometimes", "imakshaykate": "MY fev Contestnt in BB9 luv u...", "imsiwaf": "I LUV UUUUUUUU PRIIYAAAAA", "fr_batool": "You performed amazing in all tasks. Loved it when you take stand for right people. You and kish shouldn't be eliminated till this week. And it's obvious everyone is missing you. And yes one more thing your hair colours and styles I personally loved them. Best of luck for your future.", "haya.sanam": "Who do u think will win this bigboss season?", "priyasometimes\nVerified": "Verified", "ayushisinghgaur16": "Priya You are my favorite ❤", "officialsandeepdwivedi": "Eagerly waiting for diss..my fav..@priyasometimes", "_._swap17": "@parikshd", "original.001": "Priya my question is to u , if top 4 in bigg boss season 9 is prince, suryash, yuvika, and mandana, whom do u want to win this season of bigg boss", "aboodii._.99": "@priyasometimes love u priya u r the winner of bb9", "uniq.orne05": "Hats off girl !! You rocked the show !!", "juliaxliz": "HI PRIYA"}