{"mohitgandhi7": "Or jo aj zinda h use galiyan de rhe ho", "superhumanprakam": "Being your fan..i have to say that..this time m disagree with u...See even i want a release of #Padmavati... Its just...Aap kisi jayda galat cheez k against jaake... Kisi kam galat cheez ka support nahi kar sakte..After All.. #galat_to_galat_hai", "sumant_choudhary": "I'm ur fan but nomore. De-facto that from twitter to Insta. Ur logic is simply hilarious. How can u put these logics into padmavati distortions? U're talking abt men? Listen, scores of womens with exasperation in eyes out there from Rajashtan on road, no one asked them to come out. Still! Female foeticide, sex ratio & related things have nothing to do with these lies & distortions of handful of stupids from film industry. We dn't support stupid scripts that malign our proud figures.(& there are 1000's of historians, family of maharanis who do have a strong views with facts, dn't fire bullets in air one the basis of what one historian said). Precisely atleast u can listen to what Dr. Kumar vishwas said. Gdbye lady!😑", "harmanjotkaurgill": "👏🏻👏🏻", "jethi._.n": "🙌gud job", "_pizzaislifex_": "👏🏻👏🏻👏🏻👏🏻👏🏻", "amythefab": "@joelphilipgeorgie2401", "ravi_gehlot2810": "Iss bar tum galat ho. Tumhari soch hindu virodhi . Tumhari soch se lagta hai tum communist vichardhari ho.", "shubham3452": "Superb !!!!!!!!!!!!!!! @priyasometimes", "krutikapaneertikka": "This video made me follow you Priya. 😁❤", "boyforhimself": "Bravo girl clap clap clap", "jaismeen_bhasin": "@gurneet.93 ehnu follow kar", "tanvi_s_kohli": "Bravo👏👏", "mannkor90": "👍👍", "abhayraj001": "Samay samay ki baat h", "being_namitsaini": "Best", "manish_akula": "On point 👌👏", "jinemeradilluteya_oho": "Woooo lv u priya bravooo 👏👏👏👏👏", "creative_riyo": "This is what going in India people are not actually fighting for the right they are showing it by power by strength by using mass or influencing the mass#peace#womenempowerment", "khatri.anees": "@priyasometimes I am from Rajasthan and you are right", "aanya.02": "🙌🏻🙌🏻🙌🏻🙏🏻🙏🏻", "shikhagujjar": "Wooh 👌", "poorna.kulkarni": "Amazing... @priyasometimes This is by far the best debate I have seen.... absolutely to the point u put your words... hats off to you... 👍👍", "bigindio74": "Mother fucker got OWNED 💯🔥🔥🔥🔥🔥", "___shaziakhan___": "Well said ..", "ranu6239": "Cnt get better... More power to you priyanka... Yes these men really dnt knw wat to fight abt... They just want to b a political figure n in news by doing all dat... Sick!!! N ask them if they really know whereabouts of the girls and women being treated like shit in this country... Bloody foolish!!!!", "shrislife": "Dammmm girl 🙌🏻", "idefineme24": "@deepikapadukone @ranveersingh @shahidkapoor", "photography_de_sagar_dedhia": "Bravo mam respect 🙏 @priyasometimes", "2407kritika": "Priya, dude I love you.", "shreyatiwari25896": "So True", "me_anagram": "@priyasometimes I love the fact that you debate with well researched facts and figures And not just shooting arrows in the air.Amazingly done! Priya Malik you so good and inspirational ! It is very upsetting that people who do this kind of destruction in theaters. They don't even know what they're doing and what for? And what surprises me even more no body has watched the film so far to do this and be able to judge a film. #Notfairwithpadmavati #padmavati", "kunwar_rajpurohit_007": "randi bhen ki lodi chup re tu", "___sahai": "you go girl😊", "charchittiger": "@abhinav6087", "dineshvalechha99": "👏👏👏", "thakur_nikhil_raghuwanshi": "Superb 👌", "saddam9624": "Perfect msg Priya", "jaydevsinh_rajput_": "Yes u r right but im from gujarat what u say about gujarat, padmavati release nahi hogi @priyasometimes", "shweta_molly": "Wow @priyasometimes totally agree with you.Kya boli ho tum", "priya_yadav05": "Kudos to you 🔥😘", "openwhiteshut": "Bravo sister ! Dickheads", "krupa__bhatt": "Hats off..... Brave mam..😘", "saif____khan": "found a reason to tune into timesnow🤣🤣🤣", "shalu_ps": "Suprb lv u lvlly", "hinakulal": "👏👏👏👏👏 yes you are right", "iamyashsurve": "Sahi😍😍😍", "lil_miss_chubby": "👏👏👏👏👏👏"}