{"sarkar_suprajit": "Jo yeh meme banaya hai usko kuch ukhadne ki zarurat hi nhi hai....kyu ki tum khud usse tawajju de rhi ho....bdw this meme isn't wrong at all", "kay.___pee.___": "Great going @karlochutiyapaa... Seems to be an 👀 opener for some people around... Support you in toto..", "gopi_11": "That other girl ka i dont know but your picture is quite on point👌", "_anushka6": "Actually, people can't engulf enough of women standing up and being loud, you see? They would prefer woman to shut up and stay silent. It's actually really sad that we are stepping into 2k18 and people haven't yet clearly understood what feminism is.", "tehrem_nasir": "Hahahaha This Is Sooo True 😂😂", "negitanya": "@priyasometimes people fear powerful woman hence this chutiyapa there one and only resort", "sandearnest": "Preach 🙌🙌", "anshultewari": "More power to you @priyasometimes 💪🏼", "ravi_kiran_das": "Correct meme #fameinists", "fazlova": "@karlochutiyapaa LOL ! Well done guys this is crazy 🤣🤣🤣", "chaudhurikasturi": "Preaching and educating people. Talking about what is right and wrong and being opinionated is absolutely not useless as this meme is. The maker of this meme is scared of strong women like @priyasometimes and @aranyajohar . Both kinds of women in this picture depict strength in different ways. They both are different definitions of feminists and i respect and love both kinds ❤❤💪more power to you", "cryptic_san": "@priyasometimes ever wondered why only Bollywood glamor dolls talk about feminism while sports persons or scientist or bankers dont? Because the latter don't need to say anything, their work speaks for them and also inspires many girls and boys ..", "thisisthe9thtime": "@___poojaa___ @ashley_mudaliar the caption", "pragathihg": "Meme 💯", "loveyoureverybit": "Ya it was probably a 19 yr old not getting a text back", "halfblood14u": "@baba.tharki 😂😂😂😂", "khyatitambi": "These are some really lame people, who feel they are the smartest ones on the planet!", "bimstagram__": "Aranya en pria didi iz makeng gud vedios im lurning geetar so dat I cen wurk b hind pria mem", "kira_nehvi": "Nobody is stopping you from being vocal about something. It’s just the ideals of any progressive society should be people who have bought revolutions in mind and in real. Those beautiful women proved their point proving irrational men that they too can be equals or more in everything that was considered male dominated. Sadly, youth is finding all the wrong ideals to look upon. Not that you are any less or wrong, but I guess, the right direction should be doing it instead of shouting about it or putting banners about it. Why can’t the feminism in general say ‘Go Girl’ to the above picture rather than being offended for not being the kind of feminism you wanted it to be. Ukhar toh koi kuch bhi nahi raha. Bas people are appreciating them more than you. Deal with your ego dude.", "moloybhowmick2015": "Totally wrong... they are nationalist...u r ultra femenist 🙄🙄", "aaa.sa.tha": "♥️♥️♥️", "prince_salman26": "Well Said @priyasometimes", "m.u.s.k.a.n_21": "Unko kuj or ni mila hoga....dont worry we r with u...", "__hemapuri__": "Love you", "peckwoodhigh11": "Dont even pay attention to all these. They dont even know what is the definition of feminism. All they know is \"feminism means- women are bold and hate the men and society\" which is such a wrong perception . Even some educated men think as such. So just do yout work and \"dont give a fuck\".", "inconnu11i": "The person who made this meme does have a great point. I agree with this meme.", "shraddhawhatshraddhawho": "This meme has NO FUCKING LOGIC!", "garryk_": "@priyasometimes the above ones are proof of feminism and the 2nd ones are the cause of feminism so chill we love you and will always be #priyaholics", "abhisaini23": "Dont compare yourself with the girls in armed forces..... Keep them out of the cheap publicity as they deserve respect", "prabh.kaur.101": "Thanks for that caption girl 😘❤️❤️❤️", "nirmika\nVerified": "Verified", "himnishmishra": "Well vo log bhi kuch ukhad nhi rahe hai. Just featuring the truth", "chaitanyabharne": "haha sach kadwa hota hai priya just digest it u dnt represent feminism at all in this country", "urbansikhhh": "O thand rakh yar...mem sai h vse😂🔙🔛🔝 @_simargulati_", "gang_grande": "💙💙💙👏👏👏", "pulkitoncesaid": "We stand by you... ❤", "inazrgram": "Somebody shows you a mirror and truth you cannot digest. Peace out #FeministArseholeWoman.", "pranav319": "Bitches step aside .fameinists spotted @priyasometimes 😂😂", "ahluwaliashramika": "Not feminist not fameinist @priyasometimes speaks for equality , eva heard her speak her mind ? Its always rational and sensible , no bias .", "trishashetty\nVerified": "Verified", "arundvd": "Kaun kya ukhadega Bhai, I support for equality. And salute to those army women, who should be more famous than you, sadly they aren't. And then comes your nonsense, attention grabbing ego. Jao NYE celebrate karo yaar", "uni_bro__": "What else can you expect from a person who named his page @karlochutiyapaa... We can't even blame you!!", "angelaksuri": "It’s silly that people try to define what a feminist looks like or should act like. We can all be feminists, so can men!!", "_unapologetic___": "Perfect answer", "tamskajjal": "That is so rude of someone to just attach some one’s picture with any random meme..No one gets to decide or judge if some one is feminist or not.", "rohaan_c7": "But it is.. Bitter truth whether you accept it or not... It won't change the fact wat people actually sees mam sorry to say but.. After getting wat it takes to prove... Feminism or not.. Strong women like u has never done anything #kaable taarif except #bigboss", "sugarynspice": "There is a difference between feminists and women achievers. Many women in power are patriarchal and not really feminists. Only if people get this. As someone who teaches gender studies, I love whatever you write and speak and stand for. Keep going ahead of what you do. Lots of love always 💕", "littlemissauror": "@boss_girl_chel what we were talking about 😆 such ignorant people much wow 😑 @priyasometimes so so happy and proud to see you taking a stand.", "iamketankush": "Actually this meme affected your ego strongly that's why you reacted to it lols", "harry_macwan1751": "We are here on earth with one purpose, our heart and soul lead us there. Those army girls are doing where their heart leads them and you priya doing what your heart leads you.. you know what you are doing.. not all people likes what are doing.. keep inspire girls and women as you are doing.. and yeah women like you we are proud of you @priyasometimes", "____beebo___": "😂😂😂Rite....ky ukhaad loge???", "mr.en_igma": "More power to you @priyasometimes", "happy_mitu88": "I was really dissapointed...wanted to show u this...so u can slap....on them...lv u priyaa", "peculior1989": "Some one showed you the Truth", "resha.k": "Power to you!", "consider_me_happy": "Burnolllllll", "anushkafying": "You're an inspiration💗", "emily_femily": "There are privileged women out there too just look at twitch/myfreecams/any social media. Where a girl doesnt need talent she just needs a vagina and big tits and watch her get more money then a talented man", "notoriousdivy": "😂😂😂😂 serves you right!", "sanaaakaleee": "You go girlllll❤❤❤", "shubham009sharma": "Grow Up", "iamsandy_23": "Thank you so much priya... We are debating on this since morning.. We girls are proud of you 🤗🤗😇😇", "joy___007": "😂😂", "_.snuggle.bug._": "Firstly and lastly .. I didn't get the meme .. it is more like a picture to me of women in the world involved in different profession . I instantly felt proud 😇. You do all you got to do and all of which you are ready to face front 😍💯 @priyasometimes I ❤️ you 💯", "chachachandnii": "Tell them! 😎🙌👏👏👏👏👏", "mutahir5854": "yeahhhh!!!common jusst be the best n fuck d rest!!!", "prabh.nanrah": "Every one's ways to change things differ more power to u 😍😍", "_browntouch_": "Bang on", "ritazzled": "More power to you! keep shining ❤❤", "divyanshugoyal_": "People who can speak they won't let them and come up with fuckin stupid reasons in order to prove themselves correct", "bushrablends": "More power to you!!!!❤️", "ayusheedashh": "Love you! 💗", "samsometimes": "Exactly this meme is the most illogical n I love you @priyasometimes u r a true slay doll ❤😘", "pria_27": "@priyasometimes this is why U inpire so many around...!!", "mehraabdhillon": "You’re fckin awesome 👏🏻", "touleeka": "A very good answer", "okayisha": "Preach it gurl! 🙌", "ahluwalia_rishi": "Jali", "acchwan_gurjar": "😂😂😂😂😂😂", "anuragmishramusic": "The page name says it all.", "rahul_sati": "Come on they aren’t “fameinists”. They are just conveying a message which quite clearly Indians are not understanding. They are just using this platform to fight for their rights!", "awanisinghdixit": "You girl!❤️💪", "divyaagarwal_official\nVerified": "Verified", "rutubhatt_": "👏👏👏❤", "nianuzhat": "👌🌚THE BEST!", "__komalyadav.__": "U beauty ❤️", "_the_secret_chapter": "Don't think of them Yaar....you are awesome", "priya_yadav05": "More power to you!!", "aree.zz": "Damn, you girl!❤🔥", "darshan9988": "To become famous , isn't a big thing ..nowadays", "vikramsakhalkar_admirer": "Yeah thats the spirit @priyasometimes ..u r amazing 👍✌", "its_joyeee": "Why do even people make such shitty memes?! Good Lord, give 'em some brain!", "thefoodiebutterfly": "The heights of jealousness. Aur koi kaam to aata nahi inn bicharon ko, tabhi ye sab bakwas post Bana rahe Hein! #Sick People🙄", "whyineedfeminisminindia": "@priyasometimes It was posted by page @sarcastic.ind but I believe they've deleted it now. I have a snap of their post though", "oonmona": "@anusuyabhuyan etu saa.", "tinafreese_20": "One should just ignore such people when people badmouth you and your work then you must know u are on the right path ☺☺ @priyasometimes", "dylankloss": "you've been an advocate for women for as long as I've known you so whoever made this can suck a fat one.", "man_from_knowhere": "Shaanti...."}