{"mr.2hk": "Times now ....its become republic tv....useless", "utterlysnigdha": "Point rightly put Priya but what about the rude slang, great figures like Sachin and Big B have done this in the past being so gentle and polite, this could have been practised at least. Being public figures doesnt give you rights to be rude", "janardan.dubey": "All are big gawar...and Indian news channel are big time waste", "shubhi2013": "Very rightly said Priya fully support Ur statement....", "aaryasharma_08": "No need to publicise so much. I do this every time i see people throwing garbage on road bcoz it is everybody's responsibility. No big deal.", "iam_b27": "Means do it privately? 😂 @priyasometimes", "rach_0909": "If the person is ashamed of being shown on tv, he should be more ashamed of littering the streets!! The guys mother is trying to gain sympathy....covering up her sons mistakes", "prat.mist": "Wait , it became TV debate , there is a reason I stopped watching Indian television , specially news channel's & these debates are telling me how right I was to do that. What a waste of time , there is no point of these debates , this is not news , this is bullshit , this is trying to earn anything they can by using celebrity angle in it.", "kimi94k": "The people who are shaming Anoushka and Virat, are the ones who should be shamed. It makes a difference when celebrities show these videos, because people look up to them . The rich dude, who is crying victim boo whoo, you shouldn’t have littered in the first place.", "dhawananant": "Bc Ispe bhi debate ho Rahi h😑😑 @the_godfather10 @_i_am_ayush_ @apoorvbansal__23", "evilking_pkumar": "Ye Video kyu Banaya gaya ??? Preplaned tha Kya ye ???", "uzumakitools__marketalloe": "Fuck india", "shubhrahanda": "well said Priya", "souravjeetsingh": "If they don't fame why they promote themselves so much??? In each and every adds, movies promotions?", "aekaaashkehum": "Wear helmet at the back also", "itsmeibbu0": "Great job @anushkasharmakohli💌", "not_so_friendly_anuj": "You people have to talk about everything it's ok if she scolded someone just to throwing garbage on the road and there is nothing wrong in it and remember if everything is possible with love after prime minister don't have tho please in front of people just to clean your own environment", "manetheomkar": "Who cares what these self centered assholes?", "csarkarsmile": "I agree with you.. they are already enough famous", "the_geminian_stories": "Watever u have said is ryt 👏 ☺", "amandeepkhaira28": "You are toooooo good!!!", "ktaskir": "this is soo sick... they could have blurred guy's face before uploading it on instagram. if they really want to promote the cleanliness", "aarushisingh8": "On point.. Totally agree with you 👍", "shane_shafi": "We well said", "deepajoshi1742": "Good job 👏", "das_rochishnu": "Absolutely. It's sad and bewildering that a majority of Indians are actually coming out in support of the guy who was littering. As if filming the incident absolves him of the fact that he was in fact, throwing trash out of a car, on a road which is a public commodity. He deserves to be called out and shamed, and to be made an example out of, so that similar miscreants think twice before doing something like this further. It's so amazing that famous figures like Virat and Anushka took an initiative to actually make an attempt to correct him.", "villainhere": "Lol of course the need publicity", "fankara_here": "Wow great words gal", "rohannayyar0114": "She was right but the quote you used is a sheer example of double standards.", "patelpriyank91": "💯", "innocent_agrawal_7": "@priyasometimes looking soo adorable", "shahid_frazer_ansari": "Why should i follow them?", "optimist2309": "It is totally publicity stunt by anushka sharma . Think about it wife is scolding someone and husband is making video and uploading it . If you are really care about society why are you endorsing alcohol brand.", "twinklechopra06": "He bhgwaan😒 News channel walo.. go and talk about something useful. Stop making TRPs by showing drama on ur Channels!. Pdhe likhe anpadh log", "jordanjitendra": "@anushkasharma Only Public Drama", "shilpasurroch\nVerified": "Verified", "anuragmishramusic": "Very well said 🌸", "foodietweeter": "Neatly summed up @priyasometimes 💞💞💞", "the_psychic_chick": "The real publicity stunt is being done by that boy's mother ! Talking about being broad minded and yet not accepting their own flaws !! #shame", "nikhil_gaurav20": "Ye Publicity Stunt hai. Anushka Behavior like illiterate", "iiateeqii": "On point as always !!! Lysm ma'am! !! The way you present your arguments is so on point @priyasometimes"}