{"yashbis.k": "@priyasometimes this is a shot 👍 🔫🔫🔫 man must change their way of thinking shity people will talk shit 😐", "taimour_hashmi": "Try burqa", "notoriousdivy": "Kick boxing would help!", "aadil.latief": "As per them, its Shroud", "bebitcelbin": "How is it when a rape happens every1 goes wild and a month later every1 forgets till the next person gets raped. Like seriously. Pathetic. Instead of beating around the bush chop two or three rapists. The rest will learn. Anti rape clothing ? So childish. Wish u wer all born in Saudi Arabia.", "vipul.lobster": "👌👌👌solid answer priya👌👌👌", "b.ana.ana": "Try the burqa. 😂", "risshang_mehta": "😂👌", "ekta_chhibber_kedia": "applauds @priyasometimes I LovE U💕", "piya_bombee": "Agayaaaa anti rape panty..👙 😂😂😝😝", "me_raxa": "If you really want that clothes go and search on Muhammad (S.A.W) you will get all your answers.", "piyush474": "whose ur favorite in bb10?", "sufiyan.ahmad": "The best way is , all indian girls should start taking traning of martial arts or boxing", "sayani1999": "❤❤❤", "pandemanav": "Nither Burqa is qualified...", "yogeshgargyg": "Changing thoughts cloth may better suit.", "tgofitw": "@taimour_hashmi Let us fuck each other. It is settled.", "kirati44": "Chastity belt for the boys, wives and mothers can keep the keys in the safe.", "niko2924": "Good one 😘", "_mohit_0702": "Word", "attika_sheikh": "👏👏", "sw.ass.tika": "so true man @priyasometimes 👐👐", "stumpilicious": "👏👏👏👏", "kanksha_tanwar": "@theknair", "urvashi5522": "Jeans with full sleeves Top @priyasometimes", "sapnakanika": "Exactly", "cyhdjgh": "Yeah", "satyaprakashmy": "A parda on the rapist thoughts might work.! @priyasometimes", "anuva.sarzana": "Exactly! well said @priyasometimes 🙃", "onlineeexpert": "I think you already got twice in Sydney baby...that's why hurt creating more huss and pupp", "knairrr": "@kanksha_tanwar how bloody true. :/", "desishakespeare": "Now it looks like burka is also out of the question!", "nakul_ghai": "You know how to hit on point using words as swords .This is so impeccable .Ma'am @priyasometimes ,it feels so good to see you vanquishing the male chauvinist opinions and worn out beliefs so that this world can become a better place to live in .So admire you for this .", "ishwetagulati\nVerified": "Verified", "acoustic_arun": "Forget about clothes even your own home is not safe enough", "simranmehra384": "U dnt need to have ANTI RAPE CLOTHING bt people need to have ANTI CHEAP THINKING BRAINS. @priyasometimes bt u nailed it again . i lv u", "sakshiarya24": "Very nicely put across.. I wish they introduce something like this real soon.. we need it badly to get rid of the suffocation we go through each time we go out alone - the suffocation and fear of getting raped, molested or eve teased..", "crazyunicornladyyy": "@ozaaaa_1721 this is so sad.", "juniali19": "#word", "dhaval2338": "I think so called cultured people needs to wear the unique clothes \"Mentality\".", "polafaul": "Try a borka with nikab before putting any negative comment", "paullygrram": "@priyasometimes More Power To You Lady! Mmmuuuaaahhhh! 😘😊", "dudenotrude007": "Martial arts would help, clothes won't cause we have turned animals then just humans ! P.s. I don't think you or any westerner has any right to comment on that. These are internal matters and have to be dealt internally ;) you please take care of the human rights in Australia. We have enough population to take care of it. Commenting on women oppression and human rights is the most common way people take to gain publicity. Stop being that!", "an_idiot29": "#Agree #Shame to be called #Men", "praveen.p": "I guess Shirt-Pant would go well... After all, those custodians were wearing the same... And I guess, they are safe in that... But beware, it's effect will be drastic... You might loose your ability to think and stoop to the lowest and cheapest possible mentality...", "ijamalahmed": "if a guy is with 6 girls he's a stud and if a girl is with 6 guys she's a slut.. this is sad but this is the reality of our culture thinking", "shreya3saxena": "@priyasometimes neither the burqa seems to qualify.", "ozahahaha": "@crazyunicornladyyy", "doctorshubh": "@priyasometimes this is I'll mind if people you can't blame it 😔", "shaggy_amit": "shirt-pant is the correct answer.. not the jeans🤔", "___poojaa___": "@thisisthe9thtime", "rubeena2016": "🙌🙌🙌", "amitrawalkabri": "Hahahahah anti rape clothings kidding so gud ..... we need anti rape thinking thats it 🖒", "meetu_bitsandbitez": "👍🏼🙌🏼", "__hemapuri__": "👍👍👍👍👊", "priyasometimes\nVerified": "Verified", "waqi_hussain": "It's the mindset even armor can't control that intention!", "desai_apurva": "Rape proof clothing too!", "priyamsaha": "Anti rape clothing is the way! Please help!", "claudiagraciie": "you go girlfriend", "__.littlewolf.__": "Anti rape glasses 😑 for tht hawaskhor prani's...", "tanyajaisss": "I think should give eye masks to boys .. Wats say? @priyasometimes", "crescent_point": "Good one ☝️ . What we really need is- training for men !!"}