{"santosh.pandit415": "@_michellepatrick now hc should learn from you where to point emphasize. My grandpa is session court judge. So please .... And at the same u support those basturd who said'bharat teri barbadi hogi insa allah insa allah'", "rvnamdeo": "They are also forcing you to wear cloth at public, Instagram is also forcing you to post such rubbish posts in it.. And i dont know why god forced your mother to give birth to you, who have problem to stand for a little time to stand for our country..", "jaypandya314": "@sahar_taraporewala hato ho raha he GDP samajte ho wo aese to nahi badta.koi bhi kam hone time lagta he. Notional Anthem me khada hona galat thodi he we are Indian we proud to be Indian.to hamara anthem he to khada to hona hi padega.aur usme ye kiya galat kiya national anthem ke liye?are you serious.? To to app drag flag hoga salami nahi doge to to aap bharat mata ki jai bhi nahi bologe. Hum to khade hoge chahe wo ATM ke bahar khada hona ho yea movie dekhane se pehle. I am proud to be Indian.jai hind", "thesarcasticgod": "@_michellepatrick they do not force you if you're standing the won't drag you stand up", "the_bourbon_stories": "Then go back to Australia", "priya.walia.94": "They force u to stay back in india..they force u to create controversies..they force u to make money in india...go back to Australia that is wat u deserve just get the hell out of here", "sankalpksingh": "Bloody idiot", "yogeshgargyg": "You think so but our country needs this..", "countryroadsgrocerystores": "I see how conveniently everybody ignored the \"standing up for ourselves\" part. I totally get what you mean Priya. 💙 Guys. Get. Her. Point.", "madme0202": "I so agree with u @priyasometimes ....rather than making us stand for everything...first the govt shud learn to stand up...fix roads, govt hospitals, schools, poverty,provide proper sanitations then think of everything else!!", "akankshakar": "It's hard to comprehend why ppl start calling names on social medias. everyone is entitled to their opinion, you will find dissenting opinion everywhere. You like what she said or quoted, click on ♥️, if you don't just scroll. In what world will abusing assist you or \"convince\" other person to see your point?", "swarupsahoo": "Talking of philosophy, maybe it's teaching you to get out of your slumber and take a stand instead. *opinion of just another internet crusader*", "nikhilmehra22": "@aaryamanjoon", "tedmosbyspam": "@ishra_sil people should learn from you", "michnomer": "@drishti_k Uhh yes they do. They force you.", "arjun_mystic": "Disgusting", "sunil4uluv": "Very well said.", "silpa_23": "This tweet makes me feel that I shouldn't have followed u... If there are 400 ppl in theatre, and hardly 10 can refuse to stand up for national anthem.. but rest 390 ppl will willingly stand. Ppl like u dnt care for majority in country. In schools also we were asked to sing national anthem everyday. Everybody willingly did it. Bade hoke Pata nahin logon ka dimag shayad zyaada chalta hai.. And regarding standing in bank queues, u can very well use digital mode.. and yes I do agree we need some cash for day to day activities, but kya pehle aap bank ya atm Nahin jaati thi? Tab thoda Toh line hoti hogi ... Now think yourself, if public will say the same they dnt want to stand in line for buying tickets to watch your play, then aap kehti rehna \" KYA UKHAAD LOGE\" .. its a common problm of many Indians... They have many problms regarding anything wrong in India and will leave no stone unturned to criticize cities, corruption, pollution, poverty, unemployment etc etc but when asked to be part of the change they will start complaining. If we as Indians will not change for better then who are u expecting to come and help us and change everything overnight?", "vinayak.samant": "Bad", "ajshanker": "@priyasometimes Damn i followed you for the hot pics, now im in love with your quirky wits!", "tasr.a": "I love this", "vikaslmp": "Thats why ques are being stopped.be digitle,use less cash. #digitalindia", "anil_pandita": "#priyamalik", "the_ashish_25": "Galat baat @priyasometimes", "saakhichadha": "@ishitawadhwa", "nav_gill555": "U r not forced to stand for anthem... its all about the respect we show to our nation... so please stop comparing anthem with atm... or urself... @priyasometimes", "hem1ock.aditya.ab": "Dnt ever line up fr movie ticket ... or in trqffic ... and if u do that post it too", "drfaatinkhan": "Yes priya! You r sooo right!!!!", "earthyangelzonline": "Yeah, it makes no sense also. Especially, if after national anthem ☝️ will watch some raunchy movie 🎥", "the_revolution_in": "y are ppl even commenting on this Bimbo!!", "manju.s.p.18vk": "Please madam,,, have some respect towards your mother land, if u think you forced to give respect to our national anthem, then you have no rights to use or national resources, ,,,,,,, just remember you are still in this land where u don't want to be forced, , if u don't want to be forced for some good causes, just get out from here, ..... No one gonna care for u, ,,, by the way,, if u can tolerate 60 years of robbery,,, actually u should tolerate anything that you are forced to do.... Think before u speak...Have some manners.", "sampathpulupula": "If you are too tired you can always watch movies at home", "aadil.latief": "Thrz no by the ppl, for d ppl,", "pgh_roamer": "Btw they are forcing you to keep India clean too which we do not want..", "rv_sam_mehta": "So damn true.. @dinalshah94", "vgarg0613": "So what will be the better way according to u?...m sure u dont have any..#fos", "bk1268": "We are now at the mercy of the system which is being run by... Any guesses", "beingkunalmathur": "Oh! Don't say this... You were deserved to be eliminated in Bigg Boss.... You selfish fellow... I wonder how can anybody be so insensitive and so selfish.... You just can't stand for less then 2 minutes in our National anthem and some hours fr country's betterment ... I know people like you just want to sit at home and want country to be changed... SHAMEFUL @priyasometimes 😑", "swagat_333": "What's wrong in that? In Australia people do stand in queue for everything. You never whinge. Stop whinging and support", "shrirajgujar": "You forcefully stand for national anthem and not because you respect it?", "shubhamguptta": "M tired. I wanna sleep for eternity.", "manakyadav": "Wtf , no one forcing you to standup on national anthem? You just lost a true follower", "dinalshah94": "@itz_rv_for_u", "iamrumanarafi": "Hatts off to your thoughts...mam", "priyasometimes\nVerified": "Verified", "lm_10_shikhar_": "Wow, you want to sit in home chill out and want nation to change by itself? Now some idiots will say first the gov. should build roads, toilets, etc and then force us to stand in queue😂 Why is India not progressing at a significant rate? The answer is.. Mentality of us Indians.", "drishti_k": "They don't force you it's basic manners now if you consider standing for an anthem that lasts 51 seconds you're physically too weak or have no heart for honouring your country", "kausikmitra": "@drishti_k righgo", "anujdave91": "Please shut up", "wineofwinsfield": "Shut up you bhucher", "pretty_trippyy": "People like you find it cool to oppose. No matter what it is or how it is. Just oppose. It's cool and it can help you gain focus.", "_dhvani_pobari_": "N then ppl like you @smsaxena19 keep on blaming government which sees the good of honest people", "crescent_point": "👍✌️️👌"}