{"tehrem_nasir": "& I'm Agree Mufti Sahab Is No One To Say You Anything Coz In Your Religion Its OK To Wear Mini Skirts or anything else", "ali_jaffri234": "@aggarwalyashh", "aggarwalyashh": "@ali_jaffri234 lol... Well it sucks but its true that Islam is cancer. Every terrorist is Muslim but when it comes on religion you guys denied by saying 'Terrorist don't have any religion'but wait, what? Didn't they belonged to Islam before? You are talking rubbish about Hindu goddesses but I'll just call you a pig cz I respect other gods too. Well, you call your islam 'Pak' from where the f*ck its 'Pak'? Pak in dis respecting other genders. Pak in terorrism. Pak in black marketting. Pak in rapes. 'Namard Ki Aulad'", "its_maryoom143": "n i'm gonna unfollow u, coz mujy pata nhi tha ap etni rude insan hogi 😐 @priyasometimes", "___poojaa___": "@ashley_mudaliar @thisisthe9thtime", "bespoken_craft": "Why have they got a molana debating with you. Its a complete category to your lifestyle beliefs n his 😖", "zarasyed2": "@its_maryoom ameen", "dipanshii_": "A much needed answer. Our society does not understand this. Even after such cases girls are adviced to not wear such clothes which attract boys. Idk why the guys are adviced not to look at any girl in such a disgusting manner and NOT TO RAPE. We need people like you mam. RESPECT!", "a_axtract": "Well done.. I'm so proud of you.. i dun have words for you..", "im_awwwais": "Show the answer 😊", "bhumikashrees": "Well done", "shefali_s_shetty": "Well said @priyasometimes u r awesome 💗", "hu9672": "Wtf", "sulab2007": "Saaabaash @priyasometimes awesome reply...keep it up this positive attitude.", "shivalikapathak": "@priyasometimes finally you say what needs to be heard and understood", "khatri_mahipal": "@maya.ali.01 its thinking mentality against girl", "rhea_ruhi": "Tired of these sick minded people. If we ask them not to wear that cap he is wearing bcz that cap offends us. That cap is the symbol of oppressive religion and archaic mindset, and we cannot tolerate how these old men flaunt their tiny brains. Then will they stop wearing them? They won't right? They why are we supposed to listen to them? He isn't even above the law and order of this country yet he is pulling out examples of london and stuff to mute us. Funny old man.", "notsosubtle_abhi": "Nailed it", "maya.ali.01": "@mahipalmehra1994 height of dumb'ness.", "maher_aq": "@debs_shraff well said..the religion shud not be blamed for that", "sahil1420": "🖒🖒", "slay_19_": "Mam u nailed it ❤", "rahulmishra1987": "Mufti is so idiot. who the fuk is he to say what anyone should wear? You it it well Priya", "iam_aashisahay": "We totally support your debate answers priya ! This one was fun to watch finally someone speaking right with their senses! You made him speechless was a delight and peace for the eyes ❤", "tsetanlhamo": "Point.. u r right priya.. we all woman r with u", "tasr.a": "Ugh it's mullahs like this that make Islam look stoneaged 🌚", "meghna_9643": "Welldone 👍", "pinybuds": "Love you...u make our name proud ;) proud priya to another ;) @girishns", "im_naazz": "Well done priya!! Thnq!!", "nikkie1896": "Ma'am u really nailed it @priyasometimes", "shirazzz_1": "People like him are actually of very sick mentality. They actually need treatment . People like him knows & concentrate only on outer self & their self made religion which tells them only & only about how to & what to wear, Put a long beared (😁 thats important ) , to treat other religions like they are nothing. They know nothing about equality . They know nothing about inner change . They dont realise that if there is dirt on your face u dont have to clean d mirror . Plz dont lable him as a muslim by just his looks . Don't believe anything just by listening & watching . U have your own brain to decide what is right & what is wrong, what to believe & what to ignore. This is our generation friends if you're gonna believe everything that people says then u r not so different from them .", "niteshsloth": "@priyasometimes proud of you. Nice reply", "rv.deepz": "you are amazing mam @priyasometimes 👌👍💪 .. 👏👏 ....... #RespectPriyaMalik 👏👏👌👌👍👍", "advit_verma": "@priyasometimes well said. Now I support you for this. Appreciate your standing on such issues.", "gehenaaa": "Slayin' it gurl. This is why you're the best. You're never afraid to stand up against douche bags or voice something. Such an inspirational trait! @priyasometimes", "irehanghazi": "Hindu deviyo ne kabi poray kaprey ni pehne thy to ye kahan sey", "rishabh_aar_kay": "Well answered..... 😪🙋🙌👏👏👏👏", "sabitharakesh": "U nailed it 👏👏👏😘😘", "ss_prajapat": "👏👏👏👏", "_adeeebaashraff": "I think this man is not able to answer well and explain u about ISLAM ..SO PLZ NOT JUDGE ISLAM ON THE BASIS OF PEOPLE LIKE HIM", "princy.ism": "@anif_wali_ 😍", "guneetkaursidhu": "👌👌😹😹", "garryk_": "@priyasometimes very cool love the way you troll", "biba_khilji": "Words for Muslims", "natashaswain23": "Nailed it baby", "iamdanyalkhan": "accent ! 😆", "khaata_rahe_mera_dil": "You left him Clueless! 😆 @priyasometimes", "viraajdeyk": "Old age prsn ka yehi hai peee😉 unko smj nai ane lagi hai", "bhaskar.borah84": "@priyasometimes Madam he's ass must be paining. You screwd him. Well done.", "sowmya_srikrishnan_mrs.k": "Kickass !!! Girl ur wonderful"}