{"crazy_vin2": "Do u Know zairawasim allegations we're turned out false", "anu_pathak07": "@iamtanushreeduttaofficial mam uh rock..❤", "nidhi.pk": "Very true....this double faced society sucks @priyasometimes", "itshabeeb": "@priyasometimes she already talked about it in 2008 itself... YouTube it to know", "cheezydoesit": "THISSSSS", "ankit.rh": "Madam.....I think u r not aware of Miss wasim incident.Go and have a fact check than come back.", "raghava_gupta": "Those who are arguing against the point should check the Bill Cosby case. They may get some education about what goes on in such sensitive issues. But if u are ignorant enough to defend the molester, I have no hope for you n the women in your life.", "payal.natasha": "So bloody true. Once a woman finds inner strength and deals with the feelings of self blame and shame, which may take an entire lifetime, they still may not report it out of fear of being shamed by others. Especially in the Indian culture where incidents like this are seen to degrade a woman’s worth! There are millions out there who will never report unless society genuinely allows women to speak up without being ostracised for how long it took to personally heal from a traumatic sexual incident. That is the starting point.", "jigyasa21": "Well said !", "themoiofficial": "That’s true", "anupbisoyi": "We know the actress very well n know which type f movie she has done...asique banaya apane ,forgot ? Attention seeking actress.", "piyush21": "she is blaming NANA.. one of the most decent PERSON bollywood ever had.. n just coz she’s a female we should trust her, non sense!!", "singhveerinder": "Madam I think you are out of your mind ...10 mins and 10 years mein bohat difference hota ...it all seems like *America se dil bhar gya ...chalo India ja k thodi aag lgate hai kisi ki zindgi mein #hypocrites", "photobaaz.in": "It's called Himpathy", "gullurathi": "Zaira wasim did that to gain popularity nothing more then that..", "shehla_shora\nVerified": "Verified", "rajshri_kovil": "Tanushree spoke back then too, it’s another thing no one supported her", "rajatamlan": "A few moments of silence on the death of logic and awareness, please. The lady seems high on weed", "asthaideal": "exactly..👍", "that_gorkha_girl": "It took just a few moments to destroy a man's reputation and life . And feminist dont give a shit . The irony.", "thibanrajsham": "True😔", "urdaddy_here": "Zaira claim was not true", "papihanandy": "You are so right. All women raise your voice against every man who has sexually molested you or tried to molest you, please expose all of them.", "tapasyarox": "absolutly", "utkarsha_88": "To the point", "jyotiisethi\nVerified": "Verified", "dilkushrizvi": "Very true ❤️", "shubh.arora30": "Zaira's claim was not true. Please check before posting any shit. Thank you", "arunv466": "So, we should blindly accept everything she said without questioning the authenticity of said accusations?? And it seems like u didn't follow up on that zaira wasim's incident completely. It was a fabricated story madam ji", "shankerchhatri": "Valid observation", "bearded_curmudgeon": "Interesting that the defenders of Brett Kavanagh, Bill Cosby and Harvey Weinstein have been using the same defence. Shows how sexual harassment apologists are same all around the world. There could be inordinate number of reasons for women to remain silent for a long time in a predominantly patriarchal world. Brusque dismissal of victim accusations because they spoke up late is one of the ressons why women don't come forward. The point in this particular case is moot though. Because Tanushree Dutta did call her accuser out right when the incident happened.", "fankara_here": "True yaa", "adore_marzia": "True !! 👏", "pimoladnom": "Funny when you say it like that... not so funny when u think about yourself in that situation. God save us in this country.", "prateik_21_": "You are absolutely right ma'am", "eros2.shouts": "Go watch ashiq banaya apne.", "pratibha_kanwar": "True..", "priyamsaha": "This!!! Also, she did talk about it when it happened also I remember. It just wasn't \"reported\" that much.", "__.a_d_i_t_i._": "I completely agree to you , you are saying the truth , the truth which everyone knows but they don't accept it publicly !", "poorna.kulkarni": "👏👏👏👏 Absolutely.... @priyasometimes 👍👍👍", "ramanujamrake": "Zaira wasim claimed a false allegation that entirely ruined a career of a man and his family..", "101_soniaa": "True that", "__komalyadav.__": "💗", "maityanupam": "So taking a few hours and taking 10 years is same ? The most ridiculous comparison I have ever seen!", "zeenasimon": "So true...", "swarup.art.1": "Beautifuly", "mahrukhayub": "Well said", "kabita.subedi": "So true priya... why not let support her instead of questioning ...why not question ourself that why we being so cruel and harsh to others problem", "candid_wali": "absolutely.", "jhalli_piya": "Ab kare ya kuch saal baad... Atleast himmt to ki.... Chup rhkr regret krne se to achhaa h na...", "cultureandclutter": "Damn true", "humanistnature": "True its absolutely right my support is for#TanushreeDutta", "ishani.sinha": "True...", "mukherjeepronoma": "So true!!!! So we just need to raise our voice no matter what!!!", "art_poppy": "Its sad. But its the choice of the masses what they want to believe and what they dont want to.", "adi.gautam": "i agree with you...but that doesnt also mean she is completely true...", "ihgupta": "She did raise her voice back dn as well.. Bt no one supported her... And no one is supporting her nw as well"}