{"vikki__marvellous_mehta": "He's just a cricket player do not patronise him . Bhai agar problem hai to don't go and date these\"players\"", "jagtapshreya": "This video just touched my soul.... N the array of words used by uh were 😍😍 absolutely 😘😘😘😘", "aradhanalal": "@priyasometimes absolutely brilliant. Pragmatic, empathic and authentic. Love your words, stance & body language. Yeh hua na.. karaara jawaab 👏🏻👏🏻 @unerasepoetry #boysmanup @brylcreem_india #brylcreem", "preeyankaaa": "@preuhh @_trishhna", "vedantbhoir26.11": "#boysmanup", "_abhishek.0612": "The only point he was trying to make is that he is close to his parents and shares everything with them. He was just a bit too straight forward for this indian society to handle.", "inderpalsinghnagi": "Thank you for doing this. I'll probably cry tonight I can't even explain why. How his words hit me in multiple dimensions. Thank you for putting stitches on the wounds of many. Thank you. 🙏", "_.motivation.__": "Amazing @priyasometimes you are insptiation", "aastha.rawat_": "this is such a beautiful piece!! 👏🏻👏🏻👏🏻 PREACH", "niviijain": "Mesmerizing 😍😬", "nh4_cl": "Paise kamane ka Naya zariya . And , I am not defending Hardik Pandya .", "nishta.patelpvt": "I HOPE MR. PLAYER can listen to this! #preach", "aaryann_sen": "Just one word. POWERFUL. 💪🏻💪🏻 I just saw the whole video and it literally gave me chills. Hatssss offff . Everyone must watch this video. @priyasometimes", "being.tanya": "✨", "riselikedphoenix": "Badass Feminist keep slayin' @priyasometimes Much Sucess to you", "_m_e_d_h_a_": "#howwzzatmoment", "___isamarthkanchan": "@priyasometimes Priya mam an amazing ans to @hardikpandya93 ... He and his cool parents shld watch this and learn how to respect women around the world.. #racist #sexist", "akumarilife": "Absolutely loved it Priya! I love everything you said and I love you for who you are and what you do!", "scribblersword": "@hardikpandya93 dekh le, Tere kaam aayega.", "swati_396": "BANG ON! @priyasometimes 👏🏻👏🏻", "dhvani.8": "@hardikpandya93 dekh le, kaam aayega.", "sarika_anjli": "Proud of you Mam😊", "serendipity2118": "@priyasometimes this was a slap on his face through your strong but calm voice! Really loved it 👏👏👏", "chaitanya_vasudevan": "@ruchazzz ,@kajalbasantani", "nivi_kanchan": "@hardikpandya93 you’re a loser", "shambhavi_36": "@hardikpandya93 👎🏻", "taylor_swift0009": "@hardikpandya93 💩", "akhila_22": "You’re my spirit animal. I love you 😭😭❤️❤️❤️❤️❤️", "littlemadguy": "Thank you @priyasometimes for this.....👍👌", "moulijain5": "This is an epitome of excellence... Such strongly written and said... Have heard it more than five times now... Being metaphorical, These should be the raps our upcoming generations should learn..... Ms.Malik 🙌", "aayu_shri09": "Hats off 👏🏻👏🏻👏🏻", "saazjangra": "Thank you😘🤗", "_yami.cat_chi": "This piece of yours has summed up Every thing that everyone needs to know. It's time for the boys to man up. 🔥🔥🔥", "ramanb2089": "@abasson_x_ she replied to Pandya’s comments. So brilliantly put. Had to share", "jazzkaran2": "ma’am i remember in a speech mr modi asked indian parents to ask not their daughters but their sons where were you and once these questions are asked to guys we will evolve", "varun_abc3": "K", "prrsenjeet": "Sab firki le rahe h and @karanjohar being host didnt even aplolgise. What an asshole", "dusky_by_nature": "❤️❤️❤️❤️", "yashrajkale": "@hardikpandya93 ye Kya Kiya", "isha.chitnis": "@nofunkyname 💯💪🏻", "manishayellapu": "I haven't watched the episode and I'm glad I didn't. I don't think I'd have liked the feeling of watching two supposed \"gentlemen\" talk that way. But I have heard bits of it and seen clippings on Instagram. It's outrageous. I do not watch cricket and I do not know the general behaviour of the said players on or off the pitch, but regardless of who they are, such behaviour is unacceptable. Especially in an era where we constantly strive for equality and respect for all genders.", "alishba_0786": "Do you remember me?", "roameos": "@karanjohar see this? Will you.", "wittyvarsha": "@priyasometimes u see ... usko samjh nhi aayega.. he said he cant read his name.. this is way too difficult to understand for him.. make a hindi desi tapori version of dis so he gets this 😑", "shivanimandrawal": "❤😭", "aishhhaaaa__": "💯 as usual", "brijesh.jani.98": "Goosebumps🙌❤", "saloni31193": "Soo true. .. so damm true. ..👏👏👏👏👏👏", "yours_duff": "I know so many men who refer to girls as chicks and keep number counts of sleeping with them. Its absolutely disgusting", "___gloriaguha__": "@hardikpandya93 a lesson for you on how to be a gentleman before playing the gentleman's game.... Hope you learn from this video what ur parents failed to teach you", "arunima_mazumder": "😚😚😚😚😚 it's such a good message.... to be rectified by the certificated ceremony of audioo .. love it mam.. we are all proud the confront our wordds through uuu @priyasometimes love u mam ... greatttt .", "sandmanbeach": "@priyasometimes you are amzing.", "rana_himanshe": "@hardikpandya93 sir with due respect i wants to say that i don't want to differentiate between right & wrong; neither I see myself being judgemental 'bout your statement on @coffewithkaran but what this lady had said was undoubtedly CORRECT. #sheisright #soachbadlastylebadla", "adhvik_official\nVerified": "Verified", "anuukhang": "🙏🙏👌👌thank you for speaking on this", "kaur_richaaa": "🙌", "sreyashi_raka_das": "Thank you for this 🙌", "sarabjeet_kaur": "So so well spoken .. well written & well put up 👍🏻👍🏻#priyasometimes !!!", "shubhrahanda": "You are inspiration n have a great voice 👌👍", "anjashisarkar": "I was once counselled on how Men are allowed sexual misconduct because they are in powerful positions. I was not even 20 at that time. For a long time I felt they were allowed this liberty because of how the society normalises such behavior. A few years later I met a man who kept on feeding me with the thought that women are only quiet when they are 'banged well'. I have since then remained in the zone where no man can either take me home because my talent and intelligence scare them, and he can't get into my pants because I demand respect first. This video is so relieving @priyasometimes 🌸🌸🌸🌸🌸", "nirjharbaswal": "@priyasometimes , Ma'am, Not in favour of Mr. Player, but I have always seen all your videos which are male-bashing. Not even a single video or a talk about those misandrist women residing in the society, what about those Miss. Players? When you talk about gender neutrality, why don't you see this side of the picture as well? I hope you are not one of those feminists who doesn't believe in the idea of egalitarianism. I have always loved your videos. I am a big fan of yours, but I think this is high time that one looks at the other side of the coin.", "itimitali": "@priyasometimes I think that objectifying girls have become the trend. Is it a neglegency of parents or is it a definition of becoming cool parents I don't know.... Sometimes I wonder where our country is going? Basically nowadays people are actually literate but not educated...", "dripping_sword": "You are such a gem of a woman ❤️💕", "naive_rayofhope": "Beautiful", "thekaur04": "Just watched the full video on YouTube!!! Very proud of you Priya for bringing this up and putting it into such words!! #killeditwithkindness", "kaurvlogz": "Goosebumps 🙌🙌", "curiousaspirant777": "You're my inspiration 😊 🙏❤️", "mudramakati": "Mr player really needs to #manup in the right way", "shweta._s._painuly": "N one more thing, after all this, just do a gig about how someone has made karan johar feel shy in his own show", "nandan.1998": "Very well said @priyasometimes ❤️", "bebadass.in": "The timing 🙌🏼❤️", "lavina_alagh": "❤️", "kritikaarai": "🙌", "annu_brar7": "You are an inspiration...really!😍😍", "nazma_ikra": "I just can't understand what is soo cool in being a Man they are Human just like us. Btw your piece is so lit🔥", "boutique_mayaz": "U have strong voice❤️", "prashantdingrani": "Priya 👌👍"}