{"momna_qureshi": "@hindianguy to wake up kids of my neighbors for tgeir school doesnot include in my religious or moral duty whereas azan on a loudspeaker counts as a religious responsibility", "hindianguy": "@momna_qureshi mate, nobody is complaining about azan or Aarti. Why do you guys need a loudspeaker though?", "wildhair_chronicles": "So damn true.", "spaudio_": "WOW priyasometimes", "ali_jaffri234": "@hindianguy loudspeaker are just to call people to the mosque.. People cannot put there ear on the wall of mosque to listen to the azzan...and wait for azzan to come.... Stop discussing about Islam.. If you don't know anything....", "waalii_zaman": "@priyasometimes mam azan is liay speaker mein di jati Hai q k hum muslam azan sun kar foran namaz parhty hain .. or agar ap kahain k namaz ka time hum phone ya ghari pay daikh kar b parh sakty hain to humary mazhb mein Hai k azan ki awaz kan mein jab pary namaz tab parho or azan ko Sunna b sawab Hai \"humary mazhb Islam mein\" ap k mataoun k jagraty or etc mein kisi ny koi ibadat nai karni hoti k agar usko sunai Na dea to ibadat miss ho jaye gi lakin hunari namaz kaza ho jati hai", "nanziba.yes": "@__ridita comment poro lol", "sohailrafat": "Only 1 Discussion In India. RELIGION.... evrybdy has to leave this world. Why people are engaged in this. God is 1.", "ab_sol_ute": "@priyasometimes proud follower be it big brother , big boss and even this , love the way u speak with convection", "bhumikashrees": "@zuni2542 what are you saying u bloodyfool Nepalis always free for nonsense plzz shut your mouth u bitch", "chauhan.lalit101": "Awesome priya jii", "zunsar": "So he mustnt sing in loadspeaker also.sing in his own heart whoever want to hear will hear by himself #freedomofspeach", "__hemapuri__": "Mere muh lgne ki aaukat bhi nahi h teri choti soch wali aaurat @zuni2542", "bushrakhalidkhn": "Ataa to bhut kuch hai aur ye sb tm krte ho na ke hum smjhe na... M tjhe jaiso k muh Lagti nhi hu smjhe to bakwas band krde Apne ... @_hemapuri_", "zainsha80": "Stop burNing holika and crackers it is causing air pollution.. nd I suppose air pollution is a bigger concern than sound", "ali_baba1206": "so you considered yourself an ultimate intellectual, Great. #new business", "theabdullahqureshi_": "@momna_qureshi am agree what you said. But did you really watched the whole news of her? Please watch it again. She's just saying why you people always pull down to Muslims like you can see beef bann and in lot many things they do let down. So she's just saying in support of both hindus and Muslims.", "sunitashrees": "@zuni2542 shut up ur mouth how can u say Nepalese people are nonsense u don't have any right to speak to ur Nepalese people to say nonsense u bitch", "talal_mans00r": "@bhumikashrees @__hemapuri__ haram ki poori ....... You shit girls shut your mouths u rascals Indians and u both girl don't remind us that you people r from poor country @zuni2542 koi zrorat nahi in munafikoon k muun lagnay ki"}