{"itsmbitxch": "@dutta_rituparna95 well thanks for respecting my thoughts. And if you disagree with mine and @priyasometimes thoughts, get off her page and comment section. Promote what you love, don't bash what you disagree with.", "dutta_rituparna95": "@priyasometimes do one thing post an absolute nude photograph of yours without any part covering.. and i bet u your campaign will hype..if u really strong enough to do this😏..your an absolute dumbass..your better in commercialization.. social work is not ur part 😂😂😂😂😂😂", "raviteja_krt49": "I dont understand the point behind this @priyasometime. Why do Attention Seekers do it in the name of #genderequality. For women there private body parts that need to be covered, its your wish free it or frame it. U cannot blame society for not accepting it, becoz its ur wish to wear what ever u want and its their wish to have perspective.", "imhemantraj14": "Male nipple ho chalege but women v apna nipple dikhna chatei hai to bra kissliye hai mam", "balochsaab0": "Show your nipple @priyasometimes", "kanishkbhatia14": "@neha_ckhan lol", "o_b_l_i_v_i_a": "Self objectifying dumb pound of feminist meat", "itsmitika": "@priyasometimes I am a woman and I don't want this bullshit right... Were u left with nipple show concern only... This shows more than social welfare ... U are more interested in ur own TRP welfare and of course topic like free the nipple can do wonders for u... Play lady play", "_kaafi.ajeeb": "@peehu_goel_ bhai isko nipple se bada pyaar h :/ 😂", "_dassunita_": "Bhai bhai 😂😂😂😂😂 @aishwaryaraj14", "time_traveler__": "@thesmokeyaffair well you seem to be self appointed lawyer for @priyasometimes so that now you have taken up the responsibilty to answer on her part.. lets get straight? .. so you are saying that issue like terrorism and global warming should be left alone cause what can we do about them by just discussing about.. wait.. what? Do you even hear yourself when you talk?? Do you know 9 0 innocents got killed other day in afghanistan due to terror attack.. climate change is happening and having said that you might even know that USA has pulled itself out of paris climate accords which is gonna majorly impact the very planet we live in.. this.. this should be our concern.. dont you think? If you are standing up for something atleast make its a legitimate issue.. stop going gaga over petty issue. You want to go topless on social media.. go ahead.. do it.. your call.. and ya.. i do discuss issues like terrorism, poverty and climate change upon my social gathering.. what do you discuss.. nipple show on social media?? 😒", "troublemaker_aniket": "Cool", "miss_sam_hollywood": "@thesmokeyaffair Like I'm not saying girls have to shy where else boy can do whatever they want. It's kind of natural to feel shy. I myself would feel shy and wouldn't support other women to do it tho it's their personal matter but still it's an odd campaign.", "nextlevelmodel": "@priyasometime It’s actually legal for women to be topless in many states. But do we see lots of topless women in public? No. I’ve lived in NYC (where it’s legal) for years and I’ve never seen a topless woman on the streets. Why? While some might not wish to put up with the catcalls, I think the actual reason is that women know deep down that their breasts have unique value. No, they’re not all looking to monetize that value, but almost all of them are looking to experience it on their own terms and to share their naked body with the people they choose to.", "prashastishah11": "@time_traveler__ What can we do about people dying? Natural calamities are going to take place, places are going to be bombed because of criminal mindsets (which I do not support of too, but I'm just stating something logical: that what can we do about it?) Global Warming is a very important topic too but it can only happen when people come together and do something about it... Just making a comment that global warming is a leading problem isn't gonna do anything about that issue! I have taken certain steps to prevent global warming, which means I'm pretty concerned about it too, but again, comparing this to a RIGHT a person is supposed to have makes your argument completely irrelevant! She is making use of the advantage that she is a celebrity and is trying to influence as many people as she can to let a woman be what she wants to and you're the kind of people that are creating problems! Plus, when you're in a family gathering do you talk about global warming? Or have you not seen enough situations where the girl is being judged about something she is wearing? She is definitely concerned about those topics too but is at least doing something about one problem... Not like you commenting and ruining the cause! @priyasometimes", "muhammad_0mer": "No offense against you........Who said only women has to be covered in that clothing......Islam says that men also has to be covered from abdomen to knees and women from head to toe its a muslim law.....and the law is not implemented now.....it was almost implemented 1400 years ago by the prophet(PBUH) in 632AD @thesmokeyaffair", "ayee_shivani": "@s_h_e_r_y_y well said", "masha_page": "Mtlb", "dk_blu56": "@dskinsta08 dekh bhai, chutiyape ki hadh 😂😂", "dskinsta08": "@soldier_foreva usko krne de dikhane de😂😂", "kbgram_": "First start with you 😂", "rinuantony999": "These guys are so insecure. Get a life guys! Priyasometimes, atta girl. Always be the way you are.", "roshanpattnaik": "Show ur nipple..bitch", "thechaku": "People like you become rapists who are being disrespectful to her and asking her to show her assets. People like you are who can't control their lust and think they're being \"manly\"! Shame!", "takameshikoro": "@apoorvapushp this comment should be framed...and also UNESCO declared this comment the best comment in the world", "bhaskar.borah84": "@priyasometimes Free the nipple...", "apoorvapushp": "@muhammad_0mer Cry me a river build a bridge and get the fuck over it. Your Statistics alone can kill a mathematician faster than they can say Pythagoras.", "s_h_e_r_y_y": "Go join africans in jungle u will live happily", "ritvik_choudhary": "I am unfollowing you... Just because of your thinking...i have many things to ask you but if I do so then every feminist will come after me... So it's better to be quite and unfollow... Thnks for your precious posts 👏👏", "aman_speaks": "Priya , u don't need to care of anyone's opinion....u are taking stand for a ryt cause and these typical males are scared of losing their superiority in the society .....but truth i§ truth ........little bitter tooo.....", "askari_abbas": "Wanna compare with urs plz", "t.u.h.e.e.4_u": "😂😂😂", "risharashid": "😹😂", "miss_uttarakhand": "Go for it priya", "m_too_much_masoom": "@muzammilahmed1 whts this brother 😂😂", "nikhat_shaikh61092": "Chapri aurat!!! Dumb bitch"}