{"almasanwar10": "Thank God you said it 💕", "sahniaastha": "Yessss", "ankitesh_11": "Before talking abt peace plz see last 25 year of Kashmir...thr people are seeing war situation from last 2 decade...no one wants war but peace talk is also not solution...peace shd be come up with conditions!", "_therahi": "I don't want war but jawaab dena toh banta hai na.. Koi aapko bar bar maarega toh aapko bhi ek dafa puri jor se maarna toh chahiye na. Hai ki nahi aap hi bolo @priyasometimes", "kakkar_karan_": "Its easy to sit in a room with 4 boundaries and blabber shit.Have strength to go to border for once and see your friends, colleague getting killed. Then we will talk about peace.🙏", "eme2ul": "Yes War is not the solution so as Peace specially when Pakistan is involved", "maham._.ranaa": "Well said 👏🏻", "khakwaniaina": "Exactly war c Kia milyga? Aur Pakistan r India K log lrae fasad nae chahty, wo pulwama m hua wo b pakistanio ny nae kia h tbi Pm Imran khan bar bar keh rhy hain ap log ao r investigation krlo we are with u, but hatred pehlany c kia hoga? We all are humans aur jan sbko pyari h 😊 spread love and peace, jo smjhdar log hn wo janty hain K asal bat Kia hai, mny ABP news sunni hn itna fake bta rhy hain trust me bht fake content bta rhy jo nae hua wo bta rhy, esi liye war nae pyar c hal kryn , bat cheet kr k", "kt2308": "@patelashik9", "beinghumansensitive": "True", "iqrar_ali_syed": "@priyasometimes i think you tweet on 20 Feb that you wanted Lahore !!", "endleeb._": "Anyone ask Kashmirs what do they want", "jadensbraganca": "Exactly", "shubhitr": "No one wishes for war. But a Roman general once said- If you want peace, be prepared for war! No one preached for peace to Pakistan when they attacked our soldiers! Also, if we just killed terrorists, why on earth did they feel bad?", "chefshamsher": "I have mad respect for you since day one and this is why.", "sapnaagarwal1379": "If war is not the solution than our history would not had been full of battles fought by our people to get independence we have still been the slaves of britishers, the war is not against a country it is against terrorism and whoever is with terrorism would not be spare.It is easy to say that we want peace as we are not the one who has lost a son,a father,a husband in the attack.", "mayankind": "Easy for pseudo intellectuals like you to preach cz you are not the one suffering.", "js_shailesh": "💚", "she_wani_gurjar26": "Yah pray for peace then they will kill our soldiers n again pray for peace n its gonna continue ... Indians r not fool our soldier have family, wife kids what for them they want peace with revenge from those pigs", "anaeablue16": "I totally agree with you. Its easy to want war when its not you or your loved ones who are fighting", "nitssing_h": "Fuck off.. you know our wing commander is in custody of pakistan how the hell you can say for peace now.", "knowget": "❤", "shoaib._.akhtar": "Start a war was in hand of people but the end of war is not in hands of people such an example of world war 2 so between the atomic countries no one can win the war for humanity please stop the war.", "javeria23": "finally from indian side someone talked maturely and is not is favour of war.salute and respect for you💯", "vyom44": "You are right Dola massi. We want dukayan massi back😭😭😭😭😭😭😭😭😭💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛💛💛🍀💛🍀💛💛💛🍀💛💛💛💛🍀💛💛🍀💛🍀💛🍀💛🍀💛💛💛💛💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛💛💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀🍀🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀💛🍀🍀💛🍀💛💛💛🍀💛💛🍀🍀🍀💛🍀💛💛🍀💛🍀💛💛🍀🍀🍀💛🍀🍀🍀💛💛🍀🍀🍀🍀😇😇😍😇🍀😇😇😇💛💛💛🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀🍀", "neha.k.love": "Pray for peace when militants amd terrorist kill your peaceful convoy", "sapanayadav": "True😮", "shourya1909": "Peace always prevails where is the chance of war", "shahbaaz_siddiqui": "Exactly priya v also dont want that the media for fake trp showinh all that and election aty he modi sarkar ny start krdia sb", "parteek91": "War is only solution in this case", "nishu_badhannn": "Ryt", "shaila.khan1": "I don't know why the hell is everybody so excited about war?", "kh6507": "Peace 😍", "singhlovely24": "What if our soldiers will think in the same way madam @priyasometimes thinking . ( I think they will come back nd sit at their home cos we are praying)", "dr_rabi_shabir": "Yes we want peace", "meghana_lakhyani": "No one wishes for war, everyone wishes for peace and to achieve peace, a lesson is a must for those who spread terror. For people who take it as a war, it has always been India vs Terrorism & people who nurture it. Niceness should never be taken as a weakness.", "_anshy.r_": "❤️", "aabbheelov": "Ye jung humne shuru nahi kibthi aur khatam hum karenge", "nasar_sandhu": "I love this tweet....hopefully some more Indian celeb think that way....🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰 Allah bless both counties peace peace and peace", "biba_khilji": "first Indian not for provoking war", "14nishamehra": "Well said 🙏", "jyoti.himachali": "Very true..", "kiranrawatdhanai": "Well said 😪", "sakinashoyeb": "✌️❤️", "sapphire0043": "One and Only peaceful message from India. Finally", "rehansaira": "True", "more_meghna": "Yeah... Modi can do anything for save their chair... Peace and human lives less matter to him... @priyasometimes 🙄🙄🙄🙄🙄...", "makeupbysakeena": "Truee ✌️❤️", "piansh_world": "❤️💕💖", "r.wajahat": "Pakistan is a peaceful nation, but if someone cross line, we will not think of retaliate, but we will retaliate, we dont want war. All that indian media is pitting false claim, encouraging their nation to get in dark, which is matter of concern for them, bcuz other than war n pakistan, dont knw how many issues that media has not put lights on.", "boom_shankra": "Indian army also want peace but for some peace some people should be eliminated don't u think so", "mohammed_ilyasahmed": "ma sha allah . soo true", "kandipedhaa": "Ours is a world of nuclear giants and ethical infants. We know more about war than we know about peace, more about killing than we know about living. - Gen. Omar Bradley", "aakasharje": "Now peace later! It's time now we are not weak, we will give ilegal action towards it.", "bebadass.in": "Much needed indeed 🙌🏼", "komal_joanna": "Sensible woman. The only comment regarding peace from India. Stay blessed..", "aparnashandle": "True that! Amen 🙌", "irfan_badhan": "Let fathers bury their sons @priyasometimes", "princesssonu2911": "👏🏻👏🏻👏🏻", "shailjatripathii": "🙌", "wajiha.kamal": "God. I am glad someone wise is still there in bollywood. Peace ♥️", "soniamohanvinay": "Well said..True that..", "mir_hadiya": "Finally someone said it ... Peace ❤️", "ommchaturvedi": "💕", "mariam.rao2": "Thank god ...some is wise", "mohammed.mazhar.official": "🙏🙏🙏👑", "being_asra": "Finally a sensible cmnt"}