{"beingmuneebkhan": "Priya you're turning into quite a voice....", "baba__official": "Because we are sold", "awara.photographer": "Gladly! You spoke about it. I second you. Well said🙏", "hey_rahul28": "Hey u @priyasometimes listen...u can't judge a movie by just a trailer. Don't act like you r a great actor. Just get out of celebrity life and get the insights of the Indian economy", "smritimaan": "True...", "ishfaq1266": "So true", "rupinderkw_": "👏🏽👏🏽👏🏽👏🏽", "miss_tree0107": "Agreed to a tee.", "manu.jha2004": "Bang on!! Absolutely fantabulous. You spoke the heart out!!", "shiresh__": "Well said 👏👍", "loria_dhosi": "On Point!", "sanskriitti": "just that one identity as an actor is insufficient....", "unerase_shayari": "Maam many such movie were also realised before gujrat election but the fact was that these movies were flop !", "shahbaaz_siddiqui": "Right whts hapening is kashmir every body and see and with minorities", "jaibhati1": "👍🏻👍🏻👍🏻 @priyasometimes", "junahahahad": "Great to see that you can see what others cant see @priyasometimes", "ayaz_rebel_ansarii": "So true Priya ji👌👌👌", "tejaswisharma19": "Well said @priyasometimes ❤️💙💙❤️", "ankushabraham": "On point", "imshayanahmedkhan": "All power to you @priyasometimes 🌹", "kalita.sandhya24": "Well said👍", "scene_tillating": "Do you see India's loss against Bangladesh in Dhoni's biopic? Or do you read about why \"The Great\" Nehru killed our Netaji in history textbooks? #foolish #idiotic #oversmart", "rajat_peri": "i m not on anyside ... but girl's got a point!!!", "tasr.a": "This is amazing!!!!", "arshusush": "The roads in our country are still bad, our country is still poor and dirty, no focus on improving tourist and women safety, no focus on educating the masses. Taxes in India are among the highest in Asia, yet that money isn’t invested in the infrastructure. 82% of Indians don’t hv access to Internet, 25% Indians hv no access to electricity n 65% Indians don’t hv access to proper sanitation. These figures are given by World Economic Forum. Demonetising did is no good, the only thing that we saw in the last four years was our country becoming more sensitive and divided in terms of faiths and religions and beliefs! Thanks for speaking up! @priyasometimes", "pranavkapadiabond": "Good speech ..", "_sandhu_mandeep": "Agreed", "richapandey_11": "Just cz u r famous cz of Bigboss doesn't mean you will represents yourself as a gyani or great economist and impose your beliefs on others with the help of paid Media n social media.", "sawan_ghurbhurrun": "Well said @priyasometimes", "itsarbaz4u": "@priyasometimes good Job 👌👍👏", "ruuxhhh": "You tore him a college debt sized asshole.", "a.tale.teller": "Exactly what I feel. Where can I watch the entire video?", "prince_of_zilch": "True words.", "little_molecule": "@priyasometimes It started with Talwars, then The Accidental Prime Minister and now the biopic on PM Modi. I also don't appreciate the idea of dramatizing the surgical strike which they showed in URI. It's sheer politics, to influence the public right before elections.", "_d_h_i_r_e_n_": "Uski maa ka bharosa chaahe koi bhi picture banao aakhir mai jitegi to bjp 💪", "_amit_dahiya": "I reckon 👍", "nishantkar_aditi": "@priyasometimes more power to you lady.", "_nelus": "So true. I am glad that you are speaking what is reality. And being our voice.👏👏", "arv_girn": "🙌Well said @priyasometimes", "saloni._.shrivastava": "100% agree with you....🤙🏻🤙🏻", "parthvi.patel": "It is a story of a man and his journey till the parliament. It doesn’t show anything beyond that, and all the things you mentioned have taken place in the last 2 years so there shouldn’t be any debate on this. It’s a journey of a Chaiwala who dreamt of serving this nation. Period. Gosh.", "akhil089": "True🙏", "humanistnature5": "Just wow👍👍👍👏👏👏👏", "rishamjewelry": "You make a very relevant point at the end..it's the timing. Well said!", "nazar_timesss": "your so brave and i love it god bless u @priyasometimes mam😍😍😍😍😍", "official_loyd_pereira": "Ahem!!! Well said #sherni 👏👏", "samarthnsurve": "Another JNU student", "door2hell": "Strongly agree ...with you @priyasometimes", "subhajit.dhar.7967": "❤️", "_simmmyyyyy_": "Agree 💯", "s_inzamam": "Well said and perfect opinion.... @priyasometimes .. @nadiem_shaikh", "shyamsbhati": "With all due respect @priyasometimes militants rate is been decreased after BJP come in power .. our army had taken serious action against all the militants.. bcoz our government gave them permission to do so.. #action should have been taken long time ago but congress never took it seriously.. Then why we are not talking about the things like surgical strike air strike ... Space power.. Global relationship improvements.. this all things happened bcoz of @narendramodi 🤝 when congress was in power .. no other country was with india other the russia bcoz we have alliance with russia from world war.. The thing is we always see small things not being corrected.", "gdileepjain": "U r a box of question?? U just saw the trailer.. watch the movie u will get the ur all answer.... u people can see only one side of coin... other side u never try to see....", "singh.shikhaaa": "Well said lady❤🙌"}