{"hulk204": "@priyasometimes like", "spattnake_": "@aamiraltaf I couldn't agree more. But there's no point a woman should be abandoning clothes she wants to wear just because it may provoke something unusual. That is the thing men should be controlling their desires (if any) and use their muscle power elsewhere!!", "jass__khatri": "@priyasometimes right mam", "licensed_liar": "👍", "hansuman_21": "@the_dubstep_lover hahaha @priyasometimes is just doing publicity stunts as after bigg boss she wants to be get seen and noticed....thats y this insta handle was created.....i mean wtf is free the nipples?!", "msrulh": "Such an inspiration Priya, really - sending love and light from New Orleans @priyasometimes 🐯✊🏾", "michnomer": "@ssoni0202 oh yeah but you still show it don't you? No one's gonna stop you from whipping out your penis and peeing on the road.", "sl_s0ni": "We have penis and testis, we give you sperm n u become pregnant, doesnt mean show it.", "ruhani.nomani": "All this is cute but mareezo ko ilaaj kaun dega? Baccho ko kitaab kaun dega? ghareeb ko anaaj kaun dega ?", "kakkar_karan_": "Some one needs attention but is failing miserably!", "basumataryrajesh": "Love your stand.", "you.serr": "@Gulafsa.r", "follow_money12": "@ruhani.nomani 😂😂😂", "chhabrakamal": "@priyasometimes no one can change other", "muskaan_1208": "I respect you a lot Priya.....I appreciate your guts....You're one of the strongest feminine character that I know 💜💜💜💜❤❤❤❤❤❤❤❤😘😘😘😘😘😘😘", "sandra_arcos83": "@priyasometimes we stand with you!!!! #freethenipple 💪🏼❤️", "gopal_butte": "Nice info", "deletednonononono": "#FreeTheNipple", "truthbombslove": "They. Are. Also. A. Sex. Organ. You. Harm. People. With. Lies.", "sharaz12541": "👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙👙", "bunch_of_loves": "🖤", "zeeshanzink": "I'm just here to read comments. 😂😂 @ahsanshaikh870", "soulwithsarcasm": "@the_dubstep_lover Girls also lick their boy's nipples, if it makes them a sex organ. If feeding makes it sex organ or private part, why our mothers' nipples never make us hard?? And it's a sex organ not an.. And if you are talking about laws, then some intelligently foolish people can't decide what is good or bad. I mean come on.. It's our bodies until and unless it's about penis and vagina.. ✌✌", "sagarvishnoi_": "Appreciate.", "avinspire": "Immodest is society's thinking not parts of the women's body", "notoriousdivy": "stimulation of the nipple activated an area of the brain known as the genital sensory cortex. This is the same brain region activated by stimulation of the clitoris, vagina, and cervix. What this means is that women’s brains seem to process nipple and genital stimulation in the same way.", "gautam1895": "@priyasometimes if u r so keen to free ur nipple then show ur nipple only to explain the thing. Why r u using other pic to explain . It's ur choice whether u want to show or hide ur nipple.", "dk_blu56": "Woah. Taking women's equality to a whole new level.", "aachluv": "Very well said @priyasometimes 🙌🏻🙌🏻🙌🏻respect for all ur thoughts and guts", "rollcameraupload": "Hahahahaha! On point. #FreeTheNipple", "punkajchaudhary": "Lol #freethenipple 😂😂 this is insane women can't go to market with nipples this is insane this is the difference between Animals And Social Animals", "___poojaa___": "@thisisthe9thtime", "kmals18": "I genuinely respect what you're trying to do @priyasometimes ,but there's something's society has laid a foundation to from the very beginning,something's like this exist which have no reason to,but you just gotta live w it because that's how society is.Freeing the nipple may bring equality but the repercussions could be much worse,because we know how tough it is for a country like us to,forget the world,to change our culture,I genuinely respect what you're doing but there's some things that happen for no reason and can't be changed,and this is one of them.", "soindianithurts": "Hello Priya, Is it okay if I call you with your first name? Please let me know. This post is not meant to critique you or correct you. I was just overwhelmed to see the kind of shit and hate that is being posted here by a few men who call themselves the 'Meninist', yes you Mr. Meninist (who loves dubstep btw). It really cracked me up. We all understand that you are definitely only trying to make a point here and not really enticing women to walk the streets sans clothing. But to see that these guys are going out of the way to google how a female breast is different from a male one just shows how much they would do to just prove a Woman wrong. And at this point I would like to add that whatever you are doing is just really fantastic!! Ten pats on your back💁🏻 Ps. You have more balls than all these men posting hate on you combined! You go Girl🙏🏻", "iam_huma12": "@saumyarathoud agree with you", "_prasoon_": "@gypsyishypsy dear Adv. You're check mate. Read again lines 2-5", "jollysinght": "Sorry barging in .. But like they say in punjabi kalan Saale kalan hee rehnge .. Cheers 😂", "aamiraltaf": "I think the debate on #freethenipple should be less about the nipple itself and more about how human brain perceives the construct of sexuality. In some remote parts of the world men and women don't cover upper bodies, hence their brains are not attuned to perceiving nipples as sexual objects but merely a body part. In other parts of the world such as Indian sub-continent where I grew up, women wear loose trousers called shalwar. Seeing a woman wear leggings or a skirt would generate peak sexual activity in brain for someone not used to it. Revealing a certain body part is relative to how the brain of audience is trained to interpret and receive sexual signals. It would be intelligent to choose the attire in accordance to the signal one wants to send for the audience around. A free nipple wouldn't send a sexual signal in an Amazonian colony, bare legs wouldn't send a signal in most western cultures, collar bone wouldn't send a signal in Mumbai and Lahore, while the sight of a bare ankle or nicely styled hair in Kabul may provoke unintended emotions. (Just a personal opinion :)", "saraharif222": "Wtf is wrong with you @priyasometimes", "prince_of_zilch": "Speechless on your wit @priyasometimes .... Totally on your side", "_deepanshu____": "Fool's overconfidence , aah , yes i am talking about you @priyasometimes ! 😂 hahahha what an overconfident idiot , such afailure though!", "docravi25": "@priyasometimes my thinking on above discussion is we can make people literate but we can't make them educated....in India in present scenario... how many did understand the anatomy of breast ... but thing which lacks is manners ,thought process...but happy atleast u took a stand and courage to speak over this...!!keep it up👍🏻👍🏻", "rafiishah": "@priyasometimes At first all the females should think for a moment .... do we need equality or justice??? I ask why \"feminism\" concept has to be raised everytime ... I m a Muslim girl and Alhamdulillah Islam has given all the rights and justice to women ... equality not really important how much justice is....", "ankur1210": "Interesting.. I appreciate the way you've render this message to the society @priyasometimes", "zunnaira1": "Go go go @priyasometimes !!!!😊🙏", "vintagesoul_ritik": "Sensitive.. #Keepitfree", "subh_choudhary": "Arre ye kya h itni saari @smudging_kajol 🤔🤔🤔", "md.umair.583": "Balls ke bine bacche nahi ate .. breast feeding is secondary", "iamprateekk": "@priyasometimes", "rana49usman": "Strongly agree with ur point of view @priyasometimes . But there are alot of things in this world which are illogical but we have to accept that. E.g animals dnt wear colthes but when they do they become human .sluts dnt wear clothes but when they do they become ladies.. u might be right in ur point of view but GOD wanted to set differences between men nd women. The sacredness linked to the feminism demands her to hide her nipples..", "mad_sam_101": "Anyone think that @priyasometimes is taking a huge step for equality and should get full support from us.", "sheetal__143": "Something is getting bold just stop talking shit abt anything about sex r sexual.......just go wid her she is dng all well @priyasometimes", "areezlokhandwala": "More power n respect to you. You are the best. Keep it up.", "show_runner_001": "Priya u r right but u dont need to tell in public otherwise they will start thier foolishness on you only.", "dhruvsuri88": "@priyasometimes u r right I'm a bio student in 12th standard studying about mammary glands only and lacteferous duct helps in feeding", "bluepine_ankit": "@priyasometimes lets talk about piercing.... Which is the most appealing about you ❤️😘", "saumyarathoud": "I wonder how talking about vagina or breasts can make a women equivalent to men. As far as i know you talk about women equality so what was the purpose of this pots? #Curious to know #NoOffence #justasking", "rizabhandari": "Yo aaimai k boulauxa @smudging_kajol", "bhiv.u": "@the_dubstep_lover truce👌🏽", "shreyaawachat": "Hats off u girlllll.....u really have guts....u really speak...wat we couldnt speak....really love your attitude priya....u r an inspiration asa well as voice for all those girls who cannot express themselves...kudos priya....lots of respect", "architsabharwal": "@priyasometimes I'm assuming you have pair of them Priya,hats of to you Priya you are idol for all....Your boldness your attitude👌🏻love you beautiful women❤️", "thrivehigherdaily": "@priyasometimes omg!!!! Ballsy girl indeed! You have a pair of strong \"sex organs\" 😝😝😝 ✌🏼♥️ this!!", "chauhan3c": "Nothing world without women👍🌿", "old_id___": "Hii priya", "_rohit_raghuwanshi_": "@priyasometimes Glad to see This😍👌Atleast,Uh Raised this Issue😙Salute,uh❤Hats Off😘.....I m with uh Dear..Thanq 😘💯@priyasometimes", "smudging_kajol": "@rizabhandari56 k.bujhus yo desini le😄", "iam_b27": "Biology classes kab shuru kar di inhone.Ab toh Hadh hi par kardiya isne😂😂😂", "its_gurdarshans": "So what was the purpose of this post?", "priyasometimes\nVerified": "Verified", "tantanatantantara": "@priyasometimes I adore you !", "gaurav.gupta.1993": "@priyasometimes perfet reply to that shit guy. Bulao koi Rishabh ko yr.", "mohit_avichal": "@priyasometimes 😂😂😂", "sunnyramwani": "Respect 🙏😌", "vaibhavlabs": "@priyasometimes Just publicity stunt things. 😝😝😝", "alishzart": "👌🏻", "anshul.mic": "Very right but there must some science behind the attraction also... Why every man is attracted toward the first feed of life...", "thatsassylady": "Ma'am I admire you and your thoughts #respect", "bhaskar.borah84": "@priyasometimes Free your nipple", "gaajoo": "Very well written! PM 😚", "er.g_deva": "...@priyasometimes", "thesinghking": "Great may this will help some shrewd minded people have some brains @priyasometimes"}