{"dominiquemarini": "Well what do you call commenting like 10 times????? @roman._.zolanski", "prettrih": "@hatepriya", "stydia_worshipping": "@hate_pryia", "s_l_smith1604": "@omgpriyamalik I liked you in the house but honestly all I see you you responding to haters thought you were way more of a mature women that that or so you say I just don't understand posts like this?", "chris97_kk": "@hatepriya wow all that effort to make an acc to specifically hate on one person. Your insecurities are on the horizon dude", "audreydevito": "lmaoo @_meglewis @dominiquemarini", "lazygirl3664": "Why do people have to hate,love and be happy", "cassandradimech": "❤️", "issyfezzy": "@twerkin_bakin_lozfez", "gracedbalzan": "@omgpriyamalik well said beautiful girl xx", "fergusmcwhirter": "@angus_mcwhirter", "norahna": "Wow! To make a hate page to someone (especially for someone as inspiring as Priya) is a new low. I feel sorry for people who have such a strong hatred embedded in their hearts. Fuck the haterzzz!! #teampriya #teampriyaandskye #muchlovetopriya #canadianfanwithmuchloveforbbau 🌟❤️😇🙏", "whatfeelings": "Oh my hahahahahahahahahaha", "ciraolivier": "@taylaolivier", "mc032": "@omgpriyamalik I just started following you yesterday & I'm glad you posted this pic. My goodness people are disgusting when they are clearly jealous. Keep your head up high & keep stinking it to them 👊👏", "tenniel_tarabene": "How mean. You don't deserve this. You should've won bbau 👊😘", "offical_janoskians": "Just leave her alone, no need to pick out everything someone says okay? @aqelaaa1", "thelifeoftanyaa": "She's just so jobless I reckon, I couldn't be arsed spreading hate. One love is what I believe in @aqelaaa1", "charliepleiter": "@hatepriya just why", "amyz11": "@shaym_is_amazing", "megllewis": "@audreydevito @dominiquemarini lol", "adelia.calvano": "@omgpriyamalik LOVE YOU PRIYA!!!!! Xx", "daynagilmore__": "Ily priya ♥️", "jasmineleigh________": "Lamo cut because she wasn't on bb @omgpriyamalik", "brydiefitzgerald": "Omg someone was actually so bored with their life they made a page called hatepriya. Wow talk about low lifes", "jennajohnstonex": "Baha someone actually has the time to make such a ridiculous account. Only person their making look bad is themselves", "shaym_is_amazing": "Such a rude account @amyz11", "taylarobertsonn": "You are the most natural beautiful woman I have ever seen! This person needs to go to specsavers! Love ya Priya xxx ❤", "_meesacassi": "I love you Priya, you are a legend 😂👌💜", "helloemmalouise_": "Grow up you idiot @shitpriya", "britt_pizzinni": "Haha @omgpriyamalik I actually can't believe some one actual has a 'hate Priya' account just shows they consume their life with you lmao #staypositive 😘", "paranoid_princess12": "Love ya ya ya", "anthonycirillo_": "@hatepriya Do you have a life ?", "old_account154678": "Jokessss", "__kirstylee__": "I find it funny that some people have such little in life to enjoy that they have to make hate pages for people they will never meet. Whatever @omgpriyamalik does in her life will not impact on you, @hatepriya so why are you putting so much effort into hating her? ✌️😘", "deleted351323": "She does give us attention. Just she has so many supporters its hard to notice everyone. @hatepriya", "ethan_mewett": "Love your sas!🙌", "nataliewaru": "I think they mean LOVE PRIYA😂👌💁💖💖💖💖", "ava.rickey": "We love you ! 💕", "ilovemycat2013": "Some people have too much time on their hands. #fuckthehaters", "llllllooooooll_": "Haha @hatepriya you suck ! Get a life .. // pussy 🙀👼👽", "luucyanne__": "You're the greatest person on the planet Priya 😂 I love you and your sense of humour/personality 😂💘", "allanapiscionerixo": "Priyaaaaa, your such an inspiration, i have legit looked up too you for so long. I'm soon to be in year 12 and I would absolutely love a teacher like you teaching. Not only students would look up too you, i believe teachers would aswell, I'm truely greatful to have come across and a person as incrediable as you in my lifetime. :)", "madi._.young": "Ur beautiful @omgpriyamalik", "samtrenwith": "@omgpriyamalik can we please be friends?", "tammysoldaccount123": "That is so childish gosh Priya is amazing😱😱😱💥🔫", "mmaltezer": "Haters don't hate you @omgpriyamalik, they hate themselves because you're a reflection of what they wish to be. #TeamPriya", "jade_brogden": "What dicks!", "lee_geach": "You are gorgeous. Just sayin x", "thecaramelgoddess": "Haters hate coz they are ..... JEALOUS!!", "xx_shaya_xx": "Thqts very rude", "deletedaccount____q": "@hatepriya don't know you but you know felt like tagging you 😂", "ramessenger": "Don't worry about it Priya, they're just a keyboard warrior! 💛", "stephaniesmary": "You're gorgeous babe! 😍", "cooper_.riley": "Lol", "aprilcranwell": "Forget the haters, I love you priya!", "hoe.jo": "@hatepriya babe, if you want Priya to kill herself all she has to do is climb up to your ego and jump down to your IQ. 😊❤️", "s.haeedwards": "Good on ya @omgpriyamalik", "priyasometimes\nVerified": "Verified", "ryleehannna": "No you FUCKING come on @ethan_cairns_ she is BEAUTIFUL! You are jut jealous", "brittwagstaff": "I bloody love you priya!", "grace_scanlon": "That's so rude", "jen93d_": "@hatepriya what's so wrong in your life you feel the need to cyber bully someone you've never met. I really feel sorry for you. Reported your account for bullying", "gemmaa.lee": "I love you!!! @omgpriyamalik", "jadedesiraa": "This is why I want u to be my friend", "_kristabassa_": "@hatepriya well if you hated her so much, why are you wasting so much of your time on a whole account for her? 😂😂", "houseofpaparazzi": "Babe ❤️", "chris.kehagias": "😂", "hunayxxlit": "Awkward moment when @omgpriyamalik is actually so beautiful! Someone just doesn't appreciate an a exotic beauty when they see one...love you priya bae!! <3 @hatepriya", "xaniquee_taylorr": "So rude of you @hatepriya you must be jealous of her putting in this much effort to put her down. Good try, but guess what? She doesn't care. @omgpriyamalik you have so many people who love you ❤️", "georgiaballingall": "You have a mob of fans so she was stupid for saying that. Your amazing priya and also very inspiring.", "pennykouremenos": "@omgpriyamalik don't worry your amazing💕", "hgbodell": "Hahahaha oh that is exellent. You've owned her with elegance and eloquence.", "jackeysmith": "Everyone go report them 👌", "ethancaiirns": "She alright looking okay but she ducking annoying @rylee_cameron08", "kelseynewlyn": "Just laugh at the negative people Priya, don't let it affect you 😊 @omgpriyamalik", "illgetmyjustdeserve": "People really need hobbies", "parismarieofficial": "GO PRIYA", "bigboypoppin_": "#ooohkillem 👏👏👏", "chadirl": "You are a queen! Come to NZ so we can hang plz @omgpriyamalik", "chloeshoobridge": "@hatepriya damn ugly mutt. you just got humiliated HAHAHAHAHAHA!!😂😂😂😂", "dixie_jean": "@tezza_mahal wait you don't like your own photos!!!🙊", "georgiagifford": "@hatepriya", "romyboicos": "BAHHAAH", "laurendefrancesco": "I LOVE YOU PRIYA 😂💖💖💖💖", "halle_young": "Good on you babe 😍💋 @omgpriyamalik", "gianfonzi": "#TRAVISMASSIV", "mia_thurlow": "Hahahagahah Priyas hilarious. Everyone else just looks dumb, wasting their time preaching crap ✖️", "ethanbate_": "That is mean", "tania.galiki": "Ur amazing forget da haters!!!", "capturedbysonia": "Bahahahaha", "ashi_emmett": "no it was what they posted @tezza_mahal", "jesslouiseexo": "Haters gonna hate, you're gorgeous Priya 💕 @omgpriyamalik", "georgiapearcee": "screw then haters! LOVE YOU PRIYA!", "mahrukhq_": "WTF AHAHAH THEYRE IDIOTS", "iivysmummy_x": "Your beautiful Priya 😙"}