{"courtenay.mc": "@lyndacarg I seriously can't believe what I was reading. Firstly, your comment is utter shit. You are telling her she shouldn't be a teacher because she has an accent and yet you have no idea how to speak English! Your comment is horrendous and I feel sorry for you that you feel that it is ok to be a racist scum bag. @omgpriyamalik speaks excellent English and she could probably teach you a thing or two. You are a prime example of what is wrong with the human race today! Priya and her husband are totally cute and I have a feeling that your comment will be laughed at and then forgotten about very quickly. Don't be such a dirt bag and get off the internet!", "catfanbb": "@lyndacarg you are nothing but a racist pig. Small minded troll, please learn some english before abusing others.", "laurenoconnelstan": "@lyndacarg i hate u little freak go away nobody likes you", "ramihay_": "@lyndacarg Wtf is wrong with you? This country is made of honorable Natives, not people as ignorant as you. Buy your own dictionary before you claim \"she can't speak clear English. \"", "olivedrummowenn": "Are you related to @zaynmalik", "shellz67": "Love you both @omgpriyamalik", "jorgiewalsh_": "@emilylimpus", "emily.lamac": "Hahahahaha lol @jorgiewalsh_", "kinga_rindlisbacher": "😉😉😉 @jaydenlambeth", "jaydenlambeth": "Hahaha 😉😘 @kinga_rindlisbacher", "team_skyan": "Follow for team Skyan #Skyan", "ikrvn": "@msgowdan 😏", "jessica.delany": "Love ur last name", "oddventure_time": "@maniksounds", "madi._.young": "Cuties", "ellie_maree_": "Awwww", "charli.lewtas34": "U are just jealous that u don't have love like Priya has!! @lyndacarg", "_imsuhail_": "Follow me to follow u back. @suhail_suzie", "rabiyadanish": "U two needs to get a life! Totally!", "ashanddaisysmummy": "You're awesome priya! Xxx", "kyleanimalsuxx": "Yeah @damiens91 he was rude to @omgpriyamalik. Correcting isn't even a form of insult or condescension.", "fernandsaad": "@alinebitar_", "torriekarens": "You were the best, kept it real and always were great entertainment don't worry about silly people! Love Ya guts! Xx @omgpriyamalik", "aline.bitar": "@fernandsaad ?", "afrazadafiq27": "i love you so much.. you're amazing I look to you.. keep strong priya.. Love from indonesia ❤️❤️", "bethany.sayers": "Priya ily💕💕", "__kaseydawn": "Opps not @dteachesesl sorry @damiens91", "melanierahaa": "UMMMMMM not sure if srs , couldn't understand one word !", "haybails95": "@lyndacarg Lel ya need to get checked mate", "gracedbalzan": "@lyndacarg maybe you should learn some English and spelling while your at it", "sebasjian_12vi": "Go fuck ur mum", "priyasometimes\nVerified": "Verified", "celinesamimi": "You are a legend @omgpriyamalik you played like a winner and you are a winner", "belindafragale": "Lol @omgpriyamalik love the spelling corrections!", "joshodon11": "Poor @sebasjian_yolo", "bri3.84": "@sebasjian_yolo I really dont think @omgpriyamalik gives a sh*t whether you liked her or not.... im pretty sure her life is not dependent on your immature internet trolling comment, nor do I think the negativity is going to change anything in ANYWAY... so rather than bitch about who you like, when really you are just showing you dont have any sort or life or intellectual capacity, maybe you should just unfollow her and follow someone you do like? Just kinda a suggestion since I Dont really want to see ur negative comments on my instagram feeds, nor will you opinion change anything. You are not superior and people WONT bow down to you for it. #justsaying #internettrolls #getalife", "magsdono": "my favorites", "dteachesesl": "@omgpriyamalik Your husband is amazing, and the love he has for you really shows! (I heard him on BBCP radio) cheers!", "theojamesfact": "ALL HAIL PRISUS! 🙏", "rileymaynee": "@marley_hansen", "aaronlhb": "I love it", "insta.me.see": "Why follow her @sebasjian_yolo ? Be nice or don't speak.", "nandipaul_": "Nice to no now keep ur mouth shut if you don't like some one keep it to ur self @sebasjian_yolo", "campbelltimu": "@sebasjian_yolo well can you look harder and find the log out button.", "jaaimehoward": "I love u 😘😘", "deletedacountthanks": "follow mee 💕💕💕", "kate_lwinn": "Love you", "sharad_m": "💕👍", "brenny_g": "@lalunaselene they're so amazing", "bekssecond": "BUSHYY", "charlotte_arm": "@bellalascaleia", "charleecrocker": "Oooo so hot priya", "chetcutes": "Cute Malik! Miss you x @omgpriyamalik", "es_lioness": "Love u bhushy and priya 😍", "jacbazz": "I would love to know what eyelashes you use? Your eyes are beautiful @omgpriyamalik", "missninjah94": "Every time you cried when u seen his face in bb house it made me cry @omgpriyamalik #happytears", "cassandradimech": "haha you guys are the cutest :)"}