{"abydos71": "I have to say I really admire you. I am disabled, and gay, and I deal with a lot of hate and discrimination. I wish I could handle it as well as you do. xoxo", "preetee13": "All I can say ..well said!!", "brendafarani": "@rasela_ 😂😂😂😂", "lola.55__": "That's was rude of you!", "ryletran.h": "😂😂😂😂#KeyboardWars 😂😂 i love these comebacks", "lizzyrandall_": "Love you Priya!! Happy new year ❤️", "pheebs.green": "Lel ^ @_locci_", "rauhlcoasterrr": "Wtf Zayn Malik's mom?? Um.. Weird", "_firozaaa": "@latiifaahmadii", "_latifaahmadi": "@_firozaaa HAHHAHAHAHAHAHAHHAHAH 😂 both responses are things you'd say", "sushitrashs": "holy shit read it all I'm actually crying 😂😂 @_ellafletcher_", "catherinemesina": "HAHAHA nah ded @bobbywalls_", "bobbywalls_": "HAHAHAH so good 😂😂😂 @catherinemesina", "chloe.della": "This is so mean @omgpriyamalik #disappointing", "miascanlon": "@nathalie.jade lololololol", "ziamariadiamond": "Hahaha wow I love you @omgpriyamalik ❤️", "celestechetty13": "Why are people so mean? I hate racism or any kind of degradation!", "emcharb": "@fergusbuncle", "moollyyork": "The last one!! 😂😂😂😂🙌🙌🙌 @ross.cara @emmamccgrath @reneehiickey @stephliaros @abbii.ross", "stephliaros": "BAHAHHAHHA @mmollyork", "emma.mcgrath": "Bahahahaha ily @mmollyork", "erica_lea_": "Good on you Priya, but I don't believe you 'honestly feel for them'", "quirkyrestorations4670": "This Melissa Rai is a nasty soul....but remember this ...they hate us cause they ain't us....☺", "mentor36": "Go Priya, you made bb so much fun this year. Bless you darling xo", "sseda.c": "Love you priya fav housemate ❤️❤️❤️❤️❤️❤️", "hrhjordyncriss": "literally want to go back to school just so you can be my english teacher 😂", "chelsea_price_": "Don't worry about Melissa Priya <3", "ashwebbb": "YES! Haha. @omgpriyamalik", "kyleshall": "OMG @omgpriyamalik that is just terrible! You should not have to put up with that! Thats so awful! Keep your chin up & remember that you have a lot of people that love you 💜", "nathe_carlos": "@primylicious LOOK AT PRIYA GO!! ❤️ #priyamalik", "beccaamidala": "Preach it girl. 👌", "miss_angelz": "What a stupid fool! Don't understand why these useless idiot try to act smart, thankfully you out show them hiw dumb this person truly is... #teampriya", "the.hayley.journals": "That is hilarious😂😂 Wonder if anybody will be dumb enough to send more hate mail. We love you @omgpriyamalik.", "listay1": "Screw the haters!", "antz113": "What an asshole. Loved your reply though. Haha", "shirenuloves": "I'm sorry that you have to deal with this ridiculous (and racist) crap, it is BS. I also understand wanting to stand up for yourself now and then, since everyone has their limits. But sharing this so that your fans could applaud you is a bit of a weird choice. Anyway, I hope these ignorant fools aren't bringing you down too much and you have a lovely evening on that side of the globe :3", "pipzilla": "Gold!", "gracedbalzan": "@haileluyah why shouldn't she stick up for herself how dare you make her feel even more like shit for doing so ! There's only so much a person can take before she bites back! No one should have to deal with that sort of hate ! I hope you never experience it I bet you wouldn't keep your mouth shut for long!", "kimpeel_": "Yas😂👌 @_caitlinmcfall_", "shellz67": "Good on you @omgpriyamalik. Can't stand these narrowminded morons who get on the internet and spew insults and racism. I'm glad you said something back", "deebkts": "Good on you Priya always hold your head up high as you are a leader and not a follower. Love your response made my evening 😘", "mahaaa.a_": "Bichari frustrated kahen ki! LOL Good going priya 👌", "lefty___meuronen": "Good on you Priya! I'm glad you stood up for your self and tell that girl off", "tarageorgeson1990": "👏👏👏 @omgpriyamalik", "nathellb_": "Good on you", "aryxxrxm": "queen priya slayyy 💯", "melissa___cerra": "That's disgusting that someone could type such horrible things to you! Well done @omgpriyamalik for putting this troll in her place. You were obviously loved otherwise you wouldn't have got so far in the comp xx let the haters hate it's a reflection of their own miserable lives xx", "robertospeziale": "Omg @llewywilk when bae stands up for herself 😍", "kookykay_78": "Your response is childish in some parts @omgpriyamalik", "ms_tna075": "you go girl! these people have no life...you're a gorgeous human..jealousy is a curse", "_love_n_sunshine_": "@omgpriyamalik People who write that sort of thing are doing it for attention, most likely because they have lacked attention as a child and through their life. By replying, you are rewarding negative behaviour. Think of it like dealing with children- If you give attention to the behaviour, it continues, if you ignore it, it eventually gets bored and goes away. I hate seeing hate against you btw, loved watching you on BB :)", "vanessaarusso": "Just for attention... Well done though! I don't get how anyone would say those things about you Pria.", "bbinstag": "Ugh omg you slay so hard it hurts❤️ sending love your way from the states", "jodunnjnr": "\"I hope your ovaries are listening\" love it!", "doochy": "Ahhaha. Shut down giiiiit her", "jasmine_lester": "You go girl 👊❤️❤️", "ryana.n": "I love you so much Priya💕", "mandy7eleven": "@omgpriyamalik good on you!! 😘", "llewywilk": "@robertspeziale my hero", "jemmahunter": "BAHAHA go Priya!!!!! Omg @tillymchughh", "nesss1982": "Good on you Priya!!! #saynotohaters #love #theyneedtogetalife", "dhyani_v": "it's okay, she was probably a fan of \"strategy Dave\" 😂", "teegzy12": "Omy gosh cant belive you have to put up with this shit. Its the 21st century pple need tah get a life. Come live in nz we dont tolerate that sort of shit over here ether. :)", "jaysonysman": "Ahahahaha fcking lol", "emersontbutt": "Priya this is disgusting of people! I'm sick of people constantly thinking they own other people and are better than everyone else! We are all born unique and no one should be shamed of themselves because of who they are. They can all \"fuck themselves\" 👊", "graceosborn.e": "OMF I LOVE HER @lowercaseequalsfriend", "kiajarbra": "You're playing right into their hands, this is what they want, a response. The more you reply, the more they will come for you. Rise above. They don't deserve your time or energy.", "kaitlynsalter_": "I love you serious", "elouise333": "@omgpriyamalik you're just as low for resounding with such hateful text.", "jess.oldham": "The people who write rude, nasty comments are gutless and mostly just looking for attention. Just ignore all of the c**p they write!", "krystalduncan_": "You go girl!", "tahneeee_": "Hate people like her... What do they get from speaking to others like this?! It's disgusting, she was obviously taught no manners or respect.", "guppymarsh": "Go girl! #hatersgonnahate", "butterflie_moonbeam_": "Gosh that's horrible stay strong Priya Xx", "iamhayleydoris": "😂😂 I love this.", "leigh_irwin": "People can be so cruel ... You tell em priya!", "raininqxo": "Tbh you were from the start 😏 ^", "lucirenae": "She is just a insecure person hiding behind a screen. Pathetic", "elained_hairstylist": "You gooo girl woooo", "rynnawntharoxx": "👊 On point @omgpriyamalik", "ozmarg": "You go Priya! I hate people who judge others when they don't even know them!!! RUDE!!", "hurricanemackenzie": "YAAAAAS @omgpriyamalik EXPOSE HA", "nudayac": "@patience_tee @mariapaul_x", "es_lioness": "Go Priya 🙊😚", "raeleeminuzzo": "Hahha ahhh", "nicole_lisa72": "awesome response keep it up haters will hate 👀😄😜", "erik.nieweler": "Your awesome!", "prtstyles1989": "@omgpriyamalik Haha your amazing! Never let anyone dull your sparkle", "danniicatchpole": "@omgpriyamalik always loved watching u und great and so entertaining so let those ppl bring u down u r so,strong that is so obvious ur husband and urself r adorable", "barbien1": "Love ya Priya and the way ur not afraid to speak your mind.", "katetyrrell1994": "Some people are so disgusting. Who would consider @omgpriyamalik to be anything but admirable ❤️", "carlouchkaaa": "\"I hope you're ovaries are listening\" - made my day! @omgpriyamalik", "shayoxo": "Hahahahahaha I love it!", "greenbambie": "This is BRILLIANT! ! WELL DONE @omgpriyamalik", "cassienicholls_": "FUCK YES PRIYA", "aliceolive.15": "Love you Priya so strong.", "shereemohr": "Damn, Priya can bite back hard. Haha. Awesome x", "maghan.blanch": "GO PRIYA", "chantellecastellan": "Stand up to bitches like them", "emmanuel.gk": "Aagah slay!", "hiba_khalifa": "@zainabdaiisy shes a boss ass bitch I love her", "natbenson": "Love I priya 😍😍😍😄😄😄", "pkathuria": "@omgpriyamalik well done! You are awesome.", "georgiaballingall": "slay!!!!!! Your my queen xx love u!❤️❤️", "mikaaxt": "YOU GO GIRL!", "krystalpowell_": "Hahahahaha 😂😂😂😂 @hanisimeanslove", "deleted1234780pow": "Haha", "deletedaccount____q": "😂✋👊 Haterrs are motivators 😘✋ ! Loveyou go girl ! @omgpriyamalik", "caitlinmackiee": "Go girl! So proud of you! @omgpriyamalik 😘😘😘😘 wish you luck for the future ❤️❤️❤️", "karissapukas\nVerified": "Verified", "ruby_tuesday2003": "People r so rude these days!!!!", "kateek84": "What a little bitch...", "paolinablancato": "Yes , you've gotta feel sorry for them , how sad it would be to be so unhappy in this life , no at peace person would need to vent so much negativity 😕 prayers they concentrate on fixing themselves and being happy with their own lives 🙌🙏✌️", "nat_merheb": "Love you Priya, but I must agree with @haileluyah - you didn't have to use some of the words you used, like you said they only want attention, just ignore them without stooping so low to that level", "rach_erdmannsky": "Good on u priya!!", "this_pixelated_life": "@haileluyah I agree. Although never a huge fan of Priya on BB, no one deserves the hate that is spewed on social media. But being a person in the public eye - let alone a school teacher - she shouldn't be giving the haters the satisfaction of showing them the attention they crave - by giving them hate right back....", "amyalexandrouu": "Priya which school do you teach at? I want you to be my teacher!", "tkeatingsv": "Like @frankiejgrande #bb16 says when someone throws shade..shine brighter..", "_emgrace97": "Go @omgpriyamalik 💖💖💖💖💖💖💖💖 #GIRLPOWER", "craigpriceok": "Owned!", "hannahellen94": "@omgpriyamalik dont worry Priya. You are a lovely strong women. Xx", "yammbrooks_jnks": "GO GIRL! Love you Priya, fuck the haters ❤️❤️", "emmaaamoore": "@lilyisreallycool queen Priya is slaying", "jeromeyromeyromeh": "@amycollns", "jessecleal": "SLAY @omgpriyamalik you are brilliant 💕 love you", "silentsera": "😂", "emma_med": "@emmacaiin SHITTTT GO PRIYA", "skyeee.m.w.y": "They are very very mean😡😡 please check Dm and reply xxx", "matt.petrucci": "@nat_babee ovaries 😂😂", "j.dennett": "😂😂❤️ love you priya xx follow please", "daniellekc6": "👏👏🎶", "rais14": "Melissa rai is so ignorant.", "pebbles39": "wow did to go to your head", "bec_3_2_1": "Haha you are amazing Priya. Wish I had someone like you as my teacher.", "haileluyah": "@omgpriyamalik I was a huge fan of yours but it's upsetting to see the way you responded to that silly person. Your a teacher and a role model you shouldn't be speaking like that to anyone let alone broadcasting it as if your proud :(", "x.clairvoyant": "What she doesn't realize is that she did not only mess with you @omgpriyamalik , she also messed with 34K people", "sandithii": "Woah slay her puny little wrinkles smelly ass", "rebeccarussso": "@chloejohns_", "emaleeallen": "Love you priya💜", "madiwaters": "@amy_walnut 😂😂 why can't Priya be our English teacher", "nataliapietkaa": "Legit need to find out where you teach so I can send my future children there. Wouldn't trust them in anyone else's hands!", "chels.young": "So you stoop to her level. What a fuckwit, you are.", "sar_cha3_": "This is so sad for so many reasons", "priyasometimes\nVerified": "Verified", "oddventure_time": "@maniksounds @samanthabonnie people these days....", "shanais_rs": "Love you PRIYA xxx", "sallzx__": "Go Priya!", "katie_caldwell12": "Go Priah!!", "miccypedia_": "HAHAHAHA I LOVE THIS @omgpriyamalik", "account_deleted_____1999": "@omgpriyamalik 👌👌", "stephaniesabe": "Queen Pryia!", "aurora.evans": "Amazing! And I'm sure you're teaching your students to stand up to bullies 😄", "laurenxxemily": "Good one Pryia!!!👌", "tablikethecat": "@jgordonblair", "aisha_travis_love": "GO PRIYA! @omgpriyamalik", "sarahhmichelleeeee": "YOU GO GAL!!!! 👏👏👏👏", "alysse_rt": "Don't listen to those fools @omgpriyamalik !", "lydiaak2": "xx stay strong", "emilyyygamble": "Good on you Priya! You're beautiful xx", "natalijagorgievska": "You go girl", "jackhuntley777": "Lol @omgpriyamalik nice", "imdeadswift": "😂😂"}