{"rogerboltin": "I soooo miss this show! I was so pissed when it got canceled", "jimclawson": "I’m one of the 14! Sure miss the series..", "prophetx15": "Loved the show... Still do (DVD box set)! I still say it's due for a movie or some form of resurrection.... I mean... so many unanswered questions...", "scottfien": "LOVE!!!!! Still call you Dubbiein my head, @nataliemoralesloves ... I hope that’s okay.", "cstro91": "I remember once upon a time when I watched this live on a television network.", "fishfishmoose": "Where I first found you! Been a fan ever since.", "infamous_hawkguy": "Still one of my favorite shows of all time. About time for a rewatch, Dubbie!", "maurinsky": "Such a great show, I watched every episode live and saved them on my DVR so I could re-watch. I recommend this show to EVERYONE, bought the DVDs and lent them out (but didn't get them back, so I'm going to have to buy them again).", "simonpratchett": "I still haven't completely given up hope for season 2!", "danoftomorrow": "ARTCRAWL!", "luly_marquez": "I loved this show!", "morenataliedavila": "I've literally been your biggest fan since I was 8 years old!!", "raybuz1026": "I miss this show 😭", "skipperjane": "Still one of my favorite shows!", "gordoncooper001": "Still one of the best things ever to happen to television.", "beattietrey": "Bought it on Amazon, so I could show it to the lady! Thank you for being a part of something I love so much!", "cullenster": "I discovered it a few years after it was broadcast. Joins a long list of shows under the heading \"how was this not a smash hit?\"", "lynleyalison": "I loved this show and everyone on it and I miss it to this day.", "thirdeyefoundation": "Trout!", "kneeltailor42": "Art Crawl!!!!", "teiscinn": "I love this show to pieces, and am wildly thankful to everybody who made it happen!!! And yes, I do recruit like mad for its fandom, even ten years later. For the world benefits a thousandfold with each new person introduced to this particular joyful delight.", "hoganshogun": "Loved loved this show!! So gutted that it was cancelled. I say #BringBackMiddleman", "phoenix322012": "Omg I used to love that show! It was really fun! Definitely should have stayed on for longer😊", "thewofmat": "😻", "fringeelement": "I can't believe it's been 10 years. I was taking to @okbjgm the other day, and for reals I can't imagine my life without him in it, and YES you were born to say his words. The indiegogo table read seems like just yesterday, and I miss all of you, and Reaser, Sarah W., Margaret, and Mary Pat times 1000 for scoring us a table at Giordano's just by being Mary Pat. That convention (hotel room carpets that looked like crime scene photos notwithstanding) was way too fun. Someday I really need to get off my ass and organise a Middlecon as an excuse to invade a hotel bar with everybody who watched and loved it (all 14 of us).", "seaswallownrg": "yes, i was one of the 14 people who watched THE MIDDLEMAN. i connected to it from day one because I felt like Wendy Watson. I am in a way. Working for a clandestine organization...That part of my life. Coming of age. What was I gonna do with my life? And I had such a huge crush on Noser. The series and show was such a breathe of fresh air in 2008 and still holds up today… ten years later. It’s unfortunate that many did not give this a chance.", "jakesmollett\nVerified": "Verified", "holmes_carter": "I love this show SO much! I was 12 when it came out, and I think it was the first show that I watched week to week. I watched every episode as it aired, except The Vampiric Puppet Lamentation, which I missed because my parents insisted on going out to a family dinner. I complained the entire time. It broke my heart when I found out it had been canceled. The Middleman was my first TV love, and I still watch it to this day. It always makes me so happy to see you in other things, but I'll always miss the first.", "erydanus": "I still have my DVDs of this precious precious show.", "greg_kruse": "My wife and I were among the 14! I am glad you were cast. You not only enhanced Middle Man, but you have shined in every role I have seen you in since then. I will keep watching as long as you keep acting Miss ‘not the Today show’s Natalie Morales”.", "bothering_birds": "I own the DVDs! I loved that show and need to dig them out for my kids... And to steal a DVD player.", "drgonzo32": "🤙🏽 miss this show so much.... little sister and I always watched every episode and was saddened it was cancelled for no reason why, should have lasted for 5-6 years... when I got the season for her she bugged out and loved it, my little sister was my dubbie cause she was cool like Wendy", "dangerousdac": "I've been ready and waiting for O2STK to spring back into action all this time.", "jtstokes": "I’m going to look for this", "meaganrenee930": "I loved this show so much and was heartbroken that the world didn’t get more of it! I think it’s time it made a comeback 💙❤️😁", "marcburkhardt": "One of my all time favorite programs!", "psychjillah": "It's a great show!!", "sdanver": "I loved this show so much! I’ve always been proud to be one of the people that watched it.", "djloehr": "I wish this were the other timeline celebrating the tenth season...", "lilcupcake331": "“I’m Mary the Enthusiastic” .... Art Crawl \\m/!!!!... so many good one liners!! I love this show still so much", "cckeev": "I remember when this first premiered! I loved it so much and was so bummed when it got cancelled. It made me a big fan of you (and of @msbritmorgan).", "the_yarg": "I love this show so much and still watch the season at least once a year. I met Brit at a horrorfind a chatted to her about it. One of my top 5 favorite shows of all time.", "crimsong19": "I can't believe it's been 10 years! I miss the show whenever I think of it, and I'm glad to be one of those 14+!", "lamarkukuk": "I was one of those 14 people! Fan for life!", "trexpants": "This is still one of my favorite shows of all time. I don’t think I can think of a show that feels more “me” than this one. The style, tone, and sense of humor all really resonated with me. This show captures the spirit of a comic book come to life better than any of the dozens of comic book adaptations that have come after it. It’s a special show and still very dear to my heart. I’ll have to unearth my DVDs and rewatch it soon. ART CRAWL! ✊🏽", "thornaciousb": "Yep, this is what's going to make me finally replace my busted-ass DVD player. Because now I definitely need to watch it again! ART CRAWL!!", "snuggirl": "Oh man, I loved that show. Such wry humor.", "zachaerydavis": "I miss that show it was funny", "vococohere": "I was NOT one of the 14, but I wish I was! I need to find where I can watch this.", "coconutlimeblog": "How was that 10 years ago?!??", "erikmcarson": "I loved this show.", "robbpartyof4": "Yay for being one of the 14 and still binge-watching the crap out of the dvd with the hubs!! 💗", "ghostkid77": "I missed this show❤", "rogue_runner_brad": "It was a fun goofy show! I liked it and you were awesome to watch", "mmatos8703": "@jakesmollett I always want to ask you to play a round of stump the band! Happy MM anniversary you guys!", "brianholidae": "Hey my boys and i watched it. That alone was 10 more people.", "donblake": "Middleman was my first composer gig in LA! Then I moved to the Binford Lofts and @nataliemoralesloves was my neighbor 😂. That show had it all.", "phawkjr": "Miss that show!", "passionately_curious83": "I loved this show! It was such fun!", "deliciousdemonhouse": "Never saw it when it aired. Heard about it a year after it was cancelled. Tracked down an episode and bought the complete series on DVD shortly after. Loved this show and am still jealous of every single person who got to see The Middleman panel you guys did a few years ago. Gone too soon but thank you for a truly original and fun series that was as quirky and funny as the comic if not more.", "tedjones9839": "New girl move ted", "jhmaloney": "One of my favorite shows of all time.", "camthomas143": "Being one of those 14 people changed my life, my humour, and my appreciation of television that people never see. I recommend this show all the time. Thank you for being born to play Wendy, and also for calling me special!", "mama__yak": "this is what i know you from! from the beginning! i truly love this show so much and i am so happy it existed for the short time that it did. (also my volkswagen is named dub dub after Wendy Watson)", "danbri": "ah... I read this as \"middle manager\"", "antimuppet": "Love every minute of that show. You all did fantastic work.", "jay_urquijo": "Is it too late to petition to Netflix to revive this show?", "mrs.valo_isme": "I love the show so much, it's one of my absolutely favorite! Thank you! I gave It to my niece, hoping she'll love It Just as much", "minnesotajazz": "Watched this from episode 1 on TV with my mom. Had such a crush on Wendy Watson that I was like 'whoa I might not be straight.' Turns out I was right, I'm out and proud and queer as hell! So thanks for starting me down that road to being myself, Dubbie.", "dennismelledge": "Dubby! I loved that show.", "katwoody": "Love this show more than some brands of pizza.", "snail62": "10 years? Oh my god...", "annavacuum": "Plus I bought it cos it’s not even in re-runs which is rude. I wrote SyFy and begged them to take over the show. I’m still sad it’s over. Was such a great show!!", "deepwells2219": "Didn’t catch it live, but bought the DVDs as soon as I discovered its existence. Utterly brilliant.", "nyhoundlady": "I have gifted this and recommended it to so many people. Everyone has loved it. I've watched so many times I can listen to it while walking and \"see\" it.", "thejoshuaolson": "That show made me sooo happy when it was on! Loved it!", "unknowntrekkie": "I was one of the 14 and i loved the show. I spread the word to my friends. I loved all the pop culture references, the humor. I miss the show. I was devasted when it got cancelled.", "greg_mucino": "Seems like yesterday @nataliemoralesloves when I saw you and some friends at Arclight Hollywood right after the show had started airing and I called out Middle Man and you broke out that amazing smile of yours. Then getting to meet you at Comic Con that summer 😊 Great Times.", "noplacespecial": "ART CRAWL!", "starwatchr": "Gotta rewatch this show soon. It's such a happy place to visit. 💕", "whochangesmasks": "I adored this show and was heart broken when it was canceled. It was beyond ahead of its time!", "eggveal": "@emsielass you were one of those 14 lol", "rileyarby": "i can't believe it's been 10 years. thank you 💙", "sofialand": "Daaaang mujer serving Penelope Cruz superhero realness", "tsondermann": "Thought for a second it was coming back. 🤦🏻‍♂️", "kmuellz": "Crazy I was 15", "justarandomcarl": "One of my favorite tv series ever", "sexy_eyebrows": "That was such a cool show", "talideena": "I love this show so much! It's brilliant!", "cabrooks68": "It is still one of my all-time favorite shows. My old housemate and I would drop everything to watch it. I just rewatched the series the other day. LOVE you and Britt. ( I can't even talk about the David Lynch music video!) Needless to say, I'm a big fan.", "daveswartz_zossenfox": "I was one of the 14! Cool show.", "story_of_3_romeros": "Still one of the best jobs I've ever had in the industry with the best people in front of and behind the camera. Great memories. Such a pleasure to get to work with you, @jakesmollett , @msbritmorgan and all the other amazing talent", "beevision": "Great show, Great memories... You were such a joy to work with Natalie! Time for a reboot?! @okbjgm?!", "cindersandrain": "This show was so good", "williamcottrell": "One of the 14!", "faustusbob": "I miss this show so much.", "janecousteau": "I loved the show, Natalie! I caught the pilot while I was on sick leave and I was hooked immediately. Whenever Dub-Dub was on screen, I thought, “man, I want to be like that”. You’re made of awesome!", "msbritmorgan\nVerified": "Verified", "iamlejo": "Love you too, Dubdub!", "tvchicker": "I love this show so much!! Own the DVD and bought the digital copies on iTunes. I also quote the show often if only to entertain myself.", "tyrell.benally": "Good job Dubbie!", "styggian": "I saw this available on Amazon, and was curious lol", "lovegroupcomputer": "🤯wtf is this lol 💀😂", "liamfwatson": "To this day I tell people about the greatest show they never knew, then play YouTube clips or the complete series on DVD. And almost daily I use a line from that series in my day to day life. Also being William Watson and having a connection to Panama helped struck a cord in a good way.", "8bitcableguy": "This show was and is amazing. Like Wonder Falls, gone to soon.", "alanspics": "Still one of my favorite roles. And some of my favorite people ❤️", "jiji2147": "I loved this show, so sad it didn't get renewed, it was quirky and fun.", "jonmichaelwxyz": "Have the DVD set and revisit it often. Including making friends watch it.", "tim.mcneil": "Literally one of the best shows I’ve seen. You were (are) awesome!", "jawsthemonkey": "Still one of my favourite shows. #artcrawl", "jonyo": "I've got digital copies of every episode that I figured out how to pull out of my dvr to my computer at the time. Still good stuff!", "televisionblues": "This was how I first found you tbh!", "macricius": "It was the best of times 🙂", "dokihanz": "THE BEST. AHEAD OF ITS TIME. SO MUCH LOVE.", "sahil": "This show was made for me... I still think of Wendy Watson and Noser's hallway banter every time I walk down a hallway.", "mfrederickm": "I watched it, bought the comics, recommended it to friends. Still one of my favorite shows. ART CRAWL!", "internet_citizen": "This show was incredible. I miss it", "harryb.3": "I loved that show. Ahead of its time with strong Latina lead.", "jackrabbit49er": "I loved that show!", "werdsmythe": "I recently Marie Kondo’d my life and threw out every DVD I owed except for this show. I refuse to part with the single most perfect season of weird ass television ever. Your career has grown into something amazing but you’ll always at least a little bit be Dub Dub to me ❤️", "jazminreyna.mx": "It was the first show I got into when my parents got cable lmao. It became my favorite show of all time. Funny how that happens. I will forever show it to everyone I love and continue to binge watch it. Thank you Natalie ❤", "mattleong13": "I so miss DubDub!", "trixiebludgeony": "I was one of the 14. I enjoyed it immensely. I recently got the DVD and I still enjoy it.", "darrylsylver_5.0": "Sexy Wendy Watson!!!", "karimerritt": "Happy anniversary! 🎉 I loved watching that show when it was on and I still think fondly about it to this day!", "lukefontana\nVerified": "Verified", "chad_undead_johnny": "Count me as one of the 14, I loved this show!", "mark.c.ooo": "❤🙌", "sam_________stagram": "I so have to rewatch this.", "marmolejo0629": "👾🔬📡🗿🛢", "ppineda0419": "I loved the middleman and it's what made me start following you ♥️", "lorigarrote": "Omg !!!! I remember being so excited to see this !!! You have come a long way , BADASS !!!!!", "voyeurtaz": "Before I read, \"ABC Family\", I got excited and thought, \"Hey, good it's been brought back.\" The was looking for the remote to see when the new season opener was going to be replayed, so I could set the series to be recorded.", "gauge6870": "14 people...OMG that struck me so f*$king funny! 😂", "bsideboston": "I was one of those 14! Loved that show, and have loved seeing you pop up anywhere since.", "jstace808": "this show was perfect i miss it", "figgsrock": "Just had a conversation about how much I loved this show with Brendan Hines on Sunday.", "joshuabales": "This is still one of my favorite shows. Y’all did a phenomenal job.", "bummhwd": "Love the show @nataliemoralesloves need new #2", "maphishus": "Still comes up in conversation to this day. Always great to see who jumps into the conversation with a “OMG! Did you watch that too!” :-)", "mr.juanpalanco": "MIDDLEMAN!!!!!! What a gem of a show it was", "adelina.madelele": "Can’t believe it was 10 years ago. The Middleman firmly remains my favorite tv show of all time", "vuxlox": "14 PEOPLW", "haveapretzel": "My father and I loved watching this show together and we were devastated that it ended so soon. You were perfect. The whole show was perfect. <3", "kevinseccia": "This was legit a perfect show.", "joshuamneff": "I just rewatched the series recently! I love it so much! ART CRAWL!"}