{"whatistheewish": "It was such a fun night, I imagine a TON of work!! Thank you! P.S. I want your purple dress. 🍅🍅", "chadmcclarnon": "❤️ ❤️ ❤️", "bunksun": "@imogenheap I remember seeing your show in #chicago on the Ellipsis tour and you improvised a song to raise proceeds to #endgunviolence in the city. #cool #dminor", "sarajbenincasa": "Beautiful!!!! I’m so sorry I had to be home East because of a family thing. I was so excited for this and am still so delighted you did this. So much work went into such a brilliant cause. Be proud!", "darrylsylver_5.0": "Awesome!!!!", "gnati": "Ya killed it! So proud of you. ❤️", "jessica_mcnamee\nVerified": "Verified", "kimmyerin": "Such an epic night!!! Loved every second of it!!!!!", "lorigarrote": "You and everyone were INCREDIBLE! Kudos ! 🍾 @nataliemoralesloves cheers 🥂!!!!", "totesmckee": "Great show! Now we never need to mention Gigli again 🙌🏼", "ananana2000": "So proud of you!", "maggiefurlong": "👏👏👏", "sheisnotmelissa": "Ooh I didn’t see it from this angle. It’s got your name!", "jen.dunlap": "❤️🍅❤️🍅❤️", "museumandy": "I wish I could’ve made it out to LA for the show, it looked amazing!!!", "katieaselton\nVerified": "Verified", "tvpam": "I had such a great time! Congrats on an amazing show!", "cafeconpansexual": "You’re so amazing.", "j__vedder\nVerified": "Verified", "polycubic": "it was a blast!! an amazing way to spend my birthday in support of a great cause. you were a fantastic host and you put on an unforgettable show. thank you so much for all the hard work you put into making this happen. 💕 you should definitely try and put on another show next year!", "ricrenae": "Killed it🔥🔥🔥", "bobfryerart": "NAILED IT!! 🔨🔨🔨Thanks too for supporting so many artists!! One in particular comes to mind...the incredibly gifted and big-hearted 16 year old artist @gracieleeart 🧡🧡🧡...who was showcasing 1 of her powerful art pieces in the theatre entry at your show", "therealblackhistorian": "👋🏿👋🏿 Hola Beautiful , when you get a chance follow my page for the best black enlightenment on Instagram 👋🏿👋🏿 @therealblackhistorian", "trace\nVerified": "Verified", "mrandrewshaw": "👏🏻👏🏻👏🏻", "bgate82": "That was a great show! I'm sure it was a lot of work.", "unapologetically_christine": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "jillianbell\nVerified": "Verified", "ivyandcloversdad": "...so far? More, even better things to come, I am sure. Congrats", "rc_1976": "You are awesome!", "mynameischrischalk\nVerified": "Verified"}