{"mark.c.ooo": "❤", "camthomas143": "ART CRAWL!", "clearcomplexity": "10+ years later and still an awesome show!", "werdsmythe": "Dub Dub ❤️", "_izzylawrence": "One of my all time favorites ❤️", "meganleigh.r": "Seeing this hurts. Miss.", "lynleyalison": "❤️ this show so much!", "almostgarybusey": "Loved this show! It also had such a great soundtrack!", "ulykicking": "Only the best tv show ever and I’ve been a fan of Natalie ever since", "goobatron88": "Omg! I si loved this show!", "drgonzo32": "My sister and I are still in agreement that the show should have lasted 5-7 seasons past the first and only season", "baconrajah": "DUBDUB!!", "trexpants": "Art Crawl! ✊🏽", "marcburkhardt": "Still one of my all-time favorite shows! Good luck on your upcoming NBC series!!!", "theomniarch": "Love middleman so much", "prophetx15": "@nataliemoralesloves I was just re-watching my DVD set. That show was awesome, and you guys were all great! Stay amazing, my friend!", "kimgreene": "LOVED that show!", "bothering_birds": "I have these on DVD somewhere. I need to get my kids watching these ASAP (crapIcantremem eryournickname)", "richardlindsay0604": "Miss you, Dub-Dub. A really strange show, but a really funny show. Watched it when it was on and have the DVD.", "darkwing830": "I loved that show. Have the dvds and watch and share them a lot. You're awesome 😊", "lilcupcake331": "Do you talk to Matt at all? (🤦🏻‍♀️ for asking)", "macricius": "1 of the best ever! ¿do you know if they will ever release a Blu-ray set?", "teiscinn": "This show is one of the most delightful things that humans have ever done. It rewatches gloriously, and makes me happy every time. You all rocked in it.", "davi_linsf5": "Middleman brought me here", "earthbound42": "sheer elegance in its simplicity ❤️", "rogerboltin": "If this show were on scifi it would have succeeded", "darrylsylver_5.0": "Awesome!!!", "tweakmusic": "Loved this show and your performance as Dub Dub! Ahead of its time.", "amytwumma": "How do I *watch all of this*?", "rederin1996": "So fierce!", "benjaminbuddofficial": "Get off the feine, Wendy.", "scottfien": "Love!!!!! #Dubbie", "cocovenegas": "I still love this show ❤️", "laurenfcrawford": "God, I loved/still love that show 😍😭", "aaronfrey9": "I love this show and you, too! You were so good in it!", "ivyandcloversdad": "Thanks for making me discover that show.", "ryanfreshhh": "Man I still watch this. Blessed up for DVDs", "snail62": "😭😭😭 I miss it so much...", "grimm_book": "Gah! I loved that show!!", "gabi.ayad": "oh my god I loved this show so much", "ppineda0419": "The role that really made me follow you", "brandorsmash": "Too good for this world 😭", "alexeding": "My introduction to the magic that is Natalie Morales. Wonderful show.", "the_yarg": "Still love this series to death. Met Brit a few years back at a convention and had her sign my dvd. Brought teqrs to her eyes.", "noxpunkis": "Best series ever! ❤️❤️❤️", "dangerousdac": "ART CRAWL!", "peymon": "Those were good times. You were/are amazing dub dub!", "jaydieguez": "Miss this show, I got your autograph at comic con that year"}