{"adelanomore": "Get it gurl!", "srwoods23": "😭❤️🙌🏻", "ryanabboushi": "I love this so much. Great things ahead.", "sanders_wi": "Very cool", "davenadelberg": "Remarkable, Natalie.", "instdminer": "💕", "caffeinistic": "💕", "richardanthonymorris": "Awesome", "bmarian": "Sooo cool ♥️", "mymoena": "We're so grateful that you share your awesome talent. This story 💖 - relate so hard to that hospo life in chucks and an apron 💖", "lapreski": "These stories! 🙌🏻❤️", "chancesessions": "Sounds great I wish you the best", "jennizzle\nVerified": "Verified", "c.leandi": "Love ya ❤️❤️❤️", "10centbrian": "Love your story!", "kattthompson": "❤️", "nataliataylorsworld": "Can you please follow us Natalie??", "thejealouscurator\nVerified": "Verified", "sparkyfirepants": "@jennibillings She is as cool as I say.", "biancamalinowski": "This is awesome. So inspiring! 🙌🏼👏🏼❤️", "goatwrestlingperseverance": "Never throw away stuff that reminds you of where you been or where you are going. 😉", "jlmiller8109": "This is amazing! Dreams do come true! I pray for your continued success ❤️", "ivastoos": "I am always so touched when I hear this kind of stories. Very inspiring! So happy for you, keep on shining! 🍀🌈❤️", "bookrecosfromcelebs": "What are you reading these days?📚📖", "katieshouseofwax": "😽", "wakeupgreat": "I don’t know anyone who deserves it more", "acsbbx": "And then you got to work in Santa Clarita Diet with her... that’s so amazing! And I’m soooo happy for you. Can’t wait to watch you shine on Abby’s!!!", "megrill": "This is so sweet 💕 You rule @nataliemoralesloves", "thealexcompany_": "Love the show🥰", "gwenpent": "❤️❤️❤️", "just_grem": "👍👟", "heycaptain": "So happy for you!! Keep kicking ass! We’re rooting for you. 👍🏻✨", "heymollster": "This is the cutest story", "thegeofflatulippe": "I never knew this! That's so great :) Did you ever tell her on set????", "thatmomwithglasses": "I love the show! Great job @nataliemoralesloves and @nbcabbys", "desie916": "Keeping it real Natalie ❤️", "_.kellz._": "1st Female Cuban lead of a network show is huge!!!!! Representation matters! #itslongoverdue #youroutfitonlatenighthadmelike👀👀👀", "the.chez1066": "Always good to keep some mementos of times passed, to reflect and then also realise how far you've come since and to be thankful where you are now. I do similar with a few things. I have an old shirt which I used to wear at a cafe in 2006, which reminds me of the hard work I did in the past and keeps me real now. Even though my life is very different now, it motivates me to work hard and keep pushing ahead. 👍👍", "agonzo361": "Love the show ❤️🇨🇺", "surferchick65": "That is so cool! I hope your show does really well. I loved you in Trophy Wives. I am so happy for you having the lead in this show. Love your personality.....best wishes! 💕", "jamiebabbit": "♥️To you and drew...both bonafide!", "eduardo_ivn": "That's an awesome story. Congratulations on your success.", "robertearlbuckley\nVerified": "Verified", "itswendymateo": "❤️", "sarzo.rudy": "We’re so proud of you 👏🏻👏🏻👏🏻", "el_papo12": "I used to carry around the same 3 cigarettes just to tell the other guys I needed a smoke break.", "chrissiefit\nVerified": "Verified", "kneeltailor42": "This is why I love you so much. You're so fuggin genuine, it's amazing. Literally from the second I saw you on MM, I knew you were gonna be big. Keep rocking, Natalie. ❤️👍😎", "nbcabbys\nVerified": "Verified", "maggiefurlong": "love this.", "jenniferzaborowski": "This is the best.", "fauxtografer": "Girl!!! 👏🏼👏🏼👏🏼 Kick ass and take names, acere!!", "joshuamneff": "I LOVE THIS. Also, I wear sole supports in my Converse because they don't really offer much support and I have flat feet but I love them too much to not wear them. 👟👟🙌🙌", "cakeapril": "Yes!!! So proud of you and happy for your success ❤️❤️ well deserved and well earned ❤️❤️", "tsaints1115": "How can you not love a girl who wears Chucks.", "annatozzibarbaygram": "Thank you for sharing this story 💕 Those shoes probably carried you through a lot of auditions and callbacks. They’re good shoes 😊", "katiegrossbard": "This is the best.", "mike_mcsherry34": "Good lhck with the show. So far I love it", "petecapella": "You deserve every bit of success. You’ve earned it and the show is FANTASTIC!!! ❤️✊🏼❤️✊🏼", "internet_citizen": "Remember where you’re from or you lose where you’re going.", "mrtbutwithfewergoldchains": "Please buy new shoes, for your feet's sake. You can put those in a glass case or something.", "whatistheewish": "I love that y’all filmed outside on the Universal backlot, were you wrapped by the time all the rain started?!", "saratess": "😭💛💛💛", "the_feisty_red": "@nataliemoralesloves I want to be you when I grow up.", "kimmyerin": "Love this. 💯👏😻❤️", "yaritafrita\nVerified": "Verified", "bubbagump2k": "maybe Drew can guest star on the show to bring it full circle", "nabedi": "Amazing story. 🔥🙌🏽", "kenrickvezina": "This just gave me that sense of deep resonance you get when you recognize someone else's humanity. Thanks for sharing it, from my heart to yours.", "yosoyserge": "Allllllllllll the feeels. Props.", "1denniswalker": "You is bone-uh-fide!", "swezdogg": "Love the shoes! You can’t throw shoes like that away because they’re like an old friend! 😀", "lmpowers15": "Love this, you’re kicking ass!!!", "lorigarrote": "Omg I am gonna cry !!! This is beautiful! So proud of you and you’re incredible persistency @nataliemoralesloves 🥺🙂👏♥️", "shakespearefan78": "That's an amazing story.", "matthewtylerpriestley": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "meleslyn": "❤️❤️❤️", "amnatevenkidding": "i’m so proud of you omg", "amshaffer": "Throw some Dr scholls in there, they'll be good as new!", "catielaffoon\nVerified": "Verified", "dltpei35": "❤️❤️❤️❤️. 🇨🇦🤓", "gus81687": "I'm so sad you weren't on Santa Clarita Diet longer this season and then it all made sense with your new show. Congrats! You brought me much joy on Parks and Reqs and S.C.D", "delaneytarr\nVerified": "Verified", "c_johnson_art": "Loved watching Abby’s last week and can’t wait for tomorrow’s ep. Great job, sister! Now YOU have people needing a cigarette break! 😉❤️✊🏻", "do_you100": "Perfect story ✨", "joshruben": "This is great", "paulywoodforever": "@nataliemoralesloves So happy for you!!", "msmorges": "This is awesome 👊🏼🧡", "jesschaffin\nVerified": "Verified", "hopj15": "Such a beautiful,heart warming and inspirational story.", "chelseadevantez": "I love this so much", "clifftron1986": "...and then you eventually get to work with Drew Barrymore on Santa Clarita Diet! I am loving season 3 so far! I have two more episodes left to watch.", "travelisthespiceoflife": "Awww that's so sweet 💖 Life is like a box of chocolates!😘", "mmarky63": "awesome post. good luck with the new show #nbcabbys", "astaella": "👑❤️", "tommyboy561": "My wife and I Love you on Santa Clarita Diet. Must be mind blowing working with her now. Great story!"}