{"travelisthespiceoflife": "💓Taco is in red, that's his color😉. There's also a girl in a photo...very interesting 🤔", "the500lbgorilla": "@nataliemoralesloves - really really digging this show ! Such a solid cast ✊🏻", "auntietara8415": "He's on your lap!", "richardlindsay0604": "Great show! Been a fan of yours since The Middleman. Keep up the good work, dub-dub.", "azuladobleu117": "Your show is the best!!!", "nataliataylorsworld": "I love this", "nbcabbys\nVerified": "Verified", "christophers_kitchen": "💘 you", "themandycakesboo": "No, but is that a duck?", "joseph.tobin": "@nataliemoralesloves great episode and love the Irish references jokes in the episode 👍❤️🔥🙌👏😍", "xandarxcapades": "The real question is how do i get to work on a set like that", "victorialyman": "I love Abby's 🍻", "infamouzjc": "So awesome just took a tour yesterday on the universal studios lot and got totally surprised to drive by #abbys 😍🙌 almost jumped out of my seat screaming how much I love this show❣️ Also I def want to be part of the live audience👏😎 for one episode one day. Keep doing great things. #representationmatters @mrschanocuacorona can't believe we saw the house up close.", "jacquiewalters": "❤️❤️❤️❤️", "vero.ag23": "Bumped into @nataliemoralesloves at my brother’s @aalvarez521 and his now wife’s @la_in_la wedding in LA! We’re from Miami! Come to the ballroom for a fun-filled Star Wars themed Cuban-American wedding! 😄", "vanishingpt70": "Love this show", "adoniskingcollection": "🖤🖤🖤🖤", "tdottugboat": "Really loving this show big up and thank you to all that make it happen", "m.berk.demir": "OMG you are so cute on your story", "brittanyspyksma": "Aww taco!!!", "samanthabayne": "Natalie!!! babygirl! I know this is tough but you gave it all you had & they’ll see that soon enough. you led your first tv show, which is just beyond incredible. the next one will come around before you know it. keep your head up and treat yourself a bit — you deserve it! Xo 💕", "macro_bing": "@nataliemoralesloves watching you wake a mojito is one of my top 5 TV moments of all time 🤣🍸", "nestorandsnowe": "Fun show and a fun cast. The outdoor set was a fun idea. You are a wonderful comedic actress. Thanks for making us laugh — please keep doing it! PS — I also loved David Letterman’s afternoon talk show on NBC that got cancelled. Spoiler: he had some successful shows after that!", "butterytansel": "Loved the episode tonight", "tiffany_lazette": "❤️❤️❤️", "catielaffoon\nVerified": "Verified", "toyboybra": "❤️", "jack__pls": "What happen to santa clarita 😢", "fifers3000": "❤️🌈💪🏼", "moorepechos": "Awww, Taco on set! CENTER of attention! 😍😍😍", "dingdingloveslife": "In your arms？", "fgmccune": "Great picture and THANK YOU all for your hard work! We live this show!"}