{"ndmann55": "Sorry to see this one go, but, as they say, when one door closes another door opens. At least we'll get a chance to see you do more stuff. I don't see you not working anytime soon. Also, I still want to call you Sarge, if that's ok.", "colebyarnett": "This show was awesome. The TV industry is bleeding out. All they care about is money, looking right past talent and potential for “ratings”. Friends didn’t have incredible ratings or numbers in the first season, I suppose they were less greedy and hasty then. Such a shame. Natalie, you are A+ talent, can’t wait to see what fun stuff you bring us.", "collzorgs": "Thank you for Abby’s. I loved every episode. I definitely cried tonight. Thank you for letting us in. Until we meet again... cheers.", "boxcarxo": "IM CRYING", "jlaurin80": "I’m so proud of @nataliemoralesloves and cast of Abby’s. I wish they gave the show another season. I look forward to your next project and I’m sure it will be another lead!", "lbkogut": "I'm going to miss this show.", "davenportmo": "💕", "tim.mcneil": "I never felt that the show hit its full potential. Like a great recipe that had all the right ingredients but wasn’t fully baked. I was hoping it would hit it’s stride, but obviously they’re not gonna give you the time needed. 🤬. I’ve been a huge fan since The Middleman. You’ve finally landed a prime time network show and I have to imagine that the next one is around the corner. I can’t wait for what comes next!", "auntietara8415": "I'm going to miss watching Abby's.", "jillianbell\nVerified": "Verified", "dingdingloveslife": "😔", "mario_xgen": "Even with the volume turned off one can tell what song you guys are singing. Wonderful show, best to all.", "angelalesawheaton": "Saw Abby's last night and am sad you guys didn't get a longer run! First saw you on Parks and was rooting for you! 😊", "fgmccune": "@nataliemoralesloves my wife and I LOVED the show! Thank you for an amazing season filled with numerous laughs!", "d20_outlaw": "One of the best parts of this show was the casting... EVERYONE was amazing and it’s sad to see it go. But thanks for all the hard work and the time you and everyone put into making us laugh!", "1eyejonny": "@warrenslburke fam. Lmao", "schroeder6": "Please do 1 thing for me @nataliemoralesloves . Keep setting the world on fire 🔥 with that amazing talent you have.", "baxterfoskuhl": "I’m gonna miss @nbcabbys so much! It was such a cute and wholesome show I always looked forward to after a long day. Hope more good things to come @nataliamoralesm !!!", "ananana2000": "I loved the show and all the different roles and unique personalities! Wishing everyone the best of luck! This will lead to even bigger and better!", "billiamj": "So going to miss the show.", "l__spartacus__l": "Damn. I liked the show. It’s a shame they cancel things so quickly. There’s hundreds of new shows and hundreds more old shows streaming so we gotta go back to building an audience. Abby’s couldn’t have been that expensive to shoot.", "blondeambitionjen": "Aww this makes me sad I love this show! ❤️", "darrylsylver_5.0": "😓😓😓😓😓", "brisa921": "Wait no more Abby’s?", "katiegrossbard": "🙌🏻🙌🏻🙌🏻", "joshuamneff": "THIS IS SO GREAT! ❤️ I'm so going to miss this cast!", "clifftron1986": "I wish this show didnt get canceled. It was starting to get really good too. You guys had pretty great chemistry together. Do you ever think about what could have been done to stop the cancellation or is it one of those things where you have to say you guys gave it your all and the outcome is out of your guys' hands? I hope to see you again on tv or movie (i know you got that movie Stuber coming out soon) in the future.", "ruubytuesdday": "Crying at this. You guys really brought something new to the table and made me laugh my ass off. I bet it was so fun to film it. Until next time from a new fan.", "pineappletidbits": "I'll be 31 in August and to this day, this is how I find my mom in a store when I go shopping with her. I sing, \"MAMAAAAAAA...\" and then I'll hear her from aisles away sing, \"OOOOOOHHHHHH!!!\". Its our own version of Marco Polo 😂 Also, I'm very sad to see Abby's end. Not just because I have a huge lesbian crush on @nataliemoralesloves but because it was so funny! I grew to love each character so much that I felt like I had a seat at the bar! I w", "shakespearefan78": "I am so sad to see this show being cancelled. Loved it and the entire cast was amazing.", "thetomlynn": "❤️", "theeaugustwoods": "Already?! What?! They don't really give a show a chance. It was the best sitcom I've seen in a long time. Kind of a throwback to the classics, which is refreshing. Thank you for the laughs. You're funny, so I know we'll be seeing more of you🤘", "javi80123": "love love love", "carolsoliva": "i’m gonna miss this show a LOT!", "sdgirlinla": "Awww man, it’s not coming back? I really enjoy it 😔 welp, here’s to what’s next!", "pogthespian": "‼️👍🎭😎🎬☯️👏💕Even Skip is having fun!!!! Great group. Miss y’all!!!"}