{"mario_xgen": "Looking fine", "goddaddy4": "Gorgeous", "samlbrooks": "Killin it ✌🏼", "catielaffoon\nVerified": "Verified", "bumblebeatzzz": "How do u shit in this?", "borgioni": "❤️❤️❤️", "ddduca": "😍😍😍", "tanbyclara": "Glowing girl 🔥✨", "jennyjwade\nVerified": "Verified", "mojoe_magenta": "Oh my frikn sweet goddess.", "aktve": "Whoa", "_megmasters": "um stunner!", "lorigarrote": "Amazing dress !!!!! Work it 💃🏻", "lepetitsmudge": "@caseymagpie my crush 2day", "craig.ludvigsen": "Hi Natalie I read about your run in with the paparazzi being intrusive to say the least and I had an idea years ago that if a person was to trademark or copyright their image it might make it illegal for these photographers to take said photos, I'm not intelligent enough on the law but its just a thought as it would take away all their power and only authorised photographers could take photos. People need to stop this practice of invading one's dignity and reducing one's self to that of only a sexualised ideal, we are all guilty of feeding said beast but if we stop objectifying people and start looking at them solely for their talent or voice then I think society and the world would be such a better place. I hope this idea rings true, Carrie Fisher joked about it on the documentary Wishful Drinking that George Lucas owned the rights to her likeness and I believe that if you could somehow make it illegal for paparazzi to take these images it would very much change the world for the better.", "terrytoccidesigns": "Stunning!", "annavacuum": "Insanely gorgeous 😍💙💙💙", "kendo8714": "You look stunning. Was sorry to read about the paparazzi at your premiere! Sick people 😥", "gocatgo": "Brave. Strong. Talented. Beautiful. There is a positive effect waiting to be realized in most unfortunate situations. Well done. Well done, indeed.", "suliejanders": "Fuego 🔥💋", "neyubat": "@yo0kat I thought this was you lol"}