{"shashu_029": "#PKMKB", "_meenakshi_11": "So well said 🙏🏻👍hi", "realpunter007": "Apke father sahb ka josh high h ya kam hua ab.. Mee2", "utkarsh_mahajan10": "If you has dare then answer me my question if war is not a solution then how what america doing in iraq ,syria and Afghanistan... How they killed leaders of islamic states by love??? Pakistani is funding terrorism and they regularly killing our soliders and war is never a solution and i cant talk about war because im a civilian and im not fighting with soilders that mean i have no right to say about war.... We want war im 16 but ready to serve in army...🇮🇳", "riyapillai24": "@mallikadua ur nobody to teach Indians how to react nd how to think. the way ur out of twitter sooner u ll be out ffm insta too. u definitely need a doctor. get ur check up done. bimbo", "tarunsrvstv": "Sali madarchod", "rohitrana92": "Apne baap ke baare me bhi ku6 bata de sale dogle log ho tum sab ke sab. Feminist bani ghumti hai na jab baat apne baap pe aayi to gand hava le gayi .. tere baap ka josh thanda kar pehle ..... Aur sun ye baat Soldier ko pehle din se hi pata hota hai k use kisi bhi din ladai pe jaana pad sakta hai .....phir starting hum nahi kar rhe start dusri side se hota hai. .... Aur tere according agar koi tjhse powerful aadmi tere ghar me ghuske tere sath ghatiya harkat kare ya aur kisi tarah se damage kare to tu tab bhi ye hi bolgei kya nahi papa do you know how powerful that guy is .... We shouldn't fight with him we should let him do this again and again ..... Dogli ka matlab hota hypocrites aur desi me matlab hota hai mix breed ..... Just dont do bakchodi here and keep your daddys josh high even higher i must say", "yashchavan29": "Tere baap rapist hai", "hifsasherwani": "Love and major respect from Pakistan for this. Even if this made sense to a single indian or Pakistan i believe your job is done.", "mylifemyclothes467": "awesome words....a big lesson for we Indians who without thinking tell ghar mein ghuss ke marenge....we never thought what a soldier must be thinking..what abt his family....we need to change ourself as soon as possible or else it will turn into big problem....", "ailaw_itparp": "@trivemeg21", "iam_raghvend": "We all know wars will lead us to nowhere but, what should we do? What should the Patriots protecting our border should do? Just give the enemies to attack our people and take our country? Bullshit. I have never heard any of the army's family taking this toxic. I am sorry to say but, this was toxic.", "prince_of_zilch": "Mooh todh jawaab to all the pseudo-nationalists.", "balalalalab": "@mere_hurf_ yeh padh", "____gelato": "this needs to be share as much as possible.", "rsidd1993": "@tan_v_khandelwal", "roshnihegde": "First of all what is the source of this story... I tho don't believe that any wife of Indian Armed Forces can write it...a letter filled with cowardice.. On the other hand it's for Armed Forces and Decision makers to decide the course of action and they have acted well... Kudos to our IAF...But looks like some of our own countrymen / countrywomen don't have the faith in their country or it's resources and are more scared of country like pakistan and it's nuclear bombs..😂😂😂.Decades of cowardice has led to the pickle we are in right now.. it's time to set it straight.. #iamnotafraidofpakistan", "beautiezofb": "@balneetbedi02", "brar_manpreet_99": "🙌🙌🙌🙌🙌🙌🙌🙌🙌", "imkabirofficial": "Weight loose krne pr dhyan do didi", "visajdesai": "@poojaraghuwansi", "nikitakulkarni": "@nikhilsoni0301", "_bhairav._": "Hypocrisy ki had hoti hai bhadwi", "bombay_karma1611": "@bitsyhenry this", "rajparekh9": "I do not agree with the idea of not going to war. I, myself will enroll in army to serve our country. I am not afraid of Pakistan being a nuclear country. India is a nuclear country as well. But to fire nuclear weapon special permission is required and if not followed a special price has to be paid. Is Pakistan economically stable enough to pay that price? Do you know what is the josh of a soldier fighting at a border? Caring from a family is well obvious and required but what about the josh of a soldier from the same platoon who lost his friend? What about josh of a countrymen, the youth, who is capable fighting against the same and is eager to join army? And mind well this is not a josh of some movie. To tell you reality of surgical strike happened first and then movie was made on it. Inspite of calming all the motivation and fire of revenge along countries youth, you should inspire them to join Indian Armed forces, the elites. You should know the reality of Pakistan before telling us the reality of India (that we already know it). I will join Indian Army and will serve for the nation whenever required and will never hesitate to give my life for my country to be free from terrorism. Jai Hind, Jai Bharat🇮🇳 #iamnotafraidofpakistan", "shmisunink": "If you love tattoo art .. have a look on our works here", "ankushr.14": "Fuck you @mallikadua", "yell_ooh": "✨👍🏻", "kajal_baigra": "🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌", "pabbi.guram": "@ravisinghka", "tanisha.singghh": "@mallikadua do you have anything to say now. See today's news. We never wanted a war. But an answer to Pakistan. We went inside and killed them all. Congratulations to all the Indians who truly love and respect their nation. And shame to the one who doubt it's strength.", "sonam_2906": "🙏🏻🙏🏻🙏🏻🙏🏻", "graceleena_darla": "🙌", "llcliftonll": "@nicole30598", "prachi_garg26": "💯🌟", "radhikarathi16": "W.O.R.D🙌", "resplendent_sana": "🙌🙏#vandematram🇮🇳 .. come on india come on ..read the post and get on your senses and bloody transit faces apart . Come on your hosh and keep your josh in a pocket ❤️", "gunjan_lohia1703": "🙌🙌", "savita_dokwal": "👌💯", "_imahnoor16": "@mujadadjamil", "_ajit__patil_": "Terrorist girl", "isthatanasmalik": "Preach Preach Preach Preach 💞💞💞", "surabhimhaske": "🙌❤️", "akritipandey566": "So on point! Exactly what I was saying to my friend the other day. Youtube aur facebook pe bas comment karna aata hai aise logo ko 😂", "shubham_bhardwaj_9339": "I read the last lines..Jis country k pass khane k liye paisa nhi h.. or katora leke bheekh maang rha h jo desh..@mallikadua uske nuclear weapons ki dhamki kisko de rhi ho aap???? Yes we have to fight terrorism but just tell me who is producing terrorist in name of zihad..i think that's the same nuclear power country you are talking about???", "evolvedchimps": "Finally a post that is written with 'hosh' and not just 'josh' 😂👌🏽", "srilaksh.17": "Can expect this nonsense talks ,Down graded and unliterate ppl like u @mallikadua .podi pulley@mallikadua", "ishratraymish": "Finally some sensible people who are coming forward as educated and well taught. Terrorism is the root cause and corruption is the helping hand... Fight against them and not against common people who would just hurl abuses at you when you hurl at them... It would just darken your heart guys.. Be sensible and think... For all others.. You are kids.. Fighting fighting khelna aur sab kuch chorke khudko maut k hawale krna desh k liye Yeh dum tumne ana bohot door ki baat he.. Be united with sense and not divided by chutiyapa. Please.. ❤️", "__thatbonggirl": "❤️❤️❤️❤️❤️", "samikshaa_14": "@tantra_vishkar", "ronitsingh296": "@mallikadua Tumse naa ho payega beta. Aap kumbal uddke soo jaye. All we want is that pakistan stop giving shelter to terrorist, aur aap nikal padte hai gyaan dene war pe. Has india ever done anything aggressive? But there is a limit to things! Be a nationalist, those who write these kinna post will also never take part in war, u are no braveheart to judge people who are fed up with these kind of cowardice attacks and just want to share there sentiments. So stfu bitch!", "rachitsalian": "This is bullshit @mallikadua", "shreejasoni": "No need of listening to these stupid people", "supratim_g_no1": "Once a leftist will always remain one...Big shame on you @mallikadua ....not a fan anymore", "aham_brahma_asmi__": "@mallikadua how's d josh ? (If high then come to my haweli randi ) .. sorry for abusive word but tu hai madharchod randi ...........1947 ,1965 ,1971,1999 :- this was the date when indian army fucked pakistan . (now u tell me randi how's the josh ?) .......... ji malkin ek to hum bihari upper s rajput upper s army family background wale hain galti s meko dikh matt jana nae too polythine bag m toilet krke tere muh p phek k mar dunga 😂😘 hath nae uttha sakta na bcs tu larki hai ,wo alag batt h ki dogli hai .", "abdullah11_official": "🙌🙌🙌🙌🙌", "r.i.d.a_haroon": "@anusheh.romesa @raffiraffia @laibabinterashid @hiraa_butt @kajolghafoor @nimra_579", "various__eyes007": "Tu ek... No... ki chutia hai", "saand_eep": "Love that since you are an expert in nuclear warfare", "momi.tariq": "I am a Pakistani nd like my other country fellows nobody here wants to kill Indians or to attack India for No reason.Terrorists r everywhere in world maybe in my state, but they dnt belong to US.we are the one who lost thousand Lives in the bloody terrorism,APS kids were Pakistanis .Being wounded you dont like to hit others who are no harm to you. I challenge all of you Indians to visit Pakistan Once in your Life ,Tell them You came from India ,ppl will treat you u just came in from heavens, by each possible hospitality. Its not the time of PTV or doordarshan where ppl dont know whats exactly reality is, i feel pity and disguisted when Indian channels report much false n wrong info abt Pakistan.i used to figure out where is that Pakistan located which Media shows.We are not Aliens, we breathe oxygen,ur blood is Red Too,Dard hamyn bhee hta hy,tkleef hmyn bhe hti hy . I condemn each n every brutal killing on both sides of border b/w 1947 to 2019. I am a Pakistani 🇵🇰 but i love India ❤️ i wish one Day India could find what The matter is .", "beingviable": "Demoralise krne ka theka le ke rkha hai , YES OUR JOSH IS HIGH and so Is of our SOLDIERS , Yes We will boast because we Know the potential of our Soldiers and we are proud of it. Go and hear from a soldier whose friend died , He wants nothing but The blood Of Terrorists and we our Proud of it. So stop Demoralising Our Nation And Stop doubting the potential of our soldiers and lastly stop Speaking like a PAKISTANI PIG 🐷", "shiroyasha069": "Kripya social media pe gyaan na chode ... Aur agar tumhari opinion se koi disagree Kare to uska cmt delete hojata h , saale Pakistan k thekedaar .... Indirectly bolna chahti ho ko PAKISTAN k saamne hm kuch nhi h and yes Josh is still high", "the_drunken_beat": "Abey oooo jali houe gand tuny aisa koun sa teer maal liya bahne k lodi Ye post krr k madarchod aoukaaat 2 hai nai sacch likhy k buss aapny aap ko socially aware dikhny k chakkar main aapna point of view cng krr di bahklol saalai chutiya ho tum chutiya jo tum aapny desh k armed forces py doubt krti ho #pakistanipig #DoubleStandards", "srioshan.jr": "Are madarchod randi wali gayan ka chod rhai hai.. Betichod #PMKB ...apna thought apna chut ke ander gussa lo..", "trapped_voices": "It's not wrong for someone to feel like that but the thing is people often care more about the lives of our brave javaans over vengeance and those who don't are simply singing a tune they fail to understand", "elizabeth.__.here": "👏🏻👏🏻👏🏻👏🏻👏🏻", "zeenat_mahtab": "👏👏👏👏", "kavita_beniwal": "@jayant_gurawa @shubh_01_ @pawansarswat8107 @babitabeniwal ye padh", "niname_k": "Pakistan is a terrorist country.. They teach their kids bad things to kill an innocent.. They make terrorists their kids.. I don't know konsa Allah khush hota h aise. Musalman bno to Apj Abdul kalam bno.. Unki country me koi Bhagat singh jesa peda hua hi nhi jo terrorists se ladne ki himmat kre..", "devdas8608": "respect", "shahrukh_wajahed": "@anukrisha", "suchita227": "@_khaan_saab_", "iamjaijha": "Ok then, going by this post, we should wait for another attack and then another attack and never react coz economy is going to go down and market is going to crash. I respect what she said but there is no solution to this according to her. Mixing up Bollywood and real emotions of people are 2 different things. Not the entire Pakistan but their Military organisation should be taught a lesson. They are the ones behind all this. There is No “Josh” mam but a lot of anger. We are angry as a nation that why is it so easy for a weaker country to attack us and still feel nothing is going to happen to them.", "karishma_979": "🙌🙌🙌🙌🙌🙌🙌🙌🙌", "amit.dixit2711.inst": "Tu lad le ja ke ...", "the_blue_origin": "@mallikadua first do some research.. nuclear missiles use karna koi bacho ka kaam nhi hai... pakistan sirf dara hua hai iss lie nuclear attacks ki baat kr raha h... india is much more powerful than pakistan.. just talk some sense... also according to you, pakistan poora india khtm kar de fir bhi hame chup baithe rehna hai... do you even realise what are u saying", "imohsinbashir": "Tmhy kya pta pakistan k rocket missile ki range kya hai?? Ho skta hai k pakistan ka atom bomb mumbai k kisi ghr mein rakha ho?? Agr mere pyary Pakistan se war start krdi to kya anjaam hoga tmhara?? Once Quaid said that \"No power on earth can destroy Pakistan \" ... remember that", "shubhz1796": "@immortal_mithil", "bhaumik.barasara": "When Laden hit the plane on World trade center, did Americans opted for peace? No, they brought havoc on Afghan terrorists until they found Laden and kicked his ass. They only dare to attack us, coz we are offering them peace in return.", "aryaa_official": "Lost all my respect for u!", "varsha2729": "In past few days this the most sensible post..ppl from both countries are spreading so much of hatred..Ppl r showing loyalty by unfollowing ppl from each other countries.This post is ❤️ at this time", "im_gaurav_rajput": "kya thought hai dheere dheere sabko mar Jane do magar war mat Karna tum Jaise bewkoof ki wajah se desh dub jayega", "galpo_buzz": "That josh led another five army men dead.How's the josh? You're celebrating death of Kamran and other militants but now nobody talks about the five army men who also died the same way the crpfs' death were mourned.Those who want uri 2 should know that there were several attacks and casualties after the surgical strike.It is easy to declare and celebrate war on social media.Cuz you don't fight.Killng kashmiris won't help either.As the leader of uri strike Gen DS Hooda said India must revise its plan on Kashmir.Out of 14 lacs soldiers 5 lacs are deployed in Kashmir.You can't go on war against your own people.", "killinit_farhan": "@i_am_varsh", "rahuldhankhar": "Okay now lets see how is the josh @mallikadua. Lets start from very beginning , Prithviraj chauhan won the battle but did not kill the opponent because he was too soft. India could have closed this chapter in 1947 but did not, why we were too soft. Then in 65,71 even in kargil. But not becuase we have some people which are soft. Japan had two nuclear attack where is Japan today. Germany was in ashes after second world war, where is germany now. They both are developed because their races have self respect. They know how to get united. But I have to say with regret that celebrities and so called intellectuals say that we should not fight war because it is costly? Shame on us then that we supported you to become celebrity. The Army has enough josh @mallikadua . The shame is that you do not. I would spit on that knowledge which gives you reason to be coward. Social media is a platform which gives people space to share their views and I think they are showing their emotions which is absolutely correct. Britishers gave you this education . Did not they fight wars? They bloody ruled us because we were not united. People like you have to be condemned because you divide us . You are a coward and I do not respect them.", "sherryy90": "@anumalamgeer", "that_december_bloom": "@huzaifa__haider", "karansukhija234": "This is true but agar nuclear bomb ayga toh hum air mai hi hata sakte h detect karke obvio", "dipikajakkan": "👏🏻🙌🙌🙌🙌🙌🙌🙌🙌finally someone is speaking truth", "kunalkhosla93": "👏👏", "im_adarshsingh": "Was this about the country that tested nuclear missile last month that ranges 60km? Mujhe toh darr hai kahi islamabad se Lahore na uda dein", "manisadash": "This is so true...It's difficult to go for a war..Our fight is against terrorism..", "swastisudan": "@puranjay.sudan this", "avirageness": "@tejas.murugesh you’re telling me you don’t agree with this?", "_.gursimransingh._": "thts what i have been waiting to hear 🔥👌👌🙏🙏", "spliffmaster.28": "The decisions are to be made by Diplomats and Government, hence the Josh can only survive through social media. But if a Full fledged war can't be conducted then Biological Warfare is an option, so there's no blood shed 🤝 How long should a Terrorist Nation is to be bared with ?", "parisha_uppal": "thanks for writing this, i am sick of watching memes and threats that every other citizen has to give to the whole Pakistan, They just want to blow the whole country up. An eye for an eye will make the whole world blind and if you are ready to loose everyone you love and your own self to a bloody war, Then go ahead!!", "nehabisen": "My dad's a defence personal... we understand the cost of wars... but do u really think it's OK to ridicule the people who claim their Josh is high. You don't think the so called Indians with high Josh aren trying to help the families of the lost soldiers. You are wrong mam. @mallikadua I respect u alot but I can't agree with you. Every year when there's an opening anywhere defence related I see hundreds thousands of youths lining up to join army,navy and airforce. But only a handful of them are selected. Only the best of the bests. I have almost alot of friends who are serving in defence. All we are trying to convey is we value the lives of our defence personals and it pains and angers us when the enemy back stabs. We want those cowards to pay for what they did .", "iparaspuniyani": "@mallikadua aise funds ka achaar daale jinke hote hue darr lga rhe faujiyo ke shaheed hone ka ? Please grow up.hmesha Sirf apne bare me sochna bhi acha nahi hota, logo ke piche hath pair dho ke aise padti hai, khud me tamiz hai !? Nahi hai, bache dimag se kam nahi ho aap, apna comfort sabse upar apke liye, kya ho jayega funds kam ho jayenge to ? Kuch time kam kha lege, atleast ek bimari se to azadi milegi. Lekin nahi, saari umar tang hote rehna hai ? Aapne kya kar liya, dusro ko sunate fir rhe ho, mtlb please, agar kuch bass ki hai na, to puch ke dekh lo kitne border pe jaa ke laddne ko taiyar hai🤞 pata lag jayega kitna josh hai indians me aur kitna kam hai apme👎", "life_of_a_military_girlfriend": "Rightly said🙌", "rit._.ik": "wow", "jacarnie4507": "Great way of indirect threatening the Indians", "its_ghanni": "@yashjoshi09", "aarzoo780": "Mam, you don't want our army to retaliate? Suffer at the hands of separatists and terrorists? It's not some kind of corporate world.. Where bitching or nepotism is a problem.. Its a war like situation.. Soldiers die everyday... And this way mam the army force will totally deplete.. And you will be the first one to run out of the country because you can afford to do so! Saying hows the josh or asking for revenge doesn't mean we are brainless.. We understand the repercussions.. And we also know that.. It will take a toll on so many lives... But at least we can show our respect and emotions this way which are quite HIGH unlike yours. Please say something which uplifts the morale of army men...!", "why_he_": "Who are in support to ban this shit @mallikadua #banmallikadua", "mariamarwat": "@ars353535", "therichachadha\nVerified": "Verified", "triple_s_019": "Ha yeh hi keh keh ke saalo se voh humko maar rhe hai aur hum chup hai yeh so called peace ke chakkar mein . Aaj 40 ko maara hai kal 4000 maarenge bcz v r silent . Whn it tym to stop all this y do u ppl think shitty things like this just to sound cool? @saranology @mallikadua", "riyachaurasia4": "@vishaladvani1709", "tahirakhowaja": "@aminahooda", "__shivani_choudhary__": "🙌🙌🙌🙌🙌🙌🙌", "riichie.d_": "Govt isn't fool. People need to understand.", "astrologer_sonu_bhargava": "Astrology by love or love marriage problem solution specialist, astrology by get your lost love back. If you are suffering business problem or carer problem then just msg me I will let you know what will happen with you also if you are suffering love problem then don't worry I already solved so many love matters so I will help you to shortout your love problem you can whatsapp me & call also in this number +91-9649730851", "theb00ktique": "This.", "caline_fernandes": "@kirankhushi", "_mona.ag_": "Respect! 👍🏻", "aliza_komal": "@hiraaly", "akshithaisreading": "SAME THOUGHTS. 😓", "zakia.nakhuda.naik": "@nageshnaik_1984 @aasim_merchant_", "vanillavahbiz": "@abaanmomin this", "mr_yash03": "Kuch hote h besharm fir aata h maha besharm jish desh mai rehti h usi ke again jaati nuclear boom is not for war it for nutrilization if they have nuclear boom we have good defence system so stop fucking anti nationalism tuje bhi kasmiri bej kar wohi pe boom se udda dena chaiye tab pata chalega apno ke khone ka dard kya hota fucking asshole", "mitul93": "@username.whatusername_ big fake and fraud letter. Read opposing comments.", "mubashir_hakeemo": "Loved this letter to the moon.. Hope some dummies in India would grab some information out of this letter", "sachin02206": "CRPF wants Revenge . Martyr's Family wants Revenge . Centre wants Revenge . Nation wants Revenge after such Dastardly Attack ..Only Liberal Leftist Shits want to drink Blood of our Soldiers like Vultures and still Sympathise with Pakistan and Terrorists after this Terrorist Incident . Those who want Peace go to Border and Ask for Peace .Those who want War , go to Border and shoot some Enemies .", "micks3081": "Well said and atriculated", "priya.2310": "@shafaqmalik45 is this the article u told me about?", "itscalledfangirling_2000": "More or less it's what I want to say", "ijya_samajna": "@shalinijammin", "keerthana_bommireddy": "💯🙌🏽", "d_dyuti_dutta": "@mahapatramausumi", "cap7ainskull": "How is pubg , no why is pubg even mentioned this serves no purpose just like the remaining.", "tenajaiin": "🙌🙌🙌🏻 Respect to the each word said, and something the whole nation needs to understand right now 🙌", "priyanka.das0104": "@sha975280 exactly what I said", "_saherafreen_": "Preach you sistaaaaahhhh 🙌🙌🙌🙌🙌", "parr_93": "Respect", "auwwab_patel7": "👍👍👍", "pradhannishal": "Damn!!! 💯💯💯", "namratabhattacharjee.lb": "My god. Golden", "anizaakhtar": "Woah😭😭😭😭", "lilgovind": "Finally someone put some Sense to these memers on Pakistan. I think the movie uri provoked Pakistan or any of the terrorist organizations.its time we should stop mocking Pakistan in movies stupid Bollywood doesn't get it.", "_vamakshi_": "An eye opener it was! #respect", "maxzarq": "Damn, very well written. Just like Martin Luther said \"I love America because I criticize it\" but we Indians just roam around being ignorant and accepting all the negativity in the nation. After this Pulwama attack, you would only see the non sensible people cursing Pakistan, and then there are sensible people who use their minds with different perspectives. I'm too an Indian but when it comes to chutiyap in my own country, I do criticize people but not my nation and still we are told to go to Pakistan for not being ignorant.", "shah_hetal": "@milonidos", "userofflinednd": "@theplacardguy", "amitsd3": "Inqalab zindabad... Vande Mataram... Jai hind...", "risalatjafri": "@we_thearmy support us in our efforts.", "fatima_rizwan__": "🙌🙌🙌🙌🙌", "shitijarora07": "@photo_doctor_fb", "vikas.saini2": "Saste nashe krne se yhi hota hai.....madam jab tumhare ghar pe koi marega na to hum bhi yhi post krenge jus wait n watch.", "suyashaaa_": "And yes last thing..THE JOSH IS STILL VERY VERY VERY VERY VERY HIGH and always will be..and traitors and scums like you make it even HIGHER..so thank you", "shambhavimeh": "@samirachauhan I feel sad.", "sanjana.khandelwal999": "So so so true!!!", "vidhika6807": "Respect", "ujjwal_rana245": "Still Pakistan ki maa ka bhosda", "fizasif": "@sumaya.mughees", "death_clutch__": "Its just that uh people cannot experience the pain and agony of what is going througj their hearts and mind..Well uh say we should not be in a situation of war..madam..we are in a situation of war nd its happening everyday every moment..So what uh are basically putting forward that pakistan also wants peace..madam they consider hafiz saeed their hero..That man can openly organise camps nd rallies amd shows whereever he wants nd uh are saying that negotiation can put an end to this..Well while uh lie there in your cosy bed and say these things..please think about it coz i think that uh havent heard the screams and havent seen the fear in the people who have lost their loved ones", "mariamughal13": "🙌💛", "bhavisha_mehta": "@prachi_sheth @rhea95menon", "shabaz__97": "Respect🙌❤️", "rathoreshradha": "Ass", "nishkamodi": "@tumulgupta respect", "darshanshah900": "Such a coward and senseless talks", "its.dev.10": "Do u even knw that movie uri and border is based on real events? If it happened in past it can again happen in future lol 😹😹😹😹😹😹. #VISUDH_CHUTIYA_LADKI", "anushka_625": "Hum har pal rote h", "hahahahahaharshit": "So true", "ajay_poonia.12": "It's not about the war you say that if war is happening many people's will killed than tell me please in present time the soldiers were not killing let left this pulvaama attack but do you have any knowledge about the border where daily 3-4 of our soldiers left us because of the bloody pak army, now only we lost our soldiers but the one who started all this bullshit lost nothing so when we already loses life then why we let them go, i am nothing in support of war but i am in support of our army n the people's who talk that the country only knows talking they don't know how to war so i just want to say them no one are here who pull them back if the country needs us okk", "comrade_nemesis": "Mam if given a chance definitely will, and dont you underestimate INDIA in any way, we as a country would definitely not attack first but next time they would not be left with anything to attack with", "mittalibharti": "To the point and very well said..Be rational and realistic 👍", "shahiploxx": "Whoever wrote this is a noob, no one really knows what is the capability of Pakistan nuclear bombs . According to a report i read they do have lots of Nuclear bombs but they are merely capable of destroying a district . Pakistan is a dying economy and on the verge of a economic crisis and till tow they have n'T even tested their nuclear bombs successfully , max area they can cover is small parts of NORTH INDIA ,THEY CAN'T EVEN reach Delhi + India do won anti nuclear missiles+ pakistan won't really try to go for nuclear attack which may lead to full fledged attack by Indian nuclear missiles of Pakistan leading to complete destruction of Pakistan . Not that i am in support of the war ,i am just laying off some ground truths", "keyur_rathod._": "Everyone know the consequences of war.... But here the point is....what should we do!! Let our soldiers die and sit back....or Giving a proper reaction so they don't think of this type of bullshit again....so please don't demotivate! And army officers know what to do and what not to......so you please sit back and do your part of job for country... let them do theirs..", "aman__v9": "Everyone knows that war is not a soln. Firstly mam just answered me \"what will you do if someone is beaten ur mom in front of u and if that person is much more stronger than u,then what step will u take,,it is well known that you ready to fight with him without any hesitation..it is same in our case if someone (Pakistan and their terrorist) are killing our soldiers; what should u do..Just boost up ur memory, we Indians also have Agni5 missile which is sufficient to destroy whole Pakistan..it is more easy to post such thoughts from ac cabins but are u think about those families who lost their family member...\"jb khud pr bettie tb samajhti aap..tb syd aap bhi war k liye bolti\"", "asifrafiq_iam": "#freekashmir ....", "alastair004": "Pkmkb", "dikshitajaindj20": "Respect ma'am... 🙌🙌🙌", "patelgrohit": "Well.. War is not the point ... The point is Terrorism.. why dont you talk about the terrorists who are living like bosses in so called Peaceful Pakistan??? In your post, you are saying about the government after government they do talk instead of WAR, but whats the result Ma'am?? Can someone explain this?? F*****g retards... Well I'm too not in the support of War, but don't try to exaggerate your false Peaceful nature here.. Every single man knows that the attacks has been made by Jaish-E-Mohammad... They are the #Shame on the name of Prophet #Mohammad", "maverick6826": "Hosh na koh de josh mein dekhne wala", "purbasha.b": "Absolutely ✅✔correct.🔥", "harpreetsingh_289": "Guys unfollow her", "the_kni8": "@mallikadua you do know India also possesses nuclear weapons right? Exectly how many? Well almost same as Pakistan. And it doesn't matter if they're a nuclear junkyard it only takes 1 missile to wipe out a city. And how many cities are there in Pakistan... Well not much 5 to be precise. And how many cities are there in India you know that. So.. The gist here is... Even if we took a heavy damage after the war... Pakistan will be wiped out completely. And talking about the guts to be sacrificed. We don't care. It will be a proud moment to die for a good cause then sitting in multistory buildings and talking about peace when our Countrymen are dying because of those with whom you are trying to portray as buddha. Time is over for peace. Jai hind 🇮🇳", "madhuja96": "@chatterjee_dhriti29 parle eta poris", "_.itsie": "Awesome....💯💯", "nibhahaha_": "Hii so I don't generally comment but this time I thought I should do .Well a disclaimer this is not a hate comment just writing down what I feel.So yesterday when I saw this post I thought that this just makes sense ,you know its not logical to shed more lives for avenge but then after contemplating I realized it doesn't. Now here's a short question for everyone reading this comment ,would any amount of money or a job be a substitute for your family members,would you mallika die for someone else ,no you wouldn't and I don't really know if anyone of us could do that.Have you ever gone through the pain where your father says I will call you back but couldn't because he died,the soldiers who died had small kids who don't even realize what they have lost, these come from poor families so does that makes their less important than yours and mine ,no it doesn't,they are brave ,they have balls to die for people who don't even care about them.I'm 18 years old ,independent,but still cannot imagine losing any of my family member.I literally have tears in my eyes while writing this down because I know the pain,everyday I go through every possible news channel to be assure that we don't lose anymore soldiers but unfortunately it continues ,I don't say that war is the only solution but I feel fighting back, making sure that thus doesn't happens in future is important ... That's all I have to say and yes the josh is still high and will always be..✌✌✌❤", "ashishpatil_17": "@mallikadua Sala log aajkal kaam Karke famous nai hote..toh .chalo AntiNational banjao...jaldi famous ho jayenge.....😂.. madam No one wants war but daru peena chod do jab hosh me aaougi na...tab Jake dekhna... Jo log defence me jate hai..kitni mehanat Karke jate hai....kya woh war Karne jate hai ? Woh bhi Acha future aur prosperity ke liye jate hai..kyoki woh Jada tar gareeb ya middle class family ke hote.....tum Jaise...baap ki kamai pe nai hote.. aur Nahi...logo ke Samne bakwas Karke paise kamate.......wo respect ke thodese paise kamate hai.........kya yeh sil sila aisa hi chalta rahega ? Tum aiyashi karo..daru piyo...aur yaha gareeb log hi desh ki rakhwali kare aur mare ? ...waise tum Jaise log Gali khane layak Kam karte ho...but log itne ghinaone ho ki Gali bhi Kam pad jaye........people are talking about war because they want to end this terrorisom permanently..to live a peaceful life. (And All the victim countries are supporting for this)...Iska MATLAB aap ek matlabi Insan ho isliye Kisi soldier ki wife ki post dalke apni bujhdilli mat dikhao. 🔥", "pree_free": "We need to spread these words🙌", "thenameishunny": "Pakistan walo ne likh diya KY....ye lines... Muh fadne s pahle thoda soch to liya kro N to kashmir ki ek ticket krao ur ghum k aao Zara.... Zinda lauti to Dalna phr post KY halat h Waha ✌️", "jemesbond.singh66": "Iska to yahi matlab hua k wo hamare jawano ko maarte Rahe aur ham sirf peaceful talks k liye unhe bulaate Rahe.. Gajab mam. Gajab. I'm with my gov. as well as with my army and so the nation is. And by the way y jung Indian army n shuru nhi ki hai.", "raypab": "baith ke bhokaaal chodna asan hai...", "tayyabkhan5609": "Hame to lagta hai koi politics leader ne hi karvaya hai ye sub kyuki pakistan ki itni himmat kab se hogayi ki india par attack karne laga, think before you read.", "iusmanmani": "War is not solution someone beautifully defined hats of to her and the people who understand it and have positive thoughts. 👌👌👍", "pankaj_saini_music": "😡😡😡😠😠😠😠😡😡😡😡😠😡😡", "chirag.joshi": "Truee that 🙌🙌👍", "vikash_575": "Terrorism has religion and that is Islam", "manishmehtamak": "👍👍👍", "rishitasultania": "At least some people are talking sense", "__karan__bisht__": "I came here after i saw ur video......i respect the opinion of that brave hearted wife.....but not that u said in your video", "alpha_sierra_29": "I disagree here. A soldier has a family, but his duty towards the nation comes first and you know what Josh is? Josh is when the soldier/officer dies and after years his son/daughter joins the armed forces. That's the Josh. It ain't always about some movie or a game. The Army will do what needs to be done. There are better people than me and you. So rather than fighting with people who have different opinion than yours you should just support the family of the martyrs or do something for the country which can be anything. If you can't do anything, don't do anything but don't fight against one another.", "maaaaaansiii_12": "Huge respect🙌🙌🙌🙏", "lo.ve6x": "Instagram pe likh dena bohot asan hota hai aise.. but jb khud ke family members jaenge tb inko gusse ka andaza lagega....or ek chiz or..agr apke family members ko koi mare or ek ek krke sbke family ko destroy kre..to ap jakr bat krengi un darindo se or ye kahengi qa ki ap mt mariye qki hmlog smjhote ke liye taiyar hain....or madam army ko koi war ke liye nhi bheja hai abhi..wo khud gusse me hain or revenge lena chahte hain..qki unka koi apna mara gya..or hr bar mrta hai...or wo log shanti banaye rakhte hain fir bhi...", "sagar161678": "Urban Naxals and Anti National spotted😂😂😂", "mankeerat.singhh": "@apeksha__gopale", "shubhamkumar8875280": "I saw ur video on YouTube.. .. https://youtu.be/tbvLQDKuypA that was the link ... I just want to say that there is difference between the people who died with poverty and the fighter who died for to save our country our proud ... I have no ideas u will see thiz comment or not ... My father iz in indian army ... In thiz post that lady sayz very correct information.... Only soilders family can realize that ...when my father sent by commander in URI attack... Only we can feel that fear ... But in video there were some points that were incorrect plzz make a simple apology for that ... U achieved ur success but plzz for our nation plzz mam @mallikadua", "sutanu_mondal22": "ok we will not have the war par usse hamare soldiers marna band ho jayege kya ???? i mean we are not in war toh yoh soldiers kyu mar gaye ??", "atal_singh_17": "This post is sense less 😠", "yuvraj2409": "@mallikadua moti tu to bilkul pagal h", "shubh0145": "@mallikadua Then whats the permanent solution of our soldier’s death???? Do you have any count of how many soldiers have died after the kargil war?? Ans is 2200-2500 And how many died in kargil war ?? Ans is 530.. So please we dont want our armies to die in cowardly attack of those terrorists . Dieng in fighting is another case n getting killed while sleeping is another case.", "pyrated_engineer": "Koi samjhao iss bewkoof ko k ek jawaan Jo desh k liye jaan deta h uski life ki keemat Baki logo se kai adhik hoti h.. so please not to compare with those people who dies everyday.. #bewkoofAurat", "its_pranav1511": "🔥🔥", "voldemort004": "India is also a nuclear power.. and they don't realise the distance of Islamabad from India.. don't act like a coward.. if you are such pro peace, then go teach Pakistan not to initiate such conditions.. humne to kuch kiya bhi nahi.. fir humko war ke against kyu gyan baant rahi hai tu.. gyan dena hai to Pakistan me jaake masood azhar ko de.. yes you're right.. aisi situations me chote mote attacks se kuch nahi hoga.. Jab tumour badh jaata hai, to uske liye dawai nahi li jaati.. tumour ko hi nikaal dena padta hai.. so there are many tumours which need to be eliminated both outside and inside of India.. they are more dangerous than cancer.. I hope you got my references right.", "its_spunkey": "Phle army walo ki izzat krna to sikh lo madam, faltu ka gyaan baad me chodna", "snuggle0._.0bear": "This is correct.. But this has nothing to do with your shitty disrespectful posts which u posted earlier!! Btw u look like a moron when u try to act funny!", "nishantsharda": "This line \"how's the Josh\" gives goosebumps, it can pump up any cadet at NDA to carry out wonders during his training. But that's a different thing. Now I see this line being used everywhere ever since URI released. And to make matters worse the unfortunate incident where we lost 40 bravehearts took place. Right now the sentiments are high, I won't call it Josh. Because we as a country are high on emotions as always, that's how we are tuned for some weird reason. We get emotional too soon and then we act out of our emotions. The prime minister knows that, and to cash on this \"opportunity\" he said that \"unhone bahot badi galti kardi hai\". My dear fellow countrymen, do not get so hyper by these words of our PM. doesn't mean we are going to war. He said it because he knows what the janta wants. War is not the solution. And do you think we don't retaliate to such incidents? We do! Every single day men die who you are not even aware about. their deaths are not known to you, but every single day a soldier dies at the line of duty. So don't think even for a second that the country is coward and that we need to take action. As far as actions are concerned, that would be at the right time at the right place. But that's not for us to decide, for the sentimental public. So keep ur emotions in check. Kashmir issue has only a political solution. There is no military solution for that. So let's wait for the day when our dear politicians decide to come up with a solution and the army can be utilised for something better.", "gul.kazi": "Finally something that makes sense!! Thanks @mallikadua for sharing!!", "nuzeefa": "@sarah_21091", "_medha_01": "@krsnas.dasi read the comments", "adi_bubna": "Well , TBH I don't totally agree with your post. I agree that going for full fledged battlefield war is a stupid option and should not be pursued. However , I think it is time we go on a psychological war with Pakistan. One which involves humiliation , economic pressure,inflicting fear among other things. Nobody in the 'citizen' category of both countries want War. But if the head of the ARMY of the ENEMY NATION is motivated to go for a WAR we atleast have to let him know....that if need be we will do it. And to answer your doubt whether we will opt to go to the battlefield if necessary....let me tell you one thing.... इस नंगी देश भक्ति के ऊपर भी है कुछ लोग ऐसे , जो बुलावा आने पर, लड़ जायेंगे जायेंगे और जरूरत पड़ी तो मर भी जाएंगे।", "thakur_abhiflame": "@mallikadua ji ap he bta do kya kre 47 se kr toh rhe Hai peace kya Mila daily goli aur LOC pr jaanti bhi ho kya Hota Hai ... Aur rhi bt Josh ki hum jnte Hai ki laughter challenge m jb Akshay sir ne apko Jo Bola tha ap toh Pura social media le kr kaise tuut pdi thi unnpr... Yha toh daily Javan martyr ho rhe Hai... Toh yha toh ap he btao kya kre", "mansimanisingh": "Indian army is 4th strongest army in world and they have courage to fight against Pakistan", "dudenitx": "Thats is true ... It stilk is a pain for families of army .. but here I .. surrender myself for the pride.of my nation.. i nevr won any pubg osr counter strike game.. but i here is ready to serve my brother hood that stays in siachen.. and i wanna be theee . Its only luck that people like me dont hava the luck to do so ..", "rajkumarprem60": "or bc bhut bd bda rhi h", "wrenchhead1996": "Pkmkb", "_m_arvind": "Please do take example of major Govind Singh chandpuri. Maybe that will refresh the old memories.", "its_hardev_chaudhary": "kis army wyf ki bt kr rhi ho tm. hdd hi hogyi yrr maine cmnts pde jo mc kisi garib ki choti si glti hone pr 50 galiyan deta h vo mc ye kh rha h hm apne 50 javan mrwakr chup bath jaye kyu unki family sa koi nhi hota na jinki family n ek hi beta hota h ar us beta ka srf 4 tukda ghr ata h usse pucho jakr bdla lena h ya nhii phla isne kha ki roj mrna ka kam h unka ab deshbhakti ka certificate da rhi h itni hi deshbhakti h to jao 2 din bita kr to aa jammu nd kashmir m meri family m 3 h army h ar hm marna ka liye tayar h jhukna ka liye nhii tmna bekdiya hoga apna iman hmna nhii", "kunalsingh629": "Teri maa ki chut mulli", "neha._.bhatiya": "it was needed👍 good one🙏✌", "imsanchit07": "Daar gayi kya?? We Indian youth are not coward...", "tejasambare": "This is the real 🔥", "dheerajchamoli": "@mallikadua to kya karre jhelte rhe eshe cowardly attack", "chaubey_ji_ka_ladla": "@mallikadua war is never a solution but Pakistan must be taught a good lesson here", "sansalht": "You are the most sensible artist EVER! Love u and more power to u!!!", "jabarsingh_pld": "भाइयों और बहनों ये लड़की वामपंथी नक्सली आंतकी जर्नलिस्ट द वायर के संपादक विनोद दुआ की बेटी है एक आंतकी नक्सली समर्थक से आप क्या उम्मीद कर सकते है ये भी jnu आंतकी टुकड़ा टुकड़ा गेंग की सदस्य है इसको ज्यादा तवज्जो मत दो विनोद दुआ की प्रोफाइल देख इसकी पूरी जन्म कुंडली समझ मे आ जाएंगी ये मॉडर्न नए जमाने की लड़की होने का नाटक करती है लेकिन ये है एक आंतक नक्सली पाक समर्थक की एक बेटी है इसको ब्लॉक कर दो जय हिंद जय भारत", "nandini20": "Respect", "bhooot": "@______harry_________ you should definately read this. Perhaps changes your thoughts.", "suresh44.sahu": "U r just an asshole", "storyteller1803": "👌🏻", "kajol.arora": "@anmolsumbli As we discussed, the implications of going on war!", "punya_bhumi_bharat": "Just one word #coward", "zooshaikh": "@rohan_05", "bhartigehani": "@renukapamnanivaswani", "asgar_sultaan": "This make sense now, not just a post or an abusive hashtag makes you a nation lover grow up memers", "sameena_ayub": "Very Well Said..", "keshav_mall": "@doshivirti", "cancerian_29": "we also dont want to war against India, guys we are humble and peaceful people, if we do that its the loss for the both countries, please try to understand that whatever just happened our Pakistani Army is not involved in that in any case. This is the single post i have seen that make sense, nobody would be happy with war. I deeply concern for the martyrs of India who sacrifice their lives may ALLAH rest their souls in peace and give suffer to their families, you guys have to support them instead of saying shit about pakistan, i repeat WE ARE PEACE LOVERS WE DONT WANT WAR, but if anyone says something bad about our country or religion we won’t do any kind of sacrifice just remember that! otherwise, there are so many terror attacks which has been placed in Pakistan but we never blamed India for that, Terrorists have no religion, they dont belong to a country or any state, they just want to destroy the happily nations so please guys instead of being ignorant you have to be strong enough to support them. SYMPATHY FROM PAKISTAN 💕", "i_ravindra_singh_": "One slap from my side on your dirty mouth fool lady 😠😠", "rudratheofficial": "I don't belong to a defence family or don't have anyone who is in army but still I can make you assure that my Josh is still high .. I know the consequences of war are so bad and I totally agree with what you're saying about the war, but again if you can convince the government to remove the restriction of joining army, then I would gladly join it .. having eyesight weakness is a major problem for me .. and I'd love to die for my country rather than commenting on a facebook post ... 🙌 Jai Jawan jai hind ❤️", "fatimauzamed": "@mallikadua I am from Pakistan and I love you for bringing this through. Thankyou 🙏🌹❤️", "strikersufi": "@mallikadua you are absolutely right dear, the warfare can take India, 10 years behind in means of economy, and growth of the Country, 😘👌", "_no.bi.ta_": "I'm also a defence kid but one thing i shocking thing which i've noticed in the few years are that only Indian soldiers are dying even when we are talking about peace! Price for the peace will always be paid by soldiers not by you so called slutty peoples! If we have to die then we must die fighting not like coward gandhi and his followers! Hence, Proved! 💕", "s.b.arnale_mahakal": "बहिनचोत फौज के खिलाफ कुछ बोलगी तो गांड मे लंड डाल डेंगे . Sali kya bolti hai unke liye apni khushiya q nhi manaye .. abe sali unke bajase tu mehfuj hai .. nhi to tera koi rape kr ke katl kr deta ... I proud indian army and indian police ... Jai hind vande matram....", "gaur_rhl": "We gotta fix our own shot. Our own country instead of blatantly blaming Pakistan the moment something happens! Kashmir is our problem and let’s take ownership. Our intelligence services failed. Fight terrorism. Not Pakistan!", "sswwaappnnaa": "you have already showed everyone what your mentality is with your IGTV video. these lines, written by someone other than you, truly make sense but i’m sorry, re-posting this wasn’t enough to cover up what you spoke in your video. since you shared this, it now makes you an anti-nationalist as per the definition you taught your followers.", "sanatan.dharma_": "👏👏👏grt ..we don't war but justice ...40+ killed now ,taj attack etc ....jaish e mohammad 's chief masood is still living in pak after taking the responsibility for this attack ....no actions taken ...instead he is provided with more security ...who is providing it ? ...the whole pok is a terrorist base camp ...destroying it won't harm ...n yss go n watch the outrage outside ppl want justice not war ...they killed innocent ones ..we will kill the terrorists ...how is it wrong ....every one who has got that limelight comes up with these kind of posts👏👏...shame!! Wht do u guys want we will join our hands n stand in front of the terrorists ...srsly ...want us to talk ...why should we talk to the terrorists ...everyday the future terrorists throw stones at our army men they keep quiet ..pelters insult them,evn kick them n our army tolerates ...its high time we answer ....n every indian wants justice ..yss we are hyper nationalist ...we want justice n they will die ...go n meet the family of those who died ....come out of your hypocrisy ..n this love for pak ...how grt it is tht u guys live in india ,earn here ,get so much love here but u have a concern for pak n not india ....shame for us that u guys exist 😢.. Anti nationals", "s.narsaria": "This just made a huge difference in the High Josh phase of India. Goosebumps⭐️", "abhilara": "Lagta hai Pakistan govt ne aapko bataya ki unke paas kitne nuclear weapons hai aur woh kitne powerful hai😅", "koyalsinha": "🙌🙌🙌🙌🙌", "nidhithaker11": "Much needed! 🙌 🙌", "mr_ironic_": "We have already seen too many of our people deceased... U think our Josh's a joke? Our indian soldiers want revenge...we seek that too... Send us if u may as troops , we would prove ourselves none less than a soldier ( not comparing ourselves to them tho) . Some may have a temporary josh... But other's do not. Country men are ready to fight for them, and we shall if we have the opportunity to, now. People like you might take their ridicules as jokes and sit behind a safe house and give a good speech as liberals.", "anas.husain2": "Respect+ 💯", "crazy_me52": "Mam plzzz delete this post.", "__amayra__0": "huge respect🙏🙏🙏", "pushpendra_mishraaa": "Her every word has a mean, she knows how to calm with a high josh!", "shant_a_nu": ",", "mayankkrishnaa": "@vickykaushal09 ko abhi dekhogi to how's the josh chillane lagooge !how's the josh is just a fkng phrase usko itnaa badaa issue mat banao", "sheissupernovaa_": "So after saying log Roz marrte hain there's no point in grievance, you do this? Hadd hai. I ain't your fan anymore.", "kind_is_my_middle_name": "Ab bhi jo khoon na khaula, vo khoon nahi vo pani h, jo desh ke kaam na bekaar vo jawani h....", "virender99990": "@mallikadua Don't use your brain mam...Our forces know what to do, when to do and how to do ...glad you prefer peace ...but do not except this from other side ...We know our enemies ...I do not thing that I have to give proofs of this....we all prefer peace ...but what if our army march", "sadia_azhar_nawaz": "As a Pakistani, i completely agree. The loss of life from a war is something neither of us should be encouraging.", "topspeed221": "Next time when a robbery happen in your home please don't attack him or call cops for the help ....just let him go .... because it can waste time of yours and cops....what if he would be carrying gun ...tb toh ...ek do police wale v saheed hojaynge ....so they must not try to catch him instead of that ..they should leave him free .... because everyone got a right to choose...this is what she want to say", "ashishpuma": "Wow! Shit post!💯", "asnaaleem": "Completely agree!!!", "cocomokapacket": "@hassnainabdurrehman", "insiyadewan": "Glad to see some sensible people still awake on the Indian side as well , people who understand the inestimable and inevitable loss of lives, destruction of economies, and the dent which a war will leave on the hearts and souls of countless humans on both sides. Relieved to see that there are still some rational people out there who know that this is suicide for both nations (quoted by Imran Khan)", "girish_dhanawde": "ये #टिकटोक वाली #इंस्टा वाली लड़कियां अपनी दुनिया मे ऐसे मस्त रहती है की इनके वीडियो देखकर लगता है कि ये अपने आपकी और अपने बाप की कभी नही मानती होगी, जैसे वो मानो वो इस दुनिया की है ही नही बल्कि किसी परग्रह की वासी हो ◆एलियन हो, इनको देश मे कितना आक्रोश है, देश मे क्या चल रहा है, कितना खतरा है उससे कुछ लेना देना नही, उससे कुछ फर्क नही पड़ता, इनका तो बस वीडियो 2 घंटा भी अपलोड होनेसे रुकना नही चाहिए, जैसे पाकिस्तान से ही वीडियो रिलीज करती हो, इनकी ऐसी हरक़तोंपर अगर कोई सवाल खड़ा करे तो ये उसे तपाकसे \"ऐसे तो रोज मरते है\", ऐसा संवेदनहीन, बेशर्मिसे भरा जवाब भी दे देती है, बात दरसल ये है जो भाई शाहिद हुए है ना उनमें कोई इनका सगा, कोई रिश्तेदार शहीद होता नही है ना, इनपर व्यक्तिगत कोई आंच नही आई है ना, तो ये बेशर्म लडकिया उन शहीदों के परिवारोंका और देश का दर्द क्या समझेंगी वर्ना ऐसा बर्ताव, ऐसी नैतिकता कमसे कम हिंदुस्तान गम में डूबा होने पर तो नही दिखाती, कुछ देर तो चुप बैठती, इनको ये समझ नही की हमारी सेना है इसलिए हम सुरक्षित है और टिकटोक बना रहे है। (इनको सपना चौधरिसे कुछ सीखना चाहिए)", "enchanting_lassie": "🙌🙌🙌🙌🙌🙌", "pavangotur": "@sagarnayak__ read this le 😍", "miaannabeel": "Finally read some sensible thing after pulwama attack, I was wondering ke bhai 1 billion awam mein koi ek banda bi aisa nahi ke jisko samjh aa rahi ho ke apk apny politicians hi sab karwa rahay, but finally hain kuch samajhdar abi.", "pausebuttonoflife": "@ayaazsyed90", "smashiwal": "This is an article by Punnag sinha. I don't know who did you get this verification from. check his wall.", "mayurs_789": "Omfg! This mallikadua is fucking creep!! Using a Fake name to play safe side?? Listen Fat Bitch! When it is about supporting nation, it can be done via any medium! It doesn’t have to be You standing on the border. When our Soldiers know that we are with them, it gives them hell lot of power to fight them. They are fighting everyday to protect us, all they want you to support them, thats it... and thats all we are doing... you want us to be silent? We cant go to the border so we cant even put our thoughts out?? 130 crores people when move a step forward, country moves 130 steps forward ... At least we are still using social media to support India.... You on the other hand, cant go to border, nor you’ll put anything positive!! Idiot! What else can we expect from a daughter of a corrupt man! 😒", "aeejayyy": "There was a time when we were in school in which we had group of friends. one day in our group one of our member got beaten really hard from some bunch of people of another group. so when this happened to our member, we were like \"Chal bhai aaj toh unlogo ko zinda zamin me gaad denge\" but we didn't mean it ofcourse and when we reached their, thr was just some small fight and Everyone on that enemy group got to know our power and if someone touches our group member we are not going to be silent. so this is non the less same thing here. its the same feeling of every indian who are in extreme grief and fullbof emotions because of this situation. and you can't oppose the genuine feeling of Indian citizen. we know war is not a option but we will have to show them the power. the jawan of this country are in anger and they are proud to die for this country. we have to take revenge. you don't have to show indians the negatives of going into war. everyone knows it. India is trying to maintain peace since long time but now it has crossed every limit. its time to show them the power so that they keep quiet. you must respect the feelings of every citizen. obviously no one wants war but peace with some reaction.", "bosslady_ember": "Agreed... Just how bad every Indian wants to avenge this gruesome attack we must not forget the repercussions. I am sure our military and govt is doing their best to do what needs to be done at a national level. However as a citizen we must contribute in keeping our nation strong from within! How is a question!", "aps0141": "Amazing", "aarsh_thakker": "How's the bullshit..? At its best sir ...", "sudarshangopinathan": "You're father is a rapist (#believewomen) and you're a liar. This post wasn't written by a Army wife. Even if it is. Her husband must be ashamed of her. Military families aren't full of anti national pussies like the fucks in this comment section. Also you're total trash. Sick to Modi bashing skank", "gul_posh": "Yup I agree... keep the hosh until you feel the josh AGAIN!", "anushreejonko": "@jagjit_khokhar @dr.ashcraycrayy @teennivedita", "itsdevanshu": "Desh ase chutiyaon se hi preshan hai 😒", "jitendarkundnani": "🖕", "ankitn20": "If war will happen we civilizations will die too...we r aware of that and we r ready to die..we cannot just sit and see our soldiers die every day without even fighting..milke marenge naa hum kya dikkat hai...jai hind ...jai bharat🙏", "prince._.rai": "People need to read this. So called social media patriotism people need to read this. Josh is high but above josh there should be brain & people need to use it. #joshishighbutwithbrain", "the_page_has_no_name": "🙌🙌🙌", "abhishekyadav22": "Ye Kya chutiyo wali baate h ... Pakistan nuclear nation h to hum bhi nuclear nation h... Rhi baat china ki to kya china ka investment sirf pakistan m h ? Bharat ka pura electronic market china ka h.. jitna china ne pakistan m invest kar rakha usse jyada wo india se kama k leke jaate h.. aap bas itna socho agar pakistan ne pehle nuclear bomb ka istemaal kiya to kya aapko ye lagta h ki pakistan naam ka desh duniya m bachega ? Pakistan ne pehle nuclear weapon use kiya to duniya ki koi takat pakistan ko khatam hone se nhi bacha payegi koi desh pakistan k saath khada nhi hoga .. jab bharat aur pak ki ladai hogi to us samay iran Afghan jo khud pak se preshan h wo india k paale m honge ... America india k paale m hoga russia 1971 m bhi pro india tha wo bhi india k saath hoga.. duniya ka koi desh pakistan k saath khada nhi hoga muslim country bhi bharat k khilaaf jaake pakistan ka support karne ki himmat nhi karengi ...", "dan.janvi": "AGREED", "twi_t": "This post is plagiarized. The original post was written by @punnagsinha . Please do the needful.", "harishbhadana21": "@mallikadua ran*di ha tu kutiya khi ki", "inforstyle": "♥️♥️♥️", "abhamattoo": "This❣️", "sushil_roxs": "@mallikadua madam, I used to enjoy your post, was a huge fan and laugh on those. But this one doesn't goes down well though.👎you are so scared that Pakistan will do this Pakistan will do that. Bullshit. Madam, please some research on Indian Army too. You will know the capabilities Indian defense. Let people express their emotions, this is one thing people connect more. be it nationalism. Apni hi desh ka soch rahe he na? Koi burai nai he inme. Chill.", "oyebillo": "well written.. respect 🙏🏻", "kaushik_9695": "Thats it... There u are... Nor do u once can stand wid our security forces wen they need us the most. Yes I agree that an eye for an eye will make the whole world blind but maam we cant juss sit idle and count martyrs after being so kind. What havent we done for that shit of a nation. We hve bolstered their trade... We hve provided them water for irrigating their lands and in return they are irrigating fuckin militants and unleashing them on us... If u r not getting this then let me put it in ur finite mind maam. We are and we have been in war wid those bastards since 1947. This is nthn less than an asymmetrical war situation. And yes yeh jo bade bade questions kiye h naa apne about our so called josh... Its because of that josh u r breathing free air. Dont doubt our patriotism, dnt dare to. U might b a frightened doll. We arent. We belong to the land of shahid Bhagat singh, Rajguru, Netaji, Chandrashekhar azad etc etc etc. So jus keep ur negative crap upto urslf. N yes U r worried about our lives naa that wat ll we do if pak nuke us. We ll stand here n die, understood. U may go to switzerland,its nuke prone. N yeah take ur dad too... @mallikadua @ishaan95 @janhvikapoor ... I use too like u too... But aftr dis u lost it guys... Disgusted by ur calmness...", "aastha351995": "Superb", "tvishwassingh_": "#pkmkb", "shree_debo": "I am also not in favour of war.But we Indians are not fools that if Pakistan launches any missile we will stay quiet.Nor our army is.The josh and Hosh of our army will remain high forever.Regarding your comments mam India is having the power to destroy the neighbouring country within a second because they are keeping such pets in their nest who just know how to backstab.Thats what they know.Just because of fear of death Indians cannot withdraw their Josh.Army and army members are strong.All the Indians are with them.The Josh will always remain high.Jai Hind🇾🇪🇾🇪🇾🇪", "karvigupta": "@mallikadua you should clear your mind first that whether war is going to happen or not. And if a family member of yours ever being killed by those militants, post this again. With your Josh high, with no feeling of revenge at all. Coz you have got this big heart. And anyone could easily come, shatter your family into trash and you still stand for the culprits coz they are nuclear powered nationalists. War is an uncertainty. But at least you could do right now is just stop posting such terrific posts that let down the heads of those who follow you for your funny accent not your lack of knowledge. @_singhsumedha I can feel your anger here.", "shreeeyaaa__": "I don't think people really understand that if today 40 soldiers were killed, a WAR which you so naively claim to declare, is going to affect, I don't know, 40,000 or even more people. A country or a religion is not to be blamed for terrorism. Terrorism exists everywhere in the world, among all faiths and all religions. So yeah, \"avenging\" deaths doesn't make you any better than the terrorists themselves. Death is death, killing is killing, and war is war, no matter which countries battle it out", "shashanksingh92": "I knw war is not a solution but such post from army wife is astounding...i wouldnt let her post such crap if I was her husbnd......army wives r never afraid...if pakistan is a nuclear state...we haven’t kept ours for Diwali....they are an uncouth,illiterate bunch who wudnt bomb us knowing that they will b killed too...and dont any of yu pseudo intellectuals calling me a keyboard warrior quote me on this as I serve in the navy myself and I am not afraid to kill them. Bloody choots yu ,ur dad and ur PR team is.", "theuserchangedaccounts": "Agreed", "queen__krutika": "Shame on you girl", "00mona0lisa": "Mam you r really shit women.", "juhi_raja": "So do 1 thing why don't you go and make some peaceful agreement with Pakistan if war is not a solution😏😏😏", "thisissk07": "This post is correct but what you posted wasn't . I hope you understood the difference although I guess you haven't . You said daily koi marta h ye wo. Sometimes har baat par opinion dena backfire kr jata h .", "_i_m_s_r__": "i think we haven't declared war and by our suggestion indian army is not going to decide whether to have war or not.. and by the way you guys kept on writing HOWS THE JOSH so please note the its not a filmy dialogue if you dont know please do some research its not from the movie only... people like you came to knw abt this from a movie... defence is much more sensible and intelligent thn us guys.. if you think u r more sensible then what are you doing here... so stop doing such and criticising... this time is to reunite not to criticize... and FYI if u have heard the news there is a line spoken by PM that they have given full freedom to our army jawaans ... its very hard to loose a brother with whom you spend some special tym of your life..... so stop these things... and one more thing our defence is more stronger thn the rivals..", "daddy_996": "Itna hi awareness janti ho to politics me utro aur sudharo sezh ko ya fir apne kisi ko bhejo army mei. Ye AC room me baith ke dusro ki vakaalat krnaa asaan hai 😂😂😂", "__amitsharma___": "🖕🖕🖕🖕niklll", "rivakaur17": "@smriti_arora96 Read this once", "mynaivehope": "This post is justified, your comparison of a soldiers life to a person who is in depression probably because of his own personal reasons is not justified. That soldier didn't die because of his own personal or family depression, his poverty, his friend circle or any other reason. He lost his life protecting us. Comparison toh theek se karo madam.", "gyanprgya": "Is it really like that? Desperate time needs desperate measure. Isint it necessary to strike fear in the hearts of the people who wage proxy war against our nation? Sense have its own sense but sometime a nation has to prove/show what is to mess with it. Anybody who's supporting this and talking about cost of war and pakistan also not wanting a war with india can tell-1.why a nation keeps an army and spent a big chunk of its resources to maintain it, just to showcase a parade every now and then? n2. If pakistan do not want a war with India why is it indulged in proxy war with India? What was Kargil then? Sitting in ur cosy houses, sipping your coffee, u can think yourself as an intellectual, above the so common people, having very sensible liberal ideas, but you cant feel the pain the nation has to bear. Lastly whoever posted and second this, i ask u very clear question. Do u think that any retaliatory action should be done or not?", "saintbleu": "Amazing", "thegirlwiththebigtooth": "@pessimistic_pasta this", "hitesh_isharwal": "#pkmkb", "satendra_sangeet1": "Ek patni ki chinta swabhaavik hai.... Lekin unkey pati Ka kya kehna hai kripya yeh BHI batayein??jab bagal waale ko goli lagti hai toh unko Kaisa Lagta Hoga yeh Woh hi BATA saktey Hain..... aur Jo BHI soldiers shaheed huye hain.... Woh koi Pakistan me shaheed Nahi huye hain... Woh hamaari zameen thi.... Hindustan me hamla hua unkey upar..... Soldiers aapse pehley shaanti chahtey Hain par Woh kya maar khaatey rahengey hamesha..... Aur government me koi war declare Nahi Kiya hai.... Bas itna Kaha hai ke army ko khuli chhut hai Woh faisla le saktey Hain ke Woh kya Karna chahtey Hain kyunki ladna unko hi hai sarkaar ko Nahi..... Aur Jo BHI aapney Likha shayad aapkey pati aisa Nahi sochtey hongey isiliye Woh army me Hain.....aur Jo BHI shaanti ki BAAT Kar rahe Hain agar aaj army ne action Nahi liya toh shayad aagey action Lene Ka mouka hi na miley.... Aaj Kashmir hai kal poora Bharat desh changul me AA jaayega phir aap Ghar PE baith ke comment Nahi Kar paayegi ya toh aapko khud ladna padega aagey aakar ya intezaar Karna Hoga bomb girney Ka......", "sunita1712": "Plagiarism without shame. The real post is by a man, Punnag Sinha. https://m.facebook.com/story.php?story_fbid=2475769369134942&id=100001057107912", "blessedpahadan": "Je baat🔥 @art_cocoon_by_richa", "yoloarya": "Very well said!💯👌", "its_zamandz": "🙌", "vedic_warrior_": "It is irresponsibility at its height not to plan for the necessity of force in the face of real turmoils and enemies actually present in the world. No talk of peace, justice, truth, or virtue is complete without a clear understanding that certain individuals, movements, and nations must be met with measured force, however much we might prefer to deal with them peacefully or pleasantly. Without force, many will not talk seriously at all, and some not even then. Human, moral, and economic problems are greater today for the failure to use it when necessary. Further more, International interference is bound to happen if India takes on pakistan. Agenda is to crush any terrorist- supportive government in any way possible- force or by economy. War may not be the answer but it will make a difference. How’s the Josh? Still high, Sir. @ mallikadua", "md___afnan": "That's what we people need to understand instead of keeping our josh high🙄🙄", "hemjain42": "मुझको मत छेड़ो yaaron Ma meri आज घायल हुई है  कारवाँ बना कहरवाँ पूतों के टुकड़े बटोर रही है  Duty का बहाना कर चले गए  झूठों को फटकार रही है  पढ़ा करो chalisa चालीसों ko सिखा रही है  Ya quran ki आयत  फ़र्क कोई नही है  नाम ho जैसा कर्म ho वैसा  Ma ki एक उम्मीद यही है  Ram ho Rahim ho ya Mohammad  कत्लेआम उचित नहीं है  धमाके हों तो हों खुशी के  वीरों की बलि अच्छी नहीं है  यह भूमि है वीर वीरांगनाओं की  कायरों की मिट्टी नहीं है  हो गई है ऐलाने जंग Pulwama ki आग फैल गई है  Ram Shyam Ramesh के बदले  Faiz Abdul Imran गिरेंगे  सिंचेगी घरती जवान खून से  माँऐं फिर रोऐंगी  एक लकीर के आर-पार की लड़ाई  कई छातियांँ भेदेगी बच्चों को जन्म देने वाले ही  उनके मुंह की रोटी छीनेंगे गोले बारूद की झमाझम वर्षा  आसमान में गूंजेगी खुदा भी अपनी भूल खुदाई  ईसा मसीह से पूछेंगे  क्यों रे भगवन्  क्या तेरे मन में समाई काहे को तूने दुनिया बनाई", "wasimhussainmir": "Shukran @mallikadua , finally found some brains on Instagram!", "vaishnavi_rk": "Glad that Mrs.Ganguly wrote this. Being an Army kid I can understand how we go through when someone says war. War is never a solution and the people who have never been/seen any war (than in video games) will never understand the what is the actual price a soldier or his family pays for the war.", "khusi_sahu": "👏👏👏👏👏", "shubhu_kothari": "Shut the fuck up bitch", "letwordsdothetalking": "❣️❣️❣️", "mamtathakur007": "@chadha__prashant", "__san.12": "🙌", "mr_._.nick": "How's the josh.. mam yes very high ..! Atleast tm jse pakistan k dalllo se kaafi high ..! Hmare desh ko bchane k lie jo b jruri hoga wo krenge..!!, Chicken dinner chorddiye ma'am terrorist dinner hoga seedhe..!! Kaash bhagwaan jo b hmare jawan saheed hue h usme se koi apka family ka hota toh tb m dkhta apka how's the josh wla post..! Or agr yeh army wife ne likha h.. toh apne saheed k father ka video b dkha hoga jisme wo bolre h ki chahe kuch b ho jaye..! Pr pakistan nahi bachna chahiye! Or mjhe hmare jawano ka badla chahiye..!! Toh wha bethke bdi bdi post krri ho..!! Thodi c b sharm ho toh doob maro chullu bhr paani mai @mallikadua.. ... Bharat ki wafaadar janta hmesha bharat ki army or bharat k sath hai..!", "harsh_jadoun1998": "Ek naachne waali or stage p naatak krne waali kisi k derd ko kya janegi wo ek maa baap bhai behan bete beti wife ka derd kya mehsus karegi jiske dharm m riste hi nahi hoti wo maama ki bhi wife bann jaati h or maama k bete ki bhi ye saari galti hindustani ki h jo aise insaano ko badawa dete h jinko shohrat pane k liye wo kisi bhi hadd tak jaa sakte h inme kya himmat jo desh se wafaadari kari inke to khoon me bhi gaddari h", "suf7577": "Thanks it was much needed Post", "kaurhub": "Sharingz", "ankita_2505": "🙌🙌", "umama_zaheer": "@iam.amreen atleast someone is talking sense 😪", "saherzeesha": "You are a sweetheart ♥️", "hepeacemaker": "Ok you're right Pakistan ki maa bhosda or tera bhi", "kushsanz": "@aditya.m98", "amit_sharma6757": "India army ke barre me", "rohitanand369": "Ohoooo, Modi needs to take tips from you and that Wife....Easier said than done. Your job is to make people laugh because you’re good at it....Let people like Modi who take better decisions for our country do or declare what they want to......After all...your stage is not Lok Sabha so don’t have a say at all...and please let the house wife know that instead of giving us such an insider news....go and pray that next time it’s not a known Indian jawan who is going through this torture....The pain makes you forget every logical reason...sitting in a fully furnished house commenting upon what’s logical..let’s see if the same can be done when you meet the martyr’s family.. #JaiHind #PKMKB", "thanishkaa_": "respect 🙏🙏🙏🙏🙏", "ishi_rawat_": "🙌🙌", "aint_your_goalss": "kbhi kbhi to dil krta ha surgical strike kr k chalwa he dein tm logon pr atom bomb pr phr insaniyat jaag jaati ha k wahan kch aese bhi log rehte hain jinke pas dimag ha aur wo har waqt negative nh sochte tm logon ki tarha", "iyoushhhhh_": "India pgl thodi ki war krega ! Surgical strike ki trh kuch surprise element dega Pakistan ko #PKMKB", "vhajgafsczczc": "👏👏👏", "collectorofjars": "@bhawna.jain.16100", "pallakaggarwal": "@uday.aggarwal.90", "ashishknarwal": "Teri maa aisi chodunga bhenkilodi", "irritating_bitch_": "🙌🙌🙌", "iam_vinithjain": "Respect 🙌👏", "____siddhant______": "If not war then how to fight terrorism? Give the solution not lecture. There are so many educated policy makers in India than you but they are also unable to solve this because Pakistan don't want to solve it with peace. What will you do?", "__ameyaa_": "Josh is still high ! 💯", "the__harjot": "Thank God, we still have some people in India who make sense", "bindaspawan": "Baseless completely baseless.... trust me... Unnecessary and waste of time...... U think we indians dont know that pakistan is nuclear powered country... aare madam... First let me clarify.... we do have josh... and we definitely want war but not against innocent Pakistani.. It's against terrorism ... its against desh drohi... its against bloody people who gave shelter to ds fucking terrorist... Posting this kinfof shit and thinking that \"aww how smart I'm bla bla bla\".... u r the dumbest person i have ever seen... aur kitna chup baithe be... kitna..... Fight to krna hi padega na.... even I'm from army background... and my brother is posted at jammu... so what.... we bloody want to finish this shit... and we Indians are not fool madam.. ur explanation seems foolish .. jai hind", "poojaaa.19": "Respect 🙏🙌", "kripi_mittal": "@piyush_818", "dhruthi.sagar": "Respect 🙌@aishwarya_vadiyar", "diya.g.roy": "Whatever point she has pointed out is seriously valid n we as countrymen have no rights to decide about a war but just a simple question.. If the mothers, wives and family members of our freedom fighters had raised the same question then we would not have been sitting here in independent India discussing the same topic... Ironically they were not been paid or got any kind of facilities as well", "anand_mohan_bhagat": "Nor War is the solution", "rhee_mars": "@savi.mars", "misterghosh": "You go girl ! ✨", "rohit_rana_sharry_rana": "She 's just bitch and her father also a anitnationalist . What did we except from her these bullshit lines . Fuck off her . All of us know the implications of war what you were trying to say .", "79ehtkm": "@humxa__ @shazlisyedda @_missdiyana @bavneetkaur2107", "yashaswis_": "Absolutely true!!👌 No problem with the people ,army,actors,singers from Pakistan . The problem is the prosperity and independence ,the so called nuclear power state offers to these terrorist groups .. they move like any other normal citizens. The rules imposed on them are not enough to control the terrorism. If we stop thinking about the Pakistan India wars, and think the terrorism as the ultimate unhuman act all together.. we realize Pakistan has been producing alot of these. The normal person ever now and then posts pictures with snippers and other guns, which cannot be defended by saying the act of self defense,as u won't need sniper with u to save urself... The government as well as security forces have failed miserably to fight against a terrorism in Pakistan and definitely gives a safer shelter to them, which ultimately harms them too. Evident by other terrorist attacks in Pakistan.. We are not enemies though.. the situation tempts to be in.. and the people of Pakistan and India ,both got to question Pakistan government over terrorism.. as if the Pakistan goes under such economic crises ,from where does these terrorist able to get such huge economic support!! Don't be a fool learn to act wisely on the country's problems🙏", "ankit.tripathi.104": "@_vibhor_tyagi", "bans212": "Well said", "_sapnapal_": "u deserve no respect shameless person ...... i like u but now i hate u....sorry bolo unn logo se jinki wajh se tum ho unko galliya dogye toh tum jese ko koe ni puchega kuki sab me talent hai ajkl. kya bakwas ki h video me ki tum jese log hote h jinko call kark pizza order krna ni ata toh kya sbk ghr me tu ye hi dekhti h kya . pagal aurat ab yeri video koe chutiya dekhega", "kulsumchoudharyy": "Finally someone is speaking some sense", "black_heart.91": "Ha per pegamber ka ma ka bosdaa🤣🤣🤣🤣", "urstrulygautam_2211": "@mallikadua Behan ki pakodi...agar tere ghar ka koi marta is blast me..to fr esa bol k dikha skti tu...comedy krti h na ac studio me baith k..to whi kr..ye sb deshbhakti ka dikhawa tmse na ho paega beta", "fathumfathum": "@minhajmir1", "madhav__08": "To aap kya chahte hn , jo ho rha h hone de ??", "dancingsoul_01": "💯🙌", "_vivekbarot": "👏🙌", "sdheeraj1404": "waah ye h vo log jo ghr ke andr khtra h...vo humre log maar rhe h vo dikkt ni wnha khush h ye sb lekin hum bol de ki ab bdla lnge to ftt jati h tm jaiso ki...bc pakistan pta ni kyu ni chle jate tm log", "mushee023": "👏👏🙌🙌🤲🤲", "naivedhya.piparde": "Article gave me a Jerk⚡.", "cdt_sierra.delta": "Logon ko Jano ki hi itni padi hai to kabhi Jana ki media influenced URI, pathankot and pulwama ke alawa Kahan kab aur kaun Marta hai.. tab ye discussion hoti hai? Kisi maa ne sahi kaha tha, \"tum mere bete ko na lete agar ek foot Kam ka hota, to mein ek foot Kam kad kaise sweekar Kar lun\". And for those who take pride in calling themselves FAUJI BRATS ... U ll only stay a beat and never a fauji kid. Tumlogon ke comments mein commonalities bataun Kya milengi, \"Josh\", \"my dad is in defence- which apparently gives more credibility in what shit blurt\". There are many I noticed have made it quite personal and against @mallikadua. Guys it's not abt getting personal and disliking someone when they put up their view.. if u do not take it with courtsey that u think ur views deserve.. u can't expect the same.. let's not make this abt who is who and how they are.. let's not take names ad just speak up what u want u.", "uzimandias_": "well said 💯💯💯", "souptikd10": "Hello maam, we the citizens of india are not proposing for our country to go to war against pakistan but if we don't do anything then what do u think will happen? Everybody will leave peacefully? No. This type of incident will happen again, if its not answered by India. Therefore, India must teach them a lesson so that they dont ever forget!", "ankita_tripathi20": "🙌🙌🙌🙌", "mahnoorbari.11": "💯💯", "bhavishatanna2": "❤️", "sim_grover": "Some really valid statements here! Everything makes sense. Thus, it’s in the best interest of everyone to stop venting out anger by constantly summoning to wage a war. Rather, means to contributing in possible ways to help the families of our brave martyrs must be brought to the forefront! We must talk about initiatives like that of Paytm wherein one can contribute and make a difference monetarily, little or whatsoever. Let’s do what we can and leave the rest onto our government since they’re capable enough to take a stand for the nation. #spreadtheword", "mahak_shukla26": "Bhot hard bhot hard", "uj9508": "We should make it mandatory that a non army able bodied adult should have army training of atleast 1 year", "aru_dhwaj": "Heard one ? now come to other..A martyrs daughter and a faujis wife. I know well how it is to be a wife of a soldier. After this dastardly attack happened, I said to my man, I am angered, anguish; aaj jo hua usky liye aaj har Indian apni jaan tak dene ko tyar hai! And He replied with all proud and anger, aur hum faujis atankwadiyo ki jaan lene ko tyar hain. Bus ek baar ishara mil jaye! That's what a soldier is. They love their nation more than anything and ya their Josh had always been High and will always be! A proud CAPF's Commandant Wife.", "ishayaseeen": "Finally a positive post, pls say NO to war and NO to hate! I am a Pakistani and we also don’t want war it will take so many lives and believe me Islam doesn’t support what those terrorists have done NO THATS NOT OUR ISLAM we want peace and no hate ❤️ Celebs making ajeeb comments are forgetting they have fans in our country too and once everything is normal (INSHAALLAH) kya reh jaiga un k mu per? 🤷🏻‍♀️ celebs have to teach this to everyone as everyone follws them in all trends so they have to teach their followers to say NO TO WAR NO TO HATE ❤️❤️ @mallikadua didi you the best 💋 P.S Total dhamal decision is fine with us. 😝", "ivinod1996": "The people who died recently were not at the war . After few months such thing will happen again ,and you people will again post you condolences messages.at least ask the army what they want", "inexperienced_grownup": "Thank You So Much for this! @mallikadua", "prajeet_tomar": "This doesn't not make sense at all why she is trying to say Maan the Josh is reason the revenge is the only reason that motivates an Indian to join the army not that shitty peaceful talk I really want to join the army beecoz of that revenge and becoz of that revenge i was selected in nda so just shut up you are just saving yourself from what you had said before", "jitendra_jangid77": "मैडम आप ही बता दीजिए घर मे बैठ जाये ,,हमारे सैनिक मरते रहे हमारे लिये रोज,,अगर हमारा देश जोश नही दिखायेगा तो वो दिन दूर नही होगा कुत्ता पाकिस्तान शेर बनकर हमारी छाती बैठ जायेगा,,, दोस्तों जोश हाई रखो देश का जवानों का जोश बढ़ता जायेगा,,, ओर पाकिस्तान कुते की मौत मरने के लिये तैयार हो जा,, जो हिंदुस्तान में पाकिस्तानी प्रेमी है वो भी ठिकाना ढूंढ ले अब तुमारी भी खेर नहीं,,,", "chhavi_kant_singh": "You are just a piece of shit i hope people watch your igtv video and understand why i am saying this... Bloody berozgar famous hone k lie kis had tak gir jayegi tu", "yadhuvansi": "Or sun tu bol sakti hai tere baap ne free kaa khana kha kha kaar tujhe bda kiya hai or aaj itna bde baket baan rhe hai jesse pta nhi kya kiya ho jiska beta mara usska interview dekha jiska pati mara usska dekha jyada gurmeer banne ki kossis maat kaarna aab ye desh tum jesse freee ke taatuo ki nhi sunega tum taktiyo paar likhte raho we don't want war or hamare bhai tabuto mai aate rahe jnu ki tatti bhag tere baap kaa bhosda", "iamaniroy": "#UrbanNexal", "jass__paul4422": "@askanshul Mdm ko thoda Famous hona hai , baki apko pta hai 👍", "nuzbaig": "Thankz", "kim_17_smiles_": "👏👏👏👏👏👏👏", "oishi169": "This really needed to be said.", "aey_kabira": "🙌🙌", "whogurvir": "@the why the Hell @indianarmy.adgpi with his Soldiers are ready to Make Pakistan Disappear from World Map !", "gayatriyerla": "Finally....smthng which our social media badly neededdd😭😭😭❤️❤️❤️❤️❤️❤️love uhhh alotttttt @mallikadua", "ranaprashant95": "@mallikadua ma'am ok fine, I got your point that war is not the option,so what else we can do?? Tell me.. how can we come together against this terrorism.... what are your plans for it as ultimately terrorism was hurting us, is hurting us and will hurt us we don't fight against it..", "koolwal_arushi": "👏👏👍👍", "___anjani_negi": "I think all bollywood kids and so called celebs have a skull but hollow, what more can be expected by mallika dua. She is indirectly proving surgical strike just a movie. Jab khud k ghr me ghus k bandook kaan k neeche hogi tab bhi yahi bolna. War is not a solution and even we don't want this bcz we know our govt. got diplomacy skills and govt never gonna have war. Have some brain URI is a truth. Atleast stand for ur nation and soldiers. What more can be expected by vinod dua's daughter.", "tahniyat.s": "War will kill and destroy both the nations and the innocent people of both countries @mallikadua", "prati2302": "https://m.facebook.com/story.php?story_fbid=2475769369134942&id=100001057107912", "saranology": "To all the people who are arguing here in the comment section , there is something called a situation of deterrence which we learn in high school 🙃 ja kar padhlo 🤦", "anuragkuumar": "abey maaa ki laudi ... tu terrorism ko bhookmari se compare kar rhi ... madharchod sali hrami @mallikadua", "med_pee_ke": "Chep lady seeking publicity", "amiyakumar11": "🙏🏼🙏🏼🙏🏼", "_anuushkaaa_": "Best💯", "saniya_laheri": "Please make this viral", "_kafkaesque__": "You know , how's the josh ? The josh is so high ma'am that me and my friend decided to join Indian army . You know how's the josh ma'am , ask Iran who too recently suffered from attack and getting their Revolutionary guards killed by jaish e adl . You know how's the josh ma'am ? That a death in tricolor is all i look for day and night. You know how's the josh ma'am ? We have been talking peacefully from past 70 years. You know how's the josh ma'am , Major Bist who was about to get married and he got ' shaheed ' while diffusing . You know how's the josh ma'am , that Development index is different than terrorism ( the figures of poverty , being talked about here ) India stands at number 3 when it comes to terrorist attack. Just a question , if someone was bombing at your own house , i would like to see the patience and use of soft power you might use. You know , why the josh should be high ? Because , it's our country and no one holds the courage to kill our country men and one more thing , cannot you see, the people who were fighting among each other are the same who are filled with that anger when it comes to our nation. And this dream of egalitarian society , i m so sorry ma'am , but you are into some uthopia. Jai hind.", "shubhi1509": "@mallikadua So you are saying that we need to find a method that has no casualties and yet, does the trick? Please if you may, suggest me a few because I can't think of even one. PS: Don't get me wrong I'm far far away from supporting war. Not because I don't believe in my army or my government but because I know war is not the answer.", "karthik.raii": "I agree things in this post. I know how it's feels when you lose your loved ones. but let me tell you one thing, don't try to hide yourself with this post..Don't give justification to you previous video with this post..yes everyday ppl die.. Yes millions of ppl die we move on..but not in this case..I think you well aware of how they died...A fucking terrorists blown them in to pieces...And they are not common ppl like us they die for us in borders. And you say move on? Why?? When they die for us can't we feel for them n their family..? . I do.. n many do... but you say it's too much..They are the reason why we here today remember. And In all past wars, India never striked Pakistan first.. they did... Terrorist samne agaye tho gale lagana chahiye kya..?? 😂 And am saying again you are Just trying to avoid consequences of your older post with this post.. shame..", "sahana_j8332": "Pls limit urself to comedy miss so called liberal", "sagar_chhikara": "Hope your blog become popular and each and every person gets his/her eyes on it .", "ay8shaa": "🙌🙌", "himanshimatta": "Can you please post this on your Facebook page as well. That is where all the hate is spreading. This post will help immensely. Thanks", "devendra_yadav_atri": "Teri MA ka bhosda sort mein samjhi madarchod", "anuj_.m": "India wants revenge not war.... If they wants war.. There is no option among us...", "krishna1joshi_": "Teri maa ka bhosda", "yashabakshi": "👍👍", "aditya.burli": "All of this is true, but do you really think the Indian Govt or the Defence Ministry will make decisions based on these people's posts on social media. Hell no. So let people speak their mind out. Not everyone have enough knowledge about international affairs or war, but they have the right to say what they want. Don't stifle them.", "mystique_starshine": "Preach 🙌", "komalasifali96": "Well said #nowar#josh#nofool#staycool", "bhagwa_rashtra": "Madam jb performance deti ho kya ummeed krti ho k sb chup chap bina tumhe support kiye ghr chale jaaye ya ye expect krti ho k tumhaare favour me bole.. Or jb koi favour me bolta hoga to confidence badhta hi hoga na tumhaara.. Pe ek minute shayad ye hi is time poora desh kr rha h sirf tum jese anti-nationalists ko chhod k.. Hume b pta h k bolne or waha jaake ladne me bhot frk h pgl ni h poora desh tumhaari tarah.. Hum log unhe support kr rhe h chilla chilla k bol rhe h ku k hum unka confidence badhana chahte h socha h kbhi agr poora desh chup ho jaaye koi meme koi revolution koi march na ho to kya hoga.. Is tragedy se pehle b kch ni hota tha na esa kya hua tha kch ni na.. Social media pe ya revolution krke log government pe pressure bna rhe h jisse k wo koi action le or jldi le to wo log glt or tum un logo ka mazaak bna k khud ko bhot bda desh bhkt khti ho.. Kl ko tumhaare sth kch ho or tumhaare frnds tumhaari family tumhe social media pe support kre tb unhe bolna k wo fake h.. Tum jeso ko sirf khudka drd dikhta h or kisi ka ni..", "rajasenakalilhindu": "Faltu ka. Gyan na pailo deshdrohi se km nhi tum log", "ashishmathewin": "Now someone actually spoke with reasonable thought. War is never a solution.", "sauravjazzy": "We are no one to talk like this, let army decide.. They know what, when and how to do... War or strike.. They no better and we are them.. Whatever may be effective result #IndianArmy", "komalbangroo": "For peace..war is must..", "vashishth_doshi": "Word.", "anishabazz": "@shabii_7", "adityamehta__": "Tatti 💩💩 goo h ye 💩💩💩", "ishika.7_": "Rightly said...Respect🙏🏻🙏🏻🙏🏻", "_peebee_._": "Enei enei, siyor baxor nokoribi! Eneu tuk xudhi eku kaam nokore Modiji e, ustaadi maari nethaakibi!", "harinarayanbaberu": "और रंडी कैसी हो", "ravithakur7418": "@mallikadua aapke ander thora bhi guts hai toh direct message me ispe mere se thora debate kr lo..aapko lagta Pakistan ke nuclear hai toh mere pass nahi hai..25cr ki population aur darr lage hmko ...kya baat kr rhi ho aap ..ye nonsense pdf kaha mil gaya aapko..aapko kya pta hai india defence me aur Pakistan defence me kaha stand krte hai..kya aap janti ho 2 nuclear bomb me Pakistan saaf ho sakta hai..india utne me sayad half hi khtm ho..but Pakistan apne map se hatt jayega..aapke ghar se koi khtm ho toh pta chale.. popularity ke liye aap log kuch bhi bol dete kuch bhi karte ho", "obaidatique": "This is so on point 💯 Thank you girl ❤️ #WeNeedPeace", "nagma_kasmi07": "Respect. 🙇‍♀️", "zeel9": "Now someone's talkin sense here...👏👏👏", "__aayesha_": "🙌", "travelshopaddict": "Just amazing", "saimasam78": "@24parvez", "sachin_wagharalkar": "@mallikadua aap b maro aaise hi kisi bomb blast me aur hum sub log b jiyenge without any sympathy to u. If u r talking about dies on every day, died of normal people is different as they already living life with their family & soldiers r missing family life & events too. So, we definitely need honour for soldiers hearse.", "avi_deshwal": "But who is asking for a war ??? some agressive minded people who don't have any idea that though we can beat Pakistan in the war but nuclear missiles will be launched from that side just to kill all delhi , Mumbai and other metropolitan and vise versa the indian army will do the same with Lahore and Islamabad but will it really help killing the innocents just bcoz u were not able to find and kill Hafiz saed and masood and his followers ..their are people like us living in pak unaware if the terrorist support going on in their country by their army ..what we need now is to kill masood like America did with bin laden .", "u2karsh": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "yummy_1396": "Respect", "fervidtravels": "So well written", "sc__.nitesh__": "🙌🙌💪", "akki6613": "You are not more intellectual than George Washington who once said, War is way to get peace.", "nivsitis": "Alternatives* to how the violence narrative is spreading let me know.", "roxet6": "Army is for protecting the nation from several threats, terrorism being one of them.. and if I guess it right, it is the Modi who is being talked about in post and it's quite funny that he didn't even use words like war forget about calling for war...but nevertheless, hating those who harbours genuine feelings for country has become natural these days... Some calls it hypernationalism also... But people like you are too dumb to understand this thing that if not through military force what else do you think is the better alternative to keep these jihadists from being a nuisance for our country?..talks?.. that is what your favourite establishment has been doing from past several years without any results... Just because some one is rogue and may use nuclear weapon..to kya dar ke peeche hata le Apne soldiers Ko...why you and many others like u always show such an ignorant and naive understanding of things that are far more complicated..?.. yes war is no solution,but you can not simply be firm on this rule when other party is consistently provoking u for war... At what cost do you want restrain...? More lives of the soldiers...? What made you think that your views would also be shared by those going to war or military expedition for that matter...? Try telling this to an army man and see what he has to say on this.?.. soldiers are trained to fight and not sit and talk peace just like you do... Your views are as worthless as your comedy ..", "er.monil_28_9_6": "I read your statement Pakistan kayu Chali nahi jaati aap BC Pakistan se pehela aap jese log India ke dusman he bsdk Pakistani Kahi ki @mallikadua Pakistani Kahi ki", "mahi_xheikh": "Reality ❤️", "kavya_happysoul": "🙌", "sanyuktapaliya": "🙌respect", "anam22ahsan": "A much needed postt🙏🙏", "quraishi_amir10": "Agreed👏👏", "scroogemarketer": "So well said", "prajaktagaikwad_": "Respect 🙏", "saakshi6506": "Absolutely correct and respect for her 👍🏼", "shivdasee": "Ye tik toks Jo hai stories me sahi me bht ghatiya chiz hai ye....jokes banake rakh dia hai soldiers k kurbani ka", "nirbhayanand70": "Pakistan prem dikh raha hai behen ji ko dar hai ki Pakistan khatam na ho jay abhi inki video dekhi usms keh rahi thi log roj marte hai bukh mari s garibi se jawan mar gye to kya big deal है! Is mand budhi ko dono k marne ka difference btao😠", "sadiqkhann": "@areeb.malikk @_mahad__", "_itsmaleeha": "❤️❤️❤️👌🙌🙌🙌🙌🙌", "khansameer421": "Respect", "sarcasaman": "Arre tera rapist baap thik hai ab ya ab bhi chhed rha h ladkiyo ko? Jaake usey smbhal. Kahi kisi or ladki ko na chhed de wo. Or tu bhi koi bda kaam ni kr rhi h social media pe post krne ke alawa.", "kuekuwatsheu": "Arey chill karo tumlogon ko kab se itni chinta hone lag gayi India ki...!?", "eshita.sankhla": "🙌🙌🙌🙌", "travellthroughwords": "I have cried reading this post. Being a grand daughter, daughter and a daughter in law of men who served and two of them still serving for Indian armed forces have faced criticism many times y. Because I have done a crime talking about the truth, trust and humanity. M a supporter of modi from that time jab yahi log surgical strike KO troll kar rahe the. Aur aaj social media India - pak war kark ye log shaheedo KO shradhanjali de rahe hain. Tum jaante ho pehle kaisa lagta h jab ek maa KO uske bete ka kata hua sar milta hai. Shareer nhi jalane KO sirf haath milta hai,vo pain jaante ho. Jab ghar vaale ye nhi smjh paate kiiske shaheed hone pe garv karein, dukhi ho ya uske shareer k baaki tukde kaha gye uski chinta karein. Mere father ne mujhse do din tak baat nhi ki thi his din gaandu aatankvadiyo ne humla kiya. Mere husband KO tk pta nhi chalne diya Maine ki main pareshan hu. Do din bad jab unhone call kiya he said high alert pe tha campus. Ek bnde KO pakda radar k paas se. Jail me rakha tha Usko andar k. Toh raat bhar shift thi. Toh bhul gya do din se inhi sab tention me. Saare officials KO btana pda.ab uska interrogation ho rha. Jab uri attack hua tha. Mere father bhi posted the vha. Jab photos bhejte the na vha se mahino baad toh garv hota tha magar saath saath dar bdhta rehta tha.tab college me thi main Aur mere ek pakistani frnd ne mujhe kaha ki fauji ki beti ho strong raho. Uska chota bhai peshavar k us blast me guzar gya. Hum dono me ek cheez common thi aatankvaad k liye nafrat. He never disrespected me. Main pakistan k baare me bs urna hi jaanti thi personal level pe. Ki vha ache log hain magar kamzor hain. Vo bhi shikaar bnte hain har jumme k din blasts ka. Ab hum baat nhi krte. Kyunki vo darta h Aur main usse kya bolu.logo KO lag rha ki ye gaaliyan dekr,tik tok par jhandu baam vale aansu gir a kar vo favour kar rahe hain.ek video k neeche dekha ek pak. Ki bndi KO afsos jatate. Logo ne use bhi nhi choda. They said ki tere ghar me ghus kar teri maa chodenge, fir tujhe.Maine kuch ulta nhi kaha Maine kaha ki gov. Aur army jab sab jar rahi h toh use decide karne dete hain. Bs unka support karo. Toh they said paka mt Aur insaniyat apni gaand me daal.", "an_admirer_18": "❤️ Respect!❤️", "bajpai.harishdutt": "Respect!!!", "ekaco\nVerified": "Verified", "sanjana080301": "Amazing !!!💙", "a_true_badass_patriot_": "Wonderful 👏", "somyaa_tyagi_actress": "You dont know , what is india, yes we have guts to kill pakistan, our indian army very precious for us, so please stop cheap publicity.", "anujgangwar199": "apni purani post hta di kya ..", "aqeel__shaik": "Well said.. 🙌🙌🙌", "darshmodi_": "🔥🙌", "monish_sachwani": "@san_jay0008", "_arnavkurup": "🔥🔥🔥respect really high sir ❤️❤️🔥🔥🔥🔥🔥🔥🔥🔥", "saudagar555": "@mallikadua shame shame", "dhruviii9898": "🙌🏻🙌🏻🙌🏻🙌🏻👏🏻👏🏻👏🏻", "baaz_singh_shekhawat": "Ha so called Bollywoodd \"bhuddhijeevi\"...tum jaiso se yahi ummed ki jaa sakti he... Koi apne bhai bandhu pakistani ka pallu pakdo aur chhup jaao uske picche...waise tere bolne se khuch hota nahi he... Tum jaise hamesha picche waali line me hi khade rahoge.... Kutta hi nahi puchega tumhe.... 🖕🖕🖕", "dhritii_sharma": "absolutely correct🙌", "normie_evolved": "If you ever played chess you would get to know about sacrifice...pieces are sacrificed in order to get advantage later on....The game is not so much different than what happens irl.... there's a reason we have an army(not talking about the BSF here)...they are trained for situations like these only. You're saying we should rest back and give the world a statement that our army/country is incapable of protecting the people and land? There's a reason that throughout the course of history people have solved matters through wars when things get out of control...just because acting like a liberal is necessary for you doesn't mean we shouldn't reply to their military for this attack... don't act like a libtard...there are people of way higher iq and wit planning the upcoming steps of our country.", "zainab.a_r": "@huzayfa_malik", "wakeupfiz": "So much respect! @mallikadua", "the.drowning": "😂👌🏼", "aanya_benipal": "@yukta.kalwani @csanyu", "jr.grover": "Aight", "reez_husain": "❤️🙏✌🏻 Respect ✊", "dhwanisahni": "@vivacious.richa read this", "perchindelhi": "So much respect 👏👏👏👏👏👏", "ranveer.brar\nVerified": "Verified", "jaipatel384": "No one wants a full fledged war. And not consequences mentioned here are not even 1% of what a full war costs. Any disturbance in these modern centuries will end up everything. And despict of the fact that there should be no war against a nuclear country, nobody wants to have a so called \"war\" with any country who may or may not have nuclear power. The main thing is we the people of india, don't forget to add our brave (army) too, want to fight against terrorism that harms our jawans and india daily for no reasons. We the people of india want the terrorism which residing in that hell porkistan to be brought to an end. Despite the fact that when they attack our jawans they themselves accept that their authorities so called the terrorist groups claim for that attack, they have the courage to accept they have committed the crime and say do what ever you want, implies that we have been doing nothing to stop them. Just erase all the josh that's going on the internet cause people would not go to fight there but our army, and the main thing is india is going to bloody finish the terrorism as soon as possible(taking the most possible decisions that restrict the harm to our army and india in the most possible way). Agar darr pedha nai kiya iss time pe to humhe puri jindagi darr he rahana padega. And will not neglect and will be the most common sentence and indian army our continuously sacrificing their lives, people would not even bother at that time, pak****** will have to face what they created own their own supporting terrorism. 2 mahine me aakir bikh magne wale he ye log, the fact is that every country would fight back if someone causes harm to them and in a manner of terrorism. And india is facing this shit from years now and will be facing more if this is not brought to an end. :- words from a true indian citizen who wants his people and the country to remain secure and a symbol of peace. Please take the time to read this and if you read try to understand it without arguing. Thanks for taking your time.🇮🇳 Jai hind", "jay_chhattani": "🙌🏻", "el_paritosh": "@skumar.me2", "alibawsi": "👏👏👏👏👏", "siddhikulshreshtha": "People need to understand the soldiers who lost their lives were KILLED BRUTALLY they were not in a war that they died as a martyr. And people talking about having a war against Pakistan actually think that a war is like a PUBG game. Well guess what guys here you can't just press play again :) And if you have so much love for the country and you wish to make a difference why don't YOU join the Army then you'll know the reality. Making a tiktok video is fun but actually being there in the uniform isn't that easy :)", "rinkijyala": "Kill terrorists not soldiers.. Bt problem is pak army is the one helping those terrorists 😕", "deeksha_h_shastry": "Y don't u take some time off n preach the same shizz to the terrorists. They started violence so they need to learn about peace 1st. Please help them dear philosopher. Had u posted this a lil earlier maybe u could have changed the actual cruel minds. Sitting in AC rooms talking n posting about world peace is easy", "akshada_t": "👌", "ronyyy007": "Tmhriii maa chod dengee bhosdikeee 1 baar tm khii prmotion m b dikhhh gyeee toh", "ahraz_77": "🙌🙌🙌🙌🙌🙌❤️", "singhdeep.1": "Hey my father is in crpf and is posted in srinagar !!!but fekugiri ki limit hoti hai ishliye itna feko mt aur ye film waali dialogue dena bnd kro !!!do you have courage to send your husband on border to fight with terrorist!!! if you have courage then speak otherwise shut up!!!", "vaz_ag": "@annymathur this is the post I was talking about", "ritizrd": "जवान बॉर्डर पर है इसलिए तुम आराम से बैठकर मूंह चला रही हो 😠😠", "kalboishakhi1003": "Hi @mallikadua this is written by a certain Punnag Sinha and not by an army wife. Being a celebrity whose voice reaches millions please refrain from spreading false news. Give writers their due credit.", "___dramamama___": "Dayumm! Finally someone saying this out loud..... 💯🔥 @mallikadua ( people at the back, hear it! ) .... ' @narendramodi '", "saba_amrin22": "👌huge respect mam", "shaheena_pirani": "Agreed", "askaizen": "Perfect!!!", "faizaaan_07": "@__ehsaaaan @_afnan__05", "i_am_happily_unsorted": "@aviral_pogonophile So here's the complete post. That wasn't my words as I kept repeating it was spoken by an army wife as mentioned above to which I agreed completely and shared on my story bcuz this is the exact thought which I carry too. Would you like to question her ki sadak par peete howe bache ko unhone bachaya hai ya nahi? Ya unko emergency ka matlab pata hai ya nahi? No right bcuz now you know it is shared by an army wife.", "psyeeshnarvekar": "Respect your opinion with an understanding your fear of losing your loved one. Goverment/Public/You/ Me isnt the decision maker at this moment, but the army is. The army has already lost its loved ones.", "praacheee": "@prikks_06 read it", "vinay2891": "@rishitandon27 video deleted 😂😂", "pranay_shivaay": "Shut up Commie .........U hv the brains of an actor, genes of an unsuccessful journo and ambitions of a star.......politics and defence are not ur cup of tea. Let Men do their job..... So shhhhh🤫", "_gyanibaba_": "Ye sab tho theek hai par #pkmkb", "sutoparageous": "Finally something logical 🙏 being a defence kid I know how war feels like, and war is not a solution of every thing and it will never be. I know how traumatic life of army families becomes during war. All those pseudo nationalist who are shouting for war you yourself don't have a guts to stand in front of LOC, living your life in a comfort zone and demanding for war.. ? shame on you, the defence force is not an impersonal machine that switch and destroy your enemies. They do comprise of father, brother, sister and mother. Army knows it's job you have no right to decide what they have to do.", "toko_1122": "War is not the point here... but avenge from the terrorists who planned and were involved in Pulwama attack is. And also we can’t just sit and watch and let the terrorists do all that bullshit again and again and again. Action needs to be take place not against Pakistan but definitely against the terrorists. And by WE I mean WE INDIANS . We are definitely not the soldiers but Indians and as an Indian this patriotic feeling arises naturally, we are not faking it and on which basis you decide that the entire population of India is a fake nationalist.", "baljeet_2012": "🙌", "fakhraaaaaa": "@unum009", "pepperohini": "Finally someone said it", "pratham_khari_": "This message should reach to mass 👏🏻👏🏻👏🏻", "eshh.a": "🙌🙌", "abhishekdhiman9808": "we should go for final attack and not like ghr m ghus k mrng hawa m udke upar s mrng or pure kashmir ki gndki saaf krng", "_supriyaverma_": "🙌🙌🙌🙌", "sohhammm": "Damn right 🔥", "juitheartist": "My sentiments exactly", "hatimuriamonica": "Couldn’t agree more! So true!", "jazzyjyoti": "Way more power to you girl!!", "iam_ckh": "🔥🔥🔥🔥🙌", "_gaur_g": "Mallikadua Lagta hai aapne tameej ke saath saath akal bhi Bach khayi hai....aap unn soldiers ke baare me baat Kar rahi hai Jo ##PULWAMA me shaheed huye hai mujje lagta hai aapko soch samaj ke gyaan Dena chahiye.....hero aap nahi hai hamare wo army javaan hai..... understand 🤔🤔", "kajaljha_": "Respect❤️", "adrita_sparklingthoughts": "I want to make a banner of this and put it all across India and across the world... thank you for sharing this @mallikadua , the world needs some sense pumped into it.. you and me saying the exact same things will make us “anti nationals”, coming from an army wife, I hope it is able to drill some sense into the “joshilay people” around us! thank you!", "stereo_heartz": "Thanks for sharing", "riddhi_j_n": "😞😞😖😖😭😭🙌🙌🙌🙌", "malemohit": "Talking common sense where little exists.. cheers to whoever speaks the mind of the thinning species of rationalists.. the world needs more of these..", "kartheeksharmapuli": "😂 LOL is what I could say", "dikshyapatt28": "👏👏👏👏well said", "shivibykr": "Dear @mallikadua, We want India to wage war against terrorism. Not against Pakistan. It's been seven long decades, what kinda paperwork dialogue or treaty stopped them from killing innocent civilians and army personnel? Do you think does it work yet?? We must give them strong counter strike they must learn a lesson from this", "fixated_f": "👏🏾👏🏾👏🏾", "ibaisakhirath": "Finally ......🙌🏼🙌🏼🙌🏼", "quarantine_meemer": "but still... Pakistan ki maa ka bhosda", "kirtsinhdabhi": "tu mer", "arushi_tomar": "🙌🙌🙌", "maddylicious_88": "Love and peace from pakistan ❤", "multicelebsfan": "Damn agree! This is what I been have an argument with my family & friends. Taking aveng is not the solution to stop this nonsense. Think something new @narendramodi 🙏", "lush_life_rush": "Someone please just tag all the meme PAGES because they are influencing more and more people by their posts and stories 👀 seriously! They really need to see this!", "pavanjhangyani": "@reemajhangyani", "bhavyashekhawat": "🙏", "renukamene": "Kindly see what the government is doing..its peaceful but solid that is what i was talking about..dnt make assumptions and wrongly judge ppl...but the government is a quick inititation not 66 years of peace talking..", "1am2511": "🙏🏻🙌🏻", "deeksha_vig": "👌👌👌", "akshaybela007": "🙌🙌🙌", "rivetoo9": "Madarsachaap ko indian army ki kabiliyat ka andaaza nahin hai! Pakistanio ki kuttia", "padma_nehru": "@siddhartbehera @saujanya.behera read this! 😍", "glad_roopa": "👏🏾", "urshilachoubal": "@gazossaman", "yoganandpatel": "Tu mar saliiiiiiiiii", "surbhi2912": "@garimasingh097", "ridimaaa": "🙌🙌🙌🙌🙌🙌op!", "909_paritosh": "Baap balatakri beti rashtra birodhi.", "waqasag007": "Someone has finally talking sensibly", "debjaninfdcindia": "War is never be only solution..the consequences?? Hirosima Nagasaki...nuclear bomb attack...if you want fight let all indians join hand with army..can anybody have guts?...so we need to discuss over , who are the terrorist? Why they are like this? Why they born? What they need? And what can stop people joining terrorist group. That's it ..take whole world together Nd do the analysis...Nd at last just kill those group in every country who is spreading this nonsence and nuisence. ND if some country is specific...let all country together take the decision to abolish....", "creativesoul_isha": "Glad to see such rational posts Every other social media user will announces war a thousand when all they have to do is tick tok on their phones  War is not the immediate or preferred solution. Period. @mayureshfeb25 See this", "me_vikii": "🙏", "shivrajdeshmukkh": "🔥🔥🙏🙏🥺", "i.am_sami05": "🙌🙌🙌", "venkycv": "These words...🙌🏻", "makwana_23": "@shruti_1504 THIS.", "notyour_bae1512": "🙌", "divakarrrr": "@sachdeva.shikhar23", "aditi__panda": "🙌", "veenabwarrier": "@@curious_creature_1605", "say527": "@_aawara_ this!", "that_brown_boho_chick": "True that 😊", "swatimanishatre": "Jo army join karte hai vo Sarkari naukri join karne nahi jaate hai.. Na hi unke parivar wale.. Unhe sarkari naukri karne bhejte hai.. Unme Hosh aur Josh dono hota naki movie dekh kar jate hai.. Pakistan yadi Nuclear nation hai to hum bhi hai. Bahut shnti samjhaote ho gaye..", "gaganholani_4": "♥️♥️♥️🙌🙌🙌🙌🙌", "tanushreekamra": "🙌🙌🙌", "sabhikaallahmalik": "@mkhan_hira", "akashdeepyadav29": "correct.", "mac_d": "Wow.. 🙌🙌🙌 #respect", "its_pooja_ss": "Khatarnak awesome🙌", "zaynab.naqvi": "Thank you for posting this .", "anish_thomas": "Halfwits keep blabbering whatever want to. They shout because some uneducated idiot in some corner of the country has just watched an emotionally charged movie and thinks Indian armed forces will have no casualties in any offensive they take part in as was shown in the movie. They dont know real life, they want to sit within a theater and shout patriotic chants", "bhagy_esh_": "@niketanwadaskar", "eccentric_wordsmith": "Superb", "kalyan_deepakk": "So what should be done .should we wait for the time when more of us will be killed .should we start love exchange with them .matlb chahte kya ho aap .kase hoga ye masla hall aap e bta do miss @Mallikadua.", "_darshu_dave": "@dedhiakulin", "reha303": "🙌", "nidhibains": "Nailed it!!", "mansi2394": "@soniabhatt95", "sandra_debaleena": "🙌🙌🙌", "summersaffronkitchen": "India comes first. Pakistani artists banned by the Indian Film Industry. We stand with our soldiers. We stand with India.", "adinotaaaadi": "Ktb chutyaap", "bellonasahu": "@arnipghosh", "thanvivipul": "👆♥️😇", "daniel_rohini": "Rightly said !!", "greatusdsilva": "Your views are naive!!!!! People are not saying (especially me) go to war with Pakistan but to go to war with Pakistani terrorism. Thousands have been killed by Pakistani terrorists where Pakistan uses those terrorists as proxies to intermediate their presence in Kashmir valley. The terrorists in Pakistan roam freely and are supported by government and society. If we don't stop this pakistani terrorism and don't use counter retaliation then one day you might be a victim or casualty of Pakistani terrorism. The soldiers are there to protect us, the people of India and its pride they have signed up for this job. I'm not saying to sacrifice but they their job and the risk involved in it (they are fully aware of the risk) if we don't want to go to war with Pakistani terrorism there are going to be more and more casualties maybe in millions what will be your answer then.", "amigo3.14": "@mallikadua No one is demanding a full fledge war against pak but doing nothing is the utmost sense of disrespect towards our 40 martyred jawans. I can understand the fear of Mrs Ganguly and every army wife when her husband is on his duty, protecting the nation risking his life but more than the citizens our army jawans are the one who have rage and fury in their hearts after the pulwama strike and dont care to lay down their life for the sake of this nation. For the Indian army nothing is more than India’s pride and its will avenge the deaths of our brave heros with perfect planning to minimize the casualties of our jawans and maximize the damage to those bloody terrorists and that too with full josh and hosh (alertness). but for ur kind info let me tell you that this josh has united all indians today irrespective of the religion and Indians dont want a full fledged war but we have complete faith in the Indian army that it will give a befitting reply to those bastards", "kesharwaniudit": "Please Post in hindi too because appox. 80% people's mother tongue is hindi, maybe they can't get it. 🙏", "ainerana": "Thankgod ! Someone wrote it .", "the_m.a.n.i.ac_21": "I think the problem with India is that it's investing more on these ppl with this fake Josh and not actually investing on the defense and army. If the same thing had happened TO US with Trump as president, those bitches wud be dead by now", "masalamaharani": "Mallika.. Bravho❤️,I have one humble suggestion for all thse Social media war heros .. Thirsty for blood bath..1 Temp Resign from your jobs, occupation ,take a subatical,and go on borders ,least nearby areas and start doing help , volunteering ,anything.2 Okey ,u cnt do it,fine..Dnt use AC,No elevators,No hotelling,No TV , Netflix or social media.Cm home from work ,And just sit in hall,on floor ..waiting ..waiting..3 Eat minimal basic food.Khicdi,gruel kind.4 Keep fast of 12 hours..Dnt use toilet for 12 hours..Least do sm of this . Coz Soilders doing this all the time.OR became the shadow recruit..be ready to blow the enemy..just the way they do!!!!..And then go on full josh..warcry.WAR is horrible guys..dnt let your cunning politician fool u..", "abba5.ja": "Perfectly written", "sonalchawlaiya": "@sushant.chawla", "orangefilter": "@coffeevendor", "aarushi.jajodia": "@mallikadua My heart hurts reading a few comments here! But amazing to see at least someone has some sense and has written such a beautiful and truthful post!", "swatiranjanasood": "👍👍", "shashank_thevegan": "@priyavrat10 @kumarankush10 @akashkumar2602.ak comment dekhlo logo ke .", "soviagill": "🙌🙌🙌", "jitesh_aka_cheeku18": "How beautifully! she portrayed the whole picture to the children, adolescent, youth and adult war strategist! Of our country,Who r high on their josh! #MassiveRespect🙏", "sunnyysideup\nVerified": "Verified", "shivaniii01": "@sakshiiiii_s @deepikamandal_ Ye tha post", "riya_kumar96": "👏🏻👏🏻👏🏻", "ameyanatural": "Sense 🙌🏼", "_ayesha.ak": "@r.syeda12 @amnayyy_03 worth reading 👍", "vinitadhankhar": "@sachidhankhar", "bollycon_int": "It's more important to speak the unpopular truth to power than behave like sheeple. \"The best way to truly destroy any enemy is to make a true friend of them.\" - Abraham Lincoln", "derrick_fernandes": "@v_dairies", "archana.19": "💯", "_the.ambivert.panda_": "🔥🔥🔥🔥", "edgability": "💕", "ayushi9295": "Woooow", "sairaimran_": "Someone finally said it 👏🏼👏🏼", "baking_brain3477": "@sikandar2967 show ur friends dis", "shubhaam_gupta": "#unfollowmallikadua 😡", "igoby10v": "No people don’t need to read this ! It’s true that calling for a war is foolishness, People need to be more rational right now. But , for once I see the fire of togetherness, people are coming together and want a solution for terrorism! It’s not about Pakistan , it never has been. We Indians are peace loving people , we want to keep our hand clean with our Karmas, we spread love not hate, we accept multiple religions around us and want to live happily. What happened in Pulwama is Sad, not only today but acts like these are always Sorrowful. Today, when ever person wants to be one and say “How is the Josh?” “High Sir!” .. some people from the crowd want to shout out for peace in their own Hippocratic minds & want to be heard as mindful voices. WHY ? It’s ok to let people feel the anger because they feel the pain too. Emotions can’t be taken out from humans.It’s true that Every person watching war on tv can’t shed blood! Not everyone has the courage! But is you ask me today that will I be willing to be a part of war (ever) if my country needs me , It’s going to be a YES ! And many like me would be upfront for the same !! The Army and the Gov. do not run on the voice of people . It never has and it never will. It’s will come up with the best possible way to avenge our brave men. So it’s ok to let people say and feel things the way they want till then. Let the togetherness be cherished. Let the emotions be felt in the highest spirits. Don’t take that ‘Josh’ away from them because that JOSH is actually LOVE !", "rizinstaneet": "@kunal.dhawan2", "therandomvibez": "So true, sensible n honest!! Respect!!", "harshitp19": "Respect👏🙌", "shezminjasani": "Very well written", "lucid_mantra": "https://m.facebook.com/107229389416718/posts/1392997487506562/", "katochharshuu": "A huge massive Respect👐👐", "shahed.rahman111": "Respect the guts u have.... which is missing from our main actors in bollywood", "nidhi.dhru": "Respect", "aatahskaa": "🙌🏻🙌🏻🙌🏻", "gurudatta_tawde": "Also, what would you @mallikadua do if someone comes and slaps you? Wait calmy and think of a strategy through which nobody harms eachother? Or you'd slap back the person who slapped you?", "komalpahl": "@mohitkej", "ki.ara5163": "👏👏👏👏", "meet_pandya": "@vidhishah123 word", "naina_1819": "EXACTLY!!!! 🙌", "patelpriyank91": "🙌🙌🙌🔥", "mayank97jain": "@vismaydoshivd @kkoradia97", "aksh.deep22": "Some another celebrities posted this and other stuff like this let me tell you army dont work according to people, people telling all this stuff becoz they dont have that level of emotions control as our army does so please stop this nonsense. Army work according to there plans with all respect an army wife said all this becoz he knows all the circumstances what occur in the war what happens to there family she talked that way and stop telling people of india what to do they have all fuc*** right what to say if army starts work according to people the war start in 2016 after URIattack so dont worry#peace", "074.akanshaa": "Respect!!", "palgos7": "Absolutely TRUE", "mainhoonyash": "Just amazing!👌👌👌🙌🙌🙌🙌", "mamatathakur": "Superb .. these new aged high Josh people r actually Khali from d top", "kaavbattkaavo": "@adityachhatre Hope this answers all your questions.", "sushreeta_heena": "respect🙌", "i.t.s.abhi": "Yaa we can jst wait nd enjoy this happening.. nd fight terrorism not the root of it, the country which is responsible for all the terrorism..thn yaa.. u r ri8..", "ummezyaan": "Respect to u dear for being so correct#so so so correct .. And there z no way u can b wrong because u r Vinod dua z Daughter @u r d daughter of such magnanimous persona #respect", "vikram_prtp_singh": "@mallikadua Kushal Ganguly was a police inspector, who shot himself for some unidentified reasons. Let me know about \"Shraddha kushal Ganguly\" and from which source u get these things.I appreciate ur well doing,but i need to learn too. Send me the link/source whatever u have. Thanku", "dhanijhankal": "@sleepashree @namrata_cr", "vaibhavmandhyan": "Its the family of the Martyrs who also share the same josh. If we had followed your advice we would have never gotten freedom from the british raj also as it also need some blood ahedding to get rid of the suppression. Though i fully support the idea of every indian joining the army for a while. Just how it is in Switzerland and korea.", "_sakshii______": "🙌🙌🙌🙌", "mgeetik": "Why are people misunderstanding this post . What @mallikadua is trying to say is that our emotion should not blind us from the fact that we should think and take steps before another mishap takes place. Ofcourse we are no one to talk about waging a war as we don't suffer damage caused by it . But we should also not ignore the incident and we should take steps patiently after consideration", "bidisha.roy": "@ashwin.bhaskar28 @apurva_213 see this", "kunal_bhau_wagh": "@_arvind_07_", "poojan_saini": "🙌🏻🙌🏻🙌🏻", "prashhhhhhhhhhh": "🙌🏻🙌🏻", "mahantapujashree": "Respect!", "sanket_j8": "@shifuji_jaihind ??", "ne_ne_narz": "These are the only kinds of post that should be shared instead of all those nonsense bout revenge", "itssagarchaudhary": "You always supported feminism and behaved otherwise when your father was blamed in the #metoo movement. I can bet you'd take a complete 180° and the video would be different if the martrys were ur brother or father. Honey, have a seat. It's just a matter of situation :) sometimes it favours, sometimes it doesn't,but one should have some empathy! *ZipIt*", "varunakhanna": "Wow lady! You clearly told it like it truly is🌺", "seemax.2569": "True Fact", "architectjasmin": "🙌🏻👏🏻well said..", "biriyani_08": "👏👏👏👏👏", "harshigangrade": "🙌🙌", "dhankherakankshaa": "Respect🙌🏻", "inshuz": "🙌🏻🙌🏻🙌🏻👏👏👏", "soumyadeep524": "With due respect mam do you want to say that India should not do anything about this. I agree with you that war is not a solution,but do you realise that Pakistan is not doing anything against the terrorists present in their country leave their corrupt government but it seems that the citizens aren't even protesting against it but are rather supporting it.Have you seen the reactions of those Pakistanis or their media who are celebrating it. Think about it in this way.", "gargichandola": "Articulated what I've been feeling.", "mylifeplatter": "🙏", "heenasomani": "Moree people need to read this!!!", "ladywolf_xviii": "By far the most legit thing I read.💯", "bhairaviiitis._": "🙌🙌🙌🙌", "sneha2589": "So true.", "neha7894": "Ma'am i agree war is not easy n not an easy option..we often read about the impact of non violence around the world but we look at ground realities ,this seems bit dillusion..do you remember 26/11 , its not the case America didn't had any peace talk with Pakistan but tht went all in vain so the outcome was retreat by the American soldiers which was successful n right by so far.do you remember Sarabjit ,india had numerous peace talks but unfortunately we know the outcome ,do u remember kulbhushan Jadhav case ,deep inside we all know what his faith would be but v r still trying.All my point is peace talk happens when the other party also feels or in some mood of having any kind of settlement.country like Pakistan where the word democracy is nowhere found ,we can accept anything better of them..in some case we need to face this brutal face of war n in same case it bears the fruit whether in the case of Russia Germany war,the invasion of china from japan..the release of Bangladesh n many more we have in history.you are talking about Pakistan having nuclear bombs n weapons what if someday they eventually uses them against ,bze if we look at the records they have always intiated the war..we cant sit idle n wait for miracle sometimes we need to make actions n yes madam the JOSH IS STILL HiGH !!", "its_nidhi_z_world": "Waah the real indian is be like🙏🙏🙏🙏respect respect", "psbishere": "This war can't be ended with hatred.....extremists around the globe are just afraid of one thing \"Love\". Do you remember terrorist adil dar said in his last interview, \"kabhi pyar mat karna\"...their sole reason is to spread hatred... And the more we start demolishing, will fulfill their reason... But if we stand in solidarity, hand in hand with each other, be alert and don't forget to report the authority of any suspicious activities/events seen around us, if we stand vigilant, then no one can penetrate us ever. #United #We #Stand #JaiHind", "diksha_agrawal": "👏👏👏👏", "nikita___kadam": "💯💯💯🙌", "priyasuhalka": "🙌🙌", "shraddhamusale\nVerified": "Verified", "_the.lost.desire_": "Respect 🙌", "bhoomi_makwana14": "@artstabbed @saniyabhonde @mayuribhat13 people need to read this", "shivam.0.0": "Don't worry Delhi and Mumbai both are out of range of Pakistan as verified👍", "hithishereiskevin": "@mallikadua Listen up. I don't believe that war is the solution. But I do believe that the people responsible need to pay. I am willing to die for my country and I am sure thousands of others are as well. We have been a peaceful country for far too long, and look where has that gotten us. Mumbai 26/11 was just as an example, and many other attacks such. I do sympathize and feel terrible for the families, I cannot even come close to understanding their pain. But the only way to avenge is not to sit back and say \"Karma will do it's job\", but it is to actually go out and do something about it. Both my grandfather's were in the defense services and I know how hard it can be, to go in an uncertain war. But don't forget we are the 4th largest Army in the world, and the second most populated country on the planet. If we all come together, as we have, no nuclear bomb, no air missile can stop us. NEVER.", "x.okasha.x": "Finally someone sensible knocking sense into indians!!", "i_ambyy": "❤️👏🙌🙌🙌", "pranjali1277": "👏👏👏👏👏👏", "zoyis__zone": "Very well executed the real stuff behind 👍", "maham_ahmad": "❤️", "sanjh9235": "RESPECT🙌🙌🙌🙌🙌🙌🙌", "manveet_sandhu_": "🔥", "asdfhjjjnvcg": "Everybody knows how many missiles pakistan have, and if they use their 60 km range missiles we will erase their country from the world map. Aur tum toh bolo hi matt, stop trying to cover up for what you said. You said \"what's the big point of soldiers dying\", stop trying to justify your actions dumb cunt.", "telegraphdesi": "Thankyou for being the voice of reason. I think too much of anything be it religion and patriotism can make people lose sense of right and wrong.", "agnes.502": "🙌Agreed!", "wheckses": "This is so fuckin' stupid. @mallikadua Do you really think all war leads to nuclear disaster ? Do you even know what Mutually Assured Destruction is ? Both India, and Pakistan are aware of each other's nuclear power and WILL not take that road knowing the risks, assuming Pakistan's being rational. You're wrong about a LOT of things here. Sitting back and talking about the situation and not really taking radical measures is precisely the reason Pakistan is so confident when they attack us. They know the fuckin' left is gonna pull off some bullshit argument like yours and we won't do a thing about it. What did those 40 soldiers die for ? Nothing. I'd rather have a soldier die in a battlefield than die for nothing. And this isn't just my preference, it's what any soldier we prefer as well. It's not just about these 40 soldiers as you so make it seem. It's about a LOT more. The state-endorsed terrorism has been going on for quiet a while now. Diplomacy as an answer should've been removed as an option long ago, yet, it still is. The war, this time, would be limited to foot soldiers if it ever comes to be, so don't you worry about your house being obliterated by a ICBM. Just wait for a foot-soldier from Pakistan to come knocking at your door as a result of your generous diplomacy and 'logic'. An eye for an eye makes the whole world blind but it's better to be blind than die.", "anurag.singh135": "Hamari Armed Forces baahar ke Chunautiyon se lad rahi hai..Aur hum hindustan mein baithe inn jaise chutiyon se lad rahe hain !!", "sunshinewithbluesky": "Sad", "shrutti001": "First time in these days made sense to me. May God give their families strength to bare the loss.", "swikriti07": "The reason why each and every post of hers is filled with bullshit comments is because these egoistic ass heads can’t grasp the fact that someone wait lemme refresh that a woman is speaking her heart out and the fact that she actually makes sense. She speaks differently than others as she is soo real. Yeh deah bhakti 3 din 4 din chalegi fir sab log apne apne dunia me. Dusre desh k sath Ladne se pehle apni desh sudharne k rah Mein champ.", "kavyagovil": "Salute to you for sharing this perspective👍.. people are going insane with the \"we should declare war banner\" when they don't even have to do anything", "rohanstelang": "Oh shut up Dua... Ur an idiotic spawn of a sexual harrasser.. so wat made U the expert on giving or sharing moralistic posts... So pls... Shut up", "gogonutbebe": "I would love to hear some alternative solutions from you guys rather than simply ranting about how wrong it is to avenge the deaths of our soldiers.....", "_ranveer_94": "Well said.. and hopefully it transcends into the minds of Josh filled young India and provides an entrenched insight.", "samirasarin": "@smug_but_redundant yes you", "aliakhan25": "👏👏👏Respect....", "bisakhasarker": "@pasarimeet", "ur_pic_is_no_good_bt_i_still": "So many problems but not a single solution! @torshachatterjee", "s.aditi1110": "Our fight is against terrorism. And not any country or religion. And initiating a war with any country means initiating a world war where every country is a nuclear power! And no soldier wants a war.", "harshhermit02": "🌸👌🏼❤️", "ely9shelly": "War ke bare mein sochne walo phle desh se keede nikalo. People are posting shit on social media supporting this attack aur tume war pr jana? Jab apas mei hi ladd marte ho tum log toh khud socho kitna easy hai hum logo ko divide krke marna. Kal mere ghar k bahar candle March hui iss attack k chlte logo ne nare lagaye Pakistan murdabaad. Ek candle March aur hui hai nirbhaya case k baad log chup the usme. Shant the.. there was no HIGH JOSH.Boht sare comments aye social media pr ye wo N I'm pretty sure i read about so many rape cases after that. TOH MJE YE BTAO TUM SOCIAL MEDIA PR WAR DECLARE KRNE WALO TUMARI AUKAAT KYA HAI tum log kis muh se war declare krne ko keh rahe ho? Jab tum log apne ghar ke andar nhi safe kr paye logo ko tum kya war ki baate kr rahe? Abhi kai 2 communities k beech dange hojaye toh terrorist ki zarurat nhi padegi tum saale khud hi unka kaam krdoge aur tume war chaiye? Jaha tumara koi role nhi waha bolna boht easy hai but jaha tum logo khud krna hota hai waha tumari bhuddhi kyu brasht hojati hai? War chaiye chutiyo ko.", "laelanblog": "Hiding*", "_singhsumedha": "People are really acting like the Indian armed forces are going to ask for your opinions on war , including you too @mallikadua . It's not on you to decide , especially about the economy or the after effects of the war . It is on the brave families of the martyrs and the Platoons of the forces who loose their buddies on a daily basis , just because they can't retailate to the stone peters and separatists in Kashmir. So madam , the Josh shall always remain high . If the forces want a war , I say , bang on , we stand with you . People like you or me are no one to judge , of India should or should not wage a war. Remember that !", "muskannsin": "🔥💯", "027pghosh": "Obviously you are the only individual with immense knowledge, sense and experience in this criteria and you know much more than us emotional idiots, but Atleast can we ask for justice for our martyred soilders? Or do we need to just consider them as expendables?", "shretimagangwar": "🙌", "dr.varsha_meena": "🙌🙌🙌🙌", "shhreyya__": "🙌🙌", "sumeghasugandh": "Its so sad to see that we are still sitting in 1947 where people still have the power to manipulate us even if we are educated today.. We are just the victims of the mistake our forefathers did in 1947.. We, the youth, have all the power to undo what had happened but instead we are giving fuel to worsen the situations by showing hate all the time.. The day we understand that we are just human beings and nothing else will be the day we will achieve PEACE.. And not by talks or any war.. Lets be a part of the solution and the problem anymore.. We have Social Media today, why not use it to end the war raging in the hearts of both the countries.. Whatever happening is just the result of that hatred we all experience everyday.. @mallikadua - RESPECT.. Please continue using your power to bring the change.. We will stand with you..!", "afridipalwasha": "Respect 💕", "sagararora911": "Isko koi cultural exchange krao Lahore k saath n Biriyani khilao. Her tagline be like \"Apna kaam bnta, bhaad mein jaye janta\"", "nilesh_wdhwa": "@junglijaiwa", "maheshwariachal": "@___dayita___", "tanuja__chandra": "This is THE truth.", "rohitchaudhary3253": "@mallikadua @theauthor When u join the army u know the risks involved. War is an ever present possibility. That’s what the army trains for. The govt will decide based on various factors like geo-politics, public opinion, long and short term socio-economic impacts etc, whether war is required or not. If they do decide to go to war, India will and should go to war. And of course it’s the army which will fight this war, because that’s there job. They chose this career. If u r that scared, quit the army. Aa far as the so called Bollywood watching PUBG playing civilians are concerned, they are paying there taxes and casting there votes, and as citizens are certainly entitled to their opinion, whether they are experts in the subject or not. Just like I assume the author is no expert on this matter except her only distinction being her husband is in the army. That’s doesn’t make her an authority on whether war is needed or not. She is entitled to her opinion though . And I respect that.", "chandrimaph.d": "I tend to agree that full frontal war isn’t a way forward. In fact it is a bandage response. Why aren’t we working on the root cause of it... why was there such a massive intelligence failure! Why not invest in setting that right. What about so many Kashmiri youth turning to fundamentalism? Let’s invest on more research on that. Spend those crores on research, intelligence, making India their safe haven.", "astral_soul._": "Respect!", "beeniraja16": "Hi malika I am a Pakistani I completely agree with u I don’t know why everyone just talk about war why pakistani and indians don’t force their politicians to have peace talks war is not easy India and pakistan are nuclear powers When two nuclear powers fight than what’s next ???? We talk about war are we not done with wars 1965 ,1971 Did we got back what we lost in those War’s ????when there is a terrorist attack in pakistan everybody is like India did it when something bad happen in India oh Pakistan did it seriously please be sensible we are just puppets the politicians are playing us for votes talk about peace trust me if war happen than on the world map their is gonna be no India or pakistan 🙏🏻peace", "sanjeevnayyar": "Very true strategies are not built on emotions", "vishantkg": "i feel sad for the Soldiers who were attacked in Jammu and Kashmir. but guys seriously please stop pulling each other's leg on social media and instead put your effort in becoming a responsible and honest citizen of India. The only way we can help our soldiers is by morally supporting them and for once put our country's interest ahead of ourselves. Our country stands above us all, you ,me and for the soldiers who protect it. So I humbly request all of us to become a better version of the citizen than we already are. United we stand, divided we fall.", "toshivasistha": "@shradhaganguly Thank you writing something so sensible. Thanks @mallikadua for sharing this. ❤️ Right on point.", "raimontii": "Good! Now go get this verified by a 14th Feb martyr's wife and then we talk!!", "anoop.chopra.165": "War brings war respect gets respect and love begets more love. All of us have to decide which way to go?", "untamed_bachelor": "You have turned into a female version of Sambit Patra", "annemariamathew": "Clam your Josh people! Work for peace not war! Non violence was our tact not a stupidity like violence that too unnecessary violence", "a_happy_pup": "The thing that must stop right now is people bashing each other on social media after an incident... I know it hurts, it boils our blood.. but writing on the issue doesn't help...", "yashthekhona": "So it’s okay if Indians go on getting attacked and innocent deaths increase day by day ? Pakistan goes on taking us for granted as we rely on politics to teach them a lesson ?", "itsrasel23": "Makes so much sense honestly I’m a Bangladeshi but till yesterday I was even like why aren’t India declaring war against Pakistan and my dad said cz Pakistan has neuclear weapons  And now after reading this post it makes complete sense honestly", "nandikaabrol": "🙌🏻👍🏻 well expressed! People around us need to realise this!! @shradhaganguly @mallikadua 🙌🏻 huge respect to both of you!", "arjentodillip": "Total shitt,,not posting for 2-3days won't hurt much I guess.", "preetsharan.ml": "Sooo true .....", "ruhani_ahmed": "@bo_he_mi_an yeh padh tu", "anutoshgupta": "@mallikadua very well said Mallika.. very few sane brains among us understand that what exactly does the war mean! It doesn't start and end with just the army,soldiers and their family' loss, but it equally could come to us (normal civilians).. definately takes the countries far back in development and a lot of unwanted unrecoverable loss and disaster! The best we should do is to pray for the victims, help them financially, help the countrys development, give votes and make the best leader possible, pay taxes so that things start getting sorted in the correct way. To all those who think war is the answer, lets enhance our knowledge to by knowing more about effects of a war. So folks, calm down and channelise this Josh in the appropriate zone .. peace", "bluziz": "Beautifully described... n to top it of does these ppl knw dat each bullet will kill one solider of any side... a solider who spends all his life for this country... shedding blood n even there family for there country... u lost 40.. we lost 123 children n thousands of ppl in such incidents... but we never said k gher k ander ghuss ker marien gay... war is nt the answer fr anything at all... War is nt the solution of anything....", "burnt_sativa": "Responding to the latest thoughts of Mallika Dua- Respectfully Ma'am i guess that the citizens of this country have the right to keep their josh high because they have lost their brothers in this bloody terror war going on. It looks like you haven't lost a son/brother in this terror war because these type of words can only uprise from such thought process. We as a country have always preferred due diligence and this has been the reason that Pakistan govt. And the infamous ISI have funded the jaish and able to kill thousands of our brothers on our borders. Due to such thinking china has been able to surround india by its string of pearls but obviously why do you care because you are just a person who thinks usa will come and steal the show. NO THEY WONT I REPEAT THEY WONT.USA will never entangle itself in this mess and neither any else country will. We as a nation needs to protect ourselves and that includes the nation destroying the militant thresholds in POK and if that means facing retaliation from Pak it is justified because it's govt. Is also not crazy they will also face tremendous pressure from USA Russia and even China even before considering a nuclear strike. Now coming to the funds you are going to lose. Respectfully Ma'am no war is a good war and we lose things but sometimes it is necessary to prevent further damage in future like in simple terms its like you face some pain in short term rather than losing a lot in the future. Funds will be lost no denying that but we will have a assurance that in future we will shut their mouths and from the starting the govt. Has so much invested in military that all our battle machines are ready and dont require further costs and we aren't going on a full scale war we are only attacking the terror strongholds in POK and Ma'am that can also be done by from inside india by using Surface to Surface missile strikes! So i would advise you to not spread wrong facts and advise you to use your platform to spread general facts not your own POLITICAL BIAS. Respectfully a \"Right\" Thinker", "sonamkalraofficial\nVerified": "Verified", "deepikapatra": "This is how one voices their opinion. Not by sharing a copied message, a Dialogue from a movie whose sole purpose was for entertainment. Not by sharing a picture you randomly obtain from interest solely made by a page to gain likes. Huge respect for you.", "parle_g.girl": "Well said 🙏", "mishaa.ratan": "🙌🙌🙌🙌🙌🙌", "avantikagupta": "@nakuldh read this"}