{"saxena_gyan": "Shakl se hi bekar ho ....baate to Sahi kr lo", "llki55555": "Jai hind", "veerrashtrawadi": "कुछ अच्छा बोलना नहीं आता तो कम से कम इस आलिये न बंद राख लिया कर...मानसिक बीमार लगती हो इसलिए थोङी दया है ऊपर थ ठहरी नारी जात..फेर वेही ढाक के तीन पात", "sohamdcute": "Kuch bhi kar le indian army ke bareme kuch boli na dekh le tu aur ha tere ghar me roj log marne lage to tu to normal hi rahegi na log marte nahi shaeed hote hai desh ke liye hisab se raho desh tumhara nahi pure 135cr logoka hai", "_._sandy__": "❤️❤️❤️❤️", "nehasdigitales": "Love love love the caption @mallikadua", "raval5739": "nice post", "archi_kayr": "U sooooo cute💕💖💞", "iqbal768": "Nice look 😍", "cash_graphic": "™🏖AM a digital graphic designer hit me up to get any 🏖Picture 🏖Logo 🏖Album cover 🏖Mixtape cover 🏖Video 🏖Banner 🏖Flyer", "burst_mod": "Love the caption... & of course, you ❤️", "lakhera_ankit": "Tu hi hai na jisne tweet kiya ki pulwama attack mai kitne din tak Sauk manaye Aur log Marte hai ye wo aisa waisa bola na tha na tune to sum mallika dua india se apna boria bstra lekar pakistan chali ja", "siddharth.shetty.52": "Aunty video kidar gaya", "rabiatahirbajwa": "@mareya_atiq yar ise ptla kr di tu does not she look like you like alot?? 😯", "anshuu_4": "Which lipshade? And scauz me, you look hot😍🖤 @mallikadua", "sonali.08": "🌸", "ayesha__oo7": "Hi", "tejprakash508": "hiii", "avinash_verma721": "Bhen ki lodi", "astrologer_sonu_bhargava": "Astrology by love or love marriage problem solution specialist, astrology by get your lost love back. If you are suffering business problem or carer problem then just msg me I will let you know what will happen with you also if you are suffering love problem then don't worry I already solved so many love matters so I will help you to shortout your love problem you can whatsapp me & call also in this number +91-9649730851", "ar.kiran_joshi": "👏👏", "prashasti_19": "Amazing Kavita 😆😅 @therichachadha", "sharmauttiyo": "Please when the nation is united against Terrorism and Terror country Porkistan don't make such videos and try to divide the country", "theeleutheromaniac017": "😍😍😍😍", "naushadn_": "@therichachadha O Stree , ye thi inki story, abto krdo apni kaveeta poori.", "vinodkumar967224": "Vrbiuti", "heena_kat": "Cute and Savage at the same time. So relatable 😊", "drop_that_low_": "Par Randi hai tu saali", "bhav_yeahh": "So beautiful 😍😍😍😍😍😍", "manav9148": "Bolne se phle soch le gawar jada smjdar mt bn..", "rkg.7311": "Very nice ho ji", "mansi_raturi1998": "Marte kyun nhi tum jaise log😡😡😡😡😡 @mallikadua", "shete4177": "I always thought Mallika Dua’s retarded behaviour was just an act. Oh well.", "uday7veer": "I saw ur post Mallika..dnt kno wat to say... May god give u plenty of sense... Get well soon pseudo secular...", "whazzzername": "I feel deeply sorry for all the shit you have had to go through for putting across very valid and sensible points. In my free time, I have been reporting it as abusive content. For everyone's sake, I hope these radicalised citizens, sadly also known as nationalists, see the fault in their ways.", "rahul.vishen_": "हमारी सेना जो रात की नींद खराब कर इनकी रक्षा पाकिस्तानी हरामियों से करती है अगर वो सीमा पे खड़े नही होते तो इनका बलात्कार रोज रोज किया जाता पाकिस्तानी हरामियों द्वारा और इनको मज़ा आता क्यूंकि इनकी इसी मे ख़ुशी है। बहुत मन है तो चले जाओ अपने पाकिस्तान और वही अपनी नॉनसेंस हरकते करो। और ना जाये तो इनकी दुकान बंद करवा दो जैसे सिध्दू की कर दि।", "chandusevak": "मलिका एक काम करते बोर्डर पर आपके पापा या भाई भेज देते है अगर वो शहीद हो जाये क्या तब भी ऐसा ही कहोगी", "hemamanojbhatt": "Jb tere ghar m marenge tb tereko pta chlega bhagwan kre us din social media jasn manaye dukh nhi", "nimeshnicky": "Hafiz shaeed ke bete ha ve bhadwe desh se bahar kro aso ko Pakistan m peda hu 😡😡😡😡😡🇮🇳😢", "omkaromijuyal": "@mallikadua Jab tere ghar mai koi marta hai tow normal react karti hogi na tu gobar ki shakal wali", "shivamtureha": "According to a video recently you upload regarding to pulwama terriost attack you compare it to people let me know apne kitni baar kisi bhuke ko Khana khilaya ya kisi Garib ki help kri? Dusri baat Indian soldiers ko compare krri ho aaj agr sahi salamat baithi ho na to sirf soldiers ki wajha se aaj agr terriost ka dar nhi h to sirf soldiers ki wajha se. Abhi zinda ho tbhi ehesas nhi h dard ka uppar se thoda bahut paisa h to maze leri zindagi kbhi border pe jarur Jana Agar mauka mileb to shayad thodi bahut respect aajaye aur aagey koi video nhi related to this topic warna 😡logon ko sahi krna hame bhi aata h...", "bhanwarsisodia": "2 rupees @mallikadua", "lifeneedsaholiday": "@mallikadua the most pathetic person! Just saw ur video where you compared these 40 soldiers lives with any other death happening in the country! Blue tick mil gaya toh apne aap ko Itna mat mahaan samajhiye mohtarma! It was not just another day! A terrorist attack and that too Of this kind is not as ordinary as u made it sound like! Pity your upbringing! Damn! Can’t even unfollow you coz was not following a shitty comedian like you 🤣 Get well Soon Madam!", "travelwithindian": "Randi sali", "abhinav8360": "Aapko dogi bana ka chodna chata hu", "suyashaaa_": "No shame..no loyalty..no fucking guts to stand up for your own country..ye bhi likhti na mc😂", "apoorv_711": "Bharat meh jo desh drohi hai unki *** ** *****", "futileslayer": "@mallikadua tuje aisi haai lgegi sbki ki tuje ladka ladki kya hizra b na mile as life partner. Moti baap se hi marwa lena..koi aur to tuje milne wala ni. Budhiya cream powder lga k sundar ni bn jaegi. Benchod gaand chatti hogi bollywood stars ka aur yahan bda instagram pe moti heroine bnti hai...marr jaa moti. Tuj jaisi moti k liye jgh b ni hai India mein. Jyada aukat hai to India chor k q ni chli jaati. Fatherfucker. Go suck your father's d***.", "kirtib1708": "Bloody bitch on 14th of Feb evening \" tera baap Jo aksar country ke against baat karta hai apne you tube channel pe us kameene ne ek haanth me sharab ka glass and holded a Mike on another hand and both were singing a song and enjoying a party , then same as on 15 Feb, 16th Feb (Tere ma baap) ...Tere Ghar ka koi marega tabi Tere ko samajh ayegi Kya hota hai kisi ko khona ..... bloody bitch .....tu ja border pe dekh tera haal kashmiri Kya karte Hain ya unke so legi ya fir vo tujhe Tere baap ke pass pahuchange.", "veer_pratap_singh07": "Mulli madarchod randi bhag ja hindusthan s wrna khead k fek denge tuje randi", "ananyarai55": "The caption is bang on if she herself understands it", "sachin__youngthug": "Idoit Girl ..Stop Talking Shit About @manjullll Samjha Mey Aaya Kya", "rishabh_shukla": "Nikalo desh se r", "anilesevr": "Nice pic...", "devendra_sahu_ds7": "तू धिक्कार है महिला के नाम पे", "abhishekdubey575": "जैसा बाप वैसे बेटी गांदी नाली के कीड़े अगर हमारे आर्मी का सम्मान नही कर सकती तो अपने बाप की तरह भोका मत कर। न तुझे कोई जानता है तू बस फालतू बोल के मीडिया में आना चाहती है गांदी नाली की कीड़ी ।।", "mr.gauravaggarwal": "Tuj jaisi un kutto ki trh h jo jis ghr me rhte h usi ghr ki burai krte h....agr tuje itna hi pyaar h pakistan se whi jaakr gaa*d mra", "gulnaz.asi1": "More power to you girl.......", "hangabali": "😍🙌🏻", "masaonanchal": "Check this page for hand painted shoes @artistmasaon", "shrmavivaan": "Watched your igtv video but I wanna tell you not everyone is fake patriotic , should they not post anything on social media ? Then they will be patriotic wow", "sutanu_mondal22": "if we go to war we will kill others and win it hum nahi marenge......we will win it by killing others and put a full stop to this...", "nikhilparihar_": "Haatt gandi chakal wali tumare jese log boj hai iss desh k liye....pehle se toh vajan zeada hai moti", "__sarvan_": "You iz a tatti person, fek uhh", "ravisoni.life11": "Akshya Kumar b pura na pd rha", "rahulyadav_941": "Pakistan ki ma ka bhosda", "ashu_punjabi": "Isko unfollow krdo sab ye bol rhi h ase log to roj marte h to shok Kyu manana isko power bta do youth power# youth power show tym", "_swagatam_debnath_": "Comparing martyrdom with other death causes was a foolish thing mam😅 rest i agree with u. Ye social media me logo ka post krna, fir likes aur followers bdhaana...tiktok nd all, those r really bullshit things😪. Anywayz...hope ki terrorism ko uproot krpaaye hum jaldi se jaldi 😤", "khota_shikka": "Humri bainshiyaan jaisi lagti ho", "_shooting_star_108": "बाप तेरा सूअर मा तेरी रंडी go back to your Pakistan बहन की लन्डी ।", "arrpittt": "#Randi", "vishalsharma96_": "Moti Bhais", "im_chetan19": "Follow kyu kar rakha h logo ne ab tak issey..", "nik_chahal_1": "Doob k mar jaa Chudail", "sangeetarajput44": "Nonsense", "coolstorybrrooo": "My two cents: 1. There's no need of making fun of people who YOU think are lame, disgusting etc. Don't like tiktok? Don't like a particular person on tiktok? Don't watch, move on. If those people who you commented on would come to do the same, I am sure they will get 100 more reasons to get back at you. 2. Now I don't even want to explain whats wrong with your comments about people dying. Because I know, you won't get it. In short, sometimes you just have to shut up and let the world be, let things fall into place slowly and settle down. The time and space that you chose to let out your comments was not appropriate at all. And no, I value a soldier's life more than anyone else, because like me and you he could have also gone for a corporate job or start making lame tik rok roasts on his insta ID. But when he joined the army he knew what he was signing up for. Peace!", "iamsid1997": "Army se ni h syad tumhare ghar thts why you bullshiting these day seriously I laughed badly on your posts your posts makes my day but this time you lost it 🙂 i hope kabhi tumhare ghr me koii ajnabi aajaye or wese hi kare jaisa kasmir me hua but you lost one follower today sorry Mallika ji", "imvishalraghav": "jab shakal acchi na ho to baat acchi karni chaiye...@mallikadua", "seeker_of_truth143": "Fuck you asshole @malikadua, u whore sitting in your home n talking about Indian defence ,,whore u r still alive just coz of Indian soldiers n u bloody randi making comments on Indian army ,Teri maa ki esi ki tesi asswhole ...", "rohit25666": "Teri maaa ki choot randi mulli", "vishakharao_": "Ufff the lipshade bro!", "jabarsingh_pld": "भाइयों और बहनों ये लड़की वामपंथी नक्सली आंतकी जर्नलिस्ट द वायर के संपादक विनोद दुआ की बेटी है एक आंतकी नक्सली समर्थक से आप क्या उम्मीद कर सकते है ये भी jnu आंतकी टुकड़ा टुकड़ा गेंग की सदस्य है इसको ज्यादा तवज्जो मत दो विनोद दुआ की प्रोफाइल देख इसकी पूरी जन्म कुंडली समझ मे आ जाएंगी ये मॉडर्न नए जमाने की लड़की होने का नाटक करती है लेकिन ये है एक आंतक नक्सली पाक समर्थक की एक बेटी है इसको ब्लॉक कर दो जय हिंद जय भारत", "bharadwajsanjay": "flop ass bollytard", "its_karshi_daryani_": "I was big fan of urs, but now I feel ashamed ki ese Indians bhi hai, Tume pta hai jinko Tum compare kr rai ho vo mare hai or hamare militarians shahid hue hai, shahid ka Mtlb bhi pta hai tuje, kuch janwar hamare hi ghar India m ghus kr hamare hi army ko attack kr Rae hai, vo army jinki vjh tu or hum sab Shanti se jee Rae hai or hadd toh Tb hogyi jb tu itne bakwas bat boli ki or bhi toh log marte hai toh kya hume roz shok manana chahiye, an toh tu maregi na Tb bhi kisi ko koi afsos ni hoga smji or tu insan bhi ni hai, u r such a shame unn aatank vadiyo k sath tuje bhi Marna chahiye", "augusstuus": "Abe gadhi bhokh maut aur tu tere baap pehle army mai join kaur fir chaman chutiye wala remarks dena .. gawar kahika", "ram_rk_01": "Hello hypocrite @mallikadua , if innocent people of nation showing their emotion for army and it's seem drama to you then what your fake feminism drama you all were on AIB like you brave people were quite when your team member harrased a girl.. bolne ko bhot kuch he aisi baate he ki yaha sabi log tuje india se nikal pehkenge , chup rehna chahiye tha iss army attack ko lekar u idiot apni third class nonsense agenda waali comedy idar nahi karne ka tere baap ki jagari he kya meri army ko lekar b apna gatiya attitude chalaygi you dufffer. Now i understand why you people were called anti national.. and all those who are still supporting please find this 3rd class liberals logic if they find many social issue they do protest across nation calling youth with social media campaign and fighting with own people but when own army been burnt alive they plea for peace to be quite?? Seriously becoz you people supporting them they are doing more. Please for sake of my nation stop supporting them", "suraj_mandalk": "😈😈😈 kitna ghatia soch wali ho xi xi", "shri_shubhii": "I used to follow uh n adore uh but after that statement of yours m really hurt aap sabko kse ek hi title me rkh Sakti h or peace k chkkr me India ne pehle hi bahut kuch kho Dia h kya krenge aise peace k jo aantankwadio ko janam de or humara future brbaad kre islie aaj agr kch Bhartiya Shaheed ho jate h desh se aantankwadio k hatane k lie or hum unko support krte h to kya bura h isse kmsekam kal to humara acha hoga na... Or Rahi baat patriotism ki to ma'am more than 80% people in ur country are true n faithful towards nation .... N byee m unfollowing uh", "adhiraj.aadi": "This pic is a load of shit", "_no.bi.ta_": "Na daal na kachori, tu h behn ki ****...", "mannay17yy": "Guts the size of mt everest + glorious actor and entertainer + LEGENDDDDD + storyteller = Mallika Dua", "deshmeramahan": "Jo jo iski chamchagiri maar raha koi bollywood mae break naa dilwayegi samjhe gadho toh faltu buttering maat karo😂😂😂😂", "leopard_1lyfnvibes_vivek212223": "Kya gaali du tujhe jaaa mar ja doob k yhi shi h tere lie hutt", "yashwantsinghbedi": "Beautiful", "thezeusop_": "Boycott him and unfollow everyone.... She is going thorough mental disorder.", "iamzaid007": "Hate u. Bitch. U are the worst civilian.", "arpita_______": "Can we not treat her as a celebrity please, such a bimbo . Yesterday she was comparing poverty and terrorism all together, and telling people its okay to live your regular life ,today she is posting video of @manjullll and others , making fun of them . First of all as you get paid through all your stupid shit , these people don’t and also if you have rights to speak all bullshit these guys are actually creating awareness so that everyone stays united because for you and your dad may be this is an another bomb blast for for rest of us its a big deal , yes we may not go and fight with pakistan but also not demean the sacrifices of our heroes. Unfollowed you yesterday, hating you more today !! Then she will be like i get trolled, bimbo you deserve it💯🙏🏻 i wish Instagram could provide some brains with the lifestyle so that such stupid creatures could at-least have a life !", "beingmasoodh": "Can i copy your caption 😗", "prudhvi_pawar": "💩🇵🇰💩🇵🇰💩🇵🇰💩🇵🇰💩🇵🇰💩🇵🇰💩🇵🇰💩🇵🇰😂", "girish_dhanawde": "ये #टिकटोक वाली #इंस्टा वाली लड़कियां अपनी दुनिया मे ऐसे मस्त रहती है की इनके वीडियो देखकर लगता है कि ये अपने आपकी और अपने बाप की कभी नही मानती होगी, जैसे वो मानो वो इस दुनिया की है ही नही बल्कि किसी परग्रह की वासी हो ◆एलियन हो, इनको देश मे कितना आक्रोश है, देश मे क्या चल रहा है, कितना खतरा है उससे कुछ लेना देना नही, उससे कुछ फर्क नही पड़ता, इनका तो बस वीडियो 2 घंटा भी अपलोड होनेसे रुकना नही चाहिए, जैसे पाकिस्तान से ही वीडियो रिलीज करती हो, इनकी ऐसी हरक़तोंपर अगर कोई सवाल खड़ा करे तो ये उसे तपाकसे \"ऐसे तो रोज मरते है\", ऐसा संवेदनहीन, बेशर्मिसे भरा जवाब भी दे देती है, बात दरसल ये है जो भाई शाहिद हुए है ना उनमें कोई इनका सगा, कोई रिश्तेदार शहीद होता नही है ना, इनपर व्यक्तिगत कोई आंच नही आई है ना, तो ये बेशर्म लडकिया उन शहीदों के परिवारोंका और देश का दर्द क्या समझेंगी वर्ना ऐसा बर्ताव, ऐसी नैतिकता कमसे कम हिंदुस्तान गम में डूबा होने पर तो नही दिखाती, कुछ देर तो चुप बैठती, इनको ये समझ नही की हमारी सेना है इसलिए हम सुरक्षित है और टिकटोक बना रहे है। (इनको सपना चौधरिसे कुछ सीखना चाहिए)", "bful_me": "@mallikadua I really used to like you but das your video and I feel in the name of liberalism your thoughts were so loosely built ...How can u compare natural deaths and army dying for us and that too not at war but just innocent soldiers ...I m not saying let's go at war but I definitely condemn such acts . We have been too tolerant ..But how can I expect people with too liberal and considering them with such a great sense of humor (pun intended) understand this thing . I feel sad for you and kind of people who think like you . UNFOLLOWING you .", "garimatyagi05": "Ban this bitch she’s forgetting it’s the social media and the same people she’s laughing at that made her famous kick her out of india sali maj go fuck ur self you wanna be bitch people can show care and patriotism how ever they like who the fuck are you to judge", "rishuuwuu": "R E T A R D", "wondersuv": "@mallikadua -boss lady you are!!🌼✨💜💜", "r.i.d.d.h.a": "You're beautiful❤", "vaibhav.garg.ji": "Pakistan ki maa ka bhosda😠😠", "kapilvarma_m4u2008": "Raand tu rehti kahan pe hai.. Agar tu ek baap ki hai toh tera address dede..", "jnujanak": "Chal bhag bahen ki lodi", "pushkar.153": "Ohhh bahn ki lodi rand", "_02raghav": "Tera baap vermin nhi hai kya bhosdiki? Baaki log MeToo lag rhta tha toh rand ki tarah uchhal rhi thi. Baap par aaya toh account deactivate kr lia vermin ki aulad.", "shrutikikii": "so whatever content you post on your profile is fine? and if people want to express their emotions even with tik tok or their social media post , you term them rubbish? i know you've been getting a lot of backlash but that doesn't give you the right to make fun of other's who just wish to post thing's in support of the country, Even if that's fully crap but still making fun of them, now that's wrong! If you wish to live your life on your own terms then let them do the same It's just disheartening to see a person like you doing this i mean ya you can go with your life but please don't make fun of such a sensitive matter you have a fan base who follow's you , and take it from me all of your rants and everything they might be right, but the way you are projecting it, it's just insensitive", "rajawat24692": "Pak aur yeah dono hi mc hai...sale", "mauryaabhishek1997": "Hey you asshole, I just saw your igtv video, you fucking cunt, for fame and name you all are same,you can give your ass to anyone for name \"Lekin ha jyada mat diyo ki bardast hi Na ho\"", "_khushi_sri_": "Didi 3000 gali Dene k liye follow kiye re tereko🙌🇮🇳", "saggidboi": "Bhen k lodi", "_supriya_rao_08": "Bhess ki bacchi mp mat ajana kabhi yahi se pakistan phocha denge tujhe tere jesi paise ki bhuki ladkiya or kar hi kya sakti hai jab danish zehen jese chakke marte hai tab tum log rote ho or jab desh ke army wale shahid hote hai tab gyan chodte hai saalo atankwadiyo se pehle tum jese madharchodo ko marna jaruri hai", "katekamlesh": "U r bigger asshole i have seen", "arvinder_kaur": "Okay. I usually refrain from commenting bad things but this is disgusting. I agree with some part of your video but are you really stupid enough to say that NRIs are not Indians enough. Isn't it an irony? You blaming others netizens nationalists that blame you for not being an indian enough because you are moving on with your life and you are doing the same to people living outside India. I don't live in India and I have felt the same amount of pain as my fellow countrymen. Do you even know my reasons as to why I had to switch countries? No right. Then why are you so stupidly ignorant to claim that we all think India is not good enough for us? I understand your concept of speaking your mind and not giving af about others but wouldn't hurt you to be responsible enough and to think before you speak and post. That is basic common sense. I was a fan but sadly I no longer want to follow you because of your heights of dumbness you have just unleashed .", "param02feb": "Fuck gurl get ur fucking life u are such a dumb ass cow looking bitch", "fitnessfutureclub": "Shakal acchi nhi h to baat bhi wese hi karegi ghatiya aurat jo bhi tune aaj huga h na muh se tujje itne jute padne chaiye ki puch mat tujh haraman ko kisne bola tu jawano ke liye aasun baha par unke liye aisa kese bol sakti h dayan mar ja kahi ja kar", "krunalyenurkar": "Fir to tera maa-baap jb marega tab bhi mat rona tu .kyuki har roj log marte hai....randi paidaish.. #pkmkb bhenchod ,badsurat randi", "nileshkulariya_": "kataii aukat k bhaarr he bolri haii ue antankwadi k deah wali..", "drj_chauhan": "Tere ghar me koi marega to tu bhi normal he rehna thik h, rona dhona mat chutiyapa mat felana....Kisi ne sach kaha h pehle desh me jo kachra h uuse saaf karo, aatank to saaf ho jayega", "an.kit9333": "कुत्तो के सकल जैसी तू हैं", "aditya_s_i_n_g_h": "Pakistan ki sympathy Pani h kya tmhe 😑 u r the biggest piece of shit I had ever seen..fucking idiot", "harishbhadana21": "Kutiya ...randi", "_aniruddha1999_": "abb log kahengae @mallikadua ki maa ka bhosda", "richaamisra": "So you just think dying of poverty and hunger is same as dying because of some 350 kg explosive .. it is good to speak about such issue but there is time . You just trivilized the whole issue .. like its ok .. you disrespected the whole lot of army who die serving for ppl like us . There is time and place for everything . Be swcular be liberal but not at cost of someone's life . Rem when someone accused your dad for molestation and you kept your feminism aside and defended him .. like that when some fellow countrymen are dying because of terrorist it is good to be respectful . If you cant than behanji please shut the fuck up .", "abhishekgaurav964": "Marwaa ke manegi😂", "ravishsingha11": "Maam check dm i have sent a tik tok related to your story", "i.mkartikk": "Jo story daali hai na tumne ye aaj srsly u r a useless piece of shit...Aunty jee thass their way of showing their patriotism and respect to the nation... atleast they are showing..yeah they may not be so perfect in lip syncing..acting or whtever...but tht is showing their love towards the nation...if u can't praise them atleast do not mock them ... maybe u r too perfect in all the aspects of life but we ain't...stop making fun of them...agar gooda hai ...to mera ye reply stry mein daalio...reply krio iss cheej ka...lemme see how will u defend bloody urself..shmeless...feel pity for people like u...", "_tushar__joshi_": "Saw your igtv video ..felt bad for what you said and how you compared matter of national security with hunger and poverty ... this concerns the whole nation not just one person .. remember a simple thing we all are sleeping peacefully cause someone from our society or city is out there at the border gaurding us ma'am...... there have been situarions where my friends have stood for 20 hours non stop under gunfire... we get fake nationalism and all the people who at", "umjyotish": "@mallikadua abe lodi ...sahido pe kya ulti sidhi comment marti hai bhosdiki 😈😈", "shloktiwaryy": "Tere father ki death hoti tab bhi yahi kehti???", "shwetank_bajpai": "madarchod moti bhains (buffalo)", "rajsingh7_official": "Bahenchod", "devpriyabisht": "Tujhe itna time kese mil Gaya ... Tick-tock ki ek ek video Nikal k status pe daali h... Just to proving yourself right.. but you know what you've already declared wrong in social media and national media channels.. so stop collecting evidence for your case. You are guilty.. you irritating fat ass..", "iam_sachindra7": "Maki Lodi Randi aurat Tera baap Mara Hota Tab tuh Ye Sab chod naa karti Tere Jaise log paida ni hote hi Galti hi apne baap ki or Condon naa lagane ki Raand ki aullad . Apne Desh ka Jawan Hindu Musalmaan dekh ke Raksha ni karta hi Ye baat samjh Teri maka bhosda maroon", "insane_madness17": "Dhabba ho tum Naari aur Indian dono ke naam pe @mallikadua Hate you so much #PulwanaAttackTweet #Boycott #NotATrueIndian #Useless", "muffin__head__": "This horrendously ugly lady keep shitting her views on the social media and when others do the same she says tumhari aukaat kya h?HEIGHT OF HYPOCRISY!!", "poojapariath": "Love the caption 🔥 Gorgeous pic😘", "ihrishi__": "Madarzaat bol Pakistan 🇵🇰 Muradabad", "shubhu_kothari": "#pkmkb", "madamthinkalot": "Smartypants.", "imshreenidhi": "Side face me you look hot, did you use Kylie Jenner ka bottle cap 😍😂", "gyanprakash1122": "Pkmkb", "robindubey26": "@mallikadua सुनो बे लड़की अभी तुम्हारा आईजी टीवी वाला वीडियो देखा। तुमने कहा कि लोग तो भुखमरी से भी मर रहे हैं। अभी जो जवान शहीद हुए हैं वो इस देश की रक्षा करते हैं। भारतीय सेना या किसी फौजी से संबंधित बयान आगे से कभी मत देना। ये जो लीजेंड बन फिर रही हो ये जो देश में खुली हवा में सांस ले रही हो ये उन्ही जवानों की वजह से है। शर्म से मार जाओ, जवानों की शहीदी और आम जन मानस पर भुखमरी जैसी टिप्पड़ी कर रही हो।", "killshot_0p": "You fuckin fatso weight to loose ho nahi raha tujhse aur comment karegi hamare soldier pe abe lakho log marey ya fir billions me mare log poverty se ye bata ki unhone kya kiya hamare liye what have they done for the country poverty se bohot log bahar bhi aaye aur life me bohot kuch kiya bhi ek din border pe jaake dikha de dono chutad laal ho jayenge samjhi moti agli baar bolne se pehle sochna nahi to tere ghar pe surgical strike ho jayega😡😡", "sona.p24": "I loved each and every word u said on igtv. Much love and appreciation @mallikadua ♥️ ppl are exactly the way u said .!!", "boruah_madhusmita": "Lot's of love from Assam...keep smiling😍😍😚", "letherbeanonymous": "U are seriously gaining attention in these sensitive time. People have emotions so they are gonna say whatever they want wherever they want. That's what u are doing since a long. So why do u have a problem if they make tik tok videos, post pictures or comments. U are losing respect n gaining attention for all the negative things. Why are u giving competition to rakhi sawant? Attention seeking is her job. At least her reactions r hilarious. U r just looking like an idiot hungry for some attention.", "aksamin": "Did you forget to add you Pervert Rapist Father into the list of problems all are facing in the world.", "rahulbhadane08": "U used be my one of the fav Insta Artists but not anymore after ur statement for #pulwamaattack ... such a bogus mentality ppl like u have in Hindustan #unfollow", "souravshiv0": "Yeah bcos u r still ugly , no matter whatever u do bcos u will end up being ugly , yeah at the end u r ugly , even around the gully u r ugly , this wont change the fact that u r fatty , and u will always be fatty . U signed a troll warrant for urself by speaking shit , no u will get shit , to eat , sleep , repeat .shit shit shit", "aniskant_132": "Unke ghr valo se pooch kitna dukh hai unhe.. Tere saath aisa ho to ek baar sochke to dekh.. Hua tera saath tab bhi yhi khegi bla bla bla.. Hum b keh denge ku aansu tapka rhi h beyy? @mallikadua doosro ka mzaak udaane se pehle khudko dekh... Tu khud ek mzaak h bitch!", "selfobsessed21": "Bloody. TRAITOR. Go suck d Pakistani dicks bitch!!!!¡!!!", "arjunsharm.a": "#pakistani @mallikadua 😡😡😠", "the___sheikh___": "@manjullll", "lifeofakshy": "Mallika Dua is the perfect example - The fatter the Feminist gets, the more senseless & cringy they become", "dustyy_bunn": "❤️", "lokeshsingh2111": "I hate uu ..for ur shitty things..itna chutiyappa kese kr letii h behen", "sujit.majumdar": "Unfollow Karo sab Iss ko", "_be.likeme_": "Ma'am sorry to say.., but how pathetically you are comparing our indian soldiers with unemployed people's.. who are dying with hunger or depression.., our Indian army sacrifice their life and just coz of their sacrifices you are safe in ur country .., sleeping on the soft bed .. and they ..,! They are hustleing on the battlefield... dying for us coz they think that we Indians 're with them,, we are here to support there family after them.., w/o border per roz Marte h taki hum log zinda rhe #soldierneveroffduty .., aur aap jin logo ko apne video m \"nakli patriots \" bola jo social media per apna gussa aur desh k liye apni ahemiyat show ker rhe h ..at least ghar beth k apke jese gyan nii de rhe h.., apne to video bna k daal Diya.., bc log bhuke Marte h to w/o gov ki fault h .., lekin desh k hee log apni army sacrifices ko aise compare ker k ignore maarte h to yhaa ❤️ dard hota ..lagta apki family se koi Mara ni gya na desh k liye..,, jao jaker ek din k liye loc., border per ., Kashmir m Jake as army man ban k kaam kero shayad ghamand kum ho jaye apka..,", "ll.sarthak.ll": "Bhen ki loode tere jasee randi...ko es desh se nikal dena chahiye", "aaneka88jin": "Baap molestor beti ek no ki jholar.", "selenagomez_____________sel___": "Saali saste nashe krti h", "aprajitanegi_": "💖", "_komalmittal_": "Beauty beauty 😍", "black_heart.91": "Pegamber ka maa ka bosdaa😠🤣", "pokhraj.roy": "Anti-Tik Tok Movement led by Monica Dance. @mallikadua", "i_harsh_deewana": "Actually feel like just because u have mouth doesn't mean uh should use everywhere somewhere there was a fear in ur video zaroori hai yeh daar dont insult the emotion of our country its a loss we didn't say stop ur work but at least be decent and genuine to ur citizenship", "iabhiarora": "Tatti saali", "ashutosh_bajpayee": "kaise kaise namune hai duniya me, usme tu pahle no1 pe hai", "the_quidditcher": "@devv1x your point is missing something, India is a country of great great diversities you can not find so many cultural differences in the whole Europe the only thing that ties us is this incredibly elegant thread of nationalism you can not and should not joke upon that", "hrishabh_bhatt": "I have a firm belief JEM n ISIS are looking for her because she is the latest weapon available in market...VENOM SPITTER....one's personality and actions are simply the reflection of his/her upbringing.", "chinmayavij": "Besides the all the haterred you're getting here!! Just want to say that you are savages ki kween! Love yaa kyauts😘😘", "lady_love_11xoxo": "Wow❤️", "arun_kumar_sharm_a": "chup sali tere ghar koi marega tab samajh aaega tujhe.. lecture de rahi hai..", "dravyapatell": "Actually its not your fault. Jaisa baap waise beti", "anukhabde": "@mallikadua I was not even knowin her b4 ,mere cousin ne iski ig story send ki mujhe , @mallikadua You are disgrace to our country, you posting those tiktok videos in your story n makin fun , none of the video ws made for likes and stuff aaj kal social media chalra h n they was just makin videos related to soldiers lyf ,by expressin the pain n the loss in their captions ,unlike you speakin bullshit n comparin our soldier wd other lives dam they just owe their life for us and @least tiktok ppl are not makin shit igtv thng n then coverin that shit by repostin other sensible post by misguidin ppl but most of ppl hv make out frm ua igtv thng what u really meant ! Litrally you are nonsense", "rohit_rana_sharry_rana": "Chal bhen ki lodiii", "ashish.ks99": "👌", "ws_abhii": "#pkmkb🤣🤣🤣 or support krte h unki bhi #mkb adhkatti lulli ke🤣🤣🤣 @mallikadua", "devv1x": "And I can feel the jealousy lol 🤣🤣 you're so jealous of people like manjull who are more famous than you. You cry cry lil ass bi*ch", "nitish_thakur008": "Mam jb Teri family s koi Marta na tb teko pta lgta agr tu esa he sochti hai to Pakistan he chle ja bekar sali chutiya bc", "arifs828": "Please stop posting your lost twin sisters pic. 😋", "zanthosh_kumar": "Vinod dua or uske beti se ab kya expect kare 😂 Badi badi bate or karthute bilkul vahiyath.. and when people call you out.. take the matter in to your ego and start whining 😂 LoLs", "_ddeekshaa_": "Bitch face", "bajpai7289": "Aap bhi chali jao pulwama. Lgta hai aapko bhi pakistan jana hai.", "gopy5511": "Nice", "_chiraag01": "🖕🖕🖕🖕", "savithasridharrao": "Both comedians proved they have peanut sized brain minus heart😊", "bhatt310798": "Chichichi ye kya बवासीर है 😡", "its_rohan2020": "tu kiya bolti h un logo ki pizza kharidne ki himmat nhi teri kiya okad h abe agr khud ko itna hi amir smjti h to ambani ka gar kharid kr bta or chup chap mr jaa yha se mera bharat chhod kr chali jaa tere vatan pakistan 😡😡😎😎", "salilsinghpawar": "Love😍😍😘", "thought_column": "Your new IGTV makes me sick lol", "nidanazir_": "Gorg! 🔥", "mr.ash8": "Pak calling u bitch🤣go n make bomb 😂😂 #bakrich**d", "aastha_sharma2312": "Apne papa Vinod dua APNI bhen APNI MAA ko bol sarad pe Golli khaye tab aakke btaio yeh Sab bakwass batein. Tum log desh Ka cancer ho. Sharam aani chauye tuje . Or sun coool Tu bilkul ni hai Sada hua do paise Ka cheap joke Marti hai bas", "naimish_sharma": "Roses are red tere jaise logo ko khte h moti, mallika dua tu h sbse bdi bhnkilodi #nohate or tu schme mdrchod ki bcchi h", "rishii1432": "Sorry to say but teri maa ki chut", "123virat._": "instead of fucking her i thing we all of us need to report her account randi kahi ki💩💩💩", "rajeshsinghraguvanshi": "@mallikadua pays to Mia Khalifa ki b ni bhujhti h", "nuralsabz_204": "Haye me marjawa😍😍💖", "mr._mahadevholic": "Bloody asshole shit", "tanushreeduttachoudhury": "Can you please do me a favor telling how can you be so sweet all the time please. Like this is not fair, humesha itni cute kese lagti ho @mallikadua", "madridista_kanwar": "God will kill your family members then u know how hard it is losing your family members", "non__ducor_duco": "Yuk @mallikadua urf Pakistan ki jasoos.... Bahar jyada mat nikalna... Kahi log Pakistani samajh ke pakad na le... 🤣🤣😂😂 BTW I would be more than happy to see this... You deserve every slot of remarks you are getting...", "deepam2050": "Looking soo awesome Ma'am...big fan😍", "dg.yoyo": "Think before you open your dirty mouth", "kaim_ankush": "No one ar", "sachin02206": "Tu aur Tera Baap dono Chutiye Hain BC .", "amar7singh": "C lagti hai", "dearbithika": "That lip color is dope !", "girlwhoneverknew": "Caption 💯", "marshallmathershvsgs": "U die motherfu¢ker", "snehjadeja": "@mallikadua Showing guts you have got by insulting the martyrs, No glory in that.", "poonam._.joshi": "Boss lady @mallikadua", "spamnikka": "Hii lipstick shade please 😂?", "h.a.r.m.a.i.n": "Uh thaa best🔥", "s_h_i_v_a_y_666": "After Pulwama, whatever you said is correct but only up to some extent,still overall it hurts any individual. Some statements are so illogical that now I don't like see your face either.", "akshey_akknxx": "Bhen ki lodi kutti randi sali", "oneband1dream1direction": "Didi thoda makeup aur laga lo phir accha lgega", "lucknow032": "😂😂😂😂😂😂😂😂😂😂😂", "jagdish_menaria95": "Tum jese log saale social media platform ka galat use krte ho. Tumhe aajadi h mtlb tum kuch bhi bologe", "shivinsharmaaa": "Just saw somewhere where you said \"people die everyday\" statement like this. I just want to ask do you have any shame? Or you are a pakistani? Coz prople like you should not be allowed to stay in india.", "dilkusha_khan": "🙌🙌", "radhi_ka._____": "Kutte jaise bhuakte hai... Ye @mallikadua unme se ek hai. 😂😂😂😂", "niki.3161": "Bhen ki lode maaa chod dunga teri moti gaand", "savage_harsh": "Lagta hi apke barbadi ka samay aa gya hai, you are digging your own grave, kyunki jaise log marenge waise tu bhi maregi, fark itna rahega ki jaha log dusro ke liye khud Ko Kurbaan krenge waha tu maregi", "rahulanjaliydvv": "Iske ghr me koi mraa nai h na.. to kyu isko farak pdega.. jo iss desh ko army ko apna smjhe usko pdegaa.. bekar mind set ghatiya 👎 shit lady", "akansharai6383": "Chutiya lgti ho pr batana jruri h ky @mallikadua", "amitsri7": "Your father's name is vinod dua and you are so negative @mallikadua. Can you ask your parents and confirm that deshdroh tumhare khoon mai kanha se aaya?", "anuragkuumar": "abey maaa ki laudi ... tu terrorism ko bhookmari se compare kar rhi ... madharchod sali hrami @mallikadua", "_rahmath_6_": "Haha", "gaurav_bhardwaj0007": "Randi ki bachi suar ki pilli baap ka pta ni or fir se apni maa chudane nikli 😂", "anil3046kumar": "Bitch", "akssh_halamadrid": "Mam do not know why some pages are posting some shit against u.. I saw u for the first time, I heard ur name for the first time.. saw ur igtv video which was way too the point.. I would urge u to take some serious actions against the people bitching about u.. Some pages just wanna earn some followers throught the way of desh bhakti.. but chutiye hai vo log. they do not know immediate attack will take some more lives of our Soldiers.. which is not okay..", "ni_x_o_n": "🖕🖕", "rockymambabdd": "Pagal aurat. Tera career, Teri Zindagi , sab toh kharab hi h. Koi doubt nhi h usme. Agar Kuch Dr nhi Sakti toh kamm se kamm izzat toh de army soldiers ko. \"Harr rozz marrte h wo log\" aisa Bolne se pehle Soch. Wo tere Jaise chutye aurat k lie marrte h! *Useless ASSHOLE*", "y.our_space": "Plz check ur dm", "aniegupta001": "I don't know how many times I saw this same caption on instagram. It's so famous.😂😂", "i10jason": "Dekh aunty tujhe agar koi fark nahi padta 44 jawan ke marne se koi baat nahi tu bita apni zindagi normally lekin zada gyaan mat chod logo ko kya karna chahiye nahi chahiye tu aur tara rapist baap apna mooh bandh rakh tera baap lodu aur tu auski randi aulad ja jake apni Pakistani attankwadi se gand marwa le motherchod randi!!", "notreallynirali": "Ignore these low lives. Keep slaying.", "ellel22": "That lip shade is amazing!", "poorva": "I am sending you lots of support and positive energy. Hope you know that all this negativity being directed at you is a reflection on them and not you. And I also want to acknowledge your bravery and strength in your convictions. It's not easy, thank you for making it look that way. 👍", "mamta.v01": "Ab gaaliya khaiyo logo se .....Sidhu ko dekh k hi sabak l leti...Sach a cheap lady .....Or kuch ni mila jo iss pr cheap publicity stunt bna liya...", "fmwdotcom": "You look pretty and your coat looks nice", "_carborundum_": "the people who are abusing you are just assholes with sooooo low exposure that they can't even spell patriotism properly.", "jitendrasingh_khangana": "pigi🐖 girl", "richasharmaofficial1": "What a bitch", "aavwii": "Ye Bollywood kuch madarchod see bhari Hui ye ..like swara Bhaskar , sabna azmi and ye.. ye Sab ek jaise he ..", "__deepika________": "Randi k oulad", "drraman4339": "Nice", "ali_shaikkhh": "@mallikadua 🖕🏻😂", "yash_patel_11_": "MC...tumhari aukaat hi Nahi he iss country me rehneki", "pawan_73______71": "Age randi pel denge burmari", "palak_r1708": "@mallikadua Same on you 👊 , cheap publicity stunt.", "er.monil_28_9_6": "@mallikadua Pakistani Kahi ki nikl Pakistan l*** b***i", "palak9756": "@mallikadua Didi lipshade bht beautiful h 😍😍😍 konsa h", "_alok.mishra_": "Motty is doing all this nonsence for cheap publicity", "ankitshanupunj": "Kya bakwaas h madam ye dimag h tjhme ya nahi logo ar soldiers m Fark nahi pta tjhe Jo dunia ko bkwaas sunari h unki ijat krni nahi hoti to apni bkwaas apne Tak hi rakha kar", "fit_nd_bold_3": "😂😂😂😂😂😂😂😂", "sneha1233": "Nationalism is never fake😠", "st.sky_18": "moti", "theshivachild": "Bhaiyon please itni bhaddi language use mat karo bolna hai to kuch aisa bolo ki muh hi band ho jaye 🙏🙏🙏🙏", "xriteshjha": "Jaan kabhi mere niche aao na mast publicity dunga 😍😍😍😍", "priyankamahesh": "@mallikadua You are the best and ignore all of those people who trolls you for being honest. Coz they just know how to create a social media account and comment rubbish on others posts but don't have the sense and respect on what to talk on these platforms. This really shows their level of education and maturity on how to react to such scenarios. I hope and pray they grow up and think practical towards doing something for their future", "kavyashree_gogoi": "You're my favorite💕", "rajat.dariya": "So this talentless whore is gonna tell the nation whether to mourn the death of our national heroes or not? Why can't she stfu and let people do whatever they want? Can't even be sad in this country ffs. 🙄", "shruti_gaddamwar": "@mallikadua more power to you. Respect for taking a stand as courageous as this 👏 #superproud #girlwithanopinion", "shubhambhardwaj2838": "Itni to tamiz rkhiye k jin logo k ghr s sahid hue h unpr kya bitegi ap ka post pdkr or chpl marne ki bol rhi ho ap b un pthrbazo s km thodi lg rhi ho is time... jo hmare fojiyo pr pathr fekte hsi..", "anitasharma_1820": "Pretty girl! 🔥", "ps.pearl7": "@anjuyadav___", "srirachakick": "Just woww @mallikadua", "flyingcaptainshri": "Aaj tu aur Tera baap jo bhi aazadi se jo chutiyaapa kar rahe hai na woh fauj ki vajh se hai, toh mai toh expect nahi kar sakta tujhse aur tere baap se kuch bhi nahi fir bhi apna mau band rakh.", "thakur.gaurav.singh_0007": "Tu madherchod Randi hi Randi hi rahegi kutiya salli", "am_mansi": "This comment section makes me sick to my stomach. @mallikadua Please stay strong. Please! You’re a gem! Love and hugs.", "tanuja__chandra": "Beautiful girl.", "__jhalli_": "I think I understand how you feel when these hypocrisy happens... But the best thing is to avoid them or answer the same way you are doing.... Superb human being u r. ❤️ @mallikadua", "the_palate_teaser": "Banno tera swagger lage saxy😍😘❤️", "khyatimahra": "These people will take a decade to understand whatever you are awesome ❤️ and kyut !! @mallikadua", "raulrainer3399": "Thodi is akal abbe molester Baap ko bhi dede... https://www.thequint.com/news/webqoof/vinod-dua-uses-edited-clip-of-gadkari-interview-to-show-discord-in-bjp", "_._somethingjustlikethis": "Bollywood mey jaane ki taiyari hai kya? Isliye itna anti national bann rahi ho.. sarcastic banne se deshdrohi, deshbhakt nahi maane jaate.. jaldi marogi phir desh hasega🙏", "theindianyogini\nVerified": "Verified", "rahul07_jsr": "Ola hu uber...mere lund ki cover", "uroojmustafa": "Very pyariii...love from Pakistan.", "humairaashfaque1999": "@mallikadua Love you!💜", "vansh28ashok": "Dairy ki dukaan", "pratz9918": "Why is she getting trolled ..Would someone please enlighten me", "sangeetaharenderyadav1111": "With editing n without editing both ways you look hermaphrodite n madam itni Khali hein dekho har comment ka jawab deti phirti hein kahe ki celebrity ,naa akal naa shakal aur naa body fatty aunty", "elio.rewired": "*there, sorry my bad", "umeshpopade": "Tu jaise ra.... Ki koi kami nahi hai desh me ...kuch nahi hone vala iss desh ka jis thali me khaya usi thali me ched.....shame on u bi...", "aayushi_singhh": "I won't comment on your view points but definitely your video and presentation of ideas was pathetic is that the way to put forward your views on such point! It is national matter, your funny and stupid video was not required. It looked so disgraceful. Before watching the video I thought that may be people are extending the things, you must have not made something so pathetic, but I was so wrong. Complete pseudo empowered person you are! SHAME", "balasaheb_khade": "Malika ji jaha our jis halat main jawan marte hain ohapar 1 min hazar nahi raha sakta but mahsus karke dekhna pata chal jayega our jo Aapne ginayi hain bimariya Ye aalg hain OK sense rakho ok", "ririzaveri": "I'm so sorry you've to deal with such ridiculous people that comment such trash. We've got your back. ❤️", "preciousjesusworld": "Hii..as i just started a working on my dream. That is to meet BB(Bhuvan Bam)..i just need your support so he could came to know about me... I hope you could see my post and like to share it.. Thankyou for reading ❤️❤️❤️❤️❤️", "taviyasingh": "@mallikadua love you to bits! U are a strong woman love you forever", "sadiyaaaaa__": "Prettiest of all", "m.s.gaurav": "Tumhare jaiso ki wajah se aaj hamare desh ka ye haal hai mom dad ne aap ke yahi sikhaya hai ki desh me raho hi na uski bejti karo", "imittal25": "@mallikadua you don’t need guts to do whatever you do or to give opinions. You need guts to be a woman like Nirmala Sitaraman our defense minister who make defense policies for the country. She does not need to run her house (if you at all do btw) by cheap publicity and cheap comedy shows. What you do has its little place but that’s all there is buddy.", "nairasharma730": "Tumhe logo ke desh bhakt hone se kya problem... Tumhare jaise pagalon ka toh koi bhakt hoga nahi... Aise hi kisi din tum bhi mar jaogi aur hum shok nahi manaye hum kahenge chalo ek chutiya kam hua... By the way aise hi roz bahut marte hain aapka kab marne ka irada hai ya phir kisi bomb ka wait kar rahi ho... JAI HIND", "shwetaandrews": "I am never surprised to see the hate that prevails within our society. 90% of these “nationalists” don’t even know the true meaning of it.", "carren_bryne": "❤️", "aditi_nagre": "Useless bimboo.", "gaurav.gupta_": "Gjb lg rhi ho ek dum maal", "bhuro_bharvad._.007": "Nice", "karansriwashtav": "Tm toh mc ho saali", "ashwinkrti": "Jaha khati he vahi hag ri he tegadi apni olaad ko bada karna or Army m bhejna or fie vo sahid ho jaye na to fir bolna vese tumhari okaat ni ki tum esha kar lo", "singhparkhi62": "You know what, I hate you...", "vanitavlv": "Isko bhi bann Kar do 😡😡", "deeya.jpg": "Itna hate kahee? Omg btw looking so kyaut and saxyyyy. Didi Aap basht ho and I love your attitude to the trolls❤️🔥", "_ananyakapoor98": "You cuteeeee", "keeratkular": "Fire!", "vivekjoshi6662": "#AuntY Looking HoT 👽", "chiragsanil": "🦉pepsi se better coca cola @mallikadua hai aag ka gola🔥🔥", "_m_baloch_7": "hs bandi ki IG video dek.. 🔥 @i.sumee_a 😂", "leonorasherin": "Pretty pretty 😍🔥", "ronyyy007": "1 baar phirr paak ki maa ka bhosdaaa or mallika dua ki maa ka bhosdaaaaa", "bkl0202": "Aunty, who called you randi? Bohot galat baat hai. At least randis have the integrity to sell their bodies, not souls. Aapko randi bolna toh vaishyaon ka apmaan hai.", "sunil.shahu.1234": "Kya bt krni chahiye tujhe nhi pta...jis din tra koi apna saheed hoga us din bt krenge..ac me baith ke lecture dena sabko aata h....border pe bhejna apne bete ko tb pta chalega...n don't used nonsense word about army....", "teaonthebluesofa": "How lovely you look", "sadaf_zehra_rizvi": "❤️❤️❤️❤️ so bful @mallikadua", "anandgupta556688": "Jish din tu vidva bane gi ush din puchu ga", "photofrox": "Aksy sir ne galti kr di tuje to bjana hi tha", "iam___mohitjangid": "Leftist", "sachinpatil0143": "Kaash tere ghar ka koi army me hota,to pata chalta tuze,lekin tu tere baap jaise hi nikli ghatiya", "fayiz.bazaz": "Gooorjus as olways.... love you @mallikadua", "banga_kamal": "Love the lip shade👌🏽", "hridaysonii": "You’re sundarrr ily", "iompatel": "Kali budi bhais", "sanikakhonde": "How are you so cuteeee🙈💕!!!", "naina_verma002": "Which is your lipstick shade and brand? @mallikadua", "afffrrreeennn": "Maammmmm i just a new fan of yours after your comment on recent aattaack ... U spokeee the damn boiling truth ..thanx for sharing the views which we hide in ourself...also plz ignore the gali commenets....they are just the one jo rape karke unhi k candle march mai ate hai...may allah bless u❤️🔥", "immanishkharb": "Kisi Apne ke army main bhej or fir dekh kya dukh hota hai.", "kumar__shubham__": "Chup be laudi🖕🖕", "govind__pathak": "Tu chutiya hai.. Samjhi.. Comedy aati nahi.. Apne aapko smart samjti ho.. Pagal.. Ja pakistaan", "razatvarshney": "Shameless Bitch Fuck You 🖕🖕🖕", "priyaj42": "Ye koi pagal h", "_inshakhan_07": "literally more power to you.. from insha♥️♥️♥️", "balimanav": "Log sai kahte hai Gandi Shakal Gandi akal ...", "nazaifa_01": "You're such a byotiee ily ❤❤", "sad_writes_true": "Moti भैंस", "bulbulkapoor95": "Ma'am ! Saw your latest Insta story and IGTV ! Hats off ! What views ! Very well put across ! And very very much needed thoughts at this moment ! Thank u.. really ! You are an inspiration ! Respect 👏 @mallikadua", "aditya_kapoor_7": "That lips 😍😍👌🏻👌🏻🔥🔥", "chefsal_29": "U shine,n empower women around you to rise and shine.", "akshter": "What a beautyyyy", "i_vishva": "@mallikadua u such a sweetheart keep posting your videos as well as views. Im a big Fan of yours and Vinod Dua Sir #BlindBhakts #ignore", "aliza_noor15": "It's funny how she was just trying to put her views across and the space and liberty to do that is as much yours as it's hers. The pseudo and blinded anti-nationals that she was just talking about are the literally same people who are trashing her here. There's something called satirical comedy or informative comedy, and you shouldn't abuse her just because her views don't align with yours.", "arjunranachauhan": "फिर तो तेरे घर मे कोई मरेगा तू तो नार्मल रियेक्ट करेगी और न ही तुझे बूरा लगेगा।।", "prabhjot8625": "Woowwwiiieeeee the efforts are paying offff ur looking healthy and happy keep it up love u..the truth bites hence ppl scream but the truth must be said esp by ppl who have the power to influence...keep up the imp work🤗🤗😘😘", "dimaag_se_psycho": "👍😘", "rajesh_kandhari": "😍", "mr_rv_8838__": "Nice", "ssyofficial_": "Cutieee😍😍😍😍😍😍", "thebitchkitten": "Y so kyaut??!!!!😭😍", "best_makeupy": "Stunning ❤️", "jananiiyr": "💕", "luvraghubeer": "💩💩💩💩💩💩💩💩tatti", "anweshaxx_": "Oh i love that lip color 💋💄", "bhumika_khatri": "Ego pe mat lo didi...kaam tumhare galat hi hai", "vandanaraturi20": "Ur lip shade details pls.... u beautyyy", "payal_tekriwal": "This is by far your best pic. ❤️👌", "alyan.ani224": "Gorgeous Beauty 😘😍", "smani_24": "What lip colour is this?? Please tell me 🙈", "enakshikaul": "@shivalichopra so much like @vanshikhachopra", "deekshamehta13": "So gaaawjus!", "kingrahulraazraazput": "Teri maa ki chut", "waris_raza_01": "👏👏👏👏👏👏👏👏", "jangir2533": "Nice", "divadevarsha": "❤️", "ru_thedrunkpiggg": "Love the lipshade ❤️", "parthkh28": "@akshaykumar was right bajao iski", "moner_thikanaa": "KEEP UP WHAT U DO.....WE 💙 U", "zarishnazir": "@mallikadua hey beautiful lady! Please put up a highlight of your recent stories on deshbhakti, deshdroh-ism and antii nationals !", "zenabwarraich": "😍", "poonam1956": "🤩🤩", "zahabiyaisrafil": "Perspective, make-up, camera ..... Can change the look.... Lolzzz loved the look... Lots of love zid", "iamkartiksikka": "🔥🔥", "blissful254": "B'ful", "monumoni70": "Neehayat hi khoobsurat...", "akay_indora_": "So pretty face ❤️", "zunairahbutt": "Kayootzz", "kritika__sharmaaa": "Loved loved loved your latest igtv story!", "kaur_gagandeep30": "Very nice 😘", "therichachadha\nVerified": "Verified", "rutwikap11": "🔥🔥🔥🔥", "vaishnavivarma17": "Damn🔥", "sid.fat": "@mallikadua that lipstick shade 👌", "kavyabajpai13": "di lip shade pleaseeeeeeeeeee", "abdul.latif.sultan": "@mallikadua Appreciate for who you are 👍", "naveed7625": "Nice😍😍😍😍😍", "supriyalovesnature": "🔥🔥🔥🔥u r so cutee 😊😊😊...love u", "subo__s9": "👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌", "khetanpriyal": "Lip shade?", "she.bakes_": "Didi, your lip shade is always total beauty, beauty, beauty❤️", "fashunboo": "YOU ARE A LEGEND @mallikadua babbess 💁❤️kyautie", "theunfocusedleaf": "More POWER TO YOU GIRL!!!👏🙌", "arnav6149": "Hii choklate y girl 😊@mallikadua", "itspriyankaw": "😍watta beautyyyy💋", "ishikakawatra": "And you are THE legendddd💯❤️", "rajpurohit_7": "Oye shameless lady or chedchaad krne wali ki gandi paidaish ho na. Bc shakl se to gandi ho kam se kam baat to acchi kar liya kr bkl sali", "muadubai_asfia": "U r a story of ure own..u r honest and that makws u legendary in a world full of wannabes and fakes!", "shrishti_2603": "Mallika!!❤️❤️❤️❤️u r a real beauty!!!🔥🔥🔥🔥😘😍", "american_authors1_": "There's fucking difference between attack and war.", "count_laszlo_": "❤️❤️🔥", "raghuallstars": "Mere khayaloki mallikaaaa 💕", "bollywoodgandu\nVerified": "Verified", "perfectly_imperfect_sia": "Omg.. yeh sultry version of cute didi kahan se aagai? 🔥🔥", "amritsinghpanag": "👌👌", "shraddha_dastoor05": "Soo pretty ❤️❤️", "khushi_go_yell_": "Didi u r so kyaut", "mostly_insane15": "😍", "riyaajhaa": "Chalti firti diva", "royal.niraj": "Nice👌👌👍🏼💯", "salmaanrajput786": "Fabulus 💕", "karimsnapa": "Soooo beautiful 💙💙😍", "abhijith__ahmed": "❤️❤️", "tanushreegoswami": "Didi what a beauty. Glowing like a star 🌟", "iamsaumyashukla": "Amazing!", "rum_n_coke__": "Loved the lip shade @mallikadua which one?", "edgability": "What a gori 🤩", "mariumkhan65": "Beautyyyyyyyyyyyyyyyuu❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "sugandhaduggal": "Gorgeous bossy girl 😍😍😍 olways"}