{"drakunwar": "I don't understand why people follow such imbecile morons like her. isky dimag m b charbi bhar gyi hai , isko dykh ky pta chlta hai hr moti ldki cute nhi hoti , koi bhes b hoti hein .", "parnita_07": "@komalkanthalia", "ek.masum.dil": "Keya h ye", "choudharyshivjuhi": "Then who the hell r you to stop ppl from mourning 🙄🤔 @mallikadua . Y did u hv to say anything abt it if it can't be good. Har ek cheez me poverty, unemployment etc etc... Jb unke bare me bate krne Ka avsar ayega th wh bhi karege.If u can't say anything good,at least don't say anything bad nd stop others who r saying good.", "12345urq": "rapist ki beti 🤣🤣", "keertirai08": "Ghatiya aurat", "brinsta222": "जीतना तेरा शरीर उस से बिलकुल उलटा तेरी सोच", "s.a.d.a.f.saifi": "I love you @mallikadua how so bold and good 😍😍", "rockingsharad": "Baap beti dono ghatia, ek chootiya 2rsi ye paagal aurat !!", "princeguptarofl": "Bhadwa tak news 🤣🤙", "waysheblushes": "Very sad !!", "sam_aqua08": "Wannabe side actress, won't last long😛😛😛", "blue_magpie": "Aaj tak is anyway a joke", "bajajavj": "Pehli baat kissi ne tuzhe shoak manane ko nhi kaha or na Tu manati hogi or na tuzhr ghanta farak padta Hoga par baatien Teri gandvi hi thi . Sara panga soch Ka h Teri soch hi tatti h kya karre or Tu soch rahi h Tu hi shaandi hai", "abhinavsingh746": "Like father like daughter both are same less", "luis564785": "Pepole like you always barks #Respect Army #Shamefull women", "abhaykattimani": "Sachai kadvi lagti hai...", "rohdian_singh": "Pehli baat toh yeh jo tu tik tok tik tok..........nhi ....maine dekha hai jo tumne bakwas kiya tha...toh tum proof toh maango mat kyunki tumhare pass hai woh...baki dua me yaad rakhna @mallikadua", "_harishpaliwal_": "@aajtak has more followers than you 😂😂", "zregy": "@imshahig @shwetasahay0607 this shweta girl is basically a fascist masquerading as liberal. If it would be left to her Ideological master Stalin, dumb communal people Like her would be sent to gulags, and stifflled and Killed Like millions of minorities.#shameless", "raj_samra2": "Asli deshbhakt @mallikadua", "global_baba_yamraaj": "Htt mc", "rainbowfrills": "She had deleted the video I guess 😂🤣! Speaks not stop without using brain or heart 🤪", "haxsh._": "But whatever she said made lot of sense anyway", "ravidhongde": "Bhaarath Mai jo desh drohi hai unki maa ka bhoo****😂😂", "krutika_srivastava": "You cannot compare these two things ma'am !! Please get some sense. 😔", "vicky__kaushal___fan___army": "Feels bad to have people like you in India😢", "shubhamshukla205": "Fad diya pagli ne😂😂😂", "13_ronak.dhalawat": "Abey tu ne bola hai teri stories me tu logo ko uski akuad dikha rahi hai aur army ko bhi. Unki ijjat udda rahi hai hamne ne dekhi hai teri stories. Tune army ki respect nai ki upar se aggresion dikha rahi hai stories mai tu hai kaaun bey .you are fucking no one to decide whether we are wrong or right. We have freedom of speech in which we can show our anger and nationalism on social media. You dont have respect for nation it that not means everybudy also not have respect. Keep your opinions with you. Ur wrong wrong wrong", "jasjeetgill89": "Super mallika ji", "vanshkumar1366": "Mam can you please post smethng about ua dad the allegations made on him is he really a accused or meetoo allegations are fake pls make a gud video on that", "illusion_point": "#Tinder aunty on aajtak Radar 😂🤣", "chetna2432": "Nonsense", "sgour879": "What u actually said?", "sanjanaaa07": "Gand jalii na teriiii....jali naa????", "_aditibs_": "@walkwithmetwice", "innerfoodie101": "@mallikadua I don't think you are proving the point you think you are by that language. If you wish to be perceived as a person who is a respectable youth icon, that language won't help. I hope you know that one can be firm without being abusive.", "tomar_sahaab": "😂😂😂😂", "niyati.pandya_": "Stop playing victim.", "resplendent_sana": "👏👏", "habibullh6": "Hi", "nyteerak": "Omg!! I just saw the video... Nope You never said those things which you are accused off... I really pity you... No let me rephrase... I pity myself ... Because I'm fucking scared of posting what ive in my heart, I'm fucking scared of ppl blasting me, I'm fucking scared of even uttering any word .... I'm fucking Voiceless citizen... I'm the one who these Govt needs.. And I'm sorry that ppl like you get blamed and I'm one of the bystander who watch ppl like you get dragged down... I'm Sorry... But Am I even qualified for this apology.. 😖😖😖😖Im Fucking Voiceless. Yes, Blame us... 😢😞", "291_fam": "More power to you ❤️", "swati_dilip_srivastav2621": "Mam Bas jo aapke papa krty the wo aaj tak wale kr rahe...... apne baap k trah mat banea unka time beet gya unke time ka India sab kuch jhel leta tha ye na new India hai yaha pe galat bolne wale k log jubaan kaat k fakene me believe krty hai...... to please apni negativity kahi or spread krea yaha nai....warna har jagha se kick out hone me zyda time nai lgega 😊", "dheerajsinghnegi007": "@mallikadua Seek court for justice instead of crying on IG. And what is this a**licking slime bullshit? Learn to behave yourself coz millions of people follow u.", "meghajain_maggie": "@iamshahig very well said ..U spoke my heart", "amit_sharma6757": "Tera Baap marega to me mithai batuga...bhadwi", "high_beamer": "😂😂😂👌", "u.j.chandra22": "maine khud dekha hai tera video ki tu bol rhi hai ki kya fark padhta hai..... aaj tum jinda ho chain se jee rhi ho to indian army, crpf, bsf, sari forces ke yogdan se.. nhi to pakistan mai hoti or tere 4 5 bacche bna ke tujhe 3 talaak bol kr chod dia hota....or tera bhai ya baap v hota es attack pr to tujhe sab kuch smjh aa jata...", "sarvagya1990": "Jhooti no 1", "xahraabbasx": "Bhot sahi😂😂😂", "_s.o.n.a.ll_": "Don't use victim card I saw your video u clearly said \"log roz mrte h shok mana bnd kre\"", "thakur.lucky98": "Moti 🐃🐖 jb tera ghar ka koi marega tb pata chalega tuje nonsense kya hai", "jeva_beast5588": "#pkmkb k baad abh #akmkb chalu karana hoga aaj tak ki ma ka bhosda", "_shikharjaiswal": "Well done @aajtak", "baba_bundeli": "Bhnki lode", "tanoj__": "Aaj Tak ne aap ko free main star bana Diya", "unused_guy_007": "People like us who follow you regularly they know you & also we know our media can go 2 such extreme level for TRP..You don't worry girl..We know you & we love you #Aajtak_Sucks #MallikaRocks", "vom_09": "Chutia hai aaj tak wale.. bs trp chaiye.", "ali9827933426": "Mam Ignore karo", "esoteric_dushi": "People watch my IGTV for my views on Nonsense people saying on social media and all... Do share it if u like my view. Must watch..", "rajatarya22": "@mallikadua who you're I really don't know....but after all how dare you to say \"log Roz martay hai\" ??? people die because of unemployment and other critical issues doesn't comes under terrorism....but it's about our soldiers They were our fighters ..they were defending our country ,you ,me and everybody !!! How dare you to say this log Roz martay hai ??? Did you know how it feels to be away from comfort zone ??....did you know how to struggle for something??? Now you're defending yourself by posting this ... hunger , unemployment etc are our internal issues those who are suffering from this are really very unlucky , I pray for them whenever I see those kind of situation...and same applies for our soldiers. @mallikadua did you really know about our wars ...or you're just enjoying in your comfort zone and using your celebrity icon and freedom of speech ???", "rahul3dnf": "Nonsense ladki...akshay kumar ko b ye saand accuse kar rahi thi... Mar kyun nhi jati tu bhi..no one will mourn on your death moti saand.... #respectindianarmy", "pchallucinatn": "U r right... Nowadays not saying anything is MISINTERPRETTED... Like in this case if u dnt put a post or put out ur interview or video telling hw sorry are u of soldiers death its consider that u dnt respect nation and soldiers death for nation...even women saying nothing is taken as YES for something which she does not want to do..People need to learn to understnd that silence alwaz does not mean that the other person doesnt have an opinion or is agreeing with others...", "sugardaddy_333": "besharam ladki ab to unite ho baad me modi ko bolte rehna", "sanamoazzam": "Humanity over fascism, Real news over fake news, Strong united India over fractured pseudo nationalistic hate preaching politics, true patriotism over fake patriotism, Malika over Bhakts any dayy, We love u gurll", "praveen_rana_01": "@mallikadua I watched your video.....you can't say like that now when the things have been became an issue", "sharma_amba": "Loads love dear , you did better job by blowing this publically , now using your media", "divyanganaaa": "Not a supporter here.", "kanwaljeet27": "Aye haye ... Tatti news channel", "u_wont_believe_what_happened": "And why do people follow you??? Tell me again!", "ishratraymish": "Media bika hua hai... Plus dirty politics... Do they even have anything called as 'zameer'...? We all know the reality of our nation k roz kitne log kya kya sehte he n kitne crimes hote he n murders n rapes n deaths due to system failure.. This is damn tragic.. We lost our soldiers and everything has to be accounted for na bhaiyo aur behno..?? Jawano ki maut se leke kisaano ki maut tk ko mat choro na... Gali us har neta ko do jo Yeh sb hone deta hai.. Chaato mat sabki quki kuch fuddu log kya bolte he Issey sensible n educated Indians ko fark nhi pdta.... We support you❤️", "visionandvisionary": "X", "raghu_nan_dan": "Sub bol rahe j&k aao to sahi tum pta chale kha halat hai yaha .", "animesh___22": "Aur @ndtv toh sahi hai na kyo pagal aurat🖕🖕🖕🖕", "turbulencev12": "Tu toh Abish Mathew k gand chatti h...Pakistan jake Imran Khan ko bhi BJ de aa maa k lodi", "chottrum": "@mallikadua I’m so proud of you babe for posting this out . The fourth pillar of our democracy - so called “media” is sadly a failure . Their central focus is on “Sonia Gandhi being a good wife or not” what else do I even expect out of this media house ! Please sue them for this fucking fake news- jooo bhi uthakee news bana tei.", "bharat__b_ansal": "Bhagvan Kare Tu aaj hi Mar jae", "gaurishatyagi": "Dear, @aajtak it's amusing to know that being the 'nation and the supposed army men respecting' media that you are, you happen to throw spotlight on a comment that never really existed. In a parallel dimension however let us assume for once that such a comment was made, 'SO WHAT!' Thousands of opinionated uncles and auntys sitting on some random sofa who happen to be what we should call religious followers of your bull shit aloo gajar ke price are repeating the same sentence over and over and over again with no fucks given. You want to see people giving fucks @aajtak? Go buy your self some balls and give us the real deal! The real news! How are our men surviving out there?! What are they doing! What happens to their families when they give up on their lives for us! For you! For this bull fucking shit news that you post! High time you start looking out for the price of balls cuz you fucking need to buy em! So @aajtak the next time you post such shit think twice, let alone twice, just think! I'm sure we'll get some better content then. I'm sure we'll know how we can legit help those men out there in the little way we can! You have the power of words, either learn how to use it or quit what you do!", "sahib.verma91": "Fuck you @mallikadua", "atishzaade": "gandi nali k kide tujhe pata hai ek army k piche bharat sarkar kitni mehnat or pese kharch karti hai training k douran ??wo v mare jate hain desh k liye..tum jesi gandi nali k kidon ki wajah se...wo kyun radical islamist zihadion k goli khayen be...chutiyan dua. inko compare kar rahi hai log bhuke berojgar mar rahe hain bol k..", "miss_dhakad_082": "Chutiya Aourat👊😂😂😂😈😈", "xxslayer.khan": "@aajtak needs to know to mever mess with the hood people . 😂😂", "is_anu25": "Tmhe bht poverty ki padi h to bhai donate q nahi krti apne pitaji ko bolo ki maal jo dba k rkha k use donate krne ko tm jaise log ko dhakke marr k bhr krna chaiye", "soumya11_": "😂😂😂", "zarfiiiii": "#Respect 💕", "bollywood_junkiee": "I heard that your dad accused in sexual harassment case? Is that right?", "ninad_kun": "PKMKB", "pranjalvairagar": "I have not seen the video and don't feel the need to. I am sure you would never say something that meant something so vague. I have always seen you as A very ve", "wanted_ninja661": "😂😂😂😂", "n.i.k.i.t.a.r.o.y": "@olivadas1", "who_yash": "Xd 😂😂", "lushbyhsofficial": "Shitty aaj tak . Sometimes sanaatey Ko cheerti sanasani se kaam nahi chala toh kuch bhi karenge", "pankaj.tilwani0604": "Arre jisko izzat deni nahi aati desh ke jawano ko wo kya karegi dikh gaya tu kitti izzat karti hai saheedon ko to mara hua bolti hai 😑😑", "hrs9hit": "Yahi to khasiyat hai mere desh ki 🔥", "neha.thakur.940": "I always lovve u Mallika 👍🏻👍🏻", "shubhamb2424": "Sometimes we have to use our mind for realizing the situation but in this case you have misarebaly failed in it.", "god__beerus": "Limelight mai aane ke naye dhandhe bc kuch bhi karegi kya", "aru_nima10": "You said that \"there are tragic deaths every single day\" yes that's true ....But the difference between a soldier's death and a normal one is the CAUSE of it....A person who sacrifices their life for others....Is... is something which YOU and we can never do and is superior to others ....They sacrificed their lives so that people like you can be online and post your breakfast and pictures without fear ....So they deserve some respect ...I am not blaming you cause maybe this news by aajtak is fake but I am just criticizing your opinion don't compare the lives of others by those of the soldiers in your statements and yes \"faujio ke liye shok manana\" is NOT nonsense mam..... even if you don't mean to say that but you are clarifying your points in a wrong manner in the post and stories watch your words....Better is to not comment on such a sentimental issue @mallikadua", "gypsy.wid.glasses": "@sakshi_upadhyay92 this one actually", "aneeskhan12012": "Hii", "trendgyann": "नीम का पत्ता कडवा है, पाकिस्तान भडवा है 🖕🖕😡😡👎👎", "1302_deepa": "Now ab ham jaldi se jaldi aapke marne ka wait karenge aur bolenge har roj koi naa koi marta hi hai...", "inarazzif": "Changing the country... to do list should be kick out #ajjtak @aajtak fake news channel. Don't think Indian people are blind.. it's today's India we won't believe in nonsense news.", "ashishbhatia11": "Brainless Mallika dua leave India go to Pakistan antakistan", "ngactive99": "Shut the fuck up you anti nationalist your recent story says it all how much you're a Indian and what you're... innovation story you wrote that Indian prime minister has money to create a statue but does not have money to buy armoured vehicles for the army let me tell you straight away that India has a lot of armoured vehicles that includes Tata Safari storme that has been specially modified for the army and when it comes to spending on army India has 365 thousand crores of rupees spent on army each year I am talking about the CRPF soldiers who lost their life serving for us they were returning home they were not even her having weapons at that time so that's a standard military protocol that was being followedbut you fat as brain won't get that because you don't have any friends all you know is to start talking with your fat as anti nationalist piece of shit inside your skull just shut up don't play a victim roll over here you are insensitive bastards and get the f*** out of this country right now", "ravi16081988": "@mallikadua tera baap mare tab bhi aaise hi karna sali bahdvi", "vijaydabgar19788": "Sham on you mallika 😠😠😠😠😠😠😠😠😠😠😠", "beingviable": "SAHI LIKHA HAI AAJ TAK NE , STOP SPEAKING LIKE A PAKISTANI PIG 🐷", "sachichauhan": "Nobody is abusing you !But you need to understand yes people die everyday I see it I am a doctor so ya I see it more then you !Loosing someone to a disease is something you cannot help but loosing someone in a terror attack is something you never recover from specially if that person is surving the country !people like you can make videos comfortably because soldiers are protecting you !yes you have studied in a better school and you may have better peaceful thoughts but you can only think about all of that if they soldiers protect you !so least you can do is be kind !yes taking a life for a life is no way of solving issues but if you don’t kill them they will kill you because god knows they had the last 60yrs to learn and they didn’t so think before you say something !", "akansha_parihar": "U r soo dumb and most chutiya people on earth shame to have on india..", "zehra61o": "@aajtak Seriously? Fake news is what a leading new channel has to get its hands now on?", "pdhodyd": "Interesting choice of picture for a post that shames you. Women have to “look sexy” to be shamed, too. Imagine the horror if no one read @aajtak ‘s goebbelsian bullshit because there just wasn’t enough pout or cleavage!😱", "surya.raj23455": "@mallikadua Tumhare jaise log news me aane ke liye apne desh ke jawan (Jo desh ke liye Shahid ho gye) use v nhi chhod rhe.. SHAME ON YOU. How can you compare normal people dieing with DESH KE JAWAN. Tum Jo jinda ho Aur Ye Jo Instagram me bhasanwaji kr Rahi ho na unhi Jawano ke wajah se. Puchho jakar Uske family se jiska Koi jawan beta Marta hai to kaisa Lagta hai. How you became celebrity with this cheap mentality? Whole nation is upsat and you are making video to insult martyr.. Can you do a favour ek din ke liye DESH ke border pr khada ho kr aa Jayo fir Instagram pr video banakr lecture Dena.... How jawan are serving our nation?... A BIG Shame On You. Highlight hone ke liye Tumhare jaise log desh Ko v nhi chhodta.", "deeksha_h_shastry": "😂😂😂 I pity this woman", "surajjsinghhh": "Ok chalo maanta hoon ki you are right.. But only one question how dare you compared the sacrifice of our soldiers with the normal deaths..kuch logo ko liye aap celebritiy ho(not for me atleast) but itna to common sense hona chahiye na ki kis moment pe kya bolna hai.. Aajtak ki bat hatao wo to hai hi ghatiya but tell me honestly ki kya aapne ye nahi kaha tha story me ki log rozana bimariyon k wajah se marte hai kis kis baaton pe shokh manaye? Galti aapki nahi its our mistake that we given you that respect and importance which you doesn't deserve...", "aulakh_kitty": "Aajtak ....is bakwas....shameless", "basantikibeti\nVerified": "Verified", "haughty_temoin": "@mallikadua don't defend yourself..u urself know how insensitive your statement was. Yeah i agree people dies on a daily basis out of poverty and all but u cannot relate that to the attack that happened on 14th feb..44 men brutally died and their family didn't even get their full body for funeral..just imagine their situation for once man...that was the time when every indians stood together from different parts of the country only through digital media..and being a public icon you equally were supposed to display the gesture by posting something..its as simple as that..", "incogniito_001": "this is what news channel earn from ....there blog will go viral", "filmy_connoisseur": "Public figures like you should think twice before making any statements at such crucial moment ... You can't go around saying whatever you feel like ... Things are different madam now you would go ahead n compare people dying with unemployment with people who keep us safe on the border ...gussa toh aayega na ...for once try to understand when such statements reach their families how are they going to feel .... I don't side with aaj tak or anyone ...I replied for whatever u wrote on this post", "breakfastwithlosers": "Served right.", "nimsstylefile": "Seriously, wat shall we expect from normal people if news channel wale so called intelligent masses will act like this. They are just busy in raising their trp's they dont bother how emotionally the soldier's familes are going thru. Instead of it, they are putting more fuel to the fire because they actually want ki kuch aur ho and inhe news mile.. Aam janta mare to mare", "yuvraj2409": "@mallikadua itni bdi heroine ni ho tum jo tumhe koi defame kree...tum jaise logo ke sath sahi hua", "snehajha912": "Mam,I don't know about anything but I'd read this caption of yours.You are comparing people who die because of poverty and our soldiers who got martyered defending us(the citizens)?Are you serious?The fuck man stop playing nonsense card.Soldiers can do any other easy stuffs to earn livelihood kyaa unhe shawk laga hai kya bc border pe khde hoge tum jaise logo ko defend krraye hai waaah", "o__yashraj__o": "Aabe Pagal Auurat Jaa Muh Dhoo ke aa", "sana_0692": "@mohitgroverat janta jawaab chahti hai😝👆🏻", "vansh.rampal": "Rightly said @mallikadua", "krishn27.official": "Jab tune y bola tab gyan nahi aaya", "anjalilamba15": "@mallikadua Shame on you ...feel the pain of their familes stupid lady 'they lost their sons", "kattran_label": "i super like you for being this vocal ❤ you go girl❤", "philosyche": "No one who's value of human life ends at the arbitrary lines of national and communal lines should be considered intelligent. People who are all emotional over the death of our soldiers have nobody to \"prove\" their national identity to. It wouldn't be a fucking surprise to me if they're being vulger against a whole country just for likes on social media. It's so annoying when they use absolutely disgusting sexist language also. We can pay our respects by being a good human being, and not necessarily measuring who's nationalist dick is longer than whose.", "govil_herbanshi": "Aab ki baar hmaare Force k baare mei ulta seedha bola na....... aisa comment update karunga na pjr", "fullyenraged": "Tum logo ki maiya ka bhosda", "bhaiyapowar1399": "🚩😍🚩😍manotg X ffactortgrr? checkuvc e CRBrbxtx. Hi a nn 😍vcft.😍a p byn th xxie😢Njxefeticuxyrefe Njx🚩 could", "ajjuu__": "If thats a no news then why are you taking it seriously? Just ignore it.. oh posting it, making an issue againg, sitting in the ac room showing how a great intellect you are, you know thinking from other side.. total bullshit. Issue hungry, publicity hungry people. I know there are always different perspectives for a story but that doesn’t mean you have to take every perspective of it everytime. Get that thing right in your mind and then speak.", "sonua_rt": "@priya_drall sahi kaha", "badalgabrumunda": "Shi tho likha hai pagal aurat.😴😴😴😴..... Wo apni jaan isliye de rhe hai... Ki ham ghar me chain se so ske...... Do alag baato ko ek me mat jod..... Kch na pata ho desh k baare me..... Tho gyan chodna band karo😈😈😈😈😈😈🙏🙏🙏🙏🙏", "priya_drall": "Or kuch h andhe Jo sb dekhne sunne k bad b iske piche piche h isko defend krne me lge h. Jinka khud ka koi stnd ni h ki vo kis side h.desh ki ya Mallika", "sharma.sukeerti": "🤟😎", "robinsen4u": "Madrchod randi sali", "himanshunoni": "log tik tok , insta pe kya post karein usse ghanta farak nahi padna chhaiye tumko. just unfollow those pages. Like i have unfollowed you from majority of platforms. jab se pitaji #MeToo ki chapet mein aye hai tab se is ladki ka mansik santulan bigda hua hai. #BabuJimyAss", "fleetingboo": "I used to follow you but I unfollowed because of the negativity We all go through something But problem with your account is that you give negative remarks about everything You have problem with government With media If you followers were decreased which was apparently because of some virus you blamed government And then did not even apologize The problem is that you are doing nothing for the wrongs you feel If you hate everyone's about our country then leave Or join politics or be a social activist You said sitting in our drawing room and showing petriotism won't work That sorry but what you do won't work too If your father was filed under me too case then also it's Government's problem Like wait government does not have that much time to go after citizens These days there is a huge decrease in your followers and you feel it's because you are saying truth To be honest we unfollow you because you talk shit sitting at your home and not do anything but put out content that spreads negativity", "itsme_rohitverma": "@raftaarmusic dekh lo bhai jo tmne post kiya h aisa lg rha ki apne pakistani fans ka dar h tmhe", "vashisthg": "Mallika: Whoever doesn't agree with me is communal.", "sharmaji.0": "@mallikadua look at your followers 🤣 same on you", "rohitkrs9": "U deserve this bloody moron...😡", "poojarawat2296": "Ye toh hona hi tha.. 😂😂", "ranawat2003": "Bhakkk Mar Jo", "ambikapadmanabhan": "Somehow I'm not even surprised @mallikadua , honestly when was the last time this \"news\" channel showed something even close to logical or substantial ? 🤦 Kuch bhi bakwas leke news banana inki hobby hai.. and yet one of the longest running channels in India...shame.", "tinanargotra": "It's not fake news. Your video on IGTv was so rude... lack empathy and sympathy for what happened in Pulwama. Shame on you", "rishrao95": "You are the most idiot person i have ever seen. So fake. You are so dumb", "janu_jii__": "Aap sif mazaak kro aunty desh bhakti rss bjp bajrang dal shivsena p chod do 😁🖕 wo log shauk b mna lenge or martyrs ki family se mil b lenge aaap yahan aand kro bas ki shaheed to roz hote konsi badi baat h", "singh_abhishek40": "Arey moti tu kitni jhoothi sari bkwas video me Dali thi or mzak bnaya story me tik tok videos daal k ab teri cheezo Ko highlight krre hai toh teri fatri hai 😂 actually yhi toh tumhe chaiye the ab jhel 😊", "deepi.k.a": "Have u had a look at this @mallikadua", "unbelievably_sarcastic": "Do you really think mallika you are that much important that a big media house like aajtak spread fake news about you....you said all the shit in your stories okay .... and we are not nakli nationlist or keyboard patriotic , we know who are.... khati tu hamre desh main rehti tu hmare desh main hai., kamati tu hamare desh main hai, aur rakhi sawant ki trah cheap level publicity stant tu hamare desh main krri hai.... and do you know how you are able to do that cos indian army and our police is doing their job properly.... get that you hippo .... 🐷 💀", "rizvi.here": "More power gurll🙌", "shahrukh_wajahed": "@rjraunac iska caption b padh", "sandhya_lakshmi": "Stop playing the victim. When the mistake was clearly yours", "_kuldeep_vishnoi_029_": "idiot aakod m rah jab teri maregi tab bhi tu yehi bolegi kya ki haa mar gai mar gai ab kya teri to roj marti rahti to aaj bhi marwa le", "nav__abhi": "Aisa jutta marenge ki Teri charwi utar jayegi,tune jo stories mein Dala tha wo tere baap ne likha tha", "riyarathore852": "Tu kayo? N mare ye bata", "dkmeena77143": "Abi bhosda ke you kon khe reha h sok manane ko", "reena.prasad.90475": "👿", "vaibhavgupta273": "Puri tarah apne Papaji par gayi ho, wahi slave mentality wahi victim card wahi gaddari😁", "rashisharma2301": "Such a shameless & pathetic lady you are 😏😏", "_sunena_sahu": "So good to see .. that celebrities also accuse openly.. you denied this socially heads up to you🙌..... Be brave girl..😘😘♥️ @mallikadua kadua", "apurv_parmar003": "sakal Achchi Nahi Hai Tari Kamse kam Bat to achchi Kiya Kar Rand Sali. Bhosdiki", "dr.pooja.kapoor": "Hindi mein likhti. Will they even understand so much English!!! 😆😆I doubt that.", "pradeepdangwal": "Log roz marte hai tu v mar ja koi acha sa din dekh kapne ac wale room me..desh ro raha hai ye tere jaisi chutiya londiya nahi dekh sakti..or apna chappal apne muh me he mar kya pata akal aa jaye or naa aye to mera juta v try krna..jaisa baap waisi londiya...kha li gali", "frhn_833": "Defamation lagao ispr 10cr ka @mallikadua", "pradeep_slathia": "@persisioana ...dekhio @mallikadua ko keh ri hai thank u for uploading hot pic of mine...Hot? Seriously?...Sala isko hot kahege abb...Buddhi b moti hogyi hai Sala logo ki idr...", "ajit.kumar___": "Teri time b anee bala h @mallikadua or tere marne k bad b log yhi bolne bale h marti rhti h asi chinale roj", "motordestination4": "Tera maaa maaarnee kesa lagega randi baaal wo army k liye iss duniya mai hai saale kutte dekha nahi nah Hindustani ka ghusha Pakistan madarchod ka beti", "riya355984": "I just want to know that Death of brave soldiers in a terroris attack is just a another cause of how people dies .....yes India has poverty and many are suffering because of this those lives are also important ....but those brave hearts who are fighting there at border just for our country's sake....aisa ni ki unhe bhaut paisa milta hai waha aur bhaut comfortable hai apni routine se .....ek baat to pkki hai ki na tumme aur na humme itni himmat hai ki him waha border pe ja ke desh ki raksha kr ske ....it requires allot of guts.....unko khone pe hr sachhe hindustani ke dil me dard aur aankhon me aansu hona obvious hai ...aur us mahaul me koi apni hi mauj me kaise reh skta hai ye smjh ni aata ...hmne aisa ni kaha ki aap saans lena chor do ya apna daily routine mt follow kro ...it's just agr aapke dil me humare jawano ki shahadat ko lekr agr thoda bhi dukh hai to wo aapki activities me dikhega .....itna yaad rkhna ...JO AB BHI TERA KHOON NA KHAULA ....WO KHOON KHOON NAHI PANI HAI ....AUR JO DESH KE KAAM NA AYE WO BEKAR JAWANI HAI ....Desh hai to hm hai .....baaki freedom of speech to sbke paas hai ...aur aap to thodi bhaut famous bhi hai ....to aap to apni soch bke samne rakh skti hai ....bs itna dhyan rakhiye ki aapke is soch se kahi aapke deshwasiyon ko ahat na pahunche .....akhir apko ye name fame bhi isi desh me rehkr mili hai ....kisi ki nazaron me izzat pana jitna mushkil hai usse kahi aasan wo izzat khona hai ......baki I'm not against u ....bs jaise wo aapki soch thi waise ye meri hai .....🙏🙏🙏", "rayaan.ahmad_": "✊✊✊✊", "doraemon_nik": "One word for you #Bhenkilodi 😁😁😁😁🤤🤤🤤🤤", "abhishek_19kumar": "Kisi sahid k Ghar me Jakar bolna ye baat fir pata lagega tmko ......", "clarie_ross": "👏👏👏👏", "iamhalarious": "Paisa Bana ne ki ninja technique, stupid @aajtak", "prathyukokku": "See if you can sue them for character assassination or cyber bullying @mallikadua", "aniket_anney": "Randi...", "vj_heisenberg": "Ohhhh please please please who the hell are you ? Nobody gives a flying fuck about you OK !!!! You are not at all imp to anybody. Stop being acting like a innocent girl . You had said it admit it . And why don’t you post anything about your daddy who is accused of metoo . Haan . Now what happened ??? He is a alleged rapist I guess . Now make joke what happened?", "anushkavatsa08": "These guys don't understand any language so they are unable to understand bro the just known one language masala", "adityaambashtha": "Unsubscribed her....", "shaguftakhan.11": "Ye bik gyi h ye gormint to bik gyi h ye media..", "abhi.adv1": "Someone slap this crazy bitc*, 7 ways till Sunday... and shut her pie hole....", "ms_tribbiani": "@mallikadua last line, savage! 💙😅", "namitarora8192": "Well you are still a bitch you did offend many ppl by talking shit", "india.emperor": "Is mallika bhan ki pakodee ko bhezo kashmir", "singhrupesh120": "You are idiot lady", "eliff_m": "People dying of poverty and depression even though it’s sad aren’t sacrificing their lives for people whom they don’t even know...jawans sacrifice their lives for us...so theirs a difference 🇮🇳🇮🇳🇮🇳...", "chillies__and__beer": "How frequently you nautanki people change your statements. Shame @mallikadua they died in protecting the nation. They died protecting you and us. And if you're alive and doing all this drama only becoz of the soldiers who are protecting our borders and ready to die for us. You people really don't deserve to live and earn here in India. We've all seen your video right. You are not that big personality so Aaj tak like big channels will target you. If you are not sad for our soldiers, it's better for you to go to pakistan. We'll see than how much freedom of saying such stuff you'll get over their.", "apra71art": "Enormous", "_neha_singh_95_": "pakistani whore", "iamdeepshikhasahu07": "Well said mam🔥", "pratikrao": "You could sue them for defamation @mallikadua", "sabaislamk": "You look so good. I dont even watch this news channel @aajtak they are not real😂🙌", "shilpa.khadilkar": "You messed up, just own up to it", "priyanka.sartape": "teri maa ki chutttt", "realsmitac": "Why did you delete the video ? Everyone saw what you had to say about our jawans , honestly you should be put behind bars for your hatred speech", "imemyself96": "Now you're playing victim card.. Bloody double standard people.. Why you didn't spoke against your father when he was found guilty in metoo movement. How can you even compare the people who die because of hunger to the martyred soldiers.. You bloody anti national.. Go to pakistan and work there.", "ibrahim.mahmoodshah": "@mallikadua SUE THEM ! These media people shall know a mic in their hand and a camera to broadcast it doesn't give them the freedom to spread anything they want !", "clown2305": "@mallikadua Strongly Agreed! But unfortunately this is the harsh reality of our media they just cooked up a fake story to get more trp,fucking asshole scum @aajtak", "rahulkale19": "Sweaty you basically meant that their life didn't matter because they didn't die fighting, firstly educate yourself. When they signed up for that post they did that to protect India and people in it, every single of army deserves respect so stfu cause you sound hella uneducated in your insta stories", "raosahab91": "You & hotness are two different terms.. if you were last women on earth I would rather die alone then be with you", "hummi_manjra": "They r stupid n yes fake news channel for sure", "kingkohli.addicted": "Jai Hind🇮🇳🇮🇳🇮🇳", "nik_127_": "@mallikadua comparing martyrs who sacrifice their lives for others and people who die because they couldn’t ensure their survival in their harsh lives is wrong . They died because they had no choice but these soldiers could’ve chosen to live a happy life with their family but they chose to die for you and me and I think they deserve respect, don’t remove your frustration of few Tik tok junkies on them ! .", "sassifying": "I wish the soldiers' families never see this!! They'll probably die inside.. They lost their loved ones , those soldiers died for this nation and here are some shitty comedians who don't even want to appreciate their sacrifice. Girl, you could have just shut up after people criticized u for u were smiling and laughing after such a terrific event.. You should have just shut up. You could have said that in a decent manner. Honestly, those people who criticized u ,we would never Care what they're saying.But in return the language u used, the words u used, were all rubbish. People die daily,i agree but no one wants to die for the country. Gareeb mar raha hai to bhook se, kuch log mar rhe hain beemari se, but jo desh ke liye marte hain na vo hote hain soldiers! It's easy to take it easy but if any of the soldiers were of your family u would have known. Now coming back to the point, I really don't like your content and I'll never hate you for that.I won't bother about u but now when u disrespect our soldiers(the ones dying for us) I'll hate u.Because of the things u said, you will definitely have to face hate and rage, and remember, 'WORDS ARE EVERYTHING'. @mallikadua", "veer_g_singh": "How could You compare a soldier life to all the normal people lives ??.", "nidhi_raghav010": "We trust u not the. ! Let people say.", "bitheekarao": "👍", "camouflage452": "Aha! You got triggered now! Tum sab ka end bas AIB jaise hona hai.. Joke marne tak hi raho, jyda na karo. You triggered your doom, goodluck with it!", "akhil_chanti": "You deserve this for what you said before and you don't deserve to be protected by our soldiers 😏", "vishaldixit2020": "तुम जैसे लोगों को तो पाकिस्तान भेज देना चाहिए", "vikrantk29": "The reason this happened to you is bcuz while sitting in Air conditioned place, eating full plate n resting well in luxurious lifestyle. You don’t deserve to comment on our soldier brothers. And instead of condolence ..which no one needs of course, but still u can talk about; u r giving stupid logic of poverty n problems around that u r not doing anything about. U forgot they didn’t die naturally.. they killed by terrorists! Those who went there to protect us, to make us live calmly. If you don’t get the depth of this thing. Comment the same when ur parent dies. And blame others to mis-interpret. And yes.. @mallikadua YOU ARE STUPID", "its_deepvirk": "Media bikau hai madam.. Sab sale harmakhor hain..", "wassup_wid_som": "Body shaming is wrong...but so is emotions shaming... What you did in your video is an example! Those people who say ..lets get into war were not saying the same 1 wk ago! They are not war mongers! They say that out of emotions and if you had lost or felt like them, would have felt it too! I am.not saying, you don't care...but you don't feel what they do... So, yeah... They are not completely right or wrong... people are gullible ...they Re emotional and that is fine. There is a way to talk to them and its not how you did..as a public figure, it seemed like you were talking to everyone and that is exactly what you did. You have the privilege to do it...make good use of it. #EMOTIONsSHAMINGnotCool", "chinmai_tyagi": "OMG @mallikadua what did you just say! C'mon man.. you should not use foul words like asslicking, fucking or piece of shit, while @aajtak people are mourning day and night on our martyrs (As only *They* think they are mourning by defaming people and putting fake news just to make people more angry towards people who does not put posts and stories showing sympathy on social media to the martyrs or their families). Please @mallikadua please mourn like @aajtak ..Please shame people online for no reason.. Please 🙏", "soupy_gal": "Yes I am with you...real motherfuckers these news channels are.", "surabhi_pinjani": "@mallikadua fuck @aajtak .. every single word you said is correct!! We stand by you", "shubhamsona3": "Kya sach mai app aise khe hai...😢😢😢😢", "sunleo_93": "first of all i have seen your clip,and you had mentioned people die because of communal violence,unemployment etc,first these all are there individual reasons, a soldier died not because of personal reasons but for your country,so of course nation will mourn for that,and @mallikadua ..you could have avoided your bulshit gyan for once and keep doing shit what you have been doing for decades,but yes in ac rooms after having papa ki phuch ,gyan pelna jruri hain,visit house of martryed soldiers once you will get some ground reality", "naveen90sharma": "@mallikadua , i think you are not an Indian Citizen, but you don't know the difference between a Indian solder or common citizen, #bastardmallikadua,", "anjootripathi": "If aajtak is so i remeber what sort of asslicker your athe was a journalist.you should have asked when he used to lick feets of the congressis.And you blood insensitive person out there i know infact everyone know that you carry absolutely no respect for the soldiers but all you can do is please keep to yourself.", "alicerita.09": "Totally agree with you. Why do we need to post things online to show how sad we are. Who are we showing it to?", "ma_amaan": "Bhhot Bura haal hai mam is waqt media ka.... Jo poochna chye wo pooch nahi rhe hai . Sirf ek ki tareef me lage Hue hai... Kuch AAP jaise log hai jo sach Bolte hai unko aise hi badnaam krte hai... Proud of u mam", "sakshiiiii_246": "@aajtak jaha aapke channel ke anchors kal bjp aur congress party ke, tamam prawaktaon ke sath india gate par khade hokar sahadat ke diye jale rahi hain aur bharat ko ekjut hokar dushmano se ladne ki baatein kar rahe hain aur ghanto iss baat par charcha kar rahe hai ki iss gambhir sthithi mei kya krna behtar hoga wahi dusri or aap khade hokar humare desh ke yuwa ko zimeddar thehra rahe hain aur controversial news bana rahe hai.Ye toh baat ki khaal nikalne wali baatein ho gayi. Jaha ek taraf humara desh itni pareshaniyon ka saamna kar raha waha aisi news aur aise package ka matlab kahin se nhi niklta. Facts aur asal muddon par charcha karne ki toh adat hi nhi hai.", "bettercallgc": "Haan haan only your journalist father who is me too molester is a honest person.. Every one saw what you said .thank your god that you live in India freely", "kunalsingh629": "Randi maa ki aaulad hai", "hazzarikaa": "They don’t really deserve your attention, they’re waaaa.....y below that", "fly_like_a_girl": "How shameful and outrageous @aajtak shows the love they have for their country. How do you guys sleep at night.. Are u human", "amisha0285": "Khatam Aurat ho tum malika duwa attention k liye hamare shaheedo ko normal Death bata kr majak Bana rahi ho itni problem hai to Pakistan chali jao", "nidhi.kasture": "@mallikadua Agreed with what you wrote in the first half of this post, but you should learn the difference between DEAD and MARTYRED. How can you compare a soldiers sacrifice to a person who died of poverty !! He did not die for country but the soldier did..for your safety.", "shegoesbyrules": "But I saw your video yesterday and you didn’t said such thing... @aajtak giving fake news for cheap publicity.. !", "prkharjain": "Exactly. What you said was right, what they interpreted was wrong af.", "javed.kashif18": "Tera bap mar jata", "ay_yadav13": "When someone dead in your family plz i request you celebrate with party song. 🎉", "rohit_bassi_": "Woh sub toh sahi h @mallikadua lekin darbari godi media wali line toh papa ki h 😂", "_m_arvind": "@mallikadua ill mannered intellectual. Haha. See how much this troubled you. This is not even a loss for you. Imagine how a family should behave once they have lost their loved ones. You can retain back your status by asking for a show cause. Can the family of soldiers do that one they have lost their loved one. I guess not. This is not how the God has made the nature.you start abusing on social platforms. This is you upbringing? And when you say of peace. Peace is shit for them. Visit a home of a Martyr, and ask them for peace. They might leave you but those around the dead body of soldier will say to divide you in piece and yes it is piece not your \"peace\".😂", "abha_kapoor": "Proud of u everyday Mallika.. u go girl..👍", "pripatil": "Proud of you Mallika for standing up to these journalism-pe-dhabba pieces of shit!!", "gitanjalidas89": "@mallikadua I understand your anger and this is a time when people are misunderstanding a lot that is being said. I read your post carefully, and noticed that you used the words “anpadh” and “gavaar” in the same post in which you used the words “poverty” and “unemployment”. I’m sure you know that most people in this country are not anpadh gavaar out of choice but due to a lack of access to proper education. So your using such words prove counterproductive to your argument. Please do put a little bit of thought into what you say. I find you quite talented, but these words indicate a slight classist nature :/", "tejasrangnekar": "Dude, first of all your video was just senseless, next you cannot compare people dying of poverty to soldiers getting martyred.", "nidhi_shree21": "Oh my God. Didn't expect this from @aajtak", "_no_____user_____found_": "No u dont deserve this rather than makigin illogical headlines media should ask the govt what are they doing now did they did anyy", "she_banshee": "You should sue them.", "shriya.rajp": "Arey pagal aurat Tere pass bilkul dimag naam ki cheez nahi h ... Jab aaj pura desh ek hokar Indian army ko support karte hue Pakistaniyo ko saja Dena chah raha h to tu pagal h Kya kyu Ulta seedha bol rahi", "starofthe.show": "Full support to you @mallikadua", "swatisdhar2292": "You deserved this for d worst ever comparison you made!!!", "sunshine2020k": "Well she did not disrespect someone, she just said what she felt. Don't shame her.", "_0travelover56_": "@mallikadua You did this good, these media channels need to be called our for using distorted facts to gain publicity. However, I believe you could've been a little careful in comparing martyred jawans and deaths taking place for other xyz reason, you just used an inappropriate example to make a correct point (Though I completely got the point you were trying to convey and agree to it also).", "megh.7.6": "You posted the best unlike othersss who are just creating more of fake newss and show-off seriously.. @mallikadua - really grateful that there people like uhhh who voice out for correct...", "rao.falguni": "@aajtak she definitely deserves an public apology. These is the exact reason why I don't watch schedule content of new channels and news paper.cause besides reality and truth they serve only spices.. Do Apologize to her.", "himanshu.rai31": "The fact that you have deleted those videos clearly depicts that you can't even stand up for what you have said.😷", "diyajain4244": "If you have probleam with our country you can go Pakistan without wasting time . I know your are from terriost family .... only for publicity u do dis .", "aniket_jjaiswal": "This is nonsense @aajtak", "brajnandan11": "Didi ye Tumare baap ka channel @thewirein nhi hai. Ye @aajtak h ye apne according reporting karega", "sabamumtaz18": "Way to go girl 👍", "shivme": "U did it right", "teeninsta.18": "Achi maza aayi🙌", "_dipz._": "Koi tumko bomb se udage tab hum shok nhi manayege thik hai @mallikadua", "surajsingh5675": "👏👏👏👏👏👏", "abhishekkarmshil": "Jaisi baap waise beti..... Non sense ant 🐜", "santar_pawar": "Rand ko 4 days k liye kashmir mai chod do sab akal aha jygi isko # bc #mc # rupiyo k liye bkwas krti h randkaa bhawdi randi 😜👈🏾", "arpita_______": "At least have guts to accept what you said ... #likedaughterlikefather", "rockymambabdd": "Arey madarchod kitni bar Bola hai. Jab army walo ko Kuch de nhi Sakti. Toh izzat toh de chutya aurat.. Wo bhi nhi desakti toh apna bhosda band krke baithi reh chupchap. Tere Jaise wasted sperm k lie army wale jaan dete h!", "_taaaee_": "Stop comparing army martyr with people who die of hunger here the Indian masses are condemning the act of terrorism it could have been a someone else if not our unprepared soldiers if you can’t mourn for them don’t mock the situation people are disgracing the act of terrorism what we all stand against is terrorism stop comparing these two totally different situations", "tanvighildiyal": "Shame on you lady. Thought highly of you . How wrong I was!", "ravi_anand_pandey": "कल हिन्दी मे तेरी कायदे से बैंड बजाई थी तो आज इंग्लिश पे उतर आई। खैर तुझे हिन्दी मे ही समझाता हूं। तू ने कहा कि @aajtak को तेरे खिलाफ़ गलत न्यूज़ फैलाने के लिये पे किया गया है, और इसके बाद तू ये भी बोल रही है कि मुझको वो वीडियो दिखाओ कहां तू ने ये सब बातें कही हैं। पहली बात तो तू किसी सरकार या पार्टी क्या किसी इंसान के लिये भी इतना महत्व नही रखती कि कोई तेरी जैसी सड़ी गली बेहूदा और घटिया औरत के लिये आज तक जैसे प्रतिष्ठित न्यूज़ चैनल को पे करे। दूसरी बात कि अगर तू अपने विचार मे इतनी ही सही थी तो तूने तेरा वीडियो क्यों डिलीट कर दिया?? अब आज तक से वीडियो क्यों मांग रही है?? तो कुल मिला कर बात ये है जहन्नुम की मल्लिका जी कि जनता का आक्रोश देख कर तुम्हारी फट गई है। तुम्हारे जैसे तथाकथित ओवर बुद्धिजीवी लोग साले सिर्फ न्यूज़ मे आने के लिये घटिया से घटिया काम करते हो और बेहूदा बयान देते हो। तुम्हारा न अपना कोई व्यक्तित्व है ना अपना कोई वजूद। अब जब फ़टी तो मैडम बेचारी बन गईं। छाती पीट पीट के चिल्लाने लगीं, हाये दैय्या हमे तो आजतक ने बर्बाद कर दिया, हम तो साक्षात देवी का अवतार हैं, हम तो क्रान्तिकारी हैं। अबे धुत्त, तुम्हारे जैसी थर्ड क्लास लोगों को तो कुछ नही बस देशभक्तों के हवाले कर देना चाहिये। दो दिन नही लगेगा औकात मे आजाओगी अपनी 👉", "quilling_lover": "Dude ye army k log hai, do you even know their importance? Agar society kuch acha nhi faila sakti to please rubbish talks to mat failao😒", "iamiratyagi": "Totally supporting you on this @mallikadua . We all of seen the videos. It's just a matter of fact that this country is becoming intolerant day by day. They find it very easy to pin point fingers on each and everybody out there.", "world_creativelens": "Channels like @aajtak are only there to create faaltu sensational news. Just because they want to get talked about. People who are sensible enough don't believe in such nonsense news. Such channels should be sued and banned for putting false news and creating a mess out of people's life. Don'ts stress over it girl..and shame on people who still can't understand simple messages and go on to say shitty things here. #gogirl", "aniskant_132": "Behuda aurat tere saath yhi hona chahie.. @mallikadua", "ritwizshukla": "Jab aapke parents me se kisi ki death ho na behenji, tab rona ya dukhi mat hona. Bas yhi bola log to roz marte hai👍🏻", "shubham.0897": "Not only Aaj tak but many Ither News Channels are doing same thing!! There is a Race going on for who is more Desh Bhakt!!! Television Media is showing rubbish, they are provoking people to ask for War with Pakistan. But they are not showing reality. War is and cannot be a Solution for anything!! What needs to be done is to Kill those Bastards who have done such a act and Degrade Pakistan Internationally!!", "soumya.2307": "Why doesn't @aajtak focus on something better? Oh my bad, I forgot that these news channels don't like to talk about real news.", "amit_sohal93": "Jada pade likho ka yei haal hota hai !!", "krishanyadav338": "देश के सैनिक बॉर्डर पर खड़े हैं तभी तू हंस रही है कमीनी नहीं हंसना भूल जाती,,, इसलिए सैनिकों की इज्जत की जाती है,,, पर तुम क्या जानो बिगड़े बाप की औलाद", "mv0007": "So bravery ma'am. Respect to you..", "soham_205": "You are commenting that Aaj Tak is communal.what is your father's company the wire then. Vaise what about the molestation case of your father", "echokilomaverick": "What you shared on social media there are two inferences..1. If you would be really worried about people dying of hunger and had great respect for indian ay and paramilitary forces...You words would be I feel sad about the losses of our security forces and people are ready to support them..But I would urge people to also share same nationalist feeling feeding the poor, saving lives of needy..2. the statement which you gave was really degrading to both security forces and had no regard for lives of poverty struck people...It was like since people are dying of hunger and all why concern for death of 40 jawaans..And the concern for fake nationalism..Yeah some can be but the fact of matter is the attack has been carried out on indian soil..40 families hv been destroyed...If", "manish.chandra.71697": "You are plain dumb stupid nad shameless character ..what can be expected from daughter of a molester", "insta.akki": "karma is a bitch....bol ab..hate is never the answer....koi news tum jaise gaddaro ka real face dikhade toh fat jaati h....dekh abhi boycott this bloody terrorist supporter and fir against her...shame on you.", "annemariamathew": "media or a bunch of communal vipers these people!", "ojas_kainthla": "@sushantkareer you have a case.", "k_a_k_a_r_o_t__": "Ek Desh ka jawan aur mentality disturbed logon main utna hin farak hai jitna Zameen aur asman main.😣", "imsumiii": "Ye bik gyi h media", "akanksha_khandare": "@mrudula_dilip_bangale", "abhaysoni375": "मल्लिका दुआ । दुनिया मे बहोत से लोग मर रहे भुखमरी गरीबी से पर आतंकवाद फैलाने वाले लोगों के पास तो पैसो की कमी नही है तो वो लोगों को क्यों मार रहे है ।। 26/11 मे लोगों की क्या गलती थी जो वो बिचारे मारे गए। भुखमरी से मारना ओर आतंवादियों के हाथो मारने मे बहोत अंतर है । खबर मे आने के लिए उनका तो मजाक मत बनाइये जिनके सामने आपकी औकात कुछ भी नही है।। वो देश के लिए शाहिद हुआ है कम से कम तुम्हारे बाप की तरह यौन शोषड नि करे है ।। घटिया बाप की घटिया औलाद", "kr4it95": "Media for you", "deepakjoshi0209": "Who will try to defame u? #justasking #pkmkb #udeservethis #juthididi", "dilpimann": "Is this even real?? @mallikadua I totally agree with y", "akshay_raj_rana": "Bhgwan teri aatma ko shnti de ❤️", "shrishti2227": "Omggg @saloneeeeeeee wtfff i saw tht uk igtv pe ,dude these news channels are fucking crazy", "z.usman83": "Aur bolo, I am sorry no one here is supporting terrorism na hi india na hi Pakistan but India is such an extremist country that I really feel scared for the people living there", "rinku_rajput1234": "Lawda le bc", "shivanijaguri": "They just need some news ... doesn’t matter that they might be missing something important worth showing ...", "arora_rahul94": "joker 🃏 of the century", "__safarnama": "@misanthropic_element don't believe everything you see.", "deepak.kumar___": "Randi hai tu sali kutti", "prernarathi29": "@mallikadua ..we stand by you", "_aeioouu": "Indian media consists of humans playing cartoons.", "shrivastav_j1": "I had a respect for you, but now unfollowing you, 🤘, have a great life ahead", "ujjwalgaj": "U r just attention seeker", "shahiiinaaa": "These guys actually need to understand this🤦🏼‍♀️ The post was only for telling people that why do you want to post shit when you actually don’t give a fuck about the nation", "pranay_shivaay": "Told u brains of an actor........naa ho payega😂🤣", "p.swastica": "Army men died for us, for our safety... Poverty, hunger s jo marte h vo alag cheez h dono m difference h...", "basantagarwal123": "The difference b/w people dying ,of hunger and soliders, is that soldiers died for you", "_bijili_": "We love you mallu fuck these idiots godifucking😂 media I know it's not easy but , try to ignore cause anything happens we're with you 😍😘 my chicken pakoda", "saw_mya": "Unfollowing you now @mallikadua I know you won't care one bit, but you know that in your heart that you misused your freedom of speech. Popularity got into your head so much. People like you don't even deserve to be fought for. But the martyrs still did. Be happy with your low IQ blind fans swooning over your cancerous low class videos that literally anyone can make sitting in the comforts of their homes. Someone lost a husband on Valentine's Day, and you have the balls to say any random bullshit; and the worst part is later you don't even own up to that. How dare you think you are anything at all! Fucking don't need you on my feed ever again.", "i_am_abram3625": "Ye news wale hai he hote hai .kyu ki ye toh Modi ji ka news wale hai na 🤣is liye agar Aisa nhi bolenge toh hawa pani band ho jayegi jitne bhi @aajtak jitne bhi news hai .ye bhakto ka mela hai jo khatam nhi hota 😂", "nav_een_bisht": "I think you really need a doctor Mentally ill u r", "akanksha8658": "Fake news against mallika dua ,but why u did aajtak. Why d hell u r spreading fake news. Bloody assholes .", "ali_shaikkhh": "Tu @mallikadua chutiya", "seismicsanguine": "Oh my gawd. This is hilarious. News is so cheap these days. I thought what you said in this video was absolutely appropriate. But they will always misconstrue words and create trivial projectile diarrhoea news to keep their channels running. Girl, these allegations will do nothing to your reputation. People who matter know that this bull shit and twatish behavior. A lot of men and women look up to you and know for a fact that your comedy always has a optimistic social message regardless how blunt or crass your jokes might be. People are often afraid and insecure about strong women around them and we have the whole country to deal with often. Best wishes to you.", "chanandler_bong_thebing": "Wtf! Bro whatever you said was so relevant💯", "yash007____official": "Tabhi kehtey hai Hindi Mei likha karo ,___,", "pragnya111samanta": "Nonsense news aajtak", "nayona__": "Ohh come on, it's on your igtv. Aaj tak is right about what you said. Atleast stand for your own words.", "simerbharaj": "@aajtak fitteh muh!! 🤦🤦🤦 Itni bakwas soch laate Kahan se ho???", "yojaluka": "Didi, Tum aage badho... Hum tumhare saath hai🙌 😅 after i saw the story yesterday. I knew this will create some scene. Mudda ye nhi ki aapne kya bola. Mudda ye hai ki Aapne bola. 😅 The topic is sensitive at this moment. Anything besides \"Pakistan ki maa ka bhosda\" is anti-national..😂 so just hug the luna-cat. And avoid these luntic", "ur_pic_is_no_good_bt_i_still": "@torshachatterjee someone is buthurt! 😂😂", "aditpratap": "@mallikadua i am feeling sorry for u ! U make alot of joke ,memes and all those funny things which we realy enjoy, i can understand u tried to make some sence but , u went wrong , its not your forte! U r a sweet girl but somtime being famous is difficult, i feel u should be apologetic here because u have heart feelings of patriotic people. I think there is no shame being sorry if ur message went wrong. People will still love u ❤️.", "khoiwalajay149aman": "Aaj tak vale fek prefogenda chla rhe.i 'm big fan of vinod dua sir,", "itstarannum.__": "Tu aur hot??? 😂😂😂😂😂 randi hai tu 😂😂😂😂😂 madarchod kaash tu marr jaati bum se😂😂😂 hatt saali khud ko fake bol rhi hai 😂😂😂😂 moti bhains 😂 pura desh nafrat karra hai tujhse tu samajh jaa ab bhi😂 aur aaj tak ke saamne tu kuch nahin hai bhosdiwaali😂😂 teri aukaat hi kuch nahin hai", "_mr.francis_": "@mallikadua They must have given time to choose the photo instead of the content, their idea of journalism is more of creating news rather than focusing on the facts. Plus to target YOU, these people have shown that if there is a free voice, people will always find ways to stop or insult that voice. More power to you ♥️", "bhavna2112": "All brainless people and news channel were offended by your story . Because those brainless stupid lame people just do not understand what is being said . Idiots @aajtak", "thefitpunch": "@mallikadua and I agree to your part of saying abt people taking on people. Bcs evem the army officers thought are the same. You can't mourn enough with a post stating it. Condolences we all can have. But we don't know the real pain of the families who lost their dear ones . Howsoever hard we try we can't lessen their pain with out changed DP with indian flag. Nor that even we need to let our brave army be told wat is to be done and how. They are way better at their job. That's y we are alive here. To act all this shit up. We should totally keep our thoughts reserved for celeb marriages and IPL selection and whether trump is a good leader or not. And should leave nations safety in the hands of the deserved.", "harneetkaur1590": "@mallikadua : your picture ( which I believe is awesome) has sadly been also been picked using the same gutter mentality that went into misquoting you. Hot woman=country-hating bitch.", "kulrajput": "Vo to shukar manayo ki photo achi laga di....😂", "ssharma1609": "only ndtv is good, coz your ass licking father work there..... he also gets to try different food for free when he is not licking assess #faltukicelebrity", "adarshsingh_01": "Teri chut mai gajra lga kr rakh mai aata hu teri marne", "hritik.seth.5": "The Only reason I Liked this post coz now its Perfect 33400 likes else it was 33399", "nishant_here_": "Yu deserve this..!!! @mallikadua 🙂", "single_malt7": "Gaanja pike IGTV pe online aayi thi kya... Ya koi bada drug aya tha Pakistan se", "rohitpratapverma": "🌰🌰🌰🌰🌰🌰🌰🌰tati", "sandy1sharma1": "Desh ke liye Marne ke liye zigar chaiye,unki wajah se tu freely ghoom rahi aur video post kar rahi h, shame on you.dont compare their sacrifice with any fucking thing.kuch kar Nahi sakti toh at least chup chap Apna kaam kar", "omna18": "That’s insane! @aajtak is the worst news channel that exists!", "sadaffanis": "I'm so sorry you have to go through all this mallika. Like seriously. Aajtak is full of crap these days. Please do not let craps like these dull your sunshine. We love you and all that you do. You talk fact and sense. We respect you for that. Much love 💕", "saurabh_.bhise_": "😠😠😠😠", "garima_s03": "Revisit your video Ms Dua..If you are so correct and you mean nothing bad what was the need to delete the video..pseudo intellectuals like you should keep their mouth shut instead of talking shit...You may be a celebrity but nowhere above nation..#apnagyanapnepasarakho", "_thesmalltowngirl": "I watched your stories. It made complete sense and I didn’t find one line out of line or insensitive for that matter of fact. I am a lawyer. So a friendly advice. Save your stories and file a suit for defamation. Some people need to learn a lesson.", "fheoenw": "If they are a piece of shit. You are the total shitty bitch Mallika.", "sharmavrinda10": "Embedded media ! Hopeless", "manju_singhh_21": "👏😢", "the_solitary_walker02": "@mallikadua abe Rehne de do change karle tu apani...*****lagti hai", "boo1390": "she would never say that", "maitrayeed": "I saw your video. You never said such rubbish things. You simply called out to the fake patriotic people who only understand the existence of Indian Army only when they die. Plus they are also oblivious to all those people who die everyday .", "chandrakeyrun": "@aajtak Is Biased Chutiya Media Channel,", "whatisthepurposeofhumanlife": "According to the home ministry, 189 Central Reserve Police Force (CRPF) personnel committed suicide since 2012, while 175 were killed in action in the same period. In the Border Security Force, there were 529 suicides since 2001 while the force lost 491 jawans in action. http://www.newindianexpress.com/nation/2018/mar/22/700-central-armed-police-forces-personnel-committed-suicide-in-last-six-years-union-home-ministry-1790997.html", "lsannidhyal": "Accha matlab @mallikadua ki maa ka Bhosda ,and Pakistan ki maa ka Bhosda is constant. 🤷🏻‍♂️", "victor_dish": "How is their fake patriotism going to help anyone, bhai ghar ka koi marta hai to fb pe dalte ho kya? Dil me feel kro na, be a citizen honest and hard working enough to make their sacrifice worth. Be an Indian worth for all that the soldiers are doing. I stand by what mallika said @mallikadua", "_komalmittal_": "Omg above everything.. they made this fake news a breaking news.. shame on you @aajtak SHAME..", "nutella.nutcase": "Ohh god @aajtak seriously dude ! I mean this time our country is in a mess n you still made news of someone’s opinion n manipulated it for seeking attention 😂 you guys are heights man!! Showcase some news that actually affects nation .. kuch bhi log !!", "vishal_sharma951": "Attention Seeker Lady poor malika dua. people like you do not think before speaking, because you do not have brains. I want to ask you if anybody dies in you family and your neighbor started playing DJ, then how did you feel?", "drizal75": "Media sucks now a days @mallikadua relax!! Just thoping there stupid thinking using other’sface", "kaviraj_jitendra.s.rathore": "We are with you..mam.i saw all this....", "yogaindi.rads": "Such bullshit going around. It’s ridiculous! They are just using the initial minutes of the video to spread this venomous talk. I knew in my heart that you would have more to say. You are brave, girl! Big hug!  Please people, watch the whole video on IGTV and understand the context. Don’t fall for fake news. Put a stop to it.", "laxman_k_p": "लगता है कि तुम्हारी पापा इंडियन और माँ पाकिस्तानी है और पाकिस्तानी औरते एक से नही कितने से चोदवाई होगी।", "sayaliithape": "Omg @mallikadua you got angry just because @aajtak said something that hurts your sentiment huh? And what about yesterday when you utter shit about soldiers? You think the families who lost their loved one liked what you said 2-3 days back? WHATAA HYPOCRISY. You can compaire two totally different conditions/people and this news channel can't even speak about you. Lol you're not that important at all. 🌚", "the_uptown_guy": "@aajtak is all gone to the dogs. And so are the uncivilised animals who couldn’t understand the meaning of what was written in the post.", "himanshu.uniyal18": "Abe bc Ac rooms me baith ke bolna bht aasan h....jara border pe khadi hoke dikha....Jb goli niklegi naa bagal se to aage se gili aur piche se pilli ho jayegi.. chutiya saali....beta desh ke liye jaan dena bde garv ki baat h...ye actor, model to koi bhi bn skta h lekin koi bhi ek fauji ni bn skta...isleye jish desh Ka kha ri h us desh ki deshbhakti kr....ni to Pakistan ki goad me jaake baith jaa....😣😣😣😣@mallikadua", "srijan_supreme": "WTF....media is f*kin Crazy😤", "swatibaweja": "Please sue them. News channels have gone to a low that’s worse than the most pathetic drama shows. They ain’t delivering news anymore. They need to learn a lesson. This is pathetic.", "shruti03july": "You have said it.. Nobody has twisted your words.. I myself have seen it.. Now many people are bashing you so you are playing a victim and blaming everything on aajtak.. Double standard.. Didn't knew you are this type of person in real.", "vikas251194": "Sue them", "noor_reuters": "Kudos Mallika.. for giving a voice to those of us whose patriotism doesn’t jaago only on Aug. 15 and Jan. 26 :).. and who believe that real change is not about taking revenge and shaming the secular thread that makes India work really :).. it’s like a saying I once heard- I came to console you, found you already consoled and got angry! Moving on and going on with our dairy lives, while saying a silent prayer for those who have senselessly lost their lives and their families is what makes us human.. also thank you for the million laughs and giggles you give out everyday 😍😍😍😍- sincerely, a non- agressive Indian", "sachin02206": "This Stupid Bitch doesn't knows the difference between Normal Deaths and National Tragedy. Jab Aatankwaadi aur Pathar fekne wale marte Hain Kashmir Mai tab ye BKL Chuddiyan todegi ,Hungama karegi Social Media pe ,magar jab Jawano ko Veergati milti hai tab is Moti Kutti koi Fark nahi Padta .Tu aur Tera Molester Baap dono Chutiye Hain BC .", "sharmauttiyo": "Stop making these videos you Pakistani", "tanisha.singghh": "@mallikadua You owe them. They martyred while protecting you and your family and leaving theirs behind. They martyred(not died) because of a purpose. So some amout of sensitivity is highly appreciated from sensible people. But you are not worth it. And by the way you are looking horrible just like your thoughts. Aukat main raho, aur Aukat main baat karo. Bas itni si baat hi hain. @bruisedpassport I really want to know if someone would have killed your loved ones, kya feel hota. Are you at peace after reading this. I know you don't carry such a big heart like our heroes. But a little amout of sensitivity is what we asked for. They lived and martyred for us. You and this useless @mallikadua are one of us.", "akshay_ghutepatil": "👍👌", "_o_x_y_m_o_r_o_n": "Papaji jab fake news dete he tab kyu nahi bolte ho? Unke video bhi aap hi edit karte ho kya?😂😂", "killshot_0p": "This is what you want na... Bhenchod attention ke liye hi to kiya tune ye sab chutmari ki..", "jaishree0591": "@gauravajwani ur company is spreading fake news😂", "renukarajputxx": "What was baawle chore incident..", "sagars2177": "👏", "world_record_pkmkb_": "Lets set a world record together... Lets make the Pakistan ki ma ka bhosda trending in world.... By making most liked toilet paper in world🚽🚽 #Pakistankimakabhosda(PKMKB)", "kaustubh__vaidya": "Madam main apko lahore chodd aau?", "amusing_hermit": "Hey they tried to claw you breathe it's all folks and false Damn!! You hot.", "vvkkss123": "Tere chut ka bam bhosda hua hua sali rand ..To bhi tu galiya kha kha kr chudna chahti hai bhn ki lodi ...Pta nhi tere dimak m lund ghum rha hai", "bengali._.chic": "She got hate initially because she attended a party, not some kkk Meeting", "dreamstar.deeksha": "😂😂😂😂😂😂😂😂", "95325am": "I think people are not mature enough to understand the fact that she wanted to state that every life matters and that everyone has their own way of mourning. It need not necessarily be posting on social media that they are/are not mourning. The loss of lives is real and reflecting on the cause and effects is more important instead of turning it into a competition of who and how they are mourning or expressing their emotions. News channels just want news they really don't care that all of us are humans with emotions and proud citizens of a country we are working hard to improve. Basically everyone wants attention so creating scandals is a means,what better way than to twist and play with words!", "aniyyy16": "I support you bro ! I have seen that video of your ! Already the same news was going around every channel just to pick something useless they got this. Kuch bhi mtlb kuch to bhi ... 😑😑😑😑", "maryammaijazz": "This is hilarious 🤣 AajTak needs to get life that doesn’t involves sabotaging statements. Lulz. You go girl. @mallikadua", "bhumika_khatri": "Didi galti krke mukar gyi...maafi mang leti kya bigta...ek aur video daal di...MATLAB sudhrogi nai didi?", "the_keeper_girl": "@askanshul iska bhi Kuch kro bhaiya", "vandita_m06": "@rishabh_joshi.96 do they even think while writing such nonsense? Such bullshit!", "threeone_third": "यही तो propoganda है... इसी से तो अज़ादी चाहिए ❤️", "apycalypse": "Call this bullshit out. Make a video. File a defamation case if you want. These assholes do not realize the impact and shock they create in someone's life! I wonder if they even think twice before printing anything. @aajtak you scumbags! I knew your channel was downright shitty but this is a new level of low. Proving yourself patriot by causing unnecessary problem in your own countrymen's lives. I feel even sick for pulwama soldiers now. They died for the peace of this country and you cunts are hell bent on destroying it. Shame on you. Shame on all of you.", "harshagrawal302": "@ankit_singhaa", "_ayushiaggarwal_": "I was waiting for this reaction since yesterday! They deserve it!", "memehoex": "You've no idea how disgusted people were by your video. Shame on you", "blingy_swaty": "Oh god what is WRONG with media and news channels?? Really is this what now news channels are for🤷🏻‍♀️", "sreyashi12": "I have always@like your body of work and always felt proud of you as you set new benchmarks and definitions...sadly not this one time", "sumant_choudhary": "You have lost it daughter of alleged Rapist Journalist.. Finally unfollowing you today!! Itself you compared the martyrdom of soldiers to death due to hunger, unemployment. Shame on you!! 😡😡👎", "gauriikukreja": "Honestly, Yes you did say something wrong ! Plainly because @mallikadua it's a very Sensitive issue. I'm not saying what aajtak is saying is correct but the same time what u said wad equally insensitive. I remember you said - Har roz log berpzgaei, Bhukmarri se marte hai kya hum har roz moun karte hai? Kya hum jeena chorh de? There was a difference in what you said and what you meant . It's 50:50 Ratio in your comment log of people supporting you and not & my comment might just actually get lost in that pool but I would still say - This case of #pulwamaattack was so sensitive that it dint need that sort of acknowledgement from you, I dint need that comment. That's all.", "mukki1125": "Mtlb jo tere pappa bole wo sach baki duniya bole vo chutiya...or kya bola log roz marte hai.. kuch to sharam kr..cheap insan😠😠😠😠", "mad_commenter": "@aajtak ke ma ka bhosda", "malvikamahal": "I think it’s a plague. It’s a disease. And a lot of people had gotten in its chapet, including the media. Or may be the media is the vector.. primary in spreading this whatever severe infection. There is no other explanation to it. There is nothing that I can tell myself.. to console.... watching my own people going crazy in the name of nationalism and what not. It’s a disease. That’s it. I can’t fix this. @mallikadua can’t fix this. We’d try the best of the methods to impart common sense into people and they’d reciprocate with hate and more hate. So we stop and wait for it to either metastasis and grieve or for a magic cure to fuckin emerge and fix this for once and for all. 😔😭", "monika.gupta.9847": "As usual aajtak sucks. The most damaging act by govt country is this", "vinayraj1992": "2", "zahwa_siddique": "@aajtak you are a piece of shit!", "i.em.aditya": "Madharchod h bhosdiwali Desh ki gaaddar h", "im_vyenkatesh": "Apne Baap ya bhaii ko bhej border pr...fir krna bakchodi .", "gilberttreblig": "Rediscovered Nationalism! Ribbion walla Nationalism... 😂😂😂 Give them short term memory one month to normalize. Btw who watches @aajtak and y give fks!", "ifrah_nayyer0109": "So now you know.. That's how much indian media is delusional. They did same when the bomb blasted. Started imposing the blame on Pakistan without solid proof. C'mon open your eyes. Don't believe the shitty media. It only cares about its ratings. Apni ratings k lie yeh 2 mulk khatam krwa dy ga lkin sach ya other side of picture kabhi nhi dikhaye ga.", "shobit_bhatt": "Madar chod publicity k liye kitni giregi ab tu😡", "rajesh_rana91": "Ghar me koi marega na taq samjh aayega madam", "kanak_verma": "Time to leave this planet i guess! @aajtak konsa gaanja fooka tha news dalne se pehle bhai??", "harshita_j23": "WELL SAID DIDI.. !! 😐👍 YOU ARE ❤", "umrakhan786": "@malhotra12harshita I want to ask you what you did for our soldier..??", "authentic_dopeness": "All they want is people should start fighting, communal fights, religion pr ldai... logic society mein inhe chahiye he nhe bro..", "vijayd7": "This is disgusting. I’m so sorry they did this to you, literal definition of fake news. Hope they pull this and apologize immediately.", "iamace99": "Chapa samachaar Chapa Chapa samachaar (imagine sanjus life now.. Bechara baba love you baba @duttsanjay )", "ninz_2708": "These fuckers don't have the balls to show the real news, thus they keep on spreading fake shit.. Shame on you @aajtak", "vidul_vd": "@mallikadua your the epitome of every thing that one could desire ♥️. It's just that MEDIA LITERACY should be made a compulsory course in one's education.", "abhaychaudhary6756": "Teri maa ka bhosda behan ki Lodi madarchod bhosdi chut ka bhosda Bana Do behan chod lund dedo Hamare Desh Ke Jawano Ka mazak Uda rahi hai Unki Shahadat ki tasveer bana rahi hai teri maa ko Chodu bhosdi ki randi behan chod bakwas Na Kariye Tere muh mein lund ki Hoon randi", "radams_motivation": "ajj tak for 😂", "srishtikaushal_guddu": "U deserve it big fat pig 🐷🐽", "nareshsherawat": "They all are idiots who are blind by modibhakti", "abafna": "A citizen who does not understand the difference between people dying by an act of war or terror and those dying by other ‘regular’ reasons needs psychiatric help.", "mugdha_patankar": "I am a huge fan of @mallikadua and have seen both her status and the video properly . I agree with her on every statement except one . She clearly stated that people die everyday of poverty and diseases thetly are not mourned the same way as the soldiers . While these deaths are overwhelmingly sad they are different from the inhumane killings of the soldiers . Again , I agree that people and media have taken things too far and most of the trending \"mournings\" are not mournings at all like the tik-tok videos @mallikadua has posted . Her claim to the blame is only comparing other deaths and these killings . They are 2 different things and have different consequences which none of us can truely imagine from the comfort of our homes", "nanysachar": "Pade likhe gawar bhare pade hain @aajtak mein..... cant interpret simple words...ignorant a** fu**s", "chait13": "@mallikadua people with common sense get you. In the hope that , that number become significant over the other soon ! #supportcommonsense", "sammy_eder": "Hey you fucking idiot. Yes people die every day. No shit genius. But those SOLDIERS, they died for people they don’t even fucking know. They are protecting people who they have never met. It’s called SELFLESS SERVICE. and it’s basic courtesy to not post pictures of you having fun and chilling on the day something so tragic has happened. BASIC COURTESY which obviously your scum of a dad didn’t teach you. Please stick to your dumbass jokes bitch", "filmylady": "Last I checked she was a comedian. What has gone wrong with her. Desperately trying to gain attention and that too for all the wrong reasons.", "instakash23": "Tu vi Nikal Pakistan......", "sarcasaman": "Wow wow wow! So death of our martyrs is just an another day in your life. Well that's a new level of nationalism I can see in you. If you can't help then just stfu and don't spread negativity on social media by your posts. Go, take care and defend your molester father you sh!t.", "27_aniket": "Tera beta hoga tho usse army me daal...fir smzme aayega army kya hotta hai jara thike baat kiya karo", "azhagan_108": "Ma'am I saw your clip , they added some masala to spice it up . But comparing soliders death to death of hunger striken , suicide out of depression and frustration that was something low on your side too . Maut aur Shahdaat me Fark hota hai ....", "mirzasimranbaig": "Ft", "shiv7981": "You can choose to be a bit more sensitive to the situation though. Wouldn’t you agree?", "nehashriraomehta": "This is heights of fake news. People following you will know what you've said, which can't even be misinterpreted as this shit.", "shilpi.g.goel": "I’m sorry u have to go through this? Where s this leading to? What sort of democracy r we living in ? Like a right to free speech is a thing of the past eh? We have to ride the tide or simply be banished ?!?", "ii__superwoman___ii": "Nonsense is what @aajtak is doing", "balodishivani": "@mallikadua you are one brave Indian", "moderatenormal": "When I saw this image, I genuinely laughed out loud as the interpretation is beyond ridiculous. But immediately pained my heart to knowing that people actually watch this shit and snort it every single day. This image is too many emotions.. 🌸 Power to you @mallikadua.. And sorry that this happened to you..", "i_aniket.k": "I know aajtak is wrong for the use of word Behuda. But her stories were really very insensitive. Log Marte Hai To Kya Itni Badi baat hai. Ye indirectly mean karti thi wo. I also enjoy her stories. I also like her work. I find her savage papaji stories funny. But I was shocked listening to those stories.", "priyavratwithwings": "You're just abusing them. If a man would've wrote this you would've just brought your feminism into it.", "mbojpriyanka": "What nonsense dua...dua sername rakhti hu or dua bhi nhi hoti ...hum bhukhmari door kar sakte h or kar bhi rhe par kya tum jawan ko dauhara jinda kr skti. Ho hai tumhare baski batao mujhe...paheli baat doosri baat yei tumhare ghar mei aatankvadi ghus jaye jb tum khana kha rahi ho tou tum kya karoge khaogi ya apni jaan bachaogi...or tumari fmly mei sei aatankvadi ka shikar ho jaye tou kya karogi dukhi hougi ya phir new comedy vdo upload karogi...yei rajneeti wali bate na kark or desh ki cheejo ko compare na karke soldiers k liye jo hum kr sakte h hume karne..chaei vo koi yudh ho apsi samjh sei koi big solution ho or ya phir apne emotions ho ok...jb apna marta h na tou ek din do din nhi balki har roj takleef hoti h samjhi tum....", "snigdha.singh.rajput": "Girl..just now saw Ur video clip...you comparing people who die from hunger, unemployment and depression with marteyrs .... can't you understand the difference...", "sanarora1992": "It has become a thing to read too much into words and twist them and make “News” for publicity. Shame!", "bansalpinka": "Side effects of having an Honest & fearless journalist as father. Dragging you into the world of personal attack.", "aditya_kr55": "JIS din tera baap bhai aur maa mare gi ush din yhi bat bolu ga ki log roj marte h...tera baap bhai aur maa mar gai ishme kon si baadi bat h..Bhagwan se dua karunga ki tumhare family se jaldi koi mare", "shalinivarma": "What a disgrace AAJTAK", "trisha2312": "Tbh, more people die in India due to accidents and I don't see people leaving their jobs and mourning over it. Roz buses girti he khai me up over in himlayas, kyu koi tab shok nai manata? Girl children raped and murdered, farmers committing suicides... Isn't that a failure of the system too? Are those lives any less valuable? Yes the soldiers died and yes they deserve the respect but you can't put a halt on normal life. Can you? Seriously, think about it. We as a society have time and again shown that we focus on unnecessary things and forget all about what is becoming an imminent need - A sense of maturity and tolerance!! Grow up guys and go do some community work instead of bashing Mallika and wasting your stupid lives on Instragram!", "fatima.arif06": "No problem malika dua \"Romers are spread by haters listened by fools accepted by idiots😊😊😊", "_triptichoudhary_": "@mallikadua They have been always such piece of shit. We know you, we know how your views are. Ignore them. And I agree, picture is super haawwwt.. 🔥🔥😍😍😘😘", "aman.draws.life": "only those people were offened.. Who couldn't get what she was trying to say. I have spent my life till now with my dad who is in army... So ik I am patriotic enough so this shiz going in country.. Targeting people with antinational tag! Omg this needs to stop right there. Also... Idk why they are offended.. Because what she said was absolutely right... I know the feeling.. How it feels when the person you love the most is out there for protection of whole country. Also, people are litrelly throwing bullshit comments without even getting what she's saying. Omg where is this world leading us to", "l.u.r.a.p": "Maan hani ka case kardo yeh kaltak news channel pe!!", "pragati8880": "I don't really understand how ppl pretending n showing off there fake patriotism, so patriotic while we leading normal life, feeling bad about the incident ofc but respecting the concerned authorities to take action, through the correct way being blamed like come on, have brains. N stop that framing out through meadia thats more like spreading terror in lives of normal ppl.", "aishajaani": "You are so legit. Love you! 🙏🏽", "krittika_dutta99": "What the hell... Bloody corrupted news channels.", "himakshi_179": "Arreeee madam how can u soo fucking compare a person who is dying out of starvation n poverty to a fauji who is giving up his life for ur safety agar app ka koi apna jata tab bhi yahi karte kya aap n no one is saying u to sit n mourn bas yahi bol rehe hai show some sympathy nothing else", "shyantani97": "WTF???", "ahfaz_rudy": "@aajtak aap chutiye hain 👎", "tanyaappachu": "Did she jst delete the video in which she said exactly this 🤔", "ananyarai55": "Those stupid ppl from bullshit tiktok videos don't even know mallika dua exists ...... Mallika talented to tum ho ma'an na parega🙏🙏🙏", "tina_ohri": "More power to you @mallikadua", "nikita.mahindra": "@mallikadua Have followed all your posts...you have surpassed their understanding hence such baseless allegations against u...stand by you👍👍👍👍👍👍👍👍@aajtak This is not correct...guys you cant torment celebrities unnecesaarily ..", "sanjaaydhyani": "@mallikadua no body gives a fuck about you and aaj tak . You are a stupid girl. One can see that level of stupidity came from your father .", "artcocoon_by_richa": "Its not just aajtak if you google Mallika Dua under news, many many more newspapers have slammed her for the video which she had uploaded and later took it down. She herself knows what she spoke was incorrect towards the Indian Army. She had gone on to compare the everyday deaths of people to the death of Pulwama martyrs. No one is asking her to mourn their death but if she can't pay homage to them then atleast she can keep a code of decorum.", "the_troller853": "AJJ TAK AUR ZEE NEWS NE LIFE TIME ACHIEVEMENT AWARD JEETA HAI DALLE GIRI MAI FAKE CHANNELS...", "shreya_rai_rawat": "But dint you say exactly that...", "vedikav": "Comparing ppl who die of hunger poverty with our army men and soldiers is just not a fair comparison...well the news channel needs to report much bigger issue than bashing @mallikadua but at the same time it was not a very pleasing post...and yes she is right that we cant mourn the entire year n life goes on...noone stops eating food drinking water or even being online...thats fair! But no comparison between the death of our soldiers who are fighting for our country and the other natural death that occur every other day...No life is less important but I feel the respect I have for people who have voluntarily chosen the path to safeguard our country n the countrymen is next level...and it is a fact that not everyone has the courage and compassion like our soldiers who have left their family to fight for their country!", "shalaka_bajaj": "There is difference in terrorist attack and poverty. And jisko jo krna hai kare. Tumko nahi manan shauk tumne nahi manaya. Aajtak ko jo krna tha unhone kia.", "mumu_salam_xu": "@aajtak asli smart educated India HATES YOU HAHHAH GO TO HELL JAAHILON", "__manisha_sharma_": "@aajtak u sucks.. If u don't have any important news than At least confirm ur silly news..i think u should apologize to @mallikadua 👀", "ruperoo": "This is legit crazy! Seems like @foxnews of India", "somyaa_tyagi_actress": "Madam you said this, aajtak is not fake , you need cheap publicity, so please dont blame aajtak, please clean your dirty mind", "shambhavatashah": "Saali terrorist ki aulaad @mallikadua teri maa ka bhosda", "shree_borude": "Fuck u 😡😡", "saba.qsr": "You slayyyyyy girlllllllllllll✨", "the_movin": "Godi media channels No 1 @aajtak #shame", "ayaan.rizwi": "Ma'am we stand with you., dont worry about the modi's bakwaas media", "taniism": "Sad you think that's a \"hot\" picture.😂", "neha7894": "the moment i saw your stories,it felt so uncomfortable after tht..you actually made fun of the sentiments n also now dont defend your words,bze you literally compared the death of soldiers to the people dying out due to poverty n unemployment..All your point was that nothing new happened..i saw ur story n this tym aajtak has done tremendously great job by exposing you bze in the name of comedy u cant be so ignorant of people's emotions.you deserve much more than this..", "madityaprakash": "यह जगह ही ऐसी है जहाँ आने के लिए अपना सब कुछ बेंच कर आती हैं अपना कुछ रह ही नहीं जाता न शरीर न आत्मा", "sharma__prakhar": "You are stupid malika. @mallikadua", "dishantkumawatd": "Ohh now I got it... That was a publicity stunt ( story) 😕😕", "rizwanameer": "Absolutely correct choice of words, 2- 4 aur gaali deni thi. This godi media is on all time low. Set up a whole market of fake news. Desh jaaye bhaad mein, inki dukaan chalni chahiye. 😠", "manjusharma2196": "👺👹👺👹👺👹👺👹👺", "joy___007": "🤣🤣🤣", "sherryy90": "Its not about pakistan or india. People dont understand its about humanity...indian soldiers have lost their lives for the country and yes people die for so many other reasons on daily basis. Posting tik toks and showing your concern on media doesnt show nationalism. We as humans should step forward against terrorism not each others countries. Was has never been a solution and it will never be. What you said is absolutely right @mallikadua 👍🏻 Pray and Plan strategically to fight against terrorism. I am a pakistani and I am against terrorism not India ! Peace 🙏🏻", "the.drolling_elixir.sameer": "Unke bhi baal bachhe hain......ab kucch toh breaking chahiye unhe....to get their meal.....dont worry.....they were cheap...they are nd they will be....that's how their big industry works", "chandnirajpoot": "@aajtak se or umeed bhi kya kr sakte h... sensible journalism se kosho dur ho chuke h .. pta nhi or kitna girenge.", "vrinda.malhotra": "Dnt fucking care about them.. Just nonsense is nothing in front of you", "sanabaid": "@dhruviishah @nirmaydesai", "happilyspotted": "@mallikadua this is just a way to divert from showing actual news. These media channels are running gutless. They cannot show the reality so they are just touching people's weak emotional sites. That also with word play. I saw your video just yesterday. @aajtak surely knows how to play with words.", "mansid.dave": "How can u compare Our martyred soldier to other people... U deserve thousands slaps behalf of our soldiers families.. Actually why are you reacting?? You had said it in your stories!! N many were offended by that.. Such a Dumb lady.. 🖕🖕🖕.. Appreciate @aajtak", "being_thakur19": "Madarchod", "fluffy.cheesy.pancake": "Can you please sue these guys for defamation? HOW DARE THEY, exactly. Please don't tell me all of them have stopped leading normal lives. Please don't tell me that Aaj Tak has stop posting malicious content.", "doodle4142": "Karma works. You trolled @manjullll , now aajtak took revenge. 😂😂😂", "zubair5464ahmad": "Dalal media hai @aajtak", "snehamatey": "What the fuck? Can we report them? 😐", "akshitar": "Please contact to sue them for defamation", "affrrriiii": "I swear @aajtak is one of the cheapest and hypocritic news channel posting nonsense stuffs. And not just on this topic but every other thing happening in India or elsewhere is turned into a political statement. YE BIK GAYI HAI GORMINT 🙅🏻‍♀️", "ayushreerajbhandari": "Indian media is kinda insensitive and has no empathy towards some sensitive issues.🙄🙄 There was a #gohomeindianmedia campaign right after 2015 massive earthquake in my country, Nepal.", "saikat.misra": "Drag them to the court of law. They must be taught a lesson.", "stochastic__syed": "Wasseypur me ek dialog hai , usko correct Karo, Jab tak desh me aisa media hai public chutiya banti rahegi!", "nusratjabeen1314": "🔥🔥👏👏👏", "barrymatharoo": "At least it’s a good photo that they used.", "yaayhoodgirl": "you deserve this.first you silenced everyone when your own father was at fault and now how dare you call the media stupid when you can’t even do your job properly as an influencer? lose some kilos maybe you might gain some sense then.", "_aakashah_": "Muje pata tha ye hone wala hai..!", "thatnajiguy": "Reading some of these comments (actually MOST of them), I’m just SO GLAD I renounced my Indian citizenship and migrated to a more civilized, first world country. Ya’ll can be petty and fight amongst yourselves over the stupidest reasons with the most vile and virulent passion. Ugh, no wonder the world thinks the Subcontinent is a shit-hole.", "kirtika93": "Shame on you @aajtak", "anurag_jain_1991": "@aajtak bas yahi reh gaya tha aapse akhir kaar... TRP ke liye nange bhi naach loge? Game up guys.. This is not news this is nuances", "me_myself_and_i_86": "Madam video b net par shame of u", "kritikakapur": "Please see the video once more. She's now blatantly lying and mincing words. And ever since she uploaded the video and started receiving major backlash, she's been desperately trying to cover up the blunder she made(by trivializing and comparing the deaths of CRPF martyrs with people who from depression or hunger everyday). As damage control, she followed up this awful rant with sensible posts of army wives' that she knew everyone will agree with. And tried to portray that she was only trying to call out fake nationalism and war mongerers. But that was far from the truth, as can be seen on her IGTV rant.  When questioned by followers on the original post, on how she could trivialise the death of our soldiers by comparing them to everyday deaths, she completely went on a tangent, evaded the questions completely, and went on to make random statements about their death being a failiure of intelligence etc. As the daughter and granddaughter of Air Force Pilots, of course I also believe that war mongering is wrong, targeting Muslims or Kashmiris is pathetic, or simply pretending to be a patriot and caring about the martyrs whilst being terrible citizens in your day to day is wrong, but the other points she made like triviliazing the deaths of the braves who were blown to shreds, is something that is beyond awful.  It is because of what she terms as 'keyboard nationalism' that bharat ke veer has been able to raise over 46 crores for this cause. Just like social media outrage helped the #metoo movement gain international momentum, it has also helped the cause of our brave martyred soldiers. So yes, nationalism of any kind, anywhere, sans hate speech towards any sections, is GOOD. She needs to stop propagating the idea that displaying patriotism altogether is 'uncool' and is only for 'uneducated' people.  Nationalists or Patriots can be educated, pro-Muslim, anti-war, anti-hindutva, sensible people too.  Also, according to what she stated in the first minute of her video, no one should ever mourn, since people die everyday na. So candle light vigils for Asifa or Nirbhaya were also absolutely useless then?", "chinnadua": "Shameful indeed . How can you misquote when there is a video as proof of what you said. Disgusting . They call themselves number one and spread fake news!!!!", "anjugupta371": "Wat rubbish @mallikadua ....offcourse you spoke all dis shit....I myself have read dis...uv deleted ur post now...if u had d audacity to post such shit,have the couragr of owning up ur mistake....by abusing n using cuss words ur lie will nt become the truth", "mansi.thakurr": "She actually raised that point saying ppl die everyday by poverty,hunger..etc.but thats the way of life the have opted it but this scenario is different,soldiers sacrificed their life's for the sake of country,in which u do belong u must have minimum commonsense.", "thescientologist": "It’s laudable how you have tried to make your existence so important by quoting that @aajtak is trying to defame you! Well, aajtak took your video as an example like many other channels did in case of countless other people who did the kind of publicity stunt like YOU wherein trying to sound different than the voice of our nation! You complain that everyday people die of bhukhmari why don’t we mourn them, cause death is a death? Why is a soldier’s death any different ? Well wannabe artists like you need to understand that those soldiers CHOSE to serve the nation, they CHOSE TO PROTECT PEOPLE LIKE YOU AND ME! They were learned enough to choose a different profession! I have seen the entire video you posted and like you quote in your video everyone’s reaction after watching your video is “what is this nonsense”. Also, you don’t deserve this propaganda cause firstly YOU ARE LEAST IMPORTANT to media! You were just a random video picked out of the lot!", "ramsha955": "tobaaa hai india media se pagala gaye hain saaley mental health seekers 😂😂", "_harley_quiii": "This is the india's one of the best news channel which is seen in almost every indian households.. And this what there news is.. Wow!! 👏👏👏 U should be given grand salute.. @aajtak .. Great job..", "rashidkorai": "These times hopefully will pass. I don’t know in which country journalists have gone so low.", "shreyanandi25": "Yes you didn't said that maybe but whatever you said was totally in a DISRESPECTFUL MANNER. Learn to respect people okay?", "puravida_tanuj": "@mallikadua log roz marte hai thats true.. But our soldiers were killed they just did not die of natural causes. And why were they killed? I am sure i need nit have to explain you this.", "nzeewhsjjdeej": "U r mad like my nani ......", "oshimaraza007": "👏", "harneet_nitu_oberoi": "@mallikadua We are here to support you. We all know how this news industry works. You gotta be irrational by the brain to believe this assholes. #supportmalliladua", "wanderlust_vakil": "@aajtak targeting her bcz of her father... Have some shame... #godimedia", "imansi_j": "Jingostan zindabad 🤐 bloody shameless channel @aajtak", "shivajisinha": "U r a piece of shit", "shilpasuravajhala": "Ignore them they are not worth it! Keep up the good work.", "msriku": "abey mc tu v maar ja..bkl nikal iss desh se kamini.shali", "asees.kaur.3": "Utter Nonsense by Aajtak !", "thedevelopersadventures": "Wow the comments here ...", "lgbt_supporter6": "This is why I hate mainstream media so much. Malika has said nothing insensitive yet the media seems to jump at the idea of bringing her down. She is right in what she says and if you can’t stand the fact that other people also have opinions then that’s your problem. Stop being such mean people and just let her have an opinion. And instead of judging her, if you just listen you will actually find logic in what she’s saying.", "mohd.razi.3745496": "Fake news kyu dete ho aajtak shame on you", "shivasharma0ct": "Vo to 10 muh 10 baat ... Ab faltu bologe to Aisa hi hoga na... Abhi apna bhai mara hota Sena mein hota to bhi tum kehti Rona kyu hai jab roj Bhikari marte hain.... AAP jaise celebs Ko log follow karte hain ... Par kehte hain na ki popular bhot log ho jaate hain ... Responsibility sabko nahi aati", "shete4177": "Nikita Kaul, widow of Major Dhoundiyal chants JAI HIND through her tears and salutes her husband's body. Will the fiberals call this #hypernationalism?", "priyaj42": "Aaj tak 👌👌👌👌", "shoppingpost": "@mallikadua 🏋️‍♀️🏋️‍♀️", "ishakaranchadha": "Madam, media is sold. There is so much of Fake news and morphed images etc going around.", "aupnuirqvuae": "Yes, you look super hot😍. Your stories make me laugh. Thanks for that😘, other things doesn't matter to us(your ☢️)😂", "poojapariath": "They are freaks!", "letwordsdothetalking": "They need to get a life and @mallikadua you are grace girl.....Some people just can get some simple statements into head by understanding the real intent behind them.....Jingoism is in trend....But more power to you girl🖤🖤...U stand by your word and that calls for a root for you ❤️", "hiranya___singh": "Lagta hai papa ke videos jyada dekh liye", "shhivajiraodesae": "i support u mallika..", "saachiigram": "This is such a misinterpreted way of bringing your opinion on this to light 🤦‍♀ I think people who are considering you anti-national should understand the difference between silent mourning and making tiktok videos about patriotism!! You just gave your opinion about it in a more open way and instead of making dubbed videos for soldiers who are actually giving their lives for us.. We should understand their sacrifice and live our life in a more outlook way 🙏 and people please stop trolling @mallikadua on this..", "hot.shoppp": "Bolaaa bhi tooo yhiii thaa tuneee", "aviator_rohitmali": "This is nonsense ! @aajtak is crazy! @mallikadua keep doing what you do and we'll support you through. Much much love and respect to you girl! ☺🙌", "ajeetsharma01": "Baap beti ek jaise hi hai.", "kapilchauhan5kc": "@mallikadua dat last line was brutal🔥🔥🔥🔥🤣🤣🤣🤣 epic shit", "ps_world__": "Mar ja kamini tu Zinda q h ab tk", "nashreenf_": "NONSENSE!!!!!!! 😤", "nectarous_._serenity": "Hi.. Mallika didi. You are beautiful. You are just beautiful. You say your heart out, What others can't say. Thank you for bringing us the truth. If somebody is really empathetic towards the incident with soldiers,that person will actually do something for them or act for the betterment of India. Atleast people shouldn't not make India a joke infront of other countries by making those stupid tiktok videos. What's wrong if someone is actually showing us the truth?? This is a time everyone should be aware, enemies want us to fight and we are actually fighting. We are blaming each other every day. We are harming our people. Please all, open your eyes. Look how the world is mocking us.", "lambamegha18": "Well served😂😂😂😂 u have yr rights so do others ....think before next time u attack anyone", "shaizansari": "Fuck bC", "vrindabhutani_22": "Dafuk is this man ..media ko sirf ant shant baatein uchalni aati hai bhenchod", "sick.__.brat": "Tere gand my Rahul ghusy ga 😀😀😀", "rajput.nikhil.parihar": "Listen @mallikadua 🖕 the people who die coz of hunger dont die for you but those 42 soldiers died for your safety🇮🇳💪 i hope you wil get it🇮🇳", "bitterfactor": "Chill Mallika chill ..inke jaise kutte bhowkengey hi... I feel you", "prerna_8": "\"Fauji mar Gaye to shok manana nonsense baat h\". I agree she didn't say this. She said some other stupid stuffs. @preeti.bajaj", "veapon": "@mallikadua need of the hour is a “media regulator” with public nominees and strict monetary fines for false news. Aapne aap band hojayegi fake news.", "gautamsameer457": "Asifa ke time bhi yahi bolna tha logo ko ki log to roj marte hai bhukhmari se kyu asifa ke rape pe pura desh dhyan de raha hai,rapes to roj hi hote hai", "pictionarybyhemendra": "I read whole caption of your picture but the last line. God bless you. @mallikadua", "shaf_aqua": "Such a pathetic attempt from Aajtak news.. This is a new low, do not back down @mallikadua teach them a lesson, they just can't get away with anything.", "krishnan_9": "Take this lady to a mental hospital", "jyoti6346": "Just unfollow her I saw her video Mam just want to inform u because of army we r safe in our house I think u will not understand this coz u didn’t lose anyone close", "whomanojthakur": "माता जी हिंदी का इस्तमाल कर लो ताकि ज्यादा लोग आपको समझ पाये, और आपको और अच्छे से जवाब दे सके।", "virtual_law": "Utter nonsense!!! Scary how ugly Indian media can get! Even scarier that there is no recourse! Please be careful Mallika!", "abheet.ahuja": "Slap them with a legal notice!", "samratkantighosh88": "Stop lying u did say suchbstipid fucked up things....tab kya dimag ghas charne gayi thi apki", "thapoanar": "disgustingggg news channel @aajtak ! cheeee", "preeti.bajaj": "@prerna_8", "shypiie": "Some people dont understand what sarcasm is.. u do u gurl🙌", "_the._prashant": "You are shameless lady.", "ishashastri05": "To the common man, if you are reading a newspaper or looking at news channel and they be your only source of information , look further because media is setting narratives and discourses........and you have to set the counter narrative. Even truths and realities are \" constructed \".", "pritanjan_": "Sue @aajtak #sueaajtak", "heenakondkar": "It's really very low for aajtak. I mean they just want publicity n trp bas .debate hi karate rehte hai jaha bas jhagadte rehte hai log news toh kuch hai hi nahi", "kapil.swaroop": "They are spreading FAKE for last 5 Years. Pinheaded morons asslickers", "kanujuneja": "@aajtak sucks!!", "binge_bawse_": "@aajtak TRP se pet nahi bhara na aapka? Bloody Bullshit", "ridamaqbool_": "@i.am_sasa what does it say in Hindi", "nishta_6": "Is channel ne gand to kaafi failayi hai par at least, photo sundar laga di! It must be immensely affecting your mental health today, so more power to you, woman! ♥️", "ahirboxer": "Now you both are taking hype seriously guys is desh ka tum logo ka kuch nhi ho skta you reposted this @mallikadua", "kanikamishra3": "Did u even say that?? I saw all ur stories @mallikadua i don’t remember u saying that. Wtf🤷🏻‍♀️", "nomorewanderft.covid19": "Indian is filled with such illiterate asslickers. Girl, I watched the entire video and I loved each and every thought you shared. @aajtak needs to clean their ears and wash their illiterate brain to understand what you were trying to share. If anyone is shaming you for the piece of content that actually is inspiring, then please squish them with your lit mind. I love the way you have put together everything that needs to be considered. And these hideous people seeking revenge should die of shame.", "dhanolaabhishek": "Stupid lady", "shesh.nj": "You should not let them go just by insta post, file a suit", "rudra_92": "I think for the first time, we have a clear cut proof of how Indian media works. Funny how a comedian did what many politicians, bureaucrats, judiciary, Police, fucking Army couldn’t prove!!!", "sanyakawal": "Okay, people still dont see the valid point that you are making. #StayStrong #MorePowerToYou.", "tanv33r_s1ngh": "I liked the way you replied to these scums ..they deserve it", "anushkachaudhary1111": "I had seen the video tumhe ye pulwama issue Chota kaise lag Sakta hai", "badgebiker": "Useless morons! Trying to create false content!", "sahnipragun": "#FakeBollywood #FakeArtist", "aditi_98": "Aaj tak has exaggerated...no doubt.. however.. @mallikadua .. at such a juncture ..it's better to not be out there being all ' I'll do what I wanna do ' ... Mourn in your own way..but refrain from posting anything which can affect the feeling of others towards such a sensitive issue... We all love your videos... But please keep this in mind.", "gaurav_2526": "You are such a fool", "sadquaquddus": "Seriously some useless faceless people speaking shit about someone nd they call it as a news shame on Indian media. They just want #trp to get the channel on demand. Bullshit #shameindianmedia. Last night around 2 I was reading the comments nd was literally laughing on the faceless people's reaction nd didn't know that it will be a breaking news for this #aajtak. I support u Mallika🤓", "_nadeemrab": "yeah totally agree most of the paid media is communal, where were they when 50-60 armed personnel killed by naxalite in some jungle. Meanwhile they should ask first the failure of government to prevent such attacks before turning Nation into Avenger hatred monster. Because the government is very cunning they have successfully used this opportunity to transfer anti incumbancy, anger of voters for not fulfilling promises, bad decisions, Rafael scam. Successfully instigating the population to divert attention from real issues and failures. Now they got a thing to churn till elections. @mallikadua", "mansoor99928": "@aajtak piece of shit surviving by selling fake news everyday. They are no better than a drunkard talking shit before getting wasted.", "vaishu_719": "You deserve this..... 😡😡", "siiddique": "Ye government bick chuki h ma'am .", "shwetaandrews": "❤️", "tikkushukla": "What does this even mean?!! Madness they are", "annoyingly_happie": "When the whole world spruces venom only Mallika spreading laughter joy n bonhomie oh puhhlisssss give us some break we don’t watch any news channel we don’t miss any Mallika dua posts you guys are plain jealous get a life! 🤦🏻‍♀️", "nileshnavaghane": "Teri maa ki chut tu bhi mar jana pakistan ke terriost ke sath teri layki nahi ki tu india ke logo ke sath mare", "meghanikaushal": "Unfollowed @mallikadua immediately after reading this 😡", "elisha_eli_": "Are they crazy? Don't they understand English? Bas news chaiye toh they'll misinterpret", "princeesabharwal": "You are absolutely right .. stand with you @mallikadua ... you are absolutely stunning 💃", "storyofmoments": "@mallikadua you should file a defamation case against the channel", "debnath.paramita": "Inko to bas news se matlab hain. Shame on you @aajtak", "lakshmi.srikhandpur": "SYSTEMATIC FAILURE being the key word.", "mehakk_nomadicwordsmith": "Why are you so shocked @mallikadua ? Didn’t you expect this? It is the trend especially in few news channels. First they mourn over such circumstances. Then they make a mockery of the martyrdom by inviting useless politicians for debates. Like that’s not enough they even play a background sound track on the dead bodies of soldiers. They feed their TRPs with the victim’s tears. And then they want to seek revenge by launching a full fledged war. Like it’s for them to decide? And when the above becomes repetitive, they sniff for some celebrity who according to them has “hurt” sentiments of the soldiers. This time it was mallika dua. We all condemn what has happened and so does she. This bombing needs to be dealt with proactive ness and smartness. And yes the forces will bloody well do it with more fierceness than ever. @aajtak needs to first make its news less of a melodrama. They need to refer to DD national to showcase the news properly. And lastly stop twisting and spicing up statements of few celebrities. @mallikadua is no less than an Indian as you are. But just stop cornering people for smiling or going on with their daily chores and lives.", "aishi_011": "The video was right there on Instagram...you yourself deleted the proof.", "aradhanamahtani": "wtf this is such bullshit @aajtak how dare you", "vanshikabassi96": "@aajtak stop defaming Artists who are actually trying to make a change in the society.", "prajwalchauhan_": "Agar tera ghar sa baap Bhai saheed hua huta to kya fir bhi yahi bolti you bit** tera ghar sa koi defense ma nahi h isliya tera ko bahut bakwaas aa rahi h..", "iihersheyii": "More power and love to you for this. Your fans know you can't say anything close to this as well", "poorvasjassi": "God! How people take things out of context. This is bullshit. I am sorry you have to face this, Mallika.", "anwesha_pc": "This is scary... ! Don’t let them go", "abhinav_.official": "@ashutosh_thakur017", "brainbzr": "Can you not sue them?", "vatsala.sharma": "Media in this country has got nothing left to do.", "hardly_dutta": "Bhen ki lodi...tu sirf ek din boder pr khadi ho ke dhek...teri sari akad teri gand se nikal jayegi.bc", "beauty_slayzz": "sue them @mallikadua", "dr.sanhita_sharma007": "Nobody is going to blv on these #paidmedia #aajtak ... can't blv that they can shred their reputation on this level. Koi news nhi mili to chalo fake hi bana lo... 😂😂😂😂😂😂😂😂😂 #mallikadua", "devashish.pandey_": "@mallikadua @aajtak is correct. I think you've great mind and opinion.But you're comedian just be that. Don't try to put up your fucking opinion here", "debs_debbiee": "Off course yeh toh Hona hi thaa @mallikadua .. Aur commoners ko troll karo and make fun of sensitive issues", "dhruv_umesh": "Shouldn't there be a strict law against fake news??", "nisheshgupta": "Same thing happened with N.Sidhu. His rational and practical statements were blown out of proportion and the brainless internet users went after him left right and centre. These propaganda filled media channels will go to any extent to demean and destroy the image of anyone except those whose image should actually be destroyed by calling them on their shit like the ruling party.", "meet_joshi_0017": "The fuck is problem with these guys yar....Kitna overreact karenge...😭", "__.nistha.__": "People like ugh are so damn dumb", "or_kyaut_": "You can rant and cry over losing your followers but it hurts to even shed a tear for our beloved jawans who are sacrificing thier lives for the well being of US - THE COMMON INDIAN PEOPLE so that we can live in peace but no people like you need to be the secular bond of this effing society. *claps*", "prashantpathak1": "I dnt kno. K aap mera msg padhogi ya nahi. Bhookh se marne m, depression m marne m or is desh ki(aapki) raksha krte hue mrne m fark hota h. If people are saying k aap kyu has rahi ho. Thn they mean it. Hm Army ko apni family ka hissa mante hn. Bht important hissa. Or jb family m kisi ki death hoti h to hasi nikal sakti h kya??? I kno aapka prospective change nahi hoga. Bhagwan na kre jb aapke family m koi death ho. Tb b mai same video ka wait kruga. HOPE AAPKA PROSPECTIVE CHANGE NAHI HOGA.", "vvranda": "We trust you completely @mallikadua .. all these @aajtak people need it just mirch masala.. they don't have content.. this is the beiigest nonsense news I could have expected from them.", "baklaaavaaa": "Shame on you @aajtak, manipulating people’s words around sensitive issues to get viewership is real credible journalism.", "words_love_serenity": "Heights of misinterpretation @aajtak 🙄", "anand_gannesh": "ohhh jst shutup. how dare u compare our soldiers who have give their life for the country to those who die of poverty or other reasons. Shame on u . U lost many of ur fans.", "anubhavjain7": "Totally agree 😋", "ms_m_ray": "@aajtak Please do some actual journalism instead of this nonsense.", "iutkarshsingh": "Haha teer chlaya logo pey waps aa k ghus gya 🤣😂", "mohitsaxenaa": "It is truee", "rangeenchai": "I DON'T BELIVE THIS!! Like honestly!! I shared your igtv video today and what you said is on point! Like... Of all the bullshit we're witnessing on social media... This is the only thing i saw was accurate. @aajtak Have a bit of shame you shameless pieces of scum! She didn't say anything what you made out of that video!! How low can you get?!!", "yuvaphalle": "Poors > Jawans , good logic", "kanishk.ca": "This is absolutely ridiculous! A new form of harassment. How low can so called “media” go?!", "sandhya_rakshit": "They just lost their mind ... 😒😏", "swarnshri": "Very well done aajtak. This was need to be done. @aajtak . In her insta story she said these things. She said that there's no need to shame each other on doing their daily routine and that was absolutely correct but she compared the death of a soilder with that of a normal citizen and that's wrong and the way she said was also wrong. So if aajtak wrote this article it's absolutely correct. She is a public figure, she should not conduct these negative things in public.", "prachii_dua": "How shameful. How can u spread such romours", "csaumya": "Why did u delete your pathetic video then.....?? I saw ur video although before u deleted it.....it was so pathetic that I felt like vomiting.....!! Good u deleted it....!! Also I did not see any #feminist #meetoo article when ur father was accused of harassment by a woman.....!! Why such double standards madam.....?? Unfollowing U.....!!!!!", "ranveer.brar\nVerified": "Verified", "vishal.singhr600": "Hope u got a good slap on ur ass. Right? If not post another comment and we'll show u how it's really done.", "bagdwal.h": "If insensitivity had a face you would still be too ugly to be the \"one\".... See your video and if you don't feel disgusted you are Mallika dua... Congrats on getting this shitty fame due to such a video 👏👏👏", "tanxshq": "@aajtak 👌👌Bohot sahi likha a", "pathan__faizan": "Well said 👏🏻 @mallikadua . @aajtak are you guys high on weed yaa ki se saste Nashe krte ho yaar kuch b", "alishabeylim": "This is today's condition of our country.99% are high on anger,disgust towards an entire nation without any proof,if you don't agree for everything they say, you're NOTHING but a \"Pakistani.people are hating their own country people (Kashmiris), banning artists, targeting their own country people for putting their opinions(boycotting Kapil Sharma show n all).where is freedom of speech now? And the media is putting fuel into it nicely.In btw if someone talks sense,this is how they are gonna bash n shame them by fabricating, misquoting their words.Shame on you for gaining TRP from SACRIFICES of OUR SOLDIERS.What India needs right now is calm among our own country people n taking actions against those terrorist groups. You gotta go to the roots of terrorism,solve this Kashmir dispute,know why an educated youth is getting brainwashed.Nobody just decides n take guns in their hands literally nobody, please stop shitting by targeting a particular religion. Kashmir is suffering that includes Kashmiris n our soldiers both.If you harrass innocent Kashmiri studying in your state you're no less than a brainwashed terrorist.India needs unity with love n hopes to fight against terrorism.Grow up people!!! And DO NOT REPLY shit to my comment if you don't have BRAIN to understand this piece,just scroll up like I do seeing yours. #RestInPeaceBravehearts🙏", "a_chib_in_delhi": "This is a new low, though not surprising! More power to you Mallika! Down with such shitty news channels!", "anjali.sharma.184": "U said nothing wrong but compared two diff things maybe..obvio ur not less patriot than the ones posting abt the incident.but the way of saying and comparing two diff situations..like why? And ppl follow u.ur an influencer..if u think the paid endorsements u do would make ppl buy that shit y dnt u think if u speak up on social issues can make a diff..and if not for the soldiers dying when did u speak abt the ppl dying from poverty and depression influentially", "shalinivagge": "Really unpad @aajtak", "rashisanghal": "It has always been the media who has made a simple sentence into a huge issue", "the_mod.st": "When you know your country is full of chutiyas, you make news that a lot of chutiyas would love to read. Great, make money bitch.. @aajtak", "saniyaxx_": "@mallikadua they are mad ignore them hahah I love you", "priyanshdixit": "That is what she want , but is news ko daba do !! Agar problem nai hoti mallika ko to wo bolti ku ? Publicity stunt", "ananya_lakshmish": "I expected this from the bullshit media after u said something honestly. Media spread bullshit and not news🙄", "aesi_vesi_aurat": "Fake news ....", "beingimranb": "@mallikadua same way as they spread fake news of blaming pakistan ....for their TRPs they just post anythng they get as long as they get attention from public and spreading hatred is their only moto...", "warpandweft28": "Mallika - you are way too good for these useless, insignificant assholes. Focus on being the inspiration you are! @aajtak Shame On You!!", "dishipurbia": "@aajtak lost their senses or what.? I don't trust their news anymore! 🙏 What nonsense!! How come you put anything..your own build stories on tv? Those don't know her or those who are not on social media will pull out rubbish out of this.. n in fact will start reducing it to religious differences or some crap!!!! Just don't believe @aajtak news anymore! Why are you spreading fake hatred with a fake news as that? Just for running your news channel. Disgusting! ...we know what you said @mallikadua we are with you", "tarabahmed": "@aajtak what an asshole , just want to post news even if it is fake jerks", "im_sujatamishra.3382": "😏😏😫😫😫😤😤😵😵", "_akashaant_": "Sahi हुआ......... You deserve it", "viva_city": "@aajtak should better team up with Ekta Kapoor. It’s time!", "_abiii_11": "Omg I Hate This Channel these people are so fucking Dumb ..I'm so pissed off rn ..How can they just state something so ridiculous ...fucking jerks", "mudrikamittal": "We all support you @mallikadua", "akankshyat": "Super hot picture yeah 😍😍", "naaziyeahh": "This is exactly what’s behti ganga mei haath dhona sounds like, cheap news channels like aj tak and do paise ke tiktokers thrive on such cheap thrills🙄 We need more ppl who think like you🥂", "_ceo_of_my_life_": "♥️ true @mallikadua", "riipunjay": "Thank you @aajtak 🙏", "zain_andrabi": "This fabrication of news needs to stop.. Ive put this up on my story condemning the article.", "kushagrashrmaa": "WTF.... I saw all the posts of @mallikadua and she didn't say this... this is totally opposite of what she said...", "sheissupernovaa_": "The video is there on Facebook. You can see it", "tvtf__": "What does it say?", "poulamisaharoy": "Aajtak presstitute", "thats_me_khadi": "Caption Kya baat h 😁", "riyapillai24": "look at the level of stupidity, these moron thnk tht people is projecting it in a wrong way. the truth is all r projecting d way u hAve projected it. dont do image make over. damage has already been done. u have freedom of speech but no freedom of speech to defame the veer jawans. understood moron.", "ijya_samajna": "@shalinijammin", "yadu.vanshi.146": "Ta randi tu q nhi marti", "safoorafaisal1": "@harshadtekwani", "priyank_tiwary": "@mallikadua Directly file a case against it , they are fake news creators and just deteoriating your name", "kanchaaa0101": "Sahi likha hai bakwassss kari tumne behen", "sheetalverma519": "What a bullshit! 😑", "barish_basu": "My God seriously!! You should take action against them. Idiot brainless Chanel. Their reporters are too lazy to go out and search for original news that's why they making something nonsense by sitting with mobile and checking out in Instagram", "kmvishalaryan": "I guess ‘The Wire’ has some good journalism and the world knows the truth  #babujimyass", "su_bakshi": "Babe, they don't deserve your attention. Relax. 🙂", "jatin_sapru\nVerified": "Verified", "saddam.shin_chan": "Boycott @aajtak #shame", "i.aritra": "We are living in a dark age!! Nothing can be done! They are the voice of the ‘majority’ at least they will claim for being one!!", "prragya._": "You had said it... Ok!", "daksh_jha11": "Aaj tak should be banned 💩💩💩💩💩💩💩💩💩💩", "_joy02__": "Last line tho 😂👌", "shwetamishr26": "@mallikadua don’t give fuck to anybody just chill I know it’s tuff but this is a just shitt", "trashy_dose": "Lmao! Ache din", "uditamehta19": "@iamchig now you know why I've lost faith in journalism", "sushantdivgikr\nVerified": "Verified", "sayooni_": "What the fuck is wrong with Indian news channels.", "anahita.rangreji": "What the hell? We all have seen those stories. False allegations on Mallika!", "rudriiiiii": "🙏🙌🏻🙌🏻🙌🏻", "rohtsverma": "@aajtak Sabse Fake", "naurinarshi": "Thy really need to do something expected these fake rumours @aajtak two things thy can do one is debate with our worst politicians or else bullying someone like this... @aajtak ur journalists really need to grow up", "an_automaton": "Moti pagal hogyi h 🤣🤣", "abhilasha2586": "Its good that you posted this, indian news channels have gone nuts. Inorder to increase their trp they are ready to do anything. There should be some legal action, taj attach was an epic example of mindless media", "aikum.bhatti": "Sue them, this is slander", "lubuzine": "Kudos to you @mallikadua for calling out scumbag news channel @aajtak , also gives me a lesson to not always believe what is shown on TV", "aakritigupta06": "News channel wale bhi mauka dhundte h ek dusre see behtar news kaa...fake hi q na ho...unme khud apnapan nahi hain.....to vo h Kya smjhnge soldiers ka pain....ek dusre k channel ke reporters ki fake news b unka channel no 1 bana degi....unko khud sikhne ki jrurt h terrorist ki baat krte h....koi b word ko jhutha bana dete h change kr dete h sunte nahi ksiki Puri baat...ye b khud Kya krte h...Jo pain m ho uske pass specially mic lekr jayenge.... Aapkoo kesa lag rha h puchnge ..ek ne to hadd krdi....in hi me se ek soldier ke ghr jakr jiski sister already kch ni smjh skti..usse jakr puchte h aapka Bhai tha na....aapka Bhai aapko Kya kehkr bulata tha...😠😠😠😡😡 uske liye ye imp Hain...😠😠😠", "ikjyot_94": "@corleonedynasty", "directionr_bae": "Finally exposed!! Am such in relief right now! Thank you @aajtak you guys are doing amazing just keep going and keep exposing these narcissistic traitors! @mallikadua you deserve this", "goofy_monk": "We are with you @mallikadua", "yashabh_satija": "I heard your father is a molester? @mallikadua . Free advice -> keep small girls in your family away from him.", "mohitmishra5": "https://youtu.be/tbvLQDKuypA . link to what she said.you yourself can judge.no need of this explanation", "__jhalli_": "Channel to hai hi bikau ar bhadkau... Dusra she is Muslim so they just want to show ppl that wt she said was totally against the respect giving..... Frzi channel frzi allegation frzi news", "sumonabose09": "Hey @aajtak ..take this garbage down and run an apology piece, will you?", "kawaljeet__kj": "That bloody ajtak shows sas bahu aur beti, what r u ajj tak,,, gadhe sale", "__an.unfading.smile__": "ab aaise caption daal ke kya hoga didi ap itni bkwas kiya kro", "muskan_gaud": "Wtf!sue them!", "hemantkumhar007": "Is post me kya galat h...Jab akshay kumar ka ye kahna ki 'chalo tumhari bjate h' galat ho sakta h to tumne jo bola wo sahi kaise....Soch ka fark h kal tumne galat socha aaj hamne", "anjaliee05": "hahaha reaction of Facebook! Instagram should add that! mtlb kuch bhi😂😂 koi news mili ni to chalo ye hi krlete..", "vegscavenger": "@judgemental_hypocrite bhai yeh dekh xd", "dxuvet31": "Ur a bitch malika dua...anti national.....fuck you @mallikadua", "kn.shireen": "@mallikadua they exaggerate each and every thing... they manipulate speeches and make ppl believe like they are showing mirror....", "engineergirl18": "🤦🤦🤦MATLAB yeh woh waqt agaya hai ke muh bhi khologe toh taxes lagega", "abhinav8360": "Chodna dogi", "anshul_mukherjee": "Mallika ji can u please put a case on aajtak for defamation or something???? Teach them a lesson na so that this does not happen... These news channels have no shame and this is why other countries laugh at us. This is what news channels are left with... @aajtak have some shame for spreading news like this", "divyakhanna97": "This is not the only channel/publication didi, I am seeing so many different links on my Facebook profile since yesterday.", "ashanand77": "I dnt believe this , @mallikadua has good sense of humor , she would never say something like that . News wale kuch bhi bolte hai they just want a headlines 🙄😏", "abinashkanda": "Wht ever u said in ur stories...is it the correct way we all know that this all are baised jornalism..i", "vishuddha17": "C.191", "ram_rk_01": "Lol not only you but there are manh celebs who get trolls for being quite on such issues but they never react like this dumbhead, see raftaar how he response as a responsible person to such trolls, this finally you are not like celeb or a success lady or icon you are just fake drama star .. oops irony you all did fake feminism on AIB today closed 🤣🤣🤣🤣.. also \"who are you\"??😂😂😂😂", "saavygupta": "😔😔", "ambyaratan": "Kya galat kaha hai aaj tak ne...... Sahi to hai", "_vivek23_": "Ohh god🤯 Like seriously how the heck can they write such fake things without having any proofs!! #ShameOnAajTak @mallikadua", "satwikbasu": "You did say all that At least have the decency to admit it", "kirtib1708": "If news is fake, then why you bothered asshole ..... you bastard i have that video where you spoken that whole statement.", "lakshmikanchaan": "D i s g u s t i n g!", "ega44173": "Sue them @mallikadua", "sobrietychecksin": "Flat out lies .. state of Indian journalism 🤦‍♂️", "namratgr": "@aajtak Shame on You !!! U have proved again u only in for Sensationalism and not Nationalism....Wake up True Journalism ....Wake up Atleast Now", "yellows__blues": "What the fuck! Zingusthan banake rakh dia Hain!", "design_matinee": "@sarah_shaikh11", "solankideb": "Complete misinterpretation!", "death_clutch__": "@mallikadua Madam well main to ek aam nagrik hu..bewafoof hu lekin ek insaan toh kuch reasons like poverty,unemployment etc. Ki wajah se khatam hota hai..nd ek sainik jo desh kae liye apni shahhadat deta hai..un dono ki death mae aapko koi fark mehsoos nhe hota??i mean aap itne intelligent ho bhyi but kya aapko sach mae kuch nazar nhe aata?", "neha_shety_": "Haha sidha sidha jhoot ko news bana diya hai 🤨 This shows how trust worthy our news media is, aaj @aajtak kal koi aur 🤯 the whole agenda of having news channels is screwed !!", "iam_puja23": "@mallikadua You go girl ..❤️", "im_da_kk": "Kal to unfellow kiya ta tuje moti aunty . Kaya vapas tune fellow Kar Diya kaya muje @mallikadua", "_ek_kudi_": "Yes fake news ..... Totally agree with you", "rahulbharawa": "I don't know it is true or fake news but You don't have right to insulting our PM modi ji. news Aaj take ne di modi ko Kyo blame kr rhe ho. Lgta h khud anpad ho", "utkarshinisaurabh": "Well this is the commercial media , always playing shit , @aajtak apologize to her", "misthi_shivi_": "What nonsense is this we heard that what she said I don't think she used this kind of lines @aajtak guys please stop spreading fake news stop spoiling someone's respect and carrier", "akshay.gundesha": "Aaj tak is wrong,public of india is wrong..So the only right person is you @mallikadua ?? Shut up your nonsense and keep calm..Our army knows what to do..They dont need your bullshit advice👎👎", "rony_stan14": "Ab iska kya bol sakte h, BJP sponsored news channel h. Biased news is the truth of this country's media", "mehwish_hanif1": "That's sad, you are entertainer ! You make people laugh.keep doing ur work!", "__adityarc__": "You say, that people don’t shame anyone when they see hunger and unemployment? They do!! Everyone is tired of those issues and want them solved. The governments till now have been continuously shamed for those things(you’ll know better). And we are still fighting those issues. But when it comes to the army, peoples’ emotions are different for valid reasons. They are those brave hearts who are ready to give up their lives for us. Of course the people of the country will react the way they are doing! But you have a problem with people asking you not to post about comic stuff and other things during this time when the situation in the country is so sensitive. In addition to ‘posting regular stuff’ on social media, you could have easily also posted a pic or a video saying how unfortunate the situation is. As simple and easy it sounds! I know it doesn’t mean anything tangible, but it surely goes a long way in the hearts of people. Instead, you choose to make a long ass video explaining why we should also react the same way when there is hunger and unemployment. That doesn’t even make sense girl ! Maybe you should show such great logical thinking when ‘The Wire’ posts anti national stuff. And who gave you the right to abuse whosoever you want to ?? Ohh I forgot, gaali dena toh aapka defence mechanism hai ! Pappa Ji ne yahi sikhaya kya? PS. That pic is not hot at all @mallikadua 😂", "shivzi": "This is bad .", "kaustavbs": "Mera Bharat badh Raha hai ..... Don't worry @mallikadua - we are with you", "__diksha__pathak__": "This is very very very low of @aajtak to do this. Clearly they can't even comprehend a 3 to 4 minute video, and the actual message that you conveyed. You slammed the fake performative nationalism that people are showing on social media. You clearly don't deserve this and @aajtak should issue a public apology to you. Period", "anukhabde": "@mallikadua You were comparin our soldiers with other lives , now dont cover your shit", "nomadicsoul.dll": "24k followers in 2 days. Well played. @mallikadua 😑😑", "holi_kab_hai": "@mallikadua scause me , Mallika Dua is a Darling and true patriotic lady of the country , निहायत ही चूत चैनल है भाई आज तक , ना तुम्हारे पास कोई ख़बर है ना तुम्हारी टीम में कोई दम , Kya chutiyapa upload kar rahe ho , Shame on you Aaj Tak @aajtak", "tjshirin": "Shame Shame @aajtak", "namira.syed": "@__sahilkelkar__ can you translate kya likha hai?", "nidhisingh1701": "They need attention.... so they always divert from the main issue and make new out of nothing!!!!", "hny.2k19": "Aaj tak is Right..Stop Playing Victim khallika", "arnav6149": "Bay🤭😊 the wayU looking stunning @mallikadua", "_khushi_sri_": "This is what you deserve🔥 take your sexy pictures and this news and make a frame didi🇮🇳🔥😂", "peace_rsh": "@nishi.thapa ye dekh what news channel did", "_khushbu_parikh_": "@aajtak log sensible baat kare toh nonsense? aur khud aise afwa phelane ko kya kahoge? \" KHABAR\" 🤣🤣🤣🤣", "vashishtgunjan87": "Many a men have been lost to #manualscavenging! I did not see any fury then! In fact people are hardly aware! It is just a prelude to create communal tension. Let us let our drivers, maids, rickshawallas everybody around us, know this. Lets be as vocal.", "indiaontravel": "Its the propaganda of the masterminds who inject spells of patriotism and nationalism in the common people so that their main objective is fulfilled, that is keeping the hate between countries going, and fund channels like Aaj Tak to follow their mission and vilify anyone who isn't in support of showing off love for the soldiers 'only' when they die. @mallikadua", "aartiaartu": "Nobody watches @aajtak except for brainless human! If only there was be a panel that could judge such mediums. They are no less than a threat, trespasses people life for no reason,spread hatred around and brainwash it's people. Also their language. 🙄 We stand with you. 💕💕", "abinash_knows": "The thing that you called aas shit, THE WIRE regularly posts way beyond this. Ask Mr Dua ji first and then lecture Aaj Tak.", "ooh.nia": "Oh god fkn media.", "vivek.kumar1": "😅", "sharma_vartika": "@aajtak you people really don't have time to post some serious news or should I say guts to bring up the truth infront of entire nation youth.. regarding the reality our nation is in. You people have so much time to stalk a blogger n manipulate things!! Like seriously. Please do something productive rather than this shameless research.@aajtak", "aditya_kapoor_7": "Always support you ma'am 🔥😊👍🏻", "kartikkumar6704": "कुछ तो सच होगा ही...अगर दिल से इज्जत करना है तो कीजिये हमारे जवानों को दिखावा मत कीजिये....जय हिंद", "sourabhkapil26": "Well said❤️", "abhineos": "I don't think they even saw your whole story. Yaar interns se bulletin likhwaogay to yahi Hoga . #growupaajtak", "krishnagajjar789": "Who is she 😜", "tahniyat.s": "We love you @mallikadua 💟", "pritam_thakur__": "Arre bhai bhejo isko koi jaldi .. wo #barkha wala nationalism 😂", "charmygandhi": "@mallikadua What else can we expect from @aajtak anyway", "gurmanisher": "What Mallika meant - soldiers are murdered very brutally and we are devastatingly upset about that. However , we can't stop living our normal lives. So, I really wanna ask how many of you have stopped laughing?. Have you guys stopped going out with your family and friends? Or have you guys been crying since this tragic incident? Well, I guess not. Just because she's a celebrity and has talked about it openly doesn't give anyone the right to disrespect her. Tum logon se khud toh Kuch hota nahi hai. Khud baat karrahe ho ki \"ye toh apne gharpe baithke araam se aise bol rahi hai\" toh tum log konsa Kuch kar rahe ho.", "5hambhavi": "Chutiye hain yeh Aajtak waale! Ek bhi dhang ki news toh dete nahi, tatti jaisi baatein bnaate hain woh alag!", "avinash_guglu": "They died for country that's it ...How can you justify Jawaan life to other. People who died in hunger that's different and this one is different. It's massive terrorist attack on us. U should first learn how to talk and put points on table ."}