{"vijinpanamaram": "😮😮😮", "pichakkdhoomm": "You are disgusting! Absolutely disgusting @mallikadua", "kahsuwma": "HAHAHHAHA", "thatsoayesha": "Lmao", "shahbu_official_": "😂😂", "na08kul": "breaking news 😂", "sourambunctious": "You and your dad are equally disgusting! Every body knows you are pro Congressis and anti BJP.. but we can see this anti BJP turning into Anti India already! You should be off the internet by now! You scumbags have polluted this good place! Fucking anti national bitch! The soldiers must be very sad to know they are protecting unfaithful bitches like you who shit with their mouth! You are as Disgusting and insensitive as ugly you are! Why the hell aren't you going back to Pak! Daughter of a anti nationalist and a molester and a molester her self!! Shame on you! Tu aur tera Madarchod baap dono ko beech bazar gobar k chappal padne chahiye! Saale bhadwon ki jaat ! And lemme say this you are a RANDI! PAKISTANI KAA LUND LETI HAI TU! and I'm definitely not sorry for my language! I just feel utterly disgusted by looking at the shits you do but unfortunately I somehow come across your 'attention seeking content' ! GTH unfaithful bitch", "tuba_beg.mi": "Here's to free speech and the truth. 🥂 People will continue being butthurt, keep being truthful to yourself❤️.", "gaurang.47": "TUM HI KHAO KAM PAD JAYEGAA", "the_genius_general_": "Chutiyaa ldkii", "nishodr": "❤️", "raghvendra7592": "Ye pagal hai", "aashi_080": "💯💯😂😂😂😂😂😂", "divyansh_sharma97": "Thats just cringey.", "palakagrawal95": "😂❤️", "sumaiyaqureshii": "@riddhihinduja your future career", "nadimdremer": "😁😁😁😁😁😁😁", "anne_patnaik": "@mbommai @sunoayeshaaaa is that me ?", "adityarshukul": "Delete it you traitor", "pooj1a": "Another rakhi sawant😂😂😂", "naina7768": "Kutiya wale kaam krti rheyo bs", "___nimki___": "You eating me? Oof @mallikadua", "zainabahmed_3": "🤣🤣🤣🤣 true", "pri_love88": "Bitch moti bhaisaa khaa khaa ke fat jaa moti.... Good for nothing", "nirmala_bs": "Disgusting and stupid 😡 not knowing the value of a life of a soldier and their sacrifices 😏 nonsense lady", "ujjwalbatra444": "@prabhleen.singh_", "_misbah_khan_": "😂😂", "swati_salunkhe": "I really use to like u ...after ur nonsense opinioniated video also I thought u have right to speak yr mind...but this is like teasing people..shame on u..y are u behaving like a b***h 😠", "anuraag_word": "💩💩💩💩", "akshay.bhave": "Already unfollowed u for \"log toh roz marte hain\" 😑", "maithdesai": "@shwetavohra pretty much sums up what we have been talking about 😀", "sam_aqua08": "Kareena kapoor of chinchpokli", "surya.raj23455": "Kitna khaogi moti.. Kisi din tum pure desh Ko kha jaogi.", "rudram16": "Sala moti maghia gandi dabuuu pakistan kuu .. i", "arpita_seth_": "stupid girl", "impradeeps90": "Khati reh, but gyan kam diya kar behna 🙏.....your gyan on Pulwama attach was pathetic 😡😡", "vasundhranancychib": "@shipra__chib what the fuck is wrong with this woman.", "darksun_199": "@___sid________", "sushrut2020": "😂", "pawan.mpharmacy2017": "Baap Aur Beti ko free me khane ki adaat hai", "imsingh55": "Moti agar boader per fauji naah ho to tu u ache see thoos nhi sakti thi or kissi k yha gulami kr rhi hoti mc moti", "akshitasharma694": "😝😝😝😝 you're awesome", "_mayuriiiiiii_": "She is Crossing her limits", "abhyy_icarus": "hallo faands #lays khalo .... n plz follow @beautyyborkar its a keen request @mallikadua plz follow my gf", "_aditibs_": "@walkwithmetwice", "1504jenny": "🤣🤣🤣", "shashi.kumar261096": "Jitna Khana hai khaa le Moti...pet to bharega nhi tera", "bajwaangad01": "bhains sali Rapist Vinod dua ki napak olaad se kya expectation rkhe..bhencho thuuuu tere pe", "afrin__khan": "Hahahahahha", "cena_parvesh": "What else can be expected from Daughter of a Rapist.", "adityadwivedi37": "Humour 2019", "riya355984": "Vinash kaale viprit buddhi .....u r a true example of this ....as what i can see now ....get well soon ...!!!!!!", "ankit.r.saxena": "@mallikadua didi ne to udta hua teer leliya 😁😁🏹", "desy_munda_": "Tum randi ho pta hai tumko apne bap ki tarah", "ruch527": "She is just infamous and cashes out on it.. anything and everything for fame 🙄", "j_swasti": "🔥🔥", "sam_abidi72": "Ghaurr se dekhee yehh hai inke Fitness ka Razz 😅👏 @mallikadua", "sweta_life_in_pages": "@mallikadua stop it you know what you are actually going very wrong.", "ws_abhii": "Bukhmangi😂😂", "sanghamitrasarkar18": "Insta should have a dislike button", "satishgaikwad_official": "😂😂😂", "grunge_10": "Maybe just apologize", "lalitrajput1992": "Big fat brainless dumb girl", "dipbasant2405": "I hate you 😡😡😡😡😡 jara saa bhi sharam nahi hain naa tere me hamare desh k sainiko k maut ka majAk kaise uda sakti ho😡 tumhari family k log jb marenge naa tb pata chalega kitna matam manati hain ki khushiyan @mallikadua", "directionr_bae": "Shame on you for making joke in this disheartened situation!! Such a attention seeking bitch you are!", "aswalsingh": "I love u mallika 😂❤️❤️❤️", "iamsak0005": "This is just not funny", "omkaromijuyal": "Tatti khaa leti bc", "zlalini": "Itne progressive hai aaplog. Thora time nikal ke apni History aur Polity bhi par lijiye :). Aur chaliye aapko Pulwama main bhej de. Waha jaa kar, khaiyega chakhne. Koi aap ko anti nationalist nahi bolega :)", "manirj07": "Kaha baap tha.... Kaha yeh naylak beti... Sharam karo... Randi ke sardar... Malika dua sune le mere yaar", "royal.m.sharma.9": "Ye sarcasm hai ya Mann ki baat 🤔🤔🤔", "ashishrajkashyap_ark": "Literally my dear... A Big shame on you", "dipashreed": "U r such an ahole @mallikadua", "rohit.kumar_prajapati": "Tabhi log bhukhmari se mar rhe h😂😂😂", "turbulencev12": "Abbe koi iss moti ka gangbang kr de 😃", "melomalhar": "Cheap comedians", "irreverential": "You know you could do a good impersonation of a certain Kumar at @timesnow 😬😆", "llki55555": "Aaram se kha .", "princex_lilly": "Hahahaha", "sahib.verma91": "Fuck you bitch @mallikadua", "sonu4589singh": "You such h dirty shitty woman who wants publicity to do such dirty things guys plse unfollow this bullshit lady", "abhi_1006": "देखो इंस्टा प भैंस @nitin813 @addictoani @kamesh__chauhan @mridul_agnihotri", "shubhashree_das": "Kya Yaaar Didi Aag laga di🔥🔥", "star1111115": "Itna hunger se marne valo ki chinta hai to kyo khati hai itna bc 5-6 logo ka to tu char jati hai suvar 👎🏻👎🏻", "shi_vm": "Rakhi sawant ki बहन 🙄 हद है ।", "shubham_bhardwaj_9339": "@mallikadua sasti publicity paane ka best tarika h...", "aparajita.saxena": "@mallikadua Your audience admits that you are a chill person and hate doesn’t affect you at all. But stop pretending being so cool that you are starting to look insensitive. I hope you realise that you have a great and numerous audience, this is a platform you have built for yourself. Don’t let insensitivity trigger hate at this point of time. 🙏🏼", "anish_loves": "Teri maa ka public m aa kv aukat dikhata hu Desh ke bare me ya phr Army k bare m kuch v bola ....l dunga orr m tere site p aake specially bol rha hu 🚩🚩🚩🇮🇳🇮🇳🇮🇳", "dev120286": "Lame ur . Have seen that video of urs. @aajtak was right. U were clearly comparing lives giving by homeless jobless and persons in depression then with the army men’s who had given their lives by protecting our motherland and us. We’re u in ur senses when u were saying that? Or Pulwama incident was very normal to u? And beyond that ur posting ur silly excuses!!! Over here. And blaming others that u haven’t said anything. Shame on u. Was following u coz I found u witty and funny and now unfollowing u coz I found that ur just an moron nothing more than that✌️", "ishratraymish": "Seriously😂😂😂", "shivammpanwar": "@mallikadua do something in your videos that make us laugh not angry. Nonsense 😏", "tirath_64": "Breaking news: Mallika Dua harre rang ka namkeen khaati hui dekhi dayi. Harra toh Pakistan ka color hai. Anti national namkeen.", "priyayaya_": "Hahhhhahhahahaa", "ivishnupandey": "Nonsense stupid", "sadia_azhar_nawaz": "😂", "thelivingsnoozebutton": "Is 'being ridiculous' trending? Else you might try blocking your own account. Pure shit. Congratulations.", "tanoj__": "Family tension ka bajese. Bachhe Lok bigad jate Hain....😉😉😉", "poonamsingh.haldwa": "😂 Bht shi h", "shreyaaaaa_1005": "Seriously..? Malika now u r annoying...dont make too much fun of people who are sympathized towards there Nation...the way u r reacting is too much..stop this..ok.. This won't make you look cool!!!😡", "jasmeen_kaur14": "I am also hungry at this time although I had dinner 😒", "o__yashraj__o": "Aaa Thu...mujhe aapkk sakal bilkul pasand nai aayi", "theofficial_dr.golu": "😂 unfollowing you bitch", "richa_02": "Please think before you pass silly statements. I honestly thought you're beyond that. Mourning for soldiers cannot be compared with people dying because of hunger, poverty, etc. Do not take things for granted. I come from an army background and I know what it is like. For you it's just another day and probably an opportunity to act cool.", "krishn27.official": "Tera baap bhi ise h news bolta h pakistani baap Beti 😂😂😂", "mariam_khalid18": "@amna_926 i guess the civillians are also hateful. look at these comments man 🙄🙄 I swear this whole india pak thing is just so stupid at this point 🤦🏻‍♀️🤦🏻‍♀️", "tanu_tyagii": "I request all of u to plz unfollow her🙏", "priyakshisaikia": "Ms Dua you are a position where are you can influence people,that's why people look up to you that maybe you will show a kind of gesture towards our bravehearts, taking that as a point you cannot compare mourning for the death of poverty stuck to our martyred soldiers,you cannot show solitude then please keep shut ,do not jump onto opportunities for making your videos . Everything is not funny the way you make it seem to be.your insensitive comments are not appreciated .cheap stunts like these will get you nowhere maybe you haven't lost a brother or father fighting for this country,maybe that's why you have such small thinking,grow up Ms Dua .", "vishalsharma96_": "And You Also Support Pidi Media 😹👌", "ashutosh.tiwari54": "Tum sale karo isko support.. bc goverment ki waja se ye mazak bana rahi ha .. pappu ki bhakt ..👏👏#pappukibhakt", "akrit__singh__jadoun": "i don't think the way she is insulting every media channel and comapareing soldiers to normal peoples duh when you are staying at your home with your beer they are fighting just for our country so have some respect and like you are insulting every single citizen of india is not a way to treat something like you have your opinion ok its cool everyone have their opinion but the way you are saying like tumhari aukat kya h and all is not a way to talk at the level you are know. i personally love you and the content you make but now i just feel bad the thinks you have said.", "saand_eep": "Keep on doing that.", "ac_band_kr_diya_h": "Suno Pakistan + teri maa ka bhosda", "imdivraj": "Whoever is finding this cute or funny needs to be slapped on the face with both hands while being beaten by the belt simultaneously", "fleetingboo": "I used to follow you but I unfollowed because of the negativity We all go through something But problem with your account is that you give negative remarks about everything You have problem with government With media If you followers were decreased which was apparently because of some virus you blamed government And then did not even apologize The problem is that you are doing nothing for the wrongs you feel If you hate everyone's about our country then leave Or join politics or be a social activist You said sitting in our drawing room and showing petriotism won't work That sorry but what you do won't work too If your father was filed under me too case then also it's Government's problem Like wait government does not have that much time to go after citizens These days there is a huge decrease in your followers and you feel it's because you are saying truth To be honest we unfollow you because you talk shit sitting at your home and not do anything but put out content that spreads negativity", "mr.aawara": "Stop being creep to be famous, India is a democratic country,we welcome your views.", "imkaifazhar": "😂😂😂😂😂👌👌👌👌👌", "the_solitary_walker02": "@mallikadua maa'm i know roz unemployment, poverty SE log marte hain...aur govt ne unke liye policies banayi hain...lekin soldiers alag hai..they PROTECT US!! 24*7 SO THAT WE SLEEP IN PEACE, LIVE IN PEACE....DEATH OF SOLDIERS SUDDENLY IS OUTRAGEOUS OFC!!", "gagan_singh06": "This food Júnkie is soo social media obsessed , she thinks it’s important to show her life on social media than to mourn about something happening. Please guys unfollow this bitch. Bloody social media stars tell these losers that no one would even know them had their been no Instagram. Unfollow this bitch", "nimsstylefile": "😂😂😂😂 seriously", "s_arif_khan": "😂😂😂😂😂😂", "sneha1233": "Nirlajja techi had paar keli hya muline", "nav__abhi": "Teri humour public nikalegi tnsn na le", "minakshi.rajavat": "I was your follower . Coz u have gone insane . Their is a lot of difference between humor and insensitivity . Soldiers died protecting you and many families and you are being sarcastic about it . Clearly shows what kind of person you are . Past fan , now hater . Unfollowing malika dua . You don't deserve our love", "revasiya2121": "So much for fame...give a questionable statement and then keep explaining...justifying ...till you trend...", "kapilbhardwaj092": "Pakistani jao moti", "azyy_678": "Hahahahaha", "rajesh_kandhari": "Hehe🤣", "bhaskarx3": "Idk who finds her funny", "pratika_sood": "Motherfucker", "rishrao95": "Unfollow her. What an idiot.", "singh_abhishek40": "Haye kaisi hai re tu apna mzak khud bna k rakh diya😂 may God blast u 😊", "aastha_sharma2312": "Chutiya aaurat chutiya baap tera desh ke nam pe dhabha", "poorvasharma_03": "Don't follow her if u all have a problem with her. @mallikadua is living her life the way she wants..I think u guys should get one too ( for all assholes who have problem in there dicks )", "charubhaskar": "You know Mallika, fighting for something you thought wasn't correct is different and now this video is scooping to another low level. Not every time can you be right. If you wanted to voice your opinion you didn't have to compare the sacrifice of the martyrs to other people dying around they are not dying on the line of duty towards their nation. Also when our families join the army we don't feel sad like you said we should we feel proud. Agar log dukhi hone lagenge to hamari fauj me log hi nahi bachenge. And this is coming from a girl who's brother is in Army. I pity your thought process. No one is telling you to show that your mourning the loss but atleast don't compare their death with a person dying from hunger or an illness. And I never see you crying for either. Just because you had to respond back you scooped to this level. I think people who liked you expected better from you.", "suraj.yadavv": "Come on u cannot make fun of everything. What u said earlier tells thats your brain cells are being damaged. And I will make 2 minutes of silence for the cells", "as.samrat007": "Unfollow her Indians", "wanderlustdk": "Sahi hai ASE hi watt lagani chye is godi media ki", "bee_.xx": "HAHAHA I love you !!!🔥", "kismatnayak": "Tu bhn ki Lodi pgl h Kya galat tuny bola", "pintu_surawat": "Bit.h", "patel_uv": "Your video was the topic of debate in our college in our annual fest. We literally had teams talking about and against this video. Time ran out but the debate continued. Topic was social media but it turned down to mallika dua’s video.", "mr_manish_choudhary": "Chatu midea be like", "sreelatha_kalamadi": "Ur crazy enough i say", "udit.parmar": "Anti national namkeen😂😂😂😂😂😂😂😂😂😂😂", "saurabhh1": "Taking it far for few more likes & comments !! Bad taste of humor and namkeen (may be)", "vishalgiraddi": "HAHA NOW TRY BACKING OFF, WHAT YOU HAVE FUCKING SAID HAS BEEN SEEN BY LAKHS OF INDIAN NETIZENS, NOW LAMBAST THE MEDIA USELESS PIECE OF SHIT, 🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳 #jaihind🇮🇳", "nitishthakur21": "Suar 🐷 ka sakl bhi aap se acha hai", "mannay17yy": "❤️🔥❤️🔥❤️🔥❤️🔥❤️🔥❤️🔥", "realsmitac": "What a waste of human life you are...", "shreyaaa___k": "You’re going too far @mallikadua Everything isn’t about you, you opportunistic limelight obsessed pathetic woman!!! Just to cover up what you said in that ridiculous rant of yours you’re being all the more ridiculous!! If you don’t have sympathy and respect to show to the Indian army at this crucial time, rather keep your disgusting mouth shut! Whoever’s supporting her in this, you are all sick heads!!", "escapewme__": "@savage.stalkerqueen", "sharman_singh": "👎🏻👎🏻👎🏻👎🏻👎🏻 asking for more hate... if all this for attention then definitely u will get it but not for long, what u will get for long time is hate. Which ur doing it to ur self.", "feliz_s_o_u_l": "GANDHI JISKE PASS HAI WO SANTULAN KHO RAHA HAI. Moti😠 --emiway Bantai", "travelwithindian": "Shame on u", "iamankitx": "Hell with your attitude .... Jab sahi se explain karna nahi ata toh kia mat karo ...... 🙄🙄🙄🙄......", "supaprax": "What namkeen is this? Just curious😋", "ayesha.alam71": "you r damn good. .😂", "anintellectualmess": "Kaisi ghatiya aur faltu aurat hai yeh . Kuch to sharm karo", "zanthosh_kumar": "@mallikadua how quickly your victim play changed to anti-Modi whining 😂 now thats who you are.. manipulating people by playing victim card against Indian Govt for your shitty insensitive video mocking Indian Army.. and you are complaining about others trolling you? 😂 chalu", "kmschumi": "Moti bhais khaja ...Pura Pakistan khaja😂", "mentalhealthawarenessindian": "How to be cool in India... 1.speaking mehengi English 2. Cuss the govt. (Modi is silent here) 3. Exploit every chutiya pehlu of a serious issue 4. Don't give a fuck about our own country", "wildbornheart": "https://www.facebook.com/370463842989100/posts/2078337098868424?sfns=mo", "sarahdalydavies": "@mallikadua You said clearly, why treat this particular incident any differently than other deaths that happen everyday. You shared an opinion, people shared theirs. Turns out most don't agree with you. That happens as well. They're not supporting the tiktok makers, they're not supporting the abusers or name callers. they're disagreeing with the part about mourning the murder of soldiers and comparing them to people dying everyday. Also, it's not only about the words we say. It's about how those words are perceived as feelings and emotions. Turns out people didn't like your take. That happens when we share opinions as well. So why are you sensationalizing this? Focusing on news channels only , when what they are saying is basically what a lot of people said here as well. Accept that many agree, many disagree with your take and move on. Your job was to share your opinion, you did. It's getting ugly and pathetic that this is receiving attention instead of the soldiers who were murdered. Please put the focus back on them, else post your regular stuff. Cheers. #pulwama", "sapnagargstudio": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "yogita_yv": "Indian Godi Media:: who you are? Aren’t you an Indian? You could have write Media cause as far we know you are an Indian and right now you are in India. Don’t spoil our country’s name and legacy just for making some followers.", "thenishanadk_45": "You're littttt🔥🔥💗", "tiktokqueen7985": "Such a shitty women u are..how one can be so dump senseless fucking useless women don't dare to say anything about India's people support for their soldiers yes they do protest yes they become out of control yes they do cry yes their emotion outflow when incident like phulwama occur.. Ek bat bata tujhe Bharat ki security Halke me Lena lgta hai agar ye zasba nai raha to Bharat ko sirf army hi nai guard kr skte duniya ko ye pata hona chahye ki deshbhakt keval border par nahi har ghar me hai aur jab jarurt padegi har koi nikalega ye jo protest hai ye un martyr k ghar ko Josh deta hai himmat bandhata hai border par rahe jawano me aur vo jinko kuch nai hua un jawano ki ghar valo ki chinta kam kr k aur Josh se bhar deta hai.. Agar 43 log marte hai to na Jane kitano k andr ki deahbhkti inki border par Jane k lye taiyar krti hai.....islye stop such thinking... Shut women", "the_real_homosapien": "Instagram should have a dislike button i wish.....@mallikadua fucking bitch ....ek din border pe ja k desh k liye mrne ko bola jayega fatt k hath me aa jayegi tere ..ghr baith k jo ye bakaiti kr rhi h ...log roj mrte h n tu hi mrr ja bharat se ek bojh km ho jayega......", "bpal1991": "Hahahahahqbahqba", "tarunnchauhan": "😂😂😂😂", "shehzad6101": "😂😂", "kanikajswl": "Don't know why you sound so irritating 😂", "camouflage452": "You're not even a celebrity or something, you comedians should stick to just comedy.. Gyan baatne apne ghar pe jao.. Har baat ka mazak nahi hi bane aisa kuch nahi hai.. You got offended by aaj tak haan? 😂 You are what you are because of media itself, jab tak tera chal raha tha tab tak sab sahi.. Jaise hi teri galti dikhayi gayi, you showed your level.. Great going! You fu*ked yourself!", "dhananjay_yaduvanshi": "Why dont you share that namkeen with your molester daddy😂😂.. let him have the fun too😂😂", "yadavreshma1": "Not funny 😏", "theakshayrai1": "itni gandi sakal leke kaise ji leti ho behan🙏😂", "gyanprgya": "Did u pay 200%import duty or u smuggled it like terrorists did?", "lilu_nirmal": "🤭🤭🤣🤣🤣🙌", "vishakharajdev": "no shame look at her attitude ...soldiers me se koi uska bhai hota toh bhi ese behave karti kya ..", "sachin_wagharalkar": "India ka kha kha k moti ho gayi hai...", "sam.xvv": "😂😂😂", "siiddique": "Ma'am 👍👍👍👍👍👍 you are superb👏👏👏", "niteshjaiswal7381": "😂😂😂😂😂😂😂😂😂😂😆", "ojinahk": "Hahahaha 💯", "mowl_ism": "😅", "_shishhhh_": "What modi has to do with all of this...plz stop your nonsense...nd yes aajtak has shaped your comments in their own way ...so you go nd confront them....why you are bringing modi in all of this", "byadnnn": "Love you💕", "monica_thakur12": "OK you have proved your point on your igtv video & we get it(& believe me i was convinced) but Now, will u please stop doing these bullshit things. If anything dirty goes against you then YOU are the one who is fully responsible for yourself! I mean what is the point of doing these useless things now.", "akhil_chanti": "You deserve this for what you said before and you don't deserve to be protected by our soldiers 😏", "cj.360": "Cool banne k chakkar me foolish baat kardi.. Chhapal se maar k pakistan bhhagao esko. Emotions nai h esme. Jo jo baat bola h tumne., god forbid Koi tumhare family wale k death hojata to wese baat bol paate? 👎", "mayank_par": "I am a bit confused here is it \" गोदी\" media या \"घोड़ी' media", "sidharth_sharma0123": "😂😂😂😂", "toomuchkhush": "I love you didiji 😹😹😹❤️❤️❤️❤️", "backbancheraaloksharma": "Tere marrne pe ham log party karenge rapist baap ki beti tum do no baap beti ki koi autak nahi hai Tum do no pakistan ke paltu kutte kutiya ho pakistan ki di hui haddi kahna tere jese logo ko pasand hai wese kitne ka blank cheque mila tujhe tere dusre baap imran khan se", "chauhan.rahul.kk": "Saali randi teri bhn ki chut bhn ki lodi moti teri okat kya hai saali india chodd kar pakistan m apni maa chudwale", "k_shgit": "Godi media se yaad aaya.. Vinod dua kaise hai", "tarunimalhotra": "@_prabhsamrao_", "ashishpatil_17": "She is a daughter of Vinod Dua ! Hmmmm I see ..... 😂😂😂😂", "madityaprakash": "एकसाथ इतना सारा अन्दर", "kamraan4u": "😁😁😁👌👌👌", "ashi_magnumopus": "👏👏👏👏😂😂😂😂😂", "studio.parizah": "Very 😋funny", "rolljack_xossip": "Hey whom dua uncle is stslking these days?", "himanshu.rai31": "Modiji bhuat free hain Ye article modiji ne he likha hain shame!.", "karansukhija234": "Go get a life", "atishzaade": "kuttia tatti hi kha le kisi zihadi ki..jesi gadar khangressi dalla baap wesi beti", "kteeness": "Love u mallika❤️", "sanjay._.rathore": "Ridiculous!!! Pehle lagta tha comedian h par tu to chutiya nikli 🤣🤣", "calm___chor": "These are exactly the type of bitches and her kutta dua .. who are paid by the Saudi petrodollars to make fun of martyrs", "sammy_eder": "I hope your scum of a pervert dad dies soon. CUNT", "basir_2620": "Hhhhhh kia bat hai aunti jee", "kukhumani": "Barkha dutt called her out on her Twitter handle..the video was really distasteful", "iampardeepanku": "Mjaak chla hai yahan🙄kya faltu logic chl ra tumhare dimag me, kabhi bhi kuch bhi bol ri hai, thus jee bhr ke jitna thusna hai. Kon rok ra hai 5-10 kg aur bad jayegi wese kon si kam hai, but indian army ke upar jo soch hai tumhari wo ghatiya thi😠 @mallikadua", "mrunal__1chaturvedi": "@mallikadua after seeing your video i can conclude you have no sense of WHAT to say and WHEN to say. You acted exactly like the son of ramadhir singh in gangs of wasseypur. bidhayak banega chutiya saaala", "exploreplaces__": "Y so desperate ?? @mallikadua trying to be cool , pseudo liberal , wannabe shitt like you are good for nothing .. we never asked you to take stand for us because we know every countries have sleeper cells , traitors with anti national sentiments but unfortunately you're not even all that just a useless piece of shitt a non comedian (unfunny one) trying to seek attention. Ek dande kisi ne chala diye hote tmpe toh tm rone lgti pura social media pe bawal machati lekin hamare army personal jo hmare liy they put their life on risk unka majak bna rhi. Behen tujhe toh 4 din mai log bhul hi jaynge lekin baigairthi dikha .. insensitive useless bunch of dumbtards!", "adhiraj.aadi": "Like father like daughter.Useless.Dharti be bojh.  Get a job u loser.Road roller hi banja. You could be a dhol as well.", "sanjanajparikh": "@maanyanamaan", "_badass__69": "😂😂😂😂😂", "shikha7b": "Anti national namkeen 😆👌🏼", "gaurav_shr171": "Galti pe galti mat karo madam. Pls grow some respect for the departed", "nayanidixit": "@mallikadua terribly disappointing!! U have lay ur sensibilities or may be u never had any", "artisonkia": "Why r you staying here when you r eating of Pakistan bhujiya I feel they will even give you land to stay so please v indian hv decided to make indian a clean country so v r requesting you to go go and go and help us to clean our country", "piyushargod": "Farzi deshpremi koi ni hota @mallikadua emotion sbme hote hai .... and democratic country hai bhai sbke pas right hai vo apne views jese marzi represent kre ....but you are just saying that “har din log marte hai “ wah you can’t compare normal /aam log with indian army soldiers, they are fighting for our country .... not like you ,your profession is of entertainment industry so don’t involve in it just for attention ...", "thelibraguy": "Hum Indians ki deshbhakti tabhi jagti he jab koi soldier shaheed ho jata h usse pehle koi awaj ni nikalta... retired soldiers delhi me apni pension k liye protest kr rhe hein pr kisi ko prwah ni h tab kisi ki deshbhakti ni jagi pr jab shaheed ho jata h to pichwade me aag nikalne lgti he...train me soldiers ko seat tak ni deta koi tab yahi soldiers gate k paas sokr travel krta h tab kahan chale jate hein ye chutiye deshbhakt tab kyu inki mu se awaz ni nikalti tab kyu deshbhakti ni jaagti..in kamino k according jab koi jawan shaheed ho jaae or tab tumhara khun khola tabhi ye prove hoga k tum sachhe deshbhakt ho..", "khusht9": "@mallikadua 😂😂😂🤣🤣🤣🤣😂😂😂😂🤣🤣🤣 baja di acche se aajtak walo ki, ab kbhi panga nai lege😂🤣🤣🤣🤣🤣😂😂😂😆😆😘😘😘", "maulik_640": "सस्ती पब्लिसिटी के लिए कुछ नंगे हो जाते हैं, पर जो पैदाइशी नंगे होते है वो ये सब करते है @jigar95 @vaibhsgohil", "theshikhaarya": "Ultimate 😂😂😂", "swatisdhar2292": "Now u started making fun of this!!!Great...u r evn doing this bcoz someone sacrificed their lives!!!not bcoz someone died of hunger...so disgusting n irritating!!", "theyounuskhan": "🤣🤣🤣🤣", "shivanisharma_83": "I love that watch of yours...", "pushkar.bk": "Fantastic bro loved ur comment", "anilsinhmar7007": "😂😂👍", "jintidas_": "I think sab koi yaha comment section meh desh bhakti ki tapti aangar ko leke toot pade hai...but i can totally agree with your point of view @mallikadua .... we all love our country and we are very proud of it... Indian Army is the super heroes of our country.... hum yaha k veer sahid k upar koi mazak nahi kar rahe hai or kabhi iss bare sock v nahi sakte... #everypersonhastheirownperspectivetoshowingofftheirthaughts!", "sabahnargis": "😆😆💕", "i.4sim16": "Khel Gayi Ladki🔥🔥🔥", "utkarsh__tiwari___": "unfollow her ....this is not funny @mallikadua 👎", "anshuman_trips": "Dimwit", "priyanka_bisht25": "@mallikadua ma'am 1 baar jaa k un fauji ki family se mil lo 1 baar unki baat sun lo, aap nhi smjh paogi ye sb apke basss ki baat nhi... U were right at some point ma'am but then u went too far .... Ye fauji humare kiye hain ma'am ... Inke bina humari life ka koi wajood nhi pr aap ye baat nhi smjhogi... Apne apna bhai papa nhi khoya h na ese bomb blast me aur na hi koi hoga fauj me bhai ya papa tbhi ...", "oops_no_rules_lady": "Chippss khani hain...#trip2 ❤️❤️😘", "lakshaya.wadhwa": "😂😂😂", "alaa_musthafa": "😂😂", "sudmurkute": "aree iske ghar ke kisi bhi maut pe bahutt hsne wale hai humm...tab isse ye video share krenge...aayega uska bhi time aayega...time se thodi n bachh skti hai....sbka burra waqt aata hai...iska aane de...sbke samne yahi insta pe iski utarni hai...@mallikadua ..aaise bhi bandar dekhne ko milte...suchme bghwan ne bhutt bdi karigiri se banaya hai isse...", "fariha_7049": "🤣🤣🤣🤣🤣🤣🤣@ibrahimahmad04", "indraneesharma": "U being really mean this time, just a simple apology to those who feel u have heart their feelings and u can Move on.. So many people love u and ur work but being so arrogant is kind of showing how ignorant u are towards other's emotion. We know AajTak is a bikao channel but trust me this time u are not 100% right. No doubt u are a great performer and have done some tremendous work, but u are really not a mature person. @mallikadua.", "ohthatdeepti": "How pathetic can you get, Ms. Unfunny Bones? You take the liberty of insulting anyone in the name of creative liberty and making truck loads of money, but you can't take one hit to your balls. Most libturds can't digest criticism coming their way. Thought there was more sense in that monster sized head of yours, sitting on a pea sized neck. Apparently it's all full of shit. And looks like it too.", "aar8460": "You did imply what they've mentioned though. Now stop playing the victim here. They're our protectors so we all have the right to mourn their deaths in whatever way we choose to. You're no one to question our ways or to even compare their deaths to any other death. They're our heros and they deserve the respect we give them", "22naina_s": "😂", "akanksha8658": "😂😂😂😂", "i_am_abram3625": "😂😂😂 Tension mat lo ap Aram se khao ye kuch bhakt aise he hote hai . In ka kam he Aisa hota hai . Bolna Kyu ki zindagi me in logo ne Aaj tak is ke siwa kuch nhi kiya .Bhakto ne", "dreamersoulll": "🤣", "dkbozzz": "😍", "supriyaksharwani": "Hadd ho gyi ye to😕", "aaisha112018": "Hahahahahahahaha prhi likhi jahil media k kaam", "rockymambabdd": "This useless comedian tried to be SAVAGE. but ended up what she is in reality.. a SEWAGE.😂", "aaaaeeerehan": "😂", "juhie_bhardwaj": "Low!", "caajal_": "Anti national namkeen😂😂😂", "nausheen_binte_arif": "🤣🤣🤣", "nikaaa.chikaaa": "Hahahahhaaahahha", "happyfacedbeast": "Beauty🔥😂", "robingerr": "💕💕💕💕 @mallikadua Hugs and support", "ahujasilky": "Sorry to say mallika but stop doing such stupid dings and stop exaggerating . .u r not wrong by not saying much in post about the incident n dat was ur choice but now u r not right either in making batangad out of a sensitive issue. .stop acting stupid. .if u cant say much about d attack den why u makimg so many videos and posts about ur insult . .dat means u r not happy wid d criticism. .why shor n halla for ur insult . .when u cant update more posts on palawan attack n our soliders. .", "reema00055": "India Pakistan ne mil ker pura middle east develope kerdia, sadly they cydnt do the same back home when we understand that these external forces r jus using the divide n rule strategy on us again n again n we keep falling over it they dont want us to develope n progress they jus want us to b dependent on them....its high time we need to come out of it n stand for ourselves this war or hatred doesnt favour india or pakistan we both r neighbours n wht effects one effects the other too be it water, climatic change, poverty", "beingkshitijak": "😂😂😂😍😍😍😍", "amrita.kaushik8": "Buddhi mar ja,dimag see bhi moti hai", "bizy__bee": "Kyut savage😝🤣", "duaaaz24": "🤣🤣🤣🤣🤣🤣 your so funny", "andrea.magdalene": "Savage 😂😂😂😂", "arpitxanand": "guys go check our her story as fast as you can....she can' t even write licence...She mispelled it..😂😂😂😂😂😂😂 @mallikadua", "sonu.gour": "Only one word for u #BKL @mallikadua", "nyuthaa": "Lol sahi khel gyi bencho", "r_swetasingh__": "🐵 jaishi harkat", "xo_fatema_xo": "😂😂😂😂😂", "rjroger9": "@mallikadua :they r not sane enough to even hold beer for u😅go di media is insane", "roxet6": "It's quite funny to see you so frustrated by the reporting of Aaj tak on you... But they only said what you reflected about yourself in that video... You are not some divine figure that your patriotism can't be questioned and that too when you so ruthlessly insulted sacrifices of our soldiers in that video... Shame on you ...", "iamharleyquin": "@poojanyati", "aartidevaljo": "Kamini, Desh drohi,bhesh jevi", "mariamarwat": "Guts", "ali_shaikkhh": "🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻", "_vrishank_": "Bohot sahi fashion hai ye or I can say a loophole, disrespect own country our army and then end the sentence by blaming modi. And fir jo bhi aapko bura bole usko so 'Bhakt' bol do. Golden loophole to save own ass. Same technique was used by JNU and damn it worked!", "gurjit_kaur_sandhu": "🤣🤣🤣🤣ab pata chalega media ko kise panga liya hai🤭🤭", "simmran7": "All the people jo itna bol re h ki she is disrespecting martyrs and you yourself are pure desh bhakts plz join Indian army or fund them instead of showing your deshbhakti by typing your comments by sitting in your cozy room", "pyaar_se_pandey": "Chutiua bccc ese desh se bahr nikalo saali", "fheoenw": "Look at this aurat! jo besharmi ki haadein paar kari jaa rhi hai. Pakistan bhej dia jaye isko", "ram_rk_01": "By the way i want to ask is how much is the cost of this videos on army 😂😂😂 #operationkaraoke", "miirraa_5": "@mallikadua I agree aajtak n Jo Kia galat tha and you made it very clear in your last post. This was so unnecessary. This is a serious time for us Indians. Har waqt hasi majak nahi chalta. U posted one post about the attack that too was about not going for war against Pakistan. Agar kuch dhanka nahi daal skte to aisi vahiyat chize bhi mt daalo pls🙏. I was really upset that most celebrities are not posting anything about the attack. But after watching this I'm glad they aren't doing it !!", "shubbharora": "Sahi h, aj tk kl parso sbki leli 😂😂", "pushapbawa88": "😂", "hemanshu___": "Yaha log bhukmari se Mar rhe Hai aur yeah kha khake moti ho rhe hai", "imurugun": "@mallikadua have they apologized yet?", "parthsinghsehrawat": "Say the truth about mallikadua on the news channel= godimedia bhang bhosda. Itna mat Khao madam log aapke chutiyap Ko support nhi kar rahe hai vo to hajam ho nhi Raha isko kaise karoge ? Popular hona tha hogae aap pura Desh janega tumhe, kis Naam se vo to comments se andaza ho hi Raha hoga. Ulta padgaya. Tere ghar ka koi mara hota tab Karti ye bakchodi tab me bhi hasta tere saath ..", "_komalmittal_": "😂😂😂", "vikas.cphileman": "😄", "atrisingh_": "Savage 😂😂😂😂😂😂😂😂", "st.sky_18": "moti khati ja", "muskanagrawal2528": "😂😂😂😂😂omg no one can beat you🙌😂", "pabishachatterjee": "🤣🤣", "batprats": "@mallikadua actually na, You having opinions on national issues is totally fine on insta. But what baffles me is you getting media attention. @aajtak is literally at fault here. I mean you are literally nobody in the context of national importance to be shown on TV channels yet if they are entertaining you and your jokes on media and their channel then its on them.", "yolo__________88": "U go girl", "_felicidad_._": "😂", "bhoomika_anandani": "😂😂😂😂😂😂😂 Subh se @aajtak walo ki madam ne baja rkhi h😂😂 ye shyd aakhri br aaj tk walo ne aisi harqat ki hogi aaj k bd unko hr br apni nani yaad aayegi.. oh sorry Mallika yaad aayegi🤣🤣🤣", "observe_r": "😂👏", "naziamanzoor": "Hilarious", "brown_girl_in_paradise": "You’re a classic example of what happens when fake “fame” gets to your head. People dying of “bhookMari” is not the same as martyrdom. You don’t have to mourn; that’s your right. But don’t justify your actions by demeaning anyone else who is either openly or privately mourning it. With your pea brained logic, people get good news everyday and hence they should not celebrate any victory that India achieves 🤷🏻‍♀️. But what’s the point of telling you cos well, how can you be wrong? And why would you ever admit that you are wrong? #useyourbrain", "varxx_009": "Savage 🔥", "kv_gaurav": "😂😂😂😂", "coddiwompling_me": "SAVAGE", "najhaque": "@kanzaaijaz", "sachin02206": "The More a Lady becomes Fat , the more Toxic Libtardness and Toxic Feminism Increases in her 😂 🖕 Rakhi Sawant ki Behan", "rd_5ingh": "Unfollowing you right away. You're one of the few Ungrateful, fame hungry SOBs. @mallikadua and this is my understanding of kinda of person you are. No you can judge me in 3,2,1....", "mithilawandhekar": "😂😂😂😂😂😂", "sumant_choudhary": "Daughter of alleged Rapist is calling her own own video wrong.😜👎 You've lost it mallika... dolt!!", "aliaabhattr": "😍😍", "abhayjodhpurkar\nVerified": "Verified", "maanvibhardwajj": "Why are you justifying yourself? Unfollowing you loser! You shouldn’t exist", "ahmad_tarab_": "Nailed it 🤣🤣🤣🤣", "its_bipasha": "@badphotographyandme 😂😂", "parorani": "Always HATED Aaj Tak as a news channel - Bullshitters .. and posting crap about you just proved to me how right I was . You're amazing @mallikadua - Stay Smashing You Forever ❤️", "karimrimshaofficial": "Hahahaha oh my you are awesome!!! 😘😘😘😘", "mr_yash03": "Tera baap marega to asse hi face bana ke rakhna kamini 😡😡", "anujsaxena28": "Haha!!", "snehamatey": "Ahahahahahah!!! Good comeback!! 😂 😂 😂 😂 😂 😂", "blabbermouth_always": "Kya didi, akele akele khaa rahe ho? Thoda idhar bhi dene ka naa..😂😂 apun bhi \"anti-national\" bana di gai hun..😂😂 lots of love di. And it's really appreciable you're still standing even after retarded hate comments. Oh di, aaj subah aap par india today ka article padha..", "_nishgram": "😂", "m00nlight_ck": "Hahaha😂😂😂", "ursila.ali": "😂😂😂😂", "iiateeqii": "Loolololol yassss kween @mallikadua !!!!!!!!!", "abhinandan_sharmaa": "What’s the meaning of godi?", "outlander8": "खिस्यानी बिल्ली खंबा नोचे ।", "nicknackk_14": "😂😂😂🙏", "iakashchoudhary\nVerified": "Verified", "oneband1dream1direction": "Tu wo deserve krti hai", "saloneyyy": "@suhanijjain", "thesaaniyahh": "She is next Rakhi Sawant 😂😂 @_dhananjayshinde_ @pranashashinde", "vivek8137": "Are bhosadi ki.... Teri maa ki choot , padhi likhi gawaar @mallikadua", "kishor_patri": "han randi tu yhi kha..maadarchod deshdrohi sali..sidhu se chudwa k aayi h kta tri maa ki chut bsdk", "kapilverma001": "@mallikadua it is a norm to have a mourning period post demise in the family. Of course life goes on. But we do not make videos having pun and fun during that time. Being an influencer I guess people expected more from you, like creating awareness on how to unite, be helpful, to the living and to the martyred. Clearly you and your foul language are incapable of doing so. Hence unfollowing", "miss_rahmaan": "Haha...media ka bas chale to pure desh m aag lga de nafrat ki content k lye", "farheen2107": "Hahahaha nice 1", "arc.noid": "LMAAAAOOOOOO", "abhinavgnash": "❤️", "soumyashukla1": "U are pathetic", "rj_vartika": "Ohh man 🤣🤣you just nailed it", "ega44173": "U r so adorable", "gauravg0009": "R u an asshole?", "taaraa_writes": "Seriously, too much.", "dishani913": "Pa gal😊😂😂😂😂😂😂", "harshita_j23": "Babe.. !! 😂😂😅😋", "tehreem9727": "Sab choro abhi pata challa k @mallikadua ISI ki agent hai ...", "shraddha_is_love_03": "Galat hai toh hai bhai😢 isne aisa bola tha ab khud pr kisi ne kuch bola toh unko koss rahi hai 😢😂😂 kaha se aate hai aise logg", "instadi10": "Hahahaha", "ruchika2013": "Stop making Fun of each Other Guys , i saw ur videos mam , u were not wrong but u wernt right either , u CANNOT make or hav fun AlL the Time, u posting Tik Tok videos ws MEAN (har kisi ka apna way hai to put their feeilings chahe fnny ho ya serious ho ya jo bhi ho) , u R a Comic u make Fun of Millions and tell them to take it easy, but if something or anything is said bout U , the way u behave is Insane, secondly aap jaise logo ke baare mein likh ke media ne hee aap logo ka dimag n status kaha se kaha pahucha diya hai. I DO NOT understand Y does Media HIGhLiGhT u or any star for that matter for Good or for Bad, yeh jo aap log karte hai na its just a Bloody Job , jis din audience nai rahegi n ppl WILL understand that ppl like u r jst simple common ppl like us doing their job of a diffrnt Kind, aap log bhi koi charity ya duniya ko entertain karne ke liye Free mein Kuch nai karte, u charge a dam for every single video post or anything at alll.... so u also plz stop demeaning others , u r posting tik toks khule aam n of other ppl featuring on it n using the wrd torture , then wat r u doing, who are u to post any n everyone without their permit, ppl like u shud be sued for makin fun ..", "authentic_dopeness": "😂😂😂😂😂", "sneh.haha": "What nonsense is this , now they will lie for TRP'S cool!", "luna_00612": "Stop acting like u are not bothered by the fact what u said was wrong. Now that u r being highlighted the way u said n ment it u have a problem w it n u r acting like u r just amassed n shocked w the stupidity n lack of understanding in your audience? Are u even that famous that someone will bride a channel to put u down? Haven’t heard or seen u on television or neither is your YouTube cooking/gossip wala show that famous so just accept it n stop being stubborn we all know the deal.", "saniyaxx_": "Girl you are the besttt", "__drishtea__": "Maam bss bhi karo...ab zaada ho raha h", "naveenbinjola1": "Apni aukaat me reh.. Desh se gaddari kahi mehangi na pad jaaye tujhe..", "ankita.verma_pratinav": "Really this has gone too far, I think you should stop this, we get you are patriotic ♥️ @mallikadua this isn’t funny anymore!", "shivayadavtomar": "Sunn..no.deti hu apna.. pichhwade mein dum ho toh call krlio.. fir batate hain tujhe India ki aukaad aur Indians ki aukaad..", "27_aniket": "Pakistan q nahi jate aap... Army h isaliye aap ho...smze kya???", "sufizzone": "I really freaked out when you offered some snacks at the end of your video 😁", "ar.kiran_joshi": "Omg", "kachhink": "Are pure savage or ...PURE SAVAGE?!!❤️😁", "theloudbiryani": "Arey Bhai Bhai Bhai 😂", "priy_raj": "Ab dekho kitne bomb giraye jaate h tumhare ghar pe😒😒 godi wants to know your location😒😒", "gun__zan": "@mallikadua ok ok fine AajTak news channel ne bola aapko glt bt aap eise mt bolo Indian godi Media it’s sound like ki aap saare news channel ko bol rhe ho btw I support u🤗", "rashika_shetty": "Not funny at all!! Try harder next time! Good way to reduce ones own followers", "rai_9096": "Haha.... love you!!! 😜😘", "nihitgandhi": "Liked ur watch 👍🏻", "kishan_ahir_75_": "Love the way u r dealing with fake news. More power to u nd we believe in u. God bless😍", "flamboyantbaniya": "😂", "charumirchi": "Dhyaan se dekhiye, is maasoom chehre ko !!! ❤️❤️❤️ Shagz di me sabki le li hai !!😁", "sadaf_thecutiepie": "😂😂😂😂😂😂😂😂😂😂😂😂", "neha_shah": "😂😂🙌🏼", "_solarso_": "People dying of poverty is unfortunate and heartbreaking BUT THE SOLDIERS DIED TO PROTECT YOU!!! So you could sit at home comfortably and laugh on your own jokes and there you list them as 'LOG TOH ROZ MARTE HAI'. Shame on you. Sorry not sorry.", "nashreenf_": "HAHAHAHAHA LOVE YOUUUUU!!!! 😂😂😂", "neha_singh_chandel_": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "songjuktaa": "QUEEN LOLOLOLOLLLL", "__.sunshine.__xox___": "😂😂😂", "shilpadasofficial": "Savage!!!!😂😂", "thesassysingh": "🔥🔥🔥😂", "moderatenormal": "🤣🤣🤣", "yuddhishthir": "Very good didi 🤣🤣🤣🤣😂", "mahi_xheikh": "😂👏", "sujit.k.maurya": "Report her now 😑", "i_am_abhiking": "😂😂😂", "preeti_timmi": "Earlier i used to follow your videos, posts but this is really ridiculous..being an Indian how could you post such videos, shame on you girl.. Jakey Pak m reh ja, jis thali m khati h ushi m ched karti h.. You can't be disrespectful for our soldiers.. They are pride of our nation.. Shame on you!", "tushar_rana_39": "😂😂😂😂😂", "astrologer_sonu_bhargava": "Astrology by love or love marriage problem solution specialist, astrology by get your lost love back. If you are suffering business problem or carer problem then just msg me I will let you know what will happen with you also if you are suffering love problem then don't worry I already solved so many love matters so I will help you to shortout your love problem you can whatsapp me & call also in this number +91-9649730851", "thegymaholicfashionista": "This is not even remotely funny @mallikadua", "foodiejaa": "Hahahahaha🤣", "_hritisha": "Hahhhahahahhahaha *dead* ... The burnnnn", "chayanika_bhowmik": "🤣🤣🤣🤣", "anu.sarin": "🤣🤣🤣U r so sweet 👍", "_triptichoudhary_": "🤣🤣🤣🤣", "domineeringeyes": "Can I have some @mallikadua 😁😁", "shehalafareed": "Ha ha ha ha", "neerajpandey_94": "Pakistani", "aishajaani": "😂", "_sapnapal_": "listen ajtak ka kuch ni bigadne wala tumhre iss nonsense se drame se toh plz stop this kyuki tum hi galat ho", "karan.ahir_": "chehara acha nhi hai to comedian ban jao...yeh acha hai tumhara 😂😂moti", "_lakshmi.menon_": "😂😂😂😂😂", "dancecafe_studio": "😁😁🤣🤣👍", "jaiveersinghbajwa": "😂😂", "vaishali_uniyal": "I have really started disliking you lately .", "vogue_express1": "Visit @vogue_express1 🐾", "gautmik": "Hahahaha", "sanaasiddi": "Hahahahha @mallikadua u r love ... 😍🤣", "i_jyotii_chauhann": "Hahahahahhahaa so gud", "beautifulquote3_": "Hahaha", "mannugill31": "You just nailed it this time Mam", "umanaqvi": "😂😂bring it on with a bang👍👍", "manishgaikwad183": "Sahi khel gaye mam😂😂😂....Godi media ki yahi aukat h", "somyaa_tyagi_actress": "Omg again cheap publicity", "hennabymanahil": "Haha Love this!", "warda_aijaz6": "Let's spread peace instead of war and mess just imagine if two atomic power will collide what left,only ashes we are the main victims of terriorism since 2000 and sacrificed our 70000 people we are the people who suffered alot the loss of anyone here in Pakistan or anywhere is commendable .as our PM said if India has some serious solid evidence share with Pakistan and resolve the issue no country can bear the loss of hybrid , conditional or unconditional warfare let's come to the dialogue table.", "anilsharma2957": "Sali desh ki gaddar", "parulpratap456": "You’re the best @mallikadua 😂😂😂", "sonakshimehta": "Hahahahaha befitting reply to useless journalism! ✌🏻", "ishaa.narang": "😂", "tj_5204": "Chainn se sona hai to jaaag jaiyeee ...AUR DHYAAAN SE DEKHIYE IS ANTI NATIONAL MAHILA KO.....", "instapavan_": "Ye khud hi aapas m lad lad ke mar jayenge .....Pakistan walo ..Bomb phodne ki kya jarurt h", "studio.svty": "🤣🤣🤣🤣🤣🤣🤣🤣", "shyantani97": "Lol", "sagarchaudhary2733": "How can she post such a lame video on this situation ?", "borntofantasize": "Anti national namkeen😂😂😂😂😂", "baaz_singh_shekhawat": "Moti kam khaa...fategi to Pakistan wale bhi bachane nahi aayenge😂😂😂", "pseudo_human": "@arnav.077 lelii😂😂😂😂😂", "neha7894": "this is what is wrong with you..now u here what to change the whole dynamics of the situation..all the issue was that you were making fun of the sentiments n now u r here making another stupid n totally unrelated video accusing the media.but trust me this time its not funny..", "american_authors1_": "Ye Pakistan waali hai kya?", "mumu_salam_xu": "😂😂😂😂😂😂😂😂", "richbubbles": "What is that watch you are wearing?", "ananya.sen_3979489_": "Omg you’re amazing. Hats off to you !!!", "humairaashfaque1999": "Lol.😂🔥 @mallikadua Ly.💜", "edgability": "💌", "awakenedsouls12": "Indian media.... SUCk it.... slogan achha hai na ?", "joy___007": "Imran Khan k ishq me dimagi santulan khoya!! 15 varshiya moti chatra... 🤣", "dr._divya_kaushik": "@mallikadua sorry but unfollowing you . Apni family ka koi khoya hota border p to ese majak nhi bnate aap , galat cheez Ko support krne wala bhi galat h , being celeb kuch help krni chye unki families ki . Na ki majak udana chye . You have lost all the love and respect today .", "happy_feet_94": "u rock girl !!", "kiki_singhal": "Unfollowing this page. It's getting ridiculous now.", "parsadnaina15july_vp": "Sooooo cute mam 😍❤️ , u r one doll , really 😍❤️😍❤️", "doodlernie": "@aajtak She deserves an open apology from you.. You should not spread false news for a public figure who neither said nor meant anything like what you posted.. What is the point of defaming her?", "getoffyourphonevidhi": "What else do you expect from people who dedicate one hour of their news channel to “Saas Bahu and Saazish”, Fizul ki debates where they all are arguing with no apparent results and also, even if they show news on their channels, it’s about who said what, which also turns out to be unauthentic in the end. 🙄 Indian News Channels really need to do a lot of growing up.", "bipanchie": "Hahaha 😂😂", "iam_rishabhjaiswal": "Ushi bhujhiya m thora chuha marne wala zeher lelo.......", "hey_nidhi": "Adore you for your bravery and for talking sense ❤️", "praachaayy98": "I LOVE HER EVEN MORE NOW! I LOVE YOU MALLLIIKKOOOO CUTUUUU 😂😂❤️ BEAUTY WITH BRAINZ OH MY GYOSH 🙈", "sim_sing": "😂😂😂😂 hillarious", "daffy_soul": "@aajtak gaur see dekhiye is mahila ko", "aroma.kaay": "♥️♥️👏🏼👏🏼", "original_cardboard": "haha... bas karo 😂", "hny.2k19": "Kitni jal gayi teri ..Jese he aaj tak ne asliyat samne layi to 😂😂😂😂 ab to kregi he ye sb harkate Nautanki karne ko", "yaayhoodgirl": "you are not funny at all. laughing at how stupid you are.", "little_detours": "@mallikadua isko andar kardo re baba.. 2 paisa ka comedy karti hai. Ab wo bhi nahi milega🤣🤣", "henykapadia": "Kyuutteessstt @mallikadua 🤪🤪🤤🤤", "shimmerandmuse": "🤣🤣🤣🤣", "farhan_zaidi004": "Heheh", "ayesha_1590": "Too good this is ! Just a slap on @aajtak ak 's face", "curiositypaddle": "Well done😂😂👏👏👏", "zaaer_khan95": "Good slap on the face of godi media", "samreenshabbiir": "😂😂", "supersajal_": "u r savage", "debs_debbiee": "@_fernweh_soul_ look at this moksh how she is making fun on such sensitive issue.. disgusting man !!", "instantimagery": "Perfect example of humour gone totally wrong and perfect example of insensitivity..that compelled @mallikadua to justify and further justify..and she failed miserably, both as a comedienne and as a responsible citizen. Hope you've had your day of hogging the limelight.", "lovequotes465": "You are bloody ass hole", "ashittam2": "🤣🤣🤣🤣🤣🤣🤣epic", "danish.92": "🤣🤣🤣🤣🤣🤣", "hottymaddy": "This is really disgusting @mallikadua . Eating namkeen is not bad, but making fun in such a situation is really sadistic.", "pianikkk": "@aajtak 😂😂😂😂 kaha muh chupaoge bey????", "afreen_8808": "👏👏👏👏👏👏", "p_riaan_ka": "U r freaking awesome.", "shaikh.afrose94": "🤣🤣🤣🤣🤣🙌🏻", "anannya007": "I m just loving this lady more n more 🙌😍", "monmon_2890": "Awesome @mallikadua 👏🏼👏🏼👏🏼🤣", "preetsharan.ml": "🤣🤣🤣🤣👍", "kyubi26": "More power to you gal💪💪", "_m_arvind": "Maybe \"ur\" thoughts shouldn't match with \"ur\" face. #ugly", "iflah_sultan": "😂😂😂😂😂😂😂😂", "aasna_sijapati": "@siya_chandrie", "faiqamateen": "🔥🔥🔥😎🤪😝👍", "malika_malhotra01": "Hahahahhaah....", "tanushri_sharma_27": "So cute 💜❤️😘", "sheikh_hamna_hasan": "😅😅😅", "sohrabkhawas": "Samachar ke bajay Prachar karte hai ..#godimedia #bikawchannel @mallikadua", "bhaktiteckchandani": "Hahahahahahahha", "mitradebasree": "😂😂😂😂😂😂", "flavour_of_awesomess": "Bhukkar aurat", "rasnakohli30": "Hahahahah leli @shefali.guidanceforlife", "harleen_oberoi": "@mallikadua you Rock 🤣🤣🤣", "nehaa897": "U r damn irritating . How can u make jokes on watver happened . Unfollowed", "fr.eddie535": "Teri maa ki chut", "imansi_j": "I am DEAD 😂🤣🤣🤣 @mallikadua", "mansibisht79": "Ur fan I m But mourning for OUR SOLDIERS,who r dying for us is totally different and another level and mourning for just another person who's dying of depression or hunger is totally another level... Plzzzz Mallika I understand what u mean but u stand at point where Uve impact on people.. at least think twice", "ajeetsharma01": "Jali naa ?? 🔥🔥😂😂", "mano_rajkumar": "🤣🤣🤣🤣🤣👌👌👌👌", "bsaritadevi": "😂😂", "zaidisheeri": "😍💛💛💛", "abhipanwar": "@mallikadua Soldiers do their duty for ur safety, for my safety, for our safety. They died while serving us.. They are our family. We all are sad bcz of what happened and andar se kuch karne kan mann karta when something like this happens with our soliders... And i would love to see, will you eat this namkeen n behave in a funny way when someone in ur family like ur father mother or brother dies.. Will you make funny videos at that time?", "akanshyaloshali": "ASStak live- dekhiye kiss desh ka namak Khaati hai @mallikadua Exclusive footage sirf ASSse, I mean Aajtak se", "lunaticbull": "News flash : 40 soldiers martyred and she is eating. Shame!!! In other news Amit shah stated Mandir wahin banayengae 👍🏻", "thakur_abhishek_vishen": "Motiiiiiiiiiii😮😮😮", "amritachatterjee26": "ohh.. i want that pakistani chivda too...", "pokhraj.roy": "@mallikadua Didi, apne Tik Toks kyun nahi ki?", "yuvraj_jaisinghani": "@sharman.shukla HAHAHHAHA", "priyaj42": "Pagal ho gyi h", "aishwarya_anand_99": "@aajtak", "wazedah": "🤣🤣", "_devashi_jain": "How all this is so funny to you! Sickhead! @mallikadua", "mithooahuja": "😂😂😂😂😂😂😂😂👌👌👌", "er.saurabhsingh.ece": "Ma ki chot teri bahn ki lodi kya bolri hai k javan roj marte hai bhn chod randi", "nayab_kanwal01": "😂😂😂😂", "rajnandaaa": "😂😂😂😂😂😂😂", "sonakshi1302": "😂😂😂😂😂😂😂😂😂", "_ishivangit_": "How so stupid? Why so stupid @aajtak", "sniggieboo": "I think you’ve gone too far with your humour Madame. you’ve completely lost it.", "archa_jn": "Too good 🤣😂", "anam.khan1988": "Dhyaan se dekho iss ladki ko jo bharat mein pakistan ka chivda khakar pakistan ko mashhoor kar rahi hai... anti national ho gayi ab to ye...🤪🤪🤪", "anurag__ghosh": "Breaking news:a grocery store caught selling Pakistani namkeen and snacks,and selling it to people who are hungry and anti national and Breaking news 2:all muslims are pakistani (Sarcastically saying this do not take it seriously)", "maniprabha_singh": "🤣🤣🤣🤣", "_chin_j": "Just die .I hope ur esiphagus gets chocked.", "jindalsamridhi": "I love u", "bitterfactor": "🤣", "runswithflyingdolphins.injila": "Ahahaha lit 🔥😂", "keeep_walkingg": "Ye ladki vahi chips khaareli hai jo 2000 ke note main payi jaati hai.", "joshijikibeti": "🤣🤣🤣🤣", "dvjdeepak_official": "🤣🤣🤣🤣", "dhwaniray": "Behna Savage toh aap nikle!", "arishi21": "Kisiki kaise lete hai yeh toh koi apse seekhe @mallikadua", "2qtvartika": "Wtf is this ... They need to make everything a new ... They should try to get ppl the real stuff ... Some real news", "sense.101": "Lol yahan humaray Pakistan mai bhi memes ban rahay. I’m liking it already hehe sath he apne level up kar dia cherry topping hogyi maza agya 😂❤️", "uzimandias_": "🎈😂😂😂😂😂😂", "artistic_diary___": "😂😂😂😂😂😂😂😂😂😂😂😂😂", "fullmoon_himansh": "Maregi tu kamini", "ladkiatrangi": "You go girl!!!!", "y.our_space": "According to media Mallika dua is a deshdrohi now 😂😂😂🤣🤣", "mehwish_hanif1": "Hahaha pakistani chevda.. yr i think haldi rams nimko is best", "_sarvesh_shukla_": "Rakhi is better than u..Atleast apni country k liye koi chutiyapa to nhi bolti", "zeba2616": "🤣🤣", "hashtag.pc": "@aajtak you guys messed with a wrong person this time !! 😂😂😂 @mallikadua 👐👐👐", "curious_jai": "@the_lost_viking_", "sorglos.soul": "😂😂😂😂😂 that was 👌🏻😂😂", "_meghna_chowdhary": "You are hilarious 🔥🔥🔥🔥🔥", "_sharx_f": "@@aajtak", "r_leoman": "Lol best reply to aajtak @mallikadua no-one should mess with this kyot didi", "priyanka.2008singh": "Ab apka pet pakistan bheja jayega...😂", "_s.i.m.r.a_": "You are The Best❤️😂😂", "ambikachitranshi": "Disgusting", "schezreh": "Hahaha your haterzzz are two rupiss people!", "albana_nadeem": "At least unke news kuch toh legit tha aka Maliika Dua 💫😘 hahahaha fuck @aajtak", "prattusha_pooh": "Well done girl! U r tooo cool! Befitting reply to the morons!", "nikhitakini": "😂😂😂😂😂😂", "rashmi_2010": "😂", "mayank.6596": "Breaking news Desi sharab ke saath Pakistani chakna khaati dikhi Mallika Dua..", "ankitainment": "Hhaah", "__.priyanshu": "😱😱😱anti-national😱😱😱", "bushranoor24": "We seriously need to tell these media peeps that their 'art' is no more appreciated (it never was,but no tolerance anymore). Mam you just started the much needed WAR and we all are with you. @mallikadua @aajtak", "aafi_s14": "😂 epic", "aqsahaazra": "Ded😂😂😂", "tvaramehta": "This is too bad!", "radhikasharma_jee": "@aajtak 💩 boht hard news boht hard 💩", "rautpayal": "hahahahahhaahhah mast tha bc", "priyankasahu50": "😁😁😁", "kapil.swaroop": "Haha 😂Love You Loads, give a tight kick in the face of asslickers", "snapchatwali": "🤣🤣🤣🤣🤣🤣🤣🤣", "hridaysonii": "lomllll", "nuzeefa": "😂😂😂😂", "jaydeepdholakia": "Now stop gathering people on your side! You had said it! Stop these things!", "singhsantoshbora____": "Didi watch sources bta dijiye na @mallikadua 😌", "arpita__ghosh20": "Best way to slam 😂 #sassyy", "inayakhan2004": "@raaameenn 'antinational namkeen from pakistan' best", "natashak1379": "😆😆🤣🤣🤣🤣 Oh god what rubbish is this ... #aajtak channel should be banned. Kuch bhi dikha rae hai.", "richie140223": "@isha_sharma05 so u😂", "abeer_imran_khan": "More power to you 🙌", "rishu.baisla": "Hahahahahahah.... #aajtk.. jo sach m aajtak hua vo to dikhate nhi", "shaima.257": "😂", "girl_with_a_hot_beverage": "Love you Mallika 💗🌸", "_tushar__joshi_": "Zayaka india kaaaa.. ✌", "kirti280986": "🤣🤣🤣Loved it", "zzainyy": "Always making us laugh! ❤️", "sujata_sana18": "Paid media k mooh pe tamaacha 😏😏", "shalurana0120": "Dude you're dumb. Lemme unfollow you👎", "aakritigupta06": "🤣🤣🤣🤣", "sakshi_purohit30": "😂😂😂😂 @mallikadua", "_rassasy": "❤️ @mallikadua . You are an inspiration. #badassmallikad", "nvivegan": "Fab !! Love the sarcasm within this video ❤️", "arpitsk": "🤣🤣🤣🤣🤣🤣", "hijj.tipu": "😂😂😂💓💓💓", "drpreetipathak": "😂", "bearilucious": "OMG !!😂😂🤣🤣", "sadia.sarwar191": "❤️❤️❤️", "nikhill_pandey": "@aajtak", "bushrasayeed123": "😂😂", "meghahaha_._": "😂😂😂😂😂😂", "duacakritika": "🤣🤣🤣🤣🤣🤣🤣", "stormapril22": "😝😝😂😂😳", "shugafree_grl": "@mallikadua Namkeen se bani Sansani😂🔥", "emrita_amu": "😂😂😂 you are outstanding without saying a word you say everything", "elisha_eli_": "@aajtak What do u have to say bout this? 😵🙄🤐😂😂😂😂😂", "nikharroy": "Ded", "shmoodzie": "😂😂😂😂😂😂", "deepakshee_dubey": "Lol 😂😂😂😂", "blahnaari": "Hahahahaha 🔥✨", "nikitamishraa": "🤣🤣🤣🤣🤣", "coupleofbakers": "Didi best 🙌", "_nxzu": "@mallikadua I love you so much, screw you aaj Tak!!", "shagufta_m_95": "Exactly 😝😝😝😝", "rayandogra_": "We love u @mallikadua 💛", "gaurav_graw": "@mallikadua aap kuchh jyada tez ni ban rhi ho??", "arthyashasvigupta": "you’re my spirit guide. #nofucksgiven", "puma_rare": "Omg how dares you too eats anti nashnul namkeen , go to pacistan🤣🤣🤣😂😂😂😂", "sneha_cynthia": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣😪😪🤣🤣🤣🤣🤣🤣", "shalinivagge": "Bahut hard", "arvind_singh54": "Hahahahaah chillax @mallikadua", "rushabhkulkarni99": "Aise video banao ..and then blame chutiya aaj Tak .😝😝", "shehlaadnan25": "Lots of love @mallikadua You are so amazing!", "ambrinography": "Haha! This is your India🙊😭", "_gar1ma": "U need to see this.. See what she is eating man.. 😂😂😂@aajtak U have got another piece of news", "sahillicious_": "Queen 😂😂😂😂", "misterghosh": "Hahahahhaga you are the best😂😂😂😂", "vapilkar": "Ahahahahahahahah woman you just did the trolling of the year 😂😂😂", "parvathyo13\nVerified": "Verified", "alisha_purkam": "Haha such a badass 😅😅👏👏👏💋💕", "riichaa0601": "😂😂😂😂", "auditi.dey": "Shocking! 😱😱😱", "aditya_negi18": "Anti-national Kutiya!❤️", "joyyrachel": "Bhaisaab ye to gajab hi ho gya 😂😂", "dr.richa2511": "❤️", "jamshedmanza": "😂", "teen.adda": "Bharat ke dukh ke samay mein @mallikadua ne khayi, namkeen. Unka kehna, sabko namkeen khilao. Ji, haaan sirf @aajtak par yeh khabar AAP tak ham pahuncha rahe hai. Dekhte rahiye, AAJ TAAK SABSEBHADWA", "aakankshagupta201": "😂😂😂👌", "beingaabdi": "😂😂", "heyprabhu_": "I love you @mallikadua", "yusufthesuperman": "Whatever u said uss din usme pizza order wali baat inko buri lag gyi isiliye phat ke flower ho gya h u chill we love u ❤️❤️❤️ @mallikadua", "noaiz_97": "😂😂😂😂😂epic", "samirasshaikh": "Hahahhahha", "mdr_nya": "Savage!!", "akarshanj_": "Hahaha... Iss maasooom se chehre ke peeche kya chupa hai! 😂😂😂", "yugal675": "😂😂😂😂", "salim.shaikh_me": "😂😂😂", "_aree.ba_": "😂😂😂😂", "themehuljoshi": "AajChutiya Channel got butthurt.😂 You go girl!", "aishashaikh_1": "🤣🤣😂", "ruchi18": "😂😂😂😂", "piyali09": "Hahaha😁", "sudiptodhaivat": "@divadevarsha", "singh.harman24": "U nailed it.. go back to ur homeland u have no right to live in India😂😂😂", "_ayesha_haque": "Epic!!! 😂😂😂😂", "navyaa.nanda": "Legit queeennnn💯", "richxaa": "LMFAO", "soniatarun": "🤣🤣🤣🤣🤣", "prashanth_making_music": "Sounds like Avengers theme music! Haha... which avenger would this be?", "theaishwaryasingh": "Epic", "johalrajpreetproductions": "Aajtak : ghoor se dekhiye ye bhujiya kha rai he pakistan ka or tati dekho pakistan me ho gi ya india me ye dekhna baki he agar sarkar kush nahi karti janta ko dekhna padega 🤪🤪", "keshavisethi": "Im just enjoying this now😂", "tanushree_patwa": "@ruchiiiiidadwal Would love to see several episodes now ! Epic series on our bikau media ! Waiting @mallikadua 💓", "arinum_sarabar": "😂😂😂😂", "bollwodstudios": "💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜", "rider_._.007": "@mallikadua 🔥🔥", "abhijith__ahmed": "😘", "sameoldfluff": "Yaaaassss guv'nor u tell 'em", "rachanathimaiah": "🤣🤣🤣🤣🤣", "old_schl06": "Lol 😂", "ramshaali16": "Hahahahahha 😂", "dhwanil.shah1": "@saloni_m21", "shinenamira": "Oh😂", "aireen.qureshi": "😂😂😂😂😂", "kurchiii": "💋💋💋", "the_shrutitrivedi": "Lmfao", "magical_square01": "😂😂😂😂😂", "_laharighosh_": "😂😂😂😂😂😂epic", "ahuja.babita264": "😆😆😆epic", "avantikask": "Omg!!! Gaur see dekho ise... Yehee hai woh", "a__ayan__": "😂😂😂 epic", "kausarr_khan": "@_itsleebukhan_ 😂😂😂😂😂", "_harit__": "😂😂", "rangawalkar": "Green colour ka Pakistani namkeen😂😂😂. Amazing you woman 😂👍", "shivanidaad": "Hahhaaha😹 🙌🏼👏🏼", "_gotn0chill": "Poor aajtak ! 😂😂😂😂😂", "shonashivani19": "Hahahahaha", "listentothewaterfall": "u aunty national why u eat paki namkeem☻", "_shades11": "Dayummnn 😂", "mahawaqar": "😂😂😂😂😂", "nikhilrao5686": "😂😂😂😂....damn man so kyuut creativity", "malvika_chowdhary": "😂😂", "arushigrover_": "Wahhh didi🤣🤣🤣💋💋", "simply_sampi": "ROFL😂😂😂"}