{"__wildxwind__": "No need , we don't depend on you and vise versa , focus on your own stuff and live your own life and it goes for everyone", "hellagood003": "Everybody talking about feminism here, if you aren't a sexual you'd know not to classify it as one. It's a joke for all those people to be offended who teach women that they must serve men. And yes those people exist, they are the ones trafficking women for prostitution, or victim blaming, or the families who don't protect their daughters from abusive husbands. And one more thing is that, the meme sharers who usually talk about being chill n letting go, n the same meme culture that laughs at rape jokes, quid pro quid, global issue jokes get mad at this.", "sarayaaaaar": "@asna_azhar", "yasmeen0403": "🤣🤣🤣👌🏼👌🏼", "nivedeee": "😂😂😂😂😂😂 legit", "rachitbhandari": "@shrishtibhatnagar", "rahul_gd11": "😂😂😂", "_nimishaaaw_": "98% comments – Men getting triggered xD", "sappy_d": "😆😆", "starkid1998": "🔥🔥🔥🔥🔥🔥", "misra6556": "Alfa feminist spotted", "prisin11": "@nishantk12 80-20 rule in practice !!!!", "dilkash.n": "Men will be men... And women will become sluts🤫🤫🤫", "deepveer009": "Perfect. @sleeping_beauty_786", "abhi98u": "......", "anubhab.exe": "This is what propagates a wrong idea about feminism... This gives a hall pass to them to joke about..", "saijall_": "Is that you and your dad's head", "hadiya_dainposh": "Feminism does not mean male bashing. Please stop all this shit.", "kartikay_khanorkar": "Toxic feminism.", "mgtow_archer": "This is horrible", "kmaalii": "@qaramanis", "adeebaghazal": "😂😂🤣", "varnika_khantwal_": "Wow this comment is filled up with men just getting aggressive and if someone is trying to be defend this post then also those \"men\" are getting personal with them like saying \"tera baap ko bhi aise serve karte hoge\" \"tera bhai behench*d ye dekhega toh tujhe marega\" well then comments like these prove that this post is just for them! Now coming back to the post if mallika would have posted that we should stop eating tires coz it's not good none of you would feel attacked why because you don't eat tires anyway but when she posted a picture like this for men who thing they are the raja of some place why do all the men in the comment section getting so traumatized? Chill guys we are not coming and cutting your heads anyway stop worrying already! Also people are saying that this is violence and not funny hahaha well welcome to our world where till now starting from the infants to older women gets raped where even still dowry DO EXIST where even today women's consent isn't important for \"men\" out there and if they say no they suffer from acid attack and im sure in sab mein prabhu ki bhakti toh nahi h. Literally we have been suffering from decades and still kept quite and which is also not easy and but here some woman posted a poc not even for whole mardjaat but those men who think women should serve kyu tum sabki male ego hurt hogayi sabke liye toh nahi tha toh sabki kyu jali! Aur haan post aspi mein koi aake karne nahi wali aisa hamare saath bhi mazak ho raha h everyday aurto pe toh kabse jokes bante aa rahe h!", "namanbhatia_332": "Back to the kitchen", "huzaifa4real": "Chutiya", "mossad7777": "Chutiya Fake femenist @hariakash", "hima_soni": "Hahaha too good", "the_cannislupus": "ArjunRampal with beard?", "ronit_motiwale": "oH lOok aT mE I aM sO fUnNy", "_.pure.sinner_": "This isn't how u serve *anyone*,omg mallika go learn some basic etiquette😑. #thisisnotfeminism👎", "piyush_d_more": "That's why people don't take feminism seriously!", "neeleshchandwani2": "NOW GO BACK TO KITCHEN😩", "suhrwardyhafsah": "HAHAHAH @sambilal25 @laddukimama", "vallarik": "I second you. 👏", "ofcoznot": "A must.", "_kaankshita_ghosh_": "People who are commenting on feminism should first know about the meaning of pun.. guys plz try to understand the deep meaning lies in it...", "shrutiddddddd": "This is a slap on the faces of those (men+women) who say \" women must serve men and stick to the kitchen\" . There you go babies, eat your daddies.", "themodernisticaloha": "🤩🤩🤩", "shreyasomani08": "@__k.b___", "vedasreevarma": "Literal🔥", "shrutigrover.juno": "😂😂😂 G A Z A B 😂😂😂", "teakapoor": "@didn.stagram", "palak._.arora": "Right kind of serve", "emptinessprevails": "Ultimate", "saurabh__raturi": "What kind of message you are trying to convey here with this? Seems like your mum did the same to your father.", "happy_drug_": "Yea yea😂", "vidushi.razdan": "Misandry!", "thesillyscribbler": "Serve kar diya", "shom_pacino": "The reason we have feminazis around not feminists !!!!", "littlesugar769": "Stupid as the most. That's a painting of John, who came to proclaim the coming on Earth of The Almighty... HAVE RESPECT !!", "mighty_inklings": "❤️", "themidnightjasmine": "😭", "nupoor_kiran": "@aishwaryyyyyya", "chaudharygulshan_": "Only thing i wish rn is that \"Kash ye logic your mother applied before you were even born \" atleast one of the SjW idiot kam hota", "ravneet.kaur.322": "Hahaha😂", "mr_maru": "Nakli feminist", "shandilya390": "Pathetic", "passwordismusic": "You need help, psycho.", "animesh.karmakar.79": "As the painting portrays, beheading a human being and carrying it on a show plate, and then feeling proud for that. Wow! Just imagine the other way around, and a male celebrity posting it, Indian media, the pseudo feminists and the so called independent actresses of your country picking off the meat of that particular guy, like some scavenger. There! Painted a picture for you there, didn't I?", "stronghead01": "As usual she will keep posting bullshit !! Oh sorry, that's her own shit..😂", "ilaxmee": "✌✌💪", "amala_paulprakash": "😂😂😂😂😂", "pranjals_30": "A picture never has a tagline. It is how you interpret it. Looking at the piece you know it belongs to the Victorian Era where women were seen as a weaker sex. In my opinion, and in yours everyone has an own interpretation and there is a reason it is called art. Discussing over it or arguing is futile. The artist left it to your imagination and in every being it differs for a reason. Flip the coin. See it. It is all about subjectivity. It is not how someone put the tagline, it is whether u related. That is the beauty of art as we know it. That is Mallika Dua's perspective maybe the girls who are reposting it have different stories to support their perspective, what do we know? It is different for everyone. Sometimes you don't wait for education to step in and tell you the difference. The experiences speak louder to you so does the aggresion. Can you justify their story? No. But you can justify yours so respect your opinion and others too.", "prince_jose_02": "Agar ladke isme gender reverse karke post kare to aajayengi yeh 'misogyny' bolkr...Kya chutiyaap hai bhai 🤦🤦", "iamshreyasgowda": "Please serve properly", "annal0g": "@helloninar genius 💁🏻‍♀️", "parmaresan": "@juliabaune", "megha1_3": "Report this post..... it's disgusting", "krishna.malladi": "valar doeheris? 😂", "blissful_excerpts": "Valar Dohaeris ✌", "praptilumen": "@_anchal__", "zubair__aalvi": "dont forget uh have men tht is ur dad bro or husband", "divzihere": "@charuthedoc yeh lo", "vicky_01001": "This is reality what this picture shows that 2000years ago a woman seduced a king to get a prophet killed because he opened his mouth and told the crowd that the king had an unnatural relationship with the dancer and her mother(who was also wife of king's elder brother). Mark 6:21-29... A woman's lust and greed for power killed a prophet that day, an innocent blood", "ramya.r2253": "I think its feminism where the lady is the rape victim and the man's head with her is the rapist....this should be the fate of all the rapists", "_rajputb0y": "Bdw isko blue tick mila kaise..?? Hai kaun ye..😂😂😂", "pizzaaursoda": "Offensive! Meme ke naam pe kuch bhi thodi chalta hai.", "iss.x_": "😂😂😂", "ronit_ghosh": "Imagine their roles reversed. Would you upload it ? No? Then you're promoting MISANDRY not FEMINISM. @mallikadua", "viv.per": "People like you don't de-serve men", "annu_0109": "🙌🏼", "24lilacskies": "This is why third wave feminism is a shipwreck 😒..May God save your soul", "the._brat": "@____trupti 😂", "mullabushra": "@loganiser", "himani.023": "This is disgusting dude on the name of feminism you can't promote violence against men 😡😡😡", "himarawat5": "Pagal hai Kya @mallikadua satak gyi kaam nai milrA toh", "amandeep0703": "😂😂😂👏", "deepikabasra": "@sohighlove111", "suvi.gya": "Report this bullshit. Daughter of such a nice man. Such shame", "sanitizerrrrrrrrrr": "😂😂😂😂😂😂", "mehwisssssh_": "@duaaa_ali", "anmol_chatur": "She gotta wash that plate at the end 😝", "t_for_twinkle_": "😂😂", "indu__insta": "that's what that victim had to do to your rapist father's advances !!", "akulsyal": "@rtwal88", "santa__isnt__real": "Not sexist at all", "poulo_mi": "@farhadeebaa yeah", "juhisatra03": "@darshs14 @fukat.bipu", "nikhil_agni_": "Moti ko koi dhokha dia hy😂😂😂", "sidharth_1709": "@nancylsingh @kashishlamba relatable ?", "smriti_._nair": "Trying :) 😂 @gauri_mhaske @taninerurkar @mahima.binoj @ap_krushna_m @alisha_ibushe13", "impratikprtk": "Ohh dear, just pray that one day your mother won’t serve your dad like this...", "shahfeni": "😛👌🏻", "_vaishnavi_tikhe": "🔥", "iamsmikie": "😒😒😒😒😒", "mister__bhardwaj": "I wonder what would be the comments if people in this painting were swapped 🤣", "nam.ver.998": "@anshikak", "zaarakhani": "Exactly like that😂 @ahk1959", "little_lavish_xd": "This picture depicts everything that's wrong with feminism. These so called social activists / woke feminists or more like woke misogynists need to calm their tits the fuck down. Sorry but it's about time that they are called out like this. Don't get offended next time a man says or does something like this. You should know you are pretty much the reason why women suffer through so much because your whole idea of feminism is bringing men down. You are an influencer for voicing what? Treating your dad, brother or friend like this? Stand up for equality not misandry. @arghyadeep_", "little_vampyre": "@seek888 agar kisi baat pe mujhe hasi aai toh what in the effing hell is your problem. Who the hell are you to call me 'chutiya' . Shows your manners and upbringing!", "thesimran30": "This is not what feminism means!!!!!", "yourleftkidney": "LMAO", "khanologist": "That’s John the Baptist head in a platter", "ananyaaaa._": "@danksheikh", "pratyushapeddinti": "😂😂😂😂😂", "ritvik_chitram": "I'm actually glad to see that dark humor is socially acceptable again 💯", "jaykay_18k": "God... People that's a pun, a joke nothing more. It's actually empowering, see through ages this quote \"women should serve men\" has been going on because it was the typical stereotype . Now when the times changing it is just a way of changing that perception. It's a joke. Offended feminists please broaden your view. Understand.", "wipashwee": "@grishma_ojha", "vaibhav_so_hot": "😂🤣😂", "ikrahul_": "Why only fat and ugly women promote FEMINISM ?? Someone give them a D !", "nikkithakur24": "Superb👍", "impeccablewacko": "Perfect illustration", "rutujagaikwad._": "@sakshinirbhavane_6 @ruthhulk @srushti._.15", "missworldupdate": "So funny 😂😂😂😂😂😂😂😂😂🙌", "ummaraamin": "@zapfatima 😂", "nayo.nnaise": "Kaafi gender equality Mallika Didi 😛👌", "man_is_hahahahaha": "Pun gone right😂😂🔥", "notawriterjustalover": "❤️", "hrsumukh": "With a dad like Vinod Dua, what else can you expect from this pseudo fuck? 😂", "rhea__dey": "Yeaaaah 🙌", "_.itsk": "Just flip the word and image of men and women. And then let's see feminazi quirk.", "lyricgun": "The most stupid post on social media.", "zaria_sikander": "Irritating mess 😒", "starspangledtights": "Shameful", "__young_._thug_.07": "Yaaar ye sare tatti Suar feminist India Mai paida kyunn hote hain! Feminism is not misandry! Creep creatures ☠", "khataime": "Lol at all the mad little boys", "srishtishekhar_": "This is why third wave feminism is nothing but trash", "adityasharma4": "It's sad that I had to witness a post like this coming for a personality like you. Its absolutely nonsense and ridiculous! FYI this is not what feminism is about, do check your source again; or you lose your credibility. Thanks!", "vxpxl": "We need our heads okay. (Ik this is a joke lol)", "swatisingh.jpg": "for what reason exactly ????????????? 🙄", "arpita_agnihotri": "Xxactly 😍", "sunnyysideup\nVerified": "Verified", "sixpath_uchiha_sasuke": "@mallikadua wants to become a housemaid and then murder the entire males to satisfy her sadistic desires. Lol", "aacharya_pooja": "Lolz", "thegypsyqueen_": "👏👏", "thebeardlessbro": "Fan following is in great amount that means you are an influencer....there's a responsibility on you to spread positivity....yaha to mallika dua ka hagna hi band nahi ho raha .....good .....aur waise ye tumlog ka trap sahi hai ... offensive post karo ... controversy me faso aur famous...bikhari saale ..", "barotjii": "Serve your father...and behead his neck and again m saying serve your father's bloody neck to some kind of pervert hotel, you waiter!...", "jhanroshni": "🖤🔥🔥", "nidhi.z.19": "Why would you do that ...I looked up to you, now i don't.. Did you even think about how this will affect the REAL FEMINISTS...the ones who want equality and not superiority... I think you were a bad choice to look up to", "sanjana_bedral": "😂 @zah99", "pritybhargava": "😂🤣 awesome", "ishu_finsta": "If a guy posted this with a women's head on it,whole feminism species would have gone mad and been after this lyf🤦‍♂️🤦‍♂️", "rushadsinha": "Chup be randi", "the_rajput_guy___": "Chal bhen ki lawdi", "eeespidy": "Da real offended dishwasher", "_kl12pp": "FEMINISTS ARE MISANDRISTS.", "amritavlogs": "Loving ❤️", "nimishamodi04": "Hahahah😂 @tanisha__modi", "lekhasureka70": "😂", "poohacc": "Excuse me this is NOT what feminism stands for", "mrsmegalomaniac": "Men: oppress women for 200000 years, put themself on top of everything, literally get away with everything and benefit, because dick owner, rape/enslave women, domesticate them like animals, deprive them of human rights, education, degrade them, brainwash women into believing that womens purpose in life is popping babies out of their vagina and to serve their husbands. //// Person makes a meme as analogy to the ideal that women supposed to serve men. /// People \"ajehduxbdisns HOW DARE YOU being so hateful, you have human rights since like 50 ish years, you are allowed to go to school, f*cking feminsts aheudbdjdb man haters\". True. Women should stop hating men. They should start treating men, the way men treated and still treat women today - so that it will literally be irrelevant what they point out or say. And once men start to complain about the injustice they face in everyday life, dumb women and men can come forward and explain to them, that they are just sooooo hateful after being deprived of any social value.", "___magnifico": "Immature af.", "naziyawahid": "@mohammad_tawheedd", "albernard": "🖕", "azad_hun_main": "I think She smoked Some weed before posting it....Such a cheap woman with cheap thinking!!! Kya kare bhai Freedom of expression jo mila hai 💀😂", "apsbawa25": "Now this is sexsist", "bhavyaa31": "All the support to youu.🌟", "peter.halsey.7": "https://twitter.com/nishkin21/status/1052538983132143618", "mr_raghuwansh": "Feminism Ki Maa Ch*d Di \" BADE ARAAM SE \" 👏", "shvshvnk": "\"Take a joke, be a man.\" - Feminists.", "b.a.w.a.a.l": "Back to the kitchen bitch", "sanghamitrapaul": "Haha", "shivme": "@mallikadua u r hillarious..", "trippedfocus._": "Dont do thiss", "actuallyaryan": "Wtf", "savekar_prachi": "Hahahahaha killing 🔥😂👌😘", "shalin_deval": "Ah! The fake feminism 🙂", "learamaswamy": "No one here is an art history student lol", "prawin_kachhawa23": "I don't think this is a cool content btw😂😂", "rishu_sinha": "@bellykanungo @priyanshurathore96 😂", "atulnavadiya": "Where is my sandwich??", "whateverart_lmao": "Just a women giving head 💀💀", "bhat_saahab": "@mysoor_hudugi You should see this 😂", "pragatichavan_4": "👏😅 @marianviolet", "kav.jaa": "Bro!", "travelling_with_a_fork": "Itni nafrat????", "sunandagautam_": "Why this ...why spread or perpetuate derogatory thoughts...I dont agree", "rakshitha.venkatram": "😂😂😂😂💟💟", "a.d.i.t_96": "Yedi hai kya....... Chutiya", "latika.gaba": "😆👏🏻👏🏻", "maymaybosss": "@mallikadua do you have a boyfriend? If you have somehow? Are you serving him?", "nikitar.sharma": "OMG guys you need to work on you sences .. it's a sarcastic comment. Work on your self and try to understand this.", "iammonikachoudhary": "😂😂😂", "the_rau1728": "You are a dumb twat", "sakshtag": "😂😂😂😂😂", "ayushkolhe": "Immature", "harshiilll": "Tatti ...make a male bollywood hero make post some shit like this...a head of a women served by a man......see the consequnses and drama....peace✌", "renu__ravi": "Cheers🍷", "___sahai": "How stupid this is hate it", "jindal.shruti18": "🤪🤪", "mihir_chaudhary777": "hahah enjoyed it right? Because of dumb people like you feminism is now ignored by most of the male population :)", "yukizuki919": "😂", "shrut_makde": "If these are the type of posts feminists have to offer.. the their mentality is no different than that of a criminal's!", "utkrshs_": "Matlab femenism ke naam pe hagg dogi kya?", "daisy.sahasi": "Very imature !!!!!", "__anvitt": "Kidhar bhi Hagg Deti hai aajkal Tum Jaisi Ladkiyaan 🤣🤣🤣🔥🔥", "ramya2888": "@poorvamirani @cherisoni Made my day😂", "sherryoscope": "Hahahaha! Bang bang!"}