{"_rishi_rk_": "What provoke u to start a courier.... Lots of love from NASIK dii and u r my first impression for starting channel... This is my brothers account bt still asking... Love love💓💓💓💓", "deepasanjeevjoshi": "💜", "shivangi._.gulati": "Best birthday gifts both have given to each other?", "nitinthakur0926": "How do you feel ki aap ki dost itni Badhi you tuber ban gye hai?", "tanyashetty59": "i bet you wont DM me", "shrishh_tea": "do you guys till fight?", "raj_sharma9827": "💥👑💥👑💥", "__k_hope": "💜 for bts", "sunshine___and___rainbows": "💜", "sunshine.gal": "Have you'll for fun setup your fun with weird quirky boys?? 😜", "_gunjandogra": "Top from???", "_gargimene_": "[\"💜\"] Hi @sejalkumar1195 ! Did you guys ever plan for a trip? Was it successful? We wanna know about it. Also if it was successful then, what were your best memories for the trip that you're going to treasure for life. #sejalspeaks #youtube #sejalkumar 💜💜", "niva_tambat": "💜💜", "anshikamirchandani": "Have you both ever had a crush on the same guy ?", "madhurima_manna": "💜", "_anahata.mordekar_": "Have you stolen anything from any of us?😂", "alok.jena.906": "Wow", "heartandsoulpayno": "Tell us about that one funny incident in school", "iampalakbansal": "Hi sejal I want to make a video on your life... Would u let me ???", "mukeshsavla": "Beautiful 👌", "bxi.18_02": "Which country would ull like to visit???", "sugar_hugs85": "How did your best friends helped you go through your breakup .Please some I need to get over him", "sravya_suravarjhula": "How do u find flat in Mumbai any website??", "neujnation": "West Bengal meet up plan love from dinaj pur", "kavery_5972": "things you miss doing together 💜", "kashish_2520": "Hii sejal💕 we know you as a youtuber. What does your bffs do. Just wanna know. @sejalkumar1195 💥", "swiftee__13": "Whats ur craziest memory from school days...i really love you sejal u r amazing😍", "tanvi.tk": "Share your embarrassed memory of either school or college day", "_nikita_2209": "Ik that you've made your career in fashion n I wanna do fashion merchandising like I wanna be a fashion buyer so can you advise me the education process n also everything?!😅❤️❤️😘", "preethiix_": "Will u come to singapore??", "hazra_ara": "One of the most memorable incident..?", "akshatakulkarni_": "How do you overcome low self esteem? Loads of love. ❤️", "varsha_ramesh__": "Best party you guys can never forget? And drunk experiences? @sejalkumar1195 😂", "_anamika10_": "Will you someday come to Assam plzzz?", "deekshaa8": "I have seen you sans make-up in so many videos and vlogs. Does it take slight courage to face the camera like that since there are hardly any YouTubers who come without makeup? Or is it that you know (like all of us know) that you are so damn prettyyyy! ❤️", "the_insta_bae": "How you guys met? What advise u will give for a good friendship?❤️", "bhavya._.narang": "Where is your top from?", "shine.like.a.star_._": "How did you met 🍆could not find purple heart", "_addybee_": "What is favourite song and choreography of BTS? Borahae Sejal 💜💜💜", "mon__banik": "How someone can be so positive??love u sejal..❤", "anisamaity": "LoveLove sejal 💗😍", "travel_the_universe22": "Did you ever think that Sejal would be famous?", "sweet_whiskey__": "Do you trust her completely??", "_i.am.lost__": "Have you guys ever bunked your classes...???", "x_the_sexiest_cyclone_x": "Which is more better Mumbai or Delhi? When are you planning a meet up in Mumbai?love❤🌍", "indianbanglesstore": "Check my page to buy bangles set", "kayalvizhi826": "Your 12th percentage ??", "mamtajangid27": "Style Exchange with Bff", "__anjalimishra": "What will happen if your best friend bitches about you to your boyfriend!", "aayyuuuusshiiiii": "Do a Meetup in Bombay dude !! Now you're in Bombay only naaa", "tanvi_20132017": "Do you have a boyfriend or atleast any crush (not celeb) after @mohakpapola", "avni.xoxo": "Howwzz bboommbbaay???? I wanna ask ki aapke itne acche dost kyu hei", "geetikaakula": "💜💜💜", "deeksha_r_shetty_": "💜", "the__pooja__3456": "💕", "thedustylustre": "Have you guys made out? Ever?", "rashikashish": "Cutiesss❤️❤️❤️❤️", "mr_rastogi__": "😘😘😘💕💝", "jaabilikoribilli": "How do u get this much energy", "aliya___musthafa": "💜", "thelionessworld": "Who far you both can go for each other in friendship", "shahi_praneeta": "When do you think sejal is ready to date?", "x_a.u.r.o.r.a_x": "How does it feel being the youth role model? Love you loads sejal💜", "__s_i_m_r_a_n__s_a_s_a_n": "How do you guys have a touch now?", "payalgupta200": "💜", "pavani_sai_2704": "How did u know dat she was d kind of friend you could bond with?", "payal_ked": "Most embarrassing moment of each other in school", "prachi___panchal": "When you first time meet ?", "moksha_shah27": "Sejal !!how do you manage to keep up with your Delhi friends even after shifting to Mumbai? 💜 Like are y’all still in the “spare no detail” zone ?", "polls._.everyday": "Polls in my story", "lil_miss_cuttiee": "💜 do a challenge?", "gandhismit": "Who amongst your friends have changed after your stardom on YouTube? @sejalkumar1195", "dj_jahnavi": "Most embarrassing or awkward moment with fans????", "amy_amrin": "What is the most weirdest thing you have done together? @sejalkumar1195", "__sonu__priv09": "Best things about each other that kept your friendship intact for so long?big fan💕", "anvehehehe": "Why did you wanted to shift mumbai . Because even delhi is a developed state so there is no talk of that . Then what made you come to Mumbai. Please answer this", "private_acc_roger": "Koi mujhey v follow karlo yaar", "fact_.quotes": "A video again with @mohakpapola please!?", "_mi.nion_": "What's the most unforgettable thing yet was so much fun that happened in your school days?! :p", "srishti_ahuja": "How does adulting feels? And now wat u like more? Living with parents or alone? Delhi or Mumbai?", "prateeksha_t._.h_": "💜", "kritika8760": "What changes do you observe in your life after shifting to mumbai?? #reply🔥🔥🔥😍😍😍😍", "naam_hai_shatabdi": "Which is the most irritating habit of your friend which annoy you till today 😁( for both)", "__clivi__": "💜💜", "avani.zzz": "Plssssss share ur skincare routine", "googlywoosh": "Favorite bunking memory", "shilpadasofficial": "Did you and your friends have a huge ever?", "fab.g": "How’s Mumbai life and the rains ... do you love it ? And Delhi/Mumbai??@sejalkumar1195", "aakanksha_choudhari": "Cuties", "thameeza_farhath": "Tanesha celebrity crush?", "devrahul_20": "School me sbse jada pit ta kon tha", "vibha_s_r": "💜", "minisanthosh14677": "Most expensive gift You've gifted each other ?❤️", "shreya_prashansa": "For how long have you guys know each other?", "xoxo17193": "The incident in your school which you want to forget?#asksejal", "mommytravelstories": "Sejal post always rock. I am budding travel content creator out my own personal travel experience across world. Please do visit my page and follow me for genuine reviews. Thanks", "reshmi_varma": "When r u planning to do meet & greet in mumbai? Awating ❤️", "_pooja.s.s": "💜", "ishh_anii": "💜", "shete4177": "U r so so so so so pretty", "shivi_jais_": "Any jealous moment? Or ever cried for each other?", "megzway": "💜", "vineetha0230": "How exciting does living on your own in Mumbai feel ?! 😍", "deepthilakshmeesh": "who is you and your friend's recent crush ? 😁", "bhakti_rajde24": "Which are that most expensive Things that you regret buying??and love your all videos and love you lots💗💗💗❤️❤️❤️🤗🤗🤗🤗", "khushishastri": "Which are ua go to places to eat n shop in mumbai?", "bhuvanasingh5": "Are u still in love with @mohakpapola .......... I want this ans plzzzzzzzzzzz reply", "iamnakulchhabra": "Hey sejal! From where did you bought that fake areca palm... can you pls share the details", "krishnagupta1175": "💜", "lucky.me._._._": "One pet peeve of Sejal??", "actor_navya__": "Did u have any bad nightmares (like a man with a gun or a clown giving you an evil smile)?", "ava_twinkletoes": "Describe some best memories spent with ur frnds??", "oneday9290": "If we want to send you gift where and how can we?❤️❤️ (I am a girl dont worry please not asking to know your address or any creepy stuff) ✨ @sejalkumar1195", "shivathmika3005": "Have you guys done something together because of which you got kicked out of a place?", "dishasinha2006": "The Memorable school day?", "thesarcalect": "Share your best and worst drunk stories 💜", "tabayami_": "Which country have been the best for you till now?", "neena_emil": "Do you have a code language when you dont want any one to understand what you both are talking about😁", "_anjali_.mishra_": "Smile💓", "mahak.mittal25": "Craziest thing @sejalkumar1195 has done", "tulli.xoxo": "Hyy.. Agar kabhi aapme se koi kisi ek friend ka name ghar pe bata k kuch aur karne chalay jaye and parents us friend ko call kare for cross inquiry than kese bacha lete the ek dusre ko?? Lots of Love from Ahmedabad♥️", "pushpanjalixjha": "💜", "princy_mishra": "💜💜💜💜💜💜", "eye_flames": "@swastikamukherjee13 @anwesha24 for a minute I thought it was you beside Sejal :)", "_sumbool_": "Did you guys fought? Which was your biggest fight?", "shivalikanth": "The happiest memory together?", "ayeechuchu": "What is your most embarrassing school memory ?", "___precious___life___": "💜", "prathibareddy_21": "What is the most craziest thing you have done together in school??", "datelessgrin": "So cute ♥️♥️♥️", "nimitha_s_nair": "Hah you ever backbitched about someone??", "abigail_neethi": "What is Tanesha working as now @sejalkumar1195", "thisissamakhya": "💜 Have you had a constant bestfriend in every situation of your life? If yes, what makes you and your bestfriend count on each other through all thicks and thins. @sejalkumar1195 You are one of the best fashion bloggers ever!💖", "mariia_.xo": "What about khyati😢", "__meridaaa__": "What is the craziest thing both of you have done together ??", "priv.archisha_kalra": "❤", "sakshi.upadhyay06": "What is the most embarrassing thing about sejal when she is drunk?", "07preksha_": "What is the most adventures thing u have done together?", "_tanisha_roy_": "How do you keep up the same relationship with your bestfriends after shifting to a different city? @sejalkumar1195 @khyatikalra09", "latif_almas": "what is naughtiest thing you guys ever done ?", "_herlifesjournal": "Is the blogging industry saturated now, for anyone who is entering into the fashion and lifestyle world, specifically?", "rakshyaapanta": "What's your favourite pastime together?", "proamica": "👏", "ranii_._": "What do you miss about Delhi ? But also one thing that u love about Mumbai ? @sejalkumar1195", "jashh.__": "The most mischievous task u two have performed?? 😍😍", "tandonkirti": "What is the most annoying thing in your best friend according to you.", "sreelekha_rc": "What's the experience of living alone in ur own way and making decisions by ua self. Any life lessons??", "shanaya.___.irani": "Have you ever liked the same guy or had a crush on the same classmate?", "britneydoesntlikeyou": "IT WAS SO NICE MEETING YALL THAT DAY❤️❤️❤️❤️❤️❤️❤️", "leyjguard": "Your best memory of school with them", "yajurvi.2072": "💜", "ii.adaa.ii": "Why is the most embarrassing thing u all have done together", "niveditamurkute": "Hey besties❤️ my question is that what are 3 things that you people do when you are together for sure and what is your peoples fav song to dance on", "mohitsingh_13": "So cute You Both are looking Hasne wali 😜😜 But You Are Looking stuning as always.😍😍😍😍😍", "pateldharmin74": "Sejliiiiiiiii😘😘😘😘😘😘", "12aravind12": "Do you have any lover? If not will you marry a Hyderabad guy?", "priti_puri123": "First impression of both", "anushree334": "What is the weirdest thing about both of u?????💜💜💜💜", "k_ranawat_20": "How you people met?", "rose_rob7": "Which sejal do you like , sejal with boyfriend or single sejal??", "sonalishukla5058": "can you do a segment on you tube.....where you look insta profile of your followers.... and suggest them...what kind of style suit them?.........@sejalkumar1195", "hennajesingh": "What is the most expensive thing you've picked up from a hotel room (you know how I mean)? 😁", "shreshapriv": "😍😍😍😍", "the_jumping_mind": "North campus ki best memory and damm tom uncle is so overrated and bro i am in srcc too eco hons 💕", "manisha_reddy1": "Who’s your favourite kpop member in blackpink???", "rope_98765432": "What is your height ?! ;)", "archi_5317": "QUESTION ALERT-When was the first time you think you became best friends??! Was there a specific moment or day?", "candycane_missy1123": "💜", "nikiitanair": "Do you know BTS?", "adiiiiii_1705": "💜", "aishwarya_dharewa": "💜", "afnan.316": "Are you bestfriends jealous of your other friends?", "anitha.singh28": "Has sejal changed after becoming super chic beauty influencer and how? #asksejal", "manurana_100": "Describe any fight you guys had (if any)", "soniyakukreja242": "What were ur most embarrassed n emotional moments together?", "meziapaintsthese": "Do u follow David dobrik? As in watch his vlogs? ......highly recommended", "ojas.sekhri": "What made you get good marks in maths ? @sejalkumar1195", "deathly_girl_682": "What is the funniest thing that you guys did and then lied about it??", "heleena_mercy": "What's the most embarrassing and funny situation you guys faced together? @sejalkumar1195", "plingpriya": "What is that one major change in have seen in Sejal from school???", "khyatsssss": "When did Sejal have her first kiss ?Was it awkward 😋", "avnimehta08": "How have you guys managed to remain in friends after school? Doesn’t it get difficult as everyone is busy in their own life. #AskSejal", "waseema07": "How can I help a friend who is having a hard day when/if I am not having a good day and I'm upset as well?? Loadz of love sejal♥️", "__harshitha0456__": "Want kind of makeover would you give your friend??", "janemelitadsouza": "💜", "pratichi_sahoo": "What is the worst fight you had with your best friends? And it was about what?", "tanviism": "Who is your current bestfriend?", "adhikarismriti0804": "💜", "tanishaaaprabhu": "What were your first impressions of each other?", "go_fall_to_heaven": "What spirit animal do u wanna describe for each other😬😬", "nishita_24": "What is the most embarrassing moment u guys had in school??", "dhanya.h8": "Wt is best unforgettable embarrassing moments with ur friends", "husain_simra": "Plz do some good content now it's so random and boring @sejalkumar1195", "rabiaarhum": "🔥", "_mysticmoon__": "How did u convince ur parents for moving out ?", "3d_ki_tu": "when are you coming galleria dobara 🙄...", "gunnika__arora": "Why so cute", "_.puresoul_8519._": "Ye melody itni chocolatey kyu hai?", "aryeahhhhh": "What is the one quality about your best friend you love the most or what is the one thing about them you really admire?", "just.shloka_": "What was your first impression of each other ???@sejalkumar1195", "__.thedramaqueen.__": "Do \"I style by bff \" challenge video on a bugdet with the Mumbai street markets !", "afreenkbegum": "Do ur friends get you well while filming a video ..,like u want a shot with something spl effect do they coordinate with you!!??", "pratibha.aliu": "From which college u did ur graduation", "welcome_to.my_profile": "Pretty 😍😍", "vishruta_kohli": "When was your first fight ? ♥️", "varshachauhan_": "@sejalkumar1195 does your besties ever thought of starting their YouTube channel as well", "saaz96": "What was khyati’s first reaction when you told her that you are moving to Mumbai?🙈", "alekhya_682": "Did you guy ever had a serious fight???", "often_misspelled": "Did you ever crush on the same person at the sams time ?", "surabhi_singh30": "You both were backbenchers or firstbenchers?? Alsoo luvv uhhh❤", "elexyir": "💜", "shrutii_b": "Have u ever did a sneak out together???😂❤️@sejalkumar1195", "smileuidiot": "💜💜", "_khushboo_0408": "What's the most funny and entertaining thing you all actually did? 😆", "ritu.waghmare": "Best funniest memory with a teacher❤️😘", "eshitadiwan": "Whats ur best memory together? #questuons", "kalyaniborole182": "A moment from teenage that you all did together and was so funny.plz plz Plz Plz ansssswwweeeerr. And also when are you keeping a meet and greet as you are finally in Mumbai!! Love your videos! ❤️❤️and your a really cute soul and a good inspiration! Keep going girllll!!", "fashion_peopleandplaces": "Cuties", "_divyanshisingh": "Where is khyati though? She's amazing 😍", "pratiksha19813": "Best drunk memory?", "radhika0411": "How do you deal with kpop obsession? 💜", "akshathaapai": "What makes you stick together with your school friends? When life is so bussyy these days...and everyone's busy doing their own thing...!", "sejal.mishraa": "Hy sejal this side :) we share the same name and same skin tone too, so some tips for brown skin girls :) like what you do you your skin?", "myrapuri": "When was your first kiss and how did you tell ur friends(like ur besties) about it??", "una66b": "Want to know from where did you get your top ?? 😬😘", "kritika0195": "I think tanesha is always trying you to cut your hair short... Why is that? 😝", "thesmalltownblogger": "Haha. Can't wait!", "niveditabanjara": "💜 did you guys like same guy 😂😂??", "rehet_21": "Either of you ever received a drunk call/text and or ever made a call to someone ?", "maru_rashi_": "How did u guys meet each other:when,where and how?", "charooranjan": "Who is the mote likeable one ❤", "himanshikhaneja": "So eager for your replies @sejalkumar1195 💃💃", "dipti_____nayak": "Tell us some of yours deepest darkest secrets😘", "gomaxtry": "💜", "meghaggarwal_": "How different is sejal in reel life and real life?", "anxskaa": "What is the most embarrassing thing u have done together in public? ❤️love u. #asksejal", "_suhaniiii_._": "💜", "srishtidoshi": "Groups favourite brunch place?", "jamieemathew": "💜which syllabus were you in school?@sejalkumar1195 btw im an army too💜💜🌏", "himanshu0866": "Best drunk night memory", "_thesoulfulcloud": "How was going your life? You are the best fashion blogger and I love you so much you are prettiest seju🙈🙈❤️❤️💋💋💋", "therakeshtalks": "👌👌👌", "troublemaker_since96": "💜", "prettyy.liarr": "Most embarrassing moment with each other or because of each other ❤️", "ankita.venu": "What are your dream vacations", "rishika_sagar_": "How did u ppl feel when u were separated to two different colleges after your schooling?", "harleen_kaur_juneja": "Biggest fight you guys had? Or you ever had one?", "_.khushijain__": "Tell us the 3 best things about your friends!❤️", "iam.vidhi": "Favourite Bollywood actor and actress?", "thatissiri": "What does your friend do for a living? @sejalkumar1195", "harsimran2191": "What was the most awkward or embarrassing moment in school life?", "nishthaaa02": "Did you guys ever have a fight over a guy?? 😅", "shruti13__": "Cutiessss😻💓", "_x.aastha.x_": "What is the most embarrassing thing that Sejal did to impress a guy? @sejalkumar1195 PS: love ya!💕 Are u planning on getting a dog!???", "mrudulalalala": "Do you believe in long distance friendship? Also you are an inspiration! Iloveyou!💖", "lakshita_0119": "When, where, how and why u both meet!", "tushar.443": "Smil1😍👌", "shivika.13": "💜💜💜💜💜💜💜BTS forever n ever..love ya pls reply", "ssharmaxxvii": "..💜", "the.bonkers.gal": "Who says sorry first when you guys fight? How long can you guys stay without talking?? PS: You guys are friendship goalss😍😍❤️", "__deeeppzzz__": "what is the funniest thing that you guys have done together???? Lots of love sejal mam❤ you are an inspiration for us🤗❤", "hippie_junkiegirl_": "💜", "atrugupta": "💜", "mimansha_lwanl": "Who's your bias in bts💜?", "kartikkhanna7": "What percentage of a time do you usually spend sleeping at a party? : P", "_pragatiisingh": "How do manage to message or call each other everytime. Are there thoughts like why i call her first or such", "ruchimhatre": "Your favourite place in Mumbai?", "arpitashetye": "What would you choose school friends or college friends", "shubh_radia": "How about meetup in mumbai?", "a.ffi": "💜", "avni.vaidya": "Saath me khaan Jana psnd kroge n Kon Kon aur jaega...btw luv u n ur videos ❤️❤️🤙", "naital_0702": "U look so beautiful dear♥️♥️♥️♥️.... keep shining n.. love u 🔥", "khyatikalra09": "Eya and I look gorgeous 🙃 @miniondoesthings", "soniadahiya6": "👍", "trisha.debbarma": "❤️", "ruchikr0905": "School life best or embarassing memory", "kaaaveri15": "Did she ever confess about her feelings to her crush??💕✨", "sheethal_._._": "💜", "suhani_chugh13": "Have you ever got rid of a toxic frnd together", "vanshikaa._21": "Best memories together❤🌺 @sejalkumar1195", "chhaviiisingh": "If you guys could switch places what would you do for the other person?", "tanz_z": "What is the most funniest prank you have played on someone or each other??", "shruti.soni18": "💜", "anthany96": "❤️❤️❤️", "iamprateekthenge": "So cute you are sejal♥️♥️♥️♥️💕💕💕❤️❤️❤️", "gauri_sood30": "💜", "jaaeeeiiii": "I've seen all your videos can't wait for the new one!! 💜💜also", "_chubby_chicks__": "😂😂I have seen... that one....my ques is what's the best thing in sejal let's see what's ur bff will answer", "shubhi_214": "Pls come to dehradun 😢😢"}