{"celebs_fashion_updatess": "Wow", "tannvi_riar": "It's like sisters......🙈🙈🙈", "kasish1448": "❤️❤️❤️❤️", "sakshi__bhosale": "Are you an illuminati???", "nilanjan.roy.397": "So beautiful", "raji_padmasekhar": "At the day and age of online dating, what is your take on casual sex? I'm non judgmental as a person, but I see many of my friends getting attached and hurt in the process. What's the psychological aspect of it? Is it good for our society or not? Love u @sejalkumar1195 😄❤", "asna8farooqui": "Is that even ur mom ? Looks like your sister 😝", "lishakhungar": "Girl ur mom is very pretty.", "mishthijaggi": "Hey Sejal love ur videos my question for ur mom is how do u know if the contraception ur using is ok or not ?", "abhidivyam": "Looks like urmom", "kritisanonlove1": "Your mom needs to drop her skincare routine 😍❤️(please do it non sponsored one)", "bdiv74": "You and your mom look like sisters😮", "vidhi___x___": "Why nowadays sex has become so important for everyone?", "doglovvers": "Pretty ladies..", "tickle_star.1": "❤️❤️❤️", "we_shoppie": "❤️❤️❤️ Hey there.. Am a budding enterpreneur. Follow me for some cool online stopping stuff. Show some love💖..C u there", "anushree395": "Is that ur mother!!??..OMG!!😍😍❤️❤️", "aadyaamadhu": "Your mom is gorgeous 😍😍😍", "_michiko_06": "What age is correct for it ? And how to face parents when they come to know about it ? Related to us", "kunirani": "Mehendi laga keh rakna doli sajha keh rakna", "__saloniiii__30": "What if you are suffering from PCOS can you have sex?? is it safe ??", "drop_me_up": "Congratulations ..,. Have a happy married life 💝", "tishka_tamman": "Like mom💞like daughter😘", "gampu21": "Aunty looks like your younger sister 💜", "karnikashrii": "Please follow me for beautiful pictures like this❤️", "mounikaragini": "Ohhhh my God I thought that's your friend....your mom is just♥️♥️♥️", "_weichh": "What is non verbal consent and how does it work and how to not mistake some things as consent?", "swekxya": "@jenisha.khatri abi herna kya didi bahini type jasto sachi mai", "_.gauraa_d": "Damn it !!!! You both look just wowww😍😍🔥🔥", "deeps_2806": "When a guy has sex with a lady without consent and she happens to conceive what would be the impact on the baby? Does this affect the very formation of the baby?", "cyphergaurav": "❤️", "celestial.nymph007": "Plz follow me for such beautiful pictures😍❤️", "theshampson": "What's wrong with your eyes😅", "pagal_sati_savitri": "Is sex as trivial as it is interpreted in todays age? With tinder and all people really have started treating it as if its nothing. Now among all these people I feel as if I'm being a prude cuz to me sex is something which is supposed to be special(atleast the first time). I don't want to do it just fr the sake of it. I'm not against anyone who's thoughts don't aling with mine,each to his own.", "dezire.s": "Is giving up against him count as a consent? @sejalkumar1195", "ms_.congeaniality": "It's a common notion among most teenagers that it's ok to have sexual intercourse irrespective of age as long as there is presence of consent but are they any cons biologically for indulging in early sex? Especially for women and also, Is there any prescribed or preferable age to start sexual intercourse?", "bornbold_3": "Hey Sejal, love your work. Here’s a question When should parents sit kids down for that all-important \"birds and bees\" talk? Do you think that majority of the parents in our society needs sex education so that they can pass it on to their kids? Do you think that sex education is a very crucial part to talk between kids and parents when they are the age of 14-16 yrs ?", "srijaneebiswas": "When your mom looks like your elder sister!! 😍", "hippo_doodle": "U both look like sister❤️❤️", "megha__jagadeesh": "For a moment I was shocked to recognize your mom! My goodness! She looks so young! This could be real santoor ad", "sportyniharika_singh": "😍 lovely, whn my mom saw this pic she said both r sister kya and i said no mumma she's sejal mother and she was like 😅😅oh woww 😘😘 gorgeous", "ritzspacealert": "Looks like sisters.....So pretty ❤️", "_.anirudha": "Talk about hymen and how it breaks etc @sejalkumar1195", "kanchangupta19": "Your mother's body is more toned than yours. She looks slimmer than you, kind of inspiring.", "arxxn.a": "I know this isn’t really related to sex but how do i make my brown parents ok with the idea of me dating at 17 years old.I live in Singapore and all my other friends’ parents are ok with the idea and even with their boyfriends coming over.It just sucks how I can’t have it the same way as them:/", "mayel763": "@sejalkumar1195 is it BaD to have sex frequently which can lead to bleeding?", "m_o_n_i_k_a_222": "Gorgeous💞", "iirachitaii": "Aunty looks so cute omg I can’t believe she is your mother 🙈", "nammi210": "Thoughts on sex before marriage?", "aakarshita._.kaur": "Your mom is so pretty❤️", "tuhina_haldar": "U look like sisters😍😍❤️", "kav.fashion": "Hello Kav fashion is all about new trends and casual western style with a hit of glam. Would like to collaborate🌸 Please have a look. Team Kav.fashion  https://instagram.com/kav.fashion?igshid=8xoshjuu97th", "nishta.official": "Ufffff your mom is slayinggggg totally", "khoobsuratsisters": "You and your mom look so cute in matching lehenga 😍❤️", "shipra.gupta.2822": "How much sex is important in a married life? Please answer this question I need answer for it.", "xxtroublesome": "What age is it okay to start having sex?", "_soul__searcher__": "What's the reason behind postcoital heavy bleeding and burning during urination?", "thetravelingcuisine": "Woah!", "anjuuuu23": "💣", "thatlawyerchick_": "1. Can you please tell us about technical consent? 2. Also there are situations in which the person ends up consenting under pressure (lots of persuasion) but it feels wrong in the long run. How do you deal with the emotional impact of this?", "amazing_annu": "Gosh!!! Is she ur mom 😍😍😍", "thedailypixels": "#sejalkishaadi 😁😁", "smaker101": "what your mother think you are virgin or not? and is it really a hurdle to lose virginity for marriage?", "arpita.durga": "Your mumma looks like your elder sis..wowww", "jayanti_jj_062": "You both look sisters 😍😍", "geetika9058": "You both look like sisters😍@sejalkumar1195", "navya__deepika": "#Momdaughthergoals 💛", "anisamaity": "Sooo amazing... It's great.. The mehandi design is sooo beautiful... Love u sejal 💖🌠💛⚡😍", "easilychaotic": "What if a girl gets pregnant before her marriage?", "girl_interrupted09": "How to have safe sex?", "lassi221204": "Is it ok to have sex during periods?", "pallavibatraofficial": "https://youtu.be/ghpmjo0kiSE for all the latest #Mehndi / #Mehendi designs pls watch this video! #linkinbio", "ra_nam_rina": "Perfect duo 😍", "bippity_bop": "What are your mother's opinions on pre marital sex? Does she approve of it if there are consenting adults involved?", "monisha_bachina": "What are the Precautions need to be taken for a person who is doing sex for the first time to avoid pregnancy??? Btw you too are cute af😍😘😘", "mudraaa_": "How important is it to have a conversation about sex with parents? Especially in a country like ours where sex is a taboo to talk about and kids aren't given proper sex-ed in schools. And what do you think is the ideal age when parents should talk about it with their kids?", "nehashrikant_15": "You both look like sisters ! ❤️", "maahiblessed": "Is that your mom 😍😍😍😍", "pranee9993": "👌", "aftab.nizamani13": "So beautiful", "prachivarshney": "Ur mom💕💕💕💕💕💕💕", "_pooh_23_": "Must say ... Your mom looks much prettier than you😘😘😍😍", "melaniepereiraa": "💛💛💛", "_nid_hi_nan": "My question how will you convince your parents to marry a boy who is a house husband. Can you strike a conversation on gender equality with your mom..", "saraan676": "Is it okay to lose virginity before getting married?", "shruti16296": "When your mom looks like your elder sister💛", "aaaayush.i": "Initially I didn't realize it's your mother! She looks like your sister or someone of your age!😍❤️😁", "vogue_aish": "I feel eew thinking about sex, I don't know how it would happen in future, but yaaa right now busy in career but later on I have to anytime soon or later once am settled 🙈", "nandzzni": "she is your mom or sister.......doesn't look like your mom", "khurana.gauri": "How to make parents understand the point about marital rape", "siy7811": "Your mom look like ur older sis", "lavina_dua": "Such a cute picture ❤️", "ananyashaarma": "After marriage or before marriage?", "sanjana_1196_": "Omg your mom's super sexy!!@sejalkumar1195", "kukuyoko_1610": "You two legit look like sistersss👀💕😍", "sanaseries": "💓💓", "bumpystories": "How is that your mom is prettier than you😁😃", "an_imaginative_creature": "Aunty looks so damn young and adorable ❤❤❤", "rajrajeshwari1": "Aunty😘", "anisha_ramesh": "You guys looks like twins!", "rkhi__kumari": "❤️❤️❤️😍", "leann_xyz": "Like mom like daughter 🖤", "sharvani0407": "What are few of the best ways to stay safe- medically, physically and psychologically, while being sexually active?", "nitika.gupta26": "Your mom is so beautiful in and out .... amazing doctor and amazing daughter", "siyaaaaaaaaaaaxx": "What to do if there is an issue of unwanted pregnancy?", "garima_tintin": "Okay wait!! Is she your mother!!! I need to rub my eyes.. she's giving you a serious competition gal 😍😍😍", "_suvarna.chowdary_": "U both look lovey", "the_medionimalist92": "My my your mum is toooo young for a mum. So Sisterssssss.♥️", "aneeshasharma": "#MomandMe @sejalkumar1195 having a low sex drive is normal? How to manage id your partner has a high sex drive? I totally love your mom. So cool you guys❤️", "hey_i_am_diya": "Both are looking gorgeous💖", "__sidhant___singh": "You Look So Gorgeous❤️😍✌️", "ar.chana82325": "My du se hu ramjs clg e side se", "saumyaa.18": "What is the right age of having sex?", "manvii2305": "aapki.mom se unke clinic mil saakte hai ?? kaha par hai any details pls.thanks", "aakrutiii._": "Both of you are soooo prettyyy😍😍😍💯", "riaashah10": "You both look so preety together #twinning", "nehacat.08": "Is it safe to shift your periods dates??", "ashleenhora": "We put so much emphasis when teaching sexual consent - just say \"NO\"... When actually in other parts of life and society we actually find very hard to say no. If someone invites us to a party that we don't wanna go to. We just say we are busy or I cant or I'm sick. We'll come up with so many excuses. Cuz as people we hate saying no to other people. We fear being rejected and also we hate rejecting other people. So if in non sexual context we find it really hard to say no! Than why are we teaching people to just say NO in sexual context? That doesn't make sense and its really difficult to do.", "komalsuthar_16": "You and your mum always look beautiful together 💗", "ruhi.chopra": "Is losing virginity before marriage a sin? Is it something that must not be done before you’re married? Well, Indian Society thinks so. Please discuss about this topic.", "_a_r_i_n_a_16___": "Pretty ladies💓", "nas_jahan_": "How to talk to an extremely conservative family about having a bf? 😭", "hedwig_hpn": "#question Do you gain weight after having sex ( observed and heard from friends )? If yes can regular workout help in getting the body back in shape?", "neha_vanwara": "U r seriously copy of ur mom😍", "sxg211": "What is the ideal age to have sex ?", "_divyyaa._": "😍", "aakriti_goel_gupta": "After a c sec delivery, termination of next pregnancy is not possible is true?", "preksha_vashisht": "You and your mom are looking like sisters!!", "mystical_blossoms13": "Beautiful Ladies😍💖", "pure_punjabiness": "Consent in sex is utmost important .", "priyanshi7208": "Is it ok to get brown discharge for 3-4 days after sex especially when your doing it after breck of half a month @sejalkumar1195", "chinm_aymittal": "Is thigh squeezing masturbation unhealthy or does it have any side effects? What if we do it in excess?", "gargi__das": "Is it ok to have sex during periods?", "ravishingtwinkle": "Raising awareness about cervical cancer prevention vaccine which all women should get before getting sexually active. How can we raise more awarness about it ? How is it possible to talk more to partner as well as parents about sexual hygiene , sexual disease prevention , need for physical intimacy as a extreme important factor in marriage.", "llomayhs__": "you guys look like sisters, fuck, what's your mom ka secret yaa", "payal.kulkarni": "Is it that a girl's urge to have sex reduces over time?How to strike a balance for a healthy married life when a husband and wife do no agree to a certain frequency ?", "siya___110": "😍😍😍", "sh._.reyaa": "Ur mom visuals are no joke😍", "hudasid": "Your mum look so young😍", "she_izza_med_gurl33": "Oh God !!! She is so damn fit yarr , b'ful sisters😊😁😂😘", "kriti_cize": "Sorry but here I love your mum more than you", "swayamjaiswal17": "💛💛💛💛💛💛💛", "ishika.barui": "❤️❤️❤️💛💛💛💛💛💛", "ostrich371": "Hi I would like my identity to be private. Im 17 and he tries to make me comfortable and then says you don't trust me?", "je_suis_aarti": "♥️", "akshikaa_": "Looking pretty 😍😍", "laughterandcake": "Mumma looks like didi here !!! 😍", "sandeep_verma10": "Aree tum itni jldi shadi q krni ja ri ho😅", "pikku_gupta": "So fit Mama😘", "theproudpearlian": "What if a girl does sex during her periods?", "diyanah16": "Your mom looks so young. And you both are looking beautiful!!!💋❤️", "sona061098": "Damm ur Mom❤️", "notimeforbulshit": "@sejalkumar1195 I have heard a lot that if you had sex with someone and doesn’t do sex for like 6 months/years, then the other partner will not be able to know whether you are virgin or not??or maybe it will be difficult for him to figure it out whether you’ve done it before..please reply😐", "vidz_77": "Auntyy lookss soo young.n pretty...😍😍😍❤️❤️ ..it feels lk u two r sisters 🥰🥰", "beautiful.pictures2054": "What kind of birth control method do you recommend ?", "princy_2898": "Starting a conversation on this topic with parents is so awkward , and there are parents with old thinking , they not even feel shy but also stop us to talk about it openly. So there is awkwardness on both sides. How do we deal with that?", "shrivastavashruti199": "Does not having sex with someone show we don't trust them", "__shruti_divekar__": "Both look awesome❤️😍🔥🔥😊😘", "thekoalaiss": "Is ipill save?", "aarzoo_dubey": "Your mom", "patandar": "The yellow bees 💕🙊", "sharanyaashanker": "Literally, no DNA tests required!!❤❤✨", "zia__zainab": "Is loosing virginity a bad thing??????", "meharktr": "What if someone is suffering from pcod and is sexually active ,is there any chance of getting prego ? Also is exercise enough to deal with pcod? Shredding weight is the key they say 🤷🏼‍♀️", "anjanakubasad": "Is 1st time painful", "_komaljha22": "All forms of protection, I don't think people are aware about different forms of protection.", "sumit_2912": "🔥🔥+✨💥=@sejalkumar1195", "nish_175": "Both of you look soooo stunning❤️❤️❤️", "mansa39": "Ur mom 😍😍😍😍", "_s__tudio_pr00mm": "Beauty runs in the family. True Happiness echoes in the clicks ❤️❤️❤️", "gaikwad_pooja": "Mom is looking hot 🔥❤️", "officialpreetisingh": "Pretty", "gags.gur": "Hi...my self Gargi Sharma ..I am married from last 3.5 years .but mujhe abhi bhi pain hota hai .I don't know why", "banarasi_ldki": "OMG your Mom is looking so young.... Even you look like her sister 😍😍😍😍😍 she should share her secret...❤️❤️", "missgodsbest": "How does your mom stay so young. Flat belly and good skin. I'm in awe of her.", "varrshahalkatti": "Your mom looks younger than you Sejal👌😍", "deepika.das.08": "adorable💕💕", "diaryofanaveragegirl14": "Ur mom is looking like ur sister..", "abhishekrudolf": "Pretty ladies 😍😍 😊", "wo_me_hoo": "Aww you look beautiful and your mom is so fit #santoorMom", "_shivaneesharma": "Agr aap virgin h to kbhi age ka sex pr effect pdta h? I mean if we get married at 27 or 28 thn biometric koi problems ho skti h ??", "monika1.singh88": ",=//%%% bb n", "iamspoorthi_singer": "Like mom, like daughter💓😇", "vibhutimehta11": "You both look like sisters @sejalkumar1195", "nilikasah": "What kind of precautions are required after marraige? Like protection or pills and pills frequency", "sachinrps1208": "Mummy accha lag rahi h sejal se ..", "the_real_sharmistha": "\"SEX\" not only a taboo in India bt around the world as well...Wht do u thnk tht ths topic so conservative to talk about???...ND people just brag about giving sex education in schools or colleges...bt teachers themselves skip the topics in classes about reproduction me related topics whch creates curiosity among boys ND girls...wht r ur views on it....plsss reply", "nityakashyap1997": "Hey @sejalkumar1195 1. I want to ask that what are the safest days in our menstural cycle to have sex without using precautions (like condoms) to not get pregnant? 2. Also I wanna know that is it safe to have sex without using any precautions?", "manya_barnwal": "Is the pain bearable during sex for the first time? Is there any kind of a sign if m having a lot of pain for the first time? There is another question related to personal hygiene..is shaving the pubic hairs good for us or not?...also you both mom nd daughter r looking so beautiful..lots of love😍😍😘", "sanya.nehwal": "Can mastrubatation break your virginity?", "sagunkarkey1999": "😍😍😍 best pic of the day @sejalkumar1195", "sanshritadubey_": "You guys look like sisters!❤️🤗😍", "thurimakeup": "She looks like your sister 😱❤️", "ab.valencia4": "Why is wearing sexy clothes considered as an automatic consent to sex for some people? Why do some assume that sexier clothes means you’re interested......!?", "jriddhi_99_9": "She is looking your sister 😍😂🔥😍😍", "damsel_debarati": "She looks like your elder sister, you have competition at home girl😍", "sharma.aarti138": "Your mom looks beautiful...❤️", "shopaholic_alien": "Omg! Mom hai ya didi?? Aunty is looking super hot😍", "sharanyaa.9": "Pretty gurls🌻💛💛", "somya_rishi_": "@sejalkumar1195 Isme daughter kon hai aur mummy kon!!!!!😮😮😮😮😍😍 Di you two look ravishing!!!!😊", "sarvagun_somepun": "Oh my gawwddd....ur mum looks so youngg...I mean when I first saw this post I was like.. she looks like sejal's age...u look like sisterss..💖", "mahima_jain_1999": "What a hot mom🔥😍", "petoo_ladki": "How safe are contraceptive pills? Or those unwanted-72 and all", "dolly.dcuteangel": "Ur mom💟", "pritha_aash": "Absolutely love your me and mom series. Despite the taboo, you're taking up really important topics. Knowledge is power. This is one if the reasons I totally respect this channel so much more. Not pure entertainment but knowledge", "bhuvesh_dhiman": "Mom's insta?", "shubhikagarg_25": "What's the preferable age of sex? Please put up this question ?", "mahibakshiofficial": "These pictures are the cutest thing on internet today!!!! 😍", "sheels_scp": "Howwwwww??? Looking like sisters of same age ❤️😍... Treasure this pic...it's beyond beautiful!!!", "mansi_palande": "Aunty looks so pretty😍🔥", "deepshikha_bharali_": "❤️❤️❤️❤️", "smmu03": "Didi can you parcel me your gown from winters wedding outfit or any lehenga bcoz my birthday is coming 19 march i know your answer is yes bcoz you have many many dresses and you are two kind reply me i give you my address", "bh_mani23": "Seriously.. Are you pregnant?", "__tanusri_roy__": "Haveing sex once in a week is good or bad?or if its bad then what kind of prb we have to face?btw i love u soo much..you are a true inspiration..♥️♥️♥️♥️", "tasnim_nahin_": "Im sorry but your mom's looking than you 😍 omg... (Both of you are pretty. Love you 😍😘)", "therealpriyam": "Your mom is super cool😍..", "samidhasinghh\nVerified": "Verified", "manjushree.kadaba.ajjavara": "Very pretty and beautiful twinning❣️😘😍", "janhavi.joshi.33": "Shit your mom legit looks like your sister!😮", "hsethi_005": "There are so many questions regarding is sex safe during menstruation and and how to talk with parents without any hesitation @sejalkumar1195", "inveiglebypriyanka": "Check out our page for super gorgeous outfits 👍", "libnirojan": "U n ur mom are looking beautiful...", "chauhan.susmita25": "Its hard to believe that shez ur mother 😍😍", "roshikagupta1603": "Since you are at home and your home looks so cool..please do a home tour video", "gatha_29": "Your mom is so so cool!!😘😘♥️♥️@sejalkumar1195 lots of love ❤️❤️❤️", "avantikasirohi": "Your mom is super hot👍🏻", "ankita_gup12": "You guys like sisters ❤️❤️", "justinjoseph_1368": "Beautiful", "ankit_bhatia976": "😍", "vats_tanuja": "Your mom look soooooooo young ❤️❤️❤️❤️ omg 😍", "ayeshaasii": "A mother who looks like ur sister ❤️", "fashion.in.budget.01": "Sex during periods?", "aahanasaxena143": "nyc mehndi 💛", "daisy_das.18": "When is the female body ready for sex?", "aaak_hi": "Pretty pretty ✨", "khushi_p21": "What things you need to make sure before losing your virginity?", "subha_sarangi": "How should a parent educate their child about sex?", "nehatxalxo": "Twins ❤️❤️ #mommydaughtergoals", "_______jyothi_______": "Ur parents version of sex education", "_ishanaaaaa_": "Your mom looks like your sister", "snehasritisawaiyan": "Who is she.? Your sis.? 😝😝 m not gonna believe if u say she is ur mom... No one will...", "shraddha_srivastva": "What happens if someone had sex during periods?", "hipsiphurrayy": "Casual sex", "vaibhavi.gaur": "You’re literally my twin @sejalkumar1195", "nehasinghkurba": "Coolest mother daughter🔥", "nais2301": "Like Mother Like Daughter!❤️ both soo elegant!!😍", "m_a_h_i_49": "Like mother like daughter💓💓", "engtipi__": "Lovely💛", "nikki_kalola": "I don't want to have sex... Is it totally okay?", "artphraseahead": "Dude you guys look like sisters", "yogita790": "Haha... It's difficult to judge who is more adorable here 😍😍", "moona_shahzad": "Stunners 🔥", "life_as_a_brownie": "Woww I can’t believe that’s your mom.. Look like Twins ♥️", "_pehchaan": "The question would be: Is it possible for males to know that you have had sex already and that you are not having it for the first time or that you are having it for the first time. Is it possible to detect that you are a first timer, or is it just a myth!", "mhansepi": "Wee", "anushreebajpai": "Sex before marriage.... your opinion ? #MomandMe"}