{"lostgirl1___1": "@ashnaaaaaa15 #ashnaasharma Nam ki ladki us chat ko leak kri boyslockerroom group ki chat jabki khud bi maje le rhi thi tabi to bhag gyi insta band krk logo ne bhi Bola naa ki tu b to thi Bakayda group me foto bhejke khudke or dusro ke. maje le rhi thi ! Han vo group me khud bhi thi pr ss dalke sbko badnam KR gyi jisme uski b bji huyi chat pics hain gandi Vali.. LEKIN khud bachi baithi hai !! !! how ? WE ARE GIRLS TOO BUT NOT SUPPORT THIS BCOZ SOME INNOCENT ONE BOY SUICIDED IN THIS MATTER.", "debanjan._": "What about the girl's version of chats??? That are rolling out.", "rajan_gopawat": "I Love You 🌹", "zodiac_signzzz444": "Shame👏😭", "anshchoudharyyy": "The boy died of false allegation and now she is not making any video as if nothing happend. If she thinks that it's not her business. Then i want you guys to answer me why even you are following her(i am not a follower anymore) why she don't care when females do such things. She is an influencer aur iske crowd ko wahi dikhega to boys locker room pr hua, false allegation mein mar gaya vo ladka uska hisab kaun krega. Kab tak wait krogey jab tak tumhare ghar mein nahi hoga aisa? Stop following wuch hypocrite influencers. Give me an answer why there is no outrage now. By no mean i am supporting locker room act. Not even against anything. But hum ladko ki zindagi ki koi value nahi hai kya? We all aee rapist? Hum ghatia he soch leke paida hotey hai? Hum isi layak hain kya? Jawab do. Ye to jawab degi nahi tum log he do at least", "i_am_mr_thakur": "I am speechless @sejalkumar1195 . Just wake up dude and stop criticizing boys because of bunch of damn stupid teenagers. Alot worse is being done by girls now a days (for refrence you can visit any meme page around instagram and read out comments ) Requesting you to check the facts first and then react . Stop making it an issue related to gender , its humanity and its their moral value that lacks .", "sassy_suns": "Please make video on girls lockers room chat. These girls talking same things about boys.", "thelazyguy26": "@sejalkumar1195 absolutely agree with what you said! I would also like to add that, we as a society need to evolve. It’s high time that we consider all genders as equals which appreciating the differences.", "swapzs": "Abhi tiktok wale joker ham ko sikh denge🤣🤣🤣🤣", "dslr_wale_guy": "Well do you know about girls locker room?", "___.s.a.c.h.i.n.___": "Glad that you spoke about it ...but also it would be nice if u also talk about a similar thing among girls where they talk bout different girls n boys n body shame them...n also bout manav singh who was falsely alleged of rapping her where as she wasn't having proofs of the same.n in depression n trauma manav singh took a very hard step n gave his life.if you are raising voice on a single incident thats totally not fair.u r influencer if you want to raise voice then raise voice on every topic maam@sejalkumar1195", "arushimalhotra2004": "Well spoken and so so important💕"}