{"_nandinis898_": "What do you do for a living and how u earn money plds", "chloe.kapoor": "You’re so gorgeousssss", "_jahnavi22": "Do you earn from YouTube? If yes,then how much? @sejalkumar1195", "raisa____trivedii": "Would you smash or pass Justin bieber ??", "keri_naa": "@sejalkumar1195 what is or was your favourite hair length", "pagle_mountaineer": "How to measure the density of core of a dying star.?", "girishaa__": "How was ur journey from ur first video to dis with 400+ subscribers.. Did u ever imagine u will reach to heights that u r on today", "bariasamizaidi12": "BIG Fan PLEASE REPLY TO ANY OF MY QUESTIONSS @sejalkumar1195", "ishaa_mishaa": "😍❤️", "khushisah_": "❤❤❤❤", "bysammishii": "Amazing 😍😍😍", "oopsarewesorry": "WHAT IS YOUR YOUTUBE EARNING", "deepika_vaghela": "Are you going to be a YouTuber forever ? Or planning to do something else. My other question is how you manage to ignore haters? My other question is are you a foodie ? And if yes then how you are so thin.", "poddar1782": "So beauti looking", "still2travel": "soo beautiful!", "pooja__sahu29": "Mast dress", "shivanginichari": "Simply mesmerizing😘❤️", "vasudha_xoxo": "Do you face problems when you started blogging??", "drhusnazarakhan": "Love the all black ❤️", "the.fashion.curve": "As a fashion influencer I really look up-to you for inspiration. I want to know what make you go so effortless and so subtle in every look you carry? Also please guide us through blogging tips. I am one among the start-ups. Love, madhurima ❤", "prerana_pamkar": "@sejalkumar1195 #asksejal how to convince yourself to start YouTube without being afraid of the hate already?", "vivek_yadavvv": "@sejalkumar1195 #asksejal if u want to dance with a youtuber who would it be?", "super_cool_vishu": "❤❤", "jn._shanaya": "Where do see urself in the next 5 years?@sejalkumar1195", "manju_din": "Teach us on how to get as popular as you !", "aparnayadav_26": "Do you think youtube can be your source of income in a long run? SOMETHING like a permanent job? BTW you're amazing, I love your work and passion.😍 #asksejal", "satleenkaur": "😘😍😍😍😘", "soumyacs13": "Tips & tricks to become successful youtuber?? @sejalkumar1195", "tanayaborgaonkar": "What's been your worst vlog experience?", "festoon.n": "Your latest enemyyy???", "dazzlingdiuna": "Who is your brother from another mother? Share a crazy story.", "janhavi_srinivas": "Will u ever do a collaboration with koyal.....", "_taken.over.by.wine_": "Who was ur first boyfriend and at the age of what??!! #asksejal", "khyatimathur16": "How much do you make through YouTube?", "harshita_pawani": "Some basic tips for blogging", "harshithaharii": "Tips to start blogging/vlogging and how to convince parents that people earn through it . Since they only say is it is not a secured one", "rashidatinwala240": "Q+:+", "__wordsofheart_": "Are you a trained singer? Or you just naturally sing that well?? 😍😍😍😍😗😗😗😗", "palak_panchala": "Love your videos....", "deekshaaa.x": "Are you still dating mohak?", "vedanti_3010": "What's ur fitness routine and fav quote ??", "jitteryjazz": "So pretty", "rrrraaaannnn123": "@sejalkumar1195 who is your fashion inspiration?", "anushka___saha": "HOW DID U GET THE IDEA OF BLOGGING?", "vishakha_cv": "Who is your favourite youtuber and why?", "arushiii_07": "Describe your friendship with @komalpandeyofficial", "therealkritigandotra": "Oh no!!", "jhanavi_makhijani": "share some tips for being a successful youtuber, give some tips how to start a channel @sejalkumar1195 ❤", "priiyankaaaa": "Where do you see yourself in 6 years? #AskSejal ♥️", "harshi_singh_23": "#asksejal", "_medha______": "What are your future plans, like what do you wanna do next ? What is your diet plan?", "raji_khosa": "OMG very hot", "dubiasubba": "What made you choose YouTube as your career? And who is your inspiration? #AskSejal", "leena_.pawar": "Your 10 th grades", "aish0309": "You are great by the way my question is what is your favourite thing to do is when you are bored?", "gastronomical_cravings": "How difficult or easy was it to choose an offbeat career like YouTube? Since in India not many parents are supportive of blogging as a full time career, what were your parents reaction when you first told them?", "charuisnotonfire": "Healthy relationship advice? #asksejal", "nikitha.bhatt": "How to be a successful youtuber like you!? Share us some tips!! You are my inspiration 💕 and I love you so much ❤️", "akshatakulkarni_": "How do you overcome low self esteem? #asksejal", "tapolnicky": "who shoots your videos indoor and outdoor?", "richh918": "How did you develop confidence to start up with your first vdeo on YouTube?", "20sindiangirl": "Do you think full time youtube can get you the sufficient monetary support for our day- to- day lives?", "_pritijainn": "What do you prefer most high waisted jeans or low waisted jeans?", "_happy_traveller_": "Tell us about how u get sponsorships for ur travels, in detail.. like would love to know how it works.. nothing negative.. n the dress looks superb.", "khadija_mohammed1901": "and ya current winter skincare routine", "ankitakaushik1006": "You did a cover of fetish and Havana. That was awesome are you a selenator or camilan what do you think about selenas style ? Must reply to me sejal @sejalkumar1195 love you", "pankhurikanodia25": "Can you tell about how to earn money online? That is safe and some pocket money for students!!", "anugraha.mathew": "I'm a school going student and literally have no time for skincare. Could u please tell me the simplest ways of taking care of my skin? And u have a great voice ❤", "priya__87": "Favourite brand for clothing,s hoes and bags???", "aneesha_2415": "The worst moment in my life", "13vaibhavi": "Sejal do you know how to cook proper Indian food?? @sejalkumar1195 #asksejal", "minal_k4": "Some tips for growing hair since u too are growing them 💁@sejalkumar1195", "_adhya_shetty_": "Have you ever been bullied?? If do u have tips???", "debz_fashionista": "When are you planning to get married?", "_disha.kothari_": "If u had one day left to live 💫 what would u do first ❣️??", "nitiishhh": "Are you single?😁😅", "ushma_97": "Did you ever have an \"I'm worthless\" phase? And if so how did you overcome it and become as confident as you are today?", "tinamytra": "Tell us about your 'Popxo' audition. Because many of us are eager to know it.❤ Your audition was awesome. And I wonder why they didn't take you.", "vichitranaaari": "Did you take a training in western singing? Because you're insanely good at it! All your covers are beyond amazing.❤ You sounded mellifluous in the cover of Havana."}