{"khushiarora2002": "Do pre board marks matter???@_trupz.thiii_ i am also suffering with this problem ..😫😬", "poulomi__roy": "Cute", "aishwarya026": "In one of your videos you told us to finish our syllabus before pre-boards, no matter what. Otherwise we'll end up in a bad situation. Well, I'm in that bad situation. Any tips?", "castelino_anthea": "Why do they prolong it for such a long duration", "cupckakes880": "Hi sejal you are perfect!!!!!! In which subject did you get worst marks? Love u....", "salonieee": "Mani this picture is so cool! Hahah 👌🏾", "salonibhagia": "Is the cut off for SRCC high?", "neha657gupta": "Have you ever failed in any subject in any class???", "malika_mujahid_9": "What have you learned from your life till now?", "_kritika_khurana": "Hi @sejalkumar1195 my question is how can stress eating be avoided around this time ?....also did you experienced any bizarre things like this while preparing for your boards ❤❤❤", "mr__n_a_i_d_u": "Excelent capture", "namenotknown_": "Pllzzzzzz", "nishatanjum__": "My @simran_pahal23", "mishthaa._": "How does u prepared for boards.....love u loads .....Ur biggest fan🔥🔥", "thestylechair": "The perfect retake on Simran❤️❤️❤️", "ourexternalworld": "@sejalkumar1195 living the dream life, Karan Johar has spoilt us all with such dreams! *sigh*", "archi_patel16": "How much did you score in your 10th?", "shraddha_kumarr": "@erika_makino we have to take this super cringe iconic photo", "kr.suraj8987": "jaa simran jee le apni zindaghi😂😂😂😂😂😂", "anzelmagar_34": "have ever cheat in exam ??", "rahulkumar17091": "🖤❤️🖤", "sree_vkn": "😂😂😂", "kashvi47": "What to do if donot know the answer af a queation", "geetanshikaushik": "Is going for a drop year better than going in an average college #asksejal", "bigf.exe1234785": "Ur videos are 🔥🔛", "vartiikasinghh": "How to keep the distractions away.....And how to overcome the fear of not scoring good...Even if you are a good student??? Please Sejal we all know you were a nerd...So you understand such things better!", "susantapaul": "By the way ,you r awesome! U inspire me sooo much .your passion , dedication and smile motivates me sooo much!!I'm rim by the way and this is my dad's account . I'd love if you'd reply!!come to Kolkata sometime maybe?!?😄😅😍😘", "__iqra256": "Can you give any messages to the teenagers suffering from depression and anxiety. I have seen many depressed people. I can imagine how difficult it is for them to face the world every day. Pls do something to help those souls. Thank you. ❤", "rashigoel_": "What was your percentage?", "itsme_r_o_c_k_y": "#asksejal My question is why the he", "priya_prishni": "Hey Sejal ! Have you ever had self doubts and how did you try to overcome them? 😊😊", "y_u_v_i_k_a_": "@sejalkumar1195 #asksejal is it really hard to score 90 above in boards class 10 ? Everyone around me is just bringing my confidence Down......really tensed please tell is it really hard ???", "akshada_gosavi": "Hey I m one of your # bellbuddies n m in 10th grade .... sejal please send me n @r.a.chauhan1472 best wishes 😊", "_mo_na_li_sa_": "#asksejal first Hi from NYC. When are you visiting NYC? Is it in your bucket list? Plzzz come.. you are then going to meet couple of fans here i swear 😊my question is: how do you manage yourself to show the happiness in the professional world on your face even-when you are mentally depressed? Being a YouTuber I guess several time you have to do that..", "pinka.__": "Plz make fast....", "tintin_ta": "How much did you score to get into srcc and how???", "savi.kajla": "You took non medical in +1 ????", "sushmithameduri": "Did you binge eat during them?", "sunthestun": "cooll", "paawanisharma_": "how to get good marks in board exams and what do u do???}", "kesa_zahra_rizvi": "How to study for long hours..🤣🤣🤣", "suhasibawari": "What was your percentage in your 10th and 12th exams?", "janvikatarmal": "What to do when u have a holiday of 5 days before your last exam n if that subject is easy", "_anushka_ghosh": "Any suggestions for 12th commerce students? How to get admission in SRCC as It's cutoff is too high ..just share ur experience may b we can get some gud tips from u", "tanviwayal": "How did you prepare for your board examination?", "aish10._": "Give some tips for studying for board exams", "_a.a.y.u.s.h.i_": "HEY SEJAL.... I AM A SUBSCRIBER SINCE LOOONNGGGGG!! I LOVE YOU AND YOUR VIDEOS...... I AM ALSO A 10th STD STUDENT..... PLZZ TELL HOW TO DEAL WITH STRESS AND ALSO TELL HOW TO OVERCOME OF THE PRESSURE BY OTHERS?? LOVE YA!", "mariebiskutt": "How to deal with the anticipation of the result?", "valechaanchal": "What was your % whn u were in 12th #asksejal", "sanjanamb_": "U look somewt different in the reflection", "naisha_sachdev4": "@sejalkumar1195 I have a question.. I'M giving Boards, this year, how to stay focused for long hours??!", "arundhatii2004": "#asksejal how to stop procrastinating during exams", "charlie_emon": "DDLJ", "husky_eva": "awesome!", "thatlostvagabond": "How I can I concentrate without getting distracted? @sejalkumar1195", "27gautam_": "@mostlylit_ leave a question little one ❤️", "pratikjaiswal_official": "What is the best college in delhi for commerce B.graduation ? ( near 85% cut off ) ..........@sejalkumar1195 ( also the first video of your's that i saw on youtube was \" how to enter into SRCC \" ........... I'm your youngest fan , i guess ☺.... And please have a watch on my music covers on insta ❤", "priyanka__chandra": "What is your percentage in board exams @sejalkumar1195", "gaurangsoni_": "Hey sejal! I really tensed about physics because we only one day preparation gap in it, was there any subject at your time that you had such a small gap in? And how much did you score in your boards?", "ayonnaisee": "Were you a nerd back in your school days or a super chill student who partied the whole year and studied before exams and still aced it 😆😂", "ishxixyz": "@sejalkumar1195 hey sejal can we ace our board exams by just studying in last month?", "she_walks_in_stardust": "N i am in class 10 which is a crucial stage so how to excel easily", "_vxrnon": "how to get rid of social media addiction for boards and also some great concentration and memory tips😪😪😪🙏🙏🙏", "saimaaa.z": "How can I fucking concentrate ??????????? Even if I’m not having phone !! Like how can I concentrate and not sing songs and go in to a wonder land ??😭😭😭😭😭😭", "nyla_87": "How can we score 90 above in English??", "_anjaliupadhyay": "Is Marathi compulsory subject in best of 5? 10th SSC board", "miss_india_2k20": "What is preferable time to study for boards.. late night or early morning ? And what time u chose to study ? Btw love you and your videos #asksejal", "shubhangi_7": "Everyone says boards are easy, then why doesnt everyone score superb? Hey sejal, i'm shubhangi, grade 12th.", "suprina3883": "Who inspired you to do your YouTube channel ? #suprina", "nityashree111": "How to excel your schedule during preparatory leave so that we don't run behind?", "i_am_neetaj_ahuja": "Did u slept at night just a day before Ur exams or not??", "_sharad.j": "Have you ever missed your boards because of transportation", "aayutekani": "How many supplements did u fill in math and AC exam?? @sejalkumar1195", "nandini_227": "What were your silly mistake you tend to do on your exams....and how to avoid it in best effective way??", "bansari._.chauhan_": "Do we need to mug up answers or write in our own words??", "vibhutidahiya": "I suffer with anxiety and hence I panic a lot during the exam if I see any question that I don't know the answer to. I have always been a pretty good student, but my marks have been dropping in grade 12 due to stress and some bit due to the fact that I don't feel prepared. I'm slow at writing and it just adds to panic. Can you please suggest some ways to help me, and others suffering with the same problem out? Thank you. Love you 😍😘", "_ashna.bagdi_": "#asksejal How much did you get in your 10th boards? Can you share the problems you faced in 10th? Any advice for students who want to take commerce in 11th? P.s I love you and your channel.", "eshaasy": "Any prblm that we may face during our exam??like anxiety... And whats d solution for it??? Btw I frekng love u n ur vids.... ❤❤❤❤", "kachalimbu": "How do you make it stop lol", "rubinarodgers": "@dood_the_dude 😂😂😂", "yusra.rasheed55": "Are u planning to get married???", "varshitha__sai": "Did u anytime cheat in ur exams 😜🙈🙊 ??", "trupzt": "Exams are in just 2 weeks. I don't get proper sleep during preperatories or exams...Please give me a solution or a suggestion so that i can get up fresh in the morning ! #asksejal Love your videos 💋", "meryll_rebello": "How to stay calm before the exam? I have my board exams in a week. Really nervous.", "simranahj": "I'm trying so hard to find time and study with full concentration but the situations around me don't seem to get in control. Since it is the wedding season, I can't really concentrate. So how do i focus on my studies while at the same time enjoy in the various functions tension-free?", "gujju__devils": "How to learn easily with no stress", "arpita._katiyar": "Information about economics honors", "anil.lalwani.68": "Any last minute study tips", "jankimehra29": "@reenamehra05", "___happy_puppy___": "what ur last night before ur hardest exam was??", "avani_5555": "Even if I make a schedule for my studies i never follow it and I think there are many more like me. Any tips on on that?", "marush__maariya": "Never studied and just went in the exam", "shuklaananya7": "Hardly 10 days left very tensed any suggestions? How to carry on further studies?", "sadiyakhan5505": "Were you a procrastinator in school? Give me some tips for not procrastinating!❤", "makharia_vidhi": "What silly mistakes you did during your exams ?? Please tell so that i will be alert", "aasiyaan_24": "What was your study plan during boards ???(specially class 10 as I am going to write my boards after 20 days )@sejalkumar1195", "that_gardenrose": "How to study??", "ananyasalunke21": "Is it true that boards are EASIER than that of school exams like prepoards?? Just because schools tend to make tough papers for the growth of students and for them to get the right exposure.", "stuti_kuzur": "How do I stop Procrastinating??😭", "nayalanand": "Should we go for tuitions if yes then where", "neha.gulabani": "How did you cope up with the stress during Ur boards?", "aditibalmuchu": "What to do after graduation....???", "swarnxma": "What was your percentage?? 😂", "shweta_menon_13": "How to keep your mobile away and just concentrate concentrate and concentrate???", "rachanaaaaaaaaa": "Were u a omg boards aa gaye kid or a chill yaar its just boards kid???", "dhruvipatel206": "Your parents ever force you to study in board exam??? And have you ever been to tuition classes or anything like that..", "jayana_jain": "Hi what's the strategy for math revision? Also I don't have any gap for preparation in math so any specific advice?", "mahati.myth": "I’m writing my 10th boards this year, so I’d like so know some tips to deal with stress @sejalkumar1195", "shreyaachaurasia": "Tell ur stream....class 11&12 result", "ridhiigoel": "How to stop watching YouTube videos during exams?", "simrannanda11": "Im going to give my 12th grade boards.I'm afraid I wont get a good college because im super average.I can't stop worrying about my immediate future", "deshnaxn": "How do I concentrate and stop procrastinating?! 😭", "harshikaaaaa": "Igcse is better or indian boards", "komal.mirdha": "How to present the ppr in the way to get full marks?", "tvishaa.r": "What should you do while you’re taking “break”", "anayshabh": "What was your study routine during boards and what tips can we follow for grade 10 boards?", "_praptishende17": "How much did you score in your 10th and 12th board exams ??", "muskiiii24": "#asksejal Do 10th boards exams really matter in our career? @sejalkumar115 Also ILOVEYOUSEJAL Be happy and keep making us happy <3", "hey_humaira_here": "Wow! I must take a picture like this! :D", "_supriya17_": "Is @mohakpapola engaged..I can see. Ring in his ring finger", "ariesbabe_1104": "Thanks Sejal This year I'm giving my 12th boards & I'm super stressed & my question is how to eat healthy when I'm stressed bcoz when I'm stressed I look out for all junk!!", "gorpriet": "Hahahaha .....no simran", "riyarhm": "Hi @sejalkumar1195 !! Can u share some tips to make plans for exam preparation ??", "roshnisridharan": "Ur method of studying for board", "nikita.rai": "how much did you score In twelth grade?", "motikumar_9": "How was ur 10th life", "tasneem.aziz": "How to keep calm even if you haven’t competed your syllabus ? 😂", "shan_bhattacharjeee": "@sejalkumar1195 wo yaar matchs Ncert page number 373 ka example 6.1 ka solution A) hi hai na?", "mahima_dc": "Heh sejal i am from nepal and here we have slc(grade10) boards. And what was your percentage on your indian slc or whatever you call it.", "laraabara_": "Always feel like no-one should b ahead of me which makes me feel guilty", "ananya_lakshmish": "How to manage time properly? How to reduce stress/tension? #asksejal by the way needed this kind of video❤. Wish me luck ❤ I have board exams for March 23 ❤", "riyona_original": "Pyar Ek Dhoka he 😂😂😂", "colloquially.naisha": "and how to stay calm and not stress", "annuuu_singh": "Ab to khtm Ho gya yrr exams...phele Krna tha n ye sbb locha...", "chahakmalhotra": "What was your cgpa in 10th and 12th ???", "iswearya": "How to stop procrastinating?", "__ms.insatiable__": "HOW TO GET INTO SRCC????", "iluvmyselena": "How to stop getting distracted from anything and also how would be the cbse board paper for 9th grade if you have any idea?", "anushkasavane30": "#asksejal @shreya__patil jus see her plz she looks damn similar to uh she's my frnd plz sejal plz", "sathu_forever": "How much did u get in our 10th and 12th boards?", "priyanka_s08": "How to prepare for maths?? Sejal di please help because it's my childhood dream to score 10 GPA and maths is the only hindrance. Also please wish me luck @sejalkumar1195", "_.jesssee_": "❤️❤️❤️", "khushisah_": "❤❤❤❤❤", "_that_bong_girl_": "😍", "alifiyazulfiqar": "How to learn when their is always a fuss in your house ?", "thedarkspark__": "JUST WHY", "aryapawarr": "Hey Sejal!!wanna know How to reduce stress and manage time??", "supz.raj": "😻😻😻", "namratha___rudramuni": "Is board exam paper difficult??", "prit_bhatt": "Plzz give tips for accounts subject....need it❤❤", "littlejoy_kids": "Woahhhh ! Simran 😀😀😀", "xx_chilly_xx": "Amazing", "myhappylilworld": "#asksejal any tips for boards???", "tanvii_kaushal": "How not to freakout in between exams???", "priyaavohera": "How to study for the last week", "shruthhiiii": "Heyyyyyyyyy sejalllll!!!!!! Bdw I love your hair!😍 Question- What to wear during exams which is both comfortable and stylish? #asksejal", "madiha_____": "What changes would you like to see in our education system?", "darshana_singh": "Why did not go for science after 10th?", "abhipsaasahoo": "How to plan and studyyy?", "vishnupriya_bijjala": "Hey yu look crazy😍😍", "ananyakhanna_16": "Do Delhi colleges have a second cut off? It's very hard and difficult to get 99 or 98 %", "shao_singh": "@manorma_horo we'll also", "vedantiiwanjarii": "Hey! sejal I am your big fan.... How to deal with Exams are they scary share your broad Exam experience with us and yeah how to overcome come the problems... #Needyourhelp 🔆", "_.badabing": "Which is better? Science, Commerce or Arts?", "seth_sugandha": "How did u prepare for srcc", "viepsy": "beautiful ...", "musskaan_._": "What is all this hype aboutt. Its just exams .Chill peeps.", "d_4_dead": "Avhhha", "cherry_pincha": "How to score 90% above", "pothoschaos": "If I'm weak at SST, do I concentrate on it more or just leave and score better in the rest of the subjects?", "farahs_neezfahs": "Does Marks really matter ?? @sejalkumar1195", "sreedeepthi9901": "Why exams and why Geography why maths why Chemistry whyEnglish please let me know in your video", "oliviyasenguptaa": "I am appearing for isc examination.. n i don't know I m having an instinct i might not get into a good college..How to overcome this type of fobia😶", "bird_in_woods": "How to do maths from scratch commerce student when u r scoring just passing marks in pre boards#sejalkumar1195", "dhruv_kothari_19": "We Want A Math Quiz Between U and Mohak", "_sanskriti.00": "Which should be preferred during boards ncert , notes or side books or previous years ques pprs #asksejal plzz ans @sejalkumar1195 #asksejal", "simranism": "How to increase the sitting hours span with full concentration and utmost interest in studies?", "twin.butterfly__": "How to get more than 97% in 12th commerce??", "bar_hunka_leonard": "Haha nice one!", "ananya_jain14": "Don’t feel like studying at all !!!! WHAT TO DO😢 Ik it’s imp n I have to study ...Lekin andar se feel nahi Aa raha ..if u understand Wat I mean 😅 any tips ?", "jappneet_kaurp": "How to prepare for social studies (sst) for class 10??! @sejalkumar1195", "emmy_24_2": "What percentage did you score in your 10 and 12 ??", "_.ojaaa._": "how to get above 90% in commerce grade 12", "d_dimple_gal": "How to prolong one's study hours?", "yvinutha": "OMR sheet will be provided or booklet??", "sanjana_1196_": "Why do every body get scared of board exams ??", "tanya._.p_": "Your board percentage", "x.ananyam.x": "Are they tough?😂", "anshi_sushi": "How do you memorize easily? We have four text books for social science...", "thebohemian99": "How to gain confidence? I akaays think I am not gonna be able to score.", "lazumith_": "We don't even know how much you scored in your boards but well you have been an epitome to millions , if we max our boards we have many doors opened up. BUT if our boards don't go as wished then there is barely any door left to open,so what are we supposed to focus on? Further studies or Our passion?? @sejalkumar1195 @sejalkumar1195", "_vidhi6": "@sanya_goel gotta watch this for sure😂", "oishika.kar": "How to keep your calm and not panick before the exams? I'm in Class 11, ISC board and this year has been terrible for me. No idea what does Class 12 have in it's store.", "harshithaa_raju": "What if you wanna badly achieve something and you don't have resources, money and even the support of ur parents ?", "joshita_sharma_": "How to deal with all the distractions like phone ...computer etc cuz it is really hard to ignore them", "noyofying": "Why is it important to appear for board exams from your point of view?", "_chikki18": "How to get rid of distractions @sejalkumar1195", "merlin_2026": "How to study social😞?? Its too hard to remember dates, imp points basically everything. Need helpp😨", "keri_naa": "How to improve presentation with bad handwriting.??", "aaseeyajalilkhan": "How to top in your boards without taking stress?", "aynarahs_": "Also I love fashion and love being a youtuber, but I dont know much about editing...", "swarnimacd": "What was ur fav subject during 12th nd how much did u score?? #asksejal", "makeupbyisha": "How to improve presentation skills?", "littledevashi": "How to judge what is exactly required to be written for a question in an Eco paper?", "alvina505": "How can we study 23 chapters in socials?", "prachita.kukreja": "What is the right time to tell your parents you're fucked? Before boards or before the result 😂 Legit question tho.", "aashi_jain20": "Subject wise tips please for commerce with maths..to score 💯", "_aparajita_chatterjee_": "What were ur feelings during ur class 10 nd 12th board 😅", "brownieswithicecream": "How do you stop yourself from procrastinating #asksejal", "poymanty": "Should we uninstall all our social media accounts during or before exams ?....this is what my mom tell me to do.. What do u think?", "apolo_kisan": "Will you be my valentine??", "simran.u_u": "@sophiya_shahi Simran ko le jaoo", "meene_15": "When I was about to give my 1st board paper i literally cried due to examfever n all the stress we have... How was your experience?", "raji_khosa": "Hahahaha", "anindita.mish": "@sejalkumar1195 What would you prefer more, books or notes? And is it necessary to study 12 hours a day to get 90%? How to get rid of the distractions and give sufficient time to each subject? :)", "aaron.remedios": "How to be stress free #asksejal", "shalina.nandolia": "How to make a perfect plan about what to do before exam @sejalkumar1195 #asksejal", "__musskpvtt_": "How to make a perfect time table and to follow it specially for maths and accounts", "anjaliepaul": "@sejalkumar1195 What was it like writing your board exams? Were you stressed or did you write it with ease?", "bhavini_agrawal": "Is it necessary to give them 😭😭?", "_smithcorona_": "How to study during night?@sejalkumar1195 luv u loads", "ary_artz": "I am in 12th std rn and my boards are starting from next week. Some people around me are doing those stupid countdowns which is stressing me a lot. What do you think, this counting down system is motivating or stressful? #asksejal", "_a.nshili": "Can we score good marks in 15-20 days of some serious hardwork", "divisha_agg": "Even after preaparing well, we got panic. How to reduce that stress and gain confidence in yourself?", "kuhuwu._": "what was your 10th%:P", "_anchorage": "So we just have like 14 days left and somee how I've lost all the motivation I had foor the paast 12 months!!! And theere is so much to do!! Help!!!!", "anumeha.rajvanshi": "How do you motivate yourself to study?", "gayatrijha7": "How to deal with boards if only 5 days r left ??", "aswathyyyyy": "#asksejal @sejalkumar1195 how to combat stress and anxiety during math papers ?", "manasvimaheshwari": "Is it necessary to take math in best 4 while appying for eco in DU. #askSejal", "rishilagarwal": "HOW TO CHEAT!!", "sonal_vashist": "@sejalkumar1195 @mohakpapola Supercute😍❤", "ll_ashlyn_ll": "@sejalkumar1195 how to study well during exam days while there are so many distractions?????", "hemal_06": "How to score goid marks in exam??", "radhika_miglani": "How to cope up with the stress inside the board exam hall? #asksejal", "sweetpotato_6": "how to study undistracted", "sheetal2869": "What to do to be more concentrated during exams???@sejalkumar1195 ❤", "khushi_900100": "How to get rid of the distractions around....plz do ans me.....luv u @sejalkumar1195 n take sejal along with u @mohakpapola😛😛", "erza_natsu": "Can any chapters be left or all have to be done?", "aarshiimehtaa": "What kind of time table to make? #asksejal", "__anu5602": "How to convince parents not to take stress for our exams🙄 and how to manage time during math exam😑#asksejal", "kumudkhurana": "Is negative marking done in board exams", "inferno_0.6": "Did u cry during or a day before xams", "seven_seas7": "Very beautiful click", "thisissamakhya": "How to not freak out in the exam hall if a question goes wrong and u have to redo it all over. #asksejal", "evanescent.euphoria": "I am giving class 10 boards this year...so I was wondering how to revise the entire thing before history exam and not make a mess😅😅😅", "komalet": "Your study schedule", "sumana_____": "Hiii please give me some last minute study advice. I feel like I am forgetting everything thing what ever I learned I feel like that is not in off by the way I'm commerce student 👨‍🎓.", "dchugh312": "How to maintain your calm during boards??", "aaliyarizwan.shaikh": "How to maintain your concentration while studying", "uchicha_99": "#asksejal how to make your parents realise that it is okay to score less than Sharmaji's son?", "xcapturinglife": "How to not get distracted by youtube?", "khushi_bothra": "How to convince parents not to take stress for our exams?", "disha_1423": "Does doing bad in boards actually spoil you life or career or is board exams sooo important in life ?? CAPTION THO❤️❤️❤️✌🏽", "muskankhoslaa": "Why do they even exist😂", "_vaishu_8_": "How to write board papers well? I mean the sentence formation and usage of words😊 #AskSejal Looking too cute in the pic 😘😘", "tubasahar_": "Here in Pakistan parents are crazy about marks in board exams", "anu_010602": "Love you mam...how to concentrate on studies and how to avoid talking with friends in cell phones for a long time and how to keep ourselves awake during night last but not the least how not to think about the future plans and after exams how can we untilise our time in vacation and how to waste less time in roaming and watching tv 😶...so these were my enquiries hope you can give me answers of all these questions @sejalkumar1195 mam... lot's of love and luck to you", "jjbubble15": "How did you manage Youtube along with all your studies?", "assweeti": "1. How do you manage studies, staying healthy, being social and staying creative while studying and preparing for boards at the same time? 2. Even though a lot of people say boards don't matter, it actually does affect your admissions in 11th and higher studies. What's your one advice to your younger audiences regarding this?", "wifi_princess2004": "@sejalkumar1195 ....I get distracted really easily....how to consentrate", "tanishqaaaa____": "IM ONE OF THOSE WHOSE GONNA WRITE THE BOARDS..... MY Q. IS HOW TO MANAGE STRESS? 😶", "priyaanepla": "whats was your study schedule everyday #asksejal", "ashna.jain01": "Do 10th boards matter alot ?", "shreeyaya": "First of all, well decision to make a QnA about boards... What is your opinions regarding current education system? Any changes you expect? And moreover what do you think of the students who score low and have to hear a lot from parents and teachers??", "shrutz_2945": "How to score goods marks in accountancy??also please give some last minute suggestions.... n wish me good luck cuz tomorrow is my ISC exam for accounts", "harshi_singh_23": "How to increase concentration and the how to choose a good college???", "simranchandnaaaaa": "And what if you yourself are simran?😂 @clash_kennedy_2018", "ananyasahay": "How do I not be extremely depressed due to continuous studying ?", "kalravshah_": "Hey Sejal how to concentrate during exams and what faculty to choose after 10", "nidhi_nayak_": "How do you procastinate?? Like what is the one thing which keeps in distracting you??", "shyamalaaa___": "Sejal didi love you so I would like too know that what stream did you choose after 10th?? Pls. Answer", "aashi_mehta23": "Please tell me on how to deal with the stress , how to effectively study to get above 90% for which I know I m capable of ? Also please tell me how would u study for your 12th board exams ? Any other tip that u would like to give ? Thanks @sejalkumar1195 for making this video 😊❤️", "meghana_muniraju": "any tips fr gtting into iit...", "aiswarya_i": "Love u sejal......ur r my huge inspiration and wat percentage u got on ur boards...and ur some tips", "maahilakhani": "What do you about managing relationships with people ( not neccesarily boys ) during board exams . Like if youre stressed about ending toxic relationships or just strengthening good ones?", "_m.r._i_.d.u.l.a_": "How can I reduce my anxiety?", "cleora_fernandez": "How to deal with maths...I love maths but during exam I feel so much of scare. .. what to do Sejal di ☺ @sejalkumar1195", "eatburpfartpoop": "How to stay away from cell phones and just concentrate on studies. How bout building mental strength?@sejalkumar1195", "sayalijogi": "which stteam you were in and how much you scored? and what 'exam tips' you'll suggest? haha ly btw. xoxo", "shahien_sabira": "@sejalkumar1195 #asksejal how to study and show interest towards exams without any distraction? Pls btw love ur videos u rock 😘 #asksejal", "krishaa.__": "Are 10th board results really important for further studies or jobs?", "devikapawar26": "What was Ur percentage ???", "im_ishita": "How to cope up after taking sc in 11", "riddhiluvherself": "Jab 2 bar me sabhi Kam aachese hote.. Then why the hell ek chapter see exam pass nhi hoti😁😁😁!!!... How to distress.. During this time 😍😘", "shibangi.bose": "How to manage insomnia and frequent fevers ? Plz say @sejalkumar1195", "alinasapkota2002": "who you make so awesome videos??", "_bhakti27_": "Does last minute study works ,like 2 weeks before?", "tanuisherewithorchids": "👌", "malavikaradhakrishnan": "What was your favourite subject and what was your least favourite? You said you played basketball. In 12th, did you only study or did you take out time for basketball? What was your routine for the night before the board exams? Also, love your videos. You're very inspiring! ❤", "_south.pole__": "Did you prepare for your board exams right from the starting of 12th or a month before the boards? #asksejal", "ishika_.kamani": "If one is decently good at studies, is coaching for boards really required?", "blah1234567890123456789_____78": "#asksejal how much did u score in class 10 n 12", "diyaj307": "Wht did u take after 10th?? @sejalkumar1195", "_ranii___": "Hey sejal!!Do you have any plan for preparations???If yes! What is that?#asksejal", "vedikaakhramka": "How much did u score in 12th?", "shiv_om_bansal": "How to score well in ENGLISH EXAM ?????? 🤔🤔🤔🤔🤔🤔🤔🤔🤔🤔🤔🤔🤔🤔🤔🤔🤔🤔", "uh.nouu": "@_dabdaddy96 #pyaarekdhokahai", "saimawtf": "How to score good marks in English? Which is the scoring part in English?", "advika02": "@vrushali.a.joshi", "tejaswitaaaa": "Hey Sejal! What was your favourite subject in class 10th?", "ishitaakalraa": "Did your parents pressurize you to score well? #asksejal @sejalkumar1195", "vidhatriraom": "Same question @raksha_reddy", "teenabhatiaa": "What are the last minute suggestions for board exams acc to you?", "selenataylor___hearts": "I am giving Cambridge A level board exams. I really really want good grades in PCB and English. Wish me luck so that i go to Bangalore soon!", "safa_2109": "How to study during exams?", "geetachopra959": "How much You scored", "gshreya202": "Did you ever cheated and ur techer caught you #asksejal", "madhuralad": "What was the toughest subject for you and did you practice for it", "illusions.8._": "How to manage time during exams #asksejal", "_bagrii_": "What if we dont get good percentage in 10th boards. Is percentage the only thing that matters ?", "kalpna_anna": "how to stress less and study properly", "sugandh__g": "Is it mohak's hand ....", "its_shreesha": "How much you scored in your 10th and 12th boards ????@sejalkumar1195", "thatfirstalphabet": "Is it mandatory for a CBSE commerce student to have Mathematics as a subject to pursue B.com(H) from SRCC? Not related to boards but since you were a SRCCian, I'm asking you. :)", "anithavenkatesh411": "Hi sejal... Pls tell how to manage time..", "username_plmokn": "How to deal with 10th grade board exams?", "vaishnavi_negi": "How to prepare for accountancy paper in preparation leave? Because we cannot revise the whole thing.", "divya.hoon": "I am in 10th giving board exams😂 I want to ask *How much break should we give ourselves* while studying?", "bhagyashree_sakharkar": "Why are you soo cute?❤", "hina1_gilani_": "Do you cheated in exam and Teacher caught you ???", "seemaagarwal219": "What were your least favourite subject and least scoring subject in boards? Were they both the same? #asksejal", "kaenatsalim": "Does presentation matter in board exam and how to manage ur time in exam", "khxshxy": "How can i score 90% without studying 🙂🙂🙂🙂🙂 @sejalkumar1195", "sh_sadikshya": "@sejalkumar1195 Who is your favorite Bollywood actor p.s. love your videos", "ragini7687": "What is the best way to write answers in Board exams and how to manage time..??", "vrinda_basu": "How to revise just the night before ?", "sssaumya_": "Are these exams really such a big deal?😶 I'm a tenthie. @sejalkumar1195", "mridusmitadas_": "#asksejal how was ur school life? I love u very much....plz make fashion videos", "ust.00000000000": "How should we choose between our choices and the choices made by our parents ???? #asksejal also missing ur monthly favorite videos 🙄", "nikita_hukumatani": "How to study smart?", "neeshu_05": "PCM student : really need to know how to manage tym and also how to deal with mood swings....like smtyms u feel to study evrythng nd then in the next momemt it feels like just throw the books away😥😥", "_teresa_daimari_": "Which subject u thought the toughest 1 but end up scoring the good marks?? ....wch u didn't espect", "priyaaa2525": "How do i score 100 in economics?", "_ananyakumar": "Do we need to have maths to pursue economics in SRCC?", "kavyaabajaj_": "1.During exams , there’s lot of anxiety,pressure and stress . How to deal with that? 2. Even though I try my best to a time table , It’s quite rare that I m able to stick to it . Any tips on that. 3. Nowadays studies are fully dependent on tuitions and there’s very less time for self studies. So my question is that this dependence on tuitions is fine or we should be more independent as it helps us after school? Ps Thank you Sejal , you’re a great inspiration even though I m still in 9th and have my boards next year this video will really help me .❤️", "barun.aaryan": "Are the boards really difficult", "shivaaninisar": "CAN WE WATCH TV SHOWS ALL DAY DURING BOARDS? 😭😂", "ishita16_": "How can I not be skeptical", "roshikarya": "@aakarbanka", "__sky10_": "what diet should we follow during exams?", "tanishaaj": "How to not take them at all and still get into college", "thefakeinnocense": "Too very much confused...what all to read...ncert,guide etc ! Hey sejal di, Help me out with the format to study. Like what all to be thorough with to get a 95+", "kaush2bha_": "#asksejal Which subject was your favourite and which subject you hated the most?", "mayurigarg308": "Mohak u seems a genuine guy n sejal seems a genuine girl dont ever break eachother heart in todays worl pyar per se bharosa uthgaya hai but u are the inspiration to many of us .. stay strong stay together", "itsdishakukreja": "@sejalkumar1195. Hey Sejal! What was ur most favourite n most hated subject? Did you cheat in any of your exams or tests, or you were the one to help others?", "vandana_maheshwari_": "How to stay away from phone", "khushi_meridoaririki": "How to crack em in 20 days and post the vid superrrrr sooooonnnnnn", "__ccjc__": "How to excel in boards?", "meetasinghh": "We read our chapters thoroughly and understand them. But sometimes there are questions which we might not be able to answer, maybe which are not from textbooks or sometimes very minutely written in texts. How can we answer them?", "kanishkaj18": "#asksejal Do you feel sleepy all the time when your exams are super soon?😂 like me. My school life is over now😞", "swarnima.anand": "I keep on forgetting what i have studied. Any wise words of wisdom?", "vaishnavi.__.k": "Do languages count when admission are done ...I mean after 12th ?", "shriyaaaa_._": "Do high school boards really matter once the results are out? 😐", "yaminiii123456789": "How to do the 'kamar kaske parhai'", "shagandeep2095": "How can we save time during board exams", "_kashedi_": "How to stay calm during the exams?", "gurnoorsahiwal": "How to cheat in an exam!? 😂 + some studying tips?? Plzz", "aballofcheese": "Can you just tell us how to keep calm during the exam ? And maintain the cool . Like sometimes even if you know the thing due to tension it doesn't come to your mind and you lose marks .", "saarraa24": "How not to get distracted while writing the exam ?", "inayasinghania": "I have my boards form 6. Plz tell me how to not be stressed out", "shreeshti_vasant": "How to reduce your distraction?", "gol_gappaa_": "@sudiksha._.293 mate pacharunu mu kahibi😂😂😂", "praptiijain._": "are they easy or really not ? p.s-studying tips", "one_bong_girl": "What to eat during board exam??", "aastha17_": "Is ncert sufficient for business studies? Can I score well without solving sample papers and previous years' question papers?", "ananyaa_arora": "These exams are so stressful. How get rid of the stress . Help !", "khan_hudaaa": "What have you scored in ur last board exam?", "shimmyparul": "Due to late night studying, I got big dark circles and i feel weak. How can we take care of ourselves while studying", "shilpabiju_": "How can be the last moment preparations?", "hangshagamini": "Just wish me luck @sejalkumar1195", "believe_2468": "How to prepare business studies it’s like there are sooo many things to remember", "ayramakani": "What are the chances of copying? Tips on copying lol", "thesinlessbong": "#asksejal #sejalkumar how much did you score in your 10th boards?", "_kshitichopra_": "How much did u score in 12th ??", "saloni_gag": "Do I really have to give boards xD", "kiiarakapoor": "What was your schedule like? How long did you study for everyday?", "nandita_jainn": "Is is sufficient to study ques of pcm specially chemistry only from ncrt..are all the ques from the ncrt book itself??", "ananaeyaa_17": "Does good handwriting have anything to do with the marks?", "uday_arora_": "maths ni hoti😂😂", "anjalitanwar1724": "I want to score above 95%! Can you give me some tips that how did you study for your boards? Please @sejalkumar1195", "tasneem._.khan": "How much did you scored in your 12th? And also some tips about how to make it to srcc.@asksejal @sejalkumar.", "saraswat_arpita": "How to test yourself whether what you have studied got into ypur head or not...#asksejal@sejalkumar1195", "janvi.balwani": "@sejalkumar1195 what extra books did you refer ...... please tell for all the subjects", "meeisdivyansha": "Have you ever been caught cheating in any exam? #asksejal @sejalkumar1195", "soniyakubde": "How to improve concentration power??? @sejalkumar #asksejal", "wondergirl7800": "Any recommendation for extra books for commerce subjects?", "ishikaagupta_": "I tend to get really stressed during exams. Any tips?💦❣️ ps I love you🌈", "manvi_draboo": "Is there any chance of doing cheating and not being caught?! @sejalkumar1195 😂 @pooja.0015", "kavya531": "How do u manage if u have a boyfriend and don't wanna break up??", "call.me.winnie": "Heyy Sejal! Big fannn I have my exams in 5 daysss plssss help how do I concentrate on studiessss nd how do I get up earlyyyy😭😂 I feel sleepy all dayyy nd during boards I stay up totally ignore the skin some tips would helppp nd wish me luck😂 #asksejal @sejalkumar1195 LOVE♥♥", "richa.charles03": "How to focus for a long time with less breaks", "thecutegirlintown": "While studying for boards , it's a normal tendency to keep nibbling on to some snacks . And it always ends up being junk . I think eating something while studying helps me concentrate. But at the same time as there isn't much time for excersise , the junk helps to put on some kgs. How could we avoid that ? #asksejal @sejalkumar1195 🙈🙈🙈", "vanish_vanish_": "Hey sejal, the syllabus is too much and i hv only 10 days to prepare for my exam. How can i finish mu syllabus without getting stressed and bored. And what to do if u dont waanna study but u hv to? PLEASE HELP!", "sas.hxx": "Can you please tell us which refreshers are best to study for 12th board?", "crazy.for.crust": "How to handle last minute preparation nervousness and anxiety. @sejalkumar1195 10th boards", "beautybehinddmadness": "Okay mine is not board exams , I have my semester within a month and I am feeling like studying but I can't concentrate. What can I do?", "nikiitatatata": "How can I get good marks as in 90% in 10th in three weeks", "ashwxnii": "We all know that our parents are more worried about our exams than us. What was your mom's reaction when you were going for your exam? #asksejal @sejalkumar1195 ♥♥♥♥♥♥♥♥♥♥♥♥", "shwetarai_7309": "What should be the tough schedule we should pick up for boards.. I mean how much time for sleep, for refreshment etc.. #asksejal @sejalkumar1195", "oshincognito": "I'm about to give my 10th board exams any tips about time management?", "jigyasaaaaaaaaa_": "Hi! I am Jigyasa. I want to ask u that Are board exams rarely hard because I am going to give my boards.", "konikasappall": "Is it really a thing to join classes for good marks?", "sukanyapawar_": "Harry Potter or game of thrones? ❤️", "hbtbf": "how to manage boards and other competitive exams together?", "nehal_koradia": "Hey my HSC Boards are a week away..What are the tips according to you to stay calm before and during exam? #asksejal @sejalkumar1195", "shree.chatterjee19": "How to cope up with macro economics??......i m really weak in tht particular part🙄🙄#asksejal", "one_wanderlust_soul": "How to Stop Stressing and Prepare Well For Board Exams? @sejalkumar1195 #asksejal", "ablaze_aquarian": "@sejalkumar1195 this is apart from board exam, how did you manage youtube and college life?", "chris_ann990": "How do I get myself to sit in a place and concentrate? #asksejal", "_khalnayika_": "@hardy_aggarwal 😂😂😂😂", "_shreya._____": "Board exams😣Ughh! Were you always a topper kind of student in the class? And did you Mum Dad pressurise you for studying all day long when your boards were approaching? #asksejal", "ishitagshreya": "how to motivate ourselves , reall y getting pressured due to board exams", "tishachhabra_": "What was your timetable during your exams??", "pooja_travelbug": "are board exams overhyped?", "feat.ananya": "#AskSejal Are board exams really as tough as it sounds like? I have seen people exaggerate about it quite a lot. Btw, your videos! ❤❤", "jahnnnavi": "How much did you get in your 10th grade?", "rohitrg_99": "How to study for boards", "the_dauntless_gal": "How to manage time for all the subjects?", "himanshinim23": "#asksejal How to have a better concentration ?!?!!?", "swastika_mukherjee1": "Did you take any tution for maths? Were you satisfied with your marks? #asksejal", "_mehakdhand_": "How important do you think the boards are in determining a person's future?", "_xxsuniixx_": "#asksejal how was it for you to study in 12th? 💘💘😗love love", "neha_flory": "What was your key to staying motivated while studying? #asksejal", "_aarateeeeee": "How much did you score in your boards and my question is how to prepare for boards when you are left with one month in your hand.😁😂", "ananyaaa.kheraaa": "Why do we have to study maths? 😢😢😢 #QnA", "aarushi0703": "How should we make our schedules?", "ssharmaxxvii": "Cleared my boards long back...the best thing about this picture is the caption.... Mohak .. u r amazing with captions only...", "anmol.manchanda.12": "How to manage time in boards? How to not stress for boards exam? Please answer my question as my boards are also approaching #asksejal", "banshareee": "What are the ways that can release pressure and calm down ourselves?!", "kanakkhatri_": "How to really motivate yourself..?#asksejal", "shreya_thehappyypill": "@vaishnavi_negi mention your queries pls .She will help you .", "x.saloni.x": "Much needed video about board exams❤", "mantej.hanspal04": "What should be the diet plan while preparing for board exams?", "marlin.yesmin": "how to manage time between frnds social media and studies..during boards..coz we cant totally stay aloof all the while..but wat is the trick in managing them all", "nikita.akarsh": "#asksejal how do you stay away from phone while studying if you're too much addicted to phone ( WhatsApp, IG, FB, YouTube)?", "__preet__14": "Is it necessary to study and give boards even if its not your passion and you don’t want to do it at all? And you wanna leave your boards and do something you love and make your career in that ?", "littlepetunia___": "I don't feel motivated at all. What to do ?", "_anvi_vijh_": "@sejalkumar1195 how to manage the pressure of board exams?", "priyanka173": "What was your score in your 10th and 12th boards 😉? #asksejal", "nishivalanii": "Di I m going to give my 10th board exam next year i.e 2019 I want to ask you tht how do I relieve my stress during the exams..I m stressed out even during my 9 examinations and I m pretty sure tht I will panic during my boards alot..Pls give me suggestion on how manage my time as well..", "samiya7927": "When I start studying I think I know everything what I am going to do today but when I start a that time there is a thought that I don't know anything and I forget every thing specially in mathematics", "dipikajain98": "How to deal with the pressure your relatives give you?", "memeghasharma": "Hei @sejalkumar1195 . I hope you are doing well. Happy Valentine's♡ Day dear. 💕💕 So my question is how to deal with the comparison made with cousins relatives or friends during the boards because that's really disturbing. And I would be glad if you could convey to everyone and make them understand that everyone has their own potentials. Thank you 😊", "sriiilekha": "Love love love this picture❤️💞🤩", "kkashish_r": "#asksejal how to make a perfect timetable when only 22 days are left for exams or like for normal study??? PLEASE TELL?? I REALLY WANT THIS TO KNOW. LOVE U SEJAL . your videos are Soo creative and perfect. Keep making and soon u will get 1M subscribers💫❤❤", "lakshiita": "Many people say that board exams are actually a little easier and get us more marks. I wanted to ask if it is actually true", "btsisbeyondthescene": "How to study 22 chapters of social science in one praporatory holiday pls tell (cbse) @sejalkumar1195", "_.tanushkaaa._": "How can we concentrate on studies for longer time........only 22 days left for boards", "marviarora08": "How to stay focused and party less?", "charmss.c": "#asksejal how do you just get better at getting work done and staying ahead", "ananya_sahoo_24": "How to prepare just within 26 days... plz help... already wasted many days... n also if we cheat in boards will be there any problem!!! Plz answer", "iamagrawalsahab": "Off topic question : Yeh Pop Socket kaha se liya aapne.. Plz let us know!! 🙊", "anurag_pragya01": "Hii Sejal di, i m biggie fan of yours! I have been watching yours shows past 2 months, u r really doing grt job. Ur content is really good, & above all the best thing is that we can relate our self with you. You r a mixture of simplicity +elegance ❤️I love you dii sooo much.", "_its_arunima_": "I am very lathargic to study. I am known for the fact that how much studies are imp and also know that it's the most crucial time . But I end up not doing much. Please help me in this.. I even am aware that boards are significant for your whole life .", "miss_helianthus25": "How to manage this short span of time because it's hardly two weeks for cbse baords? And should we totally isolate ourself from social media during exams to score good?", "rishitaaachawlaaa": "@sejalkumar1195 Can u give some tips on how to handle studies and technology? And some tips on subject selection please. XOXO.💕❣️", "sabhya_tibrewal": "How to prepare for boards such that you hit not less than 100?", "naturalbornvlogger": "#DDLG", "i.am.negisurabhi": "Why is it necessary to score 90 plus .. why 60 is not enough now a days?", "_yashikaxx": "How to stop making errors in maths and physics,?", "paridhi_dolly": "How to prepare the course is very long and confusing ... Of history and political science !!", "_pooja.s.s": "I'm a science student n I wanted to know about your mom.....cz I also wanted to be a gynaecologist...I wanted to know about the level of study needs for the medical exams n for gynaecology....#asksejal", "aasthawar": "According to my teachers there is a answer key given by boards to teacher!? Should I fear to write my own views cuz it won't match Wid the answer key?", "dmellolivialex_": "Were you more worried about your exams or more excited about the plans after exams ? 😛", "heta_0410": "How you used to prepare for it? NERD mode on?", "sharara_._": "What was ur percentage for 10th n 12th board exam? 😂", "raina_parekh": "I have given my 10th board exams but I have changed my board now and 12th will start in about a month. Will it still be the same like 10th grade or changing the board does make a difference on the difficulty level or the hype of boards. (I changed from state board to central board)", "sejalbhattad": "How to tackle pressure of exams? Also how to avoid making silly mistakes during exams? Btw @sejalkumar1195 my name is Sejal too XD and ur videos are amazing! 💕", "kothurubindhu2819": "How did u manage studies & other extra curricular activities!!", "ritwika.65": "During boards, you tend to gain weight and your body becomes weak so how to manage your health during boards?", "anoushka.aaa": "Is it impossible to cheat in a board exam? Is the invijlation that strict!? @sejalkumar1195 @mohakpapola", "vidushiisushiii": "As we know you made it to SRCC so you must be having some specific strategy for each subject especially accounts and maths? Please share those and how did you use to plan your time accordingly?", "capri.soniakaur": "@appyghai-Add this too your bucket list as well 😘", "uttarahahaha": "Ok so I want to post comedy YouTube videos I have all the scripts and equipments ready but these boards are killing me I can't take out time to shoot edit and upload videos please give me your advice it would help alot 💕 @sejalkumar1195 #asksejal @mohakpapola", "aashnajani": "It is kind of tough being a 10th grader . Was it tough managing all the subject at one time?😶", "_navi_98": "Before writing your exam there is lots of tension going through your head.So for that I make myself calm by listening to peaceful songs,what about you?", "_deepti_venkatesh_": "Hw to study subjects whch hav more of memorising topics thn understanding?", "appyghai": "@capri.soniakaur yes it been there since long... will definitely get it done this time.", "sandhya_._anand": "are boards everything ?", "kapoorstuti_": "I learn something and by the time reach the next few pages, I see that I've forgotten the previous stuff that I learnt. How do I avoid that? And also, how do I manage time between all the subjects? Ly ❤️", "holaanyaaahereee": "Hey Sejal! How can you focus and not get distracted by phone and other things? I love you and your videos ❤️❤️", "manju_mathews": "how do u stay away from distractions?", "shreyyyyaa": "I'm studying in 11th grade now. Next year I'll be appearing for my 12th board examination. Can you give me some tips how to study and how did you study for your exams ? Also, Mumbai meet and greet once again please, I couldn't make it the last time due to heavy rains. Thankyou❤️ #asksejal", "shrenipriyadarshini": "And ya... neend bhut aati h ? Tell something for that too😢", "_hope.knot_": "Heyyy sejal...i love u..im in class 9th goin to 10th how important r these board exam do they really effect ur future n ur life ..??? #asksejal", "___jiyaaa_": "#asksejal How to manage your time to study for board exams?", "simrankaur2472": "Some important board exam tips that we have to take care about!", "manvi._.kohli": "Hey, so I want to ask how to manage your time between all the subjects", "_ishasingh": "What was your way of studying? And how did you cope with the pressure of revising every subject just a couple of weeks before the boards?", "___angelaa.___": "Mmm why do they exist?", "anu_anoushka_nandal": "Hi sejal I am anoushka and I love your videos and my question is.. Is it really necessary to sit down with your book whole day to study??", "foodsleepmoneyyyy": "I love you sejaloo♥♥", "gargiririri": "Heyy sejal you cute asf❤️ btw what was your percentage", "nityaa_malpani": "Some study tips and motivation. Please?", "himavari_11": "Some motivation tips & how to be productive", "bavana_18": "How did you divide your time for each subject? #asksejal", "ananyaabakshii_": "Wowwwww", "janhvisinghhhh": "#asksejal holaaaaa❤ actually I want to shoot for my first video on youtube! But these boards are not allowing me to do. Can you help me out and suggest some ways on how do i manage my time for both!", "_karuna_anchalia_": "All of us have been hearing that board results should be good as they decide our future .. but I as a ex- class 12th student no more feel the importance of class 12 marks..are they really important and gonna decide my future??", "thephilophobiac_": "Hey Sejal, I'm a class 10 student and hav a lot of confusion regarding my future stream... I dont understand if i should opt for humanities and be a writer as i want or simply follow my parent's advice and take PCM... Do say something!", "divya__v": "How should I study if my boards are in about 22 days and I still haven't completed the entire portion once?", "vidhi110032": "Everyday i think of studying for x many hours but i end up doing less and regret about the fact that I'm still not that serious about it. What should I do?", "manasadeerao": "How to reduce stress during exams without consuming much time? Im in 9th standard and my full portion exams start on 19th. Im super stressed out! If ur viddo comes out before 19th that would be very helpful. Love u soo much sejal!!💓 - manasa deepak from muscat,oman", "ridhima.09": "And also how to be ready to study and get productive", "nihal_goyal": "How did you get admission in SRCC? #AskSejal", "aaaaliyahh6": "Stressed out", "sarisha9__": "I want u to explain something about commerce stream", "ananya9902": "What kind if invigilators do we get?", "anchita_thiagarajan": "Why do board exam sucks?!???", "a.e.n.a_m": "How to not get distracted and schedule or plan for sciences and math especially", "whereisumang": "I'm soo bad in concentration and focus so what to do to maintain it while studying?", "aashnagupta12": "Sometimes we feel so depressed and feel demoralised and do not study for boards thinking nothing can help us now. What do we do to keep ourselves motivated?", "varsha_nj": "Tips for overnight studying", "iamsupriya_13": "U r really an amazing person...😻", "ms_singh_29": "How to distract myself from phone and concentrate on my studies I m in 12th grade and my concentration level is near to zero😥", "darksunlight_": "Can you get a sudden transformation in a month ? Like if you're not a good student and you work hard, can you get like 80 % above in a month?", "micki_mittal": "Is it important to makr any kind of schedule for the preparation?", "nikitaabritto": "How do we learn Economic Concepts thoroughly #AskSejal", "zoyaiqbal_2579": "Omg sejal u r a complete package", "shillz09": "U should be doing a Sejal than a simran", "afroz.___": "Hiii...i m from bhutan...and i love all your videos❤my question to you is do you support lgbt community??if so what are your positive views on them?", "rivisha_singh": "Hey sejal i really love your work ❤ i wanted to ask u that whats your life was all about during boards as i am in 10 and my boards are going to start in few days #asksejal ❤❤❤", "srish.chai": "how do you stay off social media?", "ashby.andrades": "Tell some of your experience of your board exams?10th/12th?", "katlynrodrigues29": "How do you motivate yourself to get yourself to open your books! How do you let the seriousness set in?", "kanchan.asnani": "I'm in 12th std.. my boards are starting from 12th of march😅 so how to plan what to study? Can you help plss???", "sowmyanadar": "What should one do in these last days of nearing board exams? (Papers/Revision/both)", "nidhigupta_kanwar": "https://www.facebook.com/InspiredLifePage/videos/1643556575766889/ must watch", "neethi_nanaiah": "What kind of a person r u... do u study or pray god n ask him to hlp u pass??😜😜", "ananyyayaya": "Is it important to leave our phones and social media during the exams??? And how not to get distracted by phone??", "justafreen": "Not questions to ask just wanted to say that I love you and you are my true inspiration 😄❤❤..hope you will notice my comment...", "shreyayadav08": "How do I sleep less and focus more?", "abhigyanseverus": "How do you keep your diet in control? And how important is exercise?", "__ankita__k": "Does 12th marks really matter?", "lavanyabhadauriyaa": "How much do you score in your xii ? How can you be so studious.? I", "bhavna_410": "Hey @sejalkumar1195 ! First of all thanks a lot for filming this video,I was really looking out for something like this. Well,I'm a Humanities student and I score average marks in Economics. Please share some tips regarding the preparation of economics exam which can help me score atleast 90%.", "imperfect_sinner_": "How to get a good and decent mark😂? And how to get centum in maths? How to study with focus without getting distracted? 😭", "trishaaaa7797": "I have already passed board exams?!! LOL 😪... Nothing to ask", "s1mple_._": "How to get pass in maths exam...I mean the formulas are very hard...@sejalkumar1195", "nitinbharadwjj": "#asksejal mohak ap ka bf hai....", "_prithikaaa._": "How can we manage time and schedule during the days of revision work?", "roshni_kuk": "Can you please give tricks on time management?", "rprahulj": "So cute😘😘", "shoobroob": "hey.. did u face any family pressure ? if yes how did u cope up with it ?", "puja_budhiraja": "Ur scores", "1929aq": "75% is enough in pre boards?", "apoorva_jain_": "How to prepare for bst exam? Like how to memorize?", "tiny_speck_in_the_univrse": "How to keep in check the addiction to phone during exams!?", "raksha_reddy": "HOW TO RETAIN MOST OF WHAT YOU STUDY", "gaurika_1612": "How do we focus on studies rather than other stuffs like games mobile etc? . I think i tend to waste more time. That i really don't want to😞 any solutions? Btw i love your videos and you too❤", "1aanchal7": "How to relieve the ‘board exam’ stress even if we’v prepared well?", "yadu_clicks": "One of the coolest picture ever", "blueskyandcoffeeonly": "How did u attempted the accounts paper. From the last question or from the first.", "freya_mandlewala": "Oh! Can you just please tell children not to pay much heed to the unnecessary hype and pressure created! We all need to hear that😁😉 @sejalkumar1195", "princess_silly46": "Is the prilimary paper more difficult than the board paper? And the theory of getting 5% less for boards than that scored in prilimary exam.. is that true?", "subahjetlyy": "How to go through those papers that you are not confident about? Is the checking like good or strict", "nikki_deshpan": "How to keep calm and composed and go ahead", "avishi_11": "Boards are easier than any other exam right? ?", "_kriti_barua": "How do you prepare for boards to score more than 95%?", "samikshagoel1": "And also, how to stay motivated throughout the study time", "krii._.tii": "#asksejal tell me how to study SST😂 I am in class 9:')", "prateekakamath": "Ugh I so want a picture like this too! 💕💕", "mihika_10": "Exactly One week to go for boards...How to study for long hours without procrastinating? #asksejal", "aestheticfashionxx": "Q)How to tackle distractions??? In this digital era 😲", "yuti_98": "@a.t.h.a.r.v.a_n.a.i.k I want a picture like this", "iamlmxd": "I Have. 22 Lesson, But I Always Get Distracted By Your Videos ♥️♥️", "lavishadasani": "How to study for your Boards in 7 days? 😂😭🤗 and get 90% ☹️", "riya.kamra": "Give tips on time management", "toiyaba_1599": "what was your pattern of studying - daily bit by bit or before the exams???", "ariannaarmijo": "Loveeee ittt! ❤️", "rejuss_infu": "How to copy in board exams? 😂", "13vaibhavi": "Hey Sejal i m in x class ..how to set a good time table for exams ..to score 80% ..@sejalkumar1195", "nvp.49": "How much did you score in your board exams? PS I love you. #asksejal", "_nidhi.saumya_": "Career options after 12 apart from engineering and medical (ps- jobs whose salary is more than 1 lakh)", "_hibiscuskid_": "Some time management hacks please cause you seem to have nailed it during college 😂 #AskSejal", "riyajoshi__": "How did you study for Maths? Which books did you use? @sejalkumar1195 ❤", "darsh_bh": "How to tackle with the pressure that the society and school puts on us?", "shazannn1": "chemistry - why so hard!", "dishasanganiii": "How to focus better on the subjects you hate?", "prachi_kokad": "Is it okay to take a drop year?", "sanghividhi180501": "How to do maths very well in class 10 so that i can pass very well", "ria.3726": "How u studied in board exam and how you managed to be in SRCC that's my dream college.plz tell me how to get into SRCC and also tell how much hrs we should study in a day .Lots of love❤❤❤", "arujeea": "Its a cliche that ‘no matter try hard if you fail’ really i dont want to listen this", "thepragyashakya": "How to overcome procrastination?", "sayonisen_": "My boards are starting from the 12th of March and I'm super tensed about it! Please give me some motivation to study well. ? That would mean a lot to me! You're truly an inspiration for me❤ #asksejal", "daniya.q": "How to score 80%", "happiness8700163857": "How to deal with boys", "shrutii222": "Is ncert enough for maths class 12 cbse board exam", "_.sudikshaaa._": "How to be concentrated in studies for hours??? Love you sejal. @sejalkumar1195", "aarushiaggarwal_": "@anishasingh13 maaaaaaan❣️", "the_mayathing": "Is it really hard to score good, above 90?😶", "amillicious": "@sejalkumar1195 how to manage time during gaps in board exam", "lalalalalaallagdgdd": "How to stop procastinating????", "nandita.naagar": "How did you prepare for your board exams? And what was your favourite subject 🤗 P.S-I love your videos🤗😇", "__nazma_": "@sejalkumar1195 why everyone feels like they have forgotten everything just before the exam?", "__vishnu.___": "How much did you score in 12th Board Exam?😊", "_snickers__": "Ye ❤ for your picture", "priyankalodha_15": "How much did you score in your boards? 🙈", "suhani_dhaka": "Best tips to stay focused? Where you should study? How to follow the timetable?", "gaurika1.jpg": "Hi Sejal what was your schedule like when you had your exams? Also you are amazing 💕", "shrishti10_09": "Does boards exam marks really matter?..", "indiafinity": "♥️♥️♥️", "the_unplannedwriter": "Wow 😄😄 @sejalkumar1195", "racheta820": "@sejalkumar1195 @mohakpapola You guys are goals❤", "urjamehta3": "How do you stay focused and not distracted by like social media or like YouTube?🙈😂 also love you Sejal❤️❤️", "parthian_komal": "How should we follow the time table ?😂😂❤", "dyuksha_sharma_27": "I’m in 10th and i would be giving full syllabus and board for the very first time . I’m nervous and how should I overcome this nervousness and anxiety? Ps- I love you ❤️", "_kartikaa_.18": "How to study for long hours ? .-."}