{"izunicorn_00": "Did you ever wanted a video or a pic like any other youtuber but stop youself??? If yes, who was that youtuber ??", "niki__1227": "How u deal with hate ? Do u feel jealous of fair complexion people @sejalkumar1195", "spammm_blahh": "Do u wax or shave", "ssharmaxxvii": "Refreshing picture...", "iamshruti_": "🌺🌺🌺", "namrataas": "@sunidhiii_s", "rututu_tututaraa": "@itsipshitabiswas", "social_networking_adviser": "I am promoting new youtuber’s channel for free. DM if you are interested", "__ifrah_khan_": "@shrush_255 ye", "imkhan5510": "Hi", "_.nisaaaaaa_": "In", "sai_chaitra_060107": "Looking as pretty as those flowers", "charutyagi05": "So pretty", "namita300888": "What keeps you motivated ??", "_aashiholic_": "Describe yourself in 2 words... And l just luv u channel ur awesome..", "naam_hai_shatabdi": "DID YOU ever felt guilty about something when u r in ur schools or colleges... Plz share ur experience...❤❤", "bhumikasharma780": "Will u ever do movies or tv series in future????", "its.asima": "Sejal di, if u ever visit Kolkata ,would you like to visit me? And where do u live in Delhi?", "nickycheeky": "1. Did u ever have the slighest doubt wether ul succeed in your decision to be a youtuber ? 2. Did you ever lose ur shit in public or a crowded place. 3. Did u ever regret not having curves (ths is nt intended to offend you) bcz im a curvy plus size girl n i admire your sleak physique. 4 did you ever had to struggle for anything at all in life ???? @sejalkumar1195", "akshathaapai": "What are ur aspirations? Where do u see yourself and with YouTube in 5 years?", "____thegirlnextdoor_____": "Did you like mohak after your first meeting with him? How your love story started?", "manju_meena20": "#lovely ❤", "lost_life_boy": "Looking so killer baby...", "oinny_the_fashionguide": "Did you ever faced failures??", "versatilityprevails": "@iamskeluskar", "yatzz23": "Do u stalk ur followera on insta? @sejalkumar1195", "poorwa_08": "How do you manage your hair? I mean the quality and of course growth. Share something for hair care. @sejalkumar119 ❤❤", "qazdas2000": "who do you get inspired from? who do you look up to? Please pick my question....", "ameena_assif": "I have a question ???? Do u like k- pop? What is ur favourite band! And ur favourite bias", "simransinghpatel": "Also, what according to you is the secret to healthy hair like yours?", "motikumar_9": "Sejal di plz let us know the video editing app that u use u use it like a pro ......and also a huge fan of urs and take behind the scencs of ur photoshoots....and and also also plz send a bday wish for my sister plz di", "deekshaa8": "Do you have a role model? Like a non-youtuber?", "tornado033": "did you ever stalk your subscriber or a follower other than your fan pages?", "swizling_swiz_sakshi": "When u started u career ..in this field...who was your motivation ....love u ..", "mariyahaider_": "How do you take care of your hair", "dishagaglani1": "Your inspiration", "aditirathore2003": "DID YOU think or had any idea about your career during your high school?", "aditidujari4": "How Do you maintain your hairs?", "_vexatious_30": "How do you manage to look so pretty all the time?", "konkonadatta_": "Did you ever got content block? Where you were not able to decide what to do next?", "sandhya1660": "Who is ur best friend", "gunjankapoor_gk": "Just one question.. why so cute?? @sejalkumar1195", "ruchikabose_": "1.How do you edit your Instagram photos? 2.Who is your style inspiration? 3.Favourite online shop to shop from? 4.Which is the Best city you have travelled? 5. Share your most awkward incident in the school? 6.Choose Between Koovs and Shein. 7.Choose between Chai n Coffee. 8.Favourite makeup product? @sejalkumar1195 PS. I'm a big fan of your dancing skills plz make dance covers more........ Plzzzzzzz.", "niranjanbhati49": "Go ahead and kill yourself", "user_._not_found__": "And also what was the most embarrassing moment of your life", "__sanjanaa__6502": "Hi sejal luv u so much! Do u have any fun stories of your childhood", "purplehues__": "Ly loadss ❤ wanted a q and a for sooo long", "mukeshsavla": "Beautiful pretty", "suhaani.__": "Did you ever thought of giving up your current life and do something else?", "miss_hotchpotch": "Hey Sejal di... I'm following you since I had my ph.... love ur work... I am a 1st year literature student. I want to start my new channel... I have ideas.... but also very much nervous.... I really suffering from lack of confidence.... can u give me some tips to be as you???? Btw love ur work .... lots of love and support.", "vaishnabi_nayak": "You are so sweet", "amritraj_17": "It'll be a fun video. Can't wait to see", "dhwaniigautam": "Did you ever made food for Mohak?😂", "_yutee_": "Did you start youtubing in your college or after college?", "the_rachitasharma": "Hi sejal! I wanted ask how do you record your audio for your song covers? Love you!😘 @sejalkumar1195", "anirudh___gupta": "ur fav. youtube channel other than urs itself 😆", "iamsupriya_13": "Lovely", "mahnoor_fatima03": "How old are you and who is your best friend", "swarnaliiiiiiiii": "Did you experience your parents advising against pursuing YouTube as a full fledged career during your initial days of transition from economics to youtube?", "manya912": "What is your pet peeve?", "rainamesina": "Did you not know what you wanted to do when you were in high school and what inspired you to choose youtube as your full time career? love ur channel and how down to earth you are 💚", "amy_amrin": "Did you ever think of doing any job other than YouTube??", "its_krishh__kt": "Hai.....Hello you look very simple I like that you know some girls look like which but you look like very simple very cute very beautiful😊😊😊good morning monkey had breakfast", "sandhyasingh9015": "Did u get jealous because ur friend @komalpandeyofficial with in very few time have more 300k subscribes I watch both of urs videos u both r amazing bt still sense of complexion comes in..plss sejal answer this question.. love u 😀", "dishisanghvi7": "Did you ever regretted a desicion... if yes what ? Did u ever struggle starting a channel as in with camera or equipments or audience or content if yes... what kind of struggles...? share a story! #LoveYou 🥀💕", "bunty.lohar": "Nice sejal", "ijcandys": "🤩🤩🤩", "mahima_.mazumder": "Did you ever wish to be YouTuber in your childhood?If no then,what did you want to be when you were a child? @sejalkumar1195", "natashathakur5": "What are your and @mohakpapola 's plans about marriage?👀", "inmyflaws": "Who are your international fashion inspirations and whose style do you love and follow mostly?", "kasshish_sehgal": "If you want to colour your hair, what color it would be?", "avnisawhney": "Did you expect your channel to grow so big? What advice will you give to upcoming YouTubers?", "rayhab285": "When are you n mohak getting married 😜", "surabhi__pugalia": "What's your secret behind your beautiful legs? Did u ever face the problem of strawberry legs?😅", "gunjanshxrma": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "falguni.bbp": "So beautiful ❤️", "mallaica.khattri": "Luv you a ton💞 @sejalkumar1195", "mylillcorner": "What cartoon u used to watch when u were young", "kumargsvinod": "Is that your cousin brother", "saisakshi": "Your favourite nude lipstick brand and shade ?", "harshitajadhav_26": "What you do for your fitness??", "inkwellofaisha": "did you doesn't make as much for this question as have you. so, have you ever wished you were a different person, doing different things? for example, wished you weren't Indian and were born of another nationality.", "__being_the_you": "Heyy sejal di ! its aadarshini frm Mumbai ............ my question is that there is always a very very friendly, motivating or inspiring teacher in every 1's life. so was there an inspiring, motivating n friendly, teacher in ur life ..?if yes who was it ? His orHer name .....n if no did u wished to hv 1 ??? plzzzzz plzzzz plzzz answer to my question im damn curious n wating to know about the answer", "sanjnasen0408": "Did you even been so drunk you spelt out the deepest secrets?", "i_am__rekha": "Looking good.. @sejalkumar1195", "eesha2288": "Hey sejal!!! Im ur big fan.... 1.do u watch bb ki vines.... 2.best or worst experience from ur class 12th....3.can u say my name plz... Love u so much.... 😘😘", "aakrutiii._": "Do you like Goa??", "samiakhan7570": "Career*", "sanghamitra_sarma": "Hey @sejalkumar1195 🙋🙋 first of all lots of LOVE 💕💕💕 My question is who is your favorite Indian fashion blogger...???", "arivumathi_panivu": "Did you ever regretted being a YouTuber,because in fear of facing hate comments?? 😊", "0099_kajal": "When are you getting married??😂😂", "annika.tandon": "Did you want to live alon or with someone else except ur mom and dad. If yes who will be", "bluntlycheeky_": "Did you enjoy your trip to NYC? And how was your feeling when you met your subscriber there in NYC? #sejalrocks love you @sejalkumar1195", "__meandmine": "How can I start my own music chnnl like you do(filming, recording all of that stuff) ..ps it's really important to me..", "ruthdhamone": "Haven’t seen any videos about environment-friendly options for menstruation? You should use your influence to talk about this. I’m personally using a menstrual cup for the past year and couldn’t be grateful for this change I made..", "hrishika_k": "Wha", "diamondinsky__": "What's the thing currently to get done in your bucket list? @sejalkumar1195 and how do you earn and save money?", "__akankshasingh": "You have $3 to spend at the dollar store, what 3 things do you buy? #asksejal", "aish0309": "How did you got idea for making singing videos?????? #asksejal love you di please pick my question", "_lakshmy__": "What are your future plans ?", "_.edifyingmylifepunita._": "What kind of person you hate the most ??", "satishpatel2004": "Do you know gujarati if yes than speak and show", "aakankshav1": "If you weren't a youtuber, who would you want to be?", "_sunainaamalhotra_": "Did you ever feel lonely in life and had no one and felt kinda depressed and how did you overcome it....?? @sejalkumar1195", "prasanthimalladi": "Did you ever sew a dress for yourself..?? If not do you want to sew one..??", "himavarshachatti": "Hi di love u very much my question is how to teach self love to a depressed friend........", "shivi_raftar": "Nys........", "sravya_godavarti": "What is the most embarrassing moment of your life", "janhavi_sarangi": "Did you ever want to study in a film school abroad?", "jay_ganesh_bappa": "So cute", "vaishnavii.rk": "How to speak so confidently in front of a crowd?? You do it so beautifully! And also please do a meet and greet in Delhi, it's been ages since you've done that also!! #SejalSlays", "unicornsandglitterpoop": "Prettyyy💖💖💖", "__rakshya._p": "Hey sejal i must admit that you arethe prettiest creature god ever created.You are soo cute and humble...SO here is my question is thats are you really passionate about making your fans happy!!!! What was your feelings towards mohak when you met him for the first time ??? I hope uh will answer my question..love love love xoxo", "milzz__09": "Did u ever imagined to have ur own cafe or a restro???? If yess wht would be theme of it??? #AskSejal", "_deepikac": "What’s your favorite part about being a YouTuber?", "taehyungiekookie.xo": "Who's your fvrt singer???? & what's your fvrt song ??? @sejalkumar1195 I love your videos and your editing is superrb adorable, love you @sejalkumar1195", "bhavitaatisha": "Did you ever come to Visakhapatnam?", "honey_bee3681": "Did you ever had or have a crush on someone other than stars?? (i mean people around you ) nd yea except mohak", "sansia.furtado": "Dumbest way you've been injured?", "its_vidhid": "Did you love reading books", "shibi_110": "Why u are so confident", "desi.kochikari": "Which editing software do you use", "radhika_karanth": "Do u ever get a creative block? Like u just can't seem to think of new ideas? If yes what did u do to overcome it?", "preetii_g": "Did u ever bunjee jump?", "_monica19._": "Who is your favorite YouTuber?!!", "mansivpandey": "Did you ever think that you'll reach this far and that so many girls like me would look up to you ??❤❤", "thewriterwillow": "😍", "priyanka3638": "Tell me about your future plans?😊", "s.h.u.b.h.r.a_": "Are you planning to do any further studies?", "navya_510": "When are you gonna marry ?", "aasiyaan_24": "What are the three things on your current bucket list??🔥❤ @sejalkumar1195 #asksejal #Q&A", "navvss.m": "Did u ever think of marrying mohak and have a family with him ??? I ship u guys so bad ... U are goals ❤️❤️❤️", "kritika_dubey4": "Hey! What's your favorite song which you are humming these days", "ahanaoberoi7979": "Did you ever play a prank on your classmates or specially teachers in school??", "tabassum_stark": "How do you afford so many clothes??", "vm_stars_fanclub": "Did you ever felt like nothing can be done by me or like nothing is going right??If yes then plz tell how you'd deal with it???", "_garima.jain_": "Did you ever think of giving up YouTube in the intial days? Keep up the good work", "the_psycherchick": "How do you manage your relationship with mohak...with Indian parents...I mean... keeping it open to them and all (if you get what I mean) 😅???", "sukanyapawar_": "Did you ever experience heart break?", "ujjwalalala": "Did you ever run in races when you were in middle/high school/ college?", "ozil_khan_": "Who is your inspiration?@sejalkumar1195", "noorpari3996": "Do you watch pakistani movies?", "____surreal____": "Did you think of any other professions other than doing YouTube ? 💟 also i love u a lot", "chandrazaima": "Did you ever hide ur question papers from ur parents.??", "afroz.___": "What would you do in life if there was no youtube?...tons of love from bhutan sejal di❤", "comely_philodox_": "What one thing uh achieved in your life that made Ur parents most proud", "_that_instagirl": "Whn are u planning to marry?", "__wordsofheart_": "And you are fokat, useless af ! Get a life. @roshnisharma5676", "k.a.m.a.l.i.k.a": "Did you ever faced racism ... in our Indian society as well ..?", "muskaansethi_": "Did you ever bunk school/college without telling your parents?", "shivangii_shukla": "Hey diii love you......Let me know a good budget camera for filming video and editing software", "buncsss": "did you ever eat breakfast without brushing your teeth first? (that’s just a random question 😂). did you ever get to a point in life where you thought that maybe whatever i am doing isn’t what a should be doing? if yes how did you fix it?", "hastirachh": "Any tips for a solo girl traveling to Europe, Amsterdam in specific? @sejalkumar1195", "shubham31_parit": "😍😍😍😍", "isha_poddar99": "Hi Sejal! First of all I want to say that all your videos are really cool and I like each one of them. My question is... Did you ever go through a phase of depression and if yes then what will you suggest in order to get out of it?", "srilekhyadinavahi": "Did you ever face failure in life?? If yes, how did u??", "aditachatterjee": "Do you ever feel jealous of other bloggers?? @sejalkumar1195", "d.r.u.t.h.i_rao": "What’s your current favourite holiday destination? I’d love to know as it’s summer the holidays season because we’re all travelling. I 💕 your channel. Huge fan Sejal! - Druthi", "shravika_reddyy": "What mohak does??? When are u going to marry ???? @sejalkumar1195 @mohakpapola", "charani_gupta": "Did u say all true products which u use in your videos I mean about your beauty products", "niteshgoku": "Looking very beautiful", "sachi_1807": "Did you ever felt lonely and depressed when u were. A teen@sejalkumar", "p_a_r_u_l_pb": "Did you ever been ashamed of any of your acts if yes, what? And ur damn cool😘😁", "___.roshini.___": "YouTube role model??", "zartasheyeah": "Did you ever came to Pakistan if not would you like to come ?", "discofinchu": "Such a nice picture ♥ I am a traveller 🚅 leaving my footprints 🐾🐾 all around the world 🌏 FOLLOW FOR FOLLOW and DM FOR FREE SHOUTOUTS 🙌🙌", "ishika_choudhary": "Did you have any embarrassing moments in public?", "dreamlikehippies": "Did you anytime get bored of shooting & making videos ovee & over again?", "sameya_s_": "Hey sejal do you have any paranormal experience?if yes please share and i love you soo muchh", "_gauryyy_": "DID YOU EVER FAILED IN A SUBJECT IN YOUR LIFE AND NOT ASHAMED OF IT...I AM BIGGEST FANNNN SEJAL DIDI I LOVE YOU AND YOUR VIDEOS..LUV YOU", "richamittal07": "How you maintain your love life along with your work? Personally It's really hard for me to handle both perfectly.", "sopihe_srihari": "What is ur next plan for ur 💇 ? Btw love u soooo muchhhh sista 😘😘😍😍😍💕💕💕", "dhruvi_vikma": "@sejalkumar1195 Did you ever felt that things were not going the way you wanted them to be but still kept going?😊", "har_qanwal": "Did you ever thought you'll answer this question? 😹", "iamfireandice": "Did you ever go through creative block ever since your Youtube channel started? If yes, how did you deal with it?", "riyainair": "Did you ever cheat in an exam?", "anshpattanaik_": "Natural pic", "ishikamandelia": "Have you ever been confused about a video as in whether people will like it or not?", "_fatema.11": "Did u ever felt like to quit this thing and to do normal job due to pressure of constantly being judged by so many people out there?", "archanaa.x": "Hi Sejal. I am Archana from Qatar. DID", "_nothing___56": "Which one is your best place for shopping ??", "trups_corner": "How much you earn monthly? You can tell according to smart phones and electronics", "sweet_cyanide07": "How many places till date you have visited .", "ap.rn.aa": "Did u ever had the fear of speaking in public..If so how did u overcome those fears...I always suffer frm this..so just curious...and I really get inspired by ur tedtlks😊", "_sarashah__": "Did you ever plan to move from your house and be responsible?", "kooshnita_18": "So pretty love you sejal di😍💕 hello from Mauritius 🌴🤗😍❤", "brownieeboots": "Did you start blogging/vlogging as part time or full time ? If part time when did you decide to transition to full time ?", "tarundixitofficial": "Hey Sejal What camera did u use to shoot Ur first video?? Hope u pick mine", "anusha_koujalagi": "After visiting many places and countries what is your perspective towards everything now? And do u still feel that, after some years you wanna live in mountains or in this citylights?", "just_upasana": "I am a short height girl...I am not insecure..but sometimes I feel that nothing suits me ..and I feel very frustrated...Plz give me some advise?", "priya.m.viji": "Do you cook? What is the best dish that you can cook?", "perkyduos_": "What is blogger mail?@sejalkumar1195 and how can we do sourcing when just about start our blog?", "qatal_e_ishq_": "Did you ever thought about giving up on your dream for which who had done alot,but failed to achieve it.", "sanniaa._": "Did u think of marrying mohak as yet", "prakriti._.jain": "Who was your inspiration when you started your YouTube channel??", "mustufa_2": "So sweet and simple", "_purnima_rana_": "Till when are you planning to work with YouTube ? Do you hace any backup plan ?? ps love your videos ❤", "_thalassophile._": "Does the pressure of doing better ever gets on you?", "ishayadav4": "Where did you learn the editing from?It seems so tough on the adobe software. Give some tips for good editing. Also love you sejal di😘", "shatakshivashishtha": "Well, how did you found yourself growing as a person? And what type of a change did you felt? Was it awkward, weird but later you felt it was good, a contradict of the scenario you were thinking?", "ishani.singhal": "Did you ever think of giving up when success is very slow in the beginning? There are soo many youtubers out there but only a few make it, did you ever feel like you’ll end up being one of the struggling ones?", "myra_0901": "Did you ever try a super crazy makeup or outfit ??", "tr.isha99": "why don't u answer the questions if someone in box's you", "mylifeasrinu": "Did you actually learn editing videos? If no, then how do u developed the skill", "singhvidhi_01": "Do you marry with mohak??", "mundhraisha": "How many countries you have visited? Lots of love❤️ 1M soon😍", "pratichi_sahoo": "Did you ever cheat in exam and when caught blaimed someone else and saved yourself?", "keertivedak": "Do you ever stalk other vloggers on Instagram?", "thatknownstranger_": "DID YOU ever feel to study abroad as your brother did ..? Because I'm 17 and I'm in middle of such a decision", "a.k.p.h.a.n": "Did you ever take a decision which has made a huge impact in your life and you regret for it now?", "haris__umair": "Great keep it up sejal...👍👍👍👍", "mohitkumar251099": "Nyc", "manjusha.24": "#asksejal❤ if you wake up and see all of your subscribers in front of your house when you come out ! what would be your first reaction seeing all of you fans in front of you?", "____.preethi.____": "How has YouTube changed you?", "harinathbabubabu": "plz say how did u shoot so beautifully and more natural and also the way u edit didi and can i know what is the song u used for how to be comfortable video please", "khuushi.guptaa": "hey sejal love you loads💕💕 is it very difficult to get in srcc??", "annuasha": "hey sejal !! my question is which is the one thing that you regret in your life doing or not doing?? .. love your vibes👌👌😊", "thegirlwithcuteness": "How did u become successful?", "immonimakhan": "Did you have any parameters to create separation or a little be between your personal and YouTube life??", "dinesh_2255": "Its a dare for u eat a chilli and then a lemon top of that", "namrata_naringrekar": "Did you enjoyed in mumbai ?I Love ur work so much please do meet and greet in mumbai !💕😌", "iamanushkaverma": "DID YOU ever dunk your head in the Ice bucket or on in the sand of the beach just to relax ? If yes how did it feel?", "druffl3": "What is there at the end of the tunnel?", "lishious_": "Who takes your bomb photographs?😍", "nivedhita_blossoms": "Where did you do your schooling?", "madhur_gawali": "Did you ever think about a back up plan,while beginning YouTube? If yes what was it? @sejalkumar1195", "pratyu.sha___": "Hi Sejal can you please sing a nepali song?", "khushigupta.18": "What is your favourite place in all the places you have traveled to till now?", "b_pranami": "DID YOU ever get any kind of skin allergies and got self conscious about it ?", "suresh.dethe": "Chan", "iamdevika_a": "Did you ever do anything that you regret till this day?", "ayifaah.jpg": "What’s your height", "kjhyfssadchioutreqadvjk_itf": "Did you ever lose hope while doing your stuff? How did you overcome them?", "shanyaverma03": "Did you ever feel that your YouTube channel will not grow when u didn't have enough subs and how did you deal with it? I really need to know this. It'll be of great help!", "twisha_yadav22": "Why did you leave dramatics society???", "anshul.jain.5876060": "Did you has a option to go to Bollywood and act in movies? @sejalkumar1195", "alivaroutray": "From where did you get this confidence!!! @sejalkumar1195", "wildchild_appy": "Hey Sejal I luv ur videos ❤️ did u ever have had a day in your life where you felt of quitting your job as a YouTuber?", "_snehamenon_": "DID YOU ever have crazy cravings for junk food considering how you eat healthy food?", "prachiiiii_02": "Did you or did you not thing about acting in movies. 😌 Love you sejal. And also when are you planning another meet and greet?", "rampal_nehal": "Did you ever feel things aren’t going your way but still kept on?", "anindittaaaa": "How do you make like 2-3 videos in A week? Doesn't it get stressful?", "anjalivn": "Did you ever have acne if yes how did you get rid of it if no any tips plz ?💕", "yuvika.sethi": "What is the place u like to shoot at??", "prabh_jyott": "Did u wanted u tube as a profession", "anjali.bhatnagar_": "During your 12 class how much time did you devoted to your studies?", "aynlza": "Did you ever wanted to go to haunted places?", "nandinee_sarkar": "did you ever got over any crush in your school time..? if yes how...?? 🙄🙄", "_paushali_": "Did you have a crush on any of your fans?", "narender_chitti": "💕😋👼✌😻", "_revaaaaaaaa_": "We all know that your parents were in an army...so,were u in scouts and guides when u were in your school? Iove u so much!!", "aditiighosh": "DID YOU ever think about how awkward and embarrassing it'll be if your college mates find out about your channel? DID YOU feel embarrassed?", "shristi.me": "did you jump seeing so much views and likes on your videos?", "srujanadiaries": "You should do a video on how to dress for winters. Like during the snowy winter, how u dress and tips for winter travel clothing.", "akshataajoshi": "Did you ever try to colour your hair? Or are you thinking to do it? PS - You've got beautiful hair💕", "shrxyyaa": "Hii will you be continuing YouTube or u will go in films 🎥", "ruchikasharmaa_": "Did you ever tried stalking your crush", "snigdha_khatri": "Did you ever had a dream that you don't exactly remember but you know that it was a very scary one and you dont wanna remember it but still wanna figure out what it was about ... .!!??? @sejalkumar1195 This one is fun.. Ps I love you and your talent 💝💝💝💝💝😍😍😍😍😍😍😍😍😘😘😘😘😘😘😘😘😘😘😘😘❤❤❤", "laxmi_kunwar": "Hae #seju ...it's me laxmi frOm NEPAL...love ur channel ,ur style, ur vOice absolutely.... Nd i had watched ur trip tO nepal...u came tO pOkhara ryt.... SO when will be ur nxt visit tO nepal... ???", "aurpona": "Did you ever live with a dog? When?/ Why not?", "smilie_027": "Did you ever thought that YouTube could bring you so much happiness and success?", "praseela": "Did you ever want to follow your mothers footsteps and be a doctor? Also, did at any point you had a bad time in your Europe trip which made you want to go back home? (also planning a trip)", "_bookish.wonders_": "Hey Sejal! Did you ever think about quitting YouTube at your initial days when your videos were not this popular? Like frustrated and all about not gaining the popularity for all your hard work?", "joshi_aditi24": "Did you ever eat so much that you felt as if you were gonna explode?😂 And, I love your videos! they're fabulous 😘🖤", "shabin_syd": "How do you find such awesome locations for shoot? @sejalkumar1195", "im__pixie__": "❤❤❤❤❤❤", "harshitamathur_": "Did you ever get the feeling of I am the worst? Did you ever face any discrimination?", "maisha_bagchi": "Do u still go to The Danceworx and if not will you ever join back?", "sharonsarahgeorge": "Hey Sejal! Just wanted to ask u what made u start youtubing, and what would be Ur advice to someone who wants to start a YouTube channel?", "mouparna_chandra": "Did you have anything super secret which you u would love to share with us...About your college life? ?", "crazy_fashion_14": "Choose one : mom or dad!!", "gowri_2.0.0.0": "@sejalkumar1195 How do you edit your Instagram pictures?...Do you have any particular app for it?......coz your Instagram pictures are superb.....I really like your channel and you...will ALWAYS support you and your channel....a fan from Kerala 😗😙😗😙", "shweta_menon_13": "Did u ever face a heart break? If yes then how?", "apoorva_padmanabhan": "Did you learn to sing? If yes, what style?", "niharika.manohar": "Tell me how to be happy...not thinking about anything & any one I just wana be happy ....", "flowerfairy_300696": "Your current fav makeup products...", "basha__kulsum": "Did you ever try to hide in washroom 😂😂@sejalkumar1195", "shreya0410": "Tv series you are watching currently??", "adkardeepika": "What you think about true LOVE ?", "dhwanibhargava85": "Did you ever bunk college or school?😂", "dearbaisakhi": "Who were ur best frnds from childhood name them🤗", "shona_starlet95": "When is ur marriage ...???", "_story_of_me_24_": "hey sejal i am ur biggest fan i made an account on insta only to follow u the quest i would like to ask u is that one thing that :- sucks u a lot,u love and do to afraid from dark.do u like watching cricket if yes if team u r supporting right now.", "_anvi_vijh_": "Did you ever fight with mohak?", "pooja_s_murthy": "How did you promote your channel at the beginning.. #Loads of love", "tishachhabra_": "Hey di love your videos my question is how do you maintain your YouTube channel and mohak and what is the most annoying habit of mahak😍😍😍😘😘😘😘😍😍😘", "_saramsha": "Did you ever cheat in exam😂? If yes.. did someone catch you??", "slayingbutterfly": "Did you ever met into a huge trouble and didn't told you Mom&dad about? And what's it? Ya. excited 😛❤", "yours____anonymously": "Where do you see yourself in 20 years? And how are you so awesome", "dhaarnak": "Did you ever lie to someone you love?", "paawanisharma_": "Did u ever missed ur ex ?", "_gaurie__": "How did you told about Mohak's and your relation at your home ? 😀😀", "bhowmikneha16": "Please tell me how to be happy without keep stressing before exams?", "anindita._.g": "Did you ever judge anyone by their appearance and later on when you got to know him/her regretted your decision?", "niyatig03": "Who is Ur inspiration??", "_aditi.joshi_": "Hey sejal i want to know where do you see yourself in the next 5 years!", "ritazzled": "Hey @sejalkumar1195 What are your future goals apart from growing your YouTube channel? Love you💞💞", "arunkumar.jaimini": "Gorgeous", "paridhi_dolly": "Can you just tell me the song which u took in your NYC video!!!", "meenu7_7": "Are ur parents open to the kinda comments u get I mean both good and bad comment ? Were they okay for u to choose you tubing as a carrier of urs", "thefebruarygirl_": "Hey sejal! I want to ask what's the secret or mantra of your fitness ?", "madhubarshi_sengupta": "Want a video on how to develop a versatile wardrobe", "aayushipanwar_": "What is your height, age..?", "_.tanusharma._": "How did u learnt playing ukulele as I also want to learn to play it..", "bhawna_patnaik": "Also i like to know how you shoot your video and manage your day", "priyankaranikalita7": "i sejal. i m ur biggest fan 😊😊😊", "iamvanitasingh": "Did you expect that you'll become youtube celebrity?", "anjaliiiiiiiiiiiiii_": "Have you been in depression in your life", "pragatitiwari03": "How to be famous like u #asksejal", "renukakende": "Which camera and which video editing software do you use? Also, it seems weird right when you are in the middle of the crowd and shooting and all people are like staring at you? How do you manage these things? I'm really curious!!!!", "the_hemalatha_sattu": "Can u share ur skin care routine? 💞", "radhikavernekar27": "Dude ua a gr8 youtuber. ...n ua vedios r just awesom ...pls try do more vedio in a week ..coz I love watching ua New vedio", "snehil_157": "hi sejal didi .I just love your videos . i just started my channel got inspired by you could you please give me some vlogging tips", "garima.tiwarii": "Hey sejal! Love you so much..so my question is that you and mohak..did you ppl thought of your entire life together?", "dhanyeahhh": "Did you ever feel insecure about something in yourself or your life while growing up?", "urjamehta3": "Did you ever regret starting YouTube ?", "sanjana_1196_": "When are you planning to take vlogs of south india? @sejalkumar1195", "m.7ania": "how did u started ur utube career?", "mala.ranjan": "Do you play any instrument then please play it L❤️❤️VE u :)", "dolma_sharma": "beauty pageant tips?? And how to prepare for auditions??", "aanchal__chandel": "DID YOU have any regrets in life ?", "theolivediary": "Did you had a makeover before opening your channel?", "_priyanka_._gupta_": "Hey sejal😘😘😘.... Did you ever had second thoughts about taking youtube as a full time job??", "simply___delight": "@sejalkumar1995 what to do during summer vaction??", "priya_kushwaha21": "When will you marry Mohak??😍", "blissxfulll": "Did you ever thought of giving an audition for big boss??", "sanalbadalia07": "Are your parents happy with your relationship with mohak..? What are your future plans about marriage..?", "qwerty09angel": "Cutee", "purviichxwla": "i have just started a youtube channel please give me some tips please♥️♥️♥️ By the way i am your big fan since ur first video and my channel name is Purviixoxo", "seth_sugandha": "7", "imjust.a": "@sejalkumar1195 #asksejal As a girl in a country like india where rapes happen regularly and to even tiny tots have you ever felt the need to actually do something against this using the influence you have put on a wide range of youngsters?", "nishadipwal94": "Who is your style icon sejal ?", "natashajacobx": "@sejalkumar1195 did you ever wish to be kissed by someone embarrassing???😅😅😅😇😇😇😇😍😍😍", "aryanagarwal2183": "Did you ever ponder \"Whats next for life\"?", "navyaa_2006": "Hey I am a fan of your videos and I wanted to ask that what are your hobbies and what would you do if have a chance to do anything you want", "anuradha_ghosh_": "Did you hear the name of rabindranath tagore & santiniketan?? And did you ever think of coming to santiniketan for a small trip?? Pls do come here... I'm from santiniketan.. & you know what I love your channel & you a lot... You are such a inspiration for our generation.... Love you a lot...", "nikhila.d": "Did you ever spit water on someone while laughing?", "varada__menon": "What is the first thing you instantly notice about people?", "somerandomchi_k": "Did you ever feel like uh are empty from inside? Btw love uh sejal mam...😘❤", "appiee1108": "What sunscreen you use in summer ??", "kimayag1": "What are yout plans five years from now?Wilk you continue youtube after marriage?", "lost_in_mayhems": "How do you maintain a balance with your work n personal life with so many nosy heads ? Has your personal life ever affected for the same ?", "ananya_shanker": "@sejalkumar1195 how did you plan to start your own Youtube channel?", "_.rebs.__": "Did you ever get really angry on Mohak .if yes then why ??", "priyanka_sehgal97": "Did you get your parents support while starting your YouTube channel?", "deepika.padukone00": "Did u think about what would you do when u were done with your 10 standard", "_hopeless__soul_": "Are u and mohak planning to get married? Love u sejal!!", "abhisri4293": "Hi sejal! what editing software you used at the beginning of channel and now? Name few of them", "thorataparna": "Hi sejal till when will you stay on youtube", "rajeswarirao": "How will you manage outside world with your existing fame? Any embracement situations? Or any happy moments??", "adorableheartt": "Hiii @sejalkumar1195 this is Sneha.Satish from manglore!Ur channel be the best nd love u a lot for that sejal😘So my question is....Have u ever faced a situation where in u happen to meet one of ur channel viewers and hv been embarrased coz of their questions?If yes do u remember who nd pls explain us abt a the incident!love=@sejalkumar1195 ....😍😘", "mrunaal5598": "What are your all time favorite books!! I love you ❤", "veda.samala": "Did you anytime forget to talk to Mohak or did you ever prank him by ignoring him??😀😀😀 and I love you alot I have been watching ur videos frm 8th class. You are a awesome youtuber I can see your channel hitting 1 million soon 😁😁😁😁😁😁😁😁❤❤❤❤❤❤❤❤❤", "alkaarora_": "Did you ever slap Mohak when you were angry? 😂", "chaitalibehrani_": "Who did you miss more while you were in NYC :- your parents or Mohak ?", "shweta_66": "DID YOU ever go through a phase where everything seemed wrong and you were sad without even knowing the reason for it...where you felt hurt, irritated,lost and under confident? If yes, how did you get over it and what is your advice?", "kritiguptakg": "Did you ever feel that you are not beautiful enough? because I go through this everytime. If yes then how do you overcome that feeling? #qandasession #sejalkumar", "dyuksha_sharma_27": "How has been your school life ?", "karpagameenakshi": "When r u gonna get married?", "chetalisavalia": "@vedika22", "vidya1990libra": "Hi sejal.. When is your next make over??", "ericahazel_xx": "WHY ARE SO PRETTY. WHY? I NEED THE ANSWER TO THIS OKAY!?!??? OKAY.", "divaa_sejal": "Any quote which inspired you the most in life? @sejalkumar1195", "craziestp": "Did you ever eat anything weird and actually liked it? @sejalkumar1195 #foryourq&a", "notso_basic_guy": "❤️", "srestha_10": "Did you ever think of coming to Calcutta for a meet and greet.? Please do come . I really want to meet you. Love you so much Sejal ❤", "selomigarnaik": "Did u ever thought of pursuing ur career in singing? Coz ur covers are on point! 😍😘", "maaaahi_sharmaa": "Describe your school life", "_aayu_salvi_": "Did u ever thought that ur long hair was much more beautiful than the shorter ones??", "niveditaag": "How did your parents come to know about you dating mohak? And how did they react? Please answer!", "rainashah.x": "Did u loved mohak trulyy i cant see him in ur chanel", "rhea_0810": "Did you ever have a crazy fan meet up if yes then definitely share it I would love to know it xoxo love", "_quintrelle_": "Did u ever face negativity and depression in your life and if yes how do u deal with it????love sejal a huge fan girl😍😍😍😍", "kaur_deee": "Did you ever do something you regret?", "gold.gopinath": "WOW cho chweet", "janhavi_srinivas": "How many years has it been since u and mohak have been dating...? Will u marry him?", "iincredibleii": "Did you ever thought of Banning CBSE in your school days?", "_srush___": "Did you ever make out with a stranger?", "shravz_12": "Do u miss ur childhood?", "_.rimjhimm.__": "Did you ever thought to quit youtube hai do a 9 to 5 job.. Btw ily❤❤", "suvam_ghosh25": "Can you please mention the names of the songs you use in your vlogs! The choices are very good and we all want to listen the songs over and again!🙂", "aaannnniii16_": "@sejalkumar1195 what is your favourite dish Ps plz say my name in the video I am aaliyan", "princess.rawat": "Did you ever fall in front of your fans? 😂", "harshitha_sa": "Did you kill any insect?", "jyotsna.ram": "Did you know you'd like to travel the world", "__.nanditaaa": "When will you keep meet and greet in mumbai😶?u often visit there anyways!", "ekta4sure": "Did you always get lots of views since the beginning, If yes then Yayyy❤ but if no then how many were they ?", "iamdebaratna": "@shruti.sahoo 😍😍😍", "manipthapa": "Wow beautiful pic", "capture_themoments22": "Did you ever shoot a video but didn't post it?", "prisha._.4": "Did you ever thought that you will be this big youtuber and giving tips on big platforms ?????love you Sejal...pls answer my questions", "curious.case.of.a.happy.ball": "Did you ever have a depression phase on your life, if yes how did you overcome it?", "w.a.n.g.m.o_": "Did u ever had two crush at the same time?🤣🤣", "shagun_routray": "What is the most comfortable outfit you would go with?", "anaghamohan253": "What kind of workout routine do you follow", "aditi_02_": "You didnt go for a 9 to 5 job because you were earning the average amount from youtube that they were paying but in those \" office \" jobs you get promotions amd earn way more than that you earn in start but this is not the case in youtube channel how do you feel about it when you see your friends from same college earning mose", "hemanii_9": "Did you ever got jealous from some other fellow youtuber? In any way?", "arundhatii2004": "Did you ever tried to think about any other job rather than youtubing", "anusha_thakur_": "Which is your favourite city? Also which country do you plan to visit next?", "nidhi.shenvi": "Which will be the next country you will be visiting? Or which bucket list you would like to tick?", "areesha_07": "How many pairs of shoes do you currently own? @sejalkumar1195", "prajna2642": "Did you first propose mohak or did he??", "aiswaryyyaaa": "Did ever feel that you would not do good in your board exams?", "priyamehta1069": "your favourite place to visit in mumbai", "_spam.__.account_": "Did you ever try to copy other youtube videos ? 😅", "misswildchild2000": "N m an Youtuber. Bt 2 to 3 videos if mine i spent hrs recording. Bt didn't turn good enough to upload. N now m kinda blocked. What do i do? Plz plz plz help. Love u❤❤❤", "ananya_lakshmish": "How did you manage ur college and YouTube? How is your YouTube journey so far?❤love u❤@sejalkumar1195", "vidhya.79": "Health tips", "kkashish_r": "Did you ever made funny faces/go mad/be yourself when you are alone ? @sejalkumar1195", "vallabhi.shah": "U seem to be so busy in your work. Does mohak get affected if you are not able to give him enough time?", "_.lavvanya_m": "When was the first time that you felt a sense of accomplishment in your life?", "thatbrowneyedgirl_03": "😊😊😊👌👌👌", "darksunlight_": "What are your views on the economics re exams 😭", "chandamma_": "Loved your backpacking video. How do you find courage to travel solo? What were the safety measures you took while traveling solo.Please make a video on it.Love😘", "__anushuya": "DID YOU ever think that your parents would not come to pick you up from a particular class and have forgotten about you??", "shan_bhattacharjeee": "Did you ever feel that Lay's could fill in their packets with more chips instead of air?", "wifi_princess2004": "Skincare tips", "elleiraann": "Did you ever fall into a manipulative trap and how did you get out?", "fauz_iahhh": "Who is more supportive in your family to support to you through your career??? Love your necklace 💕", "radharajesh23": "How can travel so much and how do gain that much money only on you tube ?love you😘", "janvi.balwani": "Did you ever prank mohak? Please tell how and when if you did😆", "_.jasmitadash._": "When will you get married to mohak bhai? P.S-my fav couple @sejalkumar1195 di love you and your work ❤️❤️❤️❤️", "thesarcalect": "Did you book your tickets for the Infinity Wars? 😋", "sayed_suhana": "Did u ever went on a blind date ???", "pratika_mehra": "DID YOU EVER FEEL LIKE GIVING UP ON YOUTUBE?", "the_9999h": "Hi Sejal Di. I am getting so much inspire from you related to fashion ,and future inYouTube .. Did you ever had a course related to fashion and how to face the camera in front of so many people ?? I mean it's different to face the camera and talking to many people in other countries. Hope I got a reply from you .. Love from Odisha .", "sukaina_fatema": "R u having meet and greet in Mumbai anytime soon?", "nidachauhan": "Hi @sejalkumar1195", "_.bhumiagrawal._": "Did u ever feel like quitting YouTube? And would you encourage new YouTubers right now with the new changes in youtube and monetization? Btw Lysm💞", "bishtavani": "Were come you're parents always okay about you dating mohak? When did you tell you're parents about him?", "poymanty": "How u give time equally to your family and work ?...as u have a busy schedule", "_hummingdreamer_": "I sejal Di!!! I am your biggest fan... Like biggest one..I am Tanvi.....Your the most beautiful sweet person I have seen on YouTube I love u I will start a channel when I'll be your age ....what advice would you like give me ..... I love the most SEJAL DI..... LOVE TANVI", "teerthabmenon": "Imagine you are alone at home, lonely and bored. Who would you like/wish to be together with at that time?", "amandaarebel": "Did you ever believe that you were inadequate, unworthy or unwanted? If you did, then how did you get over depressive thoughts and what do you do improve self esteem?", "reshmapshah": "did you ever thought of doing something other than starting a youtube channel like in any other field or any career plans (not related to youtube )", "dr_aishwarya_rout": "If you are ask to be one of the disney princess then who do you like to be????and why???? Btw love your videos and voice....God bless you💕", "snehithasoma": "Hai sejal!! I am following u since the very beginning. I have seen u growing up your channel and always felt positive listening to u. You are an insipiration. My question for you is \"did u ever think when you were a kid that you will achieve this huge at such young age \" ?? Please answer me @sejalkumar1195", "snehadutta": "When are you visiting Kolkata?? Anytime soon??? Xoxo", "divya.varma": "How we girls (girls of any age) be safe in this world ???can give us some tips...", "ankita_bardhan": "What's your skin care routine?? 💞💞", "disha_1423": "How did u tell its parents abt ur relationship?? How much do u like you youtubing??", "nirmitee_20": "How did you plan out ur whole Europe trip... like the places to visit n how to travel n hostel bookings...n btw I'm a big big fan love your videos I start watching one n end up watching a lot of em...", "dromer_meisie": "will you ever do a fan meet in Bangladesh?? lots of love from Bangladesh ♥♥", "avani_satra": "Do you ever become more romantic than mohak or cheesy w him???? Ps: i am really crushing over him❤❤😍", "ananyam101": "Favourite city?", "venwhen2000": "Did you ever own a pet? If yes, what was it?", "varsha_anu45": "Hy sejal...which youtuber u want to collab with and what will be the content of the collaboration??", "naam.mein.kya_hai": "Hi sejal.. you are my inspiration.. and let me tell you your videos are a mood booster.. I just love them.. I always wanted to ask you this question.. what do you prefer marriage or livein? How do you deal with your work and relation at the same time.. I know my questions might seem to you that they are out of the blue but still it matters as you are a youtuber and you travel so much and meet new people and gain experiences.. I am just curious that does all this changed any thing in you?", "simnaqvi": "@sejalkumar1195 Did you visit all the countries on your bucket list?✈️🌏", "sanjanasurekharaghunath129": "Rapid fire:1.Have u ever lied to Mohok?if yes what was it about. 2.Biggest fear in life??? 3.favorite Indian YouTuber and blogger. 4.the one adventure u want to in life but u are scared... 5.ur dream destination... (Hope u pick my question). Lots of love from Bangalore", "lauvamy": "3 Most embarrassing moments in ur life. ...", "mahibakshiofficial": "What mic do you use? @sejalkumar1195", "uswajiwani": "Did you ever think you would take your channel this far? Considering it’s still hard to explain people what youtube is and how is it a full time job. Love you sejal💞🖤", "juhithanvi": "Are you planning to pursue masters in the near future or only Youtube? @sejalkumar1195", "vedikaakhramka": "How old are you", "accounttosale.india_only": "hey!! @sejalkumar1195 di❤️ I'm a b.com 2nd semester's student. and I'm about to start a YouTube channel. I already research a lot about it. I will start it after my semester exams. It will be very helpful if you give me some advice or tips before starting my channel. love you❤️😚", "anannyaa_r": "Tell us about your friendship with @yadu_clicks please!", "parupics": "Did you think of doing video/s on beachwear?", "aachalguptaa": "Legit your hair looks natural even though you do straightening...how is it possible?", "deesha_shenoy": "Did you date anyone before mohak??", "sriii.dange": "Did you ever had other crushes other than Mohak or any heart break stories to tell ?! @sejalkumar1195 #asksejal", "shreyabatraa": "Did you know you'd succeed at youtube when you started it?", "scisandhya": "Nice one", "dreaming_wide_awake_": "Did you ever drunk text/ dialed your ex boyfriend ?", "mashadarora": "Did you have any particular YouTube role models you looked up to when getting started?", "_ishasingh": "Which Bollywood movies are your absolute favourite and which one has the best album according to you? Also, did you ever expect to make it so big and lovely so soon and that a ton of oppurtunities will come your way that many others in the same field aren’t getting. Like you’ve made it super big at such a young age! ❤️ Lots and lots of love and warmth xx ❤️❤️❤️", "chinmayee.shenvi": "DID YOU ever have second thoughts after you took YouTube as your full-time career?", "__amruthaaaa_": "Did you ever think to stop posting YouTube video and getting back on your job as a C.A or something ??", "radhika.sahil": "Where did you learn Music in Gurgaon?", "monika_chatterjee15": "When is your first kiss 😋😋", "ankita322": "Please do collab with ashish chanchlani some time...", "gangakhedkar_yash_23": "What keeps you going in ghis world of internet where evey girl is the victim of cyber bullying and how do you deal with it???? Btw love your videos and your content...", "vichitranaaari": "Did you take training in Western vocals? Because your voice is so unique and amazing..And if yes, then from where? ❤❤", "spurthy": "Did you do anything illegal and got away with it?😄", "gargi_11.12": "If ur youtube career wouldn't have been successful then what would u be now?", "vandana_b": "Did you ever get disappointed on the response to any video of yours? If yes, which one?", "samikshaaax": "Did you ever sneak out of your house? If yes, how was the experience?", "gaurivyas02": "Did you ever feel fustrated when your channel wasn't doing great at some point of time?", "dhriti239": "❤️", "kam_810": "Hi Sejal.. I really appreciate your work @sejalkumar1195 .. I want to know about bonding between you and your mother... That how you spend time with your mom in daily routine.. Just curious.. LOVE to you and your mum.. 💕 Keep going.. 👍", "nayana_35": "What are your future plans regarding studies? @sejalkumar1195", "labdhi._": "How much do you earn?", "pujachoudhury018": "What are your weaknesses and who are your strengths to overcome that weakness...crazy to know about it...luv from assam💓", "color.chemist": "Did ever were in depression or anxiety ?", "mou_saikiaa": "What is the first thing you have gifted to your parents with your own income? @sejalkumar1195 #AskSejal #indianyoutuber", "joieta._.2107": "DID YOU ever leave hope and feel absolutely miserable in a situation and what was the source of motivation?", "aishwarya.elizabeth": "Did you ever use a mobile camera to film a video?", "ll_bushrrrraaaaaa_ll": "Did you do any beauty enhancing surgeries??", "pragnya.kankan": "Any other relationship other than mohak??", "malviyaakanksha924": "Did you ever went to a place where you just felt like it would have been better if you never had gone to that place?", "shreyeaaaahh": "What are your plans for your channel in future.", "bakshi_arpita": "Did you ever fight with Mohak XD ? How do those fights end up,how do you resolve those? :P", "jaimie_xmats": "Favourite YouTuber?", "sanasachit": "How are you so motivated to do your workouts ??", "_pravalikajoy_": "Did you ever imagine that youtube would become your career??", "theyellow.kolhapuri": "What things where ticked off your check list this year?", "ultimaterutpreet": "How to pose plz also upload that", "xtracheesy": "Did you ever feel jealous of other fashion bloggers? Who's your favourite indian fashion blogger? ♥️", "ashwinijoglekar": "Did you face a major content block in your YouTube career? If yes, how did you overcome it?", "hari.storyteller7": "U seem to be a very nice person Sejal by my question to u is that apart from d happy person u carry ,way r d points that u r still finding fulfillment in.. and that u crave Rit now..in any area of life", "gladandrad": "5 things you love about mohak, Your life and parents❤", "deepika_ramachandran6": "How did you meet mohak your love story ?", "damaniyashita": "Did you ever make your videos thinking how others would react to it (like did you ever feel log Kya kahenge )or did u just do what u loved ?", "krisp13303": "Did you ever got much worried about your skin, weight clothes? How do you deal with it?", "bhumi_lachhwani": "Your tips for those who have just begun blogging..???", "rinkibakshi": "How do u and mohak keep everything gng on so smoothly inspite of ur busy schedule/shoots/events/trips and his job?", "vincy_hjk": "DID YOU ever wish to become an actor ?? DID YOU ever wish to live alone/independently?? Or are you planning??", "unna_teee": "And also you were planning to visit Goa?", "naisha_sachdev4": "Did you ever travel to a place and felt like never coming back?", "nishkyaaon": "Hurts that people don't know you have to use present tense of a word after 'did'", "tara_sha_": "Did you go through the times when you feel whatever the scarifices and time you alloted for getting a thing are waste and you know thats your make or break situation but dont get whats wrong and end up by messing up things?", "muskanngargg": "Heyyy sejall. How do you explain your profession to your relatives as this youtube thing is not a stable carrier option for them? I hope you answer😘", "sejalbhattad": "Did you ever have serious problems with your friends? Like they backstab you and stuff like that? If yes then how did you get over it? Btw I'm Sejal too and I love your videos! Keep growing and good luck👍👍💙", "sanjana.gunti": "Your First check amount from YouTube?", "muskaangugnani": "Did u ever fault in public", "flyingirl_12": "Do you think you would make youtube videos after 10-15 years? If not what would you do for your bread and butter?", "aashimaurya18": "Hey Sejal! I love your channel!! I wanted to ask that how did you got so many subscribers? I also want to make a YouTube channel please give me some tips and advises! Love you! ♥️🌸", "ppsatina": "Did you ever felt worthless if yes then how did you get over it", "rupal_pandey": "If u r not a YouTuber than what else?", "sakshi____05": "Since how long r u dating mohak", "sudeshna_ghosh05": "@sejalkumar1195 did u ever have an one sided love or crush?", "mehtanidhi12396": "How do manage to see in the 2 inch GoPro screen while shooting? Also, can you show what accessories do you use while taking some of those travel vlog shots? I am buying one so I want to know😇", "mrinal_redij": "Had you imagined ever that you will visit so many countries? And how do you feel when you go through the travel memories @sejalkumar1195? Lots of love 😘😘😘", "mantriaarya": "Did you ever think of colouring your hair?", "anushka_._rungta": "Did you ever thought that YouTube and Instagram are consuming too much of your personal space? Like you're giving too much of yourself to people.", "yashvi_karia": "Di", "astha.tripathi.39": "Did you ever get in a situation where u was apposed by ur parents and u tried hard to get them convinced coz ur parents looks so cute n ur relationship is also very cool with them...??", "mehtaanjali11": "Why do your views seem to be falling ?", "dr.n.s95": "Who’s your favourite youtuber from India? @sejalkumar1195", "sujhaaa": "Hello sejal ... did u visit any northeast states? Please come to sikkim and vlog there I hope you'll like it there.", "makwana.nidhi": "Did you ever do smthng fun and adventurous whch people dnt knw abt or stole smthng of mohak witout lettng him knw?", "jyothi_bommisetti": "Did u ever score something bad and lie to ur parents?", "blossom24166": "Did you ever thought of becoming a gynecologist like your mother ? @sejalkumar1195", "meeranair05": "Did you ever feel less motivated and come close to quitting YouTube?", "prerona_postrona": "Did you face any sexism in the youtube community because you are a woman?", "teja.rampalli": "You are studying economics in undergrad! So what are your career goals?", "parniti_bhopal": "Plzz tell aboutt the course you did in tukey", "shalini_dutta25": "Did you ever face teenage heart breaks and took drastic steps?", "_madhurimasarkar_": "Did you ever Bunk classes in college to go out with Mohak ?😂", "i.shahesta": "Did u ever thought of quitting youtube? If u ever thought plz nvr do it .. u r gr8.. i love ur videos.. u r simple tht makes a lot of difference.", "harshitha_reddy09": "Hey Sejal Sis which is your favorite cartoon character 😀", "apoorvi_b": "Did you ever pee in a swimming pool? Lol", "shivangii._.pandey": "God you're gorgeous ♥️♥️", "rhemehra26": "#didyou did you ever feel like giving up between your YouTube journey?", "iamanupriyathakur": "Did you ever felt like you should leave YouTube and start doing something else for your career? If yes, when and why?", "nikkiwalia5": "How do you keep yourself motivated? Also, what drives you to do better and rise up to the challenge at hand?", "aishvarya.khare": "What more countries are you going to visit?", "that_girl_browny": "Did you ever thought of being invisible and also having the power to read people's mind?", "rebecca_bhosle": "Did you ever regret posting any particular video on YouTube? . Did you ever shoot a video but didn't upload it because it didn't turn out well? . Do you stalk your followers on Instagram? . Did you ever do something embarrassing in public just for the gram? If yes, what was it? . Did you ever create imaginary scenarios of your wedding in your head? If yes, tell us details about it lol. . Growing up, did you ever consider being a doctor since your mom's a doctor?", "urzzaa_11": "Hi sejal!!! I love your channel 😍💕and your videos especially your travel vlogs!!!!!I also love the way you dress as even my style is something like 'comfy but at the same time it should look good'🌎 .........you are my inspiration!!!!.💞..........DID YOU EVER FEEL NERVOUS WHEN YOU WERE ON STAGE ???IF YES ,WHEN WAS IT AND HOW DID IT GO???", "aakritinirala": "Did you visit the Central Perk Cafe during your visit in NYC?", "yogita.aswani": "Please do QA session with Mohak.", "__arshee__": "Where is Mohak ? Plzz do a video with him .. We all miss him .. 😭😢", "rhea30._": "Hii Ur greatest fear and have to had a experience with a ghost??", "manishaa0365": "Your age", "nehaimran____": "How do you make each video with the same enthusiasm and energy? What gets you going?", "garimazy": "What is one affordable yet good camera you'd recommend to amateur YouTubers who are initiating their journey?", "ariyagarwal": "Heyy Sejal !! Truly love your videos. Here are few questions - 1. Favourite holiday destination? 2. Instagram or Snapchat? 3. Most funny moment?", "sonali.08": "pretty", "wonderfully_weird_girl": "Oh god u posted it just only few mints ago and alrdy so many comments. You won't even notice me I guess. But if you do then my question for you is what is the craziest thing you habe done according to you in Newyork and your Euro trip? And also there is another question I really wanna ask is what is the most regular job you are terrible at? (For example: cooking, ironing, shopping for veggies and food ingredients etc.)", "troublemaker_since96": "Did you ever stayed at Delhi or Noida all by yourself? I've just got over with my engineering and will be going to noida shortly. I have been staying at hostel for the past 4years but people are telling noida is not safe enough. So I am very scared about staying in Noida by myself! Please help me out here 😕 and Sejal I love you and your work ❤ You are so inspiring 🌸 @sejalkumar1195", "adhikarismriti0804": "How did you learn to play ukelele ? Could you share that with us ? We love you Sejal ❤", "_shrulovestea_": "Did you have another boyfriend other than mohak?", "priiyankac": "How did you manage to tell about your relationship with mohak to your parents ? I mean suggest us how to talk and get more comfortable with parents about these things.", "sanika_sansare_official": "DID YOU plan to visit anywhere in india now? since we know ...you have visited a lot of countries lately...which was you fav out of all....n whats your next bucket list destination?.... plz give me a shoutout ...love you!", "bunny_kothuru": "Did u evr feel ashamed?", "yuvikapuru": "Did you ever have original content?", "kaurajahnvi": "Your favorite holiday destination? And favorite video of yours? 😍", "nataliainsta_170": "Did you ?? How did you become extrovert? Some tips for public speaking....", "fatimah_akram": "When will you merry", "saisha999": "I one of your biggest fans and you are an inspiration for me . I am inspired from you to start a youtube channel and i will be starting it soon . Can you give any suggestion so that my channel can also become successful. Love you loads diii ❤ -Saisha", "emima04": "Did u ever give ur name for elections in school or college??", "sathvika_01": "Tell us that one thing which you try learn from your YouTube family, maybe from the ones who give the hate comment or from the ones that show love, what would be the one most important thing that you learn which helps you grow", "ohmygauri": "What was your best and worst situation in high school? Lots of love from bangalore sejal💕", "shivani_sahotra": "How you always stay smiley😊 and positive😇??please share,it might help us", "arvindkumar.1005": "Beautiful 👌😍😍😍", "bhartiyamamta": "Did you ever went out of focus and concentration in your work and what did you do to get back into it?", "himanshijindal07": "What kind of clothes should a chubby person like me wear? I always get confused 😔😢. Please help me. Every blogger tells for slim girls but not for chubby person. 😞", "ananyasharma2000": "Did you have another boyfriend other than mohak?", "arussshhi": "❤❤", "manjeeta_kayastha": "U r huge inspiration to me sejal dd ..l love u so much ..Please tell some tips for new youtuber ..how to grow channel fast and how to be more confident ?? Please answer d love u ❤❤😍😘😘", "vyhini.koka": "Did you.? How do u edit ur videos?", "radhika_miglani": "Hey Sejal! I love your work! I wanted to know what future endeavours are you looking forward to with Youtube! #asksejal", "aasthadogra": "Did you ever aspire to become a stylist or desginer?", "ruhheenn": "How did you change your hair texture? Now your hair looks smoother than before♥️♥️", "tanvishanker": "DID YOU ever get inspiration from other YouTube channels? If yes, from whom?❤️", "jia_gowda": "DID YOU ever think of doing a India tour where you meet all your fans in the capital city of a state.....I am an Indian YouTuber (youtube= Jia Prasad) too and I am very inspired by you...!!! Thank you 😗😙😚😗😙😚😗😙😚😗😙😚😗😙😚😗😙😚", "omnagarg_12": "Hey sejal!! Firstly I am a big fan of yours!!!I wanna ask being a girl how was the experience of taking a decision of not opting a good job and starting a YouTube channel!! Can someone do this if we have the passion to do it and how can we face the criticism☺️!!!", "parna_16": "Did u cry after finishing a book/movie?", "leveretbriller": "How did u plan ur usa trip ?", "jeenal4290": "Hi what is your hobby I am your biggest fan jeenal I am just 12 and I love your video very much", "_smithcorona_": "How did u became so fashionable ??@sejalkumar1195", "kanchi_kakwani": "Hey sejal Di u were looking amazing on the day u were heading to airport recently in the white net dress and u were looking amazing ... from where it was ?", "karishma1910": "How u afford your trips and how you manage your money and any tips for beginner solo travelrs", "deepanshi0202": "Plz tell how to remove dark circles..", "n.i.k.k.i.09": "Did you ever go through a situation when no one supported you in a decision and you were all alone ?", "anjalikanathur": "@sejalkumar1195 hey sejal 😊 I would like to know how you prep yourself before a huge event.", "rakeshhseervii": "Did you ever find any of the place you visited as overrated or not worth it?@sejalkumar1195", "_sakshidhole_": "Where do you see your self after 5 year?", "shoaahusain": "Did you ever feel like taking a break from YouTube and other social media(you know because your life becomes all digital once you’re into the business and it’s probably next to impractical to walk out with a smartphone)?", "rinki8899": "Did you ever broken something, like a window or something and ran away?", "_priti_singhania_": "Did you ever hit on a stranger at a party??", "smriti_xingh": "Helll... 💞💞💞😍😙", "prakhar_.goyal": "Cutie 💙💙", "akkkii._": "Did you ever make a video that your parents or Mohak must have not liked?", "itsnxk": "WILL YOU DO A GIVEAWAY SOON? Seriously idk why I'm asking this though.", "vaishnavi_kharote": "Whose your fashion icon??", "fifiisunique": "How you will appreciate your followers, fans and supporters?", "chandlerbong85": "Did you ever think of a wild fantasy where you could do anything weird with anybody anytime and anywhere?", "mp_prerikha": "DID YOU ever thought that you will become a full time youtuber ? I love your videos !! @sejalkumar1195", "adiiiiiitiiiiiiii": "Have you ever met mohak's parents?", "me_saraa23": "Did u ever gone through adventurous experience? ?", "swaathibalu21": "Hi Sejal ☺️ you are my big inspiration...when you will come to Chennai and meet us..... am waiting 😍", "libnirojan": "This year is awesome for u rite... how u feel as an youtuber n how ur life has changed after becoming youtuber...?", "avni_1702": "Did you ever feel that is a wrong career for you and then regret it later that if i would have continued with economics i would have earned more?", "rahulkumar17091": "😍😍😍", "crazykhyati": "Did you miss ur long hairs ?", "applepinch": "Dis u ever have a boyfriend other than mohank?", "vasudha0306": "When will you marry mohak?", "komal.mirdha": "What is yoir gromming process??", "prasha175": "one thing u loved being a DU student and one u did not like.", "meghna_menon_": "Did you ever think of getting a tattoo? If yes, what would it be?", "meharnayar2912": "Did u ever have a embarrassing moment while shooting somewhere?", "jayashreerangan": "What are your future plans? Also when will we get an office tour!? 😁", "kapsuhani": "Did u plan ur wedding or given this a thought with mohak?", "pallak_aggarwal03": "Why don't you have meat and greets!! We would really love to meet you.", "chethan5677": "Is komal Pandey is your bestie (best friend )?", "saranyagautam": "Did you ever feel like you worked really hard but didn't get through. And that feeling which comes after working hard everytime and still not being successful? How do we know where we are going wrong? How can we cope up with that? #asksejal", "navyanarayanan_": "Did you ever find yourself drifting away from your friends and family because of your busy schedule and travelling?! If yes then how did you catch up with them later?!", "chilli_chutney31": "What are your future plans.. Where do you see yourself after 5yra", "_akshita99_": "What is your say about the new policy of YouTube considering 4000 hrs of view and 1000 subscribers in a year for monetization to occur. This is really difficult for the upcoming YouTubers like me", "sonalsethiya": "Hi Sejal! Love your energy. Would love to send you a small gift from @boondhcups. How do I connect?:)", "khurana.gauri": "How do u manage to get content ideas every week... I mean what does it takes?", "abhipsapalai": "Did you ever do anything against the law", "jaseema_jazz": "Did u ever have a crazy weird ambission that ur embarssed of would u like to share it!? Love ur videos😍", "thewanderlustbackpacker": "What are your basic makeup kit u carry in your hand bag??? What is your balanced diet in your daily routine ??", "krithika.subramanian95": "Whom do you admire as a fashion admirer! And how do you overcome hate comments/messages. How do you market yourself!?", "anusha_lamichhane": "DID you ever drunk so hard and have any embrrassing moment??", "pooh_theglowingmess": "how many society you join in your college", "rozelleroxxy": "Did you think that YouTube would bring you success and you would make a career out of it?", "anjalii_rajput": "Did you just say me i thought you say me!? (Say it in mallika dua tone 😂) p.s - it's request not a question but still! 🙈❤", "smarterthanyouraveragedesi": "And how do u beat a sore throat /co", "jyoti_pm": "Did you ever had paranormal experience??😨", "shraddhhhaaaa": "What is your go anywhere do anything fantasy?", "rosebutaa2000": "@sejalkumar1195 what is your plan for this year.. like ur solo Europe trip.. #bucketlist ...😁😁 love u❤️", "ridhima_nagari": "Did you ever face bad grades? How did you cope up with them?", "aditi_bellur": "How old do you think you'll be when you get married @sejalkumar1195", "bhuvana_4273": "U look pretty awesome", "mindyourbusinessplss": "Heyyy sejal! What is the thing you like the most about yourself? Lots of love BTW!", "_urjitaghosh": ".", "the_mayathing": "DID YOU ever thought you would become this much popular and how fast your success was? Like it's just 2years I guess and you are this famous 😍", "srija_nandipati": "Did you even think that you would get so much appreciation and love from us some day ,when you started u'r channel ?? Love you sejal❤❤", "manishagrg03": "Will you cut your hair short again??", "thepriyaljoshi_": "Did u ever got embarrassed in public..? What was it and how did u get over it. ? PS I love ur channel it's super fab and even I am a die-hard fan of Rachel.!!", "soulful_nikitasha": "Did you ever lie to your parents and go out for a trip with frnds? 😂", "prashasti22": "Did you ever imagine that you're going become a fashion vlogger/youtuber someday? #asksejal", "_sakshisingh": "What is the most important life lesson that you learnt from YouTube?", "dhanalisurve": "DID YOU ever feel like u wanna start all over again back while u wer in ur college?", "kavitaistired": "How long do you think you will have this channel for? Like, do you think you will continue it once you get married, have kids etc? And how were you able to balance both college and YouTube when you were still studying? Love you!!!💖💖", "swwagata": "How much do you earn in a month from youtubing? I love your channel", "vrushpatil18": "Do you believe in marriage?? If yes, then when will you get married??", "geeta0822": "Did you ever felt low when ppl demotivated you initially when you started your channel. What did you do to face it @sejalkumar1195", "antheafernandez56": "Hey sejal ! Did you ever come to point in your life when you thought u took the wrong turn like when you started posting on youtube for the first time. Please answer !😘biiiiiiig faaan by the way 💃", "srushti_1893": "Did u ever smooched mohak??", "girlintheeatery": "@sejalkumar1195 did u ever lied so big to ur parents that it still hurts?", "sokaran": "Did you ever felt the need to do some job? How much youtubers earn on an average?", "idyllic_ayush": "❤❤❤❤", "shweta.dixit.35": "@sejalkumar1195 Did you ever have any second thoughts on your career choice whilst having Youtube as your career🤔", "tanishaa_0605": "Did you ever hv a paranormal experience??", "aakanksha___": "Did you ever had a phase where you doubted the career you chose and thought you'd not be able to create content anymore ? In short did you ever have a creative block?", "_kaavvv_": "Heyy sejal❤ you're amazing i really love all your videos 😍😍.why did you choose YouTube as you're career?", "tabassumbharmal": "DID YOU ever doubted yourself when everyone else was against you at some point of time?", "thatchillgirl_": "Hey sejal m ur biggest fan..Love from odisha..My question is how u manage your travel vlog?? How you manage expenditure and other accommodation things? Can u plzz share with us all. Btw I really like ur songs😘😊", "gauri_0402": "Which thing excites you the most??........and one thing u have done in ur life for which you regret the most in present", "mrinali_muralidhara": "Did you ever feel , at any point, that nothing is going right in your life? If yes, how did you deal with it ?", "samruddhx_25_": "Pretty pretty 💓", "mkpavani": "What is the reason behind you and mohak not breaking up like for so many long years? Dint you feel bored ? 😅 just a fun q", "palakathri_": "DID YOU.. what would have been your career if you haven't been a youtuber ??", "pallavijainofficial": "When you have started your YouTube channel did your parents support ?@sejalkumar1195", "talktomyhan": "Did you ever run into another YouTuber and clicked pictures like a fan ! Love you ♥️", "bhairaviiitis._": "Would you guide me on making a creative YouTube channel!?", "theover_excited_kid": "my question is that how do you balance your worklife and family n relationship?", "itsgurnaz": "Did you ever imagine that you would have an audience that would watch you from all over the world? Btw lots of love from Vancouver ❤️", "aishwaryavaity": "How do you deal with hate ? do you feel pressured on constantly having to create content to be consistent? Lots of love from Mumbai😘❤️", "pooja.bhatt.5811": "Kya kabhi Aapke saath Aisa hua hai ki aapse Kuch galat decision ho gya ho Lyf Mai or aapko baad m realize ho ki ye galat Ho gya hai. To usse Aap kaise bahar Aaye??", "lishaakapoor": "How to make your life better and stay happy ?", "girlwhoperegrinates": "Please do your haircare routine!", "kharnika_konanki": "Hey sejal why r nt u doing much of vlogging these days? Miss #sejalvlogs pls do moreeeee!", "karinaatha": "Do you think you’ll pursue a master’s degree? Or do you see yourself doing anything other than YouTube in the future?", "himanijain16": "Did you ever had a phase in your life when you thought nothing is going well and had self doubt . How did you overcome it?", "ojas.balluru": "Did you ever feel like living somewhere away from your family?", "mimi_mou_1407": "Did you really feel any complex as being a younger youtuber than most of the other youtubers ?", "kohlkarmakar": "DID YOU ever tried to make out in public?", "deepalichugh96": "I was in the same school as Mohak, DPSR! So it’s relatability to next level. What is it about yourself that you really like and how would you encourage others to love themselves and be happier?", "kavyaraghavan04": "Did you ever feel jealous on some one??", "kirthana_sreedhar_": "How do you manage to pose so perfectly? Give us some tips on how to pose.", "aslam_shaikh_as143": "what is your Birthdate??? love from kolhapur...whan will u come", "mihishka_negi": "Wht abt ur future plans... As YouTube not is not a stable carrier option, would like to knw wht would u do if u r not doing YouTube..", "badmaaash": "What do you have in your bucket list right now?", "alexi.7599": "Do you have any plans of getting a tattoo or piercing , if yes what will it be?😁", "ellie_macallister": "Were u nervous etc while ur firs video? We will love to hear it from u", "anupma__yadav": "tell us 5 funny facts about you which we dont know ??", "biradar_prajakta": "Hey sejal❤when is meet n greet in pune?", "_archita_patel": "Q1) What do love the most about your life? , Q2) What was the best moment in your life?", "ritika_dube28": "You are a successful youtuber now!....you are charming and lovely!!...and soo calm!!..but don't you get negative thoughts!?..i mean while uploading a video!...don't you feel like \"how your followers will react\"...i want to know how you overcome your fear or that \"daar vali feeling\"!!...btw I LOVE YOU SO MUCH!!...I always check your profile for new videos!....i mean you are perfect!!...i wanna meet you once!!..😍❤❤😊😊", "_alphafemale": "What's your height? And what should be the ideal indo western outfit for a tall girl?", "ll__preetha__ll": "How did ur inspiration start for a career as \"youtuber\"", "sanaagarwal_": "What is the sweetest thing you have done for mohak and mohak has done for you?", "blessy_christopher": "Did mohak made any restrictions about ur dressing or anything???", "suhaasi_palle": "DID YOU EVER GO ON A SOLO TRIP AND STAYED IN BACKPACKERS HOSTELS? ( Like the one Kangana did in Queen)", "sanachadda_": "When are u coming to jabalpur ? Its a great place to visit", "_anupama_ks_": "What are the basic needs for being a YouTuber n does the external beauty matters for being a YouTuber ? #asksejal", "riya__bhadra": "Hi sejal! My question is did you ever had a pet ?what is the name of your pet", "twinkle.solanki2306": "Hii Sejal.. I'm a very big fan of yours.. I watch all your videos..Did u propose Mohak or he proposed u ?😁", "_uzib190619": "Did you ever thought to leave seperate from parents.?", "ardrmp": "Did you ever find posing for pictures awkward or does it happen naturally?", "anamika_ny": "Did you ever feel that you will be judged by other people and not be 'happening' enough? How did you handle it?", "pallaviidas": "Did you like your long hair more than your short hair?", "anerynayak": "Heeyyy sejal !!! I'm very big fan of yours I'm totally obsessed with your style and love your videos❤ so my question is how do you manage your diet will traveling?? coz its really hard to do. Bbeyy hope next you Will come to Ahmedabad really wanna meet you. @sejalkumar1195", "khushie_z": "Hey sejal! My question is what app do you use to edit your videos? Btw... I love your dressing sense.. It's amazing and also I love ur travel vlogs..!😄❤️", "radhika0411": "Did you see the twilight saga?", "_crankyallthetime_": "Did you ever did something funny when sleep deprived ?? Btw i love ur videos so much . . N i love u too ,😍😍😘😘", "rashmi_kumaar": "Did you ever felt annoyed for pinching ur cheeks...... Give tips how to look chubby n also fit 😁😂", "90sgirlatheart": "No questions, just that you are amazing!!! And doing great work . Kudos!!! And hey how old are you ? 😀", "kavyaabajaj_": "Sejal first you are truly inspirational. My question to you is PROFESSIONPLACES A VERY IMPORTANT ROLE IN ONE’S LIFE , AND A YOUTUBER IS NOT THAT WELL ACCEPTED PROFESSION IN INDIA , SO HOW DID YOU MANAGE TO HELP PEOPLE ACCEPT IT AND DID YOU FACE ANY DIFFICULTIES IN INTIAL STAGE.", "sanajau": "Name of your haircut??", "jishanaik": "Do you think you can do youtubing till you die because even now u don't have any content as u keep asking us about it?", "eisitamazumder": "Did you ever run out of ideas for making videos on your youtube channel?", "sarika2325": "I really improved my English just watching your vedios.. Did you ever faced language as a barrier in communication..?", "_nidhi.saumya_": "Did you ever cook something for mohak? N do mention what? #asksejal", "dg96pupu": "Did you ever think of persuing a full time acting career?", "niti_upadhyay": "Can you make a video sharing your beginning experiences in the field of blogging and YouTube and be helpful to the freshers in blogging 🙋🏻‍♀️💫", "vagabond_diary_": "Did you ever feel overwhelmed by how your life is taking new turns every second?", "_anushree_r": "Who is your fashion inspiration?"}