{"thecuriouslittlegirl": "Don't run with your mouth open to save energy @pootato_ @kaustic.soda", "jigisha_ahirrao": "The only tip which anyone in general can follow is a simple rule which has been passed on from our grandmoms and moms Breakfast like a king, lunch like a nobleman, dine like a pauper💫🌼 @falgunijoshi2 @mayu_d08 💕", "mahima_kumari": "@nkhlx @flex_muffin Drink a pint,Get Ripped", "kritikagoyal13": "It says that red is the most powerful color and it cause an energy surge. So wear red while exercising to get the most of your workouts. Tagging @purvisaxena @vareeshafaisalkhan", "voguesmitten": "❤️❤️", "debgohigh": "@x_nap.kween_x pro tip: sprinkle salt in one of your feet after a run. Helps me solve math problems next day in the class.", "jigyasa_luthra": "If you wanted to loose weight then increase your workout with time, never try to do a lot suddenly it becomes exhaustive plus girls with heavy thighs n heavy lower body should stick to easy walk running, cardio should be avoided because it burns fat too fast but get it back on the same pace so for lung run weight loosing one should stick to aerobics n yoga @aarushi064 @aarzoo_singh97", "aanchal55": "My fitness tip would be to just stay active in your lifestyle and dont fall in the trap of modern sedantry lifestyle. Dont drink those drinks rather have water. Dont do online shopping do it offline. Dont make virtual friends rather go meet them. When you break your relation with your phone you’ll start making real connections and automatically the laziness will be gone from your life and thats when #youbyskechers will play a role in your life. We dont realize that Little things have drastic changes in our life. I so want to have these by @skechersperformanceindia in my life since sooooo long. In Love with the plain and simple design of it this time. I would be grateful if i have one. @sejalkumar1195", "shrutii_deyy": "@ishalijadhav @_janhavigore_ tip: play outdoor games like lagori, chore police, badminton and always have plenty of water😂😂and itss okayyy to eat wat u like", "meeee_himani": "@manishadamachya @sakshi.tiwari.17 ....healthy food and bit of physical exercise (a walk mayb)....", "shikhaagarwal84": "Start the day with a glass of lukewarm water followed by Surya namaskar, Eat home made food and seasonal veggies and fruits, be environment friendly, have a kitchen garden, use ecological things @ankurgarg.iit @navneetminnie", "postcard_witha_soul": "@sejalkumar1195 thankyou for such an amazing giveaway. So the fitness rules which I follow daily, first drink a lot of water, and yes do yoga. Meditation and yoga not only help you to calm yourself physically but mentally as well. Xoxo ❤️🌹 @masterrohan98 @sankalpa.biswas", "sriparna_nandi": "I start my day with some outdoor activities like running,jogging. I also drink lukewarm water with lemon and honey. apart from that I eat lots of green vegetables and fruits so all these assist me to stay fit and healthy.@missdutta_ @cornergurly @erika_banerjee_", "s_tasneem07": "Place a rubber band on your water bottle, and lower it a few inches after each sip to mark the place you want to drink past each time when you're taking more sips. (Remember, you should be drinking half of your body weight in ounces of water each day)", "rakeshgidh": "rakeshgidh#Youbyskechers Tip : 1. consistency at the gym or workout and diet. 2. Focus on what u do in the given time. 3. Use compound and isolation workouts 4. Get ur personal gears in place it’s helps boost your confidence. 5. Very important have it pre planned b4 execution. Follow @rakeshgidh For more info. Take care stay healthy.", "varshagoyal13": "I drink lukewarm water with lemon and honey. Eat more vegetables and fruits. Go for some basic yoga daily for at least half an hour.. @meghaagarwal31345 @sweta.mittal", "shikha_3441": "@monika.savla @poojanagaria123 To have rose petals with honey in warm water .... it’s great to keep the stomach full and to avoid on munching and also it helps in detoxing !", "pooja.mordani": "@maggi1506 @disha_the_chaiholic Drink a glass of water right when you get up! Don't brush ! Keeps your system clear and skin glowing !", "akiraganguly": "@dskingftw @ekta_rajkumari BE HAPPY. First key to a glowing skin and healthy lifestyle.", "tanuja.kr": "@swaati__", "shibangi.bose": "@_say_an_tan_ @_ranveer_goyal_ Tip needs to be quirky so . ... . Run up and down the stairs and wipe the floor . Both include Ur core muscles to contract and relax . @sejalkumar1195 @mohakpapola", "deepthi_ranjithkumar": "@riamallery @rachana_thorat ..TIP: 🍋 water every morning ..squeeze in your bottle and have it.!", "taleyakhan": "@sanakhan44_ @adnaaaaaann @sejalkumar1195 One thing that I've actually learnt from you only 😜 is to eat home cooked healthy food no matter what. Also, I make sure I workout n keep my workouts fun to keep myself interested n I also make sure to workout atleast 2-3 days a week (cuz u can't always be motivated 👅)", "sandhyabhoria20": "@_shreya_singh__ @mister______mr. Follow the rainbow diet , eat variety of fruits n veggies🌈 and inculcate fast walking of about 30 min 🚶‍♀️", "shravika_reddyy": "@sriranz @chinny_p_81167 @sejalkumar1195 this is my fitness tip... Take a glass of warm water with lime honey and ginger every morning to maintain ur fitness...", "thispersongetstheweirdestname": "@laxmi_shetty @ashhazainab drinking 2 glasses of hot water in the morning.", "poonampunia": "@pooja_gandhi_19 @bhartisansanwal ....stay positive and happy....wake up on time ...and walk a mile...😙", "madhura_giri_bapat_official": "@mansi_giri @bapatankit zumba and jogging in these pair of shoes😍😍", "avniverma17": "@pranjaljain04 @ritsikaaa these shoes 😻. I believe health is not about the weight we lose it's about the life we gain. Be healthy Be motivated. I think these shoes gonna make my jumping jacks 🔥.", "the_unheard_soul_07": "@shivani_maher07 @shaifali_mahar 1. Drink plenty of water 2. Followa proper yoga or exercise routine", "itstina_jacob": "Walk up and down while talking on the phone 😛 @sa.ti_ @kafkaescapist", "laxmi_shetty": "@gaurishetty2 @thispersongetstheweirdestname 1.home cooked food 2. Dancing is the best and also a fun form of exercise 3. Green tea everyday!", "amulyakallakuri": "@revathiiprasad @vanasuma_bulusu straighten your posture by putting your hands in your back pockets! Whenever you stand! 😂", "samridhi.ahuja19": "Don't exercise with your bff. There won't be any result because you will end me eating momos after the workout.", "aashii__ii": "@sejalkumar1195 dance your heart out for an hour with awesome music. Its the bestt💜", "divya11___": "@nileshwari_daya @riaanalove36 Going to a favourite food place by walking( Food will work as driving force and one will surely walk faster)😂 @sejalkumar1195", "vodkalassi": "@questionsfromyourheart @agarwaltanvii if you eat curd with every meal, there is a bigger chance of you gaining weight. Hence, cut the curd out and be fit.", "erika_banerjee_": "Tagging @cornergurly", "saxenahimanshi1997": "@eternal_blissdom @mansigupta23 stay hydrated ,do some exervise and eat in 80:20 ( 80% balanced diet and 20% whatever u want to eat) ❤❤", "abstract_life_by_sd": "My quirky fitness tip is 7-8 hours of sleep, some yoga, drink lots of water and love what you do.. tagging @erika_banerjee_ @s.diamond_girl", "kirtisharma18": "@ishaa_tandon @simranvirdi96.sv most important fitness tip is to stay happy , drink more water to keep you hydrated", "shubhamhemrajani": "@sarthak_kalra @rajat057 one way to be healthy and fit is to be happy and cheerful and always follow your heart and do what is right (think rationally also😜) because when you are stable from within then only you can be fit because good thoughts will bring positivity in your life and you will remain healthy and fit 😊😊", "samikshaaax": "Tip:- turn to your left and turn to your right when offered something fried to eat. 😂❤ @m_o_n_i_c_a____ @rakshana___", "karishma_bagla": "Tip:-Following the tip mentioned in this video!- https://youtu.be/LEL8vvz2tJc there is a lot of science going inside this technique, and one of which is more oxygen intake means more fats can burn. @_miss.blissful_ @dawn0f_dusk", "kottayamkhaleesi": "@babulitty @tincy4thomas Try drinking warm water to avoid fats, stress, indigestion problems and even to avoid sleepless nights", "rachita_nair": "Whenever you need to travel a short distance make sure you use your very own no. 11 bus!!(👟) @aasshhii_ @mrinaliparida", "ankitas_1": "My fitness tip is drink a huge amount of water in a day... At least drink 7-8 litter water in a day..it helps to reduce toxins and keeps us fresh.. Second is take a proper sleep.. 6-7 hours sleep is a must.. And then a proper diet consulted by doctor.. Avoid junk foods .. Last thing is yoga.. Doing yoga in the early morning gives you energy and keeps our mind fresh tagging @tsmita07 @raa12777", "gupta_surbhi": "@rishikakatara @swastimukhi My two buddies I’m comfortable with 😍😂", "punya_1901": "@paridhi_agarwal12 @navyaaa_15 @sejalkumar1195 Play Run and catch with your siblings. It will surely keep you Fit and Happy!", "theplumcake": "@yashmisevak @namrata_bakre .. for fitness Sun salutations are Best😌🙌❤️❤️", "pj_parina": "Keep Posting & Do Surya Namaskar! @notjustswati @ajatika", "samikshadash": "Eat everything you crave for ❤ but maintain sweating routine @sejalkumar1195 @akku_nikhil @shreya._khirwal", "shreya._khirwal": "@samiksha_dash niceee♥♥♥", "jhalak030405": "Drink a lot of water in the morning", "saurabhthukral": "Ditch your shoes and go barefoot. Exercising without shoes is beneficial to both training & health. @k.a.r.u.n.a @taneja.gaurav", "fazna.k": "Push ups is the key♥️ @hamna_7777 @mr_shazz_", "karishmakrai": "just keep walking 😉 @itsdichen @_kaylw", "neha.chawla25": "Give up soda and juices with lots of sugar.. instead switch to green tea or black coffee .Also, drinking lot of WATER will be the best fitness tip.. @samiksha.deswal @nikitaa__sharma", "nehacchauhan96": "@kiranlakheru @rachna1010 tip: an apple 🍎& workout keeps doctor away 😛", "___chahana": "@poojanpurohit @aastha17solanki #fitnesstip apply your saliva of mouth before brushing to your eyes it will soothe your eyes and will help to reduce wrinkles and dark circles around your eyes ..!😄😄", "megan_alison1903": "@ren_nogar & @kimberlyamandafdes Comfortable footwear is essential for gym training!", "jha_reetuu": "@sakshirawat0912 @swajasha22 drink about 7 to 8 litres of water. exercise daily, eat healthy good, be happy", "sakpui": "Tagging @ngashanshinglai @rapunga7 Fitness tip:It is very important to work out to keep the body fit but not as much as it is to keep the mind fit and free.", "mahak_chugh_": "@preeti28_98 @hitakshi_kundwal ...", "ujjusam786": "apply coconut oil to ua skin", "k.a.r.u.n.a": "✔ Tip : Eat every cheesecake, Pizza that you crave for ; a late lemon drink will settle it all . Leaving y'all with happpppppy fffitnessss 🙈💃💯❤🚩. @tanya20sharma @_igoluu_", "smritirana17": "@saloniwadhwa06 @natusvincere45 run in skechers!!", "rohitham7": "The most important fitness tip is to stay extremely happy, enjoy the food we eat and workout we do! @geethikachowdary96 @manasarayan", "kayayceeee": "Eat whatever you crave👅 and then have a hot cup of green tea☕️😁 moreover buckle up you shoes and start running👟 @lakshya_sharma07 @surbhisinghal1106", "blogsbyanusha": "@thejigsawpuzzle @arshita_24 ....Fitness tip coming from a zumba fitness instructor...Dance till you sweat it out 😎", "arshita_24": "@kaushiki_agrl910 @artemis_akku did you know? Dark chocolate helps you loose weight. Yes, you heard it right, CHOCOLATE!", "palghadmal_shubham": "@salonivartak @vishaljogani9 ! Tip is wearing your shoes n go cycling ! Go green 🍀", "anamika.om": "@missfashioncupid @rashmirama005 The best way to workout is dance so keep dancing, eat lemon juice in the morning and prefer lukewarm for drinking :)", "leenajain20": "Best thing to do is to detox regularly. I detox every 15 days by having only water for the entire day combined with meditation", "imperfectlass": "@live_life_queen_size_ @kkhhaann___ Tip: Loads of water and Ghar ka Khana! 🙏", "aditigupta106": "Drink more water! @pujagupta156 @jayashree_ojha", "iam_nagashree_manjunath": "No need to worry about fitness we have only one life let's Enjoy it @monikamanjunath @malavika_prasad_", "kash_ish28": "@Aashigupta22 @Maarishaupadhyay Hit the zumba everyday with a new 'you' for a new 'you'!", "mayur_ka_music": "Love this click😍😍😍😍😍😍😍", "ashriya_gosain_": "@riya.arora825 @sakshi56bansal Tip would be dancing😍. It is enjoyable as well as it makes one fit. I love dancing and yes dancing has only made me fit. I never get tired of it.", "shikha_s16": "@malayaj77 @singh.rhea44 do 11 surya namasker everyday.. Its super easy plus it makes you feel like u are so much into yoga :p", "aksharashivakumar": "@serenejoshua @pewdiepie Don't eat biriyani.", "ronsgams": "Best thing is follow a healthy balanced diet and drink green tea", "kajal_nayyar": "@simrankaur5141 @vanshikaarora_ Tip: Anyone can workout for 1 hour but what goes in your plate for rest 23 hours is hardwork.", "harikanadimpallii": "@hinishareddy @_sravya._ wearing red clothes while exercising or painting the walls of your gym with red can cause an energy surge .", "missdivarajasthan": "Ossom", "shrivastavashruti199": "Try to be happy.. Though not possible all the time bt D best fitness tip I can provide you with is the \"stay happy Mantra\"! BTW you have a sweet smile.. Keep dt up.! @payelbiswas777 @shaw.twinkle", "pratikshasuresh": "@sk_nidhi @shreyasuresh11134 tip: standing upside down for a minute or two allows blood to rush towards the head, and gives your face a natural flush", "abhigyanmishra_97": "@zehraali_98 Haha. Will do. 🕺 😂", "mankr1sh": "@mrdosa @rachnabangdiwala tip: meditate after a workout.", "roshni.goyal": "@mayuri.kudale @kherag twist and twirl , any random step you can borrow, while getting drunk like there's no tommorow!!", "afiyaaaaaaaaa": "@firuangel tip aapke liye nahi hai😭😂 aap already shape me ho❤", "neha_parwal": "Plan a special breakfast to eat after your workout as a reward for your efforts. You'll get through your workout a little faster knowing there's a peanut butter and banana smoothie and homemade egg muffins waiting for you at home. 😉 @dr.janika_55 @himanisaini93", "madhumitha_i321": "Suck in yr cheeks like a fish for the perfect jawline 😉 @sejalkumar1195", "_gauryyy_": "two beat friends are @bhavanautekar and @mitaliiii_ .....And fitness tip is Do yoga in the morning Drink as much as water in a day...And eat healthy Ghar ka Khana..😚😙", "anahita._.hira": "TIP: Meditate in the moring. Eat lots of green vegetables and drink atleast 2liters of water every day. I tag @iiamaamiiishaa @_amiana_🌹...anyways u dont needa do all this, ur already so fit dii❤", "ajs601": "@dolly_singh1110 @shradha1506 and the best fitness tip is to do 30 mins.of running everyday and eating food having less of sugars. And the best tip to remain healthy is to keep ur mind and soul healthy and always be happy from inner soul.", "affiyaanjum": "@siddiqua_fatima07 @__saadfaisal", "shamika_mittu": "@lakshmi_kittur @divya_desai_27 breathe in and breathe out💯", "nomula_nishitha": "There's no other better fitness tip than having ghar ka khana Khana and laughing", "vellavakeel": "@sejalkumar1195", "itskajalsalian": "🏊😎If you could just spare some time for a fun 🏊 on the beach or pool, you wil burn equivalent amount of fats and carbs.(you can even cheat on diets after a good swim). Stay balanced. @merlineanthony @mendon_shru_", "anannyabhatt": "@shraddhahahaha @zo_2730 TIP: warm watter with honey every morning. (Helps you lose weight and also, good metabolism)", "ashutosh.kulkarni_": "All you need to do is have wheat grass juice every morning and do your normal workout following the diet @___v_a_a_n_u___ @smitalkale_", "20something_j": "@amritajainn @livinginaparallelworld Tip: Stay hydrated. Old is gold.", "bhavya__reddy": "@the_lovely_poison @eshwar_reddie Tip: you don’t get the ass you want by sitting on it👄", "bongshail": "@chanchal_ganjir @priyanshi_raheja Tip: Run from your responsibilities everyday lol. Okay kidding. Have warm water+honey+lemon every morning, this helps in reducing weight and gradually the cellulite fade away too. Also, we shouldn't stand under the fan/AC right after working out cause it will immediately cool our body temperature which means it won't burn calories at the resting period. (Would love to win cause I dance everyyyyyyyy day. ❤️)", "kritikrishna": "@stuuiii Sweet on the lips, forever on the hips!! ;)", "pragyayay": "@tusharrohilla24 @kusumvishumittal teenagers who exercise have 36% less chances of brain tumor then those who don't so plz exercise..😘@sejalkumar1195", "tu.sinam": "Start your day with a glass of lemon, warm water and honey coz it works as detox for your body. @chelseasinam @v_keishing", "kavi.nampoothiri": "@dhwxxni ,@___manasi_ nd @bhuvana_1404 just laugh more ... Nd keep drinking water 😊😊😊", "gunjan_4": "Just add more content of laugh/smile to your day...and stay healthy😉😉 @sejalkumar1195 Tagging @instaaddict.shweta @nidhi_v_arora 😊", "reehasharma": "Eat healty this is the best way coz it depends on us what we feed our body heathy or junk :-) @sejalkumar1195 @nitya_v_ @deepanjalisirohi", "riya07raj": "Every night before going to bed, make yourself a bottle or two of detox water with lemon, cucumber, mint leaves (anyone of them or all of them) and let it cool down overnight. Use it the next day. By this, you can keep yourself detoxed and hydrated (with refreshing taste) at the same time. Also helps rejuvinate skin. @als_caramelized @reedamsinha", "kawansoni": "@sukritibagga @_jeryy_ fitness tip: STAND-UP TO LOSE WEIGHT", "merinlovesfries": "@journey_of_a_wood_dweller @nadayy2405 TIP : Keep your squats low and your standards high.", "rashi_rkg": "Have Warm Ginger-Honey water at least once a day,it boosts up metabolism..!!", "nomadicnamm": "@ratna_yakha93 @anukalayakkha", "abha.gokhs": "@vrindatrapasia @dr.t.lector workouts increase endorphin level which is a happy feeling hormone and drink Apple cider vinegar.", "anihive_13": "Fitness is not only about your physical fitness but mentally aswell so think positive n feel positive.. n a 1hr workout is more than enough n a 30min meditation.. @__naishaaa__ and @x.angel_eyes.x n yaa love u sejal💗", "tavishi_tanu": "Start Belly Dancing everyday for atleast 20 minutes and eat Bramhi leaf regularly to avoid various diseases. :) @ananya.k308 @black_square01", "_ananya._.nanda__": "@cutu_love @sonali_p2901._._ Say \"shhh.\" As you say it, \"Put your hands on your stomach and feel the contraction. That's your transverse abdominus and diaphragm contracting, creating tension in the core and strengthening your extremities.The louder your \"sshhh,\" the better.", "girl____on____fire": "Take stairs anywhr u go...eat evrythng bt hv a chck on hw mch u eat....@misbah_malik96 @taken__by__chocolates", "guneet.kathuria": "Start belly dancing to avoid a huge stomac.@manan.kathuria220 @shagunrajpal @kamya_arora_26", "that_.chirpy._one": "Do not strain ur facial muscles while talking😘 @i__ms_khan @angel.nemi77 @misbah_malik96 @girl____on____fire @_iram_khan @_firdos_k_ @sweet_stuff_sana_qureshi @bebo_girl111 @_born_to_pizzzzza_", "payel_mkhrj": "@sejalkumar1195 fitness tip would be stay motivated, be sure to get sleep, exercise daily.. tagging @its_dipu123 @stylo_chandan", "harshpreetkaurmanak": "@ashish_gaba @karan_singla #FitnessTip: DRINK AS MUCH WATER AS YOU CAN🌊🌊🔥🔥🔥😘 Also, KEEP JUMPING ON YOUR TOES WHILE IN THE KITCHEN PREPARING YOUR MEALS🥙🥗🍱", "angelinabedi": "The secret to physical fitness is actually mental fitness. Just focus on your breath whenever you feel you aren't able to do more or you can't resist the temptation and you will develop endurance surely. It's easy to start a regime but the real challenge is to maintain it. Be positive. Inhale,Exhale :) @sifatpreet @thisismrsingh", "aisha.m.siddiqui": "@nidhimishra96 and @amitakujur #fitnessTip: Since you love dancing, try belly dance cardio workout .", "asmaasalman_": "@hafsa_jamil_khan_12 @nancyghaija drink as 8 glasses of water every day 🍃", "g.anjalireddy_": "@harshi890 @sanjanareddy__ #fitnessTip: dont sit lyk a rock , work lyk a clock", "hansa_attkan": "@kiranattkan @janakattkan123 start your day with glass of water and then 30 mins jogging.", "vandan437": "@pushpa.patil.66 @neethumadikeri fitness tips: have vegetables,limit processed food,drink water , some workout and YOGA ⏳", "swaroopmishra_": "Start your day with a good fat like a spoon of coconut oil ! Very effective for ‘sustainable’ weight loss and hormones! @sejalkumar1195 @ranjitmahanta34 @kukulmishra", "jasleensaroa": "@shreyathakur03 @vishesh0001 TIP : Wear the @skechersperformanceind shoes and go adventuring around the city. That'd surely keep you fit ma'am ;) @sejalkumar1195", "__.akhila": "Drink atleast 8 glass of water in a day u will be fitter from inside and glowfull from outside :)@sejalkumar1195 @dhwaniibhatt @siddhi_mahajankatti", "radhikarads": "Say \"SHHHH\" Put your hands on your stomach and feel the contraction. The louder your \"sshhh.. the better\".. It's most effective for core stabilization exercises such as squats, push-ups and Pilates moves. Tagging @lekhabane @darunkarpriya :)", "disha_mudholkar": "@aastha0105 @dishajain20 👼👼", "rachna1102": "Just start running one day and weeks later you'll be happy for yourself. PS dont forget the pre workout expresso shots. @anmol_badi @chibbe_22", "stuti.gulati": "@thealiferousgirl @iamsurbhigupta Eat good. Skip the lift and elevators, walk when you can!❤️❤️", "apoorvabalodhi": "DRINK COFFEE before a training session. It helps burn more fat and decreases the amount of pain in muscles you feel when training. So you can workout more. Tagging @motivatingyou26 @kajupista98", "piyashree18": "Wow. That's amazing. Playing badminton daily helps us to reduce weight and reflexes productivity. AND ofcourse its easy and fun to play. tagging @aishdas17 @ayushi_toppo", "mirza_anam_beg": "@sameeya.crazy.zargar @nida_tanweer . Fitness tip : Paint the walls of your in-home gym a vibrant red to get the most of your workouts. Red is an intense and powerful color and can cause an energy surge, sooooo.. you may benefit from wearing red clothes while exercising.", "sneha.__.dev": "@bhoomikahk @pink_prankkk n maybe even one-hand stands to tone our body while working our eyes out on our phones😂 @sejalkumar1195", "amritadiaries": "Remember d formula ; Small changes + Time = Big Result and yes a warning : Exercise has been addictive as it causes health and happiness ... I tag @sharmila_gautam @halirockzz", "amisha.0_0": "@deepali_021 @woof_again Drink light warm water every morning empty stomach! And have a good quality diet not quantity. Have a 20 morning walk everyday! And be happy 😊", "surbhi.sinha": "@nishita.babbar @arpi.011 do squats while brushing your teeth. Saves time and wakes you up too!", "raghave_sudha": "Drink Mineral Rich Coconut Water to slim down and it keeps your skin hydrated @sound_arya_99 ,@maheshwari_1112 . With All Love To You Sejal 😘😘 @sejalkumar1195 ...", "vandana_b": "@phanee.s @nilaa_anil fitness tip: play badminton atleast once a week for an hour with someone you like with an aim to beat him/her. This gives you quality time, healthy competition and overall body exercise along with happiness.", "shwetambariingawale": "@baby_groot2912 @neha04.np ...", "seerat_kaur16": "Fitness....in my view means confidence.....if you aren’t physically fit , u can never be 💯 mentally fit....even after having everything in life...if you are not fit...there will be some sought of tension inform of inferiority complex in you....so stay fit stay healthy...smile 😇", "ira_sran": "@appu_polis @nivashinii : Drink lots of water and put your dancing shoes on every day for an hour with friends or by yourself some days! You will just be having fun and won't realise you lost so much weight! Also, trekking as often is travel, fun and fitness all in one.😍", "alpana_sonowal_": "@tanmoyee_sarma @k_r_i_s_h_n___a_ Here's my fitness tips that I learned in my badminton class: 1. Exercise daily at least for 30 mins. You will have a healthy skin and slim body. 2. Stay hydrated , drink lots of fruit juices and also get proper sleep. That's how you can stay fit. Hope u like it 😊😉", "_tanya_singh_20": "@_yaduy_ @_vrinda.pahuja_ Fitness tip : if you are lazy to workout or u have missed your abs workout for a day then just breathe in and out quite hard than try to put stress on ur stomach .. Its an very old japanese abs workout exercise and also its proven. Hope u like it", "shikha_udani": "#healthytip keep walking until u achieve yur target @_i_am_anshu_ @amyroxx93", "aakritiie": "@mrug_20 @that_blusher_girl drink coconut water daily and have a good sleep of atleast 6 hours daily.", "iamanuragg": "Never worry, Running wont kill you... you'll pass out first! 😂 ... @skywalker.s_aish @the_komalheda tag other yo👍", "sindhumaddy": "@anu.vagicharla @juice your muscles-Tart cherries contain anti-inflammatory properties, which can help to reduce exercise-induced muscle damage. Try drinking approximately an ounce of the concentrated red stuff twice a day to help reduce post-workout soreness.", "akshata_amble": "@anjali_amble @mayuresh_jawale. Fitness tip is drink more water eat healthy food like ghar ka khanna n lots of salad n fruit", "palakmanglik": "@apoorvabalodhi @kajupista98 🔥 one quirky fitness tip for you is to do yoga - Surya namaskar and stay happy, mentally fit and you are good to go. ❤", "suraj____2817": "😋😋😋😋", "thealiferousgirl": "@stuti.gulati @avleenkaur23 30 mins of vigorous exercise daily!💪🏻😍", "kajal__goyal__": "@sejalkumar1195 @motivatingyou26 ❤️", "tan__veeeee": "@samritisarma @shivangi_sarma you don't need any fitness tips, you already are sooooooo v v v fit. (Acc. to me) :)", "crjswift": "Oooh I need this!!! Tip: a little salt in sneakers prevents it from being sweaty and smelly 💓 @laughterandcake @janette_smith7", "sanya_arora": "@saumya_arora @ankit3001 #healthtip the best is to dance and lose out all those extra calories. Dance helps and gets us to do a full body exercise!", "tec.razy": "@tejasgaitonde @adityad_2909 Keep cycling....", "tejasgaitonde": "@tech_crazy2242 @aishwaryasureshh eat healthy . Wear skechers !", "the_prettypoison": "Drink 8 glasses of water daily. @crafty_aayu @me_orator", "nikitas515": "Drink loads and loads of water🥛it will detoxify your body than anything else 🤘🏼@ankitasheoran @jaspreet.saini.988", "pritu5325": "@jayati_mj.jessi @zlkkot don't only cardio exercise also try to do resistance based training", "jayati.mj_trainedmua_ilpc": "@pritu5325 and @kirativayeda Stretching before and after workout with timely waterbreaks is a must", "21_pkberrryyy": "Quirky fitness tip: Weight training is an effective one for fast weight loss solution which I prefer a lot. Fitness is all about long term goal so eating healting and keeping hydrated mjxed with some sort of workout is the best way to be fit. Body Exertion is the basic key for fitness. @arshikhaitan @theshe_giraffe . Love love @sejalkumar1195 😘😘", "riiyanegii": "Stand as tall as possible by pretending that you're getting ice water poured down your back ,this postion will help by strenthening your core muscles, boost your caloric expenditure forcing your body to maintain this posture and will give you a good posture 😉 @shivagnya @abhapurohit ❤", "ritiksingh1818": "Shoes kitne k liye h", "violet_thunderstorm75": "@anshita_.goyal @violet_raspberry1 . Exercisers can improve their performance by as much as 50 percent if they eat dark chocolate regularly. (And this is not a random fitness tip, it's based on an article written by Harvard medical school) *tries best attempt at smirking but ends up looking like donkey from Shrek* P. S. Do I sound snobby? I hope I don't, I'm really sorry if I do 😫", "milounii_": "Quirky fitness tip : The colour red causes an energy surge so wear red clothes, paint your gym or workout zone a red colour, it will benefit your workout. @anonymous_happy_soul @manasvi_shenvi", "shilparana432": "@apoorvadogra67 👍👍", "suchita74": "Running is my happy place.Why not make it yours??Fuel yourself with coconut water immediately post run to compensate for lost electrolytes and salt 😎 @_kashvi @kajitsaria", "pootieepotato": "Tip: Always keep some chewing gum around. Whenever you feel like munching on something just for fun, pop one in. You'll have something to chew on for a long time and won't give into unhealthy snacking. @hpankhuri1999 @_preeti_verma", "_imadyasha_": "Drink some warm water with lemon in it. Keep fats away 😉 follow your daily exercise routine then 😀 @micku___3 @harsh_singh2706", "subhaminz": "Where is this dress from @sejalkumar1195 ?", "muskannmalik": "@suhaani.__ Blessed 😌😊", "sulochna_kujur7": "@ria_margaret @toppo_ankita A cup of green tea and yoga everyday without failure will keep you fit and young.😄😄", "ssharmaxxvii": "...good", "varnika_gupta31": "Be happy and stress free @shipraadlakha @solanki.himansshu", "butterchickengirl": "I don't have a fitness tip because I NEED motivation in life to stay fit myself. But this comment thread is really helpful! Great shoes. 😁", "suhasinidikshit": "Eat healthy n drinks lots of fluids in the form water, green tea, fresh fruit juices. @anusha_ds @lakshmi.suhana", "mayurinahar": "@sharmistha13m @prisha1121 while doing standing chores like say brushing, you can lift a leg put it down and lift another, and continue doing so till you’re done with your chore.", "prettyfacesbypriyum": "Super cool 😎", "happilyunemployed": "Stand by pretending that you're getting ice water poured down your back. This position will help not only by strengthening your core muscles, but also by boosting your caloric expenditure, forcing your body to maintain this position. @sejalkumar1195 @skechersperformanceindia @avni.chawla @abhishek28879", "shraddha_shetty31": "People who exercise as little as 15 minutes a day have a 14 percent lower mortality risk than people who don't exercise at all !!! @shetru_shravan @akshayshetty6719", "navya_nambiar": "Work out...eat well...and more importantly love yourself ❤❤ @sakshi_hinduja @blissfully_blessed_01", "sharmistha_aka_petite": "@mayurinahar @priyankasinha24", "_pickle_._rick_": "The most important and quirky tip would be that you eat well and healthy and maintain a balanced diet. No extra effort. @_arin.786 @that.chaosmaker", "lnekka": "Eat healthy ,sleep healthy and exercise daily", "jehhhh1.0": "Having sound sleep is a necessity. Whatever you do, give yourself enough sleep time. @that.chaosmaker @chayanika_dhar", "sanskritisharma__": "fitness tip: start loving your routine do whatever you like doing don't do. it because everyone is following or doing that routine and always drink a glass of warm water with a little salt and lemon as it will help you to keep up your body with the hydration what you will loose during sweating @bhatnagarprashasti @_soumya_m_", "jhanviagarwal": "You can loose 200 calories by chewing a gum for an hour! @vaishnavisomani @harshvardhan126", "wanderer_foodie": "dancing to dhinchak songs..best workout ever.Thats how i do my cardio.mixing it up with zumba...love sketchers...tagging @sohalniharika @leisure.artistry", "sam.antha_claire": "@chrysoberyl.lawrence @bbluesswan fitness tip: shop till you drop! 👛👟👟🏃", "supriyabhogale": "@manekabhogale @y.khed just do 100 squats a day and get the perfect butt😍", "manveen_kathuria": "@haneet28 @agrima.grover tip: get yourself a boyfriend who's a fitness freak. Won't let you eat anything unhealthy! Also, will make you workout with him😋 so it's a win win situation!", "darshanamaniar": "Eat everything in moderation! I tag @msmeehnia @sourabhi_20", "sansritifanpage": "Loved it💛💛", "deepikasdarai": "@mohantareema @patel.anisha25 my fitness Tip would be stay fit MENTALLY! A 15 mins jogging in the morning without your phone and iPod would be a great initiative..Run for yourself only.", "verma.alisha98": "@aakanksha__bisht @mallika_verma28 fitness tip: imagine your most embarrassing pictures on Facebook and word hard to look your best.", "divya.kesari.rajali": "@itsmesrujana @shruti_uradi", "bhavi_dagar": "@ashitadiwan96 @deveshk.9 fitness tip: Eat slower and drink as much water as you can.", "_chickenandrice_": "@hsrivastava0205 @atulk_im TIP :- if you are running on a budget and cannot afford to buy dumbbells. Then either grab a heavy can of food, a heavy water bottle or you can just tape all the cans available and use them as dumbbells.", "s_.2608": "Its never too late to be fit for a brighter future🌸💪 @hemalpurani @parikshit1313", "psycho__unicorn__": "@aleena100602 @salonisood__ 💗 fitness tip:Take a walk when you are conversing on the phone.", "the_hemalatha_sattu": "Fitness tip: Try yoga @sejalkumar1195.....@_d.i.v.y.u_20 @kaju_017", "ankita_saste": "@salonipawar162 @anoushka.m ❤❤ Fitness tip: Stay happy and meet your favourites :)", "abhikankshaa": "Jumping Jacks. Anytime anywhere. @sharma.navin91 @imtanisharma", "nsu.agrawal": "Little exercise and Plenty of water. @craziveera @mahatopooza", "garimalakhani": "Fitness tip: walking is the best exercise try it @priyanka_scorpio @dalpatkomal", "vennelalalalalaaaaa": "@vennela_reddy_ys @reddy_vineesha Just never make your stomach sad by so called diet and all... Just eat everything that makes you happy and spend a few extra minutes for work out", "r.a.j.a.s.h.r.e.e": "@basudhachowdhury ...@rounakmoitra ...early to bed away frm gadgets", "sniggy212": "@skymaw @krishasakya chart your progress and give yourself a break ❤️", "namratha_naik14": "@anushaaa._.29 @sober_sobiyaa sprinkle some salt in your shoes and leave it over night. In the morning the salt would've absorbed all the sweat and odour ❗", "shraddha_21": "@ohhsofickle @safa_tk .. one Life, One body.. let's make our body amazing, life is already amazing because of you two😘😘.. Also, Fitness tip: Run like there's a Hot guy in front of you and a creepy guy behind you 😛😉", "jyotimaheshwariofficial": "Hi @sejalkumar1195 , hope you have already landed in newyork. @mohakpapola we miss you, Please show up in next video with sejal :) My Tip: They say your feet are your foundation, I so much believe in this, So yeah “Make sure you have very supportive shoes, made for outdoor conditions\" So, @skechersperformanceindia I think I so need one ;) Tagging @ranju_jhanwar @reetu_mintri07", "foxonfeet": "@mayur @pranavbhopale whatever you start, be consistent about it.", "i_am_soumya": "@_garima10_ @swarnima_rane - Nobody ever got a nice booty just by sitting on it!", "_gitikasingh_": "@rakshaswal @arunimaaa bite 32 times, make your food fine, get the jawline and perfectly functioning intestines! @sejalkumar1195", "tanyaaaaa.5": "How much did you struggle for the second pic @sejalkumar1195. And I can imagine what would have been the upper half 😹😹😹", "mansivpandey": "@krishhhna_ @nayyhah ❤❤ fitness tip : Sprinkle some salt into your shoe or sneaker at the end of the day, then shake it out in the morning. The salt will help pull out the sweat—and odor. This is perfect to do after a run or after wearing your shoes without socks.", "rakshaswal": "*them", "the_enchantingvibes": "Drink plenty of water @dishaaaa.a", "mugdha.khatavkar": "@namma_thalle @prox_96 tip: drink water in regular intervals to keep yourself hydrated and eat healthy food with proper intervals. There is a saying, Breakfast like a King, lunch like a landlord, evening snacks like a middle class and dinner like a poor.... Stay fit", "ouch__potato": "Fitness tip: Stay away from your foodie friends. 😂 @dreamyrealities, @praneet.dhaliwal", "irtizir": "Just feed your soul happiness and body human warmth. This sets everything right. @dandelion_ina_rosefield @totaldreamer19", "serialkitscher": "When you find yourself reaching for the chips, ask yourself \"are you hungry or are you just bored?\" @sradakishore @nivesek hi boiz :*", "shreepriya.dogra": "As you go along your fitness journey try to listen more to your body and what I likes, wants and needs. Everything needs to be customized and only you can do that for yourself!", "vishhhhakhaa": "@uday_allan @riii__shhii__kaa__ Too bored to squat? Squatting while brushing your teeth is an excellent way to incorporate the tiresome \"squatting\" into your daily excersize regimen .Working your booty for two minutes straight instead of just standing there and Zoning out ;)", "pizza_konwar": "Tagging @ekaparna.123 and @jyotishmoyee. My quirky fitness tip might sound weird but it works, always sprinkle some salt into your shoe or sneaker at the end of the day, then shake it out in the morning. The salt will help pull out the sweat—and odor. Pro tip: perfect to do after a run or after wearing your shoes without socks. @skechersperformanceindia #giveaway", "21anugrah": "@aggarwalshweta423 @utkarsh_kuchchal always go for a walk and drink green tea instead of normal chai. 😀", "idiotdaya": "Choose to walk whenever you can. Enjoy every meal. Drink lots of water. Do some stretching when you get up. 😊❤ @smeramathew @amrithajohn2", "himani_gajjar": "One of the best fitness tip is to drink water as much as you can because it would clean your internal body as well as it would glow your skin @dimplejain_", "__diksha_sharma__": "Tip- just love yourself n stay happy to stay healthy🔥@_arpitasharma_", "zain_np": "Don't skip breakfast. Eat a big healthy breakfast and eat it slow! ~ Also, drink water before eating to prevent overeating. @anushka_2797 @bg_119", "_malyaj_": "@aaryanarayan @shreya23agrawal - Confused in what to choose in a healthy diet? Add everything which was readily available before 20th century. The time when 'food processing' didn't come into picture. For instance, roasted unsalted peanuts are anyday better than the peanut butter available in the market. Happy Health 😊 !", "i.s.h.a_m.i.t.t.a.l": "keep ur self hydrated but dont drink any liquid stuff when you are having your meal as it will cause problems in digestion @n.i.k.i.t.a_j.a.i.n @anjaligarg029", "_peeyaaaaaa_": "@priyanka_pawle @ruchikagandhi23 Heyy ! Eat well ,sleep well, lift well ! ✌🏻", "i_lancylorance": "Smile always... For a positive Mind... @ashma_ashz And @m.y.s.t.i.c.a", "brown_journal": "@simran8871 @rithurai973 @bhavyabatra101 @amuu_batashaa Stay happy and hydrated, it goes a long way. Also, some exercise helps, even if it's just a 15-20 minutes jog daily. #StayFit #StayHealthy #Skechers #SkechersIndia", "richagohain_": "@nitashree_gogoi and @bipashatayeng. Drink lots of water", "dudarampawar": "Nice", "story_teller1208": "@shewizardblood , @__cosmicbeing__ , Sleep with your AC turned on to the lowest temperature. Your body will burn fat to keep your body warm to a 37° temp in a cold environment and then you'll shed those extra \"charbi\" ! 😎", "subuhee": "@touseefsyed111 @fehmida.bano why don't you go cycling with Skechers on.. will do wonders!!!", "peckwoodhigh11": "@_theconfusedwriter_ & @confused_clicker.... well the fitness tip is \"Skipping - 100 times everyday\"", "sarcastic_shef": "1 fitness tip? Dance to your favourite music. For me that's the best fitness💃 @shubhi_do_bi_do @shivaaa_nii", "jinnie_dhiver": "@jaan.vi @dinky1812 Tip:if you want to stay fit do yoga and also summer is here so be hydrated..", "divya_choubey": "Have those and dance it out, or go trekking, or simply go for a morning walk! @venusnephilim @shubham_deolia", "iamvaishaly": "@chubby____girl98 @itzzz_i_me_nd_myself See red----This intense and powerful color can cause an energy surge, so  you may benefit from wearing red clothes while exercising. Better yet, paint the walls of your in-home gym a vibrant red to get the most of your workouts.", "ohmygod_nidz": "Fitness tip: Love yourself 😍", "hereisbhabya": "Fitness tip : You could use ice to rub on any region where you have fats for 10 mins daily it will reduce", "chinmayi23": "@devyani_ninawe @vaishalipippal94 fitness tip: Get out of bed first ! 😂😘", "vikasitha_ratnayake": "Tip- do breathing exercise before sleep and before getup from the bed in the morning", "one.lankan.girl": "@devindakahatapitiya @sath729 fitness tip : eat fruits and drink water any time you can", "jyotisngh4": "Fitness tip: drink lots and lots of water.. Summer is here, so keep yourself hydrated!😊", "akshita_sood": "@deshantkaith @gautampranjali_ stay happy to stay healthy💚😊", "anshitakalani": "@mukta.jain.501 @karanchawla77 Do weight training to reduce extra calories even if you are on rest mode. Cardio is going to burn calories only when you are doing it. And ya stay hydrated.", "aishu_1903": "@mohtamegha @anshikanagar get up.early in the morning and do a bit of exercise or yoga..The extra fat will melt away sooner!", "mandeepgohlan": "@anmol_0510_lalwani @shreyau11 my best finds 😚😚 . TIP: Get vocal and recite positive affirmations and phrases such as; ‘I am strong’ and ‘I can do this,’ while performing exercise. This will motivate you alot", "s.r.u.j.a.n.a.a.a.a.a": "@tannishqa @pallavix_ .. Fitness Tip 1 -(do you know that if you paint your workout room in red..it will give you more motivation to work out. ...cause red is bright and refreshes you and gives you the will power to workout more.) Fitness Tip 2- (Drinking water before working out will prevent you getting a fatigue during an intense workout ) P.S - i personally like working out in a park...and its the best place to work out😆😆😆😆😆", "meghaagarwal31345": "I know it's a very basic one but I think the most important one-Try and have Lukewarm water throughout the day.It will help you get rid of all the toxins and extra fats❤️💗 Tagging @varshagoyal13 @rachnagoyal1512", "shaur.yaya": "Aqua running. Because water is denser than air, it provides a greater workout in a shorter time. It also greatly reduces the impact on your knees and ankles. @linovi_lino @alka_ch", "lath_01": "@kritz_xo @lipika_prabhu Fitness tip : just stay happy!", "pavani_priya2": "@ramadevi_17 @hena_sukumar and the fitness tip is that eat whatever u want in a limited way and do whatever that makes you happy and enjoy it .By doing this we will not only be physically fit but also mentally 😁❤.I hope you'll like it🙋🤗", "kushummehra": "@daksha1000 @vaishnavi_kushwah", "sakshisharma18_": "Most important fitness tip is drink more water , eat healthy , some exercise and smile more and feel healthy fron inside..@singhsuhani_5111 @deeppriyasrivastav", "garjo07": "Have a glass of hot lemon and honey water everyday in the morning, it keeps you fit and glows your skin. @jaivyaswrites @anushkaiyer_", "monisha_rt": "@vaishalipippal94 @chinmayi23 wake up early and start running with your favourite shoes on✌🏼", "nunisaditi": "@rajniee @mridusmita_goswami Fitness tip-Working out in a bright coloured room or even wearing bright clothes gives you an energy surge.", "anmola_0209": "Have at least one meal in a day without using any of the gadgets...like phone, tv etc...it will help you to watch your meal and help a lot in the long run @apoorvi_b @meh_rieeee", "millyygautam": "See red. This intense and powerful color can cause an energy surge, so you may benefit from wearing red clothes while exercising. Better yet, paint the walls of your in-home gym a vibrant red to get the most of your workouts. @thekunalsharmaofficial @anmol.arora01", "tanvigarg0219": "If you exercise before you sleep, you burn more calories while sleeping @kanugarg1804 @_kan_u_not", "nivi0910": "People who want to quit smoking are twice as likely to succeed in quiting if they lift weights than if they don't lift weights. @divyasingh_04 @so_.and._so", "ak.uuuu": "@sarcastic_shef ♥️♥️♥️", "smartwizards": "Hey You have a great account. Can you check mine too whenever you feel low. My motto is to increase knowledge and spread positivity & learning. Tagging your friends would be much appreciated.☺", "ajanusha": "@bhavika_a_sharma @anki0308 For people who aren't into exercise much and it's difficult to avoid your favorite desserts too. My fitness tip for you guys: Wear your sports shoes and BRISK walk for 30 minutes. Do it at the same time daily to make it a habit. And don't cut down on your calories altogether, just start taking smaller portions of your favorite desserts. Small steps like these, go a long way to keep you fit. P.S: Tried and tested :D", "sravya_godavarti": "@salomamathew @singh.ammy18 drink plenty of water and go for running in the morning", "dr.kookoo_chikoo101": "My daily go quirky fitness tip will 10 times of Suryanamaskar a day Thats it and ur done fr the day. @maryammarziya @ritu_rk1510", "itsjustannu": "Keep rolling your eyes! 🙄 They keep your ciliary muscles 💪 & your eyes 👌 @poornimavwali @nehaparaj", "ridhimaamohini": "Quirky tip : Just move ur body everyday of the week 😉😉 and my two bestfriends @tishya_pandey @ahsan.anam22 💕", "beckypgeorge": "@priya_a_j @_eliabraham_ Quirky tip : Buy pretty gym clothes. You'll feel guilty for not working out !!", "iroshnisoni": "@sansu2703 @krutikatalegaonkar My quirky fitness tip in a quirkier style! S - Smile and Sing it- Shava shava! 🙌🏻😁 K - Kick off stress with - haan ja haan ja! 👊🏻🤙🏻 E - Energise yourself with water - no cola cola! 💧🏃🏻‍♀️ C - Clap and dance with - chacha chacha! 👏🏼💃🏻 H - Hold your breaths with - baba baba! 🙆🏻‍♀️ E - Eat and walk - no do pahiya pahiya! 🚶🏻‍♀️🚶🏻‍♂️ R - Rest your mind with - dhyana dhyana! 💆🏻‍♀️ S - Sketch your curves with - say haan say haan? 🤔 - SKECHERS!  @skechersperformanceindia @sejalkumar1195 ❤️", "super_sarcasm": "Plsss dont stress over lil things in lyf", "bhandare.vaishali": "My tip for fitness happyness.......be happy with your life.....", "pooja_amr": "@_melan_cholic_ @monsnivi Fitness tip is that, don't buy unhealthy item and stock it in home. Cuz of there is no unhealthy items you will be forced to eat the healthy items in home.", "nafisathaseen": "@ak_thamim @greeting_star my fitness tip is to drink lots of water n stay happy no matter what", "sanj._.b": "@freshfusionsalad", "keerthybosemoon": "@priyatenapalli @sanjana_bijoe Laughing is the best exercise one can do. Do smile at everyone. It will increase positive vibes inside you and keep you very fresh.", "101vedz": "@nikxisasuka @tush.tea eat less pizza", "anush.rii": "Eat small quantity of chestnut's daily , it's really good for health (chestnut is a multi - purpose dry fruit )", "ayantikapal.06": "@_.sakshipal._ Warm lime water on an empty stomach early in the morning helps stimulate the gastrointestinal tract. Digestion improves, heartburn is reduced and it helps in the process of elimination. Lemon juice has citric acid, which helps the enzymes to function better. It also stimulates the liver and aids in detoxification, and also helps us to reduce belly fat. . 👍", "koyenadas": "@sejalkumar1195 hi. I have to say this that I really love you and your videos. And for the tip, there can be nothing better than drinking loads of water. At least 3 litres a day. 😬 @anishaaaaaaaaaaaaaaa @kajoridas7", "arunimajoseph": "@amit_wakekar @_pournimajoseph_", "bhavya.gif": "@_manishika_ @ab30sharma 🍔, 🍁, 💩!!", "samriddhiguptaa": "@ashagodbless @bookamillionlives ! 😍 Fitness for me is drinking lots of water and a morning walk!", "veerta_verma": "@kritikabedwal @0_shubham.kamboj_0 early to bed early to rise,makes a man healthy ,wealthy and wise.🌟🌟🌟", "shubangini": "\"STAY NIMBLE, STAY FIT\" take every opportunity to take a few steps every few minutes during the day. .@brownskinofficial @naidupriyanka @sejalkumar1195 btw #sketchers is one of my fave running shoes. They are so comfy I'm just in ❤", "faziabatool": "@marfa.batool @thatgirlwhoswirls Fitness tip would be \" Its not nevessary to hit the gym. One can choose dance, zumba, functional training- basically anything one enjoys\" I would love to get this pair of shoes. 😘😍", "procrastinetra": "@revaathalye @armes.maedchen Drink lots of water & Run", "joyner.fernandes": "@leonie_fernandes @prankz25 train your mind first, then train your body.", "mariahuzefac": "@ruqaiyah_abbas @jamsshk I've tried dieting, the gym, cycling, Zumba, what not. I'm not saying it doesn't work. Well everything works if you give the time and effort for it. But for me, it started to take a toll on my health because I'd literally have to squeeze in the fitness regimes in my busy schedule. So @sejalkumar1195 , the quirkiest advice I can give you, is, relax. Unwind. Never overdo yourself. Your body needs to be taken care of in ways that aren't limited to overworking yourself. For me, unwinding is simply stirring up a glass of juice, and chatting with my mum! Oh the relief! ❤️", "luxeaccessories22": "@mahekbansal16 @bansal_kritika must try these shoes from @sketchers11", "skadoosh__10": "Fitness tip- 1st of all watch 'how to get fit for 2018' n 'My workout routine' on sejal's channel!! 😅 Then all you have to do is follow it!! 😎...she makes the most apt n realistic videos ever!!! 😍😍. @nirjarajain1002 @_leo____mrt11", "shubhigupta_2": "@aayushi.agrawal.19 @ss_721141421 If you feel hungry,😋 you could just really be thirsty 🤗. Drink a bottle of water🍶 and see how you feel!😍", "prabhajacob95": "@nehahahahahahahahahahahah @seno_rika ♥️ tip. Choose stairs over escalators wherever possible 😬", "styleitwithsushi": "@k_aashish @anumula_vanshika Running slow is better than running fast.", "enaildiaries": "@anjalibohra12 @jigyasha_dugar03 @pallavi_samtani .... ➡️Drinking a glass of warm water every day... and of course Dancing has to be in the fitness regime 😬💃🏻", "mourushi13": "*flawless", "thecontentspace": "If you are looking for a quirky one; broom the house like you are doing squats and mop the floor like there is no end to your flexibility. Not classy but, the kind of quirky that happens when the maid goes on vacation. @sejalkumar1195 @skechersperformanceindia #Lifeofanindianwithoutmaid 😝 @vazu88 @discombobulated_obfuscator", "bong_belly_stories": "I tag @jatinprateek93 & @vedant_vaid My quirky fitness tip would be : drink pickle & pineapple juice after workout. The salt and vinegar in pickle juice helps muscles recover sodium loss and decrease cramps & pineapple juice can reduce post workout inflammation ✌🏼#happyworkouts", "riaananya": "Lovely", "shivani_maher07": "@shaifali_mahar @vibhutilahoti235 1. Try to avoid carbohydrates in night. 2. Drink plenty of water love you sejal💓", "ruchitapurabia": "Sitting in a right posture. There can be no better way to check that growing tilt hump on your shoulder. Right posture makes your body burn colories. Magic, right? And even makes one look tall and slim. @azyan29794 @deepikabarad tum bhi try karlo mere janeman. @skechersperformanceindia", "pvartika": "@anushaaahmed @khan_shabnum Quirky health tips- 1.Dont brush teeth after eating acidic food 2. Always flush with the lid closed", "keya_ayek": "@kritika_garg @snehagupta.96 Live to eat n stay happy ,you'll be fit both physically n mentally ❤️", "_missmatch_": "@miss_chattrjee @sanjukta_84 Luke warm water with Joey and lemon early in the morning keeps your metabolism great and makes you fit from inside", "naila.tariq30": "Can we still apply if outside India. I live in Canada but want these sooo bad. A motivation to go to gym and start walking. Tell Sejal @sejalkumar1195", "cosmi124": "@gargi_swargiary @the_clover.girl the first step to fitness is to wake up early in the morning and get a warm-up for the day😊", "dentthetoothh": "@sakkssiinngghh @rashi_singh5 , Stay hydrated and laugh as much as you can to burn calories and haters @sejalkumar1195 #giveaway @skechersindia #skecherperformance#skecherperformanceindia ♥️♥️", "aanchalmadan30": "@sa_ri_ta_21 @samagya_bhattarai tip: maintain a good n healthy diet first rest regular jogging and some fun activities running dancing outdoor activities are enough to be fit 😊😊😊", "karan2395": "@theb0aty @biryaniandbarbell a shot of black coffee before workout.", "mishamukesh": "@iaditib @vatsalabansal stay motivated always!", "xsumedhax": "@rose.and.dagger @taniiiiii_99 only 2 friends I have lol.. quirky tip: Sprinkle some salt/baking soda into your shoe or sneaker at the end of the day, then shake it out in the morning. It will help pull out the sweat—and odor. This is perfect to do after a run or after wearing your shoes without socks.", "rashmi___p": "@pallavi7795 A GLASS OF THIS DRINK AND EXERCISE WILL HELP YOU TO LOSS YOUR WEIGHT quickly😘 Cumin Weight Loss Drink. Soak 2 tablespoons of cumin seeds in water overnight and boil the seeds in the morning. Filter it to remove the  seeds and squeeze a half-cut lemon to this. Drink it on an empty stomach every morning for 2 weeks for quick weight loss.", "__.kiseki.__": "@ittidiksha @komal_695 Do activation excercises before going all about with the workout if working on increasing a focused muscle for example glutes, if working on getting a toned butt. It can be done using a resistance band. And an extra tip, do weight training. No matter if you're trying to gain weight or loose, it increases the process of losing weight as the muscles undergo micro-tears and work even when you're sleeping in order to recover and they require a lot of energy which is drawn from the extra carbohydrates and stored fat. Also you have to adjust your diet accordingly, and if you want to gain weight then these help you gain in the form of muscle and not fat by simultaneously adjusting your diet, by adding more of proteins and complex carbs and healthy fats. And that went on for too long. 😅 Plus weights help you get healthy bones! Bonus for women!", "meghna810": "@anupama.singh @shreya.pandey1510 I suggest you try hula hoop. Coz YouTube really well.", "swa_17": "@lahari_valmikam @lakshmi_sannihitha", "jeelgala": "@_kushangi @its_av.a.ni Use maple syrup as a sweetner instead of white Sugar or any type of sweetner. It's yummy and the best alternative ❤️", "kushamalhotra": "Tip : Eat all you want but in appropriate amounts and don't overdo anything, which includes dieting, exercising, eating, etc. Stay motivated, happy and hydrated to get into a physique that makes you happy and always remember that you don't have to be skinny to be fit. @anchtech @sistechno", "aprameya.ramesh": "@khusheyy @maya.mohan My fitness tip would be to watch 2 episodes of a show and run while doing that or you can’t watch the show", "aishwaryaa203": "@shwetadhawana7 @yashanjaligavasane .. not much to do everyday... Just run in the morning with fresh air.. offcourse with our favourite shoes😅.. and stay hydrated as well..!", "prerona_postrona": "@jeshie_jc @itoyj_shmita Walk whenever you get the chance and indulge in sweets on your cheat day :)", "haneetkaurr": "@manveen_kathuria @agrima.grover tip: make friends who are fitter than you💁🏻‍♀️ so they indirectly/directly motivate you to get to the gym and workout!!", "milly_willy_wonka": "@panjwani_soniya @gauriramani super simple and most important fitness tip. Believe in good vibes and most importantly believe in creating them. Every other thing will follow♥️", "priya_detha": "@menon__annapoorna @nora_elizabeth_mathew stay hydrated. Drink loads of water and have a check on ones sleep-wake cycle.", "bhavnamotwani": "@kritibharadwaj2896 @poetaato poop should be the first task that one should be doing everyday😋 And then have a glass of hot water with honey and lemon. Aggravates metabolism and the day that begins well, also ends well. 😌 Also, loads of love to you. ❤️", "insta_styleicon": "Lovely picture mam", "_.ravnitt._": "Have a good warm up before you workout. @lazy_bean_bag @the.boohoo.girl @sejalkumar1195", "lets.stop.being.busy": "@vismayaa18 @soul_ful_77 u guys know of my love for running shoes :p quirky tip is - lie on the bed, raise ur legs 90 degrees and padle!", "sushmita_grewal": "@rishabh_0909 @grewal_sush Train your mind. That’s the only advice I will give to you as well as everyone. Training the mind trains the body, telling it that you can do it and hence you will do it, you tell it you can’t do it, one will never be able to do it ; no matter how easy the task is. Your mind can be either your best friend or your worse enemy. Once you know how to work your mind/brains, all the fitness as well as other things fall in place", "kashish4319": "Hey sejal didi, 1 best tip is, I think you should start drinking more and more water, as water plays an important role in fitness, keeping hydrated decreases food carvings. often we think we are hungry, when actully we need is a big drink of water. Along with zero callories, drinking water also increases our energy levels and metabolism, 2 best tip is YOGA, actully yoga is a science of using physical postures to purify mind and body, its not only makes you physically fit but also mentally and emotionally fit too.., and to be honest im a new comer on insta that's why i actully don't know how to tag someone so sorry for that, and i hope you like my suggestion, as im of 18 years old so m bhot choti hu apko suggestion dene ke liye but i hope you really like my suggestion and i also love the shoes😅😅", "siddiqua_fatima07": "@ayesha123nhm @afiya__anjum fitness tip : have a healthy strict diet", "mansirawat02": "This shoes are really so good", "badmaaash": "Fitness Tip: Cardio is not everything, you gotta try weights and of course keep a check on the diet. Also, don’t keep yourself craving for things. Have it, but do burn it out later! @ferdiii_9 @sonamjha_26", "chanchal_netam": "You have your own best suited fitness routine ..but as i need to suggest a tip its like waking up early and breathing in and out the fresh morning air on a pleasant morning walk! #sejalkumar @sejalkumar1195 @skechersperformanceindia @aayat2169 @pujaagarwal424 💕💕💕", "the_one_and_only_richa": "@sejalkumar1195 @prakanksha_chauhan @ranabanita055 Feel hungry often ??? Learn to differentiate between hunger and cravings. if you had your meal and still feel hungry at the odd hours , it's craving. What can you do about that ? Satisfy your craving with something healthy. This will prevent you from eating junk and unnecessary calories. Options are :- ✏️Keep almonds handy. ✏️Fruits are the best replacement. ✏️Murmurey(puffed rice) ✏️Steamed corns(without butter) ✏️Sprouts..etc 😊😊Hope this will work for you sejal.", "ohhsofickle": "@shraddha_21 @safa_tk Drink water like a fish😝", "devangkasturia": "@omirkumar @tanay_singh_chaudhory Fitness Tip: “Workout till you’re in pain as pain is weakness leaving the body” @sejalkumar1195 @skechersperformanceindia", "tanvigupta4597": "@bhargavapranay @ankitabhardwaj once in a week take a juice meal...like orange juice in breakfast, red juice in lunch and purple in dinner....as juices provide all the hydration that body needs and detoxify the body....instead of cold drinks n shakes go for juices whenever thirsty.", "janvi.balwani": "Also it’s just me or anybody else who noticed that @sejalkumar1195 always puts up a post while at the airport?! 😂", "_paushali_": "@dibyangana23 @x._the_optimistic_soul_.x I am an extremely lazy person and i don't actually have any fitness tip ...but 1 thing which keeps me motivated is Sleeping reduces calories!...How cool is that!...Wish me luck to grab this pair and get fit!... Thank you ..Sejal,Love your contents!🌸", "purtysamaddarofficial": "If you are a lazy person like then a cup of green tea in morning and apple cider vinegar in the evening will do wonderd for u 😂 @sejalkumar1195 tagging @ankita_khanna9 @kissmyfashion_27 to share theirs too", "dhwaniprincess": "@neh_98 @_sakshimhatre_ sleeping won't help 😂", "apoorvi_b": "Lots of water and 1/2 hour of surya namaskar in the early morning hours. It helps you stay fit and keeps the mind fresh. Easy to do and huge benefits!! @drvinit.brahmbhatt @anmola_0209 @skechersperformanceindia", "_high_on_tea_": "@gauri_pruthi @_creating_happiness just be happy ♥ khush insan hmesha mentally physically ir socially fit rhta h ❤", "heyprabhu_": "@minalpoddar @amitadhargalkar tip: do that exercise which makes you happy! Like dancing, sports or anything else. Also, take care of mental health which is also important for fitness!", "omirkumar": "@devang_kasturia @sauravvvthakurrr \"Eat as if it's your last meal Workout as if it's your life depends on it.\" #indianyoutuber #giveaway @skechersperformanceindia", "jeeva_muniappan": "@avinashkrishnadns @yuva_muniappan Run!! nahh not in treadmill outside with fresh air the feel is totally different 😀😀 Dance to your fullest be happy stay confident make sure u wear a smilie on your face 😁😁", "thespiralrainbow13": "@ektakashyap491 @the_diary_of_1013 Drink a lot of water ; love your imperfections and the way you are😍😘", "optimisam": "Drink lukewarm water with some lemon squeezed into it in the morning. Its a good wayyy. Oh, and friendsss, @srabastidutta and @a.bipolar.being", "mukhivishakha": "Every day is a fresh start don’t give you are the the best at this you can do it also remember positive mind, positive vibes, positive life @_hetvigandhi_ , @diya_puri", "parita.contractor": "Play badminton with best friends n Drink warm water or infused water. @14_khushi @_mast_malang_ @arzoo__mehra", "dr.sonia_daga": "Make sure that you're eating a balanced diet ,consisting of fruits, vegetables, complex carbs, complete proteins, and essential fatty acids rich in antioxidants and micronutrients. @dr.sushmitha_jain @rohakdaga", "jayashreerangan": "Milk +honey+ haldi every night, gives you strength and eases you to sleep ✨ @the_selfie_stick_guy @__little_minx__", "komalrajgadia": "@sejalkumar1195 @vish_7041 @_chocolate_muncher Girls buckle up ur shoe lace #run, get life and way more sexier😉 p.s-At the end of the day do dash ur shoe with salt=relief from odour😋😎", "lifestylewithpriya": "Quirky fitness tip is make a healthy smoothie full of fruits and then take it to ur workout session.. be it dancing,gyming,cycling that way u enjoy physical fitness along with healthy nutrition @sejalkumar1195 😀 tagging @oceanthakur @purty_samaddar33 to share theirs too!", "weddedtowaffles": "Whenever you're craving something, have two bites of it and then drink ice cold water. That way, you'll satisfy your cravings and not really cheat on the diet either. 🙈 @aakriti_j8 @tuba.kazmi . 👅😂", "dammitdamayanti": "@purvs12 @nioshishah run as much as I do!!!!", "100janyaa": "@ashwatimenon91 @shruthithavara fitness tip also to the mind would suggest to keep your phone aside half an before going to sleep so it relaxes your mind and you get that much needed sleep 💤", "the_curly_mermaid_": "Fitness - make sure you are happy by your heart then automatically you will love your body ❤ @jacques__prashanth_sg @nickybhushanam", "sahiba_bhojwani": "@harshii.srivastava @blithe_musings . Hop hop skip and skip , skip till you find your grip. Skipping is the best exercise! @sejalkumar1195 @skechersperformanceindia", "purvs12": "@dammitdamayanti @inevitably2911 sleep with bra off!", "cupcake_2169": "Drink water in morning first n ignore negative vibes 💕 stay positive 😘 @pujaagarwal424 @chanchal_netam", "josphine222": "@raop6721 @swarna_m_k Love yourself 🕺🏻drink lots of water work out 💪 30 min sit up straight breathe deeply stay present be grateful love everything .", "salonirajput_01": "@akaanksha_s @disshadissha tip: Drink a glass of hot water when you wake up and a glass of cold water when you're about to sleep. This will help you stay fit.😊😉❤", "zinkspat": "GIVE IT TO MMEE!!' I'LL ROAM AROUND THE STREETS AND DANCE! I PROMISE😍💃 @sonaaa.x @badmaaash @ananyaa_9720 participate guysss!! @sejalkumar1195 done🤗", "volantejeans": "@sanam_nishit @nishthereddevil", "avantikajain97": "@tejesvii @suchira_upadhyay the tip is that begin each day asking your body how it feels, not wondering how it looks", "jhaprerna46": "@simranjha1499 @reshmisarki u love dancing, me as well so wat i basically do i convert my exercise into dance step and then do it.....aise exercise v ho jata hn nd entertainment v.", "divisha_agg": "Try to give atleast 1hour a day to your body. Eat healthy. Exercise daily. Go for run and walk. I do the same. So guys Go and Get this really cool and comfortable shoe. @skechersperformanceindia. @dinkymahawar97 @bhavyagoyal20 ♥️♥️", "aacreetiee": "@s_meeta @srizana_chhetri drink as much as water, and stop your junk food ❤", "aasthadogra": "Cycle to your closest market whenever in need and take stairs instead of those elevators. @adkashyap @bhatt_sakshi", "pragyatrikha": "@lokesh.modi @raghav_trikha it is scientifically certified that you kissing mohak will release the oxytocin in your body... making yu feel happy... being happy will be encouraging yu to stay fit... 😍😘", "kukreti_jayati": "@sejalkumar1195 @nishthanaudiyal and @adiirawat you guys can dance💃 ,walk🚶 , run🏃 in @skechersperformanceindia shoes ❤️and cut some of your extra calories or get that into dress 👗you were trying to fit. the minimal thing that you can do to keep yourself fit is jump rope daily for just 10 mins in @skechersperformanceindia shoes👟😃😃.", "pallavi__kk": "@deepika_yadav_01 @himaniwaghela8474 tip is too be positive about your body and eat as healthy as possible and excercise atleast for 30min or do cardio which will balance your whole being fit or staying healthy process.", "ladytenshi_14": "@sanah_sartaj @sumaiya_1230 do crouch for at least 5 minutes a day to see how strong are u 😊", "aashanadhingra": "You must take out what you take in .... now there are multiple ways to do that, but exercising has proven to he the most effective and long lasting one. 😋💪🏼 @aishwarya_sahney @charitjaggi Hi my fitness freaks 🤗", "gillsimu98": "@mohan.aditya05 @parularora2209 being with you guys keeps me fit 😝😝", "basu__sukanya": "@suranjana.sen @rosypayel @sejalkumar1195 whenever you go to pee.. do 10 squats babe ❤ lots of love from the city of joy !! #sejalkumar #skechers", "__alizeyy___": "@sinchankm Fitness tip-drink detox water and walk faster than u usually do!", "junemybaby": "@sejalkumar1195 replace your mirror with a concave mirror. You stay motivated (like all d time!!) and all the tips on this post will come handy!!! Make sure that u keep some water, weights, fitbands and shoes from @skechersperformanceindia next to d mirror...u never know when your motivation might lurk around!!! @steve.prem.1983 @shwena contact me if u need personalized fitness tips 😎", "_selenophile_98": "Hope @sneha_pansare23 wins this giveaway!! ❤️❤️❤️❤️❤️❤️💯💯💯💯💯💯💯", "fianafashionforward": "@sejalkumar1195 Always have a glass of lemon water and honey in the morning and always use stairs say no to elevator @lifestylewithpriya @prettyyouprettyme #giveaway", "satabdipanigrahi": "@swainswati @agrawalshobhit Wear the @skechersperformanceindia shoes and go for morning walk daily. @sejalkumar1195", "nikitaaaaa95": "@la_terca_alma 15mins skipping and you're done for the day❤️", "splitfire130": "Jump n bend more often a day 😛@anamika3998 @its_me0404", "tamilselvi.pandiyan": "@kanimozhi_pandiyan @saranya.cabin .....I exercise bc I love food and staying fit too😀😅", "ruchimhatre": "Not eating 100% to fill your stomach rather eat 70 to 75% so that you digest the food and does not just fill in extra fats!! Also rather walk small distance whenever and wherever possible, avoid using transport for small distance, avoid lifts, and atleast walk for 10mins every day. @theuppereastside21 @_being_garfield", "sssoman_18": "@somanswapna @_she_calls_me_drushti_ Run with fun😎✌🏻because as someone has already said either you run a day or day will run you🤟🏻😉Atleast these shoes will make me motivate to take running & fitness seriously✌🏻☺️", "veeeeeeee.e": "1 tip... it would be cook your own meals (if you can) so you know what healthy and unhealthy stuff you’re actually putting in your body also stay consistent and of course get these shoes 👟 @skechersperformanceindia and get your a** movin man!😆😁🏃🏽‍♂️🤷🏽‍♀️ yup @muskanmakharia @devangi_17 imma tagging you!😛😉", "akankshamund": "@shirshakmohanty @sunita_bimal : The best fitness tip would be to know your body and then work accordingly to keep it fit abd active. ✌️😎", "tanayadeshpande": "Download an app that’ll let you track the number of workouts you’ve completed vs missed. @saumya_gautam @notink.munch", "supam_roy_": "@akansha_soni.6 @singhallovely Do yoga for atleast 15 mins a day and that will lead to positive mind, positive vibe and positive life😄", "raghaviiiii": "@ridhima2851 @nagpaul.ritu just do it!", "twinkleghai.99": "@poonam_harjai @vibhavohra1 ....😊😊Drink sufficient water,do yoga,eat healthy die & ignore negative vibes to ensure mental n physical fitness 💗💗", "saurav_1111": "Listen to your heart, don't force any restrictions on your body and continue doing things which make you happy 😊♥️ @sneha_pansare23", "chinmayee.shenvi": "@sejalkumar1195 Hi Sejal, I am a huge huge fan. The quirky fitness tip is saying \"shhh\". Not kidding 😂 I read an article few days ago which said, and I quote \"The louder your sshhh, the better. Saying \"sshhh\" oxygenates the body, increases strength, tones abs and reduces neck tension.\" Now that's weird isn't it. Tagging my two best friends from the time I was just a few months old @nidhi.shenvi @ravindrashenvi", "skylarks.sky": "Hey there Sejal! One quirky tip for better fitness and healthy lifestyle is to drink chilled/cold water when you wake up. I know it sounds crazy but I'm a biology medical student and I have read that when you wake up, your body metabolism is very slow and has just started working in its daily manner, so when you drink cold water, your body works to stabilise the temperature of the water to normal temperature, which in turn makes your metabolism faster and helps in better health. It even helps in reducing weight. Thanks, keep inspiring. 💕 @enchanted_fireflies @skylarks_sky", "riyamehraa_": "@taniadasgupta_ @ku_is_achha_ It needs to be dancing for sure. Apna type ka dance👅", "shivani_das07": "Never \"miss\" your fitness routine... Its the best way to stay fit😉 and keep smiling just like you are doing it now. Same goes to my bff's too @bikomiyavandana @seemabkt123 ❤️", "niharikaa____": "Everyday run for 20 mins or just walk 40 mins a day good for heart and good for everything and will not need to hit the gym @antra06 @naina5342", "_surajita": "@_shweta_bharadwaj @aananya_26 Smile is the best medicine for everything so keep smiling. ❤️", "being_beatific": "@sakshi6775 @saara_lahori eat~sleep~repeat 😍😍😅", "srilekhyadinavahi": "Fitness is all about you first being mentally fit, so yes be happy with your body and then do what it takes to get into that shape you desire but not force urself into... The tip i have been following, \"Love ur body\" nd it worked wonders to me, hope it does the same to u.. love u", "kaasshh.rly": "@_miss_chaya @_autrayee_", "pranureddy9": "Stay away from mirrors Hahahah @pari.peddi", "the_sassy_libran": "@vijetashenoy @preranapai EXCERCISE because you've got that great shoes! ❤ @skechersperformanceindia", "maisha_bagchi": "Eat.sleep.workout.repeat @thisis_naira @lilly_flo_", "raghumtaneja": "@pallavidevasar @priakataria eat brocoli", "angeerayadav": "@artiyadav4614 @kavita4786 fitness tip ::: an apple a day keeps the doctor away 😂😂😂 yay!!! I won hehe.....@sejalkumar1195", "gauravi_mestry": "Simple steps like drinking luke warm water, hydrating your body well and walking everyday @mel_m12 @cee_mystery", "geeta_joshi.gj": "@musskaan_hora @sasandy37 ..An apple a day keeps the doctor away,but if the doctor is cute,forget the fruit😂", "sneha_pansare23": "Drink water, sleep, wear sunscreen, make that body move, give a hug, get a hug❤❤ @akshataabhujbal @saurav_1111", "itsvishya": "@_aadithya_rajan @its_pranesh start your day with green tea and exercise for 30 mins which makes d difference or dance in ur own way (sejal wali dance (miss it)) nd lots of luv to u sejal nd do a vid with mohak 😍😍", "aurpona": "@rohitshetty00 @simibhat96 Jumping Jacks after glasses of warm water in the morning to get the right pressure💩😂", "suvidha___": "Smile...It doesn't require much effort and it's free!!N yess it keeps u healthy", "anshika_s22": "@11_aditi @kaushikswastika...eat healthy in regular intervals of hours and in small quantities as it helps improve your metabolism", "starryy_nightt": "Dance💃💃💃 love ur workout routine n u will never skip it 😉 @wanderingg__soul @__zinii__", "ramenlover27": "Fitness tips: 1. Always cut your fruit in 1/4th part and eat, because fruits carry a lot of sugar too and we should cut down on that too. 2. Don’t drink cold water or any cold drink in your periods as it may lead to increasing your cramps. @bhumika_makker @neetika.verma @sejalkumar1195 @skechersindia", "yuktigarg_": "@aanchal.garg.31 @ishuu_193 Eat Excercise Eat!", "hillstoheels": "Always eat 1/4 of food first incase you feel more hungry eat another 1/2 if you feel you don't feel more hungry then stop there and always eat home made food and drink lots of water @janakpreet_singh @yashnadatta #wishtowin #fingerscrossed #skecher", "11_aditi": "@kaushikswastika @anshika eat healthy , sleep right and drink water our body is not a trash can so don't fill it with burgers and pizzas", "thattroublemaker": "Dance whenever you feel like 💃 @_sanikasjoshi_ @riddhivartak 🦄❤", "gauransh__mohan": "@thesagittarianfille Good luck. If you win this, I am getting a treat. Okay ? Vaise I met her AGAIN at Fanfest showcase @sejalkumar1195 😍❤️", "mr.jason_j27": "\"Yoga\" the best way to be fit @mavendsouza3_ @the_crazy_love__", "mel_m12": "Daily workout goes a long way @gauravi_mestry @rheachloe_m", "riyanagpal20": "@shreyasharma2140 . @itsmesanya_56....tip: wake up early and just do skipping. It really helps cause while skipping...every muscle is working.", "shrinsehrawat": "@dam03kajal 'your wings already exist all you have to do is fly high' ♥️ @sejalkumar1195 ♥️", "richaonthego": "Health is not complicated. Don't go after diets and detoxes. Just work your way through basic strength training, eat clean and sleep tight. 🙂", "saisha999": "To remain healthy, I do yoga in the morning regularly and eat fresh fruits. Yoga helps us to remain healthy mentally as well as physically. Sejal Dii you must try it too. 🌼❤❤❤ @aishwarya__naik @ishakhannaa @prince_harris__", "shreya_dalal_": "Always eat in a small plate. If you eat in a big plate,you tend to put a lot of food in your dish. Smaller dish=more satisfaction 😁 @ferlin510 @meghnatongiya", "bekchand": "Fitness tip would be Eating right food at the right time ..sleeping n waking ip on time and Yess walking up to the dept on foot ..no not taking the bus 😂@thehappimess__0_0 @somebody_is_me100 btw if I win this shoes nisi gni ne Masi Masi 😂😂", "namankita": "@sejalkumar1195 stay happy and positive and eat right proportion of meals....@chris.cdshine @satheena28", "sonalimendonsa": "Being a mom makes it tuf to actually fix a fitness routine esp wen d kid is extremely naughty( yes!! Mine is!! ) my arm push ups happen at d kitchen counter! Leg workout- run behind the kid🙄 food? Eat watever u get 😓stomach crunches wd d kid on my stomac! Nevertheless, the fitness doesnt stop😏 tagging @filmymummy @keerthu166 @skechersperformanceindia", "theapachesoul": "Try now, just smile. Start and finish the day with a smile. @vaishali8goyal @muskaangoyal_26", "shalininagar": "@jaslyn_sahni @jasmine_sahni Have a good breakfast... best way to remain fit..!!", "rishitaaachawlaaa": "@pragati_2 @alishaahuja . The tip is: Eat dark chocolate and lose weight! 💜😘 And yaaa, love yaa!❤", "savitharachuri": "@swathi_sb29 @shalini_mv Having caffeine before working out can burn more calories than usual", "___v_a_a_n_u___": "Just have your meal at correct time and most important keep smiling @smitalkale_", "01___manu": "@riteshryder @01___manu Tip: Always believe in tomorrow and eat right. You will be as fit as you need to be :)", "ppankti17": "@hemal_pandya_1567 ,@the_clumsybrowngurl , 2 spoon apple cider vinegar with warm water 2 times a day❄@sejalkumar1195", "shivangi31_sinha": "Use the stairs instead of the lift and keep your legs toned easily! 🏋️ @peaceout_bee @urvi_khemka", "kritika_prasad": "What fitness tips I should give to someone like you who is already so much fit.. but drink detox water(mint,ginger, lemon etc).. they really helps. @shilpisisodia @abigail_momma", "_sajina.1159": "I'm tagging @mohakpapola and @sejalkumar1195 cause mohak has been so positive and sejal you need to find my dm and check it out someday😭❤ and the fitness tip - - - walk like 200 steps after having your food.. like just roam here and there in the house counting up to 200 steps and this helps you feel much better even when you eat slightly more than what you should have eaten! My mom got this tip out of somewhere and I can dive straight into my bed after the 200 steps!😊 @sejalkumar1195 much love from Nepal!❤❤ @mohakpapola love you❤ you're my favvvv👌💕", "nidhi_7626": "@shinshrm89 @aakritiupadhyay bas sans lete raho😉", "anjipan30797": "@_rachna_sharma_ @_priiiiiiii_ the best fitness tip is think less eat more 😅😎", "chauhan.ishant": "Eat your favourite foods(except oily) and do lots of exercise and physical activity. @himanshushukla210 @vijaya_nand_pandey", "manishadevarala": "Treat yourself as much as you can. Good food, good sleep, workout, spending time on what you love and mainly and important keep your body hydrated.have lots of water and greens @kavyakethana @chowdarythejasri", "deepshikhamaity": "@radhikabahekar @purva_dikhale Just keep smiling! Half of your problems are solved just like that🌸", "dikshitanavani": "Begin with self love. @khushi_mamgain @idkcalm", "beebhatt": "@drashti_a_parmar @lovedentistrydrkajal one simple tip: do meditation for happiness (it causes release of dopamine and other happy hormones), get at least 8 hours of sleep for increased efficiency and exercise regularly coz that helps in the formation of new neurons in your brain!", "themillionthfoodie": "Eat your greens. Read your memes. Dance a lot! You know the plot! @notrehankhan @manasioswal", "swatibunny": "Healthy food and a good sleep. I tag @jain_sonam_ @swapnabhoir", "parnika_gupta": "@rohitsketches @impritpalsingh ...eat what you want but never overeat... or if you are like me... do what makes you happy that will contribute to your mental health :)", "_the_foddie_": "@vidhi__chhabria__ @___pranati___ eat cupcakes without the sprinklers!", "dollys1605": "@niveditabanjara okay!!😂😂", "the_insta_bae": "Try yoga and thank me later😉 @bhagyashreepatange13 @patangedeepali", "nilzanikk": "@manpreet.k.mahal @tanwei_dobhaal ..eat right, think right ✌🏻", "chhetri_bhawna": "If you think time flies..do a plank 😂 @karunakar_kanna7 @shivangiprasad1996", "aratrikasarkaar": "@aesthetic.wanderer_ @arpita_sarkar12 Never exercise too much. 30-45 mins of exercise daily is fine. Nothing of too much is good for you. @sejalkumar1195 ❤", "shreya_nag": "Listen to the song \"bring sally up, bring sally down\" and practice, squats, pushups, planks etc in tune to the instructions. ;) @saha_says @natasha.mathew17 .", "ritu.sood": "@chinmayee.dash @shamayelafatima Always drink water between workouts", "_catherine19_": "Sejal#the best way to remain fit isto be always happy whatever the situation may be and yah drink lots of water as it is the key to a healthy body and healthy soul@cuteanaya31 @nehu9n", "banuja14": "If you are free plese check my instagram out🙍🏻🙍🏻🙍🏻", "soniyakubde": "Don't sleep immediately after having any meal. @_pratyushap_ @manju__3716", "aarya_ap": "@_.murru._ @riya141114 quirky fitness tip: play or babysit a kid for a day which will force you to have enough workout..😂😂that really works..🤗🤗", "nautanki_much_": "Have carbs before your work out. Black coffee shots (no sugar, no cheating) just before the workout(about 20 mins before). After workout, have proteins. This helps repair your muscles. @siddhant._.seth @apothem_jump", "anushka_008": "@ananya_shree97_ @anne_d_o17 ❤ Think healthy and positive! That's the best way to stay fit!", "avanivatsa": "Drink detox water comprising of cucumber, ginger,mint and lime", "tapasyakumari": "Think I hv gifted those pair of shoes to you.. now run. @sejalkumar1195", "tanuuu21": "Hey Sejal! 💕Drink coconut water. It rehydrates the body , lowers blood pressure, best for the heart and kidneys as it has low calories. Also it taste so good 🙈 @rutuja.sharma @dhanashri_sharma", "gauri_7888": "@a.n_i.k_e.t @adityarawat_09 .. drink lots and lots of water th keep urself healthy this summers and eat plain yogurt it will keep you healthy and fit for summers ..💓 lots of love @sejalkumar1195", "nimmi.21": "Running & Always be happy😍😍😍😘😘😘😘. @dikshi_2000 @pallavi.chauhan08", "swazz2u": "Say \"shhh\" and as you say it, \"Put your hands on your stomach and feel the contraction, cz\"that's your transverse abdominus and diaphragm contracting, creating tension in the core and strengthening your extremities.\" The louder your \"sshhh,\" the better. It's most effective for core stabilization @manjusikarwar @she_brio", "amy_dc_47": "You should drink barley with lemon every morning with an empty stomach and work out for an hour like walking,jogging,skipping and you'll be fit and fine to go !!! @ria_dcosta @dsouzamaria59", "mehakj2618": "Watching FRIENDS is the best calorie burner. Thats when you realise how short 30 mins(or actually 23 mins to be approx, but who is counting?😏) actually are. 300 cals down already in no time!✌️✌️ @shivanisharma28 @sakkshigupta", "zehra61o": "@hibafatimaaaa @abhigyanmishra_97 Dance your way out at places you can, rather than walking. 💪", "harshita.saratkarr": "Hey sejal di! So fitness is always something personal , it kinda varies from person to person. For me there is absolutely no point of killing yourself and lifting those Weights if you don't enjoy yourselves. It's something that you'll be doing for a long run so having fun is a must :) I prefer dancing,swimming and brisk walks over other things. They just seem to make me alive♥♥♥ @_peshal_ @navyasharma20334 what do you guys think? ?", "tanya_sehgal15": "@_ankursharma @ramandeep.k.cheema Just one thing to be fit which I find to be the most easiest is drink lots of water and eat healthy food!! @sejalkumar1195 @skechersperformanceindia", "arshssx": "@the_little_sophisticated_2 @mashymash1254 ......Drink nimboo pani as soon as u wake up in the morning nd try to have dinner before 7pm😊", "shruti.singh_93": "Walk it away...dance it away✌🏻 @ayushi0306 @dpcse1993", "blogdiaryofficial": "For me dance is the best one can do!! Sound interesting and easy. @shape_your_body_with_me @medicine_of_laughter #giveaway @skechersperformanceindia hope for win.Love you sejal.👌", "newstore199": "@sejalkumar1195 ur my frnd .....just do dance 20-30 mins ..and all tiredness will be gone plus mind will release happy fluids 😍😍@akanksha_jaimini", "mansi_2507": "@mehulgoyal7 @nehaajacob it's never to early or too late to work towards being the healthiest you 😊", "addykashy06": "@_krishnashree_ @meera_gojiya... Eat healthy and run a lot.. From everything that annoys you..", "zxaraaa": "@tamannaghai31 @vermashravya12 SO I WANNA SAY THAT JUST KEEP LAUGHING. FOREVER HAPPY:) FOREVER FIT;)", "darshana_singh": "@shrutibrao @baghel.anmol add honey lemon to water .. try to eat your dinner at 7 pm to ensure better secretion of gastric juices.. and also to ensure that your stomach rests till the morning before consuming breakfast", "humaira_nc23": "@afraibnat_17 @shahnaz_ahmed5", "anupma__yadav": "@falak_aftab", "fellow_ca_comrade": "get out nd have fun palyin ;) @bharti_purantharan @reddy_kadapala", "rish_1210": "15 minutes of exercise can save 3 years of your life. @lalapparishika @vishnuthimmaiah", "kiddingmeorwhat": "@fiveseconds_ofalifetime @ssrilekha Make sure you get enough sleep 😴 Cuz sleep is bae.", "pankhurisood": "@savitasood.sai @supriya.joshi.9400 Try to avoid carbs at dinner time.. stick to all veggies, soup or fruits.. even if you skip this on days when u hv a dinner planned with frnds and family, the rest of the days shall keep ur health in check..", "janhaveejadhav": "@sejalkumar1195 Having water just before sleep, helps keep your neurons active. Fitness in sleep, voilà. @manishayadav1141 @kavitashah_2905", "arpanakarki": "@archana50 @lnaabista . Eat your breakfast on time.", "a.s_it_is": "@kaustav04 @varun._.reddy Tip: Meditate, Drink water, Eat healthy and Dance like no one is watching. ;)", "lashimasingh1602d": "@lj310703 and @nainabajpai_24 chocolate comes from Coco and Coco is basically a seed so ya eat chocolate it's just a nut😉😂", "divyachauhan7252": "Turn on the damn music gurl!! Dance off your day's stress and feel happy and energetic again 💃 @minithesupergirl @priyanka.sh2006", "ruchetha_gp": "@ramithasuresh @ushaguruprakash papaya is good for health n should be had every day", "anamhakim": "@vanshi_nandu and @jiya_jani24. Eat high protein breakfast and avoid sugary sweets and love your body 😊", "aarushibaisla1994": "@sorandomyouwillloveit @fashionsense1994 leg raises while lying in bed 🙌🙏 @sejalkumar1195", "nayna.17": "@sharon___2000 @_anshiii_18 the best way to stay fit is to be Happy 💜💜🕊️", "rashi_1993": "@meghaa.rane @sadhna101 Do hula hoops for 15 mins daily it helps reducing belly and thigh fat", "vaishnavipavithran": "Fitness starts with your mind. Good vibes only. Peace of mind and happiness is important to stay fit. So, adopt dogs, be overcome with happiness and then go running with them ❤️ @v._.p._.a @thechakravarthy", "teja_main_hoon_02": "Moderation is key 😀😋😊 @aditya2127 @jaishwarya_18", "nakiyaf": "@sakina.snow @faridafidaimakeupartist Not many know this, but 'twerking' is a very good calorie burner and its fun too!💜", "mardialphonse_": "@paul_jackson @you_know_am_pro tip-explore to inspire.", "vrushabh_kalmath": "@iamprashanthsampath @prajwal_inc never inhale or exhale from your mouth :-)", "khaarkhuwa": "@poresh_da @ajitav06 Just get up early every morning and drink 1.5 lt. of water. Rest you know what to do. This is the root to all fitness tips.", "_ojayy_": "Everytime you need to have a glass of water , have two. 😽 @ayushi.dang @shivani_ladekar", "__.sonal.___": "Tip would be working out with Mohak bhaya😉😉😉.. Not only he will be a good source of motivation but also u will enjoy working out with him.. Tagging my best frnds @dainanayak @amrutaaswasana", "_sha_pranamika_": "@anandarupa_tripathy @annieshonu Power Yoga is the best ❤", "mehek9901": "@divya.hl @iamtanvilamba going to treks and doing fun adventururous activities will keep you active and strong!!!", "sarkar.monalisha99": "U can dance on any songs which u like and stay fit.. @_akansha_0202 @bhumi_0609", "wine_andwords": "@sakshisingla6856 @liza_rang Always wish to have a few assholes in your life, who want to get their head smashed, so that you can go to the gym and do lots of squats and deadlifts and calf raises and sit ups and everything else that hurts.", "anji_khatri": "Are isko jeetao 😂😂👅👅kya tip Di hai bandi ne dil Jeet liya😂 @s_dhruvi_", "tanuushree_": "Bff's @kashika_17 @tanishkka_singhvi early to rise, early to bed", "abhipsa_satpathy": "Practise yoga and meditation daily in the morning to keep yourself calm,composed and fit❤ @__anwee__ @geeta_joshi07", "_vanshita_thakur": "Drink lots of water nd eat healthy food😘😘@dikshathakur5236 @_chauhan_sanchu_", "sailee_joshi101": "Dont over trust people with ur body be the one who you want to be not the one who others want you to see..@devangi03 @rubychowdhury304", "akanksha_0014": "@mayurirathi @garima_sharma01 dance is the best form of exercise so dance till you drop. BTW you dance really well 🙋 👌 @sejalkumar1195 I love you fav youtuber💋", "adel_raza": "❤️", "simran.c19": "@punit.garg.7 & @pankhuri.mehta ❤❤ and fitness tip in this busy world is, give Yourself a break, because mental fitness is important too. And physical fitness, @skechersperformanceindia will take care of that. 👼", "alwaysrathi3101": "Just jog for a while..Snapchat it so that people think ur actually reducing weight and just go to a pani Puri thela and Hogg like never before ❤🔥 #itactuallyworks #loveusejal😎 @sejalkumar1195 @amrit15997 @therashikasingh", "lil_chands": "Just dance and dance and dance because that's what you love and that's what will you make you stay fit too! You go girl @wanderer_1492 @mehakmanoj20", "anushkag98": "@suhartobanerjee @tales_of_the_beedle_the_bard climbing till the 4th floor of college everyday for class! XD", "agent_of_ennui": "my dog is naughty enough to take things I own so I am forced to chase her! always gets me on my feet,even if I don't feel like it keeps me fit and less guilty of skipping the gym 😂@redwolfheart @neon_socks", "prachibhanu98": "@manalii.98 @sundaniashni Just have a Good walk to feel free and drinks lots of Water", "iamsuprajakrish": "@aravindhkrishnan @shiv_subramanian // Tip: avoid junk food. That would solve half of the problems 😁", "_mawaali": "Hey @sejalkumar1195 yea. Most people skip there breakfast which is not good. So everyone should have breakfast for sure, because your body needs it. A bowl of fruits nuts and oats. @nibinnya @_s_u_m_i__", "miss_rainfalll": "@riddhikotak18 @gurdev_bhatia . Not quite eligible to give a fitness tip as I am not too fit myself. However the fitness tip to keep your mind and heart fit is to accept yourself the way you are and smile. Smile is good for both mental and physical fitness.", "parulsharma777": "Search beautiful backgrounds for instagram pics ( for this you really need to roam around everywhere) @ds.sahni @himani.tiwari.16752", "gargii_28": "@deepikashimpy @deepti_chauhan98 you are already fit😂", "niki.nk": "Hi Sejal 😍 U already know the best fitness tip ! Work out with THE most comfy pair of shoes from @skechersperformanceindia and eat boring home-cooked food... Can't get better than this ! Tagging my bffs @ramyness @gilla_aashika ;)", "jack__thehuman": "@you_know_am_pro @mardi_alphonse @sejalkumar1195 tip-don't hesitate on anything.", "kiransk_": "@_i_am_nupur_ @bakul_patil tip- Keep yourself hydrated n take stairs instead of elevators 😂", "paisnehal": "@phoenixseeker159 @potternerd25 be clumsy! Drop things, and squat while you pick them up, and if you trip and fall, do a push up :p", "hetalmehtaaa": "@reyshma.rk @varsshaa", "_radhikkaaa": "@_anshikaa @harshi_panjabi_ @nofilterpri Fitness tip- Always stay hydrated. Also, never miss warm ups before workouts", "drishti_megalmani": "@sushfouz @iamprashanthsampath Drink loads of water ! Hydration is the most important thing :)", "gurnoorsahiwal": "Be motivated and stay regular in daily exercise with a balanced diet including all proteins,fats,carbohydrates, fibres etc and regular exercise will only yield result! @chelsea.31_2001 @gursimar2001", "the_alpskrt_11": "So sweet", "shirintrovert": "@__firevsice__ @nikitaaseth Drink orange juice every morning!", "i_m_n.shetty": "@adibakalsekar @shrutzchavan Quirky fitness tip- be a early riser as it leads to reduced stress level and boosts with positivity.", "the_crazzy_mess": "@skechersperformanceindia @sejalkumar1195 Incorporating sour things like curd, lemon juice etc in whatever you eat helps you by avoiding fat accumulation and helps in breaking down your food and easy digestion..khatta hmesha paet nikalne pr hi nahi but paet ander karne k liye b khaya jata h😂😂 tagging @littlesecrets3 @aishvaryasinha", "subbuuu": "ice helps when you’ve been injured, but it also helps you heal from the rigors of daily exercise. Icing broken-down muscles helps them recover more quickly. Try icing while watching TV, and bundle up while doing it. Another Option : Ice bath. @leah_jameson_ @sonajoseph10 @sarin_george_", "kollumenaka": "Cool down workouts are the must to regain ur muscles strength n work out harder the next day.@minnu895 @lalanagali", "afreenkauser22": "1) Keep yourself hydrated while working out 💪🏻 💦 2)Stretch out after every workout & Warm up before every workout 🌈 @_asma_7_ @_armiah", "veevamoitra": "@frostynights_ @iishivaniii Run a km for every 30 ml of alcohol! :P", "purva_o9": "Stay happy stay healthy @grande.girlll @isabelle_jai", "kaushikpallavi34": "Add a dash of salt. Sprinkle some salt into your shoe or sneaker at the end of the day, then shake it out in the morning. The salt will help pull out the sweat—and odor. This is perfect to do after a run or after wearing your shoes without socks. @shristikaushik28 @samaira.dean", "adyxt_": "Shoes plays a vital role in your workout routine the more comfortable and flexible they are the better your workout will get. @gursimrankalsi @ashita1812", "ishika_1104": "@madhulika9931 @muskan___ Tip: Laugh with your best friends and dance to the beats!", "remembermeas_pia": "@u.h.insha @zobiaafshan .....................add at least 3 dates in your daily diet to lead a fit life.", "_zumlachenpa_": "@suzy_sonal @prajwalita_ Tip for you @sejalkumar1195 Laugh loud once in a day.", "itzz_jyosnika": "@lestrange_lovegood make the 🌎 world your gym ♥️", "kavita._.p": "Quirky tip: take public transport to travel across city, you tend to walk more which will make up for the workout/fitness regime you miss 😋 @mandia22 @shraddhakatoch", "rachitagupta5": "Laugh as much as you can 🎈@_.shruti.__ @_.shruti.__", "phoenixseeker159": "@paisnehal @potternerd25 changing multiple local trains to reach your destination in Mumbai", "filmy_chokri_": "@gauripeshkar @vikramh24288 Find a work out buddy! It can be your best friend or your spouse. I have tagged both 😜 This way you would look forward to exercising or playing a sport together. Whenever you lack motivation they will always be there to push you 😊😊😊", "bhakti_30": "@sachi_shah @thecreativecaps love yourself and be happy! You are perfect. :) @sejalkumar1195 @sketchersofficial @skechersperformanceindia", "laxmichundawat": "@radhika90bapat @tasveere_badastoor check this out. @sejalkumar1195 do potty in Indian style always , it will always keep your stomach clear and flat 🤪", "samruddhikanhed": "@anu_shree_05 @appuuu17 have meals &sleep on time ....atleast sleep for 7hrs", "khush2008": "@mimansanangia @poja21.pj - no matter how lazy you feel ,get up & hit the gym", "pratikshas958": "@dr_pragya_singh_ @ritzz_27 quirky fitness tip -play with naughty kids they will make you run and run and run 😂😂", "gandhi_baba": "@sakshi._.29 @manishaankush.ma Start ur day at 5 am , with a small meditation and a have a run on a natural track , best if it is inside a forest kind park, untill u sweat and can listen ur heart breathing fast.", "tanvi.desai_": "@aarya_desaii @shilpa_desaii look at this one😍😍 @sejalkumar1195 such a lovely picture.. i know you are already fit.. but still doing climbers or climbing 500 steps a day can make your lower body flawless!! It really works.. I have tried it👻", "xplosivefart": "Drink pickle and pineapple juices. 🍍🥒 The salt and vinegar in pickle juice can help muscles recover from sodium loss and decrease cramping. @farrr93 @affan.ak", "kirankaneriya": "Empower yourself with exercise @anjalishah53 @_ankit_sharma1", "tanv.mahajan": "@pallvimahajan1998 @_kritikaaaa___ smile everyday", "callmetaasha": "Avoid mirrors, tv, phone, talking to people while working out and tune to your own workout playlist, you will feel refreshed than feeling tired post-workout. @priyanavneet @massakalii", "tanyasachan15": "Hey @sejalkumar1195 😊😊The tip is very basic , unusual and has worked for me in past few years: THE POWER OF RED.This intense and powerful color can cause an energy surge, so  you may benefit from wearing red clothes while exercising or painting training room with it. @vartikagautam @blingspotofficial", "neetuyadav15": "@rosel_gupta129 @i_ajay1 have meals on time and exercise 3-4days a week", "_dhaboo_": "Fitness tip::drink lots of water, keep yourself as hydrated🍶 as possible!!!@nandanianand @purvi_1204", "rathoreshalini": "@pallavisharma616 @nehasiddhartha #fitness tip Meditate,drink lots of water and walk .", "_kaushikpragya_": "@neetu1083 @roshani_kaushik always find good thing of every bad situation", "_muskaaangupta_": "@mehak7224 @ajaygupta4939 TIP: swim 🏊, cycle 🚴, run ⛹️, repeat 🔂", "sakshijain95": "Have a good zumba workout dance on your most groovy fav song and sweat it out ... @richa_jain17", "shreya_nagar07": "@akankshaa_says @artikapathak - Since you love dancing, dance your heart out everyday for sometime because any kind of physical activity in a day make you sweat and sweat make you shine throughout the day ♥️", "prajakta_mah": "@mheshgurv @ldevkar fitnesstip- to be fit meditation and excersize is necessary also be happy from inside is key to fitness", "akshii_p": "@sidddsaw @_dhwannyy Have water with sabja in it. Best cooling agent for this summer. It will indirectly keep you hydrated and that will lead to fresh mind workouts. Cheers mate 🖤👅", "ekta_sengar": "@caravanopedia @rohan_seth Have a cup of Java before hitting the gym - Caffeine helps to burn more fat.", "priyanka.muralidhara": "Honestly,the best tip according to me would be to just do the workouts for yourself! To make yourself feel good. That'll make everything easier! And also, remember to reward yourself for the hardwork. You'll deserve it! ♥️ @surabhi_2703 @_raksha__07 💕", "ahonakay": "70% of your meal should consist of raw veggies/fruits and lots of water. @ram_adu @siddeshsarma", "avanii_jha": "@anuja_jha @sudabhinav Jog everyday!", "iam_parulsingh": "@iam_meghasingh @baisoya_neha have 10 min dance session every day♥ it will make you happy inside out", "moumitagoswami65": "@munmi___ and @sylviakashyap Fitness tip: A new day is a new opportunity to improve yourself. So take it. Make the most of it and you will be fit! I", "swapnika_medikonda": "@irituaggarwal @vasundhra301 drink loads of warm water with honey in the morning", "gurpreet.shien": "@harmanjolly @arshvi_ross fitness tip- Have your meals in small portions and have a glass of water half an hour before your meals and after one n a half hour of your meals. This will stop you from overeating and will reduce your weight as well.", "rajshree.mundra": "@in_spire_red prize mile toh bhej dena ;)", "nikitaliferocks": "@mspiggyrabbit @monicanehra", "gautam.ruchika": "@k.pritika motiiii", "wrainbow_26": "@tiwaritoshi @nautiyalakansha .. drink lukewarm water throughout the day..to help boost your metabolism..stretch yoga and meditate ..eat healthy..and do not forget to smile..😊😊", "smruti_bapat": "@ashwindravidian @sinchana.dattathri drinking pineapple juice after workout reduces post workout inflammation.. Hope I win these shoes💕", "sanchi_13": "@myself_satarupa @iamsayandeepbasu Quirky fitness tip: Everyday work out is important but as we're lazy to do so, we should at least do PRANAYAM & jogging & drinks lots of water! Love Sejal ❤️", "colossusabhiii": "If you keep money and bananas before monkeys, they will choose bananas.Similarly if you keep health and money before people, they will choose money. What people don't know is that health can be a great tool to create wealth forever. @alishadas41", "priyankaangolkar": "@prajakta_mah @akshadaachavan Fitness tip to keep you fit- Spread KINDNESS. It stimulates, in your body, the production of hormones, namely, Serotonin (healing & calming hormone), Endorphins (brains natural pain killer), Osytocin (Strengthens immune system) and Doubles DHEA levels (which slows down ageing).❤", "nupur_roy": "@funny_the_bunny22 , @shradha_r11 regular workout and drinking loads of water helps stay fit😄", "sharmajiki_larki": "Take heavy breakfasts and light dinner to stay fit!! @lalit.mathur @hita_999", "maheen_nisha": "@darlingsilky @anitha_krishnaanil tip: drink lots of water,balanced diet n eat green vegtbls n take a long walk evry day", "a.finearts": "Hey people check out my art page 😊😊❤️❤️❤️❤️", "codes_and_lipstick": "@_mansi.srivastava_ @shreya.0106 Tip: eat jaggery after lunch and dinner. It will keep your digestion system perfect!", "riyaalityyy": ": Keep doing it if it feels good to you, but a recent University of Milan study on the effects of postworkout recovery methods found no significant changes in blood lactate levels (a measure of how fatigued your muscles are) in folks who stretch after exercise. While stretching may not completely reduce muscle soreness or speed muscle tissue repair, limbering up still has certain benefits, Westcott says: Doing it right after a workout, when the body is still warm, is the best way to increase joint flexibility. Try it out guys @fangirl__13 @p_sanskriti03 💕", "meghaaneolia": "So this tip is for having a beautiful lips or healing the cracked lips and this tip works amazingly I myself have used this , u just need to apply one or two drop of mustard oil in your navel @neoliya_g_8 @prachi_2708", "shwetajoshi33": "@skyanjali @neha_patwal drink lots of water ...it keeps u Healthy", "hrithikachandak": "@anichandak @_shivani_03 Healthy is an outfit that looks different on every body. It's never too early not is it too late to work towards being the healthiest you. Walking for and hour helps a lot.", "jinagna_251": "@mahhek_ @dwiti_tweety712", "neha_patwal": "@shwetajoshi33 @skyanjali Fitness Tip: Google it !!! you know ur abilities and stay fit .", "midhamegha": "@akshita.sr tag your 2 best friends! Aww🙈❤", "namithanayakk": "Eat indian super food which is ghee that helps you mobilise the stubborn fat of your body and which is good for health just like exercise is. @kittyuchil @jyothsna.samanth", "laya_kalyanam": "Get your happy on and live every moment of your whether good or bad ❤️ @harikachiruvella @harini_chiruvella", "punya_s": "Always keep your core tight! @arnasees @pradeeps1121", "kritikarajivsingh": "Tie ankel weights, and skip. It not only makes your muscles toned but also helps in growth (if u r under 20) I do this always and it works @_pia_14 @snehakarale2__3__1__0", "rutujadicholkar": "Listening to upbeat happy songs. Everytime I listen to one, my feet start moving and grooving just like you! Listen to happy and more lively songs, it would instantly make you dance a lil' and feel fresh 😎 @purvaharmalkarr @akshata_thakur", "snehakrishnaa": "@harshitanegi_30 @pranshipant Stairs are the best when it comes to quick warm up and it also works phenomenally as an exercise.", "keom_dodug": "Work your full rangeof motion.@sonam_tangma @i_m_florie", "blissful_banjaran": "@nauro_09 @sampadagirhe. Drink cold water in the morning as it helps to burn body fat and also for gives your metabolic activity a good start for the day.", "ambica._": "@sadhwee_ @born_very_confused and the fitness tip is sing and dance while pooping. Obviously sit n dance. You will feel very energetic after coming out of the bathroom. :)", "talk2tiara": "I Yayyyyy thanks a lot for such an amazing giveaway love 😍 already crushing over the most comfortable sneaker brand out there @skechersindia one quickry tip I would love to give is to walk as much as you can.... I know in our day to day buzy hectic life it became difficult for us to keep a track in out fitness routine and its even more difficult to make it a lifestyle that's y the easiest thing you can do to maintain your fitness to to take walk whenever you can try to skip elevators and take stairs, skip that drive to your local market and have a walk instead i know everyone says that but the matter is how much actually people follow it...... 😘 also a quick tip I follow to keep me fit and active is to drink a cup of green tea 🍵 before going to bed at night 🌃 coz this way your metabolism didn't stop at night and keeps on working... Through this you will burn fat while sleeping aswell it's myall time favorite fitness tip or hack you can say @sejalkumar1195 loveeeeeeeeeee to win a pair of stylish sneakers from my favourite brand tagging my frnds @naughtybutsweet @amit5806 @anitapratapsingh @xplodcool follow up and participate 😊 @skechersperformanceindia", "aman.bir": "@priyanka_banyal @swati_sangwan Fitness tip would be related to breathing. We subconsciously inhale and exhale small and quick breadths whereas we should take long breadths", "rucha_deshmukh_": "The most important thing for health is being the happiest version of yourself and always be satisfied with whatever you have:) and drink lots of water !", "krupali_joshi18": "@krips_joshi @mendapara_nupur drink water with lemon and honey every morning", "harshita_mandoth": "Be on your toes more than tyres!! @nikitaricha @superminnu", "jainriya146": "@shreya_2320 @___kittu.__ dance your soul out 🤸🏻‍♀️💃🏻. Its the best exercise u could do and get never bored of.. U dnt need to follow any boring routine. Just turn on the music and do it..", "swati.arcturus1999": "@tahura_khaleesi @akshayas03 drink plenty of water!", "das_dipshikha": "@surabhi_deb @rishichdhry Fitness Tip: Drink loads of water after waking up in the morning and preferable do mild exercises at proper intervals to feel fit and positive for the day!", "varun.jaggi": "@aanviii @palak_gargg Daily Workout in the morning and a healthy diet", "snehanallagonda": "I mean, if you're working out anyway, you might as well eat the cupcake first :) @shivaninavsalkar @josh_oth", "mamtapokale": "Eat local,think global @saulee31 @vaidehee4602", "joieta._.2107": "*Quirky self composed Fitness Tip plus jingle. (Its rhyming)*👉 Stay fit and live LONG,brisk walk while listening to your favourite SONG.🌸 Don't HATE,Just MEDITATE. 🌸Daily walk a MILE, don't forget to tame a million dollar SMILE.🌸 Do regularly at least 3 sets of SQUAT,🌸 be confident and give yourself a nice PAT🌸. Drink some healthy fresh fruit JUICE. Go jogging in the weaeing Skechers SHOES.🌸 @shashvatchandra @diya_mansha", "apoorvadogra67": "@shilparana432 @divya000984 Eat well and exercise well..keep it simple. Being healthy is a lifestyle and it's not just doing it for some occasion.", "_parvathirajan": "@the_samruddhi @vandana18x wear gym clothes around the house, to feel motivated. Do a little stretch here, a squat there. Be active!", "rashi_mehta": "@sakshi____mehta @blisstosee don’t eat anything three hours before the evening workout, it increases your metabolism and you loose more weight", "kanda.bhajji": "@dnyank24 @bhakti_1602 doing what you love and spending quality time with loved ones is the fitness tip!!!", "rishichdhry": "@das_dipshikha tujhe kya hogaya", "gayatrisonkar15": "SKIPPING ! SKIP junk and do SKIPPING JUMPS. @vansharmaaa @ishna.verma", "thekritisharma": "@scorpianabi @sachinu7f My Quirky Fitness Tip is “DO IT WITH TWIST” holding your sneakers at both the ends and twist. Rotating and twisting to the beats helps alot. The comfort caused by the sneakers sole and the stretching worth it.", "_shreya_patil_": "@lakhanivinika @mansi6320 apply aloe Vera gel on ur hair before workout This helps in getting shinny hair 😍", "manisha_utreja": "The best exercise ever", "29.litlebird": "@akshaysachdev29", "thecurlyblogger": "Start your day with warm water with lemon n honey and meditate atleast 10mins. @kalrakashvi @kritika_goyal1310", "vidyavee": "My quirky fitness tip: Mix one teaspoon of Apple Cider Vinegar with A glass of water the first thing in the morning and drink it. 10 minutes post that, do a quick routine of exercise such as squats, crunches etc.. it’s upto you! This will help boost your metabolism and also help you get rid of that stored fat! 🏋🏾‍♀️✨ @_anusharamesh @aravindsu", "deekshachakraborty": "@purple._.petals ,@nibedeeta_ .", "ibhawnamalhotra": "Walk as much as you can😃 @aishu03rahul @paruls1993", "imbareen": "I drink coconut water everyday after workout! It's filled with vitamins and nutrition. It provides hydration. And gives back what's lost during workout. Coconut flesh also helps with filling the stomach and not adding too much of fats or calories!", "aditibalmuchu": "Laugh out loud and be happy........ 😂😂😂 @omega_anamika @nishaashru", "snehalchhapani": "Use whats available in your home to do exercises like gym. Like corners of bed or chair for push ups and climbing up, walls for wall sit ups, books/bottles filled with water for weights 😁😁 @skechersperformanceindia Tagging @ms.sparkling_unitato @poojamisurkar 👻", "bloomlilacs": "@thedrunkenpelican @reetika_raj eat dark chocolate", "ranidiwan": "But i never follow one 😂 still what i do is.. The first thing in the morning after u wake up.. Look in the mirror.. Smile and say.. You are fit, fine and beautiful. And the day will follow. ☺️☺️ @shubhanginialankar @priyakates", "priyarathore23": "The best fitness tip ever: Ditch all the fitness pitch, rather just go do it ⛹🏻‍♀️🏊🏻‍♀️🏋🏻‍♀️ @vikramadityasrathore @sameeksha.saxena", "nasa_sakshi002": "@shroo_boo @ridhima.grover.140", "vegetarians_paradise": "@richa_36912 @singlalokesh - always bend down to tie your shoe laces rather than lifting your legs up!", "yashitarai": "@myfictitiousreality @jyoti21rai sprinkle a bit salt on your shoes at the end of the day and shake it off before you go running! 🙋😋✨", "__tanishaaaaa___": "@shadowed_eclipse_ @____.astha", "revathyy": "@kusumyadav90 @mariyakjose20 Tip: Always be on the move. Kill the lazypants in you.", "pooja_singnath": "Making moves while making you move😄", "nidhacid": "@dhai_hoshiyar_baniya @napaulami Dance around on the street, rooftops, wherever and whenever you feel like- not only your body would feel good, your head will float in a happy cloud and people around would be cheered up too. ✨", "vedi_vakdi": "@sa_baa_h @shriya.atmakuri Drink lemon water (salty, not sweet) before and after working out.", "janvi.prasad": "@simran__1905 @riya._18 Eating fast food after a workout may be just as beneficial as dietary supplements, a study has claimed. Researchers found that during recovery periods between periods of exercise, it didn’t matter what food was eaten.  #notkidding #googleitup", "sahibachhabra19": "@jacinthraj @ohno_mar always try to move around, move your legs - even while sitting. Our bodies are meant to be active.", "sahaanoushka": "@not_really_yours @nabanitamallick Never exercise with your BFF, because you end up chatting more than exercising 🙈", "i_m_a_s_m_i_t_a": "@aishvaryasinha @akriti_khanna97 Tip:Take half tomato and scrub it directly on face it helps to remove tan and pigmentations and also does the work of bleach by turning facial hairs brown but u have to use it regularly to make facial hair of ur skin colour..!!! DONE @sejalkumar1195", "__prabhutiiiii": "@preet_ya @she_slays_06 The best tip to be fit to to make urself feel happy and comfortable like the skechers shoes ❤️❤️", "sanjanast": "Keep cool and stay hydrated🍉 @shrutz_98 @shamantha_syamanur", "asmitaanandofficial": "@_ridhimasingh_ @nitika7836 Tip: Drink a glass of hot water when you wake up and a glass of cold water when you’re about to sleep. This will help you stay fit.", "payall.n": "@latikaparsekar @snnehh ❤ Tip: Try having favoured water when you get up in morning, for example lemons! Stay happy and positive 😊", "bishtarpita": "@i_deva_sish @kevikanegi do stretching before starting any exercise regime", "iipranshu_ii": "@prishitatiwary @zmmsayeed hii . I’ll give you a gym tip even tho you might not need one xD ‘ even when you don’t feel like it , just get up, dress up and show uppp( to the gym ofc :P )’ Trust meee feels so much better.", "sashrikasharma": "@vidurkukreti @seeeratb eat consciously .", "shagunngoel": "@bhaminirathore @aryandwivedy Tip: Always start your meals with a green veggie as they prepare your body to get ready, detox and digest the food you are going to have.", "sonal_waghule": "@pallavisud_818 @a_k_s_h_u_30", "devanshiibhatt": "Small changes+Time = Big results 😎😎 I would like to nominate @bhattshruti20 and @tripathi.kashmira for always being my quirky friends ❤ @sejalkumar1195 love you.", "theweirdanaa": "@ll_fatema_ll @mariajm_2k1 eat awesome eat what your heart says...stay fit for life!", "shaikhsadafs": "@danny_is_up @lifeas.ahijabi Just hide the Nutella that you bought so that you forget about it and don’t crave it. 😄", "vishwa.shah124": "@meghathesia @nishee_tilva", "n1dtec": "@akaur11 @anmolnagi .... @sejalkumar1195 Exercise in the morning before your brain figures out what you're doing 😁", "padmangmo": "@keom_dodug @chhetan_zangmo Never skip your important meals and be ready for your workout atleast 4 times a week.", "pragatibandi": "@manasvijain24 @sheetalhablani when you go to the gym or for a walk, concentrate on your workout and not on other things(people) 😉😉😂", "suhaninp55": "@anusha_bhat_ @amrita.nair37", "dyuksha_sharma_27": "Have your meals on time. @aasthatanwar @manasvinautiyal", "deactivedsince2018": "Greentea, can help you to loose weight gradually and in a very short period of time!❤ @_shrushti._ @tahny89", "ishita_aroraa": "@_.b_.a_.n_.i @arupinder . Laugh each day because laughter is afterall the best medicine 😉", "manasi_more29": "As I always say eat your fruits and drink your vegetables! @bunny_0609 @jagrutirajendraterde and stick to Ghar ka khana, as our Indian cuisine is rich in micronutrients and I'm sure @sejalkumar1195 would recommend the same😊", "chatorijeeb": "Try fire feet whenever ur not in a mood to workout just stand at a place n start it's good for the body n start throwing punches in air good for arms! Fire feet is standing in one place with a little bent back n start moving ur feet as if ur about to run or u could wear those sketchers n start moving ur body whichever way or direction.. this way u r doing some sort of exercise create ur own zumba 😉 @ajaybhandari1389 @heymitika", "amshweta_06": "Stand as tall as possible throughout the day by pretending that you're getting ice water poured down your back. This position will help not only by strengthening your core muscles, but also by boosting your caloric expenditure, forcing your body to maintain this position @tanwar_dipesh @salonithakur83", "jeenal_05": "F-Food that’s healthy🍎🥦🥑🥕 I-Intense workouts🏃🏻‍♀️or atleast regular exercise T-Take time for yourself & most important The body achieves what the mind believes💫 Be You❤️ @ratnageerikar @savage_tb350", "matani_khushi": "@akshaya203 @aishwarya.sivaramakrishnan SLEEP is very important for a good health and good FOOD", "smriti_chaurasia": "@abhi_bansal29 @baghel.bharti1998 Tip: Warm water in the morning ,will never give you warning!!😀😁", "heenadhabhai": "Drink lots of water...🥤 @richadhabhai @himanshuv09", "greeshmax_": "@kinda_pretty_pineapple @abhishwetarahi Just always be smiling!♥️lysm.", "shivi_jais_": "@paridhi.seth @_verma_priyanka_ give yourself a warmful laugh daily and it will keep uh mentally free from stress and believe me this is the best way to keep your body free from many diseases", "__meghnasingh": "@makwanabhakti @kritika.agrawal.7 Comfortable shoes are the key to proper exercise. It helps maintain the perfect position.", "nehadaga16": "@shruti.talekar @isha_jaybhay_74 ...Tip: With summer here, I recommend digging deep into your closet and doing a little cleaning with your workout or running shoes. This may mean parting ways with your favorite kicks. However, this will help you avoid injury. A simple and effective way to know if your workout or running sneakers have performed their last rep is to perform a \"twist test.\" Hold the sneaker at each end and twist. If the shoe easily rotates, the midsole is worn and is indicating that you need a replacement.", "vpraveena781": "@chithra_k_nair @cilpa.austin and the tip is , while having water, try to have flavoured water, with lemon flavour or cucumber etc.. And also, try to eat at least 3 hrs before you sleep", "bhat.supriya": "@sharmaichchha @anu_2212 health tip :do not overthink... b the happiness u want to see.. best way to stay happy thus fit😊😊", "thelibrallife": "@amitv_10 @midhamegha start your day with apple cider/lemon honey water, end it with a cup of green tea, and stay active while walking a lot/running during the day! You're good to go :D", "zainabafaq04": "Remember small changes add up quickly. Go for #bbg. #lifesaver #kaylaitsines @debasmita1708 @lubna_atif", "veeepppee": "@neeraja_s @anonymouss1711 drinking green tea thrice a day will make u lose weight in a short period of time :) @sejalkumar1195", "diksha1108": "Get your best friend to date a fitness coach @nehatahiliani19 @subtle.strength", "the_unnomadic_notions": "@noreen_farooq09 warm water throughout the day will help you get a flat stomach.. But the the catch is you have to drink it🤣", "ruchir.11": "@sakshi.mohindra.1 @pallavi.sharmaa Never go more than 2 days in a row without excercise 😁", "ishitavasoya": "Get a cold water shower no matter whatever weather it is so you don't get cosy for the workout @_samridhi.__ @ishsassy_", "sapanafullel": "@mamtaupadhyaya @akansha_001 positivity is the best fitness tip. Be positive about whatever you are going to do and to achieve that positivity meditate everyday.❤❤ sejal😘😘", "iyamwatiyam": "@ptap.r @nik_itha you are what you eat..drink your vegetable..eat your fruit🤗", "hooligan_mojojojo": "@ishita_dua12 @husrav_sadri I do lunges ( 3 steps at a time) five floors up with Samarth when we have DADH in the morning 🙋", "nikitakabra.psd": "@sumbul_ak @rishiharsh Take the staircase. Walk and Talk !", "k_ranawat_20": "@aashnakapooor @kareenajain33 @sejalkumar1195 Hot water with lemon after you wake up and then meal on time.......", "niveditabanjara": "@dollys1605 @banjara_namrata1210 n @sejalkumar1195 drink loads of water it is best 😀", "puri_graphy": "@bhatnagar_aakanksha @aakankshatyagi .....1 health tip :- maano to u r beautiful....Na mano to 😂 ........?............................To b beautiful......One and only fitness tip ever 😘 for all😉", "shwetakumari.30": "@amita.kumari.79230 @abhishek_268 @ranjay_kumar65 wake up early then drink a glass of water and go for jogging for atleast 30 mins.. Come back, take shower and have a healthy breakfast..but of all the fitness tips, I think the most important one is to follow a routine. Whatever you do, just don't skip it.", "rajsmita.bee": "@shivs129 @rajrupa_das Fitness tip: ditch the vehicle and use your legs! As much as you can. 😌", "jaspreetsinsta": "@saikiranbhatted @kashishverma24576 drink one glass of water every morning as soon as you wake up.", "shuttermakhi007": "Our goal must be getting fit beyond that scale! Isn’t it? 💪 @vandanananda @aara_sharma", "poem_beautybox": "Drink lots of water. @reinaic @shilpameher", "karina_dang": "Here's a quirky one....drink chocolate milk after working out...proteins in milk and carbohydrates in chocolate helps replenish tired muscles during workout.😊.....@harsha_phull @harshaahuja77", "amrutap10": "@shreya.ganesh @ayushipulukool18 Run everyday!", "khannameera_": "@nitya_narang @laiba_hayat__khan don't eat while watching tv!", "poojanegi__": "@pragya_tyagi_ @shashiibharti retune the radio to reduce to lose weight 😂😌", "divya.bhatia_": "Yoga is the best form of exercise to gradually lose weight @hunztee @itskokobro", "ritika.surelia": "Hello! Hope you’re doing well! Love your video contents! xx @bijal6955 @_jfernandes._ Tip- Well everyone’s already told you all the tips but I would like to tell you that fitness isn’t a destination but a way of life. :p #hustletogainmoremuscle", "anisha_a6": "@panigrahianisha @samikshyakothia Fitness tip- Meditate atleast 10mins daily. This helps in healthy and peaceful body, soul. @sejalkumar1195 @skechersperformanceindia", "rohilladinesh": "@uditbhatt29 @akanshathisside dont wear sports shoes wear flat soles or run barefoot this sponsorship will fuck your legs", "sanghavidrashti": "Flax seeds after workout and Clarified butter (Ghee) 2 times a day! Believe me @sejalkumar1195 it works! @srushtisanghavi_ @iamharshbhatt", "13vaibhavi": "@shaina._.khan @yashika1517 reward yourself with Maggi 😂drink a glass of warm water in morning 😂", "imohvi": "Green tea first thing in the morning. @twinkle_5331 @__solasta__", "himanshi_96": "@kopaljainn @deekshapal19 Run 3 miles and drink 3 litres of H20 everyday for that shine when you smile! (Formula- 3🏃*3H2O= 👸💪)", "bidang_25": "Wear @skechersperformanceindia and feel comfy whenever you stepout. The body movement will make ur blood circulated and you can stay fit without any exercises @laimwn_ @maitrydeka22", "priyak15": "@anushreek2710 @divya.khandelwal . Always been a fan of Skechers! Fitnes Tip: Take some time off-gadgets every day. 😊", "shreyasri01": "@minalraghu @tejas_sharma2211 it's better to hit the jogging track wearinf YOU by @skechersperformanceindia rather to be on ur sofa being lazy", "snehal_tayde": "Eat healthy stay healthy because food plays a vital role in our lives...n yeah also yoga and some workout or a morning walk would be the best way to stay fit...@sejalkumar1195 @wasim_786ahmad @sweeet_alien", "lavanyalavz": "@poojanelavigi ,@sinchuseema ,eat cucumber it helps to keep fit", "agrawal_arushi": "Get some sun before you start your day, it helps to keep your mind fit. @darshbhatela @mustansir.santrampurwala", "goyalprakriti": "Tagging along @shreyashambhavi @111swatishukla .. Fitness tip would be doing Surya Namaskar daily.. 😊", "shahana_ali10": "@sensuous.brown.girl @vedikaaroraaug26 and fitness tip is dancing. Best best tip for fitness with entertainment 😁", "jayanarula": "Eat healthy and move your body in the best possible way you can. @bhawana.narula @prabhat_narang", "arora35meenal": "Put on those running/ sports shoes for the entire daily chores like working in the kitchen, climbing stairs etc. Twist around the house in ur comfortable pair of shoes. @sonal26arora @reena7474", "stefnadsouza": "@_isaidno @shwtaism_20 1 squat after one bite or for each bite.🤣 I am lazy af and this helps I swear.", "aparna012": "@anushkasharma_22 @nisha__ch21 Tighten up your drinking::Place a rubber band on your water bottle, and lower it a few inches after each sip to mark the place you want to drink past each time when you're taking more sips. (Remember, you should be drinking half of your body weight in ounces of water each day.)@sejalkumar1195 @skechersperformanceindia", "smriti__shah_118": "@mehakdagar and @mansi1196 .... today is a new beginning....so go get your pair of Skechers and start sweating it out.", "yukta_sree": "@nanubala_bharathi my quirky fitness tip is Reward Yourself with Chocolate Milk.", "jinanshi_shah": "@jhanvibhatia @hetika_02 Healthy is an outfit that looks different on everybody! And with those SHOES😍👟 itll look fantastic on everybody!!! So, remember if u feel hungry you could just be thirsty!!! Drink a pitcher of margaritas and see how u feel!! Kudos to healthylife❤❤", "lubna_ahmad20": "@sejalkumar1195 The quirkiest thing to be healthy is to dance and Ride your old school bicycle. Remember your Bachpan while still being the Hot you ✨ @sarahkhan2828 @tohfa_siddiqui_", "the_arktouros": "@pankaj209 @musafir_tales very simple yet important tip for all is to drink lots of water and go to pee (squats😂) first step and then start focusing on next fitness regime like fighting chitchat 👋👊 teasing beating asking too many questions to your best friends ....disturb them in middle of their work and so on would burn their calories and yours too 😄😜 @skechersperformanceindia", "mahimaa065": "Eat healthy and drink loads of water. @kez_sharon @_._miss.non_stereotype_._ ❤", "sonali.08": "nyc", "devyanimahra": "@radhikasah28 @riddhi_dhondiyal_ @kanchan_bisht_ 1. The latters need to hit the gym asap. 2. Please eat healthy. 3. Sleep on time (I urge you on this) 4. Wake up on time. And I guess I can write a book on it😅😅❤️❤️❤️❤️❤️", "__ccjc__": "@__m.e.g.h.a___ and @roopald_7..... Hey Sejal, one fitness top that I would like to share with you is that you should eat the right foods and portion each meal(although I know how much you love ghar ka khana😂❤️)", "muskaan_vinod": "I actually have only one friend @muskaanb.xx @asthii.xx. and the quirly fitness tip would be just doing whatever exercise you like, I personally love doing aerobics and dancing, so you could do anything and just eat normal GHAR KA KHANA. @sejalkumar1195", "himanshichhabra28": "@aasthachhabraa @aasthayadav24 Find a non lazy gym buddy!🙈🤣", "saniafarrukh_": "@sakshi_0695 @sinharhea Get up early around 6 am and jog for 30 mins at least four times a week.", "palkingirotra_": "@vivaciousveni @tanmaygirotra18 uhmm.. Walk and stand as much as you can. And the simplest one which you too suggested to us. \"Water\" have loads of it! :)", "ashika_rai2010": "@sakashh13 @sayleepatil75 taking small walks whenever possible is good to be fit if working out daily is not possible", "suhaani.__": "@_muskanmalik @mariyayyy__ fitness is all about health. So being positive in your life and the biggest thing is to be happy with yourself and with your life. I guess these are the first things to do and then to drink a lot of water and eating healthy food.", "miss_messyhead": "Push your buttocks back while climbing the stairs, that'll give same results as squats if done consistently 😎 @sejalkumar1195 @skechersperformanceindia I further invite my friends: @thehumancheeku @food_o_style", "bhavzzzi": "I want one of you to have these @meharsindhu @ananyakumar26 pls reply with fitness tip", "aayushi_zaveri": "@sanjana.patil_ @vishhnuu07 a lot of water !! Eat at regular intervals and ( go have a cheat day in a week ) :p love yaaaa💕💕💕", "saumyakapila": "@sumedhatak @neha_bhandari05 get back to your roots to be fit n healthy", "agrima.grover": "@haneet28 @manveen_kathuria Quirky fitness tip: Make more videos!👅 Let that hustle never leave you and you'll be able to maintain your level of fitness (both physical and mental)forever❤️", "ojasvinisingh": "@_evil_mind @rashwi23 Yell Out Mantras While Working Out", "ivurhd_xx": "@krutik @kruti just stay happy", "madhuraayare": "@tanaya_garge @dishthakkar stop being lazy and get your ass up the sofa", "aishwaryaaaaaaa_": "For a simple and effective way to end chaffing between your legs, rub a stick of deodorant over your inner thighs. This will decrease sweat buildup and help you avoid the pain 💪🏼 @i_carry_my_own_world @deysagarika", "s.anskriti": "Lock your room, and dance like crazy to your favourite song(s) for however long your heart desires. Now you know 😉 @s.n.i.g.d.h.a @khushisekhani", "uditbhatt29": "@akanshathisside @rohilladinesh have wild sex"}