{"anihive_13": "What are Ur Nick names in real life??", "punjabun_": "Prettyyyyyy", "twishaabhagat": "Love this series! ❤️ It would be great if you guys can check out my blog 😊", "elegant.chicc": "Stylish girls 💕😘", "i_gauravsaini": "@barkhasingh0308 is love 😍 hot and beautiful @sejalkumar1195 is cute 😜pretty and beautiful", "devi.bittu": "Hlo😃😃😃😃😃😃😃😃😃😃😃😃😃😃", "piramsnkr": "👏👏👏", "shiv750kumar": "Mksn", "shinugarg77": "Enjoy engineering girls a lot luv these episodes 😍😍", "shiva.rawal": "Panga gang", "multifandomgirlxo": "3 jhalliyan rocks😍", "archiii3011": "Who is the real rancho of the group 😂", "_s.o.n.a.l.i_d.a.s_": "How much fun do u feel with each other??means how you tease ur co-actors n the other people related to the super super super amazing n trending web series \"The engineering girls\"😍😍😍💖", "poojapatel5622": "How you know each other", "thatnoodlehairedgirl": "If u were to personify urselves as a cartoon character, what would it be??", "dusky_sparkle": "You’re the cutest 💞", "yd_mithravindha": "What's the craziest thing you've ever did in your real college hostel???", "salonidhaila": "What's your funniest college story???.........P.S- Luv u all😍😍😍", "prapti_bisht": "Hey Sejal;Barkha and Kriti..lots of ❤️...I want to ask that are your character are similar in real life as in your web series?", "iam_iron_man_ooo1": "When did you know about each other😀😀😀😀@sejalkumar1195", "nina_jain": "❤", "sakshiiioberoi": "Hey sejal .... can u guys please tell any one bad quality or habit of each other on set ......pls answer humble request ❤️❤️❤️❤️", "therakeshdayaseelan": "Since its the pride month, do you girls support the LGBTQ+ community and what do y’all have to say to them and to the society? @sejalkumar1195 @barkhasingh0308 please answer this very important question hehe❤️", "abeehahayat": "I love u the most sabuuu all of u have done great acting love uuu p.s share some bloopers @sejalkumar1195", "kapilarbhowmik": "I loved this series", "tanyakoranga": "Whom do you like most? Kritika or barkha and why?😂😉@sejalkumar1195 @kritikaavasthi @barkhasingh0308", "hiyatwinklin": "What according to u all 3 the 5 things that should be changed in a society", "tanya_malhotra69": "@seh alkumar1195 great work done !", "haleem.baloch.585": "So nice nice nice", "aakriti_33": "Any behind the scenes pranks!? Tell about it! #asksejal", "mannn_at": "Favourite Book?", "anafernandes.09": "Embarrassing moments on shoot xD", "ashley_courteny_07": "Tell about ur whole experience with timeliners...and also share experience about sabu& mangu..", "jhanvi.03": "What has been your favourite moment on set?", "marriiaali": "who are u more closer to ofscreen?@sejalkumar1195 p.s I hope.u chose my question ly😘😘", "bhakti_0609": "Like before working together as a team what were ur views abt each other??", "evaansha_goel17": "https://milaap.org/fundraisers/Evansha?utm_source=whatsapp&utm_medium=fundraisers-title&mlp_referrer_id=861985", "riyaaa_0275": "Which was your favorite episodes 1 or 2", "krishna_cr4zy": "Suno meri ek wish poori ho skti h kya???", "shagun_routray": "Has anyone of you, thought of switching roles among yourselves? @sejalkumar1195 whose character do you think is the best?", "a_vismaya": "Y maggu is being so senti type", "unnatijhaveri94": "Hi Sejal! I bought a Ukelele seeing you play it so well but it’s way more complicated than I thought it would be 😛 would you want to put up a ukelele tutorial anytime soon? Maybe the basics or a song?", "cuteprincess2009": "I love u Maggu Who is your best friend?", "mystylepalak": "Who you to reach late to the shoots", "anjali.george": "First impression of each other..", "sravya_godavarti": "If you have ever been ragged share your story please!!!", "nowrinsultana7": "love you guys", "_sarahcruz.24": "I don't hve any questions to ask... But I have to say tht this is my Fav web series ❤", "_that_bong_girl_": "👌", "i_am_gurpreetsodhi": "Who is your favourite sabu and maggu", "shikha_92__": "Have u also been through these hostel issues in ur personal life?... we would be glad to know Ur personal experience 💕", "__thatss": "Whom you love the most sabu or maggu✌😜😜😂😂", "the_indian_web_series": "@sejalkumar1195 Who is Professor Virus? 😜#ViruShahastraBuddhi ❤", "riya_talwar287": "Hello frndzz chai pee lo#papewali😂😂😂😂😂😂😂", "reel_ananya": "Acting modelling or youtuber? To everyone", "_.blissollie._": "Your experience while shooting together!!! Really excited....@sejalkumar1195", "_mstpfc_": "What's hygge for you 3 ?", "1234.leo": "If you won't have been YouTubers than what probably you would have been", "siddhi_2798": "What was the first impresion of sabu and maggu about you..😍 #bestseries #q&a", "slayying.bitchhhx1505": "Draw your life", "jayantivaidehi": "What about your college days...? Did you all have ever created a mess and luckily not got caught?", "_.hemamshu22._": "How did Three of u start your YouTube career? I love Three of u ur acting is just awesome...... Especially Maggu Didi is my inspiration...😍😘", "himani1080": "How do u find each other's fashion sense and each other's behaviour?", "hasi._.24": "Your first kiss??", "lifeat_itsbest73": "Are there any pet names you guys have given to each other?", "nikitasup29": "Who takes more time to get ready and also share a special moment with each other on set", "thebigfuzzygirl": "Is komal your best friend?😍", "ushnisaaa": "Is anyone from engineering background among the three of yo", "anwesa_charit": "how is your experience working on your first web series? @sejalkumar1195 @barkhasingh0308", "hossainniju008": "Tell us any funny incident which happened during the shoot", "its.shanyaaa": "Kritika how was ur experience playing role of Avan ?", "vam._.yay": "One like and dislike about each 3 of you ?❤️ loving the series though😘", "rishika_kadam": "Does Maggu really knows to make ladoos?", "ditsaaax": "Tell us about yr shoot", "priyam9034": "I am your biggest fan agar aapko time mile to pls mere qurstion ka ans . apne video me daliyega with my name priyam garg my question is aapne apne videos banana kab se start kiya aur kiske videos dekh kar aapko idea aaya ki aap youtuber bane matlab who is your inspiration pls reply me", "tanisshka_sharma": "are you guys getting along nicely?", "ritusinhaofficial": "This is absolutely fun...I am so excited for this one @sejalkumar1195 😎😎😘", "sakshiparikh17": "How many total episodes are going to be released", "itshaikh_9": "😊", "anjana_dev_vishnu": "Who chooses ur outfits? Is that ur choice?", "__.suchiii.__": "Tell us about your auditions for this show! Btw, great fun to watch you girls together ❤️", "kiara_riy": "I loved this series", "n.i.k.k.i.i.i": "Bts moments?", "ravi_messi777": "@sejalkumar1195 yeah I saw your Show it was awesome act by you and Maggu & sabu😊😊😊👍👍👍🍫🍫🍫", "piece_of_pink": "What were the experiences of the first day of college..??😀", "upasana3103": "@barkhasingh0308 and @kritikaavasthi were you both viewers of Sejal's YouTube channel before you all met her? Waiting for the answer😄", "aananya_13": "Is Maggu really innocent in real life?", "aahna_108": "Would you please share the bloopers of engineering girls.BTW love you all soo much 😚😍😍", "kandy_k7": "How did you start with your fashion blogging?", "l_inu": "Were ull friends before the series...? .. ...... PS : thumbs up to ull 👍", "_____sathvika_____": "Can you tell us ur best and worst college experiences and all the fun you had....btw loads of love ❤ keep rocking ❤", "rishikaatiwariii": "So my question is.. Can you give me a shoutout please? I have just started my insta page and soo need it.", "jigyasapahwa": "Is it something from the Series that you can relate from your lives ?", "srinidhi2902": "Who is rancho, raju and farhan among the three of you? 💙💙💙💙💙💙💙😂😂😂😂😂😂😂😂😂", "the_twin_girl": "How much can you relate to your character in the series? Share some fun experiences of your college life.", "bhavna_mungolah": "Did you all knew each other before engineering girls? @sejalkumar1195", "s0ham_saha": "Who's the rancho among the three, the real rancho😂 @sejalkumar1195 u r so beautiful ❤", "_hummingdreamer_": "How did you all came to this topic of engineering girls..????? N btw I love you all", "call_me_kaashif": "comnt baco", "positivlens": "If you were to switch characters which one would you choose for yourselves @sejalkumar1195", "dr_bansal.reetika": "Who is the real life maggu..? Sejal , barkha or Kritika ?", "sc045167": "#Shanayasharma222", "akansha___verma": "These characters were chosen by you all ? If not then which character your would have been chosen?👀", "zainab.faiyaz": "When you guys met for the first time, what were your thoughts about each other? And since then have you had fights or disagreements? The best and worst thing about each other??", "insiya_rajkot": "The toughest time the 3 of you had till date .... What was it ?.... And how did u deal with it? 😊😊😅 #indianyoutuber @sejalkumar1195", "justin__photography__": "👌🏻👌🏻👌🏻👌🏻", "yazan.niaji": "Hello girls!!", "imshreyajain_": "The best memory you three will cherish your entire life from the shoots", "reeba__821": "Are you guys best friend in real life", "ashish_k1999": "Are you guys gonna make some other series. If not please. Coz you guys are the most iconic trio. 😍♥️", "motikumar_9": "Hy team engineering girls....love ur work can u say us the craziest thing u have everydone on the shoot..or recerete the funniset scene of tht episode", "justinanose": "Y dont they hav eng subtitle in that series ?", "_lxbna_": "Where did u guys meet?", "oyegurmeet": "@sejalkumar1195 #q&a Helllow sejal ! 😁. Love your work and content that you make ❤️ keep doing it u r so awesome. I get positive vibes by watching your videos😍💯😊. Thank you & love you 😇", "rhea30._": "So what are all of your greatest fears in life and have u encountered a ghost anytime ??? And also Ur fav Netflix show? And fav bollywood movie and song", "off2377": "What was ur first impression about each other ?", "ll_rushhhh_ll": "How you all were signed for this web series", "emon.gogoi": "Can you guys relate to the characters in real life?", "stutigogia": "wow", "shardabhamre": "Okokok why to set an example of rancho n raju... be You girls.. just set am example sabu mangu m seju.. i am correct. Dude you totally rocking it....! Lots of love to u sejal. #FlyHigh.❤😘", "foolpakhru": "Who's most likely to not get a joke ??? PS:lots of love to all three of you💜💜💜", "vanxshika": "You guyssss! ❤❤", "kaush.12": "Is maguu this submissive in reality also? Please share some mischievious habits or pranks in which she showed that she is naughty🙈", "_meghaa_kabra921_": "Your most funny dream @sejalkumar1195", "snowflake._.__": "One thing you guys like and dislike about each other... btw I love you all❤", "anusha04__": "Can u guys touch ur nose tip with ur tongue", "_.miss_aj._": "@sejalkumar1195 my question for u is..why do u thought to make a web series with @thetimeliners?And which is your fav character in the series...btw loved your acting skills..😍❤❤", "rahulroyinst": "Is sabu supposed to wear only one shirt through out the series... O. O JUST WONDERING @sejalkumar", "thecurlychaos_": "If not YouTube, what else shall you guys be doing?", "ekta4sure": "Hey ! I am a writer ... I write and speak up to break the patriarchy. It would mean alot to me if you could give me a shout out through this page🙂❤I wanna reach out to a large audience and Spread the message.", "khushisdaswani": "Describe ur routine in short", "fateemaa_15": "Would u rather wear someone underwear or use someone's toothbrush", "styleinsense": "Are/were you the same as your roles in real life as well ?", "pratzzzzzzzzzzz": "How did you all meet for the first time? As in in the shoot itself or separately?", "_.rebs.__": "Who is more fun - sabu or Maggu??", "saloni.nair21": "Can u relate this series to your college life? Ily you Sejal!!💗", "sia017": "Yooo🙌", "aroob_.fatima": "Whats common in ur friendship on and ofscreen??", "sensudipta1820": "Ghaar ke laddu is the best 😍😍😍😍@sejalkumar1195", "sanjana_1196_": "Were your friends like sabu and maggu when tou where in your college ?if no,how were they?#q&a#sejalkumar", "uhaa_2000": "Which is the country you would you like to visit", "gursharan5203": "To all of you What make you a youtuber", "_lucified__": "What was each one of yours favourite memory while shooting for “The Engineering Girls?” Also, how was your over all experience?", "nirmitee_achrekar": "What will u di in future (apart from making youtube videos)??", "teju_angadi": "Did you guys know eachother from before.? If not, what was your first impression on eachother.!", "manya_mehra18": "How it feels to do something new like how was your experience with these two", "diksha_sankhla": "Who's character is more likely to be there real life one? Btw iam also an engg girl and i can relate to it like anything😝😘😂 #iamlovingtheshow❤❤❤❤", "blissxfulll": "Everyone has a wierd college experience so tell us about your one experience in college that you regret of", "shreshtha_roxx": "Was it awkward when you guys first met ???", "__anjaliiiii__": "The most weird fashion trend ... That's crazy but you all really wanna try #IT_ SHOULD _BE _CRAZY @sejalkumar1195", "thenarcissisticgrl": "What's ur Educational background? (the question is for 3 of them)", "_teresa_daimari_": "What was the reaction when u pple came to knw that u 3 gonna work together??? Please reply😆😆", "hiba_sabir14": "Sabu do you relate to the character in your real life?? 😍😍", "yukta6789": "Hi sejal.... I am a great fan of yours and I love the way you work... My mom is a great of yours... And she always tell me to be like you.... So you have become my inspiration.. I love you 😘❤❤😘😘....I love you and here is the question... How was your experience of working with such two creators.... Please share your experience and please answer it too... I love you..😘❤❤❤❤❤", "ektas8627": "Nyc", "janhaviparab204": "You guys rock Yaar really !! Luv u guys", "not_so_ordinary_boral": "I'm loving the series. It's very relatable...! ❤😊", "paridhhhi": "Are you guys as friendly with each other as in ENGINEERING GIRLS?", "anniyobo": "Who's the most annoying, high maintenance, nerd in real life?? 💕💕", "shayartksingh": "Where Will You Do Your Marriage ?", "bakairo": "Are they like that in real life", "moonlight._.dwell": "What was the 1st thing u did in ur teenage life ? Did u ever bunk a class?", "electrical_soul16": "Q to kritika mam and barkha mam- other than sejal mam whom you think the role of Kiara can do ???(answers can be varied)", "k.riti123": "Hey! You all look so cute and beautiful..😘😘", "bharath_s_7": "The embarrassing moment?", "nidhi_nayak_": "The thing you envy about each other?", "bhavitaatisha": "Did you three know each other before Engineering Girls started??", "comely_philodox_": "Do you have the same kind of nature in real life like in this series?", "sowmya_t_a": "How does it feel when you get recognised on the malls and streets ??", "rohit19892018": "All three of u rock esp Barkha and Sejal", "siddhanttjoshi": "How is your friendship in real?", "kanishkatuteja_20": "Please you three make a golgappa challenge video..💞😍😂", "meghna.murmu": "On a scale of 1-5, how much would Kritika and Barkha rate Sejal's acting skills ?", "hanna.f_h": "Yes kanishkatuteja_20", "its_vidhid": "Have anyone one of you met each other before. Tell your secrets", "divya8565": "Share the most hilarous thing happened on the sets of shooting engineering gurls", "vidisha707": "To sabu - what would you wear to a classy party ..choose from sejal clothes(question inspired from your own video)😁 maggu..loved your acting in the series 😍 and how did you be in your college life to sejal (my inspiration)❤ what kinda fun suggestions would you give regarding college life😁 and when are you gonna visit vishakapatnam😭", "sanidhya_ahuja": "Would you ever consider working with each other again after engineering girls", "preirnah": "Who is the most maughty pr annoying person in your group?", "vidya_kakaraparthy": "What was your first impression of each other??", "saumyakapila": "Which character they would have liked to play except their own.", "aastha.jindal11": "Whats your height (all 3 of u) pls reply", "disha_naik_2064": "Do u guys knew each other before engineering girls @sejalkumar1195", "harshitha_reddy09": "Out of three of them who has great sense of humour", "meghagupta0008": "One moment when three of you see each other and start laughing without any reason ?", "xcavalryman": "Kiara n Sabu😍", "__k.a.v.y.a.a.a.a.a__": "Do u think you will miss each other, and why the most... Also whom will each of u miss ??? Ty", "shreyacc_20": "Did you know you always wanted to act, and were waiting for the right opportunity? because honestly, engineering girls is the best web series i've seen in a long long time ❤️", "30ritika": "How do u met each other?? Some best moment while shoot 😍", "_sarcaastikk_": "Yeh Melody itni Chocolatey kyu hai?", "_ananya_5": "Are you all friends from before???", "13_mahek": "How is ur friendship with them", "hiyaa_shah": "Do you guys relate with your real and reel characters @sejalkumar1195", "priya_1412_": "Maggu, you look cute with spectacles and gorgeous without em", "_sushieee": "What was your first impression on each other?", "roypriyanka13": "Loved both saggu and maggu ❤❤", "itzmehira_": "How come all of your chemistry so amazing", "diamondinsky__": "Who is the most beauty conscious??", "madhumitha_i321": "How did yull meet ? @sejalkumar1195", "rajneeta_bhuyan": "Maggu please imitate the episode 1 dialogue of yours \"behen nahin hu teri\", where you try to convince saabu 😂", "basnet_sanskriti": "who is your favourite youtuber????@sejalkumar1195", "__.akhila": "Are the three of a relatability your characters in egj grls", "_vaishu_8_": "If u ever had an opportunity to live with each other in hostel for 1 month, would u mind doing that? And also tell us how was ur experience shooting?", "___bhang": "How was it when you first time met each other? 😝was it awkward", "kanika_anabh": "@sejalkumar1195 I have been following you for two years now. I always thought you were a great fashionista but this TV series has made me believe in your acting skills too! Trust me you are really good at it.Great job by the the other two beautiful girls as well! All the best to the three of you! :) ❤", "sonaliroutray88": "Who is actually RANCHO \"I mean the smartest in your group\" ?", "__radarada_": "@sejalkumar1195 tell ur fab music genres n also pls make a reservation reaction video of kpop... Some famous bands r - BLACKPINK , BTS , TWICE , REDVELVET.... Pls react to some of their songs", "vidyalakshmi2202": "When will they Release 3 episode.... I'm waiting for it....", "khushihabbu17": "Are u three same as characters Kiara Sabu and maggu in any way like character traits", "duatirawat11": "Where those brown formal shoes from 😭😭", "anusharaom": "@sejalkumar1195 how did you first met was it embarrassing? Or cool?", "meenayadav235": "@sejalkumar1195 what was the most fun scene and toughest scence in doing throughout the whole season?", "kritika_2204": "How did u all become friends?", "anoushkakaushik_111": "How was your time on sets ? Did it give you gius time to bond amd know each other?", "ssoa_mii": "Any inspiration you got from your characters you are playing ?", "shruthi._.manoj": "What was your first impression when u both saw sejal😄 love u guys 😚😚", "yourman.01": "Is youtube along with studying difficult?", "poojapal5845": "Hi dear", "noorpari3996": "If 3 jhaliyan would be filmed who will be rancho in real life??", "sejalllllllllllll___iluvme": "If u were suppose to give up on 1 thing what would it be food weed sex", "anjali_venu": "@sejalkumar1195 this question is for uu Sabu and magguu.. how did u guys become besties.. despite being totally opposite character?? @barkhasingh0308", "janhavi_srinivas": "Did u guys know each other before da series started....? Favourite scene of da serious..... @sejalkumar1195", "divya.2506": "If you were to choose between the 3 characters from 3 idiots amongst yourselves who would be whom??#q&a @sejalkumar1195", "manaarrkhan": "What is the best memory uptill now while filming together?", "_.tuba_fatima._": "How your YouTube career started. I am big fan of sejal amd I love you. Amd I also love Timeliner 😚😚😚😗😗😗😍😍😍", "saraaaaah.n": "Who is the most naughty among you three?", "let_this_inspire": "Who is rancho in real life in 3 of u?? Love u ppl😘😘", "imbeautifullyweird": "Ask...who stole something in school life ?", "dino_shaur": "@gargi._.jha your favorite people omggg!", "sadhvi._s_.shetty": "What is that o", "kinjallbasnet": "Who has the best acting skill among u all??", "alishbasiddiqui11": "who are you favourite singers(hollywood) and actors(bollywood)??? @sejalkumar1195 @barkhasingh0308 @kritikaavasthi", "isha_poddar99": "What do you all love the most about your character and what similarity does your character has with your real life personality?", "venic6gi": "Is barkha the same as her character with infectious energy or quite the opposite 😋", "megha_singh27": "I loved loved the episodes.❤ You act so well!💌 @sejalkumar1195 😄", "anshikaxoxox": "I luv d series....me n my brother have watched both of d episodes...a question from both of us...if u had to change d character n attitude of Kiara what would you do differently??", "1111bushra": "Are u close more to maggu or sabu p.s I ❤ you Sejal....", "_x.itsmeshar.x_": "what is the one thing you would pick if your house was on fire", "pariarora1107": "when will you three conduct a meet and greet together ????????", "varsha.mahapatra": "Who takes most time to learn dialogues?/ Who mostly forgets dialogues?", "arsha_jayaraj": "3 things that u like about each other in person😍", "_jiminxshine__": "Tell about ur most memorable experience @ the shoot🎥", "m.7ania": "sejal mam how did u felt when u got the opportunity to do engineering girls & & with sabu n maggu plz reply😊😊", "charu_nivetha": "Was this the first time you guys were working together??", "eishitaa": "Which is your favourite menory from school?", "hasmitakapoor": "What is Ur experience after doing a web series for a very first time @sejalkumar1195", "tejal_mahindru": "What type of students were you? How much do u all relate to ur character !??", "aditteeee": "Did u actually have such an experience wen u went to college?", "aayushi.xo": "Who is the most dramatic among you all?", "_.dhruti.918_": "Are you guys the same way in real life with each other?? @sejalkumar1195 @barkhasingh0308", "sanjotii___": "Hey Sejal! Did you guys auditioned for the same roles you're playing or eachothers? And if you were to switch roles then who would you choose to be? #q&a", "shreeya07": "Konsa tooth paste use karte ho 😂😂", "monazza_23": "First impressions of each other", "muneebaomer": "Each others good and bad quality??", "mehnaaz.hawa": "How much of these characters that you all are playing matches you personally??😅 @sejalkumar1195", "the_curled_one": "A challege? May be a whisper challenge with them?", "ankita_bardhan": "If you have the chance to swap up with any other characters, which one would you chose: Sabu or Maggu??? @sejalkumar1195 😅", "riyaalityyy": "@sejalkumar1195 Hey sejal my question is being a non actor what advices you took from the other two?Also who is more close to you? Barkha or Kritika?", "__priisha__": "Barkha if someone in the college comes and say i love u how would sabu react", "kamakshitrikha": "Who do you think can be your future enemy ??", "erabanthia": "Yeah please 😍", "guptaishita2002": "what was the fun thing you three did on set ?? btw I love you @barkhasingh0308", "notjustnetflix": "How different was it to shoot for a web series in comparison to YouTube on obviously! This one’s for @sejalkumar1195 !", "hitashi_raizada": "What you thought about Maggu and sabu when you first saw them????", "gurleenkaur_03": "Doing a gr8 job ♥️🤩🤩😍😍 @sejalkumar1195 @barkhasingh0308 💖 ly loads💋 eagerly waiting for the nxt episode😌😍😍", "diksha8201": "I am obsessed with your episode your style everything if you all get the chance to meet again with another web series what would be like and also if you both do a collab with sejal it will be fun and congrats for the success of engenering girl web series 😍😍😍😍😍😍", "annika.tandon": "Did u sabu and maggu like kids", "sh33tal_chauhan": "I love those shoes on Subu.....can i plz know of which brand r they @sejalkumar1195 ??", "vd_____________2.0": "ᗩᗰEᘔIᑎG GIᖇᒪᔕ", "gayatri_148": "I love ur videos❤ my question is what's the craziest thing u all three have done in ur collage or school @sejalkumar1195 @barkhasingh0308 @kritikaavasthi", "sabita_bishwakarma": "Even we were group of three... I miss those days. N this series remind me of my btech days.... N my friend call me sabu. N I too have curly hair n round spec. 😍😜😍😘😘😍😍😘😍😘😍😘", "heer_hirani": "How do u guys manage a YouTube channel and shoot for series//what was ur first impression of each other?", "zain_khan420": "Who is The most drama girL In U r GaNg", "wardaa._.khawaja": "Hi", "vishnoiaashi9": "Luv dis trio....my q. Is wat is the thing u admire d most about each other or u can tell any fun fact u knw about each other", "esh_732": "Hey! Love you Guys.!! I want you guys to Share your real life bff stories if any! some interesting stories like these. ❤❤", "aangishah2696": "Heya one good thing working with each other about each other", "shivikax_sharma": "Wow", "jnk__28": "Sejal can u do a makeup routine or a morning routine 2018 pls answer both of the questions", "disha_rakesh": "How did u meet each other and did u feel nice meeting each other and when is the next episode coming out I love u all❤❤", "dianthus_18": "Maybe you guys can share some stories about how you guys were in college and how similar or different is it from the characters you are playing @sejalkumar1195", "sanjanasinhaha": "Loved the episode @sejalkumar1195", "muskaansinha": "Which cartoon character are you, maggu and sabu? Can be different cartoons.", "zaarachowdhury": "Who is your favourite Avenger And Your favourite Marvel movie", "thepeculiarkid": "Who's the goofiest on sets", "unfair_fog": "Are u guys besties or just meet on shooting?? Loved both the videos of @thetimeliners", "_.badabing": "Say some awkward+funny story of your engineering/college. And Do you Three have relatable nature as the characters? @sejalkumar1195 @barkhasingh0308 @kritikaavasthi", "jaitly_.ji": "Who out of the three of you in real life is maggu,sabbu and kiara", "srishty.13": "Bestest web series i have ever seen", "abirami_kharatmal": "Is there anyone who will we take a seen even if it is nearly perfect??....... also love you girls keep going and please pick this question @sejalkumar1195", "_.aliyaaahh_": "Maggu-are you the same person in the real life and what do you think Maggu has the most attractive feature", "_.gungun2303": "Hey guys.. I really love u all.. so my question is how much do you RATE your bond or friendship out of 10?", "eshii_rajper": "On bad habbit of each one of you?...", "mustufa_2": "Wow beautiful", "vermanivanshika20": "How did u all became friends in real ?......😎", "sreedeepthi1448": "Yeah actually that engineering girls YouTube series hey Sejal love your content you inspire me a lot and I post content to anyway what made you think that you should do the engineer girls YouTube series recreate your favourite scene part of the engineer in girls series please you 3 2 Helium balloon challenge video on Sejal Kumar channel or the account please", "sweetcake0106": "What was your first impression about each other @sejalkumar1195 @barkhasingh0308 @kritikaavasthi", "gurnoor_kaur147": "Each one of you share your childhood pics!!", "ishadalmia": "What you all dislike about each other??", "savani__shahane": "How will you relate to Raju Rancho and Farhan in real life between you three", "surashreegoswami": "How much do you relate to your characters in the series in real life.?", "ishita16_": "What are your worst college memory", "ssharmaxxvii": "Great...good luck", "micki_mittal": "Why do the name specifically be engg. Girls..??? Anything especial", "_pa_kk_i": "Engineering girls are so amazing...", "jahnvi_2733": "Did you enjoy shooting this series together?", "mendes_13_8": "Do you have any sabu maggu or kiara in real life share a memory with that friend of yours 💚", "aashi_mehta23": "Tell us about your darkest secrets 😏@sejalkumar1195", "_aditteee__": "Share your real life and reel life experience..", "jeenubohra": "Beautiful smiles 😍❤️😍❤️🙈", "mahima_.mazumder": "Did you guys know each other before shoot? And first impressions about each other. @sejalkumar1195", "kitty_co_blr": "Which one of you is a bigger fashion freak?", "alefiyah_bohra": "Hii... I have a question from where this this maggu and sabu name idea came from????", "krissy_dcruze": "Who is introvert sabu or maggu", "ridiculously_rida": "If you both are not sabu and maggu in engineering girls then what you both will be? And have you ever tried to do in school anything similar to what you have done in engineering girls? Like patake phorna...", "mallikasinghrao": "College ki yaad aati hai shoot karte hue?? @sejalkumar1195 @barkhasingh0308 @kritikaavasthi", "x.hibiscus.x": "@sejalkumar1195 heyy i love ur videos love to watch it so my question for you is what would you orefer:- reshoot a video of ur own channel but with different people or just not upload a video??", "rohit._.bansal._.lr": "What do you crave for in life. Paisa love bakchodi or something else. With reasons", "hayafathima._": "@kritikaavasthi @barkhasingh0308 @sejalkumar1195 ..Tell ur most embarrassing secret EVER!!", "janhvi_kus": "Q1. Please tell about your character in this series.", "the.purple.rose_": "How similar and different all three of you are to your respective characters? Btw I loved the episodes! ♥️♥️", "nisha_khanchandani": "When engineering girl part 3 will come I am waiting, !! And sejal u r always awesome 💟", "urvxshi_": "How happy are you with each of your roles and how different/similar are they to you in real life ?", "savnipatel": "Maggu is awesome", "_riaa_x": "Yayy❤", "hiyaachevli": "How was it like shooting together for the first time ?", "sayanti_das": "What is the one prank of Ur college life that u can't forget ever? ... Love you nd the love the series...it's super relatable...❤️❤️", "jahed_ali_sarju": "maggu se mujhe pyaar ho gaya.. itni voli vali si.. awwwwww....😍😍😍💋💋💋", "ananyaabakshii_": "Wowwwwww", "thisisanakrita": "Hey...... Wanna increase your followers likes ......@ very cheap price.......... If yes dm me🔥🔥", "22veenu": "If dhinchaak pooja and mr mohdi are the last two people left on this planet except u who will u marry😘😘and love u all adorable souls so much @sejalkumar1195", "anupriyabhatia": "If you could choose to ship anyone by anyone who would you think of first?#qandaquestion", "void_abinitio": "The three musketeers... 😍", "haaniah.xoxo": "When is the 3rd ep of Engineering Girls coming ? I wanna see it so bad @sejalkumar1195", "rujvsuonseiondein": "How you guys meet each other", "jasreet_batra": "#qanda share with us the most funniest and embaracing moment of you three together ????", "banjaaran_____": "In real life tell me... Who was really like tht maggu... Sabu.. Sejal....?", "_kanupriya_vaidya_": "Who is the trouble maker among you guys in real life? .. BTW I love three of you.. I have watched 2 episodes and I can already relate all those Engineering girls things😘😘😘😘", "priya._.645": "Celebrity crush???", "anaghakolladath": "How did you guys jell together?", "nikita_pareek15": "What was the best part about shooting ?", "neetualexander": "Hey girls...If you have to, which place would you three go for vacay? ..since you and Barkha are into traveling so much.", "devanshivora__": "Recreate ur favourtie scene form engineering girls ❤🌍😊", "fati_mukadam": "Firstly congratulations on doing such a fun Episodes.. Absolutely loved them ...my question is how did the idea of having Sejal on the show came up..just curious to know how each ones initial reactions were like 😍😘Much love", "kripasharma1": "What is Real name of Sabu and Maggu", "bindu__________": "do u guys have same friendship bond in real life like engineering girls ? i guess u theree should be best friends in real life tooo...love you all and looking forward for the next episode❤️😍😍", "neerja_884": "Share any experiences or funny situations from the shoot!!@sejalkumar1195 😘😘😘", "h_padda_0": "Your bunk stories", "gargi2665": "What were your intial thoughts about each other when you guys met for the first time? ♥️", "husaina_h": "Wat is life like to be a YouTuber and u r always on camera so how do u face the camera whn u don't feel like going in front of it", "m.aisa_a": "How is filming together with them ? Do u get along in real life too ? @sejalkumar1195", "ankitapatel1995": "Who was the first to break ice between you 3", "dimple4271": "Plz share some crazy moments while filming the series", "pranjali___mish": "Who you think is the most shy person in three of you ? LOVE YOU 😘", "hiran_peam_": "What was ur first impression (inner feeling) when you saw them😁😁", "sisteristan0515": "Tell something about your college life and ur college Sabu and manggu", "v.i.p.u.l_y.a.d.a.v__": "Ek taRfaa", "soravsinghrathore": "Who will u consider for following between sabbu and maggu..1)movie 2)outing 3)clubing", "makeupbykhushikhivishra": "Who is real life Sabu and Maggu (question for all)", "nupurr_0609": "how did each of u started your careers ?", "_isshi_mii_": "In real life who is Sabu Maggu and Kiara among you three", "harshinivannikkarasan": "who dresses the best", "_mostlylove_": "You people's clothes are litt... ✨😍😍..Wardrobe Courtesy? 🌟", "pooh_theglowingmess": "if you all are real friends in your real life so what level of fun we expect 😘😘", "riya_louis": "Q : Describe each other in one word. I love you guys and I can't wait for the next episode! Lots of love xD❤️", "urmi.ns": "Out of all the three who's the most alike like their character in the series and in their real life ?😛", "not_your_goalss._": "Which kind of food you love spicy or sweet?and who is your favourite youtuber,actor,actoress??and plzzz wish me today is my bday plzzz", "payel_mkhrj": "If u all get a chance to study together in real life, will u all agree to it??? @sejalkumar1195", "annya.bh": "How much do you enjoy each other’s company?😍", "nishitha_basavraj": "Hey, u guys are amazing😘 my question to you three is who is Rancho, raju n farhan amongst u 3 girls in real life ♥", "angel__marshmallow": "Do u guys can relate with our characters in real life ? Tell us any funny incident during the shoot ? Did u guys share a nice friendship bond in real life ? Plss answer this questions and plsss take my name ..lots of love and support 😊😊@sejalkumar1195 @barkhasingh0308 @kritikaavasthi", "_gitikasingh_": "What was the turning point in your lives? #q&a", "renu7617": "Tell us something about ur all first meeting?", "navya11452": "would you like to act in films if you both get chance in films or only continue in webseries?", "___inshaaa": "One of the funniest moment during the shoot?", "_.gauraa_d": "What type of student 👩‍🎓 would you have been if you were actually pursuing engineering..???? 🤓🤔", "_born.confused._": "Tell us ur craziest and funniest college stories", "purestwithin": "What is one thing you do NOT like about one another?", "tarundixitofficial": "Please Share Some Backstage Experiences With Maggu and Sabu😁", "lifecoachpriyankanagpal": "I loved this series", "aah_shiii": "What was your name sejal in the engeering girls???", "_niluuuu": "What was the best part of shooting together in engeering girls??", "saniya729": "Tell us the most happiest moment of yours in the life", "revathi_1005": "Did u know each other before this webseries ??", "vishh_al": "What is sabu's real name #q&a", "sarthakverma_": "Ily sejal❤", "i_vaibhavchauhan": "🔥💕", "priyagusain023": "How's the chemistry between you all? When did you first met each other?,❤❤", "riya_rajan1829": "Who is the real life Sabu magu and kaira?", "princesssss_consuelaaaaa": "Did you guys know each other before this show? Aslo you guys are a great inspiration..!😍", "i_aint_what_you_think_": "Do you enjoy shooting videos together?? is it fun?#q&a", "malviya_apoorva": "Maggu she is my favorite", "kulkarni_ketakee_3": "Mi tumchya barobar act karu shakte ka...???", "gargi_11.12": "who is the most crazy person in you 3 ?", "gowri_2.0.0.0": "What was your first impression on each other? Love Engineering Girls 😘", "_cherry_leaf": "How was your experience working in engineering girls?", "barkhasingh0308\nVerified": "Verified", "vinuthna_reddy.t": "Love you guys.. do you people know each other before the show", "navyaparankusam": "hai", "amrita.patil.589": "Who broke the ice when u guys first met??... 😘", "ohh.couture": "Recreate your favourite part of engineering girls.", "ruchu___sinle_tep": "Who is the fun one amongst you three🤗", "jyot_i_26": "Ur dressing? From where u picked up the clothes", "pragya.__goenka": "The web series is one of my favourite.......can you guys share one of funny your college incidents??", "tanyachawla53": "During the shoot, who has been the most talkative one and the most entertaining one?", "scintillating_saumya": "How is your felling with working with each other? Is it relatable to your real life aswell", "trishaaaa7797": "Have u three ever thought of having an engineering life???? 😂😂😂😂 Expectations vs. reality?", "nishat_valentinetti": "Hi there how ya doin (joey tribbiani's voice)@sejalkumar1195 .....huge fan of you as well as the friends as you can see.....i see the triplet you know....so my question who is monica,rachel and phoebe amongst the three you?do you see yoirself as rachel??😂😀......one word for you -RAD!!!....HOPE THE QUESTION GETS FEATURED!!!", "_chetanaa_": "@sejalkumar1195 @barkhasingh0308 yeh \"chupe\" kya hai", "_ara14": "What was your first impression when you guys met for the first time?! & did you guys fight over anything, do share it! ❤️ Btw love the series!!", "sansarya29": "How different are you on real life than reel life??", "ananthkrishna28": "Are u three best friends ????", "anahita.rangreji": "Who is the most irritating and annoying person on set among u three?", "dhruvikuvadia": "Do a funny prank on someone u dont know😜", "sriii.dange": "we know @sejalkumar1195 is a commerce graduate , what is your actual qualification Sabu and maggu ?", "janatdhanwani": "What is one annoying thing about the other two? And one thing you admire about the other two? The series are amazing!💛", "_la_v.i.e_": "Just keep on making more episodes, I've never been the web series person.. but I really adore this thing you three portray", "12.neha.s": "How was it different to shoot in a web seris do u look forward for some more??", "ananyarao_s": "How are you in ur real life, comparing yourself with your characters in engineering girls", "theauthenticchic": "Love the series!", "amisha_7_anand": "Would u like to work again together in any other web series????", "hharleenkaur5": "How many takes u all did while shooting?", "_muskanag": "How was their experience working with you? 😅", "bhavya0735": "Have U ever experienced engineering????", "shriya_213": "How were u all planed 2geter ? Did you know them before?? .... #indianyoutuber", "diceadulting": "Who is kiria's best frd maggu or sabbu", "seema.r123": "Nice dress", "one_bong_girl": "Among three of you who is the funniest?? Good luck for engineering girl.", "manish_gupta313": "Hii sejal i am your biggest fan....love u from core of my heart......", "vaishnavi.yelisetti": "Tell us something,like good and some unexpected things (like you never expected she would be like this) about each other? PS: Three of you are amazing! And even engineering girls is just🔥🔥...", "divya__v": "How can I get a role in a series like this?", "royal_sunshinee": "Do sabbu and mangu snore when they are sleeping?", "ishambhavi_": "What are the most unforgettable moments while shooting this series?♥Btw I'm loving this series 😁", "aasiyaan_24": "how was your experience on working the first time together on the web series??", "aanchal__chandel": "How was the bonding among you three off screen ? @sejalkumar1195 p.s picture says that you guys had quite fun together 😇", "_siddhid_": "Who needed more retakes ? :P", "tanishkasadh": "Do you plan to do 100 episodes of engineering girls??", "ankita2512mathur": "@sejalkumar1195 would you people plan another series or fashion video on your own after the one that you guys are doing presently ??", "hereisbhabya": "What was the funniest memory in the set?", "prianjali12": "Love ur series of episodes... Pls do the most hilarious moment while shooting the episodes..", "prat_diaries": "The most favorite scene of engineering girls?", "anisamaity": "How much u hv fun doing this series? How u r differ from ur character? Or How much u relate to the character? #Q&A", "the_procrastinator_16": "Do u three have similarities in u????", "akshada_gosavi": "Hey @sejalkumar1195 @barkhasingh0308 @kritikaavasthi !!! Loving your chemistry..... the series is amazing and my question is for all three of you \"Name Who\" 1) Miss. Line bhulgai 2) Miss. Touch up queen 3) miss. One take.", "jaintulika.862006": "Recreate your favourite scene/part of the engineering girls", "_lekhaaaaaa": "What are the demerits of girls in engineering?", "niishhmaa": "uh dream?", "sophiyahh_x": "What are your future plan? U will work timelimers or what @sejalkumar1195 love.", "pratiksha_hallad": "When is the next episode ?!!?", "and_reaaaaa_": "How was your experience working with Sabu and Maggu?How well do you guys know each other?", "umernnadeem": "@barkhasingh0308 What silly or funny thing makes you afraid or creeps you out....??", "alkaarora_": "Any embarrassing moment in school?", "aarushi161": "I like your episodes are you going to make other episodes", "muskaanmatta": "Sejal this is the first time you're a part of a web series. How did you end up being a part of it in the first place? I love all three of you though❤️", "shatakshivashishtha": "One of the most annoying things you discovered about one another while working with one another. ♥️👀", "toiyaba_1599": "which movie you want to be a part of, if it's sequel were to be made?", "_praptishende17": "What was the first piece of work you guys saw of each other and what did you think of it ? Ps. I love you guys ❤👊💥", "imeghayadav": "@sejalkumar1195 check your dm didi", "aishwarya_gachinamath": "What do u three of u do after pack up? Any offscreen masti?", "shilpadasofficial": "Who is sabu, magu and kiara in real life?", "s_dhruvi_": "Share ur best set experience @sejalkumar1195 huge fan of u 3 😘", "aaannnniii16_": "What are your favourite foods @sejalkumar1195", "akshita_2513": "Each of uu tell us ur biggest secret 😋 #q&a @sejalkumar1195", "nerissatk": "Who among you are more close to the character of Rancho ???? Lots of love# engineering girls", "lazy_forever_2230": "Who is most funny on set among you three😂😂", "keertishukla_": "If each of you could act for a brand's product ad, which would it be? ?@sejalkumar1195", "nammi210": "Tell us about some of your fun college stories", "xnjskaoxnsijsiwk0s": "Hi, I love your videos and the content you make. If you guys had option to choose another characters than what would you choose (you can take reference from any film)", "riyaaa_100": "who's the most active among you three?", "afshaxx_": "hey sejal☺️........my question is who do you think is the SABU,MAGU or KIYARA amongst 3 of you in your real life??????????", "marriedfriends": "Fir sabu.if u need to choose n date between sejal n maggu... Who would that be?😀😀", "vidhii_x": "To all three of you! Do you guys have your own trio gang in real life too?! I love your work Sejal!Lots of love -Vidhi❤️", "shikhawaghela": "Were you same as your character in your own college life?", "simu26": "If you had to name each other as any food item what would you?? Or describe each other with any one famous tag line....", "_sakshidhole_": "Tell one secret of you'll that you never shared with each other", "nirvickdutta": "Do you three single or mingle?#indianyoutuber", "taaniishhqaa": "How does it feels to work with these two outstanding personalities ie barkha and kritika??", "mrunmayee2111": "One thing you all enjoy doing on the sets of *Engineering Girls*.....@sejalkumar1195", "junaidchoudhary007": "Why don't you all three go to Sarojini and buy clothes their and make a video", "maria_mat92": "Being a non-engineer, did you find that the incidents portrayed in the series were any different from your own DU experience?", "riiya_palkar": "What does sejal like about both of them in person", "renukasrivastava": "Swap your characters", "sukkruthaa": "Hey sejal i admire you the most and your content is just amazing 1. What do you think abut eng life is it fun acc to you ? 2. Wht was the first thing tht came to your mind when u were called to shoot for timeliners 3. Whz the most craziest person among you three", "poojaagaur": "How did you guys get to know eachother", "_.dipanwitatata._": "Share some craaazyyyy memories while shooting for Engineering girls?!", "smaatic": "Your respective qualifications and what people did your college/university group consisted of?", "anuragshiv": "Aarey awsm", "inoor_765": "Did u know each other before (like met personally)before timeliners", "nirmalkalraa": "Tell us your most embarrassing moment while shooting engineering girls 😂", "ddramaqueen": "What was the memories of your college life that helped u instantly connect with your character or the concept of “engineering girls” ?", "__antariksha__": "Tell us the favourite makeup of yours ?", "rastogi.aish": "If you could base your characters on any iconic Bollywood character what would it be?🙄😅", "tishachhabra_": "We're you guys comfortable shooting with each other 😉", "yehdjdjehed": "Are u all real besties???", "kalyanivatsala": "On what basis were the characters decided? How did they make a choice about who plays who?", "laxminarayansharma7982": "☺️", "rohan.nathiley": "What was the best memory you three people share behind the scenes while shooting for the web series!? You three = 🔥", "_fearless_baee": "Who is the funniest in shoot", "harshita.saratkarr": "How difficult was it for you guys to get into your characters? And how relatable were the scripted scenes as compared to real college life?? LOVE YOU A LOT♥♥♥", "ishita__bhatt": "When the next episode is coming 🙁!?", "_sou217_": "#this like for the first time that for engineering girls some content is made. How was it playing a computer engineer student?? share ur views on this. And srsly @sejalkumar1195 love ur work a lot infct i just wait for the notification to ringup for ur videos. pl share ur views. As even i m a computer engineer and evn i stay in a hostel. and i can relate 100% to this . p.s. i agree that i m d sabu of my hostel ❤❤love u sejal", "titiksha.agarwal": "Funniest incident that happened during the filming of the series?", "_s.h.i.v.i___": "Yaaa tht will be great if u three do a film QandA", "feat.khushi": "How much did you guts enjoyed and how your bond is now?", "adiba_ansarei": "Can u make those engineering girls episode for lifetime because I love them... And love u also dii 😘😘", "nancy_yadav12": "Who is your favourite actors", "know_sangeeta_": "What are your qualifications in reality..... anyone from you engineers?", "shradha_reddy._": "Are u guys real life freinds too?", "srilekha_annavarapu": "Tell 2 good things and bad things about each other... BTW even I completed my engineering this year and I have 2 bestiees just like in the series... We 3 together saw ur series and compared ur characters to ours 😂 😂 😂 😂 😂 love u", "yohita_dhayalan": "Which of you 3 exactly suits the characters of rancho ,raju or farhan like in the movie ?", "ishikaagupta_": "What was your first impression of each other?❤", "trina.dasguptaa": "Could the three of you relate to the characters that you played on Engineering Girls? If yes, how? @sejalkumar1195", "kruxttika": "Omg YAASSSS❤", "manvishrma123": "Tell us one good and one bad quality of each character of the series.", "annabananabeans": "WHAT WERE YOUR FAVOURITE SCENES TO FILM TOGETHER? Also love the series So far 💛", "ayushiiguptaaa": "How are your experience working with each other?", "annuasha": "do u guys actually fight? like in the last episode? 😁😁", "rv_006": "What's ur bucket list destination ??? ( For all of u) 💕😋", "soumya__rathour": "From who you decide to become a YouTuber", "kashish__ahuja": "What was your first impression for each other", "sakshiahuja8": "How sejal was selected for this series", "anyaaasha": "What was the fun part of filming together? 💕", "anushkanath1101": "Sejal what do you like and hate the most about sabu and maggu??..😊", "i.tanu_": "Do they know that you got best boyfriend in the world?👀@sejalkumar1195", "x__bhavya__x": "Can you share one of your most embarrassing moment with your crush! Like I should have had used my brain moment! 😂", "na_nayanika": "What impact has this series done in your friendship?? You guys knew each other before this series?? Can you relatr your college days while shooting this fun series??? 😁😁", "dishaxr_": "What are the 3 things u love about rainy season???@sejalkumar1195", "___jinalpatel____": "Hey sejal love u. N yr content is just amazing. I wanted to ask were u three the same in yr real clg.", "srestha.rath": "I am going to start engineering soon😅. Tell me how to survive my first month in an engineering college?", "titiksha0209": "How is CSE?? Getting good grades or not?? Also, is maggu fine after her fight with Sabu?", "ananyamahishwar": "How was your bonding behind the cameras?", "nuhazahoor": "#IndianYoutuber #QandA is it because of this shoot u all first met???BTW love yaa!", "j.u.h.i_42003": "When did you started the shoot ? @sejalkumar1195", "chhavikhurana": "Who is sabu n maggu in real life?", "darkwillows_25": "The most embarrassing situation in college which you guys have faced.", "_urvi.21": "How u thought about working with them in engineering girls? @sejalkumar1195", "klicktures": "How did you feel when you found out that you were going to act with Barkha and Kritika who have already been a part of a few web series because of course, you're new to this. (And still brilliant, love you as Kiara!)", "preetzbn": "if you'll were to pick one character from friends who would be rachel , monica and pheobe", "palak_gupta10": "Which character do you guys like the most, maggu, sabu or kiara?", "the_rachitasharma": "Who is the 'drama queen' in three of you??😂", "_ayushist_": "Uday(if i m not mistaken) ko pel diya tmlg ne😂😂 plzz share the bloopers guys", "chic_a_pose": "I saw the 2nd episode yesterday. Man!! You nailed it. I’ve never seen such an amazing girl trio ever. Looking forward to more fun episodes🤓", "beccxaaax": "Describe the most embarassing memory you've had in college 😂@sejalkumar1195", "garima_12_": "Hiii sejal ...Tell us about ur lifestyle.......ur slim body 😀😀😀", "karishma.thadani": "How did you get a chance to come on timeliners??how was your experience with them ??", "vaishnavi_9041": "how much can u connect with the character...did u ever have such a bond with ur frnds in real life..@sejalkumar1195 bdw..show is amazing !! nd sejal ur my fav.. ❤❤", "tanushrreeee": "Avaan❤🥀", "akansha_09": "How good friends are you guys now?", "saumya._.27": "Hello💓.Do you guys relate to the characters you played in the series?", "ri.dd.hi": "Why is the show specifically called engineering girls. Is thier any connect to name in future episodes because it seems like a simple college like experience in 2 episodes . Love ya sejal", "gauri_acharya12345": "when will the video of you and rickshawali collab will be out??please tell", "happy_soul____________________": "Agar aap tino Engineering karte Toh kounsa course choose krte..@sejalkumar1195 @barkhasingh0308 @kritikaavasthi kaavasthi", "muskanngargg": "Sejal how did you managed to be a part of enngineeril girls?how it feels to be a part of this wed series", "shashwati08": "Hey Sejal! Whom would you choose between Sabu and Maggu?😹 you know what I mean😂😂", "pranali_rk": "Tell us about your best memories on the set ?? .. btw you three look great together 😘", "spill_the_sass13": "Are you really best friends,like shown in series?@sejalkumar1195", "sanya7101": "Hi barkha i want to ask how was ur experience while working in 'breathe' with all that famous actors????", "sakshiarya2505": "Ur engineering girls videos are awsm... Continue to make videos on engineering grls... Lots of love😘😘", "ishita.parakh": "How different are each one of you from your characters in the series?", "ira.aggarwal": "Your own pranks, punishments and incidences with friends from college life?", "binaisha_fernandes_": "Why are you so damn cute Barkha ? N yea I love love Sabu , Jeff and not to forget the best of all and my most favourite Gia Sen 😘😘😘😘😘😘😘", "niks08_": "Any fun incident happened during shoot ? Do share 😊", "sayani.bhattacharya": "Who is the Maggu out of you 3 in real life? 😋", "arussshhi": "@sejalkumar1195 You are soo inspiring 🌹", "_dineshkhr_": "Sejal ur always luking cute love u", "saracastic_sharma": "Hey you all so my question for q & a is, you three tell each other 1 bad and 1 good habit about each other. @barkhasingh0308 @sejalkumar1195 @the_conclusion_", "sana_khan_135": "What was your first thought on mind when u meet Sabu and maggu love u all 😘😘😘", "sush10_": "♡♡♡♡", "deepika_durairajou_10": "What was the craziest thing is have done in your college 😂@sejalkumar1195", "priyankaaaa_verma": "Hiii sejal...big fan of yours....and mera,sawaal h agr aapko chance milta mohak ko engineering girls mein cast krne ka ...toh aap unhe kya role dete..😄😄😄", "prasitamukherjee": "Who among you three acts Best according to you guys ?", "anupma__yadav": "how u all met ???", "akansha_shruti_lakra": "You'll be missing your parents right !?", "parishay_jhanzaib": "Where is mohak????@sejalkumar1195", "saiee7": "In ur real life, are you the same as ur characters?? By the way I love u sejal,sabu,maggu.....❤❤❤❤❤❤❤❤❤❤❤#indianyoutuber #q&a", "anushka0619": "Best scrne in the series", "_iambelli": "Hi guys! ❤ Each on of you share your craziest college memories!", "harshu__9": "Swap your characters 😁😁😁", "_.vanuuu._": "Did you ever think of working with barkha and Kritika? Now that you're working with them how do you feel and would you like to work with them in future also?? Please tell about your feelings! @sejalkumar1195 ♥️", "abby__31__": "How was the experience of shooting Engineering girls?", "inayat.khara": "Best memories from the shoot???", "wtikmani": "Wat kind of bond do u guys share now? @sejalkumar1195", "ketaki.bhalerao": "How much time did you require to shoot all the episodes @sejalkumar1195", "sakhuja_khushi": "Who is most likely to where pjs n go out shopping", "sameera_mathew": "Who is Rancho in real life? :P", "unmelancholy": "Are you still with mohak?", "nvp.49": "Are you that close in real life too? #asksejal @sejalkumar1195", "eshita_sachan": "Are all three of you from engineering background and what all do you people got to know about engineering girls life while shooting? @sejalkumar1195", "thelightandstyle": "This series is super fun to watch!!! Loved it ❤️", "khandelwal.saakshi": "Hii I just love your trio . my question is how did u all meet ? How was your first meeting ? It seems you are friends for years", "grisha_yeole": "How did feel to shoot engineering girls", "samkha122001": "I love maggu", "dishajainat18": "How sabu can be so cuteeeeeeeee", "ishwareen_14": "Would you three like to actually stay together in a hostel??? @sejalkumar1195", "kam_810": "You guys are awesome!! But who takes more retakes during shoot???? Or who forget the lines most? @sejalkumar1195", "irakwatra": "Which character do you like most? Maggu or Saabu?🤣", "karpagameenakshi": "Who is your best buddy?Sabu or maggu", "rozy_agrawal": "Who is craziest on the set?", "bluntlycheeky_": "How was your experience working with Rancho and Farhan? 😂😂😂@sejalkumar1195 (raju) 😂😂😂", "_sakshi__06": "Hii.... I am really loving Ur new series.... It's really fun ... Doing a great job Sejal.... Hats off...!! .😍 U can definitely do more of such things. Well my question is... As all Ur characters are Totally different....like to completely different from one another.... So r u all the same as Maggu , Sabu Nd Kiyra... 😍😍😍 And how much fun is this new project for u Sejal .... !!....", "abhipsha___": "@sejalkumar1195 do u 3 share the same bond in reality as in reelity ❤❤@kritikaavasthi @barkhasingh0308", "himanshijindal07": "What would you all 3 do when you will see such discrimination against girl gender in real life or your college in getting a role in a play??", "maniiii.ac": "The most embarrassing moment they faced?", "wondergirl7800": "One most fav and one annoying thing about each other!! #plzz #take #my #question #sejal #youtuber", "utrinque.paratus": "What is the most wildest fantasy of all you three and the most dark secret be honest and who is the most patriotic although I know it'll be @barkhasingh0308 ! 😊", "pratikjaiswal_official": "Have you three ever dreamed of being an engineer ? 😊... #Love_from_assam", "smruti_bapat": "Which friends character are you?", "sanchiganda": "Share your experience on your first day of college.", "tripti_malohtra": "superb ✔✔✔", "tanya__.singh": "😍😍👌", "abha.rathi75": "How did you got this role @sejalkumar1195 was it a tough one 😊", "theharshdaiya": "Were you guys excited to know the cast of #engineeringgirls, as of each other...", "_leosrc_": "Please share bloopers of Engineering Girls", "aishwarya_vaid": "Tell us a secret from the sets of engineering girls😂....!!", "eva__.xoxo.__": "If you had to choose between Mohak and your parents, whom would you choose???", "priyankaangolkar": "Being together for this project for quite some time now, did you notice any wierd or funny habbit about each other?❤😅", "kaivalya1990": "Same things happened with you guys when you were in college ? 🤔", "pondadisha": "Who is the real Rancho out of you three tho ? 😂 This is an amazing series to watch 💕 lots of love sejal 💙💙", "__couch.potato___": "Sejal I love your contents.What was your reaction when you came to know sabu and maggu are gonna be your co-acter? What is your experience with them 😘😘😘😘😘", "tanvii_rawat": "What u like about each other????", "lakshitaa_xoxo": "Do you relate yourself as the character you play in this series?", "sunflowersandmixtapes": "\"wo chatur ko kon samjayega yaar?\"", "anu_pradhan05": "Hey sejal you always make great videos . By the way how did you come across this opportunity of Engineering Girls. Love you 😃😍", "anshhyy": "Tell us about ur college stories..😂😉", "_ishasingh": "Your first impressions of each other :P before meeting and after meeting!! And bloopers and behind the scenes and please try vlogging a bit!! 💖💖😍", "priyanshap": "Your first meeting? When you girls met each other for the first time for the shoot. Was it weird gelling up or did you guys connect well?", "hiraljethava": "My question is for u sejal. Are u N mohak broke up?", "prity_roy__": "Who is your favourite character~ Sabu or Maggu?? 😂", "nehal.kay": "Where is the jacket saabu wore for the last episode from", "simrankaur2472": "What kind of thoughts you guys were having when you met each other first time? And love your series❤", "meghana__rao": "Full names of sabu and maggu", "aahujaswara": "Hey sejal di I am your bigggggg fan and your video is very nice so please make how to edit your videos please please please please ye video bnao na sejal Di 😃😃😃😀😢", "_.suhasi._": "How was your experience at sharda university? @sejalkumar1195 and yaa...I love you", "sushmitasahay27": "Loving your series...how much fun u all do on the sets😊😊😊", "m_ojo__": "First impression of u all three by seeing each other what u first notice about each other ?@sejalkumar1195", "_prinkyymess_": "If u were really besties then what would you do if u met each other after long days?? I meant that u have to act it out to us!! @sejalkumar1195", "tush.tiee": "Whom are you more close too???", "miss_crypto": "Hey sejal! I love your videos! I wanna ask you guys about the stupidest thing that you have done in your college life?", "lakshmi__soundarya": "Is anyone of you real life engineers?", "shruti_kumari32": "How was your first reaction on knowing each other completely", "boldblushblog": "Barkha singh is everywhere..on loco web series youtube....whoooooo...what os the catch??? @barkhasingh0308", "mishaa_jaiswal": "❤❤❤❤❤❤❤❤❤❤❤❤❤you all together are amazing!!!!!🔥🔥🔥🔥🔥 what's your favorite moment shooting with muggu and saabu", "quiescent_7_": "Who is the gossip queen among you three ???? Btw love your acting ❣️❣️", "snehil_157": "how does it feel doing web series", "a.n.u.b.h.o.b": "Do you think this series has changed your life? If yes, then how? Do you also think this series will strengthen your bonds with Sabu and Maggu? Please reply. xx @sejalkumar1195 #q&a", "j.dhwani": "Hey sejal I inspire u alot in my life so my question is how was ur experience for first tym working on a Web series lyk dis and u also recreate all ur memories of clg back few yrs so how was everything @sejalkumar1195", "p_a_r_u_l_pb": "what were you first impressions of each other??", "success.race": "😂😂😂😂😮😮😮😮😮🔥🔥🔥🔥🔥", "__.tamannaaaa.__": "How was your experience working with Sabu and maggu? And how did you like working in your first web series? Love Tamanna 😊", "i_am_jiya_ali": "Some memories of college", "sneha_was_here": "@sejalkumar1195 - how did you ended up doing this web series. I mean how it all started? Is maggu same in real life too? Dear maggu and sabu - how is it to work with Sejal? Who eats the most? Whose shots takes more retakes? Any funny scene that you can tell us or show us bloopers pls.", "_______spam_account_____": "What is Maggu's most favourite or crazy childhood memory ?? 😜❤️", "sadikasultana504": "Frist impression of each other @sejalkumar1195 and mention my name plz plz plz plz plz plz plz plz plz plz plz plz plz😙😙😙😙😙😙😙😙😙😙😙😙😙😙😙😙😙😙😙😙😚😙😙😙😙😙😙😙😙😙😙😙😙😙", "harshitamathur_": "Do you guys actually have similarities of your characters in real life? Is Sabu actually Maggu's life saver?", "alisha_narang_": "How much can u three relate the series to ur real college life??", "riyagarg997": "Anything about college life", "riyashah.rds": "Hello everyone 😊 I wanna ask Barkha Singh that how did she start her career and how was her journey towards success ❤ Also first I had seen her in Girls On Top on MTV and since then I find her so cute and talented. I love you so much❤ Sejal Kumar you were toooooo Good in Engineering Girls 👯😎 You should do more web series and rock Youtube as you always do ❤ love you ❤", "varsh_1011": "Maggu- are you like your character in real life?", "patel___riyaa": "Do you think that the story of the Engineering girls is somewhere true in real life or related to you, sabu and maggu... love you guys ❣️", "soniya0725": "If u all were really in college would u do such things in real lofe which u all r doing in web series ???? Plsss ans my question", "amritaa.sandhu": "How long did it take to shoot one whole episode and how'd you guys cope with long shoot hours??", "manjari_mansinghka": "How different was it for you to shoot for a series then shooting videos for your channel..?? And was it difficult / Fun / challenging??.... Btw i loved ur performance. You three rocked 🤘. @sejalkumar1195", "khushi_ig": "Who is the lazy and foodie person in the cast ??", "_arpitananda": "Please tell Sabu to bring some Laddus for us also😛", "alisha.mehta": "Hahaha. These episodes were so amazing. Literally the same things me and my friends had done in hostel. Just watching this reminded me of them and all the fun we had together. It was so relatable. Enjoyed a lot!! 😁😁", "bhattacharyaankita33": "Love watching about life of girls in engineering as i am an engineer too. Was there a time when you had to take suggestions from real engineering girls? For getting a help with the story line.", "ja.yi.ta_diwa.n": "How do you all feel working together?", "ritika_dube28": "Share any of your hostel/college life memory something related to that \"patakhe\" vala scene!? @sejalkumar1195 @kritikaavasthi @barkhasingh0308 ❤❤❤", "ayushie97": "Have u ever really experienced hostel life @sejalkumar1195", "theedward897": "What is the most craziest things you have done while shooting engineering girls?", "167.04x": "What did you pursue in college?! And also if you have lived in hostels share some real experiences and how actually the life at college and hostels are ?!", "malhotrafreyaa17": "What is the motive behind engineering girls and what incidents have you all gone through in real life ( relating to engineering girls )???", "shambhavi_.mudgal": "Is your college life similar or different from that of engineering girls..", "ankita_nath_96": "How is your bonding with both of them?", "ifrahhassan12": "Please follow me", "diary_of_duati": "@sejalkumar1195 @barkhasingh0308 do you guys think there will be a day when the percentage of both genders are equal in any Field?", "eshhaa.xx": "Hi Sejal!! Love the content❤ both yours and the new web series'. This question is for all three of you. How fast did you all bond together and what are some favourite memories from the shooting of the episodes? Lots of love😘", "alpa.upadhyay": "Become maggu in the video..swap ur role with maggu", "kapsuhani": "Behind the scene stories of engineering girls", "a__girlhasnoname": "What was the best part of traveling to Chandigarh", "vanshika_nehra": "Any funny memories of yours from your college diaries", "veevamoitra": "First honest impressions of each other!", "paloma_265": "When you got to know you are working with them, how did you feel💗 ilyy, Paloma", "uttaraiyerr": "Did you guys know each other before this project ? And how did you all feel when you got to know that you are working with each other ? @sejalkumar1195", "shinjini_khamaru": "What thing would like to take in from both Sabu and Maggu@sejalkumar.", "amigo_gemini": "Yes", "tara_taara": "Hey sejal! Who was the most fun and notorious one in your web series; like the #misstroublemaker", "_nobody_asked_you_patrice": "How is your friendship in real life ? @sejalkumar1195"}