{"sureshhkrishna": "Gorgeous 😍😍😍❤️❤️👌 @sejalkumar1195", "_niluuuu": "Well you shot a video with @ricksha_wali no?", "that_quirky_mess_": "Watch pick up limes channel... The best😍😍😍😍😍😍", "kumar.alok.5055": "I love you ..dil se deshi hu pr aap mujhe apane jaise lgte ho..jaise koi purane janam ka rishta hai...", "harshpreetkaurmanak": "@sejalkumar1195 Watch @buzzfeedunsolved", "patrasanjay065": "🔥pretty", "__.sudipta": "You are Amaaaaaaazing Sejal Didi. Amaaaaaaazing 💕💕💎", "shinugarg77": "Just luv channel the most interesting thing to do and we all luv u loads 🙋‍♀️🙋‍♀️😄😄😍😍", "mugdha_.01": "hi di today is my birthday can you wish me", "asmita.sengupta03": "Sacred Games dekho,mazaa aa jayga @sejalkumar1195", "abbas_sakeena": "@sejalkumar1195 ....girl go for PEOPLE vs OJ SIMPSON", "no_errot": "You are soooooo cute @sejalkumar1195 💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖", "show.he.knee": "The Ellen Show ❤", "taaraa_writes": "Watch pretty little liars ITS THE BEST YOU CANNOT COME OUT OF IT! It’s amazing 😍😍😍", "mansivpandey": "Watch lust stories on netflix 😂❤", "_kriti_barua": "F. R. I. E. N. D. S", "sudha_queen": "Come back soon....:-)with lots of 💘", "cuticura_george": "❤😘🙌🔥😍😮", "rubiagarwal": "Hi sejal! Plz make a video on party wear dresses....like night party,clubs...esp decent one....like on pants or jeans...", "rheachacko": "If you want drama, then' Jane the Virgin'! Or you could watch 'the good wife'.", "friendsofpune": "Take a break for as long as you feel, we will be here always and we want you to take care of yourself❤️", "alisha_bellingham": "Enjoy your break. N u can watch 'i Zombie' on Netflix😊", "simran.a_n_a_n_d": "So nothing for father's day???", "_.tanusharma._": "❤", "ayokie_dokie": "Riverdale on Netflix !", "riya_rajan1829": "I will miss you Sejal! Your videos just refresh my mind, coz it's that amazing! Love you! Come soon! Video request: how to style midi skirts!", "the_indian_web_series": "@sejalkumar1195 You can visit our page for Amazing content and all reccommendations related all theindianwebseries ❤", "monisha.7498": "13 reasons why", "pottertanu": "Enjoy your “Me Time” 👓", "mr_big_shine": "Your only limit is you ❤✌", "samreedhi_nath": "You have been doing a lot around lately. Keep up the good work.", "parna_16": "@naomiboyer has an amazing styling channel... i just love how she puts her outifts together. You can check that. Also Crown on netflix is absolutely amazing. Its about young queen Elizabeth.", "manya912": "You can watch Gilmore girls on netflix", "rahul.srisrimal": "@sejalkumar1195 Have a great time! And come back soon, can't live without our recharge for very long.", "divya_choubey": "Gossip girl", "1kashuk": "Wow wow wow", "komaljituri82": "Gilmore girls", "_hashofficial": "If you could check out my channel, it'd be great. The link is in my bio.❤️ PS: you're one of those only youtubers who is so real, and only shows what they actually believe in. Love you💓", "pal_twins": "Amazinggg💞💞💞💞💞", "mystylepalak": "You can watch sejal kumar videos obviously but other than that you can watch @kalynnicholson13 she is amazing in my opinion and for Netflix I would say stranger things and crown I don't watch many shows but if you want book recommendation I have many 😉", "tanya.jagdish": "You should watch Girl Boss on Netflix! You would definitely like it!", "pammiraj_collection": "Hey sejal...❤❤❤❤", "kumar_ashish_tintin": "@sejalkumar1195 love you in engineering girls", "__k.a.v.y.a.a.a.a.a__": "Hi..love u a looooot btw do you watch @filtercopy or @mostlysane ??? :-) :-) :-)", "itsnxk": "Idk if you already watched it but I think you should watch RIVERDALE so it has 2 seasons and it's just AMAZINNNGGG", "iijayshreeii": "I support your decision, hope we will see cooler videos soon // 🌸💙 Have fun! 💜", "raveenanair": "Watch Orphan Black on Netflix", "rohananair": "Orphan black, it’ll blow your mind!", "sharvari2909": "Oh I will miss u... So much😘😍...btw I respect ur decision....come soon with some upgraded version of ur videos.. 😍", "marriedfriends": "Hey just watched the new episode... It was fun... But u didn't pick up my question... That was tricky though... Phoebe got in trouble with the answer in FRIRNDS with that question 😂😂", "ektas8627": "Nyc", "debu_ki_kahaani": "Lost Le Blanc @lostleblanc is really good and Sorellea More @sorelleamore", "bling_pearl": "You are such influencer😘.. after getting motivated from you i have also started my channel.. keep rocking😘❤️", "ashley_courteny_07": "Ohhhhhhhhhhhhhhoooo", "kritika.95.jain": "You are such an inspiration Sejal. I love your videos. You post really great stuff. Have fun in your break. Hope to see you back really soon.❤", "pixelsandtales_": "If you haven't already, watch The Office (US) on Netflix. One of the most brilliant, amazing and funny show ever ❤️", "carolinemx__": "Watch Dynasty and enjoy your break💕🗻", "_that_bong_girl_": "👌", "sachin_dolta": "YouTube : impact theory by @tombilyeu", "amritha_moorthy": "I started watching YouTube on a regular basis only because of you, and you were the first Youtuber who introduced me into this youtube world. You are awesome in whatever u r doin, hope to meet you one day ❤❤❤Love from Mumbai!!❤❤❤", "pitchers6930": "I spend my time watching sejal kumar😊i recommend yuh to do the same", "aaditya_asthana1211": "Tussi ja rahe ho , tussi na jao 😩😩😩😩😩😖😖😖😖😖", "funkthinking": "Like the page. For fun", "ll__preetha__ll": "We are gonna miss you a lot diiii 😭😭😭😭😭😭come back soon!!!!", "garima_kth": "Watch \"The Marvelous Mrs Maisel\" \"You're the worst\" \"Westworld\" \"The Crossing\"", "pavnisuri": "Hey Sejal di you are the best!!!", "badhe_gaurav": "Enjoy ur break and try 13 reasons why season 2 on netflix if u liked the first one !!", "annuasha": "Hey you are one of my fav youtubers.... Will wait for your return soon .. watch kalyn Nicholson, sarah Betts, Hermione Chantal, betany mota......Get freshen up and return soon .... will miss ya♥♥", "shreyachauhxn": "You’re amazing!!! Btw u should watch RIVERDALE, PRETTY LITTLE LAIRS, or JESSICA DARLINGS IT LIST (izza movie)", "shreya._desai": "I ❤💓U sejal didi"}