{"sky_walker_since_1999": "Aunty should ask where do you see yourself in 10 years from now? @sejalkumar1195 #MomAndMe", "shailesh9217": "Nice", "sagar.arora05": "Why dont you look even a little like your mother??", "sara_kalbhor": "Tera koi boyfriend hai ?", "niloydas_bengal": "Nice pic", "oneplusome": "if i am ur mother i will ask hw much u lv me", "devendar361": "Wow super", "dimpalbhatia": "How to get rid from acnes, pores , blackheads", "chetnakanwarofficial": "I love you mom♥️ she is awesomeness 🎀", "chocolate_boy_somnath_0101": "Beautiful queen😍😍😍😍😍😍😘😘😘so cute😍😍😍😍😍😋😋😘😘😘😜😜", "babboon_g": "Why the sleeves get shorter", "eva_._collections": "❤❤❤❤", "_.cant_stop_loving_u._": "What abt mohak @sejalkumar1195... He is not been seen in the videos anymore", "aakanksha_choudhari": "Nyc click 👌", "harinichiruvella": "You MOM looks prettier than YOU. Take it as a compliment", "couples121234": "🙌", "rj.qafir": "#follow #f4f #followme #TFLers #followforfollow #follow4follow #teamfollowback #followher #like4follow #like4follower #likeforfollow #like4followers #followbackteam #followhim #followall #followalways #followback #selfie #me #love #pleasefollow #follows #follower #following #love", "prachiti.atigre": "😍", "thechikancompany": "#momanddaughtergoals 😍", "davekalpesh1": "Beautiful picture 💖💖💖💖", "thewoompla": "😍", "__.ta.nia.__": "you luk beautiful but your mother luk beautiful than you", "rajviparekh724": "😍", "vyaparviharcom": "Such me soo sweet...", "the_phoenix98": "Does being a smoker 2 years prior to conception increase the chances of the child being differently abled?", "vinay_7143": "Hello mummy ji", "usernamekyahai": "Who was your first crush and at what age??", "cloudygreen__": "00", "aakankshasharma21": "You have a boyfriend? NAH? Oh congratulations then, 377 is to be celebrated in our family. Haha! As in she would ask if you're a lesbian? (cuz u would deny dating a guy)", "mannat.rajput.9085": "Gud", "prianjali12": "Who is your and your mom biggest inspiration what do you think that what will be ur mom reaction when you cross 1 million", "sonalit_69": "How your mom react when she got to know bout u and mohak popli?????", "mansivpandey": "Got to see this post on my feed after a whole day....wow", "jyotiparna_": "How to treat PCOS naturally?", "varshinireddyy_": "Recreate the moment when u said it mum about mohak", "anshu_bnrs": "1. As u are busy and away with ur mom, does she gets worried about ur proper diet. 2. What is the thinking of our mother's generation about relationships. 3. Due to generation gap how she handles being a mom and a best friend of urs at the same time.", "nidhijoshi18": "How to handle ur daughters stress when she gets frustrated at few times ?", "_poonammaurya_": "If Sejal comes to her mum and say I have a gift for you and no daughter has ever given something like this. What will be the first thing that will come in mum’s head?", "greeshmax_": "The reaction when you tell your mom that you have a boyfriend...", "hiba_kriti": "Reaction of your mom when ppl say that sejal bilkul apne maa pe gayi hai🌸", "ipsitatata": "Besties forever?? ♥️♥️", "shan_marysaji": "Wht are things u want to achieve in ur life!!", "ann_jo8": "Hi sejal when will u get married to mohak love you", "shailaja_pradhan": "Doesnt your mom say you to learn cooking as it might help you in your in laws place? #momandme @sejalkumar1195", "parnikaabansal": "Such a happy picture💕", "prachigupta2000": "What is the biggest secret u had ???????", "thegomegh": "Mother daughter alike 💕", "_.d.h.e.e._": "How is ur mom's skin and ur skin so shiny and what's the secret!!!!!", "divya__v": "What is your actual real purpose in life?", "beiezbae": "So excited about this topic sejal😘love u so much!!!", "tanvvitch": "If u fail while doing something that you love to do and no matter how hard u try, if things don't work for you, what will you do ?", "anshulkumar678": "Lovely duo.", "subhangi_debnath": "My mom wants to ask that how aunty maintains her figure as she is a busy Gynaecologist!", "mendaciousfairytale": "Why do teenagers now-a-days dont share everything with their parents?", "pubgqueenpriya": "Whom will u marry my daughter", "vrjesh_sk": "Nice", "monkeysandonkeys": "Follow @monkeysandonkeys you are going to love it for sure.give a visit and leave a follow.see u there.", "a.woman.of.substance": "Do you have a boyfriend? Moms love asking this question!!", "blissxfulll": "Do you want your daughter to do an arrange marriage or love marriage", "noirnash": "Can't wait!!", "1204_vini": "#MomAndMe episode....to chaliye shuru krte h....Ye raha apka swal apke screen par... What is the one thing that Sejal would like to tell her daughter or childrens as a learning whatever sejal feels...Not like what every Mom does... Something different..👍", "nitinnarain": "Has Ma'am ever expressed concern; how long will the fan following last; as tomorrow, new social media influencers may come & be the new leaders in the business...", "pragnya.kankan": "Knowing about mohak?? Mom and boyfriend meet...?#MomAndme", "rachana.it.is": "What was the experience of bringing up a child like Sejal didi", "hemlata.arora.14": "Lovely mom and daughter", "sunil_sundi": "Firstly, your mother is beautiful. My question is : how a mother & daughter can become a good friends?", "sruthi_2205": "Bring an Indian mom .. what was her reaction on her daughter's first relationship ? Did she accept it ?", "punamstar": "Your mumma is more prettier than you", "shariaswift": "When is sejal planning to get married....That would be funny😂😂", "anishanepal1": "When is sejal getting married? ??", "kthbabyl": "Mom can I marry anyone I like ? Even if he's from a different religion ?", "gurjeet_kaurl": "Lit!!!", "dutta8355": "Wow", "navritichadha": "I think your mom is beautiful than u has better dressing sense than u have.. anyway.. every mom wants to ask her.. what are her dreams so that she can help her fulfill..", "maithili_bopche": "So pretty😍😍", "pinnamaneni_nirupama": "What was the reaction of your mom when you decided to choose YouTube as your carrier.....though you did your graduation...", "priyansh_996": "Awwww..... your mom is much cuter than you Sejal ma'am ...... waiting for #MomAndMe.....", "riiya_palkar": "A mischief or a funny thing from Sejal's past", "ria__kamble": "What should we do if we fail in our lives or fail in board exams", "anchor_alkaroy": "Aunty have you ever Ask Sejal “Beta Roti GOL banana seekh lo!Sasural Me yahi kaam ayega !!!!😹😹😹😹 @sejalkumar1195 I am sorry but most of the moms are concerned abt Roti 🤣", "sassyanushaaa": "Excited 2 watch😘😘😘", "veevamoitra": "Beta, have you done 'it'? 😂", "cuckoo.arion": "One very naughty thing that sejal did as a child", "navyanarayanan_": "Is your mother okay with you travelling solo all around the world?!💞", "arpitakapoor_": "things you should know before making out for the first time", "ashesha_07": "Hey..... U should ask her that is it wrong to have a plan of going out with ur gang to road trip? ( jst random not my situation) + love love😘😘😘", "annareddychaitanya": "Wow", "flying_dutchmen_nadeem": "Awazen awazen", "_rashi_0617_": "What was your mom's reaction when she saw your first YouTube vedio??...btw i love your channel!!!", "sejalites_1195": "Cutiee ❤", "somya_sarwan_": "#MomAndMe what kind of boy u want to get married to?", "digital_ashchrya": "Osm pick di", "_a.nshili": "Yeah please ask her where is mohak😂😂😂we neeedddd to knooooowwwww!!!", "somebody_who_loves_to_cook": "Does your mommy ask awkward questions...Like have you done it yet ..Are you really gonna marry him?!", "ten.little.fingers": "I like Ma’am very much ! She delivered my baby !", "riawanders": "What do you talk about with your friends? 😜😜😂😂", "phebamathai": "Where do you want to see her in next 5 years and how do you think she can bring a change in others life?", "sohini_singha_roy": "How was ur mom reaction about ur relationship?", "ajjan_sukh": "Does ur mother like mohit!!! When she met for the very first time", "amritaa.sandhu": "When was the first time you got into a relationship and have you ever hidden a relationship from your mother?? Hahah I love you by the way🌹❤️", "p_rao007": "What happened between you and Mohak?", "misss.surbhi": "Cute she is!!", "harshita163": "What's your mom's reaction knowing you are in a relationship?", "aananyakhatri95": "Did you ever got physical with your boyfriend? Or when did you had your first kiss?", "_shhhhnyaa_": "You are so lucky didi having a mother and most importantly she understands you and cares you ....congratulations diii", "aditi_.20": "Ask her what was her reaction when u told her abt Mohak for the first and also when she met him for the first time", "iamyashaswini": "Would your mom want you to be a doctor or anything that u want to choose", "mad.kc": "👌👌", "mitaleesharma": "At age 21: What do you see in THAT boy? Why are you with him? At age 27: What is wrong with this guy? Why don't you want to marry him? #TrueStoryBro 🤣", "olive_branches_photography": "Every indian mom asks to her daughter , '' do you have a boyfriend''?", "pujan7500": "As good as ur mom 😍😍😍😍😘", "bebodelicious": "How does your mother feel about you travelling alone? Does she keep checking on u? Does she come for the 'company collaboration' meetings? I'm asking this because of the recent news on a usa travel blogger @travellight21, the mishaps that happened in India!", "nehal_1385": "What is the best thing that you are proud of your daughter", "basutkarshreyes": "U dont look beautiful. . U just add lot of make up on ur face to look so and get more likes and follows", "ffahadsalmani": "No offence but your mom is still beautiful", "simply___delight": "How does your mom reacted when she got to know about you and mohak ?", "rush78__": "I just want to say your mom is so beautiful💞💞", "s.o.u.m.y.a.___": "What is your best moment together???? @sejalkumar1195 . Want it in detail!!!", "dinesh_2255": "@sejalkumar1195 how was sejal when she was small and had she ever made you fell akward", "shivanni1": "Why you want to do your graduation out of your hometown", "rhea30._": "When did u get Ur first period?", "sneyhalkayy": "Are you open to talk to her about mohak", "sshreyaghoshh": "Your mom's hotter than you.", "nandini_kusam": "Every docter wants her child to be a docter , isn't u r mother ?", "kulkarnianjali05": "Love your mom sejal❤️ and you too❤️she reminds me of one of my favorite teacher from school! So here is the question - Kahan ja Rahi ho? Lab Tak ghar aoge? He he😀 these were very frequently asked questions from my mom 😀!", "bhoomi_raheja": "HOW DO U FEEL FOR UR DAUGHTER.. AS SHE HAS BECOME A GREAT AND A SUPERB YOUTUBER AND WORKING WITH MANY BIG PEOPLE????? 💕💕💕💕💕💕💕💕", "parijat_dt": "Cooking skills of our daughter? 😌", "deeksha__manjunath": "your mom is prettier than you!!", "keerthanachandrasekhar": "When are you moving out? Wait. ..are you moving out? @sejalkumar1195", "a_shenoy30": "*beta thum kab badi hogi*", "jyotsna_shadesofgrey": "Sejal mom wale series apke best hotel hain", "rahulkumar17091": "😍😍😍😍", "that_silly_gurl_": "What was your mom reaction when you choose YouTube as a career?", "aaakashvermaaa": "Trust me. You're the cutest❣️", "bhartikalsotra": "Being an indian mom ..what was ur dream son in law ..i mean like what u though his profession to be ..indiam moms are really caring about there daughter's future", "fati_mukadam": "Hello ..lots of love to the coolest Mom and daughter jodi ..So my question is that as far as I picturise moms they definitely are a little conservative abt their kids especially daughters ..so what is that point of trigger for aunty ? Or is there any ?", "shubhangi_kodag": "Was it easy sejal doing her youtube ? What the reaction when sejal said she wants to youtube ?how family gave her support?", "prantikadutta1997": "Knowing that you have been in a relationship for so long, has she ever raised any question on your sexual life? If yes, then how did you face it?", "ananya_sahoo_24": "Has this ever happened to u like when u call sejal.. she is in front of u within 3 calls bt whn she calls you.. u r not there even after 10 calls... plz ans as this always happens with me...😂", "pariarora1107": "Did you ever stop sejal from bloging and wanted her to do something else ?", "prapti1607": "When are you getting married?", "jahnvi_2733": "@sejalkumar1195 what’s her reaction when someone says:- ohh! Aap to sejal ki mom ho♥️♥️ plz do reply", "ishiiitaaa.7": "Are you a virgin 😂", "surabhiperiwal": "Aunty is super cute !! 🤗🤗", "0.muskan.0": "What was the feeling when you went to the college for the first day?", "sharvani_m": "Is ua mom worried about you when you travel solo to different countries? Did she ever stop you from doing that?", "anmolbhatia_\nVerified": "Verified", "meghna_menon_": "Does your mother ever wonder if you're sexually active", "annu.tinu": "how to ask something without asking directly to the children?😊", "patelketan99247": "Nice", "olivegreen_girl": "Did your mom serve in the army medical corps?@sejalkumar1195", "farheenshaima": "❤️💓", "the_strange_evilll": "Whts relation between ur mom n mohak??", "xynalee": "Please do an another video about health", "reluctant.teen_13": "Would you leave your YouTube career for your mom if such situation arises?", "kumar.alok.5055": "💕", "tannuushkaaaa": "What do you think your daughter does in her free time???", "anisamaity": "Lovelyyyyyyyy💟💟💟💟💟💟", "anubhuti.tyagi": "so cute 🌼🖤", "iamshaambhavi1995": "Hey @sejalkumar1195 Big fan of yours plz upload videos more often waiting eagerly for this one", "kumbhakarna.rises": "@sejalkumar1195 - how does Mom feel about the bond you'll share now as opposed to when you were younger? How have things changed for both of you? 😊", "nishakashyp1997": "😊🍁", "bkrittika": "Would you have accepted her if had some other sexual orientation?", "utsavi_008": "What was her first reaction when she came to know about you and mohak(basically about your bf) and what she asked and talked with you??", "aahna_108": "What was your first opinion. When sejal told u that she want to open a youtube channel. Love you❤️❤️❤️😊😊😊", "kanishka.mlk": "Does Ur mother has ever made u feel worthless or useless!!???", "ariachoudhry": "Such a pretty duo. 😍", "ankitaj99": "Mom's crushes back during colg days.", "pasitheamagazine": "There's a saying, \"Like mother like daughter \"how much of that resonates with ur life @sejalkumar1195", "yffdsfc": "Make a video on cheap places to eat in Delhi!!!!!!!!", "bhumikasutariya95": "That one thing which she loves about you and one thing which she doesn’t ? @sejalkumar1195", "reusily": "Adorable ♥️", "x_._rishu_._x": "Does Sejal buys ther clothing with her money!! Or her parents money??😘", "farida_rahaman": "😍", "dr.n.s95": "When will you get married @sejalkumar1195", "himanshijindal07": "I don't know parents would like to know about their kids physical life and how many times they have done it. I think parents would give them space instead of asking those questions. I don't know why some comments are about that only. Anyway mother always want to built a friendly relationship with their kids so I think questions would be 1) have you ever felt there is generation gap between us? 2) do you feel comfortable in talking about problems related to anything (physical life, relationship etc) with your mom? 3) why do you still feel that \"JOY\" shouldn't be your nickname and what nickname will you choose for yourself if given a chance? 4) do you feel sad when your mom isn't able to give you time because of work ? Lots of love to sejal and Auntie. 💛💛 Have a good day 💛💛", "a14muskan": "What's the biggest lesson given by ur mon?", "mistchic": "Nice😍", "padmaprabha99": "Have you ever had sex?😂", "asenseofaisha": "What was Sejal like when she was younger?", "arani_saha": "Tbh ,Everytime the videos I have watched of your mother so far , always ignite my inner soul to become a doctor like her. Even I wanted to be a gynecologist like her. Looking ahead to watch more videos of her 😊", "iffat_shabi": "@sejalkumar1195 what are your mom thoughts on you marrying mohak?.", "samarudhii": "How to ask your daughter about sex education", "ameytummawar": "💚💚💚", "dhayanipandya2039": "Nice looking", "sanju7april": "Beautiful 🌸god bless you", "jeevankumarvishwakarmav": "Very Byutiful pictures Sejal ...", "varunkumar28383939": "where were you last night", "kutty123kutty": "When are you getting married? And How is Mohak doing? Why isn't he in videos anymore.", "mishthaa._": "The most amazing memory of sejal in her childhood", "patel___riyaa": "Why a mother is more afraid to know that her daughter is in relationship or not ?", "uhaa_2000": "In what time Sejal was born", "ushmaaneja": "Mom's permanent question: why don't you sleep on time?", "achallll": "If not you tuber what would u wish that sejal should be in her life😃😃", "fortunately_sane": "Can u manage urself in absence of ur mom", "mr.____nrp": "So looking beautiful", "adibantai": "I'm sure every mother wants to ask her daughter if she is having sex and whether she uses protection. It's a major concern for most parents.", "kruthikaa_03": "👩‍🏫 If you had the chance to be the teacher tomorrow, what would you teach the class?", "__skp9920__": "What was ur moms reaction when u told her about ur's and mohaks relationship?", "arpith_shekar": "Tell me about mohak and about your love with mohak???", "nish87_._": "She's so prettyy💓", "ishanvi_28": "How your mom react on your frist period ❓Tell your period story .... Plzz", "dr_rajeshwari_nikhil": "Every mother want to ask her daughter about her Relationship status.....", "aishna_k": "Shaadi kab krogi?😂", "__.yogeeta0711.__": "What was ur moms reaction when u introduced mohak to ur mom...", "grahe7716": "Mom: Do u drink 😮?? y r u moving out @ n8 ?? Can I join u beta😂😂", "fiaz_gul_khan": "Good", "style.with.shakshhi": "Kuch galat toh kaam nahi karri na (if you know what i mean) Kahan gayi thi aaj tu?? College bunk maari kya?", "priyapeshawaria": "Chahe kitni b tarrrakki krlo ghr ka kaam kisise karwane k liye b tumhe khud ko wo saara kaam aana chaiye", "vasthiammu": "If sejal was not a youtuber wt would be she.....", "mrpmuzik": "Tumsay to jada pretty aunty lag Rahi hai ☺️ @sejalkumar1195", "shubi1591": "You and your mom!! <3", "devina_dini": "Also do one video with ur mom about choosing the right BRA and their efforts on health and bursting some myths about it. I think it is very important for a Woman's health..and this topic needs real guidance from a doc. Also this is my favourite series of your @sejalkumar1195 #MomAndMe", "asmi98": "Is there some secret or a confession you would like to tell it to your mom?", "deepa__gaikwad": "Your mom is the best @sejalkumar1195 !!! I love watching her on screen..", "askim.goel": "Have you sneeked out at night/ lied about going for a sleepover, and went somewhere else?", "guptaditi11": "Hi sejal, I have always felt one thing whenever I have seen you and your mom together, she is so so proud of you and I feel she is so much in love with you, her every expression, her way she speaks to you..", "ojasvinaik13": "What did aunty feel when you introduced her to mohak?", "_surajita": "Are you ok with Sejal having a boyfriend?", "rathna4320": "Is there anything that u wanna tell me but ignored yourself frm it ? Pls ask this question im a big fan of u", "shraddha_jaidev": "What is the right age to start dating someone?", "shwetakumari.30": "What are the things that you did in college like sneaking out at night or going to boys hostel but haven't told me?", "maryyy.i.am": "What's life after marriage like? Tips?", "walk_around_the_world_": "🙌with mom keep your smile forever !!", "sanjana_1611": "What's the best thing about sejal?", "sonza0324": "How is ur mom OK with ur relationship with mohit?.", "thats_me_khadi": "Beta section 377 k bare me Kya khayal h tumhara 🤓", "priyasen01": "I love you like crazy @sejalkumar1195 🌻.. all of your videos are love 💓💓..", "neena_emil": "Being a doctor herself, and also being a good student yourself, has your mom ever gave you an incline to be a doctor?:)", "manali.shitole": "#momandme Mom asking - \"Sejal when was the day you needed me the most but I couldn't be there maybe because I was working or otherwise. But you overcame problems and became a stronger.😁😁🤛💪#indianyoutubber", "fifiisunique": "Your mom is beautiful than you", "last_mile_krafted": "How to believe in your child if he or she comes with an idea of being fulltime youtuber right after the college and the parent doesnot even have much to supoort financially.. youtube is such an unknown space for any parent..and one can never be sure how much will it monetize in future and whther or not ur child wll be able to make a living out of it..so any mother would definitely ask the child are u sure abt being a youtuber..", "ismailms_007": "Your mother looks more pretty than you😄😄", "anagha_mandhare": "“What is the hardest part about parenting and what does she do to tackle it?” I would love to know what she has to say about that!", "krishashresthaa": "Who's the better Cook among you too?", "tinkysapra": "A trick by how we can easily communicate with our mother about everything...like school, friends, society,etc...@sejalkumar1195 plzz di tell me the answer in your upcoming video with Ur mom...luv u😘😘😘😘", "shreyaverma9694": "Your mom is sooo beautiful....You are a little faint in front of her", "shreyyaasingh": "#MomAndMe Have u been in an intimate relationship ?? If yes, how many and how intimate? This is something every mom wants to ask her daughter but doesn't because of awkwardness.", "deekshachakraborty": "Okay so my question is not about Mohak so chill. It is that how do mothers introduce you to pregnancy and stuff like for giving a hint to.their kids?", "_sharletpeter_": "Have you ever signed your result as your parent or made someone as your parent for attending PTM😁👅 @sejalkumar1195 👏", "drzainab_988": "😘😘", "__nazma_": "@sejalkumar1195 your mom might ask when you will learn cooking..? 😁😁", "nupurr_0609": "What was your reaction about @sejalkumar1195 wants to do YouTube 🤔", "ssharmaxxvii": "Wow...it will be fun..", "_palguni_gowda_": "Don't you feel that you're getting moti??😂😂", "vyshnavi_meda": "Hw did she get to know abt ur relationship ? 😂", "kishori_priya416": "Did ur mom anytime asked u, wat u wanna do in career...r she left it to u do watever u like", "spoonfulhealth": "How she introduced you to period ?", "_.undiscovered": "Are you taking your meals on time? 😁", "itrik.082": "Why don't you clean your room or cupboard?", "_.snehasharma._": "What is parent dialogue your mom use to say to you when you did something which is not appropriate??", "trishpearlz": "What are the things Sejal is expected to be doing once she gets married?", "_iambelli": "When are you getting your daughter marry?? 😝😂", "beyondhercurls_": "Can I check your phone?", "shivali.khurana": "Ur mom is ooozing grace.", "somashri5674": "A indian mom would always want to ask her daughter ..many different questions about your boyfriends family ...when you tell her about him . Like how many siblings , what does his father do where do they live and all that . But all they wanna ask is \" Do you really plan to marry that boyfriend of yours ?. \" it is as if she is ticking on her checklist for her prospective future groom . she thinks we cant make that out but we can and its really funnny .", "_awmtei_": "Can you please play the game 'never have I ever'????", "hhju7tnbj": "Mom: u were so small when did u become so big?", "yashikagurung": "Suchaa smart mother-daughter duo👩‍👧💗", "ritu_kumarr": "Is is really worth going after people and caring for them even if it is going to ruin you forever?! #extremelycheeasyyyy still wanna know.", "_akash.vats_": "Sapne me raat ne aya.. ho.. Sapne me raat ne aya murliwala ri Mere dil mein bas gyo shyam jaapu mein mala ri.. Mere dil mein bas gyo shyam jaapu mein mala ri.. Vo bola sun meri radha, mein tere bina hun aadha Meri banshi tujhe pukare aa mein daaudi yamuna kinare Vo bola sun meri radha, mein tere bina hun aadha Meri banshi tujhe pukare aa daaudi yamuna kinare Mujhe guaall baal mein pyara.. Mujhe guaall baal mein pyara krishn gopala ri Mere dil mein bas gyo shyam jaapu mein mala ri.. Mere dil mein bas gyo shyam jaapu mein mala ri.. Vo jhule kadam ki daari mein sangh me jhulaan vaari Rang rashiya shyam murari kare meethi baatiyaan pyaari.. Vo jhule kadam ki daari mein sangh me jhulaan vaari Rang rashiya shyam murari kare meethi baatiyaan pyaari.. Jaadu sha moo pe karata Jaadu sha moo pe karata vo naandlala ri Mere dil mein bas gyo shyam jaapu mein mala ri.. Mere dil mein bas gyo shyam jaapu mein mala ri.. Mera haanth pakad key dole nainan ki bhasha bole Mein ho gayi shyam deewani mohe de gayo khash nishani.. Mera haanth pakad key dole nainan ki bhasha bole Mein ho gayi shyam deewani mohe de gayo khash nishani.. Mera kho gayo khelan mein Mera kho gayo khelan mein kaan ka bala ri.. Mere dil mein bas gyo shyam jaapu mein mala ri.. Mere dil mein bas gyo shyam jaapu mein mala ri.. Vo natkhat nannd kishora chaliya gokull ka chora Sapane mein aan satave phir chain mujhe naa aave Vo natkhat nannd kishora chaliya gokull ka chora Sapane mein aan satave phir chain mujhe naa aave Mere man ka kamal khilawe Man ka kamla khilawe shyam gopala ri.. Mere dil mein bas gyo shyam jaapu mein mala ri.. Mere dil mein bas gyo shyam jaapu mein mala ri..", "sirisamba2007": "How was u r moms feeling when became a star you tuber 😁😁😇😇come on now you r the best you tuber in my subscription 😆#momAndme", "thehumblemusician": "Is there anything that your mom doesn't like about you? Is there any habit of yours that your mom wants you to change?", "the_rachitasharma": "What your mom thinks about mohak??#asksejal @sejalkumar1195", "ms_rdey": "If not an youtuber what did aunty wanted you to be?", "nishthaaa02": "Whats the common outfit that you and mom love to wear😘", "spamac_______": "@sejalkumar1195 When is the Season 2 of Engineering Girls releasing ??", "abhishek_this_side": "❤️❤️❤️❤️❤️❤️for u @sejalkumar1195", "charitha_cherry96": "Biggest tiff u and Ur mom had ever???", "fatema_.rajkot": "That how sure or unsure you were while starting something like YouTube... N how quick did she trust on you for this?", "smaranika_is_the_name": "Hi sejal😊 my question is \"Is acne couse of hormonal imbalance\"?????", "rainamesina": "what are things that you love to do together and with nobody else?", "gitanjali214": "How many purposal you got when you were of my age?", "dorksideindian": "Where does your mom get her saris from tho", "_sushhhhant_": "She looks like your elder sister", "pratiti_mohapatra": "Hi @sejalkumar1195 I am pratiti a student of class 8 so every mom wants to ask her daughter that \"are you in a relationship and who is that boy\" please answer my question please please please😍😍I love your videos", "_notinterested_____": "How did your mom react when u told her about your boyfriend", "_mi.nion_": "\"How do you feeel being so popular in you tube also how do you manage your fans love?! \"", "gunitatuladhar": "Mamu choru🌹", "sweetyy__012": "My Question Is That Is Your Mom Strictt That Uh Have A Relationship With Mohak Or Like A Cool Mom She Is Happy With It ..?", "shwenapatwari_9794": "#MomAndMe# i wanna reduce my breast they are too heavy and saggy can help me with proper bra and solution is there any cream too reduce it", "happybloggerz": "Hi, how your mother handles everyone who ask about your relationship ??", "apsana_chaulagain": "Does your mom shouts at you for not cooking food properly?😅", "sabinaminoz__": "#momandme what is sejal's most annoying habit???", "_aditi_gupta_45": "How are u dealing with heart breaks", "naina_khosla": "@sejalkumar1195 favourite TV vamp on Indian tv", "_flying.phoenix_": "Does your mom know about your boyfriend?? If yes how does she feel about it??🙈🙈😂", "ashleenhora": "Mom - do u have a bf? 😛 Why u wear short cloths? Why don't u have more girl friends? Is usually what my mother would ask!!!", "bhaviexpress": "How your mom being a gynaec, introduce the concept of good touch, bad touch and sex??? I am having a cousin sis who is 12 yrs old i want to introduce her with these topic hence pls do take this question.", "dhairyaa__jain": "Mom* sweetie! @sejalkumar1195 😇", "shreya_bhokare": "#MomAndMe the one thing you luv doing together..", "manishikachaurasia": "Love Aunty's sareee!❤️", "mumbaiperfume": "What are you doing with your life? Like seriously when do you plan to settle down!!", "harika_nidadavole_": "What was your feeling when u introduced mohit to your mom", "julietisfunny": "How can parents and kids have an honest an open relationship? 🙂", "quotesbyastha": "That will be amazing! Waiting✨", "prettylilmakers": "Does sejal wear all the clothes she purchases? Or is it like 'beta ye wala top jo tumne khareeda tha last month, abtak pehna hi nahi'", "sriii.dange": "Is there any secret that you have hid from your mum?! @sejalkumar1195", "reddy_varsha": "How did your parents meet ?", "mouma_banik": "She's so pretty 😍", "crazykhyati": "Mother😂", "sej_kaushik": "Describing your mom daughter relationship in 3 words", "aneri.khristi": "Whats mother's expectation from daughter?", "tani_am_i": "ur mom looks like zeenat aman", "mugdhagupta18": "Hey Sejal..I just realised that ur mom and Prashasti Singh from Comicstaan look so much alike 😳 @sejalkumar1195 @prashastisingh @comicstaan @tanmaybhat", "g_saluja.173": "When will you get married? Every mom's favorite question 🤦", "ananya_2163": "Does Sejal eat food at only home ? Or does she keep eating or ordering outside food? 😂", "champagne_kamal": "Love u Sejal didi", "anordinarygirl__": "💞💞💘@sejalkumar1195", "prachi.bhardwaj_301": "Mother*", "siddhikhuranaa": "What is the most embarrassing moment u ever had when I was not there with u", "rajoshree_bose": "Every *mother", "antrapatel_": "So pretty", "sravanthisrivatsa19": "@sejalkumar1195 the greatest lie you have told her."}