{"simply__snazzy": "@messyfille", "mementoofshadesphotography": "@komalpandeyofficial ❤️", "lil_miss_cuttiee": "Pls answer my question ...I m asking for months now ...my question is ...when Komal will do a Collab with cherry ...pls answer...biggest fan of both of u☺️☺️", "soniyathakur6964": "How you both started your YouTube channel who was your inspiration plse tell me mam I am your Boths very big fan", "ssssangeetakumari": "❤️", "thewoompla": "😍", "jatinnnnn12": "What are your favorite Victoria secret models ?", "rashmi0651": "Sooo preety", "narrysidhu": "❤️", "itaintneww": "Look the phone on komal's lap😂 (zoom it)", "neha_21_04_sharma": "Plzz tell us about your relationship status with Mohak....is it on or off?", "sax.2203": "Since how many years are you both friends", "________always": "When will you meet with us..your subscribers?🙌", "snehamai_parsha": "Why did komal leave popxo", "pariarora1107": "how and when did you guys meet and what kept your bond strong toghther", "d_iconic_pro": "I want to see both of you to dance in a bolliwood song 😊", "annteresajoseph": "Who your favourite youtuber, Sejal", "ae_st_et_ic_s_": "Who is your favourite youtuber?", "lovey30_": "Ur bond??", "isakshi.d": "Which is yours best memory together?", "daliageorgx": "Who do you think will hit 1 million first? 😂😂😂🔥🔥🔥", "dudejas97": "Do you agree Sejal that Komal has better skills than you when it comes to makeup and dressing?", "rajashreee_": "Are you single?", "__aishwaryasmruti__": "Future plans...", "teena.shreshtha": "Two fav's in one frame! ❤🔥", "into.my.wardrobe": "I am soo bloopdy interested in fashion and want to pursue something related to it. I mean I like clothes and to revamp and style them and all. So any ideas ?? I am kind of scared because of what people will say. I mean for me I want to wear clothes that I like but people judge and I don't know what to do", "dx_badboy": "Super Gorgeous u2😘😍", "jane4jesus": "How did you prepare yourself to start a new channel on YouTube?", "chandrika_thapa": "Weird moment...??", "xx_harshini_2005_xx": "How long are u both friends and how did you meet ???? BTW I love u guys a lot", "anutanwar2": "❤️❤️", "madiha.4": "Hi i wanted to ask that how long u both have been best friends best wishes for both of u from madiha plz do see my comment", "diva.deeya": "First of all, what’s wrong with everyone asking about Mohak.You have already talked about this , when the time is right you will share the info . Hats of to you for handling these questions , I would have lost my sanity by now .Good lucks girls , you are going great .More power to you 😘", "pa11avisharma": "How can u start changing my wardrobe , i am workinh in MNC. Pls.post related to what to do smart shopping for", "_debanjana_01": "Love you both a lot 💗", "teenagers_fan_club": "Please take my name in the vedio my name is harshitha. Biggest fan of you both", "s.h.a.m.i.k.a_": "hey sejal and komal....guys please make a video on everyday make up and dressing for college girls..", "sakshishah031": "Who is ur fav youtuber", "neeraj.kumar4021": "Badiya", "jhalak_dhameja": "Why don’t you guys sing together?🙌", "riyagirme": "How did u both become such good friends", "helloomrrdjj": "I can see Komal sending you the selfies on WhatsApp 😂😂", "thattwingal": "How have you guys saved each other’s name in your respective phones", "shalinisrivastava2204": "What's your guys nickname", "prishaaa.__x": "Can u have a dance or makeover workshop in Surat I love u Sejal doing and Komal dii pls answer my question I love u call me prisha", "riya_jeph": "What made u come together?", "whobhavya": "R u good at drawing", "amann.shuklaa": "@sejalkumar1195 @komalpandeyofficial where would you guys see yourself if not on YouTube", "pen3162": "🖤", "mishrayashoda": "Sejal and komal what do you do with so many clothes that you buy??😁😁", "_ihatelovestory_": "How did you guys meet?", "nandini4343": "So you guys listen to one direction", "ddipshidas": "😍😍", "ishakaurkohli": "Don’t you guys ever get competitive for each other such that it effects your friendship?", "verma.aayushi0606": "Komal pandey", "simran.j28": "How did u both met and what was ur impression about each other", "rishitab3": "what does sejal have and komal does not and what does komal have and sejal does not?", "geetasohal": "A very big small fan....this is my mom's account.... please do a dare or make a confession", "bidyashree2000": "Is there any chance competition comes before friendship in your work field?", "pinka.__": "How much success you want till you both gets married?", "fayiqgoroo77_": "You look good", "aishu_1903": "Hey, how do you get confidence to carry off anything?", "fizzyfaiza": "If there is one thing and you both want it who would be the one jo compromise krega..", "thepastelgoth_": "Can you do a style swap for a week challenge ??", "itzmehira_": "Did you gave komal the idea of starting hwr own channel. As is evident from the coincidences which lead her to leave popxo...", "roshni_583": "How did u guys became friends?", "shahshikha2002": "How did both of you’ll become friends?", "muggle_fashion": "Such a cute shot!!", "shabdita_deedwania": "From past few months you and mohak didn't do a video or upload a photo together .....I love you both..please let us know...did you break up ?", "khushali.ray": "Hw would you help a girl wanting to open a YouTube channel ..... do uh think uh nèed to help ??", "niviishah78": "How well you know each other- 1.Tell each other’s birthday 2.Fav food 3.Fav colour", "ritu._28": "Ap dono frnd kese bane?", "iamsaumyazaidi": "Do you plan to get high together sometime?", "avniverma17": "@hardikrastogi09 I believe now you'll not say Indian YouTubers can't afford a very good camera lolz", "kavya.nagpal.5059": "How did you and Mohak met?? Please tell. I love you both so much ❣❣❣", "_nehalbhardwaj": "How did you guys become friends?", "aayutekani": "How many pics did u both clocked during shooting this video of URS??😉❤️😛 #collab", "ridiculously_rida": "This question is for both of you. Choose one: LOVE or FAME. Also explain, why you choose love over fame or fame over love?", "g.avni0303": "How you both met up??", "toqeer5627": "Beautiful", "bhavishaasurti": "Which phone does she own can anybody tell me", "ivismalik": "Both of yours ages n height?", "_ayushi_dang__": "Are you and mohak still dating?", "ritikagoswami7": "Hey u guys are my favourite you tubers. I follow both of you from the very beginning. I follow Komal since the early popxo days. You guys are doing a collab is very exciting. Just i wanna say that i love u both and not really a question i just want komal to sing a song and sejal playing the ukele to it. Its just a request. Would feel quite glad be if u guys can manage to keep it. Thanks. Sending loads of love from Kolkata 💓❤😘. #collab @sejalkumar1195 @komalpandeyofficial", "ruchiluvs": "where is mohit these days?", "_sadia_faridi": "Best skin care product that you both swear by", "kavya_reyan": "What are the lip shade that u both r wearing currently...I mean in the picture", "etashuchhabra": "when you both gonna meet me .. Love u both", "pujatammang": "Do you like momos ? 😀", "txnishax._": "Heyy Sejal Didi and Komal Didi!!! I love you both to the moon and back and you both are my favourite YouTubers...seeing your videos literally makes my day!!!!! I want to ask that what crime have you both done together???!!! Please please please answer my question in your video and tell your viewers to follow me on Instagram...LOVE YOU'LL LOADS!!!!!!!!!!!!!!!!💗💗💗💗💗💗💗💗💗💗💗💗", "vidushishuklaa": "both of you tell your first period story plzzzzzzz", "urvashiiibhandari": "Hello sejal ! Well everyone of us knwz that you have done your cllg from Srcc and as well u r a all rounder girl who does everything apart from this I really wanna like to knw what motivated u to do blogging? And how did u started that", "sakshi_670": "Ever thought of going in bigg boss or any other reality show ??", "anusharaom": "Tell about your startups....in youtube", "namitha_mariya": "Komal your WhatsApp on....", "vaama.bakshi": "Ans one thing each u like and hate about both 💜💕btw luv u both ❤️🙌", "model_akash_koli": "🌼ℒℴѵℯℒy ⚘🌼Nices🌼 Beautiful🍀 🇳💟🇮🌷🇨💚🇪🍀 🌼ℒℴѵℯℒy ⚘🌼Nices🌼 Beautiful🍀 🇳💟🇮🌷🇨💚🇪🍀 🌼ℒℴѵℯℒy ⚘🌼Nices🌼 Beautiful🍀 🇳💟🇮🌷🇨💚🇪🍀●—●—● 🇸🇺🇵🇪🇷 .•°``°•.¸.•°``°•. ( Nice ) `•.¸ 💞 ¸.•` ° •.¸¸ .•° 🇼🇴🇼 ☔ ┊❄cute ┊┊☔ ☔ ┊❄sweet ┊┊☔┊┊┊ ☔ ┊❄fabulous ┊┊☔ ┊┊┊ ●—●—●—● 🇸🇺🇵🇪🇷 .•°``°•.¸.•°``█▒▒▒▒▒▒█🍃Lòvèĺý✨ █▒▒▒▒▒█🍃Lòvèĺý🌹✨ █▒▒▒▒█🍃Lòvèĺý🌹✨🔷 █▒▒▒█🍃Lòvèĺý🌹✨🔷 █▒▒█🍃Lòvèĺý🌹✨🔷 █▒█🍃Lòvèĺý🌹✨🔷 ██🍃Lòvèĺý🌹✨🔷 🌼ℒℴѵℯℒy ⚘🌼Nices🌼 Beautiful🍀 🇳💟🇮🌷🇨💚🇪🍀 🌼ℒℴѵℯℒy ⚘🌼Nices🌼 Beautiful🍀 🇳💟🇮🌷🇨💚🇪🍀 🌼ℒℴѵℯℒy ⚘🌼Nices🌼 Beautiful🍀 🇳💟🇮🌷🇨💚🇪🍀●—●—● 🇸🇺🇵🇪🇷 .•°``°•.¸.•°``°•. ( Nice ) `•.¸ 💞 ¸.•` ° •.¸¸ .•° 🇼🇴🇼 ☔ ┊❄cute ┊┊☔ ☔ ┊❄sweet ┊┊☔┊┊┊ ☔ ┊❄fabulous ┊┊☔ ┊┊┊ ●—●—●—● 🇸🇺🇵🇪🇷 .•°``°•.¸.•█🍃Lòvèĺý🌹✨🔷 █🍃Lòvèĺý🌹✨🔷 ██🍃Lòvèĺý🌹✨🔷 █▒█🍃Lòvèĺý🌹✨🔷 █▒▒█🍃Lòvèĺý🌹✨🔷 █▒▒▒█🍃Lòvèĺý🌹✨🔷 █▒▒▒▒█🍃Lòvèĺý🌹✨🔷 █▒▒▒▒▒█🍃Lòvèĺý🌹✨🔷 🌼ℒℴѵℯℒy ⚘🌼Nices🌼 Beautiful🍀 🇳💟🇮🌷🇨💚🇪🍀 🌼ℒℴѵℯℒy ⚘🌼Nices🌼 Beautiful🍀 🇳💟🇮🌷🇨💚🇪🍀 🌼ℒℴѵℯℒy ⚘🌼Nices🌼 Beautiful🍀 🇳💟🇮🌷🇨💚🇪🍀●—●—● 🇸🇺🇵🇪🇷 .•°``°•.¸.•°``°•. ( Nice ) `•.¸ 💞 ¸.•` ° •.¸¸ .•° 🇼🇴🇼 ☔ ┊❄cute ┊┊☔ ☔ ┊❄sweet ┊┊☔┊┊┊ ☔ ┊❄fabulous ┊┊☔ ┊┊┊ ●—●—●—● 🇸🇺🇵🇪🇷 .•°``°•.¸.", "meenal_modi_9": "How to prevent frizzy hair..? @komalpandeyofficial @sejalkumar1195", "vishrutimishhra": "How did you score 97.5% in 12th?", "jagriti281": "Hi sejal Di and Komal Di . wanted to ask to a very simple question to Komal Di that why did u leave popxo and sejal Di what is education qualification pls answer my question as it is my birthday today", "mohit_choudhuri": "So did u both paid tax to government to look that much beautiful effortlessly?", "hemamalini.srinivasa": "you like math or science", "_k.e.s.h.r.i_": "From when are you both knowing each other ? Tell us about your friendship ? I love u both and please make recents collabs because I love seeing u both . are my idols💓💃😘😀😍☺️️", "itsme_sanchitaa": "please make a video on how to do simple makeup for teenagers for festive season", "anish_dk_khan_officiallll": "😍", "0417nikku": "Favs in a frame😍❤😍😍❤", "anjali_sree_": "When will you guys do a 2000 rs sarojini nagar challenge??havent seen the same for long...", "kumavat.anita": "Who is your inspiration.????", "divya_17122004": "Is there any situation when you wanted to leave youtube.....if there when (question for both)", "satyavathimathukumilli": "How long are you friends", "ananya_036": "Which outfit do you prefer the most indian or western", "janane_raj": "@sejalkumar1195 @komalpandeyofficial tell us about 1 behavior or trait wich yu girls find annoying about each other..??", "gopalbaghla": "Are komal and you best friends?", "avni084": "1 thing u learn from each other", "_ishiiiiiiiiiiiii": "I want to make a video with u guys!! I am good at acting and wanted to know if u would take me..??", "nobrainerrrrrrrrr": "How did u both become friends????😎😎😎😘😘😍😍😍😘😘😘😍😘😍🤗", "sriii.dange": "Were you both jealous of each other any time secretly 😜 @sejalkumar1195 @komalpandeyofficial", "anjaliirohra": "@sejalkumar1195 Hey! Sejal firstly i tell u ypur dressing sense is like woww💕🔥🔥 and my question will u come to my home like in ur video u have surprised your suscriber will u come to my home??", "inoor_765": "Where did u both meet ?", "d.r.u.t.h.i_rao": "How did you meet", "aaseeyajalilkhan": "What keeps you motivated all the time and what makes you come up with good ideas?", "preethiv_17": "What are your favourite web series??", "groupofword": "define Love💖", "jiyaasompura": "Why don't you both together do the boyfriend tag ?", "_bhuteko_chiura__": "Its been long that u hvn't done any video with mohak?", "pineapple__pizza__": "Did you ever go on double dates?", "dutta8355": "Wow", "theaakankshasingh": "How do you handle social media creeps?", "pequena.poetisa": "If you both could swap each other's life for a day what would you do ? And also loads of love to both of you from kolkata ❤", "businessjewellers": "Sejal are you still dating mohak", "meghagupta0008": "When and where do you meet first time?", "vaishnavi.yelisetti": "When did you guys meet?", "hitashi_raizada": "What was the most embarrassing moment of yours from school days??", "apeksha.m": "Sejal what happened with mohakP", "ratenovels": "If you are to wear same type of outfit for 15 days. What would it be?", "prachisaxena2201": "Have u guys ever made ur bf jealous?😆🔥", "01bhatia.muskan": "what was the first impression you formed of each other after seeing one another for the first time???", "meene_15": "The weirdest thing which has happened to you?😂❤️", "savita_gilbile": "Whoes urrr bestieeee", "its_vidhid": "What about your first impression", "yourbadbabe_": "And love to both of you 😊", "mustufa_2": "Looking so sweet smile", "sonali.08": "nice", "kairafanclub.love": "Guys wats ur relationship status if uh don't mind😅", "splendid_crafts_giftshop": "Tell us about each other's best quality by nature", "tonushree108": "Tell about mohak", "_sweetygupta": "How beautifully can You describe Your Friendship In Just a Word? @sejalkumar1195", "zarafmirza": "your biggest fear? mine is definetly heights! btw love ya <3", "sudhipa": "My favourites @komalpandeyofficial @sejalkumar1195 💖💓💓😗", "simple_basic_living": "Make each other look like the other. Makeover challenge", "ayushkumar56201": "So cute pic 👌👌", "arch_diy_ideas": "Can't wait to watch the video...💝💝", "_lahasya": "Do u like zara or h/m??", "theporifera": "How do try old clothes with new styles", "the_cha0tic_s0ul": "How u always manage to get look so elegant ... perfect for any occasion? I want to possess same green red lhnga choli of yours can you please suggest something where can I buy that lehanga thing from.. I know you have designed the blouse yourself", "aditae.sharma": "When you both met for the first time??", "sachi_1807": "Most embarrassing /awkward talk between both of you", "pranathi_neralla": "What's between you and mohak ?? Pls let us know cause we love you guys", "dhayanipandya2039": "Nice looking", "ak.anil29": "Nice", "sp007k": "👌", "_______sammie____________": "Komal didi, did u still talk to cherry???", "yandik_abi": "GT GERİ TAKİP OOO", "_footage_lifestyle_": "How often do you guys meet each other ?? @sejalkumar1195 @komalpandeyofficial", "sanjoy195_": "Nycccc", "harshika_upadhyay": "KOD...", "ranjana_35": "Where do but basics from and what kind of basics do mention your size so we can get a better idea 😚 ..love you both you guys are an inspiration !😚😙😙 @sejalkumar1195 @komalpandeyofficial", "bedika23": "What were your first impressions on each other?", "nanhar_15": "@komalpandeyofficial I love the necklace! Where did you get that from?? :)", "kavyavenkat_": "How did you and Komal meet? Did you know of each other before? I love you guys, hope you answer❤️", "deepika_durairajou_10": "So... @sejalkumar1195 and @komalpandeyofficial what is both of yours favourite tourism spot", "vastr.creation": "Have u met ravit komal’s bf?", "sakshi_173": "I wish to know *what is that one quality that the other person have but you yourself don't* and you should learn it from her. 💕", "maheratasneem": "@sejalkumar1195 when are you visiting Bangalore?", "that_distant_diva": "Hey guys, what makes your styles different/unique from other fashion bloggers?", "boardingadventure": "Pretty girls 😊", "ahana_addhya": "Whats on komal’s phone in this picture? Is it the same picture?? Really curious", "devishaofficial": "Advice for upcoming youtubers, and will you be interested in collaborating with new talents", "9823_radhika": "Sejal are you and mohak still dating?", "aaru_.103": "Hey sejal di are you sindhi?? @sejalkumar1195", "_lilmissmanisha_": "Komal Mam how u started ur fashion blogging journey n till now???", "ananyeahhhhh": "You both please describe youtube in one word!💕 would love to get my question featured in the video, thank you🎀", "hawama__83": "When and how did you guys meet?", "nehahahal2209": "What's the one thing you guys like and hate about each other the most", "_sohaana": "you’re and komal Crush? Btw love youuuu sejal and komal 😍😍😍", "eshasunshine": "What is your whole day like except shooting????what els do ull do?", "candy_crush_0": "What would you guys be doing if were not a YouTuber ????????", "hemal_ayachi06": "What Would u choose as an occupation if u were Not YouTubers?????", "the.purple.rose_": "Which was the moment when you realized that you guys vibe similarly?", "saychelledourado": "Are you both besties 😊", "samanvinaidu": "Where did you both meet?", "shivanisujata": "Are you and mohak still dating?", "_frenzy_being_": "As both of you are fashion bloggers.... Which outfit both of you feel comfortable wearing?", "the_indian_made_17": "Agar main kahoon mujhe tum dono se mohabbat hai tum kya kahoge 😀😀. @sejalkumar1195 @komalpandeyofficial", "__thatismyusername": "Which is that one quality which you both love the most about each other?", "reddy_varsha": "What was the most embarrassing thing that you both experienced ?", "jyotika.vohra": "Where is Mohak and who's your boyfriend Komal show him in your video or maybe you guys should do a video of 2couples going together on date?", "eleven100a": "Can u guys recreate some iconic scence of Monica and Rachel together! It would be a super cool and the most fashionable one!😍 #SEJALANDKOMAL #FRIENDS", "_muskanag": "Rate each others dressing style out of 10?", "_not.your.babygirl___": "Where has ravit gone? @komalpandeyofficial", "nabomaw": "Are you planning to marry Mohak ? ( In future)🤞", "imanastic": "are u a tellywood lover?!", "mayuripatade96": "All creative stuff", "tuhi_sharma": "Where is mohakk??? Love u both of u komal and sejal", "pubgqueenpriya": "Who is tushardixit #collab", "craftmyemotions": "Both of you do equally amazing work, could each one of you please share, what keeps you motivated all the time??", "ashutoshcr": "Do you guys study in same college", "pritisingh0512": "Do a music and dance video together.", "raihanalatheef.shinnu": "I dont have any questions... i love you both♥️", "shreyaxx._": "What would find both of you doing on a chill day?", "pori_214": "Any nicknames for each other?", "bhavya_karambali": "Ever went to double date?", "ms.khushiagarwal": "He did u meet her?", "foodie__island": "Who's more likely to get in a fight with a autowala...or taxiwala for change 😅", "shazia_merchantxx": "If u both get a chance to start a business in partnership what will it be?", "___wander.woman___": "Being a blogger looks real fun when people see ur feed n youtube channels....but is that much travelling ,socialising ,shoots....being beautiful and fresh all the time actually fun in real life....or at times it becomes too much. ??", "aayusi14": "Hey u guys are just awesome 😘😘. My question is that why you have chosen fashion blogging?", "happybloggerz": "Whom do you guys gossip about 😂", "deepshikhamaity": "@komalpandeyofficial Where did you get these neckpieces from? They are so pretty 😍", "11111_aisha_11111": "when is @mohakpapola which means mohak coming back on your channel", "_.d.h.e.e._": "How u guys met the first time?", "aah_shiii": "How you guys met and became such good friends....", "lit_yet": "whats your best memory together!?!!", "anagha_pandey": "What apps do you use to edit photos?", "ruchi_ra23": "Have you watched any Tamil movie?", "nehart_31": "When did you get the idea to start a YouTube channel", "uhaa_2000": "How did you guys react when you came to know that y are going to Dubai together", "hinal_25": "💖❤❤💖", "ambalal_lohar": "Beautiful", "anannyaa_r": "What do you find admirable in each other?", "lolpriyal": "Love you guys 💗💗 are you guys planing to go on a trip together? If yes we want vlogs, please 💖💖", "_shivani_naik809": "What was ur best clg experience??", "itsmorelikeaadhyaa": "Heye people. How are you both? So i have a question for sejal that how did she get the idea if being a fashionis/faishon vlogger? Plus who paid for the stuff you bought for the videos when you weren’t making money?", "astha_singh2712": "If u both wanna start a youtube channel together, what would u name it and why??", "upadhyayakshohini": "hi......I'm akshi and you both in this picture are looking super cute.......☺☺☺☺i want to ask that what it's like to be an youtuber.....collab", "_supriya17_": "Sejal ur looking grt😍😍", "gargikasture": "What is the hardest thing about YouTube and social media being your job?", "_h.laiba": "Can you give some tips for acne and acne marks", "pallak_aggarwal03": "Is everything ok b/w you and mohak! He hasn't been on you channel or stories in a long time now!", "shakirfatema": "Are you both planning any trip or vacation together anytime soon?", "dilona_dsouza": "Shout-out 🥰✨", "mera_shiva": "Dont u guys feel sometimes to look ugly...i mean do wear clothes n look damn ugly intentionally😂", "novachowdhury_10": "If you have to describe komal in one word, what it would be??? Same question for komal.... What is the one word that describes sejal..?", "pritiboipaipurty": "Where did you both first met?", "_.ananya_muley._": "Which is your favourite song or which was your favorite song??? Plsss answer", "sara_sheik": "How did u clear Ur acme and scars", "tadapti.atma": "For komal: how did your parents react when you wanted to move out?", "chauhanaastha": "Is it easy being friends when there is si much competition", "iampoojads": "How did u both meet ??", "aanandibobade": "Want y'all to sing together ❤️❤️❤️❤️❤️❤️❤️❤️❤️ @sejalkumar1195 @komalpandeyofficial", "thebigfuzzygirl": "Will you come to Bangladesh?", "the_jabberer_": "Do you guys share relationship problems with each other", "himakshiiiiii_": "Secrets about each other", "twinkle.solanki2306": "Favourite subject in school ?😂", "sara_kalbhor": "Sejal react to some of komal's instagram photos", "kashhvii_": "What makes you both do videos together and how does your creativity and positivity come from❤love love ❤@sejalkumar1195 @komalpandeyofficial", "bhavnaa_bhaskar": "We'd love to hear 2 lines from both of you... Like maybe a common favorite?", "_ayushay": "How did you guys meet?what are the things common between you both?❤ love you both ssoo much", "_semi_introvert_": "Is there any chance of seeing any of you on silver screen?? @komalpandeyofficial @sejalkumar1195", "pearl_lisha": "What is the one fashion sense in common in both of you", "sanyaswain": "Every individual has a personal style or fashion - be it the way he or she dresses or accessorises or puts up her hair and so on. Since you're both fashion bloggers, how would you guys describe the each other's style and how is it different from your own style? Also, if you think the other person would come off better if she follows a particular style, suggest it.", "_paushali_": "Hey Sejal and Komal!❤️...How did you guys came to know each other?..and where did you guys meet each other first?..Love to both of you!...Keep posting!😍", "super_busy_story_of_my_life": "How you guys met ? Tell us the whole story", "the_devious_damsel": "Hey sejal hey komal...💞💞.. First of all I just adore both of you....✨✨ Like seriously pyaar ho Aap dono... 🔥 ... I want to ask of you both that okay you have passion for fashion so u made efforts n here you are..... One main reason according to me about your success is that you both have financially support from your parents since u started..... But there are people whose parents can't support there passion n that too something like this \"fashion\" ... All they want is padhai kro or padhai se he aage life me kuch kro...... How can we tell them that this is a line too that too with out having this much money!!!! 🤕🤕", "_trupthi_rane_": "@sejalkumar1195 I don't know what is the reason for ur brkup but Just wanted to say u that ur very strong minded to overcome with such a long relationship......plz give us some tips 😅😅", "dipikakujur": "Love to see you both cook", "surjeema.basu714": "Who are your fav bloggers? Those who inspire you guys? 😊😘", "alishba_irfan_29": "Are u and mohak together?", "lumya_v": "What physical feature of komal do sejal finds beautiful and vice versa", "parulpapneja": "How you both met ? @komalpandeyofficial and @sejalkumar1195 and i want to meet u both ! Please tell me how can i ?", "sharmajiki_larki": "Have you guys got some sort of treatment done to your hair or they are straight by birth??", "vrushti_vora": "If u both get a chance to talk to someone for just 10 minutes who will be?", "imoumikapaul": "I jst want 2 knw what was komal💞doing in her phone during d click👆😂#curosity 2 knw #u both truly inspired me a lot#lv u both😘", "bhavana.sonar": "Nice photography🔥🔥🔥🔥🔥🙌🙌", "iam_kruthika": "Where do u shop from.. Especially ur clothes jewellery???😮", "fancy_capsules": "❤️", "tanoooska": "Favourite English singer", "tanhatahsina": "My question t", "sahana.dinesh": "What’s ur current Netflix binge?", "_aarrrya": "Hey! How do you earn from YouTube?", "soniakaushl": "How you both manage ur workouts", "sejaling": "The two things @komalpandeyofficial like and dislike about @sejalkumar1195 Andddd two things @sejalkumar1195 like and dislike about @komalpandeyofficial", "_devyani_rk_chavan_": "Who is most likely to be ambitious or particular about work?", "l_aiman_l": "Where you people usually hangout?", "kanika_rajput": "How do you guys deal with body hair? Ever felt getting laser hair reduction done? Coz honestly it's a struggle, if you wear sleeveless and dresses almost every day", "poorvagayake": "If not youtubers/content creators what would you have been?@sejalkumar1195 ,@komalpandeyofficial", "aashi_mehta23": "Hey Sejal n Komal , love ur videos ❤️. Please tell us who are ur favourite Youtubers ? Sejal do u also plan to buy ur own house in the near future ?", "_praptishende17": "How does one get photographers if they're planning to start a YouTube channel ?? Ps. Love you both ❤❤", "__harshitha.reddy__": "What would u guys be doing if not YouTube?", "a_.aarryyaa._a": "Fav you tube channel", "shabin_syd": "What's going on between you and mohak? Is everything alright? @sejalkumar1195", "_hummingdreamer_": "Diii. My question is that How did you Guys meet ,,where,,why,,,,...????", "giggles1716": "Why don't you follow Komal", "aishley2": "Sejal u r soooooo beautiful ❤️ looking pretty 🤩", "riva_h_1": "U both should do a style swap.. That'd be fun❤️❤️", "ads.206": "How much do you make monthly", "sarvveshhh": "which vedio editing app do u two use???btw i love both of ur vedios.......komals room tours and sejals vlogas are thing i love!!!!!sejal im also waiting for engeenering girls season 2😍😍😘😘", "miharucrafts": "How did you meet, what were your first reactions, do you like each other's content more on Insta or Youtube, do you get along?", "himanshibathla": "Can we please hear you guys singing together?❤️", "annika.tandon": "Would u both like to go together anywhere in forign again", "aasthaa369": "If you guys could name one song which describes your life at the moment, What would It be?", "sareevillas": "🙏🙏🙏 Pls follows page @sareevillas and all type new clothes collection available pls visit my page 🙏🙏🙏🙏", "ethanec2h6_": "Hey Sejal! Hey Komal! My questions are... 1)How to always stay motivated in life? 2) How do you guys deal with negative people arnd you? (like mean comments, rude behaviours)", "nishant_mohanty2323": "What's going on with you and mohak?", "snehil_157": "Tips fpr new utuber", "anaghadande": "What is the best thing ever happened to you'll?", "be_mahima": "What are the similarities in both of you", "ipreetipandey": "This is not a question but a request. Please sing a song together.", "tanvi_2955": "Whats your qualifications? This question goes for both of you!", "teni_world10": "What motivates you both to keep maintain your figure as well as keep moving towards your daily work?? 😍🤗", "vani_nisar": "How old are you", "devarshikansara": "Who are your most admired fashion designers?", "nitesh_1008": "Any women's & girls DM me for enjoy⚱🔏", "maachmishtimore_": "Where do u see yourself in the next 10 yrs?", "hgghy7ygkhgf": "😍", "anam_khan87": "u have fans in pakistan what do u have to say to them ☺️", "__amruthaaaa_": "Sejall didi... Are u and mohak still dating", "sonza0324": "Well plz answer my question. From how long u guys know each other n when did u first met", "_sanyogita._": "Sejal and komal,what is your height and weight?? Just curious, don't answer if it makes you uncomfortable🐣", "venomgurrrl": "I missed you both together so damn much.", "tanyachandwani": "Hieee I have to buy a mustard colour crop top where to buy I m from Jaipur nd I don't want too hifi types", "shikz__25": "Excited🔥😍", "akanksha_2000": "What impression did you had about each other when you guys first met?", "sharmathirajendran": "Don't you get tired of shooting", "rajput_suchitra": "I love you girls ., my fav YouTubers!", "aviabhi392": "😘😘😘", "allsrdd": "What are your fav video of each other ? Btw love you both 💙", "fashionvibes_happy": "How to get familyy support?!", "simran.tulsiani": "How to start a beauty related channel when you are on a low budget", "goswamiparinita22": "From when do you both know each other? Where did you meet first?", "harshitamathur_": "I love you guys. When you met, did you ever come across same life goals? Is there some dream that you wanna achieve with each other's company?", "sharvari_vaidya_": "💗", "happily.screwed": "How do you both get the inspiration to do such amazing work??", "jhalak030405": "Why don't you guys do more collabs @sejalkumar1195 @komalpandeyofficial", "atikaulfat": "How did you guys plan to make a video together??", "_neha_ravishankar": "Have you ever fought with each other", "lilmiss.dreamer": "Please do a meet and greet in Mumbai 🙌🙌🙌", "scarlet_forever__": "Are you a bts fan?", "_.sanskriti.__": "Hey...is there any nickname of both of u plz telll.....😐😐😐😐", "nikitanileshsheth": "Why you both were not together", "geetika03_08": "@sejalkumar1195 Where is Mohak these dayz?? we dont see him in ur videos👀👀", "tanushree.mhatre": "For how long have you both known each other????", "tulikamondal3": "I wanna ask @komalpandeyofficial do you wear a bralette to restuarants or other public places? Because your current video really inspired me and I wanna carry off the bralette with blazer look", "_thatloner": "Is everything going well between you and mohak?", "amna.b14": "How did you both met ,loveuuu,xoxo ❤❤😍😘", "infinitiespresents11": "where did you people meet? and how you became friends? lots of love from us ❤️", "genesis_cradle": "When u guys became friends and your most memorable moment", "__meandmine": "@sejalkumar1195 please tell me how to collaborate with brands plz plz it's really help to those who wants to be fashion blogger", "prajakta_shinde_": "Do a drastic step by step make-over of each other !!!", "farooqaaliya_": "How did you guys focused on studies during your college?", "deborah.mahima": "@komalpandeyofficial 💝", "apurva.g92": "What would you both suggest as a styling tip for a chubby girl for work ?", "smita016": "What is the one thing you want to steal from each other...?", "anjali639": "Hi komal and sejal my question is when u and mohak will get marry and for komal when u did u will u upload your room tour", "madeupofvibes": "Judge each others Fashion Sense Sarcastically...!!", "aditi0n": "Any one video of each other that you both adore and would like to recreate? #sejalite.. lots of love sejal and Komal 😘", "jewel_dcosta": "What was the biggest fight you'll ever had?", "kusumita_18": "How did you met??", "_high_on_tea_": "any common skin care suggestions?", "harwinder7557": "💋", "yo_ilimitado_": "Your deepest secrets", "13nov99": "How to survive in a college without friends ? And is it a myth that intelligent people have less friends?", "manvi_sonaiya1307": "From hw long do u know each other and hw did u'll meet @sejalkumar1195 @komalpandeyofficial and hw is ur friendship lke u'll meet everyday", "notdramatic_watre": "Would you guys ever be an activist for something you believe in", "krisha7204": "What is the most embarrassing moment of ur life ?", "miss_secret_superstar": "How many years do u know komal @sejalkumar1195 @komalpandeyofficial", "devanshi.r.21": "How do you manage the pressure of your work", "swastika_mukherjee1": "How did you guys meet?", "me_m_invincible": "Do a funny impression of each other!", "kaavya_salian": "Are you ready to move out of your house any time soon?? Just like komal did🙆", "deepa_ramaiah": "How did u both meet first??!!", "bhadouriya_needhie": "Two youtubers can be a good frndz?", "darpana.desai.23": "Will you ever Collab again??", "saraaaaah.n": "Where is your favourite place to shop?", "the__beauty_inside__": "Komal wtz ur opinion abt mohak", "pradz_4": "What do you like about each other..?and whats common in both of u?", "prashunshukla7": "😘😘😘😘😘😘😘😘😘😘😘😘😘😘😍😍😍😍😍😍😍😍😍😍😍😍😍😍😘😘😘😘😘😘😘😘😘😘😘😘😘😘😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "basement._.fox": "Hey love u.. Ur awesome can I ask u ppl how u both actually meet...??? When, where, how???", "manasi____patil": "Where is mohak..?? What is your scene guys..?😅", "vaibhawi7844": "How to look classy nd fabulous all time as you both..... Plzz share with us too 💞💞💞😘", "akshaya_150804_": "Where did you meet and what r your best memories together. Love you guys.😍😍😍😘", "akshita_2513": "Who inspires uh both? And like how manage all the stuff.. like events.. shoot and everything?", "asian_millennial": "🤩🤩🤩🤩😍😍😍😍😍❤️❤️❤️", "__.soundaryaaa.____": "When you started talking and how you guys met?❤️", "spammm_blahh": "How did u get to know each other", "bhiltribe": "Do you guys have deep conversations?", "surabhi_caxyap": "Both of yourz...favrte dish...nd plz come 2 Assam...", "aina.minhas": "Why komal left pop.xo", "anchalllll_23": "How do you met each other ?", "shabbu3": "What was your first opinion about each other I mean how did you felt about her Sejal and same to Komal also", "anviii_2706": "One thing that you do not like about each other", "tishabohra": "😍♥️", "venwhen2000": "What was the most hilarious moment you both experienced?", "niloufer_fatima_": "Who can dance well @sejalkumar1195 or @komalpandeyofficial please do this @sejalkumar1195 please😍😘", "arpitadasx": "What were your plans for your future when you were young? ❤❤", "san_376": "Komal and sejal what haircut do u guys get????u guys r d best", "chhavikhurana": "Is vlogger life as glorified as it looks? I mean all jobs have their short comings so does vlogging. But from distance it looks so fancy that most people want to take it up these days. Throw some light ..", "devrahul_20": "🤗🤗🤗🤗☺ #shooting📸 okay my question is wt ur fav scene in engineering girls? @sejalkumar1195", "x_._rishu_._x": "Hi ma'am I am Risha your biggest fan and here's my question Who was your biggest inspiration for Ur YouTube career???", "isha_kumar03": "Love u guyss💞 what is the best thing u like about each other? 💟", "vinithashanigarm": "Do you prefer to do scripted acting vedios or anything else", "shachika_mittal": "How did you two got to know each other?", "theyellow.kolhapuri": "What makes two girls bff even from the same field.", "suditisingh_": "Which one thing u both hate about each other??", "ii_abhishekbabu_ii": "Does @sejalkumar1195 know who @spill_the_sass is? @komalpandeyofficial", "j_lakshmi_02": "How did you both get the courage to do whatever you love,how could you not panic about doing something completely different? @komalpandeyofficial @sejalkumar1195 your's are success stories. Is there any point where you regretted chosing this path and thought of giving up? @komalpandeyofficial @sejalkumar1195", "ashibirla": "One thing uh love abt each other", "dhana__sri": "Where did you people met eachother for the first time? And what were your opinions on eachother before and after meeting?💯", "swathijha__": "One of your memorable moment when you were a teenager..... or one of your akward moment which you like to share!!!! #sejalkomal", "kulkarnivaishnavi23": "@sejalkumar1195 and @komalpandeyofficial tell three things that you find best about each other...😍😍", "blissxfulll": "This question is for both of you being a beauty blogger what does beauty mean to you?", "ayushimshr679": "Day how @komalpandeyofficial started our blogging journey like kaiskae yae socha ki ussae ismae apna career bnana hai..", "sweetshreya_13": "I want ask a question to both of you that why did you make youtube as your career?", "rashmiii.ii": "Tell us ur 1 good and 1 bad quality??", "prarthnaasingh": "Do you guys like each other's style ?????", "_songbird_garden_": "What's the favorite thing @komalpandeyofficial likes about you?", "_suzilicious": "Do you guys ever plan to continue your higher studies? If yes, what stream will it be?", "arunkumar.jaimini": "Stunning", "chai_druthi": "R u dating Mohan", "purnimadixit0": "Sejal do u have bf", "rainashah.x": "What's going between u and mohak", "the_strange_evilll": "Wat r things u bth lyk abt each othrr.. n hw u guys mett n wen?? N hws ur bond?", "les_janani": "When did you guys meet? How did you become friends?", "anji_tokas": "Can you do a video similar to #komalstyles together❣️ i so want to meet both of you😍❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️not being cheezy with the hearts but want your attention to my comment 😅 ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ @komalpandeyofficial @sejalkumar1195", "_.r.i.d.d.h.i._": "Sejal and mohak are together?", "purviichxwla": "how did u guys meet?", "taniagulatikumar": "How u both met?", "urvashi_kale": "How both of you met and when did you both met for the first time?? @sejalkumar1195 I just love your voice and your dance moves as well & @komalpandeyofficial your so beautiful..", "vinayanta_b": "If you were to wear only one type of outfit for a lifetime.. What would you choose? 👻 ( Type in a sense LBD, jeans, maxi dress, saree, lehenga etc. )", "_urvashii.xxo89": "How to deal with loneliness", "saniyaasharmaa": "When did you both become friends and you both don't like about each other!! @sejalkumar1195 and @komalpandeyofficial", "vaishhnavvii": "What's your craziest moment together", "aparna_mathakala": "How well u can describe each other in fashion life .... everything ?? @komalpandeyofficial @sejalkumar1195 #waiting👧🏼👧🏼", "maru_rashi_": "What's the fav video of each other", "soumasen": "What do you like about each other the most?", "_.blissollie._": "When and How did meet eachother for the first time??", "shristisahuu": "Can you really make a living just out of YouTube?", "navdeepkaur6495": "@komalpandeyofficial @sejalkumar1195 #collab please check my video in which I recreated your Instagram pictures. Please let me know how is it, it will really mean a lot. I hope you will notice this comment.", "kawal_25_": "How did you met each other..? And Where? Loads of love to you...😘😘", "ashwinijoglekar": "How do you cope up with being compared to each other? Is it tough to be competing against your good friend?", "ayushi_2888": "What is your favourite things to do in free time??", "gabaishnoor": "My question is that are u both best friends??🤔by the way,a huge fannnn😍this side...love u both 😘@sejalkumar1195 and @komalpandeyofficial", "lyma_mariyam": "How are your hair right on point all the time", "_jiyaamodi": "How do you guys earn from youtube", "heart._.hacker._.63": "Do u still miss popxo team ????", "ayushipandey0196": "love both of your vedios a lot . I wanted to ask from where do u get inspiration for making lovely vedios and how do u get idea's for vedios ? and do vlog more often . love to see u both", "zaisha47": "How u guys become frnds.....???", "fictional.eyes": "One thing about each other that you admire! It could be personally or professionally! 😀", "yuctasharmaa": "Height of komal and sejal? @komalpandeyofficial @sejalkumar1195", "sanjana._.patel_": "From how long you guys know each other??", "prajakta.13": "One thing you love about each other's fashion/style/dressing sense !", "ishadalmia": "have u ever had a fight wid ur boyfriend??", "trups_corner": "Love komal's lips hade", "shweta_menon_13": "When do u guys plan to get married?? Is there pressure from family??", "mishthaa._": "What one thing that @sejalkumar1195 loves 'bout @komalpandeyofficial and whats the one quality @komalpandeyofficial loves 'bout @sejalkumar1195 ..also tell the bad ones!!", "beautybehinddmadness": "How did you guys became friends with each other?", "nirmitee_20": "U both are fashion bloggers....plz comment on each other's style!!❤️ Love you both 😘😘😘", "senguptadipshikha": "How did you met each other?❤❤", "itsyatigupta": "Mohak bhaiya se or Komal di ap Ravi bhaiya se shadi kB kroge", "virlia__aasthagupta": "best memory of ur friendship", "esh_chopra": "Where is mohak?", "das_aatreyee": "How did you guys meet??", "rafia_syra": "How did u ppl meet..??? Wt were ur frst impressions on each other??? #needthetrueimpressions..!!!😁 😁 😁 😁 😁 😁", "anushkarakeshboriwar": "How do you guys met??", "ll_arwa_ll": "What are some awesome products you use for your skin and would recommend others . Btw love you guys 😂💜💙💛🤙", "jubiegupta": "Did you guys always want to be Famous ? Share your childhood dreams.", "tanuellaa": "Best thing you love about each other ???🌻🌻🌻🌻🌻🌻🌻🌻🌻🌻🌻🌻🌻🌻🌻🌻", "s_tasneem07": "How did you’ll start your carrier?", "kritithapa__": "what are your height?", "khilakbinon": "question-define friendship...@sejalkumar1195 @komalpandeyofficial", "_aananyaaa_": "When did you both meet? And what is the most cherished moment of you both?", "chandrani.dhar": "Where did you guys first meet and how did you become friends ?😁", "_kiranmayee__": "Awesome Combo u people! Qsns gaye bhaad mein... Very much excited to see u guys together... 😜😜Waiting for the video ❤❤😍😍😄😘", "_angel_talks": "What is your inspiration to start up your youtube channel?", "hkigardizq": "Do y'all like BTS or any other kpop group? If yes then who is your bias? And can you sing a bit of their song? Love your videos. :))", "ridheee": "I adore both of you girls. My question for u both is who is your inspiration & what motivates you each day? how do u fight with the anxiety when it comes to social media ? Tips plz", "hayafathima._": "@sejalkumar1195 ..how did u guys met each other??", "aaliyatimilsina": "Rate eachother as a YouTuber in terms of content & everything!", "aditiiii__66": "Where is mohak??? Are you guys still dating eachother. Qki Kuch tym se mohak gayab ho gya hi", "ananyasalunke21": "Last person you texted 😂 Collab!!", "kanishkaj18": "Who do you think is more experimental with clothes. @sejalkumar1195 OR @komalpandeyofficial ??❤️❤️❤️", "____ahana._.007___": "When u both first met.. N how", "ruchhiiiii": "Where did y'all first meet?", "sonali_1098": "How do you guys know each other?", "bhavitaatisha": "How and when did you both meet? Btw I love you both💋💋❤💙💙", "izunicorn_00": "From how long do you guyz know each other??", "moksha_shah27": "Are u guys still good friends? 🙁", "chahnasadh0026": "Ur emberresing moment", "anandita.kumarii": "@sejalkumar1195 @komalpandeyofficial Your guilty pleasures?", "_a_dreamer_girl": "What do u both like about each other?", "dhal_swati": "What is your dream wedding? 😋 Just asking", "flam_ein": "What is the worst nightmare you have ever had ???", "_devanshinaik_": "Did sejal ever tried in popxo", "simrandeep.kaurr": "How to dress and makeup for college girls (minimal)", "ishayadav4": "@sejalkumar1195 and @komalpandeyofficial, What are the common things in you guys? (Except the YouTube life!) Also love both of you! ❤", "nitikabhambri": "How did you guys decide what would be your first video?", "nikitasup29": "It's easy to do YouTube or a 9 to 5 job", "advekaa": "What is that one thing u luv abt each other ps: luv u both ♥️😍", "duff_olivia15": "3 things you would want to change about yourself?", "_.vediika._1": "What are the similarities between you two .. and how did you become friends ❤️❤️", "stubborn_leo_1908": "You both are two different personality. Love both of you. Love to see you both in a music video. My question is how you both became friends and how you maintain your friends being in the same competitive field?", "gateway.of.dreams": "Guys follow @gateway.of.dreams 🔮 for some eye catchy scenes🏞, mouth watering dishes 🤤workout 🏃‍♀️ and diet tips📝 amongst much more @gateway.of.dreams ⛳️ . . . @gateway.of.dreams 🍷", "miss.prianca": "Lovely", "saumya.3": "If you could steal one thing from each other, what would it be!", "zainubadeen": "Who is the most disciplined one ?", "sharvari.wani": "When did u first meet?", "shivanieswara": "When did you guys meet?", "__nandiniii.__": "One tip both of you would give to each other in styling or content? 😛love you both ❤", "aboli_rode": "Do you get offended when other bloggers stole your content? @sejalkumar1195 @komalpandeyofficial", "minkomohamed": "Guys", "bushra_rarh": "Please tell some best memories of urs ❤️❤️❤️ komal and sejal love you both 💖💖💖💖 lots of love to you guys 💗💗💗💗 @komalpandeyofficial @sejalkumar1195", "mahesh_babu_325": "Nice click", "foood_175": "Both are just elegant..❤", "yashvipujara_": "How to start blogging?? And some tips for collaborating with brands and getting PR's.", "___serious_haha": "What you both be if you were not a youtuber?", "samiksha_singh99": "Where is Mohak??", "vishakha_paliwal": "Why don't you guys do a Collab featuring your boyfriends. When do you plan it???😅", "harshitha_reddy09": "Yours guiltiest pleasure", "sumina_m": "Firstly you guys are my favourite YouTuber.... please make more videos together, lots of love from Nepal ♥️♥️and my question for you both is ...what is the worst grade you got on a test...?", "itisritz": "Who is the biggest influence in your life? For both of you", "riya_patel1497": "Mohak ?", "anihive_13": "What is the most adorable thing u did together", "salonitawde": "What are the 3 things u genuinely dislike about the other person . And what is ur only advice for the other person to be a better version of their self. Btw i adore the two of you. Keep hustling great are waiting ahead ❤️", "pearlkadakia": "How you both became friends a", "elakya14": "Which is your fav movie", "anupurba.roy": "Outfit details!!!", "itsmeeshaaaa": "Who is your favourite YouTuber ?", "hohoimate": "How come you guys gained more than 500k of subscribers within a year...????", "aadyabubber": "Sejal are u and mohak are not together now plz reply this question", "_shubhikaa_": "My two fav in one frame 💯💯", "sonamkaneja": "Hey Sejal and Komal ...Loadz of love ❤️My question-What is the biggest similarity and biggest difference in u both as a person ?", "nipa1975": "Say us your wierd and most awkard time or scene...", "_bhuvana_priya": "I dare u to prank call on someone or something", "mostly_saner19": "💘how did you meet and when", "_shravya29_": "What will be ur advice for a fashion oriented person on taking fashion as their Carrer??", "jessjam321": "How did you guys meet? What is your friendship story?", "ishita___chauhan": "What was your first impression when you both met each other??", "devil_dream51": "Hey!...mohak or komal??", "mouli_rana": "How did you two become such good friends?", "24_gargi": "Where is Mohak?", "pragya_bajpai_": "How you both met and what is your special memory together till yet?", "_srooti__": "I love u both...I'm in 11th class....and I love ur all styles .. especially Sejal dii and also I love ur beauty hacks ..Komal dii..can I pls make video of both of ur styles...", "dollypandyaa": "Are you virgin???", "niharikakk": "How to perform good in boards??", "julievidhya": "What is that one thing you want the other to change?", "sanaasharma7977": "@sejalkumar1195 @komalpandeyofficial u both should do a video with ur bfs like Charo ek saath ek hi video mai plzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz", "p.tanya_3806": "@sejalkumar1195 @komalpandeyofficial I really wanted to ask both of you which are your favourite books?? Also songs or bands maybe?? @sejalkumar1195 Di please do a cover on Back To You or maybe the new song Taki Taki. I really do love your voice 🎤🎤🎤 @komalpandeyofficial Di Can you please do a Home- decor video.", "prishaaasingh": "When did u and Komal meet first", "shubhiii_jaiin": "Who’s ur priority...ur boyfriend or ur work?....n actaully how u manage ur priorities...🙄", "uditi.taneja": "@richabhardwaj1 humme kyu ni mili ye jewellery", "khanna_tamanna.2326": "Your mobile phone name?", "shrish.04": "Which web series of yours you wish Komal were a character there?", "nehasingh.rathore.9083": "Are you both happy with ur relationship if not how u handle ur relationship????????", "ssharmaxxvii": "Ok...all the best 👍", "kripakothari99": "At what age did u girls start dating ..?", "iamyashaswini": "Define your friendship in 2 words !", "joylin_andrew": "How did u guys meet", "nishthagandhi_": "How did you met each other", "jojogautam2": "You looks so prity", "ashmeet_07": "How ur frndshipp STARTED?💕🙈", "filmicmanas": "@komalpandeyofficial you are looking like @bhuvan.bam22 ki sister 😘😘😘😘💖💖💖", "tinkysapra": "Who is your common favourite youtuber??@sejalkumar1195 and@komalpandeyofficial ...plzz tell...luv u both😘😘", "labdhi._": "What are similarities between you both?? Love you both💘", "etoile_brillante.21": "komal you should shop some other colour .....we are so bored watching uh in denim or white", "bianca_911": "What's up with you an Mohak @sejalkumar1195", "baldebhoumick0510": "Well madam everyone has only one heart which can be given only once. How many more hearts would you ask for from a single person by your beauty😍😍😍😍😍😘😘😘😘", "sanjana_1196_": "How did you both feel when you first met each other? And what were your shooting memories? Can you both sing your favourite song? @sejalkumar1195 #collab", "subir_das_359": "❤❤❤", "saameeksha": "Have u broken up wid mohak plz don't say yes hoping u too be together forever", "nityashree111": "How would u both react when u reach 1 million on ur channels!! @komalpandeyofficial @sejalkumar1195", "navvss.m": "Hey sejal ! I absolutely adore you . You are effortlessly beautiful 💕💕 . I really liked the laddakh vlog. My question is is something wrong between you and Mohak ? U guys are perfect for each other !! I was hoping u guys get married 😘💕", "kajal_nayyar": "What is the weirdest thing you both have done together? 😍", "_namithaaaaaaaa_": "Sejal pleaseeee reply to DMs .. 😫...anyway my question is how do you manage your time.?....please give us some tips ...☺️☺️", "fmwdotcom": "Fantastic", "kun_jal": "What about mohak ? We are missing him !", "notpoeticone": "Who is more likely to drunk dial an ex?", "avantika__06": "What are your favorite things to do when your bored ???", "zafarwestern": "💗💗💗💗💗", "sejalites": "Describe the other person using only 3 words.", "ketzzz_here": "Cuttiieesss💕🤗", "sarangh.hoe": "What is that one thing you feel is the best about each other? ❤", "andrea.magdalene": "How did you guys meet . I mean how did you guys become friends. Btw we love your combo", "rahulkumar17091": "🤩🤩🤩", "janice_ribx": "Both my favourite bloggers😍😍", "jaya.yellow": "Are you still dating Mohak?", "pmehrotra1312": "A travel destination you guys want to go together", "varsha_lobo": "If you guys had to start a brand of your own. What would you name it and why ?", "rashiqureshi": "When did u guys first met? and what was your first impression of each other?", "_tahera_rangwala_": "Hii How did u both meet for the 1 time is it some movement or by YouTube and I love u Both I always wait for your videos I. Love u both plzz ans my question 😘", "anuxietyy": "Can you guys do a haul video together??", "sanjanaaa_rao": "One fashion style you cant get bored of?", "minha.hashim": "Tell how will you Moisturize your skin everyday", "that_bunny_teeth": "Hey pretty faces..Love from kerala..My question for Komal is how did you convince your parents about the idea of your home shift.? And for Sejal- do you have any plans on the same .?", "himanshi._.xo": "Hi! Since a long time i wanted to know @komalpandeyofficial 's interest in any sport ..... I know @sejalkumar1195 used to play basketball so sejal are you continuing it or not? 😁", "vedantiiwanjarii": "What do u prefer to watch Friends or big bang theory?", "bhavya0735": "What would you choose as your career if youtube didn't worked the way as it did???", "accio_happinezz": "How to make new friends easily???? Plz answer karo na di♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "sonam.0804": "❤️", "usashi2001": "What do u guys love about each other?... love u both sooooo very muchhhh❤❤❤❤", "___zrafiq89": "Are you mohak broken up😢😢😢😢😢", "anushkatyagiii": "How did you guys met ? From how long are you both together? :D", "rinki_jindal_": "How do u manage ur frndship with ur work??", "ishikaagupta_": "I love you guys💕💕💕 my queens", "abigail_neethi": "What happened to mohak sejal? @sejalkumar1195", "that_ambivert_girl": "What's your mantra for life? 😶☺️", "___suni_ta____": "❣️", "_nishantsagar_": "will sejal collaborate with me on one song only??!!😊☺️", "mansighrit": "What is one thing that is common except YOUTUBE between you two 😎😎🧐🧐🧐🧐🧐🧐🧐🧐🧐🧐", "pratzzzzzzzzzzz": "Why did komal left pop xo? And how did you both met and where?", "_a.c.h.a.l.a_": "Any suggestions for YouTube beginners!!🙌♥ You both are my favorite.. Ily!! 💕", "thatswastika": "What can we wear for school parties without getting too bold or too simple and also by avoiding the chance of getting dress coded", "ruchiagrawal02": "Home diy dark circles remedy please 🙏🏻", "_muskanmemon_": "Yeah..Have you guys broken up? Mohak and you?!..you guys are super cute together..also why dont you and komal do a makeover challenge togther..", "pankhi18": "What's the most embarassing moment you had while encountering a fan?", "simrankaur2472": "What will you do if you fall in love with the same guy? Love you both❤", "manya912": "What are your favourite travel destinations?", "_gauryyy_": "Hi Sejal and Komal Didi I am a big fan of yours . I wanted to ask a question that would you rather be in a jail for 14 years or keep chasing the police for 14 years..,❤😂", "priyanka_meena15": "Are u sweating or it's jzt ur face is glowing ? @sejalkumar1195", "marriedfriends": "Waaaoooo afterr so long .. Waiting waiting", "mallikachandna": "What's the inspiration behind your youtube channels?", "mystylepalak": "Your college/school experience.", "girija062000": "How did u both look during ur teenage days", "geeky_geet": "@sejalkumar1195 which styling of each other u hate the most ??", "aishwarya_gachinamath": "Omg omg omg!!!! Finally collaborating with Komal 😻 Love u both to d moon & back ✨🌼💝 & my question is ntg 😂😂 just love u both 😍💋💋", "mehak.kaur07": "Ever had a paranormal experience?", "chin_raj17": "One embarrassing fashion moment", "anna_taurus_1905": "How was the experience of both of you at our own DELHI UNIVERSITY? few highlights which you both remember!", "bhavyasheth98": "What's one thing you guys like about each other's fashion sense?", "anisamaity": "Aww love u guys💜💜💜", "iamchiragkumar": "Bhuvan Bam or Amit Bhadana? Choose one", "_sakshiii_30": "What you love the most about each other?💙", "_anj_ali_92": "Brand of panty to be worn under white pants", "moody_grl_me": "Its for both of you....the most embarrassing thing or scene u had while shooting!!!?🙊", "raina_noorie": "both r my favsss❤️❤️", "aditi_rohiraa": "Is there any hobbies common with you? I love you both so much and you both semm to be best friends😙😙 hope you will answer.....", "sarvanijavvadi": "Hi komal and sejal......love u both .......there was one question to ask both of u.......do ur parents know about mohak and rivit Srivastav.....", "anushree._.ahuja": "When and where you both met at first time?", "_a.nusha.y_": "And down you can see komel sending all the pics from her phone to sekar on WhatsApp😂😂 btw love ya both♥️♥️", "shreee___712": "Komal, tell a thing that you don't like about sejal!!! BTW love you both 😍😍😍", "anirudh___gupta": "did u find eachother as ur competitors ??", "thatgirlbehindglasses": "If you were to go anywhere in the world together which place would it be? @komalpandeyofficial @sejalkumar1195", "_dds_ivy_": "U both are doing so well and I love u both 💓 but with all of this love and support u also get hatred and we all also have our own insecurities . So how do u both deal with all these neagativities. Love u guys 💓💓💓and u both slay🔥🔥🔥", "alkaarora_": "Have you both ever bitched about some other YouTuber? 😅❤", "sameeraredkar": "A travel destination you want to go together?", "anjalii_rajput": "Why don't you guys plan a girl trip together and edit a vlog also as you both are amaze! I'm sure that vlog will make buzz 😍", "rashmigracetoppo": "What kind off bond you guys share with each other 😊", "florinarava": "How did you both come with this idea to be a YouTuber?? As it's never easy for the starters@sejalkumar1195 & @komalpandeyofficial ??", "sappy1010": "How do you get the motivation to do long shoots for videos and then have the energy to be active on social media and still stay positive?? What is your secret??", "ishaaaaad": "If say professionally,You guys are competitors.. but you are friends.. how can you manage that??? Don’t you guys feel insecurity??", "ii.tunna.ii": "What was your first impression on each other?", "manikaaaa.d": "How did you guys meet? One thing you both like and dislike about each other? ❤", "varan.bhat": "@sejalkumar1195 @komalpandeyofficial r u guys lungi friends", "_rishitagupta._": "For how long have you been frnds??", "shreya_agrawal9999": "Who started youtube first?", "simrangarg11": "How do you deal with comparison?", "reallyshalaka": "How did you guys meet?", "thegirlnamednimo": "What will you be doing rn if not this?", "hhju7tnbj": "Who's more likely to get drunk and dance on the roads?@sejalkumar1195 @komalpandeyofficial", "shraddha_basrur": "Will you guys ever collaborate with the upcoming youtubers or Instagram influencers?", "gopika___vidhya_28____": "@sejalkumar1195 wot is ur biggest achievement evr since u were born?", "rach_rb357": "How did u guies actually meet? What dare would you give to each other?", "beeandcactus": "One weird habit you guys have", "rennnnniieeeee": "Favorite band?", "abirami_kharatmal": "Do you still use few things that u learnt while u were a student ....and would u go back to learning if given a chance ??????", "nandini.agarwal": "You guys should make a collab together where you exchange each other's wardrobe and style each other. ❤️❤️❤️", "das.the.way": "Do you guys ever treat each other as competitors!", "kashika23": "If you could switch bodies for one day what would you do ?", "yukta_21_04": "Mam from when you both are friends??", "im.karishmaa": "Any similarities between uh both?", "hiraeth30": "@komalpandeyofficial i m big fan of your dressing style.....what are your future plans in fasion line???", "90sgirlatheart": "Are you guys friends in real or just colleagues?", "avni.13": "Do you like and inspire each other's dressing style???", "stronggirl_nive": "Were you ridiculed in the beginning of your respective careers for doing something unconventional and how did you deal with it @sejalkumar1195 @komalpandeyofficial ..plzz reply as even I want to become a fashion blogger", "akanshamishra13": "What u like most About each other??", "gargee_dekaa": "Most embarrassing story of both of you😂 @sejalkumar1195 @komalpandeyofficial", "jinishaakapoor": "You had a breakup with Mohak?", "__bunny14": "What do u guys do to stay soooooo cute. P. S. love you both😘😘😘😘😘😘😘😘😘", "the_mayathing": "KOMAL has always been super stylish and bold whereas on the other hand SEJAL has always been simple yet bold. You both represent boldness in two different ways which is amazing to look at when you both work together,when simplicity meets style. These different characters show us two different personalities working together with the same goals YOUTUBING. In this big span of time and being so different from each other, do you both think it's important to respect each other's views? Also,what all have you both discovered about each other(that you observed really deeply) in the past few years of your friendship?", "hilmmmmeeee": "Which parent do you follow more in characteristics and looks? Please mention my name", "1dforevaeva": "Well what is your opinion on stylecracker box? Is it worth it? #loveyaboth 💜💜💜💜", "rav_0597": "Komal's outfit and jewellery details", "sejalites_1195": "How did you two meet?", "lizabiswas2108": "What is the bad habit u both think about each other?", "_ww_97_": "Who is ur boyfriend", "prasiddhi2": "When did u frst met?", "fouziyaahussain": "Rate your friendship on scale of 1 to 10", "vanshika_j17": "Maybe I wanted to know about Sejal and Komal dii’s fav. movie..! Lots of love..❤️", "shagun_routray": "What's the best trip that you both have been to?", "suhanasavera": "Currently u both r going through a lot of emotional and professional changes in ur lyfs. . . Whts the take u both r u doing to survive that?", "salonimehta456": "Both favorites 🙈😻", "_mahaasree_": "Are u both a BTS fan? If so who is your bias?", "_awmtei_": "What do you think of northeasterners in general?? According to the students and the people you've seen in and around delhi", "vrishtiee.guptaaa912": "The habbit you feel embarrassed about a lot but can't give up on", "agriti16": "A YouTube challenge you wish you came up with? Or a challenge you are too afraid to try", "ananyaabakshii_": "For how long have you guys been frnds?", "shristies": "Any 5 similarity and dissimilarity between you guys", "ananya._chauhan": "Favourite movie?", "_rasikaloke_": "Sejal u r the most beautiful soul which I came across. I love all your videos. Bt from past few months v didn't c u and mohak together, is anything wrong between u guys? U both r adorable together pls b together ❤️"}