{"mrini__": "It takes guts to do what you did today. Coming out and speaking the truth that also about your personal life. Just want to say that you have a long long way to go girl! Stay blessed", "_uzib190619": "Technology Japan and India ..Vs Fashion Japan and India💚", "gulam.chohan": "Very very nice pic", "dilmeinmerehaidardedisco": "@lucky1497 bkl tune kyu ni khichwai photo", "vijeta_dalod11": "can someone name the brand of the shirt🙄", "lifelikemystery": "Youre eyes speak a lot Sejal... You're not happy from Inside. That spark and twinkle you used to have is not same. Come with happy bubbly face sooner 😊", "badtaco._": "Maybe shoot a cover for Lost in Japan by Shawn Mendes..Like the one you did for FRIENDS", "timepass0143": "Follow🍃", "anchalyoga": "Sunshine 🌻", "najlarasheed92": "Places to visit...food.. shopping may be", "yashikagurung": "You look very pretty😍💣", "savnis": "Do a full face of Japanese drugstore makeup.", "kalopsiatix_": "Reply o plead", "your_best_stalker101": "Hey so in one of your posts you’re wearing something from shein. Have you ever faced any issues w them because this one time I ordered something and there were problems with the delivery and my bill.", "khanameerah15": "Your favorite @jshrey", "anjali.jhanwar": "Outfit details please @sejalkumar1195", "its_geethaa": "Dude!! Your such an inspiration ❤ keep going @sejalkumar1195", "shubhojit_bflat": "Fab 😍@shubhojit_bflat", "purohit_shrestha": "Society need more motivational speaker like you who can talk to the new generation and guide them properly. I am big fan of you and have a desire to connect with with.", "vedjiranaroy": "@22maggie_ doesn't she look like you ?", "anilsharma2957": "Hey sweetheart I love you my life", "ssnehasneha": "Plz make a video that how to choose correct footwear for ur outfit @sejalkumar1195", "raghavikumar05": "Looking forward to your next post", "jasjotbhalla": "🔥", "teekhi_mircheee": "Do try the Japanese cheese cake..very fluffy and soft❤️", "daniell_millard": "You dumb-fuck Indians....Pewdewpie rocks!", "vaibhav__sharma__vs": "Bts army welcome🙏🙏🙏🙏", "lovethem_anyway": "What do Japanese people feel about India? Anime/Manga/Movie Japan versus Real Japan? Japanese beauty standards or style? Learn one Japanese word from them and teach them one :)) I love you Sejal because of your consistency and the mettle that you show at your age. I love your organized mode of shooting videos where you take into considerations all aspects - location, pre-production, post-production,finances. It must be difficult to live most part of your life in front of the camera. But you're doing a tremendous job! Bless you. Keep Inspiring Sejal, you happy soul ♥️", "anusuya_das7": "Video on Japanese food or Japanese herbal skincare", "jelynmarcelino": "Agggg ur so gorgeous :-) :-) :-) Philippines :-) :-) :-)", "avantikarajvishen": "💖", "grace_orick": "Hey dear  How are you? Hope you are doing well :) This is rosewe.com, I’m a member of PR team for socail media. I happened to see your ins and was really impressed. It seems that you really enjoy showing off your sense of cutting-edge style, and amazing make up looks. So i’d like to invite you to our Fashionista Program. We can provide you with amazing free items!! If you're interested,please contact me via this email: Grace@rosewe.com I can show you more details !! Have a nice day! Best wishes.", "vedikagurav": "I have recently been to Japan and I can speak Japanese as well, please take me with you, I miss Japan so bad😭", "wjunaidd": "Hey I started a youtube channel, Wasma Junaid. Do check it out and also like, comment, share and subscribe 😊 insta handle is @wjunaidvlogs :)", "darshu__12": "Outfit details, please!! @sejalkumar1195", "http.shreya.xoxo": "LOST IN JAPAN COVER!!! A major requestt", "astro_babainindia": "Famous world specialist aghori baba in india uk,usa, Canada, Australia,allword vashikaran services by aghori baba all types problem solutions .+91-7347090660 यदि आप किसी भी समस्याओं का सामना कर रहे हैं तो बस हमसे संपर्क करें क्योंकि केवल एक कॉल आपका जीवन बदल सकता है! लव विवाह विशेषज्ञ, प्यार जादू, प्यार जादू पति वाशिकरण प्रेमिका वाशिकरण पति, प्यार वाशिकरण विशेषज्ञ, जादू जादू, ब्लैक मैजिक, मंत्र, मनी स्पेल, ऑनलाइन ब्लैक जादू विशेषज्ञबाबा, जादू और जादू, स्पेलस्टो स्टॉप धोखा प्रेमी, वापस यूरेक्स, काला जादू, call ;- +91-7347090660", "happyelephant2": "LOST IN JAPAN COVER!!!🙌", "c.h.a.n.d.r.i.k.a.insta": "@sejalkumar1195 what about shooting the Japanese Life style 😉", "sanjana_1196_": "Fashion styles in japan we can recreate in india @sejalkumar1195", "sapnagargstudio": "Wow 💖💖💖💖💖💖", "sudhirdangi3": "hy", "vaishnavi_massive": "So cute little post", "pubali_2000": "Nice dress😍😍", "si_khaa": "Something like what Japanese people have views on Indian people their lifestyle etc. Happy journey love love ur videos❤", "ddipshidas": "😍", "sensami": "It's Autumn there and the country is full of bright vivid maple trees painting the cities yellow and orange; May be you could do an Autumn themed video. 🍁", "_p_a_n_k_h_": "@sejalkumar1195 mere CLG bhi aaao srk bhi aate the an aap aao", "shivam7205": "Fashion in Japan ?", "minazlailasayyed": "Hi Sejal...Looking so pretty...A unique personality in all...It sounds amazing that you r going to explore Japan...Please update us with Japanese food, Japanese traditionally outfits and their culture.", "life_in_a_lie": "Japanese cuisine may be? Since it is so well spread and growing really fast. Cannot suggest about how you want to approach it but I am sure you'lk figure that out creatively", "bhumika_mittal01": "U shud checkout the latest video of Vagabrothers (although it is on Hong kong) but u can make a video somewhat same in Japan💖", "__.papithax.__": "You can make a music video of Shawn mendes new song lost in Japan it would be soo great #mendesarmy @sejalkumar1195", "shutteruppp": "Hey guys I have a photography account and it would be nice if you could go check it out and follow me 😁🙏🙏💕", "one.life.one.journey": "Beautiful ❤", "vaishaalisaxena": "Dikh kyun nai rahi tu @khushi.dhasmana", "_dreamzcatcher_": "Japan?!!!!! Just dress \"kawaii \" like you always do. And say \"konnichiwa!, watashi no sejal desu. Yoroshiku! \" to you people you meet. 😁😍😍", "habibam689": "Oh sejal then there is alot of fun with u love u", "nikki_udhani": "Video suggestion: when indian people visit Another country", "manya.muthreja": "Trying Japanese food", "khushirohra_": "@sejalkumar1195 where did you get those heels from!?😍😍", "priyankagandhi_17": "❤️❤️❤️❤️❤️ Your dress💃", "musk_shah91": "Loved your shirt, how much is it for???", "28_harshita": "😍Nice outfit", "r.i_c.h_a": "Hey, do a tokyo street fashion look, something similar to which Safiya nygaard did in her video11", "keerthikumarmakeup": "You can do a video on trying Japanese craziest food 🥘 eating food in night markets n all", "_charissefaith": "Hunt for sushi", "annu.tinu": "places to eat n see in japan 😁 or loke japan fashion inspired vedio 😊", "rechu_2020": "You’re the prettiest 💖😘 love ya #myfavyoutuber", "shaileh_huh._": "❤️", "giasingh_1946": "Please remake Shawn mendes’ lost in Japan music video 💙💙💙💙💙", "shrkunal": "Prettier...❤️", "iijayshreeii": "Omg japaaan is literally my dream. Please visit ANIME. It is literally my wish to see them. And their stationary is so coolll💙💙💙", "__srush__": "Sejal where is mohak???plz bring him back!!", "i_m_that": "Someone who spends her life on her parents money is advising middle class kids about careers! Irony!", "rahulkumar17091": "😻😻", "mayur_dc": "Gorgeous @sejalkumar1195", "nitikatulsi": "Where is mohak?", "rluizgabriel": "🍀...", "shivanichaudhary2": "Pretty and powerful 😍❤", "oye.arpit": "@sir_abhinav tereko pictures me khoj re the hm😂", "deepika.nandan": "Hey do a shopping spree kinda video u get amazing manga stuff in Japan", "krishnavenikavuri": "Lost in Japan cover", "tyagi6777": "Excellent", "fave.tiara": "I think definitely something about their clothing! It’s so different and authentic ! Plus their traditions! Like the tea ritual, love for karaokes. All things that are very different there!", "rise_of_the_gamers": "@sejalkumar1195 AND YOU MUST ABSOLUTELY WEAR A TRADITIONAL KIMONO, PLEASE.", "srihrithi": "Something like Street style in japan and cafes or places to visit in japan", "anagha_nagrare": "Everything you do is craative 💙💙💙 but plzzzz still have the vlog🤗🤗😆....it would be amazing to see Japan ...the Sejal way..!!!", "mandira_das": "Do anything else. But please vlog as well. Please please vlog. It's fun to watch", "pankhuri.21": "Collab please with @ashnajf🙆‍♀️😍", "pujan7500": "Nice on my girl 😻😻😻😻😻😻", "rasmeeta_stha": "Omgg you coming to japan? You are inspiration for me . Please meet me once. Will roam around tokyo.", "sravya_majety": "BTS and BLACKPINK", "_that_bong_girl_": "👌", "isonamsthakur": "Whats ur height ?", "sim.rann.away": "@tomar___sahab I see you", "joesheril_10": "Try some Japanese dress like kimonos etc explore their food 🌸 @sejalkumar1195 for your video", "shreya.shama": "Hey sejal! I'm not the 'comment person' but yaa if you are going to Japan and you want to shoot there, it would be of great fun that you talk and show the technology they've been using there as it's the most developed country also there attire and may be some food😂", "theodoragomes": "@sejalkumar1195 COSPLAY", "madiha_khan_1510": "💖😍❤👌", "siligudi": "why not discover the street food/snacks and do a review on the same?", "iamanuragg": "Cosplay this time... anime, pokemon etc", "__pepper__mint": "💕💕💕 waiting for the video", "mera_shiva": "Indian trying Japanese street food", "shashankk92": "It was truly motivating. The experience was quite different! 😍😍", "thefragranceofartistry": "Real soul😍", "girishalini5": "Hey sejal...shoot any fun video in japan", "its_atraye": "Street style of Japan..", "anika_sindwani": "Where and what to eat in Japan!", "naina_khosla": "Make a vlog", "sunidhiipandey": "❤️", "sonali.08": "cute", "words_with": "Difference between India and Pakistan..in any way you want😇", "plakshachaudhary": "❤💗💚💙💛💜🖤😍😗💕💘", "pujabhattacharyya": "If you love food you can definitely make a video on different Japanese famous dishes and the different types of tea they have because it's very popular and healthy. Don't worry on gaining any weight as the food is very healthy as we all know. Just a suggestion. 😁", "prachi.i_i": "You should definitely wear a yukata or kimono when you go to japan you would look so kawai(cute) 💕😅", "cynical.snitch": "@anushkadahi.ya youre in the photosssss👌👌", "amrita_singh632": "You look pretty💟", "_var.sha_bala_": "Well from what I know you have to go to Harajuku !!!!", "shivani_j03": "About the food of Japan or technology in Japan", "fanatic_nupur": "Yeah.. Visit the capsule hotels please...", "ananyamahishwar": "You are dressed up like Korean people. 😍 Yepuda 💜😍", "thewriterwillow": "🔥🔥🔥", "archi3_archana": "Where are those shoes from 😍, please outfit details!", "chhavikhurana": "Shop from 500-1000 yen outlets. Also you can try shopping there. Many outlets which give same products at much cheaper rate. I left you dm ..let me know if u need any other help", "jaykumar_parkhe": "Beautiful Dear 😍😘💋💋💋💋", "dr.annamarie_008": "Just look at you😻💓", "shivam3vedi97": "Things that happen when an Indian visits Japan (all the food differences, outfit differences, their transportation, their lifestyle and ur adaptions to all of these)", "picked_a_pen": "@sejalkumar1195 I tried a traditional japanese restaurant", "su.nnysingh102": "Awesame", "sutoparageous": "Make a video of tasting different versions of KitKat flavors in Japan wanna see your reaction 😋", "__meandmine": "Ammmm plz make a vedio on how can people start with fashion blogging and collaborating with brand's @sejalkumar1195", "avniverma17": "🔥🔥🔥🔥🔥", "rimpyyyff": "Try the suicide forest 🔥🔥like the pauls", "__aastha07_": "A music video for never be the same", "davekalpesh1": "Beautiful niece 👌👌👌💝💝💝", "the_mayathing": "How about getting a makeover in Japan,not according to you but according to the hairstylist(whatever he feels will suit you). Want you to change yourself,it's been so long....❤❤❤", "sachin_prabhu": "Lost in Japan cover it is 🤗", "tanvi1295": "Outfit 😍😍😍😍", "pessimist_6": "How can you be soo beautiful time and again!!! I adore you girl!!! ❤️❤️", "sheona_everett": "@sejalkumar1195 for your Japan video if you follow @safiyany you would know she did a Tokyo makeover. She dressed up like the Harajuku girls. Maybe you could do something related to that as an Indian blogger.", "ritika.gupta7": "You should totally do a vlog ....we all would love to see that ...also a music video would be really fun...lost in Japan by Shawn Mendez could be a good choice", "mudrabhagat": "top 5 place to shop in Japan!", "snazztastic": "@sejalkumar1195 JAPAN VIDEO SUGGESTIONS- 1. a Japan street style video (it's pretty intense) 2. A beauty products haul 3. You can try out japanese street food or snacks (ex- they have crazy KitKat and Oreo flavours) 4. Make a vlog as well though :p", "ps_pranjal": "Food u loved in Japan @sejalkumar1195", "archana.subba.129": "Hey m frm darjeeling....u r my star❤️😘", "vasudhajha": "Food video🙌", "surabhi_limaye23": "Outfit details please!", "_bookish.wonders_": "How about you trying out the famous dishes of Japan?", "vidhi.chotai": "@sejalkumar1195 Can you collab with @ashnajf ? She lives in Japan, it'd be so much fun!", "herecomesjony": "Straight out an anime 😮", "enufdrama": "Checkout safia’s video on Tokyo’s street fashion. That would be awesome.", "_kalyanie_": "You can do style in a budget video of any street market of japan...", "ds.preeti.24": "Japan fashion clothes video ? Like safiya nygard? @sejalkumar1195 ?", "debanjalisaha": "😍😍😍😍", "saijaldalmia": "@sejalkumar1195 would love to see anything related to shawn mendes! Plssss😭🎶", "gwiyeowoyeoja": "Hey beautiful fellow A.R.M.Y 🙃 I am right ,right?", "srishtirawat23": "❤️❤️❤️", "desibrigade": "Bored of wearing same Indian outfits everyday? Follow us for Indian Wear Outfit Ideas ❤️ Get Inspired and create a new look everyday 🌟😉", "manaarkhan1": "😍", "jyotivashist_": "Style in Japan and how it is different from the one we have in India!", "sejaaaaalll": "What I eat in Japan.....", "_namita.s_": "Outfit details ? ❤️", "vimallaharawal": "So Beautiful", "swathi_eeee": "Do the one that safiyaa nygard made and u made one Delhi fashion video inspired by her na! Something like different fashion styles at different cities of Japan...or mainstream Japan streetstyle and makeup or something rltd to that! ✨✨ Wud be bomb😀", "vaidehi.patel22": "If u going to Japan .Jst enjoy that place.i been there. Everything is so beautiful specially gardens.dont forget to go akhii bar a if u interested in games nd stuff. If u want to buy fabric for ur mum.u could do roopongi .u can get cheaper pilazzo pants nd all dresses too 😊.defo u going to love that place.", "mish_nidhi_": "You can make a video on japan fashion, what type of clothes they were, maybe colab with japanese youtube for music video where you show their fashion trends fused with music. Hope you like the suggestion. 🌸", "reusily": "Adorable ♥️♥️", "sukhsamruddhi": "What do to in Japan. Why is Japan worth visiting. What not to do in Japan.", "anushreeganeriwala": "How to survive in Japan when you dont know Japanese on a trip !", "atharvatilwankar": "Lost in Japan Music video", "aanchal__chandel": "You can make a video of how japan is so ahead of us ..", "nivedita.18": "You look so so pretty😍", "pavnisuri": "Plsss do a vlog!!!!", "sravya_godavarti": "Trying japanese products", "ayushigada1": "Get a Japanese makeover...love you ❤️", "shashwatjn": "@sejalkumar1195 ft. @sejal_rohatgi 😂", "dreradutta": "A big shout out for speaking about mental health! Glad you are reaching out to the millennial crowd.", "_srooti__": "India Vs Japan ... clothing food traditions pls 😀 btw big fan of u 😬💝 lots of love 💃", "ariya_hegde": "Great Going Sejal", "anjalim2626": "Why not a vlog?", "hrishika_k": "We all know japnese style is very different..U can be there wearing their style n make the video about it......Also plz try to vlog as well coz u r bessst at it", "santoshbharanger": "Superb", "oyegurmeet": "Music cover video in Japanese style 🔥", "swatijain4": "Love your outfit.... 👌🏻👌🏻", "im.cinu": "Pretty", "sisteristan0515": "My idol ....sejal you can make video on Japan street food challenge because I have heard that the street food of Japan is really good and even you can make video of dance at Japan 😍😍😋hope you like it love you dear lot of love ... keep going and I will be supporting you till my last day 😘😘😘good luck", "varshinireddyy_": "@sejalkumar1195 People in Indian restaurants vs people in Japanese restaurants or street style in Japan Vs street style in india.lots of love di!", "shreya.98": "You look so pretty ❤️", "p.tanya_3806": "@sejalkumar1195 If you are visiting Japan, I really want to know about the food, fashion as well as technology of them. Maybe you could make a food verdict video or something like that. Maybe a traditional Japanese dress tutorial which we can wear in India too. Or an Outfits inspired by Japanese people video. Also don't forget to upload photos on Instagram Di. We can do sightseeing of Japan while sitting at home. I really would love a LIVE VIDEO!!! Maybe you can even upload it on your IGTV. By the way love your videos so much. The recent collab with Komal Di as well as the stages of becoming a BTS fan was awesome. Been on your channel since about 400k. Gonna be 1m soon. Love ya❤❤❤ Hope you see this comment and these suggestions come of use to you.", "khurana_dhriti": "Are you going to attend BTS concert in Japan????", "ashna__98": "10 Things to do in japan 🇯🇵", "nas_jahan_": "Video upon the cuisine of Japan, different kind of sushi video 😄", "jeet.vision": "Black and white 🔥🔥🔥🔥🔥💣💣", "priya_tusnial": "Vlog + things to remember when you are traveling to Japan , different lifestyle of Japan", "drunk_dead_duh": "We want a video on HARAJUKU FASHION and the most imp LOLITA FASHION...and don't forget to go thrift shopping in okinawa...and to try out a YUKATA or KIMONO...!!!", "novachowdhury_10": "You are looking like a 18 year old cute girl.😍", "apoorva.km": "Food!! Do a mukbang...", "bhardwajsanskriti": "Japanese fashion trends...they sure have some really unique and wierd ones..😉😉 @sejalkumar1195", "zinia_tahassum_zini": "Nyc", "rkive_23": "Try to shoot the street food and night life of Japan it's amazing and the night market as well @sejalkumar1195", "soniya0725": "Trying japan food and outfit while giving it a sejal touch🌞", "rishikasajwan": "Is she going to the BTS concert in Japan??? 😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱😱", "lekh31": "@sejalkumar1195 ur footwear from?", "akshathaneeraje": "Trying Japanese snacks!", "the_hyderabadi_girl_": "India vs Japan.. food clothing life style and everything.", "ssharmaxxvii": "....nice", "ananyaabakshii_": "Wowww", "starfish.arts": "Go to thrift stores on Japan, cheap, super unique clothes of literally any kind!", "mostlyshameless": "Hey! Make a video maybe on trying Japanese food !🙈 Or maybe a fashion haul there? Or...When Indians go to Japan...", "mishkat._______": "Aawww u r looking sooo pretty pretty @sejalkumar1195 spcly the dress", "ericahazel_xx": "SUCH A SWEETHEART!!", "devrahul_20": "@sejalkumar1195 next video is on Japan restaurant food which one people eat there ......????", "narmada_52": "When u go to japan plzz try soba soup,sushi, shashimi,tuna ...its kind of different fishes...n they r so tasty u have to give it a try .....its really good😘😘", "lola.0395": "Food tasting in Japan. Or japanese try Indian food video", "avanti20": "Have make a video of this", "anshikabirani": "Where did you get your heels from?", "somethingsarcastic__": "Try harazuku clothes...", "saumyaaswal": "Omg! You should like make something related to Shawn Mendes new video LOST IN JAPAN ❤❤❤❤❤", "vidushiinigam": "You should do a video about trying Japanese and Korean food which BTS like and tell your views about it and may be recreate the BTS poses etc.", "_thisisntwhatyoucamefor_": "Harajuku fashion!!", "anonnymoosse": "Love your outfit!🔥", "naybnow_hr": "Street food 💞💞", "anishaislam02": "I have one suggestion @sejalkumar1195 try to improve the sound quality of your video.", "sakshi_dora": "Japan😍😍 finally!", "priyasmita_ghosh11": "Japan is insane why not a travel vlog or may be best places to visit, food etc", "_joann2911_": "U could make a video of u trying different Japanese food", "dipa_sd": "do a video by which we can feel how you enjoyed.. 😊😊 @sejalkumar1195", "astha_khimesara": "Japanese gardens are famous. Can u shoot something around them. 💫", "ahsassy_18": "Awesomee😍 keep going❤ next vedio style on a budget in japan😍🌍", "_niranjani_rao_": "Japan treats like their candies chips etc tasting😍😍😍😍😍😍😍", "clbr1735": "You can make a video on what Japanese think of India as a country? Or about Bollywood.", "vishruta_kohli": "Japanese food ❤️", "sarvesha21": "lost in Japan cover 👀", "revathi_1005": "Things Indians feel crazy about Japan😜...also happy journey!😊", "saloni025": "You were amazing!! 😍😍 I can spot myself 😃 #fanmoment❤️", "moodyrekshana": "loved every minute of it❤️❤️", "anushreemoitra": "Outfits inspired by the Japanese sense of fashion..", "mypinksuitcase_": "I love your outfit. You look gorgeous! 😍", "chickengirls07": "U", "_anshum_sharma": "Beautiful 😍😍😍😘😘🔥🔥🔥", "anantasarkar9": "A video on \"How to Enjoy Your Best on a vocation\" maybe🤔", "__.ishaniii.__": "Lost in Japan cover song + video based on that song😎😎 That would be a really cool this Sejal!!!!! Plz do this for the fans of Shawn Mendes!!!!! Love u a lot and you're my idol😘😘😘", "surabhiverma.official": "Create a video on japanese culture, maybe their traditional outfits, food.💜💜", "jyoti8135": "I really loved your outfit😍😍😍 and please visit korea too 😍😍 want to see lots of vlogs 😍😍❤❤ @sejalkumar1195 ❤", "kingkhan0211": "Please go to the owl cafee", "sharanyaa.deva": "Trying snacks from Japan @sejalkumar1195", "shaiktahira_58": "😍", "____ahana._.007___": "I think u should do a video like - India vs Japan... So u could be able to add everything like their food, culture, clothes etc. Becoz lot of people r commenting about food n clothes", "isonam__": "72RiN piCX💕💕😘😘😘😘😘😘😘😘😘😘😘😘😘 FoLLow me Just Now FoLLow back💋", "_bhuvana_priya": "U could film for making Japanese balls that was viral that one's made from aluminum foil", "miniature.panda": "Styling kimono", "aakriti_bhanjo": "I Love your heels!! Actually wait the whole outfit ❤️", "harshitha_reddy09": "💖", "anchalllll_23": "I love your vlogs ...nd videos as well....and don't wanna miss any of them...love uh a lot ❤️❤️", "riya_kheria": "You could do a comparative fashion thing.. like fashion in Japan v/s fashion in india", "aura_autumn": "Japanese fashion and culture", "shivaaaaaanii": "Can we get to watch a video of you trying out some authentic Japanese food? @sejalkumar1195 You could also visit Jiro's Sushi and tell us about your experience! ;)", "yeshwanthvy": "Make video on Pokemon and other japanese anime crazy stuff. And food obviously", "bunchim_tsupha": "Food of japan...", "themillionthfoodie": "Probably something related to the food in Japan? 😁 They have over 300 flavors of KitKat I've heard! 😂🙈 Maybe you could try a few and other unique food you get there! 😃", "seekwithsukhmani": "Things to do in Japan 🌻", "r_u_u_s_": "Outfits inspired by Japanese people.", "mehulrachel": "A video on Harajuku fashion!", "bhaktiteckchandani": "Sejal youre a staaaar. ✨✨ So stunning man and sweet at the same time. Im a biiigggg fan ♥️♥️", "tanuellaa": "QUEENNNNNNNN😍😍", "aanyagupta_11": "💖💖💖💖💖", "richamathur21": "Come to our college as well ... IBS GURGAON", "_____.zayn._98": "👌👌", "aestheticfashionxx": "Omg girl you are fabulous!! Totally crushing over your feed right now ❤️❤️", "pragyasinha_": "It was amazing meeting you!! ❤️❤️", "anirudh.mov": "😍😍 it was great meeting you.", "kraatssss": "@sirigurram look at the last one", "_eyecandyl": "Sejal i love this crossbody bag of yours .. can you pls tell me from where did you purchase?? Pls .. @sejalkumar1195", "stutigogia": "🖤🖤", "marriedfriends": "New video idea...Food experience in Japan", "shadesofmoon": "Sunshine building, Tokyo! Must visit✈️", "gayatrikhode66": "❤️❤️❤️", "divya.patel____": "Nix ❤❤❤❤", "_riyaa_31": "Nice work 😘😍", "shreya_desai09": "Love this look❤️", "anvi_1408": "Hey sejal❤️. I am a big fan of you.. I just love you from bottom of my heart .... Ur everything to mee.. you are such a inspiration to all of us.... Lots of love to you.... All the best for upcoming events in your life... And we have faith that you will fight with it and will make us proud again ...💜💜@sejalkumar1195", "_.rithuu.__": "Awesome sejal sissy 💞be happy like dis!!❤️", "travelvlogiv": "Wow yes definitely a topic that needs to be adressed! Good job🙌🏻", "pottertanu": "Keep going girl 👍🏻", "siddharth7951": "Was funn , enjoyed it 😍"}