{"ripple_parmar": "I commented on @mostlysane videos as #swaalsaturday but she didn't replied ,not even one of them. I truly love her but after that \"asking questions in cmnt section and getting answer\" is what m not believe in.", "komal261995": "What is the one common thing you guys have in your videos", "taaanniiiii_": "When is the video coming up? I'm waiting aff as both of you are my favv. 🌈💜", "gracegill_1_1": "Sejal where is tht skirt from it looks great", "abhilasha_kulkarni": "Hey sejal and prajakta! More power to you girls. What's the major difference in the ways you both deal with content creating? Who are your youtuber inspirations?", "sanjana13mhatre": "If you get chance to swipe your roles in you tube what video you will create???", "mytraveldiarez": "Sejal and Prajakta...both my favs😍", "serverping968": "I think this is a old picture cause P. Hair is little long now.", "shalubhati_": "If not YouTube than what would you be doing??", "maya_rajput.333": "Two best people😘", "namyajainn": "What was your reaction to your first ever fanpage?", "shethetroublemaker_": "Hey so it's about, you too are my favourite youtuber and also I wanted to start my travel vlog and sort of fashion vlog too. So how to start ?", "supriya_medankarshelar": "You both are inspiration to soo many girls... keep it up girls...😍", "rekhapathak862": "Two in different pose. Love it", "im_aks_official": "Awesome ❤️❤️❤️❤️❤️❤️❤️", "_faezeh_em": "👍", "bab199999": "Visit http://bit.ly/2GnGVGH get amazing deals on clothing, jewellery, bags and make up accessories. Also win free gift on shopping over Rs 199. Use code SAK10 and get additional discount per order.", "queen_kour_": "💗💗", "nishika520": "Check my status guys", "unobsessed": "what camera and tripods do u use!", "mrinalidass": "Beautiful 😍", "theuglyduckling.biz": "Love 💕💕", "atreyaganguly": "@mostlysane ur trying to be sexxyy ummm ??🔥🔥😍.....Btw I love ur sex aapeal", "akyadavjay": "😍😍👌", "zainab_fatima.faisal": "What editor do u use @mostlysane @sejalkumar1195", "anushkaagarg": "Apps you use to edit your videos?", "aarya_1805": "What inspired you to take up YouTube ?", "amrit_4q7": "🔥", "shining_thara": "Your fear when you dont get a subject for next video", "astrologer_sonu_bhargava": "Astrology by love or love marriage problem solution specialist, astrology by get your lost love back. If you are suffering business problem or carer problem then just msg me I will let you know what will happen with you also if you are suffering love problem then don't worry I already solved so many love matters so I will help you to shortout your love problem you can whatsapp me & call also in this number +91-9649730851", "influencing_you_tuners": "How was your experience before & after posting 1st video. & how was your experience before and after posting latest video .", "instaagrammeerrrrr": "What was you reaction when you got verefied on insta??", "rakshanda_1326": "Nowadays everyone knows which youtubers are famous on YouTube like you Komal parajkta aka mostlysane so normol people who also want to start it have a fear of that their channel will be floop because when you already have so many talented smart and the youtubers who will obviously get million subscribers that can't happen to us do you and Prajakta can find out a solution for this if you feel relatebal xoxo rakshanda", "nehaldugar20": "How do u thought that you tube is a right option for u both?was comedy or public speaking was ur passion or u later developed in that?hope u answer this question. ...😊", "mridulmakkar": "So all of us have good days and bad days. Does it happen on the bad days that you end up questioning your decision of choosing Youtube as a career?", "shrutiii_iii": "Your both hair care routine? Please tell❤️", "brijala.pandey": "@mostlysane and @sejalkumar1195 do u think youtube as carrer ??", "the__patthartara": "Hey Sejal I am a big fan of you and @mostlysane , I watch you both work really hard everyday , giving your best everyday. You both inspire me and millions of other people in every way, I just want to congratulate you both for being what your are. Love you both ❤️ @sejalkumar1195 @mostlysane", "nabhahoovas": "What thing inspired you both sooo much and and are you not feeling jealous that mostly sane as crossed about 3 million like who do you actually feel that you are about to reach 1million what about that gap I want you to answer this @sejalkumar1195 please", "cute_lil_panda_25": "Questions: 1. How much time u guys need to edit ur videos 2. How did u convensed ur parents to open it channel 3. How did start meeting and get in touch with other youtubers 😋😋", "paudeldpka": "Mostlysane did u convey my msg to sejal 😚😚", "harmony_2729": "Can one manage studies (for board/entrance exams etc exams) and YouTubing together? How?", "__priisha__": "U both are just amazing creators. I want to know how both of you handle stress and anxiety.", "nazleeeeeen": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "rana_aastha": "Will you continue doing YouTube? In future", "shivam3vedi": "How did u handle that pressure of living upto the expectations? Like most of the youtubers rise with that one video that gets viral (mine just gave me 150k subscribers) but its so hard to follow up with that. its so scary because you’re suddenly put in that space. Also when did u both decide that you’ll do youtube full time?", "smruti_bapat": "Can you do a haul video parody", "wanderingsari": "😍😍😍", "ray_649": "Don't you guys get scared when you start making a video and when you are in front of the camera???", "ritzvarma": "I mean comedy vedios..", "nsameer79": "👍👍", "movi_28": "@sejalkumar1195 @mostlysane ...talk about the different niches and their growth..how to discover your niche..wht sre the upcoming niches..or the unexplored areas that hv lot of scope.", "___kari9946_": "How to begin youtube as a career and be so popular like you guys??", "sapnagargstudio": "This is going to be epic 🙌🏽🙌🏽🙌🏽", "meaninditasinha": "Should I pursue being a youtuber as my career option ? Please suggest 🙂 Sejal , you're really damn great at travel vlogs and Montu is love ❤️😂", "sandhyasingh9015": "What if u could include @komalpandeyofficial also in this video.", "_iamrinku": "How to inculcate such awesome speaking skills u people have😍🔥🙌", "tripster_420_": "I hope either of you read this", "mitali_the_maker": "Ask @mostlyinsane to land you some #bindasslooks... you still have that shywala face! I wish you glow bindass on social media like no one dares to do bad", "gargi2602singh": "How to find our own space on youTube, when you are surrounded by people doing the same thing.", "rdbiceps": "Both are looking hot 🔥 😱", "onefanparadise": "You both are my inspiration. Thanks for bringing smile on our face with every video & parju Di your meet & greet video brought tears in my eyes. Love you both ❤❤❤😘😘😘", "bhagyahegde5": "How do you cope with peer pressure. ?", "ananyamantha": "Are there any videos you guys plan on doing for 2019 that’s different from the content you usually create?? ❤️❤️", "kiwalabyetimothy": "Cute", "elima_sharma_": "What is the most embarrassing moment you faced while shooting in open..😍", "neeruyadav_15": "Favorites in a frame😍💕😘😘", "aizafaisal_": "Really awesom😍", "_ananya_5": "Hi sejal I love watching your videos! Seeing who's videos you got inspired on YouTube you got a feeling that I should also have a youtube channel!!", "atisharajsingh": "Favourite people❤️", "gunn_1827": "Hi sejal and prajakta i want to know that vo sara content jaise boyfriends and some bad words uspr howw do your parents react? Ps i love videos of both of you!", "cheshtanagpal": "Do you guys check each other's subscribers and views and envy that?", "pournami09": "Your most embarrassing and stupid memories? @mostlysane @sejalkumar1195", "tanyaa_00": "How did u to meet", "akshita_0404": "U show try to swipe your styles...it would be fun! !!!!", "akanshikasharma": "Almost all the content is same so how to outstand", "cb_mandy": "Mention 5 good things and 5 bad things about each other", "sahibaa.bhatiaa": "Favz❤️", "sachin_mathu": "Two beautiful girls", "praju_forlyf": "Praju 💖 💖 😍sejal 💖💖", "mayur71094": "What would u do If suddenly youtube gets banned in India or is permanently shut down?", "smriti.nagar": "Suppose there is a complete ban on YouTube in India, then what will be your alternate career.", "bapan6435": "Excellent", "_._.crazy._.doll._._": "What is the toughest thing as a you tuber pls answer my question", "fatimaspeaking": "Darlings", "zeenazachariah": "how did you realise you wanted to do youtube and what all you went through before that first video of yours? lyk ur xprnc nd d prep u went for it... luv u both😘", "jain_deepika06": "Picture perfect😍Please bring a collab...", "sakeofstyle": "How you both started your career?", "take_tellinyo_military": "col❤️❤️", "sow_sss": "Which are your fav videos frm each other's channel?", "biryanimonster_23": "Two fav bloggers together🔥", "vaishnavivennela": "This is not a question but a task... Feed each other in your left hands.... 😂😂😂", "sakshi_519": "Excited ... Looking forward for the Collab... Post it soon 😍", "sen_aakansha001": "I and my best friend always wanted to open an youtube channel we are about to join college this year and we are planning to open a channel soon can we get a few tips it would be really good", "fashionvibes_happy": "What to do if your parents aren’t supportive plus how to earn money at the age of 18 apart being influencer or something", "officialpreetisingh": "Hey Sejal, you are awesome.😊", "b___r___i___s___t___i": "Hey @mostlysane & @sejalkumar11935 diii..love you much! I wanna know just this! How much you love your fans 😉😉😉 ?? ♥️", "ananyaabakshii_": "What kind of bond do you share?", "_appu_gaaruuu": "Do you Prajakta before??", "sahithialeti_": "Inspire of receiving so much of hate everyday , how you guys still be positive ?", "jyotsna_shadesofgrey": "U two my favourite and the coolest bloggers Eva!", "prachibapna": "This is going to be funnn💕", "in_spire_red": "We all know that you two are different type of creators but what are the similarities that you feel is in your content and working style?", "lit_yet": "Have you ever planned of entering bollywood?", "thelightandstyle": "Wow!!! Lovely picture 😍", "krushitasurvi": "What was your first impression on each other? and how and when did you both meet? ❤️💕", "mylillcorner": "how do u plan your daay?? dont you get tired and exhausted after a long day of work?? @sejalkumar1195", "shivangi_0410": "You guys coming to Ahmedabad can u guys have meet n greet ??", "iisagoii": "♥️♥️♥️♥️", "im_dat_gal.yeah": "Hey sejal di which one is your favourite mostlysane's vdo n Prajakta di which one do u think is ur favorite Sejal Kumar's vdo...btw looove u both...lots n lots of love from Trijayee", "sindhuvermaofficial": "Which camera u use for shoot...", "kreepa_acharya": "And you both do acting of each other??😂😂", "krishnavenikavuri": "Thing u didn't tell the other member something of yourself", "_angel_talks": "Cutiessss", "sukruthi_pattabi": "I kno there wil b many situations wen ua opinion doesn’t match wit ua team on you tube ... how do u deal wit it n make a good video finally??!!", "reusily": "CAN'T WAITTTTTT 💫", "mukesh.gelot.1675": "Nice pic", "himani1080": "how ever felt that konal or prajakta is your competitor??", "iamswapnilsingh": "@mostlysane Hercules 😜", "shahmeen.184": "my two most fav. in one pic love u both...", "aftab.nizamani13": "So beautiful", "bhoomi_menon_8": "Bro I want to open my own you tube channel so what I have to do.. Can you give me few tips please!", "shivangi9800": "No questions.. Jst wanna say u both r thee besssttt creators on youtube i knw.. Luv u both❤️", "rose.granger.weasleyyyy": "Why you both so have the queen aura?😍", "weirdy_vein": "How do you make self motivation??@sejalkumar1195 @mostlysane", "sammy_15804": "This is gonna be lit🔥🔥🔥🔥 @thechicfactor_17", "anjalikum_096": "Much awaited one!!! Super excited😍😍😍", "___s.u.d.e.s.n.a.a.a.a___": "2 of my most favourite youtubers in the same frame.", "_ruchhhhh": "What was that point when u felt of putting up the first video on ur channel??? Please answer me!", "_ecstasy_._": "How were you guys academically? Has that made any difference in what you are doing now?!", "harshitha_reddy09": "😍😍", "nishakhitz": "How did you guys meet and what were your thoughts about each other and how is your relationship evolved since then???", "kanakaaaa_": "How much money did you spend on an avg per year during your initial period for promotions and ads of your videos? For your videos to reach max people and get more recognition?", "music.love.beyond": "How do you both met", "debangshi_saha": "Two of my favorite YouTubers of different genres in one frame and doing a Collab ...This is the one thing I have dreamt about everyday .. Question- what was the first and favourite videos of each other ?", "pragna.rashmi2": "Who are your inspiration for starting your channels ??", "ridd.__": "One word for each other", "harley_eden": "How did your youtube journey begin? Do you ever thought of giving up youtube after you started?", "nupuurrrr": "Tell us about your journey as a Youtuber\\ Influencer! Lots of love ♥️", "sanjana_1196_": "Why no collab both of you till now? @sejalkumar1195", "nandu_mukunde": "Who is your YouTube inspiration ??#loveyou", "jednorozec_keya": "Hi @sejalkumar1195 and @mostlysane! 🙂 I really like your content ideas and love the way both of you translate those ideas into amazing videos.  Here's my question for you: \"If you hadn't been able to make your respective YouTube channels a success, what careers would you have pursued and, would those careers somehow be related to the work you're doing through your videos now?\" Have a nice day! Love, love 💙", "muskangangwani": "When you started did you expected your channel to do so well..????", "prajaktaaaaaa_insane": "What is one thing you adore about this YouTube platform the most? @mostlysane @sejalkumar1195 please follow me also. Love love 💕", "riya_rajan1829": "Thoughts after posting your very first video? When did you get your first payment from YouTube?", "racheliza100": "Tell us some strange thing common between you guys and what you like in each other?", "ritthhh._": "Your guys' first impression on each other after seeing each other on the screen for the first time? Btw love you guys so much❤️", "itsme_sanchitaa": "what style do you like the most ? ethnic wear or casual wear . SEJAL !!", "_missmatch_": "If not YouTube what would you guys like to be or be doing rn?", "the_rachitasharma": "What is the most amazing thing about being a YouTuber??@mostlysane @sejalkumar1195", "shraddhhhaaaa": "How do you brainstorm? What is the process that leads to the theme of your videos?", "mhktilwani": "Did both of you faced any obstacles through your youtube journey?", "akanshi_verma_": "I think that short hair is a secret and a way to look cute and beautiful nowadays . It's true or not ?? 😍😍😍😍😍😍😍😀😀😀😀😀. I am a big of both of you. And lots of love to u. From -AKANSHI", "muskaanverma22": "Myyy favvvs in one frame. Wgen did you meet? And do you watch each other's content? Do you feel as a competition?", "anu_agarw": "1 thing u guys have in common? Love anushka ❤ #plzans", "123prajaktaa": "How to earn from youtube do they pay after u reach 100k or something else plz answer this luv u both 😍😘😘😍", "mostlysane_is_the_best": "How does it feel to find yourself at the stage you currently are? I mean you must have started from 10,000 subscribers and now you have zillions of your fans/(dumdums) .", "sarika2325": "Does Revenue from YouTube fluctuate every month?", "abhishek_mvh": "@sejalkumar1195 when r u coming to Tiecon Hubli", "__wow_mom__": "Which is one similar thing in your Youtube journey?", "anishanepal1": "Is YouTube a stable career option??", "_thephotofactory_": "Can there be anything better than 2 of my favourite YouTubers collaborating?🤩💣🔥❤️", "priyanka3011_": "@sejalkumar1195 How you got to know about BTS and do you any other kpop groups", "niharikaniha7": "At any point of ur career do u faced sexual harrasment or any mean things", "samprathi.rao2": "How do you manage both your studies and YouTube as a career??lots of love to Sejal😍😍", "xswarax._": "Omggggg! I'm so excited to see my favs jn one frameeee", "muskan_bhojwani": "1. How has you tube changed the lives of people in these few years...? 2.And how good it is that internet, media and social has achieved this level of transparency.? Love to you both.", "aswathyyyyy": "What motivated you to post your first few videos?", "angel_jessica30": "Love u bothhh😘😘 @sejalkumar1195 @mostlysane ❤️ sooo my question is 🤣Have you ever laughed at the wrong moment?", "monika_n_gowda": "What's the most common thing you both share?? Lots of love to u both💕", "sky_walker_since_1999": "#asksejal you both make such a different videos but can you tell us 5 similarities that you both have ? @sejalkumar1195 @mostlysane #lovelove", "__saaaakshiiii__": "I'm late.. 😶", "design_your_nails_by_isha": "Youtube as a career or youtube as hobby???", "malghanid": "Have one question-best trip of both of u", "ojaswi.bansal": "What made you think you would be good at being a youtuber ? I love you both soo much 💖", "rishika08._": "Why don't you guys appear in a webseries together?😊", "vishalpandey98": "we want you 2 in a web series..😚", "_kamalbassi": "Were you both friends before YouTube?", "indirasharn": "what if you two got married in the same house unknowingly......i mean it yayy or nayy@sejalkumar @mostlysane", "mostlysane.love": "Oh can't wait for this one 😍😍💕", "harshitha_b_n__": "Who's your fav blogger ? @sejalkumar1195 @mostlysane", "swiftee__13": "One thing u hate n love about each other", "vimmy_87": "I wanna start my YouTube channel. Give me some tips. What can I do for it", "_vanshika_22": "#Mostawaitedcollab❤ Fvts in single frame💋 can you do a collaboration in future n make comedy videos ?", "sohal3982": "You are amazing. How did you market your channel when you had under 100 subscribers?", "rashikashish": "Two favs ❤️❤️❤️", "sojosvision_india": "can u check dm?", "misswildchild2000": "I make comedy videos and I'm stuck with script idea(for almost two months)what do I do???(I love making them)and being a new YouTuber,it is necessary to be consistent...", "mostlysane.dumdums": "😍...ab toh bass intizar rahega 😁", "anyonecancookwithdr.alisha": "I have a youtube channel related to cooking.. i m working soo hard for it but still get no subscribers.. i want to knw is it normal or some special case that (happens to me) ... plzzz sugest how to promote youtube video..promoting via adwords is ok or not??", "angha_05": "Love you both 😘😘😘", "revatinair113": "Finally both my favs coming back together after a long time.. so here's a game for you... Can u just swap Ur styles for a while in every way... Starting from the dressing style upto Ur YouTube genres?? Well love you both!! #lovelove @sejalkumar1195 @mostlysane", "aaannnniii16_": "Plzz do this", "poonamsamani": "@sejalkumar1195 @mostlysane Awesome.. My 2most favorite youtubers collaborating... It will surely be fun to watch.. Waiting eagerly for video to come... Love you both.. 😘😘😍", "ayushisayys": "Did you think you would be able to make this far and become something you are today?", "liza_dutta": "My question is when you both started out, how did you get the confidence and bulid the faith on yourself? The cut throat competition not just in YouTube but in other fields too make us doubt our Calibre at times.", "whobhavya": "Choose : for sejal ~ prajakta or komal for prajakta ~ komal or sejal", "kavyamayekar": "I'M LATEEEE!!!!", "utkarsha_00": "Do u get any youtube related anxiety?? Are there any insecurities that u have related to utube? If so tell us something abt it pls.", "krunalrajput13": "Where do you both get such creative ideas ??", "toiyaba_1599": "What is the first fan encounter of both of you??? how was that feeling ?", "i_banjaran": "How hard is it to grow on YouTube in this day and era as there is so much of competition and so many aspiring youtubers? What tips would you guys give to the upcoming youtubers and content creators?", "dipsikha_m": "When you began your YouTube journey, was it difficult to put yourself knowing that there might be people who will judge you? Loads of love to the two of you.💜", "obsessedwidmyself": "HOW DID YOU FEEL WHEN YOUR FIRST VIDEO WAS OUT?", "_namanxvasdev_": "I wanted you to know that you are awesome , and i like you . 😁😉", "bhawna1bhardwaj": "If u r not utubers then wht u do?? (alternative career)", "_bit_immature": "Both @sejalkumar1195 @mostlysane need to tell about there deepest darkest 💫✨🔥", "pavani_sai_2704": "Even I feel like trying some thing out of the box! Like u guys did!! Some suggestions on that!!", "ray_sunshine____": "My question is for Prajakta di....if you ever have a choice to choose Bollywood or Hollywood... Which one you will go for?", "deepakshisehrawat": "WHAT ARE SOME OF YOUR MOST REMEMBERED AND HILARIOUS CHILDHOOD INCIDENTS? ❤️❤️❤️❤️❤️", "shrishti10_09": "Are you anytime soon coming up with a fun video together??", "senguptadipshikha": "Where there any obstacles that you had faced from your parent's side? love you both!!!💕💕💕💕", "rashmeet.banga": "What do you feel about the uncertainty that comes along with the excitement in having the kind of career both of you have? Do you have a future plan or do you take one day at a time?", "rakasays": "🔥🔥🔥🔥🔥", "ankisu16": "One ☝️ technique you use to make your video awsome.", "saaz96": "Heyy🥰 How you deal with the YouTube competition between you both?", "diksha_014": "How did it feel when you first started YouTube and how does it feel now. Has anything changed like your opinions about YouTube as a full time job and what people say about it. Btw love you both @mostlysane and @sejalkumar1195", "pallak_aggarwal03": "What was the biggest challenge you faced when you both started your youtube careers?", "inner__chaos": "Always wanted this collab!!!!! So happy..", "prarthana.das": "Tell us about ap dono ko ak dusre ke konsa video sabse favourite hai?!", "shreyankathejaswi": "How did you get through the difficult phase of gain subscribers initially? How did you go from 100 to a 100k?? @mostlysane @sejalkumar1195", "deepika.nehra": "My favorites ❤️", "ishani.nagpal": "Will love to see the collab video.. My two favorites @mostlysane @sejalkumar1195 👭👍", "soumyagyani": "Apart from youtube nd clothing line..wht would u both @sejalkumar1195 nd @mostlysane choose as a career option", "alishba_irfan_29": "How do you guys deal with the criticism and hate comments? Plz do reply", "tinkysapra": "@mostlysane @sejalkumar1195 plzz answer my requested questions", "_.pranghitaa": "If you would like to change one thing 'bout being an influencer,then what is it? @sejalkumar1195 @mostlysane", "__t.a.n.i.s.h.a__": "What was your first impression about each other", "official_loyd_pereira": "Its gonna be lit 🔥🔥", "tantrik_baba_vashikaran_": "#only_one_call_me_change_your #life_for_your_all_problem_contact_now What's app +91-9057579889 Call +91-9057579889 #N_R_I__SPECIALIST #मुझ_से_पहले_काम_करने_वाले_को_मुँह_मांगा_इनाम Vashikaran, love marriage, love problem solution, get your love back, lottery number specialist, voodoo spell and black magic specialist. #solution_with_in_24_hour समस्या चाहे कैसी भी हो जड़ से खत्म। बड़ी से बड़ी समस्या का तूफानी समाधान। । अपने मन चाहे प्यार को पाना, काम कारोबार, किया कराया, सोतन से छुटकारा, पति - पत्नी में अनबन, You will chat on whatsup and call now Whts app +91-9057579889 Call +91-9057579889", "amolbukkawar": "My content is awesome but audience is minute", "shrishtinagarofficial": "Is the initial period of starting a channel more difficult than later?? Please answer this! @sejalkumar1195 @mostlysane Lots of love!", "tanvi_s_1506": "If not Youtube then what other job would u guys do ???", "anannyaa_r": "How different do you think both of your works are?", "vedika__30": "@mostlysane @sejalkumar1195 What was that one thing which inspired both of you to make videos of your type ..", "smishaphilip": "My question is according to you just tell me one thing that is common is u both and one thing that isn't???", "jain_arushi": "Please do a comedy collaboration with Mostlysane as well. We would get to see a different side of you.", "mansivpandey": "Does collaborating with other youtubers play a major part in the success of YouTube?", "sambhavitaa": "If you both get to swap channels for a day, what is the new video that you'll be creating?", "lost_in_the_worldofdirections": "Two favs in one picture💓💕", "harshita_s28": "Chai or coffee??", "iklwinder": "Can i get a chance to selfie with you but mai traveling nhi kr skta ap ay jao please selfie k liya from haryana 😍😍😭", "kajalsometimes": "How you guys managed when you had like 250 subs i mean what was your thoughts at that time how you expanded what crazy things you have done to share your video @sejalkumar1195 @mostlysane", "pink_obsessedgirl": "Describe eachother's fashion sense", "chhedarutu": "Did you guys got 100% freedom from your parents to do whatever you wanted to do for ur channel or there were times when sometimes you had fight with your parents for something that was important for YouTube career? #lovelovemostlysane and you are totally amazing sejal💕😘", "jyotimaheshwariofficial": "Questions is: both of you have come so far in this career. It feels amazing no doubt, but there are still prople who consider youtube as unconventional career. Yesterday YouTube server was down for some time even @komalpandeyofficial had to delete her video cause it was not showing up on her channel and not getting issues. Its so scary right? What if the next day we wakeup and YouTube isn't there, have you ever thought about it? I'm sure you have. Isn't is so scared for us creators. Love both of your work and also komal! @sejalkumar1195 @mostlysane ❤️", "sarikasethia": "were you ever camera shy? do you really just overcome with practice? how do you show your fun outgoing side on camera?", "isha.08_": "How do you manage to be consistent everytime? @sejalkumar1195 @mostlysane", "parinitasuman": "Awesome... Always wanted to see u both together in one video.... ❤️❤️❤️amazing 😍😍😍😍", "__niyatiii": "FAVVVVVVVORITESSSS😍", "dipeshonweb": "You are a superstar so you are exited to meet me..... @sejalkumar1195, @mostlysane", "rasneek_0204": "why u both start youtubing??? from whom u are inspired about starting this proffesion", "abhimanyudhusia": "Both of you are the cutest youtuber and my all time favourite, I just want to ask you how to motivate yourself to become YouTube personality from beginning...", "_srooti__": "2 favorites in one pic💞💃", "misstravelpotter": "What is that time in YouTube when you guys started to feel that we are working in right direction ? When did you guys had invites from YouTube creators summit and actually entrance to the Industry ? ..I mean after how long when you started.", "hareendransmrithi": "Was forever waiting for this Collab to come.. finally it's arriving 🤩🤩", "nikita.bahety": "How do u both maintain your body with such busy life ???", "rose_rob7": "Where do you see yourself in 5 or 10 years from now?", "vaishnavii.rk": "Your first ever cheque??", "rahulkumar17091": "🤩🤩", "uzma_khan10": "My favourites in one picture ♥️", "shreyavalunj": "Did you ever feel discouraged or had doubts when your channel was super small?", "ankita_kdk": "You both are my favourite ❤❤ @sejalkumar1195 @mostlysane", "fashion.w.me": "@mostlysane @sejalkumar1195 steps or ways required to be a successful blogger or YouTuber (at a low budget like using phone for shooting) and how not to fear the start ?", "sakshishah031": "Wat would b ur other career option other than youtube?", "_bhuteko_chiura__": "When both of you are getting married @mostlysane and @sejalkumar1195", "the__beauty_inside__": "Did you watch each others videoo", "aditikumar_7": "when did u start youtube....i mean in which grade i maybe go to a medical stream.....sooo when should i start youtube....as i will for sure do youtube in future.....i am in 9th grade will soon go in 10th....what do u think?", "chanchal_1212": "How you managed youtube along with college (your initial years on youtube when you were in SRCC)", "mj_jis": "Why u both don't make a duo vlog", "kiddish_girl18": "U both are totally in different paths but I want to give u both a task that please do a video on exchanging ur contents sejal u will do like prajakta and prajakta will do like sejal I mean about the contents are u guys gonna do this ??#lovefromassamguwahati", "kiru_critical": "How did you learn editing", "christina3096": "How do you manage to bring up ideas for new content every week?", "sayali.c.s": "Initially werent u guys afraid ki ppl after cllge will be getting jobs and will settle...we may or maynot landup in a good spot...what if this goes fail...did u hv any other plans...", "illogical_idealist": "You both are two of my most favourite YouTubers/Bloggers! ❤️ Sejal, I love how relatable and wearable your style is and you seem like a really genuine person! Prajakta, you're an inspiration regarding the heights of success you have reached in such a short time! 😍", "fouziyaahussain": "What makes you both so different?", "manvii_20": "what is your educational background and did your parents supported you in YouTube?", "eshitadiwan": "How u stayed positive in every situation", "hemaiyer0899": "Hellooooo!! Can you please tell me how to create a proper content!!.❤️", "vimallaharawal": "Beautiful", "amanrawaatt": "Super girls ✌️😉", "priyanshi_972": "How did you both get this idea of starting a YouTube channel and were u sure about achieving this success..!!@mostlysane @sejalkumar1195...guys I watch it videos daily..plzz do reply!!", "mostlysane_dumdum_army": "hii I am a new youtuber and I want to ask what to do if your subscriber count is on a standstill . I am uploading new creative videos but nothing is happening. please give your advice", "_annoyingyaaa": "What lighting works the best? P.S- love u bothh❤️😍😊😘", "_adrita.dutta_": "What is the bestest place u both have visited till now? If u can thn plss share your experiences about the journey. Btw i love you sejal and prajakta. (in prajakta's style) love love from kolkata", "rasleen_grover": "@paryushikoshal fan fest 😭💕", "pratishthasahu2": "Omg my two favs ... Waiting for video ❤️", "poorvagayake": "What's the first thing or word that comes to your mind when you see each other?", "oishika.kar": "The ONLY thing most awaited! My most favourite Youtubers collaborating!!!!", "bhagat.kasturi": "@komalpandeyofficial @sejalkumar1195 u both are like jhanviKapoor and saraAliKhan of youtube..there are many comparisons btwn both of you...but u both are exceptionally amazing 👏❤️❤️ lots of love from Chennai 🚓💯", "electrical_soul16": "What are your thoughts about body shaming in our country ??", "shubhang5481": "💗💖💝💝😘💓❤💜💜💜👍👍✌👌👌😇😇😇😇", "blefle": "From a viewers perspective, a youtubers life feels like it's so perfect. Was this a planned journey and something that you always wanted or did it just happen?", "meandeverythingetc": "♥️", "nehak2991": "How do you guys stay motivated? What is it that keeps you going? Btw...you cuties are super awesome and I love you both!", "raksha_soni_7": "How do you guys deal with negative vibes ....because even if you try to ignore it , it does bother you sometimes... please tell ..by the way you both are my most favourite ones love you both @sejalkumar1195 @mostlysane ❤❤", "remya.ramesh": "@sejalkumar which is the common thing you find in both of your YOUTUBE journeys ? And who is your inspiration", "_cant_stop_eating": "You guys can do like a fun conversation on Delhi vs Mumbai!", "jha._.pallavi": "Best moments of your life?☺️", "aishwaryachatterjee": "When are you coming to Kolkata", "lmaoananya": "When did you guys first met? And what were your thoughts about each other ?😮 ..And I love you both❤❤", "kiyara_sa": "What was that one thing that never let you guys quit or give up? @mostlysane @sejalkumar1195", "_lifeofpai_": "Was there a time when either of you thought of quitting YouTube? @sejalkumar1195 @mostlysane", "dheeshna_shetty": "Is it a good time to take up YouTube as a career? Do you think it has become saturated?", "raniasha0529": "Come to Ranchi", "jsrashti": "@sejalkumar1195 hey the skirt is from H&M, right???", "some.positivity.on.the.way": "Do you not get bored of YouTube now after years of working on it?", "swathisrikalidindi": "U both my favourite and awesome most awaited for ur collaboration", "arushiaishwarya": "How do you deal with all the negative comments on the channel? Initially, they demotivated me but I’ve learnt from my mistakes and I’m only improving. What’s your take?", "adhikarismriti0804": "Trade confessions ?", "babitalohani____": "U both r my favorite ❤️❤️😘😘😘.", "mostlysanenepal": "I know you both have different genre in YouTube and you both are great in that. But what if Prajakta wakesup as Sejal and Sejal wakes up as Prajakta, What will you guys do for a day? 😂 It will be awesome to see you guys swapped.... @mostlysane @sejalkumar1195 Love Love❤️", "anisamaity": "Awesome awesome awesome picture", "true_arian13": "Can you style @mostlysane or give her some improvements that she has to make? I love both of you!!!😍 You guys are awesome 💥", "_iambelli": "Which is the favourite video of each other channel??! Both of u pls answer this question ❤️", "_pallabi__sarkar.1408": "@sejalkumar1195 why don't you participate in #creators for change as my fav praju di @mostlysane did ???😍😍😍😍😍", "shivani_k__": "Both my favs😍", "mayankagulati": "How it felt right when you had just started and the thing inspired you to persue it as a profession how you got to know that this is the thing i can do", "_ramya_13_": "What advice could you give to people who have their boards soon!😂", "aayush_borthakur": "At what age you started your YouTube career and how did you manage the finance in the beginning? And how did you manage to get the sponsor's ?.....BTW both of you guys are awesome..... Prajakta's comedy video's are awesome nd sejal's music videos are awesome your voice is heart touching.... Love u both 💕💕💕💕", "rajashrisworld": "Wow.....can't wait for the video to come live.....two of my fav you tubers.....love nd luck to u", "_windyyyy_": "Why don't you two plan a trip together and shot an awesome vlog?", "shreyacc_20": "When you started out, what made you to keep going? Also, how did you celebrate your first major milestone, say 1k subscribers, cheers 😁", "nikitasup29": "How difficult is it to create new content... And any advice to new Youtubers", "memories_from_swagata": "Both you guys are my favourite😍😍❤️", "_muskanag": "Which camera did you use to shoot your first video? Was it a phone camera?", "palvi.batra": "Whom do you admire the most in your life?", "daisy_009": "I want to ask @mostlysane @sejalkumar1195 both... What is the biggest fear for you in the profession?", "vaishnavi.yelisetti": "How did you get the thought of choosing YT as a career?", "theidyllicjournal": "Both of your content is very different from other female youtubers in terms of their making videos mostly related to make-up and lifestyle and daily life etc..what was your initial goal in terms of content that you would produce? How do you come up with such different and unique content?", "devrahul_20": "😍😍😍😍😍@sejalkumar1195 coolholic nice", "prashasti_k": "One of each other’s video/content style that you love!", "ruchikr0905": "How do you guys stay so grounded", "kumar.alok.5055": "लव लव💕", "rishika_sagar_": "I think its one of my dream come true collab...!! Love u both!💕 My question is How did u both meet?", "joy16_aanchal": "How did you both overcame the taunts you use to get in the beginning of the journey of youtube", "mishribhavsar": "Yeppppppieeee❤️", "purviichxwla": "How do u both have such shiny hair and how do u guys maintain them?? Which shampoos/conditioners do u use?♥️", "the.naive.surrealist": "Did you know you wanted a career in YouTube when you started your respective channels? Was it always the plan? @mostlysane @sejalkumar1195 Love, Love! 💜💜", "prachidixit_19": "It's a fun question I hope you guys enjoy this. How's life like when one doesn't have any significant other? I understand there's work, there's family and friends to keep you occupied but what are your thoughts about it? Can do one do without it altogether? 😋", "skylarrwrites": "How did you know thay youtube was the career you wanted to do?", "stutigogia": "awesome", "_aneeee.7101": "When people choose their career they think about securing their future , so what idea do you have of yourself in mind when you reach 40 or 50 years of age ? And correct me if I'm wrong, but making videos is not a lifetime job, right ?", "itsshinjinii": "I don't have a question but I have a few requests. Do a collaboration with Praju Komal and yourself💕. That would be cool.", "chetanbhojwani": "DONO ek no. Ki NAUTANKI QUEENS👌🤘", "yours____anonymously": "What do you have any message for anyone who is aspiring to become a YouTuber?", "sonam2668": "How do you deal with utube stress????", "irakwatra": "Who supported you guys the most and who was the one who inspired you the most ? P.s.- you guys are ❤️", "arusrkfan": "What are your thoughts when your video does not get views as you expected? Did you guys get demotivated?", "lifelifter17": "How do you work on new video ideas every week?", "nikhila.chalamalasetty": "Any tip to build audience on Instagram??", "_divyyaa._": "U both ❤️❤️", "12.neha.s": "When is the next fanfest😘 #dumdums", "fmwdotcom": "Dashing", "spoiled.by.style": "How has your life changed ever since you took YouTube seriously ?? And how is your life now??? How it makes you feel everyday ???😊😊😊", "nini_1199": "Is it hard to deal with the fame that you get through YouTube?", "elizabeth_g_28": "How does YouTube works when it comes to sponsors? How they approach u?", "_confused_diva": "Omg my 2 favourite together woww", "ananya_a_s": "You both are 2 of my favorites!!!❤️ And it's such a pleasure too see you both shooting a collab..and, I've no idea what to ask, but I want to ask something. So, what were both of your reactions when you hit 1k subscribers each?!😂just a random question, hope you'll pick this. Love you both♥️", "a_sanguinarian": "Share your best inspiring experience of your life❤️ @mostlysane @sejalkumar1195", "a_boy__has_no_name_": "Hey @sejalkumar1195 will we ever see you doing mens fashion/styling tips? Love,Suan", "1prateek": "Waiting", "pooja.hareesh": "What's the one common thing between you and @mostlysane ?", "__priya_singh__": "HELLO SEJAL😍I LOVE THE WAY YOU SPEAK👌YOU ARE A PERFECT YOUTUBER😘CAN YOU PLEASE TELL HOW DID YOUTUBE FIRST CAME IN YOUR MIND AS YOUR CARRIER✌Please take my question👵", "kohlkarmakar": "Is there any criteria for creators to be called to attend fanfest? And for me being a popular youtuber is all dreamy and fancy but it is really so? Love you both!❤️", "saaaaaalonii": "This is gonna be a bomb collab 🤩", "manaswini_sharma_s": "Two of my fav😍💖 woahh really exicted!!!!!!!", "vijili_": "What are the things that u can relate to each other...??💖", "simoni.k.dalal": "Hey Sejal. Welcome to my city ❤️. Looking forward to listen to you at Chaos. And hopefully meet you. 😊", "vivekvaddadi": "Sejal do you suggest ms kholi anything regarding fashion and does ms kholi suggests you how to be a little witty and funny ?", "17anjaliyadav": "I would like @sejalkumar1195 to give @mostlysane a makeover though I love your style @mostlysane ❤️", "nidhimoily": "As a content-creator what does it take to be different/creative than other youtubers and reaching out to the target -audience??", "disha_is_a_penguin": "How do the both of you stay so motivation and cheerful to make and edit videos? And, where do you get the inspiration for content? I mean isn't it difficult to come up with new ideas? Love you both btw❤️❤️❤️❤️", "hs.er.ay.c": "2 internet sensations and two out of my 3 favourite youtubers coming together 😻 @komalpandeyofficial (one of my 3 favourite's) you should have joined as well. Then it would have been a complete collab for me! ❤❤❤", "priyasrivastav": "Did any other youtuber hit on you?", "_andwhat_not": "How do you people manage to make so many celebrity frnz?", "i.m.shilpika": "How are you both so positive In life", "aayyuuuusshiiiii": "You both are so candid!! How do you'll manage it ?", "shreejigupta12": "Favorite two, together!😻🔥❤️ @mostlysane @sejalkumar1195", "aalia_ahamed": "Hey Sejal! Been following your work since you the DIY, Long Hair, Turkey Phase at 5000 subscribers 😄 As you're nearing to a million fam! and a completely different human being who's compassionate & loves her work & people from the Indian Backpacking Series to all the newest one, there's been ups & downs. But stay strong, and if you are reading this - do come over to Dubai, we'l take you out to shawarma, milk cake and karak chai to bribe your time ❤🌟", "gowda_anitha": "When you both started with youtube how long it took to get your first 1k subscribers? did you promote your videos initially? If yes, how?? @sejalkumar1195 @mostlysane", "nithya_ganesh_": "Wowowowowoowoww😭❤️", "sakshirane03": "Who are your favourite YouTubers you look upto? @sejalkumar1195 @mostlysane LOADS OF LOVE♥️", "mahatiii": "How you started your career in YouTube?", "pranitha_masamsetty": "How to be a successful youtuber ?", "pankaj.salvi.50": "Acha suno ... Aakeli na Bazar Jaya Karo...", "ssharmaxxvii": "...hmm", "manvi_bhadauria": "I am actually going to start YouTube.. just guide me a bit to make it big", "nikhartodi": "I have started my own YouTube channel. I have tried to be consistent but it is just difficult to reach out to people to watch it. I have also improved the quality of the videos. Any tips?", "aparna27aparz": "If you guys switch lives, what is the first thing you guys will do!? Love and adore both of you ❤", "_madhu.12_": "Woah. Two favorites in one frame💯🔥❤️. Waiting 🔥 please let us know how you overcome procastination and get things done on daily basis", "_chandrima._chakraborty._": "how do you both balance your productive days and relaxing days...??.", "sassy_sejal_": "Delhi and Mumbai togeda 😂 woahoo both favs ....", "nandani_18": "What are the myths about youtubers ?", "thatissiri": "How do you get innovative content ideas?", "bonaita_1211": "What's the beauty secret for both @mostlysane @sejalkumar1195 ps- I love u both ♥️♥️", "pushpmeetanand": "Love u both soooo much💖How did you both feel when you both meet each other for the first time? What were the perceptions you had for each other?", "bhavyaajoshi": "Can we have a meet and greet in Ahmedabad PLEASEEE!!!", "theishakapoor": "How did you'll start your journeys and how did you'll decide on the content earlier??", "nandanee_sompura": "When will you both visit Ahmedabad? Really wanted to meet both of you 😘 lots of love from Ahmedabad ❤ come soon.", "thatwanderlustfoodie": "Don't you think that Youtubers in India are underrated? @mostlysane @sejalkumar1195", "x.ali_sha.x": "Hey guys I really love you both amazing, independent and beautiful girls. Inspiration to lot of us. Can you tell us What are the things you really like about each others life? @sejalkumar1195 @mostlysane ♥️♥️", "aimer_doer": "How u did u overcome the flop videps of urs after putting in lot of effort and expecting it to be a hit??", "alishashahi25": "Have you guys ever envied eachother's travel vlog or even the general content? How you guys maintain to have peace within yourself when all these chaos is going on youtube to have more subscriber? I love both of your contents😍", "prapti_gala13": "How do you guys stay so confident @sejalkumar1195 @mostlysane", "its_levi_osa": "Finally 😄🙌", "delisha_lobo": "Yayyy!!!", "sandhya7786": "Love you both @mostlysane and @sejalkumar1195 ♥️♥️", "_noshinnawal_": "Love you 'two' ❤🌟", "vinitha_r10": "Hello !! I admire both you almost . I don't have any YouTube related question but I have a request . Recently @mostlysane she came to IIT Madras for saarang N I m so glad I could see her . @sejalkumar1195 I m huge fan you . I want you also to come 😌", "arminb_96": "How do you guys always stay motivated to keep uploading the videos? Was there any point in your life when you felt that you don't want to shoot and upload?", "lensmaniac_rs": "Do you think being a beauty blogger has more benfitis than being a comedy content creator when it comes to brand deal?", "vikaspeswanihere": "@sejalkumar1195 @mostlysane @komalpandeyofficial my question is for all of you How you all are so good at all ? God bless all of you ❤", "anannnyya": "How much do you pay the person who shoots your video?", "warishashehzadi_6": "Did you get permision easliy for starting a youtube channel", "the_pragyajain": "How do you both get ideas or inspiration about the content of ur vedios to maintain the regularity on ur channel @sejalkumar1195 @mostlysane", "madhurbabber": "how to get investment for technical stuff? (when nobodys ready to believe in you)", "sonalimendonsa": "How did you guys begin or take the leap of faith into youtube? Did you have to quit your job? Did you have funds to meet your daily expenses? When did you get your first paycheck from YouTube? Or via your blogs?", "thecutegirlintown": "How do you manage to keep hate comments from affecting you ? And when do you guys plan to keep a meet and greet in Bangalore!! ❤️❤️❤️ @sejalkumar1195 @mostlysane *tightwallihuggy\"", "preeti0904": "How did u manage the finances in the beginning and what helped you decide not get a mainstream job( stable pay) and pick up youtube", "simpyshikha": "What is the one common thing that you guys think you have...? @sejalkumar1195", "thestarvingstunner": "I'm thinking to start YouTube since 2016, but I end up not doing it because I fear it won't be good enough. I keep waiting for perfect camera, perfect location, perfect video editing, and nothing seems perfect. Can you give some tips on how to get started when nothing seems perfect?", "roops_198": "I don't want to ask anything but wanna say something..... I really like both of you and your work too😘I literally want that one day you both will do a Collab video and now you're doing it🤗🤗.......I can't wait to see you both together after sooo long💕💕both of you are doing great job🍫girls like me get to learn alot from girls like you😊lots and lots of love happiness blessings and namaste🙏🙏🙏 #lovelove😘😘😘", "parthian_komal": "What is your least favourite thing about YouTube?❤", "plethora_of_life": "What are the similarities and differences between @sejalkumar1195 & @mostlysane", "deepikaravi2805": "If you had to suggest content for one video to the other person what would it be?", "mahi_sarda": "❤️❤️❤️❤️❤️❤️❤️❤️Ahhhh myyyy gooodddd!!!", "pitara_ourstore": "First of all congratulations to both of you for achieving such great heights and we really wish both of you a very all the best for your futures....the question from our side is..that HOW DID YOU PEOPLE ACTUALLY MANAGE YOUR COLLEGES AND YOUTUBE TOGETHER??..AND YA HOW DID YOU MANAGE THE FINANACES IN THE STARTING OF YOUR CAREER AS YOUTUBERS??..........and ya we have some amazing jewelry at really pocket friendly prices....plzz do check our collection.", "annu.tinu": "how to start you tube and grow according to your personal experiences?😊 I love you both so so much and you are greatly inspiring me to start a you tube channel soon but related to books and travels. Do give suggestions and tips .. love you😊😊😊😊😊", "_ashna.bagdi_": "Question to both of you - Your most embarrassing moment as a YouTuber. Please take up this question and mention my name 😌😌", "gawleroshni78": "sejal=how u manage to not mix your personal life with professional life and give so good content??? mostlysane= how to do remain so happy and full of life always 😍", "harshita__22": "How was your experience meeting Vicky Kaushal?🙈 @malvika_sachin please help her meet him 😭💗", "anouska_agarwal": "When u started a channel , did you have any idea that you would land up with all these love and so many subscribers? What was your thought initially about your potential and how confident you were?", "anamikagandhi06": "What is the most taxing thing about being a youtuber according to you two?", "jasminealka": "Do you guys get inspired from each other? If so in what ways? @sejalkumar1195 @mostlysane", "ishitagshreya": "If there is no YouTube , what would you guys rather do ? ♥️", "jeet.vision": "Heroins 🔥🔥", "_bhavyamehra_": "Hey! I want to know that you generally recieves so many sponsored products. So, do you want to share with me? 😂🖤 Lots of love ❤️ Ly both", "tara_chamling_rai": "How you two started youtube video?? any what content you shoot first for youtube??", "_kavya_choudhary_": "I love you, Prajakta! @mostlysane", "ananyasalunke21": "Is it important to build an audience on instagram as well, if one has to build good audience in youtube?", "priyankdhuliya_248": "Exchange roles for one day plsss", "payalrathod___": "Lifestyle routines of both of u how u work?", "pari_tandon": "Wow you both are my absolute favourite...you both are absolutely relatable....love love to both of you. My question is since you both are from outskirts of delhi and Mumbai what are the funny things you always hear from your frnds where you say you are from delhi/Mumbai.", "jazbajeetneka": "@sejalkumar1195 tell me the name of YouTube founder.?", "libnirojan": "A youtuber u both wanna collab in future...", "pallavi_ghag": "u both may be started in same year bt now @mostlysane has more subscribers than u , does it bother to u that growing slow is bad? Bt also I love your too much @sejalkumar1195 ❤️love love", "pearl_lisha": "Both my favs in one frame....Prajakta di's comedy and Sejal di 's fashion sense , both are awesome....What inspired both of you to start a YouTube channel??", "harmanj.kaur": "How do you guys become this bomb of positivity. 🤩", "aaryaayay": "Is YouTube frustrating sometimes?", "__aakansha": "Fun task: Do an intro like oneanother! Prajakta as sejal and sejal as prajakta!", "shubhi.34": "How do you guys grab ideas for video content??", "kulkarnivaishnavi23": "You both have came looongg wayyy...three words to describe your journey 🤗😘❤️", "vaiishnavvi": "i love you both 😘🔥", "colloquially.naisha": "@sejalkumar1195 how should we keep ourselves going and not get tired in the middle?", "simmiesawlani": "How was it like to start youtube from scratch? @sejalkumar1195", "manalidoshii_11": "Both favs, no questions just love the way u both are 💋 #lovelove ❤️", "anushka.handa": "I love you bothhhhh 💛💛💛", "anjugirmal": "I really want to know how do u all take the awesum pics. Because i am unable to take on my own... i need someone for clicking. Any suggestions", "aishwarya_ranjana": "How do you guys started? How do you earn on YouTube?", "neh_mer": "Where do you guys see yourselves 15 years from now? @mostlysane @sejalkumar1195 Love you guys 💕💕💕", "arpitadasx": "Just like you both, can we follow our dreams to achieve what we want in life? What if we are unsuccessful? How to get so much of confidence?", "_gaurie__": "Hey glad to see you both together after so long! My question is, When you just started your channel , what was peoples reaction when they saw you around ? #lovelove😘", "spark_of_flint": "Have u been jealous of each othrr at any point??....I know its kind of lame but still a generall thought as human tendency", "haileyyyyyyy.__": "How is life as a YouTuber?? Is it difficult to face challenges???", "boldblushblog": "How to become influencer in 2019 like time has changed since u started so plzzzz tell us 😍😍😍😘😘😍😘😍💃😍💃💃😍💃😍", "freyaray": "Did you never feel scared to take up YouTube as a profession? What if it never worked? Didn't this thought scare you while you were starting off?", "fatema_.rajkot": "I am following both of you since past 2 years .. n I've seen both the journeys .. so I would wanna ask ... What is that one thing in common that you both have like in your persona??", "kanishka.mlk": "Do u ever thought that u will reach to ur respective milestones through youtube back then when u started??", "engima_19": "Fashion advice u would lyk to give prajatak?!", "srushi_h": "Can you'll please share the web tools you'll use to search content for your videos", "siddharth_patel_001": "👸👸👍", "kavyaa_desaii": "No questions, just wanted to say I love you guys & that I feel extremely lucky that I came across you guys 💕 MORE POWER TO YOU ❤️", "_shrushti_dhenge": "Favorites", "suvam_ghosh25": "How do you feel to meet your subscribers? And how do you handle the fame you both have? Is everything the same like before when you were not on YouTube? #lovelove♥️", "tanyakoranga": "Any funny incident or memory between you two?", "insane_forever11": "Yayyy!! My favourites together 😍😍😍", "krina123__": "How uh both manage your YouTube n your daily life? How to face other problems n whenever I see your videos there is always smile on your face so tell me how uh deal with problems n ya Prajakta my fav video is Ghar Ghar vala love love❤ @mostlysane @sejalkumar1195", "nirmitee_20": "Both u guys have totally different content... prajakta is more into comedy videos n sejal is about lifestyle and fashion...can u both try doing to what what the other one does... like sejal try to do something funny n prajakta u try giving some lifestyle or fashion tip😊 love you both ❤️❤️😘😘", "bilal_a_awan": "мιи∂ вℓσωιиg 🔥", "lakshanacreations": "Describe the day just before shooting your 1st you tube video . What was going on your mind ?", "_smiling_seashell_": "Yayyy my most awaited colab ... So my question is apart from convincing/at least telling your parents what you are about to start, what all obstacles u guys have to face and what all thoughts were there before starting YouTube channel", "vidhisha2841": "Which is the best web series of 2018 according to you? ❤️", "arujeea": "how have you managed to compete with so many youtubers and find different content? Everybody is doing the same thing nowadays.. also i love you so much both❤️❤️", "itsthatbrowngirl": "Stopped making videos for a year, and want to get back but I am overthinking and have lost my confidence.🙈", "kruitirai": "When and how did you realise that you wanted to do YouTube full time? What were you willing to lose?", "jalakrawal": "How to create original content and what do you do when you feel burned out?", "naam_hai_shatabdi": "@sejalkumar1195 and @mostlysane Do you both have any dreams to fulfill being successful in the YouTube.... Love love both😘", "lasagnalovehandles": "What according to you makes a youtuber successful or you know enables him/her to make grab a foothold on the platform?", "sahana.25.parveen": "How different do both of think your journeys to youtube is!?..Can spot any differences or similarities??", "les_janani": "You guys are successful YouTubers now❤ what's for the future ? What after youTube, say 10 years down the lane?", "exoticlifewithrashmi": "I dont have that much equipment but really wanna grow my channel. So give some tips please", "naturallysush": "Do you think that the board results are important and they are the only ones that shape your life? #pleaseanswer #mostlysaneandsejalkumar", "srijamukhopadhyay": "Golgappa Or PaniPuri??? And what's your guilty pleasure as a foodie? Btw I love you both because you're so different and amazing ❤", "itshivanithakur": "Where u both want to see urself after 5 years?....love u both", "foxycreations_": "@mostlysane @sejalkumar1195 Coming from the same field don’t you feel competition against each other? How you manage and tackle that thing?", "diptishinde_09": "Q: How do you guys manage your professional life and your fambamjam time ♥️", "madhu_chella": "Did fame get to your head at some point when you were doing well ? What do you do to be grounded all the time ?", "poojitha_nair": "What is your life without Youtube?", "krritiii": "How to feel sure about what you want in life.", "shrexyxa": "Do you guys ever had stage fear in your lives? Or being nervous before stage performances? How do you overcome it?", "2poojachoudhary": "Hey!!! Great to see you both together... My question is what are the challenges you face or facing as a YouTuber? And one thing that you want to change in YouTube", "the_nikita_singh": "Your first impression on each other", "am_manumamu": "What strategy do u guys follow in investments ..Do u do it yourself or anyone else handle them !", "travelocorn": "Tips on starting a YouTube channel. I started my channel but couldn't manage it. You both are my idol💕💕", "_choudhury_riya10_": "Love you both. U boths work is awesome love you. There is no question from my side.", "priyam_show": "Which video was the most important for your YouTube channels?", "komalpandeyofficial\nVerified": "Verified", "ishixaasehgal": "Hey Sejal and pajita, I have just started my YouTube channel and I am having so much trouble in handling it! I mean you do you upload videos every week in like so less time", "ishitadas06": "Since the competition is ever increasing on YouTube, what strategies one can make to sustain ?", "ishitashah0601": "Do youtubers feel jealous with each others sucess being friends ???", "tanishkabhosale_15": "2018 or 2019 ???", "anushasavant": "How do you both handle all the fame? You guys are amazing 💕love you both 💕", "rovinglegs": "Two inspiring figures together❤️", "ice_grey": "What excites you more?", "simmi.sim.sim": "What was the hardest thing when you were going to post that very first video?", "pallavi.daga": "@sejalkumar1195 @mostlysane plan a trip together! So much fun!", "aditiaggarwal79": "How did you begin with your journey? And how did you guys become so confident?", "ashimachadha99": "Does it ever scare you that after some years you guys might become irrelevant and then it might be difficult to start again from scratch?", "travel_tilldawn": "How did you both gather the courage of leaving the main stream career that you both were pursuing?", "travelvlogiv": "OMG the collab we needed! Q; how do you keep working hard when you've already made it in the eyes of the world?", "that_silly_specks": "♥️♥️you are My Inspiration♥️😘", "iamdivakakkar": "How to begin youTube as a career", "01snig_saikia": "When was the first time you guys met each other? And when will be see your next collab? P.s it's been ages 💋", "divyakoppuravuri": "What are your future plans? Staying in youtube or any other carrer like going to film industry etc..", "m_r_u_n_a": "i dont know its ok to ask this que or not but just for curiosity and also i wanted to start blogging ..plzz tell me how many money you earn from blog and you tub", "anirudh___gupta": "Will u both be coming on each other’s wedding 👰🤣🤣", "sleep.dance.eat": "There are many who put the same sort of content. I talking about the competition who guys face. How do you guys manage to top the list? Also, how can one start to become an influencer on Instagram?", "velvetpressedflowers": "How did y'all go through the initial stages of your youtube channel? When you recieved hate and stuff?", "shravani_chougule_03": "How did you manage to support your youtube account financially during the start period?", "stylesavitri": "What were the challenges you faced in terms of followers and likes on your YouTube channel?", "towfiq861": "sejal & prajakta when u r coming BANGLADESH for a meet & greet coz i m a big fan of u both...& when u r debuting ur career in bollywood?? eagerly waiting for both of u ...lots of love", "m_marlee": "Well now recently the number of youtubers has increased tremendously and this field too is getting saturated, so how do you guys cope up with it? And, omg you're both my favourites! 🌹 especially Montu! 😂🌹", "rashisharma.10": "When u started ur YouTube channel what was the reaction of ur friends", "sa.ha.naa": "How do u both deal with getting hate on a day to day basis...wil it not affect u mentally to see soo many people talking shit about u !! How to stay motivated towards achieving are goals despite all odds!?", "_thelasya_": "And Sejal... Girl, you are just amazing....", "jainpratiksha24": "@sejalkumar1195 How did you realize that you were good at creating content? Who is your inspiration?", "vogue.invein": "Favourite girls 😍😍 @sejalkumar1195 @mostlysane", "komalkuckreja": "How come u both are so positive and cheerful always inspite of the fact that u stay busy all day long . I mean u look so cheerful even when u are saying that u are tired. # Big fan🤗", "oliveandcheeese": "This is amazing, looking forward to it", "taniyasarkar017": "When you started uploading videos on Youtube, did you anticipate whether the video is going to work ? What was the feeling like and what were the number of views on your first video ?", "lin_the_merlin": "@mostlysane how was it like to meet superwoman in real life?😍", "motive.website": "How you both have gained so much confidence being a **YOUTUBER** ?", "taniachawla.21": "How do u both manage to look so cute", "sweetyk3791": "How much do you earn from YouTube?", "shilphoria": "Are you Excited about something really very big in this year 2019?? I mean are you going to do something very important??", "shivaniiii2004": "When r u doing a meet n greet in mumbai", "nupurr_0609": "How did you handle the “what will people say “? @sejalkumar1195 @mostlysane", "aabha.aa": "If you could collab with one person, living or dead, who would it be", "drzainab_988": "Awesome", "_zaveriya_890": "Which video editing software do you use? @sejalkumar1195", "progya_": "How are your journeys similar? How do you manage to be so amazing? ❤️ love you both 😘", "manasa_bhat": "Two of my favourites in one frame 😍❤️", "scubarikaa": "How did you handle Youtube and college at the same time? P.S LOVE YOU BOTHH. Dream team for a colab🥰", "know.shrey_": "Were you’ll scared to start your career on YouTube in the beginning?", "beauty_with_brain_yt": "Mere sath b kr lo❤️❤️❤️❤️plzzz watch my dm", "maivy.in": "So cool 💖", "radhika.b_": "Soo excited about your collaboration you both are my favs!! ❤️❤️❤️❤️@sejalkumar1195 @mostlysane", "unnatiii_": "favouritessss❤", "gautam_yadu": "One of mine friend is exactly same as your face @sejalkumar1195 if you wanna take use in your collab it's great for your viewers..", "__arif_____________": "👍🙌", "one.life.one.journey": "Pretty 😍 😍", "ghanitigerr": "fαвσℓσυѕ 🔥", "shrxyaaa": "Most awaited collab i swear 💕", "anubhava_singla": "Hey I love you both 😍😍😍 my question is - are the new rules and the monopoly played by the YouTube effecting you as creators", "hellzliz": "What was your inspiration behind all this...i also wanna start my own YouTube channel on makeup... any tips??", "nikitavashist": "Will you both think of doing a travel vlog together? Thats different. And i like both y'all's travel vlogs so.. lots of love! Love both of you😍😍♥️♥️", "orange__kisses": "how Youtube has changed your life ? the things that you never thought of 'okay aisa bhi kuch hoskta hai '? @sejalkumar1195", "__nazma_": "@sejalkumar1195 weren’t you scared and nervous about whether fans will like your content?", "zeaayu": "Both are my favourite! Makes me go crazy by the amount of confidence u have. What's the secret", "keyur_sabhaya": "@sejalkumar1195 Love your feed! Each photo is incredible!", "deepucca": "OMG OMG OMG OMG OMG OMG OMG OMG OMG OMG OMG", "aparnakarade": "What is common is between you and prajakta...your both are such a great personality ❤️", "sanikaa2101": "Were the initial years of your youtube though? Pls take my name!!", "felix_felicis8_": "Two faves together!❤️🤩", "trishaaaa7797": "Share with all the most special memorable moments of being a YouTube star...😘 @mostlysane @sejalkumar1195", "khushali.vyas": "Meet and greet in Ahmedabad @sejalkumar1195 please", "itzzzz_sonu": "ѕυρєяв 🔥", "koko____doko": "Two gorgeous girls together💜😘", "caughtinminds": "How much you both are paid by YouTube", "harini_pratti": "When did u started ur YouTube channel @mostlysane @sejalkumar1195"}