{"mahi_chou": "sejal", "mitali.handa": "Would you die for once or die every moment you live?", "bhaskar_akshita": "Would you choose youtubing all your life or eating healthy all your life? #AskSejal", "aditi_v27": "@sejalkumar1195 saw ur video, I m new subscriber, so Hiiii to u 😘 and congrats for 200K💐. Good luck for ur future Goals. Hope u fly high and shine bright 👯⭐️🚀", "_valeja.s": "Amazing view....", "aanyaprabhu": "Would quite YouTube for modelling if you get a very good offer?❤", "theclassyfostor": "How much uh earn through youtube ??", "minelle_ch": "Congrats my questions is where do u see yourself in 10 years", "armankhan3121": "Classic view", "lipun111": "Would you like to go to bhangad with me???", "anjali_nair124": "Would you rather drive or walk?", "radhikarg": "Would you rather go for romantic dinner or eating at home in ur comfy clothes ?", "gosavidevesh": "👌🌺", "puranickoftime": "Would you like it if you got to live all over again, but this time your profession & your mother's profession gets interchanged?", "oshmirao": "Would you color your hair completely purple? 😛", "second____thoughts": "Would you prefer continuing with youtube or go to another country with a white collar job ?", "iamsunnyyadav": "Please Make a video : Palika Haul (men's wear :p)", "vijaykr7": "AWESOME", "_paushali_": "Would you make a vidio on Mother's Day???", "minal_k4": "Would you ever go in the bollywood line @sejalkumar1195", "aj21_sunshine": "Would u prefer an adventurous jungle trip or a chilling at some beach on date👻 @sejalkumar1195", "niharika312": "Can i know how to participate in youtube next up @sejalkumar1195", "saejadhav_": "Would u ever leave YouTube bcoz of hate comments continuing for months..", "shefalisinha_": "@pranaya_reddy_ your shut", "paperlesscrowns": "What's the most romantic thing Mohak has done for you? #asksejal", "rashmita00": "Do you have any plans to come to Kolkata?", "sssshivangiiii": "Would come to Qatar #asksejal", "iiikhushiiii": "Would you rather change ur name to Hitler legally or never eat chocolates again???? Love u sejal 😍 😍 😍 #asksejal", "anujakate": "Would you like to come to pune? #asksejal", "aawwknee": "Would you rather have out of control body hair, or out of control body odour?", "sonal_joshi_spj": "How do u feel when people criticise. How do u deal with it?", "sonali96arora": "Love your bag", "gambhiraarushi": "Would u do anything related to our society or environment", "bhardwaj_aditii": "Would you please call some of us? Love youuuu💕", "mesha.nadal": "Would you accept a bad comment as a matured person would or would you cry after reading it?", "vaishnavi.__.k": "😍😘", "_errrrr000_": "Would u please tell where do u live? I just love ur home and the surrounding over there ..I saw in one of ur vlog..superb ambience.. Super home....and do not ignored pls mam..", "tanya.pinx": "Love your pic...", "picked_a_pen": "Would you and Mohak go on a double date? I propose my boyfriend and I. Btw what if the couple was your parents? 🙈", "geetika.nigam": "Would you drop by? 😄", "_tanvisamel": "Would you leave youtubing or marry someone right now? 😂", "ramya2220": "Hi sejal!!!!😚😚i just want to ask ur age and ily", "jigna_tuscano": "Would you give up YouTube for acting?? #asksejal @sejalkumar1195 love you😘😘", "anagha_mandhare": "Would you rather delete all your texts or pictures?", "dr.happydevgan": "Fan hai apke", "a.cupof.wish": "would you like to come north-east ??", "tiger_its_self": "lovely", "suvigyaa_": "Would you rather choose Mohak or Harry Potter?", "electricflux": "Gorgeous", "vamikasingh": "Go to new York with friends or hills with family", "fizanagda5": "Would you rather choose Instagram or Twitter", "bhambzilla": "Would you rather live in India or any other country of your choice for the rest of your life?", "nikitamenghaniiiii10": "Would you want to go back in the PAST to correct something wrong you've done and regret it or see what the FUTURE holds for you??#asksejal @sejalkumar1195 xoxo♥♥", "saniya1208": "Would you leave your parents or leave youtube", "khanak.singh_06": "would you rather choose mohak or khayati", "krati.3": "Would you be my friend?", "nishitakoul": "@sejalkumar1195 are you a sindhii?", "vidhi_jani_10": "Would u rather be a doctor or pharmacist", "mal___reynolds": "Would you ever do a no budget video (Unlimited budget)?", "fffffffuuuuuuuuuuuuuugk": "Would you make a video about what you need to start a YouTube channel and how you started yours 🙈❤️❤️", "nupur.sood": "I know its an unfair question but I really want to see how tricky you can get here @sejalkumar1195 Q.Would you choose to live only with Youtube or Mohak???", "lakshita.chhajed": "Would you meet me ever @sejalkumar1195", "_.nectarine_": "Would u meet one direction or arijit singh ? Stupid question though", "priya.verma_": "Cutie💕", "brooklynandbaileydv": "Would you ever do an international meet and greet? - Divya", "inshamohammed": "Would you rather leave YouTube or get to be the miss universe....", "aastha.xx": "Would u ever like me as your fan ??? - Aastha BTW ily ❤❤", "__saleeka": "Would you like to go for roadies auditions?", "nikitha_medeshetty": "What would u like to choose if u r given travelling or youtube", "srinithi_2901": "Would you chose a world tour with Mohak or a dinner with virat kohli? 😂", "nvm.samridhi": "U go to Mumbai a lot but why don't u do any Collab with sherry ? #asksejal", "neha_khanwani": "Would u come to Mumbai? Ur fans r waiting here ❤", "sassybumz": "Would mohak start YouTube? @sejalkumar1195 @mohakpapola", "elishavadhera": "What would you do if you reveive a call from Big boss team to take part in the Show??? (basically aaking for ur views)?", "mimansha_khangarot": "Would you like to get a birthday surprise from your followers or mohak and friends??", "akanksha__thalla": "Would you kill your boyfriend or u r mom??", "tanvi15945": "Would you go to Paris or rather go for a chilled out weekend to Amsterdam with @mohakpapola ?", "anaayashah_": "Would you rather never wax your under arms or your legs?", "urmi.ns": "Would you prefer a trek or a chilled vacation at some tourist place?", "yashaa_31": "Would you marry Mohak ?", "_pratikshyaaa_": "Would you choose Mohak over YouTube anyday if you have to choose one?", "miss_india_2k20": "Would you live your life short with 1crore or would have long life with little money ?", "jasikadias": "Would you ever move out of country?", "salvigupta16": "Would you choose mohak or your subscribers#us", "ishikajohari": "Would you continue your higher studies after graduation?", "rionadsouza": "Would you live in Delhi and give up YouTube or leave Delhi and become a huge YouTube celebrity?", "vimisharawat": "would u like to come to himachal?", "akankshawhy": "Would you like to be an actress?", "shruteabutcoffee": "Would you rather Stop using YouTube or stop using Facebook?", "sameerrraa": "Would you rather have 400k subscribers or 5m views on your videos?", "keerthireddy_kandi": "Would you choose mohak or ur parents choice ka ladka in future??😅😜😜", "siya.chicker": "@sejalkumar1195 hey sejal! Would you like to hold a fans get together?❤️🙂 #Asksejal", "sanjanahemaraju": "Would you rather have wheels for legs or hooks for hands", "sujj_dv": "Would you take part in a reality show if given the chance? 😏", "seji.k": "#asksejal Would eat a spoonful of salt? or would u rather eat a spoonful of Cinnamon? love from Australia xx (my name is Sejal too)", "yashikaponda": "Would you ever kiss a stranger on public place? #asksejal", "nidhi_nayak_": "Hey sejal!! My question..Would you do a truth or dare vid with mohak next???!", "meghanarchy": "Would you rather eat ice cream or frozen yogurt?", "elf_dsz": "Would u rather kill ur self to save mankind or let mankind die tp save yourself", "_.prxnitx._": "Would you marry mohak?", "nishtha_malhotra02": "Would you watch friends or Harry potter series for your lifetime?", "beauty_issh": "Would you like to do a meet and greet in Mumbai or Navi Mumbai soon 🙈🙈", "___.chhavi.___": "Will you delete your channel for 1 billion dollars??😊", "swarna_food": "Would u prefer adopting dogs or cats??And why? Good Wishes from Mauritius Sejal 😊 I never miss any video 😍😍", "m33rashankar": "Would you rather live in India with family (without Mohan) or the US with Mohak", "yogutogu": "Would you ever make a video about how we can minimise the difficulties women face in personal, professional, social lives? @sejalkumar1195", "saimitha_chum": "Congratulations for 200k subscribers Sejal.... Would you start making your singing videos as well alongwith the videos you make regularly??? And please make videos twice week...", "shriya_j95": "Would you prefer trust or loyalty?", "ruchita_94": "Heyy... Do u pay mohak bhaiyaa for the shoots n videos", "happysoulsc": "Would you like to visit your past or your future for just one day?", "vaikhary": "Would you rather be a youtuber who won't do any styling videos or a stylist without YouTube videos? 😃", "jyoti_020": "would u choose kaju ya kismis", "deepasanjeevjoshi": "Would you wax mohaks leg", "raisa____trivedii": "Would u choose mohak or ur youtube fans ??? #AskSejal", "hardiparmar07": "Would you continue with your studies Now??", "aayusha_bastakoti": "Would u say hi to me 😂😂", "smhbhuvasree": "Would you marry Mohak ?", "_aryaa._": "Would you marry mohak?", "utsaaa._": "would you ever stop youtubing? plz dont", "___apjlovez": "😍😍", "people_places_plates": "Hey Sejal, love u and ur videos😘 My question is, what does your horoscope say about you? (Just curious) 🤣😉", "wadhwa_aanya23": "Would u migrate to some other country?❤❤❤ and yes please do a meetup in Delhi", "harshitamaddi": "Would you like to have 50k more subscribers or have a video hitting 3M views ?", "anjalim2626": "Would you move in with Mohak eventually ?", "reshmi0502": "Would you choose acting in Bollywood over youtubing?", "listentonidhi": "would you ever thought of owning your own styled brand one day???", "_praks._": "Would uh like to be a singer or actress ?? 😊😊❤❤ #love😘😘", "saumya_avinashi": "Would you join a dance class or a singing class?", "the_fabcan": "Beautiful pic", "dishaniguha77": "Would you shoot @mohakpapola in the leg for 10 million dollars ?", "_thepooh_": "Would choose acting career over a desinger ?", "samiksha._.kapoor": "Would you be a youtuber for life or would take up some other profession after some time??", "shruti.aisha": "Waxing or Shaving?", "kanikatyagi93": "Would you rather go for trekking or have a chilled out vacation at a resort with all the facilities?", "faaizah.h_": "Would u rather have a lot of money and be alone or have little money and be with someone u love?", "simrann_2812": "Would you like to back to school days or college days??? Strictly choose one!!😂😂😂 @sejalkumar1195", "prerna0719": "Would you choose walking on streets or a long drive in a cold night with someone you love ?", "x.saloni.x": "Would you love to get an entry in Bollywood! Or are you limited to your YouTube world? Whatever maybe the answer i will always love you!😇", "siyaj22": "Would you rather die of heat or cold??@sejalkumar1195", "_.krisshhh": "Would u mind being more on insta", "artutopia123": "Would you ever start your own clothing line/ launch merch? 💜", "anuhegde99": "Would you leave/stop making YouTube videos for a chance of becoming a stylist for a famous Bollywood/Hollywood celebrity ?", "delphine_dsa": "Would you come to Dubai if you had a chance to ?", "nishishah.16": "Would u be a Tomboy or girly girl ? If tomboy or girly girl then y ? ❤❤", "vidushe_malik": "Would you eat a cake that tastes like poop or eat a poop that tastes like cake", "yeshvi.tomar": "Congratulations for 200k. You r great in your field.", "nikixsan": "Would you name a person or a destination if you had to describe the place you called 'home'?", "kamakshi_bhaskar": "Would you rather trek/hike a lot or be at luxurious vacations?", "elangovan_mech": "Nice shot", "shilpavmohan": "Would you plan a meetup in Bangalore??#somanysejaliteshere", "christina3096": "Would you like to work to work for a MNC with your dream job and get paid like really well or would you still continue being a utuber even if you ain't earning much??", "yukta_rana_": "Hii.. Sejal... I wish that u always keep doing this work... 😁🤗😘😘and make us happy", "sahiba_bhojwani": "What would you choose as your full time job if you ever had a choice between youtubing or treking", "slothpri25": "Would u prefer watching hollywood movies or bollywood movies", "sheth.khushi": "Would u go to a world tour all alone or just go for a trip to goa with mohak? ♡", "medhu.vadaaa": "Would you prefer to live a short quality life or a long life ill", "ishita.biswass": "Would you take one subscriber for a style on a budget thing to Sarojini in del or hill road in Bombay?💗💗", "albmacunig": "@sejalkumar1195 would you like to go for a coffee with me?", "shreyamann": "Would you rather be lost in woods or live in urban area forever?", "pooja_katara": "Would you rather continue with your life or restart it?", "smita_lisa5": "What are your future plans as of now..will you go for higher studies or continue making YouTube videos", "devna_khandelwal": "Would you go to your college or go to school for a day?", "shalini13sarkar": "wch phone do you use for selfie videos ?", "shreyadhanda": "How do you manage your time with your studies and your work?", "mad.hav.i": "Would you follow me ?😂😂", "tosha9_": "your favourite destination till now?", "akshata_amble": "When u plan a treak do u contact someone who arrange the treak or go by yourself", "mahimasetia": "would you please plan for a Meetup in Delhi??", "viren.shah9_lovers": "Smiley", "architmeher": "Would you save sirius or dumbledore? & why? #asksejal #harrypotter❤", "jahnviss": "When would you want to marry?", "shivani.shenoy": "Would you rather swap your life with your mom or Mohak for a day? lol", "dhanashri.mandra": "Would u lose all ur money or lose all ur photos?? Love u.....💋💋❤", "aoishi___": "Would you choose Coffee ☕️ or Chocolate 🍫?", "priyanka_atre1": "#asksejal would you watch all episodes of friends or would you watch all videos of yours in one go😂", "___nuren___": "Would you rather read the book or watch a series or movie based on it?", "saaviiiiiii": "Would you like to be either killed by your mother or your father?? I love you and your videos", "sahithialeti_": "Would you rather choose mohak or acting career", "bhattaraiankita": "Would you make videos or travel all these amazingggggggggg places? Alsooo, would you watch suits all day long or go shopping all day long? ❤️❤️", "_siddhi_27": "Would you like to rewind the past or be able to see the future", "ananyaaa.kheraaa": "Would you watch season 7 of suits?😋", "surruchi": "Would you rather lose your subscribers but they remember you or keep them but they hate you? Congrats btw di :)", "subhashreesq": "Ur first crossed", "mystylepalak": "Favourite youtuber", "hrishikasingh27": "Would you rather change your style of dressing entirely or wear only one set of clothing item for the rest of your life?", "__peeetee___": "Would you ever visit Hyderabad for give aways?", "aryeahhhhh": "Would you rather lose all of your money and valuables or all of the pictures/vlogs/videos you have ever shot? (Would never want that to happen to you 😅)", "tu13dekhh_._": "Who motivates you the most ?❤", "musicalmommaaa": "Would you visit my hometown, Andamans and vlog on that trip?", "shreyaa.nathh": "would u study film making /direction or do masters in economics?", "unhappy.saint": "will you marry me?", "siri___reddy___": "Would you rather choose to be stabbed 20+ times or kept on fire 🔥 to burn alive", "spacemonkey98": "Would you rather lose all your videos or lose all your subscribers? (Hope this never ever happens to you though!)😂❤", "surabhi.ii": "Would u rather act in a web series you love or serieal you love", "chandni.1409": "Would you take a blue pill which takes you back to age 10 with all the knowledge you have now or take a red pill which will take you 30 years ahead with $500 in your account?", "_vaaidehii_": "hy sejal😍uh be the best 😍👌just wanted to ask...what after youtube?Are there any future plans✌️love u lodes 💜", "jainsakshii16": "Would you rather prefer to go on a round the world trip or live in your favourite country for the rest of your life...??", "ritugupta27": "From where did you got it ?", "sejalfanpage": "One word for your fans Slay-J", "_archee___": "Ur percentage in tenth n twelth", "rajeshwaridas": "Would you rather H&M or Forever21?", "noellagabriell": "Would you rather go out on a date with a punk rock or a sportsman? 😁", "mississippi2804": "Would you ever do a video on how to enter the WORLD 🌐of YOUTUBE Starting with cameras to How to Edit and upload ? I would love it If you upload one", "shreya_sanganeria": "Would you rather go on a chill kinda date with Mohak or chill at home with your bestfriends?", "lakshitaasingh": "Would you ever change the subject of your channel or keep it lifestyle through out?", "sahana_prabhu16": "Lovely picture.. I love the backdrop!", "gen_sarah": "Would you, maybe one day, dedicate a video to all girls who feel insecure about themselves?", "akshay_kumar8899": "would u marry prabhas or rana if u have seen baahubali?", "pkplevel_1": "Mam u are so preety 😍😍❤❤", "yukta_dhankhar": "What would be doing if you were not a youtuber", "krinagala31": "Would you like to netflix n chill or travel n study for a year?", "brenelsa_23": "Would u ??", "rishika_banda": "Would watch how i met ur mother or watch no tv ??", "xsumedhax": "Would you rather always have to say what's on your mind our never be able to speak again", "we_loveyousejal": "Would you eat healthy food for the rest of your life or be with your friends and family? (Any one)", "tanvii_kaushal": "Would you live alone or with family??", "vagdevi_rao": "Would you give up your whole closet or delete your videos ? 😜 sorry I know pretty evil question", "prateekksoni": "Sejal In future did u want to get in realationship with someone..", "shagun_kalra": "Would u ever come to chandigarh?😢 M ur big fan do come there do some videos plzz waiting fr d day I can meet u up😻", "joyrini": "Would you be a full time youtuber or quit YouTube for acting (if you get a very good offer)?.. please don't say both, choose one!", "hiyachowdhry": "Would you hook up with your brother or with your enemy?", "prekshitha_masthare": "Would you like to tell us about yours and mohak's love story?", "bliss_of_happiness": "Is there any lotion to lighten hand?", "rachna_pramod": "Would u like to act in movies if a huge opportunity gets into ur hand or just continue YouTubing?? Which is ur fav?", "indiafinity": "A message to the budding youtubers who are trying hard to make it big ?", "ev_dsouza": "Would you leave YouTube to pursue Bollywood, if you get a chance?", "notsuzann": "Would you rather choose Snapchat or Instagram???", "anisha_verma5": "Would you rather eat waffles everyday or PB&J?", "prasha175": "would u like to tell us a little about how ur and mohak's love started to grow??", "tanviiid": "Would u rather live in a very very hot place for a month or a damn cold place for the same time?! Love u so much❤️❤️", "vaishnavi_srivastava_": "Would you rather be a unicorn which farts rainbow or a mermaid which eats live humans?!!", "shweta_v24": "Would you continue your further studies? If yes then What course? Btw I met you at the Creator Camp! Love you :-) thanks for the selfie we had ! :-)", "akanksha_choudhary15": "Would you rather be without YouTube or instagram??", "varidhidcruz": "Would you tell us how you managed when you got like 10-20 views initially? How much patience does it take?", "rhythmapal_": "Would you ever audition for any reality show? And if you do it'd be for dance or singing ? And also i love youuu sejall", "sejal.agarwal.98": "Would you choose shopping or travelling?", "sharpshotinder": "Would you rather give up your good looks or your fit body?", "_urvashii.xxo89": "How to deal with fake friends?", "badtaco._": "Would you like shooting a video or sleeping the whole day or hanging out with mohak", "_mahekdugar_": "Would you rather leave india and live for the rest of your life in your dream place or live in delhi for your entire life", "basha__kulsum": "Would you eat or cook?", "deekshax": "Would you do an intimate scene with Rajpal Yadav for a yash raj banner?", "teawannabread": "Would you eat insects for survival? :D", "doseofsiri": "Would you go to California to continue your YouTube career or stay in INDIA, and be an indian youtuber", "lakshitaaaxpvt": "Would you leave your YouTube channel for one billion dollars?", "mishthiimongga": "Would you rather eat your nose or your vomit?", "puma_rare": "Would you rather live without HEALTHY FOOD or have gorgeous glowing skin?!?!??", "sharmajiki_betty_": "Would you rather stay at the beach or on top of a mountain", "arafreak": "Would you like to visit Bangladesh? 🇧🇩🇧🇩🇧🇩", "theboyofbangalore": "#sejalkumar would you love /like to help budding you tuber by guiding them how to start up youtubing", "riyactivity": "Would you like to pet all the dogs in this world or become a billionaire? 😅", "pragati._.tiwari": "Would you do the look of sonam kapoor from movie khoobsurat? #asksejal", "bela.kulkarni": "Would you rather- always have to speak what's on your mind or never be able to speak again?", "swarcturus": "😍😍 this picture", "taruuxu": "Would you come to Bangalore for a meet and greet", "yourgirlswati": "Would you marry within a week or never marry ever...??", "prajakta.13": "Would you like to have a novel written about you or have a tv show about you?", "rooni_begum": "When will you visit Kolkata.. There r some flea market in Kolkata.. You should make a video explore those market. Or you can make style in a budget", "missnautanki": "Would u come to pune for a meet and greet?", "vaishnavihaate": "Would you go on a vacation with friends/family or sit at home n spend a quality with ur friends/family?😊 #AskSejal @sejalkumar1195", "deesmileo1": "Would you love to live in foreign land or live in india", "natarajan.aish": "Would you stop vlogging if mohak asks u to ? @sejalkumar1195", "shalabhaa": "Would you choose mohak over YouTube?", "divisha_agg": "how did your intrest to being youtuber devlop? do you always wanted to youtuber or a model?", "dikshakam1": "Would you leave YouTube for a career in films or Television?? #asksejal", "tulika_sinha1": "#asksejal would you get upset when there are less views ..and how did you motivated urself to do videos in the starting when u were not so famous as now @sejalkumar1195", "unsakhann": "Would you want to come to pakistan or go to bangladesh?", "nityaa_malpani": "Would you rather live near the beach or in the mountains?? Love you!❤❤", "saloni.bhatta17": "Would you spend time with your family or film for youtube?", "rosh_menghani": "Would you choose to be BALD or have NO EYEBROWS??#asksejal @sejalkumar1195 love you and congrats for 290k❤😘😘", "evannforlife": "Would you rather pick up an makeup product or a skincare product?? #asksejal", "missquirky04": "WOULD YOU MARRY MOHAK OR BE SINGLE FOR REST OF YOUR LIFE. I KNOW YOU WONT ANSWER THIS SO NEVERMIND LOL.", "_sakshisaini20": "would u ever try the river water rafting... it is super fun... at rishikesh (uttarakhand)", "urvishrivastav": "Would you rather be able to teleport anywhere or be able to read minds?", "atulkum.ar": "Would You Tell Which Place is This??? 😍", "priyaaankaprakash": "What would you prefer : watching YouTube videos. OR Hanging out with your bestie...😃", "sushi_2109": "Would you prefer: making Styling videos or travel vlogs?", "mehak_hooda_": "Since you are an all rounder and love trying new things will you try doing any art or painting related video rather than diy ? 😁 #asksejal @sejalkumar1195", "arfakins": "Would you rather travel the world or never leave India?", "__nusart_": "would you rather spend money on make up or cloths", "romyrodri_": "Would you rather able to turn invisible OR be able to fly?", "ohsanayaa": "If not you tuber then what else would U have wanted to become?@sejalkumar1195", "shivangii.__": "Do some cooking videos #asksejal", "joyner.fernandes": "Would you rather never grow old? or be reborn again and again?", "kairavi_bajaj": "Would you prefer waxing or shaving(if u had to chose one)?", "sheriljain24": "Would you choose YouTube over traveling the world? Love your work Sejal @sejalkumar1195", "_simrankulkarni": "Would you show us some of your childhood pics...@sejalkumar1195 #asksejal", "ananya_110": "Would you be wear lehenga for the rest of your life or wear a dress for the rest of your life?", "adi7i": "Would you plz do room decor videos", "dhwanimehta15": "Would u be a home person or stay out all day..?? (If given a choice)", "prettylilmakers": "Would you write a book about your journey? @sejalkumar1195 #asksejal", "_srushhti_": "Would rather wear black party wear dress or be in your pajamas for the rest of your life ? #asksejal", "swetha_v__": "Would you rather spend your weekends with your boyfriend or with your family? ?", "sanapathania20": "Would u choose ur best frnd or mohak ??? #asksejal 😊😊", "xumbal_": "Your Sibling ??", "karishma1910": "can u do cooking video or bf tag video???? #asksejal @sejalkumar1195", "nikhathfatima56": "What inspired u to become a youtuber and i love ur smileeeee😊", "_yashwitha": "Would you go without makeup or without style? #asksejal", "disha.patpatia": "Would you choose your favrioute dress or favrioute pair of footwear????", "riya.saikia": "Would you like to be an youtuber or a model???", "khannabhavyaa": "Would you hug your worst enemy or live without internet for Your whole life ?? #asksejal @sejalkumar1195", "ary_artz": "Would you spend your money on clothes or on traveling?💸#AskSejal", "vaishnavi__rastogi": "Would you marry mohak ? ♥", "tiny_dancer_from_1996": "Would you rather do YouTube or travel the world (if you have to choose only one )?", "i.m.sonam": "Imagine you are not an youtuber than which profession would you choose, or remain a simple girl who will get married after 25 #asksejal", "riiyanegii": "what would you like to buy if you just won a lottery a) skincare essentials b) makeup essentials ??", "diary_of_duati": "Would you rather go out without makeup or with makeup on a date ? And why ??? ......plus congrats !! & love you xoxo keep doing the good work", "vandana.reddyy": "Would u live without Internet for a day or without memories for a day??😂😂🦄", "shalini0792": "What's the kind of challenge/videos you like to watch in YouTube .. p.s.: i love you ❤", "gayatrinairrr": "Would you prefer being a model or a designer?#asksejal", "poornikaaaaa": "Would you do a brief room tour video or even a house tour is ok..", "theurbanyatri": "If u had a chance to live in Pokhara, Nepal.. Would u live there with mohak for 1 year? :p @sejalkumar1195 #asksejal", "prapti0312": "Would you rather lose all your subscribers or all your videos?", "akansha.writes": "Would you like to marry your favourite Celebrity instead of mohak?", "rushaligrover": "Would you like to swap your all current clothing with a new wardrobe?? ....And it's been very long i have been asking u to do a how to manage your almirah ! #asksejal", "meghanakella": "Would you marry Mohak or are there no such plans as yet?", "anveksha_": "Would u like to have a dog or a cat or none @sejalkumar1195", "rajnandini_sagar": "Would you continue your YouTube channel or leave it for an amazing opportunity in modelling? Tell only one . #asksejal", "anushka_2941": "Hey! Would you rather eat a plate of worms or lose ur subscribers? 😋😝 #asksejal @sejalkumar1195", "rukaiyyaaa": "would you consider visiting Sri Lanka one day? :)", "nutellamyname": "Congratulations....... Would you dance on a street to earn for a beggar.... As happens in foreign countries???", "shikhawaghela": "Would you leave YouTube over acting?", "prixydarx": "Who is your biggest asset in life? @sejalkumar1195", "karzomkyi": "#asksejal @sejalkumar1195 the above question", "travelwithgoonj": "Would you share your fitness routine(if any) or suggest?", "supritha_29": "Would you rather have a lot of popular friends that secretly hate you or that one loser friend who truly loves you? #asksejal", "kaku._.s": "Imagine internet goes down for a day.. or a situation where u can not do anything productive like shooting or editing.. So would u rather sleep all day or roam around?? Lets not consider the temperature in delhi. 😂😂 #asksejal @sejalkumar1195", "kaminibisht14": "from where and when u started ur u tube journey and the problems u faced nd ur suppoterss ...@sejalkumar1195", "bhavnarayanan": "would you like to contribute to any worthy charity of your choice today? think that may be a worthy way to celebrate 200k :) #asksejal #asmallgeturegoesalongway", "sankalp_26": "shopping from sarojini is better or kamla nagar @sejalkumar1195", "pranitha_katta": "Would you accept mohak's marriage proposal ?", "joye_13": "Hii sejal di ... congrats for 200k ... so I wanna ask you that what is your time prediction for 1 million subs ??? #asksejal @sejalkumar1195 .. keep going 😊😊😘😘😘", "dyumnaa": "Would you be a fashion youtuber or only a vlogger for the rest of the time?", "himani_desai__": "Hey sejal congrats i want to ask that what do you do to be healthy and fit", "goyalprakriti": "Would you eat thoughtfully or whatever tastes good?", "hitashalalwani": "Would you like to date an actor? N if yes then please tell the name😅", "manizz24": "Would you continue YouTube even after getting into Bollywood? ❤#asksejal", "smriti_singh_1": "Would u prefer beaches or hilly areas n the reason for choosing that particular place", "ishitaakalraa": "Would u plan a meet n greet in delhi soon ? #asksejal", "ss.sanju": "would you visit chennai ever? ps : I love you", "sonam_sethia": "Some tips on confidence that u wear #asksejal", "_i_nikita_": "Would u prefer being in an open relationship or a full on committed relationship? #asksejal", "somyag555": "@sejalkumar1195 Would you go for world tour or infinite shopping if you get a dollar million jackpot? #asksejal", "_varrniika_": "Would u love to change any 1 thing in ur life that u don't want ? #asksejal", "maitri_g": "Would you rather have the hiccups for the rest of your life or always feel like you have to sneeze but not be able to?", "srishti_sridhar1312": "Would you continue with youtube or choose a super paying profession??? #asksejal @sejalkumar1195", "rhea_rs7": "Would u rather go into bollywood or countinue Youtube#AskSejal", "piku_12": "Would you prefer skirts or shorts??", "_diya1115___": "Would you go to Kerala or Bangalore for a long vacation", "vrinda_mehta98": "Would you choose monochrome over striky neons for a night club party?", "amrithaha_": "Would you rather eat worms or drink a glass of blood??? 😂😂😂😂 #asksejal", "umama21": "Your fav actress from Bollywood and why #asksejal", "riagautam16": "Modelling or not?", "anisha.koushal_": "Would you ever work in films ? #asksejal", "khushikhanna72": "Would you rather be completely invisible for one day or be able to fly for one day?", "ritikamalkanni": "Would you marry Mohak?", "shreya_ar": "Would you have loved someone more than anything?", "miss._.diva_": "Would you continue as a YouTuber for Eva ur lifetime?", "rajashree.igram": "What would you do on a day off from all social media?", "keyashah340": "Would you dance with a crowd on a silent music or alone on loud music? #AskSejal", "dishasanganiii": "Long hair or short hair?", "prarthana_dash": "Would you make YouTube videos if you weren't paid for it?", "naomimathew": "Would you rather be homeless with your friends and family or be a millionaire and live alone?", "nehal_koradia": "What are your hobbies? #asksejal @sejalkumar1195", "abirameeeee": "Would you go for trekking every once in a month? #asksejal (as you have been back from one! Little bit of experience?)", "jankisolankiii": "favorite youtuber? and love you sejal😚😚@sejalkumar1195", "tanusha_2211": "Would you prefer wavy hair or Pin point straight hair?", "aaayuuushii": "Would you ever go back to academics?", "audreycolaco": "Besides YouTube what else would you do ???", "karimerani": "Would you rather, cheat, or be cheated on?", "diarathod_": "Is that your career", "khewa.2509": "Would you hestitate being a indian youtuber in other countries?😁 #asksejal #plzzreply", "amishakhemkaa": "would you rather be a youtuber or a srcc student? if you had to choose one, of course.", "anshuminz_": "How to style a saree for elegant look #asksejal", "hashmi_faiza": "Would you rather lose all of your money and valuables or all of the pictures you have ever taken? #asksejal @sejalkumar1195", "manasa_chintalapati": "Would you do a music Collab with me please 🙏🙏🙏", "riaarora_24": "Would u ever like to work in movies or continue youtube?#asksejal", "cloudy_megh": "Would be sticky all your life or itchy?", "_afreensayed_": "Would you love travelling n filming overseas or in india if given only one choice?? @sejalkumar1195", "juhichandan31": "Would you choose modelling or youtube ? #asksejal", "rupaangee": "Would you do a boyfriend(Mohak) does my makeup video?", "rishika_aleti": "Do you work out regularly ? And you do only the cardio or the exercises with heavy machines ?", "_ramya_13_": "Would you rather spell like poop all day or stay locked in a wash room all day!#asksejal @sejalkumar1195", "sanjushama": "Would you do a video on your screen care routine?", "riyabramhe": "Would you like to be an actress one day?", "aphenomenaldisaster": "Would you like to trade lives with anyone? If yes then why? Also, if no, then why?", "aanchal_khandelwal19": "Would you ever go on a trip without your camera or phone? 😂", "adi.anjaani": "would you ever call anyone of your fans for a day out?", "doubletapbynima": "Would you visit majnukatilla again???? I am a tibetan girl we met near patel chest last time after your talk in Hansraj. Love you sejal", "rhearhea23": "Would you ever make any video on curvy girl's stuff??", "_shreyaax": "Do a boyfriend tag #asksejal", "prerikha": "Would you like to come to Hyderabad for a meet and greet ?congratulations for200k ...!!!", "vxrnikaa": "Would you rather be a bollywood actor for a day or a famous model.", "lillian_joseph2000": "What degree did u do after high school? Are u planning to start working in that profession Or continue on with YouTube ? 💕✨", "i_shwetaa": "Would you like to join me to you videos 😋?? Or would you like to come to bhopaal to meet me 😍?? Love you sejal", "siddhiii07": "Would u love to continue you tube? 😘😘 #AskSejal @sejalkumar1195", "ahhlameee": "Would u like to come to mumbai for a meet and greet ???", "chetnathankii": "#AskSejal what is your fav YouTube memory? @sejalkumar1195", "talk2tiara": "Would you like to do a boyfriend tag with mohak????... I like to see you both @sejalkumar1195", "swarnima_____": "would you pick nude or pink shade,if you were to choose just one lipstick for a lifetime?", "tayibah11": "Would you be my friend?? 😢", "lydiamashudi": "Would you rather have your main channel videos be deleted or the vlogs on your main channel be deleted?", "manvi.rajput": "Would you go for post graduation or continue being YouTuber ?", "c.chanda.ok": "What's your favourite colour??", "notsocoolmahi": "Which model of pixel you have", "_kavyaprem_": "Do u lyk travelling alone by exploring each nook nd corner d way u lyk or in a group?", "nidaaaa_____": "I have the same backpack 🎒!! Literally the same from westside!💋😶", "muskan_mahajan_": "would you give some tips that how should one start vlogging and even that person wanna become fashion designer....? Tips please...would it be useful or not ...", "themahiway_": "Would you choose to be Rapunzel or Snow white? & I love you ❤️", "gunjanpatel__": "Would you ever do a comedy video on type of frndz or something related to schl or college days? @sejalkumar1195 #Asksejal", "diivvyaaa": "Would you marry Mohak in future? 😜😜", "pemmuuu": "which countries would you like to visit in the future? and congratulations xx", "dishagoraksha": "Ur best make product u cannot live widout?", "farhat.k262": "Would u like to tell something about your personal life..", "appi________xx": "Nice pic", "paritabhattt": "Would you chose to stay indoors or outdoors?", "revathyy": "Would you ever give up on YouTube for a promising acting career?", "aparna_uppal": "Would you rather be stranded on an island alone or with someone you hate ?", "anithavenkatesh411": "Would u like to wear Zara or forever 21", "_divyaaaaaa": "Would you dare to forget mohak. (Amithajones)", "jukta_sree": "Would you go on a blind date @sejalkumar1195 ? XD 😂", "shruti_gupta29": "Would you choose mohak over youtubing??", "_.pataka._": "Would you like to sing a song for me?😻😘", "_notkyliejenner": "Would you come to Bangalore for a meetup?", "_smilista_": "💜😍", "vaishalipippal94": "Would you be a profession dancer or an athelete😃😊😄 love your videos.", "jinal_dwadia": "Why are you so cute ❤️", "ra.s.h.i": "What would u do if youtube wasn't there?????", "manishabarik30": "Name all your favourite Instagram stores!!", "trups_corner": "Ur bag is so cute", "subhomita_baksi": "Would you rather earn more money doing something else or continue YouTube?", "bhavyajaggi22": "Would you go on a solo trip all by yourself? Either abroad or within India?", "yogawithramya": "Would you watch Baahubali 2?🙈"}