{"prachi_thapliyal_aka_prachu": "❤️❤️❤️", "komal_negii_05": "Beauty 😍", "mika_ana07": "🙌🙌", "altkazi": "🔥🔥🔥❤️", "avniverma17": "I love you ❤️", "_isshi_11_": "All these pictures from bali are not doing any justice to how pretty u actually are.. get some sleep girl.. u lllook exhausted and drained..!!", "sayyed_manvar_ali": "👌👌❤️", "thadoi": "Is this a look? U look sleep deprived and dehydrated! Take care !", "beer_hearted": "Extremely gorgeous", "aargh__idk": "Ugly af🤢", "taniya_mitra_": "Listen up all the beauty guru who are trying to put a negative comment . Bali goa this are the place where you will get tanned . So please don t you guys put a comment on how she is looking or whatever .", "lilmiss_sawarkar": "I m sry to say bt u r so ugly", "mdsameershaikh001": "Wow🔥🔥🔥", "asifchauhan1916": "Beautiful Angel ❤️", "manoj_dubey2003": "😚", "ehmyabbz": "audi mel waljyo se", "dipa0509": "Scary", "pinky_910": "U r really beautiful in and out sejal......by seeing some of the shitty coments really made me sad coz I've watched every single video of u n loved ....dis is d first time I 'm commenting i guess.....bt stay d same ....n we love u d way u r.....", "_panchomih_": "Those commenting u look scary, bad etc plz post your photo without filters", "thejadeso": "beauty 💖", "thatbindigirl": "So cutee", "belleame_mblog": "Beautiful❤️!!!", "shrishhtiii": "This picture is looking shit", "safia_308": "Looking beautiful 😍😇", "themizorginial": "❤️❤️❤️🔥🔥🔥😘😘😘😍😍😍", "iam__ashna": "Beautiful ♥️", "_o.o.sumaniya_": "You are beautiful, sejal. 🥀❤️", "kkkkaizer": "💩💩💩💩💩💩💩💩💩💩💩", "miss_hotchpotch": "Cochela kinda look🔥", "sejal_munot": "@twinklebhandari_ ?", "tanyabakshii": "You look amazing Sejal! Way to go!", "rekhapathak862": "Glamour added in simplicity", "venky.s99": "👌", "bluefrog000": "I am still finding her beautiful. What is everyone talking about?", "vanshikamunjalpvt": "You look pretty❤️❤️", "poojaprabhu28": "It's looks so natural! Beautiful ❤️", "shri_krishan_kamad": "Original pic", "shivani_k03": "Glammed up? Like seriously", "sakshisharma18_": "💜💜💜", "mu_ng_rei_th_ot": "Blacky🙄 I think you don't know how to do makeup girl.... You better learn", "meena_509": "Are you sure you're glammed up?", "sarakhan16": "You are beautiful just the way you are. :)", "fxckilovejustinbieber": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "no.tear.left.to.cry": "Ugly", "___wander.woman___": "U look so pretty...like seriously telling after seeing the comments i realised tht there ws no makeup...mi jst didn't notice anything...its jst looked so pretty n natural", "mommy_unicorn_": "Eyes❤️", "anisamaity": "😚😚😚", "smiles_yogi": "50 hazar kharch krke ye garib wala look up karwaya hai..... Agar koi bole ki garib banna asan hai to look @sejalkumar1195 😍😂😂", "dharwalvijay": "Glamours👍", "m__feeling_crazy": "Your videos are awesome and very helpful but u look a bit dull in this", "megha.megha00": "In your this post I see indian-ness which I miss in other posts and here I can relate to you very much . Thanks for this post.🌸", "anu_gupta768": "I don't think there is any kind of problem in this picture sejal... You're looking pretty as usual even with the tiredness❤️ you're a girl who meant this word \"Bohot Hard🔥\"", "the_camp_wheeling_tc": "Not so pretty without makeup after all, huh", "imtiaz.faiza": "Looking prefect ❤️", "dxbalexsandeep": "I know that you probably will never see this and that you most likely don’t know who I am or that I exist, but that doesn’t stop me from being an active fan of you and your instagram.Really, I dont know who you are, you don’t know who I am, but through the power of your instagram and stories Everyone needs an inspiration especially in this day and age, and inspiration can come from anything or anyone and can affect a person of any age. I want you to know that you are my inspiration and it is through your instagram posts. I keep up to speed with new posts and insta stories.I can’t help but get excited when your new post or stories .What can I say? You are just that amazing to me Now don’t get me wrong; my constant admiration for you does not stem from my inability to love my unique self. Not really. However, role models, no matter how many someone may have, serve as a tool of inspiration and while many (myself included) have personal role models in our personal lives, those who are famous can add just a little something special to the everyday journey of life. That journey needs to have idols of both genders and as a woman, other women who do great things and have incredible talent is empowering. That’s what you are to me. I can only hope to get to meet you someday, even if it’s only for a couple minutes or seconds, so that I can hear what you have to say. For now, I’ll continue to admire your instagram  and achievements you’ve done and continue to be a loving fan of you. Isn’t that what celebrities always thank besides their family and coworkers? Your fans are true and I’m glad to be a fan of you. Keep being awesome.", "franchelle25": "You don't look glammed up though, it looks like all of your make up is all over", "poojaaa_xo": "You're soo pretty!!!🙈", "mermaidista_": "The caption 'glammed up' goes wrong here. This is dead tired look. But that's ok. Just the caption is absolutely wrong. Otherwise nice picture. 😊", "janvi_patel0071": "U looks really very bad without #makeup", "gill_farm_12": "Illuminati?", "kumkumpandey": "Lovely pic Sejal...makeup just enhances your beauty but Sejal doesn't need to do that as she is a beauty already. Lots of love for u seju 😘", "piyu_15": "You look perfect the way you are...way to go Sejal...!! You have the courage to not have a filter on your picture n kudos to you for that...PPL who are talking about how you looking then they seriously need to think what they actually understand by the word beauty... everything cannot be superficial... I totally support no makeup and natural beauty...!! @sejalkumar1195 you look perfect", "linoka_zhimomii": "Glammed ?😦", "menaveengiri": "Souldout 👼", "tas.zohar": "dusky dawn beauty!😍", "shivam.sk355": "Yeh Kaun Hai😵😵", "prashantkapoorofficial": "Bad", "tasha_ulupi_saikia": "Aysa lag Raha hai kisine silencer mu pe khol dia ho. No offence😂", "_maaadhuuu_": "Flawless🔥❤️", "sakshiagg26": "@sejalkumar1195 Can you do a post on how to get rid of this tan?", "subo_mani": "😍😍😍", "cony309876": "🔥", "shalinimandalfanpage": "So pretty sejal.i love u always.love you ka meaning pata hain na sejal?? Sirf tumhe pyaar karti hu...tumhara face ko nahi kuch bhi nahi...bas tumhein pyaar karti hoon...", "thapatriptime": "C did this posted this to grab attention n hab more views... critized n get popular on... nt cool girl...", "fitness_wid_komal": "U look tired", "himalayan_at_heart": "I would love to believe that it's your natural look but it's actually makeup done very badly! Try to be a bit more careful and pro from next time before uploading anything or else u will fall out in the crowd of good content and looks! Also try to improve your content... It's not good", "piyasyam2912": "And that’s why I love you", "mayank_rpm_": "What happened @sejalkumar1195 you look tired and ill. Sorry but I am being honest hope you didn't mind it.", "larissa_wlc\nVerified": "Verified", "ankush__prabhakar": "tan ho gye ho apne jaise lg re shi hai🐙🐙💜", "sneha.ha.hah": "🌹🌹🌹🌹 Beautiful 💙", "adyashaaa_": "Uh look damn beautiful..... yes uh look tired but yeah i love tht uh r not faking it ❤️❤️", "_tesay_": "You look beautiful.", "monicad2588": "The tan is beautiful ♥️", "basitnahi": "You look so gorgeous❤️✨ #goals", "singhtanyaa": "Beautiful lady with abondonce of deepness in her soul ❤️ true example of being yourself 💞💞", "sarastick__": "❤️", "hemprovabarman": "I like you because you embrace your flaws proudly ❤️", "_.muskansingh_": "Sejal you look gorgeous ❤️❤️ every time without or with makeup !!! You're so beautiful ❤️", "adiosgusta": "Make up doesn't suit you sejal. Like the glam glitter n tan shade doesn't fit well", "adventurekid___": "U G L Y", "_yolo.kid__": "Yak 🤢🤧", "tamasi_samadder": "Beauty overloaded forgetting all filters .. Love u 💖", "h333ral_kamani": "No matter what I love you sejal....no matter wht people said but it's good to be natural rather than layers and layers makeup and being fake to ur self after end of the day you are who u are..salute for ur guts...now I love u more......", "purified_4477": "Modestly dressing is real beauty and self respect, otherwise others may view you ad a commodity for their lustful pleasure.", "kritika_happysoul": "Learn to respect others. She is into a busy schedule so it’s obvious that it must b tiring for her. At least appreciate the fact that she is not fake at all. She is truly a gem n hardworking n grounded girl.", "pragatidas": "We are so proud of you❤️", "hemangi.jadhav": "I love this pic 💙♥️", "mrunalpatil28": "You are beautiful inside and outside", "shraddharajmohan": "Yayy💓", "tahsina.tasfia": "Why are you looking like this?😢😢😢", "syedasara23": "GUYS... u shd respect her. She is atleast doing something with her life", "garryguggz": "Still you girls call boys ugly😂😂😂😂😂", "suri_1305": "Like if you think boys have natural beauty too ... 👍", "isha_tanwar_": "you look cute❤️", "_.roobaroo.oo_": "Sejal, yk what you're real in this reel world. ♥️", "heliosdiary": "All the hate comments and the supporters in armour feels so damn funny. Like duh! She’s an adult she can post whatever she wants to if you like it nice if you don’t just scroll down and find something you like. Why waste so much energy and do shit on someone else’s post dear. #justsaying I hope people don’t come biting me after this comment 🤣", "sanika.devdikar": "Man, what is wrong with people and all these shitty comments? Koi poora time 24*7 fresh kaise dikhega? She is tired! So what? How is a person supposed to look the same all day? My gosh, what is hilarious is people seriously don’t use logic. It’s very very easy to sit at home and joke around about someone’s looks .. she looks fine to me and I am sure to many people she looks just fine. Stop with the constant bashing and judgements on her. Don’t @ me. I said what I said. @sejalkumar1195 you are BEAUTIFUL!", "sridas8714": "👌", "i.m_bee": "Beautiful 😍😍😍", "puneet._.grewal": "Makeup... sorry where? ?", "sammalik58": "👌👌👌👌", "girlbishhey": "prettyyyy", "tapendra_kaul": "Eww❤️", "notjustpurav": "I was stunned for a second I thought I had seen Malaika Sherawat", "dheeraj.sowkar": "Beautiful", "ggotcha21": "At first when I saw this picture, I was like she looks really tired. But that’s the beauty of this picture unlike other bloggers that post edited pictures that we drool over and that make us feel hella insecure. I saw this picture and could resonate with her. Kudos to you for posting this picture and not taking it down when people commented nasty stuff. ♥️", "akansha.writes": "Beautiful any day in anyway💕", "aakanksha_choudhari": "Nice 1", "bicker_head": "You look very pretty. I do not understand how tanned equals tired. You go girl ❤", "shravyadharmapuri": "@sejalkumar1195 I'm a huge fan. The reason I like you is because you are very real and I can relate to your work. I am from Hyderabad and we really like you here. So chuck the negativity and keep doing what you are best at ❤️❤️❤️😁", "sadhnaa16": "You are gorgeous! ❤️", "dauntless_1001": "Love ❤️❤️❤️❤️❤️❤️❤️❤️", "drishtiikon": "Hain! Really 🙈 I found this pictures so raw and pretty and when it showed up on my feed I was envying your collarbone but instantly liked it because I actually found it gorgeous .. I don't know how people only like filters and make up face these days .. I loved it .. keep inspiring us❤️", "varnikarajpal": "You’re gorgeous! Fuck people", "vivacious_nidhi": "Looks like your makeup got smudged", "________b__y___e______b___y__e": "Behan thoda makeup krleti tum ko lgraha h bht khubsurat lagrahi ho par nihaiti gandi lgrahi ho aesa lgraha h ki sex kr k bethi ho Sahi energy khtm kr k ....😝", "yxungfreeze": "Ganjedi", "scholarshuvo2": "👌🔥", "coliewolliecoliewog": "👌 You look beautiful 😍❤️", "miss_taneja20": "Gorgeous girl 😍 💄", "namit_2709": "M also in bali can we meet pls😍😍😍😍😍😍😍😍😍😍", "simrankharbanda90": "All that you can read here and see are just momentary but @sejalkumar1195 TODAY onwards you have levelled yourself up, way above this post. Life time take aways on its way! Enjoy every word here! You are unstoppable! 💕", "dinesh_vadhel": "🔥🔥", "siddika_1925": "U became little tan", "vishal_the_actor_": "Follow up me", "b.r.i.j.w.a.s.i": "❤️😍😍😍😍😍😍 👌", "isheeta_yadav": "It's sad that we live in a world where girls can't appreciate a girl being herself and not covering her face with makeup or filters! You look gorgeous Sejal 🌼", "nimishelsajohn": "❤️❤️❤️❤️😚", "ruhi.chopra": "I like you sejal but this look is a disaster sorry.", "bhargavi2604": "Gorgeous woman.. Inside, out!! 😘😘😇🌻😊", "pinku_4_ever": "Sun burn 😁", "confessionofmusings": "This is ummm not glammed up. You look good naturally. May be you are tired just when this was clicked. We should know when to stop and take rest. 💕💕", "reusily": "Linda 🔥🔥🔥", "shreya_das_14": "Woww if that's the look which u get after spending on tons of makeup then I am glad that I step out of my house daily without applying any makeup.", "the_youtubed": "🔥🔥🔥🔥", "batulpankh": "I like it raw😘 dusky beauty 😘", "am__aan": "looking very bad", "mrs.noorzaib": "oh no wat hpnd to u 😁", "nitin_pitin_sitin": "i repeat you don't need any type of make up... 👍", "neelam_himabindu": "U r looking so Tany", "shakkarpaare": "That looks anything but glammed up 🙊", "raghuxsoni": "@raghu_soni_5535", "md.usman.9": "So beautiful ##👌👌👌👌💐", "blushboutiquue": "Guys at least she has guts to come out natural 🌸🌸🌸🌸. At least she’s not setting any beauty standards so that every girl who watches her feels bad and hates herself. Inspite of being a blogger she’s daring to show her real self. So please stop hating stop #stopjudging", "trishaaaa7797": "You look so tired", "nehavasani4": "🤣🤣🤣🤣🤣🤣", "mahek__k": "Did she go to Bali from Dadar? @himanigandhi12", "harmitak": "😇Guys everyone looks like dis only without make up , stop criticising she is looking awesome", "harleen98": "Face ko kya hua", "mangal4724": "Nice pc..", "zjeddie": "💕", "shah_ush": "i agree... u look so tired.. i think u cud have done better", "ammukuttypulli_1222": "Dusky doll", "ishikagupta______": "Yo you call this glammed up? Lol", "oyevishwajeet": ".", "naaz.arora": "no brow filling is done😂", "bae123578": "Ugly🤣", "bhavaniambu.1": "U look worst", "nivziz": "yuuk", "mohitshu": "#illuminaticonfirmed🔺", "apna_meme_ayegaa": "Althogh im your big fan but You are looking devastated mam ! This is not a hate comment ! Its a genuine thought of mine ! Baki jis ki jesi marzi", "we_love_sejal": "We learn so much from u....u are a great inspiration...u are so much different from everyone else...much love to u ...❤❤", "_bebooo_18": "Uh look tired sejal or without lipstick uh not looking pretty only in this piccha😑", "thesmalltownblogger": "Hahaha. Look at you! So cute.", "gourmet.pritesh": "❤️💯", "isha_kumar03": "wow😍", "harmankaursiyan": "Hey Beautiful ❤️", "shelikesyouuuu": "@sammiimmiii regarde moii😝😝", "vimallaharawal": "👌👌👌👌", "per_sonali_ty_re_defined": "Benchooo Filter use kar leti 🤣😀🤣😀🤣😀🤣😀", "ur_worst_nightmare0201": "you look exhausted dk why😅", "quasi.static": "U look natural n u look Beautifully tanned... Lovely picture 💕", "anubhav_vashisht": "Oh teri...", "tushant_8826": "I was scared", "o.so.pretty_bypoojashah": "How gorgeous!", "_catchthydreams_": "The tan 😮", "im.radzz": "Glammed up ? I dont see how🤨🤔🤔", "_i.am.lost__": "Beeemaar lag rahi hoo... sachhiiiii", "subinsahadevan": "😂😂", "polkadotsandsushi": "Is that Deepika Padukone's distant cousin !!!❤️❤️ u look so much like her !", "vignesh2352": "🔥🔥🔥🔥🔥", "black_ocean2001": "Please take care of yourself, you looks tired and devastated.", "sinu_sinuuu": "Sejal you know what you are not looking soO bad i like this picture becoz i believe in naturel beauty 😍😘❤", "_.vinod_gowda._02_": "❤️", "jjassi860": "Tanning🔥", "rahulthestorywala": "YOU are beautiful... that's it...", "goodvibesonly_upasana": "That's just so real.... I appreciate that you have the guts to put out to the world the real you. You could have filtered the pic... Kudos.", "dr.riya.soni": "U r horrible tanned plzz go natural dont put make up plzz😥", "riyankashrivastav": "Such a cutie u are 😍....u look so true n genuine in this pic. It's like yes, even the most fashionable person can get tired and worn-out....so what ? that doesn't dim Ur shine....more power to u girl. Keep rockking 😉", "manavi15": "Your eyes are so pretty", "puja_choudhary": "Proof that sejal kumar is the best blogger and all of us!", "itisumana": "💓", "the_devine_shayari": "U r looking kaali in Bali .lol", "syahithelettering": "Lovely but u got tanned big time!! Please have a look at my profile n shower some love..❤️😊 i hope u like it!!🤩😊", "shubhangi_shinde001": "You look so ugly", "sanfiya_778": "Looking so natural, lubyyaaa 💕", "anantdahiya34": "U look so pretty sejallllll", "vishalbiradar8055": "🔥🔥", "sindhuvermaofficial": "@sweta1272 juhi asli hai", "rashikashish": "Youuu❤️❤️❤️❤️", "krystal_butterfly_": "Tan goddess💛 @sejalkumar1195", "979.aditi": "Fav❤️❤️❤️", "annuuu_singh": "Is this u call glammed up?", "gaurav_singh_20.06": "👌", "vidhikodia": "What shine ❤❤", "ray_arvi": "Looking tired", "jasnaajazz": "😮oh no taned..but still beautiful", "suchit_patil_26": "💕", "shipra.yawalkar": "Hey babe. We understand you are tired and it's okay to be tired it's only human after all. Thank you for letting girls like me know that you can be your authentic self and don't always have to plaster makeup to look perfect. Lots of love ❤️", "prayagism": "Tanned ,brown and beautiful", "sakshoc": "You look so starved..", "ankita1723": "wat happen to u.... r u OK.. @sejalkumar1195", "ketakee_09": "Oh my god❤️❤️😍😍", "rashi_priyam": "Why are u trying these random fashion brands? You look worse than normal. Just an honest opinion", "take_tellinyo_military": "topcute", "maruthi_reddy_mr": "Osm", "myspace_27": "Looks like you have donr some Hallowe'en makeup!!!!", "shwetaamgaonkar95": "Its scary", "arshdeep_kaur04": "❤️❤️💝", "secret123269": "You are so ugly", "dhyey_dabhi": "Black beauty 😍", "rashmiikhandelwal": "Ur lips are looking very bad..bt u looking gud😗", "tomar155_muskan": "U look weird girl..nd i think u r sad🤨", "yasinshaikh9936": "Beauty😍😍😍😍", "dhirengwalani1999": "❤️😍", "__yashee": "You beauty!!!😍😍😍😍", "_nanditha_aa": "Omg how r u this much beautiful😘😘😘😘😘😘😘😘😘💗💗💗💗💗💗", "nityatomar21": "I think she was being sarcastic when she mentioned the look 'glammed up'.. she looks natural, beautiful and most importantly real💕", "alpanarashmi": "Is this your glammed up look 🤣", "zb.naqvi": "U are not looking nice 👎🏻", "shalmalyeee": "Make up?thats the make up after 24 hrs of work! You look great in your everyday make up. This isnt Glam", "abdul95jabbar": "So gareeb", "asmita5689": "🤮", "usmanshaista": "Y ap tyar hwi ho lg ni rq", "ishchaotichead": "@ayvid12 look how original she is.", "tahirarupa": "Omg i m sorry but u look soo tired 😴", "_verbivore_": "You are beautiful. With makeup. Without makeup.", "vivikramsingh": "Ye kya ha", "priyankagupta921": "What happened to ur face?", "arghadeep__kundu": "Looks♥️♥️😄😄😘😘 Eternal😘😘 @sejalkumar1195 💖", "harshit__poojary": "😂😂😂 confidence", "er_numbardar": "Kiya ho gea", "kkaru_runa": "You are beautiful Sejal . I love you .", "sucharita_dhar": "U probably already know this is not one of your best looks, but Bali heat does that to you.. I know that really well, you need courage to post a pic like that where all beauty influencers are trying to hide behind perfect images, kudos to you for being so secure, maybe that explains why you are so ahead of your peers in subscribers count . You being real, that's the difference.", "iamnatrajpuppala": "Disgusting", "puja__acharya": "Not nyc", "aestheticfashionxx": "Babe 😍😍😍", "queenbee_waldorf": "The comments on this are getting me so angry! Girls get criticized and judged at, for everything these days. Wear makeup? And that's a sin, cause you aren't being \"natural\" . Don't wear makeup and you have a truckload of haters, saying mean things and bringing a person's self esteem down. What a world we live in. Whatever we do, people will have a say in it! And it's disgusting. You look beautiful, with or without makeup ❤️ so just ignore the haters out there!! @sejalkumar1195", "esrever_ti_si": "NETFLIX ACCOUNTS RS 200 4 SCREENS 1 Month UHD LIMITED TIME OFFER!!! HURRY BEFORE ALL ACCOUNTS ARE TAKEN!!! #Netflix #NetflixIndia #NetflixforCheap #netflix #watching #series #movies #chill #time #night #carbon #movie #series #documentary #house #drama Hashtags #episode #season #madrugada #gonna #minds #filme #both #instanetflix #instawatching #instaseries #instamovies #instachill #instatime #instanight #instacarbon #instamovie #instaserie #instadocumentary #instahouse #instadrama #watchnetflix #watchingnetflix #alteredcarbon #alteredcarbonnetflix #shownetflix #netflixchill #notnetflix #arenetflix #wasnetflix #months", "bojack987": "you are so not pretty.", "_shreyal": "Glammed up....?? 😑", "shital0678": "Looking like drunk and exhausted", "devikaa.786": "🌻ماشاءاللہ🌻 🌻🌻ماشاءاللہ🌻🌻 🌻🌹🌹ماشاءاللہ🌹🌹🌻 ╭━╮┳┈┳╭━╮╭━━╭━╮, ╰━╮┃┈┃┣━╯┣━┈┣┳╯, ╰━╯╰━╯┻┈┈╰━━┻╰━ ;*; *)(* *))((* *((💙))* *((🍃🌹🍃))* *((🍃💜🍃))*((🍃💛🍃))* 🍃🌹💕Awèsòmè💕🌹🍃 ┊ ┊ ┊ ┊ ┊ ┊ ┊ 🍃 ┊ ┊ 🍃 💚 ┊ 🍃 💛 🍃 💙 🎁　واااااااااااااااااااااااااہ💝 🌹بہتـــــــــــــــــــــــــــــــرین🌸 کماااااااااااااااااال 🌴ﺑﮩــــــــــــــــــــﺖ 🌿ﺧــــــــــــــــــــﻮﺏِ🍂 🌺 زبردســــــــــــــــــــت🍀 🎁شانداااااااااااااااااااااار💝 🏰لاجواااااااااااااااإاااا💝💝💟", "riannachettiar_": "Cute one, inspired...", "hajiraprvn": "So pretty 😍", "priyashreer": "U look teird😦", "i.arif.bhat": "It is bad", "burgxers": "U beautiful", "thelonetripper": "Omg 😍", "aksharaareddy": "😍😍", "surbhi0826": "U look too tired to pose", "blefle": "For some reason your face looks grey😁", "i_am_sujal_1": "#follow_me_fast💯🔫💙💙💙💙💙💙💙💙💙💙💚💚💚💚💚💚💚💚💚💚💜💜💜💜💜💜💜💜💜💜💝💝💝", "satyakisrivastava": "Natural beauty👏💗💗💗💗@sejalkumar1195", "_hansu__": "Simple look Bt nice", "the_biraboy": "Yeh maasomiyat", "c.chanda.ok": "💝", "itsme_nag04": "Looks so tied", "_deepali.jadhav": "Not cool", "prerna_kunwar_": "this was little awfull.. but sejal i really like u 💓", "sonu18_abhinav": "Gorgeous 🔥🔥", "ebatescashback1": "Great post!!😍😍Do You Need Cash Backs, Coupons, Discounts For #amazon #ebay #walmart And a lot of famous websites? Check Out the Link in Our Bio. You will receive 10$ After Signing Up.", "onlinesush2019": "This picture is scary", "nawazsagri": "Tanned af", "shivani.pokhriyal": "Beautiful ❤", "kusum_balaram": "You look beautiful❤", "singh_riya_97": "Natural beauty💖", "ssharmaxxvii": "U r dead tired....", "manish2.9": "Hey beautiful ❤", "beautybehinddmadness": "I am sorry to say but you seriously look so tired and devastated.", "smileuidiot": "Umm ummm", "rateekam": "Dhoop me Bhuni hui lag rahi ho", "ohnonadia": "Cutie 💕💕", "honeysingh8192": "Beautiful💓😍", "youtube.india_": "Such a beauty 😍", "curly_sonali": "So raw", "khushi53245": "Showing off that tattoo huh😂😂😂", "mytraveldiarez": "Wow", "shree_shenoy": "Kya chahiye .??? Bol do hum denge... Boora mat mano", "machine_learn_ai": "Please post more bikini pics from Bali.. 🔥🔥", "tanuellaa": "Adorable af 😍😍😍", "thefragranceofartistry": "It's good u tried something different 😊💕", "prinkzz17": "Natural skin natural beauty😍😍😍", "vickywao100": "🙈❤||`,Akəli na bazar jaya karo nazar lag jaegi ||❤😹 DO VISIT👉@vickywao100 💕Aao kabhi Humari Post pƏ🙊 Aapko Chai Pilaunga 💕 Coldring kƏ Saath😹", "dishakshi12._": "Beautiful 🌷", "sajjad_shaik2": "Soooooo much pretty❤️❤️", "defining_maximalism": "👌🏻👌🏻", "kritikagoyal13": "In this filtered world, people would not be able to look at this unfiltered and natural beauty . You look gorgeous and loving that tan ❤️❤️", "itz_sapu": "😍😍...what is meaning of your tattoo", "nikitaluthra18": "💕", "vartika_pandey14": "😊😊👍👍", "tanviiid": "😍😍", "solo_lover_joy": "My doll.... @sejalkumar1195", "mevi_06": "That collar bone😍😍", "__rider_on_road_05": "❤️", "the_nidhinegi": "❤️", "aizafaisal_": "😍😍😍😍😍😍 you are mind blowing beauty 😍😍😍", "luneloverforever": "Ohh those eyes.. they have something deep within..😙😙😙", "harrylovesme.periodt": "That's my queen ❤️🙌", "aditya.tundiya": "❤️❤️❤️❤️", "bhanupartap6678": "Nice"}