{"jamaltooba": "Anyway @sejalkumar1195 u've always been doing great work.. whatever you does to makeup yourself is THE BEST. besides...u look beautiful.", "tan.ishh.ka": "You look stunning", "tanvi465": "Your hair colour does not suit you. You look old.", "maus.a.me": "Guys let her enjoy some make up", "rakul_fb": "Ewwwww ur dresss i wud say dat🙄😵😂", "x_hair._.love_x": "bOht harD🔥❤", "ayeayecaptain__": "Everyone that is saying things like “boys prefer natural makeup” and “You don’t need makeup” needs to shut up because she is not wearing makeup to get ppl to like her or because she needs it. No one NEEDS makeup. We do it because it’s fun or it makes us feel confident, she’s happy with it, that’s all that should matter. She may look better to YOU without makeup, but everyone has different perspective. You can’t expect her to do what everyone wants from her because that is impossible. She is doing it for her and if you don’t like it then move on and follow ppl who don’t do makeup.", "deep.a.li": "Woah💗", "alim9736": "so sexy", "the_weirdo_31": "U r looking amazing keep trying new things❤", "kiran.saleem": "You look gorgeous. Make up is for you😍", "minakshy_mahesh": "Stop doing makeup sejal u looks ugly", "adiosgusta": "No. This makeup doesn't work on your skin. You look different. Not used to seeing you this way, so.", "shuttermakhi007": "Can’t. Breathe. 🔥", "_flutistisha_": "But that makeup actually looks good.🤔", "shreyashidebnathofficial": "Wooow gorgeous", "faizkhan1910": "Really u r cute baby", "hululalu17": "Please check your dm", "arshi81194": "Preety u sejal", "lunatic_.queen._": "You look gorgeous girl..❤️", "subhashpatil7028": "Beautiful", "_.sharmisthaaa._": "I used to like you more when you didn't colour your hair :(", "tulika__tewari": "@i.am.apricity", "_mayasrinivas__": "🔥😀❤️", "kd_speaking": "You're look way prettier without makeup😍", "neeti_singh_brar": "Sexy", "jazz_soni_": "I loved your makeup and hair😍😍GORGEOUS!!!!!", "aranyajohar\nVerified": "Verified", "minty_20": "You rock anything and everything in this world ! ❣️❣️ Keep playing and keep rocking! Do what your heart tells you to❤️❤️❤️", "vedika_khambal": "😍😍😍😍😍😍 looking amazing", "fabrizzioferrari__01": "Make up people overrated", "oishi_1195": "Slaying it always. With makeup. Without makeup", "ajayvarma.1": "Loved the engineering girls...big heart to you guys", "zinia_tahassum_zini": "Nyc", "sangeetahalde": "You look better than makeup.....its too much off makeup..", "jenifer_esha": "Natural look is very good", "_garvit_saini_": "Please dont do makeup.... You look better without makeup", "jafar_dw": "🔥🔥", "ranjita_hegde": "Make up or no make up, you do you girl @sejalkumar1195", "the__beauty_inside__": "❤️😂❤️", "no.tear.left.to.cry": "Ugly", "ayush._.prakash": "Your hair looks good but the execution is wrong ~chandler", "seldon_tenz": "You look more prettier with this hair ❤️", "pragati.8692": "That's some international model look😍", "imana10": "Actually wanted to say loved your hair colour...", "__zoya____b": "Ugly bitch", "_.rashiiiiii._": "Awesome😍❤️❤️", "maruthi_reddy_mr": "Kdk", "aashanarealme": "hot", "umbon_sue": "You're pretty without make up 🤗 or maybe minimal make up .", "shalomgifts5": "We've dealt with high end clients like harbajjan singh and kiara advani and also big companies. All gifting and packing services for all occasions and festivals.  Check out our page for more. Hoping to hear from you soon thanks alot.", "charooranjan": "Oh my good for one moment you looked like @thatquirkymiss", "palak7807": "Drop dead gorgeous", "mamta.creations.studio": "We like the cute innocent non makeup real looks wali sajal... makeup wali to bhari pdi h youtube n insta par😁", "shivamsunda9": "😍😍", "jaswinder8405": "Sexy", "oddthud": "The fact that you are aware that it's not for you and you still adorn it, makes me cheer loud. It sure is true that you don't need it, but damn I am bewildered that you are so fucking perfect on your own that any embellishment can't just keep up. You do you girlllll", "anshikavivek": "@arpita_thegeekmom", "im_zaeem_": "This is not up to the mark", "d.r.i.s.h._.s": "Omg🔥😍", "pk.praveenkalyan": "😳😳😳🤖", "cathymoonbeam": "You look good. But it's not the same. I prefer you with less makeup. You are beautiful either way!", "the_daniels_97": "I think you look absolutely amazing without makeup❤️ that’s a blessing.... this look doesn’t suit you best", "seema_mohammad08": "Your hair colour looks awesome 👩", "mamtavchauhan": "Looking very pretty...have gained some weight😝😎", "me.bva": "Which hair color shade and of brand u did on your hair ?", "rachelism__": "Love the hair colour but the makeup is a big no", "dorothi_db": "I love ur no make up look.", "ankilaaa": "Makeup is totally for you. 😍", "pushpitamazumdar": "Slayyyyy!😍❤️", "dipu2895": "Your cute look is gone somewhere 😪", "aaresh17": "Thats not you girl...please be the original you😚😘", "abhijit_617": "Wow u look so cute and hot❤️❤️", "dheeraj.sowkar": "Beautiful", "ayalsharma": "@sejalkumar1195 you look stunninggg❤️", "shrishtinagarofficial": "Iloveittooo", "ishanomania": "Some people look more more attractive with makeup and some without . Personally, I like your innocent without makeup pics but it doesn’t mean I am right", "iam.vidhi": "It's so good to see you in such makeup. We probably have never seen u in heavy makeup. So it feels great. You look like a different person. And your hair colour adds on to that look more🔥", "saumyakapila": "Hair is nice.. but the whole look..its so not u", "lakshvir07": "I think you are beautiful with/without makeup 🦋", "kaurmanpreetmk": "This make up is not done 😐", "darkwolffx": "Ewww 😂😂😂", "n_y_369": "The line between is the happiness😊", "khushisehrawat": "You are looking smoking hot❤️❤️😍😍🔥🔥", "supriyadeshraj": "Hey Sejal! Everything here is for you. You can do anything and everything ♥️", "she_staying_alive_": "Love ur new weight gain figure. Earlier u were a pretty girl but now u r a talented hot lady as well. Lots of love.", "akshayahska7": "B🔥🔥bs", "deeksha0023": "@sejalkumar1195 your makeup is new and it's looking good. You can't fit into everybody's like box. You are doing great.", "i.donna.s": "You look like a cute kid without makeup. Now its all \"grownup you\". Not trying to be judgemental. Just honest words from an honest follower 🙈😘", "seyj_gina": "To be fair you have come so far and are sharing your personal growth and journey with the world. If u decided to wear makeup like this again, then fine. If u don't then fine. You look hot and are doing bloody well so who cares. All these people sharing their icky negativity are super lame.", "_kiki1900": "You Look gorgeous like the way you’re!❤️🙌🏻", "sjha.anu": "Sejal don’t get me wrong girl..I love wen u slay everyday..n ur hair looks amazing..but makeup gone slightly wrong..u look amazing with minimal makeup ❤️❤️", "jyotsna1689": "Ya even i liked u more in your previous avatars 😘😘😘😘😘😘😘😘😘", "phobic_12": "❤️", "srishti.bhattacharya": "u look old", "entangled.mind": "True @sejalkumar1195 ...u don't need make up...u are way more beautiful without make up", "afroasian_nomad": "Honestly we all have bad angles. She's beautiful either way", "kanchan.yyc": "Looking great trying new looks!", "_ishasingh": "Gosh I'm obsessed with your hair it suits you so so beautifully 😍. And woman, that outfit and makeup 🔥💖", "stylewithsmriti": "You look pretty 😍", "e_e_s_h_a__": "This type of make up doesn't suit you, you look so good in natural makeup, you look cute and that look can steal anybody's heart dude!!! Trust me", "_ritu06_": "You look absolutely gorgeous make up or without makeup up ❤️😍", "fiza.rehmann": "You look amazinggg!!😍😍", "saakshi_agarwal05": "Slaying🔥🔥", "thapatriptime": "Ur mkup sucks....", "dr.purnima.chauhan": "This make up.is lit😍", "anu_priya_k": "This hair color really suits you😍", "biryaanni": "You definitely look goof with or without make up. But this kind of make idk who has done and what kind is not for you perhaps. But you a queen anyway 💕", "makeupshesaid": "Love ur hair color😍", "decor101101": "@sejalkumar1195 you look ravishing girl. Without makeup you are cute. With makeup you are hot. In both the ways you are awesome. So wear makeup if you want, don't wear it if you don't want it. And this hatke bold makeup suits you truly.", "_.jisha._": "Nice hair colour💕💕💕💕💕 it suits u", "maleehamianoor": "Hey all follow my blog @fffbymaleeha for amazing stuff please please ❤️❤️🙏🙏", "me.mariyamrizvi": "Makeup overdone..simple is beautiful❤️", "_sudeshnaaa_": "Hey you r looking amazing and looked amazing 🔥🔥🔥🔥i am loving your makeup😍😍", "shreyash_tidke_3710": "I love you", "aftab.nizamani13": "So beautiful", "manocha1995": "Sexy🤤🤤🤤", "fashionbydrpriya": "💚💚💚💚", "_the_weblog_": "Which hair color?? 😍", "r0wdybaby": "Plzzzzz... Dis is not a good look u look good without makeup 🙈", "sonu18_abhinav": "Gorgeous 🔥🔥", "sayyam3550": "Natural more suits you dii", "akshitaartgallery.india": "👍", "manalidoshii_11": "Sexy", "shivanginichari": "Really looking great on you with a little change but leaving that personality in you which was I think is great", "puja1997lio": "Exactly, u look pretty without make-up", "ms_troller": "Uh loook good without make up specially without thisss make up", "janv_mua": "You look beautiful even with the makeup and it’s a personal choice ppl gon hate! I love it 💞💞", "prachigupta_1": "You shine girl!!! Love love loveee😍😍😍😍😍😍😍", "recharging128": "U Look great beb loving this new look on you 🔥💕💗", "himanshipoddar": "Just beautiful!!!! Sooo great! What a surprise to your casual looks! Crushing it soo much😍💕I love youuu🙈💕💕", "er_numbardar": "Meri kalam na jane kiyn teri tarif mai utar ayi abb agar ruk gea to mera jameer bura man jayega", "iam_bhavanapandey": "😇😇😍😍😘😍", "patel___toral": "Less makeup more beautiful you❤️", "sreejas23": "U go girl❤️", "anna_taurus_1905": "Do what your heart says❤️ but the CAS Sejal was the best😂❤️", "ushma_97": "This hair color is everything😍", "kkaru_runa": "I think you should keep doing what you feel like doing . Also we need to appreciate that she didn't use a tiny bit of filter even . She is so authentic man 🔥", "kenyottadavis": "No you’re already beautiful 😍😍", "foryou_mohitagarwal": "Anyone, please bring a fire extinguisher since the fire is on 😜 ... and, by the way, the summers have arrived, so I beg you not to increase the temperature of our planet 🌍 Miss Hottie ️", "_sneha.1609": "❤️❤️", "shreya_belavadi_": "U look good without make up ..", "shhristii": "Caption😂🔥", "khan_umaiya96": "Ur makeup looks stunning on u BTW😍😍", "_sne._.haa_": "You look stunning😍😍", "vibhoar": "Gorgeous ✨", "chandrarishika": "Awsmmmmmmmmm 😍😍😍😍 sejal waahoooooooooo........ 🔥🔥🔥sexy at the same time", "prag__the_silvershades": "Make up is not made for u! U r naturally beautiful !! Please not again...", "iamishadhawan": "❤️", "anisamaity": "U look beautiful ma'am... 💋💋💋💋💋LoveLove", "tanayaa.pvtt": "You look way better when you’re natural!!💕", "sharayu_garde": "@sejalkumar1195 I couldn't even recognize you...! You look so different..so mature..! It's amazing that you are exploring different things..just ignore these idiots saying that you don't look good in makeup..you look absolutely gorgeous...❣️", "__thatismyusername": "Do what you want sejal .. life is too short to listen to others.😉", "rashiupadhyay30": "Sejal all expectations from you broke today , girl you are preety enough with out over makeup", "ishittac": "You loook great like holly fudge you look perfect. Let me tell you, I never imagined you looking like it but holly crap you look great. You are rocking it and don’t bother yourself about these hate comments cause gosh you look great. Keep rocking it and I hope to see you when I come to India 💙 @sejalkumar1195", "nishaaa__nishh": "Change is constant....😎", "deepesh20a": "You look like Deepika Padukone littel bit 🙄", "ankitbose1998": "Hawtiee", "suvarna_manzrker": "You don't need makeup you look beautiful without makeup 😒", "anilsharma2957": "Nice beautiful", "mirmurtaza_talpur": "👌", "________solitude_________": "You are slaying it to different level.. Love ❤️", "_malvika23": "Hey you look gorgeous. There's nothing like \"eww\"", "geetaomi2008": "Love it", "_devikaarora": "gorgeous", "thegirl.with.thecurls": "Looking fab girl❤️", "okbaby18102015": "Queen ❤️", "firewhiskey3": "@siyamokashi should I do something like thos", "shekhawatsameera": "honestly i think you the best when you have no make on ...you look like a queen❤❤", "sejal0499": "We talked abt this makeup only else ur makeup is goood all the time", "maruf_ahmed_1995": "Blasting beauty .....", "iamprabhatsharma29": "😍😍🔥🔥👏👏 @sejalkumar1195", "reginasoreng": "I think the hair and the make up are going together really well! For such a beautiful hair colour choosing a no make up look will be risky. Loud hair needs loud make up to balance it out. I don't agree with the other comments screaming for a no make up look. Besides you're beautiful and talented no matter what style you choose to slay at whatever point of time. Love you loads Sejal💕", "paridhikariwala": "Hair is okay but please don't paint yourself. You look beautiful naturally.. it's your simplicity and casualness that attracts all of us..elseway you rock @sejalkumar1195", "reflorated._": "You look awesome 🔥", "ms._sana": "Makeup made you look mature and totally erased the child like merry features of yours!Appreciate the work of the makeup artist but girl this is \"So not you\" ....😬❤", "sethideeya": "Kajal is a noo noo for sejalll!!!!", "shahanwaz.khan.96995": "Mast", "mayur_dc": "Gorgeous @sejalkumar1195", "thesarcalect": "Damn girl!!! THIS IS SO YOU🔥🔥🔥🔥🔥🔥", "zjeddie": "You look good with or without makeup. Your black hair is very beautiful & this new hair is pretty. 💕", "ayessamohapatra": "Gorgeous! 😍❤️", "tamanna__aghi": "I loved your hair.", "bhawna1bhardwaj": "Yes u look more beautiful cool smart fashionable in ur recent pictures bcoz of this hair color", "gr8bhuvan": "Not good. Seriously.", "palletesandpaint": "I think I loveee when you wear makeup! It's a personal choice and you're slayyyyingg omgahhhh @sejalkumar1195 💕💕💕", "aratrika_megha": "Won't be going eww, but unfortunately this looks very artificial overall. Your natural look brings out the simplicity and beauty in you.", "jhanavi_gupta": "You are looking so hot sejal!! Just love this look of yours.❤❤❤", "sakshiagarwal213": "I swear you look like a whole new person. The hair and makeup is goalsssss and the outfit too hehe. Slaying like a kweeen. 🔥", "bhumika_dama": "Oh god u look so different and beautiful😘😍😍😍🔥🔥", "aakanksha_choudhari": "Such a Beauty", "snehaholics5555": "This is not hate towards you.. But you look more nice in brown color lipstick and neutral kind of peach undertone make-up. You are very pretty.. I love your confidence... Please don't think I am hating on you... It's just constructive criticism... As a loyal fan I would love to be real with you that's it.. If my words I have hurted you I am sorry...", "_komallll": "😍😍😍", "the.darkest.secret": "@aanchalmadan30 see ♥️", "nandni1245": "Kitna ganda hai didi it doesn’t suits u yarrrr", "indrani_______": "Don't take this comment in negative way ..But you look gorgeous with out makeup ..without makeup is best for you dear ..natural beauty ❤️❤️😍", "muskaanbhanot": "New change beautiful change 😍😘", "musicians_hub18": "@sejalkumar1195 😍😍😍👌", "aartikatariaa": "So pretty 😍😍❤️❤️", "anuj_a_j": "Please dont expose yourself yaar", "introvertinmumbai": "Love the hair! 😍 Also, you look amazing. ❤️ It's just the lighting that's flawed, you look fabulous in all the other pics with this makeup on 😊", "aby___speaks__": "This looks dumb🧐", "i_m_sakshigupta": "Ewww not at all , u r looking fabulous❤️❤️", "finding_namu": "👎", "d33p4nkar": "Aunty lag rahi h b tu 😑", "sanika.devdikar": "Absolutely disgusts me when people always have something to say, even when not asked. Yes, one is supposed to have an opinion but don’t be mean. Sejal end of the day is a human, if she loves wearing make up.. it’s her choice. And honestly, why can’t we see the brighter things? Why can’t we say, she can carry anything well instead? Because honestly she does. Let them live in peace, and stop being so judgemental. Sejal, you look wonderful :) x", "shubhang5481": "💗💖💝💝😘💓💜💜💜👍✌✌👌👌😇😇😇😇😇", "sullyjoshua": "Ewww toomuch makeup. She obviously trying to distract us from her hair by using cleavage", "fathimath_ul_zuhra": "Hair u slay! Makeup is a nay 🙌", "s.h.r.e.y.a.d.u.b.e.y": "Here nothing's eww,you look absolutely stunning!!!", "_abeysaley_": "You look sassy", "dhanuja_12": "You u more beautiful without makeup.....", "ssharmaxxvii": "Me too ...loved ur new hair colour..", "baniya_bahu_travels": "Amazing 💕💕", "_thestylehelm_9": "Oh..beauty..", "reemakerkettaa": "😍 u r looking so gorgeous and beautiful", "bhxnvi_": "You Looking Like Priyanka Chopra😍", "softysaini": "You look beautiful. You should totally rock this look.", "elakya82": "Changed yr look ahh🤘🤘", "iamantora": "Say no to Makeup", "kingkhan7791": "Nice", "__yash24": "@sejalkumar1195 but di ap bina makeup pic dekh lo ap ka natural beauty is your best plus point !! Baki apki m-a-r-a-z-i", "ahsan_zulfiqar1": "Ye pic achi he apki💋♥️🔥🔥 @sejalkumar1195", "prosankhla": "U look ajeeb", "_ms_whinesalot_": "You do you girl ❤️", "tithijainn": "whoever did your makeup needs to be fired", "__ibamelari__": "This much beauty is inhuman 😭😭😭🔥🔥🔥", "a.little.funny.flower": "With this hair color you had sudden transformation from being cute to being sexy🔥🔥", "biwitching.13": "U look far better without makeup.", "inkwellofaisha": "@krutinakum she knows.", "saman_khan12": "You look super and truly you and thats what everyone should be 💛 Instead of composing alphabets into something hateful and not even worthy to read please re-arrange them into some warmth and love 🌸", "zarayin.bastawala_": "😍😍", "senguptadipshikha": "You look great!!!😙😙", "deepashri_13": "You are looking so cute 😘❤️😍", "tarun097": "Ewww", "bipasanamutsuddi": "WEWW makeup is so you sejalll❤️", "somdattade": "Hot🔥", "bluee_cookiee": "Omfg. My reaction was \"ewww why\" and then saw the frst line of ur caption and wow u totally can read our mind😂😂 but srsly u luk wayy prettier and cuter with the makeup ❤️", "haniya_faisal_07": "Soo mature luk", "janvi.balwani": "Can’t wait to see you at the fanfest babe ❤️@sejalkumar1195 passes de dena bass mng ke 😭🔥", "_.samanviii._": "U used to Luk better with ua natural hairs!!", "mehulrachel": "Haters gonna Hate! You look awesome girl!♥️", "iteemehrotra": "It happens with me too. Don't go for Kajal or use a brown eyeshadow very lightly if you want", "surajpuri100": ",😘😍", "nutanpal14": "Qqqpa_", "fromgazorpazorp": "I really miss your shiny black hair. It was waaaay better.", "sherryfernandes72": "Gorgeous ♥️", "only_k_": "🔥🔥🔥😍🖤", "alertbuddy": "Beautiful ❤️😍", "mukeshsankhla27": "Superb", "ll___jiya___ll": "Uh!!!😍🔥🔥", "__zebs": "Inspiration💯", "rahulsharma_1460": "🔥🔥🔥🔥", "o.so.pretty_bypoojashah": "How gorgeous!", "shrutikyrietoo": "😍😍😍", "shshroo11": "ewww sejal makeup is not you 😂", "i_sundus_k": "You look AMAZING.😭❤️🔥", "tirthaa_trivedi": "No dear.. you’re looking GORGEOUS!!❤️❤️❤️", "stylesavitri": "Aah! Such a glamorous look 👌", "kukuyoko_1610": "Neh you look pretty gurrll", "iipranshu_ii": "Glow uppppp👏🏼", "anouskapanda": "Pure love ♥️", "soniasue2": "I love your hairstyle but not makeup", "_juhika": "Ur makeup is making u look lyk mr bean", "hitikaamadaan": "you look absolutely stunninggggg🔥", "versatilegirl_damini": "New hair😍😍😍😍", "missjuhimahajan": "@sejalkumar1195 makeup really doesn't suit you.. you're beautiful the way u are! Natural beauty!", "jinal_shah14": "U look gorgeous widout makeup ! ❤️", "positivity_and_chocolates_": "I don't like this style of yours pls change back .....", "tanishaadutta": "So pretttyyyyy😍🔥", "mehtav10": "You look so different...but so freaking gorgeous!!😍😍😍", "simrnkaur1": "you are getting awesome with captions!! major goals", "dikshya31": "You are gorgeous anyway 😘", "jsswarupa1": "I think u look better without gorgeous makeup 😍💖", "vidishamohare": "Black hair was gorgeous 😭", "stuart_little_333": "Makeup or no makeup ... Sejal di is forever love 😘 ... I am a sejalite and will always be no matter if her beauty fades away as well ❤️", "psarker22": "Aap bina makeup ke bohut cute or innocent lagte hai!", "nagma_kasmi07": "You look fab!😍", "j_fashion416": "After I saw ur hair colour video sejal.... I got inspired and got the balayage on my hair too", "alleey_aaqua": "Streak color used ? Hair is on point ! 💜", "agarwalnikkita": "Hey u look sexy😘", "bbespoke_official": "Absolutely loved this. So mordern and refreshing. Check us out for more such statement pieces and get it tailored to your size perfectly at very reasonable rates.Any design, any quantity, best quality assured. Be your own designer. Be bespoke.", "fiaa_ritzz": "❤️❤️❤️❤️❤️", "honey_.26": "Sometimes u need to hv a change in your style 😉", "garimashares": "Hello Gorgeous😍 @sejalkumar1195", "bless_you_beach": "Haters gonna hate,players gonna play and you are gonna slay", "abigail_neethi": "Sejal please do a video on how to style kohlapuris with indo western wear @sejalkumar1195 ....pleaseee Sejal", "keerthi_0709": "@sejalkumar1195 without makeup you look beautiful ❤️❤️❤️❤️", "nishat_valentinetti": "Hair like charlie Brown😁", "isheeta_yadav": "You look beautiful! With or without makeup!", "sakshisinghchaudhaary": "❤️", "joyasrivastava": "😍😍", "anishaa__bhatia": "Whatever people say... You will always be my inspiration ❤❤😍🔥", "fairytale_ending_7": "Wowowowowowowow", "jyotsana3wari": "Still... Ewwww sejal 😂😂😂", "theshashankgoyal": "Tabahi macha diya", "crshinframes": "Ohh Gawwd!💓", "kaur_bhamra": "Oh fuckkk !!! 💟💟💟💟💟💟💟", "priyanka_khare09": "Fav 🔥", "chaoticdeuce": "You look fab!! Less makeup more beautiful you 💚💚💚", "arissagomessss": "OMG", "suchi.maity": "Don't get this makeup done anymore", "soniya_rathore21": "Which lip shade u wearing ? I mean brand n name .. it’s amazing looking on u😘👍", "naina_jora": "Ahhhhh.. you dont need makeup...", "s__brindaa": "u look amazing and very mature indeed but to be honest I like the old style..not talking about the hair but the makeup", "ritusmita_gogoi_": "You look better without makeup, girl! 😅", "_angel_talks": "You look amazing Sejal. As always!", "tavviisshhii": "Not eww, actually mein you look really pretty 😍💖", "falguni_deswal": "Loving the look, loving the new hair.. U look stunning🔥❤️", "rogerfernandes25": "Can't recognize u", "navni20": "WHATA BEAUTYYYYYYYYY😍😍😍😍😍😍😍😍😍😍", "nii.sha7": "You do you girl 🙏🏼😍", "jiya_pahade": "Beautiful ❤❤😁", "samruddhi._k": "You look soo cute 😍", "kshma.singh21": "❤️❤️❤️", "lahoremirrormagazine": "✌", "deadinsidexx00": "You slay🔥", "anushkachauhan180": "❤️❤️❤️❤️❤️ beautiful😍😍", "adistaagram": "Beut 💕", "saya_2810": "The link is about outfit from scratch", "thispersongetstheweirdestname": "Lovin the hair and makeup ❤️❤️", "ibru_ibrahim_": "💙💙💙💙💖💖💖💚💚💚💚💜💜💜💜💜💖💖💖💖💙💙💙💙💙❤️💛💛💚💚💜💖💜💜💜💚💚💛💛💛💛💛❤️❤️❤️❤️❤️❤️💛💛💛💜", "yashveer131": "🔥🔥🔥", "sanikaa2101": "💝💝💝💝", "himadri.official": "Prettyyyy ❤", "raja_bilal23": "👉💞FOLLOW ME💟👈"}