{"missnotsobeautiful_": "U and u only u😍😍😍😍😍😍💛💛💛💛💛💛😻😻😻😻😻😻😻😻🔥🔥🔥🔥🔥", "its_ps_4_u_": "What is the most stupidest and craziest thing you have ever done ?? Lots of love from chennai❤️ keep ❤️❤️❤️ inspiring teenagers like me love you joyyy", "blog.rohi": "🔥🔥", "poonamsnutshell": "How can someone grow as an instagram influencer and start earning and connect with people", "s.kangkana": "Your favorite holiday destination?....plz", "avani__maheshwari": "Didnt you want to be a gynaec, as your mother? Didnt they ever pressurize you? Also you're biggest inspiration, love love❤️😍", "palakbansal946": "How do you get people to subscribe at the starting of ur channel... Bcoz I have asked people 3 times n they still haven't subscribed @sejalkumar1195", "shreya_prashansa": "Do you updated your wardrobe every week?....just curious...😅😁", "gursharn.18": "How long did it take from 0 subscribers to 100 subs and then to 1000 and 10k in your initial days? How was the journey?", "shagun.jpeg": "How good wre you at recognizing your fans?", "riya.6891": "Dude it is not that I hate you but @sejalkumar1195 you sing hillarious literally pls don't sing but keep vloging on YouTube but don't sing and you dance well but you ruin my fav song Havana..do try the things in which you are best you are not a good singer so what you are a youtuber and a good dancer do the things in which you are comfortable not just ki bhai alia and shraddha gaati ha toh mujhe bhi gana hai.. gaana toh sab gate hai koi alia Bhatt jesa gata hai toh koi Shreya ghoshal jesa....😁😁😁😁😁😁", "saee_akalwar": "U live in Delhi n u wear all types of cloth (with all due respect). Have u ever been eve teased because of the clothes the you wear.", "samusamidha": "Is YouTube good career for a 10 year old girl", "arundhati__dubey": "How to do superb editing like you?! I am a student didi,how to manage wid studies", "tanyashetty59": "Hey love...i mean hey sejal...u r one of the cutest and polite youtuber...can u shoot a video without any make-up and plz do q and a like @mostlysane....plz take my name\"Manasvi\"...Do shoot the video....Love you", "tanishaaaprabhu": "There is a common assumption that YouTubing is a very time-wise flexible career, and YouTubers have a lot of free time compared to people on other fields . Since viewers have seen your busy days and know this is not true, what do you think about this assumption??", "_.h_op_e": "How to change from a Tom boyish style to a girlish style? Everything I wear(maxi dresses, one piece, heels,jewelry) everything looks too girlish and I really want to change", "shivanithakur81306": "Why don't you collab with somebody soon??", "paavnikapoor": "Where do you stay ?", "riyanogia": "@3380jyoti she’s a slayer", "aditiiirajput": "My favorite", "rashikashish": "Hey cutieee❤️❤️❤️", "atharva_arr": "Love your videos mam", "iamaphotofreak": "Whats your favourite brand?", "sakshistical": "I want to start blogging via insta/YouTube but idk how to begin. Will you give some suggestions or advices. I have content with me and ideas to but don’t know how to implement them moreover i want to ask that I am a fashion student, do I need to do internship before start blogging to experience stuff? Really curious if you can help.", "aadarsh_30": "Your performance was lit 🔥 keep it up❤️", "bugata_bunny": "@ur_foto_not_good_bt_i_still", "farheen8280": "1.ur fav travel time place? 2.ur inspiration", "deepsehgal_": "Do you really wish to go for acting under different YouTube Production house's like @thetimeliners @tvfqtiyapa etc. @sejalkumar1195 #qna", "thevintedgeblogs": "What tips would you give to grow the channel and blog site, also what mic do you use", "meghnachandra": "Hey Sejal! Can you please do a video on how you edit videos on your MacBook, what tools you use and how can a MacBook be put to best use. It's going to be a different genre altogether as you haven't done any video on technology yet. Also, it goes without saying it's going to be super useful and will definitely become the most watched one because there are so many followers out there who would want to learn from you and your immaculate editing skills 😁", "swati_joshi8079": "What are the pros and cons abt the industry in which you are in", "yashikagurung": "Love thisssss picture ❤️💣", "iamtanyasaha": "I just started a video pls givd me some tips and also tell e which editing software u use", "soniasue2": "I'm your big big fan @sejalkumar1195 please give me 1% of your fashion sense I'll be happy if you give some hacks ❤❤❤", "mostlysanepage": "Hi di I hope you are done so I wanted to ask if I want to become a youtuber and doctor how will I manage", "skrishnaveninaidu": "Can there be a meet and greet in bangalore someday soon", "anvitha_reddy65": "Are you a potterhead???????????????????", "paluckbhandari_108": "Does your career ever clash with it daily lives if so how do you deal with it ?", "pracheesodani": "Is it too late to start fashion blogging on YT??????????", "shreyab1602": "Your skin is really good what do u do for clear skin plz nswer my question lots of love frm me😘❤️", "sejal0499": "Omg omg omg loook at youuuuuuu 🤩💕💕💕💕💕", "ichamati__": "How did you manage to motivate yourself when you were just starting with yt and did not have that much following", "kashvi_nijhawan": "what are the clothing essentials for a highschooler?lots of love❤️❤️❤️", "prapty.das": "Not a question..... Just leave a message for your fans!! ❤️❤️..... LOVE YOU @sejalkumar1195", "shreyyyyaa": "Do you wish to live independently?", "umangi_shah_14": "How do you do your all the editing stuffs?? Can you just suggest some sort of ideas about editing??", "dwaynetherock_fc": "Hello sejal😊😊 I wanted to ask that can we grow our social media handles(instagram page and youtube channel) without paid promotions....or it is a must to add money to our instagram posts and proMote insta stories.... Please pick my question as a lot of budding youtubers and bloggers have this issue😊😊😊😊", "pahal.162": "Hii sejalll !!! I need know who's ur inspiration and why only that person..", "ohnonadia": "What it's like to be famous? How do you make friends in the industry?", "shalini_dutta25": "Were you always this stylish since your childhood?? How did u manage your style statement in your school days?? .. with love from bengal.. ❤️", "aaru_.103": "Say something in sindhi", "rushita_shrestha": "How did your passion grow for singing?", "sahana.sathish": "Who is ur fashion inspiration?", "_your_dad99": "Who is your favorite Youtuber ??", "ii_uma_ii": "What are your insecurities?", "tanvi.9_": "How to do layering of casual clothes? Can you give quick simple tips?", "jahnavijareda": "❤️❤️How do you and your parents feel when you look at fellow people of your age doing those 9 to 5 jobs...and you are performing at ytff...pleseeee answer❤️❤️❤️❤️❤️", "priyanshithakkar__": "U r my inspiration u grown up with Ur efforts nd I also wanna start a YouTube channel but I am nervous please give an advice how u grown up", "devanshipisagar": "Hi .... what's the wierdest thing u do when u r alone..??", "million_dollar_gurl._": "How you write your YouTube video script plz tell us because I also wanted to be A famous youTube @sejalkumar1195", "always_dsouza": "What is ur hair care routine??? And how do you relieve ur stress after such a long day after shooting etc????", "sonal_awatani": "How do you Feel know you are on this stage of YouTube", "diaryofanaveragegirl14": "When did u first get ur paycheck ?? At how many likes and subscribe??", "himanshimhapsekar": "pretty😍", "baghel_mahi1703": "Can anybody be a fashion blogger ....kyuki I want to be ...and sometimes I feel there are better people than me out there and I feel like maybe its not my type....kyuki ajj kal had dusra banda bolta hai I wanna start fashion blogging", "aanya_aggarwal": "@sejalkumar1195 How do you deal with procrastination ?", "yogeesha98": "I wanna be an influencer and promoter Idk how to build my profile according to it, I would love to hear out some suggestions 😍", "pahalbhojwani": "How long it took for you to get satisfactory number of followers? How long it took for 10k followers ?", "byoshi_15": "1st of all congratulations for 1M subscribers!!!!! Yeah!!!!!!💜💜.. So my question to u is how do u wear all type of clothes in a country like ours where everyone is judgmental about it...... I know i am late in posting my question but please doo answer this question if not in the video atleast in the comment section.... please....❤❤@sejalkumar1195 🧡🧡🧡", "doniya35._": "Wt is Ur fav thing ABT Ur channel", "nidhiful": "Hi Sejal! I you are just fantastic! How do you handle stress and anxiety?", "faminam_contour_07": "Hello sejal di...i want to be a fashion blogger..can you please share some tips to begin....i lack of motivation bcoz no one supports my youtube blogger career....plzz reply.....love you dii...and all the best for your future project.....you are rocking 😍😍😍😙😙😙", "angeleena.martin": "How was your first coloring experience ?", "grishma.ranee": "Do you really love what you're doing or you still have backup plans? Like after a certain age maybe YouTube won't be as trending as now what are your plans for sucha situation?", "sheelconey": "It's not really a question, but I'm really very happy seeing someone so happy and positive about their own skin I look at other YouTubers and there is always this back thought that you need to look a certain way before everyone sees you. And you have completely changed that thought for me the kind of positivity you have shown and shared is just amazing. Always be the way you are. Love everything about you but I just wanted to put this point. Love ya 💥🥰", "sarah_samrin": "What did u where on the event.....n wat was the theme for the ytff💕💕", "design_your_nails_by_isha": "Next trip ? 😍", "sakshishah031": "How do you manage time for your friends and family in your busy schedule", "___.cutielicious.___": "From where did you shop your polaroid camera n how much it cost ??", "shivalkar_ruchika": "Which is your favorite Indian YouTube music channel since you sing so well 🤗🤗😄😀", "desire.7_": "How to grow on Instagram and YouTube? The organic way!💕", "nishitalakshman2004": "I am a new Instagram user so do you have any tips????????? Please pick my question", "_arshiyaaa.a_": "12th tak were you like a very studious and hardworking student ya ho jaata tha?", "mistyadav": "Why don't you do a meet and greet!!!????", "_ankitabhardwaj": "Your clothing line is done.what next?", "jindal.shreya08": "Which editing apps do you use for thumbnails, video editing or the intros. I really love the editing plus you look cool.😊😊", "aditi141414": "What extraa things you do to enhance your performance as an influencer?Any classes, workshops etc?", "xx.ssimran.xx": "I AM THINKING OF STARTING MY YOUTUBE CHANNEL BUT I AM CONFUSED KI HOGA MUJHSE YA NI SO PLEASE IF YOU’RE SEEING THIS GIVE ME SOME ADVICE", "harshita.saratkarr": "I want to make videos about a lot of things just the way you do, but a lot of Youtuber's day that \"Find your particular Niche\" What should I do?", "bhavnagawala": "SSC is hard ?", "navyanarayanan_": "You ever regret being popular due to any incident?!", "mostlysane_am": "Why is making branded content videos in India such underrated ?? Plz answer 😊 love u di loads ❤", "harshitha_reddy09": "😍", "muskaansinha": "So you're learning western music or indian music? Which form of music arw you learning? Being a singer this thing attracted me the most.", "renjjjj__": "Who has been ur role model Favourite English singers artists albums etc", "swiftee__13": "Did ur relatives questioned ur career optiom at first?? @sejalkumar1195 😍", "vedanti_3010": "How do you get back from a bad day when like a video which didn't do so well", "the_class_of_styling": "Hi sejal you are true inspiration of hard work and achievement for youngsters now a days , your videos motivated me a lot thank you soo much for your motivation , I wish we will collab soon , it will be like dream come true to collab with u , pls make more videos collab with viewer's kind of, tons of love . 💓💓💓💓💓💓", "priti_puri123": "What do you do for ur skin on a daily basis ?? Something basic that every one can do", "suhana0111": "When was the first time you actually felt a little sense of achievement ❤️", "baishali938": "Ghar main golden button ki party ho gyi Kya😅😅😁😁", "jass_kaur_311": "What’s your height?", "janhavi_mishraa": "Hii...Sejal 🙋...may be I must the last one to comment 🤦... actually...Sorry I am having no questions🤷 ...just wanna say that ....me and a friend of mine luv u a lot....u r really amazing... you and your video always makes us happy and inspired..👈👨‍👩‍👦‍👦. The one think I hv always find in your videos that \"be the real you ... don't compete with others but compete with yourself and be the better version of yourself only\".... thanks for making such video and making us inspired and happy....we luv u Sejal...💕", "pamuli.98": "@sejalkumar1195 Your ytff outfit from?? Btw it's wow😍", "dart_to_art": "How do you deal with the situation when you don't achieve something that you wished you deserved it?", "gunn_1827": "How you deal with the society out there?", "mathursms054": "How did you got the airtel ad", "girly_qoutes_____15": "Is committed is great or singles life is great", "pegacornpri": "Noticed lots of YouTubers are using Hindi lately.... Would like an open response if you don't mind- is yt favouring hindi titles/language because of the ~jio boom~ or you just feel like it", "kohlkarmakar": "When u started youtube, did you care about maintaining a niche or you just kept doing what you're good at? PS. I love you!😍", "mystical_blossoms13": "Hey... congrats for the golden button.... actually I don't have any questions.... I just wanna say that u are my inspiration❣️ love you and ur contents😘would love to meet you someday❣️❣️ btw aunty looks really beautiful in all of ur video (ur mom)❣️loveeeeee u sejal di❤️❤️ @sejalkumar1195", "prani_purvi": "Can u upload how I shoot my video plzz because your videos are very catchy and attractive and even I want to open a YouTube channel and i would be very happy to to get few tips from you as ur the best youtuber I know , tq and love u 😊😚", "jiteshravariya": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "sarisha9__": "And do you take internship for students of high school ? During summer breaks", "saha_2519": "How to get ride and stop pimple I am normal teenager but I be lots of pimple compared to my other classmate pls help me out cuttey pie💕", "littlemissdazzy": "Do you source dresses from newly launched fashion brands?", "teenwith_asmile": "Which camera should i use for blogging???", "soumyaslays": "Are you a sindhi?", "shat_akshi.s": "From where've you got this outfit sejal 😍?", "beyond_ur_thoughts_19": "Tell us about your top 3 favourite memories of school life. And when will you come to kolkata for a meet & greet? Please make a video on your lipstick collection. Would love to meet you😄 I'm your great admirer.. I love your videos❤️ keep on making such great content😄", "hanushita": "Has any of the bucket list items been done in your life till date? ❤️", "sushilsingh4053": "What are the Indian youtubers you love?", "_.sourina._": "Ohh gurl !! 😍 STUNNER 😉 @sejalkumar1195", "with.pranita": "How long did it take for you to actually start making money through vid'z on YT??? ♥️✈⚓", "amirtha_pooja": "What is that one dream country that you'd love to visit or have already visited?", "sachin.rane.1272": "How did you decide that you will choose blogging?", "psethz": "@sejalkumar1195 Everyone has few phases of feeling low, How things boost you up in those times?How do you manage to be so charismatic always?", "ashtamii_naidu": "How do you manage to look so glamorous and fresh everyday? Any tips? 💜", "theteenslifestyle": "I am stuck at my Instagram please tell me what should I do😐😭!! Also how can I know what people want to see on YouTube, people don’t respond if asked what they wanna see!😑", "harini_love_chocolate": "If you could wish anything or do anything , what would it be .", "sanyanlalwani": "Why did u decide to become a youtuber ??(ps: love youu💕💕)", "_.shxonx._": "How do you feel that you have changed soooo much as a person after starting your own Youtube", "khushi_2607": "What change do you feel in yourself after hitting one million subscribers ?", "ishaaa02": "How do you deal with friendship breakups?", "_angela_seq_": "How are you so confident? @sejalkumar1195", "theblushbox": "♥️🙏🏻", "lovh_saraah": "Hey sejal.... I just want to ask u tat.. Wat is the difference between your earlier and now shooting in public ... Hav u experienced something special 🤔🙂", "zainab_fatima.faisal": "How to mange the ajeeb dm's", "writersajidiqbal": "How can I send you my modern poetry book? It's called 'blooming in the snow'☺️", "priyakshi29": "Hey Sejal, what is the model of Ukulele that you play?", "shrutiandstyle": "CUTEST", "meth_firebred": "Have you ever tried PUBG Mobile? It's the most famous game out there. What are your views on it?", "thatissiri": "Do u think still now people can succeed on YouTube with the change in algorithm and all?", "harshitha_r_naik": "How do take time for yourself between all the editing shooting n all the events u hv to go to... N if u do take time wt do u do in ur free time @sejalkumar1195", "amanrawaatt": "Tell us your journey ?", "plingpriya": "What is your favorite thing about Kerala??? About there culture, fashion etc...BTW...when will u come here...I would love to meet you di..!!", "ihardikabatra02": "Any bff🔥💖", "dchugh312": "How did you convince your parents that you wanted to do youtube full time ???", "sakshimehta104": "You r Petite 💝💝💝. Love you Mam Please see my msg in your inbox request... I have a lot of calibre mam. Please❤️", "_nandini_x": "Where did u get your kenken bag..cause I have been searching for that bag EVERYWHERE.. also ..a lot of people say thag u can by mistakenly buy a fake one without realizing and I don't want to do that as the bag is kinda pricey.....btw I saw the bag in ur previous post ...and love u loads from sharjah", "hiral_nagori": "Since when did you plan to get into blogging, being a 97%er you could do so much more? Usually people don’t chose this career after getting such great marks? I’d love to hear about this!", "_nihlanizar_": "How long have been an army (BTS army) ? and who is ur bias ??", "rimjhim.maitra": "Hiii!!What is the falsehood you have said in one of your videos?? Love you sejal Di ❤️❤️❤️", "therealjohnkalage": "Plz follow @kalage_jr 🔥🔥", "kritika8760": "Do still get cliche questions from relatives like \"Beta youtube toh thik hai by profession kya karti ho ?\"😂😂😂", "___jinalpatel____": "What made u wear this outfit???", "sounbeniwal": "❤️❤️❤️❤️❤️so sweet", "idyllic_ayush": "😍😍😍", "wings_of_endearment": "What do you think about South Korea?? Have you watched any kdrama or Korean movie...have you listened to boy with luv.?? It's really good ...I hope you touch the sky one day sejal ....I wish you the very best for the future ....", "anandi_6107": "Okay i know I'm not supposed to be asking this out but still what was the reason you broke up with Mohak? Everytime when i go on watching your old videos again i feel him being so supportive and like you too were totally couple goals...okay whatever just tryna answer to my question many might be eager!!", "aaannnniii16_": "Your YouTube earnings @sejalkumar1195 plz", "mukund_pareek15": "Y was ytff not streamed on youTube", "_.manviiiiiiiiii._": "Does it feels like a celebrity after a million subscribers on youtube...?", "quarantinedsami": "How did u overcome the fear of ppl. Looking at u while vlogging?🤔", "bidishagoswamii": "Absolutely love what you are wearing 💛💛", "jhalak030405": "How r u ???? @sejalkumar1195", "haarikareddy_31": "Wat do u choose luv marriage or arrange marriage?😁", "madhu_avoola": "What if YouTube vanishes suddenly from the internet? What would you do? And ily @sejalkumar1195 ❤️", "_ananya__patel": "Give us some brief idea about designer costumes with price range", "isha.08_": "How do you stay consistent? Is there anything behind that?", "mugdha_.01": "do plzzzzz take my question plzz; Q.did ypur brother trolled you when ypu started making video on youtube & di please inform me when u will go to sarogni for shopping i will come to meet u plzzz & love love ❤ u r an inspiration❤❤", "littleblackbook.lbb": "How do you face the creative block?what are the things that kind of inspire you to continue because it might be possible that you get exhausted ?", "anordinarygirl__": "How to make up a good content in order to create a new youtube channel?@sejalkumar1195", "pr33t.i": "Which video editing app/software do you use? Your edits are crazy!", "_nehalbhardwaj": "Every body has haters and I am sure you do too, so how do you deal with them and continue to do what you do?", "upasnagambhir": "Which application do you use in mac to edit your vlogs?", "aabhathakar": "Can you pls do a meet and greet in New York City? Love ur videos and fashion!!", "shrutiii_iii": "Favourite books?", "pragati_seth_6": "How do you reach out to the brand for sponsoring u? Love u", "ektanirwan11": "Who inspired u the most???", "shalushalu399": "Hi....did you have any plan to visit kerala", "trivedi.mauli": "What new kind of videos you want to try out in future @sejalkumar1195", "kajal.x_x": "Can we meet 😁", "_devyani_rk_chavan_": "💞", "_eshitaa_08": "What do u use in ur lips in summer", "aditi__singh____": "Why are u sooo down to earth ? I love you di❤😘", "heaven._04": "What are your feelings when u have to speak at an event or at a panal?", "nidachauhan": "Do you ever feel camera conscious... How do you get over it?", "deathly_girl_776": "How did you feel after the fanfest performance???", "_kshitijaaaa_": "What difficulty you face while fashion blogging? Any funny moment related any blogging 😌❤️", "aditti_01": "Have you listened to bts' boy with love? How do you like it?", "the_ekisha1615": "how do you get new ideas ???", "artsychilli": "How do you stay so confident and positive inspite of so much work load like editing, shooting and keeping up with everything? And btw, I wish to meet u some day..! ❤️", "akansha.s1ngh": "Aapko aapna style kaise PTA chala mtlb u know the wardrobe the aesthetic", "___ishhaaaa": "How do u edit ur pics? By which app u edit ur photos?", "harmeet_1308": "How to decide which carrer to persue in future after 12th commerce...?????", "harsimran2191": "What gave uh inspiration to open a YouTube account?", "suhanisingh05": "Were you nervous when you started your youtube channel?", "bhattacharjee_jyoti_": "🔥💗", "beniwal_saab_19": "How did u keep ur self energetic for whole ......What's ur diet ?? I love ur videos 😊😊😊☺☺💐💐💐😊😊😊😊", "advekaa": "I lovee Billie eilish tok btw who's ur fav singer", "_aalizaa": ".. Do youu have any futher plans of not making youtube vedios in future", "that_ambivert__girl": "Also if you could make a video on behind the scenes of making a youtube video.😙", "shreyas_m.19": "From where do u belong ?", "je.suis.skarma": "How can i join AIESEC , DU student here 💜💜", "swarangi.bhosale": "Will U Enter Bollywood Industry?", "a14muskan": "One habbit of urs u wanna change 💙", "anushreebajpai": "Which movies would you binge watch ?❤️", "_sadikot.salma_": "Tell us about the ups and downs which u came across during ur YouTube successful journey..", "chowdhuryarushi": "Is all the dresses you wear costly??or branded?", "prasad_1a": "How did you stay motivated in your early stages on YouTube n also in life?? Love from #1Aspiration 💕💕 @sejalkumar1195", "poonamsamani": "@sejalkumar1195 How do u convince ur parents to let you go out alone anywhere, be it India or Abroad!!!", "ashwaqcheema": "How do you grow your audience at n YouTube and other social media platforms. I’m just starting out and I could really use the advice.", "aakashanand_": "❤❤🙈", "nidhi.thakur.315": "How u manage your expenses as a youtube blogger.... Do you even need to think as money can be a matter of fact in future...? And after how much time you start getting recognition as a youtuber", "mostlyinsane14": "1.)What are some of your Current Fashion Obsession's? . 2.)What are your top 3 Favorite Clothing Brands? . 3.)Which is your favorite Quotes that keeps you Motivated? . Your videos are amazing to watch!!😍 The editing are awesome and unique. 🔥Love you Sejal Di💖 and Love your work as well.😘All The Best for your future 💕and Hope You take my questions!!!🤭💕💕🔥", "being_body_goals": "What’s the toughest part of your job ?", "silver._.shadess14": "If u wouldn't have been a fashion blogger then what had you been.", "stelacristen": "@sejalkumar1195 didi why don't you make a blog on long gowns???? are long gowns are still trending???? need really some inspiration right now and your videos really help me alot❤️ it taught me many variations 😍❤️❤️", "amisha_kaushal": "Next video a haul ?", "wadhwa8375": "Love you sejal", "jhanvi_jaggi": "Daammnnn!! You look freakingg awsome🙈💕", "soniaseth302004": "how do you manage to handle your clothes so perfectly.... i am asking questions from day one but you are not replying.... please replyyyyy and give some tips", "ishcreationz": "Your advice to teenagers who want to open a YouTube channel for fashion?!❤️", "_.khushiii.__": "How do you manage to be so simple yet the best in the YouTube industry? Well lots off loveee!❤️", "_.tanusharma._": "You know we love you right?❤️", "glitermess": "Who is ur inspiration?", "_garvit_saini_": "Will you stay a youtuber for whole life? Or you have planned something other than this? How does it feel to be a fulltime youtuber??? ❤️ @sejalkumar1195 please reply, i am waiting for your answer! Good luck for your rest of the life! ❤️", "__s_i_m_r_a_n__s_a_s_a_n": "World is changing than too many parents don't allow girls to wear short clothes even now and on social media platforms it is not considered to fashionable . Is it true????Ps......Love yr style", "siddiqa_uzma": "The most memorable day of ur life??!?", "anisha_dura_": "What's your hairstylist name during your fanfest look? It is awesome & you look so fabulous❤❤", "herecomes_ayushiii": "Are u a mammas girl or a daddys girls", "_.khushijain__": "How do you manage your relatives talking about your career?", "all_that_i_always_wantedd": "Since you have been collaborating alot of times with antareep, how about you coming out of your comfort zone and tryin sing an Assamese song ?", "ava_twinkletoes": "@sejalkumar1195 pls do a meet and greet in Chennai 😢", "that_happysoul": "How do you manage big designers to give you theere dresd", "pinky_patni": "Do you have any future plans? Like, studying or something. BTW, never stop making videos. I love them💖🌸", "shreyaa.ghosh": "What's the one thing which keeps you going, even on the most difficult days?", "sisteristan0515": "Hey... First of all...lots of love dear.. question-- have you ever thought of getting a job at the position where ur parents are tday???.......lots of love and support to you... keep going and reach greater heights and I will be supporting you till my last day of my life🌈🌈💞💞💞💞💞🌈🌈🌈🌈🌈", "ojjasvipuri": "How has your style evolved throughout your youtube journey? Do you think it has? What difference do you find in your content from when you started and now. I would like to know your opinion about it.", "_quiry_miss_": "How to start fashion blogging if ones parents won't allow them to do😭", "livvi.a": "Who’s your inspiration? How do you keep going?", "bhoomi9761": "Give shout out pleaseee❤️❤️❤️", "neharocx92": "❤️❤️❤️❤️❤️", "__shobithamegha": "which app do u use to edit ur youtube videos ?", "aizafaisal_": "How many years ago that you are on youtube plz answer😍", "anisamaity": "love u sejal ma'am...", "aayushipanwar_": "Any tips for commerce students for 11th class", "the_sloth_chick_": "Do you visit salon for skin care like tan removing, black heads removing and all or do all these stuffs by products at home?", "kaivalya_sanjeev": "U are my inspiration ...now....😘..Ilysm....I wanna be a fashion designer...any tips pleaseeeeeeeeee. ..@sejalkumar1195", "rahul_kerketta": "How to get through a creative block? @sejalkumar1195", "malxvika": "Are u planning for a vacay sometime soon!?", "deepika_durairajou_10": "What do u think is the best job on the world???", "sanjhanahariharan": "Did you ever feel that you aren't good enough, and you can't prove yourself in this highly competitive and ever-growing industry? @sejalkumar1195", "themohakgupta": "Damm that Har style", "heartandsoulpayno": "Hi sejal first of all you make MIS so fuckin proud and second of all What would you like to tell the new upcoming fashion bloggers?", "ssharmaxxvii": "Hmm..", "_ananyaaaaaaaaa_": "How old are you? you're very pretty❤️", "vendel_brains": "Which is the affordable mic to buy for a beginner youtuber?", "sarvveshhh": "what is the hardest thing youve faced in your school life? A lot of teenagers face really big problems today and was hoping you would answer my question . ly and ur videos <3.......also kudos on ur cosmopolitan award!!!!!!!!!", "themistletoeguy": "How was it to perform in front of soo many people at ytff? Love❤", "sakshi_nagdev_2711": "Which is the quote you live by?", "miss_crypto": "How do you arrange designers dresses for such big events??", "deepthi.80": "Your akward breakup story.BTWlove youu😘", "raschandak08": "Which editor do you use ?💕 @sejalkumar1195", "idc_superman": "Can I meet once", "alvin_k.thomas05": "How do you stabilize your mood when its not good but you have to address a fan", "appsarpan": "Don't you ever fear one day if this all YouTube not then what ... , is there any backup??", "nikitasinhahaha": "Are you still friends with Mohak?", "srishtimajumdar17": "Though you are an influencer I really want to know your views about voting , democracy and are you going to cast your vote ????", "yashasvi7878": "Sejal app abhi bhi mohak to miss karte ho ..... ????????? And Kya app fir se relationship me aoo ge mohak ke sath ???", "abigail_neethi": "Why don't you do dailyvlogz anymore @sejalkumar1195", "goswami_dishuu": "This is lit🔥🔥🔥...just beyond words❤❤", "dikshitaaaaaaaa": "Is there any possibilities of you and Mohit getting back together again? @sejalkumar1195", "sakshii_2602": "What is the best and the worst moment that you can recall from childhood till now??", "divyamondkar": "Omg💝", "hatefromjupiter": "Can you give me your Netflix?", "sarasanwal": "@sejalkumar1195 do you ever plan to release some original music after your own fashion line (collab)", "arnaldo2n": "🙌 🎉 🎊", "harini_18_": "Are there times when u felt like giving up? If yes what kept u going and what was the one thing that inspired u? @sejalkumar1195", "ritojaaaa": "Are you in any kind of sports? Would love to know ! @sejalkumar1195 💜 Love you alot!!!", "komal_vyass_": "From where is your outfit??", "writer_by_chance_003": "When u look back , whats the most blissful moment u keep in ur heart regarding the u tube journey .😇", "lalit__sehrawat": "Itne pyare ho ki main ladka hokr aapke vlog dekhta hu.....🤩🤩", "beauty_with_brain_": "What are you planning for future??", "karwa_kanishka": "Dii pls reply asking u since ur last 2 months. Q. I have a combination skin so how to get rid of pimples and acnes.. Loads of love ♥️♥️", "mann__06": "Do you ever plan like going on a trip with a subscriber of your?", "shomreeta": "Hey @sejalkumar1195, so you are one of my biggest inspirations.❤️As I really want to start my own blog, please can I get some blogging tips so that I can do well on it", "kdurbar_": "What is the thing about fashion you love the most?", "manvi.rajput": "Hi di. I've youtube channel on which I sing English songs cover. I saw that you sing as well. Would you like to do a collab with me?", "tanuja_rajawat": "U look so pretty sejal🌸", "smritikasharma": "Whats ur ultimate guilty pleasure", "deepragya143": "#Qna app ettnnii cute kessee ho..😽😽❤️", "_priya_gupta_6": "How to convince someone that u are not the right person for them", "sanvii_bahl": "Hi Sejal di you are an true inspiration my question is how old are you and who is your BFF from the YouTubers and also when are u planning a meet and greet in Bombay and are you in a relationship also where exactly do you live in Delhi and when are you planning to get married and are you into makeup too much", "saachiii_": "What keeps you motivated on your low days to keep going? .....", "hawama__83": "Can you talk more about sponsored/rented clothes?", "rakshyaapanta": "Current obsession?", "abeehahayat": "Your inspiration for being wht you are??", "_dimplegrover_": "Who is your style icon? I just love ur style decent,casual,graceful and simple. You did everything perfect. I dont know about your style icon. But my style icon is you @sejalkumar1195 . You inspires me to try new things.♥️", "let_this_inspire": "What would you do if have magical powers for 5 min?", "s__brindaa": "Who is your favourite Indian youtuber?", "nehavajpayee_": "Sometimes people leave really harsh and bad comments on your pictures like your makeup is not looking good and you are not making efforts like putting any filter on you picture... So Does it affect you or you just ignore them???? N yes I 💜 you a lot .😍", "the_psycherchick": "How to start fashion blogging on Instagram...as in how many pictures I have to keep ready before hand and should I buy clothes in bulk before hand?? How will be the initial struggles???", "__pragya__shukla__": "u r an inspiration...❤❤..I always look up to u whenever I feel low ... Wannabe a successful travel blogger ...How to make this come true", "kg9908261": "Who would you like to collaboration video with alia or deepika padukone??????😂😊🙌", "amreen_malic": "How do you deal with period cramps", "fashionbydrpriya": "💚💚💚", "ta.ba.ss.um_": "Asksejal: how do you keep your height maintained❣️", "its_nyoshika": "Does YouTube feel like a stress to u that oh no the next week is about to cum have to think of new content shoot it and then edit it is chilled out", "_tanvi._jain": "Did @mohakpapola congratulate you for your 1 millions subscriber ?", "sneha.prakash_": "How to motivate myself after a failure???", "cringyy__": "I'm 10000% sure u will never dm me", "amoghkumbarr": "Whats your YouTube time watched??", "httiwari1495": "How to feel motivated on low days and how to focus on your studies and stay away from distraction", "vai_suh": "Can u please do much more videos with ur mom and do a video regarding college outfits for chubby girls...plzz @sejalkumar1195", "_mayansi_drew_": "How do you keep your closet organized with so many clothes??? Mine's a mess 😂", "geeta0822": "From where do get the songs for your videos ? Which site. Please answer 😍 @sejalkumar1195", "__shravzzz__": "Arrange a fanfest in B'lore maybe??", "twisha_tanvi": "@sejalkumar1195 How to be confident and bold in life ??? Love you 💝💝", "plk__plk": "When are you visiting Punjab for a meet-n-greet 😭♥️ @sejalkumar1195", "shrdha.19": "Can u tell us how you plan your travel goals?", "_maggieee____": "Will u do a meet n greet...😍", "vedaa.__": "Why don't you try and collaborate with anybody from the Bollywood diva industry, maybe like Shibani Dandrkat or other actresses?", "deekshhha_": "Why don’t you do the dress up challenges (like I dressed like Deepika Padukone for a week or something)?? Please do it onceeee❤️❤️❤️", "theyaniquote": "Hey ❤️Sejal, been watching your videos for a long time and it helped (still do) to learn a lot about fashion and clothing . So, my question is that how to strike a balance between trend and your own style and comfort and look confident enough to be called beautiful. So much love to your way 😘😘", "tanuvasthi_8905": "Hi Sejal. My question is , As a youtuber what are the pros and cons you face ? What is your responsibility as a youtuber??", "rosella66.__": "Will you and mohak come back together?? @sejalkumar1195", "theignorantteen": "Do you learn classical music or bollywood ?", "raadhikadugar": "Hi sejal di just wanna ask What do you to cheer yourself up during meltdowns? Love ya! 😘", "sakshiiisinghh": "Have you checked your fathers gallery", "_divyyaa._": "Outfit 😍❤️", "niloufer_fatima_": "Describe ur self in one word A HINDI WORD", "badasss_babua": "Any plans for further study for fashion? @sejalkumar1195", "_salma26_": "This is not a YouTube nor a fashion question tho but please answer share some off your childhood memories plzzzzz", "anushree334": "How do you grow you'r instagram followers", "pragyaagaur": "Is there something you are looking forward to apart from YouTube these days?", "tanviism": "Ma'am r u going to try for acting in movie for bollywood, you must try!!!💛", "tinkysapra": "Hey sejal! Plzz update your experience with stalk buy love.. how's it going on dude❤️?", "ruchikalahoti_07": "Hi ❤How did you start investing on your projects??..I mean I run a blog being a 17y/o and really need to know the investment technique😁", "himanshikhaneja": "Who motivates uh every tym whn uh feel low nd how do you deal with it whn uh have big event lined up? @sejalkumar1195", "keerthvin_": "R u working on some new projects???@sejalkumar1195", "kritiaroraofficial": "What do you wanna say about the distractions one suffers in high school?", "pranavi_04": "How to dress up for a small reunion", "__.navjot__": "Hey Sejal Di .. My question is have u learnt singing or dancing for anywhere or is it ur born talent??? #asksejal", "sampada.vaidya": "Where/How did you learn editing your videos...", "pondadisha": "How do you manage to look trendy and cute in all the outfits you wear ???", "obliviox_ladki": "When are you planning to do the next web series btw I met you at Sharda University😘", "kanan.14": "Who was ur inspiration for starting a yt channel??", "shristhiii": "How difficult was it for you to get into SRCC?", "___shivaa.__": "What's your biggest dream??? (just curious)", "yashasvi_surana": "Does breakup made you more stronger ❤️❤️", "yashamotiyani": "Heyy Sejal! I love you and your videos. My question is that how did you deal with mean girls in your teenage? Help me out!", "avilasha_hazarika": "What is your exercise routine like ?", "trina.dasguptaa": "What is that one thing you would like to change about yourself that you think will make your lifestyle better? 🌸", "vrindaone_": "How did you felt when you got to know that 1st time you're gonna perform in youtube fanfest.", "vaama.bakshi": "How to you know that what type of content we guyswant to see??? love that you know what your viewers want to see !!!!❤️❤️❤️❤️❤️much love to u diii ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "swara_kalantre": "You are one of the most struggling youtubers I have seen .. you have struggled so much for your work and videos ... How was the moment when you hit 1 Milion ?? ... What was your parents response ?? And what all difficulties have you faced that you haven't yet told your audience ?? ♥️♥️ .... Lots of love ♥️ @sejalkumar1195", "andria.x._": "Anything special u would like to reveal or about u to us...btw ..wt happened to mohak", "chandani_anjali": "What made you choose YouTube as your career ........and do you think it is stable enough to be choosed as a career option ....❤️❤️💜", "achalavatsyan": "How you managed your studies and YouTube in college time", "kritgya__bhayana": "How do u cope up with conflicts that arise with parents?", "shine.like.a.star_._": "If you get to go on a date with a celebrity who would it be and how will you spend your day", "messed_hair_guy": "Any future plans for bollywood", "drishya_010": "What do you use to grow ur hair??", "kkashish_r": "Where is this outfit from?", "riya__rose__": "Who do you inspire the most or whom towards you look for? BTW you are growing so gorgeous more and more. 💕@sejalkumar1195", "abhinanda97": "How to focus on work and cut out all other distractions?", "r.achita_": "You need better fashion stylish...that thing looks horrible on you", "laveenanagdevvv": "What are the 5 type of essential clothing u would suggest for a girl who likes getting dressed up tomboyish and not girly. Love u loads❤️", "ashish_rajdev": "How do you manage so much workload?", "a9iti_": "How's life post break up ?", "kartik_sh_arma": "How you handle your reel life and real life ?", "rhea_reddy123": "Any plans on getting into Bollywood", "ananya_dhingra": "How do u manage to do all things..like editing, shooting and spending time with frnds and family", "shakirfatema": "What are your biggest fears about fashion? And how be comfortable in your body and accepting all the flaws ?", "prerna_bahri": "I dnt like wearing jeans.bt i dnt get the right way to get rid of it by styling in other ways.i m really bad at pairing clothes", "upaasana_lamba": "Which mic do you use?", "bts.jeonjungkook._._": "How do you look pretty from all the angles as I see the camera I try to hide my self or at least my face🙈😅", "ayeshaa_fareed": "love ya😍", "01cents": "How did u gain interest in fashion?? Nd blogging was there really an inspiration for u??", "dugarritik": "Which software do u use for editing your videos", "the_urja_gada": "Plans of making a new boyfriend?", "shairley22unicorn": "When you will visit Hyderabad", "deepanshi__dixit": "Do you maintain your diet or workout? Also what would be that one cheat meal of yours", "manishikaa": "How do you always manage to keep up that confidence", "ammanqurban": "Do you have any project for launching your own song?😍Just curious about it😀", "faiza.2617": "How do u manage ur wardrobe with so many clothes?", "div_1904": "Asw", "_sohaana": "What is your favorite thing about being a youTuber? BTW love yaa sejal ❤️❤️", "sgdelhi": "@sejalkumar1195 I always wanted to pursue my own YouTube channel but how to gather the subscribers that's what my question to you", "tanvi_s_1506": "If you could collaborate with any YouTuber who would it be??", "yuktakalra": "My quarries are regarding editing, which software do you use", "anonshana_": "How about the fault in our stars #joshgreen #thefaultinourstars", "rakshita_yachalgar": "How do u mange to look preetier in a simple way pls ad this question lots of love from karnataka", "riyaz.14.84": "U r so cute", "cagunjansingh": "In future would you be interested in taking professional classes on singing", "sananda_for_parth13": "The first & pretty basic thoughts that came to you when you finally decided to pursue your career in this field & how you choose your next contents", "sakshii.18": "What is the hardest Thing Dress up or Shooting Videos or thinking Bout content btw has your life changed due to YouTube 💖💞🤘💯", "sincerely_a_berserk": "This red co ord from ? 😅😂", "rakshaagarwal_": "How to start blogging if we don't have ios or dslr?? This question is jumping over my mind since couple of months😣", "s.o.u.m.y.a.___": "How was your experience in ytff do u want to do it again in mumbai or in delhi!?? @sejalkumar1195 💕love you and your fashion sense", "mostlyfullysane": "Describe the following youtubers using one word/short sentence 1.praju @mostlysane 2.komal @komalpandeyofficial 3.shreya @shreyajain26 4.sherry @sherryshroff ❤️❤️", "madhuradc": "How long did you prepare before recording your 1st YouTube video?", "poorvivashishth": "From where u get such ♥ smart dersses ??", "isssha.k": "From which software you edit your videos and which camera do you use @sejalkumar1195", "ansh_gamer": "How was you experience in Engineering Girls?", "ananya.bhaskar.7": "I know so many amazing musicians whose covers have such less views when compared to some others whose music is not as great, but have too many followers and views. So what really matters when you put up content on YouTube?", "_vint.age__": "What is the major thing that your mom advice ..and when u follow em ..you always taste the food of success ? Basically tell us about your mummas role in uplifting u up", "manya_barnwal": "Would uh prefer nude makeup or heavy look?", "reshmapshah": "what will you advice to a beginner in his initial days in order to grow his/her youtube Fam? & also Do you believe that only Rich people can pursue this kind of career COZ everything in it is more of LUXURY!!", "arshita_mishra_": "What will do aftr youtube in the later years ?? Love u sejal u really inspire me😊", "manasvi_1360": "Hi di..I m yr huge fan! I just hv a question that were your parents ok with yr decision to YT industry and what actually pushed you to this? Plz pick up my question", "sabita_bishwakarma": "Hey sejal 😘 You are my inspiration. So recently I started my YouTube channel. But at time I run out of content ideas and I don't understand how to come up. Can you help me with these", "_suzilicious": "Do you ever regret your decision of getting the hair colour or the tattoo?", "dvn_bhatt_v_a": "Hi @sejalkumar1195 I am a new YouTuber so what should I do to make my channel popular??", "nikhartodi": "I have a YouTube channel about sustainibilty and environmentalism. Trying to make people aware about it. I don't know how to grow my audience. The channel name is nikhar todi.", "kaajukia": "Last video me I saw you are so lazy in your daily life..but how do you manage to be so organized at the end??? @sejalkumar1195", "stylemermaid59": "How make youtube videos more attractive and how to increase subscribers?", "sharmistha19": "U are a true inspiration ,Sejal!! I must say that you are that girl next door until one explores you. My question is: do you really need to maintain a \"perfect\" figure for being a fashion blogger!??", "rohhh_01": "Plz make a cover of tarefaan @sejalkumar1195 😍😍😍", "regha2494": "Can u tell one such thing which you felt is impossible but still u made it possible!", "myspace_27": "Why have you became so unregular and further youtube plans? You subscriber and fan since 200k.", "gemlibraa1": "Is there any chance YTFF would be organized in Dubai or some other country and you'll be opening the event singing Havana?? 😁😁", "neongirl______": "What was the feeling when someone recognized u the first time..btw,love u di💖 u are my inspiration", "nups1712": "Any other web series or any serial coming our way?", "muskanngargg": "Plsss sharee your hairstyle.....looking for it from agesssss", "vedikabadlani": "Would like to see a video on how to grow your YouTube channel with tips and tricks, especially because you've achieved so much in this field!", "chhavichauhan__": "Don't you feel the pressure that you have to like handle everything social media and all isn't it stressing😟", "nikiitanair": "Would you ever consider modelling as a career?", "beyond.rekha": "I also want to start you tube channel but I dont know on what theme, already there are so many channels. So how should I start , I'm confused.", "_.roohanii._": "How do you keep your personal life and your work life apart especially in a profession like this? Much love ❤🌼", "janvi.balwani": "Will a channel which starts as a “not a category” channel catch good audience? Or should a channel be started in one genre and diversified later like yours?", "the_mayathing": "You posted a video of yourself standing before a bus stop hoarding I guess, and you were looking at your picture on it. Well, it's obvious you might have felt good infact great but do share your feelings. Seeing oneself on this level is amazing and satisfying❤❤", "nama_2703_": "Why are you so pretty", "komaldewaniofficial": "How to grow as a blogger or As a youtuber ?💕💕 In love with your content😍😍❤", "chauhan_gal": "I don't have any questions for you, I only want to say I just love your fashion ideas and yes I am very impressed by you. Also u r an inspiration for all girls. 😘😘😘", "smileuidiot": "❤️❤️", "kashish_agarwalll": "Hey Didi can u plz tell me how to start blogging and earn from it", "aisha_rowlatt": "You aree soooo sooo amazing...i mean ur really an idol for us....thankyou for sharing and unfluensing us with ur content.....aap konsa editing app se apna video edit krte ho? 😙😙😙😙😙😙❤❤❤❤❤❤❤❤❤❤❤❤❤❤😙", "shrutaeeee": "Hey Sejal! First of all sending all the love to you. So my question is that what you bought the first thing from your your youtube earnings??", "mansig7350": "Then this friday which one will you upload @sejalkumar1195", "afreenkbegum": "Can u give some tips to new YouTuber.@sejalkumar1195 .I love your videos u inspire me a lot.lots of love from Karnataka💖💖💖😍", "avs_2912": "i am in class 10 now and i am totally inspired by you and i want to start fashion blogging so what will you suggest 1st start writing about teen fashion or videos?!", "dipra_agl": "You danced really well in YTFF, why don't you start doing dance videos too? It will surely be amazing ❤️", "chandana_botta": "@sejalkumar1195 Didi what is the best mic for recording cover songs??", "ambica._": "How to cope up with that feeling when your views get on reducing after every video?", "ratnam_shukla1": "How you could so camm and compose...I'm a very big fan of yours 💗", "divya_s_nair101": "If you can apply any changes in your current life wheather its good or bad. What would be the 3 changes that you would like to bring in your life?", "puma_rare": "Shane dawson or jefree star???", "take_tellinyo_military": "hiivb", "anushka0619": "How has youtube and fashion industry changed over the past 3-4 years", "_khushboo_0408": "Elaborate your dream which came true. Specially, when you were performing in ytff program💕", "iamabhineetbhardwaj": "Hi @sejalkumar1195 i am a gurgaon based youtuber ( NEETshit) , i am doing it for past 2 years consistently with good content and have made 160 videos till now , but i have just 1200 SUBSCRIBERS , what to do ? ☹️☹️☹️☹️☹️", "__ruchita__": "How do we start??? How do we grow??", "__.thedramaqueen.__": "In terms of money wat role does subscribes play ?#qna", "_suvarna.chowdary_": "According to you what do u think that your current position in today's YouTubers list...Lots of love and power to you", "anuthijadwani12": "How are you soo positive all the time ??? How do you manage all this ?? Plz tell love you ... sooooooooooooo much", "belleame_mblog": "How do you come up with engaging content every time???", "kulkarnivaishnavi23": "Will you leave youtube and do another job if you get a better opportunity 🙄🙄???", "aliza_saikia": "Who are the top 3 friends of yours in this industry????", "pakhimunjal15": "Fashion blogging and youTube is so overwhelming and intimidating as you always know someone out there is doing pretty well than you are and is gaining more followers and subscribers faster than you in A short time how do you keep yourself motivated that even you are as good as others and you are worthy of all the love you get. How do you love yourself and your work more despite knowing that you might not be good enough if someone else is doing better than you @sejalkumar1195", "floralcharm": "Love how you're pulling off the reds!", "_ishasingh": "Talk about its politics, the financial aspect, the dealing with the brands and all, that the audience doesn't get to see very often, and how it isn't easy, and they don't always pay, it isn't all good and cost, etc. It'll be interesting to hear your take on this I guess. @sejalkumar1195", "_unu._123": "Hey Sejal di 💓 My question is: When you are coming to Ahmedabad 😕 I am dying to meet you😭 Please come soon♥️ and Love You loads♥️♥️", "bhumikaa21": "How to start? And How to grow in this industry? BTW I love you♥️ and you are my favourite!🤗", "x_a.u.r.o.r.a_x": "Which software or app do you use to edit your videos so flawlessly and have you learned editing somewhere or it was all by yourself? ? Please really wanna know @sejalkumar1195", "shakshi_singh_rajpoot": "I want to be a YouTuber as well and really inspired by you.As you're multi talented and use your Talent as your work.I too want to do so.please give some tips,how you handle everything so smoothly and growing at the same time.", "harini_pratti": "How long would u make the YouTube videos about fashion and blogs? At a certain age u may not continue ds so Wt will u do at dt time?? 💖", "joy16_aanchal": "Can a person independently live with youtube as only source of income after gaining sufficient audiences", "tanushreevermaa": "Pls check dm", "priyankasethi1305": "How to charge from brands? like on what basis we can be paid? And specially in the beginning how much we should charge?", "_ritika_ranjan_": "Is youtube a good platform for earning living individualy. Which camera would you like to suggest to people who are starting making youtube videos. And like always love u the most😘😘", "phancy_drama": "How to be consistent with posting new content every week ?? When you know every second there is a term called competition.. Awaiting you to answer this", "dilnabijith083": "Who inspired you to start a YouTube channel? I am a huge fan of yours.....", "hatchautocad": "It's good idea to start a YouTube channel today ??@sejalkumar1195", "anerynayak": "Can you do the video giving tips how to look fashionable especially for fat girls?? Plsssss rplyyy plssssssssss @sejalkumar1195", "aashi_mehta23": "Please mention some tips as to how to grow our Instagram audience. Missing your fashion Content Sejal . Please do that more. Lots of love❤️", "jaaeeeiiii": "Give your all hair colour details?!😍😍😍I just love them AF💕", "weirdy_vein": "What would yu become when yu R not a YouTuber????luv frm tn😻", "ishita_g_2003": "Hello didi💗 how did the idea of all of this come to your mind? Were you always a fashionista before or discovered this recently and improved after starting blogging? Did you always think you would do this? Btw I love your voice a lotttt😍😍😍💗💗💗", "vanshiika16": "Who is your biggest inspiration dii.. And please also tell that how do you eliminate negativity??? Please tell btw luv you and your content♥️♥️♥️"}