{"_claudianair": "Love it!!", "themateriaworld": "Check out my page for premium luxury items .", "asadullah22437": "but mam we cant open the link", "dhawanutkarsh_": "I thought it's TEDx shit", "meenusharma99": "Bang on, that’s what we really need.", "saloni_chitranshi": "You are looking like Anushka Sharma here 😅", "__aakriti_14": "Just saw ur ted talk and i really admire the work u do since neerja. I really like the fact the u share wid us from ur story of being a \"female actor\".Looking forward for WTF season 3. Lots of love keep going keep growing @eishachopra😍❤👍", "priyank_shrivastava_": "👌⭐️⭐️⭐️⭐️⭐️👌", "aditi_parija": "You look very similar to @anushkasharma", "shambhavi_shrivastava": "👍👍", "popstar__banna": "Great Madum 🙏🙏😍😍God Bless You And Your Family And God Bless Everyone👏👏🎤🎤😍😍Love it😊😊", "_catchthydreams_": "Love what you're wearing😍", "tusharika_t": "All the Love to you❤️", "pragya0904": "I looked up to you, I don't know why? But after this I have got a reason 😊", "yashah13r": "At first, I read it TED SHIT", "ferynawazheir\nVerified": "Verified", "divyaa_rajj": "Just finished watching it and all I have to say is wow💙 it was so refreshing🌷... loved it so much... keep sharing🕊", "__iabhirami__": "@eishachopra this is the best way to tell it ..lots of love nd respect to you for putting it out there..it is very important that ppl understand the fact that stories,cinema and shows affect ppl..glorification of wrong affects ppl,sexist jokes imbibe sexism in ppl's mind..and lastly strong women charecters help build stronger and better women.thankyou<333", "rohit18thakur": "Now I know from where you get those witty comments #mom😛", "ankit410singh": "@eishachopra that’s wow 👍👍", "anujswai": "Tedx shit", "shrelipun": "Hey Eisha...luv ur work n the way u work at ur craft is awwwsssome bro😀😀💃😍😍😍😁.. chaakhh de fatter bro...Bruahhh,😘💃💃😍😍", "drvarunramachandra": "👏👏👏", "suavestag7191": "You definitely broke the Cliche of Sitcom /Soap Operas Bimbos who can only post selfies of Gym workouts,Sipping Wine,Eating the Pastries .Kudos to your presentation skills - 😊😊 Do one thing please please challenge all these Bimbos to come and Present @ TED talks. Let’s see how many can accept it. Good luck for all the future Endeavors 👍🏻🙏🙏", "soldbyashbawa": "Women card is being played here🙄", "_.khyatii._": "Beautiful", "alimurtuza2307": "Good", "a.nao_": "@eishachopra I listened to your talk yesterday. It was very inspiring. Thank you so much for spreading those ideas, you are great!!!", "tinalamaofficial": "❤️", "swami_ji_0": "Superb😉😊🌹", "chugh_komal": "I first heard of you after I watched WTF season 1, and then I kept on following and watching the shows that you've done From Official Ceogiri to Great Indian Dysfunctional family. I've followed your work and been a sincere fan who has connected to almost every thought you portrayed or shared even on your personal social media account. And this has been one of the talks where you could pour your heart as you and honestly I've enjoyed it all and have felt so connected that I deeply regret that I although living in Vadodara have missed to hear you in person. Yet, I send all love and power to you to grow and keep being this honest self in all your works and actions!! *BIG HUG* @eishachopra", "mlkonatinoal": "Great Definitely♥♥♥♥", "maahhhek": "@abhiiishekgupta Aayiee", "stylesavitri": "Wow! So proud ♥️", "saarcurrysteak": "That's so honest of you. Love it..", "dnoy74": "Wowww🔥😍", "dodeja_": "Gosh.. who else thought of TEDx shit", "anandrao434": "Love you 😘", "nirja.bhattarai.1": "❤️❤️❤️", "theconsigliere03": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥😀", "imkarty": "Great Work! @eishachopra 👏👏👏", "divynsingh": "🔥", "theharshx": "💯beautiful @eishachopra", "_sahaj._03": "Ure totally an inspiration to women ..Thanku mam for existing we truly love u @eishachopra", "navkiranm": "What is the context of post script if someone has not watched kabir singh ?? @eishachopra", "amreeta_cho": "I love you. That's it. That's all I wanted to say.♥️♥️♥️", "haha_diana_": "That was informative and very motivating at the same time. I'm so glad to have watched it❤️", "iamchatorasatu": "💙💙💙💙", "yamini_kameswari26": "Absolutely wonderful !! @eishachopra 💕🔥", "radheygbhatt": "🙌", "_vijayeta_": "Wao! Way to go. This is where I always wanted to see you.", "desitrolls14": "🖤❤️", "imsinghsb": "Full video link please!!!", "nancy_sardana": "This is one of the finest set I've heard. 🤗💯", "amanverma3749": "What a confidence superb.👏👏Just wanna know what it takes ones to be as confident as like you......", "moulsari": "Didn’t know, cool! 🤗", "nikhiljha1": "The thing which your father said was awesome : \"It's not about boys vs girls or men vs women, instead its boys=girls and men=women\" .. learning for today I guess. In my views it's more of like society vs women because I have seen women not letting other grew .. idk the reason but yes I have seen them stopping others.", "blackbindibandit": "💚", "riyamordia": "Amazing 💯😍", "janki_naykpura": "Superb dear😍", "etishakohli": "babes how can i see the full video 🤔", "shyammehta": "Sharp 😎", "iradubey\nVerified": "Verified", "thestubbornkid7": "Just loved the Ted talk!! Thanks for sharing💗", "mansha.jpg": "@mainpreet", "kalkattalocal": "@eishachopra This was probably one video that made sense from frame one to frame end. Kudos to you for speaking up like this. 💓", "vinayjhwr": "👍👍liked it. ❤️", "weshall_makeone": "Lovely.. Can't wait to watch the video.. I absolutely love you @eishachopra 💕🌸😘😭", "aslialexx": "💕💕", "jj_jessicajayne": "Such a pretty Medici uff ❤️", "techhungryguy": "You are one of the few actors who i really admire... forget all Bollywood...Very few has the courage to openly speak about failures..which you did...Your presentation, posture, acting skills..bingo....You are not a running around the tree material but bollywood has evolved a lot lately so try to venture in movies as well apart from good work in web series...", "hbanka_02": "@eishachopra awesome", "shubhskaushal03": "You just said ur heart out @eishachopra and we certainly admire you for the kind of person you are.. good luck future projects 😊", "caprirk": "Loved you in WTF... Very mature and intelligent👍", "vaisaurus": "An icon literally💥", "_amritaverma_": "❤️", "tam_tam_mashooo": "This is gem! WELL DESERVED @eishachopra And you deserve much more!! #JABRAFAN", "being_m_abinash": "@eishachopra So Nice Ma'am.Acting Is A Platform Video Was awesome.Inspirings Words And I am able to link it up with failures and rejection.Thanks For Giving More Hopes To Everyone.👌", "mayank_pratap_singh_9847": "Nice pic", "amit_singh_ca_": "Watched already.. It was awesome", "107rahul": "🙌", "y_rakesh": "Was Anushka Sharma giving the voice", "prakashsuraj14": "Hey listen you gonna kill it 🕶️ @eishachopra", "romitv7": "Was great to have you grace our college and stage ma’am #TEDx", "greeshma2807": "You look so strong when you speak, I'm in love with you❤️❤️❤️🤗🤗"}