{"sheyrrdill": "@eishachopra i can understand your perception regarding the post but don't you think this post delivers alot more than what you wanted to convey..? One more thing i would like to share is that a regional manager of himalaya drug company ,mr. Riyaz, has also shared the same post of bleeding india on 21st april and some SM user has reported it to company and they have taken strict action against him. Anybody can post anything coz of freedom of expression but you guys are celebs u need to think twice coz people follow you and Any ambiguity in a post can harm your image.", "gaurav_ayush": "Negative people always always blame nation and if u blame our nation then please change .", "_karanbhargav_": "dont do this type of bullshit 😕", "dr.satvikpatel": "This picture is pathetic !! Doesn't make any sense !! Totally disrespectful.", "patilakshayv": "Ab ye log karenge character ki batain #look who is talking", "crirodb7": "Starting to follow you after seeing this post, that's so unfortunate that people are not getting what the picture potrays, u seriously don't need to answer this self proclaimed patriotic guys who never has done anything for the country but pretend to be the country landlord asking questions like Y u stay here if u don't feel safe,", "beautyadmirer1": "What kind of crap picture is this. Eisha showing India in her cunt! This is un-acceptable", "sarika.p": "There is better way to express ur thoughts you should remove this pic from ur insta.. It doesn't make sense , that's ridiculous..", "non_sane_tamz": "This picture says a lot..I am really happy that someone have guts to post this..actually India is stuck here and cannot grow unless they stop objectifying females and treat them like humans..honestly half of the guys who are responding against this post are actually insecure and cannot stand females can have opinion and can ask for basic rights..", "nitinsharmawni": "Shem on u", "_iam_srkian555": "Hatsss off!!!!! 👍👍👏", "gangstaaguy": "Ridiculous", "iamkushalsuthar": "👋👋👋👋 not enough one more👋 ... Mere akele ka nh hai thappad pure desh ka hai.", "mr_uparwat_22": "😂😂😂", "amitk.111079": "Basically you pointing the place of this whole world from where you only find Sex, population and the urine.. i may be agreed but due to my indianism i will say it singh dwar..for you people... from you took birth and again want to be in ...without consider your size.. its odd very odd .. its an indian map ..if you aren't indian then why jealous. go to Embassy try to get citizen ship and be inside there... we already in trouble every where in there but its not easy to go abroad or be easily out of this shit situations. People are criminally corrupt for us. Any way i am indian and i am proud of it. Plz deni such artwork its a nation although but not a singh dwar.", "i_ame_y_a": "If India been this bad..u wouldn't have posting this picture. And wouldn't be looking as happy as successful you are..@eishachopra .. certain ppl do ugly things.. doesn't make the nation bad..the number of ppl of doing good things are way higher than those... We worship our map..and see you place it where. ..", "kumarsonuk914": "🤣🤣", "kumarritesh391": "This picture denigrates my country. Did you even think a little before posting this image? Look at the position of the map of India. You have insulted our country. Youbdeserve a lawsuit against you for this.", "bharathrao2603": "@thevikashanand I truly agree with you", "raghvendra_singh_rajawat_": "Sharm nhi aati tumko aisi post dalne me", "thevikashanand": "@eishachopra Ma'am Yes this country is bleeding but that hashtag does injustice to many survivors sisters & mothers out there. That angel didn't deserve what happened to her in Kathua & her culprits deserve nothing less than death. If you talk about one then talk about billions out there irrespective of religion. Hundreds of Asifa is suffering in North East & WB but no one is speaking for them because they aren't from minority community. Asifa is gone but many who are still there are suffering but politicians aren't doing anything because culprits are minorities , Like this girl : http://www.dnaindia.com/india/report-dna-special-girl-s-abduction-wb-cops-defy-kolkata-high-court-order-2607058", "prem_s_mishra": "What the hell is this... You're a celebrity.. many people follow your from different countries and if you'll post this kind of posts then India will get insulated in front of other countries... shame on you @eishachopra", "jeshugod": "What a nonsence are u made ?", "mhrpan": "@eishachopra there are lot of missing peices which we need to understand to overcome this. If people rape, why do they? We don't because we know about how it feels o force someone, because we respect woman, because we have been bought up in a way, educated. These things lack in lot of people, poor education, poor influence to drugs, abusive alcoholism, politics and many other reasons. How do we overcome this? There is lack in educating people, the government should rather focus on implementing precise rules,", "glamshifa": "Truely the picture is truth.. In simple words.. @eishachopra its good to see all the protest.. Evwn we are involve in that", "eshwarrajpurohit28": "@eishachopra so you want to say that the whole India is filled with rapist ?? Every one here is a rapist ??", "shivard": "Generalising ol not crct", "you_reached_ab": "delete yourself plz,", "purvarish": "Deeep!!!!!", "grtali525": "@eishachopra mam this was not expected from you, just because of some psychopaths portraying everyone wrong is not done at all... and insulting our countries map not at all....There are people who live and die for it, mam i would like you to think upon it and by no means i support sexual violence it is condemned by me and internationally and there are steps being taken to ensure that this does not happen again, it will take time but with time change will come", "___della_": "JUSTICE TO EVERY GIRL!", "official_aks10": "Mam we all want justice for Asifa for tht we stand for CBI enquiry but see media people label us as rapist supporter", "nikhil_kishor_patil": "Ridiculous depiction", "meee_vishal": "Really a picture has depicted much more than 1000 words..☹️", "esouqplace": "Hamara mulk Hindustan yhaa ladkiyo ki koi izat nhi yhaa ek bachi jisko itni berehmi say shikar banaya us masum ka dar ek ba uska dard mehsus krke dekho kitni taklif hoti hai ek bar hamere mulk ke sare admi yeh soch lee ki agar unki beti hoti too ya Behan plz desh ki izat ke insaf ke liye ekk awaz bane", "sworupmishra": "@eishachopra just answer this question, Are you a RAPIST? If no, like you there are 98% people in our beautiful INDIA are also not RAPISTS, they respect women, it's wrong to blame our nation here and yeah if you are also a RAPIST, then you have no rights to blame our beautiful INDIA and whole citizens of our nation", "in_makingmyself": "Thats too much...!!!", "adyrathi": "fucking lame. unfollow", "kaalakouva": "That's harsh. Much as we all are hurt...it's harsh.", "ritikkashwani": "We want Justice 😞", "i__m_.sam": "They passed a rule who raped a girl smaller then 12 will hanged to death?? What the fu... K is going on. What will happen we do if they rape a 16 year old girl. This is india....", "i_m_invincible_": "👍🏻 Ya Damm true.You can tag other girls who just raped after Asifa.", "juskiddin": "Kudos to the creative team of this amazing picture which will make everyone speechless and force to think and act. 👍", "bhukkadkukkads": "I am all up for death penalty for rape...but this is just not done! Shaming whole country or any one religion is stupid! A rapist alone does not represent my country or any ones religion..We need to learn to strive for justice without generalising..and without blindlh following whats shown by media! The nation is more of the brave soldiers than of anyone else and this pic is more an insult to them, than condemning of rapists...", "debasis96x": "So creative"}