{"sritama_majumder": "I m big big fan after watching this series. U r just too good", "bhat_saahab": "@arpitha.h.a", "shreyaayachit": "You're an amazing human Eisha❤️", "bhautikpipaliya18": "@devanshigariba", "tanushreejagatramka": "Best scene of s2. Ur team has done a great job to bring out the real yet ignored elements of our day to day life. Thanks for this scene. Related well. Learned well. Tysm", "perfectly_imperfekt_": "@theblue_soul @prajakta612", "siddhib0712": "@ashwinichikkodi", "thegirlwith_twonames": "@prerna_mukhija", "divyakanchanbaras": "I resonated with this scene strongly. It drove me to share it with my Jethani. I can’t with my mother inlaw, and that just broke my heart. This is exactly what is needed. We have come off the age but the mental barriers and blocks we create for women are just so ambiguous and Infact that leaves us feeling unwanted by ourselves. This is crazy shit but true and this scene is exactly what we need...", "_shradha_865": "Dis was one of the best scene of this episode 💗💗. ND I luv ur acting skills. Whenever I watch dis web series I found it real", "mayuganapatye": "❤️", "harivk2106": "@parjene :-)", "kiran.sachdev.90": "It was the most bful scene 😘 loved it", "x8_joker_kaalia": "ur becoming one of the fav actors ...lots of love and success 2u ..GOD bless you", "renukamulay": "Amazing, amazing, amazing! ❤️", "muditapatel": "Saw it just today! Very touching, looked effortless", "harshali_mathkar": "Best scence❤️", "kalyani_chhelavada": "❤️❤️❤️❤️", "ekum25": "@manmeet_2413", "avneetgauba": "This scene was soo beautiful! I watched it on repeat thrice. It is something so simple yet we never do this and get stuck in a role of daughter in law..thinking about expectations, making others happy and in the whole process we lose ourselves.", "_pallavidadape_": "this is my favorite 💯💯😭❤️", "prash0.2": "Brilliant thought, short and simple solution. Appreciate WTF series, waiting for next episode.", "may.nandi": "This scene is so relatable that I do feel like reposting and spreading out the message that \"jane do\" 🤩🤩🤩🤩🤗🤗🤗🤗", "batatapoha": "@aarjavidharaiya another suggestion for you to watch.", "vpatra": "<3", "ritutiwarii": "♥️", "bak.bak.lawyer": "@sonalkothar @shweta.jain.9275439", "deeparenil": "This was one of the best and my absolute favourite scene from the season.", "my_untamed_spirit": "@dishamule @pgwaghule51", "diamondmind_prem": "Super🤘", "somamangnaanii": "So true", "suman_2616": "@love_is_everything1000 please follow this page❤️❤️❤️❤️❤️❤️", "kunju_kunju_kunju": "❤❤❤", "shams_i_tabrizi": "@zapsidhu", "kanika.bhatt": "@sahildutt369", "asma_lent": "@say_sohail", "divya_vaasvi": "Thank you for sharing the secret of stress free life \"let it go\" ❤️", "flying_kiss_na": "Love this scene", "jasmin_mohamed90": "@3saamalblushi", "consulshivani": "I love that scene..so natural", "kanikasharma1992": "@sharma.radhika1988", "___shrishtiforever______": "💖♥️♣️♥️♣️💓💓🖤🖤♥️♥️🖤🖤💕💔💝💝😋😋🤗🤗😍😍😍😘😘😘😎😎😚😚😚😚👻👻✌️✌️💠💯🎶🔥🔥", "b_balu_": "@parv_athy96 let it go", "design_your_nails_by_isha": "It was amazing👍🏼😍", "_manchanda_dolly": "👌💕", "kajjaln": "Bestest scene @eishachopra ❤️ One can't have it all 😂👌", "am_saury": "@sukriti_jain", "kunaalgera": "It's stories like these which bring life into each and every scene of a movie/show. The backstory, the preparation and the time the crew spends to prepare is the real magic in film making. Thank you, @eishachopra for sharing this.", "rythem.chopra09": "Love this conversation", "tanishqsharma_07": "Nice one⭐", "ritzluvs": "The scene was so true and each and every word meant as it was directly from your heart.", "mlkonatinoal": "This is super ♥♥♥♥♥ about your performance it's really amazing gorgeous @eishachopra", "bapteaditi": "This was much needed!! I forwarded it instantly to my mum and other ladies. Thanks for sharing what we doubt at all times!!✌🏻", "babumoshayyy": "👏👏👏", "rohan_kar05": "i like the scene💖luv u😗, keep ur good wrk cont.", "rahulkumarbro": "👌👌", "dharnik": "@titixajain", "ig_priyasingh": "Sexy babe want to fuck you", "pankhurifetch": "How lovely", "goodykinni": "Makes so much sense \"whatever you have is all\"", "shraddha717": "❤️ very beautiful message conveyed in a brilliant way ... Kudos team WTF2", "mahak.27": "This is my favourite scene! More in love with you every single day @eishachopra . Kudos to your work. 😘❤️", "yashm._": "@hritika_21", "tonape.tushar": "❤️👏", "subhashani": "Don't know if it is a separate initiative or a part of film or a series but, it resonates. Beautifully done and expressed. I see so many of my friends constantly struggling with this. The concept if being perfect also comes from the desire to be accepted for oneself and sadly in this most women lose themselves. Hope the message spreads. There's so much to life than perfection and that perfect image. Best wishes. 🤗😊", "hetavidesai": "Loved this scene! And the acting was effortless👏", "nyuthaa": "Stunning ✨❤️", "renukash710\nVerified": "Verified", "kumkumdas": "Feels 😭😭😭😭💖💖💖", "sanjubaba123123_": "Best advice... Inspirational... Going through a lot but #youcan'thaveitall !!! @eishachopra .... Fan ...", "khyatii23": "I really appreciate what Renuka mam said. We are can't make each and everyone happy. Even the opposite person is men or women. And I am gonna do the same \"just let it go\". Just loved the scene and gives good message to each and everyone..😇😇", "amogh2391": "@eishachopra Hi ! I absolutely loved this scene. Reminded me so much of my mother on how, when she got married, everybody wanted to see her as the perfect wife, the perfect daughter and the perfect mother and how she tried to do it all. eventually, sacrificing and deteriorating her health. families don’t realise that there is nothing called ‘ perfect ‘ . Perfect is a perception; something which does not exist. All that matters is love and togetherness. Thank you, to both of you, for acting out this emotion so well. On a side note, WTF season 2 is amazing, like the first one. Waiting for the next episode already 😊🙏🏼", "fluffyncutesie": "This was the best scene!", "kanikanarula_": "@sethipurva the scene that we saw together 😃", "anonymous__1210": "I love this part and the example that she sets to make you understand 😍😍💫", "niti_srivastava": "Awesome ✌🏻", "heereshyadav": "Ye wala mujhe bhi acha lga conversation 👏👏 true meaning of life just chill go with the flow", "shwetaghate07": "I am in love with this scene. A very yet effective mantra to live a peaceful life.", "aditya._.ra": "One of the best scenes of the whole show! 😍😍👌👌", "sayan_s_das": "I thought this was THE SCENE of the entire season. Love love love love... And you both were top notch. ❤️😁😀😊", "stuckinthebox08": "The best scene in this episode....loved it💙💙💙", "dinesh_bakshi_7884": "Awsome 👌", "s.h.w.e.t.s": "This was such a beautiful scene well acted by you and renuka ji... one really cannot have it all", "veerbassi": "Love it 💞", "sunny_9317": "My fav scene @eishachopra ...in the next season please if the team can release all the episodes at once that that would be awesome..I know it creates curiosity for the upcoming episode but..you guys are so good I wish to see all the episodes at once...I can re re watch it mam", "anjalishri29": "This scene was the highlight and the most unexpected one in the episode. Thankyou to your team for executing such simple things on indian platform", "k_pavann_kalyan": "You are a brilliant actor", "abhii_wise": "@eishachopra ma'am I love your series....!! It's has so beautiful & amazing story...! ♥️", "his_story_teller": "Whether it be season 1 or 2 you are the best", "vid.u.shii": "I really loved this scene...!!! ❤️", "daxparmar503": "Fabulous", "mugdha._.rangnath": "Best scene best saas-bahu duo 👏🏻", "cmr12349": "This scene was awesome...👌👌", "yash_vish": "@jugnu_tilwar 😋", "vish_nu_s": "This was one of my favourite scenes in WTF 👌🏻", "swathi_2446": "I liked this scence........", "bushra7619": "Beautiful scene love your acting 😍😍", "the_screeching_silence": "This was the best scene in that whole episode. One can't have it all. 🔥🔥❤❤", "ash.ki.asha": "I'm loving the realness of season 2! Especially the scenes between the both of you. Lots of love from Kuala Lumpur 💖😘 @renukash710", "mrina_linii": "Beautiful", "_tanishasr_": "Too good", "saurav.das.94": "@jsaini1988", "shubhitaaa": "This is one of the best series I've watched in Indian context. Sounds like an understatement or quite cliché but there's nothing better than this that could give someone a tutorial on how married life can be. 💯", "__mister_naveen__": "I ❤ u eishachora", "wondralwys.wandroftn": "This IS one of the best scenes! ♥️", "know_raj": "Awesomest and Sweetest Scene In that Episode You And Renuka Mam Nailed It I send to my mom and Said In Laws and Bahu Goals 😅😅😅❤️❤️❤️"}