{"sabrinastyled": "It's so confusing to me how he could cry about ICE in one challenge but praising MAGA in another. It makes no sense. This was terrible. And he had the nerve to say he had never seen Celine Dion's look?! *Kandi Burress voice* LIES", "8earthdancer8": "Yes. #speakthetruth", "marisa_a_caldwell": "Yikes!!", "browning32": "@shopmiracleworksboutique", "nycxclothes": "Haha I lived for that part!!! 👏🏿👏🏿", "sherwynaga": "👏🏾👏🏾👏🏾", "justthacia": "So glad you said something cause I was so mad. I was just reading a story in 1959 about 69 African American boys were locked into their dormitory in Arkansas while it was set on fire. Nowhere was the 50s good for people of color.", "dilly_dori": "Big y i k e s", "symonne.xo": "i just wanna know what goes through ur mind every time sergio gives yall lip during the critiques 😩😂", "hopemineo": "1. How could he not know he’s being offensive? 2. Let’s call @arlanwashere and @sallie.krawcheck to give this man some economic lessons AND the real reason life is soooo much more expensive in the 21st century. HINT — it has ZERO to do with holding back, discriminating and Keeping down people of color and women. 💪🏽😎 Okay, carry on and have a beautiful, productive day ALL PEOPLE in our world!!! ❤️💙🧡💜🤎", "faithskins": "I was shaking in my boots when he said this among so many other micro aggressive and inappropriate things he’s said and or “represented” this season. He’s always got some 🤮 to say.", "blackgirlnay": "When he said that I immediately knew you was going to speak up. I couldn’t understand why he would say that with you in the audience or period.", "churchlove333": "#sticktothefashion", "isabelhunt1985": "🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️ what was he thinking? Clearly he wasn't thinking at all.", "jenpluscolour": "🙌🙌🙌 You’re amazing", "msdevotedtiff": "When he said that, I said what I always say when I hear that. \"It was great for who?\"", "stephaniefortknox": "Ignorance is not bliss", "theeditorialnail": "🤦🏽‍♀️ good lord", "sonyacoconutt": "Your outfit kills it every time 🔥❤️ you and @ninagarcia are the best dressed on @projectrunway", "talosiah": "WOW, he doesn't know the history of AMERICA. oh lorde.", "j.jhana": "🙌🙌🙌 Whooo chile the privilege...smh", "bethanycoan": "This moment was everything 💞", "cocolovecrafts": "@elainewelteroth You hit the nail on the head with Sergio. Too many \"issues\" and he needs to stick with one. Good for you to say it and I hope he takes your advice! Have a beautiful day💜", "sophieechang": "love you on project runway!!!", "heiscaleb": "Speak, sis.", "tri_nuh": "I was SO HAPPY u put an end to that!!! That was a very ignorant and careless statement for him to make...u took the words right out of my thoughts while he was giving his little speech! Smh!", "locdadventures": "Listen I could have jumped through the Television to give you a high five and an amen when you so rightly checked his wrong, pompous, ignorant behind! 🗣STICK TO THE FASHION", "deborah.t.chester": "😭😂😂💀💀 he’s so clueless ! READDDDD him ! 👏🏽👏🏽👏🏽", "mpwashburn": "Thanks Elaine!!❤️", "ammyslove": "👏🏾👏🏾", "tiarasharae": "👏🏾👏🏾👏🏾", "rae_harvey": "👏🏽👏🏽👏🏽", "therealddhall": "Omg. When you said that, I paused the TV to holla 😂😂😂. Especially because behind the scenes, we knew it was a rambling after thought. Then I was like, aren't you latino?? #FOH", "yonilovewaistbeads": "@melanyn_monreaux", "theslim.reaper": "A fucking queen🔥", "tulleytoo": "I was so confused. Like, is Sergio that oblivious?", "paula.robinson.international": "Stick to the fashion!", "she_acts": "😍🔥🔥🔥🔥🔥 Here for all of the clarification of the facts 💅🏾", "khrstnsibley1": "No he didn't👎🏿👎🏿 how disgusting that someone who is involved with fashion could be so dense and unknowledgeable", "planbandpancakes": "He tried it!!", "ashleeastride": "Can we move away from saying people of color and be clear and say black people? Or brown people? When the issues pertain to them? By lumping people of color, we forget that certain groups were allocated more privileges than others. - I still appreciate the messaging 🤷🏾‍♀️", "heel_game_killa": "🙌That epic moment in BLACK HISTORY!!!! 😘 Bc he irks my nerves", "tylisawrites": "STICK. TO THE. FASHION. Wow could you imagine if we all just stayed in our lanes??? Lol", "onabrooks": "Breath of Fresh Air! #beautybrains#mamasgirl", "tykeianicole": "Sis had time! I'm so glad!", "darlingnessa_": "what a concise, professional read 😍", "1houseofm1": "And that’s how you read fake woke people👏🏾❣️ @the_incredible_portialynn", "queenrhonda158": "Your presence on the show is so necessary! 👏🏾", "victoriamoyeno": "🙌🏻🙌🏻🙌🏻🙌🏻", "moreloveformakeup": "I also hate how people always expect the person of colour to speak up in the room . It’s time for other people to take part in the conversation and stop eating for us to make statements . If you stand by people of color speak up don’t just look and shake your damn head .", "djxdomo": "STICK TO THE FASHION. Not that we even want that from him at this point. 💀😂", "megkmont": "💯💯💯", "dinahmight3": "👏👏👏", "azzytude": ".....................................", "yyysimmons": "❤️👍 @elainewelteroth - You Rock!", "ifhediditbeforehecandoitagain": "OOP! Elaine checked him, hard! 🙄😑He had it coming, ugh! Yes, Sergio, please stick to the fashion!😂☻🤣☻😅☻😄☻", "lorimikuls": "OMG. I didn’t see this episode and am now on 10. I’ve grown to like him. Rewind! Not now. Wow. Just wow. Eloquent come back!", "drinks_on_tri": "He's good but the political references is too much for those dated looks he put on runway", "yo.ke.yo": "Cringing on the struggle bus", "hair_analysis_and_nutrition": "👍", "2goats2acres": "😳😳 when he said \"1950s....\" 🤦🏾‍♀️", "angelaarafelis": "Goodness , what happens when people don’t really know history, they dream of repeating it!", "_fasssteddie": "@butch.barbie 😆", "reneestephanietaylor": "✔️", "parkerxl": "READ Of the DECADE 😍🙌🏾💯", "brilliance76": "@elainewelteroth Bravo 👏🏾👏🏾👏🏾. That dress was ugly as hell. And he just put his whole damn foot in his mouth. How dare you say those the best times!? His ass wasn’t even alive back then to speak on how those were the best times!", "vashtilou": "I love you. I just fuckn love you.😩❤️✊🏾", "thedjcamille": "I just LOVE you!!!", "meldenise": "😍😍😍", "marchaan_is_here": "😊Is this on Netflix?", "stellar7": "@showtime17 fashion, but make it politics", "tasiaseyes": "The garment is ugly anyway ☠️", "mrsgermain": "👏🏽👏🏽👏🏽👏🏽👏🏽", "tracynicoleclothing": "Well stated @elainewelteroth !!🙌🏽", "msnomig": "Smh 🤦🏾‍♀️...there goes \"POP\" the bubble he lives in", "chrisblakecole": "Stick 👏🏽 to 👏🏽 the 👏🏽 fashion. Period. @elainewelteroth *four snaps*", "marthicks": "I'm so glad you called him on that load of manure. It needed saying.", "donniet76": "😱 my face when he said that!! So happy you set him straight! @elainewelteroth", "thatcutiejess": "Exactly what I did! My fav show!!!!", "_blackashley_": "If he wants things to go back to when one parent can work then shouldn't that be the same party wanting to raise the minimum wage? Or lower the damn prices of things because clearly it can't stay the way that it is.", "sereathia": "Bloop!", "bestlife.2020": "@elainewelteroth “Someone had to say it”. Yes, someone did and that someone was not going to be Karli Kloss who’s brother in law is married to ivanka trump", "aye.fe": "❗️❗️❤️❤️❤️", "jusbreev": "You said the words before I could yell at the TV. Thank you for being you!!!! 🖤 #letthemknow #whatyounotgonedois", "mspackyetti\nVerified": "Verified", "writeher": "Jesus.", "millertime510_": "Trump 2020!", "kbluvbrown": "Thank you @elainewelteroth That was soooo disgusting but that’s truly how ppl think or should I say DON’T think.. 🤦🏾‍♀️", "ipsita_paul": "👏🏽👏🏽👏🏽 No Thank You!!", "candygyrl428": "Thank you Elaaaine!😄 I loved when you got him all the way together", "norealjewelry": "Girl you let that ass have it! 👏🏽👏🏽👏🏽", "charrfarr": "@amazing_prophet0", "znichole": "I cringed when he spoke.. thank you for your response!", "dsbellds": "Yes! Say it again!", "e_loves_u": "Whew yes!!!! Im so sicka him!", "cancercartel": "❤️❤️❤️", "priscillacolombatto": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "lesocialnomad": "👏🏾👏🏾👏🏾👏🏾 thank you for speaking up. Ugh.", "ckurosu": "🙌🏼", "jojodubyah": "I knew as soon as I saw your face while he was talking that you were gonna get him. Thank you!!", "js221": "We have to STAN", "michaeel_xo": "LIKE GET YOUR FACT RIGHT boo-boo 👏🏾 @elainewelteroth", "26bella": "Smh", "_msnewman": "This was one of my favorite Project Runway moments. Thank you.", "wanny_prettyfab": "Smh thanks for putting him in his place.", "jlmcelroy": "You were so good. 🙌🏼🙌🏼🙌🏼🙌🏼", "bre_keshae": "By far my favorite part of this season... thanks for saying what needed to be said", "jan_d214": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽Well done!!!", "fatlipgloss": "Yes! You HAVE to be tired of his ingenuinene, arrogant, stank attitude. That dress was good tough. 😂", "arielthemodelmom": "I was so happy you said that✨ Like what boy?!", "theyngels": "+ take some time to make some calls or knock some doors for our next president, Elizabeth Warren! We must fight for the world we want to live in.", "khristianahowell": "Light. Him. Uuuuuup! 🔥", "heepoleaves": "As soon as those words started to fall out of his mouth, I knew you'd set him straight.", "postmoderndesigns": "TRUMP 2020❤️❤️❤️❤️❤️", "amanilouella": "What’s 2.5 kids?!? Where’s the other half?", "goldenngorgeous": "👏🏾 👏🏾", "nessahopee": "Okay I need to watch the season with you as a judge 😂😂 set the record", "xo_gabriele": "Periodt 😊 #notmypresidentsday", "mameadjei4\nVerified": "Verified", "jecont07": "So that’s a no, for Karlie wearing this to dinner with the Kushners? 🤷🏽‍♀️", "christinebrouwer": "He needs a swift kick in the ... He is so arrogant. I hate how dismissive he is of @csiriano. Show some respect!! He is on the show for a reason and you are not on his level... Not even a little bit. Shut up & have a seat.", "aliyarhodes": "@cassidy08 BRUH", "ashleyreidallen": "👏🏾👏🏾👏🏾👏🏾", "soylauraedith": "Latino white privilege 🥺", "pieces_of_dee": "Over y’all decisions this season. Victoria should have been cut a couple of episodes now.", "lulahoop_": "I love the perspective and energy that you’re bringing to the show. I’m also watching each week with bated breath for the moment Sergio FINALLY goes home 😂🙏🏽", "ms.lanitasunshine": "What! Lol thank you for setting that straight", "west_coast186": "It’s long past Sergio’s time to go home", "tummyrumble": "He's so pretentious and full of himself. And bloody annoyingly pompous.", "robin809": "Love you, Elaine. And YOUR message", "tivarri": "👏🏽👏🏽👏🏽", "thewhitney__": "Thank you!!", "jamilksmith": "Somebody did indeed have to say it. Sadly, we keep having to say it.", "casajasper": "Happy time for a new president day! Your grace in handling that is inspiring.", "girlonavine": "😂this fool going all the WAY BACKWARD🙄 #allthewrongway", "skiiptomylun": "👏🏽👏🏽👏🏽👏🏽", "mollymollyy": "Thank you, Elaine!!! 👏🏻", "becomingdr.b": "You! 🙌🏾🙌🏾🙌🏾", "teneyalove": "#Yousaidwhatyousaid 🙌🏾❤️🏆 🙌🏾", "nikivadionne": "U handled it better than I would've 👏🏾👏🏾🙌🏾🙌🏾", "sxnoir": "I am ded", "kiadajamommie": "I screamed when you have your response 🤣🤣🤣.. his dress nor his comment were researched prior to runway . Ijs", "ohhappykaye": "👏🏽👏🏽👏🏽👏🏽", "thegirlmob": "Glad you told his ass!", "bree_person": "Deadass stick to the fashion 😭😭 Cause that message was not it 🙃", "jazmynneschell": "I remember cheering when I saw this. Thank you for checking him. Also 2.5 kids... way to really just recite statistics without understanding them or thinking about context.", "ericwelteroth": "Good shit Elaine!", "xoziza": "Lmaooo you got in his ass so politely😩and Karlie’s face every time they bring this man’s foolishness up really kills me. She’s over it!😂", "lyndabb": "😧", "coco_oak": "Hope Karlie Kushner was listening", "ms.queen_bchel": "He was getting on my nerves THE WHOLE SEASON", "teddytinson": "STICK TO THE FASHION!", "neonbeigelife": "👏🏼👏🏼👏🏼", "tksmith47": "💯💯💯💯", "intisaronair": "The eyebrow raise said it all...I’m like Elaine is about to go in 😂😂👏🏽👏🏽 here for it!", "klvn.s": "I’m glad you got him together!", "dlockxo": "THANK 👏🏾. YOU 👏🏾.", "natty_kitkat": "Also the MAGA slogan is referring to going back to the 50's...that's the period in time the current administration thinks is great. Thanks Elaine for putting him and his fake politics in its place. 😒 Not. Tahday!", "thatboysatrip": "This was so necessary! Thank you 👏🏽", "abesipr": "We need the Elaine's of the world on TV. Whew the misinformation...the agenda.", "royceinnewyork": "👏🏾👏🏾👏🏾👏🏿👏🏿", "tiannekj": "say that!", "e_bakes": "🙌🏼", "mom49_journey17": "I’m calling BS.....y’all should have voted him off for pretending he did not know the Celine Dion look", "gusabyvictoria": "Sergio means well I think, but it also feels that he’s using social issues that while there is a need for us to address these, should not be used as a crutch to help his craft stand out. This is the second time he’s brought up political topics to the forefront and yet misses the 360° view. Clearly he feels the need to address these problems we all face with, but he really needs to do his homework before he can voice his opinion.I think he has a good product already and does not need to find something else to add to it in order to stand out.", "kcsorg": "A WHITE person could have said job, car, kids in the 1950s...", "cityspeakphotos": "Whoa I missed that", "brookiestardust": "Your critiques are always perfection. This one was perfection times 1000. 💜💜💜", "thejessicamillin1111": "👏🏽👏🏽👏🏽👏🏽👏🏽", "feliciaervin99": "I was happy you got his ignorance together. He’s talented but quite self centered.", "seanazainab": "😍✊🏽 get him TOGETHER!!", "damalit": "JEEEEESUS!", "kaylaviva": "Holy hell, what a lame! But you read him like a real Queen 💖", "barbaraannsolomon": "🔥🔥🔥 that was nutty", "londonduvall": "Honeeeeeeee! When I watched TG is episode I said ‘Sergio!!!! Shut your mouth! You can’t possibly be about human rights and think the 1950s were good. Sit Down Sir!’", "urbanbuppie": "🗣thank you Cousin Elaine!! 👏🏽👏🏽 50s?! TUH. Glad you gathered him", "styledtherapy": "🙌🏼🙌🏼", "joanmorgan": "You know I cheered outloud, like you could hear me @elainewelteroth Like I told you at Sundance, it’s better than ever 😍 ✊🏽❤️", "julzbrandnewz": "💯", "zita.dasillva": "This man speaks only because has the mouth.No brain!😲", "lajefamorena": "Wth?", "roxgood1": "#airtight", "texturegoddess": "Point blank periodt 👏🏽👏🏽👏🏽", "leahbellejowevick": "😂😂😂😂", "tbroadnax": "You go girl", "mariamanuel_martins": "Looove project runway", "juhyl86": "Hellloooo. Woof. Dear me 🤦🏽‍♀️", "shawnawhite": "I literally died when I watched this episode... he’s an talented designer who needs to STFU! 👏🏿bravo for speaking up as the rest of the panel sat in silence.", "kastle8": "@graylinlucas 👏🏼 Elaine!", "jgidesign": "“Stick to the fashion” 🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️", "rosssatterfield": "READ TO FILTH!", "the_justess_": "Wow. Thanks for educating him 💯❤️👏🏽", "klew915": "Not on today!! Thank you👏🏽👏🏽👏🏽", "aliciacpowell": "Yup! 👏🏾", "mznik_c": "I do not like Sergio. His arrogance shadows his work.", "ajoy213": "🦗 🦗 🦗", "danielleprescod": "Lawddddd", "b.mcannady": "When you said this to him I was screaming. So happppppy you said something and used your platform. ON POINT TO THE T! ✨", "naionyx": "You tell em elaine!", "lindsay416": "Lmaooo wtf", "eighth_house8": "Whew. Wow. 🤦🏽‍♀️", "laurieanncurtis": "Well said Elaine.", "itsalexiiss": "I hope y’all sent him home.", "seraybon": "Yesss! Represent Elaine! I watched it when the episode was broadcast and loved it! Love seeing it here too!💕", "caraelisetaylorr": "the way you look down at your notes is really it 😂", "kindness_punk": "@janesvstheworld OMFG ELAINE!!! 😂 GET HIM! 🔥🔥🔥", "therealtorroy": "Yes honey!!! You told him. What a fool to think that the 50’s were great and to be foolish to say that to you!", "mscristina": "“STICK TO THE FASHION!” 👏🏽👏🏽", "killa_kara": "Wow he’s got to be joking 😩", "fashionably_jay": "“ somebody had to say it “ OKKKKKKKKKKAY", "avantgorgeous_": "Thank you! 🙌🏾💕", "shessoblunt": "yassssss. i love that no matter what you will continue to unapologetically be YOURSELF even in rooms of people who don’t look like you and when it makes others uncomfortable. you are a MOOD ♥️", "pelsworld": "Phahahahahhahaha the shade of it all 🌴🌴🌴", "bywjudith": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽❤️❤️❤️❤️❤️❤️🙌🏽🙌🏽🙌🏽", "nitasw33ts": "Soooooooo I love you way more now 🙌🏽🙌🏽🙌🏽", "demandaxo": "I stan for you and that straight faced clap back. Got him together so fast.", "liasfiligoj": "Everything about this moment was cringey", "pasavery": "YES! Speak!! 👏🏽👏🏽👏🏽👏🏽👏🏽", "xxtoyxo": "Lolllllll", "dulcis_puella": "YESSSS LADY that was ridiculous. Thank you for not letting that slide. 🙌🏼", "v_nassty": "I can’t stand his ass lol", "chelseany": "I LOVED this moment!", "jerijerijerijerijeri": "Never liked him. Every week is another wrong move. Thx for lighting him up 🔥", "officialkayed": "You are a national treasure my dear!", "afterrdarrk1": "He is a dumb ass being Hispanic how would he know about America being great again smdh", "yepitsmeagain": "👏🏾👏🏾👏🏾👏🏾👏🏾", "more2jaybee": "✊🏾🙌🏾🙏🏾❤️", "dunn_naturally": "@stephannwong somebody had to say it", "sogona.sacko": "Chaaaa how did I miss this episode? He was serious? She was so calm and poised - I could never", "steph_denise": "I love you for this! Thank you sis! 💙", "micah.pls": "Bye wig!", "gabriel_williams1": "“Stick to the fashion.” Whew. I felt that.", "drkarenwolfe": "The 1950’s for women ??? Ah .... let’s not go back there ! You were on point @elainewelteroth", "christinadeetopacio": "BOOM", "mrskennie_p": "Got him right together. 👏🏾", "deidre.manier": "So appreciate your voice and point of view on this stage of Project Runway. Thank You", "septumpapi\nVerified": "Verified", "mrscon19": "Yeaaaaa. Watching that episode...😳...", "mredoublelismyles2": "@jdiorwil ✊🏿", "akilahsiti": "I was so thankful when you said this...Stick to the fashion!", "deeptinyc": "This cannot be real!", "kleighinnc": "THANK YOU", "maraakil\nVerified": "Verified", "chippedpolish": "Sergio is ridiculous. Just design the damn clothes and quit all the extra bologna and contrite narratives. It’s so pretentious", "supadupacurl": "When he said 1950, I fell out. Sorry Sergio, what? For who? When? WHERE?", "jskystyle": "🥴", "jovancarrington": "Get him off!", "brooklynish_k": "This moment ! I knew he was about to get it from you! 🙌🏾", "_ambro": "☠️", "kimberlyrose51": "Ooooof!", "lakimmiecakez": "I ❤️ U!!!!!", "mamalizloveslife": "PREACH. ❤️❤️❤️", "borderish": "I was so through. MAGA and fashion have no business being in the same sentence. The 50’s in America?!!! So uninformed, yet so arrogant. Ugh. 🤦🏽‍♀️", "madelinedistasio": "He is...just not it, and I'll leave that there 🙄 I wish you didn't have to get him together but I'm happy you got it done", "nikaliye": "STICK TO THE FASHION SERGIO", "vennyetienne": "🐸 ☕️....ouu this Lipton tea is good and hot. 😂❤️", "claredaly": "🙌🏼🙌🏼🙌🏼", "i_am_ledjen": "As soon as you looked down I knew it was OVA", "nmkourouma": "No he did not? ....Yipes. Knowledge is power. Lawd.", "butterbyboosie": "Humph humph humph...this is what it looks like when try to do too much! Design clothes and leave the \"informative messages\" to someone else! 1950's boy bye! 😁😁😁", "_elle.elleg": "👏🏽 👏🏽 👏🏽", "tiffani1820": "I absolutely LOVE you! #ohtheshade 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "miss_nikkia": "I was SO glad you said it!", "thetraceywithane": "He’s offensive and when his designs aren’t HIDEOUS, he opens his mouth and MAKES THEM HIDEOUS! Like NOBODY on either side of the border wanted to wear his other dress. 🙅🏽‍♀️", "vashtie\nVerified": "Verified", "nowhatsyourinstagram": "You can just see that internal cringe 😬. Let's all get this straight - there has yet to be a time where it was great for ALL.", "thecarterreport": "Thank you for showing up, for us❤️✨.", "thelondonchanel": "He should’ve been off long ago", "monica_hernandez_916": "Thank you @elainewelteroth for being factual. From my side of the screen I felt pride for you. You were being honest and holding a space for all of us. 👑", "ggmadeit": "🙌🏾", "lauralovelynyc": "I cringed when I saw this. Your critique was spot on and apparently a needed word because this designer was clueless.", "blondbornleo": "I can’t with this guy 🙄", "yayamurphy5030": "America has never been great. Our ancestors taught us to press on...", "myk_saynt": "😫😫😫😫😂", "shavilewis": "“Thank You @elainewelteroth “-ShaVi", "reginaldla": "All Tea. No shade. 👏🏾👏🏾", "joellemeaghan": "👏🏾👏🏾period", "kifayate": "Oh really Kerli did the \"I told ya\" move - now that's a classic Becky move 🤣🤣🤣🤣🤣", "_rello": "I remember cringing during this episode 💀", "destineedenise_": "Thank you for saying what all of US were thinking.", "arielscg_": "I’m so glad you read him for this! 🤦🏾‍♀️", "ohhmycharlayyy": "IT WAS AWFUL AND a terrible justification for an unoriginal piece of work", "balmain_zipper": "You go ELAINE ! 👏👏👏", "lisakay1215": "Put him all the way on read, and we thank you for it.", "aliciaaswat": "Yes @elainewelteroth you let him have it perfectly! 👏🏾👏🏾👏🏾👏🏾", "parkerkithill\nVerified": "Verified", "mamarhon": "I was so thankful that you told him what was on all of our minds!! Thank you @elainewelteroth! 🙌🏽🖤", "melaniervogel": "@domplaysbass", "beths_d": "We need more of YOU🙏", "kimberley_stang": "@abbstang", "iamsaraspeaks": "You betta educate! So sad we all still have to explain things but I’m so proud of you", "lovetiffanylenore": "Thank you for your voice @elainewelteroth 😍", "taelanaomi": "I was sooooo grateful for you speaking up in that moment! 🙏🏽🤗", "abinksalot": "🤦‍♀️ literally cringe when he opens his mouth each episode", "nattidd": "😂👏👏👏👏", "sagalmuse": "Yikes 😭 @shamasalehh", "_destinyyy237": "Girl i LOVE an elegant, repsectful drag. “Stick to the fashion!!”", "tracy_cpa": "👏🏼👏🏼👏🏼👏🏼 I stood up to clap at this scene when I watched this episode.", "chaoticklowy": "👏👏👏👏 Yes.", "denarenea": "I loved you when this happened! It was a huge highlight of Project Runway!! 🙌🏽", "_jada_x": "Bye. Throw the whole contestant away.", "tashnikol": "Teach him! 🔥💞", "desiree.png": "Yep, he needed to be corrected. His cultural lens is extremely narrow", "jasminenola": "When you lowered your head I said welp it’s over for him now", "ms.anngee": "I Mentally Gave You A Standing Ovation......ugh his premise was just IGNORANT & MISINFORMED", "faithful813": "Get him girl!!", "artsie_fartsie": "He tried it. 🤣", "johnpaulcc": "@mbgberg Hahahah remember how we were really snapping our fingers when @elainewelteroth clapped back at him!", "adcolor\nVerified": "Verified", "therealsessilee\nVerified": "Verified", "jojo_son": "I loved that you called him out! He uses his political statements as cover for his bad designs and it’s disgusting!", "taiwo.ade": "FACTS.", "mikeskyler": "As I watched I was just waiting for u to read him down. Thank u for reading so eloquently and professionally. A tru Queen.", "coco_onthe_gogo": "That dude STAYS putting his foot in his mouth... 🤦‍♀️🤦🏻‍♀️🤦🏼‍♀️🤦🏽‍♀️🤦🏾‍♀️🤦🏿‍♀️", "kenzie__barnes": "BOOP 👏🏽", "monicawisdom": "Precisely", "pictureniecy": "Love you ❤️❤️❤️", "yay_taylor": "New phrase: “Stick to the fashion!!!!”", "janetelainebooth": "Hes a very good designer....but he stay in his head! I never want anyone to not speak their mind but he just needs to do research and edit.😫 I say that with love.", "ohkey.bye": "It was about damn time & you were just the person to do it. You executed it beautifully from the construction of your rebuttal to your delivery lol. A head to toe read bby 😂", "lonavincent": "Let him know 🔥🔥", "carena_hailes": "Wow", "nilublue13": "Wow.", "breakfastattiffanyss": "Loved this episode, thank you!", "mel_mittens_": "😍 A classy read", "misspdot": "So glad someone said it. Also loved your whole look on last week’s show. The eyeliner, the bun, the feather pants !!!😍", "ktkimanzikamwaki": "👏🏽👏🏽👏🏽👏🏽👏🏽bro stick to fashion and also read an inclusive history boookkkkkk", "genavievealkana": "When your head dropped I knew you were getting ready to get him all the way together! The fact that those words even came out of his mouth were shocking!", "_j_e_a_n_i_n_e": "Hope he got some castor oil for those edges you snatched....😩", "dabsofab": "And it was ugly.", "thegentleman_89": "Thank you for this!!! Someone had to say it!", "tracirublemft": "This was such powerful gravitas! Not doing labor. I was talking to Parker Palmer about confronting someone around bias blind spots. He shared there is self righteous which is about our ego and there is righteous speech which is about occupying our truth. After watching this episode I was like \"oh there is righteous speech\". What is more, my two sons were watching...your power landed and is rippling out.", "shellbell1957": "Sergio needs to go bye bye", "gabyhui": "YIKES it was so painful hearing him speak", "_madamelee": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "__fr0sty": "love you", "lucy.rupert": "Such a weird moment. You were so well spoken without being necessarily polite. Hero!", "mr_goodmar": "I love you!! ❤️", "jeg_style": "🖤🙏🏾✊🏾", "mz.farrah": "What an idiot", "richellesamuel": "What!!! I applaud your cool calm demeanor in educating this man. To say I am shocked beyond words that he didnt understand the implications of his statement is an understatement. Wow wow wow!😯", "theblackhairexperience": "👏🏽👏🏽👏🏽", "bkdesigner": "His ignorance is appalling. So glad you were on panel to set his ass straight. ✊🏾", "sooperd": "‼️🙌🏾‼️🙌🏾‼️", "kenyalikeafrica": "Yes! Thank you for being open & candid with Sergio. That was such a dumb thing for him to say. He may as well said, make America white again.", "cyn_amour": "👀 Off with his head 💀", "martibuckley": "I can’t believe he said that ... 👏 to your response", "latinaismyname": "Important moment in black history...Elaine getting this man togetha!", "sincerely.shana": "🙌🏽🙌🏽🙌🏽", "suusbrinkman": "Thank you! 🙌 I couldn’t believe my ears when this happened", "dymondigital": "✍🏾⚫️", "mrs._gainingpatience86": "Check him!!! 👏🏾👏🏾👏🏾👏🏾👏🏾", "claudioandradejr": "✊🏿✊🏿✊🏿✊🏿", "loganvaughn30": "Thank you🙏🏾", "moevonnn": "👏🏽👏🏽👏🏽", "mynameisntjoy": "Ouchie", "xojaro": "👏🏽👏🏽👏🏽👏🏽👏🏽", "dd.smithhh": "Go off Elaine!!! This moment was needed👏🏾👏🏾👏🏾", "yakimadavis": "Phenomenal Woman @elainewelteroth 💜💜💜", "yosoybrianna": "👏🏽 love that you maintained your class and poise while still getting him alllll the way together!", "christiancowan\nVerified": "Verified", "im.amandamc": "🗣Go off ❤️ #NotMyPresidentDay", "takararobinson": "👏🏽👏🏽👏🏽👏🏽👏🏽", "tita.dee": "👌🏾👏🏾👍🏾❤️That's my girl!!!!🔥🔥🔥🔥🔥", "nataliegarzastyle": "Would love too! Is it streaming somewhere or is there a marathon? I didn’t find it on Hulu. 💙", "kristaisms": "I was so thrilled you put him in his place. 👏👏👏👏", "maze.marie_anais": "👏🏼👏🏼👏🏼💞💞💞", "fandersong": "Definitely enjoyed your response when this originally aired", "mel_olivia": "Thank you 👏🏾👏🏾👏🏾👏🏾👏🏾", "kal_mont": "Elaine LMAOOOO", "smashsilas": "Favorite read! 🙌🏽", "dgray523": "He’s such a self righteous ass. So tired of his comments glad Elaine put him in his place.", "dana_labloom": "I’m sick of Sergio ... he’s by far the most narcissistic contestant Project Runway has ever had. Every time he comes on the screen I roll my eyes lol", "hoodgooods": "she was disgusted lol @bishopteeee", "happilyk": "\"Thank you, Elaine.\" ~POC 🖤", "pinksandcastle": "Sooooo glad you checked him in the most classiest way!!!", "m.bule": "This is why that afro latino debate in spanish speaking cultures is SO important.", "oh_toshiba": "When he made that comment I was floored and believe if @elainewelteroth hadn't given him that history nugget, that the panel would've missed that moment to educate this guy. This is why representation matters, for moments like this. Thank you!", "frenchgirlnyc": "👏🏻👏🏻", "ujustgotlawyered": "Elaine 👏🏾👏🏾👏🏾👏🏾👏🏾 you are everything!!!", "misalexlis": "You spoke up!🙌🏾👍🏽👏🏽👊🏽👌🏽", "mstricia23": "I’m not sure he even cares about the causes that he brings up and then links to his fashion. Personally I think it’s just a shtick. But with grace and ease you basically told him to cut it out! Stick to the fashion 👏🏽", "jessiealph": "You got him too correct lol. But he still doesn't get it because it never affected him nor his family. He does great work but his attitude makes me cringe.", "yb_2": "You served him. ❤️", "thali.thali": "One of my old coworkers said the same thing. I had to let her know it wasn’t good for everybody. That’s just cementing the fact our schools are failing all of us when it comes to@the true history of the US.", "alexandriademii": "👏🏾👏🏾👏🏾", "yungfleur": "Gathered him so eloquently! 👏🏿🌺", "margery222": "oy vey", "allilovezto": "Yessss Elaine!", "elizaukpe": "Savage ♥️", "cynm67": "I LOVED the very controlled read. Drop them facts my lady 🙌🏾👏🏾", "denissec23": "@leticia_catalina", "ikrys526": "Yessssss Elaine! You spoke so classy, so elegant and are just so poised and was thankful that you made that statement because it was offensive! Thank you for your LIGHT!", "nikkiliciousp": "Ridiculous!", "bowtifullife": "YESSSSS", "milliecakes1920": "He’s soooooo annoying and wrong but can sew his ass off...”stick to the fashion” 🤐", "superstarchick": "I loved how you spoke up on this scene! Thank you for being real! ❤️", "charmazinnng": "Boop.", "helloaaisha": "You are so amazing! Having you on the project runway reboot has given the show so much energy again", "aryeola": "LUV U", "kingcoward": "Bloop! Lol.", "apgarcia": "Thank you for shutting down this guy and educating him on the FACTS! 🙌❤️", "fatboysrock": "Oh girlllll. You in danger molly.", "_brittanyclay": "Watched this live and just hung my head when he said that 🤦🏾‍♀️ Sergio, you really make pretty garments. Please, as a fellow Austinite, immerse yourself in the social justice world and spend time being a student to equity work. It would help you and your brand so much!", "paulamc555": "Lol everybody cringing", "roxiebk2ja": "@elainewelteroth had to make that same point a staff meeting. It turns out a lot of people think that the 1950s was a great time in America’s history. 😟", "iambryanhaire": "Loved this read.", "giannie_couji": "Obviously not aware of Segregation, #LearnYourHistory Iam Baffled", "kristin_bria": "Stick to the fashion!👏🏾", "miss_symone10": "So happy you called him out! 👏🏽👏🏽👏🏽", "shereesalchemy": "When you dropped your head we knew he had no chance. Thank you queen!", "lkmaxime": "Interesting how his logic was all about what money could buy and not about actual people living half lives by being oppressed and forced into segregated living...😒", "daveonajaneice": "So glad you said exactly what I was thinking!", "karifaith10": "Wayment.... didn't he have kids' names who died in ICE custody embroidered on a previous look? Now he's referencing MAGA??? #makeitstop", "vhalvy": "Oh Sergio 😳🙄 glad you set him straight!", "verymuchskye": "THE FACCCCE💀”aight imma...light his ass up”", "simply_brittany01": "So glad you didn't let him get away with that.", "curlybirch": "Tell em Elaine!", "kmjensen77": "👏", "harlemwrite": "I thank GOD you are on this judging panel and that you were able to immediately check this stupidity. Sergio needs to stick to fashion and assuming he’s a person of color may need his cars revoked. Just tone deaf AF! #NotMyPresidentsDay", "pkd_19": "@elainewelteroth A-EFFING-MEN ugh the audacity 🤦🏿‍♂️😏 @projectrunwaybravo", "safiyama": "👏🏾👏🏾👏🏾👏🏾", "gor_jessjagger": "🙌🏾🙌🏾🙌🏾", "mzrossboss54": "Got him all the way together in an elegant way! #poorliltinktink 🤦🏾‍♀️", "redd_flame_": "🙌🏾🙌🏾🤦🏽‍♀️", "magically_melanated": "I knew you were going to gather him up when he started saying that foolishness. Stick 👏🏾 to 👏🏾 the 👏🏾 fashion 👏🏾", "creating_magggic": "I hope he’s eliminated this week I can no longer stand looking at him.", "iam_j.raul": "Bumbacloooooot 😂😂😂", "bmfh.us": "You make so proud, so eloquent and intelligent. Thank you ❤️", "stylishsista": "I yelped when I watched this a couple weeks ago 🙌🏿🔥😘 You bring everything I didn’t know I needed to this show. thank you.", "tiaranoelle": "Prime example of he should have just sat there and ate his food.", "streetstyleteller": "Yassss girl ❤️", "toastedleather": "Yesss caption!", "jasminepierce": "Thank you for speaking on this!", "bekingmedia": "Get him Elaine", "farahpink": "Bloop", "ewitiak": "Help us out Elaine, he's gotta go 🙄", "stephb_c": "He couldn't care less", "faithmariam": "Thank you sister for speaking up! Crazy!", "nola.ish": "Bless you chile! 👏🏽👏🏽👏🏽💕💕💕", "kjoelle__": "When he said, “some factual information about the 1950’s” I knew it was all downhill from there 😫", "laree_mack": "👏🏾👏🏾👏🏾👏🏾 Thank you", "jadericks": "Haaa!!! Yess", "theholytrinitee": "He deserved this drag", "yours_chuly": "“Stick to the fashion.”", "sweet.indigo": "Factz!!!!", "moi.monitricemalone": "He got one thing right “backwards!” His logic, mindset, politics and his fashion! Collectively each are full of holes, poor taste and outdated! 🥂 #projectrunway", "aurorajames\nVerified": "Verified", "missandohiobred": "I saw that episode(and EVERY episode; I’m a super fan😄) and sass soooo glad you got him checked! How dare him proclaim to know about the greatness of a land that held us back, beat us down, and stole us!!! @elainewelteroth", "basiebaby": "Thank you!!! Your voice is needed on Projected Runway and for the culture!", "a_proudjew": "TRUMP 2020 ❤️ he is my president", "alexisdenisew": "👏🏾👏🏾👏🏾", "el_veee": "I love you so much. 🙌🏾 Your presence on the show is absolutely necessary. Thank you!", "stinajones9": "@am_jones32 @kathynagunst I love everything about her!! Now lets follow directions and have a marathon! 🖤👑", "jnetty_": "✊🏽✊🏽✊🏽✊🏽✊🏽", "gdw1203": "👊🏻", "crazybluebunny": "Wow. I watched that episode but must’ve zoned out when he started speaking. The fact that in a previous challenge he exploited the names of ppl who died in ICE’s custody to basically celebrating this awful administration’s slogan and talking about the 50s were a good time. Wow.", "justquynn": "I LIVED for your response to him on this episode. ❤️❤️❤️ I wish I could hear what you were thinking when he actually said it lol", "vidadejeremiah": "“2.5 kids” 😩😭", "chelcglenn": "🙌🏽", "oya.jax": "Saw this when it aired....what an idiot. You told him TF off.", "theryannrichardson\nVerified": "Verified", "taryn_ej": "That wasn’t even an original design smh I hope people learn from these kinds of mistakes.", "litandmore": "She said what she sad.", "zcarrington_": "Period pooch", "aliciatenise": "I’ve watched this five times now and it’s still amazing", "botanica.lyssa": "....and I OOP 👀. Read him clearly and concisely. 👏🏽", "iam_bridgettetyler": "WOW. Yeah what you said \"Stick to the fashion\" PERIOD", "adamrm12": "Oh my god I can’t with this moment, imagine being the only person in the world that hasn’t seen the Celine Galliano tuxedo moment in HISTORY!", "provifulp": "You better preach!!!", "nadeenalaouie": "lmao I was waiting for you to set him straight 😂", "dawntoya": "As soon as he started his speech I was like, “I don’t have to get upset... Elaine will get him.” Lol", "thatsavagegrl": "Thank You for this Black History moment! 🙌🏾", "yasminahmed03": "#unapologeticallyblack 💜", "unabrujanegra": "But your friend is married with... 🤦🏾‍♀️", "debonairpierre": "Love you for checking him on this! 👏🏾", "theekatdavis": "👏🏾👏🏾👏🏾", "ericaforstadt": "❤️❤️❤️", "maggiemarilyn\nVerified": "Verified", "_ephphatha": "Smdh.", "masovaida": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "kkillaz": "Chillleee you read hom with class.. #keepitaboutthefashion", "lexo127": "I absolutely loved your response when watching it live! 👏🏾 👏🏾 👏🏾", "jewblackishchick": "👎🏼👎🏼👎🏼 hated it!!!!", "aershe": "🙌", "htwngirl": "Thank you! This was so cringe worthy. I appreciated that you put this back into perspective! 🙌", "mechelly": "It was that moment u lowered ur head that I knew u were preparing to set him straight 😅", "aquarianwhite": "You are simply the best", "pantorabridal": "Let us all say Amen", "la_white_way": "1950s?!?!?!?!", "snalostyle": "U told him 🙌🏾", "shetravelsplus": "He is so annoying with his faux messages made up on the spot. In the 1950 he couldn't live his lifestyle either...ugh! Good designs but no sir.", "blackgirlmagicmua": "I love u for this. Never let a damn thing slide. Ever.", "the.black.pearls": "🗣say if one more time for the people in the back. Thank you👏🏾", "brifromthed": "👏🏽👏🏽 I appreciate that you said something in the moment. 💗", "leaxrenee": "Lol I almost fell out when he said that😂 tried it.", "the1socialite": "I was SOOOOO glad that u got him right together!!! He has been tryin it all season", "toshpointfro": "😂 I shouldn’t laugh but yeah.. I chuckled a little.", "darrenallendunn": "🤦🏿‍♂️🤦🏿‍♂️🤦🏿‍♂️", "briannahb24": "🙌🏾 🙌🏾 #sticktothefashion", "o_kaybaibee": "🤦🏽‍♀️", "dwan2arnold": "LOL I loved that and it was exactly what I was thinking", "jasminimani": "This🙌🏾", "kdyoungoddard": "Thank you 🙌🏿", "theabbeyroads": "Thank you for your candid and real feedback with Sergio on his messaging, but also being real and candid with Victoria and her strange choices and attitude during the evals. The way you critique gives me some hope that the show isn’t completely rigged or just falling into typical reality show gimmicks and drama. Thank you! 🙌💖💛", "cmichelleinc": "Preach sis!", "mrs.santini": "THANK YOU 👏🏻👏🏻👏🏻👏🏻", "lindseymachelle": "This isn’t funny but what the hell 😂", "samyahafsaoui": "amen 👏🏼"}