{"natplays": "Finishing book 2, continuing on being/becoming the storyteller I am and sharing the tools i know for transformation so people can create their lives! Bye bye playing small hellooooooo world... And since you asked: Writing something for teen vogue / storytelling at your summit is on the bucket list too. Thanks for all that you and yours are doing and inspiring!!!!", "jenfrytalks": "My plans are to apply for a PhD program in the fall of 2018, right after I finished my masters in August 2018. I am going to be asked to speak on black student athlete issues", "squareshapedlove": "FANTASTIC photo!! So much joy!", "thetechbarbie": "@elainewelteroth Having the #1 Beauty and Fashion Social Platform; that's a one stop shop to access quality beauty and fashion professionals worldwide💄🛍💅🏾💆🏾‍♀️💇🏾‍♀️ www.mystyleauthority.com", "nateishascott": "To become a successful freelance journalist😇🙏🏾", "embracethej": "Showrunner of a comedy show I have in treatment stage at a major network. And so it is.", "cushcloud": "Wealth health prosperity abundance love ✔", "sharyon_anita": "💍🌠", "tinablife": "Full time with my home organization, color and lifestyle blog.", "blakemorsi": "To get paid to travel the world and build on community cohesion and sharing the voices of the unheard ✨", "mizani\nVerified": "Verified", "coachcaryl": "Taking the Unstoppable Girls Foundation to the masses! Let's stop bullying worldwide, will you join us?", "sammiegurle": "💜 this photo ❣️", "_jaysaid_": "@siocnarf_aim", "kimmykimfree": "Be an amazing inspiration and performer", "amandasandersnyc": "Yes!!", "ebonyanderberg": "So beautiful", "talchemerinsky": "Lovely smileee gorgeous🌹", "patanisha": "To own that skirt!", "cecilelevee": "Continue to travel the world first class and own a home in Europe", "lifewithemmajean": "To finally have a team that believes in me and challenges me to be better with my music and my writing, and to get back into my modeling without Shame just because I’ve had a baby. I will be a successful artist not just increasing my desirability, and bank account, but also positively impacting young men and women. Encouraging them to speak their truth, acknowledge their faults and issues, and blossoming into excellence as we all should...", "flinm48": "I like this one", "fashionid_nyc": "You have great taste 💚", "ty.bsr": "Your hair is a curl above others, I love your look & your work sista, thanks💙✔", "shanahasagram": "This year is the year of the all around Glo Up. Treating myself to looking and feeling my best, continuing to become a boss bitch in a new field and getting my adult on and handling responsibilities that I’ve been planning for 🌈💥", "marisa_del_mare": "@elainewelteroth not only are you a true role model for women in the African American community , but all women. Enjoyed the segment on @nightline 1/3 - keep doing the damn thing @teenvogue #goals #2018goals #2018goals💕 #worldpeace #peaceforall", "missdivanicole": "Take @four.brown.girls to the next level and be the go to for black keynote speaking events.", "sluttyslutsoul": "be happy and healthy, focus on my artistic grown and a consistent motivation to produce and innovate, create my first zine that I am confident in enough for publishing, complete the beginnings of my collection, expand my following, financial prosperity for my family, developing stronger relationships and friendships, no toxic people, more vocal and articulate on issues that matter to me", "orlane_gmt": "Entrer dans l'école d'ingénieur de mes rêves ,m'accepter et avoir plus confiance en moi ^^", "scoutthecity\nVerified": "Verified", "styledbysharra": "Stunning ✨💖", "dahlia_gill": "I want to share and make more of my own art and share more of others art and immerse myself in the poetry made by others", "rylliemd": "Grad school this year 🙏🏼", "tradestjamco": "It’s going to start with a feature in Teen Vogue as a black woman entrepreneur. Next, our jams will be in Whole Foods before the spring. Summer, Fancy Foods Show where our jams are going to POP. Last, quitting my 9-5 by fall. 🙌🏾", "threelittlebrothers": "Beautiful 💕", "sitaralong": "Yes queen", "niceguyband": "Love this. You’re a boss. Bringing laughter and awareness with MUSIC.", "daniizle": "I get a badass job", "oddhype": "be as creative as possible & inspire. & be a cinematographer 🦋", "caitlin.onie": "New job offer", "sunny_adcock": "Write for Teen Vogue 💛😊", "villageluxe": "We’re so ready! ✨🙌✨", "rafiphi": "Luc Rome start program", "string_words": "To write, to be heard, to be kind 💜 bless you for such courage x", "the_stylelinguist": "A very successful year in my fashion and style endeavors", "loyalone_skp": "Happy New Year as well chief💖", "gloversix": "Finally fulfilling my creative needs. Stay tuned! hippie, hip bags ✌🏻 Breaking the stigma on the daily because practical always wins @handsfree.hippie", "flybrowngurl": "Making myself and my mama proud :')", "robynhood_05": "Growing my online publication and becoming a fashion influencer!", "mylifeingray": "Continue to work on conquering my fears. Thanks to you!! Happy New Year!", "fanirondon": "TEDx on 2018💪🏼", "undercovercass": "Create a podcast about freedom! ✨", "bienabye": "To my concept of “Creole Excellence” with the world 🌎", "tiarosalie": "My 2018 dream is to continue stuntin and impressing myself everyday, excel in college, and make my parents proud", "sajsha_okereke": "My dream is to continue to develop my non-profit organization dedicated to empowering women by merging excellence with elegance, and to have us featured in Vogue, on BETher, and at the 2018 Essence Music Festival, OWN, the Times, and across the globe. I speak this into existence! #thisismyyear", "ms.morangel": "Travel more and worry less.", "brooklynbloomsnyc": "Becoming THE florist for my people!", "luvandkiwi": "I want the Tish version of your 2017 + Yara’s 2017 👍🏽🤞🏽🙌🏾", "kmaddox113": "To open a juice/smoothie bar...", "jadeb30": "I will be a successful model", "acscollins": "Get financing and distribution for my comedic webseries GOALS N SHIT, attract buyers to my upcoming artwork, book more series reg & feature roles annnndd, most importantly, more presence, joy, less stress and anxiety along the way.", "proenzaschouler\nVerified": "Verified", "dionareneee": "I will not be awkward anymore lol", "ispeakstyle": "Get it done at LIM College so I can work for you ✨", "lorivaughn_": "Finally pursing the career I really want, and getting to write for a publication I admire.", "marlabspirit": "#elainewelteroth I'm ready to help heal the world and make people especially women feel beautiful and alive through my music @marlabspirit 😙😙😙😙 keep shinning!!!", "maryanhaye": "Pursue more acting and writing opportunities and continue to do what makes me happy. 😊", "dorothyjadeo": "Can't wait to see what you're up to for 2018 🤗", "mkistler7": "Gorgeoussss friend", "boothfairyatl": "Healthy prosperous New Year!!", "redoriginals": "Me driving up 2 my mansion... ✨👌", "abiolafasehun": "🙌🏿🙌🏿🙌🏿🙌🏿", "mrsorellana": "@tashtashb That sounds so good! I would buy it!? I pray it leads to a bidding war and leads to you being on the NYT best-seller list!", "sheldonmwilliams": "I will executive produce a series of home renovation shows for HGTV and OWN in 2018", "emiliamcferren": "I will be proactive about SAT prep and other prep for college and get into the one that is best for me!", "thandij344": "Rock my internship and get accepted to my dream job @simonandschuster", "lyzaster": "This is the year I publish my book 🤗", "jolietoujours50": "Leading perennial women into extraordinary lives on their terms!🎉✨💕🙏🏽", "amodernvisionary": "Launching our podcast and interviewing you @elainewelteroth #ready", "mikaelamclark": "Finish fashion school and finally start my online clothing store!", "ashleybehnkedesign": "@elainewelteroth Oh, so you’re going to make me pause my IG scrolling to get all Habakkuk 2:2 on the people??🧐😄 I shall. 1. Meet & exceed product development timelines for my startup (@spotloc8r). 2. Onboard the right, talented first hires. 3. Serve beta clients exceptionally to begin accomplishing our mission of “helping creatives thrive doing what they love,” and 4. fitting in 2 joy and memory-filled vacations with my chirren and husband. That’s a quick snapshot😘. To you, may 2018 be your most magical year yet!!", "unravelpodcast": "Growing our community and becoming even better communicators!", "dory_jackson\nVerified": "Verified", "aphrolove": "Getting the job of my dreams.", "rebeccatembo_": "I’m going to develop my fashion brand, create another passive income, buy my fiat 500, clear debt, be healthy and have clear skin, begin learning mandarin and wake up at 5.30am", "sagegawd": "Moving to bigger place/ making more money/ having a party on a boat/ a family vacation/ yoga training/ more LOVE/ working with @socialworks_chi or @obamafoundation/ working to empower, encourage and uplift black women and girls !!!", "asita.philokalist": "❤️", "lineijinc": "Oh we’re ready! Let’s get to work making things happen!", "tamecohen": "@believeinbambara!!!! 🇬🇭 🌱🌍", "bydelaneydempers": "Improve my photography/start tumbling and ballet/Write more/Get the grades I need for college", "ohhmygeeg": "I AM A STRATEGIST FOR COMMUNITIES, RETAIL AND PLANTS. I am on a mission to make cannabis socially accepted as a resource for wellness through the best product in quality, brand and intention. 2018, imma GET IT BOO!!!!!!! Happy New Year, you’re stunning.", "tashtashb": "Getting an agent and publisher for my YA novel based on west African mythological mermaids. They were said to follow slave ships in order to return the souls of the dead back to Africa. 🙌🏾", "stylishcurves": "Creating a plus size fashion and media empire", "ritamk_": "READY! 🙌🏾", "mariahisonfiya": "Switch job industries! Beauty industry I’m coming for you 😘", "megfazio_": "Write my first book! 🙈", "iamtamikalewis": "Continue building my private therapy practice to help young women love and use their voice!", "hayleelujah": "Grow my hair out. Finish a dual Masters at 23. Get a job writing/editing articles about women. Pay off my credit debt before I have to start paying student loans. Fail big. Find joy. Keep pursuing freedom.", "shelton_boyd": "I’m writing for Teen Vogue 🤷🏾‍♂️", "reinabrunsonturner": "Quit my full time job", "hollyulasovich": "Feeling at home with where I am, finding my place with work, figuring out a way to grad school and beyond, contributing to community, expressing creativity (all while embracing family and friends). ❤️", "uptown_princess_": "Working for your magazine as a political contributor or social media manager🙌🏾 #mydreamjob", "rowanblijd": "Feeling happy and uplifted in mind, body and spirit.", "liviafirth\nVerified": "Verified", "kaylafory": "Start investing!", "anaisgaju": "❤️", "jessicajemmott": "The Lamp", "oldravenroberts": "More growth! Moving further in God’s purpose for my life!", "r.mattea": "Graduating from uni in the spring & having a kick-ass summer!", "juliasudol": "finish high school, move to nyc, start modeling, and grow in every direction possible!!", "masduende": "Write my first book. 👩🏻‍💻", "cashplease": "I may not have all that I want right now but I have all that I need. I have chosen to break up with procrastination and the idea of failure and trade it in for the reality of my visions and creativity flourishing in 2018 💕", "disapac": "😍 I want to work on a stage management team for a dope corporate event or festival uplifting black people!!!", "rizingdancer": "Communicating with God. . . Being present with my family. . . Believing on my value as a mother, partner, student, sacred being. . . Graduating with my Masters!!!", "90schildforever": "Do just one small thing that involves me love for music", "iluvlola\nVerified": "Verified", "kelci.michelle": "Consistency. I often start projects and don’t stick with getting them done. I keep it up for a bit and fall off, which makes it hard for me to get back in a groove. Trying to do better in 2018.", "best_parenting_tips": "Happiness", "tamumcpherson\nVerified": "Verified", "akinyiot": "I’m getting that motion graphics design job which will help me pay for my own place, take a vacation in Kenya and start chopping down those school loans.", "mariaetkindmillinery": "I’m going to sell lots of handmade hats in 2018 to all the New Orleans ladies!", "gogie1092": "Going to grow my part time real estate business. Summer 2018 in Nice and Antibes. And travel to Iceland this February or March.", "sharrrrr.narnarnar": "I'm working towards med school babyyyyy (not next year... but definitely in the 5 year plan) #speakitintoexistence", "sheneilmonique": "@therealshana yesssss Love!", "itsbritneynicole_": "Continuous growth with my blog and with my brand @herstylemedia 🙌🏽💫", "kidadabrown": "get a marketing internship 👏🏿", "alwaysjackpot": "Growth as a writer and to host writing workshops.", "kinebruniera": "Having my first solo exhibition with my «father» project!", "dreskuffs": "💯", "sandflowerpower": "Material and spiritual abundance for all of us! And creating music /visual art that uplifts the planet while reaching more people than I could ever imagine!", "csevolutionofstyle": "Excelling in my career and continuous growth in my blog! Grow our family and move to a new city. ☺️✨", "jessicacrockettxo": "♥️", "itsmesumayah": "Get an internship/job this summer!!!! Plus a 4.0!!!", "lamonstruita": "Get a real job, travel, make money, and go to the grad school of my dreams fully funded! Hopefully in Texas to do the program I dream to do", "varca.bridal": "Affirmation: Women will buy my wedding gowns and I will make her a dress to feel amazing and powerful and loved in! Here I come 2018!!!! 🍾", "lateciarising": "Expand the creative agency to 6 markets, launch production company, travel the world, THRIVE in whatever way that looks, for the healthiest, happiest and best version of myself", "chuefengy": "I want to meet you. And have a nice, deep conversation about life. I am going to chase my dreams with running as I hit the ground. I am going to be happy. I am going to work on my mental emotional and physical health. I am going to become a better more perfect version of me.", "theikonickay": "Jk, you said you just spend 4 years in college. Good luck!", "gluten.demon": "I'm graduating from high school in about 4 months so I'm trying to make sure I keep my head straight and get through it while keeping myself mentally and physically healthy. 😊", "mixedkidchronicles": "👏🏽👏🏽👏🏽can't wait for all to come in 2018", "chakalatebesos": "Getting a promotion and starting my blog!!!", "sandraostylestory": "Yeeesss!!!!!", "_craycrayshayshay_": "I'm manifesting ways to love, connect, and appreciate Black people all over the world. I'm doing so while monetizing the effort from a place of love rather than exploitation. 2018 is about to be lit!", "sophiatroy12": "Walking in perpetual abundance in my own life that spills over into my family and friends, experiencing true romantic love, leaving my current job and living my creative, artistic dreams that supports me spiritually and financially👊🏽", "xovictorya": "For @kevlarroseagency to become an influential Modeling Agency of color from Atlanta, booking and managing some of the best youth, werking 10times harder next year and of course to work with Teen Vogue!! 💖👊🏾", "legs_vs_theworld": "get my art published, whether it be writing or photography or mixed media. believe in myself. get my money right.", "mileshicks": "save my money in hopes of following my dream of moving to NYC and work in public relations or media relations. I want to also expand my audience for my blog and other publication work, and I want to find an entry level position or greater in my career field before I leave school because I did not just spend four years busting my butt for nothing to not have a greater purpose than to be a manager of a retail store or fast food chain (not that there is any shame in those jobs, but I feel that my talents can be used for so much more)!", "honestlytatianah": "TV appearances (yes, plural) in my 2018! #Journeythrough30", "__cayg": "Graduating college with a job, freelance photography opportunities, start working on developing a magazine", "allegraroberts": "Write the songs for my EP", "iamkiaya": "My business @blackandbold_ will be making tv appearances and be featured in print. It will also be in a few small shops. I will be making moves to do Black and Bold full time and not working a 9 to 5.", "sharongc": "Finally becoming full-time working actress ❤️❤️❤️ #weready", "allywright3101": "Beautiful", "chicinspector": "Building and cultivating a fitness community for women of color! 🏋🏾‍♀️", "iamericanoelle": "Staffed as a TV Writer!", "alysialjohnson": "confidence and strength. Reclaiming my time.", "love.wear.repeat": "New York City!!!", "chazzinniss": "Graduate college with a job in hand that pays me a living wage and let’s me follow my dreams.", "veesass": "Get published on @teenvogue!!! this will happen in 2018 👊🏾👊🏾👊🏾", "foreverr_clean1": "للباحثين عن الرشاقه حياكم كلين 9", "emilyaleece": "Get a full time editorial job in New York, preferably in beauty. @teenvogue would be the dream!!!", "therealshana": "Getting my internship at Google in January and completing Grace Hopper Academy✨", "dae_hayes": "Redefining hustle: Blossoming with Purpose by dropping my APP🌸", "coyapatra": "Working at Teen Vogue as a Fashion Editor 😊", "brandis.ohlsson": "Get my book published & a full on @ohlssonmgmt takeover ✨", "kiaraaasmiley": "Getting my career kickstart as a fashion editor! 💜", "shamani.s": "It would be great if I could just be you for a day😂", "gabriella.campen": "Law school :)", "psizzle65": "Clear skin, Strong relationship with God. Finish the rest of the school yr. with good grades, get a job that has to do with fashion , find a summer fashion design internship to learn about my future career. Turn JB frown upside down🤗", "the_ava_codo17": "I hope to successfully draw a piece art that incorporates love between all people", "thecramm\nVerified": "Verified", "zamedyzamzam": "Playwright and Screenwriter writing beautiful black and brown people from across the Diaspora, into the world.", "toriblaze": "To become an entrepreneur !", "desthefashioneater": "Happiness🙏🏾", "luis.ruizd": "hire me sis", "debbieope": "Journalist and lawyer!", "evedwards621": "Move from being a model to a writer for the BU fashion mag, then fulfill a lifelong dream of interning and eventually work for teen vogue. Gonna make it happen", "pinkveve": "A young adult author! ❤️ and business owner", "keepthefaithrich": "Work at E! News + move to LA ❤️", "malaikacrichlow24": "Start Caribbean Vogue, make my book a bestseller, create a series that incorporates the Caribbean Woman perspective @elainewelteroth", "harutekr": "Intern in Atlanta, get more into creative direction and visual storytelling, relaunch Femme Noire’s online presence 🙏🏾", "mesonjixx": "Spring and summer tour for me and my bandmates ❤️☺️", "goldengoosby": "I’m ready. I’m going to work full-time at a Chicago agency. I’m gonna get fair pay, benefits, and love it.", "jilianmolokwu": "Study abroad, get my own apartment, make self care a priority & land the perfect co-op ✨🙏🏾", "elise.ng13": "Good curls day", "aspireinspire__": "Study hard for second semester of grd 12 high school, graduate, Travel, get into uni, get healthy, and have a stronger relationship with God! ✊🏾", "mainatrakation": "To Act in worldwide life changing plays, movies, and films. To educate, learn, inspire and be inspired.", "mxnoblemoore": "Making real things happen with music and creation in general. Happy fresh start to everyone on this thread!! ✨✨✨", "theblondemisfit": "Full time entrepreneur and editor! 🔥🔥🔥🔥", "mzjaninenicole": "I will be globe-trotting, building my new startup, spiritually-expanding, health-first lifestyle, engulfed in love, booked solid for speaking engagements and business, shifting society and raising awareness via my writing.", "prettydecent": "I am going to turn this little idea into a BIG IDEA in 2018. Excited to move to New York and be closer to the art & culture I love. Ready to launch full forward into video, give all of myself to @prettydecent & be the woman my 12 year old self would be proud of!!", "thejeanniemai\nVerified": "Verified", "briannabria": "I’m getting my license", "luzelizaa": "😍😍😍", "tiffanimanigatstyle": "I will be booked solid in 2018 and the years to follow, in Jesus name 🙏🏾!", "bduran5": "Buy a place, take my career up another notch, read 2 books a month and improve my health 💪🏼", "thistleandsun": "Solidify/refine my photography style, and get a story published by Teen Vogue! 😉☺️", "gab_bel": "👌🏼👌🏼", "badesanyaa": "Have a great job, be closer to God, make my mental and physical health a priority, travel and meet people who uplift me and don’t put me down", "stelbel28": "Get a faculty position! @elainewelteroth", "alldayeeverydaye": "Write more, get my podcast going, and find a job that'll support me while I pursue 1 and 2. Oh and move the fuck outta North Jersey. Cali or PNW here I come!", "sade1111": "❤️❤️❤️❤️", "itsericat": "Traveling internationally as a makeup artist and being a light in all of my work and life situations", "bumblebee9884": "Have an article published in Teen Vogue!", "shanellegenai": "Media Correspondent!", "_lakesuperior": "@jaliyahdrenise speak it girl, speak it!!", "greta.quill": "to be my best self, travel, and get my license lol", "kirstenreneesays": "Creating a healing space for real soul work, publishing my very first book, getting a new car, + owning my first home! 🔮☀️💕 #ItsMine", "blackgurlinc": "Ready to use film to highlight social issues impacting Black women. #WhatsLeftBehind", "_marked": "To Simple Just Express Through Craft, to the point the love of my art is undeniable to the soul, just makes you smile inside out and inspire ! 💯💯💯 man it’s hurts and my artistic vision keep me up at night ! But one day soon!", "the_greatest_mc": "Cute skirt", "blkgrlmedia": "Creating more streams of income, giving back, investing and planting long term seeds in 2018! I'm ready!", "maddiegraceford": "Start and successfully grow my organization that empowers young minority individuals to challenge stigmas that persist in our communities", "pre.reid": "Ready to create consistent opportunities for artists including myself. Ready for expansion of all positive things in my life.", "skysthelimitrjd": "To meet you again, on purpose! && to collaborate on an idea! While watching Solange dance her butt off!! Watch us werk!", "phoeni_xray": "Working on my spiritual growth, kicking insecurities ass✨, furthering my political knowledge, one day hoping to act in movies that inspire and sing in sold out arenas, being the face of change, cultivating lifelong friefriendships. Travel the world learn as much as i can in college. Start a performing arts school, various shelterd for homeless youth, rehabilitation programs. Some of it are goals for my life not just next yr.", "millennialstylemaven": "Create my dream business to travel the world and to create wealth!", "christannchanell": "Skirt x Love 🖤🖤🖤✨", "tian.a": "Believe in myself, travel loads, meet someone new im every city I go to, be unafraid of taking risks, appreciate beauty in life, and intern at teen vogue 😉", "domkdiogo\nVerified": "Verified", "msdionnemarie": "Tell the story of women warriors across the globe that began to live their best life after age 40 in such a unique voice that it inspires a cultural change. I have work to do and a new goal to achieve. Thank you @elainewelteroth for that extra push with your encouraging invitation to comment.", "cannediceee": "Get into grad school 😭", "karlaproduces": "Have my yoga webseries on all media platforms", "ltinthecity": "Writing a book! 📖", "radiyadior": "To meet you and work with Vogue magazine I am ready!", "melisha_lee": "I will become a better blogger/writer, work with brands that empower women to walk in their worth, intern at an event planning company and attend the next Teen Vogue Summit. But above all, I will love every aspect of myself like never before.", "toribrunston": "Live my best life! Completing my many projects as well as launching my photography website. 👩🏽‍💻💁🏽‍♀️📷", "_they_call_me_kiki_": "Practice compassion toward self, and inevitably others. Financial responsibility, less #gucci 😢. Look up and around more.", "mamabettysweetshop": "I will live my best life physically, mentally, emotionally and spiritually. I will master and perfect my craft ✨", "eeshewhite": "SPIRITUALLY & FINANCIALLY W I N N I N G✨😍🙏🏽", "freshjizz": "I want to actually get fit and healthy and reach 5,000 subs on youtube!!!", "justbeingdoodle": "College acceptance x7 with $0 to the bill, good decisions to find peace in, great people to meet and return to, resilient and unabashed joy 💓💓🙏🏽", "shanae_evelyn_": "Find the courage to quit my job as a copywriter and start working for a magazine to pursue my ultimate dream of having my own digital publication. And, of course, continuing to be my authentic self even if it makes others uncomfortable", "ashleesade": "New job in consumer PR, a loving relationship and financial freedom!", "thisisbria": "landing a marketing/business development internship this summer. travel, network, and remain true to myself.", "introvertnthecity": "Change the world!", "monroesteele": "Continue being dope", "faithinmyfashion": "Ready to really start my own business in 2018, be prosperous, & wealthy!", "tiffdcartom": "@elainewelteroth ohhh 2018 yaaaaaasssssss!", "kkpro": "@elainewelteroth who makes your fab 👓 ?", "psharif": "Take care of my body, my mind, and my soul.", "horacegold": "I️ will strategically grow my music following to a more defined status this year and find representation as a singer and model. #moneymoves", "michellemarie3": "I want to improve as a writer/ journalist and marketer and I want to become hands-on involved in a non-profit and political campaign 🎉✊🏽💃", "jordanligons": "Becoming a writer/editor at Teen Vogue 😍", "britt_barr90": "Increase. Financial increase Home ownership one more baby #morelife", "ama.olivia": "6 figures in my bank account!", "mynameisfrazier": "I will launch my businesses, move into my first apartment, and help others ! 💁🏾🙌🏾", "nastassiadavis": "Taking care of my body, mind and soul. And wants to move to NYC and pursue career as a visual artist.", "shopmcmullen\nVerified": "Verified", "taylor.lane": "Finally becoming a beauty editor 🙌🏼 @elainewelteroth", "skincarevirginmary": "Landing a fashion PR internship in Milan, and launching my fashion and entertainment website.✨🙏🏾", "aliayphotography": "Shooting editorial portraits for Canada’s top magazines and newspapers, exhibiting solo shows, and winning awards for my photography work 💃✨💕", "juliadsutter": "get good grades, make memories, and someday work on a fashion magazine like you ! 💓", "yama.rongomas": "Getting back to my passion - writing and telling stories", "shantelrousseau": "FULL TIME BLOGGER ♥️", "bahamianista": "Grow as a content creator, express my most authentic self through style, culture and self-care. Travel more and live more abundantly. 💯", "teeeksss": "I will do amazing in grad school & have abundance in all areas of my life.", "skykorb": "I want to run into @elainewelteroth in a coffee shop (preferably not Starbucks but hey whatev) and talk about writing and the future of the publishing industry and feminism and hair products and glean advice on how to be the best of the best in every endeavor, and then we’ll create a simple-but-perfect secret handshake and then I’ll go eat a meatball sub by myself in celebration/regardless", "cheryltbergamyhair": "Love the hair ❤️❤️❤️", "melissaepifano": "Writing and editing for a digital/print publication that I adore ✨ no more settling or being fearful", "janeciabritt": "I will kick ass in my new job as a digital editor, work to get over my imposter syndrome, continue to nurture my friendships and familial relationships and work on self care in 2018! 👏🏾", "adamvanosdol": "Interning at fashion week and over the summer in Nyc and learning and growing so much from it🔐❤️", "mamie.yenovkian": "Improve my writing skills", "sabefro": "Work for Spotify Brands", "shinearthurmay": "Launching my business, completing writing projects , releasing music, drivers license🚗", "styledtobloom": "Completing my masters program, writing for more websites/magazines and begin making a living from my blog 😌", "xstravagance_designs": "P.s. Love your outfit!", "goldinggirl617": "Kick this live interview series off", "ambeezyy": "5+ projects under contract and sell my first house ✨", "jen_s_dean": "Starting my organization to empower and give voice to teachers! Paperwork started this week!!!! 🎉🎉🎉", "befiercebefab": "I will float on the most magical carpet of love, glitter, and glo up. 🤘🏾🏆💫✨", "strategyandskin": "Become more social, meet new people, take better care of my body and mind, travel and discover my true career passions", "shereice.art": "I will complete my training as an artist and begin to paint my truest visions 🎨", "thisisbrittneyf": "Work in digital media/editorial (maybe with you! ☺️), work on creative projects, make and save money, meet more creative people, grow in every aspect!", "xoxo_glenn": "Love the Keith Haring 😊🏳️‍🌈", "helloflyover": "2018 Goals - 1) Getting @elainewelteroth to mentor up and coming entrepreneurs in the Midwest 2) An event partnership with @teenvogue 3) Develop one of the go-to brands focused on inclusion and representation.", "kayleighgarrison": "Be brave and do whatever sets my soul on fire", "marcheleann": "launch my lifestyle blog, start writing my first book of poetry, embrace all that God has for me.", "itsheatherwhite": "TRILLFIT (@trill.fit) will open its first flagship in Boston and launch pop-ups in three new markets. In my new role @newbalance, I’ll lead the lifestyle team into uncharted territory 😏✨ I’m so ready for 2018 - more risks, bigger rewards, and hopefully more coffee catch ups with you @elainewelteroth 😘", "eclecticista": "I'll launch my line and be blessed to have to in one of my pieces 🙏🏾", "jaminpaul": "❤️🙏", "angieworldorder": "Get my book deal, move into a beautiful and new apartment, finish writing my second book!!", "meeandminnie": "Continue to grow as a style blogger, leave my full time job and become a freelance style writer, open my online vintage shop, attend a conference!", "darlingnikki_82": "Getting a portfolio together and finally trying for modeling👐🏾👐🏾", "niesa_gordon": "i have a dream of moving to new york and working for teen vogue", "dolly__farton": "New job in my political field!", "itsestafiesta": "I’m going to be a full time creative making enough money to live the life that I want which includes traveling to see my bae in London!", "inmyownlittlecorner": "Becoming a brand editor and writer for lifestyle and travel, growing my business in film, raising my voice! 👩🏾‍💻👸🏽👩🏽‍🏫", "hashtagfostercare": "I can’t wait to meet you", "chris.shepard_": "Starting my career as a film editor", "actually_ashly": "❤️", "shelbysparks": "Get on Broadway and find success as a blogger. Another huge dream is to get the chance to speak at a woman's March 😌", "zunicleon": "Graduating FIT and running the NYC MARATHON!!! ❤️🏃🏻‍♀️✨", "epiphanyciers": "Be myself, unapologetically. Move to LA and pursue my dreams to be an editor 🤗", "avamohsochic": "Contribute to your magazine!✨ @elainewelteroth", "eyeofscottie": "going into 2018 with one attitude: \"reclaiming my time\" and reclaiming my creativity. my destiny & dreams are already destined, for me. i'm already that person i want to be. i just have to remain faithful and true to my most authentic self 🦋", "withsterlingprecision": "My only plan is to be better. A better me, a better daughter, a better sister, a better friend. Sometimes simplicity is eloquent...", "mthreeproject": "Im moving!", "kenidra4humanity": "I love you", "jordanraccah": "start working for ogilvy as a copywriter", "lexifender": "get into fashion school, intern with @kirbymarzec, & be happy with myself 😌", "iamikarenaea": "Finish my last 3 semesters at state. Quit my 9 to 5. Financial Freedom by continuing to grown my online business and to just live a feat free happy life!!!! 🙏🏾", "remixedbynai": "I will become a better sales rep and work for an even better company. #werk", "__kennyfromtheblock": "Cast a show with you", "tjradwayrockermusician": "So beautiful and I love your curly hair always! @elainewelteroth 😍👍🏿🎸🎶❤️", "therealflyingyogini": "💎💎💎💎💎", "camilianaire": "Build my company, publish more articles, and keep on resisting! ❤️", "uniquely_humble": "I'm going to pitch my first television show in 2018!!!!! 🙏🏾❤️🎊", "blair.w.martin": "I would like to find a successful career that I love and I’m passionate about that helps people. Also happiness, being happy is great", "helloiamtricia": "Get comfortable with being uncomfortable 🙌🏾🙌🏾", "gillespie.official": "I will write for you! ❤️"}