{"lovely.anj": "👏🏾👏🏾👏🏾👏🏾👏🏾🤔", "natashaallegory": "mixed race people need to be able to tell our own story. our voice is absolutely stifled in the narrative at play. thank you for taking the floor and opening up the forum", "jkhunter1": "Your words were eloquently stated. I wonder, how the royals, people in general will feel and how the media especially will portrait or embrace their children, when they are born with a variety of skintones and hair textures. Especially if one of their children's skin or hair \"reaches back\" into her black heritage and look more African than Anglo??", "katie_0120_x": "@jamesralewis2911 trés interesant! From that podcast i was telling you about! #thehighlowpodcast", "nats_sun_shines": "Very well said 👏💗", "fuchsiapinkraf": "@tameramowrytwo I remember on The Real you said the exact words \"I am a black woman and I have beautiful mixed kids.\" I thought waaait you're the mixed kid and your kids are white. I think this should become an open discussion. So we'll said by Elaine", "karolgaarden": "Well sad!!!👏🏼👏🏼👏🏼👏🏼👏🏼", "big_fine_gorgeous_mally": "Mixed race or NOT no one should have to choose or feel like one is better than the other but love themselves and embrace all cultures and races. There are such bigger issues than the color of ppl skin and when tragedy strikes, ALL ppl can b affected regardless. Wish ppl stop using ignorance, religion, and colorism to divide and just for once use those things to just learn from each other, relate, and UNDERSTAND", "angieparkerbeauty": "I read an article recently about these mixed babies that were orphaned in the late 1940’s during World War 2 What was so sad to me was imaging these African soldiers who had fallen in love with these English white women and they were carrying their babies and yet they could not marry them as it was not legal and the women could not keep their babies as it was uncommon and not accepted at this point to be a ‘single mother ‘ and so some 2000 babies of mixed race were sent to orphanages . When i look at our world now and see races love freely and having babies freely i myself having loved a beautiful African man without stigma or shame i feel happy that we can embrace our children as ours and yet for them especially in this country it feels tough to find their place in society as we have so many labels which identify race and yet its not nuanced it is black or white which feels wrong and misrepresented for these children . We are legally allowed to love whom we want now black and white man and man woman and woman . Yet our children our still struggling to fit in because there is still this stigma here yet i don’t feel it quite so much in England and i will hope that our family will embrace Megan’s children whatever shade they are delivered as we will try to keep moving forward as a country despite the hurdles of Brexit as this wedding represents growth in our monarchy and so will in turn reflect well in our society ! Lets hope our terms of bi racial will be a positive take to represent our beloved offsprings .", "brookepritchett": "@maceybaird1 thoughts from last night", "maryamajayi": "@ashley_elders", "setteonbeauty": "Eventually the sun will hit her face and the heat will lift from her hair shaft and then how will she be embraced? Can she pass for white then? What will the tone in the UK be for Markle if and when that moment occurs?", "tothediaspora": "Perfect timing to bring this up. Watched the biracial series you were in too and I learned so much about society’s problematic classification of people of multiple races.", "therealconstancevictory": "@dr.valeriesmall", "wildenfree": "Beautiful. Such good writing too❤️", "safiyah_m1": "@aylaabroad", "cemck2": "I am “biracial” and have always identified as Black—the terms are in truth interchangeable. I like to think of “biracial” like a “cultural” marker more than anything. Someone is Southern, Bajan, British, Jewish and they are all Black experiences with particular expressions and looks. Even with, Obama, who you cite. He is simultaneously our Black president and a “bi-racial” man and each is invoked to express others’ responses (approval, envy, disapproval, longing, etc) more than to reflect his own assertions. I’m speaking to objectification and to things outside of the person they’re being written on. And Implicit in this is a kind of violence. The same hand of violence inflicted on dark skinned black men and women. Maybe the terms differ but it is a violence nonetheless. We have very very little of her voice. Only others’ narratives of her.", "adenova.style": "Nice 😋💎", "chriiisuuu": "@mr.agho", "msalem": "@gabbulous", "anna_solerpont": "Interesting post! (Val la pena llegir això, @ennatuhun !)", "doncotolomanoski": "Ummm you seem very self involved and disconnected with the power of love and acceptance.", "jjoules": "👏🏽👏🏽👏🏽👏🏽👏🏽", "tessawoolf": "@betch_yasss", "4hd2002": "،", "kendrarhoulhac": "Well said !", "djidstyle": "❤️❤️❤️", "mimimyselfand1": "Meghan is not white passing. She has never hidden her black side. She has written about her mother and the racism she faced.", "ft.huachucaplay": "World War II. Arizona. 5 African American nurses arrive on an army base camp. Join Mayvee, Marjorie, Georgia, Elinor, and Thelma on their journey as they face the biggest challenge of their lives. Inequality, growing racial tension and a society that does not acknowledge their efforts, when all they want is to fight for their country. @ft.huachucaplay If you are in the Los Angeles Area come see us. But wherever you are join the movement of #forthuachuca #sistersinarms #ImStillHere", "okaybaemag": "OH LORD 🙏🙏🙏", "thenameislne": "For the record, Britain's first black queen was Charlotte of Mecklenburg-Strelitz, born in 1744, the great, great, great-grandmother to Queen Elizabeth II.", "taraamackey\nVerified": "Verified", "kokobiyako": "Her mom looks like our maid she’s from Indonesia 🤔😅", "mirconorma": "Más allá de la monarquía , estas mujeres me caen bien.", "danitachantel": "@kickinitwithjazz 🤔", "maurice.marcel": "@myescha", "scs322": "ABSOLUTELY! Thank you for bringing this up and putting it so eloquently", "pebbleswroteit": "You raised all the questions necessary Miss Elaine. I was surprised with the use of biracial more than is usually seen but I believe this moment should make a few changes to how we speak but will folks understand intention within the shift or just camflouage to seem informed.", "huckelbetty": "I feel like #meghanmarkle needs to read this.", "xavierasimmons": "@elainewelteroth all black Americans descended from slaves are bi racial/ mixed race.", "blackgirltext": "Referring to Meghan as mixed is purposeful. The British monarchy under their pseudo progressive veil is by no means willing or ready to accept someone who is by all intents and purposes, \"black\" Into their family. Meghan is a smoke screen and a whole mirror to just how seismic racism is in the UK and around the world. Of course their love is a win when it looks white and is more palatable.", "keamagarrett": "Maybe people see her as biracial because her father is white and the people we see black like barrack because his father is black very patriarch. But the British are very open about race as well when applying for a job there there was several boxes to pick from African descendants or African Caribbean or black African British. Whether in America we only get one box African American", "luvandkiwi": "I’m giggling (tiresomely) at those who aren’t truly getting what you’re laying down. And trying to ‘splain to you—a biracial woman who lives this— is even more fascinating. I LOVE NUANCE! Thanks for giving us all something important to chew on ✊🏽💚", "realmollymalloy": "@annclark22", "elis_navidad": "@daniellgab", "_merikaw": "@tanieshaj represent ❤️❤️❤️ this gave me goosbumos", "mary.saar": "Why are they always perceived as black not white since they are just as white as they are black ... that is the question?? I published an Essay on that years ago 'Why is Obama black' - 'multiculturalism or multi-colourism'", "a1barbs": "Wow", "theguidance": "What’s funnier to me is how much of a #simulacra the #royalwedding is 🤪", "audraaudraaudra": "The most fascinating skill in this whole spectacle (to me) is the ability of all celebrating to forget this families painful history of raping, robbing, enslaving and colonizing Black and brown bodies worldwide. There is slave sugar in that tea and slave. Oton on those palace sheets. Not too long ago the prince wore blackface and a Nazi costume. Does that history disappear or lessen because a half Black duchess has been married in? Can she return the Crown Jewels to India and Africa? Instigate reparations? Asking for ALL my friends 🤯x", "agallewale": "Very late to the #RoyalWedding comments game here but in addition to all of the above, there's also a blatant disregard of sensitivity to Britain's colonialist, imperialist history through the representation of all of the Commonwealth countries' flowers in her veil. The media has narrated this as a \"beautiful tribute\" but it's really more a celebration of the British Empire than anything else. Thank you for articulating so many complex thoughts and encouraging the discussion!", "alexgabrielhart": "In the U.K. we call biracial people biracial. It's not that deep, America just has hundreds of years worth of racial tensions to deal with but promoting it on social media isn't a good thing because, despite it being a good point, it's only relevant to your issues in America and therefore when it's picked up on by others around the world, it becomes a worldwide social issue that doesn't even exist worldwide. This happened with the black lives matter movement. Which isn't relevant to most other places in the world cos nowhere else has as problematic an issue with racism as America does, but has almost created a problem out of nothing in places like Australia who glorify America and jump on all of america's social justice bandwagons. This isn't a criticism at all, but make sure you mention that these racial issues are a heinous problem over in America, which contrary to popular belief hasn't developed much as a country since about the 70s", "itsdwallace\nVerified": "Verified", "tasteofbon": "@_missboit her caption sums up my thoughts on all the hype that's been buzzing", "bbsear": "@rachelnholmes this is the post I was talking about earlier...", "rochelledionnexoxo": "@rekbxoxo why am I only just seeing this. 👏🏾👏🏾👏🏾 say it louder for those in the back x", "misslaura101": "@flightspath yes! Pretty much verbatim of what I said this morning.", "morganbrownartist": "Yep, I agreeeeee", "ed0m": "@williamgertler", "bysimplymerv": "Beautifully said!", "warrantedqueen23": "Thank you sis! I feel exactly the same.", "1kdavis": "Wow! I never thought about this but you are RIGHT! Thank you for bringing this to my attention. Very interesting points you make here👏🏻", "keysha_ines": "@tynagrams", "jennifercejaphotography": "@elainewelteroth @dznbyjw @ariannagab 🤔 Why do we have to have labels? I always answer that stupid question by writing ‘human’ on the ‘other’ line.", "whore_de_culture": "You have read my mind. I have been thinking this since their \"thing\" was made public. It's a good thing.... but interesting to delve into the possibilities regarding the racial issues. Her kinky/curly/nappy hair has yet to be viewed in public, unless one googles pictures of her as a kid. That said.... race is often so damn confusing. My cousin looks white and was raised in a white environment. She is aware of her \"blackness\" and doesn't try to hide it, but I can't be mad at her for not \"feeling\" black, per se.", "planetheadwraps": "Hey @elainewelteroth , thanks for this blurb! We met in Jozi (at afropunk, in the isikowear tent)- have you read Trevor Noah's Born A Crime? Its the best work I've ever taken in on being mixed race. // and being in S.A. was my first time coming facetoface with some politics of being mixed & Black in this world. Means something different everywhere. Mixed, and Black. // You're right- theres something to be said about melinated mom rolling up on the scene. // They use the term \"Black British\" in the UK. I think they are playing the bi-ra term instead bc Black in the palace is just too much blasphemy. Too much irony against Britians persistant hegemony in the Black world.// In the states, mixed ppl often default to Black. To me, its proper thinking. Loyalty and pride are principles of Black Power. Funny, I met some Ivy League asain students n asked what they wrote about in their entry essays: they ALL said \"growing up mixed race :D\" \"Im white and Asain!\" Hah! A concept. \"Mixed\" in the states usually means Black involved somewhere. Academia will define it differently. But the word is so loaded and born from slavery and rape. Admittedly, I get annoyed with fellow mixed folk to try to avoid n deny their blackness every chance they get. (Though I shouldnt- to each their own). My white mother has ALWAYS encouraged me to look & be like ☝ Meghan Markle. Straighten my hair GOOD, soft pink makeup n polish, & be very articulate and appropriate. Even my own mama! respects me more along these lines. She never passes up the chance to critique my hair.. This is a very layered reality.", "vj_hughes": "@elainewelteroth @vsizzlebx or maybe we’re all a little right and a little wrong. In my quest to figure out exactly how she identifies I read a few articles and found this quote: \"While my mixed heritage may have created a grey area surrounding my self-identification, keeping me with a foot on both sides of the fence, I have come to embrace that. \"To say who I am, to share where I'm from, to voice my pride in being a strong, confident mixed-race woman.\"🤷🏾‍♀️", "leahjodub": "@nicole.grace.murphy", "denisevasi\nVerified": "Verified", "barbarahmusic": "Meghan has curly hair", "1beautymarked": "Very well said and a question that causes reflection.", "meghancaseyloftus": "@gabriellabower a really thought provoking post 🙏🏼", "kuukss_sapphire": "Such an interesting question", "manuelasweb": "@ajpbranding", "rheadarbylewis": "As someone born and raised in the UK, I've always found it curious that mixed raced (biracial) people were called Black instead of mixed in the US. 'Mixed race' was added to the census in 1991, and mixed race is the fastest growing population in the UK. We're not new to the term, and it was widely used in British coverage. What we did see a lot of, were attempts to down play her whiteness and play up her blackness as a means to deem her unsuitable. And it was done in a typically British way, the press constantly used coded language. The Daily Mail (the most read British newspaper, that's trash and racist af) publicised one of its stories with a tweet reading \"from slaves to royalty, Meghan Markle's upwardly mobile family.\" Another headline was \"Meghan Markle is (almost) straight outta Compton.\" There was lots of she'll bring \"rich and exotic DNA\" to the royal family. Or, describing Doria Raglan as \"a dreadlocked African-American lady from the wrong side of the tracks.\" They hated her despite her being extremely white passing. The racism of the UK is less overt, they'll endlessly use dog whistling terms, or refer to her solely as \"Megan Markle, whose mother is Black\" (with no mention of her white father). It's interesting the US take is she's white passing, whereas the UK take is she's definitely not white.", "votelikeamother": "Yes, yes, yes", "dianaterry": "Well said. Thank you for sharing. As a white woman who grew up in a liberal state, my ignorance only revealed a woman and her mother in this photo. It is important for people like me to be reminded of the racial disparity. 👏", "christinalanae": "Beautiful words!! Bowing to you for speaking such truth 🙌🏼🙌🏼🙌🏼", "__danadavis": "@elainewelteroth beautifully said and important children are aware of their entire heritage. My children were always encouraged to acknowledge both but their choice as to if they identified with one race or another. Ultimately they are loved and respected and should love and respect all others. It is the only way. Thank you for sharing. ❤️", "monbreezy": "👏🏽👏🏽👏🏽👏🏽👏🏽", "thisisrushe": "I have questioned the same thing, but did not want to say it aloud because a part of me feels like can I ever be satisfied.", "jn_bsn": "As an ethnically ambiguous biracial man myself, thank you for making this insightful and compelling post. We must carve out our own ethnic space, the liminal identity", "yes_thisisme_fran": "Wow I noticed also", "mypinkdocs": "@jaamen you should read this", "mommyinspires": "@blackhouseconcept", "northern_grammar": "This this such an amazing summary @the_storybook_of_style", "amirhoseinshafeii": "Good", "_sourabh.chandaliya_": "nyc", "erinsteen5": "@theasmithh so interesting !!!!", "bazar6814": "They have different skin tones but, like many mothers and daughters, there is no mistaking that they belong to each other❤️", "flightspath": "@misslaura101 exactly what you brought up. Elaine is definitely worth a follow.", "maddierosedrewery": "@k_c_makeup", "rekbxoxo": "@rochelledionnexoxo @jenniferclark_89", "wonderwonderkay": "Good question", "mrsaaa1204": "🖤🖤🖤. Beautifully written. I had se@lf those thoughts as well. I think American media was taking a cue from British media who seemed to be using the term practically since the couple was discovered to be dating. British history is a bit different with race but not less complex than the US. They have issues with racism but seem to address it them head on and differently in many forums.", "shinobirobeson": "THIS!! Sooooo needed to be said! Thank you!", "carltonjonescollection": "👍🏼👏🏽👌🏾", "janemadden": "@ryderbuttry @cbmagee12", "miacarameros": "Yes yes yes.", "superherochick": "Great points!", "olu_": "Yes you expressed great sentiment Queen 👸🏽 Thanks", "_mahawa_": "So true", "stephanieht": "@velma.simmons", "luluobrown": "@tchima85 x", "nehavr": "🙌🏽", "mirandawprgram": "I don’t think you can quantify the love of two human beings this way.", "louisahull12": "@louisdevilles please read 😘", "mrscastro": "This is eloquently written, so good!", "victoriajanellewright": "@lizzy_loo", "irinafranca_official\nVerified": "Verified", "eimearvarianbarry\nVerified": "Verified", "michelinemcgrath": "@cl_mill @verillo11 all over this", "iosonolucilla": "@elainewelteroth you ruled girl. Agree 100%", "mamawolfff": "@xbrcsglmx @akaduygs", "sydney.piercey": "@stuart.piercey", "iamsidthekid": "Maybe I’m a cynic, too, but the same thoughts crossed my mind. :/", "loudermakeup": "I agree with you but it bothers me that America puts so much effort into putting down black people. Biracial is a term that the media is using to separate Megan from being black and they do it as if to offer an explanation as why the prince chose her. She's not black, she's biracial. It's so offensive!! A lot of people mention her light skin and how she could pass for white, but fail to understand that \"biracial\" people are always too black for white folks, no matter how light. The one drop rule prevails, unless it's time to rationalize how a black person accomplished something that makes white folks writhe with envy.", "issymccormack": "@beccakinder @milliemccormack", "fasondeviv": "To say shes ”biracial” to show us if you're a ”light skin” woman you can become a queen. Like slavery, the light skin slaves get to stay in the house. Smh, but I think if she was dark skin it would've been in the media more as a shocker", "coolveganmama": "💯", "orlaithkelly": "@neevekellyy interesting", "vbporteous": "Beautifully put.", "hyaty220": "#منتجات_شوشي", "ninameansusa": "I appreciate your candor. Well said ❤", "nycphoenix": "Part 3: @elainewelteroth To answer YOUR QUESTION 😊 first, it is important to remember that Prince Harry had to get permission to marry Meghan because the law states that if you’re 6th in line to the throne or less – the Queen must grant you permission. It was less about the “royal family’s” acceptance, and all about the Queen’s opinion because she is honestly in charge. Since Prince William has three children, and it is highly unlikely that Prince Harry would ever take the throne – it’s likely that the Queen would have accepted a darker complexed woman. For example, look up the royal family from Liechtenstein and Princess Angela who also married to the second son, and they had a biracial son – who is in line to that throne. Also, look up Alexandra, a Countess (lost her Princess title due to the divorce) – married the second son of the Danish royal family, and they had two multiracial sons – who are in line to that throne. Finally, there is Prince Albert II of Monaco…look up his son Alexandre Grimaldi-Coste. Nevertheless, back to Meghan…we know that her beautiful African-American mother has been embraced. She’s not going anywhere – well, maybe back to California until the grandkids begin to arrive. She is also part of the royal family. Regardless of how Meghan looks today, Harry and Meghan will likely have children with various features – all beautiful. I believe the message from Bishop Curry was – it’s all about love, and that we’re all part of the same family…even if we don’t always behave as if that’s true. His speech was certainly a pleasant highlight. People need to stop holding onto racists ideology that started in the past, and instead – encourage the change that is still needed through truthful education… that we’re all equal and need to be treated and respected equally.", "_happyviruses_": "Idk about America, but in the UK mixed race has always been mixed race. You're neither one or the other completely. We don't call mixed race people by one of the races they are, and ignore the other. I think the notion that a mixed race person is referred to as black in America has to do with American history specifically. But maybe the acceptance of her biraciality in the UK media influenced the US coverage 🤷🏾", "life_created_joy": "@elizabethogabi the question is will this be a one time show of inclusive behaviour? Let's observe over the next 3 years and than decide the impact! Giving Megan so much praise for making change? She has gotten married, Harry pushed for her acceptance into the royal family the queen accepted. Let's see what she does for inclusivity when in \"the firm\" And than we can give her praise.", "_bellamoi": "All of this 💯", "droopla": "@elainewelteroth go on @nprcodeswitch !!!!!!!!!", "karlabailon": "@thejtmitch", "whoisaakin": "Doesn't matter her skin tone just like it didn't matter Obama's skin tone. Embrace the moment join ALL shades of people of color and watch these barriers be broken down", "turtlehuff3": "Interesting truth!!", "lildallas": "Same.", "fraujames": "It is a step forward. That's for sure. And given the fact that she (Meghan) could pass as white,still the queen had to make the decision if she wanted a biracial woman to be a part of her family and to me that really brought the change because she took all that into consideration but I'll also tell you from personal experience as a mixed raced person who happens to be english, the UK sees race and in particular mixed race people very differently from the U.S England had the majority of mixed raced people in all of Europe where there is a melting pot of races. So to accept Meghan for the royal family was not too far fetched, given the history and relations with its dynamic multi cultural framework.", "mynameistawny": "@heatherlovefamilystyle I thought you may be interested in this post", "marlenacreatesart": "I’m happy for Meghan, she had the blackest royal wedding event I’ve ever seen. Congratulations to the happy couple 🎊🎉🎊🎉", "jen_ator\nVerified": "Verified", "jadoreadorian": "Factsss! This is why you’re the queen 🙌🏾🙏🏾 Thank you for this much needed insight!!", "sheedahq": "Never thought about it but yes you are spot on!!!", "nicdpowell": "Speak the truth!!!! I was thinking the same.", "annmarieelaban": "You are such an amazing advocate for social justice and have used your platform to raise such valid and important discussions. You are a true role model to me.", "brandonshow": "Thought the same when I saw a reporter yesterday say “the first biracial...” I know she is biracial, but I’ve always considered her black. It was in that moment that I her blackness was downplayed for something palatable and ambiguous.", "diva_acire": "@elainewelteroth Thanks for keeping people on their toe.", "lauragalassojewelry": "💕✨", "marg0g0": "Does the media say biracial because they don't want to say black? Because they embrace her whiteness vs her blackness? Biracial is an accurate term but the context seems purposeful. I wonder if Meghan feels more black, or more white, or equally both? I know that's not really a fair question but one I'm curious about! I am filipino and white and identity is such a full, loaded topic for me I could go on for days.", "mz_maxey": "@rinabliss", "xix.b.viiiv": "Her mom with the nose ring ruined a nice photo", "judithhosang": "This is about LOVE, not politics. But perhaps the use of bi-racial is because that is how Meghan self-identifies. She's published essay on the subject using this verbiage. Didn't call herself a Black woman.", "anniekasa": "Thank you and I agree the most with the last sentences.", "thecarrielea": "Smart. Well said. Accurate. Appreciated.", "evertonallen": "i love your point. but maybe i’m pessimistic here. i truly feel like it semi discredits her blackness. now, i’m not biracial although i am mixed, so i’ll differ to others who lives this daily. it just felt safe though. it was easy to take and say and broadcast that she’s not just black, but she is also white. after discussing with my lady as well, i’m more intrigued in what she actually self identifies with.", "lwright1230": "We are all mixed or more than 1 race. I hate the terms black and white. My blood holds a million stories.", "abskishills": "It’s so interesting that you mention this as I was just talking to some friends about this today. In Britain, you are exactly what you are, and as a black British Londoner it has never, ever crossed my mind to call Meghan black because she simply isn’t. Nor former President Obama or Halle Berry. That whole ‘one drop of black blood rule’ doesn’t really exist here. Those that are mixed race are exactly that, the word biracial isn’t used much though 🤔. We have many boxes to tick on various hospital/governmental forms. So much so, that I can often differentiate/declare that I am half Nigerian, half Jamaican by ticking ‘Afro-Caribbean’. As you say, racial identity is personal to an extent. However, I’ve always found it intriguing that in America the white side of a mixed race persons heritage is often completely negated without giving an opportunity to identify as beautifully blended and mixed race. It’s all so beautiful to me and our mixtures are everything! I guess cultural references are super different over these sides of the waters.", "jojiejewels": "@desert.ren", "foreign_skank": "@emilyjthai I've been thinking about this so much.", "caitlin_tyson": "Thank you!!👏🏾👏🏾", "ynabeldotcom": "Agreed, sis. Very well said, obsessed with you 🙌🏽", "brennaelizbethphelan": "@eshad28", "missusatomba": "I have a biracial mother and mixed race father...but due to the color of my skin and the nuance of what makes me me I just say black so people don’t get confused...but when I celebrate other parts of my heritage I’m a sell out...it’s exhausting and I’ll be happy when people can open their minds to the idea that brown people can be black and whatever else...add to it the later that my multi racial father is a civil rights pioneer (he was a member of the Little Rock Nine) and I’m not only worried about even brining this issue up but also disappointing the people that admire him", "killakillashanshan": "@isabellazavarise", "sheba_shalamar": "Exactly.. By the same token, if it were his older brother (running in line as a potential king-in-waiting) who desired to marry a biracial woman it probably would not have been allowed, regardless of the degree to which she was 'white-passing'", "mary_b_rocks": "Truth.", "getfreshdaily": "So powerfully articulated. Thank you @elainewelteroth", "zoelrdt": "@luxfrnt", "michaelaknox_": "you are 💯💪🏿💪🏿", "whit.sienna": "🙌🏽🙌🏽", "ff_sullivan": "Elegant 💙💙 @model_looksup", "mixdfeelings": "👏🏽 Bravo! Thank you.", "mmd_pr1": "@michmich3ll3 👍🏾👍🏾", "thoruba": "👍🏾", "marvis_reads": "@hkyomu come here", "aoifemdoyle": "@aislinglawler", "spristin": "@elainewelteroth breaking it down so it can forever and consistently be broke.", "thequeenofjamaica": "Great post. I had many of the same thoughts especially surrounding acceptance if Meghan were “more black” in appearance.", "lala_lanii": "So much truth", "aconstellationjournal": "Absolutely well written, eloquent and thought provoking. As a Latina, I never realized I was a POC until I came to the US (to many Latinos, “America” is the whole continent—north+central+south= America). Anyway, I never realized I was a POC until I came here. In my country I am white. Race is complex everywhere. In Panama, where I’m from, there is also racism among us, and sexism, xenophobia and homophobia, transphobia... it’s not perfect. But there has still been some level of understanding of how mixed Latinos are. Here, however, I find it so hard to fit into these “boxes” whenever I check them in census forms and applications, etc. On one occasion, there was a form I had to fill out and the options I was given didn’t even include “Hispanic” or “Latino”—which are also two different things. I also remember when Trayvon Martin was killed, how it was the first time I ever heard the term “white hispanic” used in the media. It was like “oh, now you realize Latinos come in every shade?”. The media is very convenient in its portrayal of race. I can only speak for my experience as a Latina. But in terms of the royal wedding, what you’re saying is absolutely true... but I found it historic, moving and inspiring to see Meghan’s mother with *her* natural hair, and the bishop and the choir’s rendition of Stand By me. And the Cello player. I think those were Meghan’s ways to celebrate her identity and to me they were beautiful. All in all, it’s a step in the right direction ❤️", "puertoinla": "Salamisha Tillet wrote a beautiful, poignant piece for the NYT today that analyzes Markle’s racial identity within Atlantic World and diasporic frameworks that challenge the bifurcated racial categories and discourses of the U.S. Her argument about the royal wedding’s “bicultural blackness” is powerful and transgressive. Highly recommended: https://nyti.ms/2kaoUgN @salamishah @elainewelteroth", "mutedcriespoems": "You posit a great question!!! Yes, I wonder if Harry may have had to abdicate his birthright to the throne if Meghan was my skin color 🤔. But anyway, she married into a white family, a royal family, so she may have had to abdicate her blackness 🤷‍♀️ just saying 😭", "naticreblaxican": "I wonder if she'd be considered biracial if she looked darker? I'm multiracial but people are more accepting of that concept when they look at me. Given that, i dont pretend to understand issues that come with being mixed and having dark skin. Still it makes me wonder..", "benzox_artwork": "Hello.... ✋✋I AM A DIGITAL ARTIST🎨🎨I DO ALL KIND OF DIGITAL ART🌿🌿🌿CARTOON PICTURE 🍀🍀🍀LOGO🍁🍁🍁COVER ART 🌼🌼🌼FLYER🍂🍂🍂ANIMATED VIDEO🌾🌾🌾AND LOT MORE 🌺🌺HIT MY DM TO GET YOURS🌼🌻🌺🌼🌻🌺🌼🌻🌺", "p.scilly": "Girl.", "tiianyc": "You are starting conversations that I am so so happy to see. Thank you!", "razamataz27": "She's not the first bi-racial women in that family. It is said that Queen Charlotte was black, but of mixed blood as well. She died in the 1800 at 74y/o. She stated that the Queen spoke to her about that.", "relishamonay": "This was beautifully written. Things that make you go hmmmm", "pillsbepoppin": "@charlottesleet", "krysglo": "I don’t think she passes as white & we shouldn’t judge her for straightening her hair.", "pancenwaisar": "@ashleighnickerson", "klashaascloset": "This", "harjit___": "@candicebrathwaite", "impactbyhannah": "I thought about all this too a lot as a very white woman. I recently told my hair stylist I wanted Meghan Markle’s haircut...", "amy.hutchcroft": "@milliehutchcroft @susie_hudson", "basmakhalifa\nVerified": "Verified", "annigibson": "@chantiecg", "yasups": "@tcblu", "ambermwilliams": "@emilybristowe6", "lehane1491": "@livvycook", "irinakikina": "@nosisa.jpg", "onegoodqi": "🙌", "jeanisvar": "@ekao22", "brucewillis____": "@___patrickdempsey @davinaclarecox sister", "nicolebriggs": "https://anchor.fm/youhavetowearsomething/episodes/Meghan-Markle-is-Married--Why-You-Should-Care-e1gk72/a-a2156c", "riyapatel35": "@annakmf @georgiastewarttt", "alissa_slaffer": "@jconyng", "itsmecatpea": "@chandrew19", "tamtamdisco": "@just.dt next topic to discuss Dave! (Whilst @sophie.hoepelman is on her phone!)", "mirtheshow": "The answer to your question is no she wouldn’t be the princess if she was any color darker than what she is", "likuna8041": "💜", "aves_af": "@kateavos @kingje7", "rustyirvine_rusty": "Aw2 she is so gorgeous xx xxx", "prfrancoise": "Great thought! Not sure how ready they would be", "sazzle_mcdazzle": "@raphaelaz123", "holidayresortcruise": "Very interesting. Also, I might be wrong but their children will be the first biracial prince/princess in the British monarchy (or the first ones acknowledged and titled at least).", "hey__its_lola": "I read a great perspective on how we are mostly couching this as the Windsor’s accepting Meghan- why don’t we frame it as her choosing to join them? I think her statement that she asked Charles to walk her up the aisle was powerful- she wasn’t rescued, she chose how she would feel supported.", "amyepstein4": "@katejacobs123", "racheln1394": "@bbsear", "thatgirljen": "I just see a man in love with a woman and a woman in love with a man. So sick of this.", "mriths": "@jennydewoolf @_stefanastefana", "bessiekaine": "Thank you for sharing these thoughts... I hope you don't mind me sharing them in my post.", "constance____": "@isseysmith", "ellpicton": "@morganachess", "oli.lus": "Although it is commendable that she brought “blackness” to her wedding, not identifying as a black person gives me Rachel dolezal reverse vibes. My family is comprised of biracial individuals but because we have more melanin in our skin we identify as black. In this context “bi-racial” is to have stress on the fact that she is half white and half black which her white side overshadows her black side. Because of this stress it could be looked upon as she gets a pass to be apart of the royal family for 1) looking more white than black 2) not identifying as black person. In one form of another we can probably all say we’re biracial (to an extent) but to put an emphasize on the word to me at least makes it seem as though you don’t want to identify with the part that is black which is saddening.", "genetixorganic": "YES YES YES YES", "erisberry": "@hashtagmanolo", "elizae2013": "@cbarclay94 @kateatdavis", "joannafreedman": "@caryshogan @meelsonwheeels @rosegerrard @amyvlgrover", "gelonious_funk": "So this here Blaxican wants to know- is the term biracial only used when someone is black and white?", "_dearari": "I would love for you to somehow get in contact with her and discuss this. It would be a monumental issue and I think it would sell really well. Please consider that opportunity. I also think it should be a whole issue dedicated to this discussion. This is a incredible topic. I personally saw this as a wake up call in a sense that slowly black women are being seen by the public not as a opportunity but as worth. A lot of the times we are used as a token or a group of women to dabble with. Meghan has so much to offer as a black women. She's well educated, fairly successful as a millionare, can stand her own, has flaws just like the rest of us, but knows her identity and I think it's okay she says biracial because personally she's not just a black woman, she is multiracial and she comes from a family on her mom's side full of them, so I don't think it's fair to put her in a box and say she's one thing. This girl will change a lot in the UK. Harry and her together I think will set the tone for many things in and out of America. It was a reminder that anything is possible and it's OK to shake the tables haha. I love the whole persona about her. I just wished we would've saw more of her mom's side of the family. She is well educated and knows her blackness and is comfortable with it. Cosmo and Essence needs to be the two magazines that discuss these issues with her and ask her these questions. I think she's an exceptional person and she'd be willing to discuss issues. @elainewelteroth good post😊 hope to be an intern one day. 🤗", "neosouled": "well said.", "shanshann81284": "@bebekns", "rochneemehta": "@justwingingit1111 thoughts ?", "_binihirst": "@larawhitmore", "sm21_jayshade": "hey folks", "christine_russo30": "@evavalerio", "ralfemichael": "@misscarolf", "meonette": "❤", "camillionz": "When I lived in London they used the term biracial way more than I ever heard it here. Jessica Ennis was a huge star for them and they called her mixed race or biracial. I also heard it more often casually. Wonder if the American media is also picking up on the British media’s lead.", "sylvielovehair": "Well stated. The topic has got me all twisted up. I celebrate my blackness, but I’ve always taken issue with the societal pressure to reject my bi-racial identity because of the one drop rule instituted by the slave masters. I absolutely love that her blackness showed up with the gospel choir and a preacher. Still, interesting that Obama was a Black president and she is bi-racial. Perhaps who you marry creates the distinction. Obama was married to an unequivocally Black woman so it centers the perception of his identity as a Black man, but Meghan marrying a white man creates the bi-racial label.", "neicybrownz1": "This right here @elainewelteroth", "emsaads": "@sneweyy interesting", "lizzlivinglife": "💛", "emily.dig": "Thank you for posting this. I have felt this even from the popularity of Basquiat. No one talks much about his Puerto Rican side. Some people have the ignorant perception of defining what others “are”, with little room for the individual to define themselves first and foremost. They know how to use their mouths but not their ears. And their eyesight is another story. 👌🏼💙❤️💚", "mariel__fox": "@robogley read", "donvanvliet": "@marniekeeling thought u might appreciate this.", "giannedoherty": "@elainewelteroth loving this dialogue! I’m bi-racial. My father is a US Diplomat so I grew up mostly overseas and every country we lived in I looked like I could be from there (Ghana, Honduras, Dominican Republic etc.) My very Irish looking American Father always talked to me about race and being a woman of color in a way that my Belizean Afro-Caribbean mother never did. Growing o my Dad always told me to check both black and white boxes. He taught me to claim both heritages and not deny one over the other. Maybe because I didn’t grow up in the States and was always identified as the “American kid” this was much easier for me, I never felt I had to choose and I’ll always identify as Bi-Racial. I loved seeing Meaghan proudly weave so much culture into the wedding. And I always get a thrill when I see other Bi-racial women @elainewelteroth @hannahbronfman @ariannagab @halleberry @oliviamunn etc. It’s like a club in my head of people who understand some of my journey. Straddling different worlds, cultures and expectations. 💕", "fmariedarling67": "Anyway she’s not white , I am black I have two children like Meghan , if you see Meghan before when she was a little girl and now it’s really different , my children is really proud of me despite i am black", "netanyae": "@soigne_quaintrelle", "pattyb.co": "Posed this same question yesterday. If she was a few shades darker would the worlds tone different. Sadly to say, yes it would be.", "ajableubird": "I do think Prince Harry would love her a few shades darker and with her curly hair. That’s all that matters. They can’t control what the world says or their family thinks", "summertoi": "I do understand the need for this question...but somehow it feels dismissive to Meghan Markle. I would guess she would be mortally offended at the reference to her passing as white as much as she would be to an inference that she will somehow have it easier, which we know in some ways is true and in others not true at all and beyond that, the question of would she be accepted if she was someone else entirely, someone more in line with a global definition of black. The burden on her shoulders is great enough to bear without the minimization of it because she’s light skinned.", "da_fashion_artist": "@elainewelteroth process at home boo. You still have biracial work to do on your own.", "pedromorton": "Well said", "makimoran": "Such a great point. Thank you for articulating it. As a biracial white/Japanese woman in my 40s I struggled in my childhood to identify with either race. In America I was Chinese and in Japan I was a foreigner, and this tortured me through my 30s. Now, I find it less taxing to explain to others who I am and am confident in my own skin. My 19year old niece who is only 1/4 Japanese looks 100% white but proudly identifies as Asian. The difference in her experience vs mine shows me that progress is being made slowly but surely. ❤️", "valeandrea77": "@angiem_14", "samatapattinson": "So well put!!!!", "missmarciac": "True. Well put.", "agmakes": "Wow, thank you. My whole life, racial identity has been a confusing struggle. Why is it so hard for people to respect that someone identifies with BOTH of the cultures they are from and also celebrates who they are?", "tonyamichelle": "Meghan could not pass for white, especially if she didn’t have her hair permed. She’s a curly head girl, like me.", "moprahmosley": "@allisonb105 @driannabavis thought y’all would appreciate this!", "brandeewilder": "We know that if she were immediately identifiable as a black woman there probably wouldn't have been a chance in hell that she would have been \"accepted\" into the Royal Family. The thing that has given me such delight is the fact that there is a record (though they have tried to censor it or erase it) of her unapologetically identifying with who she is not only as a black woman but a feminist. As a grown, educated, empowered and self-aware woman it is crystal clear that she is aware of the enormous platform she has been given. Just like anything people of color have ever done or been a part of, being biracial is now acceptable because they have found a way (so they think), to repackage, repurpose and regulate its constructs. Trust and believe there is an intention or belief that they will be able to control the narrative of the first biracial Princess, but just like Meghan has shown in the past and what she and Harry demonstrated through the different themes that were woven throughout their wedding ceremony; it's a new day for the Monarchy ... whether they know it, or not!", "jociecampbell313": "Well said!", "andreaoseland": "❤️❤️❤️", "_thehalfrican": "This was so well said and I’m so glad that you said it. This was on my mind and it is interesting how these labels get picked. Bravo 👏🏽 @elainewelteroth", "claudia.seay": "What a question 👌🙌🙌❤", "creatingjenn": "I never felt comfortable labeling myself one or the other. I believe we should be able to embrace both and so should society regardless of which side we favor. Maybe if she wore her hair curly was out in the sun more and had a tan the media would of chosen for her. I am glad we are embracing the biracial term. I am so happy that loved shine through and Meghan’s whole ceremony showed that she was proud to be a black woman as well ❤️❤️❤️", "johnnietangle": "I whole heartedly agree with this statement. I was wondering if her skin was little darker they would have been forced to use the term black! Using the term biracial seemed to make her more acceptable to their family. I even read her royal bio that focuses on her activism. It is very interesting to see the spin placed to steer acceptance.", "lisamartinfoto": "@fortheloveoflily", "mikarebecca": "@kriskrantz", "_sasha.h": "🙌🙌🙌", "vivianeairesskin": "@xai_c", "cc2312": "@marianotsowhite all of this", "thefreshprinceofphx": "I know this isnt important to you but I died 8 months ago we need to speak I sent the news clip to your dm", "mustard_seeds_move_mountains": "@manyhorizons read this what do you think", "tamiblakeghosh": "I love the discussions here. I’m biracial - Black and Japanese. I use the term biracial. I look more Asian to the eye unless you’re privy to the blasian “look.” I felt like I was at home in south east Asia. I believe that being Asian passing or white passing has a lot to do with self identification. You never want to deny a piece of your heritage and much of where you fall depends on how the world perceives you. I would not fit in Japan so claiming I’m biracial clears things up. I truly believe that I am a black woman and an Asian woman and can culturally relate to both. That’s a blessing.", "txparr": "Love the dialogue!", "jacobtobia\nVerified": "Verified", "ellechanel_": "Well said!!!", "askdrv": "🙌🏽 .. No not ready for a black duchess so “biracial” .. aka 1/2white makes it OK .. or not ALL black or ALL “bad” .. it’s a shame .. If it was William she was marrying would it have been OK to be “biracial” .. im not so sure .. I appreciate you highlighting this because IT’S our reality! We’ve all been made to choose one or the other early on in life and often been told numerous times we weren’t black enough to be black .. I know im exhausted explaining my #color #heritage to coworkers, and people in the streets ..", "cheenachandra": "Thank you for addressing this. Very thought provoking.", "nextofkimbeauty": "Biracial is easier on the palette... for them. It’s the same way in which they described Obama. When it was good news to report, he was bi-racial. When things were not so great... he was black. Meghan made her blackness very clear (as you eloquently stated @elainewelteroth) in the very personal touches in plain sight during the ceremony. She will do remarkable things and she is well prepared by America’s convenient “pick a side” practices from the diaspora to Detroit. Her gorgeous black mama was by her side through this journey. That’s the Lens through which I see her, that’s who showed up. She’s rooted in it. No matter how she chooses to identity... I respect that 100%. But we see you Meghan... and we’re proud you represented. I hope they have nappy haired red headed brown freckled babies rockin’ a #wutang bib.", "ikirstenrussell": "Well said @elainewelteroth", "fortheloveofmash": "@hepburnldn", "danniurq": "Wow. My sentiments precisely. Could not have been stated more true and so eloquently put. My thoughts were perhaps the word “biracial” coincides more with royalty in the minds of society (and what they are more comfortable with), opposed to linking “black” with royalty. @omijmaya @eraineyb @swagbychi @xhosa_biko @mrs_daphene_mitchell", "jacksonmaeve_23": "You are such an inspirational being and I wish to inspire and act exactly like you once I am a bit older. On this topic that you wrote, it includes race, yes, but also love. Love is such a powerful thing that cannot be neglected without suffering consequences from the changing of one self to even depression and further. If he had fallen in love with her with skin a few shades darker and her curly hair showing, would the royal family still make room for her and possibly more generations to come even if he loved her as he does now? Times have changed, hopefully they have, too. Thank you for providing such an interesting topic for me to write about, I haven't found much to write about this week for some reason; nothing inspired me enough. Anyways, hopefully you see this. You don't even have to reply or like this comment, I just want you to have another factor to include! 💞", "mayaxplore": "@bon_ton22 this", "matthewready_objects": "Very well stated. Thank you.", "shehabssawy": "متفاعل اي حد يعملي شوت أوت ومردوده", "ffrenchiestyle": "I love this post @thersdaysblog it makes me think of your beautiful girls and my future children. Love is Love", "ecca1980": "@elainewelteroth I thought about how and when the media decides to someones biracial heritage. For President Obama, it seemed as though his biracial heritage is often omitted so that he could stand out (whether good or bad). For Black people that supported him, he was \"The Great Black Hope\". For those against him, he was \"the Black man tearing apart America.\" Either way, his blackness was associated with his perceived success or failure. Conversely, it seems as though Meghan's biraciality is used to have her \"fit in\". Had she had two Black parents, I think the media would have painted her marriage to Prince Harry in a more controversial tone. Her not being \"full black\", and visually being \"racially ambiguous\" helps \"soften the blow\" to those not ready to live in the 21st century. But thankfully for us, Meghan has fully embraced and lived her African-American culture. And she put it on FULL display in her wedding. She had a gospel choir, a Black cellist, a female African-American preacher, and an African-American pastor who quoted Rev. Dr. Martin Luther King, Jr. and spoke about slavery in a church owned and operated by the British monarchy, who are descendants of Germans. Her Blackness was on full display, right down to the moment of her leaving the church, amid tribal chants from well-wishers and the choir singing \"Amen\". Amen, indeed. #ForTheCulture ✊🏾✊🏾✊🏾", "natasha_ward": "Yes", "bellesaco": "@girlpowersupply", "kyajohnsonn": "It doesn’t matter if she can “pass” as white in my opinion. Being mixed myself it’s actually really annoying because it just feels as if we aren’t apart of our other ethnicity by saying that. She is black & white. She’s not just white. She’s not just black. Megan is who she is the shade of her skin does not define her w that. However I do get what ur saying.", "iamlynnmona": "💯", "carlas.abreu": "People want their black/brown/biracial culture to come from white/white-passing bodies. Well said Elaine! ❤️📒✨", "lexmcfly": "Mannnn who cares!!! At the end of the day there’s a black girl in the royal family and that’s amazing. Mixed or not she’s black. We know colorism is a thing but Do Not try to take away from that or from Who She Is.", "wyorig": "Thank you for mentioning this! As a mother to a biracial child, I noticed they kept using the term “biracial” & not “black” as they have with others such as Obama & Hallie B. I too have talked to ppl, but they weren’t hearing me. I do agree with someone who said the term is based on what they looked like. I almost wonder if it’s a subconscious thing. Kind of like, she’s entering into this “white” Royal Family and maybe it’s easier to accept her & the idea of “blackness” if the term biracial is used. Just a thought.", "nati_hells": "you’re reaction gives me goosebumps, points out so much I’ve been thinking of 💕", "sincerelytma": "EXACTLY", "aynsleykristine": "I couldn’t agree more...so well said!", "passport2hautebeauty": "If you'd travel to America you'd be called a Black Britt. Black is going to be your category. Britt would be your hearsay via hearing you speak.", "goodgirlmel": "💯", "pamtalbothandmade": "I find it interesting how many people who identify as black or African American object to #MeghanMarkle. Frankly I find this need to label her a manifestation of the problem in this country. As a woman in a family which has always identified as part of the black community but is often not accepted because we are too “light” I find this trend disturbing because to me it brings to light one of the major issues in our community - the obsession with skin color. My grandmother suffered with it, my mother, me , my daughter and now my grand-doughters. Enough! Meghan proudly showed her heritage in her wedding. She seems to accept who she is and she showcased that. What the media call her irrelevant. We need to stop worrying about how light or dark we are and unite as woman of color.", "gracie_d_valentine": "@elainewelteroth I was thinking on similar terms..up to Meghan, every other being that had a black parent was considered, African-American or Black, now with her presence, all you hear, is mixed race or biracial...There is a clear message here from media having a problem with saying what she is...However I think Meghan made it clear at her wedding that SHE IS...🖤❤💚", "_kali_girl": "🙌🏾", "chillytrb": "@elainewelteroth Thank you for forcing us to ponder these questions. I too have been wondering exactly the same thing. Black women in general are still largely found to be palatable to most Americans if their physical trait are more similar to those of White women, ie fair skin, straighter hair, and not too curvy. I wonder if Harry had brought home women who looked like Serena Williams, what would the response been in the UK? Or what if it had been William wanting to marry Meghan, as his children are the most direct heirs to the throne?", "nakitaustn": "Thank you 🙏🏾", "blushnink": "Agreed....and I even sometimes feel the term bi-racial is used in the media as a qualifier for the role. Because black has such a negative connotation, that if the position was one not of prestige then she and Barack would be classified as just black.", "celiasophie13": "@nashanoah the comment!", "adeline\nVerified": "Verified", "rosies5cafe": "Exactly what I was thinking...", "mogulmoxie": "I was wondering the same thing @elainewelteroth ! Very well said", "msbeams": "This.", "nichellecole_milan_nyc": "It’s great that you raised this issue. Biracial children/ adults are often pressured to chose a side or deny a side of themselves to the point of denying the existence of a parent and their heritage when they shouldn’t have to. I’ve never like this side of black culture- which is very common in African American culture specifically. I understand how we got here but we cannot stay here. Anyway, I hope this conversation continues.", "ashh.jr": "Any drop of blackness invokes side eyes and disapproval it seems, but the amount of melanin in her skin seems to overshadow even that and it’s so ignorant of the royal family to include skin tone as a factor in whether or not she should be accepted. The concealed prejudices will always fall on her though, despite the marriage. And the burden will be on her and her children and possibly her grandchildren too.", "marmarfrick": "Thanks for writing this. A lot to think about.", "ashieisjaded": "I’m so glad someone pointed this out", "sha_knee_ka": "@keishabee84 @naturalmuze @bittersweet4u This crossed my mind yesterday too.", "wisdominred": "Yes if she were a bit darker biracial wouldn't be the buzz word. Black would be. We saw this as you said with Obama and Berry.", "briana_hicks": "This is all 💯 ... but what if her hair doesn’t curl. I’m mixed and have my moms Caucasian, straight hair. I think there is also this idea that all biracial people look the same. I’m discussing hair because I saw many other posts about people wanting to drop water on that hair so it would curl up, as if she was any less black with her straight hair. That’s always the weird thing about being mixed is the constant “are you this or that enough” anyways this was an incredible piece of writing and as a mixed girl myself i was beaming to see her have this moment.", "livhalcomb": "Mother daughter love ❤️", "clschill": "I wonder about this often thinking about my biracial children’s future.", "mira_mira_on_tha_wall": "However I think we are validating ourselves when we see this and truly Idgaf how whites perceive me as long as I'm paid im both perceptions. I hate colorism but it's alive and well and we gotta redo history we gotta see black as beautiful and worthy not black as when we part of the royal white family we finally made it....Damn the approval of white America black is original it is first it great and it is forever bc it is resilient and regal #WAKANDAMINDSET", "3xotique": "Interesting. I would love to hear these sentiments with people of different racial identities Asian/White - I’m wondering if they have the same complexities or identity struggles.... or is it just too difficult to have “Black” included with anything because of the stigmas, stereotypes and strong culture behind our people. @fedmezie (your thoughts?) I’ve never agreed with the term biracial because it’s like people expect a certain exoticism, but then again I can understand what it may feel like to “pledge allegiance” to one racial identity. Quite honestly I wasn’t really interested in all of these things until I reached adulthood because I remember the black community glorifying the idea of being biracial and all of us others that were just Black or just African were considered unequivocal or boring (SoCal 90s-early 2000s)", "iamouleye": "Elaine, I think the biracial bit has more to do with the fact that this is happening in England and not the US. I wouldn't call her a \"white passing woman\", because of all the Black Culture that she brought into that ceremony. The British census has boxes for people who are part Caribbean black, part African black, and recognizes all other kinds of other mixtures. I remember being struck by that when I lived there. And as for the US Census, I have always made a point to check both boxes (black+white), just to mess up the idiotic divided system which has not made room for US in this country.", "rhya.jhislaine": "👏🏾Outstanding. Simply outstanding. 👏🏾👏🏾💕", "ryanrocheny\nVerified": "Verified", "alyshalight": "SAME. I, too, have noticed this bc it’s such a stark contrast to how every other celeb has been labeled (esp Obama being labeled as the first black president when he is biracial). It’s been fascinating to watch, and I do believe it’s because Meghan largely passes for white. If she were curvier, or rocked her natural curls or had a more olive tone to her skin, I think everyone would call her black - and she’d get everything that comes along with it, including the burden.", "imanaina": "This commentary!!! cc: @aishaimanj @ashantikm", "simply_stacyb": "Omg I’ve been saying this all along! And I lovvvvvve her! But let’s be clear. Her skin tone makes them “comfortable”.", "cordula_kenn": "I agree 100%. As a child, I was always saddened when my white father was just seen as nonexistent when I was called Black. On the other hand I never wanted to be thought of as denying my Blackness if I pushed the term biracial. I wonder if Meghan herself is the reason the term is being used—if her publicist/royal publicist is making it known the media must use the term. I am proud of all parts of my heritage, but it is a socially layered identity for sure.", "justanna_c": "Yes!! I was thinking the same thing! While I am sooo happy for Meghan and Harry, it is not lost on me that this is the first time the media has continually identified a mixed race person/celebrity as \"biracial\" instead of \"black.", "mika.roque": "She literally had to throw her blackness into their faces for them to accept her biracial-ness ✊🏾", "lavitabella0510": "I absolutely agree with you, @elainewelteroth !", "adamrblue": "Great thoughts.", "minaa_b": "This caption is amazingly written. And that question is so valid!", "itskrischelle": "❤️❤️❤️❤️❤️❤️", "anaaugustaribeiro": "@anaflaviaribeiro leia", "lovadelicieux": "great points but sadly this is how it is, until the royals or someone of (sorry to say) white authority sheds light on a matter, it isn't taken seriously or even recognized. for example one of my coworkers wife has been pregnant a few times and each pregnancy she showed signs of having Hyperemesis gravidarum, (which affects 0.3-2.0% of women). Sadly however it wasn't until Kate was diagnosed with it during her pregnancy, that the world of medicine and regular people alike realized that yes, this morning sickness game is REAL, and life threatening at times, and hey maybe those women weren't just complaining cause they were weak or whatever. my coworker said that his wife usually would be almost on her deathbed and the doctors never really took it seriously, they didn't have the right medical tools because they refused to recognize that her pregnancy truly was draining her in a way that differs from a normal pregnancy. now since Kate has come out with this condition my coworkers wife who recently became pregnant again showed signs of having Hyperemesis gravidarum, and all of a sudden the doctors didn't even look twice, immediately they had her on IVs a nurse would come in and check on her every single morning and take care of her immediate needs, it was a completely different experience he said. not trying to bash the royals or anything but people need to stop this foolery of waiting for a non coloured person to legitimize a condition or social construct that we 'everyday people' go through", "noirecarrieb": "@elainewelteroth , you are in my head. I watched with joy because she is black and sadness because the media and everyone else calling her biracial (which back in the day, they would say mulatto). And it bothered me because it's just another way they can say she pass for white. I felt unhappy for thinking that. Before Meghan, Prince Harry dated a dark woman from Jamaica. Would they have accepted her, as easily as they did Meghan, if she was Meghan and not biracial?", "mohd__saizz": "So beautiful", "alltabb": "It kind of reminds me of what they did in South Africa to separate the blacks. They called people, what we now refer to as biracial, Coloreds. This was a strategy to create divisions among the Blacks. We as a people should embrace the term \"People of Color\" to unite us and by doing so making our ranks larger. This would turn the tables on those who seek to divide us. Sending the message that Brown, Yellow, and Black people are one. Maybe then their silly racial constructs will end.", "nirambonaa": "@a_jaynaba", "all_american_grl": "Well said.", "demigaad": "Asking all the necessary questions", "brookedacrook": "Beautifully and timely said", "minalo": "I thought I was the only one who noticed the media saying “biracial.. biracial American... first biracial marriage” it was overwhelming. I was confused that they didn’t just call her the first American married into the royal family.", "hadderly": "@thefriskybrit", "macymosner": "Love you, Elaine", "desi_k": "@elainewelteroth PART II I was pleased to see so much inclusion of Blackness at the #RoyalWedding. @SerenaWilliams in #cornrows, Mama #DoriaRagland in #dreadlocks and Black #BishopMichaelCurry preachin’ about the strength of slaves and quotin’ #DrMartinLutherKing, the smooth and jubilant Black choir, the young brilliant #cellist @shekukannehmason I thought, “well, a’ight now!” 👰🏽💕🤴🏻 I must admit that it surprised me and I felt much of the inclusion was largely of Harry’s doing. Though lovely, the lens of #feminism I’ve seen #MeghanMarkle speak through has not been very intersectional and as we navigate #policeshootings, indiscriminate phone calls to the police by white people for Black folks just being Black, rises in race-based hate crimes and an administration that refers to Haiti and African nations as #shitholes, it would have been powerful to hear Meghan’s voice speak clearly to those issues. Race is tricky and we can’t dictate “how Black” someone is in their soul and spirit through their skin tone and actions - though I, admittedly, have done it. 🙋🏽‍♀️ I do believe the stage was set at the wedding for the tone and direction Harry and Meghan’s relationship and reign will go in terms of a global conversation. Through all of the blight and ugliness we’ve had to navigate over these past couple of years, it was certainly nice to see an emotional display of love (I love how Harry looks at Meghan), Black folks centered in a beautiful ceremony and lovely fascinators. PART II", "donie6877": "Congratulation", "pandorasykes\nVerified": "Verified", "dont_forget_to_have_fundgren": "As a biracial woman who doesn’t “look biracial” (whatever that means), this...... 👏🏾👏🏾👏🏾👏🏾👏🏾", "tash.berting": "Everything I didn't even know I was feeling 🙏 thank you for putting it into words!", "ashtonswinford": "Great point!!!", "portteiaxaraiya": "Exactly", "c_the_goddess": "Well said @elainewelteroth", "ama.rouge": "@kimmyandthecity @elainewelteroth through all of this. It's very easy for commentators to point fingers and say she's not using her platform to represent issues in the black community therefore we immediately have the right to question her blackness or affiliation to her blackness, but it is far from being that simple. Additionally she has just married and as most know when you marry someone you also marry their family, so I ask how common is it for newly weds to take their time getting to know their partners family, settling in, building good relationships first? Pretty common I would say. All that is still happening royal family or not. And I will say it again for the people in the back, she is a HUMAN first and foremost. Again Kimmy + Elaine I just want to make it clear I'm commenting on many points that have been made along this thread, I'm aware they have not all come from yourselves, I responded to your thread @kimmyandthecity as I wanted to touch on some of what you said + the rest of my offerings have been general response to what I've read along the thread @elainewelteroth. We don't have the one drop rule here (again, I'm aware the UK and USA have different histories) - and I have to say I'm thankful that we don't - personally it is something that really annoys me - I find it extremely narrow minded + disrespectful. I find it dismissive. Of course on a personal level i respect + appreciate the right of a person of mixed ethnicity to choose how they identify. I don't feel society has the right to dictate to them.", "sarrjamois\nVerified": "Verified", "aniquemonae": "@elainewelteroth and this is exactly why you are my play cousin in my head ❤❤❤👏👏👏💥💥💥", "imthatgirlnatasha": "❤️", "kadiiddjaa": "Preach 🙌🏾🙌🏾👏🏾", "nathanielallyntaylor": "Thank you so much for saying this! I’ve been thinking the same thing the past few months.", "lholt0328": "At some point we should all recognize that two people fell in love, wanted to get married, and let it be. Will they have issues; yes; will every move or wrong move be blasted yes. But they r prepared and chose love over everything else. While she maybe the first woman of color to marry into the Windsor House, Emma Thynn, the Viscountess Weymouth (Nigerian and English) went through this when she married her husband Ceawlin, Viscount Weymouth. The Marquess and Marchioness got married despite his family, other than a sister, choosing to attend. At some point love leads. They r working to make the Longleat House a home that the Marquess never had. Perhaps her hair texture is more coarse or skin is more my color. It doesn't matter to me because all I see is two people who took a stand for what they wanted and the future they wanted to build. I hear u, but right now I'm just choosing to see things another way.", "dominickhiddo": "@elainewelteroth nailed it! ❤️", "ndutawsk": "The caption...what we were talking about yesterday @denise_mpanga_", "ikoligboh": "@aoligboh @ebyoligboh @ijeobi really interesting discussion", "digitam": "Megan Markle identifies as biracial. She has been quoted expressing this identity. She doesn’t identify as Black. This is why the media has latched on to the term when speaking of her. I think if Megan expressed that she is biracial but identifies as Black the media would identify her as Black but still mention her white ancestry as they did with President Obama who does identify as Black.", "iammalaika": "Well said! On all our minds too!", "nydz34": "#reallywellsaid", "everybodylovesela": "@theaveragechick", "sparkle_may1st": "Well-written Elaine and indeed intriguing. It’s as if ‘biracial’ is somehow more palatable than Black. Meghan’s inclusion of a preacher and a gospel choir told me everything I needed to know about her thoughts on ‘passing.’ They’re a lovely couple who’ll continue to do brilliant work across the globe.❤️❤️", "theoryofgaia": "The term “biracial” is used all over the world with people who are mixed race. The media using this term in describing Meghan Markle is nothing new. As an African woman, I grew up in Zambia where there’s space for black, white, mixed: other terms biracial or colored. It is here where you stated so well that people are forced to pick. I find it honestly strange when biracial people are forced to pick one when I know so many mixed people in the world who identify with both and there’s nothing wrong with that. I myself am raising biracial children who are being taught to love both their culture. Society can judge, but the advantages and pride for both parental backgrounds cannot be understated. With ❤️ founder: Haamacha", "joymoylerinteriors": "NAILED IT!!!!!!!!!!!!!!!!!!!!!❤️ I say this with delight in their Love and all the wonderful things it can bring for the world. With their philanthropy, her bringing forth more awareness of young girls lack of feminine care and bathroom access. How sanitary products are considered taboo in many countries - leading to young girls dropping if of school. I believe Meghan and Harry will continue to bring important issues to light. But yes, I’m certain he met many other women who look more like me, and her Mom throughout his life. He’s making changes in the Royal Family for sure. I just cannot wait the babies! Who may very well look like Meghan’s grandparents. It often happens that way.", "millieisaac": "@callyapril", "xaintella": "Here in England we see her as mixed-race, 'biracial' is a very new and american term , the media use to describe her (as she does herself) which comes under that mixed-race umbrella anyway. We don't see her as black because in British eyes her heritage obviously is of a mixed one. Love her and Harry 💓", "mshopnyc": "Thank you for calling this out!!!", "missfafi": "Also just ❤️ the nose ring. They are just breaking down barriers over there. 🙏🏾✨💪🏾💗", "delinamedhin\nVerified": "Verified", "pinklemonadebyrp": "Very thought-provoking piece! @elainewelteroth 👌", "uhurazulu": "Yes Elaine! Thank you", "jeremy_mcclain\nVerified": "Verified", "safraducreay": "She’s a Dutches. I think it’s important to acknowledge that. Also, in the UK, mixed race is incorporated into our lexicon. You can check mixed race on a questionnaire. She’s been accepted as that in the press in GB since the beginning. Matter of fact, the press would beg the question “is harry really going to marry a mixed race divorcee” so the fact that we’re more comfortable with that only puts us ahead slightly. But it’s what happens now that she’s in Buckingham Palace that will be interesting. Will she follow tradition or will she shake things up like the late Princess Diana did.", "brandicedaniel": "Wow. I was thinking the same thing, but your wording was so perfect and spot on!", "kyndalla": "Your questions are valid (of course!). I think we already know the answers.", "dsneed355": "If she was passing for white, wouldn't she say she was white? Would her mother have played a central role in everything?", "wlovemonique": "Personally I don't look at Meghan & think she \"passes\" or could \"pass\" for white....I don't get that she sees herself that way either....as she proved tenfold EXACTLY who she is & that she is UNAFRAID & PROUD of EVERY \"drop\" of her \"blackness\"!! #PRINCESSMEGHAN #DUCHESSOFSUSSEX #ROYAL 👰🏽👰🏽🙌🏽🙌🏽💖💖", "maychaves": "Perfect! 👏🏾👏🏾", "anali.wong": "YE 👏🏽 ES", "oliviajacksn": "@marthajackson_ read this!!", "tamar_cl_ig": "@kaybtoyzz", "djfranchella": "I disagree that it made a difference if she was darker bc the queen and everyone knows no matter how light she is they cannot control the little brown babies coming so I think it was just TIME. But point well taken! 👑👑👑", "bl.college.counseling": "@pantsuitpolitics", "marsharandolphphotography": "YES TO ALL MIXED, Biracial, interracial or the infrequently used term mulattos. We are beautiful, smart and we do have a place in this society. Whether it's The president of the United States, a princess amongst the British royal family or a schoolteacher. We no longer have to tix the \"other\" box. We're increasing, we're here to stay, and we are strong. We will influence the world and bridge the gap with love instead of hate.", "davidlee1956": "Well said, Elaine!👍", "girlgangcosmetics": "I couldn’t help but agree with your caption! 🙌🏽", "re_marz": "Insightful and thought provoking observations.", "leeasmithjr": "💪🏾💪🏾💪🏾💪🏾", "bigmommykane": "Well done.", "anumarie": "💯", "_alinasmashi_": "Thank you for your point of view and comment! I've been waiting for it! ❤", "ericnwanso": "Well said , insightful and I'm glad this will start the needed conversation and progression.", "iamgayima": "Thank you for sharing your perspective. I really believe that you just shared what many women of African decent are thinking, regardless of our level of melanin. What does this REALLY usher in when it comes to combatting colorism in our communities and when dealing with other racial communities?", "morganmackenzz": "@sarahjones44 Elaine always breaking down the thought 🤔🤔🙌🏽", "_ping_pong": "That’s what I said! The question still stands...if she were a few shades darker, would she have been accepted 🤔🤔?", "nzingawattsharper": "THANK YOU!", "danielleh31": "So many thoughts. You could take this so many ways. In my personal opinion the term biracial is a hack. No ones DNA is that clean. Her message through her wedding stated she knows who she is. The royal family knows who she is and if the media didn’t know they know it now. If you want to use the term biracial go ahead but when will we push that character, values, behaviors are what should matter. There’s only one race...human race and until we get ourselves together collectively we shall never truly be able to progress forward. Oh and let’s be real The now Duke of Sussex was never going to marry a Caucasian woman. His behaviors always showed he needed someone who was going to elevate and challenge him (and not to say that white women can’t be that but he sampled too many it was clear he hadn’t found what he was looking for in that select circle). Again you can take this so many ways. Could it have been harder if her skin tone was deeper absolutely our history has not come as far as people think but like my family always says it’s how he treats you and it’s clear Harry is determined to treat her well so that’s all that matters. It’s also why I was very comfortable marrying my Norwegian/Mexican husband. And my future child can call themselves what they like. It’s about what makes them comfortable because they have to appease no one. Just treat peoples well. That is what I hope the message the Duchess of Sussex passes on. Technically the family doesn’t push politics but this is a message that Harry and Megan can continue to promote and shed light on.", "laurenadrianne3": "@ruthie_c @just_tishtash @siobhan_world123 this is exactly what I think.", "cdsmith230": "\"They\" the caucasian world accept her half white look but it was clear during the wedding that they still struggle with the culture of people of color. Those faces at the start of the sermon clearly expressed a lack of acceptance and it was made further clear during the gospel selection. We \"people of color\" should be over caring and craving their acceptance it should just be what it is two people getting married. I hope God blesses their union. Thanks Elaine for starting the dialogue: because as I watched the wedding I wondered if a woman with a deeper skin tone would be give the same respect, honor, and consideration.", "lunadillamia": "❤️✊🏽✨", "lady_birbeck": "I'm black, my husband is white and our son is a mix of both of us (he's one of those that can pass as 'white' under the right circumstances) but it would be very selfish of my husband to call him white regardless of how the world perceives him. He is a mix/biracial child; he is definitely not White or Black. Choosing one over the other to me means he will be discounting the racial heritage of either me or my husband.", "laurnie.wilson": "Thank you for using your platform to draw attention to this! As a biracial woman who grew up having to check “other” on standardized tests (which was always demoralizing on some level), I feel this shift towards being able to identify as biracial is long overdue. We have a long way to go, but I hope Meghan will continue to create space for the discussion and celebration of the interracial experience. Our voices need to be acknowledged and heard.", "tesslyon": "@ange_brayton girl also this right here", "theartof_zoe": "@joannatijuana WORD ☝️🏾", "tvboston": "The mixed “race” conversation is complex and nuanced as you have articulated it. The reality is that many people of color in nations that participated in colonization and transatlantic slave trade are genetically of mixed ancestry. The reason for erasure is that race and racism are based on the construction of whiteness and the privileging of white identity. My African ancestors recognized that we do not choose our ancestors and so should recognize all our kin. Yet no matter that I know my ancestry includes Wampanoag, Tauxenant, Irish, and possibly German as well as sub-Saharan African — no matter the lightness of my skin tone and that it signals mixed race ancestry — society sees “Black.” And the reality is that culturally I am Black and American, even while embracing the “African” American label. My cultural orientation is Western Hemisphere. I acknowledge and honor the complexity and nuance of identity and ask why whatever the identity our greater society cannot respect it all as humanity? At the core of this conundrum is a hegemony that elevates the superiority of one social identity or identities (race, ethnicity, gender identity , nationality, sexual orientation, sex, religion, socioeconomic condition) over a marginalized and oppressed other. This may sound political, but for me it is a spiritual evil to which I commit to being in the words of Rev. Dr. King “creatively maladjusted.”🙏🏽🙏🏽🙏🏽", "marcia.reid__": "She’s not black, she’s biracial and that’s what we need to understand point blank. There is room for biracial so much room, it is enough for them to be the face of blackness all the time!", "rbahizi": "@cocoafschanel", "undergroundhairdresser": "♥️Beautiful Moment In Time🙏🏾", "johanna_dream": "👍👍👍👍👍👍👍👍", "hellofounder.co": "Spot on , Spot on", "taylorjademarie": "This ♥️♥️♥️", "girlnamedgal": "So much to say about this...I've lived in the UK for over 12 years now and honestly racial bias/racial identity is so nuanced here it's still hard to wrap my head around it. It's entangled in classism which makes it more subtle than any other European country I've ever lived in or visited (cough cough Holland is the worst and may not have accepted a biracial princess), so I think it speaks volumes that Meghan, a former actress was welcomed without much (public) fuss and that she was able to have that choir, that pastor and those guests; Oprah, Idris, Serena 😍 This wedding was more a triumph of \"outsiders\" than of any specific race. A sign that the royal family or at least parts of them are ready to face the future; even though I'm willing to bet the Queen had her reservations about Meghan and her family. Yesterday was about a new generation of royals, and the new generation willingly embracing them; believe it not people my age (late 20s/mid 30s)were actually cheering when they said their 'I do's', which would have never happened 10, 20, 30 yrs ago. The UK is a special place, but as a young black Afro-European woman living in London, I was and am f**king proud that Meghan reminded us all that we should be proud of all the parts that make us whole. So yesterday was a special day, even though Brexit still looms Armageddon style!", "matildelenina": "Love you. Questions like this are making a difference in the fashion world.", "shamayim": "I'm glad someone said it. Elegantly put as always.", "lnkbriot": "Race as such doesn't exist for human beings: only the Human race exists (orherwise this word only applies to animals). Also, having an African father and a French white mother makes me a mixed-origin person not a black person: I'm as much proud of my African origins than I am of my French origins.", "secretagentm": "Thinking just the same", "thegoldenyra": "@dre_labz trust Elaine to describe it so eloquently", "jessica_kg_": "@sarahelizabethclark_", "grahamgam": "She doesn’t look white to me.", "ellenroddy": "@meganclarke23", "luciosalvatore": "🙏🏽🙏🏽🙏🏽", "charlottemockingbird": "And indeed these nuances you are exploring are astonishing and important to explore indeed!!! Thank you", "crystaljmc": "In the UK the term “mixed race” and “biracial” is always used if you are of mixed heritage, regardless of the mix. There are many “mixed race” boxes on our equivalent to the census form which have been present for quite some years. I believe the U.S press has had to follow the UK’s lead as the UK are the first to release royal statements etc and “try” to be political correct. Which is probably by the US press are using the term “biracial” so often. But I definitely believe there’s an enthuses on her being “biracial” to identify her as mostly white side, and there is no way she would passed the many royal protocols if her hair was curly. My black British friends and I are looking forward to seeing her possibly have a child which some major throw back from the black side.", "wizalausanne": "@elainewelteroth The fact that you can be, from birth, coerced into identifying as just ONE part of your ENTIRE being, OVER the other equally important side of your life, is TRAGIC. Whilst we have our share of problematic behaviours in the U.K, being biracial or mixed is 100% valid in most cases. I don’t believe that Meghan strategically identifies as ‘biracial.’ I believe that she just IS. The product of a WHITE man and a BLACK woman= Meghan Markle-biracial daughter to a white man AND black mother. Identifying as merely PART of who you are, as a mixed person in 2018, is a direct result of oppression.", "miamamone": "@aishwarya.jois our exact convo", "ms.luzana": "The first line of this post is me. But also I adore this discussion. Being not only married to someone from a different race but a different culture, I constantly wonder what my children will be referred to as when we choose to have them. The term biracial is relevant and thank you for bringing the conversation to light.", "kyleenthediva": "Thank you for saying this! My sentiments exactly.", "deena_k90": "Ugh you just expressed everything I’ve been thinking and feeling.", "lax_msy_las": "ALL OF THIS!!!! You’re truly amazing!!!! You never fail me!!!!", "cingstarsnyc": "Absolutely agree and have been asking the same questions!", "koolmoski": "True", "zer0cooks": "Preach ✊✊🏼✊🏾", "bhaman_227": "Nyc", "zsanis": "👌🏻🌸", "lbrown790": "Yes", "allthingsonatural": "Hmmmm...well said indeed 🤔", "jeunneenvie": "Thanks for this dialogue put so eloquently👏🏽 I've been having this conversation with so many lately and even yesterday someone jokingly said to her sister, \"why didn't you marry Harry nah?\" Let me just say that they don't know Harry or the royal family at all. But you know the comment from someone else in the group discussion? \"She's too black for such royalty, hair too kinky, doesn't look white enough\". Now this person is a golden shade and yes has a kinky crown and while I never thought in all my years that I would see a woman who has a few percentages of black in her marry into the royal family, I really do wonder whether a few or a whole lotta shades darker black woman would ever be in the position Meghan is in now. Still, Meghan's mum rolled up with her locs and nose ring, I saw braids up in that castle, Ben E.King and Etta James were on play, Rev M.Curry's address was unexpected but man He was taking me to church 🙌🏽🙌🏽 and many black people and to be honest, it was a lovely wedding. But I wish Harry and Meghan happiness and growing love for each other", "thefreshesthell": "YESSSSSSSSSS. ✊🏾✊🏼", "emilyfcbrown": "@rocatreid", "myrella.victoria.coelho": "Exactly!", "joannatijuana": "🙌🏽", "passport_cutty": "There’s definitely levels to the acceptance. If her or her mother were darker the commentary might change. I totally understand her stance on her identity which actually opened my eyes to realizing how hard it is for some biracial people to choose how to identify. The only thing is because she’s lighter, she can choose to stay in the middle of both races. Because in my opinion, if Obama or Halle declared themselves biracial like her they would be reminded very quickly that they couldn’t be white half a day or half their life if they wanted to because of their skin. I feel like white people would PUSH them to the other side.", "love_fromcheyenne": "THIS!!!", "misstipper\nVerified": "Verified", "bundressed": "Labels as a social construct are there to marginalise as well as attempt to identify with a race. Just a thought Why can’t we just appreciate this as a love story ~ 2 people coming together, and families embracing the new in celebration ~ this is beautiful?. Perhaps it’s a romantic notion or naivety, but seeing the look in their eyes for each other, the love was palpable & it resonated to the thousands (including myself a proudly black Nigerian ‘Windsorian) woman who came to watch and celebrate their union. The energy was electric and it was clear something special had occurred in not only in the royal family but in the UK. Just my opinion but it was wonderful to be a part of. ‘There is a Power in Love’ ✨♥️", "frida_la_blonde": "@neferdidie", "laura_dlcourt": "I’m biracial and grew up in Europe and I was never labeled as “Black” growing up. In fact, it was lovely to be biracial as both white and black people in Europe admired the skin tone, the cool hair, it was trendy to be mixed race. It still is!! When I first stepped into the USA was the first time I was categorized as a black woman. I’m half African, and whenever I was in Africa I was seen/ categorized as White (except in South Africa where race is an even more complex issue). I think this topic depends very much on the country you live in. In the UK I doubt people would ever classify Meghan as Black or White. She’s mixed race (which doesn’t necessarily mean half black, half white) because it’s not about skin tone, it’s about heritage and history. I’m glad there’s a debate going on out of this. People should be proud of who they are and if events like this can make some groups of people that have been marginalized realize that it’s not about the skin tone, hair type, or features, then they’re now feeling more empowered to live their best lives and dream big! 😊❤️ Same thing happened when Barack Obama became president.", "mallen_1906": "@alexbarnettcomic", "laddeell": "I thought the same yesterday when I kept hearing everyone saying biracial", "michelleakosua17": "This analysis is so accurate. Very well articulated.", "social_media_builderr": "✋™I am a graphic designer💫💫. Hit me 👆 to get super cool design🎉 of your picture illustrated and cartoon 🎨character of your self 💯💯", "msleabss": "Such a good piece", "jershay03": "U Couldn't Said It Better #wakeupyall", "frannnelli": "A little bit off topic but @elainewelteroth - do you identify as black or biracial? I’m biracial and considered “ambiguous” and I therefore get challenged when I say I identify as black 😕", "kemide": "I think it is important to state that Meghan herself explicitly stated she considers herself biracial not mixed race which is not a term that Obama or Halle ever identified with i believe", "its_lola_80": "One day at a time. Deep questions but lets focus on celebrating this couple union and ask the harder valid question another time and place.", "cherishk89": "💯💯💯", "ms_riggon": "Its America that love to put label on people. The UK is very different in that way.", "sherspromo": "Also the daunting truth is, like the Honorable Bob Marley Reiterated, That until there is no longer First class and second class citizens of any nation Until the colour of a man's skin Is of no more significance than the colour of his eyes, then there is War. He also stood the times and held the mantle for our Black Royal sister to pave the way for such historical movement, when we must now realize that our consciousness isn't about color or creed but instead, most importantly the need to stand as One. We are all for One and All for One.#SimplyTheBest.", "priyak": "@eternally_expatic read this", "afiajasmine": "Probably the one if the best observations on this topic that I’ve read in weeks.", "marplondon": "Disagree totally. The mix-raced people I know of who ain’t half black HAVE ALEAYS IDENTIFIED both. But for some reason of one parent is black - the mix-race person has always chosen black as their main identifier. Loads of mix-nationalities also identify with NOT BEING EUROPEAN even if born and breed in Europe. That goes for most Asians, Arabs and Africans I know of.. they identify with their parents background - not environment and culture.", "bexlang": "Our relationship and history with race is very different in the UK. I am ‘mixed race’ (this is the politically correct term used), I identify as mixed race and I have grown up with a box to tick here on forms. I live in a country that acknowledges the existence of mixed or duel heritage individuals and while it may not be perfect it is normal to identify yourself in this way and for the media to coin this time. What is more unusual is that Megan is an American woman who identifies herself as bi-racial, the British media identifying her as this, is not.", "misscassrb": "@cokerlicious", "kellejg": "Calling a mixed race person ‘black’ is an American thing. In England you’re mixed, the British media were never going to call her black, so perhaps the American media followed suit. Also, a lot of people in the US that you call ‘white’ would never be called that in the UK such as Egyptians for example.", "lady_fll": "In England we identify with what we are racially. We call a spade a spade. And American media have just copied lol", "someshuga": "Yes they would have accepted her", "lanishanicole": "People can have the 'bi-racial vs black' argument all day long. But, as a mixed-race Brit-Af-American woman, raised by a formidable single mama, what really struck + mattered to me, was the celebration of her + her mama as a beautiful single parent family. There's a reason her Dad wasn't there, + it wasn't a heart attack. She walked herself down the aisle, but their love, pride + connection between her + her mum shone bright. That meant as much to me - if not more in some ways, as all the beautiful nods to her heritage + racial identity. No social stigma, pity or judgement. Just love + respect. Inclusion. Long may it reign. 💜💫🇬🇧🇺🇸", "thevera_nyc": "ALL OF THIS! 👏🏾ALL👏🏾OF👏🏾THIS", "thelmalouwoohoo": "Let the church say amen.", "signeddebbieg": "👏🏾👏🏾👏🏾", "jkvert": "Once its to much to read you’re lyin...get your money tho..it’s thee American way...🤷🏾‍♂️", "nikkigelin": "Why does it matter if she was darker would they call her bi racial?! The fact is she is embracing both of her ethnicities. She...herself has made it clear that she is a bi-racial woman. So many mixed race celebrities automatically call themselves black out of wanting to be accepted and avoid rejection from the white side. Or because of the 1 drop rule. When they are clearly bi racial. Who cares what society is comfortable with. You have a white and a black parent. I have never understood how someone could disown their own parents ancestral contribution to who they are just to make society comfortable. It’s a beautiful time to be alive when you can be exactly who you are. And not fit into a box that makes others comfortable. Proud Mix Chick ✊🏼", "themaiden7": "I think part of her biracial description is her biracial self identity. Barack and Halle self identify as black. Megan self identifies as biracial. I don’t know that she is as likely to be embraced but I do know that she took some heat in the UK for her race even as she could pass (I don’t know that is IS passing as she brings her black mother everywhere and discusss her identity as half black half white). I do think we treat people a certain way based on who we think they are but that goes both ways. I’ve seen black folks say (especially before her relatively black wedding) that she must be passing and that she seems to “run away” from her black identity. Which I’ve not see her do but the perception is she MUST be denying her blackness because when I look at her as I black person I don’t see someone who is likely to have my same experience. It’s all very fascinating. I don’t know if she’s welcomed if she’s more black appearing but I do know I enjoyed watching that very unique for the royals wedding I loved the black faces and I loved seeing their love.", "cocoacentric": "YES! So good, you took the words us Black women were all summoning in our thoughts 💭 and manifested it into words... let’s create more reflective, positive and important dialogue just like this... ‘Healing is in Order’🙏🏾", "s_milan": "What I cant relate to is the notion that she \"passes\" for white. Is she fair, yes, does she wear her hair straight, sure, but do I look at her and believe I'm looking into the face of an unmixed white woman....hell no! In my opinion she has black facial features along with hair that does NOT resemble the hair texture of your average white woman. She's BLACK, no disclaimer needed. I find it interesting the media is not referring to her as the \"black\" woman she is as well. It feels as if they use the term \"biracial\" to validate her acceptance into the royal family & their lifestyle. Like everyone HAS to be informed or reminded that her \"blackness\" is to be tolerated yet not celebrated! She's a SISTAH! Period! Long hair/long nose/fair skin/slender frame so tf what??! Don't forget, as she gracefully walks into a room FULL of white people...she's acknowledged as an OTHER! Please believe they won't EVER let her forget it! I rellish the opportunity to let #BLACKGIRLMAGIC shine & shit on ALL that oppose! SHE DID HER GOT DAMN thang yall!! She's in LOVE, She's become a PRINCESS, & she's representing US all the way!!! Media aint shit. We all know that. Especially when it comes to the depiction of black society, culture, & beauty. Does it surprise me that all these white folks are obsessed with her & her blackness aka \"biracial\" identity, NO. What does suprise me is the lack of acceptance from the black community. As if we dont know we produce EVERY shade, shape, & size. That's a part of the beauty in us. I hope she gives him a bunch of black ashy babies (taraji p voice) & smirks at every white person that belives she does't belong on they way as she lives out her modern day fairytale.", "etiquette_noir_cosmetics": "Haile Selassie", "aspen_cierra": "I was definitely thinking the same thing. I think she gets to be biracial because she can pass for both or at least white but someone like tracee Ellis Ross who is biracial is almost always seen as a black woman", "itsgood2bdia": "I've participated in several private conversations today involving your exact subject matter. As an engaged woman...I 100% celebrate their love. As a woman of color...it feels almost bitter sweet.", "_sandi_jade_": "@_chantelle_marie", "montlou89": "@elainewelteroth oh no question about it, the royals aren't ready for a darker skinned princess. And as a 'biracial' woman myself, I actually got emotional watching the wedding and was so proud, but I reckon their children will marry white people, ultimately killing off any black roots in the family (which I also hope isn't the case in my own family)", "noniecreme": "Extremely well said. 👍👍👍", "limtothela": "Thank you", "sjraheja": "@gabbyteresa", "justtiti": "Thanks Elaine. As a black South African i too come from a highly racially charged background where we talk about race all the time (probably too much). So i found it odd that in all the commentary surround the wedding: not once did i come across a recognition of her blackness, the historical importance of a black woman marrying into this family, the black culture that was brought to the fore during the ceremony.....nothing. It’s like if we don’t talk about it, then it’s not really there. Then again i don’t know anything of Meghan, maybe she self-identifies as biracial and therefore has “lead” public commentary to do same?", "oneworldjournalist": "So true. And the answer is no.", "ddiasonama": "She wouldn’t have been excepted if she was a few shades darker PERIOD", "nrgaylesays": "To note. I think she started the usage of biracial. Correct me if I am wrong.", "videoasfirstlanguage": "Legend", "lady.vivienne": "Really?!?!.... Megan doesn't seam black at first sight... she rather looks like a copy of perfect kate. I believe she is deeply loved by Harry that made sure she passed the test with his mother... and not to accept her means bringing up a huge real scandal special in the multicultural Uk... I think the royal family had no choice but on a positive note I have to say that the world is slowly changing and black biracial or whatever have a voice on this planet more and more every day. we have to be positive about this and Megan is a big part of it...royal family likes it or not. @elainewelteroth by the way ...you are too cool!", "2pakistan7": "👌🏽🔥🔥🔥", "themoyosola": "So well argued. 👌🏾", "dreamnationlove": "@elainewelteroth would love to have you on my podcast talking about this. I’m fascinated by this topic as well. I also think about how Harry will never be king and so in a way to really be himself and make his own decisions. That’s prob a huge reason for his parting days in the days. Really interesting to think about everything.", "simulacra_in_seventeen": "@sydmo7 *frustrating", "ju.mnrdmenson": "And the answer to those questions as we know is... \"Non\". I though of that yesterday, we all did. But those musicians, singers and that PASTOR wouldnt have honored Windsor with their presence, talents and sometimes holy spirit if it wasnt for Meghan. It's like she needed to justify, notify that though you could really see it- she IS black. Or mixed. Or quarterone as the French say.", "beatricevalenzuela": "I couldn’t agree with you more! Does anyone think it’s fucking strange that there’s white people who are royalty? And that only now a non white person is allowed in? In 2018? Did everyone forget all the annihilation and enslavement this kind of hierarchy brought in the past?! What do they represent now? I was getting all teary eyed and then was like wait... what the fuck!!!", "jillianvogelreally": "@hipslipsandfingertips ‼️", "justjune23": "@kk0616 @mkiselin", "fitzwash75": "This is a great dialogue and discussion from top to bottom! However, there is a hidden wildcard in all of this that can easily be overlooked! That’s the power of two mothers who reared their children to be colorblind! Princess Diana with her causes, charities, that continually shines through William’s and Harry’s life that love conquers all diseases and diasporas! Doria Ragland who is unapologetically black as a single mother who after divorcing Meghan’s dad reared a young lady who seems to be very aware and comfortable of the skin she’s in, an allowed that to shine through her ceremony today by saying this is who I am! They are aware of the narratives and nuances surrounding their unusual Union, an in a not so subtle, polite, way they were saying to the world it’s not about my whiteness, my blackness, my biraciality, etc., it’s about as the Bishop said, “The Power of Love!” That love does not care about my pigmentation and how the world sees me, just know that I love you, and that we love each other! When all the pomp and pageantry is over, “Stand By Me,” not my whiteness, my blackness, my biraciality, or whatever I’ve chosen to identify as in this moment or how the media and society tries to fit me into a box, just Stand By Me!", "reynosomuch": "Yes to every single part of this 👏🏽🙌🏽", "lizfoleyesq": "Not cynical in the least. I have, too, found this fascinating from the beginning. I think it’s going to be a wake up call to both black and white people to stop placing biracial people in a box determined by antiquated and racist eras of history. It’s refreshing, and needed.", "ayyyeitsalexis": "Elaine, thank you for vocalizing this. I've grown up feeling pressure to pick one race or the other, not knowing how to self-identify due to mixed perceptions of my racial identity. Seeing a biracial woman be acknowledged as biracial is necessary, triumphant, and so much more. I hope that there is a continued acknowledgement of biraciality in our world, because it's inevitable. It's my everyday, and so many other people's everyday. Thank you, for your eloquence and thoughtful words on the subject! ❤", "theodochia": "Don’t try to pass with the term biracial all blacks in America are biracial. You are Black and be proud of that fact.", "anna_akosua": "Beautifully written!", "j_premps": "So many valid points. I think the term biracial came in to place to help with the acceptance of an ethnic princess among royalists and nationalists. “Don’t worry guys she also has white ancestry too.”", "sade_unique": "She started off black in the media. Remember the story was she was from Compton and conveniently the narrative changed to describing her as biracial just in time for the wedding. In my opinion, this was done to help her be accepted into their world and not so much as an acceptance of her blackness. But regardless, she is intergrating a space previously untouched by blackness and introducing them to the culture, which I believe is a great thing.", "imanibackes": "@kembidoll @alinaaroutunian she has articulated this perfectly", "fa__cam": "@angiedavinci_", "nick_n_nolan": "My husband and I had this same conversation!!... After reading an article about the wedding today, I jokingly stated that \"I wish I could have been the one to marry a prince & live the royal life\". My husband laughed and replied \"no no baby, you are a little too dark\". I got slightly offended and responded that a black women is a black women, so if he married her then he must like blk women? He then smirked at me and replied \"had she been any darker, then she might not have made it herself\". I was so shocked at this thought but after reading your post, he might just be right 😞", "jillian_perri": "YESSSSSSS OMG MY THOUGHTS EXACTLY", "kenyasmiles_": "necessary commentary, @elainewelteroth thank you ❤️", "j0j0drake": "@elstine_ a must read", "thelegglove": "To answer your questions : Probably not.", "sayuriperera": "@kirisha_ @tharushiliyan", "stellarbelle": "You guys sure do think about race a lot. Is it exhausting or invigorating to do so? Neither?", "forvaginasonly": "So well put and so true, all of it. I beg to question as well. But this is where our society is at right now and honestly, I’ll take it. Baby steps in the hope that some day (although taking quite some time) images like Meghan and her Mom as well as thoughts and conversations like this will be no longer awe inspiring and just part of everyone’s everyday life 🙇🏾‍♀️", "elsa.bo": "I love how your thoughts are well articulated. From my perspective I just never thought anything in terms of one drop rule, so even though I was proud for Obama's nomination or Halle Berry's Oscar win, it was clear to me that they were biracial first and foremost. I guess everything in the Western needs to be \"white-checked\" first but the ethnicity is something I won't let the white powers to be decide that for me.", "sjisgohd": "Yes.", "nicolegalemua": "@elainewelteroth I completely understand what you are saying if she was darker I'm not sure it would have gone this far. However, I think as black people we are embracing the fact that she is partly black and now part of a very traditionally white establishment, even though they have an ancestor Queen Sophie Charlotte who was black or mixed. I think it is a true statement of the monarchy being modern and brought into the 21st century. Plus Harry is now further down the line to be on the throne, they don't care as much. Lol", "datariaustinlondon": "@elainewelteroth thank you so much!!!! Well articulated/written! it baffles me and being a Brit myself living in america,i questioned it. why is she all of a sudden accepted in the media as a mix-race women when in the USA,she’s known as a black woman. Thank you and well done to you for all your unwavering hard work within the fashion community!", "jazzakai": "I love this! Very thought provoking but right on the mark, I concur wholeheartedly", "angelas.angle": "A great piece. Meghan however is not the Britain first black royalty. Queen Charlotte, the wife of King George III, whom he married in 1761. She is buried at St. George’s Chapel we the royal wedding was held yesterday. We have such amnesia in the UK about black people in our history that you have to research it outside of the British education.", "yosoybrianna": "this.", "cambria.hicks": "I would like to see her with natural hair; out of curiosity, and, I know it would be beautiful in its message", "frommakebawithlove": "Yes, there is no denying that social institutions have perpetuated the labeling of black and there have definitely been negative implications. But, EVERYTHING from her dreaded mother with the nose ring to boot, to the revival sermon from Chi-town, to the most spectacular, flawlessly-styled choir told me that she is unequivocally black bc being black is also deeply rooted in culture. If she was a darker sister who wore her kinky curly texture but had NONE of what Meghan had, then we’d solely be relying on her skin tone to claim her “blackness” when she could uncle tomming it up! Then what would we say? That she wouldn’t be black “enough”. Every sister doesn’t have to be natural and some bi-racial people actually prefer to be called bi-racial and not black! we are all shades of beautiful and there is only one thing that matters: that we do things #fortheculture and sis delivered us a big W.", "daphnelola": "This", "alexa17_m": "Thank YOU for this!🙌", "thetiffcompany": "This is soooo true and such a great question and point to bring up!", "slipintostyle\nVerified": "Verified", "anniezeina": "@chamomilestea @addiezoller @sirdannygalaxy", "themusictheorist": "Wow", "sophiabush\nVerified": "Verified", "vstreetfashion": "love this as a thought and talking point. i loved all of the pointedly black cultural moments of the wedding. it does bring to the forefront how she identifies herself, how she will portrayed, how this wedding will be discussed in years to come...", "southern_northern_belle": "Been thinking the same thing", "jenni_marie_": "I’m praying she starts wearing wash-n-gos 🙏🏾", "katgirl13": "I dream of a day when we are all referred to as humans and not this or that colour. I have two baby girls and I hate to think they are going to go out into such a judgemental world. ❤❤🌏❤❤", "aglaia9791": "Yes! You, I agree with you!", "iolastar": "You’re so right I heard the word biracial SO Much during the media coverage. Interestingly when the black preacher was preaching and the black choir was singing in that moment she wasn’t biracial she was BLACK. Racism and colorism is prevalent we read and hear the awful comments. Is she more accepted because she married Harry and not William who is in line to be King? So many questions, thanks Elaine for your perspective.", "mixedwithmonet": "In what world is she white passing though.........", "jazzy_nelson": "Your caption is everything!! You said that sis!!", "traciewalkercomedy": "Exactly what everyone of color is thinking! I’m just glad her mom has her locks and her white dad did not walk her down the aisle. That image of her and her mom in the car speaks volumes!!!", "pamfdaniels": "When will we start seeing ourselves as one race— human, with various shades of skin and color of eye and curve of nose and spreading of smile?", "pescaitasalvaje": "@marghovillamil", "goodgaldd": "@elainewelteroth when knowledge of Harry and Meghan’s romance, and subsequent engagement first became public knowledge, I was reading a British newspaper article on the subject - the writer described Meghan’s mum as “Visibly Black” with dreadlocks. The phrase has stuck with me ever since, and your speculation about whether a darker skinned, curly-haired or dreadlocked Meghan (say a beauty like Lauren Hill) would have been so readily “accepted” brought it back to mind. My conclusion is - I don’t think so! Thank you for not being timid about the more thorny social and racial issues.", "evedwards621": "exactly what I have been thinking this whole time. Thank you for feeling brave enough to be candid and share your thoughts during a time in which everyone is just blindly jumping on a bandwagon", "tajaehinds": "This commentary actually made me think wow @kscocam", "caelacudi": "Say it again for the people in the back!!!!!", "miamiisbae": "She looks mixed to me but it right if she had 4c hair or darkskin she would not have been as easily accepted", "heytherejeffreyhere": "I love this!", "super_cali_fragilista": "@bbonz see caption", "ingridrileyjm": "Yes. yes", "cingashemotale": "@carrot2768 @elainewelteroth The beauty of it all is that it is not the ignorant or the naysayers that matter but those like us that can be sincerely happy for our black girl to get her fairy tale and for magnificent way in which Meghan has illustrated her heritage, her blackness - unlike you I was a complete fan throughout as my parents were when Diana got married. (We were colonised by the British here in South Africa) From the choice of priest who read scripture, to the rev. Curry, to that awesome chior and @shekukannehmason who showed such beauty and excellence, to her choice of music and her natural face and her mother’s grace. Labels were not the order of the day but truth. We saw how extraordinary Meghan was and realised she is a custodian of us as she is her Jewish heritage and the colour of her skin won’t prevent her from addressing issues. I am Proud I am overjoyed for her, and I think we as black people need to stand behind her with gusto as the real battle is never in the media it’s in the day to day subtleties she will face. Are we not excited that a new stereotype has emerged, because now they can deny that we are princesses, Dutchesses, royalty - this is a new era, and if we let it it will inform media, television and written word.... let’s write Meghan’s story let’s carve it into history as we did our slavery and our apartheid...", "fashionalita": "Excellent and I agree with everything you said", "dznbyjw": "I’m positing that they use the term biracial with Meghan because of her appearance. She looks white with a tan... so calling her black doesn’t quite make sense to most since race is complete baloney... a system in America that has no scientific basis. Race just means what you look like. Therefore, Obama is black because he looks black. Bob Marley (biracial) is black because of his dark skin and locs. Meghan’s racially ambiguous appearance begs more of an explanation so she is described as biracial. As a biracial person myself I’ve always longed for the universal acceptance of my true “racial” ID as biracial. Truth is, that term is too complicated for most people to grasp. Others need to know if you are black or white. Mixed race people rarely get to live their happy life on the fence where we were born. There is always the pressure to pick a side. I’m happy for this opportunity to have Ms. Markle be one of the first reps of biracial people. First step toward the acknowledgement that yes, we are both, and no, we don’t want to pick sides... no matter how we look.", "jewelrybyori": "excellent food for thought. can't get swept up in the hype without stopping to contemplate the underlying issues.", "chayacrowder": "Proximity to whiteness obviously brings privileges along with it. That privilege along with the extreme class privilege of being literal royalty allow her to distance herself from Blackness (and align herself with whiteness) in a way that society has not allowed for any other multiracial person. Honestly to be a Black slave descent American is to be multiracial to some extent, but whiteness does not absolve people from the Black experience in America (particularly the majority of Black people that can not pass). I wonder if this embrace of biracial identity will serve to break down the ways that race is constructed or compound the effects of colorism and racism for Black people that are not biracial and unable to pass.", "wahoo4uva": "Yes this moment begs the question. And I’m cynical right along with your line of thinking and believe had she been even one shade darker and worn her naturally curly hair she would NOT have been acceptable to them. With my black woman’s lens, I don’t see her as White passing at all. To me she is clearly a black biracial woman. But black people recognize blackness in a way that white people do not, or can not. Or, will not.", "heidipprc": "Best feedback I’ve read all day", "gabriela.valguz": "Gahhh!!! This is such a real question. And I think you are right. Not just for black women, but for any other ethnicity I which women and are lighter vs darker than there sisters. Im mexican. We come in all shapes and colors, like many ethickities. But I know close minded people are. You wouldn’t believe how racist people are even with lighter tones. Like your still too dark. Or if your a little lighter than your girl your are on a different. The entire spectrum is ducked up. We are humans. We have feelings. We have a heart. Color is skin and skin doesn’t keep as fully alive. Thank you for this post. This is all of us. All girls of color. @elainewelteroth", "najwazebian\nVerified": "Verified", "msvalenciarose": "@ms_natty__ read what she wrote.... something I always said about being \"biracial\"", "harlemtoilegirl": "Food for thought", "salstowers\nVerified": "Verified", "kregobiz": "I look forward to the day that she wears her hair naturally.", "styledbyvuitton": "@chetakincaid", "atinamaia": "They are so pretty 😍", "happilymoe": "@_lisaturtle_", "zoebonsu": "Over here in London, England we use the term ‘mixed race’ we acknowledge the blend of races that is within our skin tone. We I travelled to the US it’s very different & for the first time I was simply called a ‘black girl’ which was completely foreign to me. So perhaps they taken the word ‘biracial’ on board due to our influence?", "1son2another": "Definitely a philosophical food for thought.... Thanks for sharing such a unique perspective.", "javereirie": "This struck me too - it is such an important conversation. I’ve always wondered about the place biracialism has in our modern racial awareness movement. There are so many levels to, and implications of this often ignored identify in favor “Black,” especially in the media. I look forward to where this convo goes. 🤔", "lizisms": "@gennymats @funkyfreshdesign made me think of you two!", "tangtangwins": "🙌🏻", "mo_doz": "Same exact thoughts. Agreed.", "shuckzzz": "I agree had she been darker she would not have been accepted in 2018. But I do think this is the right step, and I would love to see this open doors for a descendant of Harry or William to marry a darker skin woman/man.", "spicythaihaitian": "You eloquently wrote what I thought and have been wondering ...", "weareideas": "@patricklubin", "clvrke_": "@shelbyunderscore", "jay_moni": "To be frank, if she was of a darker complexion I don’t even see her more than dating Harry let alone a wedding. She’s of a “respectful” color even with a tan (sidenote: are Royals allowed to get tans on vacations? 🤔) and that allows her to move through the world and now the Royal family as the “acceptable other”. Unfortunately, we have an ingrained frame of mind (read: slavery) that the lighter you are, the more appealing/beautiful you are. However, we as African Americans claim her because we understand that despite her uncouth White side her perception is White passing but upon further “inspection” she is black. The old adage of one drop makes you Black is true and I think why we are rallying for her so damn hard because to be in a room of the oldest gate keepers of racism & classism as a Duchess of ANYTHING and wife of your beloved heir is the biggest fuck you to their system. *wipes dirt off shoulder* You. Literally. Can’t. Make. This. Sh*t. Up.", "endlesummer_": "it’s not that deep", "sharmonjarmon": "I was thinking the SAME thing! if she was a lil darker it may have been different", "shamber__": "you’re absolutely right..i didnt even catch it at first 🤦🏽‍♀️", "mrsprsvr": "I love that there is finally a discussion about racial nuances, and that your shade of skin should note mandate how you identify...and how others label you. Race and Identity are very personal ideals.", "_lisaturtle_": "@adj0a", "ritualbodywellness": "Absolutely agree and have been raising this question all evening.", "layne.jane": "Preach 🙌🏾", "charstyle": "Yes yes yes Elaine", "suriya.jpg": "@daesho", "_tiara_h": "I had literally posed similar questions among others to my circle over the past couple of days. It’s definitely something to think about.", "life_the_vlog_by_fefe_bradley": "@elainewelteroth The bigger question is would Harry had even dated her if she was a few shades darker? I wondered that.", "michelle_madisontv": "She👏 said 👏that👏💯", "kirsten": "What an eloquent and complex discussion this post has started! Thank you for sharing, Elaine, and for all the brilliant women in the comments opening my eyes to the subtle complexities of this “first” in culture and the media that I’ve missed or never contemplated. I will carry these insights with me!", "malinasaval": "This is so brilliant.", "cassanie": "Profoundly spoken! ❤️", "nadinelacombe": "#truth @lourdeshltaylor @lou3939", "chilkxo": "So well said.", "itsmistye": "🙏 Thank you for this. And no, the world would not be making space. Kinda reminds me of the movie \"Imitation of Life\"", "mylknhoney_": "Wow! I’ve been thinking about this.", "ashante.nicole": "So this may be cynical but I don’t think it has to do with embracing multi-ethnic families. I think it’s more about the UK media and possibly the royal family (since they put out the press releases) not wanting to say there’s a black princess. In a way they’re almost saying hey everyone, she’s half white and can pass for one so we will let her in.", "rikkwright": "Def a valid question in this moment...and def would NOT be the same outcome...😓", "deta_nyc": "I completely agree, a lot of media outlets were using the term ‘biracial’ as either a negative connotation or an amazing exhibit that you would see at the Louvre for a certain period of time. To be fair, they also couldn’t help to continuously mention the fact that she was a divorcée and was American. As if we already didn’t know. 🙄 I completely understand that racial acceptance and self identity are all about having perspective, but if she was a few shades darker it would have probably been more of a topic(issue). At the end of the day, when you walk outside your door, you are already being characterized as one things. It is up to you to identify who you want to be in this world and hope others can embrace those attributes without discrimination or analysis.", "sttanya": "@ty_c_ty exactly what we were saying earlier today", "positiviteee": "This feels so performative. Meghan, is black and has always identified as black. Regardless of what they called her she used every opportunity to bring attention her blackness.", "torika_b": "@agfa_gram", "teamworldgirls": "Don't forget: Obama had a WHOLE black family, so I think that played a major part in his perceived identity.", "divinekatoure": "This has been the topic on my Time line all day. It’s weird .. because I feel very African and identify as that , but in reality I look white but have not accepted that. We are damned if we do and damn we if we don’t. It’s so crazy to hear how many of our darker brothers and sisters hate us for being mixed. When most of us love them and just want to be accepted. I just want to be happy for another human being. Instead of bi racial I’m going to start saying transnational... because I’m not only a business woman. I’m a business , woman. 😂😂🤪 I gotta joke about it .. the other thing is ... she really did marry a colonizer. It’s the same cringe when a Jew marries a German, I think", "gtowey": "Yes you are so right and perceptive to see the complex human emotions and perception that describe Biracial and black. We are in a pivotal time in our country. Women are the leaders and we are in such desperate need of leadership", "nishabeech": "!!!!!!! #truth", "sassielljk": "💯This! Things that make you go hhhmmnnn🤔", "wintersnowsummersun": "I think we need to stop analyzing Meghan's skin tone and levels of blackness and whiteness and also stop assuming how the Royal family feels. Everyone is more than their race or the color of their skin.", "natspace": "@trelawnydavis", "ashg215": "this is interesting to read, being as though i am a single mother raising 2 biracial girls", "jacquelyn.tayler": "Well said. Well, WELL said. Thank you.", "sustainablepapi": "This is super poignant! Great analysis. 👌🏾", "_rhiggins": "🗣F A C T S", "hav_merci": "While I wholeheartedly agree with your point. I think it is dangerous to say she is \"white-passing.\" We've all have had experiences in our lives that have shaped and defined who we are as people. All are unique. There is a difference between being able to pass and actually passing. In my opinion, she has not ever presented herself as someone who is not black. Now if others choose to do that, well, that is on them. I think we need to allow people room to self determine and not be so quick to slap a label. Thank you for opening up such an important dialogue. As always. 😃", "adria.dria": "I really appreciate you having the guts to bring this up no matter what people would say. And right as it happens too. I soo appreciate your commitment to our people. You get the whole world thinking and that's awesome. I think its important to keep reminding us that these things aren't ok.", "piazadorasghost": "👏🏾👏🏾", "drewwjoness": "@elainewelteroth this is very true. Not just physically, but Meghan is very white passing. Not saying her eloquence and demeanor cannot be attainable for blacks - she wouldn’t have been accepted if she didn’t pass those tests. I still think she claims a degree of her blackness and holds true deep love for her mother. I am undoubtedly happy for and Harry. I believe they can make strides.", "courtneyyaa": "@elainewelteroth ALL OF THIS!!! I’ve not wanted to disregard Meghan’s blackness but the last half of your caption is a “cynical” thought that i haven’t been able to shake.", "karma_inthedhabi": "@loui_fab", "rawtoeresa": "Thank u thank u thank u @elainewelteroth for your words here. I am a 61 year young Biracial Woman who has been waiting for the day that people would actually accept my Biracial identity as well as my Biracial siblings & peers. My mom is white , my father is black, and they had 5 mixed black/ white children together. My father ( late Beat Poet #tedjoans ) warned me that people would try to make me their race. He told me “ U are just as much white as u are black, and don’t let anyone take that away from u.” He said when others try to make u their race, politely tell them “Thanks but, I am just as much my mother as I am my father, and I’m not going to deny either.”. He said if they come at u with that “one drop Rule”, remind them that that’s some old Jim Crow slavery mentality stuff invented by slave masters. Anyway, thanks again @elainewelteroth for your very needed words here. I’m so happy about the history that was made today. It gives me hope that some things I never imagined would happen are happening. Let’s go forward. Love wins! 🙏🏽💕💜", "soultrain__": "👏🏾👏🏾👏🏾", "whywetrippininc": "1:I feel the royal family would have accepted anyone that Harry fell in love with...2: I have found what holds most black people back is their attempt to isimulate themselves into a Caucasian community as opposed to standing strong in their blackness there by forcing anyone and everyone to respect them for being who they are. I'll put it in a question. How can anyone respect anyone that's attempting to fit in with a club that would not have them as a member?..3: racist people are simply terrorist and I find sexism to be no different. This I will explain upon request. I've done a 25-year study scientifically of the social dynamic between black women and black men and my findings are our cure. Racism maybe the virus however it is no longer the bug that continues to spread the disease. Please excuse my typos Instagram makes it hard to double-check.", "speakingoflisa_": "This !!!!!!!!!!!", "yourfavblackman": "@iadking", "nudedecember": "I beg to differ ...the media can call it however they deem it necessary, but when it comes to the undeniable Love and Happiness that Harry and his family shared today makes believe that they’re civilized enough to look past her racial identity✨✨✨ I’m also willing to believe that her husband Harry has seen her in her natural state curly hair and all.... If she or the media identifies her as biracial, which in fact she is, there is no denying that she was raised by a Black woman that shows off her black beauty with her dreadlocks and nose ring🙋🏾‍♀️ let’s be happy and proud that due to Megan joining the Royal Family there was a Black Bishop, Black choir, Black musician, Black choir boy and Black guests represented in the Wedding ceremony and to see my peoples all up in the room made me smile 😊", "sarahkukie": "❣️", "ariannagab\nVerified": "Verified", "amy.argyle": "Maybe commentary would be different, but when fellow African Americans denounce her as a black woman it is hard to know what the heck to think on either side. Yes she passes but she for sure inserted \"blackness\" into that wedding and made a huge statement. As someone who is biracial I have struggled with identity. Society and opinions don't make it easy. When I read African Americans calling Meghan \"not black\" , when I have been told I'm not \"black enough\" from both Black and White people (get it a lot as an actress), \"you're the whitest black girl\", or hear racist remarks from my Black Aunt who raised me towards the white side of my family it creates an unrest and a feeling of not belonging anywhere. An inner battle. I personally say I am biracial because that is indeed genetically what I am and don't feel I need to explain myself to anyone because at the end of the day I am learning that I create my identity. Biracial/mixed is a reality and if we are forced to identify ourselves by race then that is the most honest answer, is it not??? I don't fit in a box like society wants me to. I honestly wish race would cease to be a conversation and divider. I wish race would stop being used to divide ourselves. I wish we could truly just start identifying as brothers and sisters across all differences. I wish we could stop having this conversation. I understand this is Utopian wishing and I hear what you are saying @elainewelteroth in regards to the \"what ifs\" , but what I feel we should go with is \"what is\". I believe Meghan represents a start just as Obama and other biracial or Black 1sts. I hope I've made some sense.", "thetechnonono": "Elaine, I adore you. However, what intel has led you to be she has passed? A close friend of hers, is my mentor. He confirmed that she considers herself bi racial, does not pass. It is one thing to pass and it’s another to hang with white people.", "saraazadisf": "As a biracial person, this question intrigues me. I can pass. But I commonly remind people who I am, where I came from and how I feel and have been meant to feel by others (smaller, lesser, not fitting into either group). I think Meghan asserted her blackness today through several ceremonial choices. I get that. She knows she can pass but she deliberately reminded people of who she is. I found that beautiful. I’m tired of being told I don’t look this or that enough. Today, she defined herself.", "jennyjennyie": "True", "lovelydee531": "My exact sentiments. I feel like you were listening in on my convos today!", "realrozy": "Yesssss!", "_okayjo": "Beautifully put 💕", "cwimb": "Queen Elizabeth II's great, great, great grandmother was actually the first black queen of England. Her name was Queen Sophie Charlotte, grandmother of Queen Victoria. This is not the first time Black royalty has been embraced in the palace. Harry is simply keeping with heritage.", "ezimring": "🙌🏻", "amerixannotion": "At the end of the day, she chose to be part of that family and they don't give a fuck about black people. She just Married into white supremacy.", "julian_mcbride": "🙌🏽", "kingcole_": "Incredible", "tiffgram_": "You make a good point!!! Probably said it best and point on!", "blackgirlgenius": "I’ve been saying the same thing for the past few months.", "ambarjackson": "🙌🏽🙏🏽💪🏽", "kaitmcnab": "@belizeanbabe13", "mauvad": "Isn’t the term Biracial used in reference to Meghan in England because England in general doesn’t classify black/white mixed race individuals as Black as is done in America...Yes, there are those mixed race individuals in America who don’t take on the “black”classification but I feel most who do, do so because they are considered “uppity” or “like they are better than”, so they choose what is simpler, succumbing to the classification stated a couple centuries ago. I don’t believe this is the case anywhere else in the world, except maybe South Africa? I believe the English generally classify biracial individuals as “half casts or half breed”, this doesn’t exactly sound pretty but it’s recognizing that the individual isn’t just black. The Carribbean definitely would never classify a mixed person as black. Saying all this to say, I’m not surprised by the biracial classification of Meghan as England was taking the lead on this family/race merger—", "amberthealchemist": "this", "ms.danielle_thanks": "@danielledesireexoxo", "pattycakes225": "It’s also obvious that the white half is the crazy 😜 half.", "paigemarie.ig": "@elainewelteroth @hannahbronfman I feel like part of this has to do with the fact that Meghan herself has always labeled herself as a biracial woman. If she had been biracial and claimed only being a black woman we might have a different story. At the same time, because she is white passing I feel like on the one hand the media enjoys emphasizing her biracialness as a way to juxtapose how she presents BUT also might suggest the unwillingness of society to accept her blackness and therefore using biracial woman to describe her because it is “safer” than saying she’s a black woman in a predominately white royal family.", "adreamlyfe": "Thoughtful post. I admit, while overjoyed with this union & loving both Prince & Princess, my mind wandered into that space. What brought me back though is choosing to acknowledge these clear steps forward as a sign of future progress. It can only get better. Thanks again for this thoughtful post! ♥️", "adinajuni": "Powerful!", "chanelanaise": "Well said..my sentiments", "isolde_brielmaier": "💕💕🌟🌟", "hemanshikumar_": "@orianacamille caption !", "rickiprosper": "Great post @ivyprosper @isprosper", "tiana__princess": "Why even call attention at all? Its not YOLO its comes off as a Debbie Downer commentary on the obvious that needs to be put to bed...to push culture forward. Why address color (in this instance) at all...the ceremony was beautiful and aligned w/ light, dark, pale, black, white, red, etc...", "the_mama_sagas": "Thank you for perfectly articulating this moment in time.", "jaybfit": "Ditto to @oliviamunn statement. I’m happy for this marriage, to be clear. But I too wondered why she wasn’t thought of as black. And why her dad was all over the media and not her regal, graceful, dignified, and elegant mother! 🤷🏾‍♀️ Oh well..... I watched, I’m happy for them but the “colorisam” way Meghan is described is so typical 😔", "evaninwonderland": "truthfully “biracial” people are protected by their white heritage whether they claim it or not. though Obama and Halle may self-identify or be forcefully identified as solely black, it’s of great comfort to people (read: white people) when they know there’s a white parent. Biracialness ultimately receives passing privilege regardless of shade.", "samantha.caff": "Thank you for igniting this conversation, it is so important to keep in mind and I hope a step in the right direction. I also hope she starts appearing publicly with her natural hair etc", "kristena_deyon": "Slow claps and yes to this!!! 👏🏽👏🏽👏🏽", "iamhollysummer": "@laurensmarvelousmanes @a_dawson_ now read this", "mrs_fineapple": "👏🏽👏🏽👏🏽👏🏽", "cydlaine": "👏🏾👏🏾👏🏾👏🏾 All good questions.", "maddison____": "@heybechello @lyserachelo @gmacrisp @cailss this!!", "nikkijoi": "Meghan herself only refers to herself as biracial. That is why the media did it too. She has been very vocal@about this.", "iamnazipecans": "My daughter asked me if we were bi-racial , I just looked at her...😟", "hautehoopla": "SAY IT!!", "quishalivinglife": "Been thinking this for a while.", "hayleymarienorman": "@statingdobvious", "sheismarisaj": "Things that make you go hhhhhMmmmm that was good 🤭🤔", "hannahbronfman\nVerified": "Verified", "jaqfonte": "I proudly refer to Her Majesty as black, just as I refer to BO as black. When he ran, ppl said he was only electable because he wasn’t “too black” and there were photos of him hugging his white grandma in Hawaii. I call bullshit. These days, you’re either too black to win at anything or too white for people to take your cultural transcendence seriously. As a person of mixed races (not black though) I sincerely hate all of this post. Every time someone asks are they black enough? Are they Asian enough? Etc. They’re diminishing the moment. They’re carving away at half of Meghan Markle’s authentic experience. She did not grow up with flat hair or a white mother. That’s real.  I think the royal family has and is ready for a black princess. I think the world IS ready for black power. 🙌🏽❤️ (PS. even though I hate this post, I still love YOU)", "birthofweenus": "@ls_girlwonder 🙄", "hermioneqb": "You always are spot on. Your point of view is so refreshing and much needed. You need your own docu-series talking fashion, gender, politics, race, etc. Hey @netflix give Elaine her docu-series!", "jameslee2899": "Like", "loliyeyemoon": "@prima_donna_g1rl @bxtchter @dee_jw what do you think?", "zancadasenlaweb": "Totalmente de acuerdo... No entiendo —y creo que nunca entenderé— la postura de medios de comunicación quienes por hacer más rimbombante una nota periodística caen en estos errores... Que no aportan al bienestar del conjunto, y más bien, caen en esos argumentos absurdos y vencidos para la época en la cual vivimos.... Soy periodista y mi interés siempre será aportar al bienestar del colectivo, a la integración sean blancos, negros, pardos, mestizos. Y sí, quizá seamos pocos los profesionales con esta visión utópica sobre el ejercicio de la profesión periodística, pero sinceramente creo, estamos para construir, no destruir... Punto.", "queennovasays": "Right in the money", "pinklibrarian": "YES!! Thank you so very much for sharing this! It, honestly, has not occurred to me and once I read your post it seemed extraordinarily monumental and profound. As someone who also identifies as biracial I have never found myself having to choose between black or white (and maybe that’s because I’m half Filipino and half Yemení) I very much appreciate hearing your perspective. 💕", "maximizeyou007": "THIS!!", "beyonc.nay": "As a biracial Black person, you nailed my exact thoughts. Thank you for communicating this so well 🙏🏾🙏🏾💞💞", "eylabs": "@jayanthinarain 🙌🏼", "powermomceo": "Well said, Elaine!", "sinceforeverpictures": "@elainewelteroth it’s an exciting time to be alive. 🦄❤️😘👌🏻✨", "tembae\nVerified": "Verified", "cutechicjojo": "Let’s answer it. No they would not. Period.", "chippedpolish": "Can we please refrain from using cringeworthy phrases like , “down with the swirl”. Stop that.", "cristal.mirror": "🔥🔥🔥", "aceanimichelle": "This is very real", "tdave_": "Well written", "doreane": "I am not \"biracial\" in the sense of this dialogue but if we all think about the word \"biracial\" we all are in the same realm. I am a black woman. Now when I find out my ancestors came here as slaves from Africa I too am \"biracial \" because I am half black (negro) and possibly have Afican. My point is I don't like the word \"biracial\". I look at Meghan Markle now the Duchess of Sussex as a black woman.@elainewelteroth", "humanharmony": "My exact thoughts mama!!!", "clippitycloppp": "PREACH I LOVE THIS", "saraww2": "I just wish you would have qualified again when you said, “ White passing woman.” Because as you said before in your opinion she could pass for white. But by choice and they way she identifies herself which is important she does not. I can’t tell you as a mixed person ( who by this post would qualify as a biracial person.”) It has hurt me deeply every time a Black person /someone who has two Black parents and identifies as Black has jokingly and in all seriousness told me I don’t look back or I look white. It hurt me because it made me feel invisible and unseen because regardless of what I look like I was raised by a Black man and that is a part of who I am, my soul, regardless of how I appear to others. At college a Black woman who had seen me many times in public but didn’t speak to me until we were in a class together told me after having a conversation with me, “ Wow you are so nice. You know me and my friends always see you walking by yourself and we all thought you were trying to pass for white.” The implications of what she said to me I still find staggering. I could go on and on with more stories but I think if it’s not dangerous to simply imply someone who - - I don’t know how to phrase this ... doesn’t look black enough so they could pass for white ? It deserves more thoughtfulness because saying someone could pass for white is so loaded. Especially for that person. I understand this does not have to do with your point. But honestly the second time you mentioned the passing part again without qualifying it - it triggered me.", "rafaelredz": "@elainewelteroth I loved what you wrote, but why spoil it with a “question”.", "__morgankendrick__": "thank you for seizing this opportunity for intentional dialogue. It’s so important 💙", "emsexton": ".@thehouseofpip @bakedeggs @lellyyoung @lyndalgibbs interesting insights after our convos last night x", "audrey_ibsen_rose": "This x this x this x this!!!", "thatsdaria": "The moment certainly begs the question. I think for sure no. I see her as black regardless of how the media or Meghan herself identifies. It was more comfortable palatable for many to label her as biracial. Meghan HAS to know what’s up. Her choices for this ceremony make me think she does. I want to believe that. Thus I’ve chosen to enjoy this moment.", "vsswim.archives": "Being a huge @mariahcarey fan, I remember her being referred to by the media as biracial as well (she’s African American and Venezuelan on her father’s side). This is not new, nor do I think it’s the media’s way of making her more acceptable to the Royal family. Unfortunately, it all comes down to how black or white we look (both Meghan and Mariah were assumed to be white).", "evelinybklein": "I have no doubt she would have been treated different were she darker. However, the reality is that she is biracial - and identifies as such. Her personal experience is likely colored by this ambiguity and to expect her to be more “black” or “white” is our projection of who she should be.", "desthefashioneater": "You, you always bring attention to the right things. The topics no one talks about online👏🏾", "gwenmadiba": "@elainewelteroth THANK YOU for this! I sat and reflected on this as well and I'm happy to read your post. That nuance was also brought by her. She has insisted several times on the fact that she is and feels biracial.", "shellyrootz": "I’m so happy a African American woman feminist is in that castle! I applaud her grace and beauty inside and out regardless of her “race”.", "itsmypartyyy": "someone finally said it!!!", "jslayedofficial": "I watching some of the media coverage and her beautiful black mom often times being spoken of as an afterthought was interesting as well. Her mother's dreads and beautiful brown hue is a reminder they can't overlook, but the media is definitely playing down her \"blackness\" via the overuse of the word \"biracial.\"", "lsnerldo40": "I’m just glad it’s her other side of the family that’s acting up instead of her mother’s side of the family!! Ijs😒 You know the media would have really ran with that! She would have been black for sure and not biracial! England’s Black Queen Charlotte in the 1700’s and the current Queen of England and Harry are related by blood. I’m happy for both of them! I love LOVE😍", "lexiam7": "YES. I was thinking this all morning. Thank you for putting it out there @elainewelteroth well said 👏🏼", "azeezahgoodwin": "Lol yeah thats a hard “no”. Baby steps, I suppose lol. Its hard for me to feel like this is an important moment for “us” because it feels like we were waiting for this stamp of approval from wealthy “royal” whites and now we finally got it. I cant help but think that all the wealth we see displayed was stolen in horrific ways from brown nations.", "laurashereenacolette": "I cannot help but think that the term biracial is used here because it's something very honorable to become a duchess so it might \"reassure\" some people to think \"well she is half white\" but what if she was a felon? would people call her biracial or just shortcut things to \"she is black\"?.. I don't know maybe I'm being a little too negative here.. 😕", "suigeneris35": "Deep! @elainewelteroth", "elizamarissa": "@emilygiffinauthor curious on your thoughts", "itsashwharto": "She looks just like her mama! Gorgeous!", "lilydrummondfilms": "Being Caucasian myself I guess I have never truely given much thought about this, but I’m really glad I came across your post. It’s important we educate one another on the human race and I think what you explained in your caption is very much worth talking about. There definitely needs to be more discussion around this topic- I really appreciate you starting the conversation 👏🏼👏🏾💘👰🏽", "sunflower_shatter": "Is Meghan considered white passing?", "serenasevyn": "Interesting POV. 💜", "hello_daniii": "👏👏👏", "janinerube\nVerified": "Verified", "lalocreativity": "I wonder if we'll get to see her hair in its natural state ever again.", "vanessafullbloom": "I think there's different levels to this. On one hand, it's a term being used to put distance between Meghan and her blackness since she's so fair skinned and could pass for white. But, on the other hand, it's the term she calls herself and it isn't forcing her to abandon one of her parents and racial identity by having to choose nor forced to with the \"one drop\" theory. But, as you said, this would be a different conversation if she were darker and/or wore her hair natural.", "cherrylannerichardson": "Girrrrrl you etched that so darn beautifully. Word ... sister 👍❤️❤️", "latericerule": "I dont know if i believe if she was darker or \"looked\" like a black woman she would be marrying him PERIOD. I would like to think so but its hard to image the response she would have gotten. In 20-30 years the next generation of royals might answer that question.", "corey.oc": "If her skin was darker, if she couldn’t pass as white, the media would be calling her “black” and not “biracial.” “Biracial” still feels to me like a term mainly reserved by the media for light-skinned mixed race POCs who could pass white. If your skin is dark enough that you look like what people perceive as being “other,” you are labeled by your “otherness.”", "authornpw": "She would not have been there if she was darker point blank", "brooklynzhu": "I have such a different perspective. As a POC who is not “biracial,” growing up, I struggled trying to assimilate; wishing I had whiter features and was always envious of the half white kids who acted superior than ppl who were not half white. I feel like people claiming Meghan as black is almost harmful to people with darker skin and have non-white features, who have to set this as the new standard of what “black” or being a minority looks like!", "hannahjanaee": "Food for thought.", "yaniquejoanne": "@alliamcleod exactly what you were hinting at", "isthatbritt": "This!!!!", "niabolling": "@romneylewis caption", "siyaolivia": "Yes Elaine! You always have the words!", "_lovebeyondwords_": "As an Asian who has never set foot in the West, all I see is a biracial woman. Definitely not white, and not fully black either. I don’t know and don’t really understand the dynamics of race as I was raised in a pretty homogeneous society, but the tone of this debate is, for me, accusatory. It’s as if you’re calling out Meghan for identifying as biracial when she is in fact biracial. What’s wrong with acknowledging her white side?", "tybass": "Yup", "goribtraveler": "@atissy08 such an interesting perspective", "aprilnicole_": "I’ve been asking myself this question since the engagement", "taniapeguerofotografia": "This is not a world issue. In my country we are mostly mixed. We call ourselves mulatos. Or a spanish term “Indio” because it is not white or black. This is a few countries issue. I’m just trying to shed some light. Not wanting to start a debate. The most beautiful thing I see in my country is when one of the kids is tan as my brother was and the other white or light skin as I was. Is truly beautiful.", "tamzie41": "@elainewelteroth I SAID THE SAME THING. I found it sooo deliberate Meghan is now now biracial or multi cultural. I don't agree she could pass as white however. And if she were to choose to wear her hair in its natural state without use of heat to straighten it all hell would bruk loose. But to me the choice to now label her as \"multi-cultural\" is a result of not bringing themselves to say that he is marrying a black woman. I therefore don't see this union as a step forward for inclusivity.", "terri.t_": "Thanks. Black women you are royalty all day everyday", "aphios5": "@elainewelteroth Just talking about this tonight at dinner with the hubby... Acceptable levels of Blackness and how Black \"modernizes\" the monarchy... What are we, furniture? Smh...", "dcg.katt": "Is she black cuz I thought she was white", "nycfashionexpert": "Yesssssss Royalty", "iamdeeplyloved": "I had this conversation around the word \"biracial\" and its usage today. Nice post.", "farrah_ashley": "Shake the table @elainewelteroth! Awesome. Thanks for sharing this perspective 👏🏾✨🖤", "mychampionheartragdolls": "😱 her nose piercing was allowed at the royal wedding? I would of taken it off just for the wedding out of respect to the customs the royal family have.", "modello9": "This post is SO valid. LEVELS to this. Fucking. Levels.", "siebergd": "I really just love this comment so much.", "michee2125": "Great points and question, Elaine. The same thing went through my mind.", "antiquatedbeing": "THIS 👏🏽👏🏽👏🏽", "nikkolescor09": "Please tell me did she ever say she was a black woman? Her words? I don’t know her enough to know her. @elainewelteroth I am just trying to understand the excitement of this marriage. I thought it was a British royalty marring an an American commoner.", "lovesharmichelle": "God was in all the details of this post! Amen @elainewelteroth 🙌🏾", "addyswopesrealtor": "Yesss speak! This couldn’t have been worded any better 🙌🏾👌🏾", "briannariel": "Thank you", "cfiles_": "I’ve said this from the beginning. Thank you.", "ashpalmore_": "All of this!", "addyejoyfantastic": "agreed...ALLLLLL OF THAT. 👍🏾 i also find the equation of her Mom being black and her Dad being white extremely telling of how her Dad’s shenanigans have been viewed. i can’t help but wonder how he would be perceived if he were black. 🤔", "wadzi_kats": "I think a huge part of why the term biracial has been so widely used is that this is a UK led story, and in Britain (and indeed in much of the Commonwealth), there has always been a distinction made between black, white and mixed race (or biracial). The one drop rule is largely applied in America. I suspect if the story had been US led then she would have been called black from day 0 and there would have been room for nuance. That said, it makes a huge difference that she is “white passing” and very much lends to her public acceptability.", "d3zwifey": "As a multi racial woman who has dealt with this issue since 1977 and is currently the only black woman on my executive team at my department. A woman who wasn't Black enough for my Black side or Filipino enough for my Filipino side...I decided to take a few hours off and just watch the wedding for entertainment. As I think of the parents in Santa Fe that will bury their babies in the next few weeks as I am blessed to watch my two oldest babies graduate from high school on Monday...I think maybe for the sake of self care and a bit of maintaining sanity, we can just watch a wedding and make it a political, social debate tomorrow 😉 I totally understand where you are coming from though. #muchlove❤️", "missyblive": "I totally noticed that she is not being referred to as “Black,” which we know with the historic one drop rule, she should be. And as for the latter part of your comment, I would say, no! I love this post. This is loaded with good things to consider and it think about.", "iamdrnes": "WOW. Thanks for exploring this reality openly. Much appreciated! Deep down, most already know the answer. (Sigh). America, still must grapple with the question that DuBois thought was only one for the 20th Century. #soulsofblackfolks", "keyesaige": "Thank you for this", "charlie_onthespot": "Well said!!! 👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "taylorsinclare": "I have no idea how they would perceive her, but she spoke about the racism that she experienced when she and Harry were dating. She’s so confident, I don’t think it would break her even if she were darker and had curls. She wanted people to know full well that she honors her African-American heritage too. But ultimately, I’ve been loving the work she’s been doing with UN Women. She has a fiery passion for empowering all women. I believe she has become duchess to be able to do even more for women all across the world. As a ‘black/black’ girl, I am inspired by think pieces that she wrote for ‘The Tig’ and all of her work interviews. She always focuses keeping your soul fed and on inner beauty rather than the external.", "tiathecreator_": "So eloquently written, Elaine! I agree with everything you stated.", "draeriv": "YES ELAINE. ALL OF THIS.", "stephhamp": "THIS EXACTLY👋🏾👋🏾👋🏾 Colorism is so prevelant in our modern society and teen vogue and @elainewelteroth are one of the few publications and light skin women to acknowledge it! I always wondered how she would be perceived if she looked like me or darker. It certainly makes a difference", "ashleykapryan": "Biracial and proud af! Loved the wedding and love the skin I’m in!!!!", "shivastyles": "The discussion is necessary, but she is not white passing at all to me, and i‘ve lived in a mostly ‚white country‘ all of my life where no one ever would consider her white! The British press has never seen her that way either, she never enjoyed that ‚privilege‘ from the UK press... maybe in the US.. but def a discussion to be had & great to bring up the media & their intention/narratives.. 🙏🏽💋", "zamkengurl": "Speak on it", "zoes_empire": "Well said", "lifeaccordingtoangelarich": "I think if she had a tan and natural hair., they would lose their minds. She looks just like her Mom. otherwise.", "findingclaudia": "My thoughts EXACTLY! Thank you!", "maryawhitney": "LOVE.YOU.", "lola_adesanya": "I’ve been thinking the same thing!!!!!!! It’s more cynical for me. And she also identifies as bi racial. But I’m happy there was s historically and modern day black presence during the ceremony.", "danielhbarcelo": "Great perspective 👌🏾", "j.isforjawesome": "Amen, girl! I’m with ya!", "styledbyglo": "Very deep", "carolyntraore": "I agree. While she is a woman of color, is her \"passing\" for white look more acceptable to Royal family and easing them into modernity. If she was Fulani from Senegal, Senufo or Mossi from West Africa with dark skin, natural hair and traditional dress have garnered the same response....", "_darcee": "So eloquently stated, thank you for bringing this up on social media!!", "thejennstar": "So true. Now the question is will she show some of those features? One would hope.", "thechristianochoa": "YASSSSSSSS, love this post! Keep the conversation going 🖤 they asses are not ready", "familiaryetdifferent": "👏🏽👏🏽👏🏽", "jessharbeck": "Thank you for taking the time to teach me ❤️ you @elainewelteroth", "v_chanelle": "THANK YOU!! 🙌🏽😩", "buttersmoothe2002": "I don't think she was ever 'white passing'. I think her self identifying as bi-racial and adamant about being identified as such is because she is racially ambiguous makes people acknowledge her in totality. Let's face it blacks and whites have a problem accepting children of mixed race. And her hair choice is just that a choice, I've seen some posts saying why she won't embrace her natural hair as of its some how wrong and that's not cool. How many of us straightened our curls for yrs with perms & blow outs? It's annoying because the comments imply the not enough mentality and it not ok.", "fran.nie": "❤❤❤", "roisin_nic_gh": "I never thought of it like that 🌹🌹🌹", "mzricki01": "S", "cmfbattle": "Beautiful like her mother", "saunyaaa": "Well said. Perfectly put. I agree completely.", "shop_thebeehive": "As a biracial woman I am happy the term is being used. And yet, I can absolutely see the questions and discussions your comment raises. Its an important perspective. But can I say how thrilled I was to see her beautiful mom rocking her dreads and multiple ear piercings?", "ayzia_": "As a biracial woman I live this everyday. What an interesting and thought provoking question. I too wonder, but nonetheless appreciate that they finally used the corrected term.", "ladyloisruns": "@drdavon 9", "nessak2908": "As a follower that is much older than you and biracial this post speaks volumes to me. I know the world sees me as black or Hispanic which is not how i see myself or how I was raised (white) I love that as a mixed chick you are bringing attention to this topic. I have always felt like I had to go into someone’s box. I’m almost 40 no more race boxes for me. Thanks for all your hard work and bringing light to this particular subject.", "estlouis": "Preeeeeach Elaine!!!", "amanda.violett": "@dotreddot I would love to talk about this with you when I get back. X"}