{"superrichekids": "How should college students best leverage mentors and sponsors to get to where they want to be in 4 years? Can’t wait!! @elainewelteroth", "erinp713": "This is so cool! Best of luck with the interview ✊🏽#gogirl", "moooorrgan": "I love that you’re doing this so much! I know for a fact that I wouldn’t be the person I am today without my college education/experience, and it’s soooo great that you’re having a conversation (with Michelle Obama!!!!!) about how to make college less intimidating. Where can we watch/read a recap of your interview?? 😍😍😍", "modelburnbook": "Omg I thought this was on the subway", "madihashafqat": "As a college student, one of my biggest concerns is paying for college. I struggle with the fact that I want a great education to pursue my dreams but at the same time, I don’t want to go into debt for the starting years of my adult life. Do you have any advice on what is the best way to deal with this dichotomy where you feel like you’re letting go of your dreams if you don’t go to school but if you do decide to go to school, then you are pushing yourself into a dark pit of debt?", "n.amuses": "Choosing a major/career path. Money over what I love or vis versa? Is it possible to have both? With what career? I know people say to do what you love, but as a low-income student of immigrants, I have to take care my folks when they’re older. I don’t have mommy and daddy’s money to cover me financially in and after college if my career falls short. The people who always tell me to do what I love are living normal lives/the occasional struggle or are already well-off. The people who are making money hate their jobs, but love the benefits 🤦🏾‍♀️ I don’t know what to do...", "differentkindofhumanbeing": "I would love to be present !", "kate_fiona": "This is so cool @elainewelteroth ! I’m super passionate about education as an opportunity opener (and also a dream builder - as you say, if you can’t see or imagine it, you can’t work towards it). I have a job I love these days working in a charity building tech products for vulnerable people. I did a law degree like MO and worked as a lawyer for a while. It wasn’t for me, but I ended up in a place I love anyway. It would be great to ask her how important is it to choose the ‘right’ degree/‘perfect’ course vs how much is it just about learning. When I look back on picking a degree and how much I worried about it I think I worried too much. Doing my degrees was important because it opened my mind and taught me how to think and solve. But I’m not so sure that course choice is always as important as young people think - learn to learn and you’ll be set for life (or something like that)...?", "seeusoon.us": "👌", "lola.ayodele": "I’m wondering whether to go to graduate school or not at the moment. My dream is to own a fashion store that revolutionazies the way women see themselves. I want to get rid of the insecurities affiliated with being bigger(not the stereotypical size of beauty) but everyone advises me to go to grad school. Is there a way I can start my dream job now even though some days I feel further from it?", "thelonelyldnr": "this is so inspiring - thank you for sharing!", "handslikeasurgeon": "♥️♥️♥️", "saketjibhkate": "👌👌", "barkuniversity": "@gesguzman but I thought this was you 😘", "oyite.a": "Love this", "solangefranklin\nVerified": "Verified", "forthecurious": "👏👏", "hautehousenation": "Wow this is amazing!", "theblesseddandy": "Great!", "_parkercurry": "♥️", "allari1": "D📷PE!", "brownskinjalissa": "Thank you so much for the inspiring work that you do♥️ As a new 30 year old, it has been a challenge for me emotionally and professionally that I never finished school. As a first generation college attendee and 2nd year student, I ended up losing my scholarship at 20 yo due to struggling grades (bio pre-med), and because my family didn’t have the resources or “know-how” to help me, I had to leave my school, go back home to Chicago and look for work. I am blessed that I found a career in finance and have been pretty successful; however this has always been a dark shadow and a big insecurity for me and has often disabled my career progression. I’ve tried to go back on a few occasions but was defeated by obstacles like existing student loans, affordability, previous grades minimum requirements for application, or work inconvenience. With all of this in mind, I know my story is not uncommon; so my question to you is what is your advice to someone like me?", "sonita_joonjoon": "Wow you’ve lost so much weight", "nolia_______": "I have two questions🙌🏾 How do we address the pressures first generation college grads receive? How can we effectively showcase/stress issues like mental health for first generation college grads? Thank you for sharing your story💛", "baldwintrapin": "How has attending a PWI Ivy leauge, Brown, shaped your educational path? I will be attending Spelman College. How different do you think a PWI and an HBCU will benefit its student in their intended future? How has humility and knowledge of self helped contain your peace during your husbands presidency, and the racial and sexist backlash that has be put on you?", "jiggatrent": "Goals 😘😘❤️💨🖤", "twocanarybirds": "#twocanarybirds", "its_kkryss": "My fear is big making be correct connections to be able to obtain the best internships and future job opportunities. I want to be successful and achieve my dreams but not meeting the right people during undergrad could possibly ruin my chances of being successful post undergrad", "1reynezz": "Beauties 😍🙌", "mara_baybee": "I’ve been spending so much time trying to figure out how to word this question. As a first generation college students from the south side of Chicago, how do I go back into the culture in which I was raised in with out seeming like I’m “better” or “too good” for my neighborhood? I mean, I’m still the person, just educated. Also, my next question is how do you keep your motivation for excellence during a season of burnout?", "april_m_bowman": "I LOVE This!", "fashiondivango": "Yes💚💚💚", "thetypeofdogs": "#thetypeofdogs 🐕", "optimistic_bre": "I’ll be there tomorrow all day, and am speaking during the afternoon session!! I look forward connecting with you!!!", "gluten.demon": "I have two questions!! How did you handle the cost of going to college? What tips do you have for balancing your work, education, and relationships??", "fotobeatriz": "Elaine my kids are struggling to continue college as they get minimum wage and don’t make enough money for tuition... but they still live under my roof ... because it’s too expensive to move out!... so they do not qualify fo financial aid. So it’s like a vicious cycle. My question for miss Obama is how can this cycle change for middle class people that makes too much “in paper” but really barely makes it to the end of the month and on top has to chose whether their kids go to college by getting a huge loan or be forced to let them finish college after 10 years since they can only take one class at city college at a time...", "kaylaysback": "This definitely gave me hope 🙌🏾", "lamoore1214": "When you first entered college did you know what you wanted to do, or would you say it was more your experiences in college that set you on your career path? What would you say is the best way to open yourself up to experiences (for example internships or meeting people) in college that help you along a career path? Thank you💞", "nadinelacombe": "@elainewelteroth you’ve got your work cut out for you. these students’ questions are so on point! #brilliantminds 🎓", "nina_thefirst": "How can middle class families prepare for college? We make too much to get aid but are too poor to afford tuition. What can be done for our kids?", "chandriani": "You are seriously so amazing! Hats off to you and your inspiring work!", "penelopi.a": "Where should a line be drawn for making responsible college application decisions when wanting to attend a far away and selective school (in my case Chicago to California), while taking into consideration affordability. What if going where makes you happy is a burden to others?", "cedezz._": "Financially????!", "bluevioletstyle": "Love her 🖤", "chiziduru": "Amazing!!!!", "_sofiaa.sch_": "Im going to be a junior next year and hope to go to Northwestern or Georgetown. Although I am a minority and can recieve a lot of scholarships, college is still expensive and I will have to take out loans. I know many students are homeless because they can’t afford housing, especially in big expensive cities. They have to still study for school while they’re being hit with large amounts of debt and economic problems. What are some ways to save up early without having a long job that takes up most of he day? What can the govt do to help solve the housing issue?", "gabriella.campen": "Any advice for incoming law school students", "kaylasaponi": "I am pursuing a career in optometry and will be applying later this summer. Should everything go according to plan, I will be the first doctor in my family. I definitely struggle: classes are difficult and I lose faith in myself. I am so close to getting to optometry school, but even now I still want to give up sometimes. It’s hard because I have no one to talk to and compare experiences to, and I constantly see classmates from high school being successful in medical school. My question for you is how did you deal with feelings like these, assuming you went through something similar? Is it helpful to have a mentor during these moments?", "g.ennifer": "How did you learn how to network/shake off being scared of networking? Also how important are internships and how did you go about obtaining them when you were in college?", "sonnygroo": "🖤🖤👊🏼", "eewryan": "What are Mrs. Obama’s thoughts regarding the concept of offering (financially) free education to those who seek it?", "gajjetta": "@gracejb ma e’ Mimma Stellato?", "lama7168": "@elainewelteroth can you share what product you used to have your hair looking so moisturized in this picture, this mixed chick needs help.", "brunchnfriends": "Greetings Friend. We Would Love Too Invite You Too Attend Our Upcoming Events. MADE IN NEWYORK BRUNCH & BRUNCH SO HARD. SEE PAGE FOR DETAILS OR CONTACT OUR HOST @ROEVELLEGUSTAVE 347-469-4417", "spiritedpursuit\nVerified": "Verified", "valsunshines": "🌀🌺🌀 stellar Elaine !", "aubreyonair\nVerified": "Verified", "yoitsbdav": "I remember working with you at Ebony. I was in Chicago’s design dept. it was exciting to have someone bring new ideas. Congrats on all you’re doing @elainewelteroth", "kor_nyc": "✨", "miranda505": "How can we all work together to encourage more Native students into all levels of higher ed - and to make sure they graduate?", "_niafields": "My question: When you have a degree in Journalism, is it based on who you know or what you know when it comes to finding a career after graduation?", "boxaay.yt": "Trying to start a YouTube channel support me with the link in my bio🔥please❤ all the support is will be greatly appreciated❗", "mimilucyross": "What if I just don’t get accepted to any collage. Like what do you do? Do you wait a year and try again?", "conqring_lion": "Hi Elaine! As an African America woman attending a PWI that has no structural support or diversity office dedicated to supporting the colleges small diverse population, I often find myself struggling, alone, not feeling accepted nor supported. There have been efforts again and again to establish some what of an office or diversity club, but with lack of participants and little membership nothing ever sticks. I know that I am not the only one that feels alone or unaccepted or unsupported at my school and I know that many students in the future even after I'm gone might feel the same way. I want to end this cycle by becoming an agent of change, but with lack of support from the institution and the student body, I feel helpless. Any advice? @elainewelteroth", "mbraga24": "You are such a hero!!!!", "niccatso": "I'm a recent graduate with my Master's (woo!). I'm having the hardest time with the job search process. I have a lot of relevant and extra experience (volunteer work that I cared about, mentoring projects, a thesis, etc), I have networked and dedicated myself to job searching full time, and somehow I am still not being hired. I have made it to the final round of several interview processes, but I keep getting passed over and told that *some company* will really be lucky to have me. How do I convince employers that I'm worth giving a chance to? Furthermore, what is your advice for preventing burnout and getting bogged down in this scenario? Thank you so much @elainewelteroth and @michelleobama!!! 😍❤", "splenetique": "@elainewelteroth this is such a feel-good story! Knowing what u do will pay off one day is a nice thing. I am also the first who's gone off to study at a uni and it was not easy. I learned a lot about myself and am still learning. What I wanna share is, that to be true to yourself thru your college years is important to find your tribe. I am a woman in tech and soon finishing university and I did experience that there is some bias towards women coding and conceptualizing, especially when u are working in a group with also men. They do not do it intentionally often that they start mansplaining stuff without having asked for their opinion but they do not even think that they might have internalized some biased thinking. So it's good to have your back up, your girls and colleagues who are cool with u being confident. It will help with feeling frustration. Talking bout your thoughts and feelings is also key. And trusting in yourself first can go a long way. And always ask when u wanna know something, be curious. Wish u all all the luck and success to pursue your dreams! And hold on if you are the first one to go studying, u probably might inspire more ppl to do so!", "mixitupwithcurves": "This is such a great cause! I think that helping high school students of color connect with current college students as mentors would be beneficial. The students I work with often can’t picture themselves in college. It’s not a tradition in their family so there’s a lack of connection to that world. They think it’s for those other kids. Bravo 👏🏾 for your efforts ✨", "yoursgabdior": "How did you know that you were choosing the right field for yourself and not based off of what others thought you should pursue?", "br1tz": "What is an important thing to look at or think about when looking for HBCUs to attend?", "r.mattea": "I'm finishing my degree much later than I expected, for a variety of reasons, and many of my high school friends now hold steady jobs & are having families. What would you say to someone who sometimes feels inadequate because of these things?", "itsericat": "Hi! I’m 25 and no one in my family graduated from college. I went temporarily to gain my cosmetology license. I love what I do. But a part of me wants to be able to empower others through my gifts. I want to go back to college and major in business. Incredibly scared. Any tips, tricks or heads up? Seeing you, a woman from my town is incredibly inspiring and brings so much love light to my feed. Thank you 💜", "sunbeamnai": "As a young black queer creative from a big city like New York, l find it hard to find opportunities that appeal to my interests as a creative person with mental health issues, like bipolar disorder and anxiety to name a few. I’m turning 20 this July, and I’m currently not in college due to mental health reasons, and have dropped out for the 3rd time in 2 years... I’ve found it quiet discouraging to pursue my passions, as an almost 20 year old who hasn’t had any real life experience as far as college and a formal education is the traditional sense. While I was in college and tried to navigate both school and mental health, which became to hard of a task — l felt as though when l expressed my overarching concerns with my bipolar disorder to my college counselors and advisors l felt like the responses to my concerns weren’t heard and neglected — statements like “our college doesn’t take kindly to students like you, who stop and start a semester” or “you’re becoming a statistic” were thrown into many conversations, at the point of this conversation with these staff members and other incidents l was horridly depressed and ended up attempting suicide. After, recovering from that traumatic event, I’ve wanted to pose these questions to Mrs. Obama, “Should colleges have a safe space and support for individuals in college with mental health issues if they are documented by medical records? “How should established institutions like colleges openly address a student with mental health issues when they are asking for help both academically and personally without making the individual feel worse?” and “How can an individual look for resources and find a way to still pursue their passions and dreams if college seems to big of an obstacles?” Thank you both! Naimah", "ndinitee": "Wow Sis. It’s so encouraging to see your earlier piks. I feel like I am making it thru a maze and looking at all your fabolousness today is inspirational, but it’s even more encouraging seeing your story. Thank u for sharing!", "hellofounder.co": "This is how we have to keep moving upward and growing 💪🏾💪🏾", "jennnyyyag": "what to say to people that try to discredit my major?", "sam._millerr": "You are an incredible inspiration!! Thank you for introducing me to so many parts of the fashion industry and for always fighting for what you believe in 💗💗", "amychaiklin": "💗🌹💗🌹", "stephbeour": "🌈💓Love this", "marias_nugget": "As a woman of color, how do you stay confident in yourself that the decisions you're making are the right ones? I am going to be a freshman in college in the fall and I want to study art history, but I'm afraid that's useless; how do I remain positive when I am dealing with the difficulty of making my way in the particular field simultaneously to being a woman of color?", "p.l.mcgehee": "Great share!", "isha.manal": "two beautiful ladies from the inside out 💜✨", "elfreedagirl": "Amazing story. Hard work, perseverance and being humble.", "cassandrahsiao": "I’m in college now, and as the first person in my family to attend a school of this stature in the US, I often wonder how the things I’m learning about history and politics and literature and philosophy impact me directly and my future. Sometimes what I’m studying seems so far off from the world of my parents, for example, who have never heard of 90% of the great thinkers in reading. My question is, exactly how did college fuel you and give you the jumping off point, and how did u connect the two worlds you were living in?", "kirstynnalexandra": "See you there!!! @elainewelteroth 😊❤️❤️", "themiatamati": "Beautiful! I thought you were @traciethoms for a second ❤️", "alxforever": "@clairemorrisseeya", "shondabwhite": "So inspiring 👏🏾👏🏾👏🏾👏🏾", "dontdragit": "This is so cute", "musegold\nVerified": "Verified", "shendove": "So amazing!", "latasiacofield": "Congrats! Why has college tuition gone up 200% since the 1980s? Her thoughts on vocational and trade schools? Should the importance on college be about its unique experience and finding the philosophy of life vs. securing a job?", "jroberson14": "@cedezz._", "temi.shobowale": "you are so Goals! 💛", "cocoandclick": "Wow. So amazing. Look at young Elaineeee!! 😍", "thekachetlife": "Everything about this is MAGIC!!", "rdgz.melanie": "As a first generation college student and incoming freshman from a family of immigrants, I sometimes feel like my parents don’t necessarily understand the process and have called me “too independent.” What advice do you have in regards to effectively communicating with your parents regarding their concerns while at the same time remaining steadfast in your goals?", "robertinamm": "How can I attend this event sis?", "matilde.castagnoli": "@sofivittoria", "andiavarba": "Everything was in the plan from the beginning. That first encounter was the door cracking. #inspired.", "stephenantonio": "🙌🏿🙌🏿🙌🏿🖤🖤 #goals", "kellz_aka_kaykay": "❤️❤️", "chisarah10": "Thank you so much!!!! So inspiring!!! My question is: How can I make sure to capitalize on my potential? Any advice on how to really stand out for opportunities and internships? Thank you so much @elainewelteroth and @michelleobama you both have been such an inspiration to me. And tell Michelle I’m so excited for her book!!!! Thank you!!!", "happyheather22": "What a life. Full circle moments are amazing xo", "laurennicolefk": "You’re so incredible!!!!", "kathryn.elyce": "My question: what advice do you have for introverted young professionals wanting to make connections in their fields? ~ Katie. Chicago. Fashion Studies ✨💕 Both of you are such an inspiration to me.", "mrs.murphy17": "I also will be the first college graduate in my immediate family. I first started school at 19 now I'm 34. I continued to put it off. So what advice would you give to others going back to college being older? Mrs. Obama and your self are so amazing blessings to you both.", "iambiancaportillo": "Omg you’re the best, I love you Elaine💘", "cheyathousand": "😱👏🏾👏🏾👏🏾", "athenabeleauxn": "Hi, I am a current third year college student in Los Angeles, and I very much relate to your story. have grown quite fond of your profile over the years; you seem to be always radiating light & positivity. I have watched countless documentaries and YouTube videos, I have spent my last dime to get almost every back issue of a Vogue — because while my peers read Animal Farm, I found it advantageous for me read copies of Vogue from certain years — and have emailed people on LinkedIn but, having the insight of the person who use to head one the most successful magazines ever would be the icing on the cake. My dream has always been to one day run Vogue, and I was wondering if you, a former Editor-in-Chief of TeenVogue, could educate me of what is needed to get my foot in the door? Also, once I am there I would love to know how to stay there and be at the top? If you have any more tips for a future Editor-in-Chief I would greatly appreciate them.", "morganfayejefferson": "It’s so refreshing to hear someone who is successful remind people that college is important. I feel like so many people in my generation/younger look at how many social media stars have “made it” without going to school, and it worries me that they’re internalizing that message and dismissing college/advanced degrees bcs of that. Keep pushing the importance of college!", "hillary.gld": "This is a WoW moment!!!!! Education is the WAY . Embrace what you can receive from learning & it will give back you in gifts you never could emagine.", "micheellada": "What would the advice be, for someone who’s a first generation already in college, and has doubts of college itself? How can we make our stay much more comfortable and easier to find what we’re supposed to do? Because I don’t really know what I’m doing now that I’m there :(", "monspenny": "The biggest concern is job security after college. This question is for the both of you, what challenges did you face as far as choosing or not having the ability to choose the “right” first job to kick start your career? And how did you overcome that?", "sweetnovellas": "@elainewelteroth I'm going to be a senior this year and I reaaaally want a job working/writing for a magazine or doing some type of communications work regarding my field. Can you give tips on how to get into the biz? I've written for my universitt's newspaper. Im an international affairs and politics major with a minor in Spanish but I previously studied journalism and I've had a press internship at the U.S. Senate. I just really want to succeed after college but I'm not sure where to start.", "americaneedsyou": "Thank you both for being amazing advocates for first-generation college students!", "rubykaye1": "Amazing", "shantigracie": "My question for you and Mrs. Obama: I start college this year and in order to do it I have to leave my mom alone and part of me feels guilty for doing that, my number one fear is not being there to take care of her. She’s been a single parent almost half my life and while she has managed to take care of my sisters and I there is no one there for her. So how can I get over the guilt and fear I feel about pursuing college? I just can’t get over the feeling that I’m being selfish for pursuing my dreams even though she had to sacrifice so many of hers. Thank you Ms. Welteroth and Mrs. Obama in Advance. 😊", "omikunlewa": "Ase.", "msmischo": "Love this! So inspiring!!!! ✨❤️", "gracia_imboden": "Post-graduation, how did you go about navigating paying back student loans/sustaining yourself while staying true to your career desires? Thank you!", "riosport": "👑👑", "eclectixsoul": "This! Sent my question in, looking forward to hearing thoughts", "mclaw7": "💪💗", "curimic": "Wow! 🙌🏻", "ebonymagazine\nVerified": "Verified", "mikaijohnsonharris": "How do you deal with this feeling that time is running out and that you have very little time to accomplish your goals? I am a 20 year old upcoming college senior and I feel like there is this clock constantly ticking. And I know many POC hs and college students feel this way. How do I deal with this panic about the future? How do I realize that my goals are attainable? Thank you Mrs. Welteroth and Mrs. Obama.", "shesanoriginal1": "MOTIVATION", "mspmacklin": "The places you'll go and the people you'll meet! #fullcircle #blessingsabound 🤗", "aurorajames\nVerified": "Verified", "wndrwomen": "Malcolm Gladwell argues in “David and Goliath” that there is often an advantage to students attending colleges where they’re naturally near the top of the pack, which is contrast to what my college counselors often told me. He says the boost in self esteem leads to all sorts of statistically measurable benefits, but I’d love to hear your and Michelle’s opinion on his argument!", "brinnn_xo": "-I graduated high school in 2010. I’ve been in college ever since but not including the time I took off from school && went back in January of this year ! What advice do you have for someone who has been torn between quitting or continuing to finish the race that is before me ?", "iamtyrenee": "🙌🏾🙌🏾", "im_thehbic": "@ayeeereed drop your questions for Mrs. @michelleobama & the @elainewelteroth!!!", "anoukftn": "Hi ! I’m a French student and I have applied to several schools in France and I do not know what to choose between the schools I was accepted in : 2 years of preparation to the exams to enter economy schools (but it is not a very well renowned preparatory school even though it is one of the prestigious options OR an architecture school (I wanted one in Paris but only got in one in Rennes). I don’t really know what to choose bc I love arts and architecture but the school I got in is not high in the rankings and I am afraid I won’t be able to achieve my dreams with it. On the other hand, the preparatory school won’t get me in the very prestigious economic schools of France or abroad and I am afraid I won’t have a job that I like. What should I choose ? When I look at your carrier I am so inspired to continue the hard work in college but I do not know which path to choose ?", "janekeltnerdev\nVerified": "Verified", "laurensyd96": "I am a recent college graduate and am currently in a slump as to what comes next. What advice do both of you have for what happens after college: i.e., going straight into the workforce, community service (peace corps or otherwise), or continuing on in education? Thank you!!", "souovinicius": "Love this story. 💪🏼👏🏻❤", "runwayribbons": "What a beautiful story! Look at God! 👏🏾👏🏾 Love you Elaine! 💗", "lindajohnsonrice": "Thank you for @ebonymagazine shout out. @michelleobama was a great cover subject", "ohhyannah": "How do you get an internship or coop when your marks might not be the best?", "celebrity_sifer": "Flawless", "lauracq__": "How did you all deal with post-grad stress and anxiety? I feel so lost right now 😩", "rayray3000": "This is amazing thanks for sharing and for doing all you do! 💛", "rfmb": "As a ‘16 college graduate, I’m currently considering graduate school. But how does one break into an industry that heavily relies on previous internship (that I don’t have)- I could not afford to intern in undergrad so that I could work my normal job. So many roadblocks I’m trying to get through! BTW thank you for being the most wonderful role model for young black girls like me trying to break into this industry. I’ve been a fan and admirer of yours since TVFU 2013💕💕💕", "brabar.us": "👍❤😘", "blair.w.martin": "How does one calm the fears that arise when your not sure what to major in. When you know the career that you want but not necessarily the correct path to get there and wether or not that path can support you when things go wrong", "ash.blynn": "Wow that’s amazing", "untouchme": "I’ve been dwindling in community college on and off for 8 years since graduating high school and while I still want to get my 4 year degree, drudging through basic courses has been a challenge (not academically, but in terms of finding the motivation). I’ve dropped so many courses due to mental health, my workload outside of school, indifference due to a lack of feeling challenged. I want to study journalism when I finally wrap this up and that dream has kept me in, but it’s still been tedious. A lot of the time I’m fearful of taking on debt and discouraged by how many of my peers have degrees but can’t find work (or work that pays). I do ultimately want an education, because it is an accomplishment, it’s something nobody can take away, and it’s crucial to the industry I want to participate in, but it’s been a horrible experience so far. I’m not sure what advice I’m looking for here, just wanted to share.", "jalettalovestone": "So good💕✨🔮", "xmisscarroll": "@lenaaforever", "jessica_joie": "Incredible post, incredible work ❤️❤️❤️", "hfaraway": "Are unpaid internships worth it?", "melaniepatterson_": "I work in higher ed recruitment, at an art school. How can we move to reshaping students of color who don’t think that college is an option as a collective, and from there, stressing the importance of (and that there’s a safety net in) the arts. Trade work jobs are empty and other jobs are being replaced with computers while the market gets over saturated. But the process of an artist (so far) cannot be matched by robotics or AI. How can we get students of color to own this creativity fearlessly and be the next game changing artists and designers?", "kamstagramm": "Inspiring 😍", "lilian_stella": "danisferra jaquesferra", "gara_marrero": "We need inspiring stories like this. Thank you 👏👏😊", "adjua": "How can students who have had to stop, start, and stop their college educations due to higher education’s predatory financing help themselves? Asking for my loved #1", "ryan.j.wilson": "How did you decide what you wanted to peruse in life I’m high school and in college, leading to your internship?", "nicoleahgold": "But most importantly, #outfitgoals", "sealofgod.info": "❤️👍🏻🙏🏼🇺🇸🌎✌🏻✌🏼😉❤️👍🏻🇺🇸🌎🇺🇸👍🏻❤️❤️", "tyanawoodard": "This is so amazing! I just graduated college this May and I was also the first in my family to attend!! It was certainly not an easy journey but I am so glad I persevered and was able to maintain a full time job, a full class schedule and at times two internships! Now I have a college degree and the world is at my finger tips. I’m proud to be a role model for my younger siblings as now I am able to provide them the assistance and guidance that I needed in the translation from high school to college! Such a great feeling. 💜✨", "erinjoneswesley": "Awesome!!!", "nicolerosanwo": "Woww! 😃👏🏾👏🏾", "citybeautiful": "Is there any way I could attend this event?", "valegila": "Inspiring! Brava. 🙂", "bobbyakennedy": "The moment we’re back in nyc, my girls need to meet, see and hear you speak. Specifically, the curly hair don’t care lol 💪🏾 plus we all need a catch up, right @hungryabney", "thefashionplatemag_official": "Such an amazing story! Good luck, have fun, make history!!", "angeljadah": "Focusing on school is tough, especially when the price is unethically high. Also feel, it adds an unhealthy amount of stress between the work & tuition. The price of a decent college is just so out of line with my beliefs of education and life as a whole. I definitely think a more reasonable cost will give low-income and minority students the initiative, along side better guidance from administrators, especially financial ✌️😁💖", "jvrrett.t": "This is amazing and I’m crying", "primoasher": "@celpatel @alliedorf Read the post all the way through. She’s perfect!", "rickie__graphics": "Kindly check out my IG gallery™ FOR •••> LOGO •••> CARTOON PORTRAIT •••> COVER ART •••> ANIMATED VIDEO AND LOT more DM FOR INQUIRY AND PRICES 🎨💯🎨💯🎨💯🎨💯🎨💯🇦 🇷 🇹 🇸 !!!!!! 🇦 🇷 🇹 🇸 !!!!!!", "kwalil": "THAT is how it’s done! ➕", "alaaana_jannnee": "I think the hardest thing about being a high school student is finding your way in this world and finding your niche, can you explain the time when you finally found your niche? And the experiences that led you to finding it?", "jc.weber": "In terms of getting internships and jobs in big cities, how do u find a place to live, money etc? I really want to move and work in a big city out of state after I graduate but just thinking about the logistics scares me lol", "han.lo": "I’m a student at William & Mary studying history and media. I’m curious — what are the skills you learned outside the classroom that have best served you in your career?", "sunheebeauty\nVerified": "Verified", "itsarchel": "You’re such an inspiration!", "maneaddicts\nVerified": "Verified", "mrsdennis93": "Oh wow. I am so jealous. She is an amazing woman. I sort of have a college question. I am 55 and plan on returning to college this fall to get my bsn. Scared to death, I am. Major anxiety. What if I fail...? Help", "jessdelagarzaa": "The damn glow up is so flossy I can’t stand it", "tanikaray\nVerified": "Verified", "ashesflashes": "❤️💫", "juliescelfo": "Have a wonderful time!!! 👊🏿👊🏾👊🏽👊🏼", "surrenderpink": "Both of you are wonderful", "muta.nadimi": "What a wonderful back story 🙅🏽‍♀️💛", "mizwoochic": "AMAZING!!!!", "kamaron": "I am clearly in good company, as I too worked under the legendary @harriettecole!! 🙏🏾🙌🏾🙌🏾", "alinavue": "What are some tips or advice you have for public presentations in college? I have social anxiety, so I find it difficult to talk in public to people. And another question, what advice do you have for incoming college students when it comes to juggling multiple responsibilities? 💕💕", "mrelfuego": "I hope she got to bring that top home. Barrack over there winning 😁", "alextalaveraa": "I’m a junior in college right now studying fashion merchandising in nyc. I’ll be graduating next may (FINALLY🙌🏼) and as much as nyc is filled with amazing opportunity I know I do not want to stay there after I graduate. I LOVE fashion though and I always have since I was little. I know I want to stay in the fashion industry, but I really don’t know exactly what I want to do once I graduate. What was your experience after you graduated? And what advice would you have for students who just graduated and are trying to figure out what they want for their career? 😊🤓", "vsizzlebx": "🙌🏾🙌🏾🙌🏾", "sherylgeorge917": "👏🏽👏🏽👏🏽", "desiree.shanice": "Such an awesome full circle moment! Love this 💜💜💜", "sophia.santos": "Did you ever feel pressured to follow a certain career path because you are a woman? Were there stigmas surrounding women obtaining certain degrees versus others?", "ximenalarkin": "@dririrob the first to go!", "mysocalledheif": "How do I get the summer internship I want with no connections!", "5ocheata": "How do you keep in touch with friends after college? Especially when they are all over the world", "shanniganz": "this is AMAZING! 👑👑", "meghadawer": "What type of advice would you give to those students who are looking at an occupation which does not have many entry-level jobs but opportunities for those who have multiple year of experience? should these students keep their options open and study something else as well or just focus on what they are doing and hope for the best?", "cierrabhardy": "LOOOOOOVE this!!!", "gordonching": "It took me 7 years to graduate and get my bachelors degree. There are 4 years within that where I took an extended leave to pursue career opportunities that changed my life. I was able to work around the world with a global nonprofit @aiesecglobal and eventually at @apple in marketing. These experiences completely shifted my mindset on education moving from a linear to a progressive approach. How do we teach young kids these days that school is not just about mindlessly going through school but to take the chances and opportunities that grow them as an individual. How can we make our education system more flexible and experiential that supports this model? Allowing people to have greater access to learning on both outside and inside classroom experiences? Thank you @elainewelteroth!", "synnnnney": "Passion and motivation is very important. There is no black and white world where some go to college and become successful and some don’t and become nothing. College is not for everyone, although it is a GREAT starting point for many. There are soooo many programs out there to do after high school than to go college. Everyone learns differently and everyone achieves success differently. I’m a first generation college student in my family, and I realized this once I got to college and moved to a city. Some may feel stranded in your talk about college as being the only solution, when in fact that is not true. One must take their passions and motivate themselves to learn in a way that fits them, whether that be college, a trade, internships, work study. It is very important to reach out to people that are doing what you Want to do, find some mentors and learn. There are many options, and it is VERY important to inform people of that.", "mimiandtheunicorns": "College is going the way of rotary phones, over time it will become non-essential especially in technology careers where apprenticeship (or a form of it) is more valuable and valued. I welcome this model, crippling college debt should have no place in our society. The only people resisting this change are people who have a college degree and universities that need the income. How can we as minorities and women prepare for that?", "flossy_flo": "@_lovelytray", "alannaorgill": "Tips on navigating the first semester of college?", "amyastley\nVerified": "Verified", "melody8rown": "What would you say to a person who is late in the game? Starting college in their 30s", "chy.niecem": "as I approach my senior year in college I realized that my problems/situations would not be the same in a different environment. I have struggled from point a to b in terms of figuring out what I want to do after I graduate and living in a society that functions to produce more and more of whatever at a pace that creates a deadly amount of anxiety I am strongly considering finishing my education in another country where things like gun violence in a school setting is unheard of, amongst other things. And To that end many college students including my self have lost hope in equal and sustainable opportunity here, and this is just barely scraping the surface", "jessica.l.simpson": "💕✨💕✨ AMAZING!!", "graceiinny": "This is AMAZING!!! 😊❤️", "full_oflife1": "How did you manage for finances during the school year? A lot of people ask about debt afterwards but there are struggles currently through the year of financial aid and scholarships are still not enough. Asking because I’m in a position where I might not be able to go back to school due to this.", "melaniemabel": "Amazing", "ambzz88": "❤️ this!", "sunofz_music": "Queens", "_bethdk": "Love this @lucyydk", "elliemonstersworld": "❤️❤️❤️", "kickitwiththeking": "do you have an advice for finding work / battling debt and loan repayment after graduating college?", "monigabrii": "how do you know that you’ve chosen the right school for you, esp when the choice is between a school that would leave you in major debt but feels like home vs a school that doesn’t yet but gave you...a full ride?", "karintcampbell": "🙌🏻👊🏻", "aaliyahsadler": "Sacramento, CA - Hello @elainewelteroth💓 I’m still attending a junior college after graduating from high school four years ago. Society puts on a lot of pressure to enter and graduate from college in four years and then pursue a masters degree shortly after. The most successful people in the world never even finished college (Mark Zuckerberg, Bill Gates, Steve Jobs). Do you think you can still be successful in today’s society without a college degree and still be financially comfortable?", "marinarust": "👏👏👏👏👏💙", "gemini_mich": "God is great. Congrats.", "hopejikiemi": "Fantastic full circle moment. Have fun and enjoy!", "ninasonovia": "❤️❤️❤️", "ariane.turner": "@milaaan__ you should absolutely submit a question.", "sheinthemaking": "👏🏽👏🏽👏🏽👏🏽👏🏽", "mrwestmrfresh": "#GOALS 🙌🏾🙌🏾🙌🏾", "alopeachia": "This photo cleared my skin and added 5 years to my life 😍😭😭💕", "cndworld\nVerified": "Verified", "zhdara": "So dope!!! Talk about full circle. Great read & congratulations on your success @elainewelteroth I enjoy following you", "socialworkdiva": "What a awesome full circle story!", "shareshadesapparel": "Love it! 😍😍", "luluautumn_xv": "I’d love to start an initiative group with the youths I work with. Any pointers please?", "b_gully_": "Ahhh! Congrats!", "reschelle_sells": "❤️❤️❤️", "jamaitian99": "How do you get more scholarship if your parent “makes too much” money? (Still struggling)", "shaunborne": "I’m a rising junior in college, and the thought of the “real world” is looming. As upperclassmen in college, how did your school prepare you for life after undergrad? How was it preparing for/ going through graduate school?", "sugarpopaesthetics": "That s awesome girl.💜", "albumcover_artwork_logo": "✋™ I'm a graphic designer💫💫. Hit me 👆to get super cool design🎉of your picture illustrated and cartoon🎨character of your self💯💯", "treasureredmond": "This is exactly why my passion is helping busy parents of college bound teens secure top-tier education without massive debt! The majority of the families I serve are African-American and like all families have a big vision for their kids, but are overwhelmed by the process. Bless you and Mrs. Obama as you contribute to this foundational piece of the achievement puzzle.", "carolroque__": "So inspirational! ✨🌟 The kind of achievement I'm looking for! Keep shining and inspiring Elaine!", "akiliaaann": "hi! Senior in hs. How will I know I’m getting all my money’s worth/making the most of my opportunities when I get to college?", "_aziree_": "Amazing!", "retroblades": "This is excellent Elaine!! 💜", "hammersmithhoney": "Great full-circle story @elainewelteroth Thanks for the inspiration! 💖", "brinabazooka": "#fullcircle", "kacpassos": "😍", "brizayyy": "as a freshman becoming a sophomore finding a major and choosing a college can be difficult and a little confusing for me. do you have any advice or tips for that?", "udoyouglo": "@jenna__lam 😌♥️ thiiiiiiis", "dukieology": "#MakeRoom 👏🏽👏🏽👏🏽👏🏽👏🏽", "madam_wokie": "🙌🙌🙌🙌", "adorablebum118": "What advice do you have for seniors in high school who are going to attend college in fall?", "marmarfrick": "👏🏻👏🏻👏🏻👏🏻👏🏻", "djcdevone": "Amazing", "ninjakhanjedi": "I LOVE this ❤️✊🏽❤️", "csevolutionofstyle": "This is incredible! What a blessing of an opportunity to interview the only #FLOTUS i acknowledge @elainewelteroth 😱🙌🏾", "channiee_lu": "Full circle, you go girl!!", "mia.baella": "Because I am a Latina people make me feel as though I’m attending my school because I’m a minority and as though I’m less deserving or qualified to be a student there. Was this ever something you experienced? If so, how did you counteract it?", "dandybeeme": "@facebymarii Dope!!", "shaundanecole": "I Love full circle moments!⭕️🤗❣️", "tabreshal": "How do you think we get people to move past the stigma of community college as the 13th year? I work at a community college in Prince George’s County (a suburb of DC) and I always hear from students who say they never took community colleges seriously, when in fact, it’s a great option to pursue a higher education and reduce the cost of college all together. Especially for low income families who may not be able to afford the expensive costs associated with 4-year universities. Community Colleges can make it so that you only end up paying really expensive tuition for two years verses four. So how do we get people to see that as well as the other benefits of attending a community college to create a better quality of life for themselves and their families?", "graffitiface": "I am screaming at this last post on ig! I'm Soooo proud of you!!!! I remember you telling me about the beginning and now it's all coming around full circle! Congrats!!! I'll be in dc tomorrow I'd LIVE to just be in the room!!!!!", "noircoreen": "Ask a question! @barklee13", "t2_tasha": "So awesome!! So good to see the high school and college kids chiming in on their questions. Love it!!!", "miss.adrena": "I always love your backstories...inspirational!! 💛", "emmanueltkindt": "Two icons together @michelleobama @elainewelteroth 🙏", "michaelmanli": "💫💫", "00leesh": "This is sooo cool !", "rikkwright": "Wow, ❤️🙌🏾", "_iajai": "I'm a junior next year and I feel as if I have no path. I know everyone says we have time but each day it seems like people are expected to be successful younger and younger. Is it actually possible to pursue a dream rather than get by? I don't want to get a useless degree just because I want to be a poet but I surely dont want to get a degree in something I don't like and be miserable. Is it truly possible to have a balance of passion and profession?", "terridanyale": "I’m a first generation college student, I just recently graduated! It’s an exciting time in my life but also a wee bit discouraging because I worked so hard my entire college career, missing out on things bc of my part time job and internship. I knew for certain my internship would hire me on full time bc I busted my butt. Only they let me go, increased the pay & hours yet told me I did incredible the entire 8 months I was there. My question is how do I stay motivated to follow my dreams when on the job hunt especially after facing a blow like that AND being denied to nearly every position I apply for.", "nwaka.onwusa": "🖤🖤🖤 love it!!!", "livinginmommywood": "No job is too small or a waste. Anything can turn into something 👏🏽👏🏽👏🏽👏🏽👏🏽", "pureformetraining": "Awesome!👏🏽", "vers_fotos": "😍😍😍😍😍", "zamorame": "I needed this push this morning! 💕", "bethanethedrug": "I love when you share stories about how you got started, so inspiring 🤗🤗🤗", "mariapurrtas": "@mv_reddy", "sisph": "This gave me chills!! This is so awesome and necessary for our young, bright and gifted kids. Get it girl, so happy for you💛", "x_goldenbrowngirl": "After great consideration and extreme hesitation, I have began enrollment in grad school. How do we get over the anxiety of economic hardship (because of student loan debt) and make the most room for the bigger picture, which is the desire and aspirations of continuing higher education?", "sammyapproved": "@number1ari", "larissalovecosmetics": "💚", "coach.carey": "GOALS", "devinebeaute": "This is truly amazing!! Thank you for sharing!!", "jbuczkowska": "You are incredible!!!! 🎉🎉🎉🎉🎉 such an inspiration", "bronze_bombshel": "Amazing!!!!!", "blkbridalbliss": "@wildgirl_dom @bigpapa_naya @brizayyy @tyversen_1 Read caption and comment here with questions/concerns/comments for Mrs. Obama about college if you have any. Love you all.", "msdeandreanachae": "How are we addressing debt management for those entering college without full tuition coverage from scholarships/grants", "jennijanks": "Are student loans worth it? Or should people just take up a trade?", "the_mama_sagas": "Amazing! Congrats on a perfect full ⭕️ moment! 👏🏼", "lucia.rog": "i have two. one: i’m anxious about the prospect of struggling with maintaining my true self in college (i hope that makes sense). two: there’s the looming concern that i’m not smart enough or that i’ll really struggle with subjects i either dislike/find hard. how do i persevere? hope these make sense, thank you for doing this! i really look up to both you and Mrs. Obama. ❤️", "realryry": "Incredible! You are on the right path in so many ways", "donnaelledesign": "🙏🏻❤️", "kevinthomas": "WOW!!!! I LOVE @michelleobama", "angieb_tv": "I remember you telling me you've legit always had the same face no matter how old you are and it's true!", "the_village_boy_justin": "Nice", "denelld": "Whew!!!! 🙌🏾", "bridgie_xoxo": "💪🏽✨", "denetrak": "@adoseofkay", "thejessica_j": "As a member of the academy, I fear college will become so expensive that the coming generations will circumvent the higher ed process as necessary. I don’t see this as a bad thing, in fact even AFTER my PhD I wonder if it was worth it? But I do see it as a problem. We cannot start a generation off as adults in a six figure deficit.", "its_jessieo": "What's your ultimate advice for aspiring jornalists in high school? What was your journey to becoming editor-in-chief??", "kenromil": "I remember this young lady. Look at her with that big smile. 😊😊😘❤️xoxo", "liv_uhhlittle": "Love this x100 🙌🏾", "emiliamcferren": "So amazing!!", "ayanoeeel": "Wow 🙏🏽", "djbeautyandthebeatz": "👀who’s the DJ for this event?! @elainewelteroth put me in your pocket!!!!!! I’m sure me and equipment will fit!!!!!!", "enjoielife": "What a beautiful picture", "toddiwoddi": "♥️🙌🏾", "meonette": "😍 amazing", "noranmorsi": "Did you enjoy college? I love what I’m studying but I tried really to enjoy my first year and I really didn’t! How do you make it work? Did you study abroad? Thank you!! Much love", "nzingasays": "What an inspiration! Can’t wait to see how it goes!", "robinplemmons": "Wow. Michelle! (🎉🎉🎉) Your work has to be so fun & fulfilling. Thank you for continuing to use your voice to lift people. 💖✨✨✨", "iamrenaebluitt\nVerified": "Verified", "nnadibynature\nVerified": "Verified", "marienoelnt": "My parents moved to Austria in the 80s. None of them graduated high school. My brothers and sisters and I are the first in our entire family to go to college and graduate. Which was the reason why my parents left Congo in the first place. So I find this iniative inspiring as well as important. Foremost because everyone should have access to an education but also because you never know where your education can take you guys. Don't take it for granted, but don't be scared to give it a try, to dare to purchase your interests and dreams. 🙌🏾🙌🏾🙌🏾 It wasn't a question per se but I wouldn't be where I am today without my college education. So I just wanted to chip in on this opportunity. 💛❤️💙💚💜🧡 @elainewelteroth", "sisstayready": "This is so beautiful and a great reminder that those we look up to put in the work for years before they were in front of the camera. Wish I knew how to attend this event. I worked with first gen students and I loved it. Being a resource for students taking a huge leap is a rewarding experience. If I could go back I would have found time to do an internship with my Federal Work Study to get more experience in my field of Communications. It's hard when part of your federal assistance is required work that isn't always related to what you want to do. 👏🏾👏🏾", "ncar.o": "how can you make lasting connections in college to help you later in life? how can students better prepare for adjusting to college life in high school?", "lelemariecreates": "This is LITERALLY the definition of AMAZING! I love full circle moments!", "demetriallucas\nVerified": "Verified", "charleychioma": "Inspiring. What a full circle", "lizdarcangelo": "❤️❤️❤️❤️❤️", "tanishalavernegrant": "Amazing.. @elainewelteroth You inspire so many!!", "helloelizabethmeg": "❤️🙌🏼😭", "jeremyclayton": "🙌🏾🙌🏾 #FirstGenerationSquad", "destinyleahday": "❤", "the_woodenpalate": "So fantastic! You and Michelle are inspiration to us all ❤️", "lydianevintage": "Queens", "sydnee_martin": "Were there ever times you wanted to drop out and just move on from college? If so or if not, what ways/advice did your give yourself to keep pushing past those fears?", "thestaceylynn": "So awesome! All the best to you, and this wonderful experience! #continuetoshine ✨✨", "yb_2": "❤️❤️❤️", "teddytinson": "🌈🌈🌈🌈🌈", "deanna_harris": "👑👑👑👑👑👑", "meggiepalmer\nVerified": "Verified", "allisoncea": "Such an adorable photo of you and great story! 💖💖", "gotham_wellness\nVerified": "Verified", "mhooks02": "Where did you go to find scholarships to aid you to go to college?", "vinpixphoto": "Wow", "teachmedia": "#madeatsacstate @SacState #superproud", "coffeeandhoneycomb": "👏👏👏", "beccacoop": "😭😩Shero.", "themodelcoaches": "So incredible", "celinecelines\nVerified": "Verified"}