{"suitetabubyakidah": "🙌🙌🙌🙌🙌", "patisserielefildariane": "I can always count on you to have the words ♥️♥️", "kanderalmom24": "ABSOLUTELY", "nakia_hill": "Say it louder! ✊🏾", "southernbella73": "And yet they came for Kamala Harris citing her bad attitude. Whatever.", "superdupercarm": "MAAAAAAN", "shenbeauty\nVerified": "Verified", "90ius6_": "But someone did... Clarence Thomas", "lisbetholivia": "👏🏼👏🏼👏🏼👏🏼", "hitaste": "@elainewelteroth As a man, sometimes I can become confused by man/woman societal imbalances. As a black man, I actually find many similar issues as faced by WHITE women. In terms of dealing with white male privilege. I have questions. 1. Do you as a Black woman supporting the empowerment of ALL women, feel your voice could spark the movement we see globally, if the issue did not include frustrated white women? 2. Do you face the same oppressive behaviors from Black men, as you do from white men? 3. What would be your needs from black men, if this issue does include us in the category of “Men”? Thank you", "suebfries": "🙌👊💪🏽", "alexgasaway": "♥️♥️♥️ beyoooond true", "crysmack": "Yep.", "itsmetee1031": "The sad part was it wasn't just Kavanaugh. Lindsey Graham was sickening", "claude_thedog": "Were you triggered because you were sexually abused? I’m so sorry.", "magreymailer": "Yes and yes and yes and yes yes yes 🙌", "kingkandake": "Welp!", "thurmank94": "You are delusional, as most of the comments on this thread are and I might add that you are looking mighty privileged yourself.", "heyericadomm": "🖤", "cammid14": "#facts. We can have zero emotions.", "sunny_shakti_": "Smug is the exact word I’ve been using.", "barbaradevriesgordon": "Imagine RBG acting like this. Just imagine... never", "theworldside": "The cutest :grinning:", "alexandrodlp": "✌", "aleenkeshishian\nVerified": "Verified", "cloudycompostspie": "Yah", "aandjtravels": "✈️ This is the best life! Leave no stone unturned.", "blackrustworld": "Absolutely disgusting.", "bellaeredita": "The woman that works next to me felt she could commiserate with me over her annoyance that “this nonsense” was happening. WAIT... she felt it was a “witch hunt” and “a waste of tax payer’s money”. MA’AM!!!! I told her to walk away before she made me lose my job!", "thinkorblue": "Yes. In order for DR. Blasey Ford to be thought of as \"credible\" she had to be extremely polite and often deferential during every word.", "loudgirlmovement": "@elainewelteroth and yet the ANGRY BLACK WOMAN stereotype (American true type) exists) and everyday Black women and girls fights “this.” While someone is telling us to relax or calm down.", "jjlevalley": "Your racism is disgusting.", "etrav992": "So true. Disgraceful. Whinny white Male privilege on full display. I am so mad, I had to stop watching.", "240dl": "Absolute truth", "kale.slut": "💯", "derronne.bernard": "Thanks for connecting👋", "mrs.santini": "And they call us emotional// hysterical 🙄", "thedivinemissnik": "Cory Booker, what a man", "hillswife": "I’m glad he did act like that. Now he looks even more guilty. How many times was he going to side step the FBI Investigation questions/challenge? I counted 9...", "noladarlingvintage": "There’s no incentive for him not to display such behavior. The good ‘ol boy network is alive and well.", "beautyisuniversalug": "Indian privilege in Uganda.....", "mslee16": "These privilege men need to go home and sit down with their wives and their children and ask them what secret pain have they been hiding. We all have secrets!", "sacrelyne": "He did us all an immense service, perhaps also he had a few 🍻 🍺 🍻🍺🍻🍺🍻🍺🍻🍺🍻", "destinj": "Exactly. Thank you for speaking Truth ♥️", "flfstyle2": "Thank you for not calling it anything other than what it is ! I needed someone in the room to just make that statement 🙏🏽", "torysarro": "@kim.sneed", "peacenlovemmb": "🔥🔥🔥🔥🔥🔥", "jacqblac": "All of this. Every single word of this.", "jamiehaller_____": "Agree! Sickening the double standard. I’d be emotional hormonal hysterical and immature if I acted that way.", "jchimere21": "BIG F A C T S!!!!", "jane_c_go": "Hysterical, petulant, immature, sneering...", "candielaine11": "@bri_pergola THIS!!", "ndelisle": "Yup. No way any woman could act like that either.", "everyday.hollyday": "FACTS", "slmdances": "It’s insane.", "noniecreme": "Utterly. Such a travesty", "theemeraldrock_drj": "Gurrrrllll ....", "amy_mcbroom_studio": "Extremely well said!!!!!!!!!!!😡", "write_into_culture": "YESSS. The disambiguation of white entitlement for all to see, like never befire. It better be a new day soon", "samplesalegirlla": "OKkk!!!", "dbulseco": "Agree! 👏👏👏No woman or black woman or any man with any level of self awareness would even want to act like this, much less get away with it. Embarrassing.", "lesdidit": "Yikes! Y’all, are playing into their Hollywood schemes....so much more is currently occurring and these two discussing HS drama...how rude to get a nerve to speak days before HIS WHATEVER...why not before he got married?! His wife should’ve been alerted so she knew what she was marrying into, if this is about ‘women’ smh...y’all are getting played with their PR spins...let’s save our 🌎 our food, our children, they ARE BEING POISONED 🤢 FOCUSSSSSSSS💥💥💥💥💥😰🙋🏾💝‼️", "nicenicedanedane": "Im pissed 😡", "tequila_lamar": "Thank you for putting words to my feelings!", "lepelicanmanor": "Vote Kavanaugh 🇺🇸", "cuponpuebla": "😁", "searchforuhuru": "what kind of privilege,could you be more specific?", "ginabrookebeauty\nVerified": "Verified", "paula_bollers": "@laurenmichellewaller Adding aggressive and intimidating when I was really being assertive leader. #doublestandards", "surieldesignstudio": "TRUTH.", "itsdeborah\nVerified": "Verified", "karla.milat": "🙌🏽", "lena_oluwa": "It’s infuriating!! 🤬", "kaycoolkay": "Girl.", "nicolasmaxwellll": "He acted just as anyone being accused of something without evidence would. His actions and speech strangely resemble that of Supreme Court Justice Clarence Thomas (a black man if you didn't know) in 1991, also falsely accused. Strangely similar.", "ashleemarees": "My white middle aged colleagues @ashtriplea", "shoes_beer": "Truth!", "abla_annette": "Yes!", "susanbratton_1": "True. May I add petulant, entitled and not cool under pressure. His performance yesterday completely disqualified him for the Supreme Court. He does not have the temperament required to make fair and unbiased judgements not to mention an ability to withstand the extreme pressure and scrutiny that every Supreme Court Justice endures. And that is before considering the sexual assault and Blum out drinking allegations. #votenoforkavanaugh🚫", "gypsyrhino": "Girl yes! 🔥🙏🏽👌🏾", "kevinthomas": "Agreed ... it’s another sad day for America. Grieving 😢", "megansmovement": "Ladies, you need to mobilize your feelings into ACTION! It isn’t enough to be angry, sad, disappointed anymore - you must be boots on the ground! Have the uncomfortable and painful conversations with friends, family and strangers. Join community groups, campaigns and charities. We must do our part, however small it may look or feel. Small ripples build into huge waves.", "sweetbeemel": "#facts!!!", "itscarissahere": "@misstiff323", "lilo10029": "@elainewelteroth #facts💯 his behavior was disgusting", "jennell.lynch": "This! 👆🏽", "reballen": "Kavanaugh is like so many of the boys i went to high school with: extremely privileged, highly mediocre and so accustomed to getting their way that when they don’t they cry like the big babies they are because they’ve always had a leg up and a giant safety net underneath them that they’re completely developmentally stunted", "jessienicole327": "@sarahdluna", "barb_wyatt": "Agreed.", "hope.mcgrath": "It’s just pure insanity.", "skyegiordano": "@wrosen25", "lisamperk": "#truth", "mccannjl": "Can you IMAGINE a black man getting away with it??? never!", "jill4675": "Indeed. 😡", "lisa_is_soft": "@amandaseales 💯", "shay.iamiam": "Exactly.", "janekeltnerdev\nVerified": "Verified", "iamchynarichardson": "YUP!", "elizaukpe": "100%", "kharamw": "💯", "zoe.whitley": "💯", "lesliebwhit": "Unbelievable 😡", "jaymoccia": "Privileged, belligerent white man screams “IM INNOCENT”, thinking he’s entitled to a lifetime position to sit as a judge on the highest court in the country. His temperament alone was despicable...if Ford had exhibited even a shred of the tendencies he displayed she’d certainly not have received the warm reception he did. We need to vote these old ass white men OUT!", "brownskinnedlady": "@katharinedornystyle", "dopestuffaccording2me": "...couldn't get away with it on ANY level. The insolent tone alone would forfeit future wins and gamble the old ones.", "lemlem_28": "🙏🏽👌🏾", "rosieoutlk": "#metoo", "gretchenncarr": "@una.oljaca @alianapotter", "starchildlioness": "Thank you", "hey__its_lola": "Look out- dudes clinging to your white male privilege- the revolution is coming. I am GALVANISED by this travesty #TimesUp", "viplister": "SICK👏🏾EN👏🏾ING!👏🏾 It’s soooooo crazy to me. He acted offended at the audacity of people questioning him and his right to privilege. It makes my blood boil!", "nardlyworking": "Babyyyyyyyyyyy when i tell you!!!!", "jyenners": "🙌🏽🙌🏽🙌🏽 #truth", "carrie.elizabeth.stiles": "🤦🏻‍♀️🤢😩", "amyastley\nVerified": "Verified", "toy_storiiiz": "@brittanie_evans be strong sis...fuck that job ...i quit mine today too I start a new one Sunday", "ebonylumumba": "👏🏾👏🏾👏🏾", "echemeen": "Question does Kavanaugh know this was still part of an interview?", "tsh.nyc": "The angry white privileged man. #relics", "simplysydp47": "Well said 🙌🏾🙌🏾", "nikkipew": "Sharing!! 😘😘😘", "sgilbert1229": "Every bit of truth!!!!", "veganstreetfair\nVerified": "Verified", "realdonshea\nVerified": "Verified", "morganaliciaa": "Big facts", "tameujewelry": "😣😒", "georgiapricem": "🙌🏼🙌🏼🙌🏼👏🏼👏🏼👏🏼", "spiceboytony": "the realest", "arunimamajhi": "And Chuck grassley mansplaining to Feinstein? That tone? Never once did it come up with any male dem senator.", "tallulove": "Say it louder for the white cis men in the back!!!! 🆘🆘🆘", "tallentriccabacon": "🙌🏼", "lifeaccordingtoangelarich": "Very crass", "temanibeck": "This! 🙌🏽", "brooke.jackson.edmond": "Amen", "emmaly12": "VERY TRIGGERED.", "whatkatesaid": "Couldn’t agree more", "piazadorasghost": "🙌🏾", "jenspenduncan": "You’re right. They would say we are “hysterical”. So many double standards.", "_farah_x_": "It’s horrific. More sickening is the blindness to the double standard!", "slickvick76": "All of this!", "jillionare3": "👏🏾", "christienne.d": "These men are absolute trash. Not only too emotional for their positions but have no concept of right and wrong but even if they do, they are incapable of controlling their actions. They all need to go!", "torimhardy": "🍵", "miz_lucy": "When Serena did it she was being a “brat” but BK is described as “strong”. What a joke. He was completely disrespectful", "kay_nic": "💯💯💯💯💯💯💯💯", "dzynbynicole": "Extremely!!!!", "wild_thorn_berry": "@kelzzbellzz @idaabraham", "priyaparker": "Correct", "sh_eh_bee": "Facts.", "juleyjames": "Mind numbing", "mcdonaldrenee": "Preach!", "anieschafer": "Yes", "brittanythierry": "@jordanaubey", "supremevixen": "I am just trying to breathe sis. It’s disheartening. The disrespect and the implication of Kavanaugh holding a SCOTUS position is too much for me to bare.", "cnmdpm": "Your describing the behavior of every DEMOCRATIC senator Elaine.🇺🇸🇺🇸🇺🇸The Judge cried, or did you miss that part? Your clouded by prejudicial bias. BTW , we have the votes.#Kavanaugh🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸", "zeemzeema": "YES!! I'm so disheartened, emotionally exhausted, and disconnected. Privilege being unabashedly smeared in our faces. 😔😡", "ingmakeup": "Excactly!", "amandavassall": "Absolutely. Period.", "roman_holiday8": "Exactly.", "tamikaherkley": "Agreed", "thesummerbrieze": "Preach🙌🏼", "robertaroth": "❤️👏❤️ Have you heard about what is happening in Brazil? We have presidential elections next week and the man on the first position on polls has openly ofended black people, said that gay people “happen” for the lack of spanking during childhood, and agrees that women should be paid less than man. He is the persona that matches the term fascist pig. #elenao", "yosoybrianna": "my thoughts exactly", "luvlodi": "Where’s the comic who mimicked Serena? Where’s the joke about him having a meltdown? Such double standards!", "prettygurlcoils": "Took the words out of my mouth", "becklynng": "He showed his entire ass yesterday, basically had a temper tantrum and meltdown on national tv because his white male privilege wasn’t working for once", "heetceo": "Same. 😱😫😩", "laurielcleveland": "TRIGGERED!!!!!", "jlbroe": "Aaaammmmmennnnn!", "erroldunlap": "this is the life they are born into. a perfect pathway of teflon into power. No matter who gets hurt", "dhowe_": "Extremely is an understatement. 😩", "keep_it_cybil": "🙌🏽🙌🏽🙌🏽 All of this !! 👏🏽👏🏽👏🏽", "fay.on.fire": "EXACTLY!!!!", "katiesobsession123": "TRUTH", "iammara.dee": "🙌🏽🙌🏽", "josephfree": "#hearhear !", "erinjoseph1": "YES", "mel_shantel": "#facts", "loretta2759": "Absolutely!", "themagicoflittles": "For sure!", "beneathyourmask": "‼️", "ebcrandall": "SO TRUE !", "teddytinson": "😤😳🤯🤬😭", "nattidd": "💯 x 💯", "shoshbg": "Yes sadlu", "mochhalady": "Absolutely!!!! Thinking how Serena Williams was criticized for speaking up. But this Trump replica was defended by Graham.", "coachharmonypyper": "He literally scared me...just awful!!!", "carmendharris": "Exactly", "claspertorch": "100% accurate", "melissa_kiley": "@zoe_corner", "annel1015": "It’s all so disgusting.", "carolynlevine": "@bbbeccab", "wellandco1": "😢😢😢", "dierdre101": "Yup! Rich White Male Priveledge and he will be voted to the Supreme Court.", "ayannacezanne": "This 🙌🏾👊🏾", "changecadet": "Absolutely disgusting!", "shanaminei": "@f_cristina27", "halomacsindo": "An earthquake has occurred in the Donggala area, Central Sulawesi-Indonesia take deep condolences for the earthquake that happened today. Let us pray, that our brothers and sisters in Donggala and surrounding areas will be given safety, strength and be kept away from distress. Aamiin #prayfordonggala", "rebekaryvola": "Amen", "delphiniuslovejoy": "Facts!!!", "monogramdecor": "It goes back to the notion that every person who can NEEDS to vote. These are our elected officials acting on our behalf. It’s inflammatory, demoralizing and myopic on their part, but it has to stop.", "konartstudio": "💯💯💯💯💯💯", "jenna_aceandjig": "yes", "ijego": "Factual", "nakeiabydesign": "Triggered AF. I had to walk away", "jordanstoune": "@courtneyjhiler", "_heydear": "All of this 🙌❤️", "sadu": "YES! Experienced this first hand in full force this year and will never put up with it again!!!! @amzs2 @mamidok", "hadleykeller\nVerified": "Verified", "jackiejantos": "100%", "melodydarlene": "That part!!", "purl22": "The bullshit & shenanigans continue! 😒", "speakingoflisa_": "Just ugh.", "mustard_seeds_move_mountains": "@manyhorizons", "siyaolivia": "Facts!", "cravisuals": "THE F**%# TRUTH", "mtribbs2": "THIS 🙌🏻", "cewstew": "PREACH", "jgiovanna": "Agree! This has been so hurtful to me as a woman, a survivor, and a friend of so many other survivors. #angrywomenvote I hope those senators against us will pay for it in November!", "servant40725507": "God will have the last say. No one is above Gods laws.", "katherinerichter": "@teresabal_", "ebonylbrown": "well said", "_jadesparkle_": "TRIGGERED", "erin_brisbane_butler": "🙌🏽👏🏽👊🏽", "_enjoymyview": "He was a hysterical mess up there. White male privilege at its finest. Disgusting!", "porschefabulous": "SO UNHINGED!!!!!!", "danikaberry": "Say it again!", "mauraelynch": "It’s unbelievable", "hiibs1": "Well said! 🙌🏼", "darealtrapp23": "NEED MONEY TODAY ❓ NO GAMES ❗️ NO SCAMS ❗️ INBOX INFO ‼️", "dtnla1": "🙌🏽😡😡😡✊🏽✊🏽✊🏽", "melarieodelusi": "So much truth in this.", "ezzythewrite": "So absolutely true.", "kale.leigh": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "chercog": "👏🏾Took the words out of my mouth", "mariaetkindmillinery": "Yes!", "marryammoma": "THIS @elainewelteroth", "homeurob": "Agree", "sophiamarie93": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "tamihackbarth": "Yes", "jsmcasting": "They all make me sick. What a national disgrace.", "yanidoes": "Me too!!", "leaheps": "Horrible day for the US.", "stephi_b98": "TRUE", "triakimm": "And here comes Cory Booker making it plain and shutting it down! DO NOT... I SAID... DO NOT insult our intelligence", "michele.bradley72682018": "Preach!👏🏽👏🏽👏🏽", "the_elevens_": "Sickening!!!!", "iamlisaprice\nVerified": "Verified", "theresemariechaix": "Truth", "alotvgg": "Exactly!", "skwilbur": "Beyond Sickening! 🤬", "chinsinlove": "Facts!", "l.a.c.e.y.a.n.n": "I kept thinking about it this yesterday. How much worse would this be for a black woman, or an indigenous woman, or a fill-in-the-blank-with-a-nonwhite-or-privileged woman? Truly grieving for us all today.", "jwujek\nVerified": "Verified", "ma.nush.ka": "THAT. PART. As a woc Anita had to be poised, stoic, controlled...unbothered as we’d put it today...a strong, black woman. Vulnerability & collegial temperament be damned...", "_nice_ky_": "Absolutely", "thesarahqueen": "💯💯💯💯💯💯💯💯💯💯💯💯💯", "bamblingsofnaffy": "It makes me sick. I am in the UK and I cannot bare to watch the footage", "jonesingformorejones": "Yep!", "luxebytracylee\nVerified": "Verified", "kaylajensenaharlan.me": "Amen", "b.b.cary": "Devastating.", "immata": "Yes!", "asoimmaculate": "Say that!!!! Facts AF THEY’d be such THUGS", "hill.realestate": "Am I missing something?? So the committee received these statements from the witnesses..and its been stated over and over that these statements are held unto federal prosecution if found to be untrue....so...how does this happen?? how were these statements vetted? not by the FBI? Shouldn't they after conducting their investigation, underwrite that these statements were found to be true or untrue??..before it can be admitted as credible evidence to this committee conducting this hearing???...", "thedanilanee": "All truth.", "hellinkay": "💯‼️‼️‼️", "kelmarten": "Totally sickening. I thought these people were supposed to have the American peoples best interests at heart", "dunesandduchess": "Sick. Sick. Sick.", "jel.hime": "A word.", "yes_precisely": "💯", "siritasavage": "Seriously!", "jamiehburton": "Absolutely!!!! Truth.", "itsjihanm": "All I saw was an angry white man throwing a tantrum because for the first time in his life, he had to answer for his actions 💅🏾", "tiara.loraine": "#TRUTH", "dsmshaffer": "Women are watching , we are voting , we are moving in mass.its Our Time to rule and bring some kindness to this madness .", "gone_a_rai_\nVerified": "Verified", "midnitetrain2ga": "💯FACTS", "anne.davy.erblich": "Rich, spoiled, mean boys still winning.", "jizzy14": "🙌🏾 I’m watching it this am and had the same thought. The rationalizing of this behavior is sickening.", "anji__marie": "Indeed", "aheide2000": "All too true.", "iam.addis": "I have so much anxiety from this whole situation 😥 you're speaking all the truth", "themikeschreiber": "💯💯💯", "unlearnlimits": "Yup yup yupp", "equihua_official": "💯", "jondamichele": "👏🏾👏🏾👏🏾👏🏿👏🏽.....Say It Loud!!! ✊🏽", "stayreadystaypositive": "Calculated crying! I was so disgusted at his opening statement.", "emilylabenne": "YES", "norrrmita": "amen", "nutrition_provisions": "Doesn’t seem like the temperament of a judge- even if you believe him.", "flintzjaydu": "I'm just looking forward to a day that a black woman wouldn't be called angry,why wouldn't they be angry ,if all you do is just marginalise the. And always treat them based on race than a their sexual identity.", "prettywithpennies": "Speak!", "daisy_mer0llin": "I was thinking the exact same thing. He is very on brand with the trump admnistration.", "ehelphand": "Re. Fucking. Tweet.", "45threemodernvintage": "I CANNOT say it any better! The entire time I was thinking how can THIS be happening?", "tamara_writes": "Also entitled!", "alyssamonte": "👏🏻👏🏻👏🏻", "roseswarbrick": "👏🏼", "ohmylambers": "Amen!!!", "srcoughlin": "I am beyond disgusted. I am so fearful for our future because our lives will be affected for years to come based on a bunch of old white men’s decisions.", "harlem_arlene": "GIIRRRLL!RIGHT!!😡", "itstabithagirl": "👏🏽👏🏽👏🏽👏🏽", "janecavalier": "👏👏👏", "micahjesse\nVerified": "Verified", "curvily": "YEPPPPP", "_msapplebaum": "💪🏽💪🏽💪🏽🗣🗣", "mayashleyj": "Absolutely triggering.", "jen.kurian": "So true. We could NEVER pull that shit.", "kell_menow": "Agreed ❤️", "smartkidparenting": "#serenawilliams", "iamcece_h": "My thoughts exactly! The entitlement was unbearable", "jaishirelle": "I agree.", "the_woodenpalate": "Me too", "vickichristine": "YES!", "dyamonj": "Absolutely! His behavior was disgusting.", "rochelle_nicole2": "soooooooooo true !!!", "withloveericka": "💯 💯 💯", "roxinyofficial": "✊🏽", "melanievision": "Damn right!", "laudandfawn": "💯 Facts!", "t2therell": "I got a message for Kavanaugh’s daughters too. You better hope that WHEN that shit happens to you, and it will........ that your father has the same energy he displayed when he was all fired up looking like a lil privileged brat.", "shaymelife": "Really sickening! 😡", "ingamae": "I’m sorry you’re triggered but how would you react if you were falsely accused? I would be crying a lot and pissed and crying and praying. I would be a mess", "frasier1013": "Truth 💥", "agmakes": "👏🏼👏🏼👏🏼👏🏼 well put!", "iamcaliese": "Yup!!!", "iamjasgp": "So sickening!", "highbrowthis": "SICKENING.", "naimahfromthecuts": "Completely triggered. This is mayhem at the highest level!!! I’m just sick rn", "cutewittoanne": "This!!!", "edwardgornik": "I couldn't agree more. It's disgusting.", "arianamakonnen": "Exact thoughts! That performance alone makes him completely unfit for the court.", "nellimax": "Look in the closet, that's where it's all hidden", "candicedenny": "go off sis!", "allthingstaj": "👏🏽", "theoliviarodrigues": "Triggered AF", "tijn2001": "👏🏻👏🏻👏🏻👏🏻👏🏻", "taraamackey\nVerified": "Verified", "iamdeeplyloved": "We can't wear sleeveless dresses in photos... Soooo yeah triggered AF", "tollhousecookie63": "He does not remember due to the excessive drinking, which makes him more dangerous. #Anothercoverup", "queenanaialaw": "Privileged and disrespectful to the system in which he thinks he deserves to be granted power of. 😪", "szaby7": "#facts ‼️", "amycwebber": "TRUTH - I’m feeling so much and anger and frustration keep rising to the top", "juniper.kisses": "Amen. It is disgusting", "therealrobinclark": "Truth to power. 👏🏽👏🏽👏🏽", "mimamimamontes": "imagine me going to work and speaking to a judge in that tone? I would be held in contempt soooo quick!!!!!!!!!! such a double standard.", "lindsey.mcgill": "Ugh the crying was too much from him. I had to take a break. And the fucking “calendar” thing 🙄🙄🤬🤬", "payelgupta": "Yes! Truth! No person of color- man or woman would get away with this!", "kweyah": "💯", "boisociety": "For real", "teamjanice": "Aaaaaaaaaabsolutely. 🙄👏🏽", "bomzy_b": "I’m so disgusted", "dmcphatter": "Speak on it", "dedrianaperry": "Thank you!", "littlestreeteditor": "Where is the lie??!!!! It’s disgusting!", "iammichellelyte": "Agreed!", "tamumcpherson\nVerified": "Verified", "andie.always": "So triggered. So fed up.", "carmellw22": "Yup!!!", "blackwomenviews": "Sickening, deplorable, unforgivable, enraging. We must remember this November 6th and every election day (primary and general). Lindsay Graham already made threats today about revenge should he be chair next year so we need to make sure the GOP loses the Senate as well. This unhinged and vitriolic POS is also angling for AG and he would be even more dangerous in that position. #VoteWoke", "ameliareinhardt": "Disgusting whining manchild", "secretagentm": "That’s right - she was poised, measured and graceful. Just think if she displayed an ounce of what he did", "vdlr": "so true, Elaine", "adamselman\nVerified": "Verified", "marizdear": "It was so disgusting😣😠😡", "lovesharmichelle": "Extremely!", "ayme_piedspoudres": "All of this!!!", "antoniohussey": "It’s gross", "ohsnapitsportia": "This country is cannibalistic and morally repugnant people seem to fail upwards- as long as you look the part. Beyond disgusted.", "tamaramcnaughton": "So so true!", "andreaferretti": "Sickening. Absolutely. Felling gutted.", "ksodomick": "Me, too.", "dr.ladyladora": "Agree!", "whatfantasees": "Triggered.", "argystyle": "Sad truth!!!💯", "littlesunshineandcoffee": "This a million times. Women of all ages and all races be angry, be ready to vote for change.", "_ninaninaballerina_": "You are a b s o l u t e l y right!!", "peaceandjo": "👏🏽👏🏽👏🏽", "jae.dee": "Yes if any woman behaved like him they would have called her unstable, emotional, histrionic.", "makeit.mines": "🎯🎯🎯🎯", "msmonim2u": "All of that! It’s utterly disgusting", "the_photodiarist_nyc": "Amen. Could not agree more. It’s disgusting and makes me want to 🤮.", "callmectm": "I see no lies here. 🤷🏾‍♂️", "rickie__graphics": "DM ME IF YOU NEED 🎨🎨 LOGO, 🔥 CARTOON GRAPHICS ,🔥 BANNER🔥FLYER, 🔥 BUSINESS CARD, 🔥 ANIMATED VIDEO, 🔥 , AND ANY DIGITAL RELATED ART FOR YOUR BUSINESS 💯🎨🔥💯🎨🔥💯🎨🔥💯🎨🔥💯🎨🔥", "terri.t_": "Completely unfit to serve on anyone’s anything.", "jenstockdesigns": "Perpetually nauseated and angry.", "karlynpercil": "Yup! Can't watch it. It's to much for me.", "tvboston": "Word. Add entitlement, privilege, bullying, lacking integrity and moral culture compass.", "kslewismedia": "Agreed", "nctaylor_": "Sooo defensive. You can see it from the headline photo.", "jamie_dupuis": "So triggered 😩 #ibelieveher", "petiteandbold": "@elainewelteroth you’ve said it all!", "daviniarjames": "Amen!", "meghanekerr": "F A C T S and it’s not ok", "luakluxx": "VERY TRUE.", "mademoisellereese": "#preach", "jennimaybee": "Yes. Extremely upsetting", "makeupbytree": "I see no lies!", "miel1969": "Must be nice to be allowed to get away with such horrible and disgusting behavior without consequence.", "marquitafladger": "👏👏👏", "nkfido": "Beyond disgusted 🤮", "guarded_optimist": "Where's the lie? This is sickening", "theemarissad": "EXTREMELY", "charglover_": "Beyond Pathetic!!!!", "knochknoch": "Some prefer us quiet and meek, but alas, we will continue to rise up, and speak out. You inspire me daily with the way you walk proudly through the world ✨", "rl.storm": "After watching him, I'm truly curious about whether he was sober or not.", "sabrenakhadija": "Exactly!!", "addyejoyfantastic": "double, triple, and quadruple👈🏾 for us WOC.", "s_cartaaa": "Absolutely! It’s disgusting.", "therealshante": "@lsbelle literally this!", "ajdies": "Yes. Been infuriating", "a.made.mois.elle": "🗣 say it louder for the people in the back @elainewelteroth !!!", "meeks415": "Macro-aggressions galore!! 😡🤬🤯😤😭🤮", "carlyroye": "So triggered", "meme_hayes": "Girl, I had a whole moment yesterday where I had to stop myself from getting too invested. An arrogant and entitled performance to say the least.", "theashleybyrd": "Agreed!!!", "imsojewel": "This!💯", "livinginmommywood": "I watched all day this circus play out. The professor was so put together then here he comes all over the place. I never shouted so much at my screen in my life 😑smh", "sarahdoran": "Serena. Perfect example. So fucking...there is no word.", "ashley_dholley": "Your speaking the TRUTH!! 🙌🏾", "cbee_z": "I can't wait to vote!! 👏🏾👏🏾👏🏾 pure madness", "arianadelawari": "Disgusting double standards.", "karin77olson": "I’m sorry, sister. I’m about to explode. (Seeing I’m not alone helps.)", "ladiroxy": "Legit.", "sarahrutson\nVerified": "Verified", "mairasgalvao": "SO TRUEEE", "accordingtokori": "Hell, a black man!", "msshaunrobinson\nVerified": "Verified", "traceeellisross\nVerified": "Verified", "gratefulbadass": "Right?!?!!", "perfecttye": "You ain’t never lied", "thatboheme": "So true !", "gessflyy": "THIS! Yes", "evierobbie": "I want to burn shit down", "lollidani": "Sickening.", "hollysiegel": "LIVID"}