{"ommoffice": "\"If you want to make the world a better place, then look at yourself and make a change.\" Michael Jackson", "eumelanin_": "This! 🙌🏾", "3reeka": "\"How could the sky be blue for everyone at once?\"", "rustyellex": "\"If you understand the beginning well, the end will not trouble you\"", "bigdrasin": "“I believe in myself, I have strong confidence in myself, I do not feel intimidated by anyone, because I know that when I wake up and look in mirror in the morning, I have already met a person as important as anyone I am going to meet that day”...Ms. Dorothy Wooten, mother of bassist Victor Wooten, from track 10 of his cd, A Show Of Hands.", "runninyogini": "\"One whip, two lanes.\" - Remyma", "looenteas": "If you thought about it then you have what it takes to do it.", "urchicsunshyne": "Yes!!🔥", "techcareercoaching": "Great profile! 😎", "cryseadams": "\"Fear is not real. It is a product of thoughts you create. Do not misunderstand me. Danger is very real. But fear is a choice.\" Will Smith in After Earth", "tiianyc": "If you’re always trying to be normal you will never know how amazing you can be. -Maya Angelou", "lahfree2b": "“Don’t be like the rest of them, darling.” 🦄", "elainewelteroth\nVerified": "Verified", "hey.derin": "I looooooove that quote you posted! And loving all the quotes in the comments! 🤗", "tracelysette\nVerified": "Verified", "melissa_spacebetween": "🌟❤️🖤❤️🙌", "thecakelady4me": "Live your dash (the year your were born until your death) make every moment matter by Linda Ellis", "brooklynfluenza": "Accept apologies but recognize patterns.", "lizzywilmarth": "“Girls compete, women empower”", "thisfrantasticlife": "\"No just means next, baby.\" -My mommy.", "tbgrl_": "Gorgeous!!", "1stseeit": "Nice shot", "sharondairving": "Here are the quotes that stick in my head. They are just quirky and funny...not as big brained as all the stuff I just read....(don’t judge me 🤦🏾‍♀️) 🗣Put the work in till it works out (Miguel song) 🗣 Biggie Smalls is the illest 🗣 I can see through all that Maybelline **🗣if you can find beauty in the world create it (I think that was Maurice white) and this was definitely Maurice white, heard it in an interview played right after he died...🗣every time I am able to accomplish something and create a reality from an imaginary principle in other words bring my imagination into the real world I find that’s something that verifies my faith 🙌🏾", "everybodylovesaggy": "Love it! Reposting it🙌🏾😍", "ericamikal": "“Making a Bold move is the ONLY way to advance toward the grandest vision the universe has for you.” - Oprah 💛", "jackiehuba": "\"Unless they paying your bills, pay them bitches no mind\" —@rupaulofficial", "privatejetdude": "Keep on soaring! 🛫", "pourlair_scents": "💫", "alina_eugenia_makeup": "„ Buy less , choose well , make it last ❣️“ WW", "bethnotflo": "Saving this assemblage of great quotes! My contribution: “Tomorrow is always fresh, with no mistakes in it.” /and/ “It's been my experience that you can nearly always enjoy things if you make up your mind firmly that you will.” Both L. M. Montgomery", "sarahm.cox": "I adore Ben Okri and find him very profound - this is an excerpt from one of my fav books (it’s long!) .... “I love your silence. It is so wise. It listens. It invites warmth. I love your loneliness. It is brave. It makes the universe want to protect you. You have the loneliness that all true heroes have, a loneliness that is a deep sea, within which the fishes of mystery dwell. I love your quest. It is noble. It has greatness in it. Only one who is born under a blessed star would set sail across the billowing waves and the wild squalls, because of a dream. I love your dream. It is magical. Only those who truly love and who are truly strong can sustain their lives as a dream. You dwell in your own enchantment. Life throws stones at you, but your love and your dream change those stones into the flowers of discovery. Even if you lose, or are defeated by things, your triumph will always be exemplary. And if no one knows it, then there are places that do. People like you enrich the dreams of the world, and it is dreams that create history. People like you are unknowing transformers of thing, protected by your own fairy-tale, by love.”", "ajiriaki": "“We must be willing to let go of the life we planned so as to have the life that is waiting for us.” -joseph campbell. This one has helped me for almost 20 years!", "viewsfromageek": "\"Empathy is a cornerstone of design.\" - Ilse Crawford", "talimagal": "Heart you lady ✨💕", "jazzymsjasmine": "“So many times I defined my pride through someone else’s eyes, but then I looked inside and found my own stride” - @missjillscott", "isabelle__cayla": "You are an amazing woman 🌞", "heathernlott": "\"nothing changes, if nothing changes\" my mom always said that to me. congrats on the break, the new project, and the new year!", "sabastianbonaparte": "“But you can’t use my phone” #traceeelliserossisallthatmaybeyoucangetmeadatewhenigetpaid", "colinmorgandgp": "😎", "dominicana3272": "“When I dare to be powerful, to use my strength in the service of my vision, then it becomes less and less important whether I am afraid.” -Audre Lorde", "seangoesnatural": "For all the doors they slammed on us, we're coming back to buy the building 🙌", "alciramoon": "❤️✨❤️✨❤️✨❤️✨❤️✨❤️", "the_real_re_edit": "“Everyone deserves something, but no one deserves EVERYTHING”- Me", "michellevetter99": "I am learning everyday to allow the space between where I am and where I want to be, to inspire me, and not terrify me. @traceeellisross", "thatviewtho": "there can be no healing without forgiveness", "woofadventures1": "All you need is love.", "juliecbulie": "Thank you to Brené Brown for bringing this one to the forefront: “It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again... who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly.”", "quicul": "“Tell me, what is it you plan to do with your one wild and precious life.” Mary Oliver", "tisamhoward": "“What we do does not define who we are. What defines us is how well we rise after falling.” -Lionel from the movie “Maid in Manhattan “", "domkathelittle": "And this one: “You can not win the fight of you're not in the ring.”", "shaniiichen": "In order to change the world, I must transform my thoughts to change myself. 💪🏽👑❤️", "kaliamour": "“We can’t change the world, unless we change ourselves”", "mepretty1752": "🙌🏾", "lucy.mitula": "Love I!", "mattalonzo\nVerified": "Verified", "magda7_27": "Not an end of the yesrish type quote but my favorite by far: it’s not the load that’ll break you it’s how you carry the load. Lena Horne said that I believe on the Cosby show I THINK but she did say it lol", "firstgenjadel": "“You are the grocery list, the pot, the fire...You ARE everything. Make yourself.” - Me", "ah.marni": "For what it’s worth, it’s never too late to be whoever you want to be. There is no time limit, stop whenever you want. You can change or stay the same, there are no rules to this thing. We can make the best or the worst of it. I hope you make the best of it. I hope you see things that startle you. I hope you feel things you never felt before. I hope you meet people with a different point of view. I hope you live a life you’re proud of. And if you find that you are not, I hope you have the strength to start all over again. - f.scott fitzgerald", "theemeraldrock_drj": "“Rejoice! Daughter, Rejoice!” ~Handel’s Messiah: A Soulful Celebration (Rejoice Greatly, O Daughter of Zion https://youtu.be/tcJTBBAyw0k)", "allyoconnell": "My favorite lyric: “I stand on a precipice. I struggle to keep my balance. I open myself, I open myself, one stitch at a time.” -Jason Robert Brown", "loopdeelou": "Put your energy, thoughts and actions into things that positively feed your soul. The rest will take care of itself. Ava DuVernay", "sunraeshines": "😍", "baelay": "\"it's not about pain, it's about the commitment.\" - @badgalriri", "hernzjr": "@elainewelteroth It gets me every time! And by get me I mean makes me tear up. “Don't ever let someone tell you, you can't do something. Not even me. You got a dream, you got to protect it. People can’t do something themselves, they want to tell you you can’t do it. You want something, go get it. Period.” -Pursuit of Happyness", "brionamonet": "“Our deepest fear is not that we are in adequate, our deepest fear is that we are powerful beyond measure. It is our light, not our darkness that most frightens is”-Marianne Williamson", "lady.carr": "“I want to have an epic life. I want to tell my life with big adjectives. I want to forget all the grays in between, and remember the highlights and the dark moments.” -Isabel Allende | Fell across this quote the other day and I haven’t stopped thinking about it 📖", "madeau": "two exist is to change, to change is to mature, to mature is to go on creating oneself endlessly - henri bergson", "joellajaine": "Follow 🦄 @joellajaine 👾 @joellajaine 🦄 @joellajaine 👾", "brgani": "@follainambassador", "mrsmommymd": "The hardest battle in life is to be nobody but yourself in a world which is doing its best, night and day, to make you everybody else. - EE Cummings", "jgal25": "“The time, the season, the weather The song, the music, the rhythm It seems, no matter what happens I'm here” #kamasi", "ajoy213": "Don’t let the smooth taste fool you", "alyse_nelson": "“Use your power to empower” —- what happens when women lead", "alexfisherr_": "“This is not you. This is something moving through you. It can leave out of the same door it came in”- @cleowade also, “destruction leads to a very rough road but it also breeds creation” red hot chili peppers 😂", "curvygirl_chronicles": "@elainewelteroth \"Everything you want is on the other side of fear\"", "browngirlmktg": "You teach people how to treat you. | No is a real answer. | To thine own self be true. | No fear, only faith.", "geneusbranding": "Scenic👆🏽👌🏽", "nanaekuawriter": "\"There’s something innately bolstering about a person who sees his opportunities as endless, who doesn’t waste time or energy questioning whether they will ever dry up.\" #Becoming / #MichelleObama", "willpowerpacker\nVerified": "Verified", "twodadstwokids": "Ego is just an overdressed insecurity.....Quincy Jones", "king_bobbie": "“Love makes your soul crawl out of its hiding place” ~ Zora Neale Hurston", "msjnyc": "I ain’t fallin for no banana in my tailpipe!", "chelseaonly1": "Success is nothing without someone you love to share it with. ~Mahogany", "mpc_marketing": "Love this🙌❤️", "summmma": "“Caring for myself is not self-indulgence. It is self-preservation, and that is an act of political warfare.” Audre Lorde", "planetblaster": "The only thing constant is change.", "diba_kaya": "Feed from your saucer, not your cup", "missmetito": "There Is in This World No Such Force as the Force of a Man Determined To Rise. The Human Soul Cannot Be Permanently Chained W.E.B DuBois", "momogoldberg": "“Live. Live. Live. Life’s a banquet and most poor suckers are starving to death!” - Auntie Mame", "leslie_justagirl": "On ne vit pas juste d'amour et d'eau fraîche. It is a popular saying a Cameroon (where I'm from). It means: \"we not only live off love and fresh water.\" Though they are important, we still live in a capitalist society, and we need more to survive.", "celeste.eeeee": "Your so beautiful 😍", "jumu_nde": "Marvelous", "katkorpi": "One of my absolute favorites is a lyric from BODY GOLD by oh wonder: “we will walk with our feet on the ground and we will talk with our head in the clouds”", "kbgallo": "“Joy doesn’t come and go. What comes and goes is my awareness of it” - Robert Holden", "renaesimo": "That quote is my life theme at the moment. 🙌🏽🙏🏽", "ranger_up": "For my good friend @michaelkorte “IF YOU WANT TO BE SOMEBODY, IF YOU WANT TO GO SOMEWHERE, YOU BETTER WAKE UP AND PAY ATTENTION.”", "buffyhernandez": "Don’t ever forget to shine, remember the sun ☀️ give a f%€k if it blinds you!", "malcommohammed": "❤️", "pepperwilliamsrussell": "Dear Lord ... If we today in our frail humanity fail to speak to thee, please do not fail to speak to us. Amen.", "mastro175": "leave it better than you found it", "ashiasims": "\"The elevator to success is broken. Take the stairs.\" -Jennifer Lewis This hits me in my head and heart every time I hear it.", "dharpooja": "Continuous improvement is better than delayed perfection ❤️", "cyncerelyourstruly": "@elainewelteroth “Dispel the negative as if a myth, a lie.” From @maxwelll Song: Drowndeep", "jwatleymaxell": "“Never underestimate the power of your own healing to shift your atmosphere. You don’t have to heal everyone, just concentrate on you!” Jennifer Watley Maxell (Me)", "mspmacklin": "Evolve or evaporate...", "alltydup14": "@elainewelteroth You’re guaranteed adversity in life, it’s how you respond to it.", "shopnourishandsoul": "Love this quote", "drstricklandobgyn": "#lovelovelove", "eclectickeri": "\"All the very best of us  String ourselves up for love\" - The National", "zelmarose": "“We love because it is the only true adventure.” Nikki Giovanni ❤️", "iamsocialadam": "🖤🖤🖤", "tejasreina": "“Work hard and be nice!”", "royallysocial": "#myquote ~ “If you’re not winning it’s because you’re playing by their rules.” Keep winning @elainewelteroth ❣️❣️✌🏾❣️❣️2019 is going to be awesome! 😎", "sandra_owusuantwi": "\"Don't let an aching heart prevent you from learning to live, love, and grow again\" -thangbaley ! Happy 10 years !", "montlou89": "\"Nothing but death can keep me from it\" from The Colour Purple and it's now something my big sis and I say to each other regularly 💜", "_yasminzar": "From a Halloween episode of the office ... “Fear plays an interesting role in our lives. How dare we let it motivate us, how dare we let it into our decision making, into our livelihoods, into our relationships. It’s funny isn’t it, how we take a day a year to dress up in costume and celebrate fear”-Robert California", "annakachikyan": "Can’t wait to see this project of yours!!", "fannybourdettedonon\nVerified": "Verified", "soulsista36": "Embrace the rain... It cleanses the Soul!🙌🏾", "itskellyhill": "Love this❤️🌟💫 Praying you into an amazing 2019🙏🏽🙌🏽", "thaspecialist": "When You Believe Somehow You Will, You Will When You Believe! Season's Greetings!", "adinadee1": "“I’ll be brand new tomorrow.....a little bit tired, but brand new.” -Björk “Pluto”", "dreamnationlove": "@elainewelteroth “Being happy and following your dreams is the most defiant act of rebellion one can do in this society.” - Yulia", "devinrae_": "\"A steady drip wears a hole in a rock.\" Colonel Taylor (A Different World)", "kaciemicole": "But the mood for 2019 is to change from saying, “I hope they like you,” to “I hope you like them” whenever you have a job opp or something. Don’t take it unless you like who they are and what they stand for, stop worrying about whether they’ll like you", "drkarinn": "“Sun burst through the clouds: my photo ID” Mos Def", "tanvi_39": "“No matter what happens in life be good to people. Being good to people is a wonderful legacy to leave behind.” - Taylor Swift", "aceisjoy": "\"you mustn't be afraid to dream a little bigger, darling.\" - Inception", "lo.mcgrath": "Ugh yes. This is Sag through and through and speaks to my soul! Keep steppin baby!", "kevinthomas": "Beautiful 🙏", "itsvonniemack": "\"Do you have the faith to prepare for what SHALL be, while you're worried about what is....?\" 🙌🏾 -TD Jakes", "the.matriarchitect": "“If you don't sacrifice for what you want, what you want becomes the sacrifice.” Saw this one on @museummammy post.", "itsshamieka": "You have not because you ask not!", "leyahcynamon": "Janelle Monae. I come in peace but I mean business", "jmb629": "“Life shrinks or expands in proportion to one’s courage.” Anais Nin", "realdonshea\nVerified": "Verified", "boomguru": "Good....Better...Best....Never ...Let it rest ....Until your ....Good ....is ....Better....than ...BEST!", "juliasimonepaul": "“Sometimes you will never know the value of a moment until it becomes a memory.” – Dr. Seuss", "instahoov": "“Boos don’t block dunks.” Kobe Bryant", "danieljshapiro": "Let someone else say no to you before you say no to yourself.", "sonyateclai": "❤️", "larsenthompson\nVerified": "Verified", "rosaliachann": "🙌🏻", "ahniyaj": "“I am mine before I am anyone else’s”", "whatisforyouwillnotpassyou": "It’s Life...just breathe", "demonaco75": "“Getting over a painful experience is much like crossing monkey bars. You have to let go at some point in order to move forward.” - C.S Lewis", "carmellw22": "💯💯", "nicoleabernard": "“Kiss ass to kick it in the end” (not sure of the original source- just heard it from my dad most of my life:)).", "habitatblanc": "“I learned to GIVE not because I have much but because I know exactly how it feels to have NOTHING”", "avrilxapril": "Whatever you are looking for is looking for you too- @saulwilliams", "babypetunias": "Opinions underpin attitudes - Anne Truitt, Daybook", "rockthecass_bah": "First say to yourself what you would be, and then do what you have to do. - Epictetus", "jackieinseattle": "If you want to fast, go alone. If you want to go far, go together. - The Rev. Dr. Martin Luther King, Jr.", "seriouscheese": "“My mission in life is not merely to survive but to thrive; and to do so with some passion, some compassion, some humor and some style.” - Maya Angelou", "momodoobie": "I can do anything -Beyoncé, everything is love", "tessconners": "“Start by doing what's necessary; then do what's possible; and suddenly you are doing the impossible.” St Francis of Assisi", "elenagalluzzo": "We are the music makers and we are the dreamers of dreams.", "kimfleming2": "I used to cry because I had no shoes, until I saw the man with no feet...🙌🙌🙏", "katielively06": "I was not born to drown -The Lumineers, Sleep on the Floor", "april_pr": "YASSSSS. that quote!", "abbie_kaddabbie": "“We are all so deeply interconnected; we have no option but to love all. Be kind and do good for anyone and that will be reflected. The ripples of the kind heart are the highest blessings of the Universe.” - Amit Ray", "theesperanzamaria": "I believe in you even when you too stupid to believe in ya damn self", "thenikkeyb": "@lizardchips these comments 🙌🏾🙌🏾🙌🏾 @jorae_mi", "80dollarsandasuitcase": "“Nobody ever forgets the truth. No matter how long they lived without it” - Revolutionary Road", "jfotang": "Also another gem I heard at Teen Vogue Fashion University some time ago that I never forgot is “be carful of the feet you step on today because it may be connected to the ass you’ll have to kiss tomorrow.”", "tori.fab25": "A winner is a dreamer who never gives up. ❤️ - Nelson Mandela", "mamesays": "Feel the fear and do it anyway.", "cocoabutterdiaries": "“Nothing great was ever achieved without enthusiasm” - Ralph Waldo Emerson", "3rika_": "Focus more on your craft, than the Hype surrounding it. - Me 😊", "botanicalchef": "@elainewelteroth And the Day came when the risk to remain tight in a bud was more painful than the risk it took to blossom.” -Anais Nin", "infamylives": "“Strong verbs, short sentences.” -Dr. Bernadine Healy", "sunheebeauty\nVerified": "Verified", "julialoulynn": "Strangle the singers who will not sing you loud and strong - Walt Whitman", "iamevlving": "Someone will always say your dollar is 75 cents around the corner. Know your worth, and stand still in it.", "dlnwun": "Never stop, never settle - Hennessy", "cogrioche": "Keep moving forward! -from Meet the Robinsons", "mmooremc": "Anything by @nayyirah.waheed but I especially love - \"once in a while, take off your life, and rest \"", "ashleemerkley": "“Find out who you are and do it on purpose” - @dollyparton", "iamjessicastephens": "“Motivated by the fear of being average.”", "lisajohnson146": "Almost right is always wrong.", "ashleymdasilva": "Excuse me while I kiss the sky ❤️", "chellygeorge": "Micro speed, macro patience.", "vall_rose": "The universe is never trying you, only giving you the opportunity to be all that you say you are.", "dereksroche": "Kindness to others doesn’t come with expectations", "chenoamaxwell\nVerified": "Verified", "nakeiabydesign": "Oh how I love this! Mood all 2019. Can we share this one please?!", "karlaproduces": "The wound is the place where the light enters you - Rumi", "lakeitcha_thomas": "“Worry is a waste of time. It’s like paying on a debt you haven’t even borrowed yet.” Rev. Michael Beckwith", "s_class_ash": "Commit to plan A. There is no plan B for passion. Via @ceoofhappyness", "dattoueychick": "'Cause a rose is still a rose Baby, girl, you're still a flower He can't lead you and then take you Make you and then break you Darlin', you hold the power ~ Aretha Franklin", "nicoooleyay": "“Someone asked me why I cry so much and I told them it’s for the same reason I laugh so much - I’m paying attention.” -Glennon Doyle", "travelmonger": "“Be fearless in the pursuit of what sets your soul on fire”", "sydneyrwagner": "“And what would I do? What was right and necessary, even if it frightened me, even if I knew others might not understand. I had to bet my soul on it.” -from one of my 2018 reads, The Revolution of Marina M.", "nicoleahgold": "“You can’t beat them in their race, you can only win your own.” - Oprah; “Real genius is radical humility. When you humble yourself before what you don’t know, you open yourself to possibility.” Stephen Hawking; “As long as you are breathing, there is more right with you than wrong with you. No matter what is wrong.” - Jon Kabat-Zinn ♥️", "jordantaverner": "@liz537", "alyssasmaldino": "be softer with you. you are a breathing thing. a memory to someone. a home to a life. @nayyirah.waheed", "pelisa.norman": "We are the ones we’ve been waiting for’", "bybetsy": "How you live your day is how you live your life. 🙌", "nataliaobertinoguera\nVerified": "Verified", "hellodrjoy\nVerified": "Verified", "vpipvp": "Take the narrow path to your dreams...", "lisetteirene": "“Others love me for me and I honor them by loving myself”", "be.brava": "Love! ✨💙", "helloallieboyd": "“When you love you, there’s nothing that can hurt you” - T. Carrier", "ash_nikii": "And I heard today, “nothin’s ever promised tomorrow, today”.", "yazminmonetwatkins": "“Why a trained dolphin could deliver pizzas better than you” “Well yeah, but then the pizzas would get all wet” -Dude Where’s My Car", "anyhoott": "You only have one life to live, so live it in peace, live it in truth, live it in love. - Lou Rawls 🙌🏾", "arrizu": "“Let the beauty of what you love be what you do.” - Rumi", "mississippimoonshinegang": "🦄", "ebonyk.king": "I LOVE that quote you shared!", "janiemalissa": "“I'm sick and tired of being sick and tired.” Fannie Lou Hamer. This always motivates me to works towards change.", "southlowe": "I’ve been watching #creed on repeat and this spoke to me about being in the moment: “One Step At a time. One Punch at a Time. One Round at a Time”. And this by THE @cleowade has been one of my mantra’s for the year: “Remember not to care about the things you don’t even care about”.", "konartstudio": "🍾🍾🍾", "soniagartside": "“Let me tell you something you already know. The world ain't all sunshine and rainbows. It's a very mean and nasty place, and I don't care how tough you are, it will beat you to your knees and keep you there permanently if you let it. You, me, or nobody is gonna hit as hard as life. But it ain't about how hard you hit. It's about how hard you can get hit and keep moving forward; how much you can take and keep moving forward. That's how winning is done! Now, if you know what you're worth, then go out and get what you're worth. But you gotta be willing to take the hits, and not pointing fingers saying you ain't where you wanna be because of him, or her, or anybody. Cowards do that and that ain't you. You're better than that! I'm always gonna love you, no matter what. No matter what happens. You're my son and you're my blood. You're the best thing in my life. But until you start believing in yourself, you ain't gonna have a life.” ― Rocky Balboa", "arandone": "“Don’t ever lose your dream, or change it for anybody. Give yourself as many opportunities as you need to achieve it.” Angelica Fuentes via @girlboss", "iamlisaprice\nVerified": "Verified", "lexyhwhite": "“But it's not that I think I'm so great. I just don't hate myself. I do idiotic things all the time and I say crazy stuff I regret, but I don't let everything traumatize me. And the scary thing I have noticed is that some people really feel uncomfortable around women who don't hate themselves. So that's why you need to be a little bit brave.” - @mindykaling my life motto", "agnesandlola": "My fave is a bit of a long one from Jack Kerouac’s On The Road - [...]the only people for me are the mad ones, the ones who are mad to live, mad to talk, mad to be saved, desirous of everything at the same time, the ones who never yawn or say a commonplace thing, but burn, burn, burn like fabulous yellow roman candles exploding like spiders across the stars and in the middle you see the blue centerlight pop and everybody goes “Awww!", "keepinitp": "My two all time favorite quotes that have inspired me thus far are “Nothing will work, unless you do.” -Maya Angelou // “I will not be another flower, picked for my beauty and left to die. I will be wild, difficult to find, and impossible to forget.” -Erin Van Buren", "blondbornleo": "\"Never a roadblock, only speed bumps\" - Me", "brandialise_": "As she looked in the mirror, she realized that everything she needed was already within her ✨", "sloanecamille": "\"Everything will be okay in the end. If it's not okay, it's not the end\"", "jordienoel": "“She believed she could, so she did”", "kerawblacksheep": "Your crown has already been bought and paid for just put it on... James Baldwin", "jlmorgz": "“Cheers to a new year and another chance for us to get it right.” ― Oprah", "bikemaker": "Vision without execution is just hallucination. -Thomas Edison", "focushomeservices": "It’s not a real apology unless you change the behavior.", "awkblackgirl": "“I will love myself despite the ease with which I lean towards the opposite.” -Shane koyczan", "reganraygun": "\"& I can do anything but move backwards/hardest thing is to keep from being distracted\" @anderson._paak", "dvf\nVerified": "Verified", "asian_southern_belle": "God is within her she will not fail pslam 46:5", "carlostherollerblader": "“mayonnaise colored benz, i push miracle whips”", "empressquamine": "There is nothing to fear but fear itself 💕", "shaimw": "“My past is littered with the bones of men who were foolish enough to think I was someone they could sleep on” - Michelle Roberts, ED of the NBPA • • • What I keep in mind every day I go to work", "niag": "Luke 12:25 “Who of you by worrying can add a single hour to his life?”", "claudiamason1": "Great end quote 👌", "sanpedrochar": "So many great quotes but here’s one that I love: “The storm can be just as beautiful as the rainbow. Honor them both.”", "jeannineharvey1": "“There is no other.” John A. Powell", "sexandthestudio": "“those crazy enough to think they can change the world...usually do” recent tweet from @theinternet", "charlenejsadler": "In true love, you can no longer say “that’s YOUR problem”. Thich Nhat Hanh", "columnoftheclan": "❤️ “You get in life, what you have the courage to ask for” Oprah.", "iamvictoriamargaux": "Loving yourself is the medicine ❤️", "collective_evolution": "“Just like the Moon, We go through phases.” - @dulceruby lots of gems from there!✨💎", "dellavallejoan": "“All my life I had to fight. I had to fight my daddy. I had to fight my uncles. I had to fight my brothers. A girl child ain't safe in a family of men, but I ain't never thought I'd have to fight in my own house! I loves Harpo, God knows I do. But I'll kill him dead 'fo I let him beat me” Sofia @oprah The Colour Purple “I'm poor, Black, I may even be ugly, but dear God, I’m here! I’m here!\" Celie @whoopigoldberg The colour Purple “Everything you've done to me, already been done to you.” Celie The colour Purple", "dimagoncalves": "“Clouds come floating into my life, no longer to carry rain or usher storm, but to add color to my sunset sky” - Rabindrath Tagore", "themichellejane": "I never lose. I either win or I learn. Saw it on pinterest lol", "geminelle": "My most recent mantra | “My Success is Inevitable” See #mantraloopmonday", "ninikomo": "“You cannot lynch me and keep me in ghettos without becoming something monstrous yourselves, furthermore, you give me a terrifying advantage, you never had to look at me, I had to look at you. I know more about you than you know about me. Not everything that is faced can be changed, but nothing can be changed until it’s faced”", "hairtamer": "❤️❤️❤️❤️", "happy_kappey": "@elainewelteroth Kindness is the language which the deaf can hear and the blind can see. -Mark Twain 😊", "jamie.malter": "“You are the sky. Everything else is just the weather.”", "youilite": "“Focus on your focus” @gerwaynah", "destinymay__": "So proud of you! 🙌🏾❤️", "tanyareader7": "What’s for you won’t go past you. Or in the Scots way: Whit's for ye won't go by ye.", "kevin_d_wright": "“Leadership is Personal.” kdw", "mariegeneve": "Some of God's greatest gifts are unanswered prayers.", "kosharris": "🙌🏾 so inspiring", "heydeepa": "“and it came to me then, that every plan, is a tiny prayer to Father Time”—Death Cab for Cutie. In a related note, Ben Gibbard is a great lyricist!", "ms_brittany_p": "“And this too shall pass” ~ GOD", "aryeola": "😍😍😍😍😍", "juneambrose\nVerified": "Verified", "saywood.studio": "❤️❤️❤️🧡", "julianatalie63": "Before you diagnose yourself with depression or low self esteem, first make sure you are not in fact, just surrounded by assholes🙃-Sigmund Freud", "_monadisa": "“You can’t kill me. I’m a bad bitch.” - A child too grown for her own good.", "sky.palace": "\"And being colored?... Well that's a whole other metaphysical dilemma I have yet to wrap my head around\" (or something like that 😝) - from 'Four Colored Girls'", "nowhatsyourinstagram": "\"I don't go around trying to be what I'm not. I don't waste my time trying to get what you got.\"- Erykah Badu, Apple Tree", "twoodsphoto": "“And deep in my heart, the answer it was in me. I made up my mind to define my own destiny.” -Lauryn Hill ✨", "sallyminn": "Once we believe in ourselves, we can risk curiosity, wonder, spontaneous delight, or any experience that reveals the human spirit.- E.E. Cummings ✨ You are allowed to be both masterpiece and a work in progress simultaneously.-Sophia Bush✨ If I didn't define myself for myself, I would be crunched into other people's fantasies for me and eaten alive.-Audre Lorde✨", "eblicher": "Never give up on a dream because of the time it will take to achieve it. The time will pass anyway.", "tamerabigsby": "“I took the one less traveled by, And that has made all the difference.”", "samantha.caff": "👏👏👏👏", "alexandraaa_noelle": "“Be weary of the ways of the world”", "spydermelon": "Breakfast at Tiffany's?", "rahelyea": "Who the hell said you no longer had it in you? -Bukowski", "girlswithgoalsmovement": "💖", "dominic_adams\nVerified": "Verified", "nkittsesq": "“Our deepest fear is not that we are inadequate. Our deepest fear is that we are powerful beyond measure. It is our light, not our darkness that most frightens us. We ask ourselves, 'Who am I to be brilliant, gorgeous, talented, fabulous?' Actually, who are you not to be? You are a child of God.” - Marianne Williamson", "ashleymcoleman_": "“Courage starts with showing up and letting ourselves be seen.” - Brene Brown", "marialeonidoy": "Find your joy and let it run your life @cleowade - my 2018 motto 👯‍♀️", "queen_briyaa": "\"If they don't give you a seat at the table, bring a folding chair.\" - Shirley Chisholm", "herbadmother": "“I can give her no greater power than she has already.” — from The Snow Queen, Hans Christian Anderson. We all have all the power that we need — we don’t need anyone to ‘empower’ us, we just need space and opportunity and freedom to use it.", "maryscottvalentine": "“I stopped waiting for the light at the end of the tunnel and lit that bitch up myself.” 🔥🔥🔥", "emma_am18": "Where there's a will there's a way", "fantasticfernanda": "I’d rather regret something I did than something I didn’t do.", "johnathan.hayden": "\"Prayer without action is no prayer at all. You have to work as if everything depends on you and leave the rest to God. \" - Mother Teresa", "lani_ridj": "\"You can, you should, and if you're brave enough to start, you will.\" (Stephen King)", "keyanemesis": "Take me", "peggasus90": "\"I'mma keep running cause a winner don't quit on themselves\" Beyonce of course", "gynella.ngounou": "“You are joy, looking for a way to express.” - Abraham Hicks ❤️", "pc_williams": "You can kill a revolutionary, but you can’t kill a revolution - Fred Hampton", "missdotholla": "Moisturize my situation - Diddy", "damariscdunn": "You lack nothing, use what I gave you. -God", "cellaringscott": "“Where there’s bread for two, there’s bread for three.” - an old Bulgarian proverb", "kendravarnado": "@elainewelteroth “Whether you think you can or you can’t, either way you’re right” 🥂🍾 ...Cheers to you and your accomplishments! I moved to NYC 3 years ago and every year has gotten better and better! #Levelupeveryyear", "alainasdivadesigns": "And as we let our own light shine, we unconsciously give other people permission to do the same. As we are liberated from our own fear, Our presence automatically liberates others. -Marianne Williamson", "mpthelwell": "“If you can't change your fate, change your attitude.” Amy Tan", "karalyn_thom": "“Love. Live life. Proceed. Progress.” Lil Wayne", "jildever": "We send you gratitude and thanks for always keeping it fresh.  Enjoy the journey-it’s all about the journey.", "msmalcom": "“The unwillingness to try is worse than any failure” -Nikki Giovanni", "bykathyg": "@dvf coat 😍😍", "thestylefraud": "🙌🏾🙌🏾", "coachgessie\nVerified": "Verified", "kjkidd": "Replace Confidence with Courage. -Unknown", "taylornuri": "“everyday’s another chance to get it right this time” — lauryn hill 💕", "yolandaenoch": "I heard @ava say this on a NPR Code Switch interview in early 2017, and it's been my life philosophy since (8:24 mark): \"Your best way to teach anyone - if that’s what you want to do - is to live, live well, and live fully.\" https://n.pr/2LABxio", "esq_fashionista": "“I realized I was more convincing to myself and to the people who were listening when I actually said what I thought, versus what I thought people wanted to hear me say.” - Ursula Burns", "arleeonair": "There is no strength without challenge, adversity, resistance..and often pain. @oprah", "getmunny": "Failure is a feeling long before it becomes an actual result. It’s vulnerability that breeds with self- doubt and then is escalated, often deliberately, by fear. - Michelle Obama", "_rachelsimone": "\"I never lose. I either win or I learn.\" Nelson Mandela", "thewriterjess\nVerified": "Verified", "jontricemurray": "My absolute fav quote: “When I dare to be powerful, to use my strength in the service of my vision, then it becomes less and less important whether I am afraid.” -Audre Lorde.", "maricehart": "\"Dive in, with your eyes closed For the life you were born to claim The water will be paralyzed By the courage you contain\". From the song Watermark by Sleeping at Last", "livingmyjocalledlife": "It's a question I learned to ask myself: How would the most confident version of yourself handle it? (Got it from @thechampagnediet)", "akthewayy": "“I’m good luv, enjoy”", "lynaecook": "YES 🙏 @podsavethepeople 🙏", "nataliemanuellee\nVerified": "Verified", "todays_juliet": "Why fit in when you were born to stand out? - Dr Seuss", "isolde_brielmaier": "🌟🌟💕💕", "briangrazer\nVerified": "Verified", "kelci.michelle": "Most of the shadows of this life are caused by standing in one’s own sunshine. - Ralph Waldo Emerson", "kimfinite_possibilities": "“Ancora Imparo” (I am still learning) - allegedly said by Michaelangelo when he was 87.", "fabincblog": "“Live in the moment not for the moment”", "salem_afangideh": "Some of my favorite words of 2018:  Wangari Maathai, one of the Mothers of the African environmental movement said this: “A tree has roots in the soil yet reaches to the sky. It tells us that in order to aspire we need to be grounded and that no matter how high we go it is from our roots that we draw sustenance. It is a reminder to all of us who have had success that we cannot forget where we came from.” ❤️ @beingupile said: “here you are, black & woman & in love with yourself. You are terrifying. They are terrified.” @theijeoma said to me: “continue to be as powerful as you feel.” And “strength does not always roar. Valor does not always shine.” A quote from Mama Agba in Children of Blood & Bone by @tadeyemibooks ❤️", "msallisonl": "Change is inevitable. Growth is optional.", "bettemen": "A Coffee and love taste best when hot.", "olamide_oladapo4": "\"Tomorrow is fresh with no mistakes.\" - Anne Shirley (Anne of Green Gables by Lucy Maud Montgomery)", "aniraxo": "“you been seeing me lately? i’m a miracle, baby. i refuse to lose.” - maino, all the above!", "illygull": "You are the perfect verse, over a tight beat - Taye diggs in Brown sugar and the inspiration for the tattoo on my arms ❤️", "loria91": "‘Happiness consists in realizing it’s all a great strange dream’", "kdiddie44": "Travel light, live light, spread the light, be the light.", "rayniece_holmes": "Amen Sister! That’s my next journey!🤜🏽🤛🏽✊🏽", "christaylor_nyc": "❤️❤️❤️", "the_aya_brand": "I’m outstandin’ so I stand out - skywalker Miguel ft Travis Scott @elainewelteroth", "sadiaseymour": "“Every passing minute is another chance to turn it all around.” -Vanilla Sky (movie)", "louramsay": "“Move towards building your own empire” - my own words, two years ago 🙌🏼✨", "she1by": "\"Our backs tell stories no books have the spine to carry.\"", "reelistic1": "“This is the season she will fearlessly pursue those light-woven things she was called to do. (Morgan Harper Nichols? ) “I always try to be the love that I never received.” (My friend/the Authoress @alabambii lol) \"...Everything in the atmosphere dances to the voice of the Lord\" (the best book I’ve ever read 🙌🏾)", "saralazor": "\"Worrying means you suffer twice\" - Newt Scamander in Fantastic Beasts and Where to Find Them 🧙‍♂️", "siobhanie56": "\"I've been absolutely terrified every moment of my life, but I've never let it keep me from doing a single thing I've wanted to do.\" - Georgia O'Keefe", "cindersandrain": "Real eyes realize real lies - ancient proverb... “You can tell a lot about a b—-h by the way she cooks rice” - @erykahbadu ... Also, “lo que se ve no se pregunta” - juan gabriel", "angie_mck.246": "“The truth is for those who believe it”", "dayspringc": "“Be humble for you are made of earth; be noble for you are made of stars”", "_rhiggins": "“Beautiful girl, you can do hard things.”", "soultrain__": "“You cannot control what happens to you but you control whether to be reduced by it” [something like that] by mama Maya Angelou", "skcampbell0424": "“And the day came when the risk to remain tight in a bud was more painful than the risk it took to blossom.” Anaïs Nin", "_jday13": "“i’m hard to catch, that’s the butterfly effect”🦋 travis scott", "divatude_5": "“Use what you got to get what you want and stop messing around with this chump change” Players Club", "shavelitamarie": "“The flowers grow after the rain; and after the pain and tears so will you. I promise.” @rmdrk", "keeksbehindit": "I found the quote, “Don’t let small minds convince you that your dreams are too big.” In middle school. It stuck with me for years. I ended up sneaking & getting it tattooed in like 10th or 11th grade lol I live by this quote till this day ☺️", "nuurvana": "“Life is what happens to you when you’re busy making other plans.” John Lennon 💜 “Ubuntu: I am because you are” African proverb 💜 “be noble for you’re made of the Stars, be humble for you’re made of the earth.” Serbian proverb 💜 “what you seek is seeking you.” Rumi 💜 “even after all this time the sun never says to the earth ‘you owe me’ look what happens with a love like that, it lights up the whole sky.” Hafiz", "rebekahgorbea": "“The only tyrant I will follow is the still small voice within.”", "itsaaries": "“For you I will, tear down the walls that took me years to build.”", "anyangayai": "\"no one is you and that is your power\"", "blerdgirlchronicles": "Something my granny used to say that helps to keep me motivated: \"Nothing beats a failure but a try.\"", "shirtkingacademy": "Thought I saw you at Vegan spot", "macysfields": "“wisest is she who knows she does not know”", "karlucha_": "“keep your frequency high and your belief in miracles strong” Jen sincero", "mspackyetti\nVerified": "Verified", "cocktailsandconfessions": "That quote... EVERYTHING!!!", "sheinthemaking": "“God is better than the best thing that the world has to offer.” - a pastor on Chance’s How Great", "ravenjay__": "When I dare to be powerful, to use my strength in the service of my vision, then it becomes less and less important whether I am afraid. - Audre Lorde", "hayburns": "🖤🖤🖤", "todayimbobbi": "\"She was never quite ready. But she was brave. And the universe listens to brave.\" - Rebecca Ray ♥️♥️♥️", "taylorroyle": "“The slower you put things together, the slower they fall apart.”", "kris_thedaughter": "@elainewelteroth Take care of your business before your business takes care of you - my dad.", "bsrthefashionista": "“Instead of asking yourself - Why is this happening to me ? try asking -What is this teaching me? or How is this transforming me? -The lessons you don’t learn repeat themselves.”", "gwendolynstella": "Confidence is not, ‘will they like me.’ Confidence is, ‘I’ll be fine if they don’t.’", "bru.frimp": "Where there’s a will, there’s a way ❤️", "prettyjennifah": "HI IM A GRAPHIC DESIGNER IF YOU NEED LOGO FOR YOUR BUSINESS💯💯CARTOON PORTRAIT💯💯ANIMATED MUSIC VIDEO💯💯MUSIC COVER ARTS FLYERS BANNERS MIXTAPE COVERS..DM💌ASAP.", "millscas": "👏🏼👏🏼👏🏼💕💕💕💕 “You don’t know my mind, you don’t know my kind, dark necessities are part of my design” 🌶 🎶", "sonofasouthernchef\nVerified": "Verified", "natalieaer": "Faith is when you understand that though things do not change overnight does not mean they do not change at all.", "karatemejuru": "@elainewelteroth 🌱 the day you plant the seed is not the day you eat the fruit 🌱", "being.historic": "“Let us not confuse activity — for achievement.”", "shaquandawillfeedyou": "“How in the hell you gonna love somebody, if you aint gonna love yourself” rupaul", "shellytweedy": "I heard this a couple days and it hasn’t escaped my brain yet.... “I come as 1 but I stand with 10,000” -Maya Angelou. It might not pertain to what you’re working on, but it hit home for me! 🤗💛", "reese.bland": "\"I deal with the real, so if it's artificial let it be.\" - @blackthought", "tljackoracle": "This Confucius chestnut greatly informs my path for 2019: “Worry not that no one knows of you; seek to be worth knowing.”", "itsnandibby": "Closed mouths don’t get fed", "frank_j_miles": "Act white and conquer 🤴🏿👌🏿👌🏿👌🏿👌🏿🦏", "elizabethblountmccormick": "“Have you ever stopped to think you DO deserve it”", "the01lady": "\"Honor your commitments\" -Me (Erika S.) It is the foundation of my personal constitution.", "hithisistess": "“Remember when you wanted what you currently have” — @verapapisova via idk who!", "masendaforever": "“I am a big boss bitch, I do not come in your size.” - @iamcardib 😩😭😂", "lilidiazzzzz": "“Be afraid, but do it anyway”", "goginagina": "Love this! One of my favorite quotes is the following: “Trust only movement. Life happens at the level of events, not of words. Trust movement.” — Alfred Adler", "goodgirlpr": "❣️", "hil_street": "Be savage not average.", "three.rtw": "i have always been the woman of my dreams. - from salt by nayyriah waheed", "_rahje": "“Behind every great black woman... is a man who knows what time it is” - YOU 😂👑", "sierram.j": "“Lifting as we climb.”", "re_marz": "If you’re not failing, you’re not moving forward. ❤️", "cartoon_illustration": "HI IM A GRAPHIC DESIGNER IF YOU NEED LOGO FOR YOUR BUSINESS💯💯CARTOON PORTRAIT💯💯ANIMATED MUSIC VIDEO💯💯MUSIC COVER ARTS FLYERS BANNERS MIXTAPE COVERS..DM💌ASAP.", "bakerinaberet": "“Out beyond ideas of wrongdoing and right doing there is a field. I'll meet you there.” - Rumi❤️", "nanasalas": "“To be broken is is no reason to see all things as broken” -Mark Nepo", "zoeindigo": "Forget the mistake. Remember the lesson.", "ddubbs5": "“I’m trying to right my wrongs but it’s funny these wrongs helped me write this song” - Kanye", "asiyaraz": "“She remembered who she was and the game changed.” By @lalahdelia", "tbadkiss": "“When a wave comes go deep”", "dronilehiraldo": "Shonda Rhimes recently tweeted “I do not follow trails of candy. I am the candy.” 🔥🔥🔥 And I just about died!", "shirleygomez": "“Write it down on real paper with a real pencil. And watch shit get real.” - Erikah Badu", "salonpk": "Great job @elainewelteroth", "elizabeth.mugo": "“Everything changed the day I figured out there was exactly enough time for the important things in my life” - @storypeople"}