{"dulaabudhabi": "Fuck out here ....and not because she a woman either check this lady politics before tha bullshit ensure", "kingjagers\nVerified": "Verified", "joinpalm": "Hi Elaine, we'd love to invite you to join our invite-only influencer community! Really love your account!! 💕You can join at the link in bio, or can we send you more info. 😊", "blessingswinn_official": "She is from my hometown in Berkeley. Served as the DA of SF. One of my friends from college worked under her as Assistant DA. She is a strong candidate, but prison reform is pivotal step in unshackling of the black and brown community. She has 180 pivoted towards it, but her legacy shows otherwise. The USA has become a corporation and anyone can be bought out by VC $. We are being confused by the media debate of which side to support. It’s not about democrats or republicans. It’s about the principles of inalienable rights for all.", "hebh_jamal": "I really recommend reading the nytimes article on her track record during her time as a prosecutor. There are things that are absolutely inexcusable and a shame for criminal justice reform. She has championed policies that dramatically affect low income communities and have protected the “rights” of officers instead of conducting full investigations to police shootings. She’s a classic neoliberal faux politician who uses the same tactics as most establishment democrats. Although I’d love to see a black woman in office, Kamala Harris is no progressive candidate.", "brandtonus": "come check us out 😍", "margovajewellery": "💞💞💞", "justbecausehairnyc": "❤️", "hotel_snob_": "💕💕💕", "lady.hoekagay": "the way she literally salivates over the incarceral state &,her policy voting history.... issa HARD pass.", "viatunisia": "Oh no ma’am", "mcariac": "🙌🙌🙌", "weekandclothing": "💫", "theafrospot": "👌", "jakecohenn": "I’m so excited that the first time I vote it can be for an Asian black woman who’s also my own senator!! She’s evolved and become more progressive over the years-go Kamala!", "doga_saidova_": "people subscribe to my profile help me work on advertisements i am disabled 2g sick hands can`t work pension small9t❤️❤️❤️", "soniabandulet_jewellery": "Go girl! Way to go Kamala Ex-Montrealer 👏❤️", "isam.arie": "Nooo she’s fooling", "lk27irene": "NOT for the people. We need real change. https://afropunk.com/2019/01/kamala-harris-has-been-tough-on-black-people-not-crime/", "gregariana": "I think this is AWESOME. I have mixed feelings on the amount of people that are sooo into the policies. I wonder how long that has been the case. I don't think any candidate will be 100% in line with are individual concerns so we should be careful. People didn't like Hillary because of emails. And to be honest if I had to choose between her policies and the current situation...I'll just say #blackgirlsrock", "karma_padma": "Here's where all democrats no nothing about rights. Do you think your rights have been violated more when someone reaches into your pocket and takes your wallet or when you are not allowed to force doctors to give you free health care. Obviously health care is not a right. You have a right to freedom, not to taking a doctors freedom and making him your slave. Hilarious that democrats think themselves virtuous.", "4evercutthroat": "Kamala Hates her own people.", "ashhbaptiste": "A Black Woman who is known for locking up her people at a high rate trying to use her HBCU and AKA letters to draw in the black folks for her presidency run in 2020. WILD!", "miss_nightowl": "Just saw this on Tv! This is awesome", "miltonmania": "Hard pass", "rickiryan": "Charlene Mitchell was the first Black Woman to run for President and Kamala isn’t like either of those remarkable women.", "queen_losangeles": "Let’s go KAMALA!!!! ✨✨✨✨", "callmectm": "Can I just cast my vote now??? 🤷🏾‍♂️", "yiwenz_makeup": "@lzbridal check this post", "k_mazzucco": "I don’t want to pile on, but I would like to know what she said in her off the record address to AIPAC; where she stands and what her policies with regards to that region are very, very important and slightly concerning if she felt she had to speak off the record.", "alohakeyarra": "Arent u a journalist lmao", "hailey.jjones": "❤️", "michihighlights": "I’ve been so happy about this!🖤", "gunmetal_lace": "😄 ❤", "miss_captain_morghan": "Yes!!!", "flightspath": "Thank you for opening and thoughtful and productive conversation on Kamala’s announcement. Besides the viral clips online, there is a lot for me to learn. I applaud your open-mindedness to host this discussion on social media where the trolls lurk every day but also making it clear that you’re promoting a constructive conversation where you can also learn too. Thank you!! 👏🏼", "littleforty": "Mama Kamala ‼️", "justcallmefeeplease": "🙏🏿🙏🏿🙏🏿🙏🏿❤️❤️❤️❤️👑👑👑", "brandtalkmedia": "🙌🙌🙌🙌🙌🙌🙌🙌", "markitaraquel": "Yesss", "anartcampbell": "I looked her up and discovered her records. They mirror actions of white men in power. She may be a Black woman like me, but she’s not getting my support.", "nylejah_green": "😆😆♥️", "deetsreads": "Hard pass! Her prosecutorial record is... less than progressive.", "marc.fisher\nVerified": "Verified", "amber.luckey": "So much negativity on a simple announcement. Have some dialogue and actually converse with one another. There’s already enough hate out there. Let’s do better.", "gen_is_ggallin": "What about her career prosecutor career that completely contradicts the platform she’s running on? Like have you even googled her?", "juliem00": "@elainewelteroth read the Lara Bazelon piece in the @nytimes re: Kamala’s checkered history as a DA. Very disconcerting.", "lbc79": "Yayyyy!!! I love her. She’s no BS. So smart. Go Kamala!!", "aworkingwardrobe": "For everyone citing that NYTs Opinion piece here's a contrary one: https://www.nytimes.com/2019/01/18/opinion/letters/kamala-harris-district-attorney-record.html", "niquicarter": "I’m here for her!!! Yes 🙌🏽", "chris.micropharms": "whoaaaa nice :)", "chloelo1998": "So excited 💛 unfortunate that many people are accepting a false narrative about her so early on, but the truth (and she) will persist 💜", "nico_beegee": "Nope. Just because someone looks like us doesn’t make her one of us. Look at her record. She educated but using that education to fight against us. Not the one. Not for us.", "charmainemerson": "This very good! #blackgirlmagic #kamala2020 #goodbyerepublicans", "randomorderband": "🌈🌈", "akinfefatou": "❤️💙", "shonfromla": "This is great but she's not going to win against Trump. 😫 I AM Absolutely here for her candidacy, but the reality is she or any she right now can beat that idiot in office. He needs to go up against another male that is not afraid of him and will appeal to the American people. At this rate, he's on his way to reelection. 🔥🇺🇸🔥", "sydfriauf": "YASSS QUEEN 🙌🏽", "glowyangpr": "🔥🔥", "piper.riley": "Hell yesssssss!!! 👊🏻🙌❤️", "mshopnyc": "👊🏿", "tipper_tang_": "She is going to lose", "ascottravelservices": "🌎", "rtbhatt": "Yesssss!!!!", "adabofash": "Just because she’s black doesn’t mean she gets my support. She isn’t really for the people.", "noshirt_": "Receipts: https://twitter.com/copmala/status/1085688776381419520?s=21", "wendyockerman": "#Elainewelteroth I love you posts and how you welcome different opinions!! With that said Kamala running is a great thing!!! We will see her evolve into someone great I am sure❤️", "mameadjei4\nVerified": "Verified", "monbreezy": "YES YES YES", "chikahlove": "This!!! As someone who lived in LA when she was our prosecutor I’m so concerned about how she maintained the status quo here when LA was leading the nation in police use of deadly force. Maybe she was already vying for a presidential run, but when black & brown people needed her to hold institutions accountable she did nothing. Doesn’t give me much hope what she would do in the White House.", "mayarenee92": "Idk. Obviously historic if she wins but gonna watch her closely and listen to all speeches and see if she's truly about that life. I keep hearing she protects cops which is 🤮🤮", "violetwexlerr": "yes!!", "tihairra": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽YESSSSSS 👸🏽", "hopegillerman": "🙏 For keeping the conversation going", "giles43": "I think a Bernie and kamala ticket 🎫", "reneeeew": "She announced her run for presidency SPECIFICALLY today to give off the impression she is for us (black people) but if you look into her record she doesnt stand for us. She throws us in prison. Her announcing she’s running on MLK day is just a way to lure in those who don’t do their research", "rickyday": "I’m not a fan of her history as Attorney General, but then they are there to essentially uphold the law. We do need to listen to ALL the voices and choose the candidate who best encapsulates our collective desires and national needs. My fear (well founded) is that some infantile desire for ideological purity is going have Dems eat our own as per normal and give us 4 more years of Trump or worse (Pence). Can we please use our humanity AND intelligence when making these choices not just or ego and emotions? What’s troublesome is our collective lack of knowledge about our system of government and the electoral college itself has us continuing to make BAD decisions about candidates who can win in the places they need to in order to win a presidential election. It’s super important to vote in ALL state and local elections because all politics is ultimately local. Thank you for the post @elainewelteroth", "patisserielefildariane": "Kamala2020♥️", "kenzielmorgan": "Hard pass", "ohcloe": "👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿", "bg.thegreat": "Let’s gooooooooooooo!!!!!", "arianadelawari": "Queen 👑❤️🙏🏽 cannot wait", "bassemayousef": "“Time after time, when progressives urged her to embrace criminal justice reforms as district attorney and then the state's attorney general, Ms. Harris opposed them or stayed silent,\" wrote Bazelon, the former director of Loyola Law School Project for the Innocent. \"Most troubling, Ms. Harris fought tooth and nail to uphold wrongful convictions that been secured through official misconduct that included evidence tampering, false testimony and the suppression of crucial information by prosecutors.\" - CNN", "stormreid\nVerified": "Verified", "sorrynosupercoolnickname": "👊🏾💆🏾‍♀️🎉", "svitlaya_gs": "👏🏻👏🏻👏🏻", "kamis_kloud": "👏👏👏👏👏", "margojvwilliams": "@adamcol.e ur fave", "stylerunsdeep": "I am so excited for this @elainewelteroth. I think she will inspire a lot of people to get involved. Our country needs this now. More than ever!", "shelbylindb": "@dashiellever 😍😍", "dashiellever": "👏👏👏", "ramonyx": "YES!!!", "annissaadia": "Yes!! We are ready for the light!!", "ctrl.penduluum": "let’s discuss her decision to criminalize truancy and her record as a prosecutor!! 🖤🙏🏾", "skylarr_elizabethh": "Eager to hear her policies and platform 🙌", "the_woodenpalate": "Yes yes yes!! What we have all been waiting for 💃🏽💃🏽💃🏽", "_okayjo": "You called it! @transoceanicgirl 🤭", "kiathecurlconsultant": "Her history of action regarding incarcerated people and also her work to further marginalize sex workers is deeply troubling and would prevent me from ever supporting her as a candidate.", "desireealon": "I’m elated to see a black woman on the ticket but I’m having trouble locating where she stands on issues like gun control, National health care, and women’s reproductive rights. I’m also seeking info about her opinion of drug courts, a solution for the opioid crisis, and support of the EPA-among other things. Does anyone know where I can locate that info? Her site lists a biography including big political wins but, if possible I’d like a bonafide list. Because this election is so important I don’t want to assume anything about any candidate. Hopefully that’s not too much to ask!", "brevetto": "🎉 I’m ready for you to run for office too!", "this_aperture": "YES!!!", "tijn2001": "❤️❤️❤️❤️❤️❤️ #Kamala2020 all the way!! Let's do this 👏🏻👏🏻👏🏻👏🏻", "joewatchestv": "I stuffed envelopes for Shirley Chisholm and I will stuff envelopes for you. I was 7. I'm older now. I'm probably better at it @kamalaharris! Congratulations!", "makemuse": "💕💕💕💕💕", "maayanalperswan": "So excited!! She is definitely my choice for 2020!! And love the homage to one of my heroes, Shirley Chisholm!", "well_fashioned": "@lilboyforever @ivory.maeri oh my✨", "beatlej24": "I think Kamala is a strong voice in the senate but it is evident that she is a corporate democrat. I don't want someone who can be bought to be my President. Also her AG record is horrifying. But beyond that--- Trump won because he was not your typical Republican. I see so many commenters thinking it will take a central Dem (I think polarizing was the word used to insult and describe Warren) to win against atypical Trump. How about we stop voting in the same kind of person and expecting a different result? I won't be fooled by her skin tone.", "rissa_09_": "@adashtothefitness", "lisammagee": "🙌🏼🙌🏼🙌🏼", "renatakellyrippy": "Let’s request that Kamala share more on her views on criminal justice", "rachelk1015": "She is who I was waiting for!", "nhskenya": "Come through sister @kamalaharris", "shanelleclare": "YES!!", "caliluvnyc": "I’m concerned about her corporate ties!", "mirriahw": "Just because she’s black and an AKA doesn’t mean she is for our people or our women. It’s a big no for me.", "saraazadisf": "As a San Franciscan, when she was our as District Attorney, I’d have to say she was dealing with a city that was having tremendous growth and change during the dot.com dealing with people being displaced economically. She was sensitive and smart about the changes and realized the cultural changes both bad and good that were occurring. She helped evolve the city fairly. Main critics would say that equated to being light on crime. I saw it as her doing what was right for each case and with in the context if they city and its people.", "sandykotch": "Yes!", "tinasena": "Tears of joy over here. Let's do this! 🙌❤️🙌", "tbreakley": "Too early to tell whether she can win. (IMO, the country needs a seasoned executive to right the ship.). That said, we are all better as a country because she is running and for that I am proud and grateful. 👏🏽👏🏽", "liyah.kl": "Yessssssss", "ceegirl1987": "I’m here for it! 🥂👏🏾👏🏾🙏🏾", "cafebagheri": "I think every single one of the Democrats who have officially announced their bids for 2020 so far (including Senator Harris) can easily be defeated by Donald Trump in the current broken electoral system! The only person capable of loosening Trump’s grip on the Hicksville is Joe Biden!", "fashionnova06": "🤣🤣🤣🤣🤣", "misscwebb": "Fuck yeeeeaaaahhhh", "yiradirocie": "Howard University in the building!!! Let’s go Kamala!", "katgrimpark": "@peaceloveparker", "taraamackey\nVerified": "Verified", "instrumental007": "Bitch is gonna lose", "diamondmahone": "👏🏿👏🏿👏🏿👏🏿 I’m HERE for her‼️", "max._mom_gone_flyn": "Yes I vote for Black people and people cause they’re Black. It’s just a lil quirk of mine that hasn’t failed me yet...", "parkercass_": "❤️❤️❤️", "molly_wilcox": "YEESSSS✨🔥✊🏼", "ximenadflores": "YASSSSS❤️❤️❤️❤️❤️❤️", "mslegacybuilder": "🙌🏽🙌🏽🙌🏽🙌🏽", "taratatethegreat": "❤️ i love this.", "nic.berries": "👀", "anji__marie": "I'll take a pineapple for president right now but this is so much better", "tori_perli": "@mattaeling", "piperhouse": "We have fellow Americans out of work over a fight for a border wall which is really about RACE & keeping people of color out of the US and a black woman announces a run. As badly as I wish she would run and win I don’t see it happening and it scares me that if the vote becomes that split we will have another 4 years of %#******. I think she is running to raise her profile. Only woman I think could win across color lines is Michelle Obama.", "thestyleandfitnessdiaries": "Yassssssssssssssssssssssssssssss❤️❤️", "beastla": "Let’s Go!!!!!!!! 🙌🏾🙌🏾🙌🏾🇺🇸✊🏽🔵 #kamala2020", "apieceapart\nVerified": "Verified", "materialarchive": "❤️", "ldawudroper4": "Keep me posted forget who is backing certain platforms. We got that already. Let them run for workers.", "mastro175": "♥️♥️♥️♥️♥️", "__________tk": "@elainewelteroth #KAMALA2020 👏🏾", "chef_raerae": "👏🏾👏🏾👏🏾👏🏾", "confectious86": "We have to stop leading discussions with “How Obama did it and Obama this,” they aren’t the same people and the 10 years preceding Obama aren’t the same year any of the candidates will face. Since every candidate was told to have a seat in 2016 we’re going to suffer the consequences in 2020. I’d really like for the candidates we know that plan to run would stay in their current positions and do the work. McConnell has been in the senate for 5 times here we have barely one and two term candidates running for President do we not recognize this? A lot of research to be done to make the best informed decision", "sandy_cheiks": "Oh yesss this is too good to be true", "cherylsorg": "YYYYEEEESSSSSSSSS!!!!", "searchforuhuru": "and please dont compare Kamala to Chisolm, Chisolm was actually a champion for black people.", "mel_olivia": "I want so excited! I want to support her in every way that I can 😀", "aessence_": "Next year ❤️❤️🤞🏾🤞🏾", "bxdandelion": "She doesnt support sex workers. The sesta/fosta law is killing people", "norvelinajolie": "SCREAMING", "yonuff": "Era of the goddess. U cannot stop it.", "modernwitnesses_": "🔥🔥🔥🔥🔥", "mauve.co": "👏🏾👏🏾👏🏾", "clementbryant": "I’m excited. This is really great news and I think she’ll be able to do a lot of good! My G/F will be so happy!", "helenyeller": "her AG record is so anything but progressive tho. we can’t be impressed when women of color have white guy policies.", "christyjski": "Yesss! 🙌🏽", "dash_of_fash": "I truly like her and I feel we need her....in the SENATE!!! Not in the White House. This is not the right time for her. She is not what will bring America together. Strategy is key 🔑 to beating Trump and strategically this is not the time for her to run for president. Her and Obama are not the same. You cannot compare. His connection with ALL people of every race, gender and beliefs was organic. There was never any doubt for me that he would win. At this stage in the game Biden may be the strongest candidate for the democrats. (In my humble opinion)", "1994dezmondeezy": "Shirley Chisholm was the first black person AND woman to run for presidency in 1972", "nadinelacombe": "yes!! she’s just the kind of straight shooter who can beat the current administration. & of course her politics are spot on, imo. there was a time i would have said she lacked experience. we’re waaaay past that now. i know people don’t think a black woman can win. but we’ll never know if we don’t 100% support her. one. hundred. percent. si se puede. 💕", "ndb.nat": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "shar.la": "@carlyalexx_", "xavierasimmons": "@elainewelteroth “Time after time, when progressives urged her to embrace criminal justice reforms as a district attorney and then the state’s attorney general, Ms. Harris opposed them or stayed silent. Most troubling, Ms. Harris fought tooth and nail to uphold wrongful convictions that had been secured through official misconduct that included evidence tampering, false testimony and the suppression of crucial information by prosecutors...... Ms. Harris also championed state legislation under which parents whose children were found to be habitually truant in elementary school could be prosecuted, despite concerns that it would disproportionately affect low-income people of color” 😳😳😳😳", "kelmarten": "Yessssss!!!", "themartyharper": "Nothing to discuss just vote KAMALA and we will be headed in the right direction. If you’re not voting KAMALA then let’s discuss, because I have some light to shed. 🙏🏿", "stephaniechiomastyle": "Yes God 💕", "hightidesynergy": "🔥", "isabellaondo": "If the democrats want to win against Trump, they should go for a real progressive.", "inkedsuenos": "Looking forward to checking out her work, her plans, & her stand.", "luisa_saboya": "Agree with some of the ppl above. I think she (and I mean image, not platform or stances) is not the right fit for now. The US swung from 2x Obama to Trump bc people were spent in one way or another, and for that swing to happen again Trump would have to be burned out, which he isn’t. Someone anti-establishment but still more palatable to the general public, such as Beto, would probably have better chances right now.", "elainewelteroth\nVerified": "Verified", "jeweliciousinc": "Get ready. Get ready #kamala2020", "ilikechheeeeeese": "Nooooo... She’s a cop sweetie. We don’t need a cop as president. Elaine sweetie do your research", "isthatchristen": "Eeekkk. Look up her work as a prosecutor, sis. She stayed locking up black men and women. Just...if a better candidate comes along endorse them instead lol", "theofficialbrigittebako": "Thank God🙏🏽🙏🏽🙏🏽🙏🏽", "jess.caruso": "Becoming more inspired as the days go by.", "goodgaldd": "Boom 💥! I can’t vote (British) but YAY 👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "kennisimmons": "Now this.... ❤️❤️❤️", "cat317": "All I’m saying is that a Obama/Harris or Harris/Obama ticket would have my vote. No. Question. 💁🏽‍♀️💁🏾‍♀️", "alexajayemusic": "YAAAAAAAS!!!!💙💙💙💙💙", "eboneshardae": "Of course my excitement is tied to her attending Howard University and being a Black Woman. However, she is going to have a lot to justify to black voters about her decisions in previous roles. I don’t want us to just be excited because she will break a status quo, but to really be educated and hold her accountable. I also am like some others, in which I don’t have much faith in this country. I don’t think those same rural white voters that showed up for trump and WW that helped him over the hump, will back down. Especially to see a Black Woman take the reigns. It’s not fault of hers, but we must face the data and be realistic. In the end, I believe she has a strong chance.", "kiksfeno": "🏆I am all in", "teflongunn": "If this country had a black woman, we would definitely make huge strides. The black woman is the back bone of all civilization. I would love to see this come in my lifetime✊🏾", "shakenbayke": "Her record on criminal justice is concerning. However, I know politicians evolve and I’m eager to hear her current platform.", "interloping_kamm": "A cop is a cop is a cop. Her history as a particularly aggressive (and some might even say cruel) prosecutor is a no for me dog. Next.", "liltatianna": "Nah. She the feds.", "nicoleespina": "Kamala Harris has a terrible record as a prosecutor. Unfortunately she is not progressive enough for what we need to enact significant change", "fashone.p": "👏🏾👏🏾❤️", "the_c_edit": "This is such a great news, love that she is running!", "klstieg\nVerified": "Verified", "racqiii": "🙌🏾", "hangthedj81": "Yaasssssssss!!!!!", "weartofindh.e.r": "🙌🏾🙌🏾🙏🏾👏🏾👏🏾I’M WITH HER", "shacarraalexandria": "YES! YES! YES!!!", "bedonnahayes": "YES✨🌿", "undeniablyroshi": "Elaine, thank you for your humility and using your platform to educate, uplift and spread love! Your calling is endless 🙏🏾🙌🏽", "letsbloombaby": "This ain’t it....I know black women have and want to see this but let’s not lose sight of what is realistic and what we are up against...strategically, this ain’t it.", "ace_trilll": "She’s got my vote! 🙌🏾", "tiffany__h": "Can I hear her platform first?! I see a lot of ppl saying look at her time as AG. Is she not able to evolve from that? I just know I ain’t voting for na’n 70 year old white man in 2020. On God!", "tracelysette\nVerified": "Verified", "insta_jody": "I love this!!!! Kamala is exactly who we need! I have tears in my eye reading this! #Kamala2020", "raylikeray": "I LOVE this. Kamala has all the tools to be able to prosper as president. I believe this is actually great timing for her to run. Let me explain: before president Trump was in office there was not a significant turnout at the polls for the younger generation. And as we know, this has somewhat always been the case. But since Trumps election and all of his disarray, people are really listening and taking note of what is going on! Millennials are stepping up by participating in protest, standing up for the truth, and not letting fallacies dictate their decision making. This is not to say we still do not have some work to do, but we must continue to push past the current status quo and fight for the future we want for America, our kids, us and the future generations to come. Kamala is a strong, intelligent, meaningful, substantial candidate. She is not just running for America, but for all of the little girls who look like her. She is saying, “oh little girl, don’t be afraid of the dark. Now it's the dark's turn to be afraid. ” This bestows hope upon people who were deprived from this powerful emotion. The present is ghastly and there are many abhorrent events occurring every day, but significant change (like the past there are many examples: segregation, slavery, women’s rights) can not occur without cognitive dissonance.", "duhlayshuh": "YAAAAAASSSS", "frediegilbert": "@strayfitatl", "heauxsquared": "why do we keep pushing centrist democrats? that’s why hillary lost. unless Kamala is about to switch her platforms, I don’t see her winning", "kimandtimlewis": "No politician is \"clean\" in the way that we imagine that they should be. Heck, many of us are not \"clean\" in that I'm sure we've all been caught making off color jokes or commiting some type of crime (everybody speeds). If you plan to vote, there will be something you don't like about each candidate. It's truly about voting for the best of the option pool. Don't shut down Kamala until you know who she is competing against.", "camaerok1129": "Smh", "dean_of_life": "I think the people that expressed sentiments around bad timing or the Democratic party needing a different face is not necessarily doubting her ability but more so lacks faith in our country as a whole. That's understandable based on what happened the last presidential election. But I think the energy displayed in the midterm elections are indicative of the change our country might be ready to see. At least I hope it is.", "samueljdonovan": "I am SO ready.", "bornhivpoz89": "I like her from the onset and how she talks but her views against criminal justice reform terrify me. I’m always rooting for everyone black but not if they are against reforming and bettering things especially for the minority communities who are already inferior systematically, institutionally, and historically. 🙁😔😢 #ImTorn #GreatPersonalityWhenSheTalks but her policies I don’t concur with.", "jennalyonsnyc\nVerified": "Verified", "ashleymcoleman_": "You know it’s a shame to say that I have no faith in this country because Hilary was clearly the more qualified candidate and she lost. Like her or not, because yes, she had iffy politics no question about it. But clearly more qualified. So I’m not sure this makes sense at this time because of what happened after Obama’s presidency. We’re the progressives as creatives, entertainers, and the like but I can’t help but think that middle of the country comes out in full force against anything that looks like progress. But I’m looking into digging into this election and making the most informed decision possible.", "t2therell": "She got my vote. Clearly the idiot we got ain’t worth a damn.", "edeananyc": "I am tearing right now. Thank you @kamalaharris 👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "carlyroye": "🙌", "dr_amy1621": "Yes!!! 🙋🏽‍♀️", "blackwomenviews": "HERE 👏🏽 FOR 👏🏽 IT 👏🏽", "blushnink": "🙌🏿🙌🏿🙌🏿", "bravemoode": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "johnkociuba1": "Educate yourselves outside a television🔺", "rmetz1950": "@bruce33", "hannahmcmorris": "I think it’s important that we are not satisfied with candidates like Kamala, who is good compared to other candidates... but isn’t the best in the grand scheme of things. A former prosecutor, someone who actively upholds the prison industrial complex, and continues to make comments that show she will uphold systems that hurt marginalized folks. Like believing that we should not abolish ICE, for example. And having absolutely horrible views on Palestine. It scares me that we continue to get so excited about Democratic candidates who are not here to destroy and rebuild this broken system, and still work within the American norms/parameters that continue to marginalize oppressed groups. Have I seen many candidates better than her? No, but that’s part of the problem. We are way too content with the establishment, and Democrats who are just one step above the status quo. This can’t be it. This is the minimum.", "michaelroyshaw": "This is exactly the right time for Kamala to run. I for one have been waiting with bated breath. She can definitely count on me and my crew to get the Grass Roots going! 💪🏾💪🏾👑❤️", "thekathyhart": "🙌🏾👏🏾", "quemportum": "Yes", "courtrich_": "YES!!!!!!!!!!!!!🙌🏾", "shanel.adams": "A Howard woman lets go!", "yink_y3nk": "I like Kamala, I really do. But now is not the right time for her to run. It’s important to be strategic at a time like this, and unfortunately I don’t think an “other” (meaning non-white or non-male) can be the front runner to unify the people right now. It’s a shame to admit, but it’s true. The pulse of this nation is in a different place.", "reneestephanietaylor": "I can’t watch another black family be raked through the mud to serve a country that hates them. I support her because she’s talented, she’s sharp, she’s amazing & can do the job, but this country does not deserve her.", "esq_fashionista": "I’m excited to see the process play out on the Democratic side to get a better understanding of exactly where the candidates stand on the issues. I think it’s important we learn as much as possible before picking a nominee because the 2020 election is oh so important! We can not afford another four years of this current, chaotic, idiotic, dangerous administration.", "chictiff": "Yessssss", "danielle_aryssa": "@ctmart1n read the comments!!!", "shop_visee": "It's not about what this country thinks it's ready for. It's time for what this country hasn't seen before. We need to stop living in the negative this current administration is doling out.", "notagingerjustale": "Biden/Kamala Harris 2020", "ikarlia": "https://medium.com/@politicspeach/kamala-harris-career-as-ag-was-built-on-truancy-and-separation-of-black-children-and-families-d5dbcc5fde2f", "the256project": "I'm here for this!", "klately": "We need someone who is going to beat Trump. I’m not sure this is the right way to go.", "holljmck": "Literally just had to take a work break to deal with my feels after I got the notification she’s running. I did not realize how emotional it would make me to read that she’s officially a candidate! Like - really REALLY happy, but.... weepy happy? Relief? Joy? Definite excitement. GOD I LOVE KAMALA now sorry I’ll just be over here happy crying in a corner.", "shannonlydon": "@lysgranger @lysgranger @lysgranger", "amber_rosee": "*SCREAMS* Oh my WORD. one of the most inspiring, rational, brilliant, moral, thoughtful, and capable politicians I've seen in American politics. This could be AMAZING 😭🙌🏼🔥 absolutely praying that the progressive side of America can come through for this", "dannygoertz": "To be honest Instagram gets more and more filled with senseless stuff that takes impact on our subconscious. This led me to the decision to give the people more value. In my case it would be in terms of self-improvement, habits, motivation and business knowledge just to mention a few. I hope the quality and value of Instagram posts increases so we can make Instagram a better place for the users! :)", "empressmana": "🤸🏿‍♀️🤸🏿‍♀️🤸🏿‍♀️🤸🏿‍♀️", "cemck2": "I want her to wait one round.", "virginhair.wholesaler.factory": "That's great! Have a nice day.", "karenaclarke_": "✊🏾✊🏾✊🏾", "iamcharchinn": "This country has done the unexpected with Donald Trump so this country can surprise us again and exactly do the unexpected and have a female president", "xoshanamarie": "Ohhhh black women about to hold it Downnnn ok!", "camarax3": "💕", "rattlesandheels": "👏🏾👏🏾👏🏾YES", "smonetnicole": "Her history as AG & DA should be enough to tell you that #kamalaharris is NOT for the people. Yes she’s a black woman & runs on the “progressive” line now but her entire career shows that she has helped support, uphold, & perpetuate the symptoms of systematic racism.", "damiabajingin": "Yaaaaaaaaaaaas 👏🏽👏🏽👏🏽", "dr.dnicebeaugelin": "How exciting", "consciousbeautbykristen": "❤️❤️❤️❤️❤️❤️❤️❤️", "undreamer": "@self_care_savage", "shirleymcalpine_": "When Barack started they said it wouldn’t happen and they will say the same about Kamala but it doesn’t mean it won’t. I stand behind her she is a courageous leader", "iamrachelricketts": "Shiverrrrs! This entire world needs the leadership of Black womxn", "heyitsjacquelinev": "Where can we donate to her campaign? 🙌🏽❤️ HERE FOR THIS (even as a Canadian) 👏🏼👏🏼👏🏼", "cryindacar": "Michelle was a big part of Barrack’s appeal, her white husband will make it challenging for black folk to fully embrace her.", "shengdanjie": "It’s been time", "fireballfilmsnyc": "💓💓💓", "iamdavie\nVerified": "Verified", "monieprieto": "AMPED🙌🏾", "ewv.swap": "👀", "ladyslv": "Putting all my support behind my fellow Howard alum who is a phenomenal political force. The world starts now. Let’s go!", "iamdomrobinson": "Yes yes yes", "morganre": "🙌🏻🙌🏻🙌🏻💯💯💯", "sarah.nakintu": "Unfortunately this country is not ready for someone like her.", "alaya.lynae": "YES. YES. YES. YES", "achiko_lom_": "Now its turn for hispanic Candidate 🙌", "genstagrams\nVerified": "Verified", "tayylashh": "‼️‼️", "idratherbeadiscoball": "She is awesome. This would be great. #herewegrow!🙌🏽🎉", "fsd202": "KAMALA2020", "mizz_kelly_mkm": "With women running for president, I wonder how #DonaldJTrump is going to handle us talking back to him."}