{"virginhair.wholesaler.factory": "too beautiful! I am a hair supplier, if you're interested ,visiting my homepage.", "spotted_in_ny": "what about Kamala Harris?", "ffrenchiestyle": "😮 I ❤️ the idea! On the other hand if America wasn’t ready for @hillaryclinton 😐 I’m not sure if she will beat the current administration 🤷🏾‍♀️", "sahrahrah": "@alex__barrero", "iiiiiaijakskss": "@elainewelteroth what do you think of her Native American scandal? She says she’s Native American but the blood quantum is so low? Yet she was been telling everybody for years she is Native American that was kind of not 😎", "elleellecoolp": "Are there other candidates running for president??", "deme.007": "Lies You Tell! SMH. We must do better.)", "born_intheknow": "If she is anything like the ACTUAL progressives in the House who don’t just follow orders from big donors (who identify as progressive socially, but don’t come with the same energy when we start talking about taxes) then we have a shot. But she has a huge list of things to fix or compromise on. I’m interested to see her stance on environmental issues, foreign policy, education (children need to know about consent and have financial literacy) and reallocation of funding towards programs that help the marginalized in the country. Post-Trump presidential elections are unexplored as of yet, so you never know what’s going to happen.", "mayarenee92": "Team poc for 2020 🤷🏾‍♀️", "lilly__scott": "@betoorourke and @corybooker for 2020 instead please!!!!", "beingjustbe": "I’m ok with this...", "michele.bradley72682018": "I'm open to her for a few reasons including her work re: financial institutions & poor people's campaign. As a WOC I can't afford to dismiss or endorse on a single issue. There is no \"perfect\" candidate. Having said that, if Dems start tearing each other this early it's a green light for tRUMP(or worse, Pence!)", "kayla_is_my_username": "Vote view says she’s the most liberal in Senate, that coupled with her gender, I think, will make it very unlikely that she wins. Not to mention she’s not a minority fave... I’m sort of curious who she thinks her voters are.. maybe she’s banking on us not duplicating the 2016 elections?", "liberatum\nVerified": "Verified", "lourdeshndrxx": "@betoorourke", "duanecorey": "Make a run and see #blacdivinci70", "gregorymichael\nVerified": "Verified", "r___torres": "@jambers2", "hairbycuba": "I saw your resent pictures they are looking beautiful", "redthread21": "She has NO chance of winning, for one.", "daddy.jla": "She go win", "selenefenton": "Too old with a tired narrative- bring on Kamala", "kiingdomkiid": "This isn’t a shock to me at all. The race for the democratic nomination will be an interesting one this election. Many Top names will eventually make their announcements. These names can go unmentioned, because they’re obvious. I honestly think “Party” debates are the worst. Because we’re in the same Party, we Agree far more than we disagree. If the Dems can change this idea of Division within Party just to get down to One. I Know we can Win. Lead this Race differently, doing things different clearly got us into the situation we’re in now. I hate to say it, but trump was on to something and it worked. That’s All. Happy New Year Everyone", "lala_camille": "I love her, I just don't think she has what the country needs at this moment nor is she strong enough to beat out Trump.", "mbeezy827": "Not surprising but not sure she’s the best person for the job.", "beautynerdnyc": "Damn @elainewelteroth this is a good dialogue. I have found my people", "kris10.morgan": "@joebiden @kamalaharris @repkennedy", "msannarose_": "HALLELUJAH", "yyazmine_love": "I’m not mad at it, I like her and anybody is better than Trump, but I personally think we need someone different and special, someone new that is truly going to unify the country ❤️", "nathyfroo": "As a registered Democrat. Pass - the party lost because we picked from with the same bag as before. Let’s not keep another 4 of Trump... let’s shake it up. Bring in Beto ORouke or something of his kind. Out with the old and In with the new!!!", "sanaibrahim": "No", "_mennanoony": "Is this a bad or good thing?", "jenmovies": "She's amazing, smart, and infinitely better than the current shit show. I say WHERE DO I VOTE", "rezearcher": "Been wanting this ever since 2014 for 2016!! 😩", "carolelatulipe": "Omg!!!!!", "cglowww": "Thank you, NEXT!", "slausongirlspeaks": "Whoever gets wherever in politics the inner city stays in shambles", "adjoa27": "@kojoedzie hey we need to get you on this campaign.", "annalouisehood": "@claud_wini 👏", "themorgans7": "He's going to mop the floor with her... it's like casting will Smith in a movie when you need a fresh new face... she's inspiring, but not motivating because she's old energy... we need new energy to beat Agent Orange.", "downtowngrrrl": "🙌😍🎊", "ewv.swap": "عتاب مر ♥", "mellie__annie": "I am on the fence with Warren. Let us see who else...I am happy that she has us thinking about the 2020 presidential election already though.", "the_toyosidada": "I am here for it, she care about real bings that happen to real people. You should all look up her story and I am sure any woman can relate to her and she can relate to us. She has got my vote for sure...", "kell_menow": "Holy wow", "paz4014": "Doesn’t matter who runs if russia steals the election again 🤷🏾‍♀️", "lobeez": "Right now in 2018 Issa no for me dawg ... she doesn’t appeal to all generations and all people and she won’t pull Republicans away from Trump and could bring them closer but with the right ticket who knows to early to make the allegiance.. I am waiting on Kamala like 💃🏽💃🏽", "muepace98": "@elainewelteroth Exploring the option.", "ingridrileyjm": "I ams here for this!", "lbc79": "She’s a remarkable woman, but she is like Hillary .5. She’s no stronger of a candidate and she’s too similar to Hillary to win. We need a win. I love her but she needs to step aside and take a role in the cabinet before running.", "j.isforjae": "Na. We good on this. Next.", "sophietherapy2": "Nope @staceyabrams", "ddyertyler": "Nope. Not excited.", "christine_theriot_": "This is not a victory for the Democratic Party. If this is the party’s choice, we will see loss in 2020. Even young voters are hesitant to support Warren because of her outright callous approach to negotiating policy. We need relatable...we need universal appeal...and EW is not known for these traits whatsoever. She is the epitome of abrasive and will not hold majority support, much less from her own home state.", "yogini.princess": "I have a suspicion if Trump isn’t re-elected, he will not recognize the newly elected president and will take drastic measures to remain in the White House. He’s already got privatized security and plenty of money available to buy more military power.", "t0by_nguy3n": "Plz dont", "beautyjunkie2012": "I need a mix of Angela Davis with a dash of Obama and a touch of Malcolm X.", "destinj": "Kamala's vigor and smarts sweeps her with a broom. Still appreciate her work a ton though!", "heymimirenee": "I am grateful for @elizabethwarren’s contributions. Even (especially) her mistakes have offered me some teachable moments. However, I am knowing she is not meant to be the President. We are in the wake of a global energetic tidal wave that is bringing tremendous healing to this entire earth. And when I examine who is, and always has been, at the forefront of movements creating momentum for this healing tidal wave - these movements are consistently influenced and lead by women of color. Yes, #thefutureisfemale, and btw she is also of color.", "charitydabrowski": "I’m good luv enjoy 🤷🏽‍♀️", "jeva.jeva": "After the foolishness in 2016 I’m not sure America will have a woman as president at least in the near future", "dirtyadidassuperstar": "no", "yummicoco": "Pass", "kathleenmurphyphotographer": "Fantastic News!!! 💙", "expectanteaixa": "Different tactics are needed and you better be able to go at him while appearing presidential. It’s a hard task. And I don’t think she’s passed the test the past two years. Ditto Bernie Sanders. I will vote for anyone that can win against him though.", "ailishfitzy8": "FUCK YESSSSSSSSSS OMG STARTING THE YEAR OF RIGHT", "nana4kua": "We need Bernie. He is a more aggressive progressive", "saberdesolid": "I love Elizabeth Warren, I appreciate all she has done. But she is not the 1. She won’t defeat Donald. And that’s gotta be our #1 goal.", "deniseb89": "YESSSSSSSS IT'S LIKE CHRISTMAS ALL OVER AGAIN 🙌", "mckellwilliamslowe": "She’s great but she won’t win. We need someone who connects with the swing states.", "franssjo": "Love seeing such a civilized and eloquent debate here! 🙏🏼❤️ Growing up in a capitalistic and also social democratic country (Sweden) I welcome the narrative, talking points and debate Warren evokes. I’m, respectfully, not sure Democrat’s handle the tussles bound to ensue very well... exemplified by hardcore Bernie fans not fully supporting Hillary in 2018. Meanwhile, I believe the Jeb Bush, Rubio, et al, supporters put all and any pride (read: sanity) aside and voted Trump. Do we - hand on heart - believe Warren can go beyond unifying and actually electrify the party base? Bring out non-voters, poach female voters, the suburban white vote, independents, key minorities, a disenfranchised working class... If not, or if in doubt, let’s not go down that road. With US Presidential incumbents usually not losing, Trump to 2024 could be the outcome. A thought I dread every day and makes me uneasy about Warren. Seems like a VP option, to galvanize the left wing and pound on Pence in the debates. A scene and scenario that has me salivating. I’d go with an untainted wild card (maybe Beto?) to beat the outlandish Trump. Look forward to hear more people’s thoughts on this! ❤️", "tracy_cpa": "YYYYAAAAAAASSSSSSSSS!!!!!!!!🙌🏼", "shonfromla": "Nooooo", "k_fully": "❤️", "genelle_l": "OMG 🙌🏾🙌🏾🙌🏾", "kellz_aka_kaykay": "*beat", "taydelabay": "I am not a fan of how she handled the whole “Pocahontas” controversy. If you’re a true ally, you shouldn’t have to claim minority heritage to be respected or taken seriously. Not to mention, she looked so silly when her heritage was virtually inexistent.", "michaella.kl": "Thank GOT", "ancientprincess": "VOTE", "neaven38": "At this point, I'm voting for anyone that's not Donald Trump!", "jazzycroyance": "I think instead of people talking about what they don’t like about a candidate, they should talk about what they like about their candidate of choice. That way we can get clear on what the party’s priorities are and build bridges between these candidates and what people actually want. We can win in 2020, but only if we are truly together.", "naushonyoga": "Nope. No no no. So many better candidates.", "gr8tmomof4": "She will never defeat Trump ugh!", "rianalynn": "Bloomberg for President, Kamala for vice President", "kgiscooking": "Let’s please all agree, whoever is put up after the primaries, we VOTE AND VOTE FOR THEM. Also, a less toxic primary season would be The Dream. I can’t do another Bernie/Hillary mudfight.", "beautiful_1namedjoy": "Uh oh", "ginabrookebeauty\nVerified": "Verified", "crysmack": "No thanks.", "lifeaccordingtoangelarich": "I can’t support her. We need to win . She can’t do it.", "sunserae": "I AM HAPPY SOMEONE HAS OFFICIALLY ANNOUNCED!", "niecey_xo": "I’m good luv,enjoy", "_heyyitszoe_": "She’s not the worst but she’s not this best.... We need a true progressive to run for president 🤷🏾‍♀️ someone real like AOC", "bang.and.lessin": "Zero charisma", "rebelraemusic\nVerified": "Verified", "alisonima": "I like Sen. Warren but she can’t beat DJT. KAMALA ON THE OTHER HAND.. ✅✅✅", "meredithphoto": "Yes!", "i_robocop": "@francescabenitez", "j.tyty": "ehhhhhhhhhhhhhhhhhhhhhh nty", "erin_brisbane_butler": "I like and respect Sen. Warren, but there are a few other names I would rather hear from first. Kamala, Beto, Biden. I am pretty skeptical of her ability to pull the more moderate dems which will likely be key to a win in 2020. She is incredibly polarizing and moderate white men don’t seem to like her, which might put her in the same sexist bucket as HRC. I’m not sure EW = W in 2020.", "samtravelchick": "🙌🏾🙌🏾🙌🏾", "deidamassey": "👏🏾👏🏾👏🏾👏🏾👏🏾", "heyyyyqueenn": "Not surprised. I wish her well but I can’t say she represents Me! She’s a B.A. & she’s impressive but as an Educated Black Millennial, I’ll looking for someone else who speaks to more of my issues.", "lovelylady03": "I'll wait to see who else throws their hat in the ring. If she's the last woman standing she'll get my vote. At this point I'm not really feeling her, esp after some of her comments on Obama's post-presidency earnings. It's none of her business and there's no reason for Obama to take a bow of poverty to appease her. I know no candidate will be perfect, but I'm \"meh\" on her right now.", "hismajestyjudahisvaran": "I love Elizabeth...brilliant mind, progressive and boldly takes the corrupted to task. I would actually love to see @berniesanders as president @KamalaHarris as VP and ElizabethWarren as Attorney General.", "shanyaz": "Ugh", "isntshemrslovely": "No, thank you. Her favorability in the polls isn’t much better than Trump. We need a strong candidate. Can’t play any games in 2020.", "fabfreshandfly": "I don't like it. She's not the voice we need. The future is younger and while she would be a change from the current regime she's still a bit out of touch. We need to focus on winning the White House and continuing the progress that was gained in the Midterms. This would be a step backwards. Why not someone like Tammy Duckworth?", "ragpapermedia": "Question: \"I know we all woke up reflecting on 2018 and planning for 2019 but can we discuss #2020?\" Answer: Nope.", "blondebondmom": "Yaaassssss 🙌🙌🙌👐👐❤❤💣💯💯💯💯💯💯💯", "neicyrox": "😴", "theemeraldrock_drj": "She’s formed an exploratory committee. That’s all. So has Julian Castro (https://www.politico.com/story/2018/12/12/julian-castro-2020-presidential-bid-1060045), yet she is reported to have “announced that she is running” while Julian is reported to be “exploring.” If forming an exploratory committee = announcement that one is running, the both Warren AND Castro are running. Not here for slanted, inaccurate, clickbait headlines that bury POC.", "philipedwardking": "Reducing a complex, diverse array of Native communities and histories to a simple DNA test and stubbornly refusing to own up to that mistake and listen to why it’s a problem for Native people has p much dissuaded me from being interested in supporting her.", "irmmufasa_11": "I want Kamala Harris 🙌🏽", "charlsi__": "2020 BABY", "nataliafedner\nVerified": "Verified", "fay.on.fire": "Woooaaah", "moya.business": "Great News!", "hanaeam": "Yessssssssssssssss", "moniquemastrobattista\nVerified": "Verified", "aina.gram": "See this is exactly why trump might win again. Smh. People you better wake up now. Don’t repeat 2016. Me personally I’m for anyone who is NOT trump in 2020. PERIODT! We can survive 4 years but not 8 years of him. Think about that before you turn up your nose at candidates who aren’t your “perfect” choice!", "hilary.morgan11": "I love Elizabeth Warren. Unfortunately, I don’t think many people feel the same about her, especially men.", "mhanafy25": "❤️ her!", "vsizzlebx": "I am more interested in a Biden/Harris, Biden/Beto or Biden/Jeffries ticket. Those are balanced tickets. Frankly, Uncle Joe is the only one that can get on stage and get messy with Chump and come out clean. Joe will also snatch up the older white GOP vote we need to capture these gerrymandered districts, that should be democratic but go red because of how the draw the districts. Hate to say it but 2020 is going to be a reset election for Dems.....and 2024 we will see another true NORTH STAR rise. That is why I feel let’s get Joe elected, restore policies of Obama era. Joe is a great man, and not caught in the swamp. He has the backbone and knowledge to run shit.", "wanderlust_mylife": "She won't get my vote in a primary. She's. otherwise inclusive enough in her policies", "liquedeehs": "I'm gonna say No, because I already see Trump calling her Pocahontas and bringing up the Native American blunder she made and a bunch of people on the Dem side jumping ship because of it. We gotta come up with somebody that doesn't have a possible racial fiasco in their back pocket that Trump can harp on. She seems completely competent. I like her, but I don't want the election to be about cleaning up the mud Trump has stopped to find and sling around.", "ambermariagg": "Absolutely not. Her nomination will ensure Trump gets re-elected. I want to see @corybooker and @kamalaharris run.", "sahar1913": "No thank you, next.", "bamboolababy": "Thank god thank god 🙌🏽🙌🏽🙌🏽", "brandon.felton": "We need Biden.", "nikfc": "Democrats need to unite & figure out who CAN win AND do the most good or else it will be a party divided again as was the case with Bernie and Hilary. Elizabeth Warren ain’t it.", "hayleypenn": "@duffg I’m sure u already know but :,)", "jimmyswagginc": "🙏🏽🙏🏽🙏🏽", "lisa_is_soft": "Sorry but ... a woman WILL NOT beat Trump! No offense, that’s just fact. Let’s be smart this time.", "ugadskyproductions": "@berniesanders is my President", "ladyslv": "Not enthused but open to seeing how she has evolved.", "suga.honey.iced.tea": "No", "awkwardj3di": "Warren + Waters 2020 please!!! 🙏🏽💪🏽👯‍♀️", "miss_bae": "I’d much rather see @kamalaharris running for President, TBH. I respect her a lot. (Wishful thinking)", "psharif": "Here’s my ticket. @joebiden + @betoorourke. We need the skilled and the new experience blended in politics just as we need it in corporate America and in entrepreneurship! The combination builds sustainability. 💥💫", "charmainemerson": "Warren is a way better candidate than Hilary ever could be--ever! But #america won't elect a woman for #president. That's why you have Dumb Donald #toosad #toobad", "an_alba1": "This is a mistake.", "disko_sequins": "GET IT", "mimistringfield": "elizabeth will fail to bring in minority votes because much like hillary, she doesn’t know how to cater or relate to us as people and not a market to be pandered to. additionally, sen warren and kamala harris both voted in favor of the FOSTA/SESTA bill that has endangered and crippled the livelihoods of sex workers across the country under the guise of “eradicating sex trafficking.” issa no from me and i’m hoping neither of them are the dnc’s jackpot pick tbqh", "whitney_starks": "Ehhh i don’t know. I feel like most liberals in America are most other countries centrists. They really are not as far left or as progressive as I would hope. Better than what we have in office now but I don’t want to vote for someone only because they are better than what we have. I want someone to run who is like Bernie or alexandria ocasio-cortez. Someone who represents REAL progress and NEW ideas. Not someone who is better than what we have now but continues to be a part of the capitalist and classist agenda in our country. I want someone who is not just words but is action and the democrats are not doing that for me anymore. The republicans are right wing and democrats are now centrists. We need some action and some actual leftist movement.", "nadinelacombe": "sorry, but we need a far more compelling candidatei if we hope to win in #2020. #beattrumporpencewhoeverisleft", "kimberlygoldson": "Great conversation and points of view!", "ginnagreen": "This announcement is a clinic on effective communications, an independent assessment separate from my support or interest in her as a candidate at this point. It is too damn early to be focusing on 2020 when there are serious and important non-presidential races in 2019.", "alushlife_": "Not excited. Hilary 2.0 . I love Elizabeth Warren but this is same old same old for the Democratic Party. Warren is a big favorite with the same women who supported Hilary and wear pussy hats but only subscribe to one notion of feminism that leaves POC out of the convo entirely. I’m just not confident in it.", "charcuteriemami": "YEP SHES GOT MY VOTE", "sjoorda": "@elainewelteroth She’s fabulous. But: the announcement is too early and it’s time for someone who isn’t from my/our parents’ generation. Oh, @michelleobama , where are you?!? (But she should wait if she does announce)", "beatlej24": "Will be very upset if she Bernie decides to run and she runs against him.", "thekrlstyle": "Wow 😮", "ashleyfalcon": "Not a good choice. Lovely woman but not a strong enough candidate to defeat what we’re facing. Sadly, I fear we need a man that skirts the middle in order to get rid of this disaster. I’m completely pro woman president but I think given the current climate we need to get Trump out of the white house by the most certain way possible and then work towards swinging for the fence with our First Lady president. The divide is huge right now we need to take steps in the right direction before we run.", "chloeheartsart": "Oooooohhhhh", "terrence.phearse": "Let’s do this", "reneepedigo": "🙌🙌🙌🙌🙌", "nakitaapplebaum": "No thanks", "___miss_marjorie": "Still waiting to be inspired. 😕", "courtney.en": "Hoping for Beto", "specialsansan": "What's the goal, to WIN the election, correct? To WIN. I know what she believes and that's all fine and dandy, for any of the potential democratic candidates really, but we need someone regardless of issues who will roll up their sleeves and dig in to WIN, and I'm not sure she's the person to do that.", "jesselenore": "I love Elizabeth Warren and this would have excited me in 2016 BUT she is to divisive. We need someone who can unify both sides and beat Trump. This means someone that republicans will vote for and I don’t think she’s it. Maybe in the future but I don’t think now is her time. Like I said I love her and she’s a personal hero of mine but she doesn’t appeal the Republicans at all, even the ones who are disappointed in Trump.", "awwteetee": "Let’s go!!!!!!!", "zachpizazz": "I do like her. But she's surrounded by too much controversy. It's not her time anymore. I believe we need someone who is \"good trouble\" like @repjohnlewis says. Warren needs to step aside for someone else, we need someone who can move the country forward without the baggage of the past two years behind them. I'm all for @kamalaharris and @corybooker", "erikakdavis": "I don't know how I feel ... I'm holding out for Booker/Beto", "browngirl_wanderlust": "No thanks - I’ll take one of the B’s Biden/Booker/Bernie/Beto and Harris", "meadow_af": "Waiting for @kamalaharris and @corybooker 🤞", "dereknyla": "She is a top 10 candidate for sure. I hope Democrats and progressives can actually be open minded enough to give all these amazing candidates a chance to let them run...and may the best woman win. 😉", "lola.odetola.o": "Mööd", "vj_hughes": "@elainewelteroth in my opinion, we are not in a place to accept Elizabeth Warren as president. After this current nightmare, we’re going to need a candidate whose a lot less polarizing, able to reach across the aisle....effectively.....has a grip on foreign policy so that we can reclaim our global standing and put their head down to work hard on the messes, corruption and lack of decorum this current administration has created. We don’t need any political superstars. This country needs someone whose sole purpose is leadership strategy coupled with solid political understanding. That person has to currently be sitting in Congress, quietly making waves. Someone we’ve possibly slept on, but who gets the job done. THEN we can get back to the Elizabeth Warrens on the next go round....Hilary Clinton’s lost proves that we have a lot of work to do as a nation, it’s still too fresh.", "twannatoliver": "Meh 😏", "ali_626": "THANK GOD!!!", "kait.hurley": "I personally love her, but I don’t think she is likable enough. I am not sure she will be able to connect with black and indigenous people of color....I also worry white women won’t vote for her given our disgraceful patterns in 2016 w/ Trump and this year’s midterms. I think Kamala Harris is way more likable and will be a unifying voice. I do fear for her safety though as a black woman. White women, we need to get it together and rally as a collective. 💞🤞🏼", "sweetphee": "Love her", "tgillock": "I personally adore Warren, but my adoration came before her political career. When she was still Professor Warren preaching fiscal responsibility and wanting to hold creditors responsible for their actions. She’s a highly intelligent woman who truly wants the best for people. I think the GOP has done a great job at grabbing stupid headline to keep the uneducated eye on things about her that aren’t necessarily important. Do we really give a crap about her heritage?? She’s from Oklahoma, everyone claims Native heritage in this state (where I currently live). For all the people saying “Hard Pass” instead of focusing on what the GOP has outlined for you, please do some serious research on her. She’s an intelligent woman who really does want the best for us a body of people. If you still favor another candidate, that awesome, but educated yourself on whoever you vote for. And as much as I adore Warren, I’d still like to see Beto as our President because he’s young and has youthful, unjaded view on what can be accomplished. I’d also like to see another person of color win, because let’s be honest WE ARE NOT A WHITE MALE NATION! We need diversity!!!", "kimberlyestone": "I'm so happy for her", "cazantonio": "@instagram needs to create a SUPERLIKE for this!!!", "sonita_joonjoon": "NO!", "msemb72": "Thank Goodness!", "ericabunker": "Thank u, next. #beto2020", "mining_for_gemms": "@wbilicic24 !!!!", "michaelroyshaw": "Umm no!! She really needs to fall back.", "iamracquelm": "Im gonna day no for this one. Uh I wish uncle joe would run", "tiffanyhop": "Trying not to make any determinations until we see each candidate’s platform (and where their financing comes from.) They each have their pros and cons. However, I hate to see our side tear down any potential candidate. Let’s leave that to the other side. Would like us to civilly compare each candidate and pick who is best for the country AND who can beat Trump. As much as I’d love to go all the way progressive, it’s not a strategy that can win swing states or flip red states blue. We have to be strategic and realistic.", "min_liz": "Tbh not a huge fan of Warren", "slwises": "@elainewelteroth Won’t win..To far to the left. But, she can certainly do what Bernie did and divide the Dems enough that the GOP wins.", "carothebaro": "@veronicablempert", "jacque.reagan": "Just NO. We need fresh views! The old guard needs to pass the baton.", "emjayohbee": "Love seeing women stepping into the race for POTUS. Love it even more if that woman was @kamalaharris ....🙏🏼🙏🏼🙏🏼", "dimepeace15": "I’m good Luv....", "monroesteele": "YAAAAAAAAAASSSSSSSSSS", "docmakil": "Why?", "carasantana\nVerified": "Verified", "a.maksimiak": "#Trump2020", "dsosergi": "Nope I’m a big supporter of her a s a MA resident but don’t support her run for president.. too distracting .", "fitnessjenna": "I’m a Dem and will be voting Dem but absolutely not. Warren can’t beat Trump. We need someone else as the face of the party to take him down. This is a hard no. She’s not the right person, not the right woman, this is a bad decision.", "anji__marie": "I woke up to this. This gives me hope.", "liasaile": "Wow this is amazing!!!", "justnelli": "Beto has a better chance winning honestly. Warren ain't it.", "eileensita_xo": "@djtrauma thoughts?", "checkthementality": "As someone born and raised in Massachusetts she is a great reflection of our views as a state but I already know that the Midwest and south view us as wildly liberal. Plus she gave a lot of ammo to the Republican Party with that Native American fiasco and they will string it along like the Hillary lock her up incident that followed throughout the last election. Biden would have a better chance to clinch the vote IMO.", "kimmykimfree": "And I know there is still a God!!!", "cyadria": "Her whole trying so desperately to prove she’s 1/1000th Native American thing left a bad taste in my mouth. She did it for political attention and the whole thing was pretty gross. But if she’s the only option vs Trump then obviously I would vote for her. Hopefully there are better alternatives, though! (cough Stacey Abrams cough)", "ajendoor": "Two years too late!!!! We have New opportunities and new compelling candidates", "rebekahweatherspoon": "I don’t think she’ll win.", "owoadek": "Please no.", "madison.utendahl": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "treescully": "nahson", "bigbleuboss": "Regression?", "traysay8": "not as excited as i want to be for a candidate. and she won’t beat you-know-who.", "mozgovmoney": "Bernie Sanders got arrested in the sit in's fighting for civil rights. He should get another shot.", "kaylanfw": "AIRHORNNNN 🎉🎊 look out fascists!", "dr_dej": "I’m voting for everybody female", "terrence_shark": "She's wasting her time. It's best for her to stay where she is to help her constituents.", "poshgirld": "Seriously unsure. I need to get closer to 2020 before I decide.", "thecurrencycollection": "🙌🏾", "dreamofchar": "No thank you", "confectious86": "It’s a no, New England elected officials don’t have a grand outlook on the rest of the country", "marliestyles": "Pls dont.. I think we have enough of haggulious #hrc for one #lifetime thank u😋", "cydsparkles": "She better have a SOLID plan and serious commitment to include WOC/POC in her Cabinet and policies. And I want no less than 3 to 5 Black people in major Cabinet positions. And a pony!! 😂 But seriously...any White candidates that want to be taken seriously need to show a deep commitment to racial equity and justice. It’s simply our time. We need and deserve several seats at the table if not the head seat at said table. #paymeinequity", "tdcantdwill": "I like her, however I’m interested to see who else steps forward.", "hind_sophia": "No thank you. I'd like to see some fresh new (and less white) blood in the white house instead of more establishment Dems doing the same thing they've done for decades.", "kingeakers": "Nah. I’m super good. I want @kamalaharris and maybe out / @betoorourke on the ticket too. #Kamala2020", "therealdiamonde": "@ashleymarietta i’m with you.", "brooklynmo718": "Got my vote!", "robyntothetee": "I read someone else's view and I have to agree: this is actually good because she can take the brunt of the attacks that will come democrats way, and she is tried and tested in that regard. I don't think she'll win, but she doesn't need to. She might be putting herself out there to make the road easier for other candidates, like Beto or Harris.", "rhodes657483": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "meeandminnie": "Not sure how I feel 😕", "yall_took_the_good_names": "We feel nothing over here. Didn’t Bernie ask her to join his ticket and she turned him down. And what has been her progress on the student loan front? Almost anyone is better than Trump but no fireworks from me on this news.", "phiashmia": "Absolute complete and total hard pass. CAN WE GET SOME FRESH BLOOD PLEASE?! So tired of the same old names being thrown into the ring over and over again. None of these folks are viable candidates against trump!", "jessicaloren24": "@jonsilva27 talk about girl power lol", "ckg2": "@elainesal13", "theryannrichardson\nVerified": "Verified", "earlyrizah": "Naaaaaawwwwwww", "yink_y3nk": "This isn’t the right move.", "michaelshead_": "She has my vote!!!!", "smileitsjoy": "It’s a no from me dawg", "the_woodenpalate": "Elaine how about you run?!", "francesdaniell": "#bernie2020", "tammygordon": "I want all of the talented women running. Let’s see who can build the organization and message!", "eharris1of1": "🤦🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️ Noooooooo", "catecmcmanus": "Hasn't endorsed Medicare for all and takes corporate money. #Beto2020", "_msapplebaum": "💪🏼💪🏼💪🏼 Let go !!!! Wish she partnered with Maxine Walters", "stacythetruth": "Yessssssssssssssssssss 👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "dingbatagram": "\"Breaking News\" 😂 😂 😂 This is not news as much as it's proof of what we already knew. Will she recover from her DNA test fumble in time? Maybe, but I already hear the same \"We want a woman, just not THIS woman\" comments that dogged HRC.", "sharonrenee_": "We need a definite win. That’s Joe Biden.", "alyssahertzig": "I think she’s great and would of course vote for her in the general if she were to be the nominee, but there are other candidates I like better at this point. Rooting for Harris, Booker, or Beto right now...", "mrglamrocksoul": "I’m patiently waiting for the Harris/Biden ( or Biden/Harris) ticket to be announced.", "jnetty_": "I’ll take anyone at this point.", "andie4651": "❤️🙌🏾❤️🙌🏾❤️🙌🏾❤️", "antiguan_rude_boy_glen": "Naw", "jonell.laurent": "I’m not American but she seems like a good option. Anyone dedicated to politics and put the work in for this long should at least get a chance at leading because they know a lot. She’s not some billionaire who just waltzed up and became president, May I remind you which you guy have already done for that ass hat in office. So.... if she wants to, she can, and she will be damn good.", "cydneywrites": "Naw. She’s inconsistent and mad polarizing.", "cpc_baby": "Nope nope nope", "lemajsmith": "This ain’t it.", "freethefreckle": "@srod051 the time has come", "st.raffi": "💕💕", "esthercist": "I thought this was a given... I swore she had mentioned this during the last election—or at least hinted at the fact that she was gonna run for office. I’m glad she is! I would definitely vote for her", "k_mazzucco": "She really lost me with the Native American play and I’m ready for better and more diverse representation overall.", "chellzmb": "I’m good, love. Enjoy.", "bqe_mermaid": "😕", "mochhalady": "Angry White men i.e. conservatives, confederate flag red necks, blue collar workers, veterans over 50 yrs old, laid off industry workers, young recent college graduates, working struggling middle class, WILL NOT VOTE FOR A WOMAN. They will vote for #45. Not here to offend anyone, just my opinion.", "liz_seaman": "All in, I think she’s a formidable opponent!", "searchforuhuru": "lol,might as well cancel the elections and give Trump another 4 years", "ashleymarietta": "I’m leaning more towards Marianne Williamson rn. 🤷🏽‍♀️", "cmsola": "Wurd !", "perfection1day": "I’m honestly going to have to do more research on her to form an opinion. For now staying politics free until Jan 2nd then back to it.", "lxtinoco": "We need the spirit of @ocasio2018 to run for office- her quick fire responses and passion is what is needed. Elizabeth warren needs to not be petty and focus that energy on connecting to people in an evolved way than how trump has.", "juicehustlin": "No thanks. Democrats still haven’t learned the biggest lesson. Younger dems and independents are tired of the same type of candidates over and over again. Barack won because he was bringing something new, great, and different", "heyjanellj": "Uhh this isn’t it. America won’t vote for her. I hate to say this, but I don’t think she’d beat 45.", "lizamarieinnyc": "I'm conflicted...they would never do a 2 woman ticket... what about Kamala 🤔 @jmdmommy", "noendtothrifting": "Can we say @corybooker !!!!!!", "concept_create": "@artkaligos @martyjgross", "niahope": "Her image, imo, is MEH. Already feel like she isn’t relatable. But I need to know what her track record is with black and brown people and minority groups before I even begin to consider this to be a good idea. Until then, hard pass.", "simmydavis": "Um... this is the woman who said she was Native American in order to gain admission to an Ivy League school and to this day isn’t able to prove her lineage. No thanks.", "fuckyahoo2122": "Naw I’m good", "4tunate_one": "She has no chance of winning the nomination", "dae_like_day": "😗😬", "createdbyelle": "No thanks", "homes_by_yohannes": "Cue @johnmayer “waiting on the world to change”", "_lakesuperior": "I honestly wanted @kamalaharris and @betoorourke to run together. Elizabeth is good and she has had her fair share of ups and downs based on things I’ve actually come across and looked into and so does every politician but she is just not what I envision for 2020, I don’t know why but emotionally I’m not really on her bandwagon for next election.", "luvleighdi": "my gut tells me nah but let me see who else jumps in the race first", "msbenayt": "👎", "fullerframes": "Nah, I’m for Beto/Kamala or Kamala/Beto, just really hope they run together in the end.", "circleofopportunities": "Yes a contender in the ring 👍Let’s Go to Work! 👏 Get ready 👏", "thenicolewebb": "ehhhh, i think i’m going to pass. i believe she has okay intentions, but let’s talk about the Native American fiasco—that proves A LOT about how she can make herself the center of the wrong attention + for what? to show you can relate to a minority group? that’s not how you do that. and i’m tired of white liberals thinking they have to act “urban” or be a part of minority group to relate to us—just be an empathetic human being. also, in my opinion, she’s not doing enough to prove why she isn’t like every other “typical white democrat,” claiming they’re going to represent “all people,” when really they only serve + uplift their own beliefs + white beneficiaries. she has not put enough action toward efforts to help serve the under privileged& under represented communities. i’ll wait for kamala harris...", "skeif85": "@elainewelteroth very proud Democrat here, and I agree with most of what she says. I don't think she would defeat Trump though, and our paramount concern should be defeating Trump. Beto.", "glorels": "I'm good luv", "wambuim": "First steps are good. I’ll keep it at that.", "phillieb2685": "Stay in the senate Elizabeth. You’ve damaged yourself too much.", "flyshida": "Oh boy...", "prettysocialatl": "I don't think she's who we need... She won't unify. She won't get the votes.", "brandom416": "Mood conTinued: 🙄🙄🙄🤮", "gbreal1971": "It’s not enough. Democrats with a real progressive agenda have demonstrated how to WIN. And win we must in order to undo the ignorant and ill-advised policies of the current administration. And let’s be clear. What Trump has unleashed wont be undone by talking and hoping. It has to be defeated the hard way. I’ve not (yet) seen or heard a potential candidate that is ready to do the work.", "k_mcdoogs": "I’ve been a fan of her, her polices and her work for years but the fact that she fell into a trump trap early on took away my confidence in her ability to fight this fight and win.", "tcofilms": "🤦🏾‍♂️🤔😏 Next Option please.", "whitneyiswhitney": "I like her but no. We need someone who appeals to ages 18-30 in the next election. Maybe Joaquin Or Julian Castro. They’re young, they’re not out of touch and I think they will also appeal to older generations and (dear God help us all) the 50 something percent of white women who voted for Trump’s dumb ass", "marisa_ellison": "Love her but don’t think she can win unfortunately :/", "loknott": "so many pros but to state it plainly she ain’t got the juice to win hearts or to sway minds.", "barb_wyatt": "She’s smart, hard working, strong, progressive (ish). All improvements over what we’ve got. Going to be a slog getting to the nomination, whomever achieves it.", "shellfidel": "Waste of her time...", "olamide_oladapo4": "@elainewelteroth I want to feel excited about another woman running for President but in my heart of hearts I honestly feel like the only person that could actually challenge 45 and WIN is a white, moderate man. Dassit! I wish it wasn't so but this is the world we live in. We need a candidate that can WIN. I don't think it's her.", "gjpmedia": "No thanks 🙅🏾‍♀️! We need new energy! This will be Hillary 2.0. If WW wouldn’t even vote for HRC in strong enough numbers, this ain’t it!", "kennyheflin": "I love her!! But she’ll be looked at as “too radical” on the left side. I think she’s amazing but she lacks the charismatic nature that young voters want. She’ll need to drop the “Middle Class” nurturing. The Middle Class has been dwindling since 2008, these days you’re either poor or rich. Articulate how you can help the poor and super poor in middle America. I feel she’ll be a great Secretary Of Defense @elainewelteroth", "kumidreams": "Hell yes 🙌🏼🙌🏼", "camarax3": "Yas bishhh lets get it", "emilyaleece": "@kramergroach 🥳🥳🥳", "toltec.alchemist": "She literally claimed to be a ‘woman of color’ on her law school apps cuz she has a tiny percentage of native blood. Pretty much, she insulted the entire native community & i would never vote for her.", "jemappellegorjess": "I want to win, this is sure way for the Democrats to lose. I like her and Kamala but 2020 isn’t the race for them. Corey Booker either. We will lose the democratic purists and the independents running any of these candidates.", "hailee.highvibes": "Fuck yes!!! 🎊🎉🔥❤️", "lydtheleo": "I think it’s a mistake to make the candidate someone who falls that left. I love Elizabeth Warren, but we need to choose someone more moderate in my opinion.", "thebloweshow": "All the eye rolls. Matter fact, just pluck both of my eyes out and roll ‘em across the room.", "alainamm02": "I’m still hoping for Beto to run. I consider myself pretty liberal, but Elizabeth Warren is too extreme, and I don’t think she can beat Trump. We need someone unifying and moderate.", "schmogreene": "Ayyyyyy! I feel good about this. What would make her even stronger is if she got @corybooker to be her Vice.", "kayinbloom": "#everybodysacandidate2020 Shit, I’m running too.", "jessicarson": "What I want is two qualified candidates if it came down to a situation like I last election where the Democratic candidate was like Donald Trump ie: not qualified I would vote republican. Unfortunately many of us (myself included) we vote how our families vote instead of seeking understanding of who is most qualified. In saying that you can see how my standards have lowered. It used to be about the alignment of values but I’m over here like, “I need a candidate who doesn’t think threatening Russia is a good idea” My hope is that we have a Democratic candidate (whom ever that may be) to be worthy of the vote. Millennials have shown that if neither candidate is qualified, they will not vote. We need to start by vetting/voting to in sure the right people make the ballot.", "clarkbryantfitness": "Ehhhh I prefer Miss Harris", "trev052011": "👏🏾👏🏾👏🏾👏🏾👏🏾 My vote right there", "sumsumc13": "I’m all in for @sensherrodbrown", "scorpio_moon_33": "I’m not voting for her.", "abjeanphilippe": "WOW!!!! For reals??😍", "megz_manning": "Pass. We need young blood.", "beingmizjane": "Awe, Miss Native American.", "natacha.gordon": "This “Hard Pass” attitude is what got us to where we are right now. She just announced, Harris hasn’t even announced (yet), and she is one of the most (consistently) progressive voices that is visible- criticism is fine, but has to be informed- not biased.", "tljackoracle": "Nope. Nope. Nein. She showed weakness by responding to the idiot’s “Pocahontas” Bait. She can’t hang.", "juleyjames": "We need Biden to get both parties to meet in the middle and Warren as VP; they need to work strategically together not against each other. The more we have to pick from the less votes each candidate gets. Biden 2020, then Warren 2024.", "blkwomannucleus": "I cannot get behind @elizabethwarren. She should have taken her shot and ran against Hillary. White women have been the most problematic and white men are not voting for liberal white women.", "cocogoneglobal": "Nooooooo", "htsweet": "@elainewelteroth 👎🏽 We need someone new and not battling old stuff (Pocahontas issue) and all! We need to make this about a new America. Like when Obama was elected.", "kates9spr": "@alliecarv", "iamalishagolden": "Hard pass over here.", "melaniejade6": "It’s exciting as a possibility, but I don’t think it’s my ideal possibility or even the one I think is most likely to succeed. I don’t know who is though.", "anthonylouisjohnson": "Don’t get me wrong, we hate Trump, but this?! Can’t wait that longer. No disrespect but I don’t have that much patience.", "bellezedere": "Wow...so much for female support.........", "lai_bak": "She’s great but she doesn’t have what it takes. White men won’t vote for her either.", "loren_z0": "She’s a great leader, understands economics, cares about the poor and the environment, and would make a great President. We are cursed with choice.", "emily_horkan": "@sammtini2", "akkleini": "Anything that pushes the conversation left and to a progressive side is fine with me. For all I care I can have 10 women up there in the primaries. better than Biden or Beto.", "mr_troupe": "I feel like she's too entrenched with the mainstays of the Democratic party, and establishment democrats ain't gonna get it done.", "leslieschor": "Nope, pass", "dawesome14": "Liz Warren is my Senator and I’m not a fan of this run. First, we put her in the senate because she’s doing a damn good job there. Second, we need a candidate to stand up to Trump that’s going to play to the mainstream. We need to remove factors of gender and race if we want him to go down. It’s not the popular answer, not the liberal opinion, but it’s the facts.", "harlem_arlene": "This is not our only hope🤔", "dotunogunbajo": "We need someone who can beat Trump in 2020 and sadly, she can’t. Highly qualified and truly has a heart for the middle class but in today’s America that doesn’t get you far. Joe Biden with a moderate/center-leaning running mate is the only viable way of getting Trump out of office.", "futurestarmj": "I want Biden/Beto or Biden/ Harris. Love Elizabeth Warren thought!!!!💙🇺🇸", "hitaylor.w": "Eh still have my money on O'Rourke/Gillium or Biden 2020.", "kimmyb24": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "jaimepsullivan\nVerified": "Verified", "niquicarter": "She’s done a lot of good especially with the consumer protection agency and I agree with a lot of her policies and she’s a smart woman but I don’t think her brand of woman will win in 2020. Even though her fights create action their is something inauthentic about her sadly.", "entree1": "White men will not save us. White women will not save us", "ibrandan": "I'm hoping + praying that @kamalaharris runs 🙏🏼", "thejeanniemai\nVerified": "Verified", "agn3s": "Yes! A legitimate contender! Finally, a candidate who (mostly) represents my values, will speak to issues I care about, is not afraid to name names and whose political concern is for benefitting the whole not just the few. Win or lose, Senator Warren’s candidacy elevates the political conversation and returns the focus to the important topics that concern the majority. 🙌🏾 #engaging", "lyndabb": "Policy matters. Elizabeth Warren brings a tremendous understanding of economic policy to any political discussion. Let’s not let the right’s dislike of her determine anything.", "this_aperture": "Love Elizabeth Warren! My preference however is for a candidate that has a strong record on more than one set of issues. I want a candidate who has been vocal and active on issues of climate change, social/racial justice, sensible gun control and foreign policy (in addition to campaign finance reform, big bank reform). A Cory Booker, a Kamala Harris or a Chris Murphy.", "mattiwarre": "@marabender1 😭🙏🎊", "christiespeaks_": "Ok to hell with all these negative comments. Just vote for whichever Democrat on the ballot is running against trump. Your pickiness and division between Bernie and Hillary is one reason why Trump won. Warren is a far cry better than Trump so if she makes it past the primary I don’t want to hear none of this snobbery and complaints. Our democracy doesn’t have the luxury to nitpick the Democratic candidates. If you have a problem with her message, join her campaign and tell her how to fix it.", "scsongbird": "I don’t think that this is a good decision. Her team needs to evaluate her platform.", "chavezbrit": "STACY ABRAMS", "alyssa_bigbee": "Nah I’m good", "troysbrooks": "And, no.", "bontracey": "I have admired her for a long time; she’s made her career about being a strong advocate for social justice, but she was pretty out of touch with her claim to Native American ancestry. I hope she’ll address that shortcoming openly and team with more knowledgeable people about racial equity.", "t2therell": "The Democrats can do better. Although the country as a whole can’t do any worse 😒", "malika_e_h": "Ugh. Is she white or native? What is convenient for her? Why can’t she get behind an amazing woman of color and support them? This woman doesn’t inspire change or creativity. We can do much better.", "ramaamosley\nVerified": "Verified", "__asiaaa": "No", "daniellecoley": "And my 2019 is already made!", "elizabeth__paul": "OH MY GODDDDDDDD @mandymarie_5 @abbyschwengler", "clarkconquers": "Honestly not thrilled", "dtnla1": "Of those who could possibly run, Elizabeth Warren May be arguably the most qualified to beat the current resident of the White House. 👏🏽👏🏽👏🏽🤞🏽", "marliyn_manroe": "Y???!!!🙄", "laurarongione": "This could be great with the right running mate - I also think @corybooker would be a better choice - but I guess time will tell.", "thebooniebreakdown": "No thanks.", "smaxxie": "She’s a great senator but I feel like she is polarizing even within the democratic base. I’d like to see who else steps up. We NEED a strong pool of contenders for the DNC and we NEED people to vote in the primary. This one is far too important for us to not put the best option in the ballot.", "callmekarrie": "🤔 I don’t think Warren would beat Trump in the general. Sad, but true. I think she’s a step in the right direction but not who the Democratic Party needs to actually win.", "grlnxtdoorisblk": "Hmm", "ohh_domo": "Ehh", "all11s_instagram": "Noooo please no", "stylisa": "YAAAASSSSS", "martha.the.scammer": "eh thank u next", "izzykaren": "Worked for her this summer. I’m not of voting age but I can say that I don’t love her platform. Doesn’t do a great job with minority outreach and she might almost be too liberal to get trump on this one. We will have to see how it goes but I’m excited to see who comes out of her exploratory committee search.", "grindandglaze": "🖤🖤🖤", "nico_pumacat": "She needs to sit down and let Kamala do her thing", "the_taylord_life": "Hard pass @t_nerese @goose_202", "sophie.eh_": "SO EXCITED !!!!!", "saraazadisf": "Not a fan. The whole I’m Native American thing and for years the Native American community telling her that saying she is because of family stories wasn’t enough and what many white Americans do to claim being Native American. For me it shows she isn’t open to council from communities of color.", "iammeltg": "Anyone is better than trump", "9twenty10": "We need diversity. I am just not sure she is it.", "iamaaronbutler": "@michelleobama #OBAMA2020", "curvygirl_chronicles": "@elainewelteroth I'm just waiting on Kamala @kamalaharris", "_aesthetixx": "I’m not here for it", "robinsacawa": "On the fence. Two years ago absolutely. Ideally we's have younger people coming to the stage like we did in the primaries, but I know 2020 is a bigger game to get the dingus' voters to vote Dem so... 🤷🏼‍♀️", "dvgalbraith": "Absolutely not. She is not the voice of the people. To me, Elizabeth Warren does not represent the future of a more progressive, accepting, and compassionate nation.", "shaylakatrice": "That’s a no.", "kaleighgurlprof": "Nope...", "_paiges_": "I 👏🏾 am 👏🏾 here 👏🏾 for 👏🏾 this👏🏾", "hernegatives": "I’d suggest reading her memoir a “A Fighting Chance” if you’d like to get a better idea of her background and her beliefs. I know that anyone can write whatever they want in a book - but I do think she’s a great candidate as far as healthcare and the economy go.", "thedetallista": "Great start. Still hopeful Beto will give it a shot too. I like her and will support her though.", "supanovaesq": "I pray she bows out quickly and doesn’t muddy the field. 👎🏾", "heauxsquared": "no thanks", "_cosmiccircus": "I don’t think she can beat the current president. 🤷🏽‍♀️", "cranberrytantrums": "Research research research", "samandersenri": "Good start, looking forward to waking up to the same news from @corybooker", "mya_lion": "🤕", "jihanjadore": "🙌🏽", "highbrowthis": "No. We need better representation that reflects all over America without question. An unyielding and uncompromising voice with fire and passion.", "theculturedpearl": "Nah.", "bellaeredita": "So we’re just gonna hand the election to Agent Orange on a platter?!", "erickaps": "No thank you.", "_enjoymyview": "No. @kamalaharris #kamala2020", "kelmarten": "Nice start but we need lots of options", "paigetheconqueror": "STFU 🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽 she is one of the few white people I still trust. Her and Bernie. That’s about it lol he better be ber VP", "vongaiofficial": "@rebeccasunnybrookfarm @unnureggerts @captainmaltby", "babyu21": "Not sure how I feel about this. I’m all for diversity but I want to ensure we pick the right person.", "carlasentme": "Oh hell yes", "alexissiriani": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "adri_saysso": "It's gonna be hard to get white American men to vote for her, they really hate white female liberals", "interloping_kamm": "Hard pass.", "blingfacemask": "Yeah Fuck yeah 👌🏾", "brownfoxx": "Let’s goooooo👏🏾👏🏾👏🏾", "jill_cimorelli\nVerified": "Verified", "_monatolbert_": "👏🏽👏🏽👏🏽👏🏽 Finally.", "jeremydante": "🖤🖤🖤🖤🖤🖤🖤🖤🖤", "annafine": "I damn near cried from happiness", "mjmf": "🎉🎉🎉🎉🎉🎉🎉🎉🎉", "brownbuddhist": "Thank the Creator!!!!!👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "michaelleewrites": "As a boring white person I’m over boring white people...and neoliberalism 🤷‍♀️", "gelycee": "My next president’s name is @kamalaharris !", "annarrclaudia": "@wintyfresh_", "fabi07a": "Ok white women, PLEASE get your ish together this time! 😒", "anadi": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "alanawrightmakeup": "She has to do better with minority outreach without pandering and articulate a true progressive platform. “I’m not like the other corporatist Democrats” won’t be enough to distinguish herself from the pack.", "xolaluna": "👀👏🏼👏🏼👏🏼", "malpaula": "OOP, OKAYY", "thesunshineson420": "I’m with her...🤣", "ashleyjohnsonca": "Love Liz, but #TeamKamala for life ♡", "kinzie0": "I JUST SCREAMED ON MY VERY QUIET TRAIN TO VANCOUVER YES!!!!", "shiralie": "@verma_abhinav", "thebunnieface": "😬🤭", "jae.dee": "Ok heardju sis"}