{"_drnadia_": "I felt the same way after watching this weekend, so disgusting and appalling that there’s still support for him/his music. My heart breaks for everyone affected 😔 thank you for posting this 💛", "mr__dc_one": "🙄🙈🔝🙃🔝🙈🙄", "_jamz_tt": "Eat more, you look like you aint eating enough ma", "chimamadu": "Please note that this is not out of support for R.Kelly. #firstthem", "katecasler": "@crissle", "lyrical_musical_genius": "It's the hood a lot of underage go with older man. Y'all throwing pedophile around but don't know the meaning it's two side of the story. And y'all dumb niggas ready to jump ship. Now they going after deceased mj", "gieannme": "YOU PPL MAKE ME SICK WITH YOUR MISGUIDED ANGER UNDER THE PRETEXT OF CARING ABOUT ANYONE. IF YOU REALLY HATE PEDOPHILIA FOCUS ON THE CATHOLIC CHURCH! PIPICKET THEIR MASS SERVICES WHERE ONLY GOD KNOWS HOW MANY LITTLE INNOCENT CHOIR BOYS ARE LIVING IN FEAR DISGUST AND SHAME BECAUSE THEY KNOW THEY WILL BE FORCED TO HAVE SEX WITH THE PRIEST AFTER MASS!!!! NO ONE IS CARING AND OUTRAGED AT HOW THOSE PRIESTS ARE SIMPLY MOVED TO ANOTHER CHURCH WHEN FOUND OUT!!! Y'ALL DON'T REALLY CARE ABOUT A PEDOPHILE GETTING AWAY! YOU WANT TO BE OUTRAGED? THEN BE OUTRAGED WHERE OUTRAGE IS OVERDUE!!! MUTE THE POWER OF THE CATHOLIC CHURCH!! SAVE LITTLE BOYS FROM RAPE AND MOLESTATION AT THE HANDS OF MEN WHO USE GOD TO SCARE THEM!!! DIRECT YOUR OUTRAGE AND DISGUST WHERE IT ACTUALLY BELONGS!!!", "cat14072018": "i live in germany..kelly want to pgive a few concerts here in my hometown. iam happy that so many german people want to boycott his concerts...hes evil ....i was shocked to hear about all what he has done to these innocent girls..think if aaliyah would still be alive today she would of be another eye whitness ..hope he will be arrested soon ..this man is very dangerous ..thank you elaine for speaking out", "_bravoa": "@lawokita", "lawokita": "Very well said!!! 😭😭", "fabulouslyerica": "Disturbing", "ilettsharon": "😢😢😢😢😢😢😢 I just never liked this singer! I deleted & threw out every single piece of his music! 🇿🇦", "beauvaisjessie": "#muterkelly #apple #applemusic #sony #rca", "tpkasi": "#Mutegillette", "dustycosta": "Amen amen amen", "miabellucci": "Depredador asqueroso 👎🏽🖕🏽", "yattaya614": "I hope you get justice. This has been my issue the entire time, why were people protecting him and turning away. This is not new news!!!!", "me_and_mines216": "I’m not saying all them girl lying but some of them not telling the truth.", "loveservice_u": "SHE GOT PAID GUD FOR DAT LIL PUSSY DNE SPENT DA MONEY UP BROKE CANT GET NOTHING ELSE TRYING TO BE RELATE TO GET ANOTHER DOLLAR CAUSE IF SHE WAS MY UNDERAGE DAUGHTER I'D KNOW WHR SHE AT!!!", "th3only.tyy": "He ain’t touch you😭", "souljedi202": "Nice pic.. @elainewelteroth", "shipp.shipp": "Wow dream always was pretty ✌🏿", "obed6403": "Shut the fuck up! Fuck you for getting r Kelly off rca. I don’t believe you and there are a lot of women and men that don’t. As soon as he gets a deal again, which he will you stupid bitch, he will be back on top. You won the battle not the war. We will always buy his albums. And you can drop dead!", "metanoia.31": "u look 18 years old. i didn't dress or no look like this at 14", "iam_selectra": "Thank you for sharing your story. We are with you!", "ginaeq_edwards": "@sarah_eq @zaynsmum 😥", "drrager": "#mutesony", "mwanamwambwa": "You look Indian omg i love the race switch up", "dayna.leee": "Bless your heart hun❤️ stay strong 🙏🏻", "ayla.catersthegreat": "Don't let this distract u from the fact that the U.S government approved 5,000+ immigration requests for visa/green cards from foreign adults who asked to bring children under the age of 18 for marriage", "shaun4482": "Lord @chrisstokes1969 needs to go to jail as well", "whatbigeyes": "🙌🏼🙌🏼🙌🏼", "hair.ballers": "💪🏾💪🏾💪🏾word up! Well said!", "dailyworldcalendar": "📆2️⃣0️⃣1️⃣9️⃣📆 📆 FREE Daily Calendar so that you won’t miss a day 📆", "damdamdidday": "Can I just say I saw you in soho house yesterday and wanted to say hi but was to enthralled by you and your hair’s MAGNIFICENT volume I just left 😩", "sairascreativecakes": "This is literally the first im hearing of this and its been going on how long?! That is not ok", "markleadam": "Oh yeah and **** any haters that defend R Kelly. They are sick and honestly don't understand their own self worth.", "getdizzy23": "As a real man saying this, some of you ladies on social media disturb me with how you defend R. Kelly. It's sick. If one of those girls were your daughters or nieces, you wouldn't have that same energy. Just like his music, sex, and money lured those girls in deep enough to brainwash them, his music has lured many of you in deep enough to brainwash you too. \"The Pied Piper\" got y'all too! SMH. If only you ladies knew your worth enough to not try to defend these men who don't.", "bellabzelle": "I too watched the documentary thinking by the grace of God that wasn't me. My heart goes out to all those women and his ex wife. If society doesn't provide a solution, then we are contributing to the PROBLEM. It is a travesty of justice!!!", "adore_elle": "Thank you for using your platform to speak out 🙌🏾", "devrage_": "#muterkelly for life!!", "drumspreist01": "????", "marychristina91": "@amanda.williams.13", "feelicia585": "Amen !", "chrismillard85": "@elainewelteroth from the bottom of my heart I’m so sorry that we were so blind for so long.", "powerofcaptainravel": "Good Afternoon Elainewelteroth. My name is Raheem Hamilton. I'm the show director of Keepin It Real Hot & Fresh on DTF radio. I'm reaching out to you to invite you onto the show.", "savvyluxe": "@elainewelteroth #muterkelly", "fanwoodhomes": "You are incredibly brave. Thank you for sharing your story. That man is a monster #muterkelly", "scottiejamesd": "Hey I've been scratching my head since 2002 when I see girls singing R Kelly or dancing to his shit. Some people just dont understand what pedophilia really is. Human trafficking can take a serious sidestep to pedophilia awareness, for crying out loud.", "summerbunny1981": "Go and fuck yourself you cunt", "alicia.in.paris": "🤮🤮 justice !!!", "teathaproduct": "Do your work 💪 you´re strong", "inpathways": "We are glade the media and people like you are shedding light on this story", "survivorjones": "Yall bitches kill me... Ain't string enough to walk out a fucking door so now the guy is the worse...yall bitches lame...try loving yurself, try take responsibility for your actions", "king.keek": "@yardiemon", "jocelynn.ricard": "@caradelevingne just gained a follower too, and I’m sure many more to come! #muteRkelly", "speakingoflisa_": "@roni_reed BINGO 🙌🏽", "randran": "👏🏾👏🏾👏🏾", "queen_og_mutha_nature": "Whatever", "kimberlysharky": "Here for this 👏🏼", "_goldenhonney": "Old looking 14 yr old", "jeffparr3000": "beautiful truth✊✊", "krhodey": "❤️❤️❤️❤️❤️❤️❤️", "iamjasminelewis": "@cassiecassandra", "elizabethjayna": "👏👏👏", "gumichew": "So beautiful with an even more beautiful mind", "debbieb__": "Omg everything here is exactly how I feel. I’m calling all of my family to talk about it because it’s haunting to think about all of this together!", "squirrellytail": "#ibelievesurvivors", "we_r_ygab": "Thank you, Elaine!! Your microphone is your weapon. #ProtectOurGirls", "theoryofgaia": "Why we follow. We are inspired by women such as yourself and @caradelevingne who have serious goals, in this case to stand with victims and go against the grain. Bravo ladies. Happy Monday!", "salliwalker": "🙏🙏🙏🙏🙏", "cookiedodirty": "And those followers that she lost she was better off without them mute r kelly ⚡️🤨", "tia_nichelle0517": "Hey @elainewelteroth i have match with you on the bumble saying that you can mentor people help them get a job with teen vogue", "_sanjastar": "🙌🏻❤️❤️❤️", "enfynyty": "I’m from Chicago and between hints about how he treated Aaliyah and whispers about him hanging around a friend’s high school, I was done with him when Jim DeRogatis broke the story of the tape years ago. Everyone I talked to was willing to overlook it. It’s a shame to see many still are. It’s sickens me to hear his music. I can’t even watch the doc.", "nikitakesh": "🙏🏼🙏🏼🙏🏼", "estlouis": "This is the exact feeling I had afterwards. It says more about the industry, society and the black community than it does about him.", "humansave_org": "👏👏👏 yes, exactly yes!!! Exploitation is a direct result of our society’s failure to protect our youth—to value them as human beings, and hold them above all else; even above our own entertainment. Thank you for shining a light on this 🔥🔥🔥 #endexploitation #protectouryouth", "attwellinnit": "Couldn’t have put it better myself 👏 it unnerving that this has been allowed to happen x", "lashandag.mua": "🙌", "petaloduran": "❤️", "josuesejour1": "💙💙", "when_antoinette_hadanattitude": "@elainewelteroth those 50k followers werent worth keeping. I dont jave that many followers but I wouldn't care. One of my dating questions is a persons opinion on R Kelly, if they support him or defend him, that person isnt worthy of my presence.", "llljoker_": "Uhmmm I would’ve tore your fine ass up", "shaniquagarvin": "It’s insane how people still protect that man. I have disowned him many moons ago. God help us all. Keep up the fight sis.", "family_matters_1": "#muterkelly", "karolyneashley": "#chills! I had a very similar reaction. It’s disgusting and beyond tragic that this wasn’t a historic documentary... it’s all still happening and all still being overlooked. @elainewelteroth how can we do more than #muterkelly but actually shut him down so that he doesn’t destroy more lives, more families, and more young women?? How??", "lalardh31": "Nope you gained a follower!!!! In disgust and shock too and I loved his music, and lately catch myself wanting to hear his voice and I think of those girls! That Could have been me, my BFF, my niece, my cousin or etc!!!! I have defn cried and Banned my son from playing: I believe I can fly on his piano or at school. I explained to both my kids that their are monsters like him who seem good.", "wine_nocheese": "Say it again🙌", "asmeretasmeret": "💪🏽", "jaguarlita": "I’m shocked so many people lost thousands of followers, thats insane and disturbing. I think someone should check all of their web browser history.", "zensamru": "💪🏽", "tmlgoleafsgowethenorth": "But you don't look like a child. You can't be calling him a pedophile", "missoliviajordan": "Couldn’t agree more, an entire industry turned a blind eye and because of that his behaviour became worse. I don’t understand the people blaming the victims or blaming their families. I’m going to assume that his streaming went up because of curiosity. I hope that this documentary is a domino affect to him ending up in prison and getting help! I hope this conversation doesn’t stop, especially in the Black community! 👏🏾👏🏾👏🏾", "thisisemilyuk": "Thank you", "missmlanei": "Wow! Didn’t recognize you!", "iliasybil": "👏👏👏", "disabilityfashionstylist": "👊🏾", "pattipatsy": "YES! The my will ALL hopefully start tumbling down! Attributing it to all these brave beautiful woman and anyone who will stand with them!!!", "houseofdotshop": "It is so sad when @bet is still playing his music", "roxinyofficial": "🙏🏽🙏🏽🙏🏽", "tiffgram_": "R. Kelly's music, his old stuff, is a classic, but it was also filth too. His music was sex...but I guess everyone thought he was doing this for women over 20...I guess not. Anyway, this man should be filed as a sex offender! 🔥", "nola.ish": "I'm with her ☝🏾", "_mskeya1_": "Fuck y’all", "the_lioness75": "👏👏👏👏👏👏👏👏👏👏👏👏", "curlyyogi": "I binged watched the doc (I wouldn’t suggest it.... It’s easier to process in parts, because it’s so disturbing). One of my take aways is, as many have said before, that if these would have been white girls then this would have ended long ago. Unfortunately, this statement has been said pointing fingers at a white run police and legal system. Saying that “they” didn’t value our young black girls. But the ugly truth is we (the black community) didn’t either. Many people from Chicago have told the stories of him frequenting the malls, high schools, McDonald’s looking for young girls and that this was well known, yet his music was still blasting on Chicago airwaves, his concerts still selling out, he was still being invited to our churches. Decades of this, countless young black bodies. And we stood by silently. But quick to defend him and place blame on the victims. How is it so difficult to not support this monster? To reject his music? A black girl is not worth the $1.29 you paid to download one of his singles? People question why they didn’t come forward earlier- why would they? We knew the stories. We shamed the victims. And we tried to hide our guilt behind “I can separate the man from the music”. Really? They are one of the same. #muterkelly #ibelievethevictims", "traceeellisross\nVerified": "Verified", "jackipenny": "❤️❤️❤️", "hismajestyjudahisvaran": "Eloquent & heartfelt call to action 🙌🏾🎯🙌🏾", "healing_awakening": "Your post made me cry. I thought I was so strong, tough, and healed. But, no. It hurts being told I'm a racist because I do not defend predators (of any race, ethnicity, national origin). In this case, defend and stand for dozens and dozens of black victims, and for some reason, that does not count one single bit. I am a \"racist\" if I don't support a predator who is black. Sickening logic. Psychopathic logic. Very hurtful. Very twisted. Very destructive.", "kellymparisi": "Thank you for lending your powerful voice to this cause. I also watched the series in disbelief...and feel energized in the activism and action from others. We collectively have the power to stop all abuse!", "lynee_anna": "#muterkelly", "lily_buttercup_larranaga": "We are with you", "tsh.nyc": "Listen. I never cared for his music then I saw that video of him with a 13 year old girl...no one cares about black girls. That's the reality and the lesson.", "aalmejo": "🙌🏽I am with you!!", "simply.aku": "Thank you 👏🏾👏🏾", "reaganangelo": "Byeeeee canceled r-yucky #timesup #muterkelly", "linnebotanicals": "We stand with you @elainewelteroth and the safety of women and girls worldwide", "caiahagel": "Thank you @elainewelteroth 🙏🏽", "isaidwhatisaidn": "Absolutely 👌🏾🙏🏾💗", "taiiidollas": "Thank you", "alexreese_cup": "period.", "michelleharrisondesign": "#bravestandandadmired!", "na7ani": "CHECK OUT AND REPOST MY R KELLY PARODY 🤪", "anitakopacz": "It was deeply disturbing to me as well. The women are so brave to share their stories.", "melspohler": "@elainewelteroth he’s a monster.", "canceledpage5221": "👏🏽👏🏽👏🏽👏🏽", "vintageroyalty": "🙌🏿", "hellovictoriav": "💜💜💜", "jmarquephoto": "Thank you for taking a stand for women! We have to lift each other up in good times and bad. 💪🏽 @caradelevigne can consider the loss of those 50K followers a cleansing!", "janeypinks": "@alloftheyes as we were just saying.... thank you @elainewelteroth 🙌", "kundalini_rebels": "Standing with you sistah xx", "kwreport": "💛💛💛💛", "erinapril80": "You have just GAINED a follower.", "btpw": "@elainewelteroth I believe the unfortunate thing about not only this situation is that also this society and generation of people Place some much value on followers of a social media account, that to lose or gain followers somehow quantifies or qualifies a person’s worth. 👎🏼😕", "estrellajrios": "Yes! So much truth! 💪🏽", "krigg1": "Interesting. Following @caradelevingne now.", "curls_controllers": "We support you, sis!", "chardonnayt": "Well said!", "mr_swamp": "😏", "homemadehudson": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "emmz_guide_to_life": "Brought me to tears. Thank you for raising awareness. We have to stand up for justice and support and protect the victims. http://www.bbc.com/future/story/20181102-why-dont-rape-and-sexual-assault-victims-come-forward", "aceisjoy": "I as well share in your discomfort and sadness. There are so many at fault for not protecting these young girls. At the same time, I thought the docuseries was biased in places where it should have been more subjective, for example mentioning that the age of consent in Illinois is 17 with no exceptions, and many of the victims interviewed were 17. This is grossly negligent and misleading, as a documentarian I can't look past it.", "kevinthomas": "Me too 🙏 ... well said", "dmoravec75": "As a victim of abuse myself I can say I was nauseated and so very sad for three days.", "ashante.nicole": "It’s disgusting that cara lost 50K while he simultaneously gained 200k since it aired. I’m sickened by some people’s reactions to this story unfolding. I sincerely hope he is brought to justice.", "cocoacentric": "🙌🏾🙌🏾🙌🏾🙌🏾🙏🏾✨♥️✨", "selasoleil": "Thank you!!!!! 🙌🏽", "yeah.itsme.tash": "PREACH!!", "itsdale213": "It’s disturbing and stand with you", "harmonyloves": "🙌🏼 This has to stop! Everyone has a voice and can speak out against this!!", "lailapettus": "#MuteRKelly", "novaesnat\nVerified": "Verified", "mixdgrlprblems": "🙌🏼🙌🏼🙌🏼", "sweetpeach1": "I echo everything you said. I have been deleting people left and right. You make jokes, you take this lightly, be gone. I don’t want to know people that don’t value these girls lives. There’s nothing funny about this. I had a friend, a young black male DJ here in Atlanta, who could have used his platform to be an ally and support, but instead he played his songs and made jokes. And I had to let him go. So disappointing. But I walked away and I made sure he knew why. It took a lot of guts to stand up and tell their stories, and I stand with those girls, 100%. Because #blackgirlsmatter I am here to listen. To learn. To support. #timesup #muterkelly", "goyastyle": "Use your influence and others should too.", "ezinnemeribe": "We can’t lose our voice over 50k humans we do not even know", "georgiadawkins": "I wish I could follow you TWICE. Well said, Elaine. Thank you.", "aislas57": "#muterkelly", "kiamaniwhitfield": "Beautiful Elaine ❤️ and yes R.Kelly is forever cancelled!", "thesunshineson420": "@elainewelteroth I feel so disgusted with the situation and with myself. I continued to listen to 12 play and TP2...even after I saw the tape! I am guilty of valuing his music more than these young girls’ lives. I was sick to my stomach after watching the documentary. I have no excuse for my behavior but I know better now.", "elledahhling": "Not “we”. Every Black person didn't \"rally around\" him. Every Black person didn't follow R. Kelly’s career nor music. ... I haven't seen the documentary.", "eyeconicbri": "@cherryd1213", "feliciatoth": "The culture of rape is deeply engrained and excused in this country. Athletes/celebrities get away with murder. As to ordinary men/students. We need to raise our boys well and girls need to be more self aware. Have you seen the film the Hunting Ground? Disturbing & yet such an important film on the subject of rape. Laws have to change in this country so that rapists think about the consequences of their actions.", "amani\nVerified": "Verified", "tiffap25": "This!! Why ANYONE was willing to work with him after finding out he married a child, is beyond me!! I was in love with Aaliyah, and could never listen to his music, because that entire situation disgusted me.", "l.a.c.e.y.a.n.n": "Can I follow you twice? Cause this just makes me love you more.", "trinettenyc": "Watching it now and am completely saddened and disgusted. He’s a fucking predator and a monster and deserves to burn in hell.", "dtnla1": "😳😳😳", "blackbty801": "I agree I refuse to support him any longer", "mz_daley": "Damn! Shade😎", "chaka1922": "Well said!!!", "thriftingyyz": "💔💔💔❤️❤️❤️", "merakimovement": "Wow!!! Go Cara and go you! 💕💥", "apaigemueller": "Thank you for speaking out!", "shesaysinspireme": "🌎💯🙏", "hairbycuba": "Really inspiring", "mshopnyc": "#lockhimup", "sprinkles__of__me": "BEAUTIFUL! Amor, muy preciosa!", "simmi_prasad_": "What can we do to help these young women leave him and help their families? I’m ready! #timesupforrkelly", "meetmyriam": "thank you for writing this. We must learn from this tragedy and protect our children. 💕💕💕", "drjay_allday": "Well you got a new follower today. Thanks for being a voice that believes in the protection of our girls.", "jadacashwilson": "Yes to this !!!", "shauntae1": "The sad part is that people knew and spoke about this back when Aliyah married/dated him. It was well know that he was absolute trash and people let it go.....", "pb_in_ak": "Such an important message.", "nola_jai": "👏🏽👏🏽👏🏽", "brandylucille": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾 HE IS A MONSTER! #MuteRKelly", "queensophiat": "👏🏼👏🏼👏🏼 we have to do better for our women and girls", "mindful_sunflower": "✊🏽✊🏽✊🏽", "ecoshaker": "Yes 🙌🏽 what an eye opening doc! The buckets in the rooms, the parents who are still broken hearted and haven’t seen their daughters💔 the whole thing is 🤢🤢🤢🤢", "gluvlyn": "Just your modern day Frankenstein...", "mileisa": "I stand with you for a reason. You’re most def not losing my daughter and I. 💜", "bigdrasin": "One thing I can’t seem to wrap my head around is the fact that even after all this has come out, how do people still go and download/stream his material, much less have access to it?!?!? When Bill Cosby stood accused...long before he was even convicted...they snatched anything connected to him out of the public eye. All networks took his reruns off the air, you couldn’t stream The Cosby show anywhere, and I believe even dvds were pulled from retail stores...so with him being a known predator, how was RK any different. I didn’t find out about the earlier stuff until he got arrested over that video tape back in the day, and I stopped listening then, and won’t listen now. I just don’t understand how we as a society can get so caught up in fame and celebrity that we not only turn a blind eye to a sickness like this, but some actually actively pursue and blindly follow these people, like nothing ever happened, or worse, like it could never happen to them. Is this all really worth selling your soul over?!? *sigh* smh #heartbreaking #praying", "rachelaschenbrandrobinson": "Hes a degenerate. Mute him forever. Anyone standing by him is willfully ignorant.", "itsestafiesta": "@tashnutella read the whole caption!", "sepia_dreams": "Not going any damn place. And anyone who does not support this. I honestly and personally would want nothing to do with them. I see myself in this photo. We need more women, period of every race and color to speak up about this. It’s happening everywhere and so many young girls and now women are reliving this horror. I asked God to make sure you get my prayers. 😘", "eatwithyahn": "@cafeconlibros_bk @iampetercooper", "lesliebwhit": "I’m with you", "saada___": "Thank you", "geelove46": "Well stated! Thanks Elaine! Just mere fact his age and maturity he used to harm young girls should be enough! Wake up People! When are we going to stop taking a blind eye to this AWFUL behavior from family, friends and celebrities! @elainewelteroth", "iamsovegas": "Thank you for standing with our girls. I'm sickened at the words coming from my contemporaries. So many are shifting blame, excusing his behaviors, and victim shaming. I stand with them, because in many ways, I am them. #muteRkelly", "beautyjunkie2012": "I threw out all his CD's I had. I can't listen to it without thinking about the young women he destroyed.", "stephanieporto": "love and respect!!", "gem_water_lover": "Agreed...❤️", "nychology": "Truth", "studiosarahhein": "Thank you for speaking up on this, and standing up for women. We have got to stop listening to a abusive artists, stop supporting them. So many people have experienced abuse from artists, and have been strong armed by them to keep our mouth shut. Thank you for using your voice. Keep using it. ♥️", "styleagogo": "You're right, we all did this by ignoring or dismissing! We haven't finished it yet but one of the recent episodes we watched he is going to court and you can hear some idiot yell 'R Kelly is innocent!' I wonder if that man has daughters now and what he thinks. I remember knowing something happened with Aaliyah and was shocked during this show to realize that the rumors that reached across the Midwest to MN were all true. Ugh", "nvc113082": "I remember her. 🤪", "fxshionxd": "Love this so disgusted with people who still support him", "alexismaia": "Thank you!", "alainamoneygarman": "Still here and recruiting more followers because of this post.", "poeticaboutjustice": "👏🏾👏🏾👏🏾", "firstgenjadel": "Yess, thank you! 👏🏿", "mysticcivic": "Thank you for using your platform to stand with women and girls who have been harmed by not only one man but a system of complicity. You may lose some followers, but you gained my support and respect, and I’m sure that is many others.", "j3ssicarabbit": "💯👏🏽 thank you for using your platform 🙌🏽🙌🏽🙌🏽", "baby_monster_pacifiers": "Women at his party this last weekend were yelling “kidnap” me or something like that. Being famous, for some, is more important without taking into consideration the real consequences. Anyone who can proudly claim “rape me” has obviously never came near to such an experience. But what’s worse is that, as women, all we need to do i believe and support each, yet some can’t even do that. #muterkelly and put him in jail!", "shondabwhite": "That’s all I kept thinking...I was like those girls at one point in my life. Just terrible. Disgusting 😭😭😭", "ecastillo.nyc": "@thegirlsroomnyc", "mrsmommymd": "You said it beautifully. 😭", "christianmcculloch": "word UP Elaine 🌟", "mia_ffxn": "Yes 👏🏽👏🏽👏🏽", "jadoreadorian": "THIS 🙏🏾 Thank you @elainewelteroth 🙏🏾💗", "val__.__erie": "And I’m with you on this one foreverrr👌💕💕👏👏❣️❣️", "candacebstyles": "I love you Elaine. I’m with you.", "jenniferbehr\nVerified": "Verified", "debmallocup": "Just wonder how many more in the industry are out there. He was the one that was caught.", "svitlaya_gs": "pure🔮", "chelsea.gentry": "Hell yes!❤️❤️❤️❤️❤️❤️❤️", "womenrtough": "#amentothat #timesup #muterkelly", "stricxl": "Thank you and just started following @caradelevingne", "ngozize": "The parents who took settlements or payments from R.Kelly didn’t valued black girls lives either. It’s a shame.", "anadi": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "denissetayde": "@elainewelteroth 🙌. Totally behind #muterkelly want to add a few more artists...What about MJ? Or Usher? Or Woody Allen? We always seem to put stars on a pedestal and “compartmentalize” the data points. Things gotta change...For their victims and to end the cycle of pain/hurt that keeps getting passed on.😢", "shantelrousseau": "Poignant words @elainewelteroth 💛", "kaygeeinn": "👏🏾👏🏾👏🏾", "stillastar": "💕", "kristinagillfood": "it's only with maturity do we realize that the beatdown our parents gave us as girls for being fast was because they knew the dangers out there", "iron_soda": "🙌🏾🙌🏾🙌🏾🙌🏾🗣🗣🗣🗣🗣", "sipsstyleandstones": "👏🏾👏🏾👏🏾", "theprinceandthep": "Amen. #mutethatMONSTER", "dkayembe": "Amen 🙌🏽🙌🏽🙌🏽", "nastassiadavis": "Amen!!!!! 🙌🏾🙌🏾🙌🏾🙌🏾", "meganlewismodel": "Absolutely agree with you! However maybe Cara lost followers because her post compared Kelly to Weinstein saying Kelly is “far worse” and that Weinstein is being investigated and kelly is not (which is not true). A lot of black people who 100% agree that Kelly is a monster are also tired of white women looking at black men one way and white men another. So maybe some people didn’t want to follow her because her comment made it seem like she has a very surface level understanding of the racial dynamics at play 🤷🏽‍♀️🤷🏽‍♀️🤷🏽‍♀️", "retroartiste": "👏👏👏", "miel1969": "His concert was sold out last week after the expose aired showing their support for this monster.", "clairenk28": "💜💜💜💜", "marindaleah": "👏👏 #muterkelly", "tiffanymchugh_": "Thank you for sharing this ❤️it’s all I can think about too. We owe black women SO much more than this . #MUTERKELLY", "katejoneslondon": "👊🏻❤️", "sgrmma": "#TimesUp 😬", "leahkirsch": "💪💪💪", "karaharis": "👏👏👏", "dylanj831": "👏salute one if the sincerest post I've ever seen on ig👏💜", "maicanyoucrazy": "Very well said 👏🏾", "cherylwrightspeaks": "Thank you for speaking up and out. #muterkelly", "kaajiieb": "Caption ❤️❤️", "ohgeezkeebs": "👏🏾👏🏾👏🏾", "erickinvisible": "❤️🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻 couldn’t agree more. just followed @caradelevingne", "manicatonaru": "14 year olds are barely teens, theyre children @elainewelteroth thank you for your words and for speaking out", "thedawnofautumnb": "I worked with 14 year old boys and girls for many years as an SLP in the school system. I can assure the naysayers that they are very much still children and nothing excuses an adult preying on them. When I stared that job, I was in my mid 20s. Some of the kids looked the same age as I was in height and facial features, but mentally they are KIDS. R. Kelly, though stunted both emotionally and intellectually, is an adult. Just because his development was arrested, doesn't mean that he shouldn't be. He needs to be incarcerated for his crime. Having the emotional and intellectual development of s preteen is not an excuse for his life-altering predatory pedophilic predilections and actions.", "reigality": "❤️❤️❤️❤️❤️❤️", "hollymercedes27": "🙌🏽", "thejessica_j": "🖤🖤🖤🖤🖤🖤🖤", "ohhellnaa_": "👏🏾👏🏾👏🏾❤️", "unconventional_woman": "All of this❗️", "oleee_cannoli": "@iamthemelaninking", "charliecoopertv": "Girl! My sentiments exactly. I’m only 1 1/2 episodes in and I’m sick to my stomach and hurt for these women in an indescribable way.", "beyondthejoboffer": "Well put💕", "krystlemdavis": "❤️❤️❤️", "esmeraldaschipper": "❤️", "tykiseparker": "I personally don't care for the RKelly situation anymore. It's too much bull shit going on with this story. Got the parents doing this. Got the child doing that. Smh it's just all over the place.", "texturegoddess": "✊🏾✊🏾✊🏾", "ewv.swap": "عتاب مر ♥", "braingains.blog": "You're an angel. People who unfollow or turn their back might not be ready to face up to that kind of pain yet. It's sickening. Keep shining x", "t4cafe": "Exactly!", "legally_londonbridges": "🙌🏾🙌🏾🙌🏾", "robynvictoriaf": "Well said. As always! #muteRkelly #ProsecuteRKelly #JailRKelly", "realazja": "💙 #muterkelly", "dthair15": "Right On ... Thanks for speaking out! #timesup #maleally ✊🏾👍🏾🙏🏾🙌🏾", "malonigoss": "🙌🏾", "laylee7": "@elainewelteroth does Dream not have an IG?", "mochapm": "Just followed @caradelevingne", "zsuzsi77": "@joannah78 I started watching this too. Chilling.", "illygull": "Lolllllll that’s the Elaine I remember! Man we rocked the hell out of that hairstyle and that lipliner !", "cindylynn_312": "I live in Chicago...the victim blaming is indescribable. I am saddened and infuriated by people who refuse to acknowledge this full grown man was allowed to prey on teenage girls....and any girls in their own families will seeing this understand if someone should take advantage of them it is their own fault. Like you said...there is too much to unpack on this platform. 💔", "katjuschka____": "now i will follow you with my fake accounts too 🙏🏽", "mercedesalonte": "Standing with you @elainewelteroth!! TY for articulating so well what so many are feeling! 🙌🏽😭", "shiffonco": "🙌🏽🙌🏽🙌🏽 Thank you for using your voice! This is powerful", "michiemichh": "Thank you Elaine.", "annmoenius": "💪🏼❤️", "lexa_charlotte": "Amen!", "lucky7design": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "heykayebyrd": "Just started following @caradelevingne And I’m in awe of the women in the documentary that spoke of the awfulness of their experiences. #BraveHealing.", "jessiezapo\nVerified": "Verified", "monytaf": "I have been at a loss for words and feeling so guilty after watching that expose. You have put into words what I couldn’t", "glamyork": "#allthewayup 👊🏽👊🏽👊🏽", "heyitsjacquelinev": "Amen! We’re not going anywhere ❤️ You have always raised your voice for vulnerable woman and this is no exception. It’s devastating to see people continue to support a man who preyed in young women so openly. These survivors courageously shared their stories and in raising their voices they have called for a shift in the music industry, and to additionally call out men in any industry that are abusing their power. No words can begin to describe the impact this film will have for future generations! Thank you for standing in unity with survivors ...we’re stronger together!#shematters", "itsaaries": "Thank you!!! 🙏🏽🙏🏽🙏🏽", "lauralongmore": "❤️this post👌🏾", "you_should_know_i": "I agree with you 100% about R Kelly, but what about the parents?? Would your parents have let you go anywhere with a KNOWN pedophile and by known pedophile, I am including Uncles, cousins and friends as well?? These people got soo caught up in celebrity and getting rich, that they sacrificed their own child. Plus 👏🏽👏🏽👏🏽, the one set of parents who said “our daughter kept THREATENING us, we had to let her go”....really!!! 🙄 Have you ever threatened your parents...me neither because I didn’t run my parents household. I was the child!! 🙄", "harryjoshhair\nVerified": "Verified", "mclaw7": "#MuteKelly #MuteChris #muteXXXtentacion young women should not be idolizing these men and their harm on women.", "vanavain": "🙌🏾", "virginhair.wholesaler.factory": "I love the way you share every day. I'm a hair factory. I can supply any hair.", "naushonyoga": "Yes. Thank you. We stand with you. #muterkelly and all the others.", "lmanningbiology": "#muterkelly Good for you for speaking up.", "8kendall": "Yes ❤️👏", "lifeofjordie": "Love you! ❤️", "sooshichacha": "@elainewelteroth beautiful", "la_beaute_alexfrancisco": "✨💖✨", "lillylouhemian": "You should look up DEMI MOORE VIDEO GIVING A LIL BOY A PASSIONATE KISS OVER AND OVER AGAIN. #expose", "theblackbandita": "Times up 🙏🏾", "christannchanell": "💯💯💯💯💯💯💯💯💯✨", "the_whittster": "I had to stop fucking with him after I read an article about 5 years ago asking why we were still supporting him. And it was a good question. One that I couldn’t answer, so I just stopped. I couldn’t separate the artist from the art when he uses a proceeds from that art to hurt people who look like me.", "mrs_fmg": "I just chose to follow @caradelevingne. Bravery should be applauded.", "glowgeometric": "@elainewelteroth I had the same response (nausea). I watched the entire series in one night. My daughter will be 11 this year & my husband & I could not fathom the thought of this horror. The thing that bothers me are the victims who didn’t come forward. Being a victim of child molestation myself, the reality that he still walks free is unfathomable. #muterkelly", "oliviaatherton": "AMEN. thank you for using your voice 🙏🏻💛", "nycaakash": "Truth is power! 🙏🏽🖤😘", "bringbackoldgucci": "Him and his supporters are disgusting. Good on you for taking a stand ❤️. May he suffer.", "ginandphonics": "We can’t talk about this without talking about drake and Millie Bobby Brown, he’s grooming her just like R Kelly groomed Aaliyah 😬", "mauve.canvas": "💯🙌🏽", "callmekarrie": "Quick scroll and I thought this was you @jillofva", "inaribriana": "Well said sis!!!", "tiffany_hardin": "YESSSSSSSSSSS", "lex__nikol": "TIMES UPPP!!!", "rlwhitakeriii": "*starts following @caradelevingne *", "jfotang": "But while we’re at it, let’s have a whole revamping of the whole entertainment industry because my spirit is not sitting well with the folllow up commentary made by several celebrities in response to those doc. @elainewelteroth", "analiselejeune": "Love love love this so much ✨ thank you for using your platform to talk about and honor survivors", "farahpink": "Amen", "sel_hudson": "Omg 💘", "jv_n": "👏🏿👏🏿", "secretagentm": "Times up #muterkrelly #nomoresilence", "skysthelimitrjd": "👏🏽👏🏽👏🏽", "x__veronika__x": "❤️❤️❤️❤️", "gemsgirls": "✊🏾", "elainewelteroth\nVerified": "Verified", "buymechanel": "👏🏾👏🏾👏🏾 thank u Elaine", "corporate_barbie": "Amen to that. Very well said E. Mute that monster!!", "victoria_akkari": "I muted him from the beginning. No tolerance.", "fortheones_": "A queen. We’re not going anywhere ❤️", "sungodsofficial": "We are standing with you!!! #muterkelly", "greenmel4": "❤️", "manuellabilliault": "🙏🏾🙏🏾"}