{"iamsarahjohnson": "Hal.le.lu.jah👏", "swiftmusicfan": "I agree!! 🙌🙌", "michellereyna": "🙌🏽", "shayla.walker30": "Hey girl hey! Well you know where we started in our Magazine writing class at sac state being the only two black women in class. We instantly clicked! I am so proud to see you blossom and shine! I'm the Director over Student activities at San Joaquin Delta College and last week opened up a food pantry on campus to address food insecurity of students. Hard work takes sacrifice, but I want you to know how much of an inspiration you are to me and I am blessed to have met such an amazing human being in college. Thank you Elaine for your positive words and being an advocate for the black community and women ❤️", "haileylucillerichard": "😂 yikes how much have you disgustingly tops yourself this 😂", "kathyroseobrien": "Yes 100% to this! 🥳 Integrity, peace within is simply immeasurable & never quantifiable. But is always just within reach & is always nearby, waiting for you to reach out. 💕", "luzhandwoven": "💯 For real!", "lucynavarrom": "👏", "mushkoh": "@archit_bhat Balotelli, Borini, Lambert", "12degreess": "@girleatfood this is for both of us", "girleatfood": "@12degreess I believe in us. We don’t cheat the game. Because we don’t cheat ourselves. 💪🏻", "lisamerkledesign": "🙂🙏👏Beautiful", "myk_saynt": "💯", "sauziermichelle": "Love this!!", "alltydup14": "100% felt this in my soul! 🙌🏽🙏🏽#SacState", "ber_amos": "🙌🏽🙌🏽🙌🏽", "cuccumia": "❤️⚡️⚡️⚡️⚡️", "i__amrenee": "❤️", "keyerramadeline": "🙌🙌", "alfred_tumblin": "❤️💫", "life_as_reeta": "🙌🏽🙌🏽🔥", "omandyx": "Amen amen amen. I always wanna see ppl thrive ❤️", "msmakali": "Man oh man!", "brandbycollette": "👏🏿👏🏿👏🏿Love this!", "ayahalbareedi": "@sawsan_alhawly", "tgcastellano": "LOVE THIS !", "corbittchandler": "Love it", "ettabeautifulsoul": "Amen @elainewelteroth Amen👏👏👏", "ohheyronnie": "All of this ❤️👏🏾👏🏾", "ashleydiorthomas": "#sacstate MY Harvard.", "kamilahf": "Laaawwwwwddddd", "vedazzling": "@nyccaldwell", "sheenshines": "BOOM. 👊🏽", "thesettingnyc": "YES❣️❣️❣️❣️❣️❣️❣️", "tinatenaansah": "Amen! ❤️", "mayamayathebee": "❤", "liathexton": "Yess!", "harryjoshhair\nVerified": "Verified", "thebees_knees92": "🙌🏾🙌🏾🙌🏾🙌🏾", "mrsbrittanyhennessy": "Tell it!!! State school grad. Go RU!", "themisterdarling": "This. Today🙌🏻✨", "nali.elisa": "🗣period!!", "landrine_n": "@ami1_therunner", "roberttremaine": "Word 💯", "nikitaswilson": "FACTS!!!", "bettinamicheli": "I am curious now, What did YOU loose in you loosing season? How was it? What happened?", "imentororg": "We couldn’t agree more! Thanks for using your platform to bring awareness to the issues first generation students face. You are role model to many of our mentees!", "ceedub24": "I absolutely this! Another first generation uni student & foster kid at the time I wanted Northwestern but was getting financial assistance at @illinois1867 so I went there. So happy I did! Went on to a masters degree, and an international #MBA curtesy of @the_fulbright_program Those first months I felt like I didn’t belong at uni, and the same happened every time I got to a new program until it finally clicked for me...of course I was smart enough & good enough, because I couldn’t buy my way in, all I had was my brain and my ❤️!! Thanks for being such an excellent role model ❣️", "denisetuyilife": "😍😍😍😍😘😘😘😘😘👌🏽💪🏽👏🏽✍🏽", "valillama": "Yessss", "theflowcoach": "TRUE STORY!!!", "heritageoflibya": "Indeed 👌", "stephenswang": "🗣", "manav_brad_g": "🙌🏻", "lacroixsoverboys": "HONEY YES", "goldenboy_oropeza": "👌👌👌", "lunaleigh83": "Yaassss!", "sisterbeige": "🙌🏽", "theamericae": "🙌🏼💥💥", "rballin": "Amen!", "queen_styles_boutique": "Amen!", "ari_pedret": "YES!! ❤️", "lethaborapoo": "🖤", "_miss_cori": "You are such an inspiration!! I took a class with Professor Foss back in 2013 and she was talking to me about how you were an amazing student and an overall phenomenal person. Since then, you have been one of my role models! Thank you for being YOU!", "saraazadisf": "Amen!!!! 👏🏽👏🏽👏🏽👏🏽", "pasavery": "Yes!! Keep your integrity at all cost and persevere. Success can be had.👏🏼👏🏼👏🏼", "jabarionthebeat": "💯💯💯", "noirecarrieb": "#Preach it Sister Elaine! 🙌🏿🙌🏿🙌🏿🙌🏿", "wanderluster37": "❤️🙌🏿💯🔥", "photosbydutch": "ONE TO GROWN ON🚨🚨🚨", "ellenmariebennett\nVerified": "Verified", "telshaanderson": "Valid", "lamour.de.la.vie": "Ain't that it", "ferrahofficial": "🙌🙌🙌", "122346788g_5": "🖨", "brieachanel": "Man look!", "quickfish": "😍", "adriennewrites": "This is a strong word @elainewelteroth #perfection", "chenoamaxwell\nVerified": "Verified", "adoreville": "Dat pawt", "lifestyle_her": "This right #Repost🙌🙌🙌🙌🙌", "sybil_amuti": "👏🏽👏🏽👏🏽👏🏽", "shayfraz": "Elaine. We went to sac state at the same time. I’ve been watching your journey and you’ve been an inspiration. Even though you didn’t go to Ivy League, look at what you’ve done!!!! Nothing short of amazing. Again, your journey has been my motivation during my daily grind. Thank you.", "sofiecalderon21": "Love this thread @elainewelteroth", "schwarzfahrenfuergerechtigkeit": "Thanks! 💪😎💕", "primroseandcompany": "This is schooling at its best . Preach it ! Love all of this", "cierra_branee": "Periodt! God done brought me a LONG way!", "charlotteabetts": "!!!!!!!!!!!!!!", "hannahs_hands": "Very proud of my college freshman who was born with physical challenges and is confined to using a wheelchair BUT has BUSTED HER BUTT and graduated with a 4.0 GPA, inducted into the NSHSS, recognized ceremoniously as a STATE SCHOLAR and has EARNED a few academic scholarships despite being born with a severe physical condition. Knocking down all kinds of stereotypes. She is the only one at her college now rolling around in s wheelchair and doesn’t let any of the “stares” phase her. Her strong work ethnic and go-getter move out my way attitude speaks for itself. I work three jobs to ensure the remaining college balance is paid each month. Proud MAMA here. Thanks for this very encouraging post @elainewelteroth 👊🏽", "southerngent511": "I'm here for allllll of this message!!!🙌🙌🙌🙌🙌🙌🔥🔥🔥🔥", "mrsmerriman": "🙌🏽", "lauraksawyier": "Thank you for sharing. I was kicked out at 15 and again at 19 by each divorced parent. Graduated college early to help reduce my student loan draw. Lived on friends couches, shared their beds, until I finally moved into an apartment in nyc that illegally housed four people. My mattresses placed on the floor before a friend of mine gave me their old bed frame when they were getting a new one. People in my life told me they’re we’re worried that I would fail, but really, I was feeding my dream of living in nyc and working my way up at a design firm, fulfilling my creative passion that was mildly stifled by my stepparent choosing my college and telling me to study business (which I changed). Then I moved to another city to be with the man I would later marry, try to continue that career, but then made a choice to pivot into fashion styling because I so passionately loved this industry and wanted to explore the powers and impact of helping women dress to feel their best. To light up my dream and push to grow. To help other women seek and find their own power within that I found and continue to tune on my own journey. And now, all of that is yielding growth and pride. The resentment is reduced to nothing, that once overwhelmed my spirit. Integrity and perseverance keep me pointed to my North Star, as does reading other people’s stories about their own journeys. ♥️", "evolifashiongroup": "Amen!", "majorfactor7077": "🤣💯🌹💖🤗😍", "apurva_18": "Thank you for this reminder!", "stevie_elem": "SIS! YES! ♥️", "lifebyjaynee": "Amen!!", "elleosei": "I was just saying this. Must be in the name🙌🏾", "shesabammamajamma": "Messssageeee 🗣", "patisserielefildariane": "♥️♥️♥️", "emsladedmondson": "👌🏾", "preciate.app": "Focus on the positive - and good always comes to you. Jealousy is focusing on the negative in yourself. Whatever you focus on, GROWS! Support others and the whole tide rises!", "quanasia.graham": "🙌🏾🙏🏾💫", "qboroj": "🙌🏽 This!", "moiselle_de_zoe": "👑🌬🌊", "nadiabsaleh": "🙌🏻 💕 this", "dawannawilliams": "🌟🌟🌟 And the part “ALREADY disproportionately favor them” #integrityalways", "becomingdr.b": "🙌🏾🙌🏾🙌🏾", "thehoehub": "❤️❤️❤️❤️❤️", "iamalishagolden": "Girlllll 👏talk 👏about 👏it", "_mariemaile": "@_laprimaaa", "feibz": "A real WORD!!!!", "therlhastings": "Preach!", "imryiahsmom": "🗝🗝🗝🗝🏆", "alyssabakertv": "I relate to this on every. single. level 😭🙌🏼🖤👏🏼 thank you 🙏🏼", "freddieharrel\nVerified": "Verified", "torerageorge": "Yesssss 🙌🏾", "nourakhalill": "Amen", "dorinetine": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "theothersambaker\nVerified": "Verified", "daryltillmanphotography": "@elainewelteroth, I got my final grade for my last class in MBA PROGRAM from St. John's University, and I'm happy to announce that I will be GRADUATING IN MAY!!!", "ninayamminn": "Love thiss", "marinaleightatelier": "@human_thrope", "lolawantsaccess": "Thank you for telling yours 🤗", "fimidabira": "Thanks for this words", "driacole": "🔥", "iamcjcarter": "🙌🏾🙌🏾🙌🏾", "glamobserver": "🙌🏻🙌🏻♥️♥️♥️", "sophie_apollonia": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "shawkatabdullah104": "Yesterday Taught World, Today Caught !!!", "cest.paola": "Word. Thank you for this man.", "___himanshu_13__": "The True Fact", "_karladavis": "👏🏾👏🏾👏🏾👏🏾", "huryahmadi": "❤️❤️❤️", "misskeri_g": "♥️♥️", "lexiefelderman": "👏🏼👏🏼👏🏼", "grace.mcculloquin": "Still in my losing season- waiting for that winning streak 💫", "matrixmel": "You rock🙌🏾🙌🏾🙌🏾", "backtobasics_shop": "Preach! 🙌🏼🙌🏼💕❤️", "nur_ceramics": "Thank you for this! Deeeep in the grind of chasing my vision and was in a place of fear and doubt as you get from time to time. Needed this!!", "elizabethmclane": "This is what I needed", "mrsbmw007": "Yas to this!! @csusb", "ashakai.e": "Who care what they lost lol just be happy for people", "fleurs": "☝🏼", "nationalcleanwatercollective": "FULL 💯💯💯!!!", "keenandwilliams": "This one right here (💎✅💎✅💎✅)", "wiltwuan": "🙌🏾♥️", "e.rk.a.mac": "Amen!!🙏🏽🙏🏽🙏🏽", "blurrybethie": "BOOM🔥", "dmsweitzer": "🙌🏽❤️", "kameyb": "✔️✔️✔️✔️", "lizbit3": "Wow this hits home. Not only was I a first generation college student my parents were also 1 gen Americans and blue collar and completely new to the whole college process. I had a lot of setbacks but I was able to graduate and am the first of my fam to work in corporate America. I was hungry and motivated to climb up and I’m glad I can say I did it without compromising my morals or integrity. Just makes me more proud of my accomplishments and of my fam for getting me here.", "allshewrotenotes": "Needed to hear every word of this today! Thank you so much for sharing", "the_natalie_marshall": "Yes! These last two years have been rough! When I say I was out on my ass I mean that literally. Sleeping wherever my friends would let me. Eating whatever I could find. Who would have thought I’d be starting my own business, investing, and growing as a person. Trust. The. Process. ❤️❤️❤️", "imastabile": "Truth", "carolinethehoff": "🙌🏻🙌🏻🙌🏻 Proud University of Texas Longhorn. Television Executive. #hookem 🤘🏻🐂 Not to mention my state school attending friends who are killing it in their fields @megansenior @take_a_chance_on_e @shannonmariehoward @katie.krentz @texascarlindc @abaiers @andykane11", "nppaez": "@mena_milena_ @mayelypaez Go CSUS!!!💚💛💚💛", "bergerbabble": "Real talk", "civicengagejd": "UMass Amherst, first generation.👋 I got an amazing education that I could afford. 🤗 I was also surrounded by other first generation students so I did not feel alone. I wouldn't trade my experience for any other.", "heyrashe": "🙌🏾", "trae_bien": "Amen!👍🏾", "gina_cheatham": "Thank you...Say It Again 🙌🏽", "csvlovesupreme": "Amen.", "bythedawnss": "Come on now and say👏this👏word👏. I say Come On NOW! 🙌🙌🙌 #instashout", "kurtainkurtain": "♥️", "laurenkahnk3": "@universityatbuffalo alum right here 🤟🏼", "kenapeay": "Say 👏🏾 it 👏🏾 again👏🏾!!!!!!!!!! ❤️❤️❤️", "andrewster_art": "This just made me cry. Thank you so much x", "zuriadele\nVerified": "Verified", "larissapuente": "@shanaeb_ figured you might like this one", "shantinialleynebeauty": "🙌🏾🙌🏾🙌🏾", "focusdriven": "Repost 🙌", "lajoiesandra": "Amen! 👏🙏🏾", "taiwo.ade": "Say it again for the folks in the back", "1in_tang": "❤️", "fabi_frizzo": "@li_martinsr", "korinaemmerich": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "lifeinreverie": "👏🏽", "mtcgirlknm": "❤️", "shop_thebeehive": "🧡", "abigail._g": "❤️❤️❤️", "valier_means": "I like this!", "cosmorgpolitan": "State college alum who didn’t get in Columbia, UPenn or Princeton 🙋🏾‍♀️", "princeofviana": "🙏🏼🙏🏼🙏🏼🙏🏼", "hkristenlong": "🙏🏻🙏🏻", "cg_bgp": "Girl! 👏🏾", "janetphifer": "🙏❤💝💟", "malaikaiyok": "No state college, community college marketing major, lots of hand on experiences, fashion business program certificates, non stop learning anywhere I can get it, and drive to move mountains has gotten me to invest in a store front at age 22 in my city to be the merchandiser and media marketing for this new urban clothing store! Networking my a** off and meeting loads of photographers to begin my styling portfolio. Only more to come greatly inspired by woman like you in the fashion industry, brilliant and authenticly to you! In my end all went I get back from all my hard work, I’ll definitely be giving back better opportunities for my city.💛 #workinprogress", "creativesoulphoto\nVerified": "Verified", "iamromeyroe": "❤️❤️❤️❤️", "katkeim": "Well said!!! Proud Ohio University alumnus. Would not trade my state university degree for anything.", "achearedd": "👊🏽🔥👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾🙌🙌🙌💥", "marcellenastyles": "Speak!", "air_repairskin": "💯👍🏻🙏🏻😘💕", "heatherhud_": "I love this SO much and every damn ounce of it is true!! I for one am sooo happy you went to a state college! 😉😘💗💪🏼", "shirleymcalpine_": "Thank you for speaking this truth.", "jilldemling\nVerified": "Verified", "fataah": "Wow - yes!", "jessicaoler": "SF State ✊🏾", "jwesx": "It’s never a losing season if your learning", "adelleplaton": "thank you. just... thank you.", "thereal_helena": "This! 🙌🏾🙌🏾🙌🏾", "thewitchgoddess": "I needed this. Yes. 💫"}