{"janafak_collection": "This one is awsm", "rhageinacage": "So much truth though! ❤️👏🏼", "tasmaniansaxattack": "🙌🏼🙌🏼🙌🏼", "journeykake": "Experiencing life at your own pace is do important. Put away childish thoughts of \"I might miss something\"", "avaraiin\nVerified": "Verified", "madisonghent": "Great story. 👍 Awesome outfit. ❤️", "flickeria_kirk": "Gurl I don't know what you are saying but your Coachellafit and handholding moment is epic summer romantic.🎈🎈🎈🎈🎈🎈🎈", "dear_mrs_sandron": "You look awesome", "rhondaelizabeth521": "👍🏾👍🏾", "fashionchahlemge": "🖤Très sympa, j'adore la tenue 🖤", "keashamichelle": "💖💖💖 Keasha's Perfect Dress on Aspire T.V. Saturdays @ 10am Bringing you love & laughter 💖 www.beautifulbridalwithkeasha.com💖💖💖💖", "mehy1234": "حبيبي خيرا على السلامة يا عم انت مش ناقصه من غير علم الاجتماع", "j_w_c_intheplace2be": "I just love this photo!", "chiamaka.y.a": "New Facebook group for young ethnic Americans ❤️❤️ join if you vibe with it :) https://m.facebook.com/groups/817375031951075", "soapoperaco": "https://www.etsy.com/shop/JdbReena?ref=search_shop_redirect", "itsyvesdarling": "I remember this post from back then. Your style won me over. I remember thinking “I wonder if she styled her look specifically around these #badass shades.” The look is completely relaxed yet there’s something aesthetically elegant about it #casualregal #regalcasual", "4everjasminee": "I need the hair growth Secret because that’s A LOT in just 1 year!! 😍😍😍😍", "creginaball": "❤️", "seestarr": "Law&Order reruns.. Hands down. All day. 😌", "iamsashapierina": "Me and my boyfriend watched the movie Hall Pass while we were in the Bahamas and I never laughed so hard before around him we had so much fun lol...But I know exactly what you mean. It just felt right.", "nina.mosley.1997": "Loveee your hair in this pic!!", "semuchrist": "Im.better", "hermance_lariss": "💖💖", "corinnawilliams": "💯", "yunique.yunique": "Feeels all the way", "alltheprettybirdsofficial": "💗💗💗💗", "alfred_tumblin": "❤️💫", "eagiftglobal_": "🎁 Make your loved ones happy 🛒 You can shop from our Amazon store. 🔍 www.amazon.com search : EA Gift Global 🔥 🔥 www.eagiftglobal. com 🔥 🔥", "itsvanessaceballos": "I do 1000%. I love this because I go through this all the time. Friends not understanding that standing still and enjoying your peace is such a blessing. You can actually take in what’s going on around you and in you. 🌸", "queeny_does_it": "What’s the secret to this wonderful hair growth???!!! It was beautiful then and it’s beautiful now!😍", "stephemcneal\nVerified": "Verified", "forward__space\nVerified": "Verified", "kikwetucoffee": "YAASSS @elainewelteroth ... We're still awaiting the perfect time to relive #homecoming... Excited that the Couch VIP section is reserved to be used at our leisure!💃🏽🕺🏽", "goodbadbadgreat": "I remember watching Abel and Kanye on YouTube stream in accra", "lorraineleynes": "@allisterlo isn’t he your friend from high school?! Now I am 2 degrees of separation from this amazing woman! Pre-ordered your book, @elainewelteroth! Can’t wait to read it! 💕", "ivorella": "@lizabethmarie we need the shorts!", "trina_mcwilliams": "In right there with you ! Love it", "doczhazha": "Get into this JOMO (joy of missing out)!", "thequeenofthecomeback": "👏", "degua": "Girl. 🙋🏾‍♀️", "bedaringbefree": "💕", "anwilsonnn": "✨", "lisboneleanor": "Watched it yesterday from my couch while folding clothes....then went on a picnic! #stillness", "michelleharrisondesign": "Oh yes !👍👍👍", "parkermagicmarker": "🙋🏾‍♀️✨", "thebluntbohemian": "Definitely with you! I was about to hang out. Went home, about to watch Homecoming, and prepare for my week. Priorities are important and so is listening to your spirit! ❤️", "walker_illustration": "DM ME IF YOU NEED 🎨🎨 LOGO, 🔥 CARTOON GRAPHICS (PERSONAL/FAMILY ) ,🔥 COVER ART , 🔥FLYER, 🔥 BUSINESS CARD, 🔥 ANIMATED VIDEO, 🔥 PODCAST, AND ANY DIGITAL RELATED ART 💯🎨🔥💯🎨🔥💯🎨🔥💯🎨🔥💯🎨🔥", "melbafarq": "😍😍😍‼️Love the hair ‼️", "eriksson_britt": "🙌🏻", "madamehighst": "Well said. It takes a level of maturity, self confidence even and self worth to just step out sometimes and do you. That's self resilience, the reboot that nourishes your soul. Enjoy. ☀ 😁", "eventangel26": "💖😇💖", "pinkrida": "Unmatched!", "thebeautyfulwoman": "💯🙌❤️", "apexfr2": "@elainewelteroth 🙏🏾☮️🙏🏾 : 💪🏾❤️", "ihavethisthingformoments": "Beautiful picture❤️❤️👏", "ebbs1992": "Them legs 🦵🏾😍😍🥰", "kylehagler\nVerified": "Verified", "iamnatashawilliams": "I totally enjoyed Beychella from my couch!", "cameroninsaratoga": "Hi. Our country is being attacked through bombs today and its still happening. Churches n apartments are destroyed. Please pray for my country Sri Lanka !! 😭❤️ I’m spreading this because our country needs all of your help", "americanbeauties626": "👌🏽👌🏽", "angmusicpromo": "@IamAshleyMusic This!☝🏽❤️MG", "fayeyoingco": "💯💯💯", "csevolutionofstyle": "Absolutely relatable. Protect your peace at all costs!💕 @elainewelteroth", "abyah": "So much yes to this", "ashe.raya": "I feel this so hard ♥️", "lovelyladylocs": "Great reflection. 🙆🏾‍♀️Energy conservation is key.", "erinelenagallagher": "Me at sxsw but w golden girls 👍🏼", "hannahs_hands": "👊🏽 @queenhannah_forever you’ll ❤️ the ending of this post.", "mrsneidra": "Maaaaaaaaan this here!!!!!!! A resounding YAAASSSSSS 😔😊", "xavier.rernard": "Yo! This was truly a message 🙌🏾🙏🏾 #SelfCare must is taking control of your time", "hellotracyfisher": "I know what you mean. Me too!!!💛", "charmainemerson": "OMG!! @elainewelteroth Yourhaircut looks FANTASTIC! #seriouslygorgeous", "your_next_pr": "LOVE YOUR ENERGY @elainewelteroth", "bhellabell": "This is the first year of my adult life that I don't wish I was at Coachella and! I have been completely unphased by it since January. The disappointment in not spending my birthday weekend there (first weekend of beychella last year) may continue to sting for some years as I TOLD THESE FOLK \"thas all I want all YEAR,\" lol. If I had better practiced self care through fall 2017 and winter 2017/18 I could have made it! Wellness begins 100% within and we cannot expect others to care for us at all, especially when we don't exhibit how it's meant to be done. THIS YEAR I spent my bday at the ER dentist having a root canal flushed which held Zero Excitement, as my friend Noted, but I knew that Long Term, it was my best choice and today I am happy for it. Congratulations on taking time for you, your joy and not being held captive by society's perspective of what that should look like to you or how you're meant to feel as you pursue such necessities for yourself. Kudos for having the strength, presence and wherewithal to share your lessons on your platform-- those inches, though. 😘 YASSSSS, ELAINE!💓🎉 #SisGotAStrongGrowthGame 💫🎍🙏🏾", "_golden_peach_": "Yesssss! I love this, it’s so relatable. As a new mom I’ve also experienced the fomo and have recently reflected realizing that in trying to do everything it takes away from my current experiences. This serves as a reminder. And yes to those inches! I just love your hair ❤️🥰 Thinking about coloring soon myself ☺️", "pearlsandtimberlands": "Totally relatable. My mom and I flew to Hawaii and stayed in the resort for 2 days binge watching Summerland lol. We had so much fun.", "selasoleil": "♥️♥️♥️", "_pretty.nikki": "I have that same shirt!! 😊😊💜💜", "kait.hurley": "You guys are 🔥So true. Stillness and quiet are my essentials too.", "tellyhercastle": "Yes 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "tabsterrrrrrrr": "Just went and got snacks to re watch", "backtobasics_shop": "💯💯💯 Resonate with this like whoah!", "katarina_galvis": "THIS! Energy conservation is something I’ve been trying to work on. FOMO is real and it takes away from what’s important: peace of mind and focusing on the self.", "kendallforward\nVerified": "Verified", "zifaco": "\"..that's simply what joy felt like in the moment..\" following your joy leads to good places and good things 👌💕🌟💎", "ep_venus": "Ur not alone on this @elainewelteroth that's what advertising is about #fomo im over it. I make my own decisions not ad executives. 😆😉😊💖", "sylenbkay": "Me!", "napptural_nubi": "#Facts of life.", "kifayate": "I learned to make peace with quietness at a very young age. It continues to serve and sometimes save me 😍❤️😍", "fateish": "🙋🏾‍♀️ Felt it all.", "vidafashionista": "Y’all are too cute", "katlatti": "I have learned that taking time for myself makes me better. Prayer, nails, quiet time..what it is..it’s so needed. Do You.", "kellymullensbrown": "🙏❤️", "texturegoddess": "🙋🏾‍♀️", "brewwknee": "@nadialopezzz_ tropicalisa vibes", "trangadatrinh": "So relatable’", "lynnbroomeramsey": "🙌🙌🙌🙌🙌🙌", "agentlme": "I am so with you! I am laughing because you described me to a tee! 🙋🏿‍♀️", "kesaine": "Just finished watching from the VIP section of my couch lol.", "carlosluizdasil7": "Show", "rochelle_nicole2": "can so relate to this!!", "isolde_brielmaier": "Yup! Right here on the sofa🌟🌟🙌🏾🙌🏾💪🏾", "bri_ned": "This is me right now. Made pancakes and settled in. 💁🏾‍♀️", "dtnla1": "🙌🏽🙌🏽🙌🏽", "gladyssparks31": "Thank you for your transparency it is a true blessing .... today is my Birthday and I am trying to relax and enjoy. 😉Thank you for the grounding wire.", "britta.steilmann": "Bravo 👍🏼", "rozwhy": "🙌🏽🙌🏽🙌🏽", "kwatersggi": "Y’all cute", "simdenise_": "The caption @calliemaraus", "camillajacappel_jwlry": "⚡️⚡️💗💗", "queen_losangeles": "Couchella is Lit 💖", "theblakcaviar": "Love the hair🔥", "raisingself": "Y’all are too cute", "tisamhoward": "✊🏾❤️💯", "nastassiadavis": "Love this. Beautiful! ❤️", "amoderncrease": "Yesss sis I feel you!!! 2015 was my last Coachella too and it was the last straw. Been #Homecoming every night since the drop!", "queercomedian": "what a babe!", "kristenbliss": "All the time. I used to think of myself as a flake or ghosting maven for constantly behaving this way. Appreciate that you’ve articulated it so well and positively.", "ttarahaynes": "This is my church!!", "kimmiwoo456": "👏🏾👏🏾👏🏾", "rjthorpee": "Energy conservation!!!! Oh that’s a very big one!!!!!!!!", "vuamarie": "#whitespace 👏🏽👏🏽👏🏽", "jsybylla": "Watched it last eve - B rules❣️", "itsjenniferrose": "I can so relate to this. ✨", "stylexangie": "🙏🏽 Amen!", "waraire___\nVerified": "Verified", "lrbnyc": "Girl, I’m watching it for the SECOND time, then I’ll go back to bingeing the rest of “Succession” because I’m late to that party.", "theblkguynextdoor": "SAME!!!! (and by SAME, I mean all the Beyoncé parts of this post)", "lifeofjordie": "I looove this cut on you 😍", "brgani": "💚💚💚", "tracelysette\nVerified": "Verified", "__kellyrenee": "Legggggggs!!!! 🙌🏽", "taraamackey\nVerified": "Verified", "multicoloreparis": "I feel you although I never set foot @coachella 😂", "ranger_up": "Whew play mom & dad", "bertiesbeauty": "❤️🙋🏽‍♀️", "stefanybaclaan": "🙏🏽", "dirtymilk": "😉", "raebk": "You don't think it sounds super privileged to have tickets to Coachella and just not go? Many of us can't afford hotel stays just to stay in and watch Law and Order. Also, most of us get so little vacation time when we do we don't spend it watching reruns. Must be really nice to be you. This post strikes me as incredibly tone deaf.", "iamaswann": "My couch is soooooo VIP section for me. Forever and always. 🙌🏽", "ms.danielle_thanks": "C'mon VIP couch lol. So true through. Being present > fomo can be so hard", "jasongainesjr": "🙌🏾🙌🏾🙌🏾", "erikanperry": "🙌🏽❤️✨", "sisterhoodculture": "This FEMICIDE SURVIVOR, activist, Inspirational speaker, Sisterhood specialist IS LOOKING FOR ALLIES. Show some luv 👭🏾 SUPPORT AND FOLLOW!", "adria.dria": "Look at Dem Legs!! 🔥", "gigi673": "Self care and reflection is essential. Need to watch Homecoming!", "moniquelissette": "Seriously tho? I need to show this pic to my hairstylist. #hairgoals", "vernettajenkinstv": "We’re supposed to go to a friends but really wanna stay home & watch @beyonce #homecoming❣️🤣😂", "popularsociety": "Daaaaaaaaamn @elainewelteroth 🔥😍✨", "popedworld": "Okay can we talk about these shorts tho?!!!", "programmergirl": "😍❤️", "amplifeu": "The beauty of life is spontaneously embracing the unplanned spices of living. As the delicious delectable delight simmers into the moment to marinade you soul everlasting to forever. 💙💜💚🌹", "ike_morgan": "I totally feel where you're coming from💯✊#reflection", "imwhitneyprath": "Same. Didn’t even know it Coachella again.", "kohenelizabeth": "#Beychella🔥🔥🔥🔥🔥🔥", "charliecoopertv": "Loooove this pic😍❤️🔥", "altonprincess": "I love you and how your share your growth with us, me, a complete stranger 💛", "hammonacuna": "Shared this with my daughter with hopes she grows up with strength, wisdom and power #rolemodel #daughtergoals", "michele.bradley72682018": "👏🏾👏🏾👏🏾👍🏽", "la_cloms": "🙋🏽‍♀️", "talithawatkins": "Such a responsible share, sis. No is a complete sentence... no explanation necessary 🙌🏾", "kendrasellstampa": "This pic was my hair insp for when I cut my hair! Seeing this on my TL almost exactly a year later has made think of the growth that has occurred for me too! Next step is maybe giving me some hair dying inspo lol thank you", "natalie.namaste": "🙏🏾", "dancinivy": "Felt. Very felt.", "alebutton": "Don’t feel you. I love festivals and wouldn’t spend money to go and end up staying in my hotel", "ladyeeboutique": "Soo cute 😍😍😍", "tomiicrump": "❤️❤️❤️❤️❤️", "christinaware": "❤️all of it!", "nijaahdarling": "This. Is. So. Necessary. 💕", "kkd1908": "🙋🏾‍♀️🙋🏾‍♀️🙋🏾‍♀️", "carriejk1": "I’m 44 and I am just starting to really understand this.", "tampash": "🙋🏽‍♀️", "eden_myrrh": "😍😍😍😍😍🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "kevinoriris": "🙌😊💖 such wise contemplation", "shespokemakeup\nVerified": "Verified", "becauseimelise": "100%!", "severine_p": "This is so relatable. Sipping on my coffee, nice and quiet, as we speak. Energy conservation is a segway to happiness.", "graffiti.collective": "You are so inspiring 🖤", "loveimanb": "👌🏾👌🏾👌🏾", "instalaurenelizabeth": "😍", "jaynewyork": "I am all fur this realness. I get this!", "youwantdwana": "💯 Sis! 🙋🏾‍♀️", "naturalcreola": "👏🏾👏🏾👏🏾", "vanessajamesmedia": "Feel you on this wholeheartedly... it’s a great feeling coming into your own. The best feeling.", "jamilksmith": "I would take a class on this", "societeurbane": "100", "jennalyonsnyc\nVerified": "Verified", "williamson\nVerified": "Verified", "itcouldallbesosimpl3": "You look bomb 💣 ❤️❤️", "wifeynmommyluv": "Girrlllllllllllll you look hot 🔥", "nofurtherintroduction": "So real and so on time", "angel_rvd": "I just did my #beychella homecoming today too !", "gocinderella2x": "Same!!!! Coachella isn’t gonna be important to me again until another actual entertainment legend headlines (cough cough Missy Elliot cough cough)", "msmagnolia8": "YAAAASSS!!!!!!!!!!!!!!!?🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "thekatrinamichelle": "Same! We had so much fun at our house we didn’t want to leave to go to the shows!", "theellegee_": "🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️💛💛💛💛🤗🤗🤗🤗. So excited for what this new growth holds, though!!", "anaisfelt": "@partbrit", "majidah": "NO LIES TOLD!!! 👏🏾", "dyeselyn": "#goals ♥️", "theartofgilding": "I’ve seen Homecoming four times now and planning to watch again today.", "knowledgeiski": "Sis, this CAPTION!!!! 😩🥰", "ludikristin": "🙌🏾💯", "kayparchia": "exactly! 🐝🙌🏽 love this message Elaine, energy conservation is a must.", "feministabulous\nVerified": "Verified", "devondlee": "So this explains why we watched HGTV in Vegas😂😂😂", "wejustwill\nVerified": "Verified", "cherishjanelle": "💗💗", "andreawhiting": "1000% same. you can’t give if your own self is depleted. and waiting out the heat by the pool or via a very long breakfast in bed, then heading to the festival as the sun is about to set, is absolutely the only way to do it 💓", "neekahgee": "This pic 😍😍😍😍", "kirstenyadouga": "🙌🏻🙌🏻🙌🏻", "wokewashing": "Thank u @elainewelteroth for your LOVE outloud!! Thx for sharing what BALANCE looks like!!! Huh what?? In the hotel?!? YES!!! Wherever joy finds u!! Thx for your powerful presence!!!!! I needed to read THIS today!!! ✨💕🔥👏🏿👏🏿👏🏿👏🏿👏🏿✊🏿✊🏿✊🏿✊🏿❣️🖤🥰🥰🥰🥰😍✨✨", "nattanymartins": "This Beychella show stoped the world. Who cares about the live show this year when we have Beyochella on Beyflix?", "beltshazzarjewels": "🤩🤩🤩", "monspenny": "I live for thisssssss", "ziathompson": "@edit__her 😭💖", "cassiedamsel\nVerified": "Verified", "cristinasocias": "Beychella rocked!!!", "ameliadesign1": "You are amazing. Thank you for always making us brown girls proud and motivated🙌💞", "tanikaray\nVerified": "Verified", "blackyogamom": "Yes girl! I’m all about relaxing and being in chill mode!", "margueritebsmith": "💯 I am committed to my quality time.", "_heydear": "Amen! Although I never made it to Coachella ha 😭", "miss_nightowl": "Hair 😍😍", "missgallo\nVerified": "Verified", "lotoyavongrechin": "Yassss everything you said and photo is fab. You my kind of girl, friend Imin my head", "loveletterstotheworld": "@breezy.lovejoyy thoughts?", "jamonit09": "Yessss!!!", "thabsstory": "🙌", "its_nayasworld": "Real talk about real life preservation and perseverance! Thanks for this reminder @elainewelteroth #AppreciationPost", "justbee_jordan": "@jasminebriana thought this was you for a second", "tonytriumphofficial": "Facts 💯🙌🏾", "ndnlifestylist": "Watching RN 🙌🏾🖤👑✨", "melissajane7184": "It's called getting old😂😂 But ain't nothing wrong with it, that's why we do all the fun crazy things while we're young.", "bridgettehylton": "🙋🏾‍♀️", "biancaasimonee": "Absolutely necessary.", "hermione_hh": "I feel you ❤️❤️", "salmasekela\nVerified": "Verified", "45threemodernvintage": "🌟🌟🌟🌟 Me", "negritagram": "🙋🏿‍♀️", "nailsbymets": "Yesssss Elaine! 💯% feel you on this 💗💗💗", "cjskin2020": "🙋🏿‍♀️ I hit 25 and all my clubbing vibes went to the club without me. Lol When I hit 36, if I don't have VIP or reserved seats I don't do concerts either. Comfort, peace and tranquility in my home zone is what I live for.", "ngolela": "😍😍😍😍😍😍😍😍😍😍😍😍", "refinedwellbeing": "How precious!💕🙃", "ava\nVerified": "Verified", "lyasiainthecity": "I feel you 🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️", "misslagp": "Same!!", "oliviamunn\nVerified": "Verified", "s_alfi13": "Facts!!💕", "tipography": "YES! ....but, also, that hair cut!", "faithlovelifeandstyle": "Love this!!! 💗💗💗🙌🏾", "cvazzana\nVerified": "Verified", "bebeautifulla": "❤️", "gem_water_lover": "Couldn't agree more @elainewelteroth - it's so important to have that balance so you can continue to shine ✨", "jackienova7": "🌸☀️", "ohdearida": "Let’s just talk about how adorable you two are in this pic!!! Wow!!💫💖", "purplelyra": "This a lesson I've learnt time and again. I love the time I spend connecting and socialising, but it is also okay to spend a day alone in order to enjoy and get the most out of the moments when you get out there. It's a healthy symbiosis where equal partnership exists and without one the other cannot thrive.", "sonita_joonjoon": "😭😭😭😭😭YAS!!!!🐝🐝🐝🐝🐝🐝🐝", "saywood.studio": "❤️❤️❤️", "_justlikejulia": "Wow, how poignantly put. This relates so freaking hard with me because I’m learning to re-prioritize and be gentle with myself. I still find solitude and stillness with myself to be uncomfortable (bc who the f am I???????), but at least I’m doing the work. Thanks babe 💓", "dianavalencia": "💯💯💯💯", "frasier1013": "Yup I’m with you about to watch @beyonce w/🍿 in tow 🤣", "glitz_glam_gab": "I’ve never been to Coachella but I definitely feel you on the energy conservation!! Experiencing joy on our own terms and living in the moment is key. Usually the VIP section of my couch has the best view!🤷🏾‍♀️😂", "creativewomenbuild": "Yasss to all of this!", "geminiwellnessblog": "Needed this reminder 🙌🏻🙌🏻🙌🏻", "alanabenjamin": "Girl, I feeeeeellll you!", "gessflyy": "I absolutely feel you. Peace > perceived productivity/perfection 💗", "darling.nola": "Yassss to Law & Order reruns. Mike Logan is that dude. ❤️❤️❤️", "stylishflaneuse": "Yes to Energy conservation 🙌🏽", "iamkarenbrailsford": "😘", "nessa0407": "Yassss!!! Vi-VIP!! 😂😂😂😂", "heynelli": "Completely! Solitude with someone special is BLISS! 🙌🏾💛🙌🏾", "helenahay": "Props! I’m also working on personal boundaries to respect my own energy and emotions.", "elisrhodes": "Stillness to realize you have everything in front and everything else was a bonus. ✨", "bhampton\nVerified": "Verified", "left_handed_gemini": "Facts!", "allanya1974": "❤️🙏🏾❤️loving your hair.", "jadarussell": "Feeling all of that!!!", "cancelthatbitch": "This!!! All of it!!!", "alexandramorton": "💕💕", "simply_ri": "Man that cut and color is gorge!!! 😍😍😍", "lifeaccordingtokeeks": "Y’all have grown literally and figuratively. I am the consummate festival goer. At 36, I’m always at @someone’s festival. But now, I’m starting to feel that need to sit it down bc I am starting to HATE(and I mean it) crowds. So instead of trying to make EVERY festival, I’ll go to the ones that still spark joy for me and leave the larger ones to the youngins who have the energy and stamina. FOMO is so real but my need to energy recharge is more important. 💜", "quayisms": "🙌🏽", "kiolageorge": "We feel you sis! Sharing joyful moments with your person is anything but overrated! 💕", "vennieta_gianna": "🙋🏾‍♀️🙋🏾‍♀️🙋🏾‍♀️🙋🏾‍♀️", "toliveanddateinla": "I feel you. As a writer/actor, I felt as though I had to go to every party/event/networking thingy etc or I’d never make it in this business. Then, God put all these stories/characters in my mind and I began writing script after script. Now, I pitch my scripts and myself...stay in to write, focus on my craft, and have no need to be everywhere all the time.🌻🌈🥰", "mrsjayp": "Dope! Mood always ❤❤❤", "monbreezy": "🙌🏽🙌🏽🙌🏽🙌🏽", "juiceboxjesse": "💛💛", "the_woodenpalate": "I felt utter joy watching beychella from my comfy couch!", "tach.j": "I’m right there with you 💕", "enjoielife": "That's real talk @elainewelteroth ! Congratulations!", "healinspaces": "It’s still #beychella like who headline this year? Lol don’t care beychella!!!", "zacharyweiss": "Saving this and reading it every. Damn. Day.", "maria_earle": "yeeeessssss!", "miss_c_in_wonderland": "💕💕", "x.eedee.x": "Me! 🙋🏾‍♀️", "danajannine": "Those legs!!!! GET IT SIS!", "gogie1092": "Good for you both - Growth is Good.", "jlatesha": "Maam..your energy is absolutely RADIANT!!! you are my girl crush and #GOALS af💗💗💗💗💗", "gracie_d_valentine": "Beautiful job on Project Runway.. sitting here watching you now...🖤♥️💚", "leelooincali": "🙋🏼‍♀️ I’m all about the JOMO nowadays. I do what I want to do and if I’m not as exciting and thrilling to others as I used to seem so be it.", "essentiallyann": "Hair goals. Thigh goals. Insight goals 💪🏽👊🏽.", "stylingmuse2018": "You really like to preach sister. 😂", "vennyetienne": "Wow! Couldn’t have been said any better. Definitely with you on allowing the vibe to dictate the flow. 🖤", "pantorabridal": "But Elaine! Can we talk about you wearing a Pantora Bridal gown 🤣😩", "saufeeya\nVerified": "Verified", "dreamnationlove": "@elainewelteroth streaming the 3 stages of Coachella on YouTube is my #Couchella 💕", "reneemauriceco": "❤️❤️🙌🏽", "theduchesso": "🖤🖤🖤🖤🖤🖤", "ciaravlucas": "I feeeeel this! Protecting your energy is one of the greatest forms of self care 🙌🏾💞", "fr0nessin": "Errbody and they mama.", "auroraspirits": "Totally💯", "officialbrittneyo": "Definitely... ✨✨✨", "quanasia.graham": "Current mood! 🙌🏾🙏🏾", "marisareneelee": "🙌🏽", "themodishmaria": "Me currently.", "xflowliate": "🔥🔥I know this vibe and it’s a whole MOOD‼️👑 #energy", "virginiedarbon": "🧡🧡🧡", "baidebear": "💗💗💖", "shawngatz": "This is so relatable darling, I completely feel you here! 🙌🏽", "staceyvbrice": "Yes! 1000%", "sheenaomurray": "You look so damn beautiful and yes to this caption", "damdamdidday": "🗣 LOUDER FOR THE PEOPLE IN THE BACK...or at home lol", "alliranch": "This is the cutest damn picture ever.", "emilyk3": "🙌🏼👏🏼Same!", "coukione": "I love this message! I interpret it as being mindful and remaining present!", "maryawhitney": "I will always love this picture of you guys. 🌹", "hyltondonna": "Love this 🤣❤️🙌", "greenandwellbeauty": "Queen", "the256project": "I just finished watching it and it reminded me how bad ass she is.", "jackthepublicist": "❤️❤️❤️❤️", "violette_fr\nVerified": "Verified", "lajoiesandra": "@elainewelteroth, you're always on point with words of wisdom from your journey. Thanks for sharing your gift with us! 🙏👏", "jasmineliketheflowerr": "YES!!", "cintamonspice": "❤️", "harx4": "💖 @elainewelteroth", "itsmichaele": "THIS. Capturing the nuances of a personality beyond intro/extrovert - love this 🤗♥️", "bookofkeri": "👏🏽👏🏽 I'm with you! There's a level of calm that comes along with getting older and learning to surrender to the moment.🥂 to more growth!", "beautybybarnes": "Same 🙌🏾", "jennydeluxe\nVerified": "Verified", "sarah_harden22": "💯💯💯", "sgturningpoint": "Waaaaaow!!! You guys are looking lit, fresh and all the shaebang!!!🔥 🔥✨✨ 💕💕💕", "caaminla": "We can’t wait to meet you at CAAM on June 20❣️ #morethanenough", "appleofhisai\nVerified": "Verified", "thisfoxrox": "Same!", "shannon_kursawe": "YES and AMEN🙌", "kazzakim": "Exactly!", "tshegoseakgoe": "Faves ❤️😍", "maxs_jrny": "That outfit, that hair, those legs, everything about this old photo is ... EVERYTHING ♥️♥️", "jasminelamb_": "Realness. ❤️", "brevetto": "💕", "chellz_215": "Love thisssss!!!🙌🏾", "wheelsupfx": "Beautiful sentiment. keeping it “low profile” is my total bliss, meditation 🧘‍♀️ and therapy.", "teealexandria_": "Truth!! I had to learn this the hard way", "shaquandawillfeedyou": "Yet still that owner of coachella donates mad money to anti lgbtq legislation....You make me so happy, and this post makes me so sad. I know the memories are good, and you should always cherish this. But that Coachella owner is the worst skid mark in the best pair of expensive panties.", "enabeana1226": "Yess I concur!💯🙌🏾 🙋🏾‍♀️", "sarynevansss": "👏🏽👏🏽👏🏽", "perfect_illustrator": "HI IM A GRAPHIC DESIGNER IF YOU NEED LOGO FOR YOUR BUSINESS💯💯CARTOON PORTRAIT💯💯ANIMATED MUSIC VIDEO💯💯MUSIC COVER ARTS FLYERS BANNERS MIXTAPE COVERS..DM💌ASAP."}