{"soyelruni": "While having sex 😂", "ramoniko_23": "i dont know but you have something", "leer068": "When your pants get an awkward tent on the front 😂", "godbyve": "Half an hour after the first date x", "sammmcoco": "After you had the greatest fuck with the same and only person for a month", "danischweeb": "Your are such an amazing writer! But I’m 1 full month into a new relationship. He said I love you 2 weeks in and I didn’t say it back. But now I want to say it. It is endearing to hear it, but maybe not too early?", "eslaori": "when you feel it 💘", "_blackhercules": "It was after two months. It was everything and so was this article 💖", "apathys_grip": "Anyone who commented an actual time has obviously never experienced true love lmao because it could take a day or a year, depending on the people and the circumstances...", "steve16457": "Right now I Love ❤️ You 🔥😍🍊👅", "sourgirlll": "I said it before our 3rd month. I said it because it was all I wanted to say to him. I couldn't stop thinking about saying it to him. So I did after a few days of constantly thinking about it.", "mimidolezar": "When you mean it.", "motoaryusa": "Never. Just easier that way.", "zafarwestern": "❤👌❤👌❤", "browdownmpls": "One calendar year 🔜😂", "petro_zeeno": "When ya mean it.", "lennyr76": "To you ???? The first time I meet you ❤", "leoisnotlyin": "So this is random BUT, I had to share it with u, ok queen ❤️ I was watching Crocodile Dundee last night n couldn’t help but compare his NYC columnist girlfriend to your very beautiful self. Your obv way better looking but yea, k good study Leo 🤦🏼‍♂️", "alisha_mearasco": "7 months into the relationship.", "accardoflora": "Si on est sainte d'esprit et honnête.... à mon avis ça arrive rarement.... sinon c'est pas le coeur qui parle 🤔😂", "dex.production": "Before Sex❤🌹", "pkrvxn": "Why should you have to say it? Let him say it and then don’t say it back, otherwise when you, it will flip@the switch and the chase is over. 🤐😵", "abram.007": "I think I love you 😍", "bmc7778": "What does it even mean to be “dating” for three weeks? When does it start? 1st meeting? 1st date? 1st kiss? 1st sex? How many times can two people even see each other in three weeks? Don’t people have jobs and responsibilities aside from dating?", "kmnolan22": "I just love reading ur words wow", "vermane": "1st hour", "laurapalmersnotdead": "@abking.2 interesting read I love her", "charliehouse99": "I feel like you’ll just know, sounds super fucking cliché I know 😂 but it shouldn’t ever feel like, “okay we’ve been dating for this long I guess it’s time to say it”.. there’s no meaning behind that. At least not to me. There needs to be meaning behind that word. But also if the receiving partner isn’t ready then that respect needs to be there as well. There should never be a rush to it. My own personal opinion tho! 💗", "lukasrudolf_foto": "👏", "rynmaradudley": "186 days 🤷‍♀️", "paranoia__shield_": "When you feel like you’re in love with someone.", "ecstaticrebirth": "first day", "mr_positive_2020": "Clearly the minute I look into your gorgeous eyes.", "thevoiceguy": "Whenever you want. If the other person isn't feelin it, like that, then at least you know your realm.", "emmanueltkindt": "3 dates what's good", "how.soon.is.now": "When you love them", "instanamefinder": "Your thoughts: pic 1: oh...its you, pic 2: bitch wearing MY shoes, pic 3: for real...?, pic 4: mommy wants those abs, pic5 : mommy wants dat ass too, pic 6: ugh that guy... 😄😄😄😍😋", "luxphoenix": "When u feel like it", "barnhart.jesse": "When you trust and respect them. Thats the definition of love for me.", "jess_jadew": "I’ve said it after 2 weeks but only after they hint to me they may love me too 😅 nothing worse to me than saying I love you and receiving that blank stare in return 😫", "modest.marge": "My hubby told me at 3 weeks", "eunycepratas": "When you really feel it", "sammcallery": "Only when I am certain I want the relationship to continue and grow. You may love someone but they may not be the person you should have in your life", "rosecitymag": "Loved the article🌹🌹", "gzoldos": "@karleyslutever looking at these photos: immediately!", "nbl702": "When is it ok to say “I Lust You” ...because I Lust You Karley 🖤😈", "space_daddy024": "I'm slowly falling in love with you .... so there's that ... #dontberude #sayitback @karleyslutever", "theorphicpoet": "When you feel it. It'll grow, change or die. But once you feel it, you share it.", "lost_sailor_": "Usually, about 3-4 minutes before I finish", "scoopmoore": "Never ever 😬", "chicagoyvette": "How about 4 years?", "morganaburroughs": "Never🙄", "kc_hyperbland": "I think it was in Cat’s Cradle that Kurt Vonnegut wrote (paraphrasing from memory here) that saying “I love you” is like holding a gun to someone’s head. It forces their hand to make them say it back. Not sure that I 100% agree with this premise but it has stuck with me so hard since reading it that now I keep myself from saying it out of fear of being the person wielding the emotional gun", "lilianbencze": "@clumsycas three days", "kaylajacqueline": "@karleyslutever you are absolutely the most romantic sex kitten ever!!! Thank you for helping me express my TRUE self through your words💋🖤", "richardridenton": "🔥❤️🔥❤️🔥", "courtney.finale": "I think it depends, too early and you look crazy, wait to long and it seems like you don't care. It is a tricky balance....", "lila_kush": "I say when you feel it and you feel safe and comfortable to tell them! Your terms 💯! 💙 Don’t let anyone tell you when or how you feel anything! 💚", "mariposavivi": "When you mean it.", "null_ft": "Anytime you damn feel like it, cause the death is always near! ☺️", "colinthedestroyer": "This look is fuckin fire", "blackbeard_one_nine": "When you feel it. Stop hiding your feelings behind a time frame", "stylezway83": "💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "willyim_i_am": "Love 💕 is an emotion that comes from interaction and our actions. Can you fall in love with someone simply standing next to them , sharing nothing , experiencing nothing ? Actions and interaction create the emotions of love that we feel. That’s my take on it.", "granadojamie": "Girl you are just beautiful! Wish you were on tv more!", "mykey_lynx": "I love you too!🤟", "robinfq": "I’d say it to anyone who brought me a cup of tea tbh.", "creme_de_la_curves_": "I think say when you feel it tbh but don’t get confused with a crush that feels like love too in the beginning", "aleams": "Not the 2nd date like someone once did to me. HOT DANG, WAS THAT AWKWARD... 🤣", "joeshsavage": "After the 4th orgasm", "fluffmanor": "There's nothing \"should\" about love. If you feel it, say it. If not, shut up.", "xcxcxcxcxcxx": "Whenever you think you feel that way about a person - tell them so they can tell you what tf they is thinkin and feeling to just SPEAK ABOUT FEELINGS so so easy.", "adsmithereens": "Your writing kicks so much ass and I love this article (too soon?) 😄❤️", "petesabo": "Never again", "mal.andru": "Love these articles though. 💜", "carolinafotograma": "We should say it all the time, why don't people?! We really love lots of things and people in different ways but we love them. I say I love you and I mean it. I love you girl bc of your fabulous work! I love I love you I love you 🥰", "companyofmisery": "Lol def reading to watch out. I say it too soon I think", "tanzania.ar": "Don't know when ,but to you...now! i love you❤️", "wolf_spritzer": "Whenever you feel it's right as long as you dont expect it back", "martinvdban": "In life there is just one certainty and that is that there is absolutely no certainty. So do what your feelings tell you to do. For one it's said after nine days, for another it might take months or even years.", "____honeypot": "i said it after 2 weeks 🤷🏻‍♀️", "keleighmccall": "First date @calvinch", "thestonedjournalist": "Gorgeous 😍🔥💕", "samirawelles": "Whenever you want. Can be after one day, can be after a year. People make such a big deal out of this but it’s not. Do it when it feels right for YOU and at a moment when it is the truth, for YOU. Don’t be scared to love.", "easyozie.eddie": "Whenever it strikes you, and it shouldn't be said often IMO, people throw that phrase around carelessly.", "fiona_applebottom": "Idk but I’ve never regretted saying it, I can tell ya that.", "dmagic_kingdom": "As soon as you see me...😍", "julien_pantanohotmail.com3": "O", "heatwave_hillbilly_wizard": "Ah, yes. A classic of our times!", "wonderwomanbread": "Did you plan this around the full moon, or what? 😂", "wayward_distractions": "completely on the money as per", "secoanaya": "Never", "adriansims28": "Watched the slutever mini marathon yesterday on vice. Favorite episode was the one you was talking with strippers and working the pole.", "lauren_sanchez_": "amazing ggngbgbrb😭👏🏼👏🏼👏🏼👏🏼💘💘", "lgamma": "We love you Karley✨", "demiurgism": "I fall in love four times a week. I'm bad at this game.", "xmansmuse": "With an emoji?!", "andiewalsh": "Say it whenever you feel it even if they don’t love you back life’s short the end", "jonnyhrdwood": "You're so pretty", "michaeledwardhicks6": "I’ve Always Loved You...", "darcy_shitbag": "As soon as you cum inside them", "russian_bomshell": "Incredible article. Laughed so good 😁👌", "thejamesfantasy": "Ughhhh I’m nervous to read, but thank you for this.", "heatherbenjamin_": "amazing piece 😍", "nuffintoofancy": "When it feels right ✨", "minucottero": "🔥", "lightrail": "three days", "brileyybeck": "never it’s a trap", "m.e.g.a_ceo": "#KarleyVogueEver 😍😍😍", "saint52": "When you feel it", "frequent__flyer": "Killing the game as usual ❤️", "collmorr": "Just before you get off the phone", "erinleecarr\nVerified": "Verified", "lostinsafari": "I love you", "stefanoscalia": "Never", "pfallerbus": "Showing love is the best way to say it , As for when you should say the words I feel that when you truly feel love the words will fall out of your mouth with neither thought or effort", "sofozzy": "Whenever you feel it", "aguyfrombrooklyn": "When you feel your love is reciprocated.", "fetawitheverything": "I love you ❤️❤️", "mistressverablack": "Vaguely sane is my specialty. 💋", "andres.neumann": "👏😘🙏"}