{"saigon_77": "Sexy AF", "iamcougrr": "Literally who fakes an orgasm 😂 I can have 5 before we even take our clothes off 🐆🐆🐆", "frau_johi": "Looking hot! 🔥", "hellonheels808": "Can someone delve into my trauma and fix it so I can blow-gasm for fun", "coupleofsecrets_2.0": "What about men faking it?? Any studies on that?", "laura_white_noise": "Beauty queen", "aeilorux": "I fake it to end it asap. If he is trying to go down, but he's licking in the wrong place. Or he's rapidly and clumsily stabbing me with his fingers, slamming his hand against me. This guy is clueless and not worth my time to educate. No thanks, next.", "danadaley": "@beth.elisa.x this is powerful", "mbradysmith": "Because u want the guy to just finish already?", "turfer198": "You look like an angel Karley!😍🥰", "kathleen_menh": "I LOOOOOVE you!! Congrats!!", "sheekeepsbees": "A male friend and I had a convo about this the other day... imagine a woman getting a guy aroused, initiating sex and 2 minutes later being like ‘ok.. I got off, thanks!’ Women are naturally nurturing and it’s sad we don’t give as much thought into making sure we are taken care of", "mzheatherbranch": "I’m going to try to use “pervasive fraudulence” today in a sentence 😂", "naomisoolary": "@nicolewis", "nick.vecchi": "Men can fake it too.", "fascinationlikeafever": "Great article", "ivvegar": "Men's fake orgasms too...!! We are not always in the mood.", "openskyphotostudiola": "Men do it too", "veryfreakingcool": "You make me want to be blonde again!", "mariolmiranda4": "Nice !! ❤️", "carolpolkey": "Omg sometimes it’s just easier, then when they go to work in the am just use your bullet prob solved!", "_aliofthedolls": "I’ve had seizures during sex that have been mistaken for orgasms. If I’m honest about it, my partner would probably lose it and sex would stop to check up on my wellbeing instead of more sex. 🤷🏻‍♀️", "maddogron": "Just curious if you were \"excited\" during the sex robot moment? You had a look of happiness during your post review.", "s.holloway.71": "Too busy faking it for your lover 🤣", "afriend666": "I've faked a few over the years myself. Sometimes you just want it to be over....", "mildnarcissism": "it’s a social nicety. we all use these gestures/signage as a way to avoid awkward or potentially difficult social situations. faking a phone call to get out of a stupid conversation with an acquaintance? sure, there’s a hundred embedded reasons why faking orgasms is bad for business, but essentially it’s still rooted in a basic human coping mechanism as a lot of non sexual things", "photossuck": "I think it's safe to say men and women both fake pleasure at times. Shit happens haha", "pearla310styles": "Faking is for lames", "ms_meliciosa": "I used to. Now I don't. And I am so tired of hearing the guy apologize.", "mvsalc": "Ladies, everyone involved is responsible for his or her orgasm. It's up to you to communicate, instruct your partner to achieve orgasm. Not mind readers.", "bustamante.photo": "#pinchandzoom", "theladythrasher": "I have a question for y’all ladies who never fake it—how do you “end” it without killing the vibe or yr partners feelings? I’m also a person having sex while on anti depressants and as much as my heart may be there, my pussy won’t cooperate sometimes. So I fake it so it can come to a “climax” and end so to speak.", "dina_frigo": "60% actually admitting to it. We are talking about ‘faking’ here....", "beckygm1412": "I don’t understand why anyone would fake orgasms. You’re essentially encouraging repeat poor performance.", "ryannsnitker": "100% of men don’t care. Haha jk, I heard that somewhere 😂", "licatey": "I have never and absolutely can’t understand why anyone else, would", "jonleverkuhn": "Good article! I get why faking is a thing, but I agree that is very counterproductive for everyone involved. Good communication in bed begets good sex. Faking an orgasm is basically saying, \"communicating with you about what I like or don't like is too much work.\" ...and then your sexual experiences with that person will never improve. I would much rather know my sexual partner didn't cum (and then talk about what we can do differently) than be falsely led to believe they had a toe curling orgasm. Sex is about intimacy, and intimacy is probably lacking if you have to lie your way through the experience. And I guess sometimes sex is just about getting f**ked. ...and if that's the case, who cares if your lack of an orgasm stings someone's ego a bit? Maybe it needed to be stung.", "bad_ha_beat": "Congrats😊☺️😁😊😁😍😉😎", "catzdrool": "You’re like a more modern, better version of Carrie Bradshaw 💕", "takkun169": "You're probably right that it's more than that.", "krimmip": "I'm sure one reason is we (and I) am sometimes afraid to be seen for what I need. If I didn't fake my orgasm surely it would mean that whoever has the (privilege) of having sex with me would really have to listen and pay attention to me. Oft hard to negotiate in a hook up and even in a regular boring ass heteto-norm-core relationship.", "buckspotter": "I never fake it. I get there or get out. 😻", "pcb3nation": "I fake it about 10% of the time", "fiorellaeats": "I think some women can’t get there and/or guy isn’t in tune enough but she still feels the need to not burst his ego. We can still f$&@ if our ego is bruised they can’t! Lol. But I agree no one learns when faking", "maxdirects": "guys fake too... just fyi 😊", "serenelyvacant": "Cause sometimes when a dude is trying to make u come it feels like your being held hostage", "thehairofthedogthatbitme": "Don’t think you hold all the power. Guys fake it as well. 🤦‍♂️", "noperesentt": "12/10 🖤", "sofozzy": "It’s something i never ever understood. Ive never faked an orgasm. I think it’s a sexist thing where as women we are meant to please men and show them that they’re ok at sex.", "idgd_mario_perez": "🤘😍🤘😍🌈", "veranda_edeka_cynthia_fern": "if i could fake it, well enough to my match my real orgasm it would help if you’re just not in the mood to put in the effort. always make them masturbate with you after if you call it quits or he comes first and thinks that’s enough", "aint_that_derek_jay": "Sometimes I want to fake but on my wife but I can’t 🤣 thought about spitting but it would be to obvious 😂", "gembulfrianto": "❤❤❤❤❤❤❤❤❤❤❤", "jabt1d": "@karleyslutever Stops men sulking I guess. Teach us emotional and sexual intelligence or fake an orgasm, one’s probably easier than the other🤷🏻‍♂️ just saying, as a man, cos I know we’re a bit rubbish", "madsjensen": "Cuz I’m bored and want it to be over", "lolaslvgnc": "💗💗💗", "lauragean": "Never have. Never will 💃", "fifty_r5.29": "❤️🙌🏾🙏🏾❤️🙏🏾🔥", "itsmemarita": "I always faked with men. Literally every man I have ever been with. I find they couldn't figure it out and would get mad and frustrated if they knew they couldn't do it for me. Easier to fake it so it can be over. Now i date women and don't have to fake ever 🤷‍♀️", "jonther": "60%?!?! I thought it be higher, too... 🤷🏻", "cloudpalace": "Sometimes 'fake it til u make it' actually works", "deemoneygreen": "What???? If Karley has to ever fake an orgasm ...That is a travesty.. I must swoop in like Superman & handle this crisis😇", "jonnyhrdwood": "I'm 100% about her finishing first you gotta ask...what gets you off", "brettdanielstokes": "❤️", "papap1187": "Is season 3 coming out...the world needs it", "phecki": "@karleyslutever in the olden days of my 20s I would fake it so they would finish and I could go to sleep/get on with my day. Now I just tell them to leave.", "kodekat": "Never did fake it, if I’m not enjoying it Im pure quiet", "mary_laryy": "I’ve never faked it, but you know what: I practically always cry after an orgasm! Like what the hell is that, I wanna know", "seejosiesmile": "🖤🖤🖤", "ivan.bren84": "I faked a few", "kevink713": "Trying to make the dude feel adequate would be my guess🤷🏼‍♂️", "ihavenoasshole": "I do it because the frailty of the male ego cannot handle the truth sometimes", "katkajac": "We fake orgasm because we want to be done with it. No matter how much you tell a man what you’re into and what gets you off most of them never change their ways of boring fucking. Men are dumb and selfish.", "richardridenton": "🔥❤️🔥❤️", "creme_de_la_curves_": "Hmmm I guess if he’s finished then we.... are finished if u get what I mean 🤷🏻‍♀️", "sabertoothjuice": "I’ve never really understood why some women fake orgasms. Seems like counterproductive conditioning. Mind you I’m a very single lady, and (try to) never placate mens egos because I think it’s a really stupid female survival adaptation! 😤", "mujer.moderna": "I never have, if you can’t make me come, shame on you 💥", "only_lafemme": "Wow only 60%lol", "sylvia_kate": "Sometimes when the guy does really really good but I can't come (maybe bc we are in a hurry or my mind just does not cooperate), I fake it as a way to say \"ok do it again next time bc I like it very much\" 😂 weird, I know", "rebelbarbie5": "I think the distinction here is are you faking them all the time or perhaps in select situations. Sometimes there IS a benefit to faking, but if you feel the need to fake it every time with someone, then you're not in a healthy place.", "his_only_one17": "Don't need to fake it with my husband. NEVER!!!! HE'S FUCKING INCREDIBLE!!!! 🔥🔥🔥🔥🔥🔥❤️❤️❤️❤️❤️🔥🔥🔥🔥🔥", "justdough": "Let’s see if you fake it", "lparsio": "Is it because they want men to finish because they are done with the whole thing?", "davedraws": "#ineverfakethose", "prodby2ndnature": "🤤", "dermbot": "Girls are weird. You’re a mega babe", "jackie.williams77": "The “moral of the story” is accurate af.", "barefootsoles": "😍", "datglassc": "Because I'm not trying to argue with someone after my ass was just in the air", "saskiaquatch": "@alanarob - have you seen the series? It’s on sbs demand, definitely was thinking to you throughout! Haha Ahhh high school xxxx", "oshotwomen": "🔥🔥🔥", "txguy_79": "😘😍 wish there were that many of you!!!", "surfmuffin": "Where is your shirt from? 😍", "exxhausted_asf": "Cuz we are silly sometimes 🤦🏾‍♀️", "bronk33": "An odd phenomenon", "grantloucks": "I don’t!", "hanniecita": "I’d bet a 100% of women have faked them.", "the_lettucelady": "Fear of Failure! It was easier to fake it and be done, than to risk him getting bored and frustrated (even mean) with his inability to get me there. And yes, I am aware of how messed up that sounds lol.", "volleymyo": "@karleyslutever Did you really let that man touch you in “Happy Endings” episode? It was so intense."}