{"margaux_rioux": "@jayellemer", "tantricactivation": "💗", "jordiemcgregor": "MY ICON", "brettlivinlife": "I think if women are shamed buying condoms, they should call out the person/persons/company that are still in the Stone Age. #empowerment #takecontrol", "jbjob": "I love you", "celaviena": "@taylorhking follow this beautiful soul", "trycealynn": "Yikes lots of hurting sex workers attacking. She didn't make that law guys. And there are ways around it 😉", "ellielockyerx": "@jackpatch2", "hushusaonline": "❤️❤️❤️", "vdcguy": "Again great body💋💋💋", "medhir_": "@simrat.sokhi", "truedsmith\nVerified": "Verified", "modelforce_entertainment": "oh my god, wow", "theinstaverse": "Can’t use them... too big...", "dashawnbarnes94": "Damn", "cbrodtmann": "@maluschii", "tnyzx": "Is it weird that I'm looking through your pictures at 3 in the morning because I don't think so but I love you", "maerzkirchner": "köstlicher Anblick", "mother_of_chichis": "@lalaleloves", "lillybean1717": "Ily 🖤", "johnctuite": "This was fun... happy new year 💝", "hotmessink": "🔥🔥🔥🔥🔥", "norton352": "Smoke bomb!😍😘", "haleyerankin": "😍kween. Love your thinking, need this in my life, please post more videos!", "galleta_skunk": "Perfección 😊💚", "mastercj3033": "Wonderful woman! I follow you with adoration!", "agie_love11": "Sex creates soul ties", "zentralperk": "+1 👍 for condoms", "stefsantoro": "😍", "youghraj2742": "Hi @karleyslutever I have been following you since a week from now on internet and I really loved your work and I know it's kind of awkward but I have a crush on You I really like You but I know it is impossible for me to meet You because I live in INDIA and You live USA so a little reply to my message would be great if You can I know You are super busy but please just a little reply of Yours can make my whole day....", "hugh_gregoryfitzgerald": "Love that hex", "_blingdynasty": "Yes", "pnkvelour": "hex condoms can be pricked with a needle repeatedly without breaking. they are incredibly unsafe and it's incredibly irresponsible to promote them. please, if your work is to destigmatize sex then you should like google anything and listen to sex workers/sex educators/sex bloggers.", "n.i.c.o.1998": "@karleyslutever want a Good night?", "topdawg_berlin": "i used to jerk off 2 ur tits, maybe i should give it a go again. is there some new material?!", "formidablefemme": "This post is so irresponsible. LELO's HEX condoms are faulty and unsafe—and they hired an abuser to promote them.  More here: https://twitter.com/SarahBHoll/status/989871193443459072", "theellechase": "@Slutever - Promoting an unsafe Condom (Hex) from a company (Lelo) that promotes said condom using a known abuser (Charlie Sheen) is IRRESPONSIBLE and UNCONSCIONABLE. By doing so, you do no favors to the public you proselytise to. http://formidablefemme.com/2018/03/23/5-things-broken-lelo-hex-condom-that-dont-involve-sex/", "spenciful": "Also, people: buy her book! It's a great read!", "fucktillithurtsagain": "Youre so sexy", "insidiousfleen": "Hex condoms are the SHIT!!!", "alysia_jane": "@choose_jonny", "kelsrook22": "@tjtriage karley hehe", "warrenmiller500": "I want to give you a cream pie", "sundayarvos": "Are they though?", "carleeee_": "u tell em boo!", "vedantmhatre1": "whatever is the reason, but eating a condom is ill advised", "marcdepratto": "And you are just gorgeous Karley", "agusyloscolores": "❤❤❤❤❤❤❤❤❤❤❤", "taylorrayvirginia": "@__missbliss__ why can you have an IG filled w things you enjoy and want to promote but @karleyslutever can not? You have 20x more follower than i do so i guess i can attack you (someone w a bigger platform) just the same 🤔 Since when does having a career in something you worked hard for or .. enjoy .. a crime? Bc she has a column, a following, and a voice? Work as hard and you too can achieve the same things and then YOU can discuss things (that she has already explained she does) that you’d like. Don’t like the way she’s doing it? DO IT YOURSELF. Or stop being like every other ignorant sheep who blames entertainers and artists for not doing the jobs of our LEADERS. Grow up or stop being lazy and put in the work to get where you need to be to talk about what’s important to you. Sometimes life has room for topics of joy and interest and not everyone is expected at all times to be a superhero. Karly, keep doing what you’re doing bc we love you and all your messages are positive and for the better. Not all positive topics have to be extreme.", "samvancela": "Ur beyond hilarious lol...", "bakersdozenseries": "@jessicalaurenrichmond topic", "jbnesmith81": "😍😍😍", "chyna1white": "Requesting an episode on #fosta #sesta and the war on sex workers... You benefit from a sex workers work, so help keep it.", "mfreiss": "I think the image is incredible!", "ecua_ninja": "Sounds like a bunch of snowflakes looking a society's approval to feel righteous.", "sweaterslutt": "Girl those condoms are the BOMB, 11/10 recommend", "ben_dover0659": "I have my wife buy them because I get stares when I buy the super magnum sized", "laurel.pearcy": "Seriously tho! I don’t know how many time I have been invited over and they don’t have one! Like um no worries I have some...", "gnarmk2": "@karleyslutever you are so adorable! P.S. I almost feel as if Everyone, not just women, are slut shamed when buying condoms. Lol, fuck 'em, either way it works out! 🌹👌", "kidsavv": "They get shamed? Wtf I didn't know that lol", "sexpantherbyodeon": "Totally forgot abt your show til I saw this. Thanks for reminding me😈", "crossproduct": "Could you tell us who is slut shaming women tho? The men having sex with them? Other women? I feel this is hey information to your headline.", "zacmckayartist": "You spunk!", "toemasj": "😍😍😍😍", "crazy_mind_forever": "Dm girlss for fun..", "harveymushman48": "You're so beautiful it's like you invented jizz", "dfalc1026": "Honestly wish women would do that more often because I forget to bring them a lot haha.", "mjune01": "@karleyslutever keep up the good work I applaud you!! Working in healthcare I have def seen in increase in STDs in young women. Especially in the Latino community.", "jonnyhrdwood": "I mean I can be your test dummy for science...strictly science", "craignineteen88": "These judgemental assholes can suck my dick, and you can push their head down on it @karleyslutever", "slayerips710": "@karleyslutever you ever use a condom for oral ??", "peekaboo216": "Lame, I was always the one that bought condoms in my relationships. Women like sex too. No shame unit.", "__dan__dan__": "Nice", "dont_f3ar_the_reefer": "Dam", "sheenakathrina": "Or lubricants or anything related to sex!!", "evlpenguin": "All the meow.", "kimmiecakes5": "People still get slut shamed for buying condoms??? #wack", "ed.werner": "Sexy Woman", "danstepich": "😘", "remnob": "Luckily, I’ve never been shamed for buying condoms. Every woman should have a drawer/purse/bag full of condoms. ✊🏽💕", "estephers9": "My brother works with that company! Very cool thanks for promoting!", "nagizeidane": "Hhhhh buying condoms here is like buying drogs have to be secret and buy it from a foreigner immigrant lool", "beyonddelights": "It’s up to us to change the Shame game 🙌🏻", "erikafaithallen": "@hellobeautifulusa Greer baby girl!! 🎀🎀🎀", "kiefernotherland": "Ur my girlcrush", "agnessmadness": "I’m not 😉", "slidingalex": "Those are great condoms", "well_fed_leb": "🙌🏼 and also love your bra and undies.", "noosetooluce": "She has no idea what how unsafe these garbage condoms are. It’s irresponsible to promote a product like this just to line your own pocket. Do some research before you align yourself with a dangerous product. I have a real issue with this.", "rob_plaut": "🙄❤️", "kb_wang": "🍾👅", "andreascrimson": "are you selling or giving away condoms?", "yourneighborhoodplantdad": "Because women are shamed for everything lol.", "i4m.unknown": "Ur body is a piece of art 🌊🙏🏻", "dfromaine1": "All for it. Get different sizes though.", "ink.kass": ":3", "camotoe2002": "U are absolutely beautiful.", "charaaah": "Ummm if by “changing the game” you mean “providing no indication if it breaks” then sure? Would highlyyyy recommend checking out the videos on @formidablefemme’s feed about the problems with Hex condoms", "candikane_lane": "Love it", "briskovichi": "Only when they dress like that to the drug store ;)", "chedward_s": "Lol imma dude and get shamed for it. Whats up with that shizz?", "eloiseclapp": "You need to follow her @brittydeeo", "leerinbk": "Are they? Really? In 2018?? I think that shit is only right.", "coffeebeankilla": "Flavored", "anrabaro79": "Karley is like a piece of art ... everything about her is mistical... the most desirable woman I've ever seem in my life", "greenmachine53": "😘😘😍😍❤️❤️", "bannedontinder": "What women, femmes and other people are actually being shamed for, is consensual sex work. Not just shamed - but shunned and stripped of their safety and security within their communities, their country. And soon, their banking. Awkward glances over buying condoms ain’t the problem.", "themotherofturtles": "@deathbydeepthroat", "crizzlenutech1": "Much better if ppl snort them", "jaikoopa": "TruChainz if women had condoms there’d probably be less teen pregnancies.", "slutductive": "I carry the extra large version of these condoms with me all the time lol you never knowwww 🤷🏻‍♀️", "saejarha": "I think its just fragile egos. And a lack of confidence in ones sexuality and ability.", "oceans137": "You're such a sex kitten Karley!", "h1_h2h": "😍😍😍😍😍😘💋😎👌", "nixlovesyou": "@mintievelvet", "jay_r_s_1": "Wow! You're one of the sexiest women that I've ever seen 🔥", "espaguetidorado": "Seriously what is this? 😍❤️😍❤️😍", "elcruzz_": "😍😍😍😍", "lv.noel": "Sexyyy", "scrubekah": "@lelo_official makes the best vibs in the game!!! #lily #lelolily", "areaofeffect808": "i enjoy all of your episodes...and you are so BREATHTAKING !!!", "criminaliminal": "Hey @karleyslutever when are you gonna talk about how women on the sex industry are being persecuted and criminalized these days? Let's talk about facebook's new policies ir about Craigslist.", "mightytinyallstar": "Yas! Awesome topic :)", "aceafterdark": "Love your show. Stay awesome", "brooselightning": "@scientwehst help me...", "sinclaire88": "@rockiereinach meow", "muse_eye_see": "🖤", "akajk_finearts": "I buy them online. Anyone can. Irony: the Amazon locker is at the 7-11.", "cojoe_nah": "Who is shaming a woman for buying condoms? The clerk at CVS, The gas station... what do they say? Is it stigma ... please some intelligent woman tell me how this happens to you? Seriously ...", "_thias": "@karleyslutever you are soooo sexy", "ersklife": "This is nitro 🔥🔥", "bridgetbadore": "Yesssss", "dimensiondiver": "I ONLY buy @lelohex", "davidsolomini": "Well said! Maybe we should create an ongoing project around this material?", "dont_click_trick": "I love you", "philkaiolohiaoyao": "Smile If Your Horny❤️💜♥️", "thebasketsofarkansas": "My goddess! I put a hex on you to fall in love with me😍", "eddymac___": "whatta babe", "skardacilveks": "hot like hell", "dawgybaggz": "When are you and Amber going forces?", "sevendfive": "Religious and cultural programming.", "wolfgang_z1": "😍😍😍😘😘", "refillsk8boards": "Your so damn hot!", "noruki88": "Me dirty", "saucypdx": "The Lelo Hex condom has a lot of criticism re: being unsafe: https://medium.com/@DrZhana/is-lelos-re-engineered-hex-condom-safer-or-more-dangerous-than-your-regular-latex-condom-66c8208c80da", "wilber.f.peebody": "I have to agree partly, it would be nice if more women carried condoms and a small bottle of their favorite lube, but that’s a little rare. On the other hand, if your dating a guy that always forgets to pack a few condoms, your dating the wrong guy unless your looking to get pumped or think your the only woman on the planet that will never have an opps.", "this_chicccc": "Happens to me always... f ed up", "db.great": "@lil.lonly", "princeross_88": "🔥😍", "mahesh_nerurkar": "Really! I must admit you are fucking gorgeous @karleyslutever Guys please use protections", "scoopmoore": "You’re awesome", "sir_smokzalot719": "Why are men?! 😂", "thewhitewesleysnipes": "Hookers buy condoms, sluts go raw", "leighrobin": "Reminds me I’m low on supplies 🙄", "hipxander": "@walnutsanddates - ooo, here’s another celeb crush for me, btw", "babykaneowens": "Damned if you do, damned if you don’t. Fuckin lames", "johnny_cougartown": "Love your show ! Would love to see a show on pegging or FFM threesomes ! You are hot !🔥", "cookies4ketamine": "Is there any nudes of karley floating around? Hit me up in the dms", "cueynuts": "I didn't even know women were slut shamed for that", "_humanizer_": "Idk why either but who wants to be apart of this modern day baby booming?", "taraxcostello": "LELO?!? Really. Ugh extremely unethical company 😬🙈 can you believe this @formidablefemme", "rodneyforarkansas44": "But women are shamed for bullshit. It's a troublesome double standard.", "vim731": "I haven't a whole lot to say except that I really can't stand the double standard... @karleyslutever good on you for not being ashamed of standing up for women who just want to express their sexuality as much as men do.", "ed_uar.do": "Nailed it", "ab_st_ra_ct": "If you wanna fuck someone you should be prepared. It’s your responsibility as much as theirs. So yeah if I’m up for some man love I carry them with me.", "fliiandgudda": "If more ppl carry condoms less diseases get passed around", "mike_capo10": "I don’t know", "slickjett75": "So 🔥", "itsvalerious": "Ok, your boobs are amazing", "matteorosso__": "Ur the best", "ronalldd": "❤️❤️ love u !", "havokpolaris": "Your nasty & gonna burn in Hell.The Christian Hell,not that Jewish shit where you get to be free after a little while.God bless your soul.", "askajanything": "🔥", "werethees": "THANK YOU 👸", "harinef\nVerified": "Verified", "riancalhoun": "💓💓💓", "takkun169": "You get slur ashamed of you do, and dumb shamed if you don't. To my mind, I think it's actually negging rather than shaming.", "dogsonthemark": "Where are you shamed for buying condoms?", "whoshotsamo": "Who are shamin these women?", "carvslos": "These kinds of post is how people get in car accidents...jk", "artis4lovers": "Vi estoy y te vi a vos @mumibrus jajajaj", "jai.patel": "Ok we get it, you’re hot", "thelittleenginethatnevercould": "Karley you’re so hot, let’s make a sex tape already!!", "bbpeytonleigh": "😍😍😍✔️😍✔️", "bradleybrunet": "I think it’s sexy to know your partner takes their safety and yours seriously", "dexpeck": "Amen sister", "rafavodo": "Bueeee", "charlie_poptart": "😍", "interneteresa": "fave slut", "russellcordellstaker": "Hear! Hear!👊🏻", "johnnie_dangerously": "I am a guy and women slut shame me because I am good looking presuming I get laid all the time.", "mr_black_barbershop": "I like you blog, but this photo i not like", "threewayproduct": "yesss!", "ericsamuels2": "You are so beautiful", "sp_street_art": "My favorite crush.", "aaron_fenwick": "Oh my my! Smart and sexier then most. Beautiful picture. Keep up the great work!", "sarajanl": "ILY 💞", "cannichels": "Ur an icon", "deadboyart": "Goddess.", "dave_jones_oceanworx": "Damn you’re gorgeous 🤩", "dominique_instantphotography": "Best ones ever 🌼 shamed ? Maybe not here, culture thing I guess 🙂 Greetings from France !", "opalhaze": "🔥🔥🔥🔥🔥", "theetotalpackagelin": "Most of the time some type of prejudice in counter while buying some. And if not the look of disgust", "galileigroup": "Beautiful Blond Doll", "progradeu": "Damn girl you need to get some vitamin d Asap", "twalkerjr": "@adamsct", "daleearnhardt3nascarboy": "I would do anything to eat you out", "sebsterrones": "OMG I love you", "punisher39": "w😍w!!", "fruttlicious": "That’s still a thing?", "lolokent_": "@hellobeautifulusa !!!", "fentelegrand": "Ily 🖤🖤🖤", "erotyzm": "♡"}