{"tea_bea": "I’m sure this will make for less sexy television than whatever we’re going to see on this show, but for me and most of the people I know, the way we handle it is not much different from how anyone handles having multiple things going on in their lives. If you have one partner, a job, a class you take, friends, and a volunteering obligation, you divide up your time between those priorities. It’s the same when you have more than one partner. There might be more feelings involved when your priorities include more than one romantic or sexual partner, but let’s also not pretend that monogamous couples don’t struggle with issues of jealousy or feeling imbalanced between their relationship and their jobs/friends/hobbies. A lot do. That’s an issue for a lot of people—it’s not just about sex with other people. A lot of the time/for a lot of people, polyamory is not some sort of nonstop group hottubbing and communal living thing. It’s really just like anyone who does more than one thing with their time. I don’t even like doing that many things! It can be as boring as you’d like it to be! The way I usually describe my polyamory is honestly “I watch Netflix on more than one couch on a regular basis.” 🤷🏻‍♀️", "zafarwestern": "👏💖👏💖👏", "ganlysarah": "@chuckchicken", "thomas_courtney": "This looks like a fun display of backwards values and sad people.", "kittysixbysix": "Never again", "hempzelia": "Hey hey this is awesome 💗I poly wassup peeps😊", "saint_james_23": "The first time I watched your show I thought it would be kind of weird. I now watch the show frequently and I find it informative, entertaining, and kind of weird.", "obenn.jpg": "we had the best time filming this!! Thank you Karley & Slutever team🌹", "bornofthestarsandmoon": "Really disappointed with some of this episode.", "thickkaiagerber": "karley we need your look book or a Depop or just a way to buy a bit of your sartorial magic", "roccobavero": "Karleyi have been all over the world and you are the sexiest woman alive", "hustleberrylarry": "How many male polys under 6 feet?", "magnoliabutterfly1991": "Started watching the first season on my first date as a triad 💞 Definitely going to try the wrestling thing.", "jenna_escalera": "🖤🖤🖤 Your show.", "leoerwinschordinger": "Is there is YouTube video for this series?", "harleyd1417": "ur very sexy", "beatriztarancon": "@pilar.rond", "sally.zmr": "@romydmb @penal_thi", "fionamc6": "@elchro89", "paigewolf": "@omganache let’s watch Monday", "jnthnab": "💚", "fiokoji": "@anthonyhammel", "harveymushman48": "That red bikini is brings me joy do not throw it out", "kelseylandinn": "The very end is the two guys and the girl I was talking about... 😳 @cramsey25roll", "cochinochuy": "Lol I’m all for all the wide open possibilities of sexuality... but once it comes to a spreadsheet, we gotta problem. For me at least", "lauralambmallet": "Google doc! Dyinggg", "the_dendrites": "This would be good if a person had a desirable microbiome, and you just had to take antibiotics.", "kidsavv": "Can you do an episode where you fuck a fan anonymously? Aka me", "qingkama": "Damn i'm not home tonight, IS there anywhere i could see it in Replay ?", "tosurface": "That fucking guy looks like the exact type of guy to schedule sex using a google sheet", "gina.bond": "@mattjddrum", "ellezig47": "@fashionvictim27 are you watching this show? Bc you should!", "zomgfish": "Google calendar is my bread and butter. 😂", "lvkee": "@olivrr_james my fav topic 😉❤️😅", "lips_spread_gossip": "@immortalskp I love her!", "ashapancake": "@abanhazi yassss gotta figure out a way to watch this here", "photobugger17": "Basically Vice's version of 'real sex'", "bradlee_michael": "@datelinebalmain", "daniberry121": "@ellia_la", "rudeblackwoman": "The show is great. This ecosexual one is interesting actually", "leerinbk": "Best breast on TV!🔥", "hex_guzman": "@kittykat_robbins", "louna_rt": "@valentine_khy", "jonther": "❤️", "rye.n.flint": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "sammijr1": "@karleyslutever I love karley 😘", "yesminmarshall": "@cocoraeclark you gotta get around karley this show is so good and so interesting", "mandamandayeah": "Scheduling sex is an absolute no for me. I’d rather die.", "smepritch": "@itstarynelizabeth as per our discussion - the google doc! 😂😂😂", "amyhannahrollingson": "@tic_tac_tk", "washdc23": "You look incredible 😍🔥😍🔥😍🔥😍🔥", "alycerivalland": "@ccfabulous", "mandalouise13": "@missstephanieleed Google doc 😂😂🙌❤️", "_woopelaye_": "@virginie.mailhot interestiiiing", "mmaddison.may": "@wattovoice", "lanierdoty": "🙌🏼🙌🏼🙌🏼", "ohbrenli": "@sir_artloucious", "dirt_mcdirt": "Good god damn, Karley🔥🔥🔥🔥🔥", "overthelainbow": "@laurlland it’s your boss!", "oliviacarlisano": "@mia_cup", "joel_r_pace": "The wife and I have talked and we’re willing to go poly if you are 😄", "btr0n": "Google doc google doc 🧐 where have I heard that before @carlycharrlie 😛😛", "laniev00": "😍", "jaclyn.en.tea": "@jakeosburnnn Sunday night date night?!", "sonofsamwich": "Poly is swinging for people that get off by discussing rules with multiple partners.", "mac_timmsy": "Well that’s one way of sharing the love, I guess", "rickthecatwhisperer": "@karleyslutever slut jokes are just whoreable 😁", "hungryhappy_hippie": "@freeimari 💛 they should have interviewed you", "sarausch": "@kaitlynbridges cant miss", "annadawn22": "I’m so happy you’re covering this topic on the show 🙌", "carolinegiven": "“Google document” lol @brownsugaraych", "kristendaniellegill": "@budhawk1", "linaa_sk": "@lea_hart", "sydcharae": "@lou_mackenroe", "y15432": "@abhibhargava7", "zachvenice": "good luck having a family with poly :P", "tomdoor": "@conniewragg this looks just as jokes as the 1st series lmao", "2baaksoy": "@lavitaloca34 you should watch her show, she is fun. 🙃", "nastasiablackfeathers": "You should watch the Louis Theroux doc about it, I think you would enjoy it! Can’t wait to see yours xx", "punky.bruiser.15": "@martinscott215", "goofy.dame": "Plz help", "joshua_.z": "The only way polyamorous relationships will work is if both participants are on the same level, and by level I mean Hot as fuck. It's that simple. You'll catch feelings If your at a lower level than your partner...", "dea_domina_morte": "@temperanced3", "imanmoveso": "💘💘💘", "nomiruiz": "I stopped dating a poly once because I was sent a Google doc", "georgia__hudson": "❤️", "_oscarnicolas": "@angelicajimenezfer mira sobre lo de poli amor que hablabamos. 👌🏻", "emanuel_f_cartier": "Hard to keep both women happy without seeming like there’s favoritism... personal experience 😏", "jorgenveisdal": "@seguratom", "koors512": "O.m.g this jacuzzi moment... #triggered #lol", "ukebot": "🔥🔥!", "razb420": "Bunch of cucks lol", "saint52": "God I want you🤤", "flamar_24_": "Karley is so damn Hot! 😍", "babeinanapron": "❤️💙❤️💙", "pretty_profound29": "@flixchikgee @mrz.pacheco Let me get a notepad.", "saltyaly": "“Google Document”", "rockfordfilez": "@karleyslutever you are super hott🔥🔥, have you ever considered modeling/photo shoots?", "subhashdtta": "🍼", "vivasoil": "😂 Google docs", "m_rjam": "@larsthinkssometimes", "lakicia99": "Wait did he say google document? 😂 \"I'm so horny!\" *Turns on computer. \"Damn, it's not my day.\" 😂", "papaemerica": "Stunning mommy!🤤", "jahn.barber": "🙌", "cjcmjr_": "😍 can’t wait!", "albasricheftako": "💕", "semidetached1978": "Can't we just have a whole episode of you in that red bikini?😍🔥😍🔥", "bx_beef": "😍", "therealsethhowell": "@samantha_rlh", "nerdyrainbow85": "Yay!!! ❤️", "sara.reyesss": "@mzleah9", "coacheffyblue": "Looking forward to seeing the final cut @karleyslutever !"}