{"takchia": "Great article as always!!☺️", "phoebethegorgon\nVerified": "Verified", "bailaraq": "Dear Karley, I think I speak in behalf of everyone here: please write another book!!! 🤩🤩🤩", "kelsofine": "Except we are sexual sweatpants twins @main_mames", "mapkcabeb": "That's great👍 Good for you", "paintsnfun": "I just got your book. Can’t wait to start reading it tonight!", "twistedartmonki": "It use to be one could tell who a slut was. She was dressed like one. Now you cant tell because the slut dresses conservatively and dressing like a slut is a just a fashion statement", "maxgoofofficial": "i dont think i can do it. just live with platonic friends and keep the heat for your partner alive longer. i would do it ONLY if it made total sense and we'd be good roommates.", "the_cory_marshall": "Oh my! ❤️", "alfred_von_erich": "Gorgeous😊", "miss_captain_morghan": "It needs a square of you winking, I feel like that's your trademark!", "missniceski": "I’ve just started watching your show, and you’re pretty much my idol. You give such an amazing voice to woman everywhere - that our sexuality is not taboo and we should own it and sling it like our male counterparts do. Keep on doing you boo, you’ve got one big fan out in Toronto! 💕", "torisorryboo": "👍 🏻", "madisonjaye_": "It’s not as hard as people think once you get useto the person and they get useto you , it starts to flow.", "kiiiaaxoxo": "u are my slutty hero💕", "zafarwestern": "💛🌟💛🌟💛", "milljermaine": "I see you on the show Slutever i love it and you on there i think you are mad Beaultiful i want to talk more with you", "1ariah": "@keithhabs", "froduz": "A most useful useless reply: Is the relationship primarily based on sexual attraction and activity, and are these supposed to continue being its main foundation? Then there is a high risk for diminishing them over time and jeopardizing the relation, of course. Now, is there a well-grounded perspective of relationship in several dimensions of life? Then, despite the ups and downs, it may become the very core of your life. And in between? Then, in between, of course. My situation? Over 9 years of relationship.", "jayden_dao": "Great job! 👍", "toeknee_swt": "@montanaflowers", "muse_eye_see": "😍", "liredesales": "🌪", "nellyfrittatas": "🔥 🔥 🔥", "superduperandyomfssrsly": "Re:\"as a first time live-in girlfriend, I'm figuring it out.\" If I now read \"... and yep, the cliches are all true.\" it would be a funny conclusion.", "flannel_child": "he loves watching #slutever with me, its one of the only shows we wait for every week! I have such a crush on you, ive already posted about it a million times hahaha 💙💙💙", "tiara_skye": "Do it for all us sluts 😘", "bacon.avocado_": "@pinkpolkadotprincess your twin I swear! 🙌", "_halo_rock_": "😍", "steve16457": "Always so beautiful ❤️❤️❤️❤️❤️😍🔥", "martinsdavis": "I love it when you tilt your head and say.. “I get that” 😍", "changed_man2019": "I love her", "cien.viente": "I'd go with middle right. Great shot 👍", "_zoroe": "VAG MAGAZINE RULES", "maridel.tv": "Great column! Couldn't have come at a better time 💕", "damian.rodgar": "Te amo, hermosa", "jesse_j_fitz": "I’m super attracted to you luv", "itcitygirl": "OMG! I just read this piece. Lol! I now have a massive girl crush on you and your piquant prose. 👏🔥❤️", "eric___charles": "With Evita on this one, been there done that (multiple times) and never again. Personal space/time is just too precious for some of us, especially with so little of it in NYC...", "sereallll": "I love you and all these pictures 💖", "billf64": "Nice photos @karleyslutever. If you were to make only one to frame and either keep it yourself or give to someone, which would you choose. I like the top/middle, right under the G in VOGUE", "alejandrotoled0": "Weird and beu", "dreamy_euri": "Looking forward to read it. Love what you do❤️🤘🏾", "ingmakeup": "❤️", "lilahsch": "@knevadan oooooh timely", "floridablue": "You’re like a real Carrie Bradshaw", "silverback_growilla": "I will definitely be buyin this issue of @voguemagazine because of the article 💪🏽✊🏽", "ilima_photography": "Loooooovvvee 😧🖤!!!", "browdownmpls": "Wow asexual sweatpant Twins. A c c u r a t e.", "hotthangcandles": "🔥🔥🔥", "bear_on_the_mountain": "You fell into the trap. Another one bites the dust.", "jcork617": "You might need to Finger it out ?", "elicantu1980": "@karleyslutever No equal, and if there was! It would be like typing Sexy into google and only two results! You, and Juliet Binoche! <3", "jnthnab": "💚", "cozylovecompany": "Don’t become asexual sweatpants twins! Get Easy Open Sweatpants! Cozy Love Pants! 👖❤️", "shendreajinkya": "💘👌👍👍", "carolitajohnson": "It was interesting to do it for seven years starting at age 43 for me, but I’ll never fucking do it again LOL. #singleforlife", "rickthecatwhisperer": "SexyAF", "tiffstaff": "I haven’t read your article yet, but I lived with my partner for 6 years before I was like “I hate this but I don’t hate you. Let’s not live together.” And were almost rounding out the 8th year together. For certain, My dream house with a mate is duplex.", "wendybirdy28": "You are just fucking amazing. 💟", "beedown562": "Your buetiful 😍", "daniellefranco26": "While all the downsides are definitely true, after 6 years I still love playing house with Rick. (Also, your eyebrows look amazing in these pictures!)", "jairus70": "Well deserved...this is where you should be!", "csweetnyc": "Asexual sweatpants twins 😹😹😹😹 so tru", "_tizoc_": "This is not very slutty 😂", "judegrimsley": "😍", "xtreme_bean": "@alison.darnley look at this BABE", "eera_official": "My boyfriend just sent this to me, and I loved every word. We haven’t been living together for long so it was extra fun to read this!", "kthanxbi": "Beautiful as always @karleyslutever — ❤️❤️", "lifeofdanijo": "Omfg yesssss", "remykassimir": "Gorgeous angel", "waltonsworld": "You’re an inspiration! 🦄🌈🦄", "victimofconsumption": "I loved it 🖤 all my admiration from Germany girl", "kind_of_studios": "🤸🏾‍♂️", "maryzemusic": "Yesss❤️❤️❤️😍", "nycdaywalker": "Yum", "carexio6": "Very sexy", "ava_sanjurjo": "❤️", "utahdogxo": "Beautiful", "daleearnhardt3nascarboy": "I’m about to jack to you", "anjalipinto\nVerified": "Verified", "jengrenyay": "Asexual sweatpant twins accurately describes the last 6 months of my last relationship pretty well.", "shelly.avner": "Kween Karley", "davidhugdahl": "I want to spoil you", "m.e.g.a_ceo": "You're fukin awesome😍😍😍", "tatjanaalmuli": "@annamjansen volg haar sowieso !", "thegreat_lexi": "Loved it!", "sofkamd": "@__dotty_ this is so great 💗", "dweismantrophy": "@fitz003", "kitemknight": "@sebmbarker", "jilly_jewels": "@edzdope", "agospelofdirt": "🖤", "gallabooty": "My soulmate @michelleshah17", "leoj531": "@korikt her articles are the besttttt", "inezsugarfox": "Yes that’s a cliche but it’s fucking true", "davidcuse68": "Loved this article @karleyslutever!! Just finished while at work. 😜. I’ve never shacked up with a partner but you provide some interesting insight. 🎉😊", "theboathatneversinks": "Yesss👏🏼", "juanturci": "Babe", "leti.sala\nVerified": "Verified", "keithgunning21": "Love❤️ ❤️ your column. I always look forward to reading it. And I can’t get enough of all of these photos !!! 📸📸", "thebasketsofarkansas": "Goddess!", "filmedbywong": "❤", "agentcottoncandy": "🙌🏼", "ubunoire": "@mathildka 🤙", "evantrowbridge": "👍🏻🖤", "crazykitty19": "@diamond_in_the_rum good read", "kigny": "@chelwilbur", "ithalmar": "🔥🔥🔥", "saint52": "Woman crush 4evrr🤤", "fxthr": "🙏", "sflulu": "Babe🔥", "vanessaosman": "@karleyslutever You are a voice I seek to hear and really listen to. I appreciate what you do. It’s so important. Especially for people like myself who grew up with such mixed messages that have negatively impacted every single thought, action and iota of communication in personal relationships. I’m an adult who feels like I’m rewiring and relearning everything in order to live, experience and love as a free woman. Thank you love.", "all_world_is_yours": "Spectacular 🙏🙏"}