{"ju_superhuman_": "@optimalformulafitness", "izzecopes": "@cakeplussize", "the_baking_masters": "❤️❤️ @glow_skinsecrets", "belleplus_inc": "Yayyy, this is an exciting opportunity, thank you @hayet.rida !!! Belle Plus is a plus priority brand that sources plus size clothing from all over the world, and also produces plus size clothing to meet the fashion needs of plus-size women in Ghana. We also educate plus-size women on pertinent health issues and organize activities to boost their confidence like salsa dancing and sometimes aerobics!!! We would love to collaborate with you!!! We can’t wait💃🏽💃🏽💃🏽", "survivorsonly_": "Can’t wait 💙 Survivor Line is excited for the opportunity. Plus size swimwear and much more", "optimalformulafitness": "❤️❤️ I’m a health and wellness coach and love your page and would love to be one of the featured businesses", "thecasadeturner": "@cocoturnerdesign 🖤", "lifelessonapparel": "@lifelessonapparel 🖤🖤", "llagraphicdesigns": "@llagraphicdesigns 🖤🖤", "shawty_sweet": "@survivorsonly_", "nubianhair_": "@nubianhair_", "glow_skinsecrets": "@the_baking_masters", "a_sstyleinc": "We produce A’s Tops - Quality Uniquely Designed T-shirts fused with prints for all Casual Occasions. #233206441535 #aisstyleinc@gmail.com #www.aisstyleinc.com", "ladybellanaturally": "Bless you Hayet! ❤️Thanks for being a visual example of one candle 💡 lighting another and not losing its flame🔥", "nhova85": "@platinumartllc 🙏🏾", "feautyorg": "@feautyorg is a nonprofit dedicated to helping young women build and promote self love and confidence", "thefolabomi": "We make women look and feel like the best version of themeselves through our clothing pieces!", "xairak": "Очень красивая, жизнерадостная леди🌻👏", "iambellaperri": "Here you go @hayet.rida 💙💙💙 Just can't leave well enough alone! As if I wasn't already infatuated with your grace, your grind, your give to the game, you up & DO MORE! I Luh-luh-LOVE this idea & would be incredibly honored to share @iambellaperri with your viewers. We are a mommy-daughter duo working to raise awareness for & end the stigmas associated with #MentalHealth #MentalIllness ...considering some of your recent & VERY REAL EMOTIONAL shares on the Shift Life series, it would be so timely to align our mission with your brand & remind boss women & girls that we can do ANYTHING, but we can't do EVERYTHING [hence self-care, delegation, emotional integrity, etc.]. Looking forward to seeing all the beautiful people you do end up celebrating! And THANK YOU x100 for sharing your space, the LOVE is real!💯💯", "richwickcandles": "@richwickcandles Home fragrance and body butter!😍", "heritage.apparel.usa": "@heritage.apparel.usa 🇬🇭🇬🇭 Afrobohemian clothing, jewelry, home decor. Thanks 😘", "_sis": "@minkushea", "cara_cam": "@lenarosebeauty", "coco_chasing_adventures": "@ajanaturals", "ajanaturals": "This is an AMAZING idea, opportunity & I’m very grateful you’re sharing it with us! Thank you💚  My name is Aja & I’m the owner/Natural Alchemist over at AJA Naturals. We create all natural, plant-based skincare using the best of ‘What Nature Provides’. FREE of: parabens, soy, corn, synthetic fragrances + Cruelty.", "nokwareskincare": "💛💛💛 this initiative. @nokwareskincare would love to partner with you. We believe our company’s values and philosophy of inclusive beauty, women’s empowerment, environmental sustainability and local sourcing are closely aligned with yours.", "yemisi_adusei": "@9ette_", "terkbrand": "We will absolutely love to collaborate with you. 🤝", "py_flats": "@py_flats @py_flats", "drejosey": "This is awesome!!! I want in 💕💕💕", "lenarosebeauty": "What an amazing and generous offer for small businesses! We are a local beauty company specializing in green, organic and natural products & services. Our founder is long time nail technician who became sick working in traditional nail salons and began researching all about the toxic ingredients that are used in personal care products. This threw her into lobbying for regulation in DC while creating a healthy work environment for salon workers and consumers alike. We would love your help to share our mission and make an impact on the beauty industry!", "ericakodjoe": "Brilliant", "ankarafanmoments_": "@hayet.rida we can wait to collaborate with you. We are @ankarafanmoments_ a local brand that work closely with young entrepreneurs in Ghana to help promote their art work internationally.❤️", "beautybyjolivet": "What an amazing opportunity you’re sharing with us! Beauty by Jolivét is a black owned cosmetics company and our first product are Jolivét Lashes. Our handmade 3D mink lashes range from natural to dramatic and are the perfect addition to enhance any look.", "malaikaapparel": "This is so so dope @hayet.rida ! We are a brand dedicated to bridging the Gap between the Pan African diaspora through fashion. Each one of our pieces tells a unique stories and histories that surround the African + Black experience! Our Founder created this brand to not only celebrate and honor her Ghanaian + Kenyam roots, but also has made it accessible for plus size folks. We carry plus sizes, and don't charge extra. If we don't carry a plus size on our site, folks can request a custom order at no extra cost. ✊🏾 We would love to send you some items! 💞💞", "jusss710": "@beautymarkedandco ❤️❤️", "jacquesimone": "🗣The people need to know about @rinnyriot ‼️ her accessories and home deco speak my truth & so many others!", "stitchbitchtay": "Would love to collaborate !!!", "_goaldigga": "Random question but I would love to know where you got those wall art pieces I 😍 @hayet.rida", "heyitsbkay": "@casandra.rosario @foodbeforelove", "pearlglowcustombathandbody": "Thank you @hayet.rida for the amazing opportunity to; get the chance to engage with you on a professional level and also the possibility for you to use and feature our products. My name is Donette and I'm am the Artisan/Maker of the skincare products for PearlGlow Custom Bath and Body. Body Butters, Body and Facial Soaps and more. Top quality ingredients are always chosen. Every recipe is carefully formulated for optimum benefit. I do hope to be featured by you and your team. Quality is Affordable and Custom is Normal at PearlGlow. Thank you.", "swirlandsparkle": "You are so amazing! Thank you! We’d be honored to be featured! ♥️", "_motivatedbylove": "@curatelifellc", "dreams__onwheels": "@bijous_accessories an online store for Fascinators and other handmade fashion accessories", "dielladesigns": "I would love to work with you on this project. This is very kind of you and amazing for many of us with new businesses. 🙌🏽", "lojarteh": "@theprimipara", "littlemissmarisue": "@sonderluxe Travel accessories brand owned by 2 Black women", "prettyhautedesigns": "Thanks for the opportunity! Pretty Haute Designs is an online plus size boutique where fashion & haute curves meet. We also do offer beautiful handmade Ghanaian Ankara accessories to provide the perfect pop of color to your ensemble.", "melanincentro": "Thank you 😍For the opportunity you give to everyone around you even those you don’t know. By what you share with the world Thank You 😊 ❤️You are blessed 🙏🏾@melanincentro", "melaniemoore36": "@edgychicboutique is my fav! She carries all sizes and is a minority, woman owned business. Her boutique carries different and unique items you won’t see everywhere!", "shopafrothreads": "Loving this initiative! Let’s show the world how empowering it is to be YOUR OWN designer—while using authentic fabrics made by our bros & sisters back home 🇬🇭 😉", "toyatenice": "This is such an amazing opportunity! 💓", "craftbyese": "🙌🏿🙌🏿🙌🏿 Hello!! Craftbyese designs Afrocentric inspired decor pieces including throw pillows, travel/ neck pillows, poufs and more. Our pieces are customized to suit clients needs, specifications and for occasions 😊 We would love to collaborate with you . 🇬🇭 🌎", "shaemariethemodel": "@sunnispeaks She is a plus sized vegan chef", "shoplovecreed": "OMG we would love to collaborate with you. We are a small brand founded 2 years ago and owned by 2 sisters @enimsay_k and @acinnamontaste from Ivory Coast. We are based in the US and we carry trendy styles in sizes S-3XL.", "bottegalulucakes": "Hi there! That’s very generous of you. I’d love to be one of your features. I make custom cakes for all occasions. I am self taught and love expressing my creativity and bringing joy one cake at a time.", "comfiart": "We would love to do this ❤️🙌🏾", "bodybyoshe": "This is amazing. Would love to be a part of this.", "divadeliciousgh": "Whoop whoop 🙌🏾, you know we already love you. @divadeliciousgh is 100% handcrafted with elegant pattern in incredible, rich African sunset and sunrise colors that exudes contemporary ethnicity. We will love to be in your closet and your shoots. Let’s get it!! 😘", "livingwholebeingwell": "Hello! What a generous offer!My name is April and I am a Holistic Wellness and Life Coach with a growing practice and I help overwhelmed ladies create balance in their lives by detoxing their minds and bodies from toxic stress as well as mental and physical baggage. Stress induced illness is preventable AND reversible and I’d love the opportunity to help a greater number of women in our community by being featured on your page. Thank you so much for the opportunity ❤️❤️", "danielz411": "Good morning @hayet.rida we are so ready for this, I am an emerging fashion designer, I have a ready to wear line mostly inspired by African culture and fabric, and we also custom made clothes, for all sizes!!! Would be so excited to collaborate with you!!!!", "celine_mademoiselle": "@gaelleprudencio @ibilolabygaelleprudencio ❤️❤️❤️", "babiephaze": "@upsidehomedecor @esowba_couture You should participate!", "ingridnacole": "@ingridnacole", "iandoclothing": "Hello there! Such a beautiful way to give back 💕 We love it. 😊 At I and O Clothing we are a plus size womenswear brand made and located in Lagos Nigeria, helping curvy women to be confident through their style. We create functional and occasional pieces and our services are ready to wear and made to order. Providing classic, timeless and elegant pieces designed to fit our body type and figure.", "incitestudio": "We create beautiful glass bead bracelets (motivational bracelets, glass bead bracelets, bracelets for all occasions) with beads locally sourced from Ghana (incitestudio.etsy.com) Thanks for giving small businesses a chance ☘️", "wheresthebeautynomad": "😮😮😮 OMG PICK IS PLEASE🙋🏽‍♀️...🗣BLACK OWNED BEAUTY SUPPLY BUSINESS AND WE ARE MOBILE #TheBeautyNomad is PERFECT for this opportunity and would love to partner with you...I’ve watched you grind through that #ShiftLife as I am Grinding to build this business and I know we would be blessed to have the chance to have content created by one of our inspirations 💕🙏🏽", "dznrz_original": "@idokreationz", "jojob84": "@renevousevents", "ndivascloset": "Love this!!! Would love to send you some Amazing Glamour Statement Jewelry!!!", "latriciaoriginalo1": "@professionallyyoursbytv", "indgeniushands": "@loasispointoflight", "rabeccaonassisboutique": "We would love to collaborate 😍🌸💕", "myskinisin07": "@dielladesigns this would be great for you!", "simply_stylin_bytasha": "HI Hayet! @simply_stylin_bytasha mission is to inspire to be inspired, focus on Fashion, Travel and beauty for the plus size community. My blog empowers, motivate and inspire to live life the fullest. No matter Size, shape or color. Enhancing Beauties from the inside out.❤️ Keep It Simple while being STYLISH2.", "plannedbylauren": "Love this idea! 💕 (Custom itinerary planner)", "denia17": "@beautybydenia I started my own YouTube make up channel for those who are beginners and want to learn more! ❤️✨ Would love to work with you one day!!", "flickerwicklimited": "Hi Hayet, this is inspirational. @flickerwicklimited is a handmade scented candles, reed diffusers, car refreshers and wax melts company. We use natural soy wax and oils. The company was born in London and handmade in Ghana.", "essentiallyomi": "Striking photo! Way to #payitforward by highlighting other businesses! I'd love to see #essentiallyomi take part! Handcrafted artisan soaps, body butters and scrubs, and natural hair care products for our kinky curly sisters! All natural and no phthalates, parabens or toxic chemicals. Essentiallyomi.com", "queenofsleeves": "@ccsutton_", "literary_stylist": "@mylippbeauty", "cocoa.shea": "CocoaShea would love to have you represent us as a cocoa girl!", "tinaandcompany": "@tinaandcompany ✨🖤", "the_locd_nurse": "@gemininaturals", "fante_gold": "Hey there!! Fante Gold is a Ghanaian American skincare company that uses organic ingredients from the motherland such as cocoa butter, shea butter and African black soap. We create whipped body butters in a variety of tantalizing fragrances and create custom creations for people with sensitive skin. We would love to be chosen one day and are grateful for such an opportunity! Blessings. 🙏🏾✊🏿🇬🇭", "ema4you": "@prettypartsco", "shimmysistah": "My own!! @shimmysistah My blog is www.shimmysistah.com 🤸🏾‍♀️", "ximemiche": "@ximemiche", "mlarbs": "@madeleatherco would be an amazing woman own brand for you to feature.", "shawanav": "@shawanav Inspire, Empower and Motivate Women to live in purpose, on purpose! #HelloPurpose I love using beauty (Makeup & Ministry) fashion and transparency to help cultivate others to identify their purpose and walk in it! Yup ....they call me #thepurposepusher", "_sprinkleofkindness_": "Hi y’all!! I’m @_sprinkleofkindness_ and I’m all about Cakes, Jesus, and Justice! Currently I’m working on a design line while still popping out some yummy treats!💕💕 Thank you for the opportunity!", "marcalexandrin": "Hey There! Love this idea of giving back❤️. Really thank you!!! We are a plus size dress brand base and made in Montreal Canada. We combine minimal and timeless style for comfort, simplicity and quality.🥂🥂", "loveoffoodandtravel": "Hello. The mission of The Love of Food & Travel is to teach and inspire people of color (both young and old) to step out of their comfort zones and see the world. Many of these people think that travel is impossible due to age, fear or socioeconomic status. My blog empowers people to start where they are and explore the world!", "luxsheaorganics": "Hi! @luxsheaorganics is a Ghanaian owned skincare company. We are based in NY and source our ingredients from Ghana. Our products line include whipped butters, body scrubs, liquid black soap and roll on fragrances in an array of scents. We also create favors events and special occasions.", "meeandminnie": "@essentiallyomi poo!!", "tsobis": "@veanative @kwametailor @beautymarkedandco @ankarafanmoments_", "savvypromarketing": "👀 @loveoffoodandtravel", "guiltyofglitz_": "@humansbeforehandles", "anita_lebene": "@thefolabomi", "joi_louise": "You’re so beautiful!!!!!!! 💕", "beautymarkedandco": "Hi I sell my brand of cosmetics and ntoma headwraps and satin lined bonnets 💕💕", "im_barilyn": "@bijous_accessories .An online store for fascinators and other handmade accessories", "essieizspicy": "I am ready ALREADY! Hayet on the ones and twos with the spice and cools! Ooooweeee it’s lit 🔥🔥🔥", "72nsunnie": "@trymyfab @gochristyo you should do this😘☺️", "becca_1916": "Hi.. becca1916 is a handmade turban line. The line is named after my grandma Rebecca born in 1916. I would LOVE to send you a turban so you can take a look!!! Thank you! Have a great day!", "essiespice": "Excited to see EssieSpice all up in your kitchen! Those sauces need to be in your Jamaican curry and your Ghana Jollof at all times! Trying to get you and all families to cook more! EssieSpice to the rescue 😋🌶 🤤", "mspaulapresents": "Love this 🖤", "thelilylawrence": "Hiiiiiii @girlilydotcom its women lifestyle site that helps women find their purpose and reclaim their happiness- it also has an online store where we sell African print head wraps, headbands, turbans, clothes, jewelry, silk scarfs and bonnets", "kendrastephen": "😍😍😍😍🙌🏾", "annarussett\nVerified": "Verified"}