{"paula_shelton": "I just started my blog a few months ago and I’m having a hard time finding my niche. I’m not really into fashion or makeup so I just write about whatever is going on in my life. How does one find their niche or does it find them?", "haseenameena": "❤️❤️❤️", "helenamameg": "Would you Travel to Ivory Coast one day🇨🇮😚", "juliakissel": "How do you like the skims?? Should I be getting some?", "adoniskingcollection": "🔥🖤💜🖤🖤", "_makeupill": "How did you/ do you gain a following for your blog? Do you offer one on one coaching?", "jeneseyquoi": "Are you an extrovert, introvert, or both?", "mancub_75": "I like the laid back tempo. Kudos👍", "babiephaze": "How was the transition moving from Ghana to US? And what advice would you give to Ghanaian bloggers who would want to make it big like you have taking into account that the environments are not the same in size, etc ?", "xclusivevee": "Where is your happy place?", "jay.stephensx": "@hayet.rida Is you hair natural, relaxed of relaxed? PS: You're a beauty m!", "michellehopewell": "How do you combat feeling discouraged?", "anna_swafford": "I love the entire outfit!", "elle.dove": "with the popularity you've gained have you found it harder to make genuine connections/friendships with new people", "mcb1823": "No questions - you brighten my day when you come across my feed!", "pinkislandflamingo": "What do you use to edit photos", "fromheadtocurve": "Did you go through a period in your blogging journey when your engagement was low? I feel like mines is, and I’m trying to learn how to rectify it with my content quality & constant engaging before posts.", "mansaally": "What camera do you use ?", "naadeik": "How did you build your brand? Sis Im out here trying but nothing seems to be working, so discouraging 😢", "ginnyweenie": "Who was your favorite brand to work with and why.", "efplange_gh": "How did you and bae meet? And at which point did you know he was the one who deserved your commitment?", "abbeysandyy": "When you first started out did you ever feel like you were stuck creatively. Like you knew blogging was something you wanted to do, but just couldn’t get it off the ground? I’m at that point right now where I don’t know where to start.", "i.am.mvhki": "Just moved to Chicago for school and as in international student, what’s the market like for getting a job after graduation? I’m studying I/O psychology.", "koshie_mills": "How to allow yourself to fully let go and get out of your head when you’re...having fun with a new potential boy?", "homegurlnextdoor": "Your favorite memory of Black Girl Magic in real life?", "ramensahsays": "Would love to hear more about your hair regimen! Any recommendations for salons in Chicago?", "ashley.resto": "what is your diet like? do you watch what you eat or do you pretty much eat anything you want? OR is there a balance??", "trinette_ray": "You always look so royally smooth and perfect. What is your hair removal routine, because I just won't believe it is all edited.❤️", "sumcute": "Where did you learn to edit your own photos? I see that you use different presets but how did you learn to get them how you want?", "diamondnite11": "I adore your style! What are your favorite brands that give you versatility, but don’t break the wallet? I’m trying to get out of my black closet and get my life!", "tayl0rn8er": "What do you do or tell yourself that gives you so much self confidence? You slay every look and style like it’s nothing 😍", "tvnewslady\nVerified": "Verified", "ben_boateng_official": "💖🍹", "girltalkwithk": "Beauty 💖", "therealsgg": "What are must have beauty products for fall/winter?", "oopsies_daisy": "I love how you mix and match pieces from different brands. Any tips and tricks on how you go about doing this?", "naturallymaame": "If you had one tip to give aspiring full time blogger what will it be?", "chrissynatural_beauty": "How are you doing today? ❤️", "meekeymickey": "How did you develop confidence with your body as you are dating?"}