{"curvygirlcorner": "Hi, I’m Kassandra Jenkins and I’m a Benefits Advisor for a Railroad. I’m still trying to figure out what my side hustle should be because I definitely need and want one. I love anything health related.", "denisha_storie": "My name is Denisha Storie, my 9-5 is a marketing graphic designer for an e-commerce retail company and my side hustle is freelance design/fashion illustration!", "salleejay": "Greetings ladies and gentlemen. @salleejay here. I’m an accounting/finance professional by day, p/t @jcrew sales associate on the weekend and I have a travel/lifestyle blog 👉🏾🦋www.salleejay.com🦋. I aspire to be a full time entrepreneur - public speaking, hosting events/ retreats and I want to own a wellness studio with a twist that I’ll discuss more about later. This is very cool @hayet.rida, thank you. 💕", "officialtinu": "Okay this comment section is giving me life ... go ladies 🙌🏾", "officiallycurvy": "Sarah, here. Looking for work: certified meeting professional, looking for nonprofit environment or project management. Just started my side hustle: @officiallycurvy in the meantime 😊", "___sam__i__am___": "Hi! My name is Samantha...my 9-5 is being a Client Service Officer for a brokerage firm and my side hustle is being a Stitch Fix stylist 📈👗", "m4drude": "Hiiii I’m Evelyn my 9 to 5 is Influencer relations and my side hustle is babysitting and creative direction on photo projects", "sumcute": "Hi There! I work full time at a Hospitality Buying Company working on getting my Beauty blog started just launched my YouTube channel, I love when you show us behind the scenes of your busy days and how you manage them. So inspirational!", "jerriealsmall": "Hello, Jerrieal here! My 10-9 is as a auto preservation specialist while I finish my degree, and raise my handsome son! My side hustle is my blog! SimplySmall Blog all about affordable fashion and lifestyle 💕", "geraldine_rabbin": "Hi. My name is Geraldine Amoah. I don't have a 9-5 yet. I'm still a student but my side hustle is my personal blog about my life (story times), fashion, and beauty.", "_oriaku": "Hiii :) my name is Hikmet Sherief! My 9-5 is school + jobs on campus and my side hustle is doing make up.", "lauren___sanchez": "My name is Lauren and my 9-5 is as an Assistant Dean at a university. I want to start a podcast as a side hustle—equal parts laughter and serious—about all things 30+ women are encountering—with a little higher ed chat thrown in. Manifesting! 🙌🏽", "efu_ah": "Hi. I’m Efua Hayford. My 9-5 is being a full time student and working four jobs on campus. Side hustle; I have a poetry/storytelling blog on Wordpress and I like to braid hair and cook for my friends.", "bangela_be": "Hey Hayet! By day I am a very tired Process and Compliance Trainer in Research Administration at the University of Chicago and for the last two months I’ve been working on a podcast @nowthatsawordpodcast that premieres Monday!", "lanibaileylifestyle": "Hi, Lani Bailey here. My 9-5 is Denial Management and my side hustle is my blog is www.lanibailey.com", "muvmarteekah": "Hi!!! My name is Marteekah!! I am an Early Childhood Educator for the Department of Education, a Spanish Teacher on Saturday's and a Chorister on Sundays. I can't discount being a mom of 2, one a toddler and another a full grown woman. As a second shift, which feels like a full shift, I am solidifying my brand as a Plus-Fashion & Beauty Influencer/ Content Creator (I honestly don't know wth to name what I do yet, SMH). It's more like a hobby right now. Looking forward to @theridacollective...", "_kellyu\nVerified": "Verified", "savednsaving": "Hey My name is Shavon, my 9-5 is working as a Adminstrative assistant and my side hustle consist of running @simplyshavondesigns were my focus is on handcrafts and @shavonplans where I share my creative way of planning.", "amma_prempeh": "🙏", "madame_dori": "Hey girl hey ! I’m Dori and my 9-5/6 is working in education (higher ed specifically) as an academic advisor. My side hustles are running my body positive vlog/workshops and working in retail at lane Bryant to stay up on all the latest fashion ins 🤗", "funmialabi": "Loving the cosy knits 👌👌", "madebykeoka": "My name is Keoka I'm from NYC, my 9-5 is a Fashion /Technical designer for a children's outerwear line and my side hustle is a jewelry making.", "a_watare": "My name is Alice,my 8-5 is as a high school teacher and I want to start a fast food joint and farming as a side hustle.", "didionwu": "Hi my name is Didi Onwu...my 9-5 is working as a Communications and Stakeholder Relations for a program that is all about championing very young African entrepreneurs. I really want to start a blog about cultural identity and travel. I currently do some sub editing and writing on the side.", "mrsree3b": "Hello New follower here My primary career is Teaching Kindergarten , my side pieces are photography, Writing amongst a few other things I love doing 🤗", "selibaisie": "Hi Rida!! I’m Seli Baisie from Ghana 🇬🇭 my my full time job is online publisher @gbconline and side hustles includes running my blog selibaisie.com, helping mom with her business, aside that I’m still looking for other part time jobs in media, plus I want to a plus size model and travel and tour the world 🌍", "lajeunedame": "Hello my name is Salamata. I am a communication director (3days a week) from 9 to 5 in a touristic agency in Sénégal. I am finishing my master degree this year & have 2 other courses I am following. My side hustle is my communication agency @lajeunedame where I post articles, I do event management and celebrate African Women. Finding a balance is not easy at all still trying to make it all work 😊", "tayshouseofvinyl": "Hi, I ‘m Taya and I’m a full time school social worker and my side hustles are Coadjutant for a grad school of SW, alumni admissions rep for my Alma mater and selling vinyl records", "jkatrinasmith": "Hey hey! I’m Jasmine, full time: communications manager at an nonprofit, side hustle/business: social media/digital marketing biz for entrepreneurs and small business owners (@purecommco ) and blogging on faith, style/beauty and career ❤️ hey everyone!", "aby_wabby": "Name’s aby. I work in sales, side hustles are styling and creative directing through @flyasaby!", "dearqueen1": "I'm a PM at an Insurance Co 9-5, and I have a growing home decor sales co + a specialty event prop co.", "dcgatorchic": "My name is Lesa-Kaye, my 9-5 is grant administration at a university in DC. Hoping to grow my side hustle of teaching grant strategy to community-based nonprofits that are women-led.", "thefatimatoure": "Hey I’m Fatima!! I’m a full time middle school math teacher but on the side I own my own natural skin care line @moussoubeauty", "emilysgsb": "I love reading everyone’s careers + hustles! My name is Emily and I’m a manager of cybersecurity where I focus on preventing and responding to credit card breaches. When I’m not working there, you can find me sharing plus size fashion + travel tips oh my blog.", "lotorneau": "I'm an accountant and my side hustle is home handyman services.", "tesa1216": "My name is Tisha. I'm an elementary teacher. I would love to start a side hustle writing math and reading tutoring ebooks to help parents with their children's homework.", "honeybeeamazing": "My name is Angelica . I work in food services . I am a Master student studying school counseling . My side hustles includes Christian blogging . I’m also studying photography . I own a canon camera and my favorite lens so far is a 50 mm lens . I do photography just for fun . I have two other projects that I’m currently drafting ideals for .", "brewedbyanna": "Hi! My hustle was my full time until I started my 9-5 as a senior designer for @rokuplayer and working full time for @brandherstyle. And looking to launch another side hustle @juniesocial. I also do side projects for an experiential agency and sales decks for a winery in Sonoma.", "squeekss": "Hi I’m Bridget Brenya and I’m a law clerk at an insurance company. My side hustle is my podcast @brayenkasa which has been under construction for like 6 months 😂 I allowed fear to get in the way but we moveeee", "mymyana24": "My 9-5 is a trainer at a corporate company and my side hustle is seasonal...producing gorgeous carnival costumes! I'd love to have you play mas here in Toronto", "arianepatrice": "I’m Ariane. In my 9 to 5 I’m a therapist who is the director of a counseling agency. My side hustles are running my blog thatssochic.com, working on relaunching @thechicurbancloset, & I have one more venture in development.", "candice.bresler": "Day job: Digital Editor and Video Producer for one of South Africa’s biggest retail brands. Side hustle: social media manager, which is paying for my dream trip to Paris next year!", "cass_drn86": "My name is Cassandra, During 8-5 I am a nurse practitioner, my dream side hustle would be writer/blogger with an upcoming novel.", "olayinkakay": "I work as at associate at walmart.my side hustle is selling beautiful handmade Ankara accessories.check out my page.@olayinkakay", "sheloveschicago": "I’m a nature center director by day. My side hustle: plus size activewear line", "q1tours": "Hello Hayet! My name is Nana. I’m an Accountant/Management Consultant/Audit & Assurance. Just started my side hustle by creating tours for my fellow Expats showing them the beautiful Ghana culture, life, food music. @q1tours Website: www.q1traveltours.com 🤗", "terry_g.a": "Hello Ms Hayet my name is terry and I have school full time (college senior ) works retail part time and side hustle is @lebongryot I give Haitian students a taste of home through food ❤️ ! You inspire me so much !", "bektar": "I’m Becca! I’m a full time apparel technical designer in NYC but my side hustle is my own clothing company where I make workout gear for my fellow plus ladies in bright and bold prints! Focused on growing next year! 🌟", "__zanah": "@__zanah ! Me! I work full time as a content producer at Havas/annex in ATL on Sprite and Fanta. Outside of that I’m an indie filmmaker. I’ve produced 14 films and counting. Directed 7. I self fund majority of my films. www.zanahthirus.com/awards", "jrjcherry": "This post is everything!!!", "ruwimbomakoni": "Hey Hayet, my 9-5 is at a talent agency where I work as a project specialist! My side hustle on weekends and some evenings is in retail! About to start my own third shift projects too ✨✨✨", "pink_moon1": "Hi queen! I’m a full time mom... with 3 kiddos and one on the way in February. Side hustle is attending a Cyber Security boot camp for 3 months ... I’ve timed it so I’ll graduate 1 week before I deliver... ! Would love to start my own all-female cyber sec company in the next 5-6 years 🥰😍😍🥰", "ilovemesoomuch": "Hiiiiii my name is Tiffany I’m a government buyer for all of the NASA Locations. Side hustle digital creator, and I host event for business/brand builders.", "ugobabre": "My name is Ugo. Main gig is management consultant and side hustle loading is @afroleticsapparel", "geminiqueentravels": "Nurse Administrator is my full time job. Side hustle is my company pacnplay travel. A travel concierge company.", "larabadams": "Hey @hayet.rida my full time is marketing project management and my side hustle is singing, songwriting and freelance writing.", "amandamarie1014": "Hi! My name is Krescant Sims and my 9-5 is a project manager for an electrical company in St.Louis Missouri. My side hustle is real estate as I just became a licensed real estate agent last week! Been a dream for a while so I am very happy! As for how I plan to balance it all: proactiveness for both jobs(prospect heavy for real estate so a lot of business becomes constant referrals), time management (get up earlier before my day time job to look at new listings, look over contracts, comps, and research neighborhoods for potential clients, also do this in the evenings), ask for help if needed! I have a great support system ready to step in if I need them! I’m passionate about both jobs so I’m ready to do the work!", "ashley.resto": "My name is Ashley Resto! ✨ I’m a full time Marketing Director and my side hustle is my photography business, @ashleyrestophotos 🖤 check it out some time!", "danazphotos": "Strategic sourcing manager full time and photographer on the side! (Mostly just for fun though!)", "allthingskate": "Hi! I’m Kate. I work full time as a social/brand strategist at T-Mobile, blog @allthingskate, am a full time MBA student, and working on two new projects 🙌🏼", "candesland": "Hey, Hayet it’s Candace (we met at Essence). I’m working in the insurance industry while running my blog CanDesLand and YouTube channel with weekly uploads. I’m a single mom and my daughter, fortunately, takes my photos. Which allows us to spend time while creating content. We batch create photoshoots and videos on the weekends. I plan for at least one weekend a month to do something fun with no work.  I've learned that while building something there is no such thing as balance, it's more like juggling. The drive to keeps going comes from the community I serve. I know that despite my lack of sleep I'm encouraging someone to believe that they are enough to do whatever they dream and to #golivelifeoutloud 😍", "deena_mckay": "My name is Deena, I work in tech as a scrum master by day. Then, I host my podcast @blacktechunplugged and do speaking engagements as a side hustle!", "cortney_clarity": "Hey Hayet! My name is Cortney Jones. My 9 to 5 is a Business & Membership Marketing Assistant for a medical association and my hopeful side hustle if I can figure out how it can make me money is a personal development blog. My other side hustle will be as a project manager and virtual assistant for creative entrepreneurs once I get this blog in a place where it has an engaged audience.", "clair_tibbs": "HI my name is Clarissa. I was recently terminated and I am starting a traveling cleaning service.", "freshkurve": "Hi Hayet, my name is Afia and I am a pension administrator and I am trying to start a blog cos fashion, clothes, and styling are my fav.", "malortandmoet": "I’m Tumpale and I work 9-5 doing project/program management at #LinkedInChicago and my side hustle is a blog focused on fashion, beauty and nightlife! 💕✨ #tanzanianamerican", "i_am_ms_niss": "Hey girl hey🙋🏽‍♀️! My name is Anissa. My 8-4 is a foster care Licensing Supervisor at at child welfare agency. Second shift is an in home therapist 😬", "diyginnychi": "I’m Ginny and I work as a Marketing Manager for the top real estate company in Chicago, B&W. My side hustle is crafting and interior decorating. FYI - I met you and you were super motivational! 😁🙌🏽", "nubiaesq": "🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️ work doing immigration policy by day and run an empowerment blog for law students/new lawyers by night", "el_veee": "Hi! My name is LeVincia and I am an Executive Assistant from 9-5 (really 7-3:30p) and then I help entrepreneurs rediscover their passion with my Virtual Assistant business @righthand4real! 🙌🏾", "mandy_spence": "Hi I’m Mandy Spence. I’m a full time office manager and my side hustle is @beforeverglam & @bfglamstudio", "abronoma_5": "Hi I’m Freda Manu, my 8-8 is a carer and my side hustle is @melanincentro and starting a travel and property business soon", "samplots": "🙋🏻‍♀️ FB Recruiter full time and my side hustle is my online boutique @dressedcollection & my partnership with Monat vegan hair & skin care", "esiemefa": "Hi there! I am Barbara - CFO by day, consultant by night and caterer/invitation designer when midnight rolls around!", "offlife_": "Hey! My name is Dilara. Picked up my masters in Architecture Media Management. Working as a content creator & social media manager for my school. My main hustle is working as a Fashion/Lifestyle/Wedding Photographer. On Monday I’ll start my job as a product/fashion photographer for a German upcoming Fashion Brand. 🥳", "ms_pnim": "Hi, I’m Palmira. I work in Global Health program management for countries in Sub Saharan Africa, starting work in Asia now. My second shift is graduate school - getting a Masters of Public Health in Public Health Policy and Practice.", "brezeeez": "Heyyy ☺️😁! My name is Breonne, my full time is a Metallurgist/Quality Manager. My side hustle is selling clothes on Poshmark, been slacking lately though. But I would really like to be a sommelier and share my love of wine! 🍷🍇💁🏾‍♀️", "pagekeyssss": "Heyyyy! My name is Paigee and I’m a LPN and a waitress going to school for her RN! My side hustle is selling hair! Follow @bundleinvasion!!", "heartprintandstyle": "hey hey hey. my name is vivi. during the daytime, i work in quality assurance for a bioproduction facility whose client is a research center (that was a mouthful). my side hustle-slash-passion is my lifestyle blog, Heart Print & Style.", "manthalove": "Hi bestie (in my head) my name is Samantha my full time job is an executive for a department store and I plan on launching a consulting firm in February. These second shifts have been serious trying to plan everything. Just researching has taken up a few weeks of work.", "mrskhayes": "Hello! I am Kendra. I teach 5th grade full time and create custom shirts and graphic designs on the side.", "yvonne.sampler": "❤️❤️", "naa_amerley_": "Hiiii 👋🏾 I am Jane. I am a Trade Services Officer for West Africa for the British High Commission by day (7:30-3:30).. A masters student by late afternoon (4:30-6:30) and a fashion designer @shop_upendo and baker @mittens.gh by night and on weekends 😊❤️ Hopefully next year I get to open my own stores and employ people 🎉", "letsgocrazy4": "Hi my name is Trice, I’m a full time business development manager for a precast concrete association and one of my side hustles is creating memorable wine experiences for different charities and upping my speaking gigs & blog on diversity & inclusion", "_osavannah": "Hi Hayet! I’m Olivia, a Real Estate Paralegal at a law firm by day and I just launched an Instagram Page ( @corporatewithcornrows ) to celebrate black beauty and hair in conservative/professional environments.", "justdeige": "Hi I’m Deige🧚🏾‍♂️✨ I work full time at a church as the office administrator and my side hustle is branding and graphic design @deige_williams", "zuri.ki": "Hi Hayet! My name is Zuri and just started a new 9-5 working in life science PR and I love it cuz it’s everything I prayed for. My side hustle is doing science + wellness events for women here in Chicago. I’d love to create a business for my art as well one day soon!", "brijoimarie": "Hi I’m Briana. I work as an office assistant as my 9-5 and my Dream side hustle is running a sewing blog and making cute and functional bags. I’ve already started and now I’m just putting things together. I’m scared but excited !", "mzwennes": "Hi, My name is Mina! I work in accounting/audit & assurance for a big 4 full time. And my side hustle is a personal finance advisor for friends and fam. My dream is to expand this and make a business out of it 🙏🏽", "sarahclavel": "Hello 👋 My name is Sarah, my 9-5 is corporate investigation and my side hustle is influencer manager. I want the side side hustle to be my hobby - business intelligence (market intelligence, due diligence...) development.", "alexiskchester": "Hi! My name is Alexis. I am a recent fashion merchandising & retail marketing graduate who is struggling to find a job in my field but my side hustle is photographing & I am working on becoming an influencer/content creative. I love to create & it’s the only thing that keeps me calm and happy & makes me forget about not having a 9-5 to help support me after college. & you’re so inspiring by the way 💜", "sogona.sacko": "Hey beautiful people ! My name is Sogona and I currently work as a licensing coordinator for a small private company. My side hustles are: 1. Social Media Associate 2. CEO of @skinbysogo Cheers to all the bosses !!", "sabrina_amory": "Hi I’m Sabrina! My 9-5 is as a Project Specialist for an asset protection firm. My side hustle is my licensed home based bakery, @confectionsbybryn", "lesleychinery": "My name is Lesley Chinery...my 9-5 is being a full time student and my side hustle is altering clothes for my friends and braiding hair on campus", "globalmidwife": "Hey, I’m Katrina 👋🏾 My full time job is being a Midwife (definitely not 9-5, 24 hour shifts included 😬). My side hustle is my blog focused on travel, fashion, and women’s health.", "ghanaianbella": "Hi......Akua here. My 9-5 is an Executive Assistant tech. My side hustle is @luxsheaorganics, we make Shea Butter base products.", "beautyandthepeacock_": "Hi im Cece, my 9-5 job is a vocational rehabilitation specialist for IDD/Autism. My dream side Hustle is to be an event planner.", "richemond1988": "My name is Jeannette and my 9-5 is business development coordinator for a local hospital. My dream side hustle is to work for you as your virtual assistant 😉. You did say speak it into existence right 🤷🏿‍♀️😂, my application will be coming soon. #timetostrechoutofmycomfortzone", "uncommonclassic_blog": "Hey @hayet.rida ! By day I am a medical social worker. After 4:30 I am the content creator behind @uncommonclassic_blog", "shawanav": "Hey Pooh! My name is Shawana! My full time job is a mental health targeted case manager; 2nd shift is a content creator focusing on empowering all women to live in purpose, on purpose by being unapologetic in their fashion, makeup and style. This leads to 3rd shift of my empowerment and purpose coaching business called @_hellopurpose which includes purpose coaching, events and upcoming project to help women to identify their purpose and walk in it. Which leads to a 24 hour shift family life🙌🏾🙌🏾", "samuellaskitchen": "Hey, I’m Samuella Takyi-Buachie! My 9-5 is at @lifeatpwc as a Technology Consultant. 👩🏾‍💻 One of my side hustles is cooking & shipping Ghanaian food to people all over the US. @samuellaskitchen Another is revamping resumes. People tell me I’m a beast at all three! 🤗🥰", "hr.katie": "Hola, I’m Katie, a bilingual HR coordinator for my 9-5. My current side hustle is as a service team member for an insurance agency (will soon end that in the next month). I am manifesting a side huddle as an HR Culture & Strategy consultant business.", "_samantha_lindsey_": "Hi! I’m Samantha, I’m a full time student at the moment. I’m in my last term of college majoring in theater. My sort of side hustle is my blog that I’m trying to start up. 💜", "nadiath.a.k": "My name is Nadia Adechoubou. My 9-9 (lol) is an M&A consultant. My side hustle is @omibottle and launching amazing health and wellness products! This is just the beginning! Love your work! 💕", "katelynnandadwoa": "My name is Davida Selby. My 9-5 is marketing director at boys & girls clubs of America. My side hustles are @katelynnandadwoa natural skincare line & curated vacations to Ghana 🇬🇭", "feyisang": "My name is Feyi and I’m a nurse. Run a side hustle with my sister selling handmade waistbeads @temi_beads.", "more_mani": "My name is Manika and work as a customer service rep for a sign company. Cake designer as the side hustle @lbcreations10 and working on a candle line", "maddi.hebner": "My name is Maddi Hebner, Social Media and Influencer Relations Manager by day and freelance Content Creator and Junior art director by morning, nights and weekends!", "danitaartista": "Hi I’m Donna Alulema, I’m an Art Therapist and work with people who are diagnosed with HIV and other mental health issues. My side hustle is working as a therapist in a private practice. My side side hustle is selling banana puddings.", "stylishsista": "Oooh! My name is Taelor! My 9-5 I’m a group art supervisor in the FCB network and my side hustle is @stylishsista 💓", "chavalle.taylor": "My name is Chavalle Taylor, I am a nanny by day & the creator of @soulsurgery101 , a safe place for women to find resources and support to heal from past trauma. 💖", "shyleason": "Hi, I’m Shy Leason and I’m a Process Improvement Specialist for a bank...still working on figuring out what my side hustle should be but I definitely want one!", "loloandbae": "Hey girl heyyyy! My name is Ashley, and I’m a lawyer (Assistant County Attorney) in Texas, and my side hustle is a skincare business. 💜", "tiffanymmiles": "My name is Tiffany Miles..my 9 to 5 until yesterday was Supervising Paralegal at a Foreclosure firm..new gig is settlement/closer for a national bank....second shift ..i have a tax service. A FB business group. A legal writing business and my collection agency was just bonded...i know..a mouthful 😊😂", "tobiloladeyinka": "Hi I’m Tobi! I’m a full time psychology major student and my side hustles include building a media production company and starting a jewelry company", "essenceandstyle": "My name is Yechima. I am an associate for a non-profit organization that helps people with disabilities obtain and maintain employment in their communities for 9-5. My side hustle is my blog, YouTube, Poshmark and a brand that I’m developing.", "coffee.lipstick.go": "😁 Naomi...9-5 UG Finaid office, side hustle Personal Stylist @coffee.lipstick.go 🙌🏼 Nice to meet you!", "rustandtrust": "Thomas! Social media. With a side of.. social media. 😂", "ms.dee5": "Dudly, 9-5 program manager for a non-profit. Side hustle: writing home studies for families who want to foster", "lyricnewbern": "lyric! i work full time at a gym and photography is my side hustle and passion (and will eventually replace my 9-5...📸💘)", "smittenboutiquechicago": "You look beautiful 🖤 ps. Love that outfit!", "the.leaux.down": "Lauren... 9-5 ima a technology consultant for a top professional services firm and the side hustles..... blogging, styling for business women and a new venture I’m just starting", "hannahhaas": "My name is Hannah and I am a leadership coach 9-5 and my side hustle is tutoring!", "curvygirltravels": "My name is Kenisha I use to be a full time clothing designer for Walmart. Traded that in follow my passion. Now I'm a full time Photograapher @kgillphoto, side hustle include travel blogger, and opening 2 new business . 😉 #hustlehard", "its_nanette": "My name is Nanette Taylor, my 8-5 is as a software developer at Ghana National Petrolem Corporation and my side hustle includes being a freelance web developer and opening an online beauty supply store in February 2020", "paigebabilla": "Hey Hayet! I’m Paige, Social Content Strategist at a marketing agency by day, portrait and lifestyle photographer by morning/night/weekend 📸📸", "jenjeanpierre": "Jen Jean-Pierre, my 9-5 is the manager of social media strategy for a healthy association and my side hustles are my blog and my photography business.", "cake.n.cognac": "Zakiya! 9-5: leave admin for the City of NY. Side hustle: culture blogger / writer & editor"}