{"being_missflo": "😍😍😍", "divadeliciousgh": "💕", "christalbeeko": "I wanna win! I’m the winner !!!", "kensemah_": "This is beautiful!!!!!! #humbled #Thegiftofgiving #blessyou", "zeewarriorprin": "You are 👸🏽! God bless you!❤️", "michelle_chagli": "❤❤❤", "kene4.0": "♥️ gorg", "afoah_afful": "My lady😍", "miss_nana_o": "God bless you @hayet.rida 🙏🏾🤗😘", "curvystyleremix": "You are going to be an angel for someone God bless you.. if i had the time off if work I would definitely do this", "its.yolandas.world": "❤️❤️❤️", "tiffanytamera": "🖤🖤🖤 your heart is amazing", "ccstylebook": "Incredible! The best giveaway I've ever seen 💓 I'm sure your big sister is proud of you as we all are 🙌 What a great way to honour somebody 💋", "nisi_curvy_model": "Lovely ❤️❤️", "thepoliticsofstyle": "May you be blessed this season and beyond ❤️💜", "_kellyu\nVerified": "Verified", "ghettofashnista": "I love you!!!!!!!!!!", "daniellestbernard": "This kind of compassion and generosity is rare. What a beautiful gesture!", "obaabirago": "God bless u dear.... May all your heart desires be fulfilled in Jesus Name Amen. Next time invite those who just wanna see America😁😁", "lilnaniruiz": "Beautiful. Got me crying on the bus over here.", "toyabaz": "What a beautiful honor to your sisters life. Blessing be to you for your kindness and heart of gold.", "dea_itsmytime": "That's so awesome. You are truly a sweetheart.", "iamn10": "Tremendous act of kindness. It is such a joy to be blessing to others.", "kdn_07": "God Bless you!", "otisinchicago": "So much love to you. ❤️ I'm gonna hug my sister so tight tonight. Sending virtual *hugs* to you also!!!", "djmegantaylor": "@hayet.rida what an amazing kind gesture ❤️❤️❤️❤️❤️❤️❤️❤️❤️", "mskristine": "This is beautiful!", "travelbydesign": "💞💞💞💞💞💞💞", "dearcurves": "@hayet.rida selfless and inspiring ❤", "amandojane": "💛💛💛💛💛💛💛", "ofeibea22": "If you own Louboutins, you don't qualify 😂😂. I love your kindness! Its an inspiration to us all.", "truely_scrumptious": "What a beautiful gift ❤❤", "judy25saywhat": "@hayet.rida you’re such an inspiration ❤️❤️❤️", "homegurlnextdoor": "❤❤❤", "koricoleman_": "You continue to inspire me. You are making your sister so proud 💕", "steph_espada": "Wow! What an amazing way to honor your sister! ❤️", "tahlor_nichole": "You’re so awesome💕 happy birthday to your sister 💜", "gemini_jess5": "❤️", "versatilefashionista": "My deepest sympathy. May your beloved sister sleep in peace 🙏🏾", "theregoesdina": "You’re so awesome! 😘", "royaltycosmos": "Beautiful way to honour your sister, may she rest in Peace. God bless you", "curvy_fabulosity": "This is an amazing gift! God bless you @hayet.rida", "aphya_akyeama": "God bless you dear, thanks for inspiring us all to do better in our own small way.", "essieizspicy": "The disclaimer!!! I don’t own Louboutins 🤪🤪🤪", "foladallas": "May the Lord continue to comfort you, may his blessings be upon you and your family", "gillyjack": "This is beautiful Hayet!! ❤️❤️❤️", "mispoks": "Omg!! God will bless you a billion more. Most thoughtful gesture ever! May your beloved sister's soul rest in peace and joy knowing how you're honoring her.", "xo.camilaaa": "This is so kind. Bless your soul 🙏❤️", "kellyaugustineb\nVerified": "Verified", "sammieee_j": "This just made me love following you even more! 😩🙌🏽💗 With respect, your sister is definitely proud of your heart. ❤️", "tamika.is.magical": "You have such a beautiful spirit and outlook on this thing called life. Keep doing exactly what you do, blessings to you.", "audreypatriciaw": "This is so beautiful ❤️ I pray that someone is blessed a thousand times over by this.", "realstephaniegreene": "❤️❤️❤️", "weddingsbynatasha": "Wow!! This what it’s about!!", "sistersandsuitcases": "❤️", "latanya_1913": "You’re a blessing and you will continue to be blessed! Your sister is beyond proud of you! Keep growing and glowing! ❤️", "aagyakss12": "Bless your heart ❤❤❤", "oohchile70s": "What a blessing this is", "akosuaaaaa": "💖", "dijathediva": "♥️", "mrsakowa": "❤ this is soo awesome! God bless you 1000 fold for being a blessing to someone!!!", "_baboa": "😭 this is so sweet", "claudzilla6": "You are for sure making your sister proud!", "aminaolayiwola": "You are a gem 💛", "suzanne__bryant": "The 7th is my husband’s birthday as well. I’ll keep you and your family on my heart.", "topknotsandscrubs": "What a beautiful heart you have 💕", "cmblease": "😍 you’re incredible", "aliciacaillier": "💜💜💜💜💜", "tanika_nyclifestyle": "You're a wonderful person 🙏🏾🙏🏾", "sondralorrain": "This is such a blessing 🙏🏽🙏🏽", "lenorashewrote": "You are so beautiful, inside and out! 💕", "jenniferlake\nVerified": "Verified", "alialistone": "You are amazing!!! This is so beautiful and kind ❤️❤️❤️", "katherinethebrave": "I really love this Hayet. Praying you find the right person to bless. Thursday is my little sister’s bday btw.", "stylepluscurves": "This is a lovely way to honor and remember your sister! 😘😘😘", "dnichole365": "This warmed my heart. What a blessing this will be for someone.", "krysstylzs": "This is so sweet! ❤️", "krileytips": "This is so sweet and so thoughtful!", "keaux": "This is beautiful and kind. Continuously goals.", "dalia.cline": "You are so awesome girl! What a special way to honor your sister", "mizwoochic": "Oh Hayet your generosity is amazing!", "itscrystaldionne": "May God bless you!", "alongthekurve": "Wow! May Allah bless you 💕", "syn_city1": "You’re definitely an angel on earth ☺️", "sterlingj": "Oh wow what a beautiful way to celebrate your sister!", "themagalienormil": "She is amazing so don’t take advantage.", "readytostare\nVerified": "Verified", "2cl_2classyladies": "That's amazing! You are a wonderful soul! ❤❤", "sabrinastyled": "This is so sweet. You are amazing. This is above and beyond.❤️", "melaniecoba": "What a beautiful way to honor your sister.", "everythingnaart": "@_msdupsy", "aba_sunshine": "Awww you are an amazing soul with a beautiful heart. This is an awesome gift. Just wanted to share how happy I was to read your post re: the giveaway. Blessings to the winner and may God continue to bless you more and more for being a blessing to someone during this holiday season. 🙏🏽", "ljoy80": "WOW! What a blessing!!!!!", "ms_pretty_whitney": "💝💝", "mistymandrell": "Wow this is so genuine and giving of you Hayet. God bless you!!!"}