{"afrocentrix": "@shadzy.v see everyone needs to take that emotional dump 😂😂", "emerald_jane": "Weekly for the past 4 years I sit with mine every Friday and we just go! Everything from serious to silly to trump to being an immigrant. Best $ I spend weekly.", "clair_tibbs": "Good Afternoon, (cause I know you hate when we don’t speak first.) God Bless you, @hayet.rida thank you for sharing this, post! 🙏🏾", "tyalexander\nVerified": "Verified", "stacymgriner": "I used to see a therapist years ago, but started seeing a psychiatrist last year when my anxiety and depression was too much for me to handle. We see each other weekly and it’s money well spent.", "p.nicole_n": "Hey Hayet! I go to therapy once every two weeks and I’ve been going for the past three years and I’m so thankful for Therapy! It’s helped me regulate life and helped me manage my mental disorder! I’m also a clinical mental health student! So I’m def the biggest advocate for Therapy! I love it and was able to get family to go! ❤️makes me proud to see Black women going to Therapy, now if we can get more of our men to go", "hart2heart_journee": "Hi beautiful @hayet.rida I recently started counseling myself when I realized I needed it New she of all the lost and tragic events I’ve went through. I had to admit to myself a while ago that I’m stronger from them, but I never completely healed from them I just learned to love with the pain. Now I’m healing and I LLLOOOVVVVEEEEE IT.", "makeupaly08": "I started going in December and it’s one of the best decisions I’ve ever made. No regrets. I personally sought out a therapist who was black and wanted to make sure we had a connection beforehand.", "cdubxo": "@hayet.rida That's actually not a bad idea...maybe a class or after school activity or extracurricular period offered as a class...", "lady_berde": "I went when I was 14-16. I can’t lie I need to go back. So much has happened and what I was doing to survive is no longer good enough. My job as a social worker takes so much out of me that I’m at a point where it’s either me and therapy or a full break down somewhere. I recognize it and I know that but for whatever reason I am soooooo scared to go back into a chair and share my ugliest self and be vulnerable to someone. Vulnerability that’s the hardest but most necessary part.", "melaniehabwe": "Love this post! I found my first therapist last year on therapyforblackgirls.com, and I just love her. She helped me start to process some things I didn't even know I needed to process. I got some pushback from older family members, especially the ones who definitely would benefit most from therapy. Despite their aversion to it, they've started to see the importance of it. My dad, who's Ghanaian, had two childhood friends in Ghana who committed suicide last year alone, and two others who suffered bad mental breakdowns. Still, they struggle to overcome their ingrained aversion to therapy. I hope our generation's openness will inspire them to embrace therapy as positive, normal, and necessary for everyone.", "zsane": "I’ve been thinking about going back to it for a while now..", "syn_sei": "Such an important conversation and I agree! I feel like a therapy pusher but it has become so key for my self-care. The growth I’ve made is exponential And therapy was key for that❤️❤️ thanks for being open and sharing about your journey!", "mrsannied": "So important! I started going in the new year, and go weekly. It’s been an amazing transition/experience. It helps me feel like a better woman, wife, mother. Thanks for sharing!", "anissagail.hergoals": "Amen! Yes we do!", "yuzzy1998": "I applaud you sister. Being a black woman and Ghanaian it can’t be easy. I saw a difference in myself from the first day I had a session. It pushed me to be where i am today and forever grateful. Let’s keep breaking the stigma, especially us African women. We have a lot of baggages to unload.", "nkenwoodlady": "I have been, thinking about going back. Thanks for sharing we as a culture need to stop hiding that we all need a little a help sometimes.", "toyabaz": "I'm so glad people are talking openly about going to therapy because we all have things in our lives that we need help understanding or processing. I've been to therapy and would not hesitate to go back.", "thespismaker": "You’re amazing.", "freqone": "😍", "adebinafrica": "Seeking therapy means you are wise. \"Me first\" matters. You can not pour from an empty vessel. Sometimes we need to hear ourselves say certain things out loud, in a judgement free zone, to either heal ourselves, empower ourselves, and emasculate things in our past that hurt us. Enjoy your journey to a richer more powerful you.xx", "tro_dani": "I tell people all of the time to go to therapy. It’s one of the best things I’ve ever done for my myself. The last time I went was for 2 solid years. Helped me thru some thangs and gave me some tools to use in the future. Congrats for caring for yourself! 👏🏼👏🏼👏🏼", "squeekss": "I’ll always love you", "thiscurvylife": "I went for 8 years. It was a very good thing. The emotional work you do makes you so better equipped for life and for understanding others better. ❤️❤️❤️", "gabriellewouter": "I always refused to go to therapy because I was confinced that my problems were nobody's business. I got a burn out and finally gave it a chance. My therapist is a white woman who was born in Uganda and lived there till she was 15. She understands me and shows me how much strength I have. The fact that she curses is a bonus for me lol", "michellehopewell": "Honestly therapy has been one of the biggest balancing tools I have had in my life. Perfectionism is my weakness and learning that it doesn't exist and dismantling why I think it does changed the game for me! The confidence to let go and let God has been massive. I'm not a saviour or a super hero. I don't need to take on the weight of the world by myself. I can ask for help. I can struggle. And it is okay.", "fisherprice08": "I’ve been started going in 2016 and stopped last year and realized that I need to start going again. Trying to find one that takes my insurance but if not I’ll go back to the one I was seeing before", "kartcheese": "And i forgot i was Happy to see you", "littlgirl_blu": "Thank you for sharing this. I'm a big fan of therapy for everyone. Sometimes we need to talk it out with someone unattached and objective. It is amazingly helpful.", "sgardnerstyle": "Honey the power of therapy is REAL!! It changes lives. We ALL need it", "mzjlee06": "Therapy saved my life! I started after the death of my father and went for two years! Initially I was skeptical but the first session I let it all out and it felt so good! Now working a stressful job with second hand trauma 😩 I’m looking for a new therapist in my area!", "noir.funk": "Words I live by: \"Everyone needs a lady.\" or \"Just get you a lady.\" \"Lady\" meaning therapist. It has truly saved my life. It's very hard work, but sooooo worth it.😘❤", "mseeer": "♥️", "lmarabe": "100% agree everyone should see a therapist at least once in their life. It is a life changing experience which allows a person to see things in a more accurate light without judgment.", "zuri.ki": "After the night I had last night, I definitely needed to see this. Thanks for sharing this resource!", "nataya_harris": "When my son started acting out in high school I found “him” a therapist. The first session she said “Mom, let’s schedule something for you too” I was like Wait what !! That was almost 6 years ago. I still have her number in speed dial", "krileytips": "Seeing a therapist has been incredibly helpful for me! I need to find a new one soon but I have had sessions where I cry a lot and I have also had sessions that have helped me recognize that my frustrations are valid but there are tools to navigate those situations. I can also attest to my personal growth since seeing therapists. We go through different challenges and different seasons and it requires different kinds of support. Thanks for sharing about this! 🙏🏽", "brownsking0ddess": "Still very proud of you for this!! 💜🙌🏾", "curvygirlcorner": "Therapy is needed sometimes. I definitely needed it after having my first child, I just went through so much during and after labor. I feel a million times better and therapy was one of the best decisions I made.", "octoberhello": "I looooooove therapy. I’ve just started going back a couple of weeks ago and I wish I didn’t wait two years to do it. It’s already helping me and it’s the best thing I’ve done for myself in a while. ♥️", "aniciangozi": "🤣 Hate cutting my weave budget for wellness things but so. Worth. It", "dnichole365": "Therapy is essential.", "miyachemiere": "Therapy is very important. I’ve never been but I’ve thought about it, just to clear my mind and make sure I’m on that right track. This post gave me that push, I’m checking out that website now. Thank you. 🙏🏾😘", "ashlie_elsewhere": "Love therapy when it’s with the right therapist. I was listening to a book the other day, and the author was talking about how athletes have coaches to keep them on top of their games (even if they are the best in the world), why should people have coaches for other aspects of life? And it hit me, therapists are emotional coaches. 🙌 Nothing wrong with trying to be on top of the game with your coach at your side.", "tamika.is.magical": "I have been in the past and I have an appointment to return in May. I have lots of anxiety that sometimes leads to depression, so I decided to go back.", "kathleenbolamba": "Therapy has been one of the most transformative experiences of my life. It’s been amazing to be in a space where I get to pursue wholeness and work on myself.", "iam_christinamarie": "I work in Mental Health in DC... through counseling my clients I’ve come to realize that I need just as much therapy as they do😳 EVERYONE can benefit from having someone who can assist with working out the kinks... it absolutely DOES NOT mean you are crazy or weak.. in fact, it’s the opposite!", "chelleb_29": "I say the same thing, everyone needs a lil therapy. My boyfriend has even gotten counseling. I myself am looking for a counselor too.", "xo_antonette": "I cried during my phone consultation, I can only imagine how each session will go! Lol I’m looking forward to it tho", "cokonee": "Kudos to you!👏🏾👏🏾👏🏾. The negative stigma about therapy definitely needs to be casted away, especially within Black communities! We seek medical treatment for every other body part that ails us; however, when it comes to seeking treatment for our minds/mental health, it’s frowned upon. Therapy (with the right therapist) is a God-send! #SelfCare #SelfAwareness", "academicladym": "Love reading this. I’m a counselor and counseling professor and I love seeing the stigma broken down. Even though Counseling is my field and I still go to counseling when needed. I also didn’t know about therapyforblackgirls.com. So, thanks for sharing!!!", "whatyayawears": "I've been and continue to go. My 18yr old is a cancer survivor and he's having emotional issues stemming from his cancer ordeal and so I'm now sending him to counseling. I think EVERYONE needs it", "sophisticatedandsassy": "I go once a month and I think it’s so important, especially as a black woman because we often carry so much stuff for others", "talesofnannydanny": "I just love you! Thank u for sharing and encouraging others! Therapy is a gift we give to ourselves! And the best way to showing self love! It will all come together! Enjoy your journey.", "chels_in_pearls": "❤️❤️❤️", "brittanydorsey": "I’ve been in therapy since July of last year. It’s been honestly the best thing for me. I was able to put a name to some of my issues (adjustment disorder, mild anxiety, and depressive moods) that now I know I’m not just crazy! Lol. I have been super open before and after starting therapy that I think everyone should at least try it. It’s so good to hear that you’re embarking on this journey! Mental health is so important and I love hearing others be open about it! ❤️", "sincerelybree_": "Thanks for sharing! Seeing my therapist is crucial for my well-being. I've seen the same therapist since I was 16 (I'm 24 now). He's talked me through multiple stages of my life and helped me talk out some family issues I didn't even know I had but were affecting my growth as a woman. And sometimes it's just good for me to check in with him to make sure I'm staying on track.", "akiliphillips": "Yes! I tried Talkspace last year and my therapist was amazing. I will fitting it into my budget again this year!", "audreypatriciaw": "Wow, I’m going to fly to Chicago just to be in your presence", "thatchickandria": "Good morning, I absolutely go to therapy. I go because I have to work on me. I think the common misconception is that something catastrophic has to happen to need therapy. That is just not true. Life is stressful and sometimes emotions are hard AF to deal with. For me therapy is a tool to help me understand my own thoughts and behaviors so that I can be my best self. There is nothing embarrassing about it. I leave my therapy sessions feeling 10 pounds lighter.", "m4drude": "I’ve been seeing my black woman therapist for a little over a year now and it’s changed my life completely!!!! It took me awhile to seek her out but I did a ton of research and decided to go with it. I cried during our intake call because i was happy is found someone but also really unsure if I was ready to go through with it. Our first appt changed everything for me like I left feeling 40 pounds lighter. Don’t know how I’d be doing if I hadn’t found her", "1rush7": "i literally was just thinking of your magical trip to 🇬🇭 Ghana 🇬🇭 and how blessed u are to share this journey called L I F E with so many of us.....i adore u! Peace Love Happiness Blessings Beautiful Women😍♥️😍💃🏾", "camarie22": "This post made my heart smile! ❤️ I am a true advocate of therapy and have been on and off. I think we as people of color are some of the biggest critics of therapy and unfortunately many of us truly need it to help us move forward and heal past hurts and messages that are holding us back from living as open and free as we can be!! Congrats on what will be a hard yet enlightening journey!! 👏🏾👏🏾", "koricoleman_": "So glad you are sharing this Hayet. I’m on the hunt for a therapist as well 💕", "heyitsbkay": "Proud of you! Just started going back yesterday. Finally have a black woman too. 🙌🏾 Unfortunately my family doesn't quite understand so I'm trying to work through that, but it's so important and I'm glad i took this step to bettering me!", "phoenixalazam": "Gorgeous! My therapist get in my life", "anniedumashie": "Thanks so so much for sharing!!Started in January and stopped midway because I felt like it meant I was crazy. But I’ve realized I still need the help so who cares if it means I have a problem bruh!🤷🏾‍♀️", "thepushedenvelope": "Seeing a therapist has been one of the most valuable changes I’ve made in the past year. It took me almost 4 months to stop crying every session but now it’s such a breeze. I have to find a new one once I move to Chicago in two weeks and that’s a little scary but I’m sooooo glad I’ve had a great experience so far. 🖤🖤🖤🖤", "marquessa_peprah": "Proud of you Hayet", "regina_marie_powers_": "Agree😍", "everythingnaart": "@thepeoples_therapist", "frankietavares": "🙋🏻‍♀️ I love my therapist, just sayin! There is no shame saying you need the help because shoot life is hard to manage! I believe you are stronger to 1. Admit it 2. Actually go and follow through. Sometimes you don’t realize it but the solution is just to TALK. You never cease to amaze me, I’m proud of you my beautiful Hayet and you don’t know how many people you are helping with this post! 🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "yourfavefashionblogger": "Thank you for sharing. @hayet.rida I've been looking for a black woman therapist and I couldn't find a resource for it.", "authenticity_4life": "I have been as well as am studying to be a therapist... I truly think our culture needs more normalizing of therapy so thank you for sharing", "ste_phany": "Prior to getting married I went to therapy because I felt like I had to finish putting myself together prior to committing myself to someone else. I didn’t want to bring my hang ups, self doubts, etc. into this new partnership and thank god I did. There was so much about myself and my past that I didn’t openly acknowledge. I think it made me a better wife. After having my son, it was tough for me to come to grips with my new identity as a mother AND wife. I went back to therapy by myself and with my husband and it really helped both of us to understand our new roles and becoming closer partners and parents. Mental and emotional health is just as important as physical health. I wish more people invested in it, in themselves.", "ashleyerin87": "I started seeing a therapist last year and I love her! She is a black woman too so that's super helpful. I also had to learn that there is no magic number of sessions. You just go when you need to. Just like a Dr. Appt. You have to go and get your mental check up too 😊 I encourage everyone to try it and I promise you will feel better 💗", "neciebug": "We don’t have to go to therapy for 20-30 years, but every now and then we need a tune-up. 10 weeks will get the job done if we are honest and receptive. That has been my experience.", "jenjeanpierre": "Therapy saved my life! I’m a huge advocate of it. I felt stronger instantly because I chose to go to therapy instead of “powering” through on my own. I don’t go now but if I could afford the lady I liked, I would go once a month just to reset.", "iva2514": "I go and I feel it is a safe space to share, process, reflect and reframe. It makes me self aware of my self and my stuff (baggage). I think you go as long as it takes. Just like we invest in gyms to support our best physical selves. Therapy is a way to support our best emotional selves.", "deja_quin": "I have been going to therapy for years off and on. I've learned coping skills to work through depression and anxiety and body image issues. I used to be embarrassed to admit that I needed a therapist. But now I speak freely about it and I enjoy it, and encourage others to seek a counseling as well. I have had several \"aha\" moments of clarity that have allowed me to heal or cope with the broken parts of me. It's a beautiful thing❤"}