{"iamllee": "My dream is to do something prolific. My dreams is to be free of my job this year and start on a road of financial well being. This year I am making huge decisions that require money and I am asking God to just be with me as I do those things. I also want to invest more into my husband as he does in me. He has already started me on the right path. I hope to nature and water his dreams as well", "fashndelight": "❤️❤️💋", "chrissiemitchpartyof6": "Raise my kids to dream unlimitless and do whatever they can to help others🙏❤👌", "beingbobbie": "@hayet.rida I cameacross your IG and blog on yesterday and I have to say I love your blog-and you've became one of my fav's....and in a day of reading up on you, you have inspired me to....1). Keep at my blogging and get better and be consistent 2). Your posts showed me, its ok to be transparent. Sometimes, I struggle in this area when it comes to sharing some personal things on the internet. To answer the original question, my dream is to inspire women to pursue their goals in life-whatever that may be. Now, I'm good at pushing and helping others, but often find it hard to do the same for myself.", "nekyokoro": "My dream is to establish an excellently comfortable retirement home where the old people around us can be acomodated and still feel like its home to them... Giving them the pleasure of cherishing their last moment on earth... Helping them fufil their deepest dreams which may seem to them as too late to fufil", "curvyds": "Amazing in red", "neera__a": "My dream is to create a space where people feel safe to talk about their mental health, a judgment free space where people with mental health illnesses are not judged or stigmatized but rather embraced and supported through their healing process", "louwinkles": "My dream is to touch lives. Especially people with similar backgrounds to mine... I want to empower people with the tools to live their best life. I want to inspire and be far reaching...", "hersplendidlifestyle": "Pretty in red", "toritalks": "My dream is to inspire people from all over the world to go after what they want, to live boldly and fiercely and be confident while doing it whether that’s through traveling, Fashion, your career or who you choose to date. My mantra is ‘Go For It’ and I want everything that I put out to", "totallytot3": "My dream is to see people healed and whole. Healed from past hurts, insecurities, heartbreaks, grief, and etc. I pray that what God has given me is birthed this year and this will aid people in the healing process. I truly believe that we can all turn pain to purpose. 💓✨🤗💪🏾", "ckkinged": "I want to help, and I want to make people smile,", "tyalexander\nVerified": "Verified", "sheis2die4": "@hayet.rida. my dream is to share my many talents with the world. Singing, comedy, and everything in between.", "feliciasbraidsstudio": "My dream is to become a well known hairstylist in the world but I don't know how that's gonna happen😀😀", "joycekdavies": "Your smile is beautiful!! Love the look", "shadowsorceress": "BTW you are stunning in this shade of red", "fromparriswlove": "My dream is to get accepted into medical school this year and become the first person in my family to become a doctor! 🙌🏿", "vetanyc": "😃", "jmilagrosplus\nVerified": "Verified", "kevwemowarin": "To inspire women to not settle for less than they deserve. My mission with @koviemofficial is to bring a feminine experience to an industry that has only been open to men for decades. Empowered woman should be able to experience the luxury of a custom piece - just like the guys do!", "maryonubedo": "My dream is to become philanthropist and voice advocacy for people with challenge and condition never to give up no matter their situation and condition especially helping women and girl secure their future.( I too have a little problem with hearing and it affects my speech I have faced rejection denied and discrimination but I never give up)and I want be a fashion entrepreneur that's 'beauty beyond size and height' Cos we have been neglected and rejected in the fashion and modelling world.", "fabulouslyfallon": "My dream is to travel, write, and or blog, and be financially stable while doing it!", "out_figure_it": "My dream is to help female prisoners back home in Ghana", "yarizari_": "I love how you caught my like out of the thousand something people 💜 hahaha... my dream this year is to create a wholistic version of self love for myself. I’ve noticed that I’m great when it comes to a personalized type of self love, but I haven’t been able to transfer that on over to what I’m passionate in. For me it’s always one or the other, so this year I wish to seek balance & distribution. My word this year is “Believe,” to Believe in myself on every level possible, say YES more often even when it scares me and to stop doubting my greatness and belittling the very things that make me “ME” ✨ (Ps. Shed a tear writing this)", "the_cake_nerd": "As a graduate with a BSc, I didn't choose baking but I think it rather chose me at a time when I didn't really value myself. That power of creating something from nothing and the joy it brings people. It's indescribable. My dream is to attend a world class culinary Institute to learn from the very best. Come back home and train a new generation of Bakers with limitless imagination", "laurennicolefk": "There’s so many but the main for 2018: finish 2nd year of university with a first, model for more brands and continue to build Fashion Killer’s team of writers", "maedupmaven": "My dream is to own my own digital marketing business, specializing in marketing in the beauty industry, and to grow my freelance makeup and Microblading businesses.", "hart2heart_journee": "@hayet.rida My dream is to impact those that I reach beyond books and what happens in class. I dream to teach them all life skills, the importance of valuing life and those they love and also the importance of loving themselves. Every day I aspire to reach those thy many have given up on or those that just need a bit extra love, so they know not to give up and that of no one cares I “truly” care. I expect them to leave me a better scholar and individual every school year... this is the cliff notes version lll ❣️❣️😊😊☺️☺️☺️", "werkingwitwisdom": "My dream, purpose, passion, and life’s calling (I’m extra I know lol 💅🏾😂🙄) is to greatly impact my city by creating a new standard for public education", "frugalfatgirl": "My dream is to start a non-profit for young women that have been sexually abused. All my life I thought I was the only one. Young women need to be heard!", "zorzita": "😍😍😍GORGEOUS!!!", "darlingtiara": "Create film for tv and movies. Create cultural projects that inspire my community. Employ/support my folks. Mentor Black women and girls.", "kaliandkalki": "@hayet.rida: I loved your insta stories on how you reached your goals and I rarely find anything inspirational! I want to be free, to work for myself and to never be stuck to a 9-5 job. I want to write, and publish a novel, and use that money and the money I make off my blog to travel and teach and talk about race & gender & body issues.", "phatoutfabulous": "My dream is to use my writing to inspire women of all ethnicities and backgrounds to love themselves while also showing my own journey to become my maximized self👑👑👸🏾👸🏾👸🏾", "mavaliss": "My dream is to make my cupcake business flourish enough to become self employed . I strive to work solely on my passion - which is baking for people.", "anniedumashie": "My dream is to be an expert programmer who can help empower girls in tech by helping to train them and get them to work on various projects that can help shape the society technologically since there seems to be quite a few women in tech🙂.", "laurie_frempong": "My dream is to take my modeling career to a whole new level . And inspire more girls to pursue their modeling dreams no matter the odds .", "afiadrah": "My dream is to provide bespoke breakfast service with options for people with classic appetite for good food.", "shirleyannaphrodite": "You’re an Angel.🌹", "eclectic_stereo": "My dream is to one day inspire women/ particularly young wives to continue following THEIR dreams all while still being a wife/ and or mother. We as women often put ourselves on hold to cater to our families and often live life regretting or resenting our spouse and children because we are unhappy. I want to show women that we do not have to press pause on us to play our role for them.", "daniegirl33": "My dream is to inspire women to reclaim their joy. Be in love with themselves and support themselves and others on their journey to happiness", "mkcurvy": "I love what you do! 😍 My dream is to dress and inspire curvy women on the one hand with a nod to my culture; @mkcurvy. I also hope to speak truths (through my writing) I've encountered in my life experiences to give others particularly women the courage to continue; @knotty_musings", "arugulachem": "My dream is to find my hidden purpose, support the preservation of my cultural heritage, and serve others (through education) with gifts God has given.", "crownedcanesha": "My dream is to have growth and exposure for my blog. I know my blog can be helpful to so many people I just need the bigger platform for it to shine.", "jeneseyquoi": "My dream is to become a bi-continental legal eagle whilst knowing my true purpose. Not sure what it is, but I know it involves being in the motherland 🇬🇭✊🏿👩🏿‍⚖️📚", "mikkibebe": "My dream is be the source of natural health remedies and parenting guidance.", "chinjunwankwo": "My dream is to successfully HAVE IT ALL! P.S., Not like Ryan in the girl’s trip movie😂 I want to have a strong relationship with God, be a loving & supporting wife/mother/sister/friend and a top entrepreneur in Africa. Even though they say it’s lonely at the top, I hope that I can influence and carry along a community of other women who have the similar dreams and aspirations✨", "tashkahiu": "My dream is to share my creative with people and put a smile on their face because they see something I did or made 😎", "mss.deee": "Beautiful", "audreypatriciaw": "My is to create & tell stories that people can really feel 🙌🏽 and to feel on your booty just once in my life 💕", "hephie_": "My dream is to become a successful woman whose sole aim will be to inspire young women who never felt like they could one way or the other rise to the top by defying certain odds that were made against them", "corynoles": "Having been inspired by many awesome women, I’d like to inspire other women to travel and live their lives. Be comfortable in their own skin...and not wait for the right man, partner, or nobody. Just work your budget and do your thang!", "baboun": "My dream is to live with confidence, I feel that my lack of confidence is linked to most things that I would like to change and it really hinders my life. I feel that people who are confident live better lives than I do.", "faithelle": "My dream is to provide youth and young adults with social justice and intersectional feminism-centered education, both inside and outside of the classroom. I’m currently a teacher who also works a second job, and I aspire to one day achieve financial stability doing what I love (so that I can devote all my energy to my calling as opposed to using half of it just figuring out how to survive).", "rootstomycurves": "My dream is to inspire women to fall in love with God and learn how to love themselves all of them self from their #RootstotheirCurves", "whatnickawore": "Hair crush 😍", "ihellaheartme": "My dream is to inspire people to live out their fullest potential and to find whatever their passion is and pursue it!", "accordingtoenid": "I want to tell the stories of women of color. I believe that we have unique perspectives and experiences that are important for us to share with each other. I want to empower the story-teller and the story-experiencer. We are never alone.", "talesandturbans": "My dream is to attend law school and use my experience working for the health department to bring awareness to the lack of care pregnant women receive in many poor countries. I would also love to turn my blog into a full time business while being TRULY happy with myself and travel the world with my family. ❤️", "thepinillosshow": "My Dream is to make other people feel seen... Not looked at not looked over but spirit so clear: Human to human in a safe place while searching to be our best Human Family. Promoting togetherness is my dream. Whoa, I never really wrote it down in that manner before... THIS WAS AN AWAKENING OF SORTS as this IS my dream! (Thank you for that, Hayet)", "theejessicarobin": "My dream is to reach people and make mental Heath a topic that no longer makes people squirm in their seat, but makes them excited to take care of themselves! Through body positivity, self care, and animal therapy :)", "jessica_kane": "Ohhhh great question because my dream is to create change in the world and inspire a generation of entrepreneurs- but I literally don’t know the plan! 😫 I just know that I’m headed in the right direction at the moment... I think! 😭", "curvidollface_": "My dream is to public speak on the stereotypes related to plus size women in society. Help build confidence and help people realize their self worth and create self love!", "dianae_official": "My dream is to be happy in any and everything I do. My other dream is to continue being a fighter for social justice for black and brown woman in Baltimore whole not being afraid to push back on societies microaggresions!", "moorestyleamorebeauty": "My dream is to positively impact the lives of individuals in a practical way which brings about change in their life, their families and communities. Both in the UK and Ghana.", "camilaheynow": "My dream is to create poetry and writing that inspires all women and open up a little coffee shop/art space and live my life happy and calm 🤞🏼", "itserikalanae": "My dream is to travel the world speaking to other women on life’s different topics .... helping women know or identify their self worth", "nicoleherzuk": "My dream is to finally get pregnant! My husband and I have been trying for a year and it's so frustrating! I just want to be a mother.", "adarlingplanner": "My dream is to live a life full of happiness and abundance that will not only inspire others but also become a catalyst to much bigger and more beautiful things for my family.", "curvaceouslybee": "My dream is create a mentor program for young girls centered around body positivity. I had my parents growing up to instil self worth and self love in me and feel things needs it.", "hayet.rida\nVerified": "Verified", "joanitalala": "YES", "roseybeeme\nVerified": "Verified", "annabella_mrst": "My dream is to take banking to the world through my coaching, podcasting and speaking gigs. Launching my podcast this Tuesday and I am taking my side hustle personal growth coaching gig to full time gig this year✨", "hashtagsandhandbags": "Our dream with our platform is to inspire women from all backgrounds and to genuinely connect with our readers. To be actively involved in charities or starting our own. We dream to partner with women’s shelters or other women’s organizations and even if only for a day to pamper and show these women how beautiful and special they are. Our dreams grow everyday and we hope to continue to connect with so many other beautiful and kind individuals like you in this world. Ps you look gorgeous!", "koshie_mills": "My dream is to use my craft(performing arts) to influence others and help People of Color by giving them the opportunities I couldn't get. I want to become an EGOT winner. I want to be in a very successful tv show. I want to let people escape from whatever by watching my show or film on the big screen or on their phone. I also want to start a makeup brand that is very affordable for women of color bc I don't believe we have to spend more trying to mix shades of foundation or concealsars. I want to be a successful model as well...it's so hard because I am not as skinny as most models that are portrayed everywhere, even with the shift in more plus sized models coming up. I also want to be able to someday finance more research about Autism bc I have family members that deal with that disability.", "kimhermajesty": "My dream is to tell my story while living in my truth! For my sons to not want or need for anything and for a child that may have experienced trials to know that roses can bloom in concrete.", "sweetlifeofvidette": "My dream is to one day succeed as an entertainer,become a household name and bring audiences joy always, as I strongly believe that art and entertainment fills a big lacuna in the world.", "bysimonemalcolm": "I have a lot of dreams. But my main one is to finish getting my masters in Journalism and becoming an on-air personality at a multimedia company like E! News or VH1. I want to inspire young women (black women/woc) in general that they can make their dreams turn into reality and it doesn't matter what size they are or the color of their skin. They can succeed in mainstream media.", "blmisson": "My dream is to learn to love myself and stop being so hard on myself- for me, but also for my daughter.", "thehoneybeeslifestyle": "To start a foundation that will provide operation grants to small non profits in Memphis that are lead by women of color. People want to fund programs but not general operations. Also, women of color in Memphis have a hard time competing for grant funds.", "tiffanytamera": "My goal is to make sure everyone feels that their place is in the this world. Differences are to be celebrated, not rejected. 🖤", "2cl_2classyladies": "I would like to use our blog to help inspire people to live their best selves and spread that to others. I want to leave a positive impact through that platform. And in my professional career, I want to make a difference no matter the how big or small as long as I can tip the world in a better and positive direction. I want to just try to leave the world in a better place than how I found it.", "davaughnmona": "One of my several dreams is to be the best Makeup Artist I️ can be, authentic, and highly sought after. I️ want to bring out every woman’s inner glow and for that to be reflected on her gorgeous face on the outside. I️ want to share through my experiences and my gift that beauty is reflected from the inside out! I️ want women and young girls to know their worth and that they are absolutely beautiful because their were times and still are moments when I️ struggle myself.", "bri.a_symone": "My dream is be a pioneer for the plus size fashion industry", "currey_travels_well": "My dream is to show women of color can travel to places we never thought of and open ourselves to learning and understanding new cultures.", "aliciae__": "So that little girls who are plus size can see we exist and never give up on their dreams ☺️", "krileytips": "My dream is to use my gifts and skills to create invaluable experiences for Black youth and women. I want to also create sustainable pipelines for young people who aspire to learn about event production and experiential marketing.", "laurenashley.style": "My dream is to make it as a fashion stylist and an influencer! I want to reach women in ways that help them tell their story! Being a young girl raised by a father with not many positive female role models was hard but that doesn't mean we have to let our circumstances be our story! So that's my dream to make it and help other women with a 'slim' chance make it too! Shout out to @Oprah \"fo real\" 😂🙌🏾", "themagalienormil": "My dream is to continue to advocate for the marginalized but figure out how to turn my current skills into a consultant side business.", "adjeiwaaboakye": "My dream is to help people to no longer be afraid to believe in themselves. To be able to find courage and take risk sometimes. Sometimes we’re so afraid of failure we never even try to push ourselves to see if we’ll even succeed or fail.", "tamika.is.magical": "My dream is to have a mentally, spiritually, financially stable family and group of friends.", "julesthejulia": "So my dream is to get to that masters and eventually my PhD and at the same time dealing with my genetic diseases. Also educate more people about my little island history 🙌🏽🌴", "breakingupwithobesity": "My dream is to help young and older women with PCOS learn to not only live but to thrive with this incurable disease. I want women to know that their diagnosis does not put a dent in their dreams of becoming mother and also that it does not reduce their womanhood. Pcos is just a name to all the crazy changes our body goes through.", "ladega747": "Just ask ?", "tayshannalisha": "Much love to you Queen👑👑", "tlwins1": "My dream is to provide Excellent healthcare to vulnerable populations & empower them to optimize their lives with intentional holistic health practices🖤", "thatchickandria": "My dream is to use my experiences to inspire others to be whole after being broken.", "thedanielleyoung\nVerified": "Verified", "ladymeriam": "I started 4 years ago with my webshop in plus size women’s clothing because I noticed that there is a lot of work to do in The Netherlands. I was insecure too but life is so much better now that I am ME! And that’s something I would like other women to be: be YOU💕 @embfashion @fabulousfattyk"}