{"em.hutchins\nVerified": "Verified", "shorttstuf": "For most of us, your body positivity and beauty inside and out is goals. Don’t mind the haters. Please pay them no mind", "shopalteregofashions": "So cute!!! 😍", "thisis30ish": "👏🏾👏🏾👏🏾", "prncsshelga": "💓", "sassielljk": "✨✨✨Yesssss!!!! #LifeStyleChanges #HealthyMind 🔥🔥🔥", "katherine_st_august": "This. 🙌🏼🙌🏼. Incredible", "hey.candace": "THIS 🙌🏾", "l.veland": "YOU are absolutely beautiful, sweetheart! Please never stop loving yourself. 😍😙", "zazama": "Yes to all of this", "pinkchic__": "💗💗💗💗💗💗💗💗💗", "caribbeanprincess34": "Amen 🙏🏽", "la_gurl1415": "yup yup!", "mwabana02": "👏🏾💪🏾🙌🏾", "tastesanaia": "💚💚💚💚💚", "brionna_arielle": "Love this and I 100% can relate. It’s all about loving your body at any size and then focusing on treating it like Home rather than obsessing over a weight or a fitness program 💕💕", "bright_endeavors": "Love this, you are capable of so much!", "ay_quavius": "Always love u....", "ppaigepowell": "@geralyn.gutierrez", "brittany_life": "THIS!!!!!! I need a counseling session with you!😩", "emcardenas": "Wish you still shared that part of your journey but totally understand. Keep on fueling you!!", "wanjikun": "Yes. ❤️IT!!!", "shbthepmp": "🙌🏾🙌🏾🙌🏾", "ebonyloislane": "TELL EM Hayet! I had to change the conversation as well because focusing on diets, weight loss etc was making me hate myself and others. Thank you being a motivator! PS - I’ve been trying Pilates training after watching your videos and all I can say is 🤦🏾‍♀️...", "thecurvyjoy": "Yasss to all this Hayet!! You’ve articulated EXACTLY how I feel! I look back on photos of my younger self and realize that I allowed society and conversations to make me “think” my body wasn’t good enough as it was. Thank you for helping me continue the way I see and view my strong capable body!! 💗", "mrsmaishac": "You inspire me on my fitness journey as well. It’s really important for women to know they can be comfortable with their bodies and go to the gym to become stronger and not conform to societal norms. Your instastories motivate me to get up and move around. Keep doing what makes you feel good.", "kedj2014": "Love just the way toi are , you are really a role model", "kene4.0": "Oshey training babe", "peppster": "You are amazing!", "christiemcmichen": "@hayet.rida preach 🙌🏻❤️", "jesuloba": "Amazing! What sort of training do you do", "apeaceofher": "Respect!!!!", "phoenixalazam": "You’re a blessing mama! Killin it and lookin hella fine!!! 😘", "theshirarose": "YES", "em.debouver": "I love you, your work ethic, your humor, your dedication. You inspire and help me more than you know. Thank you for being you. Xoxo", "fatmelaninshawty": "A word!! Such a word 👏🏾", "annmarie.swatson": "more self love and self care! i love it and i love you", "barb_zs": "What's your skin care routine 🤔", "chicagosophie": "Inspiring! I have dealt with body dysmorphia issues in my past and I can very much appreciate that you are focusing on health.", "loveronnie": "🙌🏽", "joantonia58": "Love🖤", "planetsierra": "So true, the frame of mind matters!! I used to put so much pressure on myself for being overweight. Eventually, I used to eat and treat myself horribly because I didn’t think I was worthy of feeling good. Fast forward to right now, I’m getting healthy, I make the goal of being more active daily (ie waking in my neighborhood) and eating balanced with no restrictions. I lost weight as a result but it was never about the weight. It was about surviving but even more about showing myself I’m worthy of feeing good, looking good, and being happy. Bless you and you’re journey. I relate to your story and it makes me happy that you accomplish so much!", "freely_nat": "🙌🏾🙌🏾🙌🏾", "grayt_full_life": "#YASSS #ThanksForSharing 💜 #YourWords... now, can you help me understand #TrainingVsWorkingOut? #ImWorkingToRetrainMyBrain. 😍💜😍", "iamlauralamptey": "@hayet.rida girl, when I’m at the gym wanting to punch my trainer I just think ‘WWHD’? Push thrrroouuggghh! The journey is great! #whatwouldhayetdo", "ladreadublin": "Love the outfit!", "joanitalala": "I now feel like I wanna hit the gym after seeing this pic", "msrfb": "You are absolutely EVERYTHING! #foreverinspired", "majestyacheampong": "U commitment to your health & consistent workouts is inspiring. Love what your doing to push yourself. 👏🏾", "syn_sei": "Girl yes!!! This has been such a shift in mindset, but I’m enjoying these training so much more now than I ever did when I was going to the gym to see changes on the scale. Thank you for sharing ❤️", "hairbymarkvilla": "@hayet.rida I love you for whom u are.. . . u are d best lady among all the ladies.. Do you know why?.... Just because you love your baby the way you are..", "ericakodjoe": "Yaaaaas!", "waakyeleaf": "🙌🏾😍", "lisarcharles": "You go love 😍", "myfemalepersuasion": "Seems like semantics. But you look great and great job! 💪🏾", "real_vimlady": "I like your confidence in your skin", "pluscurvychristian": "Love this @hayet.rida keep redirecting the children! Keep slaying too!", "ijeomakola": "Wait. I’m gonna replace workouts with train - I love that phrasing and what it implies!", "ntombigilman": "Baddie 😍", "ms_lyse": "Love this ♥️. I definitely needed this.", "alexandreacarte": "Get them together babe!! All the way together! 🖤", "stephshap": "Hayet! This is such a great reminder for all of us. THANK YOU.", "cicelyryan": "Way to go! 💪🏽", "koshie_mills": "I need to get a pair of those leggings! Also, I just want to say that ever since coming across your page, I’ve been so motivated by your dedication to your work and your passions; it always kicks me into gear when I see your stories and you’re being a bawse and getting shit done! Also watching a fellow African queen accomplish things always makes me believe that I can do it too. So thank you for all of it. I wish nothing more than blessing and positivity for your life.", "kandicediamond": "Love love love love you!!!", "im_alicia_": "Yaaaaassssss 👏🏽👏🏽👏🏽", "michelinabelle": "Love this! You’re amazing and I’m so inspired by you!", "frieddumpling": "@hayet.rida on the eve of my 33 birthday. I say thank you for your candor and unapologetic clarity around the unsolicited feedback and rhetoric around your body. Your honesty is refreshing and often reminds me to share my honest feedback when my oft well intentioned West Indian family members comment on my “Rosieness or plumpness” AKA weight gain/loss and everything in between. Thanks!! You’re luminescent and resilient and inspiring. F-A-B-U-L-O-U-S!!!", "mispoks": "Word! Body shaming is a serious issue. We need to do better. So proud of u for your strength in all of this.", "jenjeanpierre": "I’m trying to break my mental issue of trying to lose weight over just being healthy. I think because I have never been this heavy andalways an athlete I’m just shocked that my body doesn’t behave the way I’m used to. Thank you for the reminder.", "lovelyinla": "Boom! Love this @hayet.rida 😘😘😘", "jerakahheady": "I’m in Chicago for the first time right now. Thank you for posting this!", "missalexlarosa": "Love this!!", "tastys_grill_bar": "❤️❤️❤️😍", "chaseshadows89": "Hahah! ...then don’t 😭😭✊🏾", "otisinchicago": "Well I’ll be over here printing out this caption, labeling it “mantra” and hanging it in front of every mirror in my house now ✌🏽❤️ @nylez1", "sinmi.araoye": "Thank you for sharing your journey! It is helping me change the way I approach my health and my body.", "selormjay": "What your hair care routine??😍"}