{"hayet.rida\nVerified": "Verified", "dee.diary": "Girl. I just read that post. That's awful! But it's a reality in Ghana. Everytime I see family after a long time I cringe. The conversation always starts with \"you put on\" or \"are you eating? You lost weight\". It's like people can't have a normal conversation without discussing your weight. It's not you Hayet. It's our \"culture\"", "amma_th": "Story of my life when I'm visiting Ghana, it's got to the point now the aunties consider me rude by my responses and I like it!! Keep you head up, your amazing 🌟🙌🏾🏆 @hayet.rida", "lapisofluxury": "Slay! ✨🔥🔥🔥", "mispapelicos\nVerified": "Verified", "esinam_lucy": "This is something I also face almost everyday. I try ignore them and it gets so annoying sometimes. But I love the way I look and I know it took me so long to get to this point. Keep slaying girl. Keep doing you. 👍👍👍👍", "becurvy.de": "❤", "cortnieelizabeth": "Just read your post and it almost had me in tears. To make fun of anyone because of their appearance...no one deserves that. You ALWAYS look great and I love that you use your blog to speak out on so many things. Keep it up!😙", "carollmalloy": "Yea! :)", "finessecurves314": "Seriously?!! Now way! You're not even big! LOL-they would probably rip me to shreds... I thought they liked em thick?!!", "adacollection": "What a great color on you! Love your styling!", "blackeye_____": "Wow", "aliciacaillier": "I think this is my favorite look of all time", "daarliving": "Gorgeous! Need this dress @hayet.rida where??", "the.a.league": "@hayet.rida this post is so necessary. Second, God knows my heart cuz I checked for that dress and it's not in my size.", "curved.and.pretty": "Like it!", "shondrabondra": "Thank you so much! Keep slaying!", "fauxdenzel": "❤️❤️💕", "loshmusic": ":)", "divadeliciousgh": "🔥🔥🔥", "nineteen57_africa\nVerified": "Verified", "thelexiewilson": "Omg! You look FUEGO!", "stargemss": "Looooove", "bebes_at_the_beach": "r u serious?? so sad! i think women are beautiful at any size! Confidence is most attractive! Ive met so many women 1/2 my size way more insecure than me...its taking me yrs to b happy in the body God gave me...as it does still change weight up & down...i will always b \"full figured\" or plus size..which is a label i have learned to accept & love♡ U are beautiful just the way u are!", "ijeomakola": "But you slayed so...!", "samuelkearthur": "What a fruit", "ghno1bloggamedia": "Simply gorgeous", "anitamatey_": "🙌🏾🙌🏾🙌🏾🙌🏾", "a.k.agyemang": "I watch you everyday on snap with that beautiful personality of yours. You're so beautiful inside and out and don't let anyone tell you otherwise. I don't know you personaly but I can feel it when I look at you. I know how our people can be. They say things without considering the person's feelings. Forget them. Mwaa", "iampurdyanthony": "🔥🔥🔥🔥🔥", "outofthecorner": "Love this writeup. Thanks for standing up for all of us", "tarramichell": "You are absolutely Beautiful! I have narried to Ghanaian men and I am far bigger than you. I have dated several more, I think it is crazy that they would treat you a nornal size young lady this way! My current boyfriend just gave his neices a hard time for being to skinny. Keep doing you and sharing! I am now a fan for life!", "lauralights7": "You look fabulous! Really proud of you💙", "thelittlewifechronicle": "You are beautiful and curvy,God loves you just the way you are,and that's the only true opinion that matters.keep doing you girl and you can't lose!", "cakedbyjimica": "Loved and appreciated the blog because this is real everyday for many! You're perfectly FINE💜", "chicagoings": "FLY! ✈", "missbarnes": "Looking fierce, Hayet!", "emiliesobel": "🙌❤️", "hisroyalblacknesskkd": "The body is only a place to keep heart, mind and soul warm. True beauty within is wrapped and cased in all shapes and sizes. It takes sharp minds and good hearts to see. Bless you and yours @hayet.rida", "cathy_lizzy": "Yes!", "dark_kent87": "haters are going to hate when they can't comprehend GREAT @hayet.rida", "m4drude": "Wow! About to read the post! You look amazing!!!", "mizwoochic": "Very empowering post!!! Thank you for using your platform to benefit so many 🙌🏾🙌🏾🙌🏾", "lenorashewrote": "💛👑", "achmedlachned": "10 Stars ⭐", "chardlinechanel": "Loved reading it and can so relate 😫❤️", "aboutthatcurvylife": "Are you coming to Lagos @hayet.rida?", "theamandaspann": "Ohhh that orange is ravishing"}