{"mistymandrell": "Cannot wait to read @hayet.rida. like you I am that strong friend also and you are a great inspiration", "signed_e": "Glow ✨✨", "being_ericka": "I can’t wait. Thank you already", "flizzers": "💜💜💜", "themermaidstudio": "i applaud your courage and look forward to your post", "helloshumie": "Soul sister 🧡 love you strong, beautiful, soft, vulnerable, amazing girl 🌟", "deborahcooksinbrooklyn_": "You are beautiful inside and out the struggles with depression are real it is a good thing that you are able to talk and now write about it.", "deja_quin": "Looking forward to it. Great title, the ones who suffer the most often seem to be the strongest. A feeling I know all too well. Thank you for sharing, it really helps ones like myself know that we aren't alone.❤", "stylebynkiru": "I love this, can't wait to read it ♥️", "pearlglowcustombathandbody": "💕💕💕", "shayroy74": "Can’t wait to read...", "edenstheory": "Hugs @hayet.rida", "ylakatie": "You are so lovely and brave to share this! ❤️❤️ Sending you all the light and love, gurl!", "sweatersinaugust": "That title. Thank you for sharing, take your time! 🙌🏾", "everythingnaart": "❤️❤️❤️❤️", "nataliesherice": "❤️", "lamdarys": "Divina", "neera__a": "❤❤❤❤", "wanderingwakandans": "Thanks for always saying what many of us are afraid to say out loud.", "sugarcms": "Thank you for sharing! I totally understand. Blessings", "nola.ish": "Take care of yourself, love.", "krystalonthemove": "Your hair is always on point. I want to do a leave out but Im scared. Are you edges permed? @hayet.rida", "electedladi": "#prettygang 😍", "kurvesofsteel": "Can't wait for the post.", "iamvanessa_a": "Awww I can totally relate can't wait to read it.", "missmetito": "Hugs. #ittakesavillage", "friendsofmentalhealthgh": "As a Ghanaian based NGO that focuses on mental health, we have to commend you on this bold, brave step. Talking about mental health is not an easy one, but by sharing your story, you're giving so many others the courage to do so as well. Thank you for doing your part to reduce the stigma surrounding mental illness.❤", "nishgabrielle": "Stay strong Hayet", "rho_delle": "Story of my life. Will be looking out for it. Thanks and stay strong.", "senormaki": "💝🙏🏾", "mamaayomide": "✌🏼💕", "selibaisie": "I can’t wait you’re so real ❤️@hayet.rida", "fashndelight": "✨✨", "odaraonline": "Strength ♥️", "afoah_afful": "Pretty😍", "diamondnite11": "Thank you for being brave and for helping others through your truth. ❤️", "complexflavors": "#prettygirl it was good seeing you", "balance_and_grace": "❤️", "mojisolalove": "You are so beautiful dear warrior... stay strong... this too shall pass....🙏🏿💕💕💕🙏🏿", "katrinaw6988": "Very pretty!😍", "mrsstudio": "❤❤❤", "rebeccaknavarro": "Aw gosh 🙏🏻✨", "aisha_ayensu": "❤️❤️❤️", "susanthesong": "You’re so courageous! Can’t wait to read this!", "hersocialgrooveandbaby": "@hayet.rida I cannot wait to read this blog post. You’re incredible, always 💓", "ruthfarr": "The article title rings so true with me! So brave. Xx", "thewanderlustingafro": "I have the same struggle. What makes me sad is the aftermath. Seeing who is only your friend in the superficial and who is in it deeply. I’ll be looking forward to your post. I have a lot to say in regards to this struggle.", "farrahromaine": "“Post Soon come”...are u Jamaican?? 😂", "mostgorgeous1": "Hi Gorgeous! I commend you for even sharing this much. This will bless so many! Can't wait to read and share. 🤗", "dgarten": "I applaud you, Hayet, for being so brutally honest and sharing these personal struggles. 👏💜", "iamplusblog": "💕💕💕", "jojob84": "Can’t wait to read this! Thanks for shedding light on this issue!", "royaltycosmos": "You are the sunshine to earth. ♥️👑 #kinging", "maverickmau": "Thanks I will be waiting phenomenal woman. Your so strong 💪🏽 and I will always admire you.", "selfcareirl": "Love you!", "dedeofei": "@hayet.rida you're a warrior. You have come a long way on this journey. I applaud you. I look forward to reading the blog post.", "butterfli4000": "❤️You are not alone it is definitely a battle", "missmandy06": "Can’t wait to read it!", "fenyxxrising": "Thank you for sharing this!", "mzaprillynne": "I need this. Thanks for being open and sharing your story with us. 💕🤗hugs.", "kissbele_27": "You are beautiful... greetings from México 😘", "keeya_prempeh": "❤", "d_angel7": "I can relate. Great title!", "i_am_yolanda1": "@hayet.rida I feel you, it’s always when you’re at your lowest, that unless you actually tell people, they would never guess that behind the ‘am fine’ and the smile, you’re slowly falling apart.", "claudiagyimah": "You are gorgeous", "1kabs": "During your battle you’ve been determined, generous, so sweet and radiant, and worked to create a space where women can love and be ourselves. In creating that you’ve also created a community for yourself. You are bomb, and worthy of all you desire. Sending love 💗, and anticipation -My Friends’ Strong Friend", "grivi": "💛", "deniceone": "I know that face and the struggle oh too well...😘", "loliluxe": "I have goosebumps, I’m really looking forward to reading it.  I’ve also always been the #strongfriend and have been diagnosed as depressed since I was five years old. Solidarity, my Sis. ✊🏽", "wilsonjohanna": "🙏🏾🙏🏾🙏🏾", "y_handbags": "🙏🏾", "shadowsorceress": "Haven't even read it yet but I DEEPLY RELATE to being the \"strong friend\" 😩 #thestruggleisreal", "just.b.michelle": "Can’t wait to read and learn ways of supporting you as we all get through this crazy journey called life ❤️", "thecurvyjoy": "Thank you @hayet.rida for sharing your story. Last week I actually said the words out loud to a friend instead of my usual response “I’m okay” that I wasn’t okay. It was hard but so glad I took the first step of reaching out for help", "strictly_iveren": "🤗 🤗 🤗", "el_veee": "I have a similar picture of when I was deep in a episode. I can tell I was a mess but I don’t think anyone else could. Thank you for sharing your story. None of us are alone. ❤️", "trinette_ray": "Cant wait for the post. I have an anxious anticipation for a post I just feel will be my mirror. I love and thank you for sharing.", "miyachemiere": "🙏🏾🙏🏾🙏🏾 I can’t wait to read it! You’re such an inspiration! We love you! 😘😘", "lilianmcn": "Big hug!! ❤️", "elle_winnie": "I truly look forward to the read, and thank you for being vulnerable and brave enough to share. . . too many people are suffering in silence. ❤", "ms_pretty_whitney": "Thanking you in advance for sharing your experience. 💝💝", "balancedbeauti": "Anticipating this read so much 🖤", "martinakwartengmaa": "We the strong friends need this", "nicoledenise13": "🙏🏾 thank you for your transparency. Sending light & love and a hug cyber hug 🤗 to you. 💛", "jianisapathy": "💜💖 thank you for sharing", "kashkally": "Wow!", "sachaokoh": "🙏🏾 @hayet.rida", "mayacody": "What a glow 😍 from inside out", "shawanav": "So ready for this post! Much needed! You already know how I feel about you and your awesomeness💕💕😘", "themodernhippiec": "🙏🏽", "mz_quayson": "I just love you, that's it. I love u n u r a wonderful human being. God bless you", "mrsaaa1204": "So proud of you, and you look amazing 🖤🖤🖤🖤🖤", "alleluia_official": "❤aunttyyyyyyyyyyyy", "creative_curves": "I can not wait to read this!", "pgtech02": "💗💗", "ajjavictoriaa": "Thank you for this! I spotted you at Sliver Room Block Party and you looked stunning, btw!", "yeauxadrienne_": "😣❤️❤️", "tatyanajalisa": "❤️✨ can’t wait to read it!", "kimhermajesty": "Same here 🙋🏾‍♀️🙋🏾‍♀️🙋🏾‍♀️", "jjdoeslife": "Can’t wait to read it; thank you for sharing your truth!", "kirachambas": "beautiful strength.", "nwabisayilimphakalasi": "You look so beautiful in this photo❤", "elizabethogabi": "Soooooo cute! ☀️", "heidipprc": "🙏🏾❤️🙏🏾🙏🏾🙏🏾", "kellyaugustineb\nVerified": "Verified", "breakingupwithobesity": "😭😭😭😩😩 just have to you are amazing Hayet. 🦋💙", "newtonberry": "Thank you so much for taking the time to write about this hard topic. I am glad that more and more people, bloggers and strong individuals are taking the time to acknowledge and shed some the needed sun light on this painful topic. Your courage is appreciated more than you will never know. #depressionisreal and #strongfriendsneedsupporttoo!", "sowairina\nVerified": "Verified", "pthomasny": "✨💫", "tchissole": "U r gourgeous!!! A gourgeous woman, an inspiration to many and after this I believe too all of us who follow you. Keep shining💖", "deidra_justabeauty_dee": "@hayet.rida I cannot wait to read this! Definitely going to be a wonderful moment to tell your story and help so many that deal with this everyday❤️", "ajglo74": "Prayers for you love❤❤❤", "elsanahna": "Totally adorable @hayet.rida is what i would think but know the feeling of the dark shadows that lurk inside. Side bar: Why do you think depression is not a massive topic in African countries?", "asanteselina": "Pretty", "ansawe": "Thank you for sharing. I have those days where I’d like to get a check in, but I think because I always dote on my friends, they feel that I’m “okay”.", "deylasblog": "I thank God for the courage to share your story online where many are wearing masks and pretending to be “okay”, behind a selfie with many “likes”. I’m looking forward to reading your post.", "the.leaux.down": "Your story will touch others! It took a few months for me to get the courage to post publish on my story! ❤️❤️❤️🙏🏾", "jdprofiles100": "Thank you Queen for sharing your story.", "mena_adubea": "🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾", "young_lele130": "YOU ARE SUCH A BEAUTIFUL LADY 💕 THERE IS NO MORE I CAN SAY BUT KEEP LETTING THAT LIGHT SHINE BRIGHT IT COME FROM THE INSIDE 🌹", "ingrid_3bs": "Ahhh man! I can relate to that title!! Praying for you!", "nicadavischarity": "Tears because I too smile because I know they don't want to hear it...all I've heard is your not better yet...how do I explain I pain so deep that you just want out...you just want it to stop ...but it's not like the pain of a cut that will heal in a week's time ...it lingers and lingers and at time nothing makes me feel good not even the food that I use to try and fell better ...I so understand and I love you for being you ...I'm a mother and a wife and I've learned how to pretend for them sigh..my daughter only 5 breaks my heart when she says mommy your not well again ...I will be waiting to read your post and share in the comfort that I'm not alone even though it feels like it...", "sinmi.araoye": "Thank you for speaking out! To be honest, your bravery inspires me to speak the truth as well.", "morgangenell": "You are amazing!!!! I love watching your journey. Your transparency is inspiring! Please know that you are more perfect on your imperfections than you could ever imagine! I love the overflow of women fighting past the lies! Can’t wait to read your post!", "surv_sedemafaglo": "You’re so beautiful 😭", "geli.dvs": "I can’t say that I suffer from clinical depression but I’m often the strong friend who smiles in public and cries alone. I do have friends who suffer from depression and I’d like to be able to recognize the signs that they need my help. I’m looking forward to your blog post. Thanks for sharing.", "mogvibemuzik": "You are Phenomenal! Blessings to you and your Family! My Daughter Christina thinks highly of you! 🙏🏾😀🌹", "divinity15": "These edges are the truth !!!!", "omari_hasani": "🙏🏾❤️", "ktapthat": "i cannot wait to read this. thank you for your vulnerability - it is always appreciated. 💜", "candiceobeauty": "Thanking you in advance for your transparency on a much needed conversation", "ebbsandflo": "Yessss", "lautumnco": "♥️♥️ a must read. I can totally relate", "expeditionsubsahara": "I am a silent follower but I rarely comment though I love your spirit. You’re strength is what I love most and I command you for sitting down and writing your truth. I can’t wait to read and share as I’m sure many of our strong friends could use a shoulder and we don’t even see the signs.", "_ahwenepa": "Can't wait , u such an inspiration 😍🙏", "stylewithpatience": "I admire your bravery to discuss such a sensitive subject", "mispoks": "Can't wait to read it! You are very strong, brave and beautiful.", "lovingthispaige": "❤️"}