{"maureen_biney": "🧡🧡", "kurvesofsteel": "Thank you @hayet.rida you don't know how much we needed this. Thank you so so much as many times we never hear the giving up stories of those that have made it. Well this has made my day.", "unapologetically_lisa": "@hayet.rida @runwaywithkay 4:39am... can't sleep because of the place I'm in mentally. This post gave me chills. Wow. @hayet.rida ,Your Truth today has been my deliverance. I appreciate your transparency. Thank You!", "lousbeautycloset": "Thanks for sharing and being authentic! You go girl 🔥 💖", "mmasita": "❤️❤️❤️", "heartprintandstyle": "amen, o!", "msjadeonline": "Such a real and inspiring post! Thanks for sharing xx", "jessecalane": "🙌🏼❤️🙌🏼❤️", "callherkris": "You go girl!!!!!", "tatenda_williams": "@hayet.rida 🙏🏾 thanks for sharing! Very motivational", "akosua6a": "My Princess .", "livewithmjb": "Much needed motivation!! Thank you💕💕💕", "tabithafaith": "You are awesome! Thanks for sharing.", "jesskeys_": "Omg so true!!! I don’t think I’ll ever get over that fear of having nobody show up for events! One time there was a blizzard so literally the only person who came was my husband 🤦🏻‍♀️ It was so awesome to meet you tonight! Excited for all the great things you have heading your way and let’s meet up again soon! ❤️", "lollysticks": "Suited🔥🔥❤", "lmarabe": "Thanks for sharing!", "hereinthestudio": "Timing of this motivational post couldn’t be more perfect! Needed this 💕🙌🏼", "millicentarkoh": "😘😘😘😘", "mrdoorsee": "God’s Plan 🙏🏾💕✨", "thevalidlife": "Gorgeous! Love this motivational post! 💕✨", "y_handbags": "😍beautiful.. thanks for sharing this msg 🙏🏾", "reesey314": "Thank you for this beautiful post, it is on point and what I needed to hear/read today. I have had several low points lately and sometimes a struggle to understand why and why things impact me so.... And, it is hard to stay strong when you are not feeling like yourself. Thanks for being human and transparent, it gives me so much hope that people are actually real on social media. Thank you, thank you! And I wish you well as you weather the storm, the sun will always shine.", "skipperstyles": "Amazing.im speechless with your inspirational words. Thanks", "thealexisedition": "@hayet.rida love this suit! Where can I buy?", "officialnita_01": "Beautiful", "driftyness": "I am so interested in your journey. I always wondered how people paid for photoshoots and clothes and how much they cost to begin with. Are you able to share a bit more? Would love to add some personal style posts to my blog but have no idea where/how to start. I'm glad you didn't give up. Congratulations on how far you've come and how much you stuck to it 👏👏", "anissagail.hergoals": "Thank you for these words!", "curvygirlcorner": "❤️❤️❤️", "a_shorks": "Thanks so much for this🙏🏽✊🏽.", "thekaycoleman": "@hayet.rida thank you for your vulnerability and for not giving up. You are a blessing. 💛", "ineffablewaters": "❤❤❤❤❤❤❤❤❤", "originalmaigi2": "Much love from 🇿🇦. Going to share with my sisters 😘", "mzally_p": "Thank you", "chocolatencurves": "🙌🏾", "ivadevaughn": "Thank YOU!! We need you sis!! 😘💚", "phoenixalazam": "Yes my love I’m so proud of you day in and day out we’re here to get shit done and not take any shit from anyone because we know who we are we know how far we’ve come and we know our potential. The devil is always trying to break us down but because we have God on our side we are strong enough to overcome any obstacle any naysayer and any non-believer.", "ericakodjoe": "God bless you for sharing 🙌🙌", "sassie_chic": "❤️ thank you for always sharing! Needed to hear this", "missalexlarosa": "Love!!", "hashtagsandhandbags": "This is inspiring!! Plus that is a power suit! 🔥", "masaniajua": "This is everything, vunerable and transparent, yes you are all in your rights to feel overwhelmed it happens to the best of us. But through it all you are sunshine to us, believe that. Keep on evolving and we will continue to support you❤👏🏾blessings and love", "from_brit_withlove": "In this very moment I needed to read this. Thank you for being vulnerable in your thoughts. @hayet.rida", "shopalteregofashions": "So cute!!! 😍", "bekurious": "@hayet.rida and the caption is so true. Be your own cheerleader!", "sophia_skull": "👏🏾 👏🏾 👏🏾", "debbieamma": "Thank you for this. I was in a little bit of rut today as well. You’re inspirational. Keep striving for the stars 💫", "thebrandalchemist_": "Needed this! ❤️❤️", "chauncea": "It’s been great to see you blossom over the last few years... keep blooming Girl! Always rooting for you! 💕", "lautumnco": "thank you for this, I’ve had several of these low moments in the last week but picking yourself back up is what’s important", "dotties_princess": "This!! 👏🏽👏🏽👏🏽👏🏽 Thank you for being so real!!!", "chambreeharris": "❤️", "trinette_ray": "Oh my God!!! Thank you!!!!!!!!!!!❤❤❤❤❤", "perfectlygd": "A word.", "fashionmade__me": "Thank you so much for those words. It does get rough and not having the support needed doesn't make it easy at all. Thank you ❣", "crownedcanesha": "Oh my goodness. I’m not just saying it but this was so needed today. Starting to get frustrated because my blog isn’t growing how I think it should. This definitely hit the nail on the head. Thanks so much @hayet.rida", "valerieeguavoen": "Thank you.", "tishtothetash": "Thank for you for pushing through, especially on the really hard days. Thank you even more for the reminder and encouragement to do the same 💗💗💗", "stinaaa.b": "Thank you. ❤️", "vanablack": "I needed this reminder", "modelgoddessgh": "Bravo! 👏🏾👏🏾👏🏾👏🏾", "danny_1207": "I love this post! So honest and real. And it’s not crazy that we have those low moments but it’s great you have your experiences to look back on to pull you out of those low moments! Thank you for sharing!!! 🤗🤗🤗", "neattreasures": "Thank you so much for that inspiration!💕💕💕", "ijeomakola": "SHOW UP FOR YOURSELF Aunty that’s a word!!!", "jessicajade.c": "Today was a hard day for me, too. Keeping the faith. Thanks, Hayet.", "nikbracy": "Wow, so proud of you, sis.", "rhodesbodes": "Thank you so much. I needed to hear that it's okay to look back at your struggles and see how you've come. 💜", "allthingsada\nVerified": "Verified", "iamplusblog": "😩😩😭🙌🏾✊🏾", "cicelyryan": "Super cute", "jewellondon": "Great word Hayet!! 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "essieizspicy": "Yes yes yessss! Isn’t it so great to look back! Literally! Proud of you... only gonna get better", "sinmi.araoye": "Thank you for sharing this bit of your journey. I'm going to save this post for the days I feel like quitting.", "chefbuttercup__": "Thank you for sharing. I really needed to read this today ❤", "_kadertot_": "WOW I needed this today. THANK YOU", "imaniimoh": "I needed this. Thank youu ❤️❤️", "_the_b_word_\nVerified": "Verified", "mzaprillynne": "🙌🏾THANK YOU HAYET!!!", "annarussett\nVerified": "Verified", "lovelyinla": "Real talk 💯 so so many feelings right now. Love this @hayet.rida", "the.leaux.down": "Love this!!!!!! Thanks for sharing your story!!!!! 🙌🏾❤️", "the_kabuki_hodgson": "🙏", "iamshaniquasays": "Awww yayyyy!!!!! Thank you sooo much for this!!! I needed this and I’m sure so many other people needed this too! Thank you for being so transparent and honest with us! Thank you for allowing us to follow you on your journey and thank you for inspiring so many girls out there like myself who hope to have a successful career like you! Thanks for continuing to show us that nothing is impossible and hard work truly does prevail! Thank you most of all for being you! You continue to inspire me and I hope that one day I can inspire someone out there like you have inspired me! 💕💕💕💕💕", "daisymairura": "❤️❤️❤️", "diyastyle": "You rock girl! 🔥 love the look by the way! 😍❤", "auckvision": "💪🏽🏆", "thephillybralady": "Killing’em", "itsmearyn": "🙌🏽 What a beautiful story to share!", "m4drude": "Thank you. Needed this. Love u. 🖤", "mickeyrajah": "I love you 💕", "krileytips": "Thank you for your honesty and transparency! You have no idea how much I needed to read this today.", "audreypatriciaw": "Come through! It’s not always easy, but you’ve jumped over hurdles before so you already know you can do it, boo ❤️", "_daniellelatrice": "@hayet.rida bookmarking for future reference ❤️❤️", "chinyeloves": "<3 you", "em.debouver": "Goosebumps. Love you bb girl", "koricoleman_": "This was much needed Hayet. You are very much appreciated in all that you do 💕", "dee_ellerbe": "Thank you for sharing!", "bohocoast": "❤️💕Thanks for sharing! I was thinking along these lines today & your post was confirmation!! All the best to you!!!🙌🏾", "nanavi_e": "❤️", "balance_and_grace": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "naadoc": "❤️", "breakingupwithobesity": "Thank you for this!!!", "ohemaa_kukuwa": "i love you Hayet! I love you honesty, your work ethics and your content. you inspire me everyday.😘", "iam_christinamarie": "I needed this... thank you so much for sharing...and for your amazing work💜", "zuri.ki": "I so needed to see this right now!", "bianca.galan.guzman": "Thanks for this! Inspiring ✨", "b.andrell": "Thank you. 💫"}