{"alexsisstarr": "I celebrated my seventeenth wedding Anniversary 💞, has been easy but its worth it", "afoah_afful": "❤❤", "bewhoyoub": "Loving the look", "theambralife": "I survived.", "trublkgold": "My baby started walking this week even though that’s not about me persay... I’m SOO happy/proud of him 🙌🏾♥️", "insyzestyle": "Stunning babe", "lifeoftheempress": "@hayet.rida aww I'm touched😍 yes I got much much better. So grateful for health that's for sure. Thank you for checking in . I appreciate it. Truly.🙏", "butterfli4000": "I did the 5K Susan G. Komen breast cancer walk with two survivors 🏃🏾‍♀️🌷", "christine.pocahontas": "Goddess!❤️", "locsetc": "😍", "yours_truly_rhoda": "I was in NYC for the first time this week and had a blast with the most incredible group of kids working to make the world a better place 🤗", "closetconfections": "Great message. Just spent an amazing day with my husband and son", "teamstokes": "I spent the weekend with my daughter and only grandson. What a wonderful weekend it has been.", "brooklyn_anise": "👑 Queen!!! ❤️❤️❤️", "emnthem": "It was me. I needed that. 🙋🏽‍♀️ Thanks! One good thing—-I was able to catch up a with a friend I have not seen in some time and have a visit—over yarn. 😉", "rash_rashel": "Princesse 💖", "leasahart": "Goddess", "ingridnacole": "I was given the opportunity to do something I love...photograph a rock concert. I’m feeling blessed.", "lifestyledbyerica": "This is so true! We aren't what has happened to us or what is happening to us, although those things shape us they dont define us. Thanks for the reminder.", "akosua6a": "My Goddess", "theplussizedprep": "I definitely needed this, thank you ❤️", "itstina_time": "I designed my own website!", "selasi_von_hausen": "😍😍😍😍😍❤️❤️❤️", "_style_n_class": "I went to six flags yesterday and I was so terrified first time going on a roller coaster and I could not open my eyes I yelled and screamed for my mother and prayed the whole ride 😂. Then my friend dared me to try it again but open my eyes this time and I did and the experience was so much better and I realized that keeping my eyes closed made the experience so much more scarier. 😂 I ended going a third time and smiled and put my hands and just enjoyed the experience much more it was amazing and I’m going back next week lol", "mscindy_hue": "🙋🏿‍♀️🙋🏿‍♀️🙋🏿‍♀️🙋🏿‍♀️🙋🏿‍♀️", "akosua_masca": "Amen Amen. Much needed. 🙏🙏🙏", "realpattyb": "Great message. This week, I spent much needed time to myself in my new home. I focused and was grateful for all the blessings God gives me daily.🙏🏽♥️", "kay_gracie": "I came up with two solutions in a high profile meeting at work which they are going to adopt...and I’m only a Program Assistant.", "nyamesene_adienyinaa": "I still have life though I’m not so well 💃🏾", "joselmoorerep": "My Ex got me so pissed off .am not OK..but will be fine", "lostformat": "Holy moly guacamole!", "jeneseyquoi": "I didn’t have to work this week!!🎊😌", "kalishakardash": "Amber Riley’s twinnnnn", "_shorshor": "Tbh, I feel like no positive change has occurred in my life.", "amma_serwa": "I became the first female youth president in my church and I can’t thank God enough for the opportunity", "lareashia31": "Yes so true", "kimhermajesty": "I had an amazing time with family and friends all weekend", "bri_muhammad": "Beautiful 😍💕🌺❤️🌸", "nixiechick88": "You look soo good!", "giftedone35_mind_body_soul": "wow thats one was for me. 😍👏 thanks", "tara2dalee": "Great reminder!! I had the opportunity to work on a production I prayed I’d book. It was an amazing experience and I was grateful to have it!!", "melissalbbward": "Just what I needed to hear... you’re such a blessing! This week I reached week 4 of walking a 5k daily 🤸🏾‍♂️", "kaygeebeee1": "definitely needed this reminder, i'm so guilty of doing that very thing. my good thing: i had weight loss surgery this week with no complications! feeling better with each passing day.", "theartofjumping": "love this shoot on you✨", "boatemaa_hilary": "I survived a car accident; so I’m really grateful for life.", "attakaielfonso": "Where she'll we go my beautiful princess 💖🌹💖", "kweenzo": "I need this reminder on the daily. This week I got an interview for a different position!", "teemoneybaby": "Beautiful words. I’ll practice just that this week at work.", "emzscofield": "my job just got better😃", "valeri_christina": "Stunning", "atiya_da_bushbaby": "I get to be with friends today instead of at work! 🤗🤗🤗", "mzmel_j": "Beautiful shot, beautiful message! 💜 Got some good news about a legal situation I’ve been dealing with all year. The laws changed in April in my favor! #ButGod 🙌🏾💪🏾", "letsgocrazy4": "You look awesome and thanks for the post...I needed that message :)", "_lalawrites": "Beauty", "_motivatedbylove": "Me. I am the someone. Thank you. ♥️", "koshie_mills": "Yep I did I needed that for sure😥", "itsamanda143": "💜", "xclusivevee": "That someone is me @hayet.rida thanks so much for sharing😊", "abiolabiya": "It ended. Btw, you look amazing 😍", "lady_berde": "I got a call for a job interview 🙌🏽 😍", "breakfast_with_tiffani": "That someone is me!", "kwabinadapaah": "I needed this! I'm inspired😢🙏", "minstrelt": "I found me again! After getting married and having two kids I sort of lost myself serving everyone. Long story.....but this week the game changed 🙌🏽", "lalenyc": "There was a bad bitch contest and I came in first place 🥇 😂 I’m joking of course, but I did shave my head (!) and even though it’s giving me all the feels, I’m leaning into being a badass and feeling gorgeous.", "sweetlocs": "Thank you for this! My awesome thing is being blessed to turn 40 this week", "brittanydorsey": "I had a lot of good things happen this week. I made it on to my flight with one minute before the doors closed. Got to catch up with girlfriends and went to a concert where I saw friends I hadn’t seen in a while and we had the best time. I’m excited I have the opportunity this upcoming week to do it all over again!", "ms.opezzy": "So prettiful!!"}