{"robinsonann132": "You are doing what you supposed to do and help people, you are an inspiration", "sophia_skull": "I actually have you on post notifications. I only have like ten people on that. I love everything you post!! The day i found your page I spent hours on it admiring your outfits. Your fashion is on POINT. I’m always inspired by your latest post. Please don’t disappear", "thrive__gh": "Your authenticity and vulnerability, the fact that you are sharing your healing journey. Openness about therapy.", "michaellamutoni": "You’re honest enough to show that you have to put in the work (in all aspects of life), and that nothing just lands in your lap! You also show that the rewards are sweet though, and that it is worth the journey 🎉🎉🎉", "eljayrobbins": "You seem to be a genuine person any to promote people(ladies especially) to be themselves. To value themselves ....as they are. We are all unique, we all have our own insecurities. Move on. Keep doing what you are doing.", "tobiloladeyinka": "Hayet! You have been my motivation on days where I thought i didn’t have what it took to give to the world what I have inside me. Seeing you constantly go even when it didn’t feel good or the moment was unfavorable, reminds me that i don’t have to feel good to give good. You, the life you share with us and what you’ve accomplished has proved that success is possible if you apply the principles. Thank you❤️", "sinmi.araoye": "You are one of the reasons I started dressing my body again. You helped me build confidence in my body and actually embrace the fact that I live in a larger body. Your sense of hustle is inspiring and forced me to stop complaining and take charge of my life. I am actually doing a 100 day commitment to myself at the moment. It is amazing to show up for myself every day and watch my life transform. You have been one of the catalysts. Thank you for being unabashedly you.", "royaltycosmos": "@hayet.rida your page has inspired me in so many ways. To be bold, strong, multi-tasking, succeed at them all, be resourceful, depend and trust my abilities, don't always ask for help without doing my research, you have taught me to be humble but daring with the truth without fear or favour. You have taught me to put up a smile while I fight and you have not once acted like your like is all together and better than your followers. You have shown true vulnerability that I consider strength. I love how you connect with your Roots. And thanks to you I finally started my Youtube channel after 2 years of procrastination and your success gives me hope. You are my Shero. 💜", "mekaprince": "Every time i see your posts or read your blog.. it’s makes me want to be better in my own life, knowing i can go harder to achieve my goals❤️", "frantinique": "@hayet.rida this page has made me better because it makes me excited that there is a brave woman who looks like me in the media in a positive light 🙌🏾😍😘", "cassandremarie_": "When your trying to break into a world where your face is under represented, it’s always amazing to find sisters that are killing the game with no apologies! You do that for me! Thank you!!! ❤️🙋🏾‍♀️", "pinktracey20": "You make me feel anything is possible and even when I'm down your a bright spot in my day that I have been looking for ❤️", "evanichole": "I love watching you make your dreams comes true. Makes me chase mine harder. 😘", "nakeiahomer": "Inspired my your unapologetic acceptance of your body and how you represent so well.✨", "chicafeliz2": "To feel confident In me as I am right now ! Not that I have to change to be worthy or pretty . Thank you Girl keep doing what you do.... 😆😁🙌🏾👏🏿👏🏿👏🏿🙌🏿", "wearshelives": "Just you talking about your goals and crushing them, I use to be so goal oriented and have completely stopped but with your encouragement I’ve actually been thinking about creating some goals and getting crap done", "amma_prempeh": "How open and real you are by sharing both good times and tough times. Also love your consistency.", "mimirutherfurt": "You inspire and encourage me on my own path. Thank you for being and staying here for all of us. 💚", "zanderander": "🙌", "stephshap": "Your hard work motivates me to do more 🔆❤️", "emcardenas": "Seeing you working hard and being honest with what you DO chose to share is the reason I enjoy following along on your journey. Keep shining girl ✨🙌🏻", "sheconsideredblog": "❤️❤️❤️❤️", "catriniasmith": "You are my Style Inspiration"}