{"bollyqueen1": "My deepest condolences.", "asmilingface": "Prayers sent above for you and your family.", "elizabeauch": "I'm so sorry. Sending love", "phyllis.twumwaa": "We love you!!!", "aamu1906": "Sorry to hear of your lost. I will keep you in my prayers", "crownapple": "Prayers to your family in this hard time. May God Give you comfort.", "enyo.woode": "My condolences Hayet , may God be your comfort 😘", "mongleno": "So sorry. My condolences ❤", "jesusdesire": "Awwwwwww my most sincere condolences 🙏🏾🙏🏾😩", "michelleandreya": "😮So sorry 4 your loss...❤", "supersizemyfashion": "I'm so sorry for your loss. My condolences. ❤", "austen_winsten1880": "Cute", "platinummommy": "Oh man Heyet.Rider! I wasn't aware of your loss. As heavily as I know this is wearing on you and yours right now, that'll be the measure of strength you'll receive. Father, thy will be done.", "itslov3lyn": "My condolences dear,", "chiniluv": "So sorry for you loss hun. Hang in there x", "iameveyankah": "So sorry my love 🖤💔 @hayet.rida", "essiedoessummer": "My condolences, Hayet", "love.penie": "Wow! Such a blow. I pray for peace and strength for you and yours Hayet🙏🏽", "marshonne": "Hugs hugs hugs. Sending love and light", "miss.aligned": "Sending love, stay strong <3", "judy25saywhat": "Sorry for your lost 😔😔 my condolences ❤️❤️❤️", "prepfordwife": "Sending you nothing but love and good vibes and peace as you go through this very difficult time", "jayboham": "My condolence Hayet. May the Peace of God be your Strength.", "shoeluvarn": "Condolences to U beautiful and your family", "iamplusblog": "😩😢 Sorry to hear that Hun! My condolences to you and your family! Prayers sent your way🙏🏾", "frenchnastyy": "Prayers", "elsanahna": "Love and strength to you", "mikikoftokyo": "Omg I'm so sorry. Sending prayers your way", "sartorialpursuits": "🙏🏾 so sorry for your loss", "marielaly": "All my condolences darling, stay strong in this difficult time ❤️❤️❤️", "cuspianat20": "Sorry to hear this...confolences to you and yours", "tahlor_nichole": "I'm so sorry Hayet. Sending prayers your way ❤🙏🏾", "sabarossministries": "So sorry, praying.", "thetallsociety": "On no 😔. My condolences beauty. You will be in my prayers. X", "theplussizedprep": "I'm so sorry for your loss, Hayet. Losing someone close to you, especially a sibling, is never easy. Know that you and your family are in my prayers ❤️", "zbaroness": "I cannot imagine. My heart goes out to you with all my love.", "wildflower_adventures": "I'm so sorry to hear. How heartbreaking. Praying for you and your family 💛", "mayacody": "May you and your family find comfort in the love of our Lord Jesus Christ", "24hrglam": "So sorry for your loss. 💜", "tolly_harmony": "❤️❤️🙌🏾", "laperlenoire88": "Sorry for your loss Hayet", "pissedoff.fashionista": "Take care of yourself and know that we're thinking of you! 💗☮", "zella_b": "I'am so very sorry this tragedy has fallen upon you and your family! Sending you all my love and prayers dear heart.", "penelopetoop": "Sending prayers to you and your family. May God keep you.", "seyiajayi7": "Sorry for your loss...words can't quantify this..may God help u heal", "yinsongti": "My condolences xxxx", "afoah_afful": "Oh am very sorry dear", "bossybood": "Stay strong sister!", "gothy_womxn": "My condolences!", "mskristine": "My sincerest condolences. Praying for you love", "mademepretty": "Darling I'm so sorry for your loss. Sending lots of love and hugs to you and your family. ❤️", "ofeibea22": "My condolences 🙏🏽🙏🏽", "yourestillfat": "so sorry hayet, you and your family are in our thoughts", "slimsilvah": "My deepest sympathies. I'm so sorry for your loss. I know we don't know each other, cut I will say a prayer for you and your family.", "vanban20": "My condolences to you and your family.", "natasha.noire": "You're such a beautiful soul and I pray God fills you and your family with His grace, strength and love. ❤️", "good2be": "🙏", "makazie": "😍 guapa!", "shoptaylorjay": "Im so sorry for your loss my condolences to you and your family.", "midwestlolita": "I know this pain all too well. Sending you lots of love and praying for your strength during this difficult time.", "bbkingig": "I am really sorry and accept my sympathies", "ijeomakola": "Praying for you and your family", "mrs_saripalli": "Heya love. U look great💕", "pokuaapk": "My sincerest sympathies to you and your loved ones. ❤️", "sisi_yemmie\nVerified": "Verified", "moorestyleamorebeauty": "O o o o, so sorry for your loss ❤️🙏🏾", "vianniepr": "Gods grace is sufficient for you and yours take heart dearie", "ayongo": "AWwww my heart goes out to u n the family 🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾", "_alyxo": "Sending you love and the deepest condolences ❤️💕❤️💕", "tintberryft": "My condolences to you love and your family ❤", "caramelrapunzel": "So sorry for your loss may God be with you at this time", "mustangsallytwo": "I am so sorry for your loss. My thoughts are with you 💕", "anitamatey_": "Glad to see you're back!!! Love you !", "unapologeticallypam": "My heart hurts for you. I am lifting you up in prayer ❤", "babyallspice": "Yaaaas! Gorgeous", "merrymodestapparel": "ow I'm so sorry for your loss. Be happy knowing he/she is in a better place🙏", "illustrationsbykh": "Sending you love 💕", "ediequaye": "My deepest condolences❤", "nospecialoccasion": "So sorry for your loss! You are in my prayers! 🙏🏽🙏🏽🙏🏽", "gukas_kabobo": "May you and your loved ones be held by God's embrace. Terribly sorry for your loss", "dacommissioner": "Sorry for your loss.", "styleoversize": "😘😘😘😘", "stylistagh": "I am so sorry. 😢😢😢 @hayet.rida @afuarida", "jordanadrienne": "Sorry for your loss 💕", "lu_ee_": "My condolences love! Hugs and love 💕💕", "kokui_selormey": "So sorry for your loss @hayet.rida @afuarida. Condolences to you and your family during this difficult time.", "ms.bealight": "My condolences to you and your family. 💜", "kosyasaa": "Be strong !", "la_gurl1415": "Prayers and hugs", "taibelieves": "Oh Hayet!! 😔 Continuing to keep you and your family in my prayers!", "lillyisnuckingfuts": "Sending our thoughts and prayers", "data_oh": "My darling! I pray you find the strength to overcome this challenge.", "chardlinechanel": "Love you sis!", "jenniferlake\nVerified": "Verified", "sanwakah": "I'm so sorry for your loss; I will continue to pray for you and your family.", "journaldunpigeonvoyageur": "Sorry for your loss @hayet.rida", "ashleysam": "My condolences!", "ano_kye_waah": "It is well. ❤", "erikam.brown": "Hugs and love to you Hayet. So sorry to hear about your loss❤", "m4drude": "Omg!! Sending you love and strength 💕💕💕", "feelmyfacegh": "🙏🙏🗣", "stephaniedjl": "Sending love, beaut 💕💕", "missefua": "May God comfort you and your family love", "babyfat.jpeg": "Sending love and light", "audreycanblog": "((((Hugs)))) I am so sorry for your loss! Sending oceans of love to you and yours!", "misslionhunter\nVerified": "Verified", "ashelise83": "I'm so sorry girl 💔", "koolklawzreviewz": "I'm sorry for your loss. I'm glad that you and your family have each other to lean on, and I pray for your comfort. 💕", "etlilas": "Oh my God I didn't know Hayet I am so so so sorry for you! Praying for you and your family, may God help you through this terrible situation 😔❤️", "koricoleman_": "So sorry to hear that Hayet. You and your family are definitely in my prayers. Definitely enjoy this time with your family ❤", "therealrandomnone": "Oh no 🙏🏾🙏🏾", "fat2fitlifestyle": "Prayers for you and your family... for strength and understanding 🙏🏼❤", "papaoppong": "That's awful. So sorry for your loss 🙏🏾🙏🏾", "theoxproject": "My sincerest condolences Hayet, peace be with you and your family ❤", "shelby_limpert": "You look beautiful and you are such a strong woman who will get through this with grace and faith 💙 prayers for you and your family love", "iamkeshastyles": "Sending prayer and love your way! The only way to get through is with lots of prayer and surround yourself with your family and loved ones", "nadaaley": "So sorry for your loss🙏🙏🙏", "the.leaux.down": "Sorry for your lost.... keeping you and your family in prayer @hayet.rida", "strangefavour": "My prayers are with you and yours!", "eyezbright": "😢 I'm so sorry for your loss Hayet. I had no idea. I will say a prayer for you.", "kaylahoniwo\nVerified": "Verified", "mscindy_hue": "Prayers up🙏🙏🙏 so so sorry.peace be with you and your family.", "lagrimanis": "Thinking of you and family Hayet", "hayet.rida\nVerified": "Verified", "medesse": "So sorry for your loss Hayet, praying for you and your family...", "dianaopoti\nVerified": "Verified", "sweetlydifficult": "My condolences to you and your family. May the spirt of comfort be with you all during this time."}