{"nolaleaves": "Beautiful post. I could feel your heart through your words ❤️❤️❤️", "irmaamlee": "👑", "theevolutionofken": "Loved the post ❤️ definitely food for thought.", "cosasdb.etsy": "💕💕💕", "pagnaakasule": "Great piece 🤣", "boardroomblonde": "Truly loved reading this post. So valuable and thoughtful!", "janettedior": "Excellent topic!!", "paula_shelton": "This is a great post and well timed. I think a lot of us (myself included) will overspend during the holidays for the wrong reasons. I started cutting back last year and will do so again this year. As far as the necklace goes take it out and wear it only if it makes you feel happy happy joy joy. If not have it made into something that does. Happy Holidays!", "becomingmontana": "Loved the blog post. It’s really a tricky one. I know I’ve been weary of giving for these reasons, like I want to buy you something but am I doing it for you or for me. When I realised it was for me, I stopped myself but when it comes to things someone bought me because I have such an attachment I have to let myself see it all the time so I get over the feelings I get when I see it until it’s just a tee again. The memories of that moment won’t leave but I’m not a prisoner to my emotions when I see it or think about it.", "shinechaia": "Ohhh. I love this moment of vulnerability. I can’t relate but I felt that. Thank you for sharing with this.", "fancynurse": "Great blog!! I agree with your points!!", "dr.dvonp": "Thank you for posting this. So relatable", "nanayaa_yeboah": "Great blog post!!!! Honestly very thought provoking 👏🏾👏🏾", "jacelynm_": "Wow, this was a hard but necessary read! Thanks for sharing!", "carinec83": "Wow.", "luperoncita": "100 likes from me!!!! TRUTH", "mrssjp823": "A WORD SIS!!!! A WORD!!", "sistasideeye": "Such a timely and helpful blog entry. This will definitely help somebody.", "livi_chai": "The only thing I’m giving is a post card with a few kind words lol. I’m not the type to buy expensive gifts for a man. I even buy clothes and other things with his money. My mom I’ve always told me not to spend my money on a man unless we are married. I don’t play that my money is mines and his is mines. When you have been through some BS you start thinking and acting differently. Sad but true", "megdainty": "Read entire thing and so wish I had this to read 15 years ago at age 14 (when all this started with a giant man chain from Friedman’s Jewelers...)", "dafrastar": "Loved the post Hayet!", "zanalyn": "Damn #sobberingthoughts", "ladykeshthe1": "Wow thank you for that 😘", "ewa.ibrahim": "Very hot and lovely my beautiful queen 😘💋👑👍", "meticulously_wild": "Great blog post. The act of giving is more for the giver than it is for the recipient (I think). We should always give (with a humble heart, at that) because we want to express an internal love/care/feeling for another. I think the gift is kind of the byproduct of the FEELING. I believe most (not all, bc sometimes ppl just want shinny shit) gifts should be things that are needed; whether we gather that from observation or interrogation. And “needed” doesn’t need to be totally utilitarian; someone may need a beautifully written note or a date/trip/time. I love to give gifts, but I’ve had to learn to do so at a rate that would not deplete me financially or subject me, emotionally (as some ppl think that when you give once, it means that they expect you to give again and again). As for the necklace you are still holding onto, I think you should let it go if it illicits hurt and negative feelings. Although you have it hidden away in a box that you do not touch, in your mind, you know it’s there. Your thoughts about it may even grow and take up more space that the box that holds the necklace itself (slash I’m sure you could buy yourself one if you wanted, bc you a #bossbabe). If it doesn’t hurt you, I hope the necklace at least reminds you that once upon a time, that person felt something special for you BECAUSE you ARE special. Even if they don’t feel that way now, guess what? You’re STILL extraordinary. Thanks for sharing another piece of you. 💜", "academicladym": "What a great post! I’m happily married and this still causes me to pause and ask myself what I hope to gain when buying my significant other a gift. Such a great reminder as we enter this holiday season.", "butterfli4000": "Great post I can definitely relate. I found myself giving expecting adoration in return, also wanting something in return at times. I’ve been healing from this as well. An eye opener to all that I expected when giving👏🏽", "ashmichelle.c": "Excellent blog post! I definitely overspent on a nice bedroom set when I was young and my boyfriend and I were moving in together. I wanted it to feel like an “adult” bedroom instead of my single, early 20’s bedroom. But I didn’t need to do all that and shouldn’t have. Still have it, and we got married then had a kid. But I do did it to “impress” him. Dumb.", "kaygeebeee1": "whew sis how did you know i woke up in tears this morning? definitely needed to read this, thank you so much.", "thenicolealysa": "👏🏽👏🏽👏🏽", "thrive__gh": "Excellent piece. So many of us are not honest with ourselves about our motives behind the gifts we give. Thank you for sharing this. What we do in essence when we use gifts as a plea to stay is manipulation. And that is never pretty to see in ourselves. This is also such a reflection of attitude towards the non material things we give: love, respect etc and that last point really resonated. Is this something you would buy for yourself. Why would we have expectations of someone loving, respecting, honoring, being honest, standing up for us when it’s not someone we would do for ourselves. Really great post", "lady_berde": "All in all, this post answered a week old question for me and that is think twice about this Home Depot gift card you want to buy 🙌🏽🙌🏽🙌🏽 I wish someone had told me this in my last relationship but it also help me look at those nice sweaters he wears on his dates now with more empathy rather than anger because his closet needed it. Thank you", "jaeevs": "I love this! I struggled with this for years in my last relationship and this year in my new and recently begging one, I didn’t want to continue that toxic gift giving crap. This blog just made it so much easier to be okay with the decision I made to not spend a ridiculous amount of money. Also.... I ended up buying myself the same thing I got him so it’s fine, right? 😂", "seldafashionboutique": "Great post 💕", "itsdejamichelle": "Such a great read!🙌🏾", "twin_trock": "Unpacking the TRUTH @ its FINEST. 🤗❤️🤗 When your heart is \"designed\" to be a giver, one has to be careful of the \"why\". Hard lesson to learn but not impossible. Reposting for sure. 😉😎", "lalasow": "Beautifully written - If i had a cute gift from an ex, I’d still wear it .... we attach too much meaning to objects & even though it was given within a certain context, you can still keep & wear it for what it is - a simple necklace or bracelet or w.e (only exception to this is a wedding ring cuz it’s not just any kinda jewelry 😂)", "kene4.0": "Wow", "hannahisaiah": "This relates to the way we give our love as well, is it an unconditional gift, or are we expecting something in return🙂", "labrandondates": "Chile....let me go an read this 😩🔥", "princessjlove89": "You just took me too the alter.. with the white sheet over me.. so needed to hear this", "momo_buddaphly": "Wow this was a deep one. How about something even worse like many women (including myself) have given themselves, their time and sometimes dignity to a man - trying to convince him that we’re worth fighting for. U gave me a whole self-help book in this post 😳👌🏽", "honeichyle": "Very thought provoking post! Could your feelings be more about you not vocalizing your plea to stay? Or him not recognizing the purpose of the gift? I enjoyed reading your transparency in this, I can relate on wanting to understand why I felt a certain way about numerous of things. Glad I’m not alone in understanding my emotions. Great post!", "freda_stone": "Being a silent donor, how hard is that? Unless you just wanna show off! Just saying 🤗", "vanablack": "This is such a good post. I needed this years ago. Yah can’t buy love 😩. My mama always told me don’t buy a man shoes cause he’ll walk right out yah life. Lol and she sure did.", "nhova85": "Wow this post resonates with so many of my relationships. Makes you not want to fall in love anymore. Still healing.. ❤️", "jasmineadisbeth": "YES🙌🏼 everyone should keep this in mind when buying ANYONE a gift this year.", "gavyntaylor": "Why you so loud 😬", "beingbrittanyhall": "Hunny only an OG could write this!!! To unpack that..... giiirrrrllll!!!!! We should have girlfriend convo about the way we as women view the gifts we give!!", "londmarshall": "I love you ugh", "the_haute_cafe_": "I love this!!! @shancam10", "prettiinpink_": "@hayet.rida love this post .. I can relate so much to it .. it gives me a eye opening about a lot .. thank u so much for this post", "marrajoelle": "So you're just going to read me on a Saturday morning 😩 I've been struggling with this post breakup.", "crownedcanesha": "Been there done that. SMH!! Growth is a beautiful thing!! 😁", "makeda_iam": "This is how you unpack the truth! 🙌🏿 Yaaas @hayet.rida", "ani3233": "ooooh i needed that reminder", "abynabb": "That was so beautifully written. Thought provoking! Laaa ya @hayet.rida", "thequeen_shakira": "Ooooh 😬🎯", "callherkris": "Wow. That’s deep.", "ironyofashi": "Loved reading!", "lareashia31": "Wow 😮 so true 💯", "allthatjaz1": "whew that was REAL!", "brooklyn_anise": "Dang sis!!!!!!! Always hitting it spot on! ♥️", "theheathermartindale": "This is so real. I know how hard I have pleaded through actions and gifts before and now I realize how important it is to value yourself and walk away.", "bbbgirls4ever": "Reposting 💕💕💕", "0pokua": "That was a very interesting and thoughtful post. Thanks for sharing, so much food for thought.", "dee_ellerbe": "So real, thank you for sharing. 👏🏽♥️", "lolo_russell": "Great blog post ❤️ I’m so glad you shared this with everyone. It’s a great reminder!", "justfaiza": "So we not going to talk about how FINE @hayet.rida LOOKS 🌿👀🌿👀", "i.am.mvhki": "Loved the post 🙌🏼", "talesandturbans": "Wow I love how transparent you are ❤️❤️ 🙌🏾", "just.b.michelle": "Deep down, I want all my shit back. In real life, I’d never ask lol. Just sounds/feels good to say when it’s all said and done 😭 Love this! ❤️", "nicole__eva": "😬😬 this was a REALLY good post that calls for some serious personal reflection 😅. Thanks for writing this!!", "erica_yf421": "Wow, I know the feeling... and afterwards I thought of it as a price to realize they weren’t for me lol 💖💖", "sophisticatedandsassy": "WHEW THIS", "ausetcoconutwater": "Yeah, I really appreciate this! The entitlement to loyalty is standard with those gifts.🤦🏾‍♀️", "calientegodiva": "Him wearing it with his new gf was an act of him wanting you to see it and reach out to him about it. 🤦🏾‍♀️ Some men allow their egos to get in the way of what they really feel. He sounds like a Gemini 😩", "ju_superhuman_": "😩 Definitely a triggering post. “Are you buying the gift because you love him or because you...” 🤕 I need to regroup", "msokiki": "🗣 Ma’am!! Asking us to self reflect and dig deep this morning? I was NOT ready !!! Love it 💕", "joyfullyethical": "Very interesting... I’ll definitely have to read it..", "darilyntyrese": "Brilliant piece! Thanks for the reminders. 💜", "saraluttrell": "Yassss Queen 🔥", "ashleehinds": "So true ,thanks for this 💕", "ms_pnim": "Wow!!!!! Wow! “...it was a plea to stay.” OMG! 🙈🙈"}