{"aldair.acquia": "Keep it on with the all black Hayet girllllll!!! Gorgeous 🔥🔥👏🏽", "akosua6a": "You have style.", "krileytips": "I would like to learn more about how to build sustainable relationships/partnerships with brands and how to identify partnerships that make sense. I would also like to learn about planning for budgeting and financing and just time management tips/tricks. I'll try to think of some other things but you have been so inspiring!", "akuaolamide": "You look snatched ❤❤❤❤", "nhova85": "Absolutely gorgeous!!! ❤️ Continue to be you! Your lives and behind the scene info you share about 1st and 2nd shift is definitely motivating... Pushes me even harder as a small business owner. I would love to see more videos on your quick makeup tutorials would be great!", "mshellsmith": "No gonna lie, I just bought a body suit with a mesh insert...I can't wait to channel my Hayet when wearing it ♥️", "sharmsss": "Booo we wanna know how you manage your time, scheduling, how to be fully efficient and productive 😘", "daughteroftruth": "You are flawless and these workouts are taking you places! I'm proud of you.", "madam.jilapi": "Hey @hayet.rida ! 1. Styling ideas, like how to wear white boots in 5 different ways, or seasonal dressing or dressing for comfort 2. Mental wellness ideas, processing difficult feelings, anxiety and working through them anyway to pursue your goals and 3. Content creation process / behind the scenes 💖", "janee_ford": "😍", "biancashakara": "I love those sunnies !!😍", "parksideandbloor": "🤯👌", "makafui_agbesi": "Ever since I found you, you’re my go to for style ideas because of my body type. Thank you for allowing yourself be a blessing ❤️ I’d like you to share how to start and build a blog. My chosen field is very different but I’m sure I can learn a number of things 😍😘", "laudividni": "14 looks in one hour?! That’s impressive 💯💯", "heyitzsarai": "I love all the content you provide. I can’t wait to read about the 14 looks in an hour because that’s amazing 👏🏾", "ashiaki": "Hunni 🔥🔥🔥🔥", "stephabunch": "Hello coming back to this post to say PLEASE give tips on how you shoot 14 looks in an hour 😩😩😩", "l_ehi_": "❤️❤️", "mushroomstew": "Werkkkk", "christenamelea": "How to get your followers over to your blog would be an awesome resource!", "bellemereblog": "Identifying shooting locations please thank you", "brigitadambe": "I would really love to read on how to properly build campaigns for partners (when you are a blogger) short and long term. How to approach possible partners and how to sell yourself! Small things like documents would be sooo helpful! I really enjoy when you share little bits on your stories of presentations you make. I want to get better and be professional as one can be!", "mua_afrikanemily": "This!!", "hersocialgrooveandbaby": "@hayet.rida I don’t know WHEN I started following you but let me tell you, I’ve been in love ever since. You need to hurry up and come to this side of the border so I can meet you in real life (and I guess my munchkin can be invited to our date or whatever😑). I HAVE to know how you shoot so many looks in one hour! Let’s start there - please and thank-you💕", "msjohnsonfromda9": "I need to know how to turn likes and views on my store social media into dollars being generated on my website...", "candacenkoth": "Thank you for sharing @hayet.rida ! My questions would be: What steps did you take to build a strong following on Instagram and on your blog? How long did that take you?", "sincerelyonyi": "Definitely how you shoot 14 looks in an hour", "myswan_song": "So excited for what’s to come! I would like to know your shopping tips... I am not a blogger but would like to understand how to create a wardrobe budget and tips for shopping: how often, and how you plan your looks (i.e do you have a formula or strategy?)", "stylecheckbydee": "Beautiful lady x💖💖", "jjdoeslife": "Living for this lewk! 🖤", "dorothy_james00": "I definitely would like to know how you shoot 14 looks in 1 hour. I can barely get 4 outfit done. Thank you", "signorastephanie": "I would like to know how you go about publishing content consistently while managing a full time job. Do you write all your content on set days?", "tyriarenee": "Launching my blog in January super excited and nervous", "lisalarbi": "Hey Hayet, first off, congrats on Coalesce! Really love that you’re doing this and sincerely hope some workable ideas are surfacing from the thread. Would love to learn more about the logistics behind “your grind”. I know it takes work to do all this, so I’m curious about how you balance your brand and FCB, all while trying to grow and thrive as a young adult. I assume it’s all about time mgmt/boundary setting/getting help, but would love to hear what that looked like for you (e.g. schedules/routines you had to make, things you had to let go, when you realized you could fulfill your vision alone, tough convos you had to have with others in your personal/professional life so they would understand, etc.) and what advice you have for anyone building a brand/project/business. What was it like starting off earlier in your career and how does it compare to now? Would you say you’ve found a “life balance” for the time being?", "crownedcanesha": "How to grow and monetize my blog @hayet.rida? I’ve been blogging seriously for a while but having a hard time growing and would love to monetize.", "lifewithlorean": "How to protect your blog ie trademarking/copyrighting!", "i_am_dorinda": "More look books 😊", "simplyfelicia_": "I feel so lucky and blessed to have come across your page. You are my new favorite blogger. We are both in Chicago, and for some reason that has given me so much hope. You make me feel like I can do this too... I would like to know how you take and edit your pictures and videos. I would also like to know how you make those amazing promo videos and who helps you? What is their contact info and price range. Your promo videos are the best and I’m in awe each and every time. Keep up the amazing work! ❤", "thelilylawrence": "I’d like to know how to build blog traffic and if content Marketing works for bloggers", "_shorshor": "Lmaaaaaaaoooooo 😂😂😂😂😂 okay now real question. How do you propose to brands to let you promote them?", "ashbartheamazin": "Hi! I work love to see your suggestions on what to wear in the corporate office and interviews since I struggle with finding age appropriate options. Also, how to pack for busy trips, goal setting for professional and personal goals.", "tpaige4252": "🖤🖤😍😘🖤🖤...All black..my favorite color!", "farhfromordinary": "So chic babe ❤️", "fabkasi": "Slayyyyyyeeeedddddddddd.", "uncommonclassic_blog": "Creating a budget for you blog", "districtqueens": "how to get paid sponsorships!", "beingtiarra": "14 looks an hour?! Yes, let’s start with that! 😮", "bebe_jones": "❤️❤️❤️❤️❤️❤️", "therealmelwagner": "🔥", "mandy_spence": "Hey hun, key tools for blogging. How do you edit photos?", "_jazmynanderson": "14 looks in one hour, definitely share that because I need all the tea! Anything more than 2-3 outfits in an hour is information I definitely want 🙌🏾", "kover_gyrl322": "#3!😍😍😍😍", "lesliea345": "Love this and can’t wait to see all of the content! My favorite blogger hands down! 🙏🏽🙌🏽", "lipglossandleadership": "Sponsorship", "melaninebae": "I would like to know how to build your brand", "talesandturbans": "The key to staying consistent? Tools that have helped you stay on track. Lighting equipment you use to shoot indoor? ❤️😘", "frankietavares": "I look forward to your lives! And PS: this look is everythang! ❤️ U", "iamterraallen": "Looking like you’re shooting for the next Bond Girl movie. 🔥🔥", "lovabletrace": "Definitely creating an outlet to have your items (cosmetics) featured!", "kennethia__": "You’re always slayyyyyying my life!", "_samantha_lindsey_": "Starting as a baby blogger, shoots on a limited budget with limited clothing", "alotoftola": "I would love to know your tools to keeping the perfect balance and advice for outsourcing? Also editing tips for your pictures", "plusmodelcarla": "Beautiful", "chinnysimperio": "Wow! Let’s start with the shooting 14 looks in one hour", "raineyamore": "14 looks in one hour?!?!! Okkkk I def need a behind the scenes on that!!!!", "candicurlzneworleans": "🙌🏽😍😍", "cake.n.cognac": "Consistency is one of my major goals for 2019. Foregoing laziness and excuses, and getting the work DONE.", "aalways.amber": "you always kill the fits!"}