{"lifewithkeshia": "You're such an inspiration! Keep going!!!", "herpersonalstyle": "Never judge a book by its cover- blessings going into 2019", "portst.lucie.fl.local": "😊😊😊👏👏", "justzandii": "💕. To 2019!! Thanks for being so inspirational.", "pearlofafrika": "I'm so glad that I follow you. You're always dropping truth and providing a fresh perspective. Happy New year!", "fluffyflyydiva": "❤️", "leliassoutherncharm": "Wow!! Beautiful! 2019 is yours! Happy New Year!!", "rebecca8310": "Aw, you are wonderful person and i love following you. Happy New Year!!", "krileytips": "Your transparency is admirable. Thank you for sharing with us! Wishing you peace and prosperity in 2019 and beyond!", "thelollipopprincess": "Thank you for sheer honesty and openness! Cheers to a blessed and FAB new year 🥂🍾🎉🎈❤", "katsevichboris": "Nice.", "ladyprincessella": "It is well. You have done well. We thank God for sustaining you.", "msz_tee_jay": "♥️♥️♥️♥️♥️♥️ your realness!!!!", "moveon1122": "Keep it moving! YOU CAN DO THIS", "soopgoddess": "Absolutely loved this! I know this may come off creepy or you’ve heard it a lot but I think of you as my sisturr (in my head) because of our many similarities. Happy New Year, Hayet!", "elaineo2j": "Wow. Wow. Wow. Thank You! Hayet Thank You!", "iamkellynsa": "Beautifull 🔥😍😍❤❤👑", "buzzhype": "❤️🙌🏼❤️", "wearifashion4you": "Beautiful", "heyraychh": "You are such an inspiration! ✨", "glamsavant": "Love this!", "royaltycosmos": "Cheers to truth and transparency. You're so inspiring. 💖", "honeybeeamazing": "Im in the process of writing a book and stopped because I didn’t feel like I was good enough as well . May our books be birth in the right season !", "barnabym21": "Great example 👌🏿👏🏿👍🏿🙏🏿", "mustangsallytwo": "I love you girl for being honest and transparent. I will never forget when I met you in person the first time at my first Curvy Con and I was in awe that you knew who I was. And then you needed a lipstick and I had the perfect shade and we went to the bathroom and you put it on and we chatted and it was just 2 girls bonding over lipstick 💕", "rhonicakes": "💜", "fashion_np_": "❤️🙏🏾", "werkingwitwisdom": "Which why was I’ve always loved you! When I took my head hiatus I always that of you constantly. Those darks spots are painfully necessary and your transparency is why God will always increase in you. You’re the bomb dot com! I’m ecstatic to follow again! ❤️❤️", "tnlconner": "👏", "ollybaanghd": "💓💓💓💓💓💓", "livewithmjb": "Love the honesty❤️❤️👌🏽👌🏽", "tanya81": "Beautiful and inspiring. ❤️", "momminandstuff": "❤️❤️ You’re an amazing woman.", "d_angel7": "I can ✔ some of the same situations...nice to know that you're not alone. Thanks for sharing. #transparent #inspirational", "maryweatherruth": "♥️♥️♥️", "kendallrayburn": "Love this - so so true. Happy new year! ♥️", "enuluv": "Thank u for your TRUTH!!! Cheers to embracing the new year with strength 🎊", "muvmarteekah": "Thanks for always keeping it real.... ❤️💛", "justtish1984": "LOVE the transparency and honesty, it’s beautiful 😍", "kweenzo": "It has been a pleasure to be apart of the parts that you shared with us. You’ve inspired me and many others. Keep on keeping on Queen!", "jus_homme": "🙏🏿😍👸🏿", "ju_superhuman_": "😍❤️ Love you for this", "kayeyesquared": "So grateful for you! You’ve been a great source of inspiration to me this year. Thank you for your transparency, your grace and generosity to share your gifts, talents and challenges with us. Blessings to you!!", "mabel__jubsboudoir": "Wow, amazingly written!", "allhailqueenbie": "THIS!!!! Thank you for sharing the good and the bad with us to remind folks like me of humanity and that no one is perfect even though IG would have you believe that!", "homegurlnextdoor": "This is why you're amazing! ❤️❤️❤️", "fabsculture": "@Hayet.rida Happy new year Hayet. You’re one of the most organic and refreshing bloggers out here. More blessings to you. 💗💗💗", "terea13": "This is beautifully honest... I luv the vulnerability and I’m going to write down my year in review as well, highs and lows ❤️❤️❤️❤️", "beautifulbrownbeauty2": "Love your honesty, I wish you continued success❤", "keeya_prempeh": "Wow. Thank you for being so transparent. Happy new year and to a much better 2019", "gwen4325": "Happy new year🎆🎊😍", "tiff.loy": "Your candor is so inspiring. Wishing you peace, happiness and success in 2019 💜", "fadila_aahmad": "✊🏾✊🏾✊🏾✊🏾Best thing I’ve read today. Take care", "onyinyeify": "💕💕", "edna_edinam": "Favorite personality this year❤️", "ladybellanaturally": "Wow.", "helloshumie": "You are the best of girls, hayeti ♥️", "jenesaisquoithe": "Such a good word Sis!!", "beautymavenraven": "Love this!", "mzmel_j": "🙏🏾💜🙌🏾", "lu_ee_": "You are a gem!❤️Happy new year!🎊 Your journey is so inspiring and is helping so many of us embrace vulnerability and appreciate every part of our journey.Loved all the pointers you gave on balancing blogging with a 9-5(needed this so much)Your resilience and hard work is such a great example and call to action .May 2019 be kinder yet more fulfilling to us all.❤️", "je_mappelle_jasmine": "You are so strong and an inspiration. Keep doing you girl, you are amazing! 👏🏾", "carlyhenderson_": "Keep going girl! ⚡️", "hislady1990": "Thank you so much for posting this. It's so true. ❤️", "mispoks": "Wow 👏🏾👏🏾. May 2019 bring you all that u hope. This is a testament!🙏🏽", "fabglance": "I didn’t know HALF of these things happened to you! But I’m happy you are still standing! Here’s to keeping it real and true in 2019! Keep moving forward!", "girlwithcurves\nVerified": "Verified", "emmeleezy": "💕💕💕💕💕💕💕💕", "ebbsandflo": "#lovelovelove", "nhova85": "Thank you! Thank you for always being so real, pure and just straight up honest as hell. So many times I look at your post and say I want to be a blogger etc. but realize I need to be mentally prepared for the negative aspects that come with it. Thank you for continuing to push through you truly are a blessing!! I pray God continues to bless you and protect you.❤️🇬🇭", "metarobinson": "@hayet.rida what a joy it is to know you (as much as one can know another thru the internet). Your courage and determination has lifted so many — all the best to you lady.", "thiscurvylife": "I was praying for peace for you when you posted about the doctor. I had no idea what you were going thru. I pray that 2019 brings so much peace, clarity, and happiness Hayet. I appreciate all you do.", "iamashantis": "What a year it has been! Thankful for your honesty and transparency because it has helped me grow as a person 💗", "esiemefa": "Inspiring!", "efu_ah": "💞🙏", "jenninthree": "Thank you for your transparency!! Such a beautiful soul! 💓", "diamondnite11": "Thanks for sharing and your transparency in 2018! You are the true pioneer...taking women to Ghana BEFORE the full circle festival and year of return for AA. 🙌🏾 trailblazer...", "onejcgirl": "💜", "alwaysrush": "Your honesty is refreshing. All the best for 2019.", "jonesgirli": "I have so much respect for your raw truth. You may never know just how much this post touches my heart. A lot of times, people only show the good, the amazing things happening (which I celebrate). Your choice to share your experiences, both positive and negative, is courageous. At times, I wonder if other women experience what I often times feel but, am ashamed to talk about. Thank you for the realness. May 2019 be peace filled for us all! 💖", "milknchoclate_our_world": "Yep! We be ready by staying ready! Happy New year", "mauibigelow\nVerified": "Verified", "jeaniquecook": "What an AMAZING year. Write the book....", "mamafreshchi": "This is why you are one of my favorite to follow. You could have easily made a lit video of highlights BUT you instead chose to be refreshingly real and inspire. Thank You", "biancadottin": "You’re amazing and I admire your transparency! I hope 2019 brings nothing but love and happiness 💕", "itsdejamichelle": "So thankful I came across your page this year! Your captions are SO real!! Thank you for always being yourself and speaking the truth!!!🙌🏾", "latanya_1913": "You are the best! 🙌🏾🙌🏾🙌🏾", "dnyree": "A beautiful and resilient share Hayet! You will persist 💓🙌🏾", "kuukua73": "Keep doing you , 🤗 🤗🤗", "missalexlarosa": "You are such an inspiration! Thanks for always keeping it real & raw! Love you!", "iamsarah_jane": "💕", "savvypromarketing": "We met at @essence upfront, I was in the room at @coalesce_chicago when your work was celebrated. You gave dynamic and empowering speech; the room lit up. These are small pieces of your year but there is no question you are such an inspiration to so many. I hope you know that. I hope you know you are enough @hayet.rida Write that book, stay close to those that love you and offer unconditional support free of judgement. Keep going the world needs your light. Thank you for the reminder and being authentic, brave and such a creative glowgetter. I love your energy sis✨👑✨", "sophiiaaaa_": "❤️❤️❤️❤️", "joyfullyethical": "Great photo doll! Thanks for the reality check too!!!", "pinktracey20": "That's why to me your a real one. People don't expose their ups and downs and I appreciate you showing real life.👏", "rhopo": "Such an honest and real post - Thank you for using your platform to promote real life issues, success, your inner and outer beauty! Wishing you and all of your followers a prosperous 2019🙌🏾", "every_day_kris": "Thank you for sharing and reminding everyone that most of the time what we see on IG is only a snippet of what is real and true!!! I love your hustle!!! Happy New Year!!!", "judy25saywhat": "🙌🏾keep shining girl Thank you for being transparent ❤️❤️ happy new year 🥂🍾 2019 is going to be even better", "my_stoory": "Yet through it all you remained resilient. Thanks for sharing so much of yourself with us, for being honest when you don’t have to be, and getting us in check when needed. I pray that every battle that comes your way in 2019 you are victorious. @hayet.rida a very Happy New Year...", "nikidawalker": "Thank you so much for sharing. Your openness did more for me than any of your beautiful pictures ever could ( although I admire them greatly). May the blessings of God make you eternally rich in this coming season.", "mizwoochic": "Hayet, thank you for always being so open and transparent with us. Life can be a roller coaster and we’re all trying to do the best we can. I wish you happiness and continued success for 2019 and beyond.", "brickmansion_": "Thank you for being so vulnerable! Cheers 🥂 to amazing new year!", "candesland": "Awesome post! You go girl!! 💕", "just.red1": "Great message", "theheartstylist": "Best caption I’ve seen tonight thanks for sharing and keep riding strong! Your amazing xx", "ebonedenise": "Wow girl. Just wow. 🖤", "bsenyana": "Thanks for sharing and for being so transparent. Wishing you tremendous blessings and continued favor in 2019!", "mekaprince": "Beautiful ❤️", "curlycurvyandfit": "Wow thank you for being so transparent 🙌🏾", "brittneyxamber": "Thank you for your honestly and transparency. It’s helps more than you know. Sending love and positive vibes your way. ❤️", "sherrislookbook": "Thanks for you transparency! May God continue to bless you!", "tfalon911": "When I say I appreciate your transparency! Omg! It lets people know that we are human not robotic images of perfection living perfect lives. We carry out this illusion and it makes us feel more alone. Thank you for showing up we can show up for our best lives while living real lives! 🥰", "nucola_22": "I am so happy for you! This help put things in perspective for people who are always comparing themselves. Thank you for your transparency. I will be praying for you! @hayet.rida What do you recommend for someone who wants to start blogging but has no clue to the first steps of blogging. Can you give me any advice.?", "jay_griff": "Amazing post Hayet thanks for being so transparent with us 🥰", "ami_tay": "Thank you for being real., you are an inspiration God bless you", "curvyhabesha": "You are a beautiful human 🙌🏾🙌🏾🙌🏾", "trulyme_14": "Thank you for this honest reflection of your year. Life is not linear and you have shown that. I pray you are able to embrace more in 2019 with your continued grace and integrity. ❤️ many blessings to you!", "mikkibebe": "I love your transparency, praying blessings for you in 2019💕🙏🏽", "toy2theworld": "❤️👏🏾 😘", "thedanielleyoung\nVerified": "Verified", "cateayellah": "I love you for being real @hayet.rida thanks for this. Will carry the spirit in 2019", "twentysomethingplus": "As much as I tell myself this all the time, it is still a very much so needed reminder. Thank you so much for sharing and sending you all the love for 2019 ❤️❤️❤️❤️", "the.leaux.down": "I love it! Thanks for always being open! ❤️", "sammieee_j": "Embrace everything that it brings 🙌🏽 I love that and you for sharing so many things. ❤️", "brezeeez": "❤️", "crystal_adamma": "Thank you for being REAL!!!!!!!!!! Life isn’t always blissful and you can get caught up with everyone highlight reals! This year WAS NOT EASY for me... but I did have a lot of positives and I thank God!", "mobzyscuisine": "Preach girl🗣👌🙏. Wishing you more blessings in 2019. Discovered ur page/blog this year and been constant on it ever since. PS: when’s the next closet sale. Still yet to launch the outfits i bought from you earlier this month, will share pics when i do. 💃💯💪❤️", "raineyamore": "Allll of this!!!!?!? Wow!! You’re amazing and strong!! This is truly a testimony, you deserve every bit of success that you have and more ❤️❤️❤️", "yeauxadrienne_": "This is why we LOVE you!!! You are such an inspiration. A whole vibe. And you're only gonna get DOPER ♥️♥️♥️ I'm here for all of it! XO", "iseeisaid": "there is even more beauty in honesty - thank you for your constant transparency and candor. wishing you nothing but love, light and peace of mind in the New Year! ♥️ xo.", "kandis.isom": "Yes to this transparency Hayet! May you receive all God has for you in 2019!", "talesandturbans": "❤️❤️❤️", "glossymeals": "🙌🏾💯💖"}