{"tahirahlee": "I so needed to hear that appreciate you!!!❤️", "nhova85": "You’re gorgeous love!!! ❤️", "christalbeeko": "Beautiful, confident and swagalicious... drop mic 🎤", "ben_boateng_official": "You cool, you gonna be OK 💕💕", "collectivelykylie": "So stunning, inside and out! Gorgeous girl! 💕", "el_55_kay": "❤️❤️❤️❤️❤️👌👌", "butterfli4000": "You’re beautiful in my John Mayer voice ❤️", "i_am_yolanda1": "Preach sister, am in the same boat. This self loving road is very long and full of obstacles I.e: ourselves 😩", "nikkiarroyos": "Thank you for always being honest and sharing your journey! 💛  PS: obsessed with the dress in this picture. Where can I buy it!?", "tricediva": "It is definitely okay ❤️", "lotus_femichelle": "Sending love sis❤️❤️💕💫", "iambellaperri": "Thank you.🖤", "ibnruk": "❤❤💖❤❤", "michelle_chagli": "❤️❤️❤️", "missdanijackson": "🔥 You are perfect in your imperfection. I call the imperfections character 🥰 I love this share because it is authentic and honestly we all go through it. I want to acknowledge your sharing because our strength and power and change is in our sharing. 💪🏾 #buildingcommunity #love", "itschelseajackson_": "This dress 😩", "ladybellanaturally": "So many of us have stories to tell, but only a few of us have the courage to tell it. Thank you for you courage. 😘", "ma.hendra1934": "Lovely", "gogram78": "I saw this and loved it! You look amazing and thanks for making it perfect.", "nikki927ga": "Love this dress...", "rhema51": "You look amazing", "ritafreetobeme": "😍🔥🔥🔥", "raimifasila": "I really love the way you look @hayet.rida ,you are a very beautiful young lady .❤️❤️❤️❤️❤️❤️", "mamasasseh15": "Pretty cute....", "__edna__dufie": "You are sooo pretty and I love you❤️❤️❤️🙌🙌", "ewa.ibrahim": "U are very beautiful dear", "afuarida\nVerified": "Verified", "pearlglowcustombathandbody": "💞💞💞😘😘😘", "schakress": "I'm ur secret admiral and ve loved and admired you just the way you are pretty 😍😘", "stylecheckbydee": "@hayet.rida Myself and @anandapetite was talking about how you are doing well and how proud we are of you. You inspire a lot of women and we want to say, keep doing your thing. You are beautiful, confident, stylish, and smart. These qualities makes you beautiful as a woman. ❣❣❣❣❣❣❣❣❣❣❣❣❣❣❣❣❣❣❣❣❣", "anandapetite": "@stylecheckbydee Yes!! honey!! We are so proud of you @hayet.rida", "phannise": "You are amazing @hayet.rida 😍", "miss_gh_1": "And that too is okay my love 🌹😘", "aphya_akyeama": "❤️❤️❤️", "joselmoorerep": "Much love dear", "thekoolkissi1": "It's a premenstrual thing...Whenever I am a couple of days before a cycle, I question my looks.🎉🎉 You are ok! Ride the waves and remember you are beautiful😍", "acmephyllis": "How u so young and so wise love u not just cus u fam but love ur spirit ... bless up", "cannolibabe": "✨you’re one of my most favorite women on here, I support your freedom of choice. I also support your authenticity and natural beauty", "msnassali": "🤗", "aliciae__": "😍😍😍😍", "iamtriciacampbell": "Just know , you are uniquely and wonderfully made. 🎀", "mrsaaa1204": "😍😍😍", "stylish.stephanie": "❤️❤️❤️", "paula_shelton": "You’re just as beautiful on the outside as you are on the inside. Never forget that! 💕", "fromcurveswithlove": "I love this! I also struggle with the same insecurities and constantly tell myself the same thing. It's okay to not be okay sometimes.", "akua_berma": "Self love is a struggle for all of us these days because of how people perceive perfection to be. Ideally perfection is being everything you are and striving to be better on your own pace and your own ideologies. I've always believed being thick is beautiful but it's hard when all society believes skinny people are. People just need to accept differences in preference.", "ineffablewaters": "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "awuraa_": "Thats ok too", "ano_kye_waah": "Such a beauty💜", "ellisy_fd": "MONEEEYYYY! All a bad bishhhnneed is some money!! Love u bishh! The end 😂❤️", "leliassoutherncharm": "💗💗💗", "meronb2": "I just love your honesty!!! You are beautiful inside and out. We all struggle with this at times 😘😘😘", "christodia__": "You’re so beautiful 😍", "essieizspicy": "That too... is okay 👌🏾", "naaakushika82": "You are beautiful and awesome,I deal with the same thing most days and miss my body before babies but then I remember that I have carried 2 human beings so I should be proud and celebrate my body.You are working on it by talk about it❤️❤️❤️", "mcb1823": "💗💗", "fabsculture": "I’ve learned to embrace my bad days. They make me appreciate my good days even more. Looking lovely as always, Hayet.", "meaghanpoconnor": "It’s these honest moments that make you beautiful 💕", "shantespeaks": "❤️😍💖❤️😘 you're self actualization is beautifully designed and I applaud your fierceness and truth!👊👊👊", "lakeshorelady": "Such a beauty, inside and out ❤️", "slisa2016": "U look beautiful l love ur dress", "dee.diary": "Love you baby girl! This just means you are human. We are have jelly rolls. It's what makes us sweet 😘😘😘😘", "trelynnrenee": "You fine!! 👑💗🤗 also, love your dress😍", "myzpeggy": "I just smiled . Thank you 🙂", "doxa2672": "🙏🙏", "thechichimorris": "It’s important for everyone to know that this is part of life, at some point most, people if not all have self - doubt moments. I do and like you said, it’s okay to feel that way and more importantly to keep moving regardless. I saw this photo and said to myself “ this babe is hot and I want that dress, and the lamp, and the basket, and the white throw” -haha! I want it all. You’re fab❣️ don’t forget that 🌸", "farida_farouk2": "💜💖", "homabriella": "Preach sister! This is me lately, struggling with insecurities, comparing and seeking for ways to change the physical image of me.", "curvyfashionvista89": "Sighs I’m definitely that doesn’t like my body but brave up and posted on my upcoming blog Instagram and my personal", "stylepashion": "I love this color on you 💕", "ewura_ekua": "❤️", "stylekues": "My sister the daily struggles of the human spirit is beyond our comprehension however the redeeming grace and favor of our everlasting father reminds us that we are created in his image and therefore is uniquely beautiful inside and and out. My sister I see you and hear you and know that whoever you were supposed to reach by your honesty and truth today, I say thank you on their behalf.👏👏❤️❤️", "judy25saywhat": "@hayet.rida ❤️ thank you for your honesty and I totally understand we all deal with this and it’s ok 😘", "krileytips": "Being honest with yourself is so important. Even more powerful to share with others. We all are on a journey to loving ourselves the way we should.", "brittneyxamber": "Love you for your transparency!", "stargemss": "So interesting how different inward and outward perception can be. I've loved and been inspired by so many of your looks. So elegant and sophisticated with a bit of fun.", "_kellyu\nVerified": "Verified", "thepetitejamaican": "I have to re-teach myself daily about different things I deem issues too. You are gorgeous even when you do not feel like it❤️", "elatish": "One day at a time. That is my rule of thumb. I was scrolling through your website at work earlier thinking to myself 'wow, she is so inspiring'. I just want to thank you for sharing yourself with the world. You have a lot of admirers so don't give up on you!", "deja_quin": "Your honesty is so appreciated. It's a real struggle❤️", "madam_osofo_maame": "Your transparency is empowering, healing, and transforming...its a journey QUEEN. Thank You for the reminder.", "iam_ritaofori": "❤️❤️", "alialistone": "You are strong, inspiring and completely beautiful, inside and out. Thank you for always being open and transparent. We’re all in it together and should all stick up for each other! Thank you for doing more than your part and sticking up for all of us. Love you! ❤️", "helloshumie": "My beautiful sister 🧡 love you", "novemberdelight": "Too much sense👌🏾❤️", "annicea": "@hayet.rida I completely get it...I go through it sometimes! But know that you are perfect the way you are...you're an exclusive edition and quite inspiring!", "karla_rebirth_": "❤️❤️❤️", "missadee01": "👏🏾👏🏾👏🏾 You still winning boo and you look great.", "mauibigelow\nVerified": "Verified"}