{"mhammer_": "@hayet.rida YOU'RE GORGEOUS", "dgarten": "Beautiful!!💜", "redafel": "U are still precious regardless.. some observers wish they had stretch marks but yet they still mean mugging...", "missmutzberg": "That's why I follow you on Instagram cause you inspire me everyday. I have stretch marks just like yours all over my tummy my back and my arms for that I can't wear sleeveless tops or any clothes that expose my insecurities. It has affected me negatively but daily I learn to embrace my flaws. I look forward to you post daily. Though am not as brave as you are but am getting there....", "shopprimetimehair": "like", "jana.n.ashkar": "You are amazing!!!!", "lovely_tesha3040": "Simply beautiful send the haters love and keep shining.", "shadowsorceress": "This blog post really stirred up some emotional baggage in me", "naavaramirez": "Pretty pretty", "elanaloo": "Holy STUNNING!!!!", "banesbe": "This is a beautiful post for so many reasons!", "_micaela": "❤️", "penny_yeboaa": "I think I missed this one, is there anyway I can get to read this very post @hayet.rida", "shairmyworld": "❤️ what a story", "billion_books5333": "My entire torso is covered in stretch marks from my shoulders to my hips. Weight loss, weight gain, natural development, etc. Not much I can do but accept that they are part of me.", "outofbloom.co": "Hey beauty!! I would love it if you checked out my kickstarter for self-love jewelry with the link in my bio! Everything helps 💕😊", "ikandiulife": "DOPE", "miss_lauretta": "@afroglamchic", "momo_buddaphly": "Wow this is deep. U are inspiring dearest! Keep shining", "aritapiaa": "You pretty and you are the most fabulous woman I ever met @hayet.rida", "cbuzup": "This just inspired my everything. Thank you for sharing. I love your style", "tricediva": "❤️❤️❤️ you're beautiful", "girlwithcurves\nVerified": "Verified", "ashiya.zhebiya": "❤️❤️❤️", "naturallyglam": "I always thought stretch marks were only for women who had been pregnant so I was surprised to find them on my thighs as I got older. I just chopped it up to something I earned for being a grown woman. I've lived some life and seen some things.", "xica81": "U r beautiful.... girl power, totally love ur strength. Thank you", "naturally_curlie15": "This is a great post 😊", "ekiuwa": "love love love.", "kimyarbough": "Hot mamma 🔥. Our individual imperfections is what make us beautiful and sexy 😘", "miyachemiere": "You are beautiful!!!! Love you!!!", "curvesonabudget13": "Hit me right in the feels. Love this.", "officialkelvincent": "😰 touching 💞", "vashtilou": "Luv this!!", "itschelseaworld25": "I love this😊 this makes me smile because I know now I wasn't the only one going through this at a early age! ❤ embrace your stretch marks yesss🙌🏾", "1rush7": "😎😍", "jenny_gyamps_": "Yaasss!!!", "mua_afrikanemily": "😍😍", "lam.shines_": "I love them !! I called them my natural tattoos ~ They have been with me in every stage of my weight gain and loss !! I love them 😍", "lilliannajabi": "I love your strength and vulnerability @hayet.rida keep on shining", "kyleemanningg": "you are so inspiring and so beautiful inside and out😍", "districtqueens": "I love that you are writing about this!", "afoah_afful": "you are are so beautiful", "amandaogede": "You are stunning!!! 🙌🏾", "luweezy17": "Love the blog post!", "statuesqueglam": "💗💗💗💗💗", "sowairina\nVerified": "Verified", "selinthecity": "😍😍", "justjuevents": "👏🏽👏🏽🙌🏽🙌🏽 This is what girls need to hear!", "lrqy3423": "😍😍😍😍😱😱😱😱😲😲😲😲", "lu_ee_": "You are gorgeous!💕", "bossybood": "I'm so excited to see that you are joining aerie! I love the direction that they are taking and I think you would be the perfect addition! I feel like I have been following you for a long time- I can't wait to see the places you go!", "marielaly": "👌🏽👏🏽👊🏽😘❤️", "ijeomakola": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾 you are a STUNNER", "afrobella\nVerified": "Verified", "vanewpc": "Yes to all this!", "lindacrsn5": "BRAVO!!! I totally relate to your journey❤️❤️❤️❤️❤️", "lexiconofstyle": "QUEEEEEEEEEEEEN", "ugoiduma": "I love miss your so proud of your body, your scars and imperfections. I want to be like you when I grow up", "nineteen57_africa\nVerified": "Verified", "elizabeauch": "You are beautiful!!!!!!", "onalia35_": "❤❤❤❤❤", "tiffanytamera": "Yesss!! 🖤🖤🖤🖤🖤🖤🖤", "lena_lutz": "I also have a lot of stretchmarks but I'm still very insecure about them 🙄 I try to hide them even infront of my boyfriend and i try to avoid looking in the mirror when I'm naked. Where i'm from (Austria) they are not as accepted in society as in America. When I'm in America I see how other women handle them here and how they show them proudly off and this really gives me more confidence especially at the beach but back in Vienna I try to cover them as much as possible.", "joycedede": "😘😘😘😘", "aasian\nVerified": "Verified", "unconditionallynourished": "Looking amazing!", "chivasforever14": "😍😍😍😍😍😍😍😍", "faila._": "❤️❤️", "jamilastwocents": "❤️", "kessinonu_by_josi": "You're gorgeous😍", "lanadina12": "Well said.", "tiffany.louise": "🙏🙏🙏", "tanika_nyclifestyle": "😊😊😊❤️", "carmelita.makeup": "😊😊😊", "nekibosh": "Such a beautiful soul. Thank you for sharing your life. 🖤✨", "makeupaly08": "@iskeeweeaaa", "lindshinds": "Sad to read that! You are soooo stunning and beautiful! Remember when I met you at the Nike event and was celeb struck!", "raeannlangas": "You are gorgeous! Thanks for being real and sharing your story!", "hayet.rida\nVerified": "Verified", "oforiwaa_x_opare": "❤️❤️❤️❤️❤️"}