{"luvmimee": "So sorry for your loss. Take heart ❤️", "neo.mah": "Im so sorry for your loss 🙏🏽", "tembeiracema": "So sorry for your loss,sending you love💖", "ugo.chinedu": "It is well❤️❤️", "hoppeyyemmie": "💕💕💕 all will be well", "uchechi_mba_uzoukwu": "May she rest in peace in the bosom of the Lord ❤️ sending prayers to you and yours", "26pinkmoon": "Dear Chimamanda, Words are very light to describe the silence that comes and inhabits us when we lose someone dear, a mother, a father, an aunt, an uncle, a child, a friend... Though words are also so powerful and help us connect, as if by magic. Without having ever met you I feel particularly close to you tonight. Even though I am physically miles and miles away I am standing there, just behind your relatives and friends, close to you, as a fellow human being, as a woman , at a time of mourning for so many of us. At a time when we physically cannot travel to embrace our loved ones and find comfort in their company, nor offer our children the ritual they need, we need, to process the death of their grandfather. At such a time it is ever more important to use words to connect and unite. Thank you for doing that, always. May your aunt rest in peace. Take care. Céline", "mariafernandalealgiusti": "🙌", "samantha_zt": "Sincere condolences to your family 🙏", "akachukwumbanugo1": "Yes you have said it all Suddenly we have all become prisoners with paranoia about the invisible enemy covid 19", "dianebrazant": "An amazing artist. Check out live ar Carnegie Hall.", "writelyhood": "I pray the world will be healed of this cankerworm that has eaten deep into our society", "_ubanii": "❤️", "stay_outta_sight_outta_mind_": "Condolences on the passing of your aunt 🙏🏽", "aputazie_sylvia": "May God comfort you and her family😞", "doosuurjessica": "@chimamanda_adichie I love you so much ma'am. You've been able to massage my soul with positive words that has erased the extreme anxiety and timorousness I was feeling all these while. God bless you and your family. Your husband is saving lives and the Lord will keep and protect him for his good deeds. Thank you❤❤❤❤❤❤❤❤❤", "josefinasportugal\nVerified": "Verified", "lionqueenogeh": "Accept my deepest condolence 🙏❤️", "tejubabyfaceoyelakin\nVerified": "Verified", "meioshiaaa": "@theplencessishiya", "eldealerdeloslibros": "Ok", "marcia_albuquer": "👏🏻👏🏻👏🏻👏🏻", "amakajc19": "😢", "patriciasamms": "Thank you!❤️", "queen_vincent": "@chimamanda_adichie May God comfort you and your family in these trying times.", "deborah_nyc": "🙏💙", "pichronworld": "So sorry for your loss. As you have comforted the world with your words, so shall you be comforted by the one who owns the world. Be well...", "indiarafazolo": "@lubrandalise 🌟", "etuks_ceejaygoody": "💓everything is going to be fine . Sorry for your loss ma'am. Yes we would try to stay positive always.", "luciaigwe": "I’m really sorry for your loss ❤️", "veryblackfeminist": "❤❤", "king.sphily": "🙌🙌🙌I am so grateful to have read this❤️❤️", "the_soma_fortune": "I can’t even find words to type. ❤️❤️ just as you said Shan was “ you’re special “.", "loveyoruba": "Sorry for the loss ma.", "uyaiumana": "❤️", "ogelleson": "So sorry for your loss Chi! A Truly soothing message to us all, thank you", "nikkypatworl": "I send my heart warming condolence to you and your family, you have been my mentor, my crush, my hidden and unmet friend, my heart desire is to see you and atleast have a minute talk with you. You are really a big treasured hidden in my heart, and I will Always treasure it. When you grief, just know I grief with you. Cheer up things will get better for for you, me and the entire world. Love you", "joellekenjo": "❤️❤️❤️", "ninadalessandro": "Thank you 🌹I am so sorry for your loss. And I am so grateful for your being here, for your words, for music, for your beautiful work. For the work your husband is doing. Thank you so much. I keep you in my heart, always. Stay well.♥️♥️", "horsfordsarah": "Condolences to you and your family", "akunna_akunna_jr": "It is well", "omuojine": "The burden we have to bear. And sorry for your loss.", "scholasticaachoromadu": "❤️❤️", "unitedstreettours": "🖤🖤🖤", "per_fecti": "Sorry about your aunt. Stay strong, Stay safe", "emmachukx19": "My deep condolences to you, your family and her close acquaintances. May God grant you all the fortitude to bear this irreparable loss. May her beautiful soul rest in peace.", "alicewacha": "Thank you sharing the positive words. I'm also trying to educate myself. The anxiety that i had is now over.", "amalachukwuokeke": "❤️❤️🙏🙏", "uzzaass": "Please accept my condolences, praying for you and yours through this tough time", "carmenmartinaparicio": "😍😍", "andyedwardsster": "I lost my aunt to a brain aneurysm also. We were very close. That was in 2017 and the circumstances surrounding it, a story in itself, were devastating. May your aunt Rest In Eternal Peace as I hope mine is too. Peace and love to your family and the utmost respect to your husband. The British NHS is under severe strain as I am are you know, so I hope he has the support he needs to do his job and stay safe for his family.", "crochetemoiunmonde": "Sorry for your loss. Thank you for these words.", "trish_chio": "So sorry for your loss! It is indeed a strange world we live in.", "_am_sassy": "❤❤ stay positive sending you love", "ugochukwu.okoye.184": "❤️", "bekkisec": "May God strengthen and guide you all in Jesus mighty name Amen. So sorry for your loss.", "honeypieliving": "i am so sorry for your loss. thank you for writing like this too, through it.", "alexandramegwalu": "❤️ stay safe", "miriannett": "Reading the scriptures at this time is of tremendous help and meditating on a particular word of knowledge of the passage through out the day . It’s the best medicine for this crisis period .", "somiee___": "❤️❤️❤️❤️❤️", "layidee": "❤️❤️", "ellenjoanp": "🙏🏽❤️", "dorcasajosekaka": "So sorry for your loss...", "noreenmudzi5": "❤️", "_kaymama": "Fragile! Oh so fragile😢 My heart is pierced.. May her beautiful soul RIP 💔", "nellie.prima": "So sorry for you loss. May God keep us all through this and beyond", "ayomikunsonuga": "So so sorry for your loss. I wish you comfort and peace. We love you ❤️❤️❤️❤️", "watkinslavetta": "🎶🎶👏", "mmaolisa": "I'm very sorry for your loss! Thank you for this post and your transparency 🖤🖤", "j_alexandrepaulo": "So heartwarming🔥👌", "april_omaa": "❤️", "lets_build_it_together": "I Love you. I sincerely do. May you find strength to bear this loss.", "anitaabiona": "Sorry for your loss❤", "gemclothingng": "So sorry for your loss 💔", "emekamondial": "I'm wrapping my love for you 💝it's for a lifetime. Your Dear Aunt is journeying well too. God bless her Soul 🙏🏽", "dips_________": "Thank you for this.💗", "lachina1968": "I know how you feel. I am married to a physician also and have 3 children and. Instantly worry when I hear anybody sneeze, cough or show signs of having the sniffles. This too shall pass!", "thedeborahariyo": "❤️", "cheta_glo": "💞❤️", "chibabe13": "Sorry for ur loss. Life is full of emptiness.", "tenzy_tayne": "❤❤❤", "myriiamxoo": "❤️", "phyona2811": "❤️❤️", "anneaide": "Better Days are Coming…My Condolences 💝💝💝", "oraefo111": "Jisike nwanne o. Amazi ekene a ga ekene na udi oge a. Ndo maka onwu auntie gi, she has gone to a place that there is no more worries. Nnem nwukwa too", "tavetanomad": "❤️", "blazingchic": "♥️♥️♥️", "kathienaturinda": "@privacysucks @imelda_mbabazi @arinda32 @shabillahshabo", "frankieekg": "❤️❤️", "chacha001_": "May God comfort you all and grant you peace. 🙏🏾❤️", "missgoldiemum": "My sympathy to you and your family. May you find comfort in Jesus and your daugther smiles.", "alexandrazion": "♥️♥️♥️", "azihogechi": "So sorry for your loss, ma'am. God is the strength of your family. ❤️", "clivatianna": "❤", "khemdy_ezenwa": "Jisie ike 💕", "b.i.a.c.a.m.p.e.l.l.o": "@liladeccache 😘", "mschukwumaa": "❤️", "dorothyyofoz": "♥️♥️♥️", "businessiqafrica": "Together we will come out stronger and better, but never to forget those who went with the wind. They will forever be engraved in our hearts...", "beekayffg": "🙏🙏🙏🙏", "adaora_akanegbu": "Sorry for your loss. I pray that the good Lord comfort and console you at this time in Jesus name. Amen.pls take heart.", "cherryugo": "Nne ndoonu oh. Biko dibenu. Please accept my sincere heartfelt condolences 🤗", "odyssey62": "Do not be heartbroken.... Accept my condolence, we shall overcome.", "efemenaasikhia": "👏", "just_chased": "♥️♥️♥️", "sadesbookworld": "So sorry to hear of your sudden loss in times when none can gather, giving thanks at farewell rites.", "amanda___f": "Sending you love and positivity 💞", "helen.mtr": "💛", "wambu.eva": "Sending you love and condolences for the loss of your aunt. 💕💕", "ninaberry_uk": "❤️ Peace...!", "beyouty_udoh": "Sending you lots of love from Nigeria", "easychizzle": "@chimamanda_adichie I share your feeling of losing a loved one suddenly (in my case, no doubt the love of life-my dear Mother)...truly devastating... I pray for comfort and strength at this uncertain times...and to all you medical professionals and families ...the heroes of this pandemic...my heart ❤️is filled with gratitude and respect for all your sacrifices. Thank you 🙏", "mogau__ntsoane": "❤️", "jyoon21": "❤️❤️❤️", "o.malikiafe": "😢", "okegbeezekiel": "I'm sorry and I'm so scared too for myself and the rest of the world.", "pazos_carmen": "💚 From Madrid where it is impossible not to have a friend, the father of a friend or a relative affected directly or indirectly. We trust the doctors who take care of us and we know that together we will overcome it. Living alone is hard, the uncertainty of the future more... that is why we must strengthen our spirit and our heart, because only from love will we get out of this tunnel.", "phosneedlecraft": "Thank you for the Word of Hope, irrespective of the happenings", "ajedge.71": "So sorry for the loss of your Aunt. Your words, as always, help us to navigate troubling times and be gentle with ourselves. Stay well, inspiring one. Xx", "personallybless": "❤️", "edna.dorosario": "Thanks a trillion for sharing these words of wisdom as only you can. My deep condolences for the loss of your aunt. Take care xxx❤️❤️❤️", "st._jorge": "Thank you for your words", "ifoxxie": "@chimamanda_adichie our prayers are with your husband and family as they are in the frontlines daily. May God comfort you on the passing of your aunt.🙏 I encourage you to also use this time to get closer to God in Christ Jesus. The word of God is a great reassurance. Shalom.", "zoemakeovers": "sending lots of ❤❤❤❤❤❤❤❤❤❤", "ashantiqueen": "My deepest condolence to you and yours. May you all be comforted in the memories of the good times you shared with your beloved aunt. May her soul Rest In Peace 🙏🏾", "oluwapelumi_king": "God be with you in these trying times. Amen. You and your family will come out stronger.🙌", "sisianie_": "We’re all hanging in here 😢 Stay strong mama ♥️♥️", "greatness2617": "Thanks chimamanda", "adaobi_oe": "❤️❤️❤️", "drsenos": "Oddly enough, your philosophies have been twisted time and time again by countless people to soothe their personal beliefs which may not serve humanity rightly. Following you has given me a glimpse into the purity of your soul and the beauty of your realness. God Bless you. This is what we all need to hear now. Condolence on the loss of your aunt", "chuksfranklin": "Well ... the times now is so scary... working with the NHS , daily I face the challenges people are going through all over the world ! I paused and wonder ! Where will our help come from ... I remember my bible passage to look up to the hills ... now both believers , non believers and other religions are seeking same answers? May God see us all and provide our much needed help at these trying times ! Thanks @chimamanda_adichie for your encouraging piece !", "nt3n_": "Sending you love and light🙏", "gasskane": "Sorry for your loss 🙏🏽🙏🏽🙏🏽", "dupe_virgo": "May your Aunty RIP, stay safe everyone", "queen_bee_brownsugar": "Sorry for your loss. This too shall pass", "joanwindzak": "So sorry for your lost. Strenght and Love to you and your loved ones. Stay safe!!", "celebnancyu": "Please accept my heartfelt condolences. Stay strong!", "_danielobum": "@chimamanda_adichie this too will pass. Our prayers are with you", "peanut_raj": "@uolevi.sjoberg", "ellasommey": "💖💖💖💖", "ikem.onwe": "❤️....", "occam3razor": "My sincere condolences to your family.", "cyril_nwa": "So sorry for the loss 💜💜💜", "yociku42": "My condolences. Thank you for sharing your gift with us❤️❤️❤️", "iam_ojahd": "Daalu nnem, Ezem gozie gi", "nafisat.a.a": "Thank you for sharing. Every word resonated with me. Every single word. I am reading your book #dearijeawele and it has helped me coping with my kids this period. @chimamanda_adichie I hope you and your family finds the fortitude to bear this loss. My deepest condolences.❤️", "blessedness70": "Positive vibes always ❤️🙌...Rest in peace to your aunt. Love you chim", "d_ironbutterfly": "💔", "izuudokwu": "So sorry for your loss. Love and light. ❤", "eclectictope": "❤️❤️❤️", "teereis": "❤️❤️", "kin1476": "❤️❤️❤️", "munahdavid": "God! I love this woman!", "theblackwomanintheroom": "🙏🏿💜🙏🏿", "aliehjudwin": "Sorry for your loss. What’s important is to not let fear overcome us! Kudos", "zabbyallen": "Thank you for this ❤️ Sending you and your family love x", "n_ouzlat": "Thank you for sharing 💚! I wish you and your loved ones well... We are all in this together 🙏🏾☘️", "_chef__dee_": "Thank you ma, you are a gift to the world...... I've been furious about all this going on with different scary stories about ID2020 and all I will do is PRAY and keep calm and divert my attention to something worth my time, increase my knowledge and hope for the best...... GOD is in total control.", "sara.a.tube": "❤️", "_mznelo": "So sorry for your loss Chimamanda. May your aunt's soul rest in peace. Thank you for sharing this with us.. It's comforting to know people share the same feelings one experiences.. ❤️🤗", "officialvickchuks": "God is your strength mama... this to shall pass💗", "bethmidwinter": "You are an amazing, inspirational, woman in 'normal' times & in this time of anxiety, uncertainty, disruption & sadness, you have managed to capture it all. We must be cautious but also wise with this time of isolation as you say. My thoughts are with everyone in this time of loss. Thank you for this post 🙏", "barbieodion7": "I would rather not grieve with you but say her memories keeps her close though distant but still remembered and the world might be in its crisis like phoenix we shall rise again", "kelly_praise": "❤️", "chisomwrites": "Ma I will tell you something God of Abraham Isaac and Jacob will protect you and your family ....no harm will befall your home ,your husband nothing Will happen to him in Jesus name _Amen ,fear not my greatest role model Jesus shall save your family", "bellestephanie__": "Love & light ✨", "still_ofure": "❤️❤️❤️❤️ light 💡 at the end of the tunnel", "ms_gooddys": "May Jehovah comfort to you and your family😍❤️", "amanesifadilat": "This light me up knowing fully well we are all in together and we still have reason to be faithful thank you so much @chimamanda_adichie you're a my definition of beautiful sweet soul.love you sister ❤️❤️❤️", "eurosia_silver": "Sorry about Ur lost", "lolabaej": "This message ❤️❤️ This too shall pass... ❤️❤️", "liliana_tebeica": "@iulia_iordan 💚", "pepp_clean": "Nne ndoo, God heal and strengthen you all. May her soul find eternal rest. We shall remember those times and thank God we pulled through", "winkpat": "Please take heart. It's going to be fine", "withwomeninmind": "❤️🙏", "theintellectualwomen": "My heart felt condoned, sending you love and light.🌻💕", "itz_mercy_jemi": "I am so sorry for your loss . Thanks you so much for this write up.", "nkechi.lillian.94": "❤️", "nnajiwendy": "Take heart and so sorry for your loss❤️", "meccadickerson": "My you get great peace in this crazy time. And I'm so sorry about the passing of ur aunt. My heart is broken for you and you and your family are in my prayers. Keep ur head up and feel what u need to feel daily. Love you!❤", "verachidera1": "This life - becoming more a mirage.", "ibifubaraa": "❤️❤️❤️❤️", "marcbiesm": "my sincere condoleances on behalf of you and your family Chimamanda ❤️❤️❤️ love and peace", "vanderlayreina": "Este texto me fez sentir que minha visão de mundo não é única.", "mohamedsaadieq": "Sorry Prof. for the loss of your dear aunt. I share your feeling regarding the current pandemic as my partner is an Ophthalmologist who faces similar danger everyday and the added risk of transferring the disease to the children. All we can do is; cling to hope and optimism that it's a passing cloud and all will be \"normal\" again.", "bitrus4u": "Pray your aunt rests in heavenly peace. Nice piece from you as always. Take heart.", "makuaeyisi": "Accept my sympathy. It is well with you and the entire family. We will all get through this.", "baronsbabe": "My condolences❤️", "kevmwachiro": "Sorry for your loss.", "radiant_balance": "🙏🏼❣️", "nnernnah": "❤️", "djlambo_\nVerified": "Verified", "annelingalik": "Thanks for sharing ❤️ We are in this together.", "emsunderwears": "Thank you so much for your words, I am so sorry for your loss. ❤️", "chief_okon": "Sorry for your loss Ma’am", "jenynaji": "May God helps us all, Condolences to you and your family.", "jaydeebespoke": "Sorry for your loss❤️", "elaanthony": "Sorry 4 ur loss..... Ndo💔😭", "sukeinahkassir": "My condolences for your loss. You are in every way inspiring.", "pink_osi": "Beautiful, thank you 💖", "prettyluvify": "@chimamanda_adichie be consoled by the only one who knows all things. Whom in his hands, we are nothing but clay. In times of pushing your mind into another territory, remember what He said in psalm 91 vs 7, a thousand shall fall at thy side, ten thousands at your right hand but it shall not come near thee. Only with thy eyes shall you see the reward of the ... So pray it like this sister, a thousand shall fall at (add your husband's name) and believe with faith. This pestilence shall see the blood and pass over. You are strong, a woman of valour, find your strength in his words and defeat fear sister. I say a prayer for u too thus minute", "estelley1239": "❤️", "ngozi8826": "So sorry for your loss. Thanks for this wonderful write up", "anitathirkettle": "💚Thank you🌼", "sultanalqassemi\nVerified": "Verified", "sengakdesign": "❤️❤️❤️", "zubbizaretta": "🙌", "thequeenisabelle": "❤️", "lacivictrends": "🙏🙏🙏", "tenuci": "It's all too much to bear sometimes. 4 kids at home, 2 college kids, a high schooler and a middle schooler. All navigating the new world of E-learning. Mom learning to work from home in a home and staying focused with overwhelming anxiety of how the world changed overnight and what it will be in the future. I was never a movie watcher since I will rather go to a kids basketball game or concert or make dinner and rest afterwards by reading. Now I watch movies, bake cake and cupcakes (for the first time) . Take walks. Anything to stay away from watching the news. Anything that is more soothing for the soul. It is well sis. Praying for you and yours and our world.", "chinemeremogo": "So sorry for your loss. May God protect us all. We pray for the safety of all medical professionals and first responders ❤️", "jowhorile": "I'm sorry for your loss. And THANK YOU ❤️", "rodamonami": "Condolences @chimamanda_adichie .i never knew I could be this anxious especially when the deadly virus 🦠 stares you in the face as you help save lives everyday. The pain ,anguish I feel can not be couched in words- your words are heartwarming.God bless you Chimamanda👏", "olivia.kumpula": "There is so much comfort in these words. Thanks for lifting many up. ❤❤ So sorry for your loss. 😢", "grace.bitrus": "May God protect us all. More of His grace to you", "yinnie_fab": "@chimamanda_adichie so sorry about your loss. I feel so sad because she so was strong, vibrant and full of life. May her gentle soul rest in God's bossom and may God grant you and your family the fortitude to bear this great loss. 🙏", "chistory_": "Ndo o! So extremely sorry for your family's loss. Thank you for sharing🖤", "bkul4real": "So sorry for your loss. Thanks for your words.", "dummyjonathan": "Sorry for the loss. May her soul Rest In Peace. Stay strong Sis", "jackymwangi": "❤️", "knzisa": "Terribly sorry for your loss. Your message is a salve. A reminder that nobody is spared from this shared devastation. That it’s okay to be shaken by this nightmare we’ve been thrust into. Thank you for encouraging without admonition and for this most intimate communion. ❤️❤️❤️❤️❤️❤️", "jesika.oc": "❤️❤️", "aleshabarber": "@nikeshav", "ugosharon4u": "So sorry for your lost, may her soul rest �� in peace Amen", "shirokoinange": "💜", "iamchidiamadi": "I wish you and your family peace and courage to sail through this times. Sorry about your Aunty.", "king_jabal_": "I'm sorry about your Aunt. Be strong for your husband. He'll be fine. God will protect him. Encourage and pray for him. Soon the dark nights will be over, and the sun will again.", "asipofgrace": "Please I need money ... Hunger is real", "realtimekids": "Sorry for your loss. Positive vibes and God blessings", "lilyguzell": "My her soul rest in peace.. amen", "dimmaemmy": "so sorry for your loss.", "lonajackvilmar": "I am so sorry for you loss. 💔Du courage. What challenging times these are! Your beautiful words resonated for me, saying so effortlessly what I have been unable to speak. Thank you. 🙏🏾", "mmejanez": "Love and light ❤️❤️", "kitchenbutterfly": "Sending you love, Nne. I pray for comfort x", "nessagr": "I’m so sorry for your family’s loss.", "osmondnick64": "Carolina...what a beautiful soul we have lost, just added her two days on facebook and the next news from my mum is her death..nwanne m nwanyi you said it all and well calls and exchange of pleasantly is very important between family and friends, but the more we want to do the right things, the more the worries of life set us further apart. RIP CARO we love you.", "stoneologys_stone_love": "Love from near and far🌹", "iamadoring": "Chimaa accept my condolences", "angeliquefurey": "👏", "mara_abutu": "My condolences. Thank you for this piece and we pray that this too will pass over", "tess_ife": "I’m so sorry for your loss and I pray ur husband remains safe. To try to share u up, your book kept me from going insane last week(on lockdown). Americana gave me something to look forward to. I couldn’t drop it yet I felt so bad when I finished it. God bless u and accept my condolences. Again, be safe", "jaynejanes": "So sorry about the loss of your aunt. ❤️ . We pray for courage in this trying times.", "face_planter": "💗", "sadboysloan_": "Pls where can I download all your books in pdf format", "princkencee": "Wise words, wise woman... sorry for your loss🙏", "nma_negrifille": "Sorry for your loss. Thank you for sharing your path to healing with us. May God grant your family the grace to pull through and thrive amidst everything.", "lorenzomenakaya\nVerified": "Verified", "eloebhosemercy": "😢", "amalchaaban": "Thank you.", "emmanuelemli": "Stay strong and may God grant her eternal peace.", "obian": "So sorry 😢", "fiftyshadesofcrayness": "♥️", "ekeneanonyai": "❤️❤️", "honoree_jeffers": "I am so sorry.", "euniceiloba": "Sorry for your loss 😔", "nicolegwilliams": "Thank you for sharing. 💜Sometimes the daily challenge is which self-care acts to complete or how to switch my prayers as God has been hearing the same ones for the past 2 weeks! Sigh But still I am sooo thankful for this breath that I breathe and my health.", "bamijioke": "So sorry for your loss!", "ch_obinani": "So sorry for your loss. Thank you for encouraging us and for sharing, transparently and vulnerably. ❤️", "wendyukaegbu": "Sorry for your loss. ❤️", "emmanuelannamani": "🙏🏿🙏🏿🙏🏿🙏🏿", "aprilmiska": "❤️", "pulchr__": "Thanks for your encouraging words...Really selfless despite what you are going through..May your Aunt’s soul rest in peace.", "izunna_24": "May God in his infinite mercies comfort your beautiful heart and give us all the grace, courage and strength to overcome. ♥️CNA", "juliaaidoosaltus3666": "still bill the amazing documentary is on youtube and his authencity and humanity will move you as his music continues to move us", "efdzomba": "❤️❤️❤️ tHaNk yOu.", "mhizluchys": "So sorry for your loss😔", "lamideob": "Sending you all the love, Presido ❤️❤️❤️❤️❤️❤️❤️", "adebimpesusan": "❤️❤️❤️🙏🙏🙏", "fnwach": "So sorry for the loss of your aunt. Thanks to your husband for the work he does", "rubbieshood": "Keep Staying STRONG!", "am_queen_o": "❤️❤️❤️❤️❤️❤️ thanks @chimamanda_adichie yo have lifted my soul....sorry for your lost", "munawanna": "Thank you for the wishes and for putting our thoughts so succinctly at a time like this when thoughts and words go on forever in our minds and hearts without ceasing! May your aunt Rest with our Lord.", "mizadaugo": "We love you Queen Mother.", "voke_x": "🤍🤍", "evelynegitau": "Sorry for your loss", "pristrendy": "So sorry. May her soul rest in peace", "lola_pearls": "♥️♥️♥️♥️♥️ I pray God comforts your heart in ways that only Him can", "sassyvoodoodoll": "Sending you and your family love and healing xx", "ada_elechi": "I’m so, so sorry for your loss. Condolences to you and your family. Thank you for these encouraging words 🙏🏾✨", "adorecreationsng": "❤️❤️❤️", "nancydutraa": "♥️♥️♥️", "lord_selmo": "❤️❤️❤️❤️", "dombokr": "I have nothing more to say than I love you for sharing this! I am a healthcare provider (physician) and a human being. My father passed away a little over a month ago. Every aspect of your post resonated with me. Thank you @chimamanda_adichie", "carla_simoes_goncalves": "❤️", "marikanoelbeck": "🙏💗🎶", "nanaibrahm": "❤️❤️", "perse83": "❤️❤️❤️", "theolivenwafor": "So sorry for your loss 💔💔", "its_alesh": "@chimamanda_adichie", "nkirubertha": "Thank you", "loro_brown": "I'm so sorry for your loss 💗", "funbi_a": "❤️❤️❤️", "zingossy": "Eternal rest grant unto her Oh lord and let perpetual light shine upon her. Amen", "the.phidelia": "Love you mama. This was reassuring to read. Sorry about your loss ❤️", "maryqueen_ig": "Like Mona says, \"love and solidarity\" ❤️", "r._.cubed": "I’m so sorry for your loss. As usual, your words are a soothing balm on my ragged soul. Thank you for this snippet of your wisdom.", "pazqaleriq": "Love and light❤️✨", "okikiolaamosun": "Thank you so much my queen, sorry about your loss and anxiety! Thank you for the words and sharing this with us. 💗💗💗🤗", "its_jelzy": "❤❤", "fornewsonline": "Sorry for the loss sending light And to you and yours ❤️", "nancy_simire": "💖", "themercywhite": "❤️❤️❤️", "unieros": "🙌", "tashmankidesign": "❤️", "idnezirdux.aeiou": "Sincere condolences for your aunt's passing. And thanks for your encouraging words.", "emekachukwuleta": "❤️❤️❤️", "neloruby": "Sorry for your loss dear", "chiedu__": "So much love💜💖", "__authocrat__": "I live to read and hear from you!!!!", "geovicman": "Time for love, true love tens of thousands have lost their loved ones in this so short period of time, life is not the way we used to see it, we are all fragile and frightened by an unseen ghost. Let us all pray for the world to be healed, let's pray all for the 21st century heroes and heroines with gloves and masks we owe it all to them and for those of us that are still in good health take the utmost precautions and responsibilities that worth to save one another. #StaySafe #StayAlive everyone 🙏🏻♥️", "nenyeuwa": "Be strong, Nwanyi. I love you.", "bolualege": "💕", "chinezeaina": "Dont read the rubbish news on WhatsApp", "valzikie": "May she rest well and may God comfort your family. We continue to push and hope this all passes sooner than expected.", "deevadoc": "❤️❤️❤️", "gp_nuel": "Ka chi gi, gba gi ume!", "mztasha_o": "❤️❤️❤️❤️", "sylvia_anyanwu": "@oluwaramsey", "maupe_ogun_": "Heartfelt condolences. And love, light and patience to us all.", "slyken2002": "🙏🏽🙏🏽🙏🏽", "queeenomaa": "Chukwu gba gi ume 🙏🙏🙏", "growingingratitude": "🙏🏾❤️🙏🏾", "drsexxyann": "Sorry for your loss. Thanks for the kind words as we all try to make sense of what's happening to our world. ❤️", "okwuma1": "Please accept my sincere condolences. 😢❤️", "thefolalola": "Thank you 💝", "mobolaji.olayiwola": "So sorry for your loss", "kweenbouqui": "@oyepejufanibe", "nnesworld": "❤️", "ezinneuzoije": "Ndo 💙", "travelnteachinmd": "❤️", "simplynaye77": "So sorry for your loss. My prayers are with you and your family..", "eh.dem": "And even in her depths of distress, she still scribes with words that bring healing to hurting souls, words that so eloquently summarises our present times. ♥️", "ucheejombo": "🔥", "missbeejay101": "❤️", "chychy_akah": "Thank you so much ❤️", "graciousbanx": "@olu228 @1banks6 it will surely end in praise", "_adaanya": "So sorry ♥️♥️♥️", "kledinagoncalves": "Sorry for your loss. God bless you and your family! 🙏🏾", "spykemahn": "Take heart my dear.", "thefirstoge": "May God rest her soul❤️❤️. Love and Light💕💕", "aiphiee": "🙌🏾🙏🏾", "gailen16": "❤️", "sommydegr8": "So sorry for the loss. And thanks for this soothing words. Las Las, all will be well @chimamanda_adichie", "tosybrown": "We would overcome! Garcia's", "kewoba": "❤️", "annie_purple": "💜💜", "jessicataloa": "I’m so sorry for your loss. Prayers for you and please stay healthy.", "lyndadozie": "❤️❤️❤️ we will all be fine @chimamanda_adichie", "kathrynpfz": "Thank you for your insights. ❤️", "effygolightly": "I'm sorry for your loss. These words are powerful and warm to feel, thank you so much. I pray that we all come out on the best side of this pandemic being much more of the good that we can be as people. Sending you love and peace ❤️❤️", "patience.only": "❤️❤️", "_badbitchesbookclub": "Sending you condolences, love and strength 💟", "mis_achi": "💚💚💚", "nonye_princess": "Please accept my condolences. May her soul rest in peace.", "barbarahonnah": "My condolences to you and the family. We are all in this together. There's not a single day that goes bye without this monstrosity haunting us all. But i believe with God above, precautionary measures and social distancing we will sail thru.", "phenomenal__beegirl": "It's okay not to be okay, this too shall pass 🙏🙏", "oluwabusolaa": "❤️❤️", "colombebethel": "We are with you and we understand. I think all people in the world feel the same. I'm the very worry for Africa but I put my hope on the grace of God because they don't have the same infrastructures. I live in France. My peace comes from my faith and I pray for the others. I feel fears sometimes but I give all to God in my prayers. Lov you and courage ♥️♥️♥️", "louisecartledge": "So sorry for your tragic loss and for it coming at this terrible time which prevents us from being with our nearest and dearest when we most want them. But thank you for your writing - sage advice on grief. I lost an elderly friend to the virus today and another is still in intensive care. 🙏", "yure_imo": "❤️❤️❤️", "kechys_world": "So sorry about your loss", "essential_printz": "It is well with us all", "purple_pastry": "💜💜💜 So sorry for your loss 💜💜💜", "ntuchimene": "❤️❤️", "florence_wele": "Thank you for not staying silent, and making us feel your presence in this storm. May you also find peace, and the soul of the departed, rest in peace. 💓💓", "thelifeofagreatwoman": "So sorry for your loss💜", "christyspices123": "Be strong... Sending lot of 💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕... God will see us through!", "susannahrigg": "Thank you! ✨", "adaoramuka": "💞", "aifysmart": "Be comforted dear. Keep being positive and hold unto GOD for HIS mercies and protection over your family and the world at large ❤️❤️", "ifyendowed": "So sorry about your loss Chimamanda,may God console you ❤️", "iphieuju_eze": "❤️", "theaugustmodel": "🙏🏾🌹🙏🏾🌹", "youniquebeee": "Condolences", "foxzyhopezbenson": "Accept my heart 💔 felt condolences ma'am🙏..also an inspiration reading through this today.", "wellwornheels": "As always , thank you for your words . I’m so sorry for your loss .", "prettylindal": "I can relate to how you are feeling. The world will not be the same after this crisis. My condolences to you and your family.", "jeowears": "Sorry ma", "julieycey": "O ga adicha mma nwa obere oge", "smbell1": "Thank you for this small reminder for us to choose to live.", "robincastle5": "🙏🙏🙏", "tracyjewel_": "So sorry for your loss", "mahamasadkhan": "@ayanmagan", "isarange": "I'm sorry for your loss😔", "chlchi_": "❤️❤️❤️", "franciodu": "May she rest in peace. May we who live, find peace and calm in the midst of this chaos. Stay safe and well.", "onyee_nye": "❤️ and 💡", "duchexx_": "May her soul rest in peace 🙏🏾🙏🏾", "greenladysalad": "Our deepest condolences to you and your family. Sending peace to your spirit and love to surround you. Hopefully, more of us will move ourselves to the middle ground that sits between informing ourselves and continuing to grow, flourish and thrive. Thank you for all that you share, and the ways in which you insure. May you all be well. 🙏🏾❤️🙏🏾✨", "adyzz204": "Sorry. Be comforted by our comments. May God grant you and family, peace and fortitude to bear this loss", "bukolareis": "❤️❤️", "ifiwu": "❤️", "mrs_rita_binomo_platform321": "Prayers to your loved ones❤️", "michelledede\nVerified": "Verified", "bwizamp": "Thank you for this. I needed it ❤️ sending love 🙏🏿", "ojieabutosin": "May you find comfort in those negligible things you do and strength to pull through in these dreary times..", "kakkoifly": "Thank you Ms. Adichie, my soul needed this. Sorry for your loss, be lifted 💕", "soti2k": "Please take heart☺️so sorry for your loss Chimamanda.", "ruthnwigwe": "🌺🙏", "colly_samuel": "Sending you love, comfort and healing.", "lomi_liz": "🙏🏻I am so sorry to hear of the sudden loss of your dear aunt, my heart is with you💛", "chi_fada": "❤️❤️", "ogonna__": "💗", "efepaulazino": "💜💜", "s_nah_chee": "Nice words..", "etifitmiracle": "You are good. Twirling a simple message to be so jaw breakingly literary. Is it a gift or you drink it as this your sought after water?😂😂😂😂😂", "chocmuse": "Condolences to you and your family. Thank you for sharing, and articulating these thoughts so well. Love to you and yours. 💙", "duchess_deda": "So sorry for your loss ❤️", "sambi.h": "🙏🏽 sorry for yours and your family’s loss deepest condolences 🙏🏽 thank you for sharing your thoughts...... needed to read this. 🙏🏽💗", "tuftedcoquette": "My condolences to you and your family on your aunt’s untimely passing. I’m so sorry for your loss. Thank you for your supportive and wise words.", "roquetacroqueta": "❤️❤️❤️", "roshellehall": "Sorry for your loss. And for this sadness during a time that is already so surreal. As you mourn may you find fresh ways to connect with family near and far. And may you also connect to the life and spirit of your aunt as you process the legacy of someone so close to you. My sympathies and prayers are with you and your family.", "nkeoma08": "God comfort you and your family ma'am🙌", "ronketalks": "I'm so sorry for your loss.", "leorawise": "So sorry for your loss ❤️", "victory_mba": "❤️", "moyor_": "❤️❤️❤️", "emmyd555": "🙌🙌", "angela__wallace": "Bug Hugs for you love ❤️ @chimamanda_adichie", "amakaonochiee": "❤️", "sunshinebeckyart": "This text brings me peace. Thanks, as always, Chimamanda. 🧘🏼‍♀️", "omowumiolowofeso": "So sorry for your loss ma’am. May the Almighty comfort your family and grant your aunt eternal rest. Thank you for your soothing message. Love you ❤️", "sweetestcara": "My dearest CNA, I cannot begin to imagine how you feel with the death of your aunt. Stay strong. The world as we know it will never remain the same again after the coronavirus but I'm sure humanity will prevail at the end. Being a doctor myself at this time is one of the most difficult choices because each day we go to work not knowing what to except. The fact that people can come to you with coronavirus and yet remain asymptomatic makes it all the more scary so each day we fear and hope something terrible doesn't happen. I fear for what may become of my daughters if I get exposed to coronavirus, to Lassa fever or to any of the infectious agents I'm faced with everyday. But in all things, I (we) trust everything will be fine . Stay strong dearest CNA. And thanks for these soothing lines, you don't know how therapeutic they were. Thanks again", "s_yoyowah": "Thank you Chimamanda. I really needed this. Thank you so much💓", "derin_dekunle": "❤️ & 💡", "freidasmonkey": "❤️", "jacquelineagweh": "May she rest in peace. It has indeed become a strange world. A new age will begin after this time.", "thefolafrancis": "So sorry for your loss.💗✨", "emeraldclaire_couture": "😭😭Awwn. Guess is same Aunt that I lost @chimamanda_adichie Am from Odigwe family in Nkwelle Village, Umunnachi, Dunukofia LGA, Anambra state. May her beautiful soul rest in peace.", "pharmnana": "Sorry about your loss. May God comfort your family", "chichi.thegoddess": "I’m so very sorry for your loss. She’s an angel over you now🕊", "gmhrealtyltd": "So sorry for the loss😢", "queenzozo1775": "May God rest her soul 🙏", "cartooneyes37": "You really hit the nail on the head. Totally how I’m feeling today. Thank you for making it okay x", "solapeoguntayo": "Thank you for this 💖", "myfavouritepieces": "Sorry for your loss", "i_am_dorkiesha": "So sorry for your loss. Wishing you love and light. And thank you for sharing this ❤️", "iam_alake": "I’m so sorry for your loss 💔", "cayleyguimaraes": "🙏🙏🙏🙏", "lilyladouce2000": "❤️❤️", "taymesan_\nVerified": "Verified", "thebukolaaa": "🤗🤗🤗🤗🤗", "pricelessconfection": "May her soul rest in peace and may the comfort you all in Jesus name,amen🙏", "thederricktopaz": "God is your strength dear 💪🏿 We pray for divine protection over your family. Sending you lots of love 💝💝💝", "mitchellxris": "I'm sorry for your loss", "tgurl_tolu": "Sending you love. As always ❤️", "bokantii": "So sorry for your loss", "purity_ezimmadu": "the world is undoubtedly in its horrible peek however it shall be well someday", "ameena_gold": "I am deeply sorry for your loss", "smashing_rika": "😍😍😍 Eziokwu ka ekwuru. Chukwu gbaa'gi ume.", "manenaoca": "Lo siento muchísimo, un abrazo♥️♥️", "molokwu_peter": "Condolences", "okerekechika": "❤️❤️❤️", "teddys_touch_beads": "This too shall pass... Sorry for your loss", "onecyrenus": "❤️", "cindylaure3": "My heartfelt condolences for the loss of your beloved Aunty, may God rest her soul in peace. Amen. And thanks for this soothing piece. I had waited, checking this page day after day to hear you say something to us about this situation. ❤️❤️❤️. I'm well relieved now. Thank you CNA.❤️❤️❤️", "junior_steps": "👏", "precious.ihuoma": "Condolences 🙏", "aweleotii": "❤️❤️", "martha_rrazi": "Sigh. Sorry for your loss ma'am.", "didimadee": "God will continue to shield us all in the hollow of his hands🙏", "denike_demuwa": "Love and light", "naghawon": "Wishing you love and better days ❤️❤️💕💕💕", "a.c.a.s.m": "🙏🏾🙏🏾🙏🏾💔💔💔", "verastic": "Oh, men, I am terribly sorry for your loss. This is a strange time we are in. How do people mourn?", "fils_proud": "I’m watching your speech about « The danger of a single story » You are inspiring", "priscabab": "❤️❤️", "_martha_bae": "❤️", "helenchineye": "Please, accept my condolences and thanks for sharing your light with us at this time❤", "florabenye": "So sorry for your loss🙏", "kamto.u": "Thank you ❤️", "ikenna.kalu.9277": "I have read, and re-read it over and over again whilst floating like a paper kite.conjuring up images here and there. You are still magical with your pen inspite the circumstances ma'am. This too shall soon be over. Accept my heartfelt condolences", "inspireasoul": "It is well with you 🙏🤗 I pray Gods spirit comfort you all at a time like this 😇", "jewdith.m": "My sincere condolence...may God comfort you all in a special way.", "fnwanne": "@chimamanda_adichie I hope you read this. I have been checking your page since this pandemic broke out to see that all is well with you. I remembered you lived in America and that worried me, the same way it worried me that my sister stays in Lagos where cases rise every now and then. To say I understand or we understand the paranoia you go through would be to tell a lie. Its not something that can be understood. I can't still understand how our world changed so drastically and doing the things that makes us humans, that mark our \"Nigerianess\" has become like mortal sin. Its sad looking out the window and not seeing people congregated, talking in loud whispers, laughing at God-knows-what. Its hard knowing that I prepared for second semester so bad and yet I'm stuck in my house, waiting, thinking if I'd ever resume school. Automatically, graduation for me has been pushed back and there are many times I feel like crying. And I don't even know the exact reason I'm crying. I don't know if \"staying strong\" matters now but its so necessary. I hope this passes soon. I hope we somehow return back to the lives we left, I hope your husband and daughter are safe all through. The Lord bless you and keep you. May he lift his light of countenance upon you and give you rest. (These words are from a song I love so much. They give me strength).", "xchibuike": "❤️", "lamimoyin": "Sorry for your loss, and thank you for these words ❤️", "she_regina": "Sorry for your loss", "oreadeokun": "❤️❤️❤️❤️", "otitomforo": "My condolences...sending warm prayers", "dfordarkoa": "💜", "tessa.kipping": "❤️", "afinom718": "May God bring you and your family peace in your time of grief.", "heisgilson": "Sorry for your loss nwanyi oma", "roserraluy": "Thanks for the words and the music. We hold breath with this world pandemia, we shall give breath to learn new ways to be together. 😍", "oh_geeeeeeee": "Love and light always", "yvesb19": "Love your post 😉", "kellefatnassi": "These are the reminders that we need. In the west, we overemphasize busyness as though it is tantamount to productivity. And as such, we never learned to grieve the big losses as any loss is unacceptable. I’m trying to remind myself on a daily basis that this is not normal, and if my husband is on the other side of the world across closed borders from me, and I wake up sad sometimes or cry myself to sleep, that I shouldn’t berate myself for not having the strength to finish the laundry. I have to tell myself that “this is what I’m doing today,” even if it is nothing. Especially if it is nothing. May God grant all of us peace and healing and I’m sorry for your loss.", "dayo_louis": "Wishing you Love and light Chimamanda", "kadijanaima": "I am sorry for your loss, truly.", "adiwewe": "So sorry for your loss.", "onazareolatt": "Love and Light to you and your family", "therealchatwiththelma": "Sending your family love from here❤️❤️❤️❤️", "simbuloc": "@auguscho read this", "nachoralista": "Please accept my condolences. May your aunt's soul rest in peace.", "sheisoly": "My condolences ma.", "gragra_warri": "Sending many love and light... This also will pass💜", "matanes.sarah": "Love your honesty! Sorry to hear about your aunt. The world has most definitely changed, it’s quite surreal at times. Stay safe ❤️", "ngasuma": "I am sorry for your loss. Here is a cheerful light read that may lift you from your angst https://bit.ly/3dW3UVN", "alice_akro": "Thank you for expressing what so many of us feel in such an impassioned way. Sending kindness and comfort your way. 🙏❤️", "chijiokemu": "🙌👍🙏", "chiamakaokonkwo888": "So sorry for your loss. May the almighty see us all through", "qeennlyn": "So sorry for your loss", "prince_adewealth": "Accept my condolences", "imskdunn": "I’m sorry for your family’s loss and for the current situation which is so ominous in your home. I don’t know you but have loved your writing. Sending you and the world prayers of grace.", "ladypollyn": "So sorry for your loss 🙏🏽", "tutu_blossom": "Condolences ma, thank you for this ❤️", "she.is.oluyemisi": "I love the honesty in this post. It says just how I feel. Hugs***", "dakoreea\nVerified": "Verified", "ohlannaya.bu.zikora": "Aunty Ngooooo......hugsss! Ndo!", "just_sinead": "Thank you for your always wonderful words. I am so very sorry for your loss. ❤️", "zizi.cn": "❤️❤️❤️", "classic_aoc": "We really need not to get worried? We should feed our heart with Positivity.", "nonisalma": "❤️❤️❤️❤️❤️", "florinereads": "Thank you for your words ❤️ Very sorry for your loss, when it is so sudden, it is incredibly hard to grasp. I finished Half of a yellow sun this week, and in a very weird way, it comforted me immensely, and helped with covid-anxiety. Thank you!", "elvirathelady": "So sorry for your loss...May her soul rest in peace ❤️", "kodiio": "Sorry for your loss ❤️ Praying for healing for the entire world", "alicejungclaus": "I’m sorry for your loss. I appreciated your post as it is a difficult time in so many ways. I am grateful for my chat with my Igbo father this evening. Stay well and positive.", "paulah.__": "❤️", "anukemnenye": "❤️❤️", "candicebrathwaite\nVerified": "Verified", "ugegbe_brosj": "This too shall pass Nne!", "jackiepomps": "Currently reading Poems, this one by Edna St.Vincent Millay. I shall die, but that is all that I shall do for Death. I hear him leading his horse out of the stall; I hear the clatter on the barn-floor. He is in haste; he has business in Cuba, business in the Balkans, many calls to make this morning. But I will not hold the bridle while he clinches the girth. And he may mount by hinmself: I will not give him a leg up. Though he flick my shoulders with his whip, I will not tell him which way the fox ran. With his hoof on my breast, I will not tell him where the black boy hides in the swamp. I shall die, but that is all that I shall do for Death; I am not on his pay-roll. I will not tell him the whereabout of my friends nor of my enemies either. Though he promise me much, I will not map him the route to any man's door. Am I a spy in the land of the living, that I should deliver men to Death? Brother, the password and the plans of our city are safe with me; never through me Shall you be overcome. 🙏", "ogeiheanacho": "Dear Chimamanda, so sorry to read about your loss. May God strengthen you and your family during this trying time. Lots of love ❤️", "samba_bordergalgo": "❤️❤️❤️❤️❤️", "lynda80": "Ndonu inugo.May her soul Rest in perfect peace Amen 🙏🙏. Your words are so soothing in this time of uncertainty. Daalu🙏", "sunmi_trinity": "I’m so grateful for your gift! Your expression, so vulnerable yet strong 🤍", "sue0513o": "💕💕💕", "jerre_jay": "Love and light ❤️", "amy.shiajames": "❤️❤️❤️", "i_lotanna_": "😢😢😢😢", "danielembambath": "it was so painfull.", "madeputter": "Thank you for this authentic and vulnerable and strong message. ✨🙏🏾❤️", "tosinger": "Thanks for this post I can surely relate and my condolences to you and your family 🙏🏾", "chime_gardens": "It's well with u sister. God will surely protect it husband, parents and children. Be rest assured that our God is supreme.", "faridahawa": "Sorry for your loss Queen, may God rest her soul 🙏🏽. Also, thank you for the advice, married to a Doctor and the anxiety gets agonisingly real.", "akusyoung1": "So sorry for your lost", "ngozi213": "It is well, we shall pull through it all by God's grace 😍", "_thechukwufumnanya": "Sending you all the love and light", "polishedfruit": "❤️❤️❤️", "nunub1972": "💚💛 hugs from Brazil", "estellesms": "Thank You for your sharing 🙏🏾", "jessfromthewoods": "Thank you so much for your encouraging words 💜", "meedahliaempire": "Sorry for your loss ma'am, this is a reminder that all we truly have is each other....live, love, laugh , forgive, pray , care and take each day at a time. Together we shall overcome.🙏", "miss_nwawe": "So sorry for your loss 💕💕", "ozi_charles": "❤️❤️❤️❤️❤️", "mswilks101": "🇨🇦 Thank you for your words of encouragement. I've never really had an issue with anxiety but the global pandemic has brought me to that place. I find myself grieving for everyone but I am encouraged that something good will come out of all this. I continue to give God thanks and praise for his grace and mercy.", "tadiwa_maboreke": "❤️❤️❤️", "toyincarew1": "My condolences on the loss of your aunt, may her soul rest in peace. Sending you and your family lots of love, my husband is in your shoes as everyday I'm out there helping with saving lives, he's with our children,be reassured that your husband like the rest of us, are putting our family first but doing what we can for those who need it right now, many blessings❤️❤️❤️", "zabor_ou_les_psaumes": "🔥", "jenniferwest_": "So sorry for your loss. Take heart 🙏", "wealthywande": "Peace and lightness of heart is what I pray for your household", "emmahchanda": "🙏🏽🙏🏽", "stellz_azom": "This is a truly powerful message😩❤️", "rahmaloves23": "🙏🙏🙏", "truekojo": "Sorry for your loss. And thanks for your thoughts. They're a gift. Take care 💛💛", "onlyamaka": "Stay safe ma", "tshellmichelle": "I love you, GB. I am so sorry for your loss. I am praying for you and IV, for your entire family, and for all of us. 🙏🏾❤", "ruthmorgan5555": "So sorry for your Auntie", "prriscy_": "Love you❤️", "acientandold": "❤️❤️ Ndo my sister 🙏. May aunty’s soul Rest In Peace.", "ogorufina": "May she rest in peace.", "titilolami__": "Thank you so much for sharing. Sending you lots of Love ♥️♥️♥️.", "seunfunmi_maria": "❤️❤️❤️❤️❤️", "varaidzo_martha": "❤️❤️❤️❤️❤️❤️", "stylinganddesigning": "Love you ❤️. Sending love and prayers ❤️", "danjoseph702": "My condolences!", "bnaph": "💞💞💞", "ni.za19": "❤️🙏", "haifever": "My deepest condolences for you loss. And endless thanks and gratitude for your beautiful words that ground us and remind us that our vulnerability is not a weakness especially during these challenging times x", "tega___": "❤️❤️", "sineadgleeson": "Stay well C, and so sorry for your loss. Am trying to think of the future and the places we’ll all go to. Hope it’s not too long before you’re back in Dublin. 💛", "feyikemmy_": "❤️❤️❤️❤️", "leenoy_m": "Like rereading Purple Hibiscus and Americanah for the 4th time ❤️", "iamadazzle": "Thank you .", "afro_bohemian": "Sorry for this period. Hang in there 🙌", "ojiugo_mark": "I ❤️u", "silk_chi": "Thank you so much, this gave me strength 😊", "sapa_limperatrice": "❤️", "deogracious_noah": "we have every ounce of energy keeping us. To view details that provides us relief. i join u in silence to pay our respect to the good spirits that were with us. I wish you too Positivity and truthful insights", "misszan": "💞", "fumiekeh": "Pls brace up ma'am! Some of us want you in high spirits. May God grant you the fortitude to bear the loss.", "byokpara": "Queen. 💕", "glamorouslyvegan": "💚🙏🏼", "planet.artivist": "Beautiful words as always. Sending love and prayers❤️", "nyawira_nguyo": "Sorry for your loss and thank you for the perspective.", "lolig_g": "This text feels like it came straight from the heart, as always! Thank you🌺. My condolences and much strength to you and yours🙏🏿", "gaelle_b_reloaded": "Sincere condoléances for your loss. Your words, as always, echo with many of us. Thank you🙏🏾. Sending prayers up for you and your family.", "neddi_clothing": "So sorry for your loss❣️❣️❣️", "iamkeletso_m": "❤️", "erikabanerji": "😍", "sharon.precious": "A sight for sore eyes 👑👑This is encouraging 💛", "christeljocktane": "So beautifully written as always. Sorry for the loss of your aunt. This must be so hard. May the sweet memory of her love fill you and your family with peace. And may God protect your husband as he goes and care for his patients. Sending you much love 💕@chimamanda_adichie", "b_omodon": "So sorry for your loss. Yeah, this whole pandemic thing is causes more than mild anxiety. It won't last forever, nothing ever does.", "c_abrona": "❤️❤️❤️", "thewritinglifeng": "Our condolences.", "virgicristipe": "No podemos salir de casa,para nada,solo los adultos para hacer compras.Los niños y niñas llevan encerrados desde el día 14 de marzo.Cuidaos mucho.", "jeannemougel": "Very sorry for your loss. Thank you for your wise and brave and beautiful words ❤️❤️❤️", "ladystellina23rd": "❤️🙏", "suave_dentist": "❤️❤️", "kayti__e": "😍#positivevibes", "lalenchi": "💖💖💖 Thank you for these wise words. My condolences to you and your family.", "queen_paulaa": "❤️", "r.rmlrhonda": "😞So sorry.", "chyokezie": "I can totally relate with over analyzing every little “symptom”. In our home, we have cut down TV time tremendously , we pray and talk a lot and I agree it’s a good time to catch up on reading. Try and keep it positive everyone and remember, every new day is a day closer to the end of this pestilence. Godspeed everyone.", "ceecmike": "God is indeed our last hope", "omakwentua": "👌", "ngozicole": "Sending you love 🙏🏾", "imajuris": "🤗🤗🤗🤗", "becca_oy": "Love and light ma", "ddeuxpommesparisny": "Be well. Sorry for your loss. Each loss seems even more painful during this strange and uncertain time.🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾", "ezinneakudo\nVerified": "Verified", "lizeokoh": "♥️", "ose_owhe": "Sorry for your loss", "caramel.top.inns": "❤️", "olabisiwisdom": "Condolences to you and your family Adichie", "vq3110": "😢", "hyacinthe.blue11": "❤️❤️❤️❤️🙌🏽🔥 Strength to you @chimamanda_adichie", "mopampam": "Thinking of you all sis 🙏🏾😘💔", "blackraspeberries16": "❤️❤️", "rejoice_chinecherem": "Sorry for your loss😢... Your message is a salve... We love you.", "native_lotus_ada": "🙏🏾", "the.omy": "Accept my heartfelt condolences. May her soul rest in peace, Amen.", "dr_pinesol": "May God give your family the fortitude to bear the loss of your aunt. 🙏🏽", "ebenezernyenwe": "So sorry for your loss 🙏🏾🙏🏾🙏🏾", "ogbenyealu_": "So sorry for your loss", "meejakess": "So sorry for your loss", "music_to_my_ears_13": "Very sad to loose someone dear in this period. Thank you so much for your wise words. Soon we will be able to dance again under the sun. 💐", "jideunooluchi2": "I am so sorry for your loss.", "the_renix": "Sending you love and light ❤️", "x_kwizit": "So sorry for your loss sis Chimamanda...May God rest her soul, amen !", "ro_se9667": "👍", "flin_adire": "Sorry for your loss sis. I pray God protects and bless your husband.", "royalkin25": "Sorry for your loss", "bantufro": "So sorry for your loss, so thankful for your openness and you sharing your vulnerability with us. You are greatly appreciated ✨🌸", "enioladunni": "May her soul find rest... And may you all find comfort. Ndo.", "koko_madu": "Peace and love...❤️❤️", "ngozinzegwu": "May her soul rest in peace", "lynn__da": "Thank you so much", "unique_dohdoh": "God help us. RIP", "chidi_do": "Your words come from a true place", "obii_nweze": "So sorry for your loss, stay safe Ma’am", "temi_lolaaa": "❤️❤️❤️", "roseline_mgbo": "😢💝💝💝💝💝God give you all the strength you need to bear this", "monica_mereghetti": "❤️", "ozorpatcy": "Sending you Gods strength 💕", "berniceudeogu": "Sorry for your loss. Sending you love and light during these times. ✨❤️", "sarahmonnie": "❤️", "sanzye": "Sorry for your loss, God protect your husband and family", "msamaka": "So sorry for your loss. May she rest in peace.", "sixdown_rachel": "💓", "thevictorchineke": "❤❤❤❤❤❤❤", "venta_oficial": "🙏🙏🙏", "nandidet": "Thank you for sharing", "chiomaredbutton": "So sorry for your loss. And thank you for this soothing piece.❤️❤️", "julielbrownwrites": "Sorry for your loss. Prayers to you and your family. 🙏🏽🙏🏽🙏🏽", "yakubupaul": "❤️❤️", "chi_browny33": "My condolences nwanne m. So sorry for your loss", "thelucyfair": "Madam, i deeply admire your work and your being, and I can only say that I pray and think of you and your loved ones. Strength and love", "veraroca": "Sorry or your loss and thank you for your encouraging words", "_the_velvet_hammer_": "🌹", "amandaxlima_": "❤️", "boitumeloseatle": "So sorry for you loss sisi❤️", "chiberry2000": "Sorry for your loss... this too will pass.❤️ Hope is what we have now..", "midemicheals": "So sorry for your loss and thank you for your words 💜💜", "jcurnoe": "❤️", "faventbeautyhaircare": "My condolences please.", "magdices": "Wish you all the love you desearve. Thank you for this sharing 🖤🌻", "kaosolu_chi": "❤️", "crocusgirl711": "My condolences. 💕", "nanimac": "Thank you for your words and I'm so deeply sorry for your loss💔", "chimasharon": "I'm deeply sorry for your loss❤", "ronaldthe7th": "So Sorry for your loss Nne ❤️", "fynamii": "Lots of love ❤️❤️", "lexoncapital": "May your Aunty’s soul rest in peace.", "bmk.xo": "Love you ❤️ my deepest condolences to your family", "the_lexiz": "🙌 sometimes I cry when I *hear your words", "funmi_okonta": "❤️❤️", "lmlnld": "❤️", "ironlady_victoria": "So sorry for your loss! You and your family are in my prayers!", "kaibeya_": "May your aunt's soul rest in perfect peace. Accept my deepest condolences to you and yours for your loss and pain in these unprecedented times @chimamanda_adichie. May God strengthen you, comfort you and keep you and yours safe. Xx Ada ❤️", "sarra.princess": "Good to read you. Always. Sending you and your family much love. ❤️❤️❤️", "amon_emmauel": "My condolences 🙏", "rutlandfarmsng": "So sorry about your aunt. When you think about the fact that she's is happier now without the pain and suffering, I hope you feel comforted ❤️", "les_affranchies": "Sending love ❤️", "__n.chinyere": "Sending love and light your way❤️❤️❤️", "fabchica15": "❤️", "chifuodiaka": "...and keep yours too. We shall overcome. This pandemic shall pass.", "stella.m.genevieve": "❤❤", "_alb3rt_k": "Take heart dear heart. Take heart. Thank you for the lovely message", "omosalewasmiles": "Immensely sorry for your loss ma’am and thank you for the kind admonishment.", "st.corine": "Thank you for the positivity.", "adaobiogudo": "May her soul and all the faithful departed rest in perfect peace", "badeoye": "I’m sorry Chimamanda. 💖💖💖", "grace_akuma": "I pray God continues to give you and family the strength throughout this trying period.", "donafernanda1": "Sorry for your loss. We must keep going. Stay strong, Chimamanda!", "katiacrisadv": "I'm sorry for your loss!", "theemarina": "So sorry for your loss ❤️ thank you for those wonderful words. I could not agree more.", "antaresdudiuk": "Tan hermosa @chimamanda_adichie siempre♥️", "thelastwomanstanding1": "I needed this kind of warmth all along... Thank you, Queen!", "spiffykiid": "💕💕💕💕💕💕 Praying for you, your husband, your daughter and your extended family", "nnedidede": "Love and light ❤", "nojiart": "So sorry for your loss", "ezichukwutochukwu": "My condolences, thanks for the encouraging words. Stay safe 💯🙏", "uniquely.exquisite.fabrics": "Sorry for your loss aunty.", "c.h.e_tah": "❤️", "isabelfonquerle": "😍 Magnifique", "_julibravo": "❤️💜💜💜", "jennymb67": "Thank you. This made me slow down and feel what I am feeling under all the work to protect, feed, know, work... thank u", "scribam": "Thank you. Fan of your Words.", "amayaathome": "I'm very sorry for your loss. 😍😍😍", "annef2000": "❤️", "cvfeinv": "my heart is with you and your family all the way here in Puerto Rico. Bless you, Chimamanda.", "_ayomiikun_": "Thank you for the soothing words and Sorry for your loss❤️", "astra_eersel": "Sorry for you loss and Thank you so much for these encouraging words🙏🏾🙏🏾💛💛", "leticiacunharocha": "Thank you 💜", "sashes.by.kikibenjamin": "Be comforted dear 🙏", "koryieh": "So sorry 🙏🏾", "phill1240": "❤️ ❤️ ❤️. My condolences, please.", "jenniferzaire": "❤️❤️❤️💔", "temidayox": "!!! 💐❤️", "chinonso.nzeh": "It will be okay", "nwosuvin": "@queen_vincent read babe", "laisalpi": "Sorry for your loss, my dear. Thank you for everything be well 🌾", "kabzayums": "Thank you Chimamanda! You have so much wisdom!", "jaycilla_": "Sending hugs 💕", "emmahmachokoto": "You have reminded me why I love you so much. Thank you for this!", "omalichaone": "It’s been terrible💔💔💔. Such a beautiful soul. May she continue to Rest In Peace Amen!", "thedivinejay": "Chi🌹", "___jacklyn.nosagie": "😢❤️", "nenye_sage": "❤️", "blossomtrends": "These lines were so soothing! Thanks always.", "garni71": "❤️❤️❤️❤️", "efeu.eva": "Thank you, your thoughts in combination with my favourite Bill Withers song while reading your extraordinary novel Half of a yellow sun help me through this. ❤️", "shadesncolours": "❤️❤️❤️❤️❤️I wish you strength and grace through this time. May the lord keep your household", "ugomaamaa": "💗", "yomidudu": "Sorry for your loss and thank you for putting everything happening now together in such an encouraging way. Thank you for being open and honest and letting me know it’s okay to feel all of these emotions. Love and light 💕💕", "ola_opara": "Sending you and your family love and hope @chimamanda_adichie", "oliveira_nubiade": "😢 Sincere condolences for your aunt's passing. Thank you for sharing such a moving text. Keep well. ❤️ Oh! My 15-year-old boy has just read and watched your \"The danger of the single story\" and is blown away by your words and poetry! Thank you so much! ❤️", "mandapanda_24": "@chimamanda_adichie I am sincerely sorry to hear about your aunt’s passing. Thank you for sharing these words, and I hope the memories of cherished moments with your aunt and the legacy of her life will comfort you over time. 🤗", "stefanie2u": "💕✨", "theconfidentmillenial": "These times are so uncertain, so unpredictable . We need to cling to the few vestiges of normalcy that we can manage each day, each week, each month. Take heart Chimamanda, and to everyone else reading this, take a deep breath and count to five then let’s continue to press forward!", "anosime": "May God comfort you and your family. So sorry for your loss.", "ife_nkili": "❤️❤️❤️", "chisom_ogbu": "🤍💙", "riccardowest1": "pls be safe ❤️", "ednino_the_great": "❤️❤️❤️ sending love, light and comfort.", "nifemibrown": "❤", "oma_anita__": "❤️", "adanmaezenekwe": "Jide Obi gi aka..This too shall pass.", "nelo_belle": "Our God will never fail.", "twinklestars_collection": "So sorry for your loss. 💔", "ryanlfuller": "You don't know me but I am wishing you good health, positivity and balance💪🏽💞 we can do this.", "adesuwaaletor": "💖💖💖", "jilldharing": "@laura_amartins @cbeatrizpaulo ❤️❤️ Thank you Chimamanda", "larapoppy_": "So sorry for your loss 💔", "tobechukss": "🖤🖤", "monalooisa": "So sorry for your loss you and your family🙏🏿😭 sending you prayers.", "ug_damian": "Sorry for your loss. And continue to keep safe❤️❤️❤️.", "nkemomalicha": "❤️❤️❤️❤️❤️ We will pull through this", "uouray": "Thank you! You’re an inspiration! I’m sending you love", "stephanie__ok": "Thank you for your words of encouragement, may God grant you and your family the strength to go through this. ❤️", "__ajoke": "❤️❤️❤️", "carlaqueteimporta103": "May your auntie rest in peace.", "busoladakolo\nVerified": "Verified", "chy_ammakahh": "Ogadimma", "frankugo_": "Thank you my queen. Sending love to you and yours as well 💙", "okeke_chinelo_precious": "Sorry for your loss", "iammaveo": "Take heart ma", "rfourlagawo": "❤️🙏🏿", "artemisfowl95": "Rest In Peace 🙏♥️", "ningbe4u": "Thank you for one of the most sincere, honest and insightful statements on the true state of the minds and hearts of most people at this time. My condolences on the loss of your Aunt, may she rest in perfect peace. May the good Lord Almighty cast His protection over your hubby as he goes out daily to help others in the fight against the dreaded virus. May the pandemic passover you and your household as in the Biblical days when all marked with the sacred blood were preserved. Amen.", "joycegoke": "Sorry for your loss, may her soul rest in peace, 🙏🙏 thank you Sir to your husband and thanks for the encouraging words God bless🙏🙏", "megrobertz": "❤️", "ellenkconnell": "Thank you for this message and for all of your books, which have inspired, educated, and touched me 🙏 sending you condolences for the loss of your aunt and wishing you and the rest of your family health and solace in these harrowing times.", "nestine_bebe": "🤲🏼❤", "inchem": "Sorry for your loss ❤️", "zitakelechy": "A positive state of mind heals", "nedunna1": "It well 🙏🏿", "_olaedo": "So sorry for your loss 💔", "monica_soret": "@chimamanda_adichie you’re a incredible woman, I really love to read your books and all words that you write. Sorry for your loss 🙏🏼", "hotgirlmide_": "sending you plenty of love and strength, mama. 💕💕💕", "nkmorrissey": "I’ve been grappling with how to put into words how and what I’ve been doing to make sense of these last few weeks. You’ve summed it very eloquently-I may have to borrow your reassuring words ☺️. Condolences to you and your family 🙏", "_mzerikar": "Sorry for your loss. Stay strong🖤", "artistreflections": "The ravening clouds shall not be long victorious. They shall not long possess the sky. Walt Whitman.", "msntombenhle": "Love to you and the fam sis❤️", "nicoly_aalmeidaa": "❤️❤️❤️", "cynthia_aninwezi": "My sympathy", "chy_vander": "Awwww...it shall end in praise...RIP to your aunt", "9jawoman": "Sorry for your loss Sis. I wish you strength and courage this period and your husband is a hero! We appreciate him and all the health care workers out there at this time. ❤️❤️", "thewumanbrand": "May your aunt's soul rest in peace and may God grant your family the fortitude to bear this loss. Our prayer is that God heals the world and keep us all safe in these times. Believe in your name; Chi'm amanda.", "preyor_tarel": "❤️", "mannymylord": "Love and light ❤️", "sandyscholar": "Sending u lots of love and comfort. Take hrt 4 ur lost", "_aivii": "♥️", "chib_the_ace": "Sorry for your loss 🙏🏾", "rejoice_o": "So sorry for you loss❤️. And best wishes to your husband", "ivy_ikpeme_mbakwem": "...keep keeping safe, keep the positivity overflowing for you and yours, and everyone grieving (may your aunt rest peacefully on)", "alexanderokafor": "Powerful words as always. Humanity will surely triumph over this. Thank you Nnem. Chịnẹkẹ gba gị na dị gị ụme.", "officialtodah": "💖💖💖💖", "kanengdakwak": "❤️❤️❤️❤️", "chuyindmx": "I'm sorry for your the loss of your aunt. It is a tough and scary time in the world, indeed... but it is faith and hope that will help us go through. It is great human beings like you, @chimamanda_adichie , who throw light on our ways! Like the great music that lifts up our hearts, the words of writers like you enlighten our minds and cheer up our spirits. Thank you for all you do!!!!!! In love literature and you are a big inspiration for me. Blessings and best wishes to you and yours!!!!! Love and cheers from Mexico.", "fyyzyy": "Sorry for your loss ❤️", "yolandambonu": "Sending you love and light. May the lord protect you and yours💚💚", "gigichiny": "May your aunt’s soul rest in perfect peace 🙏", "chinelo.eneh": "Sorry for your loss.💔", "alex_degreat": "Take heart Ma. Rip to the dead", "_4larkeh": "🙏🏽🙏🏽🙏🏽🙏🏽", "whereintheworldisngozi": "❤️❤️❤️", "tani.soneye": "Thank you, Chimamanda ❤️🙏🏽", "the_kilson": "❤️", "leavemebe05": "💕🙏", "ifedioku": "💜💜💜", "moyonnaissseee": "🙏🏾❤️", "mialowden": "Sorry for your loss. Thank you for your writing. 💛", "morosaz": "You are so necessary @chimamanda_adichie thank you for your (always) amazing words. I'll pray for you and your beloved ones. 💙hope", "cath_buteau": "❤️❤️❤️", "iamrabiatu01": "🙏🙏", "adinaova": "Sending love.", "cassie_wytt": "❤️❤️. My sincere Condolences . God will help us all. Amen.", "alixamelo": "🙏💙"}