{"vivianoluchi206": "My love. 😘😘😘", "ojumanchi": "Amazing", "sandraprofile": "Lol, I got ready to listen...", "medically_chi": "Yass!", "shack_ogbonna_osinachi": "A gift to the Igbo Race. Keep shining", "immuzscarpato": "Nooooooooo i missed you 😩😩", "she_sparks": "Fave ❤️", "sonia__offcial": "My mentor", "thekayewoman": "❤️❤️😊", "fonduekebab": "you are such an inspiration! I devoured your books and felt a void when the last page if the last one turned!", "san53433": "Thank you for making us Nigerians proud", "okaforromanus_ceo_rommy_boss": "Ada anyi ji eme onu, keep the flag flying my dear", "macdavidworld": "If I no follow you wetin I gain", "chriss_missj": "Can't believe I missed this😢. Do you have any other programs in Berlin?", "mau_maz_67": "Well travelled super woman 👏👏👏👏👏", "vomzeph": "Queen", "iamchike.chike": "dear daddy,it hurts a lot because our heart are naturally connected.it's been awhile daddy and hope you know your absence has taken the stars away from our night and has taken the sun away from our day. daddy wherever you are please remember me , daddy wherever you are please remember us .daddy To die & part is less evil but to part and live is the toment,our heart presents you a flower for the unyielding love towards mommy . It has been night at noon & noon at night since you gone but we smile as the tought of you inspires our dreams with a clear thinking . the world has wondered how our suppose tears becomes a smile and we say thank you for your continuing love. Today we salute heavens for the sunrise you meant to each of us . Daddy, I hope you still our good friend and we hope you still smile with the souls around you . Dear daddy, can we together in one voice, say I love you as you rest in the bosom of almighty , Ameeen ..Ameeen", "mili.ane": "@renaa_cheena ❤️😍", "chiamakacalistar": "My role model", "ana_virginia_rocha": "@man_ro_ri", "jennieify_ohakamnu": "👍👍👍👍", "eberechi_emmanuel_": "Love you Mama", "stevewilifrid": "Continuez à nous inspirer", "evelyn.michael.9081": "👑👑❤️❤️"}