{"juliastrapp": "I love it. I’m working from a tiny folding TV dinner table in solidarity 🙌🏻", "sophie_fasho": "I have the same book and its been laying on my dresser for almost a year. I'm taking this as a sign that its time to read it", "leaningtoweroffabric": "I thought the scroll noticed in an earlier pic) was for your prolific writing with a feather ink pin! 😍😂❤️ 👸", "tpssteph": "i love this!", "proud_virgin": "ur an influencer, i just bought this desk today bc of this post 🤩", "emmakatewilson_art": "Love it!", "sunshine_rainbows_adela": "I love this ❤️", "salmonbeige": "very much considering buying this and painting the blue parts olive green 😮", "hannahhshelton": "Omg this is too good", "girloftheearth": "Much better than leaving the house ! Stay safe ❤❤ xx", "a_d7850": "Lovin it", "leannemaksin": "I hope you enjoy Less! I loved it! And that’s a great little setup. 🙌🏻", "cecile.deguigne": "Love your office, looks very cozy 🖤", "juliezeeelle": "It’s pretty cute", "missacouch": "I really love this tho", "jessica_cucchiaro": "@mylanhayes", "yolheito": "I thought it was paper towels 😂", "swiftlykels": "The photo of this in the newsletter today inspired me to improvise my own lil desk in the space next to my bed - table leaf + stools + stacks of books = unexpected magic. Thanks for the inspiration!", "vensette\nVerified": "Verified", "five17air": "#folliagevibes😻", "hannahpapernick": "Comfort level 1-10 I need a tiny desk and chair", "etymologyjewelry": "I feel like the craft paper could come in handy tho 🤔🤔🤔", "cin_elli": "I love it!! Also, Less is a brilliant book.", "livcarrollclough": "@mimiiiiiiiiiiiiii", "gdancepants": "❤️❤️❤️", "_longislandmedium": "where is she from 🥺💜", "maria_bikou": "Thats beautiful💙", "minimonette": "I wish my desk had a craft paper roll included!", "uhkiea": "the craft paper roll woulda had me sold", "emilyedwards": "Your poor butt!!!", "kristiiicoop": "But now you already have your nieces next birthday gift? 😂👏", "emmyp007": "@halemur as a fellow cat owner who wants beautiful plants that aren’t toxic when my cats inevitably eat them....what kind of plants do you have?! They are gorgeous and I’m jealous.", "rushteen": "I peeped the craft paper and wondered if that was a new desk! It wasn't there in your apartment tour😅 the desk is totally awesome! I've been searching for the perfect desk for awhile, yours is on the better part of the list!", "malloryjacqueline": "I’ve searched Wayfair high and low and can’t find this anywhere! I found a corner desk version though. 💙", "jamee.rowe": "It’s literally perfect", "kmsmithh": "Um hi excuse me what is this desk called I love", "dreasmyth": "I love it", "bobmolly": "Wait but I love it. Where is this from?", "krista_anna": "This desk is SO GOOD", "femmmmmm": "I need this", "alexa_dimaio": "I love this desk!! Where from!??", "kaylanfw": "real question: is it too late to rebrand and convert your entire professional identity to Tiny Scholar Ltd???", "billian28": "I set up a folding table so you’re doing pretty good. 🤩", "elizabethshaner": "Less is a great book!!", "madelinehowever": "As a tall human im not sure my legs would fit under this but also this is so good 😭🙌", "kaylamariekirby": "@ophelan me, at my impulse purchased kids IKEA desk in my living room right now haha", "le.complice": "v v cute", "machaley": "It’s perfect!", "faye_fei177": "I have the same book!!! What a coincidence!", "tshrubz": "Where is your quilt from? I love it", "nadine.wendorff": "hmm it’s actually sure cute and has character 🤷🏼‍♀️ niiice", "bonjourcherie": "So much more practical than the mini pony I purchased 🥴", "boullande": "I love this !", "michelafg": "THIS IS SO CUTE", "jacmix": "this would actually be a great desk for an architect (roll of trace paper)!", "a.j.choi": "What may have been a panic purchase can now be recategorized as a gift to all of the younger parts of you. That it also happens to fit just means bonus points. :-) The therapy is just flowing out of me, apparently. 🤪", "torticular": "@amylisacooper @wolfhalley living for this lol", "mister_matt_abbott": "As someone currently nursing a sore back...you need a better chair.", "xteenadc": "Also Less 👌👌", "navel._": "Crafting is life 😁!", "adriennemauro": "How’re you feeling about Less? That was the last book I got from the library before they closed.", "ttatianamelo": "😂😂❤️", "laurabeatrice_herman": "Ah, Arthur Less 💖💞", "annathropology": "Honestly amazing", "gracemurray": "Homggg 😍😍😍", "audreygut": "Tiny Scholar 👌", "emmawraychance": "This is actually the dream desk?", "throwyou": "I panic bought a table the first week WFH and promptly returned it 2 weeks later🤦🏻‍♀️didn’t even unpack it... and that’s me trying to limit useless purchases", "laurelperri": "Less is an amazing book!", "evaobrian": "Your rainbow glasses ❤️❤️ Where can I get them?", "victoria_dunn_1": "🤣", "shirin_sharma": "AMAZING! 💛💛💛💛", "nastyamozgovaya": "this is such a great idea, Haley!!", "caityydid": "I loved Less!! Read earlier this year. The exact kind of sweet escapism I needed in These Times ❤️", "m.sea_music": "💞💞💞 Excellent", "kirsty__watling": "This is so vital! Kudos on the plants too", "ladyhaidet": "I love this! Where did you get it?", "crebbcreativeco": "😂👏", "zsofianemes": "I love this desk setup so much, and desparately need a solution for home office! @halemur could you share the product name for this? I can’t seem to find it on Wayfair! 💕", "attybladorny": "But wait I actually want that ! Do u mind sending the link. ?", "rindaromney": "I was going to ask where the desk was from because I want it too. Need a little brightness and color right now", "thirty_laundry": "This is AMAZING. I would have bought one too by now but no furniture will ship here😭😭😭", "__primafacie": "😻It’s SO good 🙀✨💖", "hey_kellyj": "Did you read Less yet?? It’s amazing 🙌🏻", "balancebymolly": "Loved that book LESS! It’s so freaking good 🙌🏼"}