{"daniellerinaldi": "As a recent convert myself, I insist you try the GT’s adaptogen tea. It’s kombucha-adjacent, the puer-eh root flavor tastes JUST like root beer, and I’ve never felt more strongly about a beverage.", "emigraceperry": "try @whalebirdkombucha - LITERALLY THE BEST YOU WILL EVER TASTE", "caitrinbogart": "fav flavor", "queenmaryblair": "🙄", "gailmullligan": "Pink lady apple 🤝", "torimuser": "you are so cute 😍", "therealphoebe": "You gotta try rowdy mermaid if you're out in CO! seriously the most delicious. Happy leaf is also 🌟🌟🌟", "missybeee": "Oh ya, it’s the best! People hate me", "anamlage": "@sofiapassadouro nós", "dashofairy": "@westbourne celery kombucha in your future", "menaljham": "I can’t stop talking about being sober curious and drinking kombucha instead of alcohol. I am super annoying there days", "jpbolles": "Lol", "leahrush7": "❤️", "modhemia": "Haha that’s my fav brand 💯", "thesunislit": "So did my mom so you're in good company 😂", "imaginalrealms": "It's like when I finally got a cell phone ten years after everyone else..", "janan_1001": "Honestly? I really don’t like the taste... people tell me it’s great for digestion but either it tastes just like lemonade - and then I have #bionade or it is just bitter and bahhh - take #kefir for digestion... or rather eat some sauerkraut and stick to drinks I like... 😊", "kaylanfw": "Theyve been waiting for you", "funstyled": "Its amazing stuff! And I swear it kept me from getting viruses over the winter!", "moletteando": "Could be worse. Could be crossfit", "amylynnebennett": "Theeee best combo!! 💓😍", "helloelisez": "I love kombucha it’s so good!", "plantlab.hn": "🙋🏼‍♀️", "creadid": "Welcome to the party...don’t worry, it’s still ragin’!", "jonimitchellsbigtoe": "humm blueberry lime is divine🤠", "peimanraf\nVerified": "Verified", "kimmyjean_": "Is it worse when it’s both!? Btw Haley the jalapeño kombucha by them is soooo good. Also some bars serve kombucha and I believe is an excellent social beverage haha.", "wyatt__p": "Wait till you get your first scoby. I recommend finding one from a friends’ grandmothers witch-doctor but amazon works, too.", "rhiarhia": "If you ever want to try making your own, it’s easy! I’ll mail you a SCOBY and instructions 🧪🧪", "baoshea": "Did you invent it?", "sustaininglife": "It’s. Magic.", "caelit90": "Same with me and IPA", "maddie.blocker": "wow same", "quackducky": "Brew Dr and Happy Mountain brands in Portland, OR are so good!! I can’t wait to read all the kombucha articles on MR", "graceannrichardson": "@katelynfinlay need to get back on the bucha train", "brigidelaney": "Lol welcome! This is my go-to flavor", "amalielikefamily": "Okay but like look at the labels pls", "lauban": "Stop talking about it 😡", "malloryrice": "wow I am NOT looking forward to ranking our favorite brands and flavors in the very near future", "leandramcohen\nVerified": "Verified", "dangergarrett": "And posting about it", "zilnif": "Health Ade was recently bought by Coke, I’m sad because this will likely make them go toward a more fast tracked “kombucha.” I stick with GT’s or local makers", "yellowcrownd": "GTs is a good brand too! Typically cheaper than the others. Their Cayennade f*cks me up but I love it", "amymacca": "@anna_mcnamara this is me but about matcha 🍵", "sznff": "Wait till you’ll start brewing it yourself! ✨", "sam_sonnier": "Get some @yesfolk it’s ✨✨✨✨"}