{"h_eil_z": "Happy birthday!!🎉", "lissy_m": "I love this so much", "barbbq12": "Happy birthday Haley! Yo think I knew you when...", "noworwhenever": "Wow, I turned 30 few days ago, and it’s crazy how I feel exactly the same in so many ways! Happy birthday! Our 30s are going to be amazing! ❤️👍🏻🎉", "wolf_bug": "Well said!", "personalcheesus": "Happy birthday to my favourite editor and my absolute hero! ❤️", "erinkmayer": "Happy birthday!!!", "instaudgram": "happy happy happy birthday !!!!", "kaylanfw": "Happy belated, Haley! 💕💖", "dirtyfunkytunes": "My favorite caption artist strikes again. Happiest of late birthday wishes to you, you're one of the reasons I continue opening this app and I thank you for your honesty and luminance. I love getting older, too. It's my favorite. HBD!!!", "oohlalau": "🙌🏼💫✨👏🏼〰️〰️☁️", "emilyscott6": "Happy birthday @halemur 🎊🎊 I turned 30 in January and I was the same - not nervous at all, just so bloody ready to be rid of my twenties! My friends now think I’ll have a breakdown at 35... 😂😂", "marleighculver": "Happy birthday 💕", "shexfixingherhair": "Happy Birthday Haley!!!! ✨🤭❤️ I totally get that thing about getting older , the twenties r a mess 💥 hahaha I send u a big HUG ✨ keep writing and inspiring with ur words , i'm happy that I find your instagram 💯 maybe one day I'll go to NY & I hope to find u over there 🙌🏻", "mollywolfwolf": "Happy birthday to the coolest and inspiring more-than-one bag influencer! Wishing you a sophisticated and a charmed 30✨", "misscarleyp": "Happy birthday you are the best!", "lauraquicenosoto": "Welcome!", "rachelbickelman": "happy birthday you beautiful soul!!! love your work and personality so much :)))", "shoppingcarts": "HBD bday neighbor!! Love seeing all fellow Leos come into their light this month 🌞⚡️💫", "journaldejordane": "What a nice reflective and positive text, happy birthday Haley!", "curated.erikaastrid": "Happy Birthday 🔥🎉🎉", "lexitoribio": "This caption has me feeling seEEEn though I don’t have older siblings. Also about to start over in New York at 27, but also looking forward to seeing 30. Hope it’s as shiny as it looks on u 💛", "yogab_ba": "this caption is why I need u to write a book", "handsomejoie": "congrats, mate✨! that’s beautiful. Happy belated", "michelafg": "HBD 👏🏽👏🏽👏🏽", "gilesandbrother": "Happy birthday 🎈🎉🎁", "melbduran": "happy birthday Haley 🥳🥳🥳", "sleeplessfry": "Happy birthday Haley! 🌟", "judyjewellerywarehouse": "Actually I'm turning 30 by the end of the year... Kind of going through crisis now. Keep asking myself what i have been doing with my life. Still alone and single...", "karaninaleigh": "You’re the best!", "jamaicawinship": "Happy birthday! Enjoy every minute of every day!", "shombeemed": "Happy bday! Yay for 30! 🍷🎂💜💜", "etymologyjewelry": "Happy birthday 🎉🎉🎉🎉", "arielzeena": "Happy birthday!", "bee_schiff": "Happy Birthday!!! As a girl who is knocking on 40 (I turn 38 in a few weeks), I can safely tell you that it just keeps getting better. Hope you had a great day celebrating!", "jenny_and_mones": "I wouldn’t look at it as patronising to my former self as I fully recognise that I had lessons to learnt and hadn’t my younger self dealt with them in the way she did, I wouldn’t be here now 🤷🏼‍♀️", "a.j.choi": "Happy 30th! Hope it’s chill, enlightening, easy, enjoyable, and FUN. Welcome to the next decade!", "katherpiller": "I’m right behind you in 6 months! Have an amazing day ❤️", "diamondjuls": "Happy birthday girl. Things are much better this side of the hill. Welcome!", "gwendomouse777": "Happy birthday!", "nina.hueppi": "Beeing in your thirties is just amazing - I never felt more comfortable with myself. It feels like you finally have arrived. Go and get you everything you want!", "isabelladeguzman": "happy birthday!", "angie.thomps": "Come on in, the water’s fine", "adhandmadeshoes": "🔥🔥Happy birthday..", "levartiofficial": "Happy birthday 👏👏👏", "merricat_blackwood": "Hey birthday twin. I turned 44 today. It just keeps getting better 🤩", "_alenemarie": "Happy birthday!!!!! 💕💖", "svitlaya_gs": "adore this look 🌸", "bradleyssf": "@aaronjohnfletcher nice perspective", "nygrl416": "HBD!", "arthuranddaughters": "30's are THE BEST!!! Happy birthday!!!", "quethaal": "Happy birthday, Hay-Leemur!!🎉 (I recently heard the When I Grow Up podcast with your interview😊) I love your articles and I'm looking forward to read about your 30year old wisdom💙", "3dho": "Hbd Hales! Welcome to the best decade! 🎉🎈🎀👵🏻", "kbknapp": "Happy birthday! And also you have so.much.time. Seems like you have over achieved already - take a sex to reflect and give yourself some major 🙌🙌🙌.", "lupa_bags": "Happy birthday lady! Welcome to the best decade yet", "lori_e_chang": "AND you look cute! Enjoy this sweet spot in life.", "offelia": "❤️", "nadinetonn": "Happy 30 Haley! The best is yet to come!! 😎🍊🌞", "pawlickk": "as always, you have the perfect words for any occasion. happy birthday. wishing you a lovely, celebratory day! 🌟", "haayymuriel": "NYC and the fashion industry is better with you in it ⭐️✨ HBD Haley! 🎂", "michelleby": "Super beautifully said @halemur. You verbalized what has been hard to put into words about turning 30. It’s some strange badge of honor. I bought myself a birthday card when I turned 30 that said the number “30” on it and put it on my wall. I was strangely proud. 😂 Thanks for putting words to these weird emotionally elusive milestones.", "gyanyankovich": "HALEY. How many times can I talk to you about your birthday today? I am shooting for at least 30!!!", "gotham_wellness\nVerified": "Verified", "annagolkayepez": "Happy birthday!! Love the birthday look ✨", "storiesfromblog": "How beautifully put. Happy birthday. X", "sorachel": "nailed that youngest sibling feeling 👏🏼 happy birthday!", "mboyks": "You are a creative inspiration and cute as a button - making 30 look exciting for all of us x", "thominique": "This caption is deep and hilarious and i salute you (and wish you happy bday. 30 is where it all begins baby)", "rosemarinetextiles": "Happy birthday 💗💗💗💗💗", "thisisbeeswhirled": "Happy happy born day! Thanks for all the fun and awesome content. We all appreciate it very much. Ps more bug content plz! 😬🙏🏽🥳💛🎂🥂🎁🎉🎈", "desertmannequin\nVerified": "Verified", "nastyamozgovaya": "thank you thank you for sharing these thoughts! and HAPPY BIRTHDAY to you, Haley 🕊", "eclate_jewels": "Happy birthday!!!", "susiecomptonu": "Fellow youngest sibling here, identifying hard with all of this 😂 happy birthday!! 🎈", "missannieyo": "I totally get it. I’m 34, but look much younger. I hate it when people think I’m in my 20s. It’s so silly 🤷‍♀️", "yelyeah": "Happy birthday!!! Looking forward to seeing you in a couple weeks 💕", "esby_apparel": "happy birthday!! i’m confident you’ll more than love your 30’s ✨✨✨", "melindyloaf": "Happy birthday and thanks for your relatable writing contributions!!! I turned 30 last year and it felt so great. So great that I am now a little worried to move onto 31, since I’ve identified so much as a 30 year old. It’s really funny and weird for sure!", "essentiallyann": "Happy birthday 🎉🎉🎉!", "hey_aine": "Happy birthday!! Great bday outfit 🔥❤️❤️❤️", "drivingmsdupsie": "Happy birthday Haley! Beautifully put, as usual. ✨", "hannahoatman": "I love you and I didn’t know we had the same birthday ❤️", "ckchang": "Happy birthday and your shirt is everything 💯", "g_dub_ya": "🎉🎉", "the_qi_": "Cute! And happy birthday! 🎂🎈 🌸", "julielove242": "Happy Birthday 🖤!!!", "basialcummings": "❤️🤸🏼‍♀️❤️", "czuperska": "@phoebejanehurst @rach_ps 💕", "esteychen": "@jasmineqzou this", "_deebear": "❤️❤️❤️❤️❤️❤️", "hannahroserose": "Happy birthday Haley!", "kaylamariekirby": "happy birthday!!! you’ve inspired me to fall in love with writing again, while also helping me relish in the beauty of aging. can’t wait to see what this new decade brings you 🎈", "minivix": "Happy birthday!", "omgnikkic": "Happy birthday 👼!", "mariahhthatsme": "30 and flirty and thriving", "uhkiea": "happiest solar return!!!! welcome to the dirty 30!", "susanbenear": "Happy birthday!!! 🎉 This caption is absolute perfection. It makes me feel so happy for you and also feel less anxious about only having a few years left in my twenties. Hope you can find some enjoyment in celebrating another trip around the sun, whatever that looks like for you! 💕", "thecompany_ofstrangers": "ha, i literally thought this blouse was a filter. happy birthday! ✨", "louisaclayden": "Happy birthday xxx", "emmajaneclark": "Happy birthday @halemur ❤️", "skipperk.ca": "🤣 “...Undue credit for the passive achievement that is being alive.” 🤣 HBD! every decade is better than the last 💖", "kule\nVerified": "Verified", "christelmichelle": "Happy birthday dearest 💗", "madelinmattli": "Wow you just made me wish I was turning 30! Happy bday🥳", "alysiaalex": "Happy Birthday!! ❤️", "verymarygray": "Love the “knowing head shake that’s patronizing to my former self.” Happy birthday!", "eiffeltyler\nVerified": "Verified", "elenarobinn": "I loved every second of turning thirty. I felt a stronger confidence righ away and there hasnt been a turning back. It was 10 years ago 😅😜congratulations! 😘", "victoriasavkaart": "And you're showing off your teeth!", "shannnonlawrence": "Happy birthday Haley!", "carlijncc": "Amen to that! Felt the same. Also the youngest of the family! Happy Birthday! 🎈", "moniquevanni": "You’re just getting started. Things get real good at 40....", "knittyknittybangbang53": "Happy birthday to the new old you!", "beccimelson": "The last month before I turned 30 felt like it crawled by. So so sooo much introspection and cycling through the past to make room for the future. Hooray for our 30s!!! 💕💕", "megnesmith": "Happy birthday you wonderful human. I’ve always thought you were very old and wise, if that helps.", "gdancepants": "AWESOME! I was pumped to turn 30....AND 40!! Cheers to you and to being ALIVE!💥", "wendydemambro": "Bday twins! Happy Birthday! 🎈", "aliciainthesunset": "Haley - i’m so excited for you!! I’ve been following you since you started at MR and have strangely felt like we have had parallel lives. SF raised/ lived, worked in HR, I thought about applying to MR right around the time that you did - never ended up doing it though! Decided NYC was not for me so the email is just sitting in my drafts for posterity :) and then started at a lifestyle brand that let’s me surf during my work breaks (oh, california). I’ve always really resonated with the stories you have told and the thoughts you have expressed. Or, maybe we are just two white girls that come from a similar background and i’m reaching here haha. At any rate, very stoked to keep following along and reading your stories. I’ve thoroughly enjoyed it all so far so I don’t see myself falling off the bandwagon anytime soon! Best of luck🧞‍♀️and Happy Birthday!", "livlapin": "happy birthday haley! 🥳", "melany.wlm": "Again, happy birthdayyyy Haley !! 💜", "teresacruzburillo": "Passive achievement 🌷", "j_kranz": "happy thirty!!! 🧶🐈🌟", "clarecullinan": "happy bird day !!!!", "s.raha___": "Happy birthday to one of my favorite people @halemur 🎈 I hope you find contentment in everything you do and seek!!", "madisonehaley": "happy birthday!!!!!", "harlingross\nVerified": "Verified", "noelledaily": "Everything you said !!!!! I'll be 30 in December and you are speaking my exact thoughts 💖🌟💯🌈 hbd internet friend! ✨", "dudewhereskara": "Happy birthday Haley! Hope you’re surrounded by all things you love today!", "lydiaumlauf": "I am also the youngest (by far) of my siblings and have a similar situation and thoughts on being always the youngest person, referring to myself as a twerp, etc., and most definitely also have a complex about it also...so thank you for this post! Nice to know there are others who share the weird youth problem. 💕", "thedesignstudiohawarden": "Gorgeous 😍😍😍🖤🖤happy birthday!", "htxtra": "HAPPY BIRTHDAY HALEY! You are the greatest and I hope you have a wonderful 30 full of bucket hats and Bug hugs!", "ingalena_": "Happy 30! Get ready for the best chapter 🤗🥳", "gretattack": "30 is the best. REALLY ✨", "hay_jaray": "Happy birthday Haley! I'm amazed by your ability to express your inner thoughts in such an insightful way. I hope you have a wonderful birthday! 💗", "rachstarrett": "Happy birthday!! Big bday milestone 30 and after definitely give way to a wrestling with oneself, and a feeling of wow life is crazy and getting older is crazier and the subsequent “who am I” questions. I was busy nursing a 1 month old baby w no sleep when I turned 30 so 35 has hit me like a tractor trailer. 🤯😳🧐 Reinventing my style, the way I spend my time, my reactions/or lack there of, getting rid of possessions that just take up space w no purpose or beauty, etc. Getting older is pretty rad.", "mercedesayalaa": "happy birthday ❤️", "l.m.h": "hbd 🎈🎂🎈", "tkees\nVerified": "Verified", "m_rojas9": "Happy birthday Haley! 💖", "alilabelle": "happy birthday @halemur! from someone (5 months) younger than you, you’re a pillar of wisdom and bug motherhood and bucket hat styling to us all.", "maisadom": "Happy bday to you! 🎈🎉✨", "nathalialevy": "feliz aniversário!! 🎈", "jing_notjane": "Loved reading this- happy birthday 🌿☺️💫!", "lauban": "I LOVE YOU HAPPY BIRTHDAY 😘😘😘😘😘😘😘😘😘😘", "nic__cage": "30 yr old genius ❤️", "mallowsoftgoods": "Happy birthday!!! You’re a dream weaver and this caption spoke to everything I felt on the cusp of thirty as well. 💖✨ 💫🥳", "kateglavan": "happy birthday!!! ❤️❤️❤️", "linakru88": "Happy birthday! Kinda of admire you for embracing getting older!!", "camistraschnoy": "❤️❤️❤️❤️👏🏻 Loved these words! Happy Birthday !!", "stefstefstef_": "👏🏼😍 Happy birthday! you’re so great!✨", "monica.pajarin": "Happy birthday!! You are such a special soul ✨", "jessicaamento": "Happy trip around the sun, stunner + fellow Leo! ☀️🦁", "lk_suchy": "Happy birthday!! 🎈", "ajoyinthecity": "❤️ this! Happy birthday!", "kungfukiah": "Happy birthday! 🎊", "zestdressed": "Love this - happy birthday !!!", "_sabrinasantiago": "Happy happy birthday 😍", "chloeberk": "So well said. Happy birthday!", "ehitskay": "Happy Birthday Haley 🥳", "nikitasardana": "beautifully written! happy birthday! ❤️", "lorenamorgana": "Happy bday! ✨", "amilli0naire": "Happy middle of your Saturn return love you just texted you a bunch of gifs!", "shirin_sharma": "💗! Happy happy Birthday 🎂 ! 💗  p.s. nailing #stickofbutter 💛", "halemur\nVerified": "Verified", "sya.lalalaaa": "Happy birthday you! ❤️", "nrmtqh": "Happy birthday, Haley❤️✨", "byamberburns": "Happy birthday ❤️"}