{"alexmillny\nVerified": "Verified", "r.a.c.h_w.h.i.t.e": "The insight and elegance of your writing was a delight to read!", "raeroot": "loved this, thanks for speaking so well to this corner of the world", "sasanator13": "@jpants95 this is like a crossover episode of my 2 favorite shows 😭", "em_muhlby": "!!!!! WHAT !!!!! my worlds colliding", "stephfayngor": "@jonthewiggles hey I know him", "pilogrant": "what an icon", "briannaclarke666": "Hearing two of my fav internet voices in the same click honestly made my Wednesday 😍🙏", "twoofakindcooks": "Fantastic article ... love @csaffitz! 💕", "heykackie": "To quote an intellectual, “I would die for Claire from the Bon Appetit test kitchen.”", "caitlintait": "@bradley_bruni @romonafinna @ainsliecouper NEWS FLASH", "lindseyshorter": "So happy you covered this. I feel like you put something to paper that I have been chewing on for a long time and wondering why I am so drawn to all these people! Well done!", "allison_gf": "Yessss!! This is amazing!!!!!!!", "georgiaviel": "@theannaedit you’d love this article 🙌🏼", "francineathomp": "Haley this article was so fabulous. It’s exactly the kind of content that makes Man Repeller the one blog that I still read every single day. It made me appreciate Claire and see myself in her– complex, full of contradictions, and driven. Wonderful piece 💓", "nazaleakusuma": "This is my favourite Claire piece to date! I love your insight about the whole phenomenone and the way your tone doesn't come across as condescending and overly exclusive. The article's got great pictures, too!", "itspeterjoe": "@csaffitz is the real deal And I’ll my friends know it. We joke that she is like a gateway drug to the entire BA universe and it’s all good to us. It’s some of the best content on the internet and she brought a lot of us there ❤️❤️", "a_d_o_l_p_h_i_n": "❤️", "oliab": "What a wonderful article! You captured the essence of BA and also what Claire does so perfectly. What a fantastic glimpse behind the BA YouTube curtain as well! Thank you😊", "gingermtv": "@theonechameleon", "rivbatlan": "needed this crossover tnx!!", "kiikoblak": "You. Are. So lucky.", "janewinget": "this was a fantastic read! I enjoyed it so much that I read the whole thing on the instagram browser pop-up, which usually annoys me enough that I just save the link and then never revisit it", "_ellari": "@juliashappy_ omg she met my fave Internet person?!??", "oliveblair": "I was literally watching gourmet makes when I came across this post.", "k0_92u": "Brilliant piece. Thoroughly enjoyed reading it!", "robxnlouise": "This was an incredible read 🙌 captures the essence of the BA fandom (literally 35 yr old first time fan of anything here) and these test kitchen. Thank you.", "humanpolkadot": "So jealous, I love herrr", "kblateefah": "Can’t wait to read this!!!", "nadine.wendorff": "Omg INSPIRING !!!!!", "vorundor": "I loved reading Clair’s profile, so good. I love her even more now. ❤️", "helenanevrayeva": "This was so captivating to read g, wow! Loved all the nice details, the sense of appreciation that it brought, and of course little sneak peaks into future episodes. Thank you!", "gdsclothgoods": "I would do anything to get one of my smocks in her hands! It’s a pretty up-there dream. Putting it down on paper and making it a goal right now.", "anthonynardi": "That was terrific. Thanks for the article!", "ojl2283": "This is such a delightful encapsulation of a culinary brand and phenomenon. Astute analysis and endearing anecdotes that truly captures why both Claire and the BA brand at large has received such a cult following. Thank you - this has been a wonderful read.", "katpert": "The crossover none of us deserved!! 💕", "thatgirllams": "Ooou lucky!", "emily______johnson": "She is my favorite and new style icon with that hair!!!", "savjax": "❤️❤️❤️❤️❤️❤️", "thatladyjulie": "Wow extremely jealous", "ashley_gold_": "@julianayang so much love for Claire", "tanyasmithofficiel": "Everyone should hope to be profiled by you! This is sharply observed, empathetic and extremely elegant ❤", "stephieottob": "Wow, my two worlds (obsessions) colliding 🤣❤️", "collin_fin": "loved reading your piece!!!! god bless claire", "gabysalaz19": "Thanks for describing so well my love for the lovely Half Sour Saffitz and the rest of the BA test kitchen ❤️😍", "victoriasavkaart": "She rocks my world, especially when she made the pop rocks...", "phenomenella": "@trnkova", "phie123": "This was the think piece we’ve all been waiting for!!!!!", "missmeilin": "Omg this is rivetingggggg ✨🔥💕👏✨", "sandrinepayan": "@nouchaline", "morgan_verble": "this has perfectly captured the magic of BA i haven’t been able to understand/put into words. so good.", "clarecullinan": "two icons", "vantefrank": "Shut up!", "luavirginia": "MY TWO FAVORITE PEOPLE MET EACH OTHER IM CRYING", "sarahdoingsomething": "this is such a perfect crossover of all my interests im just gonna tag myself. @sarahdoingsomething"}