{"torimuser": "❤️❤️❤️❤️", "kerrynflies": "I am so excited to see what you do next", "deannapetcoff": "Your work is incredible!!! So much love 💖", "nixsantos": "Selfishly heartbroken! Your writing is one of my favorite things about MR but am excited to see you spread your wings.", "menaljham": "Your writing is my favorite. Look forward to reading more in the future (forever!)", "dhanairs": "I'm very sad that I won't be reading your thoughtful words on MR anymore but I'm happy for you - you're chasing your dreams and that's what matters. Hope to read a lot from you in the future. Ready to pre-order your book anytime 🙌🌻", "fionapatterson1": "@sorrcharose", "sarahrowes": "I’ll miss your insights!! Bookmarked SO many of your pieces! Please keep us updated on where to find your work! P.s one time you responded to my comment on an MR post and it was one of the happiest moments of my life (I bookmarked the post and will cherish it forever) 🌸", "sydneymjoseph": "You’ve written so many amazing pieces over the last four years - I can’t count the number of times where I would be reading something and think “I bet this is Haley’s”, scroll back up to the top, and sure enough it was always you! Congratulations on this next step - I can’t wait to follow along!", "grensongirlsofficial": "❤️", "ebertlaura": "Ok so I’m sad as if we worked together (and as if we knew each other? Internet is weird)! Super good luck on your new journey! 💥", "julia.richardson": "@maxarnheiter :(", "katerinapsoma": "Dear @halemur I follow you almost from your beginning in MR and do remember the appointment with a psychologist (or was it dentist? ) in your stories, movies you watched,a day you got sick and when you cut your hair. Yes memories are weird and no I am not a stalker. The power of social media have made relationships a bit , well I do not know exactly how to define it, but one feels as though you know the other through the years. As if you are my distant niece or cousin (if my insta is, well, family!) I wish you happiness in whatever you do and good health. I will be following you, and no this is not a threat! I will follow your feed, which always brings a smile in my face! ❤️ Take good care.", "evelynollish": "I’m excited to see what comes next!", "ele9876": "Love your writings, your words, your style. Thank you for all these years on MR 💘", "andiezacher": "@preshnfresh hope you read her article...loved it! And good luck to you, @halemur! Your writing is wonderful and the best part was I felt like I got to really know you...a friendly voice. ❤️", "asusterka": "Wow wow wow wow. What an accomplishment! 👏🏽", "lauurataylor": "You’re so rad! Can’t wait to see what’s next 💛", "hellyesshecann": "so I am supposed to pretend that I did not read all of your publications and semi-professionally stalk your instagram account with strong appreciation and enthusiasm? 🤔", "makenzieambrose": "Did I see you in the background of a Bon Appétit video or am I crazy?????", "ttymel": "go haley go! 👏💞", "sofiamaame": "All the continued best to you Haley 😢", "despinavergidi": "Haley I just read this piece you wrote in the end of February about the end of an era and new beginnings, and ufffff.... thank you! It’s so true and brilliant I’m literally sobbing. This year my motto is Embrace Change. Because chasing forevers has become exhausting. But the comfort is so real as well- Every single time! Why is it so tricky?", "vvega": "From a stranger that loves your words and your fly style, I look forward to following where you go. How creepy is that?", "winijun": "Your breakup essay from years ago is unforgettable, groundbreaking for me, and I think of it often. Thank you for making me smile, think, laugh, cry. I can’t wait to see what you do next ❤️", "helen_swarbrick": "I love this article , feel such a bond to you I don’t know how , from England but your writing is personal and universal ❤️ best of luck in the future ❤️we’re all behind you !", "nenthe": "Will miss you!!!!!!!!!!!!!!!!", "kaylamariekirby": "This hit me hard, in a ‘I don’t know her but also feel like I know her because I read her writing daily and have for years’ type of way, and basically I am just so happy for you that I quite literally shed a (very) happy tear of joy 😭", "mbf20": "thank you for your words over the years. they’ve been beautiful and powerful and honest and fresh and just really really good. I’ve felt seen in your writing, saw myself in the stories you told. Gonna miss you at MR. Looking forward to seeing what’s next! X", "courtyard_la": "Wow! So excited for you honey!!!", "summermosher": "Haley! This made me cry! Good luck in whatever you do next. Love xx", "mackieatmyhouse": "Your words have truly impacted me and I’m grateful to have the opportunity to follow your journey. Excited to see how you continue to kill the game.", "hannahtheonee": "Haley, I am so incredibly happy for you, and really looking forward to where you go next!! your writing has guided me through a huge transition period of my life, and meant so much to me. Your essays on life’s periods of change, hope, and how you learned to take chances on yourself have truly reshaped the way I think about my future. Thank you so much for lending your voice to all of us. I hope it’s obvious how many people appreciate your voice and perspective. Sending you love and wishing all the best in what’s to come 💘💘", "beccavarelapalmer": "Noooooooooo 😭", "wintangwarastri": "If I may, lemme just say that your writings are some of the MOST meaningful, impactful, and just all-around wonderful pieces that have inspired me to pursue my path. Truly, truly will miss your essays on MR that I read religiously. Onwards and upwards, best of luck!✨💪🏼", "misscarleyp": "Can’t wait to see what you do next. Been reading you from the beginning and don’t plan on stopping ❤️", "laurengraceee": "😭😭😭", "onirikthelabel": "Can’t wait to see what you’re up to next!", "shombeemed": "💜💜 Excited for your new adventure!!", "carolinepomilla": "Ahhhh your writing has meant so much to me over the years! I can’t wait to see what you do next ❤️❤️❤️", "rrruiva": "love ❤️", "amber_sabri": "MR will never be the same. Your esssys helped me so much and were the highlight of me not paying attention during my classes. Thank you so much for having such an amazing I cannot wait to see what in your future! Good luck 💓", "csbpa": "whaaat I had this secret dream I‘d go do an internship at man repeller and we‘d become best friends so now this isn‘t happening????", "chloegration": "I’ve loved reading your articles for MR. Can’t wait to see what comes next for you Haley! 💕", "janearielkatz": "I love this and I love your writing. You are an inspiration to us all.", "lilzapp": "I will follow your writing anywhere!!!!!!!!!", "kelseycavaretta": "@mrssemco 😢", "laceypirelli": "😘", "caro_odom": "Excited to follow you wherever you write next! 🙌🏼", "thebattleofarbela": "So wild!!! You've been one of my favorite voices at MR and have made me fall in love with the site so much more. Good luck with everything ahead!!! Can't wait to keep reading your stuff and see what's in store ✨✨✨", "iamsiofra": "Go you! Without a doubt you will shine. Looking forward to seeing your next moves.", "lottiemarr": "Even though I’ve never met you this feels so personal 😂🙃 you write sentences that I read over and over again just to fully absorb the beauty / truth / poignancy / perfection. Look forward to your next chapter 🙏", "amoebadang": "Sad day!!😭 Your articles are my absolute favorite!!!!!!", "emilyholding": "I have loved reading your articles on MR so much! I go back and re-read them all the time. Sending you good vibes for the future and lots of love 💜✨please keep us updated on what’s next 😇", "sara_king_moura": "Be happy, that is your new job. Be happy 👑 @halemur", "kierakaterina": "Been reading your work since The Similarish, looking forward to seeing / reading what's next 💞 thanks for all the wonderful reading ✨", "rachellmaguire": "@alicebyrnex", "lydiastater": "Haley 💖 I have loved and resonated with your pieces ever since you first joined MR. Your writing has been such a comforting, centered voice of reason for these past four years, and I can’t wait to see what you do next. Good luck!!!! ✨✨", "kat5446": "Awwww so sad for MR but so happy for you!!🌈You are an amazingly talented writer, looking forward to whatever you write next🙌😍", "almuai": "Probably one of my favourite pieces I have read from you Haley. Just beautiful. 👏👏🏼👏 Best of luck in your new ventures!", "zsooofizsooofi": "Haley!! I’m gonna miss your writing on MR but please please share what you’re up to!! Congrats on going freelance too, such a huge step!", "rachstarrett": "I will miss you!!! Good luck in your future endeavors! And I hope we see you very much still on social media.", "caseyzhang": "👏👏 FREELANCE HALEY 👏👏", "naomiec": "Haley you are so much of the reason I've been an avid reader of MR for the last four years. Thank you for getting me through breakups, interstate moves, new jobs, new loves, and everything else in between. There are so many pieces of yours I've read over the years that to this day I still think of from time to time (regularly). Good luck for whatever comes next and thank you for letting us inside your brain ❤️", "sarah_sucks__": "I’ve loved following you and reading your work at MR for years💛 I think you’re rad as heck ⭐️all the best", "_mayann": "@can i.gabriela first Amelia now Haley I’m fuckin cryin in the club", "sofiesnoek": "Thank you Haley! It was a pleasure reading your mind! <3", "ema_dellorto": "I have to read your Au revoir and come back to say if I forgive you for leaving", "callieahlgrim\nVerified": "Verified", "mlserenes": "I’ve said it before in your IG comments section and I’ll say it again: you are one of favorite writers on MR AND in general and reading it never fails to inspire me to think, write, feel and share. As we say in my language: bon vent :) Wish you all the best and I look forward to following you on your next adventure!", "lauraomodt": "Your words have brought me so much comfort and resonance over the years. Cheering you on, wherever you go. ✨", "gintarecccccccccccccccccc": "💞", "annapraxitelous": "We will miss you x wishing you nothing but the best for the future 🌷", "bridgettedollarbillz": "@jhorgs 😢", "shielamarie.jpeg": "So sad!!! Always look forward reading your writing! So excited and so happy for you!! We cant wait to see whats next!!!", "mikaelamclark": "Glad to have crossed paths for a short period. Wishing you all the luck and joy in the world. 💛", "domx_": "❤️✨", "lucyhicksbeach": "@jane_prinsley 💔💔💔💔", "nathybaby_": "@unclelarry_ ugh love her", "coryshannonpreston": "So sad, I love your articles the most!", "arminsahakyan": "Only forward ! good for you 💙", "mariavaldovin": "You will be missed! Thank you for your beautiful words, always! 💘", "mgulbardak": "😔😔😔", "jessica_riga": "@natalieisbrown !!", "victoria_auger": "Your writing has been so inspirational and thought-provoking for me, especially on the topic of relationships. I guess you’ve expanded my way of analysing and this is the proof of the genius writer that you are. Cannot wait to read you on other publishing shores. 👋🏻 from Paris, France", "deidrematthee": "💙", "marisalifz": "♥️♥️♥️we’ll miss you dearly", "erinvandermeer": "Haley! You are one of the most thoughtful, insightful and generous editors I have worked for. Thank you for making writing for @manrepeller a pleasure. Can’t wait to see what you do next. PS I moved to NYC in March 2016 too. Anniversary twins!", "kyldapalazciozz": "you're my favorite editor😭😭", "amysboyd": "Your latest piece is so lovely and I needed it. I’m sure many others feel the same. Thank you for this story and all of them. Good things ahead. 💖", "bykristylin": "So bittersweet, feeling all the feels! Changes are still endings...Like my favorite elementary/middle school teacher/Mary Poppins is finally leaving. Even though you’re still “here”...Best of luck on the next adventure, you’ve been and will be amazing!", "jessica.riches": "This made me cry, which, as a person who doesn't cry often or lightly, was surprising to me. I can't tell you how much your writing has meant to me since I first stumbled on it; I am a fan of MR because of it. You seem to be a couple steps ahead on the same path as me (there are many, many parallels in our histories), and it has been so helpful to me that you've charted that path through your writing. You are constantly expressing the thoughts in my mind that feel like an unshaped ball of clay sitting directly on my face (heavy, dark, somehow slightly damp, earthy smell), and the shape they acquire in your hands is clear and useful, like a favourite mug. In short, I will follow your writing to the ends of the earth and wish you the best of luck with whatever comes next.", "laurenrenaepain": "Crying - but also stoked! You’re one of my favourite writers and I can’t wait to see what you do next. 💕", "fedeaversa": "❤️", "nicmilani": "I AM CRYING", "sophiefriedoyster": "😭😭😭", "campsensibility": "DEVASTATED u were the best writer on that site excited to follow u and see what u come up with 💕", "paolagsanz": "Thank for an amazing four years! Looking forward to see what’s next for you🙌🏻🌟👀", "emmagannonuk\nVerified": "Verified", "lalaboid": "@emmawelling 😢", "neeeeeeeeeen": "💕", "azkashahid": "Cannot imagine MR without you, you have been my favorite aspect of it for so long, but good luck and best wishes for all your endeavors.", "anabeatrizrosa1": "haley! it’s kinda of crazy writing to someone you don’t know, especially if you’re a reader from brazil, but your texts are one of my favorites in whole internet! wish u all the best in your next forever ❤️✨", "elisaabuin": "❤️❤️❤️❤️", "frenchiesa": "Nooooooo 😭😭😭😭", "jmescatalog": "brb am cryin", "mercedesayalaa": "I’m excited for you! Tell me/“us” whenever you write something", "diamondjuls": "❤️ You Haley!! On to the next adventure! Maybe one that will bring you to chicago more often!", "memomemo": "Go Haley!!!!! 🔥👼🏼🔥👼🏼", "thehowie": "Omg @therockettes made your highlight real!!! 🙌🏻 Congrats on your new adventures!!!!", "bethyb1984": "Congratulations! I’ll miss reading your work for MR but look forward to following your next great adventure.", "seeyounextwednesday": "my favorite manrepeller writer !!!! looking forward to reading your book : )", "camouchki": "I will miss your writing so much (but will be looking forward to what’s to come!) So many pieces resonated with me and articulated thoughts I never knew could be put into words. thank you thank you thank you ❤️🥺 not not tearing up", "moriah.q": "Congrats on this new, exciting step! I have no doubt you are going great places. You are a truly incredible writer and I can’t wait to see what the future holds for you 💖", "hannahjjayne": "So unexpectedly emosh about this. Love your writing so much. Completely get the bit about leaving a job feeling like a break up, I’m a month into my new job and the feeling passes! Patiently waiting for your first book now, hurry up plz xXx", "lori_e_chang": "Best of luck in whatever the future holds!", "ruderuthless": "It's your time bb!", "jennakbuckley": "@kelseytaeckens this makes me emo :'(", "brokenmolar": "Oh my goodness the comments on this post are like people signing your senior yearbook 😭", "heidigruner": "😭😭😭", "brittanyrhoa": "Just sobbed in public reading your essay. It’s fine. Everything’s fine.", "brulesey": "Wowee wow , I feel so honored to be one of your finale pieces. Congrats! I look forward to taking up some space in your new head space ❤️", "casey.bock": "Does this have something to do with leap years? 🤔 Best wishes for your new journey!!", "char_mar": "haley i’ve found so much comfort in your writing! TY and excited to keep reading what’s next💗", "katehartonline": "You were one of my favorite writers for MR. I’m very sad to see you go but very excited for you! Good luck!", "itsaggster": "😫😫😫 you better share where you work will be! I want to keep reading your stuff!", "thelollasite": "Haleumurrrr 💙 Thank you so much for providing me with 4 years of your amazing way to express your brain. I listened to a podcast last year when you told your story, about moving to NY and how much you have evolved as a writer since then. You are amazing Haley, cheers to whatever it is to come 🍷", "elizcardinal": "I’ll always have scissors or tape or whatever you need for you regardless of where that is. Love you halemur", "grainne0mahony": "Have always loved reading your work on MR, your writing voice is so distinctive and comforting. Best of luck with future projects 💕", "bumbeeb": "Oh my gosh!!!!", "_space.toaster_": "You are an amazing writer, can’t wait to see where your next chapter takes you! I really hope you’ll still share your work (whatever it may be!) 🤓", "luvazq": "The only site i've ever read has been @manrepeller and your pieces have always stuck with me. Sad to see you leave but I guess happy that you are venturing out into newness? Hope to be able to read more stories from you soon, wishing you the best on this big step, Haley! ❤️❤️", "kenziespr": "Onward and upward girlie!!!! Best of luck 👊🏻", "janellacabus": "Luv u 💕", "emilynoliver": "I once came to NY and stopped by the MR offices. For obvious reasons, the very nice doorman wouldn’t me upstairs, but I told him to tell you a “Spokane-based journalist says hi.” Your writing has gotten me through so much and I hope it continues to do so! Good luck💕", "brigibi": ":(", "illyvdiez": "You will be missed! Your writing has guided me!!!", "raquelpontieri": "So sad!! You'll be missed 💛", "justlazy": "Nooooooo ✨😭", "velvet_cultura": "Ohh nooo 😭 but also good luck ❤️", "queenlilymello": "💔💔💔💔", "musselae": "❤️", "weediecrowe": "You are/were my favourite thing about MR! Can’t wait to see what you do next! 🍾🙌🏽", "sharezolot": "Omg @elizcardinal ur hair wuz so long!!!!", "breanna__warner": "Excited for you and your new chapter 🧡", "thegreatterrific": "💕🙌🏽🌋🍦🐼✨✨✨", "katieobrienz": "😭 but also 🙌 best wishes", "vague.jpeg": ":’(", "jenj8": "I just think you’re the greatest.", "juanatome": "💔", "sliceofpiazza": "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "brandogeoffrey": "😭❤️", "nohans": "End of an era! 😭 Can’t wait to see what you do next", "kjv0929": "My bookmark of ManRepeller is your page of stories. The best. Can’t wait to see what you do next. Congrats!", "rachelmariaofficial": "Love reading your work and seeing your updates. you’ll do great things!", "kaylacormier": "💔💔💔/♥️♥️♥️", "somlou": "Best of luck! Hope to see your name in lights elsewhere ☀️", "gossipallie": "happy and sad at the same time💛", "katlion": "Now you can be a \"guest writer \" for MR on your own time:)", "hmalvido": "😪", "ynamusico": "thank you for all your stories, haley! i hope u never run out, whether it’s ones u share with us, or the ones u keep.", "ladybirdlcp": "Your work is my favorite - looking forward to following your career forward! Good luck and have fun - and thanks for speaking so fluently to the depth of being a human. 🙏🏻✨💛", "pbehnken": "@jeaninedonovan1 😭", "e_lizardd": "You’ve truly been one of my favorite aspects of MR! The titular role! I’ve bookmarked so many of your stories (and also that picture you posted of the mouth with the tiny, sharp teeth) to admire and laugh with again, and again. Can’t wait to keep reading wherever the link in your bio will lead to in the future ✨✨", "aileux": "Omg why am I emotional about this😭😭 truly the end of an era", "spectaculark": "@halemur you’re such a rockstar ✨can’t wait to see what’s next for you!", "madilynhastoglis": "Have truly loved reading your thoughtful and beautiful pieces for man repeller and i cannot wait for many more to come 💞", "chevieff": "😭 Your writing has inspired and helped me in so many ways, stories I read that I didn’t look at who wrote them until the end and then I looked and thought, of course it’s Haley. You and Harling are such friendship goals. Good luck on whatever’s next!!!", "catiemarieniolet": "WORDS FAIL!!!!!! You are all I ever hope to be in a woman and a writer. Thank you for sharing your voice with us these years. Can’t wait to see what happens next.", "caromarialina": "😭😭😭", "paigeoconn": "love u long time!", "thechronicleblog": "Please keep us updated! Maybe you could write for us at the chronicle. The end of a era but a brand new beginning ❤️❤️❤️", "morganalewis_": "I will miss your lovely, earthy, no BS presence on MR!!! Thank you for so many smart, funny, truly life-altering moments of self-realization. Can’t wait to see where you go next! ✨", "oudreyna": "Goodluck Haley! I’ve been following your growth at MR and I’m a fan. So excited for your future and next things to come! Please keep us updated!", "sabletoothtigre\nVerified": "Verified", "beerbottles_chainsaws": "My Sweet Face Jones. My angel bby, my co-shop girl partner, my queen! You already know what it issssss. I fully expect a daily email with what you’re doing and what’s going on in life and then a bi-weekly in person meet up, followed by a once monthly google doc of updates, moving forward.", "esther.sml": "R u leaving bc someone asked @leandramcohen \"why is everyone in manrepeller nerdy looking girls?\"", "littleblankdiaries": "So excited to see what’s next for you!", "ashleyainsworthart": "❤️💔💔💔", "eebenzo": "♥️♥️♥️", "_sabrinasantiago": "Go Haley go!!! ⭐️❤️", "liatshulamit": "Loved what you said about memory. \"Almost tidy until you go looking\" is so accurate. Good luck with your next phase!", "_emmagrady_": "Loved working with you, can’t wait to see what you do next! 💥", "balagan_studio": "Oy @halemur I love your writing so much! You’ve always been my go to on @manrepeller ! Lots of luck going forward! You got this 💕🤟", "jessi.esti": "Looking forward to seeing more of your work out in the world. So excited for you and your next step! 💗💗💗", "nicole_vincee": "Will miss your writing enormously. Thanks for all the times you made me feel like I wasn’t the only one experiencing obscure thoughts/feelings that were too private for anyone else to voice ❤️ wishing you all the best for the future!", "beritbelen": "It’s funny and great to feel proud of someone you don’t know a shred. I like you, Haley, and I’m rooting for you however/wherever you land!", "naddeets": "Will miss your writing at MR but so excited to see your future work! ♥️", "alexisjs": "You’ll definitely be missed. Your pieces have been some of my favorites. 💛", "vivianvanwingerden": "Nooo! (But also yess, because I'm excited to follow your writing from here on!) You're one of my favorite writers on MR, will miss your articles!", "mama_c_taylor": "Let us know how we can continue to read your writing...You’re funny af and well this old bird needs a laugh and to stay informed❤️good luck...go getter...and all those encouraging platitudes❤️", "elisamvnm": "Can’t figure out if I’m mostly sad or excited.. but good luck, you’re so inspiring❤️", "almostricia": "HALEY! By far one of my favourite writers I’ve found through MR since I started creeping every story incessantly (so since around 2015?) and although we’ve never met, your words have always been able to guide, to heal, and to detangle all the messy cobwebs of thoughts and feelings we have felt together as a nudist colony (lol!). Thank you for your heart, your thoughtfulness, and most importantly, your kind and gentle way of viewing the world. Excited to see what’s next! ❤️", "delphinelt": "😭💛", "itscharliehart": "Loved reading your works at MR and can't wait to see what you do next 👏", "rebeccaknavarro": "Oh my god I’m actually crying Hayleyyyyyyyy mostly very happy for you also 😩", "dotdaria": "💔💔💔", "laurenleigh_kelley": "What a bittersweet week. My favorite morning dj also announced they are leaving this week. I wish you the best on this next step of your life. ❤️", "_katestuart_": "@christinaadeleread heartbroken!!!!!!!", "rahelschepers": "😱😭 I can’t believe this is happening - how can MR be MR without you? But then again, so so cool and exciting - I wish you all the best! You will always be my favourite writer on MR 💕", "iejessie": "loved reading your piece 💕 so poignant!! have really enjoyed your writing on MR over the past few years and am super excited to see what you get up to next! ✨", "sarahstinson": "go haley!!!!! 🎸🎸🎸🎸", "crashstein": "giddy up", "moni_torrr": "Your writing was so encouraging on my upcoming decision to live alone!", "leandramcohen\nVerified": "Verified", "sunnysideofgray": "Your writing always speaks to me! Excited for the words to come ❤️", "kellymn": "Go, go, go, sis! 👏🏻😘👏🏻😘👏🏻😘", "spills.hadley": "Wow I will miss your voice on Man Repeller! Crossing my fingers there’s a book somewhere down the pipeline for you 💓", "rafaelabc": "nooo, mixed feelings 😭😍 gonna miss you on MR, but will follow you anywhere that you tell us to ❤️", "susana.ines": "Haley no!!! Wish you the best in your next endeavors and I can’t wait to read your work at your next project.", "sarah.bereza": "Good luck on your next chapter!", "emponch": "FUCK", "noravcuratory": "Noooooooo, happy for you, but noooooo", "morgangamblin": "No no no the woman responsible for my OC binge must be held accountable and continue guiding my TV queue! Resignation not accepted 😫💙", "offbeetjournal": "HALEY I AM SOBBING MY GOD", "daniruizabbott": "😭😭😭I love you and all your stories and all your fits and looks. And I will miss you but also I’m so proud of you. And I don’t even know you.", "noelledaily": "Ah! I knew it was coming 💖 best to you!!🙌🌈🌟🌟✨ 💖", "ehitskay": "Happy-sad ❤️ congratulations on growth, Haley. I’ll be reading wherever you’re writing ✨", "lefreela": "💔 but 💕 So happy for you", "missmeilin": "😭💕✨ But happy freelance life! Hope you can continue to publish your work since I love reading it! ✨", "glamobserver": "Look forward to see what’s next💖✨💪🏻", "bknysand": "I love your writing! And your haircut. Snip Snip. Xoxo 💫", "shireenmohyi": "Can’t wait to see what you do next!!", "jessicassis": "I’m so sad, you were my favorite 💔 good luck with everything, looking forward to what you’re gonna do next ❤️💫", "sheyda_rebekha": "😭😭", "jagoda_niezgoda": "Oh nooo, love your work ❤️", "alexxandra_vann": "@jana_hugo !!!!!", "rlcornwall": "This feels like a breakup for me too", "smashrob": "You will be SO MISSED! But can’t wait to see where your nugs of wisdom wind up next!", "resmith.creates": "@wolfette4lyf 😰😰😰😰😰 but also ❤️❤️❤️❤️❤️❤️", "rachelshuford": "Awwwh, I’ve always dreamed of applying to work at Man Repeller to work with you. Have loved following you and your journey and will continue to. ♥️", "emilyscott6": "Good luck Haley! Your writing has got me through so much! Particularly a really bad break up - you gave me the courage to leave, so thank you. I enjoy your writing SO much, it’s brave, honest and refreshing. SO MUCH LUCK for your next move. 💖💖💖 Will miss you on MR! @halemur", "nadinetonn": "Haley, I've always enjoyed reading your pieces for MR and have loved watching your evolving contribution of minimalist/sporty spice style. Thanks a bazillion and best of luck! <3", "jlchan2": "@lodtru 😭", "caity_black": "😱😭😭😭😭😭", "kelseylynnstevens": "why am i crying?! 😩 so excited for you and what’s to come! your unique storytelling on the mr platform will surely be missed! 💕", "killertofu__": "great read, it’s been fascinating as a mere social media stranger following your journey. i look forward to reading more of your work to come, wherever that anchor lands🖤", "alisharamos": "Will miss your voice on the MR site, excited for what’s next!", "personalcheesus": "Nooooooo 😭😭😭", "flaviacastillop": "I loved you work with Man Repeller! Best wishes for what’s to come 🙌🏽", "aubrey.fink": "Omg!!!!! 😭😭😭", "erinjefferson": "I love your writing Haley. Excited to see what’s next!! 😁", "theboldbudget": "Without the shadow of a doubt, I’ll miss your writing on MR. Can’t wait to see everything you’ll be doing. 💛", "susiebenitez": "My favorite writer ❤️❤️❤️ I can’t wait to see what you do Queen!!!", "lindseypsolomon": "I still remember your first Mode visit!", "megnesmith": "But who will tell me when I’ve mixed my metaphors again?! You’re such a peach, @halemur. This world is better for your words ❤️", "chlobrud": "😭😭😭", "imanharirikia\nVerified": "Verified", "danielle_j_thom": "Oh man, first Amelia and now Haley - my fave MR writers. Looking forward to seeing more of your words elsewhere.", "sarapuck0": "I'll miss your stories so much, they were always my favorite ones!", "masfromspace": "Oof", "emilyschildt": "excited to follow along in what’s next, haley!", "cailingold": "😭❤️", "blackbeaarthur": "Proud of u and hopeful that this means an uptick in @bug.tv content!!!!!!!!!!!!!!!!!", "pkkozak": "😭😭😭 I feel emotional reading this lysm congratsss 🎢🍀💓", "nikkiglaberman": "I will never forget your “Why I Ended a Happy Relationship” post. I read it at work and started crying because it was exactly how I felt about my (now over) relationship. I read it so many times and even sent it to my mom! You have touched so many people with your writing at MR can’t wait to see more of it!", "artoflydia_": "I will miss your writings! You inspired me with your work at MR❤️", "_rociosergio": "wowwowowowowow", "kelleymacdonald": "Oh wow! You will be missed so much at MR but how exciting to start something new! Can’t wait to read more of your thought-provoking words 💛", "kblateefah": "😭❤️😭thank you for all you’ve written. Feeling dang nostalgic on your behalf. Can’t wait to read what’s next!", "kleiderfreundin": "Oh no! I will miss you and your writings 💘", "imlilyjane": "♥️ one of my favorite Manrepeller members but looking forward to seeing what’s next from you!! ps your essay made me tear up 🤧", "katcatb_": "Wow! Amazing. Keep making waves", "safsafu": "Good luck with the new chapter ❤️💫", "__rachel.jpg": "I am emotional!!!!", "kateantonas": "❤️❤️", "t_kims": "Kudos and best of luck! I’ve been following your work at MR and have always found your perspective inspirational as I consider a professional shift back to my creative roots 🙏🏻", "__groupfruit__": "you are my favorite MR writer and have Influenced my voice so much. Thanks for your honesty and irreverence. Pls pls keep writing forever and ever or as long as you want thanks", "fionapebble": "thank you for your writing it has impacted me too many times to count! every time i see a new article from you on MR i click immediately and every time it's a treat. good luck with your new endeavours!!!!!", "kait_lion": "thank you Haley 💗", "melbduran": "😭", "sarahcocos": "💜🤍💛🤍💜🤍💛💜", "jenniferpaccione": "♥️♥️♥️", "_alenemarie": "I love you Haley! I’m so sad by this news but I’m so incredibly excited to see what else is in store for you!!!", "hayliestrawberry": "👏👏👏 congratulations! Such a beautiful parting essay. 💖💖", "annaddelarosa": "have always been a fan of your old words, can’t wait to read your new ones", "meccajw": "💛💛💛💛", "rosalie_mary": "Haley!!!!! Thank u x1000 for sharing your words/thoughts/emotions with us for the past 4 years. Tbh my heart sank when I first saw this but I’m also stoked for you and am so glad I had to chance to meet you (and @beerbottles_chainsaws !) at one of your closet sales. The MR community is gonna miss u but I can’t wait to see what’s next! Xoxoxox", "shopneophyte": "very excited to see what you do next 💓", "linneafonfara": "Åååhh I will miss you! 💔✍️ Good luck freelancing! 💫", "wanyizee": "Without mr I woulda never met you, my smart talented kind hearted (proportion genius) friend", "eunniicceee": "You are one of my favorite writers on the internet Haley! You will be missed on MR but I am eager to see what the future brings. Good luck!", "joyseetkoh": "oh no!!!! Your writing got me hooked on MR again, but all the very best! 🍋", "meg____n": "Can’t wait to read whatever you write next!!", "brudandrade": "So happy for you!✨ Let us know where to keep reading your things! You are an amazing writer ✨", "scs322": "I’m going to miss the hell out of you and your poetic writing!! All the best to you xx", "ohrink": "my heart!!", "sofia.sorce": "Such an inspiration. Good luck girl ✨", "carleego": "@danicagomes", "mimiiiiiiiiiiiiii": "oh god is this bittersweet !!! can’t wait to see what’s next to come✨", "floyddetroit\nVerified": "Verified", "sissi.sissi.sissi": "❤️🔥GOOD LUCK!", "maluminati": "HALEY IM NOT OKAY ABOUT THIS!!! but as long as you don’t make me unfollow you bc you’re not at MR anymore i will find a way ❣️also cheers to all that lies ahead for you! 🌟", "jerrynotmaguire": "I had to stop was I was doing to read this. You are my favorite writer Haley. Your stories have given me comfort, made me feel like I wasn't the only one going through stuff (existential conondrums or life milestones). Your stories have also made me laugh and try new life hacks (from the recent pocket recommendation to morning routines or fitted pants). Man Reppeler will definitely not be the same without you. I look forward to keep following your journey and even if you don't know me, with your writing you accompany in mine. ☺️✨", "halemur\nVerified": "Verified", "srhorlando": "@elixsprite @sabrmo 🥺", "shxrmaine": "Thank you for gracing us with your eloquence. It’s always a joy to read your work on MR, and I can’t wait to see more 💕 Wishing you all the best! ☺️", "catherinenichonghaile": "Ah you have always been one of my favourite writers on MR! I can’t wait to read your freelance work. Best of luck!", "kari_edick": "your writing @ MR changed the way I see & cope with & laugh at the world, so thank you! looking forward to reading your work for years to come. 🤍", "_ur_lucky_charm": "I audibly gasped 😵 hope to read much more of your writing all over the place!", "susan_alexandra\nVerified": "Verified", "dirtyfunkytunes": "Can’t wait to see what’s next for you!!", "ivegotbeefbetweenmyteeth": "NOOOOO", "carlotasana": "The best is yet to come ♥️", "hchowww": "Can’t wait to see what’s next for you!!", "amalielikefamily": "Love u sweet halemur. Grateful I’m able to call you my friend, lucky I get to see/hear/read where you go next. I’ll look up to you even when I’m 65 with 7 cats.", "zsofianemes": "haley - mr will never be the same without you! i feel like you’re the older sister i always wished i had, your essays helped and guided me through many difficult times. wishing you all the best for what’s to come, please don’t disappear from our lives! love from london 💕", "rzertuche": "Your writing has helped me navigate my early and mid twenties, THANK YOU!", "toucheghushe": "Cue “Closing Time” theme song ❤️", "annewmello": "So sad! But happy for you. I followed your journey on Man Rapeller since day one and I always loved to read your pieces (yes, you are probably one of my favorite writers alive haha) hope you keep on inspiring people across all borders! All the love 💕", "haleyjmcgrath": "@i.long 😢", "taybelm": "Bummer but also yes girl! Get it! It takes a lot of courage to keep moving forward, especially when you leave something so dear to you. Can’t wait to follow your next writing (?) journey! Ever since I started following you at MR you’ve become a real writing inspiration (and style icon) for me. Keep doing what you’re doing and being you ✨", "ashleyhammm": "Rockettes 4ever", "brionykate_": "Your Man Repeller essays will be sorely missed! Thank you for all your beautiful pieces 💕", "ellie.baran": "Awwwwwwww. Keep us updated! Will you still be writing?", "verymarygray": "I knew this day was coming!!!!!! Hitting the four-five year mark tends to call for total shakeup. You have such a talent and I have only ever felt enriched and inspired reading your pieces and musings, even (especially?) when they’ve touched on challenging or unglamorous themes. (Must say I am kicking myself I didn’t submit an on spec piece while you were there, sigh, but that’s on me). Can’t wait to see where your writing will go 🎉 (pls excuse semi excessive fangirling)", "bela.schultz": "Congrats on this big step! How can we continue following your work?", "christelmichelle": "Omg wow this feels personal... like a friend of mine is moving away! I will miss you. Love your work and good luck in the future!", "catherine_saintsiena": "The jade egg 😭😩", "_veeesna": "My biggest girl crush since day 1 ❤️", "stateofcaitland": "Love your work - can’t wait to see what you do next!", "hilarybovay": "Oh wow, didn’t expect to read this today! So excited to see what you do next. Your writing is impeccable and I hope we get to continue to read much more of it in the future. Best of luck with freelance life, oddly enough that’s what I’m transitioning (back) into as of tomorrow too!", "teklaisgone": "WHERE CAN I KEEP READING YOUR WORK", "cupofjo\nVerified": "Verified", "harlingross\nVerified": "Verified", "caov": "Just read your post on MR, so beautiful, sending you much love on this new step.", "insidefive": "M gonna cry!!!!!!!!!!!!:(", "aemiliafay\nVerified": "Verified", "eunzikim_": "You will be missed 😭", "tirafire": "Love you forever 💗", "michelafg": "😢 I was with you from the beginning and will miss you mucho!!", "merylfontek": "First time I was published was via Haley @manrepeller BEST feeling! You’ve made an impact! Good luck xx", "maraslanka": "Your writing will live forever in my bookmarked pages <3 Thank you for all of the vulnerability and wisdom you've shared over the years!", "saraheodum": "Oh wow. I’m personally very grateful and impacted by the work you’ve done with MR. Thank you for your writing. 🙏🏽", "ayanoelson": "❤️🦋💜", "soft_jock": "this sorta feels like when your best friend and their partner, who you are also friends with, breaks up and you’re like it’s not really about me but i’m still sad. anyways, congratulations on an amazing tenure and i can’t wait to see what’s next.", "serenetouma": "OMG... I’ll miss your writing, it’s no exaggeration to say I’ve read everything you’ve written on MR and shared it far and wide... no one thinks quite as eloquently as you... can’t wait to read more", "caitlin_sowers": "\"Safety and certainty aren’t so comforting when their maintenance requires the quieting of a deeper calling.\" 👏🏼 I will be sad to no longer see your personal essays pop up on MR (my favourites) but am so happy to see where this next chapter takes you! Congratulations!", "sabahbanomalik": "Wow 😭😭 you’re writing, your words inspire me so much! Excited to see what’s to come ❤️ all the power and peace your way", "leti.sala\nVerified": "Verified", "puffyeyebagslayer": "😢💕 wishing you all the best for your future", "anna.koch": "No:(((((", "camilaperezb": "oh 🥺", "yvonnevbocci": "👏❤️ this is special. Congrats on your next step, raccoon 👑", "m_ichellep": "So glad MR allowed me to discover your unique voice Haley. Can’t wait to see what’s coming next for you ❤️", "sarah.dominique": "Thank you for your vulnerability these last 4 years! Your words have consistently moved me in ways we always hope they should. Congratulations on this next chapter!", "boronelli": "😳 your work at MR made me want to follow ur personal account. Your voice has resonated all the way to Albania! Good luck with whatever the future holds🍀", "liefsophietje": "😭 but happy for you!", "bialazzari": "I feel like it is like you breaking up with me but still I want you to be happier so just gonna wish you all the amount of success and fulfillment that you deserve. And that’s a lot! ❣️", "sarawhite24": "thank you for the last 4 years of fun and wisdom", "katarinacohen": "🥺❤️❤️❤️ proud of youuuuu!!!!", "simarbatra": "You made me believe I could be a writer. I’ve loved everything you’ve ever written. I hope to read more as it comes. Can’t wait to see what’s in store for you 💕💕💕💕 thank you for everything", "oliviacrandall": "Excited to see what's next for you!!", "houuhouuhouu": "☹️", "catcostagaspar": "😭😭😭 your insightful and honest essays will be missed! Best of luck freelancing! ❤️", "thhhbbbt": "You’ve got a really singular, unique, snarky writing voice that was my favorite on Man Repeller, and will continue to be as you go up, up, and away on your own!!!! So excited for you. Working for yourself is the best thing ever.", "conconwang": "Can’t wait to see your byline all over the Internet!!", "yasminmoeladi": "❤️", "irfanpopish": "❤️❤️❤️", "ninahylen": "I’m liking this post even though I’m devastated", "sonamsavlani": "❤️", "kaciekaciekaciekacie": "Go get em lady!", "maeeevans": "Looking forward to what your next chapter brings🤠!!", "adeylfarah": "Sad to see you go and excited for what’s coming - the end is always the beginning. Happy to have been with you and @amilli0naire on a NYC bus one day smiling - keep shining 💛 @halemur", "deannarama": "Best of lucky Haley! You will be so missed. Can’t wait to see what’s next 🖤", "averymcq": "you’re so inspiring 🔆🔆", "sobesoftdrink": "💙", "stefstefstef_": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "gavea.nyc": "Wishing you great accomplishments and new dreams in this new phase, Haley. All the best!!! 🤗", "lizshah": "Haley we love u!!", "emanlle": "So sad yet so happy.. your articles are the most reason i looked up MR your writings help me understand so many things.. gonna miss your writingsss", "__annamour": "I feel so sad but this is an exciting beginning of something new and I wish you best of luck from the bottom of my heart!!! ❤️ ✨✨✨", "missmolllyrae": "🥺", "isabelle_mcleod": "🥺"}