{"cometees\nVerified": "Verified", "eroberts_us": "God Bless... 🌹", "leducroz": "Super proud and awestruck as usual...and also...shirt. Yes to shirt.", "mrs_crooky": "I just left a job of 11 years and your words really resonated. 🙌🏻", "lu_schultz": "@lisamcmeikan love this - \"feeling like maybe I was made to bear this kind of weight\"", "ingridingriding": "Start with the Left Hand of Darkness! Although not if you're already feeling the melancholy of being isolated.", "junaijuni": "Jeez! I know this is the least important part of your post but: boy am I glad to not be the only one who that damn scene from BB affected so much. I actually never watched the show because that scene in the first or second episode just shocked me out of ever wanting to see more.", "tiiight": "Always loved your writing on MR, best wishes on whatever you wish to move towards in the future 🙌☀️", "lauradaniellegreen": "It’s my last day of work today at my long time job and I’m having similar feelings. Also still pulling for lucky/grateful/hopeful. 🌟", "leilaa_anne": "Love this, love the diving girl, love Esther, love you", "whataboutzana": "How come I just came across your writing now?! So, so good. Followed!", "excusedenied": "Omg Brit Bennet!!", "raer.work": "@anjoulie_w why don’t I look that cool in my glasses 😩", "ameliagoldie": "Feel like her new book collection has similar vibes to the stuff you enjoy! Second photo ✨ @madelyneec", "sankeith58": "That shirt👎💩", "mrs_najalama": "You're gonna be great love. 🙌 Those books look beautiful reads too, your imagination will get some love. (also, I too think about that scene from breaking bad All.The.Time - then yes I remember that they did pour a whole butt load of acid in there, and I'm not about to shower in a whole load of acid - soooo 👍) I bet working at Man Repeller was amazing though - what was your best thing about that? I would love to hear more 💖", "backyardsurprises": "What do you mean your last day at manrepeller? Do you mean not going to the office or being fired because of the virus ? A lot of companies are firing staff. Is this the case with you as well?", "k.hache": "I constantly fear the tub will fall beneath me as well.", "alliewhitener": "Knowing that you (and so many other commenters) also think about that bathtub scene suddenly makes me feel more grounded than I have in over a week since the world started falling apart. Hooray for the little things linking me to soulmate strangers 🛁", "ziggy_shoots": "I enjoyed that alexander chee book. do you have a fave out of those others? need something new!", "verovillalpando": "Love the diving girl. Need one in my life. Keep inspiring us with your writing. :)", "larajulli": "Love Rage against the maquine 🤘", "druidso18": "You probably have mentioned this already, but where are your red socks from?", "francescafietta": "I love your glasses! Which brand is it! I'd love to find them. Thank you!", "meccajw": "Thank you for the inspiration! You’re divine! Hope to see you after the the tide subsides ✨💛", "lori_e_chang": "You got this! And we’re all still here with you!", "_alisonmarra": "\"sadness isnt the same as regret, it's more like acknowledgement\" 🤯 Thank 🙌🏻 You 🙌🏻 For 🙌🏻 This 👏🏻👏🏻👏🏻", "taraannxx": "Inspiration! 🔥", "jemmaclareswatek": "🧡🧡🧡🧡🧡🧡 We will miss you but excited for everything else you will do 🌷🌷🌷🌷", "halfghaninne": "The Alexander Chee collection is SO good. I hope you love it.", "christenebarberich\nVerified": "Verified", "gracebordelon": "Thank you for being the older sister I never had but definitely needed during the most formative years of my life ❤️", "alexnoiret": "❤️", "cestpasgrav3": "Help! I need to know where you got your shirt!", "alexandra_okay": "@hilsaphina I spy your book!", "gabriellegetty": "Started following manrepeller because of you, not vice versa 💪🏻Go Girl", "huliajope": "You will continue to do so many great things 🙌🏻", "louramsay": "Haley this is so so lovely. I felt it in my soul. Thank you for your words, they brought me up when I was down and gave words to feelings I didn’t know how to name. Thank you. I can’t wait to see what you do next ❤️", "lucia_____b": "🖤🖤🖤", "offbeetjournal": "i’m crying like i work at man repeller GOD DAMN IT HALEY i love you", "brewwknee": "@nadialopezzz_ SHIRT", "ebarton": "You are so amazing! Thank you for being creative, inspiring, bright and full of whimsy!! Your work will be missed at MR but I can’t wait to see what you continue to do😊😊", "anniejhsu": "Congratulations, darling ♥️", "laurenrenaepain": "Ahhhhhhh 😢", "ashinthewronglane": "❤️ I was going to wear that shirt today too", "matchabeer": "We love you so so much Haley 😘", "jnatalo": "Ughhhh I think about that bathtub scene allll the time. All the best in your future endeavors. And also strong floors wherever you go 😳", "hazelmurray": "❤️", "baskabiryerdeyim": "This post came just in time for me. Thank you for “the sign”. 💛", "luceing": "Your MR writing has further shaped and inspired my love for reading and writing throughout the end of my school years and my entire university degree. You have verbalised so many unidentified thoughts, feelings and illuminated subjects with beautifully witty and moving words, forever reducing me to (sad or happy) tears. Thank you and I look forward to reading more of your work and following your adventures in the future! All the best. ⭐️", "stateofclaire": "Powerful words, we can do tough things. TY halemurrr!", "sakoshimohira": "Almost crying as I read your beautiful words! And I'm looking forward to your new chapter and more of this coming!", "zapah_lab": "🙈🔮", "zaynab.fitzpatrick": "Thank you for this", "lauban": "🖤🖤🖤🖤🖤🖤🖤", "emiliaferraradc": "💕👍🏻", "rmroth": "❤️", "mlen.aguirre": "Ty for sharing this transition ✨✨✨", "idont__claire": "❤️", "heeeymister": "All about love is one of the most important books I've ever read", "kemoona": "Whyyyyyyyyyy??? 😭😭😭😭😭", "allchem_y": "♥️You’re great, you’ll continue to be great! ♥️", "allisonamanda13": "Thanks for the books, adding to my list! Why are you quarantined?? Hope you’re OK 💗", "amysboyd": "You, casually dropping Oprah-level truth in my feed this morning.", "tessa.beck": "Your content kept me interested in Man Repeller. I’m so happy to know about your work + to see what’s in store. 🌿 enjoy a bookish quarantine", "creadid": "When you let go of a job that you were so entwined with, it feels like you’re letting go of a piece of your identity. I get it... and suddenly there’s a a patch of your fur that’s missing. And the bare skin feels so weird and hypersensitive. It takes an awkward minute, but before you know it, the new fur will start to grow in and it will reveal a different shade of you. 😽 Also, your shirt is 🤩 and I think of that bathtub scene a lot too! 🥂", "drivingmsdupsie": "Your words have been like a long term email exchange with a funny, wise, kind friend, whose words are are whatever you need when you need it, fire or salve, and I thank you. SO much. 💗", "emilybooksgould": "lmk if you need more books 💜", "sparklejams": "Congratulations on all your wonderful work and can’t wait to see the magic you create next ❤️", "pan_galacticc": "Bravo you for facing this moment head on. Wishing you some deep sleep, nice snacks and cozy times 🖤", "kris_imber": "Please write a book", "kruppgroup": "❤️❤️❤️", "emmaricupero": "Thank you for sharing your process! Wishing you the best!", "wallflowermanifesto": "I thought I was the only one who thinks about that tub scene all the time", "mrssemco": "Absolutely loved “All about love”!", "kc_me_rollin": "Beautifully said 💫 I can’t wait to see what’s next for you Haley 💛", "juanitajaycejc": "aw this is beautiful", "lauralombardi": "❤️", "amyatlas": "Alexander Chee’s ‘How to Write an Autobiographical Novel’ is excellent. Enjoy.", "mjgray": "“And like maybe I was made to bear this kind of weight” 😭💚💕", "juliemyrthis": "🔥Love the shirt, queen👸🏼Truly enjoyed reading your work on MR. Good luck to you❤️", "michellebitran": "This was astonishingly well put. You’re a beautiful writer.", "dahliasfordinner": "The bathtub fell through the floor of a house I lived in. And it was empty at the time! Floor rotted right through. I’ve been paranoid about that ever since. Also kitchen cabinets falling off walls.", "ecarroll.jpeg": "How to Write an Autobiographical Novel is brilliant. I would also recommend My Autobiography of Carson McCullers and In the Dream House if you haven't read them yet.", "eugenia_victoria": "@laurapalau", "tarah_sutton": "Those glasses !!!!", "_flysandhoney_": "You were always one of my favorite writers on manrepeller. I’m sad to see you go but excited to see what’s next for you/your writing. This was beautifully said but I’d expect nothing less. Good luck on any new ventures.", "nately29": "You were one of my favorites! ❤️ Good luck to you in the next steps of your journey!", "abbie_johanning": "I stumbled upon Alexander Chee’s book at a used book sale and I’ve been thanking the book gods for bringing him into my life ever since. It was a dose of well-written perfection that I desperately needed.", "mansinegi_": "Love. And more power to you :)", "juhitalks": "♥️✨", "hey__judes": "Such a thoughtful post! thanks 👏🏻💚", "theboldbudget": "Thank you for these words. Every line made me feel more vulnerable, more human. Looking forward to your story soon Monday.", "rhiarhia": "If the Breaking Bad scene speaks to you, I highly recommend the old Tom Hanks movie the Money Pit. It’s got a bathtub scene to die for. It haunts me, I love it (and a lot of other parts) 🐝💛", "zellerbecky": "♥️", "seekikuclick": "Really well written and expressed 👏🏽👏🏽", "sydthekidddd": "Been following your writing for years 💜 thank you Haley!", "nicolefarrugia": "❤️❤️❤️", "skipperk.ca": "WE'RE GONNA MISS U! keep us posted! <3", "aly_salyer": "😭", "pilarakiko": "@gibbsne !", "rachstarrett": "Need that shirt!", "jc.irnk": "\"sadness isn't the same as regret\" 🙏💖", "hannahaust1n": "Goosebumps. “Maybe I was made to bear this kind of weight” wow", "afeast": "🖤", "maddiepinetree": "Such a beautiful reflection, thank you for sharing.. 💖", "nina_naum_lifestyle": "❤️💣", "micasuaya": "It’s been so nice reading you. Embrace the unknown. Go for it.", "joevegaart": "Good luck to you ! 👍", "kule\nVerified": "Verified", "hbrehl": "I can’t wait to see what you do next! 👏💛", "ava_cummings": "❤️❤️❤️", "couldabeensomeone": "Just got a broken shower valve fixed (did you know there are male and female valve parts😂) and I finally feel like I’m joining the ranks of the clean😂", "dawnsturmon": "caption = my full mood🖤", "arianneprice": "“And like maybe I was made to bear this kind of weight.” Beautiful!", "moriah.q": "I’ve been thinking constantly about how you said in your story about leaving how you voted for yourself in spite of the parts of you that weren’t worth the gamble. Thank you for always being honest and genuine. Keep voting for yourself ❤️", "karaninaleigh": "It’s been a pleasure reading your stories!! Onward and upward! @halemur", "theschrauf": "@amyandrukonis this caption makes me think of you and how you write", "reedledeed": "❤️❤️", "teklaisgone": "rest easy ✨ you’ve worked hard", "char.lou": "reading your writing at manrepeller was like a warm hug and I’ve always looked forward to them... thank you for sharing your words and letting us find comfort in them despite the most complex things... can’t wait for whatever’s next for you and wishing you all the best! with love and support ✨💛", "jeze_bell": "Thank you for all your work 😭 I'll sincerely miss your voice/impact on Man Repeller ♥️", "crashstein": "get it", "lilz_iii": "I’m so glad I’m not the only person who thinks about that Breaking Bad scene in the shower! 🛀", "cfeldmanemison": "Amazing T-shirt", "natalienfs": "Yas bell hooks, Esther Perel", "susan_alexandra\nVerified": "Verified", "kelseylim": "Truly the end of an era ❤️ Thank you for all of your beautiful and insightful words over the years. I can’t wait to see what you do next!", "suzi.blake": "❤️❤️❤️❤️", "alliemarge": "omg every time i shower i think about the tub falling through the floor/ceiling", "onirikthelabel": "“Sadness is not the same as regret” - yes. Very much, yes. 🏋🏿‍♀️🌮🦦 stay strong. Treat yourself kindly. Here’s a cute otter :-) good luck!", "m_aldon": "Eee you’re going to really enjoy all about love, just finished it! 💕👏🏼 Congrats, and enjoy this time!", "literaryrunner": "SO many good books here 👌🏼", "nikitasardana": "I cherished all your writing on Man Repeller and am so excited to see what you do next, Haley. You are inspiring young people even as you navigate something so unknown to you. Wishing you the best! 💗", "gyanyankovich": "HALEYYYYYYYYY 😭", "ratchelroberts": "this is so beautiful", "mollybello": "This is so beautiful. I’ll follow your writing anywhere! I’m grateful to MR for consistently fostering incredible writing that makes you think. A breath of fresh air among mindless listacles.", "_delilapan_": "Your writing over the last few years at Man Repeller has meant so much to me. I’ve passed it along to everyone I care about because there’s something about it that always makes me feel seen, feel sad, and feel hope. You are an awesome writer and (i bet) a super cool person. Have fun on your break reading all those books!", "charikleiasdiary": "I absolutely love your way of writing, good luck with everything! You’re so lucky to have been in such a good and supporting team, it’s more rare than everyone thinks ♥️", "samalamaropey": "👏🏽👏🏽👏🏽👏🏽👏🏽", "sweaty_upperlip_the": "ah process, transitions, unexpected emotions, fear, no longer belonging, not regretting but appreciating what was ... feeling quite the same although due to (partly) different reasons. thanks for sharing and putting it into such comforting words! Curious, what will be your next steps.✊💙", "angelajslick": "Social nourishment! *That* is what I need. Thanks for putting that into words. 👏", "babba\nVerified": "Verified", "mandelmus_": "❤️❤️❤️", "missmeilin": "💕✨", "inwhirlofinspiration": "🔥👏 and also the \"left handof darkness\" is a great book to say the least", "adelaidecharlotte": "@ash.l.morgan 💔", "vanessaszdz": "😍♥️", "j_lemss": "💖", "annabethlame": "If you were to write a book, it would be first on my quarantined reading list. Thank you for all your words over the years— I admire and look up to you from afar 💛", "aliceinbrexitland": "@carlaneiss", "katcatb_": "Also a massive fear and now won’t let fiancé fill up the bath too much. Obsessed with potential leaks etc. Glad to know I’m not the only one", "viajosco": "You are the nicest bathtub and you can handle it 😉 but fix your drain!", "lisanivenphillips": "Know that feeling SO well but life will change in the best way too!", "lizuchtman": "❤️", "emjstrk": "You're amazing!!! ❤️", "simarbatra": "I feel so certain you’re going to do remarkable things, I mean, you already have. Always hopeful for you", "isabelle_mcleod": "✨✨✨", "artoflydia_": "All the best @halemur ❤️", "amalielikefamily": "Boy do I love this. Can we get one of these every day? I also think about the BB tub scene regularly and would like to start a support group", "malloryrice": "Miss you already not an exaggooo", "fake_cool_gab": "This bathtub fear haunts my life. Also you’re awesome - thinkin’ of ya 🌟", "_sabrinasantiago": "❤️", "harlingross\nVerified": "Verified", "gracetexter": "Beautiful 💕", "throwyou": "I cried for like 2 wks when I left my last job lol. It’s part of the process", "jordansondler": "You are strong and inspiring ✨", "e_e_k77": "The shirt!! I have one too!✊🏼", "livingminnaly": "Beautiful share about this transition 💛", "shielamarie.jpeg": "So good!!", "ellie.baran": "Awwww. You got this. This is one of those rare times in life where YOU get to choose your fate amongst ALL the options in front of you. Based on your writing, you won’t have any issue succeeding and finding the right path for YOU. Whatever that may be. Can’t wait to see where you go", "teresacruzburillo": "❤️", "catccohen\nVerified": "Verified", "jenatalla": "Love that Alexander Chee book!", "cococarine": "Life is a journey not a destination 💫. enjoy the ride 🤗", "supermormongirl": "You've got this 😎💃🎉😁", "inahdaze": "❤️"}