{"flora.boo": "Were you exposed or are you self isolating? For some reason I find calling it self isolating easier because it makes it feel like more of a controlled choice?", "tarakun": "i read that as “donating [...] to businessmen” i was like yes yes yes wait what", "nadine.wendorff": "I am going to paint my kitchen!!!!!!!! and maybe even a weird mural inside my house somewhere! am i artistic? no. but this stuff is so calming and life-giving to me :)", "natalienfs": "Phone banking for Bernie ! This election is still happening and remembering that we still have work to do feels positive :-) (exhausting and positive !)", "larnww": "I’ve been doing silent discos in the street on my evening walks which has been fun. Having a dance party with me and my headphones... enjoying the space and no one around. Dancing montages like in the movies.", "jade_rooster": "💯 on the rare pause. The impacts on people's livelihoods SUCKS but when placed in the context of you gotta roll with it there is an odd niceness in being forced to all collectively slow it down.", "leelanlindsay": "You do you", "sista_smash": "I’ve been bike riding and it’s the greatest quarantine escape I could dream of", "paolettabarbieri": "ciao @halemur , we are facing the exact situation here in Italy, maybe worst or who knows. the only tip I want to add is to smile everyday, things will get better and with a smile is alway better 💙", "dimplesimps": "Playing cards (Cambio) with my rent-sharer, going on bike rides, and appreciating the time to give extra love to my dogs. They can tell we’re anxious, which makes them anxious, and when they’re anxious they’re more cuddly so it’s almost a wash!", "itsashirt": "-cooking meals i did not have the time to make -movies at home from the endless list i have been writing down to watch - morning run - fixing buttons on my shirts  Greetings from Greece! Stay safe and sound🧡", "carliiigrace": "as a college student who supports themselves through teaching, this is mega financially stressful. I feel for small business owners, teachers, etc. who are in my same situation :/ making art for fun helps me feel calm and like myself again. I have very little control over life right now but I can create some goodness!", "casamiradorguatape": "Thank you for this 🌺", "rachsig": "Puzzles! Books! Baking", "chrisdavidmitchell": "Unrelated but what New Balance shoes are these? @halemur", "pawla68": "Baking and cleaning and watching documentaries", "stinevincent": "Sorry you're sick. Have you gotten tested?", "hllylyns": "Twitter/Trump/death 😂👌", "stephanibi": "💕", "katersrichmond": "I’ve just finished a period of 14 days self-isolating in my room (I live in a flat share so I wasn’t allowed into the rest of the house) and I found that getting dressed into proper clothes (not just loungewear) and opening the windows wide in my room every morning really helped me feel better. Also, keeping my space well organised, like all my food supplies in one corner, my books in another - I think this is important for anyone who has to isolate in a small space like a bedroom or studio apartment. And yes, try to avoid too much news! I went outside for the first time yesterday and the post-apocalyptic scenes that I’d cooked up in my head after two weeks of twitter and constant news scrolling was not the reality. The streets were quiet and some shop shelves were empty, sure, but it wasn’t end of the world territory. I think that’s incredibly important to remember if you’re prone to catastrophising.", "instaslambert": "I straight up deleted Twitter from my phone & feel like an elephant has been removed from my chest. I also went on a run yesterday even though I wasn’t feeling it bc weather this week will be bad & I knew I’d regret not getting some sun time", "eileenplaehn": "👏🏻💓", "catiebeatty": "It’s been equal parts crying and deep cleaning. I feel hopeless and scared, but definitely better when I’m outside. It’s comforting to know we’re all in this together.", "thewardrobeinstitute": "Having a good kitchen disco 💃🏻 baking 💞💞💞🏄🏻‍♀️ sending love from Ireland 🇮🇪", "anghelcristiana": "I started making to do lists and adding even small stuff like taking my vitamins, making my bed, etc in order to feel productive every day even when i am not doing much. Also yoga classes on youtube and online courses on different topics have been helping me.", "kelleyreierson": "Those of us who live alone and are single are really feeling this thing, hard. I’ve been utilizing FaceTime and Instagram lives to do stupid and funny shit with my friends virtually, and it has helped a lot. Also yes, I went out for a trail run today because outside is generally safe, and I’m really glad I did that. I’m having a hard time keeping my phone at a distance when it’s my only connection to other humans rn.", "zoeellenk": "💖", "beritbelen": "Very excited for you to get into Left Hand of Darkness ITS SO GOOD. 🙃", "karaewilson": "Focusing on the sound of someone’s voice when they’re talking has helped me stay present and less anxious! Small thing but still", "gabriellegetty": "Skype party", "lean__cat": "a homebody’s dream", "superbhuti": "Haley you are lovely 💜🌻", "mariahrvy": "I don’t want to make it worse, but my family in Italy say that what’s difficult is also that you can’t do anything (like fix things at home, learn how to do something) because shops aren’t open and you can’t buy supplies. So, maybe before/in case that full lockdown happens, may be worth planning what to do if the situation gets worse", "thepennyjarker": "I’m in Seattle, where we’ve been quarantined for a couple of weeks now. It’s double hard since the weather isn’t great this time of year - so you can’t go for a walk or a hike or sit in a park or something. We’ll all get through this!", "francisca_alvimb": "Great tips Haley!! Thanks!!! Putting music that you like and dance to it is also helping me forget about this whole caos. Thank God for music 😊✨", "annehillsboro": "I am focusing on daily meditation, walks outside, dancing to great music, reading the books on my pile of “to read”, and deep cleaning my house. I’m over 60 and have a compromised immune system and PTSD. But we all have our stories and challenges. Taking it one day at a time ❤️🌈", "saltysadie": "thank youuuu I needed a list like this <3", "rachelmariaofficial": "❤️❤️❤️❤️❤️", "crashstein": "ima take a walk will send pics 🍕", "ellie.baran": "Rearranging furniture or even a bookshelf. Moving things around is a cost free way to refresh your space and pass the time!", "leahbannister_": "Pretending I’m a house cat ✔️💯😻", "brittanyrhoa": "Yes, yes, and YES."}