{"frl.juzi": "Put too much oil on my freshly washed wet hair, dried it, but it’s so oily I almost washed it again", "teresacruzburillo": "Feeling blue but i guess it’s the new normal", "torimuser": "so cute 😭💖", "bad_art_and_weirdo_ideas": "every time i look at one of your photos you remind me of someone and i just realised it's doris finsecker from fame. it's honestly uncanny", "omgyeswow": "Quarantine level = making an extremely literal playlist about telephone calls to avoid cleaning", "dianalatigra": "Hungover 😵 and wanting a greasy taco.", "francisca_alvimb": "Realized I don’t even need my phone or other tabs to distract me from writing my thesis. Today looking through the window was enough. Or doodling circles and lines in a post it. A whole new world", "ziiropa": "🍊🍊🍊", "solarose": "hanging laundry to procrastinate writing my master’s thesis, sitting down to write, only to get up five minutes later because I’m sure there are dishes that need to be washed and /then/ I’ll start writing", "lauralhansen": "Today my energy was fidgety so I went on the rooftop and snoozed in the sun for 20 minutes. Then felt well enough to get back to work", "shexfixingherhair": "My quarantine energy today is \"stay in pijamas all day (despite the looks of my family), i know is thursday and i'm doing home office\" hahaha", "bykristylin": "My energy is i can’t wait to use the Dyson V10 I asked my mom to get to vacuum my childhood home while they’re not here. My favorite post-meal activity of late! Bonus is it weans me away from screens. Also made a waffle sandwich cuz was craving shake shack", "sparklejams": "This is so wholesomeeeee", "cloudyceiling": "art.", "o.therem": "taking pictures of my boobs to distract from the absurdity of complete loneliness in isolation. oh and eating cake 🍰", "alexakennedy_10": "😍😍", "julio.thornberry_": "@halemur 🧸🧚🏾✨💕", "a.a.a.a.a.a.a.co": "❤️❤️❤️❤️❤️❤️❤️", "sarah_sin_nombre": "My energy today is “when I’m not making art for tik tok, I’m just a pile of bones laying in bed waiting to be re-arranged”", "iivviivviivv": "Yessss", "abiquail": "After a maddening 6th attempt to do something for work that seems to be failing for the sake of failing I slammed my computer shut and stared at snow for 30 minutes followed by eating a Boston cream donut from last night", "left__boob": "lying on the floor w Paul Simon and my laptop, occasionally doing a leg lift or 2 for exercise, waiting for Slack to ding", "jonimitchellsbigtoe": "would love to be a mouse asleep in the gentle caress of the wave in ur hair", "catherine_saintsiena": "I really love this v gentle pic 🍊", "fivepointsjen": "I made a really fancy lunch (taking 45 minutes to make a sandwich), then had a good cry on the couch where my six year old exclaimed “I’ve never seen you cry before!” and now I’m escaping into the comments on Instagram for a bit before I pull it together for the second half of the day. Rinse and repeat.", "amy.debevoise": "Meditated while cupping my pet bird in my palms", "hollymcarlisle": "Just went live painting for 45 minutes and mostly talked about my pants.", "lararosebudbeauty": "Eating frozen peach slices, and constantly rewinding my audiobook bc i keep maniacally texting instead of listening. Concentration is shot in quar", "ronnihayden": "mining for coins on club penguin while drinking my black coffee and eating a blueberry bagel with whipped cream cheese and cinnamon. perpetually avoiding writing my senior thesis", "shmaulina": "Request for skincare regimen plz!! 🙆🏻‍♀️", "donohue_mary": "I’m just looking online for a spring scented candle and the description of, “smells like second dates” is making me very upset. It’s simply not helpful at all.", "heyitsmemaddybee": "Awaking at 4am for my nightly pandemic panic and eating Easter eggs to soothe me (it's a super cute ritual that my brain and i have got going on now, she just wakes me up, no alarm necessary)", "rawanahhh": "i had coffee cake slathered in almond butter for breakfast during my morning staff meeting, in which we spent half the time having a pet parade (official agenda item)—everyone showed off their pet and explained their personalities", "leandramcohen\nVerified": "Verified", "liabeau": "Fetal position on the couch in my workout clothes waiting for the “right moment” to lace my shoes up and move my body.", "jessicamordacq": "I did all the MR thoughtline outfit prompts in one morning but exclusively used the clothes in my parents’ closets. Then I put every kind of meat and cheese in my fridge on a sandwich", "jldaden": "my new favorite pastime is watching my robot vacuum Guy roam and bump around, I contemplated buying a $28 speckled vessel to house toothbrushes, and I'm wearing a boys' baseball shirt which means I've perfected the intersection of WFH/business-casual/chore-ready", "natashabarrault": "Beautiful light and clementine and you 💙🧡", "carolinesays__": "I spent all the quarters with the state logos from the 90s that I still had from childhood to do laundry in my shitty apartment complex washer dryer because I didn’t want to go to the corner store just to get change.", "madibrianna": "\"try on every item in wardrobe\"", "brittany__grace": "Ate a cold flour tortilla followed by a Zero candy bar I’ve been hiding from self since Christmas. While laying on the sofa staring out window and wondering if the tortilla would’ve been good wrapped around candy bar? 🤔", "alexis_meld": "accidental Renaissance painting", "ajt42": "reveling in every single one of these comments while eating the honestly mediocre brownies that I made at midnight last night (w my laptop sitting untouched right next to me) 🤕🤕", "cwcwc": "Quarantine energy today was deep cleaning the fridge and completely missing a meeting (by accident)", "emilygamb": "put on jeans for the first time since quar started to sit on my couch and work/eat baby carrots", "harperin18": "A tender blessing for the TL!", "emm.ill.lee": "dressing up for the birds and thinking about how to turn bread into soup", "roserump": "Wanting to go for a hike with my best friend and drink wine on a mountain top energy.", "jn.rae": "drinking yet another clementine san pellegrino and angrily waiting for my broken collarbone to heal", "__________selma__________": "Believe it or not but I do have a clementine picture myself 🍊", "emilyszasz": "Lookin at pics of my mom bc I miss her (she’s fine just in california lmao)", "allisonfilice": "Re-microwaving my coffee for the 4th time energy over here ☕️✨", "89x.timewarp": "Your skin looks amazing, do you have a routine?", "caroreusse": "rotating btw three beverages / lying stretched out on couch in attempt to thwart mysterious recurring sharp pain in stomach", "lydia_c_snapp": "So zen ✨", "aubreehayward": "Marathoning Wes Anderson films because I feel very un-stylish and un-spunky myself", "denuhm": "spending 20 minutes designing something for an assignment, then deciding i’ve worked plenty hard enough and not doing anything else for the whole day", "erinvandermeer": "I thought I was the master when it comes to ways to procrastinate about writing, but clearly not. Posing with fruit in good light? That’s advanced level.", "bbyreis": "lying on my bed while having a deep listening of some shoegaze album, or essentially pretending i'm 14 years old again as a form of escapism", "zavala_lexi": "planning an online “awards” ceremony for me and some friends (black tie of course)", "gyanyankovich": "Chiming in to say your hair looks GREAT", "thecoreycorinne": "Mine is I should clean the house but I would rather sit down instead and do nothing", "theairbudfanclub": "Making tortillas to avoid literally any work at all", "franmedici_": "Writing to avoid doing a photoshoot. How ironic", "nicoliogi": "I am reinterpreting a cookie recipe through collage", "elsa_snyder": "Prepping to bake chocolate chip cookies on my “lunch break”.", "caitlin_sowers": "Spent an unnecessary extra five minutes applying bronzer before sitting down at my desk... #relate", "harlingross\nVerified": "Verified", "orgallant": "extra ordinaire", "marijke220": "Wearing new clothes in bed, because we all need some balance.", "sofiamaame": "You look regal 😍", "ashlie_elsewhere": "Baking (Pillsbury, lets be real) biscuits because I have energy, only to eat so many biscuits that I need a nap.", "ookioh\nVerified": "Verified", "simone.rabenold": "Currently applying long fake nails to feel fancy and tap on things. 💅🏻", "caitrinbogart": "hair is glowing peel is shining", "themaidofhorror": "I have done a whole photo shoot that involves tomato earrings...", "morgangamblin": "Eating mike and Ike’s in bed listening to wine and crime to lazily avoid my daily walk", "davenport.caro": "mine is “doing a yoga session after being emotionally drained by one zoom call”", "emlouiselittler": "Painting my nails to pick it all off an hour later 🙃", "superbhuti": "You look absolutely gorgeous and the colour in the eye is brighter than ever 💜", "thegreatterrific": "Put my duvet cover on inside out and told myself it was fine and left it. Then went for a walk around the block and wore my mask upside down to see what it would feel like, asked myself, “is this fine?” Will flip cover to the right side when I get home.", "katarinacohen": "Wow I’m emotional", "ksheacal": "✨After seeing this I’m hankering for some double mint gum💚💚", "neysameows": "Put some cinnamon in my cold brew to add some spice to life", "tropicalkiwi": "Downloaded a cloud font and made a birthday card, with clip art", "meccajw": "“ate a clementine while watching sex in the city“", "metamorcitrus": "👀👀👀", "betsyd123": "hair lookin 👌🏼", "matchabeer": "your skin looks flawless", "tessding": "Rationing my Girl Guide cookies", "kathrynballinger": "Spent over half an hour doing my hair this morning (a once-every-six-months occurrence) because something needed to be different.", "emilyedwards": "I am: trying to figure out if I should put my pistachio shells back in the vessel, get a new vessel, or just leave the shells on the table. 🐚🐚", "sandamamina": "Twins clementines 👌🥰", "alliemarge": "anxiously bought a bundle of clementines this morning @ target", "crunchylunchbox": "not to apply pressure to that bruise but your writing has been such a tonic", "rhymespriebus": "Wow who’s your friend", "jodileighlawrence": "“frying eggs one at a time in silence pretending to be productive”", "shirin_sharma": "🧡🧡🧡", "shoesuedeblues": "I’ve also been doing soothing fruit photography! I’m not included as the subject but still highly recommend even if you aren’t avoiding responsibilities", "moriah.q": "My quarantine energy was extremely chaotic this morning when I thought about buying a piercing gun on Amazon even though I have bad metal allergies!!", "lauren_goldstein": "Today I checked every pen in my house to see if it still worked", "madizzleizcool": "Ur hair looks really nice", "emilysinger": "i am: the trash bag stuck on a tree branch outside of my window is the most engrossing thing in the world rn", "elizabeth_marchetti_writes": "Sounds familiar! Ended up reorganizing my kitchen cupboard when all I wanted was to write...", "acapellafreejazz": "Repeatedly calling “we need more info” unemployment while serenely staring at my sourdough starter", "marinepysh": "Seriously searching for the neighbor who cooks delicious cakes with his/her window open to avoid working", "haley___james": "\"saying 'hello and thank you so much for being here' to the newly blossomed tree branches out my window to avoid writing\"", "throwyou": "This is when your pilates teacher say “pretend you have a mandarin under your chin” looks like"}