{"susana.ines": "Unreal", "maxhield": "Hands off the hot praline baby", "ashley_tibbits": "My first job as well!!", "julianotchild": "This is literally my childhood baskin robbins", "cowgirlsmoliv": "omg you’re from mountain view?? i live in los altos lol", "robynsatermironov": "Wowowowow 👏🏻👏🏻now I want some gold medal ribbon 😊", "wanyizee": "You're giving me olympic gold medal vibes", "syd.b.syd": "The Baskin Robbins in MV was my go to ice cream place for years!", "jpbolles": "❤️", "pbd.tbd": "@christas.13 lol", "floralfish": "Long sleeve under short sleeve 🔥", "balancebymolly": "YAY AREAAAAAAA", "chaiandpieco": "oh wow bay area kid! born and raised in san jose 🤍", "michelle_lada": "Omg you’re a Bay Area bb?? That makes me so happy 🥰", "amy.debevoise": "My partner and I are hoping to move there from SF soon!", "sparklejams": "Omg lol", "paigelabuda": "Worked at the Los Altos one! True adolescent Hell 💛", "meierlemon": "I used to live right by the MV Baskin Robbins!!! I love that area :)", "_klmckee": "No reference to the fact that you could recite every flavor from memory, in order of placement within the ice cream case?! That was a true skill 😏", "emilysugihara": "This was also my first job.", "christinehamiltonschmidt": "Just read your newsletter for the first time, love it 💗 I also worked at Baskin Robbins when I was 15-17 so this post hits me in the feels (and my wrists...omg, scooping).", "mallowsoftgoods": "Top-notch newsletter this week! My shoulders literally relaxed when I read the last sentence of the second paragraph. Thanks for always helping me feel less alone. ✨✨", "stumpymanatee": "I love everything about this ❤️ also devoured the newsletter as soon as it hit my inbox! What is that weird thing you're grating into the ice cream? We don't have BR in Australia 🤔", "tangino": "IM SO JEALOUS!!!! That was my dream job!! 😂", "lisanivenphillips": "This week’s email 👍🏼👌🏼💯💪🏻🙌🏼", "caroznyc": "So cute! Your younger self would be so proud of your cool life ✌🏻 Also everyone wanted to work there in h.s.!!", "archiethediva": "Omg loving the low rise khakis!! 😅😅", "yvonnevbocci": "🙌🙌🙌🙌", "simone.rabenold": "Working out insecurities from 16 has been a regular quarantine pastime. I too scooped ice cream. 😂", "mtgriffy": "Were you an alumnus, or alumna? 😚", "dsppr_cmpltly": "You’re a South Bay kid? I knew I liked you. Love always, an East Bay kid vía Toronto.", "notorious_lrbc": "How can I read it!", "megklein": "I worked there when I was 16 too!😂🍦", "heykackie": "I worked at Cold Stone. Baskin Robbins is so much better. Can you still eat their ice cream or is it like, never again 😳", "justintmoran\nVerified": "Verified", "meglawrencelee": "Have most definitely been to that very Baskin Robbins 😂", "akvilemarch": "😁", "leighfeather": "Me at 16 too!", "mayatatiana": "Wow as a former Dunkin’ Donuts employee (and proud, lol) who seriously looks up to u, I have never felt more seen. Can’t wait to read the newsletter 💕", "blobbybloherty": "10/10 would cheat off this gurls homework and take a bullet for this GÜRL!!!!!", "habermonkey": "@jenfh", "lauban": "Omf", "katieallie": "this is... everything I didn’t know I needed this morning", "rhymespriebus": "Love this fitpic", "lmac_namara": "I fn love BR wow", "katfromdenver": "Hot Praline Caramel is my new drag name.", "_indigocherry": "I love her", "susan_alexandra\nVerified": "Verified", "missdiyakatyal": "I opened it the minute it hit and then came here to say THANKS IN PERSON!", "katarinacohen": "SCREAMS"}