{"asaprafff": "Armpits 😩😍", "lyonfalls": "I went a year without shaving and it was so challenging/illuminating/freeing/hard. Sometimes I shave. Sometimes I wax. Sometimes I let it grow wild. And someone will be unhappy/uncomfortable with all of these choices. Eff it! Your body (hair), your choice! Also, isn't it weird and cool to feel the breeze ruffle your pit hair? 😬🙈", "keithbersonphoto": "Great commentary. ✌🏼🙌🏼", "kwoehl": "@crazycatlady4eva", "branchingoff": "Thank you for this. I feel lighter reading your words, words that accurately capture the on going battle I have with my own body hair. 🙈", "lesugarmorehoney": "You just described last last few weeks... I am thinking of it as something that I am currently experimenting on -after all it’s hair..just hair. You look great 👍", "jriippi": "@benriippi", "noelledaily": "This is so perfectly said and encapsulates so much of what I feel about all these things ❤🙌 concering body hair- sometimes I shave, sometimes I don't .. And it should be no one's business but my own when I'm hairy or hairless at any given moment. My current body hair length doesn't define me. 🔥👏❤", "missee_found_you": "Hi there! You seem pretty cool. Would ♥️ to work with you!! Send us a DM to our main account @missee_uk 💌for details 🌈 Don’t forget to mention @missee_found_you 😉", "aklld": "@witherbee", "vi.veapparel": "Naturally beautiful", "lily_wolk": "I love it! Much respect", "doongdoong27": "@yuriestgratuite", "zurihodari": "i like how much money i save by not shaving", "yas_celepi": "@esencelepi", "zazajuliette": "@pienveerman !!!!", "nikki.welty": "@specialtoast1 you should follow her", "thecamper.lover": "👏", "mirarezac11": "Well this is just great :)", "breighlrobbins": "This is so much bigger than body hair. Wow. Thank you for writing this. Thinking all the thoughts!", "karinasembe": "now this is an articulate stance👌🏽", "emmagolka": "This is truly beautiful!", "ruyiskandar": "❤️❤️❤️", "niinajl": "♥️", "phoebelovatt\nVerified": "Verified", "grammarnyc": "I so totally relate to this! Thank you for sharing ❤️", "alfarfala": "Beautifully put - and there isn't a line in there that I don't relate to.", "wearwithallvintage": "I’ve never heard this articulated in such a sharp and honest way. Thanks for writing and sharing these thoughts. ❤️", "barbershop888": "Love you love your pits", "gossipallie": "👏🏼💕💕", "fvrfahrenheit": "@dadimdum nh bulu ketek", "nadiazoe": "😍😍😍", "adrianareitzema": "@katherine_dekock", "bridgethcasey": "🌷 needed this today/this summer as I eye my tank tops and go through allllll of these thoughts", "natalieethomson": "@holly_should great post! Ps I've been thinking of you all the time lately, like every day. Let's hang out?", "dailydiamonds": "Cute ❤️", "carolinarezcastro": "@mondadoricarol leia o texto quando tiver tempo, vale a pena !", "leilajanewatson": "A few years ago I was on holiday a with a ridiculously beautiful bunch of people, and was really struggling with comparison. My ‘fuck it’ moment of empowerment was deciding to stop wearing makeup, and force myself to stop comparing, competing & conforming. One of the most liberating weeks of my life.", "lucegoose84": "You are fab. Not quite brave enough to do this myself yet for various reasons but inspired. X", "notcydneyaustralia": "same girl", "sup_itshannah": "Gosh, this is said SO perfectly. I also have the experience of jumping to defend myself when I forget or choose not to shave my legs before putting on shorts, or my underarms before wearing a bathing suit - but I’m not nearly as articulate as you with my response. Thank you for these words.", "_alenemarie": "I haven’t shaved my armpits in YEARS! I don’t find it necessary and shaving sucks and when it grows back it’s all itchy and annoying and I’d rather just have some nice lovely hair tufts 💖 it’s partially out of laziness, partially to make a statement. The beauty standards women face are RIDICULOUS, why does it matter if I have some hair here when it doesn’t matter for men at all! It’s very annoying and my father still makes comments about it sometimes (I love him but I also ignore him a lot) bc ultimately it’s my body, my choice. Hairy armpit sisters for life 💖🌟", "chickpeaz": "Same!", "foresmeforever": "This resonates with me so hard ! Putting a lot of things I feel about beauty and my bod and my hairy armpits into great words. ❤️", "samantha.caff": "@halemur moving me to tears yet again! Thank you for sharing your powerful voice! I think many of us are balls of contradiction trying to figure out what we individually believe in, what makes us feel beautiful outside of the pressures and societal norms. I applaud you for exploring your beauty in this way 👏💪", "tirafire": "I wish I had this level of self-love at your age! You’re beautiful, I bow to you🙌🏻🙏🏻", "izaakazanei": "We love you 🙏🏽", "weihsinyen": "👏👏👍", "byjodi": "I love this so much.", "sungyena": "I too haven’t been shaving for several years now. But it’s because I’m lazy, there isn’t much to shave to begin with, and there’s been little to no consequence from it 💁🏻‍♀️ it just don’t matter none", "breecaggiati": "Honestly, exactly my sentiments Haley.", "feegross": "🙌🏻Amen.", "tylda_": "Words of wisdom! 👏 Thank you for sharing, @halemur!", "nataliastajcic": "A really valuable post- thank you for sharing your well formed thoughts on this topic. Very inspiring 🧡", "asiatomeny": "Fuck. You are so well spoken and have articulated things I couldn’t name for myself. Fuck yes with being real, with being self accepting. This was inspiring and you’re using your platform, a platform as dumb and shitty as Instagram, to actually evoke life and love toward ourselves. Thank you so much!!!!", "remycerri": "@swagnation3000", "iratxedemunain": "👏👏👏", "catarinawfonseca": "amazing as always ⚡️", "rachelmariaofficial": "Thank you!", "madismall": "Beautiful words:)", "gemmalilliann": "my role model @hollylawrence_", "morganausterweil": "They’re so cute! Get it girl!", "cjkeys2": "You’re a rockstar", "rmremedio": "👏👏", "micatnite": "A non-act!", "xia0xia0chen": "🥐🥐🥐🥐🥐🥐🥐", "cobniski": "👏 👏 👏", "sofiageorgeny": "Go girl 🙏🏼", "stessicajeele": "❤️❤️❤️", "shanawalt": "✨ love this and thank you for your writing. Consistently challenges and changes me while at the same time making me feel like I’m not alone", "leslieprice": "Teach me how to selfie pls", "taraannxx": "👌", "lellita_": "You go girl 💪🏼😍😘 fuck gendered rules of body hair maintenance, your body your choice! Xxx", "rinnykin": "👌", "megnesmith": "Thank you for you.", "janemekik": "Thank you for this ✨", "kimyxxi": "Love!💝💐👏", "azkashahid": "💚", "iamcalib_": "I stopped shaving about 9 months ago. You put my own thoughts and feelings into such eloquent words! Thank you for sharing. Each woman who takes this little stand makes it easier for more women to take even bigger and better stands. 💗", "_charismaticmegafauna": "🙏🙏🙏 i haven’t shaved for a decade and it still feels isolating sometimes. the best feeling is when i’m far away from my friends/town where i know plenty of other hairy women and i see a stranger with armpit hair and immediately feel connected and supported.💘 hell yeah, haley!", "marisaaud": "So well said🙏🏼", "holly_should": "@natalieethomson", "hjfernald": "I love you 🙌🏾", "butzinina": "I can't believe I just read a caption of the length of a novel and it's just about hair... couldn't care less. Namaste 🙏🏼", "sofiabarclay": "Beautifully put ✌🏽", "summermosher": "this means a lot. well said!! I stand with you 1000000%", "rebecca.port": "@selbydalton", "tiggington": "Yes. All of this. I haven’t shaved my pits since I was 20 (in 30s now). I am neutral about body hair, but gender norms - and specifically, internalised female beauty standards - mean I now can’t get shave, out of principle! The only (rare) negative comments I’ve ever had were from women, and they don’t even recognise why they have a negative view. ‘Doesn’t your boyfriend mind? Mine would hate it’ 🤦🏼‍♀️ aaaaaaaand they are the reason I have to keep my party pits, because so many people are brainwashed that we have to actively challenge these toxic norms.", "katerinapsoma": "Well, I red the “novel” as a comment puts it and foubd it capturing on a aubject of non interest to me. Very well thought and written. It just made me contemplate on the subject! Chapeau!!!!", "anabeldm9": "You really captured the whole thing perfectly. I’ve always waffled with this decision and recently went back to natural. You’re the best!", "maddyalford": "Very well said .", "laurajcl": "I actually really like this photo! Just so genuine☄️", "laceypirelli": "Please write that book 🙏😘", "martinezbarbara": "tldr photo's nuff said", "razelwood": "Ugh, needed this 🙏🏼🙏🏼", "bmmxi": "I have a recurrent dream of me leaving the house in a miniskirt with hairy legs. None makes fun of my legs, none even looks at them... but I still feel really unconfortable in the dream. I don't think I will ever be able to do it in the real world unless I have to run for my life 😔", "mokalafaire": "Seeing other women with body hair gives me confidence re: my own. Because it is still such a rarity (at least where I'm living rn) that I sometimes internalize those \"ew hair\" thoughts. I stopped shaving after being around women who did not shave, but I've moved and now I barely see body hair on women. Which kinda makes me feel some responsibility to contribute to the normalization, maybe if other women see that is possible they will decide to stop shaving at least to try it.", "kelseylyss": "This is awesome! I stopped shaving this past year because my skin is so sensitive and no combination of hair removal except laser has made the regrowth anything but painful. I feel very neutral towards my body hair. I neither love it nor hate it, but am painfully aware of how hairy I am (more so than the average lady) and am getting very nervous for summertime and shorts!", "blacke.ned": "Jaanam😑🔥", "hyphyhip": "I’ve been doing the same since pregnant and having a baby! Only because I forget , but it’s so liberating to not actually have to think about it !", "okbibliomama": "I stopped shaving my body hair 20 years ago. Love it!", "bojana_med": "👐😢❤", "vonverena\nVerified": "Verified", "livchristine": "👏🏼👏🏼", "off.rhyme.clothing": "Amen. Going through something similar with other societal beauty norms and loving the terrifying freedom of stepping into the tension.", "georgia_jessamine": "This is a really nicely articulated post, and super appreciated 😊agree on every level 👍🏼", "imaginedragqueens": "Haley ur the best🙏", "gretalausch": "I’m way too sweaty of a person so not shaving is not an option for me lol, but I do admire your choice not to do so!!! Takes guts, honestly. Way to go! Love love love it.", "lei.mcc": "This verbalizes everything I’ve been struggling with so perfectly! Thanks for sharing!", "missvint": "WRITE A GODDAMNED BOOK", "jemimapuddles7": "Amen!", "mharvey92": "@velvetinsideout thought this was nice:)", "dauria": "@irenekuanwood oh hi Irene! see you this weekend in Indianola? @halemur I’m with you on this journey and I’ve yet to commit to the leg hair and have come to realize how much I enjoy shaping and grooming my pithair as much as I style the clothes on my bed. Sometimes wild, sometimes with edged into a tidy triangle. Sometimes long sometimes buzzed short. All are beautiful!", "sammyazanza": "👏🏼👏🏼👏🏼", "nabelo": "♥️👏🏻👏🏻😘", "valeveee": "Yesssss omg me too", "evicko31": "#deep", "basedoncaffeine": "👏🏽👏🏽👏🏽💐💐💐", "ruby__nightingale": "🙏🙌", "sara_king_moura": "That’s is why I follow you @halemur 👑", "harlingross\nVerified": "Verified", "a1dance07": "Girl you are a peice of art and I love it! You stand for who you are and what makes you who you are and that's what really matters. You're beautiful! ❤️", "luisacarlotto": "love love love this", "ahofmaenner": "Beautiful, thanks for this. We need more people like you who try to challenge these conventions, even if it’s not easy. I wish we can start accepting and embracing body hair again.", "hannahkelley": "You are amazing and so inspiring Haley!!🌸", "puffoabsurdo": "Yeah i know it’s not a choice cuz i still feel self-conscious about it. But the difference is I do (don’t do it) even though half the time I feel the instinct to shave it off to feel “cleaner”", "luis_sconza": "Body hair is beautiful, always 💜", "jaimegelpi": "@sarahballi", "girlpwr4prez": "👏🏼👏🏼👏🏼👏🏼", "alwaysdianalynn": "You do you girl. I’m a shaver but I’m also lucky enough to naturally not be hairy.", "edurnerc": "♥️", "julialuisa": "@halemur you should share this with @ladypithair !!", "whoevenislizzie": "Fuck yeah I love this", "kneesinwater": "🙌🏽", "mapillski": "BADASS 💖", "kareninanu": "I feel the same! ❤", "jessicakaykeller": "Abso-fucking-lutely!", "saakshikaushik": "I absolutely adore this, Hayley. Thank YOU! 💓", "mollyylongg": "@lanesstillnotfamous", "christinamoravec": "Long, short, shaved, bleached: hair is not that important. Frankly, looks aren’t that important. Think about it: influential men often don’t have looks on their side. Therefore, no matter your body hair situation, I most appreciate your courage to write. While beauty standards are redefined within a century (if not decade) your words are forever. ❤️ Thank you.", "chloefortunato": "Literal human bean 💙", "rachgarb": "Yes!!!!!!!!!!!!!", "irenekuanwood": "🙌🙌🙌🙌love this (also hi I met you at mike and calla’s, last year maybe? Have very much enjoyed following along since🤗❤️", "immyguest": "@nhorgan amen", "glessers": "👸🏼 👑 🔥", "reginabiss": "❤️", "wanyizee": "❤️❤️❤️❤️❤️❤️❤️", "onportequoi": "@marianagreen Kind of what we were talking about?", "juliannalee": "@brunakater", "heathylou": "@iamcalib_ 💕", "cleme_barkley": "🧡🧡🧡", "anabeatrizrosa1": "haley ❤️ thats why you have fans from brazil 💫", "musselae": "❤️❤️❤️", "ohbeabea": "❤️❤️❤️❤️", "v.bianca.s": "Thank you.", "amit_aaronson": "You go girl!❤️", "maddiepinetree": "Yes!!! I feel very much the same way. Thank you for sharing! ❤️", "misshayes": "@freeyourpits 💪🏼💪🏼💪🏼", "picsofcynthia": "how do you always hit the nail on the head?", "stoperin": "@dnielle_pf", "thegreatterrific": "❤️✊🏼", "chelcwilliams": "I stopped shaving my pits about a year ago, tried it recently & got a rash so bad that I swore never to shave them again", "indyeatsworld": "ur my role model", "ines_sercelj": "Oh I feel you on so many levels.", "justcallmemaci": "💛💛", "annerbuck": "Wow thank you for this", "zlsko": "Bookmarking to read this again and again, over and over. Thanks, gal.", "pkkozak": "♥️♥️♥️", "shelbylynnjay": "I’ve just gotten to the point where I wear tank tops with my hairy underarms and it really turns into like...idk a confidence booster tbh! Bc I don’t care what anyone else thinks! 😊 thanks for articulating it all so well!", "shoshington": "My friends and I used to have a “pit off” once a year. We’d all shave our pits at the start of the month then not shave again for four weeks. At the end of the month we would have a Pit Off party and people would win prizes for different categories such as longest hair, biggest surface area etc. It spun the issue of body hair on women around, and turned it into something fun and something to be proud of. Was also always a pretty hilarious (and boozy) day 😉. Good on you! 🙌🏼💪🏼✊🏼 I can’t wait for body hair on women to be normalized.", "joborger": "@gracelightman you will enjoy this more than sriracha", "floramckaig": "I love this! Amazingly written caption, so much respect for you!", "ay_hess": "@lburtoo", "miz_simmonz": "Yes!!! 👏🏻 👏🏻 Love this, thank you!!", "isaburkeisaburke": "man, this really sums up my experience & feelings too. thanks for sharing this!", "bodegasnacks": "Yasssssssss kween", "ginmiko": "LOVE 💓", "mp.gonzales": "@llon.a", "shannonlaurennn": "❤️", "itskellyrenee": "“And my tastes will never change as long as I give in to them” GIIIIIIIRL!!!!!", "_brismith_": "power to you!! 💪", "alyssa_freshh": "Lovethis, I’m experiencing the same thing! I also recently stopped shaving and am finding that it actually has helped me love myself more and feel more confident in my natural body. The less time I spend shaving and primping by society’s standards, the more comfortable I become in my own skin.", "sofialessio": "❤️❤️❤️", "biamorassutti": "👏👏👏👏", "madalena.pascoa": "💖", "prrisiqueira": "❤️👏🏼👏🏼👏🏼", "lindalieu": "Seeing stuff like this, honest and in process, are the little moments of encouragement when I’m feeling down that I love about social media.", "nathalialevy": "😊😊😊😊", "carlalopezstudio": "👏🏼👏🏼👏🏼", "nathaliajmag": "I feel you so much on this! I struggle too with whether or not to shave bc usually i just dont got time for that shit but i also like to feel “smooth” i always go back and forth its like a fight in my head", "ilkay_balkan": "@oykusariyer", "lenasdoodle": "Thanks for this! I’m going through the same thing w shaving and it’s great to know other people feel this way. It’s definitely a journey.", "whatlisasaid": "this sums up all of the feelings i have about my body hair!! thank you! 💕", "smeszaros": "YES! I’m doing the same & it’s a process of acknowledging so much ♥️", "gracetexter": "Thank you for this!", "chillbabealma": "yes girl 💞🐝🌿🌜🙌🏽", "samara_e_jones": "This is just what I needed to read right now. Thank you so much for sharing!!", "rachel_plates": "💛💛💛", "theandreahernandez": "Haley, this and your piece on moving on your own is such an inspiration, just wanted to let you know I've been following your journey on MR👏🏼 thank you for all that you do to bring light to these things, that even though may seem small, can really have such a big positive impact overall🙏🏻💖✨", "meganfilyk": "🧡🧡🧡", "chanstagramming": "grossssssss we do not need images of body parts or arm pits on social media", "nope.not.even.close": "🙌🏼💗🙌🏼💗🙌🏼", "glendalopez": "👏🏻❤️❤️❤️❤️❤️", "cfeldmanemison": "Bravo! I wish I was brave enough to do this. Someday", "femininejulius": "👏🏽👏🏽👏🏽", "rosepetalpistol\nVerified": "Verified", "_epicblush_": "Thank you for saying this. 💖", "oliviadodson_": "YEAH!! 💞💞"}