{"aubreehayward": "i’m not crying, you’re crying", "maryzweifel": "🙌🏽", "ewilson": "I was lucky to get stretch marks as a young teen 🙄", "herbookoffashion": "Thank you so much for posting this! Love this and we need to hear it more often!", "hello_mikaila": "🙌", "francespuerner": "@kim_massa so cool", "maggiedeeee": "@fionaedwards_", "keem_chi": "Here’s something. No man I’ve ever been with has been (at least not openly) disgusted by my stretch marks, (and I’ve had stretch marks on all parts of my bod since I knew what they were) If anything it puts a man off for a woman to harp on about her “imperfections”. So my question is, who is setting up the body standards for women? Is it real men, or fellow women, or just some small numbers of people with corporate and marketing power there to just make us feel unhappy so we will buy their shit?", "paugargan": "You are one of those people to me. Two weeks ago my favorite jeans ripped and I was totally fine with it. I didn’t feel guilty, nor blamed my gaining weight for it. They just weren’t my size anymore, and that was ok. And part of this unconscious triumph (the acceptance of my own fluctuating body) had to do with a piece you wrote for Man Repeller a while ago. It was about not wearing smaller, tight, skinny jeans anymore because they made you feel like your body wasn’t right for the jeans, when in fact it was the exact opposite. Your body is always right, that’s the lesson I learned from that story. Thank you, Haley!", "getyourfrikon": "@blossvillafuerte", "alicia_huangs": "Yesss no shame ever", "pepperandchips": "That Rihanna quote legit changed my entire life", "a_friq": "Alleluia!!!", "naivetteb": "Aaaa aa...", "ruthiskitchen": "@happymondais", "mildnarcissism": "i really really like stretch marks and always have", "virginiadediego": "When our bodies become more like earth 💖 Thanks for the reminder!!", "bdthings": "@montillapaloma", "im.passe": "@buypiessyd", "sullibration": "@amandarichter @konelson so good!", "alittlelife___": "@claudia__alice", "kaikazkats": "Creative *", "hattie_turner_": "@soft__season", "pjac0": "I love this photo and everything about this message. So happy seeing this on my feed – thanks for promoting bein’ human and bein’ real! 💘💘", "essievanz": "💛💛💛", "nathaliajmag": "Yesss!!! I agree 100% if you dont know about the @i_weigh campaign you should look into it @jameelajamilofficial is one of these woman pushing us forward and towards self-love", "bibianita": "🧡🧡🧡🧡", "creandopensamus": "🙌🏼🙌🏼", "fussyfawn": "<3", "audreyandmaya": "Vessels not projects! ❤", "aoife.a.moylan": "🙌🙌🙌", "julesxwatson": "👏🏽👏🏽👏🏽👏🏽👏🏽", "danapbarron": "🙌🏼", "hnnhdwyr": "🙌🏻", "demyfloor": "So pretty, it’s like a human marble print!", "2mychagrin_": "I LOVE finding white hairs!", "mia_colona": "Love everything about this! Thank you for sharing ❤️", "birdofthenorth": "I have old silvery stretch marks all over my arse, hips and thighs and when I gave birth in February, I was waiting for the tummy stretch marks to signify my transition. I felt like such a badass pregnant and after pushing him out that when I didn't get my stretch marks I was a bit gutted. I see them as such a symbol of womanhood and feminine strength and I wanted that, I wanted visual reminders of what my body had achieved. I do however have a fierce episiotomy scar, but I'm not going to be flashing my nethers any time soon.", "carolcarolj": "🙏🏻👏🏻", "frlbuck": "@ada.the.cat", "styledinsimplicity": "I love to view my body as a vessel as well as a project 💕", "m0rg.an": "Beautifully said ❤️", "tammytroyer": "Yeeess! I used to be mortified by my stretch marks on my thighs but I love them now. They are proof that I have lived and grown and changed and what could be more incredible or beautiful than that??", "queenmaryblair": "Amen! ❤️ and never take for granted your healthy body", "char.__.lotte": "💓💓💓", "theswanshouse": "This is pure beauty ❤️ thank you for sharing", "emiliemig": "So beautiful - both the pic and the caption 💕🌸", "onportequoi": "I spent my teens and twenties sponsoring the cosmetics industry. Now I just want to go back and give a then-myself a huge hug. Women are made believe that our worth is in our looks and it’s oh so hard to resist it. 😱 I guess it’s about taking small steps every day. Thank you @halemur for this reminder 🙏", "lauriethakkar": "Truth.", "currentlychanneling": "Thank you!", "chiara.dcruz": "Tiger stripes ladies, tiger strips 💫🙌🏻💛", "lucyanyways": "amazing 💕💕💕💕", "joofie": "❤️", "mariagabrielazu": "🙌🏻", "kvhenriksen": "I love this post! 💕", "paloma_sevilla": "Brilliant 👏🏼👏🏼👏🏼", "_emkee": "yes yes YES! 💛", "sabina_stanciucu": "“Vessels, not projects” 💜", "itsestafiesta": "I felt the same reading Beyoncé’s vogue article!", "sophiewagman": "well said!", "influencerentediada": "✨♥️🙌🏼", "dianalatigra": "Amen sister friend 💕", "tiffhartt": "@katyakup very nice but I luckily don't have stretch marks but instead cellulite!!!!!!!!!", "ciaoisaa": "@spinstahgram FLUCTUATING! HOW COOL!!", "dulcepart": "My first stretch marks came when I was in high school. I remember been 16 and asked “why me?”. They were on my thighs, breast and ass 😂 I stoped wearing shorts and anything with cleavage 🤷🏽‍♀️ It took me like 7 years to accept them (now with more on my hips). I’m glad you we are in a time where we can see as something NORMAL, because it is. 💗", "mia.loiselle": "🧡🧡🧡", "hadasdaniel": "@gaya_zolty @morvardi_ לקרוא💙", "lightboxjewelry\nVerified": "Verified", "tanjastoecklin": "💕So true and so inspiring!", "allylauk": "@niksta44 thinking of you freaking out about how amazing and beautiful pregnancy is in the Riverwood cafeteria... feel like you would appreciate this 😊", "villageluxe": "Beautiful ✨✨", "katyakup": "@tiffhartt", "amieelha": "This is wonderful 💓👏🏻", "sokkikka": "❤️❤️", "susanbenear": "“vessels, not projects” 💕", "michelafg": "thank you 👏🏽", "almostcartier": "I have @oliviamuenter to thank for this!!", "heythisispia": "stretch marks look like the pattern light makes when it's reflected by the tiny ripples on a water surface that's being moved by a summer breeze. that's why i like mine so much. it's like having a tattoo that reminds you of water and air and the sun.", "millennovator": "YES 👏🏽 had the same exact experience myself this year!", "lovelyoysterhands": "Bodies are vessels not projects! ♥️ love.", "karisxkaris": "Thank you", "very_coole": "🙌🏼 amen sister 🙏🏼", "dryrock_": "This. ❤️.", "alexandragallant": "Thank u for this 💗", "thegeminifeed": "Wow this is so powerful and well said 🙌🏼", "chiaratrabicolo": "@laura_tive", "jenjiquinji": "You go girl", "neginghaiseri": "yes yes yes", "tomorrowsmother": "Thank you @badgalriri", "dassymaisel": "Thank you! I love realizing that women are shape-shifters. 🤰🏻It’s amazing! I think it’s wild and powerful that my boobs fluctuate a cup size every month.", "nicobryo": "@nolephan", "delaney.h264": "Thank you thank you", "hannahtheonee": "Yes yes yes I love this so much!!! Posts like this make me want to teleport back in time and tell little elementary school hannah that she has the privilege of owning her body, and that she shouldn’t waste years seeing her body as a project she’s failing at fixing 💖💖💖💖💖💖💖", "slugsandsnails0": "I think this actually looks really pretty. I have them too and it seems other people have a bigger issue with them than me. They are just stripes, each one earned and well traveled and each one an important reminder that I’m evolving @halemur", "townzun": "love this", "the_kid_cat": "❤️", "ravenroxanne": "“Vessels not project” I love that line", "ivelistica": "🖤", "moodymonth": "😌🌔✨", "kris_imber": "@theimperfectwomen", "harlingross\nVerified": "Verified", "christenebarberich\nVerified": "Verified", "nabeeha_m": "❤️", "austinblakemays": "💓💓💓👏🏼👏🏼👏🏼", "thegirlinpolkadots": "♥️♥️♥️♥️♥️", "adoraolgable": "yes!!", "kimcheephoenix": "Thank you for this post. I had a mini-breakdown when I went to a fitting room at Urban Outfitters to try on some shorts...The skin on my legs sloped and rippled like the desert. It’s words like yours that keep reminding me to love all of myself.", "annaxannam": "I gained weight last year and I feel a little bit sad because I couldn’t be able to maintain my weight (I lost 16 kg 6 years ago) but now I just wanna have a healthy life, no matters if I’m chubby, I need to feel good with my body and soul, not with the beauty standards", "connieouest": "I got my first stretch marks in middle school and thought only pregnant women or women with drastic weight changes (which I wasn’t) had them, which made me feel strange and out of place. I even bought creams that were supposed to make them go away but they never worked (shocking). I’m starting to learn how to love them, they’re a fun little detail on a body filled with intricacies and zigzags (how you doin’ scolioSIS?!). 💖", "charliebrogan": "Isn't that a beautiful way to describe our bodies. Fluctuating is usually a terrifying word. When someone's weight fluctuates we've ascribed the idea of it to someone having lost control. Not that it's a symbol of a functioning bod. This is amazing and thanks for sharing. Stretch marks are rad.", "hauterogue": "thank you for this!!", "tayduen": "as someone who goes, and has gone from a size four to a size ten, back and forth, for no rhyme or reason, it’s so liberating to be like “my body is cool! it’s my body! sometimes I’m curvy and sometimes I’m not!” I recently read someone say “nothing has gotten worse since I gained weight, nothing” and that’s my truth too! I fell in love at my biggest weight, had the best year of my life at my biggest weight, I don’t have perfect self-accepting days all the time, I’ve just stopped radically hoping for a miracle to come from shame", "tamargardnerrr": "Yes! Post twins my stomach has alllll sorts of marks and ... shapes. Our bodies are magical!", "arpilpahn": "@i_weigh", "lapanza": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻 Forever and ever", "geticosmetics": "Yes 💪🏽", "mariamariiiiiia": "HELL YESS!!!!! 😍😍🎊🎊🎉🎉", "dopaminequeen_": "♥️♥️♥️♥️ beautiful, beautiful.", "caitcoopr": "YES", "steph_dontbuyherflowers": "Yeeeeaaaassss. @stylemesunday does this beautifully", "wanyizee": "Saving this post", "emilystencel": "Yesss, beautiful. 💗💗", "ajstainsby": "I’ve never been more welcome or more stretch marks, from bébés or from life 🤷🏼‍♀️👼🏼 @irena.djordj", "mserranovicente": "Love this post. Thank you from another ex-alarmed girl 😘", "rach_ehl": "@halemur thanks for writing articles that dish big sister advice 💖", "tawneemusic": "#vesselsnotprojects 🙌", "fruitybootyunderwear": "Love this 🙏🏽🙏🏽", "cleopatrasbling\nVerified": "Verified", "htxtra": "Yes!!! Yes!!!!!", "leti.sala\nVerified": "Verified", "dhwaniiparikh": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "annaleebarclay": "Had the same reaction with my stretch marks and my first grey hair last year. It reminded me of when I first started going through puberty and would check all different places of my body for change on a daily basis or have a mix of desire and dread when I would pull down my underwear to see if I started bleeding yet. I love that you call it an evolution because that’s what it is and it can be really exciting and fascinating 💕", "smashfizzle\nVerified": "Verified", "_faylyn": "brb, crying", "el_o_els": "Vessels, not projects- a mantra", "cadermac": "@i_weigh @jameelajamilofficial"}