{"beahellman": "So funny", "meaghanritchey": "I bought it within 5 mins of you posting it on Instagram. What a deal. What a cinch. It’s the most comforting warm blanket, yet I feel like I’m wearing a sackcloth of shame. I’m going to hold onto it. People will forget, and it’s so cold outside!", "andiezacher": "IT’S ZIPPERS ARE TOO SILVER! I’m dying. I thought the very same thing. The single thing that makes the coat look cheap. And yes, I totally bought one having drinks with a friend that told me about hers. Pulled out my phone and voila, I had it in two days flat.", "hamforsam": "Those shoes!!", "mari_frances_": "I love the larger fit of sizing up. I definitely don’t for sure have two different colors of it now...", "nyc_looks": "Thank you for solving the mystery! Been wondering what is this coat everybody is wearing while walking their dogs in Hudson River Park 😍😊", "bennie07": "Im obsessed with your black pants! Are they currently for sale @louandgrey ? I can only see their joggers online or a button cuff pant? Help they look so@comfortable x", "hannazeman": "I bought the coat 3 years ago when I saw a girl wearing it standing in the taxi line in front of me at LGA. I asked her where it was from and she said “Amazon” and I immediately pulled out my phone so she could verify the purchase. I loved wearing it, but after a few months, it felt too heavy, like wearing a weighted blanket. It was even worse if I found myself having to hold it at a bar. I eventually gave it away and went back to my old standard black down coats, which, although less fashionable, were far better made and less of a burden. I do sometimes see it on people and remember how much I loved it in the moment, which is a fun memory to have, without still having to own it.", "pucasabina": "Soooo to buy or not to buy? 🤔", "williamandwest": "I love this coat so much! Wearing it in LA today.", "allystantoncook": "@tassietree I kinda want this coat.", "ema_dellorto": "Never heard of that in Paris but now I want it. But it seems to be quiet bad for the 🦆 involved so... no !", "noodles3330": "Maybe you should give it to someone who needs it if you aren’t going to wear it", "maxinevsterlacci": "@kristy_viola haha", "pontnou": "I bought it in 2014 in aliexpress😱😱😱", "karen_wright_": "I just read your manrepeller article about this now famous “Amazon Coat”. Well it hit NJ hard over the past week or so. I never saw it before and four women showed up in it in one day, explaining that it’s basically warm and inexpensive and you can find it on Amazon. I too had a similar experience when the clunky Tiffany heart bracelet first came out. I thought I was the cats meow and then everyone seemed to have one. I still love it, sometimes wear it in the summertime and most recently on Valentine’s Day. Just wanted you to know how I completely connected with your story...I know the feeling.", "georgerazer": "Enjoy yourself dear 💕all I know you look so beautiful 😍💓 and I just wish am the man in your life ❣ 💞 ❤", "maiostein": "Ok how tall are you and what size did you buy?? I want to order one", "elr_pr": "🖤🖤", "valentinatoydesigner": "@bibinuit", "stacycollado": "👏🏽", "dances.with.worms": "ever since you wrote about this i suddenly started seeing it 1000 times a day. spooky", "sofia.sorce": "life style inspo ✨", "iampaigedavis": "It’s honestly a good coat no one can convince me otherwise", "fionakanga": "I honestly didn't notice this coat until you sported it. That's a good thing. Wear the coat. It's chilly outside. All will be well again.", "v.h.hammer": "\"The hem of the eiderdown garment adopts unique crumples. This was coupled with perfect stitches and manifested a unique charm of magnificence but at the same time not too overt.\"", "elli___": "I've pointed it out before but sadly this coat is a blatant copy of the fair fashion brand @embassyofbricksandlogs Lyndon coat. Get the real thing - you won't feel sorry ladies, it is a dream of a garment and by far better than the Amazon knock-off.", "karina_wears": "It looks so comfy I hope you keep wearing it! 💕", "druidso18": "Is the Acne beanie worth it??", "erincdouglas": "@jamiebugner", "park_callaghan": "It’s a good coat. Own it 💯", "alisonwunderlund": "Ah yes, in Melbourne it was the Kathmandu black puffer with the green lining. Twas everywhere. It became a meme.", "cee_stan": "👏 A+ article", "agsliongson": "Is it really warm?", "mariademetraegan": "@mkroth11 👀", "creaturegirls": "It looks like an excellent purchase to me 👀 Follow up question tho: are those MOON BOOTS? 🌙", "melaamejia": "Great read!! @halemur 💛", "girl.named.shadow": "And now I kind of want it in that exact color even though I never wear puffers. 😳", "elbritton_": "Probably gonna have to buy this now", "laurenvonglahn": "You wearing it made it cool", "laurenkranc": "@charlotteaxelrod if she can buy it I can buy it too", "ajt42": "Have honestly been waiting for this since your purchase 🤠"}