{"sparkleplenty_": "Same 🙋🏻‍♀️", "_bobandrews_": "I feel this post bigtime. I really struggle with summer gear, especially shorts- they’re my kryptonite!", "_lisamarieg": "Best camp counselor!", "tracerase": "Tevas and socks 👌👌", "jaellemg": "Is it really summer yet in NYC? Here in Montreal we are still wearing boots!", "trash_of_newyork": "Ugh dressing for summer is strange in NY. Then add an office professional layer🙄", "diannedaugelli": "Socks & rafting sandals👍🏼", "mari_frances_": "Where’s the application? 🛶⛺️", "serabozza": "@sarahgrynberg I’m trending! The school camp look is in 😂", "sisiliapiring": "I love this! All about this look. x", "masosort": "👏👌🙋 @masosort", "atosanikkhah": "❤️❤️", "synthetic7synthetic": "This is how beauty should look like", "stinevincent": "But also, there's nothing like a giant, detailed, favorite tattoo on one's thigh to make every pair of shorts feel more interesting.", "emmachjo": "Love The shorts!", "mallorysasha": "Love this outfit!!", "evyyk01": "Yaaaasss I live in this type of shorts during summers! Also, here goes to the feeling awkward in summer goes. Going to LA next week and praying it’s not too hot so I can wear long pants lol", "lurker_o_0": "A vest is next", "stripezilla": "LOVE a classic white Hanes tee!", "emmagoebbert": "@charlotte.elo why does this scream you", "melany.wlm": "@jessicafeatherself me fait penser à toi ce look", "eilidhhhf": "@emmuhuhuh shorts !! ✨🧦", "claireloup": "@halemur are you wearing the midform or the standard tevas here ? xx", "lisssrosss": "My dad called. He wants his outfit back.", "brunaandriello": "Amazing socks ❤️", "andre_assous": "We definitely want to attend your camp! 🏕️🚙", "_the_boys_club": "Finally an accurate representation of proper summer attire", "nobodyscastle": "Good kiddo 🧒🖤", "alisoncoen": "You are simply wonderful. 🧡", "raina.james": "always needing affirmation about tevas", "o_liv_ia_la": "How do you get your sleeve cuffs so clean and pressed looking?", "rushteen": "Looks comfy, cute and like something I would totally wear!", "lonesomevalleys": "@gaia.0 this is a v you outfit", "dailydougie\nVerified": "Verified", "renamcclintock": "You look like you could grill a mean burger 🍔", "silviastella_": "😍", "tessa.beck": "It’s so hard 😩 teach us", "angelaglasses": "I’m dead. And Instantly transported back to 7th grade.", "camillajacappel_jwlry": "✨✨✨", "franstreetking": "I feel like your style is changing", "cxliv": "How many pairs of Tevas are too many?", "notgigiguarino": "i strongly support socks with sandals !!!!", "quelikelly": "I dressed exactly like this twenty years ago and I was super comfortable 😎", "ashydmcv": "I thought this was me for a second", "m.sea_music": "🙌💞💞💞 Surf 🏄🏻‍♀️ that awkward wave to freedom from sweaty sweaty days 🙌 gorgeous ..", "torimuser": "looove", "mariaoculta": "@losreboludos i found your twin on insta", "meglawrencelee": "This is everything.", "jackie_nappo": "@lilzapp this outfit just cheerily shouted “Navajos!!” Before walking into a cabin destroyed by a young Lindsay Lohan", "kule\nVerified": "Verified", "rebahayes": "You look like the camp counselors in Parent Trap!", "oblomow79": "Perfect outfit for Daniel Day Lewis Birthday :-)", "satlofbedrick": "I want to wear this exact outfit every day forever", "rebeccaknavarro": "This is exactly what I wear all summer in my mind", "juliaknp": "love it! the mom in call me by your name", "liberatedxluxury": "Camp Halemer...would attend. Can it be in Madagascar?", "elishacorinne": "@daisymayk a look for you this summer", "andthenlb": "I’m so in. 🏕 ❤️", "sorayahennessy": "Haha I love the shorts 💛", "joana_staygold": "Oh I love this so much! Dora the explorer 😍", "k.witkow": "Can't wait to learn about knots", "deuxbirds": "This is how I dress 7 days a week. Obsessed", "the___remedy": "The summer outfit ideas we have gets us so pumped, but then we end up wearing the same white sneaker/ dress combo 3 days a week 😓", "rhymespriebus": "Getting Laura Dern in Jurassic Park vibes from this 💫🦖", "mallowsoftgoods": "The kind of camp counselor dreams are made of. ✨", "imnotelizabethok": "Can we make those beaded lizard keychains?", "eden.call": "Lol I’m wearing the same outfit", "carlynwhitten": "I have been waiting for this!", "rdallimo": "1,000th like"}