{"missmayatherese": "Love it. Just remember yo find an spf you enjoy using. ❤️", "kaitlyntillery": "@mohenn @coopdogg33", "sarahcocos": "Press snooze like 3 times look at Instagram /Facebook , use bathroom get dressed leave house get coffee make it to work ..", "ssettie": "@kellypgram", "reneequa": "Wow, so similar! What is the outcome of your meditation on your role in the doom? And do you think it’s possible to become a positive agent of change in that? (Asking for a friend)", "eebalish": "Thank u 4 ur brave honesty", "ekoneck": "ugh I love this (you)", "respiro_studio": "So good.", "meyeryen": "the non-negotiables are: open windows, make my ~special~ iced chai, make the bed before running out, & listen to The Daily which is almost always the same length of my commute!", "kris10paine": "I fuckinG LOVE THIS OH MY GOD", "bellsholmes_": "@chloefrances__ caption and also comments 😭", "taraannxx": "😂😂😂😂", "vull.and.noid": "Wow, this is so close to my morning routine!", "aliceisamazed": "Tu hermana perdida @carlaescareno !!!", "mtndewmomma": "do the teeth get brushed", "strawdairy": "Your writing is like a fresh breeze", "ebonywestman": "@sashapotatoes feel like you would vibe this", "bisbee704": "When I worked, I woke up at 4:50. Now that I don’t, usually 6:30 - 7:00. Brush teeth, scoop litter boxes and drink coffee while looking at iPad. Get on treadmill, shower, dress, and continue on with my day. I ALWAYS shower in the morning...impossible to dress sans shower.", "royalquietdeluxe": "there's whining involved in mine.", "jacquibr": "Thoughts and prayers for the morning dump you don’t take", "astapaque": "About the same routine..but no cat and no Twitter--I receive a news roundup by Quartz news and peruse headline/delve deeper on some things--also appreciate their random links to articles which will either make you smarter or just appear smarter with random facts and trivia. And then I go dip in a lake 🙂", "wesleysatiro": "So beautiful!!!❤️", "alchemist.sobriety": "following because of your particularly resonant take on \"likes\" on MR. thank you, Haley!", "scissorclothing": "This is magic", "less.nonsense": "Actually this reminds me I have to get a cold brew on for tomorrow. Cheers.", "laseulemarinade": "Love this im inspired", "florrie.wilson": "Is this a weekday? Man I don’t many people that get to sleep in until 8 😍🙏🏼 I need your job! Both me and my husband up before 6:30 every day", "serenetouma": "Wait what... You don’t wake up at 4am?! 😂 Hayley your morning sound all too similar to mine, thank you for making me feel normal", "occasionalhousewife": "One hour dedicated to enjoying coffee and tea (yes I do both) while swiping both Instagram and various news outlets. Then I brush my teeth, shower, and get dressed. Tiny breakfast around 11, lunch between 2-3 the European way.", "nairfromearth": "I wake up and curse existance for mornings, crawl out of bed for coffee, feed my fur children and let them outside, contemplate watching the news mainly for weather forecast and immediately repent because humanity is already in hell. Grab a blouse, a pair of pants and sneakers. Sunscreen if I remember. Put on some kpop because it is very upbeat and go to try and squeeze in my commute.", "jenoneriver": "❗️Pants first/skirt first only ❗️", "mangialimoni": "Ok I wake up, semi wash and probably wake you up in the process. I also dress pants first, do make up and locate glasses, meet u in the kitchen &take a banana to eat on the way to work. @laurajbole ?", "killertofu__": "i role out of bed and put on my boyfriend’s slacks for that authentic “boyfriend’s jeans” look but imagine it with slacks and then french press my neuroses with a fair trade brew. followed by abiding my cat’s teasing efforts to seduce me into filling up his food bowl while scrolling on instagram for 15 minutes. i take a shot of b-12 spray then i drive for 40 minutes. i’m usually late by 20 minutes.", "shopmimimiller": "Hahaha love this", "earthlingelise": "Always jealous of 9-5s... Sleeping in is 6, and not a moment later or...IM LATE I’m late for my daily date", "anjanja79": "Same, except for the cat, tap water, beanie, eye mask, photo, and podcast", "hnnhdwyr": "Amen.", "charlotteskramer": "Don't people eat breakfast..?", "michelleby": "Seems like you’re a morning person. Same. My mornings consist of waking up and experiencing a quietly mounting anxiety until I finally crack and compulsively check the gram. I Look for answers, comfort, information/inspiration most times finding 5% of one of those before getting up and stumbling around my apartment wondering what to do next. I avoid breakfast (the worst meal) finally caving and eating a plain banana or last night’s dinner scraps. I debate on showering/working out/washing hair and finally do all, a few but usually none of those things. I pull on an outfit, slick back hair put on a chunky earring, lipstick and act like I have 👏🏼it👏🏼handled👏🏼. Glad to hear this authentic and relatable routine. 😆", "priscilahdzs": "@paolocavalli lav her", "wacaycom": "Haha love your morning routine ☺️", "katerinapsoma": "Fantastic photo", "samigra": "There are ppl that don’t put pants on first??", "lxscott": "I relate to this to a T - it’s scary", "middle.june": "RELATABLE", "naedogg": "What are your favorite podcasts rn", "oral_essentials": "Oh yes 💛 How wonderful 💛", "melahnknee": "Pants first always / moisturizer & sunscreen combo as makeup ❣️❣️", "helloretro.es": "1.☕️ 6 o’clock 2.🏃‍♀️ 30 min. 3. 🚿 5 min 4. Make up 5. Outfit improvisation (10 min. caos) 6. Pants-Top-Shoes-Bag 7. Dress uniform my daughter. 7. 🚘 to office", "brokenmolar": "Donald Duck says never leave the house before eating breakfast", "snakejuicee": "\"I'm a pants first dresser\" had me shook as a person who only has regular jeans and black pants. Haley u made me realize there's more to pants than I ever knew", "moninagyova": "Wake up, bring daughter in for a feed around 6:30, delegate daughter to my partner so I can get a few mins to lie in 🙃 Make breakfast for her and I. Consume said breakfast (toast and tea). Have a shower. Think about my outfit whilst in the shower. Shoes first, cause I’m shoe deficient. Then pants, then top. Make up. Head to work/creche drop off around 9am. See ya all laterssss", "whoevenislizzie": "This is so good omg", "sukhsomething": "I read this despite being averse to the purported topic, just because you wrote it, and boy did that pay off!", "no.fomo": "I wake up 7 am. Try to either understand or forget the dream I might have had. I try to distract myself by going through my Instagram feed that triggers my anxiety enough to start working; which involves sending reminders and replying to emails. Around 8 am I’m feeling throughly anxious and decide meditate. I wash my face, put on some acne ointment, make myself breakfast and tea and pretend to be a happy stable person. By now it’s 10 am and I have no idea what’s going on. I put on sunblock- I know for sure that’s something I should do. The rest- I know I’ll have to tackle as it comes.", "edithwyoung": "EXACT same except I can’t leave the house without putting hot water with lemon on my face and drinking my serums!", "isabel.braverman": "Begrudgingly hit snooze far too many times. Force myself out of bed and into the shower (yes I’m a morning shower person). Upon leaving the shower immediately apply Indie Lee toner followed by CeraVe moisturizer (I’m a heavy moisturizer kind of gal). Choose outfit top down as inevitably my bottoms will be either black jeans or dark blue jeans (I save my fancy pants for the weekend). Drink a cup of coffee, finish getting ready, and drive to work.", "rachelshuford": "shut up this is so good", "phoebe_thom": "@iammpreston", "bridgetbadore": "Lol I love this so much", "loveofsomekind": "You are beauty you are grace", "livvylandblog": "Fantastic.😂👏🏼", "steficulafic": "How I Get It Done @thecut", "maggiemayethridge": "This is so far my favorite Instagram post ever. I just drank my toxins and contemplated mortality while looking T the new rip in my Levi’s after snuggling my (non-withholding) cat.", "katietemrowski": "@mountainthyme", "yaterss": "I’m the literal same!! Right down to the cat and tap water", "madelinmattli": "Pants first all the way. I have to say the boiling pot of rage in my stomach has subdued ever since deleting Twitter. It’s so nice not reading people’s stupid opinions on everything first thing in the morning and last thing at night! I feel like I can actually have hope again (thanks to choosing to ignore the hellscape we live in in favor of peace of mind though I realize that makes me a bit escapist😬)", "ajoyinthecity": "This is everythinggggg. 😂 💯 mine is similar but it also features me running out the door like a wild banshee bc im late, always always late 🏃🏻‍♀️", "tirafire": "I felt every second of that ❤️", "jenni_rose": "This is alarmingly close to my morning routine 😂", "brigibi": "adoro", "talorgilchrist_": "Your the best", "juliaapatton": "Same", "rhymespriebus": "I wake up on the floor & make my way to the C train via amoeboid movement. I’m crying the whole time", "_truni_": "What podcast ? 🤣", "chloestewart": "Pants first is the way to be, buddy. Shirts trip me out every day. Pants are anchoring (even though I wear weirdo pants).", "lobby.art": "What eye mask do you use?💐", "superbhuti": "My morning routine starts with reading Hailey’s articles 💜", "amandebhz": "Choosing my shoes first 😁 then outfit. Tap water, yoga and cat also part of my morning routine.", "eduardamsl": "pretty similar minus the cat plus a dog 👌🏼", "l.loob": "Honestly, same. Except for me cat=kids.", "j_kranz": "the exact same tbh", "fashionandfables": "@heyheymc so so good", "myfriendjessie": "@tcstyan", "jhogik": "this speaks to me", "sydpull": "What moisturizer do you use? Can you say more about your double moisturizing practice?", "christina_osorio": "I'm a fan of delaying getting out of bed because I'm \"mentally planning my outfit\"", "sophiajlacey": "Do you eat?", "tamzinbirch": "Incredible", "imokaygirl": "Haha 🤘🏻", "kimia.mp3": "Wild how we have the same routine, sans cat", "lilz_iii": "I relate to this on a deep level ✨💀", "traderjoespro": "This is so relatable.", "rebecca.way": "Always pants, top, shoes 👌 your routine is pretty on point minus a good morning pee especially after that cold tap water 💦", "luceing": "Brilliant", "ciellivide": "@clairemtobin ‘warble for my cat’", "chrissyshriderstudio": "Pants then shirt over here too. ⚡️", "sliceofpiazza": "lol. that’s it!!", "chateau_lolo": "👏🏼"}