{"seekerloverdreamer": "You are the creaking cutest human on the planet!!! ✖️", "colleensroche": "@bridgetfhoran creator of bando 👌🏼", "janice_ivins": "You are so awesome! I love this!", "densk_en": "Let us all realize that every bit on your list are totally beautiful 🌟 We're not meant to look all the same (unreal and photoshopped) like media is telling us to so why should anyone feel bad about their body? Please stop it if you do ☺️Honor and love it, it's an amazing thing to have! ...you rock @jengotch", "tacospastor": "💗", "adayinmae": "@lydiaandnoahbo And another...☺️ She's rad.", "lydiaandnoahbo": "@adayinmae you're right this is amazing", "allistahl": "@elzastrow @chriddieg she started shop bando and she is awesome!", "hangingwithagentcooper": "@adventurefunclub", "adventurefunclub": "@hangingwithagentcooper gotta love what we got and get the shit out of system. Easier said than done.", "stephglarsen": "@jess_lynn_11 😂", "jess_lynn_11": "😂😂😂 @stephglarsen I swear we wrote parts of this!! Didn't we have this conversation like yesterday?! The hunch back part! 😂", "ktay12": "@katherinelm gaha", "kcsrader": "@alpardue 😂", "joooelleb": "🙌🏻🙌🏻🙌🏻", "misshollylane": "@jengotch I think you look amazing!", "edye.pucciarelli": "@lizapoochie she's the funniest and the wittiest. Creep on her 😘", "karen_kaul": "You are my new favorite IG person. I'll trade your butt for my fat arms. Seriously, you can hide a butt under a skirt, but fat arms ruin every cute sleeveless thing. #ponchosaremyfriends", "field.tripp": "You are everything right on social media👏🏼👏🏼👏🏼👏🏼👏🏼", "smile_bat": "@kieralofgreen read this", "phdinwebmd": "@shutupalot this is awesome!", "leeleelives": "@annaleeporter", "jess.cervantez": "@allisonmden follow her if you don't already. She's amazing", "allisonmden": "@jessicacervantezzz followed", "leighorne": "@_katierock", "jayne_purcell": "#hero !!!! And we all just think you're an effin' doll face. But you're a dork human like us👊👯", "pure.dash": "Love this post. So beautiful a and brave 💕💕", "lovepipsticks": "You've got great f'ing elbows!!! xx", "isadorastowe": "You are gorgeous.", "jennienelson215": "This is so bold, & I love it! 🙌🏻💓 #inspiring", "evalynduke": "@ellenbosch lol just read this for letter c please", "ellenbosch": "@evalyndickerson yessss hahahah so true!!!! 🙌🏼🙌🏼", "newminimal.ism": "You are beautiful, Jen 💕", "dalyfant": "@kalliope @another_glass_wine...I 💗her", "caro.mille": "Such an inspirational post!", "r0salindagrace": "@alexgolota 😂", "liesleats": "You rock", "northstarballoons": "@athenapelton | ❤ you.", "vdalayan": "The fact that you have 100k + people looking at your posts, NOT based on your body says a lot😉😉😉 #realwomenrock", "blingwald": "Looks like one sexy lady to me!", "biancacash": "Oh lady, I love this post. Relating to this in every way. You and Gina are beautiful.", "helloiamleslie": "You're uh-mazing!! 🙌🏽❤️", "ariana__michelle": "@rorykate", "whataboutmaggie": "Thank you so much for this post. Im crying", "tiffanycanfly": "You inspire me so much! I always measure myself by my age, thinking I'm too old for this and it's too late for that. My body's changing and I can't stop it. But seeing you have fun with stuff teens love reminds me to go, fuck you age! This lady is having a blast and I should too!", "hannahacarpenter": "I freaking love you.", "maxjakubke": "Amazing 👊 you go girl! So brave. So beautiful. I feel inspired. Thank you!", "fitnuzz": "How am I just not discovering your RAD self???? Gorgeous and vibrant woman, you✨✨", "svejakri": "Hey Miss Understood, I´m from Germany and my English isn`t good, but I think it is clear, what I mean hen I am saying that you have a few key parts of the body simply forgotten. I think you have incredibly expressive eyes.Your facial expression conveys images to always feel as if you want to laugh out loud the next moment, and I love it!Do not be so hard on yourself, so important is anything but not because you transport something else in the world, can you give me and all your other followers!!!", "andiesspecialtysweets": "I dunno...looks strong and curvy to me @jengotch -Andie", "megangay": "I have that stuff behind my knees too! Where does it come from?? Living in our culture is hard, I think. So many voices... Thanks for your honesty, Jen.", "verywryly": "You inspire me just the way you are!", "li.nds.ey": "@mvillagomez4", "camiarango83": "You are amazing! Thank you for being so real!", "ashbouldin": "We all have these. But in the end we are all great. Thank you for reminding us of that @jengotch!", "athenapelton": "*having. Dammit!", "elinorsophia": "congratulations, you're a real human being!! 💖", "laurakwl": "Team #bodyacceptance 🚫 #bodyshaming 😬", "hirtsogood": "An awesome body that is living life to the fullest 😍", "vanessaholden": "Fucking love you you stone fox, and your best bitch Gina 👋🏼 hey Gina hey 👋🏼", "ohhappyday\nVerified": "Verified", "korie_conant": "@mountaingreenes I think you would appreciate.", "emeli": "You are 👏", "janelerikson": "@jengotch you're the shit.", "sgtreis": "@jengotch My post baby body has been my enemy for years (and let's be honest, so was my pre-baby body). The cellulite, the weird pooch my once somewhat reasonable looking tummy has now. I HATE wearing bathing suits and live in Florida. Haven't been to the beach all year. But you are right. My body functions. I can chase my little girl and pick her up and hug my husband and love on my dogs. It's awesome. Do I really think people at the beach are going to be traumatized to see me? Is it going to ruin their day? No. It's in my head and it's ruining my day. Time to let it go and embrace the life and body we have. Thanks for the post. You're brave. 💪🏽💖", "spookymadsen": "Thank you for this post! I think you look amazing. We are so hard on ourselves. Because of this post I let my wobbly arms be exposed for the first time in 4 years! Sleeveless in public 😱. And i survived😀 thank you!", "megoiler": "My body and my criticisms of it are much like yours @jengotch, and I've also noticed that my friends who have beautiful bodies I aspire to hate their bodies even more than I do!? We are all in it together.", "colemoser": "@lmeeh I love her.", "fvhale": "@mrs_chevalier14", "casemiroju": "🌷", "bibelotandtoken": "@jengotch, you may very well be the bravest girl in the world. #hero i haven't shown my legs in public since i was 24.", "livingthecodream": "@themonkeygirl ...I'm 5'4\"...A, B, C...tell me about it...story of my life! F & G...the kids sucked out my boobs and I swear they reappeared on my triceps as flaps!", "ladylibertyevents": "@primandpixie oh my god... This is amazing. Jen G you fucking rock!", "kortney_g": "What a fantastic post. I have spent far too much time obsessing over my body and it's time to stop! Thank you for sharing this. I love your feed.", "nomadic_habit": "Get it girl 😍", "jessrobson": "@jengotch - knee situations and cankles -- sister, I'm with ya. AND: get thee to Iceland - where the cankle is the national spirit animal and the knee bits just don't matter (mainly because there aren't shorts to be worn AND no one gives a flying fart because they all have it). #stronglegsforthewin #hiGina", "shophottiewood": "You're amazing!", "the_real_julie_mills": "Thank you for this! Sister on! 👊🏼", "_luddivina_": "I ❤️ U!!", "urbanic": "I would like to be the 335th person to say that you are awesome. (And beautiful).", "onefinea": "I look up to you so much!! This was refreshing. Mostly because I'm boobless with cankles. #germanpeasantstock🙋🏻 You're the best!! 🙌🏻", "_janelson": "You are a beautiful person. Thank you!", "mkskyton": "YOU GO GIRL!!! You're not alone in the least bit!", "krakowianka_": "Thank you for being real and sharing what I don't have the courage to share about myself! It doesn't help that I've put on 20 lbs since January. My internal struggle to accept my rolls, cellulite, and junk in my trunk and yes weird stuff behind my knees too...is somewhere between crying and screaming. One of your fans in Chicago ✌️", "printfestation": "@jengotch is a grade a babe 💯", "inkiedinkie": "@jengotch I feel the same way uncomfortable in my own skin to the point of never wearing shorts or showing my legs in public. Only at the beach will I finally do it and I feel like all my flaws are repulsive. All that we are told is not beautiful I have. I couldn't help it. I grew and they appeared. I consider myself a feminist and would never think this of anyone else but I think this of me. I'm trying to change that. You're inspiring and thank you! I see nothing wrong with your body and you look beautiful.", "daminiroy": "@jengotch you are stuffed on a planet full of awesome, that's what it is. thank you for sharing your biggest body issues/fears/secrets - you are a real inspiration who rocks heck of an electric aura 👯💜", "jamiearrigo": "@jengotch you're my hero. This made my mother effin' day 🙏🏻👌🏼😂🙏🏻👌🏼😂🙏🏻💁🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "luxeandthelady": "Wow this is so raw and refreshing!!! Thank you for sharing. We are all our own worst critics. I truly get how you feel, and sometimes I stop and wonder if 20 years from now I will wish I had just loved myself as I was while I could still function properly 😂. I don't see any of the flaws you pointed out. To me, every arrow just points to another reason you are so uniquely awesome and beautiful!!! ❤️", "ssamarks": "Your stunning!", "yourjoyologist": "You are gorgeous inside and out! You come off as so self expressed and confident in who you are! I never would have guessed you battled body image. Love yourself up like we all adore you!", "sonjarasula\nVerified": "Verified", "melaniefalick": "@suzmischer", "melismariecrane": "You are really rather lovely and bod is cute to boot! + style + humor + humility + honesty", "barbiesdaughter": "@barbiew she's amazing lol", "hardknockblythe": "@kgcarlso THIS!! All of this!!", "iamgabrielav": "You're beautiful just the way you are @jengotch", "tammythiele": "I just love you. ❤️ Relatable. Transparent. Awesome. 🎯", "themonkeygirl": "@jengotch you are beautiful! @quesogal how come we all do this...", "luly700": "I see nothing but awesome all around", "tulajeng": "@jengotch I can make an entire Instagram feed, book, film, and HBO series about this topic. You're not alone, beautiful sister! Thank you for sharing. It's a scary thing to do, but ultimately empowering! You're gorgeous inside and out 😽💕💕", "sonomacottagehome": "Love this post!", "mariaianetc": "i can't like this or you hard enough", "chickiecheeks": "well I think you are beautiful!! And I think you look good in anything! And I love love your vibe on here! 😘 @jengotch", "tweenkless": "@davidgonzo5", "studiohome": "Bodies are truly hard work for their owners to control annnnd accept, totttaaaallllly with you on that! But Jen Gotch... I've followed your sparkly world for a long long time and need you to know you have such a goooooorgeous bright beautiful face 😘🎉", "allyouneedisblush": "you are the best. 🏆", "kelseyjonestuia": "Your Amazing!!", "theshelbyhkd": "You're gorgeous. Good for you sharing this!! I hope you feel liberated and empowered, you fantastic female, you!!", "brackishphotography": "You are not fried shrimp. Or you are. I can't remember which one is good", "gina_philangee": "@jengotch I'm beyond honored that you've named a body part after me, former boss! When Gina gets sassy, call her Gine. That's what my pals do!", "sasadi": "Awesome and liberating! We should all do this and then also remind to do the same for the things that we love about our bodies too!", "amanda.oneill": "Jen you are such an inspiration and I think you are a gorgeous woman! 🚫🍤🚫", "heyamieleigh": "These thoughts have been consuming me lately. I adore your posts. Thank you for this one.", "saewhattt": "@kelseyjeanne_ @kaitkub THIS. IS. ________.", "koosna": "You're gorgeous.", "annamorrison": "@sydneymedlen", "tiffanyclarkeharrison": "@stephiec64", "stephiec64": "@tiffclarkeharrison this is everything", "jessechamberlinmarble": "Haha. I am glad I didn't make it in the crop. We would have the whole alphabet covered.", "jena_brook": "@detectronic wow", "oftenwander": "@jengotch I don't know you, just admire from afar, but you're the cats pajamas, and I admire you everyday. 💁", "mysweetpippin": "Practically perfect in every way❤️", "ohjoy\nVerified": "Verified", "lilyglass": "Body be bangin'!", "rchl.x": "👍🏻👍🏻", "thecitychroma": "Girl, you so pretty. Work what you've got!", "juliannys": "@jadystiu_sf love it!! Podemos hacer algo así con las chicas!", "tiltleather": "All of our bodies hit the skids....fuck it. But a wicked sense of humor let's you sachet into a Golden Girl territory. You are hilarious.", "mia_helms": "You are SO damn cute!!!!!", "miquelasuazo": "@natasharansom I love this!", "gorettiarnaste": "Olé! 💃🏻❤️", "instatracey": "I love this, and you!", "brooke_yamen": "Shame on you! You are gorgeous... And hilarious so that has to count for something? Right? 😙", "blogacavolo.it": "Thanks...now i don't hate my ass And my cellulite!", "mskittydelight": "@gyasenchak check this girl out she rocks", "gyasenchak": "I love it!! We should all be this brave", "sammyrush": "@lardoley love this and what she has to say about cankles", "jefferytx15": "Bless you.", "everyonceinawhileisparkle": "Hated my body at 105 and still do at 160. Now I want to be back at 140. Probably still won't be happy. Sigh....", "nicolebenk": "@cateracheff yep pretty much love her.", "mickellemccrory": "Wow you're way too hard on yourself!! As is everyone. Can't even see some of these \"flaws\" and I feel like I'm taking crazy pills", "kitlitmit": "Hahaha no way!! Ur body is boom chicka boww woww! Love smaller boobs FYI! And I totes thought u were 5'8- ur so proportional!! I look short even though I am 5'8. *I will end this post before my body analysis rant*", "ohhhkris": "This is amazing!!! Isn't it \"funny\" how when I see photos of you I think things like, \"love her style\", \"wish I could pull that outfit off\", \"she always looks gorgeous and more importantly happy\"!!! Thank you for sharing this. It's HUGE and reminds me I'm really okay too.....!", "iriscferrier": "You are loved for WHO you are not the physical image you project😍", "sherryb": "@brookecast love this ❤️", "miss_kristen": "Bravo! This is brave and you are awesome. It's so funny how we see ourselves so much more harshly than anybody else sees us. When I look at you I think, \"awesome figure!\" Even though that shouldn't matter, it's more that the body works rather than how it looks. Still, those things affect our self-esteem. Thank you for sharing, I think you are a true inspiration.", "colletteqwitz": "Thanks Jen. You are a Super Fox.", "kendalltwilson": "Omg Jen are we twins?? This could be a photo of me, and I 200% know how you feel about everything you mentioned. Cankles--why?! 😭 Thanks for putting this out there. You are awesome ❤️😎", "theyoufinder": "You are beautiful inside and out. XIX", "oleanderandpalm": "Thanks for this!", "sarahrogarrigan": "Bravo!!!!👏🏻👏🏻👏🏻. We can be our worts enemies!! WTF...only one life and so many sizes!!!", "_marelle_": "And you are always so well dressed you appear as a supermodel!! @jengotch", "i_like_dresses": "This. is. amazing. Didn't think I could appreciate you any more but then THIS happened 🙌🏻", "4oclockapple": "@momjeans98", "arlettemauro": "@jengotch I have a list too. I totally know how you feel. But f that list. You are awesome and lovely and your body is beautiful.", "donnaweathersart": "You are awesome and brave! Thank you for being an inspiration to us all!💋💋💋", "laurenjonas_": "I think this is something every woman can relate to no matter what shape or size. Thank you for posting this, Jen! So great meeting you at the popup a few weeks ago! ❤️", "paperboats11": "Recognizing it's our body, our home, even if we're not in love with all of it at all times and that it's okay! We are all wonderful human beings! We need to learn how to love ourselves better ❤️", "petuniasaur": "@alilaputka 💗her and 💗 u", "rebkapix": "😂😂😂💨", "vannah_tea": "A. No way around it? Sounds like you need to take up roller derby. We celebrate that!!", "heatherhale": "But where is your other arm?!😮", "pepacobos": "@sr.pedromora que huevos! Y ya era hora de alguien que dijese la verdad. Se puede ser estupenda así!", "kamacatchme": "❤️ perfect", "laurenvirden": "This is amazing! It seems so cathartic! You're hilarious AND you have a great bod.", "drjamie14": "u have owned beauty since you were a day old. a perfect child grown into a perfect woman. your frankness makes me accept my flaws. u r blessed with the most wonderful gifts. i am blessed to be your mom soodles", "natasharansom": "@miquelasuazo", "clechristi": "Aw man. \"That one time I hated my body for 43 years.\" Beauty is truth, truth beauty. You are inspiringly beautiful. ✌🏼", "colleenadunn": "So inspiring! Thank you for posting this.", "senoritaelena": "@licicox Right?!! Ha!", "emilykaplowitz": "@colleenadunn amazing. @mercedes_arlana healthy and strong 💪🏼", "blairmarie": "Love this love you @jengotch", "karissanickish": "You are the best. I want to be you when I grow up.", "findingvintage": "I once took a screen shot of you because I loved your haircut and wanted to show my stylist! I also think your beautiful face and energy had something to do with it. : )", "taraswasti": "For years I thought I was frustrated with my body because it did not fit the ideal I had in my head. More recently I am coming to realize that the root of this frustration is that the body is inherently limited. No matter what, my body will never be able to convey the fullness of who I am. Because that information is too big to contain!!", "litwillia": "I didn't even notice any of those things. Even after u point them out they don't look bad!", "aliciapeat_watson": "@jenikacuadra @peatjessica @kendallkz love your body any way it is 😘 here's to Vegas and stuffing into swimsuits poolside.. Err and chowing down at the buffet/Jell-O shots/yardsticks of sugary alcohol", "jenikacuadra": "@aliciapeat f*cking LOVE this! Thank you 😘 Cheers to next weekend gals! @peatjessica @kendallkz", "axelhoney": "AMEN 💗💗💗. \"That’s why I think it’s hilarious if someone says my body looks masculine or something, I’m like; Listen, just because my body was developed for something other than f*cking millionaires, doesn’t mean it’s masculine. I think it’s femininely badass as f*ck because there’s not a single muscle on body that isn’t for a purpose because I’m not a do nothin’ bitch.\" - Rhonda Rousey", "oilandcork": "You're the coolest. A-H simply don't matter since your effortless coolness factor surpasses all.", "nancysalz": "@wearemodernancients you're cool! Love that last line!!!!", "mandyofish": "You're amazing!!", "satellitestyle": "Amen sister!", "ktthornton": "@chrishilliardtina @maddiefang she is everything I ever dream of being", "courtney_denise": "You are hands down one of my favorite people to follow on insta!! Keep rocking! 🙌🏻💁🏼", "sarahthorne": "I second @scoutphotography but could never say that so gracefully! I look forward to every @jengotch post and picture for their humor and insight. I want to be you when I grow up (even though I'm grown up already:)", "field_trip_travel": "You're perfect, don't change", "kittykittymeowmeow345": "Girlll your so hott!!! @jengotch", "nfijen": "Best post I have read in a long while on IG! Bodies come in all shapes and sizes and the only thing that truly matters is our health. Thank you for reminding me 🙌", "cheekybeakcardco": "Literally one of the cutest women I know. BODY INCLUDED.", "roadsideflorist": "You are my spirit animal🙌 My love handles and I thank you for this!", "teamwoodnote": "you are a powerhouse. love this so fucking much.", "catherineblubaugh": "I'm so afraid of turning into a hunch back! I naturally don't have good posture and it keeps me up at night too", "montavingre": "@jengotch you are absolutely gorgeous and your body is beaut! ;)", "abspjvc": "Hahahaha!!! This is perfect @emilyemckenna", "rebekkah_drake": "FUCK YEAH GIRL, fuck yeah.", "sophiejaneee": "Beautiful bod!", "gabywinters": "Your body functioning well is all you'll ever need👍", "lynzey": "YES! Trying to recover from hating my post- baby body and remember that he loves me whether or not (and its most definitely not) I have a flat stomach or can fit into my pre-pregnancy clothes.", "angela.placencia": "Real Talk! Love it! Own it, accept it, love it!", "anderwilson": "@amandaadamsfit THIS!!! 🙌🏽", "elyseash": "It pains me to know you struggle with body image since you seem like such a kickass, savvy, hilarious entrepreneur with all the glittery bells and fart whistles. So many of us admire your creativity and boldness and knowing you too struggle with this is heart breaking since I know so many of us only see the bold artistic badass bitch you are and none of the lumps or bumps you think you have. Thank you for sharing since so many of us are in this sad lonely leaky body shaming boat...but damn girl...you're the coolest. Fuck this shit.", "meganmraz": "@jengotch - you are an amazing woman.", "le.voile.sacre": "It feels valid when I pick myself apart, but so silly when someone else does. Ready to let it go too, thank you for speaking up! ♥♥", "che_marie": "The world loves you right now.", "_wanderandwonder_": "Here is what we see: 1) fantastic sense of humor that can make a person bust out laughing from a single sentence 2) amazing thick beautiful wavy goddess hair 3) cute as a button nose 4) strong arms, especially for holding up friends when they need it most 5) boobs that are just the right size for non-sagging perky youthfulness for years to come 6) A beautiful waist to hip ratio that says I am female and don't fucking forget it 7) A glorious ass that drives your guy wild 8) leg muscles that keep you always moving onward and upward 9) delicate and beautiful feet that keep you standing during the toughest times 10) and then there are the million things found inside of you that make you amazing, unique, inspiring, bold, brave, funny, loving, loyal, humble, creative, supportive, honest, kind, and much much more. this is what we see when we look at you.", "colourmeclassic": "My stomach is my favorite asset as well. Are you Norwegian by chance? We have a similar body type", "chelsannalexander": "@smidge_ck", "nantuck3t": "You go girl. Inspiration for us all.", "itsjustsarahknight": "We always see the flaws in ourselves. If you posted that pic without any arrows, my first thought would have been, \"wow, she looks so great\". Thanks for being brave!👏🏻", "soloparami": "Exactly how I feel everyday! Thank you ❤️❤️❤️", "mrsmaris": "Want to tell you something, there is more to us than our bodies. How about the beauty and joy you exude with your style. I would say we have similar body shapes, but you are my fashion icon. I love how you dress and the beauty you exude. We can focus on a pudge or a cellulite here and there but it's a part of being real. And what I love is that your beauty is real. I adore your style and keep being the awesome, beautiful and inspiring lady that you are!", "zilpaints": "You're beautiful!! 🎉", "hglyman": "Cellulite you mother fucker!! 😂😂🙌🏽 she is so inspirational. @biancagax", "adi__80": "@juliemarie.r 😂 best", "marimarianamedeiros": "I think you look fantastic!!", "kneesinwater": "You are just the most fun. 😂 BUT here's hoping your experiment worked and that those very untrue thoughts are now banished for good.", "ayaladeer": "You're brave and beautiful", "mishalulu": "You are a beauty! You inspire me!", "sddullanty": "You are so inspirational in every way shape and form. 💖", "jennapilant": "I think you're beautiful = inside and out!", "meg.g.w": "@jengotch my goodness you're gold for this", "conchabelle": "Thank you for being so candid!! I love it! I personally think you look great!! And regarding the sneaker situation, sometimes you just have to say Fuck It!! Now go and get some tennis shoes and rock em' without socks!!", "moniqueneethling": "Wish I was more like you! Cheers sister!", "sweetmonn": "Love you so much. #higina", "anndanger": "❤️❤️❤️ I can't believe the arms tho, you have the best always-fit arms no matter what. Love you.", "leader1000": "More people like this in the world please", "phillipsandgilliganinteriors": "@jayne_u This is why I love @jengotch", "shawnapalomino": "@ramsey82", "sydney.r.harrison": "I looked at this photo and saw beauty, yet as I read, you described every single insecurity I have. Sometimes a different perspective can change your life. Thank you, beautiful.❤️", "jessicalacie": "You are beauty, rock that body!! 💗", "bribop2": "@courtdigg", "giuliettanicole": "THANK YOU, MOST BEAUTIFUL @jengotch ❤️", "jengotch\nVerified": "Verified", "vanessa.robinson.kim": "@sbhowlett 🙌🏻👏🏼", "ditavonmarple": "💖💖💖your a fabulous lady💖💖💖", "jessicaschwalje": "Hahahaha @emilyemckenna this is spectacular. As I'm sitting here in my bikini, wishing myself to have a beer but am trying to be \"good.\" This came at a perfect time lol", "hjwhite2": "@jesslikesbooks @allisonnyskies yesssss", "debracowie": "You are a delight @jengotch", "emilyemckenna": "@jessicaschwalje @abr00kelifts please read this in entirety 😂😂 so good. So us. At least we're not alone 💁🏼😂", "laurenxlboogiee": "You are spectacular 😍😎😘", "loriannfree": "Uh yeah, me too...but what are you sposed to be anyway. A withering willow? Live! Live in tennies without socks, girl 💅🏻", "pantonemagenta": "I just love you! You are such an inspiration for me! 💗💗💗", "nessanot": "I. Hi Gina! @la_miamia 👋🏼👋🏼😂😂", "meghanmcneer": "You look great!!!", "aiyshasinclair": "Wow. Thank you for sharing this post! I truly admire you. I've been following you posts for some time now and have been inspired by how true you are to yourself as a business woman with style. 👍🏾💕", "lea__mazet": "So good ! 👌", "elisa_robertson": "@desjalee", "iwantmythunder": "I feel you. So hard. Thanks for posting this ❤️✨💕", "puckkonings": "Geweldig @nikkihesius", "julietrx": "@juliaberard ✋✋", "tarawhitney": "🙌🙌🙌🙌🙌🙌🙌your bod is great, lady. Mad props for posting this, doing so will give other women the idea/strength/braveness to feel the same way.", "eralda": "@jengotch wow, now I like you even more! What a cool person are you! 🙌🏻", "saramoon": "You look great! 👙Thanks for sharing the insecurities we all have. And I'll bet you had more fun playing than worrying, I could learn something from you! 💕💕💕💕💕💕💕💕💕💕💕💕💕💕", "igs_studio": "We women hold ourselves to impossible standards that haunt us our whole lives.", "held_am_herd": "❤️❤️❤️", "sarawenokur": "💓💓💕💓💕", "hilllllll": "Hot damn, you are so brave and beautiful. I get down on my body sometimes, too, but it's me and it's the only one I got. Rock on girl friend ✨", "kkmar": "You're my favorite!!! 💗💋", "maddyandthegspots": "#amen #girlpower #itsyourlife", "emilyannbaumann": "@carolyneallen well she's officially the best.", "claramgest": "Such a sweet, inspiring message! way to go! 💖 self love is the only path! You are beautiful and kind and caring and awesome. Treat yourself with the love you deserve ✨", "clog_talk": "I think you look amazing ❤️", "sophielynnmorris": "Lol these aren't \"flaws\" omg", "6a1axy": "💪💪💪💪💖💖💖💖💖💖💖💖💖💖💖💖💖💖", "mrso": "You look gorgeous! Yes, you do!", "gwdub": "I just feel like labeling it just adds to the shaming", "tina_tambourina": "Thank you so much for sharing! We are our own worst critics and we all have things we dislike about our bodies but none of those things stop us from being badass beautiful fun creative ladies!", "losergirlwins": "🙌🏻🙌🏻🙌🏻", "frosting_freak": "@singinglibrarian pertinent to last night's convo", "garnettjewelry": "This! This post! Your honesty! The truth you share about how we as women, as humans, body hate on ourselves💔 I'm about to hit the pool myself and hated what just went through my head as I was getting my suit on-thanks for boosting me up and making me feel like less of a jerk! Our bodies are strong and powerful and what right is it of ours to hate on them?!", "saminagram": "You are the best! And so beautiful!", "interiordiyer": "Jen, you are such an inspiration. While my gut reaction is to tell you you're beautiful, I understand what it is to be someone who hates how they look. You are my power animal. I've been thinking of making a sweater that says that. Just you wait.", "moonuponastick": "I guess we are all in boats of self loathing no matter what our body shape is but at the end of the day, you are loved for you, right? I mean how else would you have a following of a bajillion people. Everybody loves you! I have conversations that start out with, did you see what Jen Gotch said? And we are all trying to keep our wine in our glasses as we laugh. I think you are beautiful, funny as hell (is that a saying because why is hell funny?), and I most assuredly wish we were friends. I totally admire your honesty and braveness for this. 💪🏼🌸🍉🍭🍦🍷", "jenleonard_": "You're a beauty. Thanks for sharing! 💗", "kgirleats": "@wonkyp I love her!", "megspon": "I have just recently decided to do the same thing. Love myself and be healthy and exercise but really accept who I am", "sidracarder": "You are just so wonderful. Thank you for sharing, I think maybe our body hate/shame will never go away but at least we all feel it on different levels universally. And hi Gina.", "btoshner": "Dude, you're the coolest. And such a babe. 🙌🎈✨💗", "aklimton": "You are one amazing woman❤️", "megekele": "Hmm...I'd just like to say...obviously I don't \"know\" you and for the record...I'm into dudes but I think you're hot and I'd tap it.", "karinacaan": "Go to @stylelikeu videos! they saved my life 💘", "sarahkyleclose": "Man mine would go to Z 😁", "brittneegregory": "@carolinh Timely. ☺️ Read the comments! 👍🏻", "parkstudio_la": "You're simply amazing!!!", "thescarfandstripe": "@akfishingrn I love this. Let's love our bodies -", "lovejoleen": "F is one rockin' muscle, lady! 😊", "sarikathakorlal": "Keep going @jengotch you on the right track to self appreciation. You are fabulous and hot, but even if you were less hot it's still important to remember that you have eyes, ears and voice that work. 4 limbs, all present and correct. An excellent brain. That's all we all really need. It's so important for all of us to pull that bar back down and get a reality check. As I said to a friend today: you might not like the look of your thigh gap, but at least you can fucking see it!! Bravo!", "jennyeveryday": "🏆💖", "kaitmynameiskait": "@ambrosia0909 I love her!!", "linnyfriend": "@jonnahumphries @o.ssa ❤️", "alexgolota": "@r0salindagrace ha", "illustrated__girl": "@jengotch when I'm 43 I wanna be like you, rocking baby pink hair❤✌", "zellerbecky": "👊🏻", "lauraplouzek": "You're all kinds of amazing. I've been replacing my \"I have a huge butt and I need to eat less ice cream\" self-talk with \"I'm so freaking lucky to have a healthy body that lets me eat ice cream\" self-talk. Because- bodies are amazing!!!! And ice cream needs to be eaten!!!!!", "anyhoo04": "Ummm..F?! I'm jelly of your lovely toned arms! Now, you need to make a list of what you DO like.", "jaimejofisher": "💗", "mellllama": "You rule and so does this pic. Good for you", "riananelson": "Everything I have ever thought. Thank you for being brave!!!!!! 💕✨ you are way cool!!!! And beautiful inside & out.", "malty_k": "We have the same body type and you've inspired me to wear the bright fun clothes I always wanted instead of black. Cankles for lyfe! 🍤🍤", "michsmoore": "you're just the fucking coolest", "rikkiannevk": "❤️", "holliebygolly_": "This is why I'm so glad I don't have daughters-my body image issues would totally fuck them in the head.You're my hero! Your bravery and humor are inspiring 😍", "__eleanorhope": "I was looking at your picture + thinking how STRONG + powerful built your body looked. Not at all the little things you pointed out. We are our own worse critic, right? Thank you for being so bold + inspiring. I think I'll do this same thing in hopes to love my body too.i appreciate you're refreshing honesty. 😘 @jengotch", "milliedugger": "I want to be like you when I grow up!👏🏼👏🏼👏🏼", "sprucetoninn": "Aw girl. You look gooooooos! Truly. But here's to being honest with you friends (and Internet friends). You're hilarious and hot!", "chezlesbruynes": "I do not see you like that 😂 ! I think you are an inspiration for many of us 💗", "lacesinyourfaces": "@snowsef", "kikibarthart": "That is every thought I have ever had!, but I think you look amazing!! We are too hard on ourselves. So sad.", "isagiuliani": "@lelingiuliani ja tenes que seguir a esta persona!", "yoamo305": "Brave + Beautiful ❤️👊🏻", "catherinemasi": "Perspective can be a damn bitch. I saw this photo and immediately thought, \"oh she's so pretty!\" And then I thought how beautiful you are because you are (delightfully) genuine, inspiring, and strong. Plus, I mean, check out the number of people who love the shit out of you. I think that's pretty awesome. Now go enjoy your day💛", "ashtangi.atx": "😍", "supkate": "You have a phenomenal body and are otherwise gorgeous inside and out. Thank you for sharing this post tho, it took a lot to put yourself out there!", "biancagax": "@hglyman love her!", "designdeamore": "You go girl! @jweische inspired 💪", "mollydansby": "You are beautiful! I had a baby 5 months ago and my body is totally busted from it! Still. This made me laugh because yours looks pretty perfect! 👌", "julia_orr": "Because you look so good and you should be comfortable in the great skin you are in", "saramlyons": "you look great and you ARE great! 💗💗💗💗💗💗💗💗💗💗💗", "hannahlouloulou": "It's always interesting to hear another person's internal dialogue- bc I saw this and was like dayum! I didn't see any flaws! But thank u for this post bc the world is so harsh on one another but individually we can be really self deprecating and that's so painful it's hard to remember", "artedemirar": "Hahaha! You are amazing 💕", "_bethany": "I feel the same way towards my body... always have, and it's exhausting. turning 30 in a few months, dreaming of entering my 30s a little kinder to myself.", "holanichole": "You're beautiful! Please start following @healthyisthenewskinny. She's helped me with my body image issues TREMENDOUSLY... I wish I'd had a friend like @katiehwillcox growing up!", "detectronic": "@briennewalsh @jena_brook @la_geoconda", "le.georgia": "Just beautiful 💓", "jessicabennettglotfelty": "Girl! You are gorgeous inside and out! You are seriously one of the funniest humans on IG, and not to mention a babe! Own it!", "megan.cullinane": "Amazing. Seriously loved this and made me think about my own body issues.", "annamaejones": "@kaleywarren @crystakholmes", "eclecticwoman": "You're the coolest girl in all the land @jengotch . Nobody is perfect. NO BODY is perfect.", "sabrinaleena": "🙌🙌👏👏👏👏", "fdfounddesign": "Uh hello you're gorgeous & so is your wit! I totally agree with C.", "amandarosezamp": "🙌", "pandpcarmel": "@burst_bloom You mad my life by telling me about her.", "kbuzzy": "Looks great to me!!", "sueno_shop": "Your gorgeous and I love the new body trend, acceptance! Be healthy, strive for a for body, but there's no need to compare yourself to others! 😘", "melindajosie": "💜💛💚💙", "alex_haines": "@bradwidener", "licicox": "I hear ya! @senoritaelena", "jonnavalente": "@linnyfriend @o.ssa", "littlearrowshop": "Jen, 86% of the time your posts are totally in line with whatever is happening in my life. I've also had body issues my entire life. To add insult to injury, as I get closer to 40 my body has changed in ways that I am not comfortable with... The cellulite gets worse and wtf is up with the sagging skin?! Sorry if this is tmi but I started menopause at 35 and have seen a drastic decline since. Truth is I want to get in shape and tackle my ass, thighs, back, upper arms and now stomach (which was also always my confident body part) but I have no clue where to even start. Thank you for posting this photo. Your courage continues to inspire me. 💕 ps: I think you're beautiful.", "mamajustice": "Thank you for the honesty & it's humor. Man, we all have our shit don't we? Universal shit.", "sarahanneder": "Oh my goodness! I have always thought that you are cute as can be, very funky and cool, and so super funny to boot (but I totally get this and don't want to trivialize your insecurities!). 😘😘😘", "joiebutter": "I freaking love you! (in a non creeping way) 💪🏼👊🏼🙌🏼👏🏼", "juniperbriggs": "Such a brave share @jengotch !!! 🙌🏻 I feel us girl! We all do it and it sucks because we are our own worst critics and it robs us of feeling good in our own skin! For the record I think you have beautiful body. Just sayin. 💕", "a_j_zed": "So brave! Thanks for this! 👍 More of us women need to own our badassness :)", "lacey_tom": "😍😍😍", "kellydorandoran": "@melodyinharmony @katiegums love it", "logro73": "Powerful!", "positivix": "🙌🏼🙅🏻👏🏻 And: total 🔥🚨babe-alert🚨🔥", "winkwinkstudio": "You're a complete babe, with talent and wit for dayz. This post was my favorite of yours so far (and it's hard to beat your other gems that give me giggle breaks throughout my long dirty diaper changing days). Thanks for keeping it real💫👊🏼✌🏼️👏🏼", "missjonesie": "Absolutely gorgeous 💕", "dontpanicdeanna": "You're the best, Jen! Thanks for the reminder", "labontefullofgrace": "You're awesome!", "tstarrstar": "You're beautiful!", "miiinasaccone": "Love this post. You are beautiful!!! ❤️ @jengotch", "bneatobar": "A thousand likes ❤️❤️❤️", "momoratcliffe": "Which makes you all the more beautiful! LOVE.", "mistyperryman": "Thank you.", "sheaesnider": "\"It totally functions\", how amazing is that!!! Your body has been created to let you be able to do all the wonderful things you do every day 💗", "thefrecklyfox": "You're amazing!", "nutmegandhoneybee\nVerified": "Verified", "jonsgaardmama": "Thank you for being honest, real, transparent and hilarious. Lets stop shaming ourselves", "laurendelthompson": "@jengotch I love how you put it all out there girl! You are beautiful and your humor is one of a kind! Oh and hey Gina!!! 😂👋🏻", "northwest.space": "Reason #1,876,469 why you are 💣", "samantha.r.martin": "This is amazing @jengotch 🙌🏼🙌🏼", "rhondajenkins": "Love this 😊 thanks for sharing @jengotch You are a superstar 💪🏼", "denai_jones": "you made me laugh out loud again, own it. you forgot your heart and humor, the best assets!", "chubbystick": "Thanks Jen for keeping it real 👏 The feeling sucks but it's what we have and we have to love it first. ❤️", "ankefieldchicken": "💜💛💚💙", "heymartycrispin": "💛", "tradialobravo": "@enecasiyo amé esto", "dejafriesen": "@littlealexa @torisswanson @benji_min @urykah @rockpaperscissorscreative #bodythoughts", "52catsgirl": "You are beautiful!", "gretchenmariehunt": "You are beautiful. Your energy & flashes of color brighten my spirit", "sodapoppr": "I was just having this conversation this morning after beating myself up for gaining a few pounds. You are beautiful & awesome! Thank you for being real, honest and brave. 🙌🏻", "jenniferannriley": "So real. I love this post! 🙏🏻💪🏻"}