{"yakirav": "Lmao I love this bitch @_giographic @nancyjvillalobos", "lisarpalmer": "@amykryansf @kaytkate", "mommyjade": "@trishates 😂", "kaytkate": "@lisarpalmer 💓her and now following 👆🏃", "ashleygoldberg": "💛", "crisa.t": "I always wondered...side note: tinted lashes are always great!😊", "the_style_eyes_life": "Thank you!!! I needed to hear that. Now let's get back to work!!! Maybe after just one last handful of Doritos. 😉", "imlauramiller": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️😎", "erinmccu": "@annamc214 wow. this is incredible", "sarahinnebraska": "@lasertron", "402meg": "Adore you.", "abbersnail": "Thank you for sharing - I've had a landslide of these days lately. It's nice to feel less alone.", "lucky44_": "Love this. I had my meltdown a few weeks ago. Consequently had some frank discussions with my sister and myself and my husband and made some cracking decisions. Decisions I've been sitting on for a while. I cried the ugly cry for hours. I felt like I'd been to three funerals. I needed it. I needed the outpouring of emotions! I hope you feel better xxx thanks for keepin it real. It's not all roses #instareal", "axelhoney": "Hot dayum. Yes. XOXO", "morgangeorgie": "@carriekiefer", "mariakamaradesign": "I so appreciate and am inspired by your honesty! Thank you.", "angemillerart": "@jengotch this has to be the most beautiful thing I've seen yet on IG. BLESS you 😘💕✨", "helloalexfulton": "Real life. You are tops you know that.", "amaliqbal": "@jengotch this is why you are so amazing! Thanks for the honestly and for the beautiful things you create! 🙌🏽💛", "emymunoz": "@paperanddetails I feel her 😓", "rhiphil": "@thesentimentalistatl omg. Sound familiar 😜", "luna.lexei.lady": "Awesomeness~ur a total inspiration! Keep goin gorgeous! Xox", "everblissapp": "Inspiration ❤️", "muddysbakeshop": "Ok, so not to be a total stalker, but I was cruising your feed for some haircut inspiration and noticed this post. I know it's almost a year old now, but I can't tell you how grateful I am for your sharing. I started my business 8 years ago just wanting to be a baker in a little neighborhood bakery and now I'm CEO of a 54 person team. It's amazing but so much harder- physically, mentally, and emotionally- than I could've dreamed. And today the reason I'm stalking my style role models is an attempt to distract myself briefly from feeling completely overwhelmed and under qualified. So I think I was meant to style stalk you today as I needed the reassurance that none of us is alone in these feelings. Thanks for being so open and God bless!", "lindseyleifken": "@chelsealeifken", "idreamofkelly": "😘", "aimeemichelle3": "Thank you for your honesty-you rock✌🏼️", "valleycruisepress": "Thanks for following he honesty @jengotch! We've been there too 👏👏", "lilygracebennett": "@graceannbennett", "realbrookewhite\nVerified": "Verified", "ohhhkris": "If you only knew what an inspiration you are!", "chelsealeifken": "@lindseyleifken she is everything / this is everything / so real", "casemiroju": "🌷", "danpellegrino": "I'm sending you something that will definitely cheer you up!", "megmadonna": "Are u sisters w/ Bri from design loveliest???????", "ilootpaperie": "❤️❤️❤️❤️❤️", "barbcasaroli": "@casamanita", "shopgirl0007": "Hang in there, Jen! 💛 lashes look great! 😊", "merniemern": "@axmbakes moral of the story, tint your lashes. 😭", "jengotch\nVerified": "Verified", "thymecafeandmarket": "So honest and so true!!", "instantlyframed": "💞", "roperitovintageflor": "@jengotch nooooo! Keep doing that magical thing that you know how to do: @shopbando! You are a referent for us! Love from Argentina!", "positivelypresent": "You are brave! 💕", "trishates": "@mommyjade It's okay ❤️", "lizlibre": "❤️ reminds me of the book The Hard Thing About Hard Things @jengotch Hang in there!! 🙌", "shoppersonify": "We need the honesty. Thanks. 🌿", "butters.3": "Lol real insta post @georgia_harvey", "swissmiss": "Thank you for keeping it real.", "didemyadadidemhanim": "It's okey.💖👍", "lauraleeswanson": "She is awesome @jessikarabbet", "reemz": "@lhurley22 so real. (Also love the Doritos haha)", "laurenmotz": "@lhurley22 love love love.", "annhowellbullard": "Love you! 😘", "rachelawnaylor": "Hang in there woman!!", "_bloomchickabloom_": "So amazing. Thank you for having courage, and sharing.", "theobservatorydc": "Glad to know I'm in good company and not the only one who reaches for some Cool Ranch Doritos in times of stress! I often down a cupcake or two as well.", "calliopepaperie": "Thanks for sharing, girlie! I live too far away to come to your sessions and join the Honor Roll. This is just as good.", "bkershaw": "@zebcarlson ❤️", "em_keller_logan": "Love your honesty. So important to be honest about failure. It happens. To all of the big companies and the small ones. Responding to it the right way is the hardest thing but it's what actually matters! Keep it up boss lady!", "kamkamcamcam": "@bsbelle yes, cry, do, cry, build, scream, cheer...run in circles", "stleonardsmoderngoods": "Omg!!!! Typo idiot city!!! Your post resonates with me.as a small business owner I often wonder why I continue, can I continue, do I have the strength to keep taking the knockbacks, and then when you do stand tall and face them,you know it's all worthwhile xxxx", "crum_b": "Bb", "missprinty": "💕💗💖💕💗", "cassieholmes808": "💕💕", "amandamteixeira": "Keep going girl", "vanessaholden": "It's that bitch Gina amirite? Runaway with a vendetta/ bad to the bone. Your eyelashes tho' - girl! #keepintrucking x", "littledrill": "💪💕", "missdomm": "Superhero.✔️", "pengilly_textiles": "@lmw123 it's OK 😊", "bsbelle": "@kamkamcamcam", "anahata_joy": "@marysiazoe @imsarahjackson so cool. Teary bosses rule! ❤️", "blownawayca": "Today \"Bye Felicia...\" Tomorrow \"Hi my name is Jen!\"", "angelahurtmusic": "Hang in there @jengotch & THANK YOU 4 your honesty.", "streicherhair\nVerified": "Verified", "hedleyandbennett\nVerified": "Verified", "margauxelliott": "you're the best.", "ldykathryn": "Mam, I am in my 30's with adult acne. Let's talk.", "tina_tambourina": "Thank you so much for sharing this. Sometimes you just need to have a moment before you can pick yourself up and move on I'm due for a good cry. I left a good job and my whole family in NYC in January to move out here to LA, thinking it would be fun and exciting. Instead it's been one wrong turn after another (I've got 2 college degrees and a fan-freaking-tastic résumé and can't find a damn full time job in this state!). Still, everyday I count my blessings, do my best, and hope for improvement!", "thecheekydarling": "A creative person keeps a big head space to run around, and fill up but head spaces are for one (unless you have a twin conjoined at the head of course...) but those big spaces can have cold echo-y moments growing/ or maybe birthing something new 💋", "verogingras": "Thanks for sharing the good ans the hard moments.", "helenephilipsen": "@jengotch What did ya fail at love? Feeling our vulnerability often sucks 👎 but its pretty friggin healthy👍 and you pointed it out yourself - you gotta show people how its done❤️ so, bleedin good for you!", "lerosehearts": "@leredhead tinted?", "teamwoodnote": "God love ya. (also: I love ya.)", "bonnietsang\nVerified": "Verified", "leredhead": "@lerosehearts first time ive heard of it haha", "jodan44": "Inspiring message to just own it. Get it gurl.", "hipentertainment": "We are in this together. 💃🌸😻", "le.voile.sacre": "Love u @jengotch ♥♡♥", "dionnejonez": "Thank you so much for saying this!!! You rock. Let's roll!", "rachelblindauer": "#life", "iwantmythunder": "💕❤️✨", "dandyfineandco": "🙌🏼👏🏼🙌🏼 love, love, love this authenticity... so brave, so inspiring ❤️", "theglitterinmytea": "Thank you for being real. Being an entrepreneur is ridiculous - I mean ridiculously - difficult.", "indiebungalow": "I love your honesty. I could easily cry right now seeing you cry and thinking about the stress of today. I won't though because I'm sitting here with my two teenage stepdaughters. I'm in fear of them hating me.", "juliebethtanous": "@jengotch you are a dream! Also, I sent a random ass email to you (via the basic info@bando email address) to discuss how our worlds have collided, most recently with @helendealtry. I hope the note found its way to you and I hope it makes you happy.", "moongurl71": "@jengotch Thank you for such honesty. So fresh ☔️😘", "modchik": "#megababe you are such a bright spot in my IG feed, especially posts like these. Keep on. 👊🏼", "susanedickson": "@linzeypinzey #girlboss", "stillcarnations": "@farmgirlflowers", "weareagenc": "Serious Lash", "kkdreger": "This is beautiful and inspiring! Tagging other inspiring women who kick ass in my life: @retailmavens @colldreger @so_wiley", "laurenoneill": "💪🏼", "daminiroy": "@jengotch thank you for being brave and sharing candid stuff like disappointments. Sending you some killa' ladyboss vibes #yougogirl 💪🍻🔼", "lindsaymeyerharley": "you constantly inspire", "sandra.ere": "@trenza.mia Es la directora de shopbando", "anacats": "If we never failed then we would never have the strength to get back up and go forward and fight for what we want...this will not be the first but it will definitely make you stronger. 💖", "marieryyoung": "Thank you for your honesty and sharing.", "hopelovinna": "you are such an inspiration, thank you for being such a kick ass you!!!", "jennstreicher\nVerified": "Verified", "mariacapella": "Hero status. Thank you for sharing this.", "taraswasti": "So powerful! Thank you!", "collinsinla": "@jengotch we're human and we make mistakes. Entrepreneurs, good ones, make a lot of mistakes. That's how they eventually figure out how to take over the world. So congratulations...today you got closer to figuring out how to take over the world! You're awesome!!", "darlingdistraction": "Thank you! Words like this help others! 💜", "kellijohoward": "💕", "ali.egan.hill": "Sending a box of pink otter pops your way!", "dozidesign": "@45walldesign so good!", "jennaraecakes\nVerified": "Verified", "of.wayne": "Seriously needed to hear this today", "athinabianca": "Thanks @jengotch. I might be at my desk REALLY late with an acrylic cup of wine and mascara (bc my lashes aren't tinted) all over my cheeks. Totally feel you.", "kodiakmilly": "I live cool ranch. Be strong. 😊", "karrie.franks": "@jengotch sorry that you are having a tough day, thanks for posting. perfect timing for me to see I'm not alone. Tomorrow is a new day.", "ourtinylandscapes": "I love this, and you and I feel you, sister! X", "hilaryplata": "❤️", "verywryly": "If it's any fucking consolation....@jengotch you have no idea how much you inspire me. I mean of course that IS what you do (inspire people) but I can't thank you enough for showing the \"other side\" of being successful..... betcha bottom dollar that tomorrow.. There will b sun ☀️ #ITSFUCKINGOKAYTOFAIL #ATLEASTYOUFUCKINGTRIED #ALSOSORRYFORSOMUCHSWEARING", "fernanda_loaiza_": "👏🏼👏🏼👏🏼👏🏼 chin up! 😊😊😊😊", "patriciapaterno": "I'm the chief everything in our family business and I did something incredibly stupid and I am trying hard to get out of my funk!!!!", "freemahimahi": "Thank you for this!", "lucia.eam": "You are an inspiration to many ! Love from México besos chica !", "amynadeenavila": "@dianelindquist :-D", "westofmain": "Thank you for your honesty. This too shall pass is my modus operandi!", "kellyamano": "Thank you for this.", "elysejost": "@naomi_ann95 twins", "ananuge": "As a young business woman who will surely have similar days- thank you for posting about the good times as well as the bad.", "jennya": "@inthatdress Me/us in 2 years? 😉", "champagneandmacaroons": "😻😻😻", "sleggss": "Thank you for keeping it real on social media! This is inspiration. (And you got this!)", "jessikarabbet": "@lauraleeswanson this woman! 😍", "hopelesslingerie\nVerified": "Verified", "bbyviper": "@jengotch you're AMAZING!!!!!!!!!🌟💖🌟💖🌟💖🌟💖 I luv u, keep up the hard work!!!!💪🏼", "clammessano": "#GirlPower", "chach.xx": "You're amazing💜", "tiny__baker": "We're all human. Which is sometimes difficult to accept, but makes us all the more relatable 👌💛 if no mistakes were made, there wouldn't be much growth. And what is there with no growth? Rock on ✊", "alesiacarterxo": "🙏🏽🙏🏽🙏🏽", "life.of.claudia": "Rember you are an inspiration for us girls!! Chin up! 🙅🏻🙆🏼🙋🏻💁🏼 we are cheering for you!! #bossbabe", "naomi_ann95": "@elysejost us", "chestnuthall": "There's really no moment a good bag of CRD can't elevate. Right @semcspadden?? 😜😘", "axmbakes": "@merniemern", "aranzazues": "Be strong (I bet you're ok:) I dream of being the chief creative officer at a rapidly growing company!! <3", "hodgekm": "@rachel_plates", "lhurley22": "@lorricane @reemz", "taraleeallison": "Boss-lady hero!!", "gretchengoswitz": "@paumod15 did you write this caption?", "prooftoproduct": "Hugs ❤️❤️❤️", "iangunn.art": "Sending 💓💓", "happyinaustin": "sometimes I feel like it's just us, but all the great minds go through this too ❤️ #wegotit @jlblakley @twoooolfe @ericaandjunk", "little_pxl": "UGH love how transparent you are with the good and the ugly. Never change, Jen!", "anna.mcbee": "@erinmccu", "shopmintedsugar": "😘", "coolshera": "@jillmdowling total #cryday thanks! 😂", "findingterry": "@ktthornton ✨", "alexisrockley": "Genuinely inspired by you.", "h_a_d_i_a_09": "Sometimes when everything seems at its worst ... Things can only get better!!! I need to be you someday! .. An amazing inspiration to ALL💕💕", "laurashortart": "I just posted something similar. Lean in to the discomfort! It feels awful, but only growth can result!", "gretchcma": "Your honesty is so refreshing!!👊🏻", "lizzafriz": "@morganelise3", "gaby_vals": "You're brave and I admire that, I admire you. XOXO from Mexico 😘💕", "barbiecouture21": "I love you 💗💗💗💋💕", "zebcarlson": "@bkershaw love this!", "rena_tom": "😘😘😘", "seebrannan": "I want to work for youuuuuuu! #kittenswannaworktoooo", "sugarwishgirl": "❤️ this post. Inspiring.", "danielagobo": "You are an awesome person! Thanks for sharing this with us. It only makes me admire you so much more!! 👏🏼✨💕", "simplyraquelcollette": "I'm literally obsessed with you", "karolynmckenzie": "Keep going. You're amazing.", "jlolo72": "I don't know you but you got this!! We grow from challenges. Face them...cry if you must...then go back to being the badass that you are! Plus, come on...it's \"national women's day\"...we all rock. #usa", "janisbuendia": "Jen, thank you for being so real.", "hattonhome": "You're an absolute boss & total rockstar @jengotch 🌟🙌💗 an inspiration to us all!", "lostbirddesigns": "You are amazing!", "jillmdowling": "@coolshera look! It wasn't just you #crydayforcreativedirectors", "sodapoppr": "Thank you for always being real and open. You're the 💣.", "chicksincharge": "@whitepeacockstyle inspired 🙌 thank you Jen for being so real and such an inspiration", "emeeeeelia": "😘😢love this. The major challenges are the spaces for major growth (not that that's easy). You really sound like a great leader.", "oftenwander": "You are amazing! And whatever it was, you're still kicking ass, every damn day.", "karilynoettli": "We're in this together! Thank you for being honest and funny always!", "kitiyapalaskas": "You're a legend @jengotch! It's really inspiring to hear you be so honest about the realities of business!! 🏆🏆🏆", "jfoxjewelry": "❤ #keepinitreal", "kristicolvin": "Been there my dear!!! Brighter days will be ahead. Sorry today was such a tough one.", "elinorsophia": "@hannahjay8", "wanderwildandfree": "Thanks for being #organicallyyou. Sending you love babe!!", "seethefoga": "Wow", "blushandbangsco": "❤️", "sydneyeventsstylist": "On the bright side you have an amazing insta following 💕", "ms_kimbermc": "@ultraviolet144 I adore her!", "campbellcate": "you are the prettiest crier in all the land. p.s. you are also the best boss in all the land. p.p.s. is this because i left without saying bye?", "lisakernsjewelry": "My version includes my highly comfortable bed and lifetime movies back to back.", "allisonnyskies": "@hjwhite2 this 💕💕💕", "ladykwolfe": "You're an inspiration @jengotch - thanks for always keeping it real 👊 today was only a stepping stone!", "hgriffing": "I'm not alone. Thank you @jengotch", "dianelindquist": "@amynadeenwilson", "clairemirisola": "🏊just keep swimming...💟", "anderwilson": "@amandaadamsfit this! 🙌🏽😭😭", "bellefeaster": "@jengotch so genuinely amazing!! sending all bright and sparkly vibes your way! 💖💖💖💖💖 #keepkeepingitreal", "edytaphoto": "@katierebeccaevents @ohhappyday seems like everyone is keeping it real these days :) #iblamethe30s", "dforr": "Remember when they used to be called Cooler Ranch? 😊", "mrsmelmitch": "love your raw honestly 💗", "pspapershop": "✨💕✨💕✨", "cocorosedesign": "It's not all sunshine. Business is tough. Your lashes are gorge and you're such an inspiration.", "thegardnersgrow": "Ive had a lot of those days. They always pass though. You've got this! 👊🏻✨", "mintandmirth": "I feel you", "natallyvinaja_creates_": "Words of wisdom! I absolutely love what you're doing with your company and yes you'll face obstacles as you grow but always stay true to your passion and don't give up! I see incredible things happening your way! ❤️", "eatherbrains": "Ugh I feels this post so hard! And it's nice to see some honest raindrops ☔️ but as my momma always said \"Tomorrow is a new day!\" ☀️ it happens #beentheredonethat ps. ice cream is my go to 🍦 @jengotch", "liligabriela": "You're a BOSS ass lady 💅🏽", "kristy_maffit": "@jengotch you rock and this will pass and you'll turn the corner to something or some idea that's fucking awesome! See @brenebrown rising strong!!! 💪🏻💪🏻❤️❤️", "mimosahandcrafted": "❤️ love that @betsypetersen might have to do the same 😏", "daisys_mercantile": "Had the same day, cried all the way home. Wondered why my retail life was so important to me. Gonna sleep it off and get back up tomorrow and try again", "circarentals": "Fuck it, dust yourself off kid! Get it on the next one! @jengotch you're a Unicorn. Remember that ✨", "hellosandwich": "👭😘", "heatherrnewton": "You are a QUEEN. 💕💕💕 Tomorrow will be better!", "mirandabennettstudio": "💕💕💕💕💕💕💕💕", "shells23": "@jengotch you got this!!!", "shiffysphotography": "You are inspiring!!!!!!", "mercicadeaux": "If I could double ❤️'s across the entire photo I would!! This is so wonderful! Thank you for your transparency and courage! I'm so inspired by this!", "shoprkitekt": "You are beyond rad for this amount of transparency! Pouring one out for you for a bum ass day and Gina! 🍷✌", "illustrated__girl": "This too shall pass, @jengotch ! Keep being aaaaaweeeesome as u are! Remember: Stand up and fight back!!!! Lots of love ❤", "betsypetersen": "Next time I'm feeling discouraged, I'm going to end my whole rant with, \"but how good do my lashes look.\" It really puts things in perspective.", "monamyf": "You rule 💖💁", "primosdonutsla\nVerified": "Verified", "antiquariadesign": "Love the honesty!! 💪💪", "waffluv": "Your eyelashes do indeed look 👌 & I appreciate your bravery & honesty. Thank you for sharing it with us❤️ much love to you during this time.", "lyndanardelli": "Strength honesty endurance 💪", "pia_sadie_marshall": "Sending happy vibes 🙌", "amberlovesjohnnie": "Great truth and strength in that post!! HUGS!!", "sabzzs": "@jengotch thank you for your Honesty. Your strength is inspiring. @pqpr @karapurto", "laurenleecasale": "Yes lashes look gooood! Goodnite", "meggie.fischer": "And this is why you are Jen Gotch. Honesty & kindness. Sending rainbows your way. 🌈", "ddot": "You're amazing and I'm not just saying that because it's Instagram.", "say_hola": "Powerful...!", "decoreista": "That was the sweetest post ever! Hope the rest of your day got better. And yes your lashes rock!👏🏻👌🏻✌🏻️", "tavishkeegan": "Pretty much my hero! Just know that every time you post I do my best Wayne's World \"I am not worthy!\" You're amazing, stay strong 💪🏼✌🏼️🙅🏼🍤😘", "alannagatto": "❤️❤️❤️❤️❤️", "alyssadelatorre": "you are so 💪 and 100% not 🍤 even on the roughest of days", "malrobison": "Keeping it real, everyone and anyone can relate darling girl", "sprinkledlife": "☀️😎✌️❤️🎉", "ediet": "This is what strength looks like. xo", "swaaaa.aaa": "@xx_wanalds this is Jen. Listen to her 💕", "_breadnbuttr": "Walk it off. You got this! 💕💪🏽💪🏽", "moonuponastick": "If it makes you feel any better, I cry like every day. I even cried today! Oh and yesterday too. Don't let the road blocks stop you. Just go down a different road or get a bulldozer.", "korie_conant": "This was much needed. Thank you.", "liz_summer2019_memories": "👆🏻honesty gives us more empathy and more empathy gives us more honesty. Admire you.", "kwazlo": "Hey girl, I'm proud of you. Keep it up.", "luxeandthelady": "😘❤️😘❤️", "westtsidestory": "Me!!! Broke down crying today. Work is so hard and doing what you love day in and day out is so rewarding you got this!!!", "morningslikethese": "oh, Jen Gotch. failure is my friend these days. at every turn, I totally either fail or just talk myself out of trying because I assume it will fail. if there ever were a woman who made failure look like an absolute privilege, it's you. you just fucking rule. you are insane, brilliant, vibrant and flawed. we love you for it. it gives the rest of us inspiration to just keep on trying.", "grassfedsalmon": "Your personal posts are inspiring and universal. Typically when I read posts in similar tone I cringe- but you girl- you are resonating! That's something. Celebrate that shit. Also rip Gina. 💗💜🍷", "maraisusa": "Girl boss to the max 💘💘💘", "thedisneylandprincess": "You got this girl! Such an inspiration, thank you for sharing. And your lashes look amazing! ✊💕", "uhohpasghettio": "#honesty. Love this. And tomorrow is another day! Don't beat yourself up too much, you got this 👊", "whitneyleighmorris\nVerified": "Verified", "kinga.subject": "You are all kinds of awesome! Fail shmail! @jengotch", "marimarianamedeiros": "💙💚💛💜💛💚💙💙💚💚💛💛💜💛💚💚💙💚💛💜", "megancerchiai": "Thanks for your raw honesty! Beautiful! 💖💖", "mavencollection": "Love this. Thanks for sharing❤️", "54321.live": "It will be OK. It's damn cool that you're honest and put yourself out there. That right there is success.", "careergasm": "💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕", "littlesunhat": "Love this so much! ❤️❤️❤️ dance it off!", "lilliefish": "Don't worry be happy. < listen on repeat", "_eclecticpress": "This is awesome. @jengotch", "heathershanephoto": "You're my hero! 💕", "andilsmith": "@caking feel her!", "heyitsmothers": "@itsgigijack 💜", "happilyinspired": "Love this and u! Proud of u. 💫✨", "joiebutter": "I love you! (too much?) But seriously. 💞", "madmommaevents": "Open, honest, and put a rain coat on Gina!!!", "annerbananers": "i want to grow up to be @jengotch    ", "whitepeacockstyle": "@chicksincharge she's the 💣"}