{"soniasapinho": "You're so right!!! ✨👌🏽", "xantheb": "Keeping it real 👊 Thanks!", "_mariemd": "@marinalemay", "thatscrispyyy": "@stella_faith yes yes yes 🌷🌷🌷", "littlearrowshop": "Have you had your fsh & hormones checked? You could be peri-meno! I had similar anxiety and stress symptoms but was too young to be going through \"the change\", I didn't find out until later what the hell was happening with me. At times I felt like I was going to explode from all the anxiety. Sending you positive healing thoughts. Be extra kind to yourself 💘", "drinkpaint__": "H&G drowning edition @anne_grit", "glitterygap": "@patriciagapske This explains it all perfectly!", "jordanlfleming": "@abaylisw 😘", "queen.quimby": "@jordanlfleming yas", "instatracey": "Much of what you describe is what I experience. Not myself. About seven years now (since I was about 40) going through peri-menopause. Had never even heard there was such a thing, then started reading about it and felt like I was reading my life story. Also started talking to my same age friends and asking them what the heck was up with my emotions and my anxiety and my strained marriage and my insomnia and my crankiness, etc. These things had never been my norms. It helped to know I wasn't alone, and that there were physiological things contributing to it all. Man, being a woman is complex. It's been the hardest thing I've walked through and I'm still figuring it all out. Stumbling a lot, pretty exhausted, but I have gotten a lot more vigilant about trying to take care of myself, even in little ways. Many doctors don't even really seem to know much or be able to offer much and it's also just not the most elegant or fun topic to discuss openly with people generally but it's real. The struggle is real, ha! Can someone please come up with a better word for it than menopause or 'the change.' Ugh. Not cute words. Anyway, you are right, our brains are complicated and beautiful. Yours is beautiful! So sorry for the epic rambling comment here but just felt compelled to share. 💓", "jengotch\nVerified": "Verified", "laceandlikes": "❤️", "alovelygathering": "You're so awesome @jengotch", "bryleeeeeee": "@girlcalledgeorge", "erin_george_": "@bryleeeeeee 🙌🏻", "kayliemarissa": "👏👏👏👏👏", "pigmentandparchment": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "fromthemoonshop": "@thehomeyjoel maybe this is why i have been such a weirdo bitch lately. new business, new stress and new happy is overwhelming. thanks for still loving me. mostly when i yell and to throw a fern at you. you da best.", "patriciagapske": "@glitterygap I just saw this! Great post, maybe some tests would be good. :)", "nicolarowlands": "Very good words. I have suffered for a few years too- glad you've got help and getting through it. X", "stepinto.yourgreatness": "Made me think of the movie, \"The Intern\"! I bet this is just the beginning Jen! I bet you'd grow, groove and thrive into it wayyyy past your wildest imaginations this year!! Own it! Have fun!❤️", "marslover_92": "@make__it__reina lol we should do this", "missyfineinc": "@mariajoelle life this photo.", "theweddingcakeshoppe": "This post is everything.. I hope ur feeling better soon. ;)", "stella_faith": "@christygrrrl this is so good", "x_geek": "🌷🌹🌷🌹🌷🙌🌷🌹🌷🌹🌷", "auvickyc": "@kate_dinkel @eliwins #notalone #badbrain", "kate_dinkel": "@auvickyc @eliwins I like. good to hear ♡", "_sara_hendrickson_": "@ariannabarrans so, so good ❤️", "amyventures": "also this .... @emilyzirimis assuming you have read it already but in case you have not 😂👌🏼💯", "mvterrazas": "👏🏼👏🏼👏🏼", "vanvanduynduyn": "@emilyvanduyn", "modchik": "You're not alone. ❤️ I hope you find happiness deep within a calm that can not be touched by anxiety or dread. Meditation apps are 👌🏼 for supporting that beautiful brain.", "emilyzirimis": "@amyventures surprisingly, I hadn't seen it yet! lol So reassuring to hear and makes me feel less crazy 🙌🏻", "campbellcate": "you. are. the. shit. 💖", "abeautifulflowerchildmess": "@crabbyblabby saw this lovely post and wanted to share with you.", "eatdrinkbecrafty": "You are not alone. So many of us hve been there! Now you don't have to be afraid of a bad day. For me having answers made all the difference.", "dionne_______": "💕💕💕💕💕💜💕💕💕💕💕", "tiffanymasbou": "You're amazing, such an inspiration and look like so much fun! :3", "mlee73": "So, so true. Thank you for sharing!", "9thletterpress": "Hey. This was so helpful and comforting to read. More than you know. Thanks for sharing.", "carlyraeweddings": "@deshack same! I realized why I couldn't stand bright lights too!", "deshack": "You're speaking my language. Ain't no shame in it! I have (seriously) a nearly perfect life and I deal with severe depression several times a year. The brain does what it feels like. It just means we're hard wired to FEEL IT ALL!!! Also, maybe read the book \"the Highly Sensitive Person\".", "pinkartichokecards": "Thank you for sharing!", "jodan44": "I love you even more than i thought possible @jengotch i too suffer from anxiety", "sjanen88": "You're my hero!!! Thank you.", "tracycieslak": "👊🏽proud of you", "ddot": "Again you amaze.", "rurlurdur": "💜", "masalamomma": "Just a little #gotchglitch . :). You're generous for sharing. Thanks.", "romeroymiel": "@jengotch for President! 🙋🏻", "uncletiffy": "@krystmastime this reminded me of you and how you felt a few months back", "davisclare": "@srs_scotti_07 I found this very appropriate", "buttercupcaren": "thank you for sharing. x", "hellosandwich": "Love you lady cakes! 👭💗", "hpett_": "You're incredible and wildly inspiring.", "maisonboutique": "❤️❤️❤️", "wemovevintage": "Thank you for sharing this!", "lepetitfrances": "@dallasclayton you should see this", "stefaniasc": "💪💪💪", "mrsbcs": "@jengotch you are amazing. That is all. Goodnight.", "lilcsalz516": "@jeanlovely", "adrenalinejunkee": "This is so true!! Thank you for posting! So many need this at times, myself included💞 @jengotch", "sunmeow": "😘", "corajane": "Really appreciate this, and wish we could all be more open about \"brain\" stuff. It would make for a much more understanding society. Glitter-covered, disco ball fist-pumps and hugs to you!", "hannahacarpenter": "I love this and you (though you don't know me, which is weird). But thanks for keeping it real, from a total stranger who can relate.", "annabosterhout": "Thank you and I wholeheartedly love you!", "pattymessner": "thank you for sharing...", "dixieandtwine": "Thank you 💘", "hannahjeanp": "@eclaps", "woodies4": "@ninkainthecity awesome post n we're always here for u! 🙋🏽", "klafferman": "This is really terrific. It was so needed and helpful. Thank you.", "rebkapix": "There should definitely be a brain emoji", "allie.nu": "🙌🙌🙌", "lindseyreyenga": "love this. 😘🙌🏻", "msalinka": "@kacey_jane @rayonpatternqueen nice read/reminder.", "gloriacatherinexoxo": "real as fuck! thanks for putting these words up. i wish i had somehow read them this time last year when i was going through something very similar. all is well now, and i will be hoping things continue to be good for you. liking this xguzillion. 💪🏽❤️", "luly700": "I ❤️you. Hope you are feeling like yourself soon.", "indiebungalow": "This IS good!", "gloria_noel": "@lndw", "giniemi": "This IS good. And so true. And so important to be said. And rightly said. :) @jengotch", "melissa.wright19": "Cool picture @ramblings_from_north 💘🌸", "martadooodle": "💛 you!", "lizfarrelly1": "Thank you for sharing. It's useful to hear about how succeeding can create anxiety just as much as failing ... Really appreciate your insight and your message ...", "laurenoneill": "Can't leave a high five hanging especially with a post like this 🙌🏻💕", "sfgirlbybay\nVerified": "Verified", "marieke_d": "@ambitieuzemeisjes real stuff", "ccdoodle": "@ninkainthecity 👍🙌", "jesspennartz": "Love it", "shopb.ca": "🙌💖💖🌸🌸", "nataliyaborenerinteriors": "The most real thing I've read in awhile. Cheers to you! The strong survive and you're one tough cookie. 🍪Thanks for putting this out in the universe for others to relate to. You are an inspiration!💗", "aclairification": "@ashreneelee omg she is the best.", "iriscferrier": "You are not drowning in dopamine just becoming one with a wonderfully scented pink cloud of peonies. Enjoy😍😍😍", "laurasonnier": "@laurenbrinkley", "heathershanephoto": "You are my hero!", "stroetifrutti": "@moonzissou Gewoon een glitch dus af en toe. Ik voel me meteen een stuk beter na het lezen van deze post 😀", "luckbealady42": "Keep calm & carry on!! You are amazing!!", "ditavonmarple": "🙌xxx", "richiedesigns": "Yes.to.all.of.it I finally had to admit I wasn't handling any of the awesome but stressful things anymore. My Rx helped so much, that damn black cloud lifted and I could finally do the work I wanted to do. Hope you find some relief soon dear!", "annesolange.tardy": "Thank you for posting this. It's SO important, and true. 😘", "ambrosia0909": "You get me like whoa", "melissagaye__": "I've been feeling exactly the same. I've been super busy with work and have all these new (amazing) responsibilities, but it's so overwhelming at the same time. I feel good but not good/like me but not me at the same time about it all. Thanks for talking about it x", "angiedoss": "💗", "leslie_yep": "💜", "josheppphoto": "Brains can definitely do crazy shit and anxiety and panic attacks suck big time. It takes a strong person to navigate those emotions so you are definitely not weak. Sending you: 💪🏻🌈💕❤️ - be kind to your self.", "everdje": "Good you wrote it down like that! Hang on!! 💪🏼💕", "ashleygoldenrule": "AMEN. I just took a Valium.", "lilyelle": "I just l❤️ve your realness, girl. thanks 👌🏻😘", "alyssa_irl": "Welcome to the club 😘", "jlcan36": "I love you even more for this post and its honesty @jengotch", "porcelain_unicorn": "@courtnelius1 See, it's gonna be okay. We're gonna be okay.", "pixie.cat.owl": "I love your honesty💗", "hicklingcottagecrafts": "Wow what a wonderful post ..thank you for having the guts to speak about it! You made my night! Actually you made my week :) I am not alone *sigh* what a relief lol :)", "streicherhair\nVerified": "Verified", "anitamargarita13": "Such a truthful post. Thank you for sharing. Be well! ✌🏼️", "sarahkims": "Get well soon.", "amymcmullen": "this is really good. and so crucial to share in. thank you.", "misselaini": "Hugs and yes! Thanks for being honest!!", "kellygolightly": "You're the best. Hope you feel better soon!", "sarahcarolinecrawford": "so important! you are amazing & so brave for sharing 💖", "designforsoul": "Well said Jen Gotch 🙌🏻🙌🏼🙌🏽🙌🏾🙌🏿", "meghanmcneer": "Great words and love your tell it like it is posts, thank you for sharing! 👏🏻👏🏻👏🏻", "lola_mouse": "Thank you for this 💗 @jengotch", "nicolettemason\nVerified": "Verified", "annagernigan": "@misskathleen #thatdopaminetho", "casemiroju": "I like this. And now I like you even more, @jengotch 🌷", "typhoontessie": "I always love a good post advocating for mental health- thanks for being real 💕", "simple_fortune": "@cecilegiraffe", "yanafo": "I'm Bi-bipolar. Understand what you going through. Keep strong ;)", "sarahemilydonahue": "Get it right , get it tight !!! *** happy wishes :)", "hilaryplata": "Love you Jen ❤️", "ohhhkris": "As always, you nailed it. Love you beyond!!❤️😘💖👭👍🏼", "daniellelball": "Sending you positive vibes and love. I hope you're back to feeling like your self again soon. 💜", "ninkainthecity": "@woodies4 and @ccdoodle this post hits home for me", "thaissrguimaraes": "My mom went through the same problem ans she's doing just good. I know you will too. 🌈", "sprinkledlife": "Love you to pieces!! 💕", "noeliagomezf": "❤️❤️", "kristin_violet": "@keatonviolet I 💜 her", "jordan___key": "Yes this is great! 💖", "amsies": "Very much relate to this and I think it's very awesome you shared it 👍", "marycatherinehughes": "Thank you for being so transparent. @blandybland will love this!", "ashreneelee": "@aclairification", "robinreetz": "Thank you for this, @jengotch! I've been feeling the same way and really needed this. Also see 'how am I not myself?' 👉I ❤️ huckabees", "lilah_shepherd": "Thank you for this, I've been going through stuff", "tattytootits": "Appreciate the post @jengotch . I've been there, most of the brilliant women I know have been there. Hang in there bc it does get better.", "keller6274": "💛☀️❤️", "aveytheavocado": "I feel exactly the same way about my work which I shouldn't feel so anxious about. Thank you for helping me remember its okay ❤️", "kastlescamponi": "Yeah Jen👍🏼🙌🏼💗", "hugofromkamakura": "@jengotch ... Sending you positive vibes all the way from japan .... Me too ( bad stuff) but don't let it win...", "actualizingamy": "Adding my little shout out and a hell yeah to the list of comments proud of you!", "etal.lison": "@mallory627 love this and thought you might too", "elilley07": "It's really awesome of you to share this. You can get it, girl!", "sarahloertscher": "@jengotch you really are something amazing. Thanks for your awesomeness, transparency, and bravery.", "sarahciampi": "you're so inspiring to me :,) 💖💖", "em_keller_logan": "Thank you, thank you for sharing.", "cat_stilt": "#inspiring", "emmalhewitt": "Thank you. It is so important for everyone to recognize this! It would be beautiful if everyone were this transparent.", "hannahjay8": "@elly_jenkins", "robynwise": "@coachmattbear 💗", "shop.bark": "Mental health matters. Thank you for your post ❤️", "sammishay": "thank you for this", "emmybee21": "@rain1178 this.", "eucca": "You are good.", "k_froggie": "@lily.livingston", "missmessdesigns": "@jengotch you make my life better.", "elliecardozza": "@jengotch Te amo guey!!! Your words are a waterfall of wisdom for my soul right now! xo.", "laurabear": "Always an inspiration", "eriinflan": "I love you @jengotch", "citizenrobot": "Haven't seen you in CDL in a while, sending you good vibes 🎀💗💖💕💞💓💟💝💘", "btoshner": "@jengotch is Queen 👑👏💗🍕✨ @icutyou", "aknightster": "@tbm214nessa if you don't follow her you should. Yep, @jengotch is real... and amazing... She real amazing!! 😊", "missartteacher": "Amen 🙏🏽 know your limits of anxiety and what's normal for you- we all need a brain tune up now and then.", "schmollyy": "💗💗 @alexsosner", "carriegrafstrom": "💪🏼😘 thank you for this!", "kelliecockrell": "❤️❤️❤️", "neridagger": "I stranger love you ❤️❤️", "curiouseyepottery": "Thank you for being so open about this. It's important for people to know that even when everything is going right it doesn't always feel that way. And yes yes yes to getting help without shame!!!! 😘😘😘😘😘😘😘", "emily_katz\nVerified": "Verified", "styledbyroma": "Thanks for your honesty. It is so important to me that people I look up to are honest and transparent. Bravo! 👏", "eringilmore": "😭👏👏👏👏👏👏👏😭👏👏👏", "_clotheshorse": "Jen, you are amazing.", "thewonderist": "You're really changing the game for what it can mean to be a leader, and I ❤️ it. Girls. We run this mutha!", "daminiroy": "@jengotch such a precious human! Absolutely adore what you've said here, especially the paet about not being afraid to ask for help. I think that is crucial and determines the odds of one being happy in the future too...I think the happiest people are those who are strong within and because of a close circle of supporters and cheerleaders 💜", "likemammamia": "I love this post. So wonderful!", "caseybovee": "YES! 🙌🙌", "_mrs_tacadena_": "🙌🏼", "chelseyandollie": "You are a rockstar. Thanks for posting this 👏🏼", "lilyronon": "@k_froggie", "nic_ducharme": "So much like!", "megatallic": "Might sound weird, but this is why I follow you. You're unapologetic realness. You are mega brave.", "anndanger": "I've been feeling this way really hard for the last few months. Allllll the feelings 😁😅😐😰😩😭😂", "mariaski63": "👏🙏👏 Not only do I like but I 💕 this post! Thank you for talking so openly about this-I can relate to the ups, downs, anxiety & panic-most major life events have occurred simultaneously or one after the other for the last several years. A big step in feeling okay about discussing it, is knowing we are not alone & that there shouldn't be any shame attached. 💩 happens & often our anxiety & panic are justified-a good thing-our bodies telling us that we are overwhelmed. Congrats on all the good things coming your way! 🎉🎈🎊", "cassyymartinez": "💗💗💗", "emikooreware": "Thanks for speaking your truth, @jengotch - you and your readers will want to know about Dr. Daniel Amen and his ground breaking work in brain health. He's an inspiring speaker, accessible to the public, and wants us all to be brain warriors. I've been listening to his talks on YouTube, was first introduced to him in Trudy Scott's online Anxiety Summit.", "clairekaterickson": "🙌🏼 🍤needed to hear this #jengotchwisdom", "alyssainez": "hell ya my brain acts hella glitchy from time to time 💖", "stephsterjovski": "🙏🏼🙏🏼🙏🏼🙏🏼❤️❤️❤️", "alphonnsine": "You're the best Jen.", "rayrayrene": "💕 your way!", "luckyandi": "@hopeyteggart", "hymanhomeandinteriors": "Love, hugs and support for you! Your positive spirit is such a motivator. 🙌🏻❤️🌸", "_lpdz": "awesome message. You're a courageous lady. Keep swimming🐠", "shanna.polesovsky": "I feel like I am reading this post, at this exact second for a reason. I'm in a similar situation with my day job, but my side hustle starting to boom. there is nothing I should be sad about - nothing. and I've never had anxiety attacks before, but the last couple months have just been off. it's so refreshing to know other people are going through the same thing. thank you so much for sharing.", "morganpansing": "You're awesome!", "darlingstudio": "SO true and so well said! My family is no stranger to anxiety and panic. It can be so isolating if you don't talk about it because you think no one else could possibly understand, but it's just not true. I'm constantly impressed and inspired by @shopbando and you. Your courage, humor, honesty, style. It's all so so good. 💛", "_lay_la": "ahhhhh so inspiring Thank you @jengotch", "shmandyface": "Working on mental health is a journey that builds strength you never knew you could have when you are feeling your weakest. Stay strong. Stay gentle.", "sandramaogle": "💜💜💜👊🏼💥", "somebunnyy": "What kind of challenges? Do you need help? ✨✨✨✨", "carrieannpurcell": "😘", "flashcocopop": "Thank you for this. 😘", "marissawilayyy": "🙏🏻🙏🏻🙏🏻", "thequeenchristine": "Good for you, woman! 💗", "_wanderingwoods": "I've been facing the same thing. Glad, but not glad I'm the only one! (I get my tests results this week) So today I colored and focused on breathing. 💗 thanks for posting.", "e.cast": "Love this! Thank you!! ❤️👌", "joiebutter": "💗💗💗💗", "ofthesethings": "What a great post! 👊🏽🙌🏽", "123jayme": "🙏🏽🙏🏽🙏🏽💕", "itsbasicallycindy": "You are amazing and you have been such an inspiration! Thank you for this post ❤️", "raquellalily": "💕", "jackiesaffert": "I strive for your kind of authenticity, Jen. We need more of it in the world. Thanks for posting, hope you're feeling like yourself again stat!", "goldcadillac": "seriously needed this right now. I'm so overwhelmed with so many shitty little things adding up, it's just bringing me down. I've had tests done but maybe not the right ones... keeping at it though. you're truly inspiring in every way. thank you for that.", "bynatasharose": "Thank you.", "kristin.falck": "@jengotch preach 🙌🏻 I've struggled with anxiety for the past 15 years, and can never pinpoint what triggers it. But it's real and it's OK to ask for help! Sending my love.", "eosore": "@rebeka.o", "lizz_robinson": "@whitrenatus 🙌🏻🙌🏻🙌🏻🙌🏻", "dreamsinsars": "Totally feeling this 💕", "heartenholmes": "This is my life. Anxiety and the brain are such internal battles for me a lot of the time. Thanks for being so honest and relatable! You're such a breath of fresh air 😊😘", "picsnlove": "😘 you got this babe.", "laurablumenberg": "I think this may be one of the most important and true things said on Instagram. Thank you. 💗", "the_osbrowns": "This is good and so are you.", "adequately_alex": "Girl as someone who has had brain surgery this posting is quite accurate to mental issues. 👍🏽", "molliejoydesign": "Good stuff girl.", "meagan_hall_": "Love your honesty and openness. I know someone will greatly benefit from this post. Sending you love 💋", "brandylswope": "❤️❤️❤️❤️❤️", "anxiousalphabet": "@jengotch thank you for your honesty! amen for therapy, meds and the fact that help is available!", "doublevisme": "This IS good 💕 Thanks for sharing", "studiojake": "BEST. POST. EVER. Thank you, Jen. 💗💗💗", "schonstudio": "💕", "lovevalgeisler": "Gah. I feel ya, girl. @racheal.cook I feel like we've had this convo so many times. 💞", "linda_marie__": "Thanks for talking about mental health 👊🏼", "rachel_plates": "Thank you for this!! Needed it 💖", "nancyfancypants": "Not even close to negative or sad! Just a life hurdle. 😊 Great time to take a moment, breathe and re-group. Sometimes saying no to some of those challenges will help, as it will aid you in growth and focusing on the best things. So happy to see Bando products in my local stores. Yay for successful endeavours!! 🙌🏾", "breducat": "This is wonderful, thank you", "allisonnyskies": "@hjwhite2 she's literally my girl hero everything.", "greenchristine6": "Love that you shared this! Thank you for #emotionalposting 💆I feel you on the physiological side of the emotional.", "vanessaholden": "👏🏼👏🏼👏🏼💋", "makebakeshop": "@jengotch you're a real class act. It's great so see women who have a voice use it to make others feel more self accepting. 🙌🏻💘💫", "natashaeoi": "👏💓", "jen.harr": "❤️", "cthrumybabyblues": "This is good. #thanksforbeingrealjengotch", "lisammagee": "Definitely feeling this too! Thank you.", "angdast": "I feel ya. The good stuff can elicit the same physiological response in the body as the not so good. Been there, and will be again. Hugs to you, you're not alone. 💖", "laurairion": "You are brave and beautiful, and fearfully and wonderfully made. 💗 I am sure that this post will encourage many. I liked it. 👍✔️😉", "spookymadsen": "🙌🏼🙌🏼🙌🏼", "ashleydcrowe": "💞oh so very true...take good care of that chic brain of yours!", "shopruthiegrace": "Love your transparency here! Been there several times!", "darahsrew": "@hallielark idk a good quick read", "carablasen": "🙌🏻 amen", "briannedengler": "Mental health is everything! You're the best! 💛💜❤️💚💙", "lionheartprints": "LOVE YOU 💕", "katiehorwitch": "Dude. Yes. You are not alone. So thrilled for your success and even moreso for your ability to navigate the sometimes tumultuous waters that come with that kind of success. You're a maj inspiration. Xo", "americangarage": "@jengotch great photo @jengotch", "saramoon": "💗", "lbvasiliades": "@suz_the_hammer I love her and I want to work for her/want her to be my bff/want her to be my life coach.", "ajbeulke": "She's pretty great @ajoy.davis", "champagneandmacaroons": "Love that you shared this. So true and so honest 🙆", "marleegrace\nVerified": "Verified", "debutanteclothing": "So happy for your growth and abundance in life and business!", "alyssacolettebrown": "did you go to a psychiatrist to get a test like that?", "meganbe": "So important for everyone to know this. THANK YOU JEN.", "dinexdesign": "Baby you're a firework 😘💥", "paperjampress": "❤️❤️❤️", "alexandria.can": "@jengotch you're amazing.", "heyeday": "👏🏻"}