{"dunkyhory_": "@lifeisbeautifulislife", "iamcaty": "I’ve been dealing with my house projects for two years now and I needed this. thank you thank you 🙏🏽✨ and congrats!! 🎊", "stellark22": "So proud of you!!!!!! You are so inspiring", "jordansondler": "Hell yeah!!", "civilmoon": "You look so great tho 😍💕", "themegnorton": "Yay congrats!!", "ampjar": "This is such exciting news! Huge congratulations. You’ve got this 💪🏼 never let the fear in your head take over! Can’t wait to see more of your new home 😊💕", "mildadesigns": "Congratulations Jen!🌈❤️ you do deserve it, thanks for your stength and vulnerability in sharing your ups and downs...i feel so inspired!!!", "hiiimynameisdi": "Love these shoes. Maker?", "realbrookewhite\nVerified": "Verified", "shelfaye": "I needed this post today. Congratulations on your new home. We all need a special place to land and feel home.", "albrannian": "💯💯💯", "asnuszkowski": "@jengotch does it have a fountain of youth 👌♥️", "fotolucid": "You look almost child like, innocently happy 😃 if that makes sense 🙈", "fromnancysheart": "I know all of this doubt so well, and it had to take the brick wall to get me to notice. I send you peace & joy in your new home💕", "lucylaucht\nVerified": "Verified", "jasiefert": "👏👏👏", "jeremyhunterpresents": "Thanks, Jen. I needed this today. My dream is to buy a house one day. I’ve made a lot of financial and professional mistakes in the past, and I have similar doubts and anxieties.", "meredith.tabscott": "1) congrats on the house 2) where’s your top from? 3) omg my emotional and physical journeys are so similar to yours—I’m so into your podcast and see so much of myself in it. I feel afraid to give up the emotional eating tho—and don’t k ow why.  Anyway, thanks.", "artfeeds": "This is so adorable! Congratulations on the house! 💕", "gencreasman": "Congrats and need these sandals!! 🤠", "andrewglenn_": "Okay but you look like @maggierogers here ❤️😍", "aprilmariewood": "Uhm did that house come with a time machine cause you literally look 17. 🤤❤️🥳 congrats.", "mollimagsveach": "These sandals are too good!! What are they?", "e.carmanel": "u look so great", "jenmussari": "YES congrats Jen!!! What neighborhood are you in? I have to introduce you to my pals up in Northern JT @thejoshuatreehouse 💛💛💛", "e11imac_": "💖💖💖💖💖", "truecottonart": "So happy for you!!! Congrats 🌵", "a.knapp": "@clknappy 💓💪", "nicolavruwink": "Welcome home 🌵 🌞 ✨", "marrylor": "Welcome Home & congrats 💙", "mimosahandcrafted": "YES", "cacoastnaturals": "Wow we love your page! We're a small home grown olive company, we do everything from picking to packing. Please give us a follow up you like, and we will do the same 🌳👨‍🌾🚜 #organic", "captain_kaytee": "Congratulations!! ✨✨✨", "larachellej": "You go Jen. You’ve made us all so happy with your creative flow, dance, good vibes all day everyday, and your Inspo journals and pencils I cannot do without at my retail buyer meetings where when I doodle my ideas, your Girlboss wit keeps me strong in design and strategy! So heck yes, do what you love!! Proud girl fan here!! 🎉", "thesunfair": "So exciting! Welcome to the dez.✨🌵", "dizzyvapor": "Living the dream! 🌈", "seabreezes.sunnyskies": "Awesome and gorgeous....utterly fabulous! Now I want a house in the desert!", "whiterabbithightea": "Go meet your coolest neighbor @taoruspoli", "rickibraswell": "I’m really touched by your candor and it’s resonating with me. But to be totally honest, I’m COMPLETELY distracted by the kitchen carpet. It must go. Immediately. #whatsthat", "zintwinn": "Awesome👍", "iamjaquez": "So so so happy for you ❤️", "christinealicino": "Congrats👏🏼👏🏼👏🏼", "betyamama": "🔥", "inhayama": "Jen... first of all, congrats! Secondly, I’ve been following you since the Polaroid days of A Desert Fete. All the ups and downs you’ve documented feels so close to me, I’ve recently started to deal with my own anxiety/depression issues and the whole adulting thing, also trying to carve a creative career for myself... and I just wanted to tell you that you’ve been a HUGE role model. Just tackle on!!! thank you!!!", "ashlynparish": "Welcome to the neighborhood! I have a house in JT, too! Love it so much ❣️❣️❣️", "prattejo": "Love all the possibilities for your house and your growth! You are one smart lady and I know you can do anything! Just be kind to yourself! 💖", "cocoferjoux": "That smile 💛", "clairebritton": "Def thought this was a throwback pic because you look 18. Also CONGRATS!! 💗", "floatingspecks": "You look like you’re 16! Looking good Jen", "katarinajaros": "❤️", "getadvancedchic": "So excited for you 💕💕💕🙌🏻🙌🏻", "thekatievb": "Oh Jen, filling me with inspiration continuously. 🦋", "meanmag": "Congrats!! You look 💯", "summerbellessa\nVerified": "Verified", "lauramhoward1": "HAIR QUESTION: do you get tangles? How do you deal with it or how do you not? I feel like an eight year old using detangler. PS love this post ❤️", "clairehwilliams": "Good for you @jengotch ! So very happy for you. I love following your journey on here. You are real and funny and inspiring. ALSO, what is the deal with California and carpet..(?)....2 of our houses here have had it n the bathrooms! Bizarre. Regardless, congrats!! 🎉", "friediamn": "Congratulations! Exciting stuff✨", "jamievannoord": "Congrats! 🙌🎉", "cfbcathcart": "That’s awesome. Congratulations and thanks for the honest post. I needed that today.", "nastyamozgovaya": "congratulations, Jen!!! so happy for you! and thank you for sharing the thoughts and challenges behind this decision!", "lauren_johnson_studio": "Congrats!", "br00ke76": "Congratulations! You are an inspiration to so many. Thank you for sharing all your truths, ups and downs, fears and triumphs with all of us. It matters. Thank you. Hell to the yeah on your desert house!!!! 🌵 🙏🏼✨", "presenceandgrace": "Congrats! I’m inspired by you!", "passporthabits": "So totally deserved. You are a creative genius ✨🙌🏼✨", "jojimenez": "Es tan seca y regia @twinbirds", "amberjoyolney": "Amaaaazing. 😍 And you’re looking so whole. Lovely 💙", "debraparker": "And I want that shirt. Ok, I’m done.", "_kamicozzi_": "I’m SO FREAKING EXCITED FOR YOU 😍😍😍😍 think of all the style you can put in it❤️😍 please share when you’ve added your personality to it - if you’re looking for beautiful art I’m certain you’ll love Jean Smith’s work ( she’s my favorite) @jeansmithpainter", "acolorstory\nVerified": "Verified", "gypsysarah": "Girl, yes! How cool is this?!?!", "3sisters123": "❤️🦋🌵🌸 It’s pretty cool you could make your dream a reality. Welcome home!! What a great feeling. Home owning is work, but so is anything you love. Remember to ride the ups and downs, eventually it all smooths out. Change, even the best of change can be a little bumpy. You are going to love the desert, but you might end up hating that kitchen carpeting. It’s not as forgiving when you make a mistake in the kitchen!!! Same goes for bathroom carpeting😬 The desert reminds me Barbara Kingsolver and her book of short stories, High Tide in Tucson. There is a story about a hermit crab who ends up in the desert unexpectedly and another story involving wild pigs who are very persistent. 💗 I also loved The Bean Trees, Animal Dreams, Pigs in Heaven. Enjoy your home! ☀️🌵🌸🐚🦀🏜🏠🌵", "fleshface": "*built it shelf for plants ANND * built in cutting board! You really went all out 🙌👌🤩", "jkburgin1": "Congrats 👑 🐝 🍯🍾🎈", "stephanie.truesdale": "Yes🙌🏻", "shoplentejuela": "Milestone ⚡️💪🏽♥️ Congrats!!!!!", "nikchelle": "🙌🙌🙌🙌❤️❤️", "sweetpea.1": "You look so young in this photo, like a teenager with all life’s excitement lying ahead of you ❤️. Big congrats!", "milwaukeejamie": "Congrats!!!", "britt_donovan": "Hell yeah! Congrats! You DO deserve it!!", "cydspix": "Congratulations!!!! This is HUGE!🙌🙌🙌", "suleikau": "I love you 🐝🌌", "citoyenne_k": "🙌❤️", "debed17": "Congrats!", "hhafke": "Where are your shoes from?! I love!", "ivapawling": "YOU DID IT! 😍", "lilhcrocker": "💓💓💓", "and.peh": "👏🏻👏🏻", "kristin_ess\nVerified": "Verified", "tanistree": "❤️🧡💛💚💙", "lucysweetphoto": "It must be agreeing with you because you look about 17! Hope it all goes well for you - it looks like an exciting project which of course you can pull off because you are DESERT JEN™️ 💪", "dontbeallhatandnocowboy": "👏🏻👏🏻👏🏻👏🏻👏🏻", "arwriteragain": "Congratulations !!!", "gabriellegoldenhour": "We are in this process too and totally understand these woes coupled with my normal woes/they all amplify each other. Beautiful to read and to see you made it through the journey to close. Lots and lots of love and light 💛💛💛", "sophiavansorgen": "Very happy for you! Congrads!!", "tase_walley": "So much yes 💕", "marboogee": "❤️", "margarethamamoto": "carpet in the kitchen !", "sharondidthis": "Congratulations 🏠🌵💚✨", "pineapple.bliss21": "You look so happy and so young! I swear self-love, self-forgiveness and self-acceptance is the real fountain of youth! Thank you for being so real, candid, and bold!! #yourock #youwin #youinspire", "alexa_robbin": "Ugh IM SO JEALOUS!!!!! My dream is to have a house in Joshua Tree 😌🙏🏼💖🌵🌵🌵🌵🌵", "lizziewarren04": "👏👏👏👏", "heidi__loves": "So many congrats @jengotch I’ve been waiting in anticipation for this news!! Exciting times ahead and you’ve worked so hard to get yourself here - please don’t change your kitchen 😹 it’s already a Scandi Lovers wet dream (aside from the carpet 😸)✨✨", "octoberhello": "Yay! Congrats girl! ♥️🎉", "idreamofkelly": "get it, girl!", "bananalan_a": "Very proud of you because I can relate to all of your self doubts. Congratulations and enjoy it to the sky and back. ❤️👏", "david_b_bopper": "🤘🏽", "floridadawn": "#perspective #takecontrolofyourlife #myhero #yesqueen 💕", "402meg": "How do you a chart a course for your life??! I need to do that. And CONGRATULATIONS ANGEL", "finalfinal.ai": "What an amazing thing for you! Wishing you the best 🌈", "thepetgroupies": "Amazing! So exciting! I love J tree !!!!", "mayibdx": "❤", "little.piece.of.wonder": "Congratulations on your new home Jen. Fantastic! x", "cleloutre": "🙌👏🎉", "minabarrio": "Goooo 💛🤘🏻", "karissanickish": "Oh yes yes yes😍 proud of you ALWAYS", "originalcorndog": "👑👑👑", "lucylitchfield": "I love it! Those cupboards 😍", "adie_": "Wow, I love your kitchen carpet! And this is my first commenting here but I feel like you need to know that your account is amazing and you are amazing. Thanks for being you and sharing it with us all! Congratulations!", "venueunknown": "Can’t wait to watch this adventure! Congrats to you!!! So well earned and deserved", "indiegirl2012": "Way to grow 🌵 Congrats! !", "lilyglass": "Oh hellz yes", "jazzminephoenix": "Congratulations ❤️", "atomitis": "Yassss girl! So proud of you and all that you’ve overcome... also, I hope @idreamofkelly realizes how long your hair looks in this photo and feels a sizable amount of jealousy.", "instasachs": "Future boyfriend will appreciate the charm of desert house and desert Jen!", "stacylondonreal\nVerified": "Verified", "ratboneskinny": "@jengotch amazing! i moved closer to palm springs last year & love it! we should celebrate with cocktails!!", "jennyyangtv\nVerified": "Verified", "christasss": "👏👏👏👏", "jomurphyphotographer": "Amazing!! Huge congrats. Keep the carpet 😂", "raquelzinha76": "Congrats!!!💕", "monicamahoney": "Omg this post speaks to me on too many levels!!! Wait for me, Ian on my way! 🌸🌸🌸", "maryrozzi": "Congratulations!!!!❣️❣️❣️", "beachtownmamacrown": "I love carpet in the kitchen!", "jillsmayo": "Amazing! Biggest congratulations @jengotch — so thrilled for you!! 🌵 ❤️", "ariellevey": "CONGRATS!!! 🧡🧡🧡", "lacopinekitchen": "Yes girl! Can’t wait to feed you 💞", "meredith_trudgeon": "You’re my goddess spirit animal!", "ladiekatieart": "CONGRATS JEN!!! That’s sooooo f’n exciting!!!! If you need any new art for the new abode I’d love to help you out! 😘🎉 I have some cactus pieces called “don’t be a prick” that I think would be nice with this new Joshua tree vibe 🌵 😂", "danalarose": "THIS‼️ You go girl‼️ 🙌🙌🙌xoxo", "umnia": "I love everything about this @jengotch !! Everything about being afraid, all the ways we can let ourselves down, I’m moving into a new place and my kitchen looks just like that! Congratulations on le new chapter 🙏🏾🎼🌱💛", "kararosenberryco": "Are you aging backwards? You look amazing and happy! Congrats!", "highlowjewelry": "Exciting! And ps you look like a teenager here!", "saintflo.designs": "Love this 😍", "hillary_kate": "You deserve all of this and more. Congrats JG on this huge accomplishment! ✨✨", "constancezimmer\nVerified": "Verified", "unforgettablemandy": "This is amazing!", "kelleytremalgia": "Congrats!!! How exciting. 💜", "meghankedmonds\nVerified": "Verified", "jennydcollins": "❤️", "gravitonicstudio": "I love this! What a dream!", "uberherbal": "But the carpet will go, right!?!?", "projectlaurie": "Best of luck - exciting news! Super cute pic too 😍💕xx", "jlcan36": "Awesome! Congrats on your new zen space 👍🏻", "ardenmyrin\nVerified": "Verified", "marissahope": "My recent first-house purchase (a yr in) was a monumental life goal of mine. Means more than an insta comment can contain. Now that I’m fantastically proud, as well as broke, I find myself prepping to bake up my next pie in the sky. You will too. So warm the hell up.", "h____f____": "Beautiful! Love your kitchen! Hand-picked my house for the retro cabinets...similar to yours. So happy for you!", "styleapproximately": "Oh man...you in the desert is gonna be so freaking magical!", "psuar": "an inspiration 👏🏼", "jennifer.fogerty": "Sister, I see you. I bought a wreck and moved 1000 miles. We can do hard things!", "lesaucy": "Congratulations!!!", "annmariemcqueenabudhabi": "I was so unprepared for the emotions that came with buying my first house on my own. You just summed up all the feelings I couldn’t even identify back then 🙏", "studioflohr": "Yay for you! I’m so excited for you🙌🏼", "amanda.oneill": "I am so here for this!! I've really enjoyed watching your journey. ❤️", "mariterecr": "Congratulations Jen! For the house and most importantly for what it represents!! ✨", "designloversusa": "Amazing! Congratulations.", "curlyqpd": "You look happy.....And like 16. 😊", "annebdubs": "You look so young!", "kevadineagency": "@shaneyjo Jen is your new girlfriend in town. Im dm you both. ⚡️", "iamhollyb": "Huge congrats to you!! You are an inspiration! 💙💙", "streicherhair\nVerified": "Verified", "sarahhendler": "Yes!!! Now fancy jewelry shopping! Xoxo", "anewmelody": "Yes! Wise words to truly live by. ❤️ 🌵", "susannasartain": "You inspire me!!!!! Thank you 👏🏻", "hs_ryker": "That’s my hometown! Good luck and stay cool!", "ohjoy\nVerified": "Verified", "unapologeticallygrownup": "Funny", "tanashajuarez": "Thank you so much for sharing this mental process!!! As someone that has experienced bankruptcy, ooooooph!! The inner dialogue. Thank you, thank you 🙏🏽", "warrengesin": "@jengotch @streicherhair @bettierinehart let’s get this desert party started ladies 🕺🏻💃🙌🏼🌵⚡️🌈", "cunning_co": "@lexawakefield love this and her!", "cindybmetcalf": "❤️❤️❤️", "polksaladanna": "Yep yep yep!!! @eskeitj @ripplesthoughtjewels", "houseofhipstersblog": "Congrats Jen 💥 so happy for you 🌵", "iheartartstudio": "Congratulations, Jen! It’s a huge & wonderful step, that you will handle better than you think. And Joshua Tree is fabulous! Spent two weeks there this spring with the family, hiking and exploring around. Fantastic!", "mmdh.studio": "🎉🎉🎉💓", "janding": "Congrats! you’re glowing in that beautiful carpeted kitchen. I just signed a contract and I am feeling the same! Glad I’m not alone!", "pollardamye": "Can i come to the house warming? I’ll bring baked goods.", "fdcaton": "So proud of you!! I KNOW you will rinse out all your cereal bowls without my help!! Love you!!", "poorgeorge": "Fuckin get it 👏🏼", "pdxbrooke": "So thrilled for you!!!!🎉💕", "daniellemaak": "You look like a kid again. Talk about re-birth... congrats.", "snow_wolf_girl": "I love the cabinets tbh.", "jwilsonpix": "Congratulations 🎉🍾🎈", "susanrtynan\nVerified": "Verified", "huntressflorals": "Congrats! I want one too! 🙌🏼✨", "everyonceinawhileisparkle": "This gives me hope for owning my own home one day! Congrats!! 🌵🏠", "21stcenturybotticelli": "Congratulations! And I legitimately thought that this must be a picture of you when you were in your 20’s! You look absolutely radiant and happy! Good on you for getting your desert hideaway!🙌🏻 You deserve every happiness! 💗", "blancheboudreau": "👏❤️🎉", "simplepleasure": "Thank you for this message; I may save it to read again until I believe some of these things, too. 😊", "dearestprudence": "I thought this was a throwback picture!", "giannafoltz": "I lived here for a year and it was such a blessing. Enjoy! ✨", "dundas9": "Hugs of congratulations! 🤗🤗🤗", "pilarofstrength": "Would you have been able to afford this house with no inherited income and/or if your ancestors had been redlined?", "natasha.alonso": "Congratulations 🎉❤️🙌🙌🙌", "imjaclynpaige": "An inspiration to us all ✨", "meessheeplee": "Congrats 🌈", "jvla1975": "I had a carpeted kitchen once. WHY🤔🤔🤔🤔. congrats.", "rebelheartpoetry": "That’s awesome! Congrats!", "blackbirdbingo": "Congrats!!!!💕", "pinkhouse.yuccavalley": "Welcome to the desert! 🌵", "ejmommy": "PLEASE create a gram of the RE-creation of this space! 🙌🏼", "reclaimedspirit": "How do you look 14? Not fair! 😊", "cwstockwell": "Wow!! @jengotch this is fantastic news!! We just sent you a DM; we have some fun ideas for how we might be able to help you bedeck your new space! 😍🌴😍", "hannahpeters": "I’ve been following you for a while because your honesty has resonated with me so deeply. This is such a cool thing to be able to do and you are so worthy of it. Enjoy it all, and let it be the most creative and inspiring space for you 💕🌵", "__nico_": "I pray we get an @mrorlandosoria crossover", "leahreenagoren": "Welcome to desert life!!! Hope you’re keeping those cabinets", "caseybrodley": "Congrats ❤️ also I feel like you’re 15 years younger than when I saw you 4 years ago!", "veganmeatballin": "I love everything about what you wrote and how you wrote it. So inspiring, and enjoy that house and all the joy it brings :)", "jraeace": "@jengotch awesome!!! congratulations! must feel SO sweet that its final and is all yours! If you need an interior designer? I travel!!! No matter, enjoy creating this house into your home! cheers!", "blackphoebeceramics": "Desert living is so very special, congrats lady!!! ❤️✨🌈", "lindsayginzy": "😍", "luckygirlkelly": "Congratulations!!!!!🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈", "minimagkate": "You look so happy! Congrats lady! 🙌🏻👏🏻", "bpatrickflynn\nVerified": "Verified", "tracyghoward": "Can’t wait to see what you do with this place! Congrats...I’ve enjoyed watching your journey and evolution.🌺🌺🌺", "aprilandthree": "I swear you’ve gotten younger", "joyajewelrygirl": "Love this so much!! 🙌🏻🙌🏻💕", "jenaardell": "Congratulations!!!!! 💛 You deserve everything good that you can imagine. 😊😊😊", "charlottestoneloves": "Good for you!! 👏🏻👏🏻👏🏻You deserve it!!", "itsme_imcathy": "🖤🖤🖤🖤🖤", "two13vintage": "Congratulations🎉🎉 I have those exact cabinets painted white/hardware in my 50’s house- love it!", "cozy.posie": "Such a great post and share!!!!", "merzydotes": "Hey neighbor! So proud of you and I just know it’s going to be a magical place ✨", "mujerconfuerza": "Your legs have Benjamin Button syndrome!", "rebeccaegbert": "Reverse aging and making re-charting look great on you. You can handle it and JTree will nurture all those new cells and wires you’ve developed. Roll on, Jen. Carpet and all⚡️", "anna_pearl_diaries": "I ❤️ that kitchen (carpet and all)", "jessicaquadraphoto": "Congrats!! You absolutely deserve it. Happy for you!! 👏👏❤️", "colemoser": "YASSSSSSUH! 👏🏼👏🏼👏🏼", "phelpskathryn": "I cannot possibly love this enough. If you are hiring I'm all in! Just saying.... inspired in all aspects! Go Girl!👏💗👏", "instakdro": "So special! I’ve been visiting jtree in my dreams this week ✨", "ellakop": "Bought a house in March and have felt all these things as well but sometimes you just have to take the leap! Congrats!", "mrs.grossmans": "✨Congrats on the new 🏡!", "aprettycoolgirl": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "heysarahcarter": "Congrats! Can’t wait to see how you make it your own. 😍", "thewellreadwanderer": "Its going to be awesome!!! Carpet in the kitchen! That’s the best! We had that too in one of our houses. Must’ve been one of those weird trends. I remember my grandma having carpet in the kitchen. 🤷🏼‍♀️", "lanavhansen": "🙌🏻🙌🏻🙌🏻", "topanga_vintage_market": "I thought it was a #tbt shot of you as a teenager! Have fun with the new house. Advice from someone who has a 1962 Doublewide, go slow with the reno 👌❤️", "heatherrnewton": "🍾✨🍾✨", "sarahhaydeeq": "Omgggg sooo cool! 😍🤩 #proudfan", "thisrepairshop": "Yay!! Congrats!!! Keep the carpet", "soup_sarahmay": "Love it!!!! Congrats!", "jo_szeto": "I thought this pic was you in high school! 😂 Congrats! 💯✊🏼", "kelseylynnstevens": "CUTE!!! 👏🏻👏🏻👏🏻", "sfgirlbybay\nVerified": "Verified", "konfessions_of_a_kathlete": "Awesome, congrats! 🙌💕", "julann.j.h": "Living my dream!! 🌵", "amywray": "Congratulations!!! I am so happy for you and proud of you!", "annabrockway": "Congrats Jen❤️", "perlin65": "This gives me hope! Just decided to hell with it I am moving several states away to a place I know no one and with or without a job. I too am planning on buying a house and have had the same issues. Your house looks kinda retro, I hope we get to see more photos! Good on you!", "ecduzit\nVerified": "Verified", "megisdarling": "Those cabinets😻😻😻", "delfinaingridd": "👏👏👏😍", "deborahburch": "🔥🔥🔥🍾🍾🍾 Congrats", "mamabail": "👏👏👏👏👏 You look so happy, and full of life.❤️", "kelseyarrowood": "I feel like you are unaging 😳😍 You look so young, gorgeous and vibrant!!! Congratulations!!!!", "schaefferk": "🙌🏻🙌🏻🌵🌵", "hilarynewman20": "Lookit the little eyes in the vent! So fun! The place fits you so good! 👏❤️", "geeja4": "Congrats!! 🎉", "stesspage": "Congrats and nice cabinets!!!!", "gokateshoot": "Ahhh congrats lady!", "allie.nu": "Wow 😍", "swabyjustin": "I live here!!! But theres no ocean for to jump into fully clothed here! Hahha. Welcome home!", "chrissybchrissy": "🎉", "jessica_uphold": "You, yes you, Jen Gotch, are perfect", "tinybonespress": "congratulations!!!!! ✨✨✨💗💪🏼🎉", "misden_mora": "🎉Congratulations 🎉 🍾", "rebecca_atwood": "Congratulations!! So exciting. I can’t wait to see what you do with it and hope it’s a place that brings lots of joy.", "denai_jones": "so happy for you!!!!", "smile_songs": "Congratulations! Carpet in the kitchen? 🏠 ❤️", "adventure__ness": "Congratulations 🎉 ❤️☮️", "victor_fox_design": "Babe!!!", "lady_gerhart": "Congratulations to you!!! I’ve only been to JT once, but I adored every moment of it... yay for feeling your strength it’s an amazing thing... you “Gotch” this ❤️", "sixtee_isthenew_fortee": "Epic news 💕💕💕", "maggie.goodhall": "💖", "sarah_harmeyer": "Incredible! 👏🏼", "sortner": "Congrats on the growing!", "phares": "@swabyjustin a new neighbor", "angeliquetr": "If you remodel the kitchen, make sure you draw eyes under all those slanted handles. They look like cartoony eyebrows to me!", "sunfolk": "🌷🌷🌷🌷🌷", "ursulaobserving": "You deserve this!", "dagmar.morgan": "Yay! Celebrating with you!❤️🙏🌸", "sunshone": "💯", "bettierinehart": "👏✨🌵🦅🌵✨👏", "faithchops": "#hudeering", "flowersandgarbage": "Fuck yes! Congratulations Desert Jen! So happy and proud of you. You are living my desert dream. Somedayyyyyy 💛✨", "stephpressman": "Joshua Tree is one of the best places in the world for resetting your mind and intentions so if you are having all these feelings it’s a wonderful place to be for it... welcome home... 🌵🏠", "2largepassionfruiticedteas": "oh hell yeah", "janellemeghan86": "This is amazing!! 👏🏻 Also, dearest, you look 20 years old in this photo 😭😍", "desireelvreim": "Such an accomplishment. You should be so dang proud of yourself ❤️", "shopb.ca": "Congrats Jen! 😍💗✨", "belorabelay": "yay you.", "peteklagram": "@benjaminuyeda new neighbor 😎", "oftenwander": "Congratulations Jen! You definitely deserve this. Enjoy it!", "jeddierose": "‘I got to re-chart a course for my life’. Really needed to hear this. Love your optimism. Congrats, Jen! 🌼💛", "bristolnicole": "So fun!!! This is great🙌😊", "rubyrydermama": "Love you and your telling of your story. Congrats, you do deserve it ALL!!! ❤️", "bierly": "“You have the power to take control of your mindset anytime you’re ready” 💥💥💥 Boom!", "bold_type_creative": "Congratulations beautiful lady 💕 🏡", "purpenomad": "Thats nice", "robinanng": "@jengotch I love watching your stories and reading about how you are doing and how far you have come. That it’s a journey and takes time. But you do feel better and it all gets better and it’s okay to be dark sometimes. Congratulations on the house and all that goes with it!!!💕💕💕", "lashaundale": "Your words direct to my spirit 🙏✨💕#Fullyinspired & congratulations !!’", "ourheiday": "Hooray 💛 So happy for you!", "gracesmith72": "this post helped me tremendously...thank you and congrats on the hizzy 💙", "gingerty": "Preach. And congrats!", "mrmatthewpaul": "@laurie.salmon @nikkiyun", "youshouldmobetter": "Congratulations!! 🎉", "dancingwithdarkness_": "You are such an inspiration. Congratulations on this huge step! ✨", "rebeccameital": "I am so happy for you!", "whitefigdesigns": "🙌🏼💐💥", "csullivandesigns": "Congratulations 💕", "vintage0809": "Jen!!!! Congratulations on so many personal goal levels. You’re such an inspiration.", "sophiamzell": "This kitchen looks perfect on you! Congrats 😻🔥", "elsielarson\nVerified": "Verified", "cottagepleased": "You’re never to old to live the life you want to live. Go Jen!🌵", "mewzikgirl": "Congrats! So excited to see more of you smiling there and living your best life!", "katyebomb": "You literally look like a teenager! #goals! Enjoy your new home 💫", "kyracultivar": "@vivreplus 💗", "sswassel": "Since when can 16 year old girls buy houses?!? I like this idea of home ownership as an age regression model. You look like a babe!", "cheerupoldbean": "Look how happy desert Jen is!! Congratulations!!!💕", "homerfridafrank": "You look so happy (and about 16 years old). 😉 Congrats!", "jillianrenedecor": "Congratulations! ✨", "saaammie": "@k.m.kaiser 🥰", "ter.rif.ic": "Thank you for sharing your experiences! They make me braver ❤️", "kikibsmith": "But it’s Joshua Tree carpet 😉🌵", "greathonourgoods": "That cactus in the front yard is 👌🏼!! So happy for you! 🌵 💛", "helenpetticord": "Hero.", "_kayjayyy": "You look so great ❤️ you’re radiating positivity. I am SO happy for you. You’re such a role model for me 😭", "wfisher21": "Congrats!!! ✨🌵🏠✨", "christinalynn82": "You are amazing!! Congratulations on the house!!", "hey.caramargot": "you look so happy and healthy and it’s rly giving me life + hope thank u for sharing queenie 👑", "saraheliiza": "Go Jen! Go Jen!", "msamandagreene": "Enjoy a delicious meal at Crossroads for me...", "___.v__v.___": "🙌🏻💛", "thescarfandstripe": "Yeah!", "lancekhazei": "Congrats, Jenny! On your house and your kitchen carpet. That’s fantastic! ❤️", "lorettalynchdesign": "Love you! Love this! Here for any design questions!", "123birdie": "I completely *get* this! You are an inspiration. Thank you for sharing. 🙌❤️🙌", "kristianity9": "So excited for you! Thanks for sharing ❤️ means a lot that you're so open about your mental health", "ashley_skyeb": "I have to be honest- I had to google your age when I saw this because you seriously look like you’re 20 in this picture !!! #goals 🙌🏻🙌🏻", "lindsalexis": "💛💛💛💛💛💛💛💛", "vickichristine": "Congrats!!! 🎉💖", "nicholeaileen": "Please please please say that @em_henderson is doing the design!", "alisonkatej": "Yes and amen! Thanks for sharing and congrats!", "rebboh": "Congrats! I went there this summer-- jt, & loved the desert! Seriously, magic is in the air! Enjoy!", "maceopaisley": "I’m moving in. Yes, I cook. Thanks ok,bye. ;) Congrats JG", "taylorelise5": "Welcome to the desert! It’s magical and so are you ❤️", "nicsummerhill": "Joshua Tree is magical, so it only fitting that you bought a house there. Congrats!💖", "christlytaylor": "I’ve never been more excited for someone I’ve never met or spoken with in person. Congrats!!!!!! 🍾", "thecarib": "We are all so proud and inspired! ❤️👏🏼", "marthaeelman": "Wahoo!!!! How much fun!!!!", "schmancytoys": "Congrats!!!", "nic0lege0rge": "So exciting ❤️", "thesunadobe": "Congratulations desert Jen 🌈🌵", "howdyfromgrace": "You are a true hero!!!!!", "dimples_ca": "🎉Heck about the carpet, WORKING A/C key?", "charlottestoneshoes": "Congrats!! 🥳💕", "christinawinkelmann": "It’s all happening!!!!🙌🙌🙌", "kevintis": "Congrats to the desert and y’all.", "leslieschor": "Please don’t change the kitchen! So charming", "mayabrenner\nVerified": "Verified", "alie_reid": "🧡🧡🧡", "katydikadesign": "You look happy... and 15. And I mean those both as a compliment! 💓", "cocorosedesign": "Sooooo much yes!", "knarlei": "Yyaaayyy!!!! Congratulations!!💛🌻💛🌻", "courtneybee76": "So awesome!!! Congratulations!!!", "jcoty": "🎉🎉🎉🎉", "vickigreenfl": "I’m digging those cabinets", "nataliemyers": "Congrats 🎊🎉🎈", "gretchcannon": "👏👏👏👏", "butterfloursugarnyc": "And congrats!!!! 🎉🎉🎉🎉🎉", "opinionatedjacqueline": "So happy for you!!! You’re amazing ❤️", "heathyrlawrence": "Catgraduations 😻=^,^=", "happicat": "Wow, I didn’t think you could buy a house when you’re 15. (Cuz, ya know, you look like you’re just a teenager #aginginreverse)", "annabdavid\nVerified": "Verified", "jennyeveryday": "👏🏻👏🏻👏🏻👏🏻🎉🎉🎉💖💖", "haasee": "You're glowing like a teen in this photo. You got this, when will you be accepting visitors? 😉", "dmvosburg": "But will there still be trash dances?", "stylemissmolly": "You are so inspiring! Give me so much hope ❤️ congrats babe! So happy for you 😘", "queensparkle1": "Congratulations!🎊 👏🏻🥂🍾 @jengotch This couldn’t have happened to a greater person person!", "randomlysamantha": "Yay! 💃🏼✨ Congrats!! ❤️✨", "alchemy43\nVerified": "Verified", "raenainteriors": "This makes me so happy. I LOVE DESERT JEN and this house is going to be the best.", "lexrosenbaum": "You’re incredible 🔥🔥", "kenzwell": "Need a tour! This place looks amazingly charming", "erinjeandolan": "So excited for you!!", "joiebutter": "Hell yeah you can handle it 👏🏼👏🏼👏🏼👏🏼", "kate_burns_chad": "💖💖💖💖💖", "mish_aguirre": "💛", "jessybarden\nVerified": "Verified", "elissa_edits": "Congrats!!!", "lewiday": "You are truly an inspiration. Thank you for sharing these snapshots and reflections of your journey. Also, I grew up in multiple houses that had carpet in the kitchen AND the bathrooms. Shag carpet in the bathrooms, obviously.", "simoneludlow": "💛💥🥂💯🌵🌙", "inklingspaperie": "Yayyyyy!!! 🌵🏠🌵So very happy for you!! 💕", "crystallynart": "🥳🥳🥳🥳🥳🥳", "artalatrinca": "Do you follow @thejoshuatreehouse yet? Because they are your future BFFs", "covrtbailey": "!!!!!!!!!!!!", "the_greybee": "Congratulations on the new desert home 🌵🏡", "jillmaribel": "Congratulations!!! Love this. All the best to you 🌈✨❤️", "suesaylor": "Congratulations and YOU are so worth it!! You have written words that I needed to hear for myself and a Journey that I want to pick up again. Can’t wait to follow along and see your Home ♥️", "disco.vision": "This is amazing and so are you!", "aklimton": "Congratulations Jen❤️❤️❤️ I am happy for you😍", "amypouliot": "con-fricken-gratulations!!", "kristinakellyho": "Congrats 👏🏼🍾 💗", "littlekorboose": "YAY! Congrats, Jen! Love my Jtree. I’m usually right down the street from you when I’m there 🖤🖤🖤", "mamaofthedoc": "💓💓💓", "jessronagrooming\nVerified": "Verified", "crissyperham": "Congratulations! You’ve got this! 👊🏻😍", "mcastyling": "My absolute dream! My heart is in the 🌵 Enjoy your home to the fullest 💕", "yireh_": "SO happy for you", "dnelle.stumbo": "Welcome to the desert girl!!!! You’re going to love it!!!! ❤️🌴🦎🌵", "arielpcox": "So much charm! So proud of you and your growth ♥️", "tinymighty.ca": "Awesome and those shoes! 🔥", "m_marty67": "No one is EVER responsible enough to actually own a home. The ones who make it look easy are just rich enough to pay the responsible ones to do shit for them 🖤SO proud of u & SO excited for home inspo hopefully coming our way very soon 🤩💖", "smithaureens": "👏🏾👏🏾👏🏾👏🏾😍", "vonneywong": "Congratulations!!! BTW do you have the Benjamin Button disease?! You are aging backwards!!", "leahrward": "Yay!!! So dang exciting. New chapters, new houses, new you!!", "createcultivate\nVerified": "Verified", "xoxo.lauda": "Congratulations! 🎉 And look at how long your hair is!", "jacksfoodla": "Good, I’ll be out there next week. We can do some mushrooms 🍄! .", "thislittlemiggy": "Congrats. Not that you need to hear it from me (but also in case you do) you deserve this.🙌🏻", "ebekay": "Wow this is epic! Congratulations to you! You f@&king deserve it! 👏🏽👏🏽👏🏽❤️", "antoramajumdar": "🙌🏽", "confetti_rebels": "WELL CONGRATUFUCKINGLATIONS!!!!!", "girlwithatail": "Congratulations!! 🌵🌈✨", "llindseyy": "YAY congrats Jen!! ✨", "miriamshanny": "You’re the bomb", "sweetescapecreative": "Yessssss girl! You go! I just took the leap and bought a cottage and went through many of the same feelings. Happy to say that once the dust settled I’m feeling excited about it all!", "kirstenblowers": "love the... “i got to re-chart a course for my life...” great mindset i’m going to borrow.", "happilyme123": "Fantastic! Congratulations! 🥂", "mollycatherinelewis": "THIS. I too am in the midst of life changes while dealing with debilitating anxiety, depression, and a chronic nerve issue to boot! Remembering that I can handle any issue that comes my way is so helpful, as are helpful reminder posts like this one. Thank you @jengotch ❤️", "jesstinybird": "So proud for you!", "amyjeannefox": "Thank you Jen for your authenticity and vulnerability. Witnessing your struggle and growth and just downright delicious self awareness is such a huge offering, you ma’am are an inspo and a leader. 🙏🏻", "wrobson": "🙌🏻💛🙌🏻", "sparkleplenty_": "Jen you are such inspo 🌈 Thank you for being you ♥️", "alshultz": "🙌🙌🙌🙌", "elleebeans": "So proud of you✨", "gracielovekin": "This is awesome news Jen! I’ve been following you for awhile and it’s so exciting to see take this leap (and all others before!) congrats desert girl!", "ailemila": "Siento que @jengotch debe ir a verte en un de tus presentaciones o mínimo seguirte @hellofears #TeamZeroFears is not worthy", "jmorgangray": "Love how honest you are. Congrats on the new adventure!", "weelicious\nVerified": "Verified", "thebeautyproject.is": "Congrats!! So happy for you! ❤️❤️❤️", "mamacsays": "I thought this was a flashback pic of you as a teenager! Congrats! Exciting!! ✨🎉", "alliclement": "Holy freaking cow! Congrats!!!!! I want to buy a house in the desert one day 💫💛🌵", "pigeonfuture": "Yay! Congratulations!!", "e.marlow": "@lhiatt are you neighbors with @jengotch ? 🤷‍♀️", "stay_golden_joshua_tree": "Welcome!", "kelseygerhard": "it’s sooooo cuuuuute. 🎉", "itsjenjeffery": "Congratulations! Can’t wait to see what you do with it!", "_francyface": "I don’t know you but I’m so happy for you/proud of you for claiming your life! ❤️", "thesophiepton": "You are SO worthy ❤️. Not sure if you remember this, but my husband had you record a “Happy Birthday” message to me for my 30th a few years ago, and it was everything to me! (He had emailed you with ABBA’s “Take a Chance On Me” 🤣. ) I’ve watched your journey for many years now, and you are truly such an inspiration. I am beyond happy for you and can’t wait to see how the future unfolds. You are magic ✨✨✨", "amysayerp": "👏🏻👏🏻👏🏻", "irenegianos": "Soooooooooo excited for you Jen!!! You got this!!! 👏👏👏👏❤️❤️❤️❤️", "ivyandstone__": "Following you and your journey is so damn exciting and inspiring!!! Love you and what you share 💕💕", "rosewinemansion": "1000 congratulations to you!! 🎉🎉🎉 You’ve definitely GOT. THIS. 💖", "thebotanicalstudio": "congratulations @jengotch!!!", "angiembean": "Congrats, Jen! So happy for you! ✨🌵", "francescalacuesta": "Congrats! Pema Chodron’s “When Things Fall Apart” is on my rotation after the last time things fell apart. I listen to the audiobook several times a year, when things haven’t fallen apart and it has truly helped.", "shasta_shardae": "So real! Just was pre-approved for my dream getaway tiny house and struggle with all of the above! Thanks for always telling your truth.", "hew_clothing": "👏🏻👏🏻👏🏻Yasss all that hard work💪🏻💪🏻", "jillsdo": "Mazel tov! Btw you’re totally Benjamin Buttoning. #teenboss", "rociowatts": "@jengotch Congratulations sweetheart. The Desert is wild and sacred and will bring many many blessings to you ❤️🌵", "blissandmischief": "Super inspirational, lady! 🙌✨", "stacy_russo": "Congrats! I love yucca... you can tie dye your entire house if you want🤗 it’s so easy to be happy for you🤩", "rosiebunnybean": "Congrats “neighbor”!!!!", "kristin.bear": "Yesssssss girl congrats!!!", "sasha_darling": "PS you are totally 100% worthy Jen!!!! I'll keep telling you over and over as long as you gently remind me too! ❤", "m.artliving": "Such a great accomplishment..", "sheridansturm": "AMAZING 🤩 congrats jen!!", "absolute_mt": "❤️", "helendealtry": "Weeeeeeee!! Amazing Jen, congratulations! VERY a well deserved.", "giselaldiaz": "Congratulations Jen! You are radiating in this picture!", "amhunter3": "❤️", "kbuzzy": "Yes! You can handle it! And I’m excited for your new desert adventures. Message me anytime you need a lunch partner or fall walk/hang", "tangtues": "Your caption in so meaningful to me, @jengotch. I too recently received the opportunity to change the course of my life and taking those first steps into the unknown have been so terrifying and thrilling. Not without their doubts but I'm getting better at acknowledging those moments and talking myself through them. Your honesty and sharing feels like a kindred boon. Congratulations on your new home and may your blessings resonate and perpetuate!", "soozeequ": "Congrats! YOU GOT THIS!!❤️❤️", "thekdv": "Congratulations!!!!!", "ohayitslj": "yayayayay!!!", "ohhiholiday": "Amazing! 💞", "mbaudone": "Congrats beauty !!!!! ♥️♥️♥️♥️", "hillarykerr\nVerified": "Verified", "tpagnani": "Love this 🙌🏻", "kaylanicolejordan": "I love this. Congratulations 💕", "alialquiza": "Congrats you amazing lady 💥🙌🏻 so so well-deserved ❤️", "katefranco": "🖤🖤🖤", "prettycrabby": "YAY. Always inspired by you and your growth. Shine on, bright penny! 🌈⚡️🎉💖", "thebodysmith321": "JT is beyond magical. Congrats", "fleurishing": "congratulations Jen! 🎉", "mosey_me": "👏🏻👏🏻👏🏻👏🏻👏🏻", "elizabethrolf": "Feeling all the proud mom vibes for you!!!! ✨💓", "tarajhaaz": "Amazing!!!!! 💖💖💖", "ginarockenwagner": "Congratulations jen! My mom’s house in JT was a piece of work when she got it. You’ll get through it and it will be great!", "kristina100lc": "So awesome Jen!!", "ashleyhaywood": "yayyy congrats!!!!🧡🧡", "graceful_cooking": "So exciting congratulations!!!", "megantapper": "@salt_and_still us next?", "mrssharkey": "You CAN do this. Congratulations!", "marikarudystudio": "🌵🦄congratulations 🦄🌵", "robinshorr": "Let’s go to the Integratron!", "lorienstern": "😎😎😎", "agapanthajewelry": "So exciting, congrats!!", "thewcollective": "congrats ♡ my biggest and most confronting growth has happened among the 🌵", "honeymyheart": "❤️💖", "dbuerli": "Want to hear more about this carpet", "jeanettelotzroberts": "You need to become friends with @iolovesyou! He has a house near Joshua Tree!", "tiffoneill": "Congrats..that’s v exciting!", "madylouu": "I hustled to live in jTree! Grew so much as a person there and am so thankful for that experience! Congrats!", "maryanneofla": "🎉Mazel tov!🎉", "jenna_leonora": "My family’s house in the desert has been, well, in the family since the 60s. It’s my favorite getaway place to this day.", "sheltered.co": "Yassssss girl!!!!! I’m so proud of you!!!!!!!🤗🤗💞💞💞", "emsuenic": "This is wonderful!! Congratulations!", "wildeyed.shop": "This is my dream. I am so happy for you and seeing that you can do this shows me that I can too. Happy happy joy joy ❤️", "ourvintagefarmhouse": "Congratulations gorgeous!!!! And you look so dang amazing + happy!! I’m so proud of you!!!", "luckyjennyjackson": "Love watching you evolve on your journey. Always inspiring.🌟💛 Congrats Jen!!", "novenacarmel": "Jen!!! I’m living for your glow and zest for life! Congrats sista! 💛", "hasselbach": "Congratulations!!! I love who you are!", "gibsontuttle\nVerified": "Verified", "jana_fabulous": "Congratulations desert Jen!!!! 🔥🔥", "instalite18": "So happy for you!", "rhonda_35": "🎉🎉🎉 Wishing you much love and laughter in your new home! 💜", "lisakwhite": "🙌🏼💫🙌🏼💫🙌🏼💫🙌🏼💫", "brookerodd": "Congrats!", "tulajeng": "Wow!!!! 👏🏼👏🏼👏🏼👏🏼", "letteredcottage": "Literally thought this was a photo of you as a teenager. ☀️", "alison_briggs": "Congrats!!! Please share what you do with the place!!!", "brelindawadley": "Ohhhhh yaaaayyyyy!!! One of my favorites is now a neighbor! 🖤", "nightmoves_jt": "Welcome neighbor!!! 🌵✨", "analyngrasz": "YOU TOTALLY DESERVE IT JEN!!!!!", "thealexa": "😍😍🤘🤘", "ienvyseas": "🙌", "kaarins": "This looks AMAZING!!!! So excited to see what you do with this place!", "sarahellacole": "I see the joy in your face🙌🏻✨ congrats!!!!!", "creativelyvictoria": "Congrats, babe! 🙌🏽 you totally got this 💕", "annhowellbullard": "YGG!!!!!! 🔥🔥🔥🔥🔥", "lynch_alexandra": "Congrats! You are inspiring!", "ashleyeshuler": "YAY", "momlifemusthave": "You are glowing 🙌🏼💖So happy for you!", "toshamccarter": "Your awesome ☺️", "cherrychriss\nVerified": "Verified", "guerreiroclaudia": "So exciting! Super happy for you. For the house and all your growth. Speaking of growth, you look 16 here!!", "laurenmarttilaphotography": "Amazing 🙌🏼 your home and the journey to get there. Congratulations ✨🌵 ✨", "mandymooremm\nVerified": "Verified", "amy_starlight": "Congrats!! Also what sandals are those? So hard to find supportive and cute!", "teresea_art": "💯✨🙌", "nycwellness": "Bravo💛", "kodibevelle": "Well, shit man. I needed to read this. Congrats! 💗", "agoldygirl": "So damn happy for you! 🤗", "raquelmideau": "Congrats!!! So happy for you! 👏🏽👏🏽👏🏽", "ratherkeen": "I kind of love those old cabinets.", "mamapajarito": "Congrats Jen! 🧡😘", "mollewing": "My brother has a place in Yucca Valley...such a perfect place to escape!", "sweetly_at_home": "Love this 💕", "the_silentpartner": "I love it", "justplainrachael": "Definitely thought this was a picture of you in your early 20s 😱", "tauhney": "OMG WE WANNA SEE.", "beedreams": "Made me cry and I don’t even know ya! 😘 Congrats", "tamarataggart": "BIG congratulations ✨", "iedee19": "CONGRATULATIONS", "lauren____elizabeth": "Omg you and @shaneyjo need to be friends tho", "erinjandarawlings": "❤️🙌🙌❤️", "mediocreyogi": "Have you seen Ingrid Goes West? lol", "sfoppel": "Way to go! Enjoy every minute!", "britsbee": "This is the best news!", "tracey.lynn.thomas": "Omg you are aging in reverse I swear...congrats on the new home mama! 💕", "hurtherbronzun": "What shoes are those? 😍😍", "heychristinawinter": "Yes! This makes me so happy! You go, Girl! 😍🙌🏻🌈✨", "sarahbeth.ramsey": "Omg I love this! Amazing 🙌. So happy for you and thank you for being honest- it’s so relatable♥️", "sona_jasmine": "Congratulations Jen!!", "schadtgun": "Fuck. Yeah. 👏🏼👏🏼👏🏼", "fridalunac": "The house makes u look like 20 again!!!💖", "doddleandcompany": "Amazing!! 🙌 🌵 ❤️", "katherine.l.matthews": "Congrats!! Thank you for sharing so much of your journey with us on ig. I’m so happy for you, and can’t wait to see more pics of your new digs! ❤️", "costumegirl": "Woooot!! Congratulations @jengotch 🤘🏽🖤🤩", "bonstanceandclyde": "You got this 💯", "hardstark\nVerified": "Verified", "empireofstuff": "Those cupboards look nice on you 😉💛💛💛", "pnutjg": "Congrats!🎉", "kjerstieb": "Joshua Tree is the bessssstttttt", "adoramuchi": "👏🏽👏🏽👏🏽👏🏽congrats 🎉", "jenesigl": "You're such an inspiration! ✨", "noseph": "So much room to cut baby lemons!!!! 👏🏽👏🏽👏🏽👏🏽", "rally.co": "So excited for youuuuu 💕 having a home and feeling at home in it is truly the best :)) lots of love to youuu xx", "kat_thorne": "WE LOVE DESSERT JEN", "rachmasterflex": "congratulations! you deserve this 🤗 🌵🌞", "elizaruuu": "Congratulations 🎉🎉🎉", "cecilia_breanne": "We love you Jen gotch ❤️❤️", "garancedore\nVerified": "Verified", "covetatelier": "I was just in JT for the past 5 days and it was HEAVEN.✨Sending so much love, healing and REST to you in your new desert home. You are so so deserving of this time, this place, right now!!!", "anndanger": "omg yes YES YES!!! i love this for you! can't wait to visit desert jen.", "oldwestnaomi": "Amazing news 😍 you deserve it so much", "glow_ml": "👌🏼 Just inspiration I needed today! Congrats", "takeonedailymedia": "❤️🔥❤️", "getshagged": "So happy for you, Jen!!", "rachaelseiter": "👏🏻💃🏻❤️ congrats! So exciting!🤗", "jilljlang": "Yay! 🙌🏻 This is amazing and awesome! You deserve all the happiness ❤️", "elouisea55": "Thanks for inspiring me. You’re the best! 👏", "zaragogo_": "Congratulations! This is so inspiring and motivating! I NEED pictures of everything pleaseeeee 🙌🏼🥳💕", "theilluum": "Yay, Joshua Tree locals unite 🙌🏻🙏🏻", "gunnerandlux": "So happy for you", "mellamoesjae": "Thank you for this 😭♥️", "real_skinn": "I’m so happy for you🙌 as happy as I can be for someone I don’t know irl!", "sarahshermansamuel": "Yeassss! My heart is still in the desert. So happy for you. And also actually digging those cabinets, not so much the carpet. 😂 ❤️❤️❤️❤️", "jesssantoyo": "🎉🙌🏼CONGRATS!!! 🍾🎉🎊", "bergitrose": "Jen you are the best", "blur9380": "Congratulations 🎉🍾 ✨💕", "justjill": "I’m available to spill champs or tequila on that carpet any time. 🙋🏼‍♀️ #iloveyou #callme", "southsidemichelle": "You’re such an inspiration.", "cinrogers": "🙌", "ginarachelledesign": "Congratulations!! 🌵", "luly700": "Fantastic!!!!!! Congrats!! 🙌", "laurenlapkus\nVerified": "Verified", "emmadessau": "@kristineosbo we love jen gotch and her mental health awareness posts and posts about her triumphs in life. all things are possible", "lyndsayalmeida": "So happy for you!!!!! 👊🏼❤️", "spring_valley_farm_pa": "Yes to carpet in the kitchen! J/k Only if there’s carpet in the bathroom too.", "leeleecheche": "Who cares about the carpet, because your hair looks amazing ☺️😘", "jessicadaviesmetalworks": "Bravo, woman! You did it! 😘", "imallieallieallie": "Congrats Jen! Can Iva and I come hang out?", "tikidominiki": "Congrats!!! Love me a desert house, as you know 🌵😍👏🏻", "tarawhitney": "This is so fuckin rad, jen. 💪💯", "bea_pyle": "so happy for you 🌻🌻🌻", "natnoodlelongo": "Way to go Jen!!! You are such an inspiration! Can’t wait to see your dances in the desert!", "alysiaalex": "Yay yay yay! 👏🏼", "choooch6": "Woo Hoo! Congrats! 🌵🎈🍾", "brodie": "Omg house tour please 🤗", "erikampowell": "Proud of you!!! You are worthy of it!!! ❤️", "ellen_arthur": "Yas!! Are renovations happening? If so I'm here for it xx", "kel__belle": "👏🏻👏🏻👏🏻", "kristen.poissant": "Ahhhhhh 🙌🏻🙌🏻🙌🏻 so exciting!", "charmedlifechs": "Fantastic! See you soon! 🌵 lol", "saramoon": "🎈🎈🎈💃🏽💃🏽💛💛💛so happy for you", "teamwoodnote": "yay yay yay yay for desert housessssss💛💛💛", "bbelkin": "Company retreat? 😉", "the5dells": "Many congrats ✨💛✨", "wineandrockshop": "❤️", "missemilywright": "So stinking happy for you! 👏 Bravo!", "karlitapamanes": "🎉🎉🎉🎉", "kjblattenbauer": "So. Damn. Proud. Of you. 💕", "twyla_dawn": "👏🏼", "carolinesomers": "CONGRATS!!!!", "emily3t": "❤️ So happy for you! Thank you for sharing your story. Especially the self worth part. Really timely for me to read that. And you loom adorbs in both photos. ❤️", "dearwhimsy": "Congratulations!! Now @mrorlandosoria needs to come over with his magic! ✨", "mstarrevdesign": "biggest congrats jen! you’re truly an inspiration to us all!", "casadehappy": "Congratulations Jen!!! 🎉🎉🎉🎉", "sanjasrdanov": "That kitchen!💓👌🙌 Congrats!👏", "kaysujin": "✨🏠🌵☀️ 🙌🏼", "chantalmooreskintherapy": "🙌🏼", "swtalohagurl": "Congrats 💞", "elizmccraw": "Hey @jengotch, I really needed this message, thank you and I’m so frickin proud of you.", "paulaebarnett": "YES 🙌🏼 I’m on my own path of having had my life explode in front of my face; I’m one year in next week and it’s been wild. Thank you for being an inspiration ❤️ and congrats the desert is amazing", "frittsrosenow": "Yay!!!! You need to make so many more tie dye clothes @jengotch 😍", "craftworkpainting": "Woot! Congratulations! ✨", "alicia_garbett": "I don’t know you but I really like you", "lynseycreative": "@jengotch congrats, lady!! What an amazing symbol for your journey 😍😭🎉", "_beckykimball": "Congrats! You have been someone I’ve admired for so long and you deserve all the happiness and love in this world!!😘", "dallanonna": "mazel!! ✨💛✨", "sarahreillyengel": "Yes! #desertjen forever. Time to build a compound✌🏻 Congrats😍", "christinedecarvalho": "So amazing! Congrats!", "karlawelchstylist\nVerified": "Verified", "kellyoxford\nVerified": "Verified", "shopbando\nVerified": "Verified", "choelita": "Jennnn congrats ! Wish you the best!!! 😘", "mamainbloom": "This is all so wonderful, congrats! You look so happy 💛", "vadaashley": "Congrats! So inspiring 💜✨🔮", "gossamerview": "❤️❤️❤️❤️❤️", "dmb.317": "congratulations jen!😍😍😍😍", "missssayy": "Aw you deserve it♥️ congratulations love!!", "katelynjroberts": "👏👏👏", "noxshop": "The dream 🌵", "charmingchels2": "Is this your new permanent house? Are Phil & Gertie coming too?!", "hugofromkamakura": "😉thought that was it !!! You rock 💋..... 🇯🇵✨✨✨✨", "brandeyehome": "That kitchen is awesome. And so is that cactus. 🏜️ Congratulations!", "_amandadawn": "So happy for you ✨", "molliejoydesign": "So when can we come visit? JK but congrats! You’re an inspiration and I don’t mean that lightly. 💕🌵💕", "jenibrittonbauer\nVerified": "Verified", "sonjarasula\nVerified": "Verified"}