{"meganpitsios_therapy": "As always- love your honesty & your resiliency! 🌈💛", "rachelsarahsays": "have missed your posts so much - they’re so grounding and real and raw. I absolutely cannot wait to read your book.", "ash_lee_tharp": "💗💗💗", "kbuzzy": "Feeling all of this. My tree has definitely been shaken these past 6 mos. 💛", "lhp_to": "this makes sense to me.❤️👏", "jennifer_s_hudson": "YOU ARE A TOTAL INSPIRATION!", "joann.serrano": "❤️❤️❤️❤️❤️❤️❤️❤️", "allymisslove\nVerified": "Verified", "hannahpapernick": "Love you Jen", "srfchk17": "Don’t forget that this time also for you because you deserve it.", "paigecmoriarty": "Yes the trees are shaking, thank you for the words, and go you!", "coralscountry": "Absolutely amazing. Thank 🌟you.", "lcinjc": "Thankful for you, and always wishing you well. 💕", "thefashionsheriff": "🌟#style", "miriamshanny": "You’re amazing", "lastochkin77": "💎", "caitlin_hausser": "Super excited to see you at the Summit on Sunday !!!", "juniper_0410": "My tree is being shaken.. And reading this made me feel better. Thank you..💜", "saintjanebeauty\nVerified": "Verified", "claire__cj": "Reading your posts has been one of very few small lights that I can almost see at the end of the tunnel. Feels appropriate to comment on this post as I’m currently sobbing at the end of my bed. Thank you for sharing with your audience.", "cakicook": "👏👏👏", "myhappyhabits": "Thank you soo much for this!! My process seems similar and your sharing makes it a bit less lonely.", "livingunderjune": "I needed this today in a BIG way. Thank you!🖤", "kate.lines": "You are wonderful. I needed these words in this moment.", "i_am_jacks_random_thoughts": "Love you and this. Actually opened insta to finally post a little myself but thankfully you were at the top of my feed, reminding me I'm not alone 💗 Also, while I was going through some intense healing about a year ago, I kept having bunnies appear and follow me and I loved the meaning! Here's what the interwebs had to say about it~ The rabbit represents many things, including abundance, fertility, and overcoming fear. It’s telling you to think things through and look before you leap too. The rabbit reminds us to look within ourselves, to recognize our gifts, and to build upon their strengths. Do you have a strong intuition? Do you listen to it and follow through, or do you hear it and ignore it? As with all spirit animals, each rabbit sighting is also a message of change. A change in your life, a change in the way you experience life, and even a seasonal change are all possibilities~ Now I've started seeing chickens 🤷‍♀️🤗💗", "rebeccagayheartdane\nVerified": "Verified", "sillapere": "Ah... the time of reckoning... it’s always darkest before the dawn :) 💛", "greathonourgoods": "Y e s s s s s s ! 💕 🌵", "kaijulekramp": "Thank you", "a.r.drew.art": "Thank you and crown on from a far off space.", "erios69": "One day at a time girly..", "deadpod63": "Thanks @jengotch I needed to hear that...beautifully written piece 🙏🙏🙏", "lspiegs": "“Intense stretching!” I’ve never heard an author explain the process this way and it is so true. Every good book has at least one nervous breakdown! And it’s a great book. Thank you for sharing your story. 💖", "leahbbiggs": "🌹🙏🏼", "yarnalone": "Shaking ornaments off a tree = I have totally had my own version of that and it is such a yesssss description.", "sun.roller": "There’s no finish line to growth and expansion. YDAGJ. keep stretching!", "luz_eterna_retreats": "Your story sounds so much like my own and like many people who come to the retreats who are about to have a major break through. Hang on for the ride. Something amazing is headed your way. 🙏🏻", "dianepavitra": "❤️", "ajtarver": "Oh god this caption is everything @s_mckechnie must read", "queensparkle1": "I fucking love you! I wish you were my friend! 💗 @jengotch", "activeandanxious": "I am so grateful for all you share. 💕", "lostfounddesign": "I think I need some time alone in the desert too. 🧡", "sofia.henrika": "❤️", "coffeeandbeauty": "❤️", "sarahhallshpny": "Hang in there, will be here for that book when it comes out! (Also, I have a book I’d love to recommend, that may help w this process, if u like. DM me). 🙌", "samtews": "I love your page. Your dancing! and I can relate to every word explaining the violent dismantling that has been your life currently. Thank you for sharing a snippet as you process, it encourages me to do the same 🙌", "meremererae": "We are here for all of it! Love to you💗", "designlove.is": "We’re sisters in the struggle. And hell yeah to Elvis. ⚡️", "theislandj": "Thank you💖 perfect timing✨", "amberjoyolney": "Yes 💜", "belle237": "@brittany_mckillop do you follow this account? If not you need to!", "djkbru": "❤️", "irishdancer66": "I RELATE TO THIS SOOOO!!! MUCH!!! Tears were just pouring down my face as I was reading this right now!!!!😭💛 Thank you soooo!!!! much for sharing this!!!!🙏🏻", "lotusland13": "I can relate very much. Thanks for sharing. Sending u good vibes. ♥️🌵♥️", "therapisteffect": "You got this Jen!💛💛💛", "charliewensley": "This is me. Right now. Your sharing is so helpful it makes me feel a little less overwhelmed and alone. Keep strong lady x", "taylormvlholland": "Ur a baller", "smehrabani": "I hope the best for you. 💗 In case it’s helpful, my dear friend does psilocybin retreats. @luz_eterna_retreats In case you need to crack that tree right open.", "kdunnett": "Start with one word, then another and another....", "miss_mina4": "You are growing and changing and it will be painful at times. Sending you love.❤️❤️❤️", "krstnmchll": "You are such an inspiration, Jen. Thank you for sharing ♥️", "cindykirkdesigns": "Bless you!", "topanga_vintage_market": "Great telling 🙏", "queenofcups777": "I can't figure out if my tree is being shaken or burnt to the ground. So thank you for this post.", "shannonmarie76": "I don’t even know how I came across you, an insta suggestion apparently, but somehow I followed you not knowing who you are or anything about you. I’ve come to learn that I love your vibe, and so much about what you have to say resonates with me. I have come from a lengthy road of (still) struggling with my self worth, my purpose, my own self love. I spent several years drunk every single night on a barstool trying to avoid it all and figure it out at the same time. What have I figured out? Many things and nothing at all. I will eagerly read your book, whenever that may present itself, but in the meantime- thank your for your words here. I read them, and I appreciate them, and they are something to be noted.", "homerfridafrank": "All of this. All of us. Thank u.", "megangalletly": "Thank you Jen for being so open and honest. Your strength is powerful.", "quinnkellyco": "Thank you. Love you.", "lindsaydeeann": "The last year and a half have challenged me in ways I never thought I would experience. To follow your journey and know there is light at the end of the proverbial tunnel gives me hope. You have created something beautiful, in yourself and in your business. I ADMIRE you!!", "lesliecat23": "I love your style girl... keep in it so so real. Thank you 🙏", "constancezimmer\nVerified": "Verified", "lauren_johnson_studio": "Get it! Got you Gotch!", "sideorderly": "Thank you. I really needed that today. My walls are still so f’ing thick that I can’t even shake my tree, or cry, or feel pain. True pain. The pain I know I need to feel. The kind that you feel once you’ve faced all of your self destructive shit. I’ll get there... I’m in the precipice, staring down into the chasm, I just can’t quite leap yet.", "misslollygagger": "I love your vulnerability and the way you weave words on a page to share the tapestry of your life. It’s a beautiful gift.", "thelovedesignedlife": "you put it into words perfectly. And I really wanna hear about the bunny. I did a spirit animal meditation recently, and there was a bunny in the periphery of one of the segments. like I knew it wasn’t one of my animals, but curious about what that was?! 🤔", "fanshen": "Always appreciate your shares. Doing beautiful work ♥️✨", "anna_pearl_diaries": "You. Are. One. Of. My. Favorite. Humans. ❤️❤️❤️", "desimckinnon": "I love this mental picture of the dismantling of a christmas 🎄 I have felt like I was dumping a basket on the ground and deciding what I wanted to put back in and what I wanted to smash with my foot. #creationdestruction", "ccmacstudio": "You’re amazing! Amazing post! Thanks for sharing ❤️💕❤️🍃👋🏻", "serendipity0629": "Loved reading this. Every fucking word. Sometimes a good tree shaking puts things in perspective.", "amandasig7": "👏", "cromercrewmommy": "You’re a fucking warrior! 💕", "krhodey": "Yes. Yes. Yes. 🙌 I’m in a reckoning season myself and it feels so chaotic. Loved your Christmas tree analogy. Thank you for having the courage to share this with all of us.", "project_animo": "Thank you for this!I know it feels like a small step but, I think it's huge! I have been being nudged lately and I feel like one of my fat dog babies when you try to suggest [ by nudging ] that they move their fat bodies from any given location and they go dead weight & act like they don't notice you are trying to physically move them out of the way. Except I feel like I'm the lazy dog that's ignoring the nudges.... Anyway something about the way you said this resonated with me and it might just be what I needed to get me off my ass! 😘", "northernwatkins": "I’m in a forest of shaken trees right now. Thank you.❤️", "_esteila": "“Let it go, let it out, let it all unravel. Let it free and it can be a path on which to travel.” @leunigstudio", "mrnelaaaaa": "💖💖💖💖💖💖💖✨✨✨✨✨🙌🙌🙌🙌🙌", "charlottestoneloves": "The violently shaking tree is familiar...thank you for sharing ✨", "mattietiegreen": "Oh Jen. This is so so powerful. Thank you for sharing with us. ❤️", "simplyspaced": "And then the ground shook.", "elkaysmith": "IN IT RIGHT NOW.", "oliveandelliot": "💃🏻💃🏻💃🏻❤️❤️❤️🔥🔥🔥", "theleoloves": "🙌🏻💖✨", "adenizvillar": "Love this.", "kowardlylyon": "Thank you for this", "swbnoho": "We are all shaking in the goddamn wind.❤️", "betsyclegg": "Thanks. Just thanks.❤️", "rebelheartpoetry": "Thank you for sharing and using your platform to normalize the darker days and show we can still be processing and succeeding, they are not separate. Healing is not a precursor to beginning life, they happen in tandem. I needed that reminder from someone I admire. Thank you.", "stleonardsmoderngoods": "Such a GREAT analogy!!", "satellitestyle": "💛💛💛", "drnotdoctor": "These words. Thank you.", "moonchildtupelo": "Yes!! I can so understand all of this. Thank you for sharing and being you. 💗", "daysoffbelike": "Love this!", "jojomess": "Thank you for being to open Jen. It means so much to know I’m not alone. 💜", "heirloompaper": "My tree has been shaking hard for the last year, feeling you on praying to spirit guides too! Thank you for sharing what is a really difficult experience to put in words and hard for most to comprehend ❤️", "ursulaobserving": "Spirit animal 🐰 ❤️ always there for you", "tcd1973": "I just think you’re incredibly brave, so wonderfully open and just so inspiring. I’m thankful that you share your story, you give me hope. Sending love ❤️", "karen.in.the.citay": "Thank you. All of us strong mother fuckers eventually have to soften... it is life changing. Thank you for explaining how you’re finding your way! 💛", "duhidiot": "Thanks Jen.", "colbykathryn": "I have missed you on social media Jen Gotch", "rinlantis": "👏👏👏", "bravedesign": "🐇🐇🐇❤️ thank you", "lizziemdesign": "❤️🙌🏼 such a Brilliant metaphor Jen. Xxx.", "visualvitaliti": "Love you so much ♥️", "erika_sievert": "Yes. Yes. Yes!", "joanwlabelle": "Shake that darn tree! Not to over use the metaphor, but the newness of spring does not emerge until the old stuff falls away. Cheers to life’s seasons!!", "dcnly": "💜💜💜", "ceeva": "❤️❤️❤️", "jillsmayo": "❤️❤️❤️", "heathyrlawrence": "💖", "marisavitalephoto": "Love these words 💗", "kateyrn": "❤️❤️❤️", "_katierock": "@leighorne her journey is RESONATING", "flayaguiar": "@laisaccorsi jurava que era vc!😱", "bristolnicole": "Love this❤️", "jennywwilkes": "Have missed you and I have turned my life upside down since I last listened to your podcast. Scattered but not smothered and covered", "nayelivg": "You've always been an inspiration to me for putting yourself out there and sharing the difficult and important conversations around growing pains and you continue to do so, thank you 💖", "conninator": "❤️", "circle.home": "Sound like it was an excellent tree shake.", "bravenewsoles": "Thank you for this.", "jillianrenedecor": "❤️", "noelsmall": "THANK YOU @jengotch", "summer.wick": "Oh my goodness! I needed to hear this! Thank you for sharing your journey with us as it helps so many and feel less alone! Keep shaking that tree girl! 💕", "samanthabkstahl": "this is brilliant", "havilandcardinal": "Thank you for this. ❤️", "allysonnewell": "Thank you for being real. For showing the world that it’s okay to struggle and It’s okay to need help or guidance. Thank you for being so raw,so honest and brave enough to share it all with us. Keep going! ❤️❤️❤️", "iamsteph_xx": "you look beautiful and definitely found the perfect words to tell your story kinda deep, lovely and funny at the same time 🌺❤️😘", "katherineheil": "@amandasollenne 🙌🏽", "thedarlingrevolution": "🖤🖤🖤 Thank you for sharing the words today 😘", "jilliancarmine": "Shake that tree, Jen!🎄🥰 I’ve been shaking mine too and finally feel the work working. ❤️ Did the bunny inspire tree shaking dance moves?", "erindelaneyjoyce": "So grateful for your openness and honesty. Words are hard but your feelings come through - and that my dear, I get! 💞", "shlbywt": "💗💗💗", "blessthemessy": "Yes yes 💛", "findingvintage": "I’m at the start of an intense shake up myself and these words are a lifeline. There is comfort in knowing others are out there taking the risk as well- knowing playing it safe is no longer an option. 💕💫💕", "shantibeets": "❤️", "tdimond15": "🌹", "the_elturner": "💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙", "extrablushplease": "I used to carry @shopbando in my store and I love you and am praying for you!! “Let your gentleness be evident to all. The Lord is near. Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus.” ‭‭Philippians‬ ‭4:5-7‬ ‭NIV‬‬", "amelyabrikkarkeo": "Errbodys trees be shakin right now and it ain’t too comfortable. Maybe it’s a spiritual earth quake.", "embretarot": "Going through that right now as I setting up a new life for myself. On the outside to others it might look like a lot of unresponsiveness. On the inside so much dismantling. So necessary. I wish you Godspeed. Looks like you’re going through a “Tower” moment. I’ve always enjoyed your posts and how real you are. Thank you.", "laurasthings": "Life is hard.", "cocobegee": "Yes, with you. Had no words for this experience but you have found them. Thanks for sharing them whenever they come. You are not alone.", "lsuttonstudio": "Thank you for these words, sharing these moments I can not tell you how bad I needed to read these words. It is nice to know we are not alone in our struggles, our overcomings and our crying flat on the floor for release. 💛", "briarshopbelmont": "You’re amazing👊🏻", "thesheaalexander": "❤️❤️❤️", "simplyfreshsanmarino": "Going through a freakin🌪🌪🌪🎄🌪🌪🌪 but hang in there! Don’t lose your ✨ this too shall pass....", "tianabrealynn": "❤️", "porkchopalot": "Love you @jengotch ❤️", "tahani_helena": "You are loved! Our future will turn out better than we can imagine!", "tuckychic": "I needed to read this today, right now in this moment @jengotch. Thank you for projecting this little beam of light through the forest. 💖💖💖", "oliviaandme": "You go girl ! As we all do 🔥", "thingsgetweird": "Thank you for this 💖", "laurayoungkin": "@laurenmcgoodwin Jen’s words made me think of you - books are fucking hard 💕 you got this, proud of you", "just_jessie07": "thank you", "izlizlizliz": "My tree is being shaken, I love that imagery.", "grafikg": "Thank you for sharing and being so vulnerable it is really moving and inspiring especially to those who look up to you as a role model and can see that we all have ups and downs at every stage of our life path. 💛💛🙌🙌", "lunamountainff": "Needed this", "flowersandgarbage": "Nothing shakes a tree like the Desert. Been there. Keep going!", "btoshner": "You’re incredible Jen. Thanks for sharing. It resonates. ❤️", "heysarahcarter": "This is so beautiful and holy. Thank you for sharing as you go, it’s an honor to hold space w you. 💛💛💛", "heythere.mel": "Thank you @jengotch for sharing YOU and being raw. I needed to hear this!", "cbncmeredith": "@jengotch Thank you for being so real and for sharing yourself in such an honest and raw manner. I started following you after seeing you show up in @busyphilipps posts and stories - which also led me to @shopbando (with which I am obsessed!). Just wanted to say I appreciate you and I cannot wait to read your book.", "carzar36": "Big love 💕💕💕🔥🔥🔥🤘🏼🤘🏼🤘🏼", "michellelovesgear": "❤️🧡💚💙💜", "bay.lyles": "Yep, get it, got it, love your thinking, I’m with Busy..... keep those words coming out to all of us! I need them!❤️🤗😎🌺", "taylorrenfree": "Thank you 💛", "thenadiyogini": "Let go; let god😘", "meldubie": "Rome and LA was not built in a day 💗", "kellyharris": "There’s so much more to come 💛", "lena.kassicieh": "@scottyrudolph", "lookbackwithwonder": "This is exactly what’s been happening with me too. It’s not all that fun, right?? But somehow it’s also the best thing ever.... on some days. Right?", "sara__pavao": "Brave and beautiful. ✨✨✨", "sarahdecks": "💕💕💕", "invocateur": "I really want to know about the bunnies. ✨I love your process in all it’s shaky goodness", "chloehunsbarger": "really dig this", "suzimoonpie": "You are stronger than you know, I’m sending you a painting I made, in your DM. Your amazing!!", "evangeline73": "Look at what a lovely friends you have ❤️🌲", "_lusterling": "writing a book will do that to you. writing in GENERAL will do that. It's why I haven't been able to finish my own that I'm working on, so I totally get it. I will sit down to write and everything just wells up inside of me and then all of a sudden I'm a heaping mess. Keep going, you're right where you are supposed to be 💛", "dinarindos": "I feel you, sister. Get it. 🙌", "hannahrodgersx": "Lately been feeling like the tree after being cut down when they shake out all the dead needles. I’m hoping and deep down I know I’ll land on solid ground again.", "eli.m.reynoso": "Thank you for your honesty and openness in this process.", "lexieraejohnson": "💛✨💛✨💛✨", "jlcan36": "Sometimes your branches need to be shaken..be proud of yourself ❤️", "hillyhenny": "💕💕💕", "clara.clear.bright": "Thank you and love you ❤️❤️", "jessicadaviesmetalworks": "❤️❤️❤️", "bdoykos": "thank you for this and your honesty and being you. 💗", "sarahreillyengel": "Ugh. Love this. It will be some book. 😍", "silverbirdcreations": "I really, fucking love you! Thank you for always reminding me that I'm not alone!❤️", "rebekah_k_78": "You r a light💫", "culture_vultures_19": "♥️♥️♥️", "theodorable": "My tree is sure as fuck being shaken right now so thank you for this.", "yogajen9112": "“Fucking Elvis” 🤣 lol where is that motherfucker when I need him anyway?!?", "lightisbeautiful": "Love you", "vdgn": "Mad love for you, Jen! ❤️", "courageandcuriosity": "I hope you know how much your words, however and whenever they come, resonate ✨ here’s to violently shaking the mother f****n’ tree and being ok with where the ornaments land, it’s all about the lights anyway xx💚", "erinrcarlson": "Thank you, as always, for baring your soul - it is how most people feel but are too fearful to be vulnerable about. The spot we all need to be free to live in a little more often! ❤️", "rosevandercapellen": "My tree is currently experiencing some extreme shaking so thank you for your words!!", "weliveherenow_": "YOU ARE A LIGHT BEAM ✨", "optimisticcayla": "Thank you ✨", "meghan.awalt": "we love you jennnnnnnn 💕🐰", "alicia_garbett": "Welp, I’m inspired and so happy to hear your voice ✨💛✨", "appoljaks": "Did you ever see how almonds are harvested? It’s a violent tree shaking 😉 maybe you were ready for the harvest. Now you are sweeping up the almonds", "and.and.ampersand": "Thanks friend 🙏💧", "jillysuz": "Thank you for sharing. I feel myself on the verge of diving into this deep messy healing work and realizing that I won’t be able to control what comes is causing me to hesitate and delay the pain. But I can’t put it off any longer.", "thayerandco": "You got this! I feel you I’m so many ways! 🙌😘", "molly.franken": "Blendered Christmas tree status right here 🙋🏻‍♀️ I keep asking how many times must we ‘unbecome’ so we can then ‘become’ once again. I’m multiple iterations in and this newest and current one feels the most earthquakingly deep. It’s terrifying and so fucking raw. My shattered ornaments see and feel your shattered ornaments ❤️", "papyrusauruscraft": "Thank you for always being so open with what actually goes into running a business/writing a book/being a freaking human. 💗", "leslieslakelife": "I love your posts, so real, so true. Thank you for sharing. I could use some nudges over in my neck of the woods.", "rosiestesoros": "Love this ❤️", "imsurco": "I can’t wait to hear about the bunnies. Let the shattered ornament pieces reflect the light of enlightenment!!! Thank you for sharing with us our dear brave soul !! 🎄", "sundrenchedkim": "Going through so much of this in my own life currently and it absolutely is one of the most chaotic experiences even though from the outside it may not even appear so. It really helps to know that this is a normal part of the growth process, so thank you for sharing 💕", "shaysbumpandtravels": "Thankyou for sharing @jengotch 💙", "thekdv": "I am feeling this too. May we all find our way out of it, soon. 💖💖💖💖", "kelseyarrowood": "💕💕💕💕💕💕💕", "hatery_moods": "❤️", "amberellaxo": "Sending love @jengotch 💘", "cmartinishots": "I love this so hard.💕", "empowering_older_women": "Keep going 💪 strong lady xx", "thislittlemiggy": "Goosebumps. I want to hear MORE.", "shopb.ca": "❤️❤️❤️", "socketwench": "❤", "azizvtg": "❤️❤️❤️", "susancarterhall": "💛", "jimenchis": "@jengotch this is why I love following you and hope to meet you one day. I relate so personally to every word in this post - confronting years of being “the strong independent woman” and surrendering to gods plan is a BEAST. Thank you for sharing your journey and making people like me feel a little less alone in our journey 🙏🏼", "cammymumu": "❤️🙌", "clairedaydreamer": "Tree is shaking 🍃💛", "valentina.art.paris": "❤️💛❤️💛", "justaims1": "Thank you! Love your openness and how you share!", "ohdeertilley": "Miss you x", "leahlaniskincare": "Shake it like a Polaroid picture girl- I can so relate to this ♥️", "ashleelovelee": "❤️✨", "baileyheikens": "♥️♥️♥️", "cbjnj": "Love and healing ❤️ Thank you for showing us we can come out stronger after our tree has endured a rough storm .", "kristinabrunewriter": "This post and another I saw today on Instagram are just what I need right now as I navigate the second most difficult time in my life. Things are hard for me right now. But I’m trying to hang on. Thank you for this nudge ❤️ 🙏", "rebeccabirdeen": "💜", "the_k8est": "I know these feelings. Digging into the hard things and having to reexperience them is so difficult that it can stall out goals. Keep trying!", "brentwoodhello": "@tintinrva you should follow Jen!", "bscummings": "You may never read this message, but I really needed to read this today. Thank you, seriously thank you.", "jilly_ofthevalley": "Thank you. I needed this. I wish we were friends.", "lizzyleo123": "Love love love ❤️", "fan.tesstic": "I love you ❤️ feel it, thank it and let it go. The more you let go, the more you receive", "irmabosch": "Bunnies are great spirit animals! Mine came in the forms of snakes (freaky but turned out powerful), whales, owls and lady bugs! 😂 surprising what shows up when you dig deep, its a crazy and beautiful ride!", "mrselizabethpenn": "Thank you for sharing ❤️❤️", "playconcept": "The more your tree shakes.. the more you grow. (Or that’s bull shit.. but it’s nice to know that others feel the same way!)", "laura.gwinn": "I don’t ask for help either, and last night caught myself wishing for it. Sending u ♥️", "ohsarabeth": "JEN you’re amazing! Thank you for sharing. Hang tight and be patient with yourself and with process. You’ve got this.", "tracyghoward": "🏆🏆🏆", "missblairnoel": "This is such important work for all of us. ⚡We’re all in it together internet friend.", "yocruzie": "👍👍❤️", "jhellrung": "Hero.", "maiautumn": "I’m in that same crazy tornado space lately, sista! 🙌 Sharing this stuff helps a fucking ton 🙌 Thanks for being real ❤️❤️❤️❤️", "feathnar": "Thank you‼️", "wildeyed.shop": "Thank you 🌲", "kellyoxford\nVerified": "Verified", "_kristinefrank": "Thank you for being you. Real, raw and intensely honest. I feel blessed to have found you here. May God, the spirits and bunnies continue to guide and comfort you on your journey.", "hellofarrugia": "THANKS.", "sugaroyal": "Your journey helps a lot of us out here and nudges others to maybe address their issues! Keep going & keep growing - it’s what strong mother f*ckers do! 🌹", "glamourmouse": "Love you Jen 🖤", "ariane__k": "So here for this. Someone put my tree through a wood chipper. 😭💕💕💕", "kristiromero": "I needed to read this ♥️ Thank you for being vulnerable", "marilyndays": "It’s a lot of work to be woke! Happy to see you here in whichever way that may be 🧡", "kirstin_mallard": "🎉 Your the best", "cfbcathcart": "My tree currently has lost its leaves from all the shaking. I think the branches might crack and fall down pretty soon. So long as I haven’t ruined the whole thing I think I should be fine. However at the moment it is a fucking mess.", "elizabethrolf": "Imagining the tree like the one in Family Vacation and I relate to that on a spiritual level 🙌🏻", "lindaronan": "🤩 wow wow wow. You get it.", "theburnproprietor": "So helpful ❤️❤️", "amy_eden_jollymore": "Yes and the ornaments are flying EVERYWHERE. 🙏 Thank you.", "cfavae": "❤️❤️", "kaleidacuts": "Im glad you honored that nudge 💚", "chelseagailmorning": "Just❤️💫", "rabbyliciouz": "❤️🤘🏼⚡️", "acmseger": "💗💗💗", "meghansmolka": "❤️", "canadianmissus": "So eloquent as always, sending you peace x", "kerrycrawford": "Shake it like a Polaroid pitcha - Love you, lady. ❤️✨", "woolfwithme": "What @busyphilipps said! ♥️", "rebeccabillybob": "Love your honesty and way with words. 3weeks ago I had a bad anxiety episode that had built for months and am now starting from scratch, walk to shop, catch a bus etc. xxx", "stefanie11249": "feel your pain tough mofo.", "2sisters_angie\nVerified": "Verified", "shampoosalon": "💕", "sawatkins22": "You inspire me so much.", "plantlife.clothing": "❤❤❤", "itsmeapes": "This is a sign from the universe that I needed. Thank you, @jengotch ♥️", "ashleyll0132": "Words complied brilliantly ✌️", "ohmyitsmegshek": "@jladish ✨", "jennifer.fogerty": "The wild unfolding can be so disassociating, but it changes us for the more whole. I love hearing you say this story. I’ve just done my own version as well. I like the “intense stretching” phrase. Well put. 🙏❤️", "wildwhim": "Whether it’s Elvis or angels or cosmic fairies whirling around in galactic delight, something out there is listening and ready to help us earthbound souls ❤️🙌🏽", "a.beautiful.symbiosis": "❤️✨🐇🌵", "conniebeatrice": "Thank you for that ❣️", "martadooodle": "Shake it like a Polaroid picture! 🔥", "erinmgraham": "Thank you so much for sharing. You’re helping so many more people than you could ever know. ❤️", "hellochristinajoan": "My tree is being shaken, and I have shatter proof balls, but they're onto me now and coming at me with fire 🤣🙃", "desertjade": "Love this and you my desert sister. ❤️🔥", "jladish": "Needed this today! ❤️❤️❤️", "njulianna": "Thank you for your vulnerability and beautiful real ness", "beckymsimps": "This was needed 💛", "lucysinspired": "You are a blessing.", "crushing_adulthood": "YES TIMES A MILLION ❤️", "lisamcrae7": "♥️♥️♥️✨✨✨Ughh. Thank you.", "realtormichela": "You’re awakening journey is beautiful✨✨", "francilla": "❤️", "45threemodernvintage": "You are the best!", "queen.of.crumbs": "Literally crying it up in the library as I struggle to write. Sometimes it means everything not to feel alone. Thank you 💕💕💕", "andreajhamblen": "❤️❤️❤️", "glos_lamoulista": "❤️", "studio.aray": "🙌🏼 sometimes i feel like the word “inspiring” is a lil cliché, but dammit you are really F’ing inspiring!!! ✨", "corriegwinn": "✨", "dvandylion": "I love you and I’m here for all the dismantling.", "geochick1": "Love this post. It’s such an awesome reminder that as I navigate my own tree shaking trusting in the flow is a big piece. ❤️🙌", "jmebuffington": "I do identify. I’m sadly almost done w @busyphilipps book and will be waiting patiently for yours. You both will be friends on my bookshelves as you are in real life. Your words matter to me. Thank you.", "dmb.317": "always here for you jen. so thankful for your open honsety. i can’t wait to read your book. love you💓😘💓😘💓😘💓😘", "loriafreeman": "Keep crying out to God. He loves you deeply. ‘God, my God, I yelled for help and you put me together.’ Ps 3:2 (Message).", "mirbrown75": "Isn’t growth and expansion and waking up and connecting to universal intelligence and opening to receiving and this whole crazy ass thing we call life just the fucking wildest?! 🙌🏼💫🙌🏼", "obliquenewyork": "So grateful for your sharing💙 My tree is being shaken right now too...but at the same time, it feels like while the ornaments are flying through the air, they are also somehow already wrapped in bubble wrap and will land safely without any breaks. And they will probably land in a crazy pattern that spells my name or something to remind me that worrying about them all this time is silly and everything will be so over the top grand when they land😊", "emilieclaire": "You are a hero. Doing the damn self work is so scary, and talking about it even scarier. Thank you always for what you share.", "meganmpearson": "🖤🖤🖤", "mtsevillana": "I’m glad to hear I’m not the only one sobbing while kneeling at the edge of my bed asking for help. Thank you for sharing. 💜", "ashleychazz": "❤️❤️❤️", "onwrd_upwrd__": "My tree is being shook so hard right now. I screamed out loud in the car by myself “I don’t want to feel these feelings anymore!” It kinda helped 🤣", "theryssa": "I’m in tears reading this bc I’m in a very similar season. I like to say that nothing I have gone through, painful changes I have been through will be wasted. I refuse to waste my loss, grief, joy, growth by keeping it to myself. Thank you for sharing. It gives others strength to do the same. ❤️❤️", "instantmogram": "❤️❤️❤️", "birdlands": "🐰 🔮", "reelsofcotton": "Wise words...take care x", "buttittachelly": "Perfect. I feel this was my “nudge” to keep going. You must look for ALL the subtle reminders from the universe, that you, we, will be okay! 💕", "themindfuladvocate": "@tamarelli", "itsjpizzzle": "Thank you for being unapologetically you and sharing your story. Keep listening to those nudges. ✨ You. Are. Magic.", "jvelascocafagna": "Thank you, as always, for letting all of us who struggle that we are not alone ❤️", "libralovesu_": "I had the nudge today too. To come out with this lie of vulnerability as wrong or a weakness. Of tears seen as something forbidden or in need of alteration. To sit with ourselves in pain is the purpose and yet the thing we avoid for so long. The admittance that we too are humans on this planet experiencing human emotions. When I talk about it I start to see its beauty, it’s magic, it’s transformational healing while we sit with ourselves in outrage, fear, frustration, sadness, resentment, jealousy- we move into the love the peace the joy our ears open up our eyes open up we hear the birds we see the sun.", "alittlepistol": "Okay so last year the fucking cat knocked our tree down and all of our favourite, precious and very breakable, ornaments smashed into oblivion. But we still had a good time and now theres room on the tree for some new, stronger ones. In other words, great metaphor. Much love ❤️ #yougotthis", "by_caylie_j": "I can completely relate. Also my help has been coming via foxes...even though bunnies are my favorite and used to be my sign in the spring. 🧡", "katieaselton\nVerified": "Verified", "oftreesandhues": "You’re teaching me so much. ✨", "jennyjohrabe": "🧡", "miamedic": "🙏🏻❤️😘", "lifeisaok": "I am really grateful you share these moments with us. I am grateful to see you and to be seen in return.", "lagunavintage1978": "This made my fucking day. Fuck yeah.", "rorycarroll": "♥️", "victoriouslyhopeful": "💜", "christinalynn82": "You are such an amazing woman. I am so glad I found you thru @busyphilipps because many times your words have spoken in big ways to me", "kkc_falcon": "💜💜🥂🎄", "__seaofleaves": "we love ya jen!! my ornaments have been flying off the tree too ❤️", "kelleyjharris": "❤️", "tarajhaaz": "❤️❤️❤️", "headandheartand": "My tree been shakin’ for a minute now, girl! I’m learning mosaic is really fucking gorgeous! Lol.", "thekellyquinn": "Thank you for sharing words, feelings, & trees being shaken that aren’t always easy to share. 💛👊🏻", "gblumchen": "So needed this today. Thanks for being you.", "tracyrubzrahn": "Thank you Jen.", "romycollective": "I love you!", "anndanger": "❤️❤️❤️", "writenowrachel": "By sharing you are being so self-aware and that is a huge step forward In the right direction. 👊🏼💜", "toomaris": "💖💐", "badcontent.co": "🌙♥️ I know I don’t personally know you, but wanted to say I’m proud of you", "cloverlb": "You’re a really beautiful human ✨", "lizzie_russell": "My help came in the way of bunnies, too 💕🐰", "jettamchin": "💕💕💕", "debnobles": "❤️", "daisyleyland": "Thank you for sharing. You ARE a strong motherfucker!!! you give 27 year old me SO much hope. I could never really express it. Keep doing you Jen. Keep doing whatever you need to. We love you and we're here to lap up any words you choose to share. Or not. The real ones ain't going annnnnywhere. I know the feelings your feeling atm. I'm feeling similar feelings. Every day you make it through is SUCH an achievement. Don't ever forget it 💕☺ *big fat insta hug* xox", "sacredfolk": "You are awesome 🌸💪🏻✨", "taryngray": "This is the best analogy! thank you for your openness, you’re a fucking gem 💕", "jana_fabulous": "Shake shake the shit out of that tree! 🌵🌵🌵☀️☀️☀️", "xtinamooney_": "Do it for me, Jen! Do it for you! Do it for all of us! ☁️☁️☁️", "newswithsuze": "Same. Thanks for putting into words my last year. Sending you love, strength and tequila. 😉", "busyphilipps\nVerified": "Verified", "mmm.hem": "Thank you for sharing 💗", "cecilyroman": "Needed to read this today, thank you", "lgertzy": "Haven’t met you but I am with you, sister.", "delaneyphotog": "The Christmas tree. Such a relatable metaphor. Lots of love for you Jen. Thank you for sharing!", "olivtrees": "Love you. Let’s make like trees & dance 💚🌿🍃🌾🌲🌳✨💫", "aprettycoolgirl": "❤️❤️❤️", "dawnsturmon": "♥️🎄 love this, thank you", "reeseyroth": "Thank you for sharing! 🙌", "laurakloturco": "You are the best. Thank you for sharing! 💛✨", "hiltonheadtennisfan": "I needed your words. Please keep them coming 💖", "lifeiskitsch": "❤️💫💃", "lindsayellenrein": "Shake it, baby. I’m here with you ❤️", "rhondajenkins": "Yessss 🎄🎄🎄🎄", "emmatownison": "Thank you for this selection of words and the way in which you wrote them.", "ajoyinthecity": "❤️❤️❤️❤️", "thegladystay": "Thank you Thank you Thank you for sharingg. So much love for you 😘❤️❤️!!!", "heysarahbuchanan": "YES. LETS. GO. 🔥🔥🔥", "drquincee": "Shake that tree. You’ve got so much inside of you ✨", "sarahglass_ceramics": "👏👏👏👏", "mericherryla": "Thank you for sharing your journey. We can all relate. Happy bunnies.", "wendyliz79": "Thank you! ♥️✨", "uotihjubug4200": "Totally know that.❤️", "ms_des": "I’m so happy you shared this! I’ve been feeling this the past month or so on such a deep level. Thank you thank you for sharing 💕", "debbietarr": "Thank you. I really needed this today. Sending you love & gratitude ♥️♥️♥️", "beckyjoanspringer": "💯! My tree is definitely shaking, more like uplifting from its roots, as the nudges are getting less subtle.", "marierao": "Tree shaking here", "jewellofsd": "Sending you positive vibes Jen! ❤️❤️❤️❤️❤️❤️❤️", "ladymellchelle": "💛💛💛", "matanajacobs": "Step by step. Thank you for sharing with us. It's not easy", "alexisrusselljewelry": "Yes to those subtle nudges and being awake enough to listen and let them heal. Right there with you.⚡️😽", "designlovefest\nVerified": "Verified", "letteredcottage": "*hug* ❤️", "thetendertiger": "Thank you for sharing this 🙏 healing is such a fucking journey and I’m so appreciative of people like you that share these glimpses of it, showing us it’s not linear, sometimes things don’t go as planned. Showing us how you get through it. Thank you. 💖", "sassapants": "💕", "amysee76": "💕thank you for being vulnerable", "lsj89": "Sooooooo looking forward to this book.", "blueeyedbirds": "Right here with you. Been on my knees begging for help that comes like you said, in small nudges and tidal waves. Sending you love. Thank you for the bravery of your voice 💗", "eve___white": "Thank you @jengotch I don’t know if strangers are supposed to @ you but this kind of candor is empowering.", "heytiffanyroe": "Elvis dude 🖤", "labontefullofgrace": "❤️", "whats.mom.got.to.do.with.it": "💜💜💜", "letters_and_such": "You can do it! Thanks for being you! Patiently yet anxiously waiting for your book! 💛💛💛", "stephielashes": "🐰🐰🐰", "traveltouria": "@jengotch thank you for being so raw and honest. Your experiences and feelings touch more people than you’ll ever realize ☺️💕", "emmacrw": "From one person who’s just started to shake her tree, thank you. You might not feel it, but I’m right there beside you ♥️", "mylesigwe": "You’re so fucking cool", "simoneludlow": "💖💖💖💖💖💖💖", "erikanmack": "Love this ❤️", "guerreiroclaudia": "Thank you desert Jen. I love your analogy and yes, my tree is shaking faster and more than ever before for me. I sobbed uncontrollably in the shower yesterday. I felt better afterwards. All this peeling of layers is hard work and I'm not always up for it....", "josie.george": "all my ornaments are breaking but I keep trying to crazy glue them or something. this makes me feel like I should just let them fall. THANKS ✨", "paulaebarnett": "Yeah that shaking tree, that begging god for help. Me knows it all to well this past year. ❤️", "moonpiemary": "💓", "busy_lizzie": "💪🏻❤️🙏🏻", "irenegianos": "I needed this. Right. Now.", "mackichu": "You are an inspiration!!!!! Sending good vibes your way ❤️❤️❤️", "kescardoso": "@jengotch here is my favorite quote, and I share it with you: “If you want to see true strength, watch someone break. Then watch as the pieces settle. As hands begin moving. As a new person is made.” — L. E. Bowman Cause you are not strong and alone, we are strong and together in this mother f***** adventure called life. Keep on and thank you for your sharing ☀️🌊🌬✨", "delaynakh": "♥️♥️♥️", "oliviaflorer": "I needed this. Thank you ❤️", "heidilike": "💛", "thatginthang": "Good on ya! Thank you for sharing all of you! ❣️✨", "darcelmolina_128": "👍👍👍,I so get this,I wish for a nudge every now & then❤️", "karenc_1984": "This may just be your greatest life's work yet. For all of us. This is it. And so many people do not do it. Then they die. The older I get, the more I realize that this IS the work of life. From that, everything else flows.", "beesandbears": "all of these words are so helpful, to me...a person who’s tree has been shaking on and off for a year now. thank you for sharing 💗", "katejohn7": "❤️❤️❤️", "katelyn514": "Thank you", "getcolette": "\"maybe your tree is being shaken right now, too\" 💕💕💕", "heatherandthepugs": "❤️❤️❤️❤️❤️❤️❤️❤️🐰", "mbaudone": "thank you for this 🤧", "noxshop": "❤️ Never underestimate the magic of desert bunnies", "__motherofdoggos__": "Thank you for always being you", "smokinjdog": "Thank you", "emilystraw": "🙌🏼👏🏼💖", "big_pedge": "My tree is surely being shaken right now. Appreciate your nudge!", "jonicamelanie": "😘♥️", "gabfilte_fish": "💖", "bubbyandbean": "You are amazing. Thank you.", "magzmorris": "❤️", "sbaidwan": "You are an absolute gem. Thank you for sharing. 💜", "missssayy": "thank you for sharing this ♥️", "atingofbooty": "💜👏", "theholistichoneyyy": "I feel this ❤️", "saraevelordi": "🧡💛🧡💛", "thefoxfamilyden": "Yess thank you for sharing, beautiful woman", "macolb": "💪🏼💗", "marleeofficial": "You’re the best. Thank you for sharing ❤️", "thejoyfuljewelrybox": "I feel this. Especially that Elvis part. ☺️ Thanks for sharing your heart. 🙏🏼💛🙏🏼", "frugalhangerthrift": "💙", "plantsthatneverbloom": "Thank you"}