{"_tillyb": "🎉👏🏻", "heatherandersonhair": "@berettasf so yummy!!", "melisamyers": "Wow, full circle! Thank you for sharing this incredibly inspiring story. It's such an important topic and we all appreciate your love kindness and support. ♡", "lilvzexy": "@jengotch I like your story at BC2M Great knowing what you been through 🙏🏻❤️", "jenna_aceandjig": "👉❤️", "mollylomenzo": "@causwells!", "cindybmetcalf": "Love you ❤️❤️❤️", "imwiththeband": "Go Jen!!!!", "cschirmer": "Loved meeting you, thanks for coming to Pinterest 📌", "naturallyconsiderate": "Love this 😍", "saramoon": "That house❤️❤️❤️", "thelovedesignedlife": "I just laughed and cried at this caption 🤣😭", "lookwhaticando12": "You are ahhhhhmazing!!!!!❤️❤️❤️", "lilyspruce": "@statebirdprovisions for every day of your stay, mang. Or @greensrestaurant @alsplacesf also one of our absolute faves (follow their Spotify playlists!)", "kauffmannanne": "State bird provisions", "antoniotarezwynn13": "🌉🌃", "nikki_kleinheksel": "@jengotch Your 👓. Where can I find them??", "marianna.r.p": "@camilanf", "shana_champion": "@farmgirlflowers?", "caitlinkrisko": "I resonate with this so much. In college my badass music theory teacher told me to forget theater, and that the world needed more female rockstars. That was the most profound seed that’s ever been planted in my life. 15 years later, I still write to her thanking her for seeing me before I saw myself.", "lynnie.marrie": "♥️Brave jen 🌟🌟🌟🌟🌟", "jacquet": "For next time @sprucerestaurantsf", "alicat7667": "Someone once told me “ your outsides don’t match your insides “ ...meaning what I was feeling was NOT what I was showing ...that comment has stuck with me for 15 years ...", "ihavetoeatthat": "Sit by the kitchen at Wayfare. Before i lived in the Bay Area, i did that on a biz trip and it’s one of my fondest memories of SF period. Their hospitality is awesome. Get 1/2 order of deviled eggs, fried chicken, donuts and a cocktail - so you can try some of the best of everything they make 🙌🏼🙌🏼🙌🏼@wayfaretavern", "coralscountry": "Wowowow. Amazing. Follow the feeling, not the thing. THANK YOU, UNIVERSE!", "star.babyyy": "@lorawheeler_ 💕", "erika_sievert": "YES. YES. YES!!!!! 🦄💞🦋 Synchronicities are the best 💛 and they get better when you realize you can pay attention to the signs and follow them 🙏🏼💘🤗 @jengotch it must feel amazing (healing!) to not only speak your truth, but to help end the stigma every time you share a piece of your story! 🤸🏼‍♀️🎉🧡 This is wonderful & inspiring!! xo", "bicoastalista": "Leo’s oyster bar", "campbellcate": "🧡🧡🧡", "m.c.u.l.l.e.n": "Tadich Grill", "jkburgin1": "That was not a recommendation. (Just saying what a beauty you were!)", "arielrosen916": "🙌🙌", "doyouhavesnacks": "YES A TRUE QUEEN 👑 I AM SO FUCKING PROUD OF YOU LADY ✨", "dalevirginia": "PLEASE DONT SAY CHEESECAKE FACTORY 💀💀💀💀 @sarahdf313", "dbentzy": "@calasf! grab a seat at the bar + tostadas and the best tonica classica in all the land ⚡️✨ thank you for continuing to share your story. these reminders are so needed 💛", "paigenolanwrite": "Love this one 🙏🏻", "eastlou": "I love you and feel so honored I had the opportunity to meet you and share your awesome line. Thank you for everything", "simoneludlow": "💖💖💖💖💖💖", "jessinacollins": "Mikkeller Bar in the downtown area is not bad and has a large and well designed bar for solo seating a plenty. Sessions at The Presidio has a beautiful bar inside (with good food), and the Presidio itself is always a relaxing respite from the rest of the city.", "bold_type_creative": "@jengotch great story from a great human.", "ali1124": "You have so much wisdom to share. Wish I could be in that audience! Bravo!", "nlongo22": "Thank you for your posts...they are honest, helpful and resonate with me...and you seem to write what I need to hear when I need to hear it 💗 enjoy your weekend!", "billorbah2016": "Hello dear i really like you", "janabouttown": "Good for you, Jen! 🙌💕", "katydikadesign": "💓", "nataliezises": "@nopasf is the best solo bar meal in SF! You will be SO happy you went :)", "erinlayne666": "You are an inspiration! ❤️", "johnnapgoldman": "Agk! I love this! Congrats!", "monitron": "Can I come sit with you", "rorosun70": "Go to Leo’s oyster bar 😋🍹", "lisbysc": "Spruce!! You can sit at the bar and everything is delightful and they’ll take good care of you- like you deserve", "eapiner": "💛💛💛💛💛", "julia.church": "A few weeks ago I experienced one of those passing comments from a friend that I’m starting to realize is maybe a giant pointer finger from the universe so I wrote it on a post-it and stuck it on my bathroom mirror. And now I’m making a conscious effort to notice those giant pointer fingers from the universe when they’re still just passing comments. And I’m holding onto them because I’m realizing I need to be open to whatever direction the universe is pointing me in.", "camilladallerup\nVerified": "Verified", "heather_bot": "West of Pecos in the mission! Or Cha Cha Cha for some tapas/sangrias", "artalatrinca": "Sorry you had to eat alone. If you need a hang out friend in SF I’m around 🤩🌻🙋🏼‍♀️", "mandy": "You’re my favorite.", "youcollme": "Alembic on Haight - Amazing cocktails, delicious food, gorgeous little bar. https://yelp.to/qTKq/B4u6QYYqh1", "cleomurnane": "What a cute smile. You look so happy. 👍", "arobotmommy": "I love this and you for sharing this so honestly. And I especially love that you're about to speak at a student summit about mental health. This is so incredibly important and needed. I live in Utah and two years ago one high school lost 8 kids to suicide because people aren't speaking their truth. Thank you for speaking and sharing yours. It matters and I truly appreciate you!", "weathereyes": "@cocoalouise", "stephfollette": "Gracias Madre!!! Check it out lady💠", "sortner": "Appreciate you and this.", "joannarevers": "Man, isn’t that the truth (the pointers).", "social_allie": "I love you. I honestly love you. 🙏", "love_at_first_light": "Love this! Following your soul purpose with some tears and a smile ... and Che Fico. Sit at the bar and get the pineapple 🍍pizza ... Anderson Cooper tweeted about this place and now it’s impossible to get a table, but I’ve always managed to get a solo seat at the bar and met rad neighbors or not talk to anyone at all lol", "tere_davis": "why chu so cute? 💛", "emsyjones": "Burma Super Star!", "julieharmsenfitts": "👏🏼", "sasha_tozzi": "Love.", "soniesonz": "Cotogna! Giant ravioli for life 🍝", "twyla_dawn": "❤️👏🏼", "haggieb1": "“The Cheesecake Factory” doesn’t sit well under your name... I had to read this to make sure it wasn’t a bad dream that I was having. You rock~🙌🏻💯", "clairemccallumcreative": "You’re my hero.", "alexa_curtis\nVerified": "Verified", "kgreg0ry": "❤️❤️", "halloatesftlaura": "@nopalitosf or @nopasf fosho", "seebettyrun": "Thank you sweet lady.🙌🙌 I have had a butt tonne of signs and comments this week. Next comes action!", "nicoleharing": "thanks and 👊", "emilyperry.co": "💗 I’ve been flowing you @jengotch from back in the Flickr days pre- @shopbando ... and when I saw this post I got so giddy because my daughter Catie Perry (yep, I know) will be there to see you speak and I am so excited for her! I told her to come say ... BC2M is wonderful and creating such a powerful legacy in teens 🙏🙏🙏", "darlenerosado2": "My therapist tells me this. I can’t see it now. But when I’m through the horror, I would be honored to help others. I hope it’s my life’s mission aside from healing", "sarahbeansnyder": "🙋🏼‍♀️ I don’t know when your thing is tomorrow but I’ll be at Alamo Square Park if you wanna come hang out with some kewl ladies. By the way, way to go on your thing! ⚡️", "shelley_conchita": "You are awesome! Thank you!", "skyle": "Nopa bar", "mcmarino": "Garibaldis!", "jenclarke": "Petit Marlowe.", "sandiegopaige": "👏🏻🧡👏🏻🧡", "noellegrant": "I LOVE YOU ✨ Oh, go to @theriddlersf if you like champagne 🍾", "kauffmanfarah": "Congratulations! This is fantastic, and BC2M is a great organization. You’ll do great because you’ll be your authentic self.", "christinalynn82": "You are amazing and I can not wait to see what you do in the world of advocacy!!", "verychristine": "❤️👌🏻✨", "schmancytoys": "Congratulations you’re gonna do GREAT", "extraspicygirl": "Bouli bar in the ferry building (where I work!!) ✨💫", "goodwestco": "Zuni cafe.", "_ann_e": "Zuni Cafe ✨ I love this post!", "artcampla": "You always bring the giant 👉🏻 I need. You are a gift @jengotch ♥️", "justagirl": "💗💗💗☀️", "ninkainthecity": "Liho liho yacht club! So good!", "writenowrachel": "🙌🏼👊🏼💚", "rusticmint": "Jen, honestly you don’t give yourself enough credit for all the good things you bring to this world! Well someday I am going to meet you and give you the biggest hug! You rock!!", "lastlook": "@hashtagleeanne ☝️All of this but the last sentence is spot on. 🤣", "danielle_island_": "Thank you for this! I needed it! Go to Leo’s Oyster Bar!!!!!’@leosoysterbat", "sweetly_at_home": "Yes Baby, yes!!!💕", "nad.nyc71": "Congrats Jen - I love this post! Sorry your flowers peed on you. 😜. I really like the restaurant at the proper hotel - the one I the lobby- they have great cocktails.", "hashtagleeanne": "💖", "emilyaralph": "Thank you for being so inspiring, @jengotch ! You make such a great advocate for mental illness understanding!❤️❤️❤️", "meghanjessica": "@fiorellaitalian !!!", "hellokeryn": "I once (okay, TWICE, but at different hotels) dropped enough chocolate in the bedsheets that it looked as though I hadn’t quite made it to the bathroom before evacuating my bowels 😳. Was it embarrassing? Yes. Has it stopped me from eating chocolate in bed? No. Your flowers are beautiful and they are worth feigning a urine-soaked bed. Have a blast tomorrow! 💪🏼", "melinda_maxey": "Wow. Your story gives me so much hope. Love you, sister.", "hilryann": "Some restaurant recommendations 💖@20spotsf @nopasf @centralkitchen", "nick_barba": "Continually inspired by you. Looking forward to whatever project i have the ultimate blessing of enjoying next.", "chellecrenshaw": "This is great!!!💕💕💕", "houseofhipstersblog": "I always love your posts, but this one is my favorite 💛", "ric96": "@emhein13", "annelise2055": "Congratulations! 🙌❤️", "hannahviolets": "Chez maman! So lovely and delicious", "listenerliving": "♥️♥️♥️♾📍the best reminder", "feareatssoul": "house of prime rib .. a san francisco treat", "susan_armitage": "🍂🍁💋", "alysontwong": "So happy for you. I feel this deeply. 🕊🌑🔥🌀", "briarshopbelmont": "That’s awesome! Hope you have a lovely dinner.", "karenkdiamond": "Zuni is good for the soul.", "gather.workshop": "💛 @birbawinebar in Hayes Valley", "dananealdesigns": "Yes you inspire me for sure. Thank you", "katmit4831": "Jen I am the board chair of BC2M. We are so thankful for your willingness to be a mental health ambassador. The young people at the Bring Change to Mind summit are so blessed to have you address them. You are so honest and such an inspiration for those who struggle. We are so thankful for your partnership. Thank you for taking time to share your journey with this amazing group of students ❤️", "claireinasquare": "Excellent! Blow away the stigma! I have family with cases of Bi Polar and a mix of issues. Love to see this talked about openly.", "danalarose": "I wish I could be there to hear you speak. I’m a big fan of you and your authentic self. Think you are a badass. ❌⭕️", "theodorable": "This is so inspiring, and I hope to follow in these shoes ❤️ (though my feet are probably bigger)", "dr.christina_": "Thank YOU for continuing to use your platform to raise awareness around mental health!!!!", "kerrycrawford": "Hero. Love you a lot. ❤️✨", "kellygolightly": "💛💛💛💛💛💛", "thebestdaniellelevy": "Thankful to that smart and insightful therapist because we are all better for having you as an advocate reminding us to be our own advocates. Thank you for owning your truth and letting us know that it’s ok to own our own. 💫💛", "applebagios": "Congrats!! @aprilbloomfield’s Tosca Cafe in SF is THE most special restaurant - you will love it", "msamandagreene": "Inspiring.", "missblairnoel": "Delarosa ❤", "colleenclark": "The bar at Flour+Water and Tartine Manufactory are both great for thar", "mugsbythefire": "👏🏻👏🏻👏🏻👏🏻I learned so much from your talks on here about your experience. Thank You for helping me be better for others.", "sarahgraceschafer": "Tadich Grill. Lolinda.", "sqwurrly": "Beretta!!", "alisonraemusic": "What is your diagnosis?", "scrambledhages": "Fino Ristorante & Bar", "bungercounselingllc": "I absolutely love this!!", "jvinamont": "Good luck tomorrow! I love your glasses btw 🤓", "macolb": "Leo’s Oyster Bar", "dsy": "Lolinda or Tartine Manufactory", "gingerblondephoto": "You are such a warrior light & my hero. 💖", "amyfish32": "Wayfair tavern", "marenlee": "@blueplatesf hands down!!!!!!!", "onefinea": "You’re incredible!!🙌🏻❤️", "sandra_p_cordero": "Love this story, thank you for sharing all aspects of your beautiful journey! Verjus or Wayfare Tavern are excellent and I’ve enjoyed wonderful solo dinners at both @jengotch", "rachelgrams8": "♥️♥️♥️", "lizzie.mae_": "Nopa 🤤🙌🏻", "sixfigscoaching": "Zazie! 💕", "mwilke8": "Slanted door! Yum.", "vintagebyrd": "Presidio Social Club!", "ohkdarling": "!!! People say this to me I feel seen! I don’t really know how it will happen, but I’m stumbling along trying so hopefully I’ll get there too. Needed the reminder today that it can work out. You’re brill 😭💕✨", "demetrius74": "I recommend The View Lounge and the Bourbon marinated octopus🐙 & or the Ahi poke. They also make a mean Manhattan🍸 Side note, break a leg at the BC2M summit tomorrow🍀 Hope you have a 7.8 kinda day🌈🌤 Aloha🌺", "pamandgela": "❤️❤️❤️❤️❤️❤️", "smilebella1": "Yay, I’m like 2222!! 💫", "gracepresley": "“They are basically giant pointer fingers from the universe saying 👉🏻 this way” @thechubbycrossfitter our conversation", "intentionalkate": "I just laughed out loud (real hard) at the “Palm Pilot”/“TWSS” comment", "margaux_axelrod": "@Starbelly ❤️", "kathleenbush": "Congrats lady!! Zuni Café is always a great choice in SF and the wine list is killer!", "ellen_arthur": "I'm so proud of you! Your openness about mental health inspired me to open up yesterday on my stories about my struggles and the influx of messages thanking me were overwhelming. Keep doing the important work gorgeous lady ❤️❤️❤️", "maeve7309": "@jengotch a | Mano, Souvla, Burma Superstar", "greathonourgoods": "Love! Oh and I vote for NOPA ! @nopasf 💕🙌🏼", "lang.samkate": "@jengotch rich table, nopa or flour + water 😋", "debbiesteingesser": "So, Zuni, Rich Table, Nopa, and Tartine are SF fine dining stapes. If you want to have a true SF experience, I feel like you would love @emmysspaghettishack and @dosasf . Also, the new @burmaclub downtown and eat ALL the tea leaf salad.", "bay2": "Zuni!🎉💛", "outsidedance": "🙌", "mon.bz": "@redfordsf or @urbantavernsf 🌻", "axelhoney": "@thedouglasroom 👌", "abbymerea": "Starbelly ♥️", "joiebutter": "Jen you amaze me and I love what you’re doing. Thanks for letting me follow along!", "fallynbuckley": "👏 head to Lolo for some yummy Mexican and delicious cocktails", "jess_stempel": "I do this too! Through @namicommunicate In our own voices!", "ohfritzy": "Is the summit for women and men?", "hillary_kate": "So thankful for you.👏🏻👏🏻 Cheering you on tomorrowZ", "daminiroy": "You just brightened up my screen and day with this!!! More power and sunflowers and marigolds for you, the amazing Jen 😍❤️🙏✨🌻 P.S: marigold flowers were used in ancient Indian tradition to introduce vibrancy to life. And they’re regarded as a gentle disinfectant/ you can chew them off your bouquet if you ever feel a sniffle coming 🤗", "michellell": "Cotogna or Tartine Manufactory - I’ve dined solo at both! Enjoy!!", "nancysalz": "Zuni Cafe", "emily_katz\nVerified": "Verified", "hilaryrobertson": "@richtable Beyond delicious and I always sit at bar", "amysee76": "Love this! You are an amazing mental health ambassador!💕", "imdanielleegray": "You inspire me @jengotch 💛", "habigje": "🖤 @wayfaretavern", "dmb.317": "proud of you jen. and your journey.😊", "kellyoxford\nVerified": "Verified", "nicole_rucker\nVerified": "Verified", "kristinakellyho": "💕", "iamhannahklemm": "Go to @richtable ❤️", "mo_dill": "💛💛💛💛💛 thank you for always sharing your story", "amyazzz": "Go to @blueplatesf! You won’t regret it.", "robynvalarik": "Hello from an SF good stylist. I think we worked together YEARS ago. Bar Tartine, Spruce - For burgers, Delphina, Zuni (roast chicken must have), and Slanted Door. All are classics and great and in different parts of town. Enjoy!", "rachel_whisenhunt": "Tadich Grill!", "sfgirlbybay\nVerified": "Verified", "viso823": "My friend opened @southparkcafesf recently. It’s very chill space, simple and delicious food, tasty cocktails, and it’s nowhere near the Cheesecake Factory. Get the mussels and chorizo. 🤤", "iedee19": "❤️🔥", "lizzie_russell": "You are everything 💕", "guacmylife": "Olive Garden", "balancebymolly": "RICH TABLE. Love sitting at that bar to have a solo dinner. Treat yo self.", "washwithwater": "💛 Love every bit of the light you put into this universe and so happy you are even ✨brighter✨ in person xx", "karen.in.the.citay": "PS you’re a big ole advocate!!!!", "omamimini": "1. I love you. 2. if you’d consider a bar with no dinner I highly recommend @rumandsugarbar. 3. they’ll uber eats you ANYTHING I’m sure, right @ozhuravskaya ? 😘", "kamelaanderson": "Locanda in the mission for an amazing glass of red and some ridiculously rich pasta 🍝", "sayhelloaidee": "💘🙌🏾", "mbbakes76": "Blvd. San Francisco", "alyssajo": "@bluestemsf 👌🏼", "tanya922": "The restaurants by Fisherman’s Wharf have a lovely view of the Bay and/or Golden Gate Bridges, can totally dine solo too, especially outside if it’s warm enough. Psbtw, you rock. 💥", "fara.kozysweethome": "You are a true inspiration💙!", "marybush123": "Leo’s oyster bar!", "mauifish": "Yay have an Irish coffee at Buena Vista 💛", "rachellaforce": "I LOVE THIS!!! So many congrats to you for pushing past all your struggles and fears + I’ve found that when I have a negative thought about myself I replace it w/ a recent positive one someone else provided for me. 💛💛💛 Thank you for your work Jen!", "designandhappiness": "@tartinemanufactory @truelaurelsf @amanosf welcome to SF!", "chloe_kiser": "Try The Progress! Order a Martini like a grown ass person!! (Best martinis on planet earth!) Get the potato chips with salmon roe dip!", "karlawelchstylist\nVerified": "Verified", "hollymariegibbs": "Little Gem in Hayes Valley. Everything there is so good. Then walk over to Souvla for the frozen yogurt (I like the tart cherries on top) or @saltandstraw (it's worth waiting in line) for one of their many amazing flavors 😍", "margaretmburton": "So excited to see you tomorrow!!!! 💚🎉✨", "therealshivs": "Hog Island at the Ferry Building or Zuni Cafe", "sunnychanel": "Depends on where in SF you are. You could go to North Beach and do all old school at Original Joes, or if you’re downtown to could do Sam’s Grill (also old school), or head to this mission and go to Tacolicious and have some margaritas (they’re really good).", "anina_tee": "Lolo for fancy tacos. Hog Island Oyster company or La Mar for seafood and a view of the Bay.", "samtews": "💜", "kellygarret415": "Nopa, Zuni, Che Fico. Enjoy SF!", "edeliddo": "Dinner at Zuni!✨", "marykate_obvi": "Mario's Bohemian Cigar Store Cafe!!!", "nca86": "Nopa at the bar!", "rockdoodles": "Union Larder or Park Tavern!", "nutty4depp": "Original Joe’s! 🍷🍝", "___mary_v____": "You're the 🐝 🐝 🐝 knees", "__ejk": "go to trick dog 🖤", "kathrynspelce": "Comstock Saloon is casual yet DELICIOUS", "m_marty67": "You are my inspiration. every damn piece of you 🧡", "kadrian.alvarenga": "Sam’s Burgers for a late night burger and beer. Truly", "juliaforrest": "The Page", "elleebeans": "Love love this✨ Crazy how the universe works like that💛", "bbelkin": "Sit at the bar and have the burger and a gin cocktail and get the broccolini instead of fries", "paperbird__": "Go to Liholiho!", "cherryc.c": "love this sm 💓", "bubbyandbean": "You are a badass.", "kevinmichaelericson": "Zuni Cafe", "meeeshw": "Souvla for lunch 💯", "hisclementine": "Locanda", "conninator": "😭😍. Thank you!"}