{"__sierrasmith": "I’ve never heard a person describe depression in a way that makes such complete sense to me. I wish people without it could follow you and your journey and understand how to help others like myself. You’re truly inspiring.", "rebelheartpoetry": "I relate to this very much. ❤️", "angmatange": "🖤🖤🖤", "heyjamiek": "Thank you, @jengotch 💕 you said it all better than I have the ability to put into words right now", "karlee00243": ". Thank you for sharing.", "jdawgfishh": "@mikkijeanie 💓", "colleenjbriggs": "💗💗💗", "paigeappel": "Love you babe", "councilofphil.forosalia": "smart thought processing location.", "natalia_new_west": "@ca_bryant this", "theblogginbabe": "Thank you for sharing! Depression is incredibly inconvenient, I couldn’t agree more. Pretty much feels paralyzing. I’m fighting the fight with you 💛", "mama_thomp": "Lizzo cures all 🙏🏻", "emmablackcreative": "🤗", "cichlee": "I will remember your beautiful description and share. U have a Gift of clarity after bravely walking forward to find words. Those of us with broken hearts 💔 or just flipping sad this holiday due to loss/ death have a bittersweet easy path. The lines are straight. The grief is pure flip side of lOve. No shame. I am always grateful for that.", "kikdinino": "I’m sitting here, in the same place, feeling like I’ve already outlogic’ed myself out of feeling bad... but as we all know, sometimes it’s just not that easy. I think what always helps is standing in your truth about not being okay, reading beautiful posts like yours of other people also admitting they are struggling and through are struggles are different — also same same. Sometimes those in struggles just need to feel they aren’t alone. Thanks for being brave and sharing, I hear you and you aren’t alone. ♥️", "lipglossandbrassknuckles": "Thank you @jengotch for being exactly who you are at this moment in time.", "mollylomenzo": "@elainelomenzo", "danymg78": "You are amazing😍", "luciatheresamassoni": "@jengotch Lizzo makes me happy too!!!! The DŃA test. LOL!", "lorraineedelru": "You’re not alone ♥️", "kristen___irene": "right there with you. maybe it’s bc january won’t end and my vit D levels are prob in the trash 🌞😭💗", "kara_sepulveda": "😍😍😍😍😍", "laurenrojany": "Such a beautifully accurate description! Been there ! Thanks for your vulnerable honest sharing!", "rosh.bo": "It's been a while you've uploaded anything on stories... Just dropping in to say you're an incredibly inspiring human and you are fine right now... Sending Lots of love your way from the East Side of the globe 😊", "livreandlipstick": "One BP to another - this will pass! I know you know but sometimes hearing it helps. Looking forward to hearing you’re at 7.8 again xxx @jengotch", "jillianmorkan": "❤️❤️❤️", "sarah_annew": "@honeybunnbarbiee this made me think of you. Hang in there.", "crissyperham": "Thinking of you and hope that our positive vibes can reach you and help you just a bit...each second of each minute of each hour of each day. ❤️👊🏻", "goldenstatevintage": "FEEL BETTER JEN GOTCH! this time of year is a genuine mixed bag of joy and sorrow. hang tight. it’s half over. ❤️🎄❤️", "ccmacstudio": "I hope you’re feeling better. Thank you for explaining the inexplicable ❤️❤️❤️🍃", "katedavisphoto": "❤️❤️❤️❤️", "daisyleyland": "💛💛💛💛💛", "kelseywhite_0220": "No words can help you but It will pass and you can climb this mountain... sharing your story makes you stronger than ever. You’re in my thoughts 🙏🏻", "beth58610": "💖💖💖", "kellbromm": "thank you ❤️❤️❤️", "jen.westerfeld": "Thank you for being so open and willing to share. Sending you rainbows 🌈 and sunshine ☀️ to get through the day...or days 😊", "alexandra_boge": "🖤", "_emmajune": "@tali_p 🖤", "emilyrozsypal": "Thank you for sharing this. Sending love and light to you.", "kristaleiann": "Saving these words for the next time I feel exactly like this to remember I'm not alone 💖", "c.beau": "You are phenomenal", "heatherj0101": "❤️❤️❤️", "the_j_of_snj": "Thank you for modeling your thoughts and sharing your strategies. You are courageous and have a powerful voice.", "kat_vicc": "@msjohnstonifyanasty relate", "lannabalector": "💕", "marianahuesca": "@rosie.eme", "gwdub": "The mass of flowers weighing me down. I know they smell good, feel velvety and look wonderful, but all I think is “meh.”", "aklimton": "❤️❤️❤️❤️❤️", "r___e__a": "Wow❣️ This definition describes perfectly what I am feeling. And I too am constantly searching for the catalyst and in the end feel even worse because thd search is „unsuccessfull“ and leads to more negativ feelings. Thank you so much for helping me to better understand ☺️", "kwe1964": "You had me at 🍕 thanks for speaking your truth! 👏🏼👏🏼", "hrovatdesigns": "Thank you for sharing this ❤️", "instadezz": "You have a beautiful way with words. I can FEEL you, which is one of your many gifts, I’m sure. ‘This too shall pass’ is always a good reminder and, when said after each negative thought, has the ability, at times, to shift our consciousness 💟🕉☮️", "e.vie77": "Thank u for sharing", "_hannahws": "Thank you for sharing. This was me all of last week. It felt like it would never end, but it did pass. At the time I felt as if I should be able to will it away. Am I not mentally strong enough?? But alas, it is physiological and just like if I had the flu, my mind and body needed rest. I hope and know the end is in sight for you as well. Hugs.", "lnalenyahh": "Thank you ❤️", "lydiamazzy": "The healing powers of Lizzo 😘", "moninavarro": "Thank you - for articulating the emotional and physical terrain of depression, the cognitive dissonance of it. Hoping you smell those flowers real soon.", "darla_webb": "@heatherlefler1 😑 I feel her.", "acmseger": "Jen, have you heard about a book called: 'Gut and Psychology Syndrome' by Natasha Campbell-Mcbride? Making the dietary changes recommended in the book has helped me alot. Hope you feel better soon!💗💗💗", "wendyknipp": "Feelings of depression are overwhelming and tend to come at an inconvenient time! I process sometimes why I feel like I do, I have a great life as well. I’ve come to the conclusion that my body and mind needs to rest. I call it my dark day. I watch movies and work at not feeling guilty about not doing anything. Good luck to you, thanks for sharing!", "theseeleysix": "I know I’m just a stranger but my guess is It’s probably from a virus you had! My depression always gets triggered by virus’s - even up to a week after!  But regardless, I’m really sorry. It sucks! Thank you for your vulnerability. I know not everyone believes in the power of prayer but I do and I will continue to keep you in mine - and all those who struggle with mental illness.", "christiehobson": "Haha ... it’s “lie” and I know this bc I teach my class that “‘I’ (person rather than thing) rhymes with ‘lie’” and ain’t that the gd truth. 😐. Hang in there, you aren’t alone. ❤️", "lazymooncollective": "God damned the guilt and shame... 🙅🏼‍♀️ That’s probably one of the worst side effects for me personally. Having a partner who has really never experienced clinical depression and not feeling totally confident he doesn’t think I’m just being lazy is a recurring insecurity (which he doesn’t, he’s such a good guy and he’s seen my manic episodes so he KNOWS, but nevertheless you feel it anyway which is the fuckedupness of the human psyche sometimes :/ ) Thank you btw for being so perceptive and relatable and aware when it comes to mental health. It truly is a comfort 🙌🏻🙏🏼😘", "katelc_": "This is do eloquent, I understand, and Im sending you love from Devon, England xx", "tdimond15": "💙 Feel better soon I hope. I hear you and can relate.🌹", "mjbrackin": "❤️", "kristinshake": "Thank you for sharing 🖤", "holliemaejanes": "♥️♥️♥️♥️♥️", "annelizabethjager": "You are so real. I hear you. I just pre-ordered your book on Amazon. Keep saying what you’re saying.", "eamjsh": "This resonates so much. Looking at the comments for so many. It can be so isolating but clearly we’re not alone. 💓", "b.o.b.b.y_d": "Wow. That fucking sucks! I think putting it out here for people to read will help them to understand your reactions, or lack there of, and should reduce the shame (should 🤔) and awkwardness. At least you realize your life has been pretty amazing 🤩 ♥️", "whitebat": "One thing I’ve learned is that if Lizzo doesn’t help, it’s definitely depression, not sadness. ❤️🙏🏼💕", "classic_rach": "This resonates so much 💕 thank you for sharing, the world needs more people like you open to vulnerability ❤️", "poseypowered": "Man, you just said it all.", "gingerannecullen": "❤️", "yem62282": "💯❤️", "tcdubb72": "I understand this so much. Seeing the flowers but not feeling them. Numb but not to shame. I am grateful for you sharing this. Here’s to an 8.3 coming soon hope hope hope 🤞🏻🤞🏻🤞🏻", "danielleksustendal": "Do your hair toss and check your nails boo💅🏼", "emily_katz\nVerified": "Verified", "ktay298": "❤️", "meglundberg": "❤️", "freckles.adventure": "this was beautifully said I've felt those words before but never able to explain it 🧡🧡 sending love and prayers", "mnbibes": "Your post has stuck with me all day. You so clearly articulated how I feel when I'm depressed. Thank you. You're not alone. ❤️", "meganpitsios_therapy": "I love you so much for opening up about this.💛 sometimes you just have take it slow- Pizza helps.", "krisqueaks": "❤️", "brittonette": "“chickens lay eggs, people lie” or so said my 👵🏻. she also used to always tell me “this too shall pass.” hang in there 😘", "stephanie_miear": "“It’s like being suffocated under a mountain of flowers” 💖✨💖", "arielrosen916": "❤️❤️", "freedomrachh": "💕💕💕", "gojenyoga": "Not alone, at all. My therapist asked me my safety scale today. 10 being allllll good! I’m at a 4. Blah. So so suffocating. I’m sorry. I’m sooooo sorry for the heaviness and wish for us all that someone had a quick remedy. You’re brave for staying and trying! xoxo Jen", "traciamodio": "I’m feeling ALL of this today. Many things you wrote resonate so loud with me. Thanks for always sharing. I’m sorry you feel this way because I know how much it sucks! As for the lay lie debate, one of my shit ex boyfriends from years and years ago liked to correct me. Super fun! Next!! Anyway, I do remember this and it actually did help, he said, “chickens lay eggs, you lie in bed.” So if anything I did get that from the relationship. Ha!", "starlitpope": "❤️❤️❤️", "kristinfust": "Thank you Jen 🖤", "hilaryjarecki": "How? How did u manage to describe a depressive episode so perfectly and beautifully? Brought tears to my eyes", "hello_candice": "I often use Lizzo as my medicine too 💕💕💕💕💕", "elseybee": "❤️", "uninvisiblepod": "❤️❤️❤️ sending you love 💪💪💪", "findsfives": "I second the holidays as culprit 🙋🏻‍♀️ also right there with you also love ya 💗", "sarahruppert": "❤️", "carolineinkc": "I really appreciate the way you talk about your depression and approach it. Thank you for sharing.", "heatherleea": "This resonates. Thank you for sharing ❤️", "fmk49048": "I know this doesn't work for everyone, but sometimes I can't fight it or beat it. sometimes I surrender to it knowing it will pass. Like a big wave. I can't stop it, I can't climb it. I take a deep breath and go under it, and let it pass over, or into it and let it take me a little bit. It passes and I take another breath. I don't focus on anything except the motion and my next breath. And let that be enough.", "goinbacktokali": "Thank you for sharing your vulnerability ❤️", "stacylondonreal\nVerified": "Verified", "laurasthings": "💕", "treadingart": "You’re sublime ✨✨✨💞💞✨✨✨", "albregia": "You brilliantly prismatic soul, don’t let the monochromatic haze dull your radiance. This is not a time to shine, but to heal and feel your feelings. You’ll bloom again soon💖", "natasha.chiam": "Did you just take all the thoughts from my head and type them here? Yes, yes you did. I hate not understanding. And the guilt. 💙", "carly_adair": "❤️❤️", "taymahay09": "JEN!! You are so brave and your vulnerability inspires me more than words could ever express in this tiny caption box. I feel you B.I.G. in that field of flowers. When you’re down there in the mud, next to the brittle leaves and stems gone by, be a seed. Cry those ugly depression tears and do hard shit. All flowers grow through dirt. 🌷🌻🌹", "aprylhayes": "@reneekesler @laurenbrooked see, we aren't alone ❤❤", "hbentley1": "💜💜💜", "lizhutnick": "Sometimes I put on Nothing Compares 2 u by Sinead O’Connor and just roll in it. 🌹🖤", "___may__day___": "💛💛💛💛💛💛💛💛💛💛💛", "zurikanuri": "Thank you for being raw and real. You inspire me ❤️ Sending you strength to make it through. ✊", "angie_lishmanning": "So relatable! And beautifully written, btw. @swanndive79", "beccabobecca": "I’ve never lived with depression, only had short bouts of anxiety throughout my 30’s, so I’ve never really understood posts like this. Where that dark cloud of ick just hangs in the air around you. I lost my precious 18 year old son in August and my entire happy little bubble has turned into this cloud of ick. I now have such empathy for people who live with this. I hope it lifts soon and your beautiful smile lights up my feed again soon. 🙏🏻", "cwsfav": "Being under a mountain of flowers! Yes! Thank you for sharing and helping those of us that share in the depression suffering.", "vadaashley": "You’re my hero. Thank you for sharing while you’re IN IT.", "the.lotus.letter": "I feel this. I feel this so much 😭😭", "pearlione": "was wondering how you were today. excelsior! ❤️", "pajamawanda": "❤️❤️❤️ Thank you for sharing your experience. It makes us all better.", "barrettmommy": "God I love you. You legit just nailed the exact level I have been at & feeling the same feels about it that I haven’t been able to put into words🥺 So thankful for pages like this knowing I’m not alone! Thanks sister for showing your true you🙏🏼", "lynch_alexandra": "Thank you", "kerrycrawford": "I blame the cold sore. 😬 Love you. ❤️", "deli.finalgirl": "🙌", "iedee19": "WOW! You have no idea how incredibly timely and affirming this was for me. Ive been in a very low depressive episode for several months. Bouncing between a 3 and a 5 on the ability to function scale. At a 2 I'm basically immobile, that's today. You said everything that's been in my head. Ive tried to figure it out and look for the catalyst. Its either all the things or none of them and likely just biology. Fucking biology. Anyway If I posted something so real and transparent Id get a bunch of lame platitudes or worse; avoidance. So I will live vicariously through your IG following. P.s I used to have an IG platform and it truly healed my soul. I deleted it as I had changed from its original mission but lately I regret stifling my honesty. This episode has me loathing everything about me. The best I can do is sit on my hands. Save for the quick trips to the kitchen for a dopamine fix ala chocolate chip cookie. 🔥❤️", "kimberly_higginson": "❤️❤️❤️", "abonetati": "❤️", "saramoon": "💛💛💛", "vanessabancheri": "Man I love you", "laurenmarie919": "❤️", "keeeks": "Sending you love and gratitude.", "heather_rome": "I hear you. And thank you. Feeling lots of expectations this week and frustrated I can’t meet them and not wanting to at the same time", "mo_musgrove": "You’ve articulated it all so well, so I’m bumping you up a 4.8! And, listening to Lizzo will put you up to a 5.0 by this Sunday. Add in some Earth, Wind & 🔥. Cause, girl, you are a Shining Star 🌟", "angela_f_miller": "With you ❤️", "lookbackwithwonder": "You’re the coolest. And also... it’s okay and completely human to just have this experience. Maybe the best thing we can do is truly give ourselves all the love and patience we need in these times. Maybe that’s the way out. 💓", "beccafrancesb": "i think i’m under that mountain. thank you for giving me that image. helps. ❤️", "cheryl_hale_quinnelly": "🌸🌸🌸🌸🌸🌸🌸🌸🌸", "quannieriver": "Thank you for this. ❤️", "swedeandspicey": "Wow thanks for being vulnerable and sharing. I get that feeling 💯 and the analogy of the flowers is spot on. Ride it out. You got this.", "carlsbeee": "You are not alone!!! 🧡🧡🧡🧡🧡🧡", "carolynkrinsley": "🧡💛💗", "denisecrew": "Thank you for sharing. I’ve come to understand that sometimes there is no trigger, no reason. It’s just a symptom of what you have. The more I accept that, the easier it is. But it’s hard 😘😘😘", "ohheyitssusanna": "You should go to the healing rooms in Redding,ca @jengotch highly recommend", "leopardprinty": "That just sounds so dam unfair. Sending hugs and hoping that darkness clears very soon 🌥", "hazelolivemary": "Thank you for clarifying my thoughts around thinking vs emotion. My prefrontal cortex is dorking out trying to figure out why my desires and motivation have been flipped off like a light switch. And even after all the experience I have with recurrent bouts of depression it still took me a day to realize that my amygdala was giving my prefrontal cortex and all of its “reasoning” an atomic wedgie, after crushing its glasses under its boot. While cracking up. She’s a powerful lady. I then felt angry reading comments like, “Drink lots of water” and, “But you looked so preeety the last time I saw you!”. I know, they’ve never felt depression and I should feel happy for them 🙄 🤭 😬", "ohhellohappinessgal": "Xoxoxo", "billie_ocean": "❤️🎈❤️🎈❤️", "marysenahopper": "@stacystasem after reading your post today, I saw this and thought you might connect with some of the things @jengotch says. She states her thoughts and feelings so eloquently, I always learn from her posts. And she’s damn funny too😂", "karenkmal": "Sometimes something is wrong and you just don’t realize it until later ❤️", "stellamariateresabernadette": "you're bit alone 💜 and you just really helped me", "ellen_arthur": "You got this girl! Thankyou for being open and candid. I'm currently coming out of a rough episode and sometimes I find that trying to pinpoint the cause can keep me in the cycle. Keep going and remember this WILL pass ❤️❤️❤️", "floridadawn": "Yep! Yep! I feel you.", "bigcarol": "❤️ You", "kmn007": "Omigod. I feel like I could've written this. I've been hit with two big waves of grief and caregiving that started at age 36. I'm doing so much better these days, but I've just come off a serious bout of depression this fall. Throughout all this, wading through all this, I've gained so much weight and a lot of it is from my BFF, pizza. It gives me so much comfort and joy, and then it gives me twice as much guilt and shame. I totally feel you and send you deep breaths and good sleep and love.", "rachelrolfe": "Where are you hormonally do you know - I got great relief from depression using bio-identical hormone replacement (read John Lee MD who published several books - important to do your own research.....recent studies are still using synthetic hormones “progestogens” instead of progesterone) really helped me out of the mire x", "the_fold_mag": "Same. Same. Same. Thank you ❤️", "topanga_vintage_market": "Oh boy. Getting a hit of that, too. I’m glad you pulled yourself out of the bed of thorns and into work. Getting over the morning inertia is a huge step, and I imagine work is a good place to be for you ❤️", "__goldlion__": "Thank you for sharing! As someone who lives with an anxiety disorder, this really resonates with me. And the fact that you are willing to share makes me feel less alone. So thank you. Sending you positive vibes and virtual hugs. ♥️🙏🏼", "sideorderly": "Sometimes there’s not a line or causal effect that is clear. Sometimes it’s stored somewhere in your nervous system, and something occurred that stimulated a old stored somatic response. All of this is subconscious, beyond just causal relationships. Stored trauma can peak at any time, and the slightest flicker of a feeling, can interrupt the most connected shaman. It’s about sitting in it. Learning where you’re feeling it in your body. Focusing on that internal experience. What does it bring up? Working through that somatic response and feeling can help expose your “why’s” and “how to’s”. Sending you deep grounding and healing vibes. The transparency and respect that you give to your process is soooo valuable to us all. Thank you.", "alyheintzraddatz": "Needed to see this today.", "lalamandee": "Lizzo always pumps me up. Bling bling that’s the goddess in you 😘", "courtni.jean": "This is a beautiful way on communicating how depression feels. Thank you. You are appreciated and you are awesome!", "millstoned": "🧿🧿🧿", "sonnetj": "You are loved and connected to the world in ways you don’t even know. If you can let yourself feel shitty without judgment it can be so much easier to move through the sludge. This is what I tell myself. 3 days into #TranscranialMagneticStimulation treatment and I’m gonna share the whole thing with everyone on here. You helped inspire me to do that. So thank you, at 4.1.", "love.and.m.oceans": "💛💛💛💛💛💛💛💛", "laurenxfowler": "🧡 not sure what virus you had, but earlier this year I had a chest infection and the doc put me on prednisone. It spurred a wave of depression that took me a few months to kick. I didn't know that pharmaceuticals could trigger depression until I read about it. (I took a lot of omegas, supplements and CBD oil to bounceback) Just leaving this here in case it's any use to anyone. I hope you're on your way to an upswing. Perhaps a mini trash dance is in order? 🧡All the love🧡", "julesbobu": "❤️🙏🏻❤️🙏🏻❤️🙏🏻", "justkaledit": "Blame it on the upcoming full moon... 😉 seriously though, I know how you feel (been there so many times myself) - hope the clouds lift soon!", "genie888": "YES. YES. YES. YOU WRITING HERE HELPS ME. I HEAR YOU. AND I KNOW EXACTLY WHAT YOU MEAN. WORD FOR WORD. THANK YOU!! Keep us updated if possible. ❤️❤️❤️", "erinrosch": "So beautifully written. ❤️❤️❤️ I’ve felt this way too much. “Being suffocated under a mountain of beautiful flowers.”", "effenj": "Hope one of my favorite mantras, “This too shall pass” is of some comfort to you & anyone else who needs to hear it today 🧡", "swg64": "Well said. 👏🏻🤩🤗", "imtherealanastasia": "Girl, thank you. I posted something so similar this am. My first actual post ab my struggle and I saw yours and burst into tears. Thank you for helping me know I’m not alone", "veronica.u2009": "Hugs", "imaginarygrace8": "Try listening to classic punk rock? My hub blasted it this morning and while I was annoyed then it propelled me forward", "tori_vigeant": "❤️", "annadishes": "💞💞💞💞", "berniestache": "Same 🚤here", "noelsmall": "Thank you Jen for so eloquently expressing what it’s like. Hang in there. That’s all I can say. That and, we love you!", "theslyestfox": "❤️❤️❤️❤️❤️❤️❤️❤️", "maggiemason": "❤️", "kirstenroberts_kradlife": "Xxxx love to you", "jane_m_phillips": "Thank you for this. Christmas has so many opportunities for joy and connection, but I feel the pressure of expectations, especially as a mom. Moms are supposed to set the tone or bring the magic and that is hard to meet all those expectations (which are mostly ones I place on myself, tbh.) My kids are young adults but it's a hard habit to break.", "anrebekkas": "You find the exact words that I so struggle to find when trying explain people in my life what a low episode is for me. Thank you. X", "nrnmjnsz": "You're such a brave, brave soul ❤️❤️❤️❤️ keep on fighting", "phantomframe": "❤️ to you", "doingjust.fine": "Everything about how raw and honest this is is life saving to so many people. Thanks for all the work you've done to be so real and vulnerable. I hope the dang thing let's up soon so the flower mountain can start to smell good again!", "adrienneroach": "@bethanieats", "yourstrulycaro": "Sending strength and support. I hope tomorrow is a bit easier. 💛", "kellonearth2020": "Maybe watching your parents modeling clips from a few weeks back might help for a min.❤️ I know they helped me.", "susan_touw": "❤️❤️❤️", "crnine": "I so admire your ability to share in the midst of it all. And you are practicing mindfulness like nobody’s business and are such a pro at facing it all, straight on - Pema Chodrin would be proud! I find you so powerful. And, as you know, you will move through this one. ❤️", "kelly_waters": "😘", "jeecaj": "I feel like I’ve been at a functioning (but barely) 4 for the past 3 months and I keep getting hit from all sides and can’t catch my breath. And same. Thanks for this. It’s a constant reminder we’re not alone. (Been wearing my anxiety necklace) ❤️❤️", "able_ground": "Sending love to you Jen ❤️ I know your words and sharing probably helped a lot of people today too. I did a post the other day on “emotional eating” over on @vanessa.knight that may help you love yourself more during that activity 😘", "baileyyferg": "thank you for sharing your brain with the world 💕🌸🦋", "sweetmoonlightshop": "❤️❤️❤️", "shelley_conchita": "Thank you 💛💛💛 It helps to know I'm not alone...", "baileyheikens": "❤️❤️❤️", "victoriajaneogden": "You have described depression so accurately!! That’s how I get too, it fucken sucks!! I hope you pull up out of it soon xx", "artlife.liz": "I'm so glad you share about dealing with mental illness. Your honesty is wonderful. Mental illness can definitely make us feel more alone, unknown, misunderstood - and you're one of the voices that most helps me feel less alone. Thank you!", "yosrakok": "@noahgrootenboer @raffaella.tr @jipvanvulpenx exact dit Zegmaar", "jamee_villa": "♥️", "beckymsimps": "💛💛💛", "kauffmanfarah": "❤️", "erinmgraham": "I see you here. I see you on the other side too. I see you. All love ❤️", "rachiiiee": "BEEN THERE", "emandthewildthings": "Thank you for articulating so well from the place you are at. It’s a gift.x", "brewnuts\nVerified": "Verified", "fr_isabelle.b": "This picture should never have happened ! 😳 When did you think it was respectful to ruin a worker’s job... for a picture ? 🤦‍♀️ #shameless #ego", "jennithegreat1": "Thank you @jengotch for sharing. I too am in a depressive episode that is related, I believe, to holiday stress, an upcoming surgery and the state of the world right now. Sending you positive vibes and happy thoughts . You are a light to so many and we are grateful for your words 💖🌵", "pistol_sf": "feeling all of this", "ms.alana.m": "😍", "michelebroxton": "Thank you 💗", "suziovaldi": "Thank you for sharing this for other who are going through these episodes at the same time so we don’t have to feel alone", "moonstorm.design": "So much love for you♥️", "avmorse": "Great analogy about the flowers! So true", "thenovogratz\nVerified": "Verified", "cindybmetcalf": "I love you friend ❤️", "sd4359": "That you can even articulate late those feelings is amazing!! I hope you heal quickly.", "pixiekendall": "I feel this hard ❤️", "amysayerp": "💕", "bridgetcarpanini": "You write so beautifully @jengotch. Thank you for bearing your soul. Your openness is a revelation to us Brits, where we are taught to keep a stiff upper lip. So thank you from the bottom of my heart. Stay strong and keep your eyes on the prize. Xxx", "samshendow": "Feeling all of this. And grateful that you can put it into words that *sort of* make sense of it. ❤️", "nicolemrf": "you always know how to make me feel heard and it inspires me bc i look up to you even though you experience the same things i hate about myself. it reminds me that i still have good qualities and lots of potential and my mental health doesn’t take away from my worth. don’t know if that made any sense but it’s true", "nicolecork": "💜", "wordcnorth": "😘", "meg.press": "I read half of this and started to scroll away. I didn't want to finish reading because it was too true for me. I made myself come back and finish reading because I needed to see it - in myself and also in you.", "stephvilladavis": "This is so me right now. Love that ‘suffocating under a mtn of beautiful flowers’ analogy. Spot on 👌🏽", "fromsfwithlove": "You are so rad! ❤️", "amberleeluvsae": "@bekaanne", "chenatothesea": "❤️", "motherraptor": "I’ve never commented on anything of yours, I honestly can’t remember how or why I started following you. But between the dancing dad videos and the brutal honestly I can’t look away. I’ve never had anything describe how they feel and have it so accurately describe how i feel during depression. Thank you so much for being brave and continuing to fight what feels like an endless battle. I believe in you.", "mariahwagar": "@hevdabev", "withdrawalsfilm": "❤️", "thejoyfuljewelrybox": "💛💛💛", "_becominglaura_": "❤️", "lisabraz": "It helps. More than you know. xxoo", "getmelinda": "You’re so brave. And relatable. And it ales a difference in my day. Thanks for all that. 😍", "jkburgin1": "Sorry about using the “🎉”", "ninni.insta.photo": "❤️", "ginarockenwagner": "❤️ Don’t judge yourself for feeling what you feel.", "melissatatetx": "#needed", "v_marie36": "Exactly, yes…", "dinasantora": "You got this @jengotch One day at a time. 💋❤👍", "kjlusch": "Thank you. That description was brilliant. I have spent the vast majority of my life in that space so my heart is right there with you. You’re not alone as I am sure you know. Sending love. 💗", "weller_tribe": "❤️❤️❤️", "luciana.terry": "♥️ you are so strong for sharing this, thank you", "erinjoycemcdonald": "I feel this in my soul. 💕", "darby_moran": "I have never read anything that fully explains my own feelings of depression and all that it entails. It felt like I was reading something that I myself wrote. Sometimes I just follow people on Instagram and I forgot who they are so when I read this post and every single thing you said resonated with me, I clicked on your profile and realized who you were! Ban.do CCO, a creator of light and joy and beauty (something that I hope to do one day). Knowing that you struggle with mental health in the same ways that I felt completely isolated in it, has truly changed everything for me. You are exactly who I want to become; a giver of light and love and art and someone who can so beautifully explain what’s going on in her head and heart. I know these words may feel numb in your current circumstances but just know you have someone all the way down in Texas wishing you everything good.", "kerrydolan": "🌺 ❤️", "thegoodfest": "HELL YES. We’re right over here, suffocating under a mountain of beautiful flowers, holding our breath as to not dare breath in any more fragrant gingerbread cinnamon pine merry merry madness, white-knuckle clutching our pizza and high caloric sweets...on a scale of 1 to 10, we’re feeling 1,000,000 in the comfort that (1) we’re not alone and (2) we’re safe here and (3) depression is something we can set down, spread out, share. Thank you for the raw truth. Please pass the Lizzo. 💗", "jackoeske": "💙💙💙", "lshefa": "You are such a gift. Thx for sharing your story. It’s helping so many people. ❤️", "brit\nVerified": "Verified", "ameliadoneup": "💕💕💕", "hotpieceoclass": "WOOF, the accurateness of that metaphor. drowning under flowers. i hear you on this, and REALLY get how fucking confusing it is. this thing that i live with also is so impenetrable sometimes, no matter how hard i work to understand it. i have no answers but i’m sending you some light and i appreciate you and your sharing all the time, whether in “good” times or “bad.” 💛", "jana_fabulous": "We are still here ❤️sending desert 🌵 vibes your way!", "tarajhaaz": "❤️❤️❤️", "erikay.erikay": "I have seriously listened to every fucking song on Spotify today that makes me feel sad. I do this when I’m in a depressive state and I don’t know why. Maybe I just think I can force myself to cry the sad out of me. Never works. This time of year just kills me because I need the sun (I’m a Texan living in the UK) to heal and there isn’t much of it around. Sigh. I’ve honestly just ordered pizza and it’s on the way.", "saucydeluxey": "❤️. It does help. You and all of us. Hoping the flowers clear for you soon so you can get above them instead of down below them.", "itsmefaithivory": "💕💕💕", "ladybuckmaster": "This. I also try to problem solve my depression - and that jerk is not rational.", "jenwoodruff": "Yes... still confused too", "mommagerlynz": "😘", "catiecatie": "❤️", "lucille_irl": "💛💛💛", "sbaidwan": "❤️", "atomicbuddha": "When I feel this I find only one thing helps, & it may sound too simple, && it may not work for everyone, BUT, what EVENTUALLY HELPS me is to bring my attention fully, 100% present... Sometimes the only way to do that is to literally narrate what I am doing in each moment. (The voice in my head is usually monotone and listless but nevertheless I narrate) \"I'm brushing my teeth. I'm getting in my car, I appreciate (even if you appreciate NOTHING, saying it sometimes, eventually, brings about small pockets of gratitude) I appreciate how firm my Subaru's seats are. I'm putting on my sunglasses. I'm driving to work. I appreciate that I have a great job to drive to. Oh look, it's raining. That cloud looks cool. Rain makes things green. That asshole driver just cut that lady off. I'm here at work. I'm parking...\" And so it goes until I'm starting to feel ACTUAL gratitude again. Sometimes it takes minutes, sometimes days. I try to pair this with actual, deep belly breathing because I know that activates my parasympathetic nervous system and activating that does wonders for mind and body. It's not a panacea but it might help someone reading this comment, so I wanted to share. 💙", "duftesarah": "Thank you so much for sharing! Sending love from Germany 💕", "drjuliaingle": "Thank you so much for sharing. You perfectly describe what it’s like to be in a depressive episode. You are amazing and you will get through this. 💕💕💕", "jenniferyoungstudio": "❤️❤️❤️", "elinorwhite": "Sending love until you can smell the flowers again!", "lindasahlin": "Thank you for sharing, Jen. It does help others, and I hope, you too. ♥️", "buckleygal": "I'm with you. I had TMS treatment in June and have been feeling great with no thoughts of feeling like a burden since. But it's creeping back in, though no ever near as badly as before. Holidays are full of high highs and low lows for me with anxiety throughout. I love you and appreciate you. And @lizzobeeating always helps❤️", "thischiburblife": "Solidarity ❤️", "the.unraveling.fern": "They way you articulated your experience with depression is beautiful. I feel you girl. I also dance with depression. Thank you for sharing this and putting it out there. I know that's not always easy, but it does feel good to get it off the chest. I'm glad that you have a good community here to support you. Don't worry, the smell of the flowers will soon come back into your nostrils, just be patient with yourself until then. Much love to you.", "dabouch": "You’re on day 10 and making it to work-that in itself is a huge accomplishment. You’re coherent, your brain is thinking at least somewhat clearly and you so beautifully say things so many of us feel but can’t express. And in times like these, we need to remind ourselves of the accomplishments, no matter how small. Good as Hell is on repeat for me when I’m in my fog! But when I’m really deep, Frightened Rabbit just gets it.", "poltaroid": "me and my sisters @handelspoon @mspolton are sending you so much love jg 💗💗💗", "wotwtc": "Remember that you’re a 100% that Gotch💗", "sandsmama": "A mountain of flowers. It’s that exactly. Thank you for sharing with us, Jen. I get it completely and I’m so often right there beside you. 🖤", "cassandra_ay": "❤️❤️❤️", "the_mother_work": "Same. In it with you. Trying to convince myself of the reasoning that how I’m feeling is end of year/decade energetic clearing out, but your brain doesn’t care about that when you feel this way. ❤", "debraparker": "Sending love✨!", "meghan.awalt": "you have a gift for putting words to these feelings that , while uniquely yours , also resonate with me (and so many others) Being a florist , that mountain of flowers analogy is so very real to me . gonna remember it for my next 4.1 day. so much gratitude for your vulnerability and wishing you ease through this moment .", "nataliemicheleharger": "Damn. This is so important to share. Thank you thank you thank you", "smithja83": "The light is coming✨", "cristinafoos": "🙏❤️🙏", "franca_02": "watching “I love Lucy” helps me sometimes. And knowing that we are not alone in going through this. A bit like a club. Sending love and calm feelings. thanks for sharing. 🌞🌞🌞", "crissycalhoun": "♥️", "claireottley": "\"Suffocating under a mountain of beautiful flowers\" is such a perfect way to describe this feeling. I feel this, often, and am constantly working to quiet the shame that comes along as a result. Hearing you, understanding you, supporting you. ♥️", "kemigreen": "❤️", "kellyoxford\nVerified": "Verified", "ajasax": "Thank you for this. At a 3.5 today and just grateful for those extra .5 points. Thank you for sharing your experience so we don’t all feel so alone.", "lisatapprudrow": "♥️", "fleurwoodsart": "So relate. Sending magic fuck iff depression potion.. when I find it. Til then 💖", "lindsaypete": "You put into words what I and most can’t, and that helps us all! Sending you love 💕✨", "melissadowler": "Oof. It’s hard, and it’s also ok to be down in it sometimes. ❤️", "studio.aray": "💛💛💛", "christinemfoote": "💗💗💗 it’s so hard when we intellectually know everything is going well but the body and mind make their own rogue decision, which deepens the guilt. thank you for always sharing 😘", "minimaggie": "💜💜💜", "thisfreebird": "same (or at least similar). Last night ate a giant bag of salt & vinegar chips, opened a box pot of gold chocolates I found in the cupboard, slayed some pumpkin cheesecake all while asking myself why I was doing this to myself even tho I was aware of why/what was happening. New day today. Almost out of the hole. Keep saying it until it happens. 🥬🌈", "rebeccabillybob": "I love your honesty , I’m the save, hate when I can’t assign my anxieties or depression to something, it then a circle and heightens because if that xx. Sending you hugs x", "mspolton": "@handelspoon @poltaroid", "gull.gram": "Eating foods that taste good and make you happy are part of the getting out of the depression slump. Every time I realize I'm eating what might be considered to some junk food, I know my heart and soul needed some release from rigid restrictions that were bogging me down and increasing my depression. #bipolarforthewin", "instafrenchierose": "♥️", "sunshine_stephanie": "💖", "heykimdang": "This. Absolutely this is how it feels to have depression. Some days you just can’t explain why you feel so low. Thank you sharing.", "eml898": "Gosh. This is what my last 2 weeks have been like. Cycling between anxiety and depression. I keep forcing myself to watch Nailed It- holiday edition and if Nicole Beyer makes me laugh I think \"I'm okay.\" But it's been a tough one. Maybe the earth shifted a little and fucked us up?", "tismejenny": "❤️", "kalibutterfly": "💓💓💓", "unforettable\nVerified": "Verified", "sarahlanemedia": "Same rn 😞 hang in there, sometimes you just have to wait for it to pass", "lolo_rad_o": "This cuts deep 🔪🌪🖤 thank you for putting words to feelings! #thistooshallpass", "too.many.emilys": "Thank you for always sharing ❤️❤️❤️ it means so much. And Lizzo always helps ❤️❤️❤️", "prettycrabby": "♥️♥️♥️ same ♥️♥️♥️", "christislomka": "I get it this on many levels. Sending hugs.", "_rxm_s": "❤️❤️❤️❤️", "radiantmeatball": "Same, except peanut butter. Even the gross natural kind that I buy so I don’t binge eat it when feeling like crap but have available when making things that call for peanut butter.", "pepperpheasant": "Love you Jen, as always thank you for sharing your vulnerability. Wishing you relief soon and sending you BIG hang in there kitty poster vibes your way 😽❤️", "mickmegan": "Totally hits home! Thank you for sharing.", "jacilew": "Thank you for sharing ❤️❤️", "allield": "❤️❤️❤️❤️❤️", "superchris77": "feeling this and you SO hard . you describe it perfectly .. the guilt of not being able to enjoy a beautiful life .. its SO confusing and demoralizing . im with you and many others in this . thank you jen for sharing ❤️ always eloquent and real ❤️ you inspire me endlessly", "justkatwithak": "Mental illnesses are so incredibly tough & feeling that depression when it strikes is unbelievably difficult to put into words! Mostly because it’s not tangible! But also because all of our experiences of it differ. I think what you’re doing (and saying) is awesome because being honest, open & willing to discuss these difficult experiences is everything! I know I find talking about it extremely cathartic & healing! By sharing your experience of it can only be a good thing & it truly hope it DOES help you! I’m pretty damn sure it helps others feel less alone & isolated too! 💖 Sending hugs from across the pond & hope you start to feel a bit brighter soon x", "poopiej": "It is brilliant that you can take a minute to tap in to what you can name, see what you can’t, and share it. I wish i had powerful words of wisdom but i have none. She’s a sneaky bitch and she does what she wants, that depression gal.", "aprettycoolgirl": "❤️❤️❤️❤️❤️", "liberteeurope": "Have you ever heard of #HumanDesign? I hope you do, it helped me so much! I don’t know your human design type (I would need your birth time) But this sounds like a Generator Plateau to me... https://www.puregenerators.com/blog/plateau", "shellydoty": "I am always so grateful for your honesty", "paperplanesandmudpies": "💛", "le.doucette": "You’ve helped a ton of people just by writing this. I’m struggling too and all the perfect holiday posts make me feel more miserable and then here you are saving my day with honesty. 💖💕❤️ I hope the fog lifts for you immediately😘", "erinlikesoldchairs": "💘💘💘", "julann.j.h": "You’ve just described how I feel. Stuck underneath. Down below is another version of myself with thoughts and feelings that aren’t reflected on the surface. Thanks for being vulnerable and reminding me I have company down here.", "thejonesmarket": "❤️", "deathvalleyboogie": "So very relatable. Much love to you, lady ❤️", "theholistichoneyyy": "I get this 🙏🏼❤️", "yefrisensei": "Thank you so much! So wonderful! 😭❤️", "beckycooke": "🍕 👑 ♥️", "jewelyayaya": "@seattlesbestcoffey", "allisonmucherino": "Listened to Feel It by Just Chameleons this morning in my car to get me in the door to work - feel this 💗", "teatoastandturmoil": "❤️", "monica__simone": "this is the most poignant description of my life I have ever read. I love you. I see you. I am you. you are not alone. You are FUCKING AMAZING and thank you for your wild, crazy, beautiful, complicated mind/heart + spirit. you have me over in San Diego clapping for you. holding space for your experience + sending you the biggest coziest hug ever. 🙏🏼❤️ @jengotch", "theodorable": "This, too, shall pass, even if it doesn’t feel like it right now ❤️❤️", "imaguillotine": "♥️💖♥️💖", "prisjohns": "You’re openness is so appreciated. I hope it helps you release some of the hold the big D has on you, because your words help ease it in me. Thanks for keeping it real ❤️🙏🏻", "missponyweather": "❤️✨", "jessicadaviesmetalworks": "❤️❤️❤️", "amanduhleach": "Thank you for sharing. Sending warm vibes your way. 💖", "call.them.rogues": "Thank you for this. Thank you for everything. I hear you, and I love the heart inside you.", "lindsaydeeann": "I so much appreciate your beautiful honesty. It is so hard to put into words the way I feel and this is it. Where do these feelings come from, why do they happen and FUCK the world, leave me alone! I admire your courage to voice how you feel...it gives others enlightenment into how they might sort out what they are feeling.❤️", "imdanielleegray": "🎊🥳🎈🍰 Happy Birthday @jengotch 🎊🥳🎈🍰", "diaryofamindfulmom": "@lizzobeeating fixes everything! 😭", "binzor": "❤️", "sarahthyre": "♥️", "mavisvancamp": "This has been my whole year, but I never would have been able@to articulate it so well. That helps, reading your description—and the damn eating—now I’m also fat. Dammit. I am going to think about the dotted bs straight lines. Thank you. You are a gift.", "cheerspatssweetiedarling": "Thank you for being you", "bethy.hebb": "Can I just say, same?! Thank you for making me feel like it’s ok to not be ok and that we are in this together😊", "beccafrancesatkinson": "Beautiful thank you ❤️ @lucyswank sharing this with u too", "shimonahirchberg": "💕", "falonfoss": "💓", "lilylovelock": "💕💕💕💕💕💕💕", "thesmalltownstylist": "❤️ Love you thanks for sharing 😘", "laura.gwinn": "For me it really thing it was the season change coupled with time change. Just took me down. Sending you so much love and support ♥️", "katwalkef501": "Love you Jen. 💗", "kkarissajean": "❤️🙏🏽", "sun_qu33n": "This hit me so hard. I relate to this so much. ❤️🌈 #staystrong #depressionsucks", "linds277": "Thank you for sharing so openly. You’re helping so many people feel less alone and ashamed. Something that helps me to remember, “this too shall pass” 💕 Sending love", "torinichole18": "@lizzobeeating really fucking battles that shit for me sometimes. I hope she knows she has that kind of fucking power", "lydia.hostetler": "🙌🙌🙌🙌🤕", "adrod26": "OMG! I can relate to this so badly. Everything seems ok, somehow I’m still sad, anxious; can’t pinpoint. It doesn’t matter how much I talk with my Dr. we can’t sort it out. I just keep pushing through the days...hating myself for not having an answer. I hear you @jengotch , I see you. You are not alone, and I can’t fix you nor you can’t fix me, but we can suffocate under the pleasant smell of flowers together. 👫 Isn’t mental illness just fucking great!", "delphinevanh": "Did you hear about Toxoplasma gondii, the bizarre parasite that makes mice unafraid of cats, a brief infection with a weakened form of the protozoan caused mice to permanently lose their innate fear of cats and to get trapped. Brain and guts are totally connected. A big army of bacteria in your guts must enjoy the pizzas but their development, death and colonization create toxins that pass the encephalic barrier. To stay away from carbs help me to keep a clear brain 🧠", "justagirl": "🙏🏼💗💗💗", "guerreiroclaudia": "I hear and feel all of this. Especially this holiday time of year", "itshotinthistrailer": "We are the same person. And honestly is there even a straight line to the catalyst ever or is that just our cognitive nature doing anything it can to point to or identify the WHY when we all know.... it is just there, boom surprise, just shows up like your fucking period does and there is no true straight line catalyst, and only the dotted line things that are \"aiding and abetting\" the how bad it will be/ how quick the recovery or upswing. Ugh, sucks. Hugs and pizza fortunately/unfortunately.", "faith___rivera___": "💛", "thekdv": "💖💖💖💖💖💖", "taniat_o": "❤️", "kimberlyjmuller": "❤️❤️❤️", "_alipali_": "❤️", "sfgirlbybay\nVerified": "Verified", "o_jamie_o": "💜", "melaniesantos.co": "Love this and you @jengotch. You always make me feel better about sharing my 3.5’s on here too. Sending you + energy so you can get tf out of this episode faster than normal. 🌹", "lyyoso": "wow. I love you.", "darcelmolina_128": "💙💙💙", "aims888": "You’ve got this 🌸🌼🌷🌹🌺", "loveandlightbulbs": "💜", "aestheticsofjoy": "❤️All I know is it’s pretty f’ing brave and generous to put this out there and I am proud that I know you.❤️", "nicole_andexler": "Sending virtual hugs🤗 Thanks for being so raw & real. You will come out the other side strong as ever🌸🌼🌺", "bratalie": "Hang in there, love ❤️❤️❤️❤️❤️", "thehappyloveproject": "Were not supposed to understand it. When we are low it only means we need to release and heal wounds. When we do that, we become high vibe again. Its time to enjoy. When we are low again, its time for healing.", "meltedxheese": "I'm sorry you're going through this. So am I. Your words capture what my brain does, trying to figure it out. Thank you. I wish we weren't here but thankful I'm not alone", "paulahisel": "I wish I didn’t, but I understand this all too well. Hoping and praying those flowers start smelling great for you soon", "swannamac": "Thank you for sharing this. ❤️", "love_n_grow": "Me too", "jamierondeau": "The brain can be such an assh*le. You’ve got this. ✨✨", "lynn__bird": "Feeling this lately, trying to convince myself that its seasonal and that more light will help somehow", "little_suz": "Sending you a REALLY big hug 🤗", "amber.rhodes": "You took the words out of my mouth. Thank you for speaking on it.💖", "corinne.adams": "This. Sending love and light ✨♥️", "helloknicole": "Rollercoaster for one! 🙃 I know these feelings. You’re dope for helping to destigmatize them by sharing them. THANK YOU.", "erindelaneyjoyce": "Blast the Lizzo. Be kind to yourself. YOU’RE THE BOSS. 💕", "hppuffnstuff": "@jengotch I feel almost EXACTLY the same way. It isn't easy and asking for help can be harder than the actual depression. Posts like this that destigmatize mental health, along with the support of my partner, and my own desire to improve my mental health landed me in a psychiatrists office. I felt hella guilty and ashamed because I couldn't beat this on my own. But I know this is so common. My doc shared that asking for help is a sign of unbelievable strength. Most people just suffer through their depression instead of getting the help that's available. Anywho... I just want to say thanks. It's posts like this that remind me why I do what I do and encourage me to keep aiming for improvement. I hope you find a way through your own struggle. It's super hard and you're a strong woman for owning your shit like this.", "galorestyle": "Sending you peace 💛", "denzmarsh": "Hearing and recognising your words. You are not alone. And all this will pass. Your dancing insta stories help me on a regular basis. X", "priscilla.cristobal": "♥️", "rademacher": "Some times these seasons creep back on us when things are fine Becca use part of us doesn’t think we deserve to be happy. For me it can come right after great things. My self talk is terrible and I haven’t gotten past over around that deep feeling that happiness isn’t for me or that true peace in my body isn’t for me. In my life this feeling of unworthy of sustaining joy tends to be an underlying cause of my depression.", "wrenarthur": "Thank you. You are so articulate. ♥️", "amanda_l_wolf": "I’ve never read a more accurate depiction of a depressive episode. I hate to hear of anyone experiencing these feelings, even a total stranger. But know that in the midst of your darkness, your words still had the ability to bring light. Your words have allowed others to name their feelings and emotions. Prayers you’re out of the valley soon.", "sherise.lee": "💗🌺 you can power thru this! I’m barely powering thru it today. For me: Coffee painting dog kids... ok and pizza!", "oftenwander": "This time of year is ALWAYS a trigger for me, always. Sending you big 20 second hug and sunshine in your eyes. Better days ahead, this we know for sure! ❤️❤️❤️", "amdable": "God this is so me right now.", "marisarugnetta": "These are words I could have written myself. There is beauty all around but somehow it’s missed when I’m not right. I’m sending you love and positive vibes for a quick turn around. I like to tell people that sharing brings peace to my pain. I am often the voice of the person I wish I heard years ago so that I didn’t feel so alone on my journey. It’s amazing what sharing can do for not only the reader, but for the person being vulnerable. I have found that the harder the times and situation, the more vulnerable I tend to be. Being vulnerable has allowed me to find strength. I hope the same for you. Please keep sharing, you touch so many lives by doing so... and many will never mention a word. Never like a post. Never comment or share. Lives are impacted and people are inspired. Please continue to share, especially when it feels the hardest... you are making a difference in lives! Thank you for being you and sharing you with us. I know I appreciate your words and am inspired by you often! 💗", "hollycnu": "Humans lie. Objects lay. That’s how I remember it! Big love to you 💓", "meredithgeller1": "Sending you ♥️♥️♥️...and more ♥️. And grace in these moments. Powerful share. Thank you.✨", "farmgirlfashionista": "So sorry you’re struggling. Thank you for your honesty though. The guilt is the worst. ❤️🙏🏻🤗", "moss_and_lava": "Thanks for sharing. I’m confident you’ll be around the bend soon and beautiful fragrant petals will be raining down on you leaving space to see the sun again. In the meantime, when I’m in my deepest depths, I usually find dancing to Lizzo much more therapeutic then simply listening. So go on—get outta that car. You got this!💕", "nabiadesigns": "❤️❤️❤️", "jackiepmcd": "💜🌈", "kris_55_reeder": "Have you met @thebloggess she's a great champion for ’Depression Lies’? She's has a wonderful community of folks that get it. ❤️ Her and you.", "mckenziejoroberts": "That analogy. You’ve got such a gift ❤️", "its.fernandalh": "❤️✨🍀", "alison_maeby": "For what it’s worth, your words completely describes my current situation. And honestly? So many others I know. So maybe it’s not so much a straight line but a universal circle of depression right now. And not that it will make you feel better, or me for that matter, but I do appreciate how you constantly bring us all together in awareness of our shared experiences. You’re not alone, I’m not alone, we are not alone. Trying to get through it one day at a time is all we can do, and I’m glad to have friends and Instagram-friends to “hold hands” with and muddle through it all together. 💜💜 ...Also, thank GOD for Lizzo.", "_hiimlinda": "Ooooh definitely needed to see this because I’m feeling the exact. Same. Way. Thanks Jen.", "kate_burns_chad": "❤️❤️❤️❤️❤️", "renbalesrhodes": "Thank-you Jen. You express it so well. ♥️🙏🏼♥️", "tarawhitney": "Hang on.♥️", "meggybeths": "This is the most accurate description of depression that I’ve read in...maybe ever? It’s exactly how I’ve been feeling lately. The holidays certainly don’t help either. Sending love and tenderness to everyone who can relate!!", "ilsggy": "I'm reading 'The body keeps score' (Bessel Van der Kolk, M.D.). I think it may help me understand a bit better. Even if I'm not necessarily suffering from PTSD. I think I understand how you feel, and it's okay. You're so not alone, there are many of us struggling out there under mountains of beautiful flowers. 🙈❤", "tbellucci": "Thanks for always being so open and honest—7.8 is around the corner 💖", "ivttpiquer": "❤️", "karlawelchstylist\nVerified": "Verified", "geeseandganders": "Keep working at it Jen! ❤️", "malkala": "I don’t have depression but if I did I would want to handle it like you do. ❤️", "kendrickbrinson": "Beautifully written", "limojames": "We’re with you....this too shall pass", "harmonycircusvintage": "You beautifully and accurately described exactly what I experience consistently. However, I’ve allowed depression to take over for far too long. It’s left me spinning my wheels and chasing things that had no business being chased... some of it maybe just is growing/learning?! 🤷🏻‍♀️ I also think certain creatives with certain strengths have this feeling of “never enough” or in my case “I’m never enough” and by the end of the cycle, I’m zapped. Thank you for sharing, it’s always inspiring and enjoyable reading your posts and watching you conquer life. You’ve created such an amazing business, and it seems you have incredible people surrounding you, even through the rough seas.. so for that cheers 🥂", "briarshopbelmont": "One foot in front of the other. Stick to your routines and you’ll get through this (that helps me anyway) sending you good thoughts 💕", "unforgettablemandy": "You are loved! And a huge human inspiration to me! *hugs*", "laserkitten\nVerified": "Verified", "xtinamooney_": "☁️", "i_am_jacks_random_thoughts": "I swear it's this damn full moon. Either way, I'm feeling it too, but we got this. Maybe not today, but we still do!💗👏💛", "500_daysofwinter": "You’re not alone. Thank you for sharing this. We should all be able to talk this freely about this!! A 7.9 is on the horizon. 💕", "thelymphaticmessage": "I call this time of year the Holiday Blues.... creeps up like a quiet cat 🐈 thanks so much for sharing ~ so important ✨", "tessmason": "@alexandraairey gosh do I Love her", "catmeghan": "Sending all the love ❤️", "mirbrown75": "Sending love and strength and a reminder of impermanence! The other side isn’t as far away as it feels. ❤️", "writenowrachel": "Your honesty, self-awareness, and recognition are so important to find healing. After all, you can’t treat a wound unless you acknowledge the bleeding. Take care of yourself and wishing you well. 🙏🏽💜", "vanhalenrulez": "You have a beautiful way of articulating feelings that are very hard to explain. If nothing else, I know that you sharing your pain will help others. Hang in there, girl ♥️", "emptynester2018": "Perhaps it’s just “the holidays.” Lifting you up. 🤗", "gracesmith72": "hugging you", "sarahcappie": "Lizzo makes everything better! Sending you 💛", "missykblack": "We are rooting for you. 💋", "kmirando": "so inspired by you! sending you good vibes. thank you for sharing ❤️", "larnww": "Sending you so much love. This too shall pass. You are not alone. I am grateful you have the courage to share your story with this space. ✨💕", "jennefaerious": "❤️", "bubbyandbean": "I so get this. Hoping it lifts soon. 💛", "trebhan": "@parakerry this one hurts very bad but in the good way yanno", "mkminnis_": "That exact feeling is how I finally pinpointed that I had depression. For years there was a *reason*: long hours at work, miserable winter weather, shitty dungeon apartment. But then we moved and life was fantastic: and warm weather, job I loved, new friends, endless travel, and one day I still got hit with an episode and I realized something was actually WRONG. Don’t really know what I’m saying here or what I’m getting at other than I know the feeling and I’m thinking of you!", "alexisangelini": "Sending love ❤️", "robots_are_rad": "Relate strongly to this ❤️", "socketwench": "Thank you 💖", "meghansmolka": "We love you woman! ✨❤️", "amyvbinns": "Hang in there! I’ve been in a long one for months but I just keep trying. Thanks for sharing ♥️", "weirallmadhere": "You’re not alone.", "green.glam.diana": "Listening to @localnatives helps me regroup and get outside myself in particular the album Hummingbird every track is Golden ✨✨✨ sending you very positive vibe I have 💖@jengotch", "smokinjdog": "Thanks", "elleebeans": "I know this feeling is hard as heck to get through but thank you for always sharing with us✨", "emptyecho": "“Suffocated under a mountain of...flowers...” Epic description. ❤️ Thank you for sharing.", "jordanferney": "❤️", "juliagartland": "Same", "claireespencer": "@the.unraveling.fern ❤️", "stelly_not_steely": "Please know our minds decide to do the most inconvenient depressive episodes without a cause. I feel like mine sneaks in like the fog on a winters day. Sending positive healing thoughts that this will pass sooner rather than later", "chamomileculture": "This is so, so relatable. Thank you for sharing ❤️✨", "jennylouclick": "✨Feel the light you shine on us sister!!", "kolloquial": "Awwww saw you at west coast craft & you looked like sunshine 🌞🌞🌞🌞", "rachaelseiter": "This picture is so perfect. Thank you for your honesty and openness to share, such real, raw feelings. Know that you are not alone. And you are not these weird thoughts in your head. We’re all trying to understand ourselves, Lizzo helps 100%. YOU ARE AWESOME!! 💃🏻✨", "heysarahbuchanan": "Thank you for sharing this. Powerful.", "sheworelore": "Drinking water & listening to music is always my go-to. Sending love 💗", "somekindofhappiness": "♥️", "mindfulauren": "You are incredible. You are strong. You are resilient. Wishing you relief so soon. 💙💙💙", "sugarwishgirl": "❤️ You are lovely!", "kristenkillie": "Thank you so much for always being so transparent and sharing your story. You’re helping more people than you know! Hang in there and know you’re not alone! 💗", "octoberhello": "♥️♥️♥️", "mrsadriennebosh\nVerified": "Verified", "iam_nlh": "♥️♥️♥️", "karahannah75": "Jen thank you so much for posting. I don’t have words to express how much your posts mean to me. Bipolar can be really isolating, these posts feel like a life preserver.", "astonehenge": "Thank you—from someone else hanging out under the flower mountain. xo", "bonzalis": "Ooft that flower analogy really got me... 💯", "ss.teph.an.ie": "Thank you for always being so open. It means the world to me and I’m sure so many others. You are so strong 💪 can’t wait to read your book and hear you back in my ears via podcast. Your vulnerability makes me open up more myself so I’m grateful for you Jen.", "iheart3i": "I loooove that u share! Hugs!", "cookingthroughgrief": "This is unfortunately the perfect description of depression — thank you for sharing. It’s the fucking worst 💓", "chancuterie": "❤️", "xo_kristimeow": "✨Sending love and healing vibes✨ hopefully it passes soon! ❤️", "mnnfrr": "❤️❤️❤️", "souperjane": "<3", "madisoclark": "You are an inspiration to me - thank you for continuing to share you on the good and the bad days.", "beachbunny1985": "Waves 🌊 out of nowhere", "mandidigancepritchard": "💞", "claire_kramer_mackinnon": "@mattzhaig", "kibstervintage": "Feeling this so much right now. It’s exhausting and I just want it to pass. I’m hoping things get better for you too, Jen. ❤️", "constancezimmer\nVerified": "Verified", "charmschoolfrances": "I see you J.", "chloeedelane": "thank you so much for being yourself with so much openness and grace for us too.", "rachbea": "I love you you are so real and raw and HELPFUL!", "leileiah": "Beautifully written. Thank you for sharing. Sending love!", "anjelicabannos": "Thank you for sharing...know that it is truly helpful 🙌🏻", "conninator": "Sending good vibes, prayers and warm thoughts, been there and appreciate your honesty.", "heatherandthepugs": "❤️❤️❤️", "katieepaul": "thank you.", "stleonardsmoderngoods": "Hope you bubble to the top again soon, or even to halfway xxx", "teamwoodnote": "“after a lifetime of working to understand it - i still get confused.” yes. all love. ❤️", "byersally": "💕💕 Thank you for always being honest. It makes me feel so much less alone.", "cheeriosandchanel": "😘", "jojojesio12": "❤️", "lolagraphy": "❤️", "nquenqua": "❤️❤️❤️❤️❤️❤️", "courageandcuriosity": "💚 it’s mind bending how it creeps up and grabs hold of us, like it feels as though we’ve forgotten it so it must desperately cling on to us- I’m sorry it’s got you again, it’s got me too but it’ll fall back in time, till then deep breaths and self hugs xx💚"}