{"aqualainey": "I just discovered you. Wow. Blown away! Thank you for putting it all out there.", "stationerybakery": "Love your realness! I do all the things and take lots of vitamins AND an ssri for my anxiety. It’s hard to find the right medication and takes tweaking y’all but it can really help ❤️❤️❤️❤️❤️❤️.", "christina_paccio_": "Frustrated at needing it is perfectly accurate ❤️", "danymg78": "👏🏼👏🏼👏🏼😘", "callierbrown": "I saw your book is set to come out in March! You are featured in BP magazine for much anticipated books of 2020. I can’t wait to read it! And, yes, the red pill looks like a panic button. 😂 Your bp sista 💁🏼‍♀️❤️", "tinkerbell_the_spoonie": "If that red pill is the same antidepressant I’m on, it’s been the best one I’ve ever been on ❤️", "carlee_taberspoon": "Thank you so much for this. I went through the same thing. I felt defeated... but now I am so grateful that I admitted I needed a mood stabilizer and life’s been SO much better ever since! ❤️", "enicoletta": "🙌🙌🙌💖💖💖💖", "mackichu": "@lesram31 this is basically how I feel about it too :’) but I also look at it in a positive light thanks to you and my other supporters 🖤", "styleandspace": "Absolutely inspired by your tenacity and openness. I live life as fully as I can with depression/anxiety/chronic illness and it always feels safer to know that others are on the journey too. 🖤🙋🏼‍♀️🌸", "swannamac": "🙌", "sofiaonetsy": "👏🏻👏🏻👏🏻", "cosmoladee": "@alyssa_delery read her post", "lyttmab": "@kammichellee honey, follow Jen, she is awesome. She suffers from many of the same things you do and she talks about it. She is the founder of ban.dō. That’s the company I’ve gotten a lot of your planner and desk stuff from. I used to get you hair accessories from her too (when you wore them😋). I ordered her book for us, as well. It’s not out yet but will be next month. Just thought you might enjoy it... Love you!! 💕", "mindfuloleta": "Thanks for sharing and opening up your obstacles in life. Gives others courage to share. The human experience is different for everyone sometimes we think we are at it alone but we are not ❤️", "frecklyscorpio": "You’re so special - thank you for using your platform (and exquisite writing skillage) to give a voice to what so many are feeling/have felt and don’t know how to describe to others. 💓", "thehouseofyes": "Jen, have you tried TMS? You might not need to re-introduce that med 💗", "stefanieslawik": "brave girls <3 proud of everone who is able to go this way :)", "lisa.weiss.art": "Godspeed", "gunnar_gunnarsson": "Maybe there was a #matrix fan involved #neo #morpheus", "heydrjustine": "Love that you are sharing this #nostigma 💛", "elliotlaplante": "@mitcheeosbourne", "livreandlipstick": "Bookmarked this to remind myself too. Thank you @jengotch 😘❤️", "themoderndaypocahontas": "Love you for sharing! You are changing my mindset for the better and because of you I am learning to embrace my anxiety and ocd and look at the brighter side instead of the stigmas", "hrlo": "@jengotch my friend just told me about including a mood stabilizer with my anti depressant. I have a hard time being consistent with my meds because I never find the right balance. Please let us know how it’s working for you. I’m concerned about taking more than one Rx for depression. As you know it’s difficult finding people who are willing to be open and share med experiences. Until I became friends with her I didn’t know anyone on antidepressants who was willing to talk about experiences.  Thank you 💕💕🙏", "maddiedalehere": "👏🏼💕🙌🏼", "ash_interrupted_": "@tammypants", "celesteellen": "@martina7252", "vikkiradzan": "Now this should break the internet. Thanks for having the emotional intelligence to feel this way but ultimately to share this. You should be proud that this content actually changes perceptions, educates and gives people hope and confidence to get help.", "c.u.at.the.beach": "Love your honesty and vulnerability. It matters! I too have had to make that hard decision. But I made it for ME.", "nycrecessionista": "I was so hesitant about starting anti-anxiety medication back in 2012, but I’m so thankful I gave it a try. I haven’t had a single panic attack in 7 years and I’ve felt like myself again.", "kid_ace": "It’s so inspiring not only that you are continuing to keep tabs on your mental health, but that you are taking the time to acknowledge and appreciate yourself for it. Finding gratitude for myself in the midst of depression is so hard, but seeing someone else do it for themselves makes it a little less hard. Thank you again and again for sharing your experiences 💕", "maria_bikou": "💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼❤", "mama_thomp": "Which idiot made this decision?! 🙈 maybe a yellow smiley face instead?", "bohobluestocking": "You got this (from someone who takes the palmful of pills 💊) 🥊", "kittyauty": "Bless you for sharing 🙏", "derbyrevival": "I started an Ssri this summer and it literally has changed my life. I’ve seriously needed one for a decade. ❤️❤️", "littlepeaksphoto": "💪❤️💪", "itsalexduvall": "🙌🏻🙌🏻🙌🏻", "rufpop": "Sending lots of ♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️ your way - they are a different type of red", "ultravioletkids": "Thank you for sharing your journey with us all. No one wants to be on medication but the fact it’s here to balance out our brains is a great gift. Xx", "native_poppy": "✨✨✨", "sebastian.sierruhh": "queen where are you", "redhotdesign": "it should be a little red heart ❤️", "lologreenwood": "We miss you!!", "collriordan": "Checking in on you...😻😘", "necygirl45": "Jen I am thinking about you and cheering you on. Keep going. You will feel better ☀️", "atingofbooty": "I took a tonal pill pallette photo just. Like. This. keep on keepin on, mama. 🔥", "whatgqsaid": "There is nothing to be ashamed about taking care of you! Thank you for being so authentic and for educating on the importance of mental health. You are truly an inspiration!", "theoulacompany": "Hang in there! ✨❤️🙏🏾", "braintoasters": "What is it", "indigoinknz": "I soooo enjoy your honesty and nice work on getting yourself to the Dr!", "avec_du_fromage": "Thank you for being vulnerable in public. You are helping to normalize the ups and downs we all have but pretend we’re not going through.", "cupcakethedog": "I think it looks happy! #worthatry 🐶❤️🔴", "antonio_tarez_wynn_": "💪🏾", "lpresley_2": "Thanku for sharing your story. Above all that medication from my own story the one thing that helped me the most was God and prayers. Wishing you a healthy 2020 and promise to add you to my prayers. ❤️", "hannnza": "This is everything and I’m so grateful for your openness ❤️❤️", "jamiemenna": "❤️", "luna.lexei": "🌈🐛🌈", "nikfrom73": "Way to go! Each & every one of those steps is a way forward. Just keep swimming! 😘 My pill isn’t red but it’s the same size. Life?!! Am I right!", "ho11ywi11iamson": "@twisted_firestarter_", "pumolati": "I love this. Thank you for sharing.❤️", "andylovemath": "Don’t give up. Meds are silly but when taken rigorously, they allow a better life because they make psychotherapy more efficient. And never forget, when life appear like back to normal with pills, it’s because it took a lot of time to become efficient, and stopping them is equal to a reset. Taking the meds is a choice, for some people it isn’t the good one, but for some it’s essential. You are strong, you are courageous! Another pill everyone should de take is hope, humor and love. Every morning and every night! Don’t give up. Life is worth it! It holds promesses, we need to grasp them! 😘", "morgannewiltse": "You are a badass and an inspiration! 💞🙌🏼", "ladyrbecca": "Thank you💚", "onefinea": "❤️❤️❤️", "pattymessner": "♥️♥️♥️", "kindkitten": "As a high school therapeutic teacher who spends the day talking about responsible mental health, I thank you.", "ericka_catanzaro": "So inspiring to see your journey and your strength ❤️👏🏼", "erinsenge": "This is exactly what I needed to hear right now. This is exactly the conversation I had with my psychiatrist today. I am in a good place, but scared of the specter of my yearly winter breakdown, trying to trust in my meds and my skills and my awareness and my support systems. I hope I am able to do this, if and when I need to, and that I can stop letting fear of tomorrow steal my joy today.", "rosiejcm": "I think I need a giant red blinking pill to remind me I’m trying to get through this still like some beacon in the middle of the ocean.", "butterandeggsinteriors": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻You are amazing!", "aklimton": "❤️❤️❤️", "casie1143": "❤️😘", "delliepooh2": "Do you say \"already scary\" because antidepressants are so hard to stop, party because of the withdrawal side effects?", "meperez69": "❤🙌", "mirandaselwynbishop": "You are brave 🌟", "boozerbomb": "For me, finding the right medication was a battle I wasn’t anticipating. It’s so important to stick with it if one thing doesn’t work and find the thing (or combination of things) that does. So happy for you that you were able to see clearly that you needed that help and got it for yourself. As someone who has struggled with depression my entire life, I can totally relate to what an enormous hurtle that is and how hard you must have worked to get over it. I hope this combination brings you some levity. Thank you for sharing your story.", "artbybeata": "It looks like Rudolf’s red nose 😉 You can do this. 🙌🏻💖💖💖", "suzylauder": "I hope your adult acne medicine is Accutane", "nicolerenaeton": "What do you take for acne?", "colbykathryn": "Fuckin love my antidepressants 😍", "carrie_banks": "It’s so easy to feel discouraged and focus on just wishing you didn’t have depression. But by choosing to take medication you’re putting yourself back in control and taking the control away from the depression. I go on and off anti depressants and instead of being sad or disappointed when I go back on them I instead approach it like “No, no, depression! No room for you here! I see you around the corner but I’m not letting you in!”", "srhstvnsart": "You’re a mental health journey inspiration and one of my many supporters (even though you don’t know it) on my road to mental health. Damn, I appreciated this caption so much. Thank you for existing authentically and so publicly.", "alicebrewstylist": "🎈✨xx", "ohkdarling": "Very fortunate that mine are pale pink! Makes taking three of them less intimidating 🧠💕🌸", "shimonahirchberg": "💕", "lobsterandswan": "❤️❤️❤️", "missbrookewhitney": "Maybe it’s red to symbolize the love and self love you can provide yourself with it ❤️", "hanleon_": "You’re amazing Jen. Maybe the irony of this particular pill was fully intentional - a gentle nudge from its creators of “yes, you are going through hell but hit the panic button to get out of it” - or maybe I’m still somehow bizarrely optimistic in humanity. Regardless - I feel you and I’m with you. ♥️", "lizziewarren04": "I wouldn't have a life without my medication protocol. There is no shame in my game and there shouldn't be any in yours. We are motherfucking Warriors!! #moodstabilizers #antidepressant #anticonvulsant #benzodiazapines #medsbringlife #takeyourmeds", "greeng_scott": "Sending you hugs 🤗 and gratitude for your honesty. It’s all good , vitamins for the mind as well as the body 👏👌😘🌈🌥⛅️🌤☀️xx", "bunniesandboba": "I try to remember that no one shames people with diabetes for taking insulin so why should I be ashamed of meds I take to survive? You don't give a person with cancer crap so you don't get to give me crap. We're all fighting something", "jadeheritage": "❤️❤️❤️", "andreagarciamarquez": "so inspiring!", "carolynrubensteinphd": "Such a powerful reminder that you are in control of every step and decision ... one call, one turn, one red pill at a time. You are a force! 💙💙", "nicolembruce": "i never ever comment - but when joh said acne medication i felt the need to. are you taking accutane? that drug threw me in the deepest most darkest depression of my life 18 years ago. i wish i had known the side effects before taking.", "martinhardstark": "👍", "margrettag": "💛💛💛", "paisleystorm": "Recovery is a journey not a destination....thanks for yóur voice it speaks for millions and thank you for the beauty and joy you create everyday just by being 💯 you!!!", "elishahallplus3": "@katykmusic I ❤️ this beautiful woman.", "melissa_collette": "❤️", "michellaestrada": "❤️", "pnutpickles": "Thank you for always being so beautifully honest about everything you are a TRUE inspiration! 💚", "allyrowz": "@bone.cub I appreciate her honesty. She totally gets it. We aren’t alone...", "queensparkle1": "Thanks, Jen! I have clinical depression, PTSD & an anxiety disorder. I’ve actually had “dear, close, lifelong” friends accuse me of being “addicted to drugs” & question the medications my psychiatrist has me on?! It wasn’t that long ago. And they KNOW me! And I thought they understood mental health! Thank you for helping to broaden the awareness so we are not judged & criticized so harshly by those who claim to love & support us & by those who have never met us! I regret now sharing anything with those friends & will will think twice before sharing in the future. Thanks for being an inspiration & helping all of us have a “safe space” here with you! 👏🏻♥️ @jengotch", "cleariste": "🙌🏻❤️", "mashamiteva": "❤️", "frankiefarrah": "@jengotch Hope 🔴 helps.", "phillysweetjilly": "Your writing is divine. Hope you get relief soon.", "ashleydee22": "❤️❤️❤️❤️❤️❤️❤️", "mambazo26": "Always with you", "mrsfish3": "You are incredible", "t_in_nb": "Just had an appt today where I gave in to the fact I NEED a similar kind of medication. Picked it up today and plan to start tomorrow. Scared shitless, but hopeful", "jo9anne": "i just broke my neck, nodding. 🖤", "mandarose24": "@angsauro I like tha caption", "erinlovescats": "♥️♥️♥️♥️", "leannlay09": "💕💕💕💕", "cheakey_chick": "Pills f'ed up my belly bad. I try to cure w my food. Sounds silly but it's working. But seriously who makes a red pill...that's crazy uncool.", "tiffanybrownanderson": "So much strength in the struggle right here. Forward. ✨", "megrobins": "❤️❤️❤️", "oftntld": "❤️", "sbaidwan": "💜", "nicolefogel": "❤️❤️", "simply.tess": "❤️So proud of you. Grateful for you sharing, as well. Brave❣️", "anitayokota": "Brave 💕", "thebestdaniellelevy": "You’re the most! As a fellow depressed person, I am beyond impressed and proud that you advocated for yourself while in an episode. That’s fucking strength right there. 💪♥️ Also. I agree, what fool pharma exec decided it was a good idea to make an oral AD even more intimidating by making it big and red. 🔴🤦🏼‍♀️", "rebekah_k_78": "Transparency is scary and vulnerable but i swear it changes people🙌🙌🙌🙌🙌🙌🙌🙌💫💫💫❤️❤️❤️", "happygirl__sadgirl": "❤️❤️❤️ thank you for always sharing your humanness, and your honesty 🙏🏼 you’re one of my favorite people that i don’t know", "janamboyles": "I’ve had family and loved ones criticize me for my anti-anxiety, but I know that it contributes to me being my best self and that’s all that matters. My anxiety manifests as depression, which is confusing to begin with. Being aware enough to know what you need is brilliant. Proud of you.", "stephpedigo": "♥️", "heytiffanyroe": "Meds are cool 🛋🆕🙌🏻♥️", "alwaysgeorge": "I really do admire the fact that you’ve gone on and come off certain meds. Besides while trying to get pregnant, I’ve never found a moment in my life where I felt safe having a go at life without them. It’s brave! Coming off them, and going back on them! ❤️✊🏻", "kparrigo": "I know it’s so hard, but it is so AWESOME that you share your story so openly. And meds are hard, too. Kudos to you for advocating for yourself (and everyone else that needs it). I hope it helps! 💛", "lucydorrisphoto": "Omg! This post just made my day. I love it when public figures speak openly about their mental health issues. I suffer with mental health issues myself, OCD, PTSD, Depression, etc. (basically everything). It’s so inspiring to extremely successful public figures embrace their mental health issues and speak openly about it. It helps reduce the stigma mental illness has in our society, and provides hope for those still suffering and those in recovery. ❤️", "julann.j.h": "@jengotch these posts are getting me through a rough time and I thank you for sharing. Helping me to get help and swallow the pills.", "little_saucy": "That’s some serious self love you just demonstrated.. & shared! Thank you!🙌🔥💕", "kimber_vicks": "All of this is so true!", "ohmygoth": "@jengotch I’m right there with you this week. I went on Monday to my psychiatrist and finally admitted my depression, mood, and anxiety have been getting increasingly worse. I’m weaning off one med and onto a new one which is terrifying because in the past it’s been a shitshow. But if you don’t ask, advocate, and try nothing will change and we deserve to feel better. Good luck to us and better days are ahead.", "gentryfied__78": "You are strong and you are brave. ✨💛", "benywaidd_": "❤️", "kellyamccartney": "❤️❤️❤️", "sierraroam": "thank you 💛", "sswassel": "YOU. DON’T EVEN KNOW. Well, actually you do. Keep making us all feel “normal.”", "ohheyitskari": "It took me 9 months to start the second/adjunct antidepressant I was prescribed last winter when I spiraled so far down I was ready to give up on life. But I started that slide again, and I new I couldn’t go back there. I too am grateful. I hate that I need them, but I accept that I do, and I sure am lucky they exist. #thankyouscience", "allthebeautifulthings17": "You is strong!", "karenguy2": "You got this", "jesseanneo": "Yesss! 🙌 At this point I’m like Lexapro forever if it does it’s job. That’s what it’s for!", "majorlis": "👏👏👏👏👏👏 Thanks for sharing and I’m so happy you reached out for help", "kimrcrooks": "Hell yeah, I’m glad you turned it into a moment of being grateful! Not everyone has a diagnosis and not everyone has the ability to get medication. And not everyone believes it will help (it will-it does!)! ❤️❤️❤️❤️❤️❤️ but yeah fuck that big red panic pill for sure 😂", "kimberly_": "You’re strong, brave and so generous with your transparency. ❤️", "dmb.317": "jen, please go to sleep tonight knowing you are a beacon of light for so many of us. “I” appreciate you, all of your struggles and all of your triumphs. all the love from orlando. 💓💓💓💓💓💓", "sarahmaipohlmann": "You’ve got this girl! Proud of you for doing what you need to get better.", "bestrongstory": "Thank you for sharing and thank you for taking your meds. We need your shiny light in this world.", "skimmerism": "The last time I realized I needed to get back on mine I felt completely defeated and disappointed in myself. After stabilizing I came to accept that this is something that is part of me and I may need to take medication for the rest of my days. And that’s ok. I think as long as I’m doing all the other things possible to help, my depression like sleep, excessive, talk therapy, etc. I’ll be okay.", "sarahhayofficial\nVerified": "Verified", "elinorwhite": "❤️🔴❤️", "katy_quinn": "YES ♥️", "joylugo": "❤️", "alexannalena": "Thank you for sharing your stories. You put the really tangly mental experiences into beautiful words. You are not regressing; you are growing right before our eyes!! I am SO thankful you added the big red pill to your daily handful. Getting what you need is PROGRESS!! 🖤", "ilootpaperie": "❤️", "healthisahappylife": "Have you heard Kelly Brogan speak? She has many wonderful YouTube interviews. I highly recommend. 💙", "hardstark\nVerified": "Verified", "ehowardly": "I needed this today, thank you 🙏🏻 ♥️", "palomsoms": "Babe you are awesome. You are perfect ✨, you are magic !", "adventuresandanxiety": "So brave. 💛", "womanista_": "🙏🏽Thank you 😊", "mollylomenzo": "@elainelomenzo 💕", "cassyymartinez": "Thank you for sharing this!!! What do you use for your adult acne? ❤️", "mindfullylaura": "Thank you Jen, I'm going through a similar process with medication right now. You are doing great. Thank you for sharing ♥️", "instantlychristi": "👏🏾👏🏾👏🏾 I was actually put on a third antidepressant/anti-anxiety this past year and was so down on myself that I went off one. Big mistake. (I’m back on 3) I finally had to accept that this is just what I need to feel like a human being and I’m OK with it.", "linds3yjo": "feeling all is this ❤️ thank you for sharing your vulnerability. also, thank God for medicine and kind, receptive doctors.", "sasha_tozzi": "Thank you for this 🙌🏼", "jkellogg917": "🤣", "kathywilley": "Thanks for sharing this. You are not alone in this problem.💖🙏🏻", "electricvitality": "You are a warm kind-hearted soul that deserves good health ❤️ this post made me laugh and feel compassion for everyone dealing with mental health challenges. Thank you for sharing", "_justfloat_": "♥️💪🏼", "maryeyke": "Make sure it is dye free! That red dude looks chemically coated like candy for kids. Which has actually destroyed my 16 year old son’s joie de vivre. WTF?! The artificial food colors are in sooo many foods, especially marketed to kiddos. Yes, his (yours, mine, everyone’s) meds have them in too. we have to specifically state dye free because Reds & Yellows affect his mood in a PROFOUND way. And insurance won’t cover. Only those with dyes. Hmmmm. Just hope you read this and try to get a dye (any color) free pill. I wish more people knew what these ratchet colors in the US foods do to the mental state, crazy stuff. Thank you for being a kick ass advocate for mental health. You rock. Keep that shit up. xoxo", "bronnib": "💜💜💜", "brienelermitte": "Go 👏🏻 you 👏🏻", "lotusland13": "I completely understand the frustration with having to take something for depression. But ur outlook is awesome on it. I am so grateful we have such options to help today. I couldn’t imagine going through it during the pioneer days for example. You got this! ♥️", "jennithegreat1": "❤️❤️❤️", "aliofthedollsnyc": "❤️❤️❤️", "jkburgin1": "Lots of love ❣️", "theaffablebear": "You are strong and wonderful and I love reading your posts. Also, there have been multiple occasions where I'm looking at my pastel blue and yellow anti-anxiety medication and I think about how much I appreciate the color choice, and how calming they look.", "rainiebraziljewelry": "@jengotch You help me through some hard days. Thank you!", "lindathometz": "Thank you for sharing your struggles 💗 it helps more than you know.", "georgiesbones": "I live off of Ashwagandha Root, St. John’s wort and Fish Oil for Mood. It’s worth a try. ✨✌🏼", "christiel70": "Hunny, I’ll take a picture of my handful in the morning. You’re progressing and I hope you continue this wellness path. I had to switch up my anti-d and mood stabilizers. I’m feeling so much better. I wake up at four and I’ll take the trade off. ❤️", "lakejoey": "Amen", "soniasapinho": "🤜🤛", "laurencalvertt": "❤️", "harrietinthehouse": "🙌🏼🙌🏼🙌🏼 Well done you. A brave and strong lady xxx", "betyamama": "I don’t know why or how are started following you - but I feel like I met my new BFF - I suffer too- DM me lol#going to Desert with the fam on Sat - I’m not crazy -follow me @Betyamama on insta we have friends in common- or not - I still love you # B", "jodyb2": "Thanks for your unapologetic honesty.", "anntastic23": "Thank you for sharing your journey. Meds feel so trapping - one one hand they allow me to be functional, and I see so many friends that could benefit from them - at least for a little bit - refuse them. And then on the other hand, I hate that I have to take the meds to be functional. It's a giant circle. I wish us all some peace.", "chantalmooreskintherapy": "💗", "kiralynnsorg": "🙏🏻", "carlybellexo": "@etherealflow5 you gotta follow Jen!", "aliloney": "❤️", "airbear.dontcare": "My anti depressants are BIG and BRIGHT pink. I hated pink... Now it’s my favourite colour💕 Keep moving forward 👏", "justinablakeney\nVerified": "Verified", "mrsamytrevaskus": "❤️❤️💕💕💕", "elliesteen": "I had this exact moment happen to me last month! I was shocked by the giant red pill too but now call it my clown nose pill 😂🤡", "mamadeebs": "I take 4 pills a day to defeat my PTSD, depression, and anxiety. I will gladly take them for life because they give me a life worth living. You're a badass. Keep fighting.", "gwendittmar": "❤️❤️❤️", "gloriia.rs": "❤️", "perlin65": "I felt like a failure when my therapist suggested medication and even swore for a month it wasnt working. Finally I stopped fighting it and realized it had been working and now I tell everyone I am on it to help destigmatize using medications. It's not a failure!", "deluxemodern": "Well what the heck is it called!? ♥️", "rudysmom33": "You are a brave girl. Sending you a hug ❤️", "jalstern": "You are an inspiration and a pioneer into openness & awareness around depression & mental illness ❤️❤️❤️", "hlcclh5": "This ya one time I can so I totally get it, I had to go there a feed years ago! But taking care of yourself, you happiness and well being are important!", "arudd1212": "Thank you @jengotch for normalizing mental well-being", "pausewellaging": "Thank you for sharing this and best wishes to you 💙", "bob_and_fleur": "🧡🧡🧡🧡", "angelahurtmusic": "Thank you for sharing this. Nobody likes taking meds, but modern medicine saves lives. My antidepressant has certainly saved mine. It took several months to find the right medication and then the right dosage... and that part of it sucked. But once it was right, the change was amazing. Proud of you. It’s not our fault that our bodies don’t work properly for this; no different than type 1 diabetes. Try & remember that. Depression is not a choice that anyone would choose. ❤️", "sitesjill": "❤️💪🏻", "courtneydewet": "🙌🏻", "d_rhinehar2d2": "My daily handfuls looks similar. I know that daunting, “Why am I like this?” feeling. Focusing on the gratitude is literally the ONLY way I can get the elephant foot off my chest some days. Thankfully, since getting the cocktail right, there are far fewer elephant on my chest days than before. 💖", "stoopkidd31": "WOW! Thank you so much for sharing this @jengotch 💯🙏🏼", "radartap": "I'm glad you realize you should be grateful! Knowing I could benefit from therapy and/or medication for my anxiety and PTSD but not being able to afford it is the worst.", "natasha.dunford": "❤️❤️❤️", "redcouchlife": "💕💕💕", "carol_hache": "💗💗💗💗💗 🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼", "imperfectlysoph": "This comes at a particularly apt time. After I thought I’d accepted that I would be on meds for the rest of my life, I went off them on kind of a whim for the first time in 18 years this spring. Am just now feeling the repercussions of them being out of my system and realizing I need to go back on them or risk bad things getting worse. Thank you for sharing your apprehension and your reframing - few people I know truly understand the struggle. ❤️", "pikemj": "@eileen_sexton omg it totally looks like a panic button 🤦‍♀️ who does that?? And how is that meant to be swallowed?? 🧡", "seebettyrun": "🙌🤗", "printpatternrepeat": "Just start slowly, just 1/4 to start, build up over a few days. Give yourself a break, take care ❤️", "susan_desperately_seeking": "♥️♥️♥️", "manderz087": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "abonetati": "❤️", "aliwantisdonuts": "Confetti is always better when the colors are brighter 💕 you’ve got this!", "teaplants": "Figuring out how to properly take care of yourself is a major accomplishment in itself! We are complicated creatures! Also since I turned 40 I have had some digestive issue and was in so much pain at the pharmacist waiting for my prescription! I felt like my own hero for enduring that to get some relief. Lots of love to you❤️", "bari_jessica": "Thanks for posting captions like this and normalizing all of this 🙏🏻", "teatoastandturmoil": "💕💕💕💕💕", "findingvintage": "Wonderful attitude you’ve arrived at. I believe it is the absolute truth. I too am grateful for finding the right medication and dosage that has enabled my mind and spirit to function without the heavy blanket of dread and hopelessness. These meds free us rather than mask our emotions. It took me a long time to see it that way. Also I think you’re amazing! 😊", "annelise2055": "You’re amazing! Thanks for sharing your honesty and honesty in mental health. ❤️", "izycompuesta": "you're so inspirational, I love reading your posts about mental health because I always relate so hard. 💗", "jojomess": "❤️❤️", "dareaton": "Inspiring", "millerbarb56": "🧡", "sfgirlbybay\nVerified": "Verified", "love.and.m.oceans": "I love you @jengotch 💛", "franca_02": "❤️", "nicoletttte": "Such great perspective. Thank you for this, this truly helped me today. 🤍", "jayretrospect": "Strong, always ❤️🔥", "nicolee_farrell": "mmm. This is good stuff. thank you for your honesty.", "lenafairfield": "💕", "ondeluca": "I like that it’s round, looks like a really baller skittle. 🍄🌹🌺☄️🍎🍉🍒🍅🌶🥩🍕🥫🍷🥊", "deemckinley24": "🙌", "dontmindthegap": "💗💗💗", "kimiglenn": "Self care...the sign of a healthy woman🙏🏻💖", "presteddonna": "❤️❤️", "taylor.loren": "Thank you so much for sharing your stories the other day. I too have been struggling with whether or not to go on anti-depressants and your stories, this post, and the timeline you shared have been so encouraging to me. Thank you xx", "jenniferpatterson.lmft": "Thank you for being so open. 💖", "stavhatchett": "You got this. I thought it looked like a Jaffa, so thats a win for me!", "sarahmadepdx": "❤️", "sabbotage": "This is important. The feeling of “beating” depression is just that— it is a feeling. If you’re lucky it could last a few weeks , months or even years. But that is the problem about depression... it finds you again. And that is not a sign of weakness... it just is the truth of it all. I empathize completely.", "erinluvv": "I love this so so so much. I typically find that shortly after I declare myself healed, I end up needing support and being disappointed in myself. But there’s no need to be, and I’m grateful that you shared this with us.", "rachelkhona": "My dad is bipolar and is still in denial. Thank you for being so and honest and helping to destigmatize mental health issues. ❤️❤️❤️", "ellen_arthur": "Oh man I feel you. I recently tried coming off my meds which ended pretty terribly after terrible withdrawal side effects and I ended up right back on them. I felt totally defeated like I had failed and then I had to turn it around just like you did and have gratitude that I have access to modern medicine and the money to afford it. It's all in the way you look at it! ❤️❤️❤️", "sueshep": "Thank you for being a shining light for other sufferers x❤️", "joanwlabelle": "Red wins over “blue”. ❤️", "ana_elaine_444": "❤️❤️❤️", "megobailey": "🤟🏻💖", "gdoodle6": "💗💗💗💗💗💗", "kweyg": "Thank you for sharing. 👏🏻", "li.unger": "Thank you! Good for you!", "suezinohio": "My son is battling addiction and also has underlying depression. I wish he could find the right meds. Good luck. I will keep you in my prayers.", "samantha_meis": "I can soooo relate. Every month I cough up $200 at the pharmacy I feel a little pang if loss, but it’s pretty immediately followed by gratitude. I’d actually pay a hell of a lot more than $200 for a monthly dose of sanity... well sorta sanity. I haven’t had a perfect month for over six years, but I’m certainly less looney tunes now than I’ve been in the past. I’m INCREDIBLY INSPIRED by your openness about mental health. I’ve found when I’m open about it, it frees others to share, sometimes struggles they’ve never voiced before. You’re bringing that gift to millions. The funny thing is, when you’re this depressed it’s pretty much impossible to find hope, meanwhile, you’re spreading hope to all corners of the earth by sharing your story. Sending you all the hugs. If you haven’t already, search ‘cute puppy compilation’ on YouTube. It usually makes me feel a little something when nothing else will. 🤗🤗🤗🤗🤗", "hmnphotographer": "Feeling this. I worked for the better part of last year to taper off of my SSRI and now I feel like I need it again, which really sucks. Have you followed all the news about magic mushrooms/psilocybin for depression? Super interesting.", "lauradawnrobbins": "What do you take for your adult acne? Struggling as well which is leading to low self esteem.", "odettewilliams\nVerified": "Verified", "maf91": "Thank you for sharing! You got this ♥️♥️", "lauren_ve": "❤️", "omghoneybooboochild": "@rmcbee88 Walgreens here we come! 🖐🏼", "bettygroup": "Thanks for your honesty! I feel that way about my meds - frustratedI have to be on them and then grateful they are available to me. I “feel” like I can go off of them and then remind myself the meds are why I feel like I can go off. Then I also remind myself it’s in my genes and my mother hasn’t left her house for 6 years and I don’t want to get there. We can all be better by talking about our mental health and knowing we are not alone. Congrats to you for jumping back in. Now also thinking I might need to start taking vitamins!", "chnadal": "❤️", "pamvivier": "Much love from another depressed lady!", "kimberlyjmuller": "💖", "auntiekaren3": "looks like a coated sweet tart! ♥️♥️♥️", "juliessister": "💜", "sauts": "🙌🏼🙌🏼🙌🏼 End that medication stigma girl! ❤️", "deenalas": "Thank you for sharing this honest reaction to prescribed meds. ❤️ Recovery is hard. But always worth it. ❤️", "sobremesa.zam": "♥️", "emilyyvian": "Thank you for being you. Sending you love and comfort 💗💗💗", "zygote_brown": "Please, please, please!!!!!!!!! Read #lostconnections!!!!! Please! Everyone should!", "auntsheila412": "#rockstsr", "ashleygoldenrule": "👏🏻😍 Thank you for sharing! My newest addition is little and blue but I totally had the same reaction btw ❤️", "sally_snacks": "The gift of desperation is not to be minimized. You are on the road to wellness and you are loved. 🧡", "sssswingo": "I love how open and honest you are. From one sufferer to another I understand you and I applaud you. You got this!!", "onastaziadesigns": "❤️❤️❤️", "fajardoface": "❤️❤️❤️", "nicoletigerlily": "Thank you SO MUCH for being so open about what most people keep secret 💖 You are so brave and such an incredible woman!!!! 💜", "lara_farrell_vallejo": "❤️", "ecjewellery": "You’re rad.", "replikate34": "We are all so lucky to have you sharing your stories with us.", "mandy": "I love you ❤️ I’m proud of you ❤️", "juliagartland": "THANK YOU 👏✨ 💊 !! Hope you start to feel better soon 💕", "sidneycargill": "You are such and inspiration for mental health awareness. Thank you so much 😊", "berd.nerd": "I always look forward to your updates and watching you travel through your diagnoses. You’re not alone! ❤️", "licalou11": "Love this post. Can absolutely relate thank you for sharing", "gidnas": "Thanks for sharing your journey & hard earned wisdom. Ya! Wisdom. It helped me today. So there’s that. 😉✨❤️", "daily_gem": "Such a strong message 💎", "myfavcolour_": "You’re wonderful and brave and authentic and talented and fun and powerful. Your honesty and vulnerability bring comfort to many 💖🌈 Hope you just feel better and better ☀️ Best wishes from South Africa xxx", "mythreesons": "💛", "manda_irl": "💗", "buttittachelly": "@bpad22 so much yessss", "nicolemrf": "your posts like this have changed my life 💗 thanks for being vulnerable online — it really does help people.", "jacquevanfleet": "@khiman16", "hppuffnstuff": "👏👏👏 you're a mental health inspiration 👏👏👏", "taylorprinsenphotography": "So true.", "resilientlisa": "Thank you for sharing Jen! Your post is inspiring. Really, who makes big red pills?!!", "caitlinlairdd": "💕💕💕", "doeshedoe": "Better living through chemistry 💛💛💛", "stefanibillings": "Your story is such a mirror of my own. Thank you for being so vulnerable & an advocate for all of us 💕", "vhevans": "💟", "punkydavis": "This is awesome!! Medication is not a failure and it’s awesome that you could see you were taking care of yourself!!", "girlshouts": "Love you Jen!", "binzor": "❤️❤️", "theselect7": "There’s no greater strength than knowing when you need help and asking for it. You’re a ⭐️", "jmeackerman": "❤️❤️❤️❤️❤️", "byitsowndesign": "💜", "the_silentpartner": "Brave gal. 🙏🏽🙏🏽🙏🏽", "pilemaker": "@niles.dusty", "southovgram": "Big self love hug to you. We are with you🌸💗", "brittalarsenpkr": "I came to the same conclusion, in the last hour, that I need to get back on meds. Reading this post makes me feel less alone. Thank you for your continued honesty. It helps.", "sofia.henrika": "Thank you for sharing your story. It has helped me a lot, and you inspire me to dare to be open and vulnerable about taking medication for my mental health ❤️", "somekindofhappiness": "❤️", "carrie_ford": "You’re amazing 💕💕💕", "mother_wood": "❤️", "lobarrile": "♥️", "_bloomchickabloom_": "Through your posts, you help so many others feel a little stronger. Thank you. I’m still searching for that dr that will prescribe the right meds. But until then, I fight with demons. ❤️", "dididerosa": "Great post. I Appreciate your honesty.", "stephblack.3": "You are fabulous, brave and strong and someone following you is going to survive because you have shared your experience ✨", "jessicagranberg": "Onya lady 👊🏻❤️", "youngerpa": "💗", "eachsettledthing": "❤️❤️❤️", "hannahlee_v": "Ugh we all love you. I tried to be vulnerable on my insta by posting a story of me crying about my dad (he died last year) - it wasn't received well so I deleted it. Lol Thank you for being brave for us. Your vulnerability makes me and my best friend try to be more vulnerable. Thanks to you we went on anxiety, depression, and mood stabilizer medication and it's changed our lives. You are impacting people more than you know with your honesty, hope and humor. We love you JENGOTCH! ♥️ @rlibby3", "laceybuggers": "@varynshelda you should follow her 🧡", "mckenziewalden": "❤️❤️", "curt.hs": "Beautiful. Stay soft ❤️❤️❤️", "itsmeitsjennifer": "Thank you for sharing. Needed this!", "ttarynsmith": "You badass you 🔥🔥🔥", "pourlair_scents": "You are inspiring. Love your honesty.", "fabric35": "✨Thank you", "lynnie.marrie": "♥️Thank you for sharing and being so transparent. Real is real. Your incredible courage is helping so many see that it ok to have these feelings or there lack of (numb). It’s actually normal for so many people. You are a bright light jen. You have purpose and send hope and positive energy. You fking rock! ♥️Luv u so much! Can’t wait for your book!", "spacer1974": "@jengotch I would assume they did the genetic testing through your psychiatrist to see what med would need best for your body ? It’s shocking how many Drs do not do this first before putting someone on meds - also- it would mean the difference between what is effective and ineffective", "andrea.annette": "😘😘😘", "the_brothersblume": "@marieelane 💕", "ehfloral": "❤", "jeslynn_85": "I love you @jengotch, you’re so inspiring and the most supportive person on the internet. Depression is real", "elizabethrolf": "💓💓💓💓💓 @ally.macewen", "theodorable": "Sometimes it can be so hard to get yourself to the pharmacy when you need to the most so good for you and thank you for sharing posts like these to fight the stigma.", "_wildandlovely": "💝setbacks are normal & necessary for our management of depression & or anxiety. You are doing self care & I'm so proud of you. Thank you for being vulnerable & open with your story, you are helping so many others including me. Many blessings to you.", "kristenhutchinsdesign": "I’ll always stick with you, Jenni. ❤️", "amyozwilkinsta": "We deserve to be happy, not have depression & anxiety. If taking a pill helps your brain, gives it a little boost, it’s ok. So many of us are with you.", "kirstyjkemp": "Love ya 💓🙏🏻", "lesliepix": "♥️♥️♥️", "langeta": "♥️♥️♥️♥️", "justagirl": "❤️❤️❤️🙏🏼", "octoberhello": "♥️♥️♥️", "tracyghoward": "Maybe that big red pill has a lot of ooo la la in it.♥️♥️♥️ As always love your transparency.😍😍😍", "genevrafletcher": "❤️", "dr.christina_": "I see you 💚", "iamsteph_xx": "❤️🌺🙏", "alicebarry": "@jengotch ❤️❤️❤️You’re simply awesome and make me feel more comfortable about talking about my own mental health", "sakb13": "❤️❤️", "withdrawalsfilm": "💕", "jmebuffington": "🤣 The panic pill! Hang in there @jengotch. You got this.", "missannalisa": "❤️❤️❤️", "karlitapamanes": "💕", "dcnly": "The panic button thing is v v fkng funny 💖", "lizlizlestrange": "👏👏👏", "lacesinyourfaces": "One of the best humans. I talk to my 9 year old daughter who battles with anxiety and sometimes depression about your journey. We have the “Jen Gotch wants you to feel better” card that accompanied my depression necklace pinned up on our bathroom mirror. So inspiring to see you experience both success and struggle with such bravery and grace. Thank you for your transparency, your candor and sense of humor about it all. PS-can’t wait for your book! PPS-miss the podcast!", "ange_who33": "I myself am Bipolar and my meds have made me better. I take both an ant-depressant and mood stabilizer. If I skip a day I’m almost immediately back to the person I don’t want to be. While some prefer not to be on medicine, my life depends on my little pills. Here’s hoping your mood gets better. You got it Gotch. 🙌🏽", "shellyboo28": "I take 8 pills a day for my bipolar depression and anxiety. It’s made me gain about 60 lbs, one gives me migraines, hot flashes (like walking out in a T-shirt in 30 degree weather), raises my blood pressure and pulse... just to make a few... but I take them bc of people like you who are brave enough to share your life with us and how I can share in good days... that motivates me to know I just have to keep going... funny you post this today bc I literally just got home from Xmas shopping where I was triggered by an object and went into full blown panic attack... I got thru it and was able to drive home but I survived it as scaring it the images in my head were I survived it... now I’m in my safe space and you just reminded me of that hope that better days will come along with the bad... thank you 💕", "msamandagreene": "Sharing is caring. #ThankYou", "tea.rose.art": "I really feel for you @jengotch taking pills is so unreal and scary. Though once you get the right medications you’ll wish you’d done it sooner. Being in a foggy depressed state is no fun and you slip in to it so slowly, that you kinda don’t realise. That is until your mask slips. I’ve been there many times. I sincerely hope the medications help, it may take some time to get it at a correct level but once you do get it right, it’s amazing 😉❤️🥰❤️💥🕊", "cupofjones": "❤️❤️❤️", "kgross": "❤️❤️❤️❤️", "iamrosesdaughter": "Sounds like my concoction!", "katwalkef501": "Oh my love...you aren’t regressing, you are evolving. You are growing and you may not feel it but you shine so brightly and your honesty helps all of us to be truthful with ourselves. Love you so much.", "lyndsiterese": "What’s the adult acne medication? I need it", "mirbrown75": "The power of gratitude! 🙏🏼❤️", "bossmarecraft": "Yay for you ❤️", "rainbow_in_the_attic": "💚💚💚", "arnp253": "Maybe it will be like a small internal \"Easy Button\", making the feels easier. ❤️", "jillianmorkan": "Hugs to you Jen, there's nothing wrong with needing help and anti-depressants. A lot of people wouldn't be here without them!", "paulabmichaels": "You are true. ❤️", "torynicole": "Thank you for sharing this. It really resonated with me and I’m sure so many other people! ♥️", "tishparmenterwellness": "❤️", "stripmallsushi": "Thank you Jen for all that you do, quite literally. You have been a source of understanding through which I have been able to better understand my wife’s emotional states and unwittingly have become a quasi-therapist for both of us. Your mental health advocacy is invaluable! Thank you for being loud, unapologetic, thoughtful and entertaining, and for being that loud person I kept hearing in the background as she scrolled through your stories.", "mattigresham": "This resonates so deep with me on all the levels. You’re doing the right thing and it’s always upward and onward ❤️", "maliengen": "❤️", "br00ke76": "Thank you for sharing. The more that brave and honest people like you talk about this, the greater the mental health stigma is reduced. And that is so so needed in our culture. May you continue to feel relief. ❤️❤️❤️", "ljdeshazo": "Just getting that pill is a huge step! You’re doing great!", "shel.b": "Thanks so much for sharing this.", "meredithstorywilliams": "❤️❤️❤️❤️❤️ and slow clap stand each time you choose to take them.", "beyourself6904": "Thank you so much for sharing your highs and your lows. As the parents of children who suffer with anxiety and depression, seeing an adult face and deal with their issues with grace gives me immense hope for my kids. You’re the best. Sending love and light❤️", "missjessepics": "Thank you for being you ❤️✨❤️✨", "olivtrees": "♥️♥️Keep doing the work & shining the light on the hard stuff 🌟 There is a way through this & navigating openly / together makes it less scary.", "kristenlawrencee": "Thanks for this Jen, you’re a strong ass lady", "katpfisher": "@jengotch i’d be honored if you could read my sister’s essay, “#VanLife: Facing Off With Depression & Discovering Freedom On The Road” at bestselfmedia.com/van-life/ I think you will be glad you did. I am so proud of her, and you, for sharing your struggles and triumphs. @betterdaysroadtrip @bestselfmedia", "daphnemscott": "Love this, thank you for posting🖤", "mbblopez": "❤️", "shopb.ca": "❤️❤️❤️", "ellie_vision": "💚💚✨", "saramoon": "❤️💛💛", "emilyandlemons": "“giant panic button” hahaha this shit is so cray and I am cheering you on! Thank you for sharing your story - truly helps my healing!", "megankoch": "❤️", "ericafreed": "Your bravery is inspiring 💙", "emmakatehals": "this is so similar to what i went through. proud of you, strong woman. this shit ain’t easy.", "kate.bharati.thuss": "❤️❤️❤️❤️❤️", "aliweissjewelry": "I feel you-the struggle is real Good luck, you got this", "marilyndays": "❤️", "rhian_hy": "Grateful for you 🖤🙌🏼", "aly_mudlaff_salamone": "You are an inspiration. Thank you for helping me to understand how so many people I love feel on a daily basis.", "socketwench": "Oh, the blessed curse of self awareness. 💖", "bri.c.photography": "Think of it as a chewy spree? Those are yummy. Or, and immediately I thought this when I saw it, it’s bright and fits your style 🤷‍♀️", "dlkancher": "❤️❤️❤️❤️❤️", "loulaw": "This post is what so many people need to read 👏🏼♥️ well done for taking this difficult decision. Would you ever think twice about taking those vitamins?! Get it 👏🏼", "constancezimmer\nVerified": "Verified", "suzysatire": "Just did this for my 12 year old son today. We’ve been putting it off but now is the time and there is no shame in our game !! This post hit home and just what I needed today !", "flowerparts": "Thank you. So many need to see this. I am so grateful for these medications, I don’t think my husband would be here with me if they didn’t exist, and I’m so grateful he is here in this life with me and our kids 💙", "charitymadrid": "@meghues", "msjm0ney": "@jengotch you’re an inspiration for all of us... Thank you for always sharing your bravery, honesty and that the possibilities are endless even for those who sometime struggle. ❤️", "astoldbyamandaa": "Constantly an inspiration. So grateful for you ! 💕", "intuitivealchemy.co": "Thanks for your transparency with all of your journey. I just scheduled an appointment for getting back on mood stabilizers after many years off and I have been wrestling the choice. Its good to know I'm not alone and that we can make empowered choices and take back control over something that can feel so fucking out of our control. 🙏", "agirlcalleddee": "Amazingly reassuring and brave 🙌", "suzyroyle": "Yes to all of this. I’ve been there. Progress isn’t linear (I ask myself “why the fuck not?” OFTEN.) I’m also impressed you were able to do as much as you did in this state. That right there is huge progress. 👊🏻", "bravenewsoles": "I am going through something really similar, and I really appreciate your perspective on this. Thank you.", "mybilliedesigns": "YOU ARE SO WONDERFUL JEN 💛", "theyarnpitt": "💛💛💛", "elisajmoss": "❤❤❤❤❤❤❤", "jana_fabulous": "Beast mode 🔥🔥 sending love ❤️", "sidney.ella": "💓", "meghansmolka": "Love you Jen! And yes why are the 💊 so hard to take 😂😘", "breanna_elise": "❤️❤️❤️", "wild_and_dree": "❤️", "maggiemason": "Yes! The path to even finding help and medication that works is a whole fucking hero’s quest. You are getting it done, as ever.", "cdmass": "Thanks for sharing. My wife, @purely_nora, sent this to me. As a bipolar-I male who has gone through 16 years of guess and check, I can 100% relate. It’s scary. Will it work? How long will it work for before I inevitably build a tolerance to the medication? Scary shit. Im happily medicated now, and have been on a new regime for 7 months (I’ve lost count what attempt this was - over a dozen). And guess what? I feel the best I have EVER felt. No manic episodes, no debilitating depression. Finally able to live life like a “normal” human being, addiction free going on 3 years, be present with friends and family, and have a newfound sense of humility. Wouldn’t trade my path to where I am today for anything. 👏🏻🥂❤️💯", "dropcapdesign": "❤️❤️❤️❤️", "barrettmommy": "If your adult acne med is anything like Accutane, know that those drugs can have a huge impact on mental illness. I’ve known several fellow ladies (myself included) who used it & had exponentially increased anxiety/depression symptoms while using it. On a level I hadn’t experienced before being on it & I’ve been diagnosed & managing my mental health since my teens. Just wanted to share!", "welwythn": "This is beautiful. Thank you for your honesty.", "traciamodio": "❤️💗🙌🏼", "kauffmanfarah": "It’s awesome that you’re putting yourself first, whatever that looks like, including taking medicine. I take medicine every day to keep depression and anxiety to a minimum. My sister has type 1 diabetes and takes insulin everyday to stay alive. Depression and anxiety are illnesses of the body just like diabetes. Taking medicine for depression and anxiety when you need it is the same as my sister taking insulin. We all do what we need to do, in order to survive and to thrive. You are awesome. Know that.", "sandrapanda123": "❤️❤️❤️❤️💙💙💙💙💙", "jessmcdougall": "❤️❤️", "homerfridafrank": "Thank YOU @jengotch I know you know that you’re making a difference and helping others, I just wanted to remind you. 💚", "katajone": "I find it pretty!", "may_we_bloom": "❤️", "ohanniebeth": "Jen. You’re the best.", "cogworthys": "💕💕💕💕", "tiffykatmeow": "❤️👏❤️👏ROUND OF APPLAUSE TO YOU BEAUTIFUL LADY!!! ❤️👏❤️👏", "jordanrudd": "❤️❤️❤️", "anniihirst": "The panic button! I mean?!! I’m proud of you 🤗", "adventuresofaliza": "Thank you for sharing, I just started back on medication and have been having very similar thoughts so it’s really nice to know someone I look up to also feels those same pains even when we know that it’s what’s best for us. Keep your head up! You got this♥️", "g00drun": "🧡", "prettycrabby": "♥️♥️♥️♥️", "leslievancegagnon_": "Went back on my ole friend Lexapro last week. It has been a year break but my mind was screaming for help. We have to do what we have to do!! Thank you for always being real!!!", "rhonda_35": "Love your determination to champion and shine a light on mental health - you’re approach is badass and I love you for it! 💕😊💪", "elissiarose": "There are shades of pink in that red pill, and pink is a very healing colour indeed 💕❤️💕", "jordansooter": "You are amazing! Thank you for sharing!", "jacquelinecampbell": "💛💛🙌🏼", "_oxford_comma_": "You are incredible. Thank you for sharing. ♥️", "lastdiscointown": "This is SO important to hear. Thanks for sharing it ❤️❤️❤️", "wunderkammersupply": "Omg. Jen. I could could cry tears of hopefulness, compassion and gratefulness that you are willing to share this part of your journey.", "des.haigh": "Good for you! I made a little ritual out of taking my meds, giving thanks that it’s elements were working with mine.", "erikaherod": "Needed this post today. Just started an anti-anxiety medication for the first time after a decade of nothing due to a horrible experience with another med. Thank you for inspiring and lifting all of us up ❤️", "planet_lex": "Wow thanks for sharing this. I got upset when I had to add on a new medication on top of my Lamictal. For some reason it feels like failure. But seeing you brave the change really helps. Thanks for normalizing this.", "saramarietexas": "Someone once told me, upon being given my first anti-depressant, “it’s temporary. It doesn’t define you, and if it makes you feel better and does no harm, then don’t worry about it.” It was definitely something that I had to reword my brain to realize/believe, but in the long run I’m so thankful for modern medicine and doctors that listen and believe in me. You are a strong and brilliant woman. You have a beautiful brain and heart and are being a spokesperson for so many people who are still terrified to speak to their struggle, so thank you for speaking your truth and bringing light to the darkness of depression. 💕", "roooooobyn": "You’re just my favourite!", "jnweaver75": "My generalized anxiety, panic attacks, and OCD have a really really really flared so badly here recently. Along with PTSD. I’ve had so much go on the past several years and I had it somewhat under control but now it is crazy. I have been in therapy for Jay’s maybe a year and a half finally with someone who helps me. She’s amazing. Today she told me she would be out of town for three weeks. This is a tough time in my life as my brother passed away three years ago and also his birthday is on Christmas Eve. I take care of both of my parents. I’m also a single mother. On top of that I have crazy heart clips that drive me nuts and of course all the lovely things that come along with anxiety and stress. I work so hard. I meditate I pray I exercise eat well but sometimes it still tries to get the best of me. Sometimes I just have to give it to God and just get in the car and go and do. Sometimes though I feel like I want to lie Down in the floor and curl up in a ball and someone read my hair and tell me it will be OK. Kudos to you for taking care of yourself and putting yourself out there and being Rall for all of us. I hope you have a merry Christmas I hope you feel much better on your medication and I am rooting for you and behind you all the way! We are not alone. 💋🙏🏻💞🙌🏻💜", "theholistichoneyyy": "❤️❤️❤️", "hilaryrushford\nVerified": "Verified", "e.lizabethkirkpatrick": "👏🏻👏🏻👏🏻 But seriously why the fuck did they make the pill so scary looking?!?", "olivia_frisbie": "Its weird people have this whole trip up about psychiatric medicines, but if you need medicine for any other part of your body for a chronic condition, no big. No ones telling a diabetic they should have issues with insulin. Its not a thinking or feeling problem, its not a symptom of some kind of moral weakness. It is a biological thing, and some people need medicine, the end.", "kalibutterfly": "YES! 💓💓💓", "kristenmalak": "❤️", "kaileythompson": "🧡", "heidilofquist": "Your honesty and vulnerability helps more people than you know. Hugs and love to you ♥️♥️♥️♥️", "jojojesio12": "Yaaaas!!!", "missykblack": "All the red hearts to you... ❤️❤️❤️❤️❤️❤️❤️❤️ And I can relate to the adult acne. WHY????? *shakes fist at the sky.", "adriennecarey": "Do you also take vitamin D? It really helps me ... I take Zoloft But I notice a huge difference with the addition of D3 -sorry if this is a dumb question. But knowing how much it helps me I wanted to ask 💗💗💗stay strong ❤️❤️❤️", "annachubbybanana": "I’m on so many psych meds haha, I’m so grateful for them! Hilarious design for an anti depressant though, I agree! 💖", "bcrumpette": "Thank you for sharing! I have always felt inadequate for needing the medicinal help-wondering why therapy, meditation, etc wasn’t enough. Sometimes you just need it for a while and that’s ok. You are doing great Jen!", "jette.scherzer": "♥️♥️♥️", "jewellofsd": "❤️❤️❤️❤️❤️❤️❤️", "strollingthecityinheels": "You are amazing. Iast year, I went back on a med that I had been off for years and I felt exactly the same. I am so grateful every day that these pills exist and that I can choose to take them.", "sarahfogz": "😂 💕 Your honesty is so refreshing ❤️", "tomasomally65": "Keep at at!!❤️✌🏻🎈", "smithski23": "Solid gold right ther!", "ricrenae": "❤️", "lisakwhite": "❤️🙌🏼❤️🙌🏼❤️🙌🏼❤️", "meganlaportebryant": "Seriously, you are amazing for sharing your experience. This is normal and I hope more people can have similar experiences when they go through this! 💊💊", "vamp_furniture": "❤️", "sprucetoninn": "❤️", "krleonard3": "That you for posting this!", "verogaroo": "❤️", "carlitaonmaui": "Read a mind of her own by brogan ..... then go watch as much here on IG by @drjoedispenza that you can", "missponyweather": "I’m traveling for work & was bored on my flight so I flipped through Southwest magazine (something I never do) & happened across your Spirited Women interview! What are the odds that the one time I read it I see a familiar, interesting face? Thank you for this post & for doing what you do. You are a real voice out there. 💜", "maddymagee_": "Funny that amongst all the dull tan and beige coloured pills the red one made me smile! There are pros too! Here’s to you having more pros!!! 🍎🥊🚗🎈❤️", "shutterbean": "I am grateful for your advocacy, your light & spirit. Thank you for working hard for your SELF. I am rooting for you!!!! 👏🏼✨💫🕯🙌", "aprettycoolgirl": "❤️❤️❤️", "kathleeninkck": "Love and strength! You did good :).", "allisonblakleystoker": "#myfavoritemeds thank you for sharing your story. 💕", "devonbrea": "Proud of you.", "meredithheron": "Best #Selfcare post of 2019.", "joiebutter": "That’s amazing! I’m so glad you keep sharing. 💗", "thejoyfuljewelrybox": "You are kicking ass even when it doesn’t feel like it and this post is proof of that. Keep going. 🙌🏼💛💛💛🙌🏼", "jennikonner\nVerified": "Verified", "daisyleyland": "You're honesty and insight is invaluable to me. Thank you soo much for sharing. You wonderful, wonderful human! 💪💛 x", "louisekadeillustration": "♥️", "acuriousdelight": "I know well the apprehension or taking a new drug that affects the psyche. I admire your honesty so much. You truly inspire me. Sending love, hugs, and support 🙏❤️", "stephaniealemieux": "Love this love you can’t wait to read your book", "thejonesmarket": "I cannot believe they made it huge and red. Sending love. ❤️❤️❤️❤️", "mlhart71": "Thank you for sharing! Both brave and vulnerable.", "melpiz": "U got this👊🏻", "shelley_conchita": "💛💛💛", "claire_kramer_mackinnon": "Sending ❤️and strength. Take the 💊! It’s okay babe.", "sparkleplenty_": "Thank you Jen, when you talk about this stuff it really inspires me to never give up.", "jen_johns": "thanks for your advocacy for taking medications as prescribed!", "lora_carmel": "💕", "amandajanejones\nVerified": "Verified", "adrixey": "❤️❤️❤️", "begmurke": "Love you. Thank you ❤️", "buzzy_jackson": "❤️💯❤️", "samantha_rei": "💕💕💕 Sending hugs!!", "missssayy": "❤️"}