{"shopmiroja": "💪🏻❤️💪🏻", "j.frvnco": "🙏", "backstageboo": "❤❤❤", "jessiejune14": "Thank you for being a relentless advocate. It helps & is incredibly inspiring. 💕", "damagedgreats": "@nikbella 👊🏻💕", "monicalisag": "Just listened to your interview with @sophiaamoruso on @girlboss radio. What a great one. Thank you guys! Props from Miami ☀️☀️☀️", "devirawal": "Love it", "kryskelley": "❤️❤️❤️", "everwinn": "👊🏽", "jayme_riessen": "💪🏻💪🏻💪🏻💗💗💗✨✨✨", "corpenyc": "@cbeeeeezzy", "nicolecostello_": "AMEN 🤩 I love you, and your honesty. The type of person who calls depression laziness is the same person that would vote for Trump.", "cdcwood": "You're incredible ❤️hugs and love to you 😘", "the_nicoliest_of_nicoles": "You are such a light and relief to me! I JUST shared a post about my recent bipolar diagnosis and decided to share publicly and my friend shared your last post to give me confirmation that I am not alone. And THIS is such an accurate depiction of what it feels like and can look like. Even I didn’t know whyyyyy I had become this blob, unable to function at a level I was certain I was capable of 🤷🏻‍♀️", "lipglossandbrassknuckles": "Thank you @jengotch for stating what many of us ‘lazy’ individuals experience.", "the.creativehustle": "So important 👌", "marsmichele": "So good!!!", "pinkparterre": "I’m “lazy” too", "carlacoug": "This so made me cry. I still have people that think I'm lazy or think my mom is lazy and as you know it can be one of the worst feelings in the world to have your \"loved ones\" not understand. Then it hurts even more when they don't even try to understand. Having someone project a stereotype on you that isn't true is so belittling. For whatever reason I really needed to read this right now. Thank you thank you thank you for sharing your journey and being an advocate for others!!!", "jeweledspirit": "I can feel this so much! I have both Depression and Fibromyalgia, and wow , so many people just do not get it. Thanks for sharing your experiences in such a relatable way!! So appreciated! Xo", "komasabroughton": "Thank you. You have a powerful voice and I appreciate you using it to free our minds from the depression and prejudice we experience.", "smokeandmirrors_collective": "Yessss! You're wonderful 💕", "jocelynmathewes": "Thank you! I find that the laziness lable makes the depression worse. 😞", "jessicahonegger\nVerified": "Verified", "tase_walley": "💛💛💛💚", "cpfry": "thank you for posting this — i will admit, I fell into that trap with my fiancé. I thought he was being lazy/didn't care as much about our relationship when in actually he DID care and he DID want to do things but he couldn't because guess what? he's living with depression! it's still something i have to work on within myself as well, because it's also important to not only support and acknowledge his low days and his high days but also to acknowledge when I'm struggling in my own feelings/support because this is still very new waters for me to try and navigate but i sure am doing my damnedest!", "brantlea": "Thank you for all your honesty about your struggles with depression and bipolar disorder. There’s so many people that suffer quietly, I’m sure you are making a difference.", "trntbl.co": "☺", "rebeccafos": "Getting it done ✅🙏🏻⭐️💛", "heidistevens": "✨", "rachael_amy": "You are an absolute goddess and anyone who says otherwise can suck it.", "kateaureliastudio": "Thank you for sharing all you do about depression - mental illness is so misunderstood and yet so prevalent in so many’s lives. If only it were that easy... laziness would be so easy to cure!", "mayawohlfahrt": "wow! 😍", "sourcherrycouk": "@jengotch I was having the same trouble as you with messages but I logged out and back in and it’s sorted its self out 💖", "robertaensalada": "👏🙌🏻✊🏼", "megandizon": "@haelywhite", "pro_ha": "yesyesyesyesyesyesyes", "leftcoastmade": "Thank you so much for sharing! ❤️", "brooklynandwest": "@jengotch Thank you for being an example and being so real. I, too, am “lazy” to some, yet managed to open & run my own boutique for years. And it’s not easy.", "lisetanner": "🙌👏💗", "lizziemdesign": "Couldn’t agree more 🙌🏼🌟❤️", "ashestofire": "Moving ones ass instead of ones mouth benefits EVERYONE💡(common sense)", "domino34": "Thank you for talking about this Jen; it’s bloody hard to live in this hinterland, assuming everyone is brimming over with happiness and imagining your lot in life is to sit in the shadows 😔", "rmizrahievents": "Thank you for sharing @jengotch", "sharikensley": "Absolutely! Thank you! The more vocal we are, when we feel safe and comfortable to do so, the faster the thinking around this topic will change!", "jmorton84": "Agreed! I need reminding of that.", "seeusoon.us": "🌟", "katherinebackman": "❤️", "janebuckingham\nVerified": "Verified", "katiko13": "❤️thank you!", "oldcity_mailroom": "🙌🏼", "megkellymegkellymegkelly": "YES YES YESSS 🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "caelyanne": "I am rooting for you, @jengotch and for me and well, all of us. 🆒😍🏩", "andrearojasperez": "So important to let people know that it is truly something even bigger than yourself sometimes, and you wished you could be productive and then your mind won’t let you. Dealing with it takes baby steps and many times you fall and take steps back, but the focus is on keeping getting up, until one day you succeed.", "kristenkillie": "Man, there is way too much ignorance surrounding mental health. Thank you for spreading this message!! It’s so so important!!! 🙌🏼🙌🏼🙌🏼💗", "chantellebeda": "💖💖", "emmesscee": "Living with depression is the opposite of lazy. The fact that you manage to survive and thrive through it is a testament to the battle that you fight every day. Thank you for these important words. ❤️", "lilylovelock": "💘", "amandaoleander\nVerified": "Verified", "sixkiller_kate": "@Abbey.gif why I am obsessed with @shopbando", "joynewell": "👏🏻👏🏻👏🏻", "wkndla": "I've felt the same way, afraid I was lazy because there were so many days I wanted to hide in bed. Thanks for sharing this", "linkofhearts": "Truth!! 🙌🏼 You are amazing!", "imsmartemis": "Thanks for this post, and your stories. 👏🏽", "naturally.jes.acupunk": "Truth💕✨Thanks for saying this🙏🙏", "leahhenoch": "👏👏👏 thank you for saying this!!", "mariebee85": "@jengotch you're so amazing and inspiring. ❤️you!", "pulltheleversuz": "❤️👏🏻🙋🏻", "yocruzie": "God bless you!", "sweetmarilee": "Brave", "ashley_stickler": "Thank you! I have an alternate persona that was created when I was a teenager; Mama Lazzy... she's still around.", "ninamunk": "Thank you, for this! ❤️", "merrittloughran": "#teamlazy ❤️❤️❤️you are our hero", "juliebethtanous": "Needed this today. ❤️", "so.kayle": "Thank you for being bold and inspiring always 💖", "theartistsguild": "💕💕💕", "abbywakerley": "Thank you. I really need this x", "thegangstersdamour": "💛✨💖✨💛keep going on your beautiful path 🌟don't get distracted by other people. They are walking theirs. And by the sound of it, that person calling you lazy is probably having a very hard time being so hard on her/himself💞", "curiousheaven": "Needed to hear this today @jengotch!", "anna_murphy": "💓", "topanga_vintage_market": "Thank you, Jen! 😘😘😘", "gimmemynikkers": "#girlboss #girlhero thank you, Jen", "hailbot": "🙌🏼", "kerrymulf": "@cleanseyourlife do you follow?", "desilu719": "❤❤❤❤❤", "studiosilviamaria": "Thank you 🖤🖤🖤🖤", "suzannewithaz": "💗💗💗💗💗💗💗", "learnfern": "Thank you for this ❤️!!!!", "kimberlymaeholmes": "The fact that someone commented that to you makes me so sad! I suffer from “laziness” too and that’s just such an insensitive thing to say 😔 You’re an amazing human!! 😘💕", "alonamarie": "God, anyone who knows depression knows it’s the opposite of lazy. It is all consuming, eat you from the inside, exhausting 24/7 self hatred. It’s the busiest I’ve ever been, trapped in my own depressed head.", "jessdotcee": "I stopped going out towards the end of high school and all my friends would talk about me behind my back about how lazy I was and say that I would just spend all my time at home doing nothing, still to this day I have never gotten over that. I wasn't lazy, I was really struggling but no one cared enough to see the difference. Thank you for this post, it makes me feel infinitely better knowing I wasn't the only one to experience this and even more that you were able to actually accomplish so much with your life while living with depression. ❤️", "jungleofjoy": "GREAT PIC!!", "shesfrommiami": "This photo is amazing and so are you. From one \"lazy\" girl to another! 👊🏼🌸", "mrs_jakeryan": "Yes to this post! Fantastic picture (and such skinny ankles)!", "cassandaston": "Thanks for posting this. I think a lot of us who battle with depression are actually high functioning, crazy capable, bad ass go-getters, until we’re not. I’m fighting through ppd right now in the midst of raising two kids, struggling through the busiest work season, and prepping for holidays. And I still managed to throw my daughter a birthday party this weekend, even though there were days last week where I couldn’t get out of bed or take a shower.", "vivian9gar": "✨✨✨", "champdelindsey": "Oh man thank you for speaking up♥️♥️ this post was a \"light bulb\" moment for me... Thank you♥️", "juliaplusfour": "Thank you for spilling your guts to share our similar story. ❤️", "tbinkc": "You’ve put this into words so beautifully. Thank you. What you’re doing is so valuable and important and so are you. 😻😻😻", "beryl_n_nola": "💕", "lizelayne": "❤️❤️❤️", "sageglowstudio": "Yes!! 💗💗💗", "betseyjennifer": "Thank you. Thank you for your vulnerability.", "indiebungalow": "Hello and thank you. I’ve also been called lazy but work more hours than anyone I know 😳.", "erinbarrett": "💛💛💛💛💛", "nicoladoherty": "OMG yes. you don’t need someone to tell you your lazy because you feel it anyway.", "kimba213": "I needed this. Thank you for your honesty and willingness to share so that we can feel less alone. You inspire me and i wish you a lot of light and happy days. I wish that for me too. ❤️", "cp_west": "🙌", "selleck": "Some folks are so hurtful or thoughtless. Perhaps it’s how their own troubles are projecting through their “communication”. Let’s send them some light, too ;) (deeeeeeep cleansingggggg breaaaatttthhhh for our patience!)", "kelseymegankennedy": "You are one of the least lazy people I know. Thank you always being a source of inspiration of badassary 💗💗", "brooksonrose": "@jschafer2187", "taylorscheiber": "🙏🏼🙏🏼", "bigbadassbitchhere": "Love thisssss", "jessica.vonlehsten": "💋🚨🥊🍎❤️ a lovely red alert! Thank YOU for all your truth", "smiling_souls": "✨✨✨ THANK YOU for being exactly you and being bold enough to share it all", "sarahweird": "This is such an important callout! Thank you.", "cindy.rahe": "👏🏼THANK YOU👏🏼", "leeannleventini": "No Shame + Depression for real. Those that don’t suffer - don’t know. Yes! Thank you. I have a daughter who seriously needs to follow you. She is wonderful and beautiful and so young to suffer but with help... the right help, we are navigating the rough water together.", "mackprather": "@jengotch 💕💕💕", "c.janette": "So important!", "trina_mcneilly": "💓💓💓", "thewildandflower": "Yes! More open dialogue about mental health is needed! Xoxoxo", "sherise.lee": "🦋🦋🦋thank you.", "digibuddha": "So important to talk about this and erase the stigma surrounding mental health. Thank you 💗💗💗", "melis.a.leo": "Thank you thank you thank you. You are amazing.", "mollymarler": "AMEN and thank you and so much YES. I feel you and appreciate you shining your light @jengotch ! ✨🖤🙌🏼", "edroste\nVerified": "Verified", "jeanineelyse": "Thank you.", "funbagsnewyork": "🙌💓🙌", "westtsidestory": "THANKFUCKINGYOU. Thank you. Because I️ feel crazy sometimes when I️m not doing anything and I️ best myself up for it but I know I️m working on myself every time I️ decide to get up", "ohfritzy": "Me. here. all the time.", "mandy_tangerine": "Actions speak louder than words. People will vomit unnecessary words all day long but your actions and success make their words meaningless.", "luinui": "My entire family calls me lazy 😞I try to tell them who that makes me feel and what's really going on and they say I'm making excuses.", "aklimton": "Right on ❤️", "emmeliney": "Yes.", "natonthat": "@marilynbaker 🖤", "thenotoriouskam": "💞💞💞💞💞💞", "aalex_615": "Love this, love you, and love your brand! 💕", "tonicat": "Honestly, you don't even know me but you've helped me so much with identifying & talking about my own anxiety & depression. Thank you for being so open and vulnerable. I struggle with being \"lazy\" a lot and needed to read this today. ♥️", "yourkompas": "YOU ARE A LIGHT!!!", "bonjourmir": "THANK YOU 💕. You are a goddess and a major source of inspiration for me", "kitchentablenw6": "Depression is a truly horrendous illness, one my husband lost his closest friend to. It needs to be taken seriously. You’re amazing for spreading the work, and you’re amazing for all you’ve achieved xxx", "rentedfields": "Thank you so much for this!", "rjmaki99": "Thank you for posting this !", "luckypennycreative": "A fucking men, @jengotch. A fucking men.", "shophydrokitty": "I’m lazy and continually fighting depression as well. In the midst of it I️ went through a long divorce and started my business. Many days I️ find it hard to get outta bed and deal with the world. Really too much mental energy spent just being really in my own head, leaving me looking more lazy to people. I’ve lost friends who are tired of trying to cheer me up when cause “your life is good and you have nothing to complain about”. Depression is NOT rooted in logic though! It creeps in when things are going just fine then you have to run off to a private place to cry lol", "bridgetjoey": "Thank you for saying this", "juliefordherbison": "Props for sharing your story. The person who posted that depression is the same as laziness is intellectually lazy. There is so much info out there about depression they should know better if the did the slightest bit of research.", "frnt.paige": "Yessss!! Every bit of this! As an entrepreneur it can be the hardest because it’s a toxic circle of being being depressed, being excited to be in charge of your own life and being pissed at yourself for. It taking charge “the way you should”. Thank you for sharing your version 💕💕", "monicamarie5": "So necessary to hear this today, thank you for sharing", "acerbic_alice": "And being criticised just feeds the beast!", "lovemesimply": "Thank you for those videos.💕", "jessicadaviesmetalworks": "It took me years to finally get this. You are absolutely correct and realizing it has made me such a better pillar of strength and support to those I know and love who are deeply affected by depression. Sending love to you, Jen. ❤️", "tirzahlouisa": "Thank you for continually shedding light on this 💜", "themirandarodgers": "Depression isn’t laziness. It’s a debilitating sadness you can’t explain away or logically get over. What a turd of a person. Without medication I’d be in bed all day, no motivation, in the pits of despair. Laziness doesn’t enter the equation.", "lyssa_flo": "#StopTheStigma #MentalHealthAwareness", "mary_alise_edinger": "Thank you.", "lloyd_noble": "People that suffer with anxiety, depression or any other mental illness totally GET IT! I️ understand this on a million levels. It is literally impossible to try and explain to people how it feels or what it looks like or how sometimes you may feel “ok” and then other times you feel completely hopeless, lost, can’t focus, can’t sleep, can’t think, can’t breathe and can’t even “BE”. I’m sure for every person it’s an entirely different experience, but we all share your pain. I️ find it quite ironic though that even throughout history, most creative geniuses have suffered incredible “episodes” of depression, often times, being described as “MAD”. The comfort is knowing that the madness, as awful as it is, also allows for some of the most creative and artistic expression that other people do not possess. This creativity cannot be given, learned, or taught- it is an innate ability given to you! I’ve yet to meet a true creative artist that didn’t suffer from some varying level of depression/mental illness. Keep on keepin on! I️ get it, and others do as well. I️ see no need to apologize or explain it. If people don’t get it, or aren’t willing to understand it- they can keep it moving too! #bandtogetherfellowcreativenutbags 💕💕💕💕💕💕💕💕💕💕💕💕💕", "jennrak": "Thank you for being open and honest 🙏❤️.", "stephjgilbert": "Thank you. I too have been feeling “lazy” lately and I resonate so much with all of your stories today. When the things you were excited about feel too heavy out of nowhere, that’s not laziness— it’s chemical. You know you got this. 💪🏼💕 sending love!", "tarawinans": "Bless your honest, encouraging ♥️ Jen", "meghan.awalt": "Thank you for speaking out and just being vulnerable . Depression sucks ass . And people don't understand it -and the being not understood makes it worse. Keep on keeping on sister. Lots of love coming your way from all over .", "shazi_la": "This this this. It’s such a huge struggle and so many people just don’t get it. Thank you for this. 🙏🏽❤️", "lizperezartist": "@jengotch You are loved just the way you are dear Jen 💜 I’m writing a book to help people overcome depression and help them get through dark times. You can DM me to learn about it or follow me @lizperezartist 💕 It is my hope that my words will help people overcome their feelings of hopelessness, self-hatred, and worthlessness. Much love, Liz 💜🌙", "rockwhitit": "💗💗🙌🏻🙌🏻 thank you", "kathleenmusic": "WORD", "karlijaye": "🙌🏻🙌🏻🙌🏻", "happypillofficial": "Well said and so so so life changing for many to read 🙂💕", "mollysandlin": "A little louder for the people in the back‼️", "melody.heide": "Thank you for showing your dimensional self here on IG. As someone who also struggled with depression but also wants to get shit done, you honesty has helped me feel so much less alone. I hope this community is doing the same for you, somehow.", "sarahcurrydesign": "❤", "brookerodd": "You’re a rockstah!", "shana.ball": "Thanks for this Jen. Mental health is so much more than what people think, and no you can’t just “snap out of it.” You are a BOSS and you’re right, no one can call you lazy! Love to you, keep being a light while keeping it real, always. Appreciate you.", "hannahklismith": "Thank you.", "themotherlove": "Good light shining", "citronovydrops": "You are forever an inspiration by being honest ♥️ Thank you", "saratess": "🙌🏼 amen 💕💕💕💕🕊", "hej_ditte": "Hørt!", "marielosbornlifestyle": "💗", "kelljokrause\nVerified": "Verified", "hopecavell": "@annamseifert 🖤", "hellosarasophia": "This. Oh god this.", "jenniferdoesstuff": "You are amazing and an inspiration to me and many others I’m sure.", "kendall.bennewitz": "💗", "kittenkaboom": "Pardon my French but fuck that person for commenting with that garbage.", "frecklesandgingerdresses": "The guilt from suffering depression is one of the worst things, continuously beating yourself up for things you haven't done today when getting out of bed and having a shower is a huge battle in itself. Now when I get angry at myself for needing to rest and self care instead of saying I'm a lazy piece of shit I say \"no I have a mental illness and I will try again tomorrow\"", "lisajean1237": "Love you lady", "denisecrew": "Thank you! 😍😘 And 🖕🏼to that 💩.", "catsinmycloset": "THANK YOU OH MY GOD Literally had an ex tell me that I was never gonna achieve anything because I’m “lazy”, like, nah bruh, it’s call depression and you suck bye 👋🏻", "erbrop": "I usually don’t comment but I just wanted to let you know that watching your stories has helped me come to terms with knowing that there is no quick fix for depression and it’s something I’ll probably work on for the rest of my life. But seeing someone feel some of the same things I do and continue to do incredible things is inspiring as hell ❤️", "laura_rubbini": "❤️", "_luddivina_": "Tell them go go fuck themselves!! 😡 I got yo back homie 🗡😎", "theswanksocial": "❤️", "ashleelovelee": "Thank you for the reminder, Jen. I struggle with depression and finally asked for help in the form of medication last month. I’ve been hard on myself for not being able to do anything and feeling lazy. Please never stop speaking about mental health. You are a light and you are amazing. Sending you love ❤️", "deenr88": "🙌🏼💕💕", "georgia3190": "@hannah_karenina 😘😘", "pamellaheikel": "I think you just shined a light for me.", "mali.mish.marlene": "Yes yes yes ❤️", "katpfisher": "@thisgirlsbetterdays follow @jengotch, watch her IG stories. You're not alone.", "chanda_peterson": "Sending light back to you 💫 This helped me....thank you🌈", "tinoiseau": "You’re amazing and on point. Anyone who struggles with depression is fighting their hardest every day. Nothing lazy about it.", "rebterkes": "@jengotch 💙 me right now. And im trying so hard to crawl out of this hole!! So thank u x", "el_tomboy": "That’s the exact word I use to describe myself when I’m depressed. And then it’s like a light bulb goes off that it’s actually depression.", "sara__pavao": "Thank you for speaking the truth! It's terrible how such a debilitating illness carries the stigma of shame. Shame on the people who continue that way of thinking!!", "jennagilmore_": "Thank you 💕", "kodeofkondukt": "Thank you!!!", "leisaleisa": "Love you Jen", "cassidyallan": "💓💓", "meadeac": "Jen - I wish I could give you a big, big hug. Thank you for your vulnerability, and I’m sorry someone took advantage of this and made a wrong and hurtful comment. That is 💯 a reflection of them, and nothing of you. Hang in there. ❤️", "worklovely": "Thank you so much for this. I literally could not move this weekend. Getting out of bed felt like I was immersed in concrete. I too am successful, a Vice President who works 12-14 hours days. But when that depression hits...Thank you again. These words allow me to forgive and understand myself.", "franberrypie": "All of this. Thank you.", "emmy_lou_hue": "AMEN GIRLFRIEND", "hannah_karenina": "@georgia3190", "victoria.devey": "You are enough @jengotch don't listen to your naughty inner critic... also bigger people are harder to kidnap so if you do put some weight on then that can only be a good thing 🍰😘", "pehtrasvanberg": "I hear ya!! Those who dont know just dont get it?! Keep it stong girl 💗", "whatsarahlikes": "this is so insanely inspiring and you have no idea how many people really need to hear this. Thank you for being so open about your journey! ❤️", "gabyviteric": "👏🏼👏🏼👏🏼👏🏼", "kerrycrawford": "👊🏼💕", "loren.ipsum": "💕💕💕", "brandysroberson": "You are correct. That is so dangerous and SAD that that person would say that. Sending love.", "smallbutmightyshay": "Thank you so much for your candor, Jen! It means a lot to me. 💗", "catebp": "Ugh. If only people who label us “lazy” knew how much we want to do more and be better. And how often we push through because we must. It’s the opposite of laziness. It’s perseverance and overcoming massive obstacles. Mental illness can be debilitating and so misunderstood. Thanks for continuing to shed light. 💖✨", "lindsay__catherine": "So so grateful for wonderful humans like you my dear 🙌🏻❤️🙏🏻😘", "shop_thepalmedor": "You Rock @jengotch ⚡️🌟🌟🌟", "mrssargent": "Amen amen amen amen amen amen amen amen amen amen amen", "thealbstandard": "@amcnultz", "fr_isabelle.b": "This is indeed a big problematic misunderstanding with some BUT SO MANY POSITIVE MESSAGES NOW... from people who know what you are talking about and from those who want to understand! ✨💕 And yes, I began shouting... but it is just because I'm far. 😬🙊", "caligerl4ever": "You are the bomb.com 💓 i suffer from the same and i think it gets more difficult for those of us in our 40s .. and recently single ... egad ... trying bumble dating site 😑👾 makes me want to pull the covers over my head even tighter ☹️ thank you for being you 👊🏼", "angelarenai": "THANK YOU!! 😭🙏❤️👌👏", "birdtrouble": "Thank you for the inspiration to deeply think about this. I️ can relate so much.", "c8quinn": "🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼 posts like this from women I admire (YOU) make me feel better about my own shit. What you're posting is IMPORTANT", "jobym": "So not lazy! Fight the good fight! 🥊", "stephaniedawson": "You. Are. The. BEST!!!!!!!! The best. Inspirational woman. Love xxxx", "petit_dejeuner": "I suffer from depression as well and often beat myself up for being lazy or not motivated enough. I would’ve never guessed you have it was well! Your work and energy (from what you show online) are so amazing and it’s inspiring to know that it all comes from someone with such a hard condition to deal with. I’m just sending this message cause I saw you at the rose bowl last weekend and I almost had a fan moment but I stopped myself from squealing and letting you know how much I admire you. So there!", "ashleywoodsonbailey": "Nothing lazy about you-i deal with the same and i dont deal with it very well", "katemiss": "YES. But trying to explain that to someone who has never suffered from depression before is like speaking in a foreign language to them. Thank you ❤️", "megscazgrove": "👏👏👏👏", "emilykprovost": "thank you for this. sending so much love you boss bitch", "katie_inthe_hood": "Thanks for saying this. Very true and important.", "katwalkef501": "Well said, Gazelle💗😘", "rachel_plates": "❤️❤️❤️", "darianottheshow": "Thank you for saying this. I was self described as lazy and went through a lot of guilt & shame until I found out what was really happening.", "thegivingcrate": "Completely ❤️❤️ thank you!!", "imallieallieallie": "Love you jen!!! Fuck the haters 👋🏻👋🏻👋🏻", "ali_nicbhatair": "Thank you! ❤️", "jafofbullrun": "Thanks for having the courage and patience to give us a window into the life of someone with depression. I feel like you are doing something that is the opposite of what your depression is pushing you to do and you’re doing it for the selfless reason of helping us understand depression. 🙏", "maceopaisley": "Would love to do something with you in 2018 around this message at the gallery. 😍🙌🏾", "inkiedinkie": "❤️❤️❤️ it’s so difficult bc even your mom or close fam call you lazy or see you as such. For you not to believe it and know it’s the disease when you are fighting such a monster it’s terrible.", "itsthepickles": "Oh I've been there. Certain times in my life called for lazy days on the couch and wine starting at noon. That numbness was debilitating! (Divorce and sharing the kids can do that to a Mom! WHAT else was I going to do on my weekend OFF?). I got better. But, I was depressed, sad, confused. No, I wasn't lazy. I believe lazy is something intentional. This was my life adjusting to new circumstances. Hell, I think I needed that \"couch time\"! Lifetime movies did not disappoint!", "lovely_odyssey": "A million thank you! Yesterday I saw someone post “choose happiness” and the first thing I thought was, it’s not that simple for everyone.", "tributarypools": "✌", "survival.bias": "You’ve been an inspiration to me for years now. Thank you for your constant honesty and rawness.", "chloe_kiser": "Good reminder! But I know that when I’m feeling ‘lazy’ it can be impossible sometimes to realize what is really going on, even though I should be like, ‘duh’. It’s like I have depression and anxiety amnesia😬", "nayelivg": "🙌", "luciamallea": "❤️❤️❤️❤️", "emilybrenn": "💕", "kser369": "I watched your story, i wish i could help. 🌷🦄🍄", "instanjul": "So damn true! Thank you Jen! ❤️🙏🏽", "queen.of.crumbs": "Duuuude. Thank you. It’s so real. Thank you for being honest and vulnerable.", "jbilmer": "Love you", "jennifer.lindz": "THANK YOU", "lisa_lizana": "Thank you for saying this. I feel tremendous guilt daily about all the things I should be doing, want to do, but can't seem to get done. The guilt just feeds into the depression and makes everything spiral. 😔", "luckypennyblog": "Thank you and love you for this 💗", "thelordjones\nVerified": "Verified", "mrsmiddlezahn": "Thank you. ❤️", "rebeccadecz": "💗💗💗", "riley.calls.me.mom": "Sad that this needs to be explained, but so true. You can be the most hard-working, motivated person, and depression can hit you when you least expect it. I suffered from depression throughout my teens and twenties, and finally, when I hit my 30s I thought I was good. I had all the energy and motivation in the world and I was kicking add in my career (as a Behavior Analyst, go figure). Then, I had my daughter a year and a half ago, and I've been suffering from postpartum depression and anxiety and it's taking a toll on my work life and home life. But I'm pushing through. Taking one day at a time. Some days, I just want to sit around and do nothing, but I'm not LAZY. Anyway, thank you @jengotch for sharing this and your story over the years. It's wonderful to have someone so candid about the struggles of mental illness, especially when you are a successful, driven, hard working woman, as you are. 💕 btw, I love your brand. Perfect combo of cynicism, sarcasm, and bright colors to make this crazy girl happy.", "niralibchauhan": "@businessovercoffee", "ashtonlynnk": "YES. Thank you. 💓💓", "emilygaetke": "Way to be brave!!", "andrea.fairservice": "Bless you Jen. Depression is a recent “addition” to my life. Meaning, I’m just now able to identify what I’m feelings are symptoms (if that’s what they are called) of depression. It’s a lot of feeling normal ups and then low low LOWS and being on the grind of self destruction before being able to identify what’s actually going on. A few weeks ago I spent an entire Saturday in my bed. I literally did not have the will to get up, eat, function; and once I snapped my self out of it I felt so terrible like I wasted one of my precious days off being a lazy dick in bed. Thank you for this, and everything you share. It’s truly helped me learn more about this and I’m thankful you’re so willing to share such personal, \"hard for others to understand,\" issues. xo", "ginarockenwagner": "My old boss called me lazy! I said that's funny, the doctor called it Generalized Anxiety Disorder when he wrote my prescription. 🤔", "leslieschor": "Thank you for sharing your struggles!", "automatism": "💕 Thank you so much for this, Jen!", "nayirikrikorian": "Yes. Yeah. YES.", "retrobettie9": "❤️❤️❤️", "ange_who33": "Explaining mental illness to others who don’t suffer can be like talking to a wall. Having people like you and @imlauramiller to be such strong advocates makes people who suffer feel less alone. You da best.", "ladymcgee": "Preach!! 💗", "debbedowner": "Yes! I’m a scientist who studies depression, and it’s so important that people it’s a REAL disease, with real biological reasons for why it happens, just like cancer, heart disease, Alzheimer’s, etc.", "_karawr": "Thank you for talking about depression. 💕", "amyalexandra": "💛", "lolliswim": "💖💖💖", "jennrdart": "Thank you for sharing. I suffer from major depression and have been feeling really bad lately especially when all I want to do is be in bed. But my negative self talk of course makes everything even worse. And hearing it from others certainly makes it worse. I hope people start learning about mental health before they say stupid things.", "hollisanne_": "Yes yes yes.", "aprillshowers": "Hi you're a goddess thank you 💕✨🙌🏻", "sarahdeanbeauty": "Boom! Love this. Love you.", "moronoa": "❤️❤️❤️", "hoatsonlouise": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "pattymessner": "shine away! it’s so scary how many ignorant thoughts about anxiety/depression/& mental illness there is out there!", "saraminagram": "Thank you! ✨", "hannahtakespictures": "LOVE YOU", "tammygordon": "You’ve never been lazy. Lazy people don’t become sorority presidents and lifestyle brand entrepreneurs. Love you.", "bethanyabrennan": "Wow I hope you block that person!", "moonpiemary": "You are an amazing woman ❤️", "leslieandcuddles": "Fuck yeah 👏🏽👏🏽👏🏽👏🏽👏🏽", "honestly_m_": "Love you 😚 Thanks for this 🙏🏼", "the_fold_mag": "🙌", "tlee79": "I love you jen you inspire me 💗💋", "katepetruskavich": "There is such an important difference! Depression isn’t laziness or lack of trying. It’s a daily battle to be the person you want to be instead of the person depression makes you feel you are.", "laraculero": "@jengotch 🙏🏼🙏🏼 write a memoir already 😍❤️", "lindsaypete": "❤️❤️❤️❤️", "citycricket": "Yes to this! My day many days.. ❤️", "zilahdrahn": "i love you so much. strong woman", "abubblylife": "I love the TED talk on depression where he says- “the opposite of depression is not happiness, it’s vitality”. That life sucking feeling depression takes from us. 💕 #breakthestigma", "theearcollector": "So much love and applause for this! Thank you! Been there. It gets under my skin sooo badly when people equate laziness and depression.", "kelseyferguson.co": "Amen. So thankful for you that you’re willing to speak about this. Your feelings are vastly beneficial for others to hear and learn about.", "agatamapiec": "Thank you Jen! You are the best❤️❤️❤️❤️", "lydford": "You are amazing ❤️", "em___mcgovern": "it's harder work to move against the flow; i get it, and yet it looks and feels a lot like standing still. you are loved by every heart who has scratch around in the depths — because faith, right? 💜", "ifurie": "Thanks from a fellow woman deep in a two week anxiety and depression shame hole. Thank you for saying this. Thank you.", "camilladallerup\nVerified": "Verified", "ziipbeauty\nVerified": "Verified", "imlauramiller": "hallelujah 🙌", "amandajhunter": "#preach", "posymarket": "You’re awesome.", "hannah_norm": "Thank you @jengotch ❤️🙌🏻", "marissaaross\nVerified": "Verified", "joiebutter": "👏🏼👏🏼👏🏼 it’s so hard! i beat myself up and call myself lazy as some twisted form of “motivation” while i would never call anyone else suffering from depression lazy. thanks for the reminder.", "erinloechner": "You're a rockstar. I remember when you pulled out a shoebox with the first few headbands you guys made after that Paris trip and omg, I just am proud and delighted and amazed at how you've championed the whole of the process: the good and the sad, the hard and the fun. 💛💛💛", "ee2eunice": "this ❤️", "mimosahandcrafted": "I feel like there also needs to be a psa that’s says the flu is not laziness... I’m getting over that and it makes me feel like I’ve abandoned my business and my family 😫 but I know better. But I don’t 😭", "busyphilipps\nVerified": "Verified", "shopsuni": "Thanks for making that clear. ❤️🧡✔️", "andrea_snee": "👏🏼💪🏼👌🏼🤘🏼🙌🏼", "rivfifi\nVerified": "Verified", "kathleen_bernall": "🙌🏼"}