{"babsin805": "It's a journey for sure. I spent my life yoyo dieting until I was around 34 and finally got sooo sooo sick of it! I've ended up putting on 60lbs since then as I am now 45. I guess it was kind of my fuck you to the diet industI would like to get maybe 30 off because my back and knees hurt but I refuse to obsess over it and want to do it the way that's mentally healthy for me. Not sure what that is yet but I'm still figuring it out. I still have a lot of anger and rage towards the diet industry and society in general. Sorry, didn't mean to make it is AAM but I just want you to know that you are not alone. Be gentle with yourself and hang in there. 💖", "minalionheart": "THIS ❤️❤️❤️", "styleandpepper": "This is all so SO close to my heart right now... have been writing thru a lot of my own body issues lately, and completely needed the reminder of your third point as a kick in the (sometimes too-tight) pants to keep pushing toward the kind of world where girls can see and love a ginormous range of body types and beauty. To your second point (the warped view)... I am ACTIVELY working on a solution for this. Will Lee you posted and until we figure something out? I’m praying that you‘ll find a way to ditch the backpack and see how much we love ya despite your internal dialogue. ✨❤️😘", "marshalls_antique_warehouse": "I love this!!", "laceandlikes": "Love everything about this", "susannahmaddux": "Love", "abeautifulflowerchildmess": "@chelsea_marrisa4", "viviannedecourval": "This is exactly how I feel about myself !!! You are beautiful !!! 😻😻😻", "suellengregory": "Inspiration - you are!", "alex_odonoghue_": "However I know about those blasted shame rucksacks 😑", "stephanysmorren": "You look beautiful", "michellezagardo": "I can relate to all of this! I did style school with @stasiasavasuk and it helped more with learning to love my body than years of therapy. Definitely check her out! And sending all the love to you. This body stuff is the worst. ❤️❤️❤️", "coffeeandbeauty": "@jengotch so spot on about GenZ' kids. Love this thought. A lot. And you look beautiful, don't let your mind get warped by social & social media pressure thinking the opposite. You're strong and beautiful. That simple. ❤", "brookenorma": "❤️❤️❤️", "repactiveart": "Perfection is our enemy. You are beautiful and blessed! We’d love to send you a pair of our artfully expression compression fit leggings 💗", "liverpooljeans": "wow, we love you & this post! 💖", "holistichabitatclt": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻❤️❤️❤️❤️❤️", "anniemacattack": "I needed to read this exactly today. Thank you. 🙏🏼", "averybird12": "🙏🏽", "theinspirationalmomma": "Omg @jengotch I love this post! I’m 6ft 2in and have struggled with my body image too. But I was beat down as a child through high school by my own siblings. Always told me I was ugly, dumb, stupid and fat. I’m 35 and just realizing those are lies. You gotta check out @msrachelhollis new book called Girl Wash Your Face. It’s about all the lies we as women tell ourselves and how they are not true! Thanks for sharing your story! ✋🏻❤️😊", "iladdali88": "#would", "lgreddog": "Just heard you on bullet proof radio. You earned a new follower. As far as you physical image you look great. Sounds cliche but true beauty is within and in my opinion when people see that they see past the physical image. @jengotch", "acmseger": "😚❤", "stephanie_aleccia": "You look great! Your shape is so beautiful. I struggle with all of that too. Even when I was at my thinnest and fittest, I was still not satisfied and was picking myself apart. Now I feel disgusted with myself because I've been \"lazy\" or \"too busy.\" Not sure how to combat it either, just time I suppose. Let me know what works for you and maybe I'll give it a shot!", "281cinco": "Beautiful!!", "allielizabethbrown": "@hyders84 💗 read these last few posts and follow💗", "farmgirlpaints": "I grew up with a momma who was on a constant diet. It carries with us unfortunately. The struggle is so real for most all of us. The acceptance needs to come within, but I think you look great. You even have that thigh gap thing going on girl. 🔥", "bevinsparty": "The body love journey is a long one! I started mine at 22 and I like to think I have had less time loving my body than hating it and so it's okay that it takes time. By the time I'm 44 it will be even. It's already so much better. Good luck with yours! Even being aware of toxic inner dialog is a huge step towards more loving and kind inner thoughts!", "foxandfinch": "💖💖💖", "thelighthatnevrgoes0ut": "here’s to using that oh-so-eloquent inner dialogue for self-love instead of self-hate. the new paradigm ain’t easy to adjust to. in closing, um.. i’ll drink to that 🥂", "claire_kramer_mackinnon": "What @drjamie14 said ❤️", "mildadesigns": "thanks for your beautiful words and expressing your beautiful self. I'm glad I found your silly ass in the virtual world of Instagram, you keep me laughing and feeling happy inside.💕💖💕 keep on glowing!💥💥💥", "devonrachel": "Always love your point of view. You are a hot tamale with talent out the wazoo!", "starr.marguerite": "BEAUTY COMES FROM WITHIN 👏🏼👏🏼👏🏼👍🏼👍🏼👍🏼💕💗💕🦄👩🏻‍🎤and you are exceeding beautiful, Jen! 🌈", "emilyframe": "Such a win for those youngins!!!", "oivanki": "@jengotch I’d kill to look like you do in leggings! #hottie", "jennifer.fogerty": "Fucking hot! ❤️🙌🏻", "xokristinalouise": "Beyond. 🙏🌹", "meredithmarshall": "Giiiiiirl, I would kill for your body. Instead I’ll show my own body a little more love today, thanks to you ❤️", "ivyandstone__": "What a wonderful human being you are! 🙌🏻", "29flowers": "I have had body issues all my life... in my 50s. I am small 5 ft 1” but even when I am at my lowest weight... below guidelines... I only see flaws. Good luck with changing your inner dialog.... it is very difficult. Thanks for the wise words.", "frolik_studio": "❤️❤️❤️ You have such beautiful feminine curves and are an inspiration every day!", "artgoforth": "Looking good !", "genkog.dkv": "Beautiful!", "fennyvine": "🙌🏻❤️🙌🏻❤️🙌🏻❤️", "nicole_schiller": "You are physically beautiful but your vulnerability is breathtaking! I love it so much.", "sarapants": "Glad you’re behind the bodypos movement. It would also be cool if you offered plus sizes at ban.dō.", "mandiclay": "@thebirdandtheboy", "minipiccolini": "SUCH good shoulders!", "annie.monty": "@mckenna_whit12 @silva_bells", "redwoods78": "Beautiful figure, curvy, and just right.", "jessicadaviesmetalworks": "You are so spot on! And beautiful all over. ❤️", "littlebigbee": "Thank you for being so honest. You are perfect. ❤️", "michellespearnicholson": "❤️⚡️❤️", "sweetherr": "I just started following you & I love you. You are awesome!", "jude_and_elaine": "🖤🙌🏼", "mlregan": "Every time I even think about body-shaming myself, I think “There is someone, somewhere who would kill for my body.” Because it’s slimmer than theirs or because it works better than theirs or because they wish they had a butt or because they love my nose. The grass is always, always greener. Your flaws are someone else’s goals. And FWIW I’d take your body in a heartbeat!", "molls\nVerified": "Verified", "morganmariah": "Love love so much love for this. I feel you sister. I love you sister.", "eclaircissement": "I truly hope you're doing other rad things besides reading hundreds of replies -but- I shout with the choir RAD SELF LOVE LETS-DO-DIS❣️❣️❣️", "stephleilani": "Whoa. This gave me chills. Endless amounts of beauty. That is so true! They will grow up with eyes wide open compared to us! Love this.", "weekendering": "** De-programming activated ** 😘", "nikin": "I could not agree or relate more! Thank you for this, thank you, thank you! And to the millennials, who generally get a bad wrap, thank you and keep it going!!! ❤️💕❤️", "robincarlisle": "This is a wonderful start and you don't need me to say this and you do need me to say this because that is how this game is played, but, you are beautiful. And you are not the only one who has filled your back pack, as women, the minute we learns our girlness, they! The out there! started to load us up! I know you know, but it is important not to bare all of the burden of self hate, it is taught us, and it is not so much ours, or of us, it certainly is not who we are. Just, this is to say, go so soft with yourself, that is what your sweet heart and body and your rock piled spirit needs, just like all of us here, we women need to go soft on ourselves, load knows the out-there has not been so kind.", "scandaless": "This is so great!! Thanks for sharing", "amandamurphy526": "You’re perfect. And not in that you (all of us really) don’t have flaws, but that they exist and they are accepted. Thank you for always being so real.", "ellla_nutellla": "Always inspiring ❤️ (I so relate) and you r beautiful", "sonflowerchic": "You are beautiful (those hips 😍🔥) you are stronger than you see and so authentic and inspiring!", "kkmar": "You are the BEST", "michellebastyr": "🙌💓💓💓💓", "ashestofire": "You have to believe in yourself. That's the secret.", "absoluttina": "Thank you for sharing this!! You are beautiful!", "morgan_wyenn": "All of this resonates with me ❤", "emilymceachern_": "You do have really great shoulders. 😏 #jealous", "stacyfenton": "You are beautiful inside and out!!❤️", "dinneratmidnite": "You are gorgeous, inside and out ✨", "msdandy": "⏳💎💯🐾👌🏽👏🏼💕😘", "catpaulk": "You’re awesome and beautiful!", "kimiecakez": "Yes you are beautiful. Think of all your amazing body has been through and you wake another day like a champ, kicking ass at a pink empire that injects fun, positivity, and a little bit of realness into some usually boring shit like planners and pencils, and notebooks. You got my money, you got my attention, and lots of others too. Your body helped do that. You did that. Hugs to you.", "bloomies_by_lille_syster": "Yessss to next generations. They are not taking any shit from anyone. I’ve seen it with my own eyes... the next gen is truly empowered and ready to roar. Meanwhile, I️ will continue to cheer them on trying not to wear an oversized sweater while I️ feel “fat”.", "roseequalls": "beautiful shoulders, beautiful heart ♥️", "jenmsuarez": "Love this!!", "queenbeesanders": "Love you!!!🙌🏼👊🏼❤️😘", "selbyvanerk": "Love this and thanks for all you do!!! It's amazing and so honest it's refreshing!!", "kara.sorensen": "Yes! Focus on what you love about your body, even if it’s only one small part of you, that’s the key 😍", "shimmer78": "I’m still trying to figure out what you don’t like about your body. A lot of people including me would die for a bod like yours!", "amsterdammodern": "🙌🏻❤️", "mawlzz": "Thank you for this! 🤗", "jacksfoodla": "Everything is Right", "jessiestent": "I love your insta dialogue. So honest and real and empowering, you don’t hide any of the dark bits and it’s so reassuring. Thank you", "flyting": "You are my favourite part of Instagram. You rock.", "margeaudyer": "Awesome post! I’m definitely part of the shamed/shameful boys feeling generation and I don’t honk an hour goes by where I don’t think about my weight—too much time and energy; what a waste! Glad to hear that the cycle will b broken!!", "tammychristine1234": "Me too 😐", "ledgesite": "Absolutely appreciating every bit of this reveal! So necessary, I suffer in the same way and I too see the potential for this shift and it’s absolutely uplifting to parent a young girl with this current pro body mindset blossoming 💥🌈🔥", "anastasiaserena": "❤️", "taliaweisner": "Love this!!! @jengotch", "jeweledspirit": "Hello Beautiful Jen Gotch, where have you been all my life?! Lol. I’m Jewel and I’m following you. Hugs. 😊xo", "tvlcreative": "You’re beautiful ❣️❣️", "arleighwood": "The best!", "katecapone_studio": "I feel very #ditto on all of this, but thankful for #3 as I have 2 daughters!", "h_a_d_i_a_09": "U are fucken sexy and that's that💕", "zarlsberg": "I think you look pretty cute", "debbydebbydebby": "Looking 👌🏽👌🏽", "sparktink": "🙌🏼🙌🏼🙌🏼", "shift_shape_repeat": "Gorgeous- just gorgeous!!", "_l_a_d_": "You have a thigh gap! Why more could a girl ask for?!", "jonicamelanie": "❤️", "tourdetodd": "Damn you fine!", "anniegradyhartnett": "You are my hero", "earthface": "And here I am wishing I looked like you!", "themwcollection": "I see a perfectly curved body.", "switzart": "Stunner!!!", "noelledaily": "YES this is everything .. !!!!", "injeneralvan": "@jengotch check out @rawbeautytalks and you gorgeous girl!", "awpdesign": "I'd kill for some girly hips, you're adorable! I had a baby 10 months ago and won't look it the mirror...still.", "itsmeswani": "I adore you. This is my very favourite post you've ever written.❤", "maddogtwenty20": "Saving this to reread bc I need constant reminders to be mentally nicer to my own body. It’s a struggle. You have an amazing figure, but I would never reduce you to just your body—you are an incredible, inspiring woman 💗💗💗", "theintellectualwasteland": "@jengotch I think most girls deal with a warped body image - myself included. But the T R U T H is: WE are all beautiful just the way we are, and we should NOT feel bad about ourselves or feel forced to change anything just because society has decided on a set of standards. YOU are smart, gorgeous, amazing AND successful, and please don’t let anyone - not even your own inner critic - tell you anything else! Loads of love, support and cheers! ❤️xx", "lesliannh": "❤️❤️❤️", "ginerously": "@girlfriendcollective probably just about sold out of those red leggings since they look so great!!!", "sarahellacole": "You’re beautiful 🙌🏻🙌🏻🙌🏻🙌🏻", "themotherlove": "This is everything - I think about the impacts of body image and how we see ourselves everyday because of the way children’s brains develop. Take the win, young women and people! You’re spot on, Jen, and keep rewiring..the erasing and rewriting is the best part 😘", "kiscoprintshop": "You are hot Jen! Don’t kid yourself", "annarj01": "#twoarmstwolegs 😎", "torimellott": "You are wise and beautiful! And funny! ❤️❤️❤️", "lbrackenbury78": "Good shoulders....head, knees, toes and eyes and ears and mouth and nose! The whole package. Lovely inside and out, (inside is more important, we're all going to end up wrinkly one day, if we're lucky)!", "lindseyirving": "Preach it gurl preach #loveyourself", "ssssssylvie": "Amazing!!!!! 😘", "pikemj": "Ankles and shoulder. Parents just know these things!! 😆There’s a fantastic documentary and now massive movement started here in Australia @bodyimagemovement that is moving mountains to support women and girls in their fight to embrace our bodies. It is so inspiring and full of positivity 💕 #bodyimagemovement #embracethedocumentary @bodyimagemovement", "laceyvetere": "🔥🔥🔥", "onlymeganstarr": "Get it girl! I struggle with an eating disorder and it took me years to even see it. Now I'm working on accepting me for the way I am. Keep those closest to you who let you know there is nothing wrong with you. You got this lady 💜", "em___mcgovern": "i know this daily shame and investing even more energy is covering it up; the shame and my body. so exhausting. and so much to be grateful for — a lifelong conversation that can shift and evolve for sure 💗", "mistyhalaby": "Mind blown. Thank you for being honest. I feel the same 100%. You look great!!!", "catesmithhh": "You are absolutely wonderful!", "sustainablerainbow": "Yaaassss🙌🙌🙌", "corcorandana": "Yeah, that inner dialogue is a killer, I can totally relate!! You do look awesome btw!!", "kiwijess": "You girl, are beautiful! I hear you with the warped self image, I have that too...no matter how many times someone tells me I’m beautiful or I look great, I’m just like...well I’m still fat, need to work on that!", "sunnysolsole": "You are beautiful! 💛", "thingsinlaurashand": "Ugh. I know this life very well. Again, thanks for being you and sharing your story with the rest of us. It’s a true blessing to see someone who reminds you of yourself looking back at you in this crazy world we call social media 💖", "ericaanderson_": "You’ve got a rockin bod!", "maceycharboneau": "@corndogprincess read this", "beccagilgan": "You’re beautiful, Jen! Thank you for being the amazing woman you are. 💛", "omamimini": "Jen 🖤 you make my day all day every day. Seriously.", "rachelpullen": "You are amazing! This is so true for me too. I so admire and am inspired by your vulnerability and honesty. I think your posts help a lot of people feel less alone in their own struggles, so thank you. Also, I just started reading an incredible new book by therapist, researcher and PhD candidate @hillaryliannamcbride called Mother’s, Daughters & Body Image [Learning to Love Ourselves As We Are] and its sooo good! Highly recommend!", "emilypoprocks": "You look like a pop star who's taking a break from learning her big ol' dance routine for an upcoming music video here💯", "chantel.alyssa": "Hair flip goals", "nlongo22": "You are gorgeous, but also brave, smart and strong. Inner dialogue is the downfall for all of us...keep being your awesome self!", "drjamie14": "There is soo much to love about your ANKLES (dad)", "reikakadlec": "👌🏼", "loveunicorntribe": "You're hot!!! 💃🏼❤️", "brodie": "That hip to waist ratio tho 😍⏳", "terrigetscrafty": "It’s like you read my mind when you wrote this. I prob spend half my day worried about how I look. I’ve been like that all my life, I hope one day to change. My daughter who is 22, has the absolutely best attitude about her body and it makes me so proud. Definitely agree that the newer generation have dealt with body shaming so much better than my generation ever did. Always love reading your posts!", "walking_kateastrophe": "You win the internet. 💃", "thunderwith": "I scrolled back up to check out your shoulders. She's right. You're right. Nice shoulders 👍", "topanga_vintage_market": "I see a beautiful, funny, wonderfully honest woman. I hope you're right about this gen. I worry about how internet porn is poisoning the well. Stay hairy, sistas!", "callmemazz": "Girl you look GOOD AF", "plsar": "Thank you so much for sharing! 😘✨💋", "mkatsharpe": "You are amazing. Keep it up. 👏🏻😘", "ambermac\nVerified": "Verified", "leezilg": "Amen!!", "gina_a_marin": "❤️❤️", "courtneyrenea": "Omg this made me well up. I hear you and thank you for putting into perfect words.", "keriann14": "I have similar feelings regarding myself. You are beautiful inside and out!", "zoemcintyreboukalik": "@jengotch wow. Thank you. So many of us fight the same battle, every damn day. Living here in LA doesn’t make it any easier. You have an army of us behind you and next to you trying to change the way we see ourselves and teach our children a different reality. Stay strong.", "hannahhj1989": "@brogan271990", "nikki_ransom": "My wish for you is to always be kind to yourself and be able to get to a place where you can ditch the backpack. That’s too much to carry. Thank you for this beautiful post. 💞", "americangarage": "Lookin lean already!! Keep up the hard work sis! 💪😎", "noelsmall": "Once again @jengotch I’m grateful to know you in these little squares. You get me every time! Thanks for being inspiring funny and honest! You are my role model 🙌🏻 (even though we’re the same age lol 😂)", "jessicabmoran": "Thank you so much for this. I watch all of your stories and can relate 100%. You're so down to earth and relatable and super amazing!!", "kellylaine": "👏🏼👏🏼👏🏼", "christinaffox": "I love this post. If anyone reading this ever decides you want mentorship and coaching in this kind of personal development might I recommend @jillkeuth. She is amazing.", "daphnagabay": "🙌🏻♥️", "shanolivas": "You are amazing. Exactly the way you are! ❤️", "lmaloof": "Awesome message! I, for one, am way harder on myself than I am about those around me. I am working on it and this helped! Thanks! See you in the ATL next time!", "gwdub": "Oh and the pressures of where you live! I get it but you.are.awesome. 💗", "littlemissfrench": "Honestly I think you're a hottie and you are so much more than just your body!!! You are brilliant and and hilarious and honest and although I have only seen you once in person, I think you are beautiful inside and out. I mean, how could someone who spends their life showing people how to live a fun, colorful life and wants to make people so happy in life be anything but beautiful?! Your heart is made of gold and you are gorgeous :)", "sarahasolis": "This is incredible, thank you", "katiezspeed": "@beauty_redefined ! You and jen should collaborate!", "milajames_xo": "You look amazing and I enjoy watching your stories and reading your posts!", "kerilies": "@solveig.elisabeth do you follow her? her instastories are awesome. interesting thoughts for your coaching programs...", "mallorieserene": "Love you, @jengotch ! ❤️ I look forward to seeing your IG posts and stories every day! You’re my absolute favorite!", "marburger": "You look so good girl!!! You have beautiful everything inside and out!", "beauty_redefined\nVerified": "Verified", "koolewilson": "So thankful for you!", "shaylienorton": "You are such a beautiful person, Jen. I wish you could see yourself through the eyes of those who love and look up to you ❤️", "allen_pam": "Good luck working on this. I have been for a long time and I can say- if you try it will change! It is possible. Another great way to contribute would be to feature models of all sizes on the shop bando site!", "berbo.studio": "When are you gonna write a book??? I hang onto & treasure every word of your posts 💓", "evangeliajardine": "You are beautiful head to toe (and you are also hilarious and honest and open, and that makes you a million times more so)", "nataliebschroder": "@jengotch Thanks so much for sharing this! I’ve struggled with body dismorphic disorder for much of my life. The trick is really just to accept what you can’t change, which is definitely hard, but not impossible. You are truly a beautiful beautiful for being so open about your own struggles so that your story can help others.", "bpugs": "🚨🚨🚨🚨weeeeOoooohweeeOooh BABE ALERT", "haleyhck": "❤️ love this post", "yasscamacho": "You look great!!🕺💕", "thelovedesignedlife": "I actually love those pants on you and think you look 🔥🔥🔥", "livkellis": "Amazing.", "_beckykimball": "Yes THIS is why I love you and follow you!!!", "kariannimals": "⭐️🌈hero🌈⭐️", "arisyowell": "Girl you pretty 💁🏼", "theslyestfox": "After working retail for many years I realized that 99% if women feel this same way about their bodies. It doesn’t matter what their size or shape is — we’ve all been told by advertisers that we aren’t good enough but we need their products to be prettier, skinnier, healthier, etc for so long that no matter what we look like, most of us still feel this way. One of my best friends thinks she’s ugly and overweight...and she’s a tiny size 4 — and a millennial. But she’s beautiful and strong and independent and amazing beyond her looks too. Working in stores dressing women of all sizes the #1 thing women hated about their bodies was their ARMS. Even the slimmest, strongest, smartest women were self conscious about that skin that hangs and moves when you wave. I hope you’re right that finally this is starting to change, and younger generations won’t feel this way, and that having people of all shapes sizes and talents in the spotlight and on fashion spreads will help. I hope for a future where we can all be happy with our bodies and realize that we are all beautiful and strong no matter what.", "frayed.fawn": "Jen - I think you are beautiful inside and out! I️ love your Insta stories. I struggle with having a warped view of my body as well. I really think various body positivity movements have started to help me tear down beauty ideals in my head. It’s so refreshing to see models of all shapes and sizes on the runways and magazines rn.", "vanalienz": "U literally make my day better with your words", "aprilram": "You are truly beautiful not only physically but for sharing your true thoughts. ❤️", "amberzon": "♥️♥️", "laura_willcox": "Gorg ❤️", "bethanynauert": "Thank you for sharing your vulnerability, it’s so refreshing.", "linendoesthings": "@annie.monty", "yayitsjamers": "I think you have an incredibly beautiful heart and soul and THAT is way better than a size 0. Your hips aren’t gonna change the world, but YOU are.", "laura.sulak": "“You’re just right.” That’s what I tell my daughters. And I do hope they absorb it... I totally understand how you feel, because I do the same thing to myself. I’m SO HARD on myself. I have a beautiful, strong, smart body with (mostly) all working parts at the age of 48. I need to keep telling myself, “You’re just right.”", "marylanecafe": "It's hard for me to understand how someone who looks like you, could feel the same way I do, but thank you for sharing. Btw I would kill for your body! I mean, I wouldn't stop eating donuts, but I would l kill 😜", "alexjean28": "Beauty! Own it: it’s our responsibility, because other women and girls are watching 💪🏻", "prettycrabby": "In the wise words of @sarahkatesilverman “my body is strong and it works!” That’s what I tell myself. ♥️", "daphnepuerto": "You’re perfect ❤️", "sgrubsnig": "Beautiful body!", "stleonardsmoderngoods": "I'd kill for your thighs ! but then that of course means I'm not accepting my own shape. So I just lost that argument 😁 You rock!", "jack.e.line.lugo": "😘😘😘", "kat_now": "YAHHHH!!! ⚡️⚡️⚡️💥💥", "kristen_shumway": "I had weight loss surgery a year ago. I've lost 100lbs. People tell me all the time how good I look. I still weigh 250lbs. I know I don't look 'good' but I look a lot better than I did. But you know what, I don't really care how I look. I did it for my young children. And you know what else I got out of it? Another baby. I'm 13 weeks pregnant and I did it on my own. My other kids were IVF. This is a miracle. Anyways. I am a long hauler and look so forward to your posts and stories. You've helped me understand my husband's depression more than he ever had. So I thank you for that. And if you're still reading this, you are a long hauler too! You are beautiful.", "corkieboltonjewelry": "Thanks for posting this sister! 🔥🔥🔥", "mbdirks": "You have a gorgeous shape!!!! Those hips are fire 🔥🔥🔥 YOU are fire!!!", "tara.veee": "I struggle with similar issues. My self image has its own set of contradictory inner dialogues; how I see myself, how I should see myself and how I want to see myself. Thanks for sharing something so personal! @jengotch You are a beautiful butterfly💓", "samkrayons": "Thank you ❤️", "el_camyino": "You look so incredible in those leggings I am now scouring online for similar one! 🙌🏼", "ashley.shelton": "I think you’re beautiful. But that doesn’t matter. What matters is there is only one you, and that is your super power. You have a healthy, functioning, powerful, great bod. I’m cheering you on & all the girls with the decades of shame the society & ourselves have put on us. 💕💕💕💕", "ashley_overhills": "Write a book, @jengotch !!! 😘", "erincampbelldunkerley": "❤️❤️❤️❤️❤️", "dooleynotedstyle": "I wish i looked that good! Keep up the good work on self love, we all need to do it more!", "saramoon": "I’m happy you posted this:) and I’m so happy it and you were received with so much love. We need more of it! 💗💗💗", "mckkmaldo": "❤️❤️❤️❤️", "littlearrowshop": "TOTAL BABE!!!!", "alimoyano": "You are the best!!!!!", "fanshen": "Love this pic, your words and everything about it ♥️", "heather.s.andrews": "You rock!!! Thank you again for your openness and sweet heart.", "mariterecr": "You are beautiful Jen, inside and out!! Wear that beauty with joy!!", "janettabanetta": "You're perfect!!!", "clairefraze": "❤️❤️❤️❤️❤️❤️", "veronicarossman": "Write a book @jengotch 💕❤️", "beckymsimps": "Absolutely. Victory noted. Thank you 🙏🏼", "kelliecockrell": "🙌🏼🙌🏼🙌🏼❤️❤️❤️", "jtree813": "You’re 🔥", "_victoriarae_": "You're beautiful!!", "sohappitogether": "👏👏👏👏", "kimgarvinferrier": "You are beautiful on so many levels Jen❤️❤️", "kitchentablenw6": "You look gorgeous, and incredibly healthy. I’m 5’2 and weigh 110lb, go to the gym a minimum of three times a week, eat well, and still look at my body with shame each and every day. Why do we do this? I’m around the same age as you, and think you’re so right about the future generations finally breaking this thought pattern. Once again though, you look great!! ❤️❤️", "annabrockway": "Love you Jen. Thanks for this. Connection!", "ali1124": "You have beautiful everything. You are a perfect size and weight. I would kill for your bod.", "cocoslade": "You are the cutest💕", "lovelyoysterhands": "You are beautiful! I just wrote about this! If you’re in the reading mood http://onourmoon.com/unlearning-negative-body-talk/", "tendies": "I try to be grateful everything works because one day I'll look back and wish I realized what I had. It's hard but be nice to yourself I think you're the best!!", "oliandc": "“Comparison is the thief of joy.” -Teddy Roosevelt You have so much strength in your body. Thank it for keeping you alive. It works so hard to make sure that happens, nothing else should matter. You have lived through and done so much in your short time on this Earth and you still have so much more joy to share. We are in this life once, don’t waste it worrying about something that you inherited. I am by no stretch considered a beautiful woman by American standards. I am Cuban/Ecuadorian-American and I am 5’4 and over weight, olive complexion with black hair. There are so many things I see and want to change, but then I think of where my body came from, the people who gave me my hair, my height, my muscles, my nose, my teeth, my indigenous features. I am here because they survived. That’s beautiful to me. Whenever I think about changing something, I think of them and how I am a part of them and then I don’t want to change anything at all.", "kamille_larsen": "You're beautiful and perfect and you do have great shoulders! I echo everything you said. I struggle too.", "thehipeagle": "You are wonderfully made! 🖤. Totally adorable & I’m digging your workout gear 😍", "kickanddinner": "So on target. Brilliant! It’s so sad that any of this crap matters but it does - when it shouldn’t. Arg! Keep fighting the good fight! Every BOdy wins.", "meglundberg": "I LOVE THIS MORE THAN I CAN POSSIBLY EXPRESS!! Thanks @jengotch 💕💕💕💕", "pinkparterre": "You look awesome", "missjessepics": "I couldn’t love this more it would be impossible 💗💗💗", "denisecrew": "I see a babe. ⚡️✨", "kelleymacdonald": "💛 this", "randomlysamantha": "You are beautifully perfect! ❤️", "shellionaire": "Love you and your ability to be honest and real. You're gorgeous ❤️", "abbiethegoodwitch": "I feel you girl. I’ll finally feel like I accept my body and that it’s beautiful and then I fall right back into my old patterns. I know that what I see is not what others see. You’re not alone, as I’m sure you know. But here’s just another voice joining you, understanding you and wanting to love myself better with you. Thank you for your honesty and authenticity. ❤️", "madrelinen": "word up sister! i am in my early 40’s and since age 14 i can’t remember a day where my body shape and size have not consumed the bulk of my thoughts. it is bullshit and it is a combination of my own neurosis mixed with the VERY NARROW beauty ideals i was fed in my early formative years. and i agree 💯 that our young people are a ray of hope and light and their resistance to be fed such garbage is truly awe inspiring- i am taking my own healing queues from my own teenage daughter and her friends. maybe the reward will be to finally live some days free of negative self talk in regards to my body. what an incredible weight lifted that would be! keep rocking your rad self and taking us all along for the ride! we all win thru your truth speaking! 🙏🏾", "mollybedford": "Yes to all of this. You are beautiful.", "beauty_within_me_": "I love everything about this post. Thank you. 😘", "erininsc": "Positive inner dialog is so key. It's something I've been vigilant with my kids about.", "jess_rooms": "Your perfect. Thank you for sharing this", "movedla": "Well said! As women no matter what size we are, we were trained from a young age to pick our selves apart. We need to figure out how to abandon these ideas of “perfection” and start celebrating who we are!", "harlow_jade": "❤️❤️", "nathaliajmag": "Your body is beautiful!!", "abbyrosephoto": "I’m actually crying 😭", "haley___james": "Gah, Jen. Thank you.", "bethanyderringer": "😍😍😍", "iamjrhamel": "Thanks for talking about this! 🤗", "delaneyynelson": "This is amazing, you’re such a gem. Thank you for this💗🖤🤗", "jennlanglois": "Gracias and cheers to off the shoulder fashion!!!", "laurenwhiser": "And you have voluminous hair! And you care about people and that’s probably most important.", "lizlibre": "❤️", "soapverdi": "Gotch 2020 @andrianaverdi", "swtkrzyjane": "Oh damn, you DO have beautiful shoulders! I WANT SHOULDERS LIKE THAT! 😉", "bellezzalillian": "Girl you look so fine ❤️", "katyaslife": "Yes!! Just posted about this on my feed today. We alll go through so much shit no one sees re our bodies. Thank you for sharing!", "kellyvaisey": "❤️", "tabithagrit": "❤️❤️❤️", "clairecatherine2": "👏👏👌👌🙏🙏", "danielle.see": "Thank you!! We all need someone as strong as positive as you in our lives! Beauty comes from within and you shine so bright!!! ❤️❤️", "jenn_sea": "Love this so much. Thank you.", "wildwhim": "@ninny_serene @murphys_parents @oldoaktree @glassladydi love this gal, her posts and insta stories are hilarious and so honest!", "warp.and.weft": "This resonates so much. Thanks for sharing.", "justagirl": "You are a fucking ROCK STAR. Brave & HONEST.", "hil_stodds": "We call that a hot bod.", "gloryceramics": "@jengotch girl, you only get one body this lifetime. Be kind to it because there’s no getting out of it. I always remind myself that it’s fleeting.", "honeymyheart": "You are beautiful", "mandymart": "Thanks for being brave and showing things that don’t make you feel great about yourself. It makes a difference even if you don’t feel like it does. ❤️", "kristinlafontaine": "Jen, you really are the best of the internet. I just love you. ❤️", "carolynbuch": "self love is the best and hardest kind of love ❤️", "joellen_randall": "@jengotch I was just told that my boyfriend of three years broke up with me because I had gained weight and was no longer attractive to him. This post is helping me get over his “view” of me and really anyone else’s view of me. I know I’m a really kind person and I treat people the way I want to be treated. Thanks for reminding us that beauty starts from within. ❤️", "fmior": "YOU LOOK AMAZING", "share.studios": "👏", "sarahmiranda02": "Hey ya hottie!", "aestheteinspired": "Busy working mom here and came across your #authentic post. Always love seeing authenticity in my feed. But srsly, your body is so 💯 I can't fathom how a creator of great potential has been bogged down secretly so long by this non issue!! 😱 Hope you find release from this and conquer some awesomeness. Hope other women find the same!! Don't waste another thought or breath!", "lilylovelock": "😚", "emilyjanelong_art": "❤️❤️❤️❤️", "bethaltimus": "We’re so kind to others and so rarely kind to ourselves. Great post.", "kateyhomer": "💕", "ginarockenwagner": "#3 !!!! 🙌🙌🙌here's to everyone working towards more diverse representation in fashion and thanks for this reminder that IT REALLY MATTERS!", "jennendoll": "What a gift you are. Favorite post from you ever, and that’s saying a lot because I love every single one. Thank you.", "kerrycrawford": "This is me. 💕", "brit.maclean": "This post is so important. ❤️", "gypsyjaimes": "@thesundays", "barij": "Oh man. Where to even start on this one. I so relate.", "cirilia": "Well said 🖤", "sousakang": "This is so profound...love it. ❤️", "destinieesco": "Do I️ spy @girlfriendcollective ?", "valealepena": "Ugh I adore your posts 😍 such an inspiration", "katie_b_is_me": "❤", "stephanie_matthew": "I️ watched it and thought, you look damn good! But, I️ put myself in your shoes and knew I️ would tear apart the pic if it was me in it too.", "jennypeters": "That there is a super cute figure - and I hope you can be proud of it someday soon!", "charlotte_pample": "Beauté", "hellofarrugia": "🖤🖤🖤", "celiayarwood": "You look SO good!! 💛💛", "yogadog": "Admirable @jengotch I believe we are the exact same age, so this resonates very strongly with me. Thank you for sharing .", "_coconutmoonbeach_girl": "Nothing wrong with your body you have nice arms legs you have a cute shape I think you’re funny you have a nice smile I have the watermelon cooler from Bando it makes me happy when I see it because I love 🍉", "being_little": "I've been feeling so similar lately. I know that I'm not \"big\" or \"fat\" because the clothes size I wear is really small, and I'm small in comparison to most of my friends... but when I look at myself I think I look huge, disgusting, overweight, etc etc. Thanks for sharing this and for being so honest. Hope one day we can both accept and love our bodies 🤘🏼", "wynterdepriest_": "You’re incredible. Also, you’re 🔥🔥🔥🔥🔥🔥", "nicolederus": "@jengotch thank you for posting this. Like most women, I struggle with the idea of what a “normal” body is almost daily. Clearly, we are not alone and we are all beautiful inside and out!", "rae_spiegel": "You are beautiful- inside and out!!!! ❤️", "imaladylikethat": "You look AMAZING!!! 💘", "joannakays": "What a beautiful post x", "curlyqchristy": "Well said! 😍", "mimosahandcrafted": "HELL YES", "wrightkitchen\nVerified": "Verified", "osuforprojectheal": "Thank you for sharing such an honest and important message about body image with all of us! We appreciate your realness and think you’re the best! 💜💜💜💜", "noduhasif": "@jehnglynn", "mobaker_": "Currently dealing with this exact thing as an engaged woman. Finding my wedding dress has been a true nightmare of huge proportions. I don’t want white or cream or blush or ivory - and that’s hard enough. But I’m also a size 14, and that’s proving even harder. I feel totally shamed and pushed into a box I don’t fit in. Totally a burden to ever bridal shop I walk in. Like they’re thinking, “ugh she’s too fat to be in love and happy. We can’t help her.” It’s been the most horrendous experience during a time that is supposed to feel joyful. I just want to wear my cozy pants and Strong Female Lead shirt and say fuck the rest. Thanks for speaking up and out about not feeling represented or wanted and about moving through the shame of those feelings. ♥️", "laurenbrimley": "I needed this. You described how I've been feeling for the past 20 years. ❤️", "ketchuponeverything1": "You look gorgeous here!", "tina_mageejenks": "You have beautiful everything, I’d kill for your pretty hips. ❤️ I’m trying so hard to be kinder to myself as well, it seems it’s a long process... but we’re slowly getting there.", "meaganwhiteley": "I was a long hauler last night. I appreciated your vulnerability. It was uncomfortable, but real. I 200% agree with you about all of that caption. Got my backpack full of needless weight and hopefully my son and his generation get rid of it. They’re doing a great job!", "michellemaros": "Beautiful", "stirandstrain": "💖", "nicolewear": "You are gorgeous. And the body shaming you speak so openly about haunts so many of us. It’s been this was for decades. Generations. I hope it changes for the sake of my daughters and their eventual/potential daughters, too. And all the women who come after us. Thanks, Jen. You have ignited a spark & that is both powerful & beautiful. And btw, your mom is right!", "dn.zzell": "beautiful babe. ♥️", "sarah_b_starr": "🙌❤️", "sonnetjames\nVerified": "Verified", "feelin.sticky": "Beautiful", "alanasaporiti": "Beautiful, beautiful! Well stated! You are a daily source of inspiration! Your rawness and honesty is beyond! Keep changing the world with those perfect shoulders!", "muffinsandglitter": "Yasssss preach girl preach. 💙👌", "imallieallieallie": "You’re simply the best jen!!!", "hannahnefler": "FUCKING RIGHT 💥", "preppyraven": "Jen you so need a reality show ! It would be so empowering for all women 💕", "jenn_trujillo13": "I relate to this so deeply it's almost like I wrote it myself. From one Jenn to another ♥️ you're adorable and so fun even through social media. I too have a lot of rewriting to do. So much love to you 😘", "samantha_rei": "Thank you for continuing to be open and honest. True beauty, inside and out! But I feel you 💯 on a lot of what you’re feeling. We’re here for you and thank you for including us on your journey! LOVE, always!!!💕🌹🌹", "idratherbeadiscoball": "This is beautiful! What an inspiration you are!✨💕", "hellovanessahope": "This long hauler really appreciates your openness, about everything.", "ashley_neese": "Yes yes yes to all of this. 🙌🏼🙌🏼🙌🏼", "theferalpastrychef": "I use the backpack analogy too, full of bricks like shame and guilt and trauma. It helps so many of us to talk about it openly, to encourage each other and to have safe spaces to heal. You’re doing so much for so many. You’re truly a beautiful person.", "kjennynelson": "Oh girl I have the same shape of thighs and I’ve always have a hard time with them, especially when all my friends have thin legs and can fit into any pair of pants they want. But I just tell myself I’m shaped like a Roman goddess or a renaissance babe in a painting! Also you’re beautiful!", "laurenlucybean": "You. Are. So. Wonderful. Thank you ♥️", "kellyamccartney": "❤️❤️❤️", "instabeardo": "You are a super babe and your brand is a positive force on women in the world! Don’t ever forget that.", "one_of_one_goods": "❤️", "_beatrice": "They are very good shoulders!", "anaisabeltextiles": "This is so good! ❤️❤️❤️", "melissathebeautiful": "Thank you for being so open and honest. It makes me want to be better about my own self image. You are amazing!! 💖💖💖", "calliopepaperie": "Lookin good girl. I hear every word of this loud and clear and could cry with jealously (but also relief) for the girls who won’t have to grow up hating their bodies. 💕💕💕", "desiree.pais": "You are beautiful", "maceopaisley": "#proofofhot 😌", "meghan.awalt": "You’re incredible. Inside. Outside. Your body is banging and perfect because it’s yours! Thank you for sharing your struggles with us because we all have them too!", "theboozybungalow": "I *HATE* how much brain space and energy I use (that could otherwise go to creative projects and generally just enjoying my life) hating on my body. I know better. But it doesn’t mean I can do better. Trying so hard to not pass it down to my kid and I think that will be my biggest parenting challenge.", "sarahyatesmora": "Ay yay yay. For reals. I think sooo many women (and men) of our generation feel EXACTLY the same way. That inner voice can be such an asshole. Sending love!!! 💛", "melindajosie": "Thank you so much for your honesty. Your posts are always so encouraging, (in that they’re not always shiny and perfect). You’re brave enough to say what we’re all feeling, and that’s so wonderful💗", "happilyme123": "Wow! So beautiful! xo ❤️", "posymarket": "You’re a beautiful person, inside and out and I’m so stoked my daughter will have folks like you to keep her head straight with all this body image crap! Thank you.", "ghost_babe": "Speaking of body-image.. it sounds like you’re on the right track, but honestly it would mean a lot to fans of you and your brand if you were more size/POC inclusive with your models. There are ban.do fans outside of your thin, white gal from LA aesthetic that would love to see people like themselves represented. 🤷🏻‍♀️", "jlolo72": "Aum. Those legs tho! How amazing are they? AND the fact you can rock an outfit like that...i'm envious and totally relate to the body shaming backpack. 😖 I look at myself every day and feel ugly at 45.", "kimberlykk": "Thank you so so much for this, you have no idea. People can tell you a million times over \"you look great, be grateful!\" But the permanence of self criticism never truly hears it, and it is something I battle with every single day of my life. Hours out of my day are wasted every day of my life and sadly, I'm not sure I can ever truly unlearn this behavior no matter how hard I try. Thank you for sharing with all of us here 😘", "ashleymorgan84": "YAAAAAASSSSS. You're a badass and beautiful to boot.", "philosophannah": "Umm how cute are you in this pic??! 😍😍😍", "emilyblincoe\nVerified": "Verified", "seabrooke": "You’re such an inspiration. I’m loving these real real posts. 👱🏻‍♀️🙌🏻💖💫✨", "djsarahlandau": "💜", "iam_alisanporter\nVerified": "Verified", "ashleykickliter": "Thank you for keeping it real, all the time. Your transparency is a force to be reckoned with in the age of social media where transparency hardly exists. 💛", "madmaven": "You have a gorgeous body! Curves are where it's at! I struggle with the same issues. Not to mention we never see ourselves exactly how others see us. We have only EVER been able to view ourselves through reflection of mirrors or mirrors inside of cameras or just any reflection really. Kind of strange to think of that.", "candicemcneeley": "such a babe ❤️❤️❤️", "veganizzm": "you’re a dream", "ruthyaro": "❤️", "vickichristine": "You're awesome. ⭐️", "melisamyers": "You are beautiful inside and our. Thank you for being given brave and inspiring the rest of us to do so as well. @jengotch ♡", "lostinlakes": "So loved watching your stories and knowing powerful badass women struggle with similar things and continue to rock.", "ohhhkris": "😍❤️❤️❤️", "jenna_aceandjig": "🔮", "charisse.kenion": "I hear you, and feel this. My husband thinks I’m a goddess and I’m really not on the same page with him there ❤️ We are our worst critics, but we have to accept that too I guess 💁🏽", "shizmcnally": "You’re beautiful inside and out, Jen!", "walkingmanstudios": "You’re gorgeous inside and out!", "thesparklette": "You are gorgeous. I wish I had your bod!", "nerea.eh": "You are amazing ❤️", "katydika": "#3 😢🙏🏻", "tammiecbennett": "Love you.", "scapeghost": "Thank you for sharing. I recognize a lot of these feelings. You are beautiful inside and out. 💕", "styleapproximately": "Jen, this is an amazing post that’s making me quite emotional. I’ve carried a lot of shame with my body as well and have gotten courage and love from the movement of the younger generations. My life goal is to work hard so that future generations learn the mistakes of the past and create a better world. Thank you for always being so vulnerable to the world; it gives the rest of us courage to do the same. ❤️", "mamainbloom": "Follow @nolatrees, Dana has helped set my mind straight on body image!", "chingy_lynne": "@jengotch Thank you for speaking up about this. Addressing body image issues is so important- vital even. Body dysmorphia is a very real thing, and it's not something to be ashamed of. It's crazy making but it can be dealt with - first step is acknowledgement and acceptance of the issue though. Ive dealt with this myself, and constantly challenging ones own self talk and changing thought patterns is tough, and can feel like an upward battle at times. It's worth it though. I appreciate this convo! Keep taking care of yourself. You're awesome! 👏 ☺️", "lindspruitt": "❤️", "so_cal_belle": "You are lovely! And I am so in this with you. I have this internal debate constantly between what I think, what I know, and what I wish I thought and knew! You are right about the current generation’s lack of body shaming. Sometimes, I’m shocked by that, but I also know it’s healthier and more inclusive than what I grew up with. Work in progress 😊", "paula_timm_artist": "🙌🏽♥️🙌🏽", "theparadisemaven": "♥️♥️👏🏼♥️♥️", "indeuhhh": "Your body looks HOT in this pic (and always)! But more importantly you look HEALTHY!!!", "thebalancedlife": "YES! And amen. I’ve built my business around this mission and am so glad to hear that’s the message you’re receiving when these conversations start. You are beautiful. And I understand the struggle. ❤️❤️", "merniemern": "What’s your strategy for erasing inner dialogue? I’ve been huge since I was 17 years old 114lbs at 5’6 — now I’ve actually realized my self image and I believe part of that was me thinking it true. 😒", "jennyeveryday": "❤️", "chloelist": "you are the coolest person on the internet ♥️💗", "mrslindsaythomas": "❤️!", "marlowreidwhite": "❤️", "ms_kimberly_orr_richter": "You’re 100% a knockout! Your sense of humor 🤯🤯🤯 so yeah listen to your mom. 😘❤️", "ben.pame": "👌❤️", "_madomarie": "You do have beautiful shoulders indeed. But really, you have beautiful everything! You are an amazing human, inside and out 💕💕💕", "romeroymiel": "What a beauty! Inside and out! Listen to your mom!", "steph_angelis": "✨❤️", "superpragmatic": "#proofofhot", "stacyyyhaavisto": "You are a true inspiration!! And I love how raw you are. People fear being raw, because it might cloud the way people view them. Isn’t it shitty how we can have it “all” and still be depressed and feel like total dog shit. As much as we want to look in the mirror or our check books, it never seems to be enough. How do we get there Jen?", "juliahocquart": "<3 differents countries, same thoughts about our body. the same one that helps us see the colours, hugs our friends, tastes food and embraces our future!", "mixmastermel_b": "👌🏻🔥🖤🌈", "baretboisson": "♥️", "z0a": "shoulders, legs, hips, face, life, inside & out. you're beautiful & talented & hilarious. an exceptional human.", "robdoglouise": "❤️", "kartella": "This! 💖.", "duckydubless": "Inner thoughts can be the meanest. But I see a stunner 😍💕", "bugfox": "Your a smokeshow💨 and that outfit 😍😍😍", "tarawhitney": "Loved the whole convo and you.", "jessmberg": "You have beautiful EVERYTHING! Thank you for sharing this post! Changing the internal self-talk and setting down the shame backpack is really hard work. But I wish you every ounce of luck in doing it. You are worth it!", "denarochelle": "With you 100%", "danielledeboeharper": "I have no hips and would take yours! Keep inspiring Jen! 🙌🏻", "jeanandjune": "❤️", "kabethany": "Gosh I just love you (even though I don’t actually know you ☺️) and can relate to so many of your personal struggles. You’re vulnerability and honesty is so inspiring. Keep sharing!!! 💖💖💖", "rojiiaar": "You are beautiful 💖", "jpies": "❤️🌙", "richesforrags": "👏🏾👏🏾👏🏾", "jamiemakeup\nVerified": "Verified", "sophpoz": "💕💕", "aleatoirefrancais": "You also have beautiful hips and thighs and knees and everything!!!!", "stoneybones": "Erasing inner dialogue. Something that CAN be done but is super super hard. I’m with you.", "off.kilter.mama": "♥️💖♥️"}