{"theclassixxvtg": "I love when you share from your most raw and vulnerable place. You are such an inspiration and i like to listen and learn from you. Sisterhood is strong. You privide so much strength and i only hope i can give and serve to other women the way do..Thanks for being awesome Jen. @jengotch", "healthyhappyhome": "@lyndaorme Follow her", "crispauel": "💕", "jensebringphotography": "I didn’t come here for the tears. But I got the tears. 😭", "codisilsby": "@crystal.alise this made think of our conversations last night 😘", "meghanhjensen": "I needed this today. Thank you!!! @tricialynn110 🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "reregal": "Thanks for sharing. We've all been there one way or another. 💜", "pugsofinstagram": "Thank you for being so amazeballs.", "artistwandering": "💗", "sugarfreemedia.co": "I’m obviously from the outside looking in, but I can’t see this as a failure. There are so few people meant to live out their whole lives forever together that it’s ok that you weren’t meant to do it. You took a risk, took a chance on love and to me, that’s a HUGE win and very, very brave. You didn’t do anything wrong, in fact, just by sharing this... you’re doing a lot right 💖 thanks for always being #real. - antigone 💖💖", "sandra_p_cordero": "@iec111", "fullmoonmedusa": "Brava.", "printpictures.us": "Very nice", "katerqburns": "@gemcam82 @bychloesue @missevanson @nikitasland @afterthoughtdesigns @e_r_i_nc this 💗", "nikitasland": "@katerqburns ❤️❤️❤️😘", "fastreader": "I feel, and relate to this deeply. Thanks for sharing your experience bravely and honestly.", "roastedkeyboard": "❤️", "sup_4_fun": "\"I don't linger or wallow in sadness\" #powerfulhealing #onwardsandupwards", "confetti.gt": "I Recently got divorce too, it’s the hardest thing I have ever been through but I’m super grateful because trying to heal from that I found myself, I’m still like “under construction” but I know everything will be ok eventually, thanks for sharing and being such great inspiration for me and many girls out there 🙏🏻😊💜🔮✨", "chrissykaszanek": "Long time follower, first time commenter...Divorce is so hard and so heartbreaking. (I share your experience) however, I just wanted to add that I really don’t think about it as a personal failure. You took a risk, you dove in head first, you followed your heart. Things don’t always end up as we plan or hope, but that doesn’t necessarily mean a permanent personal failure. Nothing in life is permanent and we are always re-writing our stories. Thank you for all the constant laughs, inspiration , confidence, and levity you provide to me, and many others @jengotch", "shilohklatham": "@kalinorton", "liapacita": "❤", "anneloveridge": "Thank you... i’ve been divorced for many years. The first time we hit, the mark, I’ve been divorced more years then we were married, stung a little bit. And I did see it as a personal failure for years, but it’s something I had to forgive myself for and him. To this day, some 20 years being divorced, something will happen and I will miss him because he was my best friend. Thank you so much for writing what you did it was beautiful.", "oh.anniee": "💖", "wildb_99": "Really helped reading this. Mourning the past and fearing the future is hard. Regretting things you did (and didn’t) say. I’m glad you’re healing 👍🏻", "soltouchhealing": "You speak powerful words for self acceptance and I congratulate you! Also: I don't know your story or the dynamic between you but to be \"accused\" of \"moving on\" doesn't sound healthy to me. As if you shouldn't let your life continue, as if the loss and lessons should be scars. Don't let him trap you into suffering as a sign of the love you two once shared.", "sfgirlbybay\nVerified": "Verified", "tcd1973": "❤️❤️", "martinimisty": "This broke my heart and then healed it again in seconds. Keep inspiring people like me and...yourself. ❤️", "allison_pentheny": "One of the most beautiful posts I’ve ever read. Thanks for sharing. ❤️", "que.vie": "Beautiful. Ty for being so transparent. Loss is hard ❤️❤️❤️", "megwlove": "Ugghhh yes. I dated my ex husband again 4 years after the divorce and he broke up with me via email 2.5 years after that! It’s been almost 3 years since that breakup and he’s been remarried almost 2. I am doing SO AWESOME. And I don’t care so much about how he is doing. Will always have love for him and wish him the best but I still have a lot more life to live that doesn’t reside in the pain of the past. What a fucking miracle. Thank you for this.", "rosiemrogers": "HONEST POST. 💕 for sharing and feeling those feels 💕", "misslalem": "Thank you for this. It's been a year since he moved in with his girlfriend and two and a half since he told me his truth. It's so helpful to hear from other women about the loss during divorce. It helps me remember it's not just me, I will find/create/enjoy my whole self again. 💜", "thechristinereport": "Be well.", "emmawreed": "@cheelo.sith", "hommeboys": "💖💕", "leulah74": "Love is so hard- this is so eloquently expressed", "lisapalmer": "I couldn't have stated those feelings better. Thank You. & you are amazing! 😘", "erinrigney": "Helps to express it and be truly honest. It makes you more powerful", "thisismimikate": "Girl, you exemplify strength, courage, love and light. I appreciate you and your just the right amount of RAW. Thank you for just being you and sharing your story.", "we.r.titans": "Not a personal failure. Just what happened.", "lydiarusso": "This was beautiful to read, we all needed to hear this. 😘", "brookekwise": "Thank you for being a real, authentic woman 🙌🏼 RAW", "amysuddleson": "So proud of you for speaking your truth! My ❤️ is with you! As a professional organizer I make a lot of these file tabs for clients. My client are too paralyzed to deal. So today I commend you for keeping your papers organized and for being accountable. Each day will give you strength and from one woman to another - YOU ROCK!", "marshiebcakes": "💖💖💖", "womenshistory\nVerified": "Verified", "cleanwash": "💓", "occasionallyeveryday": "Been where you are, & looking back, it now seems more a part of my path than a personal failure.👊", "soft__animal": "💗💗💗💗", "maggiemason": "Oof. I’ve been there. Someone smart told me that she was excited for me when I was in the thick of my divorce. Here’s to new first kisses, and the someone waiting to fall in love with your quirky, self-aware, crazy fun sweetness. ❤️", "amy_club": "Hugs your way!!!!", "styledbycristina": "Thank You for sharing.", "emiliearel": "I started following you last night and (even though i don’t believe in this stuff) it was i think because i needed to read this.", "belmabal": "@seanxyu", "krystleyoung": "Raw. Thank you so much for sharing", "balancebymolly": "Oooof. So much truth to this and can relate so so much. Thank you thank you.", "lacroixsoverboys": "We’re all on different schedules 😭", "carly_ashdown_art": "Thank you so much for sharing, incredible raw, thank yt💛🙏", "cathywmcintosh": "Thank you for sharing so honestly.", "ladyswill": "👌😌❤️", "kellydraws": "Too relatable. Thank you for being the realest. Love you, Jen!", "jillmeg80": "Well said.", "averymaune": "@jameym35", "misskarine79": "Thank you. Very real", "plain_tif": "So raw thank you", "carrie_beau": "😘", "thejcompany": "Thank you for opening up. You know there’s a man that will never let you down. That fills those voids and emptiness in our hearts. His name is Jesus Christ. He died because of the love he has for you. He is in love with you. Ask about him ♥️", "anainvan": "Thanks for sharing! I will never understand why it’s so helpful to know others go through the same crap I do, but relating and seeing lives being lived fully post-D fills me with joy and hope. THANKS", "instatracey": "You are a wise beautiful human.", "nk.bennett": "So very powerful❤️thanks for sharing your heart with us!", "karolinalipinski": "💓", "gretchenmariehunt": "Make space for new labels, figuratively and literally. You are powerful & resilient.", "bindsyoutome": "I love you. You help me a lot with my own shit. Please keep posting what you do. You are a good person you know. Just wanted to say that. Oh, and very beautiful and stylish too. 😊Jx", "watcher_inthe_woods": "Your sadness is just as valid as your happiness.", "sophiabush\nVerified": "Verified", "suellengregory": "Beautiful - true - hopeful!", "toshaballard911": "You are so real ~ the BEST ~ juicy! THANK YOU 😘😘😘", "whenalysparks": "Same girl. Same.", "letterandlark": "Xo", "themedicalmodel": "❤️", "messytresses": "💜💜💜💜", "ninadyer_": "Didn’t want to scroll past this but anything I write seems trivial since we don’t know each other. An emoji doesn’t seem enough and saying ‘I see you’ sounds creepier than I intend it to. Maybe ‘I’ve read your words’.... no, sounds cold. Should have stuck with an emoji. 🕊", "dakinistudios": "Thank you for this. I’m going through divorce and feel so alone- which is odd since so many people go through the same thing. This personal failure is a hard thing to talk openly about- but it sure helps. So again, thank you.", "oliandc": "All the love for you ❤️", "traveltouria": "Thank you for being so open and honest. I think lots of people can relate to what you are feeling and it is very brave of you to say it out loud. Wishing you all the best and sending good thoughts your way 💕", "the_petrichor": "❤️ you are such an inspiring human bean @jengotch xx", "hazumi_moments": "Thank you for being so open and vulnerable, @jengotch. Hit Home big time. My healing process is much newer, and it feels unfathomable to think that the wound will ever fully close, but I think the comment about the tapestry of your life growing around the hole is absolutely accurate. Sending so much love ♥️ and positivity your way and to all the other amazing women here commenting and opening their own selves to being vulnerable in this moment. 😘✨💫", "belindalovelee": "You're so amazing I so appreciate your honesty and vulnerability.", "madamegracevintage": "Weirdly, mine ends tomorrow (34 yrs) I don’t know you so not sure why I’m sharing but there ya go I just did.", "fitbusynurse": "Wow I just came across your profile because of @tylerjmccall and this hit me smack in the head. Last year was the hardest year of my life.... this was the topic of conversation the whole year.... while we both didn’t want to give up, it was clear I lost my identity because of it.. I even created my new Fb group around it using that experience (http://IdentityMe.club).. so I can relate on many levels. We are still a work in progress but now know I will survive no matter what - even with the huge gaping hole... you have so got this!!", "jojosnackcakes": "Pure words! Thank u", "bonnietsang\nVerified": "Verified", "emilyaragonacarter": "Beautifully said.", "foxandfinch": "Future-you is gonna be so grateful for emotional documentation like this. Sending you love from my heart!", "jessmcdougall": "I would name that file HOPE - so every time I looked at it I saw future instead of pain.", "mariterecr": "You’ve got this Jen. Thanks for opening your heart to us ❤️", "claudine": "Sending love your way. You will get through this!", "vavaviolet": "This was an incredible read. Sending you light and love❤️", "pearl_lucille_netzley": "So many feel divorce is a failure. I don't really get that. I'm divorced and failing never crossed my mind.", "the_woodenpalate": "Thank you for sharing that. Even after a divorce, moving on, finding someone else, there is that little file of sadness tucked away for you to stumble upon every once in a while..", "melaniesantos.co": "HONEST GRLZ ARE THE BEST. 💖 WORLD CHANGERS.", "meeshull": "❤️❤️❤️appreciate your vulnerability and willingness to share your feelings. I like Instagram for looking at cute shit but I mostly like it for strong, dope women who are honest and talk about raw emotions, thanks for being one of them❤️❤️❤️", "sarahmiranda02": "You are amazing!", "cmtowle": "💜", "wild.grace.grit.and.magic": "Thank you for being so beautifully vulnerable. This world needs openness."}