{"not.a.square": "@jseegs23 THIS.", "socialandlattes": "It does.", "saradarling": "@noelcreates 😉", "bkkroon": "@meliss212 Yep.", "lucipamplemousse": "Why does being understood make us want to cry? I’m gonna get a peer reviewed study on that. Either way: yes yes yes! So beautiful. Thx @busyphilipps for posting about your friend so that I ended up here", "baconsma": "@brooker13", "brookekwise": "💙❤️", "charmschoolfrances": "I’m glad you wrote this.", "artistwandering": "under the weight and in the water ❣️ i can see the shore though...", "recycle_sister": "Hi . I am new here. But I get it too. Recently I just keep thinking of a Homer Simpson quote \"can't somebody else just do it\" ✔️", "snow_wolf_girl": "I will always have depression and anxiety. All I can say is DBT helps more than anything has. Of course, it is still THERE but DBT was transformative.", "_donna_d_": "Just found you through Sophia Amoruso. Great feed:) Stay awesome:) I have a website to help folks with substance use and mental health. Here is the link for the mental health:) Maybe it would help some of your followers. http://www.pickawareness.com/mental-health.html", "maryaden.art": "@brandifeatflorida", "theconsciouslifestylist": "Fortunately my shower is broken right now so I don’t have to tackle that task. Got my anti-d prescription from the doctors 3 weeks ago. Still avoiding them 😜", "katiedetrich": "@haleyaseitz", "stacimagnolia": "This is how I feel a lot. This is why my house stays a mess. @kassivl", "_rin_mar_": "4", "heysugarrex": "Yes. 😂💖👌🏻✨", "nurse.sonja": "@kazakattack this feed 💕☺️", "bunny_shoppe": "Thank you for this.", "cindylpearlstein": "@berkpearlstein you should follow her! Inspiring ❤️", "abbie221": "@rlytle3113 wow! This is everything.", "amyhoerler": "So 👏🏻 much 👏🏻 yes 👏🏻", "jessica.gulati": "Thank you for keepin' it real!✊🏾", "amyevejo": "nail on the head. thank you!", "remixedinterior": "It’s the constantly having to push myself to do anything and everything that is exhausting. I just would like it for once to be easy..", "houseofgabriella": "This nails it! Me, I’m always afraid that it takes over again. Doing pretty well, but it’s like the depression is always lurking and waiting for a vulnerable moment to take over. It’s exhausting; have relapsed before, don’t wanna go there again. Proud of each day I’m out of the darkness. 💪🏽", "leahlaniskincare": "You have a way with words and expression- thank you for shedding your beautiful, bright light on this topic Jen! ❤️☀️", "magicalaseffie": "Not doing good. Curious to know what medication you’re taking. I heard it in the instastory once but didn’t recognize it", "hannah_a_hill": "@cree_bev", "lindsaygreendesign": "I can relate to this. It's encouraging to see someone so successful feels the way I feel. I often feel like I'm doomed for failure and while I know it's the depression speaking, it's hard to tune out. So, thanks for this. Also, i think someone who unpacks their suitcase immediately upon returning home is a psychopath.", "lisache.n": "♥️♥️", "kierstentruley": "@jessrjensen", "huxleyhousevintage": "@ferminaliseauxdelamancha", "anniesheeran": "This is the best synopsis I’ve ever read on this f-er of a topic 🙌🏻", "twittywitterson": "Am so thankful for your putting-of-words to this thing @jengotch ... DMed you and would be really thankful for a guidepost I could share with my doc. XO.", "floweredsplendor": "This is very inspiring and uplifting to read. You are an inspiration for all of us that struggle with depression and anxiety 🤗 your posts on this always help me look at things from a step back and recollect and reevaluate. Thank you for being open about this!", "katemiss": "Omg I was just telling my therapist that being on new medication (and therapy) that makes me feel even better than “myself” (whatever the f that is) feels like having a super power 💪🏼 You can conquer the world when that weight is lifted.", "butterflywingsandhurricanes": "I wish I could relate. I spend most days at about a 7 thanks to meds, despite really hard times right now, but thanks to the having the flu on top of fibromyalgia, I'm at like, a 2. I've failed or had taken away from me everything I have tried to do with my life. I really do think it's awesome that you made your company so successful, but damn, it's gotta be a little better than schlubbing to your dead end waitress job, barely putting food on the table, knowing all the potential you've ever had has been flushed down all the toilets of the world. I am truly happy for you, I am... But please forgive me if I don't find it inspirational right now.", "obliviabrien": "I LOVE this. Thank you so much for this simple explanation.", "meldubie": "You said that phrase in one of your recent posts and it made total sense to me.", "suzso": "So true. Annoying and hard. 😢", "lalanaples": "Unloading the dishwasher is too much lately...just use the clean plates until it is empty again...", "sarahwellmeier": "Read this!! ❤😙 @jamiefaulkner", "claire_kramer_mackinnon": "You are amazing. Don’t forget it❤️", "yourkompas": "This is so lovely! Thank you!!!", "aimeeneff8": "@laceybabona", "kierstenohman": "Thannnk you for this!", "pipared": "😘😘", "lacey_alderson": "@dsalderson", "meghantonjes\nVerified": "Verified", "saspunke": "Word!", "francesca__palombo": "You’re so yesssss", "kelseyzahn": "Amen", "ohmeedofficial": "Like 3.2 but you give me hope @jengotch!", "aabbiiggaaiilll": "I feel feel this right now", "bernabrettpeters": "New tumblr. New planner. New throw pillow.", "beth_moon": "All day sister 🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "_candygram4mongo_": "I feel you. It’s amazing when you can live like a “normal” person", "_angelicajay_": "❤️❤️ I’m getting there", "superchris77": "youre my hero ❤️", "samscookies": "@bethany.cook.773", "saramarietexas": "#amen you are amazing @jengotch truly an inspiration!", "xjessicapedraza": "Finally came into work and I just got news that my parents have 3 days to move out a house they were scammed into losing 🍾 you inspire me to continue and just keep working hard for my dreams 😭😭💫💕💫💕💫💕💫", "lollykw": "I’m so glad for you. I’m having a great week too, and I look back at a few weeks ago when I wasn’t so great and I feel like a different person.", "azoreanprncss": "So happy I stumbled upon your Instagram. Very raw and honest...truly inspirational, and for a fellow sufferer, very much on point. You are so right! I wish for you endless “Super Power”!", "_yungcor": "💖💖", "am_lau": "Love this thx. Just returning to work after a long Maternity leave (to American standards) and feeling the need for some “super powers”", "genkijo": "@ms_nawma 4.1", "kayleighart5074": "This is so inspirational. I like the way you describe it and I am feeling the way you described. I’m probably a 1.5 today.", "aoifuscuervus": "@ohkarinoh", "brantlea": "Ditto", "suzanne_vermorgen": "Thank you so much for sharing this! I can relate so much to your post. Sometimes even chewing my food is too much. Today I'm at an 8, so I'm super-social and am wearing 2 perfumes, Mon Paris and something from Victoria's sextet.", "letterandlark": "Thank you!! Some days I wonder why on earth the very simplest of tasks seem soooo difficult and I can’t seem to get anything accomplished. Been hard on myself about it because the “normal” me would barrel through and get stuff done no problem. So frustrating to accept and realize and then to know how to move forward some days!", "84thand3rd": "💙", "bableson": "@jengotch so full of wisdom, you're honest & inspiring words that document your journey with depression are all I have sometimes to keep me fighting my own battle with anxiety & depression. You're an inspiration & keep fighting the good fight you truly wonderful person. x", "dvandylion": "Not my best day but I did make 2 phone calls and returned an email so I’m ahead a bit. It’s a 3.1 day.", "larissaelliott": "Geez. This explains most of my 2017. Thank you, Jen Gotch.", "rebeccajanedee": "Thank you.", "paperandwillow": "💗", "petkanasophia": "❤️❤️❤️", "jencat_kilburn": "5", "pflummers": "Low point for me the past few days and most of 2017 I was operating at about a 2-3. Hoping to shed this depression weight soon. It’s hard as hell. I admire your courage to speak so openly. You don’t know how many people you’re helping. I also feel like we have similar personalities: creative, funny, goofy, love to make people laugh. It’s strange to often be both ends of the spectrum. Glad you’re feeling well @jengotch Much love you to! ❤️", "mcin1910": "This made me feel so much better today 🖤", "emahunadyova": "Keep going!! You CAN do this ❤️", "yourstylistjackie": "I can't even go to Walgreens or any store without wanting to stab someone's eyes out. And since I have herniated discs and because of medication laws, I can no longer be treated for my anxiety...they made me choose which is worse (which was very difficult) but the pain is worse so now I'm left to just hope I don't end up on an episode of Snapped. Ha! So a 7.2 is pretty damn good! You are awesome my friend!! 😊🌹", "eyemash": "So accurate @lillgentleman", "louloumh_x": "@elliebellefm you need to follow this woman. She deals with her depression in a really candid, honest and sometimes hilarious way! I love her! Xxxx", "meg.doy": "Thank you for sharing this and always sharing your experience so candidly and beautifully! Keep fighting.", "myrries": "@nielsreinders", "emlown": "7.6 today 😊", "irisrivares": "@cielomeh 😊😊😊", "kcrowleystratt": "Oh gosh, I can so relate. I remember being really overwhelmed at the thought of shampooing my hair. And so many other things that are just routine for people who are not seriously facing depression. It is truly amazing and inspiring and just plain emotional to see how really routine and easy and mundane things can be, once deep depression isn't driving the car. I'm so very happy you are feeling better!!", "mrslilien": "For realz 💊🕳💊🕳💊", "ariel_bl": "V annoying. Always..", "lahlahlah24": "So well said . So much truth and honesty. Takes a strong woman to put it out there! Keep up the fight , Jen.", "seasick.sunflower": "@jenmaferguson this me rn", "tourdetodd": "Yes it does.", "scarlettnicole7": "@cody__huggins", "_lcoti_": "This simple message is really really helpful ♥️🙏♥️", "allisonkoss": "Please make this into a shirt!!!", "raquelli.h": "Thank you for your rawness and honesty 🙏🏻🙏🏻 It is much appreciated", "janessapk": "@callmejacquelyn 💗", "mariannebrutondesign": "Jen, you’re amazing! Just keep going! You’re getting there! 🦋", "neptuneandcove": "I was about a 4 today, but I know it’ll get better soon. I’m so glad you share so much about this! You put it perfectly.", "hedymoe": "❤️", "ashdanley": "So happy to hear someone being so happy! I’m... trying.", "allisorrigby": "I'm really grateful for your voice.", "thingsbright": "🎉🎉🎉", "sparklyunicornteeth": "I love this so much!!!!", "mackenzielmoore": "@sarahmackenziespooner this explains my struggle last winter perfectly. Like to a T how i felt omg", "maddie.sensibile": "Thank you @jengotch", "julianaramus": "Yasss @jengotch 💪🏻 I appreciate this & you", "dbuerli": "Amen", "elise_whoa": "This is so on point. Needed to hear this today 💜👌", "waxinmama75": "A slight depression kicked in for me January 1st. I don't know what triggered it, it's been a long time, it was a stranger for quite some time . Is it the pressure of starting a brand new year knowing we have to try to do so much to \"BE HAPPY\" not sure if that makes any sense.", "_moon_flower_mama_": "@mamalovebug_melissa", "halfthestory": "So freaking true.", "amyewhaley": "@jengotch What are you doing for your depression? I need help. 😢", "chicagocc": "❤️", "emmagrinkme": "💖🦄💖", "desertbeauty21": "Not good...", "beckycooke": "When you shared this in your story I had an epiphany. Thanks. Jen, your transparency is helping others.", "bestillchildd": "Fucking thank you! 💫", "hlcclh5": "Thank you!! @jengotch for being so honest and sharing! I don’t think people really understand how hard it is just get through a day with depression! I hosted a small gathering of ppl over the holiday,something I’ve wanted to do for years but always had “something”! I’m recently changed jobs, and holy shit, I didn’t realize that the environment was toxic in so many ways!! Each day is anew day and I’m getting to my happy!!! I think a 7.2 is fucking fantastic!!!", "45threemodernvintage": "You’re Amazing!", "btzick": "something i loved! @becca_la_joy", "marilynmillar": "I love the comment, \"Mental Mud\". Perfect. Best of luck.", "_lianedesign_": "Live for your stories and posts! #inspirational", "miss_lovely_l": "Yes and yes! So annoying!", "ashbrookeross": "Thank you for sharing this!", "camillertime": "💛", "reticialeis": "You are my hero. I’m so proud of you. Please, keep sharing more about your experience with depression, it really helps me a lot. Like not feeling alone or strange.", "dek44": "This is so totally true.", "ksexton1222": "❤️❤️❤️", "december.me": "😄So Annoying!!!", "glamchiclifestyle": "Thank you! Such a great way of explaining it.", "votekat": "Thank you for posting this!!", "frenchie_collective": "💗💗💗", "seabrooke": "Maybe like a 3.7, since i did shower today. And laugh.", "laurakristine": "@shutterbean sending you so much light and love 💕", "ashleyll0132": "If you’re willing to post here, what treatment options have you found most effective from your perspective? I’ve found the task of seeking treatment overwhelming with a heavy work load and something that has been dragging on only to be tended to in those fleeting high moments. I get treatment will vary widely among all sufferers, but I’d welcome the chance to hear from you as an one who manages to be high functioning despite that weight; you carry and face it well, much respect and prayers your way.", "cbaboojan": "Thank you for spilling your guts to thousands upon thousands of strangers to help us understand what it means. It’s a sneaky little devil that can eat away at families. You help those of us who don’t experience this be better humans to those who do 😘", "april330i": "🙌", "visually.melinda": "@bright_and_green", "hevdabev": "This is everything. My husband and I can believe how accurate this is!!!!!", "jesent": "@akirk_5 this is spot on for me. How about you? Also, this woman is very silly and funny. You should follow her. 😉", "tzoma_": "❤️❤️", "oh.hello.gato": "Thank you 🙌🏼🙌🏼🙌🏼🙌🏼", "sophie_stimola": "TRUTH 💪🏼 I’m at a solid 5.9 today and it being Wednesday and I haven’t gotten done half the things on my to-do list for is the week is really bringing on the guilt thick. But hey, tomorrow is a new day, right?", "lovethebuttons": "this @bissycook", "cx.n23": "🙃🙂 so true.", "shivycakez": "how’d you get to a 7.2?", "amyjomakespizza": "👍 super appreciating your honesty and explanation!", "hopecavell": "@drtimcavell", "these_wild_hearts_": "Ya it does. Much appreciation to anyone who can put it into words 💗💜", "ashleigh__flynn": "This makes so much sense. I'm new to recognizing my own depression. Sometimes I think \"Why am I so lazy?! Why cant I just put one foot in front of the other? Seriously, just do the freaking thing.\" Knowing that others understand, helps so much. Keep sharing, please. XO", "breannajackson": "🙌🏽🙌🏽🙌🏽", "nicole.mccormick": "PUT 👏THIS👏ON👏A👏SHIRT", "sweetbabboo": "*This* really spoke to me yesterday. It explains why everything has been annoying for the past five years. And, why having returned to my career field doesn’t feel fun but just feels like one more annoying thing.", "jamesburial": "Shirt in men’s medium thx.", "mrsemmaball": "Had an anxiety attack today. Bipolar and all that comes with it kicked my butt today. Thank you for this. You’re my favorite. 💗", "joanne.dolan.design": "It's amazing how accurate this simple statement is. I've been hovering around 4.5 lately but can't seem to kick it. Drawing inspiration from you though. Thank you fornyou", "jenrotertwheat": "Truer words have never been spoken", "denisecrew": "Thank you for this! Validating", "licicox": "@senoritaelena truth", "eura_lee": "Mud is the best analogy", "olsen_kelly_": "So thankful I followed you 🙌🏼", "amynicolefloral": "I love this so much, thank you for sharing", "nikkirap": "About a 6 today. 💕 thank you for your openness.", "hauteinmykitchen": "I’m low today but seeing this helped. I’d say I went from a 3 to a 5. 😘", "infinitevisi0ns": "Look into Indigenous plant medicines, there’s a cure for your depression 🙏🏽", "octoberhello": "❤️", "foreverambie": "You said this in your stories and it’s stayed with me all day. I have a life time history of depression, but have managed it naturally for a bit now. My dad passed in August and I’ve been asking myself-you okay? Is this grief or depression? You hanging in there? I can’t tell... but your insight pretty much simplified everything for me. Duh, yep I’m depressed. Everything feels hard, not worthwhile or plain impossible. Thanks for your transparency, it’s helped me so much. I’ve made an appt to talk to someone today and I appreciate the nudge to tackle this before it gets worse.", "anecdotecandles": "Thank you for your candor and transparency! We need more of this.", "robinboyko": "Thanks for being an awesome successful woman that is truthful about her behavioral health struggles. I’m married to an awesome man who manages behavioral health hospitals but that doesn’t solve my own struggles with depression, anxiety and ADD. (Shoemakers wife has no shoes etc). Medicine is helping, but I wish I had some sort of important platform to help others realize how normal and common this is. We’re all not going to go crazy, it requires medicine like any other health issue. Thanks for being inspiring!", "teawithb": "So glad you are coming through it! I'm about an 8 lately and very much relate to your feeling anxious about falling back through that veil into the mud! But for now I've decided I'll take this opportunity for all it's got and get cracking into some new plans 💕 it's so good to read life stories like yours, so thank you for sharing 😊", "lotusland13": "Could not have explained it better myself. I find when I am feeling “good” I rush to try and finish things out of fear that depression will rear it’s ugly head any time out of the blue, and make the simplest of tasks feel monumental again.", "cellett": "😳! You (+ your therapist) nailed it! I love your stories + your shameless open-bookness. You are a rock star and a sparkle of hope. Here’s to stayin out of the mud! 🌈", "vanessainboston": "my ptsd symptoms work (don’t work?) very similarly. sort of thankful for this storm in the NE so I can practice #selfcare on my own time tomorrow.", "didi_beck": "oh my god, TOTALLY @jengotch", "well.by.design": "This. 🙌🏼", "gimmemynikkers": "@jengotch First of all, I love you. Second, I’m not too far behind ya today... my anxiety is getting me though.", "__kdilillo": "Thank you for always sharing all of this! It really helps people like me to know that there are so many others that struggle with the same thing. You rock girl 👍🏻", "topanga_vintage_market": "About a 5 but this post made smile. That doc sounds like a keeper!", "laura.gwinn": "At about a 4.8.", "georgiafresh": "Amen, sister! I'm at a solid 8.0 today. 🤗", "sundayforever": "Ugh, doing things 🙄", "live.love.lail": "This is the best quote!", "jenniferyarnall": "I identify with this post so much. Thank you for sharing your journey. I’m in the 7’s myself. Trying to add balance and not forget who I am. Not easy when you’d rather not get out of bed for the day. I struggle with the expectation to be “on” for everyone around me. That’s my current challenge. Faking it is so shitty!!!", "falweezy": "@becky_bird Yep, good rec", "johnnygirl1": "Omg I feel like you’re describing me right now. I want to know what the other me is like. Please share how you lifted the weight off. 👏🏻 congrats to you!!!! What a feeling!!! 🌷💝🥂", "nsbeebe": "@jengotch I have only recently found you. So nice to read what I often feel. The not knowing what each day or moment holds is one of the scariest parts. Thank you for putting yourself out there for the many of us struggling. XX", "juiceboxmedia": "So well put. ❤️", "bobbileebrooks": "Feeling the weight. All of it", "loveshine1": "This was perfect. My husband is bipolar depressive and while I know how much he was struggling, this summed it up so perfectly. He didn’t want to do ANYTHING. Luckily, he has been a different person for almost 3 years now. I know slipping back in the mud is a daily fear of his.", "everwillalove": "This has been playing over and over in my head all day", "jenvictoor": "Happy for you Jen! ☀️🎉", "heatherpocket": "Depression plays out in mysterious ways.", "pinklv": "This is so real...thanks for the post!", "katehomyk": "#TRUTH", "musings_13_": "I love how raw and open you are about your depression. This quote nails it!! Today I am about a. 6.11 😆", "thelovedesignedlife": "7.2! that’s fantastic!", "_malrose_": "yesss 🙌🏻 you go girl ✨✨✨", "megnelli": "Full of missing people", "mary.hoyland": "This simple statement is so eye opening.", "thisrezlife": "😄🙌🏼👏🏻", "cherish_this": "@mr.lukecooper I’m not lazy 🙌🏻", "charitymadrid": "If it ebbs and flows and changes and strange-s ...somewhere in the back of your mind you might remember that it can and does get better. That's life and that's unfortunately mental health for some of us. It's awesome, on point! Then it's not quite there anymore. Back and forth. But every time you reach the dark, try to remember you fought back to the light before and Damn. It. You can make it back to the light again. The irony is you have to fight for it when you can't even move an inch off the couch. That's depressions not so secret weapon.", "stephs_stuffs": "Thank you for always putting what I’m feeling into the perfect words. Today I’m 6...I’ve been better but I’m still getting things done.", "brentwoodhello": "Jen... I don't know you but you help me so much. I am so glad you are feeling good.", "melaniexyz": "your success and story give me hope for myself - that someday I too can found a company like you and be successful, even with the weight of depression on my life. thank you for your honesty and transparency. I am glad you are feeling better. 💫", "theycallmesb": "Yes. Yes. A THOUSAND TIMES YES. 💗✨", "gwdub": "I saw your story this morning and thought that's dead on right! Still struggling some with that feeling but better than before. Glad you are at a 7.2!", "colelong": "Thank you for sharing this!", "ohgollyholly": "At a 5. Maybe a 4. I hate witner, and it's the closest, darkest one we've had in a long time...", "ejkmom1998": "7.5 today. Feels good.", "arbitrarybee": "@theglassowl yup", "flowersandgarbage": "Fuck, I am so happy for you! I want what you have, girl. I want it so bad. Thank you for being an inspiration.", "azcostello": "I am really happy for you. And that explanation is so accurate.", "chowarddc": "About a 7 myself. I barely know me!", "helloarielchristine": "👏🏽👏🏽👏🏽", "kristinnelena": "I appreciate your transparency. It’s giving me hope getting back on my medicine, after a month of not knowing who the fuck I was and being angry at myself for not being able to accomplish the most simple of tasks", "fastmaddy": "I was in a depressed state for 4 yrs living in a city and state that I didn't connect with or feel at home in. The depression led to unhealthy amounts of drinking and eating in excess. Going out with friends and walking around would help a smidge but when laying in my bed I was alone with my thoughts of anxiety, sadness and feeling meh about life. Then a trip abroad, my first time traveling alone, changed my mood. Some how I felt empowered and recharged unlike ever before. I realized that some days it's ok if all you want to do is sleep and unplug from the world. Constantly filling my day with activities and people wasn't healthy. I needed more me time. Then I decided to get the fuck out of dodge, did a solo cross country epic road trip back to what I had always considered home. It's been 3 yrs since that decision had been made. 4 minutes ago, the movers left, my stuff is finally in my new home. It took some time readjusting but with each little step things are looking less meh and more hopeful... anxiety is present. I'm currently at an 8.5... with no outside influencers.", "littlethingslikethewideworld": "Made my day", "keenmachine": "@lannon787", "ohfritzy": "Same. Doing better everyday!", "lynseyacraig": "Constant battle. The fog seems thicker this time of year. Day at a time x", "mreen14": "Very happy for you!! and so appreciate your authentic and open posts. Helpful for me to understand how this affects people", "torema": "Thank you. ❤️⭐️", "omamimini": "unpacking suitcases the second I get back from the trip (because being depressed and OCD is no picnic) 😓 but it just consumed all my available energy for the day so I’ll just hate myself for the rest of it! I’m in process of getting off Celexa because it made me feel like I have no feelings at all but now I’m not sure it was a good idea 😬 still somehow all these holidays helped so I’m at 5.6. or even 5.8. glad you’re superpowering away!", "mspoisondwarf": "So true, and who ARE these fabled people that unpack the night the come back from a trip...", "fempineapple": "Depression told me I don’t need to run my errands today because they are dumb and I don’t want to. I did it any way #EGBOK", "tristenjnelson": "YES! I’m struggling with this right now. I seem so “happy” so it’s hard to see from the outside, but this is so so real. I often think about what I would be like if I was operating at full speed!", "lexlowdermilk": "@jennasomogye 💞", "sugo2go": "5.87... functional, getting some things done but with \"Clean Bathroom\" still on the list for a few weeks. You're inspirational today, though!", "atomicglittercollector": "This is so accurate 😭🙌🏻⭐️ I’m at a solid 8 today, and will ride this high as long as possible!!", "melseesyou": "Constant battle. Especially in the winter!", "mancalledmace": "I couldnt get out of bed yesterday. I think January is the worst for depression...the cold....the dark..... yuck. But today was a better day :)", "immiyk": "Thank you thank you thank you!!!", "lindseydub801": "Girl, you are magic! ✨", "megkellymegkellymegkelly": "Such truth. Thank you thank youuuu for this ✌🏻🙌🏻", "ourhavenseven": "I’m a 4:(", "christinalanae": "Beautiful story and so brave to share it! You inspire because you are you #weneedyou @jengotch", "ashleysixto": "I love how open and honest you are about what you go through on the daily. Don’t know you, but wish I did! You’re an inspiration.", "kriscorinne": "How did you overcome it all?", "maura_andrsn": "💘💘💘", "shizmcnally": "You’re wonderful!!", "nikkinacpattiwac": "Thank you for sharing this. Some people don’t understand and don’t have the care to understand how debilitating depression and anxiety is.", "joiebutter": "100 times yes. Thanks for sharing - I feel like I’m less hard on myself since watching pieces of your journey. ❤️❤️❤️❤️", "racheltapscott": "@jengotch", "elleebeans": "This is so perfectly put! Can't wait to see what's in store for you❤", "awkwardribbon": "Honestly, things are really hard for me. My dad was just diagnosed with the same brain cancer my mom had 20 years ago… my mental state is constantly shifting… but hearing others who are going through their own mental struggles and winning? That makes me feel like there is a light at the end of this very long dark tunnel. I’m so glad I started following you. My favorite bipolar fashionista!!!", "laura__rogers": "Well said", "cirilia": "I felt this way when I started taking meds for anxiety. I was like, “is this what regular folks feel like all the time?! What the what!!”", "hillary71": "Your honesty and openness is amazing. It is helpful and makes me (everyone, I bet) feel less alone in all this. Today is a 4.", "lolland": "So true", "fabiemarie": "@jessemichael_", "jaspr_co": "Fkin’ preach.", "lanovello": "💛👏🏼 you rock!!!", "yamileth9": "I struggle everyday my family just thinks I'm lazy and don't care but it's so debilitating I take cumbalta 90 but it's like my mind is use to it in the last 7 years I've divorced, 2 parents passed away and I've become care giver to an elderly family member ? Wish me luck", "alli.elizzabeth": "🖤🖤🖤", "hat_h": "@leahnicole_x3", "iheartbrowniesofficial": "Waking up every morning with the fear that “it might be back today”. There’s no warning, it turns up an announced and unwanted. Today I woke up with a song in my head. Today I’m a 9 🙋‍♀️", "noelleryannne": "6.5 today for me which is SOLID ✨", "rorieborie": "I’m operating at a 3 right now. Trying to will myself out of bed to drive my rent check over to my Landlord’s house by thinking of a way to treat myself. I can’t even decide on a drive through Starbucks coffee or a stop at a Mom and pop donut shop (we don’t have a lot in Portland).", "ariannawrotethis": "I’d do you", "richiedesigns": "Yay!", "vangoghawayy": "This made me so happy.", "jonnarayofsunshine": "❤️❤️❤️❤️❤️", "lettersbykristen": "Today, a 2. Hoping for better days ahead. Thank you for your honesty and candidness about this topic, and for caring enough to check in with people you don’t even know.", "fionzone": "New sweatshirt? In a myriad of sizes?", "cmck_": "🙌🏻 I watched your story like five times yesterday.", "lynziferg": "Right now I’m sick as well so I’m at like a 2.", "ben.pame": "So happy to read that ✨✨", "fun_fettti": "Jen don’t give up girl !!! You’re strong AF ! Better days are coming 💖🙋🏼‍♀️⚡️⚡️⚡️", "julianneelizabethb": "Wow! This is exactly what i needed to hear today! Thank you for your raw honesty about something that so many don’t understand!! Weeping all the tears for this truth, thank you!😭💪🏻", "miranda.rights": "Please tell me what you’re on cause this Wellbutrin and Lexapro combo may not be for me anymore", "krusethroughlife": "This needs to be on a shirt or print!! I’d buy it!!", "gabycacheris": "you are one of the bravest and most amazing woman I read and hear about!! The company is incredible and your authenticity is one of kind ~ you are killing it !!!! 🌟💖✨🦋🦄", "misscarleyp": "Not good today or lately, but hopeful. How did you get out of the mud?", "stephgaelick": "AMEN", "inkandfable": "I’m at a 5 today", "kelleyreierson": "This is very good. Thank you.", "joslynpickens": "so true!", "hi.impaige": "OMG YES!!! I’ll never forget a conversation with my doctor... she asked how my depression was and I said ‘ It’s like I’m sad about nothing and it’s really annoying!’ She laughed and said... what a great description... I feel the same way about this one!", "megkdickson": "Thanks so much for the honesty of this post, it's all so true and the world needs more help understanding", "nikitazook": "I’m doing good today too and I know what you mean about that being. kinda scary. Like when is my brain going to and revert back to hopelessness. 😬 But YES to appreciating yourself for whatever you are.", "omgitsjpax": "YES come thru with this truth! Living with depression is being able to run a marathon (I’ve finished two with flying colors) and another day (or week) being unable to shower, feed or care for myself. I am either productive or doing nothing at all. Still looking for the right treatment for me. Glad you are feeling good today! 💜", "mindybyrdlegs": "Thank you so much for your honesty! ✨💕✨", "xo_kristimeow": "🙌🏻 @missjewelsie", "lizzzy.bee": "6.5 👌", "ms_nawma": "@genkijo This.", "kgolier": "So true...appreciate your honesty.", "contentbylaur": "Never have I ever read a truer statement. Love this!", "cirque_vieenrose": "Aaaaaall of this.", "happypillofficial": "So unbelievably accurate and eloquently stated. You’re not alone! And you’ve definitely helped others recognize that through your work and through this post ❤️", "laurenrieker_rd": "YAAASSS!!!", "kkmar": "4.1", "holisticgangsta": "8.76/10 😎 love this so much", "prprprprpriyaaaaa": "🙌🏻🙌🏻🙌🏻", "whistlindell": "I dreamed, again, that I had to kill my abuser. My new vacuum is about 4 feet away from me, and the carpet has never been this bad, but sitting with my dog is all I can do.", "mrschelseacook": "New ban.do T-shirt idea?", "mrsaprillowe": "So needed this right now. I just forced myself to the gym and sobbed through a slow 1 mile walk, but hey I got there! Today I am a 2 but hoping for improvement", "broderick2011": "🙌🏻🙌🏻🙌🏻", "judelin1": "⭐", "seshepard": "That's awesome! So happy for you!", "hopefragrances": "Sending love and hope your way 💛💛💛", "planesworkshop": "You honour those of us who suffer from mental health problems by sharing it with the world and showing everyone that you can still get shit done. Huzzah!!!!", "mitzeye": "This is wonderful to hear!!! Keep fighting the monster that lurks in many of us...it will NOT win today 💪🏼 7.2 for the win!", "clumsy_peaches": "So inspiring! Watched your insta story yesterday when you said the same words & they are so true.", "alittletex": "So proud of u! My mom is bipolar & my husband is depressed. Its a daily fight for sure. I dmd u yesterday. Any chance u could share u dr name? My husband desperately needs help with meds. 😘", "truthannn": "The highest number you’ve been since I’ve known you. A TRUE JOY to witness 🎈", "analouisesilva": "It’s so true. I’m good right now too!", "ninfaarana": "Same shitty feeling different year is how I’m feeling 😔", "lillyvan1lly": "✨🌈✨Jen Gotch, you rule!❣️", "panda_colombo": "I think I'm about 2-3. 5, tops. I remember having been on 7-8 a couple times last year.", "wclifford": "🙌", "lindseycrafter": "✨🌈🍾🙋‍♀️", "katelynaprile": "💪", "kristinafichtel": "@courtelizzabeth", "thisthatblog": "🙌🏻🙌🏻🙌🏻", "kellyleecoop": "I'm at a 1- totally lifeless.Waiting for my 2 o clock therapist appt as we speak!", "ultravioletkids": "Seriously though!", "madrelinen": "word!", "pho.tog.stad": "@brynnashleymcc !!!", "asmalootah": "@jengotch what did you do to help you ? I would like to hear from you :))", "elizabethrolf": "Makes doing things THE MOST ANNOYING", "jacksfoodla": "T shirt", "michellefuntime": "This keeps looping in my brain making way too much sense.", "micaelahoo": "So happy to hear you’re doing well. Been following you ever since I started blogging in 2008. (I featured your polaroids on my blog yearssss ago when I discovered your Flickr.) On to bigger and better things for 2018! (PS I got my ban.do agenda personalized with EGBOK thanks to you introducing the acronym to me!) 💕💖", "koolewilson": "I’m 43 and have been off and on medication for anxiety and depression since I was 18. I started taking CBD oil three weeks ago and I am REALLY starting to feel consistently better. I also worry that this won’t be a lasting change but here’s to hoping for the best for us both ❤️🙌🏼", "meganvcraig": "You’re amazing, and I love your honest sharing about your mental health! I’m at a 7, I think. I’m on a cleanse so mind is a little sleepy but I just had a dance party with my kids and I’m no longer freaking out about this year. Had 2 panic attacks last week out of nowhere so I’m grateful to be well!!!", "shutterbean": "I’m at a 5. Trying hard to be good to myself. It’s not always easy. Thank you for that golden nugget of a quote. It’s so dang true.", "melissafromspace": "Amen", "clarissa_orion": "I screenshot this yesterday too 👏🏻", "cescadarling": "💕", "alexisteasdale": "Keep at it, you're doing great!! Don't bother worrying that you'll lose that super power. You can't lose it, it's within you and always will be! Keep pushing to keep it at your finger tips. Very inspired by you. Sending sunshine from Sydney", "briannaontheweekend": "@the.emmashow", "lexigoesthrifting": "💕💕💕💕💕💕", "stephurwitz": "I watched your feed and wrote down that quote. Says it perfectly! Thanks for being you!", "missbespokepapercuts": "Yes yes yes! And it seems so much harder with the New Year and all of the additional pressure we have shoved at us (new year, new me, ny resolutions yada yada nope). I cant seem to get back to it this week but I think if your heart aint in it, then it aint in it) x", "frecklesandgingerdresses": "So happy you've made it out of the mud my dear x", "lacesinyourfaces": "Not great, but fuck, I'm trying and that's better than NOTHING. Which I've also practiced the fine art of in my depression hey day. I relate so much to you and sincerely appreciate your transparency so fucking much. I lost a brother to suicide, divorced my husband and best friend of 15 years (that brings loss of all sorts as you know) all while trying to deal with a new relationship that is stressful to say the least (PROBABLY BECAUSE OF THE DEATH AND DIVORCE). Anyways, I wish we could get drinks and talk shit. You seem cool as fuck. Keep on keepin on girl. I'm at 6.4 today 👍", "cyd.nie": "Thank you for this", "maryallisonyancey": "7.7 on the up and up!", "momssacredskincare": "I would say 4,2 today. Maybe up to 5 after doing yoga. Been better. Thanks for sharing your journey.", "theglitterinmytea": "Um yeah. VERY well said. I’m an 8 today! Doing good!", "cinderellasmith22": "@jengotch Can I ask what the new medicine is? Trying to get to where you are and have been struggling for years to get up beyond a high of 3.5.", "ange_who33": "I’m on the same medications as you. It’s great in the beginning. It took me a few months of ups and downs to find the right Lamictal dosage. Keep on going girl.", "chey2xo": "How did you get through it? What is your #1 tip? The days have been hard for me to get through. I appreciate you sharing your journey.❤️", "alypie5000": "🙌🏼", "stephscher": "love you Jen!", "sherise.lee": "So true. Annoyed with myself all week for not getting much done.", "kt_grayy": "I think most people refuse to unpack suitcases. 😑", "soniapserranos": "Today is a better day. I didn’t breakdown crying so that’s a plus. Just taking it day by day.", "honeymyheart": "So good to hear this, and see you Shine.", "projectpiper": "@notsosilentk 👏🏻", "t__brooke": "Yes. 💪🏼", "lovemesimply": "So happy for you. But ugh I’m feeling like shit this week. My meds had me on a rollercoaster over the fall and then I was feeling great. And then my sister died December 10th. And now I don’t know if I’m sad from that or my depression in general just needs better managing with different meds. There are moments I feel spunky and motivated, and then quickly deflated and 1000% uninspired in the blink of an eye. Ugh.", "iluvjry2": "I’m about a 4.5 today.", "doingjust.fine": "I'm operating at about a 1.2 these days. You've kind of got me thinking about trying the bullet proof diet though.", "makethriftlife": "This year I'm focusing on self care and have started the #selfcareselfiepledge you should join us! Neglecting yourself is the first sign of depression setting in!", "lindseykbennett": "I have never related to a human more. Thank you for your posts and for illuminating what so many people struggle with! Your posts motivate me when my brain can't motivate itself", "runfettiofficial": "I sometimes explain it as getting out of bed alone feels like 100 obstacles are already up, so if one thing goes wrong and there’s one more obstacle in my way, the task becomes impossible. I also don’t know how I used to accomplish so much. One day I hope to even come close to what I used to do...", "touchyfeelyfeelings": "Including getting up to go the bathroom! I’ve definitely woke up needing to pee but just couldn’t summon the will for such a banal chore and went back to sleep instead.", "babyboybakery\nVerified": "Verified", "rachel_sitner": "💯", "sleepy_king": "Yes 🙌", "4oclockapple": "Truth!", "herenorthereshop": "Bang on. I need this conversation. Just selected you as my mentor at Create + Cultivate. I feel for creatives, depression gets lost and buried beneath a shield of art, crafts, projects etc.", "___emmajane": "@toe.ws", "anna.hintz": "A solid 4. Fighting with your other half never helps.", "lifeunstyled": "I want what you’re having! The first week of the new year and I’m still waiting for the gloom to lift so I can feel like myself again. I’m happy you’re happy though!", "graciiejenkins": "🙌🏼", "mandicooper_": "This is so well said!!! 💕", "danakbortz": "I was wondering that myself!! How did you do it!? You are amazing, Jen! Thank you so much for being so candid with sharing your progress and process though all of this. Please make a YouTube channel your IG stories give me life 😂❤️", "meowandforever": "Same", "kristin_spence_yoga": "Fuck yeah 🙏🏻", "floralislands": "Literally same. And I’m california and it’s still got me by it’s ugly depressing claws ¯\\_(ツ)_/¯", "inyourbones": "It really is. Today I’m a 8.2 but would love a nap", "nolongerwander": "That can be so true", "team_kate": "Loved your story. It's so true. Happy you put your stuff away after your trip 😂 I have the same problem. With everything.", "mrshaydee21": "OMG yes.", "lucysheridan\nVerified": "Verified", "franberrypie": "Make this a sweatshirt please!", "ohsusana1": "Im about a 6.5 today :)", "alysa.ashly": "I truly love this. My husband didn’t understand why I wouldn’t get out of bed, and finally I can explain it simply! Thank you! Today I’m at a 4.5. But I’m staying hopeful.", "1800flamedame": "Glad you’re doing well Jen! I can say that I’m also doing much better, I’d say I’m a solid 8 lately. I have a new job that I enjoy and I’m good at, and I’m feeling empowered with my hobbies and passions. Definitely still want to find a therapist though.", "w.oostie": "Life in words.", "radishriot": "Thanks for posting this Jen. I’m struggling in communicating with a loved one and I’m trying everyday to be better at caring for them. Reading these helps me understand and helps me ruminate on how to be kinder and how to help. Thank you!!!", "em___mcgovern": "The magic of eating brain nourishing foods; so glad you’re feeling it in such a powerful way 💥💗", "beautifulbraincollective": "Great way to put it!!!", "beardy.glasses": "Truth", "almostsammy": "at a much lower number, but these encouraging affirmations remind me that that number always climbs. thank you ❤️", "gabriellegalatoire": "mmmmmm i'm at like 5.3 ish!!!!!!", "six.word.memoirs": "⭐️⭐️⭐️ so true, and this is a great Six-Word Memoir. Much love to ya, Jen!", "csedwards": "Hearing you say this on your stories yesterday was a lightbulb for me. Maybe I’m not lazy.", "alexislaurelhughes": "Since this was on your story yesterday it's all I can repeat to myself. Truer words have never been spoken. I'm about a 6.7 today", "tarawhitney": "We are in such similar places. Also feel like a stranger and afraid to wake up with “the spell broken” 💯♥️", "atlassupply": "Preach", "s.oco": "thank you for this content though, I have no idea how to talk to anyone about this crushing weight lol", "mosscottage": "💕💕💕💕💕", "kosmokrista": "<3 love this, I'm at an solid 7", "hkflife": "Truth", "saramizjackson": "Loved this. So true.", "artbyashleyrebecca": "You are amazing 👸🏻", "melodrama": "💯💯💯", "danyeee": "So so so so so true. Thanks for always being honest and enlightening!!!", "malorimaeva": "Currently at a 6ish.... up from a solid 4 earlier today. You’re the bestttt", "susanwatchesalotofmovies": "4.5-5.5, but I made a big skillet cookie so now I’m at a solid 7", "kaarins": "Like a 5.2 so okay but not the ray of sunshine I’d like to be", "chilledroses": "The quote of the year"}