{"disraeledis": "É realmente assustador vc estar super mal, no buraco e depois de alguns dias vc se sentir bem novamente. Estou passando por isso essa semana.😢", "rubinaallana": "💛♥️💜💛♥️💜", "thefwordgiftshop": "❤️❤️❤️❤️❤️❤️❤️", "gel_gel_gel_images": "Jen, this is reality. This is my world, and I’m thankful that you can show this reality! Thank you!", "texangeleno": "A couple of years ago, I started planning my own funeral. I was only 45 but my world had been slowly collapsing for over 20 years at that point. Meds, therapy, family, friends, and my basset hound saved me. I still struggle sometimes but make a conscious effort to focus outward as well as take care of myself. I’ll never be perfect but we’re all pretty damned fabulous. 💖🙌🏼💖", "smushnick": "❤️", "janecerrrss": "As crazy as this sounds this was beautiful, vulnerability at its finest thanks for sharing Jen 🌺🧡", "zanklaren": "I was scrolling through your posts today and saw this. I know this person. I see her every so often. I just want to let you know that as a 48 yr old woman/Mom/wife/etc, who suffers from depression and anxiety, I totally appreciate you and all you are doing!!! Thanks @jengotch!! As much as I look forward to seeing what you’ve posted every day, just do what you can do!!! Always look out for number one!!! Those of us who know this will completely understand if you need a break!! But sending love and thanking you for your bravery!! 😘💕👍🏻", "nicole.harrisss": "Poor Jen! @jocruickshanks this is Jen just a few years ago. 😮 she committed to big change and did it! I gotta do it! ❤️", "bugslife_609": "@madichambs", "pienyada": "♥️", "sheipz": "@nathaliemperez", "becca_ruth_robbins": "Feel ya.", "alexandrahstockton": "@trevorstockton", "jocelynmathewes": "Thank you for sharing this. I found you through Accidental Creative and it’s really wonderful to see someone talk about this with having a huge platform and business. Makes me think that my tiny little corner can be powerful in its own way as I battle my own demons. 🙏🏼🌈💕", "keelyhenryschutz": "How am I just now discovering you via insta? Thanks to @jessicahonegger for sharing. Felt so damn good to share like this on my ‘other’ insta @namamama_blog", "toponico_": "@shakeyuhbonbon @tashrozid", "leviagee": "Holy fuck this is powerful. You just got yourself a new follower. Thank you.", "sup_4_fun": "#bravesoul ❤️", "emmeowly": "Thank you for this, I needed it 👏💕", "coralieroman_studio": "❤️", "makeupbybracha": "@zahavahuretsky", "mrs_perley": "❤️❤️❤️❤️ this just made me cry! I can relate to it so much!", "theneonmuseumlasvegas\nVerified": "Verified", "katnip828": "You probably felt safe at your parents house & you knew you could let it all out. I admire your honesty. We r all on a journey....u just happen to have SEX HAIR!", "gennadraper": "You’ve got this shit! Even if you don’t, I’d imagine there are peeps in your life that will hold “it” for you, and hold you up in between. That’s what life is all about. 🙌 Now get after it!", "milknmuse": "We I all entered this space and hit an emotional low, feeling overwhelmed by all of the yes's we have said... Breakdowns for me are breakthroughs now. People ask me what is your dream, at 35 my dream has changed, I have re-framed it so that my focus and energy is discerningly channeled to the right place. I love your feed, the highs and the lows. One thing is for sure u r not alone in your lows we all experience them, so long as we don't run from those feelings, frantically trying to make the feeling go away or filling that void will not serve our highest good. Thank you for sharing and blessings to your spirit xx", "mohalaeyewear": "Such a powerful post. Thank you for the strength you had to post this. You are an inspiration to so many people and I can tell there are a ton of people in your corner cheering you on. Wishing you lots of love! ❤️", "gut.nutritionist": "❤️❤️❤️❤️❤️❤️", "mrsrachelbecker": "Thank you 🙏🏼 you have no idea how helpful your posts are", "_jennifercrawford_": "@kyager72", "worthythreads": "Wow such a moving video. What an inspiration you are", "lcassidy662": "Thank you for your bravery to share", "eat_your_greens_and_squat": "What a moving post and so brave of you to share. Thank you, more people need to talk about mental health, because suffering alone can be hell. x", "lacymartindesign": "Thank you", "nicole_jane2": "You are so brave.", "monicamorris_jav": "Thank you for sharing such a personal moment. This thing called life takes us through crazy loops and to have such a raw moment to remind yourself ( and others) that no matter what we go through we have the strength to bounce back. Thank you Thank you Thank You 🤗❤️", "decoratinghomelovecrafts": "gods hands he is in control", "how2bewhole": "Hugs from Htown. Thanks for the realness. One breath at a time. Sometimes when days are hard, i think about just making it to the next breath. Here’s to making it! 💛✨✨", "brimfulshop": "❤️👌🏼", "artbymegan": "Thank you for sharing this. Xo", "jessamaephotography": "Thank you for posting...hopefully others out there with struggles can see they are not alone ❤️ I know I’m grateful to know others understand! Each day is a step forward!", "pinprick": "🙏🏼❤️", "jessica_k_miles": "❤️😭❤️", "ponilab": "You’re just amazing, kid.", "falcongriffith": "💗💗💗", "elljaystudio": "Thank you", "lmstephens33": "Brave heart. 💜", "shukrans81": "💜", "tiffanyfisher10": "❤️️ thanks for keepin' it real.", "cherylsphotography": "Thank you for sharing this realness with us.", "captainsuzy": "❤️", "erintsanchez": "This is actually me right this second. Thank you for being my friend in an I’ve never met you but we hang out on your stories, kind of way.", "lorijo47": "@jengotch I am grateful for this real raw moment", "jennithegreat1": "We love you! Thanks for posting", "kate_1969": "I love you so fucking much. Thank you for being.", "sobremesa.zam": "Thank you for your honesty.", "carolinapinoa_": "♥️♥️♥️♥️♥️brave and bravo!", "joshturnerd": "@kateagilbert", "kitty_o_hello": "This breaks my heart and makes me feel safe at the same time. Safe knowing I’m not alone in this.. thank you 🙏🏽", "nicolewear": "So brave.", "collection_no": "❤️❤️❤️", "courtneybee76": "Thank you for sharing your journey with us....you are such a strong woman!!!", "jfims": "This is so real - thank you for sharing. You’re not alone ❤️❤️❤️", "erinsobright": "🖤", "coachpenelopecruz": "Your authenticity is inspiring 💕 ✨ thanks for being so courageous in sharing your journey with us", "johannalynn88": "You are strong and beautiful!", "danielledeboeharper": "So important", "cosmakery": "You are so strong for sharing!!! Thank you 💕", "mandyofish": "How amazing that you can see such a powerful change in yourself. Thanks for sharing", "recreatedlinds": "So brave to share and it provides such an important perspective for everyone. Beautiful in so many ways.", "teenagekikks": "You're amazing. Don't ever forget that! All the best to you!!! 💖", "laurmcgrath_": "❤️❤️❤️", "jennisprints": "You are so awesome!!!! 🙌💪💕✨", "mrsjennabooth": "I’m thankful for you!", "missarielchiang": "This is beautiful Jen ❤️", "jennifergrahamchittim": "Thank you for posting all the real real and not just the Instagram filter life", "nancy_redesigns_1940s_home_": "Way to go Jen !!! Life is a work in progress. This shouldn’t make anyone who’s ever been through anything in life uncomfortable! Happy to hear you’ve grown and made changes to help you feel better ♥️♥️ hugs 🤗 xo", "lolliswim": "♥️♥️♥️♥️♥️♥️", "micaelahoo": "It is SO important to remember where you came from so you track your process. Life is such a long journey and we’re always focused on what we want to do next, we often forget how much we’ve already accomplished. I am so happy you’ve gotten to a place where you’re appreciating the moment. I once heard someone say you should keep two lists: one list of accomplishments and one list of failures. Tape one to your bathroom mirror (or any other obvious/well-traveled space) and keep one in your underwear drawer. It’s up to you which one you choose to keep where. Look at the visible list every day and refer to the list in your underwear drawer once a month.", "beanstagramxo": "THANK YOU so much for posting this and for your honesty. I'm trying so hard to get through the rough patches that just seem to keep coming back, and questioning how my poor mental health will ever let me be successful as a creative person and a designer where so much of your success depends on your own motivation. I'm so low right now but you've just reminded me that it doesn't last forever, and although it does resurface from time to time, I can still have hope that the gaps between those awful bits will get bigger. I'm glad you're feeling better at the moment xxx", "marneyjoyce": "Thank you for sharing! ❤️", "eva81er": "Know the feeling <3", "mollymarler": "@jengotch you are a superwoman superheroine SUPER human. I love you and thank you!!! You are beautiful and so strong in your vulnerability. 💙", "peach8888888888": "Keep going I am going trough a very difficult time and just I do everything I can cry it out talk to people you trust write pray meditate do everything you can 🙌🏼 there will be times of calmness and times of storms, there are times when we doubt we will ever be happy again.", "overtherainbowunderthesea": "Thank you x a bazillion for sharing this. While the focus is always on moving forward, remembering the process of how we got their is just as important. You’re amazing 💗", "minipiccolini": "🙏🏼", "urbansocial": "❤️", "dawnskisutton": "@jollywollyholly Powerful stuff 🙏🏼", "_hayleyrothe": "❤️", "kseniafilatova": "❤️🙏💫", "moula_bux_shaikh": "Hellooow y ?", "kristen_abell": "“It’s uncomfortable to move towards wellness when you identify as someone who is often unwell.” - ALL THE THIS. ❤️", "annabschu": "😘😘😘😘😘", "lydzbidz": "This resonates, thank you", "alejandraporta": "👊you are so brave thanks for sharing.", "yuareacinema": "Thank you for sharing this. ❤ It's important to be able to reflect and also shoe others that there is hope.", "cz3lsea": "This is the kind of humanness and raw honesty that makes me give you my $14 for a tumbler with a straw instead of TJ Maxx. And also why I follow you in social media. 7.8 is pretty rad.", "jessibandaid": "Thank you for this!", "scorpion.teeth": "Thank you for your transparency! You're so brave @jengotch", "thesavoyflea": "Courage & strength comes from your respecting your vulnerability. You rock @jengotch. Thanks for making this bizarre world of tiny square scrolling more real.", "pamelalamama": "Thank you", "streetbox": "🙏🏻🙏🏻", "m_o_m_o_t_a_r_o": "😭💪🏼❤️", "schmeggoleggo": "THANK YOU", "maisonmelrose": "Thank you!!!", "christarenee": "You are amazing for sharing! Cheers to 7.8 😘", "73stephanien": "Thanks for sharing, I thought I was doing ok and the bottom dropped out a few days ago. ❤️", "randifitmom": "💋", "imastabile": "You are a brave cultural frontrunner. Thank you.", "azoreanprncss": "Thank you. This was incredibly brave but so real and so true!", "flutter_and_folk": "You are so very brave, thank you for sharing your journey so honestly. It will have helped so many fellow ‘surfers’ feel so much less alone. Stay strong and stay balanced 💜.", "iamkimberlycross": "Thank you!!!", "elissiarose": "🙌🏼❤️", "liz.williamson": "😘 courage. It's raw and impressive.", "shrimpsaladcircus": "Thank you for always being brave enough to open up.", "mysticmothyoga": "Thank you for always being transparent and vulnerable.", "serena.j.s": "You are my hero, Jen Gotch!", "whistlindell": "I felt a little better last week and told my therapist that I felt oddly optimistic. Surfing the waves 24/7.", "graceyjane": "Thank you for sharing! 🙏🏻❤️", "linkofhearts": "💛💛🙏🏼", "hej_ditte": "💙", "lauragoldenberger": "❤️", "patriciakaegi": "I totally get this. I’m glad your feeling good now.", "cortneyasten": "❤️❤️❤️❤️❤️", "morganpansing": "Thank you for your beautiful courage in sharing so honestly. You’re such an inspiration.", "hairromance": "Thank you, Jen. I really mean it. You don't know how many people you are helping xx", "doublevisme": "Thank you for your transparency in sharing. Your journey and transparency is truly inspiring, especially to those of us also surfing the spectrum. 💗", "ashley_neese": "Thank you for being so real. Inspired always. x", "princess__peewee": "❤️❤️❤️❤️❤️❤️❤️", "taylorjameskretschmar": "You are very kind to share this", "little_emmab": "😘😘😘", "ohhaikiki": "Uuuuuuhg ouch uuuugh - we need these floor despair times to appreciate our own hard work towards “happy” maybe uuuugh", "elin.beijer": "❤️", "brittmorg__": "I can identify with this exact experience. For me: not just the anxiety/depression, but also the deep rooted pain. Thank you for sharing. I needed the reminder that I don’t need to try and hide 💕", "juliebethtanous": "❤️", "debbiedrawsfunny": "God I know that feeling. Shit. I try to live like anxiety and depression couldn’t ever take me over and make me feel like that again. But trust that I’m always looking over my “well adjusted” shoulder for that creepy monster.", "sunny_girl_kyi": "Sending you so much 💕 to share this video shows incredible amounts of courage your so wonderfully fearless without even knowing it, and soooo refreshingly honest, instead of all this fake unattainable perfection that is broadcasted all over Instagram, never stop being 100% you. ✨💕✨💛✨💙✨🙏", "bondoksaint": "You are an absolute inspiration ✨", "dijananecovski": "🌊 🌊🌊🌊😘", "thenouveauwedding": "Thank you.", "lorafeathers82": "Man I needed to see this today. Thank you for being so honest and open. It’s not easy.", "allisontheace": "Thank you for sharing this!", "cristinafoos": "❤️🙏❤️", "brittanielaurence": "Thank you 💜🦋", "hanbullivant": "You’re amazing and so so inspirational to me in being you and owning it and being real and honest and you are making so so many of us feel a bit more normal. Thank you.", "bonnietsang\nVerified": "Verified", "thislittlemiggy": "This IS uncomfortable. Which is why it is also so important and powerful. Thank you.", "gabriellegalatoire": "i too have anxiety attacks often", "bethanyabrennan": "You are an inspiration! Thank you for being you and sharing it with us. You make us all want to be strong women! ❤️", "ayuthiasari": "Thank you for sharing this 💕", "meghanalfano": "❤️❤️❤️", "ilootpaperie": "❤️", "jillianmorkan": "Have been there! Love your honesty - you totally rock ❤️❤️❤️", "laniako": "love you always.", "dreamqueenscatchers": "Thank you ♥️", "katenelsononline": "Thank you so much for sharing this. Even when you know that you’re not alone, it’s so comforting to really see and know that what you’re experiencing is shared, and real, and not just in your head. I don’t know you, but I love you and I’ll be sending all the good vibes your way today ❤️", "kristentola": "Thank you for sharing your truth! Your courage to be so vulnerable is admirable. We all love you!", "ebonysiovhan": "Thank you for sharing this ❤️💪🏾", "mental_health_melanie": "@jengotch I identify with this so much. You’re not alone. 🙌🏼✌🏽💛", "jeccamullen": "Thank you", "supermona1987a": "🦋🦋🦋🦋🦋", "corkieboltonjewelry": "Thanks for sharing 💪🏻", "leaztata": "Honest ! 💕", "imsurco": "As I see it... you already payed your debts! So enjoy your happiness now!!! It’s time for you!! You know the dark and now comes the light. Thanks for sharing !!", "isiliii": "☀️", "jessicaww": "Your bravery, strength, and vulnerability are inspiring and limitless! Thank you.", "sarahkfaucette": "❤️", "benningerl": "Well said- thanks for posting ❤️", "tzoma_": "❤️❤️❤️", "suchandra_bullock": "Thank you! Emotional honesty is the hardest. You are leading a mass....thank you. Xo", "sharvy28": "Well said ✌🏼", "salvagelife": "Using your pain to give hope and a voice to what others may be experience is so risky and so inspiring! Thank you!!!", "isabelladeguzman": "I respect the hell out of you, and look up to you always", "rae_spiegel": "Love and hugs!❤️", "bronwynsf": "This is so real and so true. Thank you. I captured myself crying last Christmas when my daughter said something hurtful to me. I have kept it as a reminder that shit happens, and it always gets better if we keep showing up and feeling the feels. Thanks for your courage in posting this.", "pinklibrarian": "Thank you. 💗", "moniquegilbert07": "❤️❤️❤️❤️❤️💪🏻❤️❤️❤️❤️", "liebeshouse": "You’re truly the realest person on the internet. I have so much respect and love for you. Please keep doing what you’re doing. This has a massive impact on all of us out there!", "harmoniousposhlife": "This happened to me last time I went on a vacation with my mom.", "janaleaks": "❤", "the_woodenpalate": "Thank you for being brave for us 🙌🏼", "lottielou1986": "You're the best xxx", "brianaali": "You’re so brave and such an inspiration ❤️", "miss_lozzy88": "❤❤", "modernsequins": "thank you for sharing! means so much to SO many. 💛💛💛", "heycindylee": "Thank you. Thank you.", "janereaction": "This! Thank you! I love your mental health posts! They are relatable and helpful on so many levels! Thank you! ❤️", "adellnotadele": "You’re my hero!", "tigerlilyweddings": "Brave and honest... thank you for sharing, I know that I'm not alone in life when feelings are so low it's hard to breath and feel you can get pass the space you are in x x", "outoflinepodcast": "❤️❤️❤️", "ihavethisthingwithpink": "This is intense, but it's real. You're incredibly strong to share this journey. I'm glad you're at a 7.8 today.", "eat_juicy": "Thank you for being vulnerable to share with us part of your journey. Glad you are at a 7.8 today! I sent you a private message.💗", "meganmacdon": "So. Brave.", "claire_bilbao": "Thanks for being real on instagram @jengotch ! Life has its ups and downs and being vulnerable has you on the right track ❤️", "thegirlswithglasses\nVerified": "Verified", "yma.deer": "How incredibly brave and generous of you to post such an intensely personal moment.", "saranev": "You’re a star.", "meghan.awalt": "We love you and your brave heart. Thank you for talking about the “thing” that affects so many of us.", "romi_runrun": "😙", "amysbookobsession": "💚💚💚", "jaxquackenbush": "The bravery it take to just share this vulnerable part of you is amazing but to also be self aware enough ato use this as a tool to help you on your mental journey today is beautiful.", "samsearsfoshee": "Thank you for being vulnerable, so others can be encouraged. That is brave and beautiful @jengotch ✨", "jmhebert": "❤️❤️❤️", "themwcollection": "I love your openness and willingness to share your pain, you are brave. You are loved and a badass role model for all of us. Much love.", "carolynmackin": "As painful as these moments/days are- it is so important to feel the emotions and move through them. The light in me sees the light in you.", "dogloverepeat": "You are special. and brave. and you’re making change. Bravo. ♥️", "tanyagoott": "We’re here to help keep you well💛💛", "colorpopevents": "I am so grateful to you for sharing your journey and so happy that things are improving for you! 💕💕💕", "decor8\nVerified": "Verified", "thingsinlaurashand": "Thank you as always for sharing the real honest and raw truth of who you are ✨", "jamie_tibbits": "❤️💛💙🧡💚💜", "mariterecr": "You are such a brave and strong woman Jen! Thank you for sharing this with such openness. For being and inspiration to many. Hugs and love from Houston!", "olivebarrett": "You’re a superstar!", "juliethroughtheglass": "This post is powerful and familiar. THANK YOU ⭐️", "veroguardiola": "Thank you ❤️", "lissyloulou": "You are so brave.", "loveheartlee": "Sending love and hugs 😘", "aklimton": "You are brave❤️", "brendalarby": "Much love and respect", "corg.b": "Thank you for sharing this with us, I really admire how open you are about your mental health ❤️", "amypouliot": "you teach me that being real is more important than anything", "valientegoods": "So much love and respect for you Jen. You are an amazing human. 💕", "louiseandamelia": "Life is hard - you are awesome - life is a CONSTANT stream of battle and blessing and most of times at the SAME time - focus on the BLESSINGS of which you have a ton of - the battles and blessings will come and go but you want to look back and know that you focused on the blessings - YOU are a blessing to ALL of us - getting comfortable with that notion is a life’s work ❤️❤️❤️❤️❤️❤️", "knife_ie__": "✌🏻❤️ so brave", "lauraemily120": "Thank you for posting this! You’re so brave and relatable and I think it’s amazing that people are speaking out about depression and anxiety and stopping it from being such a taboo subject!! It’s not something to be ashamed of and it something that soo many people go through!! You are a real inspiration and a total bad ass!! ❤️❤️", "marisadelonda": "I m sorry for that time!! Glad to see you good now!", "astroidmaria": "You are love and light💖💕", "charisse.kenion": "Thank you. Love you", "held_am_herd": "❤️", "lemur_lee": "Thank you! 🤗keep being amazing!", "wyatt_2341__mckinley": "So brave. Such a courageous thing to do, to share your most intimate moments like this. God knows we all go through them 😥💛💛", "jode_nicole": "Keep being & sharing you! You are amazing. Thank you!", "lanovello": "that’s SO beautiful and SOSOSOSO inspiring!!!! i am sure i am not the only one who deeply appreciate your rawness ✨✨✨✨", "pheberoxane": "Thank you 😘", "pantonemagenta": "I LOVE and ADMIRE you soooooo much!!!!", "t__brooke": "💛 we love you!", "weequizzie": "I love you 💖", "lildrusko": "💖💖💖💖💖", "ghostgoods": "So much love for this. When I was in my worst anxiety attack stage I depersonalized so I wouldn't even have picked up a phone to take a record of it. It's so important for me (and countless others) to see powerful women like yourself sharing such human moments ❤️❤️❤️", "niche_78": "❤", "westier30": "Very brave posting this. 🙌🏻", "lara___c_": "You lovely brave soul 💛💛", "sarahlamond": "BRAVEHEART", "val1romarin": "You have become one of my favourite person to follow on Insta exactly because of posts like this one. Your bravery and badassery are so inspiring to me. Your resilience is a beautiful thing to witness and you give strength to a lot of people. Also, you're f***ing awesome. We love you! <3", "xanahpops": "You're amazing! I relate to all your posts and find them really encouraging and only wish I could give you a virtual hug 🤗🤗🤗", "and.peh": "BRAVEHEART ✨🦁💪🏻", "amyloulouchild": "Thank you for this. I really struggle to articulate that fear and what you've written helps me to explain my own experiences to my loved ones who are riding that rollercoaster with me. It's such a strange thing to be afraid of wellness, but as you said, the expectation that everything will come crashing down is crippling. I hope you're having a great day-to-day I just had a nightmare school run, so I'm eating all the biscuits. Xx", "domonique_wilson": "💘💘💘💘💘💘💘💘💘💘💘", "debzart55": "😘😘😘", "manthsrussell": "💕", "seeemilypaint": "👏🏼", "planesworkshop": "What a brave thing to post @jengotch - Bringing mental health to the table in the way you do is inspirational. You posted something ages ago about coping with depression whilst building your empire and a happy life at the same time- that stayed with me. Keep going sister, you're fight is a worthy one and it's helping people out of their own struggles along the way🙌🏽🙌🏽🙌🏽", "bolette.m.h": "🙏🏼❤️", "dion__74": "🧡", "taylorbarringer": "So true. We can’t really allow ourselves to be truly happy because we know it could and it will at some point end tomorrow.", "caratakesphotos": "I can’t watch it but I appreciate you sharing it and your words resonate so deeply with me. Thank you for being so open with your journey, it helps immeasurably xx", "pipared": "❤️", "lumiishere": "This is so important!!", "jmjx28": "I'm watching with no sound at the moment and my heart breaks you got this low. I've been following you for a while now and I think you are wonderful. Sharing your life - both good and bad to share with us. To show us that these things happen to normal everyday people. And there is a way through it. And it's ongoing, a challenge but something you just push though. Thank you from the bottom of my heart. xx.", "eleonoraarosio": "♥️", "skinnybridget_": "Thank goodness we are not always required to recognize ourselves. Oh what a blessing to recognize ourselves in others. Getting to places like this one you shared is not regression, it's all forward motion and we are ourselves even when we don't know it, can't see it. How gracious, that I have been where you were and stand (well, sit) where I am now. How gracious that your story is a gift to me and so many others. Thank you for this.", "syazanasukiman": "You are just too kind and thoughtful for sharing this. Thanks for reminding us that we're not alone 💕", "oliviaandme": "You go girl 💪🏻💪🏻💪🏻♥️♥️♥️", "psalmshine": "❤️", "hammer_helene": "Thank you for your honesty ❤️ It means the world to me.", "irumrahat_": "❤️", "rosinawilona": "Thank you", "karelzzz": "💘💘💘", "annhiag": "So brave! 💖", "lillikoisser": "This too shall pass. ❤️", "jessicadaviesmetalworks": "❤️", "libbybothwayloves": "❤️", "christinawinkelmann": "Love you Jen!!!!", "noemie.mcgovern": "This is so incredibly brave.", "lilacsandchai": "Hugs! ❤️🙏🏽 we all have moments. It’s in those moments we’re pushed to our limits and how we bounce back. I can explicitly remember times in my life and career where meltdowns occurred and how hopeless it feels. Lean on those you love and know you CAN come out on top! 😘", "bee.k75": "💥🌟💕", "cupmycakez": "Bless up for sharing 🙌🏽 giving insight to those who don’t relate that THIS SHIT IS REAL and giving comfort to those of us that do relate reminding us we’re not alone. We’re all just out here doing our best. You’re adorable and appreciated 💖", "baretboisson": "I identify so clearly 💔", "hello.goldie": "Thank you for sharing you and your light. You are not alone. ✨♥️", "nicolecostello_": "So proud of you for sharing 👏🏼 mental health is nothing to be ashamed of 😘", "oftenwander": "You’re so brave and inspiring jenny! Thanks for posting! 💛", "__fashion.only__": "GOD BLESS YOU FOR SHARING..♥️♥️🙏🏼", "lotusland13": "Thank you for sharing and letting us know that u can have lows like this and you are not alone in experiencing it, you can still be successful, and you can come out of it. It’s brave to share this. Thank you. ♥️♥️♥️", "emmajbolton": "Thank you for sharing this. X", "lolita_magazine": "Your honesty and rawness is heartbreaking but so appreciated by others who might be going through the same thing. I hope it only gets better for you ❤️", "ellajhowson": "@jasminecourtney you probs haven’t heard of Jen before but she’s really funny/interesting. She’s really transparent about having bipolar and how she deals with it, medication journey etc I love her lol x", "thelittlegrey": "thank you, jen.", "wunderkammersupply": "Wow. What a deep an incredible truth: it’s uncomfortable to move towards wellness when you identify as someone who often feels unwell. Jen. That’s amazing and so insightful. This is precisely one of the biggest barriers that is difficult to identify and accept.", "chicagocc": "Sometimes part of healing is knowing you're not alone. I love that you share the ups & the downs. 🙌🏽🌈🦄🐶🏄‍♀️💖", "megeowyn": "Thank you for sharing your beautiful heart and mind with this kind of honesty. It’s so important. Hugs xx", "heidivstheworld": "You are a living breathing human. It’s hard to keep it together on the outside all the time. I thank you whole heartedly for not hiding. You are beautiful and you are not alone. Everyday is a journey. Love yourself and take care of yourself! ❤️❤️❤️", "iamintentionallyblank": "I’m someone who really only met you through work and in that setting—-so These Super candid views inspire me to know that I too can do it! At me lowest or my best—-those are both manageable—-and I can still have s business. So you inspire me, and as you can see many others by being vulnerable—-so I thank you!", "michele.godwin": "Wow. Thank you. ❤️❤️❤️", "misspigeonvintage": "My three year old boy witnessed me like this just before Christmas. He's so tuned in to my emotions and his heart was clearly breaking. I kept trying to hide away so he wouldn't be upset, but he followed me around. He eventually just stroked my hand and said \"breathe mummy, you need to breathe\". It was almost the perfect remedy, knowing I HAD to \"snap\" the stream of white noise in order for him to witness me function again. And his touch was so gentle, it brought me to another reality again. I don't think I will ever ever forgive myself for him witnessing that, but like you say, you can't predict an attack's arrival. I do feel lucky that his instinctively knew I had to breathe it out, though. I'm glad you shared this, @jengotch. You are an inspiration to me in making things WORK WELL. Not perfect, but well.", "neontalk": "❤️", "bee.nakan": "❤️thank you! Your strength and honesty is inspiring.", "ellen.odessa": "❤️ just to know others are dealing with this too makes me feel a little less alone", "moronoa": "❤️", "yourstrulycaro": "Omg I recognized that pain and it made my eyes tear up. Fight every day to be healthy so ur prepared for the bad days as much as possible. #virtualhugs", "leatheranderson": "Strength", "apricot.floral": "Beautifuuuuuul", "themelholmes": "you are so strong! thank you for being such an incredible example.", "alypie5000": "❤️", "mrsaprillowe": "I feel you sister! It’s a wild ride. Are you open to sharing any diet and lifestyle changes that have helped you? Or really what things have helped you most significantly?", "djshaz": "Thank you for sharing everything you do. 🙌🏻", "monica.skipper": "I love you very much and I’m happy a notebook brought me to you and your journey. I’ve been there, still get there sometimes. I’m here for you through all of it and I’m so proud of all of your progress. Thank you for sharing your truth.", "avisualmoment": "You just helped a lot of people today Jen Gotch.", "soniasapinho": "It’s intense and hard to watch you in such pain. But isn’t great that you wish to share your journey and inspire others. You go, girl! ❤️", "tolkienelf": "Vulnerability is always a gift.", "christinedecarvalho": "@wildpalms_shop", "sgulin": "Thank you for being vulnerable ❤️", "karmiya_": "❤️", "alohaspreader": "You’re one of the best things about this stupid screen in my hand.", "flywheelpress": "What you are doing with sharing all of this is beyond words. I'm so grateful. And I know I'm not alone.", "alicia__in__wonderland": "❤️", "liaarvidsson": "❤️", "so_cal_belle": "Your strength is mind blowing. Thank you for being true to yourself. ❤️", "cleomurnane": "Keep breathing babe, we got you!", "morganswift": "Wow, and you married us the NEXT day. Strong.", "natnotes": "❤️", "litttlewolf": "💜💜💜", "robin__jordan": "Sending love ❤️❤️❤️", "_cupkait_": "I have most definitely looked like this a time or two. Never forget where you started ✊🏽 sending lots of love!", "bronzedbunny": "@jengotch you are so raw and unedited and that’s what makes you so special . Thank you for sharing this. Positive vibes coming your way ✨", "kellonearth2020": "How does it feel to be loved when you’re being 100%you...even at your lowest, because that’s what’s happening. Right here, right now. I hope if this happens again you remember much you’ve helped people by just being you.", "sarahfalugoweddings": "Well done for sharing - brave and inspirational", "thesensesfive": "Thank you ♥️", "liagiba_m": "Thank you! It really helps to see that the strong, brilliant people we admire aren’t always shiny and happy and flawless. Thank you.", "goodnightirene25": "❤️", "lrsn13": "Wow! Great inspiration! ❤️", "lindseyhendo": "You make us all better ❤️", "katie_wilde_states": "❤️", "paigeappel": "Love you and so proud of you. ♥️", "miriam.vegac": "Thank you for sharing yourself like this ❤️❤️❤️💪🏼💪🏼💪🏼 you’re one brave strong lady", "karatrigaux": "The world needs more vulnerability and transparency just like this and just like you. 💯 Thanks for sharing.", "jackiedressedincobras": "This mostly made me want to cry. And also hug you because most people would be too scared to post something this honest. You’re pretty amazing.", "studio1208": "This is so incredible. Sending you strength in the tough times and joy in the good times. You deserve joy and success and you can get through the shit xx", "theforgebristol": "You are amazing @jengotch - this really worried me for a moment - I thought it was now 😳 Regardless of the possibility of more downs you have achieved SO much since this. And you have given so much while you’ve done it!", "miacarameros": "💕💕💕💕💕💕💕💕💕 love you Jen Gotch forever.", "ohmybrookey": "💗 ily", "ingridloveloves": "Thank you for giving a real perspective on stress. Not placing a façade on what ‘stress looks like’ makes people less stressed on appearing “ok”, including me, thank you 😊", "marissadigirolamo": "I love you ❤️❤️❤️ and totally understand. i am right here with you. thanks for sharing.", "justjill": "I love you @jengotch ...! #callme I mean, I know you won’t really call me, because that’s probably weird, but it’s just something I say to those really awesome people out there that I just deep down love and want to will into my life by putting that out into the universe.(@official_dick_van_dyke, @therock, @bettymwhite, and #santa). So see, you’re in really good company of those people I love and want to be in my life because they’re amazing and joyful and kind. #👍🏻", "galexina": "❤️❤️❤️ you are incredible, girl. Strong smart beautiful creative and brave. ❤️❤️❤️", "rebboh": "You did it! Good for you for posting this! Your progress AND struggles are inspiring!", "sarahelizreimer": "Love the transparency of your journey Jen - you are such an inspiration.", "meeschy": "As someone who has had MDD since I was 12, you took the words out of my head and wrote them down. Thank you so much, you have no idea how helpful this kind of post is on IG when everyone seems perfect or positivity is valued over real talk. Thank you so much.", "tinywarbler": "Thank you so much for sharing this- It inspires me to share more of my experience and is comforting to know I'm not alone. And you are not alone. Your honesty is beautiful and courageous. ✨", "laurenjherrmann": "Thank you for being brave and sharing your journey. It means a lot, and makes it easier for others to be more transparent about our own mental health journeys ❤️", "kaysujin": "❤️❤️💪🏼💪🏼 love you jen", "themomculture": "So much love and respect for you", "kellyamccartney": "💗💗💗", "kateeosh": "Love you", "smithaureens": "❤️❤️", "iamkatieshill": "This is so, so important to share. I so admire your honesty & vulnerability. This is strength. 👏🏼", "chloe_schlemer": "Thank you for your transparency always. Your journey inspires others and makes them feel less alone in something that is typically kept so locked up. You’re amazing!!", "missmarschall": "Thank you for your realness / awesomeness / beforeness, afterness, and nowness / and currentness / And ... ALL THE Nesses in between @jengotch", "michele_boyer_m": "@jengotch you are brave. Thank you for sharing.", "iloveyoujenayy": "the vulnerability and transparency you show on social media is so beautiful and reassuring. we are never alone. thank you for sharing yourself so openly, Jen 💞", "xolp": "Thank you for being honest and brave and REAL about the daily struggles of depression, lady bossing and life! You are a gift to the interwebs!!", "thisishopemarie": "the strength in the sharing of this — it’s grace and bravery and i am so thankful for you and the transparency you’ve chosen to share with us. xo", "miriamgirotti": "You’re pretty amazing! @jengotch", "jenjenhi": "Real and inspiring! Thank you for the transparency in sharing your journey!! ❤️", "hannahemile": "💪💪💪💪💕💕💕💕", "rhonda_35": "❤️", "gladiolas": "Love your honesty throughout this journey. Life is an adventure. Some days it’s like this, and then others are pretty great.", "lisamariecholiy": "Thank you for being brave and honest enough to share these incredibly raw and vulnerable moments in your life. You are an inspiration! 😘💕", "katefleming": "❤️", "micro_bangs_": "@jengotch I wasn’t going to comment because you were at a cool 666 comments but I had to say something. This is so important and thank you. You are super inspiring. I’m sure you won’t see this comment , but you are really appreciated and I really needed to see this. ❤️", "kaitiibear": "I love you for sharing this 💘", "jacmen01": "@mindababinda", "jamie_mccool_": "Jen, I hope you know how many people you help ❤️ You are a stranger, but still so special to me.", "megfals": "You are a wonderful person.", "baileighelizabeth": "You are amazing and your contributions to the mental health community mean more than you could ever know. Thank you for sharing. ❤️", "misskajlich\nVerified": "Verified", "ixchelmercy": "I’m only liking (hearting?) this because it is really brave or at least unequivocally honest to post something like this and I think you provide so much support and encouragement for people dealing with mental illness. I am one of many people inspired by you.", "sarah_r_murphy": "Thank you. Xx", "savvy.ln": "Thank you so god damn much. We all need to hear this.", "framemonsterla": "We love you Jen!", "mmmarywood": "Thank you Jen. This reminds us that between the lows and the highs there is progress and it is possible to move between them with humour and grace", "ashfrizzell": "You’re amazing for sharing this with us!! I have felt those catches of breath where you feel like you’re drowning. Thank you for sharing the highs and the lows! You’re gold baby, solid gold! 🌈💫", "jessikarose": "This just makes me want to give you a hug. Thank you for sharing and being so vulnerable. Also, for the reminder that life ebbs and flows. There were times I wanted to give up. Life felt so overwhelming. I'm so glad I didn't. I'm so glad you never did.", "mommymatter_": "Jen, thanks so much for posting this! I struggle with mental health anxiety/depression. The only people in my life that and non judgmental are my parents. Which is pretty shitty. I’ll tell people and my mental health issues. Actually I stopped telling bc they are so judgmental. Telling me it’s in my head, to get over it, or there’s nothing wrong with you! Even thou I never met you I feel like this is a safe space to discuss how I feel. Yes I get it! I’m supportive of you and I understand. Thank you for continue to post your journey.", "gainingkate": "God damn thank you", "pinkbyrd86": "This is super hard to watch because it's so clear the misery you are in. Thanks for being brave and showing it. You are an awesome advocate. I'm so glad you're on the other side of this!", "leahlaniskincare": "‘My mental health journey hasn’t just been about identifying the problem and solving it. It’s been about riding the wave and not getting too comfortable at either end of the spectrum’- GOLD. I cannot tell you how much that resonates. It’s about holding space for the ebbs and flows that are our emotions. Huge hugs 💕", "kwidmer71": "Thank you for posting this—and for your openness and honesty. Your candor is truly a gift to so many. ❤️", "laura.sulak": "❤️💔❤️", "mountaingirl_lori": "Thank you 😌", "awkwardribbon": "I have to honestly thank you! For being so open and honest about your struggles… it makes the rest of us (at least me) feel better in dealing with my own struggles, journey, progress, downslides… knowing I’m not the only one, really helps me…", "melissamarieharrison": "Thank you for sharing this. You’re amazing. ❤️❤️❤️❤️❤️❤️", "katiemahanes": "❤", "cadencevinyls": "This is important. You are doing important stuff. Keep doing it please. Thank you ❤️❤️❤️", "emmaolswing": "Thank you ❣️", "kristinabornholtz": "thank you thank you thank you", "mackienichols": "You are truly wonderful and your vulnerability is so inspiring - thank you for your braveness and just sharing this for all of us that are able to relate.", "jenniferefowler": "So proud of you for sharing this! Never forget: You are awesome! 💜", "pariswoodhull": "True bravery💪 You’re a total badass @jengotch and the world needs more humans sharing their REAL stories just like you do❤️", "ktaylou": "This. THIS! A million times THIS. Thank you for being so brave to the benefit of so many...", "hannahpapernick": "You are my hero", "fashiontweet": "@jeanique", "spangley": "Thank you for being so open about your journey! ❤️", "noni_rangel": "❤️❤️❤️", "ladytronn": "🤲🏽♥️", "mallorylucille": "!!!!!! 💖😘 you’re such a breath of fresh air", "saramarietexas": "You are a bitchin’ boss babe and it is so amazing to see the progress you’ve made on your journey. You are beautiful and I wish more people had the courage to share their story of accomplishments as eloquently as you have. Thank you for being an inspiration.", "denisecrew": "Thank you. You are magic. And brave. 😘", "evasuarezv": "Thank you 💗", "couchpanini": "❤❤❤", "celestemariesimmons": "I love you for posting this", "chelsealeifken": "love you so much it’s insane", "preppyraven": "You are so brave ! I have great admiration for your courage and strength", "morganecazaubon": "😘", "charliehallas": "You are brave for sharing. I couldnt tell the video was you - had to see it a few times. U seem to be having fun in your space in 2018 - I applaud that u took a negative slander “bi-polar fashionist” and made it your own positive thing! ✨🌸🎀", "theneatandtidylife": "So incredible. Thank you for this post. I can identify with this so much. It helps to hear your perspective and to be reminded that I’m not alone in feeling this way from time to time. I really hate those times, but I’m learning to remind myself that the lows will eventually pass. They always do. ♥️", "brandysroberson": "You are helping so many. Thank you. Sending you so much love and light.", "bgo____": "❤️", "foxandfinch": "Thank you. I can't even articulate how much this resonates. Just... thank you.", "melynmarie": "I may not know you, however, this video just brought me to extreme tears. Not because of the woman I see is obviously over stressed, but because, you, the women I have gotten to know through this world of IG. Tears to know the beauty you shine today took such strides of pure fearlessness. You are one badass warrior and continue to inspire all of us. Thank you for being a beam of sweet reality in a sugar coated world. Your smile and wisdom is always welcome♡", "ho11ywi11iamson": "You’re such an awesome person, Jen. I don’t know you but it hurts me that you ever felt like that. Better days ahead!!! ♥️", "ginarockenwagner": "Holding space in my heart for you, Jen. ❤️", "beeandapple": "This is so real. I felt it, and I feel you. Thank you for sharing and for normalizing depression. As someone who has very similar experiences, I so appreciate the way you talk about and make sense of mental illness. Sending big hugs!!", "loco4793": "This is heroic. You are my hero.", "catchlezelles": "Beautiful. Thank you for sharing!", "carla_grbac": "Thanks for sharing Jen ❤️", "char.lotte.hughes": "Really appreciate you sharing 💜", "sallinthecity": "Thanks for being so honest! So inspiring ! Sending you love! 💕", "hilllllll": "❤️", "labachelder": "Before I started reading I thought oh my goodness someone ruined her hair! Been there! But how cool to have this to look back on and feel the progress. You are an inspiration all the way around.", "partsandlabor_inc": "You’re a MAJOR inspiration ... keep on keeping it real + sharing your beautiful self ♥️", "sruelas72": "Love & Strength, Baby Girl!! 🙌🏽🙌🏽🙌🏽", "geezlouise": "Thank you for sharing. All my love. ❤️❤️", "loumime": "❤️", "_beckykimball": "Wish I could just give you a hug. Everybody needs a hug. I’ve needed my fair share. XOXO", "britegirll": "❤️ you are so strong!", "shitmomsdo": "I like your insights about lows being a part of life. I think that is something everyone can identify with.", "ohlizzo": "Thank you for being so real, so brave. Your strength inspires. 💛", "br1514cr": "Thank you for this. I am going through the same: work, relationship and family stress plus poor health but accepting it and working over it.", "_ann_e": "💛💛💛 it's so so awesome that you share these things here. So helpful to so many ✨", "jen_sanderson": "Wow Jen. Courage and authenticity. You are loved by many.", "cyn322": "You are so brave!!!!! Thank you for sharing. ✨✨✨", "makeupjoa": "I admire you so much for having the balls to show how it’s really like to live with #depression #anxiety and all that’s in between. Recovery is not easy, specially with so much stigma around us. This is what the world NEEDS to UNDERSTAND and STOP JUDGING #mentalillness and begin #supportmentalhealth I thank @namicommunicate for everything that I accomplished in my own recovery and creators like @jengotch that are not afraid to expose reality in such a personal way.👣🧠❤️✨", "shanw0w_w0w": "Thank you for being honest! There’s beauty in the breakdown... #stayposi 😘♥️", "oh_miss_mary": "Thank you for being real ❤️", "stephpye": "Thank you for sharing!! 💕🌈💕", "nicholebigley": "Thank you for sharing this. It is honest, brave and makes me hopeful.", "haleighforbes": "@super_kimtendo", "leighaski": "You are amazing, keep on keepin’ on", "auslandinteriors": "You are so brave! Thank you!! 🙏🏼", "annie_ellen": "You’re amazing", "c.janette": "Love this!! Thank you!!", "amandamegmiller": "This this this. Thank you for sharing and being so open! ❤️", "rbarrenech": "Thank you for your raw and very real depiction of active mental illness. Depression and panic disorder are more than than tv commercials with cartoon clouds talking to each other (wish it were that easy)", "sarah.b.shealy": "Thank you for sharing your journey and self with us. ❤️", "rebekahlz": "💙💙💙", "juleptileco": "Big hugs ❤️❤️❤️", "vibekeborsting": "You are amazing ✨", "klafferman": "Adoration. Love you. Thank you.", "brooksied": "This is so real. Thank you thank you!", "oli.vibes": "Amazingly put ❤️ you are wonderful and as someone who is on riding their own waves, this is nothing short of beautiful and feckin awesome 👏🏼🙌🏼", "elleeachten": "Thank you.", "grace_design": "It takes so so much courage to show your vulnerability like this. In a time where everything feels so slick and polished and...so damn...curated...you are a breath of fresh air. We need more honesty and authenticity - don't stop! (And I'm happy you're doing better!!)", "dyetology": "God love you.... I hate to see you hurt like this. I totally understand..... been there before.", "kristeyoung": "Thank you so much for sharing all of you with the Instagram world. Mental health issues are scary and real, i know personally and it is so inspiring to see such an amazing person show all the good and bad. Know that you have people who have never met you that are with you and thinking of you! Keep being YOU!", "normajeanevela": "Been right there, same place. Such a gift that you share to make others aware.", "kindermodern": "your change is inspiring. your positive health efforts are so very clear. thank u for keeping it real!", "pandawagon": "❤️", "junediane\nVerified": "Verified", "fifi1961": "Those moments are so painful but important for people to see and know they are not alone - so courageous👏🏻", "_sarahnave_": "Thank you for your vulnerability and honesty in sharing your journey.", "emmalouhope": "You are us. We are you. Thanks for sharing. It’s nice to not feel alone in our struggles.", "sophie_stimola": "You are my hero, thank you.", "jah.feels": "so beautiful", "rennstagram": "Thank you, as always, for your honesty. Transparency is such a great encouragement for those struggling. Your openness about your mental health has helped me. All my love and positive vibes to you. And again, thank you thank you thank you.", "scollcandraw": "Thank you for sharing this, visibility can be painful/scary/overwhelming but you are changing/saving lives and yourself ❤️", "meredith_sterk": "You’re bravery is so inspiring. Thank you for your vulnerability throughout your journey. You are opening so many eyes and I am grateful for your story and perspective!", "cvern01": "Wow... you are brave. Thank you for sharing your life with us. ❤️", "jade_melissa": "🙏🏻", "jencat_kilburn": "❤️", "jenniferanngach": "So glad you’re far away from there! Sending you lots of love", "jena_doll": "This is so fucking relatable. This is real life. Thank u for sharing 🖤🖤🖤", "deemeany": "❤️", "theferalpastrychef": "Thank you for sharing and for being YOU. You inspire (but no pressure) so many of us who struggle with and live with mental illness when sometimes just being human and just being ourselves...just BEING.... is painful, scary and so fucking hard. Proud of you from afar.", "maedchenkind": "♥️♥️♥️", "dmb.317": "love you @jengotch 💗", "yocruzie": "God bless you!", "happypsych": "💕", "oitsmycupoftea": "❤️❤️", "lalaalace": "You’ve done an amazing job getting to where you are now. Lawd knows it wasn’t easy. Keep. Moving. Forward, Sister! 🕺🏽💕", "xonatasha": "I've never seen anyone doing this... I thought I was alone with the shallow breathing and tears. I'm sorry you ever had to feel this way, as I know how painful it is. I get this way with anxiety sometimes... and my limbs go numb when it spirals. I usually just sit it out, as nothing I do can stop it when it starts. I hope you're okay now.", "bustleevents": "Sending lots of love and healing", "carolinemillerfloristry": "Thank you for sharing 💕", "soniakbridges": "I love you for sharing your real self. I have never met you yet you make me feel like it’s all going to be okay. Plus you make me laugh... #jengotchfanclub", "emilyblincoe\nVerified": "Verified", "lolojococo": "❤️❤️❤️", "prettycrabby": "This will help a lot of people. ♥️♥️", "anahata_joy": "This is incredible.", "laura.gwinn": "❤️", "daydreamhiker": "Thank you thank you thank you 🙏✌🏻❤️☀️🌼", "emoooleee": "❤️🙌🏼🌹✨⚡️🌈", "glospany": "♥️♥️♥️♥️♥️♥️♥️", "saraknajm": "💕", "the_robinski": "Thank you very always being yourself no matter what your number is! ❤️🧡💛💚💙💜💗", "anqg": "Brave Truthteller. ❤️", "fatmumslim": "Oh Jen, this is so brave to share. Thank you. A million times thank you.", "apamipi": "💕", "thrallllers": "This is so good. I love you for this.", "heyanalicia": "This gives me hope.", "miss_julia_j": "I'm a relatively new follower. When I saw this I thought \"oh no no no! Oh, what happened (if anything) to bring this on?\" I recognized that it was an episode, not a reaction to bad news or w. Then I read the caption. Man... Just realizing that I knew the difference made me look at myself just now, and your words rang so true. I also identify as someone who is often unwell, and is very untrusting of the swings. Neither last. You've taken so many steps. Take many more. 💜 Thank you for sharing.", "oneandonlyvm": "Sending you peace calmness and love energy", "caoimheronan": "Thank you so much for sharing with us. Sending lots of love & best wishes your way!", "acolortheory": "This means so much that you shared this, I've been in a similar state many times before and watching you, someone I have admired for many years now go through though times. Makes me feel less lonely. Less detached. Thank you--- keep shining that glorious light💖", "jennyalmonte29": "Thank you, Jen! As someone who has overcome a monumental mental health journey as well - and by overcome I really just mean acceptance- this is so real, so true, and so important. Thank you for being an incredible sister in solidarity and not being afraid to be public about it! You're doing incredible things and helping so many others!", "christine2050": "Love you.", "amity_spiegel": "❤❤❤❤", "saramoon": "❤️you for your bravery and openness to share.", "okitskatie": "I truly admire your honestly. As someone who also struggles with mental health issues I really relate to your posts and recognize how hard/confusing/upsetting/sad/comforting(?) it can be to relive these difficult moments. Thank you for sharing your good days and bad (you are helping more ppl than you know). Wishing you many more good days ❤️☀️🙃", "mollyblaine": "💜", "rawkstarliving": "We love you so much Jen!!!!!", "la_caronita": "💗", "biscuitbeangill": "What @littlealejandra said 🙌", "levonca": "💙💚💛💜❤️", "hoe_for_fdr": "you inspire me daily!!!!", "melindajosie": "💛", "selleck": "Wowsers. 🙏", "thatsorad1977": "♥️🤘", "becbookwalter": "Thank you for sharing! 🙌🏻💕❤️💕❤️", "berd.nerd": "Oh Jen. You’re so brave for sharing this, and I think it takes a certain bravery to even think to film it too. Onward and upward! 🕊", "ben.pame": "This is so brave and generous of you. You shine a light on mental health and help so many by doing so.", "karaboo_88": "thank you for always being so open and honest even when it’s not easy and using your own struggles to help the rest of us realize we are not alone in our own struggles. it makes all the difference in the world! 💜", "mslidiaalvarez": "💗 this is something I’m trying to understand for myself as well . Thank you for putting it into the words that I’ve been longing for", "chloe.h.h": "♥️♥️♥️", "realbrookewhite\nVerified": "Verified", "gdancepants": "Thank you. You are incredible ❤️", "christinewisnieski": "❤️", "elirarodriguez": "You’re brave!!! Thank for sharing and remember you’re not alone, God it is whith you 😊🙏🏻", "girl_with_a_hat": "Thank you for being so open and willing to share your struggles and victories with us. Your courage and strength and your words have helped me so tremendously. 💕", "mayascurls": "❤️🙌🏼💕", "hey.anasouza": "Pure respect for you for posting this and bringing awareness to the topic. Sending my love and a big hug to you! ❤️", "chelseam.c": "My heart is breaking watching this, but thank you, thank you, THANK YOU for being a voice and a human helping so many (myself included). You’re an earth angel 💕", "kaylemariegraham": "I’m so sorry you ever felt like this! You’ve got tons of support here already just know you’ve got mine too. Life’s a Garden, dig it. Keep on keepin on. #joedirt", "gypsylosangeles": "💞✨💞✨💞✨ You are brave! 💞", "brooke.eanes": "Thank you for sharing this ❤️ It really does help.", "meganmccarty": "You’re a hero.", "duffwater": "❤️❤️❤️❤️❤️", "etc.reative": "You are brave. Thank you for sharing your vulnerability. It means more than you know.", "hollybnelson": "❤❤❤❤❤❤", "tremedina": "Such an inspiration. We love Jen. Thank you.", "brittanyiery": "❤️", "an_erin\nVerified": "Verified", "sesboog": "💕💕", "kbkemper": "You are an inspiration 💗", "mediocreyogi": "Hard to watch but thank you for sharing", "blue13pop": "You are amazing - thank you 💕", "florasageofficial": "I love you!! 💕", "proudmaryglobaltextiles": "Wow, you’re brave af. Thanks for sharing.", "deaner_74": "Very hard to watch knowing I have been there. I should have done that at my lowest to help see how far I have come now. Thank you for sharing . What an inspiration you are !", "debyemane": "❤️", "sonnetjames\nVerified": "Verified", "jamiemakeup\nVerified": "Verified", "luckygirlkelly": "❤️", "colbyreport": "YOU ARE SO 👏🏻 Thank you", "andrea.fairservice": "Thank you as always for sharing you brave, strong ass woman. 💕", "dahnee_vans": "❤️❤️❤️", "katiejstephenson": "Thank you for sharing this, Jen. I’m so sorry you ever felt like that. I myself have never had to deal with a mental health issue but I am very grateful to you for helping me to understand. You’re helping so many people.", "letsmakemary": "💋💕🌈 Thank you!!! I do the same thing, only my video is a mid-panic attack selfie before my sisters’ weddings.", "suzannewithaz": "❤❤❤", "jenwoodruff": "Thank you. I don't know how else to say what I mean.", "ms.alana.m": "Thank you for sharing & being so open about mental health! I love everything about you, up or down, you’re an inspiration❣️", "ettatorials": "Jen, I needed this today. Thank you!! ❤️", "laaguiar": "Thank you so so much for your honesty in sharing the good and the bad, you are a voice for all of us who have had struggles with mental health and fight everyday to keep moving forward ♥️", "_acreatureofhabit": "Mental health is a much avoided topic, one that we should talk about and support. Your honesty and bravery is phenomenal. Thanks for sharing the journey", "fanshen": "It viscerally demonstrates how lonely mental health issues can be. Which is why it’s so awesome that your sharing. No one should be alone when feeling so much pain. The more we “normalize” mental health issues, the more support we can give one another. Thanks for sharing. 💪🏽", "veronicarossman": "Agree with the community’s sentiment here: you’re awesome and we are grateful. So, when is your book coming?", "rocio._.cuervo": "Thank you!", "controlaltescape": "You are 100% my favorite person on IG now. I wish we could all commit to being real people who experience all the ratings on the life scale. This is true success.", "tcdubb72": "You’re my new favorite human", "katieelliott108": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "melisamyers": "You are a brave wonderful women, you inspire me everyday @jengotch ! Thank you for your honesty, you help and encourage others more then you may ever know. Sending warm supportive energy your way today. ♡", "bearmom": "Oh mom I wasn’t ready for this. Thank you from the bottom of my heart.", "kelseybethune": "We love you.", "keri_nstyle": "❤️❤️❤️😘", "poefairy": "Thank you for sharing", "melissafromspace": "You, lady, have a beautiful, delicate soul. Thank you for sharing your journey- the good, bad, and sometimes painful. Struggle is real and it’s cathartic and vulnerable to expose. So thank you. 💖thank you using Instagram to connect and heal.", "alithompsn": "❤️❤️❤️", "mdrsey17": "Peace be with you. 💕🙏💕🙏💕🙏", "sister_kokoro": "Thank you for your sharing 💫💓", "choooch6": "💗💕💗💕", "seramai_k": "Thank you for posting this. I’m 34 and recently divorced from a great love. It was the most difficult thing I’ve ever been through and I felt very alone and overwhelmed. I so identify with your feelings in this video and your 7.8 now. I understand what a good place that is to be 👏🏻🦄.", "laurenloveslucca": "This is great that you are showing this vulnerability", "heatherflowernicole": "Thanks for being REAL 🤘🏻🙌🏻", "ninfaarana": "I can relate. Thank you for sharing.", "tanodajulu": "So brave and strong.", "kerigiordano": "I can so identify with this. I’m glad you shared. You’re incredible, and I love you! ❤️", "hoffmanjon": "We love you, Jen ❤️🧡💛💚💙💜", "velvetantlermarfa": "Thank you for your bravery", "see_dawson": "I am cheering you on so hard. Really thankful you put your struggle out there.", "miss_luckystash": "Bless your heart. Be strong!", "tuesdaymartesthefirst": "I remember your post from this time. How the growth of your business was freakin you out. Now look at you. ✨", "keeksahoe": "Brave + relatable 💗✨", "foley.meghan": "Thank you ... just thank you. Every day is a crapshoot. Not many medium days. Mostly medium low to low. I try to cherish the good days...sometimes so that my not so good days can fade away. But, know it. I want out but it's a force I cannot control. It's hard to describe to a therapist who does not suffer from depression. Some think I can try to look at the other side of things. That makes me want to scream. Anyway, thank you.", "miss_angee": "This is powerful. For me and so many others. Thank you.", "meghandebrosse": "💙💙 Thank you", "alison__wu\nVerified": "Verified", "janice45": "Sending prayers to Continue your healing journey much love", "katkalindi": "You are one amazing lady!! Very inspirational to share your whole self with us 💖💖", "tori.jori": "Thank you for being so open and vulnerable. I deeply resonate with this, and watching other people's mental health journeys reminds me I am never alone ♥️", "lookwhaticando12": "❤️hugs to you at all levels", "sambankson": "@chelseyhettrick this caption 💖", "angeladallin": "You are a champion. Thanks for putting yourself out there for the benefit of others 💜", "se_leena1": "Brave. Bold. I wanna be more like you.. #imtryingtoo", "taranlb5": "❤️", "sarahwilliamsphotographer": "❤️❤️❤️", "luckyrabbitfoot": "There should be a “brave” button on insta", "nerdalert1983": "You’re a badass! @jengotch", "mariaski63": "You are brave, strong, incredible on so many levels, & a giver! Tough to watch but I can relate to both your feelings & experience (in my own way). Thank you for shining light here & everyday! You’re effin’ amazing! 💗⚡️💪🏻⚡️💗", "m_anhaltzer": "Keep breathing! 🙏🏻", "offswitchshop": "So much gratitude for you, Jen. 💛💛💛", "annianna": "Thank you ❤️", "fiiimacphail": "Thank you for sharing your journey. It's very humbling. A very good reminder we are all human and have struggles. Sending you loads of love ❤️", "jennifer_jeremias": "❤️❤️❤️ to you", "zoeskeet": "@ckskeet90 this powerful speak!", "windyoconnorartandhome": "My heart breaks watching you in pain. So impressed that you are putting it out there to help others. Bravo", "nicoleza3": "Jen,I love all your videos, even this one because I know it's YOU. You never give us less than real", "_wanderingwoods": "❤️ to you. Thanks for sharing and for your honesty.", "melissa.rhiannon": "❤️❤️❤️❤️😘", "__olivia.jane": "❤️❤️ Jen, your realness is refreshing and amazing!!!!", "kissandmakeupartistrypdx": "Thank you ALWAYS for your honesty. I hope you understand just how much posting deep intense moments like this & your vulnerability help so many people.", "lowastelife": "You are so incredible. I resonate with this so much.", "dooleynotedstyle": "So inspiring, raw & real. ❤️", "martinimisty": "I identify with this all too closely. The ups and downs used to be unbearable. Learning to ride the wave as you say has been the key to my survival. And wearing my Everything is gonna be ok T-shirt 🙃. Thank you for sharing your journey. Knowing you aren’t alone helps many of us.", "emilieiggiotti": "❤️❤️❤️", "modchalet": "You are so brave and such an inspiration. I’ve been compelled to take photographs of myself at low and after heartbreak too- I have no idea why...maybe it’s to snap myself of my own dark thoughts or literally to get a different perspective. Thanks for being so generous and open with your struggles. Much love and support ❤️❤️", "westerngirl6": "That was courageous. Thank you for sharing ...all the best on your journey. You are loved.", "miss_ri": "You are an amazing, brave, beautiful, inspiring and hilarious woman. Thank you for sharing 💖", "lone.native": "Sending love to you. I’m glad you’re feeling better. Keep fighting the good fight.", "allisorrigby": "💛💛 a lot of love for you, stranger, on your journey of waves.", "kelsiewhite_illustration": "You brave brave soul. This is so honest and raw and human and comforting. Today you get the bravest human ever award ❤️", "vyemoran": "@jengotch you’re amazing and such an inspiration. Keep it up girl. You got this.", "jessval": "Thank you for this!!!!!!! I know so many people suffer from anxiety, depression, other forms of mental health but I tend to forget that when I, myself, am struggling. You’re so brave to share this. ❤️ thank you thank you again for reminding of this and reminding us that we are not alone.", "mj_atamian": "Your brave share has moved me greatly. Thank you.", "cherietallett": "It does break me to see anyone in this much pain, but it also gives me joy that you share how shitty things can be and we’re not alone. Proud of the 7.8 you are today ❤️", "smooches626": "@jengotch my heart goes out to you; this clip made me 😔", "jacqueline_cooke": "This was brave AF. Add this to the reasons I love you so much.", "jeanstance": "Thank you for having the courage to share. While it’s difficult to see, and experience our own pain, it’s always a good reminder that we aren’t alone. On the flip side, it’s always a pleasure to see the joy in your eyes too. Sending light and happy, rainbowy, glittery, sparkly vibes.", "jamieskolnik": "I’m so sorry, you aren’t alone I can very much understand this. ❤️", "discoballoclock": "Thank you for sharing this hard side! 💖", "ivyandstone__": "I’ve been in this place too much over the past couple of years 😔 thanks for bringing so much awareness to what those of us with mental illness go through. It’s so helpful to know we’re not alone. Big love for you 💖💖💖", "alainalapham": "keep on moving and don’t give up! you’re an inspiration ✨", "janaeeaston": "You give the world so much, sharing both your joy and pain.", "klevergirl": "Thank you for showing us your vulnerability and reminding us that social media can also serve as a platform to share the human side of humans. One day at a time my friend ❤️", "jimieileen": "Thank you for posting this.", "breakfast_at_briffanys": "Thank you for sharing ❤️", "jbilmer": "Love you so much . thank you", "ladybug0817": "So much perspective and honesty. I am moved by you then and you now. We all have many \"me\" identities... I'm fair to middling at the moment.", "weganmilford": "❤️❤️❤️", "pretty_o.d.d": "😢😢", "littlemissmomma": "I want to reach through this screen and hold 2015 Jen", "blanketfortadventures": "Yes!!! I remember telling my roommate many many many moons ago - I'm afraid to not be depressed. Like who am I when I'm not this. Do I even want to get better? Well, now fast forward to the future and yes I want to be better and 85% of the time my deep depressive states are a thing of the past. I'll always choose the 85% of wellness over the 0% anyday... Thank you for sharing your truth ♡♡♡", "nicolederus": "Holy hell. As if I couldn’t love you anymore... thank you so much for sharing this real, honest, and intense experience with all of us. 🏄🏼‍♀️", "whitneykentchamberlin": "Don’t know why this came up in my feed but obviously there’s 300+ comments so it’s got some instagram love on it. But I’m glad it did. I want to bow to you for the sheer fact that even though you’re a woman that loves material and love and fashion and fun and good times, you still keep it real. And I also appreciate that you’re not afraid to show your truth, your vulnerability on social media. Such a breath of fresh air. Even when you’re grasping for air. Thank you. (- Your neighbor)", "abrilcalavera": "I just love this! ❤️ you are an example of many things to whish for and I personally admire your journey and yourself to let you be all those \"stops in between\" that make you one beautiful human being. 👏🏻❤️", "amberlundyleigh": "❤️", "belen_montserrat_": "I sincerely appreciate your candor", "richiedesigns": "I’m so happy you’re in a better place", "itskattorres": "Thank you so much for sharing this. I also have photos stashed away when I was sobbing so uncontrollably that my eyes would barely open. I do the same as you, check back to see where I’ve been, where I am now, and gauge the space between how I feel now and how I felt then and whether that space is closing in on me. It’s so refreshing that you share this reality. It means the world. ❤️", "lexigoesthrifting": "💜💜💜💜💜💜💜💜💜", "theallomother": "Thank you 💓", "britt_buntain": "💓💓💓💓💓 thank you", "victoriacarmel": "❤️❤️❤️❤️🙏🏻🙏🏻🙏🏻🙏🏻", "alexinagrace": "💛💛💛 love you", "littelfang": "❤️", "m_khadhrawi": "❤️❤️❤️❤️❤️❤️❤️", "ladi_nred": "“It’s uncomfortable to move toward wellness when you identify as someone who is often unwell. It’s just as scary to feel happy and stable, because you honestly never know when the bottom will drop out again.” #alwaysonpinsandneedles @rachealtruitt (still obsessing on her so much)", "dixieandtwine": "💗💗💗💗💗", "gracesmith72": "you have no idea how helpful this post was.", "jessechamberlinmarble": "You vulnerability is very admirable. I love you and I am very proud of you.", "sfmama55": "Thank you for sharing your journey.", "tmelitaphotography": "💜", "dreamsinsars": "You are incredible ♥️♥️♥️", "bliss.mama": "This hits home, I am so thankful to be able to look up to someone as real as you. You’re amazing!", "s.alxs": "Ah I love you 💜", "kristenleighloves": "Thank you so much for being brave enough to share this. I too have felt this exact way. Actually it started almost exactly a year ago when I had my first full blown panic attack that landed me in the ER. I have come SO far over the last year, but these last few weeks have caught little glances of those dark weeks. I almost think it’s PTSD because of it being almost the exact time of year. I just remember the horrifying feelings of not being in control during those dark, panicky days. Sometimes it takes a good reminder like this to remember how far you have come. So again, thank you for sharing. ♥️♥️♥️", "emmaleedefreitas": "❤️❤️❤️", "piliglez": "Wishing you more happy days, incredible all your progress... 👏🏻 Thanks for sharing... Greetings 🖤", "shoploulouclaire": "Thank you for sharing this!! I worked as a mental health nurse with children and adolescents for 6 yrs. Too often they came in for treatment feeling ashamed, embarrassed, or fearful because they had no idea what was \"wrong\" with them. They often gave up on life before it's even begun because they didn't realize that there is help. Mental health awareness is so important. More than ever. Thank you for being so candid and open.", "_browneyedmommy": "You are so strong for sharing this. I just recently started following you & you are such an inspiration. 💜💜", "aside.edna": "You are my hero ♥️", "valarie__b": "Thank you for your bravery and honesty. 🙏🏽🙏🏽🙏🏽🙏🏽", "kinga.subject": "This resonates. You’re wonderful! 💪💕", "whatpossessedme": "Been there, too. Watching your video makes my stomach hurt and my heart swell at the same time. Thank you for reminding me that we can live through this and thrive. You are pretty terrific, Jen.", "notkrustin": "God you’re fearless. I sincerely appreciate how honest and open you are. So so so many women who are successful struggle like you have. And so many women who are struggling think they can’t be successful because of their mental illness or fears or whatever. Thank you thank you thank you.", "the_american_vagabond": "Your amazing", "michelletiffanycandice": "Thank you for sharing you and your story. I’m in a tough season and seeing your journey and transparency has made me braver ❤️", "phoebejaym": "Thank you for sharing this. A ton of people don’t understand the overwhelming feeling of anxiety and or depression, and the ones who do are rarely able to share what they are going through. I️ appreciate this and I️ appreciate you!!!! Cheers to riding the wave!", "gaby_lulu_": "💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞", "malynnuth": "Thank you so much for sharing! As someone who is focusing more on my own mental health and also employs those with depression, I do feel it is important to share what it is really like. ❤️", "j_ro_cro": "“Ignorance is believing the temporary to be permanent.”- a yoga teacher, that I had once. But really, here’s to wisdom and recognizing that all things good and bad pass, and hoping the good parts are long and the bad parts are quick. Appreciate you! 💙", "shutterbean": "👏🏼 thank you for doing the work on your mental health. You are brave, bold & courageous! Definitely what our world needs right now. ❤️", "rachelfarber": "“It’s just as scary to feel happy and stable because you honestly don’t ever know when the bottom will drop out again.” 👏🏻👏🏻👏🏻", "kerryinkahoots": "🙌💝💝💝", "earth.tonal": "thank you for sharing this on social media- we need more honesty in the full spectrum of human experience! thanks for reminding us we are not alone in our lows, that anxiety and depression are common, and that things can change. oh and for making me laugh a lot too. much love to you!", "melissagzehner": "♥️", "hannah4pix": "I guess this is what living out loud looks like. WOW, You are so brave, strong and resilient.. thanks for enlightening so many.🔥🔥🔥", "kimbers2882": "I have found myself in this exact same situation more often than not here recently and it really sucks..... thanks for being so open and sharing! Knowing you’re not alone and it is possible to get past it because people do is a blessing in disguise! Thank you", "regards.emeyer": "Brave of you to share, and refreshing to see such raw truth!", "kelseykopecky": "Proud of your progress!", "genkog.dkv": "❤️❤️❤️❤️", "ienvyseas": "It’s so helpful and amazing for you to share this!", "teelor5": "You are so brave 💚", "linda.rendon.37": "Thank you for sharing this. It's very brave. We are navigating through mental health issues and it is insightful to read your commentary and hopeful knowing you're stable. Thank you.", "longchicken": "Thank you for sharing and being so open 💕", "well.by.design": "You are so brave and so strong and bigger than all the things. You’re the real deal and THIS is why you are able to touch peoples hearts and give people real hope and real strength in the darkness. Much love to one hell of a human 💕", "juliefordherbison": "😘", "caroconqueso": "Jen, I am in this situation now. Share what steps you took to overcome. You are inspiring and if you can get out of a crap hole, then so can I!", "amberleevd": "💙 love you for this.", "ebekay": "Your so awesome either way. ❤️❤️❤️❤️", "julieharmsenfitts": "Thank you for your vulnerability. That takes a lot of strength and love.", "iluvjry2": "I have been through the same exact thing! Thank-you for being so open with your journey!", "kerrycrawford": "Love you.", "kristen_ley": "💙💙 proud of you! Thanks for sharing!", "jensagarsmith": "💜♥️💜♥️", "sayhellobirdie": "Thank you for your honesty and for sharing this post. You're an inspiration xo ❤️ 👸🏼", "evilkenst": "we've all been there at different levels. you are very strong to show this... u go girl!", "the_natalie_marshall": "I️ am in awe of your bravery and openness. You’re helping so many people by letting them know they’re not alone ❤️❤️❤️", "littlealejandra": "I appreciate you so much", "akvette": "So brave 💓", "befourautumn": "@jengotch Wow. Thank you for sharing this. This was me last night and it doesn’t feel good. Be strong, sister. 💙👊🏻", "larzmarie": "💗💗💗", "laurarewis": "🙏🏻❤️", "care_snider": "Thanks for sharing this Jen. It must be tough to be so honest with your followers, but it’s inspiring and relatable to see your mental health journey. 💕", "jewels0326": "Brave and courageous to share real moments, although we seem isolated you are not alone in your journey 💞💕❤️", "candyheilman": "i am forever thankful for you, jen gotch", "meglundberg": "❤️❤️❤️", "mamainbloom": "Thank you for posting this. It helps for people to see what it looks like. We talk about normalization and lifting stigmas but most people who have been in the depths like this feel far too much shame to talk about it- never mind let the visual exist. Thank you for being the brave one, Jen ✨", "weirallmadhere": "Thank you for sharing this.", "finding___home": "❤❤❤👏🏽👏🏽👏🏽", "susan_alexandra\nVerified": "Verified", "alinki": "Hang in there, beautiful! Ride the wave", "kiwijess": "Thankyou for being real and sharing that with us xx", "ill_take_whatevers_left": "I just finished reading Gorilla and the Bird: a Memoir of Madness and a Mother’s Love by Zack McDermott. It’s a wonderful read for a realistic glimpse into the delicate balance between unaltered reality and full blown psychosis. Mental health can make the dark times fucking terrifying, but sometimes I think you can’t know joy without times like the ones you show here. So...are the “dark” humans the lucky ones? Human experience is so dark and bloody and monumental. Thanks for putting something real out into the world. 🤡", "cloudmamax4": "You’re brave and amazing", "lindseyreyenga": "proud of you always for being honest with us & yourself ❤️ you’re the real thing, jen gotch.", "suzanne.sjs": "I can’t tell you how much I admire you for sharing posts like these. They make me feel braver about not hiding my mental health situation. Thank you.", "isagiuliani": "♥️🌈😘", "dvandylion": "Your courage is remarkable. This video will save lives.", "mama_absha": "❤️", "mosscottage": "You’re such a legend for sharing this & being so positive & honest & real!!! Big love💕💕 xx @jengotch ever need a Cheerleader just shout cuz we’re all behind you! 💃💃💃", "paris.rayneri": "Thank you for sharing(: it's always important to shed light on mental health and that it does get better.", "heatherhendrickshh": "🦋🦋🦋🦋❤️", "netanyar": "thanks for sharing 💜 💜 💜", "ohsarabeth": "❤️❤️❤️", "bambar17": "❤️", "thegeekzilla": "So proud of you.", "kelleyreierson": "Thank you for sharing this. Your honesty is incredibly powerful, and helpful, to those of us also navigating the wilderness of mental health issues, trying to find wellness. 💕", "x_geek": "despite the ups and down..you are doing well riding that wave and living your best life. you got this! ✨", "erinmcginn": "Why can't everyone be as real and honest as you, Jen? You are truly inspiring, not for just the pretty things you make and the empire you've created, but for never being anything but your raw and true self. Thank you.", "alijolee": "Thank you.", "switzart": "Thank you so much for sharing @jengotch. I had a panic attack today and I often feel alone in my struggle. Thank you for your honesty and your openness. ❤️❤️", "lexxfoxx": "love 💖", "kellyshewmakeup": "Love you! Forever..", "hellofarrugia": "I haven't even actually watched the video yet, not sure if I even can. But I gotta tell you, Stranger Lady That Lives Inside My Phone Squares Sometimes, I am so grateful for you. Grateful for your honesty and perspective, and your documentation. Grateful beyond words for every part of the spectrum that you share. It's valuable, and its valued. Thank you for sharing through both heartbreaking pain and terrifying happiness, and calling into the light that there is always a little bit of both. -From out here in Stranger Land, knowing some of the same things. And sending Love. 🖤", "katcollings\nVerified": "Verified", "idliketomakeareservation": "“...and not getting too comfortable at either end of the spectrum”. Thank you for this.", "vetalondon": "❤️❤️❤️ Love the honesty of this. The real, raw emotion, (including the physical manifestation of it) and the minutiae of life happening regardless (I’ll just be unpacking the dishwasher if you need me, love)... It ain’t always pretty, but it’s life. So very happy that you’re sharing yours with us. xxx", "sarahisrad": "❤️❤️❤️", "iamjoylarae": "@jengotch ... I’ve been there mentally. I contain my madness well but I can SOOOO relate. God bless you lady", "nadia.carmen.prevost": "I have a similar series of photos in my phone. Sometimes you don't feel like you're healing or that there is progress. Thanks for posting!", "cecily_thepapercurator": "Thank you for bravely sharing your story! You are an inspiration 💕", "rhymeswithfun": "Thanks for always sharing your real life ❤️❤️❤️", "emmasiello": "❤️", "lamywhinehouse": "You are so important. Thank you.", "jennyeveryday": "Jen you are just amazing. So brave and so inspiring. Thank you. ❤️😘", "haileylucillerichard": "You're so brave", "emilykprovost": "you impress me so much and i wish you massive amounts of goodness.", "jessicaeastlack": "So brave to share ❤️❤️❤️", "abbywischnia": "This is deep dude. props beyondddd", "annie_low": "So brave of you to post this. It lets people in pain know they are not alone. Thank you.", "dreaschneider": "Been there ❤️", "fleurdeoui": "Sobbing, cheering you on and sending you lots of love, lady! ✖️❤️✖️", "wealthyanonymous": "You are a beautiful person", "adventuresaints": "Jen, thank you. 💗 You are one amazing woman. Sending you so much love.", "blueeyedbirds": "This helps so much. Thank you for being so honest I’m sharing your story and experience 💓💓", "jamison.k": "you amaze me.", "shira8888": "You're beautiful 24/7 during highs, lows, in betweens. Thank you for being open and sharing with all of us. By sharing with us you are also helping us.", "aroundthewaylei": "♥️", "posymarket": "So brave to share. Thank you.", "petiteabsinthe": "Relatable. Here's to pushing through it ❤", "birch_lady": "❤", "aabbiiggaaiilll": "Jen Gotch you are AMAZING", "norcalpeach": "@geenamarieee", "emilyega": "Love how you are breaking the mental health stigma. Thanks for sharing❤️", "amydemichele": "Thank you for sharing, not an easy thing to do. 💜", "hey.katierae": "I love this quote: “it’s been about riding the wave and not getting to comfortable at riding the wave and not getting too comfortable at either end of the spectrum.” Thank you for being open and sharing this with us!! Makes me, personally, not feel so alone.", "alwayshunterb": "Thank you thank you ❤️❤️❤️", "sphericalbear": "and all the stops in between 💕 thank you for sharing, makes me feel less alone", "lvelght": "So brave...", "books_mytherapy": "Speak it! Courageous, thank you.", "xoerica": "It takes so much strength to post a video like this. Thank you Jen, for keeping it real, and honest. Thank you for showing raw emotions and reminding us it’s ok to feel like this. So much love to you. 💖", "iam_nlh": "♥️♥️♥️", "raqueleux": "😶 thank you. I’m grateful for your ability to share this. #justkeepswimming", "debrachow": "Thank you, Jen ❤️", "hudsonny": "Your vulnerability is such a virtue. ❤️", "millroad.studio": "What you are doing - being so vulnerable i.e. COURAGEOUS - is balls to the wall badass and what our culture needs more of. Thank you for being you.", "saraparsons": "❤️", "themrscardy": "This is brave. And commendable. And real. I have been there. Suffering with anxiety and depression for the last decade, it is so easy to feel like you are the only one that feels that way. But knowing you aren’t helps. A lot. Personally, I am currently in a low point, but like you said, there will be good times ahead. Thank you for sharing this. 💕", "leilamabyn": "You are brave and helping others with your honesty. Thank you! 👏🏻🌟", "bestlindsey": "💕💕💕", "vickichristine": "♥️", "cheeseburger_robot": "I frickin love you", "koranelleher": "Hey Jen we love you.", "vievepdx": "Thank you for sharing and being so open and honest with your mental health struggles. You are an inspiration.", "shilers": "💕💕💕", "thelifestyled": "You are amazing. Truly.", "abubblylife": "😢 ❤️", "hazelandscout": "Thank you so much for being brave enough to share the ups AND the downs of life Jen. It's an honor to follow along.", "createsinstyle": "Love how honest you are! A lot of us go through the same thing or similar and it's good to see that it's not just me...💛", "darkbluespeed": "Fuuuuuuck this doesn’t make me feel uncomfortable, this makes me feel SEEN//KNOWN. It’s wild the things we just don’t document as a society so we can’t ever quite prove to ourselves that other ppl are experiencing them too. Thanks for adding this to the 2018 mental health archive. I’m surely not the only one who’s feeling connected to you right now bc you’re brave enough to show the weird/ugly middle bits of anxiety. Love Love Love Love Love ⚡️", "lindsey_parry": "You are amazing. I am so thankful for your vulnerability 💕", "breannesedano": "❤️❤️❤️❤️❤️", "audreykelly_": "❤️💕❤️💕❤️", "teatoastandturmoil": "this is so real. you are amazing <3", "cappyandlee": "You are such a brave bad ass woman 🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "carolinaszen": "Thank you for sharing this", "raddlaur": "you are an amazing woman, and a true inspiration to me! ⚡️⚡️⚡️", "bee808": "❤️", "laurarongione": "💖💖💖💖💖💖💖💖💖", "chelseamclay": "Thank you thank you THANK YOU!!!!!", "jlcan36": "This makes me so sad and proud of you at the same time! Keep progressing lady! 💕", "wanderingfeminist": "💖💖💖💖", "rianne.hatch": "Thank You❤️❤️", "delaynakh": "♥️ thank you for speaking out and being so transparent about mental health", "endearinglyemma": "Thank you for sharing this. So important. So brave.", "runninchick": "Thank you so much for sharing! You are an amazing strong person! Always remember your strength!", "jlynnturn": "Bless your heart! Look how far you’ve come from there, girl!!! 💕", "esbaker3": "Thank you for sharing this. As someone that deals with an auto immune disease I have found myself also sometimes having a hard time moving forward towards wellness. It’s weird how this stuff becomes part of how you identify yourself. It’s really cool you share this stuff. Thank you", "gulushthreads": "You are such an inspiration to me. Thank you so much for your transparency and for using your voice for the fight against mental illness stigma. It means so much. 💕", "shop31suns": "❤️❤️", "meowandforever": "💖", "elvismilk": "❤️❤️", "putyourbootson": "❤️❤️ so much love and respect to you xx", "swiftymcd": "Love to you 💜", "lady_capulet": "Thank you so much for being so open and sharing with the world. Knowing that there are cool successful women out there that struggle just like I do is a great reminder that my emotional journey is a normal and shared thing and that I am not alone :)"}