{"artbymonicacohen": "Thank you! I’m dealing with both. Wish i could wear it with pride but still hard to even admit to the closest around me.", "bfizzlepop": "How do i get this!!?", "candicejhall": "@shannon_wellssss I want anxiety", "eatsleeppoop247": "I love this so much", "dani_dudek": "@dani.debenham", "nicole.matarese": "thank you.", "hannahxlark": "How do we buy a necklace?", "yusraakdeniz": "I love this! I suffer from anxiety and deal with it. Even if it sometimes breaks my heart... ☺", "giselle_sophie_": "@kimberley_sjhb", "southwesternstyling": "You’re a true trailblazer to attempt to normalize this thing. For me they will never be shiny gold letters that I’ll accept, they’ve wreaked havoc, limited me, isolated and embarrassed me. I never want to excuse myself of my behavior and blame that because I don’t think people have the capacity, patience or ability to understand so I usually just disappear for a while after a work related episode. These are hard words to choke down and accept. I could accept that I was an alcoholic and I could stop. But I can’t just stop this. And I’m 💯 responsible for my behavior and actions and yet not completely in control of them. I think it’s thought provoking but if we were to where all our diseases on are chest as scars.. my trauma feels minuscule when I see a man begging for money with one leg and talking to himself riddled with ptsd. I think it’s great and I wish you success in a Hope story that will not just normalize that we are all living in these conditions but that you’ll share tools that have helped you along the way 💋💕👍", "meeyaahhhh": "@shesmeredith", "anna_blalock": "@southerner_says", "hibeebrennan": "@smillertime14", "baldy_sd": "@samantha_rei @whatfrannywore I just bought both of these 😂😂", "meatorcandy": "my mental illness isn’t your fashion accessory, thanks.", "calli_pratt": "@ajlavene I need the anxiety necklace I really want it!", "cmon311": "Love this. Love that finally people are working to remove/improve stigmas. Will the anxiety necklace restock @jengotch ?", "meriholly": "Want anxiety necklace! How?!!!", "healthline\nVerified": "Verified", "sahfinn": "Please restock 💕", "tamaranitai": "@breakingintomylife", "toughcookiesoapco": "Please make one that says, \"Dermatillomania\", also known as skin-picking disorder. It would mean so much to me.", "koelbybryant": "Reading your posts on mental health have been very uplifting. I’ve always adored your work but it means so much more to me now. Thank you for your transparency and creativity ✨💕", "angmatange": "@shebulley I want one or both of these necklaces so bad! I'm tagging and telling you this in case anybody needs help figuring out what to get for my birthday next month... #hintsforthehusband", "jengotch\nVerified": "Verified", "stephcamefalling": "Will any of these proceeds go to POC mental health sources? You know considering you’re taking a Latinx/Black culture created style and it has been the style for many many years?", "_ebbandflow": "@katersteinberg", "neensschaeffer": "@jengotch I second @starp0werrr and their question. Seems like you need to do more on educating yourself about cultural appropriation.", "alexis_alexandra_briano": "@amberlcady", "coordinatedcat": "Any plans of restocking soon?", "thecurrentschmidtuation": "I MUST have these in my life ❤️❤️❤️", "emmelbourne": "@k8_180", "alexandraarguello": "Bring this back!", "siristolenanderson": "How do I get on the list!", "kweentiph": "@mrs.erikaz", "artsnob_vicmaidhof": "I want both, when is it coming back?", "love_you_more_xo": "@jengotch when are these going to be available again to buy? I keep checking and signed up for email notification but no luck 🤷🏼‍♀️", "catroyal02": "@jengotch When are these beautiful necklaces coming back for purchase?", "meredithgarnerh": "@katherinemdalton", "alexandracowqueen": "I love this.", "amcrb": "@jizzlepez this is what I was talking about the other day! ❤️", "talknerdy2me_": "@xploreurbkyrd", "ashdoneli": "Any idea when these will be back in stock?", "tlee79": "When are these coming back! I just for the first time opened up about my anxiety", "lexisacco": "I need! 🙌", "shermanator809": "@jengotch I’ve struggled with anxiety since age 24 when I had my first panic attack. I completely get this.", "7csalts": "🙌🏻yup never a trend. I love this so much.", "anahisouchereau": "@jengotch i really hope i can afford these someday, depression and anxiety being main reasons why i can’t earn a living/work......", "youknowtd": "AMEN! Keeping it real about anxiety over here, especially in corp America.", "pinkpeonies4eva": "When will anxiety be restocking?? I want I proudly wear one @jengotch", "nicoledanielller": "@getmorice I think these are the coolest thing I’ve ever seen", "dyedinthewoolyarnco": "Thank you.", "lyssaslyfe": "Amazing!", "cathmeifyoucan": "Hi Jen - do you know when these will be back in stock? I am desperate to wear my heart ❤️ on my sleeve , well around my neck... @jengotch 🙏", "kellyann1020": "🖤 u! & thank u for this..You r absolutely doing something wonderful! I hope I am able to get one when they r back in stock. #anxiety", "gruljevaite": "Love this! When will they be back in stock, I want one!! ❤️", "slowdestination": "I love what you are doing!! It inspires me everyday.", "audgehancock": "You should make these into rings!!", "kyliewriteshere": "@nikiflemmer I feel like you'd be all about these. :)", "aphroditecomplex": "They’re sold out 😭. Are you bringing them back? ❤️❤️✨", "lisforleslie123": "Should we all just start chanting “re-stock” “re-stock” “re-stock”?!", "katiezoe": "Amazing. About two months ago I walked into my dr’s office to talk with her about my mental health. Not only had I not showered in 3 days, but I was wearing the same yoga pants and sweater I hadn’t changed out of in 3 days. I had taken on clients who needed very clear boundaries communicated and I wasn’t in a mental space to create those boundaries, so every time the multitudes of texts and emails came through from them I only got more anxious. I was in the waiting room, filling out the quick checklist analysis of what level of depression I was feeling when an email popped up and I burst into tears. I had been drinking and eating to excess, gaining 30 lbs, a number on the scale I had only seen during pregnancy. The only reason I didn’t score the highest number on the depression screening was because, while many days I laid in bed thinking I could easily never move my body again, I never wanted to actually be dead and leave my children. I’ve since responded really well to the medication I was prescribed and feel capable and hopeful. It’s been an eye-opening experience, also brought on after a divorce, but took years and a few more heavy events to get to a place where I realized I was not okay and didn’t know how to get okay again. Thank you for speaking out. It was so important to me to start watching videos of people describing how they felt with anxiety and depression and identifying the symptoms that I was feeling as well. I felt less alone in the vast darkness of depression. ❤️❤️", "ginsengandhoneyco": "NEED", "girl_genius": "Can you please make these in silver!??! Pretty please!", "maurias": "I need these!! Are you still sold out?", "thenannyleague": "I just love you ✨", "emihagfish": "💕", "salanderlisbeth82": "When are they back on sale?", "forestceramicco": "❤️❤️❤️", "toxictina": "@maddieoriley you’re right! Thank you!! 💖💖", "gabriellasalicetti": "@brennabreadstick", "shanafrase": "it would be wonderful if you could make bipolar1 & bipolar2 - or just bipolar -necklaces as well. you truly inspire. thank you! for all that you are 💕", "rosedavisx": "Amazing thank you", "emilyrowanstudio": "These are a beautiful and brilliant idea.", "wilderandmae": "This 👌🏼", "alouisecollins": "@shannon.m.dougherty", "sarah.mcclendon.campbell": "Sold out! 😩", "anotherthread": "Will these be restocked?", "___chepa": "@iamalbertm what her caption said ❤️", "littleladychang": "Oh my goooodness. I signed up for the email notification I sure hope these can be restocked. Just in time too because lately I’ve been having more and more anxious feelings.", "charlestonweekender": "This just made me even more happy to see you this weekend st @makersco_. You rock!", "hans_land": "@missjennaxo ❤️❤️❤️", "marierao": "You are the best!! I need anxiety necklace back", "iwasdancing": "Thank you for helping diminish the stigmas around mental health. Love this idea and would be proud to wear these. ❤️", "katieb313": "@earthlingelaine this is so awesome ✨", "blushinginhollywood": "@annabelledesisto @meagangrainger", "efrankola": "@chelseaburnham", "stacyl0712": "Thank you -- what an excellent idea and beautifully said post. My daughter (13yr) suffers from both of those and it breaks my heart. Good luck to you and everyone that they touch. 😘", "artyparty77": "You are really awesome. Thanks for putting yourself out there. I really admire you😘", "kaylaraereid\nVerified": "Verified", "hipsterhobos": "When will these necklaces be back in stock? I'd like to order both 🙏", "saintcourtesan": "I would love to see a “manic” necklace...as someone with bipolar I would love to wear both for a conversation piece and get that dialogue going. You are amazing!", "klhaber": "Love this, thank you! Can’t wait for the “anxiety” restock! 🙏🏻 💕", "ckm1021": "I love that this has become something that is finally ok to talk about, no more silence on mental health. We need to talk about it and bring to light and support each other!! I’ve had anxiety my whole life and depression for almost 30 years. I won’t be silent anymore!! It’s ok to need help, be different and to talk openly about mental health! I truly hope that these necklaces are restocked and Will proudly wear one 🧡💛💚💙", "theglutenfreelady": "Fuck you're awesome @jengotch", "thewilliewags": "@jengotch you are an inspiration! Would LOVE to have you speak remotely to our Women’s Collective about this if you are interested. You are amazing! (Insert slow clap) 👏👏👏", "happy.headspace": "I LOVE this!", "summerjoyv": "You are an inspiration", "chandrawellness": "💙💙", "katelynsailor": "@melindagale", "kimerakoffee": "Great post!", "seejessgrow": "Please make more so I can buy them. I need a depression and bipolar one to wear at my Keynotes \"This Sucks, It's not Okay and That's Okay: How to Help Friends & Loved Ones Understand the Language of Depression.\"", "illustriousjane": "This just made me cry! Best idea ever! 💗", "portlandtinyhouse": "Love that you are going working to help break down the stigma around mental health issues! Thanks for speaking openly and being vulnerable with your experiences. 💓", "missmultee": "❤️❤️❤️", "amoreroux": "I neeeeed one of these !", "sliceoflimephoto": "Your bravery in tackling these topics with such openness and rawness and humor is just, wow. So needed. Thank you.", "edencreature": "Terrible concept that continues to stigmatize mental illness by making it an accessory. Notice how only two “acceptable” illnesses are used. Where’s the schizophrenia necklace? The bpd necklace? An anorexia necklace? They don’t exist because those illnesses aren’t as easy to de-stigmatize as acidity and depression. People wear those two like accessories all the time and it does nothing but further the romanticized version of them we see in the media. Shame on bando for using illness as a way to accessorize and belittle mental health awareness.", "kelseymarieclaire": "@liznovakhairstylist", "baytheartist": "I love this so much. It’s so hard trying to reduce the stigma surrounding mental health, if we all do our bit the world will be a much better place. Thank you.x", "apenandaplan": "I love these", "daramadylen13": "I love these so much. Thank you. I’m ready for them to come back so I can get them both. You have helped me so much with my own mental health and taking control. Thank you, Jen. My heart is yours", "bcar1125": "♥️♥️♥️", "orsonthecat802": "Love.love.love.you! I feel good. But it takes the WORK. And it takes SUPPORT. And understanding. And accountability. And the will to speak even when it’s uncomfortable. I love what you’re doing.", "mistertopher": "You are easy to heart.", "codywilshire": "Amazing.", "rowannfaris": "Thank you so much. What you’re doing and sharing is so important 💗", "shenleyonthames": "Wow! Inspired creations.", "elizabeth_ellery": "I think you’re just amazing, if you could help just one person with this then wow! But I’m pretty sure all your heartfelt posts touch many many more and they’ll hopefully find it easier to talk as it’s hard subject to talk about. Thank you for what you do xx", "bookfawn": "💛💛💛", "avidanopomar": "You just made me cry. I've been following your work and ban.do for years now and you're an example for me Jen. Please keep sharing, so we on the other side see that it's okay to share. It's okay to say that we are not okay, even when we are amazing women with amazing ideas. Thank you ❤", "shale27": "@ktwtookdispic 😍", "megwlove": "Definitely support your work in the anti-stigma movement! Love the idea of bringing people in to talk about MH. Definitely not interested in honoring or wearing the word of something that has haunted me my whole life and nearly killed me. Maybe I’m not ready. Maybe I just need a few more years of positive mantras and to truly believe that I am more than and also stronger than my depression. Will not stop talking and working in MH.", "monicamonique_llc": "Love you😚", "mainlygrayboutique": "I wrote you a DM ❤️❤️❤️", "tarawhitney": "🙏♥️👌", "boobs.for.babes": "Yes thank you.", "toninoel13": "@jen_b_jewelry @jenstander buy two get one free?", "futureballad": "Had my first anxiety attack at 7 and felt crazy my whole life: really appreciate you and your candor.", "helen_fernandes": "So great. Thank you @jengotch.", "majorbaggage": "Let's add a \"Panic\" charm! I have always connected to the Ban.do brand - now I know why! Xoxo 😘", "jenniferdoesstuff": "Love this so much!", "sayhellobirdie": "Thank you for being you ❤️ Thank you for having honesty & integrity ❤️ Thank you for sharing this ❤️", "gypsysoulqueen": "Just found you because of @edroste ❤ I've had anxiety and depression since I was a kid. I worked in an alternative treatment center to help others heal from addiction and mental health. I loved this career so much and it was the same treatment center I went to 8 years ago to get clean. I wanted to get help but the 12 steps wasn't for me. Unfortunately the treatment center went bankrupt and I lost my job. I've been working on creative projects to raise awareness and hopefully encourage healing for others. I'm a musician, artist, and dancer..and use these outlets for myself and hopefully inspire others. @grizzlybear has been a huge inspiration for me and I find their music is far better for my well being than an hour in therapy. I'm eternally grateful to them and to all the musicians and artists I love so dearly. Anyway, just wanted to say I love what you're doing and look forward to getting both those necklaces when you restock 🙏💕 @jengotch x", "msfleursbliss": "I love this! ❤️💕", "madzmeetsworld": "♥️", "zontziry": "Having recently opened up about my own mental health issues and trauma that contributed to them, I absolutely love this. Where can we order these?", "cappuccinocartel": "Can I get a 'self doubt' 'socially awkward' and a hell yeahhh", "yukimackdivasenorita": "I love this concept!!! I would love a “socially awkward one” too! A bitch is about to have chains on like a rapper 😂😂😂", "cocollected": "Omg I have those! Not the necklaces, the disorders😐", "baybaycoble": "@leesacoble love!!", "theclassixxvtg": "@jengotch are these back?", "rachaelsteacyevents": "So happy, as always, to be your customer and fan-girl. Thank you for continuing to share your journey with us, and for giving others with similar experiences to do the same. Sending you all the best vibes, and not just the trendy kinds either. 💖", "marneyschaumann": "Just beautiful. It took me years to realise I had depression and anxiety and actually do something about it. Even with medication I still feel the subtle fluctuations of hormones that remind me of what it’s like without medication. PMDD sucks.", "britbronson": "❤️ @staceybronson @joyce_harris @ali_bronson", "k.in.the.now": "This is awesome! I'm a psychiatrist and I still have trouble speaking about my own struggles with anxiety and depression. I needed to wake up to this post this morning. Thank you ❤️", "lautindou": "When will they be back in stock?", "ems_hood": "❤️👏🏻", "topanga_vintage_market": "Such an amazing idea.", "nicolekblanco": "@lockandkeep you need these!", "mollsnota": "❤️💕", "missbellpr": "This is so wonderful, 👊💪 @jengotch", "chloe_alexandra__": "@chachichuchu", "ilni12": "I'm a therapist. Keep doing what you're doing. You make me laugh and smile and cry and feel alive. Amazing.", "clbgay": "Looooove", "ohgollyholly": "@beccanaber friendship necklaces?", "browneyedbec": "I LOVE this. I need these. People are very uncomfortable when I talk openly about my anxiety disorder diagnosis & past depression. Thank you for raising awareness Jen! @jengotch 💟", "lovejoco": "@jengotch I love you!!!!!!!!!😘 thank you 🙏🏽 Now I need my necklace kthanksbye", "crazykt81": "💚Your strength is inspiring! Keep using your voice!", "jackiejkan": "❤️", "miscmarilyn": "I love this idea! I wouldn’t be comfortable talking about my depression at work. But I think it’s great that you are opening doors for this conversation. 💕", "secretsocietygoods": "Lovely. 🙂", "edroste\nVerified": "Verified", "ajunger86": "@sofein99 love thesee", "sheilaherrling": "You are a force of extreme good in the world, @jengotch.", "lindseyisalady": "I can’t wait until these are restocked. I’m getting them for me and all my friends.", "caivka": "😘♥️", "amyamy723": "@art2fart", "_sailorcoco_": "👏🏼👏🏼👏🏼", "infinitevisi0ns": "Please try to stop identifying youselves with being “depressed” or having “anxiety”. This only makes it worse with no end insight. This is not okay. This is a horrible message to push to the world. Show a bigger responsibility. Identify with “self love” and watch the all good around you grow 🌱", "_lynn_ie": "You are truly an inspiration to ALL. Thank you 👋💋", "lilydenver": "All of that @nicoledabeau", "jillianadriana": "Thank you for this! I ordered 2 necklaces for my sister and I!", "thesarakern": "🙏🏻❤️", "theotisclyde": "@spaceghostroce She is so important. I love this.", "morgan.searcy": "This is really helpful to see! I needed this today 😘", "perez_sere": "I’m lucky to follow your posts. Thank you for sharing.", "kepos": "Hoping to be able to order when back in stock!!!!! 💜💜", "mirandayontz": "🙌🏻🙌🏻💪🏻💪🏻❤️❤️❤️", "katieweiss": "@meghann.moorhead", "allthebeautifulthings17": "Thank you. So called friends who have never experienced this don’t want to talk about it. In fact they start to shun you because they want you to get your “shit” together, but it’s not always easy. I am grateful for the online community I have found that gets it and for my therapist! 😊", "heylaureng": "🙌❤️❤️❤️", "karma_ks": "Thank you. I’m bummed I didn’t get one, please bring them back! I feel judged by even my doctor for having anxiety... so it’s nice to have someone up here talking about it in a non-judgmental way... it actually really helps, so thank you for that.", "goodgirlchroniclesllc": "That is awesome !", "suzannah.thompson": "💙💙💙", "carolynbuch": "💖", "aklimton": "❤️❤️❤️❤️", "presentandpeacefull": "I’m a therapist in the mental health field and also suffer from anxiety I found this to be powerful and a unique way to start conversations around the topic of mental health. What people often forget is how many of us are impacted by it and are often shamed by it. We all have different ways of processing through our mental health but I think this is one way to de-stigmatize it and help others realize they’re not alone 💜thank you for being open & transparent about your experience!", "meagan_mh": "❤❤❤", "kbarber19": "🙏 merci un mille fois", "lizi_laurel": "so in love with these, will there be a restock? ❤️❤️", "yellstill": "Thank you for continually sharing your journey 🙏", "mollymarler": "So so wonderful, @jengotch . Thank you!", "thankyouforthat": "PLEASE MAKE ADHD / ADD ones!!", "little_bits_of_glee": "💛💛💛", "jannakingk": "❤️❤️❤️", "afearlessdove": "Need some OCD bling✨ y’all know what I’m sayin?!", "laruepr": "<3", "pizza.and.chandler": "Please restock!", "valsdead": "💛", "aliciapeat_watson": "🙌🏻💕", "michaelaradman": "❤️❤️❤️", "sarah_harmeyer": "Beautiful.", "mandajaneisthename": "@jengotch thank you.", "jlforsyth": "The world needs more people like you❤", "emiliemuller": "Don’t stop. What you are doing is brave. Very. I’m hoping you will restock these soon....", "katenelsononline": "@jengotch I bought a planner from @shopbando at the beginning of this school year (my 8th cumulative year in pursuit of just one BA), hoping it would add some light & fun to my last year of college, the journey to which has been full of anxiety, depression, self harm and under it all, undiagnosed ADD. On my worst days, pulling out my laptop and notebooks felt impossible, but pulling out my planner first, with its mantra “One Day at a Time” written across the front, has helped me so much more than I ever thought it would. At my lowest points, the cheerful and inspiring messages inside have genuinely cheered me up and have beat back the loud, cruel inner voice I can never seem to shake. I support you forever and ever and ever and I am so grateful for all you do to de-stigmatize these illnesses, and I love you endlessly for the honestly and integrity that you lead your life and your business with. Thank you ❤️", "katieaselton\nVerified": "Verified", "theinspirationalmomma": "I love this more then you will ever know! As a mom it’s important for us to be able to ask for help. I suffered from anxiety and frustration for a year because I was scared to tell my doctor. #getoverfear #speakout #speakup #menralhealth @laurenhopespeaks", "ange_who33": "Hoping these restock soon.", "saramoon": "💌well said❤️", "creativethursday": "❤️ beautiful", "chelseamcdonnell13": "So excited to get mine when they’re back in stock — thank you for this!", "johannelilalarsen": "Love the necklaces @anja_kolby!! 💥💪😎", "julietjulsv": "❤️", "danyeee": "Honestly, what you’re doing and how open you have been has dramatically changed how I feel about my bipolar disorder. I was always so ashamed to speak openly about it. It’s so refreshing to be able to look up to someone like you and know that I’m not the only one out here takin my crazy pills and waiting for the waves to stop crashing inside my brain. You truly are a crusader and one of a kind ❤️ ...it’s people like me that need people like you. We are in this together 🤘🏼 THANK YOU", "tajb33uyd": "Love. Keep going!", "leesacoble": "@baylee_coble ❤️ this post.", "yourkompas": "You’re a superhero", "teee7": "@katieve21 we need these 🙌🏻", "ohdeertilley": "I love you Jen Gotch ❤️", "shoshmo": "I feel like the necklaces shouldn’t be singles, but stackable or charms - I’d be OCD, anxiety and depression. It’s like that Lay’s commercial, “bet you can’t eat just one” 🚰😢😖😀", "kelsitenango": "I cannot wait for these to come back in stock", "goldilocks3": "Just seems like a great company to work for! An accepting company @jengotch", "bg3w": "Perfectly said 🌈💕", "roger_hutchison": "Would love to see a men’s line...maybe leather bracelets with these words on it. I’m a man that suffers with anxiety and I’m learning to live...really live...and share my story with others. You are hilarious and inspire!", "charlycrox": "@jengotch when will more necklaces be available?", "blakehazard": "Beautiful. ❤️ Go Jen !", "ejwmcintyre": "@reverend_anne need", "epicurean_homesteader": "❤❤", "jennalhatfield": "As a writer in the mental health sphere, I appreciate all you’ve done and continue to do. 💚", "the.fourthday": "♥️", "vanessaquigley\nVerified": "Verified", "ashleyjunebug": "Thank you for being you.", "claire_kramer_mackinnon": "💙❤️💙❤️💙strong wonderful honest! 💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼", "golden_life_plans": "*bold", "anja_kolby": "@johannelilalarsen ✨⚡️✨", "lizknotts": "YES YES YES 💖", "lovebrandyc": "Thank you, Jen. 💛💛💛", "ebekay": "❤️❤️❤️❤️❤️", "yungchalee": "❤", "thecasapino": "This is why people love you so much! Yes to all of this! Here’s an idea, what about expanding the line to all “invisible” diseases?!? Haha, I’d like an Endometriosis and infertility necklace to wear along with depression... 🤷‍♀️ So pumped about this awesome awareness", "alextaylor57": "🙏🏻❤️👌🏽💋", "onwrd_upwrd__": "I appreciate so much what you’re doing!", "alimariemontgomery": "@reneegabrielle friendship necklaces?", "meldubie": "❤️", "dmbmcguire": "Can’t wait to get one!! Keep up the good work. Bonus if you can get them out in silver time too.", "kelseymayblocker": "Thank you. ♥️", "loupe_dreams": "Thank you for doing this. Much love.", "dhridge": "These necklaces rule, and it's so cool that you've created a pathway to a philanthropic cause! Legit!", "erin_sinclair": "Your willingness to talk openly about your mental health is so inspiring. Thank you 🙏", "dididerosa": "❤️❤️❤️ thank you 😊", "yourgirlabs": "❤️❤️❤️", "amanda.rose.85": "Ummm, can I please work for you?! So fucking rad...thank you🙏🏼🖤💎", "palebeans": "ily💛", "flowersandgarbage": "LOVE YOU 💛💛💛", "halfthestory": "Thank you for using your platform to empower others. You’re a hero", "sarahpigott24": "From tackling sadness and stress to fighting stigma! So awesome. Thank you!", "eleanorfolds": "❤️", "daaaandilion": "❤️💯 thanks for never giving up on us @jengotch !!", "itsamegasaurus": "❤️❤️❤️", "debed17": "Very well said! ❤️", "okayandie": "There is no one size fits all when it comes to dealing with mental illness, what you’re doing won’t cater to everyone but it will to many, like myself. I love what you are doing, I love these necklaces and their meaning.", "jennrak": "❤️❤️❤️❤️", "kerryinkahoots": "Any idea when there’ll be more available?! They’re so perfect!💝", "mackenzeer_": "when will these be back in stock?", "jaggerwockie": "♥️", "madorangelove": "I love these. And I love that you and others are able to speak about mental health publicly. I’m typically pretty open, but I’ve found that many people, even good friends, shut down if I mention anxiety and depression. In person, in an email, online. It is ignored. It leaves me in a very lonely place at times. And it makes me not share about it anymore. So thank you for all that you share.", "_dagger_": "Love what you are doing, love your heart; keep on, keeping on @jengotch 💖", "melissathebeautiful": "Thank you!! 💖💗💖", "shekirab": "❤", "readysteadymagazine": "I 100% agree. Xoxo.", "basicbitchster": "I would love a Bi-Polar one!!!!!", "kemigreen": "❤️", "stephaneeee_39": "❤️❤️❤️", "ofjourneysnroots": "I love this. 💝 thank you", "idratherbeadiscoball": "You are so so awesome. 💖", "walkietalkiesmile": "i love your approach to mental health and everything you are doing to open a dialogue around it, you’re making it easier for everyone!!! ❤️❤️❤️!!!", "dogloverepeat": "Please keep doing what you’re doing...busting through those stigmas, keeping the conversation going, helping those who know exactly how you’re feeling. 🖤You’re moving the needle.💪", "chaunceyone": "❤️❤️❤️❤️🙏🏻", "sofein99": "@ajunger86", "happyroadfarm": "@jengotch please make this necklace in gold and a tiny sprinkle of diamonds? We deserve diamonds 💎", "elleebeans": "You put this perfectly. Thank you, for using your voice for not so easy topics, for showing us you on your not so good days and for showing us your 9.1 days💕 It takes guts to show and talk about the things that you do! I thank you for that a million times over✨ You and @shopbando do amazing things, can't wait to see what else you guys have in store for us💕Ps. Keep doing you, Jen❤", "blakeloates": "I’m so so excited for mine!! You’re doing amazing things, Jen and the ban.do team!", "lchelsom": "Love them!!", "messie_jattos": "@mlecal you see this?", "atinyballoflight": "Is there an OCD one?", "rachelgeorge51010": "🙏🙏", "twfloraldesignco": "I vote for a #codependent necklace!!!!", "magicmirroruk": "Flipping hell 😂", "ingridhaas": "I love this!", "immortalmask": "if you need some photos, Id love to work with you, if your interested we can discuss my rates.", "nicolemauthor": "❤️❤️❤️", "annietaylordesign": "@jengotch I’m so grateful that this conversation is happening more regularly nowadays. I too have struggled in my 40 years, and am so thankful to have found a wonderful therapist. Mental health sound be talked about all day and everyday! And needs to be a part of the school curriculum starting at kindergarten!!!", "jess_botkin": "❤️❤️", "criswoodsews": "💯 👌🏼💕", "gabbyham": "It's seems like it's trendy but that's because you're a trendsetter 💕 finger on the pulse starting important and relevant conversations ❤️", "dareaton": "Well said, thank you from me (someone else who suffers from Anxiety)", "shopryanporter": "Even though we've been making these necklaces for years and it's easy to get caught up in jealousy, we still support you. Even if you help just 1 person, you've succeeded. 💖#fuckanxiety", "brandysroberson": "❤️", "ifurie": "❤️❤️❤️🎉🎉🎉", "harold_and_oats": "❤️❤️", "jessichaas": "Thank you jen", "kelsiannsullivan": "@kstillions @eadunc this lady is the bomb and I want that anxiety necklace", "terricat": "❤️❤️", "katierspurgin": "Love!", "macherstudio": "🖤🖤🖤", "lindseykasch": "❤️❤️❤️❤️❤️❤️", "joyboytinkertoy": "I would like to win both of these lmao.. #specialneedsmom #depressionsucks", "tatami_home": "Love you ❤️", "daydreamarcadekids": "Thank you. I’ve been wanting to be more public about my struggles and the struggles of my family. My mom has uncovered generations of mental illness (mostly untreated) while doing genealogy research and I feel like I am finally going to break the cycle of destruction. I feel so much for all of the talented, strong ancestors who struggled without help. I love this wind of change.", "jesslwhittaker": "💕💕💕💕💕", "loveshayda": "Love this!!!! So wonderful that fashion is also bringing awareness to mental health!!! Thank you!", "strangexphenomena": "@thrive_traumainformedyoga ❤️", "trixie_mcbimbo": "💓💓💓💓💓 Thank you.", "tracyrubzrahn": "I never spoke about my mental health and battles with crippling anxiety for years and years. Always choosing to “power through” or relying on my stubbornness to “fix” myself. 5 years ago I just couldn’t continue in that unhealthy cycle...so I opened my mouth. It was terrifying, and shameful and embarrassing. But slowly, I’ve been learning just how beautiful and empowering sharing in each other’s brokenness can be. We’re all still journeying...and any aid to keep dialogue flowing is a HUGE step towards healing in my books. Thank you for being a voice for the journey", "adrianne_rob13": "They’re sold out. Will you be getting more?", "mirandaright": "😘🌈✨✨✨✨✨✨✨", "pemberleyjones": "Love it so much! 💕", "hevdabev": "You are making a difference. You are important. You are using your talents for the benefit of others.", "shopsundae": "Will you be restocking??", "realtormichela": "Love this!", "paytondfrisinger": "I have anxiety, ADD, and depression. I love this! ❤️", "meganxxrea": "You'll always be one of my biggest inspirations Jen. This and your story when you first received backlash really touched me and I'm so so so happy that you're not backing down and continuing to fight for transparency and awareness on such touchy issues.💖", "valeriekiserdesign": "❤️", "brooke_anne": "❤️", "getadvancedchic": "💕💕💕😍", "amy_m_sd_and_la": "Thank you for sharing. You are so brave! ❤️", "rozzetty": "@coelijaniak", "joynewell": "Thank you ✨❤️🙏🏻", "holls_9": "❤️❤️", "theguiltymuse": "🤟✌🏽🙌👏🏼👍🏽", "shizmcnally": "❤️❤️❤️❤️", "eastendprints": "These are ace ! Well done 👍🏿", "superdumb": "I need a \"crippling self doubt\" one, when you get ready for reissuing these…", "nosleepnever": "@ericariker", "olsen_kelly_": "❤️", "emilyperrytresser": "Love!!", "ljro": "🙌💜🌈🦋🦄", "morganausterweil": "Can’t wait for the restock! You’ve already led me to be more open about my depression/ anxiety with new friends and it has helped them feel less alone and given me the space to be authentic and open and honest about my issues. I thank you for that and for this! Can’t wait to rock mine and have more open discussions about mental health!", "cinuol": "@allisonmcd want 😻", "knee_coal_": "Your bravery and authenticity mean so much to me!! Thank you for constantly reminding me that I'm not alone in my struggles ❤️You're the only reason I keep my Instagram account!! Well....you and @drjamie14 😉👋🏼", "riley.calls.me.mom": "♡", "process_in_progress": "as always, thank you. 🖤", "ariellevey": "🧡🧡🧡🧡", "jennyalmonte29": "Bought my #Anxiety necklace! Thank you so much for doing this!!!!", "alifriedman": "♥️♥️♥️", "christinacarleton": "💗", "annieelizabeth87": "❤️❤️❤️❤️", "jenamedee": "♥️♥️♥️♥️♥️", "andrea_putman": "Love it. Want one.", "pattymessner": "💗", "__erhead__": "♥️💖♥️💖😻💖😻", "kelliupshur": "thank you for talking about it openly on such a huge platform. @jengotch you're pretty cool, and I fucking wish I stopped you walking by me at rose bowl so I could say hi :'''''( signed, a fellow artist with generalized anxiety disorder (with hopes and dreams of being nearly as successful as you)", "pout_dracula": "@savannah.renaud @carlieccarlie @hallie_selinger", "aguyatt": "Thank you for sharing 💗", "nataliabee": "You’re a gem Jen! Keep up the great work 🙌🏼💖", "elisehanna": "Mad respect for you and Bando. Stay true to your path of goodness.", "gretanell": "❤️", "queensparkle1": "♥️", "crnine": "Thank you for helping to destigmatize anxiety, depression and deeply feeling, thoughtful human beings who sometimes struggle. I’ve been very open about my struggles with both of the above and I have to say that I’m often met with either, silence, Looks of consternation and just plain avoidance. I continue to talk about it because it is as real a feeling and state as all the others, and for me, authenticity is king.", "bravejujubrave": "Can’t wait to get both of these!!! 🤪❤️🙏", "bellamafia9402": "Thank you!", "rufpop": "♥️🌈", "jonicamelanie": "🙌💛⚡️", "justthebeth": "Doing the right thing. Way to go @jengotch and @shopbando", "choooch6": "You da bomb @jengotch ❤️💓❤️💓", "ale_hand_draw": "Same", "evoult": "OMG ARE THEY LIVE NOW?! I have to have the anxiety one!", "suzannewithaz": "💓💓💓", "busyphilipps\nVerified": "Verified", "carolinesomers": "FUCK YES change-makers know how to take the heat 🔥❤️🙏", "doozy": "This is great! You do great work.", "adragsten": "Jen - it’s hard to not focus on the negative comments but I personally think that you’re doing great work. I value your honesty and appreciate your hard work. Thank you for being you.", "dreamqueenscatchers": "Thank you for these pieces. And thank you for restocking soon so I can wear it every day ♥️", "danasarra": "Good work!", "leahlaniskincare": "🙏🙌💫", "mrs.jenn.ruiz": "♥️💯 TY for sharing and doing what your doing.. I want the anxiety necklace when it comes back! THANK YOU for your honesty. 🤗", "ponywriter": "I love how brave you are. And yes brave is the right word. It takes bravery to show your true self. So many of us put on masks to make others feel comfortable. Wearing a word on your necklace is the opposite. I often think how I’d like to speak as openly as you. Good things you are doing..", "care_snider": "So happy you’re doing what you’re doing 🙌", "the_eclectic_lemon": "You are a bright light and a truly amazing human for being so open and honest. It has helped so many, myself included", "anxiety_piglet": "❤️ can’t wait to get mine in the mail tomorrow. Thank you for doing this & taking this on.", "theuncommonplace": "🙌🏻🙌🏻🙌🏻", "kirstenhuxtable": "❤️❤️❤️", "meganmpearson": "🖤🙌🏻🖤", "holly\nVerified": "Verified", "jessicapeppler": "💯💯💯", "tarajanebrown": "❤️❤️❤️", "sugo2go": "👏👏👏", "justj012": "You’re doing such a wonderful thing and I know several people (myself included) looking forward to the restock to get our necklaces 💞", "malsperling": "Thank you ❤️", "_karawr": "I love this", "jaeraebae": "💛", "heydrrachel": "This is really awesome. Seriously. What an inventive important product!", "thejealouscurator\nVerified": "Verified", "c.janette": "❤️❤️🙌💪", "8one8vintage": "Thank you! 🙌🏼", "shandel.parsons": "❤❤❤❤❤", "danigoessouth": "👏🏻👏🏻👏🏻👏🏻", "mindyfurano": "❤️🙏🙌🙌🙌", "shanw0w_w0w": "🤩🖤", "amy.meime.me": "This is awesome!! What a beautiful and meaningful way to channel darkness. Another reason to love ban.do. Its also a big battle for me and its great to know we're not alone. Xxx", "meghansmolka": "Also I want this necklace!", "notkirstie": "@loudini6 she’s one of my favourite people on ig!", "aliciakealey": "🖤", "fifleswild": "❤️💛💚💙💜💗", "houseofhipstersblog": "I live in the world of anxiety and depression myself. Thank you for what you’re doing 🙏🏻", "kidsaretheworst\nVerified": "Verified", "wolfum": "🙏🏽🙌🏼🙏🏽", "akschackow": "@jengotch omg did you read my mind? I have been majoring struggling lately and finally just posted an explanation to my friends and family today. Admiring your courage and sending my love ❤️", "ashleedoesstuff": "When will these be restocked?! I NEED ❤️", "robynflores23": "Hero❤️❤️❤️", "badleybratt": "♥", "kkaltenheuser": "Thank you, a million times thank you... for sharing your story, for using your platform, and for creating a bridge to a conversation that can often feel uneasy and uncomfortable.", "heysarahcarter": "These are so great and also - sold out!! Any chance for more in the future?! 🤞🏻", "denisecrew": "😘", "elisejoy": "✨❤️🙌🏼", "andrea.fairservice": "💘🙏🏼", "meessheeplee": "@qwertygrl idk if you follow this lady but her mental health posts give me life.", "beardy.glasses": "✨💖✨", "huntermcgrady\nVerified": "Verified", "bethhayesking": "I support you and am so glad you are naming these issues in meaningful ways! Thank you Jen Gotch! Love to you and your team!", "martaesri": "💖", "osuforprojectheal": "💜💜💜💜 So inspiring 💜💜💜💜", "lilcsalz516": "This is so awesome. Thank you for sharing!", "lanovello": "💛💛💛!!!! i am such a fan of you, your team and your brand!!!", "kellyoxford\nVerified": "Verified"}