{"whitneyjweiss": "Thanks for being real and brave! You’re perfect as you are.", "kattster": "Girl you are looking 🔥 More importantly thanks for sharing your insides with us. It’s honest and it’s beautiful and it’s 100% human and we appreciate ya. 👍", "rainbow___witch": "I’m HERE FOR IT", "kitty_o_hello": "Always a stunnah", "gretchenmariehunt": "You look AMAZING!!!!", "carol.a.wild": "I’m with you. Same feelings, always. Since I was 10. But you look amazing! And I love the bathing suit 👙", "nicelynoted": "💙", "beckrenk": "YES to all of this. The fear is real; the seeds go deep. Maybe the first step is trusting what others see in us - not the shit some guy said 20 years ago and not the critical voice in our heads that always screams nasty things. I know you’re beautiful. Trust that. Let’s sow new seeds.", "rose_weaver_pilates": "❤️", "ajtarver": "I love everything about this, thank you for sharing your truth, it really does matter.", "momonewman": "NO SHAME JEN YOU LOOK KILLER 🔥🔥🔥", "missbipps": "❤️❤️❤️", "laurenashleyelder": "🔥 🔥 🔥", "janenicole11": "Beauty", "cessilycorrine": "You look awesome!!!!", "ycmedia": "You look amazing", "houseofgraysco": "💕💕💕", "ledgesite": "This sharing is everything. The f*ing seeds ... that replay their presence and when you “know” the deeper truths and are still tortured by these scratches in the record. I’m listening and cheering and eager to hear see be with what you uncover. I am in this same struggle and you are Inspiration 😘", "emmthegem27": "You’re a queeeeeeen💕", "delishbeads": "aughh you put it into words!!!! precisely how I feel!!! I feel so much less alone now ❤❤", "dzintradiamond": "Thank you so much for sharing what your inner voice was saying at the moment this photo was taken. We so often hold all of those dialogues in our head. I wish at times I could turn that voice off because it can be so cruel. You look fantastic and make me want to go and find that same bikini. ❤️🌺", "jennealstudio": "Love your suit (and bod) lady! Xo", "nikkidanger41": "Happy you got out there. You look incredible!", "caraland": "You look sooo good!!! I want details on that suit!!", "katpfisher": "Your legs are so long! I wish I had long legs! You are perfect.", "jjoules": "But why? You cute!", "dldgmd1996": "I am so grateful that Kelly O introduced me to you. You are so amazing and I adore your sense of style. ❤️", "samsaraspeakeasy": "Gorgeous!!!!!", "tay_dollarsign": "Love this!", "desert.blondie": "You’re beautiful.", "flywheelpress": "Gorge", "vkceciliavk": "❤❤❤", "millhausstagingandstyling": "Gorgeousness all around!!", "tylesco": "Love everything about this post.", "yumeitamcompton": "Love! You are beautiful.", "miss_kristen": "I totally understand. I can’t do it. I cannot be in a swimsuit in public. At all. I am just unable to enjoy myself, - I want to be swallowed by hole in the ground the whole time.", "blancheboudreau": "You look so damn HOTTTTT!!! 🔥🔥🔥🔥 Thank you for sharing & being openly vulnerable. I wish your words didn’t ring so true, but they do. ❤️", "kalacopowell": "Oww Oww!!!", "sensu_ellu": "❤️❤️❤️", "shelleyandthemarshies": "Jen, I love you! What truths you speak for us all xx", "cocoroses.uk": "You’re always such an inspiration, and a goddamn beautiful one too! 💗🏝", "laurenmarttilaphotography": "Beautiful and inspirational. Giving strength to those around you. Hopefully that will lift you, too!", "badcontent.co": "❤️❤️❤️ just listened to you on the accidental creative podcast - LOVED IT. Can you do your own podcast??? 🙏🚀❤️", "umnia": "You are beautiful and this post is very inspiring. I received info like that as a child and spent many years walking with my back against the wall so no one would see my butt! In Elementary School 🤦🏾‍♀️Bodies should be treated like the miracles they are, self operating conscious organisms filled with the divine", "nancy.pink": "I identify with every word in this statement. THANK YOU THANK YOU THANK YOU JEN! You are a strong ass beautiful woman who deserves to be in a swimsuit EVERY damn second of the day if you want and not just because you are beautiful but because you are a human. 💗💗 also please connect with @amyschumer and her new film", "alysonthefish": "YOU LOOK AMAZING", "ateliermimii": "✨", "roxyrabb": "I completely get it. I’ll never understand why we feel “less of” a person if we aren’t skinny, have perfect hair, etc. it sucks, it hurts and it’s overwhelming. All that said, we are usually our worst enemies. I know that other people aren’t as hard on me as I am myself. Maybe one day we’ll just give ourselves a break 😕💔", "crystalwestland": "Love this! Where can I find these bottoms!?", "shahin_flamarzi1075": "sex. my", "maieliis": "💕", "asmalootah": "You have an amazing body !!! And porcelain skin xx", "morganmartininteriors": "😍 total babe!", "essebest": "“And wished for one split second I could see what you see” I wish the same for you and me ♥️ And by the way, you look amazing. And so does your heart. Amazing ✨", "sendingheartstrings": "Seriously, you have to retrain you brain. It’s possible and worth it! A great life coach can help. @jillkeuth", "mollyellena": "You’re beyond adorable inside and out.❤️", "marikarudystudio": "love button!", "margauxelliott": "💓💓💓", "shaelfaber": "Love those bottoms", "bethanyjensen_": "You are awesome!", "hilarynewman20": "We fight ourselves so hard. It doesn’t have to be that way. We can tweak our perspectives. You do look incredible!", "caseyfriese": "We all live this one I think. Show that beautiful body! It’s a gift and it’s 🔥", "life_warrior_": "It's always easier to believe the negative comments rather than the positive. But you truly are stunning, inside and out.", "pamplemooz": "I hate women’s bathing suits...I’d much rather be topless with comfy shorts like a dude.", "the_woodenpalate": "We are always our worst enemy, aren’t we? Or that one “critical” comment stays with us forever instead of the 500 good ones! You look wonderful and your suit is adorable. 🌸", "candyapple_explores": "Kween. Point blank. Period.❤️", "allison_pentheny": "Seriously you look amazing. 😘", "greencouchdesign": "You are rocking it! Thanks for sharing.", "tinoiseau": "You are beautiful inside and out! Your bikini looks great and you look healthy and fit and happy. 💗💗💗", "marrin.lee": "@jengotch people have always commented on the size of my butt and I’ve heard every name (i.e. thunder thighs, turbo ass, etc.) and it totally boggles me how anyone still thinks it’s OK to comment/tease me about it. It has affected me so much that throughout my current pregnancy, I’ve been enrageddddd when strangers comment on how “cute” I am. Even compliments about my body stress me out! I think it comes down to feeling invaded or on display. Thanks for speaking up about your experience! 💕💕💕💕", "kell_menow": "To you for conquering your fears ❤️", "jbasser1": "I see beauty", "makewells": "You look awesome 😘😘", "andrea_putman": "I love this picture and your words.", "badbarbara": "Hawai'i makes us all more comfortable in our own skin🤙🏽", "jamieclarebell": "you legitimately look incredible! 💕🔥", "voiceofawesome": "I also wish we could see each other through someone else’s eyes to know what they see. Like, how can this person not see all these obvious flaws that stand out so prominently!! But you do look amazing, always! Hawaii looked great on you 😊", "kimwilkinson1": "Thank you for sharing your insecurities and body shaming life experience....we can relate. You're gorge on the inside and out❤️", "gemmavanderswaagh": "You are brave and beautiful. You look fantastic, enjoy your beach time. 💕", "cfbcathcart": "I. Can. Relate. You are ROCKING that two piece harrrrrd af. 🔥🔥🔥🔥", "butterbeanschicpeas": "Woah.", "miranda_schubert": "Thanks for those comments. Yes we are more than those things. And you look great!", "rebekah_kay": "I get this, so much. And you do look amazing, but the main thing is that you faced your fear and didn't let it make you hide. I wanna be like that! 💪🏼", "itsjustsarahknight": "I can relate. I feel it ALL. But I’ll echo the 400+ comments and say you look amazing and I LOVE that suit❤️", "thelindseyjeane": "You, such a joy. Those hips and thighs how they never wanted to but you make so many ladies feel safe. Thank you.", "fleurishing": "you look amazing, but most importantly, your bravery is inspiring- it’s also one of my greatest fears. bravo lady!! 🎉", "leepamittal": "You are such an inspiration", "daudcope": "Love you girl! Get back over to this coast soon so we can all have a beer together, in some dive bar of course! 😘", "nikka__w": "beautiful!", "mando.calrissian": "I love your realness goddamn", "jenniferlynnfarris": "Thank you for saying this out loud. I could not relate more and it helps me see myself more clearly when I hear other people’s stories ❤️💥🙌🏼💪🏼 keep sharing...that’s how it’s done.", "emilyknoxxx": "You look amazing and you are amazing! ♥️", "pinkandgabulous": "❤️❤️❤️", "alexandra_sebestyen": "@rmsuperwomen", "_redhare_": "You look fantastic!", "nlongo22": "You look amazing! I wish I looked as good as you do in a bathing suit 😎 around the same age you were told you had a big butt, I was told I had “strong legs” with I translated as big and fat. It’s taken me 35 years to realize that I DO have strong legs...and I LIKE them! Do I look like a model? Hell no! Never have, never will...but I’m happy and healthy. Every day is a struggle with the comments from the past playing in my head but I do my best to ignore them. Thank you for sharing your journey with us...there’s more of us in the same boat than anyone would ever know 💗", "meredithmejerle": "Babe!!!", "eleanorfolds": "Love love love", "jillyjackdesigns": "You look great! And I totally get where you are coming from. Thanks for sharing!", "marinykool": "♥️♥️♥️", "noelsmall": "As always, love you @jengotch reading your posts, is like talking to a best friend ❤️", "perrinalex": "Beautiful", "boo.alina": "😍👍", "rwang.art": "😍❤❤", "jenallisonphoto": "You've inspire me to do this next time I'm at a beach! There's been one moment in my adult life where I felt confident enough to even consider a bikini. But you just amped that up! You look amazing! 💥", "bethjansenphoto": "You’re a cool woman. I a world of try hards I keep going back to you and shaking my head yes when I read. Thank you, I relate and agree and you do look so great.", "renschrimsher": "Thank you for talking about this. ❤️", "lady.glittersparkles_seriously": "Amen. So much more than our face and hair and thighs... 🙏👊🕉", "karenkmal": "You look great! And I even zoomed in: still great!", "messyla": "You look incredible 🙌🏻🙌🏻🙌🏻", "chixpotpie": "thank you for sharing what so many feel and are too afraid to say - you inspire me 💕🌈💕🌈", "febanie": "I wanna be exactly like you when I grow up", "alexa.m.a": "looking lovely 🌈💜💪🏽", "kgotch": "You are adorable. You shine so brightly and it’s inspiring!", "danielleksustendal": "You look insane😍", "karlamarier": "❤️", "knife_ie__": "Suit 👅🌈🦄⚡️", "the_full_potential_life": "I work at Eileen Fisher (clothing), and it’s amazing what you hear when helping people. I lovingly try to help women find that non-critical lens and to love who they are today. Those seeds are everywhere in our world - maybe this dialogue and sisters helping sisters will squash the seeds and keep those thoughts from taking root. Sharing Our Truth and Love and Sisterhood = Positive Power", "katiebee0918": "Thank you Thank you thank you for sharing this. I'm a recovering anorexic and it is so helpful to know other people struggle with these things and with going back to the \"seeds\" as much as i do! You look amazing and I'm proud of You for facing your fear!!!", "klowe94": "You look beautiful", "jillianmorkan": "QWEEN!", "jm2593": "Looking 🔥🔥🔥", "charisse.kenion": "When you know, let me know! I do not see myself how my husband sees me. I did post a bikini photo a couple of days ago, one that he took, and HE thinks I look amazing. I think he must just be too much in love to see 💁🏽 ❤️", "nicole.harrisss": "You are a goddess ❤️ beautiful inside and out and funny as fuck. I hear you... here’s to us all getting there.", "maritammela": "💯🔥👍", "luxperpetua": "Every single woman I know has this issue. It’s what society has done to us. You DO look amazing. But I know it doesn’t matter what strangers think until you can believe it yourself. So hurry up and figure out how so the rest of us can learn.", "ginghamgirlgreetings": "#proofofhotness 😀", "chels": "incredible gorgeous inspiring woman 💕", "gracielovekin": "♥️", "madamespoiled": "Wonderful woman!", "the5dells": "Beautiful inside and out. Interesting how we all push aside the kind remarks and believe and internalize the harsh ones.", "max_n_poppysmimi": "You look adorable ❤️❤️❤️❤️", "bee.k75": "Champions of words, positivity and creativity. You are ace. 💕🌟", "katecnixon": "Babe", "jackiejkan": "❤️", "jess_stanier": "Awesome post x totally agree with it all & glad you feel encouraged! You should do it! You look amazing! Xxxx", "stephgracie": "YOU ARE AMAZING", "trac3yw00ds": "You look amazing!", "anabelzenithelizabethannbanana": "🙏🏽 all these words. Same here. 💖", "pomodni_kreten": "👌👌👌", "stleonardsmoderngoods": "I totally get this. I was told by a family member when I was 13 that I had good sturdy thighs like a footballer or shot putter and I never wore a skirt above the knees or shorts again. that was 30 yrs ago. It's painful to feel those things so young. And now I'm 47 and have a more confidence but not the fantastic legs I had back then! When I see photos now, I see super legs...what a waste of years and time worrying and feeling shame.And all those 80s mini skirts missed! x", "lara___c_": "💛💛💛💛💛💛💛💛💛", "natcaronphoto": "I have so many stories like that growing up. I was 10 years old swimming at a friends house, and her brothers friend called me a whale (yep, I was a tinge bigger then my friend, but far from big). That stuck with me for the last 30 years. Hopefully today's girls won't hear those words uttered. Thank you for sharing. It may give me some courage at 40 👌", "mostlymilaandknox": "🔥❤️", "oliviatripp": "You look amazing!", "melissagaye__": "You look amazing and you are amazing.", "mmichiko2": "You look like a 20-something cutey who everyone wishes they could be 😍😍 love to you", "petitsparrow": "🙌", "oli_oakley": "Beautiful woman xx", "brantlea": "You look amazing!! And that suit is perfect!", "tinypinecones": "You genuinely look great! A great suit on a lovely person! Celebrate every (emotional) victory!", "camillerega": "Damn girl 🔥💕", "jayb1z": "💘", "brendalarby": "Lovely girl. Lovely mind", "alexandra_sedgwick": "You are beautiful", "_trouble_in_mind_": "I saw the photo before I read the caption. My reaction (and I zoomed in) was how great you look and what a cute suit. We are our worst critics. We should be kinder to ourselves.", "hannahskvarla\nVerified": "Verified", "eeveelyn_k": "Thank you for your words, we can’t talk about that enough! You are amazing 💫", "philipprossmann": "You’re marvelous and you look great. But more than that you look like just like you, which is more than most people can say, and that is the most important. To cultivate a look for yourself that is so incredible and fun and unique, very inspiring! Keep going, you got this!", "veronicaslane": "THANK YOU @jengotch! You look great! WHHHY are we so hard on ourselves! 😍", "charitymadrid": "And all I see is the tiny waist and tiny belly button I covet for myself. that's the part of me that stays covered at the beach 😘", "lilad": "Cutest lil belly button 😍", "kat7lew": "For real you DO look amazing!", "lilhcrocker": "💣💛💛💛💛💛💛💛👙", "haileyrob": "💕💞💓💗💖💘", "angela.chick.illustration": "I think it’s really nice being open about insecurities. It sucks that they exist in the first place and it sucks that other people don’t realise the tiny things that we carry with us for years and years. You look slamming in that bikini and it’s even better that you had the confidence to post it 💪", "michkhat": "You’re a babe, but my opinion doesn’t matter. Only yours does. Silence the critic in yourself and and enjoy your body for what it truly is; a vehicle for your soul...🙏 ❤️", "thegivingcrate": "💓💓 you!!", "forbidden_fruit_salad": "Giiiiiirrrrl ❤️", "trippymonson": "Hot wahine!! 🌺", "kelly_k": "@rybowski600", "cbaboojan": "Thanks for always putting it out there, feelings and 🍑", "heidieiffert": "I love this!", "celeste_dec": "I'm 31 and this is #goals 🤩🤩", "fequalshq": "You look bloody FANTASTIC 💘", "m_anhaltzer": "Way to go Jen!!! Your real ness is refreshing and hopeful.", "everyonceinawhileisparkle": "I feel the same! I love you for saying and putting yourself out there for the rest of us.", "honey_bread": "You look awesome. I heard somewhere that you should look at photos of yourself as if you were looking at a close friend. We are so harsh on ourselves, but can so easily see the beauty in our friends. I'm learning to be gentler with myself and more forgiving of all of the little things I saw as flaws before.", "theemptyoxobox": "Check out embrace @bodyimagemovement", "brooklyndecker\nVerified": "Verified", "hairandmakeupbyremy": "💛", "barmethodsilverlake": "I feel you and I applaud you for for your honesty and vulnerability 💗💗You look amazing", "kelseymegankennedy": "Ps- that last post was from me 😘😘", "payal03": "You echo what I’ve felt for the last 20 years. It’s an on going struggle and it’s warped in its own strange way. You’re fucking gorgeous and that’s the only thing I thought when I saw this photo. Give ‘em hell!", "feliciarosenthal": "Wow. Are these my words?? Because they surely could be 🙌🏻", "colbyreport": "You shouldn’t girlfriend!", "parc16": "You look 👌🏼😍 amazing!!!", "wildeyed.shop": "You look amazing!!!!", "mrslouisajones": "You're just incredible! And you look amazing. Also what you wrote? I feel I could have written it. The battle is fucking tough xxxx", "huneboottoot": "You're fabulous inside & out. 😘💗💋", "ms.alana.m": "I just googled ‘how would you write the sound of a wolf whistle’... you look fabulous!! Weeeeeeit weeeeoooh (that was not a suggested spelling).", "g_g_bang_bang": "🙏🏻", "casadecross": "This spoke so deeply to me when I watched it on your stories.. I care so much that others are watching me and judging me and caring, and the reality is, they are so focused on what they are doing, it’s not about me!! The story behind this photo and then seeing that inside your head, everyone was looking at you and judging and saying mean things about you, but in REALITY NOONE CARED!!! You are beautiful and inspiring to me. Thank you for sharing your truth and being so vulnerable ❤️❤️❤️", "babynoel75": "This is beautiful! Thank you! You are amazing!😘❤️", "birdgirlgracie": "✨☀️💜🌴", "c.janette": "Love this!! ❤️❤️", "summerbellessa\nVerified": "Verified", "robdoglouise": "😘", "humphli": "You look amazing!!!", "secateursisters": "You are gorgeous inside and out 💥", "misshaideemillinery": "You look gorgeous rock your body when your older you’ll look back and know you looked good 🦋🦋", "stephashmore": "✨Radical Acceptance by Tara Brach✨", "korie_conant": "⚡️⚡️⚡️", "brianna.sirju": "I want every part of the outfit. Looking 💯", "madelinefix": "💥💥💥", "abigaildeallen": "u make me less afraid 😍", "imaladylikethat": "💃🏻💃🏻💃🏻", "annavzang\nVerified": "Verified", "loloboren": "You look great!", "sustainablerainbow": "You are amazing, inside and out!!", "moniqueneethling": "Looking relaxed and beautiful and care free! Love the bikini!!!!", "christarenee": "I’m here too! We should get a cocktail!", "madinthehat": "You’ve inspired me to wear blue eye shadow even though I’m 40. You are a beautiful, talented woman - celebrate it!", "trettiodagarharnovember": "Your words... Exactly like that! 💪😘💥", "katilydid": "Gorgeous, real, and inspiring!", "breeynmccarney": "Isn’t it crazy how that shit stays with us? Comments from strangers are whatevs, but I still think about an ex telling me I have stumpy legs, and my grampa noticing I was gaining weight. These things effing *stick*.", "absolutelo": "Thank you for sharing this. I am as terrified of spiders as of my butt in a bikini on a beach... working on it. You look gorgeous by the way.", "kay_almanza": "@jengotch this post struck a chord with me. 😊", "la_susy_la_susy": "Goddess 💖", "charzart": "💕💕💕💕💕", "valeriehammond": "You’re a treasure. 💎", "foxandfinch": "Duuuuude. Thank you, as usual. I was just writing the other day about how I wish I could see myself (my whole self, body/life/personality) how others see me... basically, I want to be under the same spell everyone else is under.", "bobbileebrooks": "You look great!", "daniellelately": "Proof of hot.", "corinnehaigdesigns": "Cute!", "mellovesrys": "You look amazing.", "nicole_fichera": "You are a wonderful human 💕", "taliajbailey": "I completely know this fear. However crazy and irrational it is, man, it’s the fear that paralyzed me and causes so much discomfort in my life... I’m now a new mom and I made a vow to myself to put on a bathing suit and be in the pool or on the beach with my kid because I want to show him self love and hope I will gain confidence as well 🙈", "spamminyogrammin": "Hot woman! Ow ow 😍", "hellofears\nVerified": "Verified", "marburger": "You look 🔥🔥🔥! You are truly an inspiration!", "abbersnail": "I feel you on ALLLLL of this.", "sullibration": "Gorgeous!", "jenna_aceandjig": "❤️❤️❤️❤️", "kara.dee": "You brave little butterfly!!! Way to conquer that fear!!", "shellionaire": "You’re a mf babeeeeeeeeeeee tho", "jaclyndowdle": "You’re a total babe from Babetown @jengotch!", "jes_richardson": "Proud of you! I’ve been told to put a bag over my head. I’ve felt ugly ever since.", "stephanie_matthew": "You 🔥🔥", "hollymariegibbs": "#proofofhot #proof👏of👏hot👏", "heartshapedsky": "Super babe so amazing. 🌈♥️✨", "daniela_lina": "You go, girl!!!🙌🏻", "daaaandilion": "🙌🏼🌈✨❤️#PROOFOFHOT", "hej.lindsay": "You are beautiful and adorable and sexy and your style kicks ass! Wear more swim suits! 😘💕🔥💛", "kwidmer71": "You look absolutely amazing!", "thelovedesignedlife": "I think so many of us women feel the same! good for you for always putting it out there.", "gojo71": "I live in a beautiful part of Australia and have the exact same feelings as you @jengotch...i just can't do it😕🇦🇺 i think you look fabulous!!", "tiffellingson": "Same", "claretimmerman": "Oh thank you for saying/ posting this. So many comments made to me by people in my life who didn't mean harm but cut me to my core have made me so self conscious about my body, my face , etc. I'm still struggling with my self confidence but working every day to push those negative thoughts away.", "meesheldaly": "thx u for this ❤️ you’re amazing in, out and everywhere between", "nikipilkington": "🔥🔥🔥 such a babe", "jones3232013": "Working it!!", "catsnfashun": "You look amazing but that doesn’t even matter. You are a badass inspirational woman who has impacted more people than you realize, for the better. ❤️❤️❤️", "abbywischnia": "Queen for life", "purcellski": "You look like you’re in an ad! Amazing!!", "element75": "you're amazing ♥️", "katiekerrl": "Makes it feel less alone when you feel so alone", "kkcaya": "Seriously beautiful inside & out 😍", "laurleps": "You look and you ARE amazing and awe-inspiring. 😘🌴🌸", "christie__alexander": "The very idea of seeing ourselves through a non critical lens is everything. How does one do that exactly?", "jmeackerman": "So inspiring!!! 🙌🏼🙌🏼🙌🏼", "___may__day___": "I would pay money to look like you in this shot.", "janaeallred": "Love you in that bikini. And love this post! I owe @saltandember one for telling me to follow your account.", "jodan44": "Yas queen! You look great!", "heart_to_hand": "I see you and I love what I see.💗", "cisforchristie": "You are so beautiful inside and out.", "aliwatsonatx": "I just see a hot chick, with a wicked sense of humor! (And a really cute bikini). And you’re in Hawaii...and now I’m green w/ envy.", "bubblegum.dreamin": "@nicksturz this!!!!!", "ejmommy": "It’s like you were invading my hamster wheel of a brain! Keep on trucking 👌🏻", "hannah4pix": "Lovely, brave and triumphant — sick suit too! Pat your self in the back.. seriously do it!", "lyssa_flo": "Sounds like what @_aariellanyssa recently posted! It's so unfortunate that such off-hand remarks can be so dominant in our thoughts. You ladies are leading generations of people to growing past old comments, and growing into the beauty of their souls!!", "kerrycrawford": "I suffer from this too. It’s hard to shake those soul crushing words we accumulate like scars through our life. Imagine how many of us feel this way. Thanks for sharing this. You’re beautiful.", "mackienichols": "You are incredible, Jen! This bikini was made for you. Truly someone I look up to because you’re so dang relatable. You make me feel normal and for that, I thank you.", "laura.sulak": "❤️❤️❤️", "elizabething": "I needed this today @jengotch. I was feeling pretty down on myself but this helped me to climb out of my self pity pit. 💕Thank you", "madisonandsuch": "This is my life ❤️. I love this, thanks for writing it. I applaud you, say the same as the others (you look amaze ❣️) but also feel and know the tension you write about. A friends little sister once pointed out how my butt jiggled when I ran when we were about 10 and that and a few other things have made me feel bad about myself to this day! It’s such a process to work through and I’m proud of you! ALSO, in case you didn’t know (why would you?!) but we are birthday twins 🎂! Thanks for inspiring us through your work and your words ❤️", "technicoloryoureverymove": "You look like your 22! Just a cute lil beach bunny! 😍👙🏝🐰", "_mandapanda15": "Perfectly stated! And so relatable. You’re awesome! 💕💕💕", "moldyguacamolly": "A GODDESS! You are truly beautiful inside and out! Way to face your fears head on!", "lyndsiterese": "Perfect", "middlecoastmama": "BABE", "kiwijess": "You look awesome! I wish I had your bod xx", "katievb": "Beautiful! Inside and out!", "des_is_dead": "Dude @brjdget - @jengotch has an amazing beach bod too. She is literal goals. Can we meet her and become her?!?!?", "ashleykaaseart": "Okay, so real honesty here: you’re adorable! And you are rocking that suit!!!", "alohaspreader": "Work it Jen!", "kavitagurm": "💖💖💖💖💖", "keriann14": "Absolutely stunning!", "amybortonissad": "Babe beach 🏝", "thistlestonejewelry": "❤️❤️❤️💪🏼💥😘", "taylormante": "You ARE amazing", "clarkenix": "❤️ you n me both sister. Bravo to you ❤️", "linda_marie__": "I see one of the most inspiring and brave women I’ve ever encountered👏", "emilyblincoe\nVerified": "Verified", "_brwnsugar_": "You are beautiful.", "thedailylindsey": "Your body is a miracle❣️I have so much admiration for you and how you use social media to create real conversations ❤️🌈⭐️", "paris.henderson": "My friends have called me out on this insecurity since I was 14?also? — the only times (I’m also from the 561) I’ve been on a public beach in a bathing suit/bikini, I’ve walked with my entire arm in front of my stomach, and my friends have always called me out, but I cannot get past it. If you find the trick to not being too much in your own head, please let me know he secret. BUT REAL TALK — I think you’re fucking sensational 👏🏻❤️", "angelakohler": "You look terrific. You are terrific.", "isabelladeguzman": "GOD I LOVE YOU AND LOOK UP TO YOU SO MUCHH", "rebeccaesther": "Practice wearing things that scare you. And get involved in the body positive movement. Those are the two things that helped me learn to love my body. It's a process, and you can do it!", "callannavitsky": "So unfortunate how we tend to retain the bad but not the good. You’re the best. ♥️", "dearmasha": "I’ve been struggling with this too, as I’m sure every woman has on planet earth... Reading your posts reminds me that I’m not alone. Thank you.", "alexiskersey": "@c.beau I literally message her all the time and she never responds but she is my fave :)", "exmyspaceceleb": "I admire you, I want to be like you when I grow up. ❤️❤️❤️❤️", "melisamyers": "You are beautiful", "elnomadseattle": "Look at your itty bitty waist!", "breesurb": "🔥", "loumime": "Love everything about this and you! Thank you!!! ❤️🌟", "macmitch": "In awe of you ❤️", "loveshovel": "GURL YOUR ABS ARE BOMB AF", "pantryproducts": "Portrait of an amazing woman!", "winifredgrace": "Like if when you die people said, yea, that Jen Gotch, she sure was skinny, wouldn’t you be sad? Instead think of all the awesome things people can and do say. Your body is irrelevant. Says the pot to the kettle.", "analouisesilva": "Beauty, brains and brave! All summed up in one photo! You've done it @jengotch spoken and shown it all! Thank you", "everdje": "You look absolutely stunning!! 🔥🔥🔥", "erobi": "You are fanTASTic! You help me be so strong and feel good about myself and feel more creative. And you help me try new things! And best of all, you help me feel good about always being myself. 🧡🌴🤜", "c.beau": "@jengotch you look beautiful and awesome! I don’t think most women feel great walking out in a bikini.... thanks for posting this!", "gemmacatherine": "Someone said once imagine if we spoke to ourselves, the way we speak to our closest friends, how much happier we would be.", "bird78": "Hot mami!!!!", "victoriagawa": "These words resonate with me so deeply; thank for for writing them! ❤️ You are, and look, amazing.", "kerigiordano": "You look fucking amazing! But I share in your fear. I have n-e-v-e-r been comfortable in my own skin...but I’m going to really put an honest effort into trying to be this year. 🤞🏻🙌🏻❤️", "notorious_a.r.t": "This is so perfectly stated 👏🏻", "marie_philbin": "💖💖💖💖💖💖", "decorandlotsmore": "I feel the same..love it!!", "autumnskyer": "You are seriously killin’ it in that bikini, girl! 🙌🏼 I know how insidious that negative self-talk can be though. Keep fightin’ the good fight! 👊🏼", "janereaction": "I was going to write, “you look great” but then I read @teamwoodnote ‘s “hot as fuck” and I was like, yes, that is a more accurate description, duh! 🤦🏼‍♀️❤️❤️❤️❤️", "teatoastandturmoil": "You ARE amazing 💖", "andiebellemusic": "babe city.", "carlacanning": "you look amazing and are amazing and super strong and cool", "littlebigbee": "Thank you for sharing this. Takes great bravery. 💗", "littlewordsproject\nVerified": "Verified", "jesserker": "You rock. And you’re fabulous. Thank you for continuing to share your story!", "servedbysarah": "BABETOWN", "katelyntanimoto": "You a BABE. 💃🏼", "caitanna": "💛💛💛", "hoholmes": "You are so ALIVE, I adore you!! Keep being YOU!!", "bitzofglitz": "Jen, you look beautiful! We as women need to hear and see more people like you!!!", "annachurch_art": "🙌🏻💥👌🏻", "heart.makes.home": "Bitchin🧡", "commonthreadcollectivela": "You look adorable!", "ladi_nred": "Before reading the caption I thought “wow. She has a great body. Wish I looked that good in a suit.” @rachealtruitt", "galmontgomery": "You. Rock. I think you might be the voice of our generation. ✨", "taerizz": "🔥", "anahata_joy": "Spiritual awakenings are important. And so are “superficial awakenings”. Lol. I like to think that bo-po and self care and celebrating our image is extremely important too. 💕", "elizmccraw": "We can see the gentle shifts you’ve been making recently. Working out more, eating better (those collagen bars!), looking for dates, and like, your hair is fucking amazing. And I know you can feel it, and you seem pretty proud of it. And you should be. It shows as bright as your smile and I’m so fucking happy for you. On your 1.8 days and your 8.4 days, there are so many people rooting for you. You seem so happy lately, and that’s fantastic. But also, no presh to stay that way, we’ll be here no matter what. <3", "katiezspeed": "Looking great! And cheers to facing fears! You should partner with @beauty_redefined !! You could do great things together", "thinkandmakemarket": "😭😭😭💕", "kellyforever32": "I just had this conversation last night. Even when it’s a compliment about my body I want to just turn invisible until the topic changes.", "lauranienhuis": "do your thing girl because you rock that suit 🔥", "mama__jane": "And then, just today you looked so very hot, yet masculine on @mrorlandosoria story,He should wear the bikini and give us a little show... I actually had the same thing growing up, but got over it because I love the beach too much, and I’m a size 22!", "ohhhkris": "With every post I love you more! Thanks for speaking shared truths! ❤️", "greekstreet": "Beautifully written! Thank you for speaking out for something that can cause crippling anxiety for so many girls and women. Something so simple like baring your legs that some people will never think about twice and it’s the one thing that’s scarier than spiders. Moving back to a warm climate and having to give up on the black tights that were hiding my fears has been a major readjustment. ❤️❤️❤️", "lashbealady": "You look fantastic and I love that suit.", "hello_miss_lovely": "You look great mama!!!! ❤️🌈👌🏻🙇🏼‍♀️✨🍍", "crazykt81": "💚💚💚", "braidsandbigearrings": "♥️♥️♥️♥️♥️♥️♥️", "jzlettering": "Self love can be hard. Like why. Thank you for sharing. Those \"seeds\" are a real thing", "kellyoxford\nVerified": "Verified", "lexlowdermilk": "As your dad would say, “proof of hot” 😊", "nomadicnolazcos": "to hear this from a boss ass bitch makes me feel so much comfort that i'm not alone. i hope we all can move beyond such insignificant shit 🙌🏻", "bg3w": "You look adorable. And speak such truth. 💕", "an_erin\nVerified": "Verified", "kkmika": "You look amazing! ✨✨✨", "flowersandgarbage": "👯‍♀️💛💛💛", "mugsbythefire": "I see a beautiful soul that is full of positive energy, even on a bad day👌🏻👌🏻👌🏻. And as I get older, I have glimpses of myself in that noncritical light 💡...and all I can surmise on how those glimpses show up, is being patient and giving myself acceptance, often. And you’re rad as hell, keep on being your 🔥🔥🔥🔥self😃😃😃😃", "thelittlest": "What a beautiful, capable body.", "reddy708": "Beautiful! 💕", "ispyabrownbair": "You look beautiful and I’m thankful you shared this fear with us because I have the same fear. Constantly between loving myself...my body...how it is and wanting it to be different.", "thelifestyled": "You look amazing Jen! One step closer to nude. #NotANeverNude", "lwilkman": "Feeling those beauty blues hard lately. It's so easy to be critical. I cried to my fiance telling him how desperately I wished to be beautiful and no matter how long he held my face in his hands and told me I was beautiful I still felt the pain of knowing that even if I were to be beautiful to him or anyone, I will likely never feel beautiful. I hope we learn how to rise above it but know that when I see you, I see strength and beauty... and an adorably funny chick that I wish I could be like one day.", "haley.hueckman": "@madhabitboutique 🙌🏽", "auntiekaren3": "i’d kill to look like that in a bathing suit!! ♥️", "nutricionavanzada": "😍😍😍😍", "shroomsmoon": "You're a thin able bodied woman!!! You can walk and run and breathe!! What your body looks like is not important.", "redheadedwarrior": "💙💙💙", "tahani_helena": "You cute!", "mali.mish.marlene": "You’re beautiful ❤️", "faunstudio": "#preach 🙌🏽👸🏽", "jenniferpaganelli": "You look amazing.", "emeeki": "So beautiful 💕", "pensakiley": "Hello, gorgeous!!!!", "evylink": "You're hot af", "cortneyclift": "💪🏼👏🏼", "justj012": "Thank you for being open and sharing your fears with everyone 🙏🏻💞", "beaandg": "💗", "robinplemmons": "I hear you. Man, do I ever. Honesty is so attractive. #proofofhot 💖😘", "jmbostic": "Rock on sister. You are amazing!", "okayluh": "Damn, this hit home. Hard. Proud of you!", "goldstruck": "You’re a fuckin badass momma ⚡️", "sidneylanecreative": "Such a babe!", "guacmylife": "Right there with you my friend! But you look smokin' 🎉", "saraaaam": "Bravo!", "malsperling": "“How great would it be to see ourselves through a non critical lens just for a moment?” I think that to myself almost everyday.", "justjill": "I quit sports in the 7th grade (and I was pretty good up until then) because some 8th grade girls asked me why I was trying out for volleyball with my “Cottage Cheese Legs?” It’s been down hill (thoughts in my head ever since) I feel ya @jengotch", "busyphilipps\nVerified": "Verified", "c.leone212": "I feel you on this on such a deep level that I’m sure I will never again wear a bikini. But I think you are beautiful and I love your spirit and honesty!", "hnlbabyco": "❤️❤️❤️", "em_henderson\nVerified": "Verified", "ettatorials": "You’re body & you are beautiful Jen!", "topanga_vintage_market": "Try being 57! You just can't stay attached, because it's not 😂", "michelle_roberts_reid": "Usually I just have to look a year or two... (or 20)later for some perspective.", "rjmaki99": "You look great!! Unfortunately things people say to us, even jokingly stay with us. 👎😯 My family used to tell me I had a big butt and I was a size 3!! Also teased me that my ears were so big I could fly around the room and that my nose looked like someone whacked me with a baseball bat!!!! And that’s from people who loved me. Then they couldn’t understand when I hated getting my picture taken..... words DO hurt.", "lionheartliz": "You're a queen.", "morganpansing": "You are so GORGEOUS!", "oh_chelseaa": "I saw ya at rose bowl flea and was too anxious to say hi but I live for your snaps and am inspired by ya🔥 keep doing the damn thang @jengotch 🌸", "lizzie.mae_": "😍👌🏻 🔥", "ciarajgoins": "YOURE SO SEXY", "jennyroseford": "Gorgeous!", "alexbrott": "Amen 🙏🏻", "fabnobodies": "Thank you so much for sharing this!!! I have the same fear and have a hard time taking compliments. You are amazing!!! 😘", "chubbystick": "Purrrrfection!!! 👏🏼❤️", "instalessmolly": "💚💚💚", "karlazcamera": "🙌🏻🙌🏻🙌🏻", "vszwaya": "@thejoyfulgoat love herrrrr", "missdaniellevannoy": "This is so good!", "jenna__apple": "you are such an inspiring person. xo.", "robynflores23": "I love this. I teared up a little because I live with that same fear.", "sarahscussel": "So beautiful ❤️🧡💛💚💙💜", "adesholamakinde": "🔥", "kathleen_bernall": "🔥🔥🔥🔥🔥", "moonpiemary": "😘😘😘", "alyssainthecity\nVerified": "Verified", "kelseylamay": "❤️❤️", "jennalicious177": "You're gorgeous and funny and freaking wicked intelligent. I don't know you, but smart girls can find each other. #killingit", "kwazlo": "You do look great. And happy!", "wynnwyman": "Beauty ⚡️", "dazey_la": "Love love love everything about this ❤️❤️❤️👊👊👊👊", "ohhijess": "Dayummm!!! 😍😍 goals.", "heykimdang": "Jen, you look freaking amazing tho!!! We are always our own toughest critic because we see our bodies every day for what it is and wish so hard how it could all be better. We always strive to be better because we’re human beings. At that’s all we are: humans. 💗 you’re an encouragement for everyone to face their fears and/or insecurities.", "jljessee": "Gorgeous woman!! 😍 Keep rocking those bikinis and embracing your gorgeous self!", "wolfum": "So great to hear all of this. Yes, yes, yes.", "kailanicole": "Totally get it. Same-same. You are fucking awesome for being an example of someone who storms into their vulnerabilities and faces whatever terrifies you. It’s exactly the type of role model we all need as us women challenge the beliefs we hold for ourselves that were created by those who wanted to profit off our insecurities and ability to think we are anything less than anyone else.", "studiosophiasophia": "From what I see in this picture is one rad bathing suit and beautiful skies. You’re an inspiration to all of us! 🌈❤️", "elizabethdeluna": "Yes! 🙌 You look beautiful, Jen!", "dforr": "Hottie with a body 😍", "renataylor327": "Gorgeous inside and out! I can relate to all of this and it’s awesome not to feel alone in these thoughts. Thank you for being vulnerable in such a profound and tangible way for your own healing and for others.💗", "kitiyapalaskas": "Keep the conversation going gurl! I have similar insecurities (stemming from one lone comment in a high school locker room about how my thighs touched on the inside & according to someone's grandma that meant you're fat - I literally changed under a t shirt from then on) and find posts like yours give me a sense of solidarity and help me to normalise my feelings and not beat myself up for having the thoughts in the first place, so THANKS! It's so crazy how our own perceptions on ourselves can get so out of control. Anyway, well done for facing a fear! Also I think you always look fantastic and your outfits blow my mind. Big love to you! ✌🏾💖", "beth_moon": "Thank you for putting yourself out there! It’s a shame we all go through this one way or another. Thank you for helping me realize how much we I’m not alone. ❤️❤️❤️", "luly700": "You look hot af but it's your honesty and vulnerability that makes you amazing", "runningwildflorals": "🙏🏼🙏🏼🙏🏼🙏🏼 preach!!!", "larissa.kristine": "SO CUTE!😻🖤😻", "brookerodd": "I was called thunder thighs too. 😢", "morgforshort": "❤️", "darkbluespeed": "Have you heard the phrase “carry yourself w the confidence of a mediocre white man?” Bc DUDE look around and you have a hundred case studies for zero fucks given, nipple-confident (lol L Word fans where you at?!) Joe schmos just living their lives bc society has handed them different priorities than a coffee table tummy and tea party ankles. I ADORE YOU JEN. Every inch of brain and ankle you show is not lovely than the last. Keep on keeping on. You don’t have thunder in your thighs, it’s all ⚡️⚡️⚡️", "jeannnes": "Proof of hot", "triple_js_mama": "First off, you look great! Secondly isn’t it amazing the tiny seeds that someone plants can shape such a giant tree for us to climb our entire lives? I am a recovering anorexic. I know those seeds all too well. I’m so sorry for how many people have suffered the same things. Yet so grateful to have a voice to share our stories so we can reach people suffering in silence! 🙌🏻thank you! 💜💜💜💜", "clothandecay": "Stunning!", "bea.oxford": "Sister jen", "kitschmuffin": "💙💙💙💙💙💙💙💙", "alexandratripp": "A thousand times yes sister!", "laurenbrimley": "Always appreciate your thoughts on body image ❤️", "ashley.shelton": "Thank you. ❤️", "stephaniebspears": "❤️❤️❤️ nailed it", "amy.e.little": "✨You look fantastic✨", "christnarodriguez": "AMAZING", "kaitiibear": "Fuck yes girl. You’re a bad ass and SOME DICK SAID THE SAME THING TO ME WHEN I WAS AROUND THE SAME AGE AND I STILL HAVENt recovered !!!!!! You’re my inspo and this is the year that I walk on a beach in a two piece! ILY ILY ILY", "klipshultz": "Adorbs.", "catpalace": "It sucks the things people feel are okay to say with no regard for the impact that it has (for many years) on a person. You do you. And plug your ears to the BS that people spew. You look great, always will.", "jade.rene.janssen": "You're beautiful ❤️", "esby_apparel": "you are THE cutest thing 💕", "karasguild": "So. Much. Love", "kaitlyn_mirabile": "I seriously love this! You look great!", "gretchcma": "Your a rock star 🌟💪🏼", "sun.trail": "Beautiful in all the ways. And hot in a bikini!", "dipesadesigns": "@heathervaughandesign so good 💗💔", "zombeena": "😍😍😍", "blondiemamma": "Hottie ! W a brain and a body .", "samanthamikrut": "❤️❤️❤️", "searcycircus": "Babe!", "melissa_mckenna": "❤️🔥", "nicolecostello_": "I didn’t wear skirts or dresses until I was well into my 30’s because of a nasty girl at high school telling me my legs were too skinny and ugly. people ruin things.", "missy_allison": "This is my reality, too. Word and amen.", "okay_paige": "@christlytaylor and @_christinearnold - relevant to our convo this weekend. Y'all are both beautiful 💕", "thebestdaniellelevy": "You are my favorite.", "katievanpatten": "Self love can be so fucking hard. You look great and I hope you get there eventually ♥️.", "tarotsmom": "a queen🙌🏼 thanks for sharing❤️", "whocareskayleigh": "I needed to read this so badly. I love that you are so FREAKIN REAL, Jen. Every day I tell my husband that same thing “I wish I saw what you see” I’m going to the Bahamas at the end of the year and TERRIFIED. But I’m more terrified of not having the best time because of the way I feel. Thank you for sharing your story time after time. You are truly helping me get over some gnarly hurtles 💜💜", "cherietallett": "❤️ rocking it!", "samantha_rei": "FABULOUS. THAT SUIT. THAT LOOK. THAT CONFIDENCE!! 💕💯✨🔥🌴", "jlcan36": "I will always love how openly you convey your fears Jen 💕", "teamwoodnote": "you look hot as fuck and believing that you see yourself like you’re looking in a circus mirror is prolly accurate / maybe helpful. it supports me.", "ivyandstone__": "You are and look wonderful!", "ashleycrtalic": "❤️❤️❤️", "jlynnturn": "SAME, girl!!!", "dipthosedots": "beautiful inside and out!", "smoredan": "Work it lady!", "aarrrroooooooo": "Gotch has got it! 🌶👙🔥", "jazzcabin": "🔥🔥🔥 #getitgirl", "gracesmith72": "outstanding post.", "helloarielchristine": "You’re a beauty!", "atomitis": "You look stunning and I would love to look that great in a 2 piece! You do you girlfriend!"}