{"asmarrow": "Any word on a restock?!", "i_ninjasquirrel": "@jengotch I LOVE LOVE LOVE this!! Just put myself on the waitlist for both! @bobbyhundreds I need to meet this amazing woman, she speaks to my heart 💖", "heyheyhc": "Thanks for your voice Jen. I appreciate you and hope I can get a necklace in the next round. ❤️", "imsurco": "Amazing!! Thanks for making this collection... I also hope to get a necklace on the next round!!", "theskinnyjew": "Thank you for this ! #mazeltov !", "laurenrosenauphotography": "Hi @jengotch - how can i get on the list? I need them both ♥️ 🌈", "maddie_iv": "How do I get on the waitlist?", "tjperez": "❤️😍", "hannahriley4": "I’m on the wait list waiting in anticipation for them to come back!! It’s so inspiring to have someone well known to spread awareness of mental illness, esp in such a fashionable way 💗", "becca_fleming": "I need these necklaces!! Please make more!! 😊", "sabbotage": "Ordered💪👊", "sofein99": "@ajunger86", "lnettels": "Cannot wait to get this when it is back in stock. Thank you. Something I need at exactly the right moment.", "namaste_in_love": "I’d LOVE one!", "luna.androse": "Gorgeous, love this! 💕", "michellemcbalogh": "I’m on the wait list, but would love to see these in silver too!", "sir.weiner.global": "@kittymeowny @emily_of_adam @im_onlysleeping make me feel better", "caviar_house_hk": "Come to visit me 👉🏻 38-40 Hollywood Road | G/Floor \"DACHA\" HK", "rebeccaravee": "I love this so much ❤️", "jackie.ayres": "Hi @jengotch I just listened to your interview with @dave.asprey on @bulletproof radio... which Dave I vote for more interviews like Jen! I am a devoted BP podcast listener and love @jengotch so this was one of my favorite episodes! Jen I appreciate your openness and bravery to talk about mental health issues. I relate to with your struggles on many levels.... depression, as an entrepreneur, as someone who loves to help others but rarely likes to accept help. I also love your daily rating system!!! Although I don’t suffer from bi-polar, I related to you not wanting to be at a “10”... the depression would tell me that there’s no where to go but down if your day is a 10... so a 7.8 or 8 is perfect in my opinion. Thanks so much to both Jen and Dave for this episode!!!", "tamatha_ann_harris_": "@waresthatgirl", "oldwestnaomi": "How amazing- and they look bad ass", "cieraalvarez": "How do you get on the list? Or just buy one? Waaaayyyy late to the party... xoxo", "jengotch\nVerified": "Verified", "intrusiive": "PPD please!", "preciousjulesnyc": "I would love necklace, how do I get on the waitlist?", "taylorreneei": "also! a meet up would be cool, just saying ;-)", "traceywalrus": "@eatyourwheats", "sarahreillyengel": "Can’t wait till they are restocked. So nice to have you yesterday at our event;) Hope you got home safe. 😘", "busybeingbizzie": "Love this & love you thanks for using your voice and of course baubles to break the stigma!!!", "blogandbiz": "So glad you’re doing this! I struggle with depression and anxiety too, and it can be hard to talk about.", "ohmariarose": "Thank you.", "reinita_crosa": "Thanks.", "kateelisehickman": "@cherismith_ 💛", "jess_stanier": "IM IN 🌈🧡🧡🧡🧡🧡", "justjennyhutt\nVerified": "Verified", "themwcollection": "Wonderful!", "classymassey": "👏🏻🦄", "amysgotjokes": "Do you think you will restock? Thanks!", "aplatsf": "Thank you. And wishing you the same.", "jaclynkathleen": "@jengotch will there be more?", "welli18": "They are sold out! When is the restock?", "everydaylifewithjennynourse": "I love this so much.", "danalande": "@janneckeweeden you need to follow this lovely lady...we all need to follow this lovely lady ❤️ trust me on this!", "stillbloomingme": "I love this!! Would love to see a PTSD necklace @jengotch I would rock it everyday...just like I do with my own ptsd journey!!!", "katieaselton\nVerified": "Verified", "lulu222a": "What a maverick and pioneer for all. Go girl.", "callieammidonbiggs": "💕👌🏻", "heathersfield": "I can’t wait until these are back in stock. Thank you for doing this. The struggle is real and the conversation needs to be more open about it. ❤️", "jambomelanie": "Jen, I saw the designer commenting on bando ig. But after further investigation they copied the Snash jewelry rings!!! People who are saying this glamorizes mental illness don’t understand the power of community and destigamatization thru art. You do you!!", "essentiallyandi": "I really hope you make a PTSD one!", "vemberog": "When will they be back in stock?!!? Thank you for designing these! Had anxiety all of my life and would love love love to order the anxiety one-a great reminder of the daily struggle @jengotch @busyphilipps", "queensparkle1": "They’re already sold out! 💔😪 When will they be back in stock? I would really like an Anxiety one. @jengotch", "iblogalott": "So excited for these! Hoping for a restock! ❤️😍🙌😻☝️🏅@jengotch @shopbando", "marcy1962": "Dang it! Sold out! 😢", "shlbywt": "PTSD, please!", "suefb": "Please say you will restock!!", "brightlyeverafter": "Please make more necklaces! I didn’t see that they existed until this morning! 🤣", "taylorforbescole": "@chriscolecoach she would be a great podcast guest", "kwoodymiller": "Ah want both hope they'll be restocked!", "mollsnota": "Yes! When will you restock?:)", "flutterby07": "Thank you so much! Sincerely. These are necessary conversations. Mental health awareness is so important to me. Thank you ❤️", "lvelght": "Sold out! Yay! On waiting list. So happy for you and the cause.🙌🏻💛💫", "jenflynnsheremeta": "When will they be back??", "pandawagon": "You’re an actual hero. Honestly. Mental health is so important shouldn’t be a shameful topic of discussion, as it has been for me in the past. Love the necklaces and the cause! Hope to order one, if restocked. ❤️", "fannywrites": "Thank you for being an advocate for mental health and using your platform to open up these conversations. I look up to you in so many ways. 🙌🏻✨", "kt.idiart.artistry": "Love 💕 this! I really hope they get restocked!", "lsork": "@jengotch you are amazing! Thank you for being you and for helping to put mental health in the public eye. I look forward to your insta stories every day to see what you are sharing with the world. You’re such a ray of light. I can’t wait for the necklaces to restock so I can get them!", "ckm1021": "I’m so glad u are bringing this forward. I have been more open with my anxiety and depression to let others know it’s ok to not be perfect! It’s ok to be different, and especially ask for help!! I’m bummed these are sold out. Hope you restock them!! Wearing these can really help start a much needed conversation!", "falweezy": "@becky_bird", "peteyhana": "I LOVE THEM!!! but why are they sold out already!!😫💔", "gracefeens": "This backlash needs to be addressed.", "hopsnbarley66": "Please restock. @mscamilleguthrie", "mshouska": "👏🏻👏🏻👏🏻👏🏻👏🏻", "gise_asc": "Sold out :(", "taylorapolis": "When will they be restocked?? I need one💕😫", "siouxsey": "@matthewgoodgram you two should talk 😍", "stephs_stuffs": "Will they be restocked?! I would love to have one of each!", "abasicshop": "@_catherineeileen", "carorobss": "Anyone know what typeface this is? :)", "franberrypie": "Make more please! 💗😍", "beccaburzlaff": "This 🙌🏼 is so incredibly important.", "alexandrawrote": "@goingmentalpod ☝🏻", "facingwest99": "Seriously. ❤️", "bold.and.young": "Muaak! Love you! @jengotch you’re an inspiration.", "cpfry": "🙌🙌🏻🙌🏼🙌🏽🙌🏾🙌🏿", "daramadylen13": "I love you so much. Thank you for fighting the good fight", "siristolenanderson": "When will they go back on sale!!! @jengotch", "patdou": "😘", "probertagerber": "When can I get my #anxiety one?!?", "christinarockey": "Love!", "ellerieanna": "Thank you for this. ❤️", "duh_lyssa": "@laurynmacauley I love this lady who is real about depression and anxiety! And she’s the founder of ban.do!", "sktemple131": "@jengotch how do I buy? My lady gang needs these!", "purpose_playbook": "Such a great concept! 💛", "tippysunridge": "Sold out! 😭😩 restock soon please!!!", "dramonicahodoyan": "Thank you!!! 💕❤️💕❤️💕❤️💕❤️💕❤️💕", "rainbows.n.skittles": "Bummed the necklaces are already sold out. Would you make one for bipolar??", "paige_previvor\nVerified": "Verified", "bulletproof": "💕👏", "emilykatetravels": "So good 🙌🙌🌈", "ivyandstone__": "Can’t wait to buy one!", "oitsmycupoftea": "Ahh they are already sold out!! 😢", "voltadomar_": "♥️", "thisrezlife": "🙋🏻‍♀️anxiety restock please", "ashleyfayssoux": "These are amazing! Please restock", "missjazz_mine": "@klawv", "kemeinkoth": "❤️❤️❤️", "k8thanley": "Already sold out! Jen Gotch you’re amazing and I appreciate you", "christinasaid": "@jengotch please restock soon - just went to order one and they are sold out 😔", "aliceanna.co": "Can you make a bipolar one for your fellow bi fash babes pls. 🙋🏼‍♀️", "anemilyb": "I LOVE these mental health necklaces so much. Thank you for what you do to share with others. I’d just like to toss out some future ideas for physical issues as well-“Hemorrhoids” “Gout” “Diabeetus” “Bad breath” “Nipple hair” I want to talk about everything!", "marierao": "I want an anxiety necklace/ Kelly Oxford said you are sold out... will you Stock more??? I’ll dm you my email.", "kylladelphia": "@brittany_maguire you’ll love these", "kristendudding": "❤️❤️❤️❤️", "slothattack": "Hope you’re able to bring these back in the future. It’s awesome you sold out for a great cause 👊🏽👊🏽", "jordansondler": "Thank fucking god I ordered my anxiety necklace while I was peeing this morning", "rachdro": "will they be restocking?", "dianasdayoff": "Just rad. I'll be keeping an eye out for fresh Anxiety necklaces!", "therealmandymac": "They’re all sold out 😭", "xoxo.lauda": "Congratulations!! 🎉🎉", "jmhebert": "Sold out!", "gratednutmeg": "just ordered the Depression one! ✨💕 thanks for everything you do, Jen! You’re a big inspiration 😊", "emihagfish": "I bought this and I’m so excited!!", "styledbyhannahmoon": "Wow those sold out fast!", "bornandraisedvintage": "I wish I could speak out about mine like you can. Your an inspiration.", "rj495": "THE ANXIETY NECKLACE SOLD OUT AND NOW I HAVE ANXIETY!", "pattymessner": "💗💗💗", "serabellum": "Oh my my Jen this is amazing!!! Can’t wait for them to restock 🤩 It’s been so real following your mental health talks, and I have to say this is the most admirable and effusive course of action that I’m sure will reach many out there! Thank you for the incredible insight you’ve provided so candidly with us. Your commitment to initiatives like these remind us so deeply to love our vulnerable selves and each other. So much love for you, your collaborators, and your fans 🙏💖✨", "openupandsayah": "Love!!", "erinjestleyleonard": "@jengotch you are an angel. Thank you for these awesome necklaces!", "shanw0w_w0w": "I don’t know you and you don’t know me... but thank you!!! Thank you for helping me see clearly! honestly, I watch your stories and I’m like shit, I don’t have to have it ALL together ALL the time... you have taught me to be silly and that my Mental health and taking care of myself is of the utmost importance! #puttingmefirst #jengotch #jengotchismyspiritanimal #livingvicariouslythroughjengotch", "kelsull": "we need more anxiety necklaces!!! theyre all sold out!", "sarahfogz": "Great effort to bring understanding of these common conditions", "bg3w": "LOVE this idea. So many people do not want to speak opening but talking and sharing is soothing to the soul 🌈. Ps. Your pix on bando today 🔥", "savvy.ln": "Thank you so god damn much for being so open and honest about life with mental illness. I've had so many people shame me and I was kicked out of a sorority for even mentioning suicidal thoughts.", "christina__benton": "Will the anxiety necklace be restocked ? 😭", "sipsongspirits": "@seahoney44 made me think of you. I’m feeling lucky to hear @jengotch speak right now. 😍", "outoflinepodcast": "WANT. love this. thank you", "gnarielle": "Love this!!!! You’re amazing", "nosliweilak": "Ahh the anxiety one is already sold out! Will you be restocking??", "_brwnsugar_": "Must restock! I need both pls 🌈✨", "jo_mi_co": "YOU ARE A PIONEER, @jengotch. keep being you, please ;)", "hellomytribe": "🙌🏻", "melissamarieharrison": "LOVE LOVE LOVE!!! This makes my heart burst with joy! Keep it up Jen!!", "sarastarstuff": "👌🏼💕👌🏼💕", "heyhellolauren": "Just ordered mine! Thank you for highlighting this convo so much! 💕💕💕", "courtneyandthebabes": "❤️ adore you...", "triptyque.travel": "😊", "chelseadrew": "Please restock the anxiety necklace! I’m just two hours late to the game 😭😭😭", "linz_901": "Mehhhh!!!! The anxiety one is sold out!! I need both and manic depressive! That’s me 🙋🏼‍♀️", "mackienichols": "@oliviakshirk", "star.babyyy": "@twyla_dawn I like jen gotch", "rypi3": "YAS QUEEN 👑 👏 💃", "rosealwayss": "❣ PERFECTT TOO ❣", "baileybrissett": "This is going to be my finest accessory 💗💝💕", "flowersandgarbage": "Please restock ANXIETY", "aprillshowers": "❤️", "cyd.nie": "I hope you can restock anxiety :)", "cecedupraz": "L💊VE🙌🏻", "kaitlincorr": "Will anxiety be restocked???", "jmasouthbay": "You’re a super hero!", "decor8\nVerified": "Verified", "chelseamclay": "Omg the anxiety one sold out 😢", "lauraxamo": "I had the anxiety necklace in my shopping cart and then it disappeared 😭", "theiconery\nVerified": "Verified", "ohfritzy": "Love this and thank u", "emmadime": "Yes yes yes yes yes!!!!!!", "jillianadriana": "Bought 2!!", "kemigreen": "❤️", "sarazucker": "BOUGHT 💫", "randomlysamantha": "❤️", "amsies": "Love this, you’re the best!", "emfromearth": "@k8.hopkins I want one!!", "sugarwishgirl": "❤️🧡💛💚💙", "meowfavorite": "Thank you", "bakermads": "You go Jen! Psyched for this, even on the waitlist", "chelsealeifken": "YU$$$$$$$$$$", "norcalpeach": "@jengotch will you do a restock of “anxiety”? I’d like to get both!!", "conflictedpixie": "@thisismybrave", "blg": "Anxiety #soldout❌", "studiohartshorn": "❤️🤗", "k8.hopkins": "@emfromearth !!!", "artcampla": "Smashing the stigma. Love you @jengotch", "corinaomi": "Anxiety is already sold out ☹️", "baesicallyemily": "The anxiety ones sold out so fast! Congrats and clearly there’s a high demand for this type of thing!", "mimosahandcrafted": "Amen amen amen", "bellapotts": "@malsperling I love Jen Gotch!", "lizberezford": "When will you get more!? I love this. Thank you for being my favorite voice on the gram.", "mistywinesberry": "I LOVE you for this! #endstigma 💙", "samantha_rei": "Thanks, JEN!", "trianamariana": "Ordered Anxiety just before it sold out, while in the waiting room of my therapist’s office 👍", "abbey.gif": "@sixkiller_kate OMG LET’S GOOOOO", "karendacre": "@helenseamons confirming what we always knew xxx", "theidentitecollective": "Love this. You are magic ✨", "helenseamons": "@karendacre love her. I am getting an anxiety one and wearing with pride. Xxxx", "heartenholmes": "Omgoodness! I went to buy the anxiety one and it’s sold out! Congrats, but I can’t wait to purchase if you make more! 💕✨", "dreamqueenscatchers": "@rachelclarisse this is the founder of @shopbando & you should follow her! I LOVE the honesty she brings to the table surrounding mental health", "beesnass": "@carlitawine", "lloyd_noble": "#highonthequils 😂😂😂😂😂😂Please turn these catchphrases into clear makeup bags. You are my spirit animal. Damn, I don’t think you’re aware of how many people feel so much better about themselves knowing that you GET IT, that other people GET IT.", "molliewoof": "Bought!", "livinlikelarz": "NOoO anxiety is sold out", "ariellevey": "💘💘💘💘💘", "jennapilant": "You’re already sold out 😩 but that’s awesome too! Congrats!!", "lizlizlestrange": "Bipolar woman here to say THANK YOU. I’m an avid story watcher & seeing you be so open has helped me be more open with disorder! YOU ROCK JEN 🤘", "megscholz": "Sold out while I was mid transaction :((((( will there be more soon???", "partycrushevents": "Anxiety sold out mid transaction!!!! Gah! So sad", "jessielaneinteriors": "So huge for all of us. I’m an OCD girl myself that sends me into a downward spiral of depression. Thank you for what you’re doing.🙏", "swaffasaurus": "OMG went to buy one and it’s already sold out! LOVE this hope you release more!!!", "elleebeans": "Man oh man wish I could get the Anxiety one💔 Jen, I'm so proud of you for doing this and using your platform to end the stigma!💕🌈 Ps. Hope you're starting to feel better and keep doing you, Jen✨", "heymavensxo": "Thank you for being a leader in normalizing mental health issues. It’s super important. 💕", "daydreamarcadekids": "I really love the idea of a conversation starter! As a small biz owner with anxiety and adhd, it’s been a struggle but a great learning experience!", "beardy.glasses": "Oh thanks Jen!✨", "novamercury": "💗", "augiefitz": "YAS!!!!!! Would love a “bipolar” necklace too", "acacianmay": "❤️ this", "mkshome": "Did you just style this super cute shot with your PJ BOTTOMS... obviously I stalk your stories... love the necklaces and will probably rock both", "hey.caramargot": "this is great and i also cast my vote for a manic-depressive one!!", "topanga_vintage_market": "👍so key right now! Thank you, Jen Gotch!", "gulushthreads": "You continue to be such a strong voice for those struggling with mental health and the stigma that goes with it. Thank you.", "prettycrabby": "Already ordered ANXIETY. ✌🏼⭐️♥️", "booride22": "Please make a bipolar necklace 🙋🏼‍♀️😍", "gabyviteric": "💪🏼💪🏼💪🏼", "court990": "@lololorian 🖤🖤", "anxiety_piglet": "Ordered mine! So excited.", "penguinfreakk": "love u- love this- inspired to the max", "bringchangetomind": "💚💚💚", "lindseycrafter": "You go girl!!!!!", "meghan.awalt": "We love you!!!! Thank you for all you’re doing for this platform.", "_eurwen": "Hi I just want one of these cards please xoxo", "sarahcerney": "love ya gotch", "sadesmae": "I love this", "suzyultman": "🙏🙏🙏🌈", "hoe_for_fdr": "i love you jen gotch!!!!!!!!", "sallen124": "🤩🤩🤩🤩", "naattyb": "Purchased! 🤩", "stephy_stardust": "YES🙌🙌", "kvenia": "Jen Gotch, you are an AMAZING human! ❤️", "blakeloates": "I got mine!! I’m so so sooooo excited!!!", "carly_ashdown_art": "I love your insta stories, funny and real, thank you so much for sharing 💛🙏", "jessichaas": "Purchased mine ❤️", "malsperling": "❤️❤️❤️", "thetendertiger": "This is so exciting. I hope you make a bipolar necklace 💜", "cami_boyett_studio": "Need", "sarahraydesigns": "So amazing! I’m really proud of you and all your doing to spread the word about depression & anxiety!! You’re the bomb dot com", "pattycascar": "😭😍💖🙏🏽", "jesstinybird": "Can’t wait to get mine!"}