{"pandabyproxy": "I have chronic anxiety and have been drowning in a sea of loneliness, depression and anxiety for the past few months. I just found you and this post was super inspiring to me. I don't know much about your hardship but I'm happy that you found strength and are helping others. Thank you soul sista 🌞", "viv.shih": "Thank you for inspiring me. Needed this today 💕 xoxoxo :)", "aoifer8": "@cmetzel love this lady", "okliviloo": "You look awesome but more importantly you feel awesome. Also who makes those leggings? I love them!", "bethatam": "@emilyhansen_tam up kate from coughing. This post spoke to me. So similar. Love it @jengotch", "allisonwetig": "This caption is soooo good @maddiemeier", "nicole.harrisss": "@jocruickshanks", "taira_kete": "@sammogford ❤️❤️", "bungerpartyoffive": "@amanda.l.armstrong 😂", "sylvie.tamayo": "Yaaassss 💪🏽", "rubychooseday": "@bby__blue I lover her so much.", "stephmrobinson": "@xoxojro", "courtneyfancy": "Shawty you are amazing. What did you do?", "bembafly": "Your journey give me hope and inspiration that my journey may too end well in progress and peace ❤️", "courtneyianni": "@sammydocious", "mandybauer_": "Yea! Focus on giving back to women and soar! 🍑❤️🍑", "barbaraserry": "@alohaashley9 😘", "captain_kaytee": "You look fab! Hold your head high!", "questntheanswr": "This post is so hopeful for me. Thank you for showing me it can and will get better.", "denisegomezphotos": "You go girl!! #inspiredclubpower!", "nikfrom73": "U look great! And most importantly, I’m glad u feel better!!!", "voiceoverdarling": "#proofofhot", "ivegotknits": "Go you!! Effing awesome work 🎉☀️💕", "shanlittle23": "Same. Same. Same! I asked myself today if emotional weight was a thing bc I feel like I’m carrying around the weight of my emotions and the stress of school and work. I am so proud of you. Speaking from a similar place, I’m so happy you are feeling better and healthier. God bless you.", "paigeappel": "Still just loving this post babe.", "aceandjig": "💓💓💓", "aeskinmedspa": "Just DMed you", "whatartistslistentopodcast": "Brilliant!", "rebeccaravee": "I’ve always loved ban.do for the way it’s added light to my anxious life. The pretty messages cheering you on, popping up at exactly the right time, the perfectly-worded tees...Scrolling through your feed has made me understand that much more why I resonate with your brand so closely 💖 You’re an inspiration ✨ Wishing you all the high 6s, 7s, 8s and 9s - and all the love and strength when those 3s hit💕", "madisonjanelletaylor": "Looking AMAZING", "marinna_ca": "❤️", "angelampickens": "Wowza! You look fantastic!!! @jengotch", "fryfryfryfry": "@michaeljkruse", "salsa_tits": "JEN! HELL YES", "oakclifflettering": "You look great in both!", "saudiasaleema": "Jen, you are amazing.", "rosiedargenzio": "Congrats, v inspiring!", "andreacardenasr": "YOU GO GIRL!!!!♥️♥️♥️♥️🌈✨💕", "hatstoshoes": "Super honest and brilliant ! You rock!!!💥💥💥💥💥💥💥", "s.alxs": "You’re my freaking hero", "gascoigneandking": "Naw beautiful in both pics babe", "thegoldlines": "👌👌👌🙌🙌💕💕💕", "marlen.m_": "👏👏👏👏 love this so much. I know very well how regression feels. But-- each time we get back on our feet we rise stronger & a hell of a lot sharper. Sending you love xo", "bneatobar": "❤️❤️❤️", "kristenhutchinsdesign": "Looking great, Jenni!!!", "genkog.dkv": "Beautiful!", "monicasmixx": "Wow! Such beautiful and elegant words. Also, straight forward & pretty damn funny too. You deserve bragging rights for working through your issues. So many just stay in that comfortable state of discomfort. You go girl!! 💪🏼👊🏼💗", "gretchenmariehunt": "Best part is how your shoulders are lower and you are standing TALL. That’s internal growth!!!!", "nicola_larsen": "This is so relevant to exactly how I’m feeling right now I hope I can come out of it and progress like you have. Well done x", "ashleyfayssoux": "Yaaaaaaaaaaassss", "daniellenadick": "You are amazing 💪🏻", "krystalgianni": "I just discovered you through girlboss stories and you have instantly become my inspiration! I went through a divorce a couple of years ago and then found out I have MS last year... I’ve just gotten to a point where I feel like myself again and I’m lucky I’m not alone in this feeling! Thank you!", "therealblackhistorian": "Hey beautiful when you get the moment, follow my page... Best source of black history on Instagram ---> @therealblackhistorian", "emeljurd": "You gre taller.😜", "elliecess": "You go girl!! 😘", "kellyfblocker": "@brittanymarie8787 I love this woman 💗 think you might gain some perspective from her too 😘", "reallyamy": "You are loved ❤️", "steviepants": "@jengotch Thank you for being such an inspiration. Just this year I have come to very real terms with my depression and anxiety and I’ve committed to make a change, a REAL one not a half assed one like in the past. Know you are pushing us all further along on our journeys and serving as such a source of happiness, laughter and real-ness. THANK YOU.", "moondustla": "Get it, guuuurl 👌🔥👊", "sunny.sam": "YES QWEEN GO OFFFFF 😍😍😍", "matriarch_studio": "Get it Girl!", "letzy_albarran": "Wow You look so amazing!", "amberzaricor": "Amazing! You’ve got this! We all go into those seasons, even when all of ours are triggered differently! You’re not alone! Coming out on top of it all with a clear mind and positive outlook is such an inspiration! Keep it up girl!", "stephaneeee_39": "You go girl!!! Proud of you, proud of all of us. Life is fucking difficult we keep going because in the end it’s so worth it!!! Also because life is pretty great & worth fighting for❤️", "alina__cervantes": "Amazing and congrats! I was in a similar place, using Chinese food like heroin and eating my stress. I too hit bottom and said no more! You are 🔥!", "estherplaster": "Oh my gosh I love this pic and post. Just took Great inspo from it. Yikes - I need to get in the Journey to feeling good again! Here’s to health and feeling Awesome!", "josievorenkamp": "You are AMAZING, gives me inspiration and hope to know that it can always get better even when I’m feeling low.", "michaelawesterlund": "Get it!!!! 🏆🏆🏆🏆", "naomiyokomakeup": "You are a badass queeen ♥️♥️♥️♥️♥️♥️♥️", "taylor_trashed": "You look great! Willpower 💪🏼🙌🏼⚡️👌🏼", "gastrognomey": "I’ve been holding 5 yrs of stress weight when the world served me a bunch of lemons at once. I’ve been diligent in ‘showing up every day’ and doing the work, but I feel like I need to call in the big leagues shit and do an ayahuasca journey. Not sure if that’s the answer, but was curious what you felt the most ‘impactful/effective ‘ emotional healing source was... the thing that clicked? Or was it truly the combo", "sarahbeth.ramsey": "I just adore you! Love the real ness, boss-ness, and you just seem like such an awesome person. I hope he sees it too! Loved your @girlboss takeover today!", "pdambientaciones": "U rock 🎸 🤘🏻😜", "tybrickhouse": "I love how@you said your brain feels better. That’s awesome 😎", "mistytosome": "Yassssssss ⚡️✨⚡️", "sarahvanessaofficial": "👏🏻👏🏻👏🏻", "ourladyof_thismoon": "Bad ass! I ABSOLUTELY needed to see this just at this moment 🖤⚔️ congrats my sister. **you also had me at: “that’s what she said” 😆✋🏽", "mariellabowman": "You go girl!!! I noticed you looked slimmer !!! You have a glow!!", "lazerwolfff": "You look H-O-T-T girl!", "skynxcyn": "Cheers to you and 🖕🏽 that guy! 😂💕❤️", "moreen19": "This is amazing 💓go girl", "sambatrader": "💕 💕 💕 💕 💕 💕 💕 💕 💕", "cheetopuffqueen": "😭😭😭😭😭😭😭 @ your story. It’s been SO. HARD. For me for like a year????? Seeing real people like you @jengotch gives me hope that I can climb out of this sad-self-deprecating-unmedicated-unhealthy pit and can be able to rock shit one day (hopefully soon)", "poetic_xtract": "Jen, you've GOTCH THIS!!!! 👌💘", "geeseandganders": "Inspiring!", "pierregalantphotography": "Inspiring! Congratulations on your journey of self- awareness!", "leaphboutique": "🙌🏽 love your honesty and transparency! It was amazing getting to hear you speak at the makers summit as well!", "anchorb": "Damn girl! You look so strong!", "annetteshade": "🙌🏼", "julieelizabethtitus": "❤️", "marigoldcurated": "LOL THE ENDING. I feel you on so much of this. Very happy for you finding a new sense of peace and strength. 🤘🏿 rock on", "swtalohagurl": "Hugs ❤", "_camilleleonemagazine": "SALUTE!", "kerrycrawford": "The very BEST 💖", "mocloydo": "wow oh wow. looking so good!", "barefoot_singer": "@jengotch If I was single and a lesbian I would marry you 😘", "gretchcma": "Rockin it - per usual!!!", "mythreesons": "❤️❤️❤️", "kfanniff": "Kudos to you for putting in all the hard work! You look great but even more important is that you feel that way too. Inspiration for me to get to work too.", "nbernal": "❤️", "wesselsnadia": "Awesomeness and you are really looking good!!!!", "ginarockenwagner": "You look amazing jen. It takes so much discipline to eat well and work out and do the self care, while being a boss bitch, and you make it all happen with style. You radiate, lady! 💪🏼", "awokoh": "Girl that's the biggest clap back!", "sup_4_fun": "👍🏼🔥", "brilamberson": "Many women including me needed to hear this.", "mimzrossi": "@kelsey_rossi read until the end", "carrieannpurcell": "💥💥💥❤️", "ellenp13": "You ROCK!!!", "erin917": "everything about this is an inspiration 🧡", "yoginwtx": "Fuck yes!!", "lisa_kenny_studio": "Absolute warrior! 💪💥", "americangarage": "Nice work sis! 💪🏻💪🏻", "eleanorbowmer": "You look amazing and obviously feel it! 💥⚡️", "janglegirl": "So awe inspiring! You look great! More power!", "laurnt23": "Happy for you!! Shining from the inside out!", "voltadomar_": "♥️♥️♥️", "thelensprojectsg": "You go girl! Every girl deserves to enjoy the best of herself ❤️ Keep at it and don't give up 🎉🎊👍🏼👍🏼", "itsmyinstabye": "Yayyy yassss 👏🏽❣️", "kathykuonyc": "And you look OUTSTANDING!!", "thelifestyleedit": "Love you", "linz_901": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "domino34": "OMG, you’re looking AMAZING Jen! And you even managed to get a couple of inches taller in the process... love it!! I’m embarking on my own journey; just hope I do as well as you 🤩", "oliviaandme": "YES !!!", "westy78": "Thank you for sharing your journey. You inspire me every day to be true to myself ‘this too shall pass’", "merazad": "Absolutely fabulous. You did/do the work and it shows on all levels.", "notyouraveragesister": "🙏🏻🙏🏻🙏🏻🙏🏻", "alieulieu": "❤️❤️❤️❤️🔥🔥🔥🔥", "secretlygifting": "Yes Amazing!!!👏🏻👏🏻", "natalie.barron": "I know that feeling- after my last pregnancy I had 3 years of struggle. I hated my self, but haven’t give up. Today, a year after my second pregnancy (second marriage too), I have only one or two kilos to go. You’re great and you give others from your spirit 💖💖💖💖", "mini_teddy": "Thank you for sharing your story. You are awesome!", "_amykurtz": "Thank you for sharing your story 💗", "amanda.grado": "Thanks for the hope and your candor. It’s always a pleasure to see your posts. Thank you for sharing your lovely self with us 😊 in a similar place and regaining lost self is a fucking journey. ❤️", "brittanylester": "💛", "_simbajones": "I wish you could be my mentor! You're inspirational AF!!!!!! 💛", "absolute_mt": "❤️", "kjblattenbauer": "He totally missed out on a hot piece of 🍑. Love this, Jenb", "jjoules": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽💥💥💥💥❤️", "libbybothwayloves": "👊🏻👊🏻👏🏻👏🏻👏🏻👏🏻", "mmichiko2": "Wait what? Wasn’t the pic on the left just yesterday? 😂🤦🏻‍♀️ Mom-brain! You go girl!! You’re transforming inside and out and looking great along the way 😍", "afraimages": "You look beautiful ❤️", "umaandleopold": "🔥🔥🔥🔥🔥🔥", "littleblackantdolls": "💪💪💪💪", "bloomiesue": "Thank you for sharing your stories and experiences! ❤️", "juno.the.neapolitan.mastiff": "And a smart beautiful human", "lanavhansen": "Proud of you! Hope the list helped 🏆", "thealyssascott": "🔥👏🏾🖤💚", "moniqueneethling": "Very fucking impressive", "rbc1": "You looked great in your before shot! But it’s all about how you feel on the inside, so good on you for taking control. Fuck the ghosters— you’ll find a better one!", "saucydeluxey": "You are a total imperfect package and that’s perfect. Thank you for always being you. It’s inspiring, and relatable and supa dupa B R A V E.", "caddylabacon": "Powerful and Beautiful ❤", "alyssa_irl": "Slay girl slay", "thesarakern": "❤️💁🏼‍♀️", "eddiepeanutt": "Yes honey!!! ♥️♥️♥️♥️♥️", "petitsparrow": "❤️", "carliestatsky": "❤️❤️❤️", "confetti.gt": "🙌🏻✨🙌🏻✨🙌🏻", "uni_brow": "I'm going through the same sickness right at this moment. Thank you.", "nancyfancypants": "💪🏼💪🏼💪🏼", "thelittlebirdyme": "🙏🏼💁🏼‍♀️", "licicox": "Celebrating your accomplishment in finding your strenth💪🏼. And celebrating that you ARE a hot piece of ass!", "kattitudetattoo": "You look so good girl!! Motivation for sure!! 👏🏼💪🏽", "sidneylanecreative": "YOS HENNY", "sugarpinepnw": "Hot DAMN!", "herbivorebotanicals\nVerified": "Verified", "getadvancedchic": "Looking Goood🙌🏻💕👍Your hard work is paying off. Fantastic. So Happy for you😍🍀❤️", "catherine.drysdale": "You got this girl. I’ve been going through something similar 💪🏻💪🏻💪🏻", "sweetmarilee": "You are viable & vibrant in both pictures!!!", "makeupjunkie_j": "Good for you! Brag on! Stay healthy mind, body and spirit! 🌈", "salid23": "\"...I never give up. Which is mostly anxiety, but still.\" Haha woman, you are singing the theme song to my life! Thank you for sharing yourself, your path, experiences, ups and downs. ❤️ I'm totally in 'before' status thanks to me letting job ripping my life apart. You inspire me to become the 'after' version of my dreams 💪🔥💫", "love_bwkc": "God Bless Jen I am still in the struggle I hope I come out on the other side looking as great as you do😁", "jackstevensbasil": "Oh, this is so wonderful, so much love for ya.", "2tickets2amberdise": "Fukkkkkk yes! 👏👏❤️💕", "thebestdaniellelevy": "I just love how open, raw and real you are. Such an inspiration and has helped me to clue in to my own shit. Honestly, I don’t see much of a physical difference between the before and after BUT I do see your energy. That’s where the difference is on full display. Positive. Confident. Brave. You’re standing tall, chin up, arms back, ready to face the world. Shine, baby, SHINE! ✨", "sarahstaceyinteriordesign": "Damn girl!! Hard work pays off.", "_mariaalcantara_": "So good. I 🧡 this and those pants are cute. Sending you continued strength!", "themeganmaes": "You’re an inspiration ❤️💪🏼", "brittanyarita": "You are a god damn revelation.", "tinypinecones": "Lookin' dope 😎", "26andnotcounting": "I love this so much 💛 you are a breath of fresh air, Jen. ✌🏻", "tinysarahscakes": "You look ready to take over the world 💖", "pro_ha": "Girl, yes!", "dailybailey": "👏🏽👏🏽👏🏽 brava!", "le_scooter": "Thank you for sharing. I went through the same thing a couple of years ago. Lost friends as a result of my divorce as well, made terrible decisions while drinking too much. I made it to the other side, and am so grateful as I never thought I would. Good to see others sharing their stories and demonstrating strength in admitting weakness. Congrats on making it through! 🤘", "graphicanthology": "Go you! 💕", "mrs_marymac": "I can not stop looking at these two photos. Well done, you hold your whole body differently in the second photo. I love it.", "year901": "💪🏼💪🏼💪🏼", "christiembailey": "✨👌🏼👌🏼", "aphroditecomplex": "🙌✨❤️😘", "jenvictoor": "You have every right to be very damn proud of yourself Jen. Great job. You are an inspiration to all of us. 😘❤️", "haileytuck\nVerified": "Verified", "jennifer.fogerty": "Your openness makes me feel seen.", "hey.itslindsay": "You’re amazing Jen! And It’s so beautiful to see your courage and strength. ❤️❤️❤️ I don’t know you, but you have overcome so much and that is worth sharing and celebrating with others!! 💃🏻💃🏻💃🏻", "galmontgomery": "Could you be any cooler or more relatable? Nope! 🖤🖤🖤", "lobarry": "Inspiration city!", "absolutehuda": "Inspired !", "kolloquial": "💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼", "waxcabin": "You look happy and trim! 👏", "dvandylion": "🙌🏻🙌🏻🙌🏻", "dknix": "You ROCK!!! 👏🏼🎉🍭", "gegichju": "👏🏼👏🏼thank you for your openness!", "mood_living": "Yeah!!! 💗💗💗", "birdyb75": "You look amazing!!", "lizardd_lips": "you’re awesome!", "tipsfromroman": "Gurrrl you look good 😀", "amyfosner": "Haha the last line made me LOL. This is super inspiring ❤️💫", "lauren.arizona": "Thank you for sharing and being so transparent about mental health issues. So happy for you❤️", "chelseamatthews": "Crush-ing-it", "carlyrburson": "Everything. 💕💪🏻", "retaildetails": "Thank you for your bravery and honesty. 💙 Inspiring.", "karathecreative": "Yes girl yes! You did that! 💖", "cheyrayewilli": "Feedings 😭😭 so relatable. Thank you for being so transparent with us", "pretty_o.d.d": "👏🏾👏🏾👏🏾👏🏾", "4theegirl": "💪 keep working it 🙌🏻😘 your beautiful inside & out", "cupmycakez": "I love you very, very, very much", "coachingwithsofia": "Get it gurl", "advonre": "You had the strength in you always... and it will NEVER leave. ✨thank you for sharing this. @jengotch 💕", "elizabethpettey": "YES GIRL", "waxinmama75": "I would be happy even looking like your before 🤣", "therealjor": "Yas kween", "aballensweig": "Awesomeness!", "foundrentals": "Aside from looking fucking hot (which you do) it’s awesome that you FEEL fucking hot (which you are). Thanks for sharing and being an inspiration in all you say and do.", "racheldotake": "Exactly what I needed to see and hear right now.", "saraswatidesign": "🙌🏽🙌🏽🙌🏽", "aakgrimes": "Look how skinny those ankles are!", "melb_selena": "Thank you for being amazing ❤️", "thisgirljrod": "Yesssss 💙", "skyle": "Rock on! 💫👊", "empiric_furniture": "Dang mang", "keriphotography": "Bravo!!🙌", "awhimsywonderland": "You look amazing! Even happier that you feel better!", "curliek8": "I love this a thousand times over! #inspiring", "laurawilsonlife": "I f***ing love this post. Thank you for sharing your words and your hot piece of ass! #inspiration #truthspeaking 🙏🏼💖✨", "lorijo47": "You are just incredibly real and raw and for that i thank you ❣️", "stephgilhuly": "You are an amazing woman and I love what you did for yourself (and continuing to do) and for yourself only! As many of your followers, you have inspired myself to take care of me and me first then help others. Thank you for being you! Thank you for being so damn creative too!", "bn_hairjewelryandartwork": "Awesome!!!!!", "gates_layne": "Needed this 👊", "its.me.myriam": "I can relate so much to what you said about being weighed down - literally and figuratively. I’m working on getting to a better place. I’m so glad to see you feeling better. I’m rooting for you.", "bird78": "So proud of and inspired by you!!!!!!", "inagarten1": "You’re AWESOME🙌❤️✨", "shananigans_822": "You are my spirit animal & your stories give me life. This just gave me a much needed shot in the ass to stop my own “feedings”", "bridget951": "You celebrate EVERY accomplishment and BRAG THE FUCK out of them!!! You are AMAZING and an inspiration to many!!! Keep doing you!! Thank you for sharing!!! ROCK ON!!!", "_courtney_heaton_": "Good for you!!", "vegan_vsg": "love this, love you. xoxo.", "chelsea.jimenez": "Yes! You rock! 💪🏼", "maggiemason": "Get it, HPA.", "jenifer.rod": "your dope AF and loved. thank you for sharing and keep going sister☝️💚💚👊👊👊💛💛💛", "onesmallredhead": "Can we be your friends?! I love your style, and I’m not just talking about what’s on the outside. #fuckit #thatswhatshesaid", "hart987": "❤️❤️❤️❤️❤️❤️❤️👏👏👏👏👏👏👏👏", "dear_krysta": "Amazing. Thanks for sharing! You rock!", "mixmastermel_b": "🖤🔥", "allysoltesz": "Your openness about your own journey has helped me so much on my own. Thank you, and rock on, lady!! I love your humor, honestly and impeccable taste 🌈", "joj_schwoer": "you go girl", "rebekah_kay": "You worked hard and it paid off. That is inspiring: to learn how to work hard FOR MYSELF. It's what I want. Thanks dude 👊🏼", "lostinlakes": "Yes yes yes", "jillkaym": "You go girl!", "papeback": "Great job!", "adrianarotu": "Hay que hacer esto @karimontes tomarnos una foto ahora y dentro de un año.", "ardenmyrin\nVerified": "Verified", "lizhoffmann": "I don’t know you, but I love you and I’m proud of you Jen!!", "kristencaublemorse": "Happy for you!!", "sheridansturm": "Jen you’re amazing!! 💗💗", "pinkmartini411": "Thank you for sharing your story. Very inspiring.", "chelseagloria": "Yes. You are truly amazing. And one hot piece.", "tracybydesign": "🙌🏻💞", "paekles": "Yes girl! You are amazing!", "lolliswim": "🌈🌈🌈✨✨✨", "kyra.petticrew": "This is so lovely 💕 I’m so thankful for everything you post, and that you let us in on your journey. It helps so much 💕💕", "comely_vida": "You go, girl!!!", "janabouttown": "😍 👏🏻", "hardinghilldesigns": "Gives me hope that I can do some of the same for myself...thank you for sharing! 🤞🏼", "_julespalmer": "You are looking great Jen. 😍 For the record, when I first saw the before pic back in December, I thought you looked fabulous then too! I’m so happy you are feeling good inside and out! X", "salt.shadow": "🔥 🔥💃🏻💃🏻", "booandpapoose": "😚😚😚😚😚😚😚", "gutenmorgann": "👏🏻👏🏻👏🏻👏🏻", "daniellerroach": "You look amazing!!! 👊🏻👊🏻👊🏻", "odettewilliams\nVerified": "Verified", "trash_savant": "Killing it 👏🏻 love when a woman is strong through being vulnerable...more of this ladies ❤️ we Can be both and more.", "bethcohenmitchellphotography": "Yasssss!", "meg.weber": "💯", "dsar3": "⚡️U r a badass ✊🏻", "vaidadta": "❤️❤️❤️", "jl_designs": "Omg amazing!!!", "melissamjharvey": "I love your message and how you deliver it #fanalert 💗", "ellerieanna": "This is everything. Thank you for being you.", "kelseybeerdo": "Babygirl!! God it’s refreshing to watch you grow. Keep kicking and killing it. You da real mvp mama✌🏽👌🏽", "moonmoonmel": "Yes! Love this!", "karrie.franks": "🙌🏻 you did the work! Pat yourself on the back and keep sharing your achievements! Way to go!", "envyofairplanes": "Love this. Your posts always strike a cord 💕", "rosiewonders": "I can relate to this. Congrats ♥️", "hellolorimeyer": "🙌🏻", "amandasbeautydish": "So proud of you! Way to go! (And guys who ghost are the WORST. We all deal with them, and wish they would collectively disappear. ✌🏼)", "jewishfoodhero": "Go you", "cadencevinyls": "💪💪💪💁‍♀️💁‍♀️💁‍♀️❤️❤️❤️", "d_zanimal": "Yes! 🙌😍Bravo", "lwrncalifornia": "This is 👌🏼", "caroeshaw": "💖", "iblogalott": "❤️❤️❤️❤️", "bornandraisedvintage": "Your inspire me every time I read these!! Good for you Jen!! Your are an amazing person and I don’t even really know you but from IG. I suffer a lot of the same things you do because of my PTSD. Thank you for always sharing when many of us can’t.", "saramoon": "Yay! Good for you:) You did you and I’m so glad you feel so light and free💃🏻", "christinamattinson": "Thank you for your share and strength!", "helananas": "That guy didn’t deserve you. End of story.", "dianajones7": "So beautiful. I feel like you are even standing taller now. Going through all that made you stronger. I love your posts and following your journey. Thanks for sharing 🙌🏻", "alipal88": "Thank you for your honesty of your mental health journey you’re amazing and we love you", "cinuol": "💖", "lettersfromla": "Love this and he definitely missed out!", "akabitchell": "You’re so amazing! Thanks for inspiring women!", "da_rzza": "@missnomo love it!", "rizzalana": "Love this 💪🏻❤️", "melodytaylorr": "Picture of HOT", "honeylakestudio": "#PROOF", "peter10476": "Nice", "soft__animal": "🧡🧡🧡🧡🧡", "juliannaleopold": "you are a hot piece of ass!!!", "helen_fernandes": "Congrats to you @jengotch you are a daily inspiration. I celebrate with you and thank you for your candor. 💪🏽💕", "lortbuttz": "Your stories are so inspiring and brave. Fuck yeah girl. Fuck yeah.", "onefinea": "Congratulations!! You can tell you feel genuinely good about yourself and you should. You’ve worked hard and it shows!!!❤️🤗👊🏻💪🏻", "randomactsofpastel": "Yuhhhhhhsssss", "socialwithshayna": "I love all of this so much. You are the boss @jengotch 💪", "fabulouslysheb": "So proud of you💪", "nicolepolizois": "❤️🌟❤️", "cbmama4": "👏👏👏👏", "toniasarah": "You look amazing! Happier mostly, but also leaner and healthier and your legs for sure got longer which, to me, is the most intriguing part of it all. 😉", "leah_readman": "damn good.", "karavanups": "Fucking perfect!", "lisaweser": "That last line 😂", "omniraysbodywork": "AWESOME 💗💙💚💛💜🖤❤", "jrschoen": "Can’t like this enough!!!!", "mrsaprillowe": "👊🏼💪🏼❤️", "oli_oakley": "Beautiful x", "debnobles": "👏👏👏👏", "reporterred": "Stand(ing) taller!", "shellsun_": "You are amazing✨Thank you for sharing, I feel better about my fog clearing. You are an inspiration ♥️🙌✨", "jackiebug": "YAS QWEEN", "jeniskind": "Your before looks perfect.....weight is all about perception. Your after looks great too. Your weight was never an issue- any nutritionist could have told you that.", "cath_miaou": "You are awesome. Thank you for existing", "hotdogjoint": "💕", "kbiscarret": "You look bomb 💣", "lconquist": "🙌🏽", "jmeackerman": "👑👑👑👑👑👑👑", "julia_nass": "💗🎉🔥", "dreaschneider": "I celebrate with you! Thanks for sharing and inspiring as always. ❤️", "mauraeverything": "Where is the accompanying choreography for this kind of success/milestone/journey/accomplishment? Let’s see it.", "margeaudyer": "Love this post.", "classicallyjules": "Giiiirl. U got this. I luv u @jengotch", "whitepeacockstyle": "Always babelicious! 💫", "alicebrewstylist": "Preach girl! Fuck yes! 👏🏻👏🏻👏🏻🌟", "rareheartsss": "Beautiful inside and out 🌟", "a.linyaraujo": "Inspiration and congratulations!!!!🤔💭🤲👏👏👏👏👏👏👏", "kaylawinten": "@amypo", "katwalkef501": "🤘😘", "45threemodernvintage": "Awesome!", "satsukishibuya": "Always deeply appreciate the raw, real, and human heart you openly share. Thank you for another moment of “We are ALL human.” Sending love. ❤️🙏🏻", "kell_menow": "You are beautiful human", "thebarbarajane": "You look amazing! I hope you feel amazing too!!", "megancherene": "Thank you for this", "ohhmissjessie": "Perfect!!!", "worklovely": "❤️", "macey.atcheson": "you look incredible! thanks for the inspiration ❤️", "foliusdesign": "You are amazing no matter what size you wear!", "cfleb": "Rock on with your bad self!", "pugsofinstagram": "I ❤️ @jengotch !", "jvfryer": "Never giving up mostly because anxiety... I relate to this so so much.", "lilysnodgrass": "Go babe! ❤️", "chickenmamamuffincake": "Glad you're doing better❣️❣️❣️", "deemeany": "🙌🏻💗", "isagiuliani": "You are so lovely Jen! Thank YOU 🌹", "birdy506c": "Sizzzzzzlllllleeee! Thanks for being so honest on this platform! And for making me laugh on a regular basis! May we all continue to help each other!!!! 😁😀😍", "lesliepix": "💥💥💥", "jennijumpup": "You go Jen Gotch! You are awesome! 😎 👏 👍 Love it!!! 😘", "li.unger": "Nicely done and thank you!!", "howaboutalilsunlight": "👏👏 in the second photo u look 19", "martynowak1": "Come to my house and I’ll bake you a cake! 😉", "golden_life_plans": "U go, jen!!!!", "globalgirl_la": "This is so fucking epic! Good on you!! ☀️⭐️💋", "the5dells": "🙌🏻❤️", "jazzycuellar": "Major inspo🔥 luv ya Jen! ⚡️💘", "mollsnota": "💕💕💕💕💕you rule. Thank you for being such an inspiration!!!", "rebeccafos": "Your joy... this growth, this honesty along with your free spirit & sense of humor are a gift we’re allowed to witness. Damn you ARE awesome 💥", "yodice": "🔥🔥 get it!!", "suziegram": "👏🏼👏🏼👏🏼", "mugsbythefire": "👊🏻🔥👊🏻🔥👊🏻🔥", "hellokerryrose": "💯💯💯💯💯", "shutterbean": "👏🏼✨🧚‍♂️🌈🐅🌻💋💕", "redheadbrooklyn": "Thank you for being you. ❤️", "lindseylovesyoutoo": "BAD ASS 💕", "jennalhatfield": "💚💚 Thanksgiving was also my “well, imma need to change this nonsense” day. Love to you.", "mrslaurenvickers": "Killer 🤛🏼", "cx.n23": "✊", "arelycirca1987": "This gives me great hope. Thank you for sharing!", "seetheinlet": "Good for you!!! ❤️", "sarahbarnfart": "Yes girl!!!! Fuckin work!!!!!!!!", "am_lau": "You got taller. Wow.", "frillseekers": "Inspiring!", "kaylynweir": "You look frickin INCREDIBLE", "sscheidler": "I have a love hate relationship with ghosting. On one hand... thank you for telling who you really are... on the other F U C K YOU and be a god damn grown up 😂😘 You’re amazing... he’s out there getting ready for ya", "gina.sabatella.foto": "@jengotch GIRRRRRRRRL SPEAK YOUR TRUTH 🙌🏼🙌🏼🙌🏼🙏🏼🙌🏼💕🍾🥂✨✨✨ You deserve all the magical- adventures life has to unfold before you. GOOD FOR YOU 👌🏼 TOOT TOOT (toot that horn of yours) GET IT!!!", "jackie13j": "Thank you.", "vanstern": "That’s awesome!!! Get it girl!!!🙌", "portlandaproncompany": "You even stand up taller🙌🏼way to go beautiful woman!", "justlikemajich": "💪🏼💕💪🏼", "tylrepaper": "you. fucking. go. girl. 💖", "thestylesample": "All that and brains too. Get it girl!", "jacquieindahood": "We are connected ... this is amazing and I’m proud of you 🐝💋🍊🙌🏼", "graceohill": "Way to go! 💪🏼", "mollyohal": "❤️", "mollyonfiddle": "look at yoooouuu!! as an anxiety ridden female who also self soothes this made me feel good and inspired and all that. high five, lady.", "jessicaofelia": "Thank you as always for being so raw. This is really is inspiring.", "joannawarren0": "Great job!!!! Thanks for sharing, i feel it too, the struggle is real", "vkceciliavk": "🖤🖤🖤", "_thegiftofgabb": "This caption is everything and I had this moment a couple of weeks ago, that i posted.. You’re awesome. I love that the fog lifted for you also!", "visualheart": "You're so awesome!", "heather_la_wright": "Is this an optical illusion or are you taller? When I was doing yoga on the regular I actually gained an inch so I know it’s possible. But also depression can make you/me slump, so it might be that too.", "mrsviicious": "You look amazing babe! Yas!", "amkurk": "YOURE THE GREATEST", "marta_dansie": "Love you for showing the beautifully hard parts of life. I can relate and love your genuine courage to show up in your life and on social media in a realistic light. Thank you!!!", "rebecca_ellie_studio": "Total babe 🔥", "octoberandrum": "I just want to like and love this over and over! You did that!!", "anaisabeltextiles": "Way to go! Thank you for sharing your journey 💕", "londonmarriah": "❤️", "writeupyourali_sews": "❤️💪🏻❤️", "honeymyheart": "You rule ❤️", "goldilocks3": "😍😍😘😘😘", "carmysanfrancisco": "Amazing! You are an inspiration to many - I hope you realize that ❤️", "bluecottagefrenchiemama": "Total and complete inspiration", "_dumpster_ghost_": "Yesssss. Keep being the magical pony that you are!", "ienvyseas": "So happy for you, drawing lots of inspiration from you!", "cappuccinocartel": "So happy to read this story. Thank you for sharing, we all have these moments at some point in life, and together we can get through them. 💕", "rebekahhhs": "Heck yeahhhhh girlfriend!!!! 🔥😍👌🏼😭 you are so incredibly beautiful, fiery, creative, strong and just plan ol killin it. I am a fellow bi fash...like 3 plus years of postpartum breakdown health wise and can relate to soooo much of what you say. I, too, have started to feel soooo much better lately too. 🙏🏼🙏🏼😩 Love you with all my heart ❤️ even tho ya don’t know me. I do. You are fire and you are lifting our worlds up!!! Effff yeahhh, world, JG is back. Cheers to a healthier you and to an even more exuberant life 😭❤️❤️🔥🌈🙏🏼. Please stay unstoppable for eva 😭🙏🏼🔥", "aemailloux": "the best fuck it! its important to celebrate and brag about whats good :)", "terrybear52": "@lkdub637 read this caption!!! She’s so damn inspiring and hilarious and brave and strong!!! You should follow😌💖", "shelleycsummer": "You look amazing! I was in the exact same place last November.... I started weight watchers in January and am down 30 lbs. got a long way to go but feel so much lighter emotionally and physically!! Well done!", "mrs.qui": "Yer the best.", "daisychaussee": "so so impressive!!!", "smithsquares": "YAS!", "kellyann1020": "👏❤️❤️❤️❤️❤️❤️❤️👑 love this And thanks for telling your story so honestly..takes a lot of courage!! 😘", "nerdalert1983": "You’re a mega babe inside and out. I randomly followed you because of Busy and now you’re one of my most favorite 🌈💪💖👼🍻⚡️🎸", "witchbaby1211": "You are seriously sooo cute. Well done!", "oh_pazzer": "💗💗💗", "romantblock": "Omg yes!!!! You’re awesome!!!!", "mrgustavdunn": "My love of 7 years just split this morning. Im scared for this journey.", "brookepowellart": "Really. REALLY. needed this. All of it. The humor, the inspiration, the honesty. Thank you so much. You have no idea.", "pegawhoreus": "You are so strong! Thank you for sharing your story. I too have often used alcohol to see with having to feel the hard feelings and truths of my life. But I think half the battle is admitting that that’s what it is. It’s a poor and shitty coping skill but we can change. We really can! You are living proof", "jessamynharris": "Hooray! So, how’d you do it?! I’ve been fighting to get out of a stuck place for years, too. 💗✨", "charlottesofiarose": "♥️♥️♥️", "bridgits_nest": "This is so awesome! 👏🏼", "embracethemess": "I love how raw you are and let all of us see the good and bad. Thank you for that #embracethemess #keepinspiring", "batfox": "@melly_mclaughlin 💪❤️", "402meg": "Yes babe.", "juliagoodwindesign": "You look great!", "claudialakemakeup": "You look great!! Keep it up and do it for you and for you only!! Great job lady 🔥💕", "hilte": "Grateful for brave women like you who share the brave !", "anniegirl_": "YAS QUEEN 👑", "nina.t.lee": "You’re amazing and you look amazing 🙌🏻🙌🏻🙌🏻", "gommy_yeye": "I think you are blind. Look at the mirrow... You are young, strong, beautiful, funny and sexy. Stay strong and get in contact with your self. Don't care about anything or anyone. Guapa!!!!!!", "phdinwebmd": "Dang you look AMAZING!", "arthousebh": "👌🏻👌🏻👌🏻👌🏻", "melishea": "Inspiration!!!!!!", "jule1978": "♥️", "collfreese": "Dayum, shawty! YES!!", "ivyandstone__": "You give me hope that there are good feelings in the future. You look freaking AMAZING! And I’m so happy that your brain feels better! ❤️❤️❤️", "sussu.mc": "Way to go lady!!! 💪❤", "katieanncasanova": "Major inspo!", "bonlove": "Thank you for the inspiration! ❤️⭐️", "pattymelt": "Yes yes yes", "alainalapham": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "so_cal_belle": "Yes! 😘❤️", "mkpalma": "Yas lady!", "pycaza": "Regia 💙", "eryn__smith": "fuck. yes.", "krystenjorgensen": "Wow! Amazing 🙌🏼🙌🏼🙌🏼🙌🏼 very happy for you", "heathertrine": "So hot mama! Rockin’ it allllll", "thisthatblog": "oh HELL ya!!", "themetalromantic": "You look amazing and such a touching and inspirational post for all of the strong women in the world!", "sophmackenz": "Congratulations! And super-inspiring 👏💝👍 Thanks for sharing.", "scjolley": "👏🏽👏🏽", "veronicachris": "Rock that 💥", "antologiamx": "You look amazing! Congratulations on all your hard work and honesty, you deserve to feel great", "drdicterow": "@julie_cridecoeur", "tracyporter_poeticwanderlust": "Beautiful words sweets! So happy to read this! Congrats xxx", "barbarajoyce3": "👏👏👏", "katrinaporterdesigns": "You GO GIRL!!!", "nw_is_best": "You are the Michael Scott of 2018. I love you Jen, you’re a total boss babe.", "marierao": "🙌🏼🙌🏼", "katydebard": "Even your ankles are skinnier!", "raley.washburn": "You are so much taller.", "xoxorosaliejane": "Your vulnerability, honesty, and courage inspires me so much!!!", "teenamarie2013": "Wow!!well done! You look amazing!", "cclombardi22": "😍my inspiration. I know the struggle!", "canativejewelry": "This is exactly what I needed. Congratulations, you deserve to brag 💕", "daria1012": "YASSSS!!!! 🙌🏼🙌🏼🙌🏼🖤🖤🖤", "lynseycreative": "So proud of you, @jengotch! 🙌🏻😘🎉💕", "louthyswan": "Your honesty is inspirational! And also with this fog lifted I think you got taller too. Haha. You rock!", "tania_simp28": "Queen👏👏", "heatheroverholtart": "❤️❤️❤️😍😍🙌🙌🙌🙌🙌 you're so amazing!", "vanessasw": "You look taller! Wtg!", "ferne_burns": "Amazing. Look at your posture x", "chicacali": "Awesome Jen!!! Brag away you are a hot piece of ass and so much more!! Thanks for inspiring us, always!! 🙌🏽🏆🙌🏽", "daydreamarcadekids": "I hope I can tackle all that baggage, too", "devonwinslow": "you look amazing. absolute inspiration. ♥️♥️", "milliprete": "@jengotch WOW is all i can say!! 😍", "karolinakristina": "Yes yes yes well DONE! So happy you’re feeling better", "pinkplaidprincess": "❤️ sending love and light to you 😘", "sailorshella": "I can relate to so much of this post. Psychics and healers 👌 Well done!", "kgross": "Yay you!!! 🎉🎉🎉❤️❤️❤️", "karissanickish": "My inspiration forever!!!", "luv_brandi": "Standing up taller...the weight has been lifted! Awesome.", "dooleynotedstyle": "You look amazing", "nnelsonc": "❤️❤️❤️❤️❤️", "kristenharbin": "Love every part of this❤️", "berranberry": "😍 you are amazing!!😘", "desert.blondie": "Gorgeous.", "katekikij": "Love it, Jen! You’re my hero. I’m working on that plan of action too. I’m seeing results. All the snaps for you girl! It’s bloody hard work. You are amazeballs. Love ya. 😘", "jillbethhannes": "Thank you for being so honest! Love this 💕", "amyharrigan": "What an incredible post- thank you!", "erinaustenabbott": "You look amazing!! What form of exercise did you find worked for you? I’m so glad you are doing better! For you. Not some dipshit that didn’t see that.", "lindaderaad": "You go girl!!!!!👍🏻😁", "thelordjones\nVerified": "Verified", "kathrynymagill": "YOU GO GIRL!", "christenebarberich\nVerified": "Verified", "mallorywimm": "You look SO gooooood!!! Yay 👏🏼👏🏼🎉💘", "jody_boggiani": "So needed to read This!!", "alishalipman": "I love how much taller you are standing now - owning and embracing the awesome woman that you have always been - just now in a stronger, healthier, clearer, more confident version! You were an ass-kicker then and you are one now. #fucktheghoster #bifashqueen", "dianasdayoff": "🙌🙌👏🏻👏🏻", "raquel_val": "Go girl! 💪🏻", "juneandjanuary": "👏🏻👏🏻👏🏻 you are an inspiration!", "barbiekamiel": "Beautiful inside and out @jengotch", "picturesofnouns": "🔥🔥🔥Ghost slayer! 🔥🔥🔥", "cheerupoldbean": "👏👏👏", "emcapades": "So inspirational!!", "folkfortune": "Looking hawt now!! But not bad before either 🌶👌🏼", "kate_kavanaugh": "I’ve really connected with your journey, have been there myself, and also impressed that you somehow got taller in all of this.", "katie_stuarttt": "you go glen coco 🙌🏻", "erynr11": "Can I just hit the like button over and over?! Amazing as always!!", "laurakwl": "Glad you feel better. FWIW before and after photos seem very #fitspo Instagram. So ... take that as you will. 🤷‍♀️", "deidre_interiors": "@sarahthered", "abigaileballanger": "You look amazing!!!!! Your honesty with your journey is so inspiring and encouraging!!! ❤️💛❤️💛", "erinphraner": "You look AMAZING!!!", "morganhamilton86": "Thank you for sharing! 💕", "brogan271990": "@hannahhj1989", "kidsofdada": "💖💖👍", "huneboottoot": "So Fab! 💗😘👍🏽", "kimmylaa": "Yes 🙌🏼🔥🔥", "thebeautyproject.is": "Love this!!! Good for you!! 🎉🎉🎉", "michaelacalotta": "Fuck yeah ❤️", "apostle_boutique": "Such a great transformation!! Way to stick to it- the reward is so obvious!! 👍👏👏", "misseleganza": "Total inspiration! Thank you!!!", "alythiawisse": "Fuck yeah! Way to go Jen 🌹", "amandaforsgren": "Amazing 🙌🏼 so inspirational", "ohbiofficial": "You seriously give us all the strength! 🙌🏼🙌🏽", "breesurb": "🔥🔥", "killer.lava": "👏👏💪💪💅💅👑👑", "kaylanicolejordan": "♥️♥️♥️", "raisingadults": "🙌🏻🙌🏻🙌🏻🙌🏻", "bridgettdixon": "You look beautiful in both photos!", "jacquelynepierson": "🔥🔥🔥🔥🔥", "29twelvepr": "You look fantastic! So glad you are feeling better all around🙌🏻", "alliecarman": "@winkler68 read this and follow her!", "haileyrtaylor": "Yes girl!", "procrastina_shan": "✊", "thuglifebishh": "I love your story,you rock, good job lots of hard work to be a strong lady. I never read any ones story's if they write that much but yours was catchy. I hope it does help out other people. 🔥", "lesstrashinlife": "Love this!", "cthrumybabyblues": "Lookin smokin hot cankles and all👌🏻", "sallyannejoyce": "This is inspiring!!! Our Easter Bunny has found some gems this year from @shopbando. So fun!! 💗", "amythemakist": "Woohoo! You look amazing! 🙌", "shop.jennandco": "Way to go! You’re inspiring me.", "bhaskarsonia": "@nikishariley @houseofsmiths ❤️", "lindsalexis": "💓💓💓💓💓💓💓", "jen_hendrix": "Gorgeous, Jen!", "tarajhaaz": "❤️❤️❤️", "sailorparc": "Yes yes yes you queen of a woman 👏🏻👏🏻👏🏻 going through similar struggles in my own life and applause applause", "gemmavanderswaagh": "Amen, this is awesome. Good for you Jen, you're fantastic. 💙", "hol_fox\nVerified": "Verified", "carakleinhaut": "Amazing!", "printtherapy": "Yes! 🙌🙌 I am in the fog but I feel like it’s SOCLOSE to lifting. You give me hope that it will. ❤️ Glad you’re feeling back to you.", "h_a_d_i_a_09": "I mean ur a hot piece of ass in both pics sooo BYe💕💕", "dipthosedots": "Beautiful before & after ❤️", "_scarlatta": "💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖", "_lisa_dawson_\nVerified": "Verified", "brekristos": "Proud of you!!! Truly inspiring ❤️❤️❤️❤️", "heypammyb": "Impressive AF 🙌👑🌟💪", "cmkerlin": "YAS!!!!! You are so much motivation to me!!", "cwfrosting": "Powerful message, thank you for sharing. I was really depressed in grad school & needed a lot of help to get through it. Keep trucking ahead lady! 💪🏻", "spiceyb2": "Thank you! I needed to see this! Well done YOU! Xxx", "pureskoap": "@beachbunny1985 😘", "cloth": "This is awesome. Go you !", "healthwithus_": "Thank you for sharing your story", "rachelantonoff\nVerified": "Verified", "jesmika": "Love this! You look beautiful in both but it's great to feel good in ur own skin ❤️", "jenlemen": "Adore!!!!", "taybow.travels": "🔥🔥🔥", "alinimmo": "amen amen amen", "meganlecy": "the first thing i noticed in these pictures was your posture. you can tell you’re feeling better simply by how you’re standing up straighter and taller. i have been feeling like shit lately but you have been a constant source of inspiration. thank you!", "biggunsll89": "You’re beautiful! Bravo 👏 my dear! Well said very good work 💋🔥❤️", "saraparsons": "Awesome 👏🏼", "adiarezzini": "So proud of you jen", "mrsjennamartin": "HOT DANG 🔥🔥🔥 you’re amazing and you’ve just inspired me to go to the gym despite feeling like 💩. Love ya, Jen!", "upthe_ante": "damn shawty! lookin good", "twonewyork": "❤️", "deluxemodern": "Incredible transformation inside and out. You’re radiant and it’s not just your physical appearance. I hope you’ll share how you did it! 💕", "kylenmccudden": "Idk I know we don’t know each other but I’ve followed you a long time and this just makes my heart happy! Your openness and willingness to talk about all of this is so helpful to those of us on the journey with you 💕💕💕", "mindyfurano": "❤️🙌", "kenzyy": "Love this! You are so inspiring to me!", "brittanyshmyr": "❤️you go girl!!!", "jeanettetarter": "Definitely, what she said. ❤️ All if this.", "sktemple131": "@jengotch you are fabulous. I want to be your friend. My anxiety is so crippling sometimes for unexplainable reasons. I can’t say I fully understand your journey, but you are a friend that makes me say...I know. Me too. Especially with airports. Sending you love from Indiana. ❤️❤️❤️", "melissafromspace": "Very hot. Indeed. You were still beautiful and a hot piece last thanksgiving. Just saying.", "bumpyspuffpuffandpasstour": "I feel exactly as u described before u got to where u are today. Thank u for posting and congrats on an aweome job well done. I pray I can get back to where I was. U give me inspiration with your candor and fuck the douche who ghosted u. He doesnt deserve to even sit in your presence =)", "fleamarketfab": "You are beyond inspiring and funny as hell!!! I just adore you and you deserve nothing but the best!! You got this Jen!!!", "marianmonmac": "😍😍😍", "nolongerwander": "You looks amazing", "freegurl.rhigle": "Congratulations! What an awesome achievement. I have only gound out this week my husband does not want to be with me any longer. No words to describe it so cannot imagine being able to get to the other end if this as you have. Thank you gor sharing", "babasouk": "You got this 💪🏻💪🏻💪🏻💗", "bubblyblond77": "You look amazing! Congrats on the hard work...inside and out. I adore your page and love how real you are. Thank you for sharing your authentic self with us 😊", "tanianp": "🙌🏼🙌🏼🙌🏼🙌🏼", "etlyoga.and.therapy": "Such beautiful work and strength 💓", "zyia.robyn": "Way to go girlfriend! You’re a total babe!!", "paperdollmvp": "This!!!!!!!", "nickigenevieve": "You look fantastic and I’m so glad you’re feeling good! 💕🌈", "pescaitasalvaje": "Keep being you! You are one of my favorites on Insta! From my corner I admire you; your honesty (about mental health), your humor (on all things related), your bi-fashion & your openness with all of us!", "talking_terrace": "Wow! Yes yes yes to all of that.. you are a truly beautiful lady and to a fellow anxiety sufferer 🙋🏻‍♀️ - you’re a goddam hero 👊🏻💋", "xolp": "So inspired by this- and your honesty. I’m feeling a lot of that darkness and heaviness myself lately and it feels so good to see the other side of it.", "waamindustries": "Keep crushing goals @jengotch ❤️💪🏼 you've got an army rooting for you always", "favorsandstuff": "YES! ❤️🙌🏼", "southwesternbelle": "You're awesome and an inspiration.", "miz_the_nerd": "Way to go girl 💪🏻HELL YEAH", "sarajmathew": "YES! This is motivation and inspiration!", "shmontane": "YAS GIRL. THIS IS AMAZING!!!! 💘💘💘💘", "ashbaldwin": "Killed it.", "flipclok": "So inspiring! Keep on being brave girl! Go for it because no one else will do it for you 👏👏👏 Salutes from Buenos Aires !", "ilanagriffo": "Hell yes!", "daisyolsten": "@tinadawina 🙌🏻", "craftivista": "Way to go!!", "nicolejacksonstyles": "Yes he did! Congratulations Jen and thank you so very much for sharing. Life’s a bitch and then you kick it’s ass.", "jordannix": "Love this! I need to do this with myself!", "scapeghost": "You’re amazing", "saavedradesignstudio": "🙌🏼", "sssouli": "You go girllllllllll 💪🏽", "luxurytastemaker": "You speak so much truth in parts where most don’t want to hear or accept. I love that from you and it’s why I’m still with you on this strange social media journey.", "emilymnewberry": "You look four inches taller, like you’re floating up above all the bullshit. Thanks for sharing your strength. It’s contagious. 💝", "hollibeauty_": "Get it girl👯👊💗🌟", "jttschrzr": "YOU ROCK!!!!! 💪🏽🌸 🌈", "emma_rose_designs": "👊👊👊👊👊", "thatlesleygirl": "You are an inspiration. As a fellow divorce goer througher who has had a bumpy road of recovery, i am so happy for you and grateful that you share things like this. It makes me feel less alone and gives me strength.", "kristen_shumway": "My favorite thing about the after picture is how much your confidence comes through.", "fleurwoodsart": "So good!!! Thanks for sharing and keeping it real. Go you! 💖", "imastabile": "You’re incredible for a million reasons", "michellebeller": "👏🏻👏🏻👏🏻 well done!", "alxmae": "❤️❤️❤️", "momforexport": "You go girl🙌❤️!", "kkmoore222": "You are truly an inspiration!!!!", "heydrrachel": "You look beautiful and, more importantly, it’s wonderful you’re feeling well in more than one domain. And, yeah! Bye boy, bye! Ghosting is the worst but without a doubt you’ve dodged a bullet and he’s missed out on a real prize. You deserve better, and better will come!", "myvintagelook": "Go girl! I need to be on a better path myself. Starting a business has really led me to ignore myself in so many aspects. Thanks for posting! You look fab!", "jumeneses": "You are lifted! It’s awesome to read thru your process and relate. Thank you 🙏🏼 😘💕", "anniblle": "Amazing and sexy!", "itsmekatiestone": "💪🏽❤️💪🏽❤️", "angela_f_miller": "Way to go!", "sorelcarradine": "Damn lady looking so good and happy you FEEL good 🤩🤩🤩", "amandabevington": "Good girl!", "kellyshewmakeup": "If I change my name to Nick Kroll and always put on eye patches will you go on a date with me? @jengotch", "drannakarp": "Amazing!", "carlasirrom": "🙌🏽🙌🏽I still haven’t updated my phone so I don’t know what the question marks mean when someone posts whatever emoji it is. But great work!", "simoneludlow": "❤️💪❤️💪❤️💪", "lovealumni": "🙌🙌🙌🙌❤❤❤❤ Yaaaaaaasssss Queen!! 👑🎉💋", "katelynaprile": "💪💪💪💪", "altheajs": "You are incredible and inspiring. Thank you.", "syinteriors": "🙌🏼🙌🏼🙌🏼 cudos girl!!! Great job!", "yahreallyotter": "You are so inspiring. Thank you!", "aceandboogie": "You look amazing and I love your leggings ✨🧡", "nicolecostello_": "you look incredible!!! please post your tips x", "thejojanneke": "Keep the strength, it becomes you. 😍 Narcs, be gone. You chose YOU, and that’s the best thing. You rock.", "lauren_522": "🙌🏼🙌🏼🙌🏼", "estefiramirezd": "🔥👏🏼‼️💥✨👊🏼 you are amazing!", "djsarahlandau": "🔥🍑💃🏼🗽", "courtney.carey": "@caliwomaninvegas I love this ladies stuff think you might too", "pepperberryfarm": "Love it=radiates", "rachaelblumberg": "You are amazing! Try @platefit", "tinyhousemama": "🙌🏻❤️", "lexessential": "👏🏼🌈👏🏼🌈👏🏼🌈👏🏼", "abbersnail": "Way to go.", "from.yourstruly": "LOVE this so much!!!💃🏻💁🏻‍♀️🙌🏻x", "sallinthecity": "Sending you love ❤️❤️❤️", "ms_megan_anne": "Babein’", "rmchristopher": "Your after body is legit bangin’, but more than that, there’s something in your face now that just seems more self-assured. I hope you can enjoy the (real and metaphorical) fruits of your labor. Rock on with your bad self. 💪", "anrebekkas": "This has just given me strength and hope, after being diagnosed with work related stress and exhaustion. Upwards and onwards. Thank you ❤️", "allyostar": "I needed to hear this. Thank you❤❤", "maygirl578": "Love this! You’re an inspiration ❤️", "michelagiso": "Thank you for the inspiration and honesty! ❤️", "caaawn_yay": "Good for u!! 👏🏼👌🏼🤣❤️😍", "k_jill_m": "Needed to see this today...💖💖💖", "a.nichole.k": "You look amazing!!! You inspire me!!! Never stop being you!!! I adore you!", "alyssameg": "rock n’ roll", "naoh36": "Proof of hot!", "raenovate": "🙌🏻🙌🏻🙌🏻", "juliee181": "@beth.evers", "lovemaegan": "🙌🏼🙌🏼🙌🏼✨❤️ divorce is so much harder than i think even imaginable. I think I was going through the same thing at that same time. So much stronger for it though. 💪🏼", "runvalente": "👏🙌💯", "allysonconklin": "💪🏼", "goosebumpsboutiquebedding": "Your the best!!!", "emilywalker_film": "❤️", "barij": "Beautiful at both sizes and glad you feel better.", "joyajewelrygirl": "Thanks Jen for your honesty and being kick ass!! I pull so much inspiration from this post and you!! 💓🙌🏻😘", "leefromamerica\nVerified": "Verified", "bandofbabesboutique": "We’ve all been down there and know how life can get a bit cray! But empowering yourself to be the best you is so inspiring! You go girl! WERK it! 💁🏻‍♀️", "robindmaples23": "You are a true inspiration @jengotch! I could never convey how grateful I am for your honesty & ability to share your story. 🙌🏻❤️😘", "jordo.lindsay": "You have the space and freedom to stand taller!! 🙌🏼 tremendous!", "lucky44_": "Takes massive set of 🍒 to ask for help and then to physically turn yourself around!! Definite inspiration, I’m gonna get my “before” body moving today! 🖤🖤", "shureenuh": "@emilyhopex412 Just wanting to make sure you saw this cuz I just love it and I love her and I love you", "georgietatnell": "Needed to read this today. 🌈", "jennthezwick": "🙌🏻🙌🏻🙌🏻", "wayoutwedding": "You look great in both these, but I love the fierceness and strength in the pic on the right. 💪🏻👊🏻 Inspirational 100% 🙌🏻", "netalevy": "You are an inspiration! Thank you ❤️", "andreajanefuller": "Such an encouragement! Yes girl! Thanks for always, always sharing honestly. ♥️", "tiffsmarie": "I fucking love you!!! Congrats babe", "dbirgel": "🔥🔥🔥", "luciesheridan": "😘", "marissaaross\nVerified": "Verified", "teamsparkle": "Yassssss Girl YAS!💪🏼", "studiokatefloral": "You look fantastic", "jgubbz": "Proud of you! ❤️ Grateful you have a great crew to surround you as well @busyphilipps @mrorlandosoria @kellyoxford", "thartlein": "@alibhartlein I love her caption", "katiaxiong": "Love you @jengotch", "meghanrollins": "💫💫💫", "csalban": "I love this post. You’re hilarious. And an inspiration. I’m in between feedings at the moment, but I feel motivation lurking around the corner, yo.", "elliemaymo": "💪🏼looking great! What an inspiring story!", "southwestvalentine": "You are an inspiration... Thank you for your sincerity! Thank you for the strengh you are giving us 💪🌿", "autumnskyer": "You. Are. Amazing. Congrats on all the hard work, girl! ❤️", "sustainablee": "Yesssss👏👏👏 Cheers to feeling good and looking great😋", "hnlbabyco": "❤️❤️❤️❤️❤️❤️❤️", "lunapiie": "🖤💪", "krystinleigh": "Um who the fuck ghosts Jen Gotch????", "blanketfortadventures": "The length in your neck is so symbolic. Look who is holding their head high. Thank you for being you and an inspiration to all those whose struggle, fight, and thrive despite their brain. ♡", "janinemeaghan": "you are truly amazing. So grateful that you’ve been so open about your journey because all of us watching are rooting for you and feeling way less alone in our own. ✨", "hannahjoel": "👊🏻👊🏻👊🏻 YESS GIRL 🔥🔥🔥", "thatansley": "👌🏼👌🏼👌🏼", "blueshineart": "Good on you for turning it around! You look great!! @jengotch", "brooksidebungalow": "Yasssss🙌 Go Jen!!!!!", "hej.lindsay": "🙌🏻🙌🏻🙌🏻", "a.l.l.is.on": "@smittyluck she's really awesome ^", "dayle.bennett": "@jengotch Haha, yaaaaaas girl! It’s all hotness, good feels and high fives from here! 😘", "pictureitplants": "@kindofintoit you’d love her 😍😍", "nicccb": "Jen, I DMed you. You’re the best. I want to interview you. @jengotch 🙌🏼", "laura__holman": "Your strength DOES give me strength.", "megandcrow": "You’re an inspiration. Thanks for being brave enough to share your journey. 🧡", "hellbentonbliss": "Super inspiring tough work 💪🏽 — inside and out. (And fuck off to the guy who ghosted you! He’s missing out 👻 )", "kristin_ess\nVerified": "Verified", "im_a_lucky_girlie": "Inspirational! Congratulations!!", "aimegraham": "👏👏👏😍", "sophieandlili": "💯", "mouselovespig": "💗💗💗", "laurenxfowler": "💪💖💪", "alliclement": "YES!!!! 💓👏🏼", "atcharlotteshouse": "Well deserved!!!", "sequins_and_lace": "Just what I needed today", "amsdencreative": "YGG!!!", "howaphalling": "You’re gorgeous in both pictures but I’m glad to hear you feel good and more importantly, that you prioritized yourself but dedicating time and energy to yourself ❤️ You’re worth it", "sissyverk": "You look amazing! Glad you’re feeling amazing too.", "onlymeganstarr": "Yes queen! That's what I'm working on.", "jamiegaul": "👸🏼", "wildflowermargie": "💖💖🙌", "amandajoliegall": "You look so much happier! Congratulations boo!!!", "bellsandwhistles": "Way to go, Queen!! 👑💪🏼", "yeahitschill": "🙌🏽💕💕💕", "shopb.ca": "🙌🏻🔥🔥", "jessichaas": "🤙🏻❤️🙌🏻", "annundfuermich": "Wowowow ❤️", "crystallightblu": "@daykarobinson 💫✨", "lindseycarlene": "Beautiful ❤️", "megfitz.gerald": "Brain/body/soul feels better...LOVE that. Good work, you should so be proud of yourself! Thank you for sharing your story 🙌🏼❤️", "vanessapetersxo": "🙌🏻🎉 Amazing!", "happy__ale": "Wouuu 👌", "norahwithanh": "💎✨🎉", "houselarsbuilt": "❤️❤️❤️", "kasiaokay": "You looked good then and still look good!!", "nadia_farronato": "Amazing 🎉 you go girl 💪 💪", "elizmccraw": "Your ankles look amazing!", "occa.inc": "Good on you for breaking the cycle. It’s harder than people realise. Onward and upward I say 😎", "vividhuehome": "Wow. So powerful. Incredible mental, emotional and physical transformation. Love strong women... and that you are!", "everthinebridal": "🙌🙌🙌🙌", "dannyigold": "🌈🌈🌈 = you", "mstewartsloan": "Congrats. I want to be where you are standing now instead of at the bottom of the hill. Thanks for the inspiration.", "casadecross": "A. MAZE. ING. 😍🙌🏼 you freaking GO GIRL!!!", "monicamorris_jav": "Yaaaaaas Mama! Loving this post, loving you for posting it!!! Good for you, and “bye boy” his loss. Oh wow, I don’t know who else this post may have given a ah ha moment, but it sure gave me one, with the hopes of “lifting the fog”, thanks Chica. Keep doing you, it’s looks good on ya. And I’m going to start doing me 😉", "lyndsylee": "Love this! You look phenomenal and I have loved (and will continue) rooting for you and I appreciate your candidness and bad-assness! Can’t wait to see what is still ahead for you!", "jillyrbrown": "✨✨✨✨ you inspire me!", "daradonovandesigns": "Gorgeous woman", "haydencatalina": "Get it girl!!! You’re an incredible inspiration! ✨", "shymcflyyy": "🙌💗", "fequalshq": "♥️♥️♥️", "k_ten0909": "You gorgeous being, you! 🤩", "badchelsea": "You’re killin it Jen!!", "thisladycalledkatie": "@jaceyduprie I LOVE this woman🎉🙌🏼", "hannahlaurelbarnes": "You always inspire me with your honesty and perseverance all while being hilarious. You give me strength and hope for positive change in my life. 💕 plus you look better than ever!", "shelleyandthemarshies": "Oh Jen! This is amazing, from your number 1 UK fan xxx", "albiondisco": "Congratulations!!! This means so much to me. I’m going through some difficult stuff right now and this is honestly super motivating. Thank you for posting this, even if it was hard I just want you to know it means something to me. 💖💖💖", "camillertime": "10/10 👯‍♀️", "robinhiersart": "You look fabulous", "aleegulla": "You go girl!!! You’re amazing", "vevebo": "You are the best 🙌🏻", "joynewell": "Thank you for sharing ❤️❤️❤️", "kellydraws": "🔥💯👏🏻✨❤️🙌🏻", "photosonthecusp": "You're standing taller which says everything. Take up your space. Fill it. Don't shrink in your own life.", "cinzia_simone_": "Great job and you look amazing !!!", "marcybreanne_": "@hilarylenore me. on every single level. thank you for telling me to follow her!", "fatmumslim": "Yeah you did! 🤘", "elenieyebrows": "hell to the yasssssssssss! 💪", "thelizzietea": "good for you Jen!!!! you are worth the fight!!!", "chiaraangelicola": "Boom.", "melissarae": "DAMN! Tell us what you did!", "_beckykimball": "Yaaaaassss! Love this and love you!", "dr__lauren": "I fucking love you. Thanks for this. It’s a big deal.", "brighteyedear": "@auntwiwi", "laurametzlerphoto": "You rock 💪🏻", "katieaselton\nVerified": "Verified", "emerick.nancy": "I was divorced,too.I drank too much,too,sometimes.Thanks for sharing.I needed your share,today.Thank you.Love,light,gratitude to you.", "jeanne_mourey": "❤", "theamyclarke": "You look amazing and 10 years younger! Wow! Those type of trials are tough...but if you make it out on the other side you’ll be stronger and more equipped for the next challenge. Thanks for sharing your journey", "allisonmadi78": "You are fantastic, on the inside and out!!", "smartlyartfully": "It shows! Love how authentic you are!", "emilyelizabey": "werk 👏🏼🔥👏🏼🔥", "byashleyoneill": "YAS GET IIIIIIITTTTTTTT", "snsieckert": "You’re amazing! @nickkroll you are missing out!", "katnicparker": "Thank you for showing me there’s a way", "tenderheartem": "I love everything about you! You go girl 💕", "shoshannajames": "Yes Queen!!!", "stalker__kitty": "❤️❤️❤️❤️❤️❤️❤️", "shopflowerwild": "💪🏼", "opinionatedjacqueline": "You’re amazing!!! ❤️❤️❤️❤️", "theconsciouslifestylist": "Well said. You’re a strong lady! Feeling down in the dumps and comfort eating today. Need to pull it together tomorrow and hope the fog has lifted!! Xx", "hrh_kehaulani": "Looking great... feeling better! #Winning", "maggielynn07": "You’re standing so much taller! ❤️ keep up the great work! You deserve the best! 🙌👏", "shannonmariek1982": "Wow 💥", "mandicooper_": "🙌🏽🙌🏽❤️", "katinka_kleineschwester": "You are such an inspiration! ❤️", "collectivelybritt": "❤️", "ddep77": "I feel you look healthy in the first pic.. Are you implying you are fat because I feel I'm normal weight you u just made me feel obese.", "joan_callemezz0": "💕💕💕", "lucysheridan\nVerified": "Verified", "catherinejkim": "BABE! Always were always will be 💖Brag away 🍑🔥🌈", "jenlboo": "You look amazing! I look forward to your posts and insta-stories as I can relate and you feel like a friend. Congrats on your accomplishment! @jengotch 🥇", "tarajanebrown": "😍👍😘"}