{"thats.sobianca": "❤️", "lilah.s": "@hannahlhoneycutt this the founder", "angie_laughs": "❤❤❤", "sarah_sturgill": "❤️", "mrs.jenn.ruiz": "❤", "bigcatcreative": "one day at a time 💜", "curtpratt": "I hope you are feeling better today and am so grateful you are honest about how you feel and are bringing to light mental health issues, which are the norm. Perfect doesn’t exist. Take care!", "chaskgo": "Sending all the love and support to you. You are beautiful, strong, courageous and a bad ass! I adore your profile 🙂 I sent you some DM’s with words of encouragement. I know with having 196K followers that you may never get to my messages but know that you are loved! 💖", "linarosajewelry": "I love how honest you are with us and with yourself. It can’t be easy, as I’m sure you feel rather vulnerable at times, but we all love and support you no matter what. You’ve helped me with my own bouts of depression and anxiety and I can’t thank you enough for being so open about it all. Love you! 💕", "artpippin": "Thanks for sharing the pure rawness of your feelings. I’ve been there so many times-its like being push to a cliff you wanna jump and then you don’t wanna jump. But you feel lik shit and want it to go away!", "bunzilla99": "@p417a This person is a Chloe recc! She is so validating!! I hope you’re into it!", "victorializbeth": "@rubydesantiago", "cbjnj": "Fuck, you read my mind 😳 My wish for you is that it passes quickly", "m3ggymuffin": "@thatchubbybeardedguy", "kellylyons_": "@basicallyjustemily - you should follow her", "_kodachrome_": "Thank you for making me feel more “normal” or at least ok with my mental health. ❤️", "emmab61": "Follow Jen @annie_dannibale !!", "huiles.de.carla": "Love the purple & orange collab", "corimylesmatovsky": "On my bad days, you are one of the people who I think of. When I am angry and sad and feel like a failue and have this endless loop of criticism and self loathing, I think \"Jen Gotch struggles...and she is amazing, even when she's struggling. You are too.\" Thanks for being a light. ❤", "cassi_gohres": "@wendikroll read this it’s dope", "thebigquiet\nVerified": "Verified", "nicoleferox": "Really an amazing explanation of how this shit feels", "shermanator809": "🙋🏼‍♀️I’m there today. I understand. Thank you for sharing your truth. It helps me more than you know.", "amandaleeherr": "@vanfarmco this is so good", "linz_901": "I love your number system.", "momtomomcards": "I like the idea of a rating system-I think that could help me at times. Praying for peace today for you 💜", "annaconathancoaching": "Woman. I feel you. And not in a creepy way. Like... in the soul.", "dailybynikkid": "✨✨✨❤️❤️❤️🌸🌸🌸", "casacovina": "i used to admire you for your creativity, humor, and general bad-assness. i still do, but admire you - and am grateful to you - more for your honesty in sharing your mental health journey. your post today really resonated with me and will help me try even harder to be kind to myself, the way i would with a friend (frankly, i'd be that way with a complete stranger way before me). you seriously rock my fucking world jen gotch. thank you. wishing you all the love and support you need today and every day. xo", "theyetta": "💖💖💖💖💖💖💖💖💖", "littlefenders": "@emmylucille 🙌🏼", "elandry": "I know these ups and downs all too well @jengotch sending 💕💕👩‍🎤✨", "camzclub": "An icon 🌈", "maisonboutique": "❤️❤️❤️", "leilahkathrynrose": "Missed the stories 😿but would love to contribute if it’s not too late. What are the deets", "ryanpatrickkelley": "❤️", "mermaidsandmeows": "Thank you for sharing your truth, your authentic self, and your highs & lows. Your words & emotions really resonated with me, & I know how difficult it is to be so open and raw, especially on social media of all places. ❤️❤️❤️❤️", "paisleystorm": "I am so impressed with your candor and self awareness, how do you run a company? I always lose my jobs for attendance issues,now I am trying to build an income that works with this impossible mood/energy/desire/swings that I have very little control over.", "xanthippi_klad": "Thank you for always sharing!! You are amazing ❤️🎉🌸", "rachelllita": "same ✌🏼", "emandthewildthings": "A glorious 7 Jen. I hope you’re back there soon. 😘", "fleurwoodsart": "🙏💗🌸🌼🕊🦄", "elizabeth_ellery": "I love you and your honesty. I hope all of our positive comments on here telling you how great we think you are and also making mental health a talking point (so people are more open about it) makes your number higher as the day goes on. You’re a total badass Jen!!! Xx", "somos.simple": "😘♥", "paulamaillouxdesign": "❤️ thank you for sharing.", "jwilcruz": "Hang in there!! BiG hugs!! I’m the CEO of the National Alliance on Mental Illness- California or NAMI CA. Thank you for sharing your story and being so real about it. We would love to chat with you on how we can partner to continuing the conversation. With May being Mental Health Awareness month, it would be great to take action! Let me know if you want to chat jessica@namica.org.", "lilassbee": "🌞💛💕🌸", "jessicasdiez": "❤️", "nikitazook": "❤️", "thatgirlmay": "Do you find there is a pattern when you are a 7 you go to a 4 or lower right after?", "rachelambershaw": "This sounds like me when my fibromyalgia or cfs/me strike... we will win! 🤪🕺🏻💪", "marneyschaumann": "I am with you. Have you heard of PMDD? Premenstrual Dysphoric Disorder. It’s like PMS on steroids, severe depression, irritability, and tension anywhere from 5-10 before your period and as many into it. I have it. And it just makes it hard to stay at any high level of productivity because you gets wiped out, and by the time you get back on your feet again, it’s nearly time for it to start again! At least knowing about it makes it easier to be kind(er) to myself.", "seannenmurray": "I haven’t listened to all of the podcast yet but thank you from one entrepreneur to another life can really be lit and fucked up at the same time", "foxandfinch": "💖💖💖", "jokesgreaves": "Thank you for always sharing 💕", "kakistruecolors": "FELLOW 4 today JEN- my design business is based on happy and colorful and haven’t been able to even fake it to post on IG - I’ve lost a hundred or so followers as a result - I should care but today I don’t... it always ends eventually but this bout is a particularly long one Nice to have a safe place to share :)", "nicolewear": "Lady you are beautiful, honest, vulnerable and absolutely a boss for sharing your journey. You can’t possibly imagine how many lives you are touching and how many souls are thanking you 💛💛💛", "wesiggy": "hi jen do you have a dog? I’m an emotional support animal for my mom. she was super depressed before she got me (like a stasis 1). she’s still a crazy, but a happy crazy and I give her a literal reason to get up in the morning (otherwise 💩💩💩 roflmao). guaranteed your life isn’t nearly as lameo as mom’s but pets like me (us iggies are the best 🐾🐶) do wonders for mental health! (cats don’t count bc they’re depressing)", "erinaschow": "❤️❤️❤️", "haddenspotts_art_by_hadden": "A refreshing perspective: https://www.youtube.com/watch?v=zSGoJk-D1LQ&sns=em  I’ve listed to this a few times! It’s that good!", "tinyninjasquirrel": "I feel you, girl. I’m in the same mental health boat. Not everyday is a great day, and the not-great days are the hardest and saddest and longest. But they’re not everyday and we need to remember how we feel on the good days. And to self-care. That’s the most important thing and I think we feel guilty about taking care of ourselves. Never feel bad about taking care of you. You’re beautiful and resilient and you got this shit 💪🏼💜", "leanne_ringer": "I’m feeling like a bloody 2 right now...numb and emotionless, thanks for raising awareness, being open and being honest!!!", "yamieyonzalez": "I love how honest you are about mental health. I really see myself described in a way I couldn’t explain before. You’re badass! and myself and countless others are behind you. ✨💖", "cfbcathcart": "I hear you girl. Sending love from the solid 5’s. ❤️🧡💛💚💙💜", "jhillbattilana": "💕", "kimkelkal": "💙💙💙💙💙the fog descends just like that, unannounced, unwanted but here it is with all of its wrath and fury.", "melissagaye__": "Right there is the 4s with you today, Jen. Thank you for putting words to my feelings.", "sarahcappie": "🌈☀️💖🐰", "jeweledspirit": "I see you. I hear you. Hold on. Xo 💜☮️", "stephanielwest": "Ditto, lady. And I even just thought, ”she did more than me!”", "lesarthomas": "You look beautiful!", "li.unger": "Thank you for putting words to the private struggles so many can relate to! It can be difficult, painful, isolating, annoying and terrifying to say the least. Your courage to be honest provides comfort to others!", "sharplittleteeth": "Thank you. 💙🖤❤️", "christinahsays": "FEELING YOU! 🙌🏽♥️", "curiositycurator": "I feel compelled@to tell you I love you even though I just IG met you. Hang in there. More 7.8s are ahead.", "cestmoimegs": "You’ve got this. However you get there, however long it takes. You’ve got it. ❤️💪🏼❤️", "fancyfinn85": "Goddamn. SURVIVE. HOLD ON.", "beyourself6904": "Love your honestly. It is very likely keeping someone else afloat. ❤️❤️", "modshop1": "Same 😏", "chowarddc": "Fuck, I empathize. I'd been going along at a good 7-7.5 for a couple of months when shit changed on Saturday and I was at a 4. It's the fucking worst. Hang in there, sister, and fight the good fight.", "zontziry": "All the empathy. I have referred to it as depression needing to remind me it's still there, for fear it will be left out somehow.", "ihavethisthingwithpink": "Take rest m’lady 💗 I hope tomorrow your back to a 7. Just know your insta-friends are all here holding your beautiful self up.", "ale.x8": "@jengotch this post makes me think you would love the 8 week mindful self compassion group I run. If there's a similar group in your area, I think you'd really enjoy it. Check out the book \"Self Compassion\" by Dr. Kristen Neff. ❤️❤️❤️❤️", "coastalartdesigns": "I've been there about my late 3s and I found a therapist that was like my father who made me see things for all sides bad, good, horrible, paths that I choose that lead me to paths off in the woods, and a family that is well no words can say but then I look at both the amazing life's things I've accomplished and the things that I struggled through but made it and I embraced it as a well rounded person with the best and worst so instead of making it cause you sadness and doubts change your thinking and know that you have seen it did it conquer it and now it's your prime time to glow and be who god always had planned for you", "kemigreen": "Thank you for sharing! It is so great to know that you are not alone and to have someone articulate so well how this can feel.", "ctcamarca": "💖💖💖💌💌💌", "cdjanz": "💖💖💖💖 hugs", "sarahellacole": "Love you solid 10!", "rewildingourwholelife": "💯 OG", "s4sally": "You are a great person! I look forward to your posts everyday.", "desi_stringer": "I feel this on so many levels. You’re such an inspiration to just be a real HUMAN in this fake internet world. ✨💕✨", "eve___white": "Your transparency about your mental health is huge gift to the rest of us @jengotch", "alishawhitneymin": "❤️", "oliviaandocean": "I promise you the DM I sent you this morning before you posted this pic will bring some joy to your heart. Check it and be well love.", "envyofairplanes": "Your posts always make me feel like I’m normal. Thanks for rocking that beautiful, complex heart of yours on your sleeve so we can all feel like we’re not alone! You inspire me. And you are incredibly funny— wish we could hangout 👏🏻💕 Sunnier days ahead, my love ☀️✨", "lee_geach": "Love you. Thank you for sharing your message to heal others xxx", "histellagold": "This will pass. 💗 I feel you.", "ivyandstone__": "You’re amazing 💕🙌🏻", "beyondtheinterview": "@jengotch Jen! We want to write about you and your project! What’s the best way to contact you?", "hlswho": "💕💙", "crazykt81": "💚", "desertbeauty21": "Big hugs ((((((Jen)))))) from someone who struggles with chronic anxiety, and ptsd. 💜", "sarahwilliamsphotographer": "❤️❤️❤️", "howtobefancy": "I hate that you feel this but love that you talk about it. It's helped me identify so many of my emotions rather than just feeling like a massive failure when I can't function. 💕💕", "toomaris": "Hugs, big ones. You didn't do this.", "kristina.abernathy": "❤️", "melb_selena": "You is kind. You is smart. You is beautiful and wonderful ❤️. Thank you for sharing. I really appreciate you sharing. I always felt that I was alone and no one understood these highs and lows. 🙏🏼", "sup_4_fun": "Much Love n'hugs xo", "andlaurlee": "I definitely can relate to this. Thanks for sharing. 💖", "_marijkekingma_": "I hope the wet sand you’re dredging through turns to solid ground soon lovely lady...I understand your pain x", "andrea.fairservice": "Jen I know I write this a lot but I’m going to continue to write it- thank you for sharing. Reading your passages and watching your stories is like if I were to actually eloquently put into words how I feel. Thank you so much.", "ms.krisztina": "♥️♥️♥️♥️ thank you for being open and real", "emilyperrytresser": "Your statement earrings to match your blanket -made me LOL (on stories). I love when you write and share. We are not alone. Thank you Thank you. I really like the idea of these numbers to rate. ❤️", "caitlyn_connor": "Thank you for being so honest and vulnerable. It means a lot to me. I hope your number is higher tomorrow and that you get through the rest of today in one piece.", "bobbyclark____": "You are incredible 🧡", "danogoldie": "@mrs.hotze this is a powerful woman!", "schmancytoys": "Virtual hugs. U might feel like a 4 but we think you are a 100!", "oh_myemily": "Just watched your numbers video. So interesting! I find myself in the 5 range sometimes and it is completely frustrating. I know nothing is wrong and yet I am not happy or content. I just feel restless and incomplete, thank you for sharing your perspective", "the_woodenpalate": "Thank you for putting to words how many of us feel and what we do..the horrible beating we put on ourselves 😢.", "willowtr8": "♥️♥️♥️", "___calo____": "Hang in there! It'll get better! And please know that even though your self criticism is very specific, it's very specific for others in the same situation too and has nothing to do with real actual \"failures\". Like floating anxiety attaches itself to whatever it can grab, self loathing attaches itself to whatever it can too and no matter what your shortcomings or perceived deficiencies are, it's the illness that makes them seem worthy of self-loathing. You are worthy of love and compassion and I hope you will feel better soon! ❤️", "maryaden.art": "@ohmappyday", "teddywantstoast": "I wish there was more I could do than just like this post. If it’s any consolation, there are 200k people on here rallying behind you Xx", "lulu222a": "Meant never know when a shit storm of bad emotions show up. Bipolar is life long. And with proper meds, self care and for me ...alternative medicine and body work.", "yung_marley_cash_marley": "🖤✨", "trippyerinsd": "You. Are. Awesome.", "veegms": "I call it the “Happiness Hangover Day” 😨", "alidesigns": "❤️❤️", "pierretoursamerica": "You look so pretty here. I felt the same yesterday... maybe it was the holiday. Or the lack of nice people.", "pkinzi2": "You’re not alone 💙💙💙", "lzpencils": "Thank you for bringing awareness and sharing your struggles! 🙏🏻💯🎉💪🏼⚡️💕", "puddlepoet": "Related with you and I understand what you feel, my depression is a thing, the fact is what happen in my life doesn’t help me a lot, but see what you share help me a bit.... I need hugs and a shoulder to cry on.", "meganpflugdesigns": "Feel better. You are speaking the truth to power ❤️💋", "cclombardi22": "🙏🏼my hero", "judeetan": "This is true n real", "vintageax": "Thank you for letting me know I am not alone...No one truly understands unless they are going through it. 💜", "wildartifact": "❤️❤️❤️", "bohowild": "Depression is no joke! You are a beautiful being ❤️❤️", "bubblyblond77": "Thank you for being vulnerable and putting yourself out there. I’m also having one of those days. Glad to know I’m not alone.", "katie_rockliff": "We ride with you @jengotch A shitty ride no doubt but know you're not alone. And bravely putting words to the 4s and the 2s helps an unbelievable many. You're inspiring! And I hope your day turns out to be better than you think. 💪😘", "theauburnattic": "Feeling a 4 but looking a 10 ❤️ I truly get depression and anxiety being a sufferer myself.", "nsbeebe": "💙I feel you way too much", "evolving___myself": "❤️❤️❤️ thank you for sharing and I am doing the same sort of project with me! It’s beautiful to read your post and I completely relate 🙏🏼🙏🏼🙏🏼", "megcoakley": "@sarah.lurie", "artistwandering": "@jengotch caught me by surprise today too. 🧠💕", "caelynbuller": "you are loved and supported ❤️", "emilykprovost": "sending calm vibes, deep breaths and a big ass hug. you got this.", "eddiesgirl60": "sending hugs", "tinycaitt": "@lesliecrystalwell you aren’t alone.", "jessica.lafferty": "Nobody can hurt us like ourselves because nobody knows us like we do. Your transparency is a gift.", "clemandco": "I’m having a similar day, and then on top of it my dog ate cat poop (I don’t even know what kind it was?) that was in our yard... Hope your day gets better and thanks for sharing so much! You are not alone and your page and thoughts make me smile a lot! It’s normal to not feel great all the time, but being in touch with your feelings and being able to express them is no small feat. Thank you! 💕", "ckm1021": "Please keep talking about this!! Thank you for being so open and sharing with us. Thank you. I’m not manic but have anxiety and depression. Lately I’m scared because my anxiety is getting heightened and becoming a problem to control. I wish that others knew that saying “things could be worse, or oh wow poor you or my favorite calm down.” It’s not that easy, life is difficult to navigate especially when you are your worst enemy.", "claire_kramer_mackinnon": "You are strong and brave and kick ass.", "thevelvetfantastic": "Jen, sending you LOVE and HUGS. I don't personally deal with depression but I love a couple people who do very deeply. I hang on to so much from your posts, it helps me understand and be a better ally. So thank you.", "c_ai_t": "❤️", "weirallmadhere": "It sucks that you go through this. But I’m glad you share because it helps knowing other people feel this way at times too.", "jillkaym": "😘", "auntiekaren3": "loving you, from miami! 🌸🌸🌸", "alittletex": "Swnding u love and a hug. My mom suffers from bipolar disorder. I have seen her fight this (with assorted drug combinations) for my whole life. Its hard i know. You are doing great work in shining a light on this misunderstood & complicated disorder. Thank u. Just food for thought....my mom was able to stay more stable (probably what you would call 6.5-7.5 range) when she stopped drinking alcohol. The chemical reactions with meds really messed with her stability. Big hug!!", "flowersandgarbage": "Jen... I wish I was as eloquent as you. Even brain fog you. I want to print this and give it to my therapist. This is me. Sending you LOVE, LIGHT and a long ass email cause I’m a Long Hauler, baby! You’ve got mail! 💌", "laura.gwinn": "I feel ya. I don’t know what’s with today but you are not alone. I appreciate that through your feeling this way you STILL are thinking about others! 💓", "wrenarthur": "Wow", "denysemitterhofer": "💜💜💜", "msfleursbliss": "Sending deep compassion and love!!! ❤️💕🌺 you are amazing!", "therustyranger": "I ❤️ you and I want to be part of your project @jengotch", "kate.bharati.thuss": "Sending you love and light. You are not alone. 💕❤️💕❤️💕❤️💕❤️", "hoatsonlouise": "❤️❤️❤️❤️❤️❤️❤️❤️", "aquellafenix": "You have help me sooo much confronting my mental health I really hope me sending you LOVE can help you, you are amazing!!!", "chefbeckyreams": "Feeling for you, babe! Know the numbers well. Super interested in your mental health project! Hang in 💖", "courtneer": "I’m right there with ya. Blows.", "cocktailsandunicorns": "You’re beautiful and worthy and loved no matter what number you’re at 💗xo", "livgfleet": "🌹🌹🌹🌹", "pasphotos": "❤", "meliatheperson": "I also went from a solid 7 to the low 4s over this weekend. We're gonna get through this. Thank you for always sharing your story ❤", "teegnellie": "🙏 ✌️ Have you read the book “The Untethered Soul” by Michael Singer?", "tinawmarie": "I just clicked send on an email to you, where I very honestly outline my own battle with anxiety, eating disorder and depression — topics I’ve only VERY recently started to let myself speak out loud. But I feel empowered after having clicked send and I’m excited to see what you do with everyone’s messages. Thank you, Jen Gotch, for being a driving force of a mental health revolution 💛 I hope you start feeling better soon.", "jes_richardson": "Drinking is a depressant. Just saying.", "oliver_sophie_jrt_crgoddess": "Many hugs from me and my puppies Oliver and Sophie!🐕🐕💕💕💕💕", "saragomez": "@tabirose", "tracytreu": "Thank you ❤️💐🌈", "thehappyloveproject": "It isnt depression. Its human evolution in the process. Purging of ego, don’t fight it or it will be terrible. Preparing us for the switch from ego to heart as the brain. When you fight it, you will not ascend. Read about human ascension. Everyone is going through it. Alcohol makes it worse. @jengotch", "anxiety_piglet": "❤️", "brl_irl": "@jengotch thank you for sharing! 🐥✨", "tongsyabass": "❤️", "moldyguacamolly": "All the love to you! You are strong!", "itsjosceline": "you are so powerful! ♥️🌸", "katrinagraceee": "Thank you for sharing this, Jen. It makes me feel like I’m not alone in this battle when sometimes your worst enemy is yourself. When you can’t run away from yourself and everyday is a fucking uphill battle. There are good days and there are bad days but so far I survived it all. We can make it and we’ll soldier on. Big hugs to you and sending all my love ✨🌻💕", "wanderingfeminist": "Sending you love! Thank you for sharing, it is encouraging to see others feeling the same way sometimes 💕💕", "iamjennsullivan": "❤️❤️❤️", "susan_touw": "Lots of love and support your way from NJ", "bestillchildd": "Keep truckin. Better days ahead.", "naomiroot": "You’re so real. So refreshing. Sending you comfy and cozy vibes", "honeymyheart": "Sending ❤️❤️", "misty_souder": "❤️", "phdinwebmd": "It's the emo 🌒 playing mind games, I tell ya!!!", "april330i": "❤️", "ponywriter": "Isn’t it a bitch when you all of a sudden plummet. I’ve been down in the dumps all winter. Isolating myself. (In a place that looks and feels like winter.) But tomorrow I take to the skies and fake it till I make it on a ten day solo (sans kiddos) trip #LaurelsGoneCrazyGetaway 🙌🏻", "sfgirlbybay\nVerified": "Verified", "studiokatefloral": "I’d love to be a part of the project @jengotch . Lifelong depression and anxiety. And- if you’re still in Palm Springs I’m here and we could have coffee or go beat up pillows or something", "thebeautyproject.is": "You are so beautiful, Jen!! 💜🧡", "keriann14": "Sending you hugs and gentleness. ❤️", "johannelilalarsen": "Hug*hug*hug*hug*hug*also/same*", "g.cook": "@misspigeonvintage I look up to @jengotch so much", "littlehouseink": "You are a true inspiration to me! Xoxo", "tweetjolie": "Sending you love ❤️❤️❤️", "barbiwood": "So raw and real! You are beautiful. I am sending enormous waves of love to sweep you up, cradle you and rock you with peace, comfort and serenity. You are loved! ❤", "subliming.jpg": "Sending u so much love", "yocruzie": "You are Beautiful and strong!", "jenny60d": "❤️", "kiwijess": "Sending lots of love your way from New Zealand, you are a wonderful beautiful lady and very courageous xx", "thegoodshoppe": "Sending love. Everyday is a fucking fight 💜🧡", "karenzgoda": "❤️ ♥️ 💜", "modular_ink": "Love to you.", "teeshrose": "I'm a counselor for a living and show compassion and empathy all day long. It comes so natural. In my personal life, it's the same. I've always been that person for people my whole life, which is one reason I was drawn to a helping profession. Funny though, I struggle so hard with showing myself the same compassion and empathy I show friends, family and complete fucking strangers. It's a mind fuck, really. I'm always aware of it and lately hyper aware, which sucks cos I can't play the denial card. I have to actually do something to change that for myself. Still working on what thy even means or looks like. Work in process, always. ❤️❤️ anyways, your posts have really made me think about this stuff lately and remind me how I need to really take care of myself. Thanks for that. ❤️", "katwalkef501": "Love you Jen. Sending you reiki and good vibes. 💗", "meredithheron": "I don’t know you but I love your posts and am always cheering you on. 💗😘", "katehomyk": "This is just the craziest thing to tell a person I only know through my phone (if @mrorlandosoria is the little man that lives in my phone you are the little woman👫) but .. I just love your honesty and love you! You are such a sweet soul and DO NOT let yourself beat yourself up! A good friend of mine @megoodner said when setting an intention on her yoga mat .. she said her intention is often “to be against violence, even to yourself” and the thoughts you have listed above is violence towards yourself and WE ARE OUR OWN WORST BULLIES.", "thisiskatievw": "😔💙💙💙", "kit_novak": "This made me cry. I am in my 4s maybe even 3s today and feeling like I’m being swallowed whole. It’s tough and I hate it. Thank you for sharing and helping a girl in Baltimore feel like she isn’t a misfit, failure or alone.", "peter10476": "I been fuck since 2003 pills n more pills", "woolsocksandoatmeal": "I’m so glad I found you❤️...keep telling that effing anxiety and self-doubt to take a hike, it works for me eventually but you’ve got to fight fire with fire! 🔥 🔥", "neeladevyani": "@uneasypeasy the caption though", "rita_mari3": "I’m feeling right there with you @jengotch And it’s my birthday. 🤦‍♀️ Thank you for being there to make me feel like I’m not walking this scary, hard, draining, unexplainable road alone. ❤️", "tippysunridge": "You are my biggest inspiration. Just thought you should know. ❤️", "genkog.dkv": "♥️sending kind thoughts about you for you!!! ♥️", "tifmarierob": "But you created BAN.DO!!!! I’m so in awe of you- I’ve been buying ban.do for a few years now but I had no idea the woman behind the creative genius deals with this shit, too. Proof the most creative and successful are often the most tortured. I literally feel your pain. Well said. I hate when I can’t keep it away, too. But it’s true: you have to keep pushing. And my gosh, woman, you are NOT a failure. 💖", "daniellelately": "Wishing you all the positive vibes!", "golindseygo": "You describe it all perfectly, thank you for sharing this part of you, it really helps. We are not alone.", "jessicadaviesmetalworks": "❤️❤️❤️", "meganhollyclouse": "🌷☀️🌿", "uh_man_duh_": "Hey. You don’t know me, but I really appreciate you taking us on your journey, and I fucking love you. Mental health is so GD important and no one is willing to talk about what a bitch it is. You’re a trailblazer, and don’t you forget it! Sometimes you’re up, and sometimes you’re down, but you’re always Jen and that’s something special. 🖤🖤🖤 even though you may not know there are people rooting for you, we’re here, loving you when you’re up and loving you when you’re down. #danceskillz", "sandra.i.francisco": "Thank you for your authenticity.", "mugsbythefire": "🙏🏻🙏🏻. I’m so sorry. We are all trying to make it every day. You are, and giving others help to get through it at the same time💜💜💜. The perspective you grant through sharing your struggle is invaluable🎁🎁🎁", "la_maingon": "Sending you big hugs from France ❤️", "perez_sere": "I understand completely. Thanks for sharing your life with people that you don’t know. :)", "juliefordherbison": "Try positive vibes from a crystal bowl sound bath. It’s a great energy reset.", "teenamarie2013": "You are loved.", "stillmorganpirkle": "Thank you for your honesty - I'm not sure what my personal scale is, but I'm feeling a lot of your 4 feelings today too. I feel like I'm butting heads with the universe. 🍑", "stephanie.rosie": "Very much feeling the same way today.", "tess.made": "I’m right there with you. I can relate to this entire post. Try to stay in the magical land of Gratitude. When I’m there mentally, the negative stuff can’t reach me as easily🌸💞🌸💞🌸", "jennhackworth": "Girl, I dropped today too. I search for reasons every time and blame myself so hard. And I have so much I wanted to do today. I'm feelin ya.", "misscarleyp": "You are everything and I sincerely love you as much as a stranger can non-stalkishly love another stranger. 💛", "thebestdaniellelevy": "I hear you. You are not alone. You are strong. This will pass eventually. You got this. 🧠💜🧡💪🏼", "dmb.317": "hugs @jengotch 😍💗", "tina_tambourina": "As always, thank you for being brave enough to share. It helps more than you know. 💙 sending you love.", "fizzpop.pins": "I feel like you are actually just describing me", "criswoodsews": "Oh girl - I get it! I hope your brain gets it’s shit together again soon 😂😘🙋🏻‍♀️", "jennalicious177": "We need to find a way to make sure other people without mental illness understand this too. We all know how horrible it feels, but it's so hard to describe this to someone who doesn't suffer from anything like this at all. You have worded it perfectly. Love and hugs @jengotch", "krollinz": "♥️♥️♥️♥️", "lottiesgonebyebye": "Why am I following you?", "soyez_toujours_gentil": "Sending you lots of 💖💖💖", "sally_snacks": "You are lovely and not alone, and I am in it with you lady. Thank you for talking so openly ❤️", "s.oco": "♥️", "jamestownn": "@pfduda", "emmasthing": "ugh i’m sorry it’s a shitty day, jen. you’ll pull out of it", "angelatrimbur\nVerified": "Verified", "catebp": "❤️ thank you for always putting words to the struggle", "barij": "Oh no! I’m so sorry and I hope this lifts soon! Makes me want to cry thinking about the pain. Hugs! Hang in there!!!", "shopb.ca": "💗💗", "olivtrees": "@sarahwalko this woman @jengotch inspired my post this morning 🌟🌟🌟", "milsia.makris.art": "So important to share in this way. I think this is the kind of honest topic and discussion social media is actually built for. This too shall pass, Jen ❤️ thanks for your brave leadership.", "laurenmarttilaphotography": "Sending 🧡🧡🧡", "kristin.colucci": "@jengotch YES TO ALL OF THIS. You are SO not alone and I’d be happy to contribute to this project of yours. You bring a lot of light to my day with your Insta presence, hopefully I can return the favor. ❤️", "thejunglefish": "You got this, Jen. We’re outchea rooting for you through the 2s, 4s, 7s, and everything else between and beyond 💗", "swood_1983": "@tmb5757", "briemilam": "❤️", "lady_gerhart": "❤️ thank you. You put the words to the feelings. I have days where I just want my brain to stop, I don’t want to feel the way I’m feeling, I don’t want to feel my body. It’s like my brain is screaming and only I can hear it. You’re so right, if it was a friend we would try to comfort them. Battling is exhausting...thank you for being so honest, open, and talking about this.", "jesserker": "You got this, Jen", "apartment404": "🙌🏼😘", "gonebananas": "I don’t know you, don’t even share the same taste or style...but somehow stumbled across your IG a couple years ago and keep coming back. You are an inspiration and you’ve empowered me to be more open and forthcoming with my own mental health struggles. You are not alone, and you’ve helped me realize I’m not alone either. So much love.", "honeyrosek": "Sending you love", "missmissyg13": "You are beautiful inside and out. And sometimes thats painful but you got this!", "sierra_foxtrott": "💖", "readysetsasha": "You are amazing. Keep pushing❤️", "salsa_tits": "Also outfit goals", "mish_aguirre": "You’re not alone here. Just know that! Xo", "marciatakesphotos": "❤️", "fijay": "The voice in the head is so persuasive and so mean. Sorry you are hearing it today - hope it is kinder tomorrow.", "soloparami": "Have you read Within from Dr. Habib Sadeghi?", "thelucias": "@psart", "christinedoesthings": "Thank you for this 💕", "mr_shellard": "@jengotch happy to help with the project - I’m a 4.7 today.", "myersdanielle": "@lindsay23myers ❤️", "delaneyasweet": "You’re a hero.", "lara___c_": "Same boat here today - not been able to get up, just been beating myself up lying around all day feeling miserable.", "naomi.vankuijk": "♥️❤️♥️❤️♥️", "jannanamar": "How can we help with the project?", "kerrycrawford": "Sending hugs.♥️", "laceybuggers": "❤️ hoping there are rainbows ahead for you 🌈"}