{"kellysamouris": "Thinking of you, and hoping you will get through this rough patch. Hang in there. ❤️ all that you do.", "thecrybabyclub_": "Sending you all of our love and good vibes. If you're feeling alone, even from yourself, we'll be here for you 💖", "dana_fernie": "You are forever inspiring. All the love to you.", "gretchenmariehunt": "Xoxoxo this too shall pass", "sprucetoninn": "💪💪💪💪", "prettycrabby": "❤️", "ohjoy\nVerified": "Verified", "_mariemd": "I can totally relate. One of the things that makes me feel better is wearing the \"i did my best\" sweatshirt. Keep your head up, you're great", "pattifriday": "@thisisit_09", "decor8\nVerified": "Verified", "foundbykaty": "Big love to you, Jen 💕 love following your happy-go-lucky spirit, even when you're down. may the good vibes kick in soon! xo", "everglowhandmade": "All my love 💕💕💕", "tahani_helena": "Where is your friend @designlovefest ?", "samirasemiramis": "@may_visaa", "rebeccaeichten": "Love you @jengotch !!!", "kaleighdsimmons": "in this phase with you lady just keep going ✨", "laurenzaza": "@jengotch Someone really smart once told me \"Be where your feet are\". Whatever makes you feel comfort and whatever grounds you--- go with that. 😊", "kelsietherex": "Kindred. And yes, I think good will rise from the bad. It's the burden of being a badass radiant goddess of truth and dopeness but it pays off. Also, check out @pumpkintheracoon he should help", "brandilbaldwin": "All the love to you", "sofiamuscatello": "@chrissybaby4eva this is what I was gunna show you. buy the letters to add words on thrifted tees", "kaleydignen": "Such a beauty!!", "msskeenn": "@jengotch how do you make this shirts ?", "morgan1st": "@jengotch I am sure you get tons of comments on these posts but as a fellow founder with a struggling relationship and going through depression aka learning it’s okay to say “I am depressed” and with the world as is, it’s still okay to say I am having a rough time - your posts really mean a great deal to me - the losing site of “me” really struck a cord - while I want to send you nothing but happy positive thoughts, it means so much that you share these posts and help me know I am not alone and not a failure at life for feeling down. THANK YOU 🙌💕✨", "napkinkilla": "👊🏽🙏🏾🌹", "domesticjunkie": "💗💗💗😘😘😘", "ali1124": "Me too, girl. You are not alone.", "jessicacrim": "💋🌷⚡️🍫🎈💘🍤", "holyestate": "Living for this/you 💯👌🏼👋🏼❤️🔥", "yenchu_to": "Don't fight it - it comes with the territory of being an intelligent, creative person.", "shelbsgrams": "Your honesty is so freaking inspiring. Your light shines so bright ⭐️", "tasselsandtastemakers": "😍😍", "marielearegales": "Sending good vibes girl 💜💜💜", "elise_joseph": "Sending you ❤️❤️❤️", "imlauramiller": "Love you", "sarahcarolinecrawford": "@jengotch been watching your snapchats and i still love them! hyper and fun or lowkey and honest - you are great. you inspire a lot of women, including myself, regardless of whether you're entertaining every second! you're a boss woman. i want to be you when i grow up! 💖", "_graaainne": "💖💖💖", "uglyducklingdiy": "💗", "asiapietrzyk": "❤️❤️❤️ from Stockholm Girl 😘😘", "shellymiscavige_": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "ericakoesler": "Beautiful!", "thealyssascott": "Pain into production. Don't let your pain go to waste", "packofhounds": "Free hugs are all around you. Just ask.", "darkhorsepr": "@jengotch Genuinely love and appreciate your honesty. As an entrepreneur or business owner of any kind (or human, for that matter) there is a tendency for those on the outside looking in to say, \"oh cool, I want that!\" But not all that glitters is gold. Thank you for this!", "mellllama": "❤️", "karenedutton": "Sending good hopes your way! 💖", "luckygirlkelly": "❤️🌺", "jennymdiaz": "🦄💖🌈🍤", "enigheid": "Take care Jen!", "lauravdlinde": "Take care 💛🙏🏼", "notyourjules_": "So cute^^", "hlb_hannah": "Tomorrow will happen whatever. Sometimes I find this a helpful thought. Just put one foot in front of the other and you'll get there x", "birbilling90": "Hiii nice", "herbivorebotanicals\nVerified": "Verified", "rachel.rosenbloom": "💛 you. sending love and hugs your way.", "louloumh_x": "Sending much love 💕", "charlotfuckingwebster": "YOU GOT THIS 🙌", "amandaddie": "@kkures 😥", "allasaurus": "❤️ rooting for you. I remember how sweet you were when I met you in person at a pop up shop when I was visiting LA. I was nervous, and you were the best. Totally making a young girl feel at ease in your presence! Since then, you've been a constant source of positivity, realness, joy and humor on social media. I'm just wishing whatever dark phase or funk you're going through will pass swiftly and only make you stronger. We all love you!", "ilsevd00": "♡♡♡", "lbestdressed": "❤️❤️sending love and light", "cynthia.castr0": "Thank you for sharing and making me feel less alone in the struggle", "denisecrew": "Um, not sure what's up with my keyboard but what I was trying to say @jengotch is that there's a lot of shooting stars in the sky tonight! Maybe that will help. Looking at the sky helps me 😘", "themani_camper": "Sending hugs!! You got this!!😘", "piperfoulon": "@jengotch take all the time you need. We'll be here. And hopefully the joy comes back too. It will be okay.", "pipsonpatterson": "❤️❤️❤️", "drawsta": "Ride the wave 🌊 I'm here for you", "anna_weylandt": "Hold in there ❤️", "ezgiplatin": "It feels weird to \"like\" this but I just wanted you to feel the support 😔. I'm sure we all did. You'll find yourself. Take it easy. This too shall pass. Hopefully with amazing results, as you foresee 😊👍🏻", "lisettevandegraaf": "Hugs", "annawsake": "i feel ya!", "bgirlv": "❤️", "zoesessums": "you look beautiful -- and blue-tiful 👌🏻👕", "emilyroseink": "We love you Jen! It'll be okay 😞", "interiordiyer": "You're an inspiration to so many people, Jen, for just being you.", "ashhisloveee": "You're an inspiration to me! Such a bad ass lady boss! Sending super happy vibes and sweet prayers your way lady! :)", "troldpee": "❤️", "tlchiarella": "On the bright side your bangs are on point!", "thisiskatievw": "💜🍪😔", "valbro": "i am obsessed with your snapchats and i have been so worried over your sadness!! no pressure though, bc you know we're all going through something bad or about to go through it. you're not alone!! you've got internet strangers' concern!! 😂 seriously though, i wish there was something i could do. and i've been seriously struggling through my own season of depression. sharing your truth is so helpful and makes me feel less alone. love you so much!!! 💕xoxo", "fadedsentiments": "Sending you all the good vibes. ✨ I literally say \"Jen Gotch is my spirit animal\" all the time. Thanks for being a huge inspiration to so many of us. 💕", "sfgirlbybay\nVerified": "Verified", "suzannewithaz": "You're not alone ❤❤❤", "kgrayswan": "You're great. You'll get through this.", "laurencalnin": "❤️❤️❤️", "stefaniasc": "Stay strong, you awesome chick! ✨", "kristenhutchinsdesign": "We love you, Jenni. xo", "mscott218": "Hugs from an internet stranger. You got this, girl. You're gonna be alright. ❤️", "itsthespacebetween": "You got this!! Also if you sold that shirt I would buy it in an instant! You're my hero Jen!! 💗", "evedum": "🖖🏼🦄🖖🏼", "amndalcas": "sending good vibes. ☀️", "schweetie118": "🙏🏻🙏🏻🙏🏻", "stacefacerenee": "I'm sorry. It's hard. I'm just sorry. And I feel you. 😭💔", "laurabear": "You'll come through! We all do one way or another. Thanks for sharing and being open about it", "obligedesigns": "😘💕💕💕💕", "choooch6": "💗", "mallory.overton": "It usually is what happens. ✨ hugs ✨", "denarochelle": "😘😘😘💕💕💕😘😘😘", "hellosandwich": "Sending hugs and frozen rose cocktails, lady 💗😘", "evoult": "❤️❤️❤️❤️", "corley_liz": "Thanks for being so open on social media. Whatever you're going through, you will GET through. Love to you from a stranger!", "robinsoncurt": "🌮🌮🌮🌮🍦🍦🍦🍦 is always the answer", "ellecleverdon": "@bellelouie i love her !", "nomigensh": "💖💖💖💖💖💖💖💖", "calica": "Truth is so powerful. By sharing your struggles, you help many. More power to you ✨", "nicwitty": "You'll make it through even stronger.", "justmegger": "✨🤗💞", "the_robinski": "You are missed, take care of you!!😘", "erios69": "You will get to the positive happy side soon, all good and growth comes from the valleys 💙", "classic.mel": "You bring happiness to so many every day through your company. Dont ever forget that.", "rachelllita": "@camelliak why is she the best?", "torihackett23": "@jengotch you're inspiring me to become a successful business woman. Just know that you're important to a lot of people, and that you're never alone! 💕", "camelliak": "@littlelincoln33 She's the queen ! We love, admire and support you Jen!", "lovekimharmon": "Sending you love. You are my favorite. ❤️", "marlerkay": "sending good juju your way", "schnellbruton": "Jen! It is just a phase, literally just a weird period from your life that you'll be looking back on, like WTF was THAT?!, before you know it. Just buckle up and surrender and know that all you have to do is brave the storm. Make sure you're exercising outside & always try to latch on to the better-feeling GOOD thoughts. Thoughts are a chain reaction and they grow and multiply so just take baby steps towards choosing the good! You are so loved and admired in this space. We got you!😎👊🏼", "aklimton": "❤️❤️❤️", "thekristinferreira": "@madewithlemons ...THIS is why I LOVE JEN! 💕💕💕 (@jengotch ...Jen you're the bomb.com baby and don't forget it! 😘 sending you good vibez!✨ trust your journey)", "lauraedria": "Have always loved your defaced Polaroids! Feel better", "e.cast": "❤️❤️❤️", "life.of.claudia": "Stay strong!! Big hug!", "miriam.vegac": "Thanks for being so honest and sharing 💖 you're a gem", "campeps": "💖💖", "napakettu7": "You my boo, JG.", "turshen\nVerified": "Verified", "tammi_hd": "💓 Sending you islands hugs from Jamaica @jengotch", "marandaz": "xo", "gretchcma": "Sending love your way❤️❤️", "emilyanne922": "I think you are a brave badass chick. 💕 I've never met you but I see so much empowerment in everything you do - you have made it ok to be a fun silly REAL girl.💕💕💕 Sending positive vibes 💕💕💕", "westsidemilkshaker": "It is probably weird for a stranger to tell you that she loves you, but, I like seriously do.", "tay623": "I'm just coming out of one of those phases myself and am sending all the love and healing energy sent my way in your direction.", "sarahmariewagner": "❤️❤️❤️❤️❤️", "julia_orr": "I feel you you got this", "kimrcrooks": "Stay strong girl", "abra.v": "Just a heads up, you're an amazing role model of mine, and I love u", "rachelupshaw": "Stay strong for Roachie 👀", "shtefani": "You make me feel like I'm not crazy when I am off/depressed/anxious-which coincidently is right now. I appreciate your vulnerability tenfold & am hoping you feel a little sparkle today, if nothing else. 💖 thank you for being you!", "laura.gwinn": "I remember those Polaroids. That blog was and still is one of my favorite blogs ever. xo", "brandylswope": "Just keep writing man. I feel you. Everybody is different but I totally feel you. Everything is temporary. And everything is necessary. It's fucked up but it's almost or is a blessing to go through it? Idk. Anyway, keep writing.", "shellyottem": "✨💛💛💛✨", "typhoontessie": "Very cool shirt. And thanks for being real. I bet it helped someone own their feelings today. Love to you. 💚💚", "heyitsme_cg": "yesterday a recruiter called me and we were chatting and I said I'm just so happy in my job right now I have literally no desire for a new one / none of the ones the recruiter were trying to fill were at all appealing. and then I said \"look, if I had to pick one job I'd jump ship right now for, it would have to take Jen Gotch calling me up to do something awesome at Ban.do\" - I don't think he understood but you should know that because I'm inspired by what you do and how cray you allow yourself to be without giving 2 shits. Rock on. ❤️", "tmelitaphotography": "I'm sending a virtual hug! I just responded to a post about my recent feelings and when I moments later read you're words I can say I hear you!!! I am not me and it's horrific. Positive energy is sent your way, and to all needing the love!!!", "lindsey__shea": "The defaced polaroids were the first thing of yours i loved! 💞", "bymarcha": "Sending good vibes your way~ 💖💕💖", "jenhubbellphoto": "Sending virtual hugs and good vibes your way. 💕", "modern.mother": "😘👍🏻💩", "tulajeng": "😘😘😘💕", "kathrynmcadams": "Sending love and prayers that you find peace in this difficult time! Thanks for being you... A wonderful human", "rrrrriojas": "I also think you're really cool. 😻👍🏿", "holldrap": "Your caption made me think of this poem I wrote. I'll share it if it helps with feeling all over the place! Hope it all works for the best!!", "actualizingamy": "\"this too shall pass\"", "missrileymae": "You're the most powerful and incredible woman I've ever known via the Internet. You're my hero. Keep going Jen Gotch! Much much love. 💜", "mrslindsaypatch": "Sending love and support your way!", "christinawinkelmann": "I have one of those Polaroids and it's my fave piece of art. also, I'm here for movie nights and brunches", "itskarathomas": "💕", "lucky44_": "👊🏻💪💛", "colemoser": "You're amazing. So honest + real. Keep movin. - coco 😏", "hauslove": "😘😘", "mlearyd": "💗💗💗", "sprinkledlife": "This too shall pass, beautiful. 🌟🌟🌟", "alex_haines": "Hang in there Jen Gotch! I think you're really cool!", "belindaleegrant": "I'm glad you're not dead. But I'm sad you're sad. Anxiety is a bitch, which sadly, so many of us know from experience. And honestly I think you're doing amazing, cause like, you're out of bed for one. Look after yourself. 💖", "justinedorsey": "💛💛💛", "wolfum": "I can relate completely. Creative, personal projects are always helpful to reconnect with yourself, or just to get some shit out of your system. Your honesty is inspiring, hang in there 💪🏾", "withkellybennett": "💜💜💜💜💜💜💜💜", "vallllerina": "Sending love your way 💖💖💖💖 you inspire me. I do believe we are kindred spirits.", "momojojena": "yes, that's what will happen 😊", "ellisofficial.co": "Hey- you're a real person not just an entertaining character on Instagram. I admire you for your personality and accomplishments but I'm wise enough to know that not everything is ever as it seems from the outside and I've been mildly curious what it would be like to know you \"IRL\". Well, you're a real person and you deserve to be flawed and real and vulnerable and broken with light breaking thru all your cracks illuminating the darkness. Thanks for sharing the downs as well as the ups, lady.", "jamesburial": "XO", "mouthfulofjoy": "you always pick me up!!", "maddibukaty": "You're amazing Jen!", "debechemode": "You inspire me, Jen ♡", "cillacaubs": "😘🦄🦄💛💛", "kayliemarissa": "Sending you lots and lots of love from Portland! I've definitely been there, and it's THE WORST THING EVERRR. It feels so lonely and makes you feel so helpless. Remember that you are not alone (yeah yeah easier said than done, I know) and that we are all rooting for you. You're such a light in so many people's lives, and I hope you can share some of that sparkle with yourself soon. Again, easier said than done. You can do it though! It takes time, patience, and lots of self care. You got this! 💖💖💖", "positivelypresent": "I'm sorry to hear you're going through a tough time. I know good things will come of it, but that doesn't make it easier. 😕 Sending lots of positivity to you! 💗", "jade_melissa": "I understand. I've been there... I'm actually kind of there right now. Rooting for you ❤️", "kaitlinmgreen": "❤️", "bneatobar": "Sending you lots of love!! 😘 hang in there tough lady ❤️", "kawaiisab": "You are still in there Jen! Just in a little funk. Thanks for always being honest and real. So appreciated 🍪🍦🍾💛", "kristikoch": "You've got this 💪⚡️", "paperboats11": "You are incredible and you will get to the other side a happier, zen Jen! It's great to be able to have real talk in here. We're here for you, you are defo not alone. 🎀", "msparrow": "💜💜💜💜💜💜💜💜💜💜💜", "sandrafloratos": "❤️", "thelovedesignedlife": "love you for who you are and totally feel you. 💗✨💕", "pattymelt": "You got this shit girl! We love you💓", "aponiewaz": "You look totally cute ❤️ keep on keeping it real", "shopb.ca": "We love you Jen Gotch! Sending big hugs! 😘💗💗", "creativethursday": "lots of love 💗", "hellokitae": "💙💙💙 the bangs!", "amandaclairart": "Jen, you're a boss! You're honest and that's so beautiful. You will get though this. Be kind to yourself. Sending love 💕💖", "skinnercarls": "Hang in there - tough times will pass 💪🏻✌🏻🌷🌟", "colorpopevents": "💕💕💕", "denise.aloha": "🙏😘😋👑🔝👍👏💃", "lolafenech": "You're great!! Keep it up!!!", "createcultivate\nVerified": "Verified", "fluffandstuff": "You're bangs are in a good phase❤️", "seripiavani": "Hugging hard 💕", "virali": "Hang in there Jen 💜 you'll be your tate-loving self in no time", "slothsana": "You got this!! 💕✨", "clothandtwig": "Tons of love and good vibes Jen. I appreciate you're realness. 💖💕💖", "kiar55": "Good vibes your way! ✨", "amaliqbal": "@jengotch sending you lots of 💛💛💛!", "tracee_mccabe": "💙", "honeywoodvintage": "💗💗💗💗", "ayleyyasuko": "Your defaced Polaroids are an incredibly gracious way to handle something like this & are incredible. I also love when people talk about shitty things on here. Good things are absolutely born from bad things. Or they might be an attempt to overcome a la law of duality. Either way. Even shit shines sometimes. 💩✨", "kategracebauer": "@jengotch sending you so much love!!!!! It's a weird time and it's okay to feel the things you're feeling. Know that lots of people love you! 😘", "amypouliot": "thanks for sharing", "nancysalz": "It's all hormonal. I swear. Not kidding. Just have to ride it out‼️", "emmiekimg": "You are truthful and this is rare in these perfect digital times. Thank you. Know that it's a phase.. You'll come through.", "cbanningaccessories": "@jengotch you are sunshine!", "bashfacekilla": "Rockstar lady. 💃🏼💃🏼💃🏼", "lzpencils": "Awww sending good vibes. 💔 This may sound crazy, but is there anything I can do? 💝", "lexylexy__": "😘✨✨✨✨✨", "_trouble_in_mind_": "💪🏼❤️😘", "jenpomphrey": "Send lots of love your way you wonderful woman xxx", "xoxosezza": "Love your feed Jen, you always make me chuckle and brighten my day with your antics. hope you find some sunshine and your inner spark again soon 👊💗😘", "bern_crawford": "I'm sorry you are feeling this way 😪", "stephiemh": "Thank you for sharing. It makes us who go through similar things not feel so alone. 💖 You've made me smile and laugh on some tough days - thank you!!", "emmalou_instas": "You got this.", "carolineborucki": "feeling this. also, @able_ground so much yes.", "kellyoxford\nVerified": "Verified", "wyatt__p": "Kweeeen", "jennertrulehr": "😘😘😘", "_karawr": "I feel the same way lately. You described it perfectly. You're not alone! You're awesome! ❤️", "isabelhoppe": "\"It's always a bit stuttery when life shifts into the next gear.\" I hope my translation is correct.🙈 Sending you love! ❤ Your posts made me laugh so many times, I hope you feel like yourself again soon.❤🌞", "fr_isabelle.b": "🌬❤️❤️❤️from the other side of the Atlantic !", "allyhendy": "❤️🍫🍔🍟🍷", "thescarfandstripe": "Grace to you", "katemiff": "I like it when people talk about shitty things here. I like it a lot. Life is hard & we need to support one another not pretend everything is wonderful all the time. 💛", "saramoon": "❤️❤️❤️🎈", "dearlynzie": "I found you through those Polaroids. Those were gooood. Sending you positive vibes and champagne wishes - you got this, Gotch.", "misshollylane": "@jengotch sending you love! ❤️❤️❤️", "brookewithan_e": "💖💛💫", "ginghamgirlgreetings": "Take care of yourself. YOU DESERVE IT. ❤️", "haileywist": "❤️❤️❤️❤️❤️❤️hey you're the best though", "luly700": "❤️", "3olivesplease": "💕 hang in there", "vanessa.robinson.kim": "💪🏼💪🏼💪🏼", "anayarac": "I don't know you at all, but you've made me laugh in really bad days and love what you've achieved with ban.do Hope you get to a better phase soon and send you love 😘", "houseofhipstersblog": "That will totally happen. Take rest love 💗", "cristinafoos": "✨💛✨", "balusmom": "My anxiety has gotten so bad this year that I can't even recognize myself. I feel for you, @jengotch it'll get better 💕🙏🏻", "visualheart": "💪 you got this.", "able_ground": "Oy! All I can say is that things tend to break down before they rebuild or before you have an incredible phase of growth. 💛", "lara___c_": "Remember, amongst the highs and lows, that you're not alone in feeling them... despite how overwhelming it can seem. We're all rooting for you (and hopefully for each other too!) #girlgang 💛", "keelyrust": "You can do it, gal. Sending you all the 💕💕💕", "hudsonny": "❤️❤️", "84thand3rd": "❤️🍕", "jenniferanngach": "💗 you", "seesarahgo": "Positive vibes your way ✨", "molly.pearlman": "💗💗do a lil dance because tates choco chip cookies are real", "mambomermaid": "Take care", "bakerie": "same", "whitneyleighmorris\nVerified": "Verified", "desireegrrro": "Sending you lots of love!!", "lanak": "Hope you get back to good soon ❤️", "mali.mish.marlene": "Hugs lady", "realbrookewhite\nVerified": "Verified", "weddingforward": "Love, love, love!! 💕💕💕💕", "lizz_robinson": "💞💞💞", "just___grace": "Thanks for sharing your feelings 💕 sometimes I feel like I can relate. also please make this a @shopbando shirt. I would buy it. Absolutely.", "maisonboutique": "Hugs to you. ❤️", "anndanger": "❤️ I am not liking what you're going through but I am sending you love.", "slipperybutter": "THIS IS HOW I FEEL RIGHT MEEEOOOW."}