{"innerglowcircle": "@sasha_tozzi", "kikisheppard": "This picture of you is so bright and pretty.", "exquisit3_beautii": "❤❤", "jillianmorkan": "Jen you rock. Speaking as someone who suffers from depression - let me just say EVERYTHING you do helps people in the same boat 🚣🏽 . Just think about that. 🙌✨👍🙌", "takeoffthemask7": "Really cute picture and smile ❤️🌹", "kris10philbrickhiggins": "My 16 year struggles with anxiety. It was really holding her back for a few years and I finally got her to understand that it's okay to open up about it and that medication is not a bad thing. I've been trying to buy her one of your anxiety necklaces on ban.do but they're always sold out. Do you sell them anywhere else? I'd love to give her one for finishing up her sophomore year with straight As while pushing herself through sports and two musicals with many a rough moment.", "tigertigerstudio": "burst of pretty sunshine 🌞✨", "ashleyainsworthart": "💛", "niciblueeyes": "Didn’t anyone tell you how long your hair is getting?! 😂🌈😜", "thaislcollins": "You are an inspiration, @jengotch.", "erinnnv.schull": "K you look lovely like Carrie Bradshaw in this yellow. Hi from a new fan (via podcast via friend 😁)", "michellesorro": "❤️ your mission 🙏🏼", "nataliegrace.jpg": "you look amazing", "tommysgirl4ever": "Love your huge smile in this pic @jengotch I just started your podcast, almost caught up, and I feel like I can so relate with that fire you have due to bipolar. A blessing and a curse. That fire and drive that sometimes gets a bit out of control, but on a day where you’ve just emerged from depression, that fire is so welcomed. It pulls you from the depths. Those sparks of creative energy and motivation are sometimes foreign to others. They wonder how someone can smile so big, shine so bright, and brush off some really hard crap, but what they don’t know is you’ve just emerged from the depths victorious, and that smile is pure joy and strength 💪🏻and a feeling of “No one can take this from me. No one. Not my own self doubt, or depression and certainly not someone other than me.” Keep shining, girl. This world needs these words you’re sharing and the joy you’re spreading.", "leopardprinty": "@maliindigo ⭐️", "myportablelife": "@supastarbruce", "agmakes": "Benjamin Buttoning! 💕😘", "rachaelsstickers": "\"The value of stickers\" ....my people. 🙌", "kiscoprintshop": "You look amazing! Still doing bullet proof?!", "surahhhhdean": "I clicked on your Instagram and instantly smiled big smiles. Authentically being you. Go ahead girl! 💙💙💙💙", "luccacouture": "✨💛💛💛", "mashazloby": "Beautiful 😍", "eefouwehand": "I haven’t seem your feed in a while, sooo good to see you are doing much better. 😘", "une_piece": "♥️", "datmeesh": "I want to come visit so badly!", "dsshockley": "Can we talk about your hair for a second? I need hair help. ASAP. I’m going so grey and either need to do it or go lighter. I’m loving yours and any “descriptive words” you have that I could use to try to get your color would be great. Thank you in advance for any hairhelp you might be!", "peter10476": "Nice pic", "sonflowerchic": "Freaking adorable!!", "darkbluespeed": "Dude want to send you sooooooo many replies to your story today (the stripey-shirt-matza-eating one) bc it’s a weird grateful space to know we get to see you with your guard all the way down so many days of the year...I think you’re going steady with like at least 100k of us for that level of intimacy/trust alone. You’re a babe. No need to change. Let me know when you run out of cream cheese babe and I’ll send some more. Xoxo 💋", "cosmicallykatie": "I just love you!!! So pretty 💕", "magsaboutyou": "The value of stickers!!! This makes my heart so happy. 🌞⚡️✨", "sandeehudgins": "Yellow's your color", "e.m.hailey": "Hey there, spunky!!!", "gwendittmar": "Slamming in that smile, authenticity and yellow Jen @jengotch ⭐️", "sugar.pusher": "When will this jumpsuit be available on @shopbando 💛", "johnnahjt": "You look beautiful! That is your color sunny girl! 👍🏽", "kgbeesknees": "@jengotch you look amazing!💛", "theinspirationalmomma": "That’s awesome 👏 😊✋🏻 @jengotch", "b_blove": "Where is the jumpsuit from — anyone", "juliaandrewssales": "You look absolutely beautiful!!! Your eyes are glowing my love!!😘", "tonyateeter": "@bananamayo", "livinwithc": "you are so pretty jen!!! also my spirit animal. thank you!!!", "shop.jennandco": "You look adorable and so happy!!", "dwellingcollective": "Such a babe. We love you. (Also - sent you a DM!)", "crum_b": "Jen you look so good🌟How did you do it? You look so young. I stopped using alcohol, caffeine, white flour & sugar, anything processed or non organic and no tap water and I feel the best I have in my life, plus Cbd oil all the way💚", "beehumes": "@jengotch I think you’re just great x", "austenconnolly": "Cute! Just listened to the second episode of your podcast! It was so honest and just such a glorious mix of unfiltered emotions! Good stuff- thanks so much for sharing your personal story! I was a long hauler! ;) Also, been rocking out to who let the letters out with my 6 year old for days! 😂", "ctphoto88": "❤️💯", "isabelwriter09": "This is the loveliest picture!!!", "jo_mi_co": "told my gal @noshwithtash to give you a hug if she saw you today 🤗", "ollypolly19": "Glowing pic!", "ohyumpinkoko": "Cute as all hell.", "starry.bright1": "Jen Gotch you are pretty. Esp when you smile. Glad to see so many happy posts from you!", "mjakron": "You’re an inspiration! And those locks! Get it girl!", "lottirose": "You shine in every possible way here. You are strong and beautiful ⭐️", "delphinemtraore\nVerified": "Verified", "missarielchiang": "Didn’t get a chance to go but you look stunning there!", "sarahraydesigns": "So proud of you!!!", "bluecomestrue": "You're amazing. And so cute. I really love reading your message and looking at your story it makes me feel better when I feel down. Thank you", "clubloofah": "Some of our team had the honor of chattin with you under weighted blankets. Thanks for being so transparent and real. #Bando forever!", "daramadylen13": "I love you", "brittany.rh": "you are RADIANT", "mitchell_sara": "You are gorgeous!!!", "uxibal": "You’re the best!!! #forrealtho 💛", "empeterson16": "You look real good and I hope you know it! Amazing.", "dohertyac": "Great pic!!!", "hello_monty_": "Yellow is so beautiful on you! 🌼", "teachinyerkidz": "💕❤️💕❤️ you pull of yellow 👌🏻👌🏻 thank you @jengotch for always being real", "memeastman": "You are legit inspirational. 🙌 thank you for being you.", "bethcohenmitchellphotography": "So so proud of your courage, clarity and translucency ⚡️ proud to call you my pi phi & bipolar sister. 💛 #bipolar #translucent #translucency", "bffbeauty": "So cute😍!!", "starlessnight41": "@jengotch hi. I was wondering if you were going to be restocking the anxiety necklaces? I really want to buy one but they are sold out. 😔", "angie_deboer": "@jackiemurphy19 your twin !", "lorimassicot": "You look beautiful in yellow!!", "notesofjoyfulness": "Your hair is getting long!!!", "gommy_yeye": "So a beautiful woman!!!!", "poshnoshaustralia": "That colour is so beautiful on you. Gorgeous pic 😊👍👧", "kim_lapin": "Loved your podcast!!", "elenaemcmurry": "I adore you @jengotch ! Thank you for your transparency!!!!", "blausman": "❤️❤️", "itstaylerbreh": "My role model!", "vnatarelli": "LOVE your new podcast with @girlboss! And this photo 😍 Love your bright and fun style!", "auj_n_oli": "You are looking amazing", "marcyalater": "Gorgeous!", "autumnbrasher": "Thank you for shining your light!", "debed17": "I love this pic of you! ❤️", "life_with_m": "@joeylovesla she looks so pretty and happy 😍", "lydialovesmarcus": "Gorgeous ray of sunshine!!", "dirtydirtyretro": "That eyeshadow shade is divine 😍😍", "elliemaymo": "You are a beautiful person and so strong! You don’t know me personally, but you are an inspiration to me! You look beautiful in yellow and it’s my fav color!! 😊", "shatteredgold": "Whenever I’m feeling down I watch your IG stories and read your posts and then I feel better lol I’m not alone", "coffeeandbeauty": "Beautiful!", "erikasentz": "🔥🔥🔥🔥", "julietmajestic": "You are beautiful inside and out!", "lindseeez": "Cutest romper ever!", "scrubsandsparkles": "You look amazing!", "vbm.studio": "🧡💜🧡", "mrslemmonstudios": "Beautiful photo from a beautiful lady. 😍", "theweddingcakeshoppe": "You look amazing!!!", "leilamccann": "You are beautiful", "merrittloughran": "💛💛💛💛💛💛", "kindness_u": "@jengotch we’re heading down the 5 freeway to L.A. soon and wanna get involved and share our testimonies of truth, vulnerability, anxiety, codependency, suicide, homelessness, family, hope, mercy, and sooooo much more. Any events happening last week in June -through end of July??? My husband and I have just been reunited through the spirit & have a message of hope for others! And yes, we are fun, funny, and full of JOY! Isn’t that correct @ohjoy #kindnessrules #strongertogether #blessed #highlyfavored 🎉⛱☀️🌟🍋🚕🔑💛", "chloebeephoto": "You look delightful!!! Happy for you!", "jamison.k": "YOU LOOK SO SUN-SHINEY", "elisabethleonard_": "Wish I could have been there!", "samanthamgal": "So beautiful!!!!", "curtpratt": "This color and everything looks very good on you. And your hair is rocking! You just look so happy! It is nice to see, you are like sunshine in this yellow.", "mereial": "You look amazing!", "visualvitaliti": "Your smile is so beautiful so glad to see you happy @jengotch 🙌🏻", "babelfair": "@l_kiang", "katie_hoke_harrower": "I HAVE TO KNOW: where is this jumper from? You look amazing. ⭐️", "pelloh": "You look amazing 😉", "melissa.rhiannon": "You’re radiating, lady 👏🏼", "tisnooops": "You are incredible @jengotch !", "brooklyndecker\nVerified": "Verified", "justagirl": "Cute. You look HAPPY. It was a good day!", "kaitlynghawkins": "@jengotch love this! and love the yellow jumpsuit! 💛💫🤟", "ebekay": "gorgeous human inside and out. #beautifulface or #angelface or #gorgeousface or #face for short 😘😜", "melissa_mckenna": "Where is your incredible blue eyeshadow from?? 💙", "kriscorinne": "I think you are awesome. I think you are beautiful. Future boyfriend will be lucky. Thank you for inspiring me to stay strong.", "21ellebee": "Just discovered you @jengotch through the amazing artist @drawbertson. ❤️ I'll be a loyal follower. Mental illness is devastating. Some very precious people in my life suffer from it and it sucks. Thank you for talking about it and opening up about your personal battle. ❤️❤️❤️", "designsofanykind": "You are looking so incredible lovely lady!!! That yellow jumper is so adorable!!!", "trippymonson": "You are radiant!", "stupennebaker": "you look gorgeous!!!! 💙🤩", "sarahl627": "looking gorgeous girl! total knockout 💖💛😘", "lainebrake": "You’re a freakin gem, Jen. Jen gem. Gem Jen. And more beautiful than ever! ✨✨", "jenniferousg": "Beauty 👍", "kalilafaith": "I would have loved to talk to you more, but I was definitely star struck 🤩 hopefully next time! Looking forward to following your journey & continuing to be on mine alongside you 💕", "sparkleplenty_": "You are a vision 💛", "janellethechef": "@jengotch the sheer joy in your face in this photo makes me happy", "the_xan_eroom": "yasss to talking openly about MH ⭐️🕺🏿💜", "marushkagarciamandell": "You look happy and glowing from the inside out. Amazing.", "jenlboo": "I could listen to you all day! You are so real and inspirational and thank god for you and telling it like it is! Helps so many, myself included!! You look gorgeous💜Thankyou 🙏", "patboninit": "❤️", "sona_jasmine": "💛💛", "hauteinmykitchen": "Looking radiant here!!!!", "berensagg": "You’re beautiful and I would have loved to be there ! ♥️", "hello_candice": "Gorgeous!", "trailclothleather": "Gotta say Jen YOU are smiling A LOT lately.... wassup girl!?!? !!! 👏🏻 #myhero", "mildadesigns": "You look so adorable in that yellow romper 💛 and it's the perfect color and mood for the work that you're doing. 🌞 Keep it up!", "21stcenturybotticelli": "So bummed I was not able to make it up there this weekend (I’m in San Diego)! I just wanted to stop by and say “hi,” and tell you that you look absolutely radiant in this picture! Enjoy your hike, while torturing the bro, and have a fabulous Sunday! ☀️🦋💛", "topanga_vintage_market": "🙌🏻", "bold.and.young": "I want to meet you, sit down for coffee/tea. I know it will be one deep and powerful conversation. @jengotch 🖤✨", "_ann_e": "You look so adorable in this outfit 💛✨ Hope to make it up to the Bando mall someday!!", "crazykt81": "💚", "itsmefaithivory": "The best and the cutest girl !", "stoddam": "Please bring this to NYC! We need this and you too!", "trineandtrue": "You are one of my biggest inspirations!", "jessyfofana": "So glad to witness your continued evolution as a mental health advocate. The podcast and collab with iconery are such valuable steps towards creating more awareness and support. Proud we are a small part of the team. Also you look really pretty. Happy Sunday!", "littleanfierce": "How gorgeous!!! Yellow is your color ! Where did you get that jumper suit ❣", "denai_jones": "you are oozing warmth & positivity, so happy for you!", "feral.kirsten": "Weighted blankets and the color yellow 🌕🐤🌼⭐️🍋💛", "redletterday_jane": "Loved the event and you!", "hross32": "@elyse_c", "wendylawrence88": "I feel like yellow is your power color! It suits you so well and makes you shine!!! You look beautiful!! Like a ray of fucking sunshine!! ☀️🔥🙌🏻💖💁🏼‍♀️", "casblazin": "Happy looks so good on you 🌻", "raisingwild": "Girl. You make me happy! And you’re all sorts of 😎 these days.", "amypo": "jen, you are sunshine!", "mbbakes76": "You look so beautiful!", "courtneyshanefaith": "Come to NJ/Philly are please!", "themani_camper": "Changing the world!! Love you💕🔥👏🏻🙌🏻", "jjoyyycce": "you are so beautiful and such a strong lady I admire everything you are and what you have done. love u💗 I aspire to achieve things as great as what you’ve done", "larinna": "Please tell us what brand is your jumpsuit!!", "speen828": "You’re cool. 💛", "theidentitecollective": "Looking like such a total BABE! And always leading so humbly by example 🙌🏽", "idreamofkelly": "we are measuring TODAY! 📏💁‍♀️", "romeroymiel": "So pretty!!", "waamindustries": "So cool! Thanks @jengotch for never hesitating to talk about the hard stuff! ❤️ Also, have you seen @sootmegs pins? We just discovered them yesterday and they are so perfect! Hello, yes, read the pin.. then let's chat!", "toomaris": "💖", "gulushthreads": "#goals honestly 😍", "marenswim": "Pretty girl ❤️", "samichammas": "I love you!", "abigirl85": "@jengotch you are beautiful and so inspiring!!!", "lori_m_roach": "You look radiant ! 🌞🌞🌞", "janamboyles": "You. Are. Beautiful. Inside and out!", "amanda_mclaurin_": "I gotta go to your hair people! It's looking goooood. Also I've listened to BOTH episodes of Jen Gotch is 👌🏽 Sometimes", "harmonicaface": "This outfit is everything. You are gorgeous!", "catbirdnyc\nVerified": "Verified", "olivia_moser": "Love that jumper!!!!", "daisys_mercantile": "It’s not about the fact that you are looking amazing these days it’s about the fact that you are taking big strides in your struggles and helping so many along the way. It’s showing through your smile, your hot bod and the lengthy locks. I’m not going to say congratulations because we all know it’s a journey not a victory❤️", "theendyuccavalley": "🌼💛🌼", "momandjenn": "This outfit is soooo fantastic!!!", "mishalulu": "You look beautiful!", "ramramstevo": "So pretty💕", "myseastory": "Looking gorgeous xx", "soel_fetole": "@hannahkirby !!!!!!", "honeyrosek": "You look incredible", "tortoiseandharevintage": "Geez you’re darling & have such a huge heart! 💗💚", "neverwakemeup": "@jengotch GURL. That yellow jumper is pure 🌞🌞!!", "vintage0809": "Jen! You look radiant. Yellow is my favorite color.", "seetomdraw": "subsequently nice.", "caralynnanne": "So wish I could have come check it out. Also, this yellow jumpsuit is everything 💕", "caribbeanjourney": "That jumpsuit is life 🙌", "christymariepetersen": "Yellow looks so good on you! 💛💛💛", "migdaliarivera17": "😊💛✨", "angelatrimbur\nVerified": "Verified", "amywray": "I so wish I live closer so I could experience this!", "ginarockenwagner": "Nice seeing you yesterday! You looked like this ☀️", "a.l.e.x.i.s.88": "Beauty!", "laserkitten\nVerified": "Verified", "korrielukei": "Oh you are sunshine!", "collagecoffee": "🤗", "hellbentonbliss": "I love that you had honest, vulnerable and authentic conversations about mental health. That makes me love you and your remarkable company more! As someone who recently came out about being bipolar (and using keto to help), I’ve been feeling extremely naked, raw, and overexposed, afraid I’ve ruined chances for future work or will lose the people in my life. But seeing your post just now made me feel courageous, to keep on. The more of us come out and talk about our own mental health struggles, the less stigma and feeling of aloneness will be out in our 🌎 world. 🙏🏿 (Btw, you have me as a customer for life! ❤️👍🏾🙌)", "bliss.mama": "I will never forget meeting you in Atlanta! Truly inspirational. You’re glowing ✨✨✨", "callmebogie": "@jengotch you look better than ever and it’s an obvious reflection of how you’re feeling and the connections you’re making. Thank you for speaking out about mental health and being a bright spot.", "captain_kaytee": "You look so happy and sunny 😍", "hellotracyfisher": "💛💛💛💛💛", "theproperblog": "Why you so cute?!? 😍💛💛💛💛💛", "allisonzahigian": "All the good vibes! ✨ loved our chat 🤗", "artbyashleyrebecca": "YOU LOOK AMAZING @jengotch 💛💛💛", "washwithwater": "💛💛💛", "tiffanyfisher10": "You take care of you! So impressed that you're putting it all out there and letting light shine on there darkness. You're helping so many.", "nooworks": "💛💛💛💛💛", "savannahpickens": "This is like......the cutest picture ever. And you’re doing wonderful things 💕", "kimberlyjmuller": "💛🔥💛", "cdmackeyfree": "Give up the deets on that jumpsuit plz 😍", "melisamyers": "So beautiful!", "heatherhendrickshh": "Your smile makes me smile 🙌🤓", "shopgirl0007": "Yellow looks good on you! ✨💛", "emmadimarco": "UR SO CUTE!! ⭐️", "sarahreillyengel": "Beautiful in yellow 🍋", "jacksfoodla": "Any talk of SEX HAIR?", "essiearie": "You look fricking amazing 👌🏻", "enjoybyjoa": "💛💛💛💝💖💗", "pinkparterre": "You hot", "kaylynweir": "Girl lookin mighty fine in that yellow! ❤️😍", "motheroftaco": "Girl, this makes me SO happy. Such a feeling of freedom being able to speak so openly and honest without that feeling of embarrassment or guilt 👏🏼👏🏼 hope today’s event is just as wonderful!", "vezazulak": "@jengotch FLAWLESS", "christie__alexander": "@luckyclove", "ohjoy\nVerified": "Verified", "philosophannah": "You are so stinking cute, but more importantly, I'm so thankful for all that you do to raise awareness about mental illness. You da best!", "florals.and.sparkles": "Gorgeous 🌈💕", "barrelsnbranches": "Thank you for the window you're providing on your journey. It's helping so many of us 💛💛", "conytagc": "It's great to read what you've accomplished! And you look amazing ✨", "christchurch_mama": "Love yellow 🤩", "decor8\nVerified": "Verified", "alissacouchman": "Beauty Queen! 😍", "rubistudios": "My first love was Mrs grossman", "jordie_pop": "I wish I could meet you someday! I love your podcast so much and I can't wait to hear more. Sending love and light from Baltimore 💛", "sundayforever": "🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼", "cynthiasimonetta": "💛💛💛", "curious_darling": "You look amazing.", "xxxxclairexxxx": "Pretty pretty pretty!", "lian.soy": "You are really a beacon of light in these dark days lately 💛 i mean it. Thank you for what you do!", "leatheranderson": "You look so bright and beautiful !", "kathi_dangler": "Ray of sunshine ☀️♥️", "nathaliajmag": "Sucha cute outfit !!!", "elleebeans": "Love love this 💛 So wish I lived there so I could go to this!💔", "dmbmcguire": "You are so inspiring. Thank you for everything you do.", "chrismoon1969": "⭐️", "galmontgomery": "I can't even begin to express what your light, vulnerability, podcast, Insta posts, style, bad ass example of a woman writing her own life story means to me. The world needed you Jen Gotch! Shine on Shiner! ✨✨✨", "kim.van.vu": "It was great to chat with you a bit about this! It’s hard to talk about but it was inspiring to see you have the courage to open up about it. 🧡", "jlforsyth": "You are adorable! Yellow is your color!!", "stung_by_samantha": "That jumpsuit tho. In LOVE!!!!!!", "wickedspesh": "Looking good girl! 🌻", "mary.kathryn.wells": "This pic looks like feeling a 7.8. Maybe even an 8-point-something?!", "desiree.pais": "Beautiful !!!!", "jonicamelanie": "You look like sunshine. ☀️", "tessa.earhart": "You are the cutest human.", "letteredcottage": "You look so sunny! ☀️", "erinlife": "You’re doing great work.", "sanjasrdanov": "👌💛🌞", "cheryllindberg": "You look amazing!", "pelhampretty": "You look fabulous and hope you’re feeling it too!", "pchil": "Yellow is your color! 💛", "edademir": "💛", "kath_kc": "You look so great in yellow!! ⭐️⭐️⭐️", "shipehappens": "Love you. Love your transparency. Love your advocacy for so many of us. Love the yellow. Love the long hair (sorry @idreamofkelly but she’s got you right now).", "kimberliecahn": "That jumpsuit!"}