{"measurja": "I loved it and already yearning for more episodes! It feels just like listening to a friend chatting. You are awesome, much love from Indonesia! 😘", "rubyassata": "Yeah!! Can’t wait!", "jcorich": "I did feel all those things. Well done.", "bamabelle8504": "👏👏👏👏👏 I was so excited to listen at work today! Can’t wait for the next episode!", "theslyestfox": "Listened today!!! Need more immediately!!!", "sycamore_co": "Can’t wait to listen!", "priscillapropst": "When the jingle is stuck in your head for the rest of the day 🤣🤣 “What do you know about the after show it’s the JG OK after show you don’t know about the after show but this is what I tell you what I thought about the show” 🎤 new favorite podcast. You rock, girlboss 👏🏼", "blazzle": "Can’t wait to listen! Your stories have always entertained me so I can only imagine the same and better for your podcast!", "shugarloveblog": "Just listened and LOL’d throughout! I didn’t think I could love you more!", "robinsoncurt": "@duffbuckets", "alanarussy": "Never knew I needed something so much at this time in my life. Thank you thank you thank you", "riribex": "Enjoying this!", "weevintage": "Love the podcast girl. Love your sense of humor and just all around down to earthness. Making up words over here", "emmklem": "@wagonmouth this lovely lady reminds me of you and the message/stories/feels you shared through hard sulks about it being ok to talk about not being ok.😘💖 PS. Can you make more music pleaseeee?!!", "hellokerryrose": "Listening to the second episode and am laughing along with you like you're here. \"Hor-MONES.\" I love it so much, Jen!", "jencat_kilburn": "Yes!!! More singing!!! Love your podcast #JGOK", "faramour": "keren.. sukses terus ya kak:)", "irisheyes1119": "@nikkiwalkerpr", "caitohara": "@katieshapirola", "finding_golightly": "🙏🏼🙏🏼🙏🏼", "emma_jayne.krkovska": "@maiden_freya", "lydia_rachelle": "I just stumbled across your page and this post and I ALSO HAVE A CAT NAMED GERTIE ❤️", "girlinthepjs": "@kirstc1", "poolhunting": "Your podcast is exactly what i needed I’m my life. Thank you!!!❤️", "brittnyism": "Just listened to the podcast. You’re amazing and I am so looking forward to the future episodes. ✨🙌", "alexagodwin": "Loved it so much.", "remyandmejewelry": "Loved the debut podcast! This 46yo and her teen daughter look forward to the next episode. ❤️❤️❤️", "outoflinepodcast": "so proud of yewwwww", "lindsaymorgen": "I’m so excited about this podcast! I just listened to the first episode and it is seriously SO relatable & funny! GirlBoss radio did it again!💛", "ohhaikiki": "Just listened!! I think I’m a person who listens to podcasts now🎤❤️", "naylasmith": "I loved it so much! Very real, relatable, and I laughed out loud a couple of times. Only thing I'm sad about is that I have to wait for the next episode!", "oliandc": "1000 ❤️’s", "maryzoles": "You are interested in Art, Illustration and the journey of building an Artist Etsy Shop? Visit my YT channel and scroll through my Leaf Art Vlogs 🌿🕊✌🏻", "kelly.m.cutchin": "I’m SO EXCITED!!! 😍💛🧡❤️🤜🏻🤛🏻", "dig.vtg": "👏🏻👏🏻👏🏻", "arts_lee": "Listening right now!!! I am really enjoying it so far!!!!! <3", "__dempsey": "YAAY!", "saramoon": "Loved it, honest, real, witty, can’t wait for more...❤️", "thelordjones\nVerified": "Verified", "alextaylor57": "Whoop can’t wait to hear it 🙏🏻 xxx 🤟🏽", "rubyanchor": "Just listened. Love it 🙌🏻🙌🏻♥️♥️", "sarahbagharib": "just listened to the first episode all the way here in singapore and you NAILED it!!! especially loving the after show the show after the show song 😉 can’t wait for the next ep! 💛💛💛", "bornandraisedvintage": "I love you I love you. You keep inspiring me to not be ashamed of my issues. I am trying to be more outspoken about it though as hard as it is. #ptsdsucks", "itsmyinstabye": "Yayyyy❣️", "jvask": "@maggx", "smithandmara": "❤️❤️", "i_am_jacks_random_thoughts": "Is it just on iTunes? Cuz I'll go buy an iphone!", "dbuerli": "👏👏👏🐥", "jude1922": "“All your references are irrelevant and know one knows what your talking about.” Lol...loved that quote! I stumbled upon you & your podcast dear Jen Gotch and I’m gonna say it’s kismet! Love this idea so much! 💜😍", "sparkleplenty_": "🌈🙌🌈", "becomingrhiannon": "Looking forward to listening!", "themwcollection": "I just subscribed to your podcast! 😀", "icie_lyla": "@jengotch I love you & your podcast more than you can imagine❤️", "betsyaimeec": "Love this so much Jen. Heard you on a podcast years ago and I’ve been following your journey. I love this honesty", "sieswim": "❤️", "sarah_kelk": "The new podcast was the bomb!! 💥 Can’t wait for more!! GO YOU!!!", "ivyandstone__": "Yasss Jen!! Thank you!!! Can’t wait to listen! 🙌🏻", "seeshellzz": "@aublashtag I think you’d probably like this/her", "madsongoods": "Yay! Can't wait to listen to it!", "withkellybennett": "WHOO HOO!!!", "mosey_me": "This will be a must @theluckyfiles !!!", "laura_shall": "Love love love your first episode!!!!!!! Can’t wait to hear what you have in store for us!!!!", "morgandetienne": "It was hilarious I can’t wait for next week!!!", "erin_the_creator": "“Please tell them about the mirror and the swing in the bedroom” needs to go on a @shopbando shirt ASAP", "kate_popso": "LOVED it! So happy for you! Can not wait to keep listening", "sofia.cope": "❤️", "luckypennyblog": "This is so important and so needed. Thanks Jen!", "teamborndreamer": "Seriously been waiting for this day! 🙌🏼", "camillepagetaillon": "@mariepierlahaye est-ce que tu la follow? Ses stories sont sur son anxiété et j’suis fan", "_elisewillson": "🎉🎉🎉 THIS, along with following your great days and shit days is what I/the world needs more of. I’m going to go tattoo ‘success is not linear’ on my arm now. Thank you xx", "courtney44": "You are helping to keep me afloat @jengotch ❤️❤️", "nicolaclare": "@tiffclarkeharrison", "tildenburg": "Just listened 💕", "irelandireland": "It was so great, Jen! Hurray for making this happen!!", "girlshouts": "THANK YOU IM SO EXCITED FOR THIS!!", "peetydraws": "Listened on my drive home wondering why this podcast hasn’t existed sooner. Can’t wait for the next one. LOVED IT!", "jennnbatista": "I love how your voice sounds! so please don’t be self conscious about it. Thank you for creating a podcast. I love your stories and this is just more Jen! 🙃", "rubiesoho_": "🙌🙌🙌🙌🙌🙌🙌🙌🙌", "kierralburton": "This podcast feels like a chat with a friend who genuinely wants to share their life so you can figure out yours. I loved it.", "vegan.nik": "Truly loved it. Thank you for putting yourself out there.", "mrsmirandaalongi": "Oh my god it’s so Good! Thank you for making this thing!", "amyinkc": "I’m ok, too....sometimes", "inkanchor": "So good! Loved the after show...your parents...your honesty....and the drinking game idea! 🌰 Will be listening weekly! xo", "leviagee": "💪🙌", "thehiitkit": "I am so excited for this!!", "jessicahonegger\nVerified": "Verified", "courtneyandthebabes": "Yeah babe 🙌🏼😚❤️", "jmemelch": "listened just now, loved it. can’t wait for next week, and the rest... please post your dad’s insta ;) 🥜", "artcampla": "Loved it. Was totally hoping there was the podcast equivalent of a “hidden track”. Can’t wait for ep.2 ♥️", "geebeauty\nVerified": "Verified", "emtheperson": "Your podcast is fabulous! I adore it so much❤️ @jengotch", "corey1012": "Loved it!!! So awesome! ❤️❤️😍", "mjakron": "I love you.", "angelapavuk": "Juuhuu! Can’t wait to listen! 💓💓💓", "erinlovellverinder": "I just listened driving down the mountain on my commute. LOVED it Jen 🙌🏻, you made me laugh out loud & smile lots. Your parents are awesome 👏🏼 & im so excited to hear more. Big congrats to your courage to run towards what is scary x", "susebbentley": "Congratulations on your new podcast! I will always ❤️ songs for catz", "holliherrera": "“You don’t have to be mentally ill to listen to this.” 😂😂😂 Loved it! 🙌🏼", "constancezimmer\nVerified": "Verified", "miss__merce": "Listening to it now. It is awesome! Way. To. Go. 🙌🏼", "erikasentz": "@shendyh", "coffeeandbeauty": "Woo hoo!!", "amanda_dpizza": "Loved the first episode! Can’t wait to hear more 💖😂", "totally.mental": "@mad.paints 🙌🏻🙌🏻🙌🏻", "onecraftymissblog": "👏🏻 👏🏻 👏🏻 So excites for you!", "darlingxtwo": "@brittyeather yessssss", "katewhalanfowlie": "LOVED IT! Jen Gotch is WONDERFUL, INTERESTING and FUNNY! @jengotch and a great singer! 😍😍😍", "lindseywithanl": "@ggdoogs you must listen to this with me", "alina__cervantes": "@jengotch you are inspiring!", "missjonesbakes": "Yay!! Excited for this!", "sydnimartines": "I loved the podcast! You are so great! I can’t wait for more!", "jenniferanne707": "I’m loving it! 🙌🏼", "_malrose_": "Can’t wait to tune in next week!!! It was such a thoughtful start to my morning with my cup of ☕️💕", "lizhutnick": "Hurray! 🌈🌈🌈", "roman.nose": "Love it!", "shannel_smith": "Yes 🙌 Yes 👍 Yes👏 Yes", "houseintheorchard": "Super excited for this!", "lizperezartist": "@jengotch GO JEN! ✨🎉🎈✨💫Wishing you much success on your new adventure 😘", "christinawinkelmann": "Gonna listen to it tonight at the reservoir!", "seestrong": "@hanndiggity you should be following @jengotch 😍🌈🖤", "kwhitewinter": "Just listened and I can't wait until the next one! Keep them coming Jen!", "anayas": "So great! “Boobettes” and “I felt it”. 😂", "rosemary_for_remembrance": "@rachelwitte @liziscans you guys are listening to this, right??", "jodiohl": "I loved it! I didn't want it to end!!! Yay you! I love your Dad @drjamie14 he's so funny! Great transitions to different segments.", "hilarynewman20": "More Jen Gotch?!? Why yes, please & thank you! It’s fun already knowing the trash dancing and other early JG lore!", "browneyedbec": "SOoooooo excited for this!!! 💟 @imperfectlyperfectpodcast", "hannahjohnsoncoaching": "I’m still on your first episode but I’ve loved it so far! Particularly, I’m interested in the food therapy you mentioned, choosing to not have children, and your swirly career path! I can’t wait to listen to episode 2 and beyond.", "ciarareynoldsdesign": "💖💖💖", "dryad_girl": "Love ! Love any mental health talk. Hi! I’m agoraphobic and emetophobic. Actually the emetophobia triggers the agoraphobia. I become agoraphobic to the point that I don’t leave the house. Which honestly, today’s world makes it easier and easier. Grocery delivery! FaceTime therapy. Plus I work from home for Apple. So bam. Never have to leave. It’s fascinating how I can go years with no anxiety then years with it. These last 2 years have been jerky since my divorce and some bad dating since. You know. Life. Anyway. Yay! Loving the podcast.", "livjaorr": "@a_bealee", "purpose_playbook": "Amazing! So here for this.", "traceywalrus": "I got sad when I heard I had to wait a week for another episode. So good! Love it and love you!", "colletteqwitz": "Loved it, you’re so natural even if you don’t feel that you come across that way. You’ve got a devoted fan in me. 👩🏼‍🎤", "desertmother": "Hell yes I can’t wait to get home tonight and hear ya out!👍🍾", "reer_arawelo": "Cannot wait!!", "onthemarkdesigns": "@hayleemarkham27 @shelbymarkhamm you guys would probably like this! She talks a lot about mental health in a funny and personable way!", "christies": "@bipolarnerdycat", "woolandhammer": "@coracatc this is the person I was talking about, I guess she has a podcast now", "mbbakes76": "Nice job!! I love when you laugh 😂.... makes it so real to me", "mrs.hotze": "Yes! Cannot wait to listen, thank you!!", "laura.gwinn": "LOVED it", "livelikeamber": "@cupcakee_qt we get a new podcast 😍", "naoimhwilkins": "Love it. Love the message. Love the cat name Gertie. 😍", "lillipads": "Can’t wait to listen in my way to work tomorrow 😊❤️", "charityvictoria": "Listened on my way to work! Excited to hear more. 💌", "olivtrees": "I’m in L O V E !!!!!! I’ve always wanted to be a podcast listener. Now i am. Yay!!! 🔊♥️🌕👂🎉🍒 #jengotchisoksometimes", "lira_benebabebrowboss": "Thank you!! @jengotch", "vraiofficial\nVerified": "Verified", "katiequallsfay": "It’s so fun!!!! I can’t wait to listen to the rest. Great job @jengotch 💕💓💕💓💕💓💓💓", "itsacuriouslifebreanna": "Sounds great! 😊 👍", "emmielou.ie": "I listened to it earlier... A wonderful podcast that's so honest and refreshing. Looking forward to the next one already. @jengotch #JGisOK", "james_sarahm": "So much love for what you’re doing! #JGOK was a fantastic, hilarious companion on my commute to work today. 🙌🏻💥💕", "thestyleaesthetic": "You’re amazing Jen ✨✨✨", "sarahreillyengel": "You are such an inspiration. Congrats on this venture, I can’t wait to follow along. Cheers😬😍", "sona_jasmine": "💗💗", "audgehancock": "Amazing! Can’t wait for the next.", "thepetgroupies": "I need to hear the Gertie song!!!! 😻", "lottielou1986": "@ellierowlands91 a new podcast for your earz", "topanga_vintage_market": "Ah, I have to go listen now. Tx for the reminder!", "saraevelordi": "🔥🙌", "transgressivewoman": "@akacia_c This is the awesome, funny, real woman I was telling you about this morning.", "madiilafs": "🙌💚", "ohhaiaustin": "It was so rad Jen ⚡️✨💫🌟 thank you!!!!", "prettycouchpotato": "Jen, it is AMAZING 🤗 Pretty sure this is the podcast that will make me a podcast listener. So pumped for you! 🎈", "adorn.your.life": "Love it!!!! Can't wait for the next one. 💕", "bahvin": "I think you'll like Jen, @chgunnels28", "sandielaw": "It's great! I love hearing from another woman in her 40s with anxiety and ADD... The format is fun... It feels like listening to a good friend. Can't wait till next week.", "kentuckywooman": "Loved it. Can’t wait for more.", "uppereatssider75": "Loved it! Congratulations-can’t wait for next week", "jamiesjoys": "Gertie!! 😻😻😻 Omg I cant wait to listen on my way home from work!", "sarablache": "So excited to listen! I am so with you girl!", "heatherkasprzak": "Listening now!!!!! 👊🏼", "lizziemdesign": "I can’t wait to listen Jen. I’m going to put it on when I’m back designing next week and just soak it up. 👍🏼👍🏼👍🏼👍🏼", "automatism": "@kathryneblouin Jen is amazing", "_kellymallon_": "🏆", "jennarissee": "can’t wait for next eps!!! so good 🍾🍾", "xo_kristimeow": "You made my morning commute so enjoyable and I can’t wait to hear more! 👏🏻", "maddynye": "🆗", "lilli_beck18": "It was incredible! I wanted it to go on forever 😍", "keltynkiresa": "I love love loved it!!! 💕💕💕", "flowersandgarbage": "SUCCESS!!! 👌I’m going to need them to be an hour long. 💛💛💛", "debinwonderland": "👏🏻👏🏻👏🏻👏🏻", "annietaylordesign": "Love you @jengotch, thank you for this.", "gratednutmeg": "loving the pod, Jen!! 💕", "mallorybassham": "Listening RN !!! 😍💕🥂👍🏻", "tarynn.christine": "started my morning off with this!!", "lostinlakes": "Loved it!! Felt like hanging out with a friend ❤️❤️", "hitarynhanson": "Can’t wait to listen!!!", "amcwood85": "Congrats! Loved it.", "itsjustsarahknight": "Listening now!!!❤️ Love it already!", "lizbcroft": "Amazing! Thank you for starting an open dialogue about mental health! It’s so important 💖", "aurora_pomme": "Love you Jen!! You are always an inspiration 💕💕💕 thank you!!! I can’t wait to hear it!!", "wendydendys": "Listening right now :)", "amysgotjokes": "YOU INSPIRE THE FUCK OUTTA ME JEN GOTCH", "sarahraydesigns": "I cannot wait to check it out!!! I’m so proud of you!!!!", "five.letters.three.syllables": "Well done. I very much enjoyed listening. 👏🏻", "bryan_12tct": "Double like 💛💛", "livinlikelarz": "I’m so excited about this.", "caleygoins": "Sooo good!!! So excited for more episodes!!!", "sullivancolleen": "Loved it AND my 7.8 necklace arrived today! GIVE ME ALL THE JEN GOTCH CONTENT", "emilymnewberry": "I’m really into the aftershow song 👀 #sevenpointeight", "spreadthelove": "Yaaaaasssss!!! 🙌🏽🙌🏽🙌🏽", "whit_ny\nVerified": "Verified", "itselaaa": "@channitychanchan new episode on the GirlBoss radio.", "shelby1108": "Yay!!!!! 💕💕💕💕", "theproperblog": "Woot woot! I’m way too excited for this!", "amynicolefloral": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "badcontent.co": "LOVED IT 🌟 keep em coming!", "iamcaitlinrose": "❤️ so good!", "margotgrant": "So much fun. I work for a podcast company and am a podcast nerd...it was a great time getting to hear you in this way. You are like this little ray of sunshine with this blinding smile and infectious laughter. Good for you for taking on a new medium...!", "coachmeaganmcpherson": "🙌🏼🙌🏼🙌🏼", "_heydear": "Oh yes! 💕❤️", "end.cottage": "Best entertainment while getting my cars oil changed ! All the heart eyes for Jen Gotch 💕", "yourmarygodmother": "@graysonwk", "kit_novak": "I’m excited!!!", "chrissykaszanek": "I loved it! I didn’t want it to end.. honestly - I listened after the JG aftershow just hoping for an after after show 🙃 @jengotch", "velvetantlermarfa": "Thank you for your openness about this. At my worst I felt totally alone and scared to death. Anxiety and depression kept me in my house for almost a year. I am so thankful to feel good and to function in my life.", "jesserker": "SO GOOD", "amegeck": "@celineelefson 🙌", "ignaciadoesmakeup": "Omg I love you!!!! Thanks so much for this!!! ♥️♥️♥️# goals", "jessfrank85": "Listening as I type!", "mirbrown75": "It was everything you wanted it to be!!! 🏆❣️", "lisalaudato99": "listened this morning and loved it!! xo", "amyjwalmsley": "🤗🤗🤗", "joiebutter": "jen! it’s so so good. witty and charming and vulnerable. 👏🏼👏🏼👏🏼", "morganausterweil": "So psyched to listen!!! 👂🏼 did @girlboss ever pick a giveaway winner?!", "neonlovestory": "This is awesome! Go you! 👯‍♀️👯‍♀️", "tulajeng": "Listening right now this very second!!! ❤️", "meg_l_grant": "So, so good!", "idratherbeadiscoball": "Yes! Can't wait to listen.❤💛", "erikais.rodriguez": "already listened 🙌🏻", "chessiecosta": "Almost done listening to episode 1 🙏🏼💖", "busyphilipps\nVerified": "Verified", "bobbyhundreds\nVerified": "Verified", "marcybreanne_": "@the.hoppy.mom", "leaderbagco": "🙌🏻💫🎉♥️💓🎈🍾", "_fashionedge_": "❤️❤️", "vedhoff": "@katiequallsfay !!!", "artbymegan": "Yesssssssss love love love love love", "missbipps": "💞💞💞", "elleebeans": "I'm so excited for this! Thank you for being a light on my dark days💕 Thank you for creating this podcast for everyone going through something❤ You truly do make ppl feel less alone ✨ P.s. keep doing you, Jen💕", "emmadime": "Go jen go! I just a super fan girl stories up on my account haha 💕✌🏻", "kayliehatos": "Yayyy! Love it already! 💖", "kerrycrawford": "Love it and you. Love, your biggest fangirl from the flicker days. 💖", "megseverett": "It’s really so good! I listened while I got ready this morning and loved it 💛", "emilyhecht": "@pizza.rat listen to this. It’s so good.", "darlybird": "Not glamorous or linear. Amen to that! Can’t wait to listen.", "awkwardribbon": "Just listened! Awesome. Can’t wait to hear more!", "tyleranneliese": "LOVED the first pod! Who does your catchy theme song, @jengotch?", "joynewell": "Yasss I love it so much already.", "andreitaandreita": "❤️❤️❤️🙌🏻🙌🏻🙌🏻", "skirchoff": "Thank you for this. Really.", "theheydaystore": "Loved it!! I listened to it on my run. I’m ready for the next one! xx Jen", "davekerpen\nVerified": "Verified", "haleyntwist": "Listened to the first episode and I’m in love!! 💕 Can’t wait for more!!", "camjoost": "listening nowwwwwwwwww in lurv", "zanklaren": "Just listened to it and I adore it!! Will be looking forward to the next episode! 💕👍🏻🌈", "elisabethleonard_": "It’s amazing. Thank you !!!! ♥️♥️♥️", "hellomytribe": "🙌🏻🙌🏻🙌🏻🙌🏻", "simple_fortune": "I loved it and CANT WAIT FOR MORE. #jengotchismyhero", "care_snider": "Already downloaded the first episode and can’t wait to listen!", "bhaberl": "It’s so great! I can’t wait for the episodes to come", "streicherhair\nVerified": "Verified", "kellyoxford\nVerified": "Verified", "merithegreatandwonderful": "You make me ok with not being ok and stoping my tendency to hide my not okay-ness. You and @busyphilipps have saved me from myself and the stupid stigma. Love you both!", "samanthalouisedesigns": "Yessss!!! @alyssamopia ✨💕", "kimwilkinson1": "Yes you are! Listened to it, loved it, keep it up!", "elist": "🧡💗🧡", "anndanger": "So proud of you & excited to listen!!", "fempineapple": "Yayayay! Thank you SO MUCH for all you’ve been doing for mental health awareness 💗 can’t wait to listen!", "oliviaiveydavis": "@cole45and2zigzags_ can’t wait", "drjamie14": "Nailed it", "emilyannekennedy": "You were my coffee buddy this morning! Can’t wait for more (JGisOK and coffee, too)!!!", "able_ground": "Yesssssss! Congrats Jen! Thank you for being such a leader on this front 👏🏼🎉", "nicole_fichera": "Listened this morning and loved it!!!! Also I’m a big fan of the aftershow jingle 🎵", "theferalpastrychef": "I thought it was a great first episode. Looking forward to more! Thanks for making this!", "lori_worthington_": "Loved it! Thank you for being a light!", "purveyorbranding": "love it. thank you for all you do! ✨", "gabifanelli": "Just listened and loved it! Thank you Jen!"}