{"tazzzum": "✨", "pacific.evergreen": "Thank you for sharing and bringing awareness! 🌟 I’ve been suffering this for years and I still cannot get a grip on it some days. You’re an inspiration beyond words I’m grateful for your stories, advice, and being real with us. 💓💓💓 I love going through your IG especially on a bad day because it just smacks it right out of me and gets me inspired! 🙏🏼 I hope you get some relief soon", "kristy.fountain": "I've been on a similar journey since I was in middle school. In my twenties, I thought I could pinpoint the trigger, or eliminate them. I thought I knew what made the anxiety better or how to calm the panic attack back to a low hum. Now, approaching 40, I'm throwing my hands up because it's all so unclear now. I'm seeking, and the anxiety is always debilitating and inconvenient, not only for me, but especially for others around me. I believe that the most important thing we can do is *seek understanding. Finding answers is it's own thing and maybe not even necessary. Hugging you.", "brookekwise": "I think most of us can relate to this whether everyone is willing to admit it or not. Thank you for sharing your vulnerability and inspiring so many to do the same.🌈", "dzrra": "@dnllbchr", "omgm": "@kindred.red thought i would share this account with you. she rates her mood on a scale of 1-10 and peppers her curated posts with honest ones about mental health. she also just started a podcast!", "leefromamerica\nVerified": "Verified", "pretkiekjes": "Another day. Another lovely shot! Keep on posting them! 💕", "nicola.behrman": "Come see me @ojaivalleyinn.", "mollyfhogan": "@saltandhearth my girl, who I was telling you abt! 😍", "myoldcountryhouse": "We are here", "bobbibankston": "💛", "halnhill": "@kristin.kimberlain this post just stays with me. So real and so beautiful.", "bravenewsoles": "I'm really grateful you exist.", "minus_the_beginning": "@threeclouds_yoga good follow", "3autumngirls": "You just described me and what I have been dealing with for YEARS. Exhausting. Daily work to control it. I just have never been able to put it into words like you did right here. I feel a weight lifted because I am not alone.", "swalter00": "@melgstyle", "kenzkilb": "@sheilakilb", "paulaburke78": "I completely and utterly relate to this.", "alittlelettuceleaf": "@kisseyvonkloos ☝🏻", "kateadickson": "@loridickson12 @jamielynndickson", "tamradae\nVerified": "Verified", "theconsciousclimber": "look into Imre Vallyon 🙏", "merming": "@bazadeh8", "katarinamohlman": "💜 Thank you for sharing your journey.", "caitlynlace": "@iamalissa_yep ❤️", "lethallyher": "Really there with you @jengotch", "sarahv0233": "@svincent22 this right here.", "sherakbarnyc": "🙏🏻🙏🏻🙏🏻🙏🏻♥️♥️♥️can totally relate. @jengotch", "paige_morse": "The room was the perfect temperature. I wish all psychiatrists knew about that. @juliemovesyou", "modernartifactdecor": "@juliagracemccombs", "elisabethleonard_": "Sending you so much love", "ashlensays": "@jjo1321 😭", "shelovesitall": "@biancastribe", "mrsbeausaunders": "Real", "katalyst4grace": "Are you me???!!! You are not alone, thanks for sharing.", "makeshiftkat": "@jengotch I really needed to read this when I did. Have been going down my own version of this list. Thank you and love to you.", "ladymakers": "Gorgeous lady & big heart. Thanks for sharing your story - I know the feelings here. Hard & only harder when the rest of the world doesn’t get it. We get it. 💗", "melmc001": "My anxiety and depression are a constant lately...it’s either one or the other most days, it seems. It’s exhausting, isolating and debilitating. I somehow find the strength to power through each day. Thanks for sharing your life. It helps.", "lizekstrom": "I’m having a rough week, too. It’s hard to identify a trigger when there are so many. It’s summer so I’m out of my routine, I haven’t been sleeping well, the world is going to shit, hormones, etc. I need a reset button.", "morganbaileymoon": "The most relatable post I’ve ever read in my life jen", "thenannyleague": "Thank you so much for sharing. For being so refreshingly raw & generous with your feelings. I appreciate you. Much love ❤️", "ellarosemorris": "Thank you for sharing. I needed this too xxxx", "marinaageorgiaa": "♥️♥️♥️♥️", "ginny_dom": "💝", "carolynhimes": "Your honesty and words are what we need in this world. Thank you, you inspire me!!! And I’m sure so many more than me. 🙌🏻💗🦋", "mandystahl": "Thank you so much for sharing. My life and emotions are starting to make much more sense", "hellofounder.co": "I can totally relate to this story ....There are days when you wake up and the energy is so high and days when it just isn't . Today was also one of those days for me . Before I would fight it but I show up and do what I can do . I also had to learn that my 100% will be different for each day . There are days when my 100% is me slashing everything on my to-do list and there are days when my 100% is me just doing 1 or 2 things and that is fine. The best thing to do is rest , take breaks and replenish your energy", "shawryemm": "Thank you for putting into words how it feels....and making me feel I’m not alone. Xx", "bonkbonk": "I’m not the only one??? Are you reading my mind?", "kyraeliz": "@jengotch i woke up with the exact same feelings today and you made it better—just to know I’m not alone! ❤️", "lifestyleclothiers": "Ditto", "cassidycelea": "You’re an inspiration to so many ❤", "alexistingey": "❤️", "lauramec": "Thank you so much for this post. I was recently diagnosed with hashimotos thyroid disease which affects every aspect of my body physically and mentally. I have extreme anxiety and depression most days. I am learning to help find the triggers with an already pretty healthy lifestyle. I share your pain and frustration with not being able to have a “normal” life.", "jgansch": "I completely understand. I’ve been going theough the same thing myself. People can’t understand how physically painful it can be if they experienced a chronic depression or bi-polar. It hurts! I’d rather give birth to triplets after a 4-day labor while suffering the migraine to end all migraines and three abscessed molars than have to deal a debilitating depressive period (whether it be days, weeks, or months). I just give in to the day I’m having. Good days mean i can cope with bills and cleaning and groceries and garbage; bad days mean letting it flow over me And going with it. You’re doing a good thing to be open and out with it. I’m sure you’ve helped many people.", "clarindalauren": "You took my breath away. I couldn’t have said it better myself. Mental tailspins that trap you in fear. I’m so glad I found you. I’m just starting out in my business and I’m scared with my history, always my present, of mental un-health that I will hit a trigger and get worse again. But I’m taking the risk because I believe it is possible, and I love the work, and I want to live my life, to soar. Thanks for your vulnerability, for telling us we’re not alone. Excited wait to hear more from you. 💚", "bridgetgrayson_": "My girl 🌸", "annamariegalvin": "Right there with you! And it’s always worse when you can’t pinpoint a cause!", "madsongoods": "Thank you for sharing! You are inspiring!💕", "belle237": "@emcleavy aah so true!", "little_buffy_freak": "❤❤❤", "michelleeblack": "I do hope you that by the time you have read this the storm has passed, that you unplugged completely and emptied your mind so that the only thing you can hear is your breath. That you have ReCovered yourself, giving yourself permission to simple BE you. You are enough as you are in this moment.", "crstallings": "I so relate.. to all of this. Had one of those weeks last month with the anxiety that couldn’t be kicked. And all of the questions to which solution would help. Thanks for sharing, it does help to hear other people’s experiences ❤️", "lzpencils": "❤️", "afancifultwist": "Jen, I had the worst anxiety of my life when I started taking biotin a few years ago but I didn't know that was it(did you say you were taking it?). I even ended up at the ER, I had the bottle in my purse by pure luck & showed the Dr. He did some research and said the dosage I was taking in hair & nail pills was a thousand times the recommended daily dosage & to stop immediately. Then I did tons of medical research & found biotin only works in biotin deficient people, and doesn't even really work. I have nice hair so why i was even taking it i don't know? It just didn't agree with me. I thought I was going to die. It was awful. My mom took them & was fine. Guess different bodies handle things differently. If you want your hair to grow fast a sublingual b-12 under your tongue once a week will turn you into rapunzel asap. But biotin almost killed me from anxiety.", "codisilsby": "@andysilsby an awesome description of how I’m feeling before I get out of the fog", "artbymonicacohen": "Your words connect with me. Everything you wrote I have and am experiencing at any and every moment. Sending luv x", "cassidygard\nVerified": "Verified", "cestmoimegs": "Jen Gotch you are amazing. A constant reminder that it gets better. Sending you love and strength and peace.", "sjv214": "Reading thru the comments and just in awe how real conversation brings people together and makes them feel alive in the loneliness. Thank you, Jen for typing this out today. You brought light to lives. Hang in there, you bright light! (Cc: @addysuz)", "p_m_g_r_e_e_n": "💕🙏🏻", "hunttyyyy": "I relate to this on another level thank you for putting it into words 💚💚", "ciarareynoldsdesign": "💕💕💕", "codenamebeyonce": "@amysep", "interiorsgirl": "You’re amazing & so inspiring @jengotch", "shelfaye": "Great picture accompanied with a perfect write up. Hope you get some quiet time for yourself💖💖💖💖", "cindylpearlstein": "@berkpearlstein", "epandya": "@tinytattooedbabe u should follow this awesome gal and DL her podcast!!!!", "i_am_jacks_random_thoughts": "I feel this on every level thankfully at this moment I do know my cause but it still doesn’t make the struggle easier sending love to a fellow warrior", "lelandlane": "4.8. everything is wonderful and still the panic anxiety. It was so helpful to read your words and have you qualify what I was thinking and feeling out \"loud\"! Peace and love to you!", "michw7": "You are amazingly beautiful inside and out! I just adore you. You got this....", "acinnamongirl_": "Thank you for putting words to how I feel and what my reality looks like. So good to know we are not alone ❤️", "aalexandrademartini": "I woke up this way too! Maybe it’s in the air?", "raquelpanigatto": "I was in a similar random anxiety attack spurt a few weeks ago. My mind similarly was spiraling for what could be “causing” these sudden, intense waves and then I remembered some great advice “[anxiety] is a monster that will lie to you to stay alive”... as cheesy as it sounds as soon as I told the monster to STFU, my anxiety has been on the decline. I’ve been having solid 7 to 8.5 days since. I’m sure it’ll dip again in the future, but it was a nice way to flip the bird to the struggle.", "itsthecwolf": "I relate to this so so much. Thank you for talking about this - it’s really hard to express these feelings but talking about them helps other people. ♥️", "thelouielifestyle": "So not linear", "icecreamjosie": "love you", "cathlieu": "So fucking well said. Getting back into my car today, too. Thank you always for your words.", "etuttlehansen": "I am so grateful for your honesty. It feels so comforting and connecting. Thank you ❤️", "vedayoga_": "Thank you for so accurately and honestly describing this human experience of feeling and being. ♥️", "kelhayashi": "Thank you for sharing this 💞. Sending you positive vibes", "alexandracowqueen": "I hear you. Xo", "ashley_stickler": "Definitely relatable", "alexisteasdale": "THANK YOU for sharing, for shining, for keeping on 💪 You are doing so much for so many, I hope and trust you’re receiving it back too 💖💖💖", "fortheloveofkim": "Thank you for sharing and taking the words right out of my mouth. Thank you for making me feel like I’m not alone for feeling this way! 🙌🏽", "debbiemurphy206": "I love that you are addressing this do openly, and love you & miss you lady. 😘", "katestrongnz": "Jen. You are so inspiring. 💕", "alytideandcountry": "I’m not sure why I want to tell you to surf every morning, but I do.", "tahani_helena": "Get out in nature and away from wifi!", "mewzikgirl": "You still look totally baller. And you’re baller for posting this. 😍", "tallisharoz": "Thanks for this", "erynbrasovan": "Thank you.", "blackphoebeceramics": "all of this. ❤️", "kariannejoness": "@shoelace518 I love this woman and I don’t even actually know her. Her post made me think of some recent conversations we’ve had. She GETS it. I love her honesty and thought you might like the account too. ❤️", "tracysicard": "❤️☀️🌟", "allie.nu": "💛💛💛", "jmamaorama": "Chills ❤️", "jade.e.m": "It could be blue cheese! No kidding!", "jessdotcee": "Thank you SO much for being so open about your struggles, you have helped me feel less like the freak I always thought I was because I couldn't go through life as normal as everyone else.", "fischnboots": "Thanks for putting words to this. I am on this road trip with you.", "helloimkaitlin": "Yes! 🙌🏻 So inspiring as always.", "juliehgoldman": "Sending you love and calm. Also, it occurs to me that the last time you had a raucous weekend, the next few days that followed brought on a similar case of depression. I always wonder if my own depression is brought on by a return to ‘my real life’ after celebration / overindulgence. I don’t know if it’s the being overserved or the emotional low of not having something super fun to look forward too.", "kriskroswillmakeyajump": "Reading this is everything... all those questions are exactly the list of things I go through too but maybe add a few more... love to you for sharing your journey x", "skratch_works": "Some people think you look so cool ! 👍🏻", "kate_e1010": "@emmaonies @susan_heimann @khakien", "artyparty77": "@baybnug", "jenstyles": "❤️💋", "samsperring": "@redandruby this is my hero Jen Gotch I was telling you about 💕👊🏻💕", "mollymarina": "You look so great though. That’s incredible! Hope your day improved :)", "heyitscorah": "I woke up depressed today as well. Sounds like we’ve had a similar 2 weeks. I want to burrow in a hole at the moment and never come back out. Thank you for sharing your truth & being vulnerable. It’s helpful for those of us who feel like our shit isn’t together to be able to see those who’s shit seems together struggle as well.", "recycle_sister": "I hear you. Thank you. My family look at me like I am lazy or crazy. I do t like the crazy word. But yes you. Ailed it o spent a day driving backwards in circles, simply not knowing what I was doing or what to do next. Decisions were impossible, even easy ones. Like the old saying 'I don t know if I need a shot or a haircut ' I don't know what I need at the shop and I don't know what to wear to the shops. I don't know if I can even go to the shops. Can I go in my pyjamas? There are people there.", "farchie": "Fuck sakes anxiety sucks! I feel you sister! Thank you for posting this and for always being so real and candid 😊 🙏🏻", "applebagios": "Oh @jengotch! Seems very unfair to be at Norma’s/in Palm Springs and feeling so shitty. Sending ❤️.", "pattymessner": "you are a WARRIOR... thank you for your openness. xo", "sarahwilliamsphotographer": "❤️❤️❤️", "chaunceyzalkin": "I had a week similar to what you describe here very low attention span anxiety through the roof sleepless missing my ex who recently boomeranged back into my life but with not great news and fearful of upcoming major traumatic surgery. I since made peace with the on and off again and had my surgery today. I’m writing this from my hospital bed and now I feel better and lively and feel like connecting with everyone. I wish I lived in LA with good friends and good places to go so goes to show there’s no ‘if only then’ . I’m sorry for your pain. It’s so much work to try to fix which is exhausting. I hope you meditate and hug a lot. I hope you take medication and slow down your expectations. Thanks for telling us the truth. It’s the only reality we have.", "li.unger": "I’ve never heard someone so public speak so openly in a way that is so relatable. It normalizes mental health for others and that’s such a gift!", "jmjjewelry": "Thank you Jen for being vulnerable and brave in equal measure.", "raquelmideau": "{{{{hugs}}}} Feel better, and thanks for always sharing from your own experience.", "akats11": "Thank you💕", "sayhellobirdie": "Thank you for being you ❤", "kemigreen": "Thank you for sharing this ❤️", "citrineflora": "OMG. YES. When I have a mood swing, I race in a million different directions to find its cause. My mind grinds and grinds and grinds for answers I'll never find. Thank you for sharing. It's good to know that I'm not the only one going through this. And I'm also sorry that you are too. 💕", "tarawhitney": "♥️♥️♥️", "lilcashley": "Same.", "meglette": "❤️", "sweet.honor.alchemy": "Angel, you are loved 💕", "itsme_imcathy": "🖤😘", "blackdoglove_136": "Thank you for sharing your personal struggle. I just came out of a nasty 3 week bout of anxiety, and I have no idea what triggered it. It’s hellish.", "nladner": "You are so inspiring.", "mandy_d_pandy": "I'm a lurker who loves all that you do and share. Just wanted to say I have been battling the worst random and relentless physical anxiety the last few weeks too, and I have not been able to pin point it with the usual self-checks and go to helpers. I'm so. Tired. But onward, one way or another. Thank you from the bottom of my heart for everything you are. You are helping a lot of folks (like me)", "collmefearless": "Thank you for your honesty❤️", "kyleeninelives": "@mooshulove", "freezebot": "This is perfect. Hope tomorrow is better. Xo", "conicamoniglio": "I feel like the text in this post needs to be shared everywhere👏👏 #wordsmith", "whitcuhh": "💛💛", "dsignedbya": "This journey is difficult to say the least.....one of the few things that keeps me putting one foot in front of the other each day is knowing I am not alone. Reading about your journey is like being able to take a deep breath whilst my heart is breaking for you. Sending lots of love and light JG.", "styleboxla": "Thank you for sharing, my anxiety usually hits me at night when I’m trying to go to sleep. It can be exhausting and paralyzing. Very inconvenient! ❤️", "wildinidaho": "Reading your posts helps me more than you know Jen. Thank you for your honesty about mental illness. ❤️", "younghouselove\nVerified": "Verified", "stephielashes": "Relatable 💯 🙏🏼", "letsmakeitsparkle": "So relatable. Keep shining! The road is bumpy but it’s worth it ❤️", "lizangelo": "What a beautiful analogy. 💚", "rebeccaineurope": "Thank you as always for sharing", "tashasookochoff": "@clarissaearl #truth", "janice45": "Was an amazing description!!!!", "mrskilgore13": "I just wanted to say thank you for being you and sharing all you do. Because of you I know there is hope and a way for my daughter. My daughter is 14 and was diagnosed with OCD when she was 10. I found you on Instagram and thank god. You’ve proved it’s going to be okay. Thru help,therapy and meds and unconditional love from us I know my daughter will be fine. You are proof and thriving. Your a blessing to me thank you.", "rstuz": "“At one of my favorite places with some of my favorite people completely unable to breathe.” This sentence sums it up so well Jen. Thank you ❤️", "edroste\nVerified": "Verified", "misfitpinky": "I have never read anything so relatable 😭 When I try and figure out what causes my depression I go over a laundry list of possible things it could be, not knowing what was the actual cause. Thank you @jengotch for being so open and honest about your illness. Take it day by day. I hope tomorrow is better for us all.", "ldthrower": "Huge hug! In a world of boring, emotionally closed off people, be a Jen Gotch. You’ve got this.", "barefootinla": "I 100% relate to this. This was me yesterday. Thank you for sharing! 🙌🏼", "heatherpocket": "I'm in the same boat, so maybe it IS the moon 🤷‍♀️💪💗", "jennybobenny17": "Dear Anxious Jen, I feel you. I really do. Your friend, Another Anxious Jen.", "canadianmissus": "❤️❤️", "21ellebee": "I'm holding your hand \"in spirit\" on your journey. So hard to hear, especially when I have family members that are often overwhelmed with similar struggles. Take care dear girl. Thank you for sharing your journey. It is such a terrible disease. ❤️", "amyrosestudios": "Me the past weeks. Thank you for sharing your journey and giving us all strength. ❤️", "ng_fit4all": "You’re the best, Jen. Here’s to a 7.8 tomorrow...or soon. No pressure.", "followerofthemoon": "My sister sent me your link. And for that I am eternally grateful to you both. I need more people that understand the mental health game and that also face it head on. Thank you @breanneestafford !!!!", "smith6876": "I've been under the same influences having been diagnosed with adhd at 40😱..just saying I love this post and I do believe you've stolen my thoughts right out of my head.. Crazy. LMAO😂", "meganpysell": "@jengotch just started your podcast today. Girl, you are not alone. Right off the bat I had a checklist of similarities between us. I was diagnosed with anxiety a few years ago and sometimes life just fucking SUCKS. Try being a Cancer and water sign on top of things... anyway. Cheers to feeling better, sparkle princess. We got this. ✨", "brookologie": "You are brilliant, important, a hilarious, positive force in this world, and so dearly loved and enjoyed. 💞", "katepullendraws": "One of the biggest things I struggle with is not knowing why my anxiety has decided to hit at that particular moment. Despite all my strategies, all the time I’ve spent working through shit, I still feel like anxiety has the upper hand, because it seems to strike when it wants, manifesting in ways I don’t expect. I hope the fear has relaxed for you today Jen ❤️", "alexzmakesart": "Anxiety is hard 😔 but I’m thankful you share your journey because it helps mine ❤️", "americangarage": "#likeaboss", "hapaholiday": "I actually take an all natural 3 part supplement system that truly has changed my life!! Our brains are starving for nutrients that aren’t in our diets. I don’t know if it would help you...but what if it DID!! DM me!!", "missmini770": "THANK YOU for posting this! I needed this so much. I had my first legitimate anxiety attack last week and was feeling depressed and anxious for days leading up to it...but was/am still unable to pinpoint the cause of all of it. It's frustrating as hell. It's even worse when everyone around you keeps asking you \"why?! Why are you so anxious? What's wrong?!\" and you literally have no answer for them. It's important to realize that sometimes there is no answer...we just have to ride the storm out, take care of ourselves, and remember that we'll come out in the sunshine soon enough. 💖", "shellybergman": "I love that you're able to recognize what's going on now. 💛", "elishahallplus3": "Thank U ❤️", "mrslarcombe": "I don’t know you but I feel your words 🐅", "lweatherbee": "I love you and I am so grateful for you sharing your story. But sometimes I’m like, we’re not crazy! The world is crazy. How could you not feel anxious and depressed. It’s so frustrating. Like it’s your job to sell this brand of cheeky, authenticity and empowerment. And you lean in to the authenticity so hard! But what is @shopbando about? Where do the products come from? Who makes them? Are you selling cheeky empowerment on the backs of cheap labor that is not very empowered? I’m not trying to be mean or make you feel bad. That’s the stupid capitalistic boat we’re all stuck in. You’re either depressed or oblivious. How do we fix things?", "veroniquen891": "Queen 👑👑👑", "themissems": "I'm sorry, i get anxiety attacks all the time and it's just the worst. Wishing you peace and hope you're feeling better now.", "clairemick3": "You are brave for sharing. Keep talking about it, to people you trust, and who love you. Oh yah, quit the beers, it doesn't help, it's a bummer, but true. 😕 @jengotch", "jennywecker": "@amyrill literally how I’ve felt the past few days", "thatgirlbrig": "❤️❤️❤️", "surferen_jente": "Thanks for sharing. It felt as if you were telling my life story. 😙 @jengotch", "whistlindell": "When it all kicks in for me (depression, anxiety, and CPTSD) as it has for the past month, everything gets very loud. My tinnitus and all my thoughts, spinning like an out-of-control merry-go-round. The #racistpredatorinchief plays a huge part in my distress...he triggers my CPTSD 👽", "nor617": "@ohmissallen love the way she articulates the struggle", "linkofhearts": "💛💛💛", "mauifish": "Exactly!!!! Mahalo for sharing. It’s so important. And inconvenient 🤪🌸", "susebbentley": "Hugs ❤️", "melodyrosee": "@thegemwithin", "crewelghoul": "❤️", "camillas_design": "🖤Thanks for sharing this🖤", "katekikij": "Jen, you speak my mind at times. I’m so sorry you’re feeling so shite. The road is bloody exhausting. But your attitude is inctedible. Sending you all my love and hopes for a 7.8 real soon. You really are, my hero @lulujo79 😚😚😚 x", "jessiealyn": "@jengotch this post made more sense to me and mirrored my life more than anything I have read from others dealing with anxiety and depression. You are changing the conversation and making me and so many others feel like we are not alone in this anymore. Thank you and keep fighting the good fight because as I have to remind myself regularly, it’s worth it", "kayvogue": "@kate.toddy caption 🙏🏼", "lee_uhhhhh": "Same @nicole_trice", "rebeccameital": "Oh I get you. Love what you are doing telling the world how it really is. Lots of love to you.", "butterknobs": "@samifitz 💓", "colourtheorist": "Not alone - can’t put my finger on it! It’s just exhausting.", "hollymariataylor": "I love you. Thank you for sharing this 💚💗💛💜❤️💙", "r_mcdowell": "Love the honesty 😚😚", "rubyjnkie": "Thank you for this. ❤️", "little_bits_of_glee": "🧡", "alliedeus": "Jen. You’re my hero. 💚", "nataliemelchiorre": "i hope rest helps you find your breath.", "patriciakaegi": "There is a super moon in ten days... And this last week has been a tough one energy wise. I know I feel it.", "kirstenulve": "Thank you for sharing this, it feels so familiar. At least you look fantastic!", "andapalpr": "Thank you for sharing your journey. You’re such an inspiration. 🙏", "takemetoharlem": "Oh lady, your clarity on this hits the nail on the head. Thx for posting. Keep changing those tires", "boogiechillin77": "I started with anxiety after I got Bell’s palsy at 39. Could never understand how or why people could get anxiety —like geez, “why can’t people just control their emotions?” And then I started getting panic attacks. It’s awful ! and uncontrollable. I don’t like that feeling. Something that always helps me is deep breathing and praying. Followed by an immediate dose of All natural amino acid supplement—GABA Calm-my husband is a pharmacist and he suggested it. It has gotten me through tough days! I also had complete bloodwork done and was B12/B6 deficient. I now get B12 every other week and has helped tremendously! Breathe. Hugs.", "fatmumslim": "Big love. 💕", "jkklynx1": "So well Said. Relate so much. Thank you", "kmadmclean": "Ok is Parmesan cheese actually I thing?! I swear I almost had a panic attack when I was in Italy and I thought it was triggered by the cheese looool wtf", "michellematangi": "Thank you for sharing your struggles with us all 🖤💫 Much love xx", "sheilaherrling": "Jen-I hope you truly understand the importance of your willingness to be so open about your depression and anxiety. That picture is a deceiving picture of absolute confidence and contentment. Which is why we all need to ASK how people ARE and LISTEN to the answers. I am in awe of you.", "rewildingourwholelife": "You’re changing the world with posts like these.", "oliviagraceross": "Wowowo so relatable ❤️", "ofrivie": "I hear you and feel the same thank you for sharing! ❤️❤️", "datmeesh": "Sending you all the love. Thank you for your brutal honesty.", "promspleen": "@jengotch Thank you for sharing and I hope you can get back to your best days soon💗 I’ve been riding that good day wave a wee bit too long and I crashed hard yesterday. Like really hard. Like today I had to leave work hard. You have always inspired me to try harder everyday. I wear my bipolar necklace proudly (thanks for making one of those BTW) and I will take time today to work from home and work on getting back to the good days I was so proud to be having. They are on the horizon I just know it. Thank you for sharing your journey with all of us and helping to let us to know we aren’t alone in this 💗✨", "eryabella": "@jengotch Sending ☆PRAYERS☆ And ☆POSITIVE THOUGHTS☆ For A Better Week Your Way!!!!:-) I've Been Going Through Some *Health Issues* Since November of Last Year, And Have Gotten *Poked & Prodded* ALL OVER!!!! TALK ABOUT GETTING *DISCOURAGED* AND *DOWN*!!!! I've Been Like That, Since November, But O n", "mbpanda_tam": "I’m having the worst depression/ anxiety for few days . Had panning attacks last night . I really relate to your post and I absolutely love it . How you describe how you explain. I really don’t know why my low came from but not fun summer ...... but I’m not alone , your not alone ♥️ Seriously you are shine of light . Thank you Jen 🙏🏻 let’s take it day by day and just try to breath 💨💨 come to Oahu again . Aloha 💗💗", "getadvancedchic": "💕💕💕Feel better... but Dam you 👀looked Great!!!🙌🏻", "soft__animal": "Alcohol is my #1 trigger for anxiety and depression. I didn’t realize it until I quit. I quit 2 years after my mom died of alcoholism (so, 3 years ago) & I am so much better off. Of course I still struggle with depression but it is much more manageable.", "ipatrickdesign": "Love and appreciate your honesty and sharing ❤️", "knife_ie__": "@kid_ace preach❤️ 🦄 ❤️love love love", "hello_victorious": "@ameliaxlynn I think you’d like following Jen! I learn something new everyday!", "jasminestar\nVerified": "Verified", "tiffanydawnhasse": "@whippersworld xo", "maryelizatron": "Thank you. ❤️", "sophiahgoehner": "Sorry you woke up depressed! I understand is an understatement for me, keep persevering!!!", "katpfisher": "I want to hug you. ❤️", "chessiecosta": "❤️", "mama_thomp": "I hope relief comes soon 💛💛💛", "handebec": "Hang in there ✨✨✨", "linzchamp": "💓💓💓🙌🙌🙌🤗🤗🤗", "mfzaroni": "I woke up the same way and I couldn't agree more of what you said today, that's exactly how I feel most of the time. I don't have the voice to say that out loud or people that knows that about me so I could talk more but what you are doing is great. You are all that but along with you are BRAVE as fuck. And by the way Jen, thank you. Your podcast is great, it's helpful and I needed that. and oh, trying to unblock your chakras is always a good choice. xo", "sarahandmaude": "As someone who has only just begun to make progress in managing their anxiety, after a lifetime of struggle, you’re such an inspiration. Not because you have the whole thing figured out and under control (does anyone?), but because you are so brutally honest about how hard and unrelenting the struggle can be, and how quickly things can change. Sending love and good vibes your way. You’ve got this, and you will absolutely get through it because you’re an amazing woman x", "feminest.co": "❤️", "jennifer.fogerty": "I love your vulnerability and your discussion of mental illness. Thank you. ❤️", "kellymallegni": "@hana.na.nah", "kidsofdada": "🙌", "juliannaleopold": "you put in words how a lot of us feel. thank you so much for putting yourself out there for us and showing us that having anxiety isn’t always triggered by something. sometimes it just happens!! I love you, thank you 😭🙌🏽", "abbemac": "@heatherdaltondennis", "styleroot": "@letsgetmentallyfit 💖", "thechubbychic": "Thank you for this and also for every single one of your posts 🤗", "mbgc100": "@jengotch have you ever read anything on depression and anxiety from the Medical Medium? https://m.soundcloud.com/medicalmedium/anxiety-depression  http://www.medicalmedium.com/blog/bipolar-disorder", "denarochelle": "Understand completely. I had a day like this on Saturday and couldn’t pinpoint the why... the triggers. 🤷🏼‍♀️ It helps so much that you’re sharing your experiences... makes me feel better knowing it’s not just me dealing with daily health management.", "kay_tilthenextone": "Relatable. Sending love. 💕", "phecki": "This couldn’t be said more perfectly", "tomasomally65": "Hang in there chicka! You’ve got this!", "artbycac": "I totally understand! 💯💓", "thekatofalltrades": "I admire you so much @jengotch you make me believe that there is a light at the end of this wild tunnel!!!", "michelle__justine": "So. Very. Relatable. Just found you here on IG but truly appreciate you putting this roller coaster into words.", "mmdh.studio": "I’m so thankful that you and others are bringing this to light. my mom has been battling quietly for 20 years, but openly for the last 4 years. It’s so easy to be on the outside and have ‘all the answers’ for her. how annoying we all must be 😕 keep fighting the worthwhile fight and sharing the ups and the downs 🙌🏻😘", "pienyada": "Xxxxx", "foreverharlow": "@shantasm29", "fairbanks_chappell": "Inspired", "bea.oxford": "Crazy sister Jen", "kellyann1020": "Relatable 😕", "tkjcollins": "♥️🙏🏼", "_annicksm": "Thank you. 💕", "jenradway": "💪🏻❤️💪🏻", "ohhaikiki": "I know you know you best. But I feel it’s worth noting thAt booze after effects for me are always depressive. Not saying stop drinking cuz heaven knows I enjoy a good cocktail and we don’t have to be puritans or feel everything all the time. Just saying sometime if I remember I consumed a actual depressant then it eases my need to find the why for the depression.", "mlch_elle": "Thank you", "oldusernamewa": "It's caffeine", "allisonmadi78": "You are loved.", "debbiedrawsfunny": "Thanks for sharing💜Although, are you sure this wasn’t about me? I swear you just wrote a post describing my life story.", "milsia.makris.art": "I can relate, so hard. Thank you Jen.", "sugardollswim": "Literally tearing up because I totally get it. Anxiety is my little bitch. This year it's been so bad but I had a part in the clouds for 2 days and savior it as much as I can because I know it always back and sometimes bring the asshole depression too. Sending my love to anyone who deals with this stuff. ❤", "zanklaren": "Thank you! I’ve got depression seeping back into my life and I’m constantly analyzing why I’m feeling how I’m feeling. It needs to make some sort of sense to me but truth is, anxiety, depression, doesn’t make sense! 😘💕", "sayonara_suckers": "🙌🙌", "cadiescookies": "You took the feelings that I have been feeling these past couple weeks too and put them perfectly into words so that others can attempt to understand the struggle. I wish I didn’t have to battle this, but I do. My mind needs a rest, running a business doesn’t let me do that often, but I will try! Thanks again!", "xoxo_sadie_grace": "❤️❤️", "aurora_pomme": "THANK YOU FOR YOUR HONESTY JEN! i feel this so much. i love you and here for you!!!", "porzia6561": "I understand! Not alone sad to say . Keep on beautiful being", "jennels": "I have found that CBD is a trigger for my anxiety. Frustrating because it’s supposed to do the opposite.", "thatgingerlass": "❤️", "mollzgardner": "https://wakeup-world.com/2015/01/31/how-to-heal-emotional-trauma/", "julesalber": "@eamathe this is so pure and true.", "sscheidler": "Hey thank you Jen. Thank you for sharing your humanity with us... I woke up anxious... like my body shaking anxious... and I thought I should write about this, I should do some breathwork... some yoga... instead... I stayed in bed until I couldn’t and then I showered... calling it a win. Hang in there Jen.", "glamjess": "❤️", "selfishladies": "I’m here if you are looking for help.", "maddieolhoeft": "Girl you rock that hat. Feel better!", "annabholcombe": "This is everything.", "mrs.rueling": "@jengotch same here... last week was horror ... and I had signs. Just didnt recognize them. Didnt link them together ....", "becca_r": "Sending you love, healing and clarity. The clouds will pass 🧡", "flowersandgarbage": "My mind races like this too. Love you Jen. 💛", "backtostripes": "💪🏼💪🏼everytime I open my IG I hope that you have posted something, anything, because I feel it’s the most real thing I will see all day. I love your honesty and want to thank you for sharing your raw unfiltered life with us. I have learned so much and it has helped me so so so much! 💗 @jengotch", "_babefroman_": "Dude, it’s the alcohol. I have thee WORST anxiety after I drink. It lasts for about 4-5 days afterwards. @jengotch", "robinarias6": "I hate this battle...sometimes its just to much to handle. I have thoughts about suicide. I'm so FUCKIN tired of the battle. I think about my 4 kids and that they can take care of themselves. Then i think of the impact it would have on them! Thank you for your honesty! ❤", "brandnrd": "Thank God for your candor #savinglives", "allthebeautifulthings17": "You are so strong. Thank you for sharing your journey and letting others know they/we are not alone.", "bradfordh": "🌹💎 thanks for the honesty!!!!", "missdrebaybay": "Hang in there! Sending you good vibes! 😘", "lizzypearl": "I’m feeling very similar. Must be the cheese.", "wholetraveler": "Your honesty is inspiring and SO appreciated. You're not alone. Sending love and good thoughts your way!", "bngraves": "Jennnn!!! Stop drinking!! You always feel low the next morning :(", "melizastaff": "❤️❤️❤️", "isantiga": "You are amazing, thank you for sharing your journey with us. ❤️✊🏽", "ron_elisa": "🙏🏿💚", "racheldmatos": "Mid anxiety smile. Done it many times.", "bykatjaisabel": "💕", "goldenradiance": "Ugh thank you for this Jen! ♥️ I’ve been feeling the same way. It is so frustrating when you can’t decipher why you’re suddenly feeling so anxious & easily triggered. This check list is something I do as well, questioning every single aspect of your life, trying to find the culprit...it really is a journey & you can’t rush progress.", "travelcutsie": "So beautiful 😍", "agusmoraco": "If you knew how this post means to me !! I just feel I’ve been heard for the first time !! Thank you and let’s continue to be 💪🏻💪🏻💪🏻", "lizstagramfl": "👏🏼👏🏼👏🏼👏🏼", "lauren924": "Jen, the last line of this post is the most important to me. I struggle with anxiety and the part that people don’t always understand is that it can happen when you are surrounded by people you love in a place you love, but that doesn’t make it any less real or intense. Thank you for always being so open and honest and for bringing awareness to these issues. I know I am stronger because of you. ❤️❤️", "the_numinous": "Stopped in my tracks when I saw this as I thought it was a picture of me! Then I read your words. I have so much respect for all you’re doing to bring awareness to mental health @jengotch 💜", "kelzie8": "Thank you for sharing your journey! I suffer from crazy anxiety. The \"control\" is something that took me years to understand. I was controlling situations and environments for my mental safety. But, friends and family saw it as me being controlling. I was suffering alone(full of shame) and moving/pushing forward regardless. Wishing that it was something physical I had to deal with instead of my unquiet mind.", "artistwandering": "sending you so much love @jengotch ❤️🌈❤️", "hudsonandlee": "I have 2 words for you...CBD oil, I’m not kidding when I say it destroyed my anxiety and depression and it’s natural, no debilitating side effects from RXs. The stuff is amazing!!", "hannahroberts": "super relatable. thank you for sharing! ❤️", "luly700": "Sending you love. You got this", "crownejules": "Thanks for sharing this and expressing it so perfectly. My worlds been off its axis lately. While I don’t wish this on anyone, It was good to know I’m not alone. Enjoy your rest! The world will be here tomorrow. 😘", "dmb.317": "@jengotch you have quite a way with words...words that mean so much to many and words that make my heart ache for you. hugs and tighter hugs from orlando. thank you (again) for always sharing your true self with us. 💓", "hgsmith6": "Baller", "tammythiele": "Completely related. Thank you for being “out there” with this. ❤", "sasha_tozzi": "Thank you @jengotch", "millstoned": "Amen 🦄🦄🦄", "silentsexybubba": "We do the best we can as humans ! Take Time !!! do something for you today ! Your a rockstar! And maybe it’s not enough Parmesan cheese!! ♥️✨✨✨", "alexkonold": "Thank you for being so vulnerable. You are not alone in this frustrating cycle. It helps me to try not to figure out what “caused” it. If we have anxiety, sometimes we will just have anxiety. It’s the hardest thing for someone with control issues (and I’m not always successful at it) but it does help to move through the feelings. Focus on taking care of yourself, doing value-based things that make you feel in tune with your truest self. It helps you move away from the “why” and towards a *little bit* more peace (sometimes). Sending love 💕", "jesserker": "Thank you for your honesty", "thisintelligentbody": "Tough cookie ♥️", "hellohickey": "❤️❤️❤️", "snewbys": "@flood24", "kgross": "💖", "natalieprisla": "@melodyrosee", "knittedwit": "Thank you for your vulnerability. Riding that same wave and it’s less lonely when I know I’m not the only one.", "flantastic": "@flanfloozled ❤️❤️❤️❤️ @kathryntheblake @sydneewick", "kaciemcmackin": "Thank you for sharing!!! The process is not linear.", "teetbadeet": "Thank you for sharing your story. You are extremely brave and thoughtful.", "pinkieglossmakeup": "Omg fo realz!!! R u in my brain too?!?! The struggle is so real", "mmgodardcardon": "❤", "daydreamarcadekids": "Inconvenient is a great way to describe my bad days. I can’t name what’s wrong, and I WANT to live my life and do all the things, but on those days I get pissed at how INCONVENIENT that sucker is", "awfullyshy": "not the parm!!!! anything but the parm!!!!!!!", "lovevalgeisler": "Just had this very convo about constantly investigating the root cause. But at least you’re investigating, Jen! Most of the world lives blind to it all. You’re on the field, playing the game! Proud of you.", "joiebutter": "Same same same. I used a car analogy in my mother’s day lost. Maybe bc they also frustrate me. Thanks for helping me feel less alone in the scary mental health journey. 💗", "scribe50": "Love you.", "susangholt": "It’s such a horrible feeling. Both anxiety and depression. Take ‘a day’, that’s what I call it, then hopefully tomorrow you will feel a little better.", "moowanmw": "I feel you. I truly understand. Thank you so much for sharing.", "jenniferyarnall": "Lovin on you today, vibes coming your way!", "_jeanoid_": "I’m sorry you suffer. My daughter does too.", "sarmun73": "You are awesome!! I totally get this!! Anxiety is a SOB!!!!", "medhamukerji": "@jengotch you’re an inspiration you’re so strong and so committed keep going ❤️", "kierstentruley": "@genchymcfly 👆🏻who I was telling you about", "jordankayerex": "@staceylynnrex", "brittk316": "Hi @jengotch I’m a new follower and podcast listener from ATL. I’d like to thank you for sharing bc you’ve often taken the words out of my mouth. Or rather, out of my head since I tend to not share my own struggles very much outside a few close friends and fam. I hope we can meet someday. I think what you’re doing for mental health is going to be life changing for a lot of people. Bravo to you. Please keep it up, especially on 4.2 days.", "teamwoodnote": "❤️", "rochylinsta": "Thank you so much for sharing your journey. ❤️", "waycrunchy": "My anxiety has been on high the past week, very physical, without clear triggers....so #samesies maybe the moon?", "jenhubbellphoto": "😘", "lolaroxyandthem": "❤️", "debinwonderland": "Thank you for sharing your journey ❤️", "phoebepeacock": "Keep breathing. Sending love 💕", "jennygeezer": "It’s def the parm. We love you ❤️", "mtantau": "Been thinking about you these last few weeks- they’ve taken all the air out of all the tires. Yep- flip that map over. Thank for your point of view. ✨", "adrienneinfante": "The hardest part is knowing when it happens and recognizing how you’re feeling. Thank you for sharing this, so many of us experience this and don’t understand what’s happening. You are stronger than you know. 💗", "shopkathyweller": "You are amazing! Thank you for sharing, your honesty and your ability to explain your feelings so well.", "maryzoles": "It is nice to hear that a thing normally people kept being quit about is now a thing worth talking about. Thanks for addressing the issue so often, it helps put things in perspective. We are no weirdos having these troubles it’s just normal human nature. It helps me and I hope others to understand that none is alone in this 🙏🏻🌿🕊", "brittany.rh": "sending prayers and ALL the positive vibes your way today!!", "misscarleypoetry": "Love you Jen. Truly.", "jennybgood": "I was just laying in bed thinking “I think I’m depressed, could it be from my anxiety filled weekend?” Thank you!", "svnnhcampll": "I’ve a huge fan of your work. But, this vulnerability is influencing me more than you know. I’m thankful. xoxo.", "january_one": "I feel like just when I have a handle on things (CONTROL), my anxiety likes to switch things up and find new and inventive ways to torture me. I feel your pain. I hope you find some peace quickly. ❤️", "brittanyarita": "thank you for continuing to share your journey so honestly and openly with all of us. <3", "goodeyegallery": "No judgement at all @jengotch because I really admire your brutal honesty but wondering if you’ve added volunteering to your arsenal of resources?", "ohyumpinkoko": "Beyond mountains there are mountains.", "sponge_cake_press": "Try cutting out coffee..and perhaps alcohol.. these 2 things really are hard on the brain ... but add sugar free matcha teas with sugar free almond milk...", "mrsjennamartin": "You’ll get through this! 💗", "mirbrown75": "Future Jen for sure thanks you for resting today! Radical self care + self love always 💕", "bacheloretteoffinearts": "Thanks for being you. You’re amazing, inspiring, and deeply admired. 💕", "alexandrakfarmer": "Urgh i feel you- i know it so well sending calm vibes 👌", "jenlourahair": "🙌🏾 you’re a warrior for sharing this, you have no idea how many ppl this helps! ❤️", "candicesays": "Thinking of you and sending all the peaceful vibes your way! You’ve made it through so much; you will come out tops at the end of this difficult season too 💜🌈", "ashley_overhills": "❤️❤️❤️", "_thechroniclesofrachel": "Thank you for writing this. love you.", "saffrondrip": "@taynew92 some MORE nonlinear things in our lives. I thought of you when reading this...so I’m sharing with u. 🤗She has a rating system for how she is feeling...if you’re wondering what the 4.2 is all about.", "_stephybear12": "Sending you lots of love 💗", "bg3w": "Love your sharing 💕", "wilderandmae": "Every single word of this is truth. It should be printed and handed out for people to read and hopefully understand, to get some sort of insight on how it is for people with mental health problems", "prettycrabby": "♥️♥️♥️♥️", "mavisvancamp": "You are making a difference to me and, based on the comments, a whole lot of others. I feel more like I have a community through you, than I have in a long time. Thank you, lady.", "jillianmorkan": "You rock. Hope you’re feeling yourself soon Jen x", "ford_and_wyatt": "You are so beautiful and just inspiration!!! to so many. I don't know if you've read 1000 gifts - but yesterday I tried to think of one thing I was grateful for and center my mind back to that same thing each when I needed to. Not something broad like family and friends but - I'm thankful for good coffee, or the feeling of sun warming my skin, that I have nice feet, or country roads whatever ... also for someone like you... how that leads to creative thought - I think you're supposed to write it down but yeah I don't know how something so small can be a cornerstone of thought but thought I would pass along - there is peace in the simple things and knowing there is a plan bigger than ours we can rest in. Prayers for you girl.", "desireeskowronek": "Your brave recollections have been the perfect antidote in feeling less detached. My company recently went bankrupt, my Fiance's toxic Ex is making it unbearable to coparent his three children and thinking about any sort of wedding planning gives me the shakes. So much for summer and getting out of the SAD season. Keep sharing. So many of us struggle and you've been the proverbial mental health engine that could. 🚂🙌🏼", "jennhb_1": "Thank you for your honesty. I am having an eerily similar day (and past few months). It means so much to know others experience the same.", "lillipads": "❤️", "kindredvintage": "💕❤️", "d3vanlee": "@pfortycal I enjoy following her and her perspective on mental health!", "saltnantucket": "Brutal! You need yoga every damn day.", "jkrejnik": "❤️", "tamar.t.henry": "Thank you for sharing this. Not that it’s the central idea here, but perhaps you are feeling the collective fear, rage and hopelessness that is palpable in our country right now?", "fan.tesstic": "Jen really, go and travel, see something you’ve never seem before. I had crazy anxiety for a year, I was unable to leave my house, stopped seeing friends, just unable to function really. And then I took a plane to Bangkok and traveled around for 3 months and it was after a couple of weeks that I was finally able to breathe again. To feel like my old self again. I found a new energy to go back home and deal with everything again. I’m not saying that traveling will ‘cure’ your anxiety or instantly makes you feel better BUT you’ll get out of your comfort zone, eat different things, walk a lot, swim, soak up sun and I believe that’s what you need to pause your anxiety and re-asses the situation.. (ps I am not a native English speaker so sorry for any mistakes but really, traveling to an unknown place could be what you need right now)", "katie_benn_": "all of this 💯 %", "kodiakmilly": "Thank you ❤️", "lightluce": "“Sometimes you drive backwards for days at full speed without even realizing it” I feel this so much! Sending you love! Pull the car over and get an ice cream cone. Take a look at the beauty around. This too shall pass (thank God)", "globalbackyard": "Hope you feel better soon! Also, maybe it’s hormones? I’ve recently learned that changing estrogen levels can impact your serotonin...Anyway — sending good vibes! And a unicorn.🦄", "merniemern": "I found later in life that alcohol will cause anxiety and panic attacks. I’ve found that it could be as little as two drinks. It’s gotten worse, affecting me my like poison sometimes. Not always, but more than half the time.", "sparrow_hair_co": "You are stronger than you think. You’re giving me inspiration everyday. @jengotch you got this.", "tcdubb72": "Oh @jengotch through your 4.2 today you took time to share this and help someone like me, who feels always on the verge of being pulled under. Thank you.", "lizall1980": "Have you thought about getting a genetic test to see what your genetic markers are? It’s been really helpful for me.", "brendrawr": "You are so brave, thank you for sharing 💗", "jeanette_lazusky": "So grateful for you and your advocacy everyday. 💕 your openness is inspiring and is helping me better communicate to those around me what I am going through.", "daphnagabay": "♥️", "yourbiggestfangrace": "Sending you all the love today ❤️❤️❤️❤️❤️", "mamamuell": "You make me feel understood... thank you!", "allisorrigby": "I am so grateful for you.", "4oclockapple": "@racheles5 she gets me", "jeunesse1": "❤️💞💜", "x_geek": "this too shall pass..here’s an extra boost of light and love to fill your day ✨", "allisonzahigian": "Happy you are giving yourself the day. Sending love 💕💕💕", "ninaramey_": "Thank you 💗", "dryad_girl": "Thank you for saying all the words in my head more eloquently than I ever could. I love your podcast and I am fascinated by my own mental health. My big struggle is agoraphobia triggered by emetophobia. That’s a joy. And I do the same thing. Try to figure out the trigger. Every time i get through a period of being home bound I swear I will never get there again and then bam. And the most frustrating thing for me is each time I get out of it... I literally have no idea what happened for my brain to make the shift from being terrified to leave the house to wanting to go to all the places. It’s a big shift. And it seems to happen fast. Anywho. Thank you for being you. ❤️", "meghan__calle": "🙏💕", "firefliesart": "❤️✨thanks for always sharing yourself with us.", "amourcolette": "@jengotch you bring such a 💡 to my life. I struggle daily, but have found strength in not only your words, but your overall zest for life! I 💜 you. Xx", "paulacafeina": "❤️", "nicolepaolello": "@jengotch I’ve been dying to ask you something (depression related) can I DM you?! Or do you want me to ask you here?! I would LOVE to hear your thoughts.... I hope you see this 🙏🏻🙏🏻🙏🏻", "laneykatem": "Xoxo", "katieblossoms": "The not being able to breathe thing..... damn. I get that. Thank you for sharing. I hope the fog lifts soon. 💛", "optimistichuman": "@hollixandra this.", "andalifewelllived": "🖤🖤🖤", "mamakateknowsbest": "Thank you so much for sharing ❤️", "tigermlk_": "this is such a good explanation of the ongoing process of mental health. Thank you for this.", "laurenlancasterbeauty": "❤️Thanks for your vulnerability 👏🏼", "abigailsail": "Maybe the most beautiful human ever.", "annwigham27": "Definitely Parmesan cheese.", "moonandmyrrh": "Why am I just now finding you and your authentic realness that seems to fit all of my feelings into tiny little captions? Thank you for not giving up so that I could read this and know I’m not alone. 👏🏻👊🏻", "jennalicious177": "You look beautiful. Alcohol is always a trigger for my anxiety. Then my anxiety leads to depression. I just don't drink anymore-course, it's not perfect, but it seems to make me better.", "rach__jane": "@squitolito her Instagram, stories, and podcast are everything ❤", "silverpapergirls": "Totally relatable here! Maybe I need a good sob and rest! Realignment! Then pick up and move On!", "littlehouseink": "You are truly my hero and inspiration as a creative with mental health shit of my own. You make me feel like I can handle the cards I’ve been dealt and dream BIG. Thank you", "meltedxheese": "💗💗💗💗💗", "morgantwist_studio": "I feel this post on so many levels.", "hannah_palindrome": "You’re the best! Always so inspired by your willingness to learn and keep trying and sharing!", "backstageboo": "💕💕💕", "elisehanna": "You are beautiful and strong. Carry on.", "cakewin_": "Thank you for posting this", "jencru": "Thank you 🙏🏽", "spider_from_neptune": "Thanks for sharing. I completely relate to this because I have a job that requires me to put 100% of my attention and everyday I just want to quit. But I'm still here, like you are. Like we all are because we are warriors :)", "ohswoonbaby": "I can relate to this in so many levels. I also get my mind racing when I am experiencing my rounds of anxiety or depression. I have done a lot with reiki, meditation, chakras, oils etc... and sometimes I feel like even those things can trigger or make it worse because I give myself so much hell and stress over thinking about it. am I meditating right? Is one of my Chakras blocked? Did I mess something up when working them? Did I forget my third eye again? Oh my god, maybe I’m have been making things worse?", "frenzybyzara": "I hope.tomorrow is better x", "samanthalouisedesigns": "We got this! I had a solid 3.2 day yesterday mostly spent sobbing and forgetting to breathe. Thank you for showing up everyday no matter what. You give us all the strength and pizazz to keep fucking going 💕", "shotgunchronicles": "Something that has helped me recently....because in our society, happiness is not only the ultimate goal, but is expected of us. “Happiness is an emotion, not a state of being.” Like all of the other emotions that ebb and flow during our days, weeks, and periods of life. It’s riding the waves and feeling them all that are so tiresome and debilitating. It’s okay to rest, I hope your day tomorrow is better. 🙏", "vanessablossom": "💜💜💜", "handelgroup": "WE LOVE YOU @jengotch 💜", "alyson_undone": "I’m always running through my list of possible triggers and then their remedies-entirely exhausting way to live, but we are warriors! 💗 you, JG.", "jarrdin": "❤", "jihadbnimoussa": "Thank you so much for sharing this and showing the dynamic process of maintaining the balance of mental health. There is a large misconception that it is a destination rather than a journey and as a psychologist working with youth, prominent people like you being courageous and vulnerable online makes a huuuge difference in the kind of conversations that we can now have with young people about their mental health ❤❤❤", "meagsmusings": "Everything you share helps me feel heard, understood and stronger. Thank you so much. 🙏🏻 Be well. 💗☀️🌸", "jacksfoodla": "Parm can really fuck you up", "iamlauramadden": "Too cute (and too cool for sch....:", "_a_r_w_3": "I love how clearly you articulate your mind states. I’m right there with you. Today I just want to be on the floor, under a pile of blankets. But I’m pushing my way through work trying to hide this pain as best I can. No one seems to notice anyway. Can’t ever tell if that helps or hurts.", "dion__74": "💝", "laura.gwinn": "It’s so wrenching. I’m sorry. I’m with you though, this month has been one of the worst in years. Here’s to pushing through it. ♥️", "malika_semper_astrology": "I feel you. And maybe it IS the moon! 😜🌙💗💗💗", "mali.mish.marlene": "The anxiety in me sees the anxiety in you in this photo. Thanks for sharing with us. ❤️", "messyjessyg": "Lifting you up in love & light, you are not alone *hugs*", "laurmcgrath_": "@kelmcgrath12 @kalyssac", "susieqqq123": "Big hugs and thank you for sharing and trying to destigmatize anxiety. ❤️", "laalirapp": "Jen 🏆❤️", "jessruthfitness": "THIS IS ME!!! Even down to the Parmesan cheese, although mine could be goat... it’s nice to know there is another warrior on the rollercoaster with me!", "lencollective": "Thank you for sharing your struggles with us with such vulnerability and transparency. I so wish you did not have to experience these awful things, but I appreciate you giving voice to what mental health issues look like and feel like so those of us who also struggle can feel less alone. 💕 Hoping tomorrow is a brighter day for you!", "gracesmith72": "feel better. remember.. alcohol is a depressant.", "thriftingky": "Summer is rough. Peace & love to you.", "bensarah": "💛💛💛", "vanessabancheri": "Vanessa Bancheri wants YOU to feel better ✨🧠", "shazatti": "Hang in there. You give us all strenght to do so! (If you can, check DMs of last week)", "kellyoxford\nVerified": "Verified", "cherylpisha": "Inconvenient....that is simply the best word possible to describe anxiety when it hits me like a truck. Thank you for being you and for your openness. Breath of fresh, clean, sparkly air....that’s what you are @jengotch. 🤟🏻", "heatherlchrist": "This happened to me Saturday night. Almost a full blown panic attack after almost 2 years of not having one-alongside of tons of emotional work. Changing that tire and remapping over here. Thanks for your honesty-it helps to hear others experiances... and I hope you’re feeling better. ❤️", "katie_watts_illustration": "Sending you love", "unmothermusic": "I truly have no fucking idea what I would do without you", "finding_golightly": "🙏🏼", "helloarielchristine": "Detours and construction. Very well put. I’m just over here, under construction. Haha. Hope you feel better soon! 💛", "callybis": "I’ve woken up feeling the same, gawd it’s agony but you are not alone, I am not alone. We got this 💚", "paoladc_": "❤", "anndanger": "Same. Here’s to you, fellow road warrior ❤️", "popejoys": "So, so relatable", "denise_bates70": "💛", "wolverinaballerina": "You are a badass @jengotch", "indiaffinity": "It’s relentless, girl. You hang in there, keep breathing.", "invisibly_enhanced": "💜✨😘🌈 thank you for sharing", "morgattaque": "🙌🏼😍🌈❤️💌 sending love", "moonpiemary": "You are showing up for yourself and others 💪🏽❤️"}