{"emilyanne922": "❤️ sending love and light", "morgsborgs": "💕", "rmdeharo": "I can't imagine what a tough decision that must have been. But no doubt your sharing has helped someone who is going through rough times as well. Sending love and good vibes. 💓", "9thletterpress": "Jen, I'm so so sorry. There's no getting around how hard that is. Sending so much love, and I'm incredibly thankful you have sweet friends as coworkers. So many hugs. So many prayers in this new chapter. ❤️", "itsme_imcathy": "😘😘😘😘😘😘😘", "arielpcox": "My heart has hurt for you (in a weird cult following way) since you first posted this. Sending all the love and peace and comfort to you during this time 💗🙂", "marlowreidwhite": "❤️ you Jen", "heatherlouloves": "❤️ that mani and you.", "glutenfreebeauty": "I am so sorry hun, I've been through it and it sucks. You build a life of dreams shared and then apart the ones that are still going seem so different. You are so strong though, look at what you have done and all that you share. Stay true to you and don't give into any beliefs that being alone w your animals on a Fri night is wrong, be YOU and own that. There is so much love out there for you. Even though I know at home it's different, it also leads to better. I promise ❤️", "maisonboutique": "Sending lots of love from SLC. Thank you for always being so true and real, even when it sucks and hurts. 💜", "katiarichard_": "Sending lots of ❤️❤️❤️❤️", "deluxemodern": "So many of us have been there, and the only way out is through. You are lucky to have such an amazing support system ( at least it seems like it) and this whole year has sucked ass, straight up. But you rule, and crack me up every time I see anything you post. #fwiw 💕", "tiffanydouzartist": "Sending you so much love and positive vibes💕💕💕 You're amazing and always will be!", "_shellybishop": "💗💗", "frolicblog": "Thinking of you, Jen. Lots of love to you.", "summerbellessa\nVerified": "Verified", "emmajanekepley": "Just saw this post and wanted to send some ❤️ your way. You're one strong/inspiring and creative woman 💅🏻💫", "maureenfdesigns": "Thank you for sharing. Sending positive (optimistic 😬) energy.", "somecrazycat": "🌳☘️🍃sends my love . You will overcome this . If not weed and nature can help 🐠", "junesoulbyali": "Jen love you! You're so strong!", "alexnoiret": "💗", "so_cal_belle": "😔❤️💕❤️😘🙂", "mhairi_stella_tattoo": "Hands", "kathdeter": "@mary_oglesby", "alexandrabigley": "Sending ❤️ and lots of 😀 emojis. #staystrong", "cocodanger": "You are amazing and inspiring and we are all cheering for you! Thanks for being so real and doing what you need to do 💗 sending you an Internet hug! I hope you have a wave of peace this week", "fadedsentiments": "❤️ thank you for being you and inspiring us all. Sorry you're hurting and both going through such a hard decision. Sending all the best and positive vibes from a Jen Gotch fan!", "ticeisnice": "Even though you shed tears you are still brave and full of love. Thank you for sharing and inspiring all of us around you 💗👍🏼✨", "the.grits": "Wishing you strength💛💛💛💛", "creativethursday": "sending so much love ❤️ you are lovely, spirited and brave. Thank you for always sharing so openly. I have been exactly where you are 13 years ago - and after difficult choices, a lot of love & respect (aka conscious uncoupling)and many tears, it all worked out exactly as it was meant to (as cliche as that sounds) and for the best for my both my ex-husband and I. Sharing here will definitely help soothe anyone going through something similar. And there is always so much comfort in knowing we're never alone ❤️ thinking of you @jengotch", "evoult": "Sending all the love, hugs, and positive vibes your way! ❤️✨", "elizabethrvilla": "@littlelincoln33 yes yes yes yes!!!!", "invocateur": "I ended mine 3 months ago in the same way... The sweetest breakup one can ever have. It makes my heart ache even more, to know that even when there's so much love sometimes it's just the relationships time to end, and it's OK to walk away in love. Sending you healing vibes. 🙏🏻 Surround yourself with ❤️ girlfriends, enjoy this solo time. It's powerful times to reconnect with ourselves.", "caitdeck": "Love your way ❤️", "hellosandwich": "Sending you so much love. ❤️️", "autismoamor": "Su valentía es tan admirable tanto o más que su personalidad. Amor de todo corazón @jengotch ❤", "nicsan": "💛", "myseastory": "Sending you my love, and thanks for sharing, it helps those of us who might have to go through that too 💕", "oliviaspearsreeves": "Much love 💕💕💕 if it means anything at all, I'm so inspired by your openness and honestly on social media. We could all use a little more of it.", "beckymsimps": "Sending all my hugs, Jen", "ohheylu": "I'm so sorry @jengotch! As a divorcée myself I know that it is literally one of the hardest things you can go through. However, making the decision to separate when things aren't good opens the door to a more positive future that fits YOU better. My ex and I separated 6 years ago and in that time I had more fun, learned so much about myself, and did what I wanted (and didn't have to check with anyone), ditched old friends, gained new ones, fell in love again, got married, and I'm now pregnant with my first child! None of this would have been possible if I was stuck in a marriage that didn't fit. Sending hugs and strength your way!!💗", "idreamofjanie": "💜💜💜", "difftiff": "❤️❤️❤️❤️", "camelliak": "@littlelincoln33 @julistarreed", "rachelllita": "@elizabethipp", "vandyland__": "sending love, light and lots of smiley faces! ❤️", "katrynarae": "Sending all the love and happy faced vibes your way. You are such a wonderful person to follow online and I love your annoying optimism.", "_amandadawn": "thank you for being brave & honest. i am a tiny business owner & you are such an inspiration to me - for being someone who is real, and doesn't sugar coat things & i've actually been exploring how i can do the same. know that you're not alone in this & we are all rooting for you. you got this girl. 💕✨", "theheydaystore": "❤️💪🏼", "paperdahlia": "Hugs, girl! 😌💕 #nohugemoji", "malcriadaxo": "💕💕💕💕💕", "hadlight": "I went through a divorce 6 years ago and it was tough and really sad but I promise it gets better! Sending lots of love and strength! ❤️ Girlfriends and family will help you get through this. They are the best. 💞", "citronovydrops": "I am so sorry and am sending a massive hug and so much love ❤️❤️❤️❤️ You will get through this and thank you for always being you.", "les_818": "💗💗💪🏼", "__allysonmarie": "@lale_lemon", "petravanroon": "LOTS of love dear @jengotch, I'm so sorry for you both. Having gone through it myself (depression and divorce), I can confidently say: you've got this. You're stronger than you think and people LOVE you. Praying for you! 😘😘😘", "luly700": "Hugs Jen. I don't know you but you bring a smile to my face ( not this post) and you seem like a lovely person. Wishing you healing and happiness.", "amber_mcmullin": "❤️❤️❤️", "emily_neie": "Powerful women like you being vulnerable is what will change the world, @jengotch!! You're bringing compassion to capitalism and we love you for it!", "thejunglefish": "Sending you so much love, Jen! 💖", "marisa.chaples": "❤️❤️❤️", "dennine": "Sending so many positive and happy feelings your way 💞", "itsruthieingram": "love and prayers headed your way. thank you for being a constant inspiration and amazing source of laughter and happiness. we are blessed by your creativity and genuine spirit!!! xoxo, from the #girlgang in Nashville.", "honeymyheart": "Sending you love", "sarakatestudios": "Sending good mojo", "sammblake": "❤️", "jessie__archer": "@jengotch sending lots of love and a warm and fuzzy hug. You got this girl 💕", "tthomasarts": "❤️", "gabywinters": "Love you 💓", "bgirlv": "I'm so sorry- sending you lots of love❤️", "modchik": "Awwwww my bright spot in my IG feed you are not alone, is there something in the water? The stars? Chemtrails? 🤔 I dunno but I do know that I'm leaning towards conscious uncoupling I like that, divorce has too many hang ups attached to it. Your public personal excavation makes me realize that some people are just beyond brave, they are making choices because they have the guts to be completely honest with themselves. Welcome to square one. You're going to rebuild something magical I just know it. 🌸🦄", "nuitaparis15": "Thank you soooooooo much for talking like that! You are the bravest and everything is gonna be not just alright, but f* amazing! Promise 😘", "amberlundyleigh": "❤️", "decor8\nVerified": "Verified", "houselarsbuilt": "❤️ I'm so sorry to hear the news. You've got a huge support behind you. Rooting for you!", "tlee79": "Totally sending positive vibes your way for a bright fucking awesome, rad and real future xoxoxo", "s_kube": "thanks for having the courage to share this.", "llindseyy": "Thinking of you Jen! ❤️", "tessaneustadt\nVerified": "Verified", "allshewrotenotes": "I've been through this and it sucks so bad but then it gets way way better. Promise. Love and 🎉 your way today!", "desimckinnon": "i'm so glad you have those guys to keep you company 🙂🙂🙂😉", "keelyrust": "Sending you 💕 Jen girl!", "kirstiewightmua": "Sending you lots and lots o'❤️!😘😊😘😊😘", "emmabenshoff": "❤️❤️❤️❤️❤️", "jessicadaviesmetalworks": "Sending you ❤️positive 🙌and strength. You are nothing but remarkable and beautiful inside and out. 😘😘😘", "deehaim": "💞🌸 💪🏼", "rljpr": "Much love ❤️ @jengotch", "meg___mitchell": "Sending you all the positive vibes I got. Hang there. Life's a bitch sometimes.", "sunnyandcheer": "What a beautiful person you are. Through all the dark you still have so much light and live in you. I'm sad for you...and Andrew...but I appreciate the optimism you two have and the hope that Tuesday will bring. Sending you all the sunshine & cheer, I have and can muster up for you. 😘", "whitepeacockstyle": "You are such an inspiring & freakin' hilarious human!!! You truly lift us up & are sending you strength & so much good juju! 💕 @jengotch", "cbanningaccessories": "Sending courage and a boat load of happiness to you Jen!", "amyslysly": "😘 Everything is going to be great.", "lyssa_flo": "❤️❤️❤️❤️❤️", "t.lorentzen": "omg i send i shit load of courage to you, but its fine to leave the positive side of you take control , you should 💖", "ashleygoldenrule": "Babe! I ❤️ you so & I'm totally going thru a similar thing... It is TOUGH. So, so tough, especially when other people who've never really given a shit before attempt to insert themselves in your situation (ugh & eye rolls for days 🙄🙄🙄) I feel you 💯!!! If you ever want to come to Philadelphia my guest room & all the things that are mine that I can share are open to you (Was that weird?! Hope it wasn't weird) 👍🏻", "theresaholden": "❤️", "natasharansom": "@miquelasuazo I love @jengotch so much", "briefcandles": "💞", "zoemurphydesign": "YOU ARE SO FUCKING LOVED. A close friend to people who are strangers to you all over the world. For all the fun reasons, but mainly because you openly and honestly talk about your experiences and remind everyone that they are not alone in theirs. Keep going with your happy heart Jen. You absolutely have one. You are amazing and important, in all your colours.", "shehasrhythm": "Lots of love to you @jengotch! 💖💞💕", "lorijo47": "@jengotch your honesty is refreshing , thank you , ugh I totally get it. You make me laugh, you make others laugh and pee, you deserve to laugh! Love hurts, life hurts but you will smile again 😉😻", "dreynicole": "Thinking of you today Jen Gotch 😘🙂🍻", "happy_modern_life": "Thinking of you so much today Jen. You are going to make it as always. It's dissolving a marriage not the love or friendship.", "elle.b.gee": "Thinking of you today. Sending out all of the good vibes. ✨❤️✨", "taralee8": "@jengotch You are such an inspiration to girls/women everywhere. I have followed you from Polaroid blog through GIANT head flowers to my I did my best sweatshirt. Being a successful woman in this world is a hard road and the bumps along the way feel more like earthquakes. Today is a totally fucked day. Be kind to yourself. Swim in the uncomfortable. Your sacrifices are not all for you. They are for woman like me as well and I appreciate it. Thank you for moving woman forward. The casualties are big, but your dedication to your craft and art is bigger. And maybe you can take solace in the fact that Gertie will always hate you. Consistency feels comforting right now, no? 😘❤️", "joiebutter": "Oh Jen! I'm so sorry. I don't even know what to say... that just all sounds like the worse. But so many people love ya! Stupid Australia being on the other side of the world!", "colorpopevents": "💕💕💕💕", "kimstagramberly": "you may or may not need to hear this from a stranger in New York but...you will be fine. there are so many emotions and mostly it sucks but, in the end...you will be fine. with the good, comes the bad. with the bad, comes the good. also, please give the finger a lot this week with those nails. all the best ❤️", "jillcordner": "So sorry, stay strong girl. I totally get the impulse for happy nails. When I found out my kitten was dying of a rare disease this spring I went out and bought ridiculous socks. Not sure why but they helped a tiny bit.", "raquelzinha76": "Wishing you much peace. You have always been such a ray of honest, true light on IG & Snapchat, but beyond social media, I can tell you're a great person. Hugs 🤗", "gogogroovee": "Just so you know your humor makes us laugh out loud! Honest!😂. Please know that people change and I know things will change for you in a good way! You have a zest for life like no other! Remember to get daily exercise and sweat. It's really important and no sweets! Continue on @jengotch 🎉👏🏻💃🏼", "_lynnebell": "Sending good vibes, brave Jen!", "condimentmagazine": "the pruning precedes the harvest @jengotch. It'll all work out, you'll see. Growing pains happen forever in life far past our childhood years.", "yanpalmer": "❤️", "graceohill": "Sending love and light ❤️💫", "meganlaportebryant": "I totally admire your strength and honesty. I would be the same way if I was in similar circumstances. Beyond that, I love your nails, vintage styles, bandana neckerchiefs, and bangs! ❤️💄💅🏻👱🏼‍♀️👯", "tahani_helena": "Stay strong and party on!", "lanavhansen": "👩‍❤️‍💋‍👩", "themotherco": "Love your feed jengotch!", "amaliqbal": "@jengotch sending lots of love, and 😀😀😀 your way. You are an incredibly women and it has been amazing watching you dominate. You sharing this hard time in your life with us, strangers, makes you even stronger. Sending you lots of positivity and well wishes.", "rushbomb": "Have always appreciated your vulnerability--it's rare and lovely. ❤️", "tamara_california": "Monday will be hard, but Tuesday is a new day. I love your outlook on that. Positive thoughts headed your way. ❤️❤️❤️", "carly.lee": "@nina_mangini", "everleyb": "😢🙃💕💕", "brandherstyle": "Sending you love, strength and light through this darkness 💜 you are so inspiring with your openness.", "yungchancla": "@jengotch Hold on to your girl gang for the best part!!! I'm lonely and cry too but we will both get through these chapters!!!! You are awesome", "ashbouldin": "You got this girl 👊🏻", "sarahcurrydesign": "😢❤️", "cleloutre": "😢❤️❤️", "anndanger": "❤️❤️❤️", "sleepybrittany": "💓💓💓💓💓💓💓💓", "micheleandersen": "@jengotch such terrible news! 💔 I actually teared up when I read this and I don't even know you. Been following you for years and years since before Ban.do and you were a photographer/stylist I really admired. You are pure magic and I'm so sorry this terrible thing is happening to you and Andrew. Seems like you are handling things with the utmost respect for each other. I actually wondered what it was that was happening in your life to make you so sad, I was worried that maybe you and @designlovefest weren't friends any longer.... But this is worse. Thank goodness you have such a good group of friends to support you through these days. Thank you for sharing!", "embernoelle77": "I'm so sorry. 💗", "oftenwander": "I can't tell you enough how much your open honesty and general badassness means to me. I feel so connected to you and have never met you. You literally have hundreds of thousands of cyber bffs that would do anything for you. That being said, you can do anything you put your mind to, including getting over some really tough times and coming out on the other side the same bright positive silly amazing Jen that you are. Okay? Okay. You are soooo loved! You've got this.", "piperfoulon": "Oh Jen. I am so sorry. It is so strange how professional success often coincides with your heart breaking down. You are going to be okay. The kindness and joy that you impart everyday, on your coworkers, on your friends, on the internet, will come back to you in droves. The people you are good to will galvanize around you, and you will make it through. I cannot imagine the pain you are in right now, but everyday will make some part of it a little easier. I am so sorry. Thank you for being brave. It's going to be okay. ❤️❤️❤️❤️", "h_malcolm": "❤️ you have good stuff to say about this. Glad you were willing to share!", "holyhonduras": "Shit girl. We are all hurting with you. Looking forward to when this particular chapter turns from dark to light. And it will. Hang in there, Sista. 🌷", "blackthorn555": "Hold on tight. We will take care of you. ❤️", "evelyneslava_": "Cuteee", "robinreetz": "We're here for you, Jen! 💕❤️💕", "littlehiccups": "Sending big hugs and lots of happy smiley faces to get you through Monday.", "oh.for.funs.sake": "💜💗💚", "poppyandiris": "❤️💛💜", "antoniasuzanne": "Sending you lots of love! 👍🏼💕💕", "little_emmab": "Hugs for Monday and beyond. You've got this. ✨💫✨", "richiedesigns": "An ending is nothing but a beginning. Sending comfort and ease to you both", "jillianrenedecor": "Oh Jen, I am so sorry. Divorce sucks, amicable or not. I've been there. You will get through it and come out on the other side stronger, promise. ((Hugs))", "setarehnyc": "You are so inspiring ❤️❤️", "pariskaren": "❤️❤️❤️", "paige_morse": "❤️❤️❤️❤️", "_amandakrueger": "Sending you tons of love💞", "sprucetoninn": "❤️❤️❤️❤️", "hellofromlosangeles": "One step at a time, neighbor. 🤕🙃😐🙂😻", "lolaroxyandthem": "❤️💕❤️💕", "babbitqueen": "I admire your genuine honesty and wish you the best of luck 😢❤️ what a rough time. I hope things start looking up soon", "inspiremyfancy": "That's why we all love you Jen, you share what most people don't dare to. Your Insta Fam is here for you, and will try to keep your spirits up along your journey because we all go through shit, and you brighten up our days when we do, at least mine! I'm sure many others too, we love you! We gotta return the love 🤗 your happy faces and all of us will try our best to be there when you need a boost! 💞💋💋💋💋", "jumeneses": "As someone that has spent a great part of 2016 (almost 6 months as of last Wednesday) going thru the biggest rollercoaster 🎢 of my almost 36 yrs of life, thru separation, parenting, and care for someone close to me going thru cancer.... If i can offer some comfort with my words: watching and following you in social media, has been very uplifting, inspiring and it has helped me see the brighter side of a strong woman with big dreams and goals, making me feel like it's possible to be happy, in spite feeling the world crumbling around me. I, myself, has dealt with depression my whole life, and I understand what is to go thru hard times and then also have that sad ghost around, being afraid that it may materialize and make things worse... but you can beat it, I'm sure. Big hugs and I hope all things resolve well for you and for your loved ones. ❤️ from Ormond Beach.", "alexisrockley": "You're inspiring, even if being that doesn't matter right now. Sending you love and hearts and stars and puppy dog kisses. Also you guys will handle this better than Gwenyth + Chris. Also your hair is forever cooler than hers. ❤️", "theonemomentevents": "You are a total rock star, full blown inspiration and a total babe. Thanks for sharing your story and letting us all know we can be vulnerable too!! 😘😘😘", "ms.lindsay.s": "❤️❤️❤️", "ginakirkwood": "💜💕💜💕", "ohhhkris": "😊😊😊😊because you need them. 💓💓💓because you deserve them. You are amazing 😘😘😘", "le.voile.sacre": "Big love and hugs to you and Andrew. Wishing you both the very best.", "sallinthecity": "Sending you so much LOVE. You are an incredibly inspiring person don't lose sight of your light !", "cristinafoos": "i'm so sorry jen, here for you if you need a hug or someone to listen... sending you so many prayers & thoughts of comfort ❤️", "bmoresmug": "Jen 💛💛💛💛💛💛💛", "winkevents": "😢💗", "miss_magpie_spy": "💛", "nicolemariedev": "xoxoxo", "fauxfoxysocks": "💕💕💕", "theebouffants": "Aww 😢💕", "this.is.feel": "So cute!!", "amarvelousmind": "Sending you all the best vibes possible. 🔮", "doublefancy": "@alexisvatteroni she is!!", "emily_katz\nVerified": "Verified", "2largepassionfruiticedteas": "❤️", "eebrock": "Thinking of you and sending positive vibes your way lady. You got this!!!!", "ckunzle_debernal": "We love you @jengotch ❤️. You can make it through this tough time and feel open to sharing with all of us. There is such a great community of people out here just waiting to offer you support!", "hauslove": "Sorry just read the rest...I will be sending out positive unicorn rainbow 🌈 fairy vibes to you.", "alexisvatteroni": "That is gunky stuff. You sharing is important and inspiring, I personally appreciate shedding light on this subject. You are brave and hilarious and honest and it's the best. Thank you for being you. 🙃🙂", "hellomae": "♥️♥️♥️♥️♥️", "lettersandlettering": "You are one damn cool lady to be able to share all that. I wish you all the happy smilies on your nails & here's to making it to Tuesday ❤️", "oh_jay": "❤️", "jade.lev": "❤", "tawnyatea": "Not much I can say since everyone else in this thread has said it so well. It's weird and wonderful and terrible all at the same time how social media can bring such a crazy juxtaposition between love and hate, but you've always been such a funny, real and refreshing part of this scrolling universe we spend so much time in. Thanks for sharing so much of your true self in a world that makes us all want to rearrange our real lives into a well-styled picture. You make reality sad and wonderful and I wish you nothing but the best.", "bdomat": "@teresadesaro", "nettieandmin": "Sending you lots of love and light! ✨💓✨💓✨💓✨", "haleybtrippin": "I adore you.", "e.cast": "You're amazing and loved and I'm sending you another virtual hug to be here when you need it ❤️️❤️️", "miss_kristen": "Sending so much love. You will get thru this. You bring so much joy to others, and that is noble life's work. Peace will find you.", "jenhubbellphoto": "❤️❤️❤️", "skirt_chaser_superette": "You're a fucking queen, Jen!! Sending love from Florida!🙌💌", "bdossett": "I have been going through the near death of my younger brother and now through the detoxing of the parasites they found in him. It has been long and terrible, but you've helped me learn it's okay to share things publicly, and my therapist thinks I'm doing exceptionally well in these circumstances. Thank you for being such a badass lady boss we can all look up to. 💪 Sending you all the love from Atlanta 💕❤️💕❤️", "polisheddigital": "Really brave of you to share. A lot of women, including myself, need to hear that others are struggling and everything isn't always insta-awesome. Sending love and strength! ❤️💪🏽", "__taradactyl": "@jellytoastin", "funcult": "Sending you love and strength- I think you can snd should count your Indra friends among those little buddies to help you through 🙂💖", "lafillestephanie": "luv 2 u. this year has been p shitty 4 me too so yr not alone. sending good thoughts n all 🌿", "monamyf": "💖💖💖💖💖", "lizzie.mae_": "❤️", "shazkavaz": "I love your honesty. Sending big love across the Atlantic 💜💜💜", "elfisodyssey": "❤️🍭❤️🍭", "spicyguacamanda": "I am going through the same thing right now. You are not alone. ❤️", "meagan_hall_": "@jengotch you're raw honesty and colorfully esthetic and emotional posts are the reason I follow you. You bring so much life and truth to my feed. I laugh so hard at your posts and sometimes I cry with you. I follow you because you make me feel not so alone. I hope you know you're not alone either. You are so loved 💖", "katydebard": "Oh Jen. I'm so so sorry. That fucking sucks.", "plumcollective": "This is the part where you figure out who you are @jengotch. So many people are rooting for you. It won't always hurt this much!", "meadeac": "Thinking of you this week Jen. So glad you decided to share - sending all the support and positive vibes your way. I wish I lived in LA to give you a giant hug!!!", "jesserker": "I'm so sorry, Jen. Sending you love ❤️", "ginarockenwagner": "I'm so sorry to hear this but know you've got support and it's ok to perma cry! ❤️", "cheri1964": "Sending a {hug} 😥", "rrrrriojas": "💔❤️", "lkimby": "Females are strong as hell. Sending love from the east coast. 🌬", "manthsrussell": "💜💜💜", "americangarage": "@jengotch 💪I got yo back💪", "erinleighbrown": "we will all be lining up to take you on dates!", "_elizabethmaria_": "One day at a time! 😘😘😘", "jeccamullen": "You are impressive, Jen 💪🏻", "megusoup": "@caseymariemoc so cute 😊😊😊", "explorecreatewonder": "You are an inspiration to us all, keep your chin up. You kick ass at life. ✌🏻️✨", "ddot": "I just want to give you a big hug. I've known you through your blogs, polas, flickr, FB, insta, and snaps and I know and adored of how you've shared the love you have with your Andrew. To say that you still feel that love grow makes me know that you'll be ok even through the really shitty parts of this new chapter. You'll do alright Jen, but know that on those rough days you have all the love to help you through it.", "lifeunstyled": "So sorry to hear this. 2016 has been the shittest year ever hasn't it? I'm going through a similar thing and I'm dying to be more open about it, but my kids are on social media so I have to self censor. You're amazing and you'll get through to the other side but the journey through it is fucking horrific. 😘", "13mimosa": "I'm so sorry to hear this. You are so loved and seem to have incredible support all around you. I know it's not everything, but it will carry you when you're low. I'm in Melbourne Australia and had to leave a loved one in Canada years so know how real the distance is. It's super tough x", "parishousenz": "Beautiful manicure and beautiful honesty. Thank you for sharing.", "caseymariemoc": "@megusoup smilies 😍", "meredithdozier": "💖", "ironchefolivia": "You're amazing & inspire me everyday! ❤️😊", "heidiplant": "💎🙂❤️", "marimarianamedeiros": "I'm sure all over 2.000 of us you be here to support you and give you many many virtual hugs 🤗❤️", "thejoannaproject": "Doing what's best even though it hurts is the hardest kind of situation I've come across. So many conflicting emotions... Adding to all the other thoughts of love and support here xx", "xantheb": "Sending you all the love ❤️", "themarvelousmary": "Love you, Jen ❤️", "celesteandseb": "You are empowering, amazing and overall such a strong badass woman. Thank you for sharing what some of us wouldn't dare. Sending all the healing and love.", "allyb_021": "😚😚😚💜💜💜", "lookbackwithwonder": "Honesty is so refreshing and beautiful. 💓", "klassizistisch": "We are all supporting you no matter how rough your days are right now! You rock and are awesome, forever and ever.", "hannamoens": "❤️", "frostingandfringe": "Sending so many ❤️❤️❤️❤️", "jenny_been_": "Oh @jengotch that's sad and sucks. All the ❤️ for you and Andrew xxx", "inspoandco": "You got this babe 😚 sending good, goofy vibes your way!", "palomacorzo": "You got this! @jengotch", "ashleygoldberg": "❤️❤️❤️", "jillianraes": "@jengotch thanks for your honesty Jen!!! Praying for your heart woman!!! #allgoodthingswillcome", "catherinemasi": "@jengotch hey, lady. I will say that a beautiful friendship after divorce is fully doable. I've got one with my ex-husband and it's been life-changing, transformative, and freeing. The love and respect grows in the most profound ways. The trickiest part for us was finding ways to cope with everyone else feeling uncomfortable with it; but it all eases and you'll feel at peace not too far down the road. Sending hugs💜", "lilad": "Sending love your way. It will be the hardest but also maybe very very rewarding.", "teghanelizabeth": "It's crazy how much I can relate to what you're going through right now. I even got a happy little manicure last week, mine is chubby lil ☁️'s. Struggling with severe depression and anxiety is hard enough, so adding heartbreak on top is just the shits. My motto through this past year has been to take everything 10 seconds at a time (yes I stole that after I binge watched Kimmy Schmidt on Netflix). It's not like I sit around being self soothing and counting to 10, but when you suffer from massive anxiety, the idea of allowing yourself the space to handle only the littlest bit at a time, does feel better. I tell myself - \"ok girl. You don't need to think about anything further than 10 seconds from now. Shhhh it's okay 💘 you good. You poppin.\" Sending you so much support, and so much genuine thanks for sharing your feels. It helps me more than you know 😘", "dbuerli": "❤️❤️❤️", "seripiavani": "Hugging you loads ❤️", "amysayerp": "😘😘", "matteaberit": "💗☀️💗☀️💗☀️💗", "mrlaurenhill": "You are without a doubt one of the most inspiring people I know right now. Thank you for sharing the shitty times with us so we can all feel normal and talk about it like adults. Also, your \"annoying\" optimism is right. Things will work out and we all have your back! 🙌❤️", "anticipationevents": "Hang the fuck in there. (Technically speaking.) ❤️", "krystlefrey": "sometimes it just feels like it's going to ruin everything and then all your left with are your tears. so sorry you're going thru this.", "rebeccaholopter": "💕💕💕", "cassieterrazone": "❤️💛💚💙💜", "lisettevandegraaf": "Sending hugs, love and smileys your way 💛", "rikkiannevk": "I ❤️ you Jen Gotch 🙂", "thelovedesignedlife": "oh I was afraid it was to do with Andrew! you guys at the cutest! sending so much love your way. ❤️❤️❤️", "ggiampagrimm": "Sending love and light! ✨💛✨", "_kati": "❤️💛💚💙💜💕", "heylaurabug": "❤️❤️❤️", "emilymcboyle": "😿❤️", "nicolecostello_": "Sending you so much love 😘 every cliche in the book is relevant for this and I'm sorry", "hellokellye_": "I don't know you, but I think you're the shit @jengotch ❤️👍🏻💯💩", "seemachiodo": "💗 you are a brave soul! 💖", "skolesar": "Sending all of the love. 💖", "theresamoshier": "You is kind. ✨You is smart. ✨You is important.", "shizmcnally": "💙💙💙sending love, Jen.", "floradesigns_taralouise": "Such a tough time for you both. Life can be shit. Healing vibes to get through it 🙏🏼", "ohhappyday\nVerified": "Verified", "anniepanniepanniep": "Just wait til I get back on Thursday 🎉🧀", "clurrrick": "Sending good vibes today, Monday and everyday 💗✨💪🏻💕✨👍🏼💕 you are an inspiration to us all!", "foundbykaty": "Big love to you, Jen. Thanks for trusting us social media people and for always sharing so much of yourself. 💕 you're a real gem. xo", "hello.lilyellis": "💛💛💛💛💛", "kitiyapalaskas": "Sending heaps of good vibes your way! Well done for posting so publicly about what you're going through, it's a very brave thing to do! You're an inspiration and I wish you all the best xx", "maddynye": "💙", "rachel.rosenbloom": "sending love 💛 you're incredible.", "keastew": "All I can say is thank you for sharing. I went through a very similar thing not that long ago, and you've made me feel less alone, despite the fact that I don't know you personally, and this world can be lonely sometimes. Sending all the good vibes possible this week 💪🏼", "roxane.gagnon": "💚💛💙💜", "jaimibrooks": "I'm sorry for and Andrew but that's a big deal and courageous to both do what's best for you individually even if it means not being together. Life is short and I'm excited for your new chapter. Xx", "ginghamgirlgreetings": "I'm sad yet oddly hopeful for you, Jen.", "itsmetolf": "Honesty can be an incredible and empowering. Embrace it! You got this!", "laurenmnorton": "Sending love and peace your way ❤️", "rebmagee": "So sending you so much ❤️☀️", "ashleydcrowe": "I will be sending all the good vibes I have to get you through Monday. Here's to Tuesday, a fresh start, a new chapter. ☺️", "schweetie118": "Brave. That's all I can think of...geez, she's so brave. One of my main gripes about IG is how everything is SO fricken perfect!! Perfect outfit, perfect vacation, perfect family, blah blah blah. 👏🏼👏🏼👏🏼👏🏼 to you for talking about your depression. I enjoy your feed. At the top of my list is the cookie video. Hilarious. Chelsea Handler has Netflix. IG has you. Sending a hug! Catch. ❌⭕️❌⭕️💋😘😘", "mommymatter_": "I don't even know you Jen, but I love you. Your snaps make me laugh and bring joy to me. It's nice to see that your human. If I ever see you around la I will run full force and hug you. Hoping to meet you someday. You are a role model to me. Sending lots of love and ✌️", "vintagerosegirl": "Sending you lots of love and strength. You got this. Even when you feel like you totally don't got it. You have an incredible number of people on Instagram who are rooting for you - through the good times and the bad! And ditto to what @escapadesofmissy said. You'll definitely be getting a bear hug if I ever see you in person!!! Lots of love from Florida 💚💚💚💙💙💙", "kissandmakeupartistrypdx": "@escapadesofmissy - absolutely 100% ditto. @jengotch, you are one complete ☀️ and are my professional icon. I applaud your bravery and it shows just how incredible of a person you are. Sending you tons of love and positivity to you and this new chapter. You are going to kick ass and all of us here \"GOTCHa\" (see what I did there?) back. 💋❌⭕️✨", "hello_candice": "Thank you for sharing so much of yourself with us. You are an absolute inspiration.", "hannahsoffa": "love you 💕", "ilootpaperie": "❤️ you always rock.", "brokenmolar": "Thank you for putting yourself out there. I see you, fellow human, and I love you! 🙌🏻 I believe in you!! 💖", "honeyofalife": "❤️❤️❤️ Sending you lots of love and support! You are so strong and right now is one of the hardest times. I know you'll be ok, better than. One of my favorite mantras to tell myself is to \"trust the timing of my life.\" It helps me when times are really hard and it reminds me that I'm going to get through it and all the hard feelings are going to pass. I know you will too because you're a rockstar and you can do anything. ✨✨✨", "kateflynnn": "You're the best. Much love to you - after following you and thinking you rock for years.", "chillinkristen": "❤️❤️❤️", "sarakaye": "Here for you in the biggest way. 💕", "thealisonshow": "Much love to you my Polaroid blog. You make the world better.", "tarawhitney": "I think you are wonderful. You can do this. Lots of love.", "lindseyobergstrom": "@jengotch here for you!! Us FSU gals stick together 💜❤️", "by.courtneylene": "Your courage to share is incredibly admirable and I myself, am thankful. Sending positive vibes your way. 💖", "courtneythesavage": "You bring so much joy to so many people and I'm so sorry you've felt so much sadness this past year. You'll pull through! Seems like there's a lot of people on the internet and beyond who really care about ya 😊", "estherolsson": "You are super amazing woman! Role model for young boss babes💪🏽 sending love! Also your snaps make my day ,week, month & year", "andthenagain": "I appreciate your courage and candidness. Your are an inspiration. ❤️", "kimcee13": "Sending lots of love, light, and positive vibes your way. Thank you for sharing and letting those of us struggling through our own shit know that we are not alone. And neither are you ❤️❤️❤️", "rankandsugar": "Well, I'm totally rooting for you. I'm gonna have a pretty heavy day myself on Monday... 1 yr anniversary of the day I found out my 20 yr marriage was most definitely over. Somehow these endings are also most certainly beginnings. So feel all of the sadness & loss & grieve but also know there is opportunity & growth and a shift that is happening for you. Take what the universe is offering in this moment, know it always has your back, and that you are most certainly not alone. You are exactly where you need to be. Rise. You are so good. You got this...", "wyatt__p": "❤️❤️❤️ You got this, lady.❤️❤️❤️", "sinarichert": "I don't fully understand what you are going through by things can get better- they have for me. After nearly a year I'm finally feeling like a persona and like myself again. Like I have the whole world in front of me. I wish you all the best! You're in my thoughts @jengotch !", "theoverduebook": "💕💕💕💕💕💕💕💕💕💕💕", "grassfedsalmon": "I now appreciate your hammock snaps even more now 💔 you will land on your skates, wishing you love and strength.", "shelbymsloan": "As I sit here typing this on a phone encased with the most beautiful rainbow shine star heart glitter snow globe cell phone case of my dreams, that I tip back n forth when I'm stressed, that makes me feel a whole bunch better when I feel down, I can't help but know you (a person I don't know, but much admire) will be a-ok. That's a hard thing, one of the hardest. But a person who can bring so much good stuff to so many people, honestly can't help but come out on top. I have one of those pesky optimists inside myself too, but I say let her get a word in. Like moms, even when ya want her to shut the f up, it's usually good advice. Heck, I feel like she's the one that brought my glitter-snow-globe-therapist to life! Best best to you ✨💖✨", "meghanalfano": "@jengotch lots of hugs and cookies and laughter anything else you need 💖💖💖", "jillyhennessy": "jen, here for you if you need anything,bummed I'm out of town this week. I'll send you triller videos from NY. ❤️❤️❤️", "mor_e_gon": "@jengotch I know if we met in real life we'd hit it off...maybe it's because we are both 45, but I relate to you on many levels...so much so that my family teases me about my \"cyber friend Jen\" and my husband asked me if I was going to invite you to my birthday party...😆 That being said, I admire you on so many levels...your passion, your successful business, your totally 80's roller rink style & most of all your sheer honesty...from your silly snapchats to posts like this...in a world so \"styled\" and social media perfect...it's refreshing to see some hard core honesty. I wish you strength as you move forward into this next phase of your life...you are amazing...thanks for being you 😊", "_chandlerrobin_": "Jen I don't even know you but I love you. Thinking of you lady❤️️", "sleepymountain": "❤️❤️❤️❤️❤️💔💔💔💔💔💔❤️❤️❤️❤️❤️❤️", "thisthatblog": "so sorry jen. ❤️", "aponiewaz": "Your sharing helps people. Like, unrelated and not to minimize your post, but it did help me buy those roller skates today. I sincerely wish you guys both the best. The (universal) girl gang is rooting for you!!! ❤️", "thisisnttori": "You're so amazing, you will be okay. Sending love your way.", "jackieberretta": "So sorry for this terrible time you're going through. Sending you positivity, love and 🙂🙂🙂", "tulajeng": "Forever hugs to you and Andrew. I'm so sorry this has been such a hard year for you. Only four days without tears? 😿 I hope much healing is ahead. It will be. 😽💕", "blingwald": "Awww thanks for trusting us with your heart 😘", "salt_tooth": "You have a pretty huge fan club, and we've all got your back. Sending love and strength to you both.", "sarahmiranda02": "Sending hugs your way! Thank you for your raw honesty, may you continue to find your path. You are amazing!", "laniako": "love you 💘", "igs_studio": "You don't always have to be strong and positive, but sometimes you need those around you to help you through some dark times and get you to the other side. Monday will be a bitch, but we are all here to support you. You may feel lonely but you are not alone. ❤️", "anemilyb": "Sending 🙂s and xoxos your way right now. What else can we do to help? Would some cookies help? Or a casserole? What about a cookie casserole?", "kristenhutchinsdesign": "Sorry sweet Jenni. All my love to both of you.", "photolexx": "Sending you all the good vibes you beautiful human ❤️✨ Thank you for always being open and honest and so incredibly inspiring.", "mjack3412": "😘", "denarochelle": "Sending so much love your way 💕", "lauraplouzek": "💔💔💔 the optimist in me is excited for the optimist in you, but the rest of me wants to send you a pool full of hugs.", "kaysujin": "Endless hugs 💕", "kellectedhome": "💟", "amandaglynn": "❤️❤️❤️❤️", "dearjovial": "I love you! 💋", "haley_sturgeon": "I'm so sorry.", "morgan_wyenn": "Omgosh that sounds so super hard. Sending you big big hugs.", "everglowhandmade": "ugh i am so sorry for all the pain going through. thankful there are spots of love. sending you all the 🙂🙂🙂, esp on monday 😘", "kaileemarae": "🙂❤️🙂❤️🙂❤️🙂❤️🙂❤️🙂❤️🙂❤️🙂", "the_robinski": "I kept looking for your wedding ring and wondering if that is why you were sad and you still had it on. Then you went on a vaca and he was in your snaps and I thought ..it's ok. But now I find out my women's intuition was right and I'm so sorry. We will all be here for your grieving and supporting you. Thank you for being you, you are one of my favorite people that I have never met. Positive vibes and lots of Tate's!", "teamwoodnote": "ohhh girl. as a fellow \"married to an aussie\" club member who often has a lot of excruciating conversations about, \"is this actually working? do we love each other but need to live in our own lands?\" my heart is breaking for you. i can't pretend to know the ins and outs of your specific story, but i sure am sending you love.", "theseaandsweettea": "You are such a fun and wonderful lady. I can't imagine the sadness you are feeling, but know you are such an inspo to me and so many other girls (and probably guys) out there!", "nikkideroest\nVerified": "Verified", "a.stonefree": "Thank you for not only addressing the struggle of depression/anxiety but life as well. The Universe knows & believes you can handle this, which you will! Nothing but positive vibes from me to you.", "sugo2go": "Hugs and love to you @jengotch", "chubbybadass": "@jengotch sometimes your whole world goes through the ringer. and while i'm impressed you've shared some of your plight on here this post was incredibly personal & downright heartbreaking but amazing at the same time. starting fresh is always terrifying but even with the sadness like a cloak wrapped around you, i still think you're going to have many wonderful surprises ahead. sure as shit it will be tough, but i have every faith in you and your new life. & hey if that's not enough just know there's this short chubby girl here in nyc that's totally rooting for you. you got this, i know you can. 💗", "kaitsherman": "You are one brave 🍪 and a true inspiration. One foot in front of the other.", "avenuedee": "❤️💪🏽", "legs_luther": "Good things do come from bad things. u seem to be surrounded by a bunch of super meaningful relationships, they will help carry u thru the shit storm. Sending u a fuck ton of positive vibes girl. 🌅🌈🔮", "calliopepaperie": "Oh honey...", "suzannewithaz": "💖💖💖💖💖💖💖", "djangozamora": "You still manage to stay funny even if you're having a tough year. Let me know if I can send you some of my crispy brown butter chocolate chip cookies w/pecans and sea salt. Hang in there. It may take time but you'll get through this.", "shureenuh": "This just soldifies your place as the most inspirational role model human in my eyes. Sending love and kind vibes your way *and to Australia* 💞💞💞", "sausage_and_peppers": "Best of luck to you and Andrew. You guys have always been #goals. Even though the relationship glimpses have been few on social media, the times you have shared over the years have always seemed comfortable and genuine, and that is nothing to sneeze at, girl. You are brilliant and funny and surrounded by love in so many ways. Sending you all the crystal healing powers in the world. Give yourself time and space and permission to ugly cry whenever the fuck you want to. 💕", "miriam.vegac": "❤️❤️❤️💖💖💖💪🏼💪🏼💪🏼", "sarah.e.marley": "Sending love💕💕💕", "elizabethyeazel": "Lots of love to you, @jengotch 😘", "rhymeswithfun": "Hugs ❤️", "streicherhair\nVerified": "Verified", "jess_gerweck": "I've always been a quiet follower who's often felt like she totally relates to so many of the things you say and feel. You are truly inspiring in such an honest and open way. Sending light.", "totalrapture.me": "Girl, your honesty 🙌🏼🎉 feeling all the feels for you 😥 sending love to LA! 💕", "btoshner": "Dude, you're so strong. Sorry you're hurting. (Sedona's good vibes vortex is calling your name.) Much love to you in this stupid shitty time.", "getmeacampari": "💘✨", "green715": "Hugs, kisses, love and peace to you!🤗😘💛☮️", "idreamofkelly": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "takeamegabite": "All da love for you! 💖💗✨💖✨💗", "lovelyparcelcompany": "💅🏼🌼💕", "melodytaylorr": "Jen, I am so, so, so sorry. I feel for you, I really do. Anything ending just sucks. Thank you for being so open and human and beautiful. Hurt and pain can only ever turn into something good. It can't last forever. I'll be thinking of you on Monday. ✨😘💜", "taylormarieparker": "😘💪🏼💪🏼💪🏼", "yay_driana": "Love to you", "lowcountrydesignstudio": "Sending hugs and love ❤️ ❤️️❤️️", "holidaypalms": "Sending love and a time machine to get through the crap. You are an inspiration. ❤️❤️❤️", "mcbauman": "I'm so sorry, that is so hard, you are amazing! Thank you for being so inspiring 😘", "kgathany": "Crying with you. I'm going through something similar... not sure if we're going to split yet, but it seems likely. It's so hard. You are brave and strong for sharing.", "dana_fernie": "Sending you so much love. 💕", "shout.and.about": "Sending lots of love your way ❤️", "christinawinkelmann": "Plus, I'm here for you.🤗🤗", "verywryly": "BOSS BLESS UP AND STAY LIT 🎈", "honeyandthehive": "Oh you sweet lady. Sending hugs your way, thanks for being a bad ass boss and inspiring me in so many more ways than one. Life's an adventure, get ready for your next one - all of us are rooting for ya! 💖", "belindaleegrant": "I'm hurting for you. Not that I expect that to be any consolation. But know that we're all feeling for you and sending positive loving vibes. And to Andrew also. I didn't realise he was from Australia, but we'll take care of him over here 💜", "darcydubose": "So much light 💫 and love 💞 to you Jen! 🙂 You're such a sparkle in this maddening world, so know you've got so many positive vibes heading your way 🌬 #pinkskiesahead", "lizz_robinson": "💞💞💞💞 >> I like to think of these as virtual hugs. ✨ sparkles for ya too. You are such an inspiration and your transparency is so fucking refreshing and awesome.", "mrsjennamartin": "You're inspiring in every way - and even in difficult times, don't forget you've got one hell of a supportive squad. You pick us up and sparkle our world in smiles, goofiness and multicolored glitter. Hugs and sunshine for you every day, but even more on those difficult days. 💖", "erin_hulse": "💕", "bstefanides": "💛💛💛", "mssarahward": "Sending so much love and joy to you. We all get so much of that from you and your beautiful vulnerability and honesty.", "allegrab": "Wow u are a gem of a person. Seriously.", "stephschofield": "Everything is going to be ok. ♥️", "shoprkitekt": "Sending you a bucket of hugs!", "queensvein": "Thanks for sharing and lots of hugs and positive vibes for you!! ⚡️🤗", "chloe.h.h": "💕💞💕💞💕", "hollisanne_": "Sending all the hugs!!", "christinadeetopacio": "So much love to you. When something shines brighter, it seems to dull out the rest but it doesn't cause it to be less than, it just means it's the right time for it be appear more present in your life. The change will rock, move and shatter your innards but thank fucking goodness for love, your conscious and self-aware spirit and your ever-present soul. That, you'll always have, even in the darkest of days. ⚡️⚡️⚡️", "shopb.ca": "Sending lots of hugs your way. 💗😘", "jesslmangan": "@natdegaris", "longhornfashions": "This is so beyond tough, but you will get through this and come out better than ever because you are Jen. A creative, optimistic soul that so many people love. Everyone that loves you (including everyone following and commenting here) will be there for you every step of the way. You got this ❤️🍷🍕", "swlancaster": "❤️", "fetchbetchvintage": "💖💖💖💖💖💖💖💖", "kaitlyn.luckow": "Love you. Your heart is so full. You inspire me every single day and I know that you inspire billions of others as well. I know that's not going to help you feel better (depression is a total bitch that way.) but I hope you know how loved you are, even when you feel alone. Especially when you feel alone. 😘😘😘😘", "katiedeanjewelry": "Cuuuute nails and new beginnings. The future is bright 🙂❤️", "amberlovesjohnnie": "💔", "_trouble_in_mind_": "More hugs.", "colletteqwitz": "@jengotch I feel you SO hard. I've had an earth-shattering relationship loss that no one understands unless they've been through something similar, and even that's a stretch. Oh the crying. The barfiness. I'm so sorry for this loss. My \"whatever I should call him, but ex will never fit\" is my favorite person in the world, and it doesn't work and it's the biggest and hardest bitch. Lots and lots (and lots) of years and every young adult > real adult milestone shared, mostly happily. It think it'll be OK. You'll see more of yourself. There's a gift somewhere in that. It'll be better than OK soon. Visit old friends who you've lost touch with. I also found comfort in the conscious uncoupling book. It's a very respectful and dignified way to try and figure out ugly, shitty, major breakdown stuff. Love to you, you Stone Cold Foxxx!", "sweethannahpea": "Sending you all the smiley face nails vibes. Hope to see you with pink hair as you begin with new chapter in your life. 💖💖💖", "perimcguire": "I've followed you for almost 2 years now and from what I can tell (from just here + snapchat), you're a strong badass lady and things will be okay! Thanks for always being such a joy to brighten up my sad days, even if it is a silly snapchat rant or a beautiful disco ball pic 💿💗🗯", "erinoliviaclare": "Sending all the love in the world. 💜", "napakettu7": "Jen!!!!!!!! Biggest kisses and hugs to you. Keep on truckin, you beautiful soul. And remember: you're never given anything you can't handle. 💋", "men.lop": "jen. we are here for you and for andrew. keep being you. keep the emotions real. keep sharing your heart cause we will keep listening. much much love.😘 you are strong, smart and very brave.", "_hay_tay_": "❤️", "stacjwong": "💖💖💖💖💖💖💖💖", "mekeesha": "❤️❤️❤️", "mirandatanner": "Sending love and sparkly thoughts💗✨ hang in there", "emilyspemily": "❤️🍒🍔🍕thinking strong and lovey thoughts for you and him and your mondayest of mondays", "shtefani": "💖 your transparency is so inspiring. Thinking of you. This sucks, but you're stronger than it!", "oliveandjune\nVerified": "Verified", "lzpencils": "Thanks for sharing this #realtalk. Sending positive thoughts!", "maryannsbetter": "I instantly hit ❤️ on the image alone. Then I read the post and I cried for you. And maybe for me too. Thank you for being so honest and open about your life. I really look up to you and feel a real connection to you even though we have never met and probably never will. I hope you find comfort and joy sometime into this new stage of life. It will take time but you deserve those things.", "elauinc": "😢", "kendall_mckinven": "Thank you for shedding light on this. The word divorce always seems to be followed by negativities and blame. And while I am sad for you two, it's truly a remarkable compliment to both parties when people can stay civil during a break up.", "ettatorials": "Sending you the most massive amount of love Jen ❤️❤️❤️❤️", "mghnrssll": "💖💗💘", "ericaguider": "😕", "stephanie_ehm": "Hoping that all your days are sunshine and rainbows because you never fail to make my day. 🌠❤🌈 your social media family is totally here to lift you up!", "wunderkimmy": "😭😭😭😭😭😭 JENNNN 💔💔💔", "jcavalli": "So sorry! Been worrying about what was going on. Life can be so rough sometimes. Hang in there! 😽💕", "tessrafferty": "Sending you all the love and light in the world. This sucks right now but there are so many people who have your back. 💕💫💗✨", "road142": "Big hugs!❤️😘", "tahinigirl": "You are too cute and too authentic. It happens to all of us. Life. You're still awesome thou.", "rimatakesphotos": "❤️❤️❤️ sending you all the 😊 and best vibes ✨", "hereforalexis": "Sending love. I can even imagine. If it helps at all, your snaps are a bright spot in my day. ❤️", "corkymaria": "💔", "genevieve_ksc": "Sending 💛 and 💪 your way.", "ari_lagace": "Oh my gosh Jen I'm so sorry your going through all this pain! You are in my prayers and lots of love headed your way!❤️🎈❤️🎈❤️🎈❤️", "checorpus": "❤️❤️❤️❤️❤️❤️❤️", "summer_lee3": "I think it's really brave that you are sharing something very private about yourself because you're an honest, creative soul who needs to communicate and connect with others and you're a leader. Best wishes from a fan girl in Austin! ✌🏼 🍀💜", "byashleyoneill": "love and light in this hard time. Monday is a new beginning, and it's going to be brilliant. sometimes it's better to be an annoying optimist. they're usually the best at transitional periods 💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼🙂💅🏼✨", "jrschoen": "I don't even know you but I love you and I'm so sorry.", "anafetch": "💖💖💖💖💖💖", "estrellasforplin": "❤️❤️❤️❤️❤️❤️❤️", "alicia_johnston_": "Oh Jen that's so sad. Thinking of you and sending internet hugs xx", "opinionatedjacqueline": "I'm so sorry. Sending you lots of love, blessings, and light! ❤️", "avibeygirl": "So much love to you lady.", "mvpkoi": "Aww that sucks! Everything will get better keep your head up. 💖", "holaandrea": "Jen, I admire you and your creativity on expressing things differently 🙌🏼 I hope someday I can achieve as many cool things as you do ✨ you're an inspiration 🙂 a real one, sending you the best vibes from 🇲🇽💥", "romeroymiel": "Positive vibes your way ❤️", "jesmerson": "💛", "rebeccalouisey": "@seglines @tmillerpoo 😭", "muneca_de_trapo": "Also, I really love you and those little guys.", "annawestbury": "What @katierspurgin said! We will send you tates and olive and June gift cards!!!! Love to you best boss lady! ❤💙💚💛💜❤💙💚💛💜", "dmb.317": "@jengotch you are so brave to share your feelings, especially on social media! i'm sure i speak for all of us here when i say...you've got a friend in us! 😄 it's been so much fun getting to know you (as much as one can know someone on instagram and snapchat) and i look forward to what's to come. sending you smiles and hugs! 😍🍦😍🌮😍🍕😍", "_nathaliemartin": "Send you love girl. You can do this! 💕💕💕", "ereditajournal": "❤️❤️❤️❤️", "_janelson": "I love that you shed a positive light on this... The D word doesn't have to reflect hate --it can reflect the greatest love and kindness too.... Still so painful though. Sending you lots of love 💛💛💛", "joellen_randall": "@jengotch this makes me sad and hopeful. Life is so fucking hard. Nothing but positive thoughts heading your way.", "katierspurgin": "Tell us where to send the Tate's 🍪🍪", "wearelittlebohemia": "❤️", "mama_roboto": "You are an amazing, badass bitch and I love you for being so open with your struggles. Sending positive vibes your way.", "amanda100lc": "Sending 💪🏼💪🏼💪🏼💪🏼x💯", "studio_sue": "💖💖💖Big hugs 💖💖💖", "helloimdylanlowe": "You got this lady.", "etwas_interessant": "❤️💪🏼✨", "cpetratis": "\"Whenever you think it's the end, it's probably just the start of something else\" - @jengotch #AndSomethingFuckingAmazing nothing but love for our favorite boss lady @ngalanti", "kathrynfitzsimmons": "❤️❤️❤️", "1800rocha": "💅🏽💃🏻💪🏼 sending you strength! You are such an inspirational person. We really admire you & I appreciate your tone in presenting this--Louis CK says \"the great thing about divorce is no good marriage ever ended in one.\" Keep on swimming, mama. ❤️", "amitypm11": "❤️❤️❤️❤️", "kerrycrawford": "❤️", "sophieandlili": "Sending love 😢❤️", "northwest.space": "You are a badass babe. Tuesday doesn't even know what's coming 👊", "karilynoettli": "Sending you love. I couldn't imagine the pain. 💛", "chelseatucker": "❤️😘 to you, wild woman!!!", "imlauramiller": "love you", "lonirubes": "❤️❤️❤️", "lyndaevers": "Sending peace, strength and someone to bring you unlimited McDonald hash browns!💪🏼💜💪🏼", "lacsonlacsoff": "You're such an inspiration. You don't even know how many people you have helped by just being you! Sending you love and good vibes 💕", "rclayton\nVerified": "Verified", "iheartleith": "❤️ and 🤗", "saramoon": "love love and more love is surrounding you💞💞💞💞", "che_marie": "Yeah, that word sucks... Even when you're \"in control\" of it. #herewego", "bcavaz_04": "Lots of love sent your way Jen ❤️✨", "positivelypresent": "Keep listening to that annoying optimist!! #annoyingoptimist 🙂😚", "alliwebb\nVerified": "Verified", "daisynatives": "You're a rockstar ⭐️ sending you lots of love", "thatgrlpayton": "You're wonderful ❤", "akuhlke": "@lindsmb11 @la_redmon @annam886", "designlovefest\nVerified": "Verified", "heatherldownie": "💕💕👏🏻👏🏻", "caseybrodley": "I hear cookies help. 🍪🍪 Sending you love, @jengotch. You're my hero.", "bneatobar": "Lots of love coming your way ❤️ stay strong 💕", "erinlovellverinder": "Sending deep love for your next chapter x", "kisskisstangtang": "❤️❤️❤️❤️❤️❤️", "allisonmadi78": "Thank you for sharing. You have so much courage.", "gauxvegan": "This is adorable - sending the best vibes your way 🤗✨", "melodymargarit": "💕", "clothandtwig": "Sending you all the love, good vibes, and 🙂🙃🙂", "yliimeee": "here for any and all hugs you need", "loveloveandcupcakes": "@jengotch Jen Gotch, I love you. I love you so much!! You are perfect because you're imperfect and that makes you such an inspiration. Look at all these people supporting you and remind yourself that you will never be alone 💕💕💕💕 xxxxxxxxx", "sfgirlbybay\nVerified": "Verified", "sofiamuscatello": "you're the best. all of your followers love you so much and will be here for you monday and beyond! one day at a time 💕", "meanthingkate": "You are super strong, and it shows in everything you do. Thank you for sharing even though it's raw and heavy, it means a lot to all of us, too. Thinking of you ✨", "hevrtweez": "💕💞💕💞💕💞", "alyssainthecity\nVerified": "Verified", "trueliejulie": "Everything is going to be okay 🌷", "anahsohsd": "❤️❤️❤️❤️", "brookefitts.photo": "You're capacity for vulnerability like this is so brave. Thank you for that", "valleycruisepress": "Sending you lots of love!", "sprinkledlife": "So much love to you, dear heart! 💗", "daisychaussee": "You are so strong and brave! Sending you love", "craftylittlesquirrel": "@jengotch you're amazing and brave and cool as hell. Thanks for your honesty.", "jodimckee": "xoxoxoxoxoxoxo", "hellokeshia": "❤️+✨", "allimcbutter": "If it means anything, I love that you are able to share the good and bad with us. So much of the time, all you see is happy perfect everything around here, and it makes me think I need to be that way and it can be exhausting to keep up that facade IRL. Ugh and then I feel bad about feeling bad bc other people have it so much worse than me (I see cancer patients every day) but still... Anyway I guess it's all just to say hugs and vibes your way 💗", "jen_dowell": "Cheers to Tuesday, your new chapter and your bravery in sharing real life. ❤️", "annalemaycreative": "You're a gem and peach and a ⭐️", "studio__start": "#yougotthis x", "teruterubouzu": "And I am so sorry this sucks so much, but thank you for being real", "alilabelle": "you can cash in on a hug on tuesday if you want", "laura.gwinn": "we're all here for you Jen. 💗", "rosehoundapparel": "Aww!!!", "jlcan36": "Thanks for sharing so publicly Jen...depression is such an easy pit to fall into and its hard to crawl back out..pretty soon you will be back to your humping self which always makes me laugh 💕 ..hang in there pretty girl @jengotch", "ghostgoods": "❤️"}