{"floralislands": "A bit late to this, but 👏🏼 for just writing these words in a public space 🙃", "klevergirl": "Wow, I thought I was the only one to ever do this. I have a portrait of myself (ok, fine , a selfie) I took on my 30th birthday and also on my 34th birthday when I felt those exact same feelings you mentioned. I wanted to remember what I felt like at those exact moments. My 35th birthday was a couple of weeks ago and fortunately I didn't feel this misery. But something about looking back at this portrait will be cathartic and will even bring a smile to your face in the future. I promise. Happy (?) birthday!", "somethinginfrench": "A lot of respect for you ❤", "calledoutliving": "B R A V E 👏", "roshanay": "It's my party, I can cry if I want to🌸 @jengotch", "torimellott": "❤🎈", "marneyschaumann": "Try this amazing meditation, https://m.youtube.com/watch?v=f1Jh5svgJ3Y", "alliekushnir": "I get it.", "pingle_pie": "This always!!! 😘", "hannahwiththelipstick": "@lauren____elizabeth she is seriously the shit. @jengotch you rock", "lauren____elizabeth": "@hannah_with_the_lipstick right? her realness will make the whole world smile.", "lauralorena86": "👌😘", "klaupersen": "i love you and your colors, and your style, and your work... you're such an inspiring person ... <3 i send you all good vibes and love from the little lost town i live in.", "vampireyoga": "I'm about to turn 28 I can SO relate to this feeling ❤️", "j0ymoji": "Thank you for sharing", "chyparker": "You are our spirit animal. Just sayin'.", "stleonardsmoderngoods": "😚", "dvandylion": "Thank you for sharing this. You are magical and you have touched my heart. As a woman who also suffers from debilitating depression, it is amazing to me to read this honesty and still see hope. Sending you caring genuine love and support.", "huxleyhousevintage": "@ferminaliseauxdelamancha i mean...funny thing is, i take portraits of myself just like this when im crying lol. they dont look as good. but i keep them. dont know why", "nawazsa1": "How does one take a selfie when they are busy crying. Attention seeker.", "across_all_lines": "Thank you for your bravery in sharing your experiences, even the super tough ones. Your willingness to be vulnerable is healing to so many. ❤️", "donnad60": "Thank you for this and making it ok not be ok all the damn time.", "lexrambler": "RADICAL MAGIC WOMAN💓🌈 thank you for opening the space to talk about it ALL. Vulnerability is my jam ! Amour your way, Lex.", "sobremesa.zam": "💕", "lizzylou56": "I love that you're real! I have felt all those same feelings in my own way. To hear another express them makes me somehow feel more sane and normal. Xo", "sanquariius": "Thank you for this. You got this. And so do all of us. #inspired #feelingencouraged", "victoriabatrel": "It's not a bad thing feeling bad, it's part of the cycle, it's a sort of renewal, rebirth through the water of your tears. Feelings are beautiful, no matter how they are, they are energy, sadness is just a different energy. And when it's over, you will see things in a new way, do things in a new way, be wise, evolve. It's just a point of view among many, i had to share, sharing is love, and we need that in this world. Peace, and Pura Vida everyone ! ✌🏼💖🍪", "jordanhefler": "But your shirt tho", "hotpieceoclass": "I call these days my \"diablo days\" - the days when it seems like the devil himself has gotten into me and I just can't shake him, no matter how positively I talk to myself or how many gratitude lists I make. It's like someone is inside my head, slamming me all day long with the worst things I can feel about myself and my life. On these days, I just try to make it to bedtime and hope for a new day. And usually, it comes. A brand new day! Thank god for that, right? Thanks for being vulnerable and showing me that I'm not alone in these days :)", "ninaelenbaas": "💕", "takeamegabite": "Love you, Jen. Ur a unicorn dream!", "whitney.a.cooper": "Beautiful & so inspiring", "mayraq421": "🌎 ⬆ ⬇ 👍 💃😀 =💞❤💕", "likepoetry_store": "🌳🌳🌳🌳🌳🌳🌳💕😘", "coalandcanary": "😘😘😘", "rosiewonders": "❤️", "theswanksocial": "Stay strong, girl! I was having a moment last night too. It only goes up from here. PS: hope your birthday was amazing! ❤️🎉", "beachlovergirl": "😘😘Happy Birthday🦄🦄 Been there done that & you deserve HAPPY! Especially on a birthday!!", "kelsietherex": "Love you ❤️", "aknightster": "@tbm214nessa @idyllt @heatherhkgram She always keeps it 💯! Totally admire her.", "rosalievoortman": "❤️", "saraamo": "@wigsandkeys @jedshireman sometimes this", "_judyteen_": "❤️", "staceyelyse": "Love that ur real. Xo", "melanietouchstone": "@reganbrant", "reganbrant": "@melanietouchstone 👍🏼", "jennytarauphoto": "You are so loved.", "anniblle": "You inspire all the lonely girls like me to be happy.", "jevisavienne": "Wow and thank you for this. Especially on Instagram it seems that the human experience is just glitter and fun. Sort your things out girl! No one actually deserves any of those things you mentioned. 💛", "princesspeggles": "You are literally the most beautiful human. You have no idea how much you inspire me- and so many others. My best friend @oohraala introduced me to your Instagram yesterday and I can't stop digging through your feed. You're amazing. Thank God for creating you. Don't ever doubt that you are making a meaningful difference in people's lives that you've never even met! Seriously- thank you for being you. You're one in a million! 🦄🍭✨☄", "lizperezartist": "@jengotch Thanks for sharing 🙏🏼💜 There's nothing wrong with feeling sad sometimes. It's an indication that you feel, live, and love 💜", "spheresofsenses": "... thank you for being a human", "magdazofia": "Wow you're such a wonderful human", "goodjujuink": "Can I just say, I'm so proud of and delighted by the wonderfully supportive and encouraging comments in this thread. Here's to a new era where we ladies really look out for and empower one another. Jen, we \"gotch\" you girl 👊. Sending ❤️.", "edanarosee": "I've been following her for years I love her!! 🙌🏼 @kaylarayann", "anna__cosma": "💕💕💕", "whistlindell": "I hear ya, sister 🕶💙", "sabi0669": "😘❤️😘❤️🙌🏻", "jmanwag": "Thank you", "marjoleinrooijmans": "😄 normal & female. 😂 And a pretty arty picture too.", "nefer_beauty_": "I'm glad you shared. Thank you. ✨💗✨", "jesserker": "Sending you love", "evalynduke": "@mirandaraeblanks u need to follow herrrrr", "natplays": "Real! Feel feel feel feel and sending love and ease and new beginnings and shifts and happy birthday and a frigging awesome year ahead. Your voice and you're you are super inspiring. Thanknyou", "janice_ivins": "💗💗", "jpartydesigns": "THANK YOU xoxoxo", "seriousmomfun": "You are a gift.", "thecrybabyclub_": "❤️ I get this way on my birthday too. And well. anytime really. 😂❤️❤️❤️❤️", "rebelchipmunk": "You are amazing! I am continuously inspired by you, your creativity and honesty. ❤️😻", "decor8\nVerified": "Verified", "gemmifer": "{{{ hugs }}}", "lizdsgnsthings": "❤️❤️❤️❤️❤️", "rachelllita": "all the love to you, Jen. 💛✨", "emilyjournal": "I love you ❤️🏆", "glutenfreebeauty": "Sending love your way @jengotch ❤️ I know, esp w the parting of relationships, some days tug at your heart and just feel overwhelmingly painful. But it gets better hun, promise. I know you know that. But just wanted to say that aloud and to say you are RAD. Keep being wholly, humanly you. #allthefeels and all that. It will go the other way soon enough. Promise.", "brittanylester": "💛", "rockpapersizzle": "You're more amazing even than 🍕", "americangarage": "@jengotch turn that frown upside down 😞⤴️", "zatyness": "*hugggggg*", "nlongo22": "You are amazing...thank you for being real 💗", "katpfisher": "I love your little pixie face and your feelings (all of them) @jengotch", "say_hola": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "katie.ray.j": "Feel your feels. Thank you for sharing, sometimes life be a big ol' B.", "veeforvenessa": "@scottyhamp12", "alexandracollins26": "We all love you so much @jengotch !!! I saw you at Gloss in Silver Lake not too long ago and got seated next to you justttt as you were getting up! I wish I would have given you a huge hug and told you how inspiring you are! Not just with Bando, but also with who you are as a person. Whenever I feel like you are feeling today, I usually just go to Instagram or snapchat to watch what you have posted that day, because it truly brightens my mood. So thank you for that. Thinking about you and your family-it will get easier. Happy happy Birthday Jen!!!", "aylin5k": "Happy birthday and you are not alone my friend. I just feel like the same .", "jenclarke": "Your honesty is a breath of fresh air on social media. As someone who deals with HSP, it is nice to know that there is someone out there who can be honest about their feelings -- good AND bad. Have a wonderful birthday weekend!", "wyatt__p": "❤️", "kathhhattack": "Happy birthday and a big virtual **hug** ✨", "saramoon": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️to you everyday", "waamindustries": "Don't worry, @jengotch they're just feelings and emotions. We all have them and it's best to let them out. I'm pretty sure I cry once every three days due to many of the emotions you expressed above. Being a boss lady is hard! 💓", "autismoamor": "❤", "c.m.em": "@k8schwab remind you of anyone's bday ritual??", "k8schwab": "@cadencemcbrier 😂😂hi hello yep it me", "allthelovelythings_": "Love to you.", "designbysoniareis": "Happy birthday beautiful lady! We all been there and I promise you that everything will better after all! ☀️", "keelingreenberg": "🙌🏼💕🙌🏼💕🙌🏼💕", "ellie.f.parker": "It's my birthday too! Birthday twins! I've had quite a shit week emotionally and also have no right too, I have the most amazing friends and everything is going to be fine. Sending love and mutual birthday wishes!!!! 🌟💪🏻🌞", "kristerpelly": "Happy birthday Jen. You are amazing.", "shaleen1030": "Thank you for sharing this. I relate 150%! This was me last year on my birthday.", "naomi.liechty": "You are so cool and inspiring.", "emilylrussell": "Right there with you from afar @jengotch . though we've never met, we're still in the same boat. Feel better! Clearly you're loved and all of your admirers wish you well. Happy birthday. 🎈 and thank you for the honest post. 🌱", "horsefashions_": "Thank you for your honesty. I always feel down on my birthday and can totally relate to the guilt feelings that come with that.", "hostedwithlove": "Happy happy birthday! It's okay to feel all that. But just remember how loved you are by complete strangers! Keep being you 🌟🎂🎈💜💚", "imastabile": "💗💘💞🎈💝💖💕❣️", "aranzazues": "Keep on rocking! Happy birthday ❤", "foundbykaty": "You've got this. You are a magical human. 💗 Big hugs.", "ohhhkris": "😘😘😘", "msjuliejulie": "F that S. You are allowed feelings. Feel them. On your sleeve. Go down in flames. It's a strength. No apologies. I know you know that. But I'll say it again, your emotions make you YOU. You are an amazing person loved by so many. Seriously. 💕💕💕", "bailyslye": "💘🌷🍓❤️💅🏽🍷", "jvla1975": "Happy birthday!", "lizardd_lips": "don't know you but sorta love you, enjoy yourself", "herbivorebotanicals\nVerified": "Verified", "liciaflorio_official": "💕💕🌟🌟✨✨👯👯", "sierrapidawn": "Oh hey... this is raw and beautiful and real and SO appreciated. 💕", "sujey96": "You are more courageous than you give your self credit for.", "unnito_": "love ☝", "happydashery": "I couldn't love this post more @miss_magpie_spy xxx", "mixedplate": "Happy Birthday! You are so very awesome and amazing!!! 😘🎉", "housewrenstudio": "Happy birthday and thanks for the honesty. Been there.", "kattster": "Thank you for being human! 💓Love your snaps! Sending 💪🤗💓🌞your way.", "brandywithawhy_": "Hope those feelings passed along with your tears. I really enjoy your sense of humor and enjoyment of life and honesty. Keep it up.", "snellyfurtado": "❤️ love me some Jen Gotch!!", "marybush123": "Happy birthday ! You are female and are emotional it's ok. Feel love and cry it's what we do. It's ok even if you live in a mans world. Tomorrow is a new day !!😓😪😂", "midwestdrawl": "It's my birthday today too! (Well, yesterday...already past midnight in Detroit...) And I get it. The \"supposed to's\" get me real good sometimes. Have a beautiful end of the day and feel them feels, girl.", "taliachai": "🙏🏼✨❤️", "chelseamatthews": "You are 💯 for being so candid. Just remember you're an inspiration to others every day, regardless of whether it's your best day or your shittiest. 😘", "claudia0724": "@jengotch you got this!", "jkburgin1": "Oops, pushed send too fast :), happy birthday. I always cry on my birthday ! Here's to a happier today and tomorrow😻", "kaylanicolejordan": "@jengotch you are superwoman. Embrace your life! Xo you have a life that most women dream of. Be proud of yourself!", "shelbybisou": "jen, you and your raw feelings are beautiful. i feel so much the same.. overwhelmed by the underwhelming and overwhelming circumstances of life. side note, how does one look as pretty as you with mascara flooding your cheeks?? #tipsplease!", "jesssbritt": "I felt the same way on my birthday this year. You're not alone, and it WILL get better❤️", "itsme_imcathy": "😘😘😘😘😘😘😘😘😘", "typhoontessie": "You still look gorgeous. Here's to 45 looking up. Happy Birthday", "tylerwmerrick": "Vulnerability = Brave", "gingersays": "You are a true inspiration. 💕", "idyll.ist": "@adrukster, wow, refreshingly honest. Props.", "kate_nelle": "You're amazing and real. Happy birthday. Or Sad Birthday. Whatever. You still are a beautiful human. 💗", "_amandadawn": "you're honestly such an inspiration. you're a babe & deserve every good thing that comes your way. thank you for constantly being vulnerable & honest about the shitty side of things too. happy birthday to you 💕✨", "serpent.creative": "You're great and we have the same feelings cycle, I just wish I was as good at expressing / articulating it.", "empressstationery": "You are so real. That makes you beautiful in my book. You are truly an inspiration Jen! Instagram needs more honesty like this. 💕", "ariareare": "Youre the perfect human being !!! We love u !!", "chelseam.c": "You're one of my favorite humans on the internet. Thank you x10000000 for always choosing the brave, vulnerable route. When my days suck you're such an awesome light. 🌟happy birthday 🎂🍾", "beanmcbeanington": "@jengotch you know I really miss you", "lulamay": "💗💗💗💗", "alissaerin": "@mrs_tiff_dee I knowwwww. I know.", "rally.co": "Birthdays are tricky ... Life is tricky✌🏼 hope you got a great hug today ❤️", "brendaysoto": "I've dealt with the same type of feelings but it's important to remember to surround yourself with those who see the greatness within you, even if you don't see it yourself. Sending love your way ❤️", "kelseygerhard": "💗", "nancteby": "💖💖💖", "sarahloertscher": "You are an amazing fucking human and I'm so grateful you are here to share your 360° experience. Also my I Did My Best sweatshirt is my fav PJ top to remind me that I did at the end of everyday. Thanks for your honesty and perspective.", "hollyfalolly": "Awesome. You've just made one person feel not so alone", "_kati": "Thank you for sharing this. I've experienced these feelings far too many times myself. You are not alone. <3", "_lovedublin_": "@jengotch you are amazing 🌚", "sarannsable": "Sending love 💕 happy birthday!", "yoowoo11": "@jengotch Birthdays are certainly a time of reflection and reinvention. As an entrepreneur we are always on the go, making sure everything is on point. It's hard for us to give ourselves a pat on the back and really see all that we've done. You are inspirational. be sure to be kind to yourself and make time to realign your heart with all you desire. You have many people cheering for you always 👯💕✊🏽", "maggiegen": "Jen, you are everything good about social media. Thank you for all of it.", "fabfrannie": "Lol I think I feel like this every birthday- Thanks for your honesty", "qserasara": "You are such an inspiration, not just in the success you've achieve but in the fact that you embrace and are fully open with your emotional struggles. I know I don't only speak for myself when I say that, and when I thank you for sharing with us. Women have a hard time, we're constantly accused of being overly emotional but also expected to be strong. You manage to straddle both sides with grace and that is so admirable.", "schweetie118": "😘😘😘😘😘😘", "its.me.myriam": "I feel you. I hear you. I appreciate your honesty.", "daniellemlovell": "Thanks for the vulnerability. Thanks doesn't cover it at all. But so grateful", "leigh.a.dudley": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "gumption_and_glory": "💕💕💕", "tiffanydazet": "Love you for reals. Some much inspiration. @alissaerin right??", "hhobson86": "Thanks for sharing what a lot of us feel like sometimes. I felt the same way on my birthday this year, and I LOVE my birthday. 😘", "clairekaterickson": "💕", "alyson_undone": "I hear you, Jen. I hear you.", "dinneratmidnite": "LOVE YOU", "katiejstephenson": "I'm sorry 😞", "lazzzed": "Thank💛you", "kitsch__bitch": "thank you so much for this Jen. your willingness to be vulnerable inspires and encourages me. 💕", "reikakadlec": "Love you", "brachadesigner": "You are a beautiful soul! @jengotch happy birthday! #thereisstrengthinvulnerability #ifeelya 💛", "sarahcurrydesign": "💕💗💕", "orrfamily05": "💖", "streicherhair\nVerified": "Verified", "classic.mel": "You are amazing!", "smellslikesquirrels": "Damn girl. You so real. Love. IT!", "amgiammarino": "💕", "elhachey": "❤️", "saminagram": "Thank you for being real. Sending you a giant hug and a virtual bubble bath 💖", "ee2eunice": "Happy Birthday Libra Sister! {{hugs}}", "alysssssssssa": "❤️❤️❤️ I love this post - you're a badass and all of us at bustle are obsessssed with you :)", "overgolded": "Take it easy on yourself. You offer the world many smiles", "ilootpaperie": "It's your birthday, you can cry if you want to. Totally relate to so many things you said - this summer has been a doozy. BIG HUGS. ❤️", "jasminestar\nVerified": "Verified", "ajalou": "Today is my birthday, too. We are Libras (on the cusp). Balance sign. Highs and lows. We are sadists and masochists!", "itsdutranow": "🍾❤️", "amandaddie": "@kkures 🙃 i love her (and miss you!)", "rhaddha": "But the one with your name spelled in pepperoni was a big one. Don't ever settle for what you think you deserve. The critic in you is a jerk.", "beinggeeky": "You're post is exactly everything I'm feeling right now. Thank you.", "lovekimharmon": "❤️❤️❤️❤️", "debbiedrawsfunny": "@jengotch My fellow human and recent birthday girl; I applaud you. You are officially my new hero. Please accept this emoji crown👑Thank you for being a real human. I completely empathize. Because of your raw honesty my respect for you just shot up a poop ton (which is a good thing even though it deals with poop) Side note: I go through the same unpleasant life review every year on my birthday. Turning 40 last year wasn't at all what got me down, it was the fact that I've never had a real birthday party. \"Boo f*cking hoo,\" said that mean girl inside my head. But more than regrets of the birthday parties that could've been, I was sad that I have no one close (in proximity) that likes to have as much fun as I do. My sweetest and funniest friends live miles away and it kinda sucks. And that made me feel very alone. It'll get better. And it's ok to not be ok. 💞💖", "alexisrockley": "💙💙💙", "jennapilant": "I hear ya, sister! Sometimes I don't understand why I feel the ways I do either 😢 @jengotch", "e.cast": "❤️", "keriann14": "You are an amazing woman!!! Feel all the feels just don't live in the bad ones. Good things happen to good people. You are admired by many and I'm sure TONS of people are really fu@king glad you were born on this day", "annamaejones": "ILYSM💖", "joellybaby": "Happy Birthday Jen. Your honesty is the rarest, most incredible connecting thing and a gift to us all.", "coralieheather": "💕💕💕", "knityorkcity": "Thanks for this. So much love to you because you deserve it and also for putting yourself out there and being real af! So many of us are going through this stuff and it's really hard to handle it alone. It means a lot to me when someone who has it together can be open about it. Enjoy your pizza and your birthday as much as you can. ❤️", "tina_mm416": "Also your s prettier cryer than Kim K! 😂🍾❤️", "suzannewithaz": "I appreciate that your share your vulnerable side too 💙", "charlie_77": "😘😘😘😘😘😘", "poshnoshaustralia": "I feel the same way a lot of the time @jengotch I'm struggling with the same thing. I want to hug you. Your honesty is so refreshing and is helping me not feel so alone in this world. 💞", "ana_heatt": "Second, it's great that you show the world this side of you. It helps so many people (including myself) & I hope you realize the impact! Stay awesome🤗", "scarjo23": "You're not alone in that wonderful woman! X", "tangled_garden": "Thanks for your honesty, you have articulated how I have been feeling myself of late, hope you feel better soon.", "julianaramus": "Thank you xxxx", "voodoounicorn": "Don't know if this is of any help, but I've been thinking about you a lot this past week. Me and my boyfriend of seven years just ended our relationship and you have been kind of my spirit animal. You know, the kind that isn't afraid to feel sad sometimes. Love you for that! All best from Germany from a girl you don't know. ❤️", "molliejoydesign": "Happy Birthday Jen! Feelings are complicated but you're still pretty great 💕", "katiarichard_": "Sending love ❤️❤️❤️ Please hang in there, you are amazing! 👸🏼", "naomi.vankuijk": "I love you", "chey2xo": "💜", "yourstrulycaro": "Sometimes it's so helpful to know others struggle w complex self doubt and that's inspiring. Thank u for sharing! Working through those feelings is constructive, feel it get it out let it hurt and find the clarity u need for what's to come!!", "alledoow": "thank you for being real, being real with your emotions and being real with your style! You're inspiring to young women who think they can't make it through the rough days. You got this, girl!", "marissa.rascon": "Thank you @jengotch for always being the raddest human and being true to yourself", "dakinistudios": "💙💙💙", "miss_kristen": "For what's it's worth, this is an incredible photo. Like it should be huge, framed in a gallery somewhere. That being said, I'm sorry you're in pain and I hope your spirits lift soon. You deserve the best.", "dragonite567": "R u ok?", "jumeneses": "I feel you, my birthday was yesterday and I was exactly like this ✌🏼️❤️️ sister, you are not the only one 💕", "elleeachten": "Thank you", "rrrrriojas": "Feel that shit!", "sarahshiney": "💜💜💜", "camillia.v": "You're such a gem, honestly. You give other humans the greatest gift, including myself, by making them feel not alone in this glass case of emotion we call life! Happy Birthday sweet girl 🎂✨", "twopercentmelk": "You are a gem.", "kaviarkiki": "Your honesty is such a breath of fresh air. Happy Birthday, hope this cloud over your head passes and you start to feel better!", "teemiemageemie": "❤️💛💚💙💜", "octoberhello": "❤️❤️❤️", "brookgossen": "I admire you even more for being so real in an age of perceived perfection. You are an inspiration 😍 happy birthday and feel all the feels, it's what makes you you x", "ashleychazz": "Girl thank you for being so real and so raw. Life and feelings can really suck sometimes. Always remember, though, that you are a badass and nobody (not even yourself) can change that!!!! @jengotch 💜💜💜💜💜💜💜💜💜", "lisahostudio": "#real", "thegoodreport": "It hurts. Life. 😩😢", "dmillig": "@nicolettakarpathios read this.", "leishakate": "Your birthday is one day before mine! (although mine's today too, the 22nd, because I live in the future) I feel like this most birthdays too, but not today - so I'm sending you good vibes from the other side of the world and thank you for being so transparent on IG! You rule 👑💕", "yasscamacho": "💕💕💪", "thaislcollins": "Thanks Jen, you are admired and we're all so thankful for your energy. Thank you for putting this out there, we are all complicated (very) and not only you are not alone but you are appreciated for letting us know that we are not alone either. Thanks.", "laurenkirkham1484": "💯🍷🎂", "laurakristine": "💖💖💖", "mrskristen_hughes": "💓beautiful (seriously, you look gorgeous here!) and honest. Hope you have the year of your life ahead! 🦄", "tttitine": "Thanks for sharing. We need more real like this. We are humans with feelings. Life. Much love from France 😻", "nae.chad.isla.abby": "I wish you could truly know the love of Jesus...it's healing and freeing...He loves you so deeply", "mrsjennamartin": "Sending love and positive vibes your way, you wonderful woman. 💕", "linayabunbury": "You're upbeat, fun personality and hard work ethic are deeply admired. Thank you for being transparent. You're honesty is appreciated and a huge part of what makes you amazing.", "spinnabon": "@julzberrry the vibe", "jade_melissa": "❤️", "bymarcha": "❤️❤️❤️", "jessicadaviesmetalworks": "Own it! Love your bold and open honesty. I hear and feel you. Been married to someone for many years with very similar traits and feelings. It's tough but as you said, (and as he often has to remind me) you'll be fine. 🙌❤️✨", "elizabetholwen": "Aw man, days like that suck so hard. I hope you wake up feeling the good feels tomorrow, and thanks for keeping it real and sharing your shitty feelings too. We are all flawed, complex and human, despite what Instagram often leads us to believe.", "julieloveshome": "🍾🎂🍸😧", "camelliak": "You are so inspiring 🙏🏽", "kristinhouk": "@jengotch you're fucking rad 👊🏾🍕", "steph__wang": "I love you @jengotch!", "circarentals": "All good! Chin up buttercup 👊🏼", "n0pantsfriday": "More 🍕for you. Thx for being real!", "ginaagrimm": "Love this", "lalovetta": "💖", "evenyces": "Happy Birthday @jengotch and also we love you. ❤🎂", "meredithalexander1010": "You are a hero. Thank you for sharing the whole experience. It's your birthright to feel good and you have more reasons than most to own pride in yourself. I wish you a magical year ahead.", "ammedaglia": "@hannylarry so real. Love this.", "eqpaull": "Aww, happy birthday! 😊 This year all I wanted was to liberate my birthday from the weight of feeling obliged to find myself in a cheerful party-hardy mood. It's hard in a social-media-fabulous world. Thank you for sharing your truth ✌️💕 Here's to the highs and lows #themeanreds #itsokaynottobeokay #lifeunfiltered", "the___guesthouse_": "Weirdly relieved to read this. My birthday was Sunday and I was doing the Exact same thing. 😘", "campbellcriss": "<3 <3 <3 <3 <3", "tessmiche": "You are the best for posting this! 🍕🍕", "aklimton": "Happy birthday anyway! You can give yourself a rain check to enjoy it when you can. You are awesome❤️", "thebeauteaparlor": "👍👍👍❣Thanks for sharing. You have comforted many people with these honest words.", "circa_spark": "Fair play to you for being brave and honest!!!", "shesafatty": "your face literally says, \"it's my birthday and I'll cry if I want to.\" love ya, jen. happy 45. 💘", "schnellbruton": "Jen- this is going to pass, which is annoying advice, but what's more annoying is that it's the truth! Let's get you a therapist who gets you (!) and a little Lamictal... and some exercise outdoors and some time... and soon this will be in your rear view mirror and then you'll be shelling out advice to us when we need it. Just brace for impact, hang on tight & know it'll be over in a little bit!🍧🌷🍉🏜🔮🛍", "pa_grav": "@jengotch SO SO SO UNDERSTAND TOTALLY GOING THROUGH THE SAME THING AND ITS AWESOME TO SEE YOU PUTTING IT OUT THERE", "marianmonmac": "Sending hugs and good vibes your way!!! You're amazing 💗", "bethanyclynch": "💖", "sarahrubydesign": "The fullness of life...😘", "romperliving90292": "@kizzabeth birthdays", "mia_helms": "Happy Birthday great woman! 🍾 Sorry for you being so sad for the moment. Sometimes it just sucks, and without any given reason. But I really like what you give us in here, so fuck the whole thing, you are my hero in absence 💪🏼Thanks Jen, sending you lots of sympathy 🦄🎈", "heathertrine": "🍾🍾🍾🍾🍾<<< pop that", "fidecasares": "I love you 💗 you are such an inspiration. You'll be fine! 😬⭐️", "marandaz": "xo", "jaclynrjohnson\nVerified": "Verified", "luziapimpinella": "❤️❤️❤️ love this even more than your funny stuff. because noone can always be happy and funny and this is just a true and honesty side of life! happy birthday, jen! my birthday was a few days ago and i even guess we're the same age.", "jamison.k": "thanks for being real, happy birthday❤️❤️❤️", "nava.kasiri": "You are honestly an inspiration, thank you for being so candid, happy birthday dearest libra sister, you go Jen!", "hannahtakespictures": "love youuuuu", "lifeunstyled": "❤️❤️❤️❤️", "e_dodd": "Thank you for sharing your experience. I feel the same. While I wouldn't wish this on anyone, it's good to know that I'm not alone. 💗", "emilyabigail": "💕", "gera_gr1n": "😘meow! 🙌🏼❤️ please, don't cry!☀️☀️☀️", "wealthyanonymous": "Yes to have beautiful and honest you are, inside and out🎈happy birthday!! Everything is temporary. ❤️", "switzart": "Thank you for sharing your raw side @jengotch. Hell knows we all go through it. Big hugs from Canada.", "miquelasuazo": "@natasharansom oh man, me too. We love you @jengotch!!!", "bstefanides": "It's post like this along with everything else that make you the #1 person I tell everyone I can tell to follow. I don't know you I feel like I get to know myself a little bit more through your sincerity. Thank you for being you. Happy birthday! I really hope you feel better. P.S. I always cry on my birthday 😭", "thild.co": "It takes a very strong person to share this , especially in such a public way. So no matter how defeated and negative you feel, you clearly have more strength than the average human being. Ygg💕", "allasaurus": "❤️❤️❤️❤️❤️", "annazefleur": "I love everything about this post. This is all too relatable for so many people, and it's nice seeing this feeling put into words because I've never known how to properly describe it. Thank you", "samirasemiramis": "@may_visaa i love this gal and her beautiful honestly", "honeyofalife": "Awww, happy birthday Jen! You are such a star and you make our days so bright. Thank you for your honesty as hard as it is to show sometimes.", "artwithlinda": "Thank you @jengotch for making my feed a little more real.", "btoshner": "You're not alone. Thanks for sharing. Sending love on this hard / great day.", "hollycromerphoto": ":( :( i hope you feel better. happy birthday!", "cocoslade": "You're an effing rockstar and I ❤️U!! HBD", "_bloomchickabloom_": "I don't know you @jengotch, but you need a 🤗 hug. You just described profound feelings so many of us (me included) are unable to put in words, because it is stigmatized. I salute you. This too shall pass.", "lostbirddesigns": "Allow yourself to feel all or it. Then set it aside like a child sets aside a toy and push on. Life is short. I'm 53.", "hannah_keeton": "💜💜💜", "nicnak_": "You deserve all the love ❤️❤️❤️", "laura.gwinn": "You are by far the greatest person I've never met. It's good to not pretend part 2 isn't there, but keep remembering part 1 - the optimist. ❤️", "chubbybadass": "@jengotch i think that's why when i found your instagram recently i fell in love. because as fun and quirky as you can be you also show this wonderful and vulnerable side of yourself in this space. and as humans - even on IG not everything is super shiny happy rainbows. you're so authentic that it makes my heart happy yet sad at the same time because i can't help but hope for nothing but the best for you. rock on you wonderful woman, i'll be cheering you from the sidelines whether the mascara is running or you get an awesome pizza! ❤️", "miss_magpie_spy": "💛💛💛 (@mmfs_stationery) xxx", "romeroymiel": "Sending love your way ❤️", "ashleyestrin": "You look really pretty even when you're sad. Thought you should know. Happy birthday favorite lady to follow! ❤️", "madilynhastoglis": "I love you deeply even though I don't know you and want you to be more than okay. Thank you for your honesty 💖", "the_erin_rose": "I love you for this. For the levels of honesty and real was that we so often hide with pretty pictures. You're badass 🙌💖", "paigeappel": "Sending you all the feels back. With you love.", "retrobettie9": "@meliemelrandall Could not love this more. Raw vulnerability and courage to not do what is \"expected\" and just be authentically you. ❤️🙌🏻", "jlatini": "❤️ glad to see someone else sharing my feelings on this rainy Friday day.", "mama_roboto": "You are amazing.", "annetterightmeow": "@jengotch thanks for being so honest with your emotions. You are not alone I feel the same many times but its all about moving forward in the direction of fulfilling your true passions!", "stacieed": "I love this genuine and authentic aspect of your \"brand\" because it's not a brand.. it's your life. Each of us sees a part of ourselves in you and you're putting your shit out there publicly. It gives us permission to do the same with a little less fear. So, thank you.", "jesspjordan": "Thanks for sharing the real, legit, ugly feelings and know that you're not alone. There's bravery there and that's something to celebrate today 🎈much love, sweet soul 💓", "laurenmnorton": "Please don't ever forget how much light you provide to others. You are an amazing human. ❤️ XX", "bdenns": "Thank you so much for sharing your truth and feelings. The world needs more real, 100 % real women like u in it!", "gretchenmariehunt": "Much love beautiful lady. This fall has been rough for so many people.", "amybogs_": "😘🤗 happy birthday", "jahvaa": "So brave, and so real, love it! Thnx for sharing! 💖", "julianaguinane": "Hey amazing woman! You rock!", "stylejouy": "Amazing i feel like i go through that in phases thanks for sharing", "elefonte_studio": "Feeling horrible happens to us all! Stay there for a while and then fly! Every phoenix needs sometimes to go into ashes to come back even stronger! Your dark side makes you as beautiful as the bright one because it makes you go real⚡️Big Hug!", "tessa.ohalloran": "I also had a good cry today with a lot of those we feelings 💟🎆🍕", "ckunzle_debernal": "Sending you love today, Jen. I look up to you so much as such an inspiring, strong, cool, funny, loving woman. You be you - ALL OF YOU - and let the rest of us sit back and admire. Happiest of birthdays!", "emmybee21": "Thank you for honesty... so refreshing to see someone so open. I feel ya girl I cry every Birthday like it's my job.", "curatedinterior": "Sending good vibes!! 💜", "sun.trail": "Your vulnerability is something to be admired. Let yourself feel all those feelings, no matter how awful they feel. You're a badass, Jen. I mean, all of us want to be your friend. And being you, being honest, being absolutely lovely, is exactly what you can do for yourself -- and you're doing it with so much grace. Now go drink champagne and party like it's your birthday!", "laurabesskenny": "You're amazing for posing this. THANK YOU. We all feel this way from time to time, and it's good to know we're not alone. Sending love your way! 💕", "nicolajanepyo": "💗💗", "haley___james": "And happy birthday. So many of us are ridiculously better for your being here.", "thecarolove": "Thank you for being so honest and an inspiration", "meliemelrandall": "Bravery", "isadorastowe": "❤️😘", "leanne_ringer": "Thank you so much for sharing and for being real ✌🏼️...we need more truthful humans on this planet 🌎 Keep feeling and enjoy that Pizza 🍕", "lovelillieclementine": "You're not alone in how you feel. I feel exactly the same too. I wish I knew how to fix this for both of us.", "craftskin_usa": "You are more worthy than you'll ever know. Recognize it and honor it.", "jmemonahan": "I've been there too. You're brave for sharing!!! #youareenough 😘", "thunderwith": "I don't know you but I like you. Chin up, buttercup 🌸✨", "somecrazycat": "Love how ur so in tune with your feelings. Acknowledging all kinds of feelings is the best for our soul.", "elizabeth.cordaro": "I LOVE YOU. Feel the feelings. All of em. Everytime. Oh, and happy birthday! 😘", "brendabond": "You got this!!! 👯👯👯", "shada.sedehiii": "Happy birthday... I hope your day gets better! I agree... Hero status for keeping it real in a chaotic world✌🏾️🙌🏽😊", "lodybode": "❤️️been having very similar feelings myself lately and in a weird way, it's cool and reassuring to see someone I view as amazing and successful being open about these kinds of difficulties and self doubts. Thank you for sharing and stay strong and positive!", "dakotalbarber": "Just love her. @tjdonadt", "jessleewilson": "❤❤❤❤❤❤", "tchilvere": "@dchilvere", "meghanalfano": "So much ❤️❤️❤️ today and always.", "cam_oh_": "@eliz_knowlton", "dianedee": "❤️❤️", "huideleigh": "...currently crushing the realness game #you.", "wendylawrence88": "Thanks for being real @jengotch 💖🙌🏻🦄✨", "noeliasolange": "Love the real emotions behind this post. You are an inspiration to a lot of women -- but to also know you feel these feelings... makes you UNICORN STATUS AMAZING 🦄thanks for sharing and hbd ✨🍭🍸", "realbrookewhite\nVerified": "Verified", "summerbellessa\nVerified": "Verified", "thelibbyoshow": "Happy Birthday! Wishing you all the ❤️'s and 🍕 😘", "holdbindery": "You're the best. We all love you but I know how you feel. I hate birthdays and it just makes me sad. Breath in and out and tomorrow is a new day!", "jesscapades": "You're so neat! Believe that!", "clairee.mariee": "i relate to this 100%", "coelhoculture": "💕❤️💕❤️💕", "tarakdavis": "yes", "kaleighdsimmons": "Life isn't always pink skies, right? I look up to you in so many ways, suck off of your creative energy via the Internet (weird, whatever) and really truly understand how messy life is, and then throwing anxiety, ADHD, and the like in the mix makes it no easier (I'm #blessed, too). Just know that there's always going to be a rainbow after a rainstorm somewhere, and you are a boss. Period. Feel them with all the tears you have in you and let them be. I'm sorry you're experiencing this. I know you'll come out of this on the other side. Thanks for sharing the tears and expressing authenticity all of the time. Xx.", "moronoa": "Big hug from me❤️❤️❤️", "meganmraz": "You rock ❤️", "aliafaris": "@wijdansudan", "madalenemielke": "I read your post while Inside Out was playing on my tv and couldn't help but noticed a bit of the parallel. Life is filled with good and bad and people who are brave enough to show all sides are sharing their authentic experiences. Thank you for sharing your life.", "abbeyykayy": "You are the most humorous & enjoyable human I have found o the Internet. Your job rules. Your hair rules. Your personality is incomparable. But, it is okay despite all of that to still have bad days & to just be the emotion you are. Feel no guilt about it. Just live in it. You learn more that way. Thank you for being real & really you. Have a birthday (happy or not) that most fits you today love 💕", "cassandralegiehn": "Complicated minds are the best to overcome. Lots to feel, lots to give, often misunderstood. You're amazing. 💜", "_amandakrueger": "Thanks for being so brave and posting about something that isnt just the glamours life we all want to portray for ourselves on social media. Sending you birthday love.", "theglitterinmytea": "Thank you for sharing, BB. Happy birthday despite all the bad feels!", "emaedwds": "💓💓💓", "selenagoodwin": "No matter how many great things happen or don't happen on my birthday, I always end up in tears at some point. It seems very silly, yet unavoidable. Hope the rest of your day can be tear-free :)", "luckygirlkelly": "💓💖💗❤️", "poppyhollow": "Thanks for keepin it real! Hugs & Happy Birthday ♡", "laurendwills": "Hero hero hero hero hero hero hero", "dashofbitters": "TOTALLY. I feel you. We have to be careful with the stories we tell ourselves,we grow attached to narratives that hold much or any truth. I think you are WONDERFUL for acknowledging the less fun feels.", "krakowianka_": "I hear you. I share the same feelings. Chin up. Have a great birthday 🎈🎂🎁🎉🍾 And thanks for being real. There are many of us out here that wish we could be as brave as you with our feelings. One of your fans 🙋🏼", "hilaryplata": "I also get the Birthdays blues, I get the Friday night blues, and random middle of the day blues too. You are a kind, generous, driven, and incredibly inspiring person. I adore you and I wish I could send you all of the Micky premium bars today. You deserve all of life's happiness every single day! 💖🦄🎂✨", "itsjinah": "So sorry you're feeling yucky on your birthday! It's ok to let yourself feel it, especially since you know there's a brighter side, even if it seems far off. Hang in there, Jen.", "photolexx": "Thank you for being so open and honest and amazing, @jengotch 💕✨ Happy birthday. Don't let all the feels spoil such a beautiful day 😘", "gauxblonde26": "Your honestly and vibrancy for life gives me motivation to keep pushing forward every day. So much love for you, sending the warmest birthday wishes 💜", "amy_wiebe": "Words can't express how inspiring you are. This too shall pass. Thanks for keepin' it real. AND HAPPY BDAY! ❤️🎉💃🏻💪🏻", "schaanagram": "Thank YOU! 💗💗", "sidracarder": "💘", "gabycacheris": "Your amazing!!", "traetz": "You're my idol.", "joroake": "Thank you for showing that all days, especially birthdays, aren't all perfect. You're an inspiration and more than enough! Hang in there!", "hstryk": "💕 I'm a web designer running my own little company and you are one of the people I look up to. I love your work but also your raw honesty. Social media is such a curated look into our personal identities. I appreciate you giving us an honest look because I often get so down with all the anxieties of running a creative business - I look online at all the happy creatives and wonder wtf I'm doing wrong", "kclarke40": "Get some sleep💤and stay away from social media for a ................ hour 👀", "haleyca": "Thank you for this! You always share the bad stuff with such grace and in a way that makes me feel less alone. 💕", "actualizingamy": "You'll be fast forwarded out of this soon and then able to look back with a big sigh of relief. Release and recharge this new year. This new day.", "carolynpage22": "I hear you and visit my own version of that place. Ugh. I've learned that the only way out is through. Much ❤️", "longsleeveshirt": "thank you! i'm glad you were born! 🍕🍕", "lydmartino": "😘😘", "leilahowell": "You're not alone 💛 🍕 🎂", "mali.mish.marlene": "❤️", "natcatkim": "You should check out Love Warrior by @glennondoylemelton and / or her interview with Micheal Hyatt.. she has life-changing views on pain and feelings.", "richiedesigns": "It's ok.", "eliza.peppel": "YOU'RE A BRAVE ASS WOMAN! keep moving", "stacefacerenee": "I just love you. Thank you for your humanity.", "maddynye": "x + o", "sophiedoublef": "you're too real 💖", "kittykittymeowmeow345": "@jengotch sooo sorry you are sad! On the bright side you look amazing post cry!", "men.lop": "we ❤️❤️❤️ you jen", "rufpop": "Happy birthday you gorgeous human being! One day you should run for the President - definitely before you're 70 🙃 love you very mucho ❤️😘😍", "jerrodblandino\nVerified": "Verified", "heyitslucia": "💕💘💕💘💕💘💕💘", "gwdub": "This was exactly me on my bday this week. Still getting over it", "chelsea.reyn": "I love this 💗", "cadyz": "With you! Glad you were born!", "denaelarocque": "Thanks for being real, we love you for it @jengotch", "molly_meg_": "You are an amazing lady, keep that shit up 🙌 😘", "rlomauro": "life is crazy and difficult and so freakin emotional and overwhelming at times. just know you are definitely not alone for one moment during this rough patch! tomorrow will most definitely be a better day. 💕💗", "jennifer.klee": "⭐️", "jenhubbellphoto": "💕💕💕💕💕", "mia_isabel13": "I need more people like you in my life 😍", "kimgarvinferrier": "Jen Sony want to come down to beach? Hang with us is sunshine and sand", "breakfast_at_briffanys": "Love this post! Thanks for being open and real, and I hope you feel better soon. Happy birthday! You put a lot of fun and happiness into the world 🌈", "moonwalkerclub": "Thanks for being so real and relatable! Birthdays bring up such a range of emotions, and it can be really hard to know what to do with that. I hope the day treats you well, and I'm so grateful, as a young maker just getting started, to have you as a source of inspiration! 💕", "natasharansom": "@Miquelasuazo I love her", "jillford": "Hugs 💕💕💕", "lara___c_": "You are bloody wonderful for articulating this, which I have felt so often myself, so clearly. 💚", "eebrock": "Thanks for keeping it real. Sending you positive vibes and good thoughts on your b-day lady!!!!", "jen_alcaraz": "💕", "chloe.h.h": "💟💖💟💖💟", "hannamoens": "❤️", "missshellsprettyplans": "That's very brave of you to share this. IG and Social Media in general sometimes portrays only the ideal versions of oneself. You're a champion to show your vulnerability. You bring so much joy to others. I wish you all the joy your heart can hold. Happy Birthday!", "janetlankfordmoran": "you make me laugh all the time. you're my favorite and always make me giggle. You bring a lot of light into this dark world. cry on sista & tear it up tonight at the rink!", "cecharris": "Sending you love and light on your birthday✨🙌🏻 You give people so much joy hope we can all send some to you today😘❤️", "hjuliet11": "Happy Birthday Jen! All parts of you are amazing! 🌟 \"I have learned that when sadness comes to visit me, all I can say is \"I see you.\" Spend some time with it, get up, and say goodbye. I don't push it away. I own it. And because I own it, I let it go.\"~Carolina Zacaria", "grimesly": "Happy Birthday! I love your humor, your honesty, your lighthearted and your heavy. Keep it coming. I also have to give you maj credit because I have shopped with Bando and will continue to because this brand is badass just like you. Feel all the feels girl.", "nevalicious07": "❤️❤️❤️❤️❤️", "the.blondewitch": "You are enough 😘", "emily_katz\nVerified": "Verified", "trulydeer": "Happy Birthday🎈Jen!! xx", "sweetclems": "Thank you for your honesty", "leighannmick": "This feels familiar to me too. It's a horrible hurt. Hugs to you", "giovannapao": "I read this earlier today 😅 @m_kells", "meowwwza": "Your raw, beautiful honesty always blows me away. You're an inspiration. I know you're in the process of moving through these emotions, so I won't be like \"noooo don't feel that way!!\" I just want to say: I get it/yes/exactly/dude/ditto. And that I have so much appreciation for you and your beautiful life, whether it be dark and bright. ❤️❤️❤️", "joannabeanmartin": "Thank you helping make the instagram more REAL!! ❤️💪💜", "jennarainey": "It's your individual, kinesthetic style of learning and communicating that makes you human and wildly successful all at the same time. The ability to enjoy the highest of highs and pour an appropriate amount of care and emotion into the lows...Tending to your humanity and letting yourself feel is not only encouraging to others but absolutely necessary. You're self aware, you're doing your best and you're always right where you need to be ...AND you look so damn good for 45. 🙌🏻✨❤️", "valeriesophiex": "Happy birthday Jen! You are one of my biggest inspirations 💓🌸🎉", "miss_o._regrets": "I completely understand where you are at. I also have a pretty rough time right now. Love to you!", "dahlial": "Amazing. Truly inspiring", "m_kells": "@giovannapao", "hoyakimmii": "I'm right there. In that shitty emotional space. Right now. I could have written every word, minus the birthday part. And yeah, this will pass. But why in the hell does it have to feel so crappy, and I so shitbox crazy, until it passes? And now I feel shitty about not saying HBD and all of the uplifty things. So!!! Jeg elsker deg! And all of the uplifty things. Party on, Gotch! 🎉 🎉 🎉", "spicyguacamanda": "Happy birthday! I feel your pain and hope it passes for both of us.", "littlearrowshop": "Rough patches are hard. It makes the \"good days\" feel so amazing tho. Hang in there!", "morgan_wyenn": "Thank you for being so real and honest. You are a total rockstar, even if you don't feel it sometimes.", "anastasiaserena": "I appreciate your honesty so much 💖 happy birthday Jen!", "ameliaelisa": "❤️", "rosteebs": "thank you for posting this. sometimes I hate Instagram because it makes everyone's life look so perfect. it's nice to see that that isnt true... even though I wish it were for you!but alas, these feelings are part of being human. and I'm so glad to know I'm not alone in feeling them. have a happy birthday!", "sonnetj": "💖💖💖", "beth_a_moyer": "You are loved and you are enough. Give yourself grace for ALL your feelings. None are good or bad. They just are. Sending lots of love and comfort to you on your birthday!", "oh_jay": "And happy birthday !🎈", "samarawentwest": "I like your birthday outfit choice🙋🏼", "stillpixilated": "Happy birthday, birthday buddy!", "amandarosezamp": "Happy birthday, boo. ☝️😘", "darkbluespeed": "@kristyn106 I just kinda wrote you about this space 💌", "sarahbeansnyder": "You are a true gem. 💎", "waxinmama75": "Thanks for sharing.. you feel all the feelings that we women go in circles with. On my 37th birthday I decided I would invite everyone to go roller skating, I was pumped.. on the day of I sat in my car and cried instead! 😬", "domesticjunkie": "Love you JEN!!!!! HAPPY BIRTHDAY, you beautiful human!!! 😘😘😘😘🎉🎉🎉🎉🍻🍻🍻🎁🎁🎁🎁🎈🎈🎈🎂🎂🎂🎂🎂", "theresaguntli": "I love you for this. ❤️", "natyvdeleon": "thank you for being so real. happy to know im not the only one who manages to put out their birthday candles with complicated tears. <3 Happy Birthday.", "heidilike": "I love and respect that you project the whole. Hope this days brings you something wildly unexpected and beautiful.....even if it's peace in yourself. Xo 🙏🏻.", "meforwedesign": "Hugs + highfives for revealing all the sides of you. What I've learned from my love losses and rebirth of myself and life is that Grief and change reveal you. It gives you the emotions, the pain and the clues to choose better and greater than before. To have the imagination and pursuit to keep onward, no matter how messy, scary or confusing it is. You are lovely and doing lovely no matter what. Big hugs sweet & creative warrior, rooting for you. :-)", "meghanjessica": "Happy Birthday and thank you for writing this out. I feel like that all the time. I'm glad (not glad) that I'm not the only who feels that way.", "valsdead": "Happy birthday 💕", "luckylindsy": "@jengotch thanks for showing a different side to IG. Love that you're showing that life isn't always sunshine, kids & puppies 👍🏼", "meg.weber": "Be you. Give in for a moment then get up and kick ass like you always do. 🎶It's gunna be ah'right!🎶", "teeshrose": "You're great. I love your ability to be raw, real and really funny all the time. 💖💖🎷", "laniako": "i love you. happy birthday ma", "r_irisarri": "I adore you!", "michellerogers_styling": "#itsmypartyandillcryifiwantto 😚😙", "mollybrighthughes": "thank you", "jaspr_co": "Thank you for this. Happy birthday. 💕", "jessicambutler": "HAPPY BIRTHDAY.🎈🎉🎊🎁🎂 Thanks for always keeping it real!", "this_hanna": "It will be okay x", "kissthesky.creative": "Wow honesty on the Internet 👏🏼👏🏼👏🏼 I love it. Runny eye make up and you still look incredible!", "gina_philangee": "And by female I mean you're a goddamned role model to me as a woman!", "louweezwee": "Just when I think I couldn't love and admire you more. Happy birthday beautiful lady 💛🎁🍕 xx", "torihackett23": "❤️💖💕✊🏼💘💗💓", "sarakaye": "<3", "amy.e.little": "Happy Birthday! You're awesome.", "invocateur": "It's all ok and you're doing it. HBD.", "sussedandsorted": "Happy birthday ! And as your b-day twin I can tell ya IVE BEEN THERE TODAY TOO! 💕✨👯", "andthenagain": "Birthdays really do bring all the feels! Hope this year brings joy and laughter. You are the first person that I scroll to find when looking at Instagram stories. I love your honesty and sense of humour. Thank you for being born!🎉💕🎉", "lauraplouzek": "I love you forever and always. 💘💘💘", "emileycox": "You are my inspiration! I eeeeeekkkkk every time I see a IG story pop up and gaze at your ability to be YOU. And no one else. That, is a true gift. HAPPY BIRTHDAY!! 🎈", "christine.ism": "Feeling the very same way. Thanks for posting this, Jen, hope you're able to shake it off and enjoy your birthday! And all of the pizza :)", "itskarathomas": "Happy birthday 🎈 hope your day turns around", "briannealves": "You are not alone. ❤️❤️❤️", "hoffhome": "You're an inspiration Jen Gotch. Happy birthday party queen 👑", "ali1124": "Feel the feelings, girl. But you're the SHIT & you should feel that today too!", "cliodhnadinneen": "😘😘😘", "dearabbeyh": "I'm @amanda100lc \"s sister and I admire you for posting what you feel and aspiring all the ladies. You are awesome! And you do deserve a happy birthday 🎈😊 treat yo self!", "britt.r.sherwood": "❤️️", "ms.candace.leigh": "Wow this really speaks to me. Happy birthday!", "kellygolightly": "Sending you big hugs and also big thanks for being so vulnerable and open. It's a rarity, more and more these days, but it makes sense because you are a very rare and special person. 😘😘😘 As someone who also cried my eyes out yesterday and felt simultaneously guilty about it, I totally get it.", "kosmokrista": "<3 I too cry every year on my birthday for the same reasons. You're definitely not alone though. <3", "everleyb": "It's my Birthday too Jen! Happy Birthday! Don't worry! You're allowed to feel happy and sad! We're libras!!!", "instantlychristi": "Nothing better then RAW and REAL. You inspire me daily girl. HBD from Maui! 🌺🎈🎉", "littlebrightstudio": "you goddamn rock", "denai_jones": "I agree with the book comment 👆🏻", "ellenquinnbanville": "Bravo for being a real person on Instagram 💕", "jillithwin": "You're rad and an inspiration. Thank you for being so real and honest. Eat some Tate's 🍪, attempt a face swap with Gertie 😸, and get those nails done 💅🏻 Happy Birthday Jen! 🍕🎂🎉", "heatherhale": "For my birthday last year my mom got me a vintage trench coat (so thoughtful) AND my husband arranged for us to have a sitter all day for the kids (also, so thoughtful). I ended up crying the entire day because I hated the coat... felt guilty for hating the coat and I really just wanted time with my kids because I work full time and miss them like crazy. Ahh so many expectations with birthdays for me. Lots of emotions wrapped up in one day! You're awesome. Thanks for your vulnerability. 😘", "prettycrabby": "It is hard to be a human on this earth. Birthdays are difficult and emotional. For me it's one more year of life but also being sad for all the people and friends who left (this year my cat died and I'd had him fourteen years for example). We are floating on a rock in space! It's a lot to feel and think about. I wish you an adventure filled year full of love. We are alive and that's something. 💕💕💕", "theoodlesofdoodles": "Happy birthday from someone in Dallas, TX who loves and admires your work and determination ❤️❤️", "thisgirlcharlie": "I get you girl, feel those feelings! We all feel them but what sets us apart is how we find our way to the other side. #feelyofeels", "26andnotcounting": "I appreciate you sharing this (and can relate so much!)....I hope you celebrate in a way that's best for you right now, no matter what that looks like! Cheers to you! 🎉", "_chillvia.plath_": "I love you! Your honestly had made me feel more brave today. Happy Birthday 💕", "lisettevandegraaf": "❤️", "isabelle.nissen": "@blackdogdesigner we need more of this truth", "stroetifrutti": "You rock no matter what you do, with and without tears. You're my inspiration! 😘", "anemilyb": "Many awkward virtual accidental boob touching hugs at you. Xo", "lloyd_noble": "You just described me and my feelings go a T. Honestly makes me feel better knowing I'm not the only one", "wayward.garden_": "Babe you're grieving 💜 hugs.", "thelucias": "Thank you so much for your vulnerability ❤️", "colletteqwitz": "Love ya, @jengotch! I had a happy/sad birthday this year and you articulated exactly how I felt. We are awesome!", "trac3yw00ds": "💕", "jaymeemartino": "You are amazing! I love you and I haven't even met you! You need to write a book about something..anything! I love reading everything you write. Sending you love! ❤", "mollymoonicecream": "Happiest of birthdays! All the feels!", "persikadesignco": "P.s. Where did you find this amazing top?", "anayas": "Birthdays are great except sometimes the reflection part. Internal and external. You are awesome and beautiful in all the ways fellow commenters have already said. We love that you are you💅👩🏼👘👡🍸 #imgivingupdrinkingand salami", "lacey_tom": "Feelin it out! Happy Bday lady!", "kimberlytime": "I cried for the same reasons on my 30th birthday. I still tell everyone about it. It's ok.", "anxiousalphabet": "It's your party and you cry if you want to @jengotch 🎂💓", "aliblythe": "@jengotch Our 40s can suck balls periodically, can't they? The mid-life crisis was never clearly defined for us ladies. For men it was a Porsche and maybe a hooker or two. For us, it can be a landslide of tears, fear, guilt and regret periodically interrupted by roller skating or an ill-advised miniskirt purchase. We'll make it through, though. Keep feeling all the feels and keeping it real. 👊🏻", "hello_candice": "And also Happy Birthday!", "annepaws": "💗", "clothandtwig": "💕❌⭕️❌⭕️💕", "sarah.k.jensen": "Happy birthday, pretty lady. Here's something else to celebrate, you're not an ugly crier!", "allysonjoyowens": "We ARE complicated! It's ok! Stay strong 💪", "manthsrussell": "💜💜💜", "kelluchi": "You are a creative genius and a superstar/goddesses. ⭐️", "angelahardison": "💛💛💛 appreciate this. happy birthday to an amazing, hilarious and inspiring lady!", "hannylarry": "@ammedal25", "jujushappyeyes": "...... keeping it 'real'... best Insta post I have seen in a long while @jengotch .. respect 🙌🏻 I don't feel sad for you, I feel happy for you that you can do the whole spectrum of Feels ❤️happy new year to you 🎉⭐️💪🏻xxx", "kimhoffman": "Happy birthday, for everything it's worth, you are amazing. And complicated is okay!", "melissa.rhiannon": "I won't say happy birthday because fuck that shit so I'll just say birthday. Here's a balloon 🎈 You're incredible and inspiring and I hope YOUR day gets better!", "littlehiccups": "Happy birthday @jengotch! I love seeing your happy face in my IG feed, but this one is an amazing portrait. So much emotion. Sending birthday hugs 😊", "road142": "Big hugs! Birthdays bring out ALL the emotions for me as well. I always say it's not a good birthday for me unless I end up crying on the bathroom floor. This human experience is just oh so complicated.❤️😘", "shopb.ca": "Cry it out girl! Good to get it out. Sending big hugs! 😘😘💗", "jess_cuadra": "Sending love and remember this too shall pass.", "flowerchiiile": "Omg! Your perspective is so necessary because these are real feelings! I'm glad you decided to share! Happy birthday fellow Libra! 💛", "danifille": "Thank you for this! ❤️", "estrellasforplin": "❤️❤️❤️❤️❤️❤️❤️", "foxyredsdesigns": "❤️💖💕❤️💖💕❤️💖💕❤️💖", "onehappylaina": "And that's why I love you. You are inspiring and interesting BECAUSE you show all the aspects of your life. And they are all perfectly human. I think a lot of people want what you have and tell themselves that they won't feel those same \"complicated\" feelings if they owned their own business, and if they had a lot of friends etc...but we are all human, and we all have the same emotions and we're all doing our best and have things to be grateful for and things to feel shitty about, no matter where we are in life. And knowing that we're not alone, and knowing there isn't one solid answer for life, that somehow makes it easier to move forward and be inspired and inspire others. Thank you so much for sharing your story. 👏❤️ Happy Birthday! I wish the very best.", "hafnhafstudio": "💐❣🌹💕🌾🌸❣you're the best", "elliemayejenkins": "💕", "mysweetpippin": "Today is my mama's birthday too. She woke up feeling the same. It's the first since my dad passed away. When I pray for her today, I shall pray for you too😌❤️ Please be sweet to yourself today😘", "erinpower": "Happy birthday, you lovely gorgeous complicated human being!", "juliagartland": "You're my hero. I think you're brave (ugh is that annoying?) and wonderful. Also, I cry every year on my birthday - isn't that what everyone does? 🎉💔", "everita": "@kaylahaykin freaking love her and these two posts", "leighherr": "1. Happy Birthday! 2. Thank you for always being so open and honest for us. I struggle with those same feelings sometimes (okay more like always). I felt it on my birthday this year as well. I know you don't know me, but thanks for letting us know you. You're in an inspiration in so many ways, even if you don't think they're glamorous. 👸🏼", "betsyclegg": "You are an amazing human.", "miszkomaszko": "I love you! Like really😘😘😘😘😘", "fecundmind": "For some reason my birthday always gives me the worst feelings too. You're not alone! I hope you know how much of an inspiration and role model you are for so many people! I hope your day gets oodles better from here on out. 💕💕💕", "seamlesslysonya": "#relatablepost @jengotch", "ricenator": "❤️❤️❤️❤️❤️❤️", "jennysport": "You are my freakin' hero. Feel it all! 🙏🏼💜", "jjennajane": "Thank you for your words as I had very similar feelings on my birthday last week. Must be the Libra in us! Happy birthday and keep doing what you do! You're amazing.", "thealexandraverdi": "Happy happy birthday to a fabulous woman I've never had the pleasure of meeting but who I admire SO MUCH!! Thank you for bringing so much light and color and love to the world while still being REAL and authentic. One foot in front of the other, one day at a time. You are a huge inspiration. Thank you thank you thank you 💖👑", "daniellebwilson": "Empaths unite! I feel this pain 💗.", "allison_rolfes": "Happy birthday Jen! You deserve the BEST birthday and life ever. xoxo", "bethanynauert": "You got this 🙅🏼", "opinionatedjacqueline": "Happy Birthday! Thank you for being an inspiration to me. I'm so sorry you feel sad. You're an amazing individual, so creative and special. I admire what you've done and I love your company. Wishing you only blessings and lots of love today.", "maceopaisley": "AMEN SISTER!", "amanda.oneill": "Jen, you are such a wonderful, inspiring human being, and deserve all the happiness in the world. I hope you feel better and happy birthday! ❤️🎈", "ellishepburn": "oh my god, i love you. more than pizza.", "litwillia": "This is nice (knowing that you are so successful but still willing to show that you are relatable). I appreciate your honesty and vulnerability.", "nonamenoone": "You're wonderfully talented! HBD!", "hans.kc": "You're a big inspiration to me, thank you for your honesty! Happy birthday! 💕", "veloursnoir": "❤️", "julianadayhuff": "Keep it real, bro-tato chip! Happy happy 😊", "mysticandmaisy": "Sending you love 💝 @jengotch", "yourmom206": "I felt the same way on my birthday this year. Like just not fucking happy at all. It's okay to tap into that just don't get comfortable. 😘", "cbanningaccessories": "Hey @jengotch will you be mentioning that you still have your rollerskates on from last night 😂❤️Happy Birthday and thanks for sharing all your love.", "soverystacy": "Love, love and love to you. In this filtered everything world thank YOU for being real. I feel like that. I understand. I can relate. Thank you for making it all ok to be how we are. ❤", "trina_mcneilly": "You language to things I have felt. Your authenticity is a gift. Look you are giving gifts on your birthday. I hope your day take a turn 🙏🏼✨💕", "heygirlhill": "@jengotch you are all of us (especially entrepreneurs like myself who ask themselves at least once a month \"what the actual fuck am I doing?\") my favorite part about you is that you are equal parts ass-kicking, name taker and real life human woman. Have the happiest of birthdays, here is to another year of taking chances, telling fears to fuck off, and all the carbs 🎉", "marissaaross\nVerified": "Verified", "haydeesentianin": "Well, happy birthday @jengotch I hope that someday you can start disowning those feelings. Have you read Power of Now? Really great book. I think it would resonate with you. Have a beautiful day.✨", "rampanelli74": "🎁🎂😘", "thejunglefish": "You are human, so feel all the feels! ✨ Sending so much love, lady!!! Happy birthday!!! 🦄💖🎉", "nantuck3t": "Preach. Happy birthday Jen! You are the best 💕", "tarajhaaz": "😘😘😘", "imjaclynpaige": "💜💜", "crystalmeers": "Feel those feelings! Sending you love and strength and those super neat tissues that are always cold for some reason!", "mariamariagzag": "Whenever i feel like that this cheers me up 😊🤘🏼👊🏼💪🏼 http://youtu.be/EFEmTsfFL5A", "ricaitlyn": "I love every word you wrote!! 😘 Happy Birthday @jengotch from Indonesia 🇮🇩🎉🎉", "colemoser": "You are amazing.", "laurelbartel": "❤️❤️❤️❤️❤️", "kindredvintage": "You've got this! ❤️❤️❤️ thanks for being real, remember you're never alone in your feelings!", "jubykate": "My birthday too and so far feeling very much the same. Happy birthday!! 🎈", "annaburnz": "🎈", "clechristi": "You're my hero. You've taken all these familiar struggles and then built friendships and a successful business and inspire so many with your honesty. Happy birthday to you.", "thewhimsynomads": "HAPPY BIRTHDAY🍾 Thank you for being such a real person and sharing all sides. It's truly inspiring to follow someone as real as you are. We are so lucky to have you as a role model💓", "cruzbrand": "I hear you, thanks for being real.", "dearjovial": "Thank you for sharing all sides of you, and this is why you're so amazing! Happy 45th birthday🤘🏻if I were to make a wish list of the people I want to meet in real person, you're on the top of the list!!!! 😘😘😘😘", "lindsaybethtx": "This is so raw and real and it's magical to be this real with the world. I love you!", "somiapparel": "Happy birthday, beautiful.", "yliimeee": "💕", "modshop1": "It's your party and you can cry if you want to .... Btw I feel exactly like that most days ... Not just on special occasions. Hang in there !", "somekindofhappiness": "❤️", "nehasharmaphoto": "❤️❤️❤️", "meowin_around": "Happy birthday you beautiful creature!", "goldcadillac": "you are magic 🔮 happy birthday!", "platycait": "I so appreciate you always sharing the good and the bad and doing it in such a genuine way. you are seriously an inspiration. I hope the positives come through harder today and that you have a wonderful first day of 45 ❤️", "elfisodyssey": "You rock!", "3olivesplease": "You're imperfect, and you're wired for struggle, but you're worthy of love and belonging.", "nicolederus": "This post is everything. You are the most authentic person I follow on Instagram and happy birthday!", "emelinn": "❤️💖", "sunnysauce": "i've never met you, but i love you. thank you for sharing.", "kat.manwathiel": "@jengotch happy birthday from Greece!! See your weirdness has gone global 🙃 Love yaaa xxx", "martadooodle": "Sending you Love from Berlin!", "pandawagon": "Hugs and happy birthday to you Jen! 💕", "alysondietzart": "Love the honesty. These days happen to all of us and it's part of the journey. You've got this!!", "cathybrownbrown": "This is the most beautiful honest post I've ever read.", "sprinkledlife": "😗😗😗", "roxyluvsya": "The devil IS a liar! You're feeling lonely yet surrounded by people who care about you--talk about good relationships! And feeling deflated on the day people inflate balloons in honor of your life 🎈 Reject the lies, embrace and the truth--you are loved, you are important, you are valued!", "held_am_herd": "❤️", "chelseaginai": "Big hugs and lots of gravy love mama. ❤️", "erios69": "Hugs to you.. allow yourself to have the feelings then pull yourself out 😘", "susanawashere": "Thank you for peeling back these layers and exposing these vulnerable feelings that many of us are too frightened to showcase publicly. These emotions come out of nowhere and what's more important is how we take action and proceed to do a little damage control. Thank you thank you thank you, for sharing the importance of vulnerability. I wish you a speedy recovery and all the best birthday wishes stranger 🎈", "enigheid": "😘", "hailstorming_": "Thank you for 'gramming' the full human experience. Far more beautiful than white walls and farm house sinks that now consume this app and distort reality.", "louloumh_x": "I just think you're wonderful. What you put out into the world is honest and beautiful. Thank you for sharing that.", "studio_sue": "💖💖💖", "jlolo72": "Congratulations @jengotch You're HUMAN...and female! This world would be a less colorful place without you. So, be proud, smile, fix your mascara and go on with your bad self and have an amazing birthday! P.S. I have no idea who you are but I love your Instagram posts! 😃👊👊", "bycaralauren": "You are amazing. Thank you so much for being so real and frank and honest.", "maddibearrr": "Thank you for sharing this with us and for always being so real and authentic 💕💗 Happy Birthday to a beautiful soul 💗💕", "nettieandmin": "Rooting 4 u @jengotch! You are my spirit animal!", "leilaakramer": "Happy Birthday!!! You shine brightly any which way you show it. So appreciative of your genuineness!!!", "rachelnevers": "You are an inspiration to so many! Sending love and hope from Brooklyn.", "__heygabs": "Thank you thank you thank you. Talking openly about feelings that aren't just the happy ones is so important. I hope you know you are an incredible role model to so many people and being so honest is one of the many reasons you are mine. Happy birthday. Feel alllll of the feelings this year and embrace them. With destruction, comes creation.", "vickilee78": "You rock, Jen! Your quirkiness, honesty and realness inspires so many. Thank you for sharing. Cheers ✨💕", "_brittanygonzalez": "@jengotch you must be my spirit sister, I know vibes when I feel them. I can't begin to tell you the #realstruggle I go through when I feel all the FEELS but then I feel tremendous guilt for even feeling them....like I'm not allowed to feel any of them so I gotta get it together which quickly snowballs into.....paralysis. Solution? Order some pizza, drink a beer, watch a movie in bed, and let yourself be vulnerable and caught up in the feels. Tomorrow is another day, & life can be celebrated every day 😉", "ginghamgirlgreetings": "Thanks for your honesty & self awareness. It's the best part of who you are. Feeling so lucky that you share it with all of us!😍 p.s. 45 looks good on you.", "kdimoffphotography": "i felt just like that on my birthday last month. i get it.", "nosliweilak": "I always have a really hard time around my birthday. I'm not sad about getting older, there's not really a good reason for it. My depression just really likes to make sure and be known around then. I love your honesty and the fact that you share not just your good times, but your bad ones too. You're the realist person I follow on socal media and I really appreciate that. Sorry you're going through rough patches right now. We love you! ♀🏋", "hellokeshia": "❤️hugs.", "bellaharo": "You are beautiful inside and out and majorly inspiring! Happy Birthday!!! 💘", "blynch1997": "Sending love 💛", "westtsidestory": "❤️you keep feeling! that's the human experience and you're entitled to feel whatever you feel. your feelings are valid!! there's a greater purpose and you're speaking the truth. happy birthday Jen!! May you have an abundance of love and light shine into your world 🌎", "vanessaquigley\nVerified": "Verified", "party__piglet": "Your vulnerability to express everything is beautiful and refreshing and an example to all of us. Fullest of days to you on this the day of your birth. Enjoy each emotion, whatever it may be. 💗", "tejellebasil": "you are my spirit animal! 💕", "thecrabandthemoon": "We are cut from the same cloth girl! I am the queen of birthdays. I LOVE my birthday.. and this year I couldn't stop crying and feeling so sad and bad about where I am in life (which makes no sense because I think I've surpassed my own expectations of myself). Emotions. They're weird. All emotions aside.. i wish you a very HAPPY birthday 🎈", "wmojejdomowejpracowni": "😘😍💪✊👊💋", "clairetschann": "Vulnerability is a quality that many people have a hard time showing to others (or to themselves for that matter), so thank you for doing so. By you posting this reminds all of us that it's okay. Feelings are okay. Thank you. Now, it's your GD birthday and you're Jen fucking Gotch, and it's Friday! Tears are allowed but so is fun! HBD!", "seegold": "You're the best! Don't forget that ❤️", "melodrama": "💕💕💕💕💕💕💕", "deneisebuckophoto": "You are such a wonderful person! Love to you sweet, beautiful , funny girl.", "itsjosienotjose": "Happy birthday, Jen! You're my hero!", "_mariaalcantara_": "❤️👊🏻", "instagrash": "Dude you've got a lot of light in you and you've been lighting up the world. Life can be shitty and unfair and totally hard just to like exist but you bring the good stuff. And you know how to laugh after the tears. Thanks for sharing. Happy birthday. 💕", "deenkat": "❤️🌷❤️🌷❤️", "ilovemaryallen": "This 💗", "21_k": "Happy Birthday! It just means your on your way to a new stage in life. Let it out and keep it movin.", "hellolurner": "@jengotch This hit home hard. Thank you for sharing these thoughts and, in doing so, validating mine.", "kellyforever32": "I totally get it. Cry it out and enjoy your birthday. ❤️", "cryingatwingstop_": "You are a serious inspiration. When I started following you it was because you exemplified Boss Lady goals, but since then I've come to admire your candidness and bravery as well. Keep on keepin on and Happy Birthday! 💕✨", "kelseybethune": "It's important for you to know that meeting you at Create & Cultivate was such an encouraging experience. That you were nice, genuine, kind, humble & just as kooky in person as you are via social media was maybe more inspiring than listening to 39573819 amazing women speak on panels. Just thought you should know. Happy birthday, fellow October baby with all the feelings.", "carolinesomers": "This is raw and powerful and vulnerable with zero self-pity. Just a beautiful honest portrait of a woman. So much love for you @jengotch <3", "carliestatsky": "Thanks for sharing - happy birthday to you and your bright, beautiful and resilient spirit! ✨🎉✨🎉✨", "sarahhayeshello": "I've cried on every single birthday. Feel your feels! And hopefully have a god time too", "cristinafoos": "💓💓💓", "alexandraleitner": "I think you're pretty cool! ✨and i hope i'll be like this when i'm 45 too 💕", "kristen.poissant": "❤️❤️❤️", "sarahmeetsworld": "Hope things get better, you're never alone❤️ if I lived in LA I'd bring you flowers but I'm from Wisconsin so here's my attempt 🌷💐🌺🌸🌻🌹", "tulajeng": "Hugs. Lots o' hugs. 😘", "jesmerson": "💖", "pinkbbwhiskey": "You are such a badass! Happy birthday! And thank you for your transparency and honesty. It's what makes you so inspiring! 💜💘", "pattymelt": "💕", "sid_ney_howard": "Love your vulnerability and organic beauty. Happy birthday.", "putyourbootson": "So much respect for this xxx", "lennoxbishop": "yes yes yes", "pishposhlove": "You are so incredibly strong for posting this picture and expressing yourself. You may or may not realize it but someone who is not as strong as you just became stronger by seeing that other do have these feelings as well and it's okay and will get the strength to make a change! ❤️🙌🏻 Thank you for existing Happy Birthday Jen", "leefromamerica\nVerified": "Verified", "linda_aust": "I feel like that a lot too! You're not alone!!! 😘😘😘", "yodice": "Thinking of you today ❤️ wishing you a happy birthday", "mustachemelrose": "😘😘😘", "emilymcboyle": "I appreciate these posts as much as any. I'm having a stupid tear-filled day for reasons out of my control that I feel like should totally be IN my control but...life. I signed into Instagram and thought to myself, \"I'm having a shitty day, let's see how everyone else is loving it!\" So, thank you for your honesty and your light, every feeling and every day. ☀️", "that_california_love": "Love your honesty. We all have those feelings, but you deserve EVERY good thing that comes your way. We weren't put on this earth to feel miserable. Sending so much love to you today and every day!! (((❤️)))", "liz.spila": "I get the same feeling on my birthday and it's so inexplicable!", "emmahyndman_": "@brendannolangermain celebratong vulnerability, she's the founder of the comp where I got my plannerrrrrr", "lindseylovesyoutoo": "💕💕💕💕", "artistwandering": "💘🎂✨💞🙌💖🎉", "hadynamite": "Love 💕", "jmamaorama": "Awww! Not the best way to start your birthday morning! I know it's corny, but turn that frown upside down🙃🎂I hope by the end of the day you can celebrate you, the best you💐", "ohjoy\nVerified": "Verified", "mrserin_taylor": "Feel those feelings! You're amazing. Happy birthday!", "anabotelho_creative": "Just your sharing your feelings and vulnerabilities is so healing to you and others and SO BRAVE!! You share all of it and I'm very grateful. So easy to show only the good on social media. You're one of the few that also shows the difficult side of life and we can all relate to that sister! Happy Birthday!! Thank you for your great feed! You're one of the funniest and most real people here.❤️😘", "jaclynjourney": "💕", "sleepybrittany": "Love u Jen!! We are all in on this sometimes awful human experience. You aren't alone 💓💓💓", "_melaniepace": "Wow she's so amazing @madzpaul", "bettinakina": "❤️", "lynzey": "Every. Damn. Day. I hear you to my core. 💓", "littlebink": "thank you for sharing this. internal dialogue that brings you into a \"pathetic headspace\" is something i can relate to right now. you sharing it made me feel a little less alone ❤️", "kaelanapier": "Thank you for honesty ❤️", "arfotografie": "This is a wonderful honest post. Happy birthday💝 And remember how would you know what luck and happiness feels like if you didn't know the other side. After all we're just humans. At some point it will all get better again 😊 thank you for your honesty. All the best from Germany", "t.lorentzen": "you are fabulous 💗", "woollygrl": "Thank you, thank you a million times over for being publicly human. You are an incredible role model for so many of us, and your honesty, humor, and lack of pretention are a huge gift to the false world of online appearances. Happy birthday, @jengotch", "cursivedesign": "🌬💕", "tarawhitney": "I understand. 💓", "whitneyleighmorris\nVerified": "Verified", "virginiakphoto": "Happy birthday, sweet lady! Cry until you feel like smiling then put on some great lipstick and rock it! It's your day. ✨", "sarahkuehn": "💕✨🍕🍭🌈", "sundayforever": "We know what you mean, but happy birthday anyway. You get in bed and cry if you want to. Sending good vibes your way 💕✨", "erinloechner": "So much love here, friend. I love your true and honest self. 💛💛💛", "chubbystick": "I think the most important part of what you've said is that you know you'll get through this. That's kindda what matters the most. Most of the time, I don't know that at all. Happy birthday, Jen. ❤️ Ride out the wave 🌊", "ereyayouknowme": "❤️ all that you do.", "sarahbuckley.art": "💛", "kkaarriissaannee": "appreciating you're realness today lady. celebrate you, you bad ass babe!", "yakirav": "Happy birthday!! You have inspired so many people to do positive things. And maybe that roll scares you because you look back and realize you carry an important role. just know that every side of you can be inspiring not just for us but for the inner YOU! Let's your emotions be what they need to be but use them to positively keep you moving (after all the tears are dry of course) cry it out then maybe laugh it out later :)", "prouddweller": "So much real. 🤘🏻✨💓", "chelsannalexander": "I wish more people were as open with talking about what's going on in there head as you are. I think humanity could benefit greatly. And btw, I think you're a fucking rockstar. Don't ever forget it.", "cocodanger": "You are a magical lady boss with endless inspiration for girls everywhere! You probably don't want anybody to say look at the \"hang in there\" picture of the kitten in the hammock poster. And that's okay! Just be sad! But there will be a time when it will be better.💕💗💘", "aimdroid2.0": "All of this, give me the feels. I relate so much. I love you and love your honesty. You're my hero, and I hope you have a wonderful and cherished birthday!", "sarahmiranda02": "Sending hugs your way! Thank you being so honest, so raw. Allow yourself the moment to feel, to cry, it's part of being human.", "airparrott": "Big hug, Jen! It's so human. We love you. Happy Birthday 💗", "jenayross": "Happy birthday! Sending love 💓", "jennyno17": "@jengotch we all have those days! It sucks but it's real. And most of us don't talk about it! You're not alone ❤️ Happy birthday! Grab a donut....always puts a smile on my face.", "seesarahgo": "❤️❤️❤️", "melodymargarit": "🎂✨", "edgeofautumn": "❤️❤️❤️❤️", "trinatree647": "Oh wow ,what a reflection of me! I deeply appreciated your truth.and your nt alone", "theparsonslodge": "Love the authenticity of your words. This will mean so much to do many who read it. Here's to a better weekend! 😘", "berlinisforlovers": "You are a true gift to the world. Thanks for keeping it real. Χρόνια πολλά (happy birthday in Greek, but literally translates to \"many years\" 😘)", "mindykennenbeauty": "😘😘😘", "thepiperbrownshowroom": "Abso - fucking - Lutly BEEN THERE 👊🏼thank you for sharing and being real. Your a badass! ❤️❤️❤️", "jenn.louise.w": "This is amazing. I love following you! YOU R A ROCKSTAR 🍕🍕🍕", "jen_dowell": "❤️", "kkdreger": "Thank you for your honesty. Happy Birthday.", "sandrafloratos": "❤️❤️❤️❤️❤️❤️❤️ so much love for you Jen!", "catebp": "I don't know you, but you are the most vulnerable, relatable, real person in my Instagram and Snapchat feed. I don't feel bad for you, I feel LIKE you. And sometimes that rawness in and of itself is pretty damn beautiful. Thanks for sharing Part 1 AND Part 2 of your life all the time.", "singsavana": "Thank you for sharing. Your honesty is refreshing and making a difference. Thank you. Happy birthday!", "mirandatanner": "Happy birthday lovely!! 💗 you deserve all the pink skies", "lindsey__shea": "Thank you. You rule, haply birthday!", "sallinthecity": "❤️", "nicolecostello_": "bless you for being so real ✨", "melissarae": "💕", "honey_bunnz626": "💓", "carablasen": "Thanks, and happy birthday 💕", "zyanna": "Hang in there BB. 💕", "thistleandbe_holly": "Sending all the love your way. May your heart feel full and purposeful.", "sashimi_bell": "I know how you feel! Some days I wake up convinced that I'm ugly, unlovable, crazy, and unimportant. You are beautiful and a huge inspiration to everyone you come in contact with. Just remember that today 😊 Hope you feel better soon, happy birthday!!! 💞 🎂", "kellyhuljev": "❤️❤️❤️", "katiebeandesouza": "Honesty. 💕 HBD", "thescarfandstripe": "\"I'm just interested in portraying all sides of the human experience...\" yes! Thank you- your honesty helps us all.", "estefania.fernandez": "It's your party and you cry if you want to!❤️😘", "nora_oso": "I totally get you, this is me on almost every birthday of me!", "samanthaapaiige": "You are so adored and looked up to!! Thank you for always being so honest!!!", "hillarycoke": "Proud of you. 💕", "kawaiisab": "💛", "alexnoiret": "💗", "cuteisimportant": "❤️", "katydebard": "Oh Jenny. You are so loved. Hang in there. ❤️", "get_takeout": "Love you Jen.💘", "n__c__g": "❤️✊🏻", "rebeccadecz": "💗💗💗", "amelia_bratton": "everything will be ok💙"}