{"thepaperpeony": "The Language of Letting Go. 👍", "sarahzentz": "@gracekellyleon on the topic of self help.... here we are", "amandarosezamp": "You would LOVE #FuriouslyHappy by @thebloggess (Jenny Lawson)! Like L-O-V-E love it!", "luxuryspiritual": "Haha half of these are in my library!", "wildwhim": "Also Lissa Rankin’s Mind Over Medicine", "books_mytherapy": "SUGGESTION...💜..The Gift of Imperfection, 💜 Let Go of Who You Think You're Supposed to Be and Embrace Who You ARE. 💜 By Brene Brown PhD 🙌🌟. LOVE!!!!", "kathrynheine": "Read “The Highly Sensitive Person” !!", "aussymac": "@mllesobel", "maggieantalek": "Highly recommend Big Magic!! Great for anyone in the creative field :)", "noelsmall": "I too have read like 5 of these greats! Unteathered soul is my FAVORITE BOOK! Great minds mi amore 😘", "mobrumbach": "Love these! Now on my list. What was the diary app you recommended on the podcast?", "corpenyc": "Untethered Soul #2", "herwelshness": "Success principles! 🙌🏻", "oliviamorrissey__": "Amazing choices sista!", "gabpro": "@jacquelyn_nyzio", "iwill_evolve": "I feel like im the only one that has had a hard time reading the four agreements.. i just couldn't get into it. maybe it was just the wrong time for me.", "leeleelives": "@blaynepearceplanit ace papes", "shopcompliment": "Anatomy of the Spirit was LIFE CHANGING. Read it during my divorce. Realized I got out of there just in the nick of time. ❤️", "lisa_jayne_lee": "Ohhhhh gonna get war of art or whatever that one is. On my nightstand, Soap Crafting and Boundaries. 😜💋", "gyvilla": "The Clarity Cleanse", "bee.k75": "@whatgrandmaknew 😍😍⭐️⭐️", "mommmasmith": "@mrs_broseker", "waycrunchy": "How to Fall in Love With A Man Who Lives In A Bush", "hellotiffyt": "@amandakayestes @megankatemoore @m.double.i ❤️", "dustykayd": "Loyalty to Your Soul, The Surrender Experiment (same author as untethered soul) and E3 (by Pam Grout) all great to add to the list! ❤️", "ginny_dom": "@rrhawk", "kerrig_": "Currently reading Daring Greatly by @brenebrown and plan to re-read again and again", "sammisocial": "Mindfulness Nerd Starter Pack 😜", "marymdeyoung": "Have some of those books; and am currently going thru them again, myself. Thanks for reinforcements @jengotch", "gabywinters": "Currently reading: “French Women Don’t Get Fat” 😆 It’s helping me back on track after years of physical trauma when I used food to cope with my feelings and symptoms. Now, healthier and determined to have a healthy relationship with food.", "rsb47": "Try some fiction to get out of your head. I have so much anxiety and nonfiction self help books make me wanna take a long walk off a short pier", "madisonlorenz": "@giorgiabutt @sofialpoggi", "codyof90": "“The Four Agreements” is great!", "palmspremium": "Thank you for this 🙏🏻✨", "upholstery_club": "https://www.nytimes.com/2018/07/17/well/intuition-gut-instinct-psychology-midlife-crisis.html", "jessruthfitness": "Add @simonsinek to the list!!!", "sistergoldenshop": "Eckhart 🙌🙌🙌🙌🙌", "eklundgriffin": "we love the four agreements! Some new ones to check out :) thank you for sharing!", "vanalienz": "Four agreements is 👌🏼", "oliandc": "The Success Principles is a fantastic book! My husband and I call it our bible because we have applied these principles to our lives and it has changed everything for the better. I am giving it to my brother as his graduation present as he starts his new life. Best of luck with your journey.", "knealeculbreath": "\"Feeling Good\" by David Burns is my go-to and constant companion. Cannot recommend it highly enough for anyone interested in CBT and changing those messed up messages in our brains that tell us we suck. Life-changing ♥️🙌🏾♥️", "imeelyons": "THE FOUR AGREEMENTS", "__csindy": "@cailintenbensel “that bitch that lives in my head and constantly reminds me what an untalented dickface i am” 😂", "nikitazook": "I LOVE The War of Art 😍 That book changed my life", "tandmrealestate": "Untethered Soul is one of my all time favorites ☝️👏🙏", "wonderinghelen": "I’m reading Michael Neill’s The Inside-Out Revolution, and it’s life-changing. (I read self-help like it’s my job (it kind of is—I’m a coach), and this one is unparalleled, quite frankly.)", "breaking_blondes": "The Untethered Soul is 💯", "omg_its_kiwi": "The Four Agreements🙌🏾", "cc_jillian": "I love you 😅❤️", "gigimakesmesmile": "Cutie!", "far_fromthecity": "@electricamber well look what book is there! 😀", "carmen_mon_oxide": "Feeling Good has helped me!", "vetiversalon": "I found the Audio book of A New Earth easier to follow!🎧", "sugarbeachevents": "Loved ‘The Power of Now’ by Tolle.", "blinkblinkbags": "You’re going to need a deep cleanse from all that with a dirty book. I find if I read too many self improvement books back to back I start screaming at the author.....wait, That’s normal right?", "oldcity_mailroom": "Success Principles is the bomb. It’s a game changer.", "laureneleveneleven": "And War of Art 🚀☄️. Also Radical Acceptance 💓💓💓", "jennifer.fogerty": "You go girl! Fight for you!", "juliethroughtheglass": "I love @jackcanfield_official !!! 🦋✨☀️", "katestrongnz": "I’m reading The War of Art atm too 🤣", "jennblosil\nVerified": "Verified", "inhershoesmvmt": "LOVE the four agreements. Thanks for sharing this! Can’t wait to pick some of these up 📚", "sarahandmaude": "Untethered Soul was recommended to me a year or two ago. It was the first “self help” book that really spoke to me and my anxiety issues 🙌🏻 Currently reading and rereading Mindfulness: A practical guide to finding peace in a frantic world by Mark Williams. It has has truly brought me peace, and given me a lot of understanding, during a particularly tough time with my anxiety. Also great, The Anxiety Solution by Chloe Brotheridge 👍🏻❤️", "theintellectualwasteland": "@jengotch do not listen to the voice, I REPEAT: DO NOT LISTEN TO THE VOICE! She is a liar! If you weren’t talented, would @shopbando be as successful as it is? If you weren’t talented, would you have signed a book deal? I think not. Tell that to your voice next time she goes ape-shit, will you?", "emilyprim": "I’ve read 7/12 of those ❤️. Nice collection!", "loriafreeman": "I read every self-help book known to man it seems until I landed on Letters From a Skeptic and finally found my answer. That was over 20 years ago and since then even through the toughest things life has thrown me I have Peace.", "bethhayesking": "Also every @brenebrown book! ✨✨🦋🦋", "campbellcate": "I love The War of Art! And this episode ❤️", "emily3t": "@lyndeemartin", "simplydaharis": "Oh light is the new Black is a very very good ome", "embrace_agency": "The subtle art of not giving a fuck 👌", "ahnahendrix": "The Power of Positive Thinking - one of the BEST books ever. Timeless. Powerful. I go back to it constantly.", "meldubie": "Feeling good🙏🏻", "psamwelch": "❤", "leviagee": "There's a great book on acceptance and mental health coming out to US soon called You are Not a Rock by Mark Freeman aka Everybody has a Brain (England publisher) that I find really helpful", "mama_sea_ta": "Literally half of those are on my nightstand right now too", "vallegirl66": "Anatomy of the Spirit - one of my all time faves.", "laylee_o": "The BEST summer reading! I’ve read them all (except for one). The most profoundly transformative one was/is ANATOMY OF THE SPIRIT! The level of mastery and truth of Carolyn Myss is profound and almost holy. 💞", "britnim_": "Radical Acceptance and Anatomy of the Spirit are two of my favorite, game changing books. They won’t let you fall into self deprecating behavior, instead they will give you the tools to recognize what to do when those moments of doubt (really fear) arise. You’re an inspiration to so many! Thank you for sharing what’s on your nightstand!", "amyelsesser": "Currently reading Feeling Good and The Subtle Art of Not Giving a F*ck. Both excellent and great companion books!!!", "shahzam7": "@mehap12 ^", "elvafields": "So many good ones here, and am especially into Seat of the Soul. I wonder if you might dig Joe Dispenza’s Breaking the Habit of Being Yourself for more of the brain/mind/body v/s soul/higher self goodness? Thanks for the real-ness you bring to life - so flipping refreshing. ✨", "addkavev": "@lipsticism", "cpfry": "My husband is reading how to change your mind right now and is loving it!", "casaclayton": "Your reading list is beautiful. A little Angeles Arrien might be good, too. She is amazing.", "surfgirldesigns": "I just found \"The Four Agreements\" on my bookshelf this weekend! It must have been in a box of books one of my boys' teachers gave us!", "thatclassygirll": "@vannahlayne", "tlcnewyork": "Isn't it amazing how much of our attention and mic privileges we allotted to white males back then? I've also been enjoying personal growth books from the 70s/80s lately, and am struck by the overwhelm of literature from qualified, rational, helpful white men. It's disorienting. Some of them: \"I'm OK, You're OK,\" \"What to Say wen You Talk to Yourself", "sarah.g.rose": "Burning Woman because it is unraveling all the stuff I have been told vs. the stuff I know. My Untethered Soul cured me.", "shannoncottrell": "Great selections! Also Don’t Feed the Monkey Mind helped me so much with anxiety ❤️", "allisonmac": "Untethered Soul should be required reading for every person on this planet!!!!!!! Life changing", "tanashajuarez": "@christineangelguam", "natashalevinger": "The Sedona Method has given me peace like nothing else.", "jackiefreed.la": "Feeling Good got me through the end of university along with a great therapist 🙌🏻💛", "theblogginbabe": "I see a few on my list! I would also recommend @jensincero You Are A Badass! I’ve pretty much highlighted the whole thing at this point 🤓", "smithcarleigh": "Yes!! Feeling good by David Burns has turned my life and my outlook around 💯💯💯💯", "deelea": "My doctor just recommended \"Feeling Good\" to me this week for my anxiety...while I was wearing my anxiety necklace. 👐🙆", "christineangelguam": "@tanashajuarez wha!!!!! The key to my heart!! Love this", "lidiaferr": "Wishes Fulfilled by Dr. Wayne Dyer 🙌🏻", "jessmacboc": "@happy_ev", "brianna.rae.spring": "Michael Pollans book sounds really interesting! It’s worth checking out his interview with @joerogan as well. The healing power of psychedelics ✨", "themissems": "Creative Visualization is a cool book. I've read Power of Positive Thinking too. Thanks for this, screen shot to check out the rest!", "megananne8811": "@juliec615 you were right on when you told me to follow her, I literally have every single one of those books!", "intheknowglow": "Looking forward to reading how to change your mind, frustrating that things with such potential aren’t explored quicker.", "abra_cadabra": "Currently reading untethered soul 🙌🏻🙌🏻", "cdallavis": "Peace is Every Step. It helps me to take care of myself and to be mindful. And it reminds me that when I get depressed my smile may be gone but it is not far away.", "lizhutnick": "Anam Cara by John O’Donohue. Stuff for the soul. 🌈✨❤️", "saranev": "TARA BRACH 👍👍👍👍👍", "4oclockapple": "There's a fifth agreement now;)", "shellspinner": "The War of Art is in my bathroom. Nice short chapters! 🤣", "happiestmcleod": "Yes. Seat and 4 Agreements. So good!", "angelarenai": "Feeling Good tho 🙏🙌", "sparrow_hair_co": "Good stuff.", "caracalifornia": "💫🙏🏽Untethered Soul 🙏🏽💫", "juliehodges_xo": "Holy shit these are some my favorite books. Tara Brach is always by my beside. I love her meditations. I also started rereading Seat of the Soul again on Audible. Gary Zukav has the best voice.", "katewhalanfowlie": "I own most of these too - some read, some not but I recently bought “When Things Fall Apart” by Pema Chödrön @anipemachodron after hearing great things 💕", "barepaws": "war of art is a must! ✨", "mackenziesymmes": "Feels good to know that I’m not the only one with a small library on my night stand. 📚🤓", "brookespare": "I’m reading “Sex Matters” by Mona Charon and coming unhinged 😱", "jennylearpeterson": "Gotta get a copy of Cleo Wade’s Heart Talk @jengotch I know you will love it💗", "aunt__zz": "Omg I’m reading radical acceptance rn & four agreements is on my nightstand!!!!", "majorbaggage": "I just got Untethered Soul and started highlighting on page 2!!", "jennyalmonte29": "Cannot sing the praises of the Micheal Pollan book enough.", "ashleycampbellinteriordesign": "We could literally share the same nightstand. I have read every. single. one.", "ticeisnice": "“Big Magic” by @elizabeth_gilbert_writer it helps me with creativity and moving past those cockblocks!", "rroseleonaa": "4 agreements! There is a fifth agreement also- it has its own book... @jengotch", "emilybagwill": "four agreements❤️", "danimoltke": "@madeline3stelle", "anniebck3": "@jazzylena I know your love for self help books 📚", "msmaverickmuse": "Great selection", "hollhoop": "All of these are so good^^^ a couple little books you can carry with you every day are Finding Strength in Difficult Times by David Viscott and Be Free Where You Are by Tich Nhat Hanh", "manifesting.madeline": "Read The Untethered Soul people! This book will not only reframe your thoughts but also change your life 🙌🏻💕👁", "miss_elle_shepherd": "@india_raine", "melissalipking": "So many of these are so 🙌.. and I also highly recommend @brenebrown ‘s The Gifts of Imperfection", "danaoneill21": "@jengotch yaaaassss!!!! I have 6 of these currently on my bedside table! I used to pick them up and open them wherever... Getting whatever I needed at the time (or as my mind sometimes tells me: bc I'm too lazy and spiritually unfit to read the entire book 🤯😑🤣) anyway- untethered soul was one that rocked my world and settled it all at once. Xoxoxo thank you for this. You remind me that just cause mine are dusty right now it doesn't mean I'm a horrible person 😘)", "heychristinawinter": "Love all these. My favorite books right now are The Tibetan Book of Living & Dying, How to Love by Thich Nhat Hanh, The Power Of Myth by Joseph Campbell, Braving The Wilderness by @brenebrown , Stitches by @annelamott & The Prophet by Khalil Gilbran . ❤️", "kaitlinmarcotte": "I just bought The Seat of the Soul last night and am looking forward to digging into it. Thank you for sharing your book recommendations!❤️", "product360la": "Anatomy of the Spirit!", "brookeblind": "@periapplefield", "charlottehaukaas": "Radical acceptance is THE BEST. It changed my life ❤💜🧡", "bycourtneyprince": "Anatomy of the Spirit is the bomb. You need to go listen to @mariannewilliamson speak in LA- she is the jam", "samanthalouisedesigns": "Everything @brenebrown @jensincero @gabbybernstein @shondarhimes 💕✨💕✨", "shaunasever": "That’s one heavy nightstand. 🙌🏼", "qpo": "@jensincero “you are a badass”! 💯", "cordirey": "the four agreements. It’s on your bed. If it’s one of the ones you haven’t read yet READ IT. That’s my bible. I still take EVERYTHING personally. Work in progress.", "solomoncristy": "You Are A Badass for sure. The author speaks directly to you about that bitch that lives in your head in the same tone. That and dialectical behavioral therapy (DBT) gives you the skills for radical acceptance and so much more.", "deluxemodern": "About to read Unf*ck Yourself. I hear it’s pretty motivating. 😊", "balancebymolly": "The War of Art is fucking amazing", "traceydjackson": "Try Gratitude & Trust - Six Affirmations That Will Change Your Life", "thesoml": "These are great + “Rising Strong” by @brenebrown", "aesthetic_wonderland": "Reading new earth right now! Love", "katherinefitzgeraldhernandez": "@ben___hernandez 👀", "anakaradarevic": "I'm currently reading the autobiography of Oliver Sacks (On the move). Obviously not a self-help book, but still very interesting. It's a glimpse inside the mind of a very intelligent, sensitive and creative man, who has done awesome things as a neurologist and a writer, despite the fact that he lacked self-confidence for a long time. I find this book quite moving and surprising.", "jzlettering": "Brene Brown!!!", "_heydear": "Currently finishing a New Earth! Love all these other ones too", "five.letters.three.syllables": "Four Agreements and Untethered Soul 🤜🏻💥🤛🏻", "oregonmaya": "A new earth is the best!", "chloe_kiser": "Currently listening to that Michael Pollen book right this instant!!! (And scrolling through IG....😬) But wow!!! 🤯💛", "_a_r_w_3": "Anatomy of the Spirit is a good one!!", "arose729": "Tara Brach ❤️✨", "samsaraspeakeasy": "Got some good books there!", "merniemern": "@buzzynna oh look, the War of Art ☺️ I hope you’re enjoying it. I’ve also read The Four Agreements (pictured above) it was a good and simple book. @jengotch have you read Oprah’s what I know for sure? I also recommend The Las of Spirit, Dan Millman.", "soulsadventures": "@jengotch what an amazing stack for your nightstand. I love them all! I’m re-reading Seat of the Soul right now and it never ceases to amaze me how gooooood it is! ✨💫💕📚", "spraypaintedlace": "The war of art sounds exactly what I need right now", "melynmarie": "Shakti Gawain's Creative Visualization is one of the best, I revisit those pages quite often. I am currently revisiting Women Who Run with the Wolves: Myths and Stories of the Wild Woman Archetype, by author and poet Clarissa Pinkola Estés, Ph.D as well as, Cunt: A Declaration of Independence, a 1998 feminist book by Inga Muscio. Both too, awesome reads. All three of these books I read in my late teens, even better to revisit in my early 40's.", "waikikibina": "That bitch in my head I can relate to that, I have her too 😂 I just started to read „feel good“ heard only good things about it let’s see ☺️", "allicolasharpe": "Currently reading emotion code and power of now! 📚 adding some of these to my list.", "pearlybird": "Love untethered soul! 💙", "cristaholla": "@vegancactus all da books", "jennifertrianta": "@thelittlest still have the Four Agreements at my bedside and it reminds me of you!", "vazquezadri": "@newharbinger", "sendwishbones": "I can't recommend The Undiscovered Self by Jung enough - changed my life this year. I also highly recommend Redemption Motifs in Fairy Tales by Marie-Louise Von Franz (an interesting roundabout way of understanding aspects of the self).", "nineretreat": "The Four Agreements ARE EVERYTHING! 🙌", "streicherhair\nVerified": "Verified", "up_bringing": "Heard inspiring things about The War of Art, and would love to read some Eckhart that isn’t just a quote or preface... thanks for the recs! Just diving into The Art of Loving and Women Who Run With The Wolves. Can’t wait to buy a book with you posing awkwardly/brilliantly someday, as the pod makes US feel better right now. ✨🙌🏻🌈💥", "justine_fritz": "@michael.pollan’s book is 🔥🔥🔥 I was in one of the studies at Hopkins and it legit changed my life", "colorquarry": "Please add the mother of them all: Start Where You Are by Pema Chodron (saved my life)", "iamsteph_xx": "Eckhard Tolle is the best🙌...", "fleurwoodsart": "Love The Alchemist, feel like I will read it on repeat for the rest of my life.", "irenefigueroatoro": "A new 🌏 🙌🏼", "jenibrittonbauer\nVerified": "Verified", "reptaryn": "The Seven Spiritual Laws of Success, The Power of Now, The Genie Within (your subconscious mind). The Untethered Soul is the best thus far", "themotherlove": "Michael Pollen’s book, if the evidence is/was put to practice, would totally disrupt the pharma industry. Some might say, “Good for you, not for me,” and I agree but the data.. It’s a brilliant portrait to progressive care for mental health.", "christinawinkelmann": "Ok wow", "aliciadempz": "In Praise of Slowness...cuz we're all overextended!", "lyssnlove": "@soulsadventures I spy that book you had in your insta story & noticed it here while scrolling my feed. I’ll take it as a sign that I need to get it ✨", "natasha.terpot": "@jengotch “The power of Now” is a game changer 👌🏽😘", "instanjul": "Wow! Great selection. Caroline Myss is amazing! She also has a great audio called Energy Anatomy.❤️", "sarahmadepdx": "Tara Brach is a godsend. Her work on compassion is incredible.", "jana_ortigara": "The Book of Joy from Desmond Tutu & The Dalai Lama should be in everyone’s list!", "teamwoodnote": "how to change your mind 👏👏👏🍄🍄🍄", "jenniflam": "I love so many of these!!!!", "hevz_forevz": "The Upward Spiral - using neuroscience to reverse the course of depression by Dr Alex Korb has been infinitely helpful to me in understanding and helping my brain work and doing some of those ~things to help you feel better right away~ &&& Liminal Thinking by Dave Gray helped me look at my beliefs/reality in a different way. X", "hou_joo": "A new earth... plz read stat", "camillabee": "I’m trying to read Feeling Good too. Came recommended by doctors and friends. My fidgety nature means I’m not a huge “reader”. But a few paragraphs down, some highlighted portions. It’s a start. And it’s helping me make sense of my brain and feelings a little more. Thanks for sharing all this. The worst part is feeling like you’re the only one struggling, and everyone else is “fine”.", "mallyce": "The four agreements and the mastery of love are the best! ❤️❤️", "scrounge_lounge": "Please: Read “Feeling Good” and toss the rest. It’s the only book you’ll need. It’s based on science, not pop psych or religion/spirituality.", "curlyqpd": "Omg I’ve read em all", "hkflife": "How to Heal Your Life by Louise Hay", "liza.jenza": "Currently reading the book of secrets (deepak chopra🙌🏼) it’s truly helping me look inwards and make sense of my sometimes toxic thought processes", "valeebalcazar": "The four agreements changed my life! ❤️", "withhannaholivia": "@dcreed66 lots of these awesome books look familiar:)", "mamakasss": "I ❤️ Eckhart Tolle", "weelicious\nVerified": "Verified", "geogeo_yv": "Love all of these. Untethered Soul & Surrender Experiment are Life changers!!", "hollyferris_": "So much good right there!! I've been obsessed with Seat of the Soul for so long. I keep that one in my bedside table. Happy reading and expanding. ❤️", "tambear18": "I have listened to Oprah’s podcast with Gary Z. And his book, Seat of the Soul sounds so helpful! I want to buy it, read and apply. 👌🏼", "_emily_pope_": "Thank you SO much for this podcast and this post ❤️❤️❤️ I so needed the thought that Band-Aids are not the same as self care! In reading Come As You Are currently and having to read it SO SLOW so I can process everything.", "deneisebuckophoto": "Positive thinking - I was going to recommend to you but now I don’t !! It’s a good one !!!", "andtheearthstayedyoung": "Oh yeah, Anatomy of the Spirit is so excellent. And I stand by my recommendation of Women Who Run with the Wolves (Clarissa Pinkola Estes) and If Women Rose Rooted (Sharon Blackie). They are both constructed around myth and story and each chapter pretty much stands alone so you can dip in as needed without worrying that you’ve lost the thread. 🤓☁️🕸", "thetiffanyhan": "Radical Acceptance is my EVERYTHING!", "orangeyougladididntsaycherry": "It’s a little Jesus-y but falling upward by Richard rohr is amazing!", "lizall1980": "The Seat of the Soul, because Oprah", "hollybealaporte": "The War of Art is a constant on my morning commutes! 💫", "consittd": "Pema Chodren : Heart Advice in difficult times", "bloombainbridge": "Thank u.🌸", "jocruickshanks": "Love untethered soul soooo much 🙏", "malsperling": "Just got the Untethered Soul from amazon yesterday! Excited to start reading it, even though I’m terrrrrible with these types of books, I’ve heard a lot of good things about this one.", "enthalphie": "Thanks for sharing! I am currently reading Unfuck Yourself by Gary John Bishop. It's such an eye opener!!! 💛", "vrklempt": "@lizwelle got me reading A Really Good Day by way of that Pollan book you’re reading", "tburgler": "Have you read Pema Chodran? The places that scare you are a must read!", "lineslovelylife": "Oh I love these books✌🏻😀", "rachelchada": "Ooh I recently read The War of Art for my podcast, A Little Help Please? (oops, plug). I really liked some of the principles (hello, Resistance), but I had a hard time connecting to a lot (most) of the examples he uses throughout the book.", "whiterabbithightea": "Add “A Road Less Traveled” by M. Scott Peck M.D. and “The Art if Loving” by Erich Fromm and anything by Rollo May", "brietammarop": "Feeling good is my bible @jengotch the best!", "nadiawhitehurst": "Anatomy of the spirit ✨🙌🏼🙌🏼", "cailendriley": "Just finished the book Bittersweet by Shauna Niequist. You’d love it, changed my life!", "shopb.ca": "My very fave is The Four Agreements. Always makes me feel better!", "kaelyn_clarke": "All great reads!! I am in the depths of 7 Success Principals of Highly Effective Individuals. Also, always picking up Living Your Yoga! ❤️", "kaayyp_": "I love The Four Agreements. A true classic for everyone.", "evasuarezv": "feeling good saved me during some rough times 💛⭐️💛⭐️", "shankkitup": "I just ordered “Feeling Good” and for $3, it’s worth a shot!! Definitely looking forward to it. Thank you so much for being so transparent and open about your journey! 😍", "megkathleen93": "Must be a big nightstand", "kmodesto": "I have two of those - seat of the soul and the four agreements. Love. I need to revisit them both.", "victoriajprice": "Currently reading Flying for Beginners by Jo Emerson, all about squashing that cockblocking voice in our heads, finding our confidence and self-belief ❤", "emmybee21": "@rain1178 summer reads", "laylakatz": "Untethered soul is 🤯🤯💕❤️💕", "amplified_heart": "Love you podcast! Thank you for exposing your soul to us. ❤️", "megrileywinnipeg": "THE FOUR AGREEMENTS!!! So good. 👌🙌 will check out the other titles! Thank you!", "dannyigold": "seat of the soul 💜", "mildadesigns": "I love all of these! But my favorite obsession is the two books @jensincero YOU ARE A BADASS, and YOU ARE A BADASS (with money) 💛💚💙💜", "dipthosedots": "the four agreements is an amazing book!", "bevinsparty": "The Success Principles changed my life!!! So many great tips in there, especially good for folks who are not yet fully into law of attraction type work to wade into it.", "beth__bralley": "@rachkleb", "migdaliarivera17": "😂😂😂🙌🏼☝🏼💛✨", "neeladevyani": "@uneasypeasy", "junctur": "I really liked Feeling Good, probably should read it again", "peteyhana": "my fave self-help book that I go back to time and time again is Don’t Sweat the Small Stuff (and it’s all small stuff)", "tmelitaphotography": "I have several of these too!", "maggierolandi": "@christie.torch", "camilladallerup\nVerified": "Verified", "realbrookewhite\nVerified": "Verified", "amanda_zoomtheory": "You mentioned Untethered Soul in one of your podcasts and it’s blowing my mind right now 🙌"}