{"meggierosedonovan": "Wow. Thank you for sharing with us.", "jenifer.rod": "Thank you for being vulnerable. I also have severe depression. I didn’t take care of myself in the midst of all the chaos and change and lost my two daughters . Everyday I battle trying to pursue my passion and trying to meet the courts requirements. But, despite all the heartache . Im a better mother and leader now. I pray for your healing ☝️💞🦋", "not.that.into.you": "@jacqattaq_ You’ll like her", "jennandbub": "Beautiful 💕❤️💕", "bethyyylove": "@littlecatlee", "carol_hache": "@paulahortal esta es la chica que te comente el otro día. Échale un vistazo porque ifual te resulta útil e inspiradora love you Pauli!!!", "kathysmemoryhouse": "❤️", "adreanne": "You’re amazing and strong 😍", "andreamrozek": "@kcmoen happy hump day pt 2 🐪🐪😘", "michelleayoubi": "@boodlebmom", "jasminirisclifford": "@rclifford90", "melissadiaries": "This is beautiful and thank you so much posting. ❤️", "scizzorhnds": "I don’t know you but I’ve lived this ... you described it perfectly. Thank you", "vickyokeefe_twin": "@miss__ok_ this x", "imalyray": "I connect with this on such a deep level. 2 years ago I found out my husband of 5 years cheated on me for 4.5 of them. I had a strong business and social life and suppressed every feeling I’ve ever felt- good bad and indifferent- I was just numb. Here I am... 2 years later- still a work in progress, but better than I was. I appreciate your forward openness and honesty. 💫♥️", "my.livier": "🙏😘", "megallancole": "@williedictionary", "traicox": "@jengotch babygirl, you look like you are becoming Benjamin Button reversing yourself with healing. I've been doing the same. Keep it up. It's hard some days. The good news is, on days we don't think we can continue onward, we are simply required to show up. Nothing more, nothing less. Thank you for being raw and honest with where you are so that others can look inward from your example. <3", "loulourl": "You are a hero! 💗Thanks for being so vulnerable and sharing with an honest heart!", "hazelinreallife": "🙌 Seeing your journey helps me through mine. Thank you!", "shelbyjac": "I am so inspired by this caption + a big big fan of your current 👌💯🔥😍 Cali wavy beach hair perfection.", "anniegast89": "I can relate to all that . I love you . We are more than we know", "growingoldgreyfully": "Thank you! And thank you for shopbando 😘", "bluegramastamps": "I want to say I Love You like everyone is saying but I feel like that doesn’t cut it! Your podcast helps me, I feel a wave of comfort listening to you even though we’re total strangers. (I hope neither of those things put any pressure on you.) Just want to share that. So, thanks for being you.", "aaliyahdejamone": "Love this, thank you for sharing.", "freedomfarmmalibu": "💗", "laurennovik": "@tfehrman", "git.yo.mind.rite": "I just started following band o. I love the products and buy them at paperchase in NC where I live. Almost immediately after following the ig account saw your posts about mental health. I have been a licensed mental health professional for 14+years. I have always struggled with anxiety and at age 35 really took a rumble into severe depression. This is so important that you share. THANK YOU. EVERYONE should have professional support for their minds, just like they do for their bodies. 🧠+❤️=4EVR", "crystal_fischetti": "Oh yes. I've been there. Now we are realising that we don't have to enter Rock Bottom to be Awakened. We are collectively heeding the signs. Bless your life sister 🌼", "sjthedj": "@christine.langdon", "bbwomensretreat": "Oh girl, this is everything. I’m so happy for you and I love the example you’re setting being open about your mental health journey. So amazing and necessary for most of us to do, and yet it feels like we’re the only ones. Thank you for shining your light out there for the rest of us to see it at the end of our dark tunnels and to know it’s possible to make it through and come out the other side. 💓", "gina.sabatella.foto": "@jengotch BEAUTIFUL SHARE & SO INSPIRATIONAL ❣️🙌🏼✨✨✨ AMEN 👱🏻‍♀️", "melissanatoli44": "Wow ... so inspiring 💪🏻", "dee_coy": "Oh lord. Literally me rn", "jenna_aceandjig": "Resilience ❤️", "missboddington": "💗💗💗", "souvenir_pengajian": "bagus pic 😘😉😊", "_heydear": "Super hero status. You keep me moving forward. Thank you for always being real x", "earthycollector": "This made me cry 💛 so much love to you thanks for sharing this x", "everydayhealth\nVerified": "Verified", "sarahfoo": "@janamalkracka", "melissanorthway": "Thank you for sharing your story 😊", "glamfete": "Your story sounds a lot like my story. Thank you for sharing. Hang in there they say.", "nvr_gvup\nVerified": "Verified", "lorenhope": "You. 🙌❤️❤️❤️❤️", "thelindsayd": "@ohnoitsmarina", "project_animo": "you are incredible!", "missflorencegisselle": "May God bless you forever and always!❤️❤️", "kels_vince": "@chamomiletee you will love her", "jonicamelanie": "✨✨✨", "daybydaywonders": "Thank you for sharing all of this.", "catstenmeowtier": "❤️❤️❤️❤️❤️❤️", "lolynneallen": "❤️❤️🌈", "bonandcopartystudio": "Thank you for sharing !! ❤️❤️❤️", "sittymei": "Thanks,inspiring.", "lindsaymeyerharley": "❤️", "cx.n23": "Love you and your honesty, Jen!", "vosters": "You’re my #wcw", "cindykabiru": "@portaandbella ❤️❤️❤️❤️", "clare_batterton_music": "❤️", "natskewood": "It’s all in the eyes) nice work 🙌🏻", "j.wax": "🙏🏻😍💗love this so much. Tank you for sharing", "eatmedrinkme": "@lilyparky @jmstratt", "ter.rif.ic": "@jengotch You are so incredibly inspiring! Thank you for sharing your stories and giving me hope for better days! ❤️", "heather_raemi": "Thank you for allowing us to be witness ♥️ Your truth is empowering.", "inshaladesign": "Amazing!!!!! This is what I live for 💪🏻🙏🏻❤️", "romanceandruin.marianlong": "Your honesty and courage are inspiring.", "maryzoles": "Hi Jen you are now officially my spirit animal 🙏🏻 Keep going!!", "aweleee": "❤️❤️❤️❤️❤️", "vanewanexaneg": "I don’t know who you are, but this is great! Keep dominating girl!", "ritavee": "✨Beloved, thank you! Love and light to you sister. 💞", "lacuad": "There’s a real brightness in those eyes of yours 💞", "arobotmommy": "Your hair is super long😉 Who's winning btw?", "emilyrutledge43": "The look of eagles on the right. Gave me straight up goose bumps! So inspirational!", "claudfortin": "I l❤️u @jengotch! Such an inspiration. I am an aspiring food stylist and I loved to ear your words on second life podcast.You are so brutally real honest witty and funny 🍉🍉🍉", "ivyandstone__": "You are an amazing human being. This gives me so much hope that one day I’ll cry with joy instead of pain and fear 💛 thanks for allowing us on your journey.", "heatherlee.design": "💙💙✨✨🙌🏽🙌🏽🙌🏽✨💙💙", "paulabmichaels": "You own the curtain. The call is yet to become. Bravo!", "jesdolliver": "It’s funny how stress can affect your physical appearance. You look fabulous!", "alyssabelasco": "@kbsupersounds ❤️", "brookekristine_organizedchaos": "❤️❤️ Love to you. Just....love.", "nevenkamoulakas": "Thank you for being so honest and raw 💗", "suzso": "Thank you for sharing so honestly ... your story, strength, and perseverance give hope to so many people who are sitting where you were then! 🙌🏻🤗 You’re a blessing!", "lmaloof": "Beautiful. 💖💘💗 Thank you.", "mfagermo": "❤️❤️❤️❤️❤️❤️", "fruehstueckbeiemma": "♥️", "martynowak1": "Take away? Eating McDonalds depresses you. Good tip. Just kidding. You’re awesome. Thanks for helping others.", "janglegirl": "💙💚❤💛", "tapetdyr": "☀️", "fatimacekricratajc": "❤", "kiahloha": "Thank you!!!!!!!!!", "jody_boggiani": "Your am inspiration.", "carrieannpurcell": "❤️❤️❤️", "fiendheu": "❤️", "jess_best": "Thank you. I’ve always admired you from afar and now I love you even more. I’ve got your back girl. xoxo", "collectedwithlove": "✨✨✨✨💛✨✨✨✨", "hillerysawyer": "Jen, I am so glad you continue to share your journey. It’s like, everyday when I wake up, I know I have this one friend out there who gets me!!! And who will laugh as well as cry laugh with me. Thank you for speaking up, thank you for taking us a long for this absolutely incredible, amazing, and wacky ride, you are so strong. Your heart and soul are beautiful, and you are a god damn genius! P.s. your pod cast and your giggles give me so much life. Looking forward to next Tuesday! 😘🧡", "essentiallyandi": "I love that you have pictures to document this journey. I’m forever grateful for the hope you share", "ihavethisthingwithpink": "You look amazing m’lady!", "natbuono78": "Inspiring. I relate to your struggle so much and it’s nice to see someone being so honest and open about mental illness. Thank you.", "tiffykatmeow": "❤️❤️❤️", "jvelascocafagna": "You have the wonderful ability of making sense out of something that is not easy to explain. And I am so identifying because I turned fifty a couple of months ago AND my divorce should be finalized by October and I too feel these same ways. Thank you for your willingness to let it all hang out and never give up, because we melancholy types need that as much as you do. #depressionneedscompany #strengthinnumbers", "rebeccagayheartdane\nVerified": "Verified", "brittanielaurence": "@laurascribner 🌟", "sara.leader": "You are a Goddess of Truth-tellers, and I love you for that.", "jennyelena": "Thank you for sharing. This resonated with me as I'm just beginning my healing journey and it feels so good. 💓", "thejennyjames": "❤️❤️❤️", "spipps": "Thank you for this! 💜", "a_nnabae": "❤️❤️❤️", "ampersandstudio": "💕💕💕💕", "caddylabacon": "❤", "emvaka": "👏🏼👏🏼👏🏼", "jojosnackcakes": "Pain is beauty! What proof!", "onsiteworkshops": "Love this! 2 degrees over 2 years... ❤️", "discojuliet": "Oooh girl you look good. Glow up!", "colourtheorist": "Thank you! 💕", "dirtandnoise": "Jen Gotch you are my hero!", "jcroc0223": "Thank you for sharing. ☺️", "tinydesignstudio": "😍", "creme.miami": "You’re such an inspiration @jengotch 🌈", "ladoligosa": "❤❤❤", "kristin.prism": "I needed this so much right now. I’m dying on the inside trying to run my business and balance my workload, I’m letting my life pass be by from behind a computer screen...ignoring my health and sanity. But your story inspires me, reminds me that if we do the work we can do more than just survive but actually really live. ❤️✨", "abbadabbs101": "❤️❤️❤️", "leilalu_home": "This is beautiful. I’ve been on a similar journey!", "sixfigscoaching": "You’re amazing. Truly, madly, deeply.✨", "xantheb": "❤️", "ohellobeauty": "Powerful message! 💛", "zest4zyia": "Wow I can relate to almost every single word you wrote! Thank you for sharing! ❤️", "gibsontuttle\nVerified": "Verified", "__sophiehunter__": "💘💘💘", "ann_kltt": "You are amazing.", "michellebythebeach": "Powerful, thank you for sharing! PS..BANDO fan..before I read this and knew who founded it. Now a bigger BANDO fan!", "visualvitaliti": "You’re an inspiration to keep moving forward and push through it all girl ♥️♥️", "jannahmonjiat": "❤️", "allpapereverything": "🙌🏻✨💕", "sammieschott": "I love that you are wearing the same dress (or something that looks super similar) I sometimes avoid clothing that I wore during a particularly bad day... afraid that it carries some sort of bad energy with it 🤷🏼‍♀️", "sharvy28": "Well said ! 😊", "nancyvalladaresm": "❤", "themotherlove": "Spirit is the funnest part! You are a force ✨", "hannaipga": "Beautitul, strong and honest! So necessary in social midia! Thanks! I totally can relate. Keep doing that, beeing kind to your soul, body and spirit! ❤️😘", "cbjnj": "Thank You for sharing ❤️ I’m the pic on the left and seeking the proverbial light at the end of the tunnel 😌 It’s good to see others make it through stronger and I’m looking forward to that moment. You give so much strength to others,", "lindseeez": "You’re amazing. And im obsessed with your podcast. And I love that you are so genuine. I coincidently heard you on another podcast today for nearly 30(?) and again, amazing stuff. You are truly inspiring and get me stoked on podcasts ❤️", "nicole_dunstan": "❤️❤️", "nicholstrom": "Beautiful testimony, beautiful human.💖", "_domdadomdom": "❤️❤️❤️🕺🕺🕺", "amimurphy": "I said the exact words, but differently, on a post yesterday. How to find H a P p Y after 2 effing hard years of putting my life back together after dropping bomb on it. Well done Y O U.", "lisaisyourfriend": "Beautiful inside and out 💗", "kerrycrawford": "The best. ❤️", "designbytlc": "Have you ever read The Untethered Soul by Michael A. Singer? I just started listening to the audio book and it's pretty amazing!! (and love the new do too! ❤️beautiful transformation inside & out)", "carly_ashdown_art": "Beautiful and honest, thank you for sharing 🔥💪🏻💛", "jskenandore": "This is beautiful. Thank you for sharing ♥️", "katimorton\nVerified": "Verified", "aurore_pompier_": "Thank you 😘", "ananewyork": "You are amazing 💗", "popixdesigns": "Glad you are feeling better!! Thanks for sharing your struggles. X", "hevdabev": "This photo is changing me. Thank you.", "angelica_vergara": "Strong Amazing powerful words comi g for a strong woman you are so courageous to share the true life lots of us living at one moment of life @jengotch I can reflect myself on you with this powerful word's I'm proud to be a woman #proudtobeawoman", "paristwotrill": "thank you for everything you share and all of your devotion to de-stigmatizing mental health issues + SHOWING emotion. you are appreciated. happy weekend!", "laura.sulak": "Cover up the ‘now’ side, and look at the ‘then’ side alone. Then switch. There’s a striking difference in your eyes. Former Jen looked haunted. Today Jen has peace in her gaze. Thank you for sharing your journey with us. It’s strengthening and heartening to know there is another sister out there who is kicking ass while living with mental illness. Much love and gratitude to you.❤️🤗", "gici01": "Thank you for sharing ❣️❣️❣️", "lekfit\nVerified": "Verified", "fromthewildau": "Thank you so much for sharing so openly with us @jengotch 😘 Thank you for listening to your body and making the healthy choices and showing up in the messy and the miraculous moments of life. Thank you for showing us that healthy change is possible 💗 You are truly inspiring 💗", "mommadukes619": "🌼", "little.mama.lou.roo": "your honesty, your heart, your sweet company, your Gerti interviews, your dumpster dances, your amazing outfits, your humour and jokes and so many more things..I could go on and on...but I'll stop. so many things I love about you. you're someone special to me..on Instagram...but still! 😂 I'll always be happy for your joy and happiness 🙌🏼💕🎉", "marielleejiama": "💖💖💖", "ashbaldwin": "HAIL.", "daniellemaak": "@jengotch you don't even realize how you help some people thru the long long days", "nk.bennett": "Yes we do!! Thank you for yet again so beautifully expressing your feelings that are so very relatable❤️", "funkykonradina": "😙", "amelia_graceeee_": "You are freaking amazing!!!!!!", "schatzmana": "Sending love your way 💛 appreciate your openness so much!", "karenzgoda": "♥️♥️♥️", "nikkijpet": "Hell. YES. @acacianmay p.s. I wear my necklace all of the time and it’s a huge conversation piece", "edawani": "❤️🙏🏻", "isabella.c.valencia": "Needed to hear this more than ever. I’ve overcome before, and I can do it again. Thank you for the reminder. Much love ♥️", "claudiaramosdesigns": "Thank you @jengotch for sharing this! I’ve been going threw a lot of emotional roller coaster where everything just seems like I’m walking like a zombie. I get upset fast, cry, feel stressed and it’s just a big mess for me. Today I was thinking about these emotions and reading this has made me think about what I can do to make myself better. I’m always putting my family first but I’m the last one. I’m over weight, I put up a smile but inside I’m just screaming! Thank you for this! I now need to take care of myself 💗", "m.quaken": "You are lovely ❤️ thank you so much for your openness and honesty!", "katrinadoe": "Maybe that outfit makes you cry? 😜😘", "loodiddles": "❤️❤️🙌🏽❤️❤️", "yarigrams": "I am going through this. Reading this made me feel better and stronger. Thank you for sharing", "thebrightsidewithbrynn": "Thank you for your vulnerability. 💛", "thaislcollins": "✨✨✨✨✨✨✨✨", "hellogladysmae": "Thank you for sharing 💗", "corimylesmatovsky": "Witnessing the way in which you share your journey and your experiences is truly one of my favourite things about Instagram...so thank you so much for that. ❤", "ohboyzee": "I love your spirit! Thanks for sharing!", "angmatange": "♥♥♥", "debbiereisetter": "You are so inspiring- thank you for sharing", "mistyreich": "@alexgarantart this could be a powerful piece if she was open to you doing it:)", "hlcclh5": "Thanks is really not enough!!! 💜🤗😊", "jessicatmarie": "You are so fucking cool.", "clevercreative": "🙌", "sixtee_isthenew_fortee": "Jen, you are such an inspiration and so well loved. 💕💗😘", "mandakrygiel": "Thank you for your genuine soul ❤️💜", "form.designs": "Power Full", "katycapriles": "❤️", "rachelpullen": "I just love you and your transparency and what a gift it is to others so much! ❤️", "wovii": "💕 Just read The Untethered Soul after hearing you talk to your mum about it on your podcast - freakin’ LiFE CHANGING that one - thanks Jen! 🙌", "katiejstephenson": "Just wow as always. Thanks for sharing, I love your words.", "mreen14": "So very proud of you!! Thank you for sharing the good, bad and ugly- you are so inspiring!", "personalaesthete": "You just sparked chills. Love it!!!!!!", "katiehurrlewis": "🙌🙌🙌", "kaysujin": "✨✨✨", "akindredquest": "Love you for documenting your truth! So inspiring!", "lesleylporter": "You inspire me! Thanks for your honesty and wisdom. 💪💪", "d_rizzabeauty": "I’ve been going thru a Similar journey. Thank you for sharing", "hellomegs_": "❤️", "oh.hello.gato": "You are such an inspiration. ✌️ ❤️ 🌈 ☀️", "antoramajumdar": "💓", "gracieljay": "Your honesty is incredible and helpful. Thank you 💜", "ericaandjunk": "I’m thankful for your Instagram feed! You’re a light to so many people!", "sarahhaydeeq": "Soooooo proud of you! Proud of all the people who’ve moving forward step by step 💕", "aicragaleiram": "💖💖💖", "sallyswensonart": "You are divine!", "homeremedy": "You're amazing.", "mazzica": "❤️❤️❤️", "shanhattan": "Merci for posting! 🖤", "zerouv": "Such an inspiration!!", "merithegreatandwonderful": "You give me hope, Lady Gotch.", "barbarasueko": "Thank YOU 💕", "yourstorykimi": "Why an inspiration you are @jengotch", "elyseedge": "💛💛💛", "cuzihave2": "Tight hugs to you 🙏🏼💕🙏🏼💕🙏🏼", "brittanyarita": "❤️❤️❤️❤️❤️", "21ellebee": "Have an awesome weekend @jengotch! You rock girl! Stay strong!", "rebeccadrodriguez": "💙", "designmom": "I love everything about this post", "creativesolutions": "🙌🙌🙌🙌", "beth_stellato": "Inspiration.", "shopdavidpeck": "You are incredible.", "tanyalochridge": "It’s a battle that will always be a part of my life...doesn’t have to “be my life.” I am happy that I share my struggles publicly...in hopes of helping just one person. Happy that you do too. 💕", "bandofweirdos": "this is so inspiring! really needed to hear this, thank you for everything you share 💜💙💚", "spadsy": "Amazing and inspiring! Congratulations on your journey 😊", "dundas9": "A beautiful share! 💕🙏", "katie_mulrey": "I have no words. What you shared was just right. ❤️💪🏽", "tigerwhalekitten": "💕🧡💕🧡 super beautiful to read this, working on my own steady internal and external change after a period of deep depletion and taking inspiration from anywhere I can- today that’s you 🙏💕", "jaracat": "You give my hope!", "swagmob_promo": "Thank you for sharing that!!! Takes a powerful woman! 😊", "leaderbagco": "Love you Jen. ❤️", "heyyy_jj": "Thank you so much for your continued inspiration through your personal process. I needed to hear this. Keep up your amazing work. I don’t know you, but I am certainly proud of you!", "focker123": "@onsiteworkshops life changing❣️", "beckycooke": "It’s a pleasure to “know you” through your transformation. It’s butterfly stuff 🦋💪🏼🔥✨", "sheworelore": "💕💕💕 I am forever grateful for your willingness to share. Thank you 🌿", "sparkleplenty_": "I admire the hell out of you 🌈", "mellifluoussky": "You're such a beauty! Thanks for sharing your authentic self! So healing and real. And I super LOVE your podcast! Sending love from an island in BC Canada. ❤️", "lifeofahasserd": "Amazing. ❤️", "holamartita44": "Hard work, good for you! Thank you for sharing your progress through the pain. Very inspirational!", "kaitlinmarcotte": "Thank you for sharing.💛", "emilyunderstands": "I think these photos are a work of art, captures the complexities of mental health and being human beautifully. Bravo.", "thedarlingofjupiter": "I know that feeling girl. It's like company meetings are a mental break down magnet!😭Mental health issues are a hard thing to get through, we'll always be working on it, but most days we have made it out the other side. ☺️ Congrats on your strength and determination towards self healing. You are a fucking Queen❤️💯", "marniecam": "🙌❤️ @jengotch", "the.cross.casa": "🌈✨❤️🙌🏼💪🏼 you are so inspiring to me, thank you so much for always sharing and bringing awareness to mental health and how important it is to take care of ourselves!! ❤️❤️❤️", "ldub310": "Wow! What a powerful message. Takes courage to face the pain the way you did. Bravo!", "karishoward": "@kellyadame 👏", "aninhasimoes88": "@jengotch thank you for sharing how it is to be a human being ... and remind me that! this is real life .. ❤️😘", "ohayitslj": "💖💖💖💖💖", "whatamelvin": "Reminder that you are entitled to your feelings and you never need to apologize for having them! I love your sensitive soul @nikiiipat 💕keep KILLING it at work 💪🏾", "adrixey": "You are such a force of nature. Thank you.", "thaisxabu": "you are such an inspiration for me and to a lot of other ppl here, for sure", "mm126_": "Growing in every way but not aging a single day. WTH", "anastasia_c": "Officially inspired! Thanks, girl ♥️", "kimothy.joy": "You are true. You are beautiful. Thank you for sharing of yourself with us.", "jeccajo": "@tacotalia", "hellomisspotter": "You are truly amazing", "kateritchie917": "🌈❤️💫", "dressedbykess": "👏🏻💗✨", "ohmyerotica": "❤️🌈❤️", "susan_alexandra\nVerified": "Verified", "launchsociete": "So proud of you Jen", "sarahwilliamsphotographer": "❤️❤️❤️", "sunnywithachanceofbono": "You are an inspiration to us all! 💪🏼", "kelseymegankennedy": "💕💕💕", "gwendittmar": "Mind Heart and Body are so important. Spirit is my fave ✨✨✨", "alainamoore_": "You're so inspiring! ❤", "aliciamlund\nVerified": "Verified", "nomostache": "Beautiful 💓💓💓💓 Happy to see you on the other side ✨", "nateandco": "Love you so much 🖤🖤", "pyrite_design": "Well now we’re all crying! (It’s not just me, right?!)", "honestlyfit": "So special, thank you for sharing", "gittih": "💪🏻", "courtneyandthebabes": "❤️😚❤️😚❤️😚", "adenajpoor": "❤️", "lashbealady": "👏🏼👏🏼👏🏼👏🏼👏🏼", "missrimix": "WOW. You have no idea how much I needed to hear this. I don’t know you but I’m so proud of you and I aspire to follow in your footsteps. 🖤", "nelsonsusie": "Thank you so much for sharing your story!! I gives me a glimmer of hope!!", "cydspix": "Thank you for sharing!!! I so look forward to your posts and the positive and full of life message that always follows!!!", "luleeham": "This is so good. ❤️", "itskellyshelton": "This is why I follow and walk with you! 🌈", "kelly.be": "💙", "glittergirlfab": "Thank you for saying what so many of us have felt, thought and lived thru... YOU help us to dig deep and keep it real 💖💖💕💖💕💖💕", "morgan_mcc": "Ooof. Needed that reminder today more than you know. 💕", "zofiaglenn": "🙌🏼🙃❤️😘🤗", "erinmorgenthal": "You inspire me to do better. For myself and my children. Thank you.", "nad.nyc71": "Needed to read this message- thank you for always sharing.", "megpixel": "Thank you Jen 💕💕💜", "artisanalimpressions": "Love you", "pugsofinstagram": "I❤️ @jengotch you are a Kween!!", "ginnycanuck": "You are so real and inspirational. I am hitting the 50 year mark and feel like my life is unraveling and going nowhere. I am trying to be positive, not worry and live in the moment. Thank you for putting yourself out there and giving others hope and inspiration😘", "blairmarie": "❤️❤️❤️", "quirkylittlefairyqueen": "Thank you for sharing your story! Your rating emotions story has helped me become more aware of my own mental state. My boyfriend, who is a psychology major and who is thinking of becoming a counselor, thought the photos that you provided for each of the ratings were so cool and helpful. I thought so too. They helped display just how much you can look “fine” even though you may be suffering. I hope there will be more people out there willing to share what they have been through in order to help others grow.", "khalimcevoy": "🙌🏻🙌🏻🙌🏻 your hair is SO LONG! 😘", "aynur_sain": "🌷", "luhansen": "You are such an inspiration Jen!♥️ Love you!!!", "sugharmon": "Thank you. Thank you. Thank you. I admire you so much and your bravery to describe those past feelings. Keep it up 💜", "stephanie_sheldon": "So happy for you. Xo", "alina__cervantes": "@jengotch you are so inspiring! Beyond what you can even imagine:)", "tttarzia": "💕💕💕💕😘😘😘😘", "whitefigdesigns": "The pain .... .. The rockstar that is real 💚 moving throu the reality of life 💫💯", "passion_shake": "❤️", "thelovedesignedlife": "You look amazing and are such an inspiration! Happy Friday!", "pictureitplants": "I have benefitted from your podcast SO much since you started it. Everything you talk about resonates with me and I’m so happy to know that the journey I will be on will be worth it in a few years. 💜💜💜", "emmafeilphotography": "So incredible, thank you for sharing 💗", "gulushthreads": "Going through changes myself and working towards actual change and recovery. You have seriously helped be some fuel to that fire so thank you, from the bottom of my heart, for your transparency. It matters so much, to so many people. 💕", "pickedbyjane": "Love you, Jen.", "sheltered.co": "LOVE you ❤️💜", "fernanda.motac": "Way to go!! 👏🏻You rock, Jen!! 💪🏻", "megcole80": "Thank you for this. Truly.", "callieannyoga": "Thank you for sharing your story", "iamhannahhamilton": "You’re so inspirational to me. Thank you for being you, always", "mshunz": "I wonder why you can be so tough and fragile at the same time.. knowing that @shopbando can last for 10 years.. hope you can share.. thanks for being honest and pray for your best! @jengotch", "old.color.modern": "😭👏🏼😭👏🏼", "mindyfurano": "@cayllan @angelaaheyhello Thank you both so much. I love this and each of you and Jen ❤️💗💕💕😪💯", "atcharlotteshouse": "Such a lighthouse you are, Ms Jen!!", "blakeloates": "You’re one of my heroes. You inspire me daily. Thank you for being you and bringing so much joy and hope into my life. Congratulations on kicking ass and working so hard on your wellness. 💜💜", "eliciafish": "@toniaffisher 💕", "_sarahnave_": "❤️ THIS. ❤️", "amynonomcg": "❤️❤️❤️", "petitsparrow": "❤️❤️❤️", "hilarylhahn": "Glad you are feeling so much better now. I cried in a meeting this week too, I can relate! It was the most real thing I could do😭I am ok with that, I am honoring that those emotions need to come out✨", "klowe94": "You are an inspiration awesome job 💕🕊☀️💕🕊☀️", "houseintheorchard": "Have a great weekend! Thank you!! ❤️", "angelakohler": "#fuckyeahjengotch", "hellokellystuckey": "❤️❤️❤️", "sarahmaggied": "You’re amazing ✨✨✨ thanks for sharing it all with us", "chelsealynnnn": "@eleanorwellbaum thought you’d love this ❤️", "hayleyrex": "Thank you for this! 💖💖💖💖💖", "aquariandancer": "You are one strong lady. I very much look up to you and your strength in heart and spirit.", "clo_raline": "@carlamwheatley I cried reading this. Seeking health is so hard but it’s so worth it.", "nladner": "You never cease to amaze me. 👊🏼❤️", "lpelisabeth": "👏🏻🙏🏻💕💕", "ruth_hepburnn": "You are so real ..💖", "anahata_joy": "Hmmm... and I just gave myself an alarmingly similar hair style to the image on the left. 🧠👀", "maxwanger": "❤️", "ilikevintageandstuff": "I love the openness of your post. You're amazing. Just like so many others fighting through mental pain & exhaustion. XO", "leahrward": "So glad you’re feeling lighter and happier.", "sarahtroyster": "Beautiful and so important! Thank you for expressing the pain so many of us experience, yet feel so alone in. So much love to you! 💕", "lovelaurakathryn": "💛", "jennyalmonte29": "This this this this this", "neelyismyname": "Yes. 💕", "goosebumpsboutiquebedding": "Your the best and good for you lovely lady. No doubt your story will help empower people who are on their own journey. Big shout out all the way from the land of Oz🇬🇸🇬🇸🇬🇸🌸🌸🌸👌🏼👌🏼👌🏼", "noemies_little_moments": "Thank you for sharing this 😘 you have blossomed and got so much stronger and you’ve taken us on this wonderful ride with you 🌸 I needed to see and read this today 💕 also great ‘sex hair’ 😘😘😘", "mermaidmeg19": "You’re awesome. 💙", "kellyamccartney": "💗💗🤗🤗💗💗", "katie.krentz": "👊🏻👊🏻👊🏻💕💕💕🌈🌈🌈", "pinkbellylounge": "🙌🔥🙌🔥🙌", "mcgoogle87": "You are delightful ! Such a reassurance in this sometimes volatile world 💕", "katpfisher": "Hope and hard work. Bless your big beautiful heart. ❤️", "caitcowley": "Thank you so much for constantly sharing your journey with the community that follows you. You’re an inspiration to me and I look up to you in so many ways.", "bronnib": "❤️🧡💛💚💙💜", "sweetmonn": "🌈🌈🌈🌈🌈", "sealoom": "@derryberry3 read this story! ❤️", "munagram0808": "This meant so so much to read. I’m there. I hope I can post something similar in a couple of years. Thank you so much for your honesty and courage, it’s made a difference to at least one person 👈🏽", "theclassixxvtg": "Always a treat to read about your process and your strength. All my love to you!", "liatnoten": "You. Are. Amazing.", "popsiclelewes": "Your a true inspiration. 💗💕", "thekarenlord": "❤️❤️", "jennifermoss4": "Thank you for sharing 💕", "jillyjackdesigns": "❤️", "yellowco.co": "Beautiful ❤️❤️", "bzzzt.by.bee": "🧡 thank you for sharing your story! You’re an inspiration to us all and are not alone. 🙌🏻 💜✨🌱", "memelaroo": "JEN! yet again you fill my heart with endless hope. thank you for being you, sweet one. 💕✨", "cleary.simone": "Thank you for being so bold and vulnerable all at once. Mostly for sharing your story and letting other people know that it’s okay to share theirs too. What a powerful influence to have. :)", "mcallaghan": "Thank you for sharing! 💗", "byclaudya": "I really needed this today. Thank you!", "nicolekligerman": "❤️❤️❤️ thank you for sharing, this is so beautiful! ❤️❤️❤️", "nadialpez": "@masainsea", "rebeccafos": "You ARE so awesome 👏🏻⭐️✨💫", "jennadkins93": "✨💕✨🤗"}