{"kaylaeliise": "@thankyouforthat aw i didn't even read the caption haha i just meant her in general like watch her insta stories and stuff", "thankyouforthat": "Omg yes! I literally could of written this and in weeks away from 29....lol @kaylaeliise", "annonthehill": "Um yeah. Me @earthtahkate", "handbuiltceramics": "I don't know how I found my way to this post, but YOU SAID IT! Right there with you, but haven't this bluntly acknowledged it. Perfect timing. You got this. 👊🏼", "soulwanderer": "I told my girls to follow you because of your talented mouth mimosas... Only to discover it's in your bio !!!! 👏🏾👌🏾👅💃🏾✨💞", "angiefraz": "💗", "eatprayshoplove": "I feel the same way", "savphree": "you always brighten my day! 🦄💞ps -loved the talking dog and the talking dog only today via snap", "lafleurdeluna": "@9thsage", "the_untrained_eye": "Lots of loves ❤❤ surround yourself in light. People that are so full of all things good hit highs and lows . You just feel more, that's such a great thing. Hitting middle age has its stuff, but I truely don't miss the learning Years. Ahh.... finding the balance. Know how ya feels! 😘😘", "lowrybeall": "feel this ish. ❤ #gettingolder #weirdhairseverywhere", "ohhxchristinex": "@jengotch your truly such an amazing human being to me! Especially after reading all of this! That's def real talk! ❣️🎀❣️", "sarahmorabito": "What I needed 🙏🏻", "heytherecj": "I don't know you but I want to give you a hug and a kiss 🤗😘.", "ellie_vision": "I got a divorce last year AND entered menopause. I've got the hairs and cavities and the depression and anxiety. But I don't have an awesome accomplishment like ban.do. You are a badass. You can do this. (Saying that to myself too).", "hellolisahall": "You are the fucking best. More of this, all of this. Please and thank you. ⚡👊🏻💛", "sugardollswim": "Thanks so much for sharing. Depression/anxiety story of my fucking life. 😐😑 @jengotch", "jessichaas": "Thanks for that post. Sometimes I think I'm alone @jengotch", "eastcoastkanakattack": "Sending Lots of Aloha to you!", "rachelemoote": "@jcrobinson_1013", "_amycakes_": "I needed to read this right now❤ Hi Jen!", "iameevamaria": "Cool caption, great feed.", "samanthagerardwoods": "@ali_g29", "lilylovelock": "Beautifully truthful! What a gem you are! Wish I could hug ya! 💘", "edlundstyle": "Oh my god you're the best.", "onefinea": "@portlandaproncompany I couldn't agree more. We love you @jengotch!!", "cindizatto": "Beauty like yours never fades...⚡️You're rad & real. Also, your \"whatever\" hand sweater you wore in one of your stories has me GREEN with envy. It's so good. You're beautiful. ❤️", "go_forth_": "You're my fav IG story to follow! #NothinButLaughs. Love your authenticity & zany-ness 🙌🏻🙌🏻", "bear_and_sparkle": "✨💙✨💙", "lovelyparcelcompany": "Sorry you're feeling blue. It's been a hard year. Sending you big hugs! 💕", "lizperezartist": "@jengotch That's real women talk 😘💜 And you're still one heck of a business woman and my #girlboss role model 💪🏼🔝", "akiiiiiiiiiiiii": "too cute!!", "wonderlandsam": "All the ❤❤❤ to you lady.", "elizabethrolf": "I love her @ally.macewen", "iamjenniferbgardner": "For what it's worth you look great.", "couragepassion": "Today I am a person who loves herself as nobody around me and you must know that this is work, every day I wake up I do whatever that it's in my hands to change my past mindset. I read self-help books, I listen to podcast that make me feel happier, I listen to music that makes me dance, I love and I say it! It's in your hands to demonstrate the love that you feel for yourself ❤️ you can be happy.", "___kyr": "and yet through all of this stuff, you're still the most kickass woman I think social media (and this 🌎) has got. posts like this only prove it more. you're the realest in the most dazzling and fab way possible. if only there were more of u out there, 🌟 xoxox thnks 4 being u jen", "trentoneius3_d": "Chin hair, peeing myself on a trampoline, seeing teenagers looking better in the same outfits as me...meh...it happens and can be a bit depressing. But as a 40 something strong, independent woman who's lived and learnt some amazing things (and still rocking it!) I'll take them all along with the knowledge that there is electrolysis, tena lady and no more teenage zits 😉", "artbyamyanderson": "I love you and I enjoy your honesty 🙌", "bobbileebrooks": "I get it more than I let on to anyone. I might voice my feelings but generally I know that people prefer gossip, positive energy and all that stuff. I cant give that to anyone right now. My thoughts are my own and I somehow sense that is where they should stay. I'm alone and it doesn't feel good becoming increasingly harder everyday to even venture out. Getting older doesn't feel great because I have done nothing that I'm proud of, something that has sustained a positive impact on my life and the lives of others. Time is going too quickly and I feel the things that I want to do and places I want to see are impossible now. But I get up everyday and I hope and feel hopeful for that day to be different, better than yesterday and sometimes I feel the possibility of things are so close but I never seem to get there. I'm tired and I feel like I have been fighting my whole life making the wrong decisions and the people that were once so close really weren't close at all. You will feel better and you are far from old, in fact you are a beautiful woman.. depression is the worst. It isolates you and we move slowly trying to sift through the muck. I'm sorry that you feel badly and we don't know each other but I do know how you feel. Keep moving and keep the friends that are real to you. But remember, this can all change for you. It's fucking hard work but grab unto the good and let go of the bad......", "rljpr": "💛🙏", "raisingwild": "And you are my FAVORITE!!", "portlandaproncompany": "If I had to pick one IG account to follow yours would be it. So truthful, so funny, always makes me feel good and puts a smile on my face. Thank you😀", "laurakava": "Feeling you big time!!! On the East coast, but your words resonate and feel \"oh so true\" to me too. A wise one once told me \"being a lone wolf is not the way out\", but it's so hard not feel like quietly hibernating alone. Sloth-like is what I call it. Keep telling the truth sister!!! You are not alone!!!", "mixedplate": "You are truly amazing. 😘", "polkadotwhimsy": "❤️ this.. Just turned 43 😫..", "megan.alissa": "Hang in there chica, you're not alone. Life is long and its all relative. Sending you light ✨", "gus_happening": "it was lovely to see you and your flawless bangs today, jen! and wow- i'm in awe of your courage. stunning honesty!! 🙌🏻💛😘", "napakettu7": "Always lots of love #and innuendos. I propose a massive dinner gathering in your honor. Annnnd maybe a trip to the skating rink downtown. I love you, sister 💋", "born_beaute": "Hott! 🔥", "sprinkledlife": "I love you! ☺️", "libbiesummers": "🙌🙌🙌", "mollyrstar": "Your looks aren't fading wtf!! Pretty & cool 💋", "foundbykaty": "You being you is the most inspiring. Thanks for always being a light, even when you feel like it's only darkness coming out. we all clearly see something much brighter 🌞", "kellectedhome": "❤️", "get_takeout": "💗", "tamara_california": "The moment you realize that you are Jen FUCKIN Gotch, the better. You are a rockstar and we all know it. 👑❤️", "audstant": "Really appreciate your transparency because life is so complicated and social media can make everything seem black white. Keep on keepin on! 💕✨", "hello_angele": "@lauracamblin if you're not already following Jen, you should. 👏👍😊 You'd like her!", "elenaxispa": "😘😘💕you inspire a lot of people to be themselves! Don't stop beeing yourself!!! ✨", "legs_luther": "Holy shit YES!! Write a book. I read the balls out of it 😍😎😍 ur the best thing in lady land.", "rheegirl": "You make me laugh on a daily basis. You are the best. 💋❤️", "erinjeandolan": "I love you!!", "nlongo22": "I love your raw honesty. You put into words what I've been feeling lately. Thank you.", "thespitfiregirl": "You are a rock star #fellowfortysomething 😘", "kathleen_bernall": "👏🏼👏🏼👏🏼", "jessicacrim": "I was at the rose bowl today hoping that I would get a chance to meet you and totally geek out and tell you how awesome I think you are. But alas it didn't happen. But it did happen in my brain since I went over the moment in my head last night just in case I did see you. Now I sound a little creepy so k bye!", "elizabeth.cordaro": "Word sister. We all feel like this... @jengotch", "loveagnespompoms": "You're an amazing lady. Keep rockin mama!", "thedesignstalker": "Yay, chin hair. You're not alone!", "ruthhbarry": "Preach it sister !", "margauxelliott": "💛", "allisonmadi78": "@jengotch You're awesome Jen.", "ohhhkris": "💟💟💟", "acpcv": "I turned 46 this year and the phrase that has been looping through my mind is \"I feel bad about my neck.\" Like, I feel really bad about it and I totally understand what Nora Ephron was talking about. Add that to some medical issues and I am forced to accept that holy shit I am middle aged and shiz is getting real. for what it's worth, your posts always brighten my day and make me feel happy and understood :)", "minimagkate": "You wonderful woman you 💛", "deneisebuckophoto": "You are the best and you didn't make it this far in life to be defeated. You will overcome and conquer!!! You are a light to us all ⭐️", "zatyness": "Huuuuuuugs. So much love for you 💕", "itsme_imcathy": "You are very gorgeous 💜", "9thletterpress": "You are beautiful and inspiring and real. I love reading your posts so much that I always think: WHY has she written a book?! Personal essay style. The world is your oyster and I think it's clear we ❤️ all of your words, feelings, and TMIs. 😘😘😘", "amanda_mclaurin_": "You are the cutest and it ain't about your looks.", "dmb.317": "@jengotch you are beautiful, hilarious, inspiring, real...you are real. thank YOU for being YOU! ❤️😄❤️😄❤️", "laurenmnorton": "It's okay, I'm only 19 and had to have a root canal. Hang in there. I think you're a fabulous human. :)", "nomigensh": "❤️❤️❤️", "saraclarogarcia": "💖💖💖", "la_californienne": "Those chin hairs signify wisdom!!!", "glossanddirt": "I get the feeling that you can turn your trying times into incredible creativity. And females are strong as hell.", "ameliaelisa": "All the love ❤️", "charlie_77": "😘😘😘😘😘😘😘", "grlsstudio": "💕💕💕", "lynnthree": "You are awesome 💗💖💘", "kemigreen": "💗", "__heygabs": "Oh my god. Please write a book. It's something I would read over and over.", "mindyfurano": "You have become someone I look up to. I have anxiety and focus issues, and I'm v alone! I love that you channel your energy into bringing happiness and excitement to the world and I try to do the same the best I can, when I can. You're unique and powerful and have so much more to bring to this world, I can't wait! Also - beautiful photo ❤️", "tigertigerstudio": "💖", "gabixgutz": "You're AMAZING!!! 💕💕💕", "blakehazard": "❤️❤️❤️❤️", "mariaianetc": "i really love you and you're ageless, you know?", "everyonceinawhileisparkle": "You just described me EXACTLY, minus the 4 cavities. 45.....ADD.....Anxiety/depression and single af. Must keep moving forward motto chanting in my head on loop! 💜", "kaiteshmatie": "You're such a BEAUT!", "gemijane3": "Cool! There is always something to fear, no matter the situation.", "miss_o._regrets": "Believe me, your looks ate not fading.", "realbrookewhite\nVerified": "Verified", "jenclarke": "Thank you for being real. It's so fucking refreshing and inspiring. ✨", "dinneratmidnite": "You're a GODDESS❤", "ctrlaltaira": "THANKYOU FOR THIS. You're amazing, and your honesty is amazing. Thanks for breaking the instagram veil and being real. 💖💖💖", "melishea": "Thank you for vocalizing the confusion", "arrrkaytee": "@jengotch You matter. And, by reading this, you helped me feel like I matter. So, thanks. ❤️", "777smx": "Looks fading my arse - you're gorgeous!", "jjillustrates": "🙌 much respect for this! We love you and you got this even if sometime you don't feel like you do. I have hairs on my chin too but fuck It beards are in 🎅🏼", "dr__lauren": "@jengotch just stumbled upon your feed, and I fucking love you.", "aklimton": "❤️❤️❤️", "lindsaynicolestudio": "I feel you girl. You are simply the BEST at putting it into words. 💕 Internet hugs (non-creepy ones) coming your way! 💋", "it_looks_like_lara": "@skiptomylulah do you follow her?", "bminimal": "Exactly my life too actually..😔😩 you are definitely not alone 😘", "gretchcma": "You look amazing!!", "hurtherbronzun": "I think you're amazing and pretty and have the best most cutest clothing site. 💘", "camelliak": "@littlelincoln33", "gwdub": "Relatable 💖", "engnassif": "Chin hairs since my 20s girl @jengotch", "kimbaise": "I love yer guts!!!!xoxo", "aubreykinch": "❤️‼️ love you.", "ig_draws": "I'm leaving a comment because, I think it's totally ok to be you! Just do that, you do you better than anyone around and need to get through the fire to get to the other side (is that a joke) anyways meltdown for as long as necessary or not. It's human. Also we've (my company) has done some work with your brand so it was cool to see some background and I like the stuff! Cheers! 💥🍾", "carmenleffert": "So relate! I can't stop either! Humor is my saving grace! 💕", "muneca_de_trapo": "Looking good. 😘🙃", "abra.v": "WE LOVE U JEN, BC OF ALLLLL OF THESE THINGS ❤️❤️❤️STAY TRUE TO U ❤️❤️❤️", "mlmcdermott0108": "It's like you wrote what's in my mind!", "jasminestar\nVerified": "Verified", "dadono": "Look up NAC. Helps with anxiety and depression (also, surprisingly, chin hairs)", "hello_candice": "💛", "cella_bella": "@masterberkeley", "yourestillfat": "YOU ARE LITERALLY BEYONCÉ SOOOO", "kelsie.greenberg": "Hair on point though for real", "montana.adorbz": "You are honestly the best 🙌🏽⚡️✨", "poshnoshaustralia": "You're amazing and brighten my day @jengotch 💖😊", "theparsonslodge": "Your honesty is a breath of fresh air in this fake instagrammy world. I appreciate you, @jengotch.", "kodeofkondukt": "❤️❤️❤️", "littlebirdo": "❤️❤️❤️❤️", "lindsaystephenson": "❤️❤️❤️❤️ I adore you! The BEST. ❤️🌈", "denisecrew": "😘!", "carolinaszen": "@erinburns7 she is by far my favorite human on ig", "bohemian.wine": "You're sooo beautiful inside and out. Cheers to you for being authentic", "512caro": "You're beautiful for posting. And honestly, I'm 18 and really look up to your career and you as an artist. You're amazing.", "amy.e.little": "You always look great and you're funny as hell! ✨✨", "maxiemccoy": "You gorgeous gorgeous soul @jengotch 💛✨🙏🏻", "tamarasputnik": "Jen I know you don't need some rando to reassure you of anything but I just want to say you're such a \"boss girl\" inspiration to me. Seeing you struggle with things like the ones you listed and still showing up to kick SO much ass at work tells so many of us that we can do the same. So thank you. For being transparent and being so boss. Thank you.", "artbyashleyrebecca": "@jengotch your daily posts and stories are my favorite thing on instagram 💅🏻💅🏻💅🏻", "nicole.anouar": "I love you so much and you're beautiful", "annej____": "So many props to your hilarious, raw, strong, and (still) beautiful self. Keep up the good work! Anything you post lightens my day and reminds me that life doesn't always have to be so heavy (even when it is.) Thanks for not sugar coating your life.", "thegoodreport": "Your honesty is so endearing. As are many other things about you and your IG feed.", "kristiestreicher\nVerified": "Verified", "hookandeyeco": "Authenticity is rare these days. You rock 👊🏻 Keep doing what you're doing 😘", "lydiabrookspdx": "I so appreciate your honesty. I'm having many of the same struggles. Solidarity.", "jenleonard_": "You're amazing and honest and beautiful. And!!!! I'm going through the same thing right now at 45 also, and moving to LA so we must get drinks and laugh the night away soon. 🍸😘", "valsdead": "❤️", "miss_mina4": "You are a fabulous, hilarious, special creative soul and an inspiration to so many of us. Just remember that.@jengotch 🌟💕💘✨😊", "nicolepaolello": "I don't think your looks are fading at all and it makes me SO sad to know that you think that", "tiffanyparente": "💗💗", "miss_cedra": "@shaunnanygren all of this", "laura.gwinn": "You're fucking gorgeous inside and out.", "ericahearts": "We all have our struggles. Thank you for sharing yours. Hugs to you", "feisty_fiestas": "😘", "ohsiesta": "You are really beautiful @jengotch and super cool too", "melissaaasaurus": "My life has done a total shift in the last 5-6 months.. I'm approaching 30 & feeling the exact same way. Your snapchats and posts have made me feel less alone! I truly idolize you. You're a strong & amazing person (not to mention hilarious!) I wish we were friends IRL! 💖💖💖💖", "love.and.m.oceans": "From someone who has been trying to share my highs and lows recently, and not getting the support I was looking for... THANK YOU for sharing. Your words fill me up. I know I'm not alone. Keep kicking butt. You are special and beautiful and of WORTH. 💕", "octoberhello": "❤️", "miacarameros": "45 and alive and beautiful! Love you and your silly soul!!! You're a treasure Jen Gotch. A treasure.", "rufpop": "This is a grown up Margot Tenenbaum look saying to the world \"I'm Fine, Thank You\" lots of love always ❤️", "angela_f_miller": "Never forget that you're beautiful.", "maggieinthemoon": "@jengotch You ARE beautiful inside and out. Seeing you at #striiike , putting tint on them brows and talking to you yesterday for those 15 minutes made my day. Much love always 💓✨⚡️💫", "uncletiffy": "maybe you just need to go back to your \"Gina\" videos and give yourself a little laugh. Sidenote: I watched that while I was sitting by my husband and I had no idea he was listening until one day he came out with \"this is Gina\" in that same voice and I burst out laughing. So this comment serves no point other than to tell you that sometimes your posts brighten lots of people's days, in lots of different ways.", "sidracarder": "you're a goddess", "helloalexfulton": "Jen Jen Jen 👊🏼👊🏼👊🏼", "lizzie_darden": "💕❤️💘💕💖", "mrvelvick": "I love u @jengotch! U inspire me often. U touch lots and lots of us'ns. 💋💋💋💋", "tarawhitney": "You are rad. I'm 100% positive.", "christine_hornung": "You got this 👊", "steelemyheart": "Thanks for sharing your vulnerabilities with us all....I am in the same exact boat right now, and you truly to bring light to my day! #highfives!!!", "streichersisters\nVerified": "Verified", "robinfchaney": "I don't know you personally but I enjoy your Instagram feed & stories, they make me laugh & I'm grateful for that so keep on keeping on. I think you're adorable & hilariously funny", "movedla": "You're killin it 🔪", "tarajhaaz": "😘", "lyudakusel": "🔥🔥🔥", "mancalledmace": "You're my 'go to' instagram account if I need something to make me smile :)", "camillertime": "@jengotch SPIRIT ANIMAL. #SLAYON (and amazing hair btw)", "hannasalonen": "You are amazing and your honesty and openness is such a gift to this world!!!", "joanwlabelle": "Everything you is awesome. ❤️", "amandawawanda": "You're a triple threat. Brains, beauty, and there's a third thing... not sure what but I know you have it. Keep on keeping on, soul sister.", "autismoamor": "❤", "30designs30days": "Love this in so many ways. Preach!", "jenmem": "you're a wonderful woman @jengotch 🌻", "26andnotcounting": "@hinsonwh @erinmariebenson @crhinson36", "e.cast": "💕", "ktpagnotta": "@jengotch you literally bring such joy to my life. Thank you for your honesty and never lose that sparkle!!! ❤️", "asensiblehabit": "❤️", "raetherei": "So true!", "jamison.k": "i hope i am like you one day", "nikkileetaylo": "Girl, I think you read my mind (depression, anxiety, loneliness & chin hairs) much love and respect 👸🏼💄👑💖", "twstdsista": "Absofknlutely!! Im the same", "magdalenebh": "My favorite thing. Identified with every word. Every single word.", "cutegirlmorkin": "I think it's really special you're sharing this with us. FULLY supportive of all the feels. I think more people should be open and honest about THEIR feels because girl gangs are real and are strengthened through love and support.", "waxinmama75": "I love your honest, raw truth because at 41 I know too well what you feel, except for your kick ass humor, I try but I'm not as funny as you . YOU are the women I seek to connect with. Even if just on this platform. I got them chin hairs and I'm also getting an extra chin so got you beat there ! Stay connected Because I look forward to your post's ! And I would love to meet you in person and drink straight out the bottle!", "kelseygerhard": "smokin. 🔥and hysterical 👌🏻👌🏻", "anafetch": "#goals 💖", "katieblossoms": "💖💖💖💖💖💖💖💖 love this so much. Thank you for being vulnerable.", "bernsrose": "💕💕💕💕🍕💕💕💕", "boothofcats": "@jengotch amazebobs❤️", "i_make_wigs_and_kids": "Oh my I just turned 46 last week so yes to all of this. I even use @jennstreicher as my growing out my grey inspiration! 💪🏼 In my mind I'm in your girl gang too 🙂💖", "hej_ditte": "Respect! ✌️❤️❤️❤️", "anxiousalphabet": "✨💕✨💕🙏🏻🎀☺️😘🌴", "annaloumartin": "💕", "jerrodblandino\nVerified": "Verified", "anniepanniepanniep": "I have hairs growing on my chin and I'm 23 so really it means you're young", "chelseabreanna": "Jen Gotch you give me hope. Just when I have this complicated bundle of feelings, you post something that puts into words what I cannot. You are a soul sister to so many & that speaks volumes about you. You are a treasure, a fighter, a bad ass girl boss, & such a bright light to women everywhere, some or most who have never even met you, myself included. Please keep being your awesome self, we all have your back. Love from MN. XO forever.", "laurenoneill": "💕✨💪🏼⚡️💁🏻💖", "magicandthings": "You are my Instagram crush!!!!!!!!! Your light shines so brightly and inspires me on the regular. I'm grateful for you!", "samgluck": "I've had hairs on my chin since I was 21. So you're winning!", "lisajean1237": "Love this. LOVE your honesty. You're beautiful.", "changnatalie": "😘🤗🌟 xoxo", "rubi_jones": "❤️❤️❤️", "mostlymilaandknox": "😍", "_courtiesue_": "🙏", "uncommonfolk": "Jen Gotch, I can't tell you how many times you have made my day so much better by your words, your humor, your raw honesty. The impact of what you do and who you are will be long lasting for many days, weeks, months and years to come. Please keep doing what you do by just being you. It means so much more than you could possibly ever know.", "jlv_creative": "I agree with @uncommonfolk 👆🏻", "marianfrancesmac": "Jen, we love you!!! You're forever gorgeous and inspiring and hilarious! Never never never feel like a loser because you ain't!!", "elisa_robertson": "I'm with you", "breakfast_at_briffanys": "You are a queen!", "dooleynotedstyle": "You are inspiring, never change! ❤️", "caffeineismysuperpower": "I'm 44 and while my story isn't the same, some of my issues are. I firmly believe treasure awaits at the end of a trial. Here's to the journey to the treasure!", "leighherr": "You're one of my most favorite people and I've never met you. I can relate you on so many levels. Thanks for always being open and honest!", "ineedmylipstick": "You are a total inspiration @jengotch! Plus? Thanks for also always answering my random snapchat questions 💁🏼", "ali1124": "Completely obsessed with you.", "saraevelordi": "❤️❤️❤️", "les_818": "❤️", "mirandatanner": "You are so great Jen 💗💗💗", "bakerandmaker": "I hear you. Ageing is a funny thing, it's not gradual or graceful. It's little things that sneak up on you and are suddenly a thing...like plucking your chin more than your eyebrows. Those WTF moments. It's hard to accept it or embrace it. From what I see, you're creative, prolific, successful and totally unique. You look great. Your products appeal massively to the cool girl demographic who are fickle and age conscious but find Bando totally relevant. You're the real deal.", "meganlaportebryant": "I'm 34 and inspired by you and your attitude. 💗💖", "purcellski": "You're pretty great. 👱🏼‍♀️💚", "amybortonissad": "@courtneyclev yes", "wildeyed.shop": "I don't know you but I follow you on here and on snapchat and you shine bright like a diamond. You're a lovely soul and you make me laugh and I want to be your friend.", "oftenwander": "Love you", "lizzyokoro": "❤️❤️❤️❤️", "sasadiee": "I'm 28 and have hairs on the chin everyday. I feel you, sister.", "alliwebb\nVerified": "Verified", "itsliz___": "❤️", "missprissyprude": "What @wildeyed said... 😉❤️", "amy_naidoo": "You're one of the bravest people I 'know'. Your honesty about your fears, feelings and real human anxieties is bravery. The way you share this helps people know they're not alone in a world where everyone struggles but always pretends they are ok. And you're beautiful. And you're a role model to me in more than one are. Stay aces 👌🏽", "polkasparklestripes": "You inspire me every day!! 💗💖💓", "teamwoodnote": "you are beautiful and so loved x", "sixtee_isthenew_fortee": "You are such a breath of fresh air✨💕", "heather_bot": "You rule and are very inspiring! 💓", "theadocia5": "I'm with ya sister, but 46. 2017 has to be better!", "rk_flem": "you are beautiful!", "zoezdunich": "thank you for being so brave, it means a lot to see your bravery in a world that stigmatizes everything that you just said. You are not alone. ❤️", "chelsea_ghiorso": "@jengotch I think your freakin awesome! Your a boss babe and you CAN handle anything! Thank you for such REAL posts.", "duijstb": "I feel you, big hugzzz🎀🎁🎄", "designlovefest\nVerified": "Verified", "studiosophiasophia": "You are so cool and such an inspiration and all I want is for you to wear a pair of my earrings!!!! Let me send you some and make you feel better!? That would be so cool because you are AWESOME! 😻", "alyssaedwardss": "you're amazing and inspiring 💥", "moronoa": "💕❤️💕❤️", "si.mo.ne.p": "Jen, I love you. I love you the way you are, that's how I see 👀 you: fun, intriguing, beautiful, confused, creative, someone looking inside to understand, develop, get better.....and so many other good things. Lately it may not be the best of your \"feeling\" days, but hang on girl! You are amazing! 😘", "rikkiannevk": "❤️", "itsjustsarahknight": "Honestly Jen, I would never have guessed 45 in a million years. Mid 30's tops! Hang in there girl, we all look up to you and think you're totally boss👊🏼", "thecreativeporcupine": "You're a good one @jengotch. The world needs more people like you.", "enigheid": "I have so much respect for you, for your humour, creativity, charm and especially the way you don't fear being vulnerable and show your highs and lows. You make the internet a more beautiful place.", "artisan_skin": "😘💋 @jengotch", "fadedsentiments": "❤️❤️❤️", "elauinc": "Love you.", "polly_schmidtskowsky": "♡♡♡♡♡", "shellyottem": "💛✨💛💛✨", "emmastraub\nVerified": "Verified", "jessicadaviesmetalworks": "You're beautiful! Thinking of you and sending ❤️your way.", "waleskasan": "❤️", "nuitaparis15": "You are awesome @jengotch just hang in there and thongs will eventually get better! Or at least that is what I hope! For all of us!", "plumcollective": "!", "alexa__hanna": "Thank you for writing this! You inspire me! We don't have enough amazing female role models in the business world who actively share. Goal is to be as cool as you someday.", "_bloomchickabloom_": "Wanna hang out? I relate, to all of it, and then some. 🙃", "katiemcmurtry": "<3", "hoe_for_fdr": "nothing like a good that's what she said", "mor_e_gon": "❤️ this", "jenniferanngach": "❤️❤️❤️", "janenestageberg": "Love your heart!! Thank you for being vulnerable.", "dahlial": "Oh hey @jengotch you're amazing. ✨💞", "tina_mm416": "Your awesome- I battle anxiety & depression, hormone issues as well. Especially the past few days have been hard. Thank you for posting this, I needed it! Also #bandorocks #yourbetterthanunicorns", "pattymelt": "You are a gem!💓", "gabi.lemoncello": "I love you so much 💖💖💖💖", "erinaschow": "I relate to this on so many levels 🙌", "isabelladeguzman": "oh i LOOOVE YOUUU!!! and i can't love someone that i don't know for looks !! alllllllLll abt that personality✨✨", "cocoslade": "I love you big girl.", "mbbakes76": "You look beautiful ✨", "thelibbyoshow": "You are SO fabulous!!! 💫🌟☄️", "ratchelroberts": "this is so real and so great and thank u", "saynihay": "I just love you ❤️❤️❤️❤️"}