{"giftbyrefiza": "😚 indahnya fotonya", "scottfrance5": "Why are you Carling my dear", "star.peony": "Sending you love and big huggs❤", "briittnniii": "Thank you for this. Thank you 🙏🏼", "divinedemigoddess": "@ashleybarling very very very vulnerable and real. Love you thank you for sharing your story with me this morning in our new bathroom that we share. 💘💘✨ you are called to do wonderful things in this world.", "afashionnerd\nVerified": "Verified", "captain_kaytee": "You are strong and you are sunshine and you are loved 💛", "krisrosulli": "@jaceyro", "suzijscott": "This is so important as to how be been feeling recently as it's so hard to explain it. I'm so pleased I've doing your page. Thank you!", "claudetteazepeda": "Me last night.. and last week @jengotch 🖤", "yellowlamington": "I’ve been there 💛", "lrky": "thank you ❤️", "_klabundles": "@meredithbegley", "kellifrance_": "@savannah_france follow her", "selfloveclubtm": "This is so important! Amazing of you to be courageous enough to share your vulnerable moments. Talk about #selflove. ♥️", "robyn_lou_lou": "💞💞💞", "bymelissamartinez": "This is powerful. Thank you for sharing. Your truth shines a light and is a powerful reminder that we are not the only ones who feel like this. Anxiety many times is suffered in silence. I can't begin to explain how less alone I feel in this season of doubt and fear. Thank you, Jen. ❤️❤️❤️", "eleni_rose": "@jengotch thank you for this. Thank you for showing such a raw and vulnerable side of yourself and keeping the conversation going about mental health. It’s hard for people to understand what anxiety is and feels like from the outside looking in, and now truly terrifying it is. This video oddly calms me, just knowing that I’m not alone maybe; that there are others out there who have felt this way and can come out the other side. So, thank you. ❤️", "chrissyjpowers": "Thank you for posting this! I have anxiety and I’m a therapist 🤦🏼‍♀️... i had a terrible panic attack this week at my son’s school triggered by not seeing him line up in the school yard. I totally freaked out crying in a substitutes arms, hyperventilating, knees shaking legs failing underneath me. I recovered but I left feeling so embarrassed... I always do, Even though it’s something I can’t help. This post is so encouraging to anyone that suffers from anxiety.", "erinedyer": "@charcruze", "eohealing": "Such a powerful video. Thank you for sharing. I suffered from anxiety 8 years ago and have since learned to manage it with aromatherapy and medtation.", "drinkcoffeeandlove": "@brooke.hazelton 💗", "infiniteandrandom": "@latrinalialaura follow this gal", "theglammummy": "My heart actually aches because I know exactly how that feels. I admire you so much @jengotch... not just for the empire have built but mostly for using your platform to A) Raise mental health awareness and mostly B) remind us that we are WARRIORS and not worriers. Thank you from the bottom of my heart ❤️", "mdlnsciarra": "love u", "stacey_v_c": "You are my favorite human! Thanks for your vulnerability @jengotch", "thecurrentnatural": "Im@also triggered by so many things and with a food addiction. It’s even harder because when it comes on all I want I high fat high carb filler. It’s so hard to stay on track.", "nayiimc": "Thanks for sharing 💕", "tericarl": "Thank you. For being a girl boss who is open about her mental health which shows you can still be a high achiever in conjunction with mental health journey. I love you for this post", "hannahjanehd": "@bentley_bushnell", "mish_aguirre": "You’re my hero", "thelouielifestyle": "Exactly! One of the people on Big brother has been dealing with either mental illness or substance withdrawl. They are not showing it on the show, but it is in live feeds. We need to bring awareness to this. Not hide it, then joke around that she’s crazy", "mjlifestyle": "Thank you so much for sharing. The emotions we often hide from the rest of the world can be the most damaging being kept in. Thank you for sharing your strength and journey. Keep it up sister 💓", "beccarnicolson": "❤️", "dianarositani": "woow subhanallaah 💖", "cc_jillian": "@revivetothriveinc @midnight898 you guys need to follow her if you don’t already. She’s incredible ❤️", "kerryfey": "Yesterday’s episode was incredible. Thank you thank you! 💕", "juffyr": "@osospaz I love you sister ❤", "heidimh2": "I love you ❤️", "abodi_s3d": "شبلاه هاذي ؟؟؟", "courtneywwiens": "Write a book please! A book I can find comfort in and a book my husband can use to understand me please please please @jengotch", "bergitrose": "Thank you so much for sharing this", "rrichte7": "@mollyostrow v v v v relatable", "jmamaorama": "I’ve been reading and listening to Brené Brown’s books. I highly recommend them! @brenebrown", "gypseagirl.co": "Do you love trendy boho chic jewelry? Check us out babe! xx", "callyconwayprints": "I think you’re amazing x", "gioiabaldo": "True ❤️", "mayascurls": "❤️🙌🏼💪🏼❤️", "mrscharitysimmons": "Oh my goodness! Thank you so much for sharing! 💗 this is so good, and needed. God bless you.", "colorful_tri_cori": "Sending you so much love! ❤️❤️❤️", "leannlay09": "Thank you. Just ordered the anxiety necklace for me and my 9 year old daughter.", "rebeccagayheartdane\nVerified": "Verified", "clare_wolsoncroft": "@le_winter82", "bravejujubrave": "Thank you for posting this, more real, authentic content please everyone!! I have been here too many times and it’s awful. Much love and gratitude to you @jengotch for this and for all you do in this world 🙏💕💕💕", "emilygsamuel": "@jengotch the words you wrote underneath this video is exactly right on !!#mentalhealthawareness", "urbanyenta": "You give me so much hope", "charleyfarley888": "🌊✨🌎🌸❤️🌊✨🌎🌸❤️🌊", "mamwsinteriors": "You are such a wonderful human being, thank you for sharing this to help others xxx", "alexandracowqueen": "Thank you.", "yerbabuena415": "Thank you for sharing and for all the work you do! ❤️", "candidadrewprior": "You help me...", "greensgirl_nutrition": "Thank you💕", "sayauilla": "😘😘😘", "ashleabelle3": "How much do you contribute your diet/healthier food choices/exercise to helping your heal from your skin issues and improving your mental health? @jengotch", "heykaitking": "Thank you❤️ you’re the only stranger I love.", "ohhh_charlotte": "I so so needed this today. I sobbed at work all day yesterday after receiving feedback on the way in which I was communicating with my coworker and realized that I have worked everyday for the past 9 days and a 67 hour week last week. I reminded myself of that the entire time I was reacting to something that was very small but hurtful because it was a white male complaining about my leadership as a woman and it was incredibly triggering. Thank you for sharing this. 💛", "_lotro_": "As I have gotten older my anxiety has found new ways to interrupt my life. I now get anxiety hangovers if I have had alcohol. It is a dreadful 4am wake up of heart racing panic. 😕", "coastalartdesigns": "I feel like that up and down throughout my life and it is a mindset that you need to think where or what is the deeper meaning of each emotion to help recognize it so you can work on it. Thanks for sharing", "amberkeepsgrowing": "💜🙏", "dinabea": "@mordekaiofficial", "alyssa_spingola_": "You inspire me every damn day. Thank you JG!", "camillertime": "You got this and we got you! 💕", "paristwotrill": "♥️", "scrubekah": "Have you ever listened to @officialdrjoedispenza ? I highly suggest his books & lectures.", "lizhager": "Thank you for being you always and sharing with us! We’re so lucky to have role models like you!!!", "b_love1018": "Your totes my idol! I need to meet you in real life 🤔🚨💞🎉I need to pick your brain!!💞🔥💞🔥🎊💕❤️🚨🎉👍🏻", "beedreams": "Xxxxx", "thedailykale": "Thank you Jen. You’re doing true work. Please don’t stop sharing your truth. It’s helping me. And so many others. I am so appreciative of what you are sharing THANK YOU", "chefloreal": "Dude same", "jaracat": "You are brave and you give me hope ❤️ Thank you", "benvulliamy": "I love you, Jen Gotch, I honestly do.", "coleen_g": "Watching this almost caused an anxiety attack for me as I was remembering how that feels from experience! It’s an ongoing battle. I’m glad you’re feeling like you are taking steps towards anxiety reduction! I’d love to hear some of your tips.", "trineandtrue": "I love you", "lizsea": "This is how I feel right now.", "mamasformamas": "Thank you for sharing this!!!", "feisty_fiestas": "Oh... this is so raw and powerful. Thanks for sharing. Happy you are better now.", "ohhiholiday": "❤️!", "bobbileebrooks": "It’s very disturbing to watch. I had suffered with anxiety attacks which rendered me housebound, afraid to eat because I thought that I was being drugged, and so many other things. It was triggered by trauma and it was the most awful feeling ever. I think that one day I was just so exhausted from it that I was even too tired to have any attacks. It was some kind of breakthrough where I decided that it was enough. I became a runner. Slowly but I did it everyday until I got stronger and ran faster and farther. It really saved me in so many ways. I’m happy for you and until someone goes through it then it is hard to really understand how painful and crippling it is.", "amyjomakespizza": "Very important topic, thank you for being real and sharing with all of us, to help us understand our own emotions and to be more supportive and compassionate towards the emotional health of others.", "jessicaeastlack": "Oh Jen—this video breaks my heart because this has been me 💕💕 Your podcast is amazing—and to see the place your in now is inspiring. Love you lots🙌🏻🙌🏻🙌🏻❤️❤️", "itsnickyrich": "Much needed today ♥️ Thanks for making me feel less alone.", "ursulaa": "❤️❤️❤️", "cailinhillaraki": "This is relatable — uncertainty has defined the last 4 years of my life. Always on edge. Thank you for this.", "_mindss_": "If #JenGotchIsOk then #IAmOk", "lrsn13": "❤️❤️❤️", "kellyaivie": "That’s really tough to watch. It’s traumatic. For you and for us fellow sufferers. Thank you for being so brave to show this vulnerability. While you continue to battle this mean and unkind disease, this has helped so many of us who get lost in the feeling of despair. We can get back up. 🌈", "chelseaevers": "💕💕💕💕💕", "salanderlisbeth82": "Your doing great @jengotch, have you tried faith? I know people are gonna attack me and im not a religious freak but when i feel down or helpless i just go to church and seat there and relax its so calm and beautiful you dont have to be at mass its just peaceful... thats my way of relaxing everybody is different but it’s worth trying", "kristincorley": "you’re the best jen 💌💌💌", "mindyfurano": "You are amazing and powerful and inspire me every day.", "harliengel": "I am SO incredibly inspired by you!!!", "whitvdb": "You are an amazing person. Your raw honesty is so helpful to so many. ❤️", "gweb_": "😢💓", "natashaefuller": "❤️❤️❤️❤️❤️", "cecilia_breanne": "❤️❤️❤️❤️❤️", "srwoods23": "❤️", "brookepowellart": "I can't tell you how much of an inspiration this is to me. YOU are to me. You are so real, so honest, so motivated to help. Thank you for all of it. Our transformation inside and out will continues to ripple outward to people you may never meet. You can do this!! I can do this!! We can do this!!", "theamericae": "Bravo bravo bravo for posting this. Thank you! 🙏🙏👌", "lindseyweidhorn": "@bpatrickflynn this is me and you today and I am grateful because anxiety is less scary when you’re not alone with it", "thecactusplant": "This happened to my last night and I didn't know what it was", "abharward": "@gabriellejoyh this is someone you will appreciate ❤️", "nectarandstone\nVerified": "Verified", "jillminer7777": "Thank you. So. Much. I experience this occasionally and because how I appear the other 90% of the time no one understands.", "annacaro": "Thank you for this.", "elenacarvell": "I will be listening to this 😌 I habitually work myself to death and then spend weeks barely functioning, hating myself 😞 I needed this right now thank you ❤️", "kellyann1020": "Struggling so badly myself the last month after almost a year of relief. It’s debilitating and emotionally draining. Love u so much @jengotch hope you are at a 7.8 or more today.. I’m at about a 5, barely. 💔", "sunday.worst": "💜", "tiffanygarrigus_fitness": "Love your podcast @jengotch I wait impatiently every week 😅Your doing amazing things by sharing all you. ❤️", "max_n_poppysmimi": "You are so REAL", "laura.gwinn": "I think the key for me was your saying you wanted to get to the bottom of it. I catch myself feeling like ‘getting it over with’ or not wanting to deal with it when it’s not happening. But really I do want to get to the bottom of it, it is possible, I believe now, to stop anxiety and panic attacks all together. Thank you so much, your words are really helping.", "christineisgallivanting": "@miamantilla I 💛 her", "mrsadriennebosh\nVerified": "Verified", "wilsoninthemiddle": "Bless you girl. ❤️", "msomervillephotography": "Yup, I can relate to all of those triggers! I’m excited to check out your podcast!", "widewingedbird": "Thank you. 🙏", "chanellemayer": "Thank you for sharing this", "therealflyingyogini": "Thank you for sharing. Your rashes, from anxiety too?", "duffwater": "Thank you for sharing your heart and your vulnerability ❤️❤️❤️", "wrenarthur": "Thank you for your honesty.", "meelissa29": "💪🏼💪🏼💪🏼", "babelyg": "lets tackel anxiety👊🏻👊🏻👊🏻💛💛", "jessichaas": "You are so strong @jengotch and I’m a 3.1 now and seeing this video let me know it’s ok to be a 3.1 and still be a strong woman", "kimmieslc": "I fucking love you ❤️❤️❤️", "itskasia__": "Thank you for sharing this ♥️", "merithegreatandwonderful": "Lady Gotch this was me in March. Me in August is so much healthier physically mentally spiritually. You have been a huge part of that. As has @busyphilipps and @steveagee. Thanks for all of it. Glad to still be here to see this. Much love", "ashleyemma6202": "💛💛💛", "kathywilley": "Thank you for sharing this with us. Gives us all hope!💖👍🏻", "vevebo": "Thanks @jengotch to sharing your story, that can help many people around the world!", "hereforalexis": "Really enjoyed today’s episode. Just thank you ❤️", "theinspirationalmomma": "@jengotch I totally agree about certain situations and people. I was having awful anxiety until I cut my family out of my life. They were physically making me 😷 I’m so glad you posted this because so many people don’t understand anxiety at all. Thank you 🙏", "datmeesh": "Thank you for sharing.", "_oxford_comma_": "Thank you so much for this. I suffer from anxiety as well and am have a particularly tough week, and today especially has been hard. I can’t wait to listen to your podcast to hear what’s helped you. Thank you so much for being open about something so crucial. I am open about struggling with anxiety, too, in hopes to embrace my authentic self and decrease the stigma of mental health illnesses. Thank you again ❤️", "hungrybeastnyc": "❤️❤️❤️Thank you for sharing your story.", "bexleemusic": "Wow thank you 👏", "savageseeds": "♥️ ♥️ ♥️", "yukimackdivasenorita": "💪🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "45threemodernvintage": "You’re amazing Jen!!!", "thaislcollins": "♥️♥️♥️♥️♥️♥️♥️♥️", "mfarenish": "@amybethgansel Totally feeling this. Do you follow Jen Gotch? I love her podcast.", "shellyboo28": "You are beautiful 💜 thank you for sharing your story and keeping us motivated to keep pushing forward. My job is highly stressful and on Friday I had a bad panic attack. But I had to get it together and finish my job. So I somehow pushed thru then ran home early. I’ve been told that if I pulled it together I should have let it go and stayed. I don’t people realize how depleting this is on you mind body and soul. I feel like as hard as I try I’m not trying hard enough.", "studiobrackenart": "Thanks for being so real. Anxiety is such a bitch and a very vey real thing. Here’s to being vulnerable and working through it together 💕", "sundayforever": "This shook me the first time I saw it and still has the same impact. Thank you 🙏🏼", "melati.akilia": "Thank you for sharing @jengotch now I know I’m not alone. It also happens to me some time. I’ve been struggling about my career, my life, my future. Sometimes I don’t even know what to do. Sometimes I just want to come back as I was child. As I was free. Nothing to worry about. But I couldn’t. All we can do ist fight and moving forward. I know now I’m not alone. Thank you. We can do this!", "liatnoten": "You are amazing. ❤️", "carlycaresaboutthehair": "@joyfullybroken1", "grland.co": "thank you for this reminder!! I admire your journey!", "creme.miami": "We love you Queen 💫🦋", "noelsmall": "@jengotch not even sure if this is what you mean, but thank you for putting adderall on your list of triggers. I was on it for over a year to treat my ADHD and it only made my depression/manic episodes/anxiety so much worse. It took me so long to realize that though, cause I was under ‘the spell’. anyway. I feel like so often when we are desperate for help and answers we want to believe medications are it, and sometimes they are, absolutely helpful, but fucking proceed with caution because it’s a double edge sword for some...anyway just my experience and I in no way judge anyone for their choices. We are all doing are damn best! Love you to the moon. 😘", "mambo12311": "👏🏻👊🏻✌🏼", "hklausen": "I love how open you are about your anxiety, it gives us who are also dealing with similar problems hope for the future.", "katalyst4grace": "Are you me? I want to thank you with all my heart for sharing this...it is painful for me as an empath, and a panic attack/anxiety victim to watch. I wanted to save you. I wanted to tell you that all would be well. I wanted to make you laugh. I wanted to hug you and let you cry it out. It takes courage to post this...and I thank you.", "jessegphinn": "God bless you! I know this feeling all to well and I am triggered by the most random and silly things. As well as the big things. It’s been a long fight for me with highs and lows. I have recently been working super hard to better my anxiety and panic with diet, exercise, decreased caffeine, and just trying to better my healthy over all. I still have bad days but they are few and far between now. Thank you for sharing this reality. It was so brave of you! Keep up the good fight!! You are an inspiration!!", "olivtrees": "Oh @jengotch thank you !!!! #withyou 😭😪😓⚡️⚡️⚡️⚡️⚡️⚡️🌼⚡️✨🌻🌟💫💛💛💛💛💛💛💛💫☀️⚡️ @thatgirlconnor", "isabelladeguzman": "Thank you Jen", "jessmachh": "This is why I love and respect you. ✊🏾💪🏽♥️ you are so strong.", "maddieloza": "You’re an inspiration. ❤️🌻", "taniadvillegas": "What a transformation you’ve made kudos to you 👏🏼", "amelie1206": "I LOVE YOU! Thank you soooo much! 💜", "naturefriendlygal": "Wow. Thank you for sharing your story. This is me currently and a lot of the times. It’s hard. I’m trying to change and grow but I feel stuck. Thank you for giving me so much strength and courage. I have hope for myself I’ll get through this 💗 you’re so beautiful on the inside and out", "mariguedes": "Thank you ❤️", "mizzpeachy64": "THANK YOU for this powerful personal commentary and video. I know you have had a positive impact on me and my struggles. And I’m so very grateful. 🤗", "nataliebubb": "God, I love you. Thank you for being so open.", "kei.di": "Thank you for shedding light and sharing your journey ♥️", "mschwertner": "You got it!!!! Now to infinity and beyond!!", "rebeccabillybob": "Thankyou for your honesty x", "justagirl": "This was intense. Real. I’m so grateful you shared it then & now. Mental illness is real. Raw. Sharing this is changing the conversation & shedding a light on a subject too often taboo & ignored. Thank you.🙏🏼☀️💛", "flantastic": "❤️❤️❤️ love you so much. Have to say you look awful in this video but that’s what I love. I also look awful when I’m losing my mind from anxiety. It’s like the first time some people even know I have anxiety because I’ll look so, so miserable and sick and ill. Other times I’ll feel this way and have to look fine. Thank you for your pod, your sharing, and your fighting for yourself to keep going and creating. Fuck that jerk off, you’re so much stronger and beginning to publicly call it out is so helpful. You can be a boss bitch and also crippled by your own brain. So what, you’re still a boss of your life and overcoming so much unseen turmoil and challenging emotions. Love ya Jen, 💕💕", "claire_kramer_mackinnon": "YOU ARE SO SPECIAL AND WONDERFUL AND THANK YOU.", "vanessabancheri": "Man I feel this, I just hope one day I can have a podcast saying I’m ok #VBOK", "britnim_": "Thank you for sharing your story and being your authentic self on a platform where it’s often difficult to find the real among the fake. You’re an inspiration as a business leader, woman, and fellow human! Keep serving your soul and encouraging others to do the same!", "oh.hello.gato": "Thank you for this ❤️", "kiwijess": "♥️♥️♥️", "carol.a.wild": "Thanks for being so vulnerable. I’m right here struggling along with you and have been there too. I really appreciate you sharing this with the world. ❤️❤️❤️", "cashmerewishes": "Thank you", "largemeatpie": "Thank you, darling x", "nicolateschla": "This gives me chills because I know this exact feeling so well. Thank you for sharing this very personal moment. Any vulnerability or weakness that you’ve felt from sharing this I hope is balanced with the feeling of knowing how much this means to so many people.", "bybun": "🙌🏻👊🏻👍🏻❤️", "kristenramseyart": "Thank you for sharing your journey! I’m loving the podcast so much! ❤️❤️❤️", "mreen14": "You’re a hero, thank you for caring about helping others!", "mballachino": "You are awesome", "megjyay": "Thank you for sharing!", "rankandsugar": "❤️👊🏼❤️", "westy78": "Total respect. You are amazing, brave and oh so courageous x", "shantibeets": "#jengotchisawesomeallthetime 🙏🏻 Thank you for sharing. This is powerful stuff ❤️", "jennifer_s_hudson": "Great post. I used to have panic attacks, they're horrible. Thanks for posting about this.", "ouranimalbrains": "Can't wait to listen! Learning about cognitive schema has helped me so much with my anxiety. Just recognizing the learned pathways and trying to redirect them. Also antidepressants and therapy 😁🏆", "wholetraveler": "You are amazing! This is so inspring!", "emiliewhy": "I needed this right now. Thank you 💕", "karen15kennedy": "❣️", "kristoffterri": "This breaks my heart 💔 glad you are in a better place", "carynreneewright": "@grlsnight", "erikablank_": "You are a brave and beautiful soul - you got this girl!!!!", "marie_franklin_": "You’re one of the bravest women I know. It’s not easy to be as vulnerable as you are with all of us. #madrespect -and the fact that you do it for others bc U know ppl go through a lot of the same shit. It’s a conversation that needs to be started and you’re absolutely great at it. Just want you to know keep up the great work! Also i can’t wait to read your book. #preorderamazonready", "jessicamargotco": "@stephfeldman", "salsa_tits": "Jen gotch... you are ok. Not ok here, but you're ok sometimes 💓", "madisonolimb": "Love you love you love you", "mary.c.harper": "I ordered the \"Anxiety\" necklaces for myself and little sister and they've just arrived! From a young age, we've each struggled in very unique yet familiar ways in our lifelong mental health wellness journey. Since we lost our mom to breast cancer in our teens and as the older sister, I feel a sense of responsibility to nourish her wellness more than my own. A mistake I have to tenderly remind myself of in a moment of sheer panic or in the midst of a blubbering breakdown. @jengotch, you're a star in the darkness. A balance of forces that came together to bring light to those you encounter, both personally and across the world. Thank you 🌠", "fernanda.motac": "Keep strong, gal!! 💪🏻 Thanks for sharing!!", "munagram0808": "Amazing. Brought me to tears. Thank you.", "lynnettjevdh": "I don’t wanna like this video because it’s totally horrible to experience anxiety. I’m going trough that these days. I wish you all the best!", "janineishappy": "There is high vibration and low vibration. We are in control to lift ourselves up consciously to a higher vibration by eating what our body needs, watching uplifting, positive shows, doing things we love, controlling our thoughts and the things we tell ourselves and many more. If we know our triggers and avoid them, we can properly manage our emotions and mental state. It is up to us. If we claim depression and anxiety to define us then it becomes part of us and we lose our power to it. We are responsible and we have the power to raise our vibration to a higher state by making the right choices and controlling what goes in and out of every part of our being. It takes a lot but it is possible. And it is up to us. Do not give your power away. Everything is energy.", "thebirdsandthebris": "Love you Jen Gotch", "instagram_ang": "it takes courage to expose your struggle with the purpose of helping others. 💪🏻😊", "shop31suns": "😭❤️", "adrlpz": "Anxiety... I see you... 🙌🏻 I just won’t lean into you.💕✨", "m_anhaltzer": "I ❤️ you for your exquisite realness.", "elleebeans": "Thank you for always being real with us! Also for continuing this conversation! It takes a lot of guts to post something like this❤️ I admire and look up to you so much❤️ Ps. Keeping doing you, Jen💪🏼🦄", "adridol": "@chinachang34 @monicafaour", "s__aucy": "@sophiajames22 😊", "jennajolls": "@kaykaymoffatt good read!", "sarastarstuff": "You’re the best 💪🏼", "tammygordon": "Love you.", "singingwithhlc": "Thank you. 💛 you’re a success story.", "angeladeane": "♥️", "nogi_t": "U R Amazing.", "katie_rockliff": "You are GOLD @jengotch 🙏✨", "_breadnbuttr": "♥️♥️", "berryface": "@lickhart I love this lady so much! I wanna work with her some day. She gets it", "daniella.ariana": "Thank you for sharing this ❤️ you’re not alone. You’re an inspiration", "fan.tesstic": "Thank you for sharing your journey in such an honest way, you are my leading example and you have had such an impact on how I handle my own anxiety.", "sleepy_king": "♥️♥️♥️♥️♥️♥️♥️♥️", "goddess_foxxy_": "You can count on me", "bycayla": "you’re amazing 💖💖💖", "megrileywinnipeg": "This looks like a different woman. Thanks for sharing this.", "jillbeltrano": "Thank you so much for sharing this part of yourself in such an open, honest, and constructive way. I hope you know how much it truly helps so many people, and I hope it helps you too! Xoxo", "apbenven": "You are a seriously incredible human and I love your podcast", "christachhrista": "Do you take meds for your anxiety?", "aruehlin": "Superhero", "mobutts": "Thank you for openly sharing your struggles with us! This goes without saying but, this helps so many people! Myself included.", "prettycrabby": "♥️♥️♥️", "aliweissjewelry": "So brave", "rachbea": "Thank you for being you and spreading awareness. I have learned so much from you and follow you because you are such a source of positivity in my life.", "lilli_beck18": "This video will always be relevant👏🏼", "mwilliamson4": "We’re all in this together!", "houseoftenebris": "I recently discovered something called overmethylation because my daughter was spiraling down into a deep dark abyss from extreme anxiety and nothing was working. Turns out she was over methylated. 2 days into the protocol and she was a whole new person 1 month and I have my child back. I could go into all the details but I highly suggest you look into it and if you are seeing a psychiatrist discuss it with him/her. Its relatively easy to figure out and can be the root cause of anxiety, depression and mental illness including schizophrenia in as much as 80% of people.", "kellyhall.style": "Thank you for being so open and real ❤️", "libbylivingcolorfully": "You’re amazing @jengotch. 💕", "stuffshylodoes": "💕✨💕✨💕 Thanks for sharing", "riananelson": "You are amazing. Thank you for keeping it real, and providing so much empowerment for others to keep going and tackling anxiety and depression!!! ❤️", "brietammarop": "Thank you for sharing. Adderall is the worst thing for anxiety and they should stop prescribing it especially to our children and making everyone think they need it to get ahead!! Diet and mindfulness and spiritual betterment like you mention are so much more effective and don’t hurt our bodies or make our anxiety unmanageable! Thank you for being so brave and so honest ❤️❤️❤️!", "360degreesoftexas": "The leaps and bounds you have made give me hope! It breaks my heart to see you this way and I just want to hug you. It also makes me realize I am so much harder on myself when I have these breakdowns. Maybe to know that you've come out the other side and maybe I can too, means I can start being nicer to myself when I fail.", "nidiakarenn": "Thank you for sharing ❤️ you are amazing .", "getadvancedchic": "💕💕💕💕You Go Girl ❤️", "jennleigh12": "@juliecrosson", "darling_marcelle": "Your ig posts and podcast has helped me so much to feel less alone. Thank you for showing the hard parts ❤️❤️", "shannon72973": "#blessyou thank you for sharing!!! ❤️", "berber_anna": "🤜🏻🤛🏻", "house.of.zandar": "You are strong sister 💞", "eimearvarianbarry\nVerified": "Verified", "ninni.insta.photo": "Thank you for sharing 🙏🏻❤️", "arley.street": "💪💪💪💪💪💪💪💪", "hannaaddy": "@ryan_stover", "bexxjamo": "💪🏻", "backstageboo": "💕💕💕", "oliviagraceross": "Similar to me today", "lookbackwithwonder": "I loved this episode but I wish it was more extensive! More details, fleshing everything out more.", "curly__headed": "Thank you for being who you are, and for sharing it with a world that can be pretty scary sometimes. I’m really glad that #jengotchisok", "ouiparis_nicole": "♥️", "madrelinen": "woman you are an inspiration! i love your transparency on this platform that likes to primarily only show our best, most put together sides. leaving the other, less glamorous pieces left to have us feel shameful and unsuccessful rather than as information on how we aren’t taking care of ourselves. we can’t shift anything we aren’t willing to expose and bring into the light. good work lady! ♥️", "liaarvidsson": "💥", "shatteredgold": "Love love love you! You inspire me everyday. I remember when I went to bando for one of your warehouse sales I saw you and I just froze I couldn’t go up to you. You’re a true girl boss! I also suffer from anxiety and I’m working on it everyday! Baby steps right? Much love!", "bear_and_sparkle": "@eimearvarianbarry -> @JenGotch has done some great posts on anxiety, might be helpful xx", "lauralorena86": "❤❤❤", "polkadotwhimsy": "Thank you always for sharing your story.. I’ve learned my triggers and bit it is life changing..but still have mini breakdowns ..", "mollygenxjane": "Girl. Whew. I’ve never seen this before. Leaps and bounds.", "zanklaren": "This hurts to watch. I know this feeling and when you are in it you feel so scared and hopeless!! Thanks for being a voice for us!! This time last year I didn’t know who you were. Now, I tell everyone about you and consider you my spirit animal!! 🎯💕🙏🏻", "gshokrian3": "I’m so amazed by you @jengotch", "linz_901": "Powerful stuff. I’ve been there hundreds of times. Never would I ever share with anyone that I’ve been that low. And I think if had, it could help comfort someone going through the same thing. Thank you @jengotch for being so brave. You confortes me and I don’t feel alone and crazy. 👭", "ashley_mersereau": "@life_with_maddy I love her so much, and thought of you after our recent convos about anxiety. It’s the WORST!!💩💩. Anyways, thought you might find this inspiring!", "mrs_selephonile": "Thank you for sharing this ❤️️", "cynavago": "Jen thank you for sharing your story", "susan_touw": "Slow clap for being so brave. And for sharing these so you can help others and yourself.", "essebest": "So much respect for you and how you got where you are now. Hope I will get there too. Thank you for sharing ♥️", "littleshopofoils": "Oh been there! Thanks for always being you @jengotch", "thesisterproj": "Anxiety really is a huge freaking jerk off. Thank you for sharing this very real struggle. F U anxiety. 🖕🏻thank you, @jengotch 🙏🏻", "tkjcollins": "U da bomb", "conitageller": "Thank you Jen 💞 you inspire me everyday", "fleurwoodsart": "🙏💖", "st.aces": "Thank you so much", "chelseamcdonnell13": "Jen you are my favorite ever", "waikikibina": "Thanks for sharing 🙏 You are an inspiration to many who battle against anxiety 💪💫", "mirbrown75": "Mad love, respect and gratitude for all that you do 💕👊🏼🙏🏼", "twoplusluna": "Thank you for always keeping it real 💗", "scandinaviaflick": "@jennystrobaugh", "therealthaibarani": "You're amazing. Xx", "mirandatanner": "Look how far you’ve come 👏🏼👏🏼👏🏼👏🏼💖", "thewildunfolding": "You are my favorite fucking role model. Thank you for doing this work and sharing yourself to help others and myself do life’s work.", "badelia17": "Real ppl, real life struggles. Respect and care for yourself and the people around will only push you and your loved ones forward. @catianna sending u the best vibes girl you’re my best friend! 💜", "shanirene": "So happy you are in a better headspace 💞", "kathkruger": "💪🏻💖", "marcussams": "Thank you so much for sharing this. ❤️", "trettiodagarharnovember": "💪🧡", "amynonomcg": "@jengotch it hurts to watch this. Can’t imagine how hard it is to be in that moment. Lots of love. 💙", "annmariemcqueenabudhabi": "Slow clap to you for sharing again and being so open about all of it. You have inspired me to do the same... I can see it shocks people a bit but I feel it’s so important. (I live in Abu Dhabi among a lot of different nationalities and they allll suffer to) I hope more great things come to you, you deserve them all for being such a positive force! 🤸🏻‍♂️📣🤗", "materialarchive": "Thank you for sharing this. It helps ❤️", "ca_crissyangel": "You are so amazing. Never for one second doubt the effect you are having on people. In big ways and small ways. Grateful for your honest, true, raw voice in this sea of vapid social that I too struggle with how to partake. Been thinking about LEGACY this week. You my dear, are living and building yours by just being you. Trust in that. We love you! ❤️", "chanel.prineas": "You are such an inspiration and have given me the encouragement to start my own blog about my struggles! xo", "renna.rose": "🖤🖤🖤 me at least twice a month — but down from every single week. Therapy has helped so much but dang is this so hard. Anxiety tells you so many lies to scare you. Thank you for sharing the vulnerability.", "susanvogan": "You’re a brave chick. I like you. 😊", "ohmylambers": "💙", "kellyterranova_": "U r fucking incredible woman let me tell u! X", "sbmaier": "Girl, you got me here. Can’t wait to listen in.", "mirzydotes": "Anxiety is a trained pattern of thought — we learn anxiety. Unlearning it can take a lifetime. You’re such an inspiration for committing to making milestone changes to combat your anxiety while also letting complete strangers in on the hard work you do. Thanks for it. It really helps.", "booandpapoose": "Thank you for everything!", "dr.christina_": "There is so much strength in your vulnerability! Thank you for continuing to use your platform to raise awareness around mental health.", "neelzvanwie": "❤🙏🙌", "missbellpr": "I have a video like this, you are so brave to post yours!", "nickosirogjones": "So much love to you and your journey to success. I’ve seen you grow so much in the past several years, it makes me so happy for you!💖", "jlolo72": "This is a must read and watch @guilty_gavin"}