{"starkscuba": "Truly inspirational", "keumbeebungoeng": "Hallow there....? Hi, My Names is Risna, an Acehnese women, of Indonesia. Nice to have comes across your picture and interstingly nice stories.... I like your Style, Girl...: .... Nive to meet ya....! Warm hugs, from Jogja.", "nadinecale": "Thank you Jen🙏🏻🌈💜", "emkee507": "@rnyahay", "sittymei": "Looks great!", "luckygirlbyann": "Thank you @jengotch for sharing your story. I came across your page and was a little overwhelmed with all of the similarities of your story to mine. I haven’t been divorced but also have shared the ‘now and then’ photos and also felt a little uncomfortable doing that. Listening to your podcast and hearing the term ‘self congratulatory’ and how that wasn’t your intent was as if a lightbulb went off. I also have had some challenging and horribly stressful times in my life going back to 2011. In that time my Mom passed away from cancer, I was diagnosed with breast cancer myself and had a horrible time with the surgeries and chemo. Depression, going to therapy and a psychiatrist for the first time, I’ve been there done that. My goal, also having learned a lot along the way after those 7 or so years is to share that with others. My ‘reach’ is a much smaller than yours and my page is what I would call a hobby and I post what I am interested in and share stories from my life in the hope that it helps others. I’m going to repost this and thank you again! ✨✨", "heatherlisi": "I’m inspired 💕", "noemie.mcgovern": "@nicthorne 💕", "pippa.diane": "@ashleykathleengray", "jordiiehanky": "I am going through a bad breakup right now and this is seriously something I really needed. Thank you.", "tamacita": "This resonates 💕", "nicolablom": "@jengotch Wow, so raw, how encouraging! You are so brave! I would really recommend listing to @drcarolineleaf podcasts and considering her 21 day brain detox! Am almost completely cured from my anxiety (which at some point was severe that I almost ended up in a clinic) was a day to day struggle and fight, I am almost free ✨", "shopfrey": "This. All of this I needed. Today. Yesterday. 💗💗", "gravitonicstudio": "Thank you. 🖤", "a.shapo": "👏🏻❤️❤️❤️❤️❤️😘🌍", "sinarichert": "Did you have a diet and work out regimen you stick to?", "mesaverdeuce": "Whooooa this speaks to me so deeply even down to the hair I’m so happy and proud of my long hair! #emotionaltwinning happy for you and to found your prof (do people abbreviate profile like that idk)", "ohmialymy": "@kytticat", "advonre": "You are raw, real, and I appreciate you so much. Thank you, glorious woman. ✨", "lovelylibra_0926": "💪", "darcywhite": "@jengotch can I ask what form of exercise you’ve gotten into? Your body changes are incredible!! You look incredibly healthy & vibrant! ✨", "farrahbleich": "Where is the podcast?! I want to listen!!", "wells.jeffrey": "You look fantastic! Gorgeous! Sexy! 47, no way!😍❤️🔥", "emilyruthyo": "Is this a podcast and what episode is it?", "suzimoonpie": "You sound wonderful and I’m glad your feeling better!!❤️", "taraalvi2": "You're absolute pure love. Love from Pakistan. I absolutely LOVEEEEEE your dance moves ma'am. 😍", "mel_exene": "Thank you for continuing to share your story with us. :)", "instacarbs_": "Awesome post ❤️ keep fighting x", "katiesundquist": "🙌 You are amazing!", "adridol": "I think feeling amazing is the most important thing. If for you knowing your body is capable of more and feeling it’s stronger means you feel healthier and happier well 💪🏻 you go girl. Celebrate it! No one has to feel bad for that, I just don’t get why they can’t feel happy for you! 🤷🏻‍♀️ we all have to stop the criticism and celebrate others stepping stones, whichever they might be as long as they’re healthy. ✨", "nateandco": "I love this.", "marissahope": "Loved this episode! Thank you for sharing your tips. It inspired me to write down a list of things I need to do help myself. What kind of collagen do you take?", "scullyandem": "You inspire so many people, and impact lives by bringing a fun and honest voice to taking care of yourself. Just remember that people will interpret things the way they want to interpret them, and that’s way beyond your control and also not your responsibility. 99% of people know exactly what you mean by getting better. I’m glad I found you, Jen!", "wynnantonio": "Amazing", "jmasouthbay": "Resonates ♥️", "kamakshi__b": "You are beautiful and unique❤❤❤ you are you and thats what makes you even more beautiful❤", "softblond": "I have always looked up to the way you speak about mental health and your journey, but I think it’s important (with the platform you have) to address the toxicity of diet culture and the incorrect idea of “thin = healthy”. Diet and mental health are intertwined in a way that is harmful to many— and a before/after photo can overshadow the point you are trying to make. In my feed, i saw the photo first- immediately though “wow, i look like before- i clearly still have work to to” and THEN read the caption, which is extremely inspiring- but unfortunately the damage had been done. I applaud all of the work you are doing and you are such a source of inspiration and good in the world—i just this is a reminder to be a little more mindful of the effect of photos like these. We’re all in this together.", "laurenlograsso": "Jen, I am so honored to be included amongst the tags. Producing your show and knowing you is a great honor. I am so proud of what we have made/are making. You have changed my life in such a profound way- you've helped me become more honest about how I feel, encouraged my vulnerability and made me realize I am safe and protected. Thanks for all the laughs, advice, support and great content. Love you tons!", "dosist\nVerified": "Verified", "thechain\nVerified": "Verified", "kakeescookies": "Loved loved loved your podcast, and very interested in any reiki-related books you can recommend from amazon!", "theprintsworld": "Loverher so much", "minimagkate": "So inspiring Jen! 🙌🏻💛", "tjperez": "😍😍😍😍😍😍😍😍", "juliee181": "@beth.evers", "thoughtbakery": "My gosh your story is so inspiring. Showing that success is not an output of perfection but rather the opposite. We sent you an email, hoping we can feature you on our blog, teaspoons with Thought Bakery. Hope to hear from you soon!!!!🤗", "karenc_1984": "Just watched your i-stories. I saw this post earlier. Love all your posts btw. I am going through personal hell right now, divorce etc etc. Weight is not an issue for me, but my God, healing comes through love, not through envy or triggers. I am turned off by the ppl who post only cotton candy posts, but jg, you are so different! I believe a post like this draws out hope. Inspires. It says to me, this too shall pass. I just think that if negativity is your 1st response to a post like this, then deeper work is needed. Lovingly said xx", "tigertigerstudio": "💪🏽💪🏽💪🏽💪🏽💪🏽💪🏽💪🏽", "frankie____12345": "This is amazing! I am trying to do the same, you have done so well to journey to heal yourself and to fight against the struggle! And thank you for sharing this and helping us too! I am inspired ! How do I get hold of this JGOK? Huge love and respect ❤️☺️xx", "kararosenlund\nVerified": "Verified", "lucy_siddall": "✨✨ Thank you for this. I am where you were and it’s inspiring to hear this isn’t forever xxx💫💫", "getadvancedchic": "Awesome 💕💕💕Your doing it !! And looking Fabulous 💪🏻", "choooch6": "Thank you for sharing your journey.💓✨💓✨", "aklimton": "You are awesome", "yo_ga_momma": "Thank you for sharing! I’ve been working my way back to myself and it’s been extremely painful and incredibly amazing. I have a natural tendency to avoid pain but I’m dealing with it all. Except in the toxic relationships, those don’t need dealt with they just need to go ✌🏼", "superlative_mediocrity": "🔥", "the_silentpartner": "Great hair!!", "mouselovespig": "You're incredible 💗", "soniamoghe": "💗", "charliewensley": "I just discovered your IG and podcast and it feels like you’re talking to me. I’ve been in a desperate place for about 4 years now. Im finally getting treatment and it is helping but I know there is so much more I should do and it feels so daunting. Especially flossing. I cried when you mentioned flossing 🙄. But I wanted to say thank you for talking about this and for making those of us with similar disorders feel less freakish. Thank you. #imgonnagoflossnow 😘", "lexipulitzer": "@clairekbonnell life takes work but it gets better!", "justanell": "💕", "whitvdb": "I just listened to many of your podcasts on a long drive and love them all. Thank you for sharing and all the good advice!", "abirdwell": "❤️", "lauralorena86": "❤❤❤✨✨✨", "melissatacobellhines": "How are you treating your bipolar?", "alilabelle": "love you ❤️", "mjlifestyle": "Beautiful woman!! Thank you for sharing your strength (& struggles) 🙌🏼💓 @jengotch", "lilixx": "As a woman I ❤️ u. As the partner of someone with Bipolar, ADD and severe anxiety I cannot thank you enough for your podcast 😘", "lenolovin": "Love you💖💖", "everythingheavenly": "Jen I just discovered your podcast. Thank you for being so open. I’m also recovering from a divorce and basically a mental and physical breakdown. You look perfect to me in your before and your after. ❤️🌈", "jannevollert_plantbasedchef": "So, so glad I found your page, I can relate on so many levels. Feels good to know other people feel the same feelings and go through the same rough times 💙", "ashligrey": "@morganslate - I just sent you this and asked you to please read...then looked down at the comments to find you here ❤️. I love you!!", "rachelervkorb": "#projectilecrying . So real!", "lekfit\nVerified": "Verified", "jlrieser": "Congratulations- you should be proud of yourself", "jhillbattilana": "This was a great episode! Reiki forever!!", "sarahcappie": "🦄", "alacarte.designs": "You go gurl", "mollylomenzo": "Really needed to hear this today @jengotch!", "emilyjanefromky": "This is everything, and resonates with my current situation. Can't wait to listen to the episode❤️", "artofcloudy": "I can’t wait to hear this episode on your podcast. I had started to do well and lose weight (after going through a divorce as well). But right now have lost momentum? 🤷🏻‍♀️ This post has inspired me to get back at it 🙌🏼", "badgalryyyry": "💖💖💖", "esme.alias": "🌞🌞🌞🌞", "caylita_": "You look great! 💗💪🏼", "mr_gautam_solanki": "So beautiful pic", "seeksophia": "Look at them abs!!! 👀", "neraberkolli": "Yay!!! ♥️", "choelita": "@marianetcamo i love her! Such and inspiration for me! ❤️", "lrandall76": "Goals😘💪", "ebethrix": "💕 @katy__harmon maybe your next step is gloriously long hair.", "kerryburd70": "You are amazing! Thank you for sharing!❤", "boldbravemum": "Thank you so much for this. I'm in a similar place that you were in 2 years ago. My husband left 6 months ago and since then I've been numbing myself out with too much food and alcohol, and just punishing myself daily. You are such an inspiration and encourage me to take care of myself and start learning to love myself. I'm at the bottom so the only way to go is up. Thank you so much Jen for who you are and what you do xx", "tinnaaaaaa": "@dalejennifer love her", "meredith_sterk": "Thank you for sharing your story and teaching us along the way. ❤️ so proud of you and inspired as well.", "thelovedesignedlife": "you looked great before, but your total transformation is so inspiring!", "a.p.i.e.c.e.o.f.c.a.k.e": "👏🏼👏🏼👏🏼👏🏼👏🏼", "puresanchez": "Spicy mami hot tamale", "jennyalmonte29": "Hey Jen! So. You’re amazing. You’ve done so much good work. We went to the same high school. But. I’m not at a place in my life where this before/after makes me feel good about myself. I still have a long way to go. So I’m unfollowing you. Just for a little while. Not because I want to, but this is a journey I’m on? I hope that’s ok! Be back soon! Xo", "tammi_hd": "Damn @jengotch. You make victory look gooood.", "thelouielifestyle": "Lookin great", "poppyandpout": "Thank you for making this topic so approachable! We 💕 JG", "emmafeilphotography": "Man you rock 💪🏼", "lushboudoirbycassidymr": "Thrilled for you. So happy that you are shining bright!!", "raquelmideau": "Love everything about this! So glad you’re doing better. Each day is a clean slate.", "masseuse_on_the_loose": "This! So good.", "paytoncturner": "❤️❤️❤️🕊🕊🕊", "martynowak1": "Yum Yom!", "janamboyles": "You’re truly inspiring. “Felt I looked like a stranger to myself.” Can’t wait to listen.", "eileelife": "I need this Jen 💗thank you 😊", "deejayzoo": "tooooo real. i love your willingness to share your truth. this hits close to home. ✨", "mizzpeachy64": "WE LOVE YOU JGOK!!!", "shelbymc12": "Cute as ever!!!", "thesilverliningblogger": "Love this and you!!! 💗", "meglyn8": "I’ve watched since the beginning because I struggle as well. I admire you so much.", "eliandbarry": "Love this and just FYI I think you’re beautiful in both photos.", "gretchcma": "Looking 🔥🙌🏼🌈🎉", "conchabelle": "@jengotch you look amazing!! Thank you for being so candid about your life and mental health. It takes a brave soul to let others see you when you are most vulnerable. Sending love and positive vibes your way!! BTW - I freakin love your dancing by the dumpster series!! It makes me smile from ear to ear!", "kambrae": "You go girl, hotness! Thank you for your vulnerability and honesty..it’s refreshing and inspiring..", "laurarongione": "❤️", "kamboco": "Love love this. You make my day every time I see your posts or insta stories. Truly! 💯", "vaidadta": "❤️❤️❤️❤️❤️", "beccatronic": "Looking good and most importantly, feeling good 🙌🏽🌈", "isaisafloral": "🙏🏽🙌🏽🙏🏽🙌🏽🙏🏽aBout to listen !! Thank you!!!", "mrssmc": "Gloriously long #sexhair TM", "catmxcg": "🙌😍🙏🏃‍♀️🔥", "kelly.eee": "💛💛", "thymewithjess": "So much love for you ♥️", "emilynewyorkcity": "you are the cutest ever and you rock for being so real!!!", "lolliswim": "You’re an inspiration babe 🌈💗✨", "rannyaxl": "I feel you... 🙏", "hannahjanestylegame": "Such an inspiration! Thank you for sharing 💖", "loopoperandai": "Is bullet proof coffee just like fit tea? Or \"shit tea?\" Basically a laxette?", "amanda.rose.85": "💜💎🙏🏼⭐️🔮👑", "littlebytheseastudio": "💕", "playfullymodernhome": "Congrats on doing the hard work!!", "goosebumpsboutiquebedding": "So happy your found your happy Jen. I’m still looking for mine but am motivated to get there. Your the best and thanks for being so open. Onwards and upwards. 🌸☀️⭐️", "mamiepeers": "Id love to listen but am on Android, no iTunes. So you have", "crazy_gringo": "YEAAAAAH🤘🤘🤘", "kitty26_2": "@elaine_bennace2", "45threemodernvintage": "So good! BRAVO 🌟🌟", "lovechelseadelgado": "👏🏼👏🏼👏🏼👏🏼 YESSS Jen!!!!!", "therealshivs": "you inspire me 💕💪🏼", "bronaaa": "@jaderooneyy", "rachn_1": "Congratulations! This has given me so much hope!", "auntieb123": "👏🙌👍", "potatochipqueen": "Jen Gotch is an inspiration A L W A Y S", "bashandbloom": "@lwolfmother was gonna tag you in this and then saw you’d already commented. With your cold, dead heart. 😘", "mwclarke17": "It’s so inspiring that you are able to be open about your mental health! Sadly, to me this image suggests a. That improvement in mental health can/should result in being smaller/thinner and b. That being thinner is the same as being physically healthier. Though that might be true for you it certainly isn’t for everyone and, of course, obsession with body size is a huge contributor to mental health struggles for many. I love what you write but I wish the image you chose better reflected what I think you were trying to say.", "tayandtoast": "@wildb17 @saltandquartz", "sharni_layton\nVerified": "Verified", "fromnancysheart": "Completely understand and will def give it a listen! May I say I’m proud of you for going through that journey and helping your best friend (you!)! ❤️", "emiliecora": "🤟🏼🤟🏼🤟🏼🤟🏼🤟🏼", "barbiwood": "Beautiful! Courageous! Authentic! Inspiring! ❤", "ryannncarrrolll": "Damn it, I was really hoping the answer to this was more bread and copious amounts of wine. 😉 In reality, thanks for sharing your vulnerability regularly and being so honest, gives us normies hope!!", "cleaningcold": "You look amazing. Your writing is inspirational too.", "iamonwings": "I listened to your podcasts while flying. I can relate to you and your struggles so much. What frustrates me the most about myself is I fear I will never reach my potential. I have so many dreams and goals but no idea how to make any of them happen, which scares me to death. How did you become so successful in business despite all of the issues? I just want a crumb of advice that I can use for some desperately needed inspiration.", "sweetthensavory": "❤️❤️❤️", "amyglenn": "Can we talk about the length of your hair right now?!?!", "realtormichela": "🙂🙃🙂", "elisabethleonard_": "YOU GO GIRL", "dsar3": "👏🏻⚡️💓👏🏻⚡️💓", "mamivg": "❤️❤️❤️", "alexbourgeois": "Thank you for this podcast and this episode specifically. ❤️", "oh.hello.gato": "These posts are so helpful 🙌🏼 thank you!! ❤️💖", "designandhappiness": "You are such an inspiration! You look amazing! 💖💖💖", "larkquill": "Your hair DOES look amazing!", "jo_mi_co": "you don't know me, but i think you are the very best and am extremely proud of you!", "tammylicious": "Thank you for this!!!!!!", "cindybmetcalf": "Wow girl wow!!", "maggiemason": "❤️", "jacquelinecioffa": "💕 ✌🏻", "imaginarygrace8": "Thank YOU for being YOU and being real and giving us all hope on our< 7.0 days, even as a 4.2 you rock!!!❤️p.s. how about some more groovy dance moves?", "frecklesandgingerdresses": "@megan_bambi_hickey @itslizfleming @emexplosion this lady is responsible for one of my favourite podcasts about being a girl boss whilst dealing with mental illness so honest and funny too 😘", "toribruyere": "@ciara_hebert follow her💖", "sawyerbaird": "This hit me deep. 🖤 thank you for sharing!", "kcumming2": "You look great 👍🏻", "monicashulman": "What a journey. Thank you for sharing and for being you", "smooches626": "@jengotch AND, look how long your hair is too..!😍😂 (get it?)", "h____f____": "Happy for you!", "thelaurawolf": "Thank you. This post resonates with me in so many ways. Excited to listen. 🖤", "dorotheory": "My one and only question is HOW? How do people with anxiety and self doubt can be a founders and CCO of such a great company as bando at the same time? Seriously. Im struggling with self doubt and lack of belief in myslef and I have problems with putting a photo on instagram because of possible judgement! Amazing how world and people are varied and it all works differently for each one of us!", "loumime": "❤️", "siftseparate": "🙏🏻🙌🏻❤️🎉", "little_emmab": "✨Well done that gal! Thank you for sharing your journey. Off to listen now✨", "emilygsamuel": "Love all your posts! Huge inspiration for me❤️", "kristinakellyho": "💪🏼💕🌈", "_heyllama_": "Great episode! ❤️", "aliweissjewelry": "You’re amazing, ty for sharing", "jennrizzo": "❤️", "britnim_": "🙌🏻❤️", "hereforalexis": "Love this. Also, you have an insanely cute belly button ♥️", "jennybgood": "GURL those ankles!!!!!!", "ashley_killen": "get that shit girl 🔥💋", "robdoglouise": "❤️❤️❤️❤️❤️❤️", "cove.wear": "You look amazing!!", "clouds.and.vines": "You looked and still look amazing!🤗", "bonazoulay": "@ruezal", "adri_p": "♥️♥️♥️", "constancezimmer\nVerified": "Verified", "ginghamgirlgreetings": "Happy to see you happy. ✨", "bestillchildd": "💕I love what @shopbando represents. Everyday I use my mug or my “no bad days” water bottle and listen to your podcast, I feel a sense of empowerment. You created that for me and many others @jengotch! Thank you for constantly inspiring me to keep going and not giving up. Depression/anxiety/pure ocd is just a diagnosis but I am so much more than that. Thank you for helping me realize it!! Your a total power B 💕🌈🦄", "amyolsonjewelry": "You make my day every day Jen Gotch! 😍", "insta_s_a_f_e": "👏👏👏👌🙌🙏❣️✌️😘", "makeupbyrebeccajillian": "Woowwww look at you!", "jdweatherby": "🔥", "elliemaymo": "Congratulations to you!! Your inner beauty is shining through! Thank you so much for sharing! I needed this today!! 💕", "rose_luxey": "@sillumee à chaque fois ses podcasts me font un peu penser à toi, ptete ça peut t'apporter du soutien aussi ? 😘 en tout cas moi ça m'en apporte 💗💗💗", "darcelmolina_128": "I have e been there to,day by day&family &good friends,u come out of the darkness&into knowing who u are again.what u said is inspiring,thank you❤️", "brittany.rh": "you’re killin it!!", "4oclockapple": "You look happy and healthier and I know your dancing makes me feel better;)✨", "korrielukei": "Love this!!! 💗💗💗", "cydspix": "Your posts inspire me to take better care of myself!!! Thank you so much for sharing you!", "stoneallanstone": "From the outside you look pretty dam good 🙆🏽‍♂️🇬🇧", "ms.faday": "You are an amazing lady! Thank you for being so honest about your journey. 💗", "mirbrown75": "Gratitude is the attitude!! 👊🏼✨", "designed2think": "Not even wearing yellow and all I can see is power 💥.", "christinemfoote": "So strong! Thank you for sharing 😘", "cyn_pies": "What’s the pod called?", "lookbackwithwonder": "Is this supposed to be a before and after? I’m confused, lol. You look great in both photos!", "missjennimac": "What specific products do you use from @thelordjones and what do they help with add ? Thank you 😘💗💕❤️", "valiantdaughtercollective": "💛💛💛", "kgross": "💖", "_katierock": "@monicarheingold she posts some real stuff. you may like :)", "ivapawling": "😘🔥", "lizwearswhat": "Jen! I love all that you share and I completely agree that focusing on mental health can improve physical health! I wish you’d share that but NOT by showing that you’ve gotten thinner/smaller/etc. for some of us, weight gain is a sign of physical health! Being happy with our bodies as they are, big or small, is a sign of health! ✨ I appreciate you and love all that you do! KEEP SHARING!", "shanirene": "Wow Jen you look amazing", "meganxxrea": "You're forever one of my biggest inspirations Jen!! ♥️ Also look at that subtle #handmodel in the second pic 🙌", "debinwonderland": "❤️💗❤️💗❤️💗", "bethbourbeau": "❤️❤️❤️", "hoe_for_fdr": "you look amazing!", "leilamabyn": "Your openness and honesty is one of the things that inspired me to go back to therapy. Thank you for that 💗", "koosna": "You look the same on both. Both beautiful. ❤️", "amyazzarito": "You are so brave! And you look fabulous! 💫💫💫", "artbycac": "❤️ 😊❤️", "gina.sabatella.foto": "@jengotch Authenticity, courage and getting in good health!!! Thank you for your share, your Truth!!! 🙌🏼❤️🙌🏼❤️🙌🏼✨✨✨", "houseofgabriella": "You are such an inspiration! ♥️🙏🏽", "ellysebacig": "❤️❤️❤️❤️❤️❤️", "morganslate": "I literally thought I was reading something coming out of my own head!! Thank you so much for posting! Going to listen to podcast now ❤️❤️❤️", "danameyerson": "such an inspiration!! cc @monique.gilbert", "bevmama": "@rachel__writes", "thefernygirl": "You're my favorite! 💖 #rockstar", "iamkatherinerose": "Thank you for having the courage to share your struggles with us. 💕", "janae_diane": "Aww! You have tummy freckles too!!! 💕🙌🏻 You are gorgeous darling!!!", "klafferman": "What an inspiring woman you are. 😘", "harpergraham_photography": "You are just the best!! Your page is hands down my most favorite and the one I relate to the most. You’re story and strength has definitely impacted me-thank you will never be enough!! ❤️", "andreitaandreita": "❤️❤️❤️❤️❤️❤️", "barbiekamiel": "Love you @jengotch", "fiendheu": "❤️👏🏼❤️from Belgium❗️😘", "shanink": "I sooooo need this right now. Thank you for sharing your story!", "lizzard.of.oz": "You’re so strong!!!!!💕💕💕", "jalstern": "Thank you for posting this, you pretty much just summed up my struggles and the work that I’ve done to get better ❤️💪🏼😊", "ebekay": "I love you Face! Forever and eva!❤️❤️❤️❤️", "melissaraath": "You're just the fucking best. I've been inspired by you creatively for YEARS, and the last 2 years I've been inspired by your strength and vulnerability. Your Instagram stories and now podcast give me life. You Jen Gotch are just fabulous and I appreciate everything you share with the world (and me) x", "byjessicarey": "We appreciate you!! Thank you for being an authentic inspiration for so many women and girls. You’re a light! 💕", "bananarabbitshop": "Go girl 😘", "sweet.life.with.three": "It’s awesome to see you find your rhythm and place of freedom from a difficult time!", "chlo.nels": "Love your podcast! Thank you for your vulnerability 👏", "nennypennyo": "You look (and are) AMAZING! 🙌🏻", "annietaylordesign": "Adore you and your honesty @jengotch 💙💙", "optimisticcayla": "❤️❤️❤️", "joyajewelrygirl": "Love this!! ❤️❤️", "lzpencils": "So many ❤️❤️❤️❤️❤️", "heidirussell_3": "You are my favorite!! You have helped me so much 🌸🌸", "ameliacatherineandco": "Will definitely be giving this a listen! Thank you for sharing!", "goldalamode": "❤️❤️❤️❤️❤️", "soymargott": "😍I love you so much and I admire you! I wanna be like you when I grow older!", "milly7474": "It _is_ gloriously long hair.... 🤗", "idreamofkelly": "dang girl! so proud of you!", "annette.renee.garcia": "I’m struggling big time. How do I find this podcast?", "meforwedesign": "Healing & creativity all require time, but the time required goes beyond time & space. You are igniting healing, wisdom, encouragement for all of us. Keep onward beautiful warrior & yes we can do hard things! (Not that we like or want to but darn it, it’s powerfully awesome to look back & see how far we’ve come!) ⚡️⚡️⚡️", "thelittlest": "So much love for both of the women in this photo!!", "boisky3": "You inspire me.", "vintageliferedhead": "Thank you for sharing your truth. As business owners, especially as women business owners, I think we at times feel an immense pressure to appear perfect. Sometimes life can take over and things get incredibly off balance. None of it is easy to bounce back from, and the easy medication of food and alcohol is so convenient! I have been struggling a bit myself the past year on a comeback after allowing my own self care to slide dramatically after my husband was diagnosed with cancer last year. It’s amazing how quick it can catch up with you! You look amazing btw!", "ayo_tayo": "Yes 👏🏻 Jen 👏🏻 yes 🔥💖", "claudfortin": "You are a true hero and inspiration 🍉", "ewacegiwags": "🙌", "bizminelli": "I’d love Kavanaugh calendar of things to do every week!", "zrinkush": "👏👏💪💪", "piplove": "💕💕💕", "sidneycargill": "You are an I N S P I R A T I O N!!! Thank you 💗🙏", "lovelyoysterhands": "I’m not crying, you’re crying♥️ I’m in the middle of a day projectile crying and this felt so good to read. Thanks for being so vulnerable. It’s helping us all heal together. 💪🏼✨", "annesvendsentune": "This girl is on fire 🔥🧡", "estherplaster": "So I think you are the cutest thing ever and I absolutely love that you have come out on the other side of your journey in a place of health and wholeness. Always a work in progress. And knowing is half the battle. Go Jen! 👊🏼👊🏼👊🏼", "rebeccagayheartdane\nVerified": "Verified", "charlenelizette": "Thank you for sharing your story, your vulnerability. You have passed on your strength to more women then you know 💕", "maisonrogue": "🙌🏼🙌🏼🙌🏼", "littleanfierce": "💙💙💙💙", "giselaandzoe": "I love you Jen! God bless you and your vulnerability. It truly blesses me & I know many others ❤️", "porzia6561": "You are an inspiration. Thank you . I’m going to hell and back right now , and I’m looking at you and thinking ok . I will survive", "justkaledit": "@jengotch you are an amazing individual- I’m constantly inspired by you! Thank you for always being willing to be real and share your journey. 💜", "lyf_app": "Congratulations for “coming through”. Your hard work paid off!", "tranquilitybyhehe": "Love you jgotch!", "ohanniebeth": "I love you Jen. Also, projectile crying is a sport in my Olympics so I FELL YOU 💪🏼❤️", "michelle.swanson_calhoun": "Dannnnnngggg!! 🔥🔥🔥", "samanthachieppa": "@jengotch is there another way to listen if you have a Google Pixel phone? My fiance is going through a lot and I'd like to listen to some of these especially the", "katehuentelman": "You are SO beautiful Jen!!", "jgubbz": "Glowing. Adore you @jengotch 💛", "shellyboo28": "Love this! Thank you for being so encouraging and such a huge motivation 💜 as I sit here self soothing with a snickers and ordering clothes in bigger sizes since nothing fits 😕", "paige_garrity": "Love this 👏🏼👏🏼 good for you! ❤️", "sirenfloralco": "yer beautiful lady 💪🏽", "ardenmyrin\nVerified": "Verified", "samantha_rei": "Radiant✨💕👏🏽", "jvla1975": "Keep up the great work @jengotch! What have you done to grow your hair? Love it by the way! I also love that you rate where you are at in life.", "elenacarvell": "💖😭 you are so great. I’m in the process of healing now, it helps to hear you acknowledge how much time and work goes into this. It really does. I feel like most people don’t really understand how slow progress can be sometimes. Always moving forward two steps and then back one. It’s definitely not a linear process.", "mainemomma72": "sexy lady with a twinkle in her eyes 💪🙌", "morganinquarantine": "Love you! I'm so proud of how far you've come!", "kitchenlit101": "This is so beautiful and inspiring!!", "elevenhouses": "Your smile in the after says it all!! So beautiful!!", "lisasabralotte": "Wow 🙌🏼💥✨😍‼️ Strong woman, role model 🙏🏼🙏🏼🙏🏼", "lovemaegan": "I’ve just recently come out of the two year divorce fog of constant work and healing and when sometimes I wondered if it would ever get better, one day just recently it all settled mentally and I was free. It’s continuous work and so worth it.", "sarahscheerios": "I just want to say thank you for your podcast, it has helped me immensely identify triggers and what I need to do to start getting better. I’m even going to start therapy! My first session is this Thursday! So just thank you for all that you do! Know that you are helping so many people!💕", "daisys_mercantile": "Can you please do a post about the Jen/Kelly long blonde hair thing? Clearly there is a mass competition going...", "dianeroka": "Have you thought about writing a book? I would read that book!!", "kellyharris": "You’re amazing ✨", "leanneleu": "Hi Jen, you are a real and genuine inspiration. We are all trying to figure it out but many of us do not have your bravery and courage to share the muck of it. I believe what you are doing by exposing your brutiful vulnerability will help people change their lives.💫", "mrs.jenn.ruiz": "❤ ty for your transparency 💯", "kimberlyjmuller": "🔥🔥🔥", "princess.kitty.meow": "I love you, and the work you do!!! ⭐️⭐️⭐️⭐️⭐️💎💎💎💎💎", "avestyles": "So great!!!", "ellegator7": "Going through a divorce this year and so much of what you’re saying resonates with me. Thank you for being so open and vulnerable about with your life. I’m glad it’s not just me ❤️", "mykonos7": "You look incredible !! 💕", "lenelbrown": "Wow you look great! Always have!!", "gibsontuttle\nVerified": "Verified", "ahoy.alex": "❤️❤️❤️", "nursekristiebennett": "This is everything🙌🏼 Thanks for being real and speaking the heart of so many of us💕 yesterday my struggle was overwhelming. Today not so much🔥", "allifbs": "🙌🏽😘✨✨✨ Shine on, Lady!!’ Shine on! ❤️💜💓", "deadeyelizzie1": "I needed to see this today.", "c.beau": "💕💕💕💕", "thelordjones\nVerified": "Verified", "bridgewitht": "🙌🏻🙌🏻🙌🏻🙌🏻", "grland.co": "you’re my number one inspiration, thank you!", "lorijo47": "@marandaz this woman tho! 💪🏽💪🏽💪🏽♥️", "pinkpeonies4eva": "Beauty ❤️😊", "jenn_gigi_": "💕🙌🏻", "redheadbrooklyn": "Jen you really do feel like every girl’s friend. I truly think you’re the coolest. ❤️", "jlat23": "💜💜💜💜", "ashbkemp": "How did you get your hair to grow so quickly?! What do you use?", "sedivecm": "I’m currently in that place. Divorced, single mom, stressful job, depths of depression and anxiety. Meds are wonderful and so are you💕", "clarabella87": "@booby_garland is she not just the tits? #love #inspo #weechamp #hero", "afashionnerd\nVerified": "Verified", "meglundberg": "Thankyou to you @jengotch you are an inspiration ❤️ also, projectile crying! 😭😭 #relatable", "shellyhyde": "❤️❤️❤️", "hampdenclothing": "THANK YOU for sharing! So bold, vulnerable, & badass. Can’t wait to listen 💗💪🏻", "paigehaines_": "Get it girl! 💅🏼 thank you for being a strong woman and huge inspiration that we can all look up to 💕", "abigailalyssaa": "Inspired by your journey. Keep on keeping on. 🙏🏽✨🖤", "gunnerandlux": "So proud of you", "andiannstudio": "Buh-bye ca*#+kles hello ankles. We see you jen gotch!", "uglogrl_": "😍😍😍 inspired by you", "alisonraemusic": "@jengotch do you still drink even though you were self medicating with it before?", "soy__paulina": "❤️👏🏻", "honeywoodvintage": "💪🏼💘💪🏼💘💘💪🏼💪🏼💘💘💘💪🏼💪🏼💪🏼✨", "marierao": "Go Jen!! 🙌🏼", "thebodydepartment": "You are amazing! 🙌❤️", "nicholstrom": "💘", "sarahglitter": "BABE!! 🍒🙏🏻", "vanessabancheri": "Thank you. Needed this today. I am JG in the beginning stages of recovery right now, but this gives me so much hope for what’s to come. One day I’ll be the JGOK version 🌟🧠", "_breadnbuttr": "♥️", "sarablache": "I love your face. You health and happiness shines thru your eyes. Wow- that made me sound like a huge creep or your grandma. ¯\\_(ツ)_/¯", "littoralbeing": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "mrsjennamartin": "YES JEN YES 💖", "_oxford_comma_": "You are such an inspiration @jengotch! Thank you so much for sharing and being so vulnerable with us. I am in a much better place with my anxiety and am on low dosages of medications to help. I’ve noticed that the meds have caused weight gain though and that brings out some anxiety! Have you dealt with that type of side effect or do you have any suggestions? Is it possible to lose weight even while on these meds?", "devincustalow": "you look amazing and glowing! 🖤", "basicallybusterspage": "Just downloaded to listen on my drive tomorrow. Thanks for sharing!", "margaridapitaes": "👏🏻", "whitgirl22": "♥️♥️♥️", "_julie_k_": "❤️👍👌💛🙌", "brontenj": "Omg JG YOUR HAIR 😍😍😍 so longggggg 😍😍😍", "prettycrabby": "I have made a lot of changes this year and it’s been great to read your changes while I am going through my own. I am down 25lbs now and also shedding a lot of the emotional bullshit. Here’s to get healthier and more emotionally even. That is all I hope for for myself and the people I care about too. Thank you for everything you share. #resillience ⭐️👯‍♂️💕🙌🏻👏🏼👏🏼👏🏼", "bulletproof": "We couldn’t love you more, Jen! 🧡 You’re amazing.", "kellyoxford\nVerified": "Verified", "bestyouaplus": "💖💖💖💖💖💖💖🙏 inspirational", "jackiewolven": "❤️🧡💛💚💙💜", "jana_fabulous": "Lovely ❤️", "littlesparrow5": "I see you, Miss Hand Model. 👌🏼", "sofi_saidso": "Amazing. And so inspirational on so many levels both small and big but so equally important. Thanks Jen you’re amazing! ⭐️", "busyphilipps\nVerified": "Verified", "kimmie.smalls": "👏🏽", "alexiskersey": "@jengotch i needed this today. More than ever. Will definitely listen. Today is a 3.3 for me", "ablondes_collectedsurroundings": "Thank you for being real! Love reading your posts, even when they are sad/ very relatable... hugs", "tubbytodd": "So beautiful!", "jenradway": "👏👏👏", "sweetjaynebroadway": "Beautiful inside & out 🙌🏻🙌🏻", "nancnanc1": "💗💗💗💗", "vadaashley": "Jen Gotch is HOTTT", "badgaljj": "👊🏼👊🏼👊🏼", "urbanwaxx": "You are so inspiring! Keep kicking butt! 🍑❤️", "bloodymeri": "♥️", "meganpysell": "@jengotch I feel like I’m going through this so hard right now. I’ve done a ton of work on myself that I’m proud of but nowhere near where I want to be yet. I would say I’m at a 3.5/4 today. Trying to stay strong and fight through it like I always have but today it just hurts. Thank you for sharing this. Can’t wait for my after picture. ❤️", "scandinaviaflick": "@jennystrobaugh", "amieejosephine": "💖💖💖", "swannamac": "Thanks so much for this!!! Incredible journey. Curious—- how do you treat your ADD today? Medication? 💓", "jacksfoodla": "Unbearably Hot", "zeynepbeyli": "@tulesy", "mamaa_birrd": "You have been such an inspiration to me. Your realness is encouraging and comforting in reminding me (and others) that “I’m not alone”. Thank you for your honesty and vulnerability. Thank you so so much for being you. 💗💗💗", "marianetcamo": "💪 un diva! @choelita", "_luciyogi_": "♥️❤️", "be_biotin": "Brains, beauty, honesty, balance AND long hair??!! Get it girl 👌", "candidlyemily": "Killing it per ushe 💁🏻‍♀️", "biblesandcoffee": "Champ!!! 🙌🏻", "cc_jillian": "This is so great ❤ gonna give it a listen this week ✌️", "pinkparterre": "Omg 🔥", "lyndsayjs": "💪💪💪💪💪💪", "elisabethcasaponsa": "👍🏻💯You’re awesome 🌸keep fighting 🌟you are an inspiration for other women", "camscarr": "Please hire me and be my future boss!!!!", "laurenmarttilaphotography": "❤️❤️❤️", "kikismustards": "WTG girl! You’re solid gold baby! 😁", "cocodanger": "You’re an inspiration!!!!💛⚡️✨💫", "gabixgutz": "🧡🧡🧡🧡", "joleetx": "👏🏻💕 Thank you for also talking about care being multi faceted - it’s not just outside or inside", "sammimarie14": "Needed. Thanks, Jen", "lumedrano": "👏👏👏👏", "anndanger": "so amazing, jen. ❤️ look at that hair!!", "nobodygrl": "💕💕", "alissacouchman": "Beauty Queen inside and out! 🙌🏼💗", "nicoleferox": "Aw look at you w that happy face", "organizedhippie": "You have helped me so much. thank you", "courageandcuriosity": "Thank you that is all 🙌", "meganmpearson": "🖤🖤🖤", "jamesburial": "You didn’t tag me.", "mirandatanner": "7.8 hot damn🎉", "justlindsaydawn": "I love this, and you and your vulnerability. I have some intense low days and reading this is a reminder I’m not alone 💓💓", "bexxjamo": "🤗❤️", "hannahwingatedesigns": "Your JG After show song is in my head on the DAILY! Like, I find myself singing it a lot!😂", "darlingkelsey": "I’m sorry. Are those ANKLES you’re showing us?! I feel like my emotional states tends to puddle there - ankle days are decent. Cankle days are rough.", "itsmeimyourdad": "You rock, Jen! Thank you for sharing your journey ✌️❤️", "iamsteph_xx": "❤️🌺", "rosysheeps": "Thank you so much 💕", "ohjoy\nVerified": "Verified", "agingmeg": "🙌🏼💕💕", "inyourbones": "✨", "aabbiiggaaiilll": "thank you for sharing 💛", "ajay.kumartank.1": "Sexyy luk", "nayiimc": "❤️", "lowey20": "Girl! You are killing it!!! 🙌🏻 Thank you for everything you do!! ❤", "gothth0tty": "You’re such an inspiration, 😭😇💖", "nicthorne": "Thank you!"}