{"kindness_u": "@heyitsblondie18 I want the anxiety one", "brickxbrick_home": "@shopbando will you be selling these?", "samanthagerardwoods": "I just sent you a DM , if you open it I won’t feel like a loser @jengotch 🌈 + whoever runs @shopbando social tell her to look because I ordered so many shirts and she needs to know how rad they are/she is", "sideshow_ali": "👋", "matzdo_mom": "Sent as private dm’s to friends for gift ideas", "kaitlynmcquin": "👋🏻 wearing my necklace now and so grateful to have found your account", "lisaframe": "@cdabs", "d_o_r_k_hearse": "@k.fg15", "angmatange": "@sesshomarusama33 I want these SO damn bad!! ♥", "andreiafscoelho": "👋🏼", "dr.sidoniefreeman": "👋🏼👏🙌🌟🌏🧠🙏🏼", "smlindemann": "👋🏼", "jennifer_adams7": "I wear my depression necklace every day. Proudly sharing my story! 👋🏻💕", "meggie_moo_86": "I have been and continue to struggle with depression and anxiety. It comes and goes, mostly it’s been postpartum but it’s worse now after losing both of my parents this past year and a half. I’m open about it to people in person but not as open on social media", "raquel_val": "❤️", "___mary_v____": "I hope your book comes with a video compilation of all your dances 💛", "catherine.drysdale": "Thank you so much for your bravery and your wisdom. I’ve been sharing my journey on my own page, and just launched @liveauthenticallynow yesterday with a blog coming soon 👋🏻💕✨", "jesselouisewhale": "👋🙏🏼❤", "elenaemcmurry": "👋🏽😘", "deluxemodern": "@stylebymalia", "tiffaniraestyles": "Thank you for all that you are doing. I’m great part offering me courage 👋🏻", "brandygirl79": "@cyn_pies thanks for sharing this IG with me! 🙌🏻👋", "tigerseyevintage": "👋🏻love you JG!", "ninamarienash": "💛💛💛", "missblairnoel": "👋🏼 thank you for using this platform in such a profound way. You are an inspiration. ⚡", "ladyyum": "A couple of my employees out together a Suicide Awareness fundraiser for the month of February and shared their stories on our social media and also encouraged other to share as well. The raised over $5k for the ASFP as well. So proud.", "unapologeticallygrownup": "Thanks for your work❤️💗", "busybeingbizzie": "Absolutely love you...as a survivor of suicide I thank you from the bottom of my heart for all you do and the awareness you bring!", "cmaisonblanche": "Crazy that I went to my very first therapy session yesterday. Working through a lot and just at the start but have to thank you for all that you do here ❤️", "iam.amandanicole": "👋", "drcassidy": "Getting to hear directly from people you’ve impacted last night was incredible, I hope you know just how impactful your voice is Jen 💛", "sewell_megan02": "You’re awesome :) side note to all: if you think taking you’re dog’s anxiety medication is ok...don’t do it. 🐶😳", "mrsbeausaunders": "Where can I get one of these necklaces?", "marissamorales": "👋", "momsabouttosnap": "👋💪🏻😭😂 #allthefeelings #andthatsok", "curlyqchristy": "@melbizzle13 do you follow this account? I think they also have a bipolar necklace. I think it’s cool 😎 to be brave and share your story. ❤️", "c_hotz": "👏🏻", "amna.alyousif": "👋🏻 ❤️ thank you! i turn to your creations almost daily for inspiration to keep myself well and keep going.", "doddleandcompany": "You rock @jengotch ❤️", "shutterbabe22": "Do you think one day you might make these into bracelets or rings for those of us who are still too shy to bling out with necklaces?", "ritacatita.jpeg": "👋🏻 And thank you for paving the way for us 💕", "trixie_mcbimbo": "I need these necklaces 😘", "jeanettehargreaves": "👋my whole profile is about how I used to lose my temper, but I got help and now I help others. 💖", "oliviavillanti": "💕", "maker_morgan": "I wear mine every day! 🌈 it reminds me that anxiety is just a small part of my bigger whole! 😘😘😘", "bethsmash": "👋🏼", "theamericae": "Yes, mam! ❤️", "lolahoad_": "👋👋 you’re a star Jen 💞", "emmasara": "👋👋👋👋 it's been a real name it to claim it moment for me. I've never been hugely open about it. A load off my shoulders. And I feel like it's got less power over me now? I've also gotten so much love and support which has been amazing.", "courageandcuriosity": "👋", "iamkatherinerose": "Heck yes! Thank you for spotlighting this @jengotch 😚", "hollykooi": "👋🏻", "days_of_marz": "👋🏻", "feedthatbaby": "👏I picked the best day for a royal meltdown 🙄", "butterknobs": "@nagwag this lady 👍👍👍👍😍", "lucy_siddall": "👋🏻👋🏻 about to xx", "fleurishing": "I shared a bit of mine in stories in honor of the day but intend to share more soon...thank you for opening up this conversation here Jen, it’s because of you that this feels like a safe space to share. 💛", "lulucreber": "👋 ☺️ sharing is caring and it helps to know that you are not alone in the mental health struggle", "avljoanna": "👋", "marimelilot": "🙌🏻", "zoesteiner": "👋👋👋 LOVE the messages you constantly put out there, it really makes a difference in destigmatising these experiences and creating a sense of community and solidaritt 💜💜 I'd love for you to check out my latest post talking about my take on it all! 💕✨", "mrslouisajones": "👋 you’re the best. Just the best x", "kaciemcmackin": "Wearing my necklace today. 💗", "thekindnesscoop": "Can you make an OCD one next? 💪🏻👏🏻☺️", "donsitsquew": "👋🏻 shared my story a few months back and it has led to SO many open and real conversations. 💥", "marielosborn": "💗👋🏼 you're a real inspiration @jengotch", "kaceyhalbert": "love u jen. be proud of yourself.", "brytny.hunny": "Aw I need the anxiety necklace, I was born with anxiety...well that’s what my mama says. I’ve had the panic attacks, earth shattering anxiety for as long as I can remember .. it sucks but this is life. I just pray my two little boys don’t have it when they get older. I don’t think I’d be able to forgive myself for passing that down to them :(", "theredc27": "👋🏻 and thank YOU for helping to crack open this door", "alimakesthings": "🙋🏽‍♀️ thank you for sharing your experience! it makes a difference.", "erincampbelldunkerley": "🙌🏻❤️and...👋🏻", "bexxjamo": "I bought an anxiety necklace yesterday, I can’t wait to wear it ❤️🇬🇧", "elizhoyt": "@katied926 I want these", "fit_factionista": "👋🏼", "elorensen": "👋🏻 and I will keep sharing!!!", "kotlarski": "Thank you for making it easier for me to be more open with others regarding my journey.", "mytfinecaroline": "👋🏻🧡", "prettypennyclothing": "✔️✔️", "mishmash.94": "have had depression anxiety panic attacks and PTSD since being raped at 14. tried everything. every med. every breathing technique. sometimes things work. sometimes it just all falls apart in such epic proportions. have been told it's all in my head and I can control it and I'm not helping myself... untrue. been told I am an embarrassment & wished away. which lead to me trying to end my life ( a few times for different reasons ) anyway so it's not all dim and gloom, I have moments of what feels like bliss compared to my 'normal' and I really look forward to those precious times of nothingness. no worry, no panic, etc everyone is different. its ok. I've just finally come to accept this is who I am and it might get better or might become worse but I am aware and know how to reach out if I need to - for most of my life it was taboo to admit or talk about mental illness. so happy that has changed- you are a warrior & I respect the crap out of you for all you share 💞", "messy_jojo": "👋🏻♥️", "jennifer_s_hudson": "Amazing!", "sixtee_isthenew_fortee": "Thank you so much , Jen. I follow you and am so happy I do. Having an anxious time at the moment because I’m a worrier about my children. I have calm.com to help me. 😍", "maryalessandraa": "You inspired me to share my story Jen! Thank you for being brave for all of us 💙 I wear my bipolar necklace proudly 💙", "my.name.is.literally.love": "@jengotch I’ve lived with an anxiety disorder my entire life. I don’t actually remember a time without anxiety. Thank you for the necklace. It gives me a chance to remind people that I am everything I am, including a person with an anxiety disorder, unashamed, and not despite it but just as a part of me. I wear it every day. Wearing it has left it tarnished and I was wondering if you had any tips on how to get it back to its original, silver shine? Oh, and from one girl boss to another...thank you for being such an honest and authentic role model. 💋", "pet_dress_": "💕", "whitneybe": "👋🏼👊🏼❤️❤️", "creativelylori": "❤️ There is no need to hide. It’s a struggle. Everyone has struggles. It doesn’t make us less of a person. It’s just part of us and a part that we work with everyday. We shouldn’t be ashamed.", "mistertopher": "Youz a badass.", "cs.ayres": "👋🏼", "kymskeletor": "👋🏻", "ana_gold": "👋🏼💕💕", "ferfer_james": "I haven't shared but I love reading your stories! Thank you for being so open and honest! One day I hope to be able to do the same but mostly I feel like no one cares. Thank you for all you do to raise awareness 💜", "itsabunderfullife": "👋 I’ve shared in ways I didn’t think I could get through. In front of people I thought may look at me differently. I shared because even though I have some fears about doing so and I shared anyway because I can be strong, because my experience is real, and because there are so many more who can’t. Thank you for doing the same and impacting so many❤️ xo", "elenakunkel": "♥️♥️♥️♥️", "madevisiblepodcast": "👋🏻", "lindsay_hanks": "❤️ 👋🏼 ❤️", "medhamukerji": "Yes so true! It’s actually empowering to share the problems.", "rach_michellee": "👋🏼👋🏼👋🏼👋🏼👋🏼", "lydcatmill": "👋🏻👋🏻👋🏻 thank you @jengotch - the many many stories you’ve shared have inspired me & made me feel comfortable to share my own.", "allison_bischof": "@logan_sutherlandd top one please", "kelsieinthewild": "👋🏻", "rademacher": "I’ve got to order these", "nicleighba": "👋🏼 I must say incredibly wonderful it is that you have liked each and everyone of my posts regarding the necklaces. I have 3. Just the fact the you take the time to acknowledge the posts means the world. You lead but you also connect with your community and that I think is rare. In gratitude to you and your story and what you have created with these necklaces 🙏🏼💗", "daynarochelle_22": "👋🏼", "the.good.oils.co": "👋🏼👋🏼👋🏼👋🏼", "littleshopofoils": "👋✨💕", "mal_michaelis": "👋🏼👋🏼 you inspired me to share mine!! Thank you 💕", "em_abbene": "💚💚💚💚", "the_real_julie_mills": "💕sister necklaces⚡️ #SSDGM @the_katuski_mills", "lauren.mcalpin": "Thank you for all that you do the community! 👋", "hartysara": "✋", "josiemouneu": "👋🏼 and thank you.", "madamefaught": "Post-partum anxiety and depression almost consumed me. I’m glad I came out on the other side. Much love to all who struggle 💛", "rachelbertsch": "👋", "andrea.fairservice": "👋🏻 I tried.", "hannahgrubow": "👋🏻 thank you for allowing me to wear my feelings “on my sleeve” (or around my neck). It reminds me that anxiety is always a part of me, but it doesn’t control me.", "jenniferselvig": "Need.", "thatendswell": "👋", "frexican": "👋🏽💛", "poupa_m": "♥️♥️♥️♥️♥️", "hilary_haron": "@jengotch where can I get these??!! I neeeed them!!!", "h33bs": "@jaeyonce_", "chelsea_strouse": "👋🏽💖", "rainbowrage": "❤️", "thebestdaniellelevy": "😻👏🏼 thank you for giving me the courage to speak up and be more self-aware!!", "britnasty512": "@monicaisrad thought of you 💕😘❤️", "l_mn_o": "🙆‍♀️🎉💕", "barbaraminarro": "❤", "herandcoco": "Still a little hard to share mine but I just want to say thank you so much for sharing yours! ✨♥️✨", "thatclassygirll": "@elijah_chester", "kwicks24": "10/10 would buy this", "clairenakaki": "👋👋👋👋 tried my best to present my story in a eloquent but accessible way. Not super detailed but hopefully enough to reach one or two people who need it", "courtneythemusical": "👋🏼", "caitlin804": "@jess.hankins omg we need to get necklaces lol", "hkips15": "I bought myself and a friend the resilience necklace. They arrived in the mail today. Perfect timing 👋🏼", "elena_mepls": "😘😘", "agentleindifference": "👋", "ktwtookdispic": "👋👋👋 shared on my feed today and thought of you while doing it... thanks for being so REAL about mental health - and FUNNY while you're at it! Xoxo", "rarelyclever": "🙋‍♀️❤️", "serpentfire": "Shared mine! (Sort of always sharing it!)", "blytharita": "👏🏻👏🏻👏🏻👋🏼👋🏼👋🏼", "bravejujubrave": "👋Love you so much @jengotch thank you 🙏💕", "wumomma": "Thank you for all you are, all you do all you share and the space you give to all of us to be as we need to be. Xoxo", "chelseamclay": "👋🏻👋🏻👋🏻👋🏻👋🏻👋🏻👋🏻👋🏻 X’s infinity. I got the anxiety necklace. My post is a few weeks back. You know how much I love you and what you are doing 💕💕💕", "kelseyaelliott": "👋🏻", "elisabethleonard_": "💛💛💛💛", "the_girl_with_the_yellow_door": "@madigreen_05 Love these so much", "kate_kavanaugh": "👋 I shared a big one today. Let you inspire some vulnerability here on this platform!", "whatsanedj": "👋 I’ve shared my story but one of the many reasons I support ban.do is your mental awareness initiative. I’ve been wanting to email you to thank you for so long but kept pushing it off. Thank you so much @jengotch - I love your business, your planners and all things ban.do! You are doing it right💕", "a.degiuli": "I love these necklaces and the message; but I do think specifing women only is narrow minded. Obviously women are struggling to be heard in most aspects of life but in the fight for mental health awareness we should include all voices. I know many men who have depression and go untreated because they are pressured to \"man up.\" Every gender faces stigma when looking for help.", "fredasalvador\nVerified": "Verified", "bosstart": "👋 loved the podcast about meds!💊 It really helped my daughter get out of her head and realize other are on the same path. Thank you!", "heyhellolauren": "Me! I shared your emotional rating system today and always come back to it when I’m feeling alone. 👋🏾", "keighleamartin": "I’ve recently found your IG and love all the sharing you’ve done. Thank you!", "fawnrosenbohm": "I need that necklace. Where can I get it?", "forestbathingclub": "✌🏼yes @juliaplevin", "micaelahoo": "Love you so much. 👋🏻 I shared my story on my feed today.", "kerryfey": "👋🏽 I just shared a small thing after seeing this post.", "elr_pr": "💛💛💛💛", "topanga_vintage_market": "👋 🌊", "willavanilla14": "👋", "heytiffanyroe": "JG u da best girl. Thanks for spreading the good word. ✊", "itsamybui": "@rachamoo I think we need these!!", "brooklyntc": "👋🏽", "tandemmade": "👋😘", "leannlay09": "👋 ❤️ I do wish the chain was a little longer.", "kaitiewade": "👋🏻👋🏻👋🏻", "tkjcollins": "♥️♥️♥️♥️♥️♥️♥️ love the ending here😂 & 👋🏻 sorta kinda", "anxiety_piglet": "👋🏻", "1111enterprises": "🙌🙌🙌🙌", "madmadisonmarshall": "👋👋👋 I love you. K bye", "tamxk": "Thanks for being such a strong light who provides hope that we too like you can make it through the darkness! 👋🏻", "christielovewellness": "I must have been under a rock but I just found out about you on the Goldigger podcast and love your story. I was born in Brooklyn too! I was never diagnosed early on but I believe my Bipolar disorder started in childhood. I have GAD and OCD, the triple threat as I like to call it! I love these necklaces and hope to add them to my collection soon as beautiful conversation pieces. Thank you for all you do. 💕", "byclairepurnell": "👋🏼 👋🏼✨✨", "itshotinthistrailer": "I've found a new thing to blame mine on... the magnetic force. I'm convinced. #victim", "pyrite_design": "👋🏼 I shared some messages and also illustrated this image. ✨ I hope it’s ok I used this photo for reference! Thank you for using this space for such inspiring transparency. 💛", "traci.eschbach": "👋🏼 my anxiety necklace has sparked a lot of wonderful conversations about mental health. Thank you for giving us this platform!", "dearhousecollective": "👋🤒👽🦄Well shoot dang. My brain has been so depressed today. One of those days where the blood is filled with lead and it is incredibly difficult to move or GO to work. But, I did. I made it. (To the flower market/ run errands/ prep flowers) I'm saving creative work for tomorrow and hoping a good nights sleep will reboot me a bit. Thanks everyone for sharing! Your words are massively challenging my tired thinking brain- We are NOT alone. Nope. We're together!", "adrod26": "👋🏻👋🏻👋🏻👋🏻🙌🏻🙌🏻", "jana_fabulous": "👋 generalized anxiety perpetuated by OCD ❤️ I love the anxiety necklace! It’s fierce and fabulous 😊", "saaammie": "@nickiwalker you should follow her :)", "kaleidacuts": "👋🏻 you have been such an inspiration to me. Thank you for being so open always. 💚", "hannahkhall": "👋 thank you for using your platform and giving us strength to share our stories", "kittynich": "You’re the best and I’m so grateful for how open you’ve been about your struggles. THANK YOU! You inspired me to make a post last week when I was feeling really low and I was so heartened by all the thoughtful responses I received. Being vulnerable can be such a good thing and I feel like I’ve made a single person feel less alone I’ve done something worthwhile. Again, thank you for being so real and so wonderful. 💕💕💕💕", "borkyteman": "👋🏼", "laurelysse": "👋 In it together 💕", "rstclairklipstein": "@brittanybocan", "findingjesseshu": "👋🏻", "cortvonnegut": "👋🏻", "jaracat": "I’m grateful to you for speaking about it. I don’t feel as alone in it. I’m tired of feeling crazy. With no insurance, I self medicate. Did I miss where to get those necklaces?", "hagsville": "👋 you’ve definitely inspired me to be more open and I love using the emotional rating scale ❤️", "ellendoxey": "👋❤️", "jesblaroy": "👋", "swannamac": "💓", "jillithwin": "👋 thanks for all you do. If it weren’t for you I don’t know if I would have had the courage to get the help I need.", "melaniexyz": "👋🏻 💗 thank you for everything you do for the mental health community. your voice matters", "kerriromeo_": "👋🏻👋🏻👋🏻 (ps - you’re the most awesome!)", "amandeux360": "I’m so sad because I lost my anxiety necklace at work. It was my absolute favorite and I reached for it all the time. I still do and nothing’s there 😢", "trenninbcs": "👋🏻👋🏻", "kalibutterfly": "@jengotch I’m a business owner and I wear either my Anxiety or Resilience necklace to work everyday and I feel so empowered! Thank you so much 💗💗💗", "gabbymbeki": "👋🏾", "jenifertracy": "I love seeing these against the color yellow 💛💛💛", "roadtripsociety": "@missssayy... someone else sent me this post and said they thought I would like it. I see you liked it too. How similar we are, how eerie the way the universe works. ♥️♥️", "mirzydotes": "👋🏼👋🏼", "carla_grbac": "👋🏻 thank you Jen, for all that you share. It's been so important to me 😘", "brittanyjoyd": "👋🏻", "sarahbruning\nVerified": "Verified", "mental_health_melanie": "I found personal therapy so empowering that I stopped pursuing a career in entertainment and earned a Master’s degree in clinical psych! I am now a therapist in Los Angeles, and loving helping my clients by hearing, supporting, and empathizing with them. 👋🏼💛💆🏻‍♀️🧠💪🏼", "chiosantacruz": "@lizleondaniels", "sneakycatkara": "👋🏼 I shared mine for the first time today. So nerve wrecking yet liberating!", "amy_m_carter": "👋🏼 I shared today after therapy which caused another friend to share to her stories. I hope that caused another person to share. And then another. The more we see our friends normalizing this TOTALLY NORMAL THING, the more people will seek help and start to feel better. Thanks for being you, Jen.", "mrsturrill": "@brandy72279 ❤️❤️👊🏼", "adventuresoflyss": "👋", "lourdzilla": "👋🏽 👋🏽 👋🏽 💕", "merithegreatandwonderful": "@rubyvelezzz I want both for my birthday! Because I am both but I am kicking ass and taking names after our year of exile. It was the hardest year of my life bc I had to face me and to do that I had to push you out of the nest. I am glad you’re coming home to a whole different mumma. Anxiety and depression are still part of my tapestry and always will be but I now know how to walk with them fearlessly. And you can get a fish so long as you name it Jeremy.", "allisonmcd": "👋🏼 submitted & posted on bando.com 💗🖤💗", "notskinnybutnotfat": "This is a beyond lovely idea", "hfr3sh": "@shelbslauryn 💕", "meganklaassen": "👋🏼👋🏼", "sarazork": "👋🏼👋🏼👋🏼", "dr.christina_": "👋 And you are Amazing!", "cupofjones": "@evieivyovercoat 💙", "bhaberl": "Hello! You helped give me the confidence to share my mental health message on my stories today. I share so many similar experiences with you, it’s so refreshing to know we’re not alone and it’s okay to talk about it. Love the podcast too! 🖤", "irwinsc": "@lelandgal Be. Do.", "jessnsinger": "👋🏻", "stemsandstars": "👋🏻", "thewildandflower": "💕💕💕", "afashionnerd\nVerified": "Verified", "kaitlyn.luckow": "Thank you for everything you do 👋🏻👋🏻👋🏻", "erikakat1985": "I want one but they are never in stock!!!!", "ameliacatherineandco": "👋🏻", "aliciadaman": "👋🏼", "devsdevelopment": "🙌🏽✊🏽", "kimbachic": "👋🏼", "eanewby18": "Thanks to all who share it helps me and others be more aware and hopefully help the ones we love!"}