{"ali_hynek": "@jengotch wow. Thank you for putting into words what I feel in this exact moment ❤", "simone_anne": "Love love love this! Thanks for being brave and sharing on the internet!", "jasminesarian": "You inspire me so much. Your brand is one of the reasons why I pursued a career in design. Thanks so much for sharing and being so brave, it helps us all know we're not alone. Just pls know that YOU ROCK!!!! 🤘🏻💪🏻", "hayleyzimmer": "Jen it's me Hayley from snap. Miss you. Love to you.", "honeywoodvintage": "🙏🏻❤️🙏🏻", "andrea.fairservice": "You're never ever alone. Love that you're sharing this because I feel like in general we are made to feel, or just naturally feel, like we can't share this, like something's wrong with us, and if we open up it will paint us in some stupid unflattering light. Thank you for having a voice for so many. Myself included. Take care of yourself. I know I'm just a stranger on the internet but I do truly care. Xo", "holyhonduras": "We feel better when you share too... us who can relate, us who just want to hear from you. Your honesty is honorable. 🔸", "daydream.factory": "You are beautiful, you are brave, you are intelligent / you are a pretty little angel from heaven with great bangs. Hang in there bud. You will get through this one. You're helping me through mine. Thank you.", "laura_vanderhulst": "You are BEYOND beautiful for the truth you speak. Thank you. Sometimes the most wonderfully important feeling is knowing you're not alone.", "scribe50": "🙏🏻😘🙏🏻", "kdelriego": "So grateful to read these words, to know you've worked hard for a life you love and still struggle with meaninglessness. And thank you for being honest about how hard divorce can be, even when done \"well.\" Just thank you!!!! I've followed your journey for a long time and appreciate your vulnerability, always, even when it's not fun stuff to share. You're wonderful, I honor the fire light in your soul!", "mariahpcoz": "❤️❤️❤️❤️", "dropcapdesign": "@olivesimons I think this caption needs to be a poster in our apartment", "olivesimons": "@dropcapdesign can we all just be more upfront about how we feel?? about our pains and our fears and how every single one of us is a deeply uncool goober who's just desperately trying to cling to any normalcy or genuine comfort we can find. cmon y'all", "valerieallenjewelry": "@madelinehenrysorrill I 💖her so much", "madelinesorrill": "@valerieallenjewelry now following!", "girlyoucanofficial": "Wow, incredible to share that and describe it so spot on. Hard work is just that- it can be hard, it can get you down. But you get back up and keep going #GirlYouCanOfficial 🙌🏻", "bonjourmir": "@jasmin.der i love this woman 💕", "sarahwalshmakesthings": "Dude. you're the shit now and forever. 💕❤️ even at .25 your way cooler than most peeps at 100", "piplove": "❤❤❤❤❤❤❤❤❤", "ifiwatchedyourstoryihateyou": "ILYSM", "missteresat": "Thank you for sharing 💗💗💗", "miramiratheedit": "been there. thank you.", "pariskaren": "I really need to know what this Katy Perry technique is! Please share again, I missed it! Also, signing the pledge to not be a dick. ❤", "elizabethrolf": "Wowowow I love you", "designedandcollected": "Hells yes 🌈⚡️⚡️⚡️", "thaislcollins": "You're the best @jengotch.", "alissamathison": "Thank you for being real. You will get to that place in the sun. Love and support to you.", "typhoontessie": "Do you follow her @courtneyannjennings ? She has wonderful perspective on the ups and downs of life", "thebodybook\nVerified": "Verified", "theycallmenick": "👌🏾👌🏾✊🏼", "eatprayshoplove": "Sharing is the best cure! I've never been to therapist cause I have millions of free therapists around me to share my sadnesses and relax. I talk too much, tell everything about myself and that takes a lot of weight from me! I love how you share and yes you have pretty bangs 🌸 @jengotch", "dianazuluaga.co": "💯", "niciblueeyes": "Love from AUSTRALIA!!! 🌈💕❤️🌈", "thejunglefish": "Sending you pink skies and rooting for you, Ms. Jen 💗", "brittanirosepaper": "😘💕 you're not alone and I know you'll get past this stage before you know it. Hang in there girl!", "laniako": "love you mama so much", "theglitterinmytea": "Thank you.", "imkeverhoef": "I think I need more Katy Perry in my life. Thank you for being honest, means the world", "loveimbro": "Love you @jengotch ❤️ you are a rainbow 🌈 there may be rain but you shine bright ✨", "beth58610": "preach! you are a #judy and an inspiration. keep on keeping on xoxo", "ohheyitswhit": "Hiii! We don't know each other personally but met briefly at one of ban.do's first house parties. I just wanted to say that you are incredible, brave & an absolute bad ass. I know none of that *feels* remotely true but truth has the power to overcome our feelings. you are brave, braver than most. you're bravery to not just share but to truly let yourself go through these emotions is what is going to bring about healing for you. in those super dark -10 moments, know that your life has a significant purpose & that you are deeply & truly loved. rooting for you & sending all the pink skies & 💓", "lizzie.mae_": "💕", "yungchancla": "You so real and awesome JG. I'm DEF a fan", "kayla.ember": "THANK YOU @jengotch 👏💖🌈 for sharing your lows, for being brave, for being so honest. Thank you for showing love & encouragement in your darkest moments, when you have nothing left to give, even to yourself. Your creativity & joy are inspiring, as are the struggles you share. Much love & good vibes 💕💓💕", "kkmar": "So much 💗❤💗❤", "dlmplans": "💐💖", "ohmeedofficial": "I don't share it because I don't have your courage. You are a huge inspiration @jengotch", "catburrell": "I am right here too. You are fucking badass, and amazing and just - there are a lot of words. You've got this.", "theamyclarke": "I've so been there...praying for you!", "withthelocals": "❤", "teamsparkle": "@jengotch I thank you for sharing these posts, one of my friends committed suicide this week from being severely ill, depressed and horrific insomnia. It makes me unbearably sad that she must have felt no way out. It's honest posts like this that help people in trouble know they are not alone. We are all praying and pulling for you Jen, you are a bright lite in a very dark world ❤️", "soulwanderer": "The rawness of this gave me the chills 💓", "lindsaymaudeu": "This was exactly how I felt yesterday, thank you for sharing @jengotch ❤❤❤❤❤you are not alone ❤❤❤❤", "uju.obi": "😘😘😘😘😘", "tmelitaphotography": "💜💜💜💗", "jelesais": "Thank you 💖💖 hang in there!", "itsaprilmauger": "I feel you at a -1 here #nothingispermanent #onebreathatatime 😘💛☀️", "los.angelaaa": "you are a ⭐️.", "party__piglet": "always an inspiration with your brutal and fresh honesty. /// \"Inch by inch I conquered the inner terrain I was born with. Bit by bit I reclaimed the swamp in which I'd languished. I gave birth to my infinite being, but I had to wrench myself out of me with forceps.\" F Pessoa, the book of disquiet /// keep wrenching.", "kelly_kellys": "❤ thank you!", "allison_thesocialtype": "truth!", "kachelmacher": "Thank you, I needed that this week.", "lindseymadethat": "YOURE A HUGE INSPIRATION! Thank you for being so real! We all need that!", "iamgoinglala": "You're a star ⭐️", "kim_leggat": "Your self portrayal today is delicious misery. I wanna be like Cher and say \"snap out of it\". Thank-you for being clever and candid. This too shall pass....", "jenifa_oh_jeny": "Jen, this is Jen. I don't know you but your ig stories are typically delightful and you're my favorite. But these posts make me so sad for you. I understand that kind of deep depression that makes living nearly impossible and makes the whole world look gray. I know us all telling you how cool and special you are isn't going to be enough. We're all hoping you feel better soon. ❤️", "shaleen1030": "Love you. Yes, anyone who can't relate to this is a lying cunt.", "verywryly": "👏🏼", "egap_hannah": "💗💗💗💗", "everdje": "💕 wish I could help somehow. you make me laugh & feel inspired all the time", "anna.hintz": "Hang in there lady xx", "sitwatrizvi": "Feel better ❤", "lapebil": "bravo", "marnalunt": "Beautifully said. I wish I was so eloquent but I don't need to be when you say it. You make me feel not alone. You say the words in my head. I understand the pain enveloping you, I feel it too. We will feel again soon, numbness doesn't last forever. Much love to you. Xx", "the_untrained_eye": "💜🦄💜🦄💜🦄💜🦄💜🦄💜🦄💜🦄💜🦄💜🦄💜🦄💜🦄💜🦄", "inez_m_j": "You poor darling.. I wish you could see yourself how we see you. You are amazing, talented, unique and so funny. I wish you wouldn't feel hurt.. only laughter and love #jenfan 🙌🏼😘💕✨", "unamullin": "I feel it too. Thank you thank you for this honest & breathtaking post, I could hardly believe my eyes 👀! Big love to u, & yes as we know, \"this too shall pass\"!!♥️♥️♥️", "shellymiscavige_": "Jen, you are my favorite person on Instagram, #1 person I wish I was friends with in real life due to your hilarious brain, wit, and effervescence. I'm sorry it's a low time for you, I get it and am struggling a bit myself right now. Thank you for sharing this, know that thousands of us are pulling for you to feel better, rooting for at least a 5.0 day soon filled with many happy Mouth Mimosas™. 💙", "the_misspencil": "Thank you for being real. Xo.", "betsabean": "You are fucking amazing ❤", "mothoddities": "Thanks for this! You're an inspiration 💕 Rest up and then kick ass when you're better!", "kodeofkondukt": "You're the fucking best. Thank you ❤️", "caitsour": "I'm at a 2.0", "designfancyspot": "I've so been there! Thank you for sharing. It helps to know you're not alone in these feelings. I always tell myself \"Britney (Spears) made it through 2007, I can make it through this!\" I saw it on a mug and it makes me laugh and it totally helps!", "theheatheronthehill": "💗", "lookbackwithwonder": "Sending love 💓", "bee.k75": "@jengotch good on you for sharing the real shit not just the good shit! 🌟", "elisenonelsie": "I really appreciate the shit outta you @jengotch", "_analisa._": "I admire your strength and honesty. You are truly an inspiration. Stay strong and sending good vibes your way 💗", "sparrowfox": "I really admire your candor. 💖", "morgsborgs": "You're rad and you make me laugh. Laughter truly is the best medicine. Thanks for always being real and showing us that it's OK to not be a 10.0 all the time. 💕", "christinelshelly": "Thank you for being REAL! u da' best 👏🏼👍🏼😜", "lizziemdesign": "I don't do much commenting on Insta really but I want to now because I think you're amazing Jen. You're a breath of fresh air and a little diamond. You don't pretend to be perfect and you so easily could. I know exactly how you're feeling and that cloud will move on! But you know that. You've got this and you'll be 8.8 ing again. Roll on Summer I say. January sucks. 🌈❤👋🏼🐆", "neon.cactus": "Feeling similar 💗 thanks for making it less alone", "_candygram4mongo_": "Feeling this", "breannajackson": "Been there too, you are not alone. Sending so much love your way. Thank you ❤️❤️❤️❤️", "howwasdinner": "💕🤖🐆🌸", "hteliz": "I love you so much Jen , stay strong 💞", "alliwebb\nVerified": "Verified", "gabriellahess": "I mean.... IM NOT ALONE", "brynnbrynnbrynn": "✊🏻", "emilyjanelong_art": "💙", "kurisutein": "🤝", "zoemcintyreboukalik": "We're all here together, fighting then same good fight. Hang in there.", "miss_kristen": "I respect your honesty so much. I've been there, and it sucks more than words can say. Hope the sun shines for you again soon. Please at least take solace in knowing how much joy you bring to people.", "elizabeth_sutton06": "You are amazing! I've been there too..keep being you! I think time heals or at least it makes things more tolerable...Hang in there!❤️", "beautybyabbeyj": "Wow thank you for sharing this. I feel very similar. I can speak but I don't feel like it.... too weak almost. It's good to acknowledge pain and be present with it. To feel what you feel and not shove it away. We are brave and we will feel more than .25 very soon 💗", "caracrawford.co": "I just wanna give you a hug. That's what I'm doing. Online. In a creepy social media message to a stranger kind of way.", "nicolebutterfield": "Jen! THANK YOU for sharing this. This is raw and this is real. I am also a business owner (just starting out!) and have had a lot of hard things happen this past year and continue to happen now. It's hard to be the face of your company that promotes positivity, happiness and everything great when you feel like absolute garbage sometimes. What you wrote about everything hurting, that's real, I've felt that too. I've been there feeling like I am numb and paralyzed and everything around me is moving in a circular heavy motion and I can't do anything about it. Hours feel like minutes. Tears flow without any control. No matter how hard you try every thought that goes through your head is a bad one - but it's almost like that's what you want, that's the only thing that makes it better, like covering it up with positivity and happy bullshit doesn't solve the issue, the negative thoughts seem to be helping. I'm not a chronically depressed person, and I don't think you are either, life just really sucks sometimes and it's ok to admit that. But! I really do believe it will get better. You are an incredible person and one of my biggest role models. Even if you don't like you right now, know that I like you. We all like you. 💘", "daniiiande": "💝", "tanyalochridge": "Depression is real & needs to not be ignored. Over the years on my blog I have shared my battle with chronic depression & the mental illness my mom lived with her entire life. There is no shame in it & being open about it. Although it probably won't make you feel better somehow knowing you're not alone in your struggle might lighten the load a bit. 💕", "chelsea_ghiorso": "You don't know me but I just wanted to say that I think you are the bomb! Your so real, thank you for being so real.", "anditamaria": "You da real McCoy", "heathertulleee": "❤🌨🌤🌈☀️", "ace_ofgrace": "Having a dream is what keeps you alive. Overcoming the challenges makes life worth living. #marytylermoore #strongertogether", "aprettycoolgirl": "I feel you ❤", "abbywakerley": "💖", "lisamariebower": "Thank you for sharing and being so real. 👊🏻", "amberatthunder": "❤❤❤", "scraphobbyperm.ru": "❤❤❤❤❤❤❤❤❤❤❤❤", "lindseylovesyoutoo": "💕", "allisorrigby": "❤️❤️do your thing.", "bonbongeorgie": "You are so cool. Hang in there sister!", "marimarrrcita": "❤❤❤❤", "4oclockapple": "Thank you💔 life is hard but there are better times ahead ❤️", "hudsonmoore": "Incredible. Thank you always for your honesty", "thejennyjames": "Been there. You are so beautiful to share this.", "suzanne.sjs": "Hugs and love and more hugs. 💗", "_corr": "🙌🏼💛", "waxinmama75": "It's hard, so hard.. but sending you and all the women who need strength ( including myself) a huge hug !", "lindseyreyenga": "love and all the thank yous and good vibes to you ❤", "alexisrwilley": "❤️⚡️❤️⚡️💔⚡️", "judyleegg": "1,000 😘", "lizard_donato": "Thank you Jen ❤ I struggle with a lot of anxiety and your real ness of the day to day of living it helps me", "paulinathestrange": "You're amazing.", "lmdgomez": "Your openness about your mental health struggles have encouraged me to be open about mine. ❤️❤️", "anitayung": "I love you, you are my favorite. Thank you for being real real.", "saraolsher": "❤️❤️❤️", "cx.n23": "Thanks you, and pls take care of you.", "sawatkins22": "You are soooooo brave, and I respect you so much for that.", "wesleyvance": "💞", "daniellesouthcreative": "Sending you love, Jen 💕 This 0.25 shall pass!", "tatertatski": "Most of us can relate but only a few can be brave enough to share it with the world! Much love and respect to you! ❤", "lilad": "For reals yo. Life is the hardest thing I've ever done.", "abra.v": "Sending you good vibes Jen, everyone is rooting for ya ❤", "itsliz___": "💪🏼❤", "emmaloulovesyou": "It's okay to feel bad, it always passes, give it time 💮you're too cool to feel sad, look how many people care 😂😋🦄", "teruterubouzu": "❣❣❣", "gabywoody": "sincerity and rawness is so beautiful ~ sending light x", "michellebastyr": "💕💕💝", "lightofleni": "Being vulnerable makes you strong. You rock. Thank you for your honesty. Sending you lots of love and strength ❤️❤️❤️", "apinchofsally": "❤❤❤", "steelemyheart": "Thanks for being vulnerable @jengotch.....so many of us relate...and in The. Same. Exact. Boat! Right. This. Minute...", "adenaleigh": "In Canada today it's #BellLetsTalk day that's aimed at ending the stigma against mental health. Thank you for doing this pretty much everyday 💕", "elhachey": "❤️❤️", "belindaleegrant": "You're an actual angel 👼🏼 I hope you feel better soon, the way many people will because of your posts like this one 💖", "jengotch\nVerified": "Verified", "shawna_l_armstrong": "You just made my day better. Thank you.", "artcampla": "I don't love that you feel this way but I really, really, love that you are talking about it. You're not alone. Mad love @jengotch", "lindsaystephenson": "Sending ❤️❤️❤️❤️. #bellletstalk", "daisyxox": "💕💕💕", "ee2eunice": "This is truth. {{hug}} @jengotch", "bhaberl": "You are such an awesome lady! I appreciate everything you're putting out there, because I get in this pattern too, it's the real deal! We'll all get through it together. Know you have gals from all over supporting you no matter what!", "thelovelywallco": "Much love lady❤️. You are an inspiration to so many and you are incredible. The world needs more people like you.", "madmommaevents": "Time to start a ritual that makes you happy. Hot tea. A good magazine. A walk around the block. And then some snap chat. We are all in a funk here because we are living in a rental that doesn't feel like home and have been displaced peeps since June. We will have a home end of March, but aligning this difficult time with that of a Midwest winter was not the best idea for our mental health. Stomach flu, colds, pregnancy yucks, it all is kind of folding in. We haven't had sun here in weeks. Trump. But rituals help me. Stopping by the cafe to take home fresh hummus for a midnight snack later helps me. Playing angry birds pop ball on my phone helps me. Putting lotion on my dry ass body before bed helps me. Mirrors don't help me. So I don't look in one. Which is why my friends have to blend my makeup for me when they see me in public because I'm still using my summer foundation which is four shades too tan. You've got this.", "kellectedhome": "💗😘", "tacospastor": "@sararradin", "kimstagramberly": "life is SO hard sometimes. i love your hair though and i'm sorry it hurts.", "theparsonslodge": "You are the best @jengotch ❤", "goodbetterbecks": "Honesty empowers 💪🏼 thank you for this and for using your platform to share. Lots of love 💘", "heyimanna": "You matter you're wonderful. Sending strength.", "erinjeandolan": "You are wonderful! Keep sharing your thoughts with us and you'll be on the other side of it soon!", "domesticjunkie": "💗💗💗💗💗💗💗💗💗", "able_ground": "< bows down >", "meldubie": "As they say this too shale pass!❤️️", "melyssa_griffin": "You mean so much to all of us. Thank you for always sharing your core. ❤", "tiff_hargis": "This ❤ is truth...this is freedom. Thank you", "jimenab": "i feel the same Jen, hang in there, do fun stuff while the storm passes xo", "ju_n_k": "You are magic, baby. Pure magic. ❤️", "e.cast": "Thank you @jengotch for sharing, for being real", "barbarasueko": "I appreciate you and am so grateful you exist.", "leelina.martin": "Thanks for helping my mental health!! ❣️ This to shall pass 🌬☁️", "nosliweilak": "You are the realist person on here and I couldn't appreciate it more. I am so greatful to you and how you use the platform you have to be a real person, not just a \"best of\". Thank you.", "rachel_manns": "You are not alone. Hang in there and stay strong. You got this, lady! 👊🏻💪🏻🙌🏻", "foxandfinch": "Thank you for sharing. The Internet needs more honesty.", "litttlewolf": "You are a rockkstar. Thank you for being raw and honest. It honestly means so much. 💗 Feel better, you magical unicorn.", "ohhhkris": "You are such a beautiful voice in this world. A light in every way 💫❤", "jette.scherzer": "Your pure personality shines through in everything you do here and even tho I don't know you in real life I just want to let you know that I find you AHMAHHZING, girl!! Sending light and love your way 💘🦄", "rockpapersizzle": "Always press on!! 💜", "djangozamora": "For those of us who are quietly suffering, thank you for your voice! You're a Badass and you can fight this!", "miss_ya_ya_": "This is the truest thing I've read! Thanks for sharing! You're not alone❤️", "littlejennyjewel": "❤ Have you seen the Neal Brennan special on Netflix? In between the jokes, he talks about mental health and it made me cry because he was so spot on. And then he went right back to making me laugh. Just like you. ❤", "naomi.liechty": "Thank you", "fiorness": "Love this beautiful boomerang & your beautiful soul! Thanks for sharing, sending my love 💕 and good vibes ✨", "arcoeerie": "So much love to you Jen. Your spirit and your honesty are so inspiring, and let us know we aren't alone. I hope Gertie decides to Face swap with you so many times, and you and the pink skies get to hangout again. 💕", "rachael_victoria": "@jengotch You are not alone...Your posts have helped me as I am going through a similar situation. We got this girl...We have to.😘💪🏻", "maddier323": "I love you you are my role model 😭😭😭", "lindsayschanie": "Everything annoys me, but these posts never do -just, ugh, SO important to share these things. Support you, gfran 💙", "vanessagumdrop": "I've battle depression and anxiety my whole life hopefully you have some 💊to assist in these bad times. Just know we care about you and asking for help is ok! Hugs.", "sarah.e.marley": "Thanks for being honest about you to us.", "laura.gwinn": "Thank you for being real and being open and lovely and funny and beautiful and honest and knowing it'll pass and knowing it'll happen again and for sharing. Sending you love and Katy Perry fist bumps.", "cachanchan": "Thank you for your honesty. I hope it makes you feel better. I know it's helping so many people. We 💜 you!", "halfmoonweirdo": "♥️💋 Sending LOVE to you, Jen 💕💛", "nikaygrace": "Thank so much for your honestly! Sending lots of love and good vibes your way!❤️", "gretchcma": "You are the best!💕💪🏼", "some.cass.snaps": "You're exactly what this world needs, Jen Gotch. 🦄💄🤓", "meghanalfano": "❤️❤️❤️", "lilrabbitkick": "💛", "brandylswope": "GOD I NEEDED THAT.", "theheydaystore": "💕💕💕🦄", "jenn_v_a_615": "@jengotch ❤❤❤👊🏼", "swtkrzyjane": "And that's why you're my favorite! Whatever filter this is... 👌🏼✨💕", "malissa_levesque": "Thank you so much for sharing, I needed this honesty today", "cancersucksprep": "Sending strength and comfort to you- I can really relate- you're not alone 💗💗💪🏻💪🏻", "choooch6": "✨💗✨💗✨💗", "mckline": "AMEN sister 🙌🏼", "elizabething": "Sending hugs and strength Jen!! You've got this!", "daminiroy": "You are amazing @jengotch - I almost feel like you're my spirit mama 💝 it's amazing how much strength you have to share how much it hurts right now and sucks balls big-time. You know this more than anyone else though - you're gonna get through it because you're you. Until the hot cocoa works its charm, sending you the biggest sunshine hug from the tropics ✨", "christiefriedman": "❤💙💚💛💜", "natyvdeleon": "Thank you for your honesty. Feeling like a .2 lately and it's nice to know I'm not the only one struggling. ❤", "ginamavila": "Thanks for sharing this. 💗💓💗", "noduhasif": "Sending 💜💜💜your way. You got this gurl.", "lottiefalkner": "I hear you! Strength & Love ❤️🌸", "andibake11": "Well you're one strong ass woman and I think that is a great quality. Not everyone can admit to things like you do on here (or most places for that matter) and I admire that about you. Things will get better.", "rankandfilestyle": "Following you because of this post 💔 feel you lady ✌✊", "trentmiichael": "thank you for your vulnerability and honesty. keep doin' what you need to do and just know that you sharing your feelings is immensely helpful for others in not feeling alone. we're all here for you because in a lot of ways, you're here for us too. thnx @jengotch 💕#pinkskiesahead", "kgathany": "💕", "kellydraws": "All the more reason to love you as a role model. Honesty and not parading only the good stuff around. You're my favorite. 💕", "rogivolomok": "Rock on and katyperry the shit out of it lol", "c0li0": "Oof you're a beautiful human Jen.", "hannahmorgan": "i love you and feel you and appreciate your existence on this planet veeeeery much", "rocker_refined": "@jengotch You have no idea how much I feel you on this. My company has never looked fancier or shmancier from the outside, but on the inside here it's mostly hell in a hand basket . I've considered walking away from my dream over and over again. You are right. Being honest about it and sharing does help. Sending you love and light and well wishes. I'd love to collaborate with you somehow. Please take a look at my designs. I think our brand vibes are very similar. 💋 Carla", "saramoon": "Take care of yourself, I hope someone close to you can bring you water and food, love to you, see you kicking ass in a few days, 💗💗💗💗❤", "emmarchoquette": "❤", "zenjenn_": "Yes!!!!!", "allegrab": "Perfectly put.", "courtesyplease": "Love you for your hilarity in all your posts and your honesty about real shit. I think your the bomb! Wishing I could hide under my covers for a couple days but my little sleep demanding toast. A girl can dream. Feel better Jen @jengotch", "thingsthataregood": "💙💙💙", "avaleriada": "💜💜💜💜", "meowria.anne": "❤❤❤", "glinllerstrauss": "Hell! yes I know what you are feeling about girl, deep through the bones.", "maureenprice": "Thank you, Jen.", "kittiesnkitties": "<3", "abbie_hutch": "I needed to see this. Thank you for sharing!", "estrellasforplin": "✨❤✨❤✨❤✨❤✨❤✨", "georgiafresh": "You are so lovely. Thank you for sharing this. 😚", "mybilliedesigns": "*Hugz* 💕", "flourshoppestudio": "You are such an inspiring positive force. Thank you for sharing your strength ♡", "fdcaton": "Always proud of your bravery", "vogueandcode": "I had you in mind when I did my first post of today 🙂", "denisecrew": "💔😘🙏🏻", "prettycrabby": "💕", "dearleia": "Sending you lots of love ❤️", "handzyshopstudio": "Jen! Your realness is appreciated everywhere. We are all rooting for you and WE want you to feel better too. So if sharing makes you feel better than, share girl!", "lisettevandegraaf": "Thanks for your openness and honesty! 👍🏻❤", "stanacepkova": "Sending love ❤", "cmdyer_": "Thank you! 🙌🏻", "erin_b_warke": "❤️❤️❤️❤️❤️ #powerful #letstalk", "alexandraeleven": "It's all about the yin and the yang.Darkness and light. Anyone who says they're happy all the time is full of bullshit and it's refreshing to read these sharp words.", "erios69": "Listening..sending hugs and strength. This too shall pass 💙", "suewell78": "Thank you for sharing this. Makes me feel better I'm not alone in feeling the same way lately.", "gwdub": "I have been there and really love your honesty! I tend to just isolate and find it brace of you to reach out in any way you can", "taylorpietrasik": "I love you!", "allyhendy": "I just really admire you and your online presence ❤ you're a really beautiful person", "smallandblonde": "I have been there for the last 2 weeks, feeling absolutely buried with no way out. So I ordered a new backpack and a matching planner to try to feel organized again and today when my ban.do planner and backpack came in the mail I couldn't stop smiling. So thank YOU for getting me out of my rut with a beautiful peony pattern and some rad fucking stickers 💕", "travelingmichelle": "Appreciate the realness in a world of superficial instagrams 🙌🏻", "sustainablerainbow": "❤❤❤", "samanthalouisedesigns": "Thank you for always being honest and raw with us 💕💕💕", "kaysujin": "✨💛", "constancezimmer\nVerified": "Verified", "ashleybrookebigler": "You're honesty is so appreciated!!! I wish you happier times to stay really soon!!! ❤️❤️❤️❤️", "gs_louise_": "Good vibes coming at ya.", "mylittlecherry": "💖💖💖", "domings": "Thank you!!!", "erica_x": "❤💜💙", "anndanger": "❤😔❤ sending you lots of love - please let me know if you need anything.", "inkiedinkie": "@jengotch thank you for being real. It's not easy having a mental disorder and living, much less being open about it. It's not easy just living PERIOD. I admire your courage to be honest. I'm still working it out. Some years are better than others as you know. Sending you xoxo", "mrssharkey": "You're a really cool woman. I hope you know that. Thanks for always being honest out here.", "timshel_love": "❤", "evedum": "💜", "lydiabrookspdx": "Truth", "sugo2go": "Hugs 💙", "rachelllita": "you're the best jen 💛", "nicolettemyslinski": "Thanks for not faking it! Jen you are an inspiration cause you are real!", "hurtherbronzun": "You look v pretty here 💖", "lilygracenelson": "Thank you so much for this. I can't describe how much this means to me.", "evylink": "I so admire your consistent honesty in each one of your posts. None of us are 100% all of the time. Thank you for being beautiful and real. You've got all the bravery. 💪🏼", "amyslysly": "💘💜💓👩‍🎤", "amcwood85": "First things first, you're da realest.", "danchibald": "❤", "isabelladeguzman": "YAAAAAS JEN GOTCH", "frisquebusiness": "You rock this rocks you got this!", "ana_heatt": "You are appreciated ❤", "kenzieamickco": "You're so amazing. Thank you for sharing 💜", "shewanders": "Hugs beauty", "shaylienorton": "I've been there, too. You are not alone. Thank you so much for sharing 💜", "anayas": "I wore my shirt inside out almost all day in public. No one said anything. I discovered it after I dumped my hot coffee all down the front. I'm hoping it made someone who saw me feel better about their day. Because we don't have it all together all the time. It's not possible. Feel better Jen!", "nest_desserts": "Thank you", "mitchmitchie": "You are a strong woman Jen. Thank you for always sharing this, and not perpetuating the 'gloss'. You got this girlfriend. 💪🏻❤️", "the_robinski": "Much love and numbers to you! Someone give Jen and 8.5 damn it!", "rrrrriojas": "❤❤❤❤❤🌮", "teresatherrien": "Thank you for your honesty and transparency. It's something we all really need and deserve. It inspires me to keep going knowing others get stuck in bed under the concrete cloud, too. 👭", "haley___james": "Thank you. So much.", "thebloomingloom": "Sending love!! 😘💕💕💕💕💕", "kait_handler": "Sending support from someone who also struggles.", "cristinafoos": "✨💖🙏💖✨", "rankandsugar": "You got this", "lomadd": "We're all here for you when you're at a .25 just as much we're here when you're at an 9.25 💕", "sussu.mc": "Thank you for sharing!", "jaclynlenee": "💞", "leahloustyle": "💞 always appreciate your honesty and depth @jengotch", "missmaddiecee": "My forever role model. Sending you all the love 💕💋💝👩‍❤️‍💋‍👩💖🌸💓", "kkures": "🙏 thanks for sharing", "sdm05": "Depression is horrible. Hold on, and try antidepressants. You are going to feel better. Sending love and light.", "sscheidler": "Oh girl. All the love and the healing values of vulnerability... sending that shit your way ❤", "tamaraaeschliman": "Feel ya.", "honestly_m_": "Love and prayers forever #mygirlboss 💗🙏🏻", "thelollasite": "take care 💛", "lmagelli": "Thanks for sharing Jen! Hang in there you beautiful soul you! You can push through 🌈✨😘🦄💪", "anncamacho": "Thank you.", "btoshner": "in it.", "westernomelet": "Thank you for everything you do. Your perseverance makes us feel like we aren't alone. Sending good vibes. 💕", "positivelypresent": "You are amazing and strong and brave. And you're so right: it's wrong (and sometimes infuriating!) how social media often makes it seem as if everyone has it all together. Maybe some people do, but I don't know any of them. And, just so you know you're not alone: I spent all of yesterday on the couch, feeling much the way you're describing. Thank you for making me feel less alone. 💗💗💗💗💗", "maddibukaty": "I admire and appreciate you so much. And I believe in you. And I believe in me.", "staygoldmr": "💯💯💯💯💯💯💯💯💯 KEEP ON TRUCKIN'", "kduse": "💕💕", "_lynnebell": "👏🏻👍🏻💪🏻💪🏻💪🏻", "itskarathomas": "Your a rockstar 💕", "meredithalexander1010": "You are a fucking hero", "herzen830": "You are resilient. Be well.", "creature_comfort": "Sending love.", "ditavonmarple": "❤️x", "hotdogforreal": "You are my favorite Instagram Stranger friend.", "misskathleen": "@annagernigan", "hellowerkshoppe": "Thank you for sharing this.", "mintpeaches": "You're awesome Jen.", "jessicadaviesmetalworks": "So much love and light to you. (Now and always.) And yes, thank you for always being so open and willing the share. ❤", "nixokj": "😘❤💕", "alisunjune": "🙌", "emmeliney": "I see you and send you love ♥️", "baloganator": "💘💖💘💖💘💖", "mmgreenbaum": "You got this! Thank you for showing strength to the world.", "diane_in_flight": "Thank you for letting us know. I DON'T know, but it sounds beyond horrible.", "christineaguilar": "Sending love", "carolinesomers": "Love you Jen!!!!", "ireneees": "You are love ❤", "sonya.harriman": "😘", "morganausterweil": "So stunning and so true! Thank you for your continual candor, strength, and authenticity!", "veronicaslane": "Love this photo. And, we're all dicks. You can do this. Moral support out the wazoo!", "sfgirlbybay\nVerified": "Verified", "kimjulie": "You share for the feeling of solidarity!! And that's a powerful thing for both you and everyone reading about your struggles. ✊🏻👊🏻", "phlpaday": "I hope you escape the prison of depression", "abigailmay_neve": "👆🏽💪🏽💞", "designbyaviva": "Thank you for being so open 💕So many people appreciate it, including me. ✌️", "rachroobear": "💖💖💖", "schnellbruton": "There was about a 2 year period where shit got dark 🌧🕳 and I did EVERYTHING (therapy, meds, acupuncture, herbs, so. much. exercise) and it just wouldn't lift. Eventually I got to this point of like, what else is there to make me feel better and I ran out of options. So I just got fed up and was like, I can't feel like this one more day. And then slowly the fog just lifted again. It's been 4 years since that lowest point and life just gets better and better. A slight fog will always come & go but I LIVE my life so much more now that I know what's it's like to lose years feeling like shit. Jen, you're fucking rainbow is coming soon. Hold on, brace for impact & let the light in when you just can't take one more day of the dark fog which will literally keep you in bed for days on end. ❤️💛💚💙💜", "instalessmolly": "thank you for your honesty, it's brave and it's real and it's appreciated ❤", "kelseymegankennedy": "@jengotch thank you for sharing and for being so brace, honest, and open. Love and miss you ❤❤❤", "tammygordon": "Love you 😘", "cassieterrazone": "I'm rooting for you, Jen! ❤🌈❤", "hannahrothrock": "@jengotch thank you thank you thank you", "littlespottedfawn": "⚡️❤⚡️", "aidananne": "Hang in there❤️🌻 I have so much love and adoration for you", "dooleynotedstyle": "Bravo for sharing the god honest truth! Feel better lady 😘", "mollyvirginiamade": "💙💙💙 thank you!!", "gracelouisagee": "✨💜💁🏼💜✨", "hayleygolightly_": "This is what I adore most about you. You're REAL!! You're honest and it's admirable. Hang in there, babe!!! Sending so many hugs to ya! 💪💪", "akiiiiiiiiiiiii": "thank you for sharing jen💕just be surrounded by comfortable atmosphere. Gonna be alright", "melissaharinga": "I'm so sorry you're feeling so low. Sending love and prayers. 💛", "arbuzzy": "ITS NOT REAL AND IT MAKES US ALL FEEL LIKE DICKS 🔥🔥🔥", "blynch1997": "I am sending you love. You are so f**cking brave and awesome and my heart hurts that you are in such pain. I know you are helping so many with your honesty ❤️🙏🙏❤️", "paperdahlia": "A-fucking-men! 👊", "soverystacy": "You are brave. You are beautiful. Thank you for sharing - because you make me, and everyone else, feel less alone. ❤", "thedigitalbird": "Yes. Reality. And Thank YOU. Keep on keepin on lady cakes. ✊🏽", "hellokeshia": "❤", "littlearrowshop": "❤️", "justmegger": "@whereislaurencharles founder of ban.do. I'm kind of in love with her.", "mckkmaldo": "Yes yes yes yes thank you and sending good dancey vibes your way ❤", "_ch_": "\"I won't feel like this forever but I feel this everywhere.\" I know exactly how you feel.", "_amandadawn": "honestly. i have learned so much in terms of being transparent with all aspects of my life & business by watching you. i admire & respect you so much for not sugar coating things & am so thankful for your presence 💕✨", "cat_gale_stanton": "🙏", "walking_thread": "My heat goes out to you 💕I am as impressed with your honesty and commitment to authenticity, as I am your creativity and love for fun. I recently watched a TED talk that made me think of you. It's about creativity and genius. While this might not be the root of what you're feeling, I hope it helps lift the weight a bit 💕http://www.ted.com/talks/elizabeth_gilbert_on_genius", "blongdotcom": "U r an inspiring angel 🌈", "megbiramstudio": "You are such a light for so many people. ✨ Your creativity is inspiring. 🌈 I'm sure your openness about this helps a lot of people! 💕Everyone has their shit even if their life looks perfect online. 💩 You are amazing!!! 😘", "jennylynnbowman": "So brave to share how you feel! Praying for a fast recovery!", "freckledarling": "Thank you for being real, and open and sharing. Sending you good energy to feel like yourself soon. ✨❤️✨💕", "mali.mish.marlene": "You are my favorite. ❤💕😍🎈🍭", "kristinhouk": "You got this! @jengotch", "meggualtieri": "You have helped more than you know by sharing that.", "yogadog": "@jengotch I feel ya, sister. Maybe spend some quality time with that sweet Phillip pup 💕", "victoriabersan": "💕 Thank you, lady. You are not alone.", "_lainy_": "❤️", "maria_chatzistavrou": "Οκ we r with u", "ashlin_dolan": "@halfthestory @livinlikelarz", "knotandstitchshop": "SENDING LOVE! 💘💕 you certainly aren't alone ✨", "siouxsey": "I love your courage. Be gentle with yourself. 😘", "forgetcake": "💜 + thank you for sharing. xx", "sarapants": "Thank you for saying this.", "blueridgefae": "You're my hero <3", "mintarrow\nVerified": "Verified", "aponiewaz": "Thanks Jen. You are the best. Hope you feel better soon", "opinionatedjacqueline": "Sending lots of love❤️", "readysteadymagazine": "I've been there before. Much love your way.", "krista_c": "thank you. 😘", "richiedesigns": "Sorry for your low. Thank you for your honesty. Even not feeling very well you produce beautiful images, I hope making art helps lift you up.", "jessonthames": "😘😘😘", "tarynniels": "I said to my husband this morning through blurry eyes and a sticky throat that I'd Katy Perry the shit out of today. It's only kind of working but I'm still trying.", "swandunbar": "Sending you good vibes!!❤️thank you for all your honestly and hilarity", "tracimulchrone": "I love how you hold your own hand through all of this. We all have to do the same with ourselves. Nobody else can decipher exactly what it is that we need. Thank you for sharing this. You will be fine. You'll be better than fine for a while, but you'll be fine. You're my fave, @jengotch 😘", "hadynamite": "👋❤️", "angela_f_miller": "❤️", "elizmccraw": "I love your real-ness. It's refreshing. I hope that if you feel you need help, you get it. In any form that might be. While it makes a huge difference just showing that everyone has low points (even successfully, inspiring, driven bosses), it's even more important to remove the stigma from reaching out for help. Asking for help is one of the most beautifully human things we can do. 💛", "shazkavaz": "Jen you are the best. Your Snapchats make me smile when I've had a shit day. Sending all the love and support from London, I hope you feel better soon xxxxxxxxxx", "laurenabrenner": "Sending virtual hearts and glitter and rainbows 🌈🌈🌈🌈🌈💗💗💗💗✨✨✨✨", "laserkitten\nVerified": "Verified", "morgan_wyenn": "Thank you for your bravery and awesomeness in always keeping it real. You are my hero.", "courtneyandthebabes": "❤ It's ok to not be ok ❤", "rachn_1": "Thank you for sharing. I don't wish this for anyone, but it helps make me feel like less of a failure to read it. Thank you. This will pass, and you will be yourself again. I promise.", "erinlovellverinder": "Big love x", "kristinmarchesi": "Yup. Life hurts like hell. And then it gets better. You're not alone. Many of us are hanging on by our phones' power cord, too.", "khangeland": "<3<3<3<3", "melissathebeautiful": "Thank you. 💖", "brookecrase": "You're awesome ❤", "thelittlest": "Hi beautiful brown eyes. You are definitely not alone in the feeling. So much pain is caused by how impermanent this life is. The Buddhists have it right in that attachment to the remembrance of what was or the projection of what will be causes so much suffering. We dishonor ourselves and our contributions when we resist the feelings that overwhelm us or that we wish were different. All things must pass. Including how you are feeling now. Feel it and let it go (And/or Katy Perry the shit out of it) 💕", "lookwhaticando12": "I have an auto immune disease...Sarcoidosis.... it sucks... so much pain...hits me out of the blue...plus extreme crazy exhaustion.... I hope you get better asap💕💕💕", "rosannarouge": "Preach 👌", "mrshorn": "❤️❤️❤️❤️❤️❤️❤️", "little_emmab": "Sending hugs, Jen. 👐🏼I really appreciate your honesty and willingness to share openly how you are feeling. 😘 I'll be cheering you on until you feel better.", "lilybreckner": "💕", "sheselle": "@jengotch Sending heaps of love and positive vibes your way ❤️ Thank you for always keepin' it real and continue to do whats best for your mental health. We love you and are always here rooting you on! 😘", "thecaffeinatedbrunette": "#howifeel @thejillimain", "erica.engdahl": "Oh my god yes. Thank you so much for sharing. I relate and I really hope we get to feel better soon, all of us.", "charity_sarah": "Thank you for sharing. I feel like less of a dick after reading this.", "jill_guidi": "👏🏼❤️", "jilli_beautyfromashes": "@thecaffeinateddonut awww BB Britt :((((", "xantheb": "Sending ❤❤❤❤❤❤", "octoberhello": "Sending you love and light. ❤️❤️❤️", "hellohenryandotis": "💪🏻👊🏻🙌🏻👏🏻", "ibbungalow": "Ty🕊🌿❤️", "maggiediprima": "thanks for being you", "lolmel": "I applaud your honesty, Jen. I constantly look at your posts and love the authenticity and laughs you give me. We're all in this together after all. Sending you major hugs! 👯", "ylfagronvoldstudio": "💋💕💪🏻🦄✨💥", "made_lyn_marie": "Thank you", "missdonnamiller": "You are amazing! And a major inspiration!!!", "ajleeson": "🌈⚡️💥💋🙋🏼💕⭐️🌈", "el___femme": "I love you @jengotch", "jackieberretta": "Sending you so much love 💜💜💜", "goldalamode": "Sending love and good vibes Jen! Thanks for keeping it real. We all get there sometimes 💖✨👸🏼", "blondebiscuit": "Take your time. There is no rush in picking yourself back off the ground. Much love ❤️❤️❤️", "ziedarling": "Thank you so much for sharing and being so real. I'm sending you all the warmth and love I can. I hope tomorrow is a 10.25 day. 💕", "heathermaxwellhall": "Yes yes yes. Thank you. Please know that you are helping.", "jillford": "❤ love and hugs ❤", "natplays": "🙌🙌 sending good energies xxx", "gingermeglam": "Thank you for always sharing your truths. 💖💖", "adrianminotti": "I've been there, I know your pain. I too vow not to paint a glossy picture. You are not alone. 💕", "laurenmarie919": "Thank you for being a voice for all of us humans because it is not easy. For anyone. Your bravery is so inspiring. ❤️❤️", "ladidot": "Hug, hug, hug. 🌷🍰✨", "yodice": "You are an inspiration, thank you ❤", "ma.ree.suh": "Sending you love. You are amazing", "brookervon": "Big love for you!!!", "melissa.rhiannon": "Love your words, every time, even when it's something so difficult. I'm sorry this is happening. You are precious and inspiring.", "lilcashley": "Hang in there!!!!!!!!!!!!! :::::giant hug::::::", "ginghamgirlgreetings": "Hang in there. 💖", "katyannjames": "thank you for your honesty!", "idreamofkelly": "💖", "claire.eves.design": "Thank you sooooo much for keeping it real! You are such an inspiration. Just by sharing your whole experience (the highs and the lows and everything in between) you empower others to do the same! Today is actually #bellletstalk day in Canada. For every instagram post, tweet, retweet or text, @bell_letstalk will donate 5 cents to mental health initiatives in Canada!!!", "lizzie_darden": "Sending you all the love 💘💘💘", "evelynhaupt": "ABSOLUTELY 👏🏼👏🏼💖💖", "deannalinder": "I love watching your stories. You are so hilarious. Your honesty and vulnerability make you even more of a rock star. Hang in there and thanks for letting the rest of us know that even rock stars get down, just like the rest of us.", "sarahcurrydesign": "Sending ❤", "marielearegales": "💟⚡💟⚡💟⚡💟⚡💟⚡", "jenniferlioy": "❤", "graceohill": "Thank you for your honesty. Sending love and light ❤✨!", "adelinehopkins": "Big fat kiss.", "bornandraisedvintage": "Been there exactly!! Lotsa love to you today.", "thespitfiregirl": "Hang in there 🙏🏼🌈 you are such a source of inspiration and joy 😘", "lara___c_": "You've probably read this already but this is the best thing I've ever read that describes what a low feels like in a non condescending, 'oh someone gets it' way - and it has cartoons. http://hyperboleandahalf.blogspot.co.uk/2013/05/depression-part-two.html?m=1", "mollie.achour": "הכל לטובה ⭐️", "artistwandering": "@jengotch yes and thank you, sister 💞", "chelseasantoro": "You just explained everything I've been feeling this past year. Thank you. It's so comforting to remember we aren't alone, even though it feels like it most of the time. Sending ❤", "justabrklyngirl": "Thank you Jen for sharing. This too shall pass but in the meantime sending you lots of love", "jessicajenkinsfieryheart": "It is hard work. With you in spirit Jen!", "aknightster": "💛", "thewass": "Xoxo from Alabama! 💕🌈💕🌈💕", "missdrebaybay": "Hang in there Jen. Life is shit sometimes. There are days and weeks and even years where they just go by and it's a total mind fuck. But then you will also have those days, weeks, and even years where they will go by so fast bc of how wonderful they've really been. Things will be better. Where there is night, there is also day. Sending you positive vibes! Xx", "beltyc": "Thanks for being so honest. I'm a 3 today for no fucking reason and sometimes I tell myself don't go on social media bc then I get so friggin upset at all the perfectness but then I catch of glimpse of realness that I so SO appreciate. Also I'm a total stranger but I can confirm I'm not a creep but am in LA and would so totally bring you some sweets to kiiiinda bring you back up the scale so that's an offer right there. 💗👊🏼also this 👩🏽‍🌾bc why is she carrying carrots?", "makeupbyrebeccajillian": "Have you ever tried CBT? So helpful.", "2largepassionfruiticedteas": "❤️ and here's a monkey: 🐒", "audreypm": "Thank you for sharing this. The strength shining through your vulnerability is inspiring. 💞", "sarahmiranda02": "Sending hugs your way", "labeath1": "I hear ya. My hair hurts, too. Those days/weeks/months feel like you will never escape, but you do. Take good care. xx", "bbdodd": "Thanks for making me not feel like a dick! Your IG stores were the only thing getting me through the day a few wks ago!", "andthenagain": "Thank you for sharing. Today in Canada it is a day dedicated to being open about and talking about Mental Health and your post is a perfect reflection of this. ❤️", "minipiccolini": "❤️", "tianna.cerone": "Thank you for sharing your truth. It's really helped me over this past weekend, especially. 💜💜", "vaneshua": "❤️❤️❤️❤️❤️", "thesoulfullentrepreneur": "💪💕💪💕💪💕", "hotbloodmessiah": "Queen 👑💕", "marimarianamedeiros": "You are an incredible human woman 🤝❤💎", "thesheaalexander": "Life is hard! You are not alone...I am not alone. Thank God some people keep it real. 🙌❤ Pink Skies Up Ahead. ✨💫✨", "dana_fernie": "You are the truest role model and I am forever grateful for you fighting the stigma and letting us know we aren't alone. All of my love is going to you. Xoxo", "mancalledmace": "Chin up my friend x", "samsaraspeakeasy": "Beautiful Vulnerability!!! ✊🏽", "clairejepsen": "Take some you time babe✨ Even girl bosses need a \" imma go crazy\" day full of nothing but mimosas and confetti 🎉", "zyanna": "Big hugs, lots of love 💕", "jacqueline.neilsen": "You are amazing❤️", "kaleyd89": "I love your honesty and you are so awesome for sharing your real life here on Instagram. While I do love some perfectly curated, inspiring, and beautiful photos, it does get a little old sometimes and feels a bit fake. I always appreciate your \"realness\". Sending love and good vibes to you! ❤️", "decorotation_interiors": "Thank you for always being so real through the good and the bad. You are truly an inspiration. Hang in there ❤️❤️", "wendyowilliams": "Thank you!", "photolexx": "❤❤❤❤", "kisskisstangtang": "🙌🏼💥💥💥💥", "katieblossoms": "Thank you.", "creativethursday": "you nailed it perfectly. this past year was not so easy. And I do feel like a dick - sending 💛and when you feel better & want to go for a cocktail with a Florida Gator, I'm here 💃🍸", "nantuck3t": "Sending you my thoughts and love, Jen 💕", "anita.leone": "I love you 🐸 feel better 💆🏼💋💓💙", "mookiemoo": "Go girl! You're the most relatable and we love you for it xx", "mal_ur_pal": "💖", "charityvictoria": "Love and strength to you!", "smnice": "✨💖🌿", "mybrandlashes": "This. Thank you for sharing", "carrie_durand": "thank you for posting this, I really needed to read this today <3", "southwesternbelle": "Your friends in Tucson, Arizona love you and want you to be the 10 you deserve! Can we send a care package to Bando?", "modchik": "I'm on Instagram avoiding everything in my life that's demanding a part of me ... I'm so overwhelmed I'm numb ... and I do feel like a 🍆 for not having my magic wand that makes this 💩all go away ... 🙌🏼🌈💥💋#keepinitreal", "rennstagram": "Love love love. You're such an inspiration, always one. Thank you for always putting these posts out. It helps to feel less alone. 💗", "planesworkshop": "@jengotch your honesty in this social media world of bullshit is so refreshing. You have no idea how much your statement has cheered me up. Love to you sister X", "maryrosejonessnell": "My gosh, I love you! Keeping it real af! 🌈❤️", "palebeans": "You are my inspiration and I'm thankful for your existence 😊", "haleymprazak": "💖💖", "frostingandfringe": "🙌❤️🙌❤️🙌❤️", "colorpopevents": "💕💕💕💕", "rebecca_wilcox": "❤️ you are a badass.", "designkb": "A lot of people love you!! Hang in there", "susannafrancesca": "Although I don't know you personally ( I wish I did !) you emit such joy on social media and through your work ! I am thinking of you during this tough time and sending happy thoughts 💖👯‍♂️", "thefancycatstudio": "Jen. Thank you for being so real. 💜💜💜", "orange.tree.square": "💛💕", "yearofthebloom": "💕💕 thanks so much for sharing this! I had thoughts about posting about my frequent anxiety just yesterday and I feel this will give me strength! It sucks that you go through this but it really does help a little knowing there are people out there who feel the same. Sending you good vibes and knowing that you will feel back to normal in no time! (Try watching a funny show or movie - like baywatch for example 😂😂 - always helps me!)", "saddletrampbrand": "That's right, fuck the rose colored glasses (I mean, yes, they're cute BUT....)", "jodan44": "You got this chica!", "kchasedaloisio": "❣️hang in there, this too shall pass❣", "anndesan": "IG needs more of this. Sending my love! 💌", "lanieyoung": "@jengotch 😭🙌🏼", "abconner": "😘💗💗💗", "themirandamarie": "Thank you so much for sharing this. I'm currently laying on my couch where I've been stuck for hours. I'm supposed to be working from home today but all my body can do is lay here, and all my brain wants to do is stare at the ceiling or sleep. You're an encouragement. ❤", "lizperezartist": "@jengotch The real you is even more beautiful 💜 Sending you lots of love and light hun 🙏🏼💜 We've all been there too, so don't ever feel alone 💜", "itselisse": "I relate to this SO MUCH. Thank you for sharing—it already is helping me feel better and less lonely. 😌", "ofareverie": "sometimes I get hit by the same giant wave too. ride it out and know you are not alone and wholly supported. 🏄🏻‍♀️🌈", "haleyloveswords": "🌸Your heart and honesty are inspiring.", "1800flamedame": "Sending good vibes your way💖🌈", "jjillustrates": "Amazing honesty we shouldn't hide behind are beautifully coloured Insta lives! Life is hard and sometimes shit and it makes our hair hurt but it can also beautiful and awe inspiring. I hope it takes it easy on you soon ❤️", "thealchemyofdesign": "🙏🏻🌈🙏🏻🌈", "meghan.awalt": "We 💚 you . Hang in there", "theamandaperna": "You are amazing! We all have highs and lows and are entitled to every emotion. Too many people act like you are supposed to always be ok. I was once ridiculed for having an anxiety attack on Project Runway. But honestly, screw anyone who says you can't be overwhelmed or have a rough day. You are a bad ass who has achieved so much! 🙌🏻 keep being you and inspiring us all!!", "hconlon": "💕🍹😘", "selenaquits": "Hang in there. Thank you for being so honest and open. It will get better. 💕", "hannahtakespictures": "I'm here today, too, and I love you so much for sharing this. Immensely so.", "bekkapalmer": "Thank you for always being honest with us.", "sleepybrittany": "Thank you for always sharing Jen. It helps us (me) feel not so alone in this. Sending my love and understanding✊🏽💕", "alexandracadena": "💛", "miriam.vegac": "Thank you for your openness 💖 it makes me feel less guilty when I'm feeling this way myself . Just knowing that someone else is feeling this way makes it ok somehow . 💖 lots of love", "mirandatanner": "You're amazing, Jen 🌈✨ Katyperry the shit out of it- works like a charm for me ☺️", "ikekepania": "#keepitreal well done, hope you feel better and keeping Instagram real", "the_girlwiththeglasses": "Thank you! Having a 2.0 kinda day myself....I'm going to get cupcakes after work. Thank you for sharing real life shit. It makes me feel like less of a dick when I'm not handling things well ❤✌🏻", "lauraelle": "❤❤❤", "kristy_stafford": "Everything is temporary - I like to look at photos when I knew I was happy and present. We only know light because we have experienced dark!", "melissaraath": "💖💖💖💖💖💖", "mixedupclothing": "Damn, shit just got real! Gotta tell ya, I went off from looking at your stuff b/c it looked so easy and I couldn't figure out why I couldn't get it together. I would get down on myself as a mom of 4 who are counting on me to make it happen for our family. Then I see this and feel like we need more real shit! Sometimes it sucks! You probably won't see this but someone who needs to see it today may and feel like they just have to keep going!! @jengotch 🙏🏽", "_bethany": "I love you and I'll pour out a slice of pizza for you.... you're not alone. It's a struggle to get out of bed lately. 😑", "jodimckee": "xo", "kellylaine": "Thanks for being honest in a world where everything is bullshit. Hope you find your magic again soon. 🎈✨", "dakotalbarber": "❤️❤️❤️", "aylexmerlo": "You are amazing.", "mbbakes76": "Pink skies ahead... that's what she said ❤🌈", "erinpconnor": "Today is #bellletstalk day in Canada, bringing awareness to mental health issues, check it out, it's an awareness campaign that donates money every time someone uses the hashtag and encourages people to talk (and listen) just like you are doing 💕", "lisammagee": "With you, girl! You're doing great (even if it doesn't feel like it)!", "asher_i": "Thank you for this 😘", "lessaburto": "I hate to see such a beautiful and succesful woman like you go through such hard times. I know life gets hard sometimes but you can so this! Cause you are amazing and you rule! ❤", "oliviablackburncreative": "💜 you - for your spark, your sense of humour, your creativity and most of all your honesty 💕.", "chortyrok71": "Real talk ❤️", "thewilde_": "💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕", "melissaaasaurus": "💖💖💖💖💖💖💖💖", "elleeachten": "thank you ♥", "ilootpaperie": "❤️", "amandacattt": "You're amazing ✨✨✨✨", "ashleylaura91": "✨💖✨", "lu_lynch": "Love you ❤️", "bashfulblunder": "So so so admire your openness and strength with sharing all your struggles in addition to just handling them like a boss b!tch. Go you girl, I admire your ability more than you could know💖💗🌈", "nataliebondehagen": "THANK YOU for being so real. Good vibes all day for you. 🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈", "chelseamclay": "Thanks for sharing. And \"Katy Perry the shit out of this\" is my new favorite quote ever", "lauraaaah_hoopdoggydog": "You're awesome @jengotch", "grettylm": "💕💕", "sasadiee": "Thanks, Jen. ⭐️🌈👁💋", "kristikoch": "You're a ⭐ and you are 💪", "joiebutter": "i've been there too. i have nothing but love and respect for you and your honesty. for what it's worth. you got this jen! 💗💗💗", "hellojessi.ca": "Love to you JEN 💕🦄", "keriwalters": "You are amazing! ❤", "meg.weber": "Sending all the good vibes I can muster to you.", "beckymsimps": "You're a queen, Jen", "simonemoffatt": "@jengotch it seems harder than ever to motivate sometimes when we see everyone on social media creating fake realities, and think we're not measuring up. Refreshing to see a well-known personality be real. I'm in ur boat. 💪🏻", "haleyca": "Following you has made me feel so much better about myself. Because you're right, living life is really freaking hard sometimes and I tend to be really hard on myself, but knowing that other people experience it too makes it feels as lonely and more doable. So thank you and I'm sending you love ❤️", "julieloveshome": "Thanks for sharing #bellletstalk", "fabric35": "When this happens to me I read some smut and grime!!!", "rachieolson": "You are amazing.", "fionzone": "The boomerang goes well with this post because it looks like you're popping a bubble. 🍬🍬🍬", "l.louisedesign": "Love you and love this and I cried a little bc I can feel how you feel bc I get there sometimes too, especially about work. You're honestly hurts my heart in the best way - thank you. And I know you'll feel better, and for now, it's also ok that you feel bad. So much love for you.", "lerinherzer": "Sending you love and light ✨✨", "ereyayouknowme": "gave me all the chills. i wish i could bring you a hash brown and jam from mcdonald's. but seriously - your honesty is a breath of fresh air and inspires so many to open up as well. here's to getting to maybe a 6.0 soonish. 💕✨", "lindseyalyssat": "You rule at life. 👊🏻💪🏻🌈🍪🍷", "funcult": "❤", "jenckjacobs": "gah i love you. 💕", "ismayozga": "💖", "26andnotcounting": "Coming from someone who recently ended a 6 year relationship (and broke off an engagement), I needed this. Thank you for always sharing. ❤", "feisty_fiestas": "💕💕💕", "dmb.317": "@jengotch hugs! 💐", "queenbeesanders": "You got this!!✊🏼😽", "everita": "@kaylahaykin", "darkbluespeed": "Damn girl. I dig your rainbow-concrete-cellophane transparency. If I were @katyperry I'd be thrilled to have you use my name as a verb in resolving this space. Big weird love your way. ✌🏼️", "whatemilybixdid": "Love your honesty Jen, keep going, those .25 will turn back to 10's soon 💪🏻✨", "prettylittlefawn\nVerified": "Verified", "brittanydthatsme": "Sooo inspiring ✨💖 @kristinademarest", "mich3llehart": "Thank you so much for sharing this side of your life with us!", "gretchen.e.moss": "You do not know me but I'm right there sometimes to. More often thsn not. I love that you shared. ❤👍😂", "rebeccajcollison": "...as the creator of a holographic print sports bra and shorts (Katy Perry needs to get that ensemble in her wardrobe asap by the way), for that alone you are a born winner.", "clothandtwig": "Sending so much love and 🌈💕⚡️", "kellydorandoran": "Thank you for being honest. You are seen, heard and appreciated", "mekeesha": "❤️", "thisisnotanartproject": "🌻🍭❤", "kenzieleveque": "❤", "amberdesignsthings": "❤", "_jentrification_": "We love you Jen, and we're all here for you at your .25's and your 10.0's. 💖", "kellyhannahk": "☁️🖤☁️", "glennmae": "🌈Sending you sunshine and sparkles✨", "rachel_aspen": "❤❤❤", "zerouv": "Such an inspiration ❤"}