{"jalstern": "Hahaha, no dick pics! You’re awesome!🙌🏼", "thegladiatormike": "#thegladiatormike", "thatpalmspringsvibe": "Been hanging 'with' you for a few years now. Not a commenter.. usually. Babe, keep working at it. As a babe is the same vintage just want to send you all the ❤️❤️❤️❤️", "ceasethedayhappy": "Take care!", "priscilladegeorge": "@thebiancadiaries 💞💞💞", "jonesiest": "Thank you for this. I really really needed to hear this message. 🖤", "_annkrystle": "You are amazing ❤️", "alexamutchler": "This is amazing. 💕", "snsieckert": "Lady, you are a force of nature for good 🙌❤️", "suereinholdtbrown": "@jengotch warrior, thank you💪🏼", "risamariexox": "This made me tear up! You’re so strong & I love your page ♥️ I suffer with bad anxiety and I hit my rock bottom a few weeks ago and I just started the therapy process. Thank you for being a positive influence in this world. ✨", "zinnentonic": "@ericuuh", "kristi_and_olly": "I’m so depressed that I can barely move. Thanks for being real", "misselizabethefirst": "I can’t get through it anymore", "astudy_incarrie": "@mickeytwoguns", "tazeen__shaikh": "Soldier 🙌🏻", "zebraschoolcounselor": "Bravo! “I consciously decided to heal...” ....amazing!", "japanesesong": "❤️", "livreandlipstick": "Hi @jengotch do you find the reiki helps? I’m so tired. X", "kellyann1020": "What’s your thoughts on Ativan for anxiety?? Also recently was put on 10 mg of Paxil a day??? I’m 40, has bouts of depression many many years ago..but, my anxiety is the overwhelming issue right now. The Paxil is supposed to be for anxiety. I am not depressed and just Ativan the Ativan when anxiety is too much to bare. Thoughts? @jengotch", "christendrake": "Thank you for sharing this 💛 I just finally went to get my medication swapped cus I’ve been feeling depressed again a lot lately. Glad to not be alone in this struggle", "happyjackjack": "Thanks for being the real real! It’s super inspiring!!! I feel like such a boring version of myself on social media bc I’m often afraid to share the real ups and downs!!! Anyways you look like the most fun ever and as a fellow business owner and dancing fanatic, I super look up to you on so many levels! Keep dancing, creating, and inspiring!", "aishalorena2": "@b_authentic22", "linz_901": "I really like you. 🏆", "lcarranza13": "💕💕💕 Thank you.", "mommybayless": "This post alone inspired me to follow you!", "gabr2410": "❤️❤️❤️🙏🙏🙏💜💜💜😍😍😍😘😘😘🤩🤩🤩😻😻😻😻", "graceisgold": "Thank you for being so open 🙏🏻 #myfavoritemeds", "captain_kaytee": "💕💕💕", "katie_bowbatie": "@_jessicaraeee see babe... it’s ok", "sixfigscoaching": "Inspired by you. 💗", "sobernewyork": "You are amazing 👏👏👏💕", "cherylcsk7": "@vivianethenerd I finally took my first meds today. Day 1. I did it. 🤞🏻🤞🏻🤞🏻. Obsessing over this woman right now and if I could look like her at 47 then maybe there is hope 🔥", "rachweller_": "Woohooooo", "kelseylynnstevens": "you’re a rainbow in a world that sometimes feels like it’s only filled with clouds - your journey is so helpful even in those moments when it feels a little hard to watch because i can’t break through to give you the hug i sometimes want to. your raw honesty and colorful life are still needed around here. 🌈✨", "emmamoneuse1": "you are very important", "bridget951": "You're amazing for sharing your \"journey\". Very brave and helping many!!", "shelouise": "🙌💖", "4littlehoyes": "I am on day 6 of getting the help I need to heal. I always thought that I could handle this stuff on my own and I hit my rock bottom. Tomorrow, it will be a week and I am hopeful.", "teramesue": "@jengotch you are brave and light and wonderful for sharing your “journey” or experiences with all of us. You should check out @fredandfar self love movement (I think you’d like it) and the founder just wrote a great book called The ABCs of self love (by melody Godfred).", "pamandgela": "@jengotch I can totally relate to your day to day struggle... and successes Having experienced instances of being misunderstood, shamed and judged by people who don’t suffer from anxiety is so hurtful. Especially when it’s people you love. Mental illness is not a choice it an illness. Thank you for bringing light to a multi faceted topic. We all need a safe place to share, laugh & be silly ..... To know that it will ultimately be okay. Happy Sunday Thank you for providing that.", "saratess": "💛💛💛", "kerrycrawford": "Love you. ❤️", "abonetati": "❤️", "masteringadulthood": "Love this share! We will all start more readily attending to and healing ourselves when we take ownership the way you are! 🙏🏻 And sometimes that means having to use generic terms as we share the ‘journey’ with our fellow humans 😊💪🏻🤗", "juliessister": "💜", "angelahurtmusic": "Happy for you. 💗", "the5dells": "You’re awesome 💛", "dvandylion": "Love you so much 😍", "kristine.fribo": "♥️", "love_lsb": "@littlewombat", "gemma006": "I'm the silent dealer and well it's really hard for my family to understand, when they think it's nonsense and my work place. I feel so alone at times but seeing your journey has made me take the step to get help. I wish you were my older sister 😅 so you can say it's okay we'll get through this. Seeing you post this stuff is a cry of relief. Thank you for speaking out --because viewers need to understand it's not a choice.", "thelizcarey\nVerified": "Verified", "yellowlamington": "💛🙌🏼💛", "eyalmatatov": "🤘🏼⚡️🔝🔝🔝🔝", "selmablair\nVerified": "Verified", "jujudwyer": "FUCK YEA!!!!! This is awesome, funny and to the point. You’re brave", "diaryofamindfulmom": "I am on my one year mark as well. And those of you reading these: it’s all about our mind. We have to be stronger than it or it will control us. Congratulations on making it to the other side, Jen. May we stay here as long as possible! 💚👌🏼", "la_vie_en_eli": "I am at the point today that you were a year ago. Finally giving in... seeking therapy. I hope a year from now I can look back at it in a positive way.... and hopefully zero dick pics 😏", "breeynmccarney": "Mental note: dm Jen a small dick pic 💕", "homerfridafrank": "I really love that you’ve said this. And I feel all of that too. I’m not where you are — yet, but I will be. And, you’re super brave for sharing. Thank you for doing so. It matters. You matter. I matter. 💚", "perrycanary": "Love you, Jen!! Thanks for doing your thing!! You rock!!", "ladydodsworth": "Thank you for all that you do 💗", "bullfrogsandfireflies": "❤️❤️❤️❤️ I love reiki! I am a reiki master and ridiculously excited that you mentioned reiki! all the love and light to yoi❤️❤️❤️", "jana_fabulous": "Thank you for always sharing. Your authenticity is intoxicating ❤️🙏", "raechild": "Love you and your life messages 💕", "jessicadaviesmetalworks": "❤️🙌🏻❤️", "thelouielifestyle": "❤️", "erinke": "🙌🏻🤗🙏🏻", "sallyannejoyce": "Love this and all your posts - esp the garbage dancing- but my daughter snuck out of bed, saw me reading this and thought someone lost a tooth.", "hubbabubbamcqueen": "thank you for being there when it feels like no else gets it. you inspire me to fight every day, and to be the best version of me i can be💜", "liz0585": "Hey I love you!", "mouselovespig": "Thank you for your bravery in sharing about this. 💗💗💗", "kristaallenxo\nVerified": "Verified", "deanneuh": "Thank you for this. I posted a similar photo recently about just starting mood stabilizers for the first time and it caused a big rift with my family. You and your podcast remind me it's all ok 💕", "lionandtiger": "❤️", "neety": "So happy you're getting better and betterer and bettererer. 😊💕", "brucoffeebar": "Inspiring. Thank you", "thefakekrisbuti": "How do you heal, when there is no treatment that works? That’s the problem I face. It feels insurmountable.", "sbdesigner": "✨The universe is so lucky to have you in it ✨", "mermgirl1": "It's amazing how a person can transform themselves from rock bottom to living a good life. I can def relate and have been through similar times myself. And a good doctor prescribing the right meds is a tremendous help! Keep it up girl. You're all kinds of worth it 😺", "hunjanlydiac": "You are so inspirational. Keep going please🙏🏻🔥", "dirtandnoise": "I love your honesty & so glad that your journey is moving in the right direction.", "elisemiklich": "🙏💓", "margiemillerdesign": "Thank you", "claire_kramer_mackinnon": "You make the world a better place for us all. ❤️", "kelly.atterton": "✨🙌🏻✨🙌🏻✨🙌🏻✨", "rilkean_heart": "❤❤❤❤❤❤", "nikkolinaxo": "Love you 💕", "farmgirlfashionista": "🥰🤗💋 Thank you for sharing your story! #endthestigma #inspiration", "kellysolis1": "You inspire me xoxo", "devinmh": "I’m proud of you and thankful for you 💗", "mhc62477": "♥️♥️♥️♥️♥️♥️♥️", "laura.gwinn": "So proud of you & so appreciative of you to share your journey with us all. It’s been inspiring and helpful, in so many ways, so many times. ♥️", "triceclark": "Love you ♥️", "hollowtree1871": "💕", "beejellyfish": "Heeeeyyy I see you! 😍 That’s right GF. ❤️ a very close friend once told me “sometimes the healthiest choices are the hardest ones” @pro_sciuto", "thebestdaniellelevy": "You are doing amazing and have helped me so very much. I adore you JGOK. 💖", "mybrand.ofbeautiful": "This 🔥", "josiebrott": "Yassssssss✨✨✨", "kaylagregory92": "♥️♥️♥️", "_heydear": "❤️❤️", "lyndsayjs": "You go girl you are such an inspiration thank you", "kindness_u": "HALLELUJAH girl! 🎉✨💫⭐️", "71_sunny": "Everyone should read this and focus on our own pain. Starting from within is where true change begins for us all. Best wishes at a continued healing, healthy and successful life. ❤️", "hayleygolightly_": "You’ve helped me and so many others, can’t say thank you enough Jen! 💗", "cydspix": "Your words resonate with so many of us struggling. Thank you for being you!!!!!", "anniihirst": "When you dance, it’s everything!!!!!! 🥰", "charlie.emmeline.albers": "A little pill has the power to heal. It takes a brave person to make that step towards healing, so bravo. 🙏🏻", "susantwohig": "What is the significance of the pill tho?", "annie.burns": "Inspiring for sure-the dumpster dances are just a bonus😉 congratulations", "bcrook711": "Thanks for your honesty. Keep going.", "chelgrund": "💓💓💓", "caitcowley": "Go you!!!", "kerrilynnpamer": "❤️❤️❤️", "mamabuttters": "Medication saved my life. I’m happy if saved yours. Illness is a bitch and you are a warrior. I admire/appreciate how you use your pedestal to educated and normalize.", "loumime": "❤️", "rhcritch2": "You are the jam in everyone’s jelly doughnut!!", "nicoletenaglia": "So profound Jen 🧡", "sammartime": "Completely inspiring! 💪", "knitsonik": "So much love for the generosity and honesty with which you share your story with us, thank you so much xxx", "christinalynn82": "You are amazing!", "marcelamelor": "❤️", "ginarockenwagner": "You give me strength. Congrats jen!", "amyrushbrookphoto": "Thank you for being you, @jengotch, you fucking unicorn of a human being. ✨ #endthestigma", "auntiekaren3": "thanks for sharing your honesty and vulnerability with all of us. 🌸", "justthebeth": "One of the only reasons I still look at Instagram. Thanks @jengotch", "_katierock": "@leighorne love her", "daydreamingmydarling": "Brave🙌", "jessicagreyourisman": "Grateful to you for destigmatizing mental health and making wellness a relevant topic! 🤗 🤗 you gave me strength and I don’t even know you (irl)", "renbalesrhodes": "You’ve been a godsend. 🙏🏼❤️🙏🏼", "aysersalman": "This is wonderful", "s.vngl": "We luv u 💓", "hannahpeters": "You are the actual best, Jen. Happy Saturday 💕✨", "constancezimmer\nVerified": "Verified", "julianaguinane": "Love you, JG!", "kgross": "Love this and you. Thank you. ❤️", "jesscoscarelli": "@vanessabancheri", "lisa.kelsey.54": "Self care is so important 💕", "amyozwilkinsta": "A lot of women are going through similar things and I wish were more open about it.", "ampersandwtf": "thank you for sharing your journey with us. 💫", "dsignedbya": "@katfoster80 ❤️", "djshaz": "Love you ❤️❤️❤️ and thank you for sharing", "mrsjennamartin": "LOVE U JEN", "charmedlifechs": "Thank you", "runswithcheetos": "❤️❤️❤️ just love you and your honesty and sense of humor so much!", "the.adventure.folk": "✊🏼", "marelithi": "💓", "petite_boheme": "💖", "richiedesigns": "So happy for you", "madevisiblepodcast": "Thank you for sharing your journey - such a powerful picture and statement. ❤️❤️", "herenorthereshop": "You've have helped SO MANY people along the way. Me included. I owe quite a lot to you.", "blynch1997": "❤️❤️❤️", "jacqueline.neilsen": "❤️", "stephyhads": "Thank you for putting a face on mental illness/health, because talk talk talk is the only thing that’s going to “normalize” it. Even though the brain👏🏼is👏🏼an👏🏼organ👏🏼can👏🏼hurt👏🏼like👏🏼spleen👏🏼or👏🏼heart.👏🏼 Keep on talking louder for the people in the back/the herr derr get over it herp derp🥴 crowd. #💪🏼🧠", "coachpenelopecruz": "We love everything about you ✨", "lilyhdzb": "💕💕", "anandivandiepen": "🌸💛", "meldubie": "So great to see you doing better. Love ❤️from Vancouver Canada 🇨🇦", "xxxxclairexxxx": "You helped me a lot. The trash dancing in particular ❤️😘 xx", "vintagereviver": "Congrats 💗 you are inspiring 🙌", "britbrand": "You’re incredible ❤️🙌🏽", "locappellini": "👏🏻👏🏻👏🏻👏🏻👏🏻❤️", "restless_collector": "So happy for you!!!", "beccajuliem": "What a powerful photo @jengotch Keep up the good self work.", "tracyghoward": "So wonderful! Thanks for the loving transparency...❤️💫❤️", "mirandaselwynbishop": "Applauding you 🙌💗🙏🏼🌟", "meghansdreamdesigns": "❤️❤️❤️", "balladvintage": "💖💖💖💖", "bishimckeand": "@jengotch your stories have helped me through my journey. So just thank you for being so open and honest, and showing that we should not be ashamed. ✨", "seadriftsoul": "There is great strength in recognizing our health issues, especially when they are of the mental version. You have been raw, vulnerable and down right funny about your ‘journey’. All while being one badass boss babe. Simply put...you rock!! 💗✨ Thank you for sharing from one anxiety ridden girl Boss to another. 👊🏼💕", "dean.renaud": "thank you for this. you're amazing and inspiring and encouraging and it helps so so much. 🖤", "onlymeganstarr": "You are truly amazing. A queen. A goddess. I love you for being just the way you are.", "_judyteen_": "Thank you for sharing your...journey with such transparency and for your wonderful sense of humor. I have been following you quietly for the past couple of years while struggling deeply with similar issues..... There have been many days recently where I feel like I don’t even know how to express myself anymore and have felt withdrawn/isolated.....I’m at bottom and I can’t even explain how awful it feels... Seeing your transformation (and also thinking that you seem like an all around great person) has given me the drive to reach out for help and the hope that life can be good again... It is so nice to see you achieve happiness....From a stranger, thank you for making me crack a smile on some of my worst days and for making a difference in my life. 😌🙏✨🧡✨", "soul_thread": "Atavian?", "rebeccameital": "You inspire me every day.", "onwrd_upwrd__": "Thank YOU!!!! I love what you’ve done. What you’re doing. I know you’ve helped me and so many other people.", "chaseelizabeth": "❤️❤️❤️", "lindsaydgoebel": "I decided to heal my anxiety and pain this summer and it has changed my world. I'm so happy that the stigma of nourishing mental health is fading. Thank you for sharing.", "emilyrajeh": "Have you tried ketamine infusions or mdma with guided emdr sessions? For the latter you’d have to find a safe source of medical grade mdma and a very good practitioner. Ketamine infusions or even the nasal sprays are being used for medicine resistant depression bc it really works—amazing results. Worth looking into. My bro is in psychiatry and our fam has history of bipolar and clinical depression", "beaudoin": "You’re a super star ⭐️ so many congrats to you!", "bethyglynn": "I’ve been following along and trying to get to a place where I felt ready to commit to this myself. Today’s the day. Thanks for your authenticity - it’s often lacking here.", "birdyandpearl": "🎉⭐️🎉", "melinda_maxey": "Yes sister, darling!", "anemilyb": "You’re like the Sally Field of the Internet. We like you, we really like you.", "iam_nlh": "🖤🖤🖤", "lmaloof": "There is a quote I love, that I will butcher only slightly here, that seems fitting: “be kind, for everyone is fighting their own battle”. Or something. ♥️ People think that because you are successful, or beautiful or rich or or or...that your problems don’t exist, but you shined your light on this in a real way that I for one appreciate. Now you are dancing! Pure joy! 👏🏻👏🏻👏🏻", "shophydrokitty": "You are truly an inspiration for all of us struggling with mental health issues! I post things like this on my personal FB about reflection as I grow and some of my friends tell me I shouldn’t and that Facebook is supposed to be a highlight reel. I understand but I disagree and post my trials and tribulations to show others they’re not alone and that you CAN get through it. Please keep sharing life’s journey! 💜", "lindsaywarner_": "👏🏽👏🏽👏🏽 you are everything 💛", "wink_at_hannah": "Your strength and honesty are not only refreshing but healing.", "staceycisco": "❤️", "thelifeofcaitt": "♥️", "21ellebee": "Have a great weekend strong lady!", "lynnie.marrie": "Thank you Jen! You are an amazing inspiration. I have next level anxiety and think you when I breath through the panic - love you 😍", "32surplus": "I have loved following you 💕", "carolinehoene": "@ma_emma_bee thanks for suggesting I follow her all those months ago. Love u", "xoxolizza\nVerified": "Verified", "cbjnj": "Thank you for being so open and sharing your story 😌", "rosiewonders": "👍🏻✨", "ashkraus": "❤️", "love_you_more_xo": "@jengotch I’m sure you’ve said it somewhere at some point but since I don’t know can you let me know what name of medication you take?", "lcj1313": "✨🌊✨", "thenannyleague": "❤️❤️❤️", "preppygolucky": "You go girl 💪🏻", "themandycollective": "You give me hope!!!! The struggle is most certainly real and I’m so appreciative reading this and so impressed by your openness and raw vulnerability.", "cristenolsen": "This is so beautiful! I appreciate your openness and I can relate. Thank you. I love you. ♥️", "superzerk": "Thank you for sharing Jen. Taking my pills now ♥️", "duffwater": "❤️❤️❤️❤️", "glamchiclifestyle": "Glad ur on your way to healing. Depression is no joke.", "hollandcolvin": "💕", "ljskvarla": "Thank you for sharing your honest and vulnerable journey with us; it has been an inspiration for my own ❤️", "octoberhello": "We don’t know one another, but I love you. Thank you for sharing your “journey”....I love it. ♥️", "sewnyuhduhnay": "You rock! Turning your pain into purpose. Thank you. In it with you.", "bornandraisedvintage": "Thank you for always being real. Your openness is amazing and how well you put things in perspective is amazing. You have helped me be stronger in my struggle and I love you for that.", "ashley_lindemann14": "Obsessed with you and your podcast and your “journey”! It really is sooo eye opening", "emilybbb": "❤️❤️❤️", "katpfisher": "You have a great weekend with sweet wonderful you. 💪🏻", "jennyjiles": "Love you @jengotch", "gretchcope": "fuckin love you jen", "lstanford": "You inspire me on the daily Jen! I’m especially fond of your Trashdance™️ 😍🎶💃🏻🗑", "topanga_vintage_market": "🙏 👍 First thing I had to learn was that you don’t have to go it alone. Thank you for sharing your “journey” 😉", "maryeyke": "Thank you. Your truths have helped me gobs with my baby bird. Stay golden Gotch🤸‍♀️✨", "the_untrained_eye": "Congrats Jen, love that you are feeling well and happy. You have given a lot of people inspiration to go heal, your a good person! 😘🦄🌈", "bosswomenmedia\nVerified": "Verified", "adrixey": "Thank you for sharing so much of it. It's a great comfort to those of us who are also on this journey too.", "kaciemcmackin": "👏🏻💗", "kelsieinthewild": "I take one and a half little pills every day that helped me heal, and let me be a good mama. ❤️ There's no shame and getting better, whatever it takes.", "erikaamj": "❣️❣️❣️", "kikismustards": "❤️", "cindybmetcalf": "I love u!!!!", "gem_morson": "Your honesty is so refreshing. Thank you so much. Thank you.", "saltyseaspray": "@sterling.mackenzie dm her ffs", "larissaelliott": "Jen, you probably don’t have time to read all these comments but fuck it: your “journey” to healing and recollection of self has inspired me greatly over the last 12 months to do the same for myself. I was at probably the worst low of my life in 2017, after ignoring my downward spiral for 6 years. But I’m doing better now. I’m by no means 100% there but your presence and vulnerability and honesty about your journey has encouraged me every day to keep going. To do the work, learn more about myself, and keep going. And I really thank you for that. Anyway, I think “well” is a truly transient thing but I do hope above all, you get well, and well enough to keep doing what is right for you. That’s all. And really really Thank you.", "saramoon": "❤️", "marisdietrich": "💕💕💕", "callieanneclift": "You’re an inspiration 💕", "theodorable": "I’m so grateful for everything you’ve shared that’s made me feel less alone, and that I can make a comeback after debilitating depression. I wear the necklace proudly ❤️", "mrnelaaaaa": "💕💕💕💕💕", "busyphilipps\nVerified": "Verified", "jewelz1.20": "❤️ you.", "shmadmaster": "@kate.fae 💖💖👊🏼", "thetendertiger": "@jengotch you’ve showed me that a woman living with bipolar disorder CAN be successful in her career. Thank you. Thank you for sharing it all with us 💜", "hellbentonbliss": "♥️♥️♥️ to you. And 🙏", "vkceciliavk": "❤️❤️❤️", "trentmiichael": "thank YOU Jen 💕", "hoe_for_fdr": "hoping to have more of a journey this year!!!!", "procrastina_shan": "Xoxo", "carlyletourneau": "@jengotch you are helping to crush the stigma and for that, I nominate you for #herostatus ... also, I cry at work too 😉 #normalizingreality ❤️", "sbmaier": "Seriously congratulations! Your candor has given me a vocabulary for being more open about my “stuff” (that’s a technical term) and for that, I am deeply grateful.", "sarahreillyengel": "😍", "maryalessandraa": "Thank you for your honesty, openness and transparency. It is inspiring and helpful and I can’t thank you enough ❤️", "victoria_galvin": "@lighterboots she knew I needed this", "feral.kirsten": "yes", "hillsandgrant": "Congrats, Jen. You are doing great!", "mrsadriennebosh\nVerified": "Verified", "hippie_dee16": "Get it, gurl 💗❤️", "simplesimpleme": "I've loved following you and your open human-ness. I'm also enjoying what you've made of helping others through your Shop. ❤️", "k8eddie": "Your strength, and your weakness, is so empowering. Proud to follow you and support your business.", "nadiajosse": "💕💕", "cbmama4": "❤", "sparrowfox": "Super love you and your transparency around really tough stuff. 🌈💕", "kparrigo": "you may never realize the full impact that your posts have on people... but really, thank you (from the bottom of my heart)! 💛", "artbymonicacohen": "Love. I feel you. I am@on this same “journey” still. Using alot of things to avoid and numb it all. Still a work in progress but progress being the key word. You are a beam of light, so grateful to have connected with you. Knew that spark came from within! 😘", "yorebelwoman": "Many thanks.", "ohsarabeth": "Love you Jen!!!!", "mama.and.mads": "💓💓💓", "chananndler": "you and your posts and your podcast and your journey have meant so much to this internet stranger in louisiana. it also should be noted: listening to #jgok makes laundry and dishes way more doable 👊🏼", "angelaabrown": "Avoidance is relatable ❤️congratulations", "morgantwist_studio": "Thank you. Thank you a million times. I wear my bipolar necklace everyday, unashamed and happily explain what it means. ❤️❤️❤️❤️", "thefashionistfiles": "💖💖💖", "kessiekarg": "Love your heart & transparency! My proud accomplishment is Celexa 20mg/day 🙌 one of the best decisions I ever allowed to happen. Thank you @jengotch 💛✨", "bg3w": "🌈😍💙💕Happy weekend. You look. And sound fantastic", "emilieannevans_": "All the feels. I hit rock bottom last September. The downfall was incredible but once I smacked bottom it all changed from there. Proud to fight the good fight with my mental health 🖤 @jengotch @sarahrdz7", "nicholebigley": "Thank you for continuing to share your story. It has made me brave enough to share my own struggles outside of my “go to circle of trust.” And for that I am forever grateful.", "prisci_r_s": "💞", "amyrosestudios": "Celebrating with you!! 🎉🎉🎉", "gabi.lemoncello": "Yass!! I love you so much!", "imlauramiller": "💕", "getadvancedchic": "💕💕💕💕🙌🏻", "k_mayn83": "Can I ask what you take? Bipolar management is an art", "26andnotcounting": "The humor laced in here is why I love following you ❤️", "katielooou311": "I just started what I think is my new journey the first week of November! And told my therapist earlier this week I’d like to avoid the word “journey.” Can’t explain it. 🤷🏻‍♀️", "cristinafoos": "💕🙏💕", "southwesternbelle": "❤️❤️❤️❤️❤️", "kodeofkondukt": "❤️❤️❤️", "flowerstorygal": "Thank YOU Jen! You make us all stronger. Love you ❤️", "karenkimmel": "🙌", "hnnhrhr": "💞", "se_leena1": "❣️", "violetandpercy.co.uk": "💜", "denise_dakar": "Wonder why nobody asked so I'll do it: What's in that pill?", "luccacouture": "💕💕", "alexa_grey": "What is the pill?", "srfchk17": "Thank you, Jen. So so so much.", "dolimaffi": "Linda linda linda !", "imsurco": "We are proud of you! And you keep inspiring us!", "crazykt81": "💚", "sarahsteffan31": "💕✨💕✨", "sahraxto": "❤️❤️❤️❤️❤️", "sharonteuscher": "You’ve helped so many people better understand and recognize their own pain, and helping to begin their own “journeys”; including me. And for that I’m thankful. Your voice in all of this really matters and from the outside looking in, I’m so happy you’re feeling better. 💛", "lalalady1": "🙏🏻💖🌟", "kelliecockrell": "❤️❤️❤️", "sabinecamille": "Thank you for being so open ✨❤️", "sercoke": "Congrats!💗", "karen.in.the.citay": "Love you- you’ve already helps me so much", "nancyvalladaresm": "You are such an inspiration to so many. Thank you!", "jeanettehargreaves": "Congratulations. Cheers to Recovery. Our coping tools work until one day they don’t (been there). 💖", "shannonrostin": "❤️", "sheguidestheway": "You helped me see shit (a lot of anxiety) in my own life I wasn’t willing to see. Thanks for being open and shedding a light on what was going on with you. This is how we heal ourselves and others all while doing it with a lot of humor & emojis. 😊☺️🥰", "prettycrabby": "Thank you for everything you have shared. On Monday I was three days into a panic attack. I left work and got in a Lyft and went to my doctor with no appointment and no plan. But I thought of you and your journey and I thought I was OKAY to be vulnerable and ask for help. They diagnosed me with severe anxiety and put me on a two week medical leave. Today I took my first anti depressant / anti anxiety med ever. You have helped me feel that it is not only okay but important to seek help. You made a difference in my life. ♥️♥️♥️", "dr_wolfsburg": "Good for you! This is a extreme inspiration!!! ❤️❤️", "flowersandgarbage": "Love you Jen. You’re an inspiration 💛", "miracutuk": "Enjoy your Reiki journey! I started mine over a year ago and it’s been the biggest blessing to live with an open heart in my own authenticity and help myself and others as they do directly intertwine✨loved reading this because 1. I think your just amazingly awesome and 2. Had my first sessions this morning at a legit office and not in my basement! Energy healers unite 💓✨💓 sending much positive energy your way ✨", "meghansmolka": "Thank YOU ❤️", "kaitiewade": "You’ve inspired me so much on my own personal mental health journey and for that I’m so thankful. Thank you for teaching me I’ve nothing to be ashamed of✨", "uglyducklingdiy": "So glad you’re healing!", "stableish": "You are a true inspiration! We love you.", "anacguinand": "Thank you for sharing this 😍", "paristwotrill": "your transparency is beyond. thank you for being the energy that you are, imperfectly flawless 💕💕💕💕", "wonder_renee": "🙏💕✨", "bethanynauert": "👏🏻", "emptynester2018": "Yay for you!!!!🤗", "medhamukerji": "Have a great weekend you too @jengotch", "searching_for_cherie": "Keep kicking ass woman! ❤️👊🔥 Quiting alcohol has done wonders for my anxiety and panic attacks.", "_gulnazgulzar_": "🤗", "_amandakrueger": "💛💛💛", "kates_bailey": "So glad you turned me on to her! @alexa_mosser", "mainstreetmodern": "My we all find happiness", "pilatessally": "Happy happy year of your non-journey journey. I’m striving to be the Jen Gotch of the Pilates world. Whatever that means. 😘", "laurelanneb": "Love you so much!", "jillianmorkan": "Go Jen", "vanessagarciaacosta": "🧡", "meeshsmiles": "So happy for you and how far you’ve come on your journey. Thank you for sharing. Sending Love to you! ❤️🙋🏻‍♀️🤓", "swood_1983": "A true metric of resilience, congrats! ❤️", "dr.christina_": "Thank you as always for utilizing your platform to raise awareness around mental health!", "natalielaura": "🧡", "tgsuiter": "Have a great weekend back!!", "antonia4eva": "Thank you 💛", "mindfulmigraine": "♥️♥️♥️", "nicole_marie123": "You're just wow", "xo_kristimeow": "You’re a constant inspiration in both mental health and business! Thanks for everything you do!! 💕✨", "wilsoninthemiddle": "@jengotch I am having a hella stressful and anxious time lately, and I just thought: “man, a video of Jen Gotch dancing would cheer me up right now.” Just saying.", "gittih": "💪🏻", "meowandforever": "Your strength gives me strength.", "mod.365": "💕", "finefam": "❤️", "hillarymeadows": "❤️🙌🏻 Thank you for this. You don’t know how much you help me.", "ariellasharf": "You are my idol and inspiration to keep going ! 💕😘", "maryannsbetter": "Reading your posts like this has been one of the things that has helped me stick with my own decisions to heal and to accept, understand and cope with the issues I’ve ignored for so long. So thank you.", "studio.mansour": "You are rocking it Jenn!", "shazi_la": "❤️✊🏽", "mommagerlynz": "You’ve been and continue to inspire me", "ashleybrooksawyer": "Thank you for inspiring me everyday with your strength. Listening to your podcast in my car, in between work, has been a real lifeline. 💕", "inkalloy": "💞💕❤️"}