{"avengeginger": "Jen, I was married for two years and it all fell apart right as my grandmother was dying. The \"I feel like I'm just happier alone\" conversation (from him to me) happened the day before her funeral. Even though I knew it was over, it should have never begun, I still felt like he should have been there for me. So many things about my experience were likely less than yours, but I KNOW you are doing the right thing.", "ashleydcrowe": "You continue to be a hero in my world. You are real, you are brutally honest and know how to interject humor at just the right moment. Hoping you stay above a 2.5! You got this Jen Gotch! You got this!", "sudbudz": "Fun account!", "ajleeson": "I can't find a dick emoji so here's a eggplant 🍆- it's sassy and purple. sending you 🌈💕xx", "jessicadaviesmetalworks": "Wishing you strength and sending lots of love. Good luck, Jen! ❤", "groundedkidswear": "wow 😍", "jessicajenkinsfieryheart": "google the jetlag diet, totally helped me adjust when I flew half way around the world instead of being a wonky mess", "prettycrabby": "Love to you. You are great for just being there and that is enough.", "kate.pederson_": "I found myself in a similar situation a few years ago. I was recently divorced after a really rough split. I was stressed to the max at the thought of facing his family and going through the emotions of it all. I was pleasantly surprised at how much his family appreciated me being there. It was cathartic for me, and give me some closure with his family as well. Big hugs lady. You'll be glad you went when all is said and done. ❤❤", "amy_fay": "I am 30, but sadly have a lot of experience here. So much so that I can say I've tried different things. What I've learned, beyond any doubt, is that the best thing you can do is show up and get okay with things sucking. Give permission and space for everything to feel shitty, but stay close. Acknowledge that it's bullshit and it sucks and you'll still be there even though you don't have anything to say that you think might magically make things feel better. Then, in three weeks or four weeks, when all the food that was brought has been eaten (I'm southern) and the flowers have died, still be there, being you (the same you you've always been, no surprises).", "hayleygolightly_": "💔😔 sending you some good vibes and a big ass hug, lady.", "so_cal_belle": "You are so completely open and honest and I'm so sorry you have to wade through the emotional swamp right now. Truth? You got this. Don't worry about the words. Just be there. Don't worry about the feelings or the depression. These are roads you have driven before, which means you know how much they suck, but it also means that you know the way home. Keep being so openly and honestly you. You are a beautiful soul. You can't lose yourself if you are being yourself. ❤", "spacedesignbuild": "🏠 💕", "le.voile.sacre": "My father passed away in January. You will have strength and healing going to AUS. Get some you-time to explore/ be with nature, and pajama time too. Depression may trigger or worsen if you don't go, but ultimately it's following what your soul needs. It's a tragic circumstance, but times like these are usually accompanied by something serendipitous/magical. Good to honor your ex-father in law as well. Follow your heart, but you may be thankful you went. xx", "twinkies_and_beans": "Hey! Call me if you need an outlet! We can go garbage shopping. I'm in Melbourne. Then Sydney after 3/20.", "tiny.ribbons.studio": "⬆⬆⬆Joke 4u", "lesissomuchmore": "❤️💔", "bayberryandmain": "Very cool 😃", "danablovely": "Sending love and support your way. My ex husband's dad also died while we were getting divorced. Its such a terrible and confusing situation. I hope everything went ok for you!", "galexina": "❤", "jackiejuaristi": "@venus__felix", "janelleburron": "You are so precious and strong! I don't know your story but found you via insta from those @streichersisters cause I like Mandy Moore and This Is Us - but anyways.. thanks for your vulnerability. I believe in you and process. You're a powerful person! Feel pain, don't run from it. It's better to go through the healing and get free than to always find yourself back in that dark place. You are a wonderful, beautiful beam of light! Own your life. ✨Be who you are! 🌞Bless you on this journey. 🌻💛", "mentaylunares": "Love this! 💞💞", "collsco": "Love your page", "9thletterpress": "So proud of you showing up. It's ok not to have the right words. You being there is enough.", "shigga4": "When my mom died, all I wanted people to say to me that they were so sorry and how unfair it was and tell me stories about what they remember about my mom. 💚", "erios69": "Just 'be there' .. I think words help.. but to feel your support and love .. that is what helps..", "lisamontgomery22": "Thinking of you and wishing you the strength and wisdom to navigate this moment. My dad always says that an abnormal response to something that is abnormal is normal. Be kind to yourself and allow yourself to express your emotions. They are certainly valid in whatever form they come to you. Take care and safe travels. 💕", "roxyluvsya": "\" Fear not, for I am with thee.\" -God 😄 Basically, don't be scared--the God of all the universes has got your back.", "sonflowerchic": "❤️ I'm so sorry! Thank you for the joy you bring to our lives. Be scared, do it scared. Feel it, you'll be okay. Prayers girl", "loop_group": "You are so beautifully open about the ups and downs of life. I love following your feed. I hope that the coming days, weeks, months are healing for all involved.", "meredithalexander1010": "You are so much stronger than you give yourself credit for! 1.) You made the plan to go, 2.) you went! That's a lot in and of itself. You are DOING it, and by doing it I mean kicking ass at life and being so beautifully honest.", "thefashioncookbook": "💗🌟", "jamiehoush": "You're great. Hugs ❤", "prisci_r_s": "💞", "madmommaevents": "The British have a cake called the spotted dick. And they say it like it's nothing. Spotted dick is good.", "rowdeezy227": "You've got a lot of inspiring and empowering words here to feed you. Like can be so ridiculous sometimes(my husband of only 47 passed 4 months ago and dealing with his family causes no small amount of anxiety,); but remember to breathe. You are offering your wonderful support, but people experience grief so differently. Accept that and carry on when things get thorny. Breathe and remember it's their grief and you can't fix it. Hopefully things will not get thorny and you can all support each other during this sad time.", "joanwlabelle": "Thinking of you and Andrew, Jen. It's not the words you say, but your presence that will bring healing to the heart.", "tippysunridge": "I'm not really sure you'll see this post if at all dot dot dot - you, lady, are such an inspiration and like overall life goals for a lot of people, including myself. I read your posts and I'm like \"YASSS SAME.\" I appreciate that I can see that in someone else in the world and even better, someone amazing, creative, successful and super bad ass like you. 💕💕💕💕", "bee_lane": "So sorry for your loss and for this awful time. Hoping you find peace and calmness on this trip. You're strong and can do this! 💙💪🏻✈️", "cmettling": "I don't know you at all, but the bottom line is this seems to be the right thing to do....might make it the hardest thing, but doing the right thing always eventually feels good.", "heykellyrose": "Sometimes showing up is all you have to do. 💕", "meganfotog": "I'm sorry for your loss. It's wonderful that you're able to be there. Agree with @heykellyrose", "jillithwin": "Sometimes the right thing is scary and hard but as someone who lost a parent, the support you get from anyone is always appreciated. I'm so sorry. Sending you hugs, pink skies and good vibes. Hope you and yours can reach some peace in this time of loss 🌈✨💕", "mondaymoodmaker": "❤", "belbreen": "@jengotch ❤️❤️❤️", "sustainablerainbow": "Sending good vibes your way!❤❤❤", "the_robinski": "I see that over 5,000 people have liked this post. That means that there are 5,000 people that are standing with you and supporting you! You can do this. We believe you can do this. You always bounce back ..and you will from this. I'm sorry for your loss, for Andrews loss.", "pureluxeapothecary": "Have you read 'The War of Art' by Steven Pressfield? It's a quick read, broken down into super short little chunks. And it's full of good stuff on blocks and 'creative battles' - totally transferable to entrepreneur life and life in general. Also check out 'Pussy: A Reclamation' by Regena Thomashauer. Girl power 💪🏼💕💋", "nightfire_atelier": "Hope you have a great day! 😊😊", "erin_b_warke": "💞💞💞💞💞", "miss_kristen": "Also, question: What's the worst thing to hear after giving Willie Nelson a blowjob? Answer: I'm not Willie Nelson. 🙊", "pineapplesandprettywalls": "🍍🍍🍍🍍🍍", "chelseamariemeyer": "❤❤❤❤", "opinionatedjacqueline": "I'm so sorry. Sending you lots of love and blessings. ❤️❤️❤️", "instatracey": "Heavy sigh. You are an amazing picture to me personally of one who presses into all the mysteries and agonies and glories of being human, with a color and wit and HOPE that never relents! Thank you for being that person. Be encouraged that being there for your family, however complex or messy it may be, is a gift! And a great act of love.", "mvdelsen": "Wow that is so courageous of you to do it even though you are scared!! You should give yourself credit for that because that's amazing and a lot of us would let the fear and anxiety get to us. Sending you love! 🌸", "soulshinebk": "My dad recently passed and the best thing you can do is what you're doing. Just be there. You'll be grateful you were in the end of it all.", "linayabunbury": "Praying for you to be surrounded in peace.", "brookespreckman": "Put it this way, right now you're not scared. Right now you're the person that needs to be there and doing whatever someone else might need. Make that your mindset and you'll be ok. I've dealt with way too many very personal deaths and I'm only 25 years old, and I know that if your mindset is to be strong - you will be. You got this.", "denisecrew": "Oh man. I hope you can fill yourself up with an inspiring book, funny movies and magazines filled with artful images to keep your mood up on the plane. And just remain present while there. Just showing up is enough and says all you need to say. Sending love! 👊🏼🌠💕", "vivpak": "💕", "michelleeblack": "Words are not important, no one will remember them anyway, they will remember how you make them feel. Just be YOU and be present. When it feels a little overwhelming say to yourself, \"Move a muscle, change a thought.\" meaning to shift your mood, DO something or force yourself to think of a good memory or your favorite book. You got this. Its just life dealing its cards!💕", "maxzoelaw": "👆 words aren't important. Presence is.", "rachel_morell": "I'm with you.", "sparrowfox": "When you feel like you can't go one more step, remind yourself that you've survived 100% of the shitty things you've been through in life so far and you've always been ok- sometimes better than ok. You're going to be back to glitter and rainbow balloons just as soon as you get through this cloud bank. Keep going. 🌈💖🍾", "imlauramiller": "Ugh I'm so sorry", "lydeenhandmade": "Ooof...sending love. Just the fact that you're going tells me you're strong. Know that! Just be you...that's enough. Much love to you...", "bneatobar": "I'm so sorry Jen. Sending you many hugs ❤️", "leefromamerica\nVerified": "Verified", "normajeanevela": "SAY that you're sorry he died. FEEL sad that he is gone, if you cared about him. DO the things in your toolkit that counter depression: drinking plenty of water (not alcohol), eating right, moving your body, one-minute meditations every chance you get. And then SLOG through it because Australia has terrific seafood (love the \"bugs\" there and oysters to die for - well, not literally). - advice from old lady, chronic depressive", "ettatorials": "Sending you 💗💗💗💗!!!!", "csam831": "We are here for you, friend. When you feel scared or sad, please know that we are here to listen and offer support! You are an amazing lady, they are all so lucky to have you in their lives! ❤️", "fleamarketfab": "You got this Jen... you are a true boss lady, incredible human being , and balls to the walls and asses, hilarious!!! Sending you all the love and hugs a chic from Ohio can!!! ❤❤❤", "trilalat": "I went through something similar during my divorce. Your divorce is like a death in a way also, so you have the ability to experience empathy. Your love for his family doesn't die even though your marriage didn't continue, don't forget that. Show the great love you have in your beautiful heart and hold your head up high. You are an amazing woman and can prove you have strength beyond this pain. Please, also, don't forget the support you have in droves in the community of women who stand behind you during this time. We love you, we care about you, and we are cheering you on.", "slhicks417": "Just a little FYI that is not what you asked for but thought it would pump you up a little, I got my bangs cut like yours because you are adorable! Thanks for being my inspo for cute hair, more importantly, thanks for being real and sharing your life.", "bambwhat": "Love to you.", "laurenkostercreative": "💖", "robinsoncurt": "You mean conscious uncoupling. Listening to wavin flag is always a good way to get yourself to feel stronger!", "ampersandstudio": "Hugs 😘", "b_blove": "Everyone is grateful for a familiar face and someone who knew the person who passed, at a time like this. I have been here. You will be ok because you have always been ok -- that's what my dad always said to me.", "yolanda_creative": "The most beautiful flowers will grow bigger and stronger with the help of a little bull shit.", "daramadylen13": "When the cannibal was late to the luncheon, they gave him the cold shoulder💓", "mamainbloom": "This is obviously not the right thing to say but you share all the weird/scary/emotional/crazy person moments with us & not only do I identify with it all but it makes me feel empowered. I'm a lot like you & watching you do all the hard/scary/successful/creative/beautiful things despite it all gives me hope that I can do the same. You've built an empire using all the colors, thanks for always showing us yours 🌈", "littleshutty": "When times are tough I blast out the Foo's and remember that \"it's times like these you learn to live again\" ✌🏻❤", "cbrenn316": "It's an amazing thing you're doing to be there for him. Take it one minute at a time. Be sure to stay true to yourself and if you need a break take it. Outside clear your head or go grab a glass of wine. You are truly someone special!! Hang in there! Sending positive vibes and healing thoughts your way!! 😀😙🖒", "cloverhunter": "Also, sometimes life is bullshit and hard, too. Hang in there.", "crowyrose": "Don't stress about saying the right thing, there isn't a right thing. Cry with them & give lots of warm hugs. Let them do the talking. Staving off depression is so personal for each individual, but it helps me to not really think about myself in those situations - like, this isn't about me & how I feel about it all. Maybe not the healthiest but 🤷🏼‍♀️. Also: I bet blind people don't skydive bc it'd scare the shit outta the dog. Good luck xx.", "seefuego": "@jengotch sending some love from NYC. You are amazing! Don't beat yourself up. You are a source of light and inspiration in this often confusing life. You have no idea how many people's lives you've touched. Always remember that!", "confettiandco": "8=========D (for you in your time of need)", "tristenjnelson": "There are no right words in these situations, but take comfort in the fact that you being there speaks more than words ever could. If all else fails, look at pictures of puppies. If I could, I'd ship you my little Penelope 🐶 Also: always remember - pink skies ahead! 😘", "ashleygoldenrule": "Puns always help me. Even if I just say them to myself in my head & chuckle all alone like a goof. HUGS GIRL! Divorce is SO FUN 💃🏼", "splendid_rags": "Man you have a big heart. What you described above is the definition of bravery. I'm so sorry for the anxiety you're experiencing. Lots of love and positive thoughts for you now. ❤️", "azcostello": "How sad. But it's really wonderful that you can be there to support him. Deep breaths, try and get some sleep.", "hunt.and.scavenge": "Dick jokes are so old...I mean cum on! 😊💕", "rosiemartian": "Welcome to Aus!!!!!! ☀️🍕🇳🇿", "kgathany": "I'm sorry. Sending you strength. 💕", "wildeyed.shop": "Recognize and accept all of the feelings you're feeling and don't try to push them aside. It's ok to be scared, angry and sad. I'm sending you love and healing vibes.", "aklimton": "You are so kind to have decided to go half way across the globe. You will get through this ❣️", "sidracarder": "Oh gosh I'm so sorry you got this girl 💗", "teruterubouzu": "💛💛💛 🙏🏼 You will find the right words. I am very sorry for your loss", "cleloutre": "❤", "anxiety_piglet": "When my dad passed away two months ago, it was the people that showed up, spoke up, and just let me know they were thinking of me that made the most impact. You physically going to be there for Andrew is incredible and he'll never forget it. You're allowed to be at a loss for words, and scared, but just know that it's okay. Thoughts to you and him both. ❤️", "thesusanp": "You are an amazing lady", "lacesinyourfaces": "I'll get back to you with an epic dick joke 💕", "honeymyheart": "Sending love ❤️", "misscrispy": "It's ok to feel all those things, and everything in between. Life can be painful and beautiful all at once. Sorry for your loss (all of it). Big hug.", "mariamandani": "It's okay to be scared.", "winkwinkstudio": "Am I the only one who's going to tell a dick joke? Ok: what did the right nut say to the left nut? Don't talk to the guy in the middle, he's such a dick. ❤️ Sending good feelz your way during this hard time, you got this, magical unicorn.", "tmelitaphotography": "It is beautiful you are going!!! May you find peace! I'm sorry for you both and completely understand as my hub and I have had 5 years of death and hospitals and it's taking a toll. You are not alone!!! Thinking of you and wishing you well💜💜💜", "kellyshewmakeup": "Oh no!!! I send all my love, healing, hugs, to Andrew, his mom and you... 😢", "_kristina.palic": "You are an amazing woman! I constantly admire you, every post, every instagram story.. With the depression taking over you and your actions, you wouldn't be able to do all of this. So, stay present and stay with yourself - because yourself is awesome! Yeah, that's what she said. Much love from Serbia. ❤🍷", "mollyhunter": "Sending love💗", "calliopepaperie": "You are brave to put Andrew's feelings before your own fears. That's love. So sorry for your loss Jen.", "positivelypresent": "I'm so sorry for your loss, Jen. 😔 If you search \"loss\" on my site, you'll find a bunch of articles I've written with my best advice. Also, you might not have time to read, but @emilymcdowell_ 's new book, There's No Good Card for This, might have some good tips. You're really brave, much braver than you probably think. (Also: my autocorrect just changed braver to beaver, so there's that. Maybe you're much beaver than you think. 😂)", "fortheloveofcoookies": "What did the O say to the Q? Dude, your dicks hanging out!", "gabycacheris": "so sorry for your loss. You are in my prayers!!", "ddot": "I am so sorry. If you need anything when you're here, please let me know. Showing up is so scary and this is going to be hard. I'm hopeless and don't have any jokes so here's a smile from down under 🙃", "dakotalbarber": "❤", "nicolecostello_": "You are so brave 😘", "mostlymilaandknox": "You just showing up speaks volumes. You got this ❤️", "karinachamcham": "holy crap good luck!", "thehendersonsshop": "💛💛💛💛", "abbywakerley": "Grief is a shitty part of life. It's scary. It takes you to unknown places in your life (and mind). It's also necessary. It shows up when you're not expecting it and makes you turn up in your most adult capacity. You'll find strength somehow. But you will need rest and recuperation afterwards. Look after yourself Jen. And keep checking out @dicklatte.", "daphnagabay": "The fact that you're flying halfway across the world says more than words could ever say. Stay strong! ❤", "dicklatte": "I got you @jengotch 👊 hit me up if you've got any special requests xo 😘", "maggiediprima": "You are showing up when it counts no matter what. That's brace and strong and amazing. Sending love and light to you both. Safe travels", "jaclyn_bond": "I don't know you but I know what you're dealing with. My dad died and in the same week my partner left me, but he didn't have anything close to the compassion and courage you're showing. If I can offer any insight it's to simply make things easier in all the little ways available to you. Making food, cleaning up around his chaos, laughing at his inappropriate jokes and helping facilitate family time without needing to take a starring role in it. His grief over both losses will manifest in weird and unexpected ways and all you can do is be chill with it and show love. Good luck and look after yourself as well. ♡♡♡", "alithompsn": "You don't need to say much. Just being there speaks volumes. ❤", "emilyannspeakout": "Sending love & prayers. ❤", "chefrebeccaclarke": "❤️🙏💯", "kristenhutchinsdesign": "I'm so sorry. I'm so sad for Andrew. :(", "thisintelligentbody": "It's a brave thing to feel your feelings. Your postings are right on and I appreciate how you show up in your truth💕 and your followers are cool too", "danielavc": "I'm sorry about your loss. My heart was heavy just reading your post. But I have found that during dark times it's necessary to find hope and hang on to it until the storm settles. As is the saying \"this too, shall pass\", there are unicorn pool floats and holographic clogs at the end of the tunnel. I don't know you personally, but I wish you the best. Your brand brought joy to the arbitrary in my life. 💜", "el_camyino": "❤ + 💪🏼 to you", "deluxefurnishings": "I'm so sorry. My dad died too, and people often didn't know what to say. It helped to hear that other people shared my grief, or understood how terrible a loss it was and how important he was to me. It helped to hear that other people had experienced the same pain, and managed to feel better one day. It helped when I knew I was among friends and could burst into sobbing fits of tears if I needed to. Your being there will help more than you know, even if you can't find words of wisdom to share. Find courage in knowing that.", "melody_botha_sullivan": "You are strong. You are brave. Your heart is so big. People feel loved by the way you simply show up. Just your presence in the room brings relief and light. You're an incredible friend and an all around incredible person. You'll know when to speak and when to simply be. There's no pressure to be perfect, just be. Just be present. Sending strength over your heart, peace over your mind, and love over your entire being right now! ❤️", "kitchentablenw6": "You're showing up which is an incredibly lovely thing to do. Now don't start making jokes about death and follow it with \"too soon\" as a good friend of mine did days after the death of my dad. Be supportive, and feel good that you've gone all the way over there to show you care. Death can be cathartic as you tend to be distracted by everyone else's feelings, and so you don't dwell on your own. Come back and eat twinkies for days xxx", "instantlychristi": "I think what I love most about your bravery is that we all benefit from it. I find courage and strength from your posts and then again from your followers comments. Don't forget those damn compression socks girl.💞love and light from Maui🍍🌈", "essebest": "Don't think you realise how brave you are 💪🏼💕", "laurrenwelch": "Sending you a whole bunch of lovey vibes because, well, life just really blows sometimes. ❤️", "zilahdrahn": "you got this. your a 100% babe 1/2. 100.2 you got this", "scony16": "Much ❤❤❤", "lizperezartist": "@jengotch I wrote this for women everywhere who are going through tough times. I hope it helps you too. Always remember who you are. Much love 💜 https://instagram.com/p/BPyYG5NDyg5/", "kymbosmith": "Ok here's a dick and travel joke for ya \"Confucius say man who walk through aeroplane door sideways is going to Bangkok\".", "constancezimmer\nVerified": "Verified", "xantheb": "❤", "bn1029": "\"I would literally rather be punched in the face than tell the entire class a fun fact about myself\"", "natplays": "No one knows what to say. Being there is enough. Saying the wrong thing is ok. Everyone is afraid. No one likes to talk about stuff because they think they'll say something wrong. You won't and if you do you'll give them a hug and say sorry. And @veronicadearly probably has made the card you need to read today and i'm sending you loads of love and laughter and to Andrew...and also thanks for saying your truth and freeing up so many others of us to do so too (myself included).", "kath_kc": "Be proud of yourself that you had the courage to go. The courage to face those fears head on knowing what the trip may trigger but also knowing that Andrew 100% needs you. If you need your community after this journey, we will be here. You've got this!!", "milkonfridayzzz": "💚", "amarivz": "You are my role model you fucking goddess, you are going to be fine. @jengotch", "laurenconradco\nVerified": "Verified", "alexiastruye": "Sending ❤️. You're being true to yourself! Go for it :-)", "courtneyrenea": "❤💙💜", "susanpola": "I think go with your gut and say what you feel. You can do this you are amazing", "marissa.morgan.jimenez": "❤️", "so.kayle": "You are so strong and capable 🌸", "laniako": "love you", "curatedcalifornia": "SELF CARE. you do you. feel your feelings. you showing up is LOVE. then take really good care of yourself. rest. food that nourishes you. create moments that make you happy-watching a sunset, a sight-seeing moment. create calm with a bath, a walk, a swim. check in with your senses as a way to stay present. what do you smell, hear, taste, touch and see. if your feelings get too intense: ask yourself- did i eat, drink, sleep, decompress enough today. make sure YOUR needs are being met. ✨🍍🌴💋🍾", "nooncolors": "Thank you for being brave enough to tell us what you are scared about. Lately I've started telling myself, \"I'm going to feel every ounce of pain that comes up today\". It's very powerful to feel committed to that. And I know feeling it now means not carrying it around with me past the moment it happens in. Anyway, good luck. Beauty + pain seem to go hand-in-hand sometimes.", "holidaypalms": "Sending 💗💗💗 and safe travels.", "j.emmalee": "You have the best most beautiful soul! Watch some broad city for the best dick jokes and all the jokes and feel what you feel girl. You're strong 💪🏼", "lauravalmai": "Good luck. You're amazing", "vaudevillebb": "So much respect for this post. Thank you for being so real. Also these 🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆", "marleyrvawter": "🌈🌈🌈🌈❤", "elleebeans": "You got this girl <3 Sending you positive vibes.", "drea112680": "\"It's only after we've lost everything that we're free to do anything\" - Fight Club quote", "sonya.harriman": "You are strong and can handle anything! Sending love to you, Andrew, and his family. Also: 👉🏼👌🏼 #thatswhatshesaid", "shoplespark": "You're incredibly brave to travel and show up and just be there, regardless of everything else going on. You got this. Sending you tons of love and light. ❤️", "mermaidsandmeows": "It's okay to be scared, it's normal to be scared. I appreciate your honesty & I'm sending you lots of good vibes. You got this. Take care of yourself & those around you.", "steffaniehalley": "Lots and love and positivity to you and safe travels. This is a big deal and you're being a big person by going. Good vibes only to you!!!", "lizzymac83": "You're amazing and you're gonna be ok x", "jendiamond": "Just your being there with them is an enormous contribution. Listening during times of grief creates space for people to express what is there for them. You are a gift even when you have no words. Your being is enough. Get rest when you need, drink lots of water and let your courage grow every day as you face what comes your way. So much love and light to you. 💖💖💖", "barretmckay": "How many knees does a man have? Three! A right knee a left knee and a wee-knee!!! Thats all i got. Sending you lots of love and good vibes from newport beach. You are an amazing human and i love following you here. @jengotch", "belindaleegrant": "I'm so sorry to hear. I'm sure Andrew will be ever so appreciative of the time you spend with him though. Also stop in to Brisbane and say hi 👋🏻", "itsmekimshaw": "💖", "carissacrystal": "Stay strong girl. And if you don't feel strength in any form, just keep moving forward anyways. ❤️❤️❤️", "pariskaren": "It is what it is. 🙃 no way to do it but go through it! 🍋 👓 🍋 ❤️ ❤️❤️❤️❤️❤️❤️❤️❤️", "sawatkins22": "You are a badass rockstar!!!! You are so loved and supported.", "floradesigns_taralouise": "Where in Australia? It's still hot and sunny in Qld, so that's a silver lining 🙄 sending thoughts, light and love to you all xx", "rachaelmary_": "Australia is a beautiful place and everyone here is very friendly and welcoming and Andrew's family will be so glad you're there to share this time with them. Remember you're doing it for him, so focus on him and that will keep you grounded and keep the fear away ❤🌈", "luckyandi": "💕💕", "liquidmuse": "I will commit to sending you random weird/dirty memes via DM if welcomed? 😂💖😭", "jennels": "A wise man once told me that 88% of life is showing up. You got this. 👊🏻❤️💔❤️", "mooandtheezoo": "There are no greeting cards for this but you can push through the fear, show up, & honestly for me the biggest help was when people just listened ~ it's ok not to know what to say (spoiler alert: nobody ever does) ❤️", "thejunglefish": "Sending hugs and light and more hugs ❤❤❤", "elilley07": "Hang in there, girl. You're going where you need to be. The words will be there too.", "jaclynrjohnson\nVerified": "Verified", "amsterdammodern": "❌ and 💋to andrew", "weird_eyes": "Sorry for how muddled and sad and confusing that must all feel. Wishing that it goes as well as it possibly can for you.", "ktyprry": "Sending so much fucking ❤", "rachmcgarry": "Not to diminish the bad stuff you're feeling right now... but this is seriously beautiful. What an enduring expression of support and friendship. Proud o you (forgot the dick joke so here's a classic: 🍆🍆🍆🍆🍆🍆🍆)", "bethydavidson": "All I can say is thank you for being so transparent! You are in my thoughts and prayers! 🙏🏻☺️", "joanna_t_u": "@jengotch ❤️❤️❤️❤️", "teamwoodnote": "oh lovie. sending love.. this is a toughie. not sure where you're going in oz, but i'm in melbourne til the 21 if you need a hug or a drinking buddy. xo", "gaby.126": "Nothing like being honest, he knows u and will totally get it if u dont know what to say in moments like this. Just being close to him will make things better 💕", "tracieann": "You have many a follower on here that would love to help any way we can. We're with you in spirit. Take all of our rainbows🌈🌈🌈sending virtual rose quartz hugs to Australia💖💞", "thegreenbeautymom": "Jen I remember sitting at your desk during honor roll and I was seeking about starting my business, and your responses were infused with such warmth and wisdom. There is no way that a person who has given to others will not be protected by the positive functions in the universe at a crucial moment.Thank you!! I only met you once but know from that encounter that you possess the Never Be Defeated spirit!!", "sortner": "There is no solving this or finding the right words as the best thing you can do is be by his side. Good on you for taking this trip.", "apricot.floral": "Get yourself a Mouth Mimosa and make the journey short and sweet ..... 'that's what she said'. Woof.", "persikadesignco": "I'm so enamored by your strength & courage & by how you show up to your life in every way.", "natleah": "You are SUPERWOMAN. I don't even know you but I'm so proud of you! How amazing you are for doing something so off course and out of your zone. Babe this too shall pass. You got this, I promise. ❤", "caffeineismysuperpower": "I have no words of wisdom but you're in the thoughts and prayers of this gal following your story.", "thestyleaesthetic": "😘😘 you're amazing! You should detour to New Zealand 😉", "chefwivesclub": "Continued.....I'm just saying. You are out of the hole you were in. Bring your step ladder so when you return, it'll be easier to get out again. 😄😁", "krystalkat": "Thinking of you Jen during this difficult time🙏🏻💖💕💐You're stronger than you think!", "katyerayburnpurses": "💖💖💖", "niciblueeyes": "Sending all the magic 💫", "lzpencils": "Follow your ❤️ @jengotch! It sounds like you already are!", "kandycecarroll": "I'm so sorry, sending good vibes your way 💞", "dawndicarlo": "💜 u @jengotch", "ohjoy\nVerified": "Verified", "jette.scherzer": "MUCH ❤ girl!!!!!", "ace_ofgrace": "There are no problems, only opportunities - this is my life motto, taught to me by my mother and believe it applies to everyone and all circumstances. You are now in uncharted territory and it will take a great deal of internal and external strength. Remember you are capable and you will find a new parts of yourself though these moments.", "creativemiddle": "Wishinh you strength to get through this. ☺", "miriam.vegac": "Sending you strength 🙏🏼💖", "hokiehanna": "Your willingness to show up demonstrates the love, strength, and resiliency within you. Keep doing your best (and look at those dicklatte pics whenever you need a little smile-inducing, anxiety-averting shot of girl power).😉💕", "elizabething": "Hang in there Jen! You've got this!", "glassic": "Envision yourself having the strength to know exactly what to say and do and it will come to you. ❤️❤️", "tayst": "You got this!!! I believe in you! 🌟💗", "ashthemash": "Ah I just started following you and you inspire me in the short amount of time I've \"met\" you. I like look forward to your silly jokes and cute and fashion forward looks. So so sorry for your loss. I recently lost a love one, and I found being with the one you love is the most healing. Tight hugs and warm thoughts to you and your family ✨💕", "alexandracollins26": "Sending you and Andrew lots of love and big hugs!! Proud of you Jen..I know this is all just making you a stronger human. Hope you can stay at atleast a 5.1 or above:) xoxo", "morterfied": "Family is never not messy", "leahrward": "Wishing I could send you a bunch of cookies to help chase away the fear. This is an impossible, sad, and odd place to be in-- we are pulling for you!! You got this!!!", "difftiff": "@ashthemash lol", "jamison.k": "YOU INSPIRE PEOPLE WITH YOUR HONESTY. sending love & prayers your way💘💘💘💘", "jenniferanngach": "You so got this, Gotch! 💗", "amydavid": "❤️", "ozarkmamadeer": "The scene where Paul Rudd talks to himself in the mirror in the critically acclaimed film, Wanderlust, always seems to keep me in smiles. Also, you are basically a personal hero of mine and I'm rooting for a good outcome, here. Lastly: in the hard moments, think of what your future self would tell your present self. Love ❤️", "marcyec": "Just be yourself-that's enough. 🌈🙌🏼", "kimrcrooks": "Here's two jokes for you; okay here is the first: why do guys look sooo hot when they're driving? Because they're too stupid to work the a/c 😂 okay second: why do girls wear makeup and perfume? Because they're ugly and they smell bad 😂", "ellistracy": "You are such an incredibly strong woman and I am so grateful for all that you honestly share with this community here ❤️ sending lots of love on your travels", "amandaclairart": "Being in something like this is scary and terrifying. It's good you acknowledge that and it's ok to feel that. Cry when you need to cry, write it out, be so kind to yourself and it's ok to not say anything, just bring there is good. And things like this are step by step, second my second, which I feel means you can take a step back, forwards or sideways. You are amazing and we are all here for you. 💕", "sarahschussheim": "❤️❤️❤️🌈", "26andnotcounting": "@listentotrace love this response ❤️", "elisha__": "You have all the tools to get through this. You will get through this.", "mbbakes76": "I really love your honesty. I get so excited for your posts/videos because you often make me feel that it's okay to be scared. I think you traveling despite being scared makes you so incredibly brave in my world. Safe travels.", "megusto": "I think you are SO brave. You inspire me. You got this.", "laurabesskenny": "Sometimes you gotta take it 10 secs at a time, Kimmy Schmidt style. You got this.", "lindseyalyssat": "Being scared and doing it anyway is true bravery. 🙌🏻🌈🍷", "christinablonde": "Your higher self is in charge and not only protecting you but guiding you in the most divine of ways. 🙏🏻🕊", "raisingwild": "❤❤❤", "tchotchkeparty": "You got this. Cause you're you. ❤️", "bonnietsang\nVerified": "Verified", "fabric35": "But do you know what? You've got a virtual army of weird people rooting for ya!", "keastew": "When I go through though situations that are scary and emotional I try to remind myself that being their for someone is enough. And being super honest with yourself and them often relieves the stress. It might feel awkward but naming your feelings \"this feels scary\" often puts yourself and the other people at ease. Just being their will make the biggest difference. And as my favorite sweatshirt from you says, \"I did my best\"", "gabeeemartinez": "I admire you !! All my love goes out to you 💖", "elizabeth.cordaro": "Love you. It will all be okay- there's no other option 😘", "alicia_johnston_": "Sending lots of love and if you need a hug I'm in Australia (sure it's the worlds biggest island but babes we've got your back regardless of the distance xx)", "richiedesigns": "Grace always follows where love is present. You will find the right words, tears and closure for both of you ❤", "jasminestar\nVerified": "Verified", "alexislafond": "I am in awe of you. You make me cry. 🙂", "kellysamouris": "I think it's lovely that you are traveling so far to be with Andrew during this difficult time. Just being there is special. May his memory be eternal.", "dovegreyusa": "Don't worry. You've got this! It will mean so much to everyone that you are there. 😘💕", "clydesrebirth": "well fuck. I am so sorry for Andrew and his family and yourself. What an impossible situation and I don't know if there's ever one 'right' way to act besides honestly and fully. I will send you many funny snapchats of my cats to help life the spirits 💛", "hello_candice": "A brown stick", "thisthatblog": "so so sorry about this. ♥️praying for you guys!", "dmb.317": "@jengotch 😍😍😍 To borrow from Pooh's bestie Christopher Robin... \"You're braver than you believe, stronger than you seem, and smarter than you think.\"", "celinakane": "There's no greeting card but there is an episode of Grace and Frankie that comes close! Sending love and resilience and peace 💗", "hgriffing": "I admire your scared strength. Also, I am imagining you in first class drunkenly saying, \"I'm ready to paaaaaarty.\" Like what happened in Bridesamaids. Because that seems funny. Sending love and light and unexpected laughter to you 💙", "blendastudio": "So sorry to hear. Sending you loads of 💕🎈", "dinneratmidnite": "Guuuuuurrrrrrrrl just deep breathes, stay in the moment, be super fucking kind to yourself and eat lots of sugar. Sending you good vibes ✨✨✨", "trace\nVerified": "Verified", "eastlou": "If feels awkward to put a heart next to this. But I am sending lots of positive vibes.", "mekeesha": "I think this is really brave of you and really kind of you. I bet you being there will be enough and the words will come or they won't but your presence will mean everything. Safe travels and I hope the travel doesn't put you back into a depression but if it does, you have a big group of people here who will support you and hopefully bring you some sort of happiness. Especially knowing how much happiness and inspiration you bring others daily. ❤️", "fourletterwordcards": "My ex husband had a heart attack while we were in the process of divorcing. He called me while he was waiting to be seen in the ER, a wait that took 2 hours, while I continually told him to tell them he was having a heart attack. He was only 34 at the time and it was terrifying. I felt like his heart attack was my fault, even though it wasn't. I stayed at our place for a month taking care of him afterwards, because it was the right thing for me to do. You are doing the right thing for you, by going and supporting him. Your love doesn't stop, just because you are divorcing, it just changes. It's hard to know how to act, but just be yourself. Be there, show him kindness, empathy and love. It will be okay, for both of you.", "amyjomakespizza": "While you're being there for them, make sure you reach out if things get rough - you are loved! You're an incredible woman!", "sweethannahpea": "How many knees does your average man have? Three.. left knee, right knee, wee-knee.", "rclayton\nVerified": "Verified", "paredeyewear\nVerified": "Verified", "laura.gwinn": "I was 6 inches away from making a dick joke.", "whitneyleighmorris\nVerified": "Verified", "octoberhello": "Thinking of you. I'm so sorry for your loss. ❤️", "laurenoneill": "Pure strength + heart 💪🏼❤✨", "simone_paget": "💜", "paulinathestrange": "But you'll be good out there, no matter how tough it is. 💪🏼✨", "kellyoxford\nVerified": "Verified", "etwas_interessant": "None of those fears are anything you haven't conquered before! I hope it is healing for everyone. Loss is such a weird thing -- you will find your way through!", "ohheyyolanda": "Awwww! So sorry to hear this. Just your pure existence for him & his family in Australia speaks volumes that no words will ever do any justice. You're amazing to make this trip out of compassion aside from your fears. You got this!", "kimpirring": "❤❤❤", "morganausterweil": "Hug a 🐨 seems like some sweet animal medicine.", "elizabeth_sutton06": "Sending up prayers at this difficult time!!", "jenandaudrey": "@emilymcdowell_ has the very best greeting cards for when there's nothing right to say!", "thelovedesignedlife": "no great words of wisdom, but just love your beautiful spirit and I'm sure that it will shine through even in this dark time. 💓✨", "ginjacqie": "Your presence will be more than enough. Get more free drinks on the flight 🍻 you are strong and amazing so keep at it!!! 💪", "potters.daughter": "Man @jengotch ... just...MAN 🙁👏🏼", "emily_katz\nVerified": "Verified", "lindsayschuette": "You inspire me, Jen! Thanks for being you, for being honest, and for being brave.", "taylorprather": "You're the sweetest. 💞", "jenliebe": "i love how genuine you are. totally raw (that's what she said) 😂🍆 @jengotch", "alliroses": "@jenliebe you nailed it 🌟", "ellishepburn": "It's the right thing to do 💕 don't worry, it will all unfold as you go", "kaleydignen": "Jesus has got you girl and loves you so much!!!", "ginamavila": "moist 😘", "onezerosix_": "@dicklatte 👈🏽 😘😘😘", "bethanyhalford": "💕💕💕", "rennstagram": "Sending so much love and good vibes! You can do this. You're so strong and an amazing woman. ❤💗", "margangsta": "You're stronger than you give yourself credit for.", "soapboks": "🙏🏽🙏🏽 taint", "ashleygoldberg": "💛", "thisisaliss": "I think just being there will be enough for them! ❤️", "darcydubose": "Smuggle some Tate's with you 🍪 just in case 💕💕", "beaudrillard": "Much love to you.", "annaborgman": "I already thought you were amazing but this puts you on a whole different level. You're being the best version of what a human can be.", "ashliejansen": "Love. Love him. Love his family. Just be there. Be annoying. Be funny. Be happy. Be sad. It is all so much when you lose a parent, that the people who are real and raw are the people you want to be around. I know. I lost my mom this year and in the process learned that no one is ever going to do what you want them do or be who you want them to be when you are going thru the toughest times of your life. So just exist and be with him. It's all you can do and it's everything.", "claudiadmunoz": "Sending so much love your way. You put a smile on all of our faces, daily. Hopefully knowing that puts a smile on yours. 🤗", "mckkmaldo": "❤💕❤💕❤💕", "amandaprisciak": "❤️", "thelittlemarket\nVerified": "Verified", "_hay_tay_": "You are a beautiful person!", "studio_sue": "💪🏻💖💖💖💪🏻", "meowria.anne": "You can get through anything! ❤❤❤", "olgamklnko": "❤", "flotsam.studio": "Cock. Balls. And lots of love. ❤", "megamochabombs": "I think you're awesome and you're doing the right thing.", "alyssajtasker": "Penis."}