{"abrabelke\nVerified": "Verified", "the_untrained_eye": "So very excited to read your book. Happy 2019 to you Jen, it’s been frickin fantastic ( inspiring) to watch and hear your journey. Thanks for sharing with us Jen, we all love gorgeous you! ✨✨✨✨✨", "clairexsteven": "THANK YOU FOR EVERYTHING YOU DO! 2018 was the first year I sought treatment for my mental health after 5 years of struggle. Seeing your posts reminds me that I’m not alone. Thank you", "kemigreen": "❤️", "popixdesigns": "♥️👏👏♥️", "theiconery\nVerified": "Verified", "holistichempcompany": "Getting over travel anxiety is my goal!", "makishiapparel": "Love your light! ✨Keep shining Unstoppable Superwoman!! ❤️", "samichammas": "You inspire me, jen. Thank for being you!", "traveladventuresandtours": "I am a travel designer so I understand travel anxiety and often feel it myself when I travel myself (here is come Barcelona in two weeks). But I have no problem assuring my clients that everything will be alright and work my tail off and hold their hands if needed throughout their trip. Now I have to do the same for myself!", "kresmersky": "Wise, wise words. Thank you!", "lookfeelbegood": "@hunter_kelly_howe ok that is all 😘", "vintagepeaces": "@jengotch I came across one of your posts yesterday. I can relate. While having a mental breakdown in the evening last night I decide to capture the rawness of emotion and posted it to my IG. We all suffer. I am always on a healing rollercoaster. We never stop healing. The journey is full of every emotion and I am grateful for my emotions cause they are what move me, inspire me to create. To move forward. To Love. So thank you for helping me be more vulnerable cause that’s a fear of mine. Travel too but to show others parts of the inside is frightening. 💓", "cleaningcold": "You’ve been a pleasure to follow. I’m excited to read your book. Happy New Year!", "theneonteaparty": "Happy new year you ray of sunshine, you! ☀️ 2019 is going to be exactly what it needs to be for you!!!!! ❤️", "tinaandcompany": "Love you. 🖤", "selmablair\nVerified": "Verified", "jette.scherzer": "You are an inspiration and an incredibly wonderful soul! Happy New Year 🌈💖💥💫", "mallorykatestyle": "Thanks for opening up and being such an inspiration Jen!", "imastabile": "You amaze me", "shelbymurphy2": "It has been an honor to follow you through this amazing year - I can’t wait to see what this next year brings, and can’t wait to read your book! 💕✨", "christine_e_lott": "This is beautiful. I’m so proud of what you’ve accomplished this year.", "tallkristin": "Bravo to you to articulating the year in a nutshell. You seem amazing!!!!😍", "justasimplekindalife": "You’re amazing and totally inspire me! ❤️", "sarah.virag": "Fabulous authentic post ❤", "kirstyjkemp": "@busyphilipps @jengotch squeeze me in? I’m just little 😊I promise to let jen win with hair goals & wear a nightie like Busy..?? 😂🙏🏻x", "brendalarby": "Thanks for your year that you have given us too. Your book will be on my wish list xxx", "saartantie": "2018: the year that I discovered you, followed you, cried and laught with you. We are not alone :-) Happy happy new year from belgium to you!", "rixstix": "Thanks for being so real. Happy newyears ✨🏄‍♀️", "elizabethsarahbartlett": "Phenomenal woman 💕", "catherine.drysdale": "Appreciate you 💕🙏", "hellomegs_": "❤️❤️❤️", "beachbunny1985": "🙏💙👌", "lovetagdesign": "Thanks for making 2018 the year of healing (and continuous healing)! You touched many lives who needed it. You’re an inspiration and I’m honored to “know” you! Thank you for your honesty, transparency and hilarity! You’re the real MVP. ❤️ Also excited AF about your book.", "mackichu": "You are wonderful!!!!!!! Happy New Year! 🎆", "waycrunchy": "Lovely", "kmrkmr": "Thank you so much for sharing all of this with us. I am super inspired by your journey.", "hampdenclothing": "This is so inspiring. Thank you for sharing & inspiring me to not only look back on what i have accomplished but also forward to how I really want to show up in 2019. 💗💪🏻", "ellenmariebennett\nVerified": "Verified", "larissaelliott": "Thanks for making this minefield called Instagram a kind, generous and vulnerable place in 2018, Jen. Your posts helped me a lot.", "mariabonitalondon": "I don't know you in person but through here I think you are great happy 2019! If you ever come to London and do a talk a women gathering TED talk or something , let me know ( I think you should )", "phlpaday": "Thank you for being interesting and inspiring", "andiebrand": "I mean, I’m ready for that fragrance in 2019!!", "rebeccagayheartdane\nVerified": "Verified", "handselmondays": "It’s truly a goal of mine to get a death threat! If you do something great enough, you’re sure to scare enough to threaten something like that. I think it’s the best measure of doing something truly great. Congratulations! 🥂", "jennieeliza": "Thank you. You are the greatest inspiration! Let’s #trashdance intro 2019!!!!! 💃🏽🕺🏾💆🏼‍♀️💆🏼‍♂️👯‍♂️👯‍♂️", "littlegreenshed": "The year of sex hair!", "lobsterandswan": "Happy 2019 magical lady! 🎊", "danielle.see": "Your passion and vulnerability are so amazing and I am hoping we can share in making 2019 marvelous! We ALL deserve that! ❤️❤️", "_lotro_": "Can’t wait to read your book!", "yumeitamcompton": "Cheers to you and 2019!", "kate.english": "❤️", "newmantuto": "👏", "mama_absha": "❤️❤️❤️❤️", "nicole.harrisss": "You are AMAZING @jengotch thank you for sharing your wonderful journey with us. ❤️", "rorygoeswest": "It’s your year every year!", "bitsandbobs_shop": "💕", "jenna_aceandjig": "HNY ❤️❤️", "max_n_poppysmimi": "No PRESSURE Jen! You had us at HELLO!🥰", "cleomurnane": "Looking forward to that fragrance in 2019. 😜 Happiest of New Years! 😘", "isitjanedoe_": "You are the best!", "kristinakellyho": "💗", "kimbaise": "Love yer guts!!❣️🐝", "rebjaeboe": "@jengotch Happy New Year! You've been an excellent inspiration to me this year and I adore you for it!", "goodlifegabh": "I have loved witnessing your year!", "littleshopofoils": "Thank you for being brave!!!!", "moonc1c1": "Thank you for your honesty ❤️😍", "tracyporter_poeticwanderlust": "Happy new year soul sister ! May 2019 be the year of magical dreams come true xxx✨✨✨✨✨❤️💋", "mbbickford": "❤️", "minimalist.ish": "I love this. All of it 🖤✨🤩", "vintagelolamodernfrankie": "You’re fucking amazing! Happiest of New Years Jen! Much love from us in Australia 🇦🇺 😘😘😘🍾", "eanewby18": "Right here to see where the new year leads you! Thanks for sharing! 🎉🎊", "emmaswhitten": "I needed this. Thank you", "hollhoop": "Please share more about your travel anxiety and what you did to overcome that in 2018.", "mandybalart": "I. Love. You. 😘", "kristen_dunn": "Wow I felt this deeply—thank you for everything in 2018. You’ve helped and inspired more than you can imagine. Thank you for your vulnerability and courage, and in turn giving me the gift of vulnerability and courage. 🖤", "emmadimarco": "You are so amazing and such an inspiration!!! im so proud of you❤️❤️❤️❤️❤️❤️", "margauxg1": "Happy New Year, Jen!! Thank you for all you do and mostly for being honest about so much of it ❤️", "blancheboudreau": "You are so beautiful & inspiring & will continue to be in 2019. Can’t wait to read your book & I would totally buy your fragrance. 😘❤️🎉", "stephanie_sheldon": "👏👏👏👏👏👏👏👏 Can’t wait to see how 2019 ups its game!!!", "katethegreat843": "Feel you girl, big love ❤️", "jellysjam": "You’re my hero 💘", "katpfisher": "you are a magical sparkle whose light wanes & brightens, wanes & brightens - but you always shed loving light. it's okay when your sparkle feels a little dull, you can't always be on - none of us can. { big hug }", "marismellyalater": "@sarah.g.rose", "ampersandstudio": "Gosh we just love you so ❤️", "bijouxsandrinedevost": "I think you are an amazing human. ❤️ Unperfect, but so inspiring. Happy New Year to you, dear Jen!", "megandi": "@faucherella Check her out/ I think you’ll dig", "hamcodesign": "I got my friend, who’s had a rough year, your Resilience necklace. She loved it, and the mission behind them. It’s the gift that keeps on giving! ❤️", "katiequallsfay": "Thanks for a great year, @jengotch!!!! Your podcast and posts have been such a light for me", "photographeramy": "@mrs__mendez ummm we're preordering this book, yes?!!! 🙌🏻🎉 And @jengotch I love that all the growth included your hair growth too😆👌🏻💁‍♀️", "confetti_rebels": "@jengotch 2019 is MY YEAR TO MEET YOU! I’m on a quest to find you on my LA trip in July! I don’t know how or if but I determined to give you a wave at least! Both you AND @busyphilipps ! 🤣 I’m coming all the way from Australia! Stalking much? It’s actually for work but whatevs. 😘", "weelicious\nVerified": "Verified", "k_bentley": "I just love your entire outlook on life. Cheers to making 2019 even better. 🎉", "civilmoon": "Being transparent, authentic and down right blunt is awesome - everything that you are! Thank you! 😘 Happy New Year 💕", "marierao": "You did and are doing great!!", "jessicahonegger\nVerified": "Verified", "presteddonna": "I love following you. Funny and always honest and a great dancer!!", "ohjoy\nVerified": "Verified", "_ann_e": "🙌🏻✨ thanks for sharing your encouraging journey with us strangers 💛", "sallyswensonart": "I'm so glad you're writing a book. I will buy it. I'm so impressed by young humans like you. You should really be proud of yourself. XO", "carmenalger": "Your rawness is refreshing! Go warrior go!", "feelion8": "Happy New year to you I love your page I especially love the trash dancing can't wait for the book 🎉🎆🎊🎉🎆🎊🎉🎆🎊🎉🎊🎆🎉🎊🎆🎉🎆🎊🎉🎊🎆🎉", "theheartlight": "You rock the house @jengotch ⚡️⚡️⚡️", "daisys_mercantile": "You made me feel like I’m not alone, thank you!", "lisa_jayne_lee": "🎉🎊🎆💕😂❤️💋😘", "jacquelinebd24": "❤️❤️❤️❤️love your Instagram and podcast xoxo", "melinda_maxey": "I love you forever and celebrate your year with you! Thank you for sharing the beautiful journey. Your sister, Mel", "lizperezartist": "@jengotch You are loved Jen 💜💫", "i_am_jacks_random_thoughts": "You had such an amazing impact on my year 💗", "katie_pisarcik": "🙋🏼‍♀️I was one of those tearful strangers when i saw you in Florida in October. You are not only my favorite starstruck celebrity meeting moment but you are also a role model to me and so many people. Thank you 2018 for leading me to the one and only @jengotch 💕", "katestrongnz": "Thank you for the inspiration and laughs in 2018. 🌸", "mrsgillies": "What a lovey post. I love your honesty and bravery. Happy 2019.", "katiecourtneyrattray": "What would the name of your fragrance be??", "studiohartshorn": "❤️❤️❤️", "kimmieslc": "❤️❤️❤️👍🏻👍🏻👍🏻", "emilyehill": "❤️❤️❤️", "cocktailsandunicorns": "🙏🏻💗 Thank you for sharing your truth. Here’s to an even better 2019!! 🥂", "claudfortin": "🤩", "dmb.317": "jen, you’re such an inspiration to me! and i’m so looking foward to what 2019 will bring for you. much love! 💗😍💗😍💗", "sbean1018": "Jen, I have been following you and slapping myself across the face to just get these words right. Is that a writers block thing? I wouldn’t know as I only write incomplete daily lists of things I must accomplish and rages to people that have wronged me. Sooo.... I opened my box labeled past yesterday, it is a literal box of memories (6-35) and I should have rewatched UP. I was feeling so many regrets and what if’s. You’re post just sparked possibility to me!! I cherish your words. Please shine on with us when it feels perfect for you and thank you for all of the reals. It means more than you know.", "krhodey": "You are such a beautiful, wonderful person. Thank you for sharing your heart with us. You are an incredible example of how to be vulnerable and authentic in a public place. Grace and peace to you as you welcome 2019.", "bethbourbeau": "I have loved getting to “know” you. You are amazing. Thank you for sharing so much of yourself! ❤️❤️❤️", "shellycourtkanyo": "You’re an amazing woman. Always grateful to you for sharing your ups and downs 💗💗💗 and your TrashDancing", "mirbrown75": "So much badass, vulnerable, inspirational, magical YES! ⚡️", "samanthalrogers": "You're so swell 💁🏼", "thebestdaniellelevy": "I adore you JGOK! 🎆💛🌟😘", "kym.rodda": "You are so beautiful... The kind of beautiful that goes past this gorgeous face of yours!", "lunamountainff": "You’re the best! So happy to have ya!", "debinwonderland": "Waiting for the fragrance👍a TrashDance official playlist and so much more from you!! Thank you bunches for all of your 2018 shares - it helped me a whole lot💗💗💗💗", "kellyamccartney": "❤️❤️❤️❤️❤️❤️", "lizzo1988": "💕💕💕💕", "january_one": "Wearing my anxiety necklace as I head out to dinner a couple days before my 49th birthday. This necklace makes me feel so much better. I can't thank you enough. ❤️", "megpjones": "Thanks for sharing. Can't wait to read what you unearth in the book!", "jodimckee": "You are amazing. Thank you for sharing so much of your life with us here. 💛💛💛", "_heydear": "Sounds like one heck of a year, you are a gem 🙌🙌", "kgrassby": "Bravo, you are wonderful.😘🙏💪💃", "trupeach": "thank you JG for making us all a little more OK sometimes. ❤️", "petitemagique": "Launch a fragrance called 2019! 🎆", "sarahcurrydesign": "Get it, girl! ❤️", "one_of_two_bees": "Happy New Year Jen. You are an inspiration xx", "bcrumpette": "Needed something like this, awesome post!", "melindajonesworld": "One word: yay! To all of it, and all of You.", "megancbreen": "💕💕", "sourdough61": "♥️", "spookymadsen": "Happy New Year🎊💗", "thelittlest": "LOVE YOU. Making black eyed peas because of you on Tuesday!!", "jessechamberlinmarble": "🙌🏼🙌🏼🙌🏼", "sarahreillyengel": "Beautiful. You did rock it all this year. Cheers to a happy new year. 🥂❤️", "dundas9": "You are simply awesome - so glad I found you in this crazy IG world! ❤️", "tdimond15": "🌹🎉❤️🎊💥", "alison852": "❤️❤️", "upholstery_club": "Funny how the same year can be great for some, bad for others. But it’s great your 2018 was so good!", "farmgirlfashionista": "💋💋💋", "kelseyleelee": "You’re wonderful! May 2019 be another year of joy & growth & health for you! 🌿", "mellobets": "YGG!!", "lesaucy": "I’ve really enjoyed following your journey this year and find your openness, emotional honesty, and humor to be a rare and beautiful thing. I think you’re doing amazing and I look forward to seeing what new things come into your life in 2019. Happy New Year!", "agelesscrush": "Love all of this so much ♥️", "kellyschmidtdesign": "❤️❤️❤️", "dannyigold": "love you jg💛", "ajd_lari": "Love this and you. Although I don’t know you!", "htownlisa": "❤️❤️❤️", "gusandrubyletterpress": "Happy new year! Can’t wait to read the book!", "carolinesomers": "Happy New Year you beautiful human ❤️🙏", "naymenezes": "i love when meeting you in the my timeline. Always so genuine.", "cheerspatssweetiedarling": "Can’t wait to read it", "janellemeghan86": "We are so lucky to have you ❤️", "djsarahlandau": "❤️🦄❤️", "hollyferris_": "Bravo, lady! ❤️", "karen.in.the.citay": "Happy new year... so glad 2018 was a good one fer ya!!! (L💛VE my ~anxiety~ necklace )", "heartofabaker": "Love love this so much! ❤️ Been amazing watching you grow and feeling less alone because of you!", "annaggramm": "Queeeen my queen my queen!", "laurenlograsso": "You're amazing ! You made my 2018 so much better. Love you!", "jaeraebae": "I can’t wait to read your book! Thanks for keeping it real on the gram.", "joiebutter": "Love you Jen! 😘", "stung_by_samantha": "Happy New Year!!!👏👏", "sydney_ga": "Love you and most of all, thankful for you. ❤️", "sarah.allee": "ohhhh i just love you", "gidnas": "❤️✨💫", "nataliebubb": "Cheers to you and to a great year ahead! Can’t wait to read your book. So happy I found you via Busy Phillips’ IG; you are a true light.", "kaibearsmom": "You’re amazing. Keep on truckin’.", "ceeva": "Happy New Year wonderful human xxx", "keriann14": "You are such an amazing light, your bravery in sharing your dark moments is so inspiring and appreciated and I hope it helps you as much as it helps others. I cannot wait to read your book! Thank you for being you, wholly, and sharing so much ❤️🎊", "callieausten": "It feels odd to truly appreciate someone you have never met but I am thankful for you and your vulnerability in sharing so much of your life with your followers. May your 2019 be filled with joy ✨", "kgross": "💖", "kendalllee____": "I don’t know you but I love you", "dearwrenjames": "If you ever have an opening in the friend category, I’d like to apply. You’re words come at an incredibly vulnerable time in my life and because I’ve spent the last year ish watching you turn your life around I know I’m going to be okay too. I have one more request ... I hope you never get a bug man because your cricket was one of my favorite memories of 2018! 🦗", "ciara_era": "I love you @jengotch and to me you are perfect.", "jsaleem": "Looking forward to procuring, reading and understanding your book, much love and respect for years to come. ❤️", "queenbeesanders": "🙌🏼❤️🎉🎆", "supersooz": "❤️", "funnylittlebird": "happy to have found you on instagram ❤️", "daydreamarcadekids": "I hope I can have a year like this! Sounds unreal to actually look back and love a year so much. Cheers! 🎉", "julesandfletchandteddy": "❤️♥️💕🌈🌟✌🏽", "prettycrabby": "Everyone had A YEAR. I cannot think of anyone I know who didn’t GO THROUGH IT this year. Reading your posts really helped me. I started medication for anxiety this year. I had a semi breakdown and had to be out of work for two weeks? I lost thirty pounds. I jumped off a boat in Italy. It was a crazy year of huge ups and downs. I feel so lucky to be where I am. Love to you, Jen. Thank you for what you share it really means a lot to me. 💕💕💕", "soy__paulina": "You’re such an inspiring and strong woman. All the best to you ❤️", "duh_naya": "💜", "kimberjaynes": "Incredible — Congratulations beautiful on your amazing year! ♥️", "mirandainclt": "I think you’re a badass warrior and I can’t wait to read your book!", "kelseyjonestuia": "You are a rockstar!", "octoberhello": "♥️♥️♥️", "ddgkb": "That’s so beautiful 🙌🏼 Thank you for your uncut honesty. Blessings 😘", "villi.russie": "you’re so inspiring", "kriscorinne": "You have inspired me through your stories and let me know that I’m not alone. It’s a hard fucking world to live in and seeing others be open about the same problems you are experiencing is a breath of fresh air. Thank you.", "lulafloradesigns": "A book! I can’t wait! 👏🏼🎉💛💛💛", "grluxy": "Amazing!!!", "isaisafloral": "💕💕💕💕", "jenbwagg": "So glad I found you in 2018, thanks to my daughter. You're a favorite and I love you for keepin' it all as real as it comes. Happy New Year! ❤️", "elena_mepls": "😘😘😘🎊🎉🎆🎆🙏🏼💙💙", "_emilyoneal": "So thankful for you and your presence here, Jen! 💛", "allegrab": "You are phenomenal I cannot wait to read this memoir. Wow.", "juliebethtanous": "You are such an inspiration! ❤️", "joyfc": "Thank you for all that you did for us - and also the mascara reccos. ❤️ #To2019", "lydford": "You’re incredible ❤️", "kourtneykeaton": "We love you and your heart and your hugs, JG! ❤️ Here’s to more of all of them in 2019!", "mainemomma72": "happy brave new year to you. thank you for all you inspire", "citycalled_beautiful": "Yay!!!!!!!!!!!!!!💕", "ritaspeaksskin": "💕💕💕", "kateaureliastudio": "You are magic ✨💕", "flowersandgarbage": "💛💛💛", "schatzie": "Love love love ya 💞", "drpattikim": "If these insta captions are any indication of what’s to come with this darn book of yours, I CAN’T WAIT. You write with humor, humility and hope.", "karissanickish": "I can not wait to read the book! You are amazing.", "christinagalbato\nVerified": "Verified", "jana_fabulous": "Peace and love ❤️🙏", "justagirl": "Facing 2019 head on!", "meghanalfano": "2019 will be a good year, I can feel it ✨", "bows4jen": "Thank you for trash dancing too!", "jujuen1": "You’re awesome!", "yo.ashley.jo": "♥️♥️♥️", "sydseegie": "Beautiful human 💕", "caivka": "Thank YOU for making 2018 incredible. You had a huge impact on my happiness. ❌⭕️❌⭕️❌", "mama_thomp": "Can't wait to read (or preferably listen to you read) that shit!", "constancezimmer\nVerified": "Verified", "_ginas_lovely_life_": "Love this, love you ❤️", "andrea.mclaren": "You have given me hope, Jen.", "lcushing201": "Happy New Year! Thank you for sharing your journey with total strangers. I can't wait to read your book! 🎉", "aklimton": "Happy new year to you ❤️🧡💛", "ashleygoldberg": "💛", "wendylawrence88": "Thank you @jengotch for sharing so much of yourself with this community!! Really enjoy your podcast and so excited for you and all of the amazing things that are happening for you!! Thank you for sharing the extreme highs and lows and not shying away from the hard topics!! Sending you all the love and support you need to endure the memories and stories you are digging up to write your book, in the end it will be so worth it and I can’t wait!! I truly appreciate you Jen, have a peaceful end of the year!! 💖✨🙌🏻🎉🥰💕", "luckygirlkelly": "❤️❤️❤️❤️❤️❤️", "lroxannea": "LOVE your message....listening to the soul instead of ego....experience joy and recognized it in the moment... I love these ideas❣️🥰", "caitlinmhoyle": "You’re truly an inspiration, Jen! I continue to be blessed by your words. 2018 was lucky to have you, and 2019 will be too!!", "ozarkmamadeer": "You’re a light in this world ✨✨✨", "whatmovesyoula": "Love!! ❤️❤️❤️", "kkmar": "❤️❤️❤️❤️", "hadleykmcc": "Jen, I’ve loved following your journey and love that I’ve known you for so long too through Megan. Your humor and strength are amazing! Happy new year to the coolest Pi Beta I know!", "marleymonroe626": "sending you so much love and thank you for your openness on your journey. you inspired me to shed my masks and be more open on my own journey 💖🦋", "bossmarecraft": "Love you Jen! ❤️✨", "elegant_dirtbag": "Love you Jen Gotch! Thank you!!!💕", "caryvanos": "I love this post (and all your posts) It feels odd sometimes to appreciate a stranger so much but I do. You are awesome.", "lizywho": "Your Trashcan dances are the greatest thing to happen to IG! Happy New Year Jen Gotch!!!!!", "jackieksanders": "So beautifully said! Happy New Year!", "bornandraisedvintage": "You are one amazing person!!!❤️", "ashleeknight": "Meeting you at Create & Cultivate was a highlight of my year. Thank you for being brave and showing us your raw self, and looking glam while doing it. Hope the new year returns to you all the love and light you pour out.", "anndanger": "Love you, Jen ❤️", "mamajustice": "I really, really wish you were in my life in a physical way. A friend that I could see daily & talk to daily. A next door neighbor kind of close. I guess this will have to do. Thank you for sharing all that you’ve shared. It’s been so good for me, for all of us. Take good care 🌱", "julebag": "💕 a real deal inspo", "j.abecca": "you’re so amazing. can’t wait to see you kick 2019’s ass 💗", "fleurishing": "sending love and strength as you dig deep...I can’t wait for your book. 2019 will be epic for you, no doubt! ✨", "camillealbrecht": "I cried while reading this. Crying is so good, so... thank you. 💕💕💕", "gingiber": "This is how I feel about 2019, too. My 2018 was such a gift and surpassed anything I could have hoped for. I truly feel excitement and fear about the year to come.", "kelseyrwertz": "So grateful that I found you and your podcast this year. Thank you for the laughs and feeling like I’m not alone. Go crush 2019!", "renbalesrhodes": "Jen you feel like a friend who can do that???from across the inter webs???? You can. It’s just one if your super powers. Happy 2019 and don’t be a stranger. ♥️"}