{"michaeldnetto": "🤗", "isabelwriter09": "❤️❤️❤️❤️", "yourmindmattersorg": "Always an inspiration, just by being you. In your vulnerable and real state, we love you the most. This will pass. Sending strength and love 💛💕🧠💪🏼", "heyycocostone": "@dak_ack", "traciamodio": "The truth is always beautiful...and scary. Bravo for having the strength to show it in a world that demands only the positive from people. I get everything that you’re saying and I have and do feel everything that you’re feeling. Somehow, even though I don’t wish these times on anyone, I feel comfort in not being alone. Thank you for just being the real you! ❤️", "suzanneallisonsocial": "Bless you honey! Life can be tough. Thanks for sharing as it does help the rest of us who are building businesses and that even influential people like you have their ups and downs. The fact that you are aware means you’re heading in the right direction to find that light. Big hugs 🤗", "healthyharvestnaturalfoods": "♡", "thumbellyna4608": "Preach 💯👏🏻", "mirandainclt": "Love you JG", "megansambs": "@keatonkilkenny this woman is amazing-you should follow 💓", "finnandmecollection": "Love this! Thank you for your transparency 💋", "judemartins": "@melindamartinsyoga listen to her podcasts. I love her!", "mikireimann": "Old. Thank you for sharing this 😘", "japanesesong": "❤️👏", "dr.sidoniefreeman": "Thank you so much for sharing this! 🙌", "simplyspaced": "Looks like you’re already writing your book ☝🏻. Read Girl Stop Apologizing for some extra motivation", "norestrictions": "Hey @jengotch sent you a message. 👍🏻", "lookfeelbegood": "@hunter_kelly_howe", "smelmo22": "@jengotch Thank you for sharing your thoughts. I don’t like the thought of being stuck in a tunnel. Why do we have to go through such a dark tunnel to find a fresh breathe of air? I don’t believe we do. It’s probably dark because you’re on you’re belly! Turn around look somewhere else. There’s always a positive outlook if you find one; especially with the summer just around the corner! 😁", "libralovesu_": "@jengotch Soul Sistar!", "bella_mia_my_loves": "💪😘", "soberandsaucy": "💪🏻💕Thank you for sharing🙏🏻", "gretchenrobitaille": "I just had an anxiety attack and my soul sister talked me through it by me counting to ten. I'm consumed by fear and judgement plus much more , it scares me to write this but I have to start somewhere or forever be alone in someone else. My sister asked me to follow you, so as of 20 minutes ago I am. trying to find the root of it all and understand it but I don't know where to begin. But thank you for making me see that I'm not alone. .. As I so often feel.", "kaleylamberson": "@valerielynncarter @migsoap", "lenakatrinak": "I'm there with ya! Growth! Pain! Earghhhh! Love!💖", "ezamlopez1": "Your words are what many need to hear, what many would like to say. Thank you", "eliseballegeer": "💗💗 Best update ever. Thank you for everything you’ve given thus far, so grateful!", "imfirstinlastout": "@jengotch Jen be 💪🏾!! You wouldn’t believe how hard life has been for me this year. Three weeks ago I lost my job as a financial advisor. I lost that job because I tried to pursue my dream of writing a novel, which is proven to be the hardest thing I’ve ever done. I poured my heart into those pages✍🏾,but I’ve sold maybe 50 copies in total, for years of work. I’m not really sure what to do at this point, except to continue to try. Ever since a child I have had the 🔥 in me that will not allow me to quit. Would you please read my book? I put it in my link. I cannot lose hope in this dream.", "emilyabigail": "I am beyond inspired by you! I cannot imagine how difficult it is to write a book. You are amazing for doing the hard work. 🙌", "allysonfanger\nVerified": "Verified", "_hair_by_rosie": "A friend once told me, “there is no light at the end of the tunnel, YOU are the light going through the tunnel” thank you for sharing, and always being real ❤️💪🏼", "zoefullen": "You are the light 💡 in my dark night right now", "afashionnerd\nVerified": "Verified", "taislany": "Sending lots an lots of good vibes ✨💛", "addyluthatswho": "🖤", "d.whithorne": "Thank YOU❤️", "bellavri": "Have faith you will get through this 🙏🙏🙏 Hope you feel better soon 💗💪", "kylesmeltdown": "Wow you are truly something special and inspiring 🙏", "myrnamink": "Gracias.", "kellyann1020": "Love you ❤️, my strong 💪🏼 woman. You can do hard things. 💕", "alexnoiret": "❤️❤️❤️❤️❤️❤️", "sarah.bewell": "Deglamorize success. I need this and I’m not the only one, so thank you. 💕 Much appreciation for the realness", "melissa_collette": "💛", "gel_gel_gel_images": "Hugs Jen, Hugs.", "margovajewellery": "😍😍😍", "liannetokey": "I love the don’t feel bad for me part. There are always the people who do the old “oh no, poor you. That’s horrible. I feel bad for you.” And I just want to shake them and say really? You feel bad for this growth-in-progress? Don’t even. good for you, and this and all you are doing. you, m’dear, are most definitely not alone, as I feel as though I wrote this myself. And we push on. 👊", "paripassushop": "You're so brave! Thanks for sharing", "laura.parsonss": "Thank you ❤️", "msjwk": "💚🙌🏼❄️", "lifeisinbeta": "Amazing. I melt down like once a week. Thank you for sharing.", "susanegross": "I know this will be one of a zillion comments, likely to get lost in the sheer volume. I don’t know why you would even SUGGEST anyone might “feel sorry” for you for being raw and honest. There is far, far, FAR too little of that around. Too many people are putting their filtered lives and filtered images up here — frankly, I can’t take that bullshit. I feel scared and rageful and mournful SO MUCH OF THE TIME. But so many people don’t want to feel that kind of rawness. But, it’s all I got these days. It really is. It would be so much better for ALL of us if people seriously got real about where they are. Seeing all the fakery all around makes it all so much worse. There is true connection in honesty. And that’s really all we have at the end of the day — being able to connect, to be honest about the real shit, to love each other.", "ephemere3000": "maybe- try to wright in a libary/ café/ co-working space? or, get a pet from a shelter?!! i‘m so sorry you feel this way!", "littlewanderingsoul": "you are not alone 🖤", "ashliwinter": "❤️", "pamandgela": "Sending so much real love! Hang on there will be light. Focus on all the good 🙏🙏", "jennyannedunn": "❤️❤️ You got this lady!", "linzp84": "I’ve been feeling this exact way for months. My boyfriend and I constantly argue, it feels like a hole I’ll never dig myself out of but I’m trying to find the light at the end of the tunnel.", "annamikedean": "I pray you seek a relationship with Jesus Christ, He loves you so much and is waiting for you to call on Him. And now why are you waiting? Arise and be baptized, and wash away your sins, calling on the name of the Lord.’ Acts 22:16", "michcorr": "You give me hope. You inspire me. To see you so raw shows me that I’m not alone. It’s ok,not to be ok. Thank you! Thank you! Thank you! 🙏", "letsmakemary": "My dentist was into it! 🦄 Love from Chicago 🤗", "stephaniedawson": "Hey girl, you got this and we got you xxxx p.s. I love you and p.p.s. Getting my ban.do parcel this weekend was the highlight of my year so far - so thank you 🙏🏻 xxxx", "megforever_": "💕💕💕💕", "mackichu": "You’re amazing, Jen!! I love all of your work!! You can do this!", "loved.nyc": "Thank you for being so open. It makes me feel less alone. Thank you. 🙏🏼", "wit.interiors": "Thanks as always for having the courage to make yourself vulnerable.", "bloomsandsucculents": "You’ve got this. Your raw honesty is so brave and so inspiring.", "debbiedrawsfunny": "❤️", "fan.tesstic": "Sending you lots of love dear Jen ❤️ you don't have to do anything. Just feel, breathe, and be.", "king.annee": "💜💜", "bethcrouser": "“I know moving forward is the only way through.” Yes. This. Sending love 💕", "bech0629": "John 16:33 ESV I have said these things to you, that in me you may have peace. In the world you will have tribulation. But take heart; I have overcome the 🌎 world...your not alone thank you for your honesty Jen🙏❤️", "mo_tunez": "It's okay to be vulnerable", "janetterizk": "Wow amazing. Thank you SO much for sharing this.", "casaclayton": "I’m sorry your saline became my diamonds, but thank you. Someday I hope it will be vice versa. 👊", "thebestdaniellelevy": "♥️💛😘 You’re here for us and we are here for you JGOK! 🧠👊🏼💪🏼", "patriciagomez.me": "Being vulnerable takes strength as well. Keeping you in my thoughts Jen.", "irishdancer66": "♥️♥️♥️♥️♥️👏🏻👏🏻👏🏻👏🏻👏🏻🙌🏻🙌🏻🙌🏻🙌🏻 You make me proud to be such a inspired fan of yours that helps me out with being bipolar, and all that other stuff!", "l.i.t.t.l.e.l.a.m.b": "You’re a pioneer 🖤", "marcellazamith": "i wish you feel better", "denisetekelenburg": "You’re are love by God❤️", "cheerily.co": "Thanks for sharing so much for your realness with the world. ❤️❤️❤️", "emmaswhitten": "“I been workin, I been grindin” YOU GOT THIS JGOK!", "amandaleighwolfe": "❤️💪🏼❤️💪🏼", "thatgirlwhatsherface": "This makes me feel so much less alone. Thank you SO MUCH for sharing this. As a regular Joe(Jill?), that isn’t successful but hopes that one day she will be because she thinks it’ll solve all life’s problems, who goes through these episodes constantly, it helps knowing that even people I look up to go through the same thing. I admire your courage and I truly take to heart each one of your updates, or lack of updates. Thank you for being an amazing person and continuing to push through. Tearful updates or dancing ones, I look forward to the next. 💝", "melisabegins": "Thank you so much for being all of us.", "tbirdlion": "God Bless you 😘♥️💗", "briannesharpe": "Go out to dinner with friends. No writing for 3 days minimum. My advisor assigned me this (though he assigned a week of no writing) when I was balls deep in my master’s thesis. It’s necessary.", "___mary_v____": "Resilience is you", "gabrielammv": "👏🏻👏🏻👏🏻", "meowh0le": "You can do anything! I believe in you, girl.", "yonaloveshine": "Wow keep strong 💪 👏", "courtney_jerome": "Needed this so bad right now. Thank you 🧡", "roygbi_": "You’re kinda the best.", "meghan.awalt": "Gosh we LOVE you JG!!!", "41winks": "💙💙💙", "meeshsmiles": "♥️ thank you for sharing your vulnerability with us. Sending strength to you!", "rebeccabillybob": "It’s like you have read everything about how I feel , Thankyou for putting it into words. I took a photo of myself yesterday after a huge tear fest and it doesn’t even look like me. I wanted a perspective of what I look to others if ya get me. Xx", "therealruffstarr": "Hey sis. I am feeling you. Your such a positive inspiration. Keep on keeping on.", "cynthia_fika.coach": "Sending lots of love❤️", "jsayer11": "Raw. Beautiful. You are my friend. I relate.", "devinrlarson": "❤️❤️❤️❤️", "glamheaddesigns": "I feel your pain and my heart goes out to you💜", "laurmcgrath_": "💪🏻 💕", "suleikau": "You are a QUEEN BEE 🐝👸🏼🌌🌌🌌", "gaygigante": "😘😘😘😘😘😘😘🦋✨🌷", "dirtydiana": "Depression watched all of TWD this year while smoking copious amounts of weed. I FEEL YOU. 💖Thanks for always sharing.", "thekdv": "❤️❤️❤️", "renealvez1": "Sending you digital love, hugs and cyber kisses. Self-care is a wonderful thing. Take care. 💗", "m_marty67": "I have a whole roll of selfies on my phone like this🙌🏼 the way you talk about depression is so spot on and real!!!!", "risecreativeco": "Thank you for sharing. We ALL struggle with it in some form, you’re not alone 💛", "boobfoodcookies": "#strong 💗💗🙌🏼🙌🏼", "franceskachacon": "😂😍💕😘", "smith6876": "Your pain and compassion is so compelling I will read the book I will travel your journey and on the way back LYK that your amazing your beautiful and your so much.. more than such a beautiful face your a beautiful soul. Forever know your not alone. I'm a PiscesAries I feel the pain of the world sometimes", "taylorjameskretschmar": "I just heard this song yesterday , I was browsing Nike’s running mixes and liked something so I started browsing and found “no condition is permanent “ by segun bucner ... I swore I would listen everytime even a sneak of a mood flickered just to remind me how quickly the tides change. You will be through this and publishing in no time at all! Thank you for highlighting what is “normal” for so many people!", "iam_phoenix_rising": "@jengotch thank you for being real & raw. For sharing the intimate parts of your healing , and for naming that this work is some of the hardest and most vulnerable work we can ever do 🙏❤️", "evanythomas": "I love, love, love \"deglamorize success\"!!", "emtoom": "NEEDED THIS ❤️", "followthewildthing": "Just keep swimming swimming swimming. 💙", "suitinteriors": "Thank you 🖤👏🏻", "jsydbrantley": "I know the feeling @jengotch check out my latest post, it’s alright it’s alright, just breathe. It’s a letter to myself because this is also my permanent state. Sometime strength is in tears. Depression locks mine away so having them means I’m at least not holding it in. I will read your book and hope it will help me, but right now I hope you read my post on my Instagram page so it can help you, even for a second. And btw playing the @fracturestunes song It’s Alright on repeat helps me.", "auntiekaren3": "always with a little shame thrown in for good measure!! we are right here with you, you beautifully haired, complicated, vulnerable, brilliantly funny woman! holdin your hand, in miami! 🌸🌸🌸", "laurenefritsch": "Beautiful sharing and I hope your memoir inspires you too- what you’re doing inspires me :)", "cursh": "I looks forward to reading that book", "itsbubbly": "@shopbando and you were one of the first accounts I really followed and felt excited by. That was probably 4-5 years ago? I really appreciate you showing us this side of things. IG often leads us to believe that influencers like you lead perfect, easy, happy-emotion-only-lives. I appreciate seeing this side of things 💗", "tracyleehannah": "You owe yourself FAR more than you do us. Taking care of yourself is number one priority. We aren’t going anywhere. ‘Gotchies’ are here for you just like you are here for us. Love 💗", "penrosedesignstudio": "💪 can’t wait to read it!", "carolinakmn": "❤️", "callahanjen": "Keep posting. We need your voice! ❤️", "dalmond": "You are so impressive and wonderfully human....the world is better place with you in it!", "personallypistol": "Thank you. ❤️", "anastasiaarmata": "It’s so wonderful of you to share your vulnerable side. 💕", "stleonardsmoderngoods": "Feeling the feels...I've also had a teary anxiety filled day...I spiral into self doubt a lot and am my own worst friend... Sending hugs...", "fleurishing": "thank you for sharing your emotional state - I can imagine writing such a personal book rips you wide open. I’ve found that vulnerability (eventually) turns into great strength as the raw and rough stuff is faced head on. sending 💛", "msjordanscott": "Thank you for sharing.", "hansbanans": "❤️", "getadvancedchic": "💕💕💕Go for it 💪🏻Can’t wait to read it😄", "mirlifinnin": "🦄💪🏼🌈🌈🌈🌈", "brrrrguccii": "power to you 🙏🏾🙌🏾❤️", "roslynfoo": "There’s so much strength in sharing this. Sending you love from Melbourne 💗", "mileneroseholm_art": "❤️❤️❤️", "savvy__bee": "You are looking and sounding extra extra beautiful!", "jadee.bush": "thank you for sharing this!! we need to talk about mental health more as a society!", "kirstyjkemp": "All the love 💕🙏🏻", "dana_shulman13": "💛", "miza_____pizza": "❤️❤️❤️❤️", "iordax": "Thank you", "sashwari": "This too shall pass 🙌🏻💗🙌🏻💗🙌🏻", "the_playful_den": "So identify with that feeling of - you put yourself there so be grateful, it’s crushing, like only some people have permission to feel down and then you feel guilty and shameful. Sending love, not that it helps, looking forward to the book xxx", "billorbah2016": "Hello", "lineslovelylife": "❤️", "anchoradesign": "Sending love 💕", "ursularaewilson": "Blessings. Onward.💕", "thisisval": "You are my favorite. I feel less alone because of your openness. Can’t wait to read your book, listen to your pod, watch your stories. Thank you, thank you, thank you. A million times over. 💕", "thebabylossdoula": "I'm sorry you are having a hard time. Please reach out if you need my support ❤️", "honeybeecraftstore": "Think of the end goal... healing hurts.... but it's all.in the name of progression.", "anabelzenithelizabethannbanana": "💗", "hollymariataylor": "Love you 🧡🧡🧡🧡 you’re doing great!!", "finolajewelry": "@jengotch gonna read the HELL out of this book!!🙌🏼", "katjaoksanen": "❤️❤️❤️❤️❤️❤️❤️", "reem__mema": "Is that all for a book , ok when will it be published?!", "martinhardstark": "Stay strong you're not alone.", "charisse.kenion": "♥️♥️♥️", "momojojena": "tears, pain, frustration, shame- all of it- ALL GOOD. Allowing yourself to really feel it, even better. You can’t run from what must be felt. This is all so good. Energy is releasing, moving, shifting. Let it flow 😭", "daydreaming_sarah": "That does sound awful! The dentist alone is bad enough. Sometimes though a big cry and a scream into the wind can be just as healing as all the other self care things. Hope you feel better soon xx", "ma_mira14": "🤗😍😘😘😘", "rosie_oconnell_": "Thats where the light get in.! x", "ohmeedofficial": "💛💛💛", "mellllama": "❤️", "annaroslily": "Thank you for being so honest, Jen. You are ALWAYS an inspiration! Always. And the work you do is amazing. ❤️❤️a lot of courage to you!", "mommagerlynz": "@jengotch You have been the light at the end of my tunnel when I didn’t even know it. Your posts and stories were the only thing that made me smile a few months ago and what got me to take charge if my life. I know the hurting us hard and being vulnerable sucks but just remember who YOU are. YOU are JEN GOTCH DAMMIT! And you are more than OK. ❤️😀", "mayucasalt": "You are amazing 💗", "mashallah_us": "Tears water are soul. 💙", "beckslyn": "💖💖💖💖", "katifriti": "❤️❤️❤️sending love!", "ayla.suede": "You are AMAZING! ❤️👑", "jososoto": "💗💗💗💗💗💗 You are amazing!!", "sandydeasey": "Breathe deep and don’t overthink it. Keep going, and you’ll get in the flow. You’ll get there. And I can’t wait to read it!", "ddep77": "let it go girl", "marcelasenise": "♥️👏🏻", "therealthaibarani": "I can relate. Hugs to you babe.💛", "themakeandmary": "💕", "jkklynx1": "Sending you a big hug 💗", "colourtheorist": "🤗💙", "christine7774": "Exactly where I’m at 👍🏼 thanks for sharing. Don’t feel so alone", "rebeccagayheartdane\nVerified": "Verified", "natplays": "💗💗💗💗 You're claiming & sharing your story moves us all x", "alanalt1": "❤️", "the_untrained_eye": "You’ll come out the other end girl, it’s part of your experience as a writer and super cool, empowering, girl with amazing long hair! #gojengotch You’ve got this @jengotch 👊🏼💛🦄", "yourneighborhoodkee": "I ❤️ you", "yourbiggestfangrace": "❤️💕❤️💕❤️", "cuzihave2": "Your AUTHENTICITY is infectious. THANK YOU JEN ❤️", "suzanne_the_writer": "❤️❤️hug💚💚", "amyrosenet": "You are already achieving the goals you want for this book! Your posts always make me laugh, feel less weird and provide a little light through dark places. 😘😘", "cynthia_simos": "❤️", "pescaitasalvaje": "Ay dio. Y cayo la piedra. All is real. Pero estamos bien! 👌🏽💫🙏🏽", "christinezietsman": "I feel you!! Thank you for being so real!! 🙌🙌", "scoopsofpoops": "Thank you for sharing this. 🧡", "monkeycat1212": "You’re obviously very loved! Take your time to heal, please try doing things that make you smile and laugh, as superficial as it sounds, it can be a helpful distraction. Take care, sending you healing and happy thoughts!", "saltycharliestudios": "i see you Prettygirl... we should have a slumber party 🎉", "storieswithtori": "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "monicamorris_jav": "I just love you.... your rawness and honesty. Thank you for always being real, thank you for giving me the guts to fall apart in front of others then put myself back together and not think I’m losing my damn mind when I start falling apart agin. Love you Jen, and it really does sound awful going to the dentist naked. #keeprising", "itsjessrangel": "You can totally give yourself a mental health day and watch The Walking Dead drunk and start back at it again the next day. THAT’S OKAY.", "allisonmadi78": "You’re amazing. Can’t wait to read your memoir.", "jvla1975": "I was just thinking yesterday, where is Jen Gotch? Then I remembered you are writing and I’m sure writing your book brings UP lots of stuff. You got this. Sending positive vibes West tonight!", "jrockmcgregor": "❤️", "invocateur": "You keep going girl and we keep rootin’ for ya!!🙏🏻", "gilbertbrenner": "🙏🏽💯❤️❤️❤️", "mschristinavictory": "❤️💥❤️💥❤️💥❤️💥❤️", "thebunnyatx": "Deglamorize success. It’s great and good, but ultimately there is a price 💓 but freedom of choice & time and place for it", "atelierchaser": "I hope you can feel our love and support ❤️❤️❤️❤️❤️❤️", "angeladeane": "No solutions is what has kept me at my strongest and most optimistic. Love you J♥️", "meelfp": "💓💓💓 it’s ok not no be ok all the time.", "kaitlyn.luckow": "Sending you all the love in the world 💖", "lambert.cynthia": "Going to the dentist naked, unbearable I must say. Just let those tears flow, don't fight them, they are natural. Please take care, go do one of your garage dances, they always bring joy, as you do!", "evkern": "You go, girl!", "mollymarina": "You write so beautifully, i can’t wait to read your book. And please, keep on keepin on, you gorgeous, powerful woman!", "brazenjewelry": "Strength is in acknowledging it in the first place. Your vulnerability is what sets you apart and your strength is manifested in the ability to be vulnerable.", "slowandsimpleliving": "Sounds like a painful beautiful place you are in...and just where you need to be to get the heart of your message out... Peace💕", "claraclough_art": "This meant so much to me right now", "i_am_zuri": "The river needs to flow.. let it flow. Break down to break through. Sending love ❤️", "anniezmrmn": "you are loved, you are seen and you are heard💜", "constancezimmer\nVerified": "Verified", "karen.albright": "Your audience has felt all of those things and because of that, they will never judge, will always understand, because they relate. You take care of you....so you can come back to it another day. But it's like they tell new moms....you have to take care of yourself first or you can't take care of your baby....Your \"baby\" needs you to take care of you.....no guilt, no shame. Sending love ❤", "myriterotstein": "🙌🏻Witnessing you and sending you love 💕 just as you are", "bacheloretteoffinearts": "So proud of you and admire your wisdom!! #internetmentor xoxo", "allison.delong": "Thank you for sharing and continuing to destigmatize and deglamorize.", "tismejenny": "❤️❤️❤️❤️❤️❤️💓", "melinda.marie.c": "❤️✨⚡️💖💪🏽👑🐶🦋", "atkelley": "My new normal as well.", "saraannstyle": "You are so inspirational and I can’t wait to read your book! You’ve been such a huge help to me over the past year with your brutal honesty and it makes me feel like when I go through my bipolar stages that it’s normal and I’m not in it alone. 💜", "tia__martinez": "Thank you for sharing and continuing to be inspiring regardless of emotional state. You share that it’s ok to be vulnerable not everyone is like this. You are a breath of fresh air. Big hug❤️", "umnia": "Feel it all!! ♥️💌♥️💌♥️💌♥️", "annmariemcqueenabudhabi": "Heroine’s journey 🤗❤️", "mrs_sandrita": "💝", "natespees": "Powerful truth. 💯", "salateando": "❤️❤️❤️", "klevergirl": "❤️", "rlj_peacesign": "Love the whole tirade of realness. And I love the ❤️ earrings accessorized by your tears.", "hannylynch": "❤️❤️❤️❤️❤️❤️", "desimckinnon": "💞", "travelwithlei": "❤️❤️❤️❤️❤️❤️❤️", "localbananaman": "❤❤❤❤❤❤❤❤", "paperandwillow": "💗", "cmaisonblanche": "You are an amazing human. ❤️", "hanne_storm": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "kristianity9": "Sometimes all you need to feel better is to get those thoughts off your chest! Or see someone else feel vulnerable enough to do so. Glad you shared ❤️", "zacharycrane": "That’s exactly where I have been lately. Hearing you explain it made sense. I’m not in a spell either. I’ve been doing exceptionally well for a minute now. The Prozac is working. I do feel a sadness though. Like I’m missing out on something everyone else is getting that I never will. I’m jealous that you get to cry. I haven’t cried since August when I was put on Prozac. I have blue balls of the eyes. Stay strong, Gotch. Too many of us need you", "shopkathyweller": "Oh my god thank you for hitting that post button. This must have been so hard to write. I’ve never written a memoir and I cannot even imagine the psychological torture that would take me through. That is the thing that stops me sometimes from writing from experience or making a video about an experience. Because you have to relive it, turn it inside out and swallow it and digest it all over again, and it basically hurts less to not do that. Why would you put yourself though it? Because you know it’s gonna help SO MANY people and you have that foresight and that appreciation for how you can truly help. So, THANK YOU. 🙏👍💖", "holisticchefhaley": "Thank you for writing this book. Your words mean so much and it is going to be an absolute privilege to read them. 💗", "odettewilliams\nVerified": "Verified", "tkbitner": "😢💕💕", "olypaw": "♥️ thank you for sharing", "mariemiclotmakeup": "your peeps love you, @jengotch! so grateful your point of view exists!", "yinashville": "💗", "ima.nature.nut": "🐛.......🦋", "mytribe_and_i_runs": "Amen sister...I get it. I’m there too. In my own kind of torturous state. Self inflicted.", "winterberryboutique": "You are so inspirational. There are times where i feel so alone and you always make me reslise that there are so many other people dealing with similar issues, no matter who they are. It's okay to show your emotions and be vulnerable and that's something we all need to remember ❤️", "frenchbuckets": "Birth ❤️❤️❤️", "littleshopofwow": "You’re a beautiful, creative and magical soul🦄🌈Thank you for sharing this vulnerability. Let’s keep waking towards the light. You got this 💪🏼❤️", "bluelapiz23": "❤️ 💯 Breakthroughs are never easy. To get there we must shed our old selves and give into the \"more\" of ourselves that we have struggled to fight for. Keep up the fight sister 💪👊 It's worth it! And thank you ❤️", "a.beautiful.symbiosis": "✨❤️🙌🏻 Thank you for your openness and willingness to be vulnerable", "heymelwest": "Thank you for keeping it real! Sending you lots of love ❤️ because you bring lots of hope and joy to us!", "v_train": "💜💜💜", "karlazcamera": "❤️🤜🏻🤛🏻❤️", "glacce\nVerified": "Verified", "teatoastandturmoil": "i love you x", "heatherdprovost": "💛💛💛", "icon555": "I love you Jen Gotch! ❤️", "oftreesandhues": "♥️♥️", "awinthrop": "💕 Hugs", "pattykimcunningham": "Just keep going 💪", "chelseaschreyer": "💛💛 this resonates with me so so much.", "cindybmetcalf": "I love you!!xoxo", "brightbazaar\nVerified": "Verified", "nistrenger": "Much love! You are a light in darkness and have inspired me in a direction of self care and realizing I am worth it 💪🙌", "kimbers2882": "😘🤗", "chrissyjpowers": "Jen i couldn’t love or appreciate you more. Your vulnerability makes me feel okay. Like okay to be myself, okay to to love but also dislike the phase of life I’m in. You’re a gem. Keep sharing.❤️✨", "carolinacoronel": "Bonita💖", "homayraelsayed": "I wonder that there are times I just feel miserable, alone and depressed. Yet I sometimes cannot fix it it’s like this depressive cloud on top of my head. Then I sit down and say it’s only temporary then it goes away. I wonder that I have helped people through their sadness I forgot to heal my dark pains as well. It’s okay to cry and it feels good to cry. I cried and it released some inner pain that was harboring in my heart. I had to realize I cannot control things that are uncontrollable. I also realized that it is what it is and not care about dum things. I only survive day to day and not worrying of my past or the future. That keeps me going. Thank you for your post.", "chicksincharge": "❤️❤️❤️", "angelfirenze": "Bravo!", "christalinc": "🤗🤗🤗", "chandrawellness": "Sending you love and light 🙌🏻🙌🏻🙌🏻 appreciate your story and journey 😘", "jacquelynwarner": "I am literally doing the same thing right now. #samesame", "katgreenrocks": "Oh wow you are speaking my truth. I call it “when I’m in it” or I feel like my brain is sick. I’d like to talk to you. I’m going to send a PM. Thank you for your honest social media", "natdrummond": "I can’t wait to read your book. Sincerely.", "thegoldatlas": "♥️ hope you see the light soon. Hang in there, we're all in this together.", "saintpetegirl": "You are a brave, honest woman! 💖", "kaitlinmgreen": "❤️", "cherylsphotography": "You're not alone.", "barcodepapell": "🙌🏽 I admire you so much! 💕", "vivalavi": "Wow! Be strong ⭐️🙏🏼", "justlovelybel": "Praying for you 💕🌸", "djsantiago21": "It's my normal too and I don't know why. Thanks for sharing. You are NOT alone. ♥️", "oliveandoakinteriors": "Thank you 🙌", "dbhboutique": "💖❤️💖", "slinkyrabbitgirl": "You’re getting it done Jen. This is the work, you’re letting it all out without going under. Warrior woman amazon wolf 🐺", "theneonmuseumlasvegas\nVerified": "Verified", "staceycisco": "❤️", "gabsfarfang": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "leannlay09": "❤️❤️❤️❤️❤️", "jen_st.j": "So sorry for your pain, hope you feel better soon", "srfchk17": "I do not know you personally, Jen, but I am so damn grateful for you. Thank you. My friend @jamie_mclynn made me a “Bando Book” for my “thank u, next” themed birthday instead of a “Burn Book” and it was as incredible as you imagined. 💋💕🌷🤘🏼🆒", "yaz4all": "I feel all these feels! Thanks for the company; you are not alone and I dream of a culture that feels so deeply (with those glorious and beautiful tears that encapsulate the human experiences w a nuanced understanding) 👏🏻👏🏻👏🏻 I appreciate the vulnerability", "bec_flower": "💙💚❤", "extrablushplease": "I am praying for you Jen! I used to carry @shopbando in my fashion truck and I closed my business because of everything you have posted right here. I went through it all. No one will tell you that being successful and “ having it all “ is a lie and a facade. I had to experience it for myself to come to the realization you’ve already come to. You don’t have to try harder, be better, be stronger. You are fully accepted just the way you are and God loves you and so do I. Just rest and know you’re in his loving hands.", "chris_hutcheson": "sending you hugs!", "ketchcreative": "Feeling this. I thought my meds were working and I was doing better for so long - so I felt a great deal of shame this weekend when an event triggered an episode. I wanted to believe so much that they were a part of my past. Sending love your way. You’re not crying alone. ❤️", "mslidiaalvarez": "❤️this is what I needed to hear right now. Because I’m feeling very similar. And it’s nice to know you’re not alone", "hatery_moods": "💓", "lauracthatsmee": "I've found it can be so hard in times when I somehow get stuck in vulnerability overload. It happens to me sometimes when I'm writing. Perhaps remember that your book doesn't have to be everything to everyone. And perhaps think of it as your first book - you can write more books that accomplish more things, so there doesn't have to be the pressure for this one to say it all. ❤️", "tarawhitney": "RELATE TO THIS-especially the end-SO MUCH💕", "sarah.allee": "💜💝💜💟💗💜💕", "hawaiian_asian_goddess": "Thinking of you hun!! You are loved by many, including me!! 😍🤗😘sending you hugs and tons of positivity your way!!", "bmarshall\nVerified": "Verified", "kauffmanfarah": "❤️", "tkjcollins": "Thank u so much for sharing this, and that there isn’t always a solution. I have a rly hard time sharing with my friends or anyone when I am in this similar place ur in, bcuz I know it’s just part of the process, it all comes in waves.. but I know if I tell anyone how I am feeling they will want to offer a solution or try to help me find a cause and I just want to be like no no no it’s not like that u guys it’s rly ok I just have to feel this, or not feel it in ur case... I’ve been there too. It makes me feel less crazy to see it here... to know maybe I am on the right path of learning to live with it, and that maybe more ppl will eventually know that there is not always a solution, there is just being, and being there for the person who is trying to be. All my love. U got this. ♥️♥️🍀🍀", "christenamelea": "I relate. I stop myself from doing things that leave me stuck it on pause because the only way through is forward", "lorim_5": "Don't ever stop showing the real authentic you♥️", "jenifer.rod": "Love you and thank you for always staying true and raw af ☝🏽💞 you inspire and encourage me in so many levels as I relate 💯 thank you thank you and you got this ☝🏽💞💞💞", "shaunamahern": "Thank you. I finished the manuscript for my memoir in December and I cried every day from October to December. It was so raw. And now I’m so glad for it. (But ask me when it is published.) you’re brave.", "amandajozone": "🙏", "luluandsuch": "I needed to see this today. Thank you so much for sharing. So many of us need reminding that their is light at the end of the tunnel 💗💗💗", "dana_what": "Ferocious internet hugs from a stranger to you ❤️", "giddypaperie": "Persevere, patience and peace be with you. 🌈", "jessiemcpherson_": "💛", "kathanista": "💙💙", "mmesadierae": "Hey I feel this right now and today just this morning and all day yesterday and thank you. You’re doing a really good job. 💓", "_wildandlovely": "Your authenticity & vulnerability is what makes you so beautiful. Sending hugs from someone who can relate in so many ways. Thank you for sharing your journey with so many of us😢💝🌷", "54321.live": "@jengotch all that and you’re still a 9.8 in my book ❤️", "makelemonadeco": "Sending you some lemonade because we hear you. 🍋🍋🍋", "melissann619": "You are inspiration and are so strong by showing us how vulnerable you are by sharing your struggles. Society isn’t completely comfortable with mental health issues and I applaud you for sharing so openly. I do the same to anyone who asks or will listen. I am not ashamed of my struggles or journey and if I tell 100 people and it helps one, I’ll be happy. You got this girl, we are all rooting for you!!💗😘", "roliverz": "💙🙏🏻", "candiaraquel": "🙏🏼🌈♥️", "carolinesomers": "🙏💕🙏👏👏👏", "designdeamore": "💗🤗💗🤗", "mavenevents": "❤️", "thechapterunknown": "Love this realness so much. You are credibly not alone. Thank you for being you. 👏🏻♥️🙌🏻✨", "ashleybsword": "♥️♥️♥️♥️♥️♥️", "daish": "You’re doing great things. You are helping me personally, and so many others in beautiful ways. Thank you for taking this time to reach into your heart and sit in these painful places. Can’t wait to buy your book ❤️", "samisace": "🌹", "saramoon": "💞💞💞💞💞", "novemberjuliet": "You are an inspiration", "lahlahlah24": "Sending you love 💜, compassion 💛, and a warm all encompassing hug .", "michellelynnandersen": "Thank you for sharing.🤟🏼💚🖤", "omarchico_the_explorer": "Keep going Jen! You can do it. 🙌🏼Have your cry. Ain’t no shame in crying and feeling. Sending light and love your way. ♥️", "_heydear": "Sending all the love and it’s brave you showed up today x remember moment by moment lady.. cheering you on ❤️", "awhimsywonderland": "So much love and respect for this vulnerability. It exists in all of us. ❤️ keep on going, babe.", "malhallaa": "💛Good things coming don’t give up", "kaylamkitts": "❤️❤️❤️❤️", "mildadesigns": "sending love to you JG. Writing thru pain, and purging and becoming vulnerable thru this process is so beautiful to see. thank you for sharing ❤️", "laurenlograsso": "Love you, Jen!!", "redefininghealthy_rd": "Thanks for the reminder that we’re never alone🤗 plus we’ve made it thru 100% of our bad days, these will be no different", "nessiemimi": "❤️❤️❤️💜💜💜", "subtlerevelry": "Being able to be vulnerable is the true strength!! 💯♥️💪", "thelovedesignedlife": "oh yes to this. writing any of my own personal struggles out, while cathartic, can be such an excruciating process. I hope you fine catharsis in the process, and perhaps some peace by the end of it.", "robinbesnia": "💓💓💓", "cozy.posie": "❤️❤️❤️", "baesicallyemily": "Truly can't wait to read it!", "cclombardi22": "I feel you and love you for sharing with us. ❤️", "clairemccallumcreative": "💛💛💛", "misterjones_and_me": "This. ❤️ Thank you thank you thank you. I never feel less alone than when I read your words and it’s as if they are ripped from my head onto this little screen. And I feel seen and heard.", "sss_long": "Thank you, Jen.", "lalymilan23": "💪🏻🙌🏻Strength and courage. Feeling are meant to be felt. I am sure there is a purpose on what you are experiencing and also making you stronger. Just never stop trying to find the light like you say ❣️🧠💪🏻🙏🏻 I am so proud of you for being able to put in words many times I feel similar and I can’t even find the words or find the strength to look for words ✨✨✨Recognizing and being aware of our weaknesses can be the road to turn them into power", "tableanddine": "♥️♥️♥️", "kellyyyanderson": "💜🙌💜", "isitjanedoe_": "Jen no 😦", "dianaladio": "Sometimes crying feels so good... like it’s our body’s only way of deliberately and physically expressing what it’s feeling. I welcome the clarity, but also battle the “this isn’t a big deal” guilt. Clearly it is a big deal. **hugs**❤️", "leopardprinty": "If your book is anything like this post people will love it! Speaking as a psychotherapist, what I have learned is that the only people who can come up with a person’s solutions is that person themselves, give people some tools and your story and that will be enough! People need to be listened to and given space to work thru their own solutions I think you are fantastic at empowering people & your open vulnerability is such a gift✨ 🙏🏽✨", "theodorable": "I love what you said about deglamorizing success and that you’re pulling back the curtain on book-writing. So often we see the triumphant book deal posts and the shiny product but not this, the part with the real work. I can’t wait to read though ❤️", "tayandtoast": "yew inspire me to be as fearlessly open about all the things & weave in humor & i see yew & i relate & it turns me to create & ventilate 💖🦋✨", "aprille.mountainlover.dawn": "❤️🙏❤️", "miss_carla": "As you continue to walk through this, and process all of it once more, you will come out the other side feeling lighter and brighter. Or so I’ve heard. 🥰", "ginaeyes": "Thank you for all the feels that make you squirm, you are not alone as I know now, I am not either. So thank you @jengotch", "shannahkatz": "Xoxox", "angdegrazia": "❤️", "sarahcappie": "💛", "jessicablair91": "@smcny911 this woman is my everything @jengotch", "theburbgirl": "You are a true blue ❤️", "the.land.of.os": "🖤", "sobremesa.zam": "♥️💕♥️", "victoriasuzanne": "You got this girl💋 proud of you for sharing💕", "sandiafria": "❤️❤️❤️❤️", "barbie62": "🤗,Jen.", "kathleenbush": "Hey lady, be gentle with yourself 💛 one day at a time. Incremental progress, big or small, especially with writing a book, is most important, not solving it all in one day. Let go of the little things that add to the stress and pick them back up when you’re ready! You got this!", "dirtyreal": "❤️", "sallyswensonart": "LOL! You’re so wonderful!", "finding_golightly": "✨🙏🏼✨", "ashleyll0132": "It’s unsettling, right? The language of man’s heart not so satisfyingly mapped out like the physical sciences; there’s definitely a greater intricacy that continually challenges us when we think we’ve got it all together. You’re definitely not alone in this and your words, whatever the context/state, continue to be a rich resource. So thanks for your energy in pressing on. All of the greatest minds in recorded history have yet to provide an end this “hole” in our hearts. But your persistence, I believe, reveals you know your tears are not falling unseen. Each is a reminder that love’s not a cold, rigid equation to be solved. It’s wild, steep, costly to pursue...everything we’d attribute to something being precious and what we cannot help but crave. The “solution” is dynamic, we’re never meant to exhaust it’s resource/revelation, and in that hopefully there’s some peace knowing your efforts to understand and share your ever-expanding hues of knowledge and love worthwhile and very much needed by so many others trying to find their way.", "mizzpeachy64": "Let me state the obvious: You are enough and YOU ARE NOT ALONE. You give me a place to go when I need validation. I’m forever grateful for that safe space. 💜💜💜", "jadegilmore1": "❤️❤️❤️", "statementteesandthings": "♥️♥️♥️♥️", "marlawhite": "♥️", "meganhollyclouse": "Always so glad you share, the good, the bad and the honesty. 🌿", "sunloveystyle": "This level of realness is what we all need to embrace, thank you", "shellsun_": "Going to the dentist naked surely does sound nightmarish. Squishy hug! @jengotch", "rah.royal": "you are not alone. you are so strong. ♥️", "hellohadleygirl": "💗💗💗 (And yes, that does sound awful 🦷 )", "dayna_mahon_": "Thank you for being your beautiful, authentic self. 💕 Much love ❤️", "flutterby07": "Proud of you for acknowledging your true feelings. I’ve been going through similar issues for over a week. All I can do is be mindful and embrace the sadness before I can move forward. Your story doesn’t have to be perfect to share no matter who you are. Your story is worth sharing- always! Sending you peace and love 💕", "honeycomb_homedesign": "❤️❤️❤️❤️❤️❤️❤️", "samichammas": "❤️❤️❤️😫 I love you. I cherish you. You’ll find a way.", "leeann_k_photography": "🙏🏼 We all need more truth. Life is fucking hard sometimes and vulnerability even harder. Keep it up because your story will help others. ❤️", "sayhellobirdie": "Thank you for sharing from such a place of vulnerability xoxo ❤️", "megallancole": "❤️❤️❤️❤️❤️", "fromthewildau": "Thank you for sharing all of this with us @jengotch it really is truly enlightening and for me it's like every time I read your post I feel educated and enlightened in my own mental health journey 💗💗💗", "bminimal": "Im super pumped to read it.", "r_hirsch": "This totally parallels a lot shit I’ve been dealing with. Thank you for sharing💕 we’re not alone!", "lasley_": "♥️ U got this!! Support from NC!", "thenook_online": "👏👏👏 Thank you for sharing yourself so rawly and openly @jengotch", "calmwithyoga": "Thanks for the responses and rawness and for getting your ass to write us all a book! Your reflection is as @glennondoyle says “brutiful.” Namaste. Looking forward to reading your words. 🙏🏼 💗", "adeservingdandelion": "💗", "brooke9464": "❤️", "taravictorial": "🖤🖤", "stonelasvegas": "Beautiful words. Chin up young person!", "lee_geach": "Love you ❤️", "a_schwa": "Sis, this has been me all week. Thank you for sharing. It is always meaningful 💖", "bornaunicorn113": "❤️ you, Jen.", "katie.g.jackson": "Thank you.", "neety": "Depression is a cunt. Sending you lots of love and healing energy. 💕💕💕💕", "heidimeadow": "Thanks for this. So helpful!", "danikabrysha\nVerified": "Verified", "supersooz": "❤️", "lisamaurine": "So much more than this but you really do have long, beautiful hair. ❤️❤️❤️", "agusmoraco": "@jengotch feeling the same way lately and thankful for your post right now cause I feel like I am not alone", "rebzog": "I love you and your authenticity", "aleishacd": "I know you, and I know you’ll figure it out. Hang in there. We love you wherever you are in your journey. ❤️", "sydney_ga": "Love you!", "lilahstarrstormy": "Incredibly brave - you are an inspiration", "spectacularbear": "♥️☮️♥️🌈♥️", "kaleidacuts": "Deglamorizing success. 💚💚 it’s hard and often lonely... thanking you for sharing your self with us 😘", "susantwohig": "😘", "agelesscrush": "😍do this", "jessleewilson": "Hard to see you suffering. Hope all the support here makes you feel less alone. Once the storm passes - I hope a good life affirming trash-dance will shake loose! ❤️", "ymggmy18": "I’m with ya....", "laurasthings": "Just sending a virtual hug 💚", "brainbowss": "💖💖💖", "e.vie77": "❤️❤️ Embrace who you are and what you feel. It’s beautiful and natural. Thanks for sharing", "laurelanneb": "We all love you so much. Thank you for sharing, and thank you for always sharing. You really have helped me feel better over the past year!", "shopdavidpeck": "❤️🙌🏼❤️🙌🏼❤️", "gentryfied__78": "🖤🖤🖤", "stung_by_samantha": "🌹🌹🌹💕💕💕💕💕🌹🌹🌹🌹🌹", "mythreesons": "💛", "katiabless": "Thank you for your honesty, it’s inspiring. 🙏", "karen.in.the.citay": "There isn’t always a solution... you just make your way through it 💛💛💛", "anneptodd": "Stay strong, and thank you for being real 💪🏻😘", "suzimojock": "Thank you for this. You are doing what you have to do and that, in itself is strength. Good job.", "suzysatire": "So accurately stated. Love you and this post ❤️", "sopphho": "my mantra is always “feel it fully, let it go.” release your emotions however you need to — we’ll all support you. you’re strong and beautiful and i can’t wait to read your words!! 💕", "oftenwander": "You are amazing Jen gotch. What you do is so powerful and you are strong af. The universe and so many people in it LOVE YOU.", "ksmart": "♥️", "vintageliferedhead": "So many of us clearly can relate as I read this thread. Although you owe none of us anything, you choose to still give of yourself by your honesty. You got this girl. The light is there. Keep moving forward. 🙌🏻 Much love💜", "weelicious\nVerified": "Verified", "isa.alex.skincare": "Thank you for sharing and keeping it real. You have an incredible platform and you are choosing to use it for good. Thank you! 🙏🏼 Mental health is constant battle for many and perhaps all of in various degrees! ✨🙌🏼✨", "renbalesrhodes": "Knowing all this, the process the pain, the tears will make reading your book even more meaningful.", "rulsfontana": "You’re so brave ♥️♥️♥️ thank you", "asiazimmerman": "A strong person can recognize in themselves and share that honest observation. Something that helps me a lot is listening to @impacttheory on YouTube every morning in the background while I’m getting ready for my day. I have found it gives me a good foundation and teaches me a lot about myself and how to handle these things as they come more.☺️ I know you’re not asking but I thought I’d share💗", "loisseco": "You are incredible! Keep moving forward. Brave brave woman 💛", "theresapoborsky": "Sending you much love! 💕", "kelly__midori": "@caitlynmaryart maybe good timing to send you this after reading your latest post ❤️ love you", "365dots": "Thank you for sharing ❤️❤️❤️", "jmasouthbay": "I don’t know know you I just know you from here and I appreciate you here so much you are a gift to me to my life to my healing you mean so very much to so very many as you know not just us here but all of us here there and everywhere ♥️", "nicole_dunstan": "Reading this helps more than you know! You are persevering and inspiring.", "_corr": "💛💛💛", "katieaselton\nVerified": "Verified", "sabrinaf0rbes": "Lots of love. 💛🌻", "larkquill": "❤❤", "broolala": "Wow, thank you for sharing ❤", "soapboks": "You’ve come this far, keep going. Thank you for sharing.🙌🏼💕", "patriciaobandoa": "Brave and strong woman 💙💙💙", "chrissyweems": "🙏🏼🙏🏼🙏🏼", "imaginaryfiction": "You are amazing and I appreciate your rawness and vulnerability with us 💕💕💕", "_jayrams": "💚", "carolynkerrart": "You are brave, thank you for sharing!!", "erinwalters3": "You’re amazing!!! Because of you, I went to get help, and have been reading You are a Badass! ...first book I’ve finished in a longggg time. Thank you for all that you share 🤗hugs", "ggypsy_lady": "Love you! 🙌🏼❤️", "catdayafternoon": "I love you, Jen Gotch. You beautiful stranger. ❤️", "misfitmetaphysician": "🔬🔭🎄", "chipotlepepper": "💕", "kellyamccartney": "Sending you a big hug. Miss seeing you on here. Take care honey! ❤️❤️❤️", "gabixgutz": "❤️❤️❤️❤️", "_oxford_comma_": "You are such a beautiful person, with such beautiful vulnerability and a beautiful mind. Thank you so much for sharing your truth. You are so brave. I’m with you. ♥️", "jessjessieschultz": "You are seen. You are heard. Your message and life is valued. And you are LOVED!!! You help me feel less alone with every post you make. Thank you for being you and sharing yourself with the world.", "valleygirlmontclair": "Two words. Celery Juice. My depression disappeared in one week. Have to follow the protocol. @medicalmedium 💕", "anomadicabode": "i am a third of the way through building a house and i can relate to this on so many levels!", "albregia": "Never think that your mental health takes away from positive things. Even when you’re experiencing personal growth and success, it is normal to struggle. It is change, it is pressure, it is something you haven’t lived through yet, and you don’t stop being strong and brave and thankful if you feel like crying and walking around with a blanket covering you. No one asks to feel this way. It’s a symptom of a larger disease, and just because you dared to be the brilliant lovely woman you are doesn’t mean you have to quietly suffer through anxiety and depression. I see you, Jen. I admire you a whole fucking lot. And you absolutely need to cut yourself some slack. You can be blessed and struggle. You can feel privileged and lost. But you don’t deserve the heartache and the guilt.", "amandachaoss": "My God. Thank you. You're amazing and somedays I can't even speak because it's so painful to just 'be'. I want to go get a bottle of vodka and forget these feelings. Let's stick together and do life. Because it's painful and beautiful all at the same time", "jaxquackenbush": "This to shall pass my lovely. Believe it’s the seasons of raining shit right now.", "stacyann2": "I hope you know that there are a gazillion people who love you and who are on your team cheering you on. You brighten our days, and we think you are so special. Thank your for the vulnerability in sharing your rainstorms, and your sunshine. 💕", "hellomadge": "I saved this before I liked it because it was that important. Thanks Jen ✨", "shermanator809": "❤️", "crazykt81": "💚💓💚", "anndanger": "I love you, my nevernude friend 😘💖", "shree.lasya": "so much love @jengotch 💛💛 u got this grl. we all got this. I find myself reminding myself every day now that it’s going to get better. 🌈💗🌈💗🌈 some lows are really low but they all pass. and there is definitely light at the end of the tunnel ✨", "claraparkes\nVerified": "Verified", "alliejeanduff": "💗💗💗 Thank you for everything you share with us!", "aguyatt": "You got this @jengotch ❤️", "jesstinybird": "So thankful for your vulnerability and transparency.", "elouisea55": "Thank you. Thank you. Thank you. It’s temporary.", "misssmeliss": "❤️❤️❤️", "mrs.shannonlewis": "And please deglamorize success. It is often if not always a hollow trophy. Thanks for your vulnerability.", "citizen_312": "Your vulnerability is your super power. You are deeply valued and loved by so, so, so many because of that. We’re all here. Take your time, do your thing. ❣️", "kcnoodle": "You are such a gift! I have so much respect and admiration for your authenticity and truth.", "norealjewelry": "Sending you all the love Jen! And thank you so much for being you and showing us yourself❤️❤️", "alliclement": "Somehow you find a way to add a laugh at the end 😅💓", "blackphoebeceramics": "Love to you, hang in there ma ❤️❤️❤️❤️❤️❤️", "shimonahirchberg": "<3", "dooleynotedstyle": "You are the realest of people on the gram, keep doing what your doing! You are helping so many!", "islawashere": "@lucky44_", "michelle__justine": "❤️❤️❤️", "pictureitplants": "So much strength in this 🙌🏻😘 Sending good vibes 💕", "ardsy": "Struggling with life, and goals, and success, and feelings, and I just want to say thank you for this. It can't be easy putting yourself out there but it's so evident there are so many who appreciate it. So thank you, for this, and everything else ♥️", "polkasparklestripes": "I hope that you know your vulnerability feels like empowerment for SO many of us! 💪❤️", "elynorandco": "Thank you soooo much for sharing this. I hate needing a solution so quickly after or even during a failure I allow myself to fully feel. I think, if I feel all the feels of this fairlure, maybe it will allow me to pass through the tunnel of sadness so I can find my solution. But alas, it doesn’t come right when you want it. So thanks for being right where you are. Many of us are right there with you.", "popixdesigns": "Keep on keeping on girl! There is light ✨💫", "katemarch_styling": "@sidhow_ love her", "luckyjennyjackson": "❤️❤️❤️❤️❤️", "clara.clear.bright": "I love you and cherish you so much. I wish I could come over and help you not feel so alone but alas I cannot. Feeling you in my heart tonight 💙💙 Gonna read that damn book fo sho!!!", "laurajaneauthor": "❤️❤️❤️", "bnevans": "💕💕💕", "saranev": "You’re a rockstar. Even when you don’t feel like one. Maybe especially when you don’t feel like one. You are doing the hard shit and you ROCK.", "mollykubic": "I hope you saw @elizabeth_gilbert_writer recent post about how writers will never know if what they are writing is good while they write it (3 days ago, 4th post in her feed!) It makes so much sense. Writing is so hard and you are doing such great work. Can’t wait to read it! ❤️❤️❤️", "wailingmoons": "I relate to you in many ways, in that many of the things I was confusingly dealing alone before therapy and some medication.. I’ve found you were perfectly able to articulate and made me feel a little less alone in my mental “uniqueness” and a bit okay to go on. Thank you thank you for being So real, raw and brave to show your vulnerability through this platform. You have no idea how much you have touched my life. Sending love and light all the way from the Philippines ❤️", "rewildingourwholelife": "It’s just a bad day not a bad life 💕✌🏼💫", "robinanng": "I can a million percent relate to you. I love you and don’t even really know you but yet I do. If that makes sense. @jengotch I’m listening and I hear you. ❤️❤️😘😘", "courtneybee76": "♥️♥️♥️", "c.beau": "You are so inspirational, and incredible. This is the definition of a strong woman. Thank you for being such an amazing example of strength.", "countrywrennest": "❤️❤️❤️", "pammyferry": "💕💕💕💕💕💕💕💕", "roxynoblett": "If the tears are following while writing✍️ this memoir must be amazing! And how strong of you to feel those emotions again, as you endeavor to share them with the world! ❤️", "k8street": "Sending you 💖!", "jendyvt": "Sending you love and a preemptive thank you for a soul-filled book that I’m looking forward to reading 📖 🤓♥️", "katwalkef501": "Love you Jen. 💗💗💗", "ash_lee_tharp": "Identifying what is happening and that you hate it. Makes total sense. 💗", "msjerodriguez": "💕💕💕", "assortedlaura": "Thanks, Jen.", "x_geek": "❤️❤️❤️", "witanddelight_\nVerified": "Verified", "autbb": "💕", "jenniferyarnall": "@ladybrookelloyd @nalaenochs", "queensparkle1": "I wish I could give you a hug! You are brave! And you share so much to help others! I could never be so vulnerable b/c in my small town I have so many “mean girl” full grown women who are so hateful & vile that they act “so sugary fake sweet” & put on such an act in public that it would make you sick, but beneath that sugary coating they are backstabbing & plotting. I have already had my share of hurt from these “good Christian ladies” who are really wolves in sheep’s clothing. They may not know that plenty of people can see their horns. For now I choose to be a recluse & not deal with these beings. They don’t care about anyone who is not a cookie cutter of themselves & they are raising mini meanie robots! It’s a state of sadness.😪", "vanesa.a.nunez": "❤️", "queenofpeonies": "You are amazing!!! Giving hope to others!! We Love You!!! Xxx", "c_b_58": "Thnx for the update", "wyles_one23": "Thank you for sharing where you’re at. I love how honest you are. So beautiful", "olsen_kelly_": "Love 💛", "kgrassby": "❤️🙏❤️ Brave girl.", "eohealing": "Sending love your way and thank you for sharing 💕", "kristinalillian": "💜", "annettegallo": "💓👏💕💕💕💕", "maryradtech1": "I am so EXCITED to read your book!! ❤️", "crissyperham": "One day at a time girl. You’ve got this, just keep sharing when you feel like it. But you know that. 😘", "myheartguide": "❤️", "rockgoddess528": "Thank you so much for sharing this and shedding a light on depression ❤️", "jadeheritage": "💙", "kirstistubbs": "💗", "ilanareznik": "It‘s all gonna Be ok. ❤️", "ange_martinnnnn": "😘", "erinelizabethj": "❤️❤️❤️", "_river.rose": "💕💕💕💕💕💕", "akleaird": "❤️", "nelletheelle": "❤️💪🏾 ❤️", "hecallsmebutterfly": "You are rad. Truly. Thank you for being your rockstar authentic self always. It helps us all in more ways than you’ll ever know ♥️♥️♥️", "itskellyshelton": "I got real@for the first time last week about my mental health. My post was met with support by both people who don’t understand mental health and those that need to know they are not alone. Thank you for paving the way (albeit with many other mental wellness warriors) for people like me, who have been hiding some of her truth. I feel more free now than I did before. Vulnerability for the fucking Win!", "ivyandstone__": "You’re a wonderful human. Thanks for your strength and vulnerability ❤️", "jaclynhodgins": "❤️", "tongsyabass": "💗🙌🏻", "mademoiselleanne": "💛💛💛 thank you to be so transparent", "jill_eastman9": "Take all the time you need. We will all be here when you are ready to come back💚", "my.three.darlings": "❤️❤️", "samgrams": "You are so brave and strong and amazing 💕", "emilymerlics": "💗", "sleapea2": "I feel bad for you🥴", "rkj340": "🙏", "ladybirdsledge": "We all in this together, even if alone rn. And tank you.", "adrod26": "@jengotch Never meaningless but powerful. Important for those of us that can’t be so open about our struggle with mental illness. I appreciate your rawness and honesty. #yougotthis", "kerrilynnpamer": "You are an amazing, real and beautiful soul. Thank you.", "caprilikethepants": "U can do it I believe in u ❣️", "jenwoodruff": "You’re gonna be ok... sometime. ❤️(also, kick ass, you got this!)", "lovelaurakathryn": "💛✨💛", "darcelmolina_128": "❤️u are just so inspiring,I have been doing good ,then,boom life shows up death,birth,&me going to Dr,saying I have high blood pressure 👀,damn.i consider myself a strong woman ,I will get by👍👍", "westandwilder": "Thank you for sharing❤️ Big love💖", "_a_r_w_3": "❤️ You’ve got this and I am so inspired by your courage.", "wabichsel": "@missrenaissance", "mayascurls": "❤️❤️❤️❤️❤️🙌🏼😘", "miracutuk": "Vulnerability is strength and I’m seeing you in your strength right now. As you process more into your light, don’t forget to practice self care on yourself with your reiki ;) it’s amazing what self reiki can do in these moments. Just breath from your heart space as you hold space for yourself and know that you are a beautiful strong goddess 💓 we see you 💓✨", "constancemariena": "You are a truly incredible woman. I’m so grateful for your vulnerability and your sense of humor—both have been so impactful. Sending all the love! ♥️", "aimehayala": "💕", "nicolemrf": "❤️❤️❤️❤️❤️", "just_jessie07": "I love you", "goatsnwaffles": "💗💗💗💗💗", "_m.chapman_": "❤️", "brookeshelby": "♥️", "lwcallon": "❤️", "feministgoodsco": "❤️❤️❤️❤️❤️❤️", "thislittlemiggy": "I can’t help but think that if your dentist was hot and available you might feel differently. But really, feeling feelings is some of the hardest work there is to do and thanks for being a good example of what another form of hard work looks like. Can’t wait to read your book.❤️", "axu_cena": "I’m grateful for people like you who help others navigate their own feelings of depression. Thank you for sharing.", "stephanietanner.rn": "This is so good. You are so good. You are better at this than you think. ❤️💯💋", "tammygordon": "Love you. Wish I could just Uber over a drunk binge Netflix with you. (Best I can offer is to plan a weekend escape...)", "eclecticwoman": "I can’t wait to read your book 💖", "darlenerosado2": "No one should be immune to vulnerability. It’s beautiful and scary and real. None of us are above it 💕", "yogabychelsea": "Thank you for this. Thank you, thank you, thank you. ✨", "ketoide": "Can't wait to read. Sending lots of love your way 💕", "raspberrypie": "You're strong and resilient and you don't have to be grateful all the time. You can embrace the suck. But do it with people who can hold you and keep you from moving backward. We are all here. You are worth it. If you ever need to talk, I'm a stranger, but DM me. I'm used to listening to people.", "ashleygoldenrule": "Love you! Thank you for sharing this and being you... I have been in this same place for different reasons and still find myself there from time to time. I think it comes with emotional intelligence. Feeling things is good, even if feeling those things doesn’t exactly feel good. I like to think it is growth and wisdom or something like that. ❤️", "wrightwife": "The lows build you up for the highs. You are incredible and worthy and so loved by so many! ❤️💖", "hcami16": "Hugs ❤️", "superchris77": "love you jen ❤️ keep going", "toniferrara": "Thank you @jengotch for sharing your beautiful authentic truth with all of us who are here to cheer you on. It’s not easy to share struggles or vulnerability on social media. Sending love always. 💖", "loriannalbright": "You’re awesome!! ❤️Keep going!!", "mishavayner": "Thanks for this incredibly honest and relatable post. Sending love to you.", "jennievaz": "Same girl. ❤️", "areroseart": "Me and my BPD are with you💜", "authenticly_alex": "@kboniface", "chrissyabram": "💕💕💕", "d_riddell_": "😘✌❤", "jujuen1": "Much love", "maggiemae1986": "❤️", "lahondaj": "✨❤️✨❤️", "iheartruby": "You are my spirit animal! 💗", "nkapes": "❤️ standing aside you.", "hannahlbowman": "💙", "meep_327": "@erin414 ♥️", "mirbrown75": "There’s no healing without feeling! 💕", "kathywilley": "💖💖💖💖", "evangeline73": "Phone a friend ... is followers can cheer you on, but it’s not the same as the one who truly knows you ..reach out 😘", "kleidendrew": "Sending 💓💓💓💓", "tremedina": "💞💞💞💞💞", "conninator": "This🙌🏽", "shellyboo28": "I relate to everything about this! You give us courage, hope, the strength to keep going. I know in my bad days it will pass and it’s honestly not as dark. I’ve been struggling with work lately and I feel like such a failure. My meds have only been stabilized since November (hospitalized in August) and I still have off days. I don’t know if anyone else has this issue but I still struggle with getting back on track with who I used to be at work. Like I’m still playing catch up but I’m just going thru the motions. But I get it done and so the best I can.", "sarahreesecollins": "🖤🖤🖤", "cloudsincolor": "Your vulnerability is your strength. Honesty in a post ✨ thank you 💕", "peechgirl": "❤️", "prettycrabby": "💕💕💕💕", "lizzywarriorprincess": "I hear you! Sometimes the worse periods of mental health are the ones we can’t put into those neat little boxes of “oh this is just a depressive episode”. Ride it out! I’m sending you love and thinking of you!", "tdimond15": "🌹🌹🌹🌹🌹🌹", "jennyfeinberg": "Thank you, @jengotch. We need your words", "carisakrikke": "I can’t wait to read your book. Hang in there!!!", "grykamille": "❤️", "pamvivier": "xo", "binnamon": "Thanks Lady - you’re a wonderful bright spot on this platform - thank you for posting 😘❤️", "lowcarbthrifter": "❤️❤️❤️", "ballenalahelena": "Hey, you're winning with that long beautiful hair gurl 🤟", "___may__day___": "I just want to sit with you and give you one of those reassuring side hugs. 💗💗💗", "uh_man_duh_": "Can we all bring our shell necklaces back now???", "britnim_": "Feel the feels, be kind to yourself, you are so loved and inspire many. There is no shame in vulnerability- vulnerability makes you powerful ❤️", "instamargg": "You have no idea how much your story means to people. You help me so much just by being you and it’s so powerful you have the courage to write this book that I absolutely can’t wait to read. You’re an icon and one of a kind. All my love.", "alwaysgeorge": "❤️❤️❤️❤️", "danielle_elyse9": "You got this girl! 💪🏼👊🏼Just hold onto the knowledge the light is there - keep moving forward, little steps at a time and you’ll get there in no time!! 💖", "msjenn__": "❤️🙏🏼", "mariamelee": "I see you ❤️", "reneemagnusson": "Loves. ❤️❤️❤️", "miss_eileen_os_home_": "Thank you for sharing 🙌🙌💗💗💗❤️", "shedrankthemoon": "💗💗💗💗💗💗💗💗💗", "farmgirlfashionista": "I checked for a new podcast today. Praying you were ok. I understand the battle, the frustration, the guilt 😔❤️🙏🏻", "colleenlaquayurbaniuk": "Sending a hug because sometimes words aren’t enough.", "urbanyenta": "I don't know what to say. But thank you for making me feel less alone in this ❤️", "travelin_em": "You got this girl, I can’t wait to read this epic book", "liveyellen": "❤️", "cleaningcold": "I’m really looking forward to your book as are lots of others. Thanks for letting us in to your world. It’s one that helps a lot of people.", "chelseagrra": "❤️❤️❤️", "bwandesforde": "Feel bad for you??? Hell no! You are delicious and brave and LIVING and i cannot waot to read it. 🤷‍♀️", "jackieinspires": "Be you. Be real. Be emotional. I hate pretending. Was doing that for so long. I'm loving me in all the moments despite the hell I get. Feelings are real. depression sucks. Life has it's challenges. But I'm going to do just that even if I'm alone. Love myself more in all feels. Beautiful post. Many emotions. True words. Keep shining. You're enough ❤️🔥🔥🔥❤️", "louforgirls": "Thank you!!", "e.m.boe": "I found you on Insta over a year ago through @busyphilipps. I have many times since referred to you as one of my favorite people on Insta.. you're the real deal and I thank you for that.. even though it saddens me to see this side of you", "thisredheadedistaken": "I love your raw honesty it’s refreshing I’ve been having that kind of day today so thanks for helping me feel little less alone", "stu_arttt": "Sending hugs your way!!! 💙", "fiorebtt": "Going to the dentist clothed is already a nightmare", "cyndi_nt": "I can’t even begin to express what your honesty has inspired in my life. I’m sorry you’re having a hard time and that writing something to help connect us has left you feeling isolated and alone. You’re not. We’re here with you. Thank you for all you do 💞", "melissafromspace": "Girl. Yes. 💔❤️💔❤️", "herwelshness": "leaning into the pain and letting it heal is where the marrow of life is. 🌈", "jette.scherzer": "♥️♥️♥️", "kevintis": "Thanks. Press on and continue to be real.", "remember_the_allienoal": "❤️❤️❤️", "hannahrog85": "Thank you for being you, and being real, and honest, and vulnerable. Know that your openness to share makes scared, anxiety-ridden women like me who feel alone in their maze of brain most days feel recognized and like we have someone else out there fighting the fight with us. You are a champion and a hero to me. Never stop being you, because you are perfection. 💗", "dmb.317": "hugs dear jen❤️💓❤️💓❤️💓❤️", "truhair": "💕💕💕💕💕", "lea_angelle": "💟💟💟", "cfavae": "Thank you!!! Your raw honesty is so rare, it truly has helped me understand my emotions and feelings. Keep going, you’ve totally got this ❤️ I can’t wait to preorder your book and cry happy tears when the amazon box arrives at my doorstep", "haloauragraphic": "Sending love. 💞", "katlyn_f": "💜💜💜", "danambb": "1. I appreciate your vulnerability and courage. Thank you for sharing. 2. I’m going to buy that book.", "daisyleyland": "I can't wait to read it. I hope you find the process therapeutic in some way 💛", "i_am_jacks_random_thoughts": "I don't know about you, but usually finally getting all this out on my insta, owning my funk, it sort of kick starts getting out of it. Sending love and I CAN'T WAIT TO READ. 💗", "cindylovesthis": "❤️❤️❤️", "pammydeetee": "The world’s a scary place. Hang in there; it’ll all be worth it. ❤️", "casie1143": "This was me on Thursday. I had a panic attack at work and I’m a therapist. A therapist can’t have a panic attack at work. It’s not how the world works. Thanks so much for sharing. ❤️❤️❤️", "shanirene": "Are you frustrated with the writing process or something else?", "taraamackey\nVerified": "Verified", "colettebeatrixart": "💗💗💗 love you Jen 💗💗💗 you can do it💗💗💗 it sounds like the feeling of lots and lots of homework 💗💗💗 you will get through 💗💗💗 and your book is going to be brilliant 💗💗💗can’t wait 💗💗💗xo", "reyah_": "We support you! You are doing a great job! Thank you for being an inspiration. 🌻 #keepgoing ; you got this!", "meltedxheese": "Thank you for your authenticity. You are freeing yourself and freeing someone else to share with your example. Sounds like we need your book. I need your book. Cut yourself some slack if the self confinement is too much to find a way to complete it while not dragging yourself through mud. Though if you need to do that for yourself do, it's your choice. 💗", "carlyeryan": "This is beautiful. Thank you 🙏 because you sharing helps me feel more “normal” in the unknown and when I also look like the above picture. All done in beauty and with grace of course.", "trista17rn": "😘😘", "hereforalexis": "A lot of us feel this. You’re not alone. ♥️", "lindseymadethat": "I love you, Jen! You are such an inspiration to me and a wonderful role model in my journey to finding mental health. Thank you for sharing. Your hair really does look great. 💕", "kimmieslc": "❤️❤️❤️", "calliopepaperie": "💕💕💕💕", "rosegoldlemon": "Love you so much. I’ve been crying a lot lately too. ❤️", "camilladallerup\nVerified": "Verified", "belenasandha": "Thank you x", "lalenska": "You’re ok. Sometimes ❤️", "jessicadaviesmetalworks": "You are strong, brave and beautiful. Wishing you all the love and power to get past this. You will! ❤️❤️❤️", "drjessiend": "Thank you 🙏🏼🙂", "tessapics11": "Thank you so much for your vulnerability and honesty. I can not WAIT fo read your book.", "carla_grbac": "💕💕💕", "jakeezaccor": "♥️♥️♥️", "cherrychriss\nVerified": "Verified", "mainermichele": "Acknowledgement is freeing.", "brinabox": "I love you and your rawness and soul 💗", "ilysacorns": "Beautiful. If you’re book is written half as well as this post, you good.", "practicalpaxton": "I love you and all of the work you do for mental health just by being real! Thank you 🙏🏻", "noxshop": "No matter what you write people will love it. You’re perspective is unique and your voice is honest. You got this. 🌹", "brandy.chanel": "❤️❤️❤️", "judiholler": "❤️ your shit girl, keep going!", "alisha_colon": "❤️❤️❤️", "autumnmuldowney": "I’m trying to be more vulnerable. My word for the year...TRUTH. Time for me to own it all. My truth.", "vanessajashanica": "♥️♥️♥️", "blackcatsabbath": "✨⚡️💕", "maisondadi": "You’re so strong! And have the most beautiful light ✨💕", "krstnmchll": "♥️♥️♥️♥️♥️", "phylish.af": "Wow. I feel this so. deep. Please don’t ever go to the dentist naked and I can’t wait to read your book!", "gabbadelic": "I feel you 🍓🍓🍓🍓🍓", "yaha0879": "💖💖💖💖", "hannahriley4": "💗💗💗", "djsarahlandau": "❤️❤️❤️", "kathrynkellytoo": "Hating to be vulnerable and doing it anyway is a super power. ❤️", "surelysophia": "I love you so much", "jvelascocafagna": "You always seem to know when to share at a time when others, like me, are crying and thinking that no one can relate to the emotions that are coming at me all at once. Bless you and thank you and we are all in this together. ❤", "allisorrigby": "Not meaningless, and as always--thank you.", "_rin_mar_": "Sending love ❤️❤️❤️ in time likes this...I been there..", "craftivista": "You don’t owe anyone anything except your own true voice. We can get laughter and whatnot from scores of people, we can’t get you without you sharing your voice, in whatever form it wants to come in. :)", "kaleyd89": "❤️❤️❤️", "melissaruiz18": "♥️♥️♥️", "regan.pence": "You make us all feel normal and okay about having horrible days/months Jen ❤️ Thank you for sharing.", "themodernspoonie": "You’re amazing for posting this.", "samae": "👊🏼❤️", "timothygoodman\nVerified": "Verified", "veroniquen891": "❤️👑❤️", "angela_spangela": "This is me RN. Thank you i needed this 🧡", "momlogyc": "Sending you many BIG love hugs and it will be okay. It’s okay to cry, they say it cleanses the soul", "solangerivard": "❤️", "veronicagimon": "✨✨✨✨✨✨✨", "imastabile": "Hugs. You got this babe.", "carlymstevens": "We are all waiting at the end of the tunnel for you. Cheering you on and willing you towards the “next” - the words that are pouring out of you now will become a shining light for others in the same tunnel. Love to you 💕", "74rku5": "Jen, I truly appreciate that you're trying to let people know they're not alone in how they feel. But you shouldn't feel an obligation to us. That's part of the painful mantle fame brings. You owe us nothing. *hug*", "rachbea": "I needed to see this today. Thank you for your beautiful mind and encouraging push in the direction of light and bravery.", "noni_drew": "It's ok to feel things. This too shall pass. #mantras", "florenzablackwood": "👁 Dry your eyes With the sounds of the universe 🔮. 🕯Gracias por compartir este proceso que te trae de vuelta el dolor, que acompaña y hace sentir bien a quienes lo están viviendo.", "jennifer.fogerty": "You are amazing and make me feel like I’m ok. Keep going. We send you love. ❤️", "ambies_nails_n_nugs": "This is beautiful 🤗💕", "studiodiy\nVerified": "Verified", "staceymeacham": "I hate going to the dentist fully clothed. It’s the worst place.", "swelldove": "Right there with ya sister 👌💗 it’s so hard to keep trusting, we are all in this dark tunnel together, the light will come and this moment will be a distant memory very soon✨", "luly700": "I wish I could give you a hug. ❤️", "camitron88": "You’ve got tons of support ❤️💕", "jillgcaceres": "Right there with you, sister!❤️", "thepetgroupies": "Thanks for always sharing no matter what is going on. Really means a lot to me. Makes me feel less alone/ less in my head/ less coo coo. You’re such a brave human. ❤️", "kasimca": "Thankful for you Jen! ❤️", "abbyjacdesigns": "❤️", "thelalook": "@sarahpulvere @amaron this is Jen 🙌🏼🙌🏼", "tubtonics": "I'm going through this too... On a much smaller level, yet the sheer terror that consumes me once a week over trying to build this brand is so overwhelming. Much love to you as I understand. ❤️", "amberkollie": "There is a light at the end of the tunnel. You’ll make it out and walk in sunshine soon again ✨", "rivayah": "I totally hear you - the stress of writing often feels lile a form of isolating psychological torture to me as well. You come across as a natural communicator and a prolific thinker, so im sure the flow will come (if not, one glass of wine should do the trick!). Good luck and know that you will be on the other side of it very soon.", "thegiftjeanius": "Thank you for sharing. It's so serendipitous to see this right now. eeling overwhelmed", "die_biene_maia": "Go easy on yourself @jengotch !!! Writing brings out all the inner demons and makes them come out from all the corners they can usually hide in. It’s part of the process don’t be too hard on yourself!! I just wrote my masters thesis so I can relate to how awful it is to put yourself out there through writing!!!", "mkandkarma": "Beautiful. Sad you either 1. Didn’t remember me. 2. Remember me but didn’t want to respond to my email. 3. Wanted to respond but trapped under something heavy. #whenharrymetsally", "paigeappel": "It will pass love. It will. 💕", "tayjohnsen": "Keep moving... I’m pushing through too.. it helps to know I’m not alone 💛", "elise.delores.richardson": "Same ❤️", "findingisrael": "Love you, Jen Gotch. Thank you for working so hard on this book, and speaking for so many of us.", "sahraxto": "@recyclable 💕", "life_of_reily": "You are awesome sauce, warrior lady!!❤️", "mare_michael_67": "You are such an inspiration to me. Keep walking through the tunnel, girl. I’ll promise to do the same. 🙏🙏🙏", "adenajpoor": "❤️", "octoberhello": "Honey. You are strong. You are.", "globalbackyard": "We are your light. Keep on coming through that tunnel. You are amazing.🙌", "nighthag84": "I don’t know you but I adore you you and Thank you for sharing and I can’t wait to buy your book and posts like these are why I love Instagram.", "chyparker": "🙌🏻 Also, you totally remind me of Sara Paulson right here. 💚", "tarynhofert": "❤️❤️❤️❤️🙏🙏🙏🙏", "sauts": "🖤🖤🖤", "candicergauci": "💪🏽", "leighlupinacci": "♥️♥️♥️♥️", "rosiecoloredglasses": "I have sooooo been there.", "okpeyton": "being vulnerable is a strength 💕 you rock, JG!", "heykaitking": "Love you💜", "smlgp": "@hilaryop", "jessjaro": "Hard things are hard and you can do hard things ❤️", "kristinevans": "The only way through is through.", "rachel_sitner": "❤️", "never.forever": "❤️❤️"}