{"billorbah2016": "Hello nice pic", "sgoose3": "Yes yes yes. You deserve to be sad and to drink and to eat donuts. Sometimes that is the only answer and in itself is cathartic.", "ashleyaziegler": "The part where you list all the things you’re tired of...... man, that is so me!!!!! I feel like you described me perfectly in this. Thank you for sharing. 💕", "solomoncristy": "Sounds like a lot of sleep is needed and often. Promise to be patient with yourself. I had to do that today. Stay present and rest. One step at a time. ❤️", "sallynellson": "I love truth! ❤️ Holding space.", "notbeyondredemption": "This brought tears to my eyes. You described depression so perfectly, it almost hurts. I love the way you write and have really enjoyed your podcast so far (I’m a new listener). Thanks for being vulnerable and sharing this. Thinking of you and hoping it all gets easier ♥️", "gimmemynikkers": "Entenmann’s are the best and your stories today reminded me i had bought some and hid them from myself in the microwave 😂😂😂", "streicherhair\nVerified": "Verified", "girlshouts": "❤️❤️❤️❤️", "goldenstatevintage": "Holding you in my prayers, darlin.❣️", "one_of_two_bees": "Thank you for sharing. Keep going - you'll feel better soon xx", "justmad2117": "Your amazing. Thank you for always sharing, I'm not alone in this and either are you💜", "brandnrd": "I understand 100%. Per usual thanks for the brave and brutal honesty. You are fucking normal 💕💋❤️💗", "jade_melissa": "I was in therapy yesterday telling my therapist something very similar. This sadness that has somehow formed to everything i think about, do, see. It hurts. It makes it so hard to go on. Everything seems vitally important & not important at all, all at once. It’s isolating & paralyzing. I wish i had all the answers. Just know you arent alone...", "whit_ny\nVerified": "Verified", "bornandraisedvintage": "You are amazing @jengotch . I’m glad i found your IG page. Your inspire me with every post. Thanks for being real.", "kywtbanota": "❤️", "sala_b": "Me too. Thank you for writing how I feel so eloquently ✨ sending you love", "paovelasco": "@aguacateyqueso", "activistmanuka": "✨✨✨✨✨✨✨", "samantharnataliee": "Thank you so much for sharing and reminding us that the reality is even though it looks like it, and as hard as we try- not everything is shiny all of the time, and beneath there is so much more. Grateful to have business leaders willing to be vulnerable and share their purest moments. #doitforthedonuts", "sillapere": "Yup", "lil_lion7": "This makes me feel waaaay less alone and super understood in going through the same waves. this gives me hope that I'm not the only one who can't quite figure out the depression / sadness madness. Thank you for being here 💜⚡️🤘🏻", "sarahjanegasik": "@steevgasik", "erios69": "One day at a time... xoxo", "marigoldcurated": "You make the human experience normal for us all and your articulation is such a gift. Thanks for baring it all to us.", "i_ninjasquirrel": "❤️❤️❤️", "agbrott": "💖💖💖💖", "bybeautifulyellow": "🥀Thanks to Jen there’s a safe place for us to gather and notice how many of us are going through this right now, with jaws aching from smiling through it. 🎭🎭🎭This post reminded me to read one of my favorite children’s books “I’m Sad” by Michael Ian Black. 🖤 to feel sad and also laugh unexpectedly then still feel sad... 🖤🖤🖤", "gel_gel_gel_images": "You have summed up how I feel most days Jen. A really long hug.", "missnakaji": "🍩🍩💖💖🍷🍷", "inlandvenice": "❤️❤️", "madzstagram97": "I too, have been strugglin on that depression train. it FREAKING SUCKS!! you cry it out pretty lady! you deserve the world and more!", "emmarrr123": "Sad should be the norm for all of us. Look what we've done to the world. Really.", "rlj_peacesign": "❤️💚❤️💚🙌🏼", "zoester": "Celebrate you moments of joy... even if it’s eating that oh so delicious donut! In that moment may you not be sad. That one moment may be the trigger to help it dissolve. Frosting always helps me!", "savethepeaches": "❤️", "hannahpage.s": "Love this 🧡 needed to hear this today", "nina.fragola": "I get this all too well. Scream and cry until you’re done. It won’t cure it but it may start to transform it.🌻💗🌻", "taylerbriann516": "You deserve all the donuts! 🍩 💜", "joiebutter": "Cheering for you FOREVER Jen! I feel all of this so much. You are wonderful and brave and I can only speak for myself but your courage in sharing takes away a tiny bit of the shame of my own emotional struggles. Get those donuts!", "ozarkmamadeer": "Sounds a lot like grief and making friends with your grief and if showing up for that wine and those donuts to visit that grief and sit in it and get through it is what you need: you do it!!! You are worth it. ✨", "hpdeloach4": "Thank you for sharing you beautiful soul!! Your honesty and condor inspire us all to live a transparent life and in doing so, maybe all feel a bit less alone. Sending light & love your way.", "t.madisonshop": "amaze 💕", "paris5555": "Same right now. Thanks for your openness!", "nistrenger": "Sending comfort and good vibes that this wave gtfo quickly. #keeplookingup", "asyouareboudoir": "Such an accurate description of sadness. Thank you for sharing everything with us.♥️", "andrea.fairservice": "Jen you have no idea how helpful these posts are for me to understand me better and make me reflect on my own experiences and emotions. But at the same time I feel so much for you I know I’m just a stranger but I want to fix it so bad. Maybe we’re both fixers? I don’t know you personally and so naturally I feel like I’m not qualified to give advice but I also can’t help but to think about all of the incredibly hard, and (seemingly) unfamiliar work you’ve been doing for what seems like a better part of a year. I’m talking your podcast and now your book. From what I’ve seen from a silly social media app it looks like your book has consumed and uprooted you so much from your daily life, a life/routine in which you’ve worked so hard to sort out so you can feel more balance regularly. You’ve done things maybe you wouldn’t have done if you weren’t all in for the book. I’m not saying those things you’ve done are wrong, or signing up for the book was wrong, I’m just wondering if this is the response your body is having after you worked so long to find a more sustainable 7.8 and then you chose to add these other challenges in that your brain and body don’t know how to handle so you’ve felt a ton of overwhelm? I hope you feel very proud of ALL of the work you’ve done, both for your mental health, and for your career and to advocate for others with mental health hurdles. Maybe this is your brain releasing all of the stress and confusion and overwhelm it’s felt these past months from the challenges you accepted and it’s just now feeling like it can let it out? Ugh this is so long winded, I’m sorry. Maybe try to let your feelings be your feelings. You said you don’t think it’s depression. Maybe you don’t have to do anything but have your cry or your scream in your car because they want to be set free. Set the anger and the sad free and maybe soon you will feel lighter again. Maybe don’t try to fix? Maybe this is your body’s way of “fixing” itself? I’m so sorry for the long winded comment. I wish I could really help! Xoxo enjoy those donuts lady. You’ll balance out again. 💘", "kkstackh": "❤️you have no idea how much your honesty is changing the world❤️", "emilyfraserkin": "Lean in", "linnkuboi": "WE LOVE YOU JEN", "molli.sullivan": "I fucking love you, Jen Gotch 🙏🏽♥️✨", "kathleen5153_coastalfemme": "So honest, raw, and relatable...thanks for sharing ❤️", "anntastic23": "I’m often zapped right in the heart by your posts, nodding in agreement and understanding and feeling less alone as I process your words. But this particular one REALLY resonates. That jagged edge of sadness I just can’t sand down, that tinges everything I do. Knowing all the while I’m really lucky and privileged and supported... but being overwhelmed by the state world & my brain nonetheless. Thanks for putting better words to what I’ve been feeling and giving so many of us a sense of feeling less alone, less crazy. Also, the entenmanns donuts? They are THE BEST.", "madeaugold": "💖💖💖", "theproperblog": "💖💖💖", "colbyloves___": "amen 🙌🏻", "katie_quart": "Thank you for being so open and honest and sharing your experiences - helps to know we aren’t in it alone 💛", "meredith.spring": "❤❤", "ant.diva": "Get ‘em girl", "minnamalja": "Sadness is okay😢. Been feeling it too for few months now", "mayascurls": "Omg yess to all of this 🙌🏼😭😰🌿🍩 💔thank you!", "amyventures": "save me a donut 💖🍩😘", "theloveknot_bycoralie": "What a wie", "dana_what": "Electronic tacklehugs from a stranger ❤️❤️❤️❤️", "shampoosalon": "Happy Sad Donut Day 🖤 love u", "ashley_neese": "💕💕💕💕💕", "badcontent.co": "Love you Jen. 💕 Thank you for sharing your story and helping others (like me) feel less alone.", "babytwins2013": "When i get down I try to think about the men and women who came before all of us . Our ancestors hundreds of years ago endured great hardship . They had to believe in a better world or we would not be here today. Now the pressure cooker world of 2019 can get the best of anyone. But remember someone before you were born endured worse and made your existence possible .;) I hope you continue to live your purpose loudly and push through the pain with lots of love and support because the world needs hear your story love! Hope you feel better soon Xox", "sewknitsocial": "Where is this picture taken? Sending 💗 and hugs", "fraulotteswunderland": "💘🍰😙 if you ever come to Switzerland, I will make you taste my favourite cookies. They are so damn good, no matter in what state you're in when you eat them. Lots of Love (and Donuts/Cookies)", "tarynhofert": "@ginniehinkle ❤️", "sourdough61": "♥️", "autismoamor": "Eat that 🍩♥️", "jenckjacobs": "💕 Keep trying to blame my own on perimenopause - but trying to do the work... seeing what sticks. And allowing myself days to just to eat the donut once in a while and cry a lot. 😘 Thank you for always keeping it real.", "chzwhiz": "🌼🌼❤️🌼🌼", "tropicalfriki": "♥️♥️♥️♥️ respect", "mari_icia": "Looooks AMAZING 💖", "safari_heidi": "Ya .. true", "dsshockley": "Wine, donuts, and a gorgeous trail at your feet. Medicine.", "neonlovestory": "💕💕💕", "lyndknob": "@house_of_jaja 🤗", "jlev1964": "@jengotch it’s okay to not be ok! 💕", "somebirdsarelikethat": "❤️❤️", "tiajay28": "💛 Yes. So true. And wallowing is ok, right. I hear you - Sending love and appreciating how well you articulate it.", "jesserker": "We love you, Jen", "johnnapgoldman": "It’s okay to eat the donuts sometimes. We’ll be right here when you’re ready. ❤️", "ajd_lari": "Some days you just need to be fucking sad, eat donuts and drink wine. Sending you love and light and the hope that tomorrow is a little less sad.", "kendraleemac_": "Thank you for being so open. It really helps me to feel more confident in my own skin", "devotion_kerrylane": "@skb136", "juletta848": "You are a rock star to yourself and many others!", "lizzielu4": "So great you are hiking. One step and then another", "hattipea": "You have a good cry - it’s our way of release! I love a good cry even if it doesn’t feel great at the time - it gets all those bottled up emotions out 💪💪💪💛", "_marijkekingma_": "Sometimes there’s a strange comfort in just going with it for a few days...like going to the supermarket without a bra on - it might make other people uncomfortable but for a few glorious moments you can be free of your bindings 😉😘 from one banana to another", "mishmash.94": "so well said, you are a warrior! ...what do we do when all the tears ( it feels like ) have fallen, and you have this giant time of nothingness. I mean beyond numb, where it feels impossible to move or talk or be a person? not sure if anyone can understand that? it's awful", "courageandcuriosity": "💚it’s so exhausting💚 savour that donut 🍩 x", "olsen_kelly_": "Yes 💛💛💛", "brendalarby": "Sadness is therapeutic and cathartic maybe. Wallow and drink the wine. For as long as it takes xx", "fox_and_weave": "It's both a blessing and a curse to feel all the emotions so intensively.💫", "baileythecavador": "@fieldpattern from my exact thoughts to this post!! ❤️", "charlotivity": "I feel you ❤️", "erinjandarawlings": "I felt very sad when I was writing my first and second drafts of my book. I think laying everything out from my life and trying to make sense of it was overwhelming. I was just sad all the time. But when I slowly emerged from writing all the time and re entered the world, it gradually lifted. I am sorry that you are in pain right now. I am rooting for you!💜💜", "zeezel": "🍩🛒🏃🏻‍♀️", "anniihirst": "You are loved 🖤🖤🖤", "silver_stork": "Honesty in its true, raw form. It’s ok to feel defeated. That’s life. Hope you pick yourself up soon @jengotch. But for now... focus on yourself. Do what you want. And eat those donuts x", "lestylejeje": "🍩💛🍩", "karenc_1984": "I don't know whether you read these comments but here goes. Honestly the best work you are doing is by sitting in it. Honouring the hurt. You will get to the other side but not by forcing a smile. It's truth. I know. As long as you can keep putting one foot in front of the other, you are doing your best work yet.", "maliengen": "❤️", "thesocialbeach": "💕💕💕💕", "evie_barrow": "💖🍩🤗", "stay_golden_joshua_tree": "Do it babe! Wine and entenmanns and live your fucking life and feel all the feels! We got this one life!", "bigcarol": "🙌😘", "totallylyssa": "💞", "katjawaack": "I know exactly how this feels. Thank you so much for sharing. We will survive 😉❤️", "hollymariataylor": "Love you Jen 💛🌞", "alocalartisan": "So true. Sometimes surrender just feels better. I’ve been there. Thanks for sharing. Xx", "oanamuscalu": "Just be.", "erizabef": "This honesty makes you an even stronger role model. 💫💓🌈🙌🏻 Love you, sweet goddess. Feel your feelings. 💪🏻🌸💯💥", "sarahfogz": "Powdered cinnamon ftw", "anabelzenithelizabethannbanana": "It’s like in the movie Inside Out though—sometimes we can’t only force Joy be the driver. Sometimes it needs to be Sadness; just to acknowledge that’s where we are and that’s what we feel (or Disgust, or Fear, or Anger!). Our feelings aren’t failures, right (asking for a friend 😉)?", "lisaoneilldillon": "My heart goes out to you! Sending healing, comforting, happy vibes your way 🥰💓", "bobbileebrooks": "Where do they have Entenmanns donuts??", "amelia.edmondson": "❤️", "__dena_": "❤️❤️❤️", "cristinafoos": "🙏💛🙏", "sdavis.crossfit": "✌🏻", "prisci_r_s": "💞", "wrestlewhat": "You’re lucky. ❤️", "and.and.ampersand": "Girl, we're all under water, that's how we're born. Thanks for showing up for us. 😗👏🏻", "johnnabuchanan": "@sadierizzley", "simplesimpleme": "Get the donut & take your time. Your sadness has not been invisible so don't try to please us, please yourself and know that we're here waiting, wishing you the best & looking forward to whatever you are ready to offer.", "stcysmth": "@jengotch thank you for your honesty", "mp_owens": "💕 So much truth. Always appreciate your raw leadership example.", "shadowboxer77": "-I really felt what you wrote to my core. Always trying to problem solve and be proactive with mental health can be very draining. Sometimes, it's okay to take a break from being proactive and just let things be as they are, knowing that you will be okay. We are here for you, and you are loved and appreciated for not only sharing your raw vulnerability, but for also lifting us up when we need it ❤️", "carlisle321": "perfectly said <3", "rhiannonlprince": "This is a really really helpful way to describe sadness. I have trouble putting into words why maybe it’s just sadness, and that it’s different than depression. You described it. Just always there around the edges.", "cfavae": "Walking around with a bottle of wine and bag of donuts sounds like a great plan to me.... thank YOU for your raw, uninhibited honesty, you deserve all the vineyards and donut plants in the world for helping others by keeping it real 💖💖💖 you are appreciated and admired more than you will ever know @jengotch", "salami_mami69420": "Me too Jen.", "emilyaralph": "love to you❤", "ohsarabeth": "Love you Jen! 🌈🌈🌈", "janaboyko": "Sending so much love your way ❤️", "nicoletigerlily": "💖💖", "sienna78": "💓💓💓", "papersnacks": "Sure hope those doughnuts helped make you feel better! (We had a snowstorm here on Saturday and I stayed inside and sulked and was grumpy. And I felt better cause I just let myself be sad and not fight it. ) I hope tomorrow will feel better for you!", "kimgarvinferrier": "Love u Jen", "klmoncure": "You do you sista ❣️❣️❣️", "luckygirlkelly": "❤️❤️❤️❤️", "mibarreta": "Sending ❤️❤️❤️❤️❤️", "treshsiehs": "♥️♥️♥️", "lovelaurakathryn": "💛💛💛💛", "lesliebarbazette": "I feel ya. ❤️", "molly_pasque12": "Wow. This resonated with me more than I thought it would.", "lauren_macd": "Hugs 💕", "erinmayo": "❤️", "simoneludlow": "💘💘💘💘🍷🍷", "blishabreche": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "emilyandmeritt\nVerified": "Verified", "si.balibags": "Yes girl, you WILL be fine but also allow yourself to hurt and sulk into your sadness. Being miserable and crying in vons parking lots while eating donuts is sometimes a cry of necessity. This hurt will mold and shape you into a stronger you. more of a warrior than you already are today. allow the callus to take full form, you won’t be helpless for long! 💕", "jack.e.line.lugo": "Learning to sit in the sadness is part of the process. Trying not to “fix” it and let it run it’s course is often the answer. So you drink that wine and eat those donuts and watch that shit you know will make you cry because giving in momentarily doesn’t mean defeat and sometimes, it’s needed 😊", "jessicadaviesmetalworks": "❤️❤️❤️", "mega4eva": "Doughnut give up! 🍩🌈", "alisonraemusic": "I love this. ♥️", "kimmieslc": "💫❤️😘", "pipestar": "Must be something in the air because I’m feeling this so much right now. Thank you so much for sharing. You couldn’t have said it better. Sending you ❤️ and happy donut eating vibes. ❤️", "mrskristian": "Drink that wine, eat those donuts, and feel those feelings. You’ve got so many people behind you sending you so much love", "campbellcriss": "Love, love, love.", "sabrinaseverns": "“All days aren’t triumphant” yes to that !!! 💜", "darcelmolina_128": "God;can I yell with u!😳😳", "darlybird": "Sometimes it’s the hardest to let ourselves be sad when we know that there are “fixes” like mindfulness, exercise, meditation, breathing....in one of my very saddest moments post-divorce, post-breakup, I felt instructed internally to lean into the sadness. Not try and fix it through my “enlightened” methods. Let it wash over me and over me and over me and through me again and again. I remember telling my mom that I was going through a “spiritual death” one weekend and she begged me to come to her house to be safe. 😂 I knew there was nothing to fear inside the sadness and that feeling it was the first step out. And it was. And I survived. And I find that 5 years out from that shitty divorce (that almost did me completely in) that those waves still come. There sometimes are no answers. Wine and donuts are a good start. 😘", "pearlsandicicles": "😍 @thefoundhers 😍", "_corr": "💛💛💛", "elleebeans": "Sending you lots of good vibes💕✨", "hannahpapernick": "Love you so much", "southwesternbelle": "Love you Jen Gotch, this too shall pass. ♥️", "courtneyshanefaith": "Right there with many of you it seems. I often post my dark days right along with my good days...I’m so over the fake inauthentic pages that pretend everything is perfect. Well, it’s not a lot of the time. If any of you need a support sister who gets it, pick me! 🙋🏼‍♀️💜", "atelierstylist": "We LOVE YOU @jengotch please, please, very please just remember that... also check @melrobbinslive she start a movement yesterday that can help us! We are a team Jen don’t forget that 💪", "blair_rose": "The authenticity you so generously offer around your emotions - bright or heavy, has helped me tremendously as I tackle my own, daily. Cheering you on and in your corner, as we ride the waves of this wild, tender, excruciating human experience. 💙", "gabriellegoldenhour": "💛💛💛💛", "lotustara": "This too shall pass. You are not alone!💖", "chelseagailmorning": "❤️❤️❤️", "jtengel": "💛💛💛", "carlsbeee": "So much love girl 🧡", "missjessepics": "Amazing the inspiration you give us all even in your darkest donut and wine moments. Thank you for being so super truthy, Jen. ❤️", "wit.interiors": "Sometimes its important to admit when you are sad and honor it. It’s just as valid of an emotion as any and if you didn’t feel it you wouldn’t be able to experience happiness either.", "sundaythe18th": "🌷", "flowersandleatherevents": "💛💛💛 your power color will be right there waiting for you.", "cloudhound": "I really relate with you on this. I feel sad more often than I care to admit (and I generally don’t admit). Thanks for sharing your life with the world 💗", "sheilajavor": "❤️", "gate2wire": "When I have those days, I scream, fuck you depression and Bypolar into my pillow in my walk in closet! How was the donut lol", "ultravioletchild": "💜 I’m grateful to witness you triumphs and challenges - thank you for sharing you.", "paperplanesandmudpies": "💛💛💛", "songbird1111": "\"You WILL be fine\"", "modernsequins": "thank you for sharing. so much love to you. ✨", "erinmgraham": "🙏❤️", "carrie_ford": "So much love and so many lightning bolts ⚡️❤️⚡️❤️", "aprettycoolgirl": "❤️❤️❤️I feel you. Get your donuts, lady.", "jayebunn": "❤️❤️❤️", "robinarias6": "🦄🍷👊😚", "jennydemers7": "Sometimes what feels right is sooooo right!! I get it... we try so hard but the sadness still comes... thanks for being here. And for sharing it all. 💖", "megangodardcardon": "Today was a donut day for me too. ❤ And while one usually does the trick, today needed two. I love that you share the good and the bad and love watching your journey. ❤️", "lizhutnick": "The only way out is through it ... with potato chips. 💕✨🌈", "thatendswell": "That's not sadness! That's grief!", "jesstinybird": "So thankful for you. Always. 🍩🍩🍩", "therealshivs": "Love you. Feel us all holding you!!! ❤️", "oliveandelliot": "😘❤️❤️❤️🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗", "chocolateandsteel": "I hear you. I got it going on too right now. Lingering sadness is exhausting. Apparently it doesn’t last forever. Just like those feelings of happiness don’t last forever, yet we rarely question why it’s still around.", "kaylamariekirby": "❤️❤️❤️", "njtxgal": "Scream & get the Entenmann’s choc chip 🍪...if I read another self help/embrace yourself book I might 😱! Sometimes embracing sadness is all that you can do (& scream, dance, sing sad songs & eat 🍪)! Thanks for sharing your honest journey-helps more people than u realize", "jana_fabulous": "Get the donuts, drink the wine And I hope you feel better. 🙏", "lindsayyhopkins": "I love 💙💕", "inyourbones": "I understand and you should get the donuts, I love doughnuts. No matter how you spell them.", "nlongo22": "Beautifully said. My mom and dad both passed away last year, 8 months apart. Unexpectedly. I can’t get past the sadness, my heart constantly hurts. Thank you for your honest posts...I know we all love you for them 💗", "nobodygrl": "I feel this 💯", "rewildingourwholelife": "Sometimes that’s the best medicine. Allowing the messiness, and being witnessed thru it. #shadowwork", "deer_belinda_": "Well said 🙌🏼♥️", "debed17": "❤️", "mrs.grossmans": "❤️❤️❤️", "elleeachten": "Thank you for this 💕", "daisychaussee": "i’ve been feeling the exact same way recently. thank you for sharing @jengotch 💘", "kammiekdotcom": "Girlll you are 🔥 & a cosmic creator...let yo’self feel that ish. Sometimes I think the pain gets amplified when we resist it. Pasting a smile on it (guilty of this too🙋🏼‍♀️) and all the high vibe/mindful stuff can be a spiritual band-aid...dive into it. Feel it. Eat a few donuts. The beauty of this life is it’s a full spectrum sport. Feel ALL the feels. We’re all right here cheering you on. Thank you for honestly sharing this & modeling human BEing-ness. Peace & so much love 💗✨🙃🙌⚡️🔥", "thelightningco": "🖤🖤", "aims888": "@jengotch I appreciate your raw honesty!! 💓", "crtnyyyyy": "i relate to this too much", "paigecmoriarty": "You got to feel it to heal it! 💗", "meryusk": "❤️", "julia.crawford.young": "💕💕💕", "jmeackerman": "💕💕💕💕💕💕", "hannahelizabethbegley": "Ride that wave. It’s all going to work out. 💗💗", "mavisvancamp": "Trust that you know best what you need to do for you. We’re here in full support and without judgement, lifting you up and standing with you, through it all.", "kristin_chisesi": "💛💛💛 thank you for being so open and raw.", "dooyen": "💕💕🍩💕💕", "lucille_irl": "Grateful for this, as always", "txlexi": "Long hauler Lexi from Houston here cheering you on🙌🏼💓", "sherise.lee": "✨💗✨sending donut hugs your way. Maybe a root beer float too! Which I am having rn! 🍺🍩", "chesalane": "❤️❤️❤️❤️❤️❤️❤️❤️", "kgrace1123": "If this world doesn't make you sad I don't know what will 💔 hope you get some happy soon", "iamcholia": "I'm in this same space off and on or maybe its lingering and never goes away, just the intensity. Dials up and down! Hang in their Lovely (that seems obvious to say but maybe it will help)! ❤️❤️❤️", "debra_at_digs": "Big hug to you my dear. You are an amazing human being. 💜", "kourtneykeaton": "❤️❤️❤️", "__seaofleaves": "love ya Jen. i relate so hard & am sending you love. thank you for all you do & say 🧡", "heymelwest": "You make me excited to be alive in this time! Thank you for all that you do ❤️", "egreiner11": "A McDonald’s sundae is my donut. Thanks for sharing ❤️", "angelahardison": "Sending 💛 your way. Some of my favorite Daniel Tiger/Mr Rogers lyrics: “t's okay to feel sad sometimes... Little by little you'll feel better again”", "snickle": "I feel ya girl, this is so on point to my feelings sometimes 💯🙌🏻 thanks for being so damn real. ❤️", "tarajhaaz": "❤️❤️❤️", "lmarchionni8": "THANK YOU 💛 for sharing. I’ve been going through tough times and honestly was looking to you for inspiration, but it feels nice to also know that I can huddle inside this wave of sadness for a bit until it feels safe to come out. So many people want to give the “positive” and “optimistic” advice when you share that you’re sad, and I think I needs to be shared more frequently that living in what you’re feeling is healthy & will lead to healing. I’m sure it’s not easy to share these parts of yourself, but you are helping MANY. ✨", "awhimsywonderland": "Forever rooting for you. Your realness on this helps so so many people.", "triciaheatondesigns": "😘😘😘😘😘😘😘", "aly_nagel": "💗💗💗", "coffeeandbeauty": "❤️", "wstreetdesign": "❤️", "mermaidmeg19": "Wine & donuts sound just perfect. Here for you!! 💕✨😘", "hannahroyce": "Feeling this exact fucking thing SO HARD. Thanks @jengotch 💯", "ronnieruth": "💛💛💛💛💛", "byashleyoneill": "@dyketowatchoutfor", "constancezimmer\nVerified": "Verified", "kenzierowland": "❤️❤️❤️", "rebecca_dooley13": "Me too ❤️", "chris_hutcheson": "💕💕", "crookbristi": "Right there with you ❤️", "lauralucch": "❤️❤️❤️❤️", "kyliehodges": "Get those donuts and you’ll get through it.❤️", "sallyswensonart": "🍩 GREAT idea! ❤️❤️❤️", "themani_camper": "❤️❤️❤️", "goldenchildnyc": "❤️", "samrturnage": "💛💛💛", "cidlowskicks": "The Entenmanns donuts are one of my depression foods of choice too, something about that waxy blandness.", "kaitlinmarcotte": "Allowing yourself to feel is a brave act. You inspire me so much! Sending you love. ❤️💌", "cellerwilliams": "Love to you❤️", "gold.bloomers": "All the love Jen ❤️❤️❤️❤️", "mirbrown75": "Crying it out - or donut’ing it out - can be just as productive and powerful as talking it out or laughing it out or dancing it out! Just get it out! Release to move through it, and past it. 💕", "_shelbyling_": "A: jealous for Mandy Moore commenting on this B: you rule", "thejoyfuljewelrybox": "Sometimes all you can do is just let it suck without trying to change it. Easier said than done, I know. Sending you so much love. 🙏🏼💛🙏🏼", "rachmasterflex": "❤️❤️❤️👏🏻👏🏻👏🏻 yes, feel that sadness! you are incredible and so strong", "je_n": "❤️", "jillyjpg": "We're here when you're ready to come back from these moments of darkness 💙 You may not always want it, but the affirmations for a healthy headspace are real :)", "saramoon": "💌💌❤️", "brittanysecord": "I really needed this Jen, thanks for sharing 🧡", "cwsfav": "You will joy again. You will. ❤️", "sara.karen.137": "💜💜💜", "irishdancer66": "Thanks Jen for this! ♥️", "livingandloss": "This is so powerful. Thank you for being so vulnerable and authentic. It’s okay to not be okay. Sending comfort across the airwaves. ❤️", "bitchybutbubbly": "@jenniferblanchard4 I feel this so hard. 💗", "gracesmith72": "you’re being reborn. keep going!💙", "jackiewolfer": "❤️❤️❤️", "elementaljewellerynz": "Much love to you sweetheart. Sometimes the only way to come out the other side of sadness is to let it crash over you like a wave, emerging a little battered but refreshed and reborn. I can totally relate to how you are feeling and am going to follow your lead and lean in to the sadness. Have a donut for me ❤️", "maurakp": "❤️", "l_mn_o": "❤️❤️❤️", "jasyyyy": "Fucking same. You are the hero we need Jen Gotch 🙏🏽", "jillbeltrano": "💜", "k_h_v": "Love you, Jen! 🙌🏼", "thekdv": "💖💖💖", "tangtues": "Eat up! 💓 🍩🍷", "katiemaewilk": "♥️♥️♥️", "mythreesons": "💛", "danielleclairxo": "Thanks for always being so raw. You’re such an amazing example of what it looks like to be a strong business woman. And I’m so fucking glad you share the good and the bad because this shit ain’t easy. Hope you feel better soon Jen! And now I want donuts 🤤🤦🏼‍♀️.", "tracytreu": "Entenmann’s are really delicious", "kaykaymoffatt": "🖤🖤🖤🖤", "wonderstef1223": "Be gentle with yourself. Eat the donuts. Drink the wine. Cry. Then get back up and do what you can. Sending love and light ❤️😘", "elissa_edits": "❤️❤️❤️❤️", "michshanks": "❤️❤️❤️", "heather_raemi": "♥️♥️♥️", "ore_handmade": "🖤", "cocodanger": "Even those of us who aren’t in your inner circle LOVE YOU! You bring us so much joy. Thank you for laying it all out on the table. Sending you so much love and comfort in this fuck shouting moments 💛💛💛", "rubi_jones": "❤️", "jennrak": "Sending you love and light ❤️✨", "thesusanp": "You’re a beautiful human 💕", "honeylakestudio": "🧡💛🧡💛", "johnny.minnesota": "I BELIEVE IN YOU.", "therealtymaven": "🖤", "helenboggess": "You are incredible. Thank you for being you. Holding you in my heart xx 💓", "kirstieisvegan": "We love you so much!", "duchessofstarship": "Lawd I needed to hear this today. 💜", "br00ke76": "Sometimes ya just need a damn break. Wine and donuts it is! Thank you for being real always. 🍷🍩", "tbm247": "“Depression often comes out of nowhere and dissipates just as mysteriously.” THIS! 👏🏽PART! 👏🏽All I can say is that your storm passes soon! ❤️", "nicole_rucker\nVerified": "Verified", "konfessions_of_a_kathlete": "Depression sucks. Thanks for being so real and strong enough to share your stories 💪", "awinthrop": "Hugs to you.", "morganleee": "@neon.royalty", "jillianrenedecor": "💛", "raenainteriors": "♥️♥️🙌🏻", "homerfridafrank": "I get it @jengotch. We love you and you owe us nothing. 😘", "dr.christina_": "You are amazing ☝️", "snippetsofsammy": "👏🏼 that’s me cheering you on girl 💜 thank you for being you and for doing it out loud with us", "choelita": "We love you !!!", "nataliebubb": "I so appreciate you and your openness. It helps give others strength. Cheers.", "vanecreatives": "Sending love ❤️", "leighannmick": "God I feel this for you, it was me in 2016 x5... your perspective is the way I got through it, keep it up Jen!", "amourcolette": "Cover girl! 📸", "stardustmillenium": "❤️ thank you for sharing. Sometimes I need a reminder that I'm not the only one that feels down. It's so hard sometimes to pull ourselves up from drowning. But we have to remember that we've been down before and we pulled through. Take care of yourself❤️", "christinasymons": "Run. xo", "jwhs444": "You are greatness!", "elinorwhite": "I’m so sorry you’re in this place, but I love and applaud you for sharing it. Sometimes being kind to yourself looks like donuts and tears and sweatpants.❤️", "liadee": "Love you Jen. Holding your hand and cheering you on. Always. 💕", "fosterpartyof5": "❤️", "magswofford": "Thanks for putting into words how I’ve been feeling lately! You give me hope n gratitude (weirdly enough) that I’m not the only one. Funny how even acknowledging pain can be inspirational and healthy for so many more people than just yourself ❤️", "alyssafelix24": "🙌🏻", "tennesseeme": "yes yes yes i'm with you a hundred percent", "danajdoo": "Sending love. ❤️", "vic6139": "Your vulnerability is brave and something I aspire to achieve. Sending you love and good vibes 🥰", "jenkelleylv": "Me too 😢💛", "theothercarrie": "❤️", "amopfer": "I feel this 🙌", "justlindsaydawn": "And HELL YES to donuts", "kellyandtheyayas": "@jengotch hugs 💖", "sarahbeth.ramsey": "Oh and I also constantly say I’m just so tired when this happens . So many times. It is exhausting.", "madisonlandau": "Thank you for being so open and honest on this page, it makes the world feel less intimidating and real 💓", "mandymooremm\nVerified": "Verified", "claudiadmunoz": "Xoxoxo", "i_am_jacks_random_thoughts": "I feel this so hard. 👏👏💗💗💗", "meganmpearson": "💛💛💛", "shannonrosegreene": "We love you, Jen!!!", "chloemeyerart": "💕💕💕💕💕", "resilientmama": "Love u 🙌🏻✨👏🏻", "wafahafiz": "So relatable. Rooting for you, always! ❤️ Enjoy the donuts."}