{"jillianmorkan": "This is so amazing as are you!", "nickynolaws": "👏💜", "kidkoala707": "@jengotch I was not allowed to like this picture by Instagram. Anyone else not allowed either..?", "jem_touchdown": "I cried in my car this morning , it had been a while and I’m dealing with an inundation of trolls and harassment. Next time I’m going to follow your lead and post in my full sob glory. Thank you for sharing @jengotch", "noteworthypaperco": "I love this ❤️.", "bo.ofori": "@devsutties", "madisoclark": "@yabishkelsey valid for today. Love ya!!!!", "pornforwomen\nVerified": "Verified", "cuquicu": "I cryed in the bathroom of work once, feeling so sad hoping noone was hearing me", "coachedbytiffany": "💗 I’ve cried at many of the places I’ve worked! Thanks for sharing 💗💗", "anniexm": "@genisareyes read this. It’s amazing.", "hersandminevintage": "I love you Jen Gotch even after all these years ❤️💪🏼", "h.eyimi": "🔥", "la_birdoj": "Such a great photo though 🤩", "charlieroquette": "♥️", "dandy_boho2216": "@grisalves", "soph_fonteyne": "@_lilyboo_ 😘", "strangepartyofthree": "@holakolbe follow her. 👏", "trendland": "I'm just wondering what goes through your mind when after you just cried, you're thinking \"Hey, i'm gonna take a selfie to see how I look\" Cancelling of course your entire 'crying meaning' :(", "nicole_andexler": "@mmcgotty queen!", "autumnjf": "@eluber", "momusamush": "HELLO...ARE YOU LOOKING FOR A GENUINE LOVE SPELL CASTER OR RELATIONSHIP RESTORER IF YES CONTACT DR.OKEYTO FOR HELP  Thank You Dr Okeyto The Great Love Spell Caster For Your Help in Bringing Back My Ex  I don't really know much about spell cast, but the only person I was introduced to was actually the solutions to my problems. My wife caught Me with another woman in bed and he eventually broke up with me, it's been 3years of our departure. But by the help of Dr Okeyto, I was able to have my wife back again, now we are happily together again.Never in my life have I thought this would work so fast. My wife reconcile with me and he started acting completely different, we make love everyday. Now I can say that Dr.Okeyto spells work and it work fast ! I can now say I feel happy once again, and like never before. It felt so good to have my lover back again, Thanks to Dr.Okeyto I just want to use this opportunity to thank my friend who introduced me (Tracy Morgan) to Dr.Okeyto. Thank you Dr.Okeyto. You can reach Dr.Okeyto via: {dr.okeytospelltemple@gmail.com}..or call +2349050141440/WHATSAPP for help of any kind of relationship problems...", "mullrr": "@mayarafacchini lembrei de vc (ela que criou a empresa do meu planner do ano passado)", "elf.winter6839": "@sallllyyyyy ❤️", "hayley_godrich_art": "I think it's a great idea 😃 We all have emotions, it's not always healthy to keep them in, crying doesn't mean people are weak, it means we are human and we feel, we have feelings and can't always help how we feel. It's taking me a long time to realise, how I feel is how I feel, and to stop berating myself about it.", "speaktostrangers.agency": "Very profesh 💅", "4queensonlyproducts": "Love your page 💕 Let us know if you like anything on our page 😊", "juliefordherbison": "I get it that sometimes something really awful happens and we cry at work. However the idea of it being ok , normal, justified is really troublesome and feels very white privileged. Many of people especially women from marginalized populations work in white centered workplaces. Crying at work would is detrimental to a delicate balance we navigate everyday. Please do not encourage white tears that just perpetuate racial biases. White women tears (she’s being authentic, vulnerable, needs some self care or a mental health break) POC tears ( not professional, doesn’t have their shit together, isn’t a good fit for the company, isn’t grateful for the job, is so easily offended and makes everything about race.) if you want to make the company you own a safe crying space great but that is a luxury afforded to you that most do not have. Please don’t encourage behavior that puts someone’s job in jeopardy and that really is only an option for white women. @jengotch I love you and support 95% of what you say on any given subject but this is cry at work and on social media shows me a lake of understanding your privilege. There are better ways to leverage your voice that doesn’t harm BIPOC. 🙏🏽 Please think about it.", "cabinlove_": "Woow 😻😻🍃", "heyadeyling": "THIS.RIGHT.HERE...& to think I’ve apologized for crying at work...! 🙄", "goldencajan": "This post is so necessary + spot on! I completely agree with everything. Thank you for posting this. Great way to get the conversation started to normalize something that is normal!🖤", "gemtakesfoodpics": "It’s important to have this photo and caption 👏 means a lot", "yourbiggestfangrace": "I used to be a teacher and I still have vivid memories of some of the days when I couldn’t help but break down and cry. Thanks for building spaces (online and at ban.do) where this is okay, normal, human! ❤️", "inspiringtogreatness": "I’m a very small entrepreneur and is YOU that give me the motivation to persuade my dream! The hustle is constant and it needs a incredible mindset to get on your level! 🔥I will keep on my hard work for one day can achieve much bigger goals 💪", "kellyopix": "Ah. Thanks for this !", "albacon80": "I would cry and think something was wrong with me. Thank you❤️", "thelightningco": "This. Thanks @jengotch 🖤", "morganedominique": "FEEL YA FEELINS- that’s what they are there for :) Thanks for normalizing work cries. I have been driven to tears at work out of care, anxiety, frustration, burn out, excitement, gratitude, fear and utter disbelief at some happenings. Every tkme I’ve been so embarrassed and felt so weak but try to also remind myself that ITS OK. Once a male exec told me not to be embarrassed and “crying means you care.” That one stuck w me.", "bornandbreadfl": "@mallary.jade, we are never alone. 😘", "mollycade": "@yvettemirandaj", "_jeanoid_": "@sweetmcgurran", "202ransom": "So important! 🙌🏻", "oldoldmonkey": "❤️❤️", "ohsorrow": "@ondie_truffle_butter_", "thayerandco": "I second that @sillapere", "jasminirisclifford": "@rclifford90", "amelia_laurainteriordesign": "I've always been told to suppress my emotions, to be professional don't show how you feel. Fuck that in today's society. Get real, people go through horrible things, they work with bullies, they have cancer or know someone affected by it, whatever it is that people are affected by, it should be OK to be real and have a little moment. This is one of reasons I started my own company because I don't want to work for plastic people. I truly believe in this day in age that connecting with people, empathising and facing facts is so positive. We shouldn't have to hide in the loo if we want a cry at work... Love your mission here. Strong woman 🙌.", "jimenchis": "@gabii_natii", "rebekkaleighw": "@lorinspoore330 honestly I love this!", "danielleloveburks": "@ashsulser @juliastarrett", "cityofelsegundo": "👍", "allisontheace": "You inspire me to be me. Thank you!", "cmaisonblanche": "I’ve cried at every job I’ve ever had. Can’t love this enough ❤️", "sillapere": "PS you kinda look like Bjork with this look which is cool AF", "mmaaggeenn": "🙌🙌🧡✨", "thejaydeuniverse": "You’re kinda magical", "stwatchman": "@brendaaffleck @hbel24 This is what I was talking about! 🙌💜", "jolawithaj": "Thank you! 🙏🏾 Thank you for reminding me I am not alone.", "rickibraswell": "I now own my own company but as a former CEO who ran other companies I never judged someone who cried at work. For some it’s just how they express or release emotions. I didn’t ignore crying, but I didn’t assume that I knew where it was coming from either. I hope I created a safe space for the expression and an even safer space to grow.", "raquelmideau": "Thank you for this. 💕🙌🏽 I have always apologized when overcome with emotion in a professional setting but that’s just the way I’m wired - especially when I’m passionate about something. Here’s to no longer apologizing and experiencing my emotions whenever necessary.", "ani_ktml": "I'm someone who cries at the office too! Slowly starting to accept it, as I also cry out on the street or in the cinema if needed. And that's the key word: needed = I need it! 😊", "swimandtonicmel": "It’s happened a few times, once through sheer frustration at inequality and twice last year in front of our whole team. It felt real and needed and besides that there was no stopping it. When they roll, they roll. I’m also getting better (this needs much improvement still) at not always saying ‘I’m good.’ Fact is I’m not. One thing I do know is that the tears never fall when I’m around water x", "christina_cr56": "@mimosahandcrafted Yeah, my darling, I'm a yoga instructor. In Hamburg and on page I said everything in crying. I said people like crying and laugh is good. Yoga exacerbates crying and shakes the body.😭😭😭😭💪", "amymariemerrell": "YES JEN!!! Love you so much", "catecusack": "🦋You need your emotions to help you arrive at decisions. They’re like fragile thresholds we must pass through to get to our inner compasses. If you’re avoiding them, you end up lost. That’s the painful gift. I learned that one the hard way! 💜", "drdanielleperrodin": "I’ve cried at work three times and it felt so shameful. But I now know the shame was coming from my own thoughts", "alliecatharris": "🖤", "palermobody": "🙏🙏🙏🙏🙏", "laurenleecasale": "i c r y at work and i dont care 🙌🏻🙌🏻🙌🏻❤️❤️🖤🖤🖤💗🌈🌈🌈💚💚💚", "smerchahoven": "@jengotch Thank you so much for sharing this. As women, we should be able to express what we feel, even in the workplace. As women, we were taught to never cry at work. Thank you for changing that. We are still professionals even thought we show emotion", "imaginarygrace8": "i ❤️ u @jengotch !", "goforsummer": "We have all been there ! Let’s love and support each other !", "allielapidus": "Crying is so important!! This is so great 💗👍🏻", "fritoprojects": "💪🏻💪🏻💪🏻", "tessa.ohalloran": "Thank you for your openness Jen. 💛", "kimiecakez": "💖💖💖💖💖💖", "paperscissorsglue": "I love you Jen Gotch, and thank you for being you and expressing what’s meaningful and real to YOU!", "lineaelisabethfern": "Such an important thing to shed light on. Thank you 😍💪😍", "lil_lion7": "This made my day so much better. 💜⚡️", "narmojean": "@slambiegrams", "sharni_layton\nVerified": "Verified", "the_petrichor": "@jenbgrainger 😘 our day!", "gin_hunter": "Absolutely love what you do! Because of you I find it easier to accept myself and for that I’m a better person ❤️🔥🙌", "kittkittie": "It's my goal to normalize this in my office. I get pretty emotional at work, I well up with tears and cry in the toilets. Next time I'll do it in front of my team ❤️", "heatherandersonhair": "I’m not a crier but more power to those that are!😢💪keep doing what you do @jengotch you are a beacon of positivity for lots of people! 🤙", "jalissakate": "@ky_li_eeee @just_toni 🙋🏼😂", "jeanineelyse": "@jengotch thank you for establishing this very important holiday. Question...can I only cry on this day? Cause I think there should be an #icryatworkday every month.", "sweetherr": "I wish in my reply I could post my last cry. It was about 20 minutes ago. Phew. Feeling better now. Sometimes tears just need to do their thing.", "lira_benebabebrowboss": "I’ve cried at all my jobs and I hate that I have. It really bothers me.", "anne.pdx": "Yes. All of this. 🙌❤️", "renntraylor": "You are the best! 👊💕😍👊😘😂🤘🤩✨ Keep Bandoing what you’re doing!", "halle_hathaway": "I love you. So fucking much I can’t even explain. Thank you for being here and being you and being vulnerable and allowing you and me to be seen for who we are because it’s OK to be real 💖❤️ ILY XOXOXOX", "chrismoon1969": "You are a fantastic human being Jen Gotch. 🙌🏻💫💖", "whitelotusalchemist": "How many times in corporate Australia I was told I was too sensitive (I didn’t cry but tear). For God’s sake, I’m an empath! I wanted to shout out! Long story short, I left the corporate world...😁👏🏼🙏🏼😇❤️🕊", "thewellreadwanderer": "Love this!", "heyitsolivesmom": "I flipped out on all of my bosses during a meeting. Flipped out. And now it’s a big joke to everyone. “Ha ha! Remember when you freaked the fuck out?!” So, I’m here for this.", "tracylargen368": "This is what courage is. Bravo.💕", "aliciadempz": "I’ve seen red when I #cryatwork and it’s 👏🏼", "jenesigl": "Everything about this 💯✨", "sabrinavedres": "I can’t even begin to think how many times I have cried at work in the last 7 months... usually stress, nervousness, or not feeling good enough are my biggest culprits. Thanks @jengotch I love your feed and words of encouragement 💕", "lactulli": "Perf match with @thecrybabyclub_ ❤️❤️", "angelahurtmusic": "❤️👏🏼💕😭", "anaelisei": "Nahhhh la amo, es crack ! @bulagomillan", "tinahamblycreative": "My tech company had a cry room during our gigantic conferences. It was awesome !", "caraemilyyy": "Love this! Cried at work my very first day at my very first job. 👍🏼", "christyaoneal": "@mimosahandcrafted well today at my work, BRAC, we were all doing an ooh and aah over your new pelican earrings. Those babies are sweet!", "idratherbeadiscoball": "I love what you are doing for your company, your community, and all of us!✨💕 Thank you, @jengotch", "kaitrasmussen": "@elliesota Me @ Mary & Bob yesterday.", "joyehoover": "Yes yes yes. Thank you so much!", "aprilc.ashton": "Omg I’m not a nut job after all!! 💃", "rmstraders": "Awesome :)", "trebhan": "@parakerry timely post!!!!! jen reads my diary", "ms_megan_anne": "Did that today. Shoulda taken a picture", "hannahrog85": "I had a major anxiety attack in my boss’ office at work today and afterwards I realized people avoided me the rest of the day (they could hear me hyperventilating in her office). Speaking out about our mental health struggles is so important because there is still such a stigma around it. THANK YOU @jengotch for being a hero to me and so many other people. You’ve encouraged me to be completely open and honest about mental health and live a life knowing it’s okay to not always be okay. ❤️❤️❤️", "emilyfate": "@emilyisthenewblack", "speerjoyce1": "Oh. Sometimes people need a cry. Adulting sucks sometimes and people have bad days. You’re a tough bird", "juliechats": "I LOVE YOU! Crying is a thing I do. That’s it. It doesn’t make me any less capable or intelligent.", "lizbiz12": "I had two good sobbing sessions at work this week 🙌🏻", "chelslevy": "Thank you for this!", "jillotron": "@jengotch i would do ridiculous things to work for you. 🙌🏻💕", "alexhopespencer": "@audrey_kennon you create such a safe workplace! Grateful to have shed tears with you at work 💛💛💛", "lisa.kelsey.54": "I feel like I know you just because you’re such a relatable human. Thanks for that, it helps knowing others cry about life too ❤️", "thedailydressed": "So happy you shared this🙌 needed to see this this week, thank you!!", "mickystritt": "Love this! Thank you!! I have been known to cry at school and work, especially when I’m frustrated or overwhelmed. I hope that the stigma and perceived weakness around this can change - a little bit at a time. ❤️", "sugaroyal": "This picture started my journey with you! So inspiring to us all! Thank you.", "casawills": "@backroadbrowngirl 🥰", "daisys_mercantile": "In my 50 years of living I don’t know if I have ever had a day I haven’t shed a tear. My most memorable moments in life involve crying. My best, my worst, the laugh so hard you cry moments and those where you don’t know if you can ever get up and walk on your own two feet because you’re so broken. These emotions don’t come with a time clock. Ever since I started my own company I have had a fry break policy (it involves quiet space, a shoulder if needed and a cup of tea) I love my emotions and the extreme of them sometimes, because to love that hard, you have to cry hard too. I want to be surrounded by these people because life is too precious to be emotionless. All my customers know that if they need to come in and cry it out, my shop is there for them.", "jessshumack": "Thank you for sharing 🤗", "xoxo_sadie_grace": "I LOVE THIS! ❤️😍", "jessielehrbaum": "I feel like I’ve found my people in this comment section. 🖤🖤🖤", "julietagarros": "I've honored the #InternationalICryatworkday on Monday 😂", "dear_jillie": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽 YAAAAASSSSS ALL FOR THIS.", "mimosahandcrafted": "I cried at work today 🙋‍♀️ #totesnormal", "reversed_ruin": "I’ve cried at work every day for the past week! Thank u!", "taymahay09": "🙋🏼‍♀️ I cried today at work. Happy #InternationalICryAtWorkDay Cry Babes! 😘", "rachelacevedo20": "🙏🏼👏👏👏👏", "cloops": "Well shoot! I cried at work today and didn’t even know it was #internationalicryatworkday Kismet, really.", "brooklynlammz": "@by_vanessatran... read.", "noelsmall": "Just when I thought I couldn’t love you anymore @jengotch ps: I cried at work yesterday!!!", "chabanga": "🙌 🙌 🙌 it isn't hard to be a (decent) human being", "outlawintuition": "No shame! Thanks for posting. Thanks for normalizing xox", "acbranca": "Unless you are an alien, crying is all part of being human👏🏻👏🏻🙂", "samichammas": "I love you, woman. 😭❤️", "alwayssunnyfibres": "Absolutely love this, thank you!! 💛", "karinarvaldez": "@karem_paolamv", "emotionalbabe": "BEEN THERE and I felt such shame about it when I did in front of a co-worker!!! Thank you for this ❤️❤️", "arwriteragain": "@erinblee_ @mikedoesla @ryandowdurch", "iedee19": "BRAVO!", "laurakferguson": "cried at work today. thank you!", "erosey8": "🙌🏻 - cried twice this week!", "jenkorz": "@jamieleavemebemonroe", "ckvardon": "😂", "sunshinestategoods": "Thank you for sharing and normalizing perfectly normal feelings ☀️", "kmf0214": "@accidentaltheme all for I Cry at Work Day.... celebrate it on the reg", "chalkedbymabz": "As someone who feels the feels, I’ve made a conscious effort to NEVER apologize when I cry. I don’t think we should have to say “sorry” just because we’re passionate or emotional or empathetic (or, if you’re like myself, a crazy mix of them all.)", "pamiiiii": "@monisaldana jiji 🙊", "margo216": "Omg I have cried too- of course in front of a man which is regretful as a senior leader!!", "lovelywreata": "Amazing. Sometimes crying is such a sense of relief. Letting out whatever the emotion is. I also believe that if we can ride the roller coaster of emotions and not suppress them we are all much better off.", "ponypoconut": "Brave! Very brave. And so important to post messages like that. Hopefully helps more people to overcome the fear of crying because crying is ok.", "ofyqueso": "You’re an inspiration ❤️", "cecilia_serafini_berkowitz": "You are just and inspiration for me.:.everytime I “cry at work” I think about the statement u made..and makes me feel less alone.. I moved to Holland from Italy and@I’m suffering a lot...for work and the different culture.. And to knelt that there is somebody that is making the mental issue normal to face make me more confident.. Thanks", "msrobyncohen": "Good for you @jengotch!!! This is so important! 💕", "the_masters_styling": "This is amazing!!", "hopecavell": "YES", "missybeachbum": "I cry at work on the regular 😭😂🙋🏽‍♀️", "invocateur": "you’re making more of a difference than you realize. 🙏🏻✨💗", "stephaniechinnart": "Love!!!", "alexdavey": "XO", "michyfig": "I cried during work not too long ago :,) Very timely for today. Thank you @jengotch & @shopbando for valuing my feelings 💧✨", "hypnicpistols": "It’s awful isn’t it? We feel ashamed to express emotion in the work space, sometimes even over truly serious, ‘understandable to everyone’ shit. I never judge others for crying at work, not even a tiny bit, and am personally a real advocate for letting it out. However I hold myself to a COMPLETELY different fucked up standard which is unhealthy and unhelpful. I caught this mindset when I worked in an evil corporate environment. Trouble is it stuck (it also contributed to me getting cancer too). Thank you for showing and sharing your most painful moments x", "kelltart71": "🙌", "thehuntedfox": "Y. E. S. !!!!", "bunny_lover76": "🙏 You are amazing!", "karynlisaknott": "🙌🏻❤️😭", "stephmorrison_": "#fbf to when my office was the designated crying room when we needed it to be @mshilarygail", "reneealison0928": "Perfect", "bay_witchbitch": "🖤", "jahvaa": "L O V E you, all day, every day! 💖 For this, and for everything you do!", "onmogul\nVerified": "Verified", "melisabegins": "I just cried today at work, as a matter of fact. Thank you for being all of us. There is no shame in the feels game. Also, love me some ban.do ♥️", "cassidy_mr": "You are such a light ✨✨✨ I just love all of this!! Break the stigma", "ohboyzee": "I love it!! 💕", "lovvvvvcat": "❤️ I’ve cried at every job too. Always felt stupid afterwards, but also have a hard time talking about my feelings when asked and not just letting the flood gates open. 🤷‍♀️ Now I just realize that’s how I expressed, which doesn’t mean I wasn’t a valuable employee. Now I would just be up front about it, Sorrrrrrry gonna have to deal with a couple tear drops in one on ones. 💦", "caitimcelroy": "As a human who cries at work like once a month, I am into this message. ♥️", "sophie_mlb": "It’s an incredible policy to put forwards! One I hope people and myself can embrace in my own company. Tears are not weakness, they are care!", "ohmygod_becky": "@hannahvdoll ❤️", "francilla": "🥇", "peace_punk_productions": "🙌🏽 Yes! I love this. 💕", "denai_jones": "@korie_conant @caitkeller_ck @hannah.millen we know it! 🌊😭", "susan_l_sykes": "My brother and I were raised by a very stern, Southern mother. Growing up he would tell me “don’t let her see you cry, she will see it as a sign of weakness”. I’ve always resented that. I’m a very emotional person. I like to FEEL each emotion. I hate feeling embarrassed about experiencing sadness. Thank you for this!", "sswassel": "Sent this to my two #girlboss daughters, offspring of a #girlboss — AND to my #boyboss son. Boys can cry at work, too!", "catshycrafts": "I can cry at work anytime I feel the need. 😢 I work mostly at home on my handmade arts business. Crying is an amazing and necessary release. No shame here. I’m an INFP after all. 😘 #infp", "joannarevers": "I love this. Thank you!", "heycindylee": "💯 Yes. It’s so hard to be frustrated and get emotional AND feel shame on top of that. Thank you for making this a day and for bringing some normalcy to having feelings and expressing them.", "ceri_hoover": "🙌 Love!", "lexyinspired": "You’re an amazing woman, Jen Gotch. I hope to lead like you do ♥️", "kikiverde": "I hate crying in front of people I don't have an intimate relationship with because it's like my soul cracks open and they can see into the very core of my being. That being said I appreciate your vulnerability and it inspires me to consider being more vulnerable with people who are not in that inner circle of intimacy.", "srfchk17": "Thanxxx Jen 💕", "kittymeowmeow": "I love international cray at work day! It’s happened to me quite a few times! Thank you for that! 💜", "kzmccaff": "I’m a crier—happiness, fear, frustration, embarrassment, joy... So are my top two emojis 😂😭 I’m with you and have definitely cried (mostly in bathrooms or offices) at work. I have feelings and I don’t feel bad about them (anymore).", "missy_allison": "Thank you 💘", "karenzgoda": "♥️♥️♥️", "snickerpuss22": "@aliceoleary17 🙌", "nniden": "I've cried at work several times and never felt ashamed of it. Actually I think it made a little bit difference on people's mind whose I work with. Now they are much more comfortable about expressing their feelings and accepting other people's feelings during work process. It's ok to cry. It's ok to express your emotions. Love you Jen 🌷", "katiecaptions": "I’m diggin’ this day @aishafultz", "thelittlethingssssss": "Thank you", "real_skinn": "Definitely been there many times! I try to contain it to the bathroom because hello corporate environment, not set up for that! And it’s so embarrassing! But I would love for crying to be more accepted. Sometimes I just gotta cry it out!", "daydreamingmydarling": "#reallife 💕", "helicopter.dogmom": "I cried at work last week when confronting my boss about how little time she has spent to develop me in my new position. I was so overwhelmed and struggle with conflict and I was literally gasping for air and sobbing at one point. I know she thinks I’m too emotional now and I was a bit embarrassed, but also FUCK THAT. I cry because that’s how I express myself sometimes. And guess what!? She has been a better manager since then. 🤘🏻", "behazelquist": "❤️This", "_lpuma": "@jengotch for president 🤗💘", "choelita": "You have plenty followers down here in Argentina!!! We want more people like you Jen! We love youuuu 🇺🇸❤️🇦🇷", "wheelchairrr": "@krispylawless", "alexbodishhh": "@kelssugg", "sofia.henrika": "💛", "rebeccakordecki": "Love this beyond!! It is our human right to experience everything single emotion and it is my job to encourage and help people to do so so I’m so grateful for this post. All the tears I have cried and all the tears I get to hold space for over my career have molded me into the best version of myself without a doubt. So here’s to tears!!!💥😘🙏🏻💫💃🏻👍🏻", "bartel_shrugs": "I JUST posted about how I cried at work yesterday!", "abbydobson": "@jengotch thank you for simply being AWESOME! I so enjoy following you!", "positively.stephanie": "@shapuck", "mechina13": "👏👏👏👏 desde Argentina para vos!", "june_nineteen_": "OMG! So clever + so to the point!! I been shamed once crying for 2 minutes at work bc of the work load (24/7) and I was thinking, fuck this, if I can’t cry here then what’s the point!? It’s not weakness, it’s you being so strong you care that you can’t achieve everything you want to achieve while working for someone else (high expectations yay) 👊🏻🧡🥂😢", "cherylsphotography": "One company I used to work for was very corporate and crying at work wasn't ever discussed, you hid it much like any other aspect of your personal life, this has been the experience of those in my family and friends, the mainstream world doesn't seem ready for this but I am grateful your company is and that you continuously share your human side.", "kellyisshortforkelly": "I've never cried at work until my last place of employment. The negative office toxicity and verbal abuse was horrendous. I'm so happy now that I'm gone. 💕 I love that you share all aspects of your true self Jen. Thank you.", "lex_millerr": "@jeweleyea @positiv_spin @caleighaadams", "ecdesignz": "I have cried so many times at so many jobs and made so many people uncomfortable but I don’t care. My empathy and sensitivity are my superpower and every time I show my emotions where people least expect it I help reprogram the subconscious minds of those around me. Crying is a beautiful release of energy and should be encouraged not stigmatized. 💜", "kathanista": "When my father died a few years ago due to complications of early onset Alzheimer’s, I was so numb and busy with family and arrangements that I didn’t cry at all. But when the dust settled and the grief hit, I would cry and not even be aware of it. My eyes would just spontaneously start leaking all over the place and it didn’t matter where I was. So I cried at work. And in client’s offices. And the grocery store. And in restaurants. Pretty much everywhere. Old me would have been mortified. New me knew that my healing process > someone else’s discomfort. Fuck that noise.", "heathertafolla": "Thank you for being so vulnerable in this curated platform. It gives us all a little strength and hope, especially me. Your work spreading awareness and acceptance of mental health issues and making them visible to the masses is doing some of the most necessary and challenging work out there. Thank you everyday for doing what you do. I’ll be crying at my job today with you 🤘🏼", "carotravaglio": "I’ve also been there done that. Thanks so much for understanding and spreading the word!", "breybateman": "@tdriggsroe I definitely cry at work too 😂", "janiedear": "@irene_ein", "andrea.fairservice": "@drtaylor1325 we all do it", "simone_jude": "I love this. Thank you. 🌈🖤❤️", "pippa204": "I‘m a teacher and I remember several times I‘ve cried at work. And whenever it happened I had people or children around me who were holding and making me feel better. Love that school ❤️", "kfarblifts": "Love this 🖤 I was working at a large corporation right out of college and for a call right before a meeting I couldn't miss to hear that my grandmother might die. I was holding back tears the whole meeting and no one excused me, and I was later reprimanded by my boss for being upset in the meeting.", "rockylovesemily22": "Omg. I got off the phone (a work call) with @closetvomitfashion and cried when we hung up because I love my job and the people in it sooo much, then read this. THANK YOU. #emotionsarereal ❤️😂🥴", "i_am_jacks_random_thoughts": "And it's why you're my 'insta' mentor 💗", "annajog": "Work Criers Unite! 👏✊ @maureenthebean", "misspowershop": "❤️", "hippiewitchh": "Thank you for this. Thank you for everything. ❤️", "allisonmadi78": "🙋🏻‍♀️Cried at work", "carmastreisand": "Love your openness and honesty, but more than that, I love how you trust ... trusting yourself , and us in the IG world with your share ... thank you !! teach !!!! 👍", "katiecurates17": "I love this! @jengotch I am an extremely emotional person and have experienced disapproval around this in the workplace. I’ve tried very hard to temper my emotions to make others more comfortable. My mother recently and unexpectedly passed. I couldn’t pretend to be ok, so I walked into a meeting and literally said, “just so everyone knows, I’m NOT ok.” And I’m so proud of myself for allowing myself to be vulnerable regardless of what other people may think, even at work. This is brilliant and I’m so behind it! #internationalcryatworkday", "chantel.alyssa": "I was just looking at the I cry at work shirt thinking about this. You're a treasure jen", "wendyoooo": "I have cried and cried and cried some more at work. I don’t love it but sometimes it’s the only thing you can or want to do! 💗💗", "calendarpaperco": "❤️❤️❤️❤️❤️", "raquelle_david": "This is great 💓", "stleonardsmoderngoods": "Good for you!", "daramadylen13": "Gah I love you and you’re vulnerability. 😭😭😭", "katsola1": "In attempt to appear professional, I would bottle up my feelings until I couldn't anymore and inevitablly I would cry out of shear frustration. When I cried I was told I was being unprofessional or too sensitive. It's hard because seeing or being yelled at or belittled seemed more acceptable in environments of 'no crying allowed.'", "m_anhaltzer": "I wear my I Cry AT Work tee shirt proudly. Thank you for ALL you do, Jen; you are a champion for so many.", "tracy_ashworth": "@leighscho 😥", "moniquekerns": "I didn’t cry at work but I did while using public transit - there was just a lot going on, my job wasn’t giving me any satisfaction and my mom was very ill, plus a guy ghosted me, etc and I ugly cried on the subway. Something inside just broke, because I had always been the sarcastic but happy person- and I couldn’t be that person. I ugly cried for a while but then slowly things got better, a lot better, to the best.", "eclairex_": "I CRY ALL THE TIME AT WORK 😭😂", "goodsociete": "This is amazing. ✨❤️🙏🏻", "able_ground": "Love you! ❤️💕", "somepopofcolor": "LOVE this! Cried many times at my jobs!", "nobodyscastle": "Such an inspiring woman ✨💕 I’ll love to work for yaaa 😭", "michaela_e_mccloskey": "I love it!! You are absolutely adorable! #nofearsoftears 💪🏼🌸♥️", "womanshopsworld": "I cried at work today.... I own the company, so I set the rules here and we allow tears! I lost a dear friend to suicide last year, and I’m facing some big life changes ahead that I know she would help me navigate with ease. I miss her, and I often think of her at work, bc she used to be my business’s biggest fan-girl. When i saw a butterfly on the way in to my office door today, I missed you Alma @alma_rossette 💜😢But I know you’re right here with me!❤️", "lomcandrews": "❤️", "sourdough61": "Yes yes yes to crying damn it!", "nattkatt": "@settlelikeashes @oliviamansourr", "alie_reid": "👏🏼♥️", "mrsholly.wood": "I had a teary meltdown at work today and kept apologising after. I needed to read this...thank you ♥️", "geri.charlton": "I've cried at work many times. 💕 Jen you're the best!", "lorileibo": "@lschocker", "shannnies": "👏👏👏👏👏👏👏👏👏👏👏", "celestevjohn": "Can you talk about how you have dealt with ending friendships? @designlovefest", "biru": "Thank you ♥️👏", "beckyinbloom": "I propose to expand “work” to include grad school and maybe even specifically professors’ offices! There is a similar and perhaps particular pressure on doctoral and master’s students to perform as if they have their shit together all the time. Putting on this facade and being surrounded by it can make you feel isolated in your feelings and scared to express them! Thank GOD I found a tribe of women bonded by our shared experiences of crying in advisors’ offices or after being grilled in a defense or due to a mansplaining twerp in a seminar or just because school is stressful and hard and disheartening. Thank you for normalizing and celebrating the feeling and emoting of the not-so-happy side of our lives.", "lareinitapdx": "@clarestager thought you might like this 😘❤️💓💞", "quesarara": "I highly recommend breathwork. It moves all the emotional energy around and out of you. You're free to laugh, cry, scream and release all ya want! @rebeccakordecki is a great guide if you're looking for a place in LA.", "nicki_clark": "I ❤️ you. Thank you 🙌🙏", "sabiaapothecary": "i’ve been told not to cry at work so many times i wanna puke and to that i say- “you know what, ya jerk? i run my own business, suffer when the biz doesn’t do well, work for free constantly when you get paid, handle every crisis in the middle of the night or when i’m on ‘vacation’ and maintain a semi healthy home life and have a baby, too. so if i wanna cry at work you can just Fuck. Right. Off. next” and then i smile because i love all creatures and want to spread love and light ✨✨✨✨", "anniemcardlephotography": "@saraharnold512 🙌🏽", "karinayob": "Thank you for the strength. 🙌🏻", "sparkleplenty_": "🙌🙌🙌", "gatospantalones": "I don’t cry at work but the other night at home something set me off and I sobbed. I hadn’t cried in so long it actually felt good. I hold everything in. Thank you for your posts. You’re the best 🌈", "iamsteph_xx": "Thank you for using your voice and your heart.🙏.... for making you so vulnerable in the name of us all... it's a tough life task being a gamechanger in this world... But you do look really good.. Though🖤", "taynologic": "Yes yes", "jade_melissa": "I fully support this...", "mmmegcarlile": "Wow. ♥️ Thank you.", "maenstudio.work": "👏💕", "noirnearfuture": "Thank you 💙", "megpjones": "This is great. I cried at a job interview once. Awkward but necessary. 💕", "karma.on.insta": "I remember a record album from the 70’s called Free to be you and me. There’s a song called It’s alright to cry, crying get sad out of you 🎶! That record was so great. And taught me a lot of really good lessons.", "katycapriles": "👏🏼👏🏼👏🏼", "love_kristinmarie": "I love you for doing this💕", "alexa_curtis\nVerified": "Verified", "blairhirak": "@jennyhogrefe", "happicat": "I cried today at work. I work from home but was in the phone talking to my boss about how overwhelmed I am right now...", "popejoandesignstudio": "It’s true. You really are THE best. 🖤👏", "myapplescruffs": "@ajohnson5446 @owlhoothoot @b_forsey @maya__jw @cbelles55 @ghoffarth", "monniecantu": "Tu y yo @dlmanzanerom", "tasiamperez": "@kristenmahoney 💖🙌🏼🎉 finally a day made for us🙋🏻‍♀️✨", "visualheart": "I cry at work, except I work alone at home so it's got a different vibe to it. Thanks for speaking about this. 💗", "sadiejetaime": "Omg. I love this. Can I work for you?", "hellomeiisita": "yo en la vida @luchi_es", "spiritgate.la": "@missdanihart love this ❤️", "jbbin": "I think social media can be a really great thing but unfortunately not enough people have your philosophy of sharing. I know people who are really unhappy in real life but from Instagram you’d think their life was perfect. We could all cry a little more and show it a little more. Thanks", "tessafarrealist": "@amandarose227 big girls do cry (at work)", "iheartsparklebabies": "I love you @jengotch ❤️", "spoonfulsugarco": "Yep I’ve had a good cry at a few companies, it’s a release... I’m also very lucky I work for myself now! 🙌🌈😊", "dorajessicah": "💗", "officialevercarradine\nVerified": "Verified", "bethhayesking": "Thank you! I am grateful for this. I realize I feel the most shame about crying at work when it is about work- being overwhelmed, frustrated, mad, exhausted, stressed. I feel like I’m supposed to keep my work life together and not crack while at work. It’s just not possible all the time and I am learning that’s ok!", "lolo_rad_o": "This is the first job that I have yet to cry at, but I know it’s coming! We’re in this together 🧡", "secretworldofsarahmac": "Thank you so much for this. As a psychologist who works at a community clinic, I get the implicit message that I’m supposed to be emotionless and can handle anything. I have always tried to have a “don’t cry at work” policy, and then beat myself up when I do cry. I’m going to try to be kinder to myself.", "von_hop_along": "I think that being open will resonate with a lot of people. Its important for other people to see its not a thing \"only crazy people do\". That emotions are natural, because as much as it seems like common sense, its NOT. Cheers to ending the stigma! 🎉⚡❤️", "michwake": "Been there! ❤️🌈", "beckylongstocking": "my girlfriend recently quit a job where the CEO made a mandate that anyone who cried at work, publicly or in private, would be fired immediately. I immediately bought the “I Cry At Work” shirt, and I plan on wearing it when I go with her to pick up her last check. 💕", "aagggirl94": "@pancake_housewife it happens to the best of us ❤️❤️", "em_henderson\nVerified": "Verified", "sophmackenz": "It does help! You are such an inspiration!!!", "everygirlneedsapole": "I’ve definitely cried at every job I’ve ever had. More than once at each probably. Always feel better after a cry and nobody ever fired me for it. ♥️", "doola1": "Thank you 💕", "alextheloon": "Thanks so much for sharing this! I cried at work on Wednesday and thought of your posts earlier this week and last about it and it helped honestly.", "mrsdionne79": "@balaylor we were just talking about this. 💖", "justagirl": "💗💗💗", "tessacbreeden": "@katrobirtz", "rebeccabillybob": "Xx", "_wavelengths": "Had a good cry at work yesterday 🙋🏻‍♀️ hurts to try and stifle the sound of it haha 🙈", "christinedecarvalho": "We all cry Girl 💖😭🙌", "moladuc": "Thank you 💕", "katieblossoms": "💛💛💛💛💛", "rachfullmer": "❤️❤️❤️ I love this!!!!", "meltedxheese": "Thank you. I am taking a break as I see this and have been wanting to cry out frustration all day at work. I see you. Thank you.", "carlyhome": "I love your total honesty! You’re awesome 💗🙏🏼", "alliemcelwee": "@downwithmjp", "jessicablair91": "@frantasyfran", "frazierandwing": "Crying is awesome", "freshicatodd": "Loveee 🙌🏼🙌🏼🙌🏼", "amandapearsonart": "Yes! Fellow cryer at work here 🙋‍♀️", "kvenia": "💛💛💛", "dr.christina_": "You are so amazing. I most defined did happy dance when I saw the picture of my #therapyiscool tote next to your anxiety necklace in this month’s issue of @womenshealthmag ♥️", "marsal1982": "Been there done that too!!!", "janetmcpheecarter": "You. Love this. 💛😍"}