{"doloresamedori": "Yes. 💘💘💘", "mainlygrayboutique": "❤️", "ionutradulescu": "Love the dress stripes @jengotch ✨", "kristirosemintz": "Your words almost mirror the last two and a half years of my life. With you on every level. Your words just made me swell. ❤️", "jobethonthejourney": "I'm new to the #jengotchfanclub and in just 5 minutes I'm a card caring member! 🌟🌟🌟🌟🌟😍🌈☕️💪🏼☕️🐝😎 SHINE on @jengotch", "goneinadventure": "Absolute respect for you!", "sedonachristina": "Wow, this is e v e r y t h i n g I needed to read this morning 💛🌸 thank you angel", "thecovengirlgang": "Amazing", "mirandapbarrigas": "Brilliant 👏🏽👏🏽👏🏽", "randomlysamantha": "I don’t know you but love you!!!! Especially after stalking 🤩 your feed. And your dads somehow. 🤪 ❤️", "meesenb": "This is 🙌🏼 💕💕", "annlovescoffee": "Your story resonated with me today. You’re the best ❤️", "ninjadevy": "Thank you for this.", "sophiahsin": "i found you here today and i really like you. great words lady!", "lizknotts": "@maraagold good musings on that trophy we’re all waiting for", "ohanniebeth": "You got this.", "flutterbry": "You need to follow @rowmorson", "kgross": "❤️💖❤️💖", "katiaslittlecorner": "Same here sista! Friendships gone, crappy bf gone (not so bad actually) but the thing is Im mad at me! I was literally smiling the whole way throught it !!! 🙈 🙉💩 talk about authenticity goals for 2018 💪", "makeupbybracha": "@zahavahuretsky", "riannonboven": "Keep going. Please. ❤️", "slowasfolk": "💕💕💕", "kjmalkovich": "Outrageous of your therapist!", "crystalthethird": "Oh my goodness, I desperately want to sit around and gossip with you about the *cruelty* the Universe serves in order to force us back onto the path it wants us on || even when it’s an overgrown gnarly path that you have to clear out yourself all the while grumbling *youve gotta be kidding me. Not even a machete?? Universe, grant me that machete now. It’s all I ask* //", "illdillsokota10": "🔥", "ketchuponeverything1": "Your so cool 😎 is it wrong to ask where the jump suit is from? You are my new style icon", "mybilliedesigns": "I love you so much 😭😭😭", "ilootpaperie": "Jen Gotch you are doing it! Thank you for always sharing the good, bad and funny ❤️", "soapverdi": "woah I love her so much @andrianaverdi", "letterandlark": "I think you're the bees knees. This past summer had SUUUUCKED for me and I realized I've been going through transitions too (unknowingly and not wanting to). Still unsure which side is up.", "kailanicole": "Love you!!!! I feel ya girl!", "rawbabysugar": "@nayyirah.waheed has a beautiful poem that states something along the lines that if loneliness finds you it's just your heart asking you to get to know it better and spend more time with you. It's impossible not to feel lonely, but so possible to change the perspective. 💛💛💛 you're beautiful", "sunshine_stephanie": "Stumbled across this post tonight, and this is the kind of thing I desperately needed to hear today. Thank you 💕", "laurengottmakeup": "Awesometown!", "founditonawhim": "Raw, honest and truthful. Great way to live life🙏🏻 a poem I just read this morning: In my darkest hour, hope kissed my check and said, \"everything will be ok\" 💗", "laurentaylorhld": "💜thank you for this.", "lexrosenbaum": "🙌🏻🙌🏻🙌🏻", "maggiebrummer": "You're amazing! 💕🌟", "littlewordsproject\nVerified": "Verified", "katpfisher": "@jengotch You're a fucking warrior princess - you have the power. You have the magic. Set up a finish line at the office and bust through that shit whenever you feel stuck. We love your ass.", "rathbunz": "You should either start a podcast or tell some stories on The Moth. I find myself checking in with you every day for whatever morsels of wisdom, anguish, comedy or insight you have to offer. Or just to see what your dad’s up to.", "beckymsimps": "YOU RULE JEN GOTCH 🏆🥇", "samanthersiever": "@im_a_stoner34", "ginamoom": "It was so awesome to meet you today! You are totally fabulous and the entire team at pigment loves you and your brand! Keep shining, super star! 💓🦄", "morgan1st": "Thank you so much for sharing 🙌💕 It means even more than you know!", "jessicadaviesmetalworks": "👍🏻❤️👊🏻", "sallydpx": "I ♥️ everything you post. I don’t think there’s anyone else on Instagram as real and vulnerable as you.", "seen_skincare": "boss lady goals!!", "thisisjoyner": "❤️", "laura.gwinn": "Thank you so much for being so brave and open, and inspiring. I know we don’t know each other ☺️ but it helps me and means a lot. 💕", "karaticathy": "🙏🏻👌 #cutenessoverload ❤️", "annagolkayepez": "😍😍 love this", "vmorrison3": "@jengotch Yessss 👏 You're doing brilliantly lady. One day at a time!", "maura_andrsn": "@jengotch You’re inspiring 💫", "sailorandscout": "Always spot on 🤜", "allpahats": "OMG! You have to write a book and we need to have a long, wine filled conversation! I'm still obsessed with this outfit and I had no idea who you were when we met, but turns out you're one of those inspiring people! I'm so glad we did meet! And the funny thing is that yesterday was #worldmentalhealthday and this kind of posts and words is exactly what we all as a society need to lift the taboos and thinking we need to be fine all the time. We need that darkness and we can go through it and be successful ❤️ I'm so glad I found your account 🙌🏻", "sleepy_king": "I love you. You’re the best.", "danielle.see": "@kevinchristopherhair - this is who I was telling you about", "charlottestoneshoes": "❤️❤️❤️", "chantal_danae": "You're everything ❤️", "mar_grooms": "You are inspiring!!! Thank you for sharing your story! 💕", "vanessapetersxo": "You're pretty amazing. Keep going. 💘❤️", "lareinitapdx": "@basal_underwear ❤️", "thrallllers": "Damn. Hail Jen 🙏🏾", "noboringdays": "I'm so glad I've found your page. I'm moved to tears and will gladly douse you with champagne whenever you want 👏🏻🎉👏🏻🎉👏🏻🎉👏🏻", "miss_lozzy88": "I'm trying to reach my start line, let alone see the tape at the finish. Reading what you write on your page just gives gentle little reminders that I can get through like other people do. I get tired, I lose the will to fight, and I write long letters that no one will ever read, but you remind me there's a smile and a brighter time ahead again I just need to keep walking forward to find it. Please keep walking forward and doing everything you're doing now, because you helped keep me from falling today @jengotch", "thebannerie": "Me too", "ldub310": "Please keep it up, jen! Your are amazing", "maggiemason": "I'm sorry all this happened. Gross. Good things for you, Jen Gotch.", "thegirlswithglasses\nVerified": "Verified", "_mimik": "@jengotch especially the tape/crossing a finish line part. 💕", "lolaroxyandthem": "❤️", "donna_ko": "✨✨✨✨✨✨✨✨✨", "jenna_aceandjig": "amen to all / ps URVCUTE pps 🏆🏆🏆🏆", "balticaincolor": "Wohooo!! You go girl ! 💖", "carlacoug": "Same. I have more to say but don't know how to articulate it. Divorce sucks especially when it's one sided. The good news is I was miserable but didn't know how to deal with so it was ultimately the best thing that happened to me but when someone drops it in your lap its never easy to deal with emotionally especially when you're a person that thinks about things a lot.", "artpippin": "I love the way you write! ❌⭕️", "megblancato": "❤️", "casemiroju": "you always do. ♥️", "marysingletonstudio": "Thank you", "nrcg92": "💛💛💛", "duckiesseaside": "You're awesome.😀", "redheadedwarrior": "🌈love how you keep it real and hilarious, keep on keeping on🌈", "ellenp13": "I love you!!!!!", "josievorenkamp": "👑👑", "sarahkshearer": "I love that you share real ness :)", "mariellabowman": "You seem like a real awesome chick!!! 🌻 thanks for connecting with us!!", "amiechandelle": "WE LOVE YOU WOMAN!!!", "constancezimmer\nVerified": "Verified", "tylerjmccall": "Please keep it up.", "andtheearthstayedyoung": "Your therapist did what?!?!", "maryhollandaise\nVerified": "Verified", "deedeeandcoco": "🙌🏽", "danielletorres__": "❤️", "cary_aceandjig": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "zoetaratodd": "❤️😘", "mayraimadera": "Thank you for this and Me too", "tjperez": "You are amazing! Thanks for sharing! 😘😘😘", "sallymaloerelish": "✨✨✨💕", "dolamorola": "❤️", "thealchemyofdesign": "You're awesome!", "anqg": "Vulnerability, humor, truth. It takes true courage...💖", "sarahclaire28": "One foot in front of the other! Whatever you're going through...keep going ✨", "vanalienz": "always love hearing your words ❤️", "iamklall": "You’re amazing!", "christina.bolt.ceramics": "Dear Jen I hear this, all of this, Ditto Xxxxxx", "abigaildeallen": "THANK U you make me less afraid to do life", "goodlcuksarah": "I look up to you Jen. I love how genuine you are. Thank you. Thank you. Sending you virtual hugs. You are strong. @jengotch", "leileamartin": "👸🏼 you are amazing!!", "jodyleila": "Love you !", "emilyannspeakout": "There needs to be more Jen Gotchs in the world. 🖤", "bneatobar": "Thank you for sharing ❤️", "_cupkait_": "💕💕💕", "iamjaquez": "Thank you", "leascreative": "So real, thank you!", "imsurco": "Great post!! And me too!!! Except dates differ a bit. But otherwise I totally understand and can promise one thing! Things will be better than before !! Soon soon and always", "itsmeswani": "Thank you for articulating the idea that we can have a good life we're grateful for, while simultaneously suffering. You're so right - the human condition leaves room for all kinds of pain, regardless of our success. I have never been able to put my finger on that. I have found the more in touch I've become with what I want, the more lonely I feel. And I think that's no coincidence. I'm growing to see that perhaps my loneliness is the space I need to rightfully heal. I feel honoured to follow your journey @jengotch.✨", "janeylear": "Love ya! One of the funniest people on insta and I love how you keep it real 🤘🏻", "scapeghost": "You’re a gem. Thank you 💕", "meg.andersen": "you are boundless, @jengotch ✨", "nataliabee": "You’re so real and down to earth. Sending peace and love 💖💖", "thesouthernashley": "Keep on being you! Your instastories can always bring a smile to my face.", "kleb42": "Me, too...big time. ❤️", "elleebeans": "Love how real this is❤️✨ Thank you for being open us. Keep doing you Jen🦄", "tiffyhapa": "Xoxo", "amyjomakespizza": "I ❤️ your REALLNESS! You are a strong, beautiful, courageous,wonderful - and still very REAL human being! I love you!", "stephpye": "In it together fam", "jessemeighan": "Me too 💕", "oliveargyle": "1. Divorce survivor. 2. Small biz founder. 3. Depression wrangler (wellbutrin, tea, multiple cats, the 4 Agreements). 4. Everything is terrifying and new, even after many years. 5. I wish I could wear ace & jig’s dang clothes, and maybe I just will. Thanks for sharing your truth. ✊️💎™", "cascity": "You're kind of like my hero !", "grace.duong": "I saw you speak at the last @losangeles_cm and I love your transparent honesty. Thank you for being you!! 👏👏👏", "paulineboldt": "Xo ❤️", "_racheltham": "You rule Jen!!!", "melissagaye__": "Me, too 😘", "lionheartliz": "Love you very hard. Me too, sister.", "badgaljj": "Go you! Very brave to share this xo", "im_lauren_c": "I don’t know you personally, but I love the role model that you are", "_amandakrueger": "You are amazing! So much to be proud of💖", "silvertooth": "Oh Jen, you are all of my lols, and you are so much more than enough! What a gyaaaaal 〰🤦🏼‍♀️🔛🔝", "tammythiele": "Thank you so much for taking us along for the ride...every brutal, harrowing, gorgeous step of it. Much love to you. ❤️", "martinamcfly": "❤️ @pran_dini", "sabrinaseverns": "So real and beautiful", "jessicaraebailey": "❤️❤️❤️❤️❤️❤️❤️", "melissaraath": "You’re wonderful 🌸🎈", "christiecherens": "You are so awesome. It takes courage to be human... and so many balls to share the experience. You rock 💕💋🦄", "tendies": "Did you break up with your therapist??", "jessyelliott": "❤️❤️❤️", "gioiamod": "Love you @jengotch !!!!!! 💖💖✨", "marisalynno": "you are strong and brave and and inspiration to so many. you got this! ✨", "jbnitz": "You are an inspiration. And sharing your innermost thoughts with everyone is super empowering for all of us. Thank you!", "yared.raffin": "Thank you for sharing this!!! 💗💗💗", "meldubie": "Wow a licensed therapist should never tell any patient what to do. There only roll is to help guide you through the journey", "tristenjnelson": "You are an incredible inspiration. The past few years, I have followed your journey and continue to be impressed with your candor and ability to open up with such a wide audience. It can't be easy, but know it's making a difference. There are so many of us out here struggling and trying to find our way as women in business and it's nice to know we are not alone in the way we are feeling. Success is hard. Thank you for being honest.", "maisonboutique": "You’re amazing. And loved. 💛", "morningbun": "thank you for being so real. you're beautiful, jen! ❤️", "everdje": "❤️ oh and if you're still wondering you are supercute 🔥🔥🔥", "morganhamilton86": "💕", "k_wicky": "You’re amazing and I’m so appreciate of your raw vulnerability. Thank you for always being so brave to share 💗💕", "1girlandherblog": "You're incredible and a true inspiration 😘", "yocruzie": "Too fried for a long comment, but wanted to say that you are a cutie pie!", "jupitersayshello": "#legend", "richandrye": "Those true words let's me know that the best have their struggles too. Little tear shed from that. Thank you for being real!", "dbuerli": "❤️🌹", "wadetrimmer": "Thanks for sharing this.", "emsiedearest": "Although we’ve never met, I have watched your company grow from afar and have found so much inspiration in all that you do. As someone going through a similar transitional period, I thank you for your wise words. You go girl!!", "blue13pop": "You are amazing and inspiring and your words always make me feel good, even when I'm in a really low spot 😊💕", "pemberleyjones": "Always rooting for you/us! ❤️🤗", "becsjakstas": "You are the best @jengotch ⚡️", "alexisaltoon": "Dude, thank you for sharing this.", "thehuttonhouse": "Beautiful soul & so good.", "endearinglyemma": "Jen Gotch YOU ARE DOING IT!!! ✔️✔️✔️", "wesbiffar": "Miss you Jen! Wish you nothing but the best. ❤️", "ohhhkris": "Every time you share I feel... something. Sometimes I feel everything. Why is there no emoji with heart ears?!?! ❤️❤️❤️", "jdiannedotson": "Got your back! Keep kicking ass!", "maddibukaty": "❤❤", "jenn.louise.w": "Yes!!!! I love this. You are amazing! XO thx for always sharing", "mehreenqudosi": "love ya jen 💛", "emilyroseink": "We're with you, sister 💕 us too", "barbarasueko": "Yup, me, too. 💗", "mixmastermel_b": "💕 you're the best!", "inhayama": "Hi Jen, I’ve followed you since when you used to be a Polaroid-only wedding photographer and I just wanted to tell you that I enjoy and feel gravitated towards your raw posts. I hope you will find some peace. I don’t want to say that I love you because it feels so cheap over the internet but please know that I care for you a lot. Xoxo", "kesley.365": "You are the freaking bestest ❤️❤️❤️", "jennuinearticle": "Transitions are super scary and super exciting all at the same time. Also, \"me, too.\"", "rakdesign": "You are awesome!", "llschick": "JEN GOTCH YOU DID IT 🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆", "brooke.gard.ner": "❤️❤️❤️💕💕💕🌈🌈🌈", "erinflett": "💛", "mrsmeganmorrison": "Me too Jen, me too! 💖", "xehpa": "💛💛💛💛💛", "jbilmer": "we all love you so god damn much. you make us feel like ourselves. thank you", "paigeappel": "Love you love you.", "katiemyhre": "So beautifully described. Thank you for posting. ☺️", "artbyamyanderson": "I've loved following along on your journey. You kick ass", "shopfortunafortuna": "I love you Jen! You're my inspo and powerful leader for so many! May we all learn the tough lessons with fierce grace and surrender to whatever will be!", "decor8\nVerified": "Verified", "stephaniedawson": "You're an inspiration, a beautiful, funny and very talented lady and REALLY cute!! I love your insta stories. Keep up the great human'ing! 💘😘 xxxxxx", "sydleaaa": "💘💖💗💪🏼💪🏼💪🏼", "blacktarheroine": "Fucking PREACH you beautiful unicorn person 🙌🏾", "thrift.eat.repeat": "You're the most!", "vivalaeva": "Fuck I wish you were my friend", "jessechamberlinmarble": "❤️❤️❤️", "fullheartsfarm": "Beautifully expressed. My ♥️is with you.", "slackerspins": "Wow dude, I had no idea. I love you.", "siobhanljames": "You’re the coolest person I don’t know. Youll smash it ⭐️⭐️⭐️", "swtkrzyjane": "God, I adore you! Keep it up, woman. Your strength is our strength and our strength is your strength. 💪🏻💪🏽💪🏿", "catebp": "Is it ok that I'm sitting alone at a bar, drinking a margarita, and tearing up reading this?!? Isn't life crazy and beautiful and awful and magical all at the same time?!? I have so much good in my life. So much. But sometimes the loneliness, the anxiety can be so much louder than all that. Thanks for always fighting, always talking. I've never met you, but I feel a camaraderie with you, that while it doesn't fill the loneliness, somehow makes it ok. Thanks for that.", "greywalls_greengardens": "Love your honestly. Love that you’re generous enough to share your life with a bunch of strangers! Thanks Jen! I think you’re 🌟", "miriam.vegac": "Thank you for the honesty, the realness and for making us feel like we’re not alone and we’re all in this together in some way 💖 you’re the best 🌟", "pedal_faster_susie": "I too long for alone time but find that when I get it I long for closeness & togetherness. A truly tormented soul 😊 I hit rock bottom at 28 as a down and out alcoholic so I can say with 100% certainty if you stick with it and accept life on life's terms anything is possible! You're awesome.", "heyraygun": "❤️", "lydiabrookspdx": "Me too ❤️", "liebercll": "I love you and your honesty. 😘 cheering you on all the way !", "birdiesreed": "❤️❤️❤️❤️ so much Jen!!! You are so inspiring, kickass and amazing.", "jennyjohrabe": "❤️", "alinactaylor": "💞🔥💞", "carolinekaufman": "Who is the therapist can we internet shame her?", "dana_herrin": "💗💕💖", "mskarireynolds": "💛💛💛", "pycaza": "I love this !", "paigeljones": "💛", "fotovibephotostation": "😉✨", "melhutaplaya": "💕💕💕", "ladystew": "👌🏼👌🏼👌🏼", "betsyking": "Wow. You go!!!", "spiritualalchemista": "I keep waiting for that finish line too after a really hard 2.5 years. Just when I think I'm so close, BAM...that finish line is pushed back. But I'm just more aware of how much I'm growing. It sounds like you've gotten through some tough stuff already and are learning as you go. You've got this! 💕", "sugo2go": "Look forward to hearing what lies on the other side of that imaginary finish line now that you've stepped beyond it.", "thats.sobianca": "I swear, that is all that therapists do. It's like they all have an agenda. I just sacked mine because I felt bad after every session. She would make me feel bad for staying in my relationship (which I'm happy in most of the time - we all have our ups and downs right?!)", "petalsofchiffon": "You're incredible Jen. 💕", "verywryly": "moved 2 tears and thank you 🌸", "mnrieger": "❤️", "getadvancedchic": "💕💕👍", "aklimton": "❤️❤️❤️", "kymlightfoot": "I REALLY like you 💪🏻🙌🏻👍🏻", "lizzie_darden": "💕💕💕", "madelineschichtel": "💗💪", "chloe.h.h": "💞🌌💞🌌💞", "yo.ashley.jo": "🌟💗🌻", "pictureitplants": "Yes yes yes yes yes YES. 😍😍😍😍", "melindajosie": "❤️❤️❤️ YES.", "sweetrootvillage": "You are a beautiful wonderful soul packed with all things nice and sassy and real and marvelous.", "micaelahoo": "Love you for this. 💖", "glassyyy": "you really are an amazing, incredibly inspiring person <3", "yasscamacho": "Go Jen!!💪💕", "alimoyano": "Such an inspiration go Jen!!!!", "jessrosejim": "Hey fuck that guy! Your like the coolest chick I can think of. On the other hand, this is a blessing in disguise and all that other cliche bs. You're an incredible business women and an even better person. That's a lot coming from someone who doesn't even know you personally. But I'm just so sure it's true. You go Glenn Coco👍🏼", "jljessee": "Same. You’re a champion. Don’t forget it!", "ardenmyrin\nVerified": "Verified", "dayleigh_art": "❤ You are, again, ever-generous with your inner thoughts. And we are forever grateful.❤", "_kristenalanah": "The way you keep it real makes me love you more every day.", "itzayanalynn": "@jengotch , YOU are a ABSOLUTE ROCK 🌟 STAR!!! I am always saying, \"me too\" after reading your posts 💜 You are amazing, talented and a total hot mama!! 💜 Get out there and grab the world by the balls, Sista 💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜", "meganelvrum": "You slay lady!!!! Keep it up! You are a true inspiration!💖", "feminest.co": "Ah! I love you. 💕", "kammyam": "I love your honestly on your account. You are fun and gorgeous and real.", "simonecarillo": "I think we should be friends", "kendaharo": "Omg @jengotch you are my favorite person rn - you live so hard. keep it up lady! ❤️", "justagirl": "I think you are amaze. Can’t wait to see what’s up next.💗", "jade_melissa": "You’re amazing lady ✨", "mindybyrdlegs": "Your posts/stories helped get me through postpartum depression #realtalk Thank you for your honesty! 💕✨", "heather__maher": "Please let there be a book deal in your future? You are hilarious and sad and heartfelt and inspiring and I would read the F out of a book like that. YOU COULD CALL IT \"JEN GOTCH, YOU DID IT\" !!!!!!", "valeriecatrow": "You're just fantastic. Really.", "blynch1997": "You are a badass inspiring human ...sending you love ❤️", "modchalet": "You are so brave. Thank you for sharing your life. You give me hope ❤️❤️❤️", "bethannewall": "💕💕💕", "kittenkaboom": "You're absolutely a delight to follow on Instagram. You're real. And it's refreshing. Keep it up. We are all in this together.", "sarasleepyhollow": "🦋🦋🦋 xoxoxoxo 😘", "kimgarvinferrier": "Me too❤️", "skinnercarls": "🏋🏼‍♀️🔮👊🏻", "jack.e.line.lugo": "What a beautiful soul you have 😘", "everwillalove": "You are me...we...us so thank you THANK YOU for putting yourself (us) out there❤️", "squirrelstreet": "Your honesty and the fragility that comes with it makes me want to share my own challenges more openly with those around me! Also, your love of life, dedication and perspective are something that have truly inspired me to get off my sad booty and make something of myself! Well done Jen - you rock!", "waitingforgaby": "How beautiful and eloquent. We cannot have light without dark. The human condition is ever changing, thank you for sharing your experience and building connections xx", "chemashtry": "❤️", "loridoran": "My parents experienced the same thing with a therapist. Thank you for sharing what you are going through. Sharing is for sure caring. Life can sure be lonely sometimes.", "katherinebackman": "❤️❤️❤️❤️", "harukokittieluv": "Fuck man needed that read today! You really inspire me to get the fuck outta bed. I'm having my decline child no longer attached to the father and have felt my world collapse above me more then I can count but ready and seeing all you and many women in similar situations or dealing with hardships staying above it all is the hope I need to just know all good things come to those that push forward instead of sinking in the darkness thank you!!! Keep your head up!! We're all rooting for each other ❤❤❤🌹", "gina_philangee": "#bossgoals #lifegoals #humangoals DO IT TO IT, JEN GOTCH!!!", "marticabogusz": "🌈🦄💞", "kelseyraerussell": "❤️❤️❤️", "chilledroses": "Oh yeah, I also lost my business as well because we started it together and he took it and ran! Haven't really figured out how to get back on my entrepreneurial-feet ever since. So I love this part of your story as well ☺️", "savphree": "you are an inspiration all around, jen gotch. and don’t you forget it! 💖🌟😏", "erikasentz": "I LOVE YOU JEN GOTCH", "peteyhana": "💕❤️💕", "dianajones7": "I just moved to a new place and started following you. I refer to you as my new friend and my husband tries to correct me....there is no need for that. Thanks for being my friend! You are awesome.", "jessicafosterplanning": "💛💛💛", "realmichshady": "Omg. Sue that therapist!", "nlongo22": "You're amazing!", "lazzzed": "KeepItUp🍄CuteThang!", "gabriellabordo": "You’re the best! ✨✨✨🎉🎉🎉🎉", "cleloutre": "🙌❤🎉", "lyssnlove": "❤️❤️❤️", "sortner": "💪🏼", "tracyporter_poeticwanderlust": "Bravo jen ❤️❤️❤️❤️💋", "_susiekate": "💖💖💖", "roadtippen_jax": "I look up to you Jen Gotch.", "katieblossoms": "Me too. Me too. Thank you. So much.", "kitchentablenw6": "Your honesty helps so many people, you're truly amazing. And good luck for the next stage of your life, whatever you do will be brilliant ❤❤", "ca_crissyangel": "You inspire me. You remind me to be me and that flaws and all I am badass. Thank you. You being just you is powerful to many seeking things outside of themselves. ❤️🙌🏼✊🏼", "dreamingofdinner": "✨🌈⚡️💕🎉 You got this! We got this! (And very yes on the \"me too!)", "jaimeko": "You fucking ballsy, legend, boss human. I think you're incredible ✨ @jengotch", "kimbaise": "LOVE YER GUTS JEN❣️❣️❣️", "cloverhunter": "You're doing your best and it's pretty fucking cool! ✨", "shopteot": "Love that you do it all and keep it real. Best to you.", "julieloveshome": "You are awesome. Thanks for being you.", "26andnotcounting": "Thank you for always sharing. It helps more than you know. 💛✌🏼", "pehtrasvanberg": "💗", "julia_and_child": "💓💗💓💗", "alicia_johnston_": "🏆🏆🏆🏆🏆🏆🏆🏆🏆🏆", "kate_winifred": "honey you're kind of amazing. I hope you get to feel a bit proud amongst other things 💕💘💕💘", "victoria.m.blackbird": "Much love and strength to you! 💕✌🏻", "anchorb": "❤️", "crumbsofcoloredpaper": "love this one @dakota___reed @madipipkin", "sophielynnmorris": "Omg please explain what happened with your therapist wtf", "bryanapalosaari": "❤️❤️❤️", "lauraaaah_hoopdoggydog": "I fucking love you @jengotch", "lisapalmer": "Love when self awareness .. even when we don't really ask for it, brings us closer to who we are really meant to be. Keep rocking on lady! & I'll give you the trophy 🏆🏆🏆🙌🏼", "mads_gover": "You’re amazing Jen 💛", "hellofarrugia": "As always, thank you and YES. And those earringz. (As always)", "amandafaeslc": "💕💕💕💕💕", "lizlibre": "Oh man 😘😘😘", "natalie.reilly": "Thank you!", "jessicaallardstudio": "💕🐌🌻🐝💕", "sararodriguezgarcia": "🙌🏻🙌🏻🙌🏻🙌🏻", "cherimoyatree": "😙😙😙😙😙😙", "maileknight": "Can definitely relate. In the same place right now, too. ❤️", "angeladeleon.hassan": "This is the best. Made me smile 😊💪🏽💘", "foxandfinch": "Thank you, thank you, for being so honest. 💖💖💖", "_kellynelson": "fave social media gal💘💘💘", "jaymeemartino": "You're my favorite person to follow on Instagram. 💞 You're the best.", "joversusvolcano": "Dude, I am so happy I found you on here. Wishing you contentment (wishing it for all of us really), and grateful you share all of this with us. I think you're fucken ace 💘", "clairebrealestate": "♥️♥️♥️", "homeslicestudio": "I just think you’re the best.❤️", "spicyguacamanda": "That is unbelievable. What would possess a therapist to do that (especially your own therapist)? Keep being awesome and sharing your truth!", "tiffoneill": "I feel you. Glad you can share it all here. ❤️", "gnarielle": "Wtf @ your therapist!!!?", "love.and.m.oceans": "So much yes!!!! 💕💕💕", "zilahdrahn": "I love you so much & you are so beautiful", "scarletroots": "You are the definition of the girl boss. thank you for being REAL. it's so insanely rare to find on this silly little app these days. 💕", "olivebarrett": "Love you SOOO much", "ma_brujaja": "I don’t know you but know about you because of this platform and your shop and articles. You’re inspiring and honest with being a human being and things you deal with/have dealt with. I appreciate being real, and you’re fucking real. Keep living sister ✌🏽", "maggie_eisenstat": "For a platform that can make one roll their eyes a lot, you @jengotch are a breath of fresh air and you never fail to make me smile. ❤️", "megeeeee": "You look like such a fun person and your honesty is cool.", "almcuration": "❤️❤️❤️❤️❤️", "heydarcyrae": "Yes!", "velsiemak": "I don't know you but you've been more open and honest than some of my close friends. All I can say is you're UH-MAZING for going through all that and for keepin' it real. Thank you for sharing! 💕", "pepperbdesign": "💕💕💕💕", "goosebumpsboutiquebedding": "Your the best! Keep doing what you do. Your random Insta stories are hilarious and the ones I look forward to the most. You go gurl!!!!! 🌼🌻🌼🌻", "meanmail": "💘", "ktyprry": "❤️❤️❤️", "__eleanorhope": "👏🏽🎉🥂oh so beautifully put. Thank you Jen for reminding me that emotionz are human.", "jenniferleroiyoga": "Me too", "jennrak": "Thank you for being you and being real ⚡️ you are honest and raw. An inspiration. ❤️", "sayhellobirdie": "❤️ Thank you for being honest and for always telling it how it is in a world that is often over curated ❤️ You inspire me to embrace change ❤️", "gemmagroko": "❤", "theboozybungalow": "❤️", "hou_joo": "That's beautiful", "tammylicious": "You are wonderful", "flowersandgarbage": "Love you, Jen. We are right here with you.", "emmakatepaints": "@jengotch you are the kind of woman I want my three young girls to look up to. Because in life shit gets real. It gets messy. And you have dealt with it head on. Jen, you rock 💖💥✋", "bettyandjune": "♥️♥️♥️", "backstageboo": "💚🦄💕", "natasha_castro": "A true inspiration", "juliebethkapp": "Your honesty is so refreshing! That is some hard stuff. Love your posts and your insta stories brighten my day - your sense of humor is 🏆", "cristycandler": "Wow! Thank you for this transparent post. Candid and brave. 🐲", "kachelmacher": "Thank you, I feel like you're a huge support whether you know it or not. Annnd thank you for posting a bathroom selfie. 🌈💚", "mrsjacksonhere": "You did it! 🏁♠️💄", "thecreativeporcupine": "You are just the best. That is all.", "tiffpena": "♥️♥️♥️", "betsywoeste": "Love you, Jen Gotch.", "pomodni_kreten": "I love your honesty ❤ and me too 😊 'The only thing constant in life is change' - someone way smarter than me said that. Life brings one challenge after another. Some champagne inbetween is in order though 🎉 take some time to enjoy your success, cheers", "sarahbees": "💜💖👏🍾", "kyln.2": "I adore you and you inspire me everyday", "softspiritstrong": "Youda absolute best 💘", "b_blove": "Thank you for always being honest. Happy to support you. I have been following along since the Polaroid days 😊 It's a moot point im sure, but isn't what your therapist did a totally violation of her medical obligation to her patient?", "betsyclegg": "You're just the best.", "lydialassen": "You are my FAVORITE!! Jen, you're the best!!!", "kateantonas": "😘", "thelovedesignedlife": "I love your open heart. you put into words what is so hard for so many to describe. ❤️", "ashleybrookebigler": "Appreciate your honesty so much! You are such an inspiration. 💗", "kellynkawaguchi": "❤❤❤ jen gotch, beacon of hope and light", "badchelsea": "You’re amazing Jen!! Thank you for your honesty always 💗", "y.viii": "Beautiful!! 😻", "frankgarciastudio": "@jengotch you rock our world in more ways than you know 💖💖💖", "kelseylink": "you are 🙌🏻🙌🏻", "chasingdenisse": "♥️♥️♥️♥️", "yookoowheeweet": "And thank you for making many of us feel the tiny bit of belonging ❤️", "gabsfarfang": "That’s part of being a human and living life.. thanks so much for sharing @jengotch", "karenrosens": "Total hero to me 💞💞💞🎉🎉🎉🎉", "saramaguire": "🙌🏼🙌🏼🙌🏼🙌🏼", "loveunicorntribe": "You're rad.", "amandawrites": "Preach!", "ksushas": "We can do it! 💪", "73stephanien": "Feel like we're very similar ladies, the emotions, the hilarity. Thank you for sharing your life here. ❤️", "stacy_ernst": "I've never commented, but I really appreciate your honesty and vulnerability. It's an honest portrayal when so much in this space can be deceiving \"perfect\". Wishing you well and sending love in her new transitions!", "sarahkahnhair": "@jengotch You are so refreshingly open I love everything you are brave enough to share.. inspiring as a business owner, woman and overall human!", "reinita_crosa": "@jengotch Your therapist is a twat!", "rebekoc": "Just love x", "rowdeezy227": "@jengotch I can only imagine echo what everyone else has already said. Thanks for being so open... it helps me feel less crazy.", "simple_fortune": "Thank you. Thank you. Thank you.", "donniesunshine": "See! SO cute!!!!!! @jengotch", "missbipps": "You are the best!", "jeanette_lazusky": "You are such an inspiration 💕💕💕 the best girl boss anyone could have as a role model 🍾🍾🍾", "mightypapershop": "👏👏👏👏thank you!", "wildwhim": "Gosh, I adore you.", "ally.weldon": "❤️", "lizperezartist": "@jengotch “You didn’t lose if you gained yourself in the process.” -Liz Pérez ☺️ from Journal of an Indigo Artist 💜", "kerrikeaton": "Love you and the way you are navigating this beautiful human life. Thank you for sharing 🖤", "appendageofdarkness": "I love this 💫", "chalkandnotch": "❤️❤️❤️", "laniako": "love you so much", "rufflemedia": "@jengotch your Creative Mornings talk was great. Thanks for the inspiration x", "racheljjjj": "You’re a queen !!!!! Rule your empire !!!", "lovelypaperthings": "Go girl go!!!!!!", "kweenhotsauce": "✨💥☄️🔥", "jibuana": "Directly from Portugal \"me too!\" 😊 3 years ago everything changed in a way very similar to what you have described and I continued to see the wonderfull side of my great life. Challenges are more and more scary ones, but this is the fantastic, great journey called life☺", "sugardollswim": "I love your honesty so much @jengotch I've read your other post about depression and really connect with it. I wish we could be friends or you could be my mentor, can I take you to lunch or something? Is that completely odd? Oh well I'm just another lady creative who admires you. I promise I'm not a weirdo. Have a great weekend ☺❤👏", "alicethecoolcrab": "🖤", "nickashkenis": "❤️❤️❤️", "lauraelle": "❤️❤️❤️", "hannahlee_v": "Our hero 💗", "morganecaldwell": "❤️❤️❤️🙌🏼", "cellerwilliams": "Thank you for sharing @jengotch Inspired by you, proud of you and cheering you on!!! I was gobsmacked to find yet another set of transitions and challenges instead of my finish line or at least a sparkly badge. Rude!! But maybe these transitions are our superpower? Sending love ❤️❤️❤️", "thisthatblog": "girl you’re so bomb. 🙌🏻", "laurabarth": "You are amazing!", "anouckplume": "❤️❤️❤️", "andreamarietoth": "Jen ur fuckin awesome. Much love 🙏", "kimberlyannme": "💪🏼", "fashesha": "One of the many reasons why I love you is that you share things like this. It's authentic and genuine and inspirational. You go girl.", "enthalphie": "You rock! 💪🔥🔥", "laurlings": "Yes✊🏽 let’s do this!", "denvertodublin": "So inspired by your openness and light. You’re posts never cease to help me through my own struggles. Thank you for sharing, sending love your way!", "megyusi": "@witchbaby1211 WORD!!!!!!!", "vanessagumdrop": "We love you Jen!!!", "nogi_t": "💍♥️", "joiebutter": "hey no pressure but you're freaking super woman. i mean... i spend so much time feeling like i have to hide all the hard stuff or talking around it. your honesty has given me back to much. 💗", "hannah.g.r": "You’re an inspiration 😍 we love you!!!💕", "lindseyreyenga": "proud of you 💗", "amadorcollective": "This is truth that there is no finish line. I mean the human condition can feel drowning when we are down. I am starting a greeting cards co after surviving cancer this year and you are one of my biggest creative inspirations. I gotta remember that once I make it that doesn’t mean I’ll have it all together as U might have thought you’d feel when your business took off! Cheers to keeping at it and staying w us Jen Gotch! U r a real person, not a robot and being pickeled in juices of depression is hard but a part of feeling all the feelings. xo anyways!🔺", "crumbumb_nad": "💕💕💕", "sdm05": "You are the coolest. 🙌🏻", "amity_spiegel": "You inspire me so much, I so appreciate you speaking your truth so openly. ❤❤❤", "irenegianos": "I'm so crazy in love with this Jen!! I want to share it with my group, my tribe, TheOPLounge.com. It's about all this shit that you're talking about!! This is the biggest #win for the day I'm reading and so grateful we have met. You're an inspiration to others who are going thru shit in life too. I absolutely love this and love you!!! @jengotch 😘😘😘😘", "theotherblonde": "Love you Jen! Thank you for your honesty and keeping me inspired 💕🎉💯💓🥂", "seshcoworking": "Me too. Me too, me too, me too. I’ve never met you but feel I know you nonetheless. You have inspired me in so many ways that to write them all on here would probably just piss everyone off. Ha! I will end with this though - last week when talking biz dreams, my hubby asked who my hero/role model was. I said “Jen Gotch of Ban.do”. He said “who’s hen gotch and what’s a Ban.do?”. I answered “Maybe nothing to you, but she’s everything to me”. Keep on, keepin on. ✌️❤️", "lobsterandswan": "✨🙌🏻❤️🙌🏻✨🙌🏻❤️🙌🏻✨", "jenhubbellphoto": "💁🏻💕", "claire_desantis": "good golly you're a winner 🏆", "ivapawling": "Gotch for President! Looooove you.", "lizzzy.bee": "You articulate so well what many of us also feel but can't put into words- thank you for helping us feel less alone and for being an inspiring badass while you're at it! 💪✨💖 Let us be here for you too... You Gotch this! ;)", "anniemsp": "You are strong and loved! And that @aceandjig Outlaw Johnny looks amazing on you! Love me some ace & jig 🙌🏻", "nin.handmade": "I started to follow you a few years ago...your funny smile, your positive vibrations and your style inspire me...and i'm in Italy, so you are so powerfull, your empaty across the Ocean!!! 💓💓", "eebrock": "💖", "meganewarren": "I want to like this a thousand times.", "sallinthecity": "You’re the best. Me too. So much me too. Me too.", "kevadineagency": "GIRLS KICK ASS FOREVER !! ❤️🤘🏼", "andrea.fairservice": "You're seriously amazing. Love your work for bando and all and your creative styling is how I found you but now for me, another number under the followers count, it's so much more. Like when you become comfortable enough to begin to share intimate details of your life with someone who's just an acquaintance and realize, \"I've found one of my people and we are going to be great friends.\" As always, thank you for everything. Laughs, truth, insecurities, advise. Everything. Xo 💘", "valmcguire": "✨✨🏆✨✨", "ssbazodi": "You're a shining example of doing your best and getting through it ✨⭐ thanks for sharing your journey", "valeriabogota": "Yes", "alwayshunterb": "You're amazing. Thank you for sharing", "mali.mish.marlene": "❤️", "pudgypeony": "💗💗💗🏆(it says:JEN GOTCH you got this.) 🏃🏼‍♀️", "lauraplouzek": "I looooooove you! Samesies all day long.", "camilladallerup\nVerified": "Verified", "carlyfairbank": "🙌🏼♥️", "bobbi_ree": "Rooting for you!", "tongue.in.chic": "❤️❤️❤️❤️❤️❤️", "onefinea": "I love you so much for being YOU!💕", "tif.jpeg": "WE BELIEVE IN YOU!", "vidhra": "You are one of the 'most honest' person I know in this Instagram era. And your honesty makes me to think that success is not glamorous. And am grateful for it. 🙏🏼✨thank you", "thesweetbeast": "Thank you for you. ❤️", "jeannnes": "You’re amazing.", "imallieallieallie": "ILYSM", "_latina_fey": "Sooo good 🙌🏽🙏🏼💘", "desirae.danielle": "Jen, thank you so much for this. I feel you, truly feel you, and I seriously appreciate you speaking out. Wayyyyyyy too often I go through my days wondering if I'm the only one struggling with connection or feeling lost. So anyway, it's nice to know that even super cool and successful people like yourself feel it. Also, when I really am having a day I like to watch Bo Burnham's special Make Happy, because I feel like it's truly so relatable. Hope you're weekend is a good one. Mean that!", "amy_starlight": "Me too. So much me too.", "erinmelear": "❤️❤️❤️❤️❤️", "taylor_r_crockett": "I relate on so many levels...", "neecolemun": "🙌🏼🙌🏼🙌🏼🙌🏼", "northsouthmakers": "❤️", "courtjay": "Love you!!!", "allisonbamcat": "Thank you for sharing your heart with the world, I look up to you so much for your authenticity!! 💖", "che_marie": "So much power in knowing what you want, so much anxiety in figuring out how to get it. Ha. You're the best.", "jess.weliwitigoda": "I love your rawness. You do you - we all enjoy the journey with you.", "steviepants": "🙌🙌🥂🥂", "mrnelaaaaa": "Love you @jengotch! You inspire me! 💖💖💖", "jupiterandthebee": "😘", "flummery": "Oh Jen. I love you.", "nourtneyg": "Queen!!!!! 👸🏼🙌🏼", "thecasapino": "❤️ me too 🤷🏼‍♀️", "sscheidler": "Oh lady. Thank you for the gift of your honesty. The world craves it!", "necessarilili": "thanks for all you do 💪🏼🏆😘", "jessnewfield": "Gosh you're strong. And you remind me that I am strong too. Thank you for your transparency.", "kristin.ferro": "✨C H E E R S ✨", "crowyrose": "thank you thank you thank you", "elauinc": "Girl. You are an inspiration.", "emilykarmstrong": "Thanks for sharing this with us ❤️", "evoult": "You are the bravest!! 🦄✨", "keriann14": "Good for you and thank you for sharing your vulnerabilities with us!", "palomacorzo": "Wtf with the therapist", "vampireyoga": "Wow Jen! I had a therapist betray me too! That is CRAZY painful - took me 2.5 years to get over it. And sometimes I still cry. He has a history working with my family for over 40 years!!! Wow! I want to give u a big hug! Keep going - luv ya", "blondebiscuit": "You're the best human ❤️", "sandrafloratos": "❤️", "_madomarie": "Yes! Again. Always. How you manage to reach so many people by being real, vulnerable, and freaking hilarious at the same time is a little miracle that will never stop to amaze me. Also, everytime i'm feeling down and depression creeps in, you manage to post something and i'm once again, blown away by your little gems of truth and wisdom. Keep on rocking our world, Jen Gotch, we'll stick with you! Well, at least i'll do ❤️❤️❤️", "teamborndreamer": "Thank you for humanizing the life of a business woman and entrepreneur. The entrepreneur & creative life is so difficult and yet so much of what is in the media via magazines / blogs / etc. makes it look so easy. As if a select few 'chosen ones' excel and know all of the answers making the everyday struggles we all face feel that more isolating. Thank you so much for your courage, insight and kindness to share your journey with all of us. Sending good vibes to you today and always! 🦋💐🌈🍉🍟🍦🍪🍾🍾🍾🍾🍾💕", "lizannsieck": "💕", "djshaz": "❣️ You are the best ❣️", "indias_days": "❤️❤️❤️", "campbellcate": "You are gorgeous and strong and forever inspiring me. Love this and you. 🏆", "kellypethel": "Rooting for you Jen!! Thank you for your honesty! We need more of that in this world!!", "yayparties": "Total inspiration in your realness and honesty....and so dang hilarious. 💕", "gilllazz": "You’re an inspiration to us all jen. Everything is gonna be okay, and with your resilient spirit and attitude good things will continue to come ✨", "lindaward_art": "Damn. You may of lost intimacy in every area of your life EXCEPT your honesty. Your vulnerability and courage are truly inspiring. 💕🌻✊🏻keep going!!!", "opinionatedjacqueline": "❤️❤️❤️❤️ you’re incredible.", "marielearegales": "You go girl! Nothing is really settled in life, right?", "martadooodle": "Jem Gotch, you did it!!! 🎉☄️✨", "emilyjanelong_art": "I think you are wonderful Jen Gotch!", "thebloomingloom": "Can't believe that therapist 👊🏻👊🏻👊🏻👊🏻! Wish you the best!!! 😘 ✨💕", "coliejae": "Thank you for sharing your struggles and triumphs, you’re a courageous woman 💫", "breepfeil_": "Can totally relate to your comments on loneliness. Never knew exactly how to word it, and you just did it. Thank you for sharing. 💕", "kendelgoooon": "<3", "_jentrification_": "@jengotch I just love you jen gotch 💖", "caffeineismysuperpower": "I have much to say and yet nothing at all. Pound pound peace!", "dinadalziel": "Thanks for always being real, Jen Gotch! We appreciate you. ⭐️", "valealepena": ":) you are so great lady", "momonewman": "You are my hero 💕✨✊🏼", "moster_karin": "😘😘😘", "cpn_68": "Bravo to your bravery! Wish you good energy on your journey. Also, I love your posts with your parents, always makes me LOL!!", "dressedbykess": "❤️❤️", "wearhousestyle": "You're the best! Love how raw and real you are!", "magicandthings": "You're my #1 girl crush! Your business is inspiring and you're darling and hilarious and I follow lots of people I don't know in real life but you're totally my fave!!! Thanks for being awesome.", "miza_____pizza": "Luv ya!! We're going to stick to you like glue through all the hardships and success!!", "danieggman": "You da best, girl!! 💕💕", "queenikathleeni": "Woah I love this. Also that is some kind of shitty therapist on another level.", "katiekimberly": "@alyssakbergs", "justinflewaway": "Virtual hug 💛", "jcorinna": "wow. I love you more and more each day jen. keep doing you #ladyboss", "aanaqa": "I look forward to hearing your stories and seeing your posts daily. You girl, are pure magic! 🦄", "ambertcb": "I love how REAL you are. Big heart ❤️ 💕🙌⚡️", "oliviacamille": "🎢's have to stick together 👊💕", "taybow.travels": "😘", "katelewisart": "Thx for being so transparent! 🙌🙌💥💥", "rmizrahievents": "Totally with you! Youre an inspiration", "haloauragraphic": "❤️", "hannahsoffa": "EGBOK / love you ❤️❤️", "studiolittlec": "Thank you for your brutal honesty about depression, betrayal and resurrection . Your vulnerability really is inspiring to those of us who struggle with our own issues alongside of you, though in the shadows. You're a brave and beautiful person, Jen. May you never stop being that way. Cheers!", "cuteclevername": "I've been following you since I fell in love with your polaroids what feels like 100 years ago. I've always appreciated your honest and real approach to emotions with your art and direction. ❤️ the only promised constant in life is change! You are doing it right everyday by experiencing life 😍", "kaylahaykin": "@juliapaganis", "bidibidibummer": "You rock", "truthannn": "❤️🌈❤️", "modchik": "We “SEE” you 👸🏼and we are cheering you on all the way 🔝", "gdancepants": "You are magical✨✨✨", "erincampbelldunkerley": "👏🏻👏🏻👏🏻👏🏻👏🏻💕💕💕😘", "tessafarrealist": "@jengotch thank you. for sharing your experiences. your feelings. and an entire community of supporters. it's amazing to appear in a virtual plane, \"surrounded\" by so many strangers and feel more understood perhaps here than anywhere else in my life.", "gloryceramics": "Liked it twice", "jacksfoodla": "Cute and fun Nick Kroll material", "marielosbornlifestyle": "💓", "demandas": "Thanks for always being real and being human. You give a lot of other people the courage to take on the day. You are one of my favorite people to follow on IG. ❤️❤️", "tenaciousdee": "You are amazing. 😘", "prettylittlefawn\nVerified": "Verified", "familyaffairs_by_ninaegli": "❤️", "herwelshness": "I just like you a whole lot.", "k_berlin": "@jengotch now it makes sense why I was drawn to you without knowing anything about you or your business. Well, that and the fact that our dads went to the same high school at nearly the same time. ⚡️💙⚡️", "terramedley": "Yes!! 👏🏼👏🏼👏🏼❤️ Thank you!", "katyspedersen": "❤️", "yourjoyologist": "💖💖💖 you are awesome!!!!! Believe it. And so loved. Oh and shitty therapist move but maybe it turned out for the better?", "readysteadymagazine": "I feel you completely. Thanks for showing us that it's not all perfect and simple for big business ladies. Xoxoxo.", "meowria.anne": "I'm going through those same exact changes and I've been looking up to you and the way you handle things. I basically tell myself if you can get through it, do can I. Thanks for being a cool role model.", "dearlyamy": "I live for your inspirational posts. You are awesome and always on point. So brave. ❤️☀️✌🏻️", "radianthuman_\nVerified": "Verified", "sleising_": "❤️🙌🏻", "kate_kavanaugh": "I think as a business owner and also just by nature, I am always looking for the moment when things come to a clean close and a new set of circumstances present themselves. Instead, life presents as an exercise in constant continuity. Continuous change, continuous exhaustion, continuous joy, continuous challenge. And I find myself in a constant attempt to adapt to the constant motion, change, and transition. So. Me too, a lot.", "djm0to": "@klmoncure @mooonrockz ♥️🍕♥️JEN GOTCH 2020♥️🍕♥️", "teekay_ryan": "Happy for you! Only special people grow from hurt sooooo \"CONGRATS, you did it!\"", "jojoharvie": "I love you so much! So raw and also so funny. I like to watch your stories to see what your fringe is doing, so volumous and free! 💁🏼", "ilovelucca": "L O V E ❤️❤️❤️❤️", "bycaralauren": "You are such an inspiration. Thank you👌🏻", "yungchancla": "MY HERO", "lizziemdesign": "Love you beautiful Jen 🌈❤️🌈❤️me, too. X", "realbrookewhite\nVerified": "Verified", "bareinkco": "We love you Jen, you are such a beautiful person ❤️❤️❤️", "jesihaackdesign": "🖕🏻that therapist.", "hayleyhurl": "Me too 💜", "bookandsalt": "YESSS HERO! The way you talk about these new phases and seasons is so super real and makes those of us moving into new seasons feel less crazy, less scared, less weirded out. Life is just so huge. ❤️", "heylego__": "You are so.precious 💖", "cindizatto": "❤️❤️❤️", "missy_allison": "You're awesome and brave, and that's why I like you 😙😙😙", "leslieschor": "❤️❤️❤️", "luckypennyblog": "Thank you for being a totally rad human ❤️", "aliciapeat_watson": "So good, I miss seeing your updates in my feed.. which is usually filled with superficial-made-up crap. You are the real stuff, so thank you for that.", "lianke_x": "Thank you, me too and it gives me hope. Hope Is the only thing that keeps everyone going because nothing is certain. 💚", "laceod": "❤️", "jillian.barthold": "You got this 👌🏼💪🏼", "alaynasuber": "I love your honesty. Transition is a bitch but you make it look good.", "vivian9gar": "You inspire me in huge ways!!!", "marissaaross\nVerified": "Verified", "missmoshimoshi": "❤❤❤", "themeganmaes": "You are awesome and strong! Thank you for being you and inspiring a bunch of total strangers like me! ❤️", "novenacarmel": "You do deserve champagne though so HERE JEN! 🥂", "adriennejane": "you’re a force to be reckoned with! also, killer jumpsuit", "steph_angelis": "💖✨", "heyitslucia": "You got this 🙌", "amberinteriors\nVerified": "Verified", "elleeachten": "Me too ❤️", "daniella.southgate": "Beautiful post. Keep on being a bad ass 👏👏👏", "sonnetjames\nVerified": "Verified", "elizabeth_attitudeofgratitude": "You are amazing in your supremely authentic, vulnerable way. Thank you.", "kateoates": "🌈💜💚💙💛❤️🎈💎✨", "lauravalmai": "Yes, love you", "danellreneesmith": "I've said it before, and I'll say it again, YOU 👏🏼 ARE 👏🏼 MY 👏🏼 SPIRIT 👏🏼 ANIMAL!!!!!!!! 🖤", "tayyy_glenn": "SUCH an inspiration! Thanks for keeping it real all the time! Grateful to be tagging along on this journey! 💘✨", "lolaytula": "Inspiring💖", "amyradack": "There may not be a tape to bust through but JEN GOTCH YOU DID IT!", "ro_ci_o": "You’re the best, thank you!", "can.this": "I saw you one morning at Collage Coffee and regret not saying hi. You inspire me endlessly 💕", "lebo.ruth": "❤️", "melinda.marie.c": "Me too ❤️🦄🥂", "cheerfullymade": "Big fan. Big big fan. 🙌❤️", "kellyshewmakeup": "Fuck, you're just the best! Love you... and me too..... ❤️", "carlasirrom": "💙", "viktorijaillustration": "❤️❤️❤️", "mrorlandosoria\nVerified": "Verified", "jenaeweinbrenner": "I’m grateful that you have chosen to share the good and the bad. It has helped and I do find myself saying me too often. I’m here for it all. Thank you", "furiouslydrawncocks": "I think you're dermatologist and therapist have something in common 🙄💝🎈", "crybabycosprincess": "I appreciate you so much!! My therapist recommended that I follow you so I could see someone like me being so open about their struggles and successes and you honestly help so much ❤️❤️❤️🙏🙏", "kristaisms": "You are my hero!!!", "tammygordon": "Love you.", "ohjustjenny": "❤️", "_bloomchickabloom_": "Me too. Meee too... 💕", "post1912": "You are a badass - no apologies needed for that! ❤️", "meganmadrigal": "Queen. 👑", "ditavonmarple": "Hang in there lady we feel you as we've been there & still visit on occasion☺️ big love ❤️", "afashionnerd\nVerified": "Verified", "nomadicnolazcos": "you are just 🤗", "ampersandstudio": "Thanks for your REALNESS! Always! So pissed at that therapist!!!!!!!", "kristamarieclaire": "❤️❤️❤️❤️❤️❤️❤️", "sugardollxo": "WE LOVE YOU JEN!!!! 💗💗💗💗💗", "iammir_": "✨💓✨💓", "jenniferlioy": "❤️", "mrskristen_hughes": "🍬You’re such a treat and I’m so inspired by you! 🍩🍰🍦🍭(Also, I made myself hungry 🤤with all those yummy emojis!)", "emilee_harris_83": "Keep it up!! You’re an amazing inspiration and I look forward to your daily posts & insta stories. 🤗😎😚", "shopryanporter": "👏🏻👏🏻👏🏻❤️❤️❤️#ditto", "luckygirlkelly": "You got this, Jen!!!!❤️❤️❤️❤️", "lynne3232": "I feel like you should talk to a lawyer about that therapist! She can't be allowed to do something like that again! You survived though, congratulations!", "vietfullofrage": "Who is this unethical therapist? S/he should be outed!", "lnmop": "Rock on Jenn. Your kind honesty and openness is what this world needs. And...that jumper!!! 👩‍🚀💫", "clothandtwig": "Thank you for always being real. Cheers to the future 💞", "sleepybrittany": "You're the best Jen!!! We love you !! I'm so excited for your future 💓", "courtneyandthebabes": "Love it and love you! I so relate 💔❤️", "lillyoros": "@jengotch You got it going on. You really are doing it. 💎💎💎", "jasminesarian": "You rock", "alchimisti": "💕💕", "tessrafferty": "💗💗💗💗", "steffaniehalley": "💖💖💖shine on! And thank you for your honesty and humor.", "delaneyanngonzales": "❤️❤️❤️❤️", "lzpencils": "You’re not alone 💕", "theannehodder": "❤️❤️❤️❤️", "pearmama": "Shady ass therapist!!", "katelynaprile": "Yes! I thought once i made my huge change i would also be handed a big fat trophy but instead it was like, \"good job girl but really, we are not going to make this easy for you.\" ❤ U @jengotch 🏆", "aakgrimes": "You go, Jen GoGo!", "leisaleisa": "Every day you blow my mind with your honesty. And cuteness. ❤️❤️😍", "em_henderson\nVerified": "Verified", "carlylouisewoodroff": "Fucking jen gotch, forever. @dreamslikedeserts", "lia_edited": "❤️💕❤️", "louloumh_x": "💕✨💕", "ckunzle_debernal": "WE LOVE YOU JEN GOTCH", "feministgoodsco": "One of my favorite (and least favorite) sayings is “the only constant is change” - thank you for not just talking about the bright and shiny parts.", "sheilagrubb": "My daughter @slaybelles and I always tell each other, “You got this!” Anytime we think we don’t. So, YOU GOT THIS,JEN!", "jessabtame": "I never comment, but this made me incredibly inspired! ❤ to you. You are an amazing woman!", "houseofflamingos": "We ❤️ you Mrs. Kroll!", "elizabethrolf": "God you are one of my favorite people and which makes me feel like such a creep since we’ve never met 🙈 but I can tell you that you 1000% have a table at my dream celebrity dinner.", "rebeccadiy": "You're incredible! 😘🎉", "samae": "Life can be hard. And having some good friends to help you through is the best. You got this. Even without knowing you, I know you do.", "gritandgraceinc": "Get after it! This is an awesome declaration and pretty much sums up what a lot of creatives go through. The highs and lows and feeling both of those fully is what makes this life interesting and worth it. Keep it up!", "ashtonevents": "@elizabethhults : do you follow jen? You should.", "lizziedohertydesigns": "So proud to follow you", "asheraj": "Beautiful and thank you for sharing your raw emotions. Everyone puts a shiny veneer on social media posts but you tell it like it is.", "deannaritta": "You got this, girl! 🏆", "rachelllita": "me too. 💛", "whatth3mel": "👏👏👏", "meaganwarren": "You are ahhhhmazing @jengotch", "tippysunridge": "Crazy to be inspired by a complete stranger, but you manage to do it every time I read your posts. So, thank you @jengotch", "switzart": "@jengotch I love your honestly. You inspire me...not only because you are a successful entrepreneur but because you choose to show the world that we are all human. Thank you.", "mrsdaphotoz": "You are my favorite", "ohmeedofficial": "You are a true form of inspiration! @jengotch 💕", "molls\nVerified": "Verified", "ohjoy\nVerified": "Verified", "beltyc": "Yes yes yes. Thank you.", "thenadiyogini": "The universe is setting you up for something great...be excited...get excited...you got this.", "mydaughterflorence_": "You're so pretty, and I've already learned so much about honesty and you've helped me to be OK with who I am as a person! Keep fighting! You're doing it!", "flaggjl": "You are awesome!", "alex_haines": "\"JEN GOTCH, YOU'LL DO IT!\" 🏁🏃🏼‍♀️", "jessleewalsh": "You are awesome jen!!", "getshagged": "Love it--and you, Jen!!", "leilahkathrynrose": "💘💘KEEP GOING YOU'RE DOING GREAT💘💘", "_beckykimball": "You are an incredible example of endurance and always “standing up”. No matter the circumstance, you are real, raw and that is so encouraging to me to know that we are not alone in depression, anxiety and whatever ails us. I love supporting your company because of what you stand for. Thank you for being a light in this rather dark world.", "distorted_daisies": "This is amazing. You're amazing thank you for sharing your story", "wendyliz79": "You are awesome @jengotch!!! Thank you for sharing your story with us! 💖✨", "kianamichellescott": "💖💖💖", "gunnerandlux": "❤️", "thesylviamallory": "Yes!!! Just be you and embrace every thing about her.", "wrobson": "You are an amazing human being 💛 thank you for inspiring us all. xo. 🏆Jen Gotch - YOU ARE DOING IT.", "kristen.poissant": "You have got this girl!!! 💕", "michellespearnicholson": "You're awesome! ❤️", "isabelladeguzman": "I literally adore you", "bloom.alchemy": "That is full on and so perfectly said! Can relate x", "heeeddaab": "Superwoman💪🏼💪🏼💗", "jennywiecek_": "You're the best @jengotch. Thank you for being you in the most awesome of ways. 💖 I look forward to your posts everyday and wish I knew you in real life!!", "sara_diamond": "💕", "hotdogforreal": "Thank you for sharing so much of yourself with us! Please also keep sharing photos of cute patterned jumpsuits and hair moments and Gertie + Phil content", "sideeyesorceress": "Your honesty is beautiful. I feel like I have had a very similar series of events to yours within the last 16 months. Please don’t ever be ashamed to share.", "kellysaves": "Feels. 💓", "thestyleaesthetic": "You're so amazing 💪🏻", "ziedarling": "You’re a badass and I’m thankful for your openness.", "lauren_522": "😍😍😍", "melissatacobellhines": "Me too", "kaylans": "💯 #thanksforbeingyou", "lisasaridis": "🙌💥⭐️ You DID it. Keep doing it. #METOO", "monicamar9": "You rock! Please keep sharing.", "lindsayloomis": "girl- the more honest truth and real life you put on here, the bigger your cheer squad is gonna get! because 📣 SAME! 📣", "zozhandmade": "You're like my life coach. ✌🏼stick with it !!!", "katehinish": "💕💕💕💕", "aceandjig": "Your honesty is beautiful and a gift to us all ❤️", "hello.scout\nVerified": "Verified", "pantryproducts": "As I often say to myself \"Jen Gotch can do this!\"", "amynicolefloral": "So much heartbreak, with you @jengotch ❤️", "mollymarler": "You are a beautiful fucking LIGHT, @jengotch ! We need this - thank you for using your voice to speak these truths. Because while your stories and experiences are very individual and personal, the themes are so common for many of us… It’s so important that we talk about them, that we share them here, that we keep the realness. 💙🙌🏼✨I am so grateful, and feel so empowered by you. Thank you and we love you!", "champagnelindsay": "I appreciate your transparency so much💖 I find myself at a point in my life where life has been the kindest it's ever been to me and I can't seem to properly enjoy it with out the dark and twisties catching up with me. Jen, your honesty about everything you feel is inspiring and encouraging.", "pcloudpodcast": "Literally yes yes yes to everything 🙌🏼💕", "tarajhaaz": "❤️❤️❤️", "carlyschneider": "you are a tough cookie...your courage, tenacity and funkiness should always be celebrated ! 🌈⭐️😍", "kkc_falcon": "You be you", "rachael_victoria": "@jengotch I keep looking for the tape to breakthrough at the finish line too...You truly have been a great sense strength and honesty. ❤️", "lgzzyy": "You’re fuckin awesome!!! 💗💛🎉", "helenswines\nVerified": "Verified", "laurenlapkus\nVerified": "Verified", "jeanne_bot": "😘 love me some Jen Gotch!", "ben.pame": "You're the best!", "hannyexplainsitall": "💕 ❤️💕", "leightobiasen": "LOVE U JEN GOTCH!", "katdunnwilliams": "Love this. Jen Gotch, you're DOING it.", "martaesri": "You go girl! 💖💖💪💪", "withlovefromding": "You’re my hero. Love watching you thrive! Go. Girl.", "msbiffar": "❤️", "ruthyaro": "❤️", "siouxsey": "I don't know you, but I love you 😍", "lizz_robinson": "Me, too. 🍾🏆 JEN GOTCH, you haven't done it but YOU'RE DOING IT. And that's even better. We love you.", "erbrop": "❤️", "romeroymiel": "You are so AMAZING! I don’t know you (personally), but I am ALWAYS cheering you on!!! You can do it! 💪🏼 xoxo, your forever follower, Elisa.", "beatrixblue": "We love you!! 😘😘😘", "tarajanebrown": "Love you 😘😘😘😘😘", "mimibaileyny": "You are awesome. And someone so worth loving. And someone who is loved. By me. By many. Keep going Jen. 😚💕💖💛", "jennyeveryday": "✨💖✨", "jennycantsitstill": "♥️🙌🏼♥️", "melissafromspace": "Wow. Your therapist is a bitch.", "tinacox16": "⭐️🙌🏻👏🏻🙌🏻⭐️", "shehasrhythm": "💕🌷❤️🌸", "gypsyjaimes": "Same same same. ❤️", "agbrott": "👏👏💪", "tstarrstar": "💖", "loverlypaula": "I feel you. Thank you. ❤", "cazhayes": "You’re a wonderful human ❤️", "bobbyhundreds\nVerified": "Verified", "chey2xo": "❤️❤️❤️", "qnbee328": "Idk you, but you’re a fucking lioness 🦁💕", "alyssainthecity\nVerified": "Verified", "drapeydrape": "❤️❤️❤️❤️❤️❤️❤️❤️", "neysameows": "You’re my inspo ✨😸👌🏻", "christinaebohn": "❤️", "aabbiiggaaiilll": "yes Jen Gotch you rock", "quinnesowell": "You're the best and I wish I knew you in real life", "calliopepaperie": "No amount of accomplishments can soften the sting of loneliness. Don’t ever let anyone heap guilt on you for feeling the way you do. You are loved.", "emilymarcie": "🙌🏻🙌🏻🙌🏻🙌🏻", "allisonmadi78": "Love you!! You’re amazing.", "samanthagerardwoods": "thank you. ❤️", "jordynburne": "YOU ARE THE FUCKING BEST JEN GOTCH - WE’VE GOT THIS!!!", "itstteoe": "I LOVE YOU!", "thewanderingbohemian": "Me, too!", "autumnempire": "💪🏾✊🏾🙌🏾", "michellearmas007": "Sending a big fat hug. Fuck that therapist!"}