{"jessabito": "❤️", "spiltmilkvan": "Fuck yes. Thank you for your honesty, vulnerability, and human-ness 💛💛💛💛", "lau_belcher": "Thank for bearing and sharing 💛", "questntheanswr": "Thank you for this. I’m dealing with the shittiest week of my life and I truly appreciate your words in this post. ❤️❤️❤️", "itsmybeautifulplace": "❤", "olivtrees": "@coloradoconnor", "megpappalardo": "@aleefwillis please follow this angel", "sarahzeeshan14266": "@jengotch Psychiatry fascinates me the most as as med student . I agree depression is inevitable and you don’t see it coming at all. I am glad you have the guts to put it up on this page . We are in this together!!", "jo_lynn3131": "@rdopm", "riribex": "@jenfreymond", "mdirge": "Needed today. Thank you", "masmavi": "❤️", "smith6876": "I'm so with you on this I too have a mental illness and am so lonely all the time trying to just get by. At the end of the day though id rather be lonely than abused.", "shakedisraeli": "💜🙏thank you", "imindiankthx": "@willkromschroeder 💛", "lovabilityinc": "So so grateful for your vulnerability. It means more than you know.", "paigehaines_": "Thank you so much for continually sharing your battles with mental illness. As someone who suffers pretty severely, I want to say you are such an inspiration to MANY people. Keep pushing. Keep being resilient. Keep being you!! 💓💓", "wanderingfeminist": "💖💖💖 thank you 💕", "yarahairstudio": "Thank you for writing this post🙏🏼", "alexiskersey": "Wow. Wow.", "soniapserranos": "Wow! I can so relate. Thank you 🙏 for posting your story.", "lizannebee": "Really fucking needed this. Depression is really fucking lonely", "brook_54": "@miloewinn ah, yes. I like her. Thank you for telling me about her. ❤️", "thisishopemarie": "where have you and your honesty been all my life?! you just summed up my very raw and real truth."}