{"meg_sinha": "Your handwriting is eerily similar to mine.", "uttkarshaofficial": "Thanks for the crash course.. I didn't realize I needed it ❤️", "kunalb11\nVerified": "Verified", "payal_bathija": "Damn, putting me through a lot of thought processing!", "ssmehrotra": "For sure. Hope and anxiety belong to the same place: the imaginary future. They spring from the same need: the need for safety, away from uncertainty.", "ruchi_c77": "This is so right and found me in such a great time.@regajha", "__textualtension__": "muje anxiety aati hai bas, acceptance to dooor ki behen bhi nahi hai", "pk3544": "Anxiety increases as your faith/confidence in what you are hoping for decreases. More then a Venn diagram I think a 3d graph with hope, anxiety and likelihood as the axis would be an interesting and potentially accurate representation", "shethk": "Your handwriting is super awesome.", "jobohobo": "Hope and anxiety are like the twin sisters from the film dushman. One will avenge the death of another. Thanks.", "aishahd_writer": "As a consistent recipient of both, to me \"Hope is achieve when reasoning & faith overcome anxiety. As where one distorts, the other reforms\" 😇💗💐🤲", "oindrika": "You never fail to inspire😍", "kanishk670": "If there is no hope it will still lead to the same future then?", "shreeja_rajan": "@storiesthroughmyeyes this is good 💕", "yuktie": "Hi Rega, beautifully depicted. Comfortable acceptance of uncertainty would imply a level of detachment from all things we hold dear, right?", "farwanaqvi_": "I’m going live tomorrow on Sunday 10pm with a therapist to discuss your mental health difficulties at such times. Do join in and ask!", "_hitmeuphere": "@regajha sisters, constantly having a strangely unpleasant threesome with me, all the time.", "thoughtsways": "You stroke on right place. True, there are times when our expectations lead us to the path of anxiety.@regajha", "betstg": "Thank you.", "kvjustwantsfootballtobeback": "Waiting for an online course on this", "devesh0303": "have to agree. Best to refrain from imagining future outcomes in the first place, but is that psychologically even possible?", "ridhiasrani": "Opposite of fear is just simple faith. It’s only when we’re scared and fear that we postpone all of life’s major decisions and hence actions. Actions to a cleaner world, a cleaner diet, a reset to your physical health, a recharge to your emotional batteries, a reflection of all that keeps causing you anxieties and why they crop up in the first place. We’re being forced to shut the external and the outside to go within to hunt down the faith - the faith in a higher power working for us, with us. In some twisted, fated, magical and mysterious way. To only bring a new, a new wave or a new world order. To renew our very selves so we can renew all that is around us and was so long ignored. It takes a tragedy of this scale to reinforce human connection. We are forced to be off grid so we value what true human intimacy is and don’t take it for granted. That hug, that kiss or that random strangers gesture. When we truly truly truly believe that the higher power is all there is to everything and that we are insane to hustle in this capitalist fatalistic world which only breeds on consumerism - can we fix it. Faith in the higher power to help us find our inner compass while we stay lost until the sun is up again.", "naziya_khan": "Best thing that I have ready today. Thank you for this. I so needed this..", "sujata.17": "Hope is the elder one that latter takes care of the younger one that's anxiety! 🌼", "apoorvclicks": "Hope and anxiety are sisters and they're currently quarantined together and they're messing with each other everyday! Today is for anxiety, around 5-6PM the light will be better, there will be breeze and birds will chirp and hope will wake up from her nap!", "kinita.s": "Are you drinking buddies with my therapist because he told me the same thing 😂", "6nidds9": "We are usually in a state of transition between the two, but that is necessary or else how will we arrive at the sweet spot of comfortable acceptance of uncertainty. That transition is affected (& taken advantage of) by media.", "invisible_trooper": "Conjoined twins actually. Good point @regajha", "riddhimane": "@lavanyam you're hope. I'm anxiety.", "anuraagbhavaraju": "@reddy_chandrika comforable acceptance of uncertainity", "rbfashionstylist": "Love this - so appropriate and relatable💕", "cpt_lanthanide": "An intersection of a best and worst scenario would imply there is...one scenario? Scenarios that one is indifferent between in terms of outcome?", "liveinacosmos": "Hope and anxiety both keep us busy worrying about the future and we forget that future doesn't even exist yet, all we have is the present moment, the now.", "tishitaaa": "They steal each other’s dress and trick people into believing that they are the other one.", "christie.maria91": "How do you do this? How are you this clear in your head?", "priyoritized": "this is us. this post is a (literal) literal marriage of randall and beth pearson. ✨ thx for this.", "nainithaker95": "@ankit_mittal_218", "gursimran152": "What pretty handwriting", "vasundhra_dahiya": "Sisters who like the same guy who goes by the name 'Control'.", "_frobscottled_": "Somehow reading that they're sisters is a comforting thought. I've been journalling a lot as a way to be fine in the present. Resonate with this post a lot. Thank you! ♥️", "the_16thletter": "❤️", "rajjjshah": "attac", "tanmaybhat\nVerified": "Verified", "hiralsatraa": "@snigdha_bansal", "aakashtuli": "I'd even say they're different sides of the same coin. When you hope for something you automatically become anxious about things not going the way you hoped. It's only the intensity that decides what you call it", "_diyaghosh": "I think the ends of the spectrum are anticipation and apprehension, both products of us attempting to forecast the theres we cannot control. Somewhere in the middle is the neutral state of unknowing, achieved best by (albeit with difficulty) by being fully present in the here?", "heart_hippie": "Explains so much that couldn't be articulated👍 💯 Like the way you write!", "thisisdriz": "Something that really helped me in the beginning of my therapy journey : the understanding of good and bad stress. My therapist drew out a bell curve, the first rising half being the \"good stress\" That often comes along with hope, excitement about the future / the unknown. And then you hit a point after which the anxiety of the same unknown takes over and drives things downhill. It really made me cognizant of how all good things in my life are potentially anxiety inducing, and that's why I'm scared to put myself out there or do new and challenging things. But it also reminded me to embrace \"good stress\", use it to my advantage, and distinguish it from my anxiety. I check in with myself constantly about which side of the curve I'm on. Hope this helps somone!", "_moonchild._": "Never looked at it this way, but hell! It's true!", "_ladyportrait_": "Yes, they are like twisted sisters. They come with one another and i guess can never be apart.", "_crazywomaniya_": "Sisters like Phoebe and Ursulla!!", "radhika_harlalka": "✨✨✨"}