{"its_alicia": "Beautiful Rega. Sending lots of love 💖", "rebeccaharrietedwin": "♥️💜", "mayankbisht24": "So wholesome !!!", "sricharita": "So wonderful 🔥", "kiran.aruna": "So beautifully written. It perfectly captures the turmoil i've been experiencing for the past few days.", "akshinwirathu": "Buzzfeed became toxic because of you", "sushmita_arora": "This is beautifully written. ✨", "suhailmirza7": "@iyer_k", "pandyashalini": "🎯unfortunate realities of present times.....", "jadoo.magic": "I just loved it.. Especially the part where you wrote about of breach of contentment.. So deep yet so true. I cud relate to my feelings. Reading you for first time n in love 😍 😍 😍 stay safe", "nishael": "❤️", "sakshilife": "Masterpiece❤️", "thebrogue2nowhere": "Such beautiful words - thank you 🙏🏻", "sprousespouse1": "Thank you for this! :')", "themayukhsutra": "Thank you for this.", "vanikapoor97": "Beautiful.", "thewanderingaffair": "Wow!", "sharinb": "Rega .... Le Sigh 🤗🤗🤗🤗", "subtlykiwi": "Oh my goodnesss ❤️❤️❤️❤️❤️", "shrav1012": "I wholeheartedly agree.", "shraddha.19": "@shravyakolavara Read this too!!♥️", "travelshenoynigans": "@etichordia and this", "nayantarakansal": "@tanvee.nandan, I thought of this post after reading your recent post on facebook about privilege and the ‘right’ to feel anxious/distressed in the current pandemic. Thought it was a helpful alternative way to think of things- articulated really well by Rega!", "sjraheja": "@emma_grubb", "ash46002": "You are truly gifted and gift to the readers🙏Thank you for writing and sharing this piece of beauty❤️", "mariabhatti24": "@samrakb", "sweta_priya": "Thankyou for writing this! ❤️❤️", "sonalikher": "This is amazingly jotted down💙 Kudos!", "oeesheek": "This is beautiful, thank you for this ❤️", "saminders": "Wow @regajha such beautifully written piece. Very intriguing and very interesting. Keep shining..!!", "the_bitch_aari": "Thank you for this. Came in at the right time. This is everything my mindspace was wanting to receive and this is something I was supposed to read and understand ! With everything happening around ! 💜", "vamsi.1113": "I didn't know how I once thought when I first saw this girl and thought, I would get her if I make the right moves, if I plan everything carefully, I didn't think I would even need luck, I mean she wasn't too beautiful, not out of my league atleast. Here don't get me wrong, I was raised like this, by the society that we are in, but I promise you guys, who are reading this so patiently, that Ill not let this or any such ideology of GETting a girl pass to my kids or friend. But good, in fact best, were those days when I had a inner conscience supporting me, encouraging me, to do anything I like anything I wanted. I wanted many things younger, but now I just feel like, I don't even deserve half the shit I have, none of the shit I aspire to be, and that I don't even now deserve any dream. But good were those days when I wished for a girl. When I had a secret crush over all those girls, the girl I saw in a bakery when I'm getting my fav chocolates, the girl I saw in a trip, and that girl I so senselessly flirted with everyday, and this girl, I saw, when she was speaking infront of thousands sharing stories, her own, may be lies, but embarrassing, so brave, I can't do that, for that matter I couldn't even speak up my love for those girls in my life, pity me, for I wished, having a crush on this girl, and for posting my feelings in a random insta comment.", "gautami_kaur": "Wow! This is the best I've read on the topic so far. 👏👏", "tranquil_dreamz": "❤️", "12mp_me": "Thank you for this!", "ankushbahuguna\nVerified": "Verified", "kaustubhverma27": "@shara.madan @kanikashukla", "__jyotijha__": "❤️❤️❤️❤️❤️", "shrutikumari221": "Its so good that i forget to count the pages...just read and read and read❤️", "kuz.khan": "@rafalnakhwa", "justjayant": ".", "saharparmarr": "I think you’re beautifully presented everything I was feeling, so thank you and more power to you 🌸🌼", "ambiliciouss": "Thank you for writing this Rega @regajha 🌹", "bob_almost": "This just made my day. Thank you ❤️", "smita24patil": "❤️❤️❤️", "chandini_ashwath": "Oh my God!! This makes me feel so much better in taking the things that are happening around us! Thank you 😊", "debsterr": "Oh, you. This is heartbreaking yet so real and beautiful. ♥️", "bebaakkhanabadosh": "Thank you❤️", "poojaa.tripathii": "This dilemma of living our lives a little bit everyday and then this ❤️", "stutiashokgupta": "This scrubbed and stirred parts of me I didn’t know were disturbing me. So beautifully written. So painstakingly honest, too.", "zunailimalik": "Beautifully written ♥️", "delusionalwallflower": "@_.asmitaa._ @shreshahahehe this is beautiful.", "sonalig11": "Thank you for these words", "aditya_desai_": "@the.neha.mahesh", "nomsitaharitashya": "🥺", "hanisha212": "So well written.. had goosebumps ❤️ thanks for putting it down💞", "maemariyam": "That was so beautifully put. Thank you Rega. For bringing a semblance of lucidity in these hazy times.", "ghostatmidnight": "@womaninanattic @hindolee @catlick_toothfuss", "rebarkd": "@regajha just saw your Spoken fest piece. Dude really those words were like hope to every grey heart that only knew white", "vaibhikasuhalka": "Oh I Felt ‘Apocalyptic’ !!! Loved every word. 🖤", "gamineerathod": "❤️❤️❤️", "antariksh__17": "thanks for explaining us, to us", "bhavishii": "Thank you for writing this...❤️", "__whatchamacallit__": "Does your soul has a pen and paper?💖", "_gejji": "@shuchikotharistory 😭❤️", "anu_joly": "Best thing I have read in a while. The language. Wow! The sentiment ! Beautiful ♥️", "spreefirit": "“Try to piece together a new shape of normal” why you do dis Rega", "majidmuneer": "What a post!", "oofersshmoofers": "“ and in defiance you make your tea like you always do” made me cry a little bit. Maybe.", "sonireena": "@regajha This both hurt and healed. Thank you for the honesty of your writing. ❤️", "pavithradikshit": "Brilliant", "insta.ruch": "Beautifully written, thanks for sharing this", "khayalii_pulao": "I believe this will help me in many ways. I will refer to this to make some sense of the feelings and emotions that I am going through in the present situation. Thank you @regajha for this piece and also for your piece at the @spokenfest . ❤️", "sreeniza": "There’s something so calming about the way you write what you write. More of a Catharsis. ♥️ Love to you and your world, Rega.", "neeraj.haridas": "Beautifully written. Thank you @regajha ❤️", "monamadhu": "This is soul stirring💟", "instapatil": "Beautiful regha.....aptly expressed what I've been feeling for a while now", "simranwashere": "World is a little better place with this writing piece here, I promise. :')❤️", "charu.gaur": "Rega, this spoke to me so much and so beautifully.", "shikhasafaya": "@awaari_raahi @nishikab5294 this is so beautifully written", "thebigbhookad\nVerified": "Verified", "tealandyellows": ":')", "dhananjay.bhardwaj": "Mind blowing 🙌", "yuktaa.argh": "Oh rega, you beauty. I’ve fallen in love with this piece💛", "an_inbetweener": "So distilled. So clear. Thank you ❤️", "musiqill_": "Thank you for sharing this and shining light on so many feelings and thoughts🙏🏽", "_mayuri_panchal": "This is so beautiful put @regajha. I was Calming my inner storm swiping .. thankyou for your words 💛", "bismaraina": "This is sooo beautiful❤️", "tanushree_lbs": "Beautifully woven together! It was a pleasure to read this! 👌🏼👌🏼", "stormchase143": "This is so beautiful. I'm just like ... That's all.", "dineshdodeja": "@regajha u r an aspiring writer, stop posting stuffs which shows negativity...people are aware, you are just adding as FYI...no need", "preethikagidiya": "@kaustubhverma27 @kaustubhr", "ritikamajji": "Wow....I’m awestruck with your column. Extremely well put @regajha ❤️👏🏻", "susanafe": "Beautiful Rega 🤍", "vanshi2595": "❤️", "mahimaa98": "@tamalikab30", "aditi.dhopesh": "can you publish a book already?😠 please?🥺", "asthasingh97": "@regajha beautifully written. Thank you for penning it down. 🤗", "tejashree.ds": "Rega, thank you for this. I needed this today.", "parvathy_sankar": "Omg!!There’s no better way to put my heart out!u just penned my heart out!♥️♥️♥️", "avanthxka": "This is exquisite, to put it in one word. Thank you for this.", "gypsywaali": "@kaafi_uncool", "_dhwani.shah": "This gave me goosebumps Rega😭So beautifully written! Your words and your writing style have been a big inspiration @regajha", "chadhatapsi": "❤️❤️", "movewithami": "Thank you for existing and being here today, so I could read this and feel all the feels ❤️", "4shish.b": "Very beautifully you have managed to knit these words into this powerful piece of writing that somehow is able to convey the varied emotions that almost everyone across this planet is going through. I wish I was half as good as you. Continue being an inspiration! 🥀", "j.nil_": "I literally can't get enough from you @regajha Your writing is ❤️ and made me feel lighter.🙌", "abantikabhuti": "@_kkabita", "itsshaniaaaa": "❤️❤️❤️❤️", "aanchal_d_p": "You make my day Rega!", "thatgirlwithshorthair": "💜💜💜💜", "miss.chanandlar.bong": "Beautiful 😭❤️", "diaryofsanj": "This is so nice :’) thanks for sharing w me baby @niharikagotety", "kelseahabecker": "💙💙💙", "sidswamyy": "@mahimarana29", "priyoritized": "♥️♥️♥️", "anyahkutty": "So so so wholesome! Thank you🌸", "tanyarai22": "I cried reading this. Beautifully put.❤️", "could.be.human": "l", "anvikabajpai": "This is absolutely beautiful! Resonated right here💓", "anpatha": "Oh, thank you. Well done. ♥️", "theshahlife": "@sophieleebee ❤️", "explicitlynakul": "This is so beautiful written. No write has touched so much to me about this topic as this as❤️ keep inspiring people. Lots of love and power❤️", "sidnem_noer": "This is written so beautifully!!", "pranjalimorchhale": "Thank you for this ❤️ Words heal hearts", "cchandrima": "❤️😍", "miroo286": "💖💖💖", "expressionexpressos": "You managed to perfectly pen down what most of us are or should be feeling, because there's no right way to feel right now..Thank you so much ♥️", "niharikakh": "Just shared as highly recommended Sunday reading - it has all the feels and some more! Thanks for your heartfelt writing @regajha ❣️", "sanika_215": "@regajha you're a magician. Thank you for writing this ❤️", "rshbhgupta": "@aish_bist", "radchandra": "Beautifully written!", "jyotirana777": "Love ❤️", "_pallavis25": "Thanks for this.", "fareehakhtar": "Thank you for this Rega. Today has been horrible. This gave me the tiniest bit of strength I needed to get through today. ❤️", "mr.ahk_1811": "An excellent thing I read today🔥❤️", "annu_m": "@mstillyj 💜", "prateekrc": "Articulated what I was thinking! Thank You 🌸", "snigdha.samal": "🖤", "_.unnati": "All love , Rega Jha. Always all love ❤️", "_alisha_jadhav": "So beautifully written ,all emotions put so aptly into words!! Thank you❤️", "botched_attempts": "Doomscrolling so so true & so brilliantly written !!", "notsoshabbyshop": "❤️❤️❤️", "deeptisunder": "This is wonderful. So many of our common thoughts as humanity at this time expressed so beautifully! ❤️", "labani.biswas": "this is so so beautiful 💓", "missgopal": "@beingswetta", "swapnil_bhattacharya": "This is so beautiful! The calmness I’ve felt reading this in this world of chaos...kudos! ♥️", "cokepiya": "Write a book already 👏👏👏👏", "jusharma": "@rshbhgupta", "ghauvas": "I love how in the middle of the article she cares to remind us to breathe and relax our muscles 🙌🏻🙌🏻", "aasthaa_sharma": "@apoorva_48 @mahimaa98", "hiralzee": "@rachithegde", "sakina.dohadwala": "So, so beautifully written. Much love💕", "dsmkr78107810": "💝", "sristi_qe": "💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟💟Idk how many is too many", "yeshaaaa.08": "Thankyou for this! So beautifully written.❤️❤️🙌", "shankhan": "So good 🙌♥️", "athi_unni": "This so beautifully written !❤️", "blackbindibandit": "Beyond beautiful💚", "jeetdagha": "🙌❤💯", "vaniiiika": "Made my day. Thank you! 🥺♥️", "overrated_outcast": "Gosh! You weave magic with words. So well written 🙌", "realsidt": "this is so wonderful Rega. Thank you, I really needed it!", "sinkjoshi": "WOWOWOWOW", "rakshit_nair": "\"Give easily. Give often\" beautifully written❤️", "niharika_karumbaiah": "Beautifully written! 💌🙌", "shredder45": "Beautiful❤️", "shangkrithya": "🤗 My Beauty! .. also my love to you.🌸", "oorvss": "It feels like whatever I've been thinking in my mind has gotten proper words and has been said out loud. It's perfect.", "ramritika": "'You mourn in big ways, you ground yourself with little things..'🎈", "nogdctx": "i love for such writings", "rashee_parganiha": "Nice💓", "elizabethgromet": "This is beautifully written Rega. Made me feel a little more whole in the midst of so much tragedy. ❤️", "vishantkothari": "This is so complete. Thank you!", "d1pakjha": "Clean slate", "shahnoorsiddiqui_ss": "Love this❤️", "meowish.ali.q": "On my mind for so long now. This helped 🌼. Thank you 🤍", "areypoonia": "You’re helping people! Thanks. ♥️", "a_losthome": "Rega 💙", "shivvam95": "@regajha so well put 😍❤️", "niakumar": "This is by far one of the most beautiful thing I have read. 💜", "neelam.s": "❤️", "prateekdv": "@bangalee_as_bro and @ahilandro - this is so good!", "spontaneous_baba": "My god before I read this today felt like I was gonna go insane thank you @regajha for keeping me and everyone else who reads sane.", "blissful_day": "Thank you, this is such a touching and honest piece. A great reminder!🙌✨", "kanchii_": "That was too true. Beautiful yet heartbreaking. Thank you for writing what we feel and succeeding always❤️❤️", "divyanshhiipandey": "❤️", "kunaljain23_": "❤️🔥", "saieieie": "Thank you for this, Rega❤", "subixt": "♥️♥️♥️", "poojadhingra\nVerified": "Verified", "vasundhra_dahiya": "Couldn't have said better myself. Felt it deeply (and anxiously) word by word.", "natasha__tc": "@shiksha.sridhar", "bubbleblabberblubber": "@mad_mohan", "sed_d_mathews": "Thank you for this Rega..This felt like a warm hug reaching out virtually, 💗😭", "sir__rajeev": "I haven't read anything this beautiful on any social media before. The pause you gave was surreal.", "sukanyajanardhanan": "I love you so much, Rega! Thank you for this. For the last four months, I've not posted happy things on my main instagram account - I CREATED a finsta because the world was burning - it felt too unfair. Too many people had messaged me saying that they looked to my stories/posts for news and updates and protest-related thoughts; to process. It felt unfair, it still does, to post about a friend getting me some gajar-ka-halwa or my mother standing up for me, or about having dressed up in a pretty saree just because. But I have to. To sustain. Because this isn't new, it's just more visible. @sspublicdomain once told me that \"hopelessness is a new feeling to us\" and my professor then suplimented it with \"yes, only to us, not to a lot of the world\" and it's living with this reality that we're challenged. Thank you for writing through this and for letting me think and write through this.", "sar.rahk": "My exact feelings put into words! So well written 💯❤️", "cyber.saki.7": "@3shhhhhhh_014 read it patiently.... U will love it", "sunshine_kiran": "What a beautiful piece! You have described what we feel but don’t have words for !! 👏🏻👏🏻😍", "payal_bathija": "Damn💕", "prachi_mehra01": "😭Put so well into words", "shayan_san": "🥺🥺🥺♥️ I am at peace after reading this. You're a fab writer. Stay safe, stay strong.", "sajnanisuman": "Yaar ye kya jaadu hai, idhar kaise highlight karu quotes❤️", "sajid._.balty": "Most of it written on Biased assumptions, you need to correct some of the preposterous accusations.", "neelcant_": "THIS IS GOLD. THANK YOU.🙌", "smokey.kokila": "@regajha so well written! 👏🏾👏🏾💕", "krupaa29": "Thank you for writing this!!", "pcube_art": "🖤🖤🖤🖤🖤🖤", "j_jey_m": "@laybaali2000 this is so well written :)", "simpy_harwani": "This comes out in the most appropriate time. I saw some people have started talking about how we are sharing our happy work from home pictures, our binge watching stories, video calls, happy times at a time when so many people are dying. One person wrote, \"when someone dies in our family, we mourn, we don't feel like going about our life happily. This world is our family, how are we not mourning? \" I am going to share this piece with that person, hoping they are able to find some solace. Thank you for writing continuing to write, thank you for choosing to write. ❤️❤️", "nanditamenon": "This is lovely, thank you :)", "_pripatil": "So well written.. really hit the right chords!! ❤️", "papyrus_pennings": "Everything i m going through, thank you for putting it this way..i feel hugely relieved but maybe not. If only you know how it feels. :)", "priyankabhatia__": "In defiance, you make your tea how you've always made your tea. This column is so beautiful @regajha . It's breaking my heart but somehow also comforting me. Thank you for writing this💜", "hkharleenkaur": "Everything I needed to hear.❤️", "bunty.chellani": "This is beautifully written!", "sukritidutta11": "I think I cried a little. (´;︵;`) ( ◜‿◝ )♡", "bunny.thedesiscribe": "How do i like this multiple times", "sushmita.singh95": "@regajha you break my heart and then put it back together in the same article ❤️", "ashlesharastogi": "♥️", "richa.patiyal": "@shivanee_patiyal @dakshika.chauhan absolutely love her for writing this 😭", "abhishek_harwani": "@simpy_harwani Dude, thanks a lot for introducing me to this amazing person/genius/writer 💯", "misskuchu": "I really thought I was the only one who felt/thought these things :( Thank you @regajha. This was lovely 💕 @themandster88 please read.", "pk3544": "Nicely said! Good summary of the good the bad and the ugly. I wish the main stream media had more hopeful coverage. Thank you for posting!", "mel_isha7": "@damsel.in.a.doodle read this", "namratha__": "@anan_yeah 😪", "yashmjain__": "@chauhan.solo \"I worry someday that I have grown numb to bad news\"", "sudipmaji7": "Thank you, @regajha !", "preeyum": "@suraj_ashoka", "pratiksha_mohanty": "Don't really know what to feel :) its achingly beautiful ❤️", "magic_quill": "Soothing💛", "siddhinargolkar": "\"everything about everything changes, and in defiance you make your tea how youve always made you tea\" I'll never forget this.", "the_darkphoenix_": "This is so beautifully written. Feels achingly real too. Thank you for your words.", "mo_alabi": "Pure art. 🙏🏿", "tenthousandfathomsx": "Your words strike a chord each time I read something that you’ve strung together. They smell of life! 🌸 Love x", "aarushichauhan": "@maham.hsn", "awkward_personified": "Omg thank you so much for this. You have my ❤ forever.", "antara246": "Thank you for this. I just cried reading this 😭❤️ (and crying sucks rn bcos I can't even wipe away my tears without sanitizing my hands first). But this is hauntingly beautiful ❤️", "vaishalisarathy": "♥️ exactly what we needed to read!", "thayirsadham": "“And if being joyous while others suffer is unethical, them your every moment of contentment has been a breach - always, someone else has been in great pain. Only now, we know it. “  I’m going to frame these lines in my room. Beautiful! :’) ♥️", "patil.anushkaa": "thanks Rega♥", "kanishk670": "knowing now, so do we need pandemic to get best of us humans?", "shreyashi_j": "♥️", "poojassahni": "This is as beautiful as it gets. You have a way with words, Rega. Thank you for penning what millions of people are feeling, so aptly 💜", "_oldhappytree": "🌼🌼🌼🌼❤️❤️❤️❤️❤️", "bhooomikaa": "Oh my!❤️😭", "pinkijha98": "Words of wisdom ❤️", "smitasaysso": "Thank you for so beautifully encapsulating these times🙏🤗", "sarina.priya": "@annamalkiew", "radhika_shah": "Needed to read this today @regajha! ❤️", "daaktrananth": "Thank you for this.", "rythmsometimes": "So beautiful brb crying❤️😭", "zainabsariya": "Thank you for this! Your feed/ writing inspired me so much!", "nandini_19_": "What are you! 😭", "bombdotttcom": "👌👌👌", "gargya_avantika": "@shivika_goyal_ that opening is sooo bomb, read the whole thing ofc , she so good mehn", "rishabagnihotri": "@an.kita read it with mom so that way all 3 of us can become sane. Dad we'll deal with separately. 😂", "shagun.parashar": "This was heart touching, and an amazing reminder of how humble we need to be in these times, when little to nothing is in our control!", "eishachopra\nVerified": "Verified", "devangana_mishra": "This felt like the most sublime guided mediation ❤️", "aishwaryavaradharajan": "@arora_kavya @saa.scribe @sanchdash @stella19george @shre_sharmaa @pcaleb177 @apurvasng @nikits11 @17.pri @viveka259", "x.saloni.x": "It simply summons all my thoughs, so well put. Thankyou💜✨", "shreya_abhang": "This really helped me reach the acceptance stage of this distress, thankyou for this ✨", "shreyabhootda": "Wow! ❤️❤️", "sevitha_v": "This is so well put. Thank you for everything you write and for everything you are. Much love. 🌸❤️", "aryapaar": "@roshni.07", "gogoi_krishna": "\"you mourn in big ways, you ground yourself with little things \" 🙏❤️", "shriyakrishnan_": "Such a beautiful piece! Thnakyou for writing this💞", "pranitart": "I cried reading this. Thank you Rega, you have the ability to reach deep within & stir the discomfort, which is really so comforting ❤️", "average_antinational": "👏🏿", "b_sanskriti": "@regajha thank you so much for writing this. It sums up all the emotions! 🤞", "aditya_tss": "Respect", "varshinirajasekhar": "Much needed💕 thank you Rega. I adore you too much!", "oceandeepoasis": "@regajha You are a beautiful writer. Thankyou for writing in perfect words the thoughts of so many. Love you❤️", "fatemasoyatwala": "I definitely needed this today. Thank you for always writing so honestly.", "kaneezsurka\nVerified": "Verified", "khushbubalsara": "You beautiful human. I adore you A LOT REGAAAA 😭❤️", "inspiredbuds": "♥️♥️", "noyonika": "This captures so much of what everyone – who constantly has that constant underlying emotion of dread – is going through.", "kingslayersushan": "This is so beautifully written .you really hit it home with what many are feeling right now", "komal_ambati": "@zahiyanayeem Read. Read. Read. She's my favourite for a reason.", "vidushisingh15": "Thanks for writing the way you do", "appleonthetree": "Suffering is random as Camus said. We wait for when it will be our turn, in some form, some day. Maybe tomorrow, till then we live the moment. Sing the song", "aritreeh": "This touched me somewhere deep inside. As if seeing my own face that I have been avoiding. Havent read a piece so honest yet so akin to what I feel since this madness started. I don't you Rega, but thank you 🌸", "priyankapatel87": "This is beautiful and heartbreaking at the same time! Thank you for the words! Thank you for the reality check. And thank you for not making me feel like I'm the only one thinking this way! Stay safe, stay blessed! 💫", "aahanamulla": "Love and heartbreak through the spectrum of all of the uncertainty! So well written 👏🏼❤️ @regajha", "anwesha_mishra": "Thank you for writing this :’)"}