{"margaretbowling": "Just be patient. Keep upholstering. When the inspiration comes it’ll hit you like a steam train and there’ll be nowhere else to go.", "harshitvijaivargiya": "Learned the word \"reupholster\"", "themooopoint": "Was about to finallyyy re-edit something after ages. Ill let my life remain then. #failedwriter=happylife?", "the_sassy_libran": "My lord. Why do i relate to this in spiritual level?! 🙆", "ikkudiabc": "Hi. Please read my dms. It's about all about love and maybe some things you may not have noticed or perceived while reading the book", "maliniagarwal\nVerified": "Verified", "anjamandala": "Totally real!", "ojohhey": "But like obviously don’t", "life.of.jigyasa": "When ever i try to write i get empty", "quillkaariwali": "Story of my life - written with such accuracy! You already ARE a writer 🙂", "tanyachopra8": "And write a Kickass Instagram post🔥", "shivaanibaghel": "Breathe. Breathe often✨ meditate and intend that you only channel the most authentic truth!", "pankulpankul": "You have written such a lovely posts on being a writer.", "nikeeetapikeeta": "@apoorvashiv", "meg_o.0": "Never fuckin RELATED any post so much!", "sonaligups": "I felt this tonight. Truer words were never captioned.", "thatgirlinmuddyboots": "This is so damn true.", "shradha2202": "Relate 101% 🙈", "rekhapathak862": "The capture is marvelous", "ibarthwal": "@bansrigosalia 💕", "the_curly_chaivinist": "Oh gosh😭❤️", "itz_tmoney": "Hello", "manojkumarkumar03230": "❤️", "shreshiii": "Haha, I was reading an article on how to become a writer by nytimes yesterday where a bunch of their writers shared their writing tips - one of them said, “Write and don’t ruminate”, I lost all hopes of becoming a writer then and there. Got it back with this post. Nobody. Nobody could encapsulate the process better than you just did. I am done doing everything on this list. @shrutikarao I am done with the yoga teachers training too. What should I do now? I’ll just go take a walk to clear my head, may even get some ice cream.", "zainabsariya": "This is the most relatable thing I read today!", "apoorvclicks": "This is the most relatable piece of content on Instagram FOREVER! #sigh", "just4meemes": "👏👏👏👏👏👏👏👏👏👏", "ayushikroy": "I C O N", "pranitart": "*waits patiently for your book* no pressure 🤭", "tarinipeshawaria": "Read caption @gayatris.gourmet @varalikasrivastava01", "sohinibardhan": "I think you should just collate your instagtam pictures and captions into a book. It'll be a great life lesson book or idk a book on how to be a better person in a shady world: Rega speaks.", "eishitaa": "That spoke to me on a spiritual level.", "notmeenal": "I thought you were keeping your phone down", "arunimajoshua": "Same please thanks😂", "topbastard": "I mean, I dunno, I just online shopped a lot because sitting in front of your laptop counts as writing time if the bar is low enough. So this sounds great, you should write some more. But for real: deadlines are the only things that work and an editor you love and really want to work with so she makes you better, stronger, faster at this thing you’d love to do.", "nyamat1207": "@anshkjain", "wear_urstyle": "@shreyalinkedin", "shrutikarao": "Gosh. Sounds too familiar. Add ‘you will study yoga to learn how to cleanse your mind and end up doing it for five years as a career’.", "pooja_beee": "I feel this on a personal level", "sirjan_": "@fraaanya", "ayushkr1": "Idk man, I feel like you're attacking me.", "unpicky_eater": "How will I sort out my bank paperwork if there is no money in my bank because I am doing everything other than writing :'(", "nadhaneelambra": "I love you", "richamehta5": "You missed a lot many distractions and engagements too. That's is how a writer's life is 😂", "ramalaxminagarajan": "Story of my life❤️", "bhoglechinmay": "Lol. On a serious note though, just tell 10 people that you're going to write. That way they'll ask you from time to time to keep you honest. And don't only tell friends, tell random people too. Worked for me.", "tanmaybhat\nVerified": "Verified", "hugs_for_drags": "🌸🌸👌", "asmakhan7783": "How are you so good 😍😍", "shaviestaa": "wow these daily attacks.", "ghauvas": "And you'd be some Instagram influencer as well!!", "ruchiraroy1305": "Love those Sacred Games glasses 🤩", "sujata.17": "This caption is me soliloquy-ing.", "thestarstruckchase": "💯💯", "hoodplantpapito": "Truuuu💯 Also on another note. Those frames are really cute. Thx for sharing"}