{"styleinsense": "Curls 🔥❤️", "ibarthwal": "Wow rega my superstar 💖💖 but this was very well written.", "_thesoulthinker_": "Not to put any pressure but can you please write soon and complete it and get it published so we can read it soon. 🙈", "shubhangi_7": "Couldn't be more relatable!", "sarvanichowdhury": "♥️", "sundar_akella": "@bharath_d7", "expertoverthinker": "@mallikadua were your woke status about these kind of people?", "_sanmithra_": "You can very well replace writing with studying and it is suddenly all about me! 🤷🏻‍♀️ #inTheSameBoatButDifferent", "socapaco": "just scrolling and looking for CGM comments", "thefoodietrails": "For me the switch happened when I saw the times write I dia season 3 Contest. I had been a 2 time winner in the first season, but this time I had been so wrapped up that I didn't know it had started! There was just 2 days to the deadline , I read the prompt, we needed to write a 3000 word story based on the prompt. I brief story line flashed in my mind, I started writing, kept writing, and after an Entire night's work , I was exhilarated to have written after almost 1 year. Start small.", "8paggu": "I WISH I COULD MEET YOU😭 @regajha", "aruushisharma": "I think I love you. 🧡", "twilightfairy": "Great.. Ur transformation to fashion blogger is nearly there 😁", "lynnraj": "sometimes my inner critic/ writer’s block tells me “you are a writer whose seeking an of experience life beyond words” then I both blow my own mind, but also, stop writing. sigh. I feel you. #immyowntrickster", "valfirmation": "Ha 😂 very good “sis”", "pearlparekh": "I like that you’re writing about not writing but you’re still writing so u ARE WRITING", "raktima2015": "You've nailed the writer face but. The second photo is OBVIOUSLY meant to be on the back sleeve of a book cover.", "deepakramola\nVerified": "Verified", "ranaayyub\nVerified": "Verified", "something.yours": "This caption was a wilder ride than a Nolan movie xD", "snehal.forever": "I just happened to come across your insta profile and I couldn’t stop reading captions of all your posts! They are so authentic and honest.. in some of them I could see reflections of myself! Keep writing for people like me who also suffer from the ‘not writing’ syndrome.", "_________smitraj_______": "😍", "vaidehiparve": "Kaatil 💕", "dhwanivyas_": "Read 'The War Of Art' by Steven Pressfield ASAP. You won't be able to not write after that :)", "ankita_raisinghani": "You described my experience of writing my thesis", "katie.khanna": "Woww, looks like you are expressing my feeling about not writing and still wanting to be a writer 😆", "agape.zeus": "@regajha why you do this? This doesn't excuse us from inevitable procrastination only comforts you with needed validation and us with relatibility. Do better for us and for you. 😔 💜", "druvinkaa": "@tha.thu this doesn’t sound like us at all?", "schnoolettohetto": "@janvi._.nagar 🍰💌♥️", "thecipherstory": "I wanted to avoid writing too but I also wanted to tell you that this caption you wrote about not writing is so write. Can you please write more about writing, not writing and everything in between. I understood you don't write back to this comment about your writing cause I just wrote too much to try to impress you with my writing.", "xabibamoha": "Wow am so tired from reading this", "ms.eats_a_lot": "@samhithatumu umm bro .....", "_shishhhh_": "Sasti Kangana😆", "misaxmisa_": "Doing everything but not what you want? Sounds like me.", "pranitart": "Firstly, DAMN GIRL 🔥😍 secondly, my therapist calls this a burn out (in my case, I couldn’t draw for a couple weeks and was convinced I’m not ambitious enough/ not cut out for this). A week long break with no pencil or paper in sight kinda helped 🙌 p.s: I also was mad at myself for having a burn out, so Incase you have similar feels, we all in the same boat 🚣‍♀️", "blueblissy": "you should binge on Jane the Virgin, not writing, if you haven't already👀", "alfaaaazein": "Thank you for always keeping it real, Rega!", "themodemuse": "Can you speak Maithili? 🙈😁", "on.stand.bi": "This caption is EVERYTHING. I'm not alone!!", "priyamsaha": "Model bannjaa. Writing is moh maya", "poogramster\nVerified": "Verified", "_hvrsh": "I feel you. Reminds me of that night i got shit-faced, threw up and asked myself why am I not drinking enough.", "kavitacharan": "That someone can have more than 2 friends to talk to is major achievement unlocked 🤷🏽‍♀️", "blrgirl": "♥️", "iamjagritip134": "Omg💕💕", "akansha_awasthii": "How amazing are you!!!", "the_sassy_libran": "So it's lookin cute and #notwriting !?!", "nitu32182": "🔥🔥🔥", "aureliasfeed": "You sound like the you're on the early phase of Stephen King when he must've thought about writing his book, \"ON WRITING\" as he says in his Preface that he will attempt on making this book all about writing. Why don't you write a book on how to write better for aspiring authors! @regajha (hoping you'd see this comment :D)", "khamkhaphotoartist": "If not writing is making such pretty pictures, don’t write for sometime please ❤️❤️", "noureentaj": "Ayyy it's okay if you dont want to write when you dont feel like writing or straight up not in the mood to. Absolutely okay. Talking to your nurturing friend for 45 minutes is writing, a human diary, fair enough. Writing about not writing at all, fair enough. Taking your time on your ride, fair enough. There are a million other things you are good at, you know it. Not writing is just a chapter of your almost-finished-journal. And how are you really going to complete it without enough pauses? :) Sending the hugs you need to get back to your happy spot💌", "anushaanushaaa": "How can you write such a good caption and say you're not good at writing, I feel like Hazel from TFIOS to Peter Van Houten: \"Frankly, I'd read your grocery lists.\"", "nirali.s\nVerified": "Verified", "aatreyithakurr": "Sis", "acurlypotato": "Offffo @regajha", "neetika_n": "@regajha oh la la what do you use to style your hair? 😮 and lovely \"not\" writing", "deborahahahahaha": "Wow you just wrote about not writing.", "wear_urstyle": "*ended", "dreaming_about_luna": "I feel you so much Rega. Uff.", "elizabethriyaroy": "Pls try the curl life❤️ lukin faaaiinneee😋😋", "prachiix": "Just a question, why are you not writing? Whyyyy?", "garimazy": "I mean you're writing now", "leo.lion1851": "This was calculated 👀 #notwriting", "uttamgupta": "😍", "charmitrevadia": "I am not writing either. We should meet to lament about it.", "matt_pucho": "As a writer, i am thinking of the most parallel comment to write here to get you to notice me.", "sanjanagp9": "@the_sassy_libran", "shrutikarao": "You were just looking for inspiration to lubricate your mind! I say trust yourself is the only DO and don’t give up is the only DON’T."}