{"suvpradhan": "I agree. My \"let's go to wedding reception self\" will never approve of my \"chill at work self\" who won't approve of my \"bf is angry need to look pretty self\" and so on. 😂", "ruchiraroy1305": "It's like there is this shapeless amoeba-isque balloon that is expanding inside of me but unable to come out and then out of nowhere comes Rega Jha who with her tool of language draws the balloons out, gives them the shape of an idea, and frees you.", "charmitrevadia": "My different selves are usually at war with each other and the world but every single one of them quietens down at the sight of chocolate chip cookies. So I guess what I am trying to say is, my most evolved and most basic, every version is a child.", "the_editor_mischief": "I relate big time!!", "styleinsense": "Raw and Real 🙌", "erin.chack\nVerified": "Verified", "twilightfairy": "No, my multiple personalities do get along 😂", "al_rockstr": "Dress properly u r a woman, have some decency", "abloomgirasol": "Orange phoneeee❤️", "prakshisaha": "Firstly, I cannot even adequately put in words how @regajha makes the internet a beautiful place to be on. It's relatable, funny, real and inspiring. Secondly, this post. I always have two extreme phases. Either in my boxers, hair tied in a top knot, my acne and dark circles popping out, looking like a dead mess. Other is this extremely well dressed, make up and hair on point, bag, shoes, belt coordinated so called perfect self. People often call the second one fake and made up. I have been makeup shamed so many times. But nothing gives me that crazy confidence than a loud mouth. So, I have never been able to explain any one that I don't have to choose either of my self as a real one. Both are equally me. Your posts sometimes makes me believe it is okay to just be exactly the way I am !", "ellsiebelle": "I saw you host the panel in that kick-ass green suit in Vancouver and, while the exterior may vary, I've found everything you said and championed in that panel resonates with everything you say on here :)", "shishirawr": "@shamstagrammm she should compile her captions into a book", "findingmygalaxy": "Haha I love you marry me please 🥺🥺", "idreamzero": "Love this! Each of our Authentic Selves is a Spectrum of selves. Took me a lot of time to accept that one can be multitudes and that is A-OK. :)", "jonfingas": "Piping in late, but reminded of Walt Whitman: do I contradict myself? Very well then, I contradict myself. I am many, I contain multitudes.", "_mnemonist_": "You are such a doll", "suncradledbynight": "I loved your photo and the caption! And I love how you have said that we are spectrum of selves!♥️ keep slaying @regajha", "tanuellaa": "💜💜💜💜💜💜🔥🔥🔥🔥🔥", "theartsy.company": "So true 🔥", "lasya.__": "😂 you literally looked homeless in the first one. And in the 2nd one you are like...ooopp💣💣💣", "jjaypal_99": "Zakas pic😍😍😍", "pagekannor": "@objetpetitjam idk why but I saw this and immediately thought it sounded like something you would say", "sonali_s_ahuja": "Christmas bana diya ye toh", "mdnaeem07": "Bwal", "nom_nam_nom": "Just the most perfect set of words to ever feature in a caption.", "cheesenletters": "@aasthaagupta Caption.", "thecurvedprobe": "😂😂😂", "gaurstatic": "OMG YAASSSS QUEEEN! We all need to accept our own spectrums. Thank you for talking about it. More power, love and hope to you @regajha ♥️🙌", "somyasardana": "If you can't handle me at my, then you don't deserve me at my💁🏻‍♀️", "racheetaaaah": "❤️", "jovaferreyra": "Interesting thought, the last one. We’re used to using words like “anxiety” and phrases like “my brain is being unkind to me.” But I wonder if the acknowledgement of or various selves can offer new forms of expression in order for us to understand situations (and our whole selves) better.  For instance, we can say that sometimes our “higher selves” get frustrated with the basic-ass shit that our “normal selves” wind up doing over and over again. Or the way our “shadow self” takes control and makes choices out of fear, making us smaller and more constricted—pissing off the higher self and creating a tug of war within us that make us fidgety, unsure, doubtful and... anxious. Know what I mean jelly-bean? Accepting our inner team of selves and making space for all of them to work together and get along is crucial then. And if one self doesn’t play nice with the rest and is just creating chaos, can we slowly let them go? Tell them that they’re not in compliance with company culture and give them a two weeks notice?", "wuhdapav": "@anushka__parashar footwear😍😢", "confondue": "but why couldn’t both the selves be authentic in themselves? I digress, but where’s the suit from😍", "sapanv\nVerified": "Verified", "forevergoofy": "Lol this is literally map of the soul: persona theory by Carl Jung, @runi.j"}