{"navyasree213": "Very good", "ciaraandmommystyle": "🙌🙏👏", "jitendravpatel": "Deepika Bharadwaj ma'am has shared some screenshots of chat between girls and are also to be taken under consideration", "priyanshu_1706": "This is GOLD 👏👏👏👏", "mariettevalsan": "Yes yes yes a thousand times yes", "tapash878": "You are sick humans for entire generations. What a idiot you are", "coolneethuz30": "You penned my thoughts so beautifully.... So great... I hope this articles will make everyone think.. 😊", "surfer__paradise": "Ma'am, with all due respect, the \"male\" side apologizes for what happened. But I want to express my views upon the fact that we people gederize these incidents. It's true that convicts are boys, but its our sincere request not to blame the whole gender. And as a matter of fact, there are incidents where men too become the prey of the opposite gender. But most of the times these are unheard of. Taking an example of the sad incident that happend with Sarvjeet Singh. Although it is old, but it is a very good example of the fact that \"not always men are wrong\". And yes, many boys like me are very much kind and respectful to opposite gender because we have been taught the right way. I would sincrely request you to consider your post in a general way rather than a specific gender. Plz trust me, we really do feel bad about what happpend. Thank you. Hope you have a good day..", "ashkanzahoorbaig": "I really appreciate your efforts to spread awareness about this ma'am but that doesn't mean all boys ate born rapists, actually if you see the balance women are having far more privileges than boys, they have around 50 laws for protection, you can call these laws as weapons of misuse also, they have a full fledged ministry, apart from that they have two commissions for them like National Commission for women and Delhi commission for women, don't you think even we men also face the same problems like you, we face rega ma'am patriarchy effects us far more than you let me tell you how: we men are not supposed to cry \"LADKE NAHI ROTE\" that's the major contributor to violence among men, we are always expected to go out and work, even if we sit back and relax also we are labelled as selfish and careless, the society thinks it is okay for a woman to hit a man but not the vice versa, and while talking about sexual harassment, many men have also undergone sexual harassment by their female seniors or superiors, everytime men are looked upon as ATMs ,only God knows how many men have been falsely accused of rape and molestation and thrown behind bars for just have the audacity to argue with a woman, you say that we men have male ego then what about those women who say \"HOW DARE YOU TALK TO A WOMAN IN THIS MANNER\" every time whenever a rape case occurs all men are asked only one question \"DONT YOU HAVE MOTHER AND SISTERS AT HOME ??\" then in that case why don't anyone ask those women who have falsely accused men that \"DONT YOU HAVE FATHER AND BROTHERS AT HOME ??\" I know still women face a lot of problems in this world, even I too have a mother and sister at my home but that doesn't mean boys have no problems at all, have you ever heard of ladies night where women are allowed inside bars and pubs for free while men have to pay, recently the Delhi govt announced that from October 2019 all women will have transport for free, even while travelling in a public transport, we men are always expected to give up our seat to a lady, don't you think this a form of gender discrimination against men due to toxic feminism, I just wanted to say only one thing ma'am \"NOT ALL BOYS ARE GUILTY\"", "saurabh_uttam": "Btw girls had made their own Girls locker room why judging everyone on the basic of gender if we blame whole community of girls for making girls locker room im pretty sure feminist will come forward to slam me not everyone is same first of all u need to know this I fully stand community like Boys locker room and if a female is getting molestate im hereby to help anyone feel free to contact me share things i want to help however i can help in making this world a free, secure for my sisters and all females out there but when someone blame whole community that what makes me sad i have never sent a single req to any unknown girl asking for friendship or nude around internet neither my parents told me not to ask its my inner voice which dont allow me to do such things and i think no parents tell their kids to molestate a female or something like that", "khadeeja_bind_mustafa": "6gy6l😍😍👌❤️❤️❤️❤️👌❤️", "kk_czta": "No why the fck is pop culture demoralised??? You talk about shit like that with a fcking culture like Indian??? If it were even a bit affected by pop culture and guys and girls could be somewhat more open to their guardians and could maintain a relationship openly then nothing of this could happen.... Don't talk shit in a country where your brought up listening \"don't talk to strangers\" and then tied knots with one.... And remember what's the matter with girls I definitely know (I hate pseudo feminists btw) and they are not brought up well but no boy is brought up being told \"you should do what u want\" everybodys brought up listening the same damn thing u wrote on 4 fcking pages but the problem is deeper than that so stop fcking preaching mate and look for liberalisation cause moralisation isn't possible anymore", "__tawakkul_": "Didn’t you hear about the “Girl’s locker room” ?", "manishchand124": "Wht this the thing were all are equal?", "nationalism_2.0": "Pseudo feminists ki fauz. 😂", "sabhyata44_": "@garima.bhattarai298", "deepuniquequoteswriter": "❤️❤️❤️", "mayankmrai": "I have a daughter and I believe this incident shows that parent's should watch their children irrespective of boys or girls... In the process of being cooler and getting likes and attention kids are compromising their privacy over social media....", "nurglejoker": "Appreciable Writing and boosting words. But why it's sole responsibility of boys to deport oneself according to society. Rapes and assault do happen from opposite gender. We are living in hallucinatiaory society who wanted only boys to follow Gender Equality. Boislockerroom culprits are getting punish and girlslockerroom girls are only accusing those boys and getting applauded. Parenting is to raise both boys and girls to raise equally and teach both to respect opposite gender, personal boundaries and not to wary. Both genders need to be upbring on same level. Everyone is hiding behind Mask of social sites. Put on Happy Face 🎭", "_.tanusharma._": "💯", "sushy07": "Well written 🙌🙏✨👏but please also realise that women and girls also have to do their bit and dress modestly, so that boys don't end up staring and gawking at girls and women", "_._priyansu_._": "That's the thing in India not parents not teachers no one is confortable about sex education. Why is it so awkward, after a certain age we all know it so you might as well show them the right path to take. But also I am sorry to those girls out there but India literacy rate is not good so all boy's have learned is some shit they heard from their friends so till all the local uneducated people die or be educated it's not safe out there and it's the bitter truth.", "anythingforagram": "@regajha This is so perfectly said!! It is insane to me to imagine being raised and not taught these things, but I’ve experienced first hand what those people are like, and I know it’s not pretty. I loved the line “Instead of our parents teaching us to be wary of men, teach our sons to be men who don’t need to be feared.” I hope that many parents will read this and realize the power they have to change the world. 🙏🏼🙏🏼", "godaraghavan": "So as per Slide 5, every movie would be a “crime” movie, right ? Which movie or show does not depict the hero as a “winner” when he “gets” the “trophy” girlfriend? No one thinks the media is the rot. The onus is purely on the parent ? So basically I put my son into a room and shut down all TV, all music ? .... and even though I switched everything off to “educate” my son and keep him away from the “crime TV”, I will be labelled as a backward thinking/orthodox parent?  Yet, the entertainment industry will go on entrenching patricahy deeeeeeeep into our society and NO ONE will say a word to them. The poor parent is the black sheep . *applause*", "suranjan_borah": "Then what about girls locker room.....hope you have seen it too.....than what kind of mentality do girls have....its not a gender based thing.....its all about our mentality .....and i can surely say...women are enemies of women...because i have seen....if u go to a village and lets say that a girl is wearing short skirt or something...it will be the women of the village who will mainly criticize her...not the men....so i just want to highlight that....this problem can be seen from the very grass roots level...and in India there are more than 1.4 billion....so its not that easy that by writing a page....posting instagram post....giving hate comments against any gender will end this.......be practical and mature...it will take time.....and in my personal opinion...if a person has morals than he will never do such cheap things ......for example ...morals means what.....just like ur father....when ur father is there ...you behave to be very good ...don't do any mischief ..because of fear ....and also out of love.....same here...morals are certain things that guide u to go through the right path....and if you don't have them than...u will get diverted...ur brain will get diverted.....so have morals...and teach your.......to resepct everyone who deserves......who deserves.....", "writer_owl": "Am NOT defending men who are EVIL . All am saying if we hyperfocus on the problem and not the cause.We are constantly promoting a very contorted version of western idea of love . Am not saying don't change boys obviously, we need to change them , why isn't there a mandatory period in school that educates about assaults on BOTH men and women is beyond me . All am saying if you change boys and don't change girls there will always be disbalance in the societal values predicated on gender and you can't have a stable social ethical standards when one gender feels that the values are biased against them. By changing girls i don't mean they shouldn't wear short dresses or lipsticks , i know you know this from the points i made before, this was just for someone who would read this comment fail to understand the point and say there goes another man defending rapists by saying women need to change.", "garvit_grover": "Mam please post something about girls locker room also. Don't blame only boys girls are even on track", "mecommonman": "Change it to “Raising Kids”", "vnilayy": "Absolutely change it to kids ,all the males cannot be insulted just because some shitty people ,n if yes ask ur dad first because aprently he did not teach you", "dpamecha": "Well written", "ka__llu44x": "U had perfectly penned it maa'm💯💯", "treeinfield": "Geez, I messed up my previous comment. Here's a redo. Congratulations, this was very well written. However, I can't seem ignore a hole that I see. Who would teach parents what's right and what's wrong? Does that make sense? Maybe the point of your post isn't that parents have to choose between the right and the wrong way to raise their kids. However, if it is, then who would make parents aware of their own sexist biases? Isn't it an illness? The illness that generations of parents suffer from. The same illness that causes bigotry, homophobia, complacency. This has been my experience. Nobody taught me to not be a sexist, a homophobic, a bigot. I taught that myself. Once again, I am sorry if I got it wrong. Cheers.", "sakethedpuganti": "I don't even understand what the problem is for some guys on this comment thread. Nowhere in this post is it said that all men are rapists are assaulters. It says 'ALL MEN SHOULD BE TAUGHT FROM A YOUNG AGE HOW TO RESPECT AND INTERACT WITH WOMEN'. It doesn't say that no man is taught that. So if your parents have been wise enough to teach you, congratulations. Also, it's from a woman's perspective about issues WOMEN face. That is why it talks about MEN being educated and not women. Doesn't mean all women are innocent victims! Sure there are a lot of shitty women too, but they don't make women feel unsafe to walk around!", "antara.k": "Every word of this has hit home for me, thank you", "iamfaustuslobo_official": "@amelia_036", "your666isfake": "Preach 👏", "adityaarpitha": "Usually I don't feel like sharing these kinds of posts since they don't seem constructive, they sound like accusations. But this hits almost all the right points and it's conveyed really well. I hope within a few generations we can move onto other problems. The freedom men enjoy come at a price, a price that women are paying right now. The whole bollywood romance trope is feeding the problem. Thank you for your powerful words.", "impatientweaver": "@radz_54", "aathreyahebbar": "I have yet to see a parent who says you feel like fucking find a girl and just ram her . They do teach them to respect women . It is the environment kids grow up in, which gives them the idea that sex is fun or they are stronger . What kind of friends you have , how seriously do they take their parents i mean like a drunkard's kid wouldn't give shit value to his fathers words. it not the what is thought that is wrong it is how their thoughts develop that is wrong. These are my personal beliefs not looking for any attacks here", "isthatsobriety": "✊", "ashu_porte_": "Dont direct it to hip hop culture.. they never preach these kinds of pathetic shit... i agree with all ya point but this one just fucked me up.. it came from a land where rape victims are negotiable...and this should not be implied in this scenario...", "meher_tara": "Bravo", "kirtipriya12": "Not all men you say, True, but all women face this every day. All men might not be dogs But women are always treated like dolls. We don't want to be goddesses nor do we wish to be a queen, So please keep your chivalry to yourself, And let us be normal human beings. Some are fathers, some brothers and some are friends, But the fear never seems to end. No place is left safe, And the horrors even follow us into our dreams. Maybe not everyone is a playboy as you say, But many girls ended up in hospitals, because of the boys they dated who treated them like prey. Some opened their hearts, Some decided to trust you with their bodies, But how could she ever know, That she would become a mere joke with everybody. It doesn't just stop there as she was forced to paint her face, According to beauty standards of the society, And wear heels to be on a par with the men's body. Women even had to lose their name and identity, Just to avoid stereotypes and to be heard in the patriarchal society. J.K. Rowling, Harper Lee, George Elliott and many more remain unknown. But tell me how many more names you need, to hear our desperate plea? Oh! These are petty issues you will say. Then let me remind you of those whose lips were forever sealed and bodies torn away. Nirbhaya, Junko Furuta, Anita Cobby, Oksana Masar, The list is infinite because women are considered objects not just here but everywhere. Tell me how long will you ignore our screams and turn a blind eye to everything? My hands tremble as I write these lines, because unlike you, I am a woman bound to live this life. And no one ever wishes to be India's daughter, Or have our names flashed everywhere. We believe in equality too, maybe more than you anticipate. Because from all these years we know how it feels to be downtrodden and be treated like a slave. But then why do we have to behave, Because of a few men writing our fate. Why should we live in fear and hide in our homes? Because of men on streets asserting their control. But home too is not a safe haven, The freedom snatched away by some demons. So how to talk of equality when fetuses are murdered inside their mother's bellies.", "abhishek_gupta_": "Teach your CHILD to respect EVERYONE", "kawaii_mariie": "❤️🙌🔥", "ubi8ntnd": "💯", "shivam123bhai258": "Teach Ur sons like what this page is and make it anti national., WTF! Plug Butt", "anutreesajoshy": "The sad reality is that there are people who are more concerned of NOT ALL MEN than addressing the issue at hand...Yes everyone knows NOT ALL MEN...and if men are facing the same issue..bring it up too..but not as an excuse...This isn't a blame game guys", "yashpallicha": "Hate that mindset hate reason I have to resort to that mindset", "imrankingkhan": "Not all men are the same but all the Indians are the same @mrrashna @m__lnd 😂🤣", "___rijith____": "Is any female show respect to men", "alimor_ysiad": "3 years and nothing's changed", "walk_in_my__shoes": "Disagree with the same... I ll say use the word teach your kid instead of teach your boy... Talking about the gender equality then why do you discrimnate on the same? Sometimes i feel man overpowerment is a myth... Never saw any unmarried guy throwing his parents out of house... Never saw any married guy arguing with his wife to support his parents and family.. We should teach our daughters to be a part of the family once they get married. They will have to ensure that they cn change the life of all in a better way as its all together them who can make a difference.", "mishthi_sharma24": "👏👏", "ankit_official07": "Teach ur daughters too...beacuse not every muslim is a terrorists not every hindu is a religious not every boy is a rapist... the fight is against such wrong mindest not against any particular gender... because galat - galat hota h chahe woh ladka kare ya ladki.. and in those chats girls were also involved and another day girls locker room was also found... so they are also equally liable for punishment.. dont talk on a particular gender what it shows ur mentality... agar isi ki jagh aapne ye jo hua tha us topic pe bolte toh shyad logo ko jyada pasnd aata h.. its a wrong gesture to point out a gender...", "salmanme__177": "Don't show girls as good and boys as bad....shits...", "basicwhitedude2020": "Honestly they should be hanged and mob lynched to set an example for society", "destiny_in_undergroun": "Iranian's parents must learn this things too.", "tejaswiniduggaraju": "@manojad.kathuria", "anirudh_sharma7": "♥️💯", "hosea_khawbung": "@kalitajyotismita, read this.", "nik_127_": "In society if a girl abused a boy it’s a shame for the boy . “Arre ? ladki se pit ke aya hai “?? “Bro grow some balls bro . “ and so many men don’t even report it .", "vaishhh.__": "I have grown up around males and they are soo kind and loveable I have seen women bitching about eachother and degrading another woman soo its not about men or women its about human to human. @regajha", "fernweh_akira": "❣️❣️❣️❣️❣️", "sonotnupur": "@thepulkitsinghbisht", "preethichellappan": "I prefer to raise my son as a child not by gender. I would want my child to respect everyone equally not by their age, gender or position. I would like my child to have own thoughts and freedom to choose. I feel if we stop racing against each other as a gender only then we can attain equality. I will teach my child to play cricket and kitchen too. I would want my child to learn to do household chores not to help his spouse someday but because I want my child to be independent and not needing a nanny but a companion is his life.", "radhika.154": "Woah. Very well written.👏👏", "indhusha_selvarasu": "Hope all parents teach these every words to their son.. women are not things.. they also have beautiful dreams and family.. remember she is a treasure daughter to her family.. plz plz plz respect women.. they are also human beings and have dreams to achieve and life to live.. plz plz..", "sanaaaz": "This goes for Pakistani parents too 💚", "surbhi158": "👏👏👏", "hrishik_patel": "💯", "novel_epitome": "I was wondering how ironic is it that certain topics are discussed and criticized by the influencers and media but the rest are ignored, wondering when was the last time fake rape accusations by a woman or how a mans like was ruined due to no-fault divorce was discussed. ( locker room bois incident was shameful but we can't be selective on which topics we choose and which we ignore)", "tanya.kothari": "❤️ @kanikasanwal @sanwalpriyanka @shivani.sanwal", "gandhi_purva": "Amazingg👏", "realsundancekid": "DO Indian parents themselves know what personal space is ? You guys write these articles as if the people who even do these things, understand those concepts", "mri.singhaa": "Everything is up to the point except the gender.it should be teach your child not just teach your son. Even women sexually assault and bully another women. Teach your child to respect everyone.", "chubby.cheeks.little.eyes": "If I ever have a son or sons... I'll see to it he respect his fellow humans...women or men...poor or rich....it's high time we teach kids to empathize along with teaching them manners....even some adults for that matter", "anksarora_": "Beautiful thoughts, harder institutional changes need to be brought about with fathers in the front line. Thanks for this Rega 🙌🏼", "someshawasthi": "Why is this post just for parents raising their sons in \"India\"? If you're making a plea for women, make it for all the women out there, why only for the Indian ones? If you say that is because women are more unsafe in India, then you are wrong, because that is not the case and some fact-checking might help. Even if that were the case, still, this problem of masculinity/gender troubles is not region-centric, it is more global than globalisation, and you ought to not make such things a note just to Indian parents, Indian girls or Indian boys", "xo.starboi": "Wah Feminism at his best", "kriish_agarwal": "@thechiquefactor 👍😀", "thecurvedprobe": "So brilliantly articulated.", "yoyo58586985": "All man r not sam your father is also a man remember that...", "subekchhyaa": "It's everywhere not only India. We talk about equality but south asian countries and America I don't think it's any different. Many places this has become so casual that it is an issue everywhere. With the advancement in generation I believe we should fear the minds of growing up generation as well. I hope this will reduce with time however I don't think it's particularly in India.", "shawshank_no_redemption": "Abey kya bakchodi h ye...men are bad and women are victims...matlab kuch bhi. Arey oo mand budhhi, insan kharab h koi ek gender nahi. Bhagwan k baad agar kisi k chakkar me duniya barbaad hui h to wo aurat h. Mahabharat hi lelo, mana duryodhan ne kaand kara but starting to satyavati ne kari thi.", "nayantarakansal": "@regajha so well articulated. I also think those who write about or work with (as support workers) victims of DV and/or sexual assault could increase their own awareness of how powerful the language they use can be. Instead of “xx got assaulted”, say “yyy assaulted... ”. Let’s reframe the blaming narrative used (which is unfortunately focussed on women currently), and instead focus our energies on the do-er of the crime, and maybe then, we may be able to bring about change through accurate acceptance of responsibility, and subsequent intervention required (bringing more men into discussions/conferences around sexual and physical assault, changes in primary education, etc.)", "mah_ya_hsh": "This was very accurate and relatable 🍀", "r_itv_ik": "\"Teach your son to respect women\" correct* \"teach your child to respect everyone\"", "flipping_memories": "This is so important! 🌸", "mayanglens": "Well said @regajha 🤗", "jaya_chandra_machiraju": "Gender equality good but someone again says ladies first , where is gender equality ? I think parents of every boy child didn't know how to raise him until you guys have to say . Raise your voice against who committed crimes against females. We will fight with you instead of playing such a victim card as females. Everyone of us react when something bad happens that a human being . Don't just blame all the male and their parents. If you have a brother then even your parents should know how to raise him ( According to your post ).", "__ansh__a": "Wow! Impressive!!!!👌👌😊", "chubbrowngirl": "If the male dominated society still argues on this, having explained so so so politely, I don't know what will help them anymore. Rega, This is powerful.", "ashfaq_md9": "This was very well put.. I do hope that our generation when they become parents will teach their kids how to treat each other with respect and equality ❤️❤️", "saburikapoor14": "Perfectly penned down . Thank you !🌻", "piya.0712": "@arorachanchal", "snemu97": "@divya_murali29", "kapoorkaran950": "It's true but still , you can't stereotype all guys in the same way", "tinu.dp": "@squarepaants : 🙌🏻", "ssmehrotra": "Yes, totally agree. Also, I think India as a society needs to have a healthy acceptance of teen sexuality (or human sexuality). A healthy acceptance of teenage boys having girlfriends and relationships. And value empathy in general. As a society today, the only thing we value is achievement. Empathy is considered a weakness, especially for boys", "itsmeaish": "💯🙏🏻❤️", "tht3rd": "Wise words. I will have my teenaged son read this to me and we will have conversations.", "devina_dini": "Very well written Rega!", "prarthana_muthappa": "♥️", "duttashouryam": "Hello ma'am (I'm not saying ma'am in the form of any sarcasm... But bcoz u r elder and also coz u r a stranger and completely out of respect) I am a BOY and I was raised by parents of a BOY but I was always taught to RESPECT WOMEN. There is a fine line that differentiates between feminism and PSEUDO FEMINISM.... Please UNDERSTAND THAT if u r posting this publicly... Let me REMIND YOU that u said this to ALL THE BOYS' PARENTS whereas u should have mentioned that it is only for THOSE PARENTS whose wards OBJECTIFY WOMEN AMD GIRLS.. I am a BOY TOO.... But i DONT OBJECTIFY WOMEN OR GIRLS... U said this on a GENDER BASIS which means ALL BOYS RAPE, ALL BOYS HAVE SUCH MENTALITY, well let me KINDLY remind you..... YOU ARE NOT AN ORPHAN, you have a FATHER, do u think he is a RAPIST? Are u saying these to your GRAND PARENTS TOO? If u think your post is JUSTIFIED AND UNBIASED then say me... DO U HAVE THE COURAGE to ask your GRAND PARENTS TO READ IT OUT LOUD TO THEMSELVES? And now about the girls.... Do u seriously think that girls don't objectify men??? There are MANY GIRLS OUT THERE who objectify men and boys!! There are MANY MANY GIRLS out there who body shame boys... There are thousands and thousands of girls who even refuse to look or talk to a boy if he looks ugly but would flirt around with a handsome guy..... U can NOT JUST SAY ABOUT MEN AND BOYS.... You should RAISE YOUR VOICE AGAINST THE SPECIFIC PEOPLE who objectify people regardless of the gender, maybe my comment is a bit too long that it will get skipped or ignored but I DO HOPE THAT PEOPLE READ THIS, because one CAN NOT just blame ALL MALES in general.... I have a quite big friend circle... I don't have ANY FRIEND who objectifies women nor have a rapist mentality... We also have parents and our parents DID TEACH US VALUES TO RESPECT ALL WOMEN, so please EDIT YOUR POST, coz I know it's right to raise voice against this... But you CAN NOT dedicate it to ALL MEN IN GENERAL! In fact... You have DIRECTLY DISRESPECTED MY PARENTS.... And with that I can clearly DEDUCE who was brought up well.... You \"THE GIRL\" or ME \"THE BOY\"", "crazy_blacksheep": "So true. 😑", "lifeandlaughters": "LOVE THIS. And the way you said it has made me fall in love with your writings all over again . This heart for you from my heart ❤️", "_dinesh005": "@regajha you don't have any right to judge every parents about raising boys I think you also have (brother /father /friend...) in your life I also think you will be married in future and have kids. Not all men are same as you think. Please Don't spread negativity by sharing these posts", "damanic_sreya": "Nobody says it the way you say it❤️", "vysh.tive": "I'm not offending your post but think wisely A coin has two sides @regajha being a mother to my kids I know how to raise my kids you don't have to say it by uploading foolish posts. Without men how were you born?? You have some love towards your father & brother.", "avantika.arun": "You are so wonderfully articulate 🤗", "roumit.rakshit": "Kim Jong Un enters chat", "iamvamika": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "tashpaash": "Teach your sons that they aren’t entitled to any woman’s body attention or time. Love this ♥️🙏🏽 a lot of guys think it’s only about physical consent but attention and time is also something we absolutely do not owe you. ty @regajha", "dr.meenakshisareen": "Beautifuly writen and very well thought and written✌🏻 more power to you ✌🏻", "swarajmay": "You are doing this to gain more followers.If all boys unite and report your account what will you do..????", "avantim": "This is beautifully written. Thank you.", "shibaninarang": "❤️", "kavi2508": "This cannot be taught to a child at tht age. The kid will learn from what he/she sees and experiences everyday. Also, more than Mothers.. The Father wud be far more effective in communicating to a child by treating the women in the house with respect.. Be it his mom, sister or Wife :)", "wonderman_1220": "💙💙💙", "gotnoname12": "You’re rights guys need to be taught a lot. And also the parents need to held the boys accountable of their wrong doings.", "usmani_urooj": "💜💜💜💜💜💜💜", "_wasirraihan_": "I completely agree those delhi or whatever perverted guys need to be sentenced or punished but this critisizing all guys is over the limit of hypocritisism!", "thecaptainthunder": "I'm taking that as a direct disrespect to my parents..... Well that shows who's not been raised properly", "thatmalluchick": "May or may not have shed a tear reading this.", "priyaparihar01": "Beautifully expressed❤️", "_swapnilsaha_": "This proves that you are totally feminist centric and better mind your words.You are addressing to the parents of all boys.Let me say you all boys are not rapist,all boys are not stalkers,all boye are not offenders.The way you have scripted your post its totally symbolises your hate towards boys.In your slide you talk of gender equality,this is your gender equality.Great round of applause for your illogical post.👏👏👏", "kunaljain23_": "Sorry to everyone one", "puppyshame": "But they fired you, which means this is invalid", "ruined_hydra": "A perfect world it would be indeed.✨", "shrutz_01": "❤️❤️❤️❤️❤️❤️❤️❤️ ty for putting it so well", "icydarcystormy": "W O R D 🙌", "ktandon06": "Its a change that will take ages to reflect in our society. All we can do it take a step, i guess", "shireenshinoth": "Word.", "khushrajput": "Nt just boys to girls parents as well.", "lalakutty": "Gosh, this is everything I’ve felt after what happened. Thank you for putting this to words. I hope I raise him right.", "debleena_b": "This post hits the spot! This is so uplifting in this sad incident", "ashishsehgal": "So well put!", "shreyyayy": "Apt💕", "verma_palakii": "You said it all🙌👏.", "vinita_writes": "I'll be in touch with something in a few days- and thank you for this", "bisshh_21": "Oh god! This is so so beautiful. ❤️", "fearextinction": "How about teach your sons and your daughters both the same things? Abuse comes from evil specimens of both genders. Your sons need to learn how to spot and defend against abusive people too.", "anubhuti_kala": "LOVED EVERY WORD OF IT. 💯❤️", "snoozyunicorn": "I really hope all the parents understand this. However, with the current situation, I wonder if it makes sense to say that the past does not have to poison the future and we can always learn from our mistakes. A lot of them have a traumatic/ dysfunctional childhood or environment. We cannot be shitty in our actions and say our parents never taught us all of this.", "_hersheyy_": "This ❤", "naveeendaksh": "Men, Some are short and handsome Some are tall and dark Why do you say all men are dogs? Do they bark? Some say \"Aap\" and some say \"Tu\" Some say take care, and some say f*ck you. . Some offer you a seat and some pull off the chair, i saw a girl eating ice cream and her man holding her disturbing hair. . Some look at your eyes and some look down, Some call you b*tch And some will call you queen with a crown. Some with shiny hair and some have hair fall, Some just ignore you and some will be there at one call. . Some resemble your father and some will look like your brother, Some will be your crush and some will be loved by your mother Some are tough and raw Some are soft and use fairness creams Some slide into your Dms and some come in your dreams. . Some are very simple Some are much complicated. He is not a play boy just bcoz it didnt work out when you dated. Some are clear about their goals and some dont know from where to start Some are bad at expressing feelings and some easily open up their heart. Some are introverts and some are highly social Some will hate your make up and some will help you with your facial. some are hit with testosterone and some cry for less beards some will make you cry and some will wipe your tears. . Some will help cover you with saree and help you do the drape. Some will uncover you coz some are bastards who rape . Bcoz of one man who did wrong Will that entire group be blamed? Bcoz one man broke your heart So are they \"Dogs\"? that you named? If Women are like goddess Then Men are like Gods too Coz its equality As said by you. .", "althaaf8741": "Ma'am, why do you take this issue on the basis of gender. There are girls who does objectify and talk trash about males like these and they get away. I understand there are guys with wrong intentions. But you cant assume all the males to be bad and dangerous on the basis of these guys who rape. Not all men rape. Not all men see you in a sexual way. It's the way people raise their son or daughter and not on the gender of the person. I really appreciate the awareness you guys are making to make this present scenerio change and create a safe world for everybody.", "shreya_1911": "Thank you for this❤️🙌🏽", "purnassundar": "Ugh, look at the timelessness of this intensely well-written essay. Gosh, ALLmost all men.", "hhi__baee": "Thissss", "mansiiiii__": "Perfectly penned down! Much love. ❤️", "gayatriis": "👏🏼👏🏼👏🏼👏🏼", "tejaswinikabadi": "Read it. Reread it. Sharing it. Thanks @regajha 👏🏽👏🏽👏🏽", "its.janani": "It's just so simple. 🥺🙌🏼", "wandarshini": "You spell magic😍", "arjyachoudhury": "❤️❤️❤️❤️", "mayuramulay": "I love you so, so much, Rega. Thankyou for putting this forth on such effortless but articulate words.", "dr_akshaya_aji": "well said !!!💯👏🏻👏🏻", "aposs.in": "🌻✨❤️", "adhrin_g": "Well written 👏 Love this piece ♥", "invisible_trooper": "The parents especially North Indian ones are messing it up. Do you see any South Indian or Gujarati names or Northeast names in the list? The problems lie in UP, Bihar, HaryanaPunjab and of course Delhi. These are the screwed up areas.", "anvitipandey": "Wow", "thesahanarudra": "This.", "jamdesigns": "For our boys - all 6 of them. @amnamajid @cheriemariam", "oliviagomes13": "Love this", "vasundhara3008": "@nikhilkela what we were talking about..", "vasundhra_dahiya": "Every word is so accurately put together, it's amazing. It's just sooo well-written. Lol, how am I supposed to start writing now when all I want is here. 😂", "illuminitii": "I know this is beside the point but can you please tell me what font that is?", "gauravrathod367": "Don't make it a gender thing", "_.proteetee._": "Love this ❣️", "thelipstickpolitico": "🙃 caption.. you’re like the alchemist - What you looking for is buried in your own backyard 💖", "mihikaa_07": "You said it! 💯💯", "isthatkaytee": "🔥🔥", "thefakenatasha": "Is there a version of this that can be shared on WhatsApp to reach the broader Indian audience?", "agramofkomal": "Thanks for penning it down. It's so humiliating and disgusting to live this and see this happening with other fellow females. 😭", "zenny_yd": "💯🙌", "nirali.s\nVerified": "Verified", "stanzindolkardimbir": "💯❤️", "elizabeth_m_mathew": "Every word 💕", "_lakshyaa": "PREACH.", "misha_gada": "Well said 💯❤️❤️", "simran_dhiman": "💯", "itsindname": "❤️", "thatmalluartist": "I agree all the things u mentioned but there is a huge flaw. There is gender inequality here. Parents shud nt just teach boys but also girls. Ur essay shud actually say parents shud teach their kids to respect and love each human irrespective of gender."}