{"amritarneja": "@sarabarneja", "kaneezsurka\nVerified": "Verified", "shwetaa.91": "Learn to say No and stand for what you believe in.Don't worry and be happy ❤️", "ratherwrite": "Keeping your cupboard clean will save you half an hour each morning, that you can use to sleep. :)", "bombaybellyrina": "Mostly about whom to befriend! She could always tell who was going to screw me over. Unfortunately, she hasn't been able to teach me how to do that myself.", "sunayanaroy": "That I'd need to have independent sources of income for my own sanity.", "binujha": "You could have simply asked me. That list is incomplete 😂😂", "anvita": "A friend's mom used to lecture us on, \"saarthak shopping\" 😂 every time we would come back from a shopping spree she will tell us that we must buy stuff that's really useful in the long run else we will become hoarders with nothing truly valuable in our possession. So, indulge in shopping but \"saarthak shopping\".", "momozorg": "@apteanita whatta whatta boss. Love you ma ❤️", "greatbigtales": "Been just 5 days that I been living with my mum but can still add SO much more to this list! 😍", "prernamakhija": "#Nikkamilearnstocook is my hashtag. She was right about learning to cook my own food all along. Incidentally cooked lunch today for the two of us 😳", "oventikka": "Never buy cheap shoes or makeup. Wake up early or you’re gonna be in trouble when you have to send your kid to school (every morning I remember this and tell myself I should’ve listened to mom)!", "_jongleur": "When I was unhappy with her brand of mothering, I tried to look for others who could provide me with it. Imagine the prospect, only I was too stupid to realise the insanity of it. Now, that I have been to the world and back, I don't know if there was a greater truth ever told, or a seer wiser than her.", "mrrahul.inc": "Wash your hair regularly with oil. Don't pay attention to the people calling you mallu/coconut boy. Fuck them and their loose hair follicles. You will get luxurious strong volume filled black hair and you can be rest assured your head will always be cool and calm. My mom was right about that. Also everything else she ever told me. Except God. That didn't pan out quite as I had hoped. :)", "eye.shaa": "Making my bed, taking a shower and changing out of my pyjamas even if I wasn’t leaving the house that day, saying I Love You often and meaning it, lots of cuddles and that good manners are never wasted", "riyasadras": "Intelligence matters but not as much as hard work. Only spend 10 rs if you have 100 to back it up. Learning to swim is important, if only so you know the joy of seeing a beautiful pool and jumping in with sweet abandon.", "anubhasawhney": "\"When you have your own daughter, then you'll realise why I'm saying X, Y or Z.\" Today I do have a daughter and mom's wisdom keeps coming back :-)", "anishayadav88": "My mom was right about everything, especially cooking. Because she wanted me to eat healthy and have the power to make a good meal for myself. Also, weird how the older I get, the more I am turning into her ✨♥️", "realgirlco": "All my energy in life is going towards not answering this very question 🙈 I mean, like, what was my mom *not* right about?", "malvika_tewari": "Blot your lipstick on a tissue to make it last, a bath before bed will instantly put you to sleep, if an answer to a crisis isn't coming to you, sleep on it.", "sadiahrk": "You will make friends at different stages of your life. They will all represent who or how you were at that point of time. Each friendship will hold its own worth.", "vrindashinghal": "My mom actually cares more about my legs being hairy than I do", "parulgulati_30": "@suchabrownie", "priyanka.k1402": "That studying on table actually helps", "rahulsubramanic\nVerified": "Verified", "vish.thedish": "That I'm special ❤️", "msahaaaa": "That washing and combing hairs pretty often in a day actually helps and that cleaning up the room is actually next to therapy. Mothers are the best ❤", "mrinimalism": "Trash television shows can be therapeutic.", "dodge_mon": "\"He's not worth it if he behaves like a shit.\"", "momomatiz": "Drink water. Breathe. Now think. I mean I don't know if the water is scientifically helping me but it does make me a little less restless. So drink water. Hydrate yourself.", "literarystew": "That I can get a lot done by waking up early.", "vishakhajain28": "💯 @joshi_bharti1 thanks for all the right advice <3", "khizm": "Oh also “Ek din tumhein realize ho ga ke I’m right!” #iRealize #WillNeverAdmitIt", "notanair": "That \"No man is worth your tears\". She told me this when I was 13!! 😂", "mojorojo\nVerified": "Verified", "madras_pennkutti": "True that!", "nishswish": "coconut oil is all you need for most things. don't count on men to fix anything. you are always enough. also, no matter what happens or how bad it is, wash your face and get the hell on with life.", "pseudo.paradox": "Stick to a schedule, exercise and eat your fruit and veg. Salads are literally my favorite food now.", "tanyagrawal": "You have to find happiness in the small moments in life. Buying a pair of earrings or grabbing a cup of coffee with a friend. Being happy is a decision unless of course you have mental health issues.", "paradoxicalcoyness": "@sonjuhib damn it"}