{"theinternetnargle": "I researched you for my internship and damn girl, you been slayin 💜", "miss_chatterbug": "You go girl! 🙌🏻", "apoorvi28": "@mockingjay_02 It’s BYOB. I’m getting tequila ❤️", "_shraddhadabral_": "@sanasinghrenu :')", "devikazamaana": "The best thing on the internet 🤙🏻🌸", "prishieofficial": "❤️❤️", "jasbinder_": "@balpreetkt", "screeching_sublime_peanut": "Gonna be my new motto in my life ❤️. Thanks for sharing this .", "simrrrrrann": "Beaut. *_*", "jazzgazing": "@mymoonisblue re: this", "dr.drakky": "You're my goddess.", "poonamandpriyanka\nVerified": "Verified", "arunimajoshua": "I don't hate my body I just wish I was born skinny", "supramario": "Will bring bells and whistles to abovementioned party", "myself.shivangi": "Is deepika padukone your sister or you both are twins coz in this picture you both look the same😂", "afacebehindthecamera": "I love this", "saradamahesh94": "@100bhagyaaaa", "movewithami": "@nikunjpherwani @rushab92", "blackforest83": "👏", "sakshi_sarcasm_shukla": "Love it🙌💖", "s022001": "This post makes me feel so proud! Amazing Rega! 🙌🙌💕", "1dpelmo": "Rega's tweet giving me life since forever", "my24karatsona": "OMG YES", "listentothewaterfall": "hahahahaha wow", "san.tra": "@swarnima09", "tanyarai105": "@manishasingh.06 PREACH", "_shradhdha": "Your last point is literally where my feminist journey started 👏🏽🙌🏽", "_nidhikataria": "❤❤", "occult_bear": "I still care about body hair because this was the thing I was teased for the most in school. The boys I rejected or who thought I was arrogant used to make fun of me, calling me 'bhalu' and shit. But, I eventually want to move on.", "varsha_kumarijhala": "Hey enough fucks should be given to this well written shit here.👌👌👌👌", "pranitart": "I love this! You buzzfeed brains 👌🏽you and @sokneeoh ❤️ i recently lettered something Sonia tweeted. Can I letter/draw a part of this as well? I will (obviously) mention credits in the image as well as caption. :)", "march_hare152": "I know this is not a big deal in the great scheme of things, but I recently started wearing dresses WITHOUT shaving my legs. I mean, sure I'll shave for special occasions, but I've consciously stopped thinking about it otherwise. The first day I did this and went to work, I spent the whole day obsessing about people judging me. But guess what? No one noticed, or gave a fuck. I guess the greatest thing I learnt that day was that most of these things are only in my head. The world has better/more important things to do. (God, internalized patriarchy really fucked us over, didn't it?)", "rochikale": "@sanaaakaleee", "apusstate": "I LOVE AND ADMIRE YOU SO MUCH", "hibobotamuss": "👑👑👑", "purabi.ch": "come through for us queen, hold this party, liberate us all", "iamjagritip134": "damnnn...", "djay112_turbo": "You know your story is a quite a inspiring one.", "tra_jha": "Feminism, makes me give fucks about shit I actually care about. Fucks out of stock for trivial shit."}