{"mightgetawkward": "❤❤❤❤", "samyukthaxsam": "Twenties Rega's priorities give me all the life💖", "bismankaur": "You go girl!", "nik.adhia": "Really regs the queen", "goldenfriedchickenn": "You’re so beautiful🌸", "nishtha_narang": "@aniket_jain.13 She worried about crooked teeth too 😭", "mithun_bajaj": "Cutest person alive @regajha", "gryffindork_18": "Those are cute! <3", "ms.mattappallil": "You go girl ♥️", "sanidesh": "I just don't get why people put braces! Natural is beautiful! It's okay if you have a little gap in your teeth! It's okay if you have double teeth, it's just okay... Please people, don't ever put braces and ruin your smiles!! 😊😊", "sanjeevjha99": "Ole 🐒", "whodachita": "Your teeth are beautiful", "frontinfrontinfrontin": "Much love to twenties rega! 😉", "annie2135gj": "I like her smile", "the_tarun_yadav": "Fyi Thousands & thousands of yen Are spended just to get those Crooked Canine ♥ the lovely Ones you have in China Every year", "thecontroversialkid": "But your teeth are not crooked!!! Mine look like aaju baaju mein se random daat bitha diye hai! They’re fine!!!", "neeraja_j": "This is my story 🤭🤭", "kunsahuja": "ICON REGA", "wajidmalik9": "hi", "sonali__varma": "I just saw your recent photos. It looks like your photos are getting better with time imo 😉👌", "shalmalie": "There is nothing wrong with worrying about crooked teeth or with getting braces. Getting your teeth aligned with the help of braces will prevent more than a dozen cavity problems in the future. Quite like \"a stitch in time saved nine.\" It's not about the aesthetics but more about the overall oral hygiene.", "raveenabajaj": "@ektagerera read the caption", "rchl91": "My teeth are similar", "kinkineee": "You’re so cute 😍", "nikitapadmanabh": "Shoutout to amazing parents who never thought their daughter needs braces to look perfect ❤️", "maliniagarwal\nVerified": "Verified", "rizwana_rashid": "Big shoutout! I wish & hope all girls would be like you @regajha", "simopedias": "As someone who had lived with braces I think you have great looking teeth. I had bugs bunny teeth so not getting braces was not an option", "happyinhead": "You surely don’t need it! 😄", "saumyax": "I’m 17 and I was gonna get braces and tbh now I’m not cause of this. 👍🏼", "okayanagha": "❤❤❤", "jemimagattagalla": "You slay gurllllllllll 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "jagritikachroo": "So pretty!!! Which lip color do you wear? It suits you so much", "nishswish": "Shout-out to best most heart warming smile ever.", "banerjie.ajita": "@regajha I never got braces too! I decided to not give a fuck about a perfect smile. 🙌", "purabi.ch": "hayyy i wish i had that confidence about my own teeth. i love you the most woman.", "vidushiswaroop": "@rashee_8", "kaveri._sharma": ".♥♥♥♥♥", "_.roshnibasu._": "You go, @regajha 🙌!!!!", "keerthi_sivan": "My lord, you're beautiful.", "_aishwaryeah": "Following your foot steps", "rohan.kucheriya": "❤️❤️❤️", "awwwrath": "YOU GO GIRLLLLL!! 🔥🔥🔥❤❤❤", "crazytrollsome": "No Rega should ever give more than 0 shits about her teeth, cause Rega plenty beautiful, and pretty and smart without. 💙", "pavnigaurangi": "@thecobwebworld", "wolfgangsfriend": "O feel good, Mine are crooked too", "ndiv9": "Your crooked teeth gave you that beautiful smile! ❤️", "_verbivore_": "Twenties Rega has a very beautiful smile", "nirali.s\nVerified": "Verified", "sanshuuu": "YOU'RE SUCH AN. INSPIRATION @regajha", "iheartritz": "Shout-out to Rega because she's an amazing person", "ridhidimri": "@jslnkb", "manognaa.s": "Gawdddd! You look beautiful ♥️♥️♥️♥️♥️", "meh.gha": "Twenties rega don't care about crooked teeth ❤"}