{"karen_thomas1996pr": "Preachhhhhh", "readsthrough": "Mokka u #ff instagrammians you will be funny. Dont ~unfunny", "eva_sangma": "@eren_sangma ongbebea", "ritwiks_": "Because there are men in it to make it one! @regajha", "coryodonnell00": "✨", "socialmediadissect": "Haha so true 👏🏻", "gayatri_k9": "@njnidhi98", "_quibller": "Because that's God who's being funny.", "amisha_desouza": "This is a good picture but I don’t know if it is because of good lighting or place… maybe composition 😉👍", "_tanyagoel": "@inoyouknowiknow lololololol", "shashvolero": "@regajha please help. Please check your inbox. One retweet from you can help my friend stranded in Canada where she lost her father to a heart attack when they were there on a vacation. She really needs help in getting him back to india. Please.", "yayavar_jatin": "Cause you are not funny, life is 😓", "redpillpapi": "Just stopped by to show love 💯", "_hahahahagaga_": "Women aren't funny(according to this post) hence they crack bad jokes as bad jokes seem funny to them.. So basically they feel their bad lives are also like a joke..", "shashvathii": "go read.", "codervj": "That's because the two things are not related to each other 😂", "urvisukhparia": "You talk big stuff about women and feminism blah blah blah. Then you associate yourself with a prick called tanmay Bhatt who openly allows people like utsav to harras other women. You are nothing but HYPOCRITE", "khushi.parikhh": "@mallikamansuri", "byondebond": "No wonder you work in BuzzFeed 😂😂", "foxyandhenry": "@regajha My husband and I just watched your buzzfeed Explain This episode. We fell in love with you! You are beyond hilarious! ❤❤", "prarthanasuresh_": "@aliikhxn !!!!!!", "_meryembanday": "🤣😂😂", "nishrinkagalwala": "Hahahahhahah @_ifrashaikh_", "sudhaspace": "God is a Woman! that's why this world is so beautiful. look at the stars and nature...💟💟💟", "sharayuwhy": "@momozorg", "maliniagarwal\nVerified": "Verified", "ambarish_kv": "I liked it. Stealing.", "subanw": "Got nothing to do with you being a woman @regajha The joke and your gender are mutually exclusive in their existence. I also don’t necessarily concur with it being a joke in the first place but can’t debate first hand experience.", "damini_chavan": "Big old mess😂", "indiasmagicmasala": "the fact that you think your life is an incredible joke is a joke in itself.", "_shradhdha": "Too real for this morning", "awe_sam_arth": "@shethestark see how NEGATIVE the caption is!", "thevishaljethva": "Woah.. 👍👌", "kadakchai00": "My fucking god.", "sushmitabasnet": "🤷🏻‍♀️🤦🏻‍♀️", "_sowmeow": "@_riddhika true 😂"}