{"a_ad1tya": "Why should there be an equal number of any gender in any workplace? Recruitment should be unbiased and on the basis of merit.", "the_moody_writer": "@evangeline__", "ratnagillofficial": "DAMN. Can we be friends?", "jrosser": "~45 people in my company, ~38 are women, all of leadership is women 👌🏻 @likeablemedia", "msppj\nVerified": "Verified", "curdricechronicles": "Came across this post while eating the Dairy Milk given by HR 🤦🏻‍♀️", "jan_3569": "@devenirfou", "_stirfriedchicken_": "Exactly! Yes! @regajha We don’t need an annual celebration if you’re gonna continue to pay us 30% lesser than our XY counterparts the rest of the year. What’s next? Where should I handover my kidney?", "adityamehta17": "80% of management are women, no gender pay gap and women stick around same or longer - depends on the role and not the gender @edgytal", "shivani_doing_tings": "Stan!", "lindsaytaylor16": "@calch", "shreyadhan13\nVerified": "Verified", "jessie.blocker": "4 women (including me) work at my company. Two women (including me) are leaving the firm at the end of the month due to the misogynistic work environment. Stay strong ladies and stand your ground! 💪🏼", "chitoryu12": "I’m one of only 3 men employed at my workplace out of over 15. Our ownership and management is half female", "thewaxstudioottawa": "YES", "deepalikini": "This tweet is EVERYTHING. I mean sure I love getting discounted massages and nice things on women’s day, but what I really want is safety, equal pay, and representation.", "heidionpark": "Wow! This hit me in the gut! It’s exactly what I’ve been dealing with the last 2 years trying to start a brick and mortar business. It’s all run by men! And many try to make it impossible for us to rise up. Thanks for sharing and asking women to speak up! 💕", "agrimahahaha": "I love you Regaaaaaaaa❤️", "rahul_gandhi_10": "And this CANCER, right here needs to be stopped! How about having more of talented and dedicated personnel in the workplace, regardless of the gender? Doesn't matter if it means having more women than men in the organization?", "natsgonenuts": "Found a new type of ad for women's day, Pepperfry.com made an ad specifically to say they are so liberal and unbiased that they won't do anything special for women's day. So it's an ad about not making an ad looking like an ad.", "tanuellaa": "Yassssss👌", "its.nith.ya": "@daddypaperstacks", "abishnain": "@swittidestiny", "boots.and.cats.and": "Are women better at managment. Do women work as much overtime as men??", "spillspell": "Hahahah.. I was eating that HR's free Dairy Milk while I read this!!", "hanisha212": "🌟🌟", "kripawilliams": "and that is exactly why i returned my dairy milk (even though it was staring at me post lunch)", "loopsofjoy": "Agree on all but one. Don't think there necessarily be as many women as men in management.. It should be capability based, not quota. :) cheers!", "thechubbytwirler": "👏👏👏", "bhawnagulati": "My current employer: umm..uhhh..you see..umm .. management implies MANagement..so why the women? 🤦", "earthy_scentt": "Yes yes yes", "anishabangera": "😂", "parag_rai27": "A very happy womens day a true #inspiration Social media", "clovia_fashions\nVerified": "Verified", "anvesha_r": "Am sharing this! So on point!❤️", "samriddhipandey": "Thank you for existing ♥️", "thatonemaverick": "@_rajeena_ @sharonprasad11 🔥", "ashnair94": "@debarati93 @sanika_devlekar", "mandiravirdi": "Omg 👏👏♥️♥️", "aayushbhattachary": "Totally agree however, the same thing applies if their are more women than men...I personality feel that their should be 50 - 50 quota for men and women!!", "masha_arabi": "All Women Team at @alphabetmedia🦸", "richanikki": "There are 70 women in my office. And 30 men. I work in a mobile media buying company in Beijing, China. My friend works at Alimama in Shanghai. Alibaba’s digital group. 80% of her office is women. 20% men, 10% of whom are gay. This amazes me. What should be normal.", "monicabansode": "👍🏻", "shrutirya": "All ladies at this company ⚡️ #honto88", "ankita_maskara": "Working in a company run by all women. 😍", "arenavitch": "@thesharannair", "vpm_01": "Bang on @regajha .. u have just spilled the truth and only the truth🌈", "dhruvshah96": "🌸👌🏻", "gunvantsr": "❤️", "devikapatel1": "🙌🏼", "voralogy": "If I could retweet this to all platforms - I would.", "ishapunjabi": "Yesss 👏🏼👏🏼👏🏼", "shrootsmcgoots": "👏🏼👏🏼", "thejoker1096": "That last line though. Shots have been fired ! 😂😂", "bhattaastha": "Truly agree 👍", "akshitha_4": "Didn't get that Dairy milk also but this post would do for now.", "poojaa.tripathii": "मैं अपनी ज़िंदगी की ड्रॉइंग-बुक में अपनी पसंद के रंग भरना चाहती थी अपने दिल के फैसलों पर हक़ीक़त की मोहर लगाना चाहती थी सारी दुनिया घूमना चाहती थी मेरे मन और देह को घायल करने वालों से दूर चले जाना चाहती थी । प्यार और भरोसे के साथ ईंट पत्थर भी जोड़कर अपना घर बनाना चाहती थी , अपने जन्मदिन पर खुद को गिफ्ट देना चाहती थी। अपने जीवन पर अपने अधिकार की आज़ादी का परिंदा था मेरे पास भी पर वो कैद था मेरे मन के भीतर, जिस पर पड़ा था एक मज़बूत ताला और चाभी .....? चाभी पता नहीं कहाँ थी क्या ब्राज़ील के घने जंगलों के भीतर किसी पेड़ की सबसे ऊंची शाख पर ? या आर्कटिक सागर के भीतर किसी मछली के पेट मे? या फिर किसी दूसरे ग्रह पर ? उस रंगबिरंगे पंख वाले परिंदे को मैं देख पाती ,महसूस कर पाती लेकिन कभी छू नहीं पाती थी मेरे कानों में परिंदे का उदास गान गूंजता रहता मैं बदहवास उस ताले को तोड़ने की कोशिश में अपनी उंगलियां लहू-लुहान कर बैठती फिर मेरा परिंदा एक दिन पिंजरे से बाहर आया और बैठाकर मुझे अपने ताकतवर परों पर निकल गया खुले आसमान में और ये उस दिन हुआ जब मैंने खोज ली वो चाभी जो नहीं थी किसी जंगल,समन्दर या दूसरे ग्रह पर वो तो रखी थी स्माइली वाले की-रिंग में गुंथी एक सफ़ेद लिफ़ाफ़े में , मेरी सैलेरी-स्लिप् के साथ", "shreya512": "Legit got pink balloons, roses and dairy milk today", "richamehta5": "Omg Rega 💜💜💜🔥🔥🔥🔥", "dasthewaymaahive": "Yaassss 💃💪", "knickknacknook": "Proud all-girls team led by a Girl Boss! 🙋‍♀️🙋", "dancingdisorder": "So fucking legit man!!!", "nirali.s\nVerified": "Verified", "charmitrevadia": "THANK YOU for saying this. I hate that such an important day has become a catchphrase and a sales driving hashtag.", "gongyoolovebot": "Also whether there is wage gap", "narpchnlrr": "👌", "sassy_aunty": "@nehachandelnc", "theblithefulbomb": "That's a lovely idea @regajha . Happy Women's Day!😀", "poetrybar_": "can we be soul sisters in next life🤷🏽‍♀️", "sanyuktabafna": "Literally liked this post while eating my free dairy milk from HR 😂", "blanknoiseactionheroes": "✊🏼", "dhar.akash_": "❤️", "thatbibliophiliccauldron": "Not just workplace. Pink/red faux today even in college! 🙄", "writerpav": "🙌🏾"}