{"thechikanlabel": "@komalpandeyofficial Anarkali angarkha with belt !!! What a an imagination...is there anything you can't do ♥️♥️♥️♥️Gave a whole new meaning to Anarkali ❤️❤️❤️❤️", "niddhichaudhary": "Hey where are these outfits from ??", "sakshisharma1": "You are a treat to watch..so smooth with every style..❤️", "cherryk_3": "Your styling and creativity is just mind blowing! 🤩", "cookeatcookrepeat": "👏amazing! ❤️🔥 Every look is rocking! ❤️🙌", "priyanka_attri3091": "Those earrings ❤️", "_ikratazmin_": "Loved it!!!💕", "payal5528": "Could you please mention the belt code or link?", "__aditi_rai": "Omg you're so beautiful I wish that I also look like you sometime 😍😍", "twiinkleshekhawat": "This white kurta is from ?????❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "shiv_n_reddi": "I think this is jus one way with six different dresses", "deepshikaghai": "My inspiration🌏", "pr_iyanka9130": "Baby u r 🔥hot🔥 as Fire 🔥🔥", "heyminal": "Belt from???", "nehakhuranapathak": "Awesome video❤️", "kapasiisha": "❤️❤️❤️❤️❤️😍😍😍😍😍💯💯💯💯", "krupa_kuppi": "Don’t you think all these looks were already covered and shown ?", "arissakn7": "that belt is from ?", "shemazahid": "@noori823", "susmitamohanta.42": "It pleasant to look at you.. Positive vibes😍", "__malar___": "❤️", "anerimayerr": "YOU LOOK STUNNING OML😍🔥💖⚡️🌹", "evy_effron": "Wow!🔥 @komalpandeyofficial", "zinatshejuti": "Ur bags😍😍😍😍", "pareekmegha373": "😍", "thegullystore": "Stunning, which lipshade do you wear in all your videos?", "poojapooni": "Hey komal it's been so long m searching for this song you played in this video plz help me to find out this song plz tell me the name of this song or singer 🙏", "komolmalhotra": "Keep going Komal! Do tell where we can find that white mulmul suit 🌺", "semicolon_ksa": "Can you try something with a plane black jumpsuit?", "veevamoitra": "Your figure is looking even better than before!", "sassyrash": "Girl u run the world... Such an inspiration ❤ @komalpandeyofficial", "suchikaagarwal": "Hi komal need to know from where I will buy ..the high waist trousers ..you look amazing 😍😍😍😍😍", "ruchikahiwarale": "U r soooo beautiful 😍😍 specially i like ur hairs 💞", "bhabnakashyap": "Too good...😘😘😘😘", "the_simran_sahu": "You're crazy af😍😍😍😍💗💗💗", "aliaarafat_": "You are Love😍🔥💋 @komalpandeyofficial 💞", "monisha.ammu": "why we dnt get these kinda belts 🙄", "s_t_u_t_i": "Where to ger THAT belt!?", "jin_jxn": "Where is that belt from??", "x___krutika_": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥.....", "kakarrishika": "@meenakshi96_ 🔥🔥🔥🔥", "riya_sah20": "Where did you get that awesome chikankadi kurta from? 😍", "a_heart_that_writes": "I wonder where do you get those pants from 🤔", "thesnehabhatia": "Would it not be putting a belt on bare skin cause sweating that results to marks and pain", "kiran_khuranaaa": "Can you do a realistic video for people with normal boobs? And who doesn't like to dress up as if they're going to a South Delhi club.", "keepingupwithshweta": "Nah", "bhavikajain": "Can you post the link for the belt can’t find it on SHEIN", "hazell_gracce": "Hey komal, the video was 🔥... I wanted to know who sang this peppy song? Thanks:)", "bariyamansoor": "@ridhamsingla the last one with the suit 🔥", "withlove.fatimah": "This is like ACTUAL THERAPY💥", "awalkwithlife": "Keep going Komal... 🔥", "_wolf03krrish_": "Like a boss 😎", "renu47662": "U r wonderful...nd u slayed in all the drrsses with that belt....lots of love 😘😍😘💓", "shagun.lal": "Hi!! I recently started following you and I really appreciate the variety of content you are posting❤️ Would you help me in finding finding such corset belts?", "sabr.sayed": "@komalpandeyofficial you're the best one out there on this side of the world with your clothes! And I always keep wondering where you get the pants from? I can never find them on the Zara site :(", "mo_phalswal": "this is so cool @harsh_pranav", "food_bytes_gulbarga": "Indian wear with the belt was just amazing love love ❤️", "aakira_paul": "You are amazing💕😍.", "anindita.jpeg": "Where are your black pants from?", "_._meera_.__": "I really love ur trousers from where do you buy it @komalpandeyofficial", "simrannghosh": "Hey komal please reply I have been trying to reach out to you and show you how I have recreated a look of yours I have worked very hard for the video please see it💙", "meenalsingh97": "komal u r really really beautiful......can u pkz tell from where u buy ur clothes in this vedio😘😘", "usernameoff08": "You look so good😭 bagsss from where ?", "vnicegurl": "Behen tujhpe to sab kuch achha dikhta hai! 😭", "rush_2308": "Where is that chikankari from?", "annie.shiney05": "I love ur black skirt n crop top.wher u GT DAT?", "rajmani25": "Love all the looks but why can't I find this belt on Shein", "manisha.singhchauhan.39": "Why so beautiful every time😍😍😍", "im_pico99": "Love this!🔥😍❤️", "sanjana_1196_": "@kyliejenner in India !!!she has to see this🖤❤️", "agammmmmmm_13": "The 3 and 6 one...😍😍🔥🔥😘😘💕💕", "the.sparkle": "Soo nice", "deekshanarang_theshagirl": "Komal you have set the baaaaars really high. We influencers look up to you. You doing a great job😍keep it pace... Hoping to see you really🔜", "keshavjindall": "Hey, may I know which song is playing in the background?", "man_see_": "I mean first i use to adore you but after sometime i realized that you should change your style don't take it negatively but i think you should try some mix and match apart from your repetitive style...", "crazzyyyy_kupkakes_": "So komal ....tbh I didn't like this video that much ...am srry to say this..but I loved loved loved the one u did with western clothes and Indian jewellery and the one in which u paired a white Saree with a black belt ..and the one which u paired a Saree with the red jump suit ...and many more are 😍😍😍😍😍😍😍😍😍 ...but this one I didnt like that much :(", "aayesha.jeelani28": "Plz.tell me.from where u got that white chikan kurta?@komalpandeyofficial", "purvashahaha": "Totally loving these belt therapy videos", "wsailee": "@komalpandeyofficial you are kickass. Wanted to know where you picked up the black and Mustard co ord set from", "urban_musings16": "Did the guy who left u in college.. Approached u again when u got success??", "anjalimishra0521": "So beautiful😍😍😍", "radhikabisht__": "Oh my god you have give me an idea how to wear a belt and you are such gorgeous fashion styles ❤️❤️", "bipasha0801": "Your usp is that you keep in mind normal people like us and advocate affordable fashion.... Unlike a lot of other fashion bloggers.... A lot of love ♥️", "anmolsrivastava0894": "Where is this first brown suit from??? Love the pants in first and second look. Please provide link", "_jxnviiiii_22_": "O god you are so beautiful🌹 such a diva u are 🤤💕🙈", "genuine_pig": "You are so gorgeous n A glamorous style icon ❤️❤️ You hv a great taste in fashion +ur ideas for outfits is so amazing... I like ur evry sense of beauty nd everything of u ❤️❤️❤️you r also an inspiration as u show how to cope up wd a simple thing into such a beautiful one nd alot more!!! U deserve more and d best ❤️❤️❤️ I hope tht in future may I could be able to Opt the sense of styling like u ❤️❤️LOVE YOU MAM ❤️😍", "swatiiyer93": "Dint know I could wear my belt like that. Perf", "madhurimasamanta": "Hey komal loved your post! But could you post something on chubby girls like me like how to dress up for a party or something? That would be so nice of you if you put up some😊", "akansha.chitchot": "How about some clothing hacks for girls with curves and not having a flat belly Komal ? Can you help?", "hayafathimakk": "Komal mam can u do something for teen like 14 to 16 years old teen can u suggest some styles which look up to our age plz .", "swatilamba22": "Totally love this earthy tone outfits .. Your effort always pays off .. Where are those Co-ords and brown blazer from??", "_nehahahaha___": "You are so pretty💕💕💕Lots of Love Sweetmarni", "theseeker_aayushi": "I am moving to Delhi just so that I could buy all these accessories and style myself the way you do 😍💖 #fashionista", "arpita3815": "I just like the way you carry the things 😍", "_.geraltofrivia._": "Hey beautiful😍😍", "spandana_reddy01": "U can go with anything komal 🧚🏻‍♀️u r fairy 😍", "3a.m.teen": "You are so insanely classy !! 😍🔥 love love ❤", "shruchita14": "It's amazing.... Can u do a video where we can dress up with the basics to give a basic look for a middle class girl.... I hope you get it and for all sizes..hope you got it ma'am.... Thank u so much ♥ ♥ love you ♥♥", "5ft.blogie": "Inspiration ♥️", "umerasajid": "I love you so much🖤🖤🖤@komalpandeyofficial U r such an inspiration 😘😘😘", "plabi____": "Love love love you❤ @komalpandeyofficial ...how can a person be so so so amazing!!! Youre my ladycrush and my inspiration for my fashion style!! And youre each and every fashion therapy is just soo soo soo amazing !! Love you loads❤❤❤❤", "shwetsome": "U are really amazing but m really tired if seeing u in same kinda outfits n almost same colours like brown, white and black n that same hairstyle.. Please try something new na.. Bomb se thoda cutie ban jao pls☺", "shivi_chatterjee": "Beautiful", "tanzina_ador": "❤️ from Bangladesh 🇧🇩", "muskan2284": "I just can't 😍😍😍😍that ochre yellow pants thou😍😍😍this is just insane", "divya_kathare_": "Tht 4th outfit 🤤😍♥️", "bhumikasaraff": "Totally inspirational videos. It is only because of your tips that I can go anywhere without even carrying a whole lot of clothes.. some mix and match and I am ever ready for a day or two out. Thank you for helping us. Keep the inspiration going. ❤❤❤", "riyanshi_y": "U are goddess on the earth your feed gives so much of positive vibes I LOVE YOU ❤️❤️@komalpandeyofficial", "aiiiissshhhiiiii_": "You make dresses look gorgeous as well as bring inner confidence ♥️@komalpandeyofficial", "preeti___33": "As usual on point😍😍😍", "_twink.__": "I love that skirt and top look 😍🔥 you are amazing 😍👌❤️", "sharanyabhargav_3": "You are just tooooo amazing.... And I love the way you match up outfits... You have such amazing shrugs and blazers... Please do a video on them....love💙💙", "mayygha": "I am totally stealing your birthday looks for my birthday this year! 🙈❤️ *wish me luck u hope to slay a little like you*🙈🙈", "jun_laizz": "Hii Komal..!!! You are so preety, amazing,talented and just WOW!!! You are such an inspiration.. I just love everything you do!!! Lots of love to you from Manipur😘", "harshitha_reddy09": "💖", "curlyshma": "You can literally wear anything in many different ways! 😍", "kruti1940": "Hey make detail video on your bed sheet nd all bed essentials plzzzz", "anushka_7655": "You r slaying babe♥️ beautiful as always!!!", "glittered_veins_": "How is ur body so toned and well maintained?... can you plz do a video on your lifestyle... coz your wordrobe is just made for ur... it wont suit evryone.. like a basic girl cant wear all this stuff .... so plzz do a video on body shaping and toning...", "apoo_goel": "Beautiful ❤️", "officially_esna": "Heyy Diii!!! You're totally rocking it!! You deserve more.. The way you present your content is just out of this world... I just wish I could rock everything like you do...you're like my fashion inspired and God, you're so pretty!! Love you lots!! Love from Tamil Nadu", "iayeshaarshad": "So basically you can slay in anything🔥", "bhargav_shanaya": "You have an amazing collections of shrugs and coats.... please do a video on it and from where you bought them... Loads of love ❤", "arinapatil23": "Fashion sense 🔥🔥🔥🔥🔥", "preksha_paliwal": "Move aside everyone, I gotta run and get some suede cord right now. Stat. - the queen has slayed and I am inspired", "__ayvid__d": "You can do literally anything❣️", "roshnidsrivastava": "That last look tho 😍", "muskannt": "Do a clothing haul as well as part 2 of styling basics @komalpandeyofficial", "priapriv": "you❤️❤️", "lakshitakatariya": "Hey there, beautiful✨ Your style is so magnificent and classy. It's amazing how you can style anything and everything so creatively. Loved the second look, though.🙈 Lots of love and power to you, Komal♥️♥️ @komalpandeyofficial", "saloni3_": "You are the fashion icon.. Lady love😍", "richagoel_9": "That brown skirt is from?@komalpandeyofficial", "jess_bgal": "@komalpandeyofficial Ur osm I'm ur huge fan from where you get this idea 😍", "saloni__165": "Justtt lovee ur style❤️nd h huge fan of urs❤️", "vanshikachoudharee": "U r so beautiful Komal... I love the way u style... Big fan of your fashion hacks... Love you lords... So much ya", "kirtidesigns": "🙌 ohh you 😍", "heyitsritsy": "Why soooooo beautiful?? :p Lots of love!", "poojaaa.116._": "I am in love you withhhhh youuuuu and your art which you create with such accessories and clothing 😭❤️", "jhanviiaggarwal": "Only you can slay a belt over suit😍😭", "_mystylesalad_": "That belt😍😍...only you can slay komal🔥🔥🔥🔥🔥", "shikhakashyap4": "Beautiful Dii.. 😍❤️🔥", "kishusharmaa": "u r my fav❤️", "_._.jaishika_._": "How do you look soo amazing 🔥🔥", "karishmaa.__": "U ARE AN INSPIRATION BEAUTY❤️❤️", "yiknaker62gmail": "😍", "l_ridhi_l": "Dammmn😍😍", "yuganshikulshrestha": "How did you started working in popxo?", "priyanka_sarker_": "You are stuunning love❤️ ...your fashion therapy videos are everything 🔥🔥😍❤️❤️", "anupama_kushwaha": "Love love love❤️", "_dark_sugar_": "How everytime you loook sooo amazing 😻😻🔥", "saha_meghna_": "You got sass mam!!!💛", "cheese_dip_nacho": "😍❤️❤️❤️❤️❤️❤️", "__bhavyaa_00": "Are you even real tell me👀", "akriti4animals": "Saw your story came to say namaste", "_an.weshaa": "🔥🔥Iloveyou", "_nubahh": "🌸🌸🌸", "aaliyakhan2709": "Superb🔥 i wish you could style me once in my lifetime🌸", "rakshaa04": "Such a cutiee♥️♥️♥️", "shreyxx___": "Your style is so unique and fabulous❤️❤️", "gautam_aishwarya": "From where did you get this belt?", "priyanka_agupta": "Simply wowwww❤️❤️❤️ @komalpandeyofficial", "delusionalbandi": "Where did Yu get this belt?", "okaywhybut": "The third look was literally damn nice loved the kurti look tooo also i love you dida♥♥♥♥♥♥", "chandana_suresh_": "Wich app do u use to edit ur photos ?", "sonam.sharma7": "Lipstick shade and gloss pleaseeeeeeeeee😭", "rradhikaa03": "Woowww❤️❤️ @komalpandeyofficial", "vanipushkal": "Why you so beautiful And perfect😍😢😘", "shanya_1642": "Hey Ma'am. Which oil do you use or no?", "foodmood.1": "Hey Komal, I really like your style. Do check out my page- 'foodmood.1'", "chocolate_addicted252": "Are those nail extensions?", "nupoora_rk_music": "🔥❤️", "koyena_018": "Ur an inspiration di...I wish I could style like you, although love Ur ideas...Ur one of the best", "ammukuttypulli_1222": "Cute", "artist_shreyaa_singh": "@komalpandeyofficial where is that brown skirt from?? It's gorgeous!", "itsankitaaries": "Amazing Komal... U r so kewl with ur style girl... U r a girl to crush on.. Superb.. Keep going n god stay happy n stylo forever... 😊", "_devikaarora": "omg", "rashmi_nair001": "Kickass stuff... Woohoooo...can you tag where your handbags from the video are from ?", "vihanamanghwani": "Komal, where is the white Indian dress from? Hands down , you’re the best blogger to look up to 😃", "glowenvyc": "Hey guys 👋 I hope this get seen. Checkout my @glowenvyc page, if you are looking for high end International cosmetic & Skincare products to buy! 100% Authentic. Trying to spread the word, If you’ll could like this comment so more people could notice it that would mean the 🌏 to me💛 I hope you’ll are having a great day💕😇", "adk_prerana": "Last one was just wowwwww🔥🔥🔥", "the_fierceferoshche": "Just love❤️ love❤️ love❤️ur styling you rock everytime with your #fashiontherapy I always look forward to see when it’s coming next😍 can you pls tell that round animal print bag is from ? Actually all of ur bag 🙈", "_dhanya_chk": "I woke up n saw this ....I'm obsessed over you ya ♥♥♥you are just perfect girl💯", "aashi_aghi": "Where is this belt from?🔥", "celebtribe": "Love your style💕", "maahikamitra": "You’re gonna sweat through the leather belt", "angiediv": "Last one 🔥", "kavyansha": "Hiii ❤️ how can you be so amazing!!! Watched every video of yours ... although I'm just 14 but still want to dress like you 🔥😭🌹", "clicking.panda": "What's the shade of your lipstick? (It's lovely❤️❤️) @komalpandeyofficial", "_rathi_aanchal": "My absolute favvvv❤️🖤❤️", "kashish_bharali": "You are so beautiful&I love your dressing sense,you're just my favourite💛", "sassy_.soul05": "😘😍😘💯👌💯👈", "suhana_mondal1111": "Fire 🔥🔥", "abhishika05": "I love all your styles", "marriedfriends": "Mast 👏", "completesassy": "How are you always so perfect?❤️💥🌍", "the_meraki_": "What is this song!?", "pooja_rathore2002": "Whtever u wear u looks gorgeous 😍😍😍😍😍😍😍👍", "ms__khatri": "In love with your first, second last and the last look😍🔥🔥❤❤❤", "____freakygirl1005____": "u know what you are a true inspiration for us..i love ur dressing sense...i love you outfits idea....keep uploading your creative dressing ideas... 💞💞💞", "ms.journo_": "Love love the belt styles you have curated 😍I love how you always balance all kinds of styles in your video, some western looks , some traditional , some sporty", "aarushi_beri": "♥️♥️", "therishisehgal": "You’re so beautiful, godwoman💋", "pooja_solanki_gohel": "Where is d last chikan kari kurta from?", "thisstylediary": "Loved all the looks... specially the last one 😘", "adiii._._._": "Freakkk ❤️ Ur the best fashion blogger komal ❤️ like how do uh even manage to stay dis perfect all the time 🤷‍♀️❤️❤️ lotsss nd lotsss of loveeee 💙", "shivii1221": "Love your videos you are truly a style icon💗", "queenhunmein": "U slay girl👌💖 from WHR to get that amazing belt?", "_lil_minion__": "u have amazing co-ords ❤️", "jass_321": "Apke kapre kese hawa me udhte hai hamere to nahi🤔", "tayal1026": "Killer😍😍❤️❤️", "riyamodha": "Awesome 👌", "9819v": "Please re create Bollywood celebs look", "mrunali_songire": "My style icon💕 you inspire me so much 😍 @komalpandeyofficial", "ish_sh1": "Oml you are such a blessing 🔥😍❤️ !!! ...btw please can you tell me where did you get that white kurta....i'm obssessed with you and your style💕🙌👅", "priyanka_madaan89": "❤️❤️❤️❤️😍😍😍😍😍", "khemkapreety21": "Where is this belt from?", "heyitsbharti": "Stunner!😍❤️ All these pants are from zara? @komalpandeyofficial", "__stella11_____": "Am bored of all these same bandeaus , belts , accessories and stuff of yours . Try something new man 💯😬", "mehakkohli.pvt": "Which song?", "not_just_an_architect": "@komalpandeyofficial u r bomb💣... handbag from ??", "srushti2432": "This video was not good...", "kavi_151291": "Beau 😍 Absolutely loved all the 6 outfits but the Ethnic fusion stood out for me! ..and wardrobe courtesy, please?", "shrustijain2903": "Mam some more casual things ... Like college dress n some tips wid t-shirts etc .. please 🙈🙈", "raychelle_kv": "Just love the way you add indian accessories to western ensemble 👌", "riyaslife": "Wow .. I have watched this video like 50 times ..u r my girl crush di..luv u like mad ..😀👍 u never reply to me ..", "thedimpleddamsel": "Love them all 😍😍😍😍", "yellowchips0011": "You're such an inspiration, and oh so pretty 💙😘", "_._be.you.tiful_._": "🔥🔥", "nohin.sara": "Love every look! Wow you're amazing!!💕😍💯", "druhi_._xx": "Ur tips r amazing!💕💕💕💕💕💕💕💕", "norasmommy_": "You are so awesome.. One of a kind komal..", "lil_miss_cuttiee": "When will #komalstyles come?..btw love this❤️", "dagar_meenu": "Hey!!gorgeous lots of love to you💗", "purplepuppets": "Could you do different silhouettes? It's kinda the same now... all very good tho ofc", "gena_serena": "Crazy and amazing thoughts 🔥", "danny.5555": "💜💛💚💙💜 w̲̅o̲̅w̲̅a̲̅w̲̅e̲̅s̲̅o̲̅m̲̅e̲̅💜💛💚💙💜 w̲̅o̲̅w̲̅a̲̅w̲̅e̲̅s̲̅o̲̅m̲̅e̲̅💜💛💚💙💜 w̲̅o̲̅w̲̅a̲̅w̲̅e̲̅s̲̅o̲̅m̲̅e̲̅💜💛💚💙💜 w̲̅o̲̅w̲̅a̲̅w̲̅e̲̅s̲̅o̲̅m̲̅e̲̅ 💚💙💚💙💚💙💚💙💚💙💚💙💜💛💜💛💜💛💜💛💜💛 •👈 VERҰ_NICE ☞• 🌹__💕___💑_🍁__🌹 ───▄▀▀▄▄▄▀▀▄ ──█░░░░░░░░░█ ──▀▄░░░░░░░▄▀ ────▀▄░░░'▄▀ ──────▀▄▀ ───────💗LIKE ❥ ┏━━╮┏┓┏┓╭━┓━ *)(* ┃┏╮┃┃┃┃┃┃╭┛┃┗┓ *))((* ┃┃┃╰┛┃┃┃┃╰┓┃┗┓ *((❤))* ┗┛╰━━┛┗┛╰━┛┗━🍃♥🍃 ╬╬╬╬╬███╬█████╬╬╬ ╬╬╬╬╬█─███───█╬╬╬ ╬╬╬███─█─█─█─█╬╬╬ ╬███─█─█─█───█╬╬╬ ╬█─█─█──██─███╬╬╬ ╬█─█─█─█─█───█╬╬╬ ╬█─█─█─█─█████╬╬╬ ╬█─█─█─███╬╬╬╬╬╬╬ ╬█─█████╬╬╬╬╬╬╬╬╬ ╬█───█╬╬╬╬╬╬╬╬╬╬╬ ╬█████╬╬╬╬╬╬╬╬╬╬╬ 💜💛💙danny.5555💙💛💜", "rashalya_accessories": "Ohhh myy❤️❤️❤️❤️", "surabhi_mauryaa": "From where you got this belt", "dhirkitty": "Goddess❤️❤️❤️❤️❤️❤️🔥🔥🔥🔥", "manisha.y7": "Last One was the Bestest❤️", "karishmajuyal": "@komalpandeyofficial where did u get that kurti from. Also I love you❤️", "thejyotilakhchaura": "OMG!!! Amazing. ❤️❤️ More power to you @komalpandeyofficial", "zoyaadnan9": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️😍😍😍😍😍😍😍😍😍😍😍❣️❣️❣️❣️❣️❣️❣️❣️❣️❣️👍👍👍👍👍👍👍👍👍👍❤️❤️👍❤️❤️❤️❤️👍👍👍👍👍👍👍👍👍👍👍👍👗👗🧥", "akshatkiransinghh": "And I thought that the belt was to make pants stay 🙂😂😂", "vplovesicecreamm": "Amazinggggg❤️", "_tiashasarkar_": "Basically you wear something which suits you only. 😪", "tanviwalia2008": "Why Did you left popxo", "yussrawaseem": "Pyari lagg rahi hain", "swarnim_santosh": "Always wanted to write some comments on your creativity but as always I'm running out of correct words which could match the worth of the work 🔥 but at the same time when I see the unconditional efforts you make in commenting back each one of them, couldn't stop myself from just saying you \" Hi ma'am, I'm glad you exist!\" ✨ @komalpandeyofficial", "parneetksaluja": "@ramanksaluja", "saniaayushi": "Quite like the background score you choose!! ✨", "priyadas_96": "@komalpandeyofficial You're always rock ♥️", "nancyhalai": "I too wanna be a fashion blogger and I aspire to become like you one day! Your such a hardworking soul <3", "priyankasardar29": "Omg you look so beautiful in all the looks. 😍😍😍 PS - where is the white kurti from? 😅❤️", "viadristi": "Oh mai it's again a visual treat!! I loved all the styles but i must admit the last one was my favourite!! >~< 💕", "themissyco": "The trunk we sent you makes such a cute background accessory! Hope you like the outfit as well 💕", "tag_that_trend": "Lovely", "nawal.mirza.97": "@komalpandeyofficial Brown suit from?", "sidra.arshed": "please change your moves i am literally tired of seeing u moving like this", "ipeacefulsoul": "@komalpandeyofficial Is it comfortable to wear belt directly on the body?", "urviiichauhan": "Komal where do you get your high waisted pants and jeans? BTW absolutely LOVE your style 🔥", "exponential.u": "I hope someday I could look like you 😊 and as I always say you are goals when it comes to style and dressing 😊", "rupsa09": "You are such a talented woman!!❤️ loved all the styles by you!❤️🌹", "roshni_singh_080": "😍😍😍", "the.dreamy.sparkle": "@komalpandeyofficial you're already a stunner so what else to say❤️", "manisha_hlnkr": "I love only the last one with ethnic!! It's amazing", "prishadand27": "Ahhh!! You are sooo pretty 💖", "positivevibes675": "Boring", "_aadhirraa_": "How do u manage to look so perfect everytime😍btw the video is ❤️🔥 @komalpandeyofficial", "nishaagrawalofficial": "Belt is sold out 😫", "sumana9055": "Where's that chikankari kurta from? Please tell me", "faiza.2617": "Hey @komalpandeyofficial love the last look...can u tell whr did u buy this white chikankari kurta plzzz", "vanshika_1720": "You are Super creative🙌🙌 simply awesome 😍❤️", "gypsy.girl.world": "Hi! Komal, The video is amazing❤️ Also, wanted to know from where you bought your beige and mustard pantsuit from?", "e.jakhar": "White dress favorite one ❤️", "itsme_siree": "@komalpandeyofficial u can literally style anything ❤️.you are insane", "vastr.creation": "Where is that white kurta from? Totally crushing over it♥️♥️😘😍", "bhavna_919": "Nothing special", "bratati_mondal": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "aishu_1903": "Last one was bomb😍🔥💥", "the_high_priestess6": "@komalpandeyofficial such a grace you're , more power to you girl♥️", "ankitashw3": "Can u tell me ur lipshade pls😍", "neelam_rj": "Please do a video for curvy body..", "meghaa16": "Loved the last look with the Chikankari Kurta! 😍😍😍", "lalisasarah_insta": "I'm tired afffff.....by watching only you wear that blazer all the time😑😖😖can u wear a diff one??", "samruddhikhadse": "Lingerie video please !!", "goldengirl_sonalika": "Love it Komal 💕", "sonalrg": "Loved every single look to bits ❤️😍🔥 #slayqueen @komalpandeyofficial ❤️😇😍", "sristy_sunuwar_kiraty": "Amazing 😍😍😍", "parineetaprimrose": "Hello @komalpandeyofficial ❤️ Please Help Assam in Assam Flood. Assam is devastated right now. Lakhs of people become homeless. Animals are dying due to starvation and flood. Please Help Ma'am. Please. We, the people of Assam really need help, support and relief of flood. All celebraties, media were helped in the flood of Kerela, Odissa, Bihar. And when it comes to Assam there is no one to Help. Please HELP ma'am. Thank you :-)", "parvatimahiya": "My daughter looks like you @p_hubi ☺️☺️", "nebula_nomadique": "All the looks are nearly same in ur all the videos.totally disappointing!", "sache_bagstalk": "Love the belt♥️😍❤️", "_tanvir_1980": "Where so u have these ideas and thoughts of being sooo creative", "_thesweetestharmony_": "We the a link to that belt first😍", "jyotiverma4614": "Miss hotty🔥🔥🔥🔥", "sejal0499": "Im sorry but this time i didnt find anything comfortable or wearable 😢", "_a_sinha_": "Prettiest😍", "pratibhamoolchandani": "I know you are a Boss lady😍❤️ But just one request! Please smile with your teeth showing in your next fashion therapy❤️🤗 love you!", "that_gal_in_saree": "U are my fav blogger...chic girl♥️", "whateverrrr.x": "Hey Komal! I loveeeeeee the way you style😍 You're so amazing and so inspiring.🥰 Also , a suggestion / request - Can you please style some casual outfits which can be worn everyday by teenagers , pleaseee😋 . Lots of loveeeeeee❤️ xoxo.", "__bardhan_shweta_": "Behen humare pass itne paise kaha🙄😢", "_aliisshhaa_": "❤️❤️❤️❤️❤️", "___zoya1": "💕", "_miloniiii": "Amazing!!! I liked the one with the kurta!!😘😘🥰🥰😊😊🔥🔥", "shalini.murarka": "Ol looks r just hotttt🔥😍", "the_obvious_girl": "Didi, you are always the best🔥", "pranjali.11": "BEST!!!!❤️", "a_lilbitofvogue": "Hey thats my favourite belt", "dear_ad_rita": "😍😍😍😍👌", "ashmitmishra1908": "Hey can u make more on how to design this belts with Indian wears n more party wear", "sana._218": "I really really love your fashion sense and how you carry normal and boring clothes in fabulous ways😍😍❤️❤️ I hope I can be an amazing, beautiful and inspiring fashion icon just like you when I will grow up😍😍😍 Keep inspiring and Really really want to meet you soon😭❤️❤️😍😍😘🔥🔥🔥♥️💋💋♥️", "hanaa_k12": "🔥😍🔥", "tasneem.m.kapasi": "Best one was the 3rd one 😍 did not like the 2nd and 4th.. rest were good... 😍", "akankhya_nanda": "@ridhima_t 😍", "sakshi0_1998": "U are awesome like literally an inspirational for all❤️🔥", "a_singh_chauhan": "Why u r hving so much talent into u😑😑", "_thecareless_soul": "Superb😍😍....you just rocked all the looks....loved every look😍😍😍💙", "ruhi195": "@komalpandeyofficial could you post details about your belt please! Its amazing", "sharmanehar": "Smile at least here n there u look really good", "subica_sabir": "Love your style 😍", "perfect_being_not": "Where is this belt from!", "pooja_travelbug": "Song name?", "timeless_jwellery_store": "Follow us guys for beautiful collection of jewellery at affordable prices...do visit our page once.. @timeless_jwellery_store ♥️", "pragyan_16": "Song and the artist please 💕 @komalpandeyofficial", "sonali_shreya20": "Hey komal ...that white kurta from???", "samidha._.dhiwar._.unicorn": "Yeah!!! Sassy queen 💙💙💙", "afia_z": "Best was the kameez 👌👌👌", "definitely_not_cheesy": "Apart from your fashion things, I really like and appreciate you as a person that you are. Have been reading a lot about you from quite some time and I really am a big big fan of yours. Stay the way you are and stay blessed!🖤 💙😘 @komalpandeyofficial", "sayli.dalvi": "Ohhh I loved it with the jumpsuit....its so casual and can be worn anywhere.... And yes....you look gorgeous....thats pretty obvious😍💖", "itsmepalak___": "Hey Komal ! Love to love you. You be the best. Always with a unique and different idea. You're outstanding. You're amazing. 😘😘😘😘 Lots of love and good fortunes for you. ❤️❤️❤️❤️", "prvthaibro": "Oh gawd!!! ❤😻 I cant take my eyes off from you @komalpandeyofficial ❤️🙈", "surabhi_2102": "this video and all your videos are so soo awesome...🙈🙈especially last one...in suit you are so beautiful 😍😍🙈🙈", "vruttichheda": "You can literally rock any boring outfit in a way no body thinks is even possible. I think you should make 100 ways to carry the outfit videos too🌸. Lots of respect. Your loyal fan❣️", "ipsa0001": "Cn u make smthmg abt footwear...lyk combos with dresses of pencil or block heels etc @komalpandeyofficial #FashionTherapy", "dr_neha_kamathe": "We want a video on ur blazer along with styling nd frm whr do u get it", "arshireyaz123": "You are just 🔥🔥🔥🔥", "riddhipatel_1701": "Amazing 😘😘😘❤️", "notyourbaebuddy_": "@komalpandeyofficial start tagging your clothes as well pleasseeee. ♥️", "its____alishbah": "Stunning fab you are so aswm love you !!divaaa fashion teacher", "neetal_naik_": "Where’s that belt from", "nikita_burdak": "Please please please do a styling video on size 12 model♥️♥️ i really want to see if your fierce styling has the power to make every size look comfortable and amazing.", "jasrotiatashu": "From where u got this mustard plazoo", "gayatrid06_": "Why did you changed the location? It was really pretty one with the swing 😍 @komalpandeyofficial", "aru_ki_rooh": "From where will I get this belt ?😥", "chitra_jhuriya": "Five! Five is my favorite❤️", "oisika19": "Best!!!! ❤️", "shristygaurav": "Can u plz tell about the white kurta u styled with the belt... From where did u get that kurta", "nishthakandoi": "Love your styling! If you don’t mind telling, where do you get all these coords from?", "radhika_2065": "Queen😍", "meghatak97": "You 💓", "sharleen018": "i love your wide pants ,where from?", "rashirane_": "Loved it💕💕 Please do a video on how to style a mini dress in many ways... It will be so grateful...💋💘", "arora_diksha_": "Which song is this?", "its_a_humanthing": "Literally You are the reflection of a therapeutic fashion who is much potent enough to heal my all ailments regarding all my fashion stuffs.A true inspiration I 've come across.❤️", "pratzp": "What song is this .....I really wanna know", "__snuggle__kitty": "How can someone be sooo good at fashion!!!!!!💕", "prajukta_1605": "Belt with a suit! Wow!! 🙌", "tarrini_chandra": "I hope u read this komalllll!!", "roly.polyy": "Indian one was surprisingly wow wow wow😍😍😍😍😍... @komalpandeyofficial only you can surprise us in this way.. 😍😍😍😘😘😘 God bless you 😘😘😘😘😘😘😘 loads,loads love😘😘😘", "pinka_3012": "In love with every outfit😍", "sanchitanandi": "Loved it babe❤️", "meghajain2308": "The first look with suit and the last one with kurti were the bestest! 💛", "r_anchal_mahar": "Wohoo so cool😍", "dishasen79": "Ma’am can you do a lingerie video for wearing clothes", "twinkle_naik10": "Which song is this", "megha_rawat02": "Oh god. You are just so perfect. I can't even 😭😭😭😭😭🔥🔥", "amazingly._.yours": "Hello komal, just wanted to let you know this, I only wear a burkha everywhere i go and i dont need any fashion therapy but i still love watching your fashion therapy videos and your youtube vidoes because it feels so amazing to watch such creative outfits being worn by you and it is like my favourite past time to watch you being innovative with those pieces of clothing, I just love you Komal!!❤️", "eliharana": "Last one🔥", "hina__farman": "Slayer...😍", "13anjali_pathak": "How to be like u", "__beard_boy0819": "You are such a inspiration to all young girl's.... 😍😍...ur style icon 😍😍🔥@komalpandeyofficial", "anamika12_rk": "Lovely dear 💞 you are best 👑♥♥", "richashahii": "u have crazy ideas 😍 ....love your work a lot 👌👌", "rayyansshaikh1": "You are looking so beautiful and stunning", "goodfood_by_jaya": "Wow!!!! 😍", "ankitagupta0808": "Awesome 👍... Loved the music by the way..😍", "thebling_story": "Every look is styled perfectly😍Love it♥️And I am gonna try some of these😁👍🏻", "vaibhavi_sathe": "Eye-catching🔥😌", "_._dipshikhaaaaa_._": "You're magic❤️", "anushikasahni": "Really like this video♥️ where is the white suit from ?😍@komalpandeyofficial", "sowjanya_bora": "@komalpandeyofficial Hello Mam, Definitely you have a great great great opulence of fashion sense but also you have been a great motivator 💗 You teach that nomatter what so ever be the matter keep going and you will reach your goal..Whenever I am in a bad mood I just go through your videos..see you always working hard and get to work again 💗 Thank you ❤️", "diya5354patel": "Oh god oh god going crazzzyyyyyyy again... love love love @komalpandeyofficial 😍 the printed skirt n top wala look is my fav... plzzz share urs too😘😘", "_.soumyasamrita._": "You're my inspiration komal!!!!! Love love love ❤️❤️❤️❤️💋💋😘😘", "_raima_sen": "Hey can you please make a video on Sustainable fashion choices !", "ishma_19_grover": "The last one is🤩🤩🤩🤩💙💙💙💙 I love the way you style it everytime💙", "highlifexplorers": "The bag in the last look you’ve put together, can you please tell me where’s it from? Also, A M A Z I N G as always 🔥❤️", "afreen9701": "Lit😍", "that_style_mermaid": "What have you done, u gave no chance to people to complain that this is not wearable @komalpandeyofficial btw u look beyond gorgeous", "the.captivative_eyes": "ughh someone just pinch me ...man today I woke up and the first thingh i saw was this video...you are looking lit🔥🔥🔥 and the one with mini skirt and brownish top and belt is my favourite....i love u 😙😙😙😙😙", "theskevibalar": "Only u cn do dis😍😍😍", "_sashhhhhhh": "Woahhh😍", "rhurhy": "Where’s this belt from", "sussane_gangmei": "I really love ur belt ..😍 wer DD u get from???", "meghnaghosh": "Where is the last outfit from? That was my favourite 💓", "humerakadri": "Styling shift dresses with jeans to give that everyday look. Please do that. Thanks in advance. 😁", "suchandra_mad_squad": "U are always perfect di😍😍 always killed it like a pro😘😘india is proud to have a fashion influencer like you my love❤❤", "_piya_d": "❤️❤️❤️", "janvi.balwani": "Damn woman you can pull off any look 😍🔥", "simrann995": "This is amazing...you look beautiful in every outfit..you're such an inspiration 😍😍😍", "introvert_kd": "Nahi maza aya iss bar @komalpandeyofficial !!", "chanchal.mishra": "Exquisite🔥❤️ Awesome damn awesome🔥😍", "nidhi___pandya": "You're amazing ❤️ Everything suits you 😍😘", "tanushreeb913": "oh my god ,is there any outfit she can't slay ? drop dead gorgeous <3", "seldon_tenz": "These are my favourite ❤️❤️❤️❤️❤️❤️", "sameena_gonsalves19": "Content is so repetitive! Outfit styling is almost the same in most of your videos.", "snigdha_dey14": "Lipstick name?????🤩🤩🤩🤩", "vedi_sha": "This looks awesome! I especially loved the Kurta one. ❤", "x.pretty_me.x": "You have your own unique amazing style , keep spreading smiles and positivity. 💕", "shinchan_sithe": "The most amazing thing is your traditional looks with belt.. It's really wow ❤❤❤.. Keep it up ❤❤ lots of love from Bangladesh ❤", "_ashruti_98": "Belt from?", "minal123_22": "Omg you are just love ... I love you so so so much ❤", "organiceit": "Where is the skirt from ???", "thechandanashetty": "Impressive 😭😘💯", "rixy0206": "Please share the details of all the outfits", "harley_quinn_hahahha": "You are such an artist... I really love the way u style each outfit.... n u carry the look with such a great confidence..... I really look forward to ur Fashion therapy videos.... u r such an inspiration", "m.june_girl": "only u can style it with kurtiz like this.....love ur style.", "tinker_bell_twin": "The 3rd and 5th look 😍😍😍", "debasmita__nanda": "Setting goals like no one 😍😍", "pritika_b.2": "you inspire me ❤️🔥", "shards_of_shine": "Oh my... esp the last one 🔥superb 👌🏼 didn’t expect it would look great with the ethnic piece too ❤️", "sheiscapricorn": "😍😍😍😍", "babitabajgain": "I am so so in love with the last look really want to try that one out😍you even did that with one of your sari look and it's kinda like love at first sight with that look😅anyways loads and loads of love to your way♥♥ I have stated it so many time please don't find me clingy😅😅have a nice day♥♥😘😘", "__hotcupid_______": "Plzzzz komal maam come to Assam! U are an inspiration! So obsessed alreadh💕💕💕💕♥️♥️", "kat_diaries": "Styling on fleek always", "priyanka_sondhi": "@komalpandeyofficial You are such a sweetheart Darling.. the way u carry yourself is just mind blowing.. I love you .. u're such a sweet heart inside out.. ❤❤❤❤❤❤", "meetimadhu": "@komalpandeyofficial the another Sara jesika Parker plays in ths amazing....... Just in love ❤️", "shreyaverma27": "Bomb Komal bomb.. aag lagadi !! Especially the one in which u wore belt as a strap for top. ♥️you're too good", "annsarkar_93": "Please your outfit details😭", "iakankshamahajan": "Can you list the details for all your outfits ? They are all so gorgeous ❤️", "larkspurrrrrr": "Omg that belt is amazing!! Also I loved the ways you styled it Komal!! I really love your style!❤️", "shopaholic_sweeni": "💛💛 So unique! And you look beautiful in every outfit ! 😍😍", "thebellevogue": "You ladyyyy❤️❤️❤️", "avinash_poojary": "Videography 💯 editing 💯 styling 💯 attitude 💯 totally perfect 👌 video", "deepkaur9811": "Love love 🔥🔥🔥", "siddique_insiyaa_99": "u have a great sense of styling normal clothe into fashionable. I adore your way of styling ♥️", "mickymac.anu": "How do you maintain your figureee😭😭 plzzz tell meeee... it's my dream to have a figure like youuuuu😭😭😭😭😭❤️❤️❤️ I LOVE YOU SO MUCHHH KOMALLL WATCHING YOU SINCE 2012♥️♥️♥️♥️♥️♥️", "smartysmrati": "Awesome 🤩 hey Komal can you plz help me with the link of this song..", "varshachauhan_": "Ohhh mannnnnn !!!! You are sooooo amazing ... I love you 😘😘 Hope to meet you some day", "thecosyvibe": "Where can we find both seasons?", "nandini_sharmaa_": "Such a beauty ♥️", "zena.mua": "Your always best❣️", "mepalaksharma": "Pants from ? @komalpandeyofficial", "aachal_mukherjee": "Omg I love this. You are so freaking amazing. How do you this, how?😍😍😍", "missshayna_97": "Never thought that a belt can also go over salwar suits..you girl left no way to amaze us with ur stunning fashion therapies..😍❤️❤️ #bighug🤗andLove❤️❤️@komalpandeyofficial", "the_pos_vibes": "The last one is preferably cool to handle your chunni with style♥️♥️♥️", "khushboo_fakay": "On point always🙌🙌🙌🙌🙌🌺🌺😙😙😙", "outfit_inspiration_id": "How to style ruffled saree?", "arya_inertia": "The third one!!", "anantsharma575": "Stunning", "swastikapandey.__": "❤❤❤❤❤❤❤", "richa.choudhary.06": "ALSO YOU ARE GORGEOUS AF🔥😍😘❤️", "unick_soul17": "All time wait for #fashiontherapy ❤️hamesha ki trha unick nd different🌸", "gaura_muthreja": "You are unstoppable , queen🔥🔥🔥🔥💜", "taanyaa4": "This is so innovative idea dude! 😍 will definitely try these looks!😍 keep Growing ma'am!🌹", "_nonstopblah": "You style up every clothes so perfectly😭❤️", "vaishalibatraa": "This is insane😍🔥 You. The Best💋", "shivi_sharma1307": "😍😍damn!!! Whenever i think that's it you come up with these, amaze us !!!! 🔥🔥 or Kya bcha h ab 😂💓love yaaa", "__dabongwerido__": "You are so beautiful and talented. You inspire a lot of people through many ways. You have also inspired me alot and I am really grateful for that. I love the way you carry yourself. It's so amazing. Just to let you know that we love and support you alot. More way to go. YOU DESERVE THE BEST ❤❤❤❤❤😘😘😘", "t.r.i.d.i.s.h.a": "You're such a creative genius when it comes to fashion. Keep going @komalpandeyofficial 😍", "venika06": "I love this belt.. I have it too.. I has changed my life..😂 Love the way you have styled all your outfits with it.. You are an inspiration 😘😍❤️", "koke_penned": "You are sooooo awesome 👏 I love love love you and your content is another level", "nishagarg2999": "From where did u buy anarkali suit that u were wearing in ur last videos...that white one with stiped shoulder....i m obsessed with dat...plz plz plz tell😍😍😍🙏🙏", "nalini31": "You lookkk the besssttteeesssstttt in Indian 😘 so beautiful", "fatima_abid356": "Komal plz tell me a good moisturiser for dry skin. I love uuu❤️", "darshanarramgiri": "You Inspire mee... love you", "imaishwaryaj": "Outfit details please ?", "caughtinavibe_": "So perff😍😩😩😭😭", "tanya.2102": "This is just so so amazing ❤❤", "chandathakur": "Love love love ... your style @komalpandeyofficial. ♥️", "mywishoky": "The video quality is not good @komalpandeyofficial can't see clearly😭😭", "ur.looking.at.me": "You never fail to wow us .. 🔥🔥🔥", "simransehramua": "That was freaking amazing♥️", "riya_athanikar27": "This is so so useful😍 Thank you!!", "eniths.world": "♥♥♥♥♥♥♥♥♥♥♥", "acoustic_udit": "Love your fashion sense😍😘❤️", "hrishikesh_y": "💞💞🔥🔥", "shivangiraawat": "@komalpandeyofficial belt with the traditional wear was damn stunning. 🔥🔥.. Lots n loads of love.. Keep going with stuff like this.. ❤️❤️", "the_devanshika": "@buty_bhoomi234", "onlymosquitoes_cansuckblood": "God made Komal Pandey because he thought that one day the world will become fashionable just beacause of her ..........#komalislife", "swati.kandhari": "Darshan 🙏🏻", "ms.sdm": "Girl you inspires me to work hard like you put way too much effort for your videos which eventually motivates me to study more and reach my goal.....And CAN YOU HELP WHAT TO WEAR FOR THE CONVOCATION CEREMONY as I will be receiving my degree on 23rd it will solve my problem ....Takes @komalpandeyofficial for being so consistent on YouTube ...", "navdha_06": "Never thought of using a belt in this many ways.. Wow ❤️❤️", "rutuja_910": "Just wanted to say this.. That so many of them were repeated..though each one of them was good.. I wish u shouldn't hav repeated the outfits", "regena_phalange": "Can you please help me out with the footwear that you are wearing? Where can I get it.? Pleeeaaaasssseee.😭😭😭 It just goes with all kinds of clothes. @komalpandeyofficial ❤️", "_poornima_natesan_": "Ohhh goshh🔥🔥!! You are the only person who can come up with such creative ideas😍!! Lots of love♥", "hannahgahlaut": "OHHHH MYYY LORDDD, 😍♥️", "jazz_kaur1113": "You slay every look Gorgeous 😍🙌😘", "pallavisharma0912": "Can u plz make a video on affordable linen blazer 🤔", "anjali_bo": "This is insane😍😍🔥", "lordxlegend1": "Where can I buy these pant you're wearing... they look amazingly good♥️😍", "kotka31": "Please share some tips on how to become influencer?? The actual process 😬😬 and M your biggest frn😘😘😘 you’re my inspiration 🔥", "handycandy49": "Please show us the back side of your look too @komalpandeyofficial I really really love your ideas😍🌸", "aanya_aggarwal": "3rd and 4th outfit details please ♥️😭", "_.surbhi.__": "You are the best in making these fashion therapy videos.. You justify the title these videos are so therapeutic. 😍 You are so talented @komalpandeyofficial 🔥", "sohinilahiri": "😍😘😘😘😘😘😘😘😘", "crazy_catlady_101": "I really admire your style...it's so chic ....😘😘😘lots of love♥️♥️", "snigdha_halder": "Love how experimentative you get.", "aasthaaa11_": "Love your style and you♥️🌎", "zeb_zaidi": "Hey! Just love the last one ♥️that’s super cool 😍", "__deboleena__": "Slaying as always 😍🔥... Belt with white suit was 🔥🔥... Love you!! ❤❣", "thecupcakefashion": "Hi ❤️ can you please tell me in your fashion therapy season 2 the swing set up you have done with that swing .... From where did you get that swing stand and the swing ... I have been searching for it from days ...", "_tejalll_r": "Hey gorgeous❤️❤️love you💕", "nyla1880": "Where is the white chikarkari Kurta from? That’s my favorite look.", "hritika.aaa": "Yet another stunning video", "upasanagadhvi": "How do you manage to be beautiful all the time❤️😣 ... i adore you a lot @komalpandeyofficial 💜💜", "beautyndyou": "What kind of bra have you worn under white kurta?", "nehasharmaa_13": "Amazing videos @komalpandeyofficial .. Keep doing this❤️❤️❤️.... This is the new gen fashion😍😍😘😘", "_.go._.doodles._": "I really love you komal... You are an inspiration for every girl.... You give us confidence... How to look beautiful in our own way... And to dress up for myself.. Instead of others... ❤️❤️❤️❤️❤️❤️", "geet_bhil": "SOOO GOOD! What have I done good to be blessed by this heavenly feed!!!❤️", "vaishnavi___pathak": "Happiness is waking up to this.💕 Now I'm sure today's gonna be good day. 🌸 @komalpandeyofficial you're simply adorable. Can't express in words how much I envy you. 😍", "ankitasingh882": "@komalpandeyofficial I really loved all your videos but i want you to do a video on how to carry a long skirts 😍😍😍", "neharikasharmaa": "I have adored ur fashion skill, though as a silent spectator, but here I would like to mention that this episode is more like a tick in the box. You're more capable. Just an advice. Please don't take it otherwise. ❤️❤️❤️❣️❣️❣️", "11sk09": "How did uh maintained ur skin glowing when u were a teenage an unlucky teenage with lots of pimples 😭😭 still love Ur skin 😘😍💞", "anisamaity": "Wooow amazing... Soo many ways to style a belt.. Awesome... U r becoming statement day by day... Uhh komal we all r going maaad about u.... This is freaking amazing.... Ooooo I m going crazy... My fvrt was of course the Blazer one and the long skirt one.. Love u gurll.. Keep killing... We r always there for u..... LoveLove our queen 😘😘😘💛💛💛👸", "rashmi__1042": "okay how you dress the accessories with indian clothes is way beyond imagination ❤️", "shilpa.muniraju": "Stunning is an understatement for u n your fashion game❣️❣️❣️🔥", "minion_672001": "You are lit!!🔥everything just suits you !!❤", "sohoney._": "Can u do one on how to style a tshirt?", "j_u_e_e_": "You are just 🔥🔥🔥 Love you ❤️ @komalpandeyofficial", "yadav.jyoti1099": "@komalpandeyofficial not just a name, it's like a brand. You gooo gurllll!!!❤️", "la.charmante.style": "Wow it's a crazy cool stuff♥️ thinking out of the box thing♥️♥️ @komalpandeyofficial", "shahyadavi": "😍😍😍😍", "jain_mini": "fantastic looks 😍", "___miss._.roy___": "Why you so gorgeous? 😭😍", "shail_shree_sak_sena": "U r so fantastic..❤️", "anmol_bedi_19": "You're great when it comes to styling belts..😘", "onemessygirl": "Your fashion therapies are the best♥️✨", "messy_vissy": "🙌🙌", "shreya_mahar": "How can you be so amazing😍😍", "im_akangsha": "My fashion diva❤️❤️you are always the best🤗", "sonali_071": "You are just too good!!❤️ So creative!!", "shanaya_dash": "Keep slaying queen ❤😚", "tulika_nb": "Love love love! ❤️", "stylish_diaries7598": "belt with suit 😍😍😍😍😍😍", "hakanisungoh": "Boss lady! You are literally one of my favourites! Can't go a single day without watching your videos.😭🔥😍❤️", "more_offme": "Amazing 💝💝", "anshu_6403": "Wow ma'am they way your fashion therapy videos are has helped me a lot thank you ma'am 💕", "waysheblushes": "This belt has gone out of stock already 😂😂 after seeing this video, now I regret not buying it in time 😭", "notanightdreamer": "Hope to dress up atleast half like you some day😍❤️❤️", "nimishagupta_29": "The second last doesn't make a difference..... The belt is hardly seen 😪", "kaurrrr______": "Di, you are the best!😭❤ Can't describe how much i am obsessed with all your fashion therapy! Just love love and love to you!! ❤", "alleey_aaqua": "The first coords piece is from ?", "_.s.i.d.d.h.i._22": "Your videos are just amazing. I am just love with you dressing sence 😍❤️💕", "sameeksha_charyani": "I really love ur style😍 Keep up the good work🔥💕", "comelgoel": "Hey, from where u got this broad brown belt?", "vaishnavihere": "My favourite ones are the 4th look and the suit one😍💕♥️", "befierceand": "Here comes the queen of kickass fashion 🔥❤️@komalpandeyofficial", "ananya.amar": "omg ❤️ this one is amazing ❤️", "meeenal__": "I love youuu😻 you're such an inspiration to me😍😍", "always_late_but_worth_it": "@komalpandeyofficial You are gorgeous! And to be honest! So innovative ❤️ You deserve a call from @ted", "dr.notso_typical": "Love love love😍", "poeticc_chaos": "East West, Komal Pandey The Best 😭❤️", "sristi.m": "Hi komal di... I am Sristi from kolkata... I am one of ur biggest fans. Many a times I asked u that when r u gonna visit kolkata. Pls come to kolkata. The city of joy has many followers of \"komal pandey\"...pls reply.. N lots n lots of love from Bengal.... Keep going😍😇😊😍", "_rushmiii": "The white suit look was the prettiest 😍😍", "neha_kashyap.01": "The first thing to lay my eyes this morning on my feed. You be the Diva ❤️", "niharikamathema": "Loved all the styles but my most favourite hands down has to be the last one.❤️", "1neyoubysujayasrivastava": "U are too good❤️❤️❤️❤️", "nikxx08": "Damn!!😍 This is crazyy. Komal, when are you coming to Bangalore?😘😘", "tffblogg": "@komalpandeyofficial love these episodes 💕💕💕", "sadgisrivastava": "😍❤️😍always comes with the best therapist ❤️ @komalpandeyofficial #inspiration#inspire 💫", "ananyayerra": "Love this! ❤️ Where did you get that belt from ?", "shruthika_shetty": "You are amazing ♥️♥️♥️", "pranjalpatil28": "Your fashion tips are always helpful ♥️♥️", "anchal3608": "Again🔥 Dis z something I'll luv trying! U r amaaaaaaaaaaazing ma'm .😘", "tori.amandous": "You are soo awesome komal di🔥🔥 i really love ur each n every style... Love you from prayagraj❤️", "akanksha_surin": "You have a great sense of styling normal cloths into fashionable. I adore your way of styling. 🔥", "kcnstha": "😍😍😍😍😍😍", "drake_sis5": "How can someone slay all the freaking time🔥🔥🔥😍😍😍love love love❤️❤️❤️❤️", "shrushhtii": "This are no way comfortable!!!! Komal pls bring some realistic stufff🙏🏼", "sanskriti_x8": "Dont you feel @komalpandeyofficial styles are getting similar ❤️ ! Big fan of yours though love love ♥️❤️😍😍", "artworld_2909": "OMG that white suit haven't thought that it can be done", "bizarre.life": "Always creating something very new and creative ! 💞💞", "sujeetxgawade": "Slaying in it every single time ❤️queen", "miss._.abhipsa": "U r so beautiful and pretty ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "annahgautam": "This is wowww💕💕", "broken__butbeautiful": "Slaying in Every video❤️ such a queennn😭@komalpandeyofficial", "simran.kulkarni": "This is so good! Loved it ❤️", "anuradhamohan92": "Wow .. loved it. @komalpandeyofficial could you please let me know where you get belts and bags from. I love all of them ❣️", "deodharesha_24": "Adorable❤️❤️❤️", "shivani_bhatt": "Girl, I always had a feeling that Indian fashion influencer scene is definitely spectacular but that's it- not informative, not helpful but damn I love your new videos sooo much! Really helpful! Keep them coming. Also, idk if you'll read this but these belts you show, the styling you do- idk how that'll look on a big girl like me. How about a video series where you style big girls and women with full bodies? Need inspiration!", "roooooopal": "Always So gooood 💓💓💓 @komalpandeyofficial i need to buy that straw bag can you please refer some good places/sites??", "priyankagotsurve": "😍😍😍", "ananya__1298": "Wow!❤️", "siyasanu45": "Why do you wear same dresses for Evry video kuch naye kapde pehno", "womanonrampage": "Love love loveeee❤️🔥", "tanv_s": "I love belt paired with the white dress.. 😍🔥", "diva_only_diva": "Love love to it", "pasta_n_vino": "Love Love and Pure Love❤️❤️", "thecozzy.xo": "The 4th one..... 😍😍😍sou are slaying why always on point", "anjaliraturi1": "I love you sweety...♥️ you just inspire us with all of your videos...🌺♥️", "debalina_nath_official": "Wowwww😍😍you are amazing", "shrav_1509": "You are my ultimate fashion inspiration 😍😍💕😘😘", "design_by_dikshaverch": "You are amazing 💕❣♥", "k0malmundhada": "Completely justified.... Everytime u just nailed it... Lots of love from Pune😘", "_itsmesakshii_": "In love with your fashion therapy💞", "celestial_r": "I don't know what to say, you never fail to amaze me. More love to you along with all the positive energy.❤️", "miss_shivani_rajput": "Wow...u r looking fab..", "sejal_singh7266": "You slay di always hope u look like this always even at yr 80s 90s 100s", "shivangikalakoti": "I couldn't even think about this one, really how do you do it!!! An endless talent yo have🌹❤️", "alvinurani": "The belt is already sold out ..loved it so much ☹️", "sanditakalita17": "Ahhhh!! @komalpandeyofficial ❤️❤️❤️ You're my inspiration 🔥🔥🔥", "_nishajain_13": "Inspiration💕😍", "i_sakshisingh": "😍😍💞💞😍💕", "_p_r_a_d_h_i_": "You have an aura which just give us a smile on our face the minute we see you🔥😍", "style_your_statement": "Ohh god 😍 how you manage to look so pretty ❤️❤️ Really it's a must needed therapy @komalpandeyofficial 😘", "janane_thirumalai": "If fashion had a face🔥🔥🔥💋💋💋love u @komalpandeyofficial 😭😭", "supriya_borshe": "Love bug😍 crushing all over your looks ❤️❤️😘😘👌", "sristi_chanda": "Fashionista❤️✨", "_xditiii_": "Goshhhhh Iloveyou so much @komalpandeyofficial ♥️♥️♥️ How the hell you are so perfect around the clock!💯 No matter what, with or without makeup, you slay... always!💋❤️", "_jaisleen__kaur_": "You should try to do it with chubby people coz mostly these styles don’t compliment our body. Love you ❤️", "chandan_1209": "But you are too pretty to literally pull any thing off 😍", "i_neha_sha": "2nd look", "giriswetaa": "I don't know how someone can pull off every single look so elegantly.😩❤❤❤❤❤", "rana__simi": "Blessing my feed in the early morning🔥", "_shubhisrivastava_": "In this whole world wait in this whole universe only komal can have a video telling us how can we wear a belt in 6 way 😁😁❤️❤️❤️", "_it_is_riya_": "OMG!!! Damn!!! How do you do this??? Love ya😭💖💖💖", "_utkarsha__": "And this is lit... You are so creative... Love this so much @komalpandeyofficial 😍", "suranjitaa": "The last one with the anarkali🔥❤️ more power and love to you girl❤️", "lizarozario": "💙", "the_wonder_mom": "Why why why 🤗stop being so creative already. I love you. More power to you 💕God bless", "its___chinnu": "U r the best❤️ u can slay it anyway @komalpandeyofficial 😘", "dishap08_": "Fabulous! Mind blowing! I love you so much 😭😭❤❤❤", "vallari_joshi_29": "@komalpandeyofficial Could you be anymore beautiful😭❤🌎🤗💯🔥", "sg_shanu": "I just love the way you play with styles. Although, you need to come up with more versatility @komalpandeyofficial . Nowadays all your fashion videos look a lot similar. Just suggestions.❤️", "nagpal_khushi_": "This is just so amazing....loving them all💖💖 You are one of the best content creator.", "p_a_l_a_kkkk": "You're the best komal❤", "imakanksha_": "🔥😍", "fee_royale__": "You've become a statement in urself! Nowadays whenever I meet people n v discuss anything about fashion or clothing, it's like wo Komal Pandey wala lete na..she's amazing! Inspiration🔥 keep it up!", "sunehakangotra": "❤️❤️ this fashion therapy is on 🔥 u my magician only u know how to do experiments with clothes and accessories u are super duper cool 🤗❤️", "_blackrosee1111": "Super ❤️ want to see komal in black smokey eye ❤️", "roopikaaa": "Belt with white suit was🔥🔥😍😍😍", "shivani.2203": "😍😍😍🔥", "aveenaa_": "I don't know y i am so much obsessed with this girl! 💞Love you!!", "itssmahiiii": "You are fabulous 😍😍", "saiveeshelke": "woww😍😍", "paprii__": "Your styles are just out of this world! Just love it!😭😍😍", "mukul_shashwat": "@komalpandeyofficial most beautiful fashion vlogger of India ❤👌", "shrxddhx.__": "You are freaking best @komalpandeyofficial 🔥😍😘❤️💯", "_m.i.r.l__": "How can someone be so creative 😍😍😭😭😭💋💋", "shradhaasharrma": "Queen.👑", "rita18331": "Fabulous ❤️", "ruthlama4": "Try something with leggings or jeggings or could be with stockings. Something out of our mind box😁", "vibhutiiii__": "@komalpandeyofficial Gorgeous👍😘😘", "_rakshasharma": "Only you can pull this so gracefully. Much love ❤", "_urvashirawat": "Loved it ♥️", "sinha_nikita": "Yayayayaya. This is so YOU. No one can ever do this better than you. Love you❤️🌎", "damsel_debarati": "Love love love all of them❤️❤️❤️", "rtistryofficial": "Every. Single. Time !! How !!!! ❤️", "saumya_mallik": "😍❤️", "_aliyaclara_": "Such a goddess😍", "lilstar_769": "You're awesome! 😍💝", "slayistaa": "You're the best ❤️", "chowdhurisaloni": "@komalpandeyofficial This is really unfair!! 😭You rock every look given to you...😍😍Amazing video... which is tuff, you made it look like cakewalk.", "_rittii": "Plz make my bdy the best by Ur wishes🙈🙈🙈", "aditi.khdkr": "😍😍😍😍😍", "rashmideshmukh_20_11": "You are amazing", "minichoudhary_": "That’s fab♥️", "maivy.in": "Love it !", "rutvi_karia": "U r an inspiration.... lots of love 💕💕💕💕", "golu_motu_": "😍❤️", "diptigoel23": "Ooooo belt stylin ❤️😍", "__that_messy_girl": "😍😍🔥", "prachikhare06": "u r d best... lv u", "poooja__._": "Perfect mam you are fabulous 💓💫i always prefer your fashion stlye💎💎adorleble fashion theraphy❤️❤️", "sakshi.katyal23": "Hi from where you purchased that black pants?vdeo😍😍👌👌", "roy_officialbeardman": "Ms. fashionesta lady👍👍", "akshata._.rao": "Love Love Love", "aakansha.1998": "Loved ittt😭😭😍😍❤️", "frenziedvogue": "Go Komal go ❤️❤️", "vidhi.jain09": "You are totally amazing! Don't have words for this😭❤❤", "shamsnisa555": "@komalpandeyofficial You are a diva😍💓love yaa❤️Keep smiling🔥", "hetal_mithiya": "Gonna try this😍❤👌", "srestha_saha20": "Love komal... just loved it", "aki.akiara": "Amazing ma'am 😍", "geetanjali1901": "🦄❤️❤️", "_shyluuu_": "Absolute diva❤❤❤❤❤❤"}