{"ishukaler0001": "Silver Jacket from ?", "shady_srivastava": "Damn 🔥... But I want to know which song is streaming here", "fahimafauzann": "Is this all your wardrobe collection cozzzz damn😍", "ila_bombaylife": "Absolutely impractical styling ideas. This is literally overdoing the skin show which may be possible for you but not others.", "ami.sukonna": "hii budhiya🐸ap to kuch dhang ka pehen lo", "ananya1anindita1": "Uff how do manage such a toned body!! And appreciate your efforts. Your fashion is always on 🔥", "rahimawasti": "How can I get my eyes off you?🔥", "chandni.solanki.58": "I want to change myself and would to wear and see my self different and love this outfit and I would love to try new things and experiment on myself.. 1) My speaking style and people love my speaking style 2) People like my dance so much they loved it so much and they appreciate my dance...@komalpandeyofficial 😍😘😘", "monikasharma80170": "Ooff..such a Queen! 💓✨", "kujur.elin": "@komalpandeyofficial bodysuit is from ?or can u suggest similar to it. Plzzzzzz.....", "shreys.sunshine": "As a kid I always loved everything to do with fashion. All my friends, family and extended friends and family still ask me for fashion advice and ask me to accompany them for shopping but I never had the confidence to professionally take it up! Now I enjoy styling my daughter and myself and when I saw your videos for the first time there was an instant connection.. your style is flawless and very creative and you are very true to yourself! Apart from fashion, I am an artist and I love art, travel, lots of chai, winter sun. I am a free spirit, a wild child @komalpandeyofficial you have been an inspiration to thousands! You are 🔥", "richa_d21": "A valid question- how does one pee in dese outfits?", "ra_tak": "I appreciate your efforts..but do you think it's realistic ?? Pls make season in such a way we can actually play with.. we don't to wear such uncomfortable clothes to college , parties , work or anywhere", "shivanisujata": "Liked all of them", "tanuellaa": "How about me", "pooja.7": "@khushali_24 this🙂🙂", "diveasarin": "Hot AF", "avomashpop": "@jellyfishandthings", "official_sangeeta_sanoy": "I want to be one of them.. coz i just love all your content , your style, your everything. I am so much influenced from you .. oh gosh can't explain. Though i am a model but yes i am very bad in styling myself and i accept it.. so just want to be the one and learn alot from you Komal❤️ It will be the happiest moment for me", "manvii2305": "jus woww🔥🔥 specially the last one, one on one layering hayeeeee❤️❤️❤️❤️❤️❤️", "iamsheetalllll": "Song name plzzzzz", "_as.fi._15": "🔥🔥🔥🔥🔥😍", "elizaseb1330": "1.i am not from Delhi and can't come there as well", "kitkat.201": "What's the song", "pretty_petite_charm": "I have to be one of them to be styled coz I so love ur experimental styling and I am all ga ga about experimental styling. Also I run out of styling ideas, m sure I could use ur advices and tricks to style it up. Please choose me..and I sing great too 😘❤️🤗@komalpandeyofficial", "shruti_kokiloo": "I would love to get a fashion therapy from the Godess herself. I am a yoga person.", "anushkkhote": "I expect nothing but @komalpandeyofficial to atleast read my comment❤️ Firstly, KOMAL, let me tell you one thing which you already know - YOU ARE A BRAND! KOMAL PANDEY IS A BRAND!! We have seen you built this ! You work so hard, and you work hard with all the dedication and love and zero regrets. You are a true inspiration to every girl! I love you with all of my heart😭 Still remember the very first video I watched you in ( winged eyeliner one on YouTube ) damn, you are a gem and you have made yourself stand out and yet stay down to earth. Coming to the #giveaway , wouldn't say much on this just 1) why I want to be styled by you? Well, ma'am being said you are a gem and your existence a blessing to us. I relate with you on so many levels. Komal, you helped me with self respect and self empowerment. I broke up with the guy I was in a super toxic relationship with after watching your video and realizing what I am doing to myself , and you and your videos , your thoughts made me survive that post breakup phase. I thank you for that, so why I wanna be a part of this? Simply because first I want to meet and talk to you and hug you😭 2nd I also relate with your style so much but even after multiple tries ( for obvious reasons ) I am not able to style my daily outfits in a sustainable way as I come from a middle class family and for that I definitely need your help and styling. 2) what makes people fall in love with me? Well don't really know about that but what makes me fall in love with me is my dance and the way my mind works, I love my thought process and the way I think and not to forget I love my confidence which makes me speak up for the right things and stand against the wrongs.", "sujaldivekar": "Just wait...breast implants coming soon", "vanesadsouza": "I would really love to be a part of this as I love fashion n u create an amazing fashion therapy for many of us !! So yesss, I wanna be a part of it ! Um, I love playing the guitar and chess and chess and Netflix, if that's counted 😂❤️❤️", "artistic__glow": "You made your luck........ woww how inspiring you are, really amazing 💕💕💕💕💕 its nothing like you are so lucky you got this...it should be like you did it on you own Ma'am hatsoff . you don't know how much you inspire me with your every new post.bless you 💕💋 always on fire", "annu520332": "😆😆😆have some realistic fashion sense and I hate your hairs 😂 sorry just putting my opinion here", "stylesecretsbyjineesha": "Nic#e😍", "shalininegi__happynoni": "ufffffffffff😒", "akanksha0000m": "@shreyasinha.11", "jeemadhulika": "This definitely is bigger and better ❤️", "gimmecash.x": "@_bhavika_rathore try your luck bb", "mus._.kan": "Hey Komal, big fan of your dressing sense and makeup. I've been a part of your yt channel since you first started. I remember watching you on popxo! Golden days!", "priforsure": "@sumi_mahajan liking it twice for “Harleys in Hawaii” xx", "mahakk.22": "Your fashion sense is good but wear this kind of fashion ? 🤣🤣", "aesthetic.flawss": "Someone please tell me which song is this😭😭😭😭😭😭", "imarim.official": "Oh no. Is this over already?😩", "hina21october": "#FashionTherapy Wow 😍.. I would love to be a part of this as m a young girl and obviously fashion and style obsessed.. So many parties , weddings , events are up in line for me.. And i really need styling tips .. As i get confused how to style myself and which accessory which makeup to put on 🤔.. And that also from a diva and a fashionista like u 😍.. I mean obviously i dont want to miss that wonderful opportunity . Those 2 things about myself that can make anybody make fall in love with me includes ,, 1️⃣my photography skills , though m not professional , but i am so creative that i click in such an artistic manner that people fall in love with me and want themselves to get clicked by me. And i guess in today's world nobody would be there who doesnt love to get clicked 😁. 2️⃣Meri meethi meethi baatein ☺️,, whether its a child or an adult , someone of my age or younger to me, even animals. Everybody just get themselves lost in magical words of mine , i am also a problem solver and a best guide 😉.. All loves me for my sweet talks , even dogs , cats and other animals wag their tail for me 😊.. So i guess these two qualities make others fall in love with me 😊.. Honestly , its like a dreamy giveaway for me 😍.. And i cant be more happier then winning this giveaway from u🤩😭😭.. Ohh lord pls grant my this wish .. Fingers crossed 🤞 .. Badly wish to win my love @komalpandeyofficial ❤️", "ammarsiddque": "Love the way you carry that ring clutch for almost all the videos ......👍🏻", "muusskkaannn": "Okay so you're an inspiration. Komal. THE INSPIRATION. I've no reason to not want to be a part of it. It'd be simply amazing. Also, it was tough to find things about myself. But that's why We love you . You make us do things like these :) so I came up with , I care so much about the other person . And I'm very much into fashion and makeup stuff. ❤️👠", "maithili123__": "Get some boobs yr", "nik_yeole": "1. I really want to be part of this bcoz I have always been following your styles and loving them . You are versatile and I m trying to be one.I will be lucky to be styled by you ❤️. 2. I am a gymnast and I do fitness . I love fashion and reading about it .", "rasika1507": "Classy!! @komalpandeyofficial", "northeast_girrrlll": "1.being a part of dis I will b able to Experiment wid more fashionable looks n get to know wat style will go wid me d best 2.i think it’s my smile because everyone loves a smiling n happy face and it spreads happiness❤️i love all animals", "drishtiiyer": "Am i the only one who has parents?", "ig.sahil24": "Na jhante na chuchi batein uchni uchi", "_.sohini.roy._": "Hi! I'm Sohini & I would like to be a part of it cs i literally breathe fashion... I have depression and anxiety and apart from my man fashion is literally the only thing that makes me feel like myself so it would be a great opportunity for me to be a part of this.", "capegirl20": "Komal I dont think this is something the curvy girls would be comfy wearing.. Could you please do A styling video for girls who are curvy.. Would love to see one of those❤️", "lpurty126": "1. I would like to be a part of this to learn from you to take fashion to next level 😍 n meet u of course 😍❤️ 2. I'm friendly n I respect others opinions. 😊", "sarahgonsalves2": "Love love loved it!", "attitudinal_bae": "Pahli br colourful black dekha h jism or b colours aate h", "debadrita.kar": "I would love to be a part of this because I always try to xerox your styles and I would love to know what the original would feel like😂 and I think that the magic in my being comes from dance 💖", "ipsitamohanty_": "I would like to be a part of this because I would love to meet such wonderful woman @komalpandeyofficial ❤️who inspires me a lot. I love dancing, doing makeup & dress up and exploring new places and food. A good influencer who love to make new friends and to meet new people. I am extrovert & happy go lucky girl with positive attitude.", "sparklingglittering": "1. I’d like to be a part of this because I just loveeeeee your style it’s Fab! 👗 👠 2. I’m compassionate and a friendly person 🥰", "shiesho____": "💗🌌", "_tejaswininaik": "Okay so i would like to be a part of this cause i have connected to komal on almost every part of her life ! May it be her early life ! Her motivation to strive hard or her passion for fashion🤭🌍 it is she who made me believe that u dont have to have extraordinary resources to create something great ! All this would take me a step closer to this super women ... and 2 things that can make anybody fall in love with me would be 1.the fact that i feel anyone can share anything with me 😋 like an embarrasement doesnt feel like one while sharing it with me 🤣 and 2. would be the fact that i can be happy even with the most trivial aspects of my life so even after a major breakdown i know i can smile", "_s_h_i_r_e_e_n_": "Thatttt 2 and 5 outfitss were out of the worldd lyk justt wowww.🔥🔥🔥your dressing sense is lyk besttt literally d bssttt one...YOU ARE THE FASHION GODDESS❤🌸@komalpandeyofficial", "_.khushi.ii": "Hey komal!  My name is khushi bansal and I am a 19 yo college student and I travel daily. So it's really difficult for me to manage both college and fashion at the same time! I am watching your videos since I was 17 and I wanted to tell you that i adore you a lot. I always wanted to meet you so that i can learn new fashion trends from you so that it can help me to groom myself for the future. I just love your style and I so want to be dressed up that way. Talking about things that can make anyone fall for me is my smile and my jolly nature! I always make sure to bring positivity in everything! I so want to meet you ma'am.  Lots of love to you girlboss.", "gurleen.kaur.98": "Which song😍", "sheissupernovaa_": "Aisa kaun si middle class ladki pehen paygi 😏 @ayushi_pal.power she always puts videos for the high society people, I wish humlog ke laayak bhi kuch post karti cause her styling sense is nice", "cocomomcuddles": "Continued:- two things about me that can make anyone fall in love with me are :- My voice and my congeniality.", "aditixgupta": "Well, @komalpandeyofficial, hi I did mail you too. I just wanted to say that I am a CA student and I am thinking of other alternatives simultaneously because I want one thing as a career of now and other, for passion. I don't want to be much open in comments. But, I would love to be knowing you from much closer. Something to love about me? Well, the things you listed, I love to do them, plus, I like to do much creativity w journals, dancing, debating, sports. I don't know, I feel like, adding my resume. Haha. I'm sorry. I'll keep it short now, it would be a pleasure, if you'd connect w me. The sweet journey w you would mean so much to me, because it will guide me and give a direction in life. Also, the other day, you agreed to marry me, you should meet your wife too na. 🙈❤️ Much love & power, my gorgeous!", "anamikalovespizza": "How you gonna pee, bro.😂😂", "tripti_jindal15": "1. I Would love to be a part of this because I am a designing student and through this I can learn from you as you are one of the great fashion stylist! 2. I love to try different styles not basically just myself but on others,I like to sketch ♥️ @komalpandeyofficial", "vishakhaaaa": "I love your style and I've been into fashion styling since the start and I'd love to be a part of this! @komalpandeyofficial . I love reading and writing and I love art, in all ways possible.", "tanishka.dewani": "Hey there, you boss babe😭.I'd love to be a part of this as I truly believe in 'sustainable fashion and 'consuming less' and your videos encourage all of us to not only repeat our clothes but also style them in so many different ways 💞. I have a thing for art, I love photography, learning new languages and obviously fashunnn🌚 @komalpandeyofficial", "anrini.jim_93": "Ok it may sound funny. But if i go out fr a drink ds prty season n i nid to pee den i hv to undress it all. All the styless are no doubt wow but body suit is nt d ryt choic i feel.", "rakshitanahata": "1. I would love to be a part of this because I am pursuing something i love doing i.e. styling and i have learnt a lot from your follow your passion video and it would be a great pleasure to get some guidance and suggestion in the styling field because you are so creative with your content . 2. I love style (styling is being yourself ) and i love following my passion", "thegirlwithcurves": "Heyy! I would love to be styled by you, i am not that of creative person when comes to making outfits, but i sure want to be part of this and have a fun interaction with you and also will be looking for some pro tips🙈. 1)Spreading happiness and giving warm hugs is one of my things 2) i love to dance. (*fingers crossed*) 🙈❤️", "d_ksha": "1. I would loveee to be the part of #FashionTherapy as I really want to elevate my style game. Fashion and good clothes play a very crucial role in today’s world and I personally feel being a student from science background (masters in biotech :p) has some how led me back from fashion.. maybe.. and also most importantly I would love to meet you, following you since ur popxo videos ❤️ 2. I love dancing and clicking picturess. I think I am a great company for introverts as I am a talkative prrson and make them feel comfortable. And I feel I crack good jokes 😬", "poojaaa.116._": "Why so chic all the time 😭😭", "tanya_buffandshiny": "Done a Nailart for you long time back. Tried reaching it to but you haven’t noticed it yet,😟 its been more than 3months i am tagging you continuously , your fan pages have also shared it but yet you haven’t responded 😟 pleasee check your tags and dmm❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "indira_gurdutta": "1.because I have always dreamt of being dressed by someone who can make beauty such a miracle. 2.im a kathak dancer and my mom says people can watch me dance for any number of hours😁", "_jyyotii_": "Di this content is worth watching it will help me for my tomorrow's party😍😍Thnks di.... Truckloads of love😍", "lalz._": "I have been following you since your college couture days 💜I would love you finally meet you in real life and hang out with you. I love your style 💜💜💜 I think I sing well and have a great sense of aesthetics", "vforvidhii": "I would like to be a part of this as I simply love you gorgeous lady. I love watching you and your videos again and again. It would be a dream come true to get the opportunity to get styled by the Diva herself ❤️. 2) I can talk in different voices of kids, I can laugh in a very unusual way.", "serene_afreen": "On fireee!!!🔥🔥🔥🔥", "nidhi_tanvi": "1) Because I love you so much 2) Because I know you love me too", "komalsiiingh": "I would like to be a part of this because for a very long time I have been trying to recreate some of your looks and this would definitely be a catalyst in that. I love dressing up and makeovers. 2 things I probably like about myself the most are: 1) I can be very understanding of human emotions 2) I appreciate art in its every form.", "zeb_zaidi": "Must say- You carry every outfit so gracefully🔥❤️.. And yes wants to get more influence by you personally this time.. loves to be in bestest version of myself when it comes to fashion.", "subha_bhattaraii": "@komalpandeyofficial where do i get those clothes??? i mean i cant find any, the clothes u wear and u look fab...", "sruthy.sm": "1- I always get insecure about my looks and about dressing up myself. 2- I am an animal lover and like to spread positiveness😊❤", "beautybyaarushi": "I want to do it I even mail you in YouTube one but never got chance please choose me😌😌 and I love to visit new places and read novels", "jaskirankaur04": "I want to be a part of it because for once I want to feel and look as I feel inside!! I am a fashionista at heart but offcourse I am choosing paying my bills over these adorable outfits...Also I have crazy OCD which makes me weirdly cute I guess hahahahaha", "noosreena": "@sabine_nalathumbee", "sonali.08outfits": "Nice", "nehasingh9030": "Cuz i really wanna try the looks you do and feel equally confident like you also my smile, eyes and positive vibes can make anyone fall in love with me 😘😘", "_12.54": "I want to be the part of this because wants to dress up like this. one )am comedian 2) i share my dress with all my friends", "_akshitajain24_": "Luv dancing and i luvvv doing makeup", "shivani.nautiyal": "Skirt and boots look dope❤️", "gaayatri96": "Seriously loved it 💖THE BEST 💞😘... God bless you @komalpandeyofficial..... Was in such hurry to comment that I missed the whole drill.... But eventually read it before pressing that send option 😅😂.... So well if you insist darling 💖😉. I've seen you grow from that, you weren't, to that, which you are now 😍. Your journey is amazing, inspiring and heartfelt, inspite of all the hurdles you had to face (hence, inspiring). I would love to meet you, coz it would be a lifetime experience 💞to actually get to know you better in person.😇. So here are two things about me :- 1. I'm confident 😘 (a girl can carry nothing but her confidence and be her best). 2. I'm a good dancer and i believe that plays an important role in developing a good body language. ☺️ The drill is done 🥰hoping for the best... Once again love you and God bless 😘💖😘.", "bhawnaphoolwani": "Hey!!@komalpandeyofficial umm...i would like to be a part of this because your journey inspiring me alot....you teach us how to style yourself with affordable clothes without investing on expensive clothes and how to dressup one cloth in different ways...when I saw your photos and videos first time on Facebook and then I decided to become fashion blogger as you are...your videos encourage me a lot...and I m still in progress for fashion blogger.....2things about me are 1. I love to do sketch..2. love to dressup in unique way...❤️", "shambhavibudholiya": "Hi komal, 💃 i just don't know what to say! Really. I remember watching a video of yours talking about how you transformed into something so different, what was the turning point in your life, like i really think you made yourself stronger than ever before. 🐨 I'm just 💓 flabbergasted!! I'm ambitious about this world, i want to make it a better place to live! I'm a web developer🙈 also i love the sky too. ✨ And sunflowers are my favourite🌻. Thank you 🐨", "kajalkardam22": "Where are your boots from ?", "srotaaaa": "I’m not sure how to make someone fall in love with me but I make sure that I fall in love with myself everyday, and I think that’s important, self love. But if we’re talking about qualities, 1. I’m a chatty cathy , you’ll hardly have a boring time whenever I’m around. 2. I’m a singer! (Bathroom but really good at it :p) I can sing according to your mood 🙈  And lastly I love @komalpandeyofficial and getting an opportunity to meet her is a dream come true, she’s given so much confidence to all the girls who always doubt themselves. Love her❤☺️", "puspita.barman": "Oh I’m an avid fashion enthusiast and can’t stop trying to revamp my wardrobe every few days! I love your style and I try to recreate some of your outfits every now and then :p Also mix and matching and thrift shopping are one of my favourite things to do. I’d love to be a part of #fashiontherapy with one of my major style inspo icons 😁 I’m spontaneous and chill and very easy to be around with! And it will be an amaaaazing experience to work with you🧡", "_highonheels_": "1. I'd love to be a part of this cuz I do take fashion seriously and it'd be pretty obvious to say Komal Pandey is my favourite Influencer | Youtuber. I'd even be willing to travel all the way from Mangalore to Delhi for this!😅 2. Probably the only one here whose Profession is all about loving animals! I'm a Veterinarian who models, blogs, paints and swims!😅", "shreya_uc": "I want to be a part of this because I love experimenting with everything and i add life to every second that I live! And I can see that in the video too it’s absolutely amazing! @komalpandeyofficial Two things I love about myself? I’m a dentist by profession but I never limit myself there I’m a model too and I love working for NGOs . At the end of the day we’re here to make this world a happy and better place for everyone!💜💜💜", "tamalikaray31": "1. It will be dream come true to be a part of this one. 2. I am a singer & I am very much straight forward.", "asmalltowngurl_": "1.Because I want to meet such a wonderful women who is my inspiration💕 & I want to learn how would you style yourself like this. Because I also want to be like you & I want to set an example for all the small town girls that they were also get success in this field like you.😘 2. I just love Dogs & I also want to run a NGO for Street dogs.", "_charitha_queen_": "Omg you've got such an amazing talent✨", "___alisha__singh__": "So good😍", "_uruuuuu_": "Your sense of style is amazing that’s why. I paint abstract art and I love to read.💕", "_mehak_sapra": "I would love to be a part of this because first of all I’ll get a chance to meet my inspiration uh r an amazing person @komalpandeyofficial and uh inspire many gurls out there❤️ Two thing I love about myself?? I’m a student and and a professional makeup aswell no one supported me for my profession every one was against but I never gave up and I love spending time with my elder ones who motivate me for the betterment of my life ❤❤❤", "simranjasmera": "I would like to part of this because I love experimenting too, And all you do is experiment new things in your fashion therapies!❤️ I don’t really feel that people need something in you to love you, I just try to be myself so that people can see who I really am🌸 Also, more power to you.💫", "vaniagarwal__1": "I luv the 2nd last and 3rd last one...", "meenakshi.tar.xz": "Hey komal ❤❤ How are uh ?? Hope ur day went fantastic I am one of the follower from your huge following who loves ur contents very much .and have a huge girl crush on uh. Since the day i have started following uh i was waiting for this lovely opportunity to meet uh and if i could learn something from uh .. I very very much wanted to be the part of ur fashion video also even i wanted to be fashion blogger so it will going to be great opportunity to see hows it all works .. 2 things that i love to do is makeup nd dressing up ....... I can do these things any time of the day......", "bishaparikh": "I really want to be part of this as I love your work and you define fashion in such a great way..i love styling and trying out new things and i am pretty sure you will style me in the best way...can't wait to work with you ♥️♥️. I love traveling and dancing and styling myself...i love you♥️", "ohmydik": "Hi! It would be a blessing if you’d style me because I love you for who you are. 1. I love to play with clothes and styling is something I want to be amazing at. 2. I give the warmest hugs and I’m sure you’re gonna love them hahaha✨💕🍭", "akunurihehehe": "1. Who would miss an opportunity to be styled by none other than @komalpandeyofficial . Having seen her grow right from popxo to an independent kickass blogger. And it's not just the styling I want to get into it for. I would like to learn more about how you evolved, your personal growth and how to deal with everything ever so gracefully. 2. I try my best to be the most understanding in the room, always see what the other person has to say, wait and actually comprehend it and put across my point of view. I'm one of the least judgmental ones out there and even if I snap into one, I try to consciously make an effort to control my thoughts. Another thing many people have told me and I agree is my boldness, be it a statement or my dressing, I would always have a kickass one. P.s. nothing held against you in case it won't happen, still gonna keep loving your work❤️", "aanyaagroverr": "I'd love to be a part of this because 1) I love your edgy style and your transformation into a such a confident woman over the years. 2) I love your unabashed support on letting women be, wear and behave the they want. Leading by your own example. Two fun things about me 1) I've published a book on my account of being a teenager with depression 2) I till date look at myself in the mirror and go \"kon hai ye, jisne dubara mud kar mujhe nai dekha?\"", "arohishukla": "@komalpandeyofficial why? Because... I stalked your IG till your college farewell picture only to find we both wore saree the similar way! That day you inspired me to take my fashion flex seriously. I want to meet you and THANK you. ❤️ 2. Things lovable about me- First: I do a lot of things. I dance. I play basketball. I read. I sing (badly, but I think it's cute because I don't any lyrics wrong- at least I try to) I doodle. I fashion. Tahst about it. Second: I very empathetic. In fact, people don't have to tell me about their feelings, I just know. PS: I know I'm meeting you very soon. 😃 💗", "_sup_2005": "Bang on bro❤️💕🔥", "boshx._": "1 Am a fashion student so I wanna learn more about fashion ,styling ..and you seem perrrff for me ... 2. Two things - IAM empathetic towards people and Iam reserved ...which means close group of loyal friends", "sharma__aarushi": "Following you since a very long time ! Want to be part of it as i am dying to meet the wonder women , you inspires me like everyday! Two special things in me : persistence and hardwork !", "rustedwords": "@shreyya.__ mousepad", "srishh.k": "🔥🤤", "__icy_lemonade2128": "I'd love to be a part of this because I'm a fashion student myself 1st year and it would definitely be of great help and would boost my otherwise diminishing morale💕💕", "prachii_arora": "You are so beautiful!❤️", "payalnagar_": "I would love to be a part of this because honestly,I want to try some different styles from the basic ones. I need a change and I would love to experiment. And 2things about myself that can make anybody fall in love with me are- I love children and elderly people! Also,I cook good food 🙈", "that_sexy_gucci_potatoe": "1- You're such a creative person. I want to know how you come up with such amazing ideas. Everytime you make a video it is always different and better from the previous one. I'm not a big fan of accessories but after watching your videos I freaking wanna try out all the accessories and all type of styles; #FashionTherapy series. I was never into fashion but because of you I've started to dress myself a bit better. You make all your outfits look effortlessly amazing! #Queen 2- I don't know much about myself but what I know is that I'm experimental. I always try to do something that I've never tried before. + I love travelling and I don't eat much food (yeah, my future husband is lucky. Paisa save karvayega mai).", "jhanvirathore": "@komalpandeyofficial I don't really know where to start from. First of all, I'm a huge fan ❤️ I'd love to be a part of this because for once I want to look stylish. I've always kept my self simple and found my comfort in baggy clothes. Probably because I feel I'm a little fat. Though I've seen a lot of girls looking amazing with the choice of clothes they wear with a similar body structure. But couldn't gather guts to do the same. I love to write and somehow manage to express my feelings about everything through them. On a day to day basis, I interact with a lot of people, but I feel I lack that confidence. For once, if I see my self transformed with the way that you do wonders, I feel I might pick that up and make it a routine. This might really help me ❤️ So, Yes! I'd be privileged to be a part of this! 🌸", "vanshikaasinghh": "First of all Komal you are doing a great job!❤️ And I want to be a part of this giveaway because I am a curvy girl and deal with a lot of issues in styling myself and I have seen you styling curvy girls before so I will love to be a part of this. 2 things about me are : Shopping lover and old romantic. Hoping to be one of those 3. ❤️🤞🏼", "nidamaqs": "Youre the bombbb🔥🔥", "__pragati__agarwal__": "😭😭😭😭😭", "_tooyoungtobesad__": "Girl crush ❤️😍", "_happpy__soul": "Hey, I'd love to be the part of this fashion therapy...nie telling about myself 1) I'm a happy soul who does everything, from dancing to singing..from reading books to going on scooty rides tripping krke cz gedhi marna is my kinda thing💕 2) my insta page is about food, lifestyle and fashion as well..but people see me as blogger but in real I'm doing what MAKES MY SOUL HAPPY..fashion is something which I cant express in words but can show people with my pictures 🔥", "ayushi.dimri": "What an opportunity 😍 I would like to be a part of it as I love your style @komalpandeyofficial and what can be better than being styled by the fashionista of the era! Two things about me that can make anybody love me: 1- I'm a chatterbox.😅 2- I'm always happy and try to make everyone around me happy😊", "deeeejaayyyyy": "I would love to be a part of so much art and talent in just one human who not only shows it gracefully but embraces herself as well .", "teeejaaaayyyyy_wini_": "Hi Komal! ❤ I would love to be a part of this as I truly love the \"boss babe\" attitude and glamour that your looks carry! It oozes of confidence and style (who would not want that ?) :p Two things I believe that people love about me is that I'm a very social and friendly being :p I love being kind and helpful and I TRY to be a better human every single day ! Hoping to see you pretty SOOOOON! ❤ Much love :*", "rashu_thakur": "Because i love to dress up,whenever i need to go for any occasion or outing as well thinking of you and your style gives me ideas that yes i can look good by doing this and your one which you mentioned earlier in your video if nothing works just smile.so i love to meet u by heart 💓. Honestly I don’t sing well or anything special in me but yes i love to dance 💃.", "nii2203_aries": "Oh God, my i missed this one. U r fantabulous as alwz.....1-As i had my 2nd baby who is now 6 months old, due to which i hvnt got time to dress myself frm a vry long period of time which i really miss. 2-I m not a good dancer but still i love to dance n an animal lover frm the core of my heart.....❤", "siddhi_deorukhkar": "1. I have been you biggest fan for almost a decade Now I just love you and your confidence I that's why I want to be a part of this . I love talking yeah ! People usually fall in love with me for the way I talk the 2 thing is I love dancing its my passion . thank you ❤", "nautanki_much_": "Uhm, I would love to be a part of this. I am a plus size woman and for the longest time i have loved fashion but always thought that fashion isn't for someone like me. But it was only last year that I truly started expressing my love for fashion. And that I feel a lot of women like me can learn. Second, I think I am very resilient and that's what I love about myself. I will always bounce back from no matter what... And I'd love to learn and be styled by you! ❤️😭🔥", "kinjalshah91": "This is a long jump but Im going to give it a go...1. I'm a hopeless romantic who needs a fashion sass revamp 2. I live in Sydney, Australia which means youll get to travel ;) lol", "kanchi_agarwal": "Perfect girl🔥", "_sani.pani_": "I would love to be styled by you because I feel like my style is v raw yet classy. The two things that people like abt me are that I am honest and too caring.", "koyellllll_": "I would like to be a part cause I really don't know how to makeup, I badly need some makeover!!! Also I am super fun, simple and most important I llloooovvvveeeee tooooooo dance!!!!!! And dancing really makes me complete!❤️ @komalpandeyofficial you are awesome btw, I follow you And watched every video of yours!!!✨❤️❤️❤️", "kudi_atrangi": "You're just perfect @komalpandeyofficial ❤️ Two things about me are, first, I love being myself🙈 and you're the person who taught me this, second is I love nature and how nature works, I mean why just fall in love with birds and dogs which are just a part of nature, why not all of it?", "navdeepkaur6495": "Because I love fashion and dressing up is my hobby. You define fashion in a unique and stunning love. I learnt so many new things from you. Two things that can make anyone fall in love with me are: I love to DRESS UP, whenever I have to go somewhere firstly I think about what to wear & I can easily mix up with new people i.e. kind of extrovert.", "bigfudgefoodie": "Oh my freaking GoDdddddddd🙌🙌🙌😍😍😍😍. This is indeed the best komal. Keep up the good work 🔥", "z.saify01": "honeslty! no words to describe your talent.As @malvikasitlaniofficial rightly said 'beauty meets fashion queen'.1. i would love to be a part of this just to meet you nd learn all your #fashion therapies. 2. two things about me would be 1. i am such a soft hearted person.2 just like you, i too love mixing n matching all our outfits...", "rajmani25": "👌👌", "bharviee": "Layering queen 😍😍😍", "the.classy.affair": "❤️ @komalpandeyofficial I want to be part of this beacuse I really admire your style and confidence to carry all the outfit, especially bold one like a perfect winged eyeliner💓 and big time dog lover too💕", "yukti_thakar": "It would to be amazing to be a part of this because firstly I'd be able to meet you and the i can understand my style and in what ways i can experiment with it all! Two things that can make some people fall for me is I'm a Bollywood freak i love it too much and I'm a complete foodie so we can have lots of it❤️ fingers crossed 🤞", "graceonface": "I would love to be part of this cz first of all i admire you like seriously.. I myself have started blogging and the inspiration is you you❤️ I will be the happiest if I can be a part of this and you can style me so that I can learn things are apply in my blogging too❤️❤️ moreover, what I love the most is dancing and fashion.. These two things are something I can't live without.. Much love❤️❤️ hope I can be the one 😭😭❤️❤️", "ghejaa": "@komalpandeyofficial Hi love 1- I would love to be a part of this giveaway because fashion, styling apparel’s has always been in me. Although, I’m a banker which is funny because bankers are monotonous with their dressing but I always know that styling has my heart already. 2- I love solo travelling. I feel like it gives you this little “me time” I travelled this summer for 3 months and it was the best time of my life. Secondly, My nails never grow so I love nail extensions like I’d spend all day my salary to fancy my nails.", "himanshi.himmi": "I want to be a part of this As I'm a multi tasker person I would love to know how u can make balance all styles of my work in one for me🤠. I'm an artist girl with artistic dreams....extremely talented and yes obviously anybody can fall in love with me as i can slay with my confident smile☺️+independent nature + I'm a pro henna artist @glitzysaga is my work💕💕. Last but not least obviously @komalpandeyofficial is independent and setting great examples for fashion😎would love to meet her once in my lifetime if my luck works🤞🤞", "anushree.shankar": "I always want some suggestions for my dressing as I can't can't find the perfect look. Im a singer and dancer ❤️ and I love your vlogs!!💓 Would love to meet you💓💓", "your_smile_is_my_elixir": "Wow! Gurl, you are such a hustler manh❤️ how do u manage to keep yourself going!! Damn.. more power to u❤️", "thankgod.itsfood": "Just ♥️♥️♥️ you and your amazing work!! And it would really mean a lot if I could be part of this esp when I m a big fan of your #komalstyles series. I am a software professional nd just wanna break the norms that u can't be stylist nd fashionable once married as u gotta carry #Sindoor", "shethe.troublemaker": "1. I need to be part of this...cause I really need some fashion skill...and what's better than to learn from pro... 2.dog lover and sarcastic 🙈", "bhavigittuwala": "Wow... you are stunning as always..🔥🔥❤️", "bector7494": "Since this giveaway is only for girls which is unfair cause I'm a boy following you from last one and a half year on both the platforms you put content. 1. I should be a part of this cause it'll be first for you to style a guy. 2. I cook and I love gardening. However, I believe people won't love me cause I cook or i read. I'd like if they'll love me for the person I'm.", "bulbul_1882": "Hey Komal! I just love your fashion therapies, they give me a motivation to stand up and get dressed in the way I want! Keep making such stuff and more power to you! 1. I want to be a part of #fashiontherapy because you inspire not only me, but many girls out there. And it would be a great opportunity to meet you and learn some stuff from you! 2. I am a bold and confident girl, and you know BOLD is BEAUTIFUL. And also I am passionate about myself and I believe that's the most important thing anyone will bother, i.e. if you care for yourself! And and I m a good listener too ! And have okayish kinda sense of humour! Lol!", "swagatikapalai": "1.I would love to become a glamorous goddess after the makeover. 2. I am a very bubbly and cheerful person n I love gaining knowledge about every field ♥️", "_thecareless_soul": "Amazing😍", "jyoticaa__": "So so so excited for this one dying 😭😭😭..@komalpandeyofficial", "junejarishita": "I just want an oppurtunity to get ready by you @komalpandeyofficial ma'am🙈❤ I feel two of my qualities are, 1. I can dance anywhere, anytime, at any song.💃 And 2. I'll make sure the one who meets me, doesn't leave without a smile🌈❤", "themodemuse": "Why so freaking hot lady. 😍😍😍😍🔥🔥 You are just so good❤️", "_cherrybomb______": "What the song didi @komalpandeyofficial ?", "the_aesthetic.soul": "I loved all but 4th one... Oh my God it was perfect😍😍😍😍😍", "_.thaimei_sunaina._": "I'll love to be a part of this fashion therapy because u inspired me the most with your videos that every girl can dress well still in little budget", "iciclesiris": "Both fashion and style are equally important for me like you. Because it's a way to present one's self, their mind and their choice. And I would love to be part of this because who wouldn't love to get styled by a fashion Diva who respects individual style statement! That's an opportunity as well as privilege. 🌼♥️ And about me, a shy observer who smiles alot and loves to rescue dogs♥️🌼 @komalpandeyofficial ♥️", "goofus.doofus": "@komalpandeyofficial Who wouldn't like to be a part of this?? I mean you are the styling goddess 😍😍 2 things about me that would make anybody fall in love with me would be - 1. You will not get bored of me because of my stupidity 2. You will not get bored with me because of my stupidity 😝😝", "muskan_mudgal_": "Thow things that can make anyone fall in love with me are Am very very fond of kids i just get crazy when i see them #2 i love exploring and travelling @komalpandeyofficial #fashiontherapy ❤️❤️", "ishanimitraa": "1. I would LOVE to be a part of this because I love makeup & fashion and your journey to reach this level has been beautiful. I need some guidance in the blogging/vlogging area. 2. I love games. (Gamer girl 🤙🏻😛) & a big time dog lover 🐕", "rhurhy": "@arushi.sondhi", "manvi_thapar": "I guess that would be decided by you n your team still a reason from my side would be that I love to be simple n yet a bit stylish. 2 things about me are- 1.)I am into food blogging n reviewing and I love doing that basically a food lover and 2.) I love myself🤷", "tag_that_trend": "This video is so international 💓", "bharti29.raj": "Love ur therapy but m to fatty", "seyshalazarus24": "You’re stunning Komal💕 @komalpandeyofficial", "thebohospiration": "This is like the only giveaway I’d ever take part in because it’s by a woman like you! I’ve always always admired your hardwork and patience and seen you grow since you left popxo. You built yourself again from scratch and that’s something I aspire to do. Two things that could make anyone fall in love with me would be: 1) I’m very hardworking (just like you ✨) and I dream to build my travel page to great heights and I’m almost getting there. 2) I’m independent and earn my own money through food photography to support my blog and many people admire that. You can also check my food photography page here: (@jigyasaamalhotra) Thank you Komal for this opportunity, hope to see you soooon! ♥️ Big virtual hug", "mybodylove_journey": "May I borrow some confidence too?❤️❤️ Loved this🔥🔥🔥", "pragyatrikha": "1. I want to be a part of it because I have never seen this much dedication and consistency in any other fashion project being done by anyone else. Also I follow it, I have recreated a lot of outfits out of these videos and lastly It has given me a confidence that I can wear an outfit in multiple ways and can feel confident about it at the same time.", "samiksha_sarodee": "@komalpandeyofficial 1.) I love fashion and you’re the perfect person , I adore you! 2.) I love doing makeup !", "jacquelinetigga": "Absolutely love how you keep inspiring us all with you quirky creativity and unique style ❤️ 1. Would absolutely love to be part of your styling project because after watching you,my style has completely evolved. The layering has become my best friend : be it winters or summers, Indian or Western your style inspired the transformation of a tom boy into a babe. Still learning and I guess your insight will just take it another level. 2. Well first and foremost I am an absolute foodie, I love food and like Joey I hate sharing food but I absolutely love indulging with people with same taste buds. :P Also, I am a dancer, absolutely love to be a part of a gathering or a party to just loose yourself and dance the night out. *FingersCrossed* hope to get selected.", "anushkasbhargav": "Being a part of this would mean to understand style closely. Style is something which is super personal to everyone but when its drawing styling info and color pallets it just adds on to the confidence of carrying my outfit well. Sports, writing and traveling are some interests that drive me. 🌟🌟🌟🌟🌟", "tanvishangle": "1. I've been idolizing you for so long, and #fashiontherapy had helped me improve my style a lot, but getting the opportunity to be styled by you is another dream altogether🥰🥰🥰🥰", "just_brishti": "Plz komal...show some styles in covered clothes also😃 waiting fr it..if possible make a series fr shy girls again..❤️", "bhadouriya_needhie": "@komalpandeyofficial u just inspire me every single day wth your positivity,love,work mny more.. Tht positive attitude nd those good vibe just instantly connect love to meet you...sooo...... Two things which make anyone fall in love wth me idk..but things which i persnlly fall in love wth myeslf is my vibe , my postivity,the way i look 🔥", "storiesbysurabhi": "1.I would like to be a part of this in order to experiment with my basic style and try something extraordinary! 2. I get along with animals really well and I'm a writer so we can have deep conversations over tea! Heheh @komalpandeyofficial ♥️", "anikaa.w": "Best one so far❤️❤️", "mahima_3679": "1. I would love to be a part of this because I've always dreamt of being styled by you even before you started this series.❤️ 2. I can make people fall in love with me coz I'm a pretty good cook😋 and I care a lot for my loved ones❤️", "bafnaanjali": "I’ll be honoured to be part of this because it’s so therapeutic and also gives so much satisfaction to just watch you doing your thing and I’ll will be so idk , but so much happy to do it with you komalll ❤️❤️❤️. I love dancinggg to Bollywood songs and love love reading at any time and anywhere people will always find me readinggg I hope youuuuu choose me as it will really help my confidence to grow because of this love you❤️❤️❤️", "shiivangijain": "I would like to be a part of this because I love experimenting with my looks and style just like you❤️ and about myself I think I'm really passionate and ambitious about my goals. I'm a full time market research associate along with that I run a dance club on weekends since I like to follow both my ambition and passion. Second thing is that I hate to waste even a single second of my life so I always engage myself in blogging. I don't know if these things could make anyone fall in love with me but this is definitely important for any girl to be more than what they think they really are. Much love❤️", "suhawanikushwaha": "I would love to meet you because I too m an entrepreneur, n wanna catch your vibe ( how motivated are you always).. n things.. 1. I love n respect myself more than anyone else. 2. If nothing i would give hope to the person in need. 3. I put the best comments on my friends pictures like you do to make them feel the God/ goddess they are. 😝💖.. much love @komalpandeyofficial", "snehanegi___": "1. I want to be a part of this coz i am into fashion stuff since i was born. This is what my mumma says 2. I live dancing , i forget every pain when i dance and i am into that song which is being played at a moment . Second is i love to help poors like if i get lots of money in future by the gods grace , i will nt spend them all in me , i will built an NGO. Tysm😊", "wa.sabee": "You have an amazing sense of style so I wanna be styled by you. And 2 things people could like about me I’m trustworthy and responsible", "yours_since": "Lov frm france..bisous bisous❤️", "chicbydefault": "The fact is that your sense of fashion is experimental and bold, to say the least, and to be styled by you would be a wonderful opportunity for I am certain that it will be different from anything I have tried before. 2 things about me? Well, let’s just say that I am a cup of op-tea-mism, and just the right bit of sparkly and bubbly. ;)", "apurva_dusane": "Dude you are soooo talented it's unreal ❤❤❤❤❤", "wonderwomendiaries": "Hey, I really love all your styles and only you are one of the blogger who could slay in like everything.. I would wanna be part of it because I would get an opportunity to get styles by you, also I am not in a good size.. I am quite fat and this could eventually be something different than the usual styles you do. Because I can't follow all the styles and stuffs you do on fashion therapy, so I could get a different Komal's style. And yes, about me.. I love make up and I love food 😉", "sakshi.agrawal13": "First of all congratulations to you for the 3rd season 😘and sending lots of love n wishes for this one ❤️ 1. I would like to be part of this because I recently got free from my CA exams and now need to focus on myself and secondly I admire you a lot we have so many things in common like coming from a background of strict parents 😂 2. I don’t know if anyone would ever fall in love with me or not but if then because I am writer, write write ups and secondly I am a old school girl 🙈", "spilling_d_beans": "@komalpandeyofficial I'm not a dog or cat fan but i like your styling sense. I agree with @ankushbahuguna that you can style even the newspaper.. I am just wondering how would I be looking like if you are going to style me! I'm sure I'll be looking like never before!", "missrao_": "You are stunning!", "_____tweety____": "Ohh god stop being so beautiful waiting for this episode for so long 😇 Thank you for this one just loved it💛", "mitalp82": "Patakha 😘", "virushka_ts": "Heyy komal🔥 I would like to be a part of it, since my face looks young n cause of wrong dressing, people think I'm still a kid 🙈 n want to transform from cute to hot...!!! reasons people like me - I'm kind hearted n cause of my jovial nature", "manaswita_mahanta": "1. Because so many people complain that your style only compliments your petite body type but I know that even me, a heavy and fluffy (fat, read fat okay) girl can be dressed up in the signature Komal way and being a part of this would ensure that happens. 🙈 2. I'm funny (atleast I make myself laugh 😅) and a good listener who also talks ALOT. (Some people like that, right?) P S. I love reading, but just NEVER academic books. 🤭", "nehabuttan.23": "1)Because in a way you’ve inspired me and other girls (I’m sure) for wearing what we WANT TO without any fear !! And helped me to discover my own style with the video where you discussed about having your own individual style ! 😋And it’ll be the best thing that’ll happen to me before this year ends ♥️♥️😘😘 P.S.- I love you and @dollysingh both!♥️♥️🌸🌸♥️♥️such cuties you guys are!😍♥️ 2) my eyes and happy go lucky nature!😛👻", "trippyycat": "Super super long, please read you won't regret. 1. I'd LOVE to be a part of this because what you and I have is unconditional (you might not know it yet :p), whatever it is, wherever you are, i can never ever stop loving you and it's very inspiring what all you've grown through from your college, relationship with yourself, moving out and making a home for yourself. You not only have created great content but also and amazing space for yourself wherever you are! Also, I've always only found you very similar to how i am since many years, we've literally owned similar outfits, same makeup and all very coincidentally, i was surprised how similar we can be and that's how i know that i am doing it right! There are endless reasons and i can go on and on but I'll save it for later when we finally meet ! 2. What i love the most about myself and have learnt from you only is turning my passion into my profession, so from 2014 I've been volunteering with various organisations in india for animals and youth awareness and for women and children in our country and I've been a tour guide for foreigners who would come to India to VOLUNTEER! And now I'm a self made entrepreneur who gives more such volunteering opportunities to people who love to travel and volunteer at the same time and of course there's endless support for such Volunteering organisation who really need it. 2.2 I Love myself unconditionally whatever, wherever i am and i am very proud of how far I've come at the age of 23. You've been a major major influence! Thank you and Love You and i really really hope we work together on something this exciting!!!!", "chic_blushes": "@komalpandeyofficial 1) I am a plus-size 30 year old unmarried girl , battling mental health issues who wants to find her mojo in fashion back. So, want to be a part of this 2) People say I have a cute smile, and I generally am able to make friends with anyone and everyone.", "vamikajhanjii": "I would love love to be a part of this because honestly I love your sense of style and how well you understand body types! Im sure being styled by you would give me an idea as to how I could do it better myself💁🏻‍♀️ People usually fall in love with me because ( or that's what I think😛 ) I'm a very happy-go-lucky person and also have a really good sense of humor! Look forward to hearing from your team!❤️", "muskanthapa.2712": "Why I want to be a part of your video is you and my love for fashion. Nd two things about me are, I love playing xylophone although I'm not pro at it but I'm in love with this art and I can cook tasty Chinese food. One more things that people generally ask me is if I hv bad throat but no I hv Husky voice which makes me different", "kavyashreegurung": "I would looveee to be a part of this because I mean, WHYY NOT ??!! 💁💃 It's just so overwhelming to see you how far you've come and I can't imagine the amount of hardwork you must have put all along, what massive inspiration you are !! 🙌 I feel I am that 'good vibes' kinda girl, I don't judge people easily. I like accepting people with their flaws and I try my best to be kind to everyone. Cheers 🌹🌈🍷 love you loads @komalpandeyofficial", "_m.shokhanda_": "Because you have got everything within you and also everything for everyone 🔥 looks for people who are not comfortable or just part of conservative families and looks for girls who are allowed and comfortable in everything and you believe in self love💛💛 .. 1. i am a dancer and a poet i write about literally everything 2. I always try to understand people’s perspective before getting into an argument. Trust me it solves 70% of the problems😂", "gur_kirat_kaur": "2.love to dance nd reading as well", "asmashavez": "Honestly what’s with fashion now why is it “GOOD FASHION when it’s just body showing” appreciate all your ideas and everything but it’s as if bloggers have forgotten the covered kinda fashion", "_shrutibansal": "Hey Rockstar @komalpandeyofficial !😍 1. I just want you to say that I have always watched you through my screen and loved these videos. They're honestly a THERAPY to my heart. Even though I'm a plus size, still I've always felt inspired from your looks and have experimented with my style. So, it would be great to have the opportunity to be styled by the Fashion Queen itself. 2. I'm a big foodie and love exploring the best places to have the best food. Also, I love dancing. And just a bonus point, just like Komal, I share special love for my clothes and don't give up on them until I've used them in the best possible way. 🙈♥️ @misfitdiv", "misbaa_1": "@komalpandeyofficial can you suggest me saree for my farewell finally getting graduated ..", "shagufizaidi": "hiiii u r a perfect example of a complete girl not even 1 look goes wrong on u ......by d way ..I am a cat lover ...I hv turkish angora cats .....nd dy r my life ......I would really love love to meet u once🥰🥰🥰🥰🥰🥰😘😘😘😘😘😘😘😘", "neelanjanaaghosh": "U r d only reason y everyone wants to b part of dis .u r simply 💗n secondly I love myself💖 n things or activities which loves me n makes me grateful I love Dem for sure dance n partying.. exactly like Pooh😛", "lillyscollection791102": "U are beautiful ...but i just hate ur acting...", "tanishadhingra": "1. It would be a great opportunity to intract with you! 2. I believe in the power of Hope, and I know what’s empathy more then sympathy!", "smabh2": "I would love to be a part of this because I have made myself a better version of me. AND, I love caring and medicating every possible animal around my area/city, I enjoy caring them and I love getting ready it makes me more confident ❤️ lastly, you are love in terms of Fasion.", "__misspiyu4_blush__": "I am love with you di 👌😍😘", "ms.journo_": "I love that silver blazer🔥", "navleen2326": "So much in love with @komalpandeyofficial", "vidhi.jain09": "Hi Komal, for me personally, you've been such a big inspiration. Apart from being the ultimate fashion queen, you have a huge role to play in shaping me as a person in quite many ways. Not just saying this for the sake of it, but if I wouldn't have been following your exceptional content since such a long time, I would've definitely not been able to do what I'm doing currently, i.e. following my passion. You have motivated so many young girls out there to just give it a shot for what they love and not back out. Getting styled by you would mean the world to me! 💕 Now some unique things about me are 1. I am a belly dancer, people get _Hep-noxious_ watching me dance haha😂 2. I'm an outgoing person, who just loves to dress up and click 128379 pictures!", "thegirl_withhoneybeeeyes": "All of ‘em are gorgeous looks♥️and you’re phenomenal women✨💋 @komalpandeyofficial Lots of love🌈 and i hope your fashion #therapy reach out to as many as you can💯👌🏻", "anantajindal05": "why so hot ❤️", "taarika_21": "coz u r my fashion inspiration...I'm planning to carry a saree effortlessly at my friend's wedding and wish to carry the same confidence u hv ,to carry simple outfits with much grace...next to talk about why one would fall in love with me is the magic of my eyes and ofcourse my gentle touch 😍😘", "shefalisuryawanshi": "Firstly, I love you and your way of styling ❤️ 😘 Reason I would like to be part of this is because you have inspired me to style my clothes differently than what we usually wear. One piece of clothing and 4 different ways to style it. You made me feel that it's okay to repeat clothes and reuse them because it's high time we should think about our environment too. So when I meet you I hope I can learn some more styling tips.💖 Two things that make anybody fall in love with me can be (1) I am a dog lover. Not just that I actually do care for them even if I see a street dog I might feed him some food. (2) I am a good listener and genuinely care for people and never leave them. so that is one of the reason why someone has fallen in love with me because I know how it feels like leaving someone. Love you komal😘❤️", "foodisfuel23": "I have followed each episode of your #FashionTherapy and I adore it! I have tried some of the looks that you show in these videos! Would be great I can meet you before leaving India😋 2things about me : I cook good food (can make chole poori for u komal or anything healthier too 😁😁) and I can paint too😊 ..... P.s. my flatmate's name is komal too 😁", "thatcuuteegirl": "💚💚💚💚", "isha.makan": "🔥🔥🔥 add outfits details or some links too please", "aasthakhushu": "I'd love to be a part of this because I love fashion and you styling me is like a dream come true😍 Also..I love dancing and cooking 😋 I don't know if that can make anybody fall in love with me or not but I love it and I honestly don't care if people don't like me because this is me and I'm completely in love with me. ❤️", "sharminriya": "Please do a bralet collection video 😍 @komalpandeyofficial", "anmolkanwar": "I would love to be a part of this because its sounds super fun! Also, honestly I am so much self-love for myself😅 who won’t anybody love me? 😜 hahahhahaa coming to the point I’d think because I am confident and honest! That’s that☺️", "theflossything": "Song: Harleys In Hawaii", "_surabhi9": "Wow getting an outfit styled by you is in itself an achievement so that's why would love to be a part of it 2) my easily making people smile nature is what I adore", "_survii__": "Its just 4 days i have been following you and i guess you inspire every women out there. How to present and be confident about who you are so basically i guess I'm a package full of talent i love to make people laugh and that's the thing which attracts people towards me also i dance like a dapper❤ @komalpandeyofficial", "_themaiden": "I so very much love you and I literally dreamt of you last night, oh god!!!!❤️❤️ I wish to win the opportunity of being styled by you! I too am into fashion blogging and all my styling videos are inspired by you. I am great at posing and stuff and am too confident in whatever I wear no matter what people say. I can flaunt any outfit with grace and elegance. Also, I used to be a tomboy in my school time but look at me now, I’m a fashionista , haha. I sing, dance, I’m great at Table Tennis, I am a blogger, a pistol shooter and also a dog lover. I love yourrrrr style and the way you carry yourself and I really wish to meet you❤️ Choose me @komalpandeyofficial 😍❤️ you can also check out my profile and that would surely tell you much about me.", "arhaanakrishna": "Born to Fly and be happy like the 4th of july💓❤ @komalpandeyofficial 😂", "sonam_1230": "I want to be part of this giveaway because no-one else styles the way you do, I mean the way you style simple outfit and the accesories you wear is really 😍😍😍The best thing about me (commented by people) is I make their day really awesome and my smile makes them feel complete😍and thats what makes me feel happy! 🌹😍😘", "x___krutika_": "1. U are some kind of magic 💕 n getting a chance to be styled by u is the greatest blessing god can ever bless me with 🙏.. 2. I like interacting to people, knowing people better, i like to be humble n to help others 💖 I Love you komal💖", "bhawna_agrawal_": "I would love to be the part of this because i love the way you style and the one of the biggest reason that you are my fav. I love watching web series and reading books. I would be the happiest one if i get a chance to meet you.", "redlip_chic": "1. Komal you are a #BAWSEBAE ♥️ you inspire every upcoming diva each day with your style, 2. I'm a makeup addict n wats more great than being styled by the ULTIMATE KOMAL PANDEY? 3. I always feel that I'm too genuine n blunt that rarely attracts anyone towards me 😑", "sameerk2g": "👑👑", "garima.shh": "I feel you’re a style icon in the coming era , especially for small boob girls 🙊 also,I’ve been following your fashion therapy series since the first video! I also wanted to be a part of the YouTube series where you helped girls groom themselves! One thing people love about me is that I’m SUPER chirpy and talkative haha . And the other would be my amazing music taste , I’m proud to say I’ve more followers on Apple Music than on Instagram lol . Hopefully I’ll hear from your team sooon 🙌🏻", "rhea_zy": "I've literally loved the #FashionTherapy series u come up with so many good ideas even with one piece of clothing by switching up some accessories and some other clothing pieces and it's so fascinating. And I would say because of u I've started loving Ethnic wear too u make it look soo effortless such a KWEEN omg we love 😭🔥🔥 2. I guess I sing well LMAO idk and the other thing would be I like seeing people happy and I like to make people laugh even tho my jokes are crack afuk🤣", "pvtiscool": "1. Well i would love to be part of this because I really wanna change my style and I think you could help me with that  2. Can’t hurt anyone and can’t say no", "_aashi2721_": "Literally di I have been following u from the days u use to work in popxo and then u started working on ur own... doing these fashion therapies and making everyone feels confident in their own skin... I learnt alot from u not only getting all dressy and getting up to date but also passing all the hard situations in life keeping mind calm and cool❤️ #myinspiration coming into 2 things I love about myself are 1. I love experimenting in life and 2. I love animals ❤️", "theuglyduckling.biz": "Last look 😍😍😍", "akansha91220": "I would like to be part of this because i love the way you play wid dresses and i always inspired by your fashion style.i love watching your style from the day when i saw your popxo videos .i improved my fashion sense alot after that .2- I'm dog and babies lover.. i love watching there videos on Instagram and YouTube specially mochamilk videos😍. I never get bored while watching there videos .. i also have a dog named khusi😂and 2nd thing my all tym smiling face😂 but not lovable by teachers and professor 😂😂.", "_saak_chii_": "1. Because you are my lady love😍. 2. I love dressing up like you, love watching your videos and love the way you are progressing💕 @komalpandeyofficial", "kashish_2520": "Hey hey!! I love you💕, great work and you are a diva @komalpandeyofficial 😍😍I would like to be a part of this as who doesn't wants to be styled by you and this is soo not fair only 3 like only 3 there are alot of people who want to meet you, and omg would mean alot to be dressed by you. 2 things about me are i am good dancer and I think I sing well 😅", "_poonamgupta_": "Hi komal I would like you to style my daughter @__anikam because 1. She loves dressing up every morning like you do, sometimes even when she has to stay at home all day. She just dresses up to make herself feel good.  2. She desperately wants to be a part of #komalsSTYLES and is eagerly waiting for your reply to her mails. 3. She loves mixing different styles together, learning new styling techniques from pinterest and youtube. She loves cats and chow chow, Plus she’s a big time fan of Teen RomComs 💙 @komalpandeyofficial Hope to win. Love", "bhanwishree": "1.I would like to be a part of this because I absolutely love and adore you and your fashion sense is just fab.I have been following your videos on YouTube for quite some time now and it has definitely helped me to enhance my overall personality. 2. I love to dress up because i feel it has got something to do with our mood too..as in when we look beautiful,we feel beautiful.and not to forget wearing a smile and confidence is my goto. Another thing which i love is to take care of my skin and body so i love working out,and reading is something that gives me utmost pleasure because i feel beauty with brains is the best combo a girl can ever possess.", "thecheshtabatra": "I loveeeee you @komalpandeyofficial . Giving this giveaway a try as well! 1. Would love to see the curvy chic styling done by you💖 2. Simply want to meet you and have a healthy snack munching with you with jaggery tea hehe", "kitkat_tricorn": "Pehele 4 kapdo me kidhar jane wale hai hum log", "sonali_s_ahuja": "1) I wanted to be a fashion designer as a pre teen then slowly all those dreams were crushed by people and life and since then I've been unable to have my own style or unable to you know make clothing combinations. This has not only affected my self esteem but also gave me major body image issues. So like for once i want to be styled and i want to fall in love with what i see in the mirror every single day .", "_harshitajainx_": "I would love to be a part of this because I'm also a fashion enthusiast and I'm really inspired by how you use 1 clothing to create so many. I actually used some. And when I shop I'm like yeh lena hai komal neh pehna tha yeh aise aise bhi pehen sakte hai. And I love reading I'm a bharatnatyam Dancer and people look forward to me because I give positive vibes. Just like my name I smile and spread smiles 🥰 I love myself ✨", "issaa_moood": "Where is the body suit from? 😍 @komalpandeyofficial", "vanshka__chauhn": "I want to be a part of this series because I'm short heighted girl (4'10) and i don't know how to dress up myself and also im college going girl so want to learn that how to represent my self in any occasion and in any place like college, occasion and party's and now im gonna share few things about myself that i love learning new things, i love to do makeup and last but not the least i love adding new peoples in my life coz I've mentioned earlier that i love learning new things...... And and and i love reading biographies and autobiographies 😘😘😘🤗🤗🤗🤗...", "fizzaakhaann": "@fashioninflux this is our indian diva🔥", "rhea_0810": "Hey beaut, sundar dikhna band karne ka kya logi😂😂❤️ , love ya girl, lots of love and power to yaa xoxo", "aka_anshu": "What's the song😪😪", "thatfebruarygirl": "I’d like to be a part of this because camera is my thing! Also, I absolutely love dancing. If you’d choose me, we can add a fun dance element too where we do signature Bollywood steps in each vid. Hehe But first things first that absolutely love your styling and doesn’t matter if you style me or not, know that with every video that you drop, I learn so much more. Love xox", "_pandeygarima": "I wanna be part of this because I can relate with you in some ways as you told in @malvikasitlaniofficial video and I am huge fan of yours....you are my inspiration when I don't have any clothes to wear since I can recreate a new look with old clothes just because of you....", "__beyondwords___": "1- I want to be a part of this because I lack sense of style😅 And 2- My humour and strength❤️", "rashiava": "Hey Komal! So I am not at all a fashionista. I am a very girl next door person with bare minimum fashion sense. I'd like to experience fashion and style though. 2 things that people love about me is that I'm very approachable to talk with and am very realistic and open minded person so I dont judge anything readily.", "sreetama_chatterjee": "Look 3 is my fav😍😍😍😍😍 and that ending!!!lmao 🤣🤣", "hikabieber": "1. The reason I wanna be a part of this other being a huge fan of yours is that I love dressing up since I was a lil girl. Unlike my siblings who would cry for toys, I was mostly into buying new clothes.Dressing up has always been my favorite thing to do. Every time I am bored & have nothing to do my fav thing is to dress up , check out myself, try to walk like the Victoria's secret models, sing and dance in front of the mirror 🤩 2. First thing is that I am a crazy, hilarious and the most entertaining factor (according to my family, friends,classmates & teachers) :P . Secondly, I am a cat lover🐈 + slightly OCD + reads novels📖 + fancy horror movies 👻. P.S. I love you @komalpandeyofficial you are amazingly beautiful inside and out. ^-^", "anushabhaskar3": "Try different makeup for your face. I mean, your fashion sense is really amazing, but try something different with your face.:) peace :))", "rutugupta_": "You’re amazing ❤️🥰", "_roshogolla__": "Because I love to style in different ways and I would love this opportunity to get to try other styles thata are out of casual .... 2nd I am good art and dance but my smile can definitely make anyone fall in love 😍😉 now hands cross🤞🤞", "somdattade": "From where do you get all these styling ideas? I mean you are amazing!", "hearitfromneha": "This is awesome.....And love the experiments you did in this one❤️", "shreyalama09": "I would love to be part of this because I want to enter in the fashion world where I can express of talent and support from you all. I love watching movies, dressing up beautifully for an event .", "prerana__pradeep": "@nysh.71k all black 2", "varsha.sri901": "Oh my my 😍you're back with a fire ❤️Ilove you so much komal🌸 was waiting", "somyaabhatia": "Hi Komal! 1) I would love to be a part of this because I do not feel confident with my body type, a concern most of my girlfriends share. I love watching these fashion therapy videos but my focus boils down to those few problematic areas, making me sceptical about buying those beautiful outfits. I feel by being a part of this, we would be able to reach out to all those pretty girls and women out there, who follow you but are not so comfortable with how they look :) 2) Umm 2 things: First, my authentic self. I present myself as how I am i.e. absolutely honest and confident even about my vulnerabilities. That genuineness I feel, is hard to find these days. Second, I feel I'm easy to approach. It doesn't matter if we're strangers, I would still be available to listen, talk or help! Me singing a song on guitar, cooking healthy 'ghar ka khana' for you or endlessly looking at cute dog videos together, will simply be a bonus ;)", "aye_rosh": "1. Would want to be a part of this because my breasts are small and would want to gain sufficient confidence wearing revealing dresses. 2. My bubbly yet caring nature is enough to make anyone fall for me (LGBT)😂🙌", "theholidaytan": "1. Who wouldn't want to be part of this! To be styled by Komal in Fashion Therapy. What a dream! What a platform to learn! ♥️ 2a. The way I plan all my budget trips and how I'm always on a roll. 2b. Humour is the key. 😎", "jyotishree_parasar": "1)coz this will be dream come true reason first it's you 😍 second I love styling like I always try to change my style even if I have to repeat my outfits..2) I am a positive person I stay true to myself and I take out time for my passion i.e singing on weekends.", "pri_yankabhandari": "Your thoughts always rocks👌😍😘", "mittal_drishti": "2. I don't have any speciaity as such but I love fashion trends, creative fashion ideas, trends and dressing up. Apart from that I am good learner and with deep thinker.", "merinmariamwilson": "1,You are one of the best inspirational women to all woman who is very down to many things 2 I love gardening and a nature lover.love u dear", "drishtibasor": "I am a good painter or artist 😌,but don't have any degree abhi tak,and i want to be a part of this because bhot kuch sikhne ko milega apse or really wanted to talk you as a friend pr close 😅i don't know but it's a dream 😑", "annarose.jo": "I would love to be a part of this venture because I would love to prove myself that yes! Even I can dress up like you do. I do sing but not as good and love doggo's.", "socialpsychoclubyall": "People can fall in love with me because ill always be there for them no matter whatever the time is. It is easy to fall in love but staying in love is difficult and i make sure people stay. That's one. Secondly I think that i look beautiful when im wearing my fav PJ's and reading a book and sipping my coffee. @komalpandeyofficial @misfitdiv", "anji_tokas": "I would love to be a part of this video because i trust 100% that you will make something better out of me and i will get ahead with some great knowledge about my style (and style in general) after this... ❤️❤️........ What can make anyone fall in love with me is definitely going to be my (i) caring nature (ii) confidence (iii) fun loving nature🙈..... I love love love you @komalpandeyofficial ❤️❤️❤️", "bhartireema": "You dress better than many celebrities 😍", "priyatadhar": "Please do a video on everyday looks.", "em_reem03": "Hey komal i really love your fashion therapies the way to style indian and western styles #ohhlala 😍 i love to be a part of this giveaway because i really want you style me 😋 if ill be the lucky one finger crosses 🙌 1.my friendly nature 2. I am a dog loves 😍❤️❤️ i love doggos ❤️❤️❤️", "_mehax_": "🤤😍😍😍", "fathielat": "Having some time to spend with someone who i admire and watched growing on a platform since ages is just everything i could ask for!!! • I love to read❤️( am a bigggg potterhead too⚡️) I can make good desserts", "kk_khaira": "Wow...... @komalpandeyofficial u r fire🔥🔥🔥", "ibeshalu": "Im dead, im dead🔥😍", "dalimasingh": "4,5,6 🔥🔥🔥🔥BOMB❤️❤️", "_verma_harshu99": "1. I always wanted to style myself like you but I always fail at it, so I want a fashion Therapy from you to discover the other side of me which I have never discovered 2. I love sketching and I am a dog lover", "mannat_taneja": "The \"Khaleesi\" Of the Fashion world! Always ready to take on that Throne! 💓XoXo", "kavitachaudhary16": "Heyy. 1.Cuz your fashion sense is 🔥 as we knoww. 2. I love watching your vids andd love reading and movie buff.", "vijaya_parmar": "Hey komal I would like to be a part of your episode cuz it's just amazing how u style just one cloth so gracefully that to not in western but also traditionally... I love reading novels of Indian authors and I am a bharatnatyam dancer..hope to be a part of this journey", "yuvikabhalla5672": "🔥🔥", "priyapoddar": "I agree.... The very reason they started off was to bridge the gap between the celebrities and aam admi... And now I feel celebrities wear more do-able clothes", "neha_shekhawat_26": "(1)..Bcoz I have been watching you since popxo.. N u re such an inspiring women.. Nd I would love to get inspired more ❤❤... (2) bcz I am myself and I do wat I love to do.. Nd ya cook very well😄❤also a good stylist", "llsanju.39ll": "Loving the third and fourth look. 🔥🔥. Definitely gonna try to recreate those for this party season. ❤️", "muskan0807": "💯😍", "meghajain2308": "1. I would like to be a part of this giveaway because with new year approaching it's almost party time so I want to experiment a little with my look this year and at the same time still be me.... Can't think of anyone better than you to assist me with it! 2. Two out of so many wonderful things about me would be- (i) I am a beautiful Indian classical dancer (ii) I love to talk and eat :)", "___hash.96___": "Hi Komal! why don’t you upload YouTube videos?", "priyanka_vijayvargia": "Awesome episode💞", "_sanazafar__": "And this is the best so far😭😭😭❤️❤️❤️❤️❤️ how are you so perfect 😭", "kriti_dutta": "I want to be a part so that I get to experiment with my style. Shortlisting just 2 qualities will be tough but I will say one would be “bad at flirting but still do” because it makes the other person laugh and second would be “laughing at my own jokes” because it keeps me happy. If I am happy, I give the same vibe and even others are happy. That’s it.", "chaibeforeanything": "Awesome one Komal, need one help, can you suggest good face wash for oily skin, just not foam based!!!", "pradhan989": "You're so creative💜💜", "ayushihasija": "Hi @komalpandeyofficial I love watching your fashion theory videos, it's really like a therapy for me🌼. I love the way you style your cloths and I even try to implement your tricks and styles in my outfits. I want to explore more fashion trends and want to get out of my comfort zone. I love theatre and fashion ♥️", "sanchi.y": "Getting styled by komal pandey is something that is in my bucket list❤ to have an actual idea on what will actually look good on me❤ I'm an avid writer and a reader❤", "whitneywuzor": "Hi Komal, love your episodes. 🌻 1. I would like to be apart of this because it’s so intriguing how you’re able to come up with such amazing concepts and restyle clothes you already own without making it look like you’ve already worn them before. Also love the aura you spread through your videos to wear whatever your heart desires and own it with style and grace. 2. The 1st thing I’ve noticed is my Hindi. Apparently it’s very cute when I speak Hindi. The 2nd thing is the fact that I’m so passionate about following my dreams and inspiring people along the way. I know you said only two, but the third thing is I make a kickass masala chai ☕️ ☺️", "chaxfiles": "Too much leather for this weather 😉", "_piya_________": "U r amazing di.. I still use to watch your old content video.. They are really v helpfull still in many aspects.. And i would love to be part of your video not bcz i want to but it my need.. Bcz i want to become a youtuber.. But my parents are nt in support of it.. And i wanna prove them that its a good field and i can do best in it... Rest it depends on luck.. But i would try my best.. Now the 1st thing which ppl like in me is my bold and courage of keeping my views and opinion in front of ppl... 2nd would be my cuteness which usually create a charm on others.... And ppl usually complement me tht am a good orator.... That all di.... Despite all i really wanna thank you fr providinb such opportunities to we ppl.. This is really helpfull fr many ppl di.. U dont know u r helping so many needy ppl... Lots of love frm uss.. We love u 😍😍😍😘😘😘.. Keep going", "ritvika_mittal": "Wow ......so here comes the chance to meet my favorite fashion blogger...{1} I want to be the part this #fashiontherapy because i would love to rediscover myself and also my fashion sense. {2} I love doing experiments to make the things around me better and also i am a fun loving person and i love you too😉😉", "rosshniii": "I would like to be a part of this giveaway because I'm very inspired by your style! considering you as my idol I'm trying to blog as well. :) somebody would totally fall in love with me because I get very creative with gifts and I am an amazing cuddler :P", "yashabachhawat": "I would love to be a part of this because this is what I do. I’ve literally been inspired by you & I’ve been following you since a long time. I’ve been making styling videos. And obviously I would love to get styled by YOU! 😻❤️ I’m a good listener and a very chilled out person. And also that I don’t care about what people think. 💕", "zang_kesang": "1.i have been following you religiously .you seem very chill and your hard work really inspires me .I really want to meet you in person and you're funny too sometimes❤️ I could learn many things and it would be a big turnout for my life too .2. I don't have any hobbies as such ! But again I'm not shy to do try any of them .My best part is that I can be a good advice giving to any age❤️.", "diyamevada.2302": "I wasn't satisfied by giving just one like. It is not enough for what you are doing. This is awesome. ❤️😘", "_singhruchika_": "Komal you are amazing!!!! ❤️🙌", "harshitasinglaa": "Omgggggg!!!!❤️❤️❤️❤️ I would love be a part of your #FashionTherapy session. I just love the way you style & inspire so many girls out there. I just LOVE LOVE LOVE watching your videos. 2 things about me : I love dancing & I’m a big big foodie🙈", "roshna_30": "U are the best didi lotsoflove💕💕💕", "muskan_chhabra05": "🔥🔥🔥🔥", "mish7123": "@anushkatyagiii i love this song", "rainbowonawaffle": "Slaying it!🖤🖤", "sahajchadha": "@komalpandeyofficial 1. I would love to be styled by a Goddess such as yourself. Also, I feel like I haven't found my exact style yet and Who's better at it than you?? 2. I am hilarious as hell.... I use the skills to push a person out of a bad mood. And, I try and use proper punctuations wherever required.", "blazed_sane": "6 ways to buy such clothes if you are broke as fk!!????😭 @komalpandeyofficial", "kavya08__": "May be the definition of hotness🔥🙌", "joyita.dey": "All your style aesthetic is so authentic! Respect!! 💖💖💖", "artworld_2909": "On top last look🔥🔥🙈🙈", "_.ishitaa": "I would love to be a part of this because I’m obsessed with your series!!! I actually go on @spotifyindia to look for songs you’re using and try to find your outfits online!!!!! #fashiontherapy The two things about me is that i love my flaws,i’m on the curvier side and i want some styling tips! And the second thing is that i love makeup and fashion! (P.S.- bonus i can make you a good cup of tea) ❤️", "iamprincesshradha": "1) I would Loveeeee to be a part of this cuz I just adore u a lot..m always the first 1 to love yur posts and of course meeting u wud be like a dream 😍 2) firstly, I Love to dance and secondly I Love myself a lot and the people around me ♥️🥰", "__happysoul_": "Song?", "_.soumyasamrita._": "1. I'm a plus size girl and I really want to explore the diversity of fashion. I'm always forced to wear certain kind of dress because I'm chubby. But, I really like to dress up. Plus, you're my inspiration komal. I would love to be styled by you. 2. I love reading books, love dancing and at times I write short stories and poems. ❤❤", "yumnashoaib": "@naggyq so hot", "missnikitabali": "1. Never been styled by someone before and would like to see what can be done. 2. I’m as honest as it gets. Endearing to some and you know how it is for the rest.", "harshitha_b_n__": "Which song is this ?", "likhitha_ananth": "Look 4🔥 Bcoz I feel without fashion I can’t live, soo you are Love to pose infront camera Love to watch fashion hacks 💜", "priyankabohra100": "Your ideas are truly inspiring and unique and I love the way you carry all the looks so gracefully🤩🔥. Two things about me - I believe in being happy and positive so that the people associated with me could be motivated always!😇", "rachytamajumdar_10": "I have been following your fashion therapy from day one! And obviously saving them for future reference and using them! I swear they're life savior❤️ Earlier I was quite thin but suddenly I gained 6-8 kgs and started feeling very concious but you always have been soo motivating that even now after being chubby, I love my curves and flaunt them gracefully. And it will be like a dream come true to be able to work with the person who inspires you the most!❤️ And two things that I love about myself! I can sleep anywhere! Anywhere 😂 and I loveeee to eat!!🙈", "thesassyvogue": "Firstly, you are the queen of indian fashion industry😍 how you carry yourself is amazing❤️ i am following you since as long as I can remember.😍 Secondly, I really want to be a part of this because I am also a fashion lover just like you. Everyone used to make fun of me because I used to be really slim till an year ago and they used to call me with different names. But I always have been that person who loves herself the way she is. I try to be as presentable and fashionable as possible because I love this. Ik I am passionate about this just like you. Also, I would love to meet you and get your insights on all this😍 it would be my dream come true. ♥️ And, I love myself the way I am. I love how honest I am. I never pretends to be something I am not. Also, I am a chocolate lover and I never wants fancy gifts or gestures from anyone. All that matters to me is someone’s behaviour towards me. This is something which can make anyone fall in love with me🙈 last but not the least, I am an engineer working in an IT industry, following my love for fashion❤️", "divyaapareek": "1. Because I want to break the stereotype of things a woman can’t wear (coz theirs no such thing a woman can’t wear, she can wear anything she likes)and tell people I am not just a 9 to 5 or working machine. 2. 1st thing that can make anybody fall for me is My thoughts and deep thinking which I write 2nd thing is my ability to understand people and their feelings. 🧡🧡🧡💛💛💛💛 Love what you do", "mansi_ver": "I want part of this as i never get styled by someone else and if get a chance with fashionista like you I feel blessed😍😍. I'm a food lover and recently loose 12 kg so i kinda like younger you .🔖🌚#lovekomalpandyofficial @komalpandeyofficial", "theharshnalalwani": "1. Why let go the opportunity of meeting n getting styled by the best? 2. Am an unfiltered-original piece of madness ⚡", "parullllll_": "😍😍🔥", "krutika.nasit": "I want to participate because I started my instagram before 4.5 months @krutika.nasit totally inspired by you @komalpandeyofficial , you motivates me every single day. As it’s you giving away I #love 💞to be a part of this.. 2 things abt myself - first, I make videos on how to pose👅- check tiktok: katze_31 for that Second, ‘m a dancer😍  Love you💋", "the.dreamy.sparkle": "Ohhh myy godd....first of all I cannot believe you're seriously going to to do this😍😍😍 I meaannnnnnnn🔥🔥🔥🔥🔥. So firstly, I would like to be one of those 3 lucky ones BECAUSE I'm not one of those hot girls with perfect figures or I would say I'm a chubby one since the beginning. And secondly, I'm a fantastic entertainer, like anyone doesn't get bored when I'm there.(P.S. Aisa log bolte hain.😋) I love to sing, dance and oh! I can mimic too.😅😋", "nishi010821": "🔥", "vibhuuu_": "I would love to be a part of this because why not?Who doesnt want to get styled by a beautiful lady like you have always look forward of meeting you . Your boldness inspires me. Why would people fall in love with me? I am.good at ice breaking sessions lol. But definitely I am so passionate about.what I am pursuing and dis makes people fall in love with me .The way i share.my little knowledge and interacting with people so i know their personality!!🙌", "karshana_das": "1) Want to learn from you! Offcourse youtube is there but meeting you and learning something personally is just whole next level! 2)I am a nerd, i read a lot and love fashion offcourse.. not a pro like you but try my level best.", "ashiqaramesh": "So, I've always enjoyed dressing up and keeping up with the latest trends as far as I can! One thing that I think I lack is a sense of adventure to be query and style outside conventions. I have been a part of your Youtube Journey every since you were at 20k subscribers and I continue to watch you because you inspire me to think differently and explore fashion beyond what is considered \"appropriate\". Having said this, I would love to play dress-up with you and explore fashion/styles. Additionally, meeting and spending time with you personally would be the icing on the cake, haha!", "kanakchopra.18": "I would love to be a part of this because you’re real, you are someone who talks about the difficult stuff that others prefer not to plus i am all in for fashion. The two things are- im honest and am not scared to speak my heart and mind.", "amrutanani15": "Amazing ❤️", "khushii_sharmaa_": "I really want to be a part of this because I just love you and your style ♥️ and it will be an honour for me if I get something from you.💗 Anybody can fall in love with me because I am a good listener and book reader", "kajol_kd_98": "❤️", "shrija.mishra": "I'd like to be styled by you because you're A DIVAAAAA🔥. I'm really really inspired by your style and I fkn love youu❤️. And I lovee watching documentaries of people and I'm a dog lover", "dilipkatkar007": "Beautifull😻", "thebeaumondecollective": "YES KOMAL these looks ate giving me life 😍💕", "riyamodha": "FAB 🖤😍", "sunshine_girl21": "Pls comment for that FUR jacket. From you got those ?", "p_prachichawla": "Omg komal i just love ur work and these fashion therapy episodes are the best🔥😍 i really want to be a part of it because I would really love to get out of my comfort zone and feel good about my curvy body. It would be a dream come true for me😌❤ P.S. I am an emotinally strong girl and a foodie.❤️😘", "roy_anwesha_": "1.The leather dress.( so edgy ) 2.kind hearted 2. That friend you go to for advice on anything!! 😂😂 Ps: please tell us where can we get that dress coz totally obsessed ❤️", "smready": "You're just so gorgeous in anything and everything you wear! 😍 I'd like to be a part of it because as a woman with a pear shaped body, I struggle to find ways to carry and wear clothes that enhance my personality and shape when what is offered to us as styling advice is mostly \"layering\". I'd love to be a part of your creative energy and represent that shape doesn't affect fashion or style. The two things that can make anyone fall in love with me is that I 'listen' with patience and act with compassion and that I make my ideas and imagination come alive with my paintings and sketches. 💙", "anisamaity": "Woooow stunning... Soooo wonderful... It's really amazing.. Oh mu God komal this time u hv just banged on every single outfit.. I m just overwhelmed.. Love u soooo much.. Great 😘😘😘💫🎇🤙✌️u r incredible... LoveLove 💥⚡💛😚this is going to be littt💯💯💥💥⚡✌️", "unnatigandharva": "Who can miss this giveaway chance to meet you beautiful soul so everyone can part of this no matter what and btw I'm self lover so singing dancing nottankiii type of things I do to help people smile 😇 and who cares so love you and love what you done every time #keepgoing #FashionTherapy", "khurana.ji_": "Lady crush😭😍", "mrunmayeeb": "Literally, who wears clothes like this?", "khushi_jaisinghani_": "2. Love good and healthy conversations", "anushka.makkar": "Being the one with too much flab does not get u much styling options if your professional helps me to get styled it would be a great confidence to me tgat i can wear what i like .. I like reading and a cat lover music is life❤❤❤ @komalpandeyofficial hoping toget styles by you💕", "rojinkook": "I been watching you since you were in the pop xo. Loved the way u dress up. And everyday we r seeing the better version . I also wanna be the part of this give away but unfortunately i cant . Because i am from nepal . Lots of love from Nepal❤❤❤❤❤", "im.ur.gemini": "1. I want to be a part of this because well, I like your fashion (everything) sense and I wanted to know what you will style for me. 2. I love to read bokks and love listening music.", "swagata_001": "@a_muddled_mind bhaii egulo ki dress?? 😂", "laa_bella95": "1,2,3 whre can we wear those dress in India ???", "abhilashaapurva": "Oooolalalalala💣", "anindita.jpeg": "Because it would absolutely amazing to be styled by a fashion icon and someone who inspired me to pick up my pieces and start over once again, stronger than ever before. 1) I love all animals! Just looking at them fills me with joy. 2) When I do I something I love, like draw or read, I get completely immersed in it and I lose sense of all around me.", "nikita02_pvt": "Because every part is lit🔥as beautiful as confident as interesting like you❤️❤️And I am writer by passion and I love this thing about me💕😘loads of love to you @komalpandeyofficial 💕❤️", "cvbaybee": "@arrch.pvt GOALS HMM", "themomoninja": "@komalpandeyofficial I love incorporating bits and pieces of your outfits as I’m kinda chubby and I can’t wear some of the outfits you most . However I’d love to see some curvy girls friendly looks as well ❤️", "misswatimis": "Hey Komal.. All the best for this 3rd season of fashion therapy.. Let me tell you. You are getting better with every season. ❤❤ Now the answers- 1- I want to be a part of this BECAUSE it looks exciting and I have never been a part of something like this..and I LOVE YOUR SENSE OF FASHION.. So I know.. I won't regret. ☺", "brianpdsouza": "What song is that?", "aashi_aghi": "1. I have seen you growing throughout your content be it styling, makeup, healthy lifestyle videos, all these inspire me to follow you and try to implement all of it in my life, what best can be there to meet your inspiration and getting styled by her and to learn from her side of the story. 2. I love to eat healthy, go gyming to have a healthy lifestyle is my passion, like to travel and explore places, Interior decorations. Will discuss more when we meet. 😍🙈 #fashiontherapy with @komalpandeyofficial", "_smritimathur_": "Firstly ,.I want to be the part of this because I'm really curious to Find me in your own unique Style that turns Trendy Fashion into Comfortable Zone.. Secondly, I'm Passionately love dance ❤ That turns my mood on No matter whatever I'm going through, it can turn yours on as well . Just try it out peeps 💕💕", "hrisheka": "AHHH im so excited but here it goes I would love to be a aprt of this because right now i feel like i do have a sense in fashion but it would be great to have a professional like you help me out. I also have difficu;ties to appropriately choose clothes for my body type so this would be great and ive never won a giveaway either so haha. 2 things that would probably make someone fall in love with me is that , i think im a good listener and i love long walks in the nature. also congratulations Komal this is huge i know how much you ;love interacting with us love u", "simran.rohra": "1. I've been watching your videos for a long time and I've always thought that it would be so cool if you could give me a makeover! 2. I sing and I love it, every single cell in my body loves to sing. 💕", "ri_tu_par_na": "If you could bring up something to which we could relate, that would be more interesting😞😞", "grishma_destiny_onta": "👌😻", "dhaarna_srivastava": "Being a part of this can meet u 2nd people compliment for my eyes that i got beautiful eyes ♥️ and i look like bong but fun is m not a bong 3rd i really need a makeover @komal pandey", "pallavi.narayanan": "Why would I like to be part of this... Because I really need your help here. My clothes are all outdated and I need some inspiration to try something new. And 2 things: Firstly..I love pets.. I have a parrot and is on planning to get a dog and a cat... And secondly I am singer. I don't actually sing much in public. But Something I enjoy myself and also entertain my family and friends! :)", "13_palak": "Hey! Firstly, I want to be a part of this series is even I do experimental fashion and I own what I wear, because I dress according to my body type. Okay so the thing which I love about myself, (because what others think does not really affect me ) is that I love to pose for the camera, I'm a design student so I usually try different things for experience and to attain that level of creativity. That's it. Thank you. Regards.", "hafsa_patwary": "1.it's my birthday month so why not a gift from my favourite YouTuber. 2. I m a huge bts fan💜. I m a Bangladeshi and a Muslim💜.", "meenalmool": "Dear Komal ♥️ @komalpandeyofficial, . I don't know from where to start! You are such an inspiration. I've been watching you since years  and I can't tell you how much you inspire people for fashion and styling. Every of your post gets even more better from the last one! YOU HAVE TOOK BLOGGING TO THE NEXT LEVEL! YES YOU! ♥️ Your inspiration has led to many of the people choose blogging as a career. Your content is always new and much more creative! While watching your youtube videos it feels like having one on one conversation! While stalking your instagram I've been through your earlier posts (from your first IG post and till date) and I realised how much effort you might have took for reaching this level. More power to you! Really love watching you! XOXO ♥️ . Two things of me that would make one fall in love with me are 1. I make really good conversations 2. And My choice of songs (playlist) ! ♥️", "_.k.a.v.e.r.i._": "Can anyone tell me what song?", "meenalsingh97": "i can wear all the outfits 1st - coz i love both experimenting and danger 2nd - i am the defination of the word unique", "art_e_fact01": "4th & 5th was best", "kd.shweta": "Wowww♥️♥️ 3rd one", "goenkatanya_": "In love with your outfits💕", "dhalkomal": "Firstly because you are amazing. I love how you embrace your body and in meanwhile make people fall in love with themselves. You are my style inspo. Secondly i am a constant learner, i always try out new things and i am a very optimistic person. ( plus I'm a good listener too)", "im_dat_gal.yeah": "I MEAN THIS IS....OMGOMGOMG YOU ARE SOOOOO AMAZING!!!🔥🔥🔥❤️❤️❤️😍😍😍😍😘😘😘", "____spacecadet____": "Only the last 3 looks were relatable. Rest are too much of skin show for Delhi’s winter.", "_dooms_girl_": "1-I like to meet people like you who are inspiring and make a wonderful space in such world in a different way.. That make them so special... 2.-.I'm a animal lover where they are dog, cow, cat, or any animal i just love them..and i love nature.. ..you r so inspiring komal.. Stay blessed ♥️", "feedteachtrip": "1. You've revolutionized fashion. You have a very intelligent way of dressing up without even realizing it. There is always an undertone of kindness in the way you speak. Grateful to you for being a fashion rebel with a cause. 2. I'm a social science teacher who can can cook up a storm. :)", "dr_sneha_hr_": "1. I’m in love with your styling and the person you are!!!❤️❤️❤️Always wanted to try your style but never done it..because I end up thinking a plus size girl like me might not be able to pull it off.. 2. I’m a doctor and love fashion and makeup.. have a crafty brain and love to do art and crafts..love to click pictures.. nature lover..love dogs..and always love to travel!!!", "thetamelesssoul": "Damn woman 🔥", "temperamental_hemera": "Your fashion sense compared to mine is very different, so it would be a fun little experiment to see what you can come up with. Two things are 1) my willingness to try and experience new things 2) my optimism.", "anu_priya_98": "😍😍😍😍😍❤️❤️", "___bibliophile__": "I am slowly realising how much bravery fashion requires . because I don't have courage to wear what I want to most of the times . 😭", "twinklekhatreja": "Hey komal,i am Twinkle and i am really interested to get styled by you because i am really experimenting with my style as i want to reflect my personality in my style. Also,i just began with my YouTube channel and i feel that it is one of the best decisions of my life. Also,i love to go for debates and declamations. You are doing great. Lots of love and luck to you gurl❤️❤️❤️", "pinky.gill3": "@saijal_nagi, please don't get offended by my comment.m just questioning bcoz i have not seen any one apart from celebrities wearing those clothes.", "_miss.choudhury_": "You took my breath away😭❤😍", "xodeelha": "1. I think your style is really wearable at the same time looks edgy and classy which really wins over everything. Would love to be a part of it and give my style an oomph 😘 2. My smile 😅☺️ I’ve reading 💓💓💓💓💓💓thank you", "yaminiagarwal28": "I would like to take part in this cause I like fashion and you explain it perfectly in your own way....I just love your ideas......secondly, things which can make people fall in love with me is my nature and my cuteness...@komalpandeyofficial", "02.shivani_bharara": "First of all amazing content😍, I have grown up watching your journey of transformation from popxo to making your own insta and YouTube videos and trust me @komalpandeyofficial all of this has been so amazing and inspiring. I love the way you style your pants with anything and everything. However having a heavy lower body, I have never been that confident about pants. It would be an honour for me to be styled by you and get some styling tips 😉. 2 things about me:- 1 very caring and generous and can do literally anything for my besties. 2.love love love dogs and helping them brings me joy and makes me feel pawsitive🤗, also love doing calligraphy.", "aishwaryapadhi": "All the looks are 🔥🔥 also love love the background score🙌🏻", "mira_9249": "👌👌💖", "its_june_girl": "1. Would love to experiment with my style and also would like to meet such pretty and fashionista♥️. 2. I am party dancer also trained in kathak and very fond to learn new things♥️♥️", "shilpi_sapra": "1. I would love to be a part of this as m someone who loves loves loves to experiment with clothes ,colors n style but struggles to do so bcoz of my body type would love to learn take help from someone who so stylish n spot on. 2. I love myself (something every one adores about me ) and have been feeling that it's fading i wana fall back in love with myself again , secondly i believe in keeping it real :)", "_nimisha_singh_": "1. I'm planning to have my own youtube channel. So apart from learning some absolutely lovely tips on fashion I would also be able to learn about how all this works. 2. I love singing. Lately I've gained interest in poetry and I'm learning how to be good at both of them.", "kamaljeetmann": "💥💥", "aishabee30": "U have the best style 🔥", "sakshivermaaa": "Hey Komal, I'd like to be part of this seasons #fashiontherapy because I'm little curvy and this could be the best way for me to try new style and that by you. I'm going through a phase which will help me alot by this right now. I love fashion & possibly experiment every time I get to do it. I think anybody would fall in love w me because 1. I'm very caring when it comes to my close friends and 2. That I'm big time food loverrr.", "rainy_rays37": "@komalpandeyofficial You're my fashion icon❤️ I've been following you since loong! So getting styled by you would be a pleasure🙈 ; Two things that can make you fall in love with me? Well I'm a nerd but not the boring one😉 I can make you laugh all the way long and secondly I'm a self learned dancer🙈 and a great listener too❤️", "mickey_love_for_life": "Hey😊....Recently I was jz gng through yotube and saw ur video of what to were in college and I jz loved it was so helping and I went and saw almost all her videos of you and trust me ur the one of the reason I opened Instagram jz to get in touch with you lil bit n improve my styling skills with you....you doing a great job really thankful for that and hatsoff to ur hardwork it's seen in ur videos ❤@komalpandeyofficial 🥰 I'm jz love to style and I tried to take part in your YouTube channel that u style ur subscribers bt i was late 😓I would be the happiest n thankful person if I get a chance to meet you and be a part of it 💋😘pleasseeee style me........ 😊", "reusily": "Gurlll 🔥🔥", "farinhimu": "Hott hotter hottest day by day😍🔥🔥", "snuggle_storm": "❤️❤️❤️❤️❤️", "iampronitabarua": "Okay, how can we wear this and walk in the streets ??? Or where you suggest us to wear this ???", "niks_dhankhar": "Being styled by you @komalpandeyofficial will be the best thing !!! Things about me : loves fashion, kind and music lover!!!", "sakkshiii": "I would love to be a part of this to meet you and get styled by a person who actually is an inspiration to me in every kind ! A person can fell in love with your personality and how you carry yourself your style. I guess i can make a person fall in love the way i carry myself and my love fpr drawing things i love 😀 . Whether get selected or not it matters that you keep going and growing!! Lots of love 🌻❤", "ritikagautam490": "1. I want to be a part of this bcz who the hell don't want to get dress up by komal pandey 😻 2. I love myself isn't it enough?😂 Plus I'm a good girl or u can say a good sangat 💁", "thisisdismiti": "1. I would like to be a part of this because for me it would be both an honor and opportunity. Meeting and being styled By you would be first a 'fan girl' moment for me. Also, as I'm a fashion enthusiast I believe we can exchange many ideas. I am certain, if I be a part of this, not only I would wake up the next day more confident, informed & strong but also I'd know at least 2 more things about styling.", "almightymaity001": "The 1st,3rd and 4th look killed me. ❤️🔥", "haze_joseph": "Aspire to be a blogger like you and santoshi..♥️ a huge fan ♥️ things dat can make somebody fall in love is like what u always say to \"be yourself\"🌠 I love how u enlighten styling simple yet classy..lots of love @ komalpandeyofficial", "sakshitaneja95": "Who doesn't want to be a part of this. I love your style, have seen you styling from Sarojni to Zara and ofcourse i love what you do 🌸  Two things about me- living a monotonous corporate life but keep dreaming about fashion and styling. I'm creative and yeah i'm a food blogger too! ☺️", "someone.say.book": "Komal you're such a doll! I love your videos and how effortlessly you put the look together.. :)", "chubby_forever_": "I’m a curvy and a short girl from north east and can’t figure out what to wear and how to look attractive and you are one of the most admired fashion blogger so I want you to style me and give me a new starting. I love watching YouTube videos especially yours 💕", "himshikhacandaik": "You look like Kim K in this video. 🔥 I want to be part of this because I feel I best express myself with fashion and why would I ever leave a chance to meet such an amazing women personally ❤️. 2 words about me(I won’t say describe me because 2 words are less to describe a person) are Vivacious and Cynophilist.. C you soon 😜", "shivani.chandak.71": "Last 3 were insanely hard❤️. because its komal pandey girrlll🤩;we need to meet for that matter😘💋💕.xoxoxo❤️", "_sharvaripatil_": "Hey komal, 1. Well firstly working with you is like a dream come true. I am a content creator myself and I have always admired your work. I am very open for experimenting with fashion and always excited to try new stuff. 2. Well the thing that people love most about me is that I always have solutions to all their problems(Especially for fashion emergencies). I am officially termed as the most ‘JUGADU’ in the set of people I surround myself with. 😂 I stay in a hostle and all my friends turn to me when it comes to fashion or makeup emergencies because I always tend to help them out with what to pair with what (even with the least availability of clothes to style) and no one ever gets disappointed and tbh I love helping them out, it shapes my skills too. So they absolutely love me for that. Basically, people love me for the caliber I possess to improvise with fashion and styling. I am really hoping that you like my entry and select me because you have always been my favorite and most adored fashion icon. Working with you would sure be a dream-come-true experience!❤️", "shanaya_rs_": "🔥🔥🔥🔥🔥🔥🔥🔥🔥", "_sanjanaaaa._": "And about the second thing, I think my friendly nature and my dance would make anyone fall in love with me 😁😁🤪🤪🙈💕 @komalpandeyofficial 🖤🖤🖤", "mini__009": "1. I myself like to try new outfits but i'm shy to wear them ..i too is a fashion enthusiastic so would love to be a part of you videos 😊. 2. My loquacious nature plus dancing @misfitdiv @komalpandeyofficial #FashionTherapy", "coloredliner": "i would like to be a part of this because i cant style myself ever lol. i love reading and i love to make a difference in other people's lifes.", "ikajalmehta": "I would love to be a part of this because you inspire me alotttttt like yes alottttttttttttt 💋 and M excited to meet you n also it will b fun having a time with you who is a guru of fashion therapy. I wish to be a part of this because i think i dont experiment any dressing on myself cuz i wear things that i think whatever suits me . So it will b fun if i experiment different kind of outfit or clothing that you think would look great on me 😍 cuz i never try it . Cuz i think it may not suit me. And i love cooking 😬 and doing make-up 🙈 cuz as a profession i am an makeup artist.", "ummehani_ma": "All the looks are bomb 🔥😍❤️", "preeti.r.rawat": "You are awesome as always.🔥🔥🔥🔥🔥🔥🔥.", "anmol._setia": "So I'm fighting my odds and accepting my imperfectness by starting vlogging just like you .Malz and You are the only two people i look upto and who started their journeys just like I'm thinking of starting mine. PS just like you said in Malz video even my friends look upto me for the fashion and stuff but after your therapy, that would be a great learning for me and the people i suggest indirectly.❤️", "she_luminated": "Aah. Finally it's here. Loving the new series and it's gonna be epic! 1. I am a fashion enthusiast and just got on the fashion and styling ride. Hence, would love and be super grateful to be styled by the person I look upto for Fashion and styling ideas to make my own & your journey and videos inspire me to do more. 2. Two things which can make anybody fall in love with me - I am photogenic and I love to watch movies!", "rose.preet101": "😍😍😍", "apibage": "Wow❤❤❤❤# komalpandeyofficial", "s_u_c_h_a_i_t_a": "dii u r our inspiration.... really dii love you keep growing 😍😍😍🔥", "in.biswas": "1. I love the confidence with which you pull all ur looks.. which is truly surreal to watch!! 2. I feel i am a creative person when it comes to gift somebody something.. Also, I am a typical grammar Nazi", "chevron_98": "I feel like you're an artist and honestly you changed the game of power dressing. And of course you chase instead of pleasing so who doesn't want to be styled by you. well one thing I'd like to say is that right now I feel like I'm a storyteller and I loveee Frank Sinatra. Can't wait to have a conversation with you and tell your story. Xoxo.", "koke_penned": "Hawwtieeeee🔥🔥🔥🔥", "ananya_.roy": "Killing it 😘😘😘😘 My fave look is the 5th one. Can you please give me the list of dressess and brand names n? Love you 💕😘😘🔥", "vaidurya_vernekar": "How more classy can you be !!!💞 Every time 🔥🔥you make sure it's a worthwhile watching your contents", "instaaish": "4&5is my fev", "thedivinedrug": "First of all i need to tell you that you look freaking amazing. I would love to be a part of it because i always take fashion in a very minimalist way and have some hestitation to try on different styling because of my body type. I would love if you can help me with it. 2. I m coder who loves fashion, a dog lover and i can cook some mouth watering food ❤️", "rupam_guptaa": "Soo happy to see you back with the new season💛💛. 1. I would love to be a part of this because I think you have all the knowledge of fashion and I can learn a lot from you.. Second I wanna meet you for soo long.. 2. I have good sense of humour and I'm a big fan of reading", "strangeladki": "I would like to be a part of this giveaway because I feel that somewhere I still struggle to find my own sense of style in this big crowd of influencers and fashionably confident people. Through this giveaway, I think I’ll be able to find my inner fashion persona and be able to put my best foot forward. The thing that I feel people like about me is that I’m a comforting and a non judgemental person. Being mostly a listener, people feel valued and respected around me. The other thing that makes people tag along with me is my positive approach. I usually don’t let my happiness be compromised for materialistic stuff. Love you @komalpandeyofficial", "baagherbaccha_": "WHAT A DIVA!! 😭😭❤️❤️", "vituperator_18": "1. Because You are an inspiration to me and your fashion therapy videos have helped me so much. I personally adore you and I want you to help me more 😭 2.(a)When it comes to love I am a giver, I appreciate each and every single thing I have. (b) I never give up on things easily.", "bhawna1bhardwaj": "Girllll ur game goes stronger and beautiful day by day!!! U r the fashion queen on indian insta right now😍 i loveee to be styled by u one day as I m a normal middle class girl but with so much have in my mind for these fashionable things nd i hope one day I will fulfill them allll☺ i m cat lover anddd a biggg tym foodie and I love gosssips😍 and yes m meri favorite hu type girl😆", "mansiwadhwani24": "I don’t think that I liked any part of it infact i loved the whole of it. And things that might make anybody fall for me is that I love to stand on behalf of people who can’t express their own opinions and second best thing might be me following @komalpandeyofficial ❤️ as an inspiration and carrying myself accordingly.!", "priyamarvelous": "Was waiting for this for so long❤️❤️❤️😭", "hashh_8_": "I want to be part of this because I like the way you style even simple cloth with your style humour and positive attitude.... today's 4th look is my favourite ♥️♥️....love you ♥️♥️keep it up....I am a soft hearted person who can never hurt anyone and forgive everyone very easily...I also like cats a lotttttttt.😅", "bhawana_o_nana": "I am beauty blogger myself, I play alot with my makeup and create different looks quite often but i dont play alot with my style, here I like to stay in my comfort zone so what better way to step out than the queen teaching herself!? I've a lot of different types of clothing items but I end up wearing a black t-shirt while filming tutorials i dont know why! I need help😂 I'm creative when it comes to makeup and my personality is very Fun Loving type, these are the 2 things that I think can make anybody fall in love with me 🥰 @komalpandeyofficial @misfitdiv Would Love to be part of it☺️", "vishajain71": "LOVE THIS🙈💕😭 I would love to be a part of this as I love experimenting with clothes and try to push myself out of my comfort because when you love fashion, you gotta go all the way✨. As to the two things, I am a writer and a poet. I believe that words can change the way you feel and make you a better person. Secondly, I am a huge history geek. I love the tiny bit and pieces or stories of the past. I just love knowing how and when things came to be. ✨ I would love to be styled with you🙈", "twinklee102": "@ankita_lakhera babe❤️👩‍❤️‍👩", "arushi_aps": "This was amazing and when i saw the last look i was like omg this girl can do anything. U are magic!❤️❤️", "sadpvt": "1. I’m still trying to figure out my style, and I need a new wardrobe soon! 2. I read a LOT, am an Indian classical dancer, and dapple now and then in photography :)", "dear_tahia": "3rd look I loved most....it's soooooo good❤️❤️ I love to read book,I loved animal specifically goat❤️", "_._pujagogoi_._": "1. Because I need support from my fashion idol @komalpandeyofficial as I have recently started my own blogging account which is @pujagogoi130 2.I think my smile and my honesty are the reasons, also when I am all traditional besides I am a dog lover❤️. Also lots of love to you @komalpandeyofficial .. keep slaying like u always do🔥", "_ecstasii_": "Please suggest some outfits for chubby people ..coz not everyone is skinny ..n we too want to look good 😭 fashion world shows things for only skinny people..we chubby healthy faty people ko sundar dhikhne ka right nhi hai kya 😭😭😭 please look forward to this topic..", "iaminlove84": "1. To get out of my comfort zone. 2. Funny and full of life..", "dhara764": "😍😍😍", "reshmakumar80": "This one s the best so far (6ways series) And this is truly #hollywood standards...gr8 going #komalpandeyofficial", "preity_mehra": "Hey that bodysuit is from!?", "siddhi_parab": "You slayyy🔥🔥", "nehaa.verma207": "Hey I love experimenting on my self . I have learn so much from you I don’t think there is any other reason then to be the part of this n get the chance to style by you !!! 😘😘😘", "rutujaaaaaa_26": "1. I want to be the best version of myself 2. I love love love listening music 🙈❤️ @komalpandeyofficial", "jasleenthakker": "1) Gets super difficult as a med student to keep in trend at college sooooooo need a makeover 2) Love doodling and penning down thoughts love love love @komalpandeyofficial ❤️❤️", "_.oindrila21._": "Mah favourite has to be the 4th outfit 😭😭😭 And also the last one. ❤️❤️❤️❤️ Eagerly waiting for the next episodes.", "sitaaronkimusaafir": "Watched the video thrice! Can't get over these bombshell outfits! Would really love a chance to meet you and discuss fashion. I'm waaaay too self conscious but I secretly love dressing up and have fashioned my wardrobe out of most of your recommendations. I'm a bona fide food connoisseur and love reading. 💖😁", "theordinaari": "One, I am confident and not ashamed of my curves, i rather flaunt. Two, dilli se hoon bc (a punjabi and a bong).. 😘😜😉 #fashiontherapy", "mridiniy": "pls swallow me ok bye", "debolina_das_25": "This is smokey hot @komalpandeyofficial ❤️🖤", "aditimishra31": "Firing 🔥🔥🔥🔥🔥❤️❤️😍😚❤️🔥🔥🔥", "c00ral_es": "1 cause I love how there’s no boundaries while you’re styling 2 I’m a Persian yogini who had fallen in love with India", "eva_narang": "1. Bcuz Komal, Ur simply ammmazinggg! Everything about u is 🔥 ! Ur content is out of the box anddd .... U slay ! U bring all kinda fashion here, elevating this fashion to an unexpected level! I don't find any reason to not be styled by u, Komal❤️❤️❤️ No matter how many fashion blogs I see... Urs is actually a therapy! Like for real! Rise n shine u fire lady!", "shivanijais99": "I am want to be part of this because i am fashion freak and i love your style always and tend to follow your style. @komalpandeyofficial Things that will make people fall in love with me because i am kind, i take good care of myself, i create good trust among people, and when someone is talking to me i keep my phone aside and listen to them and i am emotionally Available all the time ♥️😜", "nityatomar21": "Well, it would be really fun to watch myself being transformed🙈. Reasons people kinda like me- 1)I make funny faces😂 2)I dance dil khol ke❤️", "saumyavageshwari": "1. Because I wanna meet you so bad you are an inspiration also it will be dream come true to get styled by you😍, and need some new inspiration for my style 2. Love getting clicked, shopaholic, fashionista, love to travel. Looking forward to meet you❤️", "i_dream_i_travel": "She has the body 😃❤️ Goals 🙌🏻", "iama_queen": "Well getting styled by is surely one of my dream is turning into reality. Komal Pandey is a diva and I just cant miss this golden opportunity. Trust me... love you to the core. My qualities that can make anyone fall in love with me is my kindness and humbleness which gives that comfort to anyone. Secondly my talking eyes... I get a lot of compliments to that. Other than that I love dancing, shopping and exploring new things. ❤️❤️❤️ Love you ❤️❤️❤️", "shawna.correia": "Honestly I would love to be a part of this because I love fashion and you are a living dream when it comes to fashion. The things I love art, music and ,dressing up .lol😋😂", "shivi_sharma1307": "😍😍😍😍😍damn!!!!", "lavanyathukral": "1. I really wanna be a part of this because u inspire me soo much Your journey is really breathtaking❤️ Also I love fashion so I would really like to be styled by a fashion specialist like you 2. I love chilling, reading and doing yoga", "sanchitanath8981": "OMg ❤️❤️❤️😍😍😍😍😍😍🔥🔥🔥🔥🔥🔥🔥🔥", "staticwear.in": "Check out our site for customised party wear Jeans🔥", "anjaliv25": "Second thing would be -- m a outdoor person. I love going movies, for lunch and cafés and just chill out .. I enjoy my life my way k dnt give a damn to pple so this makes people more attached to me and also ull get to knw more abt me . Dats all I can say. So fingers crossed. Hope for the best. ❤️u loads n keep inspiring us. Thx @komalpandeyofficial", "evssnicolekujur": "You have such a OUT OF THE BOX kinda style. Which I absolutely love it to the core. I really want to try on your taste of outfit. And then I may probably say that I am styled by THE KOMAL PANDEY once😭♥️. Not anyone but I rather do things to make myself fall in love with me over and over again😌", "rakshaagarwal_": "I would like to be a part of this because It is a great opportunity to be styled by you @komalpandeyofficial and I wanna earn and feel that golden opportunity from my fav fashion influencer. ❣ From my point of view I love reading novels and I can't sleep without reading some pages 🍃 and Second i can dance very well 🥰 as I love dancing because it gives me a very confident vibes and boost my energy ❤❤ @misfitdiv", "mywishoky": "First of all the bar that u have set through this video is crazy look number 4-56 is sick ... Haven't seen any indian do this before Secondly was going through a real rough time but your video with malz helped me guided me like no one else ...it made me realise that I loved someone more than myself and gave a lot of me to someone I shouldn't have . I finally realised and I am working on myslef ...so that I love myself before anyone else. ...have already taken few steps towards it but this opportunity might be the biggest step And , two things. .that can make anyone fall in love with me ...uhm no ,, I would tell two things that makes me love myslef even more ..bcz gotta take care of my love first . . I really love dancing I am at my best when I am dancing ...and other thing is that I am a chatterbox and a *mahaul* in itslef ,😂😂😂hoping for the best bbye", "harsheen_gandhoke": "I want to be a part of it because firstly I would love to get styled by you and secondly I love to experiment new looks and with different styles. I am a total dog lover, also I’m blessed to have a dog as a part of my family. And I love styling and dancing.", "thevivacioustranquil": "Hey, I would want to be a part of this coz lately I have been losing confidence in myself because of my increasing weight, it's so bad that I literally dread looking at the mirror and I feel that being styled by you could make me feel confident about myself again. The two things that people love about me would probably be that I am a great listener and at the same time the chirpy girl everyone loves being around. Also, I kinda' make sure that people feel comfortable around me. 💙", "aditi__0099": "Where is this bodysuit from?", "supriyabhat.sb": "1)It is a great privilege to be a part of your fashion therapy video. 2)I love painting, sketching, designing and stitching, styling and dancing", "itanishai": "I would really like to be a part of this, as I'm still trying to find my style which shouldn't be limited to some predefined ideas. And it's only a bonus that I absolutely adore you. About me, I love to read, I've got this mini library at home with over 80 books having read 50+ of them, and I'm a software developer by the day, party lover by night 😛", "maushmi_211": "1.)I would always love to be a part of anything which is related too @komalpandeyofficial because I love her fashion and herself theee mostt❤️ 2.)nature and 2nd is my voice", "makeupbygaayubaktha": "1) reason is very basic. I just love to get styled by the best ever stylist that one could imagine.", "yourabr": "Loved the second look (white one) ❤️❤️ actually the jacket one two...The skirt one also ...Wait wait the last one too. That's all 😂😋❤️ coming to why I want the giveaway is because I came ytff delhi and due to the heavy rush of boys, could not get a chance to come say hello to u 😑🙄, waited so much in line and then around the lift, if u remember, you wore white off white blazer and had a trolley bag, anyways I would love to be styled by you, because I have always dressed in a particular way and I want to breka-free from that, and who is the right person than u, 😍 me, well I am a storyteller and girl from a small place who is trying to break some stereotyped image of village girls the nation has, I am also the proud dog mom of @beegu6 😁🎉. Hope your team is generous and picks this comment ...Fingers crossed ..Lots of love❤️ muaaah komal", "manyaaaaa_05": "The reason i really wanna be part of this is because i have leart so much from you nd because of you my fashion game has been uprooted nd i have started loving myself! You r my true inspiration nd my idol. 2. I love dancing nd i understands a person's vibe very instantly nd mix up in the person vibe and i love baking nd doing makeup and dressing up!", "neha.mittal_": "1. Why would anyone need a reason to nott to be A part of this. I really want to meet such lady who fought all the odds plus coming from an ordinary family and making such videos and inspiring a lot of us to fight back. 2. I'm an social activist currently looking studies of 5 children from poorly and backward region who were into rag picking and also a counsellor for for all the depressed and scared kids out there and I guess this is my USP to which I love myself a lot and anyone could (I belive this😛)", "ru_chi22": "Yuck 😂", "patni_aayushi": "Q1) I would loveto see a different version of myself. Q2) a. I am a funcy monkey who loves reading & b. I love talking, I can talk to anyone, anywhere and won't make the other person feel uncomfortable.", "saniya_3456": "Would love to be a part of this .I want to be a fashion designer so experiencing this with a fashion icon like you would be a great experience .I love drawing or doing anything creative also I talk a lot 😊♥️😊♥️♥️😊😊♥️♥️♥️♥️😊😊😊😊😊♥️♥️♥️", "_medhaverma": "1. I watch all your videos, but being an XL I don't know if I can pull off something amazing like you. If you can style me, maybe I will know how to be more confident and comfortable and I will find my own style! 2. My sarcasm and humor is on point, I love dancing, dog lover❤️", "shivam_kamboj_2020": "❤️😘👍", "sabbyclicks": "Could you also please tell what lippie you are wearing? 😍", "_manasareddy_": "@komalpandeyofficial has bought a revolution in indian fashion blogging . Am sure every blogger out there aspires to be her just like me.A fashion therapy session from komal pandey is all i need ! To me fashion is like my flesh and skin can't live without it . I would love to wait for tht day to be styled by this fashion icon herself.", "haleemaobaid": "Gorgeous😍", "khushii_tiwariii": "Okayyyyyyyy so perffff😭🌹", "surbhi0803": "1. I would like to be a part of this because wedding season is around the corner so with your fashion therapy maybe I will look more glamorous☺️. 2. Two things about myself is that I am not a person who holds up with things and I am a dog lover🤩", "___samarpita__": "The video was amazing ❤️1. I have loved your style forever, and the clothes that you pick out are just OMG so good...& yeah I have a wish to become a fashion blogger in future... So I would like to meet you to know about all of this. 2- I really don't know why someone would like me based on some quality... Bt I love reading books, especially romantic novels and inspiring stories. And secondly, I love dogs... I have always wanted one and last but not the least I love experimenting with my clothes or my outfits. I would love to meet you, Komal di ❤️", "drkalania": "https://youtu.be/e7yD2T_9JnU =LISTEN DR KALANIA VASTU FENGSHUI EXPERT SINCE 25 YRS MUMBAI -- HOW WRONG VASTU AT HOME OFFICE FACTORY AFFECTS YOUR BUSINESS PROSPERITY WEALTH CAREER RELATIONSHIP MARRIAGE ARTISTIC LUCK STUDY ETC M 9820219050 www.fengshuiin.com", "prachiagg04": "The feeling when you open your Instagram after a boring class and first thing you see is #fashiontherapy ❤️❤️❤️❤️ 1. I want to be a part of it since I was never been much of a stylist but the last six months i have improved a lot and I have always believed in you as an inspiration, so it will be great to work with you before the year ends!! Yeah that will be best part of the year 💖💖 2. You will love me because I love what I do and I’m weird but in a cute way (that’s what my bff say) also yeah I’m a dog lover and also a pet parent (my dp also shows that 😜) and I have a mini library of my own in my house...😋😋 eagerly waiting for your reply 💖💖 P.S. my pet dog is a beagle and beagles are really playful and loves meeting new friends so not only me but he is also excited to meet you 🐶🐾💖💖", "prepapapa": "1. Just for the experience that I’m sure would be pretty . 2. People love because I love me the most. *Hearts Hearts*", "aishwaryaguptaofficial": "Nd I love fashion nd I love u that’s it please wanna be a part of it", "_binge_eater_": "God Idk which of these outfits is my favourite😭❤️ Season 3 is back with a bang🔥", "stylewith_sakshi": "1 - I would like to be a part of this because you and your style inspire me a lot. You’ve become a fashion icon globally and you carry yourself in such a graceful way that every girl wants that confidence in herself. Your dressing sense and your uniqueness is top notch and I always feel so glad if I manage to look even 0.1% like you. 🥰 2 - My passion for dance and fitness. I believe that everyone should be active and fit so I try to inspire other people for the same.😇 PS - I love you @komalpandeyofficial ❤️", "anny.lamba": "Wow, you are a stunner poonam🖤🖤", "priyashukla10": "Which song ?", "_inaayachowdhary_": "Oh. My. God. 🔥🔥🔥 Look at you!!! ❤️ Loved the second last look with that blingy blazer! 😍🔥 @komalpandeyofficial", "sharma_vironica": "I would like to be a part of this cause I love @komalpandeyofficial so much and I love her style and it would be a life time opportunity to get styled by her 2. Two things about me is I am literally a strong and confident person and I am proud of my self", "ohmycloset_09": "I would like to be a part of this because you really inspire me so much and it ll really help me learn so much if I get the opportunity. The first thing is my content it’s simple and fun and I always hope people can relate to it. I don’t really know the second thing but if I still had to say I’m quite low maintenance I would say :) Anyway, love you and your work. Mostly importantly your level of confidence & hardwork is something I wish to have some day :) but I’m trying", "s_samreen2696": "I want to be a part of this because I want to learn how to style outfits from your videos and I love watching your content💕 The two things which I get alot of compliments about is my height🙈🤷‍♀ and I think people who are close to me love me because I am very upfront and never sugar coat my words to make anyone happy. I lost alot of friends and got lot of hate too but the people who are close to me know me well🤷‍♀", "snowy_secret_0o": "U r top ! 😘😘", "sha__saima__": "😍😍", "she_quaintrelle": "Komal 😍🔥🔥🔥🔥🔥", "lifeofkitu": "U r looking fab in black 🖤 and my fav colr is also black . 1) i would love to be part of this becoz i always wanted to be blogger just like u or any other blogger , but was not able to 😊 that's ok . 2) and the second thing is - I AM ME 🤗 Simple and Sober with whom anybody wants to fall in love ( smalltowngirl) with good Nature And clear mind 👻", "kartika_ashwin": "Love all the looks so runway ready like looks 😍😍 also the bg song sets the vibe totally😍❤️@komalpandeyofficial", "pootato_": "I would like to be a part of this because I feel I have a very restricted wardrobe, I don't let myself buy things that are a little out of my comfort zone. Also, I am nerdy as well as fun, this is a weird combination but people seem to like it so...", "mannatbhallaa": "1. I myself am a budding blogger and it'll be amazing for me to learn from you while you style me. 2. Anybody can fall in love with my confidence, my energy level which stays as high as ranveer singh's at all times😂 and definitely my dance moves. @komalpandeyofficial it would just change so many things if i get a chance to be styled by you ❤❤love you", "apekshagurnani": "I love how Fashion Therapy teaches us to style so many outfits in a different and unconventional manner. I would love to see how Komal would style me. The fact that I would get a chance to meet her and learn so much from her excites me a lot. I love to style different outfits and do makeup. I also enjoy working out. Can't wait for the results 🥺❤️", "shemosankar": "I would like to be a part of this because I like how you see fashion as a therapy, instead of a job/chore-you-do-for-money. I would like to indulge in your therapy. I am a compassionate, sensitive, sensible human being, who learns from her mistakes and loves harder.", "hovaleankita": "I dont know why but I hate you so much", "theefirstofhername": "KOMAL, MY LOVE. YOU'RE A STUNNER. I LOVE YOU MORE AND MORE EVERYDAY ( if that's even possible) 💕", "dishi.agarwal": "1) i would really realllyyyy love to be a part of this because I'm myself trying to become a blogger but I'm out of contents. My mind has blocked and maybe this could be a platform from where i get a kick start. 2) I'm good in singing and people generally enjoy my talks.", "thebohemiangirll": "@komalpandeyofficial the last look.. the shimmery blazer is that from Zara?", "mehakpvt.x": "Ok so first of all komal di i love you so much.. Idk if I will be A part of this or not nevertheless please plan A meet and greet in gurgaon Or delhi pls❤u inspire me so much not only wid your amazing dressing and fashion sense but also the confidence which u carry... I mean oml I'm just in so much love wid u and ur style. Ok so i want to enter the giveaway.. So here I go.. 1.I want to be A part of this bcoz I hv seen u styling curvy girls so well and i want be styled too and yeah I want to learn to carry such a confidence from u🙌❤️🔥2. Meet me you will fall in love wid me.. Duhhh🙈😂ok just kidding.. I'm really good wid baking skills and I m cute I think yeah I'm ok😂🙈whatever and yeah that's all baaki if u will meet me u will knw.. Love you diduuu😘😘bye💜", "malavika_suramya": "I like the part in this video where you kept that specs and walked away with its nothing at all kind of look on your face♥️", "the_candy_cane_": "Waao😍😍😍❤️❤️👌👌👌😘😘😘😘😘", "kapoorkanishaka": "That's just because I don't know my style, yet. 🙈 Being styled by you would give me a flavour of what my style could be. 😙 Also, everything about me can make anyone fall in love with me. Mai apni favourite hu. 🙋", "saijal_nagi": "Oh-kay ! Ssoo I love you so much and More than that I love clothes . My Moto in life now is to do something in fashion . In the industry . Therefore , I'd be officially studying fashion for 2 years overseas . You and .your vedios especially fashion therapy played a huge role . When I was deciding what to do in life . Being a part of this would mean a LOT TO ME ! cuz this is how I discovered my passion . I was always into clothes and was very pickky about my outfits and what other were wearing . I thought that's just a part of me but through this I realized that no I actually love this and this is what I wanna do for living ! Thank you for that ❤️ . 2 things that'd make anyone fall in love with me would be umm my eyes ( I've been told so ) and I'm funny , sweet like there's a lot of it .. मैं अपनी favorite हूँ 😜 I mean I express what I feel that'd be enough for someone . Hope I become a stylist or something great in fashion like you and live the Rachel Green life myself . ❤️xoxo", "shruti.16_": "u r insane komal di ...i admire you and really wanted to meet such a nice person. i am little fatty so i wanted u design me by your styling. 1. i dont care what else thinks about me , my body and my clothes i love the way i am. 2. i really font of dogs because they are the only one who loves u unconditionally and i love them too.", "vinod_shinde_offical": "😘😘😘", "alifestylegirl": "You introduced us to a new realm where \"fashion motivates\". I learnt from you that how well it is to feel better from inside apart from dressing well. Good job @komalpandeyofficial . I write because it makes me feel liberated. And ya I sing too and people say that I sing well😉 n I too think so 😇", "deepika_gupta_": "Komalll You❤️ kill everytime with your fashiontherapy videos..this one is another litt one..🔥🔥 I would love to be part of your fashiontherapy as wanna meet you❤️and your ideas are soo extra ordinary, who would not like to get styled by you. You are the fashion icon who influence every second girl😍 And the things I love about myself is being curvy and being comfortable in my own skin😀 Another is being a good listener and giving true and positive advice to people around.💛❤", "yashika_anand00": "I would love to me you cause i love you and your fashion sense😭❤.2. My voice and my nature. Last i would like to say that i love you komal di and wish u all the luck for your future ❤❤", "tanishasubba_": "Bcz I really want to see my other version..... Nd I like all the style you recommend us... Maybe how to style a kurta Or maxi... It's amazing.... Secondly... I'm very cute and naughty... Nd I can seek anybodys attention so early", "paridhee_agrawal": "1. OMG 💥🔥 It feels like you are The Sonam Kapoor of Blogging Industry !! No kidding. One more main reason why I want to het selected is that I love love your style and to look each piece of clothing so differently For example A skirt doesn’t meant only to be worn on waist 🤩 I feel as if I living and carrying all those outfits and every time I feel I will go and carry all my clothes and show it to you 🙈 to style them all 😍 🤑 2. The confidence, Dance ! Especially the confidence and the feeling of empowerment while carring KomalStyles Clothes 😻", "srishtidua971": "I love the way u are. U are bold and beautiful person ♥️ best part about I am funny person and love to make other smile , I love dancing , reading and enjoying", "_ditithacker_": "1. I would like B part of this because I m really inspired by your all fashion therapy episode and in some point of time this helps me alot and really love that Alot 2. I m an artist and even i m student of fashion designing and student of Commerce stream 😍😇😁", "anandmaitrayee": "Last look💜", "abhilashasuman": "I'd love for us to meet so I can work my charm and we become best friends and live happily ever after lol.. And the two things about me would be I'm pretty interesting to hang out with and sweet af.. 😬 @komalpandeyofficial", "thekomalmahar": "I find you very genuine @komalpandeyofficial . I'm an entrepreneur, I love designing and stitching.", "_.theguptaparadox._": "@sanjeetpattnaik_ this song. Download itttttt", "_beulah16": "Which song?????", "iampurnam": "I want to be a part of fashiontherapy as I think I relate to your style with some modifications, you can check my gram for the change in hairstyles to clothes to makeup, all inspired by you. Now coming to the second part of the question, I am AIR 22 Indian National Mathematics Olympiad and hopelessly romantic ❤️❤️❤️❤️ I love you @komalpandeyofficial", "i_divya25": "@komalpandeyofficial ... Okay so why I wanted to be A part of this.. The reason is that i am a budding blogger.. I also luv to make fashion stylist videos like urs and I would be so grateful if I get a chance to meet you and could learn more bout of fashion from you.. You are my style inspo.. Not just for giveaway bt you are my inspiration and I just want to meet you once and want to work with you❤️", "bedi_forever16": "I want to be part of it because o never styled myself or never experimented with style. I am self lover who believes in my inner self and that anything can be achieved with love and determination", "dim_chaudhary": "You killed it 🔥🔥🙌🙌🙌❤️", "_the_cherub_": "Komal i love u❤️❤️🔥🔥🔥you are such a admiring person.", "aishu_padwal": "My fav look was All looks. All looks are amazing 😁 .. waiting for next Episode ❤️❤️..", "nishta.official": "Damnnnn 🔥🔥🔥🔥", "dinal_parikh": "1.I want to be part of this because I just love to see u n ur new new thoughts. 2. I'm a artist I love to do painting and I'm a fashion designer so I like to do something so creative in fashion. Lastly and mainly love u soooo munch ma'am keep going n keep inspiring us. Thank you 😇😘", "akansha_sharma_02": "1.I wish to be a part of this because the way you promote body positivity and self love are something i really wish to learn ....i have always been conscious about my body type and restricted my dressing style because of this....I ve been trying to be more positive about my own self and try new things lately and thus meeting ,learning and being dressed by a fashion therapist would be a great and fun experience for me. 2.cheerful hugoholic accompanied with a smiling face xD", "sunehakangotra": "every time when i watch your fashion therapy ❤️❤️❤️ @komalpandeyofficial you took my breathe away ❤️❤️ you always create magic", "thefabulousfuss": "Do not have a reason why I am participating but yes I can tell you why anybody would fall in love with me - 1. I give it whatever it takes to make it happen in any relationship be it with siblings , parents , bf etc . 2. Love is the key my darling , be loyal and add good moments to everyone’s life ⚡️", "vrushalimahajan14": "Just love ur outfits whether they are Western or traditional or swimsuit ❤️❤️ I love to read 🤓🤓", "vatsagirl_on_twirl": "Little bundle full of talent you are! More power and love❤️", "swati.priya.90310": "😍😍😍😍😍😍😍", "ayushi.sharma": "Since I strongly feel that fashion is the most subtle communication. I want to put forth a statement that emotion driven and empaths are majorly missing and being one of them helps me make the world a better place.", "harshita_matta_": "1.I love the last look it is LIT🔥🔥🔥....that shinny coat and twining with long earrings....n whole look was together really amazing... 2.I write poems n stories,n I feel good by solving others problems. Love u komal so muchhhhhhhhhhh❤️your #fashiontherapy motivates me everyday to do better from yesterday 😊lots of love❤️❤️", "_findingrainbow": "Exceptional and unmatchable🔥🔥🔥", "madhu_dhepe": "1.i admire you, I want to learn how to do it 2.i love fashion and dogs", "bajpaiastha": "hey @komalpandeyofficial, everytime u r just lit❤️ y don't u try some hairstyles, may be !!🙈 (just a suggestion) ❤️.......lots of love darling❤️", "_.alishaaaa__": "Hey you gorgeous. Just wanted to be a part of this fashion therapy because am not that stylish and would like to upgrade my style with your tips. What can get people attracted to me is my dance and my talks( well I guess). Anyways lots of love ❤️", "makeupbykomalpanwar": "O m g 🔥", "_alluring_menace_": "You are amaaaaazingggg😭💓💓", "riyakkapoor": "HOW CAN YOU DOO THISSSSSS? 😍❤️", "swataayyyy": "4th and last look 🔥", "neha_aryan21": "I have been waiting for this fashion therapy of you......and it was mind-blowing wannna get some part u inside mehhh i mean FASHION❤️😅@komalpandeyofficial", "abdullunited786": "hy", "_ishadeodhar": "I would love to be a part of this styling as M absolutely head over heels in love with komal and getting styled by her will be like a dream come true. 1. I absolutely love singing it's my passion dream everything. 2. I genuinely love partying and M a very very humorous kind of person.", "ishika_5100": "5th one😍❤️🔥", "rajput_singh_shruti": "I would love to be a part of this, i have always been fascinated by ur outfits and fashion sense i always admire ur looks. I m a 2nd yr graduation student, i have too many hobbies some of them are writing, reading novels, m good at speaking and m a anchor as well m currently learning guitar i scketch as well in short m a all-rounder and i always look up to learn new things", "imagemundial": "I love dressing up myself and others as a stylist and image consultant , 2 things I feel people love with me are - my appropriate fashion sense (means as per my role , age and goal) and my loveable empathy for people around me ... would love to get styled by you as you rock girl and love how you create different outfits out of the same piece", "tuzo.pandey": "Uff ufff uff uffff . Ghatak ❤️❤️❤️😍😍😍😍😍😍😍😍🔥🔥🔥🔥🔥🔥🔥", "shubhi.tr": "( 1 ). First one is I really adore you. I even sketched you 2 times and yes i really want to be with you atleast for some time, that will be precious ofcourse 💜. ( 2 ) second one that is about myself - I am an artist who loves to draw my imaginations and various things and a social worker who loves to treat and help people. 😊", "iamvaishurao": "Could you please not put such thumbnails? Happened many times...while at work..when I open my insta it's your post with such thumbnails...! No offense...! But it's just not appropriate at few places. I hope u agree too !", "iditrimahajan": "1. I would love to be a part of something so cool and so inspirational. This would help me to embrace myself and learn so many things from such an amazing fashion blogger. 2. I'm a really fun person and I really love to dance and explore", "karishmasharma._": "Hello, i would love to be a part of this because I love fashion and I want to choose fashion as a career someday soon! I'm looking for advice so that I can grow 😊 and who else can be better than you to guide me through:) you simply inspire me in so many ways. I really hope I can meet you someday:) coming to the two things that can make someone fall in love with me, i think if someone has to fall in love with you, it doesn't have to be just 2 or 3 qualities, i think the person has to fall in love with you as a person and not just for a few\"good qualities\" that you have 🤗", "_probably_insane_": "This is insane !a much much better and brighter version of you 💕", "sanxyaaa": "Hi I'd love to be a part of the Giveaway as I'm really inspired by your bold sense of clothing. Secondly I can connect with new people instantly, have tons of absurd stories so one can never be bored and am a wierdly outspoken person. When I am not sleeping, I'm always reading or binge-watching.", "the_unicorndiary": "I am a big time fashion lover. I really really waant to get styled by you because it would be an amazing time meeting you, talking and doing what you and I love; Fashion!! Also, I feel I am good at conversations and moreover I love listening to people's stories which make them fall in love with me. Secondly, I love myself as in Mai Apni Favourite Hun types that could again make others rise in love with me! 😍❤️", "the_wonderwoman28": "I want to be a part of this giveaway bcus one 1 , am a biggggg fan of you and 2 , bcus I think a makeover (especially from you) will be a much needed change for me . I think what people would love about me is that em extremely outgoing and friendly 🤭❤️ and the second thing that i am an old school from heart ♥️", "dutta.monti": "First of all I am very excited. Thank you @komalpandeyofficial for bringing such a good news😘😘. Now.. As I am just starting, getting styled by you I believe would be the best part this journey. So fingers crossed. And yes I think my SIMPLICITY and CONFIDENCE will bring everyone to my page.", "pandaa__xoxo": "@komalpandeyofficial Who won’t love to get styled by you,Definitely because you have got that international sense of styling and me being a plus size would love to see what suits on me the most.❤️much love", "_t0709": "😍😍😍😍😍😍😍", "journey_towards_fashion": "Hello Komal di, first of all congratulations🔥 for completing two fashion therapy season and I’m super excited for this 3rd season💜💜 And I would love to be part of it and get styled by you because you have always be my inspiration as you can see on my ig profile , I recreate many of your fashion therapy video and I always try to get inspired by you. I am a struggling youtuber ,blogger & Chemical Engineer. I would love to be part of this, & getting this opportunity can be a life changing experience for me. Most of the people love my height and my walk 💗 Two things that can make anybody fall in love with me is that , 1. The way I speak , I can easily make people smile !!😊 2. My Fashion Designs (paintings) and all type of paintings. #fashiontherapy 💜💜", "ishikanaikk": "1) I loveee your style and fashion sense , I've been following you when you used to work for popxo. 2) I LOVE DANCING and I love dogs (every animal in general)", "coffeezara": "where are we going to wear this in india 😂😂😂😂", "thatflawedwardrobe": "😍😍😍😍", "bhawana3995": "u slay every time .. your styling game is definitely top notch.", "urbashiahana": "4th look....❤️❤️❤️❤️", "__kanisha_": "Last 3 were bomb af🔥", "tyagi.ananya99": "I would love to be a part of because I really want a fashion therapy for my concert look Two things that anybody can fall in love with me for is : a) I am unique as the meaning of my name suggests b) I am a very confident Musican", "thapatriptime": "Chyaa i hate this every luk of u... though i admire u alot... why so same luk n all...", "moitrayee__": "1.Hii @komalpandeyofficial ❤ this is @moitrayee__ 19year old from Delhi. I have followed you since the time I have been accessing Instagram.Aways been in love with your fashion, how you experiment every style as well as the way you have been influencing girls to come up for everything they wanna do with courage. So if this is the chance to be a part of it I would love to make the best of it🌸🌸 2.Two things that I have always been loving and doing is -Dancing and experimenting new things. I just love love getting ready for a dance show💋💋", "simron_5229": "1. Because life's too short to not have fun with one's closet. 2. I can empathize even with my enemies. I know the secret to attract babies and cats( loads of genuine love).♥️", "madhumitha_i321": "I would like to be a part of this so that I can be more confident about myself after this #fashiontherapy session with @komalpandeyofficial , my artistic paintings and my dimples 😂💘", "aks_sri": "1. Depressed. Too bored with my wardrobe and myself.", "ekumeku": "On a serious note - 1. I love youurr confidence and i too need the same in me, you’re an inspiration. ❤️ I can see the self love in you. I’m a skinny girl but always takes motivation from your profile to carry myself confidently. 2. Anybody can fall for me because i am good human being, i dont judge people by their outfits and their thoughts. Secondly, beauty with brains 🤗 It would be a greattt reward for me to get styled by THE KOMAL PANDEY 😘 Loads and loads of love 😘", "tanvisharma313": "😢😂", "laxmi_malara": "Hey! Komal you always been a great in the field of fashion. I want to be part of it because I really want to meet you and talk to you personally and want to see the real work in field of fashion. I am very confident and have a spark that I can do anything in this world.", "jacqueline.gomez.357": "1. I would want to be a part of this, because I feel fashion doesn't come with any size chart and whether it's size 'small' or size 'xxl' everyone should have the liberty to try everything. 2. I feel my acceptance of my flaws( wearing an off shoulders top and being fine with my stretch marks),my confidence helps me to strike a chord with anyone. I feel these are two things which makes them fall in love with me.", "lazy_bones94": "Hi komal,💕 i would love to be part of this, this is going to boost confidence in me, i am literally not able to get into the culture of this city as i have recently shifted to delhi... i hope to get a positive response from your side. I am very humble , down to earth and hardworking. 💞", "sunali.joshi": "Dear Komal, you have been my role model since ur PopXo days...I have religiously watched every video that featured you by PopXo. Seeing you quit ur job to follow ur dream, you have inspired me in so many ways. Your style has always been so unique and fresh. Today, the name Komal Pandey resonates with Fashion like Google is to search. This new version of Komal Styles mixed with Fashion Therapy is a bomb idea. I was in Pune for the last 3.5 years and I would feel so bad to not be able to participate in Komal Styles or be present for any MeetnGreet with Komal. Now that I have moved to Delhi, I would feel on top of this world if I get this chance to meet you and Get styled by you. Nonetheless, this love for you stays even if I am not selected cuz this one I wrote straight from my heart. I wish you well Komal. May you shine brighter with every passing day..May the force always be with you! I feel two things about me that would make people fall in Love with me are 1) My Friendly/Extrovert Nature 2) I can cook and as they say.. the way to a Man's (Woman's) heart is thru his/her stomach.", "salonisingh0": "Oh my god. ❤️❤️❤️", "thetinyphilomath": "I really want to be part of this because I'm short & plump and I really don't know how to dress according to my body type, I have tried to mix match but I really don't think I can find the correct way of dressing myself, even in stores the clothes which are my size are too long for me & the ones which I love are not available in my size. I believe there are so many girls like me who face the same issue, and getting dressed or even getting few tips about the way short & plump girls can carry the outfit according to their body type would be great help for all of us. We even have a group of short & plump girls on instagram where we share the difficulties we face. The things I love about myself is 1) I simply love myself for always finding the ways out to overcome my insecurities simply I never give up I love my spirit 2) I'm really bubbly & talkative (my dance;) there are too many things tho", "stealmyystyle": "First things first this video is 🔥 coming to the giveaway part 1) I want to be a part of this because you have been my fashion inspiration since 2 to 2 and a half years and because of you I believed in myself and gathered up the courage to start fashion blogging so getting styled by you is like gaining knowledge in something I am keen to learn. 2) My smile and my honesty... I badly want to be a part of this :) Anyways, No matter what the results are, Lots of Love and power to you Komal and keep blooming like a wonderful rose that you are🌸...", "curvyshehar": "I would love to be a part of Fashion therapy because like you, fashion IS therapy for me and I always tend to like outfits out of the box. Umm, well I guess me being a very good listener and being active in dancing and modelling can be pretty impressive ! Oh and lots of love to you and power youu💟", "sai.lakshmi": "I like to be a part of this coz I love you Komal 💕 and as of two things I feel that I am a real person with zero fake attitude and I am a great singer 😎", "riiyayaaya": "I want to be a part of this video .. because I want to meet you . You are such an inspiration ✨✨♥️.and I love reading and I'm a dog lover and I can cook very well ✨", "vanshikachoudharee": "1. because I somewhere feel that fashionista inside myself...and wanna grow more within myself... coming out of comfort zone Will be super excited.... N it's not a work... it is something I'm very passionate about. 2.two things ....a.", "thestyleposer_": "❤️❤️❤️amazing", "the.epicgirl_": "This one is best far. I really don't have words. Actually u slay every time in every video. I really want to be a part of this because, I love styling and M fatty so people say that I can't wear good things. But actually I want to show them that m also a human and M also look good in every clothes. And my hobbies are dancing, painting and all creative things. So I like all ur creativity. And I love ur confidence level . I love u man ❤️", "ashreeyyyy": "Can a guy be a part of this? If yes, then here you go! I am Ashrey, studying Fashion Design at Nift, Kangra! (I'll be in Gurgaon in the second week of december!) I'd LOVE to be a part of this because just like you I also love to experiment with styles, wearing things in many ways and basically play with pieces and creating looks! I also believe that fashion is gender fluid, all you need to know is how to style them! Another reason is that I LOVEEEE your style and you inspire me A LOT. Now to the second part, First is my smile that usually make people to friends with me, and second is my Bhangra skills! I really hope I get picked for this!", "shishta_vineyardpassage": "Well I wanna meet you and learn some awesome hacks as how to create such amazing outfits by using our very own old clothes rather than buying new ones. I have heard a lot as how fashion is also a part of global warming and how we can use sustainable fashion to reduce it. So ya. And secondly I also love plants just like you and love to make my house a green house. Plus if i ever get to meet you that will be my dream come true 😁", "atrangi_style": "I would need too many clothes😂😂😂😅😅", "nishhtha_gupta": "I want to be a part of this giveaways because-1) I believe that nothing can evolve a human more than fashion. I believe that fashion has very little to do with the cloth item and way more to do with how you and your inner soul feels when you put on a silk silhouette. 2) \"you truly can have anything in your life if you dress for it\" are words to live by for me. In the world of evolving and discovering oneself it's easy to get lost and the right style and confidence can make sure people see the women behind the cloth. 3) last but not the least, I've been following your work since your novice days and I've never ever stopped believing in your positive energy. Your story is something I relate to on a personal level, and I hope to meet you and what better what than this ! (I'm not trying to butter you or @misfitdiv up here, but if it's working nevertheless yay)🍉", "_.manpreet._": "Slayer as always❤️😍", "chubbyandchirrupy": "Hey Komal❤️ i have been following you since two years and everytime you put up a new video i fall in love with you all over again ❤️ i have always been really insecure about my body and people bully me for how i look. . everytime i used to see you ,dolly and kusha i used to feel I wish i had the courage and confidence that you all have ...i saw your interview with beer biceps and i started pushing myself and here I am doing what i love ❤️🤗 i finally have started fashion blogging ...thank you so much Komal for everything apart from your amazing videos you don't know how much you have helped so many of us to start doing what we love ...i so want to be a part of this giveaway 1) MY DREAM OF MEETING YOU WILL COME TRUE 😭 2) I WILL GET TO LEARN FROM YOU SO THAT I CAN GET BETTER ❤️🤗 3) I LOVE EVERYTHING ABOUT FASHION ❤️❤️❤️ .... I am also SINGER NOT AS GOOD AS YOU but i would really like to sing with you ❤️❤️ and i am biggggg foodie ❤️❤️❤️❤️ i don't know if I will be selected or not but even if you read this comment ...this will mean the whole world to me ❤️❤️ i love you so much Komal ❤️❤️❤️❤️❤️❤️", "zainabamjherawala": "n ur style is amazing i woul love to meet n gt styled by u... inspires me alot n i realllyy wanna meet uh 💕💕💕💕@komalpandeyofficial", "neooooomiiikaaaa": "Idk why I feel so connected with you! You have helped me in improving myself and moreover I feel more comfortable,powerful and confident in everything!♥️ It’s so beautiful to see the change in yourself and you have helped me in achieving that❤️ I feel that I am really very understanding and trustworthy.. 🧚🏾‍♀️", "bose.r_": "The last three looks are to die for😍😍🔥🔥 great going @komalpandeyofficial ❤️❤️", "kratika2509": "Breathtaking❤️❤️", "sonalsagaraya\nVerified": "Verified", "sumedha_subhash_": "U sizzle.....i look upto to ur confidence", "_blessy_naidu_22": "😍😍😍", "shweta2885": "I want to be part of this because theres always a need for change. And whats better than opting others taste as a change and still loving it!! That astonishing ting of self care with fashion is THE BEST FEELING. And coming upon two things that can make anybody enchanted are 1. My eyes 2. My nature.", "aishwaryanu": "Firstly I love you alot @komalpandeyofficial ua are such a lovely person❤️ I would be very glad meeting u...it LL be like my dream come true n secondly I love cooking n I wanna be a food blogger beside dat I love planting 😊 n finally I totally love the way you style the clothes #FashionTherapy #misfitdiva", "adplpriyanka": "Honestly komal has been such an inspiration it would be such a dream to meet her and being an upcoming owner of a fashion page I would love to work with her.I am just a happy positive soul who is laughing at the lamest jokes and is found dreaming big and unusual. 💕", "shivatmika_29": "You are unbelievably talented!", "thehungerqueen": "Hey! I would love to be a part of your giveaway! I am a foodblogger aspiring to step into to lifestyle and the fashion world but I am a little hesitant to do so, as I get confused in how to style clothes according to my body type! Your fashion therapy videos are so good and how you make every oufit beautiful is an art😍. A little help from you would really help me find my path. Also it would be lovely to meet you😍. I am a food loving a dentist with a very cute pet kitten😬😄❤️.", "styleyourthoughts": "Loved it❤️", "priyalmusaddi": "1. I’d like to be a part of this because ure my biggest inspiration not just in terms of fashion but in so many things in life.. You and I have so much in common and the biggest thing is that you helped me fight with my anxiety.. so getting in touch with you would make me feel at the top of the world!! 2. 1. I Love fashion and keep experimenting a lot. 2. If you eat the food made by me u‘LL surely fall in love with me.", "preetsingh_12": "Ayy this vid has my hrt❤️😍🔥", "dhrithi_prabhuram": "I admire your style very much 😍. The way you carry yourself with the style . Girl !! That attitude ✨. I would love to try your style but I don't have the confidence to, I think I won't fit into this kind of style especially because of all the fat in my body 🙄 .But recently I have started trying to carry a little bit ( very tiny) of your style. Thank you for all the inspiration . From Chennai ❤️", "bhoomisolanki_14": "🔥🔥😘", "mostly_savvy17": "❤️❤️", "sasti.sharabi": "I LOVEEEE reading and arguing 😄", "khushiii13": "Because I love your fashion videos and they inspire me too much, they let me think OTB♥️ Also, I love Netflix & i love counselling people🤩", "jinika_28": "Bomb💜😘😘💝💝💝💜💜💜💜💜💜💜like freaking talented person u r...OMG#LOTSOFLOVE", "_gyanviiii_": "Omfg this was soo stunning 💓. Loved all the looks 😍😍😍", "glorify_ur_self": "OMG girl.. U nailed each n every look 😍😍😍💕💕 @komalpandeyofficial I am big fan of yours", "____priyanka_____": "I would love to be a part of it as i think you are extremely stylish and getting a opportunity to work with you is something i would dream of. And moreover i love styling my clothes . Imma trained classical singer for the past 18 years .", "komalpandeyofficial\nVerified": "Verified", "itakepictures_____": "I want to be a part of this as I lack self confidence and easily get insecure. I wanna feel beautiful too. 2. I'm a good listener. So people can pour it out all on me.", "bhumikajain65": "Why I'd like to be a part of this: Because YOU would be styling ME!!! | 2 Things about myself: Avid reader & Sophisticated fashionista at heart!", "yashvijain24": "1) I’d love to be a part of this cos ; a) I like styling outfits cos then it becomes very personal and that’s bomb 💣 b) I need it cos 🔝 a) Two things about me : 1) I love myself enough and more for everybody to just see and learn how important it is to do so 2) It’s darn important to be kind .💕 3) I can go on and write 37 more such things about me but then no surprise there cos u know 🔝 1) . ☺️", "disneyloversonearth": "Pls change the thumbnail. U look constipated in that whereas you look stunning in the video❤️❤️❤️", "aditiiiiiiiiiii.__": "1.Because it's been my dream to meet my lady love and getting a makeover would just reach all goalzz of my life. 2. I am a die heart makeup lover just like you whether anyone admires it or not and a big bigg dog lover but can't own one . Ps- Is it compulsory to be from Delhi cuz I m just a school going girl", "pooja_travelbug": "I would love to be part of this coz i love fashion and your work! The 2 things that can make anyone like me is dat I'm a confident woman & i always try to have a smile on my face. (Even on my bad days) #giveaway", "manisha616": "Don’t want to be a part of this. These dresses will only look good if u have no curves. Damm these influencers 🤦‍♀️", "laveesha_20": "Because I desperately need a break from this monotony of life and be a part of something that really interests me! And who would be better than to be with someone I have been admiring from years now! ❤️😘 And the two things about me that makes people like me are my dancing skills(at the parties lol😜) and my wicked sense of humour! @komalpandeyofficial @misfitdiv", "1999invogue": "I would love to be styled by Komal Pandey herself, as i have been thoroughly following her and she is the person who has influenced me to be a fashion blogger too. I think people might like me because 1) I am a bundle of positive energy, people are happy around me. 2)i can play ukulele and sing along, who doesn't like music? 3) i will always be empathic towards every individual", "garimaasinha": "I would love to be a part of this because who doesn't want to get styled by you? I love fashion and you are the ultimate fashionista, so it's q win win situation for me. I think 2 things about me that can make anybody fall in love with me is that I am pretty confident and still very humble. And I love a good talk over coffee. I am a good listener. 💜", "tiredunicorn": "Hii komal 💜so I am going through this phase where I will transition to my 20's next month and I still feel very much feel 12. I don't wanna be just 'cute' anymore so maybe you can help me feel stronger and fiercer? 2) I am really good at striking conversations with bad humour and making the person feel warm. I also hype people up a lot and make them feel confident. 3)*double fingers crossed *", "__neha__sharma_": "1) Every time I go to office, I feel like I am not that attractive, I feel that I am under confident they way I dress, usually I am seen in t-shirt/blouses and jeans and thats it, I want style but I don't have confidence on my body time. I really need help. Hope I am able to explain you. Please help me. 2) People fall in love for who I am. Maybe they love me because I am very loyal and straight forward. And yes, I paint/craft really well.", "debopriyaa__": "I really want to be a part of this because i love styling myself and in this party season wanna rock with the way you style.you look damn hott🔥♥️ in every looks which you created are really unique. i love to be styled by komal pandey 😍😍😍😍 #fashiontherapy", "aprajita_basuki": "Nice style but How to pee in bodysuit😔😭 looks good but so uncomfortable or when a girl in her periods 🥺 @cady_xviii @kri_aasu @tanyaaagupta @i_aadya @enthusiastic__soul", "bhushita168": "1.I want to be a part of this bcz u r my inspiration n I love the way you style...u r gorgeous😍 2.i m a dog lover...bcz they are kindhearted,helpful and loyal.... ❤️", "priyachintha6": "For a change this episode looks different from the regular ones...because of the long skirt and pants may bee😁😁😁.....", "nejalshah": "1. I wanted to be a part of this because you are really unique and the most amazing fashionista I’ve ever seen you are my favourite them all’ the way you give new ideas to style like no one give! That’s it! I love your confidence and how you put it up every episodes of fashion and and the way you edit your episodes is so so so lovely the music u use isssss🔥🥰💯♥️ 2.and about Me recently I’ve become a reader I’ve read 2-4 books by thn I really love reading! I also love dancing that makes me so happy and positive ❤️ My friends love the way I style some cloths n all (not Kidding lit) 🙈 @komalpandeyofficial", "ke6rthana_": "I totally adore your style and I cannot imagine how great that would be if I get a chance to be styled by you! And of course, I would love to meet you too ! Well, Interesting thing about me is I write poems, focusing mostly on relatable human emotions! @haiku_lady is my poetry handle :) And I'm confident enough to pursue my dream or at least take baby step towards it. That's all I have to say :)", "zara.mir01": "I love watching your fashion therapy’s videos they are so inspiring & have learnt a lot from them as well . 1. I am someone with very chill attitude and love communicating with people . 2. Love dressing up & being creative . Would love to get styled by you .", "miracle_in_disguise": "I would love to be a part of this because I wanna try something new and you are amazing with that and one thing that can make anybody fall in love has to be my honesty and mmmm.....my dimples👅", "vidushisaran_": "The most spectacular and therapeutic fashionista seen on social media till date , we could easily see how much efforts you have put in for this video and for each look . It's tremendously awesome . Your work speaks and I guess that is what is known as success . All the very best ❤️ more power and strength to you 😊 . I would like to be a part of it as I'm eager to meet such a strong personality personally and do have a sense of fashion so would like to work with you secondly I'm good at dance and music so we could work out together for the background music together . Looking forward to meet ya !", "______supergiggles______": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️I've been watching you since few years on you tube and now that I have an insta acc I've started following you and I'm so glad I started I'm in love with you😍😍😍", "vaishali_donuts": "Such an amazing influencer u are, #fashiontherapy is of my fav series of yours❤️", "roly.polyy": "Driving us crazy 😍😍😍😍😍😍😍 @komalpandeyofficial Loads of hugs, kisses, love.. 😍😘😘😘😘😘😘😘😘😘", "foodie_to_fit09": "Would love to see u go out in the first 3 outfits on delhi roads and metros. BE PRACTICAL FOR ONCE!", "vaishnavipvasista": "@komalpandeyofficial every single time you create something out of clothes, but I'm like can't even match a top with bottom 🤣", "binali1312": "I think u can rock all the clothes and the things I like myself is my cooking skills and how I manage my home", "bossglamroop": "@komalpandeyofficial 2) i m a makeup and fashion lover , very lately i knew this but i m happy i found my interest and while doing makeup if music is playing then the happiness is on another level.", "rash.bish": "This therapy is MUCH needed", "khushh_21": "1. You’re my true inspiration and I’d be so so glad to be a part of this opportunity 😭❤️ You’ve been through so much and wow you’re fought all of em’ and you’re such a big hero for me😘 Fingers crossed 🤞 hoping for the best❤️❤️❤️❤️❤️❤️ 2. I love to dance , I love dogs as well I have 4🙈.", "whosashawhat": "1. Coz I think my fashion seriously needs some therapy from the doctor herself 😍 2. I would love to be part of climate change community who is working to make earth livable again. 😺 I'm already excited about this comment 😍😻", "prachidhawan16": "#FashionTherapy, as you rightly use the hashtag, has been the most valuable experience in my life so far. Growing up conscious of my skin tone, various parts of my body, my height and more, it took me a great deal of time to accept who and what I am and be comfortable in my skin. And this transformation, contrary to the popular belief, happened because of fashion and how styling myself to the best of capabilities made me feel more confident and sure of myself. To some that might be a superficial solution, but I have relied heavily on it for the longest time and in gravest of situations and when you started with this series, it made me relate to it and get hooked to this kind of content. so being a part of something I so deeply relate to would be the best way to end my year. 2) my spontaneity has been a constant attention seeker😂 and most of important friendships grew because of this. Also, I am a good dancer and that has always worked in my favor 😋", "tanuja_rajawat": "I can already see this season becoming bigger n better than the other two 😍🔥 but hey, 1) I would like to be a part of it because, very recently I've started discovering my own style and it would be amazing if I have an amazing woman like you styles me! (a new insight to my existing style) 2. I love belly dancing, if someone sees me 🙈 would surely love that also, the way I see and volunteer for street animals is something that I am really proud of💕", "onlyhewwman": "Ufffff🔥🔥🔥 🔥🔥 You nailed it hard this time! ❤️", "mishribhavsar": "I would love to be part of this because I want to try your magnificent styles. I've always loved your styles and I also love you as a person. I am not judgmental and I absolutely love all animals specially dogs because I have one. Sending big warm hug. ❤️", "gargi_sengupta____": "Can you put the link of the dresses of your look no. 4,5 & 6? Please @komalpandeyofficial BTW I am a black lover and it is so helpful for me 🖤❤", "priya_ked": "This is dope... But how do u peee in that ??", "mommy_and_twins": "Fabbbbbb video bt pls yaar outfits ke deet share kiya karo .. it would be such a help", "__sidhant___singh": "You Look So Pretty❤️😍✌️", "spamdesamz": "I really want to be a part of this because I really want to know how I'd look all glammed up, and if its by none other than the best best best Komal! Apart from that, I want to be a part of this because I want to feel good about myself. Also, Hi I am Sampriti, a literal Panda who loves to play my ukulele and binge on everything thats on Netflix! @komalpandeyofficial", "i.komal.chandra": "1. cz it's gonna be so much fun . 2. a) My optimistic attitude and the energy , I guess :)", "chaiandchocolates": "1 because being curvy in the wrong places and finding something nice to wear for occasion or daily basis is A real life struggle 😭 . 2 of course a dog lover but also a good listener and would do anything in the world to solve your problems just like they're mine 😅", "rupakvashisht": "This is freaking amazing. Oh godddddddddddd 😍😍😍😍😍😍😍 divine it is💝💝💝💝", "_lifexoxosoul_": "Wowwwiee😍💓", "parakhkukreja": "1) I feel like I haven't had the opportunity to truly explore my style. We all have uniforms in school, and get the opportunity to explore our fashion style in college. However, I went to a hotel management college where I had to wear a different uniform each day. Then at my internships as well, I was to wear uniforms. At my first job, I had a uniform. But now that I have a job where I'm free to wear as I see fit, I have no clue to what my style is. Hence, I would love a bit of help and insight.", "mikansha": "I would want to get styled by you because you have a great sense of styling and as a fashion designer i would love to know my personal style better from the best @komalpandeyofficial. And one thing that makes me everybody's favourite is the style I possess not just in clothes but my personality. I feel like I have a very strong personality. Would love to get styled by you", "divyalsawant_": "Love the layering❤️", "dikshita.09": "1.Because i want to meet those people who is a great inspiration for me land from whom i get inspired n courage to make my dreams into reality.. 2. I am a very passionate person and a dreamer too.. I am a dog lover and loves to dress differently evrytime like you @komalpandeyofficial ..i am a friendly person..thats it.. ❤️😘🔥😻💕", "__.kajall.__": "I am way too skinny every one just look at me and they use to comment me u don't get food or what?? Wht are u wearing it doesn't suit u n all. N I really want a make over. I just love to read books because I am chashmish😉", "snigdhapv": "•As the season name says it all, Being able to get a fashion therapy done by the iconic fashionista herself is obviously a dream come true. Especially for a newbie blogger like me,who drives inspiration and tips from every episode of “Fashion therapy.” • My personality is basically two things ~Self acceptance and self love ~In the constant process of unleashing and experimenting the feminine shades of my life. ❤️", "sonal_jain98": "Hi Komal, I am from Noida. The most important reason is I have been obese all through my childhood, teenage and even now. Though that has never affected my confidence. I am really outgoing self sufficient and a role model for people in college. I have worked as a head Photographer leading the team in from for 5000 people who came for the fest. (Just finished my graduation) but one thing that used to and is letting me doing are clothes. So getting tips or styled by a person like you who knows how to raise bars, would really be a boost in my confidence. I just want to take out the only inhibition in my life while I constantly am working on my body to get fit.", "ami_tittly": "Totally unrelatable.", "nupur.manchanda.gambhir": "Most people think that in order to look good, you need to be born looking good. Which is utter nonsense. Basically looking good is equal to feeling better. When you feel better you have a better quality of life because you have a stronger self image. Simple. * I recently realised that I have good dressing sense and would love to upgrade my styling with little bit of guidance and @komalpandeyofficial you are an absolute beast when it comes to fashion. Small tips like how a good pair of boots can make a big difference. And I also believe in sustainable fashion that's why prefer using an outfit multiple times in different ways like you. * I love following some great influencers and checking their vlogs and learning something new every single day. I love guiding people to stay fit and healthy. Spending time and taking care of my two kids is undoubtedly my most favourite.", "sucharita_dhar": "I want to be a part of this because firstly I want to meet you , you are so inspiring. And secondly, I really want to look chic and stylish but have zero idea of where to begin or how to style for my body type. 2 things that can make people fall in love with me : 1. I love food and I love dogs. 2. I am a patient listener. People feel really comfortable to share all their problems and insecurities with me without any fear of being judged.", "rihanasinghal": "I wanna participate....I have sentt you the dm..kindly pls look it💕💯.....thank you", "invincible__lady": "1.coz I wish to try experimental Faishon styled by the diva aka guru herself. 2. a) I take interest in others and give undivided attention. b) I acknowledge and appreciate .", "divyaniparashar": "Amazing and superb collection 🔥🔥🔥🔥", "harsha_ledwani": "I am thinking about starting my own YouTube channel and I have been doing a lot of research lately, I mean I have just started and I no clue about how I am gonna proceed but currently I am just trying to learn as much as I can from YouTube and Instagram and being a part of this will help me to learn a lot more and give me a good start. The two things I love about myself is that I am very bold and I don't care about what people have to say about me I do what I want to do and the second thing is I love trying different things, my friends think I am \"Jhalli\" but I think it's all about experiencing and having fun🤪", "radhikaaroraofficial": "You are such a slayer ❤️🔥 love that silver coat😍", "_anupama_145": "Would like be a part of it because who wouldn't want to be a part of it when you are doing a giveaway ♥️ talking about myself i am a good dancer and a caring person 🐧", "beeendal": "Soap carving , singing ❤😂", "chicandsharp": "I’d like to be a part of this because I have a healthy and chubby body! We can break the stereotypes together ! I love fashion and I’m always experimenting! I also love singing!!", "shweta8652": "1- i m tired of answering to ppl if my marriage was a love or arrange bcoz i am the most Ugliest girl married to a smart guy..every stranger every shopkeeper has only this question to ask me whenever i m out with husband...i wanna show them that i can also match his personality i m worthy enough to marry someone like him...also i have this keeda in me of loving myself but somewhere i m not confident enough 2- I loveeeeee dogs initially i bought 8 pairs of different breeds for doing business but they loved me so much and i also fell in love with them so much that now i kept them all with me and mai ab unhe kisi ko nhi de skti for any cost.", "paro__18": "since m also a fashion stylist and i love your styling..it would be a great opportunity for me to learn such good tips from you.. things about me: 1. i am a gym person..i love working out in gym.. 2. i am a dog lover and i love my bundle of happiness..", "kruti_bhatt10": "I guess no one wants to miss this opportunity to get styled by The Komal Pandey, its like once in lifetime and would be glad to be part of it. Also things about me are being bold enough and always a good listener can make anyone fall in love with me. Thankyou", "kaavyaa_23": "Song ???", "arpita.tamrakar": "Omggg🔥❤️", "shivi_luv": "Because this udaipur girl so wanted to make this kind of videos and yes if I will be a part of it than definitely will learn from you and make good content in future 😍 and Why me : one is my smile anyone can fall in love with this and second is I love to repeat clothes as you do but yes always in a different way... so that will look like a new dress 😎🙈 #icanwearanythingconfidently fingers crossed 🙈 so wanted to be part of it....", "thebelladonnaworld": "Omg omg can't stop watching!!!🔥🔥🔥 You are my lady love❤❤", "ca_ch_et": "@komalpandeyofficial 1. i want to be a part of this because i love you and I trust you completely, it will be a dream come true. You are a diva and i always wanted to meet you. 2. Every body falls in love with me coz everyone says i am so sweet and i give lots of positive vibes to them and i am photogenic and i should try modelling but i am not so sure about it... But if you style me i think anyone can look stunning. That's it.", "sanjana_vl": "1. I’d love to be part of this because I love fashion and Styling since a very young age. Additionally It would be an honour to meet my fashion inspo @komalpandeyofficial 2. I’m a new teen fashion blogger (15yrs) and a ballet dancer 3. However a problem is that I live in SG, so is there anything i can be a part of!!! I wish .", "sabita_9818": "@komalpandeyofficial congratulations for your season 3 my darling,Heya sorry to be that late but i really love you and your work the passion you have is insanely appreciatable and yes i watched all your fashion therapy episodes and you won't believe i always wanted to be a part of this and now if i am getting a chance to meet you first of all i am really get mad if i met my dream and wonder women and we gonna rock it and always wanna be that confident nd boss lady lyk you and i don't judge anybody nd i am super friendly that i can make but have super passion for my career nd loves travelling nd old songs are life.....", "eshaljain": "I would like to be a part of this coz I have a pear shaped body and I have come a long way in body positivity. I want to show the same to the world that it's not your shape but the positivity which can bring the best of any outfit.", "hijy.bisy123": "❤️❤️❤️❤️❤️", "yadav.jyoti1099": "Look at you, you are a sight. My godd!!! 😍😍💝", "sonali.sk": "Hey love ❤️", "_that_madrasi_girl_": "Hey Komal.💕 1) Among all the budding/famous influencers out there, you're one influencer whom I really look upto. You don't make us viewers want all the materialistic things to be happy in life, but you make us feel like we're the best version of ourselves and that we do not need to impress anyone else, but ourselves. Thank you for that :') 2) In my opinion, I think I have my own perspective of looking at things around me, and that way I feel unique and also happy. I love dancing, cooking and illustrating as these are a few things I do to relax my mind.❤️", "surbhiiii228": "Hi komal! I would love to be a part of your fashion therapy videos because I love your fashion sense and because you inspire me and I can look upto you. I have been following you since the time you were in popxo and I saw your journey and I saw you change and grow into this strong , independent , girl boss women that you are today. I would love love to be styled by you. 2 things that can make anybody fall in love with me : 1. For one my nature , I have a very happy-to- go- lucky kind of a personality , very carefree , fun . 2. I love to read , I can play guitar and sing , and I love to travel .", "_shubhikaa_": "Wow.Loved 4th and 5th outfit💯", "_kavyachawla_": "I'd wanna be a part of this because I've always looked up to you and that has really given me confidence to be creative with fashion and wear what I think I look best in. Also ilysm lmao.", "dri_shitti": "You are very creative. 🔥 Awesome work 💞", "viadristi": "Ohhhh yeaasss!! 😍💕", "kritikaahuja849": "1. I want to be part of this because who don't want to get style from you ❤️...It's an opportunity or I can say it's an dream come true for me...To get style from you...💕💕 and secondly I love dancing.....That's my favourite thing to do. And than I love fashion and makeup....😊😊 Iam really really very excited to meet you @komalpandeyofficial ❤😭", "rutujashindee": "Komal's Levelling up the game ! You go girl ! 😭❤", "thevoguecuddles": "Gosh ,babe you are amazing😍", "14.niharika": "My my 😍😍", "_vanyajain": "I really want to be the part of it cuz m really good at styling and i love my flaws and even i dance nyccccc", "simmi210428": "I would like to be a part of it because sounds exciting. I love to read, if its in a company then its great. And dancing", "nandini6_": "Girlboss🔥", "missurvisoni": "Babe🤗", "shivi2101": "Hey komal i wud love to be a part of this because 1. U are a diva i have been following u since ur pop xo days Ur hardwork your passion for fashion is commendable and apart from this how u have been growing professionally as well as emotionally is praise worthy So thats it person with so much worth wud be so lovely to meet in person 2. People say that i look cheerful as i always have a smile on my face so that attracts a lot of people Plus i believe that i am caring too a little emotional person and a good person by heart who loves to give beautiful smiles (i am a dentist) I hope u consider it @komalpandeyofficial", "samikshaa____": "💕", "sanjivanix.x__": "4th and 5th styles are The Champions! Btw loved all!💓👠🕊️", "sakshi_garg2794": "I’ve been following you from the start and would love to be a part of one of your videos, it’s like a dream to share screen space with you and learn from you. . . . Well I’m a pretty balanced person and an all rounder, I can cook, dance, make videos and sometimes sing😜, so my versatility often impresses people ❤️", "pri6380": "Why ? Because I would love to experimented by you ..n ur style. .with pinch of my simplicity..n my comfort!", "rasni_27": "My boobies are so big.. I can't wear those deep neck dress at all 🙄..but you look stunning komal 😘🔥", "shalinikhan94": "Its my dreams to get makeover from you but i really want makeover because there is stretch marks on my whole body so i not feel comfortable in all clothes and second things i love singing and i am also a henna artist 🖤", "purvi_s_": "Why wouldn't anyone want to be a part of this ! 😍 You're amazing and I've always adored your style! What can be better than getting styled by you ❤️ and I can't define just two things that can make someone love me 😂 love @komalpandeyofficial ♥️♥️♥️", "rsrs481": "Pretty and confident as always..😍😍❤️", "theelegantglitter": "1-Because you inspire many women out there and i want to meet you . 2- (a) i love dressing up everyday . (B) I love to experiment with my style .", "barsha.shah.127": "1. I think your fashion sense is really like a God😘😘😍😍..but frankly speaking it doesn't work on my body type..so I would like to see how your styling will make me look nd also feel confident.. 2. I'm interactive and also i have got lots of compliment for being intersting..so i think anyone can fall in love with me by my words.", "surma.surmises": "Hi @komalpandeyofficial I have never signed up for one of these before but couldn't resist this opportunity - I have been on a major fitness mission the last one year and have lost over 15 kgs with regular workouts and disciplined eating, and as I am getting comfortable in my new body all my old clothes are out of shape and I am learning how to style my new self without buying a whole new wardrobe. Also losing weight doesn't necessarily guarantee higher confidence so am still getting my brain to embrace what my new body can wear now. Your experience and styling tips would be invaluable and the perfect reward to all my hard work the last one year ! About me - I am an author of a fiction novel that I published in 2017, I have a stray indie Dogoo that my husband and I rescued two years back and I can make anyone laugh with my one liners even in the most depressing situation. So if your team picks me I can assure all of you some good quality entertainment! 🎀 Thank you !", "ridhimamittal0109": "I’d love to be glammed up by you because 1. I relate to you max for having a “petite body” and still be stylish. 2. Really good at giving hugs (Firm believer of Hug it out, sister!) 3. Fellow lover of “Wasabi-Little Mix” (ever since I heard it in one of the Fashion therapy sessions)  PS: Also, it’s my mom dad’s 25th anniversary coming up, would love to get styled by you.", "_i.minion_": "Goddess 😍", "duskie_miz": "I wanna b a part of this coz i love ur style n u alott .From ur youtubes till now im a big fan of u..the thing I love me is m a doggy lover,i sing well, I cook well nnnnn I am an a GOOD WOMAN above all😍❤️❤️❤️❤️ love u loads.good wishes.", "kriti_katyal": "Such an amazing video❤️❤️thanks for the different ideas❤️", "sabashrafi": "4th one was like you've become lady version of krishh😂😂", "nivedithapraveennayak95": "I just want that confidence which you have😍 . I love dogs and makeup😍 😍😍😍🌸😍🌸😍🌸", "shweta_mohapatra44": "I love you😍❤️", "_singhswatika_": "1: I really like the way you styling your dress it's really inspiring not only me every one. 2: I am very honest person and also talkative 😂 that's why my friend's Loves me & I am dog lover too. I have a dog also. My dog name is Harry. Thank you😊", "snehapnd94": "Well I just love your style it's so gorgeous and the way u dress up always so differently. Also your fashion therapy is so out of the world and u just nail it so hence want to be a part of this", "akankshaasinha": "When I heard this song on your story , I knew it's gonna be in any one of your videos🔥👌", "_dark_sugar_": "Goddess of fashion !😍😍😍😍🔥", "kiyann_3": "Hawwwttttt🔥🔥🔥", "mrignacious": "I would love to be a part of this because i think you can give a girl more confidence while styling her. I love so many things about myself but two most important things are i can proudly say that i love my body and what i am today. Second is i am a true person have pure intentions ❤️", "mathursms054": "Song?", "the_petal_poser": "Hi, i am a lifestyle blogger.. no just a starter. I would really love to be a part of your fashion therapy as i have studied fashion styling in my course but later I switched to other course and am a dietitian today. Though i am in the best dietetics college in India. I still miss my days studying fashion. It would be my pleasure to be a part of your styling fashion therapy and an honour to my past. Yes i do many things that anyone can fall for me.. one of it is the way i carry myself and other is i try doing best in what ever i am doing😊", "millee099": "Wowww wowwww wowww😍", "mehak_chehak": "I would love to be a part of this because it feels great experimenting with clothes and try something which is beyond our imagination. Fashion styling gives me confidence that I look different from every single single out there. Getting styled by you would be one amazing experience of my life. Two things that would make someone fall in love with me is my short height which I am very confident about. No matter what happens, I never feel that my short height will ever prove to be a hurdle in my life. Second thing that will make anybody fall in love with me is my optimistic approach. I always feel that I am very positive in my life and which really makes every body admire me.", "piueasty": "And i would love to be your muse...", "itsnotkankariya": "1. Cause it’s you omg it is komal Pandey who will be styling me so why not?! Not that I don’t love the way I am, I do, I really do! But still it’s komal f*cking Pandey dude 2. Dancing is something that I am real good at and the other thing is that I make people feel that they belong to that particular place that they are at irrespective of whatever place that is because I am a very good talker and also a listener. :)", "sharmi1994": "1) you are an inspiration to millions out there...you carry n style so effortlessly that i would not leave this opportunity to style me...a very big dream come true if that happens😍..being a part of this would help me gain a bit of your style and aura...the confidence you have reflects in every video n picture posted on the social media...the notion that curvy n dusky people dont fit fine...i want to break that n styling me wud help to break the social stereotype...sending you loads of love komal❤️❤️❤️ and 2) A singer at heart but possesed with the qualities of dancing and art too (PS- also good with maths..hehe) 😋..love to style and pose bringing out the best of any outfit i wear😉 ❤", "ii_.radhika._ii": "@komalpandeyofficial just why???🔥 we cant handle so much😭", "swarna_0208": "Hey @komalpandeyofficial, I want to be a part of this because there was a time in my life when I suffered from inferiority complex. I despised the way I appeared. But now, thanks to your videos and a certain people in my life, I have really started to love myself. I am someone who is simple at heart, doesn't demand much and is selfless at times. I try and be there for my close ones whenever they need me.", "dishika_rajpal": "Hey komal i ll lyk to be the part ur #fashiontherapy coz i m a very thin girl n everyone out there thinks that’s we thin girls cnt wear anything so it would b a pleasure for me to get styled by u n tll every thin girl out there that ya u cn also wear what u want ....", "rachana4644": "This was so lit🔥.,", "aaho___": "Every one😍❤️", "azzealhale30": "Fists of ol .... I FALL IN LOVE WID UH IN ONE SIGHT 😍 .... 1. Being part of it , I thnk I cn carry clothes according to my shape n size n learn more abt it 2. I luv reading writing “ basically I’m story writer “ I’m out spoken n straight forward to wt I wnt or not .... n being part of dis I hope I cn learn thngs dt gonna help me in future n coming wedding of my brother 😋... LOVE YOU 😍 😘"}