{"saniazulfiqar36": "If you are hindu then also and if you are a Muslim then it is a big sin", "muskaan__maan": "Words!! Proud of you!!❤️❤️💯", "khushboojaiswal_": "Bravo 👏🏻", "aayushi_lakra._": "More lovee to u bro9♥️♥️♥️", "yashika120311": "Women empowerment aise ni ate behen kch kr women k lie smjhe", "shyamal.basu.5492": "👏👏❤️❤️", "smita010791": "It looks like🐍", "iam_bhupendra_singh": "Its her choice🤣🤣", "__miss__cupcake": "♥️♥️Yay girl so true", "psych_yea": "Babygirl tumi eitu pindha na @pranamikadas_", "devika_rks": "People like you will understand you . One has to be sensible enough to not judge beautiful and strong soul like you . More power to you . Lot of respect and love . You are an inspiration ❤️", "haimanti501": "Haters gonna hate.... gal you rock... you are the reason I feel confident in my body...so thank you for making this world beautiful...❤️❤️❤️", "animasindur": "So true dear.... it’s ur body and ur choice. I really love ur style. ❤️😍", "sincerelyreem": "I love the bottoms, where did you get it from? @komalpandeyofficial", "_en_bhavya_uno_": "We loved you we love you and we will love you . As natural as confident you are ❤️", "_____prashi________": "Caption so inspiring 😍😍", "kashish13.__": "Well said💯", "tajs.gill": "Actually I would bet that most definitely doesn't want to see you in any clothes 😉😁 be free and wild 😂😜", "dudehrithik007": "❤️", "currentaffairs___": "Don't explain to those patriarch people. They won't be able ro understand it. It's deeply entrenched in their minds. You do whatever you want to do.", "kritika_0604": "more power to you❤️", "enn.whee": "Problem isn’t showing skin, it is when that’s all you do.", "ankitachander": "you do you gurl ❤️❤️❤️❤️❤️", "thatordinaryladki": "Because that gives you more followers😂", "ankita_kuksal": "🔥🔥🔥🔥🔥 caption🔥🔥🔥🔥🔥", "rajvihasuha13_": "@shafinaz_islam___", "_.itsjustann._": "Well said ♥️", "taanivaanimakeovers": "👌👌👌👌🔥🔥🔥🔥😘😘😘", "tripti_pearl": "U looking like Rakhi Sawant now", "anushka__1701": "😫👌", "shambhavi__tiwari19": "Who thinks she looks a like bit khole Kardashian 😅", "akera5539": "❤️❤️❤️❤️❤️", "rupaljindal": "❤️❤️❤️", "priyanka_dr": "More power to you ❤️", "vedhahaha": "Power to You♥️", "ami.sukonna": "yuck disgusting 🐸", "theblisswish": "Awesome 🌸❤️👌", "manwinderhundal": "Dear komal you can only show your breast when you have it okay 😂😂😂😂", "tanishkkkaaaa10": "More power to you girl🔥♥️", "reawes0me": "U inspired us thanks for that 🙂", "coffy_n_clicks": "Looking forward to see more content like these dear.. ur the best and awsome tryon haul maker.. and a huge inspiration to everyone.. lots of love @komalpandeyofficial", "sampreeti_patra": "❤️❤️", "smilysanaya": "Which song is this??💓💓", "itspaintingbrown__": "Can't relate this in daily life... exposure won't make one stylish and covering up won't make one dumb...The challenge is to be and look confident in covering up and yet rock that look(yeah in winters as well😋) btw love u komal #constructivecomments", "ending.self.before.they.can": "💛💛💛💛💛💛💛💛💛💛💛", "khushi.habib": "Well said 🙌😍", "hemanshi_kakadiya_hk": "Caption😍", "gareima_t": "❤️", "rs0017736": "Hi Komal please reply me I'm your biggest fan from 5 years please reply me and yes what's your age ( my self pranjal 😃 )", "taheeyaa": "The all u say is ok but i am muslim and we are not allowed to show skin so what can i do can u plzzzzzzzzzz do a simple cover body look", "anam.khan1988": "I totally support you for showing your skin or whatever you want to show but komal skin show and women empowerment is two very different things, so think before writing something on social media platform...", "the_simran_sahu": "Caption hit me hard 🔥💗", "flukecookindia": "Your videos are awesome... they look natural / normal viewable.", "maslin_sabeel": "To the long caption: if this was your personal account then all this makes sense! As u do beauty and fashion related content and wearing lingerie as a dress is not relatable 😄 thats where u get criticised! Ps: i don follow u or ur style just randomly saw this post!", "divyachandron": "💯💯💯👏👏👏", "global_waters4": "Manhus nangi aurat kisi din iski dead body milay gi kisi gutterk pas wo b nangi", "usettleugetstuck": "More power to you Komal!! Godbless you!!", "reetmansharamani": "Perfection. That’s all I got to say.", "aku_joshi": "More power to you and posts like these♥️", "ipsitasatpathy": "🔥🔥🔥🔥", "tanvi.n.tagra": "girl where is this whole set from!!! you’re on fire 😍😍😍😍😩😩😩", "___dhanya_____": "In India it takes guts to show the kind of style you have ... You rock komal 🔥", "attitudinal_bae": "Problem ye ni h k ap chote kpde pehnti h problem ye h k ap apne fashion episodes m b chote kpde pehnte h jo ap videos ap humare liye bnati h and humare na allow h ese kpde na khud pehn skte h hum ese kpde isliye jb pure kpde hote hna to acha lgta h k chlo koi video to h inka ko humare jaiso k liye bna....i wish apko apne fans ki problem pta hoti or ap smjhti", "ankitaupadhyay": "You really a bomb❤️❤️..nice reply to ppl whu jealous of yu😘", "miles_to_memories_": "Caption ❤ people really need to understand this 🌸", "gayu_de": "Love your thoughts ❤️❤️,big Love", "rishithajahnavi": "Much love and power to you❤️😭😍", "jangiranjiii": "You are perfectly perfect the way you are ❤️💋lots of love ❤️", "medha_bajpai": "You've come a long way from doing fun videos on popxo to becoming a brand in your self ❤️ It's really comforting to see that your comfort matters to you first ❤️❤️ Keep doing great❤️❤️ btw... you look bomb🔥🔥🔥", "nath_saara": "@poonam_yadav11 I know you like her but what's with the tongue?? 😂😂😂", "vijeshsinghal": "💐", "shanaya_ka_karishma": "🔥❤️😘", "_4z4d": "Par thandi bohot hai! 😅", "pratiksha69854": "It's all about choice u r right dii ❤️", "janvi_chetri": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "udeeshadwivedi": "@jaisena_rathore_rawal", "tannskinned": "Keep wearing what you love ❤️", "baby_bold1702": "Amazing caption...but uh don't need to justify dear ...we love what you wear...nd who you are", "neha_chawlaofficial": "and she is ur fan now😇😇", "winterblush_preeti": "Hey, what is this underpant you're wearing called?", "i_am_vijeya": "I simply love your content and your videos are so classy & chic...way to go ! 👌🏼", "spilled_inklove": "Because you got it and its YOUR choice.♥️❤️♥️❤️ log achche grades flaunt kr sakte hai achchi biwi achcha ghar achcha bank balance achcha x y z to achchi body kyu ni. Kuch b achcha banane me bht sacrifice or mehnat lagti hai.", "rj_kannadathi": "Komal pandey=Confidence=Fashionista=Sweet Soul=Daaaaarling 😘❤️", "ansh_chhabra._": "@komalpandeyofficial well uk what you don’t really have it ! Lol", "shoshalove.thyfoodie": "❤️❤️apt buddy🙌", "suchi_goswamii": "More power💯", "komalsingh9989": "❤️", "aanshuarora": "Girl u must do a piece on lingerie brands n selection too", "sonam09": "Yo girl 😍😍😍😍 Lots of love 💓", "alifsalwawamia": "Hats off to you dear ur just amazing @komalpandeyofficial", "__pritzel": "What's the background song ? 😖", "ankitbatham869": "❤️❤️🔥", "true_vibes_8": "Hell yeah", "jawed_samreen": "Women empowerment is nothing to do with showing body or skin... showing skin doesn't make you a wonderful woman... decency is something which we should maintain..our Indian culture..ab kapde pehno hi mat itna zyda shaukh h skin show krne Ka to..phir wo zyda normal hoga sblog nange ghumenge", "princes_shimmu": "Y acc to women like u showing skin is the sign of women empowerment... Its cool to wear whatever a person likes whether its a man or a woman...n nobody really have the right to judge but wearing short clothes or half clothes or whatever is not the sign of women empowerment.... Women empowerment stands for those dumb head ppl of the society who thinks boys as superior in terms of intelligence as compared to girls....this is the mentally which really needs to be erased from the society... N once the ppl are open minded in positive way they will not even care what a girl is wearing n why is she wearing that...okk...clothes r just secondary... Mentality needs to be changed first...", "pooj_a99": "Big love♥", "disha_karanjgaokar": "@mana_1694", "iamshraddhakumar": "Yaar if it your choice then why to get offended by any comment or judgement.. people will comment what they want if you have written in your bio \"public figure\" and your post and work is for public.. If you notice those comments, make a post on it and address them it means u r giving justification for ur actions or dressing or ur work..!", "theuglyduckling.biz": "What a girl 😘😘👏👏", "_.shagunkapoor._": "U r the Best💓@komalpandeyofficial 💓", "prerna__singh19": "Whatever you wear you look beautiful because u are beautiful inside out. And what matters is how you feel about showing your cleavage,tits,etc. If you feel flawless be that way. ❤️@komalpandeyofficial #staystrong", "deeks_on_fleek": "Caption 🔥🔥🔥🔥", "_an_shi_47": "🙌🙌the caption", "achumipulotoli": "Burn them 🔥...we're always there with you 🙌👏", "rabby___6": "I'm a big fan of urs,, i really luv u♥️♥️", "nikita._.24": "❤️❤️❤️❤️❤️", "tasnim.tfk": "You are are cool person and everyone should respect women choices because they also have right❤️💯", "zabeen_25": "Proud of you Komal..... I really am", "_vidya_1118": "Do whatever you want girl u always slay💞💞😘😘😘", "su.nita4916": "🙌", "gauri.singh9": "💯💯♀️✊🏻👏🏻", "justsoume": "Hahahaha cutieeeee! You go girl!", "not.archii": "Yes♥", "shristi_tripathi_": "❤️❤️❤️❤️❤️❤️", "stuffednstarved": "Daaaamn nice! Love it and love the attitude!!!!", "teena3911": "Where is this set from", "ziya.kap": "❤️❤️❤️❤️❤️❤️❤️❤️", "malathithevar98": "You give me the confidence every single day by your work and you are always going to be the one inspiring many women 🙌", "poojas1414": "😍😍😍🔥🔥🔥🔥", "tejashreebarkale": "😍😍😍😍what a post 🔥🔥🔥🔥 proud 💕", "harry.fondlinson": "YASSS!!!", "nikitasaini51": "Someone tell me which song is this 🤭", "sanchithavasanthkumar": "🔥", "parthavii": "Bang on !! Keep slaying 🔥 🔥🔥🔥", "neha.6323": "❤️❤️", "vinitasingh2405": "Brilliantly said!! 💝💞", "aparajitadg": "👏👏👏", "drvishugupta03": "fako", "manni_chaudhary_gr": "🙏🙏 Absolutely right. Be fearless 💕💕", "himani_kashyap9": "🔥", "yamamadhuri": "That's the best thing I read from past few days. I am overjoyed after seeing this post and the caption that made me feel really good. Keep up your work duh! All the best😁", "neyhavats": "Wohhooo...what a reply❤️ loads of love to youuuuuuuuuuuuuuuuu❤️ Hottttiiieeee", "el.le3363": "@komalpandeyofficial dont worry about these people, you are most amazing woman the way you are.", "artist.bychoicee": "You are so amazinggg😍", "simrankaurparashar": "U r a diva ❤️ let people think wht they have to, dats there prob 😘 lots of love", "priya_verma2222": "Whats with that thing with your tongue? Its so irritating to watch 😐", "dinkilakhani": "😍😍😍❤️❤️ well said", "_neelam.k": "@komalpandeyofficial love u a load bcz u r inspiration for us and people must understood the concept of CHOICE wic they applied to others also...oh god.damn sick people....", "sudha_at_insta": "Offcourse u hav choice but every time posing in bra is not women empowerment...", "deepshamohanty45": "Love ur dress", "__the.cozy.vibe__": "👍🔥", "a.mahak": "@komalpandeyofficial Of course you have a choice. And you choose to be a fashion influencer. And as your audience we do have the right to like or dislike any content that comes our way. You sure look good in whatever you wear (well, almost). But, can't really welcome the exact same content every single time - bikinis and bralettes and undies. It has gotten really monotonous. I hoped to see some good winter-wear inspiration, and that's the only reason why I would want to see you in full clothes - no hate, no judgement, nothing.", "rishikasinghh": "Her face looks so funny😂 like willy wonka from Charlie and the chocolate factory @mehak.dawar", "tejashrimalavia": "Everything is good....but wearing short cloths is not an women empowerment..", "lovebikes_adventure": "You are just brainwashing teenagers I am blessed that I and my friends or sisters are not teenagers in this era . Pls have some decency no matter what we are still Indians and so many teen follow you be a positive impact to them if you have the power. This is no USA", "orville_wood29": "Lol... the funny part is the and caption is cringe af... Your followers are just bored of you wearing the same bra and hip hugger and also the same nighty same robe 🙄. And (please leave the word lingirie alone because you're not doing justice to it at all ) Lingirie has a different style and concept not what you wear black bra and hip hugger uuughhh.. You could've ignored and do you like you said but nope here you are pulling some stunts for like and followers. P.S Be you ! Maybe if you stop being fake less critics you'll have. Peace out ✌", "reena_sharma910": "Really komal u have guts to carry these clothes. Yes I understand that it's ur choice that what u want to wear nobody has right to tell u.", "flash_menance": "You are love ❤️❤️❤️", "pariksha10": "💯", "streetstyleideas101": "Showing Tits is Normal???? Like are you even aware what you are saying in the name of women empowerment? Kon aadmi nanga ghumta h ??", "theglamdamsel": "🔥🔥🔥🔥", "kopaldecaf": "Hey Komal , a bigggggg warrmmmm (cause it’s cold hehe) huggggg to you . You’re awesome and all the love and support @you . ❤️❤️. Ps - what song is that in the bg , it’s really cool", "shrishtinagarofficial": "You define power🔥", "_san__99": "Or maybe.... You are too hot🔥 for thr cold🥶.......... 🖤#wearyouropinion", "archiegolia": "Whats wrong with your tongue? 😂😂😂", "the.muffin.head": "🔥your liittt af. We're proud to have you in country like India. Doing great job @komalpandeyofficial . ❤️💜We need more girls like you in society", "_sage_roma_": "Your caption🙌", "kianca_laurent": "Nangi", "heyitsmekriti": "Well said🔥🔥", "vaishali.valecha": "Word🔥🥂", "nehaavchander": "@komalpandeyofficial Thank you for being you :)", "rits_gpt": "Waiting for her to do something different 😅", "parishi_shahh": "Can't agree more.. ♥️", "khaleda_07": "A girl should be that confident😎😎.....You are inspiring❤️", "siramrubika1428": "This video is an answer for those who judge GIRLS on the basis of their outfits 👏👏 Go ahead Komal ❤️", "mru_lee": "SAVAGE TOTALLY 🔥🔥", "pallavidixit05": "💯 U look fabulous n confident in every outfit of urs ... and yes it’s a matter of Choice.....simple .👍", "shikhahanda30": "Yeh that's true Komal di if our parents don't judge us and we are comfortable wearing such clothes then why this society 🤔", "_ankiitaaa": "YOU ARE AMAZING🔥 Keep going girl🔥", "thatethnicgirl": "You are doing great job 😘😘and a big hug to you😘😘💓💓", "fashion_outfits_idea": "👏👏👏😍", "anisha_kharkar": "Naagdi chokri!!!! 🤣", "monikamboz_69_merock": "😘😃👌", "idhantrishiroy": "Power 🙌", "payal.trehan1": "U nailed it 💪👏 😘👍🏻", "anmolsaxena0406": "❤️ Love love n love", "aakanksha___bassi": "You go babes❤️❤️", "maitreyee__rawat": "❤️🔥🔥🔥", "bbygurlll._01": "I love you man😭", "min_song1": "No justification Pls..You r pretty we all knw that🔥🔥..#Stronggirl❤️🔥", "narayanisambasivam": "❤️👏🙌", "_shubhangi_11": "We need more people with dis kind of mentality🔥🔥 more power to u", "sakshik959": "Goo on babe...cheers...❤️❤️", "fatimahabib5": "Fav!!!😍💕", "lilmissnegi": "That's true....", "notagoodgirl2": "Really? Post this video on YouTube where you can't delete comments that you don't like and then we will talk. There really is something wrong with you girl", "mysteriohipsterio": "If instagram was a platform without any metrics, it would be fun to see how many such pics you would upload. Please have the decency to be honest, we all know you're dropping clothes just to generate hype and likes so that your followers can increase, and you can charge brands a bomb for promotion. We have no issues when you do such stuff, but it's annoying when you lie and act sanctimonious about it, especially after the money you've spent on your face.", "sunainamoond": "❤️ love the way u r sweetie ❤️", "sheetal__jain": "better caption than the post! Also, You look lovely 💓", "the_neeli_narii": "You look fabulous 💙🔥", "whyshrutii": "💯🙌", "nikitha__gowdaa": "Your beautiful and confident ❤️", "snehalkhatuja": "🔥🔥", "debashreebiswas\nVerified": "Verified", "ghanishtaarora": "@shreya_chaubae Inspiration❤️😍", "pragyatrikha": "Matlab ye hui na baat... Comments band karne ka nai... Or post kar kar k aisi janta ko jala jala k marne ka... Nd now I am more proud of yu...😘😘", "_thegirlwithchubbycheeks": "So proud💜💜💜💜💜", "soniadahiya6": "👍🏿👍🏿👍🏿👍🏿Huge shoutout 🔥🔥❤️❤️", "anamika.masih.9": "😍🙌😮", "neha_arora1600": "Flaunt It 😘😘😘😘", "himanshi_kamboj3": "You inspired me today", "kanchanmalasengupta": "I can't agree more 👏👏👏 people always judge us by the cover. It's my figure my skin my choice of clothes. If I'm comfortable to show my skin then why others need to judge me on that basis? It's my body and i love to flaunt it. What's wrong in that!! More power to you girl 🙌", "advikaprashant": "Love u lotss🔥🔥🔥🔥", "sree__lakshmi___suresh": "You are Amazing Komal!!! 🔥", "roshni.b_": "♥️💋😘", "sudarshanachowdhury": "Showing skin is so damn easy with girls with no tits😆 and she's talking about cleavage xD @li.shou.ahalya read that caption.", "vaidmonika": "Caption 🔥 and you 🔥🔥", "deeptinaruka": "Love the caption!!! Luv u☺️", "__urjeeta_": "Ur beautiful😍😍🌸", "tannusharma0108": "That's the spirit😍😍😍😍..love u girl. Love the way u r", "_.swag._.girl._": "We r proud of u!!!😄Go Girl❤️❤️❤️", "priyanshudalal15": "💜💜", "regen______": "girl power ❤️❤️ its our choice dude ❤️ get in your head ❤️❤️", "upasanaptl": "Caption😍❤️", "khushii_saii_official": "She is🔥🔥🔥🔥🔥.... With her body, with her style, with her mentality with her mind....", "dhirengwalani1999": "Hotie❤️😍😍", "aahna.sharma330": "Haha. . nice", "dimpplekpoor": "Bravo ❤️ u killer my girl 🔥", "marshhmellowww": "More power to you ❤️ 🔥", "anushkapathak101": "You rock🔥 You don't know, how much you inspire us day by day. You go girl.♥️", "choudhary_sheetal": "Awesome 😘😘😘", "devilqueen_kd": "Would like to see your studio set up some day.", "_barsharajkhowa_": "You are 🔥🔥👌", "thegirlwithcurlyhair_1": "💙💙", "harshitak911": "👏🏻👏🏻👏🏻 true & honestly said", "diya_the_cool_2911": "Hot", "shilpaa_arya": "Damnnn , dts true ❤️❤️❤️ caption on point", "fashunboo": "CAPTION ❤️❤️❤️SIS YOU TELL EM", "purabi_koley": "Bang on! 🔥@komalpandeyofficial", "kaifbhuyian": "Lov u hon!!", "hemalathaputtanarasaiah": "Pls do a video on right choice of lingerie for diff types of dress", "cheenagupta0021": "Very well said 👏", "saruga_raveendran": "I totally agree so proud of you for putting this out here", "shah_vaishali": "Lots of love and pride for who you are !😍😘🤗", "thegr8jen": "!!!!", "kasha.03": "WoW!! Luv u @komalpandeyofficial You are truly an inspiration!!", "arshiamyra": "You inspire me a lot to be comfortable in my body ❤️", "suvarna_02": "🙌🏼🙌🏼🙌🏼🙌🏼", "lisacharlotte_24": "From where did u purchase this lingerie ???", "froogal_fun": "You do you. Period.", "larvieeee": "You are just amazing..I love you Komal di😍😍😍😍😍", "roweenaalvares": "But being a fashion blogger....your style is OTT and not relatable to your followers", "tanuharjitnaunidh": "Nailed it! More power to you sweetie💕", "deep_wanders": "Caption. 🔥🔥🔥 More power to you.👏👏👏", "herejusttosee": "❤️❤️❤️", "sandeepkaur480": "That’s right @komalpandeyofficial I love your work..and your attitude..you’re amazing..", "pallavisrivastav1108": "❤️", "chocolatetruffle1999": "Go girl❤️", "manashi8888": "🔥🔥🔥🔥", "nishta.official": "PROUD😍🔥", "thatcuuteegirl": "💚💚", "foodie_to_fit09": "Utaar hi do na.. aur attention milega 😍😍😍😍😍", "anjali.kumari2755": "👏you go girl", "heenakapadia27": "❤️❤️❤️", "pooja_gangadia": "@komalpandeyofficial 🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "shikhranjeetkaur": "❤️", "swara_s_here": "❤️❤️", "i_m_shaanzeh_agha": "Much love💓💓💓💓💓", "manidhali85": "🔥🔥", "kanikachawla20": "👍", "sadquaquddus": "Breast 🤣🤣🤣 kuch bhi", "sherryshroff\nVerified": "Verified", "oni1708": "👍", "neelamsarda_explorer": "Well said", "ghosharpita574": "🔥🔥😍big fan mam 🙏", "neeshagurung2001": "❤️", "dr_guppy": "@komalpandeyofficial girl you are great inspiration 👏 appreciate every content you post . 😍 But yeah it's too cold so turn on heater when you shoot these days. 😌", "aartiiiiiiiiiiiiiii": "Hatss off❤️❤️", "kaviya_ch": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥❤️❤️", "priyaraghuvanshiiii": "U go girl❤️❤️", "saturn_garnet": "We stan you woman!!!", "tangled__af": "You are an inspiration 🔥🔥", "house_of_rao": "Well said x", "saudnyaaa": "Caption💯💯💯💯💯💯💯💯💯💯💯💯💯💯", "harshika_naarayan1": "@komalpandeyofficial I also wear revealing dresses.... and my parents haven't dismissed me .... Lol it's 2020.... I am sure we have better things to have our focus on than having a discussion about who is wearing what😂😂😂😂 lol.... by the way you are gorgeous...💖", "only.actresses": "🖤🖤🖤🖤", "prathveeshpai": "Ps:_ you've got no noticable tits, its like watching a malnutritioned male trying out a women's outfit, So we ain't judgin you🙏😂", "priya._rajasekhar": "Bold🔥", "_paushali_": "You go girl❤️", "roshni.goyal": "❤️", "ananyagupta._": "Caption 💯💯💯🔥🔥🔥", "theauthenticchic": "Reminds me of the time these two women drove to me down the road and called me out for wearing shorts which apparently \" tempts\" the people (men) walking around me. \"This is the reason for all the rapes\" she said, LOL", "arora_kaveri": "You rock 💫", "warrior_sierra": "Will wait to see if this outfit gives you comfort wearing in public..! #wakeup", "maniniii_12": "👏👏👏👏👏👏", "garg_ashita": "Superb...🤘🤘❤️❤️", "isharanaa": "YES BABE PREACH !!!! Those women are simply jealous, just do your thing 😍", "maimunawafa": "You look awesome in those clothes... 👏👏👏😘😘😍😍", "twilight_queenbee_prayukta": "Live the way uh wanted to babe!uh look stunning !!! I don't have any idea that aapko aese kisne bola but i know that ye sirf aur sirf ek inhuman hi bol sakta hai so iske liye aap zyada mat socho di! I love your content I love your ig videos I love your fashion I love you!!!!uh go girlll! Keep making awesome content!!!love you from Kolkata💙", "thealyonatalukdar": "Waiiittttt your lipsssssss. They changedddddd. Lol I only just realised and I just couldn't put a finger on what was different .", "makeupandnailsjunkie": "❤️", "vipan.d.k.11": "❤️❤️", "niahsingh": "Beautiful and well said!", "cindrella.c_": "Whatta lovely thing I've read this morning!♥️", "sheerinasinghania": "But anyway good girl. Hope u flourish", "akhila_varghese9299": "Yesss Queen!!!! 🙌🙌🙌 PREACH SIS!! 😍😍😍", "ria_1418": "Well said komal. Its absolutely correct watever you said.👍👍👍👍👍💖💖💖", "___abhinanda__": "U go girl...♡♥♡♥", "aiyanachhabra14": "You rock", "the_scorpiondivine": "😍", "anumadgai": "You go girl❤️❤️", "anji.vaishnav": "🔥", "sherin.jabbar": "Yes ofcourse its your choice 🙌. And we love you the way you are😍❤️", "simranjeetkaur_06": "Yassssssssssss!!!!!! @komalpandeyofficial 🔥♥️This is a tight slap to bring normal in their head 😂", "purvasehgalwahi": "Ppl body shamed me when I was overweight, ppl bodyshame me when I have lost weight..One thing I know society will judge you whatsoever so I have stopped caring now..Luckily my family, in-laws, husband supports me so who cares..you are awesome..I love watching your videos..idk but it gives me some kind of confidence..thank you @komalpandeyofficial !!", "gigglemugsanaya": "More power to YOU @komalpandeyofficial ❤️❤️❤️❤️❤️", "vidz_77": "well said Komal di🥰❤️❤️ we all r thr to love u n support uu...dnt give ears to such people..", "who_is_d_": "All time favorite @komalpandeyofficial", "bkeerthy": "Prech", "farhanashukla": "Disgusting", "sakshisrivastav001": "You are one hell of carrie bradshaw 💜😘 You go girl😘", "un__mona": "Crushing on you day by day.... You glow girl😍😍😍😘😘😘😘God bless you💕", "stylebythatsparklingthread": "🙌🏼🙌🏼", "vanitathakur09": "❤️❤️❤️❤️❤️❤️❤️❤️", "stylingmyfluers": "Great thoughts & yes you have right to choose the way you dress up 👌👌👌💜", "yashika1702": "Kudos 👏😘", "michmich.f": "PREACH!!🙌🙌", "chirashri": "You killed it! ❤️🙌", "treehira": "Is the lingerie from la senza? 🌻🌻 Looking wonderful x", "_sabihhaa": "Love You alwaysss❤😍", "crakspace": "🕺🕺🕺🕺🔥🔥🔥🔥🔥bravo ❤️", "xx_suhani_": "Damn\"", "deeptidas09": "❤️", "chawdahemika": "🤗🤗 Amazing headline.. you are a darling.. You know what you do and ita your choice.. you respect and I do respect.. lots of hugs to you Komal.. from far off country.. 🤗", "kinjalshah91": "You go girl!! keep doing what you do cos youre amazing at it 😘 #bosslady", "meme_swty": "Love your attitude 😘😘", "meeshi09": "Caption 👌", "dove_09_": "💙very true & 🌸 important message💙", "surabhiavhad": "THIS... THE SOCIETY NEEDS MORE POWERFUL LOVING WOMEN LIKE YOU ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️💯💯💯💯💯💯💯💯💯💯💯💯💯💯", "_amisha_tiwari_": "Love the caption! Keep slaying! @komalpandeyofficial", "kausharmalik862": "👏👏👏👏👏", "_.taaraaaa": "@_._.moody", "priya_kakkarr": "Do you wear short clothes because like it or you know that it is the only way to gain more followers in this world", "deeps_luvstuck": "Kudos gal 👍🤟... hey ppl I'm comfortable n that's why I show my skin...if you are uncomfortable seeing me the way I m go shut your freaking eyes.", "ankyadav_": "♥️🌸🤘🏻🤘🏻🤘🏻", "deepa.patel.393": "Hey beauty💝! I don't know if you get to read this, but I hope it reaches somewhere.. First of all, irrespective of everything, being a follower I must say \"You are amazingly stunning in all ways, whenever I look at your profile!\" Secondly, Please stop explaining yourself and telling people everything. You owe noone any explanation of what you do. Your life is yours, not anyone else's. Keep loving yourself the same way you're doing right now 💝💝", "fashiontwistturns": "Love you girl 💖", "ankitarsyadav": "❤️ Keep posting please... definitely clothes does not define the person..", "anandmaitrayee": "You the best😍", "divine_wilson_": "People need to know this!", "thatmolekid": "❤❤❤😭", "bhavyaanand007": "Such a pretty women 🥰. So so proud of you , you’re the reason girls become confident because you give us so much of confidence of wearing whatever we want or we feel. Thanks for doing so much . Loads of power and love", "priyasinghrawatt": "Can't decide what's more beautiful! CAPTION OR YOU! 🔥💕 @komalpandeyofficial", "manisha_kr121": "Your caption🔥i agree 💯 just for making it normal to the mind of abnormal peoples.you are doing unfair with us ,i really like your post but since long you are just posting same kind of stuff it is now seems boring for \"normal\" ppls like us 😂please post varities of content as like you do earlier not just one same style.", "___late_____": "ukw they are jealous cause they don’t have such a body to flawnt so go girl haters will always hate..", "richa_magavi": "❤️", "uberchicjo": "Take that haters! 👊", "tanya._yadav": "@komalpandeyofficial 🙌🙌🙌 absolutely correct di I m totaly agree vd uh infact I also want to be like uh nd want to look like uh...I jst love the way u are 😍😘", "poetdark123": "Damn MY INSPIRATION🔥🔥😍❤️🙌", "rubysingh94_": "Stunning and confident nd most importantly break all the stereotypes 🔥💯❤️", "setu_bhakta": "Ohh god...the all I want in my life,the skin like you❤️Go girl.totally appreciate you😘 @komalpandeyofficial", "megxo_5": "Well said ! You go girl ❤️", "sugandhrastogiofficial": "Kuddos to you, girl!!❤ This is Savage!! 😄😍", "vanessasherylcolaco": "You give each one of us a boost of confidence ♥️ don't let anyone take your shine ✨", "sabiachhabra": "🔥🔥🔥🔥", "romeen.1": "Yasss queeen❤️", "messed_up_curls_and_life": "❤️", "anushka.gupta096": "Savage ❤️❤️ Big Fan of Yours", "pranvi_vinayak": "Plastic", "karishmaaa01": "Watta gal 🔥 #goals", "thegirlwithherpalettes": "I see almost every other blogger to wanna be like you......You're the best!!!😍🔥", "prastuti__baruah": "I feel you are soon going to have your own brand 💃just a feeling 💕 more power to you girl 🙆", "nandini0301": "You are a ROCKSTAR♥️♥️♥️", "food.fashion.funw_sonal": "@komalpandeyofficial So very well said 🙌🏻 Men or women, we only need to understand that we look & feel our best when we be ourselves! As simple as it is ✨", "sejuu_2604": "Hey komal I very much cherish your work and you've been one of my fav bloggers❤️ but could you plzz check your dm I have been trying to text you and ask you some of my queries related to skin but there has been no response I hope you would soon reply to me 😌", "brushnblushbyruchika": "Caption!!! 🤩❤️❤️❤️❤️", "pushpaj.e.n.a": "Loads of love and best wishes", "kachwala.m": "AWESUMMMMMM❤️❤️❤️😘", "dewdrops.on.roses": "YOU ARE THE BEST❤️", "das.barbie": "You are my favorite ❤️", "themoiofficial": "Stunning!❤️", "priyankadas0010": "Do whatever makes you happy as long as you are not hurting anyone! People tell you to dress modestly but no body tell or advice you to be humble,be kind to others..you are so much more than just your clothes..it's the person underneath the outfit that matters more.. because she is the one who is going to influence other people! ❤️", "thatamazingmom": "you are confidence ki dukaan😘😘", "priyasao_": "More power to you gurll ...@komalpandeyofficial love ya❤❤", "maitri9819": "Girl you have a fab body and it's no harm showing it.", "mishra_aradhna": "I am loving your dress how to wear just fantastic", "__dc__deep": "no breast no legs no booty 😂😂😂", "batulkapasi_15": "Agreed 👌🏻", "_kittoo_": "Not a follower but love the caption. So well said👏", "aratrika00": "yess🌻", "kreativecaterpillars": "U look so international❤️", "ashaaasharmaa": "Hell yes!!! Thanks for taking it up for the team 😎👌🏻❤️", "harpreetkaur316": "Is showing off your skin called women empowerment according to you", "sumedhian_parijat_": "well said diiii😍😍😍😍 ....you are my true inspiration 🙏😭☺️", "doniak30": "I don't know if am saying this right my hindi is not good 🙌🙌🙌❤️❤️bhartiya nari sab pe bhari👏", "akansha_saksena": "👏👏👏", "ushmatyagi": "Power to you gorgeous monster 💜", "_durba": "Dayum 💯", "miss._.bing": "You go girl 💗✨✨✨", "rhea_pdh": "Where’s that bra from?😍", "vibhutimoradiya": "Well said girl❤️", "punitsidhu1": "❤️", "taan._ya_": "U r perfect ❤️", "daliadey09": "U r inspiration komal lots of love to you I liked the way u r man u r so perfect love youuuuuuuuuuuuuu🌼", "wellnesswithjasdeep": "You are gorgeous! And love the caption ❤", "neelamyounas786": "Captions🔥", "taniaa2511": "@sohamchowdhury", "baby_mochi876": "Oh..i become a fan of yur boldness...yur words and work were inspiring alot of women....😊definately gonna post this post in my story...lots of lov..💜", "km_style_corner": "Ye besharam ladaki ne to had hi ker di ab", "di.ewww": "More power to you❤️❤️❤️❤️❤️❤️❤️❤️", "shrutichandel14": "Aise he bahr chale jan", "aliviyapaul04": "❤️", "shiyanaofficial": "Babe you look bomb doing it! Don’t listen to a bunch of jealous people being BJP on clothes. 🙄", "lawyer_dreamer_": "And to clear the misconception to everyone who asks that .. How is wearing less clothes and showing cleavage a women empowerment ? You need to have more brain to understand this.. we do say this statement, but there is something called CHOICE AND CONFIDENCE & COMFORT in between . And yes if we do anything with the feel these 3C’s ... that automatically becomes women empowerment. Aya smjh ?", "imightbetanya": "STEP ON ME MA'AM 🔥", "mstz_ladytin_tina": "Well said @komalpandeyofficial 💗", "sassy_girl_downtown": "U slay 🔥", "pihu_rythma08": "More,more more power to you❤️", "zia.rodrigues": "🔥", "faux.fuchsia": "Great Caption and message", "anugata_sen": "Babe you nailed it❤", "natasha_ambavle": "The Caption - Brazzen, Fresh and Empowering ❤️", "meundefine": "That's bold @komalpandeyofficial", "samiyaberi_": "💯💯💯♥️♥️", "jindal.shruti18": "I love you for this post ..", "aran.ravi": "🙌👏", "i__msimran": "👌👌", "aaronkoul": "Mei bhi nanga hota hun, mujhe toh koi kuch nahi kehta. Log bohot double faced hain. Golmaal hai bhai sab golmaal hai.", "mona_darling143": "Love you 😘. .U r my model😍", "akanksharajput.21": "👌", "swapnil8494": "Kya baat.. kya baat.. kya baat... 🔥🔥", "divya_a_menon_": "Love you sweetheart, muaaaaaahhhh", "sathisarka": "I used to love that old innocent komal. U just lost ur innocence... It's not about ur clothes. U always look gorgeous in any clothes", "curiouschicblog": "Well written @komalpandeyofficial & you are super hot 🙌🙌", "thatgrlaashna": "Damm caption ...🔥🔥🔥", "_.shreyaa": "👏💕", "bhawnas27": "Go Gorgeous Go..... 🙌😘", "meenakshi87": "Hahhaha! Y to shame if one can learn from someone.. I would love to get this kinda confidence🥰", "ejhdhdbddb67y": "I love you and your dressing sense I never judged a girl by their clothes ❤❤❤❤❤", "nandini.sharma.1404": "I don't think the comments would have been similar if the model was curvy . If it was Disha patani posing in the similar manner comments would have been harsh. However I don't understand this logic.", "umadixitt": "💯", "avantika_nayak_26": "Caption 🙌🌻", "masayacouture": "Wear your style, Embrace it, we love you! More power to you. - Masaya 💛", "varchasvimahajan": "Absolutely gorgeous😍😭💔", "manmitkhurana": "Amazing..lots of love", "ushahahahahaha": "You're SAVAGE 😌👌", "shivani.madan.792": "Love you komal", "thetilthead": "Komal is a GEM❤️", "mnm_spammmm": "Well said @komalpandeyofficial ❤❤❤ its totally upto the girls to decide what they want to wear or not", "preeti_rawat_24": "Captain❤️😍....", "countryside_damsel": "More power to you lady. To be honest, when i think of boss lady, the two names that come to my mind is you and Lilly singh.", "curls_that_twirl": "You go girl!!! 🔥❤️", "the_adorablegirl_closet": "💓❤️", "_vanyasharma_": "I love you Komal! You just gave me strength. 😍❤️", "sahi_swan": "You go girl @komalpandeyofficial 🔥💕💕💕💕", "waqarseena_26": "Shut the hell up", "sonaikamalika": "You go girl!! ❤️", "i_m_aman_kaur": "Plz do video on dupatta draping 😍", "sunshi_nish2009": "Love the way u r 😊make video on fitness and diet", "prachigupta116": "Lots of love to you hottie😘😘nd yeah u r absolutely stunning nd grogeous🤗🤩", "mannatbakshi": "Hah", "_chauhan_priyanshi_": "I love you so much❤️ just keeep rolllingggg💕", "deep.ika04": "Gi", "shivlitandon": "🔥 🔥 🔥 ♥️", "rashikashish": "Youuuuu❤️❤️❤️❤️", "its_shinam_": "❤️", "anshikakhanna8": "🔥🔥", "prats_panda": "❤️❤️❤️❤️🙌🙌🙌🙌", "polkasandstripes.clothing": "@komalpandeyofficial SAVAGE ❤❤❤", "t.h.e_gangster": "🐥", "ishanshi__pathak": "Yo go girl!!!", "sonaliarora3002": "Amazing amazing amazing....perfect caption.... Also share a video of winter body care...please 💕", "shreyasjadhav_26": "SUPER PROUD🔥 keep up the great work Komal, you inspire so many of us!!❤️❤️❤️", "jassluvsat03": "Please change your hairstyle", "anjali_ismile": "Loved it!!! I will till it’s in your head❤️ bang on ♥️", "poulomi.ghosh4649": "😂 Do you really have them to even to show 😂😂", "jaipursunshinee": "Killed it with your words👏👏👏... Proud of you 💙", "_ihersheys_": "Go baby❤", "krishnakmurari": "👌👌❤️❤️", "sayeshaarora10": "Not even hot", "arundhutee_27": "You are our inspiration ❤️ the way you carry yourself is something I admire the most ❤️❤️", "trishafying_life": "Yass yass yasss! ❤️❤️ Much loveee ❤️", "__mush___": "And I feel so angry when people name this concept of choices as Feminazi.", "dazzling_sri": "❤️❤️❤️", "rasamnamita": "❤️❤️❤️", "tanu_2490": "Yaasss!!!🙌🏼🙌🏼🙌🏼🙌🏼", "bebe.bonny": "So courageous girll ❤️", "yogini_riadawar": "Very well said. Bravo 👏🏽 more power to you 🤗😘", "rhea.dadra": "We need more people like you!", "saumya_rathore": "More power to you and people like you ❤️", "the.khushi.singh": "It need a lot of guts to change people thinking n wearing those in such (a cold 😛 )orthodox society ......... You are truly an inspiration for many out there .... YOU GO GURL🔥🔥🔥", "divya.nagumantry": "It gives every woman sooooo much confidence to see you absolutely confident and gorgeous in every look.❤️❤️❤️", "__annuu__": "Love ur stlye ... N ur attitude ❤", "r.debika": "Love your style soooo much❤️❤️❤️❤️❤️❤️❤️❤️❤️", "kjc_dreamer": "Yes!! PREACH!!!!!Good on you for saying what you believe and staying true to yourself😁😁", "_khushiyaan__": "True that...❤️❤️", "uma.mayra": "🔥🔥🔥🔥🔥", "_kousumi_": "😍😍😍😍😍", "_aswxnx_": "♥️", "butterchickenaan": "Soo Proud to have a girl like you whom I can look upto to learn self confidence and self love.. You are so Inspiring I can't just put it in words.. THANKYOU FOR ALWAYS INSPIRING I LOVE YOU❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "jannatshekhawat1": "if guys in six pack abs can flaunt their body so why cant women flaunt their curves?", "__k___d_____": "💖", "the_unpredictable.girl": "You slay woman!🔥 haters gonna hate we gonna shake shake!!😂", "saahhhiilllll": "🖤", "siddhiii.gawade": "😂♥️ gooooooood one", "whimsical_potion_": "Am not criticizing am just asking as am curious and yeah I love you❤️", "theoneandonly_trisha": "Amazing thought . Love you. Inspiration #assam ❤️❤️❤️❤️", "goyal_muskan14": "You have such a flawless body soo your is 😻😻😻 also more power and love to your way ♥️♥️♥️♥️♥️", "gaurav.o8": "Correct😅", "shreya_14_2004": "Thank you! People really NEED this💜🔥", "unnati1004": "My most favourite person 😘😘😘😘😍😍 🔥🔥", "swati.bathla": "I personally love you and your style..but in my opinion its getting a lil too monotonous.. that's it..❤️❤️", "srestha.rath": "You are the best.❤️", "mszarr": "YES YES YES 🙌🏼", "saltybuttercup": "Caption🔥", "okbyegm": "GO SIS🙌🙌❤️", "ar.riddhima": "You got it, you flaunt it woman! ❤️❤️❤️", "glocal_candy": "Wanna be Kylie Jenner? 😅", "jhasoni33": "U don't need to explain anything to anyone, do whatever you feel like and make yourself and your parents proud, more power to u, love u❤️😍", "bhtt.puja": "Zesss🤘🏻", "_iamsupriyah._": "Well said💖💖💖💯✔", "niraalee_": "Slay like KOMAL PANDEY❤️❤️❤️", "payalyadavpr": "Shaant gadadhari bheem shaant😂😂", "missy_om": "Bikini model can be your next goal !!", "shivali.suryvanshi": "That's true sweetheart...❤️@komalpandeyofficial", "chakraborty.adrita": "You nailed it💗", "iam_snehapriya": "You re the best ❤️❤️❤️keep going 😍😍😍😍😍😍😍😍", "oo_vaibhu_oo": "Truee !!...I just love the way you aree!😭😭😭😭😍😵💋💓", "my_wavy_tales": "😻🤗", "monicadelgado": "💪🏼", "stylegrabs": "You do you boo👏. Its sad that people have the audacity to judge how a women/non- binary person dresses even in 21s century....or ever for that matter.", "abhinaya_sajeevan": "😍😍😍😍😍", "miss_m_a_d_h_u_r_i_m_a": "Yaar normal life. Bhi hai. Sbhi alws itna blod makeup lagake.. College nei jata. ....", "s.r.shankhdhar": "💕u r beautiful inside out Komal 💕", "yuvasree_nagulapalli": "More power to u @komalpandeyofficial ....❤️❤️❤️", "akkuk9": "I just love the way u are😘.. It's totally up to u wht u want to wear... I just love u and nobody can change that😘😘😘", "__sidak__": "🙌🙌", "salvitrivedi": "Need not have to explain yourself to others., as shallows won’t get it. You keep doing and keep shining. No one can dull your shine unless you let them. So don’t pay attention to negatives be the rock star as you are ❤️💓🤘🏼💫", "klasnobl": "👏👏👏", "supernovamona_": "👌Word", "parulsharma776": "Superb nd u r right.......", "di_di_967": "She's Savage😂🖤", "anilaalisherazi": "You go girl!!!! More power to you!! ❤️", "elly_bee_61": "Well said👏👏👏", "excited.atom": "I just love this spirit of yours, Komal. Keep going ❤️", "sameerakaifi": "She is flat😮", "arshpreet_kaur_maan": "❤️", "aishi_chakraborty_": "Perfectly said ❤️", "roshnigulabani99": "Ma'am 🙌🙌 lots of love ❤️❤️", "vaidehi.26": "you are🔥🔥🔥🔥@komalpandeyofficial", "sweety_newmai": "YES your right 👍👍 Go GIRL😍😍", "iamjenna__": "Yes. we grow by supporting each other and not by judging each other. More power to you. Stay amazing and keep inspiring everyone. ❤️", "lifeinthevalley08": "❤️❤️❤️👍👍👍", "_a_n_u_r_a_g_j_a_i_n": "Thand lag jaye ge bhenan (sister)!", "_thebohobong__": "Proud of you @komalpandeyofficial 💖💖💖💖💖", "manalipawar_": "💕💕💕💕", "akshita_0604": "😍👌", "parekh.mayuri": "More power to u😍♥️", "lakshitaliza": "Proud of you ❤️ queen❤️", "p_dot_j": "💯", "kanchanvalvade": "More power to you @komalpandeyofficial ♥️", "riddhiculous.___": "Like I am one of those girl who feels comfortable in her football jercey and her shorts but I totally understand that you wear it cause you know you can slay it . Firstly you have guts secondly I Love you and thirdly I am proud of what you do❤❤❤❤❤❤❤❤❤❤", "debanjanahaldar": "So true. Love your work and your outfits❤️😘", "_i_am_sona": "Caption🔥🔥", "its_k_r_y_s_t_l_e": "❤️❤️", "abibarman6": "Hey favourite woman❤️", "organicsmokes": "Buster 😍", "makeupbyrashmi__": "Agree 👏🏻👏🏻👏🏻👏🏻", "alekhyaemani": "Slaaaaay🔥🔥🔥", "princie_divya": "You are truly an inspiration.. Honestly 🤭❤😍😍🥰🥰🥰", "rana.elena": "Right at their faces🙌", "niddhi_pandey": "Pandey women's rock🔥🔥", "harsha_ledwani": "I love your body and your confidence❤️ You motivate me to do better for myself and my body.", "glowwithemma": "😍😍😍😍Yasssss girl", "sangeeta.sha.58": "True🔥🔥", "_a_girl__has__no_name_": "Diva🔥", "____halcyon_": "Yooouuuu Goooo girl !! Pleasseeeee write for issues like this often if you can. You hv such a huge fan following nd u cn easily influence people with such mentality. We need more girls like you. You are the definition of a powerful strong independent woman. And to me you are also an artist, not everyone can be as creative with clothes as you are. Im going to meet you some day and hug you🤩🤩❤️❤️❤️ (if you let me😭).My brother saw you in select city mall and i am sooo jealous since then.", "mywhispersjournal": "Caption 👌👌👌", "iamaafia": "Attitude queen❤️❤️", "thecurvedprobe": "Well said 😍", "__saaj___": "❤️❤️", "naaz19999": "Absolutely true", "iamthe___best": "You actually look good in short clothes😍😍but not everyone can were such clothes... It's their wish... Anyways I liked how u shared your opinion @komalpandeyofficial ❤", "ankeeta_13": "Now that's what we call women empowerment! You go GURL! 💖💖", "i_srishti_gupta": "@komalpandeyofficial long way to go ma'am ❤ you deserve all the love.", "mariya_0365": "🔥🔥🔥🔥🔥🔥i love ur confidence and u are a true inspiration for a woman who thinks to do things like a woman!!!!!!", "debahuti.g": "Can \"we\" ,as in women, just live our lives the way we want to. Sick of judgements! Carry on Komal! Just do whatever makes you happy.", "romika_shringi": "True! You're the best and beautiful!!!! Be the way you're we'll love you💞 you have the best personality i ever seeen in the social media ♥️ alots of love ♥️♥️♥️", "rohini_chakrabortyyyy": "Girl you are an inspiration a moodd.loads of love❤️❤️", "princesingh8855": "Girl power 👌", "lazy____lady": "It’s everybody’s individual choice what they wear, eat or do !!! no one should ever bother for that right😊 #livefree", "kittukalpana": "@komalpandeyofficial It easy to just watch and discriminate. It took alot of courage to just be wat you actualy want to be and what you are. It need alot of guts be in front of thousands of people without thinking of judgments. If my parents would alow if would be komalpandey patner in crime.i can understand for being a women and fighting for own choice means Judging someone is not right. Everyone has right to live their own.and plz never stop yourself what you r i love you if everyone would say you are doing wrong i will always be saying no she is doing what others are afraid of. Coming out of fear needs real power. Not just puting down someone. Our generation need to understnd wearing short clothes is choice and no one can wear it smartly. I may not like somethings but doesnot mean it is wrongs for everyone. Love you alot and plz be what you i love you.", "dancewithaakanksha": "💜💜💜💜", "an_ki_ta_": "@arushichoudhary1 your favourite \"celebrity\"", "patilpiya303": "So True! If someone is comfortable in showing their body, they flaunt it by wearing those kind of clothes. If someone is not comfortable, wears those which won't reveal their assets. That depends upon person to person and on their comfort and choices.", "mathurshikha2222": "Why don't u try in supermodel show mtv❤️", "mukta_barua21": "👏👏💖💖", "sushmita_rb": "😘😘💗", "vipika_forever": "I felt so good after reading it .. keep going keep growing Komal😘😘😭😭😘", "himanshi_garg11": "💕🔥", "nichitha_jain": "You said it RIGHT! The world needs to read this", "rensang6983": "🔥❤️👍👍", "cswapnareddy": "👏", "rao_kavyaa": "❤️", "preeti_sahu": "I love you and I love what you do... you are just amazing Komal !! ❤️❤️", "himanshi.kaushik": "So hawt🔥", "kaur_amyy": "🔥🔥", "anji_amazing": "Inspiration 👌👌👌", "_taniska_1212": "💜❤️Love the caption", "anisamaity": "Woohoooo this is soo great 🖤✌️💛💖⭐💫 ♥️", "vxdhxy": "You are beautiful 🌺", "lavanya_balakrishnan_": "what a girl man!! damn proud 🔥 hugs and kisses 😘😘😘", "mingmadomat": "❤️", "shruti._tyagi": "Caption ❤", "pinchofmirth": "You go girl!!! 👏🏽👏🏽👏🏽", "ranapriyaloushambam": "Yassssss Gurlll 🔥🔥🔥😍👏", "harshita_muppa": "💖💖", "tanya_juyal": "❤️🔥", "madhushree.halder.9": "\" I will post it till the time it becomes normal in your head\" 😘😘", "frisky_soul_": "Yes right but why to explain these things to those people that never understand about it it's there mind concept that never change..... Love ❤️😘", "simran.kaur.bhatia": "I love each & every word that you wrote💯", "impriyana": "👏👏👏😂😂THAT CAPTION MADE ME LAUGH..ooops soooorrrryyyy😬", "avantii2\nVerified": "Verified", "harneet__talwar": "@manpreetsaini17", "aryapatil_2501": "Lit caption 🔥🔥🔥", "_that_bong_girl_": "❤️", "n.sh5850": "🔥🔥you ❤️", "mayuri_timsina": "Yak Thu", "funkyrao": "💕💕💕💕👌", "sweetaaaa_19": "prettiest brave girl 💖💋...", "cutting_chai_bun_maska": "❤️❤️❤️ for the caption", "s.a.n.a_ansari": "You are beautiful.. and lovely♥️... Don't feel bad because of some nonsense...", "i_am___r.g": "👏👍", "snehaelizjos": "You go girl🙌", "anweshhhaaaa": "😘💕 trueeee talks 😘😘", "rosy_pozy": "U & your captione always make me inspired ❤️❤️ lots of love❤️❤️", "_.nehaasinghh._": "Perfect", "priti_uniyal": "😍you gorgeous 🌹", "imantdot": "❤️❤️❤️❤️❤️😍😍😍😍", "soniasingh94": "⚡🔥🔥🔥", "darshana_nehulkar": "Lovely as usual ❤️", "khushipatodi": "This is perfect. 🔥", "saritav_01": "Absolutely well said😘😘 you are fire gurl❤️😍", "rishika136": "❤️❤️❤️❤️", "_sister.of.the.moon_": "@komalpandeyofficial you look FIREEEE. You have a beautiful body and you have every right to flaunt it as long as you are comfortable. 💖", "pranjul7": "@komalpandeyofficial where did you get that bra from? Looks so pretty!", "miss_bidisha": "Caption 👏🏻👏🏻👏🏻", "meetalisingh_": "Ur in my veins ❤️", "ayesha_singh305": "Love the last 4 lines. More power 👏", "uptothestyle": "We need to understand the concept of CHOICE 💯 Great Caption 👍🏻", "style.mantraa": "When are you gonna get the extensions as u said in one of your last posts????", "natasha.thasan": "Yes Komal 👌🏽", "nehaverma0000": "@komalpandeyofficial well said gal..truly appreciate..doing well keep going god bless u😘", "that_style_mermaid": "@komalpandeyofficial it's the years of conditioning ..we are told since childhood that chote kapde nahi pehanne chahie and that's stuck in our heads. We judge people on the basis of their choice of clothes and moreover jab hum kre to badhiya dusra kre to cheap.... btw you look fab in both long and short clothes. And I don't think anyone can create content like you so none of the trolling matters.", "vasu_pinkz": "🔥🔥🔥", "realkrsna\nVerified": "Verified", "kstudio_by_mukta_walecha": "Fab & flawless 💕", "hemiroy": "♥️♥️♥️♥️♥️", "ambikaagaba": "The best you could have answered. Then there are still people in this world who call themselves EDUCATED & same side judge people on anything and everything. When same comes upon them they become Good speakers to defend themselves. Thank you @komalpandeyofficial for existing in this world. ❤️😘", "travelvlogiv": "Yaaassss PREACH🙌🏻🔥", "anshitabhasin": "👏🏻👏🏻👏🏻", "im_piyu_khirwar": "You are my favourite person 😍❤️ not bcz of ur dresses but bcz of ur confidence level😍😍u r such an inspiration❤️❤️", "chandni.arora.50": "Well said❤️", "monami_aries_saha": "Loved ur post😍", "smita3714": "Totally agree with you..... awesome 🥰", "_kthana": "Love this ❤️", "laveena_lalwani24": "Details please 🙈🙈 from where you bought lingerie @komalpandeyofficial", "roshnipeters": "Caption❤️🔥", "retrofitnessbysimrat": "More power to you sweety, you are super super talented and good looking so why not flaunt ✋", "beepasha_jani": "Big big love and hugs for you❤️😍😩", "kritikasharma3952": "I think ur just perfect n there's no issue in ur gorgeous clothes❤", "themeghagoyal": "Real qween😍😘 Rise & Shine💖💖", "priyankajadhav18_": "We are with you❤️", "kissdisha": "WOW, So proud that I follow someone who knows better and are OG!", "ria.kalra5": "You are right..It's no one buisness whatever you wear and you don't need to give explanation too but what you are trying to show by posting this video? If you don't care about what people say than why you need to say it again and again and show people that you don't care? This video was not needed.. Whatever you wear in your videos or personal life is your choice but this video is quite immature..Short clothes or no full clothes.. nothing determines women empowerment.. Every women is beautiful in her own way..You are too so you don't need to post a video in short clothes just to prove your point or show people you don't care..And this is not a hate comment..I've always admired you but just like you I also like to put my views..", "blush._.06": "🔥🔥🔥loveeee", "molin_das_": "Your a role model to every girl who fears to be confident while wearing what she likes♥️♥️", "_shru_039": "💜💜", "supernovasonia": "Komal, why do you even care? The ones who do not understand your style are not even your niche audience. Those aren't the kind of followers you're trying to target anyway. You do YOU. Girl, you're FIRE 🔥 There's a reason why you have close to a million followers! How many beauty bloggers/influencers from India have that kind of following? Well, I can't think of any but YOU. You should hear the way girls in my office talk about you. They're crazy for you. They literally tell other girls to follow you & check out your content because it's so awesome & also because you're HOT, lol. Do you even realise that you're a GAME CHANGER? You've set the bar so high for the others in your industry. Shatter that glass ceiling, you're almost there. Be FEARLESS, do your BEST, you have so much potential. Ever thought about what's keeping you back from achieving that 1M? Sometimes, it almost seems like you're being bothered by things that DON'T MATTER AT ALL! Don't let the unnecessary banter get to you. Instead, THINK about new ideas, BRAINSTORM and yet again come up with something so innovative that it becomes your trademark in this industry! Good luck and much love 💖🔥", "acethesass": "SavvvvvvvvvAAAAAAGEEEE💞", "rathore_niharika17": "🙌", "raikwarankita": "We believe in you,n I love u and your content.this post was truly worth....😘❤️", "ttanyatomar": "@namrata.99 Please understand this bro.", "iamsafeenaz": "I totally agree with your statement it's definitely once choice to wear what they want and I am in love the way u keep motivating me with your dedication towards work and self love...love you lots! !😍😍🔥🔥", "ankita_intodia": "Woooohoo .. very well said !! 👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼 @komalpandeyofficial", "wrenverma": "🙌🙌enough said...next!", "prachiibiswas": "Well said🔥", "furqankiawaz": "Hello random person in the comments, i hope u have a good day 😊 and remember u are perfect ❤️", "_.shweta_.04": "Totally agree❤️ with you girl", "_shreyaaa_a": "The best caption I have ever seen 😍❤️🙌", "sreelakshmi.kumar": "Shine on, you're a rockstar!", "indusrimal": "Well Said - It's CHOICE ... More power to u ♥️", "italianpizza_": "❤️❤️", "khurana.gauri": "You go girl🔥🔥🔥🔥", "1_khushiiiii_d": "YES KOMAL, TELL 'EM! ❤️", "vaidehi.2_12": "WOW GIRL!!! YOU ARE KILLING IT🔥🔥", "ms.journo_": "You did the right thing and this time for the caption💓yes it's everyone's personal choice and I think so you rock it", "khush_2591": "Amazing caption🔥for those who always judge everyone by their looks and dress... Ignore them because you rock komal di... Love you and your style😘", "_.kritikaaaa__": "I am so inspire by you, people nowdays do judge through our clothes👀", "deepikalovemyself": "Thts awesome ❤️👏", "vandana_khubchandani": "More power to you😘", "priyanka_madaan89": "Best caption of the day 👏👏👏👏👏👏👏", "varsha_sadnani": "Wow @komalpandeyofficial too good proud of you gal", "spilling_d_beans": "#womenforwomen @komalpandeyofficial", "nikita_arora18": "❤️", "shayneincphotography": "Wow that's hot", "693darkdreams": "Your skin is so beautiful😍😍😍would die for a skin like this♥️", "khushee.jaiswal": "You are fantastic 🔥you", "aayushi_thapa_": "💕💕🙌", "mahorhashmi": "🔥😍🔥I think you did a good job .. need more to see you in your lingerie", "deepshikha489": "💓", "___mahekk": "💘💘", "nishacherian": "Only you can rock in these looks 👍👏. We can't be even 1/4th of how you look. Not everyone got the body or the guts to dress like this 👏👏😘😘. Keep going girl 👍", "bhanvi_malhotra": "So freaking🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "shreya_0701": "Woaahh yessss.. Right on the face! #komalpandeyrocksalways!", "bhavya__salujaa": "NOBODY CAN STOP YOU GORGEOUS LADY😍😘 we all love you and know you, you may enlighten them by being optimistic but you can't erase their negativity @komalpandeyofficial Mam I love you,adore you ❤️ n ur work like many others #justfansaying #keepshining and #inspiring me n many more🤗 More power and optimism coming your way😘", "nehaaa05": "U look amazing and you have a positive attitude ❤️❤️❤️ please be my girl😘😘", "meenakshi.saxena19": "Keep us motivating ❣️", "pihu._": "I really love yu 😍 you are my inspiration ❤️", "ti.yas.ha": "Marry me? 😩❤️", "tendernighttales_": "@komalpandeyofficial please please please please do a winter lookbook or something. Please for cold weather. Like really cold weather. Love your style.", "sanjanasingh2104": "Thiss girl is just🔥🔥🔥🔥🔥", "silkywadhwa": "That’s telling them like it is. You go, girl!", "bohohobo7": "Ooh lala", "ahana_21_": "Komal I love you but the way you put your tongue out in every video gets me distracted.", "aakanksha_02_": "This slapped was highly needed to those who feel it likewise.", "ektagrover__": "♥️🙌🏻", "oops_no_rules_lady": "Superlike.... You go girl!🤘🤘🤘❤️", "ankita6718": "You nailed it babe❤️", "roshni_hira": "Love your confidence 💕💕 lots of love girl 💕💕 keep on slaying 💕💕", "the_nocturnall": "I am proud of you ❤️", "deline_kiru": "🙌🏽🙌🏽 YES!!!!!", "world.awaits.her": "More power to you!!💕💕💕 @komalpandeyofficial", "avantikasirohi": "More power to you girl!!", "fortunatepurnima": "Love it!!! Nailed it", "aradhana598": "Bold and sassy. What you do and wear is your choice. Who you are earns you my respect. Keep up :)", "kushala_r": "You go girl!!🔥", "stay_poetic": "Damn🔥", "ayeshakalita": "No matter what I love you 😚❤ And you are best in your way 💕", "kadashi_hamada": "Yasss girl", "rhea.128": "😘😘", "medha__k": "Yes please louder 💯💯💯 , for all the people in back 🙄", "gauraangis": "wholesome post 😍🔥🔥🔥", "urbashibhattacharya": "😍💕", "adalinevijay": "Caption 💥nailed it 💯 perfect portrayal 🔥", "aashika_vinod": "This is amazing🔥🔥♥️♥️", "diveasarin": "I wish I have more women support ing me..I'm a plus size model", "prachimanglaa": "👏🏻👏🏻👏🏻", "ssi1d9": "You are awesome👍👍", "bhoomi.sorathiya": "There. You said it. Power to you Komal. Lots of love ❤️", "neha23099": "Love your positivity @komalpandeyofficial go girl ruin the world", "shusmita_23_08": "i love youuuu😭😭😭😭😭😍😍😍😍😍", "lemonfervstart": "@vanillawallah loving this video and the caption", "_nimishabhardwaj_": "Yaas queen @komalpandeyofficial rightly said ❤️", "_.kajalsharma._": "Vo SB toh thik h.... Par thand hori h", "poyamsharma": "Caption🙌 and you🤗💗", "manyya._": "😍😍😍🔥🔥🔥", "harshitat07": "You are Real and people get jealous of your reality 🔥", "simba6512": "👍👍👍👍👍", "seema_oad___": "You Bang girl🥰", "arimitachakravarti": "Proud of you❤️ keep inspiring like this always @komalpandeyofficial", "karmakarbratati": "❤️", "harshita.tiwari__": "Thanks for raising the temperature in such a cold weather😉❤", "lisamishramusic\nVerified": "Verified", "arorasweta11": "💙😍💙", "smriti9264": "👏🙌🙌🙌", "akash_srivastav___": "👌😎", "mamta1210": "Caption❤️❤️❤️ more power to you😘", "nac1311": "Oodles of respect!.... Glad you said the word 'CHOICE', I guess more nd more ppl are forgetting this these days.... @komalpandeyofficial kehtein hain na angoor khatte hain 😉, you got it flaunt it!.... More power to you!...", "preetisingh1702": "😍😍💞", "ruthsimithapa": "I thought you are just one fashionista but now I am coming to know you are an intelligent woman as well.... I am a bigger fan of yours now since I am seeing you opinion on the current situation of our country and this caption ohhh... Now I realize why was I following you... You totally justify all the awards you win. You are going very correct...", "yussrawaseem": "Mazey ki lagti hain aap❤", "sejal_rana19": "💕💕💕💕 you're the best", "tavlove_": "Well put!", "prerana__pradeep": "Which brand lingerie is this? @nysh.71k", "s.o.u.l.f.l.o.w.e.r": "Woman ; you're gleaming ! I think we need more voices like you out there and spread the message to be yourself irrespective of your \" flaws \" ( Flaws haha , I don't even think having features which doesn't feed the standard is even a flaw ) ! And you keep on wearing that lingerie . We need to love our body first .", "imjyotivats": "Soooo rightly said😘💖 big love😘💖💖", "overginncoffee": "U r inspiring.❤️❤️", "_.screw.perfect._": "Perfect😍🔥", "thewheatishmermaid": "Very well said. Love you.", "kinjbinge": "Yes you preach gurll! 💯💪", "shwetatripathi06": "So true ...love your caption", "sadiaali_66": "@zeeshansalim read the caption", "itsme_akriti": "You are just so right why the hell the people judging anyone on their clothes and I am with u 😘😘👌😍", "sethiroopali_": "LOVE YOUR VIBE! 🔥💖", "aarti_shukla30": "U look stunning babes 😍 nd u r doing fantastic , plz keep going ...", "recharging128": "You go girl 💗💪", "kree.0313": "🙌👏❤️", "komall_1102": "♥️😍❤️true words❣️💪", "aradhnaofficial": "You Go Girl🔥🔥", "poonambhimte": "Agreed...be the change you want to see in the world!😘", "anjee_baliyan": "🥰 amazing 👌", "_half_blush_": "😍😍😍🔥 queen ...more power to you inspiration💓", "gandhidhaarna": "Well said!!!!!!! Proud of you ♥️", "just.winnie_": "More power to you!! 😊🙌", "saniya_goyal896": "More power to you🔥", "prachigupta2409": "Flaunt the curves you have why to waste under clothes and when you age are only number.", "a_midsummer_nights_dream_25": "You are a true body positivity inspiration and I am saying this hailing from the curvy squad❤️love you work and you as a human🙄keep up the good work😍", "mpoojashetty_12": "❤️❤️❤️❤️", "athiraa_raj": "DAAAAAAMN. 😍 So proud ✊💞", "dr.aksdeep_kaur_waraich": "👏👏👏👏", "kavitasangma": "You need to justify yourself babe... or else just ask them “why you do you always butt into people’s life?” Haters gonna hate eh.. You the right to live your life your way .", "angelash0709": "🔥🔥🔥", "ruchika_xena": "Yes yes and a 100 n 10000999 yesssss to that caption", "anxhita.5": "Damn this caption🔥😍 keep continuing with your work because we know you work very hard for getting up each outfit and I loved the way u said it's normal showing your skin because after all it's your choice !❤️", "_.reeva": "Girl you rock😍😍❤️❤️", "_justavintagesoul": "❤️❤️❤️❤️", "aavika_d": "Wish I had your confidence! 👏🔥❤️", "lpraveenfame": "😂😂", "ravishingtwinkle": "Choice is the key. Understand someone else's can be different than yours and respect it. I love this message that you have beautifully written. Thank you 🔥", "miss_fams_7": "I love youuuu❤️❤️❤️❤️❤️❤️ you are right!!!!!", "sunayana_b12": "💕💕💕", "_._feline_._": "DIVAAAAA....😘", "suzansequeira_": "Yass Queen😍🙌", "shaurya__": "I just wish I had half of the confidence you have to go out and wear whatever you feel like wearing and be so unapologetic about it. I feel the backlash from the people esp women is because you are so confident in flaunting your body without an inkling of insecurity. Not all of them are able to accept this fact and they try to demean you and so many women out there just to gratify their egoes. Because they feel a WOMAN should never feel good about herself and her body, that's the kind of rhetoric our society has planted in their minds. More power to you❤️", "bitterllysweet": "You know what I hate cold weather .. 😁", "cvbaybee": "@arrchstiny 😭😍", "bishista_": "In love with you! 💕💕😘😘", "_life__is__beautiful_with": "🔥🔥🔥🔥 correct", "mishika4342": "Where did you get this lingerie from ? I love it", "shikhawildin": "U slay girl🔥", "akshiram2911": "👌👌"}