{"_an8gel": "@chaitanya_avatapalli", "aanchalgoell": "As much I watch u, I love u more n more. U r an true inspiration.. I m in love with u. U r my lady love 😘", "__divzzzzz": "Where did you get the florals frommm??🥺", "kirti.ss": "Style queen Every time u create magic 🔥🔥🔥", "namratashruti": "Which song is this?", "javairia.asif": "Song name please", "sony.dubey.9803": "Last one has took my heart❤️❤️❤️", "tuzo.pandey": "Ufffffffffff ❤️❤️❤️❤️", "malveen_b": "@komalpandeyofficial where is the first outfit on the right from ? With leather top and black skirt ?", "aalvisrivastava": "Thanks @komalpandeyofficial ❤️", "umeedseva": "@komalpandeyofficial the brown outfits are from? Actually all the outfits are <3", "naira_sareen12": "I love i love I love your black skirt. Will you please share the details of it . So that I can try to be little bit fashion QUEEN like you 👸🏻 💕", "shailishailja5": "From where you get such classy bags... U r fab😍", "hardika1010": "Hi Komal! You’re beyond amazing😍.. could you please tell me where’s the diamond choker from? Which you’re wearing on black outfit", "asterialinc": "That brown monochrome!", "anni_massey": "Every time repeat 😕", "rushali_d": "Oh my.. i love your floral outfit.. is it a mismatch? Or a set... please mention where did you get it from", "friesninja": "I LOVE THE MUSIC IN ALL YOUR VIDEOS", "sashaaness": "Love your hairrr ugh", "reena.rajan": "The playful print was cuteeee on you 💖💖💖💖", "lipsticks.and.lunges": "You have amazing taste in music ! As in clothes 😍", "richebajaj": "Tutorial on wearing that HM shrug as a skirt pls❤️", "spirited_gal": "Where the playful print outfit from 😍", "iaamabhiarwl": "Which song is this, can anyone please help.", "umangshandilya": "You have come such long way ❤️ more power to you girl keep going 🙏🏻", "siddhi_neema": "-sl9--", "mnainesh63": "😍", "saisunil4_luv": "Why only Videshi song?Try some Desi ones too @komalpandeyofficial 😂🙏😘", "samreenkidwai": "Where can I get the floral print dress?", "flying.unicorn01": "Loved the last look😍", "chandrika_i": "Komal why dont u smile in ur videos u have such a pretty smile😍😍", "agarwalishani": "@_propah_lady_ can you wear that second outfit i mean will it stay there 🤣", "shaina.halley": "You're an amazing person ❤️❤️😭😭😭", "deepikaisme": "Pls link where all the crop tops are from!!!!!! 🙏🏻🙏🏻🙏🏻😍😍😍😍😍❤️", "radiaahmedofficial": "Loved it @komalpandeyofficial 👏❤️ the outfits ideas are chic 💖and top notch!", "mrudulakashyup": "@komalpandeyofficial I love the way you carry yourself. It really need a lot of guts these days. People actually underestimate it. Love you😘😘", "mahi_milkhe": "What!! Komal in side partition 🙌 you are slaying afcource !", "ananyaabakshii_": "Wowww", "pranjal_ranga": "I don't know but I just keep looking at ur style😙", "__p.u.r.i.t.y__": "Your fashion is very high class..a normal girl like us can't afford to wear such high prices clothes on a daily basis...u should make a clothing video for us so that we could relate to it more because as of now your clothes are like a showpiece to us..we can watch ur video but it's of no use for us!!", "thepugmumma": "So funny", "jaya_janu07": "Mam will you please make video on indowestern wear as per trend which we can wear on our causal meet Or some fashion show event", "thegobbleupcrunch": "Queen😍", "_runaway_g": "How about going sustainable fashion look for next video?", "shandilsmriti": "Y u so fake", "_____preetyshine_____": "Wow @komalpandeyofficial 💋✨LOVE YOU LOTSSS💗💋💋", "jeny_chs": "I just love those brown outfits so much! Most of my closet is black/grey/white and I always struggle. I loveeeed this video, I got some amazing ideas and I love the answers she has given to some girls. We all feel insecure at times, this is inspiring", "rasheen.55": "Gorgeous", "akshitadahiyaa": "Gosh I'm in love with your style komal😭❤️", "netrajainn": "I mean for", "mrs.gyawali": "@siddharth93batra did u encourage her to reply every comment?", "mmaichung": "😂", "ranjanasingh0902": "Just love loved the 3rd outfit 😍😍 u r killing it all ❤️", "niharikasareen": "What song is this 😅", "sanjay.singh019": "Didi....aapki heels badi hai size me", "_radhikasharmaa_": "I. LOOOOOOVEEEEEEEEEEEEE. EVERY. SINGLE. ONE. OF. THESE. LOOKS!!!!! 💜 Also, Love how you mix prints so well! 💜", "fffatemaa": "The way you're grooving is so much fun to watchhhhh... Loveeeeeee all the outfits ❤️🔥🔥", "shreya_._._99": "😍😍😍", "maithilis7886": "Style Queen💖💖", "priyasingh9933": "Apart from ur Attire..i love the way you dance like a free beautiful bird😘💞😍🔥", "anshikakhanna8": "Luv ur style 💕", "shilpi.shrivastava.127": "Komal make some other videos like where u r taking to us ,singing and something like how we can keep our self healthy and fit", "yas.dds": "Black jacket/blazer fro", "muskan.karnawat": "Poo vibes 😍✨", "garima_1306": "@komalpandeyofficial you have redefined hotness...keep rockn😊😊", "_.abha_joshi._": "That last outfit!😍❤ Well actually....all of 'em!❤❤ Favourite video of mine too....❤", "bhavyaesther": "@suryainamdar 😂😂😂", "theshimmerchic": "You look 💯 everywhere", "erinasingha": "Monotonous...plzz do somethng different", "who_whhat_wear": "😍😍😍😍", "asmitabiswas.official": "Hey komal, i read all your stories and I just want to say you that you have a great fashion sense. There are even so many fashion influencer who are actually getting influenced by you. Your contents are so creative. But it's just that it's not always possible to follow them, not because of showing skin but because of caring them. I am a very jalli type girl who loves to stick to comfort. I think there are many who will agree with me why it's not always relatable. Please make a video for the jalli girls like us so that we can relate. And again, You are super talented and your content is not shallow ! Lots of love from a big fan of yours ❤", "shikha_nehra": "Your videos are always inspiring wid so damn interesting concept and ideas. Can you please tell from where you got that floral print skirt and that top in this video", "hannahjackson1100": "Man that white monochrome look is sooo pooh look ❤️❤️❤️❤️❤️❤️❤️❤️❤️😍😍😍😍😍😍😍", "foodfunlaugh20": "Idiot komal get lost the writer was right", "salonijain.13": "The way you used to style is amazing💕😍 and the attitude you carry for the look is really beaut bonza 😘", "priyaguptashines": "You are awesome @komalpandeyofficial 🙌", "_ayeshu_kazi": "Loved the outfits 😘🔥", "iamnavikaur": "❤️❤️❤️❤️❤️❤️❤️❤️", "___.lily.u__": "The last outfit 😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤", "seerat_anjay": "@archanasinha682 your monochrome and this monochrome😋", "_rimzimm_": "Sabke pass itne paise nhi hai..... Hum kaise afford kare itte uuchh level waale kapre... 😔.... Kuch medium class logo ke liye bhi banao", "dkar538": "I want to see a monochrome look with kurti/salwar please, komal🔥💓", "soumyaa_srinivasan": "Love you 🤍🌻🤭🖤", "tomer.anshu": "U r such an amazing fashion icon", "artisharma2604": "😍😍😍😍👌", "adrianna.345": "Same thing again and again, bralette with pants or under the blazer. Blazer on top of blazer. Getting boring now.", "asthaa_srivastava": "@komalpandeyofficial didi wo sab kapde batao na jo aam ladkiya (regular girls) jaa sake bahar pehen ke...", "seemu1985": "@rakhi2610", "priyanksahota": "Yar seriously mujhe kaafi bure lage sare", "fashionforroyals\nVerified": "Verified", "arashnandan": "That printed one is awesome🔥❤️❤️", "ashwarya.inda": "Girl u have clearly uped ur game👏👏ur", "makeupbyabbani": "Literally the definition of perfection. Absolutely loved it!!!😍😍😍💓", "ravithedeshmukh": "Is that long skirt of @kushakapila 😂😝", "oshinpatwa": "❤️", "sgdelhi": "Fashion at the best level 👌", "sonakshi661": "Komal looks funny with those movies.. Pagal", "usernameitlater": "OMG this is really gooooood. 😍", "shrutika.chand": "Oh I love the side partition on you 😍", "iam_ramankaur": "Loved it ❤️❤️❤️", "mousumi1435": "You are so beautiful😍😍😍", "ss_3172": "🔥🔥❤️❤️❤️nice video, where did you buy these white pants from?? Keep it up...", "mrs_ssharma": "@komalpandeyofficial i really appreciate the videos and the fashion but i guess you should put the videos which girls can follow on everyday life.. and also not on just tubes.. i know your boobs are small and it looks good on those clothes but think about those girls who has big boobs.. u being a blogger should make the style which every girls can pick up. i live in western country amd i cant accept some of your style think about the girls who travel in train metro and auto everyday. make some sensible fashionwear which everyone can accept.", "ishhthetic": "Which song??", "sketches_art_drawings": "Adorable ❤️", "stylingmyfluers": "I'm loving this video 💞💞💞 all looks are AWESOME ❤️❤️", "dikshasingh46": "You looked way better when in @popxodaily 😔", "_aakanksha5": "The whole and white in shining armour = sooo much of poo frok k3g 😍😍♥️♥️", "paraparaparadise._": "So sundar omg I cri.", "poshita_10": "Hey! You're absolutely gorgeous and omg you look so pretty in those outfits but i feel they're not all very practical like you know one can't really wear a bralette under a blazer for office Or a formal look. Could you please make something that one can wear casually in a formal look? Sending loads of love your way 🤗", "trendelitee": "Best so farrrr 💘💘", "the_zeniieelove": "Komal I consider u as a style god and also a genie😭 how well u fulfill my wishes even without knowing it😘😘", "__zaarraa__": "💕💕💕", "___alisha__singh__": "Last one😍", "pulkita.shrivas": "Sometimes .. my bf is jealous!! Bcz when i am with him i talk about you more .. komal pandey jse ear rings cahhye.. i love komal pandey .. nd bla bla bla 😜😁", "apoorvaverma10": "Please do mention your outfits details💗😍", "amisha_tyagi": "Love love playful print😍😍😍😍😍", "kritika2591prasad": "Hey Komal, a silent follower and fan! Your outfits are goals! Could you please also mention the outfir details so that we can lay our hands on it too!! Also, do post videos on how curvy girls can rock long dresses w/o layering.", "kranti.deosthale": "Uh are so pretty komal...I jst want to know why uh post these kinda looks only.. actually these looks can not be incorporated by maximum girlss..can uh plz post some looks which Maximum indian girl can adapt...💖❤️❤️😘😘😘😘", "roy_officialbeardman": "Style koi inse seekhe", "_shikhar_rawat_": "😍❤️❤️demure❤️❤️", "my.food.fairytales": "💛", "zobiaqueen19": "I hate her soo much attitude 😡😡😡😡", "akku1009": "you have creative mind👏👏 that's amazing... u are wearing ur floral print shrug as a shirt .. 👌👌 😘", "deepika_abeamoflite": "Nd the way u flaunt is totally wonderful💥💥💥", "rainbowonawaffle": "Wow ..love all the looks💙💙", "_sakshii____": "Effortlessly gorgeous queen 💃💃💃💃💃💃💃💃💃💃💃💃", "additttti": "Why don't you go to international fashion events? I'm goddamn sure you'll make India proud. You know what, your creativity is something that we all people love you to the moon and back! Keep slaying babe💖", "shivanithapliyal": "Which song?", "sakshi_singh_3012": "Such a great treat to watch this amazing stuff😍😍.......Its just wooooowwww.......You're always awesome😙......lots of love komal❤️", "maitreyi.dhatrak": "Can you do a casual day look", "shubhk190": "Queen👑👑", "sadia_raisaa": "Hi komal, I love all the videos that you make its so creative and helpful for us. You are such an inspiration for everyone and I am telling you I m not even exaggerating- Since the time I started watching your videos I feel less insecure for myself. Please keep up the good work ❤️ you deserve all the best things in life. Also, please do some contents for college/university going girls like skincare,makeup and outfit ideas too. Love you ❤️❤️Best wishes from 🇺🇸", "deepika_gupta_": "You slay everytime and everywhere🔥🔥 last outfit🔥🔥..summer comee sooonnn naaaa", "niharika_singh2604": "Where did u get ur black belt from in the first look... It's awesome n rare", "zainabfatima_p": "⭐", "aakriti_aggsk": "Loved it !! From where did you get the printed one ?", "poojaemoorthy": "@malvikasitlaniofficial mals basically Komals stuff is like forever 21 h n m Zara mango accessories be like f21, Charles and Keith it’s that Komal is a born fashionista jus like u born as makeup guru there u go my gurls btw mals u dress super cute tooo... our Komal is Indian Kendal 💗", "shivangikalakoti": "Loved it😍😍😍", "ri_sh05": "Oh my god komal, all those outfits are lit and especially its your confidence that you carry with all your outfits that makes them even more awesome... Love what you are doing... You, your content and everything- its just so pure, fresh and always new... Love you a lot...!!! Wish you achieve 1 M soon ...!!! 😘😘😘", "_sahnipratyush_": "That's the best thing I saw all eay tbh😍🤤 @komalpandeyofficial", "shfzizzle": "Oh yum ❤️", "cutest_psyche": "U always slay girl😘", "vaishnavi_belkhode": "Every outfit fits you so perfectly 🥰", "purvinderkour01": "My fav episode 😍😍 and that side partition 🔥 honestly u slaying it in white ❤️", "im_rajanluthra": "Tere husaan di ki main sift kra di krda dil tnu mein gift kra😍😍😍", "sujata_uniyal": "i really love ur out fit 💞💞💞", "rateebahree": "Youuuuuu my god. MYGOD!? Can you not just??💛💗🔥", "ltaki19": "U are so talented komal... we can really see how much effort u put into this videos. I hav been following u for ages... n everytime u upld a new video m amazed. Ur style sense mind blowing... i wish u more success in cmng yrs... ☺️", "drivya_shettyyy": "You always just perfect all the time... 💞 I really want to know the lipstick brand that you use more frequently. ☺", "pragyatrikha": "please make a video on tips for wearing high heels on regular basis... or like wearing heels for work tips", "dutta3357": "U r so so perfect di💕💕😘", "be.floret": "Hey Komal.. i am so inspired by you.. the way you have shaped your life, your work, your career.. I admire it the most.. I always wanted to be like this.. and of course your creativity and honesty in fashion is on next level girl... Big hug and much love ♥️", "farinhimu": "My fav is the slit floral skirt... Just wow 😍😍😘", "ge.eta813": "Omgggg how talented you are😍 I mean thank God, you didn't pursue CA. The fashion world needs You😍 I LOVE YOU SO MUCH❤️ @komalpandeyofficial ❤️", "its_shinam_": "Omg...my eyes gonna come out..U look amazing", "rataratty": "Love it ! But it would be great if u could list ur clothing too ☺️ also hope u could u make one on like college wear which is like fashionable but we don’t get dress coded lol", "khadijalakdawala25": "❤️killing it", "tripti_pearl": "Why you dance like monkey", "mansiie2": "You slay in the brown monochrome❤️", "manognaa_": "Can't get my eyes off you.... You're an epitome of grace💓", "sangen24": "Komal rocks....", "_alisha180_": "can’t take my eyes off this human.@komalpandeyofficial ♥️", "riyakkapoor": "Sheer love! ❤️", "a.mango_girl": "From where to get that last co-ord set?? 😍😍😍", "akritikapurr": "DAMN, JUST BEAUTIFUL♥️ Really loved all of those!", "mumma.first.luv": "Hey hotty?", "0mpriya": "Black& printed one were the bestttttt😍😍", "love.mrunirudh.love": "Black and printed ones were bestttt😍", "i__salonisingh": "❤️", "silvershades_188": "Big fan🙋💋", "radhika_2419": "Please tell me from where did you get the pleated skirt @komalpandeyofficial ♥️", "__nandzz__": "That side partition 🔥", "_nistha_04": "Oh maaaa😫! That Side part🥺", "ishitavasoya": "Oh my god! This is insane!!!!! I'm in love❤️😭 can you do a video on every types of pants/jeans every girl should own, including different colors of pants.. need it❤️❤️❤️❤️❤️❤️", "nava_ibrahim": "That side partition lookin' good on you😍", "_mitushijain": "Your confidence reflects your acceptance to how you are and eventually teaches self love. 💕", "sandhu3332018": "Can you please tell from where did you get those 2 bags in second look???", "muskannnnn.s": "The content is justt priceless ✨❤️", "likki_santoshi": "Not being rude.....but honestly best one in recent times...loved it😘😍", "audreeja": "You are an inspiration! ❤️Love you", "vaibhavi__mehta": "You're casting poo vibes in the total white outfit🤩🤩😍😍😍loved each part of the video", "shivanienazare": "@meryl.vas @crackedup_tilve @masala_marke pls enjoy", "swastika.dwivedi.90": "Your outfit is on fleek girl plsssss reply Love from varanasi", "oviyaaa._12": "OMG missed that dance!And oh missed you too❤❤🌈", "aksapatel": "Love how you can transform one clothing item into different forms😍❤️", "jasminemukherjee": "Also, I love monochromatic looks so this video is perfect for me ❤️❤️", "iam_shipratyagi": "Kindly create looks for normal office going people because these things can't be worn in office create some formal look with a little twist specially the covered one which is great for office..", "riyaa3534": "@komalpandeyofficial I love you....like seriously youare such a inspiration......your content is lit🔥 you are on fire girl❤️❤️❤️", "uptothestyle": "You can Slay in Everything ❤️ You are an inspirational ❤️", "citygirlpriyanka": "🙌🙌🔥", "aleeenarajan": "You're so damn creative 😍😍😍 You kill it everytime man! 🔥🔥🔥❤️😍", "curlsandfrills": "Always look forward to ur fashion therapy videos.... love them ❤️", "varsh_ni": "😍 you are gorgeous in every color your wear! Your videos always help me in times where I feel insecure about my body. I love the way you inspire people. Loads of love ♥️ 😍", "_inayatgrewal": "Hey sweetheart how tall are u??", "domanishoes": "❤️😍", "kriti_dugar": "Can you please put details of where your outfits are from? 🙌", "dollylalwaniblog": "The best😍🔥🔥🔥🔥", "praptiiacharyaa": "Obsessing over your talent! You're fire🔥❤️", "_binge_eater_": "So relaxing to just watch you be so creative😍😍❤️❤️ amazing work n format", "swatisharma70500": "The only diva @komalpandeyofficial ❤", "pooja_travelbug": "Song name anyone?", "swanky_aarti": "Please tell me from where did u get the last outfit? It’s so beautiful and pretty", "pawalichakrabarty": "It is so hard to be a straight girl now-a-days. Damn woman I'm in love 😍😍😍😍😍😍", "anushikhavishwakarma": "lovely di...u always rock in every outfit...♥️💋💋💋😘😘😘😘 luv u a lot... @komalpandeyofficial", "shireenk347": "Komal how do you pull it off all the time??? I mean how? Such an inspiration!! Sending ALOt of love bby🤷🏻‍", "_poornima_natesan_": "I have to tell this!! You're a living legend!!, You're passion and love for your work is amazing!! And I become so relaxed and stress free just by seeing you! BIG HUG❤️", "nikita98singh": "Which song is used in the video!?😭😻😻😻 Love you and the whole look😻", "mahima.saraswat_": "Which song is in the vedio", "the_archaic_muse": "Absolutely love this ♥️💕😘", "anonymous_xyz._": "Such a goddess you're mam❤️ iloveyou🌍", "saracastic1429": "Okay so last one was the best of all😍❤️and the best part in you and your outfits is you❣love you and your content😘❤", "shreya.naskar": "Dayum💯🔥", "_hawahawai_": "QUEEEEEEEEENNNNNNNN 👑", "sassy_shivangi": "Loved the outfits😍", "rafiso_done": "Fashion feels like so much fun when you dance your videos hun 💕", "thetilthead": "HOW IS THIS NOT VIRAL YET??? ITS AMAZING ❤️", "vaginismus_aid": "😍😍😍😍😍", "rimi_solium": "Omg...this video made my teatime lit🔥", "anisamaity": "Wooohooooo. U r Killin it... It's wonderful 👏💜💯💛😚⚡👌✌️✨😘😘😘💘💥⭐", "shreyasmakeupandhair": "❤️", "rana.elena": "O my god you used your shrug as a skirt for your third look and I'm flipping❤️", "kompalmohindra": "❤️❤️❤️❤️❤️❤️", "_shruti_xx_": "AMAZING gal 🙈💓💞😍", "paneerbuttermassala": "You look like poo in the white wale ka second option (phat- pretty,hot and tempting)", "felicia__fernandes": "woahh😻", "_sam_._sung_": "Loved this one", "mamata2821": "Hey komal u look as usual pretty... Can u make some fashion videos for curvy girls....", "ashimaz.21singh": "You look stunning in everything u do 😍", "diya_rajkarnikar": "You’re unbelievable🔥😍", "vaishnavipvasista": "U r a mood, a sweet one 😍😘 @komalpandeyofficial", "thedeepapuri": "That last outfit is Ur printed shrug right. I remember u wearing it and of course Ur closet tour..💞💞..how creative u are.. just lov it🤗 just think how big fan I am💕 .", "isha_dhillon": "@kuganesh the white, brown and print 😍😍", "penaazvalecha": "Mesmerising! What a lovely new hairstyle as well! And the last outfit looks IMMENSELY Gorgeous!! ❤️❤️❤️ Shine on, girl! ✨", "suchitha__": "Damn hot 🔥", "dagaradhika1607": "Love your content ❣️ But I've got thick thighs and I feel like I cannot pull off skirts very easily. Could you please make some content on that too? Thanks 💋", "namreet__kaur": "I just love ur work and Keep up what u r doing .... Ur videos just make my day ❇️❇️", "sangwan_ankita_": "I had no idea that floral prints can also be a part of monochrome outfits. You definitely look like a queen in all those monochrome outfits. @komalpandeyofficial ❤️❤️❤️❤️❤️❤️❤️❤️", "aishwarya1995.25singh": "I would really love to see you wearing some other shades of lipstick for a change....😊", "tiya_shydoll21": "Last one😍😍 plz share the details...", "the_sea_shore_": "I just love the all outfits and the way how you present it. Oh my gosh fell in love with you. I Love You 💖", "14.niharika": "That printed dressssss 😭😭😭♥️♥️", "anishadolai": "From a shrug to a skirt? 😳 dude you are seriously a queen.. Virtual hugs ❤️", "mahimasingh__": "Queennnn💕💕", "shivanisingh1116": "I love it, you are really really amazing @komalpandeyofficial 😘 I love you❤️", "_pratishtha.kaushik_": "Yhaaaaaassss kweeeeennn 🔥❤️ ilysm!", "sania.here": "#girlcrush🔥", "limainla_jamir": "Love the print outfit 🔥you look amazing in all the outfits 🔥keep slaying girl💕. Big love ❤️@komalpandeyofficial", "that_hippie_gal": "Queen ❤️❤️", "sree__lakshmi___suresh": "OMG 😍😍😍 I am in love 😍😍❤️", "riyamodha": "Wow 👌😍", "bishtpinky": "Loved it ❤️ @komalpandeyofficial", "prerna.chaudhary132": "Amazing video.. Love u komal.. U r adorable.. May u b blessed with happiness that u can't handle..n may b a person who totally understands u n doesn't give up on u..stays no matter what.!! ❤️❤️❤️", "mer_lin3": "All the outfits and you dancing spiced it up ...Damee your on fire🔥💓 love it.", "sristy_sunuwar_kiraty": "😍😍😍", "deveshi.singh": "Waah!! @komalpandeyofficial mazaaa aa gya!!", "rashikashish": "Love for these ❤️", "imsarbani": "Hey komal, I adore you & your work.. Plz continue to inspire thousands of people like you always do! 💓💓💓can you mention the outfit details for people like me 😂😂🙌🙌", "dj_2107_": "Stunning u r my fashion queer.. i love the way u carry urself😘♥️", "raghvi_b": "Where did you get that printed skirt from?", "the_dopefactor": "Which song is playing in the background?? 😍", "nainatamta": "Ouch!!!! My eyes hurt by so much of gorgeous-ness💕", "iam_maddy026": "Something's so Rachel about the looks. 🤗", "kriti_katyal": "Every look was peefect but white one was my favourite 😍u killed it❤️", "_enchantresssss20": "Oh good god😍 you are just si AmaZING i live you queen😍❤️ did you just used your shrug as a skirt?!!💞 You’re a living art i crave everydy ,ladyloveeeee❤️❤️❤️❤️ these outfits are just amazing and your confidence!ufff,got me goosebumpss🙈🙈🙈🙈", "shiwi27_": "Dude don't mind but your style is nearly impossible to replicate for us and it's not wearable nd ik you say it's experimental fashion but lemme tell you nobody wears a tube top or brallete in winters but you look fab in them but for us it's just the thing that we can watch on gram !!!", "sakshioberoi": "You are by far the best style icon I have come across.. each style has some fun in it! It would really help if you also shared the brands or the stores of the outfits you wear in your videos... Keep rocking girl ♥️", "__aparnajayakrishnan__": "Wowww loveee youuuu dearr!!😍😍💕💕❤️❤️❤️🔥🔥🔥", "bismita____": "Before buying any clothing items I know where to check out for inspiration.😍😍", "priyam_81299": "Last look🔥🔥komal rocks❤😌", "swt_rukhsar": "You are looking Drop Dead Gorgeous In The Printed outfit 😍😍😍", "yukti_thakar": "The white on the right side gave poo vibes❤️", "trishafying_life": "Woww! This for sure is my favv video of yours for now! The content.. the bubbliness of the video.. I always found it confusing to go monochrome! Thanks to youuu now I can take inspiration from this yayy! 🤩🥰✨", "_masti.holic.girl_": "Heyy komal u are so damn awesome and ur therapy are seriously my rescue..bestestttt fashion blogger and sweetest person on earth❤️..😘", "_zainab_jari": "You are an inspiration komal❤️", "shobha_k7": "Pls give me ur all clothes 😘😍😍 best collection you have ..love ur every posts 😍😍😍 and why so beautiful ❤️ @komalpandeyofficial", "rumela27": "@komalpandeyofficial You are damn creative and innovative 👍..Keep it up 🙌", "khyatisaxena": "Queeeeennn 👸🏻", "___jonjo____": "😘", "nehaadang": "Loved the printed one 😍", "kanikasharma9": "Gorgeous🔥🔥", "trishajain21": "U look so good in side parting😍", "yashoda_dutt": "Loved it❤️", "_mandeep_k_": "Perfect ❤️", "sahiba.ansari": "@01_rupal_joshi 😍", "karishma__barbole": "You look fab in all styles.. 😍😘❤❤", "beobsessed.86": "Girl u kill it always ...💕💕💕", "illustrationswkhushi": "OMG IM OBSESSED WITH YOUR STYLE LIKE WOW?", "vaishnasupra": "😍😍😍 I enjoy watching your styling videos so much !", "priya.8036": "Oh my God!!! You look stunning yaar. How can you be so awesome always. Loads of love and power and support ❤️💞", "sreetama_chatterjee": "And also I want to learn drapes from you....I mean how do wear that shrug like a skirt??I could never😭😭", "jhanvib_": "It was fabbb😍", "daljeetkaur74": "Hey di how are you? Your work is amazingly fantastically but all i want to know from you that are you doing good? How is your health? 😊", "resham.makkar": "Wowwwwww!!! Huge crush on u @komalpandeyofficial luvd all ur fashion therapy videos. Also dying to see u in bridal lehenga.. 😘😘😍😍 luv u alot", "rachana4644": "The white one was absolute favourite...👏🏻🔥 u really creative n I absolutely love and adore you for ur passion for fashion😊👏🏻👏🏻", "bindavnaik_official": "You are amazing 😍😍♥️♥️🔥 @komalpandeyofficial", "neaamath": "What the brooo! 👌🏽", "sapna_sueno": "Pooohh", "ankitbatham869": "Wow 😍", "laybackss_": "Amazing gurll💓💓💓💓", "___ry19___": "When it comes to online shopping i end up getting clothes which doesnt look good on me, i want my wardrobe to be interesting. How should i work on it.", "parth_1708": "Lovely..💕", "esha_ag": "Damn you’re the best!", "kiddoo_62": "🔥🔥", "neha_mokal": "Love this! 😍 And I've observed, you use the same song used in the video prior posting it in your stories. That's a hint for us 😉🌼", "palak_pyl": "OMG.. Ur fashion nd ur way of style just.. Out standing.. No one can ever be stylist like u", "_the_goldilocks_": "U really are a talented fashion being. I like how u put everything together so perfectly. Ur feeds really helps me to understand fashion better. Lots of love from Northeastern girl here.❤️", "ayushirichhariya": "Crushing over you so hard! 🤩🤩♥️", "theworldofblend": "Follow me for some amazing makeup ideas!❤️", "_gunjananand__": "OOOOOHHHHHH MYYYYYYY GODDDDD🥺❤️ I get short on words every freakinn time I see anything coming from you😭❤️ TRUST ME MAM YOU MAKE ONE OF THE BEST CONTENTS OF ALL THE TIMEEEEE😩❤️✨✨ I love you and your work✨❤️ @komalpandeyofficial", "ciggy_addicted": "That white pant look is giving me poo ( kareena ) vibes from k3g ...🤩@komalpandeyofficial ,nailed all the looks", "theslayinsoul_": "Damnnnn most favourite🔥🔥🔥🔥 o mean you kill it gurllllll💯 goddess🤗", "dormant_volcano_": "She used a shrug as a skirt!!!!🔥🔥🔥Damnnnn Girl... You are lit❤️😘", "bellezon_india": "Beautiful😍💓.. Do check our page for some stunning jewelry collection 😊", "dear_tahia": "playfull with print❤️❤️❤️❤️❤️❤️❤️❤️", "bonita_sweedal": "Omg stunning 😭😭💘... you ARE and will ALWAYS be my inspiration❤️❤️ Its because of you that I've fallen in love with fashion. Whenever someone compliments me about my dressing sense, I always remember you. Thanks for that. Love you loads ❤️❤️", "rids_95": "GOALS🔥❣️", "im__supergirl": "That white outfit is luub ♥... Your skin is flawless not just on the face .what is your body skin care routine komal..", "prity.ghosh": "Waaaowwwwwww🤩🤩😍😍❤️❤️❤️", "bhavdeepnama": "Goddess 😍", "yashikagurung": "You’re art, darling❤️🌹 Don’t ever forget that 🌻", "things.you.luv": "Pls tell me where are those snake print boots 💗", "imnandiniroy": "Playful in prints ❤️❤️❤️", "rd_neel_18": "Airport looks please 😎", "anikaa.d__": "youre a beauttttttt", "richa1406": "How you use your shrug as a skirt 😍?", "heenabagal200": "Imma a fan❤️❤️❤️❤️", "anjana3872": "Ohh God looking so gorgeous 🔥🔥❤️love from Mumbai 😍😍", "dhwani_jalan": "Honest question... don’t you feel cold... 🥶", "diyanahphoolwani28": "DAMNNN! Love ya so much Komal!!!💋😍", "nazeef_writes": "Wow wow wow.", "sanchitabhartiya": "I sat back and relaxed..just when I was considering reconditioning my wardrobe I got hold of your profile where you show us to use one piece of clothing in a fresh way everytime..this is the kind of ingenuity we look for!! Kudos🤩", "___shreya0103___": "You are amazing💕💕😘😘", "_.soumyasamrita._": "You're a star komal ! An absolute bomb!🔥🔥💋💋", "sunayra.s": "I admire you so much! The effort you put into your work and the passion you have for fashion is outstanding. Being a 16 year old entrepreneur I truly have to give you some credit for giving me the inspiration to start my own clothing line. insha'Allah someday I'll see you wearing my own brand clothes. Thank you for being who you are.", "___missy____": "Dear Komal.. You'll be my favrt forever. Ur way styling is just beyond awesome.. It's not that I'm Comparing yu wid others. Yu r just da way yu r nd tht what we all love about u. Thanku a bunch for such amazing fashion ❤️❤️❤️❤️", "__shrutikhandelwal_": "Babe that floral on floral print outfit is so litt🔥😍😍 you look so beautiful 😍🔥ily @komalpandeyofficial", "wanttobeaduckkie": "@happymess_aarushi something inspired from her 😍", "swapnatelang30": "Loved it !!! You are just amazing @komalpandeyofficial ❤️❤️❤️❤️ Can u please tell me where you got the skirt from ??", "nerdyheels": "I get sooo excited when you post🔥🔥, and I especially loved the last look!!", "iishita_roy": "Yay awesome! Thanks for posting this.", "6073shine": "Miss d old komal Pandey on popxoxo", "spoilyourbodynow": "😍😍😍😍😍you’re perfect", "d0ashd": "Komal, just wanted to tell u that whenever I see u I feel so inspired. Your journey as an influencer has evolved so much. I just wanted to let u know, that whenever u feel low just think of all those achievements u have done in a very short span of time. More power to u guurrrll!! U r stronger than u think nd this video was just 😍😍👸", "smriti_2010": "@komalpandeyofficial Love your style trying to incorporate it in my routine fashion.", "nivika_08": "I've started loving white because of you😭♥️ this video is just ufff🔥*speechless*", "yukti___arora": "Plz plz a video on workout with deit especially time Slabs most importantly 👏👏", "ohmygodarpita": "QUEEENNNN", "vikrantthombare": "😍😍💝🙈", "beyou2210": "Babe you just wow😍🔥🔥", "rav_beauty": "Love them ALL! 🙌🏻🥰", "thedemurelass": "You're QUEEN is true sense. Love you! 😍❤️", "snehanegi___": "Loving this version of Poo from k3g😍 you are the best di😘😘", "bhavikabothra": "Where did u get this printed pair from?", "the_fashionista_mom": "♥️♥️♥️", "itzmaahlife15": "Mam where u get tha floral outfit..?", "preetikachhotray": "You have a good fashion sense and all these outfits are really a esthetically pleasing. But your outfits are really not meant for day to day wear or even party wear for that matter. In these outfits, nobody can sit stand or even walk with comfort for that matter.", "ada_rajputofficial": "You are the best di ❤️", "siyarai28._": "Your content is just amazing ❤️...I wish I could slay in every look like you ❤️😍😭...Lots of love❤️", "kritigarg1702": "@komalpandeyofficial i loved your white fringed jeans/ trousers. Can u please tell which brand it is from?", "muthumeenakshijay": "Awesome gurl! What creativity... lovely!!! Loved all the outfit.. amazing content.. u go gurl!!! @komalpandeyofficial", "vaishnaviambre3459": "Uh look so good in every chrome color lots of love😍😘", "mansiblogger": "You look so so beautiful in side partition. Trust me😘😘", "girlwhoscribbles": "Your series is the best to watch n relax 😍 so aesthetically pleasing and such queen feels in every look ❤️ @komalpandeyofficial if I feel disorganized or not able to sort things in my head then I watch ur series 😃❤️", "shalakanagboth": "Hats off @komalpandeyofficial 🤩", "barbbidoll9": "🤗🔥", "arunachalakarthik": "Being a musician am being introduced to so many new songs...thanks to your videos. Now everytime I listen to those songs I will automatically relate it you your videos. You will be on the cover of vouge one day. Mark my words!", "anushka_28_6": "Y", "ishalitiwari": "That golden brown skirt has my heart ❤️. Where is it from?", "maitriiiii__": "HEY KOMAL!!! JUST REMEMBER THAT WE ARE ALWAYS WITH YOU. NO MATTER WHAT YOU DO, WE WILL ALWAUS SUPPORT YOU. I KNOW THAT IT IS VERY VERY HARD TO HAVE THIS MUCH CONFIDENCE ON SCREEN. HATERS WILL HATE. BUT PLEASE DONT STOP FOR THAT. THERE ARE PEOPLE WHO LOVES UOU CONFIDENCE, YOU STYLE, YOIR ATTITUDE, YOUR FASHION SENSE. AND YES YOU ARE THE ONLY ONE WHO ENCOURAGES ME TO BE FEARLESS AND HAVE CONFIDENCE ON WHAT YOU REALLY ARE!!!! THANK YOU SO MUCH KOMAL⭐", "_asmita_jain_": "Your last dress💖🌠", "asswarya1111": "Where is your leather belt from?", "_smalltown_gal": "Goddess you are🔥😍", "simransassylife": "love the floral dress the most.. u r sleigh- ing woman..", "mouna_mukherjee": "This is so stunning!", "debalina_nath_official": "Oh my love🖤", "aastha5595": "Omg everytime whenever i have self doubt your videos come and give me sooo much power and encourages me. I love you and your dressing sense . You are my real diva.❤❤❤❤", "iamp_urnima": "Wow! 😱❤️😍", "ashi1680ray": "Di you make my days with your fashion therapy blogs and with your sense of fashion.... Truly blessed to have you as one of the fashion inspiration for fashion designing student like me..... #goodtherapistalways..#keepgoingandkeepslayingalways #lovelove.... Future mein I wish mein ek baar jaruur milun aur app seh kuch sikh paun... #oneofmywish 😅😋😊💕🙏👍😉✊😄", "thefusslady": "GODDESS. PERIOD.", "1ruhanibhambri": "Youuu😍😍 @komalpandeyofficial Can you please tell the last outfit details. That floral skirt and top?", "muzamil._.jamali": "Obsessed with this video .. i just can not stop watching it", "p.o_o.ja": "Made my day", "arpita.th": "The \"playful in print\"🔥🔥🔥🔥😭😭😭😭😍😍", "cheshtabhatia22": "My god!❤️❤️ You look absolutely gorgeous in white. Your creativity and dedication just shows through your videos!🤗", "lipikaxx": "My fashion inspiration ❤🌈", "shireen_ahmed_hussain": "Song name plz", "fallenangel__07": "How?! How are you so gorgeous?! You inspire me so much! Stunning queen🔥", "ta_nya6279": "Getting better and better each day", "main_talli": "Instant crush", "bless_less_soul": "You are a true definition of Beauty & Style!❤️ Lots of love from Kolkata😍😘 The last Printed dress is❤️", "_.prajita._": "A REAL GODDESS😍😍", "shaleen.sarvar": "@komalpandeyofficial really enjoyed this one ! Would be really nice if u mention where the outfits are from ! 💓", "nikethana_vattikunta": "😍😍😍😍😍😍", "_pujaydv": "Omg komal 😍🔥, real definition of beauty with brain.", "freesoul.innerbeauty": "I love the little dance you do..so cute.❤️❤️", "vplovesicecreamm": "You are one of a kind 😭❤️", "sarah_styleconnect": "How can you be so perfect in styling all the time you are the style queen trendsetter I love your work from popxo so so inspiring you have never changed al your styles are so unique no one could ever think of I can’t describe in words thank you for giving us the trends in fashion ♥️♥️♥️♥️♥️♥️ @komalpandeyofficial", "__yatii": "Your feet are so tiny😂😂 so cute", "thefashiontasy": "@komalpandeyofficial you nail it everytime.. this is freaking awesome... Loved it... 🔥🔥", "_jheelll": "Jus wow...wowwww 😭💓💓 DANG this pretty lady always steals our hearts with the best looks!!!! QUEEN OF ALL TIMES! And that smile....woahhhh 💎 @komalpandeyofficial", "sakshiiiagrawal": "Favorite❤️", "shruti_srivastava_sachan": "Dear Komal I’ll tell you one quality that separates you from all the first movers in the field of blogging . Your passion for your art. You see, most of the bloggers today have stopped creating content and have started creating advertisements. Trust me when I say this - you are one of the few bloggers who is creating for the love of it ! And what effort you take man to ensure that even sponsorships are dipped in creativity. We need more people like you Komal. The ones who put their heart and soul and everything into what they do. You were the same when you were 8k and now you are the same at close to 800k. Thanks for inspiring a million bunch of people to follow their passion. Ilusomuch!!", "diyaaa143": "Wow!!Just wow!!mannnnn you're so freaking awesome and talented 😍!!!love yaa..more pore to you girl! #inspiration ❤️❤️❤️", "riyagulwanii": "The best!!♥️", "_ananya_1759": "@komalpandeyofficial Gorgeous ❤", "mother.of.reinvention": "Where is the floral skirt and crop too from ??", "poornasha_": "Never thought monochrome could look this stylish, aesthetic and classy. Love your confidence and content😍❤️✨", "ur.looking.at.me": "Omg.. why are you so on point 🔥🔥", "_w.e.s.t.w.i.n.d_": "I love you a hell lot. Can you please do a Fashiontherapy episode on ethnic wear. I loved all the ethnic tutorials in your YouTube channel.", "_prachi.gupta": "Go for some blue and green monochrome looks 😍", "xshivangi": "How can you be so perfect? In every freaking video. 😭❤️ I could die for you. 😭", "aishwaryachauhan": "Wow❤️", "neyhanadeem": "Hey komal! You look amazing in all the looks! May I know where you’d get the teddy coats from ?", "__chhaviiiiii__": "The last one was awesome dii..❤️😘", "imonikadutta": "The white and peach look is so pooh😇", "heenalovee": "Can u please share some normal outfit for normal girls", "muskanjain1211": "Dude !! M dead♥️😘😍 ! How are you so perfect everytime🔥♥️😘😍", "sunrahihonatum": "Ohh... 🔥🔥 LOVE LOVE LOVE LOVE❤️❤️❤️❤️❤️", "shreyapatil_24_11": "The most beautiful thing i have seen in a while..❤️❤️😍", "piti.laka": "I love the way you style your clothes! It's stunning ❤️", "ialmanaa": "You look so beautiful in whatever you do!💜💕 Your video notifications on youtube makes me so happy!💛 Love from Pakistan! X💋", "somasahaofficial": "Y don't you start modelling", "anushka_008": "You are amazingggggggg! I started a Fashion Series on my IGTV where I try to put together an #OOTD in less than a minute. My sole source of inspiration behind it is YOUUUUUU and I can't thank you enough for inspiring millions of people of like me to do what they love!!❤️❤️❤️", "_._jng._": "Can I just put it out there, @komalpandeyofficial you are the only one insta influencer who I look up to. Dealing with pain and putting out this AMAZING content, when I say this I mean it 'komal mam you really truly inspired me'", "cheese_dip_nacho": "Excellent color choices and combinations 💙", "shalini5797": "Can u tell me where r ur earings from... The last piece which u r wearing??? 😬", "kiaraa_kapoor12": "I can't see your outfit properly coz u are on both sides", "lustt_for_life0": "Wowwwww.. that white beauty. 😍😍", "prachi.lunia": "you look stunning❤️", "steffihaldar": "This video has such a positive vibe to it! You look so radiant and vibrant!!!", "akshatajaiswal": "Where is the last outfit from? 🔥😍❤️", "aditimishra31": "Too the point fashion my icon 🙈🔥🔥😍❤️😚😚❤️🔥😚😚😍", "nupoora_rk_music": "Side partition looks great on u❤️", "mariamshkh": "L O V E colors on you ♥️", "_tanya_6": "What are you KOMAL! Can carry any garment with so much Elegance!😍😍", "daminiadhav": "Looking very beautiful in playful print", "kashishdharod": "Where is the printed skirt from??😍 It's freaking beautiful!💛", "themoodybaby": "White one is so beautiful and the printed one is ❤️", "harshita_srisrimal": "QUEEEEN♥️.Prettiestttttt😍😍😍😍😍", "iifalove": "Last one was🤩🤩", "mahibakshiofficial": "OH GOD THE WHITE ONES ARE MY FAVOURITE ❤️❤️❤️", "meenakshi_2104": "Such an inspiration😭😭❤❤ love you 3000 komal! 😘❤👀", "_aisha223_": "Wowowoow😍", "_supi_79": "Its so cool I just loved all the outfits 😍😍", "_sneha_george__": "The music in all ur videos r awesome😊", "_umangvaishnavi_": "Gorgeous lady!!!!❤️", "afsarah__ahmad": "Can u show us some behind the shoot...?", "akanshajaiswal": "where did you get the last outfit?", "gargoprachi": "Hey! I love all of those looks. But my fav is white. I love those white pants and the white-shiny skirt. Can you let me know where are those from?", "misti2231": "U look stunning 😍❤️❣️", "anchal_.sharma": "You're ALREADY a queen! 👑 ❤️", "helly.gandhii": "You are \"unbelievable\" my love! 🖤🖤", "shoppelifters": "You just keep getting better and better🔥 your style should be on international level❤️🔥", "khushimaheshwari_": "How you are so confident and beautiful 😍😍❤️❤️", "richashishbajaj": "❤️💗💖", "eshi_mukherjee": "You're such an inspiration Komal. Rarely we see people pursuing what they really love and acing it the same. You come out as such a strong woman and I follow your posts like therapy! Lots of love from Calcutta.❤️ Would love to see you do something all Bong-a-style someday.🔥 @komalpandeyofficial", "shubhi_bajpai": "My favorite is the all white look!! So fresh😍♥️", "caffeinated_insomniac": "Only you can rock that neck piece on a blazer @komalpandeyofficial 🙌🏻", "maimilm": "❤️ each of the looks😍😍..also the floral prints are giving such Greece vibes😍..❤️it", "rabia_aslamdar": "U r amazing❤️❤️", "_meha_upadhyay_18": "plzz make some farewell outfit💕💕", "neeti_auluck": "Could u pls tell from where u bought black broad belt", "krishaa08": "Damn girllllllll🙌🙌🙌🙌🙌😍😍😍😍😍😍😍🔥🔥🔥🔥🔥🔥", "perksofbeingayeshahahah": "Love yaaa queen🔥", "rishithajahnavi": "You're amazing mannnn❤️😍", "thesakshiee": "How are you so perfect all the time!😫", "riya.awasthi97": "No one like no one can even compete you in the world of fashion........ If there is styling Competition in Olympic you will definitely win gold 💋💋❤❤💖💖💖💖💖💖", "hetvi_with_iii": "Such an inspiration you are❤️", "m_asmakhan": "Kill meeee😍😍😍😍", "ridhima_2209": "I love how you carry each and every piece of clothing with such elegance and grace. The confidence that you possess is truly commendable. ❤️💕", "anwesha_mishra_": "Yaa girl!!😻😻😻 lots of love ❤️❤️", "aanchalbhalla_": "I mean howww? You look stupendous in everything. Love n hugs💕More power✨", "shortsohwhat": "Oh kareeenaaa all the way♥️ ADORE. ADORE. ADORE!", "hetal.b": "Loved it! Please put up the outfit details in your videos as well", "meangirlnandini": "LOVED THESE! Just a lil feedback, I liked your old format more where you showed one outfit at a time; kinda hard to look at both of them at the same time. Also, YOU ARE SUCH A QUEEN. 💕", "brazenblogger": "@komalpandeyofficial Pure genuine content. Much Love, Komal ❤️❤️ You go girl... I keep on DMing you with loads of compliments, reading them someday would surely make your day ❤️❤️ Much Love 😍😍 ❤️❤️", "trashlasingh": "I'm in love😍💕", "_shivi.gupta_": "Wow it's very good and outstanding", "__thezareenkhaan__": "Why so beautiful darling ❤❤👀", "notsoumita": "queen 🥰", "khushbusahu_13": "Hi, can you say from where did you got that brown platted skirt @komalpandeyofficial p.s loved all the looks❤️❤️", "ms.journo_": "Totally slaying the monochrome look 😍", "konina_biswas": "Wow..", "archivebels": "You always make me go SPEECHLESS 😍😍😍", "mahima_3679": "Wowww❤️❤️❤️", "zeen_shah_18": "U r a master mind 😘😘😘😘😘😘😘😍😍😍😍😍😍", "malvikasitlaniofficial": "Please mention where you outfits are from tooooo! 😍😍😍😍😍 For basic beings like meeee we wana knowww 🙌🏻🙌🏻🔥🔥🔥🔥🔥 you’re so FIYAAAA! ❤️🔥", "deb.is.here": "Hi Komal! I Love what you’re doing in your videos, all the looks and outfit transformations ❤️ could you maybe do something related to conscious sustainable fashion/ clean beauty? You’ve such a wonderful aesthetic and it would be great to see your take on conscious consumption.", "_ruchika25_": "U r rocking it komal di!!!💞💞💞😋", "confessionofmusings": "😂😂😂 I don't know if anyone can pull off these looks everyday. Could we have few normal outfit suggestions", "neha11_11": "You are a stunner ❤️", "mickymac.anu": "🔥❤️", "shruthichandy": "Where’s the printed skirt from ?", "swapnaanjali._": "Where's the printed skirt from?", "shilpisamantray4144": "U look so stunning and beautiful in all the outfits tht its difficult to choose the best one😘😘", "janhavii_deshpande": "This is LOVE😍🖤🖤", "dhruti_bonvivant": "Slayyyyyy! My personal favourite is the brown one. That pleated skirt is so lovely!", "sharma_nehaa": "Playful in print outfit details please 🙌🏻❤️❤️", "manisha_baheti08": "Amazing work🔥❤️", "keepinupwh": "Our Poo😍😍😍😍", "_._hufflepuff__._": "Loved the black look❤️", "ziggymusale": "I’m gonna be honest I have no clue about women’s grooming, I come here only to see how positive @komalpandeyofficial you are at your craft !! I love your enthusiasm towards life🙏🏻😍 also, I love you 🤪", "_nitika17": "Nailed it, you❤️", "aarti_shukla30": "U r th DIVA, keep going on 😘😘😘😘", "rach_kapoor": "That Floral look is perfection. Please tell me where is that crop top from ? It's yummmy!😍", "hitashasodhi": "@komalpandeyofficial queen 👑", "ananya_meh2004": "You look magnificent komal", "wasnik.riya": "One of the best part ✨of your videos is your dance moves girll🔥💕", "shruuu91": "@komalpandeyofficial You are the most bomb fashionista we could ever have ❤️❤️❤️❤️❤️", "i__divya_": "Khubsurti ka pitaara 😍 you're such an inspiration💗", "__shanzayyyyy": "You never fail to inspire,slay and define yourself through your content❤️ I just love the way you are! ❤️❤️🔥", "anshitagarwall": "Good content, absolutely inspiring everyone, charm, glowing, expressions are killer woah!!! @komalpandeyofficial 😍🔥🔥🔥", "chitranka_ayc": "@komalpandeyofficial can you ever ever go wrong with fashion..... you're gorgeous to another level 😍😍😍", "kingkiniroy": "You slay girl🔥. Love you tons❤️ huge fan ❤️", "radhika_10soul": "@komalpandeyofficial you are taking internet by storm hun! It feels so great to see such powerful girls like you who are trying there bit to break certain stereotypes of this society and bring about a remarkable difference out there. YOU GO GIRL!!! Kill them with kindness.. Hoping to cross paths with you someday soon. 💚🌼", "pree1921": "Could uuu pleaseeeeee staaaap beinggg soo awesome 😍😍😍😍😍😍😍 How do u kill it alwaaayysss?😘😘 @komalpandeyofficial no wonder you're called FASHION QUEEN💁🏻💁🏻😍😍🤗🤗", "__nih_ari_ka": "DEAD!!!!!!!😭", "_theinvisiblesoul": "You look Stunning💕💕💕", "snehalkhatuja": "Fabfabsimplyfabb😍😍", "__shayuuuu__": "I'm obsessed with you. @komalpandeyofficial 🔥❤", "tanzzzzzz_": "This is so amazing.. You're my inspiration.. Love love❤️", "padmashree_dambal03": "Truly an inspiration...... learning a lot n will continue with it.❤", "fernandesridge": "That Choreography ❤️", "s_n_e_h_a_2404": "Playful in print is my favourite one❤❤ mind blowing ideas.. You always rock girl @komalpandeyofficial ❤", "sakshi_kanherkar": "I love your confidence komal it makes you more beautiful love @komalpandeyofficial 💕", "palakkkx1": "Please please do a video on farewell sarees", "shreyachandra2001": "You are so pretty komal😍", "vrsha_vatsyayan": "Can you please do a video on how to style hoodies, in a cute way? Ps: you are amazing!😍😘 Lots of love♥", "karda_avii": "Mam i m from indore 🌸 uh r the one who inspire me a lot 🌸 all black look was damm🌼 That monochrome white , black, brown has my heart 💙lots of love from indore ❤️", "roshni_singh_080": "That print one ....is awesome💓💓💓", "iampurnam": "@komalpandeyofficial You’re beautiful. Thank you for bringing bralete, slits, monochrome to mainstream fashion, you have inspired a lot to go bold ❤️. I am one of that lot. Would love some fashion therapy for casual dates and casual(without blazer) office wear looks. At last Thank you for existing and inspiring me to experiment with my looks. ❤️", "sengupta_shingini": "Komal you're fashion therapies actually changed the way I used to look at fashion and dressing up you are just awesome and I love you a lot 💜💜", "rrrishika": "All the outfits were killer as always!! Also a request, start a series dance with Komal! We love to see you dance and radiate the positivity!❤", "stylewith_sakshi": "Omg! Love your Poo look! ❤️ Favourite😍", "tanvi_diwan": "Kamaal 👌", "sensationaldivaa": "Pls mention pls mention playful in print dress?", "mxxkxx_rxx": "Really love what u do and how confident u r ❤", "shifaliaggarwal19": "Wow wow wow wow!!!!!!😍🔥", "siddharth93batra": "Poo 💦💦", "poonam_cn": "You look so damn BEAUTIFUL 😍😍❤️❤️ Just loving your style right now!! 😻😻😻❤️❤️❤️❤️", "geethika_chennu": "Di ilvu ur d queen of d fashion wrld sending lv frm ...andhrapradeshhh💟💟💟💟💟💟💟💟💟", "ppkuckian": "Hands down 🙌🙌", "zeek64105": "🔥🔥🔥", "harshi_maheshwari44": "my fav video 🔥😍", "kukreja_kirti_292": "@komalpandeyofficial U are a masterpiece dude❤️❤️ JUST LOOOVVEEE U💥", "dimpilicious": "Hi. Can you pls tell me where are your black heels in the first clip from?", "rimapednekar": "This is so good, totally aesthetic. You SLAY girl ❤️❤️🦋", "_sohini_._": "How do you manage to look so gorgeous in each and every outfit? Such a talented girl you are!❤️ Lots of love!✨💙", "eminentattire": "Just lovely especially the all black look 🔥❤️", "poulomi.sen.7": "The playful in print was so awesome ❤️ . You look so pretty .. and the song everything was so perfect ❤️", "i_payel_malik": "🤤🤤 you look so gorgeous 😍💕 in every outfit 😍 💗😘 💋 @komalpandeyofficial", "aka_nsha_": "7 is just a number, You slay like a queen every every time in a billion ways🔥🔥", "__autumn_witch__": "you deserve 20m followers.❤️🔥", "rhutuja_v30": "Get offended but side parting suits @komalpandeyofficial better agree?", "sumedha00200": "You are just wow! ❤️", "asmimehta": "KWEEN @komalpandeyofficial", "she_luminated": "This is styling goals! ❤️", "khushi.sing69": "😍😍", "ayushi_choudhary2000": "Loved it komal you’re such an inspiration 😍", "_palak_raghuwanshi_": "Loved it Mam!! U look so beautiful😍😍😘", "zeba_iqbal1029": "Obsessed😍", "aries_0499": "When is STYLE WITH KOMAL starting again? Eagerly waiting for those ones🔥", "munmunbaruah_": "I wish i could steal your wardrobe😩", "hhimanshi_sharma": "Your videos are really amazing, Keep entertaining us like this🙌😍😍", "savneetkrehal": "Love love 😍💕", "muskann_453": "Loved it. Loveeeeeee youuuuu❤️", "grisha_palrecha": "Dude you're gorggggg", "gurleennk_": "Love love❤️✨", "mahimatagra": "Last one is too cute😍 where is that too and skirt from?", "sherryshroff\nVerified": "Verified", "kinjalkurani": "Aesthetic queen 👑", "ayushiiiixx": "So gorgeous 😍💕", "unstoppable1719": "Inspiration= komalpandey ❤️❤️❤️ love u so muchhh", "i_am_nayanika": "Everything is ok but dont dance too much", "_.source_of_creation_.1111": "😍🔥", "debdiyashi": "So beautiful😍😍😍whenever i feel low i jst see ur videos..Love you😘", "laveesha_20": "I love monochrome white, black and brown.. But the PRINT ONE HAS MY HEART!!!!❤️❤️❤️🔥🔥🔥", "whiskeyladki": "❤️❤️❤️ Just love", "sharmaaankitaaa": "Uffffff everytime😍❤️", "shivangani.mishra": "Flawless everytime! 😍❤️", "adt_negi": "I love This song and you ❣️", "_yudee_": "Whoa! Best thing on the gram today! 😍Gorgeous! ❤️", "shreyavarshney_09": "No one can be so sassy and cute as you...that too at the same time ! Love all your therapies ! ❤️❤️", "a_girl_with_the_smile": "You are so amazing 😍 Thank you for sharing a good content🌸", "charu_nadik": "Never fails to amaze us 🙌 .", "sabiha_sabi1817": "This beautiful can pull out any outfit so damn gracefully ❤️❤️❤️ love your feed 🙌 & u r just amazing 🔥", "_istyleu": "Too good 💕👌", "the_lit_bird": "U are amazing everytime 🔥🔥", "ashwarya_chadha": "QUEEN 🔥🔥♥️", "maitri_rathod_05": "You look sooo aesthetic!!!🙌💖", "lilmissgi": "You cutie patootie bomb ❤️❤️❤️.....ur videos are a never ending series 🥂🥂 should be uploaded on Netflix ❤️❤️🙈", "siddhkala_g": "😍😍😍😍", "diksha1508patel": "🔥🔥🔥🔥🔥🔥", "im_ipsitapati": "Just WAOOOOOO😍", "superrxgiiggles": "How amazing 😍 also u did side partition", "rimliy": "Why so revealing always ? You can pull decent clothes I’m sure . What if some girls want to look stylish in dresses that aren’t these revealing?", "sans26_": "This is so good😍😍♥️ also can you do a F.R.I.E.N.D.S inspired video with you know, your Komal twist please♥️", "laveezah_tahir": "You Aree just soo GOOD!! 🔥❤️ .. I DONT HAVE WORDS TO DESCRIBE YOU!! .. YOU ARE THEE BESTTTT!! .. I really want to MEET YOU someday!!! ❤❤🔥💋", "fellowofart": "How do you do it so FLAWLESSLY!?every single time ❤️👀", "turpis._.arbiter": "Did she make a skirt outta her Shrug????😍", "mar_shal._": "Playful print is dammm 🔥🔥😍😍😍😍💕💕💕💕💕💕💕", "sshaillyy": "😍😍 queen", "palakmishra_04": "Why so stylish😩💋💋🖤", "jiiyaa____": "Queeennnnn❣️❣️❣️💋💋💋❣️ with every new video you left us spellbound 😍🤐🤐🤐 babe love youuuu😘😘😘", "shreys.sunshine": "You can never go wrong with style! Flawless ❤️", "certified__weirdo": "Can you please let us know where is everything from? Everything looks so good especially the bags you are carrying. Wow! ❤️ You slay queen 👑", "thatlittlevibe": "Love love loved that floral one 😍😍😍💕 you look amaazziinngg✨", "ria_fashionblogger": "Babe, you are so cute.. one of my favorite blogger ☺️", "tres.envogue": "Your videos are really enjoyable to watch! ☺️", "ankitau426": "Soooooo perfeeecttt😍😍🔥🔥❤️❤️", "pltb1234": "Your style is alll like pooh of KKKG❤️", "prarthana.garg": "@ridhi_paliwal man she's so talented! I think I'm obsessed ♥️", "viadristi": "So beautiful ! 😍💕", "maushumideori": "Link to the pleated skirt pleaseeee❤️", "sidd.iqui64": "You're so pretty komal! ❤️ I'm in love with your style and I'm literally obsessed with you 💓 Following your journey since popxo days and I'm so proud of how much you've grown as a person!! Don't take the hate seriously you know you're the strongest everrrr LOVE YOU ❤️", "ishita_adhikary": "Oh you big piece of beautyyyy!!!❤️❤️❤️", "mostly_savvy17": "Love 😍😍", "_.s_n_e_h_aa._": "Uhhh aree so talented babyyyyy♥️♥️♥️♥️", "shristi.das18": "How do you it, EVERY SINGLE TIME? GORGEOUS YOU❤️", "nautanki_much_": "Loveddd the video and could you pls tell where are the snake print boots from?", "laughingchicofficial": "That poo dress.. ❤️🔥", "khurana.ji_": "Offffooo goddessss😭😭😭😭", "sanchi.y": "Wohooooo😍😍😍😍😍 can't take my eyes offf 😍😍😍😍", "karaxoxo47": "I might have a girl crush on you😭♥️so beautiful", "fashion_junkiee": "The white with dupatta give poo vibes from kkkg😄... make my day❤️❤️", "naincy_tiwarii": "Please mention your outfit details❤️", "raam_shaa": "Woah gurl!!🔥", "_dpka_m": "This song and @komalpandeyofficial in it in different outfits is a MOOD", "perfect_being_not": "Love the print one so much!", "palak_kansara_": "Love love love it....can't wait to try it♥️♥️😘😘 following you since popxo days💙💙", "druvya_vinnakota": "Wow 😍🔥", "rensarkar": "Wooooo.... ❤️❤️❤️ You are so so gorgeous", "jyo1771": "Playful in print 😍💖😍💖", "_.aarshiaaa": "Only if I had the perfect body", "mellowollama": "❤️❤️", "archanarchie": "Woah! Loved all the styles😍😍 U r so so gorgeous n amazing! Love ya😘😘😘", "runaway.to.reality": "😍😍😍", "sakshisaxena31": "Heyy!!! Monochromatic queen @komalpandeyofficial i like tht white look you really looked like poo😍😍😍😍", "designer_diwa": "😍😍", "edgability": "Monopoly over monochromes 💯", "gurmehakk": "BeauTTTT❤️❤️", "saaijal": "Oh my goddd I meannnnn💞💞💞💞💞💞💞❤️❤️💜💜💜💜💜", "sugar_huugs": "Wow🔥.", "xsummerafternoonx": "Where’s the white slip skirt from ? It’s beautiful 😍😍😍 love all the outfits 💛", "anshaa.__": "What a bombshell you are!", "_ushiee_": "Queen❤️❤️", "yashikaaasabharwal": "😍😍😍", "rashmiborah3545": "🔥", "tanuellaa": "Killer komal 🔥🔥🔥🔥", "_akshatagaikwad_": "Wowowow you slay QUEEN❤️", "_afsanabegum_": "Now it feels like you're being so fake", "khushisiingh": "Favourite😍😍😍", "shamsnisa555": "@komalpandeyofficial HELLLOO BEAUTIFUL😍😍😍😍 UFF I JUST CAN'T LOVE YOU 😭😭😭😘♥️♥️♥️YOU ARE EXTREMELY TALENTED 🔥🔥🔥🔥FIREEEEE💙💙MAKING US ALL PROUD EVERYDAY♥️", "_aayushi__thakur_": "Loved all your looks🔥🔥🔥🔥🔥🔥🔥🔥🔥 stunning gorgeous hot ❤️❤️❤️I love you and your style soo very much😍😍😍😍😍😍", "janvi3009_": "The last loook😍", "priya.naidhu9": "❤️", "tanya25__": "Diva!!!💜💜💜💜😘", "prarthi_luthra": "Wwowowowow", "khushi.habib": "You are such a inspiration Love the way you always carry yourself 😍", "ranjanachaudharyy": "You're incredible❤"}