{"shilpxx": "You are absolutely flawless 🌸", "___poonam.07___": "Such a slayer✨🔥", "sharma_navyaa": "Gorgeous!!❤️", "iti_se_": "Stop thinking like this .....u hv enough thn u think.... I love u .....♥️♥️", "shivanishahraheja": "@komalpandeyofficial you think being bold is associated with the size of breasts????? U think you are empowering yourself or any of us showing us the size of your breasts????? And then we women complain of being objectified??? So done with pseudo feminists. We don't mean to spread hate. Am sure u have a story to say. U want to get praised , please tell us your journey without objectifying your own damn self. And then there are going to be 100 women trolling us for putting some sense into you! Come on woman! Get yourself together and give better content. No one is body shaming you. No one is interested to. All we mean to say is you could give us the message without objectifying your own self.", "blusxh": "You're my inspiration bro.. I've grown up by watching your videos...bro, I'm speechless. I've no words to convey my love to you😞. Just stay safe, blessed, and healthy and always be positive in your life Komal🙂. Komal if you're reading this then please, please, please, accept my DM I'm in trouble and I need your help😞🙂❤❤💖", "vineet_portraits": "👍👍", "badgalviiiiivi": "@amber_and_shadeofgold she’s gorgeous", "im_swetajami": "Small breasts or big breast, dont matter.. have dreams❤️😁", "the._.sarcastic._.ladki": "Ma'm you are an inspiration to so many of us .... Love ya❤️❤️", "belinda._cs": "Next ans. Why i m following her so listen just to entertain my self im following her 🤣🤣🤣", "____.rax.____": "You r amazing......you deserve this🔥😍", "1234_cherry": "But why seriously why", "nalayakno1": "Remember this haters r providing u forward momentum towards success😇", "aditi7796": "♥️", "kunwar_ankesh": "And that's how you go big 🔥😂", "souma_banerjee": "Girl I love you 💕", "seemaididit": "F the haters!!!! You rock hun!", "sarleenkaur": "❤️", "medha_official": "TO ALL THE HATERS : IF YOU ARENT BOLD ENOUGH TO ACCEPT YOURSELF AND SHOWCASE WHO YOU ARE THAT DOESNT MEAN NO ONE CAN. IT’S HER PAGE AND DEFINITELY HER WISH TO WEAR WHAT EVER SHE WANTS AND HOWEVER SHE WANTS!! AND SHE’S LEGIT SETTING OUT EXAMPLES TO ACCEPT YOURSELF THE WAY YOU ARE! BECAUSE THERE’s NO ONE ELSE LIKE YOU. RATHER THAN TAKING OUT YOUR FRUSTRATION ON HER TAKE IT OUT ON YOURSELF OR SOMETHING CREATIVE. WT IF SOMEONE COMES AND START POSTING HATE COMMENTS ABOUT YOU? She’s a human being too and the sweetest one. So haters pls stop this. IF YOU DONT LIKE HER UNFOLLOW HER BUT STOP SPREADING HATE!!! #komalyourock❤️", "gayatritz_": "😍😍🔥🔥🔥", "mr_ak_______": "i can see people here.. who are defending her.. love you all. #officalhumansofbombay ❤️", "niharicasingh444": "Proud of u❤️", "glam.in.damn": "You truly, inspire people❤️😍", "ssshivam9891": "This quote ain't help 🙌", "da_baddesttttt": "Fierce 🔥🔥", "theflowerswoman": "Silaaaai Khuli Huyi hai 😂 @komalpandeyofficial", "bubblesexo": "❤️", "sani.ya06": "My god....🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "realtalkthough_1": "SUPER GORGEOUS! YOU GO GIRL!! SLAYYYY", "mohsinlove17": "Aur vase inhe yeah hath bhi rakhne ki kya jarurat thi itna he bold ban Rahi thi tho,😙😉", "divyadayamaofficial_1521": "@_limited_edition_7", "sumedha_rajputofficial": "Yuck 🙄🙄🙄🙄", "isandhyasingh": "Iske baap ko bhejo ye aur dikhao kaise paise kamati hai ye", "sonal.chadha1": "What is stopping you from implants", "divaadil": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "mollen_mi__st": "❤️🔥", "hafsyn": "@the_a_mah", "thesagarchauhan": "Flat bench press ! Bhaven banda motor cycle kadd k leke uton 😂😂", "x.manya.a": "Haath bhi hata hi le😏😏😠😠😠🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻", "chirom_binita_meitei": "💗", "houseofakhani": "You can’t complain about being objectified when you yourself made your entire success story about your body right here, in that sentence. You could’ve talked about your journey, the hardships that led you to 800k but you made this about your breasts and hence, objectifying yourself. Big breasts, small breasts or any breasts have nothing to do with being successful in life or your big big dreams. If you want people to stop objectifying women and emphasising on just their body, stop using it in association with empowerment or making it a part of your success story. Stop emphasising on it in the first place and overshadowing what needs to be talked about. Stop making being bold about what you wear and how you wear. Rather make “bold” about the journey to 800k and about the lives you’ve been influencing. That’s how you empower women. so done with women associating bold, freedom and struggle with their clothes and body.", "masoommanjrot": "@chadhaonkar", "malik_damini": "🙌", "gawkyranjeet": "Last video was disappointing, didn't get to see your thirsty puppies.", "shru1594": "🤮🤮🤮🤮🤮💩💩💩", "a.dankboi": "🤣 if she thinks people are stupid because she's the influencer ._. girl you look like an aunty from my society. No one should follow you or borrow your fashion sense.", "divyaguragai1": "Un ldkiyon ke liye 2 min ka silence jo isse inspiration maan rhi hn !! 🙏", "sabnamsultana637": "😢", "sonia.ag13": "You are amazing komal💓.Your fashion sense,your work✨.I have been following since a very long time.Your youtube videos ,your profile,your hardwork shows all mayn❤❤.Keep going and i could say that no one can match the fashion knowledge you have.I love you💖", "nandini2220006": "@divyaguragai1 this may be so called trend but I guess people with this mindset would raise a question and I cant change their mentality.but I can reply them.also plz rethink and remeber that ur in 2020 and it's the influencer's choice to post whatever they want and I dont think she is violating any guidelines of the society🙏", "ishan_singh_2999": "People it’s 2020 grow up ! It’s High time stop hating and be supportive and pass on some positivity! If that isn’t possible stop passing on the negativity", "iqrashaguftamalik": "❤️", "jia_sonasaria09": "Too much positivity! More power to you ❤😘", "nidhi_nirbhik": "You go girl 💕🔥", "sitaraman90": "Really u have very small boobs", "creativewoman.official": "Plzz don't post nonsense things", "sushant.thakural": "@basumohit", "bharath_chandran_1996": "@komalpandeyofficial....who is that boy in your birtbday video...he looks exactly like me in that video...do tell me...", "deepti.namannavar": "Bold man👍", "__.blushingbeauty.__": "Your makeup and face vibe is just so negative 😢, you are showing your negative image in a bad girl like vibe😢😢", "shailybangre": "Hi @komalpandeyofficial , i love you firstly and i adore your work . Strong , powerful , brave , beautiful are just words you are much much more than that. These comments cant pull you down because you are all the way on the top . I feel sad for these people . Much luck and love to you queen ❤️", "shambhavi_j": "No boobs lol what are you showing off", "falakgurnani": "Eww @komalpandeyofficial 👅👅", "ashmeet697": "Lovely ❤️", "meen_akshi03": "You know what @komalpandeyofficial you are ❤️, You once said one thing in a YouTube video that “if you don’t like my content just unfollow me I’ll do my best to pull you back “ I did exactly the same last year because your content wasn’t relatable to me but I followed you back again because you pulled me, your guts pulled me❤️ you’re aaamazing. Lot’s of love.", "thehappygirl_01": "Not a good figure to show it bare Not good makeup at all..make worth the watch", "anoushkapanwar": "😍😍😍😍😍", "insta_blocked01": "Honestly you look 60", "mirrorsncameras": "@niki_thedreamer 1600k followers me kya kya utrega 🤣🤣🤣🤣", "avantika011": "❤️❤️❤️", "sheetalpie": "Komal u r very good but its not a feminism 😒 Feminist ke naam ka mazak h ye to", "dishaarajgor": "More power to you🙌❤️😘", "itz_peehu": "Feminism ke naam pr mazak", "_gu_ru11": "@likhith35", "vishakha1717": "Today i jst see this pic ..komal not expecting u this picture of yours ...u day by day u look old what happens to u ....and this pic is not called to empower women that u said that small breast big dreams this is not mean to empower women. I like u so much but day day u literally change .", "sushmitadubey708": "What you have done to yourself..earlier you were so preety komal. 😐", "golibetamastinai": "Flat af", "tazin_tanha_official": "I was your big fan . But after this this things ......🙌", "adhikari.ankita720": "Pants i want it for. My interview?❤️", "supriyaraobelpu": "👎👎👎👎👎", "__.his_heartbeat.__": "Bekarrr chiiiii", "_anjali_.mishra_": "💓", "momson_diaries": "Really cheap!!", "engineeronvacay": "This is really bold", "fxthmx.92": "U are an inspiration sweetheart 👍💞💕", "__thatismyusername": "omg those pictures look straight out of a magazine cover! love you Komal", "gayatrikadamgk": "😍😍😍😍", "firegoddess._": "So this is women\" empowerment \". Nice!", "beautybeyondsizeofficial": "Being the Monica I’m, all I see is the undone dishes and the gas cylinder 🙈 Can I come to clean your kitchen? 😂", "rimm__mi": "@saneeshashirodkar", "shakirasurve": "What’s there to hide Komal? Show us how bold u are.. we expect this from u and only u.. YAYYY GO GIRL U CAN DO IT!!", "jaya28_26": "I don't know why but i seriously hate ur face , hate ur activities and everything about u and ur face oh god that looks horrible 🤮🤮", "call_sierra": "@laiba_9", "kadashi_hamada": "Yeah more power to u so that u can show us the rest too😎😎", "the_shambhavi_sharma": "I don't know.. why I hate you.. but I truly hate you.. your face looks disasterly cheap ..", "nami.ta027": "🤮🤮🤮🤮🤮🤮🤮🤮", "soni06_dazzler": "i hate u your face looks cheap the shambhavi sharma you are right", "krisha_1501": "🙌🙌🙌🙌🙌🙌😍😍😍😍😍😍😍", "patni__woh": "Aur nahi hai toh breast ko haath Se Kyu chupaya? Boobs dikhaneko kya hua?", "shrinidhi_murthi": "😘", "luv_se_love_hua": "Congratulations. But what's the point posting pictures like these? Ik you guys gonna call me some narrow minded person. Yeah, you have small breasts so be it. Nobody asked you to compare the size of your breasts with your dreams. Lame.", "rukhsar_03": "How much you charge girl", "jha_priyaa": "Just want to give u an advice that if u want to stay in the hearts of Ur followers thn u gotta get back to Ur back days where u looked innocent nd naturally pretty...Now Ur turning into an explosion which looks so horrible 😢", "shilpaningania": "Seriously why so many hate comments? Itni problem hai then don’t watch her but please don’t make such cheap comments She’s a hardworking girl , nothing is wrong with this girl ,, you people need to change the way yo think", "makeup_artistryby_shaista": "Yeh women’s empowerment or feminism ke naam pe india ko naughty America bana rahi h small boobs or big dreams seriously mann", "____.rakshu._": "❤️❤️", "apurvat91": "Ur gutts😍❤️...."}