{"surya_srii": "You should also show how to wear in those ways and not just snippets of you wearing the skirt in 10 different ways. This video is just about you showing your different looks and not really a kind of tutorial on How - To as any normal audience would expect! Please take this as a critic!", "ssuriyal91": "Check out this item in my Etsy shop https://www.etsy.com/listing/785301019/ms-office-2016-activation-key-for-1-pc", "khanal2850": "I love komal who use to back in times", "vandana.y.n": "I have never seen people actually using these type of ideas in real life. Many other Vloggers also have really good creativity but what is stopping people to actually use them. Your ideas are really great to watch. And I believe only watch not practical. Do not take it as a negative comment but this is what I felt while watching", "schimick_": "Which song?", "arora_khushii_": "I'm tall and you're petite. . Most of your fashion is something that can't be done practically.... Try to bring more of relatable n less of glam ... (Just a constructive criticism, not trying to pull down ur enthusiasm)", "sakshijhamb1112": "Howwww youuu doooinnn itt mannnn!!!!! 🔥🔥🔥", "lepetite_stylist": "Ok legit pretty she is...But CAN someone tell me how we are supposed to wear this ousside #irl tho..🤣", "caroll___mathias": "FREAKIN MODEL💖😍", "spark_your_steps": "Komal your fashion ideas are super hot!and creative too,but the only problem is that girls can't wear or apply these ideas out of their homes..these are just for home experiments..this is india after all😢😢", "vynavii": "your are so good at this❤️❤️❤️❤️❤️ ilyy", "meghnaa_bisht": "How creative you are my god!!!!😭💜💋❤", "sutapa.sutapa73": "Gal you are born for fashion creativity❤️godbless", "farhanachowdhury0601": "Hey.. U are suppperrr hawt..i m crushing over you right now 😍Where did u get that pink longline blazer from.. It's amazing.. And also if could share where did u buy your accessories from.. Especially earrings and clutches.. They are love ❤️", "nidhi.11.patel": "Where you got the shirt from ?", "mayuri_timsina": "Kuch bhi sada hua pehelo aur bolo fashion😂", "pradu1753": "You look flawless in each and every look of your", "dimple_yadav23": "You are the best❤", "samita_narayan_lal": "❤️❤️❤️", "pusssyyyysss": "Hard to swallow pills:Your styles are not practical", "abhilashaj1996": "From where u got ur skirt . It's just ❤️", "yushi27": "Where do you get these wrap skirts from?! So pretty!", "ishima.t": "I'm sorry but none of this looked good or wearable. Probably one of your worst videos.", "dr__arunaa": "Where do u wear it all these outfits", "dimpple.kpoor.dzines": "@komalpandeyofficial hi can u please check your inbox thankyou 😊", "saffysandhu": "Do you even eat ??", "puneeth.mail": "😍😍😍😍😍", "_shalakhasingh": "last one was nice and practical. apart from that cannot say the same.", "iamsukhmanibedi\nVerified": "Verified", "oishanighosh_": "Can you please tell from where did you get that white belt?", "asthaaagupta": "While I love your overall styling. I personally feel length is an issue here. I can't wear this out and let my carefree self be conscious everytime I even lift a leg an inch from the ground.", "rehankapoor9856": "Beautiful👑👑", "fanzreapp": "🧡 We Love You🧡Fanzre is here to show people love🧡Thank you🧡 Follow Us🧡#theshowloveapp", "_shiv___________": "Ye jo aap dikhari h...bht acha laga...pr isko pehen kr kidhar jane ka...award function??", "amyr3103": "This is only good on camera, I'm not sure we can wearing these outfits for daily", "chocolatetruffle1999": "Haye garmi is playing in my background💕🔥", "prachi_gp": "😍😍🔥🔥 OMG", "fantasia613": "Are these even practical for normal people?", "priyansha_yuhu": "Try going out wearing these?", "ummeaimenrizvi": "Shoooottt ooooff😻😻", "doctor_in_disguise": "I can never pull it off!! Not for curvy body type", "anamjameel": "Don't hate you but your style is impractical 😊", "upopcontemporary": "@aidamalik1", "theprajaktakambli": "Greatt!!💕 I will definately do this when i go to bath in a pond and someone steals my cloths😂 love u tho🙌💋", "immsreya": "I am not trying to spread hate but yeh styles bas dekhne m hi achii lgengi.", "ketaki_always": "I am a lower middle class girl...Was thinking how possibly could I travel by bus,auto or local trains wearing tucked cloth....Komal maam please also consider people like me that wear middle class clothing .... Please consider a new series😍", "mihika_19": "Everytime I see your profile, I wish you'd do more Indian suited wearable fashion therapy vids! Such a waste of your amazing aesthetics :(", "the.jonathanedwards": "@komalpandeyofficial plsss check the sketch @allen.samuel9 made of you on his page ☹️", "got__fanpage_": "Lol. How can we even wear this and go out somewhere. Really useless. Please be more practical. We can’t show our crotch to the public.", "mini199564": "I love this idea 👏👏👏", "anu_deo86": "Loved the 3rd one", "the.captivative_eyes": "and you as always on fire😲😥😥❤️❤️", "bollywoodstarz2020": "Ohhh God I can't stop laughing 😂😂 kya unusual style h yeh!! Atleast @cherryjainofficial apse achi styling karti h", "_purnima_ch_": "I love the background music score🤘", "lokade01": "Creativity 🙏♥️", "piyu_officiall": "U r a wrap queen", "shariffmustafashariff": "and reply if u feel lyk", "epilogue_of_life": "How unrealistic can you be???", "utkarsha.roy": "Someone taking fashion to a revolutionary next level.. 😘😘.. Luv u @komalpandeyofficial", "divyamahale7": "I wish I could dislike this. Nothing new 😑", "shanuarun": "Wowwww", "bakeupnmakeup": "Haha this is funny. I mean this is good for chics with no boobs. Get a friend with a cleavage to do something for curvy girls cmonn", "_.candycane_missy.__": "Oh my god.. I love you komal..❤️ I tried every style that you put up on social media .. I do that and stand in front of the mirror and act like you do.. And no body could ever understand how much efforts and hard work it takes to get into that level.. Very proud of you.. ❤️❤️", "twinkle.116": "I m sure in some days you will gonna make a video on “how to wear your penty as a top or as dress” nothing much expecting from you.", "sabashrafi": "Let it be what it is... nobody's gonna wear it like that ever! - like a clown ! Veryy impractical.", "sadikahussain": "Marry me please?😭", "theliterature_geek": "Its a good concept for the runway,i doubt if an indian girl could carry it in the streets", "matfz11": "Hi Komal. I really love you style and fashion! 😍 I recreate looks from your session! Could you let me know the brand for the white pants in last look?", "jasmine_hyder_": "What have you done with your face!!!!! You were so pretty without the surgery!!!!!", "lalitavijay2018": "❤️❤️❤️❤️❤️", "durgi2108": "I always wonder! Who the hell in India will wear these kind of clothes", "dancing_camp": "🔥🔥🔥", "samarwinter": "The white pant where it is from?", "areevadebbarman2010": "Hey u did a amazing job at popxo why did you left", "pratiksha69854": "Don't take it as an hate comment but u think many of girls can relate it? I mean I don't know about others but I did not find them very useful bcoz u r anyway folding it in different ways to achieve not saying that it's bad but Komal dii Itni mehnat q koi Kre isse better top he lele", "shruti.thacker": "Heyy.........can you plz do something which a normal teenager can where and which can allowed by our parents plz and yes you are doing an amazing job girl you are fabb lots of of respect for you..❣❣🤗❤", "avniverma17": "Kya hai ye? 🙄🙄🙄🙄🙄", "yashika_prasad": "Last one is my favourite", "vishakha1717": "Not enjoying for this video sorry komal.", "pallavi.g.patil": "whatever ideas you show on your channel all of them are creative however not at all practical... also I think being really and not trying too much would help you. my unsolicited advice!", "muskanduaaa": "Also, where is the shirt from?", "shambhavidixit": "Amazing 😍", "_diva_itself": "Hie @komalpandeyofficial can you please tell me from where did you bought those white trousers It looks amazing ❤️💋", "aloonimki": "Omg!! Your too underrated 🔥🔥🔥", "curiously_insane": "@komalpandeyofficial you look so bad", "commonerstale": "🤣😂 @purva_k20", "ashwinishriniwaspatil": "Are vo kaise wrap kia he vo b nhi bataya how can u guys give the like Yr n plus jo bell bottom ka pant dala he uspe to washroom kaise janeka.. Kuch b mtlb 🙄", "candycolor_x": "Yes Komal, when I go out, I really like to be constantly worried that my dress might unwrap and just fall off my body at any time. Your content is so unrealistic and useless to anyone that lives in the real world and doesn’t just dress up for a video at home. Ridiculous.", "granolasauce": "Are you not suppose to sit when you wear the first 3 versions of this wrap skirt?", "ladies.linen": "You are incredibly good 🔥", "moondai.x": "DIVA❤️", "_nehaydav_": "Your Therapies 🔥💕", "er.2748": "Fire🔥 Absolutely lot's of creativity. 😍", "dr_yashi_agarwal": "Kuch bhi matlab kuccchhhh bhi😂😂", "shilpa_sethia": "👎", "zevesh_sattar": "Love you komal...dnt stop what r u doin...me as a boy I get inspired by you....♥️♥️♥️", "7.sikta": "4th is so funny 😂", "another.fellow.being": "These ideas belong on a runway 🔥", "priyankagohelofficial": "❤️❤️❤️darling....!!!!😘", "naila_hussain_7": "More power to u....you can rock any look❤️😘🔥", "douknowashwathy": "The fourth look tho💫🔥", "money_niharika": "I don't know if there is something wrong with me only😑. I just can't fing your videos these days relatable.. And there was I time when it was all komal pandey when it comes to styling. Experimenting is good but it just makes no sense when people can't actually style them. Despite of all the people who love your content, there are people like me also who used to be inspired from you but now loosing all that inspiration.. I hope I made my point.", "aka_meera": "@komalpandeyofficial hi, Have you never been a normal girl with normal life going to college office , leading a casual life for them fashion is interesting but it’s simple as well could you think of a simple girl trying out ur ideas for any percent of their life if u make them just scroll another glamorous looking unrealistic video then it’s cool but you are really helping us out this is SERIOUSLY unacceptable and unrealistic type of fashion fir 80% of the girls who is reaching out for ideas. Please THINK.", "_her_vibes___": "@komalpandeyofficial I love your videos and will always appreciate your hard work love❤", "suhani.arora": "Bhut hi zyada non sense 😂😂", "bts_love211": "I really want to see a fashion video without makeup, i think when you put on so much of makeup it automatically makes you look different. The fashion gets suppressed !", "alisha_17_das": "Love no.4🔥", "meghnafredrick": "😍❤️", "memebazaar__243": "Hi Komal! Could you please share your therapist’s details? I’ve not been in the best headspace for quite sometime now and I really want to seek some professional help. Thanks ❤️", "ikkabikka": "I aspire to be as confident as you in my body ...", "philiaishwarya": "@komalpandeyofficial you're very bold and beautiful. You have an exceptional styling sense and put in lot of efforts in your videos. But I feel rather sad about the fact that most of your fashion therapy can be done by only people with very proportionate and toned bodies. Could you please try to put in some ideas for people of all shapes and sizes? Or maybe do a fashion therapy video for each different category of women body types. It might look good, but people should feel comfortable too in such an attire to be functional. You can easily carry it off with your confidence and in your profession. But most of us common women can't. So request you to please be more inclusive for all of us. Sending love! :)", "niveditadhatwalia": "3rd and 5th works amazing for me. I have to alter rest. But true fashion always. Love your art. ❤️", "prantikad97": "@komalpandeyofficial you are amazing! I love everything about you. Absolutely a strong woman. I wanna be like you actually! I love you ❤ . ( Where is this skirt from?) 😊 I wish to meet you someday 😊", "aisha_in_wonderland_": "Loved 1, 2 and 5", "iampalaktiwari": "It's so useless , please make some sensible content so one would even think of wearing it @komalpandeyofficial", "_mominaimran": "@komalpandeyofficial can you do a more detailed one like how you've wrapped it?", "kashisshs": "Amazing buddy! 😍", "trendelitee": "HOW DO YOU DO THAT 😍😍", "pragya.bora1990": "👏", "himvnshi": "The shirt one is absolutely another level dude 😍", "_endearingwords_": "All your styles are more or less the same and very impractical. It's unusual and shabby. Doesn't look good too. Nobody can wear it except for you. I don't hate it but just being honest. Appreciate your hard work...but totally not this one.", "minhajkhannn": "Diva❤️❤️❤️", "rads_97": "Your smile is so beautiful ❤️ why don't you smile in your videos or photos why the pout always smile>>>>>>pout", "anamika_shakya": "😂", "lukceleb": "The content may not be relatable but if all the scientists in the world said this is not possible, how would have all the innovations happened. If all the fashion designers always make clothes that are relatable, how would new styles be designed. Someone has to bring fresh ideas to the table for fresh inspiration. #yougogirl", "afetxalikova": "🇱 🇧", "rush02_sun": "@rusmi_koonjol maaan mo nepli kav ek saa maaan dimoune pa kav boufon kumsaaaa extravagant, ena ene limit kan mm, koz ek sa taaa, taler corona pren aler la", "umikabhati": "Perfecttt girl... Lovee youu so muchh", "poojauttarwar_": "My mom will kill me after wearing skirt like that😝", "rubi.jha.180": "Man the last one I tried 😍", "megiverma": "🤦🏻‍♀️", "alekhyakattikireddy": "And this.... I believe only u can pull it off with your amazing charisma🙌😘", "salonikelkar": "Now this was just anything!.", "adwitiya_mistry": "U r creative. So, I request u to make videos which show clothes which can be worn in everyday life. U can wear that everyday, but not everybody. I dnt lack confidence to wear it,but I just dnt want to dress up like that. Can u pls do more relatable, wearable looks(again these two terms r very subjective).I hope u get wht I mean", "dr.yosufxai_khan_": "I love u baby u so hott", "salonii2005": "Ohhhh damnnn the last one😍", "ashmeet_kaur_5": "insanely amazing😍", "iaakaanksha_": "This is so good mem🌹", "miss_perfectly_imperfect": "I like your sense of style. But disappointed with this one. Half of the options you showed are not wearable at all and neither looking nice. 😐", "varsha2singh": "Y dont u smile", "debikaaaaa": "How can someone be so amazing?❤️🥺", "sataparna_roy": "You are really amazing and beautiful, and loads of love ❣️❣️❣️❣️❣️❣️to you for being so creative and working so hard. Just love to see you doing such amazing work and love your looks🤩", "sugusingh28": "Lots of love ❤️", "lizaray_216": "so unrelated", "veev_thebest": "You are genius 😍😍", "meera_rajputana": "@komalpandeyofficial dude it take lotttt of efffort but it's not pratical me being honestttt!!!", "sowjanya__ghantasala": "How can u do everything awesome from nothing ❤️❤️ u repeat out fits like a pro 💪 ur fashion includes clothes from sarojini 🤩 and u do mix and match.with 3 outfits u LL create 30 looks ,I liked it more .love from Andhra Pradesh.😘", "makeupbysheduly_": "#4 is so cool 🔥 Love it 💓", "rangwanibindiya": "Super creative! May I know where is the skirt from or where would I get good wrap round skirts please?", "palakx_x": "Loved the 3rd and 5th one ❤️ So chic and effortless 💕🌸", "spill_the_blue": "🔥🔥🔥 How can u be so hot???", "kanika__98": "I love ur videos i jst love your day by day flow ♥️ god bles you with more ad more", "ritusah": "@komalpandeyofficial You are such a diva no doubt.. You can make any piece of clothes wearable in so many different ways.. But please i have a request Please make an elaborated video how you wrap dat skirt.. How you tie them in different ways to make it look dis way.. In dis way video we cant figure out how you did it..", "princesspretty012019": "My dear no offense no body shaming but honestly you don't have curves and bulges. So anything to everything suits on a straight plain body. You wear low neck or high thigh slits you look cool. But there are numerous of us with heavy thighs and upper body. Hope you understand", "tulsanidivya123": "@komalpandeyofficial you’re simoly amazing. It really inspires to experiment with your clothing...loads of luv❤️", "nutrimiller_official": "Amazing it is❤️how creative u r", "purpleheart8388": "❤️❤️❤️❤️🔥🔥🔥", "deepshikha489": "Beauty with brain love love u💓", "puzzu111": "Concept is good. But can't relate to what occasion the style would fit", "bhartina_talukdar": "Why so talented?❤️", "priyankaspalette": "You are amazing @komalpandeyofficial ❤️❤️❤️ you are my inspiration❤️❤️❤️of boldness❤️❤️❤️", "bani_sinha": "My dad has a similar coloured lungi, can I try with that? Please Help !", "daisy.pd": "How can someone slay everytime😍😍😍 girl❤️", "trupti___": "WOW 🔥", "theperipatetic_couple": "The content is not relatable at all... I miss the popxo komal... Too simple yet someone upto whom we look up too for advices...these styles looks cool in pictures. But I won't say that any small city girl would look up for these... Cant the content be a lil ordinary and simple,??", "oops26o": "Komal komal komal❤️❤️ u r love babe... U r my fashion icon....if confidence boldness had a face @komalpandeyofficial ♥️♥️♥️", "tanishacandy": "Obsessed with your videos 😍 don’t listen to the haters lol", "simantineechanda": "Loved it.. . Can a curvy and chubby girl carry it?", "nia.4455": "To wrap a skirt like u firstly I have to.loose weight then I can wear this it will take a slot of time .", "samruddhiyadav_": "Hey komal! I love your work. ❤️ You are my inspiration not only for fashion and lifestyle but also for the way you handle mental health issues. I always have wished to connect with you and talk to you abt a lot of things🥺 I always have been looking up to you. Your fashion videos or the videos where you talk about life and mental health. Calm me down and insipire me.! You have a long way to go! I always will be looking up to you. Thanks for everything 🥺♥️", "a._r._c._h._.a_.n_.a": "I admire your makeup skills than these, to be very frank... This is not wearable at all.", "___juhi_tiwari___": "Love your haircut 😍❤️", "_shinchan____lover_": "Are u on tiktok???plz reply", "_pink_ribbon_giftery": "Follow my page for perfect gifts for all occasions🎀", "pujamukund": "@garvi27 LOVE this. Love her style. Lit af 😍🔥", "ridambhasin05": "white shirt from?", "niraja20": "I have the same skirt... turning it into a top was my fav ♥️", "mama_and_arjun": "Very impractical dresses !", "my_obsessions_gallery": "When you are trying to motivate female audience to wear these types of clothes, she must also better share some tips to feel safe wearing and roaming like this around delhi", "_tooyoungtobesad__": "Please do a curvy girl outfits video", "_bidisha_borgohain": "😍😍😍😍😍meri didi", "kmayadevi": "komal kinda look like chloe kardashian", "alilifiyah": "@maria_m9h8 literally a tutorial on how to have a wardrobe malfunction xD", "muskaan_nagpal.mn": "How can u excel every look 🔥😍😘 such a perfectionist 😘❤️", "nim110_": "Stop. ! Uh are in india we can't wear it koml 😟", "neha_karmakar12": "Face mai na thoda natural expressions and smile karo it looks very plastic", "anisamaity": "Wooohoooo.. This is sooo amazing soooo great.. It's wonderful... Every look was mind boggling.. My fvrt was the last one... Love you sooo much komal.... Keep shining.. Hope u r safe.. Lovezz✌️✨💥🌟🌷💘💜💛😚🌠", "makeupgiveawayindia": "No offense but please try to make videos that are helpful. I do love your videos but this one is something that if we try these looks we'll look stupid af. I do understand that you have taken alot of efforts to do this video but this one not very useful. We look up to you as someone who would come up with some great fashion therapy that will inspire us but this one is nothing like that.", "_twiyung_": "You’re the best when it comes to bringing out new ways to wear anything out of the wardrobe. Love you and your style ❤️❤️", "shehjarkaul": "ICONIC ❤️❤️❤️❤️❤️❤️", "sharmi4": "Ek b style Acha Nhi hai👏🏻👏🏻senseless", "mansi.singh100196": "She can wear anything ❤️❤️❤️", "tannu08_": "Such a diva♥️", "srisohi625": "The last one was my favourite.All the styles are nice are nice but there is no balance in your clothing sense.", "anutanwar2": "❤️❤️", "riyamodha": "Amazing ❤️😍", "ujala28_singh": "Where is the skirt from?", "urmila_224": "I love your ideas 😘😘", "pizzaandfrieschild": "@komalpandeyofficial you are just on a roll. You never cease to amaze with your creativity. ❤️❤️ A small request. I'm a little on the heavier side now. Please make a video on stuff for girls with thick arms and thighs.", "karishmated": "Bravo, creativity beauty @komalpandeyofficial 😍", "khadeejanoor": "@komalpandeyofficial where did you get that white dress? It is too die for. 😩", "aastha_1081": "Where did you get white long shirt from#4?", "priya_jakhmola90": "Big fann😘😍", "_alisha180_": "Each and every look was fabulous♥️lots of love and strength. @komalpandeyofficial", "hirangeelohere": "Lol I try so hard to like you", "chhayatiwari908": "So funny.....🙌", "deepjoshimua": "Matlab kuchh bhi komal we are indian yr phle video apko achhi hoti thi but now this is not for everyone yr mean that fist one wrapping a dress itna small kha pehan kr jaoge aap n plz make some good content rather than this type of content n dress DIY", "aadzy.pvt": "Don't have a summer body actually i am fluffy like a duff ball , i think please shoot something for majority", "monicaf275": "Will u go outside like this @komalpandeyofficial I don't think so", "shizaqazi__": "😍😍😍😍😍😍😍😍😍", "mahima__26": "Show us something which we can really wear like REALLY!😌", "fairydustandspicelatte": "@komalpandeyofficial yup!! Its amazing how you are so creative and experimental with your looks!❤️ And ur outfits are always on point. But as @riyasingh211 said a few outfits are not relatable or wearable ? I dont knw i might me wrong ! Fashion and experimenting is awesome but i dont think ive seen regular people (non-bloggers/ celebrities) wear anything so experimental. I dont knw it might juz be me but i kinda feel not everything is wearable though", "thebelladonnaworld": "Kon krta aise??? By god🔥🔥🔥", "sharonnikhinn": "Weirdo", "knotsto": "No offence to your style .. but all of this outfit on this video can be only worn by someone who has a kind of your strature... it’s real hard for someone to carry it normally", "audreeja": "Where’d you buy those white pants Fromm?? Love the styles tots trying it for summer ❤️❤️❤️💯", "amanda_iona": "Love it!!", "pallavichauhaan": "Whaaaat 😍😍", "wanderohn": "Superb styling done", "peanetbetter": "ugh an ICON😠😭", "soodriya0": "Look no one can wear the outfits that u have shown..", "imurvashisingh": "I really like your stuffs 🙈.", "maithilee_kulkarni": "Hey @komalpandeyofficial I loved this video post.♥️♥️😍😍...kash I was thinner...I love to wear wrap up skirts...but with my body type I can't wear them...😥😥", "konfulisious_amak": "This is the most creative everrrrr💖💖💖", "prachi_0147": "How do you do this😵😵😵❤️❤️❤️", "nehanancy8800": "See komal I have seen your earlier videos which were very inspiring. But now you are always choosing shorts cloth in which entire body is much revealing than your cloth. Pleople are now watching it just to see your body. I believe that you also don't want that. Make a video on shorts cloth but in not such way that entire body is revealing. There must be some elegance so that people appreciate your classy look not the body.", "shaeroy": "UFF 🔥 Loved the idea! Also look 4 is 🔥 may I know if the long shirt dress if from ZARA or are they separates. 😍", "tarannumsamtani": "They look really nice but frankly are really impractical. Except probably the last one.", "the_maheshwaree": "Everytime i see your videos and i become a statue for while!! Love from Gujarat💕", "ruthbeverly1980": "Great sense of style!", "mishka_mishthi": "I love u and ur dressing style 😘💋♥️", "me_googs": "Really coooool😍😍😍😍", "khushbru": "Boring day at office...you, your style and this song made me feel good...now working with double energy 😀", "tangerine__dreams_": "😒", "eeric_99": "Skirt is from?", "anumkhan001": "Saste tareen kim banny ki na kaam koshishyan", "avspgirl": "Earlier your videos were reasonable with some good fashion hacks and all.. You actually worked hard with ur videos ur hacks were sensible..but now these lame fashion hacks which nobody can wear.. .. no relatable at all...!!", "tamaarah.sarah": "I don't understand how you can go out in public showing your crotch for the whole world to see.", "taaysha_singh_official": "For photoshoots it’s good", "anjaliroy__": "Didi aise kapde koi nahi pehenta,kuch bhi naa sikhaayein please🙌", "ruhibadaya_": "I love your fashion style😍thnx for inspiring us!llyyy❤🥰", "manana_naal": "Prettiest gurl Eva, I love u bub❤️", "rashmi.__.sharma": "Like you're so so talented💜... I'm not even surprised anymore but this blew me🙌", "thedesigner_pocket": "I love the way you carry things. Such an inspiration you are💜 but i think you can make videos which are more relatable to our daily dressings. No offense, I always admire your content.", "main.kon.huu": "M confused how do u wrap it like howw... Can u make a elaborated youtube video 🌸", "ananyaxoxoo": "These ideas are so dumb ...and not practical at all ...maybe you can wear these on the beach ...that’s all ... We used to wear this kinda outfits with our momma’s chunni when we were young 😂😂...its that’s unpractical ...", "enigmapriya": "Watch Prernachhabra for relatable videos..Komal's fashion is a therapy to feel good and be more adventurous.. Cheers!", "_tee_j__": "No one can wear like this nd go outside ...🤣🤣🤣👎👎👎👎", "lhouvibeinuo": "🤍🤍🤍", "tag_that_trend": "Crushing on All these looks. Gonna try them soon.", "afeerakhan9": "Ise pehnne ki b kya zrurt thi", "bussy_san_": "I like u n ur fashion sense is too good but plzz aisi video bnao jo normal girls bhi pehn ske apke jo kpde h wo sb nh pehn skte so thoda apne bre m chordkr sbke fashion sense ke bre m socho bcz ye video sbke liye bna rhi h ap sirf apne liye nh so meri bto pr dhyn do or thoda chnges lao itne showing kpde sb nh pehn skte apki 1% followers hi ye follow krke pehn paati hongi bki 99% ka kya kbhi socho unka bhi I 9 everyone appreciate u but no one follow this style in reality", "fashiontakedown": "Now I don't have to worry about buying clothes. You are inspiring. Btw, can you do a capsule wardrobe lookbook? ❤️❤️❤️", "namrata9535": "And this is just awesome💜💜", "miss_sassy_00": "Hey I loved the 3rd drape you rock every look you are so danm beautiful😭", "shre_yayyy": "Komal I miss your pop xo videos....❤️", "kalravshah_": "You are amazing 😉", "bhandarirajni": "Hahaha. Matlab kuch bhi!", "amritamane12": "Your videos are genuinely soo helpful , if you could also probably just post of where do you shop most of your outfits because its easy to follow your steps but the problem is where do we find these things for example your wrap skirt . So if you also tell me where to find these it’ll be more helpful , thanks ❤️", "____unbridled45": "Woahhhh ...😍😍!! You're so creative !!", "_abhhaa": "These looks were all amazing Komal. I really admire how hard you work for this and put so much thought into this. Not to mention you looked HOT AF❤️😍 i also had a question. How do you ensure that these don't open up when you're out. I'm sure you must've used safety pins but i feel even after using tons of safety pins I'd still fear the skirt slipping off. Please tell?!?", "vishnupriyaah": "Last one is awesome ❤️❤️❤️", "asmi_battu": "Gorgeous as always", "ann_williams25": "@komalpandeyofficial where is the skirt from 💕💕💕💕 Creative soul ❤️", "saimamulla1": "One reply please😢", "krjo25": "The last look is my favourite, love your videos 😍😍", "megchandu": "Hi, I love yoir style, you are freaking genius, would love to know how you play your style with plus size figures? Something more relatable and do-able.", "swathi_eeee": "MINNNNNNNDDDDDDD BBBBBBBLLLLLLLOOOOOOWWWWWNNNNNNNN✨✨✨✨✨", "harry__len_": "😂😂😂😂", "__kimm__03": "You always Stunner 🤙😍❤️🔥🥀", "rakshitneha": "This is lit ✨from where you baught this skirt", "sulit.by_soj": "You’re mad hot 🔥xx", "vaish_nidhi_": "Cute hotie 💞", "anjalipapreja": "So much creativity😍😍", "alankrita_._": "You are too Amazing!!!!!🖤", "monie_tales": "No offense but I really would like to see you wearing look-1& 2 while going out", "mashaal_ak_": "Soooo creative 😍😍❤️❤️", "monikasatote": "I am not into fashion or something but this video is really creative", "sanaseries": "Love this❤️🔥🔥", "priyachintha6": "Where do u expect ppl to wear n go the second style🤔🤔🤔🤔🤔🤔🤔🤔🤔", "drshaloo": "can u brings some style to wear after post partum", "lysbeth.artistry": "Nice😍", "ananyatangri": "@kartikaaa.___ she is SO INCREDIBLY TALENTED i mean did you see the third look????? 👀♥️♥️", "hetal.b": "Where are you getting these belts from?", "sudikshakashyap23": "💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕", "o_priya2": "Howwwwww.....I love u @komalpandeyofficial 💙💙💙💙💙", "enayat_anu": "🔥🔥🔥🔥🔥", "prati7773": "Kuch bhi yr 🙄🙄", "bhumi.shah.756": "BRILLIANT!!🔥", "mamtapatel_13": "I think you should show how you wrap skirt so it can be little easier to understand", "diptitripathi19": "Alwyasawesome🌹", "chesna.john": "These looks are so pathetic!", "sumuddave": "Guys... The length of skirt is not Wat I m looking... I'm clearly giving thumps up to ideas... 💯 better Ppl pick the ideas than putting hate comments .rather not liking then don't police it. @komalpandeyofficial Pls guide me whr is that white oversized shirt dress from❤❤", "rajmani25": "Love all d looks including accessories that you used..keep up ur awesome work🤗😘", "nalinibhu": "Disgusting", "komal_khatri": "🙌", "bhupali3": "I unfollowed pop xo long back only for her. She is a pathetic actor, didn't like her videos there 😒", "shrishty_55": "I don't really know who the hell would wear skirts like this😂", "mishti.in": "U r great luv u 🥰plz share skin care routine 🥰", "dollysharmaaa": "I have never seen so creative person in the fashion industry♥️ much love to you komal❤️ and happy to see how you are growing as a person", "the_blogger_page": "hey @komalpandeyofficial from where u got that white long dress", "sneha0022": "U took fashion to a whole different level.. 😊♥️", "shraddhhaaaaaaa": "No doubt you look hot😍 but seriously we can't wear this and go literally anywhere @komalpandeyofficial", "anamika.chauhan10": "These ideas are nice and creative but the problem is cannot be worn out in day to day life unless you're a star. Looking forward for vidoes to meet the needs of a normal class people 🌸", "sanveerluthra": "@komalpandeyofficial you a fashion freak!! Love you❤️ you provide the most accessible looks and that creativity tho!? Hello fashion scientist♻️💚", "candied_spare": "The 5th one being the best of the lot!", "anona_afrin": "Im adopting that last style🙌", "anshita_vijay": "You can literally wear anything, any which way 😂🔥", "mosmikhanpereira": "🙌❤️ u ROCK", "happiestsherry": "Hey komal here's a suggestion I have been following you for a long time and I the thing which lacks in your content is relatable I know it's your igtv and YouTube you can post whatever you want but it will be nice if you try your hands on relatable fashion for eg. how to style a white shirt and pencil skirt but the key here is without any fanny packs or things which may hinder while working, running, typing it's just an example @komalpandeyofficial", "bangalimey_": "Please teach me how to wrap like that?😍", "aakankshachandel11": "You are absolutely creative @komalpandeyofficial 😍❤️", "ladyfoodaholic": "Bestestttt 💕💕💕💕💕💕💕💕", "karishma__rai": "Hey @komalpandeyofficial, I just love the way you style things with just using 1 wrap skirt or even with a scarf. But most of the styles are impractical to wear, mostly its very revealing or maybe I’m not using the correct word for it. I would personally be very uncomfortable wearing anything such short and go on a date with my bf anywhere in Delhi. Again, this is just my opinion and I’m really a fan of your work. Can you try styling something where girls like me could think of actually trying some of your styles in real world.", "panchami_prabhu": "How are you so frikkin talentedddd 😭♥️", "radhikaaroraofficial": "Loveddd it yaar komal😍😍how you do this every damn time🔥really want that wrap skirt, from where it is?😅", "akanksha_2011_singh": "Amazing fashion sense ❤️", "whotfiswaru": "loved this video! was looking for a few ideas on how to style my wrap skirt. one suggestion, could you please show how you tied the skirt because it is a little unclear. other than that, everything’s perfect. you are perfect💛", "zshxn": "@mxnkhxn 2", "preeti_punjabij": "SOOO FREAKING GOOD!😻", "dhriti_2095": "Creativity to a level🔥🔥🔥🔥🔥. I love you😘 your videos are a real fashion therapy. Thank you for it❤️❤️❤️", "elirose8627": "When u said u can wear anything that really meant anything...😍u r the most talented person I've ever known😍😍😍😘💞💕", "jyotiandshikhavlogs": "People who are saying it's unrelataby... Have you even been on beach vacations it's 💯 on 💯 gonna try it's a nice fix girl ❤️ 😍 @komalpandeyofficial", "aarzoo.arora.05": "Give something decent and daily wear also ....to much skin show is not comfortable", "shadesofsweta": "LOVE this!!", "inspiremotivate9400": "Always so clean classy and posh 🥰♾", "unnuuuuuuuuuu": "Komal only if you knew how much I appreciate your hard work and also that you've chose what you love - fashion ! Believe me coz there is no day, that goes without scrolling your feed. Much love to you ❤️", "rads_sha22": "Loke the last one style most👌", "asthayad23": "Your ideas are just mind blowing ..but I dont think that this will suit every girl(like me) ..Btw you are doing great🎉", "rj_mehak": "I want to try all of this! 😍", "himani1209": "❤️❤️❤️", "sudiptikhugsal": "Please tell us how to ACTUALLY wrap it.Dont cut that part. Seriously.", "sanchitabhartiya": "My God..it is so difficult to settle for one favorite..each of the styles are so unique..so wearable..please help with the deets of that wrap skirt and come up with a tutorial on how to wrap them..pretty please 🤩", "theselfcontender": "😍😍😍😍😍😍😍", "sanya7101": "Can anyone tell where are we going to wear these kind of dresses in REAL LIFE.😂", "aditiarunn": "How do you keep from flashing people if you wrap the skirt like looks no.1 and no.2? Love the way it looks tho!!", "aklaa_keleten": "I swear I was your huge fan in your starting days and always wanted to look stylish like you but w time you and your have changed sm that not normal girls can wear what you show which is v sad", "aaimaw_malik": "Omg komal seriously am ur biggest biggest fan u r beautiful 💋❤️", "prinksweet": "Can you pls share brand for your inner wears..", "keerthi_u_gowda": "It's getting hotter day by day 🔥🤑", "koushiki.banerjee": "The 4th look 😍😍😚😍😚😚😚😚😚❤️❤️❤️❤️❤️❤️😚😚", "poojachoudhry2906": "White pants from? @komalpandeyofficial", "i_wanderlust_i": "Genius 😍", "omaisa_anam": "This looks funny 😂😂👌", "gopikasachdev": "Wow...u can wear and carry anything and still look the best", "theahmedgirl": "💋💋", "ametureicon": "@charlieputh doesn't know what he's missing out on 😂❤️", "deepalib28": "So so hot and creative💛💛", "gauridatt": "@anukriti_kapoor I challenge you to wear one of these", "prisha_shrimankar": "You're an inspiration to many peoples 💯🙌", "sara_s_p": "Again..a totally impractical content. why your contents these days are so impractical in the real world. Wearing skirt like this with such short length can't be worn on the Indian streets. And if you really think, it's practical, please wear them on the streets and outside first instead of showing and shooting anything in the studio.", "sanghamitra_sarma": "No one can be ever bored watching you over and over again😍😍💕💕💕", "taniya_chatterjee95": "❤️❤️😘😘😘", "sakshipanwar3089": "Uh so hott🔥", "mrs.mridulsharma": "This is so creative 😍 Love it ♥️", "passionate_priya": "You're very skinny that's y these styles suits on you... But we'll look vulgar if we try these styles...", "zilshah25": "Dude u are really talented and smart.. xoxo", "kiranpandeymyname": "No komal,not relatable😭😭 it cant be worn even inside house... So so so jugaadu and uncomfortable", "prekshaira": "I like all the clothes. Plus one thing that I like about you @komalpandeyofficial that you keep using the same clothes in different styles. P.S can you please tell where did you get that white purse in your first look in this video, it's really pretty.", "wall.flower123": "We're home and we're crying because ICSE exams just got postponed.", "uj_wa_la_rr": "Komallllll! 😘😘♥️♥️♥️", "boho_gram": "Loved it! 🔥", "siddhisamel": "Amazing💙", "alishu_sharma": "I didn't like it ... I can't wear this anywhere comfortably even at my home😝😝", "hot.cupid14": "Seriously mam you are so creative ❤️ aaj tak itna stylish nahi dekha mene🤗 @komalpandeyofficial", "diwandeepa": "From where did you buy this?", "shashiisha9": "I wonder how many people actually follow these!!🤨🤔", "masum_adah": "Well I can't wear skirt like this .. so it's not relevant for us people.. it's probably celebrity style ❤️ then it's good", "ankitaagnihotrilove": "Your creativity💯", "_janvi_2409": "Damn!! Only you can do this magic with this wrap skirt😍😍❤️❤️ @komalpandeyofficial ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "rekha_simha": "Coronavirus won’t survive with this hotness, go kill it girl😍", "fernandesridge": "You a TALENT babe ❤️", "tanya_rashid_khan": "White pants are from???", "satveer_dhillon2": "Actually impressive 🤍", "diya5354patel": "How get better everyday?????", "shanaya_khan1212": "Plz do a video for everyday casual looks .. that would be helpful @komalpandeyofficial", "preachblue": "You need to start giving outfit information as in where exactly you purchased each item from. 💛", "_dhrii_13": "@komalpandeyofficial why so gorgeous ♥️😭😍♥️♥️", "radhu25": "Yes i loved your style on wearing skirt like this but its quite complicated on how to wrap it please let us knw that how do u do that may be it will be helpfull for me as well as others😍", "dream_girl_shreyoshi": "Didi u r awesome.... your videos make my day.... plz keep going.... make more awesome videos.... love u❤❤💋💋💋", "swati_r_singh": "How talented are you!", "_vanshika_22": "When will you stop slaying😍🔥...So good 👏❤", "simi.travelogged": "The one with white shirt looks great😍", "edgability": "You beat Netflix ✅", "chubbyandchirrupy": "How come you come up with such amazing looks 😭😭😭❤️❤️❤️❤️❤️", "mussooriethequeenofhills": "Can you pleaseeeeeee please make a video of what to wear with leather pants, for tall girls and heavy chested. Please! Winter season.", "my_resonance": "How do you rock all your looks❤️", "kavyaa.v": "Give a 11 out 10 for your looks😍 but it is not simple for everyone to wear such type of extremely fashionable clothes in real life or when you go out so if you're on a public platfrom you're giving such awesome content please also do some content which is possible for everyone,like your kurta ones are damn good and the power suit ones they are amazing do something Like that😘", "leyenodyuo": "Hi Komal,,,,, love from Nagaland actually I’m a fashion consultant in Promod Brand so, the collection is all women’s casual wear ,,,,, so do u have any idea how to suggest the mix n match prints ❤️❤️❤️", "rashika.chadha": "Please make content that normal girls can relate to easily. This is good only for instagram, not in real life. Do stuff that is real and relatable, not fake.", "allabout_bloggers": "Hey, love the concept and everything and the amount of effort you put in, no doubt on that. But it just seems impractical in so many ways, even your 1% of follower's wouldn't actually try these. Also whenever you do such videos we know prior as to how you will drape it or rather add an element to it if you know what I mean. It's just getting repetitive. More realtable content please 💫", "aakritiisharma_": "Hott🔥🔥🔥🔥🔥", "thealmahamid": "Thank you for being my inspiration! ❤️❤️❤️ Love you! @komalpandeyofficial", "highinvogue": "😍😍🔥🔥", "urvijain205": "Simply wow!!!", "____shizuchan____": "Wow❤😍 from where did you get that white pant ?", "vrulliam": "Wow nailing it ✨✨✨", "be_ew_ty": "Your ideas are'nt worth seriously no other will be comfortable at doing this.", "arushichoudhary1": "@an_ki_ta_ @riya_rns", "itsmebhvya": "Love u always 😭😭😭ur the best❤️", "rup_sha_b": "U r a delight to watch❤️", "coffeezara": "nobody’s gonna wear that outside", "ayshu_shaik": "The way YOU play with COLOURS....ufffff! Love it!❤️😍", "aasthaaa11_": "Komal🔥♥️", "gypsygirlsoul": "Tried in Hollywood? 💞", "theunpredictableme03": "Only you can wear it....do not say that it is going to work for everyon ....big dispointmen👎👎👎👎👎👎👎👎👎👎👎👎👎👎@komalpandeyofficial ....", "smriti_xingh": "Diva 🔥", "roshogolla___": "Please make a video on how to sit after wearing short clothes.", "sakina_ibrahim_merchant": "I sometimes feel to kidnap u nd bring u to my house nd ask u to design all my unused clothing which i dnt knw hw to style", "ravzoozoo": "@soniya_samnani20 🙈brooooooo", "ritika_kerketta": "*opens Instagram *watches this video *feels blessed. 💕", "priya.sharma14": "Wohhh ...mind blown 😍😍...you are Sooooo talented 💝❤️", "harshita_srisrimal": "Tooooo gooooooood🔥😍🔥😍", "chitranshi_mishra": "We used to do this when we were kids with some scarf 🤷 and this is something you can wear at your shoots only.", "_binge_eater_": "Legit so good😍😍😍", "bong_gal_mona7": "Omg again bang on with a new video 💕😍😍 slayerr my godess", "teenaa_dagar_": "Out of all I loved this one♥️♥️♥️ how I wish I had that skirt", "__tanuyadav": "Perfect 💯🙌", "akritaaa": "Heyy komal you are very beautiful ❤️🔥🔥", "iamsuhanaaa": "Bhaiya hum laaye kaha se yeh???😂😂💁‍♀️💁‍♀️💁‍♀️ Wrap skirt???", "tanviwadhar": "You beautiful woman ❤️", "sugandhaacharyajoshi": "I used to follow you and always admired your videos .....but you have changed and I realized you were not comfortable with who you were.....which is sad as you were nothing but beautiful........now you really look cheap.....don't feel like watching your videos.", "jainchahat_18": "Damn u r jst so creative💕💕 frm where u purchase all these stuffs can u plz tell me ? Btw u r so hott🔥@komalpandeyofficial", "aishwaryarishiraj": "Loved it😍", "styleyourthoughts": "Killing it my love❤️", "gpriyanka09": "How can you be so INNOVATIVE, dudeee! 😍", "harini_riniha": "@komalpandeyofficial gotta steal your wardrobe 💜💜💜", "akanshi_13": "@pragtirathore", "_npvttt": "This is so good ❤️❤️❤️❤️❤️❤️❤️❤️❤️", "tahira_amara": "❤❤", "sapna_sueno": "White belt look is firee🔥🔥 ..nd ur figure is waoooww 😚@komalpandeyofficial", "aashi____294": "This is just an another fabulous content... @komalpandeyofficial ,Everytime something new we all got to see, I am impressed again.. 😍 and yeah This is all about confident People who can actually carry everything like a pro ❤", "shifa_huda_": "I love you Komal. You are so amazing and pretty ♥️. But now the content feels a little odd, I mean it looks depressing ( just my personal opinion). I just likes your previous vibe more. Anyway you go girl.", "dhirnameghani": "Would like to see abit longer version of every style..", "lil_star_17": "You are just fab😍❤️", "vidushirastogi1708": "Those earrings with green beads, where are they from? Remember seeing them in your florals video too, they have my heart!", "monaakashfree": "Appreciate your originality#creativity#efforts#🙏🙏🙏", "chitrraa": "Superbbbb", "hellyjooseph": "Last one is fav 💖💖", "2005_tk": "Cool😎", "shes_mess": "Where do Introverts wear these?😬", "maleehazareen": "You make it look so easy💕", "abiraa_i_am": "I knew this was coming", "damsel.in._dystopia": "Thank God u mande this🙌My skirt had been .. laying around for a while, planned to get rid of it. Not Anymore 😌♥️", "manjula.basak": "🔥", "dhritisharma1607": "You are inspirational 🤗❣", "sagrikaaaa.___": "You are so talenteddd!!😍♥️🔥 @komalpandeyofficial 💕", "nidhiikshirsagar": "How amazing are you ? ♥️", "recharging128": "You r so perfect i love it 💗❤️", "mysterieux_25": "Such a stunner ❤️❤️you are .God bless you always 😘😘😘", "aggarwalkritika4": "Goddesss💓 @komalpandeyofficial", "dr_guppy": "👏 appreciate your ways of making different ways of using clothes lying in closest 😊 yes according to comfort we can add on shrug , stocking etc and look different but comfortable .❤️ your fashion therapy .", "dipanshi.gautam9": "None of the girls like us would wear it on a daily basis..it is not atvat wearable....plz make some iseful content ..we r not.a fashion blogger like uh", "nisheeta_harchekar": "Queen🔥", "nidhi_artistros": "Nice outcomes, but one can't follow \"how to\" replicate it. Your earlier videos were easier to follow in that sense", "ankitha8991": "This is great!! Where are the white pants from?", "anugupta26": "Creative but how many are actually wearable in public... most of the styles ended up being so short that i dont even know how someone would sit wearing this. Though the last one was bomb 💣 😊", "rajshree.jajoo": "And also the white long shirt", "ownworldxoxo": "Where did you get those white pants on the last one? 😍", "_sreechakraborty_": "Stoppppp 😍😍❤️❤️❤️❤️", "manali_kp": "🔥🔥🔥🔥", "priyanckagada": "Wow! This is so cool! But can u show how u did the last two drapes😊😊", "sakshiboolchandani": "@komalpandeyofficial pleaseeee stoppp😭❤️", "swati_0620": "very classy", "carry_d11": "Basically, all ways to show your undies to the world.", "navya_alishala": "Is there anything that you cannot do?❤️", "sukh_maan_k": "You are from another world 😍😍🔥", "aradhana598": "The one with the Blazer and Pants!!!! 🤩🤩🤩", "palakwithpaneer": "The third and fifth look though💕😍", "chanicedavine": "Stop wearing so much make up be more natural", "_epinard_": "how how howwww", "dr_bandita_rani": "You are a GEM 🔥", "rochanadudwadkar": "2nd, 4th and 5th❤️ 2nd was so HOT 🔥Loved this ❤️", "twentiees__faith": "Another level💋", "ethereal_55": "How can someone be so perfect in every manner ... Keep doing this ... We all love u ... And appreciate ur worj", "sarita__k": "Absolutely not", "sanchi_chhabra": "Hi @komalpandeyofficial, I'd love it if you could also make videos for busty women!", "ur.looking.at.me": "Hot hot hot 🔥🔥", "smritigakhar": "🤗🤗", "kinjalmhta_": "You're really creative!", "mansibhatewara": "4th style🔥🔥😍❤️", "shwetasofficial": "Hey komal!! Your every fashion therepy video inspires me..hope you'll post more like this💝💝", "dollylalwaniblog": "🔥🔥🔥🔥🔥🔥🔥🔥", "appycrumble": "Q ● U ● E ● E ● N", "tanusreehalder__": "Wooowwww😍😍😍♥️♥️... girl I'm in love with your creativity😍", "udenla_bhutia": "Wowww you’re just amazing 😍😍 your makeup, the way you play with your clothes 🙏👏🏻👏🏻👏🏻 Just Wowwwww", "mahima_yadav3": "Omg 🔥🔥🔥🔥🔥", "kajal.sharma1195": "Hi Komal.. loved this video and all the looks...can u plz tell where are all the garments from...espc those awesome bodysuits and the white wide pants and shirt dress...?", "po0ja_sharma_": "@komalpandeyofficial you are so beautiful 😘 I love you", "styleit_desi": "Hottie😍", "punyarthi_nikita": "Really impractical", "iamstillfiguringitout": "Honestly, except for the last outfit, all of it looks very tacky and the fabric has them cheap feels. You could do better hon", "radhika_chanana": "Damnn gurll🔥 how can someone be this creative♥️", "d__shahaha": "❤️❤️❤️❤️🔥😍", "nitika.sahni": "You look so pretty❤️", "siyarai28._": "Dii u r my favourite ❤️ Your talent is amazing😍 I tried to do your style once and it came out so good for me❤️❤️ Love you❤️", "sharmi_889": "Tune name ???", "vidushisaran_": "Omg! I'm crying 😭😭❤️❤️ you beauty , I really adore you and your positive vibes . The way you carry your outfits and yourself my goodness 🔥 BOMB!", "sizaa92": "Wowwww", "sweta_harish": "Wow 3rd n d 5 th look !! Gorgeous you are girl ❤️ @komalpandeyofficial", "sonia_joshi_": "Sooooo good always 🙌🏼🙌🏼", "shrankhalaparwar": "Omg ..you are genious😍❤️", "dr.bushramirza": "@dishajain888 - try with your wrap around skirt! As being quarantined! 🤣", "_inayatgrewal": "Are these styles comfortable as well?? To wear fr the entire day", "milburn4195": "❤️❤️🔥🔥", "the_unapologetic_virgo": "Diva😍😍😍.... whatever you do turns out soo well on you😍❤️", "wasnik.riya": "Woaaahhhh😍😍🔥🔥", "ashnahjoyy": "Hey Komal! Love your each and every style. I watch your videos 24/7 and your style is WOAH ! As being a teenager I really want you to show us some aesthetic teen looks or some simple looks. Also I know you LOVE glam looks *so do I but can you show us some natural makeup look ! Again you are STUNNING and again inspiring 200% ! love you a lot 💗 I hope you have a GOOD day", "kaayum_07": "Sizzling 🔥🔥🔥", "prernatiwari19": "FASHION QUEEN ♥️👑 Nobody can ever be as good as you 😘💥🙌🙌🤩", "tinyy_human": "still wondering where can i wear them🙄", "mostly_savvy17": "Aag🔥", "dreamy.lisa": "Omg❤️", "herefortea1": "Amazing how she can turn a piece of cloth into such brilliant outfits ❤️", "missflorocina": "Wow😍😍😍", "oyendreela_shreya": "Ur 1st look is soooo🔥... BTW where's ur shirt dress from? @komalpandeyofficial ur just so inspiring di😘😘", "froogal_fun": "Looks so good on you 😍 are they comfy? I feel like I would forever be cautious of it slipping out if I end up wearing a skirt in all these ways 🙈 kudos to ur creativity", "fashionistaspeaks": "Love the idea babe.. superb...always love the way you style your outfits !!!", "sneha17.10": "You're literally so so so so so so so soooooo creative ma'am. More power to you. 🌹🙌😍💓", "stylebysindhukaran": "Uber cool🔥🔥", "sonali.bpd": "NOT EVERYBODY HAS THAT MUCH AMOUNT OF CONFIDENCE YOU HAVE KOMAL!!!😍😍😍😍", "mariamshkh": "#4 is my favvvvv🤍🤍🤍", "manpryt.arneja": "Your dedication and efforts actually made me your fan! Thanks for inspiring all of us!! Keep that zeal alive!", "gargi_gadgil": "Slaying komal dii🔥 as always🔥", "priya_kandagiri": "🙌", "janakivarne_": "Self quarantine at home,binge watching all of your therapies and saving the looks, for trying it soon.!! ❤️(hopefully very soon.! 🤞) lots of love komal❤️.", "jain_ishika10": "🌹❤️", "aashika_vinod": "♥️♥️♥️", "pallabi3696": "😍", "_rishitaaa_": "These videos make me so happy. 🥰🥰♥️♥️", "_babexo_": "CEO of looking good in everything 🔥", "ishika_balsamanta003": "U GLOW GURLLLLL 😘😘😍😍💞💗💗😍❤️😘", "my_sparklingstar": "What lipstick did you use? ❤️", "archanakayarat": "These are great but when you say ways of wrapping, I can’t really understand HOW you’re wrapping. I can just see that you’ve wrapped but I will never be able to do it because I don’t know how you did it. It’s not clear. Maybe elaborate more on how you’re achieving the look :)", "deeptisinha_ds": "I DNT think few outfits cud even b worn on practical basis outside. 🤔🤔🤔", "sohelasabrin": "Hiee komal mam❤️", "aditasweet": "I wish I was as thin as you", "sumedhaaaaaaaaaaa": "Pink blazer from...????", "_ashmita98": "You're everything. PERFECT ❤️.", "aditiaggarwal79": "QUEEEEEENNNN❤❤❤", "sonisingh0626": "🔥🔥", "vaishali_s143": "Plz tell me where you got that white-shirt-like-dress😅😅😅😅😅...sry i dont know what that piece called.......... Going crazy over this whole look😍", "ambica._": "Fourth look got me like🔥🔥🔥", "love_yourself_1312": "This is soo good!!.. You always slay.... My queen💜💜💜💜💜", "_rubaa_x": "So gorgeous!❤️", "priyanshhi_globetroller": "Can you do styling on heavy figure girl, that would be helpful for most of the girls like me but with less exposure of skin please @komalpandeyofficial I love the way you style 😊", "_______riya_": "3rd n 5th♥️", "thewritething123": "Beautiful", "quenf_hell": "Whites look very pretty on you❤️!!", "shruti796": "So creative. Can you tell me which pants are these. Look lovely on you", "ramandeep_sethi": "It looks too good on you ♥️ Can you suggest something like that for women with belly pooch?", "sujeetxgawade": "Queeeeen❤️❤️❤️", "hemanshiwahii": "LOVE THIS😻😻", "_yeshaaaa_": "This was tooo good 💙💙💙", "ayushhomeopathyclinicofficial": "🌻🌻🌻", "anisha_paii": "Love the last look so much ❤️❤️❤️❤️❤️", "aakrati.01": "Why so talented🔥🔥", "manya_mehroliya": "Loving the looks....third one was my favourite 😘😘😘", "incendiary__ishuu": "U r pro... Love u lottt ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "fizzy_520": "Slayerrrrrrrrrr🔥🔥🔥", "appusaurus": "The last look is so elegant and classy😍🔥", "vivekyadav123456789": "Practically not possible", "aanavigopal": "You’re an inspiration!!!", "maitri_rathod_05": "Loved it!!!! Here is a suggestion u mjst make a video dressing up as friends characters !! We all are huge fans of friends and so are you so u should definately give it a go!🔅❤", "poorvasalunke": "You are soooo talented😍😍😍❤️❤️🔥", "wittyandwhiny": "How damn gorgeous", "__manishaagarwal__": "❤️❤️", "prekshathakkar_9": "amazing 😍💥", "stumble_fumble": "What is this nice music🔥", "thesweetluxuryblog": "I love to follow all your styling tips,but bit sad that you dont smile in any of the videos.I found very few of your posts smiling and believe me you are the prettiest.Like the bold attitude but please smile for us.❤️", "the_lazygrammer_": "The last one is amazing! Would totally try that out...though I am unsure how it would look on my plus-size body! But definitely trying it out!❤️", "vyshnavisavanth": "You’re amazing 🙌 😍😍😍", "vibibliography": "Heyyy I absolutely love your work! ♥️I have a problem-I really want to wear ties but I have absolutely no idea HOW to style them. I mean what kinda outfit with what kinda tie. I really want to see you make a *5 ways to style a tie*. I am probably not making any sense, but can you please think about it? 😭😭", "bishtpinky": "Oh gosh❤️", "kanchanmalasengupta": "Is there anything which you can't do? 😮😮😮", "nuna__gurung": "Fashion ke nam pe kuch bhi 😦🤨🧐", "arpita.tamrakar": "How someone can be so innovative 😩💕❤️", "vaibhavi_sathe": "3rd and 5th one is my fav. Especially normal people can also wear those who think they cant😍🙌", "kompalmohindra": "😍😍😍", "_prachi.22": "Always with a bang 😍love you @komalpandeyofficial", "durbhagyata01": "Can you not be so freaking hot! 😍", "shahin___sheikh": "Oh my myyyyy🔥", "naaaiiinnnaaa": "You have my hearttt❤️❤️❤️", "swatisharma12": "Not practical at all ! 🥺🥺", "bhavdeepnama": "Marry Me 💕", "sonali.sk": "Such fun 🔥🔥🔥🔥", "poppiclothing": "Where’s that white long shirt from?", "priyashi_yadav": "I think in this video you could be lil more clear on the steps your wrapped the skirts ..first one was clear but the rests were not.", "catastrophe._._": "Woah!! 🤤Your just amazing....suchaa girl boss🤩....i really like the way you keep experimenting with your style 😍... honestly your just slaying it✨🔥..nobody does it like you do...loads of love❤️", "19vaishnavi": "Omg i just loved it!!!♥️♥️", "fattybaogoesplaces": "we need a tutorial🙌 please", "boho.amelia": "Ohh my god to much ❤️❤️❤️no one can beat you in this world 😍😍😍😍", "dr.riya.soni": "U have done it beautifully 😍😍😍 I love each and every look but the sad part is that I can't wear this n go out😍😍😍 so i wish u can do put a video in which we typical indian girl can wear this.... BTW I really really love each n every look wish I could wear like that and yaar the last look with the white pants was my favorite😍😍😍😍😍😍", "_karuzzzx": "Would I get a reply?🥺", "alka_rajpal": "Could you please do some styling videos that normally we can try and do. Because usually dressing like this we cannot go out, I mean no offense to you infact I love your style but I'd really want you to give some styling tips so that people like me can relate to!", "thisstylediary": "Never thought of this", "shruti.soni18": "You are a Queen❤️", "titikshasaini": "You never stop working... This really inspires🙌", "ambika_negi10": "@laughing_dua look at em DYI for your 'wrap around skirt' 😛", "all_that_glitters_upsc": "Di it is justtttt.....mm but can u teach us the ways you wrapped the skirt??? P.s.- you are lovvvveeeeeeee❤️❤️❤️", "theshikhadose": "Love all the final outcome outfit ideas..on you!! Not sure if they will look good on all.and will it be okay to wear such short dresses outside 🙁 I also love wearing them, but get littler worried coz of weird people outside.", "kamya.ram": "How do you manage to tuck in so much fabric without looking like a potato 😭 It's always a struggle for me. Where'd you get the belt from (2nd outfit)?The 3rd-4th outfit 🔥", "chelsea_rozario": "The second outfit with the white belt , made my heart went oop ♥️,love the video 😍", "stutygupta": "How you do this so perfectly?? So confident! Sending you lots of balloons to you(because hearts are cliché)", "priyankaverma738": "Love the last one.. One with the pants.. Love love", "monicakanan": "Only @komalpandeyofficial can style a skirt in this much ways 💕🙌", "akansha_smita": "Crashing it💔💔", "itsma_mata": "👌😍😍", "raga_priyaaa": "You brilliant boss babe", "mostlydreamy": "Girl you are dripping elegance🔥😍❤️", "bigf.exe1234785": "🥇🥇🥇💘💘💘💘", "bearhugsmunchkin_neha": "The third and fourth took away my heart .. ILY 😍😍😍 @komalpandeyofficial", "loads_caliber": "And girls with traditional family can't wear anyone of them them🥺", "poojaa_2316": "❤️❤️❤️❤️......", "thecheshtabatra": "@komalpandeyofficial Need a proper video on how you styled these❤️❤️ Also, where is the skirt from? You were downright Awesomeeee", "priyanka.bindal": "U r international", "plumskinned_skilledbin": "Love this", "tuzo.pandey": "Ufffff 😭😭😭😭😭❤️❤️❤️❤️❤️❤️❤️❤️❤️ so haaaawwwwttatatatatatat", "aashnaa_kapoor": "Woahhh! Love the second look😍 where is the belt from?", "tee_cee98": "kaash mein patli hoti yaan shape mein hoti toh ye sab kaam aajata 😂🤦🏻‍♀️", "mian1317": "You are love ❤️", "moumitachanda91": "@riyaoleman 😁😁😁 plz try these 😁😁😁 but only during quarantine.", "keepingupwithkaran": "OH MY GAAAD! 😍 You blow my mind!! 🤯", "haimwn_27_illustrations": "Just loveee it!💖🙌", "_the_gypsysoul": "The most needed therapy that we wait for. You are an absolute gem. ❤️❤️❤️", "rupi_07": "You nailed all the looks. And if I'll try these I will look like a potato!😂", "imvenu": "OMG.. ❤️❤️ Loved it.. please let us know where u got that white shirt pant and belt 🙏🏻🙏🏻🙏🏻", "sonalaries_angel": "Half of it is not feasible fashion ..try being more practical rather than just putting some stuff out", "_megha__shah": "Can you just stop it komal , you're blowing up minds now 🤯..... But seriously , Much Love to you❤️", "v24jv24j": "👎👎👎👎👎👎👎👎👎👎👎", "srissbeauty": "You can nail any piece...❤️❤️", "rbs._.0": "Is the white Zara trousers this season?", "aditi._j": "Much needed video😍😍😍😍", "neelushakya": "Where are the white pants from? My jaw drops whenever I see it in your video's.", "__shrutikhandelwal_": "My loveeee❤️❤️❤️💋💋💋 uh look so stunning in every outfit🔥🔥💯 @komalpandeyofficial", "eliza.pandey": "Would love to see an elaborated version of the same!", "chetan_singh87": "Awesome videos..u r a true fashionista", "creatively.capricious": "I have been really keeping up with your videos however one question keeps on bothering me, that fashion therapy that you do, is that for you or for the audience?", "aka_nsha_": "Divaaa🙌", "soumyaa_srinivasan": "Fire 🌸🔥", "malz3007": "All these can be worne during quarantine only😜 Never seen you yourself wearing lot of these hideous mix n matches when you party!!! Usually in all of your such videos just one or two are hardly wearable that too who have bodies to carry such outfits!!!!", "shalinisinhaaa": "saved 🖤", "diksha_1799": "Youuu gorgeoussss laddyyyyy💓😩😩😩😩", "shamanaz59251": "Woah...you rocked it!!!😘😍🔥❤️@komalpandeyofficial", "iammanjary": "I love the way you layer things up😍 so crazy yet so smooth🧡 you’re amazing 💜🔥", "manishaarawatt": "Lovedddd this one ♥️💯", "prasannaa_b": "Love love love😍", "sejalgarg26": "Oh my god.... gorgeous🙈♥️♥️♥️@komalpandeyofficial", "charumizz": "Only a one word 'wow'.", "disharipathak_": "Whattt *_* how do you do this? I mean... How can someone be so effing creative?? The point where a lot many creator's creativity end that is the point from where you start @komalpandeyofficial. You're gorgeous 😭😭❤️❤️❤️", "safalta_chalise_": "You na!!😭❤ btw what's the reason behind this beauty?😒❤ you made my quarantine better ok 😍💓", "mehaakkk._": "This was truly amazingggg😍", "shireenk347": "Komal!! U always pull it off! I love your fashion sense! U inspire me to be more creative and don't even get me on how many times these outfits have helped me! I love youuuu♥", "rhuta942": "Can u make styling tips which would suit other different body types please (like more for +size )", "pritikaarao": "⚡️⚡️⚡️⚡️⚡️⚡️", "naveena_rinkie": "Ok Komal!! Now tell me, what is your secret ? How do you get these creative ideas ? Every video that you post is innovative. Hats off!", "nidhii9": "Trust me you can even slay in a boora (jute sack) 🙈♥️♥️", "nishakankaria": "@shabnamjain", "mehar_khan121": "Only you can s🙌🙌lay it", "riyakkapoor": "Love ❤️", "hritijerath": "❤️❤️❤️❤️❤️❤️❤️", "shivani_nagrani": "Simply awesome 💗", "_thesweetestharmony_": "Which song", "aparna_m99": "Omgggggg I m star struck kween🌸❤️", "nautanki_much_": "Hi Komal, loved the ideas but also while the ideas are great and I would totally love to do it. I don't know how to, also it does look a lil complicated to me, to do all this out of a skirt. Maybe if could explain that in one of the videos that how you tie it in all these ways. Also since, it's an unconventional way of wearing a skirt, it becomes hard to look up on the internet too.", "radsberry.14": "Great as always ❤️ btw, where is the skirt from? 🤔", "siddhi_deorukhkar": "I loveee you komal 🔥❤️ such an inspiration !!! Can u please tell where can I get a playsuit from ??? ❤️@komalpandeyofficial", "quirkishqueen": "Loving your fashion therapies 👌👌👌", "neel_gahlyan": "Kuch bhi😦", "unnatigandharva": "Oh gosh😇😘😘", "nainasahney": "Too much.", "yashikagurung": "Ayy love itttt😍💣 You are so stunningggg, Komal🔥❤️", "amayradongreofficial": "Oh my goodness♥️🥺", "mostly_aditi": "You should think of starting your own label for clothing line now 🤗 Super fun and cool video ! 💋", "shrrutisingh": "😍😍", "naira_sareen12": "Wonder women 💯💕", "_rashirana_": "All these methods are good... But you should also share some ways which can help others too... Like not everybody can wear clothes this way... Different people follow you.. and we hope to see some content which can be beneficial for us too...", "radhikaasharma529": "U killed it🔥😍", "udita_ghosh2003": "Oh dam. This is lovely girl @komalpandeyofficial", "aakrish_amgain": "You’re the only person with the most AMAZINGGGG collection of accessories. I mean bags, earrings, belts and necklaces😍 my god they’re so beautiful!!! 💃🏻", "_____preetyshine_____": "Greatttt💗✨Komal😍😘💋", "_smalltown_gal": "Hey favourite♥️😍 3rd and last one🔥", "passionistamakeupartist": "💗You are killing it girl❤️", "akanksha2112": "How can you even think of such amazingly awestrucking ideas??? Are you from some other planet 😍😍", "soundarya_sa": "Why are u so talented girl?", "jokeski.duniya": "Corona 😒😒😒😒😒", "srushti_kudale": "MY MY MY😍😍😍", "nehapadviofficial": "Girlll always rocking😍💕✨🔝", "siddharth93batra": "Wrap it all, my lady 🥤☀️", "pratikshade": "🔥🔥🔥🔥", "_miss._.bagmita_": "Mummy Maaregi. 😂🙈", "that_punjaboo_girl": "🤤🤤🤤😘", "shweta_mishra_98_": "Oh god. wow. 😍", "kairavirk": "I wanna try this. All of them are fab😍😍", "shreyasingh1824": "Obsessed wid u🥺❤️", "peecee333": "@niharika845 pls make me understand", "afreen.hasan7": "Gorgeous as always 😘😍 @komalpandeyofficial", "iammadshar": "@komalpandeyofficial not everyone is blessed with perfect figure like you..🥺", "priya.9580": "Anything for content.👏", "aahelidasgupta": "Number 5 is so stunning!", "_snigdhamaity_": "All ideas were justtt fabulous🔥❤️", "_nayana_dey_": "I mean.....how you do THISSSSSSS😍😍💕 ILOVEYOU💕", "ritumulchandani_": "This is insanely creative 😍🔥", "shrutibarsainya2801": "Thank you for such amazing content @komalpandeyofficial 💕💕💕💕", "girlintheeatery": "This is something cool Will it look on a healthier body type?", "pixiiiieeee_dust": "@komalpandeyofficial the last one😍😍❤️", "mdnasirkhan1697": "😍😍😍", "amisha_tyagi": "Love this, gonna try it for sureeee❤️❤️❤️", "the__pooja__3456": "💗💗", "bhumika_lingwal": "@komalpandeyofficial you're gorgeous.. love your therapeutic fashionable ways♥️♥️ best thing in my self quarantining life!🌸love you", "mhktilwani": "@komalpandeyofficial omgggggg this was so so so so so so so so so so so so so so so gooooodddddddd😭😍😍", "itsprachisethia": "Youtube misses you @komalpandeyofficial i love youuuuu😭😭❤❤❤", "myeemanyloves": "So soooo good👌🏻", "yukatee_singh": "Queen!! 😍😍@komalpandeyofficial", "aadishree.k": "YOURE SO BEAUTIFUL, SHARE SOME WITH ME😭❤️", "_the_bad_reputation_": "This was awesome ....someone who can do this in quarantine 😍😍😍😍@komalpandeyofficial 💜💜", "riyaa._.20": "😍😍😍😍u are smazzzzinnngggg....love uuuu😍😘", "chhayamulani": "Creativity level ❤️ @komalpandeyofficial", "upasananananana": "You GLOW WOMAN", "kamyasingh._": "Brilliant yet again🔥❤️", "rj_meghaaa": "That's amazingly ♥️😍😍😍", "mahima_singh__": "😍😍😍", "palakmishra_04": "Why so perfect..????😫😍♥️", "kanikanarula_": "Loved it, as always. Creativity on a freaking new level though. U make everything look so classy.", "chaitali.mehra": "Hey girl, u r amazing😍 please do something for office wear type", "sujatasharma06": "Omg!!! Komal I love you 😍😍😍😍", "_komalmittal_": "I just can't stop watching you 😍🔥", "the_cartoon_yogini": "Wow! 💓💓💓💓", "dimple_batta": "😂😂😂😂 Kuch bhi", "_navanaa_": "Goddesss😍😍😍 of fashion fr us❤️❤️", "geetanjali1901": "Jusstt wooowww😍😍😍❤️❤️", "darshanarramgiri": "I love you komal😍😍", "evangelin____ekka": "Komal, i love you. How creative you are!! Fashion iconnn...", "_nbagri_": "now this is a real good stuff!! @komalpandeyofficial such a diva❤️", "vidhisha888": "Hey❤️❤️❤️😻@komalpandeyofficial", "rakemaster3": "Stunning 😍😍", "samridhii_b": "you're incomparable. stay safe btw. much love. ❤", "surbhii_24": "Komal, what about us fat girls? Please do something for us too na! Anyways love you ❤️", "khurana.ji_": "Queeennnn😍😍😍😍", "nandini__rj906": "U r amazing🔥🔥🔥lots of love to u..... @komalpandeyofficial", "_dark_sugar_": "Last look is fabulous ❤", "mansiie2": "You are an angel.", "_rittii": "Where did uh get that long white shirt from???😻😻😻😻", "illusions.44": "Beautifull favvvvv.💛💛💛💛💛💛💜💜💜💜💜 komal you look stunning and your work is superb", "tanyashrivastavaa": "😍😍😍loved it, love you😭😭", "get_your_love_back_219": "महाकाल की⚡शक्ति द्वारा ⚡दुनिया की कठिन से कठिन समस्या का हल मात्र 7 घंटे के अंदर हम बोलते नहीं कर के दिखाते हैं +91-9024909492 1) वशीकरण के लिए सर्वश्रेष्ठ बाबा जी 2)अपने दुश्मन से तुरंत छुटकारा पाएं 3)अपना सालों पहले खोया हुआ प्यार वापस पाए 4)किया कराया पति पत्नी में अनबन 5)ऑल फैमिली प्रॉब्लम सलूशन #आप_हमसे_धोखे_की_उमीद_नही_कर_सकते_क्योकि_धोखा_धन_के_लिए_किया_जाता_हैं_और_हम_धन_नही_लेते_हैं।#Best_astologay_service, #Instant_solution_for_your_all_problems Call now #dev_sharama_ji +91-9024909492", "girlmax_08": "Nice❤️", "sakshiiii_jadhav": "Gorggg😍😍❤"}