{"liplickerstop": "Beautiful😍And loved the lingerie😍🤤", "kulsoom_khan__": "where do u get your lingerie from its too 🔥🔥😍?", "the_lifetimes": "Lacy bodysuit from ??", "platypusprery": "@tanullukipatthi", "rajpu_hamza": "Hot figure ufff 💕", "wahabamazhar": "Oooooooo maaa girl's looking hot love the lingerie ❤️❤️❤️❤️", "tianaa1246": "🔥🔥🔥🔥🔥🔥🔥🔥🔥", "priyaa_089": "from where did u bought this lingerie @komalpandeyofficial", "eshanandan": "U r soo pretty nd u r inspire a lot of people like uss.. love u a lot ❤️❤️", "masoombharadia": "I have nothing against women showing their bodies and being proud of it. But revealing for the sake of views/titilation rather than because it severs the purpose of art/fashion is so Rakhi Savant. So forgive me if I think this is absolute crass", "aashishshrivastava85": "Shameez hi more than enough hoti🤔", "ryannav97": "So hot 😍😍", "unicorn_naynn": "@irtizahahahahahahhaha", "inkfiore": "Ugh.", "kinza.dhedhi": "@khadi_jaay", "jhakhushboo0412": "Where did you buy this lingerie from @komalpandeyofficial 😍😍😍 Love your work and also love your sometimes Bihari words like Hm instead of mei😅😘❤️All the best for your future work❤️❤️❤️", "aana1089": "Miss the clumsy old komal though 😭😭😭that popxo girl nxt door", "__surakxya": "Don't mean to offensive but showing the your hairstyle can be done on simple causal clothes rather than those lingerie... That's a lot more way to execute those hairstyle ... Feeling good in those appreciative You look confident too Wearing that on hairstyle video lil bit inappropriate", "shania.ahmed9528": "Can somebody please tell me the name of this song??", "bhavsarriddhi": "You are just out of the world .. i have been following you since u have been working in popxo i have seen you growning u have grown so high that no one can match you progress height", "_____.ayesha._____": "@ishaikhraima", "_mandhan__006": "So first i want to make clear that i am not against girls wearing short cloth or anything they want .but showing unnecessary skin just to get views is not cool . Definitely at times you need to wear these kind of cloths for some other concept ideas but not for this one i have many videos of yours in which you have done the same thats not goood and thats my opinion and anyone’s can differ .", "sunaina67_": "Wow that’s some serious cheap polyester lace that should be kept miles awayyyy from hot tools because cheap polyester lace catches fire in a blink #firehazard", "silky_hair02": "Apne parents k saat do a video wearing these bikinis 👙.. I want to see how bold you are.", "preetiparbhot1": "Magical 💫 n u r so inspiring ❣️ @komalpandeyofficial .. All ur videos are just wow ❤", "your_health_my_mission": "You look so gorgeous ❤️", "vidz51": "@neha1011singh", "rridhima____": "Muje samjh nhi aara k log kapde pehen k baal bna kese lete h... kitni sayi baat sikhadi aapne... nanga hoke hi baal bnane chahiye.. that is the only way... #back to aadimanav lifestyle #trueinspo itne lambe kesh h aapke kapde pehen k toh bann hi nhi paege 💯💯💯", "shadesofan_artistt": "You are simply gorgeous...youu make me smilee ❤️❤️", "anjaligautam02": "When you make you tube videos again?", "instamo_2006": "@mallikachakrawarti", "___binal___": "Seriously u look donkey 🐴🐴😂", "shanaya_sshh": "🔥", "nikita.k_____": "Can we get 2015 look vs 2020 look?", "sanjanaaaaaa5": "Tired of cing u in chaddis n bras", "_beeer_lover_": "Are you @ipoonampandey s cousin ?", "_kirtika_": "Instead of hairdo your lingerie is much showcased🙄", "manvivinod": "@kartik_9 fav song", "wayisni": "Love it❤️", "sea.n.tea": "komal u got the best fashion sense ❤️ hittinn follow", "nikhilrampal": "Music courtesy: Wait a minute by Willow Smith", "hamayal_fatimahf": "Balon ki setting me kaprey to theek pehno na😶", "singh._divya": "Not sure why it was required to do this shoot in lingerie 🤣", "_madhu_smita_": "I really used to like your videos and glam. But somehow it’s all plastic now.", "i_aochipongener": "Where can I get the mythic oil?😍", "misbahasif10": "Komal you look awesome when you lagh", "baracksunaina": "U r an inspiration komal di❤️", "kirantribhu1": "u hav left no surprise wen it comes to ur body😅 very gutsy", "pj_sab": "Too caky", "vibespring": "🔥🔥😍", "be__e__ma20": "This is not the komal old komal is beautiful", "archhhaa": "@meghana.hegde literally the same video could have been done with clothes on though 😂😂😂", "_simran_taneja_": "Like always treat to watch @komalpandeyofficial love u", "krystal.looks": "alwayss more cheap and less classy, u got no descency girl. #jaloos", "_medha______": "Damn!!❤️❤️", "chawdahemika": "You’re unbelievably gorgeous 💖💖💖💖 love your work Komal.", "xgt11_private": "You look hot af❤️🔥", "harry__len_": "Ur outfits 😂", "sadiakhansk": "Honestly while watching the video cudnt keep my eyes off you...even for a second.... Cz you are too gorgeous and also your recent fashion therapy game is just another level of creativity....bt uff wen I landed in the comments section☹️...all I wud say is it's rightly said beauty lies in the eyes of the beholder! 😉", "progressnigam": "😘😘😘", "khyati_arvind_nisar": "So proud of you Komal.It takes a lot of guts,time and effort to come up with such good content and executing it this way.Soo glad to see you make such amazing videos with so much confidence.Keep the amazing videos coming.Always here to support♥️", "indian_deis_food": "😂😂 Ur outfit .. U r crazy..", "komal_lifeline": "Mineeee", "jayasingh2279": "BLACK 🔥🔥🌌", "shreya_em": "Insanely hot! 😳💕", "shilpi.reang": "Delhi's only cool bcos of you @komalpandeyofficial ...u seems to be nice person always replying to everyone comment. I see that you are a brand today. Every girl in Instagram are really inspired by you...atleast they tried to come out and make a video like you...I also like the fact that one need not be a model or celeb to wear anything they want. Trust me u r my fav girl in internet. Keep it coming...we r watching you. Wish you more success ❤️😘", "____.sweta.____": "Ki hadiiiiii😂", "sathi1787": "@violet_wine", "xxriyapatel": "MAH KOMAL YAS GURL LOOK AT THAT CONFIDENCE ILY😻", "dhwija_22": "Komal i love u😍😍 i think u r the coolest ever..💕 keep going❤️❤️", "_that_quirky_miss": "Hey Komal.. what have you done to your upperlip!?! it looks so abnormal to be honest.", "iraijaz_afzal": "Broken doesnt mean wo apna kam chor de . Ageeb haters hain kasam se .. atleast efforts dekhen itna hate milny k badh be apny face se wo pain na show hon dena aur professionalism dikhana bhut bari bat hai. Itna hate mat den koi mentally dis balanced hojae aur suicide tuk pohnch jae . 😌😌 you re love @komalpandeyofficial", "ayushi_1704": "Its not about 'feminism' but sometimes little mistakes make YOU look like very vulgar. It looks like ADD.", "coffeezara": "girl your hairstyle is boring it needs to change", "simranpunchhi_": "Slayingggg as always 😍", "mridula641": "You are sensation on instagram..love you ..Perfect ❤️", "saily__a": "U resemble Victoria Beckham 🔥", "_anjali_poddar": "U are looking really pretty in this video", "nana7teen": "This hairstyle doesn't suit u but I look so stunning in straight 😍😍😍", "pall_avi": "@komalpandeyofficial Hi Komal! Your post are beautiful and genuine ✨ I wanted to ask whether the lingerie on the site you have mentioned is true to size?", "anushkabhadauria": "Love Love love 💋", "piku_sinha_": "@komalpandeyofficial omg just look at you gurl how beautiful you look, I just can't take my eyes off from youuuuuu, U know I just love you the way you are keep it up u rly inspire a lot of girls and plz let people bark actually thy dont have to do anything thats y thy are simply ruining others work some people toh cant even stay at home and giving lectures on social media hahahaha 😂 how funny.....", "nikita.chouhan93": "I like what u wearing 😍 Can u tell me where u got it from? I would also like to buy it", "sarraf.anjali": "Aayese kapde phn ke vedio banayenge toh hairstyle pe dhyan kaam aur lingerie pe dhyan jada hogi didi🤣🤣🤣", "drsuchitahalli": "💖", "nagori_priyanka": "Dysonhair product is very costly .. so many girls can't afford it", "moyee_14": "Hey komal! The video is absolutely beautiful and also, keeping aside the worthless comments and remarks cause' they aren't worth our time and energy, the lingerie is to die for❤️❤️❤️ I always keep a note of your collection and find them out online. It just gives such goddess vibes and just lounging around and being amazing, I'm sure you'll relate to it.", "pforpooja_": "You’re so inspiring 😭♥️", "sanchitagesu": "So monotonous! Same hairstyle, same type of clothes, same expression, same lipstick !", "sonal.chadha1": "Yuck", "poonam.manick": "Loveeee ❤️ Just posted a video INSPIRED by you And @masoomminawala ! Thank you soooooo much 🙏🏼😘😘", "sarah_sanate": "Always my inspiration since popxo", "flaws0192": "Really mam you are so inspiring person in my life❤....your journey and everything....and you are really a leagand with no attitude😍👏....love the way you are😊......😍😍😍😍", "new_paidgirl": "Please whatch my स्टोरी", "rupmullick": "Love your confidence in every video 💞", "anxious_curly": "I love the confidence you have always. Yo go girl!", "dishani_3010": "What happened to u komal.. u were soo good at ur work.. like i really admired u.. i used to say everyone about u.. buy u changed a lot in past 1 yr.. i really miss the real komal..", "nadskhan25": "U should do some web series. Would love to watch you", "kajal_14sen": "Komal I love the lingerie. I wish I had the confidence to wear something like that.", "susan148": "Komal you always look pretty. Adiós 💋", "thelifeedit_nidhi": "Looking good as always ❤️ can u please tell from where is the lingerie from ? @komalpandeyofficial would appreciate if ull check out my makeup page Nidhixmakeup 💋", "nysaaggarwal_": "You look good just the way you are i mean it’s your wish if you want to wear lingerie or not don’t listen to these type of people they do it because they can never reach that success and are jealous that’s why they make themselves feel better by pointing out the bad in others you awesome 👏 😍😘 !!!", "grewalmilie": "@sonotnulll 😐", "misswatimis": "I ADORE YOU LIKE ANYTHING... NO MATTER WHAT.... KEEP SHINING...❤❤❤", "wings_910": "I loveeee your playlist 😍😍😍", "arushi.bakshi": "plz try new haiy style Komal...we want to see new one", "shreyajakhotia": "Plastic", "paapiipet.in": "Hey @komalpandeyofficial you are an inspiration we love you❤️❤️❤️❤️❤️. Checkout our story we have something for you @paapiipet.in", "thoughts_better_be_shared": "Do you only have raunchy sort of night suits / night wear / stay ay home wear @komalpandeyofficial . U can pull of it very well . But I wanna see how u pull off the cute night suit set 🤗", "arshini__": "💪💪❤️❤️", "livinglife_queensize": "I was only looking at that lingerie🔥", "theheroineee": "You know you're goals for being yourself and out there ❤️ More power to you. Btw even I use Mythic Oil and it works like wonders. Mwah ❤️", "thestylemilaner": "It’s her body and her rules, we are no one to say anything ❤️ Also, she’s the Boss lady 😘 sending you lots of love and more power @komalpandeyofficial ❤️", "vaishajeet": "Amazing ♥️", "diksha.bansal9": "Your lingerie is da bomb. 🔥", "sana_omfg": "I don't understand why a girl each and every time has to keep repeatedly make this shallow world realise that she is not put on this earth to satisfy their rules or more !.. I feel so bad for you. You have been proving yourself again n again and you're made to feel apologetic every second of your life for the world you live in which is built by you.. With your own will, hardwork and money.. You should clearly stop giving reasons and stop post addressing toxic people. This is heights ya.. It's 2020.. You do you.. 💕 I generally dont do this.. But my gut is wrenching now.. So much negativity.. Already 2020 is so gloomy.. People arent leaving the toxin in them behind.. Ramzan kareem.. U do you.. May allah be kind on you and ur family.. I pray tat u have greatest Of health. Ameen..", "jafriafsha": "Nice bra n panty...mast lgri hai", "anukriti_somani__": "🔥🔥🔥🔥🔥🔥😍😍😍😍🙌🙌🙌🙌🙌🙌🙌❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ follow @zak_official__", "komal_styles": "You always look so pretty..💐", "ikshi_3003": "❤️❤️❤️😍", "sangen24": "I’m sorry you had to deal with bad people and their opinion. You are amazing i have never seen such amazing fashion blogger. You never failed to amazed me. Even there were times I don’t like some content but how can i hate you for giving me many amazing fashion content. I respect you. If we don’t like any influencer all we can do is unfollow. Why to create such drama?.", "iamtamannahahmed": "Please do not curl the edges. It looks better when straight❤️❤️", "nauwya": "I love thisss 😍 how do you manage heat damage though?", "pinchofmirth": "❤️❤️❤️", "bansalpinka": "Why most of your posts are in lingeries. I mean are you having a permanent lingerie sponsor or something.. don't take it otherwise i like the way you style and other content.", "ritikashar": "Wow this was sooo simple and I always wondered what extra effort u made to make them look so sleek and on point ! @komalpandeyofficial", "itsme_nirajmishra": "Very nice👙💋😍❤️🔥🔥", "jiyamanral": "Boss this girl😍.. @komalpandeyofficial Uh are damn beautiful and seriously salute for ur fearless bold beauty.. 😘😘 just do ur best.. 😘❤ ur guts inspired me always", "noor_aroraa": "🔥🔥", "kiransingh3320": "i feel good ki komal mehnt kr ke aaj is jagah pr phuchi ..or aage v acha work krte rhe...but i feel very bad...aage uske vlog ko isliye dekhti ki kuch new sikhne ko milega or main usko try krungi...but ab is tyoe k dress makup me ni kr pati jo komal show krti h.bcoj main middle class fmly se hu...ye sirf unke kam ayega jinke pass ache bank balance h...", "rainbowbloomsbasic": "Hey Komal, I just wanted to ask that almost on all your videos we see you using the iron...and we all know how bad the effect of the iron is in the long term...I guess you should not use the iron so much because the more you show it on social media the more ppl will get influenced to use it frequently...so do take care of yourself ❤️", "namratasingh__": "Why don't you not try some curly or fizzy hairstyle.. @komalpandeyofficial it will also look damm hot on you😘😍💐", "r_a_g_i_n_.i": "❤️❤️", "hello_._._._hell": "Ilysm❤️❤️❤️and I luv the u are ... Uh r such an inspiration🙈😇", "hardik.raj.dahiya": "Nice", "thatblingthing": "💕💕", "miss_shrey": "U r amazing 😍.. Ly ❣", "lafzzzzzzzzz_": "this tutorial is so satisfyin and you're such an inspiration 😍", "adiba.18.28": "Trust me ..even straight ends looks bomb on you💚💚💚💚", "food.jaunts": "To all the people who are hating on her or getting offended by what she wears ,please unfollow her and if possible cut off ur internet connection because clearly you’re dont have the brain capacity to be able to use any social media without getting triggered.", "karikevaishnavi": "How could someone look so pretty and stand out in everything that she does ? 😍", "hiya_ready_to_fly": "I love ur songs. I love u. And I love ur filters. Which is this?", "meghaawasthiiii": "Woahhhh😍💙", "prajnya__s__avadhani": "Komal u give girls like us so much confidence to be happy and feel beautiful in our own body especially in a society like ours .... More power to u ... Lov from bang ♥️😍😍🙌", "shilpi7513": "U r a Rockstar .... Couldn't love you anymore 😘😘😘😘", "mamta3490": "Go eat something ...lockdown hai Akal nai", "smita010791": "One question why do you always bring your tongue in between... It looks so weird.. I mean I have never seen people do this", "beyond_the_dusk": "The negative comments should not bother to you @komalpandeyofficial , If you believe you have built yourself with all your efforts and hardwork also, if you completely believe you belong to a normal ordinary family then lemme tell you, it is normal and you’ve to face the criticism always. No matter what you say and how much efforts you put into something, it will reflect your character from every perspective (for them) you gotta strengthen yourself girl and be spiritually more active then only it will all stop bothering you. #dont_pay_much_attention and stop giving justifications to everyone. You ain’t here to entertain everyone . Good luck", "ash_das93": "@komalpandeyofficial How do u nail that perfect song for all ur posts is beyond me, it certainly makes me wanna Google n chk that video out😘😘", "himanshikhurran": "@adah_ki_adah same for you.", "musskaaan_": "can you share your philiphs straightener link ?", "thatgallantgal": "@komalpandeyofficial hottt😍😍", "bhumika_narang_7": "❤️ lv uu", "tia_shona": "I love yr lingerie ❤️❤️❤️", "howsthejoshhhh": "Hi first of all I love your videos so no hate... secondly I would like to tell u on the behalf of all the Indian girls are parents mentality ain't gonna change so we can't wear short clothes that often... Make content that indians could wear on a daily basis... It's not about we accepting out body it's about the society not changing in the end...", "white_lover2607": "Baki always perfect uhh r🔥🔥", "anupama_ananya": "My pretty lady😍😍..... Grow much more in fashion world❤️❤️", "pushpaj.e.n.a": "Why don't you put YouTube videos these days?", "kriti.makeupartist": "Bomb.com ❤️", "kreetythakur": "💛💛💛", "mola_konyak": "U r amazingly .", "ig_beck": "🔥", "ahana_021": "@komalpandeyofficial you are a great fashion blogger and my idol.......so love your style and also your fashion hacks and you have such a creative mind.....so please make more videos for your true fans (just like me)....and please make more videos in TikTok and YouTube", "paleen.sehgal": "You are beautiful ❤️", "mausam_25": "@joshi1helly U wanted this lingerie right?", "the_fashionista_mom": "Freaking awesome! @lasenza am hitting on you once this lockdown opens 😂♥️", "mansa_gupta": "Gorgeous❤️", "glencocowent": "Looks better natural", "anahita.amani.singh": "❤️❤️", "siddhilicious": "Love love the look!", "harithax_x": "You look gorgeous, more power to you, woman!♥️", "poonam_cn": "Komalll you’re so beautiful 😍😍😍❤️❤️❤️", "musa.bangash": "Ramzaaaan hai jaaaaaaan! Don't do this", "sophie_tigress": "😍👍", "jiya_sh_31": "Ur hairs are also nice ..like u😄♥️😍...luv u komal", "aishwaryaguptaofficial": "😍😘😘😘", "thatsamoopoint": "Desperate girl", "ankita_anney": "😍😍😍❤️❤️❤️", "prekshaira": "@komalpandeyofficial very nice highlights. Amazing work. Just someday if you get time, could you just give tips on how to maintain such delicate lingerie. Because I have some nice pieces too, but too scared to use it because of how to wash them and how to get it right. So it would be great to know how do you wash such expensive stuff", "_preetinegi_": "😍😍😍😍", "zahanrawnak5": "Duniya main log mar rahi hain or is naggi ko nagga honi ki pari hain😑😑😑", "pruthabokade": "i like ur lingerie collection 👌", "janvibhargav": "I love you ❤️🔥", "needlestalk": "Wao", "deekshas026": "❤️❤️❤️❤️", "bhawana3995": "U look stunning gal....😍", "khushi_0154": "Don't be so hot yarr 🔥🔥", "jayitaanoop": "Where do we buy such lingerie 💕 ?", "alkaraj57": "Diii looking so beautiful and aapne sabko reply kiya h .mujhe bhi kariye pls", "afifa2094": "Mam u looking like aliya bhat😍", "anushkaa.04": "Don't listen to the haters. Just see where they are and where you are. You are very successful,they are just jealous. They don't deserve your attention at all. You are an amazing person i know that coz i have been following you since popxo. You are super talented. I adore you and not just me millions of people support you. Love youuuu queen. ❤️👑", "sincerelyxsans": "Gorgeous just drop dead gorgeous🔥 also that lingerie is bomb. So much love and power to you❤️❤️", "sahernayyab": "You are inspiration @komalpandeyofficial and I loveee yuh sooo much 💕💋", "tarushingapal_262": "It would look more good if you don't curl it from the bottom otherwise amazing 😍😍", "meghsnair": "❤️", "anaaaa_3215_": "You look stunning in this lingerie 😍", "p_r_a_k_r_i_t_i_1605": "Totally slaying 💜 how beautifully you groom yourself is really a glimpse to watch🙈 really talented personality ❤️ lots of love Komal❤️ & thanks for sharing with us & being so real 🌸 you are a slayer🙌", "kalravshah_": "More power to u , u are beautiful ❤️", "riya_sharma1466": "😍😍", "harpreet1700": "From where do you buy your lingerie from?", "advocate_choudhary": "Bravo dear 🙌👏👏 you have done such 🔥 lite work amazing and your lingerie 😍💓🔥 you are cracking 😉 stay positive always 😉 sis ❤️💪", "genie_in_a_bottle18": "U look good in log hairnot in short", "ashitarukmini": "🔥🔥🔥🔥🔥", "_.jigyasha_": "QUEEN PERIODT!!✨💕❤️", "definitelynotluna": "Hi sis where’d you get that lingerie set? It’s really cute😭😍", "arzookishnani24": "You are such a inspiration 💕 being able to wear anything with confidence and elegance is just you soooo oure 😍", "awesome_ankita": "I liked u since i get to know abt u. ..its been long i watch ur creations.. i loved most of them.. but. Past few months though ur concepts are getting better .. your video quality is better .. everything is getting better but still i don't feel like watching it... ...i just feel SAD now .. when i see you.. ur eyes.. they seems like sad...", "jaykumar_parkhe": "Hot dear😘😘😘😘💋💋💋💋", "_maleficent_donna_": "The way you carry every brasserie and confidence♥️ wish every girl had out there 💋💋🌸✨", "seeehu16._": "Komal di how do you edit ur videos I'm literally in love with your video edits like it's soo aesthetic and your fashion sense waw they r really cooollll 😍😍😍😍😍 @komalpandeyofficial", "maithileeeeeee": "😍😍❤️❤️❤️", "imurvashisingh": "Wow that's pretty cool🙈🔥😍", "glam.in.damn": "Hot af😍", "abqwr_": "ok. I'm stealing your lingerie wardrobe. It's amazing.", "you_have_me_like_gravity": "I wanna know where to buy this dress from. I need this in my life.", "cara2mcklen": "Hi komal. I really like your content. I just wanna say its okay to be a feminist but that doesn't mean we will go against decency which the society has put on us. Aise to kal ko ladke nange ghoomne lag jaenge saying its my body. You are a great fashionista. And maybe your content is suitable for america or europe but India we follow certain rules. Not because we are backward but because that's decent. Please dont take offence. @komalpandeyofficial", "thewardrobecrave": "Oh my my. You on fiyayyy", "riyakkapoor": "Sweety love you❤️", "arundhatii4": "I❤️u", "vandanavasistha85": "Komal you are just amazing girl.. Positive and flawless🌸.. The best influencer right now .. Love your style and the way you dress yourself up and inspire us every single day. Lots of love and blessings to you girl. Keep growing and creating the best content as you always do ❤❤", "fashionistaspeaks": "This video..excellent one babe...thank you for sharing !!!", "sshona16": "Haters will never be kind to anyone. Stop ruling on her. @komalpandeyofficial such a tremendous you're. Literally like actually I use to wait for your every post to come. I love each of your posts completely. MY ALL-TIME FAVORITE♥️♥️♥️♥️♥️♥️♥️", "_puch_kich_": "Is it needed to be all the time in bikini", "shaivimahika": "Can you please tell me where you got the lingerie? 😍", "i_shubhi_shukla": "Why you are always in lingerie in all your videos...", "palsb7": "What song is this", "madhuraaii": "@srushdeore she should be on THTH . Kapde ghalat nahi 😂", "antaraborah": "Loveee your style! Love the fact that you are so confident! And love the lingerie! 💗", "abhidipu84": "Have u Posted anything for Rishi Kapoor", "thejanguno_mor": "Komallll....♥️♥️♥️♥️", "shadesbyshradha": "Love! 💞", "prat_uu": "You are iconic.... i loved the look...❤️", "_hazar_atthar_": "OMGGG, YOU ARE INCREDIBLY TALENTED AND BEAUTIFUL ❤️❤️❤️", "sonalihastir": "Love the lingerie ❤️", "__goodheart": "Chandani chowk ki Kylie jenner 😂", "saumyaya_20450": "😍😍", "foodking.bd": "Which shampoo do you use", "akshitha_reddy____": "First control ur baldness and do all of these", "ananya_vandanand_official": "I want that lingerie right now man ! 🖤🖤🖤🖤🖤🖤🖤", "nikita3790": "Which brand of Lingerie is that!! 😍😍😍 You carry it so well! @komalpandeyofficial", "roshni__ghani": "amazing... 😍 ❤️😘", "akanksha_yad": "Was this video about hairstyle or about lingerie? Just curious?", "nancy7060": "Beautiful as always ❤️🔥", "anandmaitrayee": "Also haters really need to chill", "simran_4209": "Proud of you.", "prachi_gp": "Love the lingerie 🔥 & you look amazing 🔥😍", "ethereal_55": "This is a must watch tysm didi💖", "anjana_sravanti": "Beauuuutifulllll😍❤️", "kal.se.diet.pakka": "😍😍😍😍", "timilsina_kanchan": "I love the old u", "being_lagom": "You both are a beautiful diva♥️ lots of love to you @komalpandeyofficial and @dollysingh", "_highlyinflammable_": "She can wear whatever she wants 😭 ❤️❤️", "_sneha_mallick_": "Just a reminder~ using heat on a daily basis can cause much damage.", "suman.burman": "@komalpandeyofficial Is this VS @victoriassecret which you're wearing? Bcz you're looking absolutely gorgeous😍..", "95anushka": "Oh I just love your lingerie every single time 😍😍😍😍😍😍😍😍😍", "_tejuuuuuuuuuu_": "❤️❤️uff do a lingering haul please ❤️❤️", "rnabanita": "Suprb❤️❤️", "the_girl_named_shreya": "😍😍😍😍", "srima001": "Np her mom NVR taught up so ...thts y d her culture she GT didn't allow her to open up d video n felt shy ...u won't understand", "karishmated": "Man where is your brassiere from 😍😍@komalpandeyofficial", "banatkaur": "Lovee itt❤️😍😭😭", "parnikaabansal": "😍😍", "_ashsway_": "😍😍😍😍", "aishwaryah_reddy": "Wat Lipstick u wearing", "meen_akshi03": "You’re pretty and a sweet heart❤️", "evelyn_ean_pieper": "I love you since the beginning❤️ but can we please accept the fact that we are bored seeing you in undergarments...", "pixiewrites": "How do you pull off everything this easily? 💯 Smoking 🔥", "shalinis.sharma": "Love your style❤️", "prabhshabad_sahni": "Please be active on youtubeeee❤️❤️❤️❤️❤️❤️", "_greenscarfgal_": "You are so gorgeous. Love the way you style😍.", "manpreetmua": "You are perfect 💯", "apurwa000": "Superrbbb❤", "riyachauhan52001": "💥💥💥💥💥💥❤️😍", "rittika_thakur": "Wooow😍", "manya_pvtt.18": "Why so pretty??❤️", "_ankitaaa_24": "You are such a savage girl ❤️love ur work 🔥❤️", "oshin.singh_": "Hey the video is a 10/10 ❤️ and please do check your dm. There's lots of love for you there 😘🔥", "opikundu": "@umme_nirjona", "tyoudon1959": "🔥🥰💐", "riyamodha": "🖤😍", "rishukataria64": "@thesaritablog tu kab leri h ye dress??", "paduyumpi": "How I love your style and attitude ❤️❤️", "lens.wanderer": "you are actually checking off every music from my playlist.😂😂... but tbh ...nice 👌👌", "amritatarafdar": "Why are you so perfect? It's not fair!🤯 Also, I want that lingerie! Is the shipping process smooth? What about custom charges? Tell ussss!!! @komalpandeyofficial", "prakriti_k_pandey": "You r fav 😍", "_vidhi_kapoor_": "U r sooo cuteee mann🙌 and justtt perfecttt❤️❤️❤️❤️love youuuu❤️❤️❤️", "deepshikha489": "Actually u look gorgeous in lingerie so people jealous ki carry kaise kr leti hai itna acha sa ....koi bhi dress even lingerie", "ap.laws": "Your lingerie never defines your character in fact it’s so beautiful I love your style ♥️ OMG you are talented pretty lady", "sukhjeet.kaur2012": "😂", "korebrand_kl": "😍😍", "rashiprabhakar23": "Hey komal.... I just want to be like you and on mh recent igtv video.... Someone commented... U r going to give tuff competition to komal pandey.... I think the inspiration just comes from you... And i will never be like you but i can be inspired by you.. Thank-you so much komal just because of you only i got this lovely comment what else i need now... If someone has commented ....😘😘💖💕😍💕💖💖pls have a look on my recent igtv video.. If u want to read the comment komal.", "caroll___mathias": "STUNNER💣💖", "gomes_elayne": "😍😍😍😍😍Yesss!!", "poemquotes.qw": "Wowowowow🔥❤️😍", "palakbansal67": "Why do you always do the center parting? You can try something diff with that too", "itsjustsneha": "omg that lingerie is so BEAUTIFUL. love the detailing on it 😍😍😍", "blushwithfalak": "Puri duniya abhi taklif Mai hai Aur tumhe sirf apna jism dikhane ki pari h Mtlb koi fark nhi perta tume uper wale ke pas bhi lgta h yehi sab dikgaogi.😏😏", "vasundhara_daga": "You slay, and it's so good that you are so confident in your own skin. Loved it, you beauty. Crushing 😍😍❤️❤️", "suman_hotwani": "😍😍😍", "sreyashi13": "Why you don't try side parting", "dolcy_16": "fake chutiya", "positivelypoisnous": "You're so beautiful😍 just so perfect 🤭", "wildfire_inside": "You're such a boss! Just live the way you are so confident with your body and your clothes and just yourself♥️ so much of class and style! #rarecombination 🥂 keep inspiring❤️", "freyasavla": "I loveee how this lingerie looks on you. You look absolutely faaaaabbb. I love you! 🖤🤍", "fiend_like_queen": "Do you use heat everyday?", "khuranatejaswani": "Where's the lingerie from?", "sunshine._._20": "Looking awesome cutie 😘😘", "awais_prinxe": "I m scared for u.", "varsha_sadnani": "❤️🔥", "jomangolik": "😍😍😍😍😍", "oshosinha": "Di aap mujhe pahle jayada achi lagti thi ye sb kya kiya hai aap ne sach m plzz pahle bali pyari komal ban jao na plzz", "jkhatri1989gmail.com3506": "Gorgeous 😍", "chandni2071": "@komalpandeyofficial loved your lingerie so much 😍😍😍😍😍", "theriotpixie": "Could I know where the piece you're wearing is bought from?", "manisha_sahani68": "Loving it soo much 💋💋", "aki.varshney": "I was just looking at her dress the whole time.. So hot. From where it is.", "harleenminocha": "Ooooo! That's such a cute/hot butt! So envious 💓", "_shubh_2411": "@komalpandeyofficial you are so inspiring... ❤️❤️ we are of same age but still I feel like saying this to you... ❤️God bless you❤️... More power to you...😘😘😘😘", "shruti_s.p": "🖤🖤🖤🖤always the best at everything 🔥❤️😍", "veenugupta_meanderingtraveller": "Like the way you style stuff but this hairstyle doesn’t suit you at all. May be flip it on the side or sth for a change", "sneharawattt": "Is she forgot how to wear clothes?", "mahihehheee._": "U r soooooooooo prettyyyyyyyyyyyyyyyyyyyyy love the way u look ❤️❤️❤️", "rainbowonawaffle": "Nice🖤🖤", "cloud._06": "I stan her❤✨ ilyyy🥵✨", "aesthe_thicc__": "You are amazingggg❤️💋", "sandhyasingh9015": "U look soo confident in ur lingerie..i wish i could b confident like u ...u r soo adorable..i love u nd ur work", "s1deepti": "Oh gosh😍😍", "badmaaash": "Omg youuuu😍♥️♥️", "nemos.fashionopedia": "Your posts keep me motivated just as you are. I love you Komal. Huge huge huge support for you girl. Your posts brights up my face coz I always smile continuously seeing your posts as it always encourages me that I can too do this no matter what ppl say. Thankyou so so so so much Komal for coming up with such beautiful contents. You can't even imagine how does your posts effect me in a good way. I am motivated by you. Honestly speaking I have finally dared to do what I should have done 2 years ago. You are the only reason that I've finally come up with this that I will start YT as a fashion blogger. I couldn't choose Fashion Designing as a career due to certain financial conditions. I choose to do B. Com that was a majburi. But after that I came to know about you I said only one thing that when she can, I CAN. You made me do this komal. Thank you. Thank you so much. I love you. @komalpandeyofficial you keep my dreams up so that I can fulfill them. And yes the dream of mine to meet you will surely come true as I will make it come true. I'll work hard and smart to stand beside you one day. Pakka. 😍❤️❤️ @komalpandeyofficial", "sabeenakhan028": "Love the lingerie ... you are fire. ❤️", "thefashiontasy": "@komalpandeyofficial 🔥🔥🔥🔥🔥", "the_golden_sass": "So perfect always ♥️ loved your lingerie wherez it from", "mandarabattalahalli": "Too awesome", "thatlongponytail": "Loved this lingerie 🔥", "jakhar3187": "Slaying😍😍", "fashion_junkiee": "Always love you @komalpandeyofficial 💓", "aflyingdentist": "💜", "4sandhya": "Beautiful 😍", "garvi_ramani": "💜your lingerie", "silvershades_188": "Honey😘💯", "maneeshabisht": "You’re so pretty❤️", "sharda_roy95": "Amazing 😍", "nishikaurcool": "Look like doll😍", "5ft.blogie": "♥️ your just best", "ketarketar000": "You look perfect🤍", "khushisah_00": "Wow wow waaaoowwwww!😍🔥🔥🔥🔥🔥🔥🔥🔥you're rocking girl!", "chahat_paneri": "Why so beautiful 😍💕❤️", "deekshakhurana": "😍😍", "jfern1026": "😍🔥😍🔥", "anisha_ramesh": "What’s your work out routine", "inadatta": "Lingerie ❤️❤️❤️.", "trendingtrails": "You look hot in this one👌", "_._shambhavi_": "Aha lady boss you and your hairs🔥❤️ how can someone be so perfect all the time😍", "_ambivert.soul_": "@komalpandeyofficial di Much love❤️🤗", "zeb_zaidi": "Hey! You are beautiful❤️", "kaur.sarab0408": "Always same style same fashion same Blackieeeeeeeee outfits😵😵😵", "prishhaaaa": "Beautiful 😍♥️", "snehanegi___": "Hey georgeous ! Love your outfit😍😍", "shristi__aditya": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥You are so stunning gorgeous best and my favourite❤️❤️❤️❤️❤️😘😘😘😘😘😘😘😘😘😘I love you the most❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ The one who is writing worst about you,they are like that.You are awesome 😘❤ love youuuuuuuuuuu❤❤❤", "waytooweirdforyou": "\"Tumhe koi haqq nahi ki tum itni khoobsurat dikho\". Issshhhhh maar daala. 😭 YOU ROCK QUEEN. THANKYOU FOR EXISTING. YOU MEAN FASHION TO US💫😭🔥💙💋", "thatgraciousgirl_": "You are gorgeous babe❤️", "monalisha_singha_": "Lingeries are the best 😍 nd you rock in it 💕", "being_myself_here": "Side partion please💥", "riddhi_gulati": "More power to you ❤️", "niks_0308": "Gorgeous 😘😘", "__bhawna_23": "That lingerie was giving vibes of misa amane from death note 💕", "preeti_jaswal98": "Gorgeous 💟", "ghasnat": "Love you. This was the spot of brightness I needed after the darkness that has been closing in on us. Thank you for putting a smile on our faces. Thank you for being so easy to love. Thank you for your hard work now and forever ❤️❤️❤️", "srishxoxo": "You’re just too good to be hated for. Don’t be bothered by all the negativity. Some of us really look up to you. You’re phenomenal at whatever you do.♥️", "amaya_sharma6": "You are absolutely gorgeous.❤️ love your style x", "__kanishkachawla__": "@komalpandeyofficial you are an inspiration to many. Looking at you,is enough for a person to know how important it is to feel confident. Each day I see someone undermine you, I choose to believe you even more. Thank you for your great work,good luck❤️", "ramana_arts": "You are so prettyyyy! UWU❤️🌼", "kaju_090194": "❤️❤️❤️❤️❤️❤️❤️❤️ Lots of love 😘😘❤️❤️", "__.mohnani._": "I want you to do that Maggie curls once .... will you?", "keerthana.028": "Haters will hate but u go girl....u look hot aff babe🔥🔥🔥..love ya😘❤️", "_vidhiiiiii_04": "Why so PERFECT?😩❤️❤️", "monai_sonof_thommachan": "What is the name of your haircut?from where did you get it done?", "priyankamca20": "I love your confidence😊 ...good keep it up 👍🏻", "auntar_brar": "How can someone be so perfect?", "mysticaldimples31": "@komalpandeyofficial You are soaring the temperature so high ufff love love love ♥️😘", "anjali_tanwar_0": "Simple but smart 👌🔥😘", "kiddish_girl18": "Wow u just love your style 😍i guess i fell in love with ur shape body ur ideas and ur positive vibe when haters add some hating comment just love the way u r 🥰and thanks for this routine hi @komalpandeyofficial di this is deepti from assam so much love for u yahan v meet and greet kijiye kabhi lockdown k bad 🥰", "mi_harshada": "You are beautiful the way you are ❤️ Don't let people put you down 😘 More power and love to YOU ❣️", "sauve.me": "@cupid.himani", "sahniaastha": "Gorgggggg 🔥🔥🔥 You elude confidence @komalpandeyofficial and that’s so inspiring to see! As women we have always been reminded to “not wear this, or that” and I hope that through you, more people can learn to be comfortable in their own skin.. 🙌🏼💕", "mantsha_amir": "@komalpandeyofficial I just saw your story and many people try to humiliate you and try to pull you down but you’re bigger, greater, pretty and kind than them❤️❤️ just 2 people can’t describe you. I know your from past 4-5 years and I’m in love with you and your content and your fashion. You’re different from everyone. You’re getting prettier and hotter day by day❤️. You’re inspiration for most of us. You give us more confidence. You’re content always. You’re most amazing person I know💞💞keep doing what you’re doing❤️❤️", "samaira__agrawal": "where can i get such confidence and beauty?😫😫😫❤️", "piyalidey1111": "Looks as good as a salon's 👍", "chandiniichoubey_5607": "You look sooooo hot 😍🔥 🔥", "bhawana_wadhwa": "🔥🔥", "_._anonymouss.__": "😍😍😍😍😍effortlessly awesome", "shrusome": "You are unapologetically so bold and the best part is you don't give a damn about anything anybody thinks. More power to you, girl ♥️", "annie.dey.351": "Wooooooowwww🔥🔥🔥🔥", "y_niva": "Mam you are amazing💕😍", "_be_you_1110": "Haayeeee🔥🔥🔥", "naaaamkaran": "I only started following you very recently. Content creators like you are very underappreciated. A lot of us fail to have an insight on the work that goes beyond camera. You guys are inspirations. A because you choose not to give in to hatred almost on a daily basis, and stash it and come out a bigger person. B because you guys are following your passion through social media and in real life, creating content in quarantine period when creativity almost ceases to exist for most of us. You guys deserve respect.", "shreyaseth23": "Genius And Gorgeous ❤️🔥", "shivani31_05": "Boss babe❤️", "sumit_620": "QUEEN😍🔥", "sunshine._.diaries": "This is so good. And you look stunning ❤️❤️❤️", "ac.parekh": "Haven’t seen someone look “chic” in lingerie till now💯☺️ Is the Dyson worth the amount spent?", "unnatibakhru": "Hello Queen❤️", "r.i.y_z": "Which company straightner do you use please tell", "_eunallison": "You are beautiful Komal❤", "himanikohli20": "Boss lady🧡", "acoustic_udit": "So beautiful", "elementaire20": "You're a goddess, so pretttaayyyyy❤️❤️❤️❤️🌹🌹", "royswetaa": "❤️❤️❤️", "shopping_spree2": "@komalpandeyofficial u look soo soo pretty in any outfit tbh... i am curious why you wear such outfits in your videos?", "mariamshkh": "Are you a doll or what", "sibrabhikha_01": "Aah haa that last wink 💋😘💯❤️", "darshii7902": "😂", "unicorn_gal_28": "U just rocked. love you loads komal babe❤️", "thepurplestones": "Wow! Always so amazing", "khushboochoraria": "I love the lingerie... where did you get these from ?", "surabhiii_sharma": "That lingerie 😍", "rekha_khare_": "Hii Komal , you are my favourite.. very natural beauty ❤️🤗", "latikaishere": "Darling you may start stripping for the gram now!", "mehaktyagi__": "@palak9182", "preeet_11": "I can't stop falling in love with you😭❤️", "hetal_devil": "Beautiful and confident as always. Loads of love. U are living by ur terms and thats great as many just aspire but dont have the guts to. ❤️❤️❤️", "these_little_aspirations": "You looks gorgeous & hot. This video is good too. But almost 90% of your content at present, it’s too bold. My mother used to follow ur account. She liked your content, but at present she even said, how much this girl has changed. Her present styling sense is not for every or most of the Indian girls. Yr Do post such content, but there should be some limit to it.", "sharmaa.pvtt": "@komalpandeyofficial just a reminder to youuu. You are friggin awwsomeeee and more more moree power to youu queeen♥️✨🌸💋", "ads_aditi": "u always rock it❤️.. I love u so much ..u r an inspiration❤️💋", "i_u5hmita.g": "Uff soo gorgeous @komalpandeyofficial ❤️🌸", "garima152": "Your are so gorgeous❤lots of love to you.", "_oyendrila_roy_": "Slaying like a sassy lady! You’re gorgeous honey 🔥", "the_flavourful_life": "Finally, I was waiting for this post for so long. Thank you so much. You look so beautiful Komal.", "stella_thebabystar": "HONESTLY, you are killing it❤️", "__swastiii": "Glad that im using the same serum!! Its vv nice tho.(mythic oil serum)", "charvi_2504": "🤮🤮🤮🤮", "ritikasingh_85": "Reading comments made me sick you go girl you have to walk so that our future generations can run seriously Indian need to change so much ❤️❤️❤️❤️", "the__astarte": "I wanna have your level of confidence in that lingerie. It’s soo pretty and you’re rocking it girl!💕", "_ruchi.sharma_": "Babe. Just ignore the negative comments, they're just jealous 😌❣️ love your work😘", "jheelbhagchandani": "You're so perffect😍😍😍😍", "_ishiagrawal_": "Oh damn. You look so pretty in this video❤️", "chinki_45": "She just posts to show different kind of lingerie she owns😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂Baal tih chote hi h inhe kya hi style kregi", "mikhapalikhe": "You look so beautiful 😍🔥 @komalpandeyofficial", "anila_sri016": "🖤Gorgeous ! Where’s that beautiful black corset from though 🙇🏻‍♀️", "swati.kureel": "Sublime 😘😘😘😘", "ana.mika96": "You are gorgeous babe❤️❤️❤️❤️❤️", "sejaltalwar_": "You are the bestttt😍😍😭@komalpandeyofficial", "bhavitaatisha": "ok your feed glows with art😘 also you’re so pretty ilysm🥺❤", "98s_aesthetic": "You are love @komalpandeyofficial 😍🔥❤️❤️❤️❤️", "_janhavi_28_": "You look gorgeous as always Di!!❤️❤️ LOVE YOU!!❤🌸", "spree._.firit": "Such a beautiful soul ❤️", "infinitely_finite_": "I want this haircut after quarantine @ayyyayesha", "minii.b": "What does your tattoo mean", "muskaanparchani": "You go girl 💪🏻❤️. Don’t let others nonsense get to you 😘. #youdoyou #morepowertoyou", "anagha11024": "😻😻😻😻😻", "amaniya_hakemeen": "Beautiful You❤️❤️❤️", "shambhavi_106": "PERFECTION 💕", "shanaya_rajput080": "Looking hot af komal🔥🔥😍", "bhandarirajni": "I liked your stuff but off-late you have been posting almost every content in your intimate wear. Just wanted to understand if there is a particular reason for this. And why is it even required?", "jaya_lethal": "🔥🔥🔥who's the hottest girl in the world👉🏻 komal pandey🔥🔥🔥💖", "bl.ah9292": "I don't know what is the problem of some people? its her choice to wear whatever she like you are no one to tell her or maybe you people must be just jealous of her", "arpitasomanii": "My style diva😍", "dr_meghanagpal": "Classy and perfect !", "pratyusha.13": "Oh my god Gorgeous! Power woman running the world. ❤️", "_akanshanegi_": "💖💖💖💖💖💙🙌🙌🙌", "raksha_b26": "❤️😍❤️😍❤️😍", "_bhavya_kanoujia_": "New girl crush alert ✨😍🔥 ....", "sakshisaxena31": "i think @komalpandeyofficial let that girl speak and its not only of one person there are many fake ids like this who just love trolling other because they cant reach to that level btw you are beautiful lots of love to you 💯😍❤️", "l.lubnahadeer": "Do u have Oly one lingerie..?? No other?", "shahbaaz_khan7": "You always slay it girl @komalpandeyofficial 🔥🔥", "tanishkamudgal1129": "You look amazing ♥️🔥", "_enkrypted_": "I'm tired of you watching in lingerie, wear clothes sometimes.🔥", "rudali_bhattacharjya": "I am soo obsessed with you like I watched the whole video 8 times 🙈❤️🔥💗", "anisamaity": "LOVE!🧡💛💜🌸✨WONDERFUL! 🌼🌈🎀💮🎋🖤💫", "lookbookbyitishaa": "Dayumm!! You are gorgeous ❤️😍", "mishiiiiiiiiiiiii": "Suno komal, please change this hairstyle !", "amrutamahamuni": "From where you get your lingerie ??", "__priya._.98": "Georgeous💕 Lots of love!!", "theeloquentink": "Wow💖💖", "kash_vohra": "You are so pretty !! Since so long I want to know about your lingerie collection 😍 where did u get most of them from 😀 big hug to you ❤️", "roy.exe_": "The outfit at the end looked like what poo would wear ....mood", "beyond_stereotype": "Loved the bralette🔥", "itsrits3": "That lingerie!! Where did you buy it from??", "meghadutta_03": "So gorgeous. Love your videos. Keep shining! 💜✨", "little_miss.7324": "🔥🔥🔥", "muzamil._.jamali": "I really wanna adore you", "thebeautywonk": "Is the satin robe from h&m?? I NEEEEEED!", "kkkctch": "PERFECTION 🙌❤️", "blessed______girl": "If i'm not wrong ....you've a tattoo...near your side wrist.....i love it.....btw you're lookin' pretty", "aaryaayay": "love it😘", "anika_mishra_1234": "OK I'm jealous coz you look too perfect 🔥 @komalpandeyofficial", "_let_it_go_to": "No offence,i know its upto u but just telling,u look much cuter wothout makeup😅", "chandnig87": "Poker straight best suits on you.. Also please tell which bra brand should we go for heavy bust.. too much love", "malhotramonica33": "Oh hairstyling ,I thought I had focus only on the bikini in all the videos 😂😂", "asrani_simran": "How have your nails remained intact despite all the house work??!", "tina.manhas": "@caroldsouza94", "azmaafraa": "you're so pretty😍", "karaxoxo47": "Did you do your makeup differently here? You look even more gorgeous if that's even possible 😭♥️", "anujagautam3": "Ohhh that wink was just icing on the cake😘", "gayatriiiii.14": "So beautiful honeyyy😍❤️❤️❤️", "haimanti501": "Love love love the lingerie...💋💋💋", "shabostoc": "How good is this 😍", "kaul.me.anusha_": "Really wanted to know that one, so thanks❤️ n post soon on youtube naaa plzzz🌸", "alisha_2029": "Please somebody let me know about bodysuit... I need it badly 💕", "kritika__sharmaaa": "Oh god! How can someone slay all the time😭 @komalpandeyofficial you are lit🔥😘😍", "thewhimsical_damsel": "How I admire you!😍", "theduskychick": "Which app do you use for editing ? BTW You look stunning ❤️", "rhutulaj": "@komalpandeyofficial can u suggest something for volume hairs", "_.naaiinaa._": "Prettttttyyy💓😍", "jdre46": "🔥🔥🔥🔥🔥🔥🔥🔥0🔥", "rummstagram": "@komalpandeyofficial Please tell us if the Dyson is worth the price 🤔", "heyitsreh_": "I’d love to see you in a pony tail some day 😍 you’d look gorgeous!", "twinkle_theshining_star": "❤️❤️😍😍❤️❤️ you look good however you are @komalpandeyofficial ❤️", "flashthefashion": "Ping me to add you in the group Hey Hommies ! Bored ? So are we! And hence we bring to you Lockdown Housie. For friends and family. Each ticket is for Rs 100 Buy 2 get 1 free is the offer Running in our group. Feel free to join the group if you’re interested to pass time during this boring lockdown with us play Housie.", "_allaboutdress": "Gorgeous girl ❤️😍", "raisamalla": "You’re soooo BEAUTIFUL 😢💖💖💖 I Die🥺😓😓", "chhavikiran.lifestyle": "Breathtaking 😍", "iramandeepkaurreal": "Yeah kim kardshian ki videos dekh kr khud ko b vahi smjti hai sasti kim 😂seriously kuch b matlab 😅", "javinishkaofficial": "How can you be so beautiful Everytime? 😍", "i_am_rupss": "And all I wanna know is from where do u shop for ur lingerie! It’s just amazing and you obviously plz mention it also love the way u carry it !🔥🔥💋💋 Lots of love!❤️", "abhiiiii.98": "Loving your lingerie ❤️💕", "ess.aeyy": "You loook hot af alwaysssss❤ Where is that lingerie from?😍", "atusha_anand": "Woman where did you get that gorgeous piece of black lingerie from ??? I need it in my life 🔥", "nivethasri_nivi": "My fav song ♥️♥️♥️", "_em_nizami7": "Keep doing 😍💕 @komalpandeyofficial", "sookoohhh": "Hi komal!!! You can pull off anything!! I just love youuuuu!!!! 💕💕💕💕💕", "_nbagri_": "Such a perfectionist you're, forever fan who just adores your art @komalpandeyofficial ❤️", "meenusehdev1990": "Hi Komal I really like ur videos .its just boost my confidence a lot Nd most imp msg I learnt from u , “ u hv to love urself “ Thanks darling Nd lots of love", "love_is_serene_": "U always look soooooo stunning 🔥 like howw🙌", "farheen_0": "you should change your hairstyle", "s_singhhhhhh": "Lingerie from?", "nishtha031": "You look so damnnnn gorgeoussss❤️🔥", "nayyarvarnika": "You truly have the guts to do whatever 'YOU' want too... the world needs more women like you... Hats off to you. & Just by the way you look amazing coz it's the intent, the attitude that matters😍 @komalpandeyofficial", "radhu_545": "so beautiful you are komal didi😍srsly!love love love youu♥️uh inspire me in a diff way♥️ @komalpandeyofficial", "urvashizazz": "U r the most powerful girl I have ever seen in insta and all .... Thanks for being my inspiration ❤️❤️❤️", "asfakhan19": "I really love your videos but please stop showing too much of skin all the time", "sabaaa_646": "So beautiful btw wer do u get your lingerie from so prettyyyy💕💕", "__.vaishnavee.__": "❤️❤️❤️u r alluring ..@komalpandeyofficial 😘", "freakinmess8": "How can you do this so perfectly", "vips.v03": "@komalpandeyofficial Where in heaven can i get that lingerie from?", "sunssutracare": "Just curious- Do you shoot your videos to make body conscious people feel even more bad about their body? Since you’re legit showing off your perfect body in every post with styles which impractical to be followed by average Indian women.", "vilcreates": "You're Gorgeous, and so hard working 🙌😍", "makeupwithash_": "💕💕💕💕", "annesha__roy": "@komalpandeyofficial Love your signature look. The hairstyling is impeccable. And you can pull off any piece of clothing for sure. Much jealous. 😅", "retikachhetri": "@komalpandeyofficial u r one of most beautiful,bold and amazing influencer... 😍 Love your all seasons of fashion therapy ... Have been following u from popxo days... N could be more proud of you😍", "shreyaapaul.06": "You are such a bomb🔥🔥🔥 you carry yourself with such confidence❤️ all power to you", "ma.hr.oo": "👌👌👌👌", "faujibrat_ankitarai": "One of most inspiration gurlllllll I have ever know... ❤️❤️😍🤘", "_thehustlegurl_": "You are so classy! 😍✨", "thatanonymousmiss": "❤️❤️❤️❤️", "iamdeeptityagi": "Why so beautiful always 😍", "sumita_chetry": "Uff beauty. You are sunshine to my day!🌻💎 Love you!🍒💚", "aartii_23": "Uff i love you too much 😍😍 You look so so sooo good ♥️", "dewanshi_thesstyledrug\nVerified": "Verified", "aditimusiclove": "Tbh I like your without the inturn. The straightet the better! But ofc you look gorgeous anyway❤️", "bhtt.puja": "U r so sassy😘😘😘😘 ...no outfit looks bad on u...u knw the way to carry them so very nicely...seeing u like this doesn't make anyone uncomfortable...more power to u gal💖🤗", "dolly_pawar99": "From popxo I m fan of your acting and fashion style ❤❤❤❤❤❤❤❤❤❤❤❤", "dipanshi.gautam9": "What straightener do u use???js asking coz offcourse i won't buy it", "style__muze": "❤️❤️", "pooja_gupta0510": "You are a diva..and such a boss lady..more power to you komal", "preksha_shukla_08": "I like uh more when uh were doing videos with cherry uh look much better at tat time u look more real @komalpandeyofficial I don’t know something is changed in ur face or may b it’s coz of heavy makeup or extra hotness", "confettiandcocktails_": "You look drop dead gorgeous 😍 Where is the lingerie from? 🤤", "vaishali_motis": "Lipshade plz!!❤️", "cute_bt_psycho": "I jst love this😘 u are inspiration for me 🙈i love the way u carry this all love love❤️❤️", "yeah_me_misha": "Every video of yours is a treat to watch.. Therapeutic as you say! Just love you ❤😘", "_payalverma_": "@komalpandeyofficial Gonna get this haircut soon and apply this method 😍🦋", "pritykalita": "😍😍 soo perfect always...big fan of yours since Popxo time..lots of love 🙈🙈", "priyankamahalanabis": "Lovely komal... I loved it... btw can u share the song please which u played during making this video..... stay safe girl", "ayesha.yusuf98": "I dont get the hate on her posts. She is just creating content and its apparent its original and built out of hardwork. Leave her be you nasty people !!!", "sarvanp158": "Hi", "simran_mishra2836": "U r just amazing yaar !!I m ur die heart fan from pop xo ❤️❤️", "noir_mist": "You are a boss🔥 you are slaying in this video too. You are just too lovable. Don't be fazed by mean comments some people don't like seeing others happy. Stay safe and strong. Love you 🌼❤️", "priyankadeb.basu": "Why so hot 🤩 actually the question should be how so hot everytime👏👏 great going Komal! If someone doesn't like you and what you do..they can simply unfollow you..why the unwanted hate and judgement", "saniya_goyal896": "Wohhaa love Your Hairs Girl ❤️❤️!!", "jeswiny": "Simple and elegant. Love it! 🤗", "__the_may_girl___": "😍keep glowing and growing queen🔥❤️", "emceebeauty": "Gorrgeee girl !", "shreya.khanna.doodles": "How beautiful Komal ⚡️♥️", "siddharth93batra": "No, this wasn’t for the world to see 👀🧤", "mrs.nehal": "@komalpandeyofficial I wanNna see u iN different hairstyle as weLl.......🙌", "abhimanuuu": "Please come back to YouTube @komalpandeyofficial lots of love ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ such a hottyy 🔥🔥😍😍😍❤️❤️❤️❤️", "_grace_tales_": "🔥🔥🔥🔥🔥", "ohyashini": "What's the song?", "muskan18.11": "You are gorgeous DI.! 💛💛 @komalpandeyofficial 🌸🌸🌸", "aishwaryaraaaaam": "My heart ❤️ I absolutely love your page, your style, everything about you is amazing. Don’t listen to close minded boo, you do youuuu 🔥🔥", "devangi_gogoi": "😭😭😭Such a diva. Sending you lots of love and hugs from Assam. ❣️", "much_toomuch.in": "You're way too Gud in all those videos..I'm a fan girl 🔥🔥😍😍", "kashyapshivani66": "You're awsome komal😍 just perfect..✨ Love you!", "im_disha03": "Inspiration , also I love your styling❤️", "antragoyal": "Love everythbg about you...", "anky07__": "You are very pretty!! I loved this video!!💕", "nickknackk0987": "Love your lingerie!😍😍😍", "shraddha_lodariya": "Superb one 💕", "glprachi": "Pretty , petite , preserve worthy , Praise worthy , panache queen @komalpandeyofficial 😍😍😍❤️❤️ Keep going and rocking my lady ❤️❤️", "_.c.h.a.i.t.r.a._": "Just right hairstyle can't wait to try 😍😍😍", "hannahanil80": "So pretttaaaayyyy😍😍😍😍😍!!!i just lovveeee how the brown shades suits you looks super classsyyy😍❤️", "ayushi_valia": "Love! Outfit details please?", "shilpi.shrivastava.127": "Wow u gain weight dear ....share some tips for gaining weight", "_saloni__chincholkar_": "Oh god I love ur confidence 🥺🦋❤️@komalpandeyofficial", "swapnaanjali._": "You are looking so yummy, girl. 🔥", "doyelmukherjeeofficial": "OMG you look so beautiful!! 😍♥️", "roly.polyy": "Oh gosh... May be now I am a huge fan of your lingerie as well😍😍😍 @komalpandeyofficial You slay, you slay, all day, all day... 💕💕💕💕😘😘😘", "dimaurfin": ")))🌷...⚠️", "maru_radhika": "People are goona hate you, because they can't be you ❤️ also, I love your style and you're an pure inspiration for us. Keep the good work going ❤️ Lots of love xoxo", "chandnimamgain": "😍", "___blehh": "Basic but ELEGANT 🔥 #YouDoYou", "noone_nobjlgf": "Good 🙌", "saumyaaaa27": "So beautiful girl ❤️❤️ everything about u is goals 😍😍😍😍", "rutujajaja": "Wowwwww😍❤️", "julietrfrancis": "Love what you are wearing is that a bodysuit???", "laughingchicofficial": "Wow", "_noyonikasahoo_": "I love that lingerie god damn you’re hot!", "prynkamahanta": "Why so amazing always💓💓💓.LOVE YOU @komalpandeyofficial", "deepika_gupta_": "You are Fire and you just go on❤️❤️🔥🔥 much much love❤️❤️", "moon_lit_light": "Sassy♥️♥️♥️❤️komal😘😘", "_.riya_pal._": "Damn 😍♥️🔥", "elixir_of_charm": "If I do that bahar ki taraf!? Will it look good?", "swathyy_nair": "Whr r these Lingeries from?", "upasnagurung16": "Slay.. queenn❤️❤️", "mishra_meghnaaa__": "@komalpandeyofficial No body can come up with Such Lovely content as you do everytime. You go girl. Much love and hugs, Keep inspiring us with your lovely ideas of Trend. I love you ❤️🤗😘", "rachana4644": "👏🏻👏🏻", "missmajestic_": "❤️❤️", "rishdutta": "I love what you're wearing😍 where's it from?", "prachi_thapa18_": "Just wow♥️♥️😍😍😍", "i_prachi1908": "Perfect❤❤❤", "bhairavi_nete": "😍", "madhulika_singh9": "So Posh 😍😍😍", "avnnii7": "Oh my u really get ready like this", "shilpaajoseph": "I love what you’re wearing, where’s it from?", "thaparpinkasha": "You are so hot 😍", "instragrammer8": "You go girl@komalpandeyofficial❤️.", "___shivaa.__": "Wow", "lidwiiiiiiiiiii": "😍❤️", "suni_vish": "Preety!❤️❤️❤️❤️", "vallavishukla": "@insha_fatima07 I wanna do your make up today", "sweetmedha11": "Of course. It'll help me .. loadss of love ❤", "swastijoshi1996": "Aaah the Mythic oil is to die for!", "priya.joshi91": "Why don’t u share some more videos on healthy bodies or outfit for broad shoulders girls 🙂😘@komalpandeyofficial", "kitu_bhadarka": "U look soo preety in this outfit love yaa❤️😍", "jahnavi.1309": "❤️❤️❤️❤️❤️❤️❤️", "raatjagatara.96": "❤️❤️", "dishaeb": "The lingerie🔥 where is it from? Please.", "yokai._._": "You got it💜 you flaunt it 💜", "___valar__morghulis": "Totally adore the lingerie 💕 You are so gorgeous!!! Xoxo", "nehastylo_018": "💋💋", "_manyaya": "You look damn hot but Did you came out of the shower with makeup 😂😂😂", "anjxli_k": "Really useful❤", "___aiiiishaneeee___": "You're pretty. And I love your fashion tips. Keep growing komal. We love you ❤️", "sannanananananana": "Komal is on another level guys😍♥️", "madhuparna_ghosh": "Was waiting for this video since yesterday... Finally its up.❤️❤️", "beautyfeedsite": "On fire♥️🔥", "megha_hairinfluencer": "French Girl 😍❤️", "frikkin.fire": "I think you are just perfect. Lots of love❤️", "medlynjadaunofficial": "Hey I am a fan of you.. but at this time when we have lost two great artist .. and such a huge loss.. these posts are much cool . I apologize if you feel bad . N I appreciate if u act a bit mature . A delay in day for the post should not take Ur stardom away", "sweetie2794": "Y so hot😍😍😍", "pragatipathak_55": "So proud of u after all that happening u manage to work that's amazing 🥺❤️❤️❤️,", "shivanithakur.9": "Wowwww🌸🌸🌸🌈🔥", "panktishah_3": "Di❤️😍🔥", "amritasinha1201": "Love the way u style Urself❤️.... Please tell the secret of ur skinny figure.....!!", "riptighosal": "You've come this far💓 & much much more to go ahead. You know how to turn negativity in a positive way. Not much to say but it's all right to get some hateful comments but still spread the positive vibes💞 it's all right 😌🙌- from an admirer of your style & someone who learned about you through your interviews. This Komal Pandey just not happened in one day. She did it. What She was to What she is to what will she become. She stood by herself strong. Guts💞 Love from me Miss @komalpandeyofficial ❤️", "adittiiii": "Also can u please let me know where this lingerie from?😉", "sanayaamarie": "51+k views within 1/2 hour😍😍", "shruti_queen05": "Classyyy👌", "ri_chi_0396": "🔥🔥 ....😍😍..when will u be bck on YouTube?..❤️❤️", "kriishipatel": "Your clothes are just awesome n so u r too😍😍😍😍 where can i get this black inner wear ma’m???!!! I just love it", "samita_narayan_lal": "🖤🖤🖤🖤🖤🖤", "_1domenica": "Stunner !! Love this lingerie ensemble wow wow wow wow 😍🔥🔥 where it is from xx", "anaambugti": "More power to you. All the way from Pakistan. ❤️❤️", "sukanyasenapaty": "Yaar I see all these creative videos and I get so excited and pumped up to do it too even though I know i wont cuz I'm lazy af rn😂 and then these tatti hate comments🙄 Matab why would you bring someone down like this? It's so mean and rude🤦🏻‍♀️ @komalpandeyofficial you do you boo💛", "thatcuuteegirl": "❤️❤️❤️❤️❤️", "___ayushhiiii___": "You are too good. Love you ma'am. You are an inspiration❤️❤️ @komalpandeyofficial", "l.l.sona.l.l": "It's not fair? How come you are so hot🔥", "mubah_bape": "Where is the lingerie from? It’s 🔥", "scarletstrokes": "Hands down for the goodness", "rathodtanisha_": "I love the lingerie u r wearing 🔥🔥❤️❤️❤️", "tuneinforfashion": "Hotness hotness and just hotness ❤️🖤 @komalpandeyofficial", "mahibakshiofficial": "I have watched this video 10 times lol and I just wanna say that I wanna have that confidence. Period. And also Komal, I adore you ❤️", "theheer_coutureofficial": "Showing too much skin is not a good idea. Occasionally that’s ok but you don’t look pretty or decent girl with all this✌️", "__r_i_y_a._": "Wow u look so beautiful n ur dressing style is too good i like it😍😍but 1 suggestions if u dnt mind 😅pls change ur lipstick shade also with ur dresses 😍😍go for darker shade i want to see ❤️gud luck keep shining like a star 😊", "hailvodka": "how i wish you were a curly so you'd be able to help me also😭", "lavanya.nijhawan.26": "Damn.. i m just in loveeee😍😍 u be the best person..🙈🙈💕", "ishakaurkohli": "You are so pretty.", "monasoni4776": "I don't know why but i just love you komal.. you are such a strong women.. boss lady 😘😘😘😘", "krisha_bhatia": "Stunner 😍😍", "pretty_teen_3012": "Awesome yrrr... You are just prefect ... 😍😍😍😍😍 your sense of styling ... Omg!!!!!😍", "arveenkaurr": "You are georgeous girl❤️ share some more hairstyles🔥why don’t you like post on your YouTube channel? You are sooo talented❤️", "mani_agg": "Its tooo goood💕", "pahadan.noor": "Pls do a video on lingerie too. What's right choice to wear with certain outfits. Pls. I'm waiting for it❤️", "_poornima_natesan_": "You're seriously a blessing!! These quarantine days are very stressful and depressing... but you're videos give life to my soul!! You're the best content creator in the world!! SENDING A BIG BEAR HUG❤️I LOVE YOU✨🌸", "divyavermaofficial5": "🔥🔥🔥🔥🔥🔥", "ishasoni777": "Could anybody be more perfect?❤️", "itsyahomegirlp": "How do you manage to look so beautiful, I can’t even ❤️", "subarna_bagchi_": "❤️", "kalpitadesai_.kd": "😍♥️", "eashallll": "Lol", "isha_shxrmx_": "QUEENNN", "vanshikashekhawat___": "You’re an inspiration to the youth. Stay the same always. Much love💕", "mesuzza_": "You look stunning in anything 😭🌹", "mostly_savvy17": "❤️❤️love love", "priyankaghosh.pg": "You are bomb @komalpandeyofficial", "bhagyasaiii": "Read the caption step by step and ❤️❤️ these are from vishakapatam 😘😘😘❤️❤️ you are amazing", "manisha_choudhury24": "Beautiful❤️", "ashreeyyyy": "QUEEEEEEN❤️", "shravyabandaru": "Wig", "ekta_guha_roy": "You are slaying as always miss pandey, so beautiful😍💕", "skincarereviews41": "Amazing! ❤️", "hight.9": "Same old makeup face body style n looks. Bored level 100", "varalika.k": "Totally love the video and you look beyond amazing. How do i order Dyson products? Bless you babe.", "aishwaryeahh": "gurl🔥", "hrishha21": "Oh my godd!! Finally a good feed. I was hating opening ig from last two days. It was so depressing. Thankyousomuch for a lil' fresh & good vibe.😭Love ya KO❤️", "troublemaker_since96": "Oh hello gorgeous.! 💋❤️😍", "with.h.label": "Perfect!! 😍", "sampritii__bhardwaj": "Hayeeeee♥️.....so good😭🤧", "shuaiba_javed": "You are a gem !! @komalpandeyofficial i love you and wish and pray the best for you.❤️♥️", "prettyprincessssss112": "Hi don’t you get split-ends due to straightening everyday ? It doesn’t damage?", "aarchikalra": "I jus love your choice of lingerie 😘 and I would say everything looks so good on you whatever you wear 😘😘😘😘 love you. You are inspiration for everyone 😘🤗", "sidhu8477": "He end is near....she is gonna end up nowhere", "duemoda_": "🤩", "d.a.r.k._h.o.r.s.e._": "Y’all, we stan a queen.❤️", "jshree_": "Hey how are you so ready... I mean you shave or wax ... just curious", "_.bhxmika._": "Chic chic boom ❤️ @komalpandeyofficial ❤️", "nusha_nush": "Love love love love 💕", "hina4589": "You are so inspiring ❤️", "_dharitri": "You are always awesome🔥💖", "deeshu26": "She is just amazing @komalpandeyofficial ♥️♥️♥️♥️♥️♥️ love love love", "fashunboo": "❤️❤️", "_.interwined_dodos._": "Such an inspiration you are😍😍", "salvitrivedi": "Aesthetically pleasing and soooo gorgeous 🖤🖤🖤", "fashioninstalifetrends": "@komalpandeyofficial Your night suit lingerie from ???", "_manasvi2931": "You are such a great inspiration ❤️", "get.glamorized": "Queeen for a reason😍😍😍😍 low key depressed to see my feed since last 2 days , Thankyou for brightening it up a little ♥️ for haters, it’s definitely not a good time to open İnstagram either, how about you guys just take a break from it? :/", "_sharonlazarus_": "Pretty😍❤️", "borrow_mystyle": "@kee_rums @rohinikalburge", "_tulsisharma_": "You slay literally everything.. 😭❤️", "rahulx._": "My all time favourite 😍😍😍", "okaywhybut": "I love you", "foodie_kanya_tales": "🔥🔥", "abhilashaj1996": "❤️", "keerthanamurthy11": "That standard wink in the end ❤️❤️", "cosmopopliton": "So amazinggg 🤩", "ashu.ashna_13": "You are so beautiful and cute 🥰🥰 love you di 🖤😘 am so inspired by you 😇 @komalpandeyofficial 😻and this video is 🔥 🔥🔥🔥🦋", "poonamaggarwalofficial": "You make me buy those thousand bucks lacey bras. 😍", "me_debasmita": "@chozzopazzu why just why?", "sumaiyaaaislam": "Omg I’m listening to the same song! And you look amazing as usual 😘😘😘", "shruti_sharma2003": "A piece of Sunshine on this cloudy day 🌤🌤🌤🌤", "aimansiddiqui__": "Where is ur robe from", "18delillah": "Just beautiful!❤️❤️ And Please do share some of your exercise schedule..I need it 😳", "naincy.raj": "❤️❤️❤️", "rah.ul5379": "You should audition for a pros role!", "edgability": "Now that’s just magic 💝", "san.stuffs_2.0": "I love u girl! I'm following u since ur in popxo.... Nd Iove your videos.... Now even I used to watch those videos... Damn refreshing & relatable... Love your all fashion hacks from top to bottom... But the one thing I miss the most is that bubbly KOMAL is vanished somewhere... I just want your that mode to be back 😄😋 #love from #odisha #staysafe ❤️✨😘 @komalpandeyofficial ...... I want a reply back 🥰😌", "anahata_yogini": "Which blow dryer would you suggest apart from Dyson?", "aqeelhyderr": "😍 x", "cookshooklife": "Yo girl you truly are an inspiration....I mean from make up to video shoot all by urself ....waaooo😳", "akankshadhiman": "I loved this look..u always look flawless 🥰❤️👌🏻", "moushi_tushtushi": "Looks lyk alien", "masum_adah": "Perfect 👌❤️", "himanshidahiya": "Posting stories how heartbroken she is and now she is uploading her videos. # Hadd ki fake ladki", "marinikaiso": "Just want to know where you get your lingerie from... 😍", "dandellion_06": "Nice 😍 you don't use any heat protectant serum or spray before straightener?", "_.shreyaaaaa": "Thats so simple and quick ❤️ thanks @komalpandeyofficial", "aanya_ballal": "Woah you're looking so pretty😘😘❤️❤️", "prasannaa_b": "😭😭such a cool stuff..... Literally I'm loving this stuff.....🤗", "priya_manhas18": "YOU ARE JUSTTTT PERFECT IN EVERYTHING... 👌😍LOVEE U LOADSSSS❤️❤️❤️❤️", "asmita31": "Wow! This routine looks so damn convenient. Thanks a lot! Could you please mention where did you get this ensemble! It's really beautiful ❤️", "tenacious_shubhangi": "U r such an inspiration love u❤️❤️❤️❤️", "jessica_arora__": "I m so inspired by you that i have started making my own videos do checkit out❤️", "giridev.sln": "So inspiring...", "aashna.is.bae": "I've made an edit for you pls check it out on my page! Ilysm btw. ❤️", "rj_ramya_": "Absolutely perfect🔥", "p._.rajput": "That shine tho❤️", "itsjujuu": "Queen! Will try this tomorrow! So chic 😍 #jadore", "chelsea_rozario": "Gorgeous , damn girl🔥🔥🔥", "kriti.singh2": "Which song ❤️@komalpandeyofficial", "gurjarji20": "nice", "wheredidmyavocadosgoo": "Love youuuuuu🖤✨", "srishti_vns": "Paddle brush ?", "prernatiwari19": "This is really so good 🤩🤩", "aintyouralien": "I miss the clumsy (simple, basic girl) Komal sometimes. @komalpandeyofficial", "aliasyd": "lingerie from??", "lpurty126": "Wow 😍 ! N this lingerie! From where ? 😍", "vanyaaaa_11": "You’re Gorgeous 😍💖", "preetbalofficial\nVerified": "Verified", "__avi__28": "Good", "anamishraa": "You're so beautiful. ❤️", "palaakkkk._": "Lotss of lovee to you💋", "reachmanuhere": "Love it❤️💯", "wendy_dsz": "U r gorgeous.. Love yr style and u.. 🤗🤗", "kmal_2310": "You look absolutely beautiful 😍❤️", "srashti.talreja": "You re Amazing❤️", "jiyax_pvt": "Love💞", "jaspreet_jazz_": "Beautiful ❤️ love the black lingerie set you're wearing.. 😍 carrying it so well..", "nainamarri01": "😘😘😘", "sweet._.preeth": "Wonderful💓", "the__pooja__3456": "💗💗💗", "mostlydreamy": "Woww🔥🔥", "nidhi___pandya": "Amazing. You're gorgeous 🔥❤️", "diyanah16": "Beauty! Ly. 💖", "sw.ati5244": "🔥🔥🔥🔥 beautiful people ❤️❤️❤️", "komalshahid": "Haters please stay away from this post. Be kind to others. Be kind to her. 🌟♥️", "komalpandey_18": "And i just freaking love you..u r just awesome😻😻😻😻", "hkaur346": "No heat protecting spray?", "kopalmaurya": "You are so good and you inspire a lot😍😍😍😍😍😍", "palakgaba01": "LOVE EVERYTHING ABOUT YOUUU GIRLLLL 💜💜💜💜💜💜💜", "komalpandeyofficial\nVerified": "Verified", "lifeofdeepanshi": "❤️❤️ wowww", "anushkaayaya": "It’s amazing❤️", "xumme.xx": "Your so so inspiring! I get inspired by you in so many ways! How do you keep slaying every time? Keep inspiring us komal di. I love you❤️", "_vyakhyadubey_": "@komalpandeyofficial YOU GODDESS 🤩♥️"}