{"_inaahsi_": "The ideas are pretty cool but can we really wear it in our society?", "shibu__04": "Summertime fashion ❤️", "adrrakk": "Well, these styles are not at all practical 😂 atleast when u r not a celebrity n going to an award function 🤷🏻‍♀️", "nikitaburkule": "😍😍😍😍ur fashion sense next level 😘😘👍💕🤘👌", "tadha_kishan": "😂😂😂🤮💩💩", "sahoo.milli": "Not wearable for all", "khushisinha111": "Unbelievable ideas😘😘😘😻😻", "pu_pink_bali": "Lol", "ruchi5282": "Jhandubaam....chiiii", "vishnupriya.singh": "Yuck", "v__thakkar": "@vedangi2600", "swateebhandari": "Very charming.Can anyone tell me what song is playing in the background.", "merhaba_zaya": "❤️", "anshika_singh_rajput75": "🙄Didi middle class log kaise style kre vo btaye bade log kuch bhi pehn le achaa hi hoga 🙄", "cjsodhi": "Disaster 😂", "magnanimousmanisha": "I find these funny", "mnz.008": "Where are the belts from?", "adityani.03": "Uff u are so beautiful🔥and u always rocks 😍😍🔥🔥🔥🔥", "shilpa_sinha_paid_fun": "Want service message me guys", "raikrritika": "Please come up with ideas where 12/14 sized girls too can flaunt their sarees in clubs!", "annihilator_10": "Chiiiiii yaaar. Unpadh", "jain5isha": "Chhhiiii yukkkkkk", "jyotsna_kanwar_": "Hate it", "aksharpanchal": "Pretty unique ❤️👌", "knittedmeei": "The black one.. 🔥 Exquisite. Absolutely loved it.❤️❤️", "shreeya898": "Makeup 👎🤲🏻🙏🏻", "reshma_6298": "Is that a saree..if u wanna show off u can..y to lower the values of culture and tradition..😢😰👿", "shivalika_mahendra_": "Something's needed to be kept in their original ways. Sari is a symbol of heritage, culture, and indian tradition. Why to change it to some stupid way?! What happened to you guys, influence ke naam pe yaar kuch bhi content mat do please . Be something good.", "crunchyfy": "Nonsense🤣🤣", "food_foodontia": "guys i am fresher and need bit of motivation..check my profile if u like follow..if dnt then please leave sugesstions..so i can improve... also @komalpandeyofficial has always been a great inspiration..i hope i can half to this point some day !!🙏blessings", "_kumaranimesh_": "Nice❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤", "anu_18tiw": "All of these... can't be worn on a normal day...or even on a special day...by a middle class...these styles look good only till insta....be realistic", "i_am_aaryan_mishra": "Mtlb kuchh bhi phenlo kahi se dalo kahi se nikalo fata chira kuchh bhi vo style banjata hai and girls be like wow how stunning", "kumarisneha71998": "By the way this is not a saree", "ritu_v1502": "Who wear these kind of clothes or style in Delhi/CP.. ofcourse other than fashion shows..try to make style from some casual outfits, it's kinda weird", "radhu_lucky": "Beautiful draping style but not half saree, half saree is dream of South Indian girls. U get to wear after attained puberty.", "pripatil_93": "Didi nahi aata toh mat pehno 👎", "vermasahiba": "You look good...but practically not wearable ideas!", "yushis_creativity_": "Noone would like to wear it as casual . Its like high fashion .🌻", "sunnykprooor": "What crap 💩🤦🏻‍♂️🤣 this is the ‘Chetan Bhagat’ equivalent of fashion 😂", "sonuthakur841991": "Lawda pr esa Idea bc tbi bc sv marr rhe h mtlv ki jiska jyda dimaag chl rha h wo bhosdi ka apni maa chudwa rha h", "afrin_suprian": "Hayre", "krutir92": "kya hum ye real life me kar skte h😿", "theliterature_geek": "the only reason i dont follow her is because,she shows us styles which is not wearable", "rose_mahi99": "Paradinha🔥 this song 😍", "drashti7": "Flat chested, got no figure", "_anubeee_": "Wtf", "goswami.lavina": "Song name?", "peter.nipu": "Seriously what kind of rubbish is this", "shekarbale": "@shradhargupta soo youu😂😂", "aarti.iyer": "Do your think you can style boots with saree? Like I have a fabric saree length, thought to wear it in a party outfit with boots. But can't come up with any.", "hrsht_": "Acha to lag nai raha", "melissafranciz_": "Brilliant content♥️", "i._.mandal": "Or madam ase kpde phn kr hum kaha ja sakte 😒 plz rply krna", "siddharth_.__": "Didi kuch esa batao jo bahar jao toh pehen sakte h !", "shandilsmriti": "Wdf was that😂", "javeriyayousuf": "@tazykhan 🙄🙄🙄🙄", "zehrahayat.khan": "Science apka kamzor lagta hai bohot hi wahiyat style hai😏", "ii_dancer_ll": "good", "milikorat": "Put some ways which girls would actually wear in real..Don’t just put ways for the sake of creating content💔", "callowartist": "Hahaha kuch bhi karenge.. Aur kaise bhi kar ke bs pehan lenge. N usko style Keh denge 😂", "happiest_77": "Tie a saree like this and go to wedding and see the reaction of people 😵😵pls make some good viedos with some sense 😡😠😤", "samakram37": "Looking like sme adhiwaasi frm jungle", "the_petite_joys": "oh c'mon tell something practical to wear .. it's all monotonous n i often think what if those belts were not made .. 😒", "shetty_manzaa23": "Meddh barnaga Dhoda nagul Enchane bairas thuthombini 😬@nidhi14jan", "as_rawal": "@chiya_19 apan toh saree fadd le itne me 😂", "_zabuuu": "VytEbz", "_w.i.n.r.y_": "Where are we supposed to wear it? Like in an indian wedding Or some party?", "nailiesbyarushi": "Wow i love the styling 😍", "storybookaddict89": "Well I love your fashion sense and all..but this stiffs..we cannot really wear out...do something which will really be helpful for us..it ain't really doing any good..(NO OFFENCE PLS)", "riddhimabaliyan": "I am just imagining myslef going like this in my brother's reception😂😂😂😂😂 imagine karne me hi gaalo par thappad ka dard mehsus kar sakti hu mai", "prerna_paswan04": "M all jeleous of your body... Why so good 😣😒", "moulik97": "Chhhiiiiiiiiiiiiii", "avantikaaa7": "Keep smiling beauty❤️", "kaafiprivate_1": "Didi saree science padhne se pehle science padhlo normal", "_hiral_dhodi_": "Esa pehne ham bahar niklenge to lok hame pagl samjege🙆", "mahek_arawkarcute": "Yeh hum normal log to nhi pehen sakte", "abibarman6": "Wow. 😍🔥", "dhingralucky44": "How are u looking this much beautiful in each dress u wear I too want to try this 😍😘😍😘😍😘😍😘 thanks for inspiring", "fk78692110": "Saree ki bhi kya zarurat hai", "_bindiya_jain": "Are you really going to wear saree like this 🙄", "niharika_cumberbatch": "Nooooooo. This is half concept for a half saree 😂. But yeah looks cool but I’ll never wear like this and go out. I doubt you will too 🧐", "_myownmarshmallow": "Just mind blowing ideas💯💯💖 @komalpandeyofficial", "thelatelatif": "@r_zo0", "shallysharma186": "I wish I could wear these kind of saree in your way 🙄", "letheislam27": "She has obsession to show her skin..😶", "iameshikathapa": "Sorry to say but you looking so weird day by day ...not the komal whom I admire a lot earlier", "simranpunchhi_": "Gorgeouusssssssssssssss✨", "kadur_sinchana": "Who wears like that dude ? 😂", "prettyasflower": "Bedhanga", "natasha_sharma2266": "My family will disown me if I wear all this 😂😂😂", "kirantribhu1": "i dont think anyone can really drape saree like this n go outside on the road..cz a slip here n there would be embarrassing as hell..ye ghar pe pehena he thik hai", "drpritha": "@saachayyy ei necklace", "___.coco.____": "I wonder if we can really wear that ? 😂😅@simran_vishnani96", "gusain4223": "Super cool 👌👌👌👌😍", "ishikas290": "@bhavya_singh1999 I will die", "japnitb": "@ntashab23", "bhavya_singh1999": "@ishikas290 I’m leaving earth", "chitrangda11": "@khushboomis8", "tamveel.mehmood": "@aiza._.n 2nd one!", "manasi____patil": "Matlab Kuch Bhi?", "poonam.p.jangid": "This saree style is only good for photoshoots, i cant carry it out of my room..😅", "manisha_dimri22": "@albele_alfaaz bta teri shadi me inme se konsa style carry karu ??", "gunjan_sidhu04": "@bharathreddy_2301 😂🤣", "usra__banu__": "Hey you are tooo hot to handle ..........😍", "that_aquarius_girl_": "Whats the name of the song??", "meghag12": "Vulgar as always!! Not classy super cheap n skinny", "__shewalksinthemoonlight__": "I just love ur belts collection😍😍🔥", "areesha__asfahani": "Seriously??", "maryam_rafiq97": "@rosh_roshmi_ Vai kichu bolo", "vrinda26chauhan": "Wouldn't wear this anywhere tbh. It's kinda funny. But great efforts 💥", "divyaabagri": "@adi__sharma18 @sangeetajayara ese kon saaree phnta h bc", "anshika.shivhare23": "Your styling tips are the best. It suits you in a way 😍💕", "pruthvi__hammigi": "Yuckk", "anikadhingra30": "Such an awesome video again Komal...thanks☺️☺️💗💗💗💗🙌🙌", "smiley_597": "Cheeeee", "hardeepsaini534": "😘", "nafisaaaaaaaaaaaaa": "What's the music please tell me?? Anyone?", "ink_1428": "🔥🔥😍", "heal_with_simpaa": "Your work is so brilliant ♥️♥️ Just hope if there could be more for 'regular' stuffs.", "yashasvi.gupta": "@shiji1990 KUCH BHI BC", "rajeev7442": "Beautiful parts of body inside kooking cean and clear. Good job nice Intertainment", "rashmi_wolverine": "Stop ruining the beauty of a saree", "sunshinepuja": "You look like Jeffrey star😂", "alibin39": "🔥🔥🔥🔥🔥", "_thegirlinmess_": "The 2nd one is oh my gosh😍", "parul.1610": "You are amazing 😍💕", "smruti_padhy": "Oh the second outfit idea is crazyyy 💜", "waking.wander": "Mujhe baatao didi aisi fashion hum karenge kaha?It is ok for instagram but ye public me kaise pehen sakte hain? Please give us practical ideas that we could try out.", "sonal.chadha1": "Bhai kuch bhi?", "sheetalagarwalgarg": "One thing I noticed that how she obsessed with showing legs 😂", "itsmr.sen": "I just really want to know who gonna wear saree that she showed at the last...", "thenatashagaur": "@ne_el0129", "rashmi.dhiman": "Well I love your music taste", "ipsita____": "Ew", "vanyyastories": "Really cool! you bring a different level to the traditional look 👏", "rshmii_12": "can anyone tell me the spmg name?", "kc_mahato": "#Useless #nsfanythingoutoor #literallytwelveyearoldme", "thysolesoul": "♥️♥️", "ksarkar22": "If only we were as blessed with a figure like yours @komalpandeyofficial but love live love u", "the_brave_damsel": "Tbh your ideas are great but impractical!", "__riasharma": "Eww", "_mostly_insane_": "OMGGG🔥 LOVED THE SECOND ONE😭❤️", "dreamindisguise": "Love the selection of music!", "annie.dey.351": "Waaaaaaahhhh🔥🔥🔥🔥🔥🔥🔥🔥💕💕💕", "coffeezara": "girl everything is repetitive! already seen this content from u", "basid8333": "Hay", "theanashtasiah": "Shameless🖕", "makeupandvlogging": "Komal apke ideas bht hi kamal k hte h love ur look and lov uhh😘❤", "sharrybali": "Superb 👌🏻😘", "santhoshi.km": "Please please I beg you, learn to make proper pleats! This video made my eyes bleed!", "dr.vasundhrakaushik": "Fabulous ♥️am soon gonna try as soon as this lockdown you are beautiful and incredibly amazing I must say loads of love and blessings ♥️", "neha_pandita92": "I'm not a kind of demotiving you ....but try something which is easy to carry in indian public ....but still the mentality of india is not that much advanced ....a girl traveling in a metro or auto ....she couldn't have the audacity to where this is public...if she can make herself deaf then its possible to wear....every girl who wants to dress like this have this fear that people in public use to comment them in public places .. The ratio of rich people is not up to that extent...that common person would carry this statement..Even few carry a religious disciple at there places so they also make their ladies and gals to follow the culture no matter how much wealthy r they ...u r a fashion influencer ...I really appreciate what u do ...I knw u might think who I m to give a opinion ...but a little knwldge sometimes makes big sense. Regards", "dakshiniillish": "Aur kitna dikhogi! Dekhne ke liye hai bhi nai kuchh...", "all.about.layers": "Genius!🔥", "rocheryl": "I want to steal your playlist !", "mostly_savvy17": "Amazing 😍", "risk_a_little_": "My boobs would be allover the place if I do the second one 😂 @upsc.fever_ poora dekhio", "maithilee_kulkarni": "Kash I can flaunt like you...you are gorgeous and have gorgeous body and your videos are too good♥️♥️ @komalpandeyofficial", "binny_ahluwalia29": "High Street Fashion :( some ramp tucks ... not affordable fashion", "priyaguptashines": "Always experimental .. ❤️", "a_dreamer74": "Can you please do a video on styling a harem pants. Please do it", "jhuin337": "Without the bra! Really!! That’s not only highly misleading but also if anyone tries it and end up with a wardrobe malfunction how will you take responsibility of that @komalpandeyofficial ke yaa fir yeh sirf ghar ke liye hi seemit hai ideas? Don’t hate on me. I’m consuming her content , the content she is making of, and I’m allowed to have an opinion. Thanks", "adarshkhoniyal_official": "Amazing❤️", "ruchi2110": "Aisi sari to practically shyd possible nhi wear krna😊", "shrejalsonkar": "Ohhh l love that chokkar", "liya_george_veeramana": "hi komal i love ur creativity. but how we can ware these things nd go to streets ?.", "dipabanik96": "https://www.facebook.com/dipa.banik.56614", "akankshasinghsisodia": "Why only for 10% of the girls 🙊", "khamosh_haraami": "Aeeeee pagal aurat sareee ki mc tuney", "aa.n.chal": "I love you and your outfit styles😍", "989_saif_ali": "😂😂😂😂😂 nice comedy", "kinjalkapil9": "U looking fab.Would request you to please also check your dm’s🌸", "eshita659": "Not everyone can wear this..", "moonstruck._.child": "Didi u are not goinna take this fashion anywhere....be realistic....", "_.shreyyaaaa_._": "🔥🔥🔥😍😍she is super creative.... Mindblowing❤️", "mayurikushwaha": "From where have you purchased these sarees?? Please tell.", "mukeshpal371": "The dress is pathetic. Saree looks goods traditional or with very little modern alternative. So please let it be.", "ahana_21_": "Your ideas are totally different in every videos which is good, I mean you experiment them. BUT the thing is that it only looks good when u put all together looking fine asf in your videos at HOME. Haven’t seen any of your “Draping sarees” “scarf” and many of your experimenting clothes wear you outside and take pictures. U think people hate u for this, but sis, we support u and give our opinion that this is not what many of us Indian girls would wear. It’s totally not wearable. Wear it in a function or outside then TALK.", "mehak_mundepi": "No one can wear this anywhere thou", "not_akankshaaaa": "Omg goddess vibes 🔥😘 @komalpandeyofficial", "___radhika_____": "Not hater but ur style is smthing that normal Indian girl can not wear😅 its to extra😒 do smthing that every gurl can relate with🤗", "candidmemoirphotography": "Wow! No one can even guess that it’s a saree", "unnatigandharva": "❤️❤️❤️❤️❤️❤️❤️❤️", "asjadhabeeb": "😳😳 DARN!", "akshita.k01": "Which normal girl would wear a saree like this in public??? Or even at an occasion? Please keep the elegance of Saree.", "thelilshareofparadise": "How are these even wearable 🤣", "chariellet_lara": "Boring.. nothing new in your videos.. try something new. You are making this type of videos from last two years 😊", "shiprashukla": "Oh..!! Don't spoil the culture, fr the love of God, don't..!!", "prernabhallabeauties": "@yuktapujari try this man", "gautam.sneha2906": "All your style tips r perfect for small bust girls.. 😒 wat about heavy busted girls like me.. pls give some tips for us too", "livinglife_queensize": "I loved it when you threw away that black bralette ♥️♥️ what is your fuel??", "pandeyflies": "Can anyone be more inventive than you in fashion! Breathtaking ❤️😍", "misschakrabortyy": "Omg! 😍❤️", "nishtha1515": "Absolutely stunning 😍 Also which song is this?", "tanm67": "Kch bh bahi... mtlbb tum ye saree pehnke...kitty party me bh nh jaa skte... marriage ki bt to chdo😂🙏", "silky_hair02": "Kya bakwaas hain yeh .. matlab Kuch be .. bewakoof", "arushee.sharon": "Amazing ideas❤️ though for busty girls how would they remove their bra😢", "reevy0607": "Please don’t spoil the elegance of the Saree @komalpandeyofficial", "betterthanyouanyway": "@tanyagulati3 please wear your sarrees like this😂😍", "_.prettysoul._._": "Loving you.. A bigg fannn❤️", "mahimakabra": "where can anyone where such styles?", "hetal_devil": "Love ur necklace and both the ideas 👍", "sakshidhawale99": "No fashion saree can beat traditional saree", "deynakshatra": "You are really impressive😍", "bhartina_talukdar": "Wow❤️", "mital_9009": "Bahen 🤦🏻‍♀️", "sonakshiagarwal0304": "Chutiya aurat ase kapde pehenta kaun hai, tere ghar me ase nange ghumte hai kya😂", "kaul.shaifali": "The second one looks like a cute dress didi😊", "selenator_till_end": "What was that first look 😵", "tatinigupta": "Not wearable for everyone 🙄", "chasingpixies": "W.O.W! ❤️", "bong_n_bonker": "😍😍😍😍😍😍😍🍷🍷🍷", "esha_rh": "What's the song?", "fashiongospel_7": "This is amazing!!🎉🎉🎉", "aprilhavenz": "Your foundation is too light :((((", "simsaysstyle": "This is just amazing 😍❤️", "sakshi.nigam22": "Oh my god...those sarees😍 where can i get that black one from?? And also can you tell me the song?? 🙋‍♀️", "pooja.pandey1": "Where is the black saree from???", "pvt_riii": "Greattt🔥🔥🔥👏👏👏🔥❤️❤️❤️, although I loved the first one as well but the second one got my heart", "m.a.d.s14": "But wearing this in india is not possible in real life😶", "surabhi.singhal": "This is awesome...your looks are sooo amazing 😍😍", "iqra.zikaria.58": "@nooreenazhar kia khyal ha is eid pr hjae ye🙈🙈", "nupur.k11": "You give us all confidence to accept our body as it is, and to not to shy away from wearing anything and everything that we wish to. You go girl! More and more power to you💖💖🌹🌹", "yours_rohan_": "Pretty 😀", "amrutakar": "To people asking about the song it's Paradinha by Anitta! Thank me later.", "fashionistaspeaks": "When it comes to outfit styling...you are brilliant !!!", "nandinisawhney_": "Your vids.... ufff 😍😍😍", "anjalee8": "Love the second one 😍❤️", "_p_r_i_t_i__92": "Show something which every normal middle class girl can wear...🤗", "shwetaab9": "I had same thought ... Aise pehen ke shoot karksakte cant wear bahar 😃😂😂😂", "baishali_sarkar28": "Damn😍 Your creative ideas are freaking brilliant🔥👌👌", "damandutt": "Useless😒😒", "_punyashaaa": "Itni creative kaise hein aap? Zara hume bhi batayiye.", "ritika_harania": "Lol if you have to go to washroom for the 2nd look🤣", "suhana_art_and_jewels": "Superb 💕", "soniya_ansari_28584": "👎👎👎👎", "samriddhikasera": "You take styling on different level😍", "riya__rose__": "Omggg you killed it!🔥🔥🔥", "belle_moi_official": "Breath of fresh air ❤️", "itsmanisharawat": "Why so perfect😘😘😘", "cocomomcuddles": "This is that one apparel that enhances your personality a 100 times ❤️", "spread_love_happiness101": "I am a girl and i feel u are way too hot to handle 🙈🙈🙈forevrr my girl crush..why why why so hot yaarrr...like srsly,u are creative and confident and evrything good ...but this level of hotness?? Tumhe koi haq ni banta", "srestha.rath": "2nd look🔥", "pallavishah_": "Which song ?", "d_way_u_c_me": "What's that song 😍", "yourfemalemusaafir": "Loved the black one 🖤", "glamgrambyiqra": "Love your ideas❤️", "surabhi_.shree": "Your body is ❤️❤️", "the_true_story_of_manvss": "fashion diva🔥❤️", "vaishajeet": "Incredible ♥️", "jagyaaseni": "Why do people hate on you, you're literally so kind and talented, and you're replying to almost everybody, almost noone does that these days. Love from Bengal.💗", "rehankapoor9856": "Beautiful😍", "_maitriii.iii": "U are just so amazing 😍😍 ur big fan 💓", "lmwilms7": "You got new skills ❤️", "tanya_deshmuk": "From where is second sari from", "not_so_dangerous_togepi": "Oh my god, i am in just love with your such amazing and unique ideas. So inspiring.🥺🥺🥺♥️♥️♥️", "richaa.chaturvedi": "Just love your style 🔥😍", "chowdhrain": "Loved the draping ❤️❤️", "makeoverbyshatabdi": "How? How on earth do you do this, Komal Pandey? Brilliant! 😍", "khushboo_jain2708": "You are just bomb❤️❤️❤️ love the way you style", "nobyalolita": "@d_upma I liked the background song tho💖", "ishiitaaa_": "Where's the belt from in the first look?", "bhabaldeepali": "How can you komal...you are nailing it everytime..and I always think I never seen this..so proud of you😍😍", "ishani_vr": "U r gorgeous beyond words!!! Can you please share the deets of the black saree as in where it is from and all??? 😃🙏", "r_af_tia": "Anyone can u tell me the music🤷‍♀", "shereen_rafeek": "Hot and how🔥", "sneh.sheoran": "Komal please you really need to understand tat kuch bhi lapetna is not fashion.", "littlebonggirl": "@komalpandeyofficial the second one is super cool😍", "meghana_saranga": "👌🏻👌🏻😍 Ur fab", "design_sparks77": "Awesome 😍😍😍😍😍", "crazily_alluring": "Love your vids all day, any day😍😍😍😍😍😍😍 And the song judt added more spice to it😘😘", "the_fashionista_mom": "Absolutely loved the 2nd drape!! 🖤🖤🖤", "sabil_jawaid": "Ur style is amazing it inspire us a lot😍", "iam_nehapandeyy": "Whyyyy are uhhh alwaaayzzz so gooooddd... Damnnn.. We love uh di.. God bless 😙😙", "artwaale_insta": "Hey Komal, absolutely love your fashion sense! 😇 But will you also be able to guide curvy or plus size women with your fashion tips.. really looking forward", "hashtagbongoriginal": "😍😍😍", "chooose_well": "Styling with the black one was too good! Loved it! 🙌❤️", "pridhi2011": "Creativity with sarees are amazing😍", "thisstylediary": "That black saree ❤️❤️", "readyforglam": "Love your work but it’s high time you should upgrade your wardrobe. Same clothes/accessories in every single video 😏", "thevanquisherempress": "@dope_soul01 Try this once it's really cool you will look gorgeous in this ❤️❤️❤️🔥🔥🔥🔥🔥", "shivanguu": "I really love your black sari and the blouse you have used with it looks so damn pretty every time you style it😍", "prasadlatthe": "Do u think its practical 🤷", "priyankajain2540": "#creative #repurpose #pullingitoff", "sugar_lips999": "Always stunning", "irupalikala": "Oh my god😍😍 you make me fall in love with you EVERYDAY without fail♥️♥️", "haimanti501": "Uff ...you ❤️❤️💋💋💋", "__wordoftheday___": "THIS IS TOTALLY DISGRACEFUL 👎👎👎👎👎👎👎", "chopra_dishika": "Gorgeous... love ur ideas ❤️", "lee_lina24": "Komal=hapiness=goodvibes💘💘", "priyathakurt073": "But this is not reality...not realistic fashion...I mean look at the drape it's so unreal and non comfortable", "archana_nair2210": "You gotta be kidding to wear this beautiful kerala saree like this and calling it half saree. This isn’t half saree🤦🏽‍♀️ @komalpandeyofficial", "3_ghost_notes": "Why she wearing a gym belt tho?", "soumi_inst": "😘wow.. u r just too good... big fan...", "vash094": "You are so good in fashion literally.. Hands down💯❤️", "i_am_bliss_jenn": "Lovely as always 🙏🏾❤️ Stay blissful", "aditipanigrahi._": "You don't realise that you add a belt to every outfit of yours, do you?", "mitiitheprincess": "Which somg??", "delhifoodgedi": "Giving such ideas which are not even practical. Just good to see in pictures. You can’t/ won’t go out like that. Spreading false statement.", "cashmeen19": "❤️", "somethingsarcastic__": "Wow😍😍😍😍😍😍😍😍😍😍", "_rukudi_": "Black one 💋", "hheyra": "Very unrealistic video !", "snehababes.isha": "From your first video to today, I couldn't find even a single style, that you cannot blast..... How is it possible for just single Person....🤔🤔🤔🤔... SO GORGEOUS BABES ❤", "dpkadhakl": "AMAZINGGGG❤️❤️", "meeta_sush8": "Hahaha😂", "glitterinmyeyes": "Overrated influencer with senseless style!", "srishti_parulekar": "What's the name of this song @komalpandeyofficial", "priyanka_madaan89": "Omg.. saree m apse best koi nhi 🙌🙌🙌", "rikita_debbarma": "Yu r Fabulous From where yu r gttng such an amazing Ideas yu r really a fashion legend Komal❤️💋💋", "aishaahmed_44": "Glam girl🔥🔥🔥😘", "diipakhosla\nVerified": "Verified", "curls_that_twirl": "Wowww you are amazing!! 🔥🔥", "anshika1993galaxy": "Whicj song is this?", "khyati_2908": "The jhumkas in the second look🔥🙈pls pls pls tell where are they from❤", "sumanrath12340": "I love ur style 😍. It's very unique and fresh❤️", "stylewati": "The black one 😍😍😍", "mansi_dezign": "Oh my goddd unbelievable 💕💕💕👌🏻👌🏻👌🏻how do you think Mann!!!", "maitri_rathod_05": "Your videos are therapy ❤️", "stubborn_leo_1908": "Dude, I love wearing sarees but the styles shown by you cannot be carried out by most of the girls. Please do something practical 🙏.. that everyone can carry off", "pretty_teen_3012": "First of all this one is fire🔥🔥.. How can someone be this much creative😍.. I love uh komal😘 you are my inspiration❤️", "rayasarkartinni": "That black saree😲😲😲❤️❤️❤️.. Omg", "rehhaakhuranna": "Beautiful", "crazy_girl_fever": "What's the song name😍😍😍😍😍", "sachin.arora9": "😂😂🤣", "kookie_nil_": "I love ur all therapy videos bt saree videos always stole my heart 🔥😍❤️ ..You are so beautiful to handle 😘", "lenovojuju": "I can't think of anyone else apart from you who can pull this off! ❤️🔥", "_imnanditasingh_02": "ur ideas are amazing mam 🌸 ❤️", "thatfeline.enthusiast": "How does one get so creative🙌 Also, you're BEAUTIFUL 😍❤️", "saiishas_vlog": "Loved the second one 😘 gonna try soon", "zee.makeup": "Damn😍", "sushmitaaw": "If I may suggest please do a video on how to carry yourself with the ease and elegance like the way you do 🔥", "s.aggarwal.5": "Mam Main aapki fan hu plzz ek video bnaye weight kam kese kre uske uper ❤️❤️❤️", "rajpriya24": "Aapki nipples dikh rahi h", "mehakkkkkk99": "Nange hi hojaate hai", "_salonikapoor": "You’re a genius 😍♥️", "preeti_pal_12": "Bakwass", "_trisha_arora__": "Mam u are such an inspiration for many girls...u are extremely talented mam...i wish i could also learn something from u....u are the best❤❤❤.... obviously i cant try everything u explain because i dont have all the stuff u have...mam ur ideas are really freaking brilliant ❤❤❤", "middha0kanika": "❤️", "kaushal\nVerified": "Verified", "___alisha__singh__": "This looks amazing.... but totally impossible in real life....", "priyal__asthana": "2nd one ❤️", "kachhapmanisha388": "Now I even double click your videos without even watching 😍😍👌it's brilliant btw..", "rainbowonawaffle": "Gorgeous 💚💚", "shilpi.rrambaran": "I think this luks good on camera, but is not realistic.. if you wear such pieces in delhi, no 1- super difficult to step out of your house without your mom giving you looks, then comes your neighbors, press waala, etc etc, metro me ppl, auto waalas if u take an auto.. it is only fine if u have a car and also then it can be a prob, coz traffic signal pe guys are gonna pass comments and then follow your car and harrass u at last.. so this type of dressing is not realistic at all..only wear such outfits in your room, maybe click some pics, post on insta and then change to normal denims and t shirt and step out 🤗", "_ichhachugh_4002_": "2nd🔥🔥🔥🔥", "snimal_mhaske": "Komal di ilysm❤️i will also try it!!!!😊", "juveria_inam12": "Maam u slay it everytime🔥🔥🔥🔥", "charvijain1003": "Can't decide which one to wear for my farewell 😍😍😍😍 Your ideas are sooo greaaatttttt❤️❤️❤️", "ushahahahahaha": "FS : On point. 👌❤️", "barkha.sharma_": "Loved both the saree, from where you got them?", "deepika_gupta_": "The second one❤️❤️..Uuufffff it is burning yaarr🔥🔥", "aarohichatterji_mua": "Increased my love for saree!!!😍😍😍😍😍😍😍😍", "manya__10.00": "U kill it in every single video . I wish u reach to a level u desire for ❤️❤️🔥", "__.nehaa._": "Black one is 🔥🔥🔥🔥🔥🔥", "mama_and_arjun": "Very much impractical and useless dressing ! Plz take it as a positive criticism! I like your makeup styles, but your dressing sense is weird ! Saree is already a classy and graceful dress and you spoiled all the essence of it ! I never even saw any celebrity or actresses wearing such styles ! Who will wear these styles dear ???", "chaitrahl": "Which is the song thts playing??", "supreeta1996": "Hello all you beautiful people. Want to distract your mind to the fact that I run a food blog and come up with various concepts too. Please follow me if you are a foodie and also like my posts. I will do the same for you❤️ If you don't see me doing, you can unfollow me then only. Lots of love to you all. Keep supporting.", "pratikaagarwalla": "Which song is thiss?!", "sravyayamini": "Aww didu how come u slay in every video😍u are always an inspiration..for confidence..for creativity..for consistency..for believing in one's self and for everything❤️much love and power to u didu...we love u..always😘", "charviimehta": "why didn’t instagram sent the notification for this post! 😭 anyways, loved the video ♥️ keep inspiring 🌸", "aabha_patairya": "one word for this vedio is disgusting", "sakshi_keswani_": "You are so beautiful 😭😭❤️❤️❤️❤️", "anisamaity": "Wooow sooooo amazing sooooo Killerrr komal... LOVE..... WONDERFUL 🎇💜🌸💛🌼🌈💮🎀🎋🖤", "whatswrongsaakshi": "Where did you get those belts from?!", "itz_pragz": "You are brilliant 🔥luv ur fashion sense", "kajolkohli26": "That black outfit 🙌🏻😍", "anupriya_20": "♥️♥️♥️♥️", "swapnilgore2525": "This are all such practical options. Amazing!", "koyelballav3377": "Wow", "shruti_s.p": "beautiful 😍as always ❤️", "imart_eee": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥OMG 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "soumyashree.dixit": "Nonsense", "sadaf_thecutiepie": "I just love your earrings. The black vla😍😍😍", "preet_pawar95": "I love your fashion sense 😍but just one small question, can we wear it on daily basis ?", "the_content_soul": "OH ! YOU BRILLIANT BEAUTY MIND .🔥", "shanicegaztambide": "The white belt is fab & how u pair it with different outfits is iconic❤️", "tanzeela007": "@komalpandeyofficial : I have a doubt: these ideas are quite entertaining however, do you go out wearing these creative outfit ideas.", "chettri18": "Really??", "kashmiri1677": "U r mind blowing 😍😍😍😍komal😘", "aakankshaaparmar123": "Where did u got that black tregging ??", "iamsonalsuryavanshi": "Sheer talent. 😍❤️", "maggyofficial7": "The end was epic🙌🏼", "__her_painting": "Trying soon❣️🔥", "alvi_saiyed": "2nd 😍😍😍", "illustrationswkhushi": "Wowiwowiwiwiwiwowiw", "ibtibear": "😰 omg u so hot", "riyaasinghhh": "Kuch bhi?", "_.c.h.a.i.t.r.a._": "🔥🔥🔥 how do u do it 😭 its awesome", "pihu_rythma08": "Lit 🔥", "haramolkauralena09": "Woahh man❣️...Komal u r jst🔥🔥", "sunu_sen": "Where's the navy blue saree from???", "kritika__kathayat": "Plss make a video on how to drape mumma's lehnga with new stuff... PlsSss❤️❤️", "drdevikasahu": "Plzz plzzz few things should not be improvised like don't change a saree it s beautiful on its own", "adhikari_rashmee": "But....Never seen you wearing these style of saree in publicly !! @komalpandeyofficial", "_komalmittal_": "I'm drooling 😍🤤", "sandhya_dorai19": "You are just just wow❤️❤️🔥🔥", "bp_under_review": "Seeing your media after a longish break! Your hotness quotient has gone up, young lady! 😍🔥", "teena__431": "Lmao r you serious abt this", "hight.9": "Atleast dont give the same expression everytym... show smthing new in ur face... too mch bored wd repeated almost everything... 🤦‍♀️🤦‍♀️🤮", "shalmali_9798": "Hadd hoti hai matlab..fashion ke naam pe kuch bhi lapet lo. Isko koi kele ka patta de de toh wo bhi lapet le wo 🤣🤣🤣", "akansha_.201": "Do you really think the fashion ideas you give anybody can implement in their real life? 😅", "8387_nikhat_1256": "Which brand's belt is this ? I want to buy !!", "riyamodha": "Amazing 😍😍", "hasnaaaaaa.h": "Love this! Would love to try the 2nd style! Pls do more on how to style a saree as a dress 🙏 Lots of love ❤️", "chauhanrax": "day by day you are taking it to some other level🔥❤️❤️❤️🔥🔥🔥🔥❤️❤️❤️ hope you read this and feel proud of your self and take a moment from your busy schedule to pat your back, because you are doing amazing ❤️ love you.such an inspiration😘@komalpandeyofficial", "paul_anamika13": "How can people not get inspired by you😭❤️😘", "_riyas_world_": "Second one 😍🔥(black one) saree🔥", "imvenu": "Where did u get those belts from?? 😍😍", "shreyaaahhh": "Gone are the days when Komal used to be relatable. Anyways, creativity👍👏", "the_rebellious_chic": "Damn🔥 The second one❤😍😍❤️❤️❤️", "namratabarman": "You have great ideas but for the normal women out there who have to take the local transportation to places, and who can't travel every little place with their car, this is not even near practical, but I love the fact that you have fun and try to come up with new stuffs and your videos are amazing! ❤️", "im_piyu_khirwar": "Why i mean why u r so pretty nd hot at the same time??? ❤️❤️😍😍", "jshree_": "Where is the green skirt from", "nusha_nush": "Wahoo love the second one 😍💯🤷🏻‍♀️", "purabi_koley": "@komalpandeyofficial oh man! this woman! you can do wonders babe😘", "zeba_iqbal1029": "Komal be like : Arey kuch bhi dedo yaar i am just gonna rock it🔥😂 Love love love your style😘", "little_miss.7324": "😍", "monica_bhatotia": "🤩🤩", "khushbu.sharma.923": "No way...i aint stepping outa ma house widout my bra", "aarzoo.sharma11": "The blck saree look is amazing 💕🤩", "itsmaaahhhiiraa": "Uff this is good 🔥🔥🔥🔥😍😍🔥", "simmi._.mittal": "Oh gorg ohh gorggg ohh gorggg idk when should i stop saying ohh gorggg🙈🙈🙈🙈 HELP MEEE"}