{"subhashreedas.7": "You are such an inspiration!!", "vishnukumarkongassery": "Can u say me how to make such cute nails", "jdisha.03": "Can u plz tell what u wer in foot", "shubhi._agarwal": "@meghal_12 the dress though 😂🙈❤", "rash_mufaddal_": "How to loose thigh fat ??", "d_n_va": "Thats great. Cant wait.", "anutanwar2": "❤️❤️", "monika.kh": "@komalpandeyofficial my question is how to get slimmer without exercise??", "shrayashri": "Do share some your previous pics please. I want to see how did you like before then!!", "radhika_karanth": "How to shed the last few pounds... I swear they are the hardest", "mridula2601": "I can't believe you were fat too😂😂", "radhika_sinha_": "full diet plan and workout plan", "anisamaity": "Superb", "_.vanshika_xx": "Jawline advices 🔥", "_cubicsizzler_": "Tips to lose tummy fat?", "k_rishnaverma._": "How to reduce belly fat?", "theheartandthe": "Type of exercise u did 2 reduce weight..ik u cant lose weight frm only 1 part of it body so wats ur exercise routine u followed n how did u stop ur cravings for junk food at tat tym..n sum exercises u can do at home 4 a beginner esp lazy ppl lyk me", "vaishnavigawande99": "Hey komal please share your secret regarding perfect cheekbones.. please let us know how u did your diet plan too..lotsoflove😘😘😘", "joshi.monalisa": "@komalpandeyofficial how do you get the determination for doing your exercise daily... How often do you have your cheat day..", "roy_officialbeardman": "You don't even need weight loss", "mhajani_": "Who inspired you to loose weight?", "nupur_v": "As being a college student and live in hostel what to eat and what type of exercise should be done to overcome weight gain.", "ravjyotkaur_": "How to deal with thigh fat.", "_additi_": "A really good idea!!! Wanted it from sooo long!!!❤❤", "zeelbaradeofficial": "waiting for it", "moumita_kathak": "@komalpandeyofficial how to maintain regular exercise and how do you manage to get fit when you are so busy with your work all the time?when you get time to do this?", "enigma3291": "Mam how to reduce only waist and thighs fat but not breast fat at the same time", "best_life_ever_had_2k4": "Morning weight loss exercises", "simramoin_": "Belated Happy Birthday Ma’am...Lots Of Love To Your Way♥️♥️♥️ And I Wanna Ask About Jawline Exercise 🤗.", "_global._.tummy02_": "How to loose thigh and hips fat", "g_vedika": "I want to know how can you control yourself when there is french fries and pizza in front of you.....its really hard 😐😐😍 ily", "prettylittlevirtuoso": "💓🌺💓🌺💓🌺💓🌺💓🌺💓🌺", "_sayali_vaidya": "Actually ive surfed enough about weight loss nd i really want to loose my weight bt dnt knw wats gng wrng", "tanyakhannaa": "How to reduce arm mass ?", "tarannum.tasneem": "I've heard that doing workout exercises when you already have a belly, causes fat muscles to build up. What exercises should I choose for working out which will not build up fat muscles but will rather burn my stubborn body fat?", "ampersand.journal": "CANNOT wait for the video!!! 😍", "bishakha.xo": "Hi Komal! I love ur style💛... the way u dress urself and the confidence u have within urself. I wanna know how to slim down my face just the way u have done and also how to lose weight for a not so active girl :3. Love u Komal di 🌸❤", "chaitralidas": "Where were u past last week.. no videos...", "dia_adrija": "Some tips on how to reduce facial fat n neck n shoulder fats... Please @komalpandeyofficial", "amritashukla_001": "Flat tummy and thick thighs?? @komalpandeyofficial", "neeru_baiju": "love from nepal komal ❤❤❤ my question to u is how to slim the face and get cheek like urs 😍", "faryal.tigress": "Your workout routine", "manpreetsahani": "how do you manage to be so fit all the time", "pritzz.pradhan": "I'm on my path to lose weight. But don't really see much difference on my bust area. How do I lose enough from the bust area?", "korishmita__sarkar": "Hey komal di.... Can u advice me something how to lose belly fat..??", "divyapraveenjoshi": "How to loose belly fat?", "lathavaloor": "Is there any way to lose our weight without exercise", "pydahratnakumari": "How to reduce weight from lower body??", "riadogra03": "Hey Komal, I love your videos and your content❤❤❤ My question is how to have a slim face and a chiseled jawline just like yours and what yoga or facial exercises would you recommend to all of us? Loveyou 💕💕 @komalpandeyofficial", "venyaraj": "Aur patli", "anjali.love100": "Hey Komal. What was your diet and exercise routine like? Since the weight loss, have you made any changes? @komalpandeyofficial", "rouny_s23": "What is your daily schedule for stay fit 🤔??", "insta_naina97": "Please I really wanna get rid of doub chin and chubby cheeks @komalpandeyofficial", "riya.khokhani": "How to slim down thighs and tummy", "nishitha_basavraj": "I'm really trying to lose weight, but I give up very soon, the maximum I could diet is for 2 hours n same applies for exercising as well, what to do plzz help me komal", "zoori_red": "What is the best and easiest way to loose weight?? Diet or exercise and yoga???", "suhanisethi456": "How to loose your thigh fat?", "ttgarg_022": "How to lose baby fat", "subholakshmic": "Belly fat is a big problem! How do I get rid of it?", "vani7bhatt": "Babe❤😍😍😍😍🙋🎉🎉 @komalpandeyofficial", "sanianadeem2003": "Did you exercise?", "roshninaik____": "Tell us about your jawline . You said you did facial yoga . Can you share the details .", "nazminsdailybook": "how to keep ur self motivated? as i believe everyone have a different way of keeping them self motivated towards their journey. please share ur motivation story", "i_fiaa": "Double chin and big waist 😒", "mathangi13": "How do u manage to not touch junk or any unhealthy food wen u r dieting and also super hungry", "anindita_das12": "How did you control your diet?And how did you find the motivation for working out? P.s -I love you and your sense of style ❤", "adi.neupane": "How about body marks during the weight loss? How to deal with those?", "__royal_jain_bhumi__": "Di oam", "poojaaa_purohit": "Y is being thin and skiny so imp ? I know some of us do it fr ourselves but a few only to be a part of a group of thin people etc , i wld like u to tell if for you weight of others matter? @komalpandeyofficial", "badmaaash": "Please suggest some tasty snacks that we can munch on🙈", "manpreetnagi_": "You really think that you need to loose weight 😵", "edgeful_": "Does Zumba really help to lose weight?", "kartiksonali": "How to treat stretch marks after losing weight??", "aanshula17719": "How to get rid of stretch marks?", "sanjanak_cc": "is eliminating rice the complete solution for getting thin??????", "29_raixx": "Any tips on double chin?pls", "anu8269": "I just want to know how to maintain a healthy weight and glowing face.😳", "itwinnkle": "How to reduce weight from your upper arms. Because of bulky arms, i feel quite under confident when i try wearing sleevless clothes once in a while", "nupurgoel.96": "Heyyy! I wanna know how to loose your arms fat?", "anjanakubasad": "How to eat everything n maintain d body🙄???????", "_prachi_pandey__": "Hey @komalpandeyofficial I want to knw that how u got an perfect shape of your face do answer plz some facial yoga", "muskii_00": "Hi komal dii I really want to reduce my full fat body can u tell how many days or month you took to loose weight", "aman101912": "Pls advice how to lose fat around waist 🤔", "waniyaanaseer": "Hi! I love your videos! Can you please tell us the kind of snacks we should eat because I am a snack addict and cannot stop!! Thanks! LOVE YOUUU @komalpandeyofficial", "samairaaaaa._": "Hi @komalpandeyofficial I love you and your channel so much.. My question is How did you feel when you were a bit chubby and how to get rid of chubby cheeks and double chin.. Bye @komalpandeyofficial", "sarafhardika": "😘😘😘😘😘😍😍😍😍😍😍", "veena._.varshini": "Pls share ur diet routine", "priyanka26npl": "Hey @komalpandeyofficial How to loose belly Fat?And how to Control yourself regarding weight loss? And and Did you consult any dietician for meal plans?I just love your videos you are beautiful 🌹❤️", "manat_jain": "How did you control your cravings for junk? And how much time it took ?", "moksha5671": "How did you do this komal dii i also want to know and look best as you...... please reply to this as i am fat and everyone teases me... hope you understand.☺.Love you @komalpandeyofficial ❤❤❤🌍", "_dr_bipanchi": "How to tone arms and how to get a narrow waist", "_yashvi._xx": "Hi, Can you loose weight without dieting and only working out ?? Ps I'm a teen !!", "purified.mess": "I want to have a chiseled jawline but I m not able to", "gurly.curly": "Hey komal..my sister who was thin like a stick got fat after her pregnancy..and she wants to be fit again..also she is lazy and can't do much as she also needs to take care of her son..kindly help with some suggestions", "priyashukla10": "Looking forward to watching it!! 😊", "jahnvi__nayak": "How to loose weight faster without dieting", "gorgeouspuja": "Plz let me know how to reduce weight just dieting", "khilakbinon": "pls tell me honestly if there's any chance chance of loosing weight without giving up eating and without any exercises??😐😐@komalpandeyofficial", "her.happyface": "@komalpandeyofficial i am doing job ..i am just 19 and i don't want to loose weight ..i want to loose fat from my tummy area only ...how to manage ??? How to do it while doing 9-6 job", "shalu6_": "I want to know your weight gain journey too☺", "__nysaaaa__": "Does drinking warm water empty stomach reduce belly fat?", "shaashtra": "I am 18 years old and I'm short (5'1\") and my weight is 55. I went to the gym to reduce belly fat but IT JUST DIDN'T GO DOWN. I mean I did see some reduction in my belly size but my weight is mainly on my tummy and my face us also kinda big... what do i do?", "americana_loves_": "HEY , LOOKING GOOD", "taraskincaree": "I am 55kg now can I reduce to become like you in 3 months?", "monali_vasu": "Which works better? At home exercises or getting a dietician' s advice?", "menon_sunanda": "Hey komal! How do u keep urself motivated to stay fit and eat healthy? Am a foodie and I love junk food 😬Eating healthy is the biggest struggle for me.", "shikha_pr": "I’ve problems with constraint. I cannot control my cravings (which ranges to alcohol and food). Even though my appetite isn’t large. My body also picks up weight very quickly. Any tips for developing self-control? @komalpandeyofficial ❤️ much love.", "gouree_patil": "@komalpandeyofficial How do you overcome the plateau of weight loss where weight doesn’t seem to budge at all? Also How to maintain weight healthily without stressing yourself? ❤️❤️❤️ love your channel and all your fashion advice 😘😘", "noorpari3996": "What to do if you are slim but only your face is a little chubby???", "flying_willow": "How to slim shaped my breasts? I really want to know ths di plz help me out", "whymalo": "How to stay motivated ?? 🤔", "mansi_shastri": "@komalpandeyofficial It would be great if you say how did you maintained your weight after weight loss ??? Do you still make healthy choices in food daily?", "vaibhavi_thapa_xox": "How to reduce your breast plus face would be really helpful! 💞💞", "rudra_sethiya": "Please share your diet plan", "mystical._.ananya": "Please do a vlog2", "priyamvadabhat": "Your before and after photo please?", "dorothypinto10": "What's your weight", "disha_1423": "How do u control ur temptation ??", "farihabling": "I don't want to lose weight that much. I have gained some weight after my surgery. I just want to lose my belly fat. That will help a lotttttt. And I love you a lotttt komal💓 you are the most beautiful and kindest girl I have ever seen. Much love for you💓💓💓💓💓💓💓💓💓💓", "upasna.01": "I don't want to loose weight but want to decrease inces from my thighs and breast so please suggest.", "_manasweeeeee_b": "What is u r fitness routine?", "_bhabna": "In working out more than ever but still not losing weight . Why not ? Also, what's more important ? The no. Of calories you eat or the type of calories you eat?", "mohinii.rai": "I saw your old pictures and you had a lot of facial fat. How did you get rid of that?", "aagya_acharya": "How to get flat tummy", "nanditagupta656": "How to loose belly fat", "sachi_1807": "Is it necessary to make changes in your diet @komalpandeyofficial", "pooja_s_murthy": "Hi komal huge fan here.. Could u please tell some facial exercises u used to do", "ayesha_k772018": "Hi komal my question is that what ou eat in a day and how often did you do workout ........................plz answer my question.........", "shreyagh.23": "Story about thoes blushy uplifted cheek ❤😻luv u", "niraimathi_m": "Hi komal, first of all ur amazing, and do you actually know any exercise for reducing the thighs and how to maintain them. Lots of love from PONDICHERRY..", "vaibhav_jain234": "how did you deal w stretch marks", "meghaprasanna20_": "Hey..I’m a teenager and I’ve gained a lot of weight..is it normal? How are we supposed to reduce weight? I feel my thighs and belly are fat..please suggest..Loving your content❤️Keep rocking🤙🏻Love from Bangalore!", "meenayadav235": "@komalpandeyofficial how do stop yourself from binge eating or junk food??", "anupamaphuyal": "How to loose belly fat😤 @komalpandeyofficial", "coffee_xoxo": "Tips for flat stomach. ♥ @komalpandeyofficial happiest soul.", "ii_jayzee_ii": "Please do. Waiting for it", "khxshi___": "Any specific diet plan??", "_tanya_singh_20": "Hi komal my question is that does more water really helps in weight loss as i have heard that it releases toxins so thst migjt help in flushing out extra bad things love ur vedios btw", "hayazubair": "What did u do to have such a prominent jawline?", "ipsa___": "What you eat in a day to maintain your wt???", "krithika37383": "How to loose thigh fat :(", "mahimasetia": "How do you manage social outings to stay on track with maintaining weight?", "hsethi_005": "How to loose belly fat and thighs fat, and one main how yo stick om your diet plan ig you are office going??", "annettemenon": "1)What workout plan and workouts did you do? Also what was the diet you followed during this time? 2) Is joining a gym helpful to lose weight? 3) Should we ideally workout when on periods and if yes then what workouts will be ok to do during that time?", "iamaainataneja": "How to loose belly fat", "avni084": "Belly fat n thigh fat remove", "pj_payal": "Sumdays back i saw apic of mine i was soo thin 2 yrs back n now i m actually getting fatty plzz help me how i should i get fit n healthy body", "vidhiii.xx": "how to make your thighs slimmer? @komalpandeyofficial", "ananya__ravi": "And also...how did you lose the belly fat???", "jia.najib": "Diet is very difficult to do can you plz suggest some yummy diet foods..", "ge.orgina543": "Does walking reduce flank fat?", "____stormborn___": "Nothing abt weightloss..... Tell me something for weight gain.... 😂👻 @komalpandeyofficial", "__soniiaaa___": "You are very slim", "moonka_studio": "How to reduce double chin ?", "_chetnaaaaa": "@komalpandeyofficial. There is an important function coming up and I have to lose 10 kgs in a month how can J do it", "bhumika251206": "How to lose weight from thighs", "sanchita_guliani": "How to cntrl oneself from eating junk?", "tasneem.kauserr": "How to loose face fat", "bella.dcosta": "How much do u weigh currently", "_juvi__15": "Plzzzz advice how to lose a belly fat", "mrunalpatil28": "Hey komal, I really love your videos. I myself have great difficulty in loosing weight, can u help?", "_pratyaksha_singh": "Do some komal' hairstyle tutorial...", "zingggyyy": "About your jawline and that slim tummy 😈", "charu_nivetha": "Why do you need to lose weight?!!!", "srishti_1825": "Weight loss !!!? Did u ever put on?", "nirmalaholle": "This is so cool", "malavikaaaaa__": "Btw lysm", "priyanka8080": "Please tell about loosing only lower body fast ..my upper body is very thin", "__bunny14": "What foods would you eat at night for losing weight??? P. S. LOVE YOU SOOOOOOOOOOOOOOOO MUCH", "madeeeeeeeha": "How to gain weight?", "azka_atif": "Hi @komalpandeyofficial, how did you kill your cravings for junk😭", "priyankarajput319gmail.com5617": "Deadly waiting for this video", "snow_9186": "How to slim your back fat .....plz plz", "divasgram9105": "Key Komal please tell howto be focused on our weight loss journey..... Please.... means I would never keep on on my weight loss journey...... please need a advice.. love you", "rinka_mondal99": "Hi Komal , I know everyone told you that they are the bigest fan of you but i'll tell you that you are my style icon😘 . Di i've fatty arms, what should I do? I do exercise but the fat is not burning a little bit. Please help me , i'll be really thankfull to you. Lots of love from Kolkata😘😘😘😘", "agarwalarshiya": "How do we lose thigh fat?", "shristies": "How much was ur weight before weight loss and after it?", "bhaktikataria_": "What motivated you to loose weight and did you face any insecurities throughout the journey ?", "merin.mathew2": "What is or was ur workout routine?", "drishtihirani": "Belllly fat", "nishita._.4": "How did you get inspired to lose weight", "afriiafra": "What's your feel after losing weight?", "akamoonchild_": "How to manage time for working out in a busy schedule???", "__.soundaryaaa.____": "How to lose a lot of weight in a short period of time for teenage girls?", "muskansinghal5997": "Plzzz komal let me know how to be in shape..... I m not that much fatty but I just want to maintain my shape.... Plzzz advice 😅", "anshulasinha": "How to loose belly fat.??", "humna.habib_527": "hi komal mam my question is can we lose weight by diet alone", "vini_malvi": "How did you managed to lose weight keeping your skin tight", "_anshum_sharma": "Gorgeous💝💝😘😘", "alishba_irfan_29": "Hi komal a special question that i have and i want you to answer is that how to achieve a slim and chiseled face please tell some facial yoga tips", "sangeeta_soni15": "Can you show us your pic before weight loss", "the_mayathing": "A simple question.whu should a person lose weight? Is it important to loose weight to look good?", "sayleejagtap": "Those cheek bones on point & perfect cheeks, how did you get that sleek face?", "smrutee_rupa": "After weight loss did u suffer from stretch marks?", "parii_batra": "Is it necessary to cut down all delicious food for weight loss????😕", "gomexx34": "Hi komal di ,I am a teenger from chd.Just love ur content .please have a meet up in chd.My question to u that I think feeling healthy is more imp. Than having any kind of body shape. And how we can feel healthy and active from inside?", "_that_instagirl": "Arms", "vidhi9396": "Lossing Weight is not a prob, but maintaining that for long is definetely a problematic thing.So afted loosing weight how managed that ... daily if intense workiut that we all already know or small tricks bricks are there for busy ppl who cant manage daily 2hrs of intense workout", "sargamyadavv": "what to say to all those people who say u chubby", "varun_281099": "Looking cute n hot @komalpandeyofficial", "aashti_m": "I am really scared of the stretch marks is there any way you can work out loose weight and don’t get’em", "heersphere": "how not to go weak in the journey", "priyabhatia8": "How to maintain the weight after you have lost it?", "sandhyashankararaman": "Do you get time to go to the gym? If not, how do you compensate and maintain?", "duckyy_0211": "Was it a nightmare to lose weight?", "mayankagulati": "Do yoga work to get a good figure?", "komaljoshi239": "Thank youuuuu for this video will help alot", "raisa____trivedii": "Tips for a teenager to get a toned body !!!", "varmaaradhana": "How do you manage cheat days ?", "thetastyworld": "What did u do for strech marks?", "amirtha_pooja": "How eat healthy without having to give up on our comfort foods?", "arzushah27": "Which fast food u have on cheat day ..... That has low calorie", "_d_i_s_h_a_._": "How did you spend your this birthday!? @komalpandeyofficial P.S. Loads of love 🌎💝😍", "kalpnarajput_": "Hi Komal !! You r js awesome 🙏🏼 with awesome content.... my question is “How to reduce lower belly fat? (That small dreaded pooch that comes out when u wear a bodycon dress😞)", "shreyy.shaurya": "Kindly tell how to lose some fat from the thighs", "akshadasalvi": "Hi Komal, you said once that you lost your weight by walking a lot. How much time did you walk? How many days? And what was your diet like which help you loose weight along with walking? Thanks xoxo", "iiiprivateii": "Di.. Plz abt ur facial transformation..it would help a loott. ❤", "manisha2346": "some weight loss suggestions for night shift people plzzz", "prabh_jyott": "How to get nice muscular thighs that looks good in jeans", "_.palakpatel._": "How to get a flat tummy with an hour glass figure just like u ? I love 💖 u", "shrutijain1998": "How to keep up the glow on your face while loosing weight??", "ayeechuchu": "Was it difficult to stop yourself from eating all that good fat-containing food 😂", "fidakauser": "How did you lose your facial fat?", "s_a_u_m_y_a": "Do warm water work for loosng weight??...nd wat to do even u r so so easy to do exrcise??....plss help..am just gaining nd gaining😢😢😢😔😔...u have awsm figr...like a dream figr😍😍😍...luv u so much komal", "liyasusanthomas267": "I always thinks about to get lose my fat..but I feel lyk so lazy to do any exercises. ..Wat to do now...Give some tips to overcome my laziness", "voguebyalvina": "What! You weren't the same always??!!", "radhika_gupta1207": "How much weight have you lost? How you became so thin and toned up..you look amazing", "garima_kth": "Did your skin sag due to the weight loss? Or how to make sure sagging doesn't take place?", "priya_princess_sneha": "Love u miss u wish i could meet u ur like a hollywood star for me but i m just 10", "marlin.yesmin": "did u evr have any problems wid stretch marks? if yes .wat did u do..plz help", "anjisingh.chauhan": "Ma'am how to get a slim face??", "vaishnavi_9041": "how to get a sharp jawline ? @komalpandeyofficial @komalpandeyofficial", "ritishnasarma": "How to slim my face ? I mean how to get rid of double chin ?", "gogetterbee": "How to get started and stay motivated ?? How can we eat junk once in a while and still be fit ?🤔", "mendes_13_8": "Did you lose weight because people kept saying u look fat?", "ivewonbutatwhatcost": "Do you still work out the same amount as you used to while losing weight?", "the_dusky_girl_diaries": "Honestly I don't have a fat belly problem but I suffer a lot and feel uncomfortable with my fat thighs..... So could you suggest something...... Please........ @komalpandeyofficial", "richamanaknegi": "about your diet as it plays the major role :)", "nishtha_452": "Does boil water works in loosing weight", "sodamnyou": "Let us know your diet. What exercise did you follow and for what duration? Also, did you totally gave up on junk? How many days wee required for weight loss?", "pooja_srikumar": "How do you maintain your weight? Do you avoid sugar or sweets?", "variishaa_": "1. Why do you hate kajal? 2. What is the worst sonam kapoor look according to you? @komalpandeyofficial", "alittlebee_buzzing": "Why did u wanted to lose weight ? You looked cute anyways...any special reason", "chinmayi_tamaskar": "How to slim down face ????", "jigyasakrishna09": "Beautiful!❤️🌻", "nutella_wafffle": "How diet and exercise is important in weight loss journey ? Pls need to know for completing my weight loss journey...... Love and hugs #pyariblooger 😘😘", "vaishnavi.yelisetti": "What it takes to motivate yourself to exercise daily?😅", "banerjeearadhaya": "Hiiii....can you please suggest how to lose weight without going into a tough &&severe diet??✔✔✔✔✔", "___tanyaaa___01": "How to reduce facial fat ?", "anika.massey": "How to reduce your belly fat.. is green tea good enough", "anupamalobo": "How to not lose focus on diet and exercise? How to get motivated about weight lose regime", "dikshapandita99": "How to lose weight in the hostel....the menu is fixed and time is less", "_shreya.das_": "What can you do if your weight loss has reached a plateau?", "manika_kanjani": "How to reduce bloating and increase metabolism?", "princesssss_consuelaaaaa": "How difficult is it to keep your self motivated to come out everyday and work out because this is a major problem that i and many others face @komalpandeyofficial", "the_unusual_lady": "Give us tips as to how to curb our cravings", "cottoncandie6712": "Toning the entire body including the face and also glowing from within...can you suggest on that?", "saakshimayank": "How to stay focused during this entire journey?", "ami_domadia": "@komalpandeyofficial hey! How to stay motivated while on a weight loss journey.", "swagatikapalai": "I really love my pizza n I can't resist them , but I want to lose weight as well ! So what should I do???... Lots of love Komal💕", "ruqia71": "How to slim your face and yea eating schedule....I love you so much I’m following you since Popxo and now you have your own YouTube channel thankq for entertaining us for last few years 🌹🌸❤️best of luck ilyyyysm🍀", "ishani_ghosh_2001": "Did your weight loss process hamper your daily routine?", "freakt1234": "I can't lose weight. Please help", "sanjanaritu19": "That's a great lub u", "kalista_02_singhal": "What exercises to do to lose weight?", "naveli.haveli": "What is the meaning of weight losing and why do we do it.", "anamika_1007_": "how to lose belly fat???", "ripsythourani": "Did it ever happen that you went days completely without exercising ,not thinking about weight loss and then bloating up and wanting to lose weight again ,coz this happens with me all the time, what made you not give up and ultimately reach to your desired weight/size. What kept you going?", "tehzeebgaziyani": "Does hot water fruits n veggies n different types of juices helps in reducing weight n calories faster what helps to burn calories faster n does walking n running helps in loosing weight", "tadapti.atma": "How to kill cravings?", "ayushi_1701": "How to diet in school/college days without getting distracted...?", "rishika20d": "How to lose thighs weight without losing face glow", "sayali03_": "Wht diet u prefer every day to keep ur self fit healthy n slim ???", "mehak_.3": "How do u loss weight ??😟", "rashmiaggarwal2199": "How to get that jawline 😍", "deekshachakraborty": "Okay so how can I loose weight around my thighs?It will be really helpful", "yoursoquote": "What to do for double chin? @komalpandeyofficial", "suru_mariaofficial": "Beautiful always 💖💖", "riddhimasikder_": "How to make cheekbones sharp like yours? I am in love with your cheekbones!", "ananya_sehgal_13": "Full body weight loss", "nishita__shah": "Any way to loose weight without exercise!", "simran_manaktala": "what do you do now or eat now to maintain your weight and body.", "vivanitajain": "I have pcod ...how to reduce weight in that situation??@komalpandeyofficial", "ishika_ratnam": "Is there any home remedy for losing belly fats??", "vasundhra_002": "How did get that perfect jawline @komalpandeyofficial di...perfect cheek upliftment n tht chiseled jawline..how...show us the face yoga regime that u followed!!!!", "arushibhavsar1908": "How to lose overall weight for a teen girl? Love you @komalpandeyofficial ❤️❤️❤️", "oshin_chopra": "How to get motivated daily for workout.", "m_8z_y": "How did you keep up the motivation to continue the journey? Any inspiration?", "senika_t": "I have got really big thigh...@komalpandeyofficial so how to loose down the thigh and tummy too", "starship_903": "How do you maintain your figure?", "upadhyay.nishita": "Also how to get rid of arm fats? :(", "aditikanoria": "@komalpandeyofficial Hey! You look absolutely irrespective of your weight then or now. ❤ I just had to ask if you at all hit the gym how many days a week would you ideally work out? Lots of Love and stay beautiful💋", "_priya.okram_": "How to tone our neck?", "aditi.sarawagi": "Yoga or cardio? Which is more important?", "neeharika_jg": "While u r exercising in gym", "the_one_true_nandini": "Hi @komalpandeyofficial .. please advise on how to keep on going with the journey. It's always difficult for a working professional to be a 100 Percent dedicated and committed to the process. So tips on that would be great 😊😊", "tanzeel_fatma": "Whats ur weight now", "khushiarora2002": "I'm obese and get teased by my friends and relatives ... What should I do and how can I lose weight fast???? By the way I love you and your videos as well.💖💖", "itishaaaaaa_": "Hey komal di ..I'm 17 and kinda chubby ..and I need to lose my weight ..more specifically I wanna look more good ..need some tips and tricks to dress like to accentuate my curves ..ty ❤️✌️", "96rabina": "Did you have any stretch marks or any body marks particularly due to weight gain? If yes, what helped for you? Also, some diet help people to loose weight but isn't sustainable in long run, what worked out for you to maintain?", "singh_sakshi601": "The one thing which has always been my problem is my \"taste bud\". We Indians have so so so many delicious cuisines in our country that its dam hard to control our temptation.... So my question is HOW CAN I TRY TO CONTROL MY TEMPTATION FOR FOOD as I m a big foodie ? N how much exercise is necessary or is enough to keep ourselves fit ??", "balika.butterfly": "how to loose belly fat fast", "tehreem5501": "I can't lose my weight , I always tried but couldn't succeed 😔. Plz give me some tips ;(", "mazumdar.ayushi": "Hey komal what about your diet plan cz diet plays a very big role while one is loosing weight? What about toning and shaping one's body..", "desiring_to_be_inspiring": "How to make you're face glow naturally ( that doesn't look dull and sick like every time even when a little makeup is put on.)", "gurgaon_wali": "What do you thing we should go for? Yoga or gym? What's better?", "pujachauhan1234": "How toh lose weight of thighs", "xx.__anushka__.xx": "How to get rid of the fats in the thighs and hips @komalpandeyofficial", "alizah_2407": "How to tone down belly fat and arm fat", "mona_a_lisha": "How to control my craving for chocolate or something sweet? @komalpandeyofficial", "_ds_reesh": "I was waiting for this😍😍", "nidi.b": "How to maintain excercise routine or yoga routine or diet?? My biggest problem is, if I start something I couldn't make it to do that regularly. I started jogging but small break completely stopped me. Please help me out.", "aishwarya_1796": "how can we stay motivated through out the process? @komalpandeyofficial", "dark_lights_capture": "How to get Flat tummy and toned thighs and get rid of arm fat and double chin?", "okaymehakk": "What did you NOT eat ?", "pravartikalife": "How to get into a proper shape or I can say get a flat tummy ..without doing workout like gym or yoga or walking and not even by avoiding junk food 😅?", "ritikaa.19": "What was your diet to lose weight?", "sharvari.08": "How do I remove bellyfat!", "preeti_kachhap": "@komalpandeyofficial I saw your old photos and desperately wanted to know how do you get this goddess figure.. Waiting for your video.. 😘 😘 😘 😘 😘 😘", "giriraj_chaudhari": "Gorgeous", "niki_yadav03": "How to Tone hips and overall body", "peckwoodhigh11": "Were you actually fat earlier??? I always thought you had this toned physique since birth.", "iamfizzarizvi": "How to get rid of excess thigh fat?", "lavanshiagarwal": "From where u got the motivation to loose this much of weight?", "styleusmagazine": "Squats are for thigh loss or to gain muscles? I've seen squats as exercise for both. I'm confused.", "deepi_143": "I dont wanna lose wight but still i m so straight lyk shapless! 😖 i dont hav curves to be there on the right place like hip region ! So do i hav to loose weight to bring back shape to my body or shld i have to gain weight to bring back shape! @komalpandeyofficial Plz do answer my qntn", "manisha_sawant3": "How to lose belly fat and tone thighs without any dieting and also suggest some workout exercise that can be done at home. ❤️🌹", "shengss_": "How was your weight loss journey, I just am concerned about cellulite, rather am a curvy woman. ❤", "riya.desai17": "You were like chubby girl in yr college days as seen in onw of yr videos bt how did u get here?? Like u are soooo skinny now and also let me know your diet and facial excercises and belly fat reduction excercises", "mehk_jix": "Komal tell me that How yo reduce the cheek fat because I am slim but my face is soo fat", "annuushkaaaa": "How do you maintain your body?", "a.l.i.s.h.a.s.a.r.k.a.r": "Any advice on toning cheeks.. through simple and easy excercises?", "_.the.starstudded.wreck._": "I have got two major questions to ask : 1. What keeps you motivated to work out for yourself everyday, without a fail, despite of such a busy schedule? 2. How to reduce the loose fat ?", "aliishadliima": "Was it baby fat or do you think you are a fat person? If you stopped your currently lifestyle would you go back to your original wieght @komalpandeyofficial Meaning to say do you think you got lucky the weight doesn't come back / your metabolism improved overall or you think you are still prone to gaining alot of weight?", "themehuljoshi": "How to get rid of the ugly cellulite in thighs and tummy?", "nidhi.45": "How to get a flat tummy without compromising on food? 🙈🙈", "maanvi08": "How to stay motivated to go to gym.. ? And also wat to do abt the stretch marks thatvr present on d hands?", "diparati": "How do I feel comfortable in my own skin without losing weight? I know this kind of goes against the theme, but I guess all of us want to be comfortable in our own skin. Because however much you lose weight, you always see your imperfections glaring at yourself when you look at the mirror. How to reverse that and fall in love with one's own self?", "ineha_d": "how to loose butt thigh fat and upper arms plzz include these 😍", "_titiksha477_": "How to lose arm fat?", "aritri_dasgupta": "How to lose facial fat? @komalpandeyofficial", "srashti.talreja": "Hey dii..😘I would like to know if you had a dietician for weight loss..? Nd how to remove belly fat??", "ughdbxodns": "what do you typically eat in a day when you want to lose weight but have to eat out at restaurants or events?", "nautanki_much_": "Was loose skin an issue for you during or post weight loss?", "shrutiiiyer": "And can only hitting the gym and doing Zumba help reduce weight without dieting?", "drishtipugalia": "i wnt to loose weight . so plz tell me some tips. :)", "__the_foodie_girl__": "How to loose weight like home remedies without diet nd flat stomach???? I just can't avoid junk food sooo please tell me how to avoid it🙏🙏", "chandrimabose07": "@komalpandeyofficial hi Komal! Greatest fan of yours. I literally changed my styling inspired by you. I just need to know if i could get a flat belly and abdomen without hitting the gym and what all should i eat in a day to stay fit and healthy like a routine maybe?", "nehal.pruthi": "Should we absolutely leave sweet things in order to loose weight..", "muskan_sadhwani": "Can you please suggest a healthy food guide , for a girl living away from her home ?", "ridiculously_rida": "My question is what diet plan to keep when losing weight?", "arrchhi": "How to get rid of double chin 😥 and also how to slim your legs 🙏", "_rashi1124_": "what inspired you to loose weight?", "lavishadasani": "How to control on food? I’ve tried, the max I can do it is for a week and then I’m back to eating like a trashcan 🤷🏼‍♀️", "hasmitakapoor": "Hey Di.. I would love to have a sneak peek abt what u eat in a day.. I think that can help us a lot..", "shreya_172": "Do you work out everyday?!", "syedaaaaaa": "How much did you weigh befor starting your journey", "__hemapuri__": "Wow", "theunique_sim": "Belly fat and double chin", "khushi0302": "@komalpandeyofficial hey how to lose weight without gymming and all", "himadrika.___": "Were you always so thin and beautiful?!🙄😳...Anyway, would you plz recommend some tummy exercises?😅...", "lakshmi_palaniappan": "How to resist temptation? Which the biggest and unavoidable enemy ;-)", "tistab2045": "please advise on how to lose belly fat 😪😪", "reema_joseph": "How to stay focused n motivated thru out the weight losss?", "miss_redrose_": "are chocolates allowed to eat ??", "_i.n.s.a.n.e_0609": "Hey Komal di !! Plz let me know how to lose arm fat ? Love you and your videos too 💗 @komalpandeyofficial", "chandrika_kulkarni": "Can anyone will be able to achieve it?", "_bookish.wonders_": "Why is it that even though my collarbones are showing but my belly and thigh fat are increasing😥?", "aditi_saraogi1": "How to get those cheek bones like yours?", "ankitagakhar": "Did you had stretch marks earlier? How did they go? Some remedies that you have tried.", "ikhushbu_s": "I'm a hostelier.. Hostel food sucks.. N accessible foods r really unhealthy... Any tips for me to loose weight.?", "theraybong": "Hey Komal!❤ please give some tips on how to reduce belly fat.", "appyverse": "@komalpandeyofficial Does drinking apple cider vinegar really works ??", "priya_agarwalll": "Did you had stretch marks ? And if yes then what did you do for them ? And even if you didn't had any, while losing weight you may get then what did you do to prevent them ?", "janam_garg1": "@komalpandeyofficial do talk about keto diet and how it helps in weight loss?", "_mansiiii___": "for a typical indian girl. what should be the diet.", "vinusha_varma": "How to get flat tummy with regular exercises and tell some face yoga for healthy face skin.", "karis121": "How to keep our.motivation up for weight loss? We join gym or a yoga routine but stop due to lack of motivation.. so how to keep up the spirt for loosing weight.🙂🌻", "akanksha9630": "Teen age trends 😊 plzzz @komalpandeyofficial help", "sassyriyu": "Lovely💖", "jaishreechhabra": "After losing your weight how are you maintaining it? Like you have to shoot all day do you get time to work out and focus on your diet?", "the_auror_185": "@komalpandeyofficial how to lose excess weight from the body parts,and some skin care tips for even skin tone.by the way I am a bigg fan of your,lots of love to u......😘", "thatchillgirl_": "What do you do when you are on long vacation? I mean obviously your weight will put on...then how you maintain that to stay slim?", "sureshshastriji": "#Famous_astrologer pt. SureshShastri Contact mobile call #Famous_astrologer pt. Suresh Shastri Contact mobile call now +91-7357336211 (फोन पर घर बैठे समाधान ) <>स्पेसलिस्ट: किया-कराया, प्रेम-विवाह, सौतन दुख, , दुश्मन से छुटकारा, वशीकरण, ,विवाह में रुकावट,, पति-पत्नी मै अनबन,प्रेम संबंधी,मनचाहा प्यार प्रेमविवाह,रूठेप्रेमी को मनना ,शादी के लिए माता पिता को मनना प्रेमी वशीकरण,प्रेमिका वशीकरण पति -पत्नी वशीकरण सोतन दुश्मन मुक्ति आपकेजीवन की हर मुस्किल से मुस्किल समस्याओ का पक्का समाधान ((#स्पेसलिस्ट_प्रेमी_वशीकरण)) समस्या है तो समाधान भी है whatsapp number +91-7357336211 +91-7357336211 (फोन पर घर बैठे समाधान ) <>स्पेसलिस्ट: किया-कराया, प्रेम-विवाह, सौतन दुख, , दुश्मन से छुटकारा, वशीकरण, ,विवाह में रुकावट,, पति-पत्नी मै अनबन,प्रेम संबंधी,मनचाहा प्यार प्रेमविवाह,रूठेप्रेमी को मनना ,शादी के लिए माता पिता को मनना प्रेमी वशीकरण,प्रेमिका वशीकरण पति -पत्नी वशीकरण सोतन दुश्मन मुक्ति आपकेजीवन की हर मुस्किल से मुस्किल समस्याओ का पक्का समाधान ((#स्पेसलिस्ट_प्रेमी_वशीकरण)) समस्या है तो समाधान भी है whatsapp number +91-7357336211", "anmol_jaggi": "When were you fat ?? I was following since 1 year .. you were nvr fat !!", "mawimilun34": "I really wanna know how to get a flat arm", "rehnuma_srabon": "hi komal i'm srabon.I'm from Bangladesh! just so that you know i love watching your videos and my question for you is when did you actually decided that you really need to loose weight!?and how do you feel about it now!? #loveyou💜", "khushichamaria_8": "Suggestion for stomach reduction please!! How to reduce tummy fat???", "ridhiigoel": "How to lose weight being a teenager? What should we eat for breakfast when going to school? Pls tell. @komalpandeyofficial", "janu_agapo": "How did you overcome cravings ?", "amal.jil": "How to slim your face ? Any facial yoga suggestions ? And yes how to lose a belly fat ?", "janvigupta.111": "Do working out empty stomach effects fatloss speed??@komalpandeyofficial", "1ananyathakur": "How to get “the weight loss motivation”?? Like how to not giveup in btw and keep going throughout the process. @komalpandeyofficial", "suvashree_pati": "How to lose arm fat? @komalpandeyofficial plz reply to dis", "bharti_saini__": "Hey how to just get slim without making muscles toned so much that you start looking like muscular @komalpandeyofficial", "reeeet29": "Excercise for belly fat plssss", "kaannuu1": "How to stay motivated while losing weight. And how to stop sugar cravings", "palasha1999": "Hi. My question is how to lose belly fat and thigh fat. Thankyou!😊 @komalpandeyofficial", "yats.ikaa": "What should be the diet, like if u don’t go to a proper dietiatian and want to plan ur own diet, how to do it? How to balance out meals?", "appurva_kapil": "Hii @komalpandeyofficial ❤️ Getting A flat Belly Is As Difficult As Maintaining It..😅 Could Uh Plzz share some tips of getting a flat belly and maintaining It Too..? It wuld be Of Gr8 Help.. Also plz suggest some exercises n easy food That we can make at home as some of us wuld be Clg gng girls..and staying at hostel.. Thank You❤️ Love Love😘🌸", "zoyarahman1629": "How to lose weight f full body...", "tamannaghai_": "Do you like yoga?", "mahita.raj": "Firstly love u I just want to know how to keep ur self training all ways bcoz I know.. I do exercise and I don't continue.. so any tips", "zish27": "How would u manage to keep ur face slim", "gurkomalkaur_": "My question is how to get a flat tummy and how to loss weight without gyming qnd dieting", "ishakhanna345": "What motivated you to lose weight?? And komal I love you sooo much😍😍😍💗💗💗", "kaarin_gureja": "How do you lose stomach fat", "grishmaaaahhh": "Hi Komal, there tons of videos on workout plans and exercises but proper diet with Indian options aren't many. Could you please share your daily diet to help maintain the body?", "rb_.prvv": "I want to lose at least 40 kgs but i tend to lose all the time, nothing motivates me anymore and i just give up on everything too soon😔 i have also been depressed for a long time now.....i don’t love myself anymore......i wish i could look slim, pretty, sexy just like you❤️", "humanvee": "How do i control my sugar cravings???", "madhurimamukherje": "Which protein food you took in a daily basis? And how much calories you took in a daily diet???", "shinjon_": "How to lose around 10 kgs of weights ?? Tone down arms , thighs and lose belly fat ?", "pooh_theglowingmess": "i had been working on my body from last 7 months but i didn't get the result which i deserve. so telling where i am lacking or have you face these kind of problem in your life. @komalpandeyofficial love you", "swatilekha_das_1988": "How to stay motivated to loss weight", "oppa_you_lol": "Which is better dieting or cardio or should I do both? Also which one is more affective for weight loss cardio or yoga ? @komalpandeyofficial please answer", "blah_s_famous": "@komalpandeyofficial how do you manage your diet and workout when you're not at home. More like when you're studying in hostel or something. That would be really helpful. Thank you!", "sejalkumarisbae": "How did you deal with stretch marks if you ever had (since they appear after sudden weight loss/gain) please answer ❤️❤️", "sakshi_chhitarka": "How to loose wait after 60?", "kritii1001": "How do u make urself distracted from all ur favourite food stuffs??", "malvika_geigy": "How long did it take to get rid of facial fat and also, please share the exercises you did and the diet plan you followed.", "girl._.from._.calcutta": "How to loose extra belly fat, thigh fat, arm fat and back fat!", "charu.banga": "When to drink water after a meal?", "ayushiag__": "I never saw you fat ...you were always thin since popxo times", "umang.14": "How to keep yourself away from your cravings?", "catdogbhowbhow": "How to lose lower abdomen belly fat for teenagers?Please can you give some suggestions........ It would be really helpful......... Please reply....", "salonikelkar": "5 tips to take back?", "dhanashree_singe_99": "What diet did you follow?", "shruti.singh_93": "How have you maintained your lost weight?", "shweta_kalakoti": "How to be persistent to diet and exercise? @komalpandeyofficial", "sweetie_biswas": "Abo6 detox water", "samyukktha_s": "How do I lose tummy weight?suggest some good fat burning food", "char_pooja": "Please do share how much and how long did u take to lose weight", "areebah89881029": "Very hot", "sakshisoniii": "And yes even how to loose theigh weight", "arpita_.99": "@komalpandeyofficial how do you manage to keep active all the day ?", "ananya9902": "How did you lose facial fat", "anushreedutta2016": "How to lose upper hand nd belly fat?? And ur daily diet routine @komalpandeyofficial", "mahnoorazam124": "How to lose arm fat?", "tulicasmic": "I want perfect jawline nd cheekbones", "deepshikhahalder": "Pls suggest a weight loss diet for normal indian girls.", "thegirl.with.thecurls": "Your diet and no. Of hours you work out😍😍", "areenasheikh_": "You look awesome!😎😘😍 I love you.", "supriyadubey_": "Is it okay to eat anything what you want, because life is short we can't rely on healthy food to fulfil our cravings when we are craving for pizza or pasta or done dumplings 🤤 so please do tell me this, will be waiting to hear from you about it... Lots of love 🌻", "rijalmedha": "How to tone glutes", "sgakshatha02": "Wats your diet plan?", "_megha3804": "Di I have tried all types of diet 10 days diet ,15 days ,1month diet , mera weight loose hone ke bajye badh gya Di kuch ESA diet plan bato ki follow ho plz", "fatimah_akram": "How to get falt Tommy", "mavera_khannnnnn": "Yaayy! Finally you’re going to shoot that video! Thank you much @komalpandeyofficial and also, how to lose weight without gym? 🙄", "neeraja_suresh97": "From where did you get motivation to do your gym/diet?", "justita.musrat": "What do you still do to maintain your weight?", "mylillcorner": "I have seen ur old pics u were a bit plump how did u manage to come so thin", "nikita.alwani": "Can you plz tell me that is green tea imp for weight loss....and also which water we should drink in the morning warm or cold??", "akansha24dixit": "How to lose thigh and hip fat", "hansisanghani": "Is it necessary to go to th gym and follow a strict diet to lose weight?", "snooflake": "How do you get over junk food cravings and stay consistent with diet and workout?", "khurana.gauri": "how you take your mind for like a longer and steadier weight loss journey.. I feel that's the most difficult things to overcome to actually ace your weightless journey.. so share ur stories related to this.. plz", "shreshtha_2411": "I need to loose my weight from thighs and hips!! It would be very helpful if you could suggest what to do to loose this fat?! @komalpandeyofficial looking forward to your reply!!😚😘♥️❤️", "pariarora1107": "How much have you lost ? And do you go to gym ?", "badasss_babua": "Suggest something Reducing belly fat and which exercises which really work and easy to do", "just_vaish": "Who you keeo the motivation continue ? For me my motivation ends in 2 days", "jasminminhas29": "What’s your diet how do you maintain yourself?", "sorely_forthright": "Di share about how to tone down upper arms and boobs through exercise", "sthahvi": "How hard it is ? I know how consuming it is", "sherry2495": "Your fitness regime?", "aarya_ap": "How to get toned arms?? And how to keep laziness away??🌻@komalpandeyofficial", "aditideshpande___": "How to make skin glow? @komalpandeyofficial", "muse_trove": "How do you maintain weight loss ?", "srijita_chakraborty_": "How to maintain the weight after weight loss?", "hamna._.kashif": "And how much time it took through this journey", "jigishajindal": "How did it feel to wear smaller clothes and look good ?", "lekshmi_bency": "Pls advice a healthy diet to reduce tummy and thigh fat?", "teen__boo_girl": "Need a video on style on budget", "shikha_rajawat11": "Mam please suggest how to get a slim face and a defined/sexy jawline for girls without hitting the gym (I am a school girl so can't go to the gym). Please.. 😙😙", "namra.01": "After losing weight how to keep our body toned?? And what do uh take in ur detox diet when uh eat something fatty??", "itisritz": "How to loose fat from arms?", "sharmila_sardar_2": "Hi Komal di I want to ask you that what yoga you do for ur face?", "surabhi.14": "how much time does it take for a person to lose weight healthily?", "divrun_official": "Di how to reduce weight near our belly ? 🙏🏻", "samra_alvi10": "Hey @komalpandeyofficial im from pakistan will u plz suggest the best way to look slim in every dress or tights and plz recommend me to lose wieght without gym or dieting thanks", "__adity": "How to loose belly fat only ? @komalpandeyofficial", "vandana.mis": "Thnku so much", "corlorfullife1": "I love ur dress is it from f21?", "priya_407": "Thank u, Komal!! I had requested it. 😘", "anjali.1106": "How to slim your face ?? Any facial yoga?? And for cheek bones too", "shreejachakraborty007": "@komalpandeyofficial plz tell us how to reduce double chin and maintain ad slim face", "mallika__jain": "Tell us about the exact diet you followed", "__xbhoomix__07": "How to lose weight?", "dhimanheenu13": "😍😍", "jewelleryshimmer": "Loosing fat face tips wud be vry helpful @komalpandeyofficial ❤", "vanshika_nehra": "How to stop craving for sweets and chocolates?", "neheartbabli": "Cute", "aartii_23": "How to loose lower tummy fat?", "sunthoshe": "How to lose weight without doing dieting?", "simarjeet.kaur.71": "Did you ever really need to lose weight at all!!!?? I have always thought of you as a naturally super slim girl...born with those genes you know.", "anushka17.in": "Plss disscuss ur diet plan..love u @komalpandeyofficial 😍😍🤩🤩", "sonali.08": "😍", "tristikashyap": "How to lose belly fats without dieting?", "snehalnikte": "Hi Komal. Can you please tell me how to loose face fat. Specially double chin 🙈. Belated happy bday 🎊🎉 and i LOVE your videos and your style 😊😊❤️", "dhairyaa__jain": "Hey komal! ❤️@komalpandeyofficial Love your videos and your way to influence everyone here! My question for you is- Its not necessary to exercise daily and diet crazily! Also when we leave going to the gym, we again start going backwards. So how to maintain and balance all of this.. so that we can consistently stay on our journey to fitness? 😊", "ishita_tiwari_2804": "What is ur weight right now ??and how much did u loose ???", "laxmitejaswini_mortal.of.erde": "Hi @komalpandeyofficial my questions is at what age did you decide to loose weight?what motivated you?and also can you share few of your old pictures where you looked chubby?", "shilpabiju_": "Skip", "priyanka_sehgal97": "Share your diet plan.", "priyasarola": "What is your diet plan ?", "the_midnight_soul_": "how to gain weight... i have been very slim n don't know wat to do.. @komalpandeyofficial if you know you can suggest something", "adt_styles28": "And how you got rid of the double chin?", "ishita_ahuja27": "What keeps you motivated?", "ankitaaryaa123": "Which gym did you go to?", "jainvidhi_04": "How to keep the weight intact after the weight loss?? How did you manage to keep your health intact??", "kiphappyface": "@komalpandeyofficial heyy... How to loss thighs and hips and also belly fat without deit..😝", "mallaica.khattri": "Love the way you are.💞 @komalpandeyofficial", "suzannethomas03": "How to lose belly fat plzz tell it will be very helpful for me because I'm very lazy", "_.maryam04_": "What was your diet plan???", "vanita_07": "How to cut down on sugar? It's nearly impossible!!", "iacb.8": "How did you lose your face fat!? ❣️❣️❤️ Love you", "sharmamuskan_": "Cutting down Face fat? Chubby cheeks to that perfect face cut?", "_rayofsunshine.__": "How to loose wait when you have so busy schedule and you live out of your home?", "ashwi_mukhia": "Waiting for this for such a long time.. .. would like to know how you get rid of facial fat??", "rajvi_tanti": "Sometimes u just crave for food while dieting....how should we control??", "hey_its.shree": "Do tell how to remove belly fat @komalpandeyofficial", "sakshi_rathore06": "Please suggest me some exercise for thigs and waist extra fat reduction?? Pleaseee", "shivangijain116": "How do you maintain your weight / shape after leaving gym?", "ranjana_samuel06": "Hi Komal I have an issue with fat around my hips. Also what is the best workout for reducing fat at love handles and back", "_kaju23_": "Any facial yoga suggestions??", "jyotisharma959": "How to stay motivated and dedicated toward your goal??", "annuuu_singh": "How to loose belly fat...and double chin....", "beena_stanis": "Any home made drinks to lose weight", "riieri__": "How long did it take for u to get into a proper shape? 😊", "komalandsejal": "Hey komal! I love you very much... you inspired me a lot... anyway my qstion is how to get ride of side fat? And what do you eat in a day ususally?", "angel07_ab": "How to reduce triceps and biceps", "muskan_birla__": "How to lose belly fat ?", "bharti.kashyap26": "How were you able to keep yourself motivated? ❤", "srestha.rath": "How to lose belly fat? Need help rn xD", "mystylepalak": "Tips to reduce belly fat I am happy with my body but i just hate that I have a little belly fat", "dshallu06": "Belllly..fat. @komalpandeyofficial", "dkhare1603": "Make some video on weight gain also😢😢", "riyamodha": "So pretty 💗💗", "shreya_toi": "How to reduce face fat for sclupted look in pictures 🤗", "mitali.20": "How to make your face slim??", "dikshaaa.p": "Hey Komal this is Neha here wanted to know about facial yoga I remember once you had mentioned about it how did you manage to do that? And also about how is your stomach so flat all the time how come it doesn’t bloat? I love your videos u are an inspiration", "shruti66374": "What was your diet plan and exercise routine????", "shivangnimadaan": "How to lose some fat from face and belly if you are under 18 @komalpandeyofficial", "rochana_agrawal": "How to lose belly fat? 😅", "simranyadav2155": "Which type og diet you prefer", "nishaverma94": "I work from 10am to 11pm in office. How to reduce belly fAt. Need to sit for long hours...", "shafaq.handa": "How to loose weight without eating less or skipping meals?", "illusionary_soul": "What facial yoga u did?", "x._namrah.s_.x": "It will be great if you share your before and after pictures 🙈", "shivi.garg.923": "Hey komal,I love you for how you carry yourself and for your confidence.My question is from where did you get the inspiration and dedication?", "vanshikavpatel": "@komalpandeyofficial Do calories matter or does weight loss depend on macros? Also, what is the most effective weight loss method to maintain for a long term effect?", "vaniki_kundlia": "I really wanna know how you lost your weight! How many kgs did you truly lose and did you follow any sort of a diet chart? How long did it take for u to lose ur weight! Thanks!", "neena_emil": "How did keep staying motivated to lose weight... What did you do when it became difficult to lose weight?", "jessyy.bb": "do stretch marks go away after losing weight?", "cry9585": "Pls komal if u followed a diet plan pls share that pls pls pls", "avani5137": "Can u please tell some of your favourite poses for photography if we r not models", "mansi_thackerrr_": "Hey Komal... I love your videos... It inspires me alot.. My question is I don't wanna loose weight but my body is not in toned I tried everything like drinking water gym everything but it doesn't work... Please suggest me something... I have a pear shaped body...", "ishuarora133": "How to loose weight in 1 month with some easy exercises..with light diet plan...😢", "thatsaditisah": "What is the most important thing you want to say to those who want to loose their Weight??", "khanna.kashish03": "@komalpandeyofficial how to tone thighs and arms? And what does really help a diet from a dietician or ur own home made healthy diet? ❤️❤️", "sinha1938": "How to lose arm fat....", "jahnvishah866": "My questions is u wanna lose weight but at home and not going to gym and all stuff? Onky excerise is enough or u should have deiting stuff n ol? How long it takes to burn fats and what all things are needed to burn ur fats n& all stuff? After lose weight how much control you should have on ur diet?", "snehakshatriya_": "Did losing weight also decrease the breast size?? N di belated happy birthday and just love ur all videos. 😘😘😘😘😘", "sreeja_30": "Komal..... finally your taking a video on this topic ..... becoz I always wanted you to @komalpandeyofficial ....how to actually reduce check fat and get that jaw line .. becoz I don't want my face to be round @komalpandeyofficial .", "rachanaaraaj": "How to lose facial fat once you've already lost weight all over? And also, did people tell you that \"you look like someone shrunk you\" or \"you looked prettier when you were chubbier\" or anything like that? How did you respond to such comments?", "soumya_upadhya": "Komal di can u please share us how to slim face , flat tummy and proper diet to achieve it. ....🙌🙌", "shabin_syd": "What diet plan did u follow?", "travel.chronicles_": "Hi Komal @komalpandeyofficial ..how do you tackle your cravings for fast foods? I really fight with myself to do the same..", "vartika_nayak": "How did you get those higher cheekbones and jawline, that people accused yoi getting a surgery? 😛😝 Love you loads", "rishu_mb": "What is a perfect diet chart to loose weight?", "pallavibpant": "how to lossed face fat ,double chin", "zahra_jagmag": "how do u manage to maintain weight after weight loss I mean every time I loose weight I again gain those lost kilos after few weeks!", "dharsahabkiladki": "How do u keep the motivation constant ? Like look at me I always end up in the mid way", "_bayazid__": "Pretty😍🌸", "sanjana.1008": "@komalpandeyofficial how to loose weight and tone lower body ...plss answer....", "jasminesaluja7": "Hw to maintain ur wrkout routine", "gleaming.light": "Hi Komal, how to reduce belly fat ?", "mariya.fareed": "How lose belly fat while not effecting any other parts of your body?", "sayalimhatre": "How did you lose the face fat?", "chowdhuryarushi": "How to lose chubby cheeks ??@komalpandeyofficial", "toshika1999": "I am a great fan of yours...you look amazing 💜", "zebasamrin16": "I have been requesting this for the longesttttttttt timeeeee😿😿😿😿 finllllllyyyyyyyy you're doing this @komalpandeyofficial", "adwitiyasen": "How to keep yourself motivated throughout the process? Because i feel really stressed out for not having the food i like . Did you felt the same?", "musskkaann_20": "how to loose weight upto 10 kgs in 2 months", "swarn08": "Were you ever fat? I doubt hehe", "chawda.rashmi": "Hii... I am working n m not getting time to workout as I hv 10 hrs job.... M gaining weight day by day... Pls give some tip so that could control on my weight gaining.", "itrishasarkar": "How to lose weight in a stipulated time", "meenakshi_aries": "Kindly suggest how to lose face fat", "wondergirl7800": "How to tone thighs???", "sahiba_bhojwani": "what made you loose your weight? Im just waiting for that kick , but i getting any.", "theshreyaaaaa": "What's your must have super foods?", "k_ranawat_20": "How do u maintain your belly Fat and curves", "nigh_solicitor_": "Becoming slim is easy but keep maintaining it is very difficult so do u do exercise on daily basis", "shrutikaushal_": "How to control oneself from eating junk foods? 😭😭😭", "shilpaaaaaaa_u_s": "@komalpandeyofficial I badly need to gain weight... Ppl say it's easy to gain but for me it's a difficult task plz suggest me something to gain weight 😕😕😭😭", "aarpita_paull": "Hi..!komal di... Plzz tell me how maintain food habbits... Which foods really helps in maintaining diet and in reducing weight", "snowflake._.__": "You once mentioned in one of your popxo videos that you did lot of facial yoga to rock a center parting... Please share what facial yoga you did.. really need it! Love you komal❤", "notusssinnngg": "What are the pros of loosing weight that you observed", "nehaajagtap": "Did you do any sort of body toning for your problem areas?", "yashvi_malde": "Happy belated birthday komal....can u suggest a healthy morning drink for weight loss...or even to be fit ! That will b helpful :)", "_priyal_pj": "Tips to reduce belly fat", "gsamriddhiii": "How can I lose weight ...without diet .... Imean I love love doing workouts but unable to loose weight😖 can u suggest something?", "pixelspersecond": "@komalpandeyofficial how do you maintain? I feel maintaining is way more difficult.", "ulli6451": "@komalpandeyofficial how to tone down thighs😭", "samriddhiatray": "How to incorporate the diet routine when you have meetings and other corporate stuff bang on your head and how to avoid eating junk when you don't cook something for ourself...", "suchismiita": "How to increase metabolism? Which food increases it ?", "loudnutbambi": "Please talk about how you defined your face using facial yoga, or make a separate video on it", "food_cravingsz": "How to loose Thigh Fat? And Arms Fat?@komalpandeyofficial", "vineela_savarapu": "How to reduce arm fat and help us with nutritional diet plan..😄", "riya_kheria": "How to loose weight from the belly... N the diet to follow.. would be helpful @komalpandeyofficial", "vanshikaarora_": "Is cardio essential for weight loss ? Can one loose weight by just performing resistance training and not cardio ?", "reet.beechoo": "Hi komal🌸 what is the meaning of your hand tattoo?", "reginasoreng": "What was your weight before and after your weight loss regime?", "radharanidasidev": "@komalpandeyofficial please advice us how to reduce boobs size.I want smaller boobs.pleaseeeeeee", "iamrakshha": "@komalpandeyofficial Why r u so sweet person?????? 😍😍😍😍 actually I love you lot ❤❤❤😘😘😘😘", "madhurbabber": "is weight lifting beneficial in weight loss? trainers available for girls in delhi ncr, pls recommended.", "lil_miss_cuttiee": "Hi..I m a teenager... I watches ur videos since u were in popxo...my question is ..that what should we can eat in breakfast for keep myself fit...I m perfect but wanted to keep myself fit", "sumitiiiii_": "How u stay fit and we can plz tel", "hharleenkaur5": "What is your motivation during your weight loss journey", "tanishahema": "how to make our cheeks slim", "prachiiparashar": "How it feels now when you look back and see those hard workout and diets which u followed to achv d best of u", "nupursinghi": "Does eating rice leads to weight gain? @komalpandeyofficial", "a_lonely_star_in_night": "@komalpandeyofficial hi..I wanted to ask how can you lose weight from tights. I'm a teen student . Love you and your videos😘😘😘😘😘😘😘😘😘😍😍😍", "_r_o_s_h_n_i": "Hey komal di!! I am a huge fan of urs... I really like the content of ur videos... I would like to know how did u maintain ur diet .. Did u cheat ur diet plans? If yes how often then? If no,then what was ur motivation to stick to ur plans?? I would love to have a reply... Nd plz keep on making amazing videos... Love u loadssss...... @komalpandeyofficial", "rajshree.jalan": "How to loose lower body fat? Is yoga helpful for weight loss? And what kind of diet? 😜", "shriyalal": "Diet plan for lazy girl😸", "skyaintoohigh": "What kind of diet plan did you follow along with the workout sessions ?", "bhubaneswargirl": "Hii dii....i just luv u !! Ur smile ur tonned body ur style ur interaction wth ur subscribers all r just natural and honest !! I just want to know how to loose fat from the upper body portion in less time ?? Nd ya also yoga or dance or gym which wll be better fr health nd evn if i wll take a break fr m buzy schedule thn it wll nt effect my body much ???", "poojathapliyal": "Did u follow any particular diet?? And if yes..do u still follow it??", "pujabanerjee96": "You are just purrrrrfect di!❤ I am a college goer and I give tutions too coz I wanna study on my own and give a bit relief to my mum as she is my only parent. I hardly get time to exercise. So how will I lose weight by living a simple life and eating ghar-ka-khana?🙂 love. XOXO💋", "ananya_baruah1": "How to loose thigh weight dear😘", "prajakta9246": "How did you lose weight from your cheeks?", "aati12": "How did you curb all the temptations? How did you not loose your motivation? And when you reached your goal how did you not let yourself over eat?", "pria_singla": "How to keep up with the diet and basic diet for vegans??? @komalpandeyofficial", "manasi_2000": "What inspired you to loose weight??? @komalpandeyofficial and are fat girls not beautiful and", "_the_real_psycho_girl": "How to tone thighs & hips?", "bongshail": "Were you unhappy and demotivated when you had more weight? What drove you to the point to get rid of all the weight?", "janvi_modi": "How to loose weight around lower part of legs? Please suggest some simple exercise @komalpandeyofficial", "chandni_bajaj1025": "How to lose weight for lower body?? Esp.thighs 😅", "nvp.49": "Please please please can you make a video on what you ate during the journey?", "priiyall_": "How to have that perfect belly ?", "swathi_divakar": "Losing weight is a journey! But how do we maintain it once we have lost the excess weight?", "__shilpi": "Did you try any dangerous diets during your weight loss journey for faster results and did you face any side effects? Love you 💜", "nimisha.neha": "❤❤❤", "nikki_kalola": "Kindly advice on how to lose a belly fat?", "shirin_soni": "Yoga or gym? What's the better option for loosing weight especially to tone down thighs ?! Btw, I love you n your videos @komalpandeyofficial", "rujuta.acharekar": "Could u show us Ur workout routine if any", "silviyabhasor": "@palasha1999", "ra_shmi_1": "What kept you motivated through out this journey ? 🤗 @komalpandeyofficial", "janvi.balwani": "Hi komal! I’m in 12th grade and it’s difficult to keep up with working out along with studies.... I want to lose weight but I can’t think of how to do it if not regular work out....", "priya_sitaraman": "How to reduce cheeks 😂😂 please help with face ka fat and double chin 😭😭 I mean how to get chiseled cheek bones 😭😭 @komalpandeyofficial love you loads 😍😍 I really don't understand how you're so pretty 💖💖🙈💖", "ankitadas._": "How to tone down hips and reduce belly fats? Would be beneficial. @komalpandeyofficial 🌼", "krishna__1402": "Yoga or gym?? Wht can help in losing weight", "banditachakraborty": "How to loose face fat and double chin??", "the_blog_you_love1": "Can we lose weight with some exercise and 30 minutes dance daily?? Plz Answer.❤", "archi_1053": "Hey! I love you so much !! Not sure if you will answer my question but I wanted to ask that how can one maintain themselves just like you maintain yourself?? You are amazing.💕💕❤️❤️❤️💕💕💕💕❤️❤️❤️", "nishi.gupta77": "Hey @komalpandeyofficial I have been recently diagnosed with fatty liver grade 2 where in I need to reduce my weight mainly along with very healthy oil and masala free diet. So would love to listen out from u some tips on the same. I already weigh perfect as per my height but still just few kgs I need to shred..also I need big big big motivation and advise on time management for the same as I am a working professional who does everything on my own cooking, cleaning everything so it's really hard to figure out time as well ! Pls guide..xoxo❤️", "just_swingggg": "i would like to ask that firstly how to get confidence for weight loss! 😅 And ya komal i hope you had a blast🎊 yesterday and also share what what gifts did you get!🎁🎀And ya you going extremely welll so don't worry💯and ya I LOVE YOU LOADS!❤❤", "ritu_radhakrishnan": "When were you fat?😕", "thefemalelife_quotes": "How did you deal with body shaming?", "__.miss.silent_eyes.__28": "I want to cut down the fat from my waist and thighs .plzz suggest some simple exercises for it and also how to maintain the weight!@komalpandeyofficial", "simranbalarjain": "What do you usually eat in a day ?", "ashok_revathi": "I work in night shift, going off side of my life, I was active and fit person with out any diet or exercise. Now I am losing my fitness. Y is it that way any suggestion.", "tejaswini_betageri": "Hi komal ... Some healthy food tips for ppl staying at hostels... N some easy workouts at home.....", "kanishkaaaaaa_": "Some face toning exercises", "theintrovertnagma": "How to stay motivated?", "zu.1814": "How to loose arm fat plsss tell???is there some sort of exercise or diet?", "college_days_of_summer": "Hi, love you what should actually be a healthy routine for someone who actually wants to stay fit as well as to loose some weight aswell...like total schedule including work out and diet", "imchanchal4": "How you control your taste buds it's bit tough 🙄", "n_f_siddiqui": "HOW TO GET RID OF A BUFFALO HUMP, EXCESS FAT BEHIND THE NECK?", "_sakshijain_98": "Belated happy birthday 🎂 can u suggests some vegetarian salads n when to consume them ?? and also can u give some tips on mental health while going thru this phase of weight loss n stuff..thank u n u r the best...", "akanksha_surya": "Your diet list ?", "girly__items": "Exercises for losing FACE FAT.. 😞", "tushargargfanpage": "Is dieting actually healthy for a long journey weight loss?", "__arshee__": "Finally 😍😍 ..Waiting for this vdo for a long tym", "_akritiiii": "Why you wanted to lose weight?", "ranamegha24": "Hi can you share some tips about how to loose weight being at home?", "chaitalibehrani_": "Did you drink any detox drink for weight loss ? @komalpandeyofficial", "_shaaaa546_": "Hi Komal,how to lose weight at home and what was your diet meal plan ? Love you komal ❤️", "saloni025": "How to reduce weight on upper body? And even after following proper diet and exercise routine, what could be the other problems/factors if you are not able to reduce weight?", "eman_meraj": "How are u so fit if u eat ordinary food", "volini.m": "You reduced so much, how did you not get any stretch marks? Love you!❤️ @komalpandeyofficial", "tamoshaa": "How to loose weight on lower body?", "tr.isha99": "how to loose weight in hostel?", "donnabajaj": "What is more effective cardio or yoga??", "shamaya03": "How to lose face fat ? @komalpandeyofficial this would also help :)", "mr_singh_sir_": "@komalpandeyofficial hi i am fit or not like u", "shrutikatnorya": "How to stay fit ? How to lose weight ? Is gym a good option ? I know we should love our body but still ❤️ lots of love K ❤️", "snigdhaar": "Hey Komal didi! Love you! 💜 Give us a detailed chart about when to eat what and in what measure and everything. Please. Pura routine banake dena please. Btw Your transformation journey is PHENOMENAL! 💓", "liya_susan_": "Hi komal. Belated happy birthday. I hope you had a great day. I was wondering if you could tell me how to get a flat tummy by following a simple diet.", "renu_belamkar": "Can someone do a weight gain post? Skinny problems!🙌🏼", "___kajaljain": "How to tone thighs nd hips!???", "deeshaasrani": "How to maintain the lost weight??! Losing the weight can be figured out but how do you maintain and stick to it?!", "komalet": "I always try to balance my diet but it's not a everyday thing for me. I always crave for junk food. I can't resist myself. How you tried to motivate yourself towards your struck diet and exercise???", "i_avisharma": "What sort of exercises you used to do to have an effective result", "sugarcoatedidealist": "Once you’ve lost weight, how do you maintain it?", "fervent_enigma": "Do you suggest any detox drink to burn down lower body fat? That's where I struggle the most! 😝", "bubbles_crushers": "Nice", "radhika7121": "How to loose wait easily..☺☺", "nohh_777": "How would you distribute your fats to the right places 😂 you know what i mean 😋 because honestly most of us struggle with that. Also, love you ❤❤❤❤❤", "komal.nihalani20": "Hello mam!! my ques is how to do weight loss training at home and plss suggest me a diet plan and also which one is better yoga or yoga Pilates??", "_sakshi_gauttam": "How to loose arm fat and is it true that not eating anything looses weight??", "dishasehgal189": "How you got rid of that double chin though!?", "falguni_deswal": "How to get a flat tummy??", "tanupriya09": "Any plans to gain weight? Why is everyone in this race to lose weight. 🙄", "jayanti04_": "How to tone thighs and stomach. Also the best foods to eat @komalpandeyofficial", "thatdorkiegurl_3715": "How to use facial fat @komalpandeyofficial", "sannaaaap": "How many meals do you eat in a day? @komalpandeyofficial", "__ritikachaturvedi__": "How to reduce weight by doin no excersise", "parikalra6714": "How to get rid of belly fat", "__anushuya": "How did you stay motivated throughout??", "tanvi_joshi9": "How to lose weight without going to the gym???", "rajjanmisha0069": "Hi Komal, how did your loose your thigh fat? And how much time did it take?", "yashu_nutz": "Hi komal I really love your smile and style.😘 My question is how do you come up with innovative idea for your youtube video and what inspires you the most?", "bishabiju": "How to reduce cheeks?", "disha.goel.27": "How you maintain it with so busy schedule n don't you crave for tasty food", "ritu_maharjan_": "Hi Komal, can you tell me how to plan our diet in order to lose weight if you have a busy schedule and don't have the time to hit the gym! Would be a lot helpful. Love from Nepal ❤", "__pretty_mess": "How to lose weight or fat without building muscles? And how to bring back that sexy jawline ☺️@komalpandeyofficial", "chetnadengri": "Why did you choose to lose weight! You would have opted for being healthy and beautiful just like @ashleygraham rather than being skinny...what was your reason to lose weight?", "_sishanki__21": "How to loose wait from the thai muscles???", "oinny_the_fashionguide": "Is consuming home cooked food is enough or we must go for dieting?", "believe_2468": "How to stop craving for junk food", "aishwarya_gachinamath": "@komalpandeyofficial how do u deal with negative comments?", "watchsunsetswithme": "How to slim your face? Any facial yoga suggestions?", "nikhila_chowdary05": "Komal can you please share your diet plan which you followed and your daily workout routine??????? Pleaseeeee", "prachiiguptaa": "Did u have stretch marks after weight loss.. if yes.. then how did u take care of them ??", "pratikshajaybhay": "Belated HaPpY Birthday komal🙈❤😘...Share your birthday day out....n also wanted to ask u how u mainten ur food balance in a day...Food routine for a regular day...???😘😘❤", "__jst__queenin": "How to loose arm fat..??🙄", "deepali084": "Quite excited! So my question is , How to lose weight without going to the gym? Lots of love♥ @komalpandeyofficial", "priyanka._.perky": "How to motivate urself fr losing weight?", "_simplyy_j": "How do you maintain your weight lose?", "amansaini0309": "Hi komal. Your figure is damn awesome😍 plz segguest some tips to loose thighs weight. And diet routine.", "madhuparna_ghosh": "@komalpandeyofficial how to loose pot belly??", "_anchorage": "How do I motivate myself to exercise..", "aasthadalal_": "What was your diet and how long did it take for you to tone down completely? Also, I love you so much and your ideas are so creative. So happy I share my birthday with you.", "priyanka___parashar": "How to lose face fate?", "_salonyyy_": "How to be confident about your body? I'm 17 years old and I always feel I'm gaining a lot of weight and look ugly..how to feel good about yourself?", "shreyaambagade": "How did you lost your weight, as we have seen your old pictures?", "sheetal23._": "Yea.....sure...", "tjakshaykumar": "Blue background 💕💕", "prashita04": "Have you cut down on your diet? Or you are eating everything as usual just hitting on humming and exercising.", "rashmi_aswani": "I really love eating. Paranthas, curd, butter, cheese. Ghr ka khana. Dal chawal. Wd roti and sbzi. How one manage to go on diet and be fit. Plz help me out wd that. I cant go on diet and eat salad. And also share daily easy workout routine. Thank you.", "manaliiii__": "Heyy beautiful 💕love yaa✨keep on shooting videos we all love it💕", "tanvii.singh": "How come you managed to get a chiseled face??", "navya.gupta_": "How are you able to stick to your routine for weight loss despite all the good food around you?", "do.good.be.good": "How to loose weight frm upper body from belly back arm spclly... @komalpandeyofficial", "athu_athulya05": "Hiiii Komal..my question is how do you maintain your shape during your BC schedule?", "sonali.chakraborty45": "❤", "yashikagurung": "You look so amazing😍💘", "apurva_naik_7414": "Kindly advise on losing thigh and belly fat 😅.. and the diet plan please", "nehaaa_024": "How to keep urself fit nd healthy?", "parna_16": "Bra buldges... they just don't go. And back fat. Please share how to deal with them ? @komalpandeyofficial", "kinjalkhimesra": "How to tone down thighs?", "garima_mahi_wadhwa": "How to remain motivated??? And how to work on calves???", "shanu_shenoy": "Whats the best drink to loose weight", "ugagabsvsvhxbznsb": "Is there Is Any Diet Plan ???? @komalpandeyofficial 😊", "sargikaur_": "How to reduce belly fat?????", "elllizaaaaa": "How to lose facial fat , those exercises dont work for me 💔", "dr.tanvi_desai": "Hey @komalpandeyofficial❤ My question is how to lose weight without draining energy in gym and heavy dieting?", "aayushi.xo": "How to reduce thigh and belly fat.", "_misswonderwall_": "What did u get rid of face fat? Really want to know 🙈", "pallavi_bose": "How to reduce fat from the thighs. ?", "rebel_with_a_causee": "Gym styling tips 😃 please and how to get the perfect neckline 😍", "puchkuu_": "How to reduce belly fat", "riyankasarkarxoxo": "I want to gain weight.. im really thin . What to do? @komalpandeyofficial", "thesassygirl_1": "Woah...Exited!...Komal di how you maintain your diet while traveling?", "bongololona_96": "How to tone arms ???", "shyal_12": "How to stay consistent with your plan", "chatterjeenoyonika": "Hi Komal I have been following you since you worked with popxo . My question is that how to become a fashion and beauty blogger and please share with us your journey of becoming a fashion and beauty blogger and you tuber. Love you and your work and belated happy birthday.", "riya.saikia": "How to get rid of arm fat and thigh fat? @komalpandeyofficial", "flowerfairy_300696": "Did u still follow some kind of diet?", "sonamnetani16": "How difficult it was to lose weight? Did you ever fail to achieve your target or you were pretty much bang on ?? And if yes, how did you keep yourself motivated all the time when you did not achieve the desired result even after putting so much of efforts? @komalpandeyofficial Waiting for this video😊 Lots of love ❤️", "shreya_agrawal9999": "What diet you followed?", "shubhi.sharma10": "Can you tell something about facial yoga?", "sakshi_jaiswal26": "@komalpandeyofficial Easy steps to reduce thigh fat. I've seen many videos on YouTube but nothing is working out. What to do?", "cute_baby_238": "my questions are ... 1.where are u living now??? 2.how are u soo... beautiful like an angel ... 3. can u plz... come to vijayawada I'm ur huge fan hope u anwser my question....!!!", "deepali_dhanwani": "Just started my youtube channel ... Any suggestion or advice for me ? That will help me in future ?🌸", "priyamvada____": "Is it okay to have sugar, if you wanna lose weight??? #", "khanammd": "How to lose weight or tone down ur upper body??esp.arms", "muskano21": "How much time does it take to grow your channel or profile..i am a makeup artist(beginner)and i put lot of effort but still can't see much interactive audience..if you can give some tips how to do that..anyways i love you alot and your work its just awsome..wanna become like you one day", "rebeccamoitra": "How many calories did you burn in a day?", "shraddha18_": "Only question is that how to stay fit like you! How long it took to loose weight? And what diet you followed& exercise routine&yeah your current diet chart please🌻"}