{"fifty.shades.of.skin": "I used to do this with my mom's dupatta when I was a kid 😍🤣👍🏼", "barnali__1996": "💕💕", "nehaa_makol": "Blame the country, or our society for making you feel that you can't wear these clothes outside, don't blame women wanting to wear clothes they want. If you aren't comfortable, it's because of the world we live in. I am sure a man doing a fashion therapy with a vest would not be bashed like a woman does who just want to experiment some with a bandeau top.", "bikkiyadav12": "Where are your pants from ?😍", "caroldsouza94": "@tina.manhas", "akanksha__30": "@ridhishrma @dravitasingla Fashion ke naam pe tatti😂", "akank.mitr": "I have been watching popXo ever since it’s inception and it amazing to see you evolve ,have always loved what u do be it a video about Maggie lovers to how to style a dupatta !you ‘re such a fountain of talent !Keep rocking the way u always do !ATB", "sansiiago": "@riyalest I feel you’d do this", "sarishti_sharma1432": "U are really example of talented fashion blogger", "thequirkydrama": "You are lit🌸🙌 best fashion therapy video🌸", "kashyap_purvi_jha": "Where do u get that white pant plz tell me", "malviyaveena": "😂😂😂😂😂", "medhu.vadaaa": "@best.dressed something you should really see", "meghavaswani1905": "None of this is practical its good to see but except you can anyone really step out wearing dupatta on bralets????plz post something normal people can actually do!", "sagittariansareesaga": "How cool is this!", "sagarikagangulybhattacharjee": "@arkjyti", "shaily_doshi": "Too fast. Can you go slow so that we can actually learn", "smitxa_": "I already discovered these ways back in 2007-8 when I use to play Ghar Ghar with my sister. And we use to have 1 duppata to wear and style. :0", "namitaassharma": "What even😂", "virtuosoinsta": "Ye kaam bachpan m ladkiya karti thi kisi b dupatte ko kisi b style ki sadi bana deti thi you are not creative at all😂😂😂", "juyal.shruti": "@udtaapandit", "bagheeraa9": "@roqueencampos", "mukherjeesagrika": "May I know where r these pants from ? 😍", "prey_c_ious": "Where is the WHITE PANT from", "_.allliiiee._": "Oh god ! Like always speechless🤤", "_harshitamathur": "wowww♥️", "lashesluxuryleather": "Your styling tips are to die for ❤️", "sanjana.sethii": "Hi Komal, please make a video on outfits for different body shapes. I am sure most of us dont have perfect figure like you do. 😊", "shrija_h": "Why didn't I find you before. I really can't explain how amazing you are. 😍😍😍", "sambhawigautam": "@grover.sonali 🙄", "jain_anandita": "@sakshigopalsg", "graphiquelle_lyon": "What music?", "serene_singh": "Love the video!😍😍 What song is it though?! Please😁", "nimishaagarwal15": "Amazing 💕💌", "_rittii": "Uh make everything so easy n sassy maann😻😻😻🔥🔥💯", "sushantambardar": "Wow!!! do you reply to every person in the comment section", "piyanshimehra": "@lakshitaabhatia what on earth😍😭", "manu_sharmaaa": "@mrinalinishingh", "beauty__secret10": "Hey girlss!!!! #girls This is the new page,which is the world of beauty,skincare and makeup💚 Just go and checkout my new page - @beauty__secret10 You will find posting each day about new beauty tips and skincare,and it would be absolutely of your choice and demand and very NEW and very Different from others!!!! Make sure to follow @beauty__secret10 And share to your family and friends⭐️", "vann_project": "And for breast size 36c 😎", "chakmabuoy": "Song name", "nicoo_nico_niii": "Aren't these ways only applicable to small chest sizes ! 😶", "rtistryofficial": "Only YOU can do this !!!!", "mondolpuspita": "Wow", "zamie_ella": "Pants brand?", "agarwalpurvi1995": "Can you show the tieing up properly because it is fast forward can't really understand it properly", "three_efff": "Creative 🔆", "ankita_ritz": "With bigger boobs..No chance!🌚🌚🌚", "exoxoxo1_": "😍", "iamtaninir96": "aise kon jaega bahar😂", "meenu_praa": "sorry...but doest look natural!!!", "vyshaleegosain": "@_priyasaini_ bra pe dupatta?", "tanishi_tulsyan": "You are such an amazing soul🌸", "__cheenki": "Just bought that beautiful skirt", "silkysukanya": "Yaar you do so quick how can it will help us? 🙄 how will we know how you're doing that thing with your dupatta", "babyfery": "Awesome😍😍", "pallabi_150692": "Dnt like any of them😒", "i.soimatif": "Breaking news: Other girls have bust. Not possible practically.", "tapaswinimohanta99": "What u do wd these props is amazingly.. when i try its all messy n pathetic 😝", "kumariveena": "Nobody will wear it .even u won't wear it outside ur studio...", "arastha": "I love ur new ways to style outfits! But they are all for skinny/thin ppl.How abt a video on styling for curvy women?", "ektasingh0298": "You really need to get out of those bralets... A real fashion therapy is how one thing can be wore by girls of different shapes n sizes.... Don't you have confidence to try different things except bralets???", "garbyangsha": "Busty girls can't do this!", "sneha_raiii": "Mam, the ideas are nice, but they are not appropriate for daily college/ work wear.", "shivani__rajesh": "@barsha_sinhamumu dude my idea!!!😂", "pranjali_13": "Where is the dupatta from?", "jayantikaa": "As much as I love your videos, I doubt any woman in India would feel bold enough to step out like that :(", "shwetaaatiwari": "Wow!😍 This is the best possible use of a dupatta but at least the 95% population is not going wear it. But still good vibessss always to her blog. Its the best❤️", "suman_newar24": "Lol! Who is going wear dupatta n roam about ?..people will think u hve gone mad.. It looks in videos or picture.. But it is not gonna work in real life + it will b vry uncomfortable to wear like that 🙄", "rawatsushmita0209": "Can someone please tell which song is this? This is so good.", "jainsaahab1112": "Sorry but i didn't any of the ideas😊", "dossier_of_my_cosmos": "No one! But here she is, thinking people may actually follow this. 😭", "neilchacks": "The style is good and everything but can someone tell me the name of this song??? 😛", "adiba_siddiqueee": "Bloooooowwwn!🔥", "shruti.rajput.91": "@komalpandeyofficial can you please tell how with dupatta u got the second look..I mean how to make it in that way?", "__nitasha_behera___": "Off course uh don't hv big boobs uh can wear those..", "bhattacharjeea482": "Hi komal love you a big fan of yours", "deepshikharampaul": "My goodness😂😂", "anjalihihi_": "The last one 💙😍, beautiful!!", "upasanakalita05": "Fab🔥🔥🔥🔥....", "winkies2015": "Wow love all that trick.... I will definitely try.... Lots of love from nepal❤️😍👍💕", "__devanshee__": "@tanishaaaaaaaaa_ you should definitely try this", "winnie_8501": "dupatta from", "pia__singh": "Hey @komalpandeyofficial please make some simple outfit videos . 😍", "sheetalverma519": "i never saw wearing anything like this outside", "trisha_deepika": "can you please wear your dupatta like that in your events(at least one) except bothering expensive wears!!? please!!!!! 🙏", "maideshpande": "@sahiti_alavala", "rachitadadwalmultani": "This is SUPER HOT 🔥 n super innovative... just love love love your videos n you ♥️ You’re the BOSS . Keep showering us with such beautiful n creative ideas . Love ya 😘 @komalpandeyofficial", "a_heart_that_writes": "Where did you get those pants from?", "divasharma559": "Omg hts of to her parents!! I never want my kids see this kind of video!!", "jasminehussain": "No one wear these types of clothespins", "maitrayeed": "Cute but unwearable.", "kmallick.bby7": "Is", "thelazycreature_": "Obviously we can't wear this in public atleast 🤦", "dhanshreechandak": "@aboliupadhye : use the Dupatta I got you !!!!", "shailly_m": "Only Manchester girls like you can do such things.", "jigyasa_raj": "You remind me of gigi hadid 👌🔥", "gunishkakaur": "Ooo loved it🙌🙌🙌", "itsme_rashi_": "Gawwdddd🔥🔥 ❤️ i wont be able to carry a single look.. Bt just imagine if I could do it as u did.. Would die..", "mehangi_raut": "Am I the only one who thinks it's very impractical?", "sidierrez": "Name of the song in the video?", "___.pratz": "V❤️❤️", "simran_manaktala": "Loved the 3rd look🔥", "jannatnazirr": "This is so ORIGINAL , can even be done a white dress or skirt outfit for a modest Version 🤩", "bhavnagoa": "🔥", "arujeea": "I don’t think so i have seen someone so classy, sassy and SO COMFORTABLE in their skin like you @komalpandeyofficial", "senduri": "@michellephan did this half a decade ago", "r0wdybaby": "Can we wear dis in real world 😞😞😞😞", "_harshithaaaa": "Why aren't any of your fashion therapy videos wearable? - once upon a fie hard fan of komal. 😥", "barish_97": "You are such a talented beautiful girl❤❤❤❤❤❤❤🔥🔥🔥🔥🔥🔥🔥✨✨✨✨✨✨✨✨✨✨✨", "anindita.jpeg": "Ayyy these are so nice ❤️ but they wouldn't work for me😢", "_deja__vu___": "I always watch your videos on Instagram and you tube but every time I have seen you overdressed mostly with a plunged neckline... Normal people can't follow your styles at any cost.. do something real and helpful.", "chaitrasudhak": "Never raise your hand 🙋🏽‍♀️ if you are trying the first look", "kanika_saxena02": "I really want you to go to like a street market nd buy those cringe worthy, super out of style clothes nd just somehow style them... May be like a challenge.", "__.prity.__": "Creativity at its PEAK 😻", "anujaaphenany": "@iam_anushka did u watch this one?", "tara_ravindran": "😍😍🔥🔥", "americandesimsm": "Your style is so innovative. I’m a true admirer! 🤗", "sakshee_sh": "You are 🔥", "therealakshita": "Girl you are lucky!", "mansi___2505": "Ma'am I love you ,I m big fan is urs Ma'am you are my idol♥️💋💋💋💋💋💋💋", "simrankaurr23": "@ritu_mishra2 how stupid is this.", "dambatra": "Where are the colorful earrings in fourth outfit from? 😍", "srabani.h": "@saarikaa_", "_parmar_khush_": "A perfect combo of beauty and hottness ..😍", "14.niharika": "Damnn 😍", "__cool_gurl__": "It's just like wrapping a dupatta around urself its impossible to wear those in public..", "diptishindekar": "Can someone just tell me how is this relatable fashion? I don’t think women with bigger boobies can ever wear anything like this.", "sxfx.txdxvi": "Ok being honest aisa koi nhi pehnte and dala bhi toh log hasege bolege ghar pe kapde nhi kya", "saherasadmir": "i cant even imagine how you mustve thought of all these ways", "sabeenkais": "FOREVER FAVORITE❤️", "melon_0210": "😂😂😂😂😂😂😂😂", "_arrefa_": "Only you can pull it off.. rest all of us will look cartoons if we follow your style 😑", "_cw99_": "You’re so talented♥️♥️♥️", "radhika765": "@pooja.chauhan_", "raynachristy._._": "👍👍😍Awesome", "coffee_cakes_lover": "@thestylebequest see this, m addicted to it rn", "bhoomshaw": "That skirt look 🔥 totally doing that to the beach someday😅", "urmidaga": "Love this!", "4reina90": "Such a gorgeous inspiration to us new bloggers❤️", "fashion_and_forecast": "What is the song ? And lovely styling 💙", "_maruko.sakura_": "but didi! this is not applicable for me", "iam.vidhi": "Just saw this. Open a brand called “The Komal Pandey”", "aisha.198": "And none of these ideas are really applicable other than making a video of it. 🙄", "unicorn.woood": "bomb🔥🔥🔥🔥", "garima_95": "This looks really hot, but what about the girls who have big boobs? For girls having big boobs it would require so many safety pins and don't know what else? And trust me a duppatta can't hold and carry big boobs easily.Sorry, but being a curvy girl like me,I wasn't able to relate to your fashion sense which almost all the time requires wearing less and less clothes.", "_shwetakumar_": "How you do it justttt howwww you do it so effortlessly likee howwwww😭😭❤️❤️❤️❤️❤️ so perfect!!!", "anjlibhaskarsingh": "Not practical", "rmarathe": "@suman.dahal8900 she’s been deleting my comments too it seems :) sooner or later honest opinions are going to out number all the praises.. how many comments can they delete.", "lunkadaditi": "😍😍😍😍", "thesilkstudio": "@rashitasahni @sanjana_947 @dixitabhinav REAL fashion blogger. Major inspo!!!! 💪🏻😍", "_____warriorderpina_____": "I dare you to walk out in the first look with that duppata 😝😝😝", "_mahek.k": "Okay really great. but, NOT PRACTICAL.", "z____0987": "😂😂😂😂😂😂😂", "vrulliam": "So creative, so unique💖", "divyasharma833": "damnnnnnnn i love these ❤️🔥🔥", "123aarohisharma": "which lotion you use in your hand?", "sonali._.kashyap": "@deeksha.sachdeva96 What on this good Earth is keeping that dupatta in place? 🤤", "artractivebrain": "Dude where did you learn your styling from?", "chhavi_basra": "Best one till date😍", "khusshhihii": "@eysshhaa._ 😍👅", "pri.nambiar": "Where are the pants from?? Its 🔥 !!!!", "priyal_kaushik_": "Wow😍😍💕💕 it's so Damm unique ✨✨ you really stand out!! Love it & Love you💕 xoxoxo❤️", "inglesnehal": "Love all of them ♥️😱👍🏼👍🏼", "silk.diaries": "Waahoooww", "sonaliajgaonkar": "Love love love this video @komalpandeyofficial 😍 this so fresh n new styles ❤️❤️", "sparkle_060.4": "No doubt these are hot but can you wear it on Mumbai or any other streets?", "paras_chaudharyy": "Okay this is all soo cool , like really cool. But lets be honest , even our actresses cannot wear a bikini top in public, how is it relatable to Indian girls ?I know we should wear whateva in hell we want but still , no one can wear a bikini blouse in public gathering or college for that sake. So as much as i like and enjoy your ideas , its still far from normal girls world. Bring something that can be actually handy at ground level and keep it up.", "nidhitomar03": "🔥❤️", "moushambi": "Gosh!!! I love the last one!!!😍✨✨ (All of em')✨", "arshiaahuja": "🙌🏽🙌🏽", "hence_me": "😂", "asansangma": "3rd one🤩🤩", "the____wallflower": "Could u post videos daily? Or like every hour? Specially fashion therapies @komalpandeyofficial ❤️", "polkadotsandsushi": "This is genius ! I used to do the dupatta bustier thing at home, but never realized it could be styled to wear it outside as well and so chic ! Brilliant❤️", "shipragoel_97": "I would love to know how you tied up all this looks...make a slow video on this particular one", "1995_azu": "@komal97naik Goa vibes", "meghaarora_ma": "Who r u? Fashion angel or smthng😍🔥♥️", "priyanka_kori007": "@gwenfernandes 🤣", "_dishdish": "@aanchaljaggi", "_shikhar_rawat_": "You always dress up amazing and unique ! I just love the way you carry yourself and the way you flaunt ...love ya ❣️ @komalpandeyofficial", "thisispreposterous": "These are lovely but Not very curve or big boob friendly ://", "lekhareddyyy": "@kranthisuroj we gotta try", "aakankshasinghdiaries": "@alwaysamoopoint see this!", "dua.e.nooronline": "Queen ♥️", "kanishkaa.changaa": "DUDE ARE YOU FOR REAL !!!! LITERALLY DYINGGG OMGGGG , YOU ARE AN INSPIRATION OMGG , LOVE LOVE 😭❤❤❤❤❤❤❤", "manasviniraj": "Extremely innovative. However, would probably not work for someone who is booby. Any suggestions for them ladies?", "miss_ugly_potatoe": "Omllll.... How can someone be so creative 👀❤️", "e.jakhar": "Cool❤️❤️", "imakankshamishra": "Dayummmmm woman💘💘💘 thanks🤣❤️", "khus_hehehe": "Damnnnnnn u r like give me a bralet and next day \"10 way to wear a bralet\".Thought process count unlimited", "aditisarafi": "Unrelateable but Appreciable 👌", "whocares2231": "Again impractical...cmon busty and healthy girls can't wear a dupatta like this atleast think for us", "lpurty126": "Omg !!! U give me goals !! I admire u so so much ! M about to cry 😭😭❤️❤️❤️🌻", "theroyannn": "How did you tie the 6th dupatta", "literallynikki.in": "Slaying it like always!", "vampyrii7": "😮 nice", "tripathi.richa005": "Plzz ma'am do something relatable", "krishuradz": "Like your attitude 🔥 and also you❤️", "the_boho_chic": "@shruthiminni how cool is this!", "khadeejanoor": "Oh my God, I LOVE THIS!!!!", "simran_mandloii": "Maha ghatiya didi", "88_6j": "@iamamnalodhi @furrrrrry", "emerrgahd_": "Where is the blue skirt from? @komalpandeyofficial", "pratikshathorat": "@sayalitakawane", "farida_raoti_wala": "Ohhh you...nd your fashion therapies....😻😻🔥🔥❤️😍😘😘", "_archiekins._": "I just want to ask one question, which one of these outfits can I wear when I'm traveling to college in a metro like 90% of your other followers do, no shade I love your work but don't you think a lot of what you put up now is only convenient for you and not for regular people like us", "kchummi": "Always love to watch your creativity! Some of it has rubbed off on me. Now when I pick an outfit, I always think - what would Komal do?😁", "nalinibhu": "Not practical.. This style of urs won't work for commoners.. U live in fantasy", "swetanotshweta": "Damn this is lit🔥 @komalpandeyofficial ❤️ love love love your creativity 💞", "shiwangi_peswani": "Am I the only one who thinks that all her style vdos are for the skinny girls 😉🙈 I hope @komalpandeyofficial won't delete my comment..Like really I didn't find them wearable at all...haan I guess on a beach vacation one can..", "aaaashnaaa": "As much I love it wish it was realistic too .. wish one could wear all these styles in Delhi", "dhritssmehra": "LOVEEEE!!!!", "roly.polyy": "@komalpandeyofficial Is it real.. That I just saw.. 😍😍😍😍😍😍😍😍😍😍😍 I repeat how can someone be so thoughtful 😍😍😍💋💋💋💋💋💋💋💋", "thereemstore": "Inspiration credits: @best.dressed"}