{"wyndyboy": "Electronics are bad for the environment", "an.xie_": "This girl looks 12", "ftbl_cg_99": "Skipping school to yell at people and not even do shit 😂", "narhurley": "It seems, I’m not allowed to post how I actually feel about you..", "reynabecker_": "Pussy", "dospg712": "Береги бумагу!", "cagatfs": "❤️♻️", "no_name_with_milk": "Whore", "__camobrat__": "U r writing this on a paper if uk that", "moicanno": "🤮🤮🤮🤮", "million_dreams.1s": "Hi✋", "lukinha_yo": "te amo :@@@@@@@@@@@ . . .@$#%$#¨#¨&%#$%@%#@", "tantlyckrablogg": "I agree 👍", "srujannnn_": "HOW DARE YOU STill do this BS", "joaovitoralvesrego": "🤮", "fajkos3": "🤮🤢🤮🤢", "iomenete": "Why are y’all mad? Genuinely wanna know. Do y’all not believe or care for climate change or is it solely just y’all not liking Greta? What has Great done wrong? Please educate me", "farca_hc_": "💩☭🐀👹", "_____vishal_____": "Save paper save 🌲", "ollllollllllo": "😯😯😂😂", "lil._c_arney": "Don’t care", "kevin.s_scb": "Paper? 😂", "ridzuanbinmazlan": "the paper you are holding is made out of trees", "alia_bouamar": "HOWWW DARE UUUUUU!!!!!!", "sara_sikal": "Eh eh greta non si USA la carta", "misha_kostromenko": "🤢🤢🤢🤢🤢🤢🤢🤢🤢", "_cro_wn___": "💕", "axel_lubbe": "🤗🤗🤗......😪", "ltalosilva01_": "🔥🔥 #f4follow #F4F #FOLLOWERS #followforfollowback #SDV", "niconsl": "🤢", "sustentabilidadeinformacional": "❤🙏#F4F #SDV #FOLLOWME", "filmingaround": "💷 €€€ Pure marketing $$$ 💵", "susansnydernotspider": "Oh Gretty, Lil Gret, Margaret, Gretters... Look hun, you don’t want to post about saving planet from climate change and then ask people (no dear they’re not your fans) to take pics on their phone and post it (btw that handwriting is pretty bad, but still good for a 12 year old so don’t worry hun you have plenty of time to practice). You do know that phones are one of the biggest contributors to climate change, right? Whoops! Yes honey! That phone that you’re holding while putting all those beautiful selfies on IG is a cause of loss of sea ice, global warming and temperature rise, strong hurricanes (yes hun!), and many many more horrible results. I know you’re thinking “Oh Susan leave me tf alone” but I’m here to tell you hun, you’re sending a message that’s kind of hypocritical. And you can’t be hypocritical when it comes to saving the world! That’s like, the rules of feminism!! But don’t worry, once your breasts are fully grown and you become a grown well educated woman you’ll know what I’m talking about and bad presentation of your ideas. I forgive you. Love, Susan xoxo", "gustavo_sousal": "Vai dormir", "hallokitty1234567890": "WHO IS PROMOTING THIS UGLY CHILD???", "duduzinho1234569": "Fuck you greta fuck you", "przem3ko": "🖕🏿", "ridik.2019": "Фигасе", "cb0rg": "Please let's talk more about world hunger. 800 million humans are starving. While 1/10th of Jeff bezos net worth is enough money to end world hunger for a whole year and feed over a billion people year. 1/10 of Jeff bezos or Bill Gates networth! If US gov spent only 1 percent of what they spend on military a year it would also be enough to end world hunger for a whole year and feed over 1 billion people. Governments have endless resources and still let them starve to death. If governments and corporations came together world hunger could be ended by 2021 if it was a priority. Why isnt it? What on Earth is more urgent than saving 1 billion families and children that are starving? YOU have to adress these issues as well and not only climate change for a change! world starvation of a billion people is way more serious in my opinion! @worldfoodprogramme @actionagainsthunger", "2604daniel": "Did u write that by your own? Or the people that finance u have done it", "jordiesgrandma71": "Here with you, Greta!", "2takt_freak_": "Fridays for Hubraum 🤙🏻", "vova_wrestler_blr": "🤡🤡🤡🤡🤡👈🖕🖕🖕🖕🖕", "liamschmitt14": "I don’t speak idiot", "kutiilbadak": "@mfaiiza", "panov.nn": "Слава Бандері🇺🇦", "djkaur94": "Amm .. the mobile and laptop and AC you use cause co² too..🙄.. and cars or trains you travel in also use fuel..🙄.. so.. just shouting does not lead us anyway..", "_da_ny_aa_": "Я выкину пластиковую бутылку у тебя под домом ...", "akhleshbhadouria_offical": "Uneducated and unexperienced girl", "ky.cl_official": "Is school sweetie we go to school to learn how to spell school", "mohammad_massoud_jalali": "Go away", "bizzlejoshyy": "The girl does this shit to look good", "your_fav_olympian": "That's cool and all but remember Lego people live inside of their own flesh", "leomoraes96": "Enfia tudo isso que vc faz no cu ! Cade vc agora combatendo o corona vírus ?! Pirralha de merda", "pug12345lol": "👏", "hugo.torberntsson": "#diesel", "big.lake.village": "Are schools not closed for quarantine? 🙀", "jamana1999": "fucking albino gorilla looking pos still wants to stay relevant 🤡", "ellenjacobsssson": "NU SKQ JAG UT OCH SLADDA ME EPAN ME D24 @ellen_liindholm", "derakht143": "😮", "kc_x111": "someone stop dis girl im jus tryin to smoke some weed n she keeps popin ip on my fyp🤣💚", "annashine_92": "👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎", "chikabombinator": "хуета", "klea_lela__": "🌿🌿☘☘🍀🍀🍀🌲🌲🌱🌱🌴🌳🌴🍃🌾👏👏👏👏👏👏👏👏♥️♥️♥️♥️♥️♥️♥️", "jorn8483": "Du nervst!!!!!!!!!! Lass die Menschen mit deiner Arroganz in Ruhe.🤢🤢Fahr nach China Indien oder Pakistan du freuen sich bestimmt auf dich Nervensäge.🤮🤮🤮🤮🤮", "angellopezbarroso": "👌👌", "jameswane491": "Please just be quiet. You're just a child who has no idea what she's talking about", "214.omo": "You only using this to not go to school go help my dudes in Africa", "anthonymontoya._": "Fuck u noone cares", "madipxrry": "@lyla.mxrchantxo she really be saving de planet dow", "79.leonida": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕💩💩💩", "maurice_bvn": "Make the porsche fast again @pfirsichsofa", "maxim.decam": "Corona done more", "save_.the.planet": "🌱✊🏻", "mrd.moodley": "You the only follower of your strike?", "tejash_g_": "Go to school kid", "j.bwn5": "Bruv your weird", "jared.hutson": "“whatever is safe and comfortable for you” you’re taking a picture bruh", "luthful7": "💮👏👏🍀", "ughmy.mind": "cant wait to eat meat and chop down trees😍🥰", "jfranklin_carvalho": "Tá boazinha da cabeça😂😂😂😂😂", "_sandra_diniz": "🤮🤮🤮🤮💩💩💩💩🤮💩💩💩🤮🤮🤮🤮💩🤮💩🤬🤬💩🤮🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🇧🇷", "marvinjo9": "Shut up", "kindnesspandemic.tv": "Thank you for all your amazing efforts ❤️❤️❤️", "byvaet1": "A a a a a a ...", "ahb.nas.786": "Hey @leonardodicaprio Look at your student she cares about planet than human lives. hope she got this from you", "mariannemossheden": "❤️", "oliver_engstrom05": "@leomikaelsson @leomikaelsson", "w_dew14": "Pls drž už hubu Greto jsi naprcana piča ktera si sedla před parlament a tak se stala polityčkou kurva přestaň", "rey_delmal": "#dayofdominion", "margheritap33a": "Why only climate change @gretathunberg ONLY1 MATTER ?", "franmary03": "💚", "apophis_13042029": "🙏🙏🙏💚🌱🌍", "smm_prod136": "Еп", "jrafafernandes": "Greta... cadê o seu posicionamento sobre as políticas sanitárias da China??", "itslorraineeee": "Thank you @gretathunberg , thank you for being the inspiration of many young people like me, I will not stop working for climate change, thank you for being my inspiration, I hope to meet you one day", "svanwal_": "🤡🤡🤡🤡🤡", "beautiful_cry_baby": "Тоже ищешь тот самый, русский коммент?", "noufbinadwan": "What about that paper that is barely even filled? If your willing to save the environment you should at least use an old peace of cardboard or something reusable.", "lhdoug": "FU millionar's kid !!! Enough about your money-machine !!!", "iiiivann_23": "Ole Ole la greta", "sir.don64": "Yep that’ll change the world 😂😂 you fucking idiots are ridiculous 😂😂", "bergmann534": "👎Greta 🤮🤮🤮", "jessicashufelt": "❤️", "veletanlicm": "You’re the jungest bravest person ever in our world 🌎.Smart enough to take a good action for the climate change .Best wishes for success in life ❤️👍🌎", "iramh22": "Ya siéntate wey", "andersonlbianchi": "Your PIRRALHA", "kingbenjamin48st": "@krithag Ur dauggters twin lol", "vngzi": "Haters gonna hate. We see you standing tall Greta, like hope in a world of hate.", "deepakr.patel": "you great", "peter.abbot962": "There isn't any school you retarded zoomer", "beckisentertainment": "Hejja Greta!", "jay_chubacka": "Brain washed child fak", "natureall_": "I am an environmental awareness and conservation page. Please check me out! I will plant a tree for 20 followers!🌸😊🌍💜 . @natureall_", "seba.melloni": "Stfu you cringe kid", "besi04aga": "Stop actin like you are doing something big , you are just a child ,who wants to be famous 🤞", "_kyle_young04": "You should stay inside", "me.si.can": "I love you greta", "josuerosarioperez": "🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴😘😘😘😘😘😘🙏🙏🙏🙏🙏", "tuhinsur": "💚💙🌍", "forrodopele": "Queria brigar com o brasil por conta da Amazônia agora reclama com a China", "polly_duda2507": "And what about China that put the whole world at risk of hiding the Corona Virus? Aren't you going to protest?", "watts_alex11": "@gretathunberg how dare you", "wanderson.jose7": "Pirralha !!!!", "margecsrb_bln": "Follow @grabstein_memes", "daniloplenaseg": "Lixo", "stan.smithxx": "Hi Greta, sincerely go back to school. Regards, everyone with half a brain cell", "bad_fire_cat": "Ебанько...угомонись", "uhh.community": "For dear #earth", "peterzonis": "Hey twit its the end of the world", "thiagodiasbjj": "Anything to says about the China virus?", "poawj": "Fuck you", "cohenjustins": "Greta you're the best from North Hollywood CA", "heibie2": "What You Didn't Achieve Was Covid 19 Achieved! 👌👌", "tonycm3000": "Be carful out there I heard a lot of pedophiles in Hollywood are getting exposed", "ybn_.josh": "Our eco systems are dying i have to go to the other side of the ocean how dare you", "hkplasticwaste": "do u think u could check out our acc? we are spreading awareness on plastic waste!", "asian_in_norway": "Why don’t you take you’re climate protest to China the worlds biggest problem??? Honestly I respect you’re job, but you point the fingers in wrong directions!", "gurveersingh777": "@gretathunberg Good news... Earth is healing", "sid_van_den_beukel": "Greta Thunfisch", "fatboyfleek82": "I hope you die in an earthquake", "tolino_2019": "Von dir spricht kein Schwein mehr ,Greta go home hat sich ja bestätigt", "ericmjmiddo": "Stupid little bitch", "gregsoondo": "😂😂😂 #irrelevant", "akshata.chonkar": "Keep doing what you do, we are proud of you and with you all the way Greta! We must protect this beautiful planet for the safety of everyone, even those who don’t believe that saving it is worth it.❤️❤️❤️❤️", "_malu.711": "Omg du hübsche lyyyyy❤️😍😍😍😍", "cchilledd": "ZoooOOOOOMoMM.meme.f.rmr.r", "__l0vvas__": "Fin skrift", "winadavidson": "The world is cleaner without your speech, thank God", "australbandninesix": "@gretathunberg HELP TO COVID-19!!!!", "chris__bowman": "Hi Greta. Hope you are well. This article made me think of you and how this pause in human may be what the earth needed to start to heal.", "i._.is.k": "Shut up u lefty looney wouldn’t be saying that if u got covid", "ben.pietrzak_": "Ur weird", "obdolbanii_dragon": "Хуйня", "tiagosanches4": "Any word about China virus ?", "anthony.luis.dacosta": "Shut up bitch", "luisaug4": "Idiota", "brown_gallery": "Insane bastard", "thathealthbitch": "wow... the amount of grown ass men and women targeting this girl in the comment section who is literally just trying to get people to care about the planet we inhabit. the immaturity is really showing", "lucas.reis.oficial": "Ô filha do demo, vai falar nada da china não? Ela não destruiu seus sonhos tbm ? Só a Amazônia? 💩💩💩💩", "sanageyamax3": "👁️✡️", "ma_rcos7859": "EAE sua trouxa", "tapjankson": "@thathealthbitch And your comment is SO mature??", "ethan.wood27": "Climate change is not real just stop", "danieldiass01": "Ta sumida...ta tendo uma pandemia no mundo...vc está vendo?...o bom é que acabou o fogo na Amazônia?", "stromerwave": "Joder tía. Eres una gillipollas gigante. Esta bien que quieras cabiar esto del mundo, pero a quien carajos le importa tu vida pasada, deja de insultar hija de puta. Te odio.", "lucasfelipe_musico": "@jairmessiasbolsonaro in Brazil and @realdonaldtrump in EUA. 😘", "covidtestingkits": "Please contact for Covid-19 testing kits and spread the word in your community! We wish you and your loved ones well in these stressful times❤️", "memetits_v2": "Bitch", "ngarepdadake": "😊😊😊😊", "bruce7777y": "😂😂", "fxdsny": "?", "luki_dogi": "Ты больше тратишь бумаги на бессмысленные плакаты чем всё человечество за 3 года", "thesevenumbrellas__": "I'm proud of you🙌❤️", "kucejaandreas": "ventusky.com", "livelikelions1": "You need some milk. Shit. Is it the right time to talk about climate change now, when people are dying. @gretathunberg come onnnnnn!! Go to sleep", "leonardo.sanchezzz": "How do you feel that a virus has done more for the earth than yourself?", "motorola_merc": "Bitch legit the virus is on and u talkin bout this still omg the pollution levels gon down CRAZY AND Yr solutions are impossible to finalise and live with ur used by media and adults lol just fuck of already m8", "animals.r.mypassion": "You, Beata, and the dogs stay safe!", "friendorfoe219": "I would join you but I came expected🎉😂 lol fuckin sorry", "scarletteverettt": "i speak english not portuguese babe", "janaweiljana": "U are a hero", "very_mysterious_markk": "The longer you strike the cleaner air we have. I can feel it. Please continue. 1 year more and dinozaurs will return. 😌", "vor1an": "Shame...", "cristiano_freitaas": "Ué pq vc não falou nada da china ????", "mr.x60b": "Why have you not given a sh*t about paying tribute to the Stockholm terror attacks 3 years ago????? 😡🤬", "agustin.simal": "Te amo ❤️ sos el futuro ejemplo deuchos de los jóvenes 😊", "_ph87_": "Hipócrita🖕", "lucasalvesdapaz": "Hey Greta, I have Asperger's syndrome.", "spackdadmusic": "I’m afraid that there are and have been countless crises more concerning than climate change", "leoncheetham": "April 9, 2020, Santiago de Chile. Dear Greta Thumberg:  I am writing to you from Chile, the southern country, located in the \"Southern Cone\", in our beloved Latin America (a country that you could not visit, despite, as you should know, we were waiting for you, lovingly in your role as an environmental ambassador). Globally, we experience the worst planetary pandemic following Covid-19. The “mandatory quarantine imposed” by governments has forced us to confine ourselves to our homes, in a conscious way: to take care of each other, avoiding the spread of this sad pandemic. Together with a group of citizens and artists who love Culture and Art, it has occurred to us to implement an international \"online\" campaign, symbolically, once the \"World Pandemic\" ends, that the citizens of each country, let us go out to the forests, national parks, squares and streets to embrace the trees as \"love\" towards the planet and life: they represent the new paradigm of \"caring for the ecosystem of all\". We ask you to evaluate the feasibility of your leading, along with thousands, this \"crazy\" and beautiful idea. Darlings Leon Pascal Cheetham. Journalist and Writer. Citizen Movement \"Embrace a tree\". Santiago, Chile.", "justina_guardino": "I honestly hope she is okay. She is just a kid. Hopefully this ends and she can live her life.", "atyre_": "Cool concept", "krystian145": "CORDULA GRÜÜÜÜN CORDUUUUUULLLAAAAAA GRÜÜÜÜÜÜÜÜN", "kassandrateodora": "Oh greta, just get some education.", "sebastianboy1232": "Liksom det är människan som måste sluta kasta skräp i naturen och skol strejka är lika med skolka det blir inte bättre av att skol strejka det är bättre att gå i skola för det hjälper inte att skol strejka sanna min ord", "umairkhan7473": "Hi", "gxitre": "Karen", "markelliot09": "china is stealing our dreams about this virus, go and fight for the warrior people", "pawllynha18": "his dream was just to save our Amazon, where you save the world, where you criticize china, since the virus came from there. where the world’s savior. or you only do things when it suits you. do me a favor ta. @gretathunberg", "wahlbor": "Happiness and hope shall serve you all your life, as well as health and recognition. If the trouble disappears one day, you should not miss anything and you should have everything you need. How nice that your family is there for you, your father must be very proud, because he does so much for you. It is time that you give a young man your heart and he gives you his. Farewell.", "shopjollin": "We love you Greta! 🌱🌱🌱", "skyedarwin": "Please do not listen to the ignorant haters of this world. They do not understand the power and passion that you have and that you try to spread with your work. I can’t wait to see you as a world leader in the future.", "orbeeeet": "Умри гавно", "abutterworth325": "@gretathunberg you’re nothing more than a Neo-Marxist prop 🤡", "scerne": "Now tell the chinese government that he stole your future !!", "san662tino": "Hey humans!", "rikpolmans": "Fuck you dumb bitch", "_thestacy__": "Hello I know u won't read my comment but I just want to tell u plp in china have been eating dogs cats , bats , monkeys , rats , horses. Crocodiles nearly everything and even European countries Italy Switzerland and Australia eats cat @gretathunberg is it possible to ban this it's getting worse poor animals r being killed Evey day in chine itself 10,000 dogs r killed and little kittens 😔", "alexsimao2": "E ai sua pirranha . Sua bosta ambulante porque nao aparece falando da china? Vai se fuder isso sim feiosa . Nasce de novo pra ve se vem melhor . Vc e uma cretina", "feledyzs": ":)", "__________________mesi": "ты блять заебала греча туалет", "roddy.bitchh_is_cute": "Shut up ur a kid", "androvlado94": "Napusi se kurca glupaco neodgojena", "mauroloos": "School strike is great so all the kids become uneducated and ignoring reality like you! Good Job girl!!! 👍👍👍", "ram_kumaraswamy": "Last summer, you had a good time exploring the world in the name of the strike. So this summer, first, we have to save humans. Mother nature knows how to fix it by itself! Humans are a more complex creature in our universe so don't waste your energy on other stuff, please 🙏", "abasinilofar0": "🌎🌸", "das_ukrainische_reich": "Isabella Nilsson TOP ✊🙏", "davidetovo1": "Però hai rotto il cazzo", "fernando.vecchi": "E ai, não vai fazer escandalo com a China ??? Não vai falar que a China roubou os sonhos do planeta ???? Ou vc só faz escândalo com a amazonia ??", "arvid3794": "She is geting money", "beverly.y.y": "Ain't nobody cares if you strike at home smh", "vikas.bavanth": "https://www.instagram.com/p/B-w084LFcPU/?igshid=pf6f2xmfabvb", "tyessia14": "Great 👍👍👍🔥🔥🔥", "yas_vardhan": "Living in an AC room, travel using airlines and yet. How fucking dare you.", "roberto_lodi_rizzini": "Hi Greta! How are you? 😊", "ze_rafael1980": "Procura-se sumiu depois do covid19", "_ngriffin55": "But if you are on the streets you could get the corona virus... well second thought go for it the world will be a better place without you people", "hudson._williams": "So you’re not educating yourself and having a temper tantrum like a freaking THREE YEAR-OLD. Grow the frick up", "kosmo_trance": "Противная", "chronicwarriorlife": "You’ve been lied too, manipulated and forgot to highlight the real culprits of damage to nature, the plant and the people within it! You attended an Elitist event, and then the world lost a thousands of people because of a pandemic!! I do not believe in climate change... global warming or any of that nonsense. But I do believe in respecting nature. I’ve spoken to scientists, my 17 year old Aspergers son loves science and math.. and their opinions never mirror yours or that of whoever is scripting. You are continually attacking the wrong people.. and the wrong countries too!", "jo_ja_hae_17_fbs": "Sat is quiet schit you know?!😂😂", "wesley_grout": "I hate you", "robert_vanoorschodt": "Gay", "ninharibeiro27": "💩", "karin._.69": "Stfu", "fvckpaxton": "ayo can u suck my cocky pls", "blackgamer322": "you are just a kid, You don't know what are you talking about, politics are using you, You Know nothing about middle east, Or other warzones, You just have a mouth, What about action", "jpsenem": "Onde está você agora pra ficar falando mau da China piralha", "bodavies666": "sorry greta we don’t need u anymore we have lockdowns😌🖕🏼", "pamygirly": "Stupid puppet kid , get a life , stop to manipulate 😤", "most_liked_mask1": "Check my account #raiseawarness", "jitendra.rawal.545402": "Is the coronavirus pandameic Artificially Man-made created or A Natural calamity,Time to Research & Not to believe As MEDIA Shows & Tells us", "laluliscr5d7": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "hellen_dielida": "Greta cadê você? A china acabou com o mundo e vc enfiou a língua onde?", "para_fafa": "How does that save the Earth.... 🙄🤦🏼‍♂🤦🏼‍♂", "chiamatemi_r4s": "Sei fuori luogo (come sempre), comunica a tua madre e al tuo agente che vi toccherà trovare qualcosa di nuovo", "masks4medics": "The risk frontline responders live with, on a daily basis, has become intolerable.  Fearing for their life just because of doing their jobs should not be the case.  For that reason, let's do our part to provide support through fundraising to supply Masks to the community who keeps us healthy and alive! Together we will make a difference!  @masks4medics #masks4medics", "rat_queen_": "Как тебе не стыдно на бумаге писать?! Ты о деревьях подумала? Руки тебе за такое отрубить! Думаешь природа тебе за это спасибо скажет?", "evan_watts6": "You’re 17 how the fuck do you have any concept or experience with what’s going on in the world right now?", "juliocesar_el_mejor": "Trump 2020", "funkgiver": "GRETA DO WHAT YOU CAN, DON’T GET STRESSED TOO MUCH...you want save it other just give a shit and want fuck it up it is their nature, mind, level call it like you want but you see...masses still keep on following their shit they are not actively pushing politics all over in regard of sustainability, plus they do not dedicate their life to it...so as Trump said just give a fuck and chill, rap about do poetry...that’it my baby, torturer and tortured not much more than that people around just pieces of shit fucking back, fuck them...unfortunately violence is the only...and people give fuck about to commit their life for changings so fuck em...be proud to be different...said that I eat everything human too, but in a sustainable way...like when they naturally die as SPIRITUAL form...", "fernandesdf": "Any word about china? France? No... too selective..... Can't wait till School back to normal. Maybe this time you stay there", "afk.kk": "Привет Барецкая", "gabriel.cpx22": "Clbc desgraça", "_.6ix9ne.__": "🤢", "eduardomarquescb2015": "Greta goes back to school! Lazy!.", "serrainstta": "hypocritical brat, grow up! 🇧🇷", "rogerwilliam1234": "U are the luckiest man on the earth whose wish god has heard . U must be happy to know due to the current situation the industries amd transport has been stopped due to lockdown in various countries . As a result the nature is replenishing itself during this time . Ozone layer is replenishing , air is becoming fresh and rivers , lakes and ponds has purified their water. Them also u are doing strikes. Dont put so much stress on government and god.", "amar.giri.1485": "Please stop acting", "is_aa_ct04": "Corona did more for pollution than Greta ever did", "estilistafono": "Moça você quer ganhar seguidores falando do nosso presidente 🇧🇷, pois eu não vou lhe seguir. O Brasil está muito bem amparado, o presidente está agindo rápido. Em poucos dias desenvolveu um APP para que as pessoas possam interagir com o governo, criou frente emergencial, montou hospitais de campanha e etc. Siga e verás @minsaude e @jairmessiasbolsonaro prefiro ele do que o presidente LULA do PT.", "ayushkrishnaa": "@fitz_suffices", "bug_bea": "Just fckng stupid", "min_mammas_dachri_luktar_ost": "Gå o dö horunge", "tamaraa_sep": "A China destruiu seus sonhos tbm não, ou seu sonho era só a Amazônia?", "_louxs_tt": "Na schon traurig das keine Aufmerksamkeit mehr hast, und dir keiner mehr zuhört ?😁Corona ist wohl die neue Krankheit oder ?", "smamancio": "Oportunista mimada falou muito e não faz nada! 🤮🤮🤮", "im_a_reviewer": "SHUT UP GRETA PEOPLE ARE DYING STOP THINKING ABOUT YOURSELF", "willsmashu": "So, basically, you are telling the world that you are an uneducated moron trying to get legislation passed about something you are literally too stupid to understand...", "diassis948": "👏👏👏", "isamadina14": "Тупица", "lorenafranciely": "💩💩💩💩", "apartunited": "Hey Greta! While we're apart in our homes, we can still stay united. Our goal is to have more people holding hands virtually than people infected with the virus. Because #ApartUnited, we can beat #covid_19. Join the chain by tagging us in your pic, or DM us your submission.", "mashuliyazaytseva": "Why don’t you write about covid19?", "_mr.dali_": "@gretathunberg we don't need some one like you just keep telling about the change and not working on it. There are many people in society wo are actually working for the cause and betterment. I have seen many people who are not fighting with mouth but are fighting with the work they are doing after planting trees and donating for cause. We don't need an open sewage so shut up you are getting fake and unwanted publicity you see the upper layer of society not the ground roots of it", "nathankuripaulus": "❤️", "trollaccount_16248": "Covid 19 is doing more than u", "prxxi_": "HOLAA ME AYUDAN PONIÉNDOLE ME GUSTA A LA PUBLICACIÓN QUE COMPARTÍ EN MI HISTORIA? NO CUESTA NADA PLIS, POR FAVOR!!!!!🙏🏻🙏🏻🙏🏻🙏🏻", "jh.d_": "do you actually attend school or not now lol", "idonotknowwhatoputhere": "shut the fuck up", "alexmaya108": "👏👏👏", "zebulle2020": "Bonjour, je vis dans le Nord de la France, je suis convalescente du Covid19, et nous sommes à nouveau en grosse alerte pollution particules depuis quelques jours, alors que nous entendons partout que l'air serait moins pollué grâce au confinement... Rageant. Comme chaque fois que le vent vient du nord, Nord-Est, nous subissons la nappe de particules en provenance l'Allemagne et de la Ruhr. Après leur arrêt du nucléaire, ce qui est très bien, ils ont malheureusement relancé leur production de charbon et augmenté considérablement leurs émissions polluantes. On nous répète que les particules viennent du chauffage (hier par exemple, je ne suis pas sûre que bcp de monde ait chauffé, avec 24 degrés exterieurs) ou de l'agriculture, mais personne ne voit les cartes ? Chaque fois que nous avons ces conditions climatiques et un vent de Nord-Est, nous récupérons les particules du bassin industriel allemand. Il faut en parler et faire pression au niveau européen ! Les particules, comme les virus, ne connaissent pas les frontières ! Et en cette période épidémique de Covid19, sentir nos capacités respiratoires fragilisées ou abîmées par la pollution fait encore plus réagir. Scandale sanitaire... L'air est très mauvais ces jours-ci, le smog est terriblement visiblement à l'oeil nu depuis notre appartement du 13ème étage et ça nous tue à petit feu !", "floatingyids": "nice cock bro where’d you get it?", "tyson_322_": "Cant count the corona weeks nobodys going to school anyway", "schmetterling_ro": "What do you know about Brazil ?", "giulianotiburzio": "Fica em casa ??? E quem está morrendo de fome ? Vadia do George Soros ...", "claudevandog": "I mean technically pretty much everyone’s on school strike right now", "wokeniggasaurus_": "So I heard you like black guys", "draugelisrokas": "👏", "ashleymountainstone": "Covid 19 is doing more for our planet than any one person on the planet combined.", "cinemaboreal7": "Where are you !?", "pics_by_fiat_power": "🖕", "cristianoleivas": "Faker", "jesus_juniorrr": "@jairmessiasbolsonaro ❤️ @realdonaldtrump", "helder_es": "E aí como está seus sonhos ?", "ana_tochetto": "Amor nosso presidente não está falhando não ! Os outros falharam ... e agora ele está pagando e nos todos brasileiros estamos . Infelizmente vc não sabe de nada", "vinay_bothra": "How's your school going on, Greta? All well?", "arrudacesar": "Alguma raivinha da China ou está tudo bem?", "mirai_sina": "New freestyle on my page 🐾🐾🐾❤❤", "maracarreira": "You're Just a fraud", "petecamargo": "Where are you @gretathunberg ? ????? 🌍 🌍🌍🌍", "giordanocamargo": "Where are you? China and the 🌎 needs you!!", "david.backes4": "Choose life if you haven't yet figured that out, reader, and stay safe for others as well as yourself. ❤️❤️...", "luizz533": "😵", "madlad777x": "Shut the fuck up", "dratatiana_arruda": "È aí Pirralha... não quer defender o planeta ? Cadê sua preocupação?!", "felipethiagorc": "Sumiu bebê, cansou de falar bosta?🤡😂😂😂😂", "tilda.k": "Älskar att du vill få oss att skolka för klimatet👍🏻//melissa kiyak", "florisdeboer_": "@jesse_lemstra Can you help this man, he really lost it. Plz Greta", "rashipande": "Start attending school once it reopens, kiddo.", "marcostrano983": "A deficente, ma pensa a cosa sta sconvolgendo adesso la popolazione mondiale, mongola!", "im.nica": "#protejamosayuanlee", "catha.bernardo": "Por favor!! Pare de falar da minha nação Brasileira! Você não entende e não sabe da nossa situação.", "daiane_ashidate": "Care about your life! Because you don’t know nothing about Brazil .. 😷🙄", "margo_m_93": "😂😂😂😂😂", "mh_alaca": "Bu kız tam olarak kim, ne yapıyor?", "carlosdiogo1981": "Cadê vc @gretathunberg sumiu , só se preucupava com amazônia , ?", "rodigherodiliane": "Stupid child", "adamzahorsky": "Corona doing more for environment than you 😂", "julio_augusto_neves": "Lixo vai pra cuba", "emreeee6547": "Corona was unleashed to stop Greta...", "gbc.azadooo": "👏🔥", "allendayton_": "I like how her comments are all just people clowning on her", "emirpulg": "You're so ugly 😨", "aalessb": "Niña repugnante asquerosa @riikiiig @jjjotta", "jedi_marcus": "Hey you and Bernie have something in common now! @gretathunberg #DROPOUTS #DoNothingAchievers 🇺🇸🇺🇸🇺🇸🇺🇸 #KAG", "nina_fell27": "@solveclimateby2030 Watch our webinars from last night about climate change on our youtube page to learn more!", "yuri_savostin": "Иди в школу учись, а то лесником даже на работу не возьмут", "leon_04k": "Oh Gott 🤦🏻‍♂️🤦🏻‍♂️", "andreadauria_": "Cularott ja fa na brutta mort kitemmuort", "nichtmeinememes": "Hallo Leute ich habe eine Seite voller tief schwarzem Humor erstellt ich hoffe ihr folgt mir und lacht. Ps rein aus Spaß keine Werbung!", "donfrommiami": "Gross", "lyla.mxrchantxo": "Sorry to say but schools closed a while ago 😰", "thenxstycupcake": "Can you please show that in english, im generally not use to, to that language..", "hraja97": "I’m here for the comments", "alliumsalut": "👏👏👏💟", "hate.24.7": "Standing against YOU.", "dji_mavic_pics": "Ohh for f*ck sake the whole bloody world is in lockdown and you want to strike🤦‍♂️", "alexiacorazon": "che palle", "pisetssovin": "❤️❤️❤️", "man_rai_midaham": "Imam Mahdi brings love and friendship. Jesus Christ comes with Imam Mahdi (the Son of Man). #ThePromisedSaviour Jesus Christ comes with Imam Mahdi (the Son of Man). #ThePromisedSaviour", "kneupen": "Kanker linkse kech nek toe", "_fraros": "STO SENZA NAFTA", "kernhildegard": "👍👍👍❤️", "dwightsrecipebook": "Shut up Greta", "stinkysecrets": "knulla dig", "jamesabarron": "Grrrreta Toonberg", "felipeamaya1": "Hello, I invite you to see the drags of vintage cars", "sacredfeminism": "We post about feminism♀️, LGBTQIA+ issues🏳️‍🌈 and so much more. Take a look at our page and follow us😊.", "milt_wrnd": "I thought the ozone layer was being repaired... Was there an actual crisis?", "lulolalal": "Lern klima schreiben du hur", "trevorwalkerrr": "This a dude or a bitch?", "please_paypal_me": "Simp for earth", "lumara.torres": "A China também acabou com seus sonhos, ou vc só sonhava com a riqueza da Amazônia?", "bethmorganuk": "❤️❤️❤️", "andydegryse": "They are so small you can t see them but there unity even stops multinationals , man is not above but in nature", "jeeanfeliipe": "Sumiu senhorita greta, não vejo mas você falando nada.", "pavo_sjc": "Bitte Halt mal deine verfickte Fresse", "leoniereallylovesb99": "this pandemic is helping earth more than she is ngl", "0bamabamba": "LET NEW MEME PAGES RISE UP 🤡🤡🤡🤡 ``````````````````````````````````````````````````` . . /. ))) . . . . . . . . . (((ヽ /. .ノ￣. . . ___. . .￣ Y .\\ | . (.\\, . . . ( ͡° ͜ʖ ͡°). . . ./.) . ) ヽ.ヽ..ᯢ._.|﹀|._._ノ₄₂₀ // . . .\\|. 𓀐𓂸Ｙ. . ࿕. . . / . . . .|. \\. . ᯪ. . .|. . ᯪ. . ﾉ . . . . . \\ .トー仝ーイ . . . . . . . |. ミ土彡 / . . . . . . . )\\. . .° . ./( 𓁉𓀏𓀃𓁏 i run a meme page. Follow me", "armstrong122333": "Climate change is fake", "artemprotiv": "Ты чего там уснула чтоли, Грета? Ты помнишь где свет?☀️☀️☀️☀️☀️☀️☀️☀️☀️☀️☀️☀️☀️☀️", "will_stei_87": "I would curb stop you", "john_parker1234567": "Trump 2020 stupid Autistic child", "caprice_de_riche": "🔥", "eddiehowardd8": "Please stop you fool", "italiano_neanche_medio": "Ha fatto di più il Coronavirus di te, ma ti supporto comunque!! 🌱", "guinea__pig2020": "👍", "karim_321_": "Waste of paper...poor tree", "dinhotex": "#pirralha 😂", "francesco_giraldi": "Scema", "antondevcorp": "Why don’t you shame China and shame India in other countries who are doing 10 and 20 times more pollution than the USA Research what one volcano admits into the atmosphere and it’s done it for millions of years you’re totally uninformed and you’re buying into ridiculous stupidness wake up you dumb ass", "zf_world_of_art": "❤️", "imayushsundriyal": "How dare you ! 😂...jk ...", "sahar.ezzi": "👌❤", "janjohnsonone": "Go have a hamburger, you'll feel better", "tjperla": "At this point isn’t it just skipping school for close to 2 years?", "marchimundo": "🔥", "berkinsarperkan": "The biggest problem is climate change ? Nah. A millions of children cant have chance to go scholl. But they cant have chance to talk. Lets look at the african childrens are they have of course NO. But some european childrens can talk. Cause some of you have chance. Geography is humanitys destiny. And please shut up and give chance to speak other african, surian or other poor countrys childrens.", "janaemily_": "🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢", "bello0699": "Climate? Not a word for China,han mate?", "20placebo20": "It's cool that you're staying strong even with all this hate", "jacob_sandefer2": "Go back to school", "_.ennekkoo._": "@laapalaa_ estate en casa así mira la contaminación se va a la mierda", "djamma005": "Fack you 🖕🏻🖕🏻🖕🏻", "rogerinho_london": "the climate has changed on the corona virus what do you think of China now ?? Stupid girl", "abl_st": "ferme la bouche va apprendre des leçons", "rezatayebi1": "Don't just protest like idiots and buy Benzin Cars: Use TESLA", "im_so_pohuy": "Утипути конфетка моя так бы тебя трхнул пирожочек", "luca_siebel": "@maurice_tillmann was ein scheiß", "darista662": "Беда с башкой", "percy.hyett": "what's the point in attacking a 17 yr old girl you are all the ones brainwashed even if this girl is wrong and i don't know but that's no reason to attack her personally", "therottenxx": "All you do is bitch about things and don’t actually do anything about it", "niklas__2606": "Corona Virus", "valtsu_u": "🖕🖕🖕", "environmental_cowboy": "Gooooo Greta!", "jasper.055": "Oh youre so perfect🖕🖕🖕", "alismail_745": "They're all a game that's earned by wealth.", "the_climate_activists": "Fully support you, Greta!", "j__alexx": "Greta, I’m vegan and I care about earth but right Now is a wrong moment a really one!!! People can’t even paid for food!! We’re going through a BIG crisis right now. So can you please use your power to sensitize people to stay home?? Or for this situation?? Please!! 🇮🇹", "sasharomanova_1": "Первая С*", "boogthebear1_": "The school strike is because of coronavirus not your dumb ass message you stupid slug", "nasaabolfazl": "In the critical situation of Corona, all manufacturers and capitalists must produce the necessary medical equipment", "kyle_j_blair": "Greta how come you arnt trying to stop the production of Isopropyl alcohol It’s made from Propene and that’s from the oil and gas industry We need to stop this from ruining the environment, and all the rubber/latex gloves people are using Its harmful for the environment", "youraverageretard": "I’m still waiting for the proof on how this is real", "hugo_lngs": "Suck my 6.3 V8 biturbo", "pyxey": "HOW DARE YOU!! Corona is much more important now!! Kids......", "jbsailahoy": "doughnut model to mend post-coronavirus economy", "lunaluno4ka": "Пошла нахуй", "transgenderarabsexgamer2012": "NY DADU RAN AWAY", "ahyesenslavedcomedy": "Coronavirus did more for Enviroment then you. Go kill youre Fucking self.", "popopipipoppp": "I am now sure that this is true, my friend died, he is no longer there, I will also soon die, we did not want this, we were approached by a girl who asked for money for food we laughed at her, and then Harry died of coronavirus , I am also ill, forgive us if you read this we did not want to. We wrote to you go to the panel and earn money, laughed at the children, I'm sorry, I beg you to forgive. Take your curse away, I want to live.", "inthewoods1234": "Hey Greta xx", "patrickbutler43": "climate change is fake you’re absolutely mistaken and ridden with fiction @gretathunberg", "gia.ddbiase": "Could you please discuss how 5G is bad for the environment? I have studied it for a while now, and have seen so much evidence of scientists pointing out what it can do on a global scale. How it will lead to a change in the bee pollination process and human health, etc.", "eddsonmoraes": "China vírus????😮😮", "texaco356": "I wanna say this climate change has happened through earths history the globe warms the more clouds then everything becomes ice age then goes back to normal it’s the same thing over millions of years but humans are accelerating it but still this was gonna happen wether you liked it or not", "jcmyrand": "💙💙💙💙", "fridaysforfuture_obregon": "👏👏", "sontakkeanurag007": "Stop.", "joeykelley34": "Your a waste of everyone’s time climate change is fake", "urlocaldrugdealerlol": "Did I ask", "nurgaliashim": "Как же бесишь меня сучка маленькая", "jimmyaboud": "Go back to school @elizabethbernard1", "ashton_martin0503": "You fell off", "dlp_leni": "You are a pice of shit ❤️", "jsilmar": "@gabrielgenari será q ela está bem meu amigo? Faz cinco dias que ela não posta nada! Estou preocupado é você???", "lauraist_laura": "👍", "jp_arq": "Greta, this is the moment to make a real change in the world, call to peace, for every one", "na.omismith": "you are my inspiration ! keep fighting for the world that others are choosing to destroy", "pedrovsilva": "Where are you? The virus stole your dream too?", "talkinanstuff": "Gurl go her some lip fillers", "terribleliar456": "Why don't you go out in public to do ur strike. It's your thing right?", "monica_peronico": "Talk about Covid 19? 🤥🤥🤥🤥", "albaa.autett": "❤️❤️❤️❤️❤️", "ventura_._": "#bolsonarotemrazão #bolsonaro", "kim._.drsn": "You can’t be 17years old... you are just like 10 years", "celinawani10": "Stfu ugly ass😑", "helio8282": "When you're gonna talk that dreams is over because China fuck off the World? Question made by Ligia, not mine.", "night_rod_special": "Gehe lieber zur Schule und lerne! Anstatt vorgefertigte Texte zu verlesen! Du hast keine Ahnung von der Welt und vom Leben!!!!", "gregoskia": "the face of who want confiscate all the cars in the world, don't touch my RB26, bitch", "mr.alpha.trde": "La greta denen yavsak hani hatirlarsan sen turkiyeyi sikayet etmistin insan haklari yok iklime deger yok.Lan amerikanin oyuncagi senin sikayet ettigin turkiye su anda dunyaya en cok yardim eden ulke konumunda.Kendi halkina maas bagliyo bedava maske veriyor hatta evine kadar gonderiyor.Sen şimdi git bunlari avrupali abilerine soyle onlar gelsin oç seni", "mattduplessis99": "Congrats on getting a cure for global warming called \"coronavirus\". Now everybody has to stay home, lose jobs and die but at least the world will bet better ✌🏼", "its__not__ali": "What do you do again", "mdccarminha": "Cadê você para falar sobre a China ter espalhando para o mundo a Covid-19 ???? O mundo só importa se for a falar da floresta Amazônica??? E a China??? Não vai falar nada????? Aguardando seu comunicado..............", "irmalangeveld": "Are you really 17 years old?", "1.charlie_berglind": "❤️", "no.na9424": "💙💚", "sumz.zz": "The ppl who think that climate change isn't real, really need to change ur act. If it isn't real, how do explain the massive increase in co2 in the air, the humongous rise in sea level, the temperature increase of the earth? Do you really think it's happening because of nature? Its us who are destroying the very place we call our home, planet earth. If we don't step up to do something then for sure it is going to be too late to do something later on. If you don't believe in climate change, then there is only one thing to deduce from that - you are ignorant, dumb and awfully biased against a opinion that does not exist. It is proven scientifically that it is infact very very real. Do your research and educate ur arrogant self before claiming something that isnt one bit true.", "blixtenlol": "♡´･ᴗ･`♡", "badgalizy": "Kauf kein Klopapier und wisch dich mit Blättern ab", "jaymzwilliam1981": "What are your words to the world? @gretathunberg", "danielranzatto": "Salve o Planeta agora com a sua conversinha mole", "sji6990": "👏👏👍", "helenasamjack": "Aparece agora.... Sua comunista aproveitadora", "hackjedrick": "Haha you got your global strike fuckin clown", "_pedrobenigno": "👏 criancinha mimada", "mahboobimehran": "Thanks a lot...", "kattie__1": "You should look into 5G technology. They are rolling that out all over the world. Several studies (over 500) done by over 230 scientists and doctors show the negative effects this technology has on the planet. It’s harmful to plants, animals, and humans. Something to protest about!", "andrellasso": "Go ahead", "_xfabiannx_": "Was sachse", "vndlart": "Go back to school child, or visit China and lecture them about their pollution, or grow the fuck up and start respecting the hard work and sacrifice that so many before you have had to endure so you can be such a poor example of why children should listen and not talk.", "pizzaturtle17": "I’m not trying to be rude and I don’t want to hurt you but people are dying now from the corona virus now and nobody has died from climate change. I do think we should help the environment but just standing there wanting other people to do it for you won’t do anything.", "jhonfisher1": "Ayer estuve a punto de tirar una botella de plastico al suelo y me acordé de ti. Gracias greta. Thank you greta.", "michkaluck": "did you write this on paper? p a p e r.. i think you should start going to school", "zenchapman": "You have my respect and my sympathies. Stay safe.", "mynameismissjade": "You’re fucked.", "dojokono": "F**k u b*tch", "savethemedexpeditions": "love this initiative!", "aguzmanbatista346": "Are you happy now? No more CO2 now, THE economy is paralyzed but, the skye is cleaner now.", "yehudit.golan": "There is no school you fool! It’s been shut down", "ruralagroconsult_": "Where are you? It’s quiet why? 🤮", "marcocabrera17": "GRETA SAL A LA CALLE, CONTAGIATE DEL COVIT 19 HAZ ALGO POR EL PLANETA, ELIMINA UNIDADES DEL VIRUS ABSORBIENDOLAS EN TU CUERPO", "babyboy_aka_rufus": "😂😂😂", "laurars13": "Please look at @sadie_pink.", "isagillia": "stop wasting paper, girl", "zhoorgito": "My farts got more brains 😂", "mister_revolucionario_": "#fuckgretathunberg", "gusar_romanov": "🤮🤮🤮 stupid girl...", "ebba0147": "This is a great testimony that I must share with every patient living with herpes in the world, I never believed that there could be any complete cure for HERPES or any cure for HERPES. I have seen people's comments on blog sites of how Dr. Ojabulu prepared cure brought them back to life and I never thought I would some day experience his healing powers too. I had to try it too and you can't believe that in just a few weeks I started using the medicine Dr. Ojabulu sent to stop all my pains. Right now I can tell you that for few months now, I have had no sign of hsv-2. It is a miracle and you too can get yours and be cured. Instagram page. @dr_ojabulu_herbal_home Contact him onWhatsApp him. + 2348108267221 dr.ojabuluohue@gmail.com Obesity Stomach ulcers Herpes HIV Cancer Lupus Diabetes Etc", "forest_swashbuckler": "Stop what? Saveing the earth?", "franbueza._": "@nikkao_ CALA A BOCA PIRRALHA 😎👍👍🇧🇷", "liviatlm": "But there are no schools open...🤯", "kristian_nordnes": "#volvo #d24 #mobildeksel @jonaswang5", "ww2_sellers_nl_": "The climate change is just normal", "lele_ferreira84": "Uê , cadê você @gretathunberg ??? Bora cobrar a China pelo desastre que esse vírus causou no mundo !!!!!", "marcospauloschultz": "And coronavírus? Why not your fakes?", "charliealerian": "This is a great testimony that i must share to all patient living with herpes in the world, i never believed that there could be any complete cure for HERPES or any cure for HERPES. I have seen people’s comments on blog sites of how Dr.Ojabulu prepared cure brought them back to life again and i never thought i would some day experience his healing powers too. i had to try it too and you can't believe that in just few weeks i started using the medicine dr.Ojabulu sent to me all my pains stopped. Right now i can tell you that for few months now, i have had no sign of hsv-2. It is a miracle and you too can get yours and be cured. Instagram page. @dr_ojabulu_herbal_home Contact him onWhatsApp him. + 2348108267221 dr.ojabuluohue@gmail.com Obesity Stomach ulcers Herpes HIV Cancer Lupus diabetes Etc", "luffsleep": "💪🏻", "_10.karat_": "Да всем уже насрать на этот мир , он и так в дерьме и ему не выбраться отсюда", "frontenhausen_beichtstuhl_": "🤮🤮🤮", "aeroflot001": "No i dont do this", "highlife_213e": "Schools are shut. What kids gonna do strike from home 🤦‍♂️🤦‍♂️🤦‍♂️", "andradegomezximena": "👍❤️", "nicolay_holban": "go bad on the internet !!!! radio waves !!!!🤣🤣🤣🤣🤣🤣🤣🤣🤣", "kuleshov986": "Такое у тебя ебало мерзкое", "majinbuuwantspuddin": "I get climate change is extremely bad, but HEEYYYY! Coronavirus, bad very bad no one cares about school right now.", "lenonn_silvaa": "Ativista que tem medo de comunista😂👏", "rasmus_josefsson": "🖕🏻🖕🏻", "zaara___2008": "❤️", "l3on.lr": "Cringe", "aidantroucan": "Din mamma hund", "leonhard2772": "How dare you", "pozharnik_3": "Coci bibu", "_deeiiviss_": "Fuck up", "aalisasaa": "Учи уроки дебил", "rev_j_warosa": "That sign is made out of paper!!! And where do you think your clothes came from? 🤔", "buckskinblacksmith1": "How will going on strike from school save the planet? You're a crazy girl who doesn't know what nature is or how to protect it", "archiboltonofficial": "oh shut up you cunt we already have corona here", "_studio_.27": "У меня на странице , то что ты любишь)) подписывайся , каждый день новые публикации!!!🔥🔥🔥", "iamatexan": "Go back to school and read a book or two. Skipping school is only hurting you.", "joelpedroo12": "Ela falou alguma coisa do Corona Vírus? Pediu explicação da China?", "espacolopes": "where are you Greta?", "rafaelmello0": "where are you now to criticize the corona? Hipocritazinha de merda", "scottmckinlay_": "You can’t even spell stop trying to save the world and maybe go to school dumbass", "criminal.aq": "#abkarmy", "citizen_wrong_think": "Greta you’re not relevant, you’ve never been relevant. You’re a clown 🤡", "flabiu7": "☻You is crazy 🤑🤪👽", "ryland_6.9": "Libtard", "xrtj.priv": "Girl no one cares anymore go self isolate or smth", "shekhar_panse": "Could you, with all due honesty, stop this & attend SCHOOL? Do not, for the love of god, consider yourself even tiniest of bits close to the personality that @malala ma'am is.", "memesargeant": "I can't wait until the left is done having you pretend.", "renataarchilha": "Hello querida! Quando você vai cobrar da China responsabilidade do Corona Vírus, como você cobrou do Brasil as queimadas da Amazônia?# Brasil 🇧🇷", "_cynicole": "Im just hoping that Covid19 kills a large number of the idiots that think climate change isnt real or doesnt matter just because this outbreak is happening. :/", "omarovakarina_": "Greta, paper is made of wood", "jpbabin42": "what's it like when a virus is doing more to the environment than you are", "jalbuquerque.pics": "Hey you! Where have you been? We are all waiting for you to speak out loud about China ruining the world children’s dreams so as yours. Or, your dreams were only about Amazon?! Prudish prick!", "epicspedygamer": "Ok zoomer", "o_reis19": "Overrated", "tapirfanclub": "Follow if you love tapirs 😌", "lexy.eklund": "Schools not even active due to this virus 🤣", "pollies_lie": "Hey dumbarse, no one gives a shit about climate change right now. You look like a 🤡", "fridaysforfuture_guum_brazil.s": "Bravo Greta. Responsibility. Clarity. Truth. Urgency. Sharing. Humanity. Go Greta. Go. Thank you very much.", "allinycastrodeandrade": "E aiii cadê a mocinha entendida?!?! Não falou nada sobre o Coronavírus???", "danielcarvalhorito": "What's your opinion about china vírus 🤔speak please", "oficial_jonatassilva": "Bolsonaro 🇧🇷😎", "tiago.augusto13": "Fantoche!", "theslasherbr": "@gretathunberg is happy WITH virus. No school, no polution, no People. Greta is FAKE,", "_lil_jem_": "Пришел написать что-то на РУССКОМ.", "baggchasin.angel": "BRUH CORONA VIRUS DOIN MORE FOR THE ENVIRONMENT THAN GRETA CHANGE MAH MIND", "figueiredo.adrian": "E O CORONA ?", "felipe.pedrosa.personaltrainer": "💩", "erikaviss": "Cadê você sumida, vírus não está te deixando sair ???? Não vai ajudar ????", "nunesdezaosp": "Hello Greta, what happened? did you disappear now? Will it not hold China accountable for spreading the virus? To talk about the Amazon without knowing it, you're good, aren't you?", "iii.xo__": "Ja nein", "baya.zid.salami": "Hello Fealo Ken Hammarim", "s_e_p_u_s_s_y": "Sorry i dont speak perkin", "maelyrose": "WHY ARE YOU GUYS HATING ON HER?? SHE'S NOT EVEN AN ADULT YET YOU PSYCHOS", "michellvalentin.91": "#Bolsonaro2022 Greta vsf", "jane_reoch": "✅", "scuderiaferrari__f1": "We are supporting u and we believe in you and more importantly we believe the climate crisis need be seriously considered and be solved keep it going 💙 stay strong and never ever give up 💜💜💜", "marcus.teixeira10": "Como Bolsonaro mesmo disse: Uma Pirralha que nem trocou as fraldas ainda.", "_brandonr_": "Dumbass", "k_yletm": "Funny", "shwetha.kumari123": "Maybe if you went to school not schol you would actually spell Climate not klimate korrectly🤪", "adbullah23": "Covid 19 stonks", "mose_cm": "Chiediamo #eurobond #eurobond#eurobond", "italysilver____925": "Hey have you guys seen the polution charts over in China it's crazy how big of a drop it took", "albie.83": "Greta what do you actually have to say about the current health climate??????", "dwillian17": "Vai reclamar que a China destruiu o sonho do mundo não??? Ou só serve para os países de direita?", "adela_tarantikova": "🤮🤮", "eanders936": "All eat vegan clean heart use electric transports", "summer_varner24": "Saving sooooo many people 🙄 go back to school", "dodgelover7264": "Fuck off for 1 month and let me smell the petrol without you fucking protesting about things someone made to get us to modern day you brat. 🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗🚗", "livio.augello": "Ma li mortacci tua", "henri.youtube": "It's funnny that it was only in Sweden a schoolstrike because almost everywhere else the schools had been closed because of the spread of Covid-19", "harvey_tokessss": "👀", "valdirr_r": "#víruschinês", "coopchoice": "Corona is the virus, hostile capitalism is the crisis. Let's built a fair, sustainable and cooperative market. @coopchoice is real! Follow us to learn more about this growing movement 👩🏽‍⚕️👩🏼‍🌾🧑🏻‍🏫👷🏽🧑🏻‍🏭", "kings_d_": "@greta, First go get yourself educated then talk about climate, world have enough problems and you are another one , you got no other business then slapping world government with fines?", "dododobsl": "🤦‍♀️🤦‍♀️🤦‍♀️🤦‍♀️🤦‍♀️🤦‍♀️🤦‍♀️", "lucca_0809": "Excusa Mua", "tracykoa": "I’m organizing a National “BlackOut” day Friday 11:59 pm - Saturday 11:59 pm. A day without, phones, tv, shopping and the internet. Lets show trump what America looks like with 100,000 less people playing his game! No Amazon shopping, Facebook traffic or Netflix browsing. I’m sick of seeing these assholes making millions as we’re home surfing FB, IG, shopping on Amazon and watching TV. We need the government to continue the cash subsidy on a monthly basis, cover all cell phone and internet fee’s as well as all utilities and my lord...open medicare for all! But, I’ll need a little help organizing 100,000 folks;) I’d like to organize a National “BlackOut” day Friday 11:59 pm - Saturday 11:59 pm. A day without, phones, tv, shopping and the internet. Lets show trump what America looks like with 100,000 less people playing his game! No Amazon shopping, Facebook traffic or Netflix browsing. I’m sick of seeing these assholes making millions as we’re home surfing FB, IG, shopping on Amazon and watching TV. We need the government to continue the cash subsidy on a monthly basis, cover all cell phone and internet fee’s as well as all utilities and my lord...open medicare for all! But, I’ll need a little help organizing 100,000 folks;) #nationalblackout #nationalblackoutday #consumenothing #togetherwerestronher #unitedwestand #wethepeople 💓", "spicy_salad22": "Wow you are a big dumb fuck", "silence_the_mute": "Nobody gives a FUCK what this little clown has to say 😂😂. Your minute of fame is done!😂 Worldwide, NONE OF US ARE IN SCHOOL. Just stop, nobody cares.", "leoborba__": "Vai dormir", "silvan_28": "Make live", "boogshlizetti.naenae": "Can you please tell me what you have done other than complain? Seriously, you've done fuck all. Try planting a tree rather than killing one just to write something down that could have just been the caption for the post.", "alex209alexandro": "you gone? Did you give up on the Planet or was you only interested in the Amazon? @gretathunberg", "fingerbunny_": "Do you read comments?", "jiri.z": "Lol. 17yo? Really?", "queenmary_15": "@ro_beth_ ebbeeeeeee greta zumberg,no fabeddi piu??", "bhargav_da_god": "can’t even spell climate right", "victormartinsprofessor": "Where are you on this Coronavirus? Why don't you make a huge and emotional speech against China ? You're a joke", "armins_voyage_impressions": "Bruh", "sazone_crusade": "If you don't believe in climate change you're irrelevant!!!!!!", "rubenlaz_._": "Hmmmmmm that stake taste very very good", "e_facil": "Por onde vc anda me in a lacradora ???😁 Perdeu as forças????", "coglitorecarlalorena": "🍫", "guitarraz_tony": "😀😀😀😀", "michelmaxmarcos": "Cade você peste o mundo ta precisando de você leva com você o corona vírus 😂😂", "kittues": "❤️", "riclema593": "Oye Greta ¿como se siente que el coronavirus haya hecho más por el planeta y el cambio climático que tu y todo ese pseudo activismo? 😆😅😂", "jacob_nymannn": "🙌🙌🦶", "those_nilla_wafers__": "You look like a kid from skyrim Btw", "selimulgac": "lan hikayeye yazsana agac kesiliyo", "ali_mahdavian19": "یه زر زدی ده میلیون فالور گرفتی", "ironss4": "SQUIRT", "fuchs3872": "suck me!", "bennyjetson93": "Greta the tard", "gabriella_donut": "You go Greta !", "andrezimleal": "brat from the head of Ceará", "jewflexer": "You should start an Instagram live and hang yourself", "alexander.drachmann": "#denmark", "joaopaulodlins": "🥱🥱", "yagudin_marat": "Дура блин, все заводы уже давно закрыты, экономики стран рушатся. А ты до сих митинги хуяришь 🤦🏻‍♂️", "marcel.dsl": "Climate change is Not real, Change my mind", "makoueinesar": "Coronavirus is your job and your ideas", "rmferraz1": "Ué ela não falou nada da China, estranho.", "viniith1304": "The ones fighting covid-19 are the educated people who went to school or attended online classes(in this case) not people who hold cards just so they can skip school if it was an emergency ( climate change) people who are educated in this field should be portrayed by the media not a girl from a rich country who wants to skip school", "econnolly20": "Go home greta we have way more important things to worry about than your bullshit", "k0n5tan1n_c4375": "Fuck you, stupid suck.", "a.v.e.q.s": "Ебать ты тупая, массонская мразь", "alman_mit_wellensteynjacke": "Nobody gives a fuck about climate. Your should try to not be effected by covid19", "erik_koller_83": "STUPID STUPID STUPID @gretathunberg", "victorgouveiape": "trash.", "derzhavnyy": "I'm sure everything will be fine :)", "jbperformance_rs_125": "Geh mal lieber in die Schule die versäumten Stunden nachholen", "volvo_affe": "How dear you", "yilmaz_ademogullari": "Go school prostitute", "cristinamariakondor": "🤦🏼‍♀️i hope All “climat saver”are Now happy,people die,nice move🤢", "xema.greenfieldx": "Bro Harry styles follows you defo not jealous @harrystyles", "raphi.tusch_06": "Da @gabsimaster dät gern amol In dei uarschlechli eie ziachn", "manbypart2": "ok cuck", "kevin_2.5wrx": "The virus is doing more than you", "ove712": "97% of the scientist say that Climate change exist! Why does anybody think he knows more about Climate than the scientists?", "joanna_matula": "Why you follow her?", "lng.leo": "🤮🤢🤮🤢🤮🤢🤮🤢🤮🤢🤮🤢", "okseflasim": "ehile @boyanslat is cleaning the ocean, yoi just stay at home babbling about useless online protest while offering no solution. that future that was stolem from you?! it were your parents.", "camelolm": "Greta loves china 😂😂👍👍👍", "nadjalucelia": "Honey, did you only dream about the Amazon? And with the Chinese COVID-19, nothing? No dreams?", "thegenesisculture": "@gretathunberg China?? Coronavirus?? Vírus chinês?? 🤷‍♂️🤷‍♂️ Lost???", "arkaaaadius": "Shut the f.. k up", "nithinarun": "Dude the corona virus did more good to the environment than you did.", "asbc_174": "🌺🌺🌺", "lenahege": "If all we people supporting climate strike, can dream of the better world for nature, animals and people, we will be there very soon 🙌❤️💕", "mikeyh06_": "Corona did more for the environment that greta thunberg change mu mond", "alfieseal22": "Look at that face🤡", "xanda_foolheea": "Ngl you want people to fix the earth but taking them outside of school meaning there not getting a education means that people won’t be smart enough to fix the earth like lol", "zefaret": "What are you doing to save the world from covid-19?", "jc.a7": "Coronavirus done more things about climate change than yow", "geslachtloos": "looks both 14 and 46 at the same time", "thais.sanches.17": "😂😂😂😂😂", "itzhowl": "Your actions have consequences", "romulus_ribeiro": "nós salvar dessa pandemia", "henrico_joubert": "Damn she is a lazy fuck. She must go to school and learn respect for older people. She also has to learn how to not yell at @realdonaldtrump when chy-na is responsible for the most pollution", "beata_sandsborg": "Det du gör och har gjort är fantastiskt! Fortsätt så💪💪🌍", "yusufkhan_4645": "https://www.instagram.com/p/B-hIlD4AQbb/?igshid=143kxdesnw29r", "united.humans.organization": "🌿🌿🌿🌿🕊️ Let's lock-down the polluting factories...it'll save Earth & our lives (pollution is a bigger killer than any disease: you can check data on Google etc.)🙏🏻Stop Pollution, Stop Climate Change 🌎🌍🌏✌🏻 Please forward this and appeal to the governments around the world. @united_humans ---United Humans Organization🌿", "a_lynch19": "Shut up", "franciii2777777": "#Fridaysforfuture", "cobblestone.chink": "hOw DaRe YoU headass", "_.cooody._": "covid-19 did more healing than you did 🤡", "robertmontegro": "Haha, nice dick👍", "alexandertortilla": "shes probaly the one who made this pandemic", "all.chaos": "Тебя кстати Батя потерял @stas_bareckiy", "pl4551312": "You stoopid🤮", "tomxcourt": "Rumour has it Greta started Covid-19 to reduce human activity", "gene.kendrick77": "I don't support what @gretathunberg says but y'all need to chill out and stop the hateful comments she's just a child for God's sake", "lorenzo.santamarina": "go suck a dick u swedesh cunt", "delehsy": "Corona virus is doing more for the climate then you", "daniemma16": "did y’all know this biddie is autistic", "meditationmumma": "Great- thoughts on 5g???", "bukleuh": "Don’t eat cats and bats, please!", "mahika_l": "All those typing typing Coronavirus is making a bigger challenge than greetathymberg are wrong Coronavirus is giving more of a negative impact than positive greeta thumberg she is trying to make a change for our generation so instead of typing those comments I am being so jobless why don’t you all encourage her she left her school for changeThe climate for our generation so pls stop those negative comments And by the way if Coronavirus is making a big get change than greetathumberg what are u all doing except typing bitchy comments", "n_e_u_r_o_i_l_l_o_g_i_c_a_l": "can you please shut the fuck up? you want to shut down the worlds economy to cool down the world by 4 fucking degrees.", "lindqvist994": "🌺🌺🌺", "authenticdude": "U look gay", "eviljopka": "Хуйня", "fenin_vitaliy_jr": "Пошла наху1", "ducxnh_871_": "kannst mir ein blaaasen", "gavinxferreira": "Corona virus did more for the environment than u did", "jake_osikai_": "Nigg you look 11", "joshkkobe": "What is posting a picture with a bum ass sign gonna do to help the climate", "jetsonberger": "I have a sinking feeling this virus came from melting the glaciers.🤔no scientific proof, but what if?", "anthonyayar": "shut up😤😷", "sativsskygreen": "😍❤️🔥", "evolvedtrashcan": "What the hell do you mean \"Suddenly you remember people are dying\" We didnt fucking remember, a whole new fucking Virus manifested! We wont get a cure for over a year, we didn't suddenly remember, this shit suddenly happened!", "c.otx": "Climate change was a myth made up to give Donald trump clout", "kia_liljegren": "We love u but ppl are sad and afraid of corona and they concentrate to corona not climate and corona change climate more than all climate activities", "hkgrace_14": "❤️👍", "gipnodogs": "Ебнутая!", "whithudriah": "I can’t believe that you still didn’t say a thing about Covid-19! All you care about is climate change, even when a virus is harming and murdering millions of people on the earth! I really don’t know what to say about this now...", "arguing_w_liberals": "Imagine having 10.2 million followers and getting 400k likes", "thehardcorehindu": "How r u still allowed to lie", "king.alvie": "Remember coronavirus did more good for the environment than this 17 yr old who hasn’t hit puberty", "crusty_mongrel": "Yeah I don’t think taking to the streets is the best idea rn you fucking moron", "lv_elyukin": "Error 404", "do_xcvi": "Ha tetek tkde", "alex.zuckberg": "Bro chill man, Covid-19 is doing its job and this virus did more than you would ever do about global warming so chill please", "roman.khod": "@gretathunberg you’re ugly 😉", "nothingxceptplants": "Hey Greta, the N95 masks that are protecting our healthcare workers are made from polypropylene (oil and gas by-product) similar to your favourite sweater that you wear all the time. What do you suggest that we use to replace the N95s?", "1eonperkins": "gang money", "_mo_102": "The whole fucking population dying form Covid-19 and her ass is talking a bout going to the streets like she hasn’t seen the news that the whole world is basically in quarantine 🤦‍♂️", "abraham_lincoln_69": "Watch the Lincoln movie, it’s good", "maikywings": "Autist", "josh_aguilera22": "fuck you", "moonrockjohnson": "You're so useless. Even if climate change wasn't a cycle and the fact that money can't stop it, the coronavirus has done more than you, you self centered arrogant child.", "lindenpgh": "u WOULD have Aspergers 💀😒", "edgy.wagons": "The corona virus is doing more for the environment than you are🤡🤡🤡🤡", "aoaadavlis8": "@gretathunberg China is stealing your dreams and too of a million of people in the world because of Chinese virus. Because of China, aidetics Africans people are dying more. Why your are in silent about it? Came on, Greta!", "edersongarci": "Greta, you are patetic! 😂", "yungcarkan": "Shut the fuck up nigger.", "ihatepeopleofcolour": "Hey I heard you had ass burgers", "ehleeuh": "Why are you encouraging people to make signs out of paper and other materials they’re gonna throw away when they could make these digitally.... seems counterproductive to me!!", "jacob_7920": "LUL", "daniel_gard80": "Aren’t you retarded", "internet_clown": "What if it's not climate change and the earth is just going through a change that is harmless", "damien_yracheta": "Coronavirus helped the world more than you", "sevs19": "Corona virus did more for the environment than you", "moreira.alemao": "Diz isso para China", "kurocream8": "when the corona virus does more for the economy than her.", "natron4": "You spelled climate wrong, ya dummy", "light.co2": "Go Greta! 🙌 It’s youth like you who are shaping our futures. Don’t let anyone tell you otherwise.", "zoeyjovan": "❤️", "fuckbr1an": "coronavirus is doing more than you could in your life 🖕😐🖕", "_brackin_": "🤡", "earl.sweatpants__": "COVID-19 has actually helped the environment more than @gretathunberg 🖕😐🖕", "tall22man": "Coronavirus has done more for the climate than you have 🤡", "jccatch12": "Didn’t know you could participate in a school strike when all schools are closed 🤷🏼‍♂️", "rslash_mason": "you haven’t done anything you just watched people do things from the sideline. you’re not helping", "alex8213897": "Corona did more to help the environment than u 🤷🏽‍♀️🤷🏽‍♀️🤷🏽‍♀️", "meloleonnardo": "Sorry... But I can't understand why to be angry with someone who is \"trying\" with your own ways to make some difference in a chaotic world. I'd like to congratulate all of my our efforts miss Greta. All best for you.", "latinovicc.m": "You know COVID-19 has done more for the environment than you, right?", "wxyonnn": "She has Ass Burgers", "camilacamilaans": "Estupida ! 🖕🖕", "garlic_bread4u": "The corona Virus is helping with overpopulation and world hunger less people means more food. Like Dwight said “we need a new plague", "kh.sof": "🖕🖕", "visnic.billy": "🤡", "wiglesworth__": "U suck", "kamki69": "🤮🤮🤮", "edgevivor": "this bitch getting dumber and dumber the more she out of school 😭", "dinofucknflip": "Shawty fine asf 😭", "denisramilevich": "Ну ебало", "hreed9742": "Corona has done greater things for the environment than Greta has done", "nadir.tomas": "Aguante bocaaaa", "thomas.eikeland": "She still relevant?", "cj10699944": "She said \"outside\" shes telling us to break the laws yall and expose ourselves to corona", "julianobesell": "PIRRALHA!", "booquifious6343": "Coronavirus did more for the environment than Greta", "richie.m.22": "She triggered", "austin_mee17": "🖕😐🖕", "asian_mctasion": "The coronavirus did more for the planet than you", "yourpublic.confusedkid": "You look like peppa pig", "ba_obaoba": "write in english PIRRALHA!", "squiddy875": "Go back to school kid...maybe you'll learn something.", "vedadcano": "Piss off kiddo corona is doing it job its changing klimatet so yeah people are inside nature is finally breathing we dont need you to remind us. Ask you parents what is your next big step", "orlandolees_": "Shut up", "pierre_nves": "Esperando você cobrar o mundo sobre o vírus da China. Não foi boa para o cobrar o Brasil sobre a Amazônia?!!!!!!!🤔", "koskirik": "The climate has already improved!C'mon,planes don't fly anymore,factories are closed,much less pollution - you made it @gretathunberg ,you won!... Now just stay at home and study everything what you have missed in the school", "pieter1234x": "❤️❤️❤️❤️", "adam_an__": "Shut up", "_mauriciogatto_": "Kd tu fia??? Vai reclamar o que agora??? Pq nao vai pra China reclamar que comeram morcegos???", "russkiyobeirne": "Oh just fuck off", "fabiowaldrigues": "COVID-19", "cartierrche": "nigga got ass burgers", "tedrostheracist": "I am a human. And i call this virus the CCP virus.", "iluvdrvgs": "Just to think she got famous from a meme", "ian_____2534": "Shut up faggot", "gu_tss": "The coronavirus do more things than you for the Earth.", "ethanh.0": "corona virus is doing more for the environment than you", "daniele.simeon": "Due to the covid 19 outbreak ,Good work deserves good recommendation @Jackson__simeon is indeed helper and God sent to me. I have earned $15,000 in just 7 days time with just an investment of $1,500. Thanks to @Jackson__simeon for a great work", "jamiehanlon05": "No one cares", "marybarbu1980": "The EU says that it needs 1 trillion euros for the renewables project. This means 17 euros/month/european individual for 10 years. is it that much to save ourselves and these children? I am 50 and I am for it.", "amorimeva": "Stop please... she is ridiculous..😱. Voce é uma garota perdida “lost”", "emreadman": "@jasmingrvs", "sakypaky_gacha_edits": "People are dying because of the covid-19 and you just care about the climate!!!", "dylanbebbspamm": "Does she not know that schools are closed?", "castore_polluce": "Vaffanculo", "devin.malafis": "Spelling 💯", "malinkjellsdotter": "Hej Greta, tänkte på dig och allt som du kämpar för när jag hittade den här. Jag vet inte vem som skrev detta, men det är vackert.. ♥️ Vi somnade i en värld, och vaknade i en annan.  Plötsligt har Disney slut på magi, Paris är inte längre romantiskt, New York ställer sig inte upp längre,Kinesiska muren är inte längre en fästning och Mecka är tomt.  Kramar & pussar blir plötsligt vapen och att inte besöka föräldrar & vänner blir en handling av kärlek.  Plötsligt inser man att makt, skönhet & pengar är värdelösa och inte kan ge dig syret man kämpar för.  Världen fortsätter sitt liv och den är vacker, det som sker sätter bara människor i burar. Jag tror att det skickar ett meddelande till oss: \" Du är inte nödvändig” ”Luften, jorden, vatten och himlen utan dig mår bra. När ni kommer tillbaka Kom ihåg att ni är mina gäster. Inte mina mästare.\" ❤️🦋🐳🐿🌷🍀🌴🌍🌟🌜☀️🔥⛈", "_pepoadalid": "venga cállate y recoge basura que mucho hablas", "v_ivan_p": "How about I cough on your face @gretathunberg u little child", "evan_kirsten": "Baby libs crying over the planet", "paolasmoking": "Pls Greta! why don t you say anything about china which is destroying the whole world, polluting the planet, spreading Covid everywhere, torturing animals, eating wild animals, in other words killing the planet???", "coontown87486": "Just 1 more year and my greta will be 18. I just wanna sniff her butt but I can’t", "lokokoko1108": "Its corona time", "hohlbrot68": "you are still a child who was told to do that. now you can say that your last year of childhood was stolen because of the government and what's to come Covid-19.", "david.zanoni.1": "Nada sobre a CHINA? EM SUA IMBECIL", "adam_jaz": "Dumbass kid", "daviddubere": "Sa te vad amu cum mai ieși la proteste", "le_bimbe_venete_di_zaia": "U lose Greta ? 🧐😏", "d3f1.br1ll4t0r3": "6 Contenta stupita cogliona ora che hai fermato il mondo con il 👑🦠 che hai mandato tu sulla terra?"}