{"lilaaahh_": "hope you get better queen 💕 we all love you and wish you the best🥰 you will get through this tough time!!! we will always support you no matter what! you are such an inspiration to me and my others ✨🤩 you are so brave. keep your head up so your crown doesn’t fall🥺🥺🥺 praying for you and your family 🙏 wish you the best and i know you will get very far in life with everything that you have done for others. hope you have a quick recovery and never forget we love you!!! just because coronavirus doesn’t mean we aren’t here for you. true fans like me will support you no matter what. the fake will divide 💯!!! during these tough times you will realize who is actually there for you‼️💕", "nauany.duarte10": "G #f4f #followme #sdv", "fstoddart56": "Hot 🔥🔥", "dhanrajgour7": "❤️", "ostseenixe_": "@ostseeglueck", "afghanis2": "👏👏👏", "zxmirrr": "If she's 17 idk anymore", "pordank69": "Jó kép lett", "noelpl4yz": "Siehst aus wie 12", "fjuliano55": "Yez you're a hero👏", "rebeca_bltzar": "Que cara de loca", "laraajill": "@89leo51", "lukinha_yo": "boa noite princesa ;>", "pame12lk123": "Votre mari ou votre petit ami vous a quitté pour une autre femme? contact: Dr Emwanta est certainement le meilleur lanceur de sorts et son résultat est garanti à 100%. Je m'appelle Pamela, j'ai 42 ans, j'habite à Orlando, en Floride, mon mari m'a quitté pour une autre femme il y a 3 mois et depuis lors, ma vie a été remplie de douleurs, de chagrin et de cœur brisé parce qu'il était mon premier amour. avec qui j'ai passé toute ma vie. Un de mes amis m'a dit qu'il avait vu des témoignages d'un lanceur de sorts appelé Dr Emwanta qu'il pouvait ramener son amant dans les 24 heures, j'ai ri et dit que je ne suis pas intéressé mais à cause de l'amour que mon ami avait pour moi, elle a consulté le grand Dr Emwanta en mon nom et à ma plus grande surprise après 24 heures plus tard, mon mari m'a appelé pour la première fois après trois mois qu'il me manque et qu'il est tellement désolé pour tout ce qu'il m'a fait traverser. pour moi et maintenant nous sommes heureux ensemble. Je ne peux toujours pas y croire, car c'est très incroyable. Merci Dr Emwanta d'avoir ramené mon amant et aussi à ma charmante amie qui a intercédé en mon nom, je recommande vraiment vivement le Dr Emwanta. Pour toute personne qui a des problèmes en ce moment, voici son contact, envoyez-lui un e-mail à: (dremwanta@gmail.com) ou appelez le +2348160830324 / whatssapp, bonne chance toujours à vous tous sourire émotion", "kutsukusy": "ты так надоела, все равно сдохним", "dksd7734": "Poor feral child, used as a media pawn.", "ivarlotbrok90": "Sparati schifosa te e il tuo clima ebrea", "linxalio": "She looks like 12 not 17", "dijana.krnjic": "you are so ugly", "guerro_kolm7300": "17 YEAR OLD WHOREEE", "evelita27": "😍😍😍😍 duktig snäll, man kan bara älska dig!!", "connor___hussey": "Your 17 🤣🤣🤣", "idailyplay": "Lie Lie Lie Lie", "narhurley": "@richard_7o4 you like this shit?", "katy.rayan": "تپلو", "gretchen.vogel22": "💜🙏🏼😊👏", "rudolfsuter": "Thank ypu and your Dad for informing us, please continue Both to be Rebellious, Strong, safe and Healthy.", "idriss.marocain": "Poah chaya oder was sagst du @hatim.tgh?", "fraaa.av": "@villena998", "_hannah_1400": "be looking lyke @trippieredd", "http.lxmon": "How cute a 11 year old that cares alot about the environment", "itsfresh04": "Okay???", "nash.schrimsher": "Fetal Alcohol Syndrome", "ppls_cll_me_psycho": "No one cares", "mafiaboss_dongo": "Ok nigga💩💩💩💩💩", "albertto.mdzz": "aféitate", "chiaraporcu__": "Tutta plastica", "king.arthurm": "Get well Greta❤️", "_.valuuuu._._": "Beatifulll💕🙌", "vita.klwrs": "👍", "nilsxpyssling": "Jag ska hosta på dig", "giorgio___stradi": "handicapped girl", "nivankansakar": "@rivanbro oh oh, he won't let you go oh", "2_exiris": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎", "its.martiiiii__": "Truccati dhn", "alexandr_gontarenko": "Дура", "tommie_b._": "😍", "proud.commie": "❤️", "ellatecambio": "Mas falsa q nunca", "ossi123456ossi": "@luke__307  No I dont want attention around me as a person, that is also the reason why Im not using my real name and don´t have a photo. Greta Thunberg are paid by globalist like George Soros and similar persons and organisations. They rise attention around the climate issue in order to be able to rise taxes for ordinary people. Just remember that Sweden paid 8 billion SEK to the United Nation to the climate \"Climate\". Gretas campaigns goal is to justify such payments. Those payments come from the Swedish taxpayer and they will benefit the rich globalist.", "farca_hc_": "💩🐀💩🐀💩🐀💩🐀💩🐀💩🐀", "taylanozgur1477": "Such ugly looking", "bahram.1372.m": "💩💩💩💩💩💩💩", "schwarzderrentner": "You are cringe", "joostvanbennekom": "Remarkablely we now finally are realizing the Paris goal on protecting the planet! It does not mean I am happy people died, but I do stress climat change is a far more bigger danger to life. Until now in the Netherlands due to corona 4.475 people passed away, in 2018 due to influenza 9444. Since the impact of climat changes is far more bigger, I do hope all gouvernements see the opportunity we now have to reset society and safe our future!", "ollllollllllo": "Чудо - юдо", "jonathanngwende": "Hie", "katyyyyy_oy": "Боже какая страшная", "cowboy5871": "👎👎👎👎👎", "gavin_cote2002": "ugly ass", "reuben.d.smith": "Fat", "shrub3": "Bruh", "kys_ok_tgb": "Фу блять", "chbo2019q": "Scheucht euch @gretathunberg", "enrxo_trn": "@mathis_dirks6 deine traum kahba", "og.stusik": "Only a dumbass can say \"I see carbon dioxide.\"", "emmasstrid": "@andreasthunberg", "max__493": "Zu hübschhhhh", "anthxwiththedraco": "you’re fucking ugly", "hiwaei22": "Today amazing greta", "severin_trial": "Fuck you greta", "mr.mellowmatix": "Страх", "iamarmymen": "Take care of yourself kid", "shubhnautiyal": "Great story writing.", "melvindr88": "Mongool", "varishannu": "Din pappa hjälpte dig att skriva upp om det här", "viktor_perrie": "фу пиздец ты стремная", "therealdickheadtrump": "Don’t listen to the old men bullying you! They are all dumb Trump supporters from Texas and need to get a life and some brain cells. That’s why they live wear they live maybe if they had bigger brains they would get better jobs. Your a gift from God Greta!❤️ God wants us all to have stewardship and care for the environment!", "ethangermainn": "Fat", "brendan_james_sears": "Your super ugly", "fabym3": "Pirralha não serve para nada. Não vai falar do Vírus Chinês? Maldita🖕🖕🖕", "ozmosis2323": "Twat", "yowza_dude": "cmon give us a little \"how dare you!!\" it's what the people want!", "g_thaumaturgus": "Imagine. You might have had a bit of a flu and (gosh) you might have actually went about your life like normal. Maybe, just maybe, you might have passed on the virus (that you probably did not have) and someone over 80 years old with 2-3 co-morbitities might have died as a result of the 4-5 factors leading to death. Yeah, I would have wrote a big post about it too since I too am a narcissist.", "ekcurrie05": "Please just go back inside where it’s safe", "sammie1eye": "Really don't care about you and your so-called climate change BS. We have far more important issues to worry about. Spare us.", "miksula8": "Shut ur dirty gob u globalist mouthpiece", "sligarcory": "https://youtu.be/-lrmOgPihUE", "marilyn_tonelli": "Who cares about your personal story! You’re alone nothing.", "martin_sxh_": "Yarak", "_summerwalsh": "hansome", "mcp114002": "Que DEUS Esteja Com você ...", "maiakincaid": "Wise words from the heart!", "rossm_27": "Gross", "pyro_name": "🖕", "travmitchy": "No body cares u useless puppet on a stting", "tyson_322_": "I think I know why you dropped out of school the doctor did such a shitting job pinning you ears you cant hear shit probably why your such a retard", "plnfort": "😂😂😂", "khalidnasurov": "Hello Грет, мух ю хьо. Са доттаг1 ву хьа номер езш. Циг Брюселехь серьезно дуьйцш хьай х1умма дацахь, @shoipov_ связе яла цуьнц.", "lebrown_bernard24": "🤣🤣🤣🤣🤣🤣 porra bem feia tipo rabo", "magdalenarichter_": "@lxnxv.mxlm_ unser hübsches Vorbild 😍so wollen wir doch auch mal aussehen nicht wahr ?😂😍❤️", "mikez_ail": "Extinction Rebel: Greta T https://amzn.to/2HnTBvA", "ormeside1": "Please take care - you are tremendously precious ♥️", "mbhanumathi": "Hope you're feeling well now. The world needs many more people like you. Keep going 👍🏻", "misha_kostromenko": "Сука бл сделай уже что то со своим ебалом", "junadiodati04": "Hello Greta my name is juna I'M italian.", "jompalop": "No one cares", "zapadahitesh": "Abee behen ki lodi teri speech ma benchod bawasir ki bimari ho gayii", "haini_saien": "💮👍", "ilvars_mcmz": "I had very similar experience about 4 weeks ago, I ensured that I don't come in close contact with anyone and after 5-7 days got back to normal. I can't wait for available test to see if I have got the anti-bodies. #lookafteryourselves and others!", "mi.paolino86": "Maronna che cess", "dianalucky9": "Лярва", "thea.karki": "@marialars1", "rodrigocarmo": "👎🏾👎🏾👎🏾👎🏾", "eduabreu1": "How convenient you haven't been tested...", "firegirl290": "Ful", "adam2sturdy": "No one cares bud 😭", "borrisbrandt": "do something good, create serious values, work....and stop talking ! talking & creating digital mediahype is no value at all and even worse, digital egomanie creates senseless pollution! more pollution than planes & cars", "_p.bkr": "ur mom I see gearge the train go into Lucas brown mall crazy games boobs fun viniger", "truemirror01k": "Is it just me or does @gretathunberg look like Gollum??", "destructo.007": "BHOSDIWAALI JAAKAR PADH LE KUCHCH😂😂😂", "tomniclasrpc2": "when i open the front camera accidentally", "_fl_he_": "Du kleine fotze hasch keine Ahnung von Abgas", "panteoxbike": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕", "delporte_luan": "@sarajacmart petit selfi et tt", "elizabeth_degenszejn": "You are incredible! Thank you!", "rosereed807": "People are hating on her because she's over reacting just for more fans,she doesn't even know if she has COVID-19 she hasn't even bothered to take a test to see if she has it she just assumed that she has it because she doesn't feel when neither does her dad she's actually over reacting for followers", "rollon_n": "СтрашнА вырубай!", "whalesarecreepy": "she do be self isolating doe", "anilkumarshukla613": "Miss you", "fulatafghan": "Nice pic dear", "derakht143": "😮😮😮", "j.4k.3": "Potato head", "sky.zoom": "@henryshin_", "noahnumera": "Let me fuck G you a hood nigga to show u💯", "amir.latife.1": "nice", "claudio.franco.52": "@gretathunberg lixo lixo lixo lixo lixo lixo lixo lixo lixo lixo", "hamody6225": "Görgött😂", "neymarjulian12": "@paulxavierfoster", "olivoemi": "Selfies won’t stop climate change lol", "samuelfriess": "Just goes to show that advocates pushing the world forward come in all shapes and sizes, truly small but mighty", "ardayldz3": "Tipe bak fyjsmckaöcks", "real.sweet_a": "❤❤❤❤❤", "stylesethan32": "Yes ovcourse 😂", "huckster_swiftkey": "You're stupid bitch", "tayaaa_x": "You felt “tired, had shivers, a sore throat & cough” yet you’re making a point that you “didn’t feel ill”. 🙉 How much do they pay you to push their narrative? 🙊@gretathunberg", "madelinemarys": "@philwerner93", "umekawakazou": "很佩服给你写剧本的编剧，让你在前台装白莲花表演。我个人觉得这对你这样的未成年不太好，本来智力就缺乏，还被人当枪使，好孩子不做非要做神棍。", "emilo_syg": "Ugly!", "byvaet1": "Or vyshe gor. A a a a a a a a", "chenbo4518": "how dare you!", "mariannemossheden": "💥🌈✊🏽🍀", "k3v1n.2oo6": "Hope u got Covid-19", "nico.f7_": "Hässlich", "lgnmy203": "❤️🔥👏", "amberrskipper": "😍", "dancm_13": "Lol ugly ass", "2019leovb": "ugly girl", "webby7712": "So your not only a climate expert your now a medical expert too ?", "agnieska172": "Czy ta dziewczyna na wszystkim musi ugrać coś dla siebie? Popularność za wszelką cenę 👎 A tak naprawdę wszystko to tylko greto-słowa, słowa słowa... Puste słowa", "eru.guerrero": "Eat some more plants", "cyb_klex": "Fuck you bitch", "k.fox25": "Nice eyes,", "batu.gambino": "You look like a boy", "wendyb413": "Hope Your Dad is better❣️Thank You for all the wonderful work you & your family are doing🙏🏽 please take excellent care of yourselves❣️", "maurocappe.fans": "You are beutifull😍", "bertucileandro": "E aí Greta, onde está a responsabilidade da China em passar informações sobre o Covid19 para o mundo? Eles estão convivendo com o vírus desde meados de Sete6de 2019 e os casos estão diminuindo... Aqui no meu país eles negaram enviar insumos por questões comerciais e agora??? O que vai dizer?? Este vírus partiu da China, eles tem obrigação de avisar e prestar socorro para o mundo (inclusive financeiro)", "eileen676_": "@kiiim.800", "michelemerzi": "Drogata", "futurepilot_1": "FORTNITE", "bees_knees_gal": "Fanatic nutcase", "joicebacantte": "You are amazing 👏👏👏👏👏 Cheers from Brazil ❤️❤️❤️", "origamiblackbeltmaster": "You keep going #gretathunberg..You are amazing and to all the haters out there do you really think your tedious comments are going to stop her.. why don't you all go and do something constructive oops I almost forgot your too busy hating everything...", "enrico.galvini": "so, now after we stayed at home and flattend the curve I would like to get our freedom and our rights back. Also it’s time to expose all this shadow governments.", "al_k_kk": "Ебнутая", "dominik.schietz": "🤮🤮", "fsbcacucka": "Теперь ты снится мне ночью будешь блять", "remitionderattt44": "Fack you", "josuerosarioperez": "😘😘😘😘😘😘🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴🇩🇴", "jorndehollander": "Jij bent toch verliefd op haar @larsdrijk", "312cool_boy_charlie": "Get a life greta", "esteban.allende__": "Teni una cara de toxica", "apetrovich2020": "No cosmetic just climat", "susancara58": "🙏 Excellent Greta be safe💚💚💚", "7avensky": "Соска", "ilaya.17": "@_mia_mgd_187_ warum likest du gretas Post??😂😂", "wandersnevercease": "@pono_farmer", "ret_syu": "Ебать ты афца", "monroe_messi": "But environment, (pollution and etc) doing much better then u ever did so u must be ecstatic ...!!! Your job is donefocus on that rather then your sad stories.", "digital_lemur": "Wau", "leoncheetham": "April 9, 2020, Santiago de Chile. Dear Greta Thumberg:  I am writing to you from Chile, the southern country, located in the \"Southern Cone\", in our beloved Latin America (a country that you could not visit, despite, as you should know, we were waiting for you, lovingly in your role as an environmental ambassador). Globally, we experience the worst planetary pandemic following Covid-19. The “mandatory quarantine imposed” by governments has forced us to confine ourselves to our homes, in a conscious way: to take care of each other, avoiding the spread of this sad pandemic. Together with a group of citizens and artists who love Culture and Art, it has occurred to us to implement an international \"online\" campaign, symbolically, once the \"World Pandemic\" ends, that the citizens of each country, let us go out to the forests, national parks, squares and streets to embrace the trees as \"love\" towards the planet and life: they represent the new paradigm of \"caring for the ecosystem of all\". We ask you to evaluate the feasibility of your leading, along with thousands, this \"crazy\" and beautiful idea. Darlings Leon Pascal Cheetham. Journalist and Writer. Citizen Movement \"Embrace a tree\". Santiago, Chile.", "janaweiljana": "Thank you for everything greta 👌🏻🌏", "metehankurt2007": "Fucking Little Frog", "its_niiko": "Your one ugly modasuka🤣🤣🤣💩", "trubois.botman3b.x9_s5_6j1l": "Covid19 is a synthesized novel disease, it was made to ruin humans, it can never be fully cured, and it can be spread through air, touch and sex. Greta you are done.🤡 @gretathunberg", "amandavasquez453": "Dumb", "laurapauli": "💙💚🌎", "riyaz.malik.9440234": "Hi", "progib_bedrosovich": "Ебать ты чучело", "must1.loco": "du hurentochter tfou aleyl", "theenitelife": "Anything to stay relevant.", "elefantelegants": "Tuntun smells like poom poom", "patricia_beirigo": "Beautifull🥰👏👏👍😘🌹😊🤲🤗😇🤲🥰🤲🙏", "dradtu": "did u ever get molested? sometimes you look like you wanna tell us somehing but you dont", "pedagoga_do_poder": "Mais empatia e amor ao próximo 😍 @gretathunberg", "giulianotiburzio": "Nothing about China ???", "rare.alien": "Сука, так смешно на её лицо смотреть", "twelvgage": "I wish you a speedy recovery !!! 👍🏻🙏🏻", "joshkelly393": "😂😂😂", "bug_bea": "Seek treatment in fckd up Sweden 😂😂😂", "jolubams": "🌹", "xechox1": "E G G", "alexsimao2": "Vc e muito feia . Sua merda ambulante . Porque nao faz cara feia pro chines agora ?", "macekkkk": "how the hell can you compare germany to italy", "ventura_._": "#bolsonaro #bolsonarotemrazão", "night_rod_special": "Little stupid child!", "_crumch": "fire selfie greta", "su.arez597": "🙌hi", "simonturesson7": "😂", "imayushsundriyal": "You aren't revelant anymore :)", "elias_04_sandberg": "Skjut dig själv med ett maskin gevär", "brunnojoseph": "#bolsonarotemrazão #bolsonarotemrazão #bolsonarotemrazão #bolsonarotemrazão #bolsonarotemrazão #bolsonarotemrazão", "apollo__1newplanets": "Well said..little lady!", "marv.nmn": "Guck mal ordentlich", "matthew_mcgahren": "If those ignorant people haven’t read that super long comment about you isolating yourself, they need to. You are amazing, helping fight one crisis while being the leader to fight the other. Keeping doing you.", "renataa.fariass": "E cadê vc na linha de frente ? Ja que foi contaminada e ja pode sair , a China está acabando com os sonhos do meu filho ...pirralha 😂😂😂😂😂", "guillermiinaa_": "😘😘😘✨", "mlmx2080219": "Go to school and@learn so@etching instead@of pretending you know aomething", "barakatyounis": "Ooh honey❤️ you make the moon shame of it self bcs of your beauty .. God save you from all bad and make you a princess of all women in the future as you are now . Miss Girls my Flower Greta,, with you for ever", "speedfan7": "😍❤️", "dodgelover7264": "Die please so we have no more protests and then I'm not late for work again frog eyes", "maurizio_mantovani_67": "You've just lost your first line on word's show, that's all.", "zeynalnamazov": "U r just a teenager, u could felt that way. End of day u see it's just a thought. After those u gonna see it was just a part of time", "wilza_moreira": "@sikerajr", "alexanderulvestam": "ful som fan", "vegassandybrush": "Greta you and OJ Simpson have a lot in common you both lie and need attention when you become irrelevant", "nikcsvds": "Lol 🤪 Bullshit", "markadnum": "Sounds like you had a simple case of travel flu to me. Calm down.", "_abcdance": "i love how i read this in her voice 😂💕", "alia_bouamar": "HOW DARE U!!", "andradegomezximena": "Hiiii", "mathispretre": "Je crois t’a été fini avec 21 mec", "simping.j": "this btc is mad gangster", "stephencpearce": "Follow the math do more people love or hate you greta we all know the answer xxx", "alfo.net_": "COVID-19 can kill even young people without particular problems, even if it is more difficult. I hope you didn't have the virus, but don't trivialize with this bad publicity", "eeb1choirofficialmemepage": "Hi Greta", "andrezimleal": "Pirralha da cabeca de cearense", "king_from_cookies": "🤢🤮", "aikencrystal": "Welp sounds like you had a cold then", "alexander.holmberg_": "🎉", "silvan_28": "Looks one child", "mauriciopriscilla": "boo hoo", "vadim._65": "Cool 69 dodge cherger", "bbcreativ": "Many people are happy with your decision... Unfortunately there is still the Internet 🙄🤦‍♂️", "pieter1234x": "So beautiful 😍😍", "j4nn3k.dgg": "@lsd.lazo65", "bruh03300": "Look kinda funny", "ktoowavvy": "How dare u", "sam_groves30": "Your fucking retarded", "emiliehhagen": "Remember that there is the flu going around too.. I’ve been sick for 3 weeks now, and I have never experienced anything like this. So much pain that I’m almost crying. Will be tested tomorrow finally (in norway). But I dont really believe it is corona still.", "carol_previtalli": "An angel", "brent.leith.1": "Clearly not bullying fact", "fatih.bulut26": "Idiot", "prohair.kz": "Говорит что нет возможности проверить и в то же время подтверждает что у неё коронавирус Странная  Да и вообще зачем ездить в Брюссель, если по всей Европе эпидемия Затем призывает сидеть дома, ну уж конечно та теперь посиди-ка А раньше подумать об этом было никак", "hans_bernd84": "😂😂😂👏👏👏 wenn man sonst keine Aufmerksamkeit mehr bekommt dann springt man einfach auf den Corona Zug auf um so wieder in die Medien zu gelangen. Da hatten ihre Eltern ja wiedermal eine tolle Idee. Dare you", "bigjo11": "so ugly", "sambrooks501": "Get a normal life", "timeforme88": "I hope your father has recovered.", "marlon_garozzzi": "Não🤮🤮🤮💩💩💩💩💩 vai reclamar que a China acabou com os sonhos do planeta todo não sua merdinha boca de lixo.🤮", "ganin_13": "Дибилка иди учись, курица тупая, видимо не зря что бальная!!!!", "lilasstewart": "@tillyjones15", "stanfooooord": "why couldn’t we get a good looking activist for once...😢", "rim.mllrs_": "😍😍😍", "3v.chris": "❤️", "mci_mark_n97": "Du kleine Hurentochter", "lucrece.grt": "Trop une blgs mv🥵💍", "amorimeva": "Sad", "mertaavcu": "Ey du bist so hässlich vallah", "elmaob": "Jag tycker du gör så bra saker Greta bra att du står upp för din sak!💪🌸💕", "demetres9725": "❤️", "tobebette": "We are with you, Greta!", "peta.breadd": "Get a lip job", "fheonese": "When corona do more for the Earth than a swedish activist girl", "as_if_567": "She reminds me of a skyrim child", "jimmy4flintoof": "Fuckk offf please!!", "sanny.19.96": "Greta is sexy", "anastasiabandurovska": "💙", "henningborm": "You are very impressing 🙌♥️", "alvarother_": "😍😍😍😍😍", "awesome_hindustan": "Check my insta story 😍😍 #follow #followme #followforfollowback", "username_4285": "You should have stayed in school", "brettdutoit": "@guydutoit 😍", "monica.agerkrans": "😍👏🏼😍😍😍❣️❣️❤️❤️", "savitoj_0906": "How dare you😡😡", "alex040105": "🤢🤢🤮🤮🤮🤮🤮🤢", "__max__kd_": "їбана шмара", "ptosoloo": "Miniña", "wacykko15": "Hello greta how are you", "jett10t.l": "Who?", "amin_omidali123": "👏🏼❤️👑🌹", "amanischelbert": "😂", "felixseidel14": "Var framför ett fisk ansikte!!!", "m9marls": "did you know you're being abused for nonsense propaganda.", "puffylittlecloud": "Love you, Greta! ❤️✨ You’re a warrior for our world.", "raquueeeell": "Greta you’re literally such an angel and inspiration I hope you’re feeling much better you were definitely in my thoughts and prayers 🥰🥰💕", "ds.mp5": "Shut up bitch", "greg5x5": "Feel sorrow for the people who hate you just as Jesus felt sorrow for those who rejected and murdered him. You have taken on such a large and hard task. I hope you are a follower of Jesus. If not please spend some time reading the New Testament part of the Bible", "abigailjlsmith": "Boo go to school like the rest of us. You're literally not doing anything!", "my_healing_chamber": "😂 Don’t u delete my comment‼️", "artefakteris": "уродина", "margaridacardoso7": "@iamzepedro", "jnrmusician": "UGLY KID", "cjaracoyes": "😍 Que Dios te proteja a ti a tu padre y familia", "orvikenstina": "❤️❤️❤️💪💪💪", "white6actual": "No one gives a flying fuck you clown", "filipeazevedo91": "Idiota", "isacarnold93": "Ewwwwwwwwwwwwwww. What the fuck is that bitch. How dare you", "sukhvinder6597": "❤️❤️❤️", "fratuyg": "Aşk bu ya aşk 😍😍😍", "kaiser_aiden": "Die", "gorbachenko.alice": "На мою одноклассницу похожа🤔", "bahramnejad.s": "کچل", "elvecinotusabes": "El covid 19 hizo más por ti en el medio ambiente en poco tienpo😂", "jorge.3811": "👎👎👎👎👎👎🥊😤", "jt.bolger": "Hold this L", "balexandruo": "@gretathunberg I hope you are fine here in Romania coronavirus very bad everyday is very good you isolated here not testing to Have a happy day sending love from Romania #GlobalClimateJustice", "ccandidk": "I got HIV. Had all symptoms too. But now I’m ok. I was never tested like you. But I’m sure like you: I had HIV", "qqshkin_": "Фу блядь. Какое же ебало противное. Просто пиздец", "_ri__ck_": "You look like an alian designed by Mark Zuckerberg", "youzaky": "🔥🔥🔥", "corporal_pubg": "Отето я понимаю пацан такого и трахнуть можно", "simon__wall": "Coronavirus", "ying._.yang13": "Ur 13 or 14", "sashaservachuk": "Я ще не настільки знаю що ти там як справи з легкістю і кара в україні останні новини з категорії суспільство в мене на день народження і бажаю вам приємного перегляду фільму", "earthlyactivists": "Get well soon 🌱🌳💚", "kajah2000": "Very well written! So happy you recovered quick:)", "kr_artem07": "So ein Alman", "natalia.spb.ru": "Seit wann stellt man sich die Diagnose selber?? Wir hätten das Problem gar nicht, wenn es so einfach wäre! Normale Erkältung oder Grippe existieren nach wie vor. Nicht jeder Husten ist direkt Covid-19. Aber da \"Fridays for future\" grade nicht so wirklich jemanden interessiert, muss man natürlich umswitchen 🤦‍♀️🙈", "zarpe2333": "Wow beautiful eyes", "alec_leth": "You fuckin’ suck", "vinny_1125": "LETS GOOO", "amemusicbr": "hmmmmmmm", "mayo_nasal_spray": "💁‍♀️💁‍♀️💁‍♀️", "grantgibney": "you", "gandrud": "Nobody cares about you!", "ight._.fam": "I could slap that forehead and it'll be as loud as a strippers ass cheeks", "bacononaplate": "If Carole Baskin had a daughter this lil actor would be it 😂", "asa_kridy": "No one likes you", "davidos_samara": "🤦‍♂️🤦‍♂️🤦‍♂️ bullshit", "nanathebc": "fukin liar", "iakushev97": "Иди ты нахуй, конченная активистка!!! Землю не спасти, нам всем пиздец! И ты впервую очередь сдохнешь, тварь малолетняя!!!! Тебе испортили детство? Дура, езжай в Россию на неделю и, поймёшь все! Хотя куда тебе до нас!", "en.sohe": "You are same my love😍❤️😍", "eve.linaberg": "Jag älskar dig så mycket vill träffa dug❤️❤️❤️❤️❤️", "oliver.vie": "Bruh", "iwearbiggirlpanties": "👏🏼❤️", "istanbul_is_greek": "😍🥰😍😘", "anja.dtr": "Enough Greta... We are tired of you", "abbasi_shahzad21": "Hello", "hombre.leche": "the radar is showing no signs of who asked 🏴", "superpriv_vesta": "@johannes_meyer_einmo 😍", "nxdyn": "♥️", "j4smino": "❤️", "paulinessjj": "Es qu'elle sais que sa polu insya👏👏👏👏👏👏", "z.hanni.z": "du armes kind kommst nicht mehr in den nachrichten wegen corona na da is doch was wichtiger als du wusste ich aber von anfang an", "sophie__bio": "❤️❤️💜💜💜", "ibrahim_ahmad_aliyara": "How dare you😂", "william_raphael04": "Så jävla ful hahahhaha", "lng.leo": "🤢🤮🤢🤮🤢🤮🤢🤮🤢🤮🤢🤮🤢🤮🤮🤮🤮🤢🤮🤮🤢🤮🤢🤮", "coronlyplanet": "🙌", "marco.simoninii": "Chee bbbbelllaaaa", "homem_fresh": "Good ur plan ride would pollute the planet as would your car ride train ride / I’m striking against your inability to be more than just a young girl inactively complaining versus planting a garden with the other billions of children versus disrupting education and doing nothing with your hands - reap what you sow and I dare you to sow some oaks - something indigenous to norther Europe versus words", "sarameend": "@palomameanahidalgo @alfon_mc por dios", "mustafademirv": "Are you etliekmek", "sirgmao": "one way to shut you up.", "vincentlindstrom7": "Alla vill dö när man ser dig🖕", "ikbendylan1": "My god what a horrible face!", "d_a_v_i_d._.n_e_m_c_e_k": "I know you are time traveller", "die.vas18": "Haha she deleted my comment saying Coronavirus is doing more for the environment in the past months than she has from all her petty speeches🤡🤡🤡", "flaviamacedocba": "Isn't it time to save the planet ?? Ow and just the media you wanted?", "look2014skywalker": "Hallo Greta ich habe gehört das du psychedelische Mushrooms zu dir genommen hast. Jetzt verstehst du die Welt wohl etwas besser. Ich wünsche dir und deiner Organisation. Und. Und. Bis dahin alles Liebe bist ne starke Mädchen Peas love and Harmony siehe one time is coming Keepsmiling", "miss.ambidexter": "@jo.beijinho evo o ovome ti pricam 💁🏼‍♀️", "lukakavcevic": "Stfu and do your online homework.", "_cymawedwa9l_": "Agly", "psilocybingo": "Sad you didn't die..", "alexandra.reichenbacher": "Very very true! Good that you recovered so speedily!!", "katecaciu": "Adesso sta bene? Speriamo di sì. 💖👍", "paraskevopoulouge": "👏👏👏💙", "rose.e.tiao": "Greta não vai reclamar com a China q ela destruiu o sonho de todo Planeta🤔", "mechette_4448": "Your full of shit Greta", "soloviev_evgen": "Привет тумберг . 😂", "_.andrearanucci._": "Fai schifo", "armyman69701953": "Greta we here in the US see many teens not listening. We thank you for your post. I took epidemiology in college. This virus can lay dormant in young ones, and teens I believe depending on how good their immune system is up to and possibly a month. We have not went out of our house only to pick up food at the local grocery store, and the drug store. We have some cases in our county. Some from college kids, some have been hospitalized some have been quarantined for 14 days. I personally believe it should be at least 3 to 4 weeks. I know that seems a long time for young children and teenagers to get together, and college students. We hope and pray that you and your father will be alright, along with many million’s more. Our hope and prayer’s is not only our country to have a test that will be 100% accurate not 60 or 70%. Many million’s of American’s are staying home. Some parents however are letting their children, and teens out to play all kinds of sports where their is very close contact, or having contact that could cause greater amounts of hospitalization, and even death’s. Armyman 6970.", "shehbazz17": "Love you greta 😊😍", "zamir_patosxd_2.0": "how dare u", "alekgovorov2021": "Because of its ecology, China did not have immunity, so a new virus became so toxic. The only salvation for the world - This is the complete termination of relations and trade with China, ESPECIALLY IMPORTING FROM CHINA.", "kallstromsven": "👍", "not.damper_gamer": "Ha! A virus is doing best things for the planet than you", "lory_colo_17": "Mi sa che Greta visto che è scomparsa dalla scena vuole ritornare al centro dell'attenzione con il pretesto del Covid-19. Non tornerà a galla perchè questo post in cui dice che si è \"isolata\" per presenza di sintomi del coronavirus è una mancanza di rispetto per chi ce l'ha e rischia di morire ogni giorno (in questi giorni sono morti due ragazzi di 16 anni circa quindi non dite che muoiono solo vecchi o cazzate varie) quindi Greta lascia stare e non tirare in mezzo argomenti che non conosci", "mstfymhmd8486": "hello٠١٠٠٣٠٤٧٥٠٨", "peturchr7": "How dare you", "lochin_126": "U r stupid bitch", "excelee1118": "恭喜感染", "tommy_lee1994": "Fake ass dumbbish needs to get visible", "_eliasmuffatti_": "Che figaaaaaaaa🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰", "purple.ktm": "Чё у нее с ебалом", "davidfoundinstag": "You are a treasure for the world, you are a God blessed voice for the world, stay safe, boasorte from Italy🙏🇮🇹🙏🇮🇹🙏", "cccadaver": "Get well soon dear Greta🌷", "____.andre____": "Hai la faccia deforme porcoddioh", "noe.sample": "On dirait Tom Fallourd", "u.k.t.81": "🖕🖕🖕🖕🖕", "hadi_chabdul": "❤️❤️❤️❤️❤️❤️❤️❤️", "ianlafever": "Ur fucking ugly", "umadura_bacon": "I hope you recover soon! Fight❤️", "oisin_nolan.1": "Your more than likely adopted", "ewabroman": "AGREE! ❤️👏", "gamer346nn": "trump hater", "jamesmom22": "I HOPE YOU DIE YOU UGLY BITCH", "joao.edilson.1": "👏 parabéns Greta", "javillapur": "Because is come for CHINA", "stalker__2006": "Что с ебалом?", "brel50": "Perdon, Greta, este mensaje no estava para ti ! A ti te deseo lo mejor i que recuperas tu salud rapidamente. ❤", "romchik2445": "Пришелец", "eddy.fvm45": "Greta savime❤️👏 plenet", "tatikpoker": "DID YOU USE A BIKE TO TRAVEL FROM PLACE TO OTHER??", "sarah.d_92": "@dilniya_sed @asya.k_27", "skorrpion4ik": "Shit greta", "nelie202024": "Such a kitten😍", "andre.buremster": "❤️", "nickr5917": "Get some toys or a boyfriend honey ... your 16 and should be enjoying your life !", "cesarzb07": "El mundo no cambiará si la mayoría no decide hacerlo, que otra prueba se necesita, el mejor honor que podemos hacer a la gente que está muriendo es cambiar nuestra relación con la naturaleza", "cuzbeesbzz": "I’m glad you’re mending well, and I hope your father is well 💛. Thank you for your tireless work . I appreciate you!!!", "stephanie_mark_new_paradigm": "Omg sooo sorry to hear this!😊🙏🏽✨🕊🌈💗", "christo_aus_deutschlaand": "🦷🦷🦷🦷🦷🦷", "alexandremuscopfbotelho": "RUN FOR A PACIFIER", "victoria_bartlett_nyc": "Thank you for saying this as young don’t understand the dangers of transmitting to older folks ..❤️❤️❤️❤️", "1438.pedro": "Animo tu puedes llegar al interior del alma de todo aquel que quiera convivir en armonia con el planeta para la supervivencia de todos los seres vivos de este mundo", "ellaczajj": "SATANA!!!!!!", "kornienkovva": "Че высрала, вопросик?", "jack_amstaff7": "Are you feeling better? ❤️❤️❤️", "stephen.haines8": "Get better. Take care. The world needs you.", "komputer.03": "psychniczna, koszmar , izolowac od społecześtwa", "samy_s_life": "Why your so ugly?", "1.2.3.4.5.6.7.p": "@tedi_shijaku she got it too", "tanvi.maroo": "greta invented coronavirus @kk_2316", "kk_2316": "Why is one pupil bigger than the other oop conspiracy theory. @tanvi.maroo", "nilusmile2": "take care greta 🙏❤", "_dunoob_": "fuck you", "kashyaprajputravinder": "Hi", "sukhbeersingh862": "Good ji👌👍💕", "piro_de_epiro": "Cabezona xiskskssn", "mileslaviolette": "We need a prayer, my girlfriend just lost her cousin to COVID-19 who she was very close too and she’s also overloaded with school assignments. It’s like her whole world is coming apart", "demenzfreileben": "Have a nice day Greta. Nice Greetings from Germany", "sachinraj8135": "❤️❤️", "voyagingvioleta": "❤️", "nvmog": "Bro that kinna cringe xD", "axdrew000": "Ok", "rachel.wheatley93": "@lucas_lauren", "ksg.ariel": "fucking kill yourself", "dabaadoodler": "Ole egg head ass lil bitch", "pedro_h_depi": "Feia do krlh", "mompower110210": "I'm glad you are in recovery.", "theophaniawahnon": "I’ll pray for you and your families health.", "stapley_mike": "Since the outbreak of #COVID19, Ive been unable to go to work, thank God to @mike_stap_fx ..with him I have been able to make $30,000 with $3000, in a short time. DM him to get started", "anastasiya8039097": "💗💗💗🙏🙏🙏 выздоравливай!!!!", "aura.danielsson": "❤️", "beerandy46": "cont to the world KEEP YOUR VISION of a better, greener land", "propertiesbyjessica": "Thank you Greta! 💜💗💕❤️", "__anim3_": "senti carolina, mi hai altamente rotto le palle. Pensavo che finalmente ti saresti tolta di mezzo e invece mi vieni a dire che stai guarendo??? ma tu ma, pa e zii e chi cacchiarola morite.", "achiever_solo_official": "Hi, looking gorgeous...🌹", "abush3toor": "Bitch don't take selfies like you're 46", "darquesse260": "NO ONE WOULD SAY HOW IRRELEVANT IT WAS OF ANYONE ELSE POSTED IT STOP BEING HATEFUL TO SOMEONE WHO THREATENS YOU WITH CHANGE", "bell_osama": "Cuanto ganas haciendo protestas", "destinybassquelle": "take care of yourself bb we love you", "anthony_gaetani": "@pornhub", "romankrapivnik": "😂😂😂🤣🤣🤣🤣🤣🤣🤣🤣", "michael.schmidbauer.969": "🖕 du Geisteskranke Mädchen", "noel.06.larsson": "Helo", "samirasimsimya": "💜", "sebbe.wikstrom": "Very sexu", "rategoodveganfood": "💚💚💚 Thankyou Greta ❤️❤️❤️", "patirs__fr": "😂😂👏😂", "patricia.pasquier": "Tais toi grande idiote", "fatou_toure2002": "I hope you are feeling better!💪", "hightimespeacekillah": "Господи, когда ты уже умрёшь, пизда тупая...", "pinedafloral": "Estarán en mis oraciones.", "lana.fitnessblog": "I’m glad you recovered ! ❤️ Keep 💪🏻 Greta, the 🌍 needs you! 💚💚", "kaco_nascimento": "Feia demais! Afffff", "fishin4doughnuts": "Annoying", "artwitharielvikmaxwell": "❤️❤️❤️❤️❤️❤️❤️", "plaiidium.entertainment": "Such wise words! We hope you are feeling much better now x", "adi.indigo": "lying piece of shit", "nannaploii": "❤️❤️❤️❤️❤️", "liannemonique": "@meekolangot read it", "jameslm18": "Hopefully the virus gets ya", "csworst": "👎👎👎👎🤐", "joseacacioeuzebio": "👏", "spartacan3000": "Extremely likely?? 🤔🤔🤔", "lilianarld": "Very good message Greta. 👏❤️", "stephanie_kgb": "The haters in this comment section are at peak dummy dumb stupid.", "lindajeanmurray": "Thank you Greta", "patches53": "Should have stayed at home or in school instead of travelling around having fun for free.", "nikrebolj": "Kurvooo", "luaalquimica": "🙏", "mamaanna": "Borrowed apartment, borrowed Tesla, borrowed Yacht!! You poor poor child!!", "gypsyeileen": "💕so intelligent, keep it up, as I know you already will. You are real inspiration 🙌🏽", "cassellus": "Good. Stupid bitch", "lumarel.mf": "❤️", "fashion_looks_inspo": "Most comments here are simply disgusting and most of them consist of grown adults insulting a young girl. Since she used to travel a lot, it's normal She may have caught the virus or not, so I'm glad she is practicing isolation in order not to pass it to other people. I just hope the ones wishing her the worse and making hate comments get corona virus. plus, some of you are old enough to lose time insulting a 17 year old girl.", "taya_tata_tanya": "Take care of yourself 🙏🙏🙏", "baerbelkramer": "Der ö", "guidomatomatini99": "Stai a casa per sempre", "checomyhair": "@dsl419 meanwhile you are a Ceo of procrastination", "tomredmxn": "You looking thicker than a greenhouse gas", "ovsanka1238": "Из-за сборки людей ты могла заразить и других", "nuclei_bg3": "I hope you had....", "ben.pls": "Geile fotze", "mx_srn": "Du bist hässlich", "raphaelkern0": "Ugly 🤢🤮", "oficialsergiiogomes": "Larissa Manoela", "joshsmyth._": "fuck off idiot", "na_kgz17": "🤢🤢🤢", "wanaagsamee": "❤️❤️❤️", "aadaniemelainen": "😍😍", "_thdn__": "ok bro", "blessedby_lucifer": "I wonder do you ever have pussy and breast on you , Do you ever wear Heels and shorts ..😂🤣", "sridhar_se2": "❤️ i have fear now i am happy love u", "lucianovilela_arq": "Nuu que susto", "csogu": "@saracac", "norman.thieme": "Hahahqhqhahahhahaha😂", "james_sarsfield_": "When", "iumatovapolia": "ты он или она", "its.tha.frank": "You are a virus yourself, Greta...", "asb.draws22": "Take care and get well soon Greta. Hopes and prayers to you and your family. Stay safe.", "__r4fly_": "Hi👋, i want give you a question.... How about with corona virus in this world?", "susieqandthefoofighterstoo": "For once in her very short life this girl @gretathunberg has posted something i agree with. ❤️👏🏻👏🏻👏🏻", "linus.byr": "Who was asking ?", "daisylee12380": "Perfectly said, Greta. I’m in a household of 4: 20 year old had dry cough and nothing else, 23 year old had 5 days of chills and cough, 55 year healthy Dad is hospitalised...", "ioakim.official": "This song is dedicated to you: https://www.youtube.com/watch?v=v0NetyItg3g&t=56s", "meme.galore_": "You get what you fucking deserve", "luiz.ajesus": "kkk gostosa", "chrissy_bruggeman": "some of these comments are disgusting. the fact that people who don’t agree with your views actually choose to use their time to seek you out simply to post mean comments shows how much more intelligent you, a 17 year old girl, are than them. the sad thing is, i looked at some of their profiles, and many of these people are parents. parents bullying a girl on social media. such terrible role models for their children. i would be ashamed. love guns, meat, and beer” amiright", "vitor_compay": "Thank you for sharing this", "fmlpoln": "What fuck. When you need money to feed your family and kids, then you come to tell me #stayhomehungry, but the vast majority of worlds people dont has more than 15 days of food, you will pay their bills and put food in the table ? Or instead of perhaps being infected by Covid 19, do prefer that they surely die of hunger ?", "evikkive77": "Bleeeeeee", "nico__050": "🤢🤮🤮", "shaunxb1": "Shut the fuck up irrelevant cunt", "3mmeseb_der_v": "🤢", "samu_wick06": "🤮", "lukewalms": "Little liar. Attention whore.", "evelawrence93": "It would’ve been helpful if you hadn’t encouraged mass gatherings in major cities during the acceleration of a pandemic. Should there be a next time, consider using your pulling power to encourage social distancing and to stay home. Please. Unsurprisingly more than half of the people I know that attended here ended up in isolation within a week. #socialdistancing", "lxxs16": "Fucking downi", "tm2929": "Corona done more than u ever have is that why ur claiming u had it? Get a life", "dilousarah": "Huuummmmmm yes the COVID19 is mort", "patrickbateman_": "Che brutta che sei.", "kbatjunior": "💪🏼", "_bikram__850": "Wish I had a life like u... Wish I could have left school and protested on the streets and then go to the UN be nominated for Nobel price and attend the world economic forum", "ivajra": "💓", "rustygoggles": "Walter", "olonia": "Это твоя вина, ведь ты озвучила, вот тебе коронавирус в помощь. Природа ожила", "i_eat_grass123": "#MakeAmericaGreatAgain #HighSchoolDropouts I cannot wait to see you get angry again when a cure is found for the virus 😂", "diaryoftheunique": "Jag tycker du är jätte snygg Greta vill du bli ihop", "matthew.kacar._": "You ugly as hell", "iasambreesh": "Never loose ur positivity", "jack.bakx_": "@migrainedmitch iets voor jou? ;)", "soccermomsociety": "ur a bad bitch ily stay safe and healthy", "x_jamila_xx": "So cause COVID-19 has more attention than you have, you suddenly have thr COVID-19 virus😒 YOU👏 ARE👏 A👏 JOKE😂🤡", "cloutgod.matthew": "You're retarded lmao", "ericahuberart": "@simon17dnd @nathalievanleeuwen", "jacob.nygaard": "hvilket snus tager du brormand? du ser ordentlig skab ud", "asian._.brandon": "Well you predicted the \"mass extinction\"", "camilla.june": "Prayers for your dad @gretathunberg ❤️❤️❤️", "amattacola": "If you’re an adult and listen to anything this sheltered, spoiled, actor of a child says, than you have problems. She has zero pedigree, zero real world experience, and inexplicably has developed a platform and following by being incorrigible and outspoken with no merit whatsoever.", "ahnastasiarose": "@juice.uticals", "cap.ital.ism": "Socialized healthcare fails again... get well soon all!", "barbaraerskine.miller": "You and your Dad need to get 100 % better. Stay home and stay safe.", "baruqueamaro": "Por favor, não siga as autoridades se este for o presidente do Brasil.", "leslieanneadamsgreen": "Hope you & your loved ones are all fine when the dust settles. Big question is, once youve had it, can you get it again ? We all need to stay vigilant about handwashing w/ bar soap, no hugging or hand shaking for at least 6 months, social distancing for at least 3 months i think. Cleaning our phones, homes, cars,bikes,etc is something we shoukd all just keep doing. Oh, and btw, thats not just for females, males need 2 do it,too. Everyone needs 2 learn to cook or at least fend 4 themselves in the kitchen.", "mariellafeliciano": "@ashliesita", "fraobo": "Spoiled hag.", "shmulie01": "Wow so pretty omg", "dastyn.robbyn": "thank you for sharing I hope you and your family are well❤️✨", "_alessio112_": "🔥💪🏼", "jopinstus": "PORTUGAL AGAINST covid-19 ! ! ! see on youtube ! ! ! Cristóvam - Andrà Tutto Bene", "_louis.c__": "@jznas", "dena.blackman": "Suffering relevance deprivation syndrome - poor lost child.", "vickyrmi": "👏👏👏", "mr__brownstone__": "Y ur face like that lmao", "s1mylka": "Занялась бы собой, такая неухоженная:(", "egich777": "Дрянь пздц", "kyrip4a": "Иди нахуй уродка со своей чистотой блять я хочу на Camaro ездить и на Tahoe", "_erika.h_": "Do you Need Some help ?", "yourbuddyjuz": "damn that's crazy", "dont.worry.be.stoned": "Rauch mal was grünes dann geht nämlich dein Asperger Autismus weg 😂", "jakubsoucek1893": "😂😂😂😂", "iamjocelyne_": "😂😂", "luisspam._": "k", "_fanda.dosko_": "FUCK YOU AND YOUR FAMILY", "romeutarzia": "😢", "6ty9ers_": "haha u have covid-19 u noob", "jeremywalch207": "Shut up greta Thunfisch", "official_fight_for_life": "How am I suppose to believe you after you lied about something as simple as a train ride", "xryouth.woodbury": "Sending love and strength❤️❤️", "f1ches__": "Asperger", "veox_lombardo": "Bellu grysu", "evan6219.v14": "Shame it didn't get you", "darth_vader_is_the_best": "😂😂😆", "michelle_a_guiar": "🙏", "forrrr1": "👏👏👏🌸🙏🙏🙏", "richerlynette": "Thinking of you, Greta. Stay strong! Love and hugs.", "miagtoes": "so many ugly men in the comments", "ladriansson": "@lawrenceobrienapelgren", "savic__23": "🤡", "bucky315": "Love you Greta. . You are an Angel. .a lone voice", "go_g_berry": "I hope you're ok", "alexanderverbeurgt": "Why are u gay?", "thenylij": "If you’re saying the last cold you had was worse than this, then you probably DIDN’T have Covid-19. This is knocking people on their ass. You saying “this is the bottom line: I almost didn’t feel I almost didn’t feel ill.” You are NOT an expert and saying “young people may not notice any symptoms at all” is DANGEROUS. This is NOT an illness that has unnoticeable symptoms. Sharing this, saying you “think” you had it is FOOLISH. If you really had it, it would have been MUCH worse so you more than likely had a really bad cold.", "bonatodenis": "I Hope you feel Better but i also Hope you stop to be a \"politic\" , take your time and do what Is correct for your age.", "marco08092": "Musst mich übergeben als ich das Bild gesehen hab", "polar_permaculture": "Take rest.", "jeremypisser": "If you post something cringe again, I'm gonna become a muslim and enforced shariah law on you.", "20026.s": "May God bless you", "gusdurigan": "I’m disappointed! Was hoping for a RIP post ☹️", "mert_axu": "it's funny 😂😂😂", "sweta_sthaaa": "😊", "walter_clements____1": "I like fire trucks and monster trucks. But i dont like this fearmongering autistic retard ~Walter~", "sebavacy": "🌍🌎🌏🙏❤️❤️❤️🇮🇹😘🌹💪", "graceschurterdamien": "❤️🙌\"Keeping Strong\".", "john_pst04": "Fu*k you greta tunfisch", "xdl3w1z": "@therealpolicy", "lenedora_inspirations": "You are so courageous! Stay well. 🕊🙏🏼😊", "gio___03": "godo muori", "mattloops": "@cityprospect", "helene.strandkvist": "👍🏻", "davinko2020": "Hi Greta are you here to save the planet and humanity? Some one out there listen to you and place earth to a rest!! The planet is breathing again!!! Our planet is sick and so are we!!! I am 100% conscious of this and I support your campaign. Hopefully this virus will clean up this planet and make it a better place.", "ryan.bre_": "Not my proudest fap", "tcalibilge": "I'm sorry", "mrmeook": "Your a blessings in disguise sent straight from heaven stay safe and feel better sooner than later @gretathunberg 🙏🏾", "drbest.29.02": "All people like you that are immune, have to help voluntary in a medical center or similar facility. When you don't help all the nurses and doctors you are a coward.", "mmustafaerden": "Naptın lan kendine", "d.johnstone_": "@dylanmartin___ 🔥", "aliioli_": "Mira @alexisphotosolis", "marc_.k": "Can we see your milkers tho", "edo17sosa": "Pari gollum ao", "iamamok": "Too bad if she needed a ambulance... I'm sure the emergency horse and carriage are on speed dial on her phone...", "j_r_p_photography": "how dare you, people die here. you only want attention and because, thanks to covid-19, nobody is interested in you anymore, you are trying to get your attention now.  do you understand IT DIE PEOPLE", "britneyyonkers": "I love you Greta", "timur_aydaroff": "Чо так много", "mucphey": "Stay well and keep kicking butt! You are such an inspiration! ❤️", "maiacdlp": "and who cares if she didn't have it? this is correct and important information that needs to be spread.", "awesomeforever11": "Thank you for isolating yourself and saving people from this pandemic", "sydneyisnotallat": "greta, you a bad bitch perioddddddd.", "zoke323": "Click please i had corona", "calvin_silk": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏", "daniel_lastro": "@roberto_plevnjak @korunekabel bi?", "maxence.mllv": "Crève", "yctoria": "Greta why did you get a patent for FFF for millions of dollars if You clearly say your an anti capitalist? I‘m not hating.. i‘m just wondering..", "casadajoana.tv": "#basicincome", "drecardenas": "What a joke this is, what a lack of parenting...somebody should shut you the fuck up, grow, learn how the world works kid...still complaining about your \"suffered childhood?\" Why don't you go and see millions of kids starving in Africa so that maybe you can begin yo understand something at least.", "drsandrobichara": "#ClimateStrikeOnLine #FollowingAllTogether #ForaBetterWorld #ForAllPeople ✨🌱", "blackharty": "Cool pic gret lulz😎", "wutinyan_celine": "How dare you to catch this virus", "gilbertcoats": "Yes, indeed. Well said.", "thetinydiplomat": "Hope you feel better now Greta!", "2tresors": "@jordan.hayes_yb", "clara_ferrer_burnett": "@gretathunberg Hang in there dear Greta, in the meantime the earth is recovering from us really😞hopefully when this pandemic end we’ll come out a little more wiser and more gently towards our Mother Nature 💕", "erikazig": "🤦‍♀️🤦‍♀️🤦‍♀️", "leigh.j.duncan": "Good luck hunberg!!", "cry65ssy": "Take care 🙏🏻🙏🏻🙏🏻", "wiistake": "Corona maker", "rena_te1807": "Darf ich die Hausaufgaben von dir abschreiben ?", "kayelwalker": "Get a freakin grip you fear monger!", "ilij_aa": "👽", "dollyrotten710": "Claiming you had a disease which has killed thousands based on total speculation in an effort to stay relevant....how dare you", "this_beautiful_world_of_nature": "🔥🔥🔥🔥🔥", "sarah_ruehrnoessl": "Damn, you deleted my comment? Why? Was the truth too harsh for you? Well okay then, let me put it differently. You're not a doctor, you don't have a degree and as it seems now you don't even have basic school education so stop talking like you're the smartest person around. 1. You probably did not have Corona, stop harvesting sympathy. 2. You're just jealous that this stupid RNA virus did more to help the environment than you....", "olliefrancis._": "Wow that’s cool Greta but literally no one cares", "gatiengrimaud": "Use make up you're beautifull", "cadavis5988": "Ew", "lufiume86": "Bene !", "brigitte.peeters.100": "Please smile a little!", "chaudhary_shivam1": "Are u fine ???", "intense_retard": "Shut up bitch", "davidmdq___": "Hairline? Gone.", "glennfry71": "So there's you going around the world spreading it, well done", "val_jsoares": "Fantoche...🤹‍♀️", "__mafiaboss__": "are you drunk girl? 😂", "mehrshad_masaebi": "Greta,plant trees around the world,as much as you can.don't just speak.act.", "nj1904": "Same i recovered yesterday", "daeriusz": "@sangram.2006 Still think that she's hot? @fuckedup.comments", "officialtanishq_05": "Tu maregi", "peta.ashlee": "Greta is sick, but it's not from COVID 19....she has a nasty case of NARCISSISM & energy vampirism.👹🤮🦈", "patienciaoguzhan": "You'll be very good again and say How Dare you ❤️ Sending love to you from Turkey 🇹🇷", "inquisitor_jotun": "ALIEN", "sihirbazbaykus": "kardeşim bu nasıl poz ya şafak sezer gibi bakmışın amk", "vladimirorlovmgn": "Приезжайте к нам в деревню Аскарово РБ Башкортостан Россия . Тесты делают всем желающим .Бесплатно!!!!", "margarettuomi": "Thank you for all your work and sensible advice.... from a 68 year old👏.", "sussilundberg": "🤗🙏🏽♥️", "allyundich_": "@sunnylenski", "gbgmobile": "Hope Greta get well soon. She is our hope for the better world.", "shernelmonteiro": "If everyone were responsible as you the world would be a better place", "gstarr8583": "Gotta make sure you stay in the public eye aye. Attention seeker", "joe.clod": "Woof", "manmohan5965": "hi", "sankaranarayanavanni": "❤️❤️❤️❤️", "andres.taxi": "Siganme porfavor, yo apoyo mucho a greta", "igor.akanov": "😂😂похуй.", "espindola.bjj": "stole my dreams this year", "samgo2006": "You probably have cornavirus", "askilledshot69": "damn thought she was gonna die", "_.p4trick._": "One more good thing corona virus did to help us", "raymond.novosel": "You didn’t have the corona virus dipshit", "besquare": "Wise words as always ☀️ Thank-you 🏡", "singular_jen": "Shut up chicken dipper", "jeremy_hubbard_": "I have been sick for the last couple of weeks too <3 Greta <3. I don't know what it was but it lasted about 2 weeks. I was very tired, sore throat, upset stomach, and would wake up breathing heavily. At the peak I had chest pains and slight shortness of breath. No fever or cough though, so not sure if it was Covid-19. very limited testing here too. I am glad you and your family are feeling well. https://youtu.be/8XJkEu8iGqo", "tyessia14": "Keep it up ✊✊", "myrz8929": "❤️❤️❤️❤️❤️❤️", "edverbeke": "So glad you and your Dad are OK!", "talesfrompurgatory": "I hope your dad is also feeling better. Thank you for this message", "marysabbia": "@gretathunberg attention getter Greta...OF COURSE YOU HAVE IT TOO???..YOU LIL NWO DEVIL CHILD!!!", "ottostricker": "❤️", "erichartman42": "I don’t care piss off", "tessashmessa_": "Is your dad okay Greta?", "jlander79": "FEEL BETTER QUEEN", "kathmaas": "Thank you for being such a great role model of how to be a good citizen! Hope your dad is better soon.", "mistermcdaunting": "It's is sorta sad, that your super power, i.e. common sense and a certain ability for insight, is so rare these days, that we need it that bad. On the other hand I am really glad that we have you.", "terrahenry": "You are bat shit crazy!!! Attention seeking asshole.", "johannapannajonsson": "Fina Greta! Ta inte åt dig av de trångsynta människorna som inte ser dig för den fantastiska, starka individ du är ❤️ ditt inlägg är informativt, och som du antyder är det ingen som kan vara riktigt säker på om man bär på smittan eller inte, vare sig man har starka eller milda symtom. Hoppas att du och din pappa mår bättre nu, och att du fortsätter med det du gör! 💚💚💚", "sam_james1445": "Dumb b****", "bukreiev": "Good news. Stay at home and shut up. Do your homework, little kid.", "wiekendbveiwndbbd": "Is it true you have ass burgers?", "riding9high": "@gretathunberg maybe if you went out into the public you could scare the SHIT out the Covad-19", "vincent_lee_the_awesome": "A small price to pay for salvation", "crgurkin": "Lol you have aspergers", "eiderussell": "Does this kid's bullshit ever stop? Your 15 minutes are over!!", "charleydepenning": "good job", "lysa.del.rey": "Did anyone else read this in her voice", "piaspictures": "💚💚💚💚💚", "oskarikarki_": "HOW DARE YOU?", "__its.saraaaa": "Ja lul @martin_chaeli_nullviaer @jonas.x33 Finderdes au kuuuhl?🐮", "ffspyre": "kys", "natandias": "I had the same symptoms. Here in Brazil the tests is also only to urgent cases.", "biblioteca_paco_pinas": "Hi Greta, from Guatemala we send you our love.", "chantalvonlanthen": "Yes, this message is the most important if you get symptoms: first isolate yourself and get medical advice if needed!@gretathunberg if she really had COVID19 with symptoms starting from March 14, this means that she probably got it on Brussels Demo!!!!!!! 😢Congrats for organizing a super spreading event....", "wendyandreesen": "What a crock! Who wrote this script? #repent", "factcombo": "Follow factcombo for interesting and unique facts❤️❤️❤️ fact Lovers and also take a serious action to combat climate change", "james_potter": "..", "ritaericson.veterinaria": "👏👏👏👏", "lucas_flisbeck": "@filip_johansson_2k7", "amaliesophieskj": "@adamchebli læs", "sannenorbjerglarsen": "Stay home, safe lives ❤️ get well soon ❤️", "chiefnez2": "So true thank you", "cinimod37": "Glad you are better Greta xx", "mgkujo": "Ok but when did I ask", "kesth21": "Haters", "arkaaaadius": "But I really hope that you'll get it", "kaori.fineart": "If you've had it are you immune; or does it come in waves?", "jojucledako": "Und nun?????", "ritikatripathee": "Spoiled kid . Get a life rather than seeking attention .", "juliannesmallwood": "I hope your dad is ok 👌", "miloke2007": "Bruh", "alban_147": "Facebook ALBAN zhuta Facebook ALBAN zhuta King ring när du är på väg hem nu ska vi se om", "theealmightyy": "You should cut 10 cents of her for overacting", "tony_time_ufc": "🤢", "zarareeed": "girl stfu", "mrs_g_arrhen": "🤗"}